{
  "game_id": "0022300076",
  "espn_id": "401584704",
  "date": "Oct 26, 2023",
  "matchup": "PHX @ LAL",
  "headline": "LeBron James keys Lakers' 4th-quarter rally for 100-95 win over Kevin Durant's short-handed Suns",
  "body": "LOS ANGELES -- — When Kevin Durant scored in the final minutes, LeBron James answered. These two generational basketball greats put on a scintillating duel in their first head-to-head matchup in nearly five years.\n\n\r\n              Although Durant was better in the first three quarters, he eventually had to concede he couldn't do it alone.\n\n\r\n              James didn't have to.\n\n\r\n              Anthony Davis had 30 points and 13 rebounds, James scored 10 of his 21 points while playing the entire fourth quarter, and the Los Angeles Lakers blew past Phoenix in the final minutes for a 100-95 victory over the short-handed Suns on Thursday night.\n\n\r\n              James made the tiebreaking layup with 1:11 to play for the Lakers, who rallied from a 12-point deficit entering the fourth to get their first victory of the new season in the home opener of James' 21st NBA campaign.\n\n\r\n              The 35-year-old Durant finished with 39 points and 11 rebounds while moving into 12th place on the NBA's career scoring list.\n\n\r\n              But James, who reigns atop that list, stepped up with back-to-back layups in the final 90 seconds to seize the win in another memorable meeting.\n\n\r\n              “We've had so many battles, (and) we don't have many matchups left,” the 38-year-old James said. “Not sure how many we have left, so you don't ever want to take it for granted when you're out there with such a great player, one of the best to ever play this game. It's always a treat. It's fun.”\n\n\r\n              Durant nearly carried the Suns to an improbable victory with no help from injured Devin Booker and Bradley Beal, but James was ever-so-slightly more clutch while also adding nine assists and eight rebounds.\n\n\r\n              “There were a few moments where you just appreciate what the fans are watching,” said Phoenix coach Frank Vogel, who has coached both superstars. “Two of the game’s greats just going head to head. Some collisions out there. The level of competition for Game 2 of the NBA season was super-high. Felt like a playoff game out there. A boxing match. A slugfest. ... To see those two guys out there fighting for it was pretty special.”\n\n\r\n              Durant and James have been friends since Durant’s senior year of high school 17 years ago, but they improbably hadn’t faced each other on an NBA court since Christmas 2018. Injuries, load management and health and safety protocols prevented them from playing in the previous 13 meetings between James’ Lakers and Durant’s Warriors, Nets and Suns.\n\n\r\n              “Someone you just compare yourself to,” Durant said. “If you could accomplish and achieve some of the stuff that he’s done, you’re doing pretty solid for yourself. It’s just a baseline for yourself as a player to see how great you can be.”\n\n\r\n              While James was good, he wasn't totally responsible for how the Suns flailed down the stretch without Booker or Beal to take the focus off Durant. Phoenix led 84-72 entering the fourth, but missed 13 of its next 14 shots and committed 10 turnovers in the next 10 minutes.\n\n\r\n              Durant still tied it at 91 with 1:28 to play by scoring on two straight possessions. With his final bucket, he passed Hakeem Olajuwon for 12th place on the scoring list.\n\n\r\n              But James replied with two baskets sandwiching a missed 3-pointer by Durant. Austin Reaves and Davis hit free throws in the final seconds to ice it for LA.\n\n\r\n              James is entering his third NBA decade with the Lakers determined to limit his minutes for health optimization, yet Los Angeles struggled mightily whenever James was off the court in the first half. James and coach Darvin Ham decided to throw out the plan for one night because the Lakers had all of their timeouts to maximize the freshness of James, who said he felt great after playing only 23 minutes in the first three quarters.\n\n\r\n              “It was tough,” Durant said. “He was pretty much coaching the team on how to guard certain actions. That’s what he’s been doing his whole career. ... It’s always a battle playing against high-IQ players like that.”\n\n\r\n              Eric Gordon added 15 points in Suns coach Vogel's first trip back to face the Lakers, who fired him 18 months ago after three seasons and one NBA title.\n\n\r\n              Booker sat out with left foot soreness after tweaking his foot late in his 28-point performance against Golden State on Tuesday. Beal still hasn't made his Suns debut due to lower back tightness.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Utah on Saturday.\n\n\r\n              Lakers: At Sacramento on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996675.69792
}