{
  "game_id": "0022400352",
  "espn_id": "401704918",
  "date": "Dec 08, 2024",
  "matchup": "ORL vs. PHX",
  "headline": "Suggs scores 26 and Magic turn back Suns for 10th straight win at home",
  "body": "ORLANDO, Fla. -- — Jalen Suggs scored 14 of his 26 points in the fourth quarter on Sunday night and the Orlando Magic beat the Phoenix Suns 115-110 to remain the NBA's only team unbeaten at home this season.\n\n\r\n              Magic center Goga Bitadze had 21 points and a career-high 16 rebounds, including a game-clinching tip-in with 13.1 seconds left.\n\n\r\n              Devin Booker led the Suns with 25 points and seven assists. Tyus Jones added 21 points and Bradley Beal scored 18 before fouling out with 1:05 remaining.\n\n\r\n              Cole Anthony, who finished with 14 points, and Mo Wagner (10 points) sparked a comeback after the Magic had fallen behind by 12 points in the first quarter.\n\n\r\n              Takeaways\r\n              Suns: Even after making 11 of their first 18 3-point shots, the Suns faded in the fourth quarter (seven turnovers) and lost for the ninth time in 10 games without the injured Kevin Durant.\n\n\r\n              Magic: Playing without forwards Paolo Banchero and Franz Wagner — both out with torn obliques — the Magic won for the 10th straight time at home. They are 17-0 on their home court, including the playoffs, going back to March 30.\n\n\r\n              Key moment\r\n              Suggs hit two 3-pointers and scored eight points in a fourth-quarter span of 1:47, giving the Magic a 103-100 lead they never relinquished. \n\n\r\n              Key stat\r\n              The Magic played 10 players for at least 15 minutes and got 46 points from their bench.\n\n\r\n              Up next\r\n              Suns: Play at Utah on Friday night.\n\n\r\n              Magic: Play at Milwaukee on Tuesday night in a first-round NBA Cup knockout game.\n\n\r\n              ------\n\n\r\n              This story has been changed to correct that Bitadze had 21 points instead of 19.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997565.608242
}