{
  "game_id": "0021500722",
  "espn_id": "400828609",
  "date": "Feb 01, 2016",
  "matchup": "DET @ BKN",
  "headline": "Drummond, Jackson help Pistons edge Nets 105-100",
  "body": "NEW YORK -- Reggie Jackson was nearly on the bench, his coach believing he was being beaten by cramps.\nInstead, Jackson battled through it to beat the Nets.\nAndre Drummond had 21 points and 18 rebounds, Jackson scored 19 points, and the Detroit Pistons beat Brooklyn 105-100 on Monday night.\nJackson had been listed as questionable to play because of dehydration but started and played 31 minutes, making huge plays during the last of them.\n\"He was cramping up, that's why he came out in the third quarter and I was about to take him out before that stretch at the end because he just looked like he was about dead,\" coach Stan Van Gundy said. \"I was about to take him out and then he made every play down the stretch.\"\n\nDrummond fell just shy of an NBA-high sixth 20-point, 20-rebound game of the season but delivered the tiebreaking basket on a dunk with 1:30 remaining on a pass from Jackson. Jackson added a couple of clutch jumpers as the Pistons avoided a third straight loss.\nHe had been so weakened after the last game that he remained overnight in Toronto after a loss on Saturday.\n\"I'm just a little bit banged up but I'm still out there playing, competing, so no excuses,\" Jackson said. \"Everybody's dealing with something at this point.\"\nThe Pistons were coming off losses to Cleveland and Toronto, the East's top two teams, but were just good enough to get by the Nets, one of the worst.\n\"We played the top teams in the East and it kind of set the bar for ourselves,\" Drummond said. \"We have a little more work to do but we can definitely beat them.\"\nBrook Lopez scored 27 points for the Nets, who have lost four in a row. He got a couple bad breaks on the same play in the closing seconds, when he appeared to be trying to foul Drummond intentionally just before getting a piece of Jackson's floater went in to clinch it.\n\"I didn't do a great job with Drummond. He got some easy ones,\" Lopez said. \"I tried to wrap him up at the end of the game, making him earn it at the line. But it was something that was a focus tonight.\"\nAndrea Bargnani added 18 points off the bench for the Nets, who were outscored 28-7 on second-chance points.\n\"That was the game,\" Nets interim coach Tony Brown said. \"Drummond is a load. That was one area where we fell short tonight.\"\nBrooklyn led by three before Jackson tied it with a 3-pointer with 2:05 to go. He finished with six assists, while Ersan Ilyasova scored 16 points.\nIn a game that featured 21 lead changes and 12 ties, the Nets led 63-58 early in the third quarter before Detroit answered with a 17-2 run, capped by Drummond's slam on a lob from Brandon Jennings, to go ahead 75-65.\nDrummond made all five shots in the third quarter and had 10 points and eight rebounds in the period.\nTIP-INS\nPistons: Drummond finished 10 of 15 from the field and took just three free throws, making one. ... Drummond had his NBA-leading 21st game this season with 15 points and 15 rebounds and the 59th of his career. Bill Laimbeer had 61 such games, most by a Piston since the 1985-86 season.\nNets: Backup point guard Shane Larkin had eight points, a career-high 14 assists and six rebounds. ... Lopez finished one point shy of a career-best third straight game with 28 points.\nDISAPPOINTED BY THE DEFENSE\nVan Gundy was critical of his team's defensive performance, particularly after it opened the big lead in the third quarter.\n\"We're not playing defense, we're just not,\" he said. \"We played eight minutes, nine minutes of pretty good defense today. We're just not defending. So it's frustrating, I'm not happy with it, I'm angry about it, but it's just not changing. So I don't know what we're going to have to do, but we're not a good defensive team.\"\nUP NEXT\nPistons: Visit Boston on Wednesday.\nNets: Host Indiana on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994915.3830311
}