{
  "game_id": "0022400212",
  "espn_id": "401704778",
  "date": "Nov 11, 2024",
  "matchup": "CHI vs. CLE",
  "headline": "Mitchell scores 36 as the Cavs beat the Bulls 119-113 for 12th straight win",
  "body": "CHICAGO -- — Donovan Mitchell scored a season-high 36 points, and the Cleveland Cavaliers beat the Chicago Bulls 119-113 on Monday night to become the eighth NBA team to begin a season with 12 straight wins.\n\n\r\n              Darius Garland scored 17 points for Cleveland, and Evan Mobley had 15 points and 11 rebounds. The Cavaliers scored at least 110 points for the 11th time.\n\n\r\n              Garland rolled in a layup with 24 seconds left, and Mitchell made two free throws to help close it out.\n\n\r\n              Zach LaVine scored 26 points for Chicago, which lost for the fifth time in six games. Coby White and Nicola Vucevic each had 20 points.\n\n\r\n              The Bulls opened a nine-point lead with 4:26 left in the third quarter before Cleveland bounced back late for a second straight game.\n\n\r\n              Takeaways\r\n              Cavaliers: Rallied again, just like they did in a 105-100 win over Brooklyn on Saturday They got a big lift from their reserves; Georges Niang, Ty Jerome and Caris LeVert each scored 12 points.\n\n\r\n              Bulls: Point guard Lonzo Ball (right wrist sprain) is no longer wearing a brace and is expected to start drills that include dribbling.\n\n\r\n              Key moment\r\n              Mobley’s alley-oop layup put Cleveland up 52-42 with 7:18 left in the second quarter, and it looked as if the Cavs were ready to pull away. But the Bulls bounced back with a 14-2 run to take 56-54 lead.\n\n\r\n              Key stat\r\n              Chicago committed 20 turnovers, compared to just eight for Cleveland. \n\n\r\n              Up next\r\n              The Cavaliers play in Philadelphia on Wednesday, while the Bulls face the Knicks in New York.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997109.129256
}