{
  "game_id": "0022201079",
  "espn_id": "401469234",
  "date": "Mar 21, 2023",
  "matchup": "BKN vs. CLE",
  "headline": "Mitchell has big slam, 31 points as Cavs beat Nets 115-109",
  "body": "NEW YORK -- — Donovan Mitchell glanced hopefully up at the overhead videoboard, realizing his sensational slam dunk deserved a second look.\n\n\r\n              He wasn't going to get it in Brooklyn.\n\n\r\n              “I was trying to see it but I forgot we’re on the road,” Mitchell said, “so they’re definitely not going to show it.”\n\n\r\n              No problem. It's all over the internet.\n\n\r\n              Mitchell also had five 3-pointers and scored 31 points, and the Cleveland Cavaliers opened a big lead in the third quarter and held on for a 115-109 victory over Nets on Tuesday night.\n\n\r\n              Caris LeVert added 18 points for the Cavaliers in the opener of a two-game series. Cleveland led by only six after a competitive first half, but quickly blew it open in the third en route to its seventh win in nine games. \n\n\r\n              The Cavs opened a 24-point lead and Mitchell's slam over Yuta Watanabe came with the Nets desperately hoping to get back into it early in the fourth. \n\n\r\n              Mitchell eventually saw a replay when he got back to the locker room, but the 2018 All-Star Slam Dunk champion wasn't certain if he agreed with his teammates who felt it was his best ever.\n\n\r\n              “It’s up there,” Mitchell said. “I don’t know if it’s my best one, but it’s definitely up there.” \n\n\r\n              Darius Garland and Evan Mobley each added 17 points, and Jarrett Allen returned from a four-game absence with a right eye injury with 12 points and 14 rebounds. \n\n\r\n              Day'Ron Sharpe had 20 points and 11 rebounds off the bench for the Nets, who lost their fourth straight game. Spencer Dinwiddie had 19 points and 11 assists, and Mikal Bridges scored 18 points.\n\n\r\n              The teams play again Thursday night to complete what could be a postseason preview. The Cavaliers are solidly in fourth place in the Eastern Conference, nearing their first playoff berth since 2018 in LeBron James’ final season in Cleveland, and their first without him on the roster since 1998.\n\n\r\n              The Nets came in just two games behind the New York Knicks for fifth, but now are only a half-game ahead of Miami for seventh, which would mean having to get through the play-in round. \n\n\r\n              Mitchell and Garland converted consecutive three-point plays to give Cleveland eight straight points to start the second half and a 69-55 lead. Mitchell later opened and closed an 11-0 burst with 3-pointers, pushing the lead to 84-60 midway through the third.\n\n\r\n              “Again, it’s along those lines of putting four quarters together, it always seems like there’s one quarter that really punches us in the gut a little bit,” Nets coach Jacque Vaughn said. “So we've got to be able to sustain throughout all those runs.”\n\n\r\n              Watanabe's turnover early in the fourth sent the Cavs on a fast break, and Mitchell punctuated the sequence by pulling the ball back high over his right shoulder and slamming it down over Watanabe, who had rushed back to defend.\n\n\r\n              “It’s a play, but for us we’re looking for something a little bit bigger,” Cavs coach J.B. Bickerstaff said. \n\n\r\n              The Nets got it down to five in the final minute, but had too far to climb against a team that came in allowing the fewest points per game in the NBA.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Mitchell returned to the locker room in the first quarter because his stomach was bothering him. ... Garland made one 3-pointer to break a tie with Danny Ferry (543) for ninth place on the Cavaliers' career list. ... Cedi Osman was 4 for 4 behind the arc for 12 points. \n\n\r\n              Nets: Cam Johnson scored 16 points and Nic Claxton had 13. ... The Cavaliers were the last Eastern Conference team to play in Brooklyn this season. \n\n\r\n              REMEMBERING REED\n\n\r\n              There was a moment of silence before the game for Hall of Famer Willis Reed, who died Tuesday at 80. After winning two championships as a player with the New York Knicks, Reed both coached and was an executive for the Nets in New Jersey, drafting Derrick Coleman and Kenny Anderson to build a playoff team in the 1990s.\n\n\r\n              HIGH PRAISE\n\n\r\n              Vaughn had high praise for a couple Cavs who played for him in Brooklyn, calling Allen “one of the smartest bigs I’ve ever been around” and saying LeVert has “another level to his game and when playoffs comes around, he’ll take it to another level.”\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994850.445219
}