{
  "game_id": "0022000072",
  "espn_id": "401267232",
  "date": "Jan 01, 2021",
  "matchup": "BKN vs. ATL",
  "headline": "Hunter, Young lead Hawks to 114-96 win over Nets",
  "body": "NEW YORK -- — The Atlanta Hawks are among the NBA’s youngest, most exciting, and highest-scoring teams.\n\n\r\n                    Turns out they are pretty adept at learning lessons, too.\n\n\r\n                    Two nights after blowing a fourth quarter lead to Brooklyn, the Hawks maintained their discipline and focus in defeating the Nets 114-96 Friday. \n\n\r\n                    “I don't evaluate guys on just making shots,” Atlanta coach Lloyd Pierce said. “The ability to compete, to not be out of position, to be effective and efficient offensively, that's most important. ... I think if you're making the right plays and you're competing at a high level, that's how I try to evaluate our guys.\"\n\n\r\n                    De’Andre Hunter scored 23 points to lead Atlanta, which had six players score in double figures and improved to 4-1. Trae Young scored 21 points and John Collins added 20 for Atlanta.\n\n\r\n                    “We have a ton of weapons on the floor,” Pierce said. \n\n\r\n                    As does Brooklyn, which left first year coach Steve Nash lamenting both its offensive and defensive performance.\n\n\r\n                    “Our defense can be a lot better,” Nash said. “We have to get better offensively.”\n\n\r\n                    Even though Kevin Durant scored 28 points and Kyrie Irving had 18 points and 11 rebounds, the Nets have lost three of four. \n\n\r\n                    The Nets came back to beat the Hawks on Wednesday night in a 145-141 thriller. The Hawks ensured Brooklyn would not rally this time.\n\n\r\n                    Atlanta led 61-52 at halftime and extended the advantage to 89-73 at the end of the third quarter. The Hawks pushed the lead to 100-80 early in the fourth quarter.\n\n\r\n                    “Our attention to detail,” defensively pleased Collins. Atlanta held Brooklyn to 40.7% shooting from the field (35 for 86) and 18.9% (7 for 37) from 3-point range.\n\n\r\n                    “This really helps our growth to see the mistakes we made (in the last game) and play the same team, which is going to do similar things, and really learn from it,\" he said. \"I feel that was it. We locked into the small things.”\n\n\r\n                    That helped facilitate their offensive attack. The Hawks finished with 46.2% shooting from the field (43 for 93) and knocked down 41% of their 3s (16 for 39).\n\n\r\n                    “We were scrambling,” said Joe Harris, who scored 12 points for the Nets. “We know what we have to clean up.”\n\n\r\n                    Added Jeff Green: “We got away from our principles. ... We allowed the offense to dictate the defense.”\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Nash is concerned with his team's rebounding early in the season. The Nets are seventh in the league with 37.2 rebounds per game, but rank 13th in offensive rebounding at 10 per game. Reserve Jarrett Allen is Brooklyn's top rebounder, entering Friday with an average of 12 per game.\n\n\r\n                    “Gang rebounding has got to be habitual for us,” Nash said. “We’re going to struggle there until we’re really good at gang rebounding in my opinion.”\n\n\r\n                    Hawks: Pierce was pleased with his team's offensive efficiency despite Wednesday night's loss.\n\n\r\n                    “I think 92 of 99 shots last game were either in the paint or 3(s), so that’s tremendous. If we can continue to keep our turnovers low and if we can continue to play ball movement and body movement, I think we’ll stay with high-efficient shots,” Pierce said.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Host Cleveland on Saturday night.\n\n\r\n                    Nets: Host Washington on Sunday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997524.719854
}