{
  "game_id": "0022201193",
  "espn_id": "401469348",
  "date": "Apr 05, 2023",
  "matchup": "MIL vs. CHI",
  "headline": "Bucks wrap up top seed in NBA with 105-92 victory over Bulls",
  "body": "MILWAUKEE -- — Wrapping up the top seed in the NBA playoffs was the order of business for the Milwaukee Bucks on Wednesday night.\n\n\r\n              Despite being without the injured Giannis Antetokounmpo and losing Khris Middleton to an injury early in the game, the Bucks made a second-half push to beat the Chicago Bulls 105-92. The Bucks went on a 15-0 run in the third quarter to overcome a 10-point deficit and pulled away in the fourth quarter.\n\n\r\n              Bobby Portis had 27 points and 13 rebounds, starting in place of Antetokounmpo, and center Brook Lopez finished with 26 points. \n\n\r\n              “It's definitely a great achievement,\" Lopez said. “It's cool because we've had a lot of different lineups throughout the year, and regardless of who we've put out on the floor, our guys have come out with the right mindset and have been going out there to succeed.”\n\n\r\n              Antetokounmpo was ruled out before the game because of right knee soreness. He had 28 points, 11 rebounds, 10 assists against Washington on Tuesday night.\n\n\r\n              Point guard Jrue Holiday scored 20 points and had a season-high 15 assists while adding eight rebounds, and he led the second-half surge. Jevon Carter had 16 points in a starting role.\n\n\r\n              Middleton started for the Bucks, but played just eight minutes before exiting with right knee soreness. He was 0 for 3 from the floor.\n\n\r\n              Milwaukee improved to 58-22 as it won its third straight game. The Bucks lead fellow Eastern Conference foe Boston by three games with two games remaining.\n\n\r\n              Wes Matthews played 30 minutes off the bench and harassed Bulls forward DeMar DeRozan throughout the game, helping limit DeRozan to eight points on 3-of-12 shooting. He did not score a basket until early in the fourth quarter.\n\n\r\n              “He's one of the best scorers this league has seen,” Matthews said. \"We've been battling for 14 years now and he;'s one of my favorite players to play against, one of my favorite players to watch.\n\n\r\n              “The biggest thing is to try to keep him off the free throw line, try to make him as uncomfortable as possible. He's got an array of moves. You have to be willing to take that challenge.”\n\n\r\n              DeRozan said of his poor shooting night, “It won't happen again. I guarantee you.”\n\n\r\n              Nikola Vucevic led the Bulls with 21 points and 11 rebounds. Coby White added 14 points, and Zach LaVine had 13.\n\n\r\n              The Bulls started the night in 10th place in the East and already having clinched a play-in berth. They will not be able to move up during the final two games after Atlanta won on Wednesday. Toronto lost in Boston but remains two games ahead of the Bulls with two to play, and the Raptors own the tiebreaker.\n\n\r\n              Chicago led, 61-51, when Bucks coach Mike Budenholzer took a timeout with 8:30 left in the third quarter. Milwaukee outscored the Bulls, 54-31, the rest of the way.\n\n\r\n              “We've talked about the defensive abilities of our players,” Budenholzer said. “They turned it up, really everybody.”\n\n\r\n               The Bucks coach said claiming the top seed in the East was no small matter.\n\n\r\n              “Night in and night out in this league, it's hard,” Budenholzer said. \"To have the best record, it is something that matters and is important. But being our best day each night is what we talk about the most.\n\n\r\n              “Now we get to take a breath. I have no idea what we're going to do Friday and Sunday. The guys have earned it. Ton of a credit to the guys for what they've done since the all-star break to put themselves in this position.”\n\n\r\n              TIP-INS\n\n\r\n              Bulls: Guard Alex Caruso was ruled out with a left foot injury, a problem he has dealt with in recent weeks. Caruso played 19 minutes and went scoreless in Chicago’s home loss to Atlanta on Tuesday night. “He doesn’t want to be a liability,” Bulls coach Billy Donovan said.\n\n\r\n              Bucks: Pat Connaughton sprained his right ankle in the first quarter Tuesday and was out Wednesday. “We’re hopeful it’s a very short-term thing,” Budenholzer said. “I would put it in the relatively positive bucket.” … Grayson Allen (right ankle sprain) is out for the rest of the regular-season, but Budenholzer remains hopeful the guard will be ready for the first round of the playoffs which open April 15.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Dallas on Friday night.\n\n\r\n              Bucks: Host Memphis on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994902.192721
}