{
  "game_id": "0022200064",
  "espn_id": "401468219",
  "date": "Oct 26, 2022",
  "matchup": "LAL @ DEN",
  "headline": "Jokic, Nuggets keep Lakers winless with 110-99 victory",
  "body": "DENVER -- — A LeBron James-led team doesn't begin 0-4 often. Not since his rookie season has one of his teams stumbled out of the starting gate quite like this.\n\n\r\n              “It’s a new system. It's a new group of guys together,” James explained. “We’re still trying to get familiar with one another.” \n\n\r\n              Nikola Jokic had 31 points and 13 rebounds, Jamal Murray hit a big 3-pointer and the Denver Nuggets kept the Los Angeles Lakers winless with a 110-99 victory Wednesday night.\n\n\r\n              The Lakers remain in the company of Orlando and Sacramento as the only teams yet to win this season. \n\n\r\n              “We’re four games and it sucks to lose, but we have 78 games left,” new Lakers coach Darvin Ham said. “It’s plenty of time for us to right the ship. And it starts now.”\n\n\r\n              Trailing by two moments into the second half, the Nuggets went on a 29-9 to grab control. The Lakers worked their way back and cut it to single digits in the fourth, but Murray hit a 3-pointer — his only one in seven attempts — for some breathing room. \n\n\r\n              Anthony Davis, dealing with lower back tightness, had 22 points and 14 rebounds for Los Angeles. LeBron James had 19 points to run his double-digit streak to 1,100 games. Russell Westbrook was held out to rest a sore left hamstring.\n\n\r\n              Jokic finished an assist shy of a triple-double. But it was the 31 points that caught Bruce Brown by surprise. He had no idea the back-to-back MVP erupted for that many.\n\n\r\n              “It was a quiet 31,” cracked Brown, who finished with 18 points, including four 3-pointers. “Nobody can guard him.”\n\n\r\n              For his big night, Jokic looks no further than James, who motivated him to keep laser focused.\n\n\r\n              “LeBron is the best player on the planet,” Jokic said. “I like to compete with the best.\"\n\n\r\n              Struggling with his long-range jumper, Murray found his touch in close and finished with 13 points. He showed flashes of his explosiveness as he works his way back from a knee injury. He also received an early pep talk from coach Michael Malone.\n\n\r\n              “I just walked over to him in the huddle, gave him a big hug and said, ‘Hey, man, big picture. I believe in you. I love you. I know who you are, and I know where you’re going to be at some point,'\" Malone said.\n\n\r\n              Late in the third quarter, the Nuggets saw Kentavious Caldwell-Pope turn his left ankle on a layup and leave for the locker room. He had 13 points.\n\n\r\n              It’s been a tough start for Lakers, who entered the game as the worst-shooting squad in the NBA. They shot 44.4% from the field against Denver.\n\n\r\n              It’s also been a tough beginning for Ham, the player-turned-coach who was brought on board over the summer after serving as an assistant in Milwaukee. Ham picked up a technical in the fourth quarter for arguing a call.\n\n\r\n              “Not really about any other team right now, scouts or schemes — just going out there and doing it for 48 minutes to get a win,” Davis said. “Whatever we've got to do. That’s the first step. We can build on that.”\n\n\r\n              TIP-INS\n\n\r\n              Lakers: Ham said the team will take a precautionary route with Westbrook's hamstring. ... Lonnie Walker IV had 15 points. ... James started 0-5 with Cleveland in 2003-04.\n\n\r\n              Nuggets: F Michael Porter Jr. was out with what the team called “lumbar spine injury management.” ... Colorado Avalanche captain Gabriel Landeskog was in the crowd. He's recovering from knee surgery.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Minnesota on Friday night.\n\n\r\n              Nuggets: Host Utah on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994157.246502
}