{
  "game_id": "0022200113",
  "espn_id": "401468268",
  "date": "Nov 02, 2022",
  "matchup": "MIL vs. DET",
  "headline": "Bucks match franchise record with 7th win to open season",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 32 points and 12 rebounds and the Milwaukee Bucks matched a franchise record with their seventh straight win to open the season, beating the Detroit Pistons 116-91 on Wednesday night.\n\n\r\n              Milwaukee’s 7-0 season-opening run matches the starts of the 2018-19 and 1971-72 teams.\n\n\r\n              “I’m happy that the team is winning, but that’s like second,” Antetokounmpo said. “I’m happy that the team is building good habits. I’m happy that we can be good even if we don’t make shots, that it doesn’t affect us. We still play hard, we still move the ball. Guys are not talking by themselves, we talk to one another. We are in a very good place.”\n\n\r\n              Jrue Holiday, who was uncertain to play because of a non-COVID-19 illness, added 26 points for the NBA’s only undefeated team. Jordan Nwora scored 12 off the bench.\n\n\r\n              “I think some of it’s mental,” Holiday said. “Knowing that, through a winning streak, you don’t always look pretty. I think that sometimes you make mistakes, you still come out with the outcome that you want. I feel like that builds confidence, knowing that you can go into any game and really feel like you can win any game any type of way.”\n\n\r\n              Four Pistons scored in double-figures, led by Saddiq Bey’s 22 points. Isaiah Stewart finished with 16 points and 10 rebounds. Bojan Bogdanovic added 14 points and Cade Cunningham 10.\n\n\r\n              Antetokounmpo has scored 30 or more points in six consecutive games. \n\n\r\n              “It feels like he’s playing a lot of different places and playing with just a good rhythm and really an unselfish heart and it’s coming back to him,” Bucks coach Mike Budenholzer said. “Good things are happening.”\n\n\r\n              The two-time MVP tallied 15 of the Bucks’ 31 first-quarter points against Detroit.\n\n\r\n              “A guy like him, when he sees a few baskets go in, he starts to get hot,” Stewart said. “And for us defensively, we don’t want that, so praise to him for getting going.”\n\n\r\n              The Bucks shot only 26.3% on 3-pointers, but outscored the Pistons 56-30 in the paint and outrebounded them 52-35.\n\n\r\n              The Bucks led for nearly the entire first half despite shooting 2 for 21 from long distance. They outscored the Pistons 34-14 in the paint and led 56-47 at halftime. Milwaukee increased its lead in the second half.\n\n\r\n              “Finding other ways, the offensive rebounding, created some turnovers, played really good defense,” Budenholzer said. “It’s early in the year, but we want to be able to win different ways. Some nights you’re just not going to make shots or make 3s. You can’t just crawl into a hole and go home, you’ve got to find other ways to win.”\n\n\r\n              The Bucks have avoided defeat even though Khris Middleton and Pat Connaughton haven’t seen the court. Middleton is recovering from offseason wrist surgery and Connaughton has a strained right calf.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Rookie C Jalen Duren missed a second straight game. He sprained his left ankle Sunday in a win over the Warriors.\n\n\r\n              Bucks: F-C Sandro Mamukelashvili missed the game and was being evaluated for a concussion. ... Two-way G AJ Green underwent surgery Tuesday to repair his fractured nose, an injury he sustained during practice with the Wisconsin Herd on Friday. He is expected to be sidelined for about three weeks.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host the Cleveland Cavaliers on Friday. \n\n\r\n              Bucks: At the Minnesota Timberwolves on Friday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994605.554781
}