{
  "game_id": "401810136",
  "espn_id": "401810136",
  "date": "Nov 23, 2025",
  "matchup": "PHX vs SA",
  "headline": "Suns win 3rd straight and end Spurs' 3-game run with 111-102 victory",
  "body": "PHOENIX -- — Dillon Brooks scored 25 points, Devin Booker had 24 and the Phoenix Suns won their third straight and ended the San Antonio's three-game streak with a 111-102 victory over the Spurs on Sunday night.\n\n\r\n              Playing without injured regulars Jalen Green, Grayson Allen and Ryan Dunn, Phoenix, got big contributions from Jordan Goodwin (15 points, 10 rebounds) and center Mark Williams. Collin Gillespie added 15 points.\n\n\r\n              De’Aaron Fox led San Antonio, playing without the injured Victor Wembanyama, with 26 points. The Spurs won their previous three games, all without Wembanyama, who will be out at least another week with a left calf strain. \n\n\r\n              Devin Vassell had 17 points, reserve Kelton Johnson had 14 and Julian Champagnie finished with 12 points and 12 rebounds.\n\n\r\n              San Antonio also was missing starting forward Stephon Castle because of a left hip flexor strain and rookie Dylan Harper, the second overall draft pick who remains out with a left calf strain.\n\n\r\n              Green (right hamstring strain), Allen (quadriceps) and Dunn missed the game for Phoenix. Dunn injured his right wrist incurred on a missed dunk attempt Friday night in a comeback win over Minnesota.\n\n\r\n              The Suns trailed by 11 in the second quarter, but outscored the Spurs 37-24 in the third to take an 86-80 lead. Booker had 11 points in the period. \n\n\r\n              Phoenix bounced back from missing its first nine 3-pointers to finish 14 of 38 (36.8%) from behind the arc.\n\n\r\n              Up next\r\n              Spurs: At Portland on Wednesday night.\n\n\r\n              Suns: Host Houston on Monday night, with former Suns star Kevin Durant set to miss the game because of personal reasons.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042684.504732
}