{
  "game_id": "0021800290",
  "espn_id": "401070971",
  "date": "Nov 25, 2018",
  "matchup": "TOR vs. MIA",
  "headline": "Leonard has 29, Raptors win 5th straight, top Heat 125-115",
  "body": "TORONTO --  Kawhi Leonard delivered his sixth double-double for the surging Toronto Raptors, and added an unusual first, too.\n\nLeonard had 29 points and 10 rebounds, Kyle Lowry added 12 points and 10 assists, and the Raptors won their fifth straight game, beating the Miami Heat 125-115 on Sunday night.\n\nAfter going 421 games without one, Leonard picked up the first regular-season technical foul of his career for arguing a non-call on his drive to the basket late in the third quarter.\n\n\"It was just kind of getting out of hand with some of the calls out there,\" Leonard said. \"They're doing the best job they can but some of the calls tonight, I felt like I got fouled pretty hard.\"\n\nLeonard was asked whether he thought his outburst was deserving of a technical foul.\n\n\"Definitely,\" he said. \"You work so hard in this game to try and win a game or score the basketball and when you don't get your calls, it's very difficult when someone blatantly fouls you.\"\n\nJonas Valanciunas had 17 points and 10 rebounds, and Pascal Siakam scored 21 points, two shy of his career high, as the Raptors improved their NBA-leading record to 17-4.\n\nDwyane Wade scored a season-high 35 points, the most ever by a Miami bench player.\n\n\"It's a shame that kind of game is wasted on a loss,\" Heat coach Erik Spoelstra said.\n\nJosh Richardson scored 19 points and Bam Adebayo had 16 points and a career-high 21 rebounds, but the Heat lost for the seventh time in nine games.\n\n\"The rebounds don't matter unless you come out with a W,\" Adebayo said.\n\nToronto is 11-0 against teams with losing records.\n\nAhead 63-54 at halftime, Toronto opened the third quarter with an 11-3 spurt, leading to a Miami timeout. The Raptors' onslaught continued when play resumed, and Spoelstra was forced to call time again with 7:11 remaining in the period, with his team trailing 88-62.\n\n\"That beginning of the third quarter was very uninspiring,\" Spoelstra said. \"Two timeouts and I looked up and it's 26. I was shocked, I couldn't believe how fast it went.\"\n\nMiami recovered before the end of the quarter, but trailed 101-89 heading to the fourth.\n\nThe Heat cut the gap to eight points in the final quarter but Toronto used a 7-0 spurt to pull away for good, a sequence that included a three-point play from Siakam and a long 3-pointer by Lowry with the shot clock running out.\n\n\"We got down early in the third quarter by too many points to try and come back on the road versus the best team in the Eastern Conference,\" Wade said.\n\nLeonard scored 11 points in the first as the Raptors led 36-29, the fifth straight game Toronto has been ahead at the end of the opening quarter. The Raptors are 13-1 when leading after 12 minutes.\n\nTIP-INS\n\nHeat: G Goran Dragic (right knee) missed his fourth straight game. ... G Tyler Johnson (right hamstring) sat for the third straight game. ... F Justise Winslow played despite being listed as questionable because of a sore right quadriceps. Winslow had nine points in 30 minutes. ... Wade shot 13 for 22, including 4 for 7 from 3-point range. He scored almost half of Miami's 71 bench points.\n\nRaptors: Toronto made 15 of 20 field goal attempts in the first. ... Serge Ibaka scored eight points off the bench, failing to reach double figures for the first time in 18 games. It was the second-longest streak of his career. ... Toronto is 11-0 when shooting 50 percent or better from the field. ... The Raptors, who made a season-high 17 3-pointers in Friday's win over Atlanta, shot 11 for 35 from long range against Miami.\n\nFOLLOW THE LEADER\n\nLeonard responded to comments from former coach Gregg Popovich, who said Saturday that Leonard was not a team leader in San Antonio.\n\n\"It's just funny to me because I don't know if he's talking about last year or not, but I guess when you stop playing they forget how you lead,\" Leonard said.\n\nPLAYING CAREFUL\n\nMiami didn't have a turnover in the first half, the first time in team history the Heat have gone an entire half without turning the ball over. They finished with seven.\n\nSHIRT OFF HIS BACK\n\nLowry and Wade swapped jerseys after the game. \"He's a future Hall of Famer,\" an appreciative Lowry said. \"It'll go up in my house. I'll have a couple of stories I can tell to my kids a long time from now.\"\n\nUP NEXT\n\nHeat: Host Atlanta on Tuesday night.\n\nRaptors: Visit Memphis on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994287.20222
}