{
  "game_id": "0021500126",
  "espn_id": "400828013",
  "date": "Nov 12, 2015",
  "matchup": "PHX vs. LAC",
  "headline": "Knight, Bledsoe lead Suns past short-handed Clippers",
  "body": "PHOENIX --  While the Los Angeles Clippers' starting guards could only sit and watch, their Phoenix Suns counterparts had a big night.\n\nBrandon Knight matched his career high with 37 points, Eric Bledsoe fell an assist shy of his second career triple-double and the Suns rolled past the severely depleted Clippers 118-104 on Thursday night.\n\nBledsoe had 26 points, 10 rebounds and nine assists.\n\n\"Our guards played great tonight,\" Phoenix coach Jeff Hornacek said.\n\nThe Clippers' guards didn't play at all.\n\nChris Paul (groin strain) and J.J. Redick (lower back spasms) sat out. To make matters worse, Blake Griffin was ejected after drawing his second technical foul with 2:36 left in the first half.\n\nThat left Los Angeles without its top three scorers the rest of the way.\n\nJamaal Crawford had 18 points and Wesley Johnson added 14 for the Clippers.\n\n\"There are no excuses there,\" Los Angeles guard Austin Rivers said. \"We need them (Paul, Redick and Griffin). That is obvious, but we are a deep enough team where we can win without them. We had bad spirit tonight.\"\n\nKnight shot 6 of 10 on 3-point attempts.\n\n\"Whenever you have a night like that, you're happy,\" Knight said, \"but as long as we win, that's what counts. That's the biggest factor. You could have 37, 35, but if you don't win, it doesn't matter.\"\n\nT.J. Warren matched his career best with 18 points for Phoenix, 14 in the second half.\n\nBledsoe had a great chance at that 10th assist in the final seconds when he found Jon Leuer inside, but the big forward missed the layup.\n\n\"Having a triple-double, it would have been fun,\" Bledsoe said, \"but at the end of the day it's bigger than me having a triple-double, it's about the win.\"\n\nPhoenix snapped an eight-game losing streak against the Clippers.\n\nThe Suns' starting backcourt of Bledsoe and Knight outscored the Clippers' replacement guards Rivers and Pablo Prigioni 63-17.\n\nImmediately after Griffin's ejection, the Suns went on a 9-1 run to end the half with a 58-49 advantage. They broke it open by taking a 25-point lead in the third quarter.\n\nAfter Los Angeles cut the lead to 15 in the fourth, Hornacek put Knight back in the game, and that allowed him to match the career best he set against the Los Angeles Lakers on Dec. 31, 2013.\n\nGriffin and the Suns' Mirza Teletovic were called for double-technicals with 7:02 to play in the first half. Less than 5 minutes later, Griffin apparently said something to the referee and was whistled for his second \"T\" and the ejection.\n\nThat left Los Angeles without three players averaging a combined 58 points per game.\n\n\"I just thought it was awful,\" Clippers coach Doc Rivers said of Griffin's second technical. \"He didn't say enough.\"\n\nBANGED-UP BACKCOURT\n\nRedick was pronounced out of the game well before tipoff but Paul was a game-time decision. Both were hurt in the team's 118-110 loss to Dallas on Wednesday night.\n\nAustin Rivers, son of the coach, started in place of Redick. Prigioni was the point guard in place of Paul.\n\nPaul is the team's second-leading scorer at 15.7 points per game. He is averaging eight assists. Redick is the Clippers' third-leading scorer at 14.8 points per game.\n\nAILING SUNS\n\nThe Suns had two injured players, too.\n\nStarting forward Markieff Morris went to the locker room with a sprained left knee in the first quarter and did not return. Ronnie Price ran into DeAndre Jordan's elbow in the second quarter and was knocked to the court. He got up shaking his head and left to undergo the mandatory concussion protocol.\n\nTIP-INS\n\nClippers: The Clippers have lost four of five. ... Paul has missed two of Los Angeles' nine games. Redick hadn't missed any before Thursday night. ... Jordan was 5 of 13 from the free throw line.\n\nSuns: As the second half of a TNT doubleheader, the game tipped off at 8:52 p.m., local time. ... Phoenix last beat the Clippers on Dec. 30, 2013, in Los Angeles. ... Tyson Chandler ranks second in field goal percentage (59.1) with the minimum of 2,000 field goals made. Artis Gilmore holds the record at 59.9 percent.\n\nUP NEXT\n\nClippers: Home against Detroit on Saturday.\n\nSuns: Home against Denver on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994885.201364
}