{
  "game_id": "0021501132",
  "espn_id": "400829019",
  "date": "Apr 01, 2016",
  "matchup": "TOR @ MEM",
  "headline": "DeRozan, Lowry lead Raptors past Grizzlies 99-95",
  "body": "MEMPHIS, Tenn. -- The Toronto Raptors are showing increased maturity as they continue to strive for the top spot in the Eastern Conference.\nThe developing characteristic showed Friday night as the Raptors pulled away just enough in a tightly contested battle to defeat the Memphis Grizzlies 99-95.\n\"It all comes with experience. Understanding what it takes to win,\" said guard DeMar DeRozan, who led the Raptors with 27 points. \"Tonight was a great test for us.\"\nAfter the victory, many of the Raptors watched the end of Cleveland's 110-108 overtime victory over the Atlanta Hawks, groaning as the Hawks' Al Horford missed a 3-pointer at the end.\nWith both the Cavaliers and Raptors winning, Toronto remained 2 1/2 games behind Cleveland for the top seed in the conference.\nMeanwhile, Memphis' fifth straight loss left the fifth-seeded Grizzlies a game up on Portland, the sixth seed in the West.\n\"My heart breaks,\" said Memphis coach Dave Joerger, who is cobbling together lineups as best as possible through key injuries. \"I thought we had played hard enough to win, and these guys deserve the reward they have been working their tails off for.\"\nKyle Lowry added 22 points for Toronto, and the Raptors got a fourth-quarter boost from Terrence Ross, who scored all 12 of his points in the final period, converting four 3-pointers.\nJonas Valanciunas had 11 points, 14 rebounds and a career-best seven blocks as the Raptors won their second straight and third in the past four. Norman Powell scored 14 for Toronto.\nZach Randolph led seven Memphis players in double figures with 16 points. Jordan Farmar, Lance Stephenson and Xavier Munford each had 12 points.\nThe game featured 14 lead changes and 11 ties, and neither team led by more than five points in the fourth quarter.\nRoss provided a small cushion for the Raptors with consecutive 3-pointers near the 9-minute mark. He added a third for nine straight Raptors points.\nDespite Ross' scoring in the quarter, Memphis was still within one at 89-88 after Randolph converted a pair of free throws with 2:53 left.\nValanciunas made two free throws and a layup by Lowry gave Toronto its largest lead of the game at 93-88.\n\"That was huge down the stretch,\" Raptors coach Dwane Casey said of Valanciunas hitting all six of his free throws in the final 2:36. \"And, again (he has) 14 rebounds.\"\nMemphis would get close a time or two, but could never overtake the Raptors as the Grizzlies continue to struggle to reach the postseason.\n\"It sounds redundant, but we just have to stay the course and continue to just fight,\" said Vince Carter, one of three Grizzlies to score 10 points. \"No one said it's going to be easy, and I think everyone understands that.\"\nMemphis connected on its first 10 shots in the second quarter to erase an early deficit and build its advantage to 11 before carrying a 53-45 lead into intermission.\nBut the Grizzlies had trouble holding the lead and the ball immediately after halftime, and the Raptors steadily whittled into the advantage -- helped by Memphis miscues -- carrying a 74-72 lead into the fourth.\nCasey said the ability to hold on as Memphis pushed in the fourth was an example of the change in the Raptors' approach.\n\"That's what we've been trying to do for the past three or four years -- develop a winning culture and learning habits,\" Casey said. He later added: \"I think that we are getting there, and we are taking the steps in the right direction.\"\nTIP-INS:\nRaptors: F Luis Scola missed his second straight game with a sore left knee. ... DeRozan has led the Raptors in scoring in each of the past seven games. ... Valancunius recorded his 20th double-double. ... Toronto matched its franchise record of road wins in a season with 22. ... Toronto shot 42 percent, compared to 41 percent for Memphis. The Raptors are 39-1 when they outshoot opponents.\nGrizzlies: Memphis outscored Toronto 38-26 in the paint. ... The Grizzlies' five-game losing streak is its longest of the season. ... Munford's previous season high (also his career high in points) was nine. ... Carter still ranks second on Toronto's career scoring list.\nHELLO, MY NAME IS: Memphis signed G Bryce Cotton to a 10-day contract earlier Friday. Cotton, who did not play, becomes the 28th player to dress for the Grizzlies this season, an NBA record.\nUP NEXT\nRaptors: At San Antonio on Saturday\nGrizzlies: At Orlando on Sunday",
  "source": "espn_api",
  "crawled_at": 1764994692.459239
}