{
  "game_id": "0022400977",
  "espn_id": "401705543",
  "date": "Mar 16, 2025",
  "matchup": "PHX @ LAL",
  "headline": "Luka Doncic scores 33, Lakers snap their 4-game skid with a 107-96 win over the Suns",
  "body": "LOS ANGELES -- — Luka Doncic had 33 points, 11 rebounds and eight assists, and the Los Angeles Lakers snapped their four-game losing streak with a 107-96 victory over the Phoenix Suns on Sunday.\n\n\r\n              Austin Reaves scored 28 points and Jaxson Hayes matched his season high with 19 for the Lakers, who returned from an 0-4 road trip to extend their home winning streak to seven games.\n\n\r\n              Kevin Durant scored 21 points and Devin Booker had 19 for the 11th-place Suns, who missed a chance to gain ground on Dallas for the West's final play-in spot after the Mavericks lost at Philadelphia. Phoenix remained 1 1/2 games behind Dallas with a game in hand.\n\n\r\n              LeBron James (left groin strain) missed his fourth straight game, but coach JJ Redick said the top scorer in NBA history is “ramping up” toward a return.\n\n\r\n              Lakers starter Rui Hachimura (knee) also missed his ninth straight game, but Doncic (ankle) returned after sitting out Friday's loss in Denver, as did Hayes, Dorian Finney-Smith and Gabe Vincent.\n\n\r\n              Takeaways\r\n              Suns: A rough shooting game and their usual unimpressive defense were a bad combo. Durant and coach Mike Budenholzer also had another animated huddle exchange, this time while Phoenix was falling behind by 20 in the first quarter.\n\n\r\n              Lakers: They fell three spots in the West during their road trip, and their current stretch is brutal with seven games in 10 days, including five at home in seven days. With Doncic and Reaves healthy, they can compete until James returns.\n\n\r\n              Key moment\r\n              Phoenix trimmed its deficit to 100-92 with less than two minutes left, but Finney-Smith buried a 3-pointer to seal it.\n\n\r\n              Key stat\r\n              Durant, Booker and Bradley Beal went a combined 2 of 12 on 3-point attempts. Phoenix was 9 of 41 overall.\n\n\r\n              Up next\r\n              Both teams finish a back-to-back Monday. The Suns host the Raptors, and the Lakers host the Spurs.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998329.8011708
}