{
  "game_id": "0022000513",
  "espn_id": "401267673",
  "date": "Feb 27, 2021",
  "matchup": "CLE @ PHI",
  "headline": "Sexton, Garland help Cavaliers upset 76ers 112-109 in OT",
  "body": "PHILADELPHIA -- — Collin Sexton flashed three fingers on each hand as he walked off the court a winner and simply said “that's game.”\n\n\r\n                    And who saw that game coming for Cleveland?\n\n\r\n                    Yes, the Cavaliers rebounded from a 10-game losing streak with wins against lowly Atlanta and Houston. But undermanned — and arguably outmatched — Sexton, Darius Garland and Isaac Okoro helped grind out an upset.\n\n\r\n                    “You're going to see these type of moments again,” Okoro said.\n\n\r\n                    Sexton scored 28 points, Garland had 25 and the feisty Cavaliers beat the East-best Philadelphia 76ers 112-109 in overtime on Saturday night.\n\n\r\n                    The Cavaliers earned their first road win since Jan. 7 at Memphis and No. 4 on the season. They got one against a Sixers team that built the best record in the Eastern Conference (22-12) on the strength of a 14-2 mark at home.\n\n\r\n                    Make it 14-3.\n\n\r\n                    “Any time you get a tough win like this, it validates what you’re capable of,” Cavs coach J.B. Bickerstaff said.\n\n\r\n                    Okoro scored the first three points of OT and had 15 when he fouled out. The Cavs led by three and turned the ball over only for Ben Simmons to get whistled for an offensive foul. Garland hit a floater for a five-point lead and the 11-point underdog Cavaliers were on their way to their third straight win.\n\n\r\n                    Joel Embiid had 42 points and 13 rebounds for Philadelphia. Simmons scored 24. \n\n\r\n                    “That's a win we've got to get,” Simmons said.\n\n\r\n                    Sexton hit a 3 late in regulation that put the Cavs ahead 92-90, but Embiid answered with a tying dunk. The score went back-and-forth all quarter and the Cavs had a chance to win late. Sexton missed a long 3 coming out of a timeout and Matisse Thybulle grabbed the defensive rebound. Embiid missed a step-back 15-footer with one second left and the game went into OT tied 92-all.\n\n\r\n                    Embiid, who seems good for one injury scare a game, sure enough came up limping late in the first quarter. He stayed in the game after a timeout and promptly passed out of a double team to Danny Green for a 3.\n\n\r\n                    Embiid’s ability to draw fouls — he’s been accused of flopping — at an elite level continued against the Cavs. Embiid let out an “ahhh!” as he tangled with JaVale McGee and went to the line. McGee was whistled for three fouls in 1 minute that led to four made free throws by Embiid, and Jarrett Allen also had three fouls by halftime. Embiid was 11 of 12 from the line in the half; the Cavs just 10 of 13.\n\n\r\n                    Sixers coach Doc Rivers yelled, “Wake up! Let’s go!” with the Sixers down 39-30. The Sixers needed time to snap out of their slumber.\n\n\r\n                    ”We were running our offense like it was a walkthrough,\" Rivers said.\n\n\r\n                    Embiid and Simmons carried the Sixers in the first half and combined to score 33 of their 47 points. The other three starters scored just seven points and the Cavs led 56-47 at the break. \n\n\r\n                    The Cavaliers ran and ran after Sixers’ misses and scored 17 fast-break points in the half. \n\n\r\n                    The Sixers shook off a 13-point hole and got rolling in the third, in large part because Embiid and Simmons had help from the bench. Mike Scott hit a 3 that pulled them within one. Shake Milton hit the floater that tied it at 65. \n\n\r\n                    The Cavs pushed the pace and shut down every Sixer outside of Embiid and Simmons to get a win they hope will prove better days are ahead.\n\n\r\n                     “Are we there yet? No, we’re not finished,” Bickerstaff said. “But we’ve got to continue to answer the bell when tested.”\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: Andre Drummond again sat out for “personal reasons” as the Cavs look into a trade. .... Matthew Dellavedova, still out because of the effects of a concussion, made the trip. He also recently had his appendix removed.\n\n\r\n                    76ers: Tobias Harris, who averages 20.2 points, sat out with a bruised right knee. Furkan Korkmaz got the start. ... Simmons reached 4,000 career points. ... Embiid had his 16th 20-point, 10-rebound game of the season. ... Seth Curry shot 1 of 13 and scored four points.\n\n\r\n                    2-0\n\n\r\n                    The Cavs also beat the 76ers 118-94 on Dec. 27, 2020.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Play Monday at Houston.\n\n\r\n                    76ers: Host Indiana on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997881.5210712
}