{
  "game_id": "0021300555",
  "espn_id": "400489428",
  "date": "Jan 13, 2014",
  "matchup": "MIL @ TOR",
  "headline": "Lowry scores 23 points, Raptors beat Bucks 116-94",
  "body": "TORONTO --  Strong on offense and physical on defense, the Toronto Raptors are hardly the same team that Bucks coach Larry Drew remembers from years past.\n\nKyle Lowry scored 23 points, Jonas Valanciunas had 17 points and 10 rebounds, and Toronto beat Milwaukee 116-94 on Monday night to hand the Bucks their sixth straight loss.\n\nThe Atlantic Division leaders won for the eighth time in nine games and moved ahead of idle Atlanta into third place in the Eastern Conference standings.\n\n\"Right now they're certainly a different team than they've been in the last two or three years,\" Drew said. \"They've added some real solid pieces that give them a lot of stability. They're very, very deep.\"\n\nDeMar DeRozan added 19 points, Patrick Patterson 18 and John Salmons 10 as Toronto snapped a five-game home slide against the Bucks, beating them in Toronto for the first time since Jan. 22, 2010.\n\n\"They played a much more physical game than we did and we just didn't respond to it,\" Drew said.\n\nErsan Ilyasova scored a season-high 29 points, Brandon Knight had 16 and Giannis Antetokounmpo 11 for the Bucks, winless since beating the Lakers in Los Angeles on New Year's Eve. The NBA's worst team at 7-30, Milwaukee has lost 14 of 16 overall.\n\nPatterson said the Raptors wanted to impose their style on the struggling Bucks.\n\n\"We just wanted to jump on them from the start,\" he said. \"We wanted to trap and be all up on them, give them no room to breathe and limit their offensive rebounds.\"\n\nIt worked, as the Raptors won their second straight over Milwaukee after losing the previous 10 meetings.\n\n\"This Toronto team, they're a good team,\" Drew said. \"They're solid across the board at every position. Their bench is a very productive bench. They really get after you. They've got guys that can make shots.\"\n\nThe victory gave Toronto its first five-game home winning streak since Dec. 14, 2012, to Jan. 2, 2013. At 19-17, the Raptors are two games above .500 for the first time since March 9, 2010, when they were 32-30.\n\nThe Raptors improved to 12-4 since Patterson and the three other players acquired from Sacramento in a trade for Rudy Gay made their debuts.\n\n\"Since the trade, I think everyone has been buying more into defense, concentrating on more than worrying about outscoring opponents,\" Patterson said. \"Everyone is buying into the system, everyone is moving the ball on the offensive end. Whenever we talk and communicate on the defensive end, we have nights like we had tonight.\"\n\nThe offense has also been better since Gay's departure, thanks to vastly improved ball movement. Against Milwaukee, DeRozan led the Raptors with seven assists.\n\n\"He's pinpointing the passes,\" said an appreciative Lowry. \"All I've got to do is catch and shoot.\"\n\nBucks forward Khris Middleton struggled for the third straight game, making just one of eight field goal attempts and finishing with two points. Middleton has made only five of 29 shots from the floor over his past three games.\n\nLowry scored 10 points in the first as the Raptors used a 19-5 run over the final 3:45 of the quarter to lead 38-24 after one. Toronto went 15 for 15 from the free throw line in the first.\n\n\"Coming into this game, one of the things we talked about was trying to control the tempo of the game,\" Drew said. \"Right off the bat, first quarter, we had seven turnovers. I think they just about capitalized on every turnover that we had.\"\n\nToronto missed its only free throw attempt of the second quarter, and Ilyasova scored 10 points for the Bucks -- five during a 14-4 run to close the half as Milwaukee cut the gap to 58-50 at the break.\n\n\"We had our moments, but we just couldn't sustain on either end,\" Drew said.\n\nLowry had 11 points in the third and DeRozan added eight as the Raptors overcame eight points from Ilyasova to take an 88-73 lead into the fourth.\n\nGame notes Milwaukee is 45-24 against Toronto, its best record against any opponent. ... Drew said he spoke to his entire team about controlling emotions after C Larry Sanders was ejected for elbowing Oklahoma City's Steven Adams on Saturday. ... Raptors F Tyler Hansbrough (left ankle) missed his sixth straight game. ... Toronto recalled G Dwight Buycks from Bakersfield of the D-League. ... Newly signed Toronto FC players Michael Bradley and Jermain Defoe watched from courtside seats.",
  "source": "espn_api",
  "crawled_at": 1764992773.964237
}