{
  "game_id": "0022201013",
  "espn_id": "401469168",
  "date": "Mar 11, 2023",
  "matchup": "PHX vs. SAC",
  "headline": "Kings use late run, stellar bench to push past Suns 128-119",
  "body": "PHOENIX -- — Harrison Barnes scored 19 points, De'Aaron Fox and Malik Monk each added 18 and the Sacramento Kings used a balanced effort to beat the Phoenix Suns 128-119 on Saturday night.\n\n\r\n              The loss snapped Phoenix's four-game winning streak. The Kings moved 3 1/2 games ahead of the Suns for the No. 3 seed in the Western Conference playoff race.\n\n\r\n              The Kings finished the game on a 13-4 run. Seven Sacramento players scored at least 12 points. Domantas Sabonis had 17 points and a team-high eight rebounds.\n\n\r\n              Sacramento's bench combined for 65 points on 20-for-33 shooting. \n\n\r\n              “A lot of guys were able to contribute tonight,” Kings center Chimezie Metu said. “We've got a lot of good players on the bench. We have been consistent since I have been here with our starting lineup and guys just know what their rolls are and are ready to go in and impact the game, whether it is on the defensive end or going out there like Malik (Monk) did tonight.”\n\n\r\n              The Suns were playing their second straight game without recently acquired star Kevin Durant, who hurt his ankle during pregame warmups before Wednesday's game. The team says he has a sprained left ankle and will be re-evaluated in three weeks.\n\n\r\n              Devin Booker scored 28 points on 11-for-19 shooting for Phoenix. Deandre Ayton had 22 points and 12 rebounds, and Chris Paul added 16 points and 16 assists.\n\n\r\n              “We had so many ‘My bads’ and blown coverages, it just stacked against us,” Suns coach Monty Williams said. “You couple that with them having 36 free throws, then they made some 3s. It was too many holes for us to dig out of tonight.”\n\n\r\n              Sacramento took a 67-59 lead into halftime. Trey Lyles led the Kings with 11 points, while Booker led the Suns with 17. The foul-filled half had 41 free throw attempts, including 26 by the Kings.\n\n\r\n              TIP-INS\n\n\r\n              Suns: Durant has played in three games with the Suns, all on the road. Phoenix has a 3-0 record in those games. ... Williams was not pleased with the way his bench played, particularly since the Kings' bench was so productive.\n\n\r\n              “Our bench came in tonight and the game plan was not there, from the jump,” Williams said. “We were fouling, Lyles came in and hit 3s. Monk got going in the second half. We didn’t have a high level of respect for their bench.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: Travel to face Milwaukee on Monday.\n\n\r\n              Suns: Travel to face Golden State on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995063.344438
}