{
  "game_id": "0021900613",
  "espn_id": "401161255",
  "date": "Jan 15, 2020",
  "matchup": "LAL vs. ORL",
  "headline": "Magic snap Lakers' 9-game winning streak in 119-118 thriller",
  "body": "LOS ANGELES --  Markelle Fultz faked LeBron James off his hip, weaved through traffic in the waning seconds and scored the final bucket of his phenomenal triple-double performance.\n\nFultz then dropped to the court with a cramp. The Orlando Magic rushed to their valuable teammate's aid, with Nikola Vucevic swiftly stretching out Fultz's foot to make sure he could finish.\n\n\"It was the biggest play of the game!\" Vucevic said with a laugh.\n\nFultz had several bigger ones, and so did a half-dozen contributors to what was likely the Magic's best win of the season.\n\nFultz hit two big layups in the final minute while scoring 21 points during his second career triple-double, and Orlando snapped the Los Angeles Lakers' nine-game winning streak with a 119-118 victory Wednesday night.\n\nFultz added 11 rebounds and 10 assists, while Aaron Gordon had 21 points and a late go-ahead basket as the Magic became the first sub-.500 team to beat the Western Conference-leading Lakers this season despite blowing a 21-point lead in the second half.\n\nJames had 19 points and matched his career high with 19 assists, but he also missed a tying 3-pointer with 3 seconds left. The Lakers showed off their impressive depth in the absence of Anthony Davis, but they couldn't overcome the Magic's superb contributions from up and down the roster.\n\n\"I think it just shows how deep this team goes, how much we believe in each other and what we're capable of,\" Fultz said. \"We have guys out, but our mindset was the same going into the game. We all believed we had a chance to win this game, and we relied on each other.\"\n\nThe Magic played without injured regulars Evan Fournier, Michael Carter-Williams and D.J. Augustin in their third stop on a six-game road trip, but they've rarely looked better.\n\nWes Iwundu scored a career-high 19 points while starting in Fournier's place, and Vucevic scored seven of his 19 points in the fourth quarter of the Magic's eighth win in 12 games.\n\nFultz said the final minutes were \"what I've dreamed of,\" and the Magic were thrilled to see it come true for the up-and-down former No. 1 overall pick.\n\n\"Boy is nice, and he's only going to get better,\" Gordon said. \"He did a great job just running the show, settling them down, getting good shots. And then down the stretch, he took over.\"\n\nQuinn Cook hit a 3-pointer at the buzzer to finish with a season-high 22 points, but the Lakers (33-8) hit the halfway point of their regular season with their first loss since Christmas.\n\nTroy Daniels added a season-high 17 points, but the Lakers finally failed to overcome the absence of Davis, who missed his fourth straight game with a bruised backside.\n\n\"We've just got to be better,\" James said. \"We didn't start the game out the right way, but I'm not disappointed in anybody or anything that we did. Our bench was the reason there was a game at the end, but they came in and produced everything we needed.\"\n\nKentavious Caldwell-Pope also scored 17 points for the Lakers in their final home game before a five-game road trip while the Grammy Awards take over Staples Center.\n\nThe Lakers erased an 87-66 deficit early in the fourth quarter with an impressive rally, but the Magic answered and traded big scores down the stretch. Gordon's basket with 2:03 left reclaimed the lead for Orlando.\n\nCook and James hit late 3-pointers that trimmed the Magic's lead to one point, but Fultz drove for a clutch layup with 15 seconds left to put Orlando up 118-115, and James' tying attempt didn't go down.\n\n\"We wanted to finish this homestand out the right way, but those guys made plays,\" Cook said. \"Being the Lakers, we get everybody's best shot. Markelle made two tough, tough plays at the end.\"\n\nCook and Fultz both graduated from the famed DeMatha Catholic High School in Maryland. Cook referred to Fultz as his \"little brother.\"\n\nTIP-INS\n\nMagic: Fournier's unavailability was determined shortly before game time. ... Augustin sat out for the second time in three games with a bruised left knee. ... Carter-Williams has missed 12 straight games with a sprained left shoulder.\n\nLakers: G Rajon Rondo missed his second straight game with a broken right ring finger. ... Frank Vogel coached the Magic for two seasons from 2016-18. His first team in Los Angeles has already won more games than the Magic won in either of his two seasons there. ... Dwight Howard had nine points and 16 rebounds.\n\nWILD SWINGS\n\nOrlando jumped to a 20-point lead in the second quarter. The Magic had seven players with at least seven points in their exuberant first half.\n\nThe Lakers trimmed their deficit to seven points at halftime, but then gave up a 21-4 run by the Magic. The Lakers responded with a 28-6 rally, but couldn't finish.\n\nCARUSO INJURED\n\nAlex Caruso went to the locker room after he got accidentally smacked in the face while stealing the ball from Mo Bamba in the second quarter. A concussion evaluation was inconclusive, and the valuable backup guard didn't return. He will be re-evaluated Thursday.\n\nBIG GAME\n\nIwundu was outstanding for Orlando while starting in place of Fournier, who sat out with a bruised right quadriceps. The speedy guard surpassed his previous career high early in the third quarter.\n\nUP NEXT\n\nMagic: Stay at Staples Center to face the Clippers on Thursday.\n\nLakers: Visit the Houston Rockets on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995994.038267
}