{
  "game_id": "0022400278",
  "espn_id": "401704844",
  "date": "Nov 25, 2024",
  "matchup": "TOR @ DET",
  "headline": "Ivey hits buzzer-beating jumper to give Pistons 102-100 win over Raptors",
  "body": "DETROIT -- — Jaden Ivey hit a jumper as time expired to give the Detroit Pistons a 102-100 victory over the Toronto Raptors on Monday night.\n\n\r\n              The Raptors took a 98-96 lead on RJ Barrett's 3-pointer with 1:47 left, but Ivey's driving layup tied it with 1:07 to go.\n\n\r\n              After both teams missed, Isaiah Stewart got free for a go-ahead dunk, but Scottie Barnes hit a layup in traffic to make it 100-100 with 22.3 seconds to play.\n\n\r\n              The Pistons called a timeout to set up the play. Ivey ran the clock down before driving past Ochai Agbaji for an off-balance jumper from the right baseline. \n\n\r\n              Ivey finished with 25 points as the Pistons broke a three-game losing streak.\n\n\r\n              Barnes led the Raptors with 31 points and Barrett added 17.\n\n\r\n              Takeaways\r\n              Raptors: Barnes scored 20 points in the first half on 8-for-16 shooting including 3 of 8 on 3-pointers. The other four Raptors starters combined for eight points on 2-for-15 shooting, including 0 for 5 on 3-pointers. Toronto managed a 48-48 tie at halftime thanks to 20 points from the bench.\n\n\r\n              Pistons: Cade Cunningham (hip) missed his second straight game, but Ausur Thompson returned after missing eight months with blood-clotting issues. Thompson, who last played on March 9, received a loud ovation from the crowd when he checked in late in the first quarter.\n\n\r\n              Key moment\r\n              The Pistons led 26-11 with four minutes left in the first quarter, but the Raptors went on a 29-9 run over the next 10 minutes to take a 40-35 lead midway through the second.\n\n\r\n              Key stat\r\n              Toronto dominated the rebounding battle, especially in the second half. They finished with 23 offensive rebounds to Detroit's six. In the second half, they rebounded 53% of their own missed shots and 71% of Detroit's misses.\n\n\r\n              Up next\r\n              Both teams return to action on Wednesday night. The Pistons are in Memphis while the Raptors visit New Orleans.\n\n\r\n              ----\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996986.932757
}