{
  "game_id": "0022300782",
  "espn_id": "401585410",
  "date": "Feb 14, 2024",
  "matchup": "TOR vs. IND",
  "headline": "Siakam scores 23 against former team as Pacers beat Raptors 127-125 heading into All-Star break",
  "body": "TORONTO -- — Tyrese Haliburton had 21 points and 12 assists, Pascal Siakam scored 23 against his former team and the Indiana Pacers beat the Toronto Raptors 127-125 on Wednesday night.\n\n\r\n              Isaiah Jackson added 15 points and 11 rebounds, Obi Toppin scored 15 and Andrew Nembhard had 14 as the Pacers bounced back from Monday’s loss at Charlotte.\n\n\r\n              Siakam, traded from Toronto to Indiana last month, said he felt good after picking up the victory in his first trip back north of the border.\n\n\r\n              “You don’t want to come here and lose,” Siakam said. “That was a thing on my mind. Everyone was telling me, ‘I’m so happy to see you,’ but in my head I was like, ‘I’ve got to get a win, man. I can’t lose this game.’ Definitely feels good to get a win.”\n\n\r\n              Scottie Barnes had 29 points and 12 rebounds, and Jakob Poeltl added 19 points and 11 boards for the Raptors. Barnes finished with eight assists, narrowly missing a triple-double.\n\n\r\n              Barnes missed a shot with 39 seconds left in the fourth quarter that would have given Toronto a 125-124 lead. Siakam answered by scoring with 25 seconds remaining to give Indiana a three-point edge.\n\n\r\n              Poeltl cut it to 126-125 by making two free throws with 14.7 seconds to go. Jackson made one of two at the other end, giving the Pacers a two-point lead with 9.5 seconds left. RJ Barrett’s driving shot at the buzzer didn’t fall as the Raptors lost their third straight.\n\n\r\n              “Ben Sheppard tonight, particularly in the fourth quarter, was a difference-maker,” Pacers coach Rick Carlisle said. “Shot-making, defense, the stop on the last play.”\n\n\r\n              Raptors coach Darko Rajakovic said he called for a 3-pointer on the final possession.\n\n\r\n              “Watching the film now, I think that the pass was probably there, but we just did not execute it the way we wanted,” Rajakovic said.\n\n\r\n              Barrett scored 23 points, Immanuel Quickley had 14 and Bruce Brown, acquired in last month’s trade involving Siakam, scored 12 against his former team.\n\n\r\n              Doug McDermott had 13 points and Sheppard scored 10 for the Pacers, who are 14-14 on the road.\n\n\r\n              The Raptors set season highs with 84 points in the paint and 40 fast-break points.\n\n\r\n              Toronto fans opened a set of four straight home games last Friday by welcoming former Raptors guard Fred VanVleet back as Houston visited. They closed it on Valentine’s Day in an emotional reunion with Siakam, who was honored with a video tribute during pregame introductions. Raptors players applauded and the crowd gave Siakam a standing ovation.\n\n\r\n              “It definitely means a lot,” Siakam said. “I’m humbled. I couldn’t really imagine that kind of reception. Thank you. Thanks to everyone.”\n\n\r\n              The two-time All-Star arrived at his postgame news conference dressed in a special Valentine’s Day outfit of pink pants, a pink jacket and a pink winter hat.\n\n\r\n              Indiana’s Benedict Mathurin was not available because of an illness and a bruised right knee. Pacers center Myles Turner also sat out because of an illness, while Jalen Smith missed his third straight game because of back spasms.\n\n\r\n              The Pacers lost forward Aaron Nesmith early in the second half when he fell hard on a drive to the basket and had to be helped to the locker room. Carlisle said Nesmith injured his lower right leg, possibly the ankle, and would have imaging done Thursday to confirm the injury.\n\n\r\n              “It looked very scary,” Carlisle said. “He’s in good spirits. He did walk off the court with some help. Hopefully it’s not a long-term thing.”\n\n\r\n              Toronto’s Kelly Olynyk was scoreless in seven minutes in the first half. He didn’t return after the break because of a sore lower back.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Will host Detroit on Feb. 22.\n\n\r\n              Raptors: Will host Brooklyn on Feb. 22.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995408.8961332
}