{
  "game_id": "0022300017",
  "espn_id": "401584105",
  "date": "Nov 14, 2023",
  "matchup": "MIA @ CHA",
  "headline": "Butler scores 32, Heat beat Hornets 111-105 to remain unbeaten in NBA In-Season Tournament play",
  "body": "CHARLOTTE, N.C. -- — Jimmy Butler scored a season-high 32 points, Bam Adebayo had 21 points and 11 rebounds and the Miami Heat remained unbeaten in NBA In-Season Tournament play with a 111-105 victory over the short-handed Charlotte Hornets on Tuesday night.\n\n\r\n              Duncan Robinson added 18 points for Miami, which has scored 113.8 points per game during its six-game win streak. The Heat averaged 102.4 while stumbling to a 1-4 start this season.\n\n\r\n              No wonder Butler offered a simple explanation for the Heat’s turnaround.\n\n\r\n              “We’ve been scoring more points,” Butler said.\n\n\r\n              Miami is 2-0 in group play; the Hornets are 1-1.\n\n\r\n              The Heat finished off a 4-0 road trip that included wins against San Antonio, Atlanta and Memphis. But they still have a big challenge ahead. Miami returns home Thursday night, then heads back on the road for another five games.\n\n\r\n              “We talked at the start of this trip that this month would be an opportunity for us to be able to galvanize around a tough schedule and see if we can become better,” Heat coach Erik Spoelstra said. “It's always harrowing on the road, but we have found different ways to win.\"\n\n\r\n              P.J. Washington had 32 points and six of Charlotte’s season-high 15 3-pointers in the loss. LaMelo Ball added 28 points, 11 assists and six rebounds.\n\n\r\n              The Hornets jumped out to a 32-24 lead after a strong first quarter from Washington, who connected on all four 3s, and for a while it looked like it might be their night.\n\n\r\n              But Miami took advantage of Charlotte's thin depth in the second quarter and built a 57-48 lead at the break after Butler banked in an off-balance buzzer-beater from halfcourt in traffic to close out the half.\n\n\r\n              When the Heat needed a basket, Butler or Adebayo had the answer — if not by making jumpers then by finding open teammates cutting to the basket.\n\n\r\n              Still, Charlotte would rally to cut the lead to 95-90 with eight minutes left after Ball lobbed a pass to Nick Richards for a one-handed dunk and Washington hit a transition 3.\n\n\r\n              But Butler, who finished 10 of 14 from the field, hit a key fallaway jumper to beat the shot clock with 1:11 left to put the Heat up by seven and essentially seal the win.\n\n\r\n              The Heat won despite shooting 25.8% (8 of 31) from beyond the arc compared to Charlotte's 46.9% (15 of 32). \n\n\r\n              Jaime Jaquez Jr. had a big game off the bench for Miami with 17 points and five rebounds, while playing 32 minutes. He said he feels an extra motivation from teammates to play well in the tournament.\n\n\r\n              “I think it starting register as the season goes on and what we're playing for,” Jaquez said. “We've got $500,000 on the line, so let's try to win that prize money.”\n\n\r\n              The Hornets played without six players due to injury, including starters Gordon Hayward and Terry Rozier and top draft pick Brandon Miller and Cody Martin. That meant Theo Maledon and JT Thor were forced into starting roles.\n\n\r\n              Miles Bridges also remained out, serving the final game of his 10-game league-imposed suspension. \n\n\r\n              At times the Hornets looked out of sync with seldom-used reserves on the court, which coach Steve Clifford called unacceptable.\n\n\r\n              “Obviously you’ve got guys in there that don’t play a lot, but they get their reps and they should know what we’re doing,” Clifford said. “We blew two sets in the last three-and-a-half, four minutes there. They’ve all had enough reps so they should know where they’re going.”\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Brooklyn on Thursday night.\n\n\r\n              Hornets: Host Milwaukee on Friday night in another In-Season Tournament game. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995390.0134542
}