{
  "game_id": "0021701172",
  "espn_id": "400975918",
  "date": "Apr 04, 2018",
  "matchup": "MIA @ ATL",
  "headline": "Olynyk's hot shooting powers Heat past Hawks",
  "body": "ATLANTA --  With an extra $1 million in his pocket, Kelly Olynyk could have afforded a spending spree.\n\n\"Instead, I just made it rain,\" he said.\n\nOne 3-pointer at a time.\n\nOlynyk scored 19 points, including 15 on five 3-pointers when Miami took the lead for good in the second period, and the Heat beat the Atlanta Hawks 115-86 on Wednesday night, capping a sweep of back-to-back games between Southeast Division rivals.\n\nBy logging his first two minutes in the game, Olynyk earned a $1 million bonus for reaching 1,700 for the season.\n\nThat sort of detail doesn't go unnoticed on a team. Olynyk's teammates and coach Erik Spoelstra are expecting the 7-foot forward to pick up some tabs.\n\n\"Dinner, drinks, beers all that is on him,\" Spoelstra said. \"I'm going to see if I can get tickets to a play. All that is on him. I'm going to bill his account for everything.\"\n\nSpoelstra and his players have reason to celebrate.\n\nMiami rested Dwyane Wade, Goran Dragic and James Johnson one day after clinching a playoff berth by beating the Hawks in Miami.\n\nOlynyk made five of six 3s in the second period. His career high for 3s in a game is six.\n\n\"I was kind of in the zone,\" he said. \"I felt like whatever I threw up was going to go in.\"\n\nOlynyk's first two 3s in his streak of four straight for the Heat capped a 14-0 run for a 42-36 lead.\n\nFollowing a basket by Atlanta's Damion Lee, Olynyk sank two more 3s before a miss ended his hot stretch.\n\n\"He's one of our best shooters,\" said Spoelstra of Olynyk. \"He works on it all the time and it's such a weapon. And he picks the right spots. It's all because his heart's in the right place. He doesn't want to take all the shots. He only wants to shoot open ones.\"\n\nOlynyk also had eight rebounds and five assists.\n\nJosh Richardson also had 19 points, with four blocks and three steals, and Justise Winslow had 18 for Miami.\n\nMiami stretched its lead with a 12-0 run late in the third quarter and increased the advantage to 20 points early in the final period.\n\nEven without some of its top players, Miami had plenty of depth to control the game. The woeful Hawks have lost seven of eight and 13 of 15 to solidify their hold on the worst record in the Eastern Conference.\n\n\"Energy wise, our gas tank hit empty,\" said Hawks coach Mike Budenholzer.\n\nTaurean Prince led Atlanta with 20 points, Lee and Tyler Dorsey each had 15. No other Hawks player scored in double figures.\n\n\"It's just one of those nights when we dug ourselves a hole,\" Dorsey said.\n\nTIP-INS\n\nHeat: Spoelstra said Dragic (right ankle), Wade (left wrist) and Johnson (left ankle) have played through injuries as the Heat \"made a pretty big push without exhaling at all\" to clinch the playoff spot. ... Rodney McGruder had 14 points. Wayne Ellington had 11. ... Miami made 17 of 38 3s.\n\nHawks: G Antonius Cleveland had five points in 12 minutes in his return after missing 18 games with a left ankle injury. He appeared in his first game since Dec. 18 with the Mavericks. ... Center Dewayne Dedmon (sore rib) was cleared following pregame warmups. He had six points and eight rebounds after missing Tuesday night's game.\n\nSHORT REST\n\nSpoelstra said he's not shutting down his starters before the playoffs.\n\n\"Right now we're not shutting everybody down,\" Spoelstra said.\n\nWade is confident he'll be ready for the postseason.\n\n\"I've got three more games,\" Wade said before the game. \"Yeah, I'll be out there.\"\n\nREMEMBERING KING\n\nThere was a pregame moment of silence to mark the 50th anniversary of the Rev. Martin Luther King Jr.'s assassination.\n\nUP NEXT\n\nHeat: At New York on Friday night.\n\nHawks: At Washington on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993518.6924942
}