{
  "game_id": "0021800775",
  "espn_id": "401071448",
  "date": "Feb 02, 2019",
  "matchup": "DET vs. LAC",
  "headline": "Clippers rally from 25 down, beat Pistons 111-101",
  "body": "DETROIT --  Lou Williams scored 16 Los Angeles points in a row during a torrid fourth-quarter stretch, and the Clippers rallied from a 25-point deficit to beat the Detroit Pistons 111-101 on Saturday night.\n\nThe Clippers trailed by 25 in the second quarter and were down 83-60 in the third before storming back to tie the game at 89 in the fourth. It was 91-all before Williams scored every Los Angeles point during a decisive run that put the Clippers up 107-96.\n\nWilliams finished with 39 points. Detroit's Blake Griffin had 24 points and 11 rebounds against his former team, and Reggie Jackson added 29 points for the Pistons.\n\nThe Pistons led 40-22 after a first quarter in which they made eight 3-pointers. Los Angeles took three timeouts in the game's first 5:25, but that didn't do much to stem the tide.\n\nDetroit led 65-47 at halftime. It was still a comfortable margin until the very end of the third, when the Clippers -- who were starting a six-game road trip -- began to make a game of it.\n\nWilliams made a pair of 3-pointers during his 16-point run in the fourth. Detroit scored only 14 points in the final period.\n\nTIP-INS\n\nClippers: Montrezl Harrell scored 16 points and Mike Scott added 15. Only one starter was in double figures, and that was Shai Gilgeous-Alexander, who scored 14.\n\nPistons: Detroit finished 17 of 42 from 3-point range, going 6 of 22 in the second half.\n\nIN RELIEF\n\nThe Clippers' reserves came in averaging a league-best 51.3 points per game, and they outscored Detroit's bench 80-17. The Pistons' starters outscored their Los Angeles counterparts 84-31, but it wasn't enough.\n\nUP NEXT\n\nClippers: Visit Toronto on Sunday.\n\nPistons: Host Denver on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994682.584725
}