{
  "game_id": "401810088",
  "espn_id": "401810088",
  "date": "Nov 16, 2025",
  "matchup": "BOS vs LAC",
  "headline": "Jaylen Brown scores 33, Payton Pritchard 30 as Celtics hold off Clippers 121-118",
  "body": "BOSTON -- — Jaylen Brown scored 33 points and had 13 rebounds, Payton Pritchard added 30 points and the Boston Celtics held off the Los Angeles Clippers for a 121-118 victory on Sunday.\n\n\r\n              Derrick White scored 22 points with nine assists and seven rebounds, and Neemias Queta chipped in with 14 points and nine boards for Boston.\n\n\r\n              Playing for the first time since beating Memphis by 37 points at home Wednesday, the Celtics nearly blew a 24-point, third-quarter lead but never trailed en route to their second straight victory.\n\n\r\n              Coming of his 82nd career triple-double with 41 points in a double-overtime victory at Dallas on Friday, James Harden scored 32 of his 37 points in the second half to lead the Clippers. Ivica Zubac added 16 points and 12 boards.\n\n\r\n              Clippers forward Derrick Jones Jr. was helped to the locker room after falling to the court and grabbing his right knee following a collision in the second quarter and didn’t return.\n\n\r\n              Los Angeles made it 119-118 on Harden’s 3 with two seconds left, but Pritchard was fouled and hit two free throws.\n\n\r\n              Harden had an open look at a potential tying 3-pointer, but it hit off the rim as the buzzer sounded.\n\n\r\n              After Los Angeles sliced it to 90-85 at the end of the third, Brown scored 11 of Boston’s initial 16 points in the final quarter to keep the Celtics in control, mixing a 3-pointer with a conventional 3-point play and a couple of mid-range jumpers.\n\n\r\n              Boston had opened it to 76-52 midway into the third behind two 3-pointers from Pritchard, who was 8 of 13 overall on 3-point attempts.\n\n\r\n              The Clippers closed it to 90-85 with a 12-4 run that was capped by Harden’s left-wing 3 with 2.4 seconds left.\n\n\r\n              Up next\r\n              Clippers: At Philadelphia on Monday in the third of a seven-game road trip.\n\n\r\n              Celtics: At Brooklyn on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042633.77014
}