{
  "game_id": "0022101143",
  "espn_id": "401360962",
  "date": "Mar 30, 2022",
  "matchup": "ATL @ OKC",
  "headline": "Young scores 41 as Hawks top Thunder 136-118",
  "body": "OKLAHOMA CITY -- — Trae Young had 41 points and eight assists, and the Atlanta Hawks rolled past the Oklahoma City Thunder 136-118 on Wednesday night. \n\n\r\n              Young, who grew up in Norman and played for University of Oklahoma for one season, put on a show for a crowd that cheered him often. He made 13 of 24 field goals and 11 of 12 free throws in three quarters of action.\n\n\r\n              Kevin Huerter and Bogdan Bogdanovic each scored 20 points for the Hawks, who won their third straight and strengthened their hold on the No. 10 spot in the Eastern Conference standings. Atlanta is averaging 129.7 points during the win streak. \n\n\r\n              Lindy Waters III scored a career-high 25 points and made seven 3-pointers for the Thunder. Theo Maledon added 18 points and eight assists.\n\n\r\n              Oklahoma City only had eight players available. The team recently shut down Shai Gilgeous-Alexander (sore right ankle), Josh Giddey (sore right hip) and Darius Bazley (fractured right knee) for the season and had already shut down Lu Dort (left shoulder surgery).\n\n\r\n              Young made his first five shots. He scored 19 points in the first quarter to help the Hawks take a 42-24 lead.\n\n\r\n              The Hawks rolled in the second quarter and led 85-58 at halftime. It was a season high for points in a half for Atlanta. Young scored 30 before the break on 9-of-13 shooting.\n\n\r\n              Atlanta hit 100 points with just over six minutes remaining in the third quarter. Young's final point came on a free throw in the closing seconds of the third after he was fouled on a made floater. \n\n\r\n              TIP-INS\n\n\r\n              Hawks: Shot 61.7% from the field in the first half and 63.2% from 3-point range. ... Had just four turnovers in the first half. ... F/C Onyeka Okongwu grabbed 13 rebounds.\n\n\r\n              Thunder: Waters scored 14 points in the first half. ... Aleksej Pokusevski had 13 points and eight rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host the Cleveland Cavaliers on Thursday.\n\n\r\n              Thunder: Host the Detroit Pistons on Friday.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993477.920356
}