{
  "game_id": "0022001035",
  "espn_id": "401307844",
  "date": "May 11, 2021",
  "matchup": "IND vs. PHI",
  "headline": "Pacers rally late for 103-94 win to snap 76ers streak,",
  "body": "INDIANAPOLIS -- — The Indiana Pacers helped clear up the Eastern Conference's muddled play-in picture Tuesday.\n\n\r\n                    Philadelphia's second-half collapse only made it more murky at the top.\n\n\r\n                    Domantas Sabonis recorded his ninth triple-double of the season with 16 points, 15 assists and 13 rebounds and Caris LeVert added 24 points to help the Pacers rally for a 103-94 play-in round clinching victory.\n\n\r\n                    “We knew that if we won games, we could play our way into it,\" LeVert said. “But we're still trying to move up and see where we can go. This is a good milestone for us, but we've still got three, four games here this week.”\n\n\r\n                    Indiana has won three of its last four after finding the energy and effort that seemed to be missing for weeks.\n\n\r\n                    This one was especially pleasant, too, because they ended the 76ers season-long winning streak at eight and prevented them from capturing the conference's top seed for the first time since 2000-01. A Philadelphia win or losses by the Milwaukee Bucks or Brooklyn Nets would have ended the race for the top spot.\n\n\r\n                    Instead, Brooklyn is two games back and Milwaukee trails by 3 1/2.\n\n\r\n                    This wasn't typical 76ers basketball, either. Joel Embiid sat out with a non-COVID-19 related illness and though Tobias Harris scored 27 points and Ben Simmons finished with 13, Philadelphia scored just 32 points in the second half — 13 in the third quarter when Indiana got back into the game.\n\n\r\n                    “It’s rare that I would say this was an offensive loss, but I thought this was an offensive loss for us tonight,\" 76ers coach Doc Rivers said.\n\n\r\n                    Indiana trailed almost the entire first three quarters before taking a 75-72 lead late in the third.\n\n\r\n                    When Philadelphia answered with an 8-0 run, the Pacers wouldn't go away. They fought back to tie the score on at 92 on Sabonis' dunk with 4:34 left, took the lead on LeVert's two free throws with 3:44 to go and never trailed again.\n\n\r\n                    “We just really dug in (defensively),\" Doug McDermott said after scoring 20 points. “They were rolling there in the first half a little bit and I thought it was crucial there at the end of the half that we got it down to about 11 or 12. I thought coach did a really good job of getting us to play defense in the second half.\"\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Simmons also had eight rebounds and seven assists. ... Seth Curry had 10 points. ... Philadelphia failed to pull off its first season sweep of the Pacers since 2004-05. ... The 76ers also played without Furkan Korkmaz (sprained right ankle) and Matisse Thybulle (sore left hand).\n\n\r\n                    Pacers: LeVert had seven rebounds and five assists. ... Justin Holiday added 16 points and T.J. McConnell had 10. ... Indiana is now 11-5 on the second night of a back-to-back this season. ... The Pacers were without Malcolm Brogdon (right hamstring), Jeremy Lamb (left knee), Edmond Sumner (left knee), Myles Turner (right foot) and T.J. Warren (left foot). \n\n\r\n                    PLAYOFF PICTURE\n\n\r\n                    Indiana and Charlotte both clinched play-in spots even though the Hornets lost 117-112 to Denver. The Hornets and Pacers are now tied at No. 8 in the East, and nine of the 10 postseason spots have been secured. Washington remains one game behind Charlotte and Indiana at No. 10. Chicago is three games behind the Wizards.\n\n\r\n                    ON A ROLL\n\n\r\n                    Sabonis has played his best basketball of the season since missing six games with a back injury. He came into the game averaging 26.0 points, 15.3 rebounds, 10.3 assists since May 1 and while he didn't pad those numbers Tuesday, he added another triple-double to his single-season franchise record.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Make their final regular-season road trip Thursday at Miami.\n\n\r\n                    Pacers: Host Milwaukee on Thursday in their second-to-last home game.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997116.148214
}