{
  "game_id": "0022300655",
  "espn_id": "401585283",
  "date": "Jan 28, 2024",
  "matchup": "ORL vs. PHX",
  "headline": "Magic beat Suns 113-98, overcoming Devin Booker’s 44-point night",
  "body": "ORLANDO, Fla. -- — Paolo Banchero scored 26 points and the Orlando Magic beat the Phoenix Suns 113-98 on Sunday night, overcoming Devin Booker's 44-point effort two days after he had 62 in a loss at Indiana.\n\n\r\n              Phoenix went more than eight minutes between field goals in the fourth quarter and scored only four points in the last 10 minutes, losing its second straight after a seven-game winning streak.\n\n\r\n              The Magic's defensive shutdown was accomplished with a lineup that included the 6-10 Banchero, 6-10 Franz Wagner, 6-11 Moritz Wagner and 6-11 Jonathan Isaac.\n\n\r\n              “A lot of teams aren’t built the way they are. They’re a massive team,” Phoenix coach Frank Vogel said. “You can attack them if you do it the right way. We didn’t do it well enough or handle their pressure well enough tonight.”\n\n\r\n              Booker was 17 of 26 from the field and hit 9 of 11 free throws. But he had only two points in the fourth quarter.\n\n\r\n              “They were playing a physical game the whole game,” said Booker, who is averaging 41 points over his last six games. “I think after the start we had they just reverted to being extra physical and hoping they can’t call every foul.”\n\n\r\n              The Suns shot 5 for 18 with seven turnovers in a 13-point fourth quarter.\n\n\r\n              “I don't think anybody's probably done that all year to them,” said Isaac, who had two of the Magic's seven blocks. “For us to get it done like that, especially with the way Booker was rolling, to kind of shut them up in the fourth quarter, it's amazing.”\n\n\r\n              Moritz Wagner came off the bench with 16 points and 12 rebounds in 23 minutes.\n\n\r\n              “What Mo did was give us extra possessions on the offensive glass,” Magic coach Jamahl Mosley said. “I don’t think (people) realize how important that is in a game like this, against an elite scoring team, when you get extra possessions.”\n\n\r\n              Kevin Durant, limited to 12 shots, had 15 points and seven of the Suns' 23 turnovers.\n\n\r\n              “I wasn't very smart with the ball,” he said. “I lead by example by doing stuff like that, and that kind of messed the whole game up. I just think that sets a bad precedent for the team and everybody feeds off of that, and it just snowballs off that. Really that’s what lost the game.”\n\n\r\n              The Suns made 18 of their first 24 shots, including a long jumper by Durant that gave them a 13-point lead at the start of the second quarter.\n\n\r\n              Booker finished his 21-point third quarter by scoring the Suns' final seven points, but as he sat out the first four minutes of the fourth quarter, the Magic moved ahead.\n\n\r\n               A 3-pointer by Franz Wagner put the Magic up 97-92 just after Booker got back into the game, and another 3-pointer by Isaac made it 104-94 with 3:59 left.\n\n\r\n              The Suns shot 56% overall, but took only 14 threes, 18 below their season average.\n\n\r\n              We forced the into the tough, contested twos with sometimes three hands on them,\" Mosley said.\n\n\r\n              Phoenix center Jusuf Nurkic sat out because of a sprained left thumb.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Miami on Monday night.\n\n\r\n              Magic: At Dallas on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995701.55966
}