{
  "game_id": "0021901258",
  "espn_id": "401224733",
  "date": "Aug 04, 2020",
  "matchup": "PHX @ LAC",
  "headline": "Booker's shot at buzzer leads Suns over Clippers 117-115",
  "body": "LAKE BUENA VISTA, Fla. --  Devin Booker made a turnaround jumper over Paul George as time expired, capping a 35-point performance and giving the Phoenix Suns a 117-115 victory over the Los Angeles Clippers on Tuesday.\n\n\"I'm happy for him, but he'd be the first one to tell you we're not done,\" Phoenix coach Monty Williams said of Booker.\n\nThe Suns improved to 3-0 in the bubble as they chase a playoff spot.\n\n\"This is a fun team to be a part of and we're having fun with it,\" Booker said. \"This whole experience ... we just wanted to come down here and make some noise and that's what we're doing.\"\n\nKawhi Leonard had tied the game with two free throws with 31.3 seconds to go. Ricky Rubio missed a shot after that and Ivica Zubac got the rebound, but he threw a bad pass that Mikal Bridges stole to give the Suns another chance.\n\nBooker dribbled left before being cut off by Leonard. He turned the other direction and shot as George was closing, then crashed to the court as his teammates surrounded him to celebrate the victory.\n\n\"You pretty much (saw) the shot,\" Leonard said. \"He got to his spot.\"\n\nBooker was asked about the celebration after his big shot.\n\n\"I'm not a big celebration guy ... but they caught me on the ground so I couldn't get away from them,\" he said.\n\nAfter setting a franchise record by making 25 3-pointers in a win over New Orleans on Saturday, the Clippers managed just eight in the loss. Leonard led the Clippers with 27 points and George added 23.\n\nThe Suns led by eight in the fourth before the Clippers used an 8-2 run with an alley-oop dunk by Zubac to cut the lead to 107-105 with about 5 minutes to go.\n\nPhoenix got baskets from Booker and Rubio to extend the lead, but Leonard scored the next four points to start a 6-0 run that tied it at 111-all with less than 2 minutes left.\n\nThe Suns led by 11 early in the third quarter. But the Clippers chipped away at the lead and a 7-3 spurt, with all the points from Leonard, cut the lead to 88-87 with about 3 minutes left in the quarter.\n\nBut the Suns used a 7-2 run, capped by a 3 from Cameron Johnson, to push the lead to 95-89 near the end of the third. Marcus Morris added a layup after that to get the Clippers within four entering the fourth.\n\nTIP-INS\n\nSuns: Rubio had 18 points. ... Deandre Ayton scored 19. ... Phoenix made 17 3-pointers.\n\nClippers: G Pat Beverley played just eight minutes before leaving with calf soreness. ... F Montrezl Harrell remains away from the team because of a personal matter. Coach Doc Rivers said Tuesday that he didn't have an update on when he would return.\n\nWILLIAMS RETURNS\n\nLou Williams had seven points, six assists and six rebounds in 21 minutes in his restart debut after missing the first two games. Williams had to quarantine for 10 days after visiting a strip club in Atlanta after he was granted permission to leave the Disney bubble for a family member's funeral.\n\nHe said he could have made a better decision, but that he thinks it became a bigger story that it needed to be because of where he went.\n\n\"At the end of the day, I was truly grieving two weeks ago,\" he said. \"I was thrown under the bus, and the attention was thrown to Magic City. If I went to a steakhouse or Hooters, it wouldn't have been a story.\"\n\nUP NEXT\n\nSuns: Play the Pacers on Thursday.\n\nClippers: Play Dallas on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996539.221608
}