{
  "game_id": "0021800836",
  "espn_id": "401071509",
  "date": "Feb 10, 2019",
  "matchup": "SAC vs. PHX",
  "headline": "Bagley has 32 points to help Kings extend Suns' skid to 14",
  "body": "SACRAMENTO, Calif. --  Marvin Bagley III was more than a little excited playing against Phoenix for the first time. The Sacramento rookie grew up in Tempe, Arizona, and was briefly high school teammates with the Suns' Deandre Ayton.\n\nPhoenix passed over Bagley with the No. 1 overall pick in last summer's draft, taking Ayton instead. Bagley fell to the Kings at No. 2 -- a little added motivation there, too.\n\nBagley had another strong game off the bench with a career-high 32 points and six rebounds, and Sacramento beat Phoenix 117-104 on Sunday to hand the Suns their 14th straight loss.\n\n\"I love playing against the Suns,\" said Bagley, who missed the Kings first two games against Phoenix due to a knee injury. \"It's fun playing against Deandre, the whole organization, everybody involved. I got to meet them when I went there for my pre-draft work and I met a few of those guys. So it was good competing against them.\"\n\nBuddy Hield scored 18 points, De'Aaron Fox had 17 points and nine assists, and Nemanja Bjelica added 10 points and eight rebounds to help Sacramento to its fifth win in six games.\n\nThe Kings inched closer to ending the longest current playoff drought in the NBA. Sacramento, which last made the postseason in 2005-06, pulled within a half-game of the idle Los Angeles Clippers for the final playoff spot in the West.\n\nIt's also the fastest the Kings (30-26) have reached 30 wins since 2004-05 when they did it in 43 games.\n\n\"We have this goal in our heads about getting to the playoffs and it's getting close right now,\" Bagley said. \"Every game matters. I'm excited, after we get done with this next game, how we come back from break and see where we can go from there.\"\n\nDevin Booker had 27 points, eight rebounds and six assists in his return from injury for Phoenix. Ayton added 16 points and nine rebounds.\n\nThe Suns' losing streak is one shy of its franchise record of 15 set last season. They'll try to avoid matching that dubious mark Wednesday against the Clippers.\n\n\"The Kings came better prepared, more ready and more aggressive,\" Phoenix coach Igor Kokoskov said. \"We said before the game that they were going to throw the first punch hard at us. We were not ready to accept that punch.\"\n\nBagley had his best game as a pro while dominating in the paint. The second overall pick in the draft, Bagley shot 10 of 15 and went 11 for 13 from the free-throw line. He also scored Sacramento's first 12 points in the fourth quarter, including a driving 360-degree spinning layup.\n\n\"He's doing what we knew he could do in the beginning,\" Kings center Willie Cauley-Stein said. \"It's really on him. He's getting the time, he's putting in the work and it's showing.\n\nTIP-INS\n\nSuns: Jackson scored six straight points in the third on a free throw, dunk and 3-pointer. He was also called for a technical foul in the same period. ... Booker returned to the lineup after missing the previous two games because of right hamstring tightness. He had a scare in the third quarter when he banged knees with Bogdan Bogdanovic and limped off the court, but he came back to start the fourth and promptly made a 3-pointer.\n\nKings: Sacramento had only two turnovers in the first half. ... Fox spent much of the first quarter on the bench after picking up his second foul early.\n\nFINISHING WHAT THEY START\n\nThe Kings are 4-1 this season in games when they lead by 15 or more at halftime. The only blemish was a 115-11 loss to the Suns in Phoenix on Jan. 8 when Sacramento blew a 19-point lead at the break.\n\nUP NEXT\n\nSuns: Play in Los Angeles against the Clippers on Wednesday.\n\nKings: Play at Denver on Wednesday.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994181.5174458
}