{
  "game_id": "0021501055",
  "espn_id": "400828942",
  "date": "Mar 22, 2016",
  "matchup": "LAL vs. MEM",
  "headline": "Lakers hold off Grizzlies 107-100, snap 4-game skid",
  "body": "LOS ANGELES --  One last time, Kobe Bryant backed down Tony Allen, talked friendly trash with Matt Barnes and reminisced with old AAU teammate Vince Carter.\n\nBy the final minutes, Kobe was watching them all from the bench while the young Los Angeles Lakers closed out an unlikely win.\n\nJordan Clarkson scored 22 points, Brandon Bass got eight of his 18 in the fourth quarter and the Lakers snapped a four-game losing streak with a 107-100 victory over the Memphis Grizzlies on Tuesday night.\n\nBryant scored 12 of his 20 points in the third quarter, but the superstar sat out the final 4:20 because coach Byron Scott wanted \"to see what these guys can do.\"\n\nBryant was curious himself, and he wasn't disappointed.\n\n\"I thought they played hard,\" Bryant said of the young group. \"I think it's time for them to make that jump. Now it's time to really lock in on those details.\"\n\nEven with D'Angelo Russell sidelined by a bruised shin, Clarkson led Los Angeles smoothly past the playoff-bound Grizzlies, who had won the clubs' first three meetings of the season. The Western Conference-worst Lakers wrapped up an eight-game homestand with three wins, beating contenders Golden State and Memphis.\n\n\"We were moving the ball, but a lot of it started on the defensive end,\" Clarkson said. \"We just stuck to the game plan.\"\n\nAllen made all 12 of his shots while scoring 27 points for the Grizzlies, who rallied to win in Phoenix on Monday night.\n\n\"It was one those games where they took advantage of us coming off a back-to-back, but no excuses,\" Allen said. \"That team played hard. They were all over the place, getting second-chance points. We turned the ball over and they scored off our turnovers. They played with a little more energy than us. They outhustled us and had a little more pep in their step. They're a young, talented group, and they're the future of the NBA.\"\n\nZach Randolph and Lance Stephenson added 16 points apiece for the Grizzlies.\n\n\"It's a game that we needed, and we didn't win,\" said Carter, who had four points. \"They had more energy than us. I don't know what they're playing for, but I know what we're playing for.\"\n\nKOBE'S GUYS\n\nBryant suited up for the fourth time in Los Angeles' last 10 games, and he appeared to be in a good mood throughout his final showdown with several old friends.\n\nKobe recently called Allen the toughest defender he faced in his 20-year NBA career, and Carter was among his early inspirations to work hard. Bryant's long-standing connections with them explained why he'll attempt to play back-to-back games with his sore shoulder instead of sitting out this one before Wednesday's game in Phoenix.\n\n\"My shoulder feels great,\" Bryant said. \"I didn't have any aches or pains.\"\n\nBryant said he still intends to play in his Phoenix farewell.\n\nD'ANGELO DOWN\n\nRussell had 11 points in 22 minutes before sitting out the final 1 1/2 quarters. The rookie No. 2 overall pick went down in pain in the first half after a leg-on-leg collision with JaMychal Green, but he played in the third quarter before shutting it down.\n\nNO JUSTICE, NO WORLD PEACE\n\nMetta World Peace was ejected early in the fourth quarter when he wouldn't stop complaining about the lack of a foul call when Vince Carter tied him up for a jump ball. The former Ron Artest has a monumental history of on-court misbehaviors, but it was his first ejection of the season. The Grizzlies got the chance to choose the Lakers player who had to enter the game to take World Peace's spot on the jump ball, and they grinningly chose Kobe, who lost the tip.\n\nTIP-INS\n\nGrizzlies: Longtime Lakers G Jordan Farmar had eight points and five assists in his second game with Memphis, which signed the Los Angeles native and UCLA product to a 10-day contract. ... Stephenson scored five points in 1.5 seconds late in the third quarter with two free throws, a quick steal and a three-point play. ... Mike Conley missed his 10th straight game with tendinitis, and P.J. Hairston missed his fifth straight game with a strained groin.\n\nLakers: Rookie F Larry Nance Jr. sat out as part of the team's strategy to rest his sore knees during back-to-back sets. He is expected to play Wednesday in Phoenix. ... Russell is questionable to play in Phoenix, the team said.\n\nUP NEXT\n\nGrizzlies: At Spurs on Friday.\n\nLakers: At Suns on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994245.6848378
}