{
  "game_id": "0022300242",
  "espn_id": "401584870",
  "date": "Nov 25, 2023",
  "matchup": "LAL @ CLE",
  "headline": "Anthony Davis scores season-high 32 points, Lakers beat the Cavaliers 121-115",
  "body": "CLEVELAND -- — Anthony Davis scored 23 of his season-high 32 points in the second half and grabbed 13 rebounds, LeBron James had 22 points and the Los Angeles Lakers beat the Cleveland Cavaliers 121-115 on Saturday night.\n\n\r\n              James added six rebounds, six assists and two steals in beating Cleveland for the 18th time in 21 career games. The 39-year-old attended St. Vincent-St. Mary High School in nearby Akron and spent 11 seasons with the Cavaliers, leading them to the 2016 NBA championship.\n\n\r\n              “Tonight was an A.D. game for us,” James said. “He needs to touch the ball, and we want him to be aggressive offensively and anchor our defense. He did a great job attacking the basket and guarding the glass.”\n\n\r\n              Austin Reeves had 15 points and 10 assists, Christian Wood scored 13 points and Max Christie had 12 for the Lakers, who won their third straight on the road. Los Angeles shot 52.2% and had 34 assists on 47 baskets.\n\n\r\n              “Any time you can get that assist number up, it means you’re playing the game the right way,” Reeves said. “The team did a really good job trying to make winning plays.”\n\n\r\n              Donovan Mitchell, who missed the previous four games with a right hamstring strain, shot 4 of 18 and had 22 points and six assists for Cleveland. Jarrett Allen added 21 points and 14 rebounds, and Evan Mobley finished with 18 points and six assists.\n\n\r\n              Cavaliers point guard Darius Garland did not play in the second half because of a neck strain, caused by an awkward collision with Christie in the first quarter.\n\n\r\n              “We didn’t play how we wanted to the entire game and we didn’t complete the mission,” Mobley said. “They were executing their plays and we weren’t down the stretch. It’s disappointing.”\n\n\r\n              The Lakers built an eight-point advantage in the fourth, but the Cavaliers pulled within 113-112 on Mobley’s basket while being fouled. Mobley missed the subsequent free throw and James followed with a layup and dunk to increase Los Angeles’ lead to 117-112 with 1:12 left.\n\n\r\n              James extended his league-record streak of double-digit scoring performances to 1,167, raising his point total to an unprecedented 39,060 over 21 NBA seasons. He is Cleveland’s career leader in points, rebounds, assists, steals, minutes and games.\n\n\r\n              “Stepping back on this floor and knowing I was part of pretty much all the banners in this arena, that’s pretty cool,” said James, who starred on all six of the Cavaliers’ Eastern Conference title teams. “It’s very special to be a kid from Akron and to have been drafted here and played 11 years in Cleveland.”\n\n\r\n              Earlier in the day, a museum dedicated to his life, “LeBron James’ Home Court,” opened at his family foundation’s House Three Thirty in Akron. Admission is $23, matching his uniform number.\n\n\r\n              “He’s a great young man who has done tremendous things on the basketball floor, in the world of business and in education,” Lakers coach Darvin Ham said.\n\n\r\n              Cleveland had its highest-scoring quarter of the season, leading 40-35 after the first, and its top-scoring half as it carried a 71-70 advantage into the break.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Visit Philadelphia on Monday night.\n\n\r\n              Cavaliers: Host Toronto on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995543.494577
}