{
  "game_id": "0021900840",
  "espn_id": "401161482",
  "date": "Feb 22, 2020",
  "matchup": "MIL vs. PHI",
  "headline": "Antetokounmpo's 31 points lead Bucks past 76ers, 119-98",
  "body": "MILWAUKEE --  The Milwaukee Bucks turned a tight game with the Philadelphia 76ers into a mismatch immediately in the second half, led by the reigning league MVP.\n\nGiannis Antetokounmpo had 31 points and 17 rebounds, Khris Middleton scored 25 points and the Bucks beat the 76ers 119-98 on Saturday night in a matchup of Eastern Conference rivals.\n\nAntetokounmpo scored Milwaukee’s first 11 points in the third quarter as the Bucks took advantage of the absence of Philadelphia big man Joel Embiid, who went to the bench less a minute into the period after picking up his fourth foul, and quickly put the game out of reach.\n\n“We came out the third quarter and played fast,” Antetokounmpo said. \"We were able to rebound the ball and just attack them. Joel had four fouls. That worked in our favor. We tried to be aggressive in the third quarter and set the tone.”\n\nAntetokounmpo added eight assists as Milwaukee won for the 16th time in its last 18 games to improve its NBA-best record to 48-8.\n\nThe Bucks led 56-50 at the half before Antetokounmpo's scoring outburst put the Bucks in control. Milwaukee would go on to outscore the 76ers 37-23 in the period.\n\nEmbiid, coming off a 39-point performance on Thursday night, had 17 points and 11 rebounds but shot just 5 for 18. Furkan Korkmaz and Shake Milton also scored 17 points apiece for the 76ers, who fell to 9-20 on the road.\n\n“I liked what I was seeing in the first half, and the death knock was Joel sitting,” 76ers coach Brett Brown said. \"We just didn’t respond well to Milwaukee playing their tails off, and they shot the heck out of the ball.”\n\nPhiladelphia lost All-Star point guard Ben Simmons early in the first quarter. Simmons, who missed the 76ers' previous game with lower back tightness, headed to the locker room after making consecutive driving layups, the second with a little more than 7 minutes left in the opening quarter. He didn’t return after the injured flared up.\n\n“We never got in a rhythm. Losing Ben, then foul trouble, not making shots and some calls that could have gone a different way,\" Embiid said. “But it’s on us.”\n\nThe 76ers shot just 35%, while the Bucks connected on 53% of their shots.\n\nThe Bucks got off to a scorching start, taking a 12-2 lead sparked by seven points from Antetokounmpo. Milwaukee led by as many as 11 in the quarter and held a 31-21 lead at the end.\n\nPhiladelphia pulled within 37-36 in the second before the Bucks used a 10-2 spurt to push the lead back to double digits.\n\nTIP-INS\n\n76ers: Shot 4 of 19 from 3-point range in the first half. Made 17 of 50 overall (34%). …Embiid picked up two fouls in the first 50 seconds of the third quarter. … Milton scored the team’s first eight points of the third quarter.\n\nBucks: F Kyle Korver sat out a third consecutive game with back soreness. “We’re hopeful that it’s not a significant period of time that he misses,” coach Mike Budenholzer said. Korver won’t travel with the team for an upcoming two-game road trip. …Bucks shot two free throws in first half, while Philadelphia attempted 14…Bucks Hall of Famer Oscar Robertson attended the game. … The Bucks extended their regular season streak of scoring 100 points to 80 games, fifth-longest streak in NBA history. Milwaukee has also tallied 110 points in its last 17 games, the longest streak in the NBA this season.\n\nBEST BALLER\n\nFollowing Thursday night’s win over Brooklyn, Embiid proclaimed himself to be “the best player in the world.” The statement caught his coach’s attention. “It’s not my style,” Brown said. “It is his style. There has always been a mischievous side, a playful side with Joel Embiid. And in many ways, he uses that as his own compass. I believe he has a chance to be. I don’t think he’s that far off.”\n\nBudenhozler didn’t want to get caught up in any debate. “He’s a great player. To say who is the best is not for me and I don’t think it’s that important,\" he said.\n\nAntetokounmpo playfully chided reporters after the game when asked about Embiid's comment. “You want me to say something that is going to go viral. He's going to see it and there's going to be a battle,\" Antetokounmpo said. “I like him. I like his personality. We were good teammates in the All-Star Game. Who am I to tell him he's not the best player in the world? Everybody should feel that way. But at the end of the day, if you feel that way, you've got to go on the court and show it.”\n\nROAD WOES\n\nThe 76ers' road woes contrast with a 26-2 record at home, leaving Brown stumped. “I don’t know. We have to fix this,” Brown said. “As I told the team, it is a house built on sand otherwise.”\n\nPACKED HOUSE\n\nA record crowd of 18,290 packed the Fiserv Forum, a new record for the arena, which opened last season. The previous record of 18,148 was set last season, also against Philadelphia.\n\nUP NEXT\n\n76ers: Host Atlanta on Monday. The teams have split two games this season.\n\nBucks: Take on the Wizards in Washington on Monday. Milwaukee scored a season-high 151 points in its first meeting with Washington at home in January.\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996129.548909
}