{
  "game_id": "0021501164",
  "espn_id": "400829051",
  "date": "Apr 05, 2016",
  "matchup": "LAL @ LAC",
  "headline": "Farewell, Kobe: Lakers lose 103-81 to Clippers as visitors",
  "body": "LOS ANGELES -- The affection for Kobe Bryant overflowed inside Staples Center even as it was tinged with regret about seeing the superstar closing out his career in losing fashion.\nChris Paul scored 25 points and the Los Angeles Clippers defeated the Lakers 103-81 on Tuesday night, beating their co-tenants for the 10th straight time in Bryant's last game as a visitor in his home arena.\n\"He's a competitor and he wants to win every night,\" Paul said of his former U.S. Olympic teammate, \"so to see him end like this is sort of tough.\"\nBryant scored six points on 2-of-12 shooting following a 34-point performance in a loss to Boston on Sunday. The crowd, including plenty of Lakers fans, made Bryant feel at home, cheering his introduction and when he re-entered the game in the second quarter.\n\"The guy deserves it,\" Clippers coach Doc Rivers said. \"It was nice for the 75 percent of our home crowd. The 25 percent of Lakers fans probably can't get Laker tickets and they got ours. I didn't care they were there to cheer for Kobe. It was a good tribute.\"\nPaul and Bryant guarded each other for parts of the game, with Bryant describing the Clippers All-Star as a \"vicious, nasty competitor, and I love that about him.\"\nJeff Green added 21 points off the bench for the Clippers, whose franchise-record victory streak over the Lakers is their second-longest active run against any opponent.\nThe Clippers paid tribute to Bryant, who retires next Wednesday, with a video shown just before he was introduced. Paul and Paul Pierce wished him well in between highlights of Bryant playing against the Clippers. Bryant clapped in appreciation.\nFans chanted \"MVP! MVP!\" while Bryant shot free throws in the first quarter, but it was more in reverence for the five-time NBA champion than for anything he's done lately. He was a combined 2 for 18 in two games before his breakout against the Celtics.\nThe starting five combined to shoot 10 for 51 in the Lakers' 10th loss in 12 games. Metta World Peace led them with 17 points. Jordan Clarkson, who scored 10 points, had X-rays on his right foot and leg after getting stepped on.\nThe Lakers endured the 61st loss of their worst season in franchise history, coinciding with the end of Bryant's 20-year career in Los Angeles.\n\"I hate to see him go out this way. It bothers the hell out of me,\" Lakers coach Byron Scott said. \"He still has the heart of a champion. That will never leave him.\"\nBryant didn't play in the fourth and sat on the bench looking more like an aging NFL quarterback, with both shoulders and both knees heavily wrapped. Fans saluted him by doing various chants of his name, causing Bryant to laugh and point at them in thanks. They held up homemade signs and used camera phones to capture his constant smile.\n\"It's pretty cool for them to give me that type of treatment,\" he said. \"It felt good.\"\nBlake Griffin had four points in 16 minutes of his second game for the Clippers since returning from a 45-game absence.\n\"I am just a step slow, a step behind,\" he said. \"It will come back.\"\nThe Clippers began the third quarter on a 19-3 run that extended their lead to 71-47. Paul scored 12 points, including consecutive 3-pointers, in the spurt.\nThe Clippers raced to a 20-2 lead to start the game, with Bryant missing all six shots in the first quarter.\nTIP-INS\nLakers: Clipper Darrell shouted, \"Kobe, I love you,\" and Bryant, on the bench, smiled and tapped his heart with his right fist in response. Afterward, Bryant said, \"I'm going to miss Clipper Darrell, his passion, his enthusiasm for the game.\"... The Lakers haven't beaten the Clippers since April 4, 2012.\nClippers: Griffin may sit out Wednesday because of a back-to-back. ... F Paul Pierce, who has missed four games with a right ankle sprain and right knee contusion, could return Wednesday. ... The Clippers gave out light-up bracelets that said, \"Thank you, Kobe.\"\nNO TRASH TALK\nBryant and Paul weren't up to their usual trash talking, with Bryant so close to the end and Paul still trying to help the Clippers win their first championship.\n\"A lot of it is just bending my ear about how to get them to the next level,\" Bryant said.\nMARGARITAVILLE\nRivers apologized for being late to his postgame with the media, explaining that he'd had a special visitor, singer Jimmy Buffett.\n\"No margaritas, but it was all good,\" Rivers said, smiling.\n\"You're a parrot head?\" a reporter asked, using the nickname for Buffet's die-hard fans.\n\"I'm a complicated man,\" Rivers responded.\nUP NEXT\nLakers: Host Clippers on Wednesday.\nClippers: Visit Lakers on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994236.194659
}