{
  "game_id": "0021901260",
  "espn_id": "401224735",
  "date": "Aug 04, 2020",
  "matchup": "MIA vs. BOS",
  "headline": "No Butler, no problem as Miami Heat beat Celtics 111-106",
  "body": "LAKE BUENA VISTA, Fla. --  With or without Jimmy Butler, the Miami Heat felt they needed to send a message to the Boston Celtics.\n\nBam Adebayo had 21 points and 12 rebounds, and the Heat never trailed in beating the Celtics 111-106 on Tuesday to remain alone in the fourth spot in the Eastern Conference.\n\nThe Celtics had their lead for the No. 3 seed cut to 1 1/2 games over the Heat. Miami has a game lead on Indiana and improved to 2-1 so far in the seeding games, despite Butler sitting out with a sore right ankle after playing Monday in a loss to Toronto.\n\n\"A lot of guys stepped up,\" Heat coach Eric Spoelstra said. \"This couldn't be two, three guys playing well. We're going to need several guys playing well and doing it over the course of 48 minutes.\"\n\nAdebayo said this victory meant something more after losing twice to Boston during the regular season.\n\n\"Instead of being beat 3-0, we were like, `We got to make a stand. We got to prove a point,\" Adebayo said. \"And like I said before, I feel like this team can battle with anybody ... Who knows how the game could've been if had we had Jimmy?\"\n\nDuncan Robinson also had 21 points for Miami. Goran Dragic added 20 off the bench, Kelly Olynyk scored 15 and Tyler Herro 11.\n\nJayson Tatum led Boston with 23 points. Jaylen Brown had 13 points and 10 rebounds, Gordon Hayward and Kemba Walker each added 15 points and Enes Kanter scored 10.\n\n\"We let our emotions play too much of a part today,\" Tatum said. \"We've just got to do a better job of just focusing on what we can control and not worry about other things.\"\n\nWalker, who beat the buzzer with a shot from mid-court at the end of the third, hit a 3 with 1:26 left to pull Boston within 108-101. Daniel Theis hit a pair of free throws with 19.8 seconds left, then Dragic traveled. Walker hit another 3 with 13 seconds remaining to pull Boston within 109-106.\n\nAndre Iguodala hit a free throw, and Robinson hit two more in the final seconds in a win that meant a lot to someone who grew up 45 minutes north of Boston.\n\n\"I grew up going to TD Garden,\" Robinson said. \"We've played them multiple times, we haven't done well. I haven't done well, and I was reminding myself of that constantly.\"\n\nMiami scored the first bucket and led by as much as 10 before being up 33-28 at the end of the first quarter. The Heat pushed that lead to as much as 16 in the second quarter with a 10-point spurt capped by four free throws by Adebayo. The last pair, with 51.6 left, made it 63-47. Miami led 63-51 at halftime.\n\nThe Celtics went on a 16-3 run to pull within 69-68 on an alley-oop dunk by Theis off a pass from Tatum with 6:08 left in the third. The Heat answered with a 14-2 spurt capped by a three-point play by Adebayo with 3:20 to go for an 83-71 lead. Miami led 91-83 at the end of the third.\n\n\"We weren't solid, and they exposed that,\" Celtics coach Brad Stevens said. \"Our defense has to improve from what it's been in the three games or so. Credit Miami. They played with unbelievable intensity and togetherness tonight.\"\n\nTIP-INS\n\nCeltics: Marcus Smart fouled out with 3:46 left in the third. He was 0 of 5 with three points and two steals in 16 minutes. ... Stevens said Walker will not play Wednesday in the second of the Celtics' back-to-back games.\n\nHeat: Iguodala knocked down the 1,000th 3-pointer of his career with 5:16 left in the second quarter, giving Miami a 50-41 lead. ... Dragic limped to the locker room after landing awkwardly on his left ankle in the final seconds. The Heat now are 11-3 when Dragic scores 20 or more points. X-rays on his ankle were negative.\n\nSTAT WATCH\n\nMiami now is 35-5 when taking a lead into the fourth quarter.\n\nUP NEXT\n\nCeltics: Play Brooklyn Nets on Wednesday night.\n\nHeat: Play Milwaukee Bucks on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996612.8364758
}