{
  "game_id": "0021800407",
  "espn_id": "401071088",
  "date": "Dec 12, 2018",
  "matchup": "MIL @ IND",
  "headline": "Pacers win 5th straight by pulling away from Bucks 113-97",
  "body": "INDIANAPOLIS --  For three weeks, Indiana found ways to fill the void left by Victor Oladipo's absence.\n\nWhen the All-Star guard returned from a sore right knee Wednesday, the Pacers proved they could plug holes in other ways, too.\n\nThaddeus Young scored a season-high 25 points and grabbed 11 rebounds, Myles Turner added 23 points and the league's stingiest defense held Milwaukee's vaunted offense in check long enough to pull away for a 113-97 victory.\n\n\"We were together from the jump (defensively),\" Turner said. \"We got off to a great start and we just kept that energy throughout the game. That's what our team has lacked in the past and we've been bringing it these last couple games.\"\n\nIt certainly showed against the Bucks.\n\nIndiana led from wire to wire, extending its season-best winning streak to five by beating the Central Division-leading Bucks at their own game.\n\nThe Pacers dominated the NBA's top rebounding team, 55-43 overall and 14-9 on the offensive end. They went 12 of 30 on 3-pointers and held the league's highest-scoring team nearly 22 points below its season average. Even the return of All-Star forward Giannis Antetokounmpo from a sore neck didn't really help Milwaukee, which has lost three of its last four road games.\n\nYoung thought the reason was clear: Indiana put on a defensive clinic by jumping into passing lanes, driving lanes and beating the Bucks' rebounders to the spot.\n\n\"Great team defense,\" Young said, explaining how he held Antetokounmpo to a season-low 12 points. \"He's a tough guy to guard, especially in transition. He's got me tired right now. It's just about believing in our system, believing what works on the defensive end and just taking a stand.\"\n\nThe victory moves Indiana within a half-game of the division lead.\n\nBut on a night the Pacers seemed to do nothing wrong, little went right for Milwaukee.\n\nEric Bledsoe led the Bucks with a season-high 26 points on 11-of-16 shooting. Brook Lopez added 15 but was 4 of 12 on 3-pointers. Antetokounmpo had 10 rebounds and seven assists along with his dozen points but also was called for five fouls and didn't play like his typical self.\n\n\"They were very good tonight. We couldn't match it,\" Bucks coach Mike Budenholzer said. \"We just couldn't make enough plays.\"\n\nThe most surprising part was how quickly things got out of hand.\n\nIndiana scored the first six points and built a 22-9 lead less than five minutes into the game. After Milwaukee cut the deficit to 25-23 late in the first quarter, the Pacers answered with a 12-2 run and extended the margin to 58-41 at the half.\n\nThey made it 64-43 early in the third and couldn't get closer than 10 until Bledsoe's 19-foot jumper with 4:25 left in the game.\n\nBut Turner hit his career-high-tying fourth 3 and Oladipo made a 12-footer to make it 106-93, and the Bucks couldn't get within single digits again. Oladipo had 12 points, 10 rebounds and six assists.\n\nTIP-INS\n\nBucks: Scored a season-low 43 points in the first half. Their previous low was 45. ... Antetokounmpo didn't make a basket until scoring on a layup with 1:44 left in the first half. He was 4 of 7 from the field. ... George Hill scored four points in the return to his hometown. ... The Bucks were 11 of 43 on 3s.\n\nPacers: Bojan Bogdanovic scored 16 points to extend his career-best streak of consecutive double-digit games to 19. ... Domantas Sabonis had 12 points and 10 rebounds off the bench. ... Turner also had seven rebounds, four assists and three blocks. ... Indiana has held the rebounding advantage in every game during its winning streak. ... Indiana is 7-1 at home against Eastern Conference teams this season and 12-3 overall.\n\nTHE OLADIPO PLAN\n\nCoach Nate McMillan told reporters before the game that Oladipo's minutes would be restricted. He wound up logging 29 minutes.\n\nOladipo plans to spend most of the next two days resting. If the soreness stays away, he plans to be back on the court Friday at Philadelphia.\n\n\"I need to be able to play at an optimum level,\" Oladipo said. \"I'm looking forward to the opportunity to go out there and play in a tough environment.\"\n\nUP NEXT\n\nBucks: Head to Cleveland on Friday for their second matchup with the Cavaliers in four days.\n\nPacers: Will try to even the season series at 1-1 when they visit Philadelphia on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994509.340808
}