{
  "game_id": "0022300614",
  "espn_id": "401585242",
  "date": "Jan 23, 2024",
  "matchup": "DEN @ IND",
  "headline": "Murray's 31 points, Jokic's triple-double help Nuggets fend off Pacers for 114-109 victory",
  "body": "INDIANAPOLIS -- — Nikola Jokic did a little bit of everything Tuesday night.\n\n\r\n              He scored 31 points, had 13 rebounds and 10 assists for his 13th triple-double of the season. He made 3 of 4 from 3-point range including a crucial one late in the first half and the decisive one with 6.1 seconds left to seal Denver's 114-109 victory at Indiana. He only had one turnover, too.\n\n\r\n              And he even helped the refs by twice urging coach Michael Malone to challenge calls — getting both right, the second of which preserved a key late possession that helped thwart the Pacers charge. And, of course, Jokic again responded with a 3 to give Denver a 105-103 lead with 3:10 to go.\n\n\r\n              “We've been together for nine years and he's proven to be very trustworthy,” Malone said of Jokic's lobbying efforts for challenges. “I think we've won five challenges in a row and those can be game-changing type plays and I thought that late one was. So it works out in our favor.”\n\n\r\n              Jamal Murray also scored 31 points and together Murray and Jokic made all the big plays down the stretch as Denver won its third straight overall and for the ieighth consecutive time over the Pacers.\n\n\r\n              Myles Turner led Indiana with 22 points while Pascal Siakam added 16 points and 10 rebounds in his first home game since being traded to Indiana last week. All-Star guard Tyrese Haliburton again sat out with a strained left hamstring and already has been ruled out of Indiana's next two games.\n\n\r\n              But even Pacers coach Rick Carlisle, who drew two quick technical fouls and was ejected in the third quarter, knew the difference was Jokic.\n\n\r\n              “The two defining plays of the game were the 3 at the end of the first half and the 3 at the end of the game,” Carlisle said. “He's just much more aggressively looking for those shots in those situations and there's just no hesitation. Those are great players making great plays.”\n\n\r\n              The Pacers have lost three straight overall, this one coming on two of the league's five highest-scoring teams struggled, at times, offensively. \n\n\r\n              Yet the defending NBA champions still had enough scoring punch — and just enough defense — to fend off Indiana's late push after taking a 93-81 lead into the fourth quarter. \n\n\r\n              The Pacers methodically fought their way back, tying the score at 100 before taking a 103-102 lead on Ben Sheppard’s 3-pointer with 3:42 left. On the Nuggets next possession, Jokic was called for a foul and he immediately lobbied his coach for a challenge. After a few moments, the foul was called on Sheppard and Jokic made the go-ahead basket to spur a closing 12-6 run to seal the victory.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Complete a five-game road trip with Thursday's game at New York.\n\n\r\n              Pacers: Welcome Philadelphia to Indianapolis on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996756.8497338
}