{
  "game_id": "0021600838",
  "espn_id": "400900244",
  "date": "Feb 15, 2017",
  "matchup": "MIL @ BKN",
  "headline": "Antetokounmpo scores 33, Bucks hold off Nets 129-125",
  "body": "NEW YORK --  Before heading off to play with the All-Stars, Giannis Antetokounmpo got a reminder of how good it feels to play with Khris Middleton.\n\nAntetokounmpo scored 33 points in his final game before his All-Star debut, Middleton had his strongest performance since returning from a ruptured left hamstring and the Milwaukee Bucks sent the Brooklyn Nets to the break on a 14-game skid with a 129-125 victory Wednesday night.\n\nGreg Monroe added 25 points and Middleton finished with 20 in his fourth game after missing the first 50. He made four free throws in the final 19 seconds as the Bucks won their third straight.\n\n\"It just shows how much we missed Khris in the close games coming down the stretch being able to put the ball in his hands,\" coach Jason Kidd said. \"I thought down the stretch we scored every time. Giannis, Khris, and then Giannis again.\"\n\nMonroe was 12 for 16 from the field after going 12 for 15 on Monday in a victory over Detroit. He has two straight 20-point games after just one previously this season.\n\nBrook Lopez scored a season-high 36 points and tied his career high with eight blocks for the Nets. They have lost 16 straight at home.\n\n\"They're like a herd coming at you and it's forceful. It's impressive,\" Nets coach Kenny Atkinson said about the Bucks. \"I think off the bat we didn't bring a physicality. If you don't bring a physicality against that athleticism it's tough. You make it a jumping contest and that's difficult.\"\n\nThe Bucks led 95-82 after a 33-point third quarter, but Spencer Dinwiddie scored 15 of his season-high 19 in the fourth and the Nets got within two a few times. But Antetokounmpo, voted to start Sunday in New Orleans, had a basket with 47 seconds to play before Middleton closed it out from the line.\n\n\"Khris makes the game a lot easier,\" Antetokounmpo said. \"He's a ball handler. He can handle the ball, so it makes my job and (Matthew) Dellavedova's job a lot easier.\"\n\nTIP-INS\n\nBucks: Michael Beasley scored 14 points, and Dellavedova and Tony Snell each had 10. ... The Bucks beat the Nets for the eighth straight time.\n\nNets: The Nets open the second half with an eight-game road trip and don't play at Barclays Center again until March 12. They haven't won in Brooklyn since Dec. 26. ... Trevor Booker scored 18 off the bench.\n\nMIDDLETON'S MINUTES\n\nMiddleton played about 18 minutes a game in his first three games but played 26 on Wednesday. Kidd said before the game the Bucks would discuss extending his minutes and role during the break, then said after Middleton was like a security blanket for the team.\n\n\"It's something I've prided myself on trying to be over my career,\" Middleton said. \"It's good that the team trusts me with the ball in my hands to make plays for everybody, not just myself.\"\n\nLIN CLOSE\n\nJeremy Lin, who hasn't played since straining his left hamstring on Dec. 26, returned to full practice Tuesday. He's expected to play Feb. 24 at Denver in the Nets' first game after the All-Star break.\n\n\"You can see his impact right off the bat and it was only an hour and 15 minute practice,\" Atkinson said. \"But we felt it and that's good for all of us, all of our morale right now, our confidence that he's on the verge of coming back. And he's anxious to come back and help the team.\"\n\nBOUCHARD'S BET\n\nTennis player Genie Bouchard watched from a courtside seat after keeping her word to a fan who asked for a date on Twitter if the Patriots won the Super Bowl. The Canadian star was in New York on Wednesday for ceremonies tied to the \"Sports Illustrated\" swimsuit issue, in which she appears .\n\nUP NEXT\n\nBucks: Host Utah on Feb. 24. The Jazz have won five of the last six meetings, including a 104-88 victory on Feb. 1.\n\nNets: Feb. 24 in Denver to start an eight-game trip.",
  "source": "espn_api",
  "crawled_at": 1764995162.596925
}