{
  "game_id": "0021800205",
  "espn_id": "401070886",
  "date": "Nov 14, 2018",
  "matchup": "MIA @ BKN",
  "headline": "Heat beat Nets 120-107 to end three-game losing streak",
  "body": "NEW YORK --  The Miami Heat were eager to rediscover their defense after their poor recent performances.\n\nThey did it rather easily against a team beginning life without its leading scorer.\n\nTyler Johnson scored a season-high 24 points, Goran Dragic had 21 and the Heat beat the short-handed Brooklyn Nets 120-107 on Wednesday night to snap a three-game losing streak.\n\nJosh Richardson added 15 points and Hassan Whiteside had 14 points and 10 rebounds for the Heat, who never trailed and led by as much as 23, setting the tone early with far better defensive focus than they showed lately.\n\n\"It has to be the way for this team,\" coach Erik Spoelstra said. \"It's hard hat, lunch pail every day and there's no other way.\"\n\nSpencer Dinwiddie scored 18 points for the Nets in their first game since losing Caris LeVert to a dislocated right foot. He could return this season from what appeared to be a severe injury when he was hurt Monday, but it could be a rough road without him for the Nets if Wednesday's game was any indication.\n\n\"I mean, obviously it's tough in the fashion that it happened,\" Nets forward Joe Harris said.\n\n\"Just the significance of how the injury happened, him being the heart and soul of the team up until this point, our go-to scorer and facilitator. Then obviously just the energy and enthusiasm and leadership that he brings, that's a void we miss a lot and it is going to be an adjustment for us.\"\n\nBrooklyn was also without starting center Jarrett Allen again because of an illness.\n\nMiami had yielded 116.7 points in its last three games but Spoelstra said before the game the Heat weren't as far away defensively as they looked during the skid, noting they had the league's sixth-ranked defense after beating San Antonio before it started.\n\nDragic said the Heat had a meeting to refocus and they were quickly locked in again, limiting the Nets to 6-for-24 shooting in the first quarter. Miami made 62.5 percent of its shots on the other end and led 37-21.\n\nThe Nets shot 40 percent overall, but the Heat held them in the mid-30s through three quarters, when the game was decided.\n\n\"When you play tough, feels like you've got more confidence defensively and then when you don't put pressure on defense, the offense just flows,\" Dragic said. \"So we feel like everybody battled. We were the more aggressive team tonight.\"\n\nJohnson shot 9 for 12 against the team that signed him to a $50 million offer sheet two summers ago, but the Heat held onto the guard by matching the deal.\n\nMiami led 90-72 lead after three. The Nets did finally cobble together enough offense to briefly get within single digits in the fourth.\n\nTIP-INS\n\nHeat: Longtime Heat forward Udonis Haslem got into a game for just the second time this season, playing two minutes and making his first field goal of the season. ... Richardson played in his 200th career game.\n\nNets: Allen Crabbe, a starter last season who has struggled offensively coming off the bench thus far, was in the lineup in LeVert's spot but fouled out with just six points. ... Brooklyn had won the last three meetings and its only loss to Miami last season came in Mexico City.\n\nROLLER-COASTER RIDE\n\nNets coach Kenny Atkinson and general manager Sean Marks both talked about the range of emotions that started with seeing LeVert going down in Minnesota with his leg bent awkwardly and taken off to a stretcher, to getting the positive diagnosis of no fractures, no surgery necessary and a potential return this season the following day. Marks wouldn't put a timetable on a possible return, but the Nets were happy there was even hope of one so soon.\n\n\"I'm obviously definitely no doctor, but I think from the optics standpoint, when you see something like that, that's pretty gruesome, you're fearing the worst unfortunately,\" Marks said. \"And then you when you get the results, look, he's going to bounce back and that's terrific.\"\n\nSEE YOU SOON\n\nThe teams meet again next Tuesday in Miami, where the Nets were 2-0 last season.\n\nUP NEXT\n\nHeat: Visit Indiana on Friday.\n\nNets: Visit Washington on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995265.964918
}