{
  "game_id": "0022200762",
  "espn_id": "401468917",
  "date": "Jan 30, 2023",
  "matchup": "TOR @ PHX",
  "headline": "Bridges scores 29, Suns pull away late, beat Raptors 114-106",
  "body": "PHOENIX -- — Deandre Ayton had to do a double-take in the final minutes as his Phoenix Suns pulled away for another win.\n\n\r\n              His eyes weren't playing tricks. That was Mikal Bridges getting big mid-range buckets during crucial possessions in the fourth quarter, not injured All-Star guard Devin Booker.\n\n\r\n              Bridges had one of his best games of the season with 29 points, Ayton added 22 points and 13 rebounds and the Suns won for the sixth time in seven games by beating the Toronto Raptors 114-106 on Monday night.\n\n\r\n              “I told Booker — ‘You know what’s crazy? These are your plays,'” Ayton said, teasing his teammate. “These are Mikal's plays now.”\n\n\r\n              The Suns are on a bit of roll despite missing Booker the past several weeks. The 6-foot-6 Bridges has always been a solid player — mostly known for his defense and 3-point shooting — but he has morphed into a lead scoring option with Booker on the shelf with a groin injury.\n\n\r\n              The fifth-year player is averaging 23 points per game over his last nine contests, which has coincided with a Suns revival after an extended midseason swoon. He shot 12 of 19 from the field against the Raptors, including 3 of 4 from 3-point range.\n\n\r\n              “I'm loving it,” Suns guard Chris Paul said. “It's a confidence thing and I think it just keeps building.”\n\n\r\n              Neither team led by more than 10 points in a contest that featured 16 lead changes and five ties.\n\n\r\n              The Raptors trailed by nine to start the second half but scored 12 straight points in the first 2 1/2 minutes of the third quarter to take a 65-62 lead. Toronto took an 84-82 advantage into the fourth.\n\n\r\n              The game stayed tight from that point forward until Phoenix pulled away in the final minutes. Bridges had a pair of clutch jumpers before Paul made a 3-pointer to push the Suns ahead 106-102 with 1:30 left. Ayton added a tip-in with 51.4 seconds left to extend the advantage to 108-102.\n\n\r\n              Paul finished with 19 points and nine assists.\n\n\r\n              “They threw some shots in that we needed to miss,” Raptors guard Fred VanVleet said. “We fought hard, we competed, but give them credit.”\n\n\r\n              Toronto was led by VanVleet's 24 points and nine assists. Gary Trent Jr. added 21 points while Pascal Siakam had 19.\n\n\r\n              “We were playing really hard, really well,” Raptors coach Nick Nurse said. “We could have down a few things and shored up the rebounding, but it didn’t really bounce our way when it needed to.”\n\n\r\n              Bridges scored 23 points on 9 of 12 shooting to push the Suns to a 62-53 halftime lead. \n\n\r\n              “I felt it for sure,” Bridges said. “The crowd had me all gassed up. The crowd and our bench. I felt it from both of them.”\n\n\r\n              TIP-INS\n\n\r\n              Raptors: G O.G. Anunoby (wrist) and F Otto Porter Jr. (foot) were out. ... Shot just 9 of 33 (27.3%) from 3-point range.\n\n\r\n              Suns: Guards Devin Booker (groin), Cameron Payne (foot) and Landry Shamet (foot) were out. ... Hosted a 53rd straight sellout crowd. ... Paul hit a 3-pointer at the first quarter buzzer to give the Suns a 32-28 lead. ... Dario Saric added 11 points over 14 minutes off the bench.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Travel to face Utah on Wednesday night.\n\n\r\n              Suns: Host Atlanta on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994046.200671
}