{
  "game_id": "0021500564",
  "espn_id": "400828451",
  "date": "Jan 10, 2016",
  "matchup": "OKC @ POR",
  "headline": "Blazers hit season-high 19 3s, rally past Russell Westbrook-led OKC",
  "body": "PORTLAND, Ore. -- After hitting his third consecutive 3-pointer, Damian Lillard flapped his arms above his head and motioned to the crowd while screaming, \"Come on, man! Let's go!\"\n\"I got some good looks at the rim and let them fly,\" Lillard said.\nThe star guard scored 31 points, including five 3-pointers in the last 3:07, and the Portland Trail Blazers rallied to beat the Oklahoma City Thunder 115-110 on Sunday night.\n\nPortland coach Terry Stotts said calling Lillard's performance \"big\" would be an understatement.\n\"You don't see that very often,\" Stotts said.\nC.J. McCollum added 22 points for Portland, which hit a season-high 19 3-pointers to snap a three-game losing streak. Lillard finished with eight 3s, which matched his career high.\nThunder guard Russell Westbrook nearly had his fourth triple-double of the season but fell short with 25 points, 15 assists and nine rebounds. Last season, Westbrook led the NBA with 11 triple-doubles.\nKevin Durant had 28 points for Oklahoma City and has scored 20 or more in 23 consecutive games.\nWith 3:19 remaining, Andre Roberson hit a buzzer-beating 3 to put Oklahoma City up 103-95. That started a 3-point shootout. Lillard hit three straight 3s, and Allen Crabbe drained another to cut the Thunder's lead to 108-107 with two minutes left.\nLillard wasn't done. He hit two more 3s to give Portland a three-point lead, and an offensive foul on Oklahoma City with a minute left brought fans to their feet. But it was Mason Plumlee's block for the Blazers with 30.9 seconds left, Lillard said, that made all the difference.\n\"Changed the game completely,\" Lillard said. \"That was the game-winner right there.\"\nLillard finished with 17 points in the final quarter. Durant went scoreless in the fourth.\n\"They played well in the fourth, and we didn't,\" Durant said. \"All those made shots kind of broke our backs.\"\nThe loss ended a four-game road win streak for the Thunder.\nThe Blazers and Thunder kept it close in a sloppy first quarter. Steven Adams slammed a one-handed dunk for Oklahoma City, and Maurice Harkless answered with a 3.\nPortland led 52-46 at halftime. Westbrook had just two points heading into the break.\nLillard's eight points in two minutes allowed the Blazers to open their lead to 65-55 in the third quarter. Quick points from the Thunder, including a 3-pointer and a free throw by Adams and a running jumper from Durant, trimmed Portland's lead to two.\nThe Thunder rallied to take the lead, but McCollum's 3 at the buzzer to end the third brought the Blazers to 85-80.\nTIP-INS\nThunder: Durant has scored 20 or more points against the Trail Blazers in the team's past five meetings. ... This was the second of four matchups between the teams this season. Oklahoma City won 106-90 on Dec. 16.\nTrail Blazers: Former Oregon running back LaMichael James was among the fans in courtside seats. James is currently a free agent in the NFL. ... Portland's bench outscored Oklahoma City's 35-16. ... Portland's 44 3-point attempts were a franchise record.\nDURANT ON THE RALLY\n\"They were coming off pick-and-rolls, shooting fall-away 3s, step-back 3s,\" Durant said. \"You've got to give them credit. That's what they do. They have two guards that make shots.\"\nABOUT ALL THOSE 3s\nAll Lillard's field goals in the final quarter were from 3-point range. He was 5-of-8 from beyond the arc in the period. ... Lillard's seventh 3-pointer of the game was the 700th of his career. He and Golden State's Klay Thompson are the only active players with 700-plus 3s in their first four seasons. ... Three times, Lillard has made eight 3-pointers in a game.\nUP NEXT\nThe Thunder continue their road trip Tuesday at Minnesota.\nThe Trail Blazers host Utah on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994176.2164109
}