{
  "game_id": "0022201203",
  "espn_id": "401469358",
  "date": "Apr 07, 2023",
  "matchup": "DET @ IND",
  "headline": "Pistons beat Pacers 122-115 to snap another 11-game skid",
  "body": "INDIANAPOLIS -- — Jaden Ivey relished taking the stage in front of his family and friends Friday night.\n\n\r\n              Then he stole the show.\n\n\r\n              The rookie finished with 29 points and nine assists, and Killian Hayes scored a career-high 28 points and the Detroit Pistons beat the Indiana Pacers 122-115. It was just Detroit's second win since the All-Star Break — both against the Pacers to snap 11-game losing streaks.\n\n\r\n              “I felt all the nerves, the happiness, the energy,” Ivey said. “It's always fun to come back to your home state. I have a lot of memories here so it's great and I'm glad we got the win.”\n\n\r\n              Even better was the fact this win came in the same building his mother, Notre Dame women's basketball coach Niele Ivey, started her WNBA career with the Indiana Fever. She was in the crowd Friday, too.\n\n\r\n              Buddy Hield made five 3-pointers and finished with 22 points to lead six Indiana players in double figures. But it wasn't enough to avoid a third straight loss, this time in the home finale.\n\n\r\n              Instead, the Pacers blew an early 11-point lead when the Pistons went on an 18-0 run over the final three minutes of the first quarter and the first two of the second to take a 42-27 lead.\n\n\r\n              The Pistons made it 70-50 late in the first half and fended off every second-half challenge Indiana posed.\n\n\r\n              “We just didn't have a very good night,” Pacers coach Rick Carlisle said. “Detroit's been undermanned but tonight they got really good play from Ivey and Hayes and they earned the win.”\n\n\r\n              When Indiana cut the deficit to eight in the third quarter, Detroit went on a 9-4 run. When the Pacers closed to 99-95 early in the fourth, the Pistons answered with an 11-4 spurt. And when the Pacers got to 112-106 with 5:03 to go, Detroit pulled away to seal a rare victory.\n\n\r\n              “It's big,” Ivey said. “This is why you play the game — to win.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Wound up with a split in the four-game season series. ... James Wiseman missed most of the first half after getting hit in the face less than two minutes into the game. He returned in the second half. ... Hayes also had six assists and four steals.\n\n\r\n              Pacers: George Hill, a 14-year veteran who attended high school and college in Indianapolis, had nine points and five assists in what could be the final game in his hometown. ... Andrew Nembhard had 12 points and 10 assists. ... Isaiah Jackson had 15 points, seven rebounds and three blocks. ... Bennedict Mathurin had 16 points.\n\n\r\n              SHORT-HANDED\n\n\r\n              With the season winding down and both teams banged up, the coaches were working with extremely short-handed benches.\n\n\r\n              Eight Detroit players sat out including Bojan Bogdanovic (left Achilles tendon) and Cade Cunningham (stress fracture in left tibia). The Pacers held out six players including All-Star guard Tyrese Haliburton (sprained right ankle), two-time NBA blocks leader Myles Turner (sore left ankle).\n\n\r\n              TIED UP\n\n\r\n              While Turner missed his seventh straight game, Haliburton missed his fifth in a row and it could come at a cost. Indiana's star guard is second in the NBA with 10.4 assists per game but has only played in 56 games this season and with one left will fall one game short of being eligible to officially rank among the league leaders.\n\n\r\n              HISTORICAL SAVE\n\n\r\n              While the Pisons already are assured of completing a franchise-worst third straight season with a winning percentage under .300, Friday's win allowed them to avoid matching the lowest winning percentage in franchise history. They went 16-66, for a .195 mark, in 1979-80, a season that included the firing of coach Dick Vitale just 12 games into the season.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Finish the season Sunday at Chicago, with the NBA's worst record.\n\n\r\n              Pacers: Close out the season Sunday at the New York Knicks.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994351.040533
}