{
  "game_id": "0022400414",
  "espn_id": "401704980",
  "date": "Dec 26, 2024",
  "matchup": "TOR @ MEM",
  "headline": "Grizzlies set team scoring record in 155-126 rout of Raptors behind Edey and Jackson",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson Jr. had 21 points, 11 rebounds and three blocks, Zach Edey also scored 21 points and grabbed 16 rebounds, and the Memphis Grizzlies set a franchise scoring record in blowing out the skidding Toronto Raptors 155-126 on Thursday night.\n\n\r\n              Desmond Bane added 19 points, Jaylen Wells scored 17 and Ja Morant had 15 points and nine assists as Memphis won for the third time in four games.\n\n\r\n              Toronto lost its ninth straight and fell to 1-14 on the road. RJ Barrett led the Raptors with 27 points, and Scottie Barnes added 26. Chris Boucher finished with 15.\n\n\r\n              Both teams played porous defense for three quarters and each had reached 100 points before the fourth started. A burst by Memphis in the third took the lead to 22.\n\n\r\n              The 155 points were the most given up by the Raptors this season.\n\n\r\n              Takeaways\r\n              Raptors: Despite the skid, Toronto had played close games recently. Of the previous seven, only one was decided by more than 10 points. \n\n\r\n              Grizzlies: Memphis leads the NBA in scoring at 122.7 points per game, and the Grizzlies scored 78 in the first two quarters — their most in a half this season.\n\n\r\n              Key moment\r\n              Memphis was already up 127-103 with 10:29 left when Raptors coach Darko Rajakovic went at official JT Orr complaining about calls. Orr handed out one technical foul but Rajakovic kept coming as players tried to restrain him. Orr then called another technical, sending a steaming Rajakovic to the locker room.\n\n\r\n              Key stat\r\n              The Grizzlies had a season-high 24 offensive rebounds, leading to 33 second-chance points — also a season best.\n\n\r\n              Up next\r\n              Toronto hosts the Atlanta Hawks on Sunday. The Grizzlies begin a five-game road trip in New Orleans on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996976.3494122
}