{
  "game_id": "0022000531",
  "espn_id": "401267691",
  "date": "Mar 01, 2021",
  "matchup": "CHI vs. DEN",
  "headline": "Jokic dominates with 39 points as Nuggets beat Bulls 118=112",
  "body": "CHICAGO -- — Nikola Jokic dominated with 39 points and 14 rebounds, and the Denver Nuggets beat the Chicago Bulls 118-112 on Monday night.\n\n\r\n                    Jokic finished with nine assists, just missing his 50th career triple-double. The three-time All-Star came up huge in the fourth quarter, scoring 17 to help the Nuggets come away with the win after blowing a 15-point lead.\n\n\r\n                    “That's the luxury of having an MVP candidate,” coach Michael Malone said. “I see all these conversations about who would you want to start a franchise with. I've never seen Nikola's name mentioned, and I'm dumbfounded by that. My nominee — I've got a write-in nominee. Nikola Jokic is a guy I'd like to build a franchise with, like we've done here in Denver and had great success with.\"\n\n\r\n                    Jamal Murray scored 24. Michael Porter Jr. added 17 points and 15 rebounds, and the Nuggets won for the third time in four games.\n\n\r\n                    All-Star Zach LaVine led Chicago with 23 points and grabbed nine rebounds. Coby White added 20 points and 10 rebounds.\n\n\r\n                    The Bulls performed better down the stretch in this one after getting dominated late in a loss to Phoenix on Friday. But they dropped their second straight after winning three in a row.\n\n\r\n                    “I thought we certainly played a lot better against these guys the last eight minutes than we certainly did against Phoenix, with all the turnovers,” coach Billy Donovan said. “I think just the totality of the game, the way we came out, was disappointing.”\n\n\r\n                    JOKIC DOMINATES\n\n\r\n                    Jokic simply took over in the fourth. \n\n\r\n                    “We were sloppy, I think,” he said. “I just wanted to be aggressive, change the rhythm, probably. I think I did.”\n\n\r\n                    He scored 10 points during a stretch of 3 minutes, 20 seconds after a big run by the Bulls that bridged the third and fourth quarters. \n\n\r\n                    Jokic also put Denver back on top with a three-point play off a dunk with two minutes remaining, and Murray then nailed a 3-pointer to make it 112-108.\n\n\r\n                    Thaddeus Young scored on a follow shot for the Bulls but Jokic hit a jumper to make it 114-110 in the closing minute.\n\n\r\n                    LaVine hit two free throws to cut the lead to two with 16 seconds left. But Will Barton and Murray each made two, preserving the win for the Nuggets.\n\n\r\n                    BULLS RUN\n\n\r\n                    The Bulls trailed by as much as 15 in the first half and were down 10 late in the third when they made their move. They went on a 21-5 run that stretched into the fourth.\n\n\r\n                    Young's driving hook and layup on the Bulls' first two possessions of the quarter put Chicago on top. White's pull-up jumper and Denzel Valentine's running layup made it 95-89 with just under 9 minutes left in the game.\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Malone said he does not expect F Paul Millsap (sprained left knee), G Gary Harris (strained left adductor) or F/C JaMychal Green (sprained left shoulder) to return before the All-Star break. ... G Facundo Campazzo and F Markus Howard missed the game because of health and safety protocols.\n\n\r\n                    Bulls: Donovan said the Bulls found out about 10 a.m. Sunday that their game against Toronto in Tampa, Florida that night was called off because of the Raptors’ COVID-19 issues. The team landed in Chicago around 4:30 p.m. \n\n\r\n                    HONORING NOAH\n\n\r\n                    Top basketball executive Arturas Karnisovas said he will “for sure” reach out to longtime Chicago center Joakim Noah about retiring as a member of the Bulls.\n\n\r\n                    Noah played his first nine seasons with the Bulls after being drafted out of Florida with the No. 9 overall pick in 2007. He made two All-Star teams with Chicago and was the 2014 Defensive Player of the Year.\n\n\r\n                    Noah has averaged 8.8 points and 9 rebounds over 13 seasons with Chicago, the New York Knicks, Memphis Grizzlies and Clippers. Los Angeles waived him prior to the start of the season. Noah also played on back-to-back NCAA championship teams at Florida under current Bulls coach Billy Donovan.\n\n\r\n                    The Athletic, citing sources, reported Monday that Noah plans to retire as a member of the Bulls. \n\n\r\n                    “It just came out that he retired,” said Karnisovas, Chicago's executive vice president of basketball operations. “We will get together and we will talk about it.”\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Visit Milwaukee on Tuesday.\n\n\r\n                    Bulls: Visit New Orleans on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997590.559136
}