{
  "game_id": "0021300669",
  "espn_id": "400489542",
  "date": "Jan 28, 2014",
  "matchup": "DET vs. ORL",
  "headline": "Pistons halt skid at 4 highlighted by Andre Drummond's double-double",
  "body": "AUBURN HILLS, Mich. -- After one of his worst games of the season, Andre Drummond got a little pep talk from Detroit coach Maurice Cheeks.\n\"I told him at shootaround that he's human,\" Cheeks said. \"He's entitled to have a bad game. It's important to see how you bounce back.\"\nDrummond had 13 points and 17 rebounds, and the Pistons snapped a four-game losing streak with a 103-87 win over the Orlando Magic on Tuesday night. Drummond bounced back from a poor outing at Dallas over the weekend, and Detroit led comfortably throughout the second half.\nDetroit has struggled to close out games at home this season, but this time the Pistons turned a double-digit lead into a rout.\n\"We needed it a lot. We're losing, a lot of bad things are around in the air -- a lot of negative energy,\" Detroit guard Will Bynum said. \"Just happy to get a win.\"\nBrandon Jennings had 20 points and eight assists for Detroit, and Josh Smith added 16 points. Victor Oladipo scored 19 points for the Magic.\nDetroit finished with 17 offensive rebounds -- 12 in the first half -- and outscored Orlando 44-22 in the paint.\nThe Magic started former Piston Jason Maxiell for this game, giving themselves a little more size against Detroit's imposing front line. It was no use. Drummond, Smith and Greg Monroe went a combined 17 for 30 from the field. Monroe finished with eight points and 11 rebounds.\n\"Sometimes it is just as simple as finding someone ... and boxing them out,\" Magic coach Jacque Vaughn said. \"You need to do that on 10 defensive possessions out of 10, not six out of 10 or nine out of 10, and we weren't even close to that, especially in the first half. When a shot goes up, find someone and get a body on them.\"\nDrummond had only four points against Dallas, and he had a scary start in this one. He stayed down for a bit holding his left leg with 6:34 left in the first quarter -- after his shoe came off during a scramble near the basket.\nDrummond was able to walk off the court, and he was back in the game almost immediately. His putback gave Detroit a 12-11 lead. Maxiell missed a dunk at the other end, and although the Magic led by two after the first quarter, Detroit controlled the second to take a 53-43 halftime lead.\nDrummond said Cheeks' pregame message helped him.\n\"Last game was a tough game for me,\" Drummond said. \"He knows I really get down on myself if I do anything wrong. For him to tell me that today at the shootaround really gave me a boost to want to be great tonight.\"\nMonroe's layup off a pass from Smith capped a 9-0 run that gave the Pistons a 70-55 lead in the third. It was 78-60 at the end of the quarter.\n\"We have to be tougher,\" Orlando's Jameer Nelson said. \"Every guy on this team needs to take pride and ownership in their individual performance and the team's performance. We didn't do that tonight, not at all.\"\nDetroit was only 7-5 at home when leading after three quarters, but there would be no late collapse in this one. Jennings connected from beyond the arc to make it 85-63, and the Pistons led by as many as 26.\n\"We've got a lot of talent on this team, and we just have to figure out the right chemistry of players, at the right times,\" Bynum said.\nBynum gave a cryptic response when asked if players are still trying to learn roles.\n\"You don't want to know what I think -- it's out of my pay grade to tell you what I think,\" Bynum said. \"Hopefully things just really turn around, and we string up some wins.\"\nGame notes\nRodney Stuckey scored 13 for the Pistons, leaving him with 6,005 points for his career. ... Maxiell had two points and one rebound in 14 minutes. ... Tobias Harris and Arron Afflalo had 14 points each for Orlando. ... The Magic's Maurice Harkless missed all six of his free throws. ... Nelson went 3 of 9 from the field and was called for an early technical foul. He finished with 11 points and seven assists.",
  "source": "espn_api",
  "crawled_at": 1764993313.2333288
}