{
  "game_id": "0022400832",
  "espn_id": "401705398",
  "date": "Feb 25, 2025",
  "matchup": "MEM vs. PHX",
  "headline": "Ja Morant helps the Grizzlies outlast the Suns 151-148 in overtime",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 29 points and eight assists, his final one a feed to Jaylen Wells for a dunk with 9.1 seconds left in overtime, and the Memphis Grizzlies closed the extra period with a 7-0 run to beat the Phoenix Suns 151-148 on Tuesday night.\n\n\r\n              Jaren Jackson Jr. scored 28 points before fouling out in the fourth quarter. Desmond Bane had 25 points and nine assists as Memphis moved into a tie for second place in the Western Conference with idle Denver.\n\n\r\n              Phoenix had five players score at least 20 points for the first time since Nov. 10, 1990. Devin Booker had 28 points and 10 assists, Kevin Durant scored 26, Bradley Beal had 24 points and a season-high 11 assists, Bol Bol had a season-high 23 points and Grayson Allen scored 21. The Suns have lost six of seven.\n\n\r\n              Morant scored the Grizzlies' final 11 points in the fourth quarter, and his floater with 1.4 seconds left in regulation tied the game at 137-all.\n\n\r\n              Durant's jumper with 1:17 left in overtime put the Suns ahead 148-144. Santi Aldama responded with a 3-pointer for Memphis, and the Grizzlies took the lead on Brandon Clark's tip-in with 37.6 seconds left. Durant missed a pair of 3-point attempts in the final four seconds.\n\n\r\n              Takeaways\r\n              Suns: Phoenix had lost the previous two games against Memphis and appeared ready to turn the tide before Morant took over in the fourth.\n\n\r\n              Grizzlies: Memphis improved to 22-6 at home.\n\n\r\n              Key moment\r\n              The feed from Morant to Wells put Memphis ahead by three, forcing the Suns' last attempts to be from outside the arc.\n\n\r\n              Key stat\r\n              The game was close throughout with 22 ties and 23 lead changes. Phoenix had the biggest lead — 10 points — in the third quarter.\n\n\r\n              Up next\r\n              The Suns host New Orleans on Thursday night. The Grizzlies continue a five-game homestand when the New York Knicks visit on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997721.9292731
}