{
  "game_id": "0021800853",
  "espn_id": "401071526",
  "date": "Feb 13, 2019",
  "matchup": "CLE vs. BKN",
  "headline": "Russell scores 36, Nets outlast Cavaliers 148-139 in 3OTs",
  "body": "CLEVELAND --  DeMarre Carroll saved the day for the Brooklyn Nets, and D'Angelo Russell took advantage of the extra opportunity.\n\nRussell scored 14 of his 36 points in the third overtime after Carroll's desperation 3-pointer in the second OT tied the game, and the Nets outlasted the Cleveland Cavaliers 148-139 on Wednesday night.\n\nRussell's big finish wouldn't have been possible if Carroll hadn't shocked everyone with his buzzer-beating shot.\n\nThe fact the play wasn't even designed for Carroll made the result even more improbable.\n\n\"It was for Joe (Harris) or Allen (Crabbe),\" he said. \"It was a broken play. I saw an opening and I took it.\"\n\nCleveland seemed to have sealed the win when Jordan Clarkson, who scored a career-high 42 points, made a go-ahead jumper in the final minute to put the Cavaliers ahead and added two free throws for a 128-125 lead.\n\nBrooklyn called timeout and Carroll was double-teamed in the corner after taking the inbounds pass. He took a couple of dribbles to his left and put up the shot. Carroll fell to the floor and was mobbed by his teammates, who stormed off the bench.\n\nRussell, who is headed to play in his first All-Star game, had two points in the first half and scored Brooklyn's first 11 points in third overtime, including two 3-pointers.\n\nRussell's teammates pulled him aside at halftime with a clear message.\n\n\"They kept pushing me,\" he said. \"They weren't letting me get down. I made sure I got the ball.\"\n\nNets coach Kenny Atkinson said: \"He was really strong in the second half and all the overtimes, but that's the sign of an All-Star.\"\n\nHarris scored 25 points and Carroll had 18 as the Nets improved to 30-29 -- above .500 at the All-Star break for the first time since 2012-13.\n\nThe teams were playing their final game before the break, likely a good thing after going 63 minutes in a contest that saw 23 lead changes.\n\nClarkson, playing a career-high 47 minutes, was 16 of 34 from the field and made 7 of 17 3-point attempts.\n\n\"We tried to leave everything on the floor trying to get a win knowing we've got these days off,\" he said. \"We didn't expect to go to three overtimes. But I'm in shape. I'll go all day.\"\n\nCollin Sexton had 24 points and Marquese Chriss added 23 for Cleveland.\n\nRussell made two free throws with 16 seconds remaining to break a 116-all tie in the first overtime, but Sexton drove the lane and scored to tie the game with 2.8 seconds left.\n\nCavaliers forward Kevin Love sat out to get additional rest following foot surgery. Brooklyn dressed nine players because of several injuries.\n\nChriss, Larry Nance Jr, David Nwaba and Ante Zizic fouled out for Cleveland, which played its first overtime game of the season.\n\nThe Cavaliers (12-46) were trying to win consecutive games for the third time this season. Cleveland has the third-worst record in the league.\n\nTIP-INS\n\nNets: G Spencer Dinwiddle (torn ligaments in right thumb) F Treveon Graham (personal reasons), F Rodions Kurucs (sprained left elbow), F Jared Dudley (strained left hamstring) and G Dzanan Musa (G-League assignment) are out.\n\nCavaliers: F Cedi Osman and C Ante Zizic returned to the starting lineup. Osman (sprained right ankle) missed four games and Zizic (sore lower back) didn't play Monday. ... F Tristan Thompson (sore left foot) is expected to return sometime after the break. He has missed the last 13 games.\n\nLOOKING AHEAD\n\nLove plans to increase his playing time following the All-Star break. The Cavaliers resume play against Phoenix on Feb. 21.\n\n\"I don't know minutes-wise what it's going to be like, but a good progression after that because I will be fully prepared to go,\" Love said.\n\n\"He's in a really good place right now both physically and mentally,\" Cavaliers coach Larry Drew said.\n\nSTREAK SNAPPER\n\nThe Nets, who had lost two straight and five of six, are sixth in the Eastern Conference.\n\n\"That was one of those weird games before the break,\" Atkinson said. \"It would have been tough with a loss, but this really keeps our morale up.\"\n\nUP NEXT\n\nNets: Host Portland on Thursday, Feb. 21.\n\nCavaliers: Host Phoenix on Thursday, Feb. 21.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994754.416089
}