{
  "game_id": "0022000413",
  "espn_id": "401267573",
  "date": "Feb 14, 2021",
  "matchup": "TOR vs. MIN",
  "headline": "Timberwolves end 4-game losing streak with win over Raptors",
  "body": "TAMPA, Fla. -- — Karl-Anthony Towns had just enough scoring help from his teammates for the Minnesota Timberwolves to end a four-game losing streak.\n\n\r\n                    Towns scored seven of his 20 points late in the fourth quarter before fouling out with 38 seconds left, and the Timberwolves beat the Toronto Raptors 116-112 Sunday night.\n\n\r\n                    Malik Beasley also scored 20 points, hitting six of 10 3-point shots, and rookie Anthony Edwards added 18 for the Timberwolves, who shot 69% in the second half. Ricky Rubio contributed 16 points and five assists.\n\n\r\n                    “If you go 6 for 10 and 7 for 13 (in the preceding game), we've got to get him the ball more,” Towns said of Beasley, who is averaging 24.6 points in seven February games. “He's opening up the court for me. I haven't played with a shooter like that for a long time.”\n\n\r\n                    The Raptors (12-15) had a chance to tie the game in the closing seconds after Beasley stepped out of bounds with 12.1 seconds left for Minnesota's eighth turnover of the fourth quarter. But, Pascal Siakam missed a layup that was contested by 6-foot-10 Jaden McDaniels. Jordan McLaughlin clinched the victory with two free throws with 3.7 seconds left. \n\n\r\n                    Kyle Lowry led the Raptors with 24 points, including 12 in the fourth quarter, helping the Raptors overcome a 12-point deficit.\n\n\r\n                    “He went to the free throw line 12 times,” coach Nick Nurse said, “so you can tell how hard he was trying to will us in there.\"\n\n\r\n                    Fred VanVleet and Norman Powell added 22 points apiece. Siakam finished with 18 points, eight rebounds and six assists for Toronto, which was coming off a 4-2 road trip.\n\n\r\n                    Edwards converted three layups in a 17-2 run that put the Timberwolves up 91-79 late in the third quarter.\n\n\r\n                    VanVleet scored 19 points in the first half, including nine straight that lifted the Raptors to a five-point lead late in the second quarter. \n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Shot 52% overall after coming into the game with the NBA's third-worst field goal percentage (.439). ... G D'Angelo Russell missed a third straight game with a sore left leg. ... Five assists moved Rubio up to 83rd on the all-time NBA list.\n\n\r\n                    Raptors: F OG Anunoby missed a 10th game with a strained left calf. ... F Yuta Watanabe missed a third game with a sprained left ankle. ... With four rebounds, Lowry moved ahead of Amir Johnson to become the franchise's fourth-leading rebounder. ... VanVleet entered the game third in the NBA in minutes per game (36.3). Siakam was 14th and Lowry 22nd.\n\n\r\n                    HOME STREAK ENDS, BUT NOT REALLY\n\n\r\n                    The Raptors had won 16 straight “home” games against the Timberwolves, the longest homecourt win streak against any team for Toronto. That gets an asterisk because the Raptors are playing their home games 1,300 miles from Toronto this season as a result of Canadien border restrictions due to COVID-19. The Timberwolves have not won in Toronto since Jan. 21, 2004. \n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: Play at home Tuesday night against the Los Angeles Lakers, who beat them by 36 points on Dec. 27.\n\n\r\n                    Raptors: Open a two-game series Tuesday night at Milwaukee, their eighth city in 15 days.\n\n\r\n                    ------\n\n\r\n                     More AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports \n\n\r\n                    .",
  "source": "espn_api",
  "crawled_at": 1764996867.6223779
}