{
  "game_id": "0022200690",
  "espn_id": "401468845",
  "date": "Jan 20, 2023",
  "matchup": "LAL vs. MEM",
  "headline": "Lakers rally to snap Grizzlies' winning streak at 11 games",
  "body": "LOS ANGELES -- — Lakers coach Darvin Ham had seen his squad on the wrong end of close losses for the past week.\n\n\r\n              On Friday night, Ham saw his team's mettle and resolve pay off.\n\n\r\n              Dennis Schröder completed a three-point play with 7.6 seconds after a steal, and Los Angeles rallied past Memphis 122-121 to snap the Grizzlies' winning streak at 11 games.\n\n\r\n              “To get a win like this is a momentum swing,” Ham said. “The guys were kind of down after the Sacramento game, but we addressed areas that we needed to get better. There’s no way we win this game if we didn’t have the type of fight that we had.” \n\n\r\n              The Lakers had lost their last three games by a total of 10 points. They trailed 114-107 with 3:04 remaining before outscoring the Grizzlies 15-7 the rest of the way.\n\n\r\n              Schröder stole the ball from Desmond Bane near halfcourt and made a layup while being fouled by Bane to tie it at 120. Schröder then hit a free throw for the lead.\n\n\r\n              “We wanted to trap first before we fouled,” said Schröder, who scored 19 points. “I saw Bane catch the ball, he had his back to me and I made a play. I got the steal, pushed the ball, got fouled and finished the play.”\n\n\r\n              After a timeout, Memphis' Brandon Clarke was fouled with 1.9 seconds remaining. He made the first free throw, but missed the second. Bane got the offensive rebound but lost control of it, giving the Lakers possession with 0.4 seconds left.\n\n\r\n              Russell Westbrook led the Lakers with 29 points and LeBron James added 23. It was only the second time this season Los Angeles won when trailing after three quarters.\n\n\r\n              The Lakers were outrebounded 63-47, but had a 20-4 edge in fast-break points. \n\n\r\n              “We were resilient the whole game,” James said. “We stuck with the game plan. We've given ourselves a chance to win games.”\n\n\r\n              Ja Morant led Memphis with 22 points. Clarke and Tyus Jones added 20 apiece, and Steven Adams had 16 points and 17 rebounds. \n\n\r\n              One significant reason for the Grizzlies' loss was free throws. They were 26 of 40 from the line, the ninth time this season they shot 65% or worse.\n\n\r\n              “They outcompeted us for 48 minutes. Plain and simple. Terrible effort,” Grizzlies coach Taylor Jenkins said.\n\n\r\n              Morant missed his first five shots and was 2 of 10 with six points in the first half before he had a heated courtside conversation with Shannon Sharpe — the Pro Football Hall of Famer and Fox Sports personality — before halftime.\n\n\r\n              Morant had 14 points in the third quarter and the Grizzlies held a 13-point lead late in the period.\n\n\r\n              “We gave up too many second-chance points. Just have to win the 50-50 plays,” Morant said. “We've got a lot of good, but a lot of cleaning up to do.”\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Memphis pulled down a season-high 24 offensive rebounds. ... Clarke also had 10 rebounds. ... Bane scored 16 points and Jaren Jackson Jr. added 12. ... Adams had seven rebounds in the first quarter, the fifth time this season he has had seven or more in the first.\n\n\r\n              Lakers: Troy Brown Jr. and Kendrick Nunn scored 11 points apiece and Troy Brown Jr. had 10. ... LA blocked five shots in the first quarter. ... Los Angeles scored 41 points in the fourth quarter and has scored at least 40 in four quarters this season.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At Phoenix on Sunday night.\n\n\r\n              Lakers: At Portland on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994127.0039139
}