{
  "game_id": "0022400461",
  "espn_id": "401705027",
  "date": "Jan 01, 2025",
  "matchup": "ATL @ DEN",
  "headline": "Nikola Jokic has triple-double as Nuggets roll past Hawks 139-120 for 3rd straight win",
  "body": "DENVER -- — Nikola Jokic had 23 points, 17 rebounds and 15 assists in leading the Denver Nuggets to a 139-120 win over Trae Young and the Atlanta Hawks on Wednesday night.\n\n\r\n              Jokic nearly notched a triple-double in the first half, finishing an assist shy. He secured his 144th career triple-double early in the third quarter. \n\n\r\n              Jamal Murray scored 21 points, while Russell Westbrook added 16 to go with 11 assists as the Nuggets won their third straight game. It started a busy 17-game month on the right note for Denver.\n\n\r\n              The Nuggets finished a perfect 21 of 21 from the free throw line. They also set a season-high in assists with 44 as they finished 2-0 against the Hawks this season. The Nuggets won in Atlanta 141-111 on Dec. 8 behind Jokic’s 48-point, 14-rebound performance.\n\n\r\n              Young had 30 points and nine assists, while reserve De’Andre Hunter added 20 as Atlanta saw its four-game win streak halted.\n\n\r\n              Takeaways\r\n              Hawks: Atlanta fell to 11-11 all-time on New Year’s Day.\n\n\r\n              Nuggets: Westbrook continues to add a spark to the starting lineup with Aaron Gordon sidelined by a strained right calf. The Nuggets had seven players finish in double figures.\n\n\r\n              Key moment\r\n              The Nuggets broke open the game with a 39-14 run in the third quarter. Young was called for a technical foul during the stretch, and Hunter drew a technical for flopping.\n\n\r\n              Key stat\r\n              Young now has five or more assists in 193 straight regular season games. It’s the third-longest streak in NBA history, trailing only John Stockton (336) and Isiah Thomas (209).\n\n\r\n              Up next\r\n              Hawks visit the Los Angeles Lakers on Friday, while Nuggets host San Antonio.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997929.210179
}