{
  "game_id": "0022401067",
  "espn_id": "401705633",
  "date": "Mar 28, 2025",
  "matchup": "CLE @ DET",
  "headline": "Pistons beat East-leading Cavaliers 133-122 and lock down 1st winning season since 2016",
  "body": "DETROIT -- — Tim Hardaway Jr. scored a season-high 32 points and the Detroit Pistons beat the Eastern Conference-leading Cleveland Cavaliers 133-122 on Friday night to guarantee their first winning season since 2016.\n\n\r\n              Detroit withstood a 38-point performance by Cleveland's Donovan Mitchell, who scored 22 in the fourth quarter.\n\n\r\n              The Pistons (42-32) played without Cade Cunningham (calf) and were still able to end a 12-game losing streak against Cleveland. \n\n\r\n              Dennis Schroder started for Cunningham and had 16 points and 10 assists. Jalen Duren added 16 points and 13 rebounds, and Ausur Thompson contributed 18 points and 10 boards for Detroit, which failed to win 25 games in the last five seasons.\n\n\r\n              The Pistons have eight regular-season games remaining. With three more wins, Detroit could reach 45 victories for the first time since going 59-23 in 2007-08 — also the last season it won a playoff game.\n\n\r\n              Darius Garland had 21 points for Cleveland, which hadn't lost to the Pistons since Feb. 24, 2022, when current Pistons coach J.B. Bickerstaff was in charge of the Cavaliers.\n\n\r\n              The Cavaliers trailed 108-89 with 8:56 to play and closed within 119-117 on Mitchell's 3-pointer with 3:31 left. Detroit answered with a 12-1 run to close out the win.\n\n\r\n              Takeaways\r\n              Cavaliers: Are a victory away from their first 60-win season since 2009-10. \n\n\r\n              Pistons: Cunningham missed his third straight game and is listed as day-to-day. \n\n\r\n              Key moment\r\n              Hardaway had 10 points as the Pistons started the second half with a 13-4 run to take a 76-62 lead. The Pistons finished the quarter with a 38-25 advantage for an 18-point lead heading into the fourth.\n\n\r\n              Key stat\r\n              The Pistons had a 25-6 advantage in fast-break points.\n\n\r\n              Up next\r\n              Both teams play Monday. Cleveland hosts the Los Angeles Clippers, and Detroit is at Minnesota in the opener of a three-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998305.000365
}