{
  "game_id": "0022400676",
  "espn_id": "401705242",
  "date": "Jan 30, 2025",
  "matchup": "HOU @ MEM",
  "headline": "Bane scores 24 points, Jackson hits go-ahead free throws as Grizzlies beat Rockets 120-119",
  "body": "MEMPHIS, Tenn. -- — Desmond Bane had 24 points and 12 rebounds, Jaren Jackson Jr. made the go-ahead free throws with 8.6 seconds left and scored 21, and the Memphis Grizzlies rallied past the Houston Rockets 120-119 on Thursday night.\n\n\r\n              Luke Kennard added 21 points and Santi Aldama had 15 for Memphis, which has won six of seven.\n\n\r\n              Jalen Green led the Rockets with 25 points. Dillon Brooks had 22 points and Amen Thompson finished with 21 points and seven rebounds. Houston's four-game winning streak ended.\n\n\r\n              Memphis (32-16) moved within one-half game of Houston for second in the Western Conference.\n\n\r\n              Both teams were without key players. Houston's Alperen Sengun, who was announced as a Western Conference All-Star reserve earlier Thursday, was out with a left calf contusion, and Memphis guard Ja Morant sat out with right shoulder soreness.\n\n\r\n              Takeaways\r\n              Rockets: Houston built an 11-point first-half lead on the strength of its 3-point shooting, but couldn't hold off Memphis down the stretch.\n\n\r\n              Grizzlies: Memphis finally got past Houston after losing the teams' previous three meetings this season.\n\n\r\n              Key moment\r\n              WIth 13 seconds left, the Grizzlies' Jaylen Wells was driving for a go-ahead, fast-break layup when official Marat Kogut called timeout. Memphis coach Taylor Jenkins was livid, saying he never called timeout, and it appeared he was motioning for Wells to drive to the basket rather than signaling to stop the clock. However, Jackson drove into the paint and was fouled after the timeout, setting up the go-ahead free throws.\n\n\r\n              Key stat\r\n              The Rockets grabbed 19 offensive rebounds, leading to 30 points.\n\n\r\n              Up next\r\n              The Rockets host Brooklyn on Saturday. The Grizzlies play at Milwaukee on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997374.319645
}