{
  "game_id": "0022300950",
  "espn_id": "401585578",
  "date": "Mar 13, 2024",
  "matchup": "CHA @ MEM",
  "headline": "Miles Bridges scores 27, rookie Vasa Micic has career-best 25 as Hornets beat Grizzlies 110-98",
  "body": "MEMPHIS, Tenn. -- — Miles Bridges scored 27 points, rookie Vasa Micic added a career-best 25 and the Charlotte Hornets defeated the Memphis Grizzlies 110-98 on Wednesday night.\n\n\r\n              Micic shot 9 of 10, including 5 of 6 from 3-point range, and had eight assists. Grant Williams added 18 points for the Hornets, 15 of them in the fourth quarter when he made all five of his shots. Tre Mann, who missed the previous three games with a groin strain, finished with 10 points, as did Brandon Miller.\n\n\r\n              The game was sloppy throughout with Memphis committing 24 turnovers, and the Hornets having 20. Memphis shot 42.4% overall and 16 of 40 from outside the arc, while Charlotte shot 53.7%.\n\n\r\n              “It was their transition,” Memphis center Trey Jemison said. “They were running, and we weren't matching that. Not talking enough. That ends up being a big problem for us.”\n\n\r\n              GG Jackson led the Grizzlies with 26 points, while Luke Kennard scored 17. Jemison had 14 points and John Konchar finished with 13 points and nine rebounds for the Grizzlies, who have lost three of four.\n\n\r\n              Early in the fourth quarter, Hornets coach Steve Clifford reminded officials that Charlotte had not shot a free throw through three quarters, The Hornets finally got to the line with 10:13 left in the game. Mann, trying to convert a three-point play, missed the free throw. Charlotte ended the night 9 of 13 from the line.\n\n\r\n              The Hornets built a double-digit lead in the first half, and maintained most of that advantage while continuing to shoot better than 50% through three quarters. Charlotte held an 80-70 lead entering the fourth.\n\n\r\n              There were times where the Grizzlies got the lead under double digits, but Charlotte answered those runs.\n\n\r\n              The Grizzlies, as usual this season, were short-handed, with 11 players listed as unavailable.\n\n\r\n              “They've been decimated by injuries,” Clifford said. “Yet, when you watch them, they are in the game almost every night regardless of who they play. That's a good win for us. It's hard to come in here and play, and they are hard to play against.”\n\n\r\n              The Grizzlies, sitting in the Western Conference's 13th spot, were facing a team near the bottom of the Eastern Conference for the second straight night. Memphis beat the league-worst Washington Wizards 109-97 on Tuesday.\n\n\r\n              The Hornets were coming off a 114-97 loss at Detroit on Monday. Charlotte and Memphis are at the bottom of the league in points per game.\n\n\r\n              The Hornets built a 56-46 lead at the half as both teams had trouble holding onto the ball. Memphis committed 11 turnovers and Charlotte had 13.\n\n\r\n              But the Hornets offset throwing the ball away by shooting 53%, including 8 of 18 from outside the arc. Charlotte led by 18 points in the first half.\n\n\r\n              “We were flat to start, and the Hornets definitely took advantage of that in the first half,” Memphis coach Taylor Jenkins said. “Not our best effort.”\n\n\r\n              The Hornets improved to 8-26 on the road, including 5-10 against the West.\n\n\r\n              “Every win on the road is big in the NBA,” Bridges said. “As long as we keep getting better, that's all I'm worried about.”\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host Phoenix on Friday.\n\n\r\n              Grizzlies: Host Oklahoma City on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995946.37872
}