{
  "game_id": "0022400524",
  "espn_id": "401748704",
  "date": "Feb 19, 2025",
  "matchup": "CHA @ LAL",
  "headline": "Hornets stun Lakers 100-97 after Luka struggles and LeBron misses 2 late shots to tie it",
  "body": "LOS ANGELES -- — Miles Bridges scored 29 points, LaMelo Ball added 27 and the Charlotte Hornets stunned LeBron James and Luka Doncic with a 100-97 victory over the Los Angeles Lakers on Wednesday night.\n\n\r\n              James scored 16 of his 26 points in the fourth quarter, but missed two 3-point attempts right before the buzzer. Doncic had 14 points, 11 rebounds and eight assists in his third game for the Lakers, who bookended the All-Star break with losses to Utah and Charlotte, two of the NBA’s worst teams.\n\n\r\n              After Nick Smith Jr. hit a go-ahead 3-pointer with 48 seconds left, Rui Hachimura missed two free throws. Ball drove for a finger-roll layup with 14.2 seconds left. James hit a 3-pointer with 6.8 seconds left, but Ball hit two free throws and James missed twice to seal the Hornets' second win in 11 games.\n\n\r\n              Mark Williams had 10 points and nine rebounds in his first game since the Lakers acquired the center in a trade and then rescinded the deal.\n\n\r\n              Takeaways\r\n              Hornets: Trailed 65-53 with four minutes left in the third quarter before making a 22-1 run. Los Angeles missed 10 straight shots in a 6:39 span.\n\n\r\n              Lakers: Their seven-game home winning streak ended. Austin Reaves was ejected by referee Rodney Mott late in the third quarter after a brief exchange of words, and Charlotte went on a massive run immediately afterward.\n\n\r\n              Key moment\r\n              Doncic put the Lakers ahead with a putback basket with 1:03 to play, but Smith coolly answered with an open 3-pointer — his fourth of the night after an ice-cold start.\n\n\r\n              Key stat\r\n              Doncic was 5 of 18 from the field and 1 for 9 on 3-pointers in a game rescheduled from January due to the devastating wildfires in Southern California .\n\n\r\n              Up next\r\n              \r\n              Both teams play Thursday night. The Hornets are at Denver, and the Lakers are at Portland.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997440.207428
}