{
  "game_id": "0022300729",
  "espn_id": "401585357",
  "date": "Feb 07, 2024",
  "matchup": "ATL @ BOS",
  "headline": "Porzingis, White lead Celtics to 125-117 win over Hawks",
  "body": "BOSTON -- — Kristaps Porzingis scored 31 points, Derrick White scored 12 of his 21 points in the fourth quarter and the Boston Celtics beat the Atlanta Hawks 125-117 on Wednesday night. \n\n\r\n              Jayson Tatum finished with 20 points, nine rebounds and seven assists as the Celtics improved to 24-3 at home and won their seventh straight over the Hawks. Al Horford added 14 points with eight rebounds and eight assists and Jaylen Brown finished with 15 points. \n\n\r\n              “When we’re playing like that and we’re moving it like that, I just think that puts us in a different dimension offensively,” Horford said. “We have so many weapons out there that it becomes very tough to defend us.”\n\n\r\n              Brown was the only Boston starter not to hit a 3-pointer as the Celtics went 17 for 49 from beyond the arc, making 9 of 16 in the fourth quarter to put away the pesky Hawks.\n\n\r\n              Saddiq Bey led Atlanta with 25 points. Trae Young had 20 points and 10 assists and Jalen Johnson and Onyeka Okongwu added 19 points apiece for the Hawks. Johnson had 15 rebounds and Atlanta finished with a 49-45 rebounding advantage and had only nine turnovers to Boston's 14, but could not overcome the Celtics' shooting 52.7% (49-93) from the floor.\n\n\r\n              “When you shoot then you’re going to have to make some shots against a team that shoots it as well as Boston does,” Atlanta coach Quin Snyder said.\n\n\r\n              Atlanta had won four straight before the streak ended Sunday night with a 149-144 loss to the Los Angeles Clippers. The Hawks stayed within seven points through the first three quarters but didn’t have enough to overcome a surge by the Celtics early in the fourth quarter.\n\n\r\n              Atlanta also struggled from outside, making just 4 of 17 3-pointers in the second half. \n\n\r\n              “I thought the looks we had from three were clean. The ball just didn’t accommodate us,” Snyder said. \n\n\r\n              Although the Hawks rallied to pull within five in the final minute, it was too late to finish a comeback.\n\n\r\n              “I thought the way we played the game tonight was kind of how I like our approach to be,” Boston coach Joe Mazzulla said. “We never wished for it to be over. We never wished for things to be a little bit easier. We just played the game and continued to chip away at it and think that’s the space that we have to live in.”\n\n\r\n              White made three 3-pointers in the first four minutes of the fourth quarter and went 4 for 5 from long range in the period. His third 3-pointer of the quarter pushed the lead to 109-98 — Boston’s largest of the game — with 8:01 left to play. He added another from outside as Boston stretched the lead to 13. \n\n\r\n              “I felt like when we really needed to separate, we did that. We got some key stops and then our guys hit some big shots,” Horford said. \n\n\r\n              Brown returned after missing Sunday’s game with a back injury but the Celtics were without Jrue Holiday, who was out with a sprained right elbow. \n\n\r\n              Hawks center Clint Capela sat out his second straight game with a muscle strain in his left hip. \n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Philadelphia on Friday night. \n\n\r\n              Celtics: Host Washington on Friday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996283.911106
}