{
  "game_id": "0021800526",
  "espn_id": "401071202",
  "date": "Dec 28, 2018",
  "matchup": "LAL vs. LAC",
  "headline": "Lou's 36 send Clips past Lakers 118-107 in 1st clash of year",
  "body": "LOS ANGELES --  Even while playing without LeBron James on the tail end of a back-to-back set, the Los Angeles Lakers managed to carve out a double-digit lead in the third quarter against the Los Angeles Clippers.\n\nThat's when the Clippers' four toughest defenders clamped down and Sweet Lou went wild to win this basketball-loving city's first rivalry game of the season.\n\nLou Williams had a season-high 36 points and the Clippers scored 22 consecutive points during the second half of a 118-107 victory over the depleted Lakers on Friday night.\n\nDanilo Gallinari added 19 points and 10 rebounds for the Clippers, who held the Lakers without a field goal for more than six minutes while matching the longest unanswered scoring run by any team in the NBA this season.\n\n\"We were just a little sluggish,\" Williams said. \"We were just a step slow. We knew they were on a back-to-back, but for whatever reason, we just weren't playing our best until we put a good stretch together in the third and then busted the game wide open in the fourth.\"\n\nAlthough both LA franchises are still building chemistry after major roster changes in 2018, the Clippers found a groove to get it done in front of the Lakers' jeering home fans.\n\nThey showed some style, too: After Williams punctuated a decisive 3-pointer by mimicking Lakers guard Lance Stephenson's air guitar celebration of big shots, Montrezl Harrell grinningly waved on the boos in the final minute.\n\nThe Clippers turned a seven-point deficit into a 15-point lead early in the fourth quarter of their fourth win in five games. Williams torched his former team yet again, scoring 23 points in the second half, yet the game turned with the suffocating defense played by Patrick Beverley, Harrell, Avery Bradley and Sindarius Thornwell during that 22-0 run.\n\n\"We put the bulldogs on the floor, and the fight was amazing,\" Clippers coach Doc Rivers said.\n\nWilliams hit three 3-pointers, including a decisive shot with 2:23 to play, and the skinny 6-foot-1 guard even grabbed seven rebounds while making all 11 of his free throws.\n\n\"Lou has seen pretty much every defense you can throw at him,\" Rivers said. \"He's a professional scorer.\"\n\nKyle Kuzma scored 24 points and Lonzo Ball had 19 for the Lakers, who played without James, Rajon Rondo and JaVale McGee. The remaining Lakers lost for the fifth time in seven games, following up their surprising win at Golden State on Christmas Day with just their third back-to-back defeats since October.\n\nJames watched from the bench in street clothes after causing a pregame stir on social media when he entered the Lakers' locker room holding a glass of wine. The noted oenophile and four-time NBA MVP is day-to-day with his strained groin, but James isn't expected to miss as much time as Rondo, who is out for at least a month after surgery on his right index finger.\n\n\"I know we can get through it,\" Lakers coach Luke Walton said. \"I know it's not going to be easy, but I believe in the guys that we have. We've just got to do a couple of things a little bit better.\"\n\nOne night after losing at Sacramento on a buzzer-beating 3, the Lakers again couldn't win without three veteran regulars.\n\nIngram and Ball both picked up four fouls during the third quarter, but neither team made a big move until the Clippers scored the final nine points of the quarter and continued their one-sided run well into the fourth.\n\n\"A lot of us ran out of gas right there,\" Kuzma said. \"When we're tired physically, our mental aspect has to be better.\"\n\nTIP-INS\n\nClippers: Williams hit a 3-pointer from just past halfcourt at the halftime buzzer. ... They have won four straight \"road\" games against the Lakers, but lost their last \"home\" game in the series.\n\nLakers: They showed why they're the NBA's worst team at the line by missing more free throws in the first quarter (7) than the Pistons, Pacers, Bulls, Wizards, Raptors, Magic, Hornets, Nets, Heat, Cavaliers and Pelicans missed in their entire games Friday. ... Michael Beasley is still away from the team after his mother's death.\n\nA LITTLE PERSPECTIVE\n\nThe Clippers have won 22 of their last 25 meetings with the Lakers, yet still trail the 16-time NBA champions 146-70 in the overall series. This is still an exciting time for hoops in LA: The Lakers (20-16) have been revitalized around James, while the Clippers (21-14) have formed a surprisingly strong core after shedding longtime mainstays Blake Griffin, DeAndre Jordan and Chris Paul over the previous year.\n\nT'D UP\n\nJosh Hart scored 12 points for the Lakers before getting ejected with 4:41 left after he was infuriated that Tobias Harris wasn't called for pushing off. Walton also got a technical foul in the exchange.\n\nUP NEXT\n\nClippers: Host San Antonio on Saturday.\n\nLakers: Host Sacramento on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994333.789779
}