{
  "game_id": "0022000957",
  "espn_id": "401307760",
  "date": "May 01, 2021",
  "matchup": "CHA vs. DET",
  "headline": "LaMelo Ball returns, helps Hornets beat Pistons 107-94",
  "body": "CHARLOTTE, N.C. -- — LaMelo Ball returned from a 21-game absence with 11 points, leading the Charlotte Hornets to a 107-94 victory over the Detroit Pistons on Saturday night. \n\n\r\n                    A leading candidate for Rookie of the Year, Ball had surgery to repair a broken wrist sustained on March 20. The point guard played 28 minutes and added eight rebounds and seven assists, including a nifty underhand pass from his own backcourt to Miles Bridges.\n\n\r\n                    “You have to have top-notch confidence to pull something like that off,” Bridges said. “He threw it right to my pocket. It’s good to have him back.”\n\n\r\n                    Terry Rozier led Charlotte with 29 points, including a 3-pointer to beat the shot clock to help stave off Detroit’s final rally late in the fourth quarter. \n\n\r\n                    Bridges added 27 points on 11-of-16 shooting and PJ. Washington had 16. Malik Monk, who returned after a 15-game absence (ankle), joined Ball with 11 points.\n\n\r\n                    “I felt the game coming back to me,” Ball said. “Every day I woke up and the wrist was feeling better.”\n\n\r\n                    Charlotte blocked 15 shots, a season high for any team and the fifth time the Hornets have had 15 or more blocks in a game in franchise history. They beat the Pistons for the 12th straight time.\n\n\r\n                    Frank Jackson scored 25 points for Detroit, which has lost five of six. Saddiq Bey added 22, Tyler Cook 12, and Killian Hayes 10 for the Pistons, who cut the lead to single digits twice in the second half but couldn’t draw any closer.\n\n\r\n                    Bridges left in the third period after appearing to injure his right shoulder blocking a shot. He had the shoulder on ice until late in the period and returned. \n\n\r\n                    The Hornets, who entered the day eighth in the Eastern Conference, snapped a two-game skid. They’ll play in Detroit on Tuesday.\n\n\r\n                    “I expect it to only get better from here, but it was a breath of fresh air just to have that jolt back in the gym for us,” Hornets coach James Borrego said of Ball's return. “We found our way playing with pace even before this, but Melo really takes it to the next level.”\n\n\r\n                    RISING ROOKIE\n\n\r\n                    Borrego feels like Ball will prove he’s the Rookie of the Year in his final 10 games.\n\n\r\n                    “We were climbing the standings with him in the lineup and Malik in the lineup,” Borrego said. “LaMelo has had a major impact on our winning this season. For a young guy to put up those numbers, but to do it with that sort of winning impact, is significant for us.”\n\n\r\n                    Ball averaged 15.9 points and Monk 13.1 before their injuries.\n\n\r\n                    COACH'S COMPLIMENT\n\n\r\n                    Frank Jackson, a former Hornets draft pick, has filled a sixth-man need in Detroit. His coach identifies with his style.\n\n\r\n                    “I’m happy for him,” Pistons coach Dwane Casey said of Jackson, averaging a career-best 9.1 points. “He’s my kind of guy. He’s worked, scratched, and earned everything.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Charlotte missed its first 10 3-point attempts and finished 14 of 37. … Forward Gordon Hayward (right foot sprain) did not play. … Guard Devonte’ Graham (right knee contusion) also missed the game.\n\n\r\n                    Pistons: Detroit started three rookies — Bey, Hayes, and Isaiah Stewart. Josh Jackson, with three years of service, was the most senior starter. … Detroit had seven players unavailable for the game Saturday. Ruled out: Hamidou Diallo, Wayne Ellington, Jerami Grant, Cory Joseph, Jahlil Okafor, Mason Plumlee, and Dennis Smith Jr.\n\n\r\n                    UP NEXT:\n\n\r\n                    Hornets: Host Miami on Sunday.\n\n\r\n                    Pistons: Host Orlando on Monday.",
  "source": "espn_api",
  "crawled_at": 1764997009.293529
}