{
  "game_id": "0021800388",
  "espn_id": "401071069",
  "date": "Dec 09, 2018",
  "matchup": "TOR vs. MIL",
  "headline": "Antetokounmpo has 19 points, Bucks beat Raptors 104-99",
  "body": "TORONTO --  After playing a starring role down the stretch, Malcolm Brogdon called this Milwaukee's best performance of the season.\n\nBrogdon hit tying and go-ahead 3-pointers in the final 67 seconds and the Bucks held on to beat Toronto Raptors 104-99 on Sunday night.\n\nBrogdon scored eight of his 18 points in the fourth quarter, Giannis Antetokounmpo had 19 points and matched a season high with 19 rebounds, and Brook Lopez had 19 points for the Bucks, the first team to beat Toronto twice this season.\n\n\"In terms of having a full game, playing hard on both ends and executing at a high level on both ends, executing the game plan, and then finishing strong down the stretch, that is definitely the top game for us,\" Brogdon said.\n\nThe Bucks (17-8) bounced back from Friday's loss to Golden State and have yet to lose consecutive games this season.\n\n\"That's how special this team is,\" Antetokounmpo said.\n\nSerge Ibaka scored 22 points and Kawhi Leonard had 20 for the Raptors, who have lost two straight, the second time this season they've suffered consecutive defeats. Toronto, which lost 106-105 at Brooklyn on Friday, dropped three straight from Nov. 12 to 16, losing at home to New Orleans and Detroit before an overtime defeat at Boston.\n\nFred VanVleet scored a season-high 19 points and Pascal Siakam had 17 for the Raptors, whose 21-7 record is best in the NBA.\n\nNeither Leonard (rest) nor Antetokounmpo (concussion protocol) played when the Raptors lost 124-109 at Milwaukee on Oct. 29, Toronto's first defeat following a 6-0 start.\n\nToronto's Kyle Lowry shot 0 for 5 and didn't score for the first time since March 17, 2013 against Miami. Lowry led the Raptors with seven assists.\n\n\"Just couldn't find the open ones tonight,\" Lowry said. All of his misses Sunday were from 3-point range.\n\nMilwaukee led 79-74 heading to the fourth and pushed its lead to 85-74.\n\nToronto battled back to lead 97-94 on a 3 by Leonard at 2:07, but Brogdon hit the tying 3 at 1:07 and followed with a go-ahead jumper with 40 seconds left.\n\n\"We did a great job trusting one another and moving the ball,\" Antetokounmpo said. \"Malcolm hit some huge shots.\"\n\nMiddleton assisted on both of Brogdon's key baskets and finished with five assists.\n\n\"I'm going to get the glory for the shots but Khris is the one who sacrificed and made the extra pass to get it to me,\" Brogdon said.\n\nVanVleet answered with a layup, but Antetokounmpo restored the 3-point cushion with a driving dunk.\n\nLeonard hit the rim with a potential tying 3 and Ersan Ilyasova was fouled as he grabbed the rebound. Ilyasova sealed it by making both free throws with seven seconds remaining, and Toronto did not attempt another shot.\n\nMilwaukee led 51-49 at halftime.\n\nTIP-INS\n\nBucks: Newly acquired G George Hill and C Jason Smith were active but did not play. ... Antetokounmpo led the Bucks with six assists. ... Milwaukee has won its past three against the Raptors, including two straight in Toronto, its first road winning streak in the series since a five-game run from January 2011 to January 2013. ... G Eric Bledsoe celebrated his 29th birthday. He had nine points and five assists.\n\nRaptors: Toronto missed 10 consecutive field goal attempts in the first half, including eight straight to begin the second quarter. The Raptors responded by making five of their next 10. ... Ibaka had a career-high 11 3-point attempts and made a season-high four.\n\nUNDER 100\n\nToronto failed to score 100 or more for the second time this season. The Raptors won the other such game, beating Orlando 93-91 on Nov. 20 thanks to a last-second basket by Danny Green.\n\nUNDER 10\n\nLowry has failed to score at least 10 points in each of his past five-games.\n\nUP NEXT\n\nBucks: Host Cleveland on Monday night.\n\nRaptors: Visit Los Angeles Clippers on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994278.2166772
}