{
  "game_id": "401809818",
  "espn_id": "401809818",
  "date": "Nov 28, 2025",
  "matchup": "DEN vs SA",
  "headline": "Vassell scores 35 points as Spurs beat Nuggets 139-136 to reach NBA Cup quarterfinals",
  "body": "DENVER -- - Devin Vassell scored a season-high 35 points on the strength of 7-of-9 shooting from 3-point range and the San Antonio Spurs advanced to the NBA Cup quarterfinals with a 139-136 win over the Denver Nuggets on Friday night.\nJulian Champagnie added a season-best 25 points to help the Spurs roar back from an 18-point third-quarter deficit and hand the Nuggets, winners of six straight on the road, their third consecutive defeat at home.\nThe Spurs made 30 of 32 free throws and scored 30 points off 17 Nuggets turnovers.\nJamal Murray led Denver with 37 points, Cam Johnson added 28 and Nikola Jokic 21. Murray became the fifth player in franchise history to top 10,000 points for his career.\nJokic flashed another jaw-dropping, behind-the-back assist, this one to Spencer Jones for second-quarter basket as Denver built a 74-59 halftime lead.\nBoth teams were short-handed with Spurs star Victor Wembanyama (calf) and Stephon Castle (hip) out and the Nuggets missing starters Aaron Gordon (hamstring) and Christian Braun (ankle).\nWithout Wembanyama, the Spurs relied on their outside shooting and eight players hit at least one 3-pointer.\nThe Nuggets used a 23-6 blitz to end the first half with a 15-point lead, and a quick 3-pointer by Murray to open the third quarter boosted Denver's cushion to 18 points, but San Antonio owned the quarter and only trailed 104-103 heading into the fourth.\nMurray hit three quick buckets in the opening minutes to become the fifth player in franchise history to top 10,000 career points, joining Alex English, Jokic, Dan Issel and Carmelo Anthony.\nUp next Spurs: At Minnesota on Sunday night.\nNuggets: At Phoenix on Saturday night. Both teams are traveling for the second night of a back-to-back as the Suns lost at Oklahoma City on Friday night.\n------\nAP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042711.187704
}