{
  "game_id": "0022200531",
  "espn_id": "401468686",
  "date": "Dec 30, 2022",
  "matchup": "TOR vs. PHX",
  "headline": "Trent scores 35 points, Raptors beat short-handed Suns",
  "body": "TORONTO -- — Gary Trent Jr. matched his season high with 35 points, Pascal Siakam had 26 and the Toronto Raptors snapped a five-game home losing streak with a 113-104 victory over the short-handed and sloppy Phoenix Suns on Friday night.\n\n\r\n              Scottie Barnes hit a tiebreaking 3-pointer with 3:16 left in the fourth quarter and rookie center Christian Kololo followed with his first career 3 help the Raptors win for the third time in 11 games. O.G. Anunoby scored 16 points and Barnes finished with 11.\n\n\r\n              Siakam has scored at least 25 points in seven consecutive games. Vince Carter did it in a franchise-record eight straight in February and March of 2001.\n\n\r\n              Trent shot 11 for 22, making 4 of 11 from 3-point range.\n\n\r\n              “Gary just had it going,” Raptors coach Nick Nurse said.\n\n\r\n              Chris Paul had 20 points and 12 assists, but had six of the Suns’ season-worst 27 turnovers that led to 34 points for the Raptors.\n\n\r\n              “I don’t know how many games I’ve ever played in with 27 turnovers,” Paul said. “That’s a lot. It started with me.”\n\n\r\n              Barnes had missed three attempts from distance before snapping a 101-all tie with a stepback 3. Koloko’s corner shot was his first from long range in eight career attempts.\n\n\r\n              “It shouldn’t even come down to that,” Suns coach Monty Williams said. “If you take care of the ball, maybe you have a six- or seven-point lead.”\n\n\r\n              Mikal Bridges scored 21 points and Torrey Craig had 13 as Phoenix lost for the fifth time in its past six.\n\n\r\n              Deandre Ayton shot 2 for 10 and scored four points.\n\n\r\n              “He just didn’t finish around the basket, didn’t play with the requisite force that it takes to play against a team like that,” Williams said. “Even when he thought he was open, they had two or three guys behind him. It was an off-night for him, for sure. He’ll bounce back.”\n\n\r\n              Ayton agreed that Toronto’s defense had caused him problems.\n\n\r\n              “Whether it was a rebound, setting a screen, posting up, they were everywhere,” Ayton said.\n\n\r\n              The Suns played their third straight game without All-Star guard Devin Booker, who is expected to miss at least four weeks because of a strained left groin.\n\n\r\n              Booker had missed five of seven games because of hamstring and groin ailments before returning against Denver on Christmas Day. He lasted just four minutes before leaving. The Suns also are without Cam Johnson (right knee), Cameron Payne (right foot) and Landry Shamet (right Achilles).\n\n\r\n              Toronto guard Fred VanVleet missed his second straight game because of a sore lower back\n\n\r\n              The Raptors led 33-24 after one quarter and were up 53-51 at the half.\n\n\r\n              Trent dunked after stealing Craig’s errant pass with 9:32 left in the third quarter. That was the 19th turnover for Phoenix, matching its previous single-game worst this season.\n\n\r\n              Suns guard Josh Okogie turned the ball over again 23 seconds later, leading to a 3 for Siakam.\n\n\r\n              After scoring 10 points off 15 Phoenix turnovers in the first half, Toronto scored 15 points off seven Suns turnovers in the third quarter.\n\n\r\n              Trent scored 18 points in the third as the Raptors took an 86-79 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Suns: Had nine turnovers in the first quarter. … Jock Landale had 11 rebounds. … Duane Washington Jr. scored 11 points. … Outrebounded Toronto 42-31.\n\n\r\n              Raptors: Went 5-10 in December. … Trent shot 9 for 9 at the free throw line.\n\n\r\n              CRIME SPREE\n\n\r\n              Toronto recorded 15 steals, one shy of its season-high. Thad Young led the Raptors with four, while Barnes and Trent each had three.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At New York on Sunday.\n\n\r\n              Raptors: At Indiana on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994069.102256
}