{
  "game_id": "0022200957",
  "espn_id": "401469112",
  "date": "Mar 04, 2023",
  "matchup": "DET @ CLE",
  "headline": "Garland scores 21 points, Cavaliers rout Pistons 114-90",
  "body": "CLEVELAND -- — Darius Garland had 21 points and seven assists, Donovan Mitchell scored 20 points and the Cleveland Cavaliers led by 35 points in a 114-90 victory over the Detroit Pistons on Saturday night.\n\n\r\n              Evan Mobley had 16 points, 11 rebounds, six assists and four blocked shots, Jarrett Allen scored 15 points and Caris LeVert had 11. The Cavaliers are fourth in the Eastern Conference with 16 games left.\n\n\r\n              “This team is going to be in the money, in the playoffs,” Pistons coach Dwane Casey said. “They’ve got a superstar in Mitchell, and Garland is right behind him. I also love Mobley’s temperament. You can’t tell if they’re up 20 or down 20 by looking at him.”\n\n\r\n              All-Star starter Mitchell, who sprained a finger on his left hand in the third quarter, and Garland only played 24 minutes apiece as the Cavaliers swept the four-game season series with Detroit. The Pistons were held below 95 points in each.\n\n\r\n              “Our tenacity is always there and so is our energy on the defensive end,” Garland said. “We got stops, got out in transition and got some easy buckets, and it got us going. We came home and got a good solid win tonight.”\n\n\r\n              Marvin Bagley III had 20 points and 13 rebounds for Detroit. The Pistons have the second-worst record in the NBA at 15-49 and are 0-11 in the Central Division. They have lost seven straight overall and seven in a row on the road.\n\n\r\n              Detroit played without four starters in center Jalen Duran (bilateral ankle soreness), forwards Bojan Bogdanovic (bilateral Achilles soreness) and Isaiah Stewart (right hip soreness) and guard Cade Cunningham (left tibia stress fracture).\n\n\r\n              Cleveland is 40-26 and leads surging New York by 1 1/2 games for home-court advantage in the first round of the playoffs.\n\n\r\n              “We need to take care of business because we know what having home-court advantage means,” Cavaliers coach J.B. Bickerstaff said. “But we want to keep our guys’ focus on the day-to-day things, instead of being caught up in the big picture.”\n\n\r\n              Neither team led by double-digits until Mobley made a floater to open the third quarter, putting Cleveland up 56-45. Ricky Rubio’s 3-pointer early in the fourth gave the Cavaliers their largest spread at 102-67.\n\n\r\n              “We knew they had a couple guys out, so we wanted to take advantage,” LeVert said.\n\n\r\n              Pistons rookie Buddy Boeheim — the son of Syracuse coach Jim Boeheim — scored his first NBA points on a 3-pointer in the fourth quarter. He only played one minute without taking a shot in his lone previous game.\n\n\r\n              CHANGE OF SCENERY\n\n\r\n              Pistons center James Wiseman has seen his playing time double since being acquired in a Feb. 9 trade with Golden State. The second overall pick in the 2020 draft averaged 11.8 points, 8.2 rebounds and 24.7 minutes over his first five games with Detroit. “I love him, I think he’s a sponge,” Casey said. “He’s just raw and we have an opportunity to be patient with him, which Golden State didn’t.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Duren is averaging an NBA rookie-high 8.7 rebounds. The Memphis product has missed four straight games. … F Isaiah Livers (left ankle sprain) returned from a one-game absence. … F Eugene Omoruyi, who made two starts and played in 23 games with Oklahoma City this season, signed a 10-day contract.\n\n\r\n              Cavaliers: Mitchell and Allen both appeared in their 400th NBA games, while F Isaac Okoro played in his 200th. … Garland committed four fouls in the first half. … G Sam Merrill signed a 10-day contract to fill the roster spot that was held by F Kevin Love before his release. Merrill scored two points.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Portland on Monday night.\n\n\r\n              Cavaliers: Host Boston on Monday night. ------ More AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994364.7422101
}