{
  "game_id": "0021500377",
  "espn_id": "400828264",
  "date": "Dec 16, 2015",
  "matchup": "CHI vs. MEM",
  "headline": "Butler, Rose lead Bulls to 98-85 win over Grizzlies",
  "body": "CHICAGO --  Jimmy Butler finished with 24 points, Derrick Rose scored 19 and the Chicago Bulls beat the Memphis Grizzlies 98-85 on Wednesday night.\n\nButler and Rose shook off recent illnesses, and the Bulls used a big third quarter to tie a season high with their fourth straight win.\n\nDoug McDermott scored 17 -- one shy of his career high -- and hit four 3-pointers.  Pau Gasol added 10 points and 14 rebounds in his 22nd game against younger brother Marc.\n\nCourtney Lee tied a season high with 18 points for Memphis, but the Grizzlies lost for the third time in four games because they couldn't connect from long range or at the line.\n\nThey were 5 of 19 on 3-pointers, with Mike Conley (eight points) missing seven of eight. The Grizzlies weren't much better at the foul line, going 16 of 28 -- a stunning showing for a team that came in leading the league in free-throw accuracy.\n\nThe Bulls outscored Memphis 24-13 in the third quarter to turn a three-point halftime deficit into a 74-66 lead.\n\nButler and Rose each scored six in the quarter and chipped in during a 17-4 run that gave Chicago a 69-60 lead.\n\nRose banked in a jumper and hit back-to-back layups during that stretch. He also fed Pau Gasol for a three-point play.\n\nButler finished the run with a breakaway layup after he stole the ball from Marc Gasol with just over four minutes left in the period.\n\nLee got off to a blistering start, scoring 13 in the first quarter and 15 in the half, and the Grizzlies took a 53-50 lead to the locker room after Chicago cooled off in a big way.\n\nThe Bulls went from shooting 70 percent in the first quarter to 6 of 22 in the second.\n\nButler led Chicago with 14 points and hit the final two baskets -- a 3-pointer and a driving layup. The problem was they were about five minutes apart. The Grizzlies went on a 12-0 run in between to go up 49-46.\n\nThat helped quiet a crowd that was showing some spark early in the game, particularly with Rose attacking in a way he rarely has this season.\n\nHe had 10 points in the first quarter after attempting just three shots while fighting an illness two nights earlier against Philadelphia.\n\nTIP-INS\n\nGrizzlies: F Brandon Wright is scheduled for surgery on his right knee on Thursday. A timetable for his return has not been set. Wright has not played since Nov. 7.\n\nBulls: Coach Fred Hoiberg said Rose and Butler were still ill but feeling \"a lot better\" than they did against Philadelphia on Monday. Hoiberg also said Rose's vision is improving, although he still has trouble when he looks down. Rose is recovering from surgery to repair a fractured left orbital.\n\nUP NEXT\n\nGrizzlies: Visit Dallas on Saturday.\n\nBulls: Host Detroit on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764993955.039634
}