{
  "game_id": "0021900713",
  "espn_id": "401161355",
  "date": "Jan 29, 2020",
  "matchup": "OKC @ SAC",
  "headline": "Dort scores 23 points, sparks Thunder past Kings 120-100",
  "body": "SACRAMENTO, Calif. --  Still reeling from the loss of good friend and former NBA star Kobe Bryant, Oklahoma City’s Chris Paul returned to the basketball court for the first time since the tragedy because, he said, it was the right thing to do.\n\nThe Thunder didn’t need him much on a night in which they led from start to finish. But it was a therapeutic return for Paul.\n\n“Probably the best thing (I) could have done is to get out there and play,” Paul said following Oklahoma City’’s 120-100 win over the Sacramento Kings on Wednesday night. “Kobe wouldn’t have it any other way.”\n\nLuguentz Dort set season-highs with 23 points and five 3-pointers, Dennis Schroder delivered another big game off the bench with 24 points and nine assists as the Thunder won for the sixth time in seven games. Danilo Gallinario had 19 points and Shai Gilgeous-Alexander scored 17.\n\nA moment of silence was held before for the game for the victims of Sunday’s helicopter crash that killed Bryant and his daughter Gianna and seven others. A framed Bryant 24 jersey was placed at center court as a spotlight shined down. Some fans broke into chants of “Kobe! Kobe! Kobe!” after the buzzer sounded. Tributes to Bryant played on the video scoreboard throughout the game.\n\nPaul, who had nine points, 10 assists and seven rebounds, was back on the court after not playing in the Thunder’s loss to Dallas on Monday for personal reasons. He played only 26 minutes against the Kings, his fewest since Nov. 27.\n\nAlthough Paul penned an emotional tribute to Bryant on social media later on Monday, the nine-time All-Star had not spoken publicly about the tragedy until Wednesday.\n\n“You just feel for the families,” Paul said. “It’s a big loss for everybody.”\n\nDort had 12 points in the third quarter -- more than he has had in any game this season -- and helped the Thunder open a 20-point lead. Dort made a pair of 3-pointers, had a pair of layups and made two free throws after the Kings’ Nemanja Bjelica was called for a flagrant 1 foul.\n\n“I actually told Dort toward the end of the game, Kobe probably would have been proud of him because he had 23 points and no assists,” Paul said. “Kobe was all about being aggressive and staying aggressive.”\n\nThunder coach Bill Donovan praised Paul for his management of the game.\n\n“Obviously it was an emotional game for him,” Donovan said. “He never really got into a flow from the standpoint of his own personal offense, but he really managed to manipulate that game in the third quarter. He was finding guys, he was making the right decisions. He got guys open shots.”\n\nBogdan Bogdanovic scored 23 points and De’Aaron Fox had 19 for Sacramento.\n\n“I felt we got pushed around tonight,” Kings coach Luke Walton said. “They were more physical than us, they hit us, they outrebounded us. They got the shots that they wanted and that can’t be acceptable.”\n\nThe Thunder held the Kings to 16 points in the first quarter and led 59-43 late in the second following Schroder’s 3-pointer.\n\nGilgeous-Alexander scored eight straight points to open the fourth quarter and Oklahoma City stretched its lead to 109-82.\n\nTIP-INS\n\nThunder: Donovan’s team has won six straight on the road and is 13-3 away from home since the start of December. … This was the seventh time that Oklahoma City has made 15 or more 3-pointers this season. … Gallinari missed his first five shots and was 0 for 4 on 3s before connecting on back-to-back attempts in the second quarter.\n\nKings: Sacramento missed eight of its nine 3-point shots in the first quarter. … Marvin Bagley III sat out a fourth straight game with left foot soreness. Bagley missed eight games from late December to early January because of the same issue. ... Richaun Holmes (right shoulder soreness) has missed 10 consecutive games.\n\nUP NEXT\n\nThunder: Face the Suns in Phoenix on Friday. The Thunder have won seven straight against the Suns, including three straight on the road.\n\nKings: Play the Clippers in Los Angeles on Thursday. Sacramento has lost 10 straight in the series over the past three years.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996214.1927118
}