{
  "game_id": "0022300795",
  "espn_id": "401585423",
  "date": "Feb 22, 2024",
  "matchup": "TOR vs. BKN",
  "headline": "Barnes scores 18, Raptors beat the Nets and spoil debut of Brooklyn interim coach Kevin Ollie",
  "body": "TORONTO -- — Scottie Barnes had 18 points and 12 rebounds, Gary Trent Jr. scored 25 points and the Toronto Raptors beat Brooklyn 121-93 on Thursday night, spoiling the debut of interim Nets coach Kevin Ollie.\n\n\r\n              Immanuel Quickley scored 24 points and RJ Barrett added 12 points and matched a season high with seven assists as the Raptors snapped a three-game home losing streak and recorded their first win in 12 games against Atlantic Division opponents this season.\n\n\r\n              Toronto’s biggest lead was 34 points. The Raptors outscored Brooklyn 46-10 on fast-break points, a season best in that category.\n\n\r\n              “They beat us in probably every area,” Ollie said. “Giving up 46 fast-break points and not being able to stop them and limit them in half-court situations was a killer for us.”\n\n\r\n              Mikal Bridges led Brooklyn with 21 points. Cam Thomas scored 19 points for the Nets, who failed to extend a five-game winning streak against Toronto. Brooklyn has lost three straight and six of seven.\n\n\r\n              Ollie replaced Jacque Vaughn on Tuesday, a day after Vaughn was fired following a 21-33 start.\n\n\r\n              With all the upheaval that followed this week’s coaching change, Thomas said the Nets struggled with their offensive flow in Ollie’s first game in charge.\n\n\r\n              “It’s tough,” Thomas said. “We’ve got a little bit of different terminology on offense. With some of that, until we actually process what was said and what to run, we’re already eight or nine seconds into the shot clock. Even I was confused on offense on some of the plays.”\n\n\r\n              Vaughn’s final game, also Brooklyn’s last before the All-Star break, was a 136-86 loss to the Boston Celtics on Feb. 14. It was the Nets’ worst defeat since leaving New Jersey in 2012.\n\n\r\n              The Nets made a season-high 20 turnovers Thursday, leading to 32 points for the Raptors. Brooklyn’s previous high for turnovers was 19, done twice.\n\n\r\n              “They were just getting layups,” Ollie said. “We can’t have that happen.”\n\n\r\n              Bridges and Thomas were the only Nets starters to score in double figures. Ben Simmons had two points in 21 minutes, making one of two shots. Former Raptors guard Dennis Schroder shot 1 for 7 and scored four points off the bench.\n\n\r\n              Brooklyn’s 93 points were the fewest by a Toronto opponent this season. The Raptors beat Minnesota 97-94 on Oct. 25, the first game of the regular season. \n\n\r\n              Toronto hadn’t held an opponent below 100 points since a 121-97 win over Miami on Jan. 17.\n\n\r\n              “I still think there is a lot for us to improve and get better but it was definitely a step into the right direction tonight,” said Raptors head coach Darko Rajakovic, who earned a win on his 45th birthday.\n\n\r\n              Quickley shot 5 for 8 from 3-point range and has made at least one shot from distance in 27 consecutive games, matching a career-best streak. He also did it last season.\n\n\r\n              Toronto was up 30-21 after one quarter and led 59-48 at the half. Quickley scored 11 points in the third as the Raptors extended their advantage to 82-71 heading to the fourth.\n\n\r\n              Guard D.J. Carton made his Toronto debut after signing a 10-day contract on Wednesday and scored his first NBA basket. Carton had three points in four minutes.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Visit Minnesota on Saturday night.\n\n\r\n              Raptors: Visit Atlanta on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995407.3397472
}