{
  "game_id": "0022000353",
  "espn_id": "401267513",
  "date": "Feb 06, 2021",
  "matchup": "ORL vs. CHI",
  "headline": "LaVine scores 39 points to lift Bulls past Magic, 118-92",
  "body": "ORLANDO, Fla. -- — Billy Donovan challenged his squad to play with the focus, aggression and consistency missing a night earlier in a loss to the Orlando Magic.\n\n\r\n                    Zach LaVine delivered. \n\n\r\n                    LaVine bounced back from an uneven performance and scored 39 points on Saturday as the Chicago Bulls routed the injury-plagued Magic, 118-92.\n\n\r\n                    “He wanted us to go out there and try to blow these guys out. Message received,” LaVine said of Donovan’s morning challenge. “I think the way that we played definitely represented what he wanted us to do.”\n\n\r\n                    LaVine scored just two points in the first three quarters of Friday’s loss, but on Saturday had 22 points in the first half. LaVine made 16 of 25 shots and the Bulls outscored Orlando by 26 points in his 39 minutes on the floor.\n\n\r\n                    “He didn’t play that (on Friday) and that was part of the challenge,” Donovan said. “He didn’t attack the basket last night. He was coming off pick-and-rolls and taking one dribble and getting off it. Tonight, he played totally downhill and he was downhill at the basket.”\n\n\r\n                    Orlando’s Nikola Vucevic, who scored a career-best 43 points in Friday’s win, had 17 points and eight rebounds. He didn’t play in the fourth quarter because of the lopsided score. \n\n\r\n                    Chicago broke open a one-point game with a 25-8 burst over the final nine minutes of the first half to build a 61-43 edge at intermission. From there, the Bulls pushed their lead to as much as 33 by making eight of their first 11 shots of the second half.\n\n\r\n                    Denzel Valentine, who started in place of the injured Lauri Markkanen, scored 20 points and hit four 3-pointers. Rookie Patrick Williams chipped in 16 points and 10 rebounds, while Coby White added 13 points.\n\n\r\n                    “(Donovan) just said if we want to be quote-unquote a playoff team and take our team to the next level — which we have to ability to do — then we needed to come out and show it,” Valentine said. “Nobody is going to just give it to us because we’ve had the same team. He just challenged us to play like we should every single night.” \n\n\r\n                    Evan Fournier was scratched just minutes prior to tipoff because of back spasms, meaning Orlando was without four would-be starters because of a myriad of injuries. Aaron Gordon, Markelle Fultz and Jonathan Isaac were already out and the Magic had little working offensively on Saturday. They shot 38.9% from the floor and made only 6 of 27 3-point shots. \n\n\r\n                    “Intent, purpose of play and not being willing to pass the ball to the guy next to you,” Magic coach Steve Clifford said. “It was just bad offense that hurt our defense.”\n\n\r\n                    LAURI LOST\n\n\r\n                    Already without key contributors Otto Porter and Wendell Carter Jr. because of injuries, the Bulls were without Markkanen because of a right shoulder sprain. Markkanen suffered the injury early in the third quarter Friday when he was fouled by Orlando forward Gary Clark and there was little improvement in his condition on Saturday, Donovan said.\n\n\r\n                    “He’s sore and we’re probably not going to know any more until he gets imaging when we get back,” Donovan said. “Then, we’ll have more information, but there’s no question he’s dealing with pain.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Chicago had a 28-10 edge on points in the paint in the first half. The Bulls finished with 50 paint points. … Donovan said he continues to be impressed with the maturity and talent of Williams, who scored a career-best 20 points on Friday. “At 19 years old, he continues to grow and he played downhill, he was physical on drives and he got to the backboard and rebounded,” Donovan said. “Scoring, for a young player, will come and go, but the way he tried to play the game is what we need out of him.”\n\n\r\n                    Magic: Fournier missed nine games with back spasms between Jan. 2-18. … Vucevic was flattered that Shaquille O’Neal congratulated him on joining the Hall of Fame center and Dwight Howard as the only Magic players to compile at least 43 points and 19 rebounds in a game.\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Open a three-game homestand on Monday against Washington. \n\n\r\n                    Magic: Start a four-game road trip at Portland on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764997797.958334
}