{
  "game_id": "0022201050",
  "espn_id": "401469205",
  "date": "Mar 17, 2023",
  "matchup": "CHI vs. MIN",
  "headline": "DeRozan scores 49 as Bulls beat Timberwolves in double OT",
  "body": "CHICAGO -- — DeMar DeRozan scored a season-high 49 points, Zach LaVine finished with 39 and the Chicago Bulls beat the Minnesota Timberwolves 139-131 in double overtime on Friday night.\n\n\r\n              DeRozan and LaVine joined Michael Jordan and Scottie Pippen as the only Bulls duo with 39 points or more in the same game, according to the Elias Sports Bureau. The two Hall of Famers did it against the Indiana Pacers on Feb. 18, 1996, with Jordan going for 44 and Pippen finishing with 40.\n\n\r\n              “When we've got it rolling like that, it makes everything so much easier not even just to score, just to get everybody else involved,” said DeRozan, who had some trouble seeing after getting hit in the eye.\n\n\r\n              Nikola Vucevic added 21 points and 11 rebounds.\n\n\r\n              Minnesota All-Star Anthony Edwards left with a sprained right ankle in the first quarter, and the Timberwolves lost for the fourth time in five games.\n\n\r\n              Mike Conley led Minnesota with 28 points, nailing a career-high 8 of 12 3-pointers. Rudy Gobert finished with 21 points and 19 rebounds before fouling out in the first OT, and Jaden McDaniels scored 25 points.\n\n\r\n              The Bulls led 130-125 in the second OT before Conley hit a 3-pointer. Minnesota’s Naz Reid had a layup rim out, and DeRozan made a turnaround jumper to bump Chicago’s lead to 132-28 with 1:27 remaining.\n\n\r\n              Nickeil Alexander-Walker made the second free throw after an airball to pull the Timberwolves within three, but Vucevic brought the Bulls bench to its feet with a thunderous one-handed dunk for a three-point play with just over a minute left.\n\n\r\n              Reid drove for a layup to make it a four-point game. But DeRozan made four free throws in the final 36 seconds to help Chicago come away with a wild win.\n\n\r\n              EDWARDS INJURED\n\n\r\n              Edwards was hurt late in the first quarter when he landed awkwardly after jumping while throwing a pass. He stayed down clutching his ankle before being helped to the back, and coach Chris Finch wasn't sure how long he'll be out, though Edwards wasn't ruling out playing at Toronto on Saturday.\n\n\r\n              “I’m gonna see how it feels tomorrow,” he said. \"Hopefully I can play.” \n\n\r\n              Losing Edwards, who came into the game averaging 25 points and made his first All-Star team this year, would be a big blow for the Timberwolves, particularly with Karl-Anthony Towns appears poised to return from a calf injury that has sidelined him for most of the season. The Timberwolves are trying to avoid the play-in and build some momentum with the regular season winding down. \n\n\r\n              “You want to be getting guys healthy and playing at your best, guys in a great rhythm,\" Conley said. \"Obviously being without KAT and then losing Ant, two of our best players, at such an important time of the season is very tough. This team's got to be resilient. This is gonna be a great time for us to grow up together and figure it out.”\n\n\r\n              FIRST OT\n\n\r\n              Conley nailed a 3 to give Minnesota a 121-118 lead in the first overtime. DeRozan tied on a three-point play with just over a minute left, with Gobert fouling out in the process.\n\n\r\n              McDaniels then scored to put Minnesota back on top. LaVine drove for a tying layup with 11 seconds remaining after the Timberwolves’ Taurean Prince threw the ball away, and McDaniels missed a pull-up 3 for Minnesota.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Finch said there are “a lot of dynamics” to Towns' impending return that the Timberwolves “haven't really dug into” because there are still some unknowns, such as whether he will be on a minutes restriction. Towns hasn't played since he strained his right calf against Nov. 28 in a game at Washington. The team announced Wednesday the three-time All-Star is expected to return “in the coming weeks.” “The good thing about KAT is he's pretty much wired to make the right play, whether it's passing or shooting,\" Finch said. \n\n\r\n              Bulls: Coach Billy Donovan wasn’t sure when or even if Lonzo Ball will play again for Chicago, with the point guard set to have yet another surgery on his troublesome left knee. Donovan said Ball will likely undergo a cartilage transplant early next week, though he wasn’t sure which day, and is in for “a long rehab.” The surgery will be the third on the knee in 14 months for Ball, who was ruled out for the season in February.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Visit Toronto on Saturday.\n\n\r\n              Bulls: Host Miami on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994468.814425
}