{
  "game_id": "0021900043",
  "espn_id": "401160685",
  "date": "Oct 28, 2019",
  "matchup": "ATL vs. PHI",
  "headline": "Embiid scores 36 as 76ers top Hawks 105-103 to stay unbeaten",
  "body": "ATLANTA --  Joel Embiid missed the previous game with an ankle injury, and the Philadelphia 76ers weren't sure he'd be able to play Monday night until he tested it during warmups.\n\nHe didn't seem to be in any pain.\n\nEmbiid scored 36 points, including the winning free throws with 5.3 seconds left, and the 76ers won their third straight to begin the season with a 105-103 victory over the Atlanta Hawks.\n\nIn a matchup between the last two unbeaten teams in the Eastern Conference, Philadelphia made things tough for Trae Young and dominated down the stretch to deny the young Hawks their first 3-0 start in three seasons.\n\nEmbiid made 12 of 19 shots from the field -- including a couple of 3-pointers -- and knocked down all 10 of his free throws. He also had 13 rebounds, five assists and three steals.\n\n\"He was our crown jewel in a blatant way,\" Philadelphia coach Brett Brown said. \"We needed him, particularly offensively.\"\n\nThe Hawks tied the game at 103 with 7.4 seconds left when John Collins tipped in a missed free throw by Young to complete a de facto three-point play after the Atlanta guard made his first attempt from the line. The 76ers had fouled Young before he could attempt a tying 3, but the Hawks wound up getting the points they needed when Al Horford failed to block out Collins, who flexed both arms on his way back down the court.\n\nAfter a timeout, Horford made up for his mistake by lobbing a pass to Embiid breaking loose in the lane. Collins fouled the 76ers big man to deny the basket, but Embiid calmly drained both free throws.\n\nThe Hawks had one final chance, getting the ball to 42-year-old Vince Carter sprinting along the sideline. He threw up a wild 3 that never really had a chance, bouncing over the backboard as the horn sounded.\n\nTobias Harris had eight of his 13 points in the final quarter as the 76ers outscored the Hawks 15-5 over the final five minutes. Josh Richardson chipped in with 14 points, and Ben Simmons also had 14.\n\n\"We have a lot of weapons,\" Embiid insisted.\n\nYoung, the first Eastern Conference player of the week this season, had 25 points on 7-of-20 shooting. Collins added 16 points and De'Andre Hunter 14, including a 3 from the corner that gave the Hawks a 98-90 lead. Philadelphia dominated the rest of the way.\n\nYoung averaged 38.5 points in Atlanta's first two games. He was held to six over the final two quarters by the 76ers.\n\n\"They were denying me the ball,\" he said. \"They got it out of my hands the whole game.\"\n\nThe 76ers made sure Young didn't get a chance on that final play.\n\n\"I had two defenders on me,\" he said. \"I couldn't get open.\"\n\nINJURY REPORT\n\nPhiladelphia's Shake Milton exited in the third quarter with a hyperextended left knee. He was injured on a drive to the basket when he stepped on an Atlanta player's foot and twisted his knee.\n\nBefore that, Milton gave the 76ers a boost off the bench by scoring nine points.\n\nTIP-INS\n\n76ers: Former Hawk Mike Scott was ejected in the second quarter for a flagrant foul on Atlanta's Damian Jones. Scott gave Jones a chest bump as the Hawks center was driving to the basket, sending him flying out of bounds. While the play didn't look especially egregious, officials upheld the call after checking the replay. Scott shook hands with Jones before leaving the court, stopping on his way to the locker room to give his wrist bands to young fans hanging over the railing. ... Philadelphia trailed by 13 midway through the opening quarter and didn't grab its first lead until late in the first half. The 76ers never led by more than four. \"We were soft in that first quarter,\" Embiid said. \"We just had to turn it on a little bit.\"\n\nHawks: No. 10 overall draft pick Cam Reddish hasn't made much of an impact in his first three NBA games. He has a total of 11 points. ... Carter played only 10 minutes but was on the court for key minutes down the stretch. ... Rookie C Bruno Fernando had the first double-figure scoring game of his career with 11 points. ... Collins fouled out on the play that led to Embiid's winning free throws.\n\nUP NEXT\n\n76ers: Return home to face Minnesota on Wednesday before heading out on a West Coast road trip.\n\nHawks: Head straight to Miami for the first of a home-and-home with the Heat on Tuesday. The division rivals meet again Thursday in Atlanta.\n\n---\n\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 His work can be found at https://apnews.com\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996693.760428
}