{
  "game_id": "0022000445",
  "espn_id": "401267605",
  "date": "Feb 18, 2021",
  "matchup": "TOR @ MIL",
  "headline": "Powell leads Raptors to 110-96 win over skidding Bucks",
  "body": "MILWAUKEE -- — Norman Powell's efficiency ensured the Toronto Raptors would extend the Milwaukee Bucks' longest skid in four years.\n\n\r\n                    Powell matched a season high with 29 points, Pascal Siakam had 27 and the Raptors beat Milwaukee 110-96 on Thursday night to hand the Bucks their fifth consecutive loss.\n\n\r\n                    “I thought we did a great job as a team of moving the ball and playing hard on defense to open up our transition so we could get easy looks,” Powell said.\n\n\r\n                    Powell shot 9 of 12 overall, 4 of 7 from 3-point range and 7 of 8 from the free-throw line. He had 15 points in the first quarter alone and made a pair of 3-pointers to start a 21-4 run that put the Raptors ahead for good.\n\n\r\n                    “He was aggressive and decisive tonight,” Raptors coach Nick Nurse said.\n\n\r\n                    The Bucks last dropped five straight games from Jan. 25 to Feb. 3 in 2017. Milwaukee’s entire slide has come without guard Jrue Holiday, who has missed six consecutive games due to health and safety protocols.\n\n\r\n                    “When things go bad, that’s where you get better... that’s where you improve,” said Milwaukee’s Giannis Antetokounmpo, who had 23 points, 12 rebounds and eight assists before fouling out. “You can turn the other way and just go home and quit, or you’ve just got to keep fighting. We might lose 10 in a row. I don’t know. I don’t know what the future holds. But I know that we’ve got to have good thoughts, and behind our actions, we’ve got to have effort.”\n\n\r\n                    Toronto wasn't at full strength for this one either and still defeated the Bucks for the second time in three nights.\n\n\r\n                    \r\n                      The Raptors beat the Bucks 124-113 on Tuesday despite losing Kyle Lowry to a sore left ankle early in the third quarter. Lowry didn’t play at all Thursday, though the Raptors said it was due to a sprained left thumb rather than his sore ankle.\n\n\r\n                    Fred VanVleet scored 17 points for the Raptors. Milwaukee's Donte DiVincenzo had 14 points, Khris Middleton 13, Brook Lopez 12 and Bryn Forbes 11.\n\n\r\n                    After trailing by as many as 23, the Bucks got the margin down to 10 on a number of occasions but couldn't get any closer.\n\n\r\n                    “The competitiveness, the spirit was actually better,” Bucks coach Mike Budenholzer said. “I think guys were covering for each other. Guys were scrambling. I know it’s (about) results. People are going to look and see another loss, but the togetherness, the competitiveness, the spirit was better tonight. We’ve got to build on that.”\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Toronto won convincingly despite collecting just two offensive rebounds. ... Bembry made his first start of the season and had five points and four assists in 38 minutes. Aron Baynes, who had started the first 24 games in which he’d played this season, came off the bench for a second straight time. \n\n\r\n                    Bucks: Before the game, Antetokounmpo was named an All-Star Game starter for the fifth consecutive season. ... The Bucks scored just 15 points in the second quarter, their lowest point total in any quarter all season. ... Bobby Portis' only points of the night came on a basket in the game's final second. Portis had scored at least 15 points in each of his last three games. \n\n\r\n                    CROWD GETTING (SLIGHTLY) BIGGER\n\n\r\n                    The Bucks played in front of 500 spectators — invited guests and family members of players — as they gradually work their way up to playing in front of 10% capacity at Fiserv Forum. The Bucks will welcome the general public to a home game for the first time Sunday when they allow about 1,800 spectators for a game with Sacramento.\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: At Minnesota on Friday. This will be the Raptors’ third straight road contest, and ninth in their last 10 games.\n\n\r\n                    Bucks: Host the Oklahoma City Thunder on Friday in their third of eight straight home games. The Bucks lost 114-109 at Oklahoma City on Sunday.\n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996864.557523
}