{
  "game_id": "0021900949",
  "espn_id": "401161591",
  "date": "Mar 08, 2020",
  "matchup": "OKC @ BOS",
  "headline": "Schroder's late layup lifts Thunder over Celtics 105-104",
  "body": "BOSTON --  Until Sunday, the Oklahoma City Thunder hadn't had to worry about figuring out how to play without leading scorer Shai Gilgeous-Alexander.\n\nIt turns out they do just fine.\n\nDennis Schroder stripped the ball from Kemba Walker and scored on a layup with 8.5 seconds to help the Thunder rally to beat the Boston Celtics 105-104.\n\nWith Gilgeous-Alexander sitting for the first time this season with a hip bruise that he suffered in their win at New York on Friday, Chris Paul had 28 points and seven assists to help OKC overcome an 18-point first-half deficit. Schroder added 27 points and six assists as OKC won its third straight.\n\n\"I said it in the locker room after the game. I said, `Headline's: SGA out, Thunder roll.' You know that I mean?\" Paul said. \"Sounds good to me. Yeah.\"\n\nBoston had a chance to win the game, but Jayson Tatum was short on a fadeaway. Walker rebounded, but was unable to get off a shot as time expired. The Celtics have lost four straight at home for the first time since 2015.\n\nGordon Hayward led the Celtics with 24 points. Tatum had 19 points and Marcus Smart added 19 points and 10 rebounds.\n\n\"That's how the NBA works,\" Hayward said. \"You go through these runs and stretches where you're feeling really good about yourself and then it's like the world's coming to an end, too. ... This is low for us. We've got to try to build ourselves up, pry ourselves back out of it.\"\n\nBoston took a 100-99 lead with less than four minutes to play when Smart found Tatum with a no-look, behind-the-back pass for a layup.\n\nPaul was fouled by Smart a few trips later and hit a pair of free throws to put OKC back in front.\n\nSmart lost the ball on a drive to the basket on Boston's next trip and Paul extended the Thunder's lead to 103-100.\n\nDaniel Theis got a dunk out of a Boston's timeout. Smart then kept alive a loose ball on the Thunder's next possession to help start Celtics' fast break. It ended up in the hands of Tatum for a layup to put Boston up 104-103.\n\nOklahoma City has been one of the hottest teams in the NBA since Christmas, playing themselves into the middle of a crowded fight for playoff seeding in the Western Conference.\n\nBoston entered the day looking to get back on track after a rash of injuries.\n\nHayward returned for the Celtics after a two-game absence because of a right knee bruise. But Jaylen Brown missed his third straight game with a right hamstring strain.\n\n\"Most of our good teams go through stretches like this and usually two or three a year,\" Celtics coach Brad Stevens said. \"This is our second one. Hopefully we can nip that in the bud and not have a third one.\"\n\nOKC handled Gilgeous-Alexander's absence well early, leading by as many as eight.\n\nThe Celtics built a 63-45 lead late in the second quarter, but got sloppy over the final 1:08 of the half as OKC closed with a 7-0 run to stay within striking distance. It ignited a 43-23 run by the Thunder.\n\n\"This team is special, you know? We just never, never give up,\" Schroder said. \"I think everybody's playing together. When we're playing together, we're playing on a high level.\"\n\nTIP-INS\n\nThunder: Bench outscored the Celtics 41-17.\n\nCeltics: Tatum was whistled for a technical by referee Eric Lewis with 7:07 left after he slammed the ball to the ground in response to being called for an offensive foul. ... Robert Williams briefly went to the locker room early in the fourth quarter after landing awkwardly while battling for a rebound. ... Outscored the Thunder 37-23 in the second quarter, going 6 of 11 from the 3-point line.\n\nLOAD MANAGEMENT\n\nThunder coach Billy Donovan said he is mindful of managing the usage of Gilgeous-Alexander, who ranks 11th in the NBA in minutes per game (35.1). He played in all 82 games as a rookie last season.\n\n\"There's been some games where I think I probably could've done a better job with him. I think here of late his minutes have been somewhat reasonable,\" Donovan said. \"We've had some games against some tough opponents where his minutes have gotten up around 38, 39, which in my opinion is too much for him. ... So I'm definitely mindful of where he's at.\"\n\nUP NEXT\n\nThunder: Host Utah on Wednesday.\n\nCeltics: At Indiana on Tuesday, beginning a stretch of seven of nine on the road.\n\n---\n\nFollow Kyle Hightower on Twitter at https://twitter.com/khightower\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996195.0758379
}