{
  "game_id": "0022300118",
  "espn_id": "401584746",
  "date": "Nov 01, 2023",
  "matchup": "IND @ BOS",
  "headline": "Tatum has 30 points and 12 rebounds, sits out the 4th as the Celtics rout the Pacers 155-104",
  "body": "BOSTON -- — The last time the Boston Celtics scored 155 points in a regular-season game, there was only one championship banner hanging in the rafters of the old Boston Garden. Red Auerbach was still the coach. The Lakers were still in Minneapolis.\n\n\r\n              On Wednesday night, Jayson Tatum helped them do it again. \n\n\r\n              “I think it’s more about not being bored,” said guard Jrue Holiday, one of eight Celtics to score in double figures in a 155-104 victory over the Indiana Pacers. “It's not getting complacent and locking into every game, and each opponent.” \n\n\r\n              The 155 points was the most for the much-decorated franchise since the 1958-59 team that featured Bob Cousy and young stars Bill Russell and Tommy Heinsohn beat Minneapolis 173-139. Tatum had 30 points and 12 rebounds before sitting out the fourth quarter, and the Celtics used a blistering start to pull away from the Pacers and remain unbeaten.\n\n\r\n              “We’ve got so many weapons,” guard Derrick White said. “You’ve got so much talent around you, it makes the game easy.”\n\n\r\n              One game after blowing out the Wizards in Washington, the Celtics returned home and beat the Pacers even worse. White (18 points), Jaylen Brown (16), Holiday (15) and Kristaps Porzingis (13) helped Boston open a 10-point lead in the first three minutes, making it 20 in the second quarter, 30 in the third and as high as 53 points in the fourth.\n\n\r\n              Sam Hauser scored 17 points and Payton Pritchard had 15 for the Boston bench, which outscored Indiana 46-33 in the fourth quarter to complete the rout. \n\n\r\n              “We’ve got everything, right? We’re in the paint. There’s a mid-range, and you have the 3. I feel like that threat makes us even harder to guard,” Holiday said. “I feel like we have a lot of bases covered.” \n\n\r\n              T.J. McConnell scored 18 points for the Pacers, who were missing point guard Tyrese Halliburton after he turned his ankle when he stepped on Jalen Smith’s foot in Monday in a loss to Chicago. Smith (knee) also sat out Wednesday.\n\n\r\n              Tatum had four points and three rebounds in a 14-0 run in the opening minutes that turned a two-point deficit into an 18-6 lead. White hit a pair of 3-pointers at the end of the first, when Boston scored 18 of the last 25 points of the quarter to open a 44-27 lead.\n\n\r\n              Indiana never got closer than 14 points after that, spending the last 21 minutes trailing by 30 or more and falling behind by 50 with 4 1/2 minutes left in the game.\n\n\r\n              Game notes The Celtics shot 76% (16 of 21) from the floor in the first quarter. They made eight 3-pointers. … The Celtics had 75 points at halftime for the second straight game. According to the team, that’s a first for back-to-back games since at least the 1950-51 season. ... Indiana was 5 for 37 from 3-point range and outrebounded 58-31.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Cleveland on Friday night in the NBA’s in-season tournament.\n\n\r\n              Celtics: At Brooklyn on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996216.7689211
}