{
  "game_id": "0021901283",
  "espn_id": "401224758",
  "date": "Aug 08, 2020",
  "matchup": "PHX @ MIA",
  "headline": "Booker's 35 points lead surprising Suns past Heat 119-112",
  "body": "LAKE BUENA VISTA, Fla. --  Devin Booker scored 35 points and Jevon Carter added a season-high 20 points as the Phoenix Suns remained undefeated in the NBA restart, beating the Miami Heat 119-112 on Saturday night.\n\nCarter made six of eight 3-pointers as the Suns improved to 5-0 in the restart.\n\n\"I think this bubble opportunity was big for us and we're taking advantage of it,\" Booker said.\n\nMiami is currently the No. 4 team in the Eastern Conference playoff standings. Duncan Robinson and Tyler Herro each had 25 points to lead the Heat.\n\nThe Suns continued to thrive as the only undefeated team and biggest surprise in the Disney bubble.\n\nPhoenix began the restart schedule with the second-worst record of the 22 teams in the field and the worst mark in the Western Conference.\n\n\"I just think we had a group who wanted to come here and prove they were worthy of being here,\" Suns coach Monty Williams said. \"They heard a lot of stuff that was being said.\"\n\nThe Suns have played like serious playoff contenders. Led by Booker, Phoenix had wins over Washington, Dallas, the Los Angeles Clippers and Indiana before beating Miami. The Suns entered Saturday's schedule only 2 1/2 games behind eighth-place Memphis.\n\nHeat coach Erik Spoelstra said his team must be better at winning battles for the ball.\n\n\"Those second-chance opportunities during those swing moments during the course of the game really kept us at bay and kept them in control when they needed to do it,\" Spoelstra said.\n\nMiami had an opportunity late in the game.\n\nThree free throws by Robinson cut the Suns' lead to 115-112 before Miami's Bam Adebayo was called for goaltending on a shot by Booker. The review with 11.2 seconds remaining confirmed the call and extended the lead to five points.\n\nLed by its backcourt scoring from Herro and Robinson, Miami quickly led by double figures at 19-8. The Heat couldn't pull away and the teams were tied at 60-all at halftime. The Suns led 88-86 entering the final period.\n\nTIP-INS\n\nSuns: Rookie F Cameron Johnson made two 3-pointers in the first half, becoming the fastest player to reach 100 career 3s in team history. ... Ricky Rubio had seven points, 10 rebounds and eight assists. Deandre Ayton had 18 points and 12 rebounds.\n\nHeat: Goran Dragic (sprained left ankle) missed his second straight game. Jimmy Butler (sore right ankle) missed his third straight game. Kendrick Nunn and KZ Okpala were held out for personal reasons.\n\nTURN UP THE HEAT\n\nMiami is facing pressure to protect its No. 4 spot in the East. It is only one game ahead of Philadelphia and Indiana, now tied for fifth. Two of Miami's three remaining games before the playoffs are against Indiana.\n\n\"We also want to continue to get healthy and the No. 1 priority will be getting ready for the playoffs and getting our game right,\" Spoelstra said.\n\nRUNNING THE SHOW\n\nHerro is being given more responsibility as the point guard and said he \"felt comfortable\" in the role.\n\n\"I've been working really hard with the ball in my hands,\" Herro said, adding Spoelstra \"has really been helping me a lot. My teammates are starting to trust me more. I'm still young and I'm learning a lot.\"\n\nUP NEXT\n\nSuns: Play the Thunder on Monday.\n\nHeat: Play the Pacers on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996537.692893
}