{
  "game_id": "0022400629",
  "espn_id": "401705195",
  "date": "Jan 23, 2025",
  "matchup": "LAL vs. BOS",
  "headline": "Anthony Davis, Austin Reaves propel Lakers to 117-96 victory over Celtics",
  "body": "LOS ANGELES -- — Anthony Davis scored 24 points, Austin Reaves added 23 and the Los Angeles Lakers cruised to a 117-96 victory over the Boston Celtics on Thursday night.\n\n\r\n              LeBron James had 20 points and 14 rebounds after being selected for the All-Star Game for the 21st consecutive season earlier in the day.\n\n\r\n              James also passed Hakeem Olajuwon into seventh place in defensive rebounds in NBA history early in the third quarter. James, who has 9,720, needed six going into the game to pass the Hall of Fame center.\n\n\r\n              Kristaps Porzingis led Boston with 22 points and Jaylen Brown added 17.\n\n\r\n              Los Angeles, which has won two straight after a stretch where it dropped four of six, was up by 28 during the fourth quarter.\n\n\r\n              Takeaways\r\n              Celtics: Jayson Tatum, also voted to the All-Star Game, finished with 16 points. Boston played three games in four days and was coming off a 117-113 overtime victory against the Clippers on Wednesday.\n\n\r\n              Lakers: Gabe Vincent tied a season high with four 3-pointers and finished with 12 points. Los Angeles hit 11 3-pointers in the first half, tying its season high for the first two quarters. It was 15 of 35 from beyond the arc for the game.\n\n\r\n              Key moment\r\n              James drove past Luke Kornet and Sam Hauser in the lane and finished with a dunk with 8.9 seconds left in the first quarter to give the Lakers a 34-23 lead and finish a 17-5 run to close out the period.\n\n\r\n              Key stat\r\n              Bronny James got into his second straight game and was 0 of 1 from the field in four minutes.\n\n\r\n              Up next\r\n              Both teams return to action Saturday. The Celtics are at Dallas and the Lakers begin a six-game road trip against Golden State.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997171.2225258
}