{
  "game_id": "0022400601",
  "espn_id": "401705167",
  "date": "Jan 20, 2025",
  "matchup": "MEM vs. MIN",
  "headline": "Jackson, Bane lead 4th-quarter rally as Grizzlies beat Timberwolves 108-106",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson Jr. had 24 points, including 15 in the fourth quarter, and Desmond Bane added 22 points as the Memphis Grizzlies used a late rally to beat the Minnesota Timberwolves 108-106 on Monday.\n\n\r\n              Jackson, who was 6 of 8 in the final quarter, added 10 rebounds and a pair of blocks for Memphis, which won its third straight. Ja Morant finished with 19 points, despite going 5 of 16 from the field.\n\n\r\n              Anthony Edwards led Minnesota with 32 points, while Naz Reid finished with 29 points, including 15 in the fourth as Minnesota tried to thwart the Memphis rally. Edwards had a chance to win the game, but his 3-point attempt with Bane and Jackson guarding him was off the mark.\n\n\r\n              Memphis outscored Minnesota 37-30 in the fourth.\n\n\r\n              Minnesota announced before the game that guard Donte DiVincenzo will be out with a big toe injury.\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota seemed to be answering every Memphis rally in the fourth until the final 3:54.\n\n\r\n              Grizzlies: Memphis pulled within one possession on several occasions in the fourth until an 11-0 run finally overtook the Timberwolves.\n\n\r\n              Key moment\r\n              Minnesota inbounded the ball into the backcourt with five seconds left and Edwards was forced to hoist a 27-footer over Bane and Jackson that missed. Memphis beat the Timberwolves 127-125 on Jan. 11.\n\n\r\n              Key stat\r\n              Rudy Gobert, who entered the game 32 of 39 (82.1%) over the past five games, was 1 of 5 from the field.\n\n\r\n              Up next\r\n              Both teams are back in action Wednesday night with Minnesota at Dallas and Memphis hosting Charlotte.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997730.7240782
}