{
  "game_id": "0021500049",
  "espn_id": "400827936",
  "date": "Nov 02, 2015",
  "matchup": "OKC @ HOU",
  "headline": "Harden leads Rockets to first win, 110-105 over Thunder",
  "body": "HOUSTON -- James Harden knew his shot would start falling eventually.\nIt returned on Monday night.\n\"I hit the first two shots and I was like: `OK, I've got something today,\" he said.\nHarden scored 37 points, and the Houston Rockets beat the Oklahoma City Thunder 110-105 for their first win of the season.\n\nIt was the first loss for the Thunder, who won their first three games while the Rockets dropped their first three.\nHarden was 12 of 26 from the field after a tough start to the season. He shot below 30 percent in each of the first three games.\n\"I'm sure all great shooters go through droughts, he said. \"Mine was pretty terrible, I admit. But it will change. It will all come around. It's a long season and I'll go on five, six, 10-game streaks where I'm just on fire and it will even itself out.\"\nAn 8-1 run by the Rockets made it 107-100 with about two minutes left. Harden capped that key stretch with a 3, knocking it down with Russell Westbrook right in his face.\nWestbrook made a 3-pointer with 44 seconds left to make it 108-105, and Harden missed a 3 on the other end. But Westbrook and Kevin Durant both missed 3-pointers on the next possession and Dwight Howard made a pair of free throws with 5.7 seconds left to secure the victory.\nDurant led the Thunder with 29 points, and Westbrook added 25 points, eight rebounds and 11 assists.\n\"They'd lost three in a row and they should be desperate,\" Westbrook said. \"We let them off the hook.\"\nHarden scored five straight points to put the Rockets on top 97-93 midway through the fourth, but consecutive baskets by Durant and Westbrook tied it back up less than a minute later.\nThe teams exchanged the lead several times early in the fourth quarter, once when a 3-pointer by Patrick Beverley gave Houston a 90-89 advantage with less than nine minutes remaining. He beat his chest and yelled something to Westbrook after the score.\nWestbrook's layup put Oklahoma City up 93-92, and the jawing continued, earning both players a technical foul.\nA free throw by D.J. Augustin extended Oklahoma City's lead to four late in the third quarter. But the Rockets scored the last seven points of the period to take their first lead since the first quarter.\nTIP-INS:\nThunder: Serge Ibaka had 12 points and 14 rebounds. ... Augustin also finished with 12 points.\nRockets: F Terrence Jones missed his second straight game after getting a cut on his eyelid on Friday night against the Warriors. He is day to day. ... F Donatas Motiejunas remains out indefinitely after back surgery in April. ... Corey Brewer added 12 points.\nSTAR POWER\nHouston Texans star J.J. Watt watched from a courtside seat. Houston's mascot Clutch handed him a Rockets jersey with his No. 99 and his name on it in the fourth quarter. He put it on and walked to the scorer's table and pretended like he was checking into the game, drawing loud cheers from the crowd.\nBACK TO BACK\nHoward played just his second game of the season after he missed the opener because he was suspended for flagrant fouls in the postseason and also rested on Sunday.\n\"As the season goes I think I'll be able to play those back to backs but I think early in the season it's not smart to do that,\" said Howard, who had 16 points and eight rebounds. \"People will say: `Why? You're young.' But I've been in the league for 12 years and I want to be able to walk when I'm done playing basketball.\"\nGATOR TIES\nBrewer started for Thunder coach Billy Donovan at Florida when the Gators won back to back national titles in 2006 and 2007. In the past Donovan has kept up with former players like Brewer through highlights and text messages, but is looking forward to seeing those players in person this season now that he's coaching in the NBA. The coach raved about Brewer.\n\"I see a lot of the things that he's doing in the NBA now that he did for us,\" Donovan said. \"He has a great motor, really, really good competitor. Coming off the bench he brings a level of intensity for the team.\"\nUP NEXT\nThunder: Host the Toronto Raptors on Wednesday.\nRockets: Host the Orlando Magic on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994224.8538501
}