{
  "game_id": "0021900857",
  "espn_id": "401161499",
  "date": "Feb 25, 2020",
  "matchup": "IND vs. CHA",
  "headline": "Sabonis scores 21 points to lead Pacers over Hornets, 119-80",
  "body": "INDIANAPOLIS --  Domantas Sabonis and the Indiana Pacers took control early before blowing out the Charlotte Hornets.\n\n\"We just wanted to come in and set a tone early,\" Sabonis said after Indiana's 119-80 victory on Tuesday night. \"From the first possession, we just made them feel us. The second unit followed in. It just went smoothly. Every night is a completely different game. You've got to just keep playing.\"\n\nSabonis had 21 points, 15 rebounds and nine assists. T.J. Warren scored 15 of his 19 points in the first half and Justin Holiday had 16 points off the bench for the short-handed Pacers (34-24), who bounced back from a blowout in Toronto for a third win in four games.\n\nMiles Bridges scored all of his 17 points in the first half and Caleb Martin had 11 for the Hornets (19-38), who have lost two in a row after a stretch of three straight wins -- all on the road.\n\nThe Hornets were held to their lowest point total this season and the lowest by a Pacers opponent.\n\nThe Pacers controlled much of the game without two regular starters.\n\nThey were without Jeremy Lamb for the first time since a season-ending left knee injury suffered in their 127-81 loss at Toronto on Sunday. He will undergo surgery, but Pacers coach Nate McMillan said no date has yet been scheduled and Lamb could seek a second opinion first.\n\nVictor Oladipo was out for a second straight game with a sore lower back. He appeared in eight games after missing the first 47 games of the season while recovering from a right knee injury.\n\nIndiana put the game away for good with a 12-2 run to open the second half. Warren scored on a jumper to put the Pacers ahead 81-46 with 8:43 remaining in the third quarter.\n\nIt was a completely different performance after the 46-point loss to the Raptors.\n\n\"I did expect us to play better, with more urgency,\" McMillan said. \"We talked about establishing ourselves on both ends of the floor. Our intensity and our game must pick up and get to the next level. Every possession counts. You have to really go out and establish yourselves early. We've just been inconsistent with that. Toronto just totally smacked us, but I loved our response tonight.\"\n\nThey led by as much as 43 points when JaKarr Sampson made a layup to make it 102-59 with 8:41 to play.\n\nThe Pacers built an early lead with an 18-2 run in the first half. Warren had a layup to put Indiana ahead 56-32 with 5:33 to go in the second quarter. The Pacers led by as much as 27 points after Warren scored with 3:53 to go in the half.\n\n\"They got going on offense,\" Bridges said. \"We couldn't make anything and our defense was terrible. That pretty much sums up the whole game.\"\n\nIndiana led 69-44 at halftime.\n\nTIP-INS\n\nHornets: G Devonte' Graham (rest) was active but didn't play. . G Malik Monk scored eight points in his first career start. . Charlotte finished shooting 33% from the field.\n\nPacers: C Myles Turner had a career-high eight blocked shots. . Indiana shot 68.3% in the first half. . G Edmond Sumner was out with a sore left hip.\n\nSHARING THE BALL\n\nThe Pacers matched their season high for the fourth time this season with 35 assists. They are 12-2 this season when finishing with 30 or more assists in a game.\n\nWINNING AT HOME\n\nIndiana is a win away from clinching a winning record at home for a 31st consecutive season, but home victories have been hard to come by in recent games. The Pacers, who are 20-10 at home this season, entered the game losing five of the last six at home.\n\nUP NEXT\n\nHornets: Host New York on Wednesday night.\n\nPacers: Host Portland on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995839.021007
}