{
  "game_id": "0021600929",
  "espn_id": "400900324",
  "date": "Mar 05, 2017",
  "matchup": "PHX vs. BOS",
  "headline": "Ulis hits 3 at buzzer, Suns beat Celtics in wild finish",
  "body": "PHOENIX --  Some said Tyler Ulis was too small for the NBA. That's why he wasn't drafted until the second round.\n\nHe sure looks like he belongs now.\n\nOn a night where small players took center stage, the diminutive rookie, listed optimistically at 5-foot-10, threw in a 3-pointer at the buzzer after Isaiah Thomas' turnover and the Phoenix Suns came away with a wild 109-106 victory over the Boston Celtics on Sunday.\n\nThe Suns' Eric Bledsoe tied it at 106 with a reverse layup with four seconds to play.\n\nThe 5-foot-9 Thomas, the league's No. 2 scorer who had 35 points but missed a free throw with 11.9 seconds left, took the inbounds pass from Jae Crowder and the Suns' Marquese Chriss knocked the ball away.\n\n\"He got a hand on it,\" said Thomas, a former Sun. \"I thought Jae would get it out quicker than he would. I don't know if he was looking to see if we had a timeout or I don't know what he was thinking to do.\"\n\nUlis grabbed the ball and tossed it up as the buzzer sounded.\n\n\"I figured it would come down to me having to take a late shot,\" he said. \"Not like that, you know, off the steal, but I just shot it with confidence.\"\n\nUlis scored 20 points, a career best for the second game in a row. Bledsoe had 28 to help the Suns win three in a row for the first time this season.\n\nThe Celtics were without usual starters Al Horford (right elbow sprain) and Avery Bradley (right hamstring strain).\n\nChriss, another Phoenix rookie, scored 10 points and had a career-best five blocked shots to go with his one crucial steal. Devin Booker added 16 points, and T.J. Warren had 14. Alan Williams had 11 points and matched his career best with 15 rebounds.\n\nCrowder drove straight down the lane for an underhand layup, was fouled and made the free throw for a three-point play that put the Celtics up 104-102 with 41.6 seconds to play, the fifth of six lead changes in the final 4:41. Brown made one of two free throws to put Boston up 105-102 with 20.7 seconds to go.\n\nBledsoe drove for a layup to slice the lead to 105-104 with 13.7 seconds to play, then Thomas made one of two free throws to put Boston up 106-104 and set up the frantic finish.\n\n\"Obviously, you don't want to turn it over at that time,\" Boston coach Brad Stevens said, \"but those things happen and Ulis made a heck of a shot.\"\n\nNobody was happier for Ulis than his best friend and former Kentucky teammate Booker.\n\n\"Everybody looked at him as a pass-first point guard,\" Booker said, \"but he can pretty much do it all. It doesn't surprise me. I've seen him do much of all this. Here on the NBA level, I think a lot more people are getting to see it.\"\n\nCrowder scored 16 points, and Jaylen Brown and Terry Rozier added 14 apiece for Boston, in the second stop of a five-game trip.\n\nUlis scored 15 points in the first half to help Phoenix to a 49-42 lead at the break and the Suns led by as many as 15 in the third quarter.\n\nTIP INS\n\nCeltics: Before coming to Phoenix for the game, Thomas called the February 2015 trade from the Suns to Boston \"a Christmas gift.\" ... Boston had beaten Phoenix three straight times. ... The shortest jump ball matchup in NBA this season occurred in 1st half between the 5-foot-9 Thomas and Ulis. Thomas waved his hands to encourage the fans, then easily won the jump.\n\nSuns: Phoenix improved to 13-9 against the Eastern Conference, 9-4 at home. Suns have won two in a row only four times this season. ... Phoenix has won a season-best four in a row at home. ... Ulis did not play in 21 games this season and is now ahead of Brandon Knight as the team's backup to Bledsoe at point guard. ... Phoenix faced the top two scorers in the NBA in consecutive games. Russell Westbrook scored 48 on Friday, Thomas 35 on Sunday.\n\nUP NEXT\n\nCeltics: Boston goes back to Los Angeles to face the Clippers Monday night\n\nSuns: Phoenix plays the Washington Wizards on Tuesday night in the fourth game of five straight at home.",
  "source": "espn_api",
  "crawled_at": 1764995956.339821
}