{
  "game_id": "0021600796",
  "espn_id": "400900201",
  "date": "Feb 09, 2017",
  "matchup": "OKC vs. CLE",
  "headline": "Westbrook's 29 points, triple-double lead Thunder past Cavs",
  "body": "OKLAHOMA CITY --  The Cleveland Cavaliers considered resting their stars, then played the Oklahoma City Thunder at full strength and lost anyway.\n\nRussell Westbrook scored 29 points and had his 26th triple-double of the season to lead Oklahoma City to a 118-109 victory on Thursday night.\n\nCavaliers coach Tyronn Lue said after Wednesday's win at Indiana that he was considering resting All-Stars LeBron James, Kyrie Irving and Kevin Love, but they all started.\n\n\"There was a lot of drama going on before the game,\" Thunder coach Billy Donovan said. \"Who's playing? Who's not playing. They're in. They're out. They may play. It looks like they're going to play. I just really told our guys, even in shootaround this morning, it's about what we need to do and we need to understand personnel like we do for every scout.\"\n\nIrving scored 28 points, James had 18 and Love added 15 points and 12 rebounds for the Cavaliers.\n\n\"It was good to go through something tough,\" Lue said. \"It was a tough game for us. Four games in six nights, and it was good to fight through and not give in, so our guys came out and played. I liked how we competed.\"\n\nThe Cavaliers beat New York, Washington and Indiana before ending their road trip in Oklahoma City.\n\n\"We would have loved to be 4-0, but coming off a back-to-back, you know they gave us everything they had,\" James said. \"We go home extremely proud of what we did on this road trip.\"\n\nVictor Oladipo scored 23 points, Steven Adams had 20 points and 13 rebounds, and Westbrook added 12 rebounds and 11 assists in the 63rd triple-double of his career. Oklahoma City now can focus on its showdown with former teammate Kevin Durant and the Golden State Warriors on Saturday.\n\nCleveland rallied from 12 points down in the second quarter to lead 57-55 at halftime. James had 16 points at the break while Westbrook had 10 points, nine rebounds and eight assists.\n\nWestbrook scored 11 points in the third quarter, and by the time he sat for his usual rest late in the period, the Thunder led 79-71. Oklahoma City led 86-82 at the end of the quarter, but the Cavaliers tied the game midway through the fourth.\n\nWestbrook hit back-to-back midrange jumpers to put the Thunder up 107-101 with 3:42 left. The Thunder increased their lead to 111-101 on a 360-degree layup by Oladipo with 2:07 to play that gave Westbrook his 10th assist and clinched his triple-double.\n\n---\n\nTIP INS\n\nCavaliers: Signed forward Derrick Williams to a 10-day contract after the Miami Heat recently waived the No. 2 pick in the 2011 draft. He finished with 12 points in 22 minutes in his Cleveland debut. ... James, who entered the night second in the league with 37.6 minutes per game, played 40 minutes.\n\nThunder: Shot 54.2 percent in the first quarter to lead 29-21. ... Westbrook, the league's leading scorer, did not make a field goal until halfway through the second quarter. ... G Cameron Payne scored a season-high 15 points.\n\nQUOTABLE\n\nA day after former Knicks star Charles Oakley was forcefully removed from his seats at Madison Square Garden and arrested after an altercation near Knicks owner James Dolan, James said: \"Charles Oakley for President.\" James' comment followed an unusually short media session, and was said after the crowd near his locker had dispersed.\n\nSTAT LINES\n\nThe Thunder outrebounded the Cavaliers 51-35.\n\nUP NEXT\n\nThe Cavaliers host the Denver Nuggets on Saturday.\n\nThe Thunder host the Golden State Warriors on Saturday in Durant's first game in Oklahoma City since leaving as a free agent.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP",
  "source": "espn_api",
  "crawled_at": 1764995274.740094
}