{
  "game_id": "0022000986",
  "espn_id": "401307789",
  "date": "May 04, 2021",
  "matchup": "MIA vs. DAL",
  "headline": "Hardaway Jr. makes 10 3's, Mavs roll past Heat 127-113",
  "body": "MIAMI -- — Tim Hardaway Jr. spent many nights as a kid shooting on the Miami Heat court, a perk that came with his father being a star guard for the team.\n\n\r\n                    Clearly, it still feels like home.\n\n\r\n                    Hardaway Jr. made 10 3-pointers and scored 36 points, Luka Doncic added 23 points and the Dallas Mavericks moved up to the No. 5 spot in the Western Conference by topping the short-handed Heat 127-113 on Tuesday night.\n\n\r\n                    Hardaway Jr., back in an arena where his father Tim Hardaway's jersey sways from the rafters as a Heat legend, shot 13 of 24 from the field, 10 of 18 from 3-point land.\n\n\r\n                    “Having that honor and that privilege to play under that jersey, it's special,\" Hardaway Jr. said.\n\n\r\n                    Doncic had 12 rebounds and eight assists for the Mavericks, Jalen Brunson scored 19 points and Josh Richardson scored 17 for Dallas (37-28). The Mavs are tied with the Los Angeles Lakers record-wise, but hold the tiebreaker. \n\n\r\n                    Hardaway Jr. tied the Mavericks record for 3’s in a game, plus became the third player to ever make that many in a game against Miami. \n\n\r\n                    “Once he caught fire, he became just a big X-factor,\" Heat coach Erik Spoelstra said.\n\n\r\n                    Duncan Robinson and Goran Dragic each scored 19 for Miami, which remained No. 6 in the Eastern Conference. The Heat played without Jimmy Butler, ruled out about two hours before the game with flu-like symptoms — not anything related to the coronavirus, the team said.\n\n\r\n                    Trevor Ariza scored 16 of his 18 points in the first quarter for Miami. Gabe Vincent and Kendrick Nunn each scored 14 and Bam Adebayo finished with 11 points, 11 assists and nine rebounds for the Heat.\n\n\r\n                    Miami (35-31) stayed sixth, but is now a full game behind No. 5 Atlanta (36-30) with six games left and the Hawks owning the tiebreaker. The Heat also are now just a half-game ahead of No. 7 Boston (34-31) and play the Celtics twice on the road next week.\n\n\r\n                    “We're not trying to make it any harder on ourselves,\" Ariza said.\n\n\r\n                    The win clinched no worse than a play-in tournament berth for Dallas, which would have fallen to No. 7 in the West with a loss.\n\n\r\n                    “We’re just we’re going day-to-day with what we need to do to prepare for each given game,” Mavericks coach Rick Carlisle said. “Players are aware of standings and all the machinations going on there. We’ve got to stay in the present, we’ve got to stay process oriented and we’ve got to do the things that bring us success.”\n\n\r\n                    The Mavs were down 11 early, but outscored Miami 33-15 in the second quarter and took the lead for good. Rookie Josh Green played the whole second quarter, and Carlisle credited his energy as one of the big reasons for the turnaround.\n\n\r\n                    “The guy who changed the game was Josh Green,\" Carlisle said.\n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Dallas is 13-3 since Feb. 3 in the game immediately following a loss. ... Kristaps Porzingis (right knee soreness) was out again but on the floor for a pregame workout. ... JR Smith (in 2014) and Paul George (in 2019) were the others to make 10 3’s in a game against Miami. George McCloud (in 1995) and Wesley Matthews (in 2015) were the other Mavs to make that many.\n\n\r\n                    Heat: On his 29th birthday, Victor Oladipo (right knee) missed his 14th consecutive game. Tyler Herro (right foot soreness) sat out his sixth game in a row. ... Dragic fell to 2-2 in his head-to-head matchups with Doncic, his fellow Slovenian. ... Miami was 8 of 9 on 3's in the first quarter, then 1 of 11 in the second and finished the game 18 of 41.\n\n\r\n                    HASLEM’S TIME\n\n\r\n                    Udonis Haslem hasn’t played yet this season for Miami, his 18th with the Heat, though Spoelstra said he intends to use him at some point in the final games. “I’m going to make it happen,” Spoelstra said. The Heat keep Haslem, who appeared in four games last season, on the roster for his leadership behind the scenes — and might do the same again next season if Haslem wants.\n\n\r\n                    KLEBER STATUS\n\n\r\n                    Maxi Kleber missed the game for Dallas because of right Achilles soreness, adding to a season where he’s missed time with no fewer than five health issues, COVID-19 among them. The Mavs are bracing for him to miss a couple more games before returning. “It’s just been a lot ... so we’re going to take a little time here,” Carlisle said.\n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: Host Brooklyn on Thursday.\n\n\r\n                    Heat: Host Minnesota on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997815.912916
}