{
  "game_id": "0021500181",
  "espn_id": "400828068",
  "date": "Nov 20, 2015",
  "matchup": "DET @ MIN",
  "headline": "Drummond, Pistons grind out win over T-Wolves",
  "body": "MINNEAPOLIS --  It took about 24 minutes for Andre Drummond and the Detroit Pistons to grind the game against Minnesota into a hard-to-watch pulp devoid of fast-break opportunities and ball movement of any kind.\n\nThe young Timberwolves couldn't pick up the pace in another lifeless effort at home, succumbing to Drummond's muscle and craftiness around the rim.\n\nDrummond had 21 points and 11 rebounds to lift the Pistons to a 96-86 victory on Friday night.\n\nDrummond made 10 of 13 shots on a rough shooting night for both teams and overcame an upper respiratory infection that kept him from practicing the previous day and may have led to a quiet first half.\n\n\"I thought he started real slow tonight,\" Pistons coach Stan Van Gundy said. \"But he found it somewhere and in the second half he was really good.\"\n\nMarcus Morris had 16 points and 11 rebounds and the scuffling Pistons squeezed out a victory after losing four of their previous five games. Reggie Jackson scored 18 points, including two tough drives to the hoop in the final three minutes to hold off a late charge from Minnesota.\n\nAndrew Wiggins scored 21 points and Karl-Anthony Towns had 18 points and seven rebounds for the Timberwolves (5-8), who fell to 0-6 at home this season. That's the second-worst start at home in franchise history.\n\n\"We can't score,\" said coach Sam Mitchell, whose Timberwolves went 3 for 13 on 3s. \"We're getting shots. We're missing them. We've just got to score better.\"\n\nNeither team played well, combining for 30 assists on 73 made baskets and 9-for-41 shooting from 3-point range.\n\nDrummond has been one of the stars of the early part of the season, notching double-doubles in his first 11 games and averaging an incredible 18.9 boards per game. But he had just four points and four rebounds in the first half.\n\nHe picked up his third foul with five minutes to play in the second quarter and had to go to the bench, and the Pistons struggled to get anything going offensively without their big man there to clean up the glass. After a 7-for-10 start to the game, the Pistons went 9 for 32 to fall behind by 10 points in the first half.\n\nThe rookie Towns outplayed him in the first 28 minutes, grabbing one more rebound and taking Drummond away from the basket with his ability to knock down 20-foot jumpers.\n\nThe Timberwolves have played very well on the road, with victories over Atlanta, Chicago and Miami, but have played with a startling lack of energy and urgency. The malaise was there again for most of this one, with turnovers, poor shooting and a lack of ball movement in the second unit putting them down nine points early in the fourth.\n\nDrummond got rolling in the third, scoring 15 points, including nine in a row to push the Pistons back in front.\n\n\"We did a little better job of getting him the ball in deep,\" Van Gundy said. \"And when he gets the ball in there, he's pretty good.\"\n\nThe Wolves finally showed some signs of life in the final five minutes, pulling to 85-80 on a dunk from Zach LaVine.\n\nBut Jackson responded with two straight buckets to give the Pistons (7-5) the win.\n\n\"We just decided to play defense,\" Jackson said. \"We keyed in, we really did the things that we wanted to do. We tried to limit the spacing on the floor, tried to play tighter defense.\"\n\nTIP-INS\n\nPistons: Drummond's streak of double-doubles to start the season is one shy of Dave DeBusschere's 13 straight to open the 1966-67 season, which is the best in franchise history. ... Anthony Tolliver spent two seasons in Minnesota. He went scoreless on 0-for-7 shooting in 21 minutes. ... Stanley Johnson had 15 points and hit 3 of 5 3s.\n\nTimberwolves: F Nemanja Bjelica did not play because of a bruised left knee. ... Ricky Rubio had 12 points and seven assists. ... LaVine finished with 14 points.\n\nPISTONS BENCH\n\nJohnson and Aron Baynes gave the Pistons a big boost off the bench. Baynes had six points and 11 rebounds in 19 minutes -- a season high for playing time -- and helped turn the game into a slugfest in the first half.\n\n\"I thought that Aron was tremendous,\" Van Gundy said. \"I mean 11 rebounds in less than 19 minutes. He was great, and he was great defensively. I think he really sort of spearheaded our defense.\"\n\nUP NEXT\n\nPistons: Host Washington on Saturday.\n\nTimberwolves: Host Philadelphia on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994951.2631721
}