{
  "game_id": "0021900420",
  "espn_id": "401161062",
  "date": "Dec 20, 2019",
  "matchup": "MEM @ CLE",
  "headline": "Clarkson, Love lead Cavs past Grizzlies 114-107",
  "body": "CLEVELAND -- \n\nThe Cleveland Cavaliers didn't panic when faced with a 12-point deficit early in the fourth quarter.\n\nInstead, the Cavaliers rallied to beat the Memphis Grizzlies 114-107 on Friday night, winning back-to-back games for the second time this season.\n\nJordan Clarkson scored a season-high 33 points, and Kevin Love hit the go-ahead 3-pointer with just over a minute to play.\n\n\"We had a deficit, but we were able to fight back,\" said Love, who had another 3-pointer earlier in the quarter. \"We knew we had to get this one on our home floor.\"\n\nLove's clutch shot gave the Cavaliers a 109-107 lead with 1:03 left. Collin Sexton made three free throws and rookie Darius Garland added two to put the game away.\n\nClarkson hit 12 of 17 shots, including 6 of 8 3-pointers. Love had 21 points, including five 3-pointers, and 13 rebounds.\n\n“There was a point in the fourth quarter where I didn't think we'd be sitting up here with a ‘W,'” Cavaliers coach John Beilein said. \"I love the way we fought back.\"\n\nJaren Jackson led Memphis with 24 points while Dillon Brooks scored 16, but the Grizzlies took their second straight tough loss. Memphis failed to hold a 24-point third-quarter lead against Oklahoma City on Wednesday.\n\n\"A disappointing loss, given the lead we had,\" Grizzlies coach Taylor Jenkins said. \"Credit the Cavs for coming back in the fourth.\"\n\nRookie Ja Morant matched a season low with eight points. His basket with 1:23 left put Memphis ahead 107-106, but the Grizzlies didn't score again.\n\nThe game had 25 lead changes and was tied 16 times.\n\nGrayson Allen's four-point play gave Memphis a 93-81 lead with 10:28 to play. He hit a 3-pointer from the corner and was fouled by Kevin Porter Jr. The call on Porter was upgraded to a flagrant foul, but Memphis failed to convert the extra possession and Cleveland quickly rallied.\n\nClarkson scored five points and Tristan Thompson's rebound dunk cut the lead to 103-102. Love made one of two free throws with 3:15 left to tie the game and hit a 3-pointer with 2:50 left to give Cleveland a 106-103 lead.\n\nMemphis regained the lead on baskets by Jackson and Morant, who matched a season high with 11 assists. Jonas Valanciunas had 14 points and 14 rebounds.\n\nMorant, taken with the second pick in the draft, failed to reach double figures for only the third time in 23 games. He took blame for the defeat.\n\n\"The last minute I made a turnover and I missed a box out,\" he said. \"Put that loss on me. I’ll take it.”\n\nCleveland also won consecutive games on Nov. 8-10 against Washington and New York.\n\nTIP-INS\n\nGrizzlies: Allen returned after missing five games because of a sore right ankle. He was hit with a technical for clapping in Porter's face after being fouled by Cleveland's rookie in the third quarter. Allen scored nine points in 11 minutes. ... The franchise is 4-19 on the road against the Cavaliers.\n\nCavaliers: Garland had 14 points while Cedi Osman scored 13. ... Thompson had 10 points and 15 rebounds. He became the second player in franchise to reach 2,000 offensive rebounds in his career. Zydrunas Ilgauskas is first with 2,336.\n\nROOKIE MEETS VET\n\nMorant took off in the lane and tried to dunk over Love in the first quarter, but the ball hit off the back of the rim and sailed toward the other end of the court. Morant's leg struck Love in the head and both players went to the floor. The 12-year veteran helped the first-year player to his feet as Cleveland scored on a fast break.\n\nLove joked that he might have asked for a medical retirement had Morant finished the play.\n\n\"Boy, I was so glad he missed that dunk,\" Love said. \"I looked back, I helped him up. That was my tip of the hat to him. That kid, he's really special and you gotta give credit where credit is due. He's going to continue to get better.\"\n\n\"He was in the way,\" Morant said with a sly smile. \"You don’t get any cool points if you miss it. I probably cocked it back too much because it hit the rim.\"\n\nUP NEXT\n\nGrizzlies: Host Sacramento on Monday.\n\nCavaliers: Host Atlanta on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995735.030089
}