{
  "game_id": "0021900245",
  "espn_id": "401160887",
  "date": "Nov 25, 2019",
  "matchup": "MIA vs. CHA",
  "headline": "Heat remain unbeaten at home, roll past Hornets 117-100",
  "body": "MIAMI --  Bam Adebayo still remembers all the painful details of his rookie season, when the Miami Heat couldn’t use him in a lot of situations because he was still learning everything.\n\nThose days are long gone.\n\nAdebayo scored 21 points and grabbed 13 rebounds, Jimmy Butler also scored 21 points and the Heat remained unbeaten at home with a 117-100 win over the Charlotte Hornets on Monday night.\n\nIt was Adebayo’s ninth double-double this season, and the Heat are 9-0 in those games.\n\n“I know humble beginnings,” Adebayo said. “I remember when I wasn’t playing. So I always remember where I came from and from where I started. I’ve worked hard for this.”\n\nKendrick Nunn scored 19 points, Tyler Herro added 18 and Kelly Olynyk finished with 15 points and a career-high 16 rebounds for Miami.\n\nThe Heat are 7-0 at home for only the second time -- they went 8-0 at home to start the 2012-13 championship season.\n\nAnd they're not just winning at home, but they're winning big. The Heat have led by at least 15 points in all seven of their home games, by at least 20 in six of them. The margin on Monday night got up to 23.\n\n“This is a step in the right direction,” Heat coach Erik Spoelstra said. “Guys are taking it to heart.”\n\nTerry Rozier had 19 points and nine assists for Charlotte, which has dropped five in a row. Devonte' Graham scored 16 and Malik Monk scored 13 for the Hornets, who were outrebounded 49-35.\n\nRozier had a three-point play with 8:36 left to get Charlotte within 14, but an 11-2 run by the Heat over the next 4:18 put the game away.\n\n“The message was the defense has to get better and has to improve,” Hornets coach James Borrego said. “Right now we're physically soft, we lack intensity on that end of the floor, when teams make runs we tend to hang our head and we've just got to get better. That comes with time, that comes with accountability and execution, and we've got to get better on that end of the floor.\"\n\nMiami used nine players -- and had no others available. James Johnson was sent home pregame because he was sick, and Udonis Haslem was also out with an illness. Dion Waiters remains on his 10-game suspension, while Justise Winslow (concussion), Derrick Jones Jr. (hip) and KZ Okpala (Achilles) are still hurt.\n\nWinslow and Jones may practice Tuesday. The Heat were so thin depth-wise that when Olynyk got shaken up with an arm problem in the third quarter, he remained in the game despite being in obvious discomfort.\n\n“Good teams take care of their business at home,” Olynyk said. “When teams come in here, we have to win, plain and simple. When you get in the playoffs, you have to win on your home floor. So it starts now.”\n\nTIP-INS\n\nHornets: Charlotte has now had separate losing streaks of three, four and five games already this season. ... The Hornets lost Cody Zeller in the third quarter to a left hip contusion. ... P.J. Washington, who scored 27 points in his first game and was averaging 13.1 points through his first 13 contests, scored only eight Monday. He has a total of 28 points in his last five games.\n\nHeat: Miami still has not trailed by more than eight at home this season, though that seemed in jeopardy when Charlotte ran out to a 7-0 lead to start the game. ... The Heat had a six-point trip in the second quarter. Nunn hit a 3-pointer while Olynyk was the recipient of a flagrant foul from Nicolas Batum. Olynyk made a free throw, then Herro made a long jumper on the ensuing Miami possession.\n\nBABY WATCH\n\nSpoelstra is keeping a phone nearby at all times these days, with good reason. Spoelstra and his wife Nikki are expecting their second child, one that could be arriving in the next few days. \"We have a little bit of time,\" he said. \"I also thought we had a little bit of time last time.\" Spoelstra missed a game late in March 2018 when the couple's first son was born.\n\nGRAHAM RETURNS\n\nGraham didn't play in either of Charlotte's games in Miami last season, though Monday wasn't his first time on the Heat floor. He dropped 35 for Kansas in a game against Syracuse at Miami on Dec. 2, 2017 -- shooting 10 for 17 from the field, 7 for 13 from 3-point range.\n\nUP NEXT\n\nHornets: Host Detroit on Wednesday, in the start of a home-and-home.\n\nHeat: Visit Houston on Wednesday. Miami is 1-5 in its last six trips there.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995546.435931
}