{
  "game_id": "0021600251",
  "espn_id": "400899701",
  "date": "Nov 27, 2016",
  "matchup": "HOU @ POR",
  "headline": "Harden has 38 in Rockets' 130-114 win over the Blazers",
  "body": "PORTLAND, Ore. --  James Harden easily exposed Portland's struggles on defense.\n\nHarden had 38 points and 10 assists for his seventh consecutive double-double, and the Houston Rockets beat the Trail Blazers 130-114 on Sunday night. It was his 14th double-double this season.\n\nHis mentality?\n\n\"Make the right play, that's all,\" he said.\n\n\"As a point guard I'm going to see a lot of defenses, so I've just got to figure out what they're doing and how to attack it and just go from there.\"\n\nEric Gordon added 26 points including six 3-pointers for the Rockets, who have made at least 10 3-pointers in 16 straight games to match the NBA record set by the Warriors and Cavaliers last season. They finished the night with 17.\n\nGordon's 3-pointer gave the Rockets a 104-95 lead with just over 10 minutes left in the game. Damian Lillard's 3-pointer and Mason Plumlee's reverse layup closed the gap to 104-100, but the Blazers couldn't get closer and Trevor Ariza hit a 3 from the corner to put the Rockets up 111-100.\n\nCJ McCollum scored 28 points and Lillard had 27 for the Blazers, who have lost six of their last eight games. Portland gave up 30 or more points to the Rockets in each quarter.\n\n\"They're a difficult team to guard,\" Blazers coach Terry Stotts said. \"I think James does a great job of playing the game and figuring out what needs to be done.\"\n\nThe Rockets attempted an NBA-record 50 3-pointers and made 21 in a 117-104 victory at Sacramento on Friday night to open a five-game road trip. Harden had 23 points, 10 rebounds and 10 assists.\n\nFirst-year Houston coach Mike D'Antoni said he feels like the Rockets are finding a groove in his system.\n\n\"I think they're getting more comfortable with how we're doing things. They're moving the ball a little better,\" D'Antoni said. \"We can still do better.\"\n\nThe Blazers beat New Orleans 119-104 at home on Friday night after struggling on a 1-4 road trip. Portland is missing starting forward Al-Farouq Aminu, who has been sidelined for more than two weeks with a calf injury. Ed Davis started in his place against the Rockets.\n\nLillard and McCollum combined for 20 points as the teams finished the first quarter knotted at 35. The Rockets went on a 9-0 run late in the second and led 65-62 at the half, paced by Harden's 21 points.\n\nRyan Anderson hit a 3-pointer that made it 83-75 for the Rockets, who led by as many as 10 points in the third quarter. The Blazers pressured, coming within 94-93 late after Lillard made a pair of free throws.\n\nHarden finished with five 3-pointers.\n\n\"Right now we're not getting it done on the defensive end,\" Lillard said. \"I think that's what it comes down to. You look at the Cleveland game, we scored 120-something points and we lose. That's a lot of points to score and not win the game. Tonight we had 114 and we lose. Obviously we're capable of scoring, we're going to put points on the board, but we've got to find a way to come up with more stops and be more consistent.\"\n\nTIP-INS\n\nRockets: Rookie Kyle Wiltjer has been traveling with the Rockets, although he hasn't played. Wiltjer, who went undrafted out of Gonzaga, is a Portland native and played for Jesuit High School, helping the team to three straight Oregon state championships.\n\nTrail Blazers: Through its first 19 games, Portland has made more than 200 3-pointers, more than any Blazers team in franchise history. The Blazers have 209 total.\n\nSCORING IS NOT THE ISSUE\n\nPortland has scored at least 100 points in 17 of 19 games this season.\n\nGORDON'S GAME\n\nGordon was just one off his season high for points.\n\n\"I just got off to a great start,\" he said. \"I know when I get off to a great start everything comes easier and more comfortable We just played well as a team, we moved the ball and did everything we needed to do to win.\"\n\nUP NEXT\n\nRockets: Houston visits the Jazz on Tuesday.\n\nTrail Blazers: Portland hosts the Pacers and former Blazers coach Nate McMillan on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995785.836292
}