{
  "game_id": "0022100801",
  "espn_id": "401360620",
  "date": "Feb 05, 2022",
  "matchup": "SAC vs. OKC",
  "headline": "Barnes scores 24, Kings hold on to beat Thunder 113-103",
  "body": "SACRAMENTO, Calif. -- — Harrison Barnes had 24 points and nine rebounds, and the Sacramento Kings held on to beat the Oklahoma City Thunder 113-103 on Saturday night.\n\n\r\n              Tyrese Haliburton added 13 points and a career-high 17 assists to help the Kings to their second win in three games following a seven-game losing streak. Moe Harkless also had a double-double for Sacramento with 18 points and 11 rebounds.\n\n\r\n              The Kings led nearly the entire game and trailed for only 30 seconds while stopping the Thunder’s three-game winning streak.\n\n\r\n              “For us, it’s a matter of playing with force,” Barnes said. “Looking at a lot of our losses, teams frankly are just more physical than we are. When we’re physical and we match the physicality or exceed it, we’re able to execute and everything we do is better.”\n\n\r\n              Josh Giddey scored a season-high 24 points and had eight assists for Oklahoma City. Darius Bazley added 18 points and seven rebounds, and Tre Mann scored 16 points.\n\n\r\n              The Thunder have won seven games this season when trailing by 15 or more, including in Portland on Friday night when they rallied from 18 down to win. But they had no such luck in Sacramento.\n\n\r\n              The Kings led by 17, held a 30-23 advantage in assists and scored 19 points off 14 Thunder turnovers.\n\n\r\n              “We approached it the right way, started the game the right way and really played for the 48 minutes,” Kings interim coach Alvin Gentry said. “We desperately need wins, so every win is a really good win for us.”\n\n\r\n              Oklahoma City’s lone lead came early in the third when Giddey sank a 3-pointer to put the Thunder ahead 66-65. The Kings followed with a 10-2 run, then later scored 12 straight after the Thunder tied the game at 77.\n\n\r\n              Thunder coach Mark Daigneault felt his team wore down playing its fourth game in six nights.\n\n\r\n              “Tough pocket of the schedule, a lot of travel,” Daigneault said. “Mentally tonight we could have been a little sharper. We had some costly turnovers and uncharacteristic plays that I would chalk up to mental fatigue maybe.”\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Luguentz Dort was held out with a bruised face after getting hit twice in Friday’s win in Portland. ... Shai Gilgeous-Alexander missed his fourth straight game because of a sprained right ankle.\n\n\r\n              Kings: All five Sacramento starters scored in double figures. ... The Kings made six 3s in the first quarter and had 12 overall. ... Haliburton’s previous career high for assists was 13. ... De’Aaron Fox (left ankle soreness) sat out an eighth consecutive game. ... Marvin Bagley III continues to be hobbled by a left ankle sprain.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host the Warriors on Monday. Golden State has won five straight against Oklahoma City, including twice this season.\n\n\r\n              Kings: Face the Timberwolves in back-to-back games Tuesday and Wednesday at Golden 1 Center. Minnesota beat Sacramento at home in November.\n\n\r\n              ----",
  "source": "espn_api",
  "crawled_at": 1764993897.546008
}