{
  "game_id": "0021900945",
  "espn_id": "401161587",
  "date": "Mar 07, 2020",
  "matchup": "SAC @ POR",
  "headline": "Bogdanovic scores 27, Kings beat Blazers 123-111",
  "body": "PORTLAND, Ore. --  Bogdan Bogdanovic had 27 points and eight assists, Buddy Hield scored 22 off the bench and the Sacramento Kings beat the Portland Trail Blazers 123-111 on Saturday night.\n\nWith both teams chasing Memphis for the final Western Conference playoff spot, the Kings won for the fourth time in five games. De'Aaron Fox added 14 points and 11 assists for Sacramento, while Harrison Barnes finished with 20 points.\n\n\"I was really pleased with the mindset and the focus of the group as a whole,\" Kings coach Luke Walton said. \"We knew they were on a back-to-back, so we wanted to make a point to push and push and push.\"\n\nThe Kings went 21 of 39 on 3-pointers, tying a franchise record for made 3s. Portland was 10 for 39 from behind the arc.\n\n\"It starts with penetration. We had 21 paint touches in the first quarter,\" Walton said. \"That sets the tone for us and allows us to get our shooters inside-out shots. We got in a good rhythm and those were rotation types of 3s.\"\n\nSacramento won in Portland for the first time since Dec. 12, 2012.\n\n\"I thought we played like a team that was coming home,\" Blazers star Damian Lillard said of his team's poor performance. \"It was like we were counting on being on our home floor to kind of go in our direction and they came out aggressive, in attack mode on fire, and jumped out to a big lead. We had a hard time getting back into it.\"\n\nHassan Whiteside led the Blazers with 19 points and 11 rebounds. CJ McCollum also scored 19, but Lillard managed only 12 on 4-of-15 shooting from the field.\n\nThe Kings were 14 for 21 on 3s in the first half, while Portland started 6 for 21.\n\nBogdanovic carved up the Trail Blazers early, racking up seven assists in the first quarter. Hield had 14 points to help the Kings to a 77-54 halftime lead.\n\nPart of what fueled Sacramento was sloppy play from the Blazers as they turned the ball over seven times, helping the Kings score 17 fast-break points in the first half. Bogdanovic hit a 3 to close the half, and Sacramento's 77 points were a season high for any half this season.\n\nLillard made his first basket at the 6:15 mark of the second quarter.\n\nSacramento's Harry Giles caught a knee from Portland's Trevor Ariza in the groin area on the first play of the second half.\n\nWith 8:50 left in the third quarter, McCollum and Alex Len got into a physical altercation and had to be separated with the Kings leading 80-60. After a review, Len was called for an offensive foul for a screen and both players were assessed offsetting technicals. Although both players put their fists up, neither threw a punch and both stayed in the game.\n\nBut the flareup did little to wake the Blazers as the Kings increased their lead to 25 before going into the fourth quarter with a 100-80 advantage.\n\n\"I think that's Alex's second scuffle or what you'd call a fight in today's NBA,\" Walton said. \"You need to play with an edge and the only way to play with an edge is to have guys who have that in their makeup. We've only had him for a short time, but he's definitely made us a tougher, more physical team.\"\n\nSacramento went up by 26 in the fourth, and the Blazers pulled their starters with 5:46 left.\n\nTIP-INS\n\nKings: The teams hadn't played since consummating a trade in January. The Blazers got Ariza, while the Kings received Kent Bazemore, among other things. According to Walton, Bazemore has given Sacramento an energy boost. \"He's a big reason why we are having some late-to-midseason success,\" Walton said.\n\nTrail Blazers: Almost a year since suffering a gruesome left leg injury, center Jusuf Nurkic is targeting a March 15 return. Nurkic was put through a workout prior to Saturday's game. \"Before we get to the first game we will have a plan,\" coach Terry Stotts said.\n\nUP NEXT\n\nKings: Sunday at home vs. Toronto.\n\nTrail Blazers: Tuesday at home vs. Phoenix.\n\n---\n\nMore AP NBA:  https://apnews.com/tag/NBA  and  https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996381.041288
}