{
  "game_id": "0021600715",
  "espn_id": "400900136",
  "date": "Jan 29, 2017",
  "matchup": "ORL @ TOR",
  "headline": "Vucevic helps Magic edge Raptors 114-113 in Toronto",
  "body": "TORONTO --  Two nights after being \"truly embarrassed,\" the Orlando Magic bounced back against the reeling Toronto Raptors.\n\nNikola Vucevic had 25 points and 10 rebounds, D.J. Augustin added 21 points off the bench and the Magic won for just the second time in eight games, beating the Raptors 114-113 on Sunday.\n\nThe Magic (19-30) lost 128-98 in Boston on Friday night.\n\n\"We got truly embarrassed and we had to redeem ourselves by coming out tonight and just playing hard,\" said Jeff Green, who had 16 points. \"That's what we did.\n\n\"We've had some good wins and some bad losses,\" Green said. \"As long as we keep improving. We still have a chance to make the playoffs believe it or not, no matter how bad we've been.\"\n\nKyle Lowry had 33 points, eight assists and five rebounds. Fellow All-Star DeMar DeRozan, Toronto's leading scorer, returned to the lineup after missing three games with a sprained right ankle and had 22 points, seven rebounds and six assists.\n\nIt was Toronto's sixth loss in the past seven games. The Raptors are 29-19 on the season.\n\n\"It's very challenging,\" Lowry said. \"As a professional and as a leader, I'm going to keep my head up and keep going out there and working it.\n\n\"This is a small thing that we can get through. We have to continue to get better.\"\n\nVucevic, who also had five assists, keyed a surge that saw the Magic (19-30) close the first half on a 21-2 run to take the lead for good in snapping a three-game skid.\n\n\"We weren't happy with the way we played in Boston,\" Vucevic said. \"That was unacceptable and very disappointing.\n\n\"Guys wanted have a better effort and we really did that.\"\n\nThe Magic were 11 for 17 (65 percent) in the second quarter, including 4 of 6 on 3s. The Raptors didn't make a field goal over the final 6:52 of the first half and were just 5 for 16 in the second quarter.\n\n\"It is as bad as we have played all year,\" Toronto coach Dwane Casey said of his team's final seven minutes of the first half. \"It's everybody, the second team comes in and they're making mistakes.\"\n\nIt was just Orlando's second win in the past 16 games against the Raptors. The Magic had dropped seven straight games in Toronto.\n\n\"We had a great second quarter, guys made shots tonight,\" Magic coach Frank Vogel said. \"They moved the basketball, got pretty good looks and played with offensive confidence.\"\n\nOrlando led 100-85 with little more than 6 minutes remaining. Toronto then went on a 16-5 run over the next four-plus minutes to make it close. DeRozan's jumper cut the Magic lead to 105-101 with 2:20 to go, but Green scored the next five points, including a 3, to give Orlando some breathing room.\n\nJonas Valanciunas hit a foul shot with 6:20 to go in the half to give the Raptors a 49-39 edge. Orlando then scored 19 straight points with Vucevic leading the surge, hitting 3 for 3 from the field, including a pair from beyond the arc.\n\nTIP-INS\n\nMagic: Former Raptor Bismack Biyombo, a fan favorite when he played in Toronto last season, received a loud ovation when he checked into the game late in the first quarter. ... Orlando scored 14 points off 10 Toronto turnovers in the first half.\n\nRaptors: DeRozan's two free throws were the only points Toronto scored in the final 6:20 of the second quarter, missing eight straight field goal attempts. ... Lowry has scored at least 24 points six of the past seven games. ... Toronto is 17-15 when allowing 100 or more points.\n\nHOT SHOTS\n\nThe Magic are 7-1 this season when shooting better than 50 percent from the field.\n\nSLIDING\n\nWith a 7-9 record in January and just one game remaining, the Raptors will finish a month with a record below .500 for the first time since March 2015.\n\nDEFENSIVE WOES\n\nThe Raptors, who beat Milwaukee 102-86 on Friday, have not held an opponent to less than 100 points in consecutive games since Dec. 23-26, a stretch of 18 games.\n\nUP NEXT:\n\nMagic: Orlando wraps up a three-game road trip Monday night in Minnesota. The Timberwolves won the first meeting of the season 123-107 in Orlando on Nov. 9.\n\nRaptors: Toronto closes out a three-game homestand on Tuesday against New Orleans. The Raptors have defeated the Pelicans in 10 of the past 13 meetings.",
  "source": "espn_api",
  "crawled_at": 1764995843.4058619
}