{
  "game_id": "401809943",
  "espn_id": "401809943",
  "date": "Oct 24, 2025",
  "matchup": "ORL vs ATL",
  "headline": "Trae Young scores 6 points in final 46 seconds to lead Hawks past Magic",
  "body": "ORLANDO, Fla. -- — Trae Young scored six of his 25 points in the final 46 seconds, leading the Atlanta Hawks to a 111-107 win over the Orlando Magic on Friday night.\n\n\r\n              Franz Wagner scored a game-high 27 points for Orlando, which led by 12 early in the fourth quarter but shot only 7 for 21 in the final period.\n\n\r\n              Nikeil Alexander-Walker had 19 points for Atlanta and Onyeka Okongwu added 17. Jalen Johnson had 12 points and eight rebounds for the Hawks.\n\n\r\n              Desmond Bane and Tristan daSilva scored 15 points each for Orlando. Paolo Banchero had 11 points and six rebounds, but shot only 4 for 15 and missed all five of his 3-point attempts.\n\n\r\n              The Hawks played without forward Zaccharie Risacher, who injured his ankle in Tuesday night’s opener, and center Kristaps Porzingis, who was ill.\n\n\r\n              Young scored the final five points of a 15-0 Hawks run midway through the fourth quarter that wiped out Orlando’s 93-81 lead.\n\n\r\n              Atlanta led by as many as five with less than three minutes left, but Wendell Carter Jr.'s two free throws tied it at 105 with 54 seconds left.\n\n\r\n               Jalen Suggs' layup tied it again after Young scored the Hawks’ final field goal. Four free throws by Young completed the scoring in the final 21 seconds.\n\n\r\n              The Hawks made only two of their first 20 3-point shots and finished 8 for 29 (27.6%). The Magic missed all seven of their 3-point shots in the final quarter and made 9 of 32 (28.1%) overall.\n\n\r\n              Up next\r\n              Hawks: At home against Oklahoma City on Saturday night.\n\n\r\n              Magic: At home against Chicago on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042489.307001
}