{
  "game_id": "0021800519",
  "espn_id": "401071195",
  "date": "Dec 28, 2018",
  "matchup": "TOR @ ORL",
  "headline": "Vucevic has 30 points, 20 boards; Magic routs Raptors 116-87",
  "body": "ORLANDO, Fla. --  The Orlando Magic have had a forgettable December -- until Friday night.\n\nNikola Vucevic had 30 points and 20 rebounds and the Magic snapped a four-game losing streak with a 116-87 rout of the Toronto Raptors.\n\nD.J. Augustin had 17 points and six assists for Orlando, which had five players in double figures and a 60-41 rebounding advantage.\n\nVucevic became the third player this decade, fifth this century and ninth in the last 44 years to post at least 30 points, 20 rebounds and eight assists in a game, the Magic said. Charles Barkley (three times), DeMarcus Cousins (twice), Kareem Abdul-Jabbar, George McGinnis, David Lee, Tim Duncan, Dirk Nowitzki and Alex English are the other players to accomplish the feat since 1974.\n\n\"I think guys understood that it was time for us to turn things around,\" Vucevic said.  \"Tonight everything clicked for us on both ends, but defense is probably the main reason we won.\"\n\nAfter making eight of their first 12 shots, including a couple of 3-pointers by Fred VanVleet, the Raptors took a 19-9 lead. But Toronto made just 11 of its next 51 shots until Kawhi Leonard dunked late in the third quarter with Orlando leading 91-60.\n\n\"This is a big boy's league and these nights happen, it's nothing new,\" VanVleet said. \"We are not the first team to lose like this.\"\n\nThe Magic, who had lost five straight to Toronto, outscored the Raptors 51-16 over a 16-minute span of the middle periods and led by as many as 31 points late in the third quarter.\n\nLeonard scored 21 points for the Raptors, who shot 29.5 percent in the final game of a three-game trip. Serge Ibaka added 17 points and eight rebounds.\n\nThe Raptors (26-11) came into the game with the best record in the Eastern Conference, but fell percentage points behind Milwaukee with the loss.\n\n\"It's the reality of this league -- every team in our league will have a win like that,\" Orlando coach Steve Clifford said. \"We were good tonight. I thought we were more physical. I thought Vucevic was terrific and Aaron Gordon was lights-out. He only took six shots.\"\n\nGordon got most of the credit for holding Leonard to 11 points after the first 10 minutes. Leonard had averaged 30.1 points in the 10 preceding games.\n\n\"We were all tied together on defense, all in the right spots, and we executed the game plan. That was probably the best we've done it all year,\" said Gordon, who had nine points and nine rebounds.\n\nVucevic scored 12 points during a 21-6 run late in the first half that turned the game around.\n\nD.J. Augustin scored six straight points to stretch Orlando's lead to 17 with 8:15 left in the third quarter, and the Raptors never threatened after that.\n\n\"We never really could get stops,\" Toronto coach Nick Nurse said. \"We couldn't finish at the rim very well. It was really a poor night for all of us. We were trying to shut the water off and we couldn't.\"\n\nTIP-INS\n\nRaptors: G Kyle Lowry sat out a second straight game with lower back pain. Lowry has played only once since Dec. 12. ... The Raptors entered the game with the NBA's best record and as the only team in the top 10 in scoring offense and defense.\n\nMagic: Jonathon Simmons played 20 minutes as the backup point guard. ... The Magic won in their home arena for the first time since mid-November. They won two \"home\" games in Mexico City in mid-December, but lost all six in Orlando since beating the New York Knicks on Nov. 18. ... The 29.5 opposing field goal percentage is the fifth-lowest ever against the Magic.\n\nUP NEXT\n\nRaptors: At home against Chicago on Sunday night.\n\nMagic: At home against Detroit on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994116.4725919
}