{
  "game_id": "0022300249",
  "espn_id": "401584877",
  "date": "Nov 26, 2023",
  "matchup": "MEM vs. MIN",
  "headline": "Anthony Edwards scores 24 points, Timberwolves rout Grizzlies 119-97",
  "body": "MEMPHIS, Tenn. -- — Anthony Edwards scored 24 points, Karl-Anthony Towns and Mike Conley each had 18 and the Minnesota Timberwolves routed the Memphis Grizzlies 119-97 on Sunday.\n\n\r\n              Rudy Gobert added 13 points to help the Timberwolves win for the fourth time in five games. Conley added a season-high 10 assists and was 6 of 9 from 3-point range.\n\n\r\n              Timberwolves coach Chris Finch said part of the game plan was to get Conley more involved. In recent games, the point guard has not gotten as many touches in the flow of the offense. \n\n\r\n              “I could tell from the beginning of the game — the first couple of plays — he designed for me specifically,” Conley said, “I think we're a better team when I'm able to be more aggressive.”\n\n\r\n              Edwards was questionable for the game after waking up Sunday morning with back spasms. He went through his pregame routine before Minnesota declared him available. Finch said as things trended during the day, it looked like Edwards would not play, which concerned Finch.\n\n\r\n              “Ant is a fierce competitor,” Finch said. “He's a gamer. He loves to play He's not somebody who is ever looking for a reason not to play. I was very pleased and proud of him for battling through.” \n\n\r\n              Jaren Jackson Jr. led Memphis with 18 points, while Santi Aldama finished with 14. Desmond Bane scored 13 points, but was 5 of 16 from the field as Memphis lost its fourth straight dropped to 0-8 at home.\n\n\r\n              The Timberwolves sit atop the Western Conference standings, while Memphis is struggling to stay out of the conference cellar, trying to maintain any competitiveness as it deals with injuries and the 25-game suspension of Ja Morant. \n\n\r\n              In the last two games, Bane has converted only eight of his 28 shots from the field and is 3 of 14 from 3-point range. Defenses are blitzing Bane to prevent him from clear 3-point shots and doubling on Jackson as the two biggest offensive threats for Memphis. \n\n\r\n              “It's a sign of respect the way teams defend Jaren and defend me,” Bane said. “These are plays that I probably wouldn't be getting as much if (Morant) was on the floor because he usually takes the bulk of the attention from defenses.”\n\n\r\n              The Timberwolves were dominant in the first half as Minnesota was still shooting 60% from the field overall and 6 of 10 from outside the arc midway through the second quarter. With Memphis shooting under 40%, including 2 of 19 from 3-point range, the Timberwolves' lead reached 20 before they carried a 60-43 lead into the break. \n\n\r\n              Minnesota continued to maintain the margin in the third quarter, eventually stretching it to 90-66 after three quarters. And that came with Towns and Gobert playing limited minutes in the period with foul troubles.\n\n\r\n              Memphis cut it to 102-90 midway through the fourth, but the Timberwolves rattled off eight straight points, including 3-pointers from Conley and Nickeil Alexander-Walker to end any hopes of a Memphis comeback.\n\n\r\n              As the Timberwolves built their lead, Marcus Smart, who is out with a left foot sprain, could be seen on the Memphis bench in an animated pep talk with his teammates, apparently saying their body language was bad, and they were not showing the professionalism of a pro player. \n\n\r\n              “I don't think (it has to be) different,” Bane said about any changes. “Just better. Coach (Taylor Jenkins) has the recipe. We just have to stick to it.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host Oklahoma City on Tuesday night in the NBA In-season Tournament.\n\n\r\n              Grizzlies: Host Utah on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996041.603195
}