{
  "game_id": "0022000275",
  "espn_id": "401267435",
  "date": "Jan 27, 2021",
  "matchup": "MIA vs. DEN",
  "headline": "Nuggets run away from short-handed Heat, 109-82",
  "body": "MIAMI -- — The Denver Nuggets might not want this road trip to end.\n\n\r\n                    The Miami Heat cannot get Jimmy Butler back quickly enough.\n\n\r\n                    Nikola Jokic had 21 points and 11 rebounds and the Nuggets won their fifth straight, building a 25-point halftime lead and beating the Heat 109-82 on Wednesday night.\n\n\r\n                    Michael Porter Jr. scored 17 points, JaMychal Green added 15 and Jamal Murray had 14 for Denver, which improved to 4-0 on its five-game road trip — the first four-win trip for the Nuggets since December 2013. A win Friday in San Antonio would give Denver its first 5-0 trip since January 2012, and the Nuggets have won 10 of 13 since since a 1-4 start.\n\n\r\n                    “When we were 1-4, there was no panic,\" Murray said. “It's five games in. ... Turned things around pretty quick.\"\n\n\r\n                    Butler watched from the Miami bench, significant since Wednesday’s game was the first in more than two weeks where he could be with his team. He's now missed the last nine Heat games because of virus-related protocols.\n\n\r\n                    The Heat are 2-7 in this stretch without him and have dropped four straight. Herro (neck spasms) missed a seventh consecutive game, Dragic was out with a groin strain, and Kendrick Nunn led Miami with 17 points.\n\n\r\n                    The Heat got Avery Bradley back for the first time in nine games; he, like Butler, was out in accordance with the NBA’s virus protocols.\n\n\r\n                    “It was great to see the guys, everybody, even though everybody wasn’t available,” Heat coach Erik Spoelstra said.\n\n\r\n                    Bradley had eight points in 18 minutes.\n\n\r\n                    “Even though we came up short tonight, felt great to be back out there,” Bradley said.\n\n\r\n                    Denver led 58-33 at the half, the Nuggets’ biggest halftime lead this season and biggest in a road arena since holding a 31-point lead at the break in Chicago on March 21, 2018. The Heat missed 15 3-pointers in the first quarter — an NBA record for an opening period, and a team record for any quarter.\n\n\r\n                    Denver’s lead was down to seven early in the fourth, but back-to-back 3s by Porter and Green got the Nuggets’ edge back to 13 and another 3 by Jokic made it 94-74 with 5:35 left.\n\n\r\n                    “That team was missing Jimmy Butler, Goran Dragic, Tyler Herro, a lot of their top players,” Denver coach Michael Malone said. “I don’t know if we’re as good as we played tonight and I know they’re a hell of a lot better than they played.”\n\n\r\n                    Bam Adebayo scored 15 for Miami.\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Guard P.J. Dozier (right hamstring strain) missed the game and the Nuggets are bracing for it to be a multi-game absence. ... The 33 points allowed by Denver in the first half was not only a season best, but it was nearly 24 points below the Nuggets’ average through the first 17 games.\n\n\r\n                    Heat: Wednesday was the start of a six-game homestand for Miami. After that, the Heat play eight of their next nine on the road. ... Duncan Robinson’s first 3-pointer was the 400th of his career, including playoffs. He’s the 12th Heat player to make that many.\n\n\r\n                    TRIBUTES\n\n\r\n                    The Heat held a pregame moment of silence to commemorate Tuesday being the one-year anniversary of Kobe Bryant’s death and last week’s death of Baseball Hall of Famer Hank Aaron. And in his pregame remarks, Malone paid tribute to longtime NBA journalist Sekou Smith, who died Tuesday after a short battle with COVID-19. “I’m devastated for his family,” Malone said.\n\n\r\n                    DOG TIME\n\n\r\n                    \r\n                      Miami is welcoming back a small number of fans Thursday, with coronavirus-detection dogs being utilized to screen guests before entering the arena.\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Visit San Antonio on Friday night.\n\n\r\n                    Heat: Host the Los Angeles Clippers on Thursday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997820.7671418
}