{
  "game_id": "0021800257",
  "espn_id": "401070938",
  "date": "Nov 21, 2018",
  "matchup": "CHI vs. PHX",
  "headline": "Parker shines as Bulls beat Suns 124-116",
  "body": "CHICAGO --  Jabari Parker and the Chicago Bulls pushed the ball whenever they had the chance. They stayed focused when the Phoenix Suns made a big play.\n\nA couple of solid practices really paid off.\n\nParker had 20 points, 13 rebounds and eight assists, and the Bulls beat the Suns 124-116 on Wednesday night to stop a four-game slide.\n\nChicago shot a season-high 56.8 percent from the field and placed six players in double figures in just its third win in its last 12 games. Following an ugly 122-83 home loss to Toronto on Saturday night, Bulls coach Fred Hoiberg worked on pushing the pace in practice, and his team responded with one of its best offensive performances.\n\n\"I thought our outlet passes were crisp,\" Hoiberg said. \"I thought they were up the floor, and I thought our guys did a good job of getting down quickly. We didn't hang our heads. We had a couple answer-back plays after they scored where we scored on the other end, and those are important. Those are big plays. We need all those points.\"\n\nGetting Zach LaVine back helped. LaVine scored 29 points after missing the Raptors loss with an illness, and Ryan Arcidiacono, Wendell Carter Jr. and Antonio Blakeney each had 14 points for Chicago.\n\nPhoenix lost for the seventh time in its last eight games. Devin Booker scored 23 points, T.J. Warren had 21 and Deandre Ayton added 18 points and 12 rebounds.\n\n\"We had no force, no energy, no effort,\" Suns coach Igor Kokoskov said. \"They wanted this win more, and they got it.\"\n\nParker was 6 for 10 from the field in perhaps his best game since signing with his hometown team in the offseason. He also had two steals.\n\n\"Winning always solves everything,\" Parker said. \"I just want to do what I can to win and hopefully that kind of snowballs.\"\n\nJamal Crawford's pullup jumper for the Suns tied it at 97 with 10:54 left, but the Bulls responded with a 10-0 run. Parker had a driving dunk before Blakeney capped the decisive sequence with a jumper with 7:27 remaining.\n\nPhoenix pulled within three on Warren's 3-pointer with 1:27 to go, but Arcidiacono found Carter for a layup and LaVine made two foul shots to help close it out.\n\n\"They really got their confidence, got in their rhythm, got their flow and got easy baskets,\" Crawford said. \"Whenever you give a team, especially at home, easy baskets, it settles them in and gives them their confidence.\"\n\nOOPS\n\nThe Suns led by as many as nine in the third quarter, and Kokoskov felt his team relaxed at that point.\n\n\"We thought the game was over, and that's what happens with an inexperienced team,\" he said. \"They knew there was the rest of the game, and they never quit. That early lead gave us a lackadaisical mindset thinking we can go through this game scoring every time we want. We forgot to play defense.\"\n\nLOOK OUT\n\nArcidiacono gave Chicago a spark when he jumped over Phoenix's bench while trying to save a ball from going out of bounds in the first quarter. He landed on a couple of fans in the front row, causing a man to lose some of his beer, but everyone was OK.\n\nTIP-INS\n\nSuns: Crawford had a season-high 16 points against his first NBA team. ... It was Ayton's 10th double-double of his rookie season. ... Phoenix shot 49 percent from the field.\n\nBulls: Justin Holiday made three of the Bulls' 11 3-pointers and finished with 11 points. ... Chicago improved to 1-6 against Western Conference teams. ... Rookie F Chandler Hutchison was held out after he developed back spasms during the morning shootaround. ... F Lauri Markkanen (right elbow sprain) had \"his best conditioning workout\" on Wednesday, Hoiberg said. Markkanen and G Kris Dunn (left MCL sprain) participated in a pick-and-roll drill in practice. \"We did have our guys out there. It wasn't a contact drill,\" Hoiberg said, \"but just to try to get them integrated into a 5-on-5 setting.\"\n\nUP NEXT\n\nSuns: Try to stop a six-game slide against Milwaukee when they visit the Bucks on Friday night.\n\nBulls: Host the Miami Heat on Friday night in the first of three meetings between the teams this season.\n\n---\n\nJay Cohen can be reached at https://twitter.com/jcohenap\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994843.804906
}