{
  "game_id": "401810083",
  "espn_id": "401810083",
  "date": "Nov 15, 2025",
  "matchup": "CLE vs MEM",
  "headline": "Donovan Mitchell scores 30 as Cavaliers rally for 108-100 win over Grizzlies",
  "body": "CLEVELAND -- — Donovan Mitchell scored 30 points, including 14 in the fourth quarter over four minutes, to rally the Cleveland Cavaliers to a 108-100 victory over the Memphis Grizzlies on Saturday.\n\n\r\n              Evan Mobley had 22 points and 13 rebounds for Cleveland, which used a 17-2 run to seize a 103-92 lead with 3:36 remaining. The Cavaliers outscored Memphis 32-16 in the fourth after trailing by double digits for much of the middle periods.\n\n\r\n              Jaren Jackson Jr. scored 26 points and tied his career high with 12 free throws made, but shot just 6 of 23 from the field for the Grizzlies. Zach Edey had 13 points and seven rebounds in his season debut following left ankle surgery on June 7.\n\n\r\n              Memphis point guard Ja Morant scored seven points in six minutes before exiting with right calf soreness. He missed the previous game Wednesday in Boston with a sore right ankle.\n\n\r\n              Jarrett Allen chipped in 16 points and Sam Merrill had 13 points for Cleveland, which is 1-1 on a six-game homestand. Santi Aldama had 12 points and 11 rebounds off the bench for the Grizzlies.\n\n\r\n              Jackson scored 17 points and made 10 of 11 free throws in the first half as Memphis built an 11-point lead, carrying a 61-54 advantage into the break. Aldama had 10 points and eight rebounds, while Mobley scored 11 to pace Cleveland.\n\n\r\n              Point guard Darius Garland (left great toe) and swingman Jaylon Tyson (concussion) both missed their second straight games for the Cavaliers after being hurt Nov. 10 at Miami.\n\n\r\n              Garland, a two-time All-Star, has only appeared in three contests following offseason surgery on the same toe. Team officials have not established a timetable for his return.\n\n\r\n              Up next\r\n              Grizzlies: Visit San Antonio on Tuesday.\n\n\r\n              Cavaliers: Host Milwaukee on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042629.561787
}