{
  "game_id": "0022300712",
  "espn_id": "401585340",
  "date": "Feb 04, 2024",
  "matchup": "POR @ DEN",
  "headline": "Jokic and Murray lead Denver's comeback as Nuggets beat Blazers 112-103 for weekend sweep of rivals",
  "body": "DENVER -- — Jamal Murray loves that the Denver Nuggets can turn to their championship mettle in crunch time. He hates that they have to rely on that so often.\n\n\r\n              “I think we should just be a little bit more on point to start the game, not to have to kick it into another gear,” Murray said after the Denver Nuggets rallied from a double-digit deficit to beat the short-handed but spirited Portland Trail Blazers 112-103 on Sunday night.\n\n\r\n              The reigning NBA titleholders trailed by 14 in the first half and didn't take their first lead until their final shot of the third quarter.\n\n\r\n              “I think we just got to be a little more conscious, a little more aware of the task at hand each and every night that we’re gonna get their best shot,” Murray said. “I think we can give our best shot, as well, from the start.”\n\n\r\n              Nikola Jokic led Denver with 29 points, Murray added 21 points on a 10-to-1 assist-to-turnover night and youngsters Christian Braun and Peyton Watson provided the juice down the stretch for the Nuggets to get their second win over their division rivals in 48 hours.\n\n\r\n              Four other players scored in double figures, including Watson, a rookie who scored 10 of his 12 points in the Nuggets’ fourth-quarter blitz that improved Denver's home record to 21-4.\n\n\r\n              The Nuggets didn't trail by more than a bucket in their 120-108 win over Portland on Friday night, also at Ball Arena, but they didn't lead this one until the final seconds of the third quarter when Jokic's finger-roll layup broke an 84-84 tie.\n\n\r\n              The Blazers, who got got 27 points from Deandre Ayton and 26 from Anfernee Simons, quieted the sellout crowd most of the night. They were leading 84-75 with 4:17 remaining in the third quarter when Matisse Thybulle missed his second of two free throws.\n\n\r\n              The next time they scored came on Kris Murray's goaltended bucket with 10:44 remaining to cut Denver's lead to 91-86. During that stretch, the Blazers missed nine shots, including six from long range, and turned the ball over three times while the Nuggets were using that 16-0 run to pull away.\n\n\r\n              “Our defense got better as the game went along,” Nuggets coach Michael Malone said. “We had zero defense. We had a little bit of defense. We got a lot more defense. And we had great defense.”\n\n\r\n              The Blazers certainly weren't hanging their heads after faltering late.\n\n\r\n              “I thought we played well for the majority of the game, all the game, to be honest with you,\" Simons said. “They’re a good team. They made runs. They’re a championship team. They’re a veteran team. We rolled out with a lot of young guys and sometimes that’s just what happens. \n\n\r\n              \"So, I’m just glad that we stuck with it and continued to play hard. Overall, I’m pretty happy about how we played today.”\n\n\r\n              The Blazers had just one 3-pointer in 13 tries in the second half after knocking down 10 before halftime.\n\n\r\n              Murray and Thybulle got starting nods with Jerami Grant missing his second straight game with lower back tightness and Malcolm Brogdon still sidelined with a sore knee. \n\n\r\n              Reserve Scott Henderson, who turned 20 on Saturday, one day after scoring 30 points against the Nuggets, finished with 14 in the rematch. Over the weekend, Portland coach Chauncey Billups texted him a sort of congratulations.\n\n\r\n              “I said, ‘Scoot, there aren’t many guys in the entire world that can say they scored 30 points on the world champions as a teenager,\" Billups recounted. “But you're not a teenager anymore. Let's see what you're going to do in your 20s.”\n\n\r\n              UP NEXT\n\n\r\n              Blazers: Host the Detroit Pistons on Thursday night.\n\n\r\n              Nuggets: Visit the Los Angeles Lakers on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996573.1821141
}