{
  "game_id": "0022301131",
  "espn_id": "401585759",
  "date": "Apr 07, 2024",
  "matchup": "HOU @ DAL",
  "headline": "Irving scores 48, Exum forces OT with buzzer-beating 3 as Mavs rally past Rockets 147-136",
  "body": "DALLAS -- — Kyrie Irving scored a season-high 48 points, Dante Exum forced overtime with a buzzer-beating 3-pointer and the Dallas Mavericks rallied from 22 points down for a 147-136 victory over the Houston Rockets on Sunday.\n\n\r\n              Luka Doncic had 37 points, 12 assists and nine rebounds as the Mavericks took another step toward the fifth seed in the Western Conference playoffs.\n\n\r\n              Dillon Brooks scored a season-high 29 points, and Fred VanVleet had 24 points and 12 assists for the Rockets, who were eliminated from postseason contention after not trailing until the final three minutes of regulation. \n\n\r\n              It was a fifth consecutive loss for Houston following an 11-game winning streak that is tied for the longest in the NBA this season. \n\n\r\n              With Houston leading by three with 8.3 seconds to go in regulation, Jabari Smith Jr. missed two free throws. Dallas was out of timeouts, and Exum scrambled up the court and passed to Doncic. The Dallas superstar dribbled toward midcourt and faked a shot before passing to Exum, whose 3 over Smith beat the buzzer.\n\n\r\n              “I just went and grabbed it and tried to get the ball to Luka,” said Exum, who took the ball after P.J. Washington's rebound. “Luka is obviously great knowing that two guys are going to double him and trusting his teammates.”\n\n\r\n              Irving, who scored 25 points in the fourth quarter and overtime, put Dallas ahead for good in the extra period at 133-131 with two free throws.\n\n\r\n              Washington, who had 14 points and 13 rebounds, finished off the Rockets with consecutive corner 3s for a nine-point lead with 33 seconds to go. Exum had 14 points and nine rebounds.\n\n\r\n              The Mavericks have won 14 of 16 to take the inside track to a guaranteed spot in the West playoffs, and Dallas is 22-7 in the 29 consecutive games Irving has played since returning from a thumb injury.\n\n\r\n              “I’m depleted. Energetic, but I’m depleted,” said Irving, who was 15 of 25 from the field. “We kept battling and kept doing the little things and trusting one another.”\n\n\r\n              Houston, already missing Alperen Sengun because of an ankle injury, played most of the game without Amen Thompson. The rookie starter was ejected in the first quarter when he shoved Maxi Kleber in the neck with a forearm and was given a flagrant 2 foul.\n\n\r\n              Brooks hit two go-ahead 3-pointers in the fourth quarter and was 5 of 6 from deep.\n\n\r\n              “They fought back into it, and we kind of dug ourselves back out to take that late lead,” Rockets coach Ime Udoka said. “I felt like we outplayed them for the majority of the game, and Dillon was a big part of that.”\n\n\r\n              Irving — who had a season-high 15 free throws on 17 attempts, which tied his career high — gave the Mavs their first lead on two free throws with 3:01 left in the fourth.\n\n\r\n              The lead changed hands five more times in the next two minutes, with the Rockets going ahead at 128-126 on former Maverick Reggie Bullock Jr.’s 3-pointer with 58 seconds remaining.\n\n\r\n              Kleber and Irving each missed a 3 in the final 38 seconds, but the Rockets kept Dallas alive by missing three of four free throws.\n\n\r\n              Jalen Green had 21 points and eight assists but was just 6 of 15 from the field for the Rockets, who led 24-5 in the first quarter, by 22 points in the second and by 10 early in the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: The home finale is Tuesday against Orlando.\n\n\r\n              Mavericks: At Charlotte on Tuesday to start a road back-to-back.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995562.524946
}