{
  "game_id": "0022200918",
  "espn_id": "401469073",
  "date": "Feb 26, 2023",
  "matchup": "DEN vs. LAC",
  "headline": "George's heave just late, Jokic and Nuggets top Clips in OT",
  "body": "DENVER -- — Nikola Jokic had 40 points, 17 rebounds and 10 assists to lead the Denver Nuggets to a 134-124 overtime victory against the Los Angeles Clippers in a matchup of Western Conference contenders Sunday night.\n\n\r\n              Paul George nearly won it for the Clippers with an incredible shot at the end of regulation, but his long heave from just in front of the 3-point line in the backcourt came just after the buzzer.\n\n\r\n              It was the 23rd triple-double of the season for Jokic and his 14th in the past 19 games. Denver is undefeated this season when he has a triple-double.\n\n\r\n              “If you’re looking for a super athlete to win MVP, he’s not your candidate,” Nuggets coach Michael Malone said. “If you’re looking for a great player that impacts winning in every possible way, whose team is first place in the Western Conference, then he’s your man. Frankly, I don’t give a damn what people think. I know he’s the MVP and his teammates know that and all the fans here in Denver and back home in Serbia know that.”\n\n\r\n              Michael Porter Jr. had 29 points and 11 rebounds for the Nuggets. Jamal Murray added 21 points and 12 assists.\n\n\r\n              Kawhi Leonard had 33 points to pace the Clippers — two nights after scoring a season-high 44 in a double-overtime loss against Sacramento. George finished with 23 points.\n\n\r\n              One night after scoring a season-low 94 points in an 18-point loss at Memphis, the Nuggets shot 51% overall — including 63.2% on 2-pointers. \n\n\r\n              “When we get embarrassed, I think we do a really good job of showing up the next game,” Malone said. “One thing we’re always talking about is good teams don’t lose two games in a row. That’s something you strive for. Tonight, we were able to pull it out.”\n\n\r\n              Denver is 4-0 this season against the Clippers, with each victory coming by at least 10 points.\n\n\r\n              Denver led by 18 in the first quarter and had a nine-point advantage entering the fourth, but George's three-point play gave the Clippers their first lead, 109-107, with 4:17 remaining. \n\n\r\n              With his team trailing 118-117, Porter drained a 3-pointer with 26.6 seconds left, but George sank two free throws on the ensuing possession and the game went to overtime tied at 120.\n\n\r\n              “I think we’re right there,” George said. “We’re right where we want to be. We’ve just got to continue to keep working. These late-game losses, we’ll turn these around and we’ll figure out how to win these tough ones.”\n\n\r\n              HOMECOMING FOR HYLAND\n\n\r\n              Bones Hyland, a Nuggets first-round draft pick in 2021, played in Denver for the first time since being traded to the Clippers on Feb. 9. He was booed for much of the night and finished with 10 points in 15 minutes.\n\n\r\n              “Just with how things were playing out, I probably knew a little bit,” Hyland said when asked if he was surprised to be traded. “I’ve got so much love for Denver. I thank them for taking a chance on a kid like me.”\n\n\r\n              Hyland averaged 10.9 points in 111 career games with Denver, the fewest played by a Nuggets first-round selection between 2006-21.\n\n\r\n              “Just because you got to play a lot last year because guys were injured doesn’t necessarily mean that there’s going to be a role for you to play a lot this year,” Nuggets general manager Calvin Booth said. “I think that was always going to be a point of friction for him and for the club.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Will host Minnesota on Tuesday.\n\n\r\n              Nuggets: Play at Houston on Tuesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994687.708574
}