{
  "game_id": "0022000451",
  "espn_id": "401267611",
  "date": "Feb 19, 2021",
  "matchup": "ATL @ BOS",
  "headline": "Kemba Walker scores 28 in return, Celtics down Hawks 121-109",
  "body": "BOSTON -- — Following back-to-back losses to two of the Eastern Conference’s worst teams last week, Kemba Walker offered a simple prescription for what the Celtics needed to do: Play better. \n\n\r\n                    They hope their 121-109 victory over the inconsistent Atlanta Hawks on Friday night is a start. \n\n\r\n                    Walker scored a season-high 28 points  to help Boston take the second of back-to-back meetings between the teams. \n\n\r\n                    “It was a great win for us. I thought we played well,\" Walker said. \"We moved the basketball. Defensively we were in the right spots.. ... Hopefully we can really just build off this.” \n\n\r\n                    Jayson Tatum added 25 points and eight rebounds. Jaylen Brown and Tristan Thompson each finished with 17 points to avenge the loss in the first meeting between the teams on Wednesday. \n\n\r\n                    The Celtics have won two of three since equaling a season-worst stretch in which they dropped five out of seven. \n\n\r\n                    Trae Young led the Hawks with 31 points. Atlanta has lost five of six. \n\n\r\n                    Boston led by as many as 27 in the third quarter before that margin was trimmed to 108-99 with 4:50 left in the game. But the Celtics got 10 points the rest of the way from Daniel Theis to close it out. \n\n\r\n                    Walker sat out Wednesday’s loss as part of an ongoing effort to manage the load on his left knee. He was joined on the sideline by Theis, who missed his second straight game with a sprained right index finger. \n\n\r\n                    Both were back in the starting lineup for Friday’s rematch and made their presence felt early. \n\n\r\n                    Theis blocked John Collins' dunk attempt on Atlanta’s second possession. Later, Walker got loose for a fast-break layup, absorbed a foul and completed a three-point play. \n\n\r\n                    It helped set the tone for an active opening quarter in which Walker led all scorers with eight points on his way to 20 in the first half. \n\n\r\n                    “Kemba’s been really good,\" Celtics coach Brad Stevens said. \"We’ve struggled through this stretch and there’s been a lot of angst and a lot of talk. But in three of the four games he’s played in we’ve won. And in all of them he’s played well.” \n\n\r\n                    The Celtics increased their lead in the second quarter, going 13 of 22 from the field and using a 20-5 run to take a 62-37 lead late in the half. Walker reeled off nine straight points during the run. \n\n\r\n                    The Hawks, who got 40 points from Young and shot a season-high 57% in Wednesday’s win, struggled to keep up with Boston’s pace. Atlanta shot just 14 for 43 (33%) in the opening 24 minutes, including 3 of 15 from the 3-point line. It was only able to stay close by going 10 for 10 from the free-throw line.\n\n\r\n                    Associate head coach Nate McMillan said he didn’t think his team responded well to Boston going to a lineup that used Theis and Robert Williams to protect the rim, making Atlanta play more on the perimeter. \n\n\r\n                    “They did pretty much what we did to them in the first game, attack the paint,” McMillan said. \"We never established we could keep this team in front of us.” \n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Shot 10 of 30 from beyond the arc. … Coach Lloyd Pierce missed his second straight game. His wife gave birth to their second child on Wednesday.\n\n\r\n                    Celtics: Tied a season high, shooting 56% from the field (50 of 90). ...Won despite committing 19 turnovers. … Scored 23 points off 14 Atlanta turnovers. \n\n\r\n                    FOLLOW THE LEADER\n\n\r\n                    Walker is averaging 22.8 points on 49.2% shooting (17 of 31 from 3-point line), 4.5 rebounds, 3.8 assists, and 1.5 steals over his last four games. Boston is 3-1 in those games. \n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Host Denver on Sunday. \n\n\r\n                    Celtics: Open three-game road trip at New Orleans on Sunday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997835.371989
}