{
  "game_id": "0021800643",
  "espn_id": "401071319",
  "date": "Jan 13, 2019",
  "matchup": "POR @ DEN",
  "headline": "Jokic, Murray lead Nuggets past Trail Blazers, 116-113",
  "body": "DENVER --  Nikola Jokic wanted to set an example for his teammates with high-energy, physical play.\n\nHe did that and much more.\n\nJokic scored a season-high 40 points, Jamal Murray fought through a bloody lip to add 24 and the Denver Nuggets beat the Portland Trail Blazers 116-113 on Sunday night.\n\n\"He was really aggressive from the jump,\" Murray said of Jokic. \"Whether it was Nurk (Jusuf Nurkic, Al-Farouq) Aminu, whoever was on him, he was going at them and they had no answer for him. He just kept scoring and took over the load for a while. We need those nights from him. So it was a huge, great night, but that's not going to be his only 40-point performance.\"\n\nJokic, who was serenaded at times with chants of \"MVP!\" from the crowd, said he sensed during pregame warmups that the team was a little flat and he determined he should go out and play aggressively to help set the tone for his teammates.\n\n\"I thought during warmups we were kind of loose and not focused, so I tried to pick up the energy,\" Jokic said.\n\nJokic finished a point off his career high. He added 10 rebounds and eight assists, just missing his sixth triple-double of the season.\n\n\"Jokic is a hell of a player,\" Portland coach Terry Stotts said. \"He is a difficult guy to guard. He scores inside, scores outside and he passes. We didn't do a very good job with him tonight, no matter who was on him.\"\n\nMurray's lip was bloodied when he took an elbow to the mouth from Nurkic on a drive to the basket early in the third quarter. Murray hit both free throws before heading to the locker room. He was back in the game within minutes, and grabbed a rebound off his own missed shot in the final moments, hitting both free throws after he was fouled.\n\n\"It wouldn't stop bleeding, obviously being warm and being in the game,\" Murray said. \"They just put some Vaseline on it but it was a task to stay on it.\"\n\nDenver rebounded from a loss at Phoenix on Saturday night for its 12th home win in a row.\n\nDamian Lillard led Portland with 26 points, and CJ McCollum had 18 points. The Trail Blazers had won four straight.\n\nLillard put in a reverse layup to put the Trail Blazers up by two with 5:48 remaining in the third quarter. But the Nuggets closed the period on a 17-10 run to take a 93-88 lead into the fourth. Jokic had 15 points in the period, including two 3-pointers during the Nuggets' surge and also added an assist on an alley-oop pass that Mason Plumlee finished with a one-handed dunk.\n\nPortland, though, scored the first six points of the fourth, moving in front by a point on Evan Turner's jumper.\n\nIt was tied at 108 when Jokic hit a floater in the lane to put the Nuggets on top with 1:07 left to play. He added a pair of free throws moments later only to see Lillard drive to the basket for a dunk. With 30.6 seconds, Murray hit a jumper, but McCollum connected on 3-pointer to pull Portland within one with 27.7 seconds left.\n\nDenver ran the clock down and Murray let a jumper fly that hit the back of the rim and bounced out. Murray grabbed the rebound, was fouled and made both free throws with 3 seconds left. Portland had just enough time for a long 3-point try by Lillard at the buzzer, but it was off the mark.\n\n\"When I saw how they were trying to line up around the 3-point line, we knew we had to put up a 3,\" Lillard said. \"We didn't have enough time to get a quick two without timeouts. I knew it would be a tough look. I just missed the rim.\"\n\nTIP-INS\n\nTrail Blazers: F Maurice Harkless remains sidelined by a left knee injury.\n\nNuggets: G Gary Harris missed a fourth straight game with left hamstring tightness. ... F Trey Lyles missed his second game in a row with a right wrist sprain. ... Jokic scored a career-best 41 points against Brooklyn on Nov. 7, 2017.\n\nUP NEXT\n\nTrail Blazers: At Sacramento on Monday night.\n\nNuggets: Host Golden State on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995174.607292
}