{
  "game_id": "0022000843",
  "espn_id": "401307639",
  "date": "Apr 15, 2021",
  "matchup": "PHX vs. SAC",
  "headline": "Ayton scores 26, Suns beat Kings for 10th straight home win",
  "body": "PHOENIX -- — Deandre Ayton had 26 points and 11 rebounds, Devin Booker added 23 points and the Phoenix Suns won their 10th straight home game by beating the Sacramento Kings 122-114 on Thursday night.\n\n\r\n                    The Suns haven't lost in their home arena for nearly a month, but struggled to put away the Kings for much of the night, taking a 95-94 lead into the fourth quarter. Sacramento took its first lead of the second half when Delon Wright made a layup to make it 96-95.\n\n\r\n                    The game remained close throughout the fourth, but the Suns slowly pushed ahead and Booker threw a long alley-oop pass to Ayton for a dunk with 4:38 left that made it 110-104. Ayton muscled his way to another bucket a few possessions later to push the Phoenix up 112-104.\n\n\r\n                    “We just had to gut it out,” Suns coach Monty Williams said. “I was really happy for (Ayton) to be able to be the guy down the stretch, taking advantage of his size against their switches.”\n\n\r\n                    It was another good game for Ayton, who has found his niche playing alongside the All-Star backcourt of Chris Paul and Booker. Ayton shot 10 of 11 from the field and made all six of his free throws. Paul finished with 13 points and 11 assists.\n\n\r\n                    Paul said Ayton's big moments in clutch situations are important as the Suns prepare for the first playoff run since 2010.\n\n\r\n                    “I think it’s big for all of us,” Paul said. “These games build confidence and trust and that’s what it comes down to in the playoffs.”\n\n\r\n                    The Suns improved to 40-15 for the season, hitting 40 wins for the first time since 2014. \n\n\r\n                    “I'm grateful for it,” Williams said. “But I can't spend much time dwelling on it.”\n\n\r\n                    The Kings have lost nine straight. Sacramento was led by De'Aaron Fox, who scored 27. Buddy Hield added 24 and Wright had 16 off the bench.\n\n\r\n                    “I feel for the group,” Sacramento coach Luke Walton said. “They really fought. We played pretty darn hard tonight, gave everything we had. Unfortunately, we need to do the little things better.\"\n\n\r\n                    Jevon Carter made his first three shots off the bench, including two 3-pointers, to give the Suns a lift early in the second quarter. His second 3 gave Phoenix a 45-33 advantage with 9:30 left before halftime.\n\n\r\n                    But the Kings cut into the deficit quickly and Wright made a 3 with 1:15 left that tied the game at 65. The Suns took a 67-65 lead into halftime after Booker made a 17-foot jumper.\n\n\r\n                    Both teams shot the ball well in the first half. Phoenix was 25 of 40 (63%) from the field, including 11 of 21 from 3-point range (52%). The Kings weren't far behind, shooting 24 of 42 (57%) and 10 of 18 (56%) from long range.\n\n\r\n                    Fox said the Kings played hard but it's difficult to win while giving up 120-plus points.\n\n\r\n                    “We have been fine offensively,” Fox said. “That is not really the problem. For us, especially in close game like this we have to finish the game better than we did and better than we have in the past.”\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: F Marvin Bagley III (hand fracture) and F Richaun Holmes (right hamstring strain) didn't play. ... The Kings have lost nine straight games for a second time this season.\n\n\r\n                    Suns: Paul needs 16 assists to pass Magic Johnson (10,141) for No. 4 on the all-time list. ... F Abdel Nader missed his 14th straight game because of right knee soreness. ... Carter finished with 13 points in 17 minutes, leading a bench that scored 42. ... Paul has 40 assists and just one turnover over his past four games. \n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Travel to face the Dallas Mavericks on Sunday.\n\n\r\n                    Suns: Wrap up a five-game homestand vs. the Spurs on Saturday.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt at www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997737.537297
}