{
  "game_id": "401810076",
  "espn_id": "401810076",
  "date": "Nov 12, 2025",
  "matchup": "DAL vs PHX",
  "headline": "Devin Booker, Grayson Allen lead Suns past struggling Mavericks, 123-114",
  "body": "DALLAS -- — Devin Booker had 26 points and nine assists, Grayson Allen scored four of his 23 points in a key late stretch and the Phoenix Suns held off the Dallas Mavericks 123-114 on Wednesday night for their fourth straight victory.\n\n\r\n              Dallas played for the first time since the Tuesday morning firing of general manager Nico Harrison, embattled since making the controversial Feb. 2 trade that sent superstar Luka Doncic to the Los Angeles Lakers.\n\n\r\n              Dallas cut an 18-point second-half deficit to three with 1:48 left. Allen took a scoop shot down the lane with Daniel Gafford called for goaltending with 1:25 to go and made two free throws with 24.3 seconds left for a seven-point lead.\n\n\r\n              The Suns are 7-5. They have won six of seven after opening 1-4.\n\n\r\n              Klay Thompson scored 19 points in his fourth straight game off the bench, including a season-high six 3-pointers, for the Mavericks. At 3-9, they are off to their worst start through 12 games since opening 2-10 in 2017-18.\n\n\r\n              Brandon Williams scored 17 points, and Cooper Flagg had 16 for the Mavericks.\n\n\r\n              Dallas led 28-18 late in the first period before Phoenix ran off the final 12 points of the quarter\n\n\r\n              Mavericks forward P.J. Washington Jr. left midway through the first period with a left shoulder strain after scoring six points in five minutes. Dallas was without Anthony Davis, who missed his seventh consecutive game with a strained left calf, and Dereck Lively II, who missed his ninth straight game with a sprained right knee.\n\n\r\n              Up next\r\n              Suns: Host Indiana on Thursday night.\n\n\r\n              Mavericks: Host the Los Angeles Clippers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042614.633051
}