{
  "game_id": "0021900829",
  "espn_id": "401161471",
  "date": "Feb 21, 2020",
  "matchup": "TOR vs. PHX",
  "headline": "Raptors beat Suns 118-101 for 16th win in 17 games",
  "body": "TORONTO --  Make it 16 wins in 17 games for the surging Toronto Raptors.\n\nPascal Siakam had 37 points and 12 rebounds and Toronto beat Phoenix 118-101 on Friday night, its fifth straight victory over the Suns.\n\nSerge Ibaka scored 16 points, Fred VanVleet and Terence Davis each had 14, Kyle Lowry had 13 points and 10 assists and OG Anunoby added 12 points for the defending NBA champion Raptors.\n\nAfter Toronto's franchise-record 15-game winning streak ended with a loss at Brooklyn in the final game before the All-Star break, the Raptors bounced back by starting the second half with their eighth consecutive home victory.\n\n\"I just feel energized,\" said Siakam, a first-time All-Star last weekend.\n\nThe Raptors have not lost back-to-back games since an overtime loss at Indiana on Dec. 23 and a home loss to Boston on Christmas Day. Toronto has gone 19-1 since.\n\n\"They set the tone early,\" Suns guard Ricky Rubio said. \"That's why they're a championship team.\"\n\nSiakam connected on 12 of 19 attempts, going 5 of 9 from 3-point range. He scored 17 points in the first quarter as Toronto built a big first-half lead and didn't let it go.\n\n\"The first half, he was lights out,\" Suns coach Monty Williams said. \"He hadn't shot the ball like that in a while, so we weren't planning on him making those shots.\"\n\nSiakam's five 3-pointers were just one fewer than the six the Suns managed on 34 attempts. Phoenix shot 17.6% from long range, its lowest mark of the season. No Suns player made more than one shot from distance.\n\n\"That's not the team we are,\" Suns guard Devin Booker said.\n\nBooker scored 21 points and DeAndre Ayton had 17 points and 10 rebounds for Phoenix. The Suns lost for the seventh time in nine games and dropped their fifth straight on the road.\n\nAyton returned to the starting lineup after missing the final two games before the All-Star break because of a sore left ankle.\n\nPhoenix trailed 93-78 through three quarters, but the Suns cut the gap to six points, 96-90 on a basket by Ayton with 8:08 left to play. Rondae Hollis-Jefferson made a pair from the line, and VanVleet and Siakam both scored to put the Raptors up 102-90 with 6:58 remaining.\n\nBooker missed a 3 with 4:45 left that would have made it a four-point game. Anunoby scored on a dunk and, after another missed 3 by the Suns, Ibaka banked home a 3-pointer to restore Toronto's 12-point cushion.\n\nTIP-INS\n\nSuns: F Dario Saric returned after missing seven games because of sprained left ankle and scored eight points in 19 minutes. C Aaron Baynes ended a 13-game absence caused by a sore left hip. Baynes had five points in 11 minutes.\n\nRaptors: Toronto remained without C Marc Gasol (left hamstring) and G Norman Powell (broken finger, left hand). Gasol sat for the ninth straight game, and Powell missed his seventh. . F Patrick McCaw was inactive because of flu-like symptoms. . Toronto had a season-worst 25 turnovers. . The five-game winning streak against Phoenix is the longest in Raptors team history.\n\nNO FUN\n\nRaptors coach Nick Nurse said he didn't get a lot of pleasure from the second half.\n\n\"The game lost its rhythm, and every ounce of enjoyability, there in the third,\" Nurse said.\n\nBLOCK PARTY\n\nToronto had a season-high 13 blocks, one more than the 12 they had at Chicago on Oct. 26.\n\n\"They're long and athletic,\" Booker said. \"They tipped a lot of shots, got their hands on a lot of balls.\"\n\nUP NEXT\n\nSuns: At Chicago on Saturday night.\n\nRaptors: Host Indiana on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995590.966086
}