{
  "game_id": "0021801170",
  "espn_id": "401071843",
  "date": "Apr 03, 2019",
  "matchup": "MIA vs. BOS",
  "headline": "Hayward scores 25, Celtics top Heat 112-102",
  "body": "MIAMI --  Gordon Hayward is playing his best basketball of the year, and his timing could not be better for the Boston Celtics.\n\nHayward scored 25 points, Kyrie Irving added 23 and the Celtics pulled away in the final minutes to beat the Miami Heat 112-102 on Wednesday night to hang on to the No. 4 spot in the Eastern Conference playoff race. It was the sixth consecutive double-figure scoring game for Hayward, his longest such streak of the season.\n\n\"Everyone made big-time plays for us,\" Hayward said. \"We want to be playing the best we can be going into the playoffs.\"\n\nHayward had 15 of his 25 points after halftime, made 12 of 13 shots from the foul line and added eight rebounds and five assists. Al Horford scored 21 and Jayson Tatum scored nine of his 16 points in the fourth quarter for the Celtics, who went on a 10-2 run over a decisive three-minute late stretch to turn a two-point lead into a 10-point edge.\n\n\"Guys did a good job on both ends,\" Celtics coach Brad Stevens said.\n\nAron Baynes had 10 points and 10 rebounds for Boston, which remained tied with Indiana for the fourth-best record in the East. Those teams meet in Indianapolis on Friday, with the winner getting the No. 4 spot in the conference with two games left.\n\nDion Waiters scored 21 points for Miami, which was potentially playing the next-to-last home game of Dwyane Wade's career. Hassan Whiteside came off the bench to finish with 18 points and 15 rebounds for Miami, and Wade scored 17 for the Heat.\n\n\"Kind of like a playoffs kind of game,\" Wade said. \"It was a good basketball game. They held us at bay. Every time we tried to make a run and get close, they made something happen.\"\n\nDetroit and Brooklyn also lost on Wednesday, meaning the race for the No. 6 spot in the East is even more muddled than it was entering the night. Detroit is sixth at 39-39, Brooklyn and Orlando (which beat New York) are 39-40, and the Heat fell to ninth at 38-40 -- a half-game out of eighth, a game out of sixth, but running out of time.\n\nIt could be a doubly costly loss for Miami. Josh Richardson returned from a three-game absence with a sore heel, and left early in the third quarter with a leg injury. He'll get an MRI on Thursday and the Heat are concerned.\n\n\"They got us into some tough looks and when we were open, we missed some of those,\" said Heat coach Erik Spoelstra, whose team shot 41 percent and went only 12 for 20 from the foul line. \"It was a combination of everything. You have to credit their defense.\"\n\nBoston led for the overwhelming majority of the first three quarters -- the Heat led for 5:36 of those 36 minutes, yet the Celtics never really seemed in full control of the game until the final moments.\n\nLittle spurts were enough. Goran Dragic tied the game for the sixth time with a pair of free throws to open the fourth quarter, and Boston scored the next six to go up 89-83 with 8:55 remaining. The Celtics held the lead the rest of the way.\n\n\"I think we're doing a great job right now just being patient, taking the shots that are afforded and being aggressive,\" Irving said.\n\nTIP-INS\n\nCeltics: Boston, which jumped out to a 17-2 lead over Miami on Monday, started this game on a 9-0 run. ... Jaylen Brown missed his second consecutive game with back spasms, and Marcus Morris was out with a sore left knee. ... Irving has now played in 11 games at Miami; his Cleveland teams went 0-7 on the Heat home floor, and his Celtics teams are now 2-2.\n\nHeat: Justise Winslow (thigh, nine games missed) and Rodney McGruder (knee, eight games) returned from injuries. ... Miami has now used 26 starting lineups this season. ... Heat legend Chris Bosh sat courtside.\n\nSPECIAL ANTHEM\n\nThe national anthem was performed pregame using \"The Instrument of Hope,\" a trumpet made from bullet casings -- a project by students at Marjory Stoneman Douglas High School. The trumpet has been on tour for the past several weeks, part of the students at the Parkland, Florida, school's quest to continue the conversation about gun violence.\n\nWADE AT HOME\n\nWade played for the 574th time at home in a Heat uniform. He's assured of only one more game in Miami -- the Heat close their home regular-season schedule on Tuesday against Philadelphia.\n\nUP NEXT\n\nCeltics: Visit Indiana on Friday.\n\nHeat: Visit Minnesota on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995217.0928278
}