{
  "game_id": "0021800724",
  "espn_id": "401071397",
  "date": "Jan 25, 2019",
  "matchup": "TOR @ HOU",
  "headline": "Harden scores 35 in Rockets' 121-119 win over Raptors",
  "body": "HOUSTON --  In a season filled with lots of injuries that have resulted in just as many ups and downs, the Houston Rockets have found help in unlikely places.\n\nWhen Chris Paul was injured, they got a boost by signing Austin Rivers following his release by the Suns. And after the recent injury to Clint Capela, Houston scooped up Kenneth Faried after he was released by the Nets. After just three games, Faried is proving another great fit as he scored 21 points and had a season-high 14 rebounds Friday night to help the Rockets to a 121-119 win over the Toronto Raptors.\n\n\"The lift was great,\" James Harden said. \"Kenneth brought the energy that we've been waiting on.\"\n\nHarden scored 35 points for his 22nd straight game with 30 or more and the Rockets never trailed and held off a late charge in the victory.\n\nAfter averaging 52.2 points over the last five games, capped by a franchise-record 61 in Wednesday's win over the Knicks, Harden's torrid scoring pace slowed a bit as all of Houston's starters scored 10 points or more.\n\nEric Gordon led that group with 24, P.J. Tucker added 18 and Austin Rivers scored 13.\n\nHouston led by 11 points after two free throws by Harden with 1:14 remaining before the Raptors made three straight 3-pointers to cut the lead to 121-119 with 27.3 remaining. Gordon missed a 3 to give the Raptors a chance, but Kawhi Leonard's 3-point attempt was short as he was defended by Harden.\n\nTucker, who is Houston's leader on defense, was asked about Harden's defense on the last play.\n\n\"He plays defense when he wants to,\" Tucker said with a laugh. \"Everybody talks about him playing defense but ... since I've been here he's stepped up (after) everybody called him out.\"\n\nIt's the 22nd straight game in which Harden has led his team and Houston's opponent in scoring, which moves him past Michael Jordan for the second-longest streak in NBA history behind Wilt Chamberlain, who did it in 40 in a row.\n\nDanny Green, who led Toronto's effort to slow Harden down thought they did a \"decent job\" on him.\n\n\"We wanted the other guys to beat us and they did, and they did well,\" he said. \"They shot well and Eric Gordon, P.J. Tucker and Faried, we made those guys look really good tonight. We have to do a better job of ... doing both -- stopping one guy and limiting the other guys from getting into rhythm as well.\"\n\nHarden's stretch of 30-point games is the fourth-longest in league history, behind three streaks by Chamberlain of 25, 31 and 65 games. Harden was 15 of 15 on free throws, but struggled from long-range, shooting just 2 of 13 on 3-point attempts. The strong play of Faried gave Harden some much-needed help Friday and The Beard will get another reinforcement Sunday night when Paul is expected to return after missing 17 games with a strained left hamstring.\n\n\"I love playing basketball, so for me just to be out there with those guys helping out any way I can, rebounding, defense, blocks, just being out there giving my all,\" a beaming Faried said.\n\nThe Raptors got 32 points from Leonard as they dropped their second straight.\n\nThe Rockets held a 7-point lead to start the fourth and pushed it to 10 before the Raptors scored five straight points, capped by a 3 from Norman Powell to get within 99-94 with about nine minutes left.\n\nHouston then used a 9-0 run to extend the lead to 108-94 about three minutes later. Rivers made a 3 late in that span before Tucker capped it by grabbing a steal and finishing with a layup.\n\nToronto got within 10 after scoring four quick points later in the fourth, but a layup by Harden made it 117-105 with about 90 seconds left.\n\nHouston led by as many as 22 early, but Toronto used a 41-point second quarter to cut the lead to 70-61 at halftime. The Raptors opened the third quarter with a 9-4 run to get within 4, but Houston followed with an 18-4 spurt, with nine points each from Harden, to push it to 92-74 with about four minutes left in the quarter.\n\nThe Raptors got back on track after that, scoring the next 10 points, with two 3-pointers from Green, to cut the lead to 92-84 with about a minute left in the third.\n\nTIP-INS\n\nRaptors: Jonas Valanciunas missed his 21st game with a dislocated left thumb. ... Green and Pascal Siakam added 22 points each. ... Serge Ibaka had 12 points and 14 rebounds.\n\nRockets: Brandon Knight missed his seventh straight game with a sore left knee, but is expected to return Sunday. ... Houston made its first 20 free throws on Friday night before a miss by Faried with 7:55 left in the fourth quarter. The Rockets finished 29 of 33 from the line.\n\nTHEY SAID IT\n\nFaried, who holds the NCAA record for most career rebounds with 1,673, on his big rebounding night: \"It just made me feel like myself again.\"\n\nUP NEXT\n\nRaptors: Visit Dallas on Sunday night.\n\nRockets: Host Orlando on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994264.8516119
}