{
  "game_id": "0021600751",
  "espn_id": "400900156",
  "date": "Feb 03, 2017",
  "matchup": "LAL @ BOS",
  "headline": "Thomas scores 38 points, Celtics beat Lakers 113-107",
  "body": "BOSTON --  Isaiah Thomas isn't the only Boston Celtics representative in the NBA All-Star Game anymore.\n\nWith Toronto's loss to Orlando earlier Friday night, Brad Stevens was assured his spot as coach of the Eastern Conference and will join Thomas next Sunday in New Orleans.\n\nMeanwhile, Thomas padded his All-Star credentials by scoring 17 of his 38 points in the fourth quarter as the surging Celtics beat the Los Angeles Lakers 113-107.\n\n\"(Stevens) should put me in that starting lineup,\" Thomas joked. \"That's going to be good.\"\n\nIt's the first career All-Star appearance for Stevens, in his fourth season with the Celtics.\n\n\"What's nice about it is there's no politics and there's no subjectivity,\" Stevens said. \"(It's) what your team has accomplished and that's a credit to the players in the locker room.\"\n\nAl Horford added 11 points, eight rebounds and eight assists as Boston (32-18) won its sixth consecutive game. Thomas logged his 34th straight game with 20 or more points and is six shy of John Havlicek's franchise-record streak.\n\nJae Crowder had 18 points, Jaylen Brown added 12 and Terry Rozier scored 10 for the Celtics.\n\nLou Williams led the Lakers with 21 points. D'Angelo Russell scored 20, Larry Nance Jr. had 18 and Nick Young 17 as Los Angeles (17-36) lost for the fifth time in six games.\n\n\"We stopped moving the ball. We stopped trusting each other,\" coach Luke Walton said. \"Because of it, we don't make shots, and then our defense gets lazy.\"\n\nThomas scored seven points in the third as the Celtics broke the game open and led by as many as 16. The Lakers cut it to 82-74 after three but couldn't get the deficit below six.\n\n\"They were all making big shots tonight,\" Nance said. \"Hats off to them.\"\n\nThomas had a chance to become the first player in Celtics history with three straight 40-point games, but said he wasn't aware of that until afterward.\n\n\"I didn't know about it or I would have taken the last shot,\" Thomas said.\n\nBoston opened the game on a 7-0 run before Russell's 3-pointer put the Lakers up 15-14 with 7:34 left in the first quarter. Rozier's buzzer-beating 3 drew the Celtics to 30-29 after one. Thomas had 12 points in the period.\n\nRozier's floater a minute into the second put the Celtics ahead for good, and Boston stretched its lead to 62-51 at halftime.\n\nThe Lakers and Celtics meet again March 3 in Los Angeles.\n\nTIP-INS\n\nLakers: F Julius Randle was out after playing sparingly in Thursday's game at Washington as he recovers from pneumonia. Randle missed two games before logging six minutes against the Wizards. \"Coming back from pneumonia, it's not just a normal sickness,\" Walton said.\n\nCeltics: G Avery Bradley (sore right Achilles) missed his ninth consecutive game. Bradley felt good after working out and doing some on-court work Friday. \"We're still progressing at a conservative rate,\" Stevens said. \"We want him feeling 110 percent.\" ... F Kelly Olynyk played after sitting out Wednesday in Toronto with a sore left shoulder.\n\nTIEBREAKER\n\nBoston and Los Angeles began the night with with 3,252 wins, tied for the most in NBA history. Before their loss, the Lakers held at least a share of the league's all-time victories mark since 2001. The odds of both teams entering Friday's game with the same win total was 1 in 8,292.\n\n\"I think it's a unique-enough rivalry that 100 years from now it will probably be tied again,\" Stevens said.\n\nMINI MAMBA\n\nLakers great Kobe Bryant had a knack for late-game dramatics throughout his storied career. Thomas is developing one, too.\n\nThomas leads the league in fourth-quarter scoring (10.8 points per game), but laughed off the comparison to Bryant, who retired after last season.\n\n\"Nah, you can't put my name with Kobe,\" Thomas said. \"Maybe 15 years from now hopefully, but I'm not close to him.\"\n\nUP NEXT\n\nLakers: Continue a five-game road trip in New York on Monday.\n\nCeltics: Host the Los Angeles Clippers on Sunday in Paul Pierce's last regular-season game in Boston.",
  "source": "espn_api",
  "crawled_at": 1764995385.965206
}