{
  "game_id": "0022100137",
  "espn_id": "401359961",
  "date": "Nov 06, 2021",
  "matchup": "ATL @ PHX",
  "headline": "Booker, Suns rally in 4th quarter for 121-117 win over Hawks",
  "body": "PHOENIX -- — Frank Kaminsky spent much of the early part of this season buried on the Phoenix Suns bench. \n\n\r\n                    Suddenly, the big man has swapped that role for burying jumpers and dunks.\n\n\r\n                    Devin Booker scored a season-high 38 points, Kaminsky added 16 and the Suns rallied from a 12-point deficit in the fourth quarter to beat the Atlanta Hawks 121-117 on Saturday night.\n\n\r\n                    “You've got to stay ready so you don't have to get ready,” Booker said. “That's Frank.”\n\n\r\n                    Mikal Bridges found the 7-foot Kaminsky streaking down the middle of the lane for a dunk with 45 seconds left that gave the Suns a 116-115 lead, their first of the final quarter. After Atlanta's Trae Young missed a 3-pointer, Booker hit Jae Crowder for a layup and a 118-115 advantage.\n\n\r\n                    Bogdan Bogdanovic shot an airball on an off-balance 3-point attempt with 15 seconds left that effectively ended the Hawks' chances. \n\n\r\n                    Phoenix has won four straight and moved to 5-3 this season. Atlanta has lost five of six and fell to 4-6.\n\n\r\n                    Young led Atlanta with 31 points and 13 assists. John Collins added 26 points and 10 rebounds. Atlanta scored just 19 points in the fourth quarter.\n\n\r\n                    “I don’t know if it was what we did or what they did,” Young said. “They kind of picked up the energy and used the home crowd for momentum and kind of road the wave. They made a couple of more plays than we did.”\n\n\r\n                    It was an entertaining, tight game that featured 20 ties and 13 lead changes. Phoenix's Chris Paul finished with 16 points and 13 assists, making three crucial free throws in the final seconds.\n\n\r\n                    Young scored 14 points in the third quarter — including a 31-footer in the final minute — to push the Hawks ahead 98-86 by the end of the period.\n\n\r\n                    But the Suns fought back. Booker hit a 3-pointer with 3:30 left that cut Atlanta's lead to 113-111 and hit another long jumper with 2:07 remaining to tie the game at 113-all. \n\n\r\n                    “We just lost our poise,” Hawks coach Nate McMillan said. “I thought we started to rush, we got caught up in the officiating again. That became a distraction.\"\n\n\r\n                    Booker played arguably his best game of the season, finishing 14 of 21 from the field, including 5 of 9 from 3-point range. Kaminsky was 7 of 10 from the field, providing 29 valuable minutes. He was forced into a bigger role because starter Deandre Ayton was out with an injury and backup JaVale McGee fought foul trouble.\n\n\r\n                    Kaminsky's also a solid passer, especially for a big man, and finished with four assists.\n\n\r\n                    “I'm not the most athletic guy in the world -- I don't think that's a secret,” Kaminsky said. “But I've always been able to affect the game with my mind and how I see things. It's always been a strength of mine.”\n\n\r\n                    Danilo Gallinari banked in a 3-pointer from beyond halfcourt at the first quarter buzzer to give the Hawks a 26-25 lead. The game remained close throughout the first half and the Suns clawed to a 59-58 lead by the break.\n\n\r\n                    SARVER FALLOUT\n\n\r\n                    Suns owner Robert Sarver hasn't been seen at Footprint Center since ESPN released a report on Thursday alleging that Sarver has a history of racist, misogynistic and hostile incidents during his 17-year tenure in charge of the franchise.\n\n\r\n                    At least one fan showed his displeasure on Saturday, holding up a sign calling Sarver a profane name. The sign was quickly confiscated by an usher.\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Clint Capela had 13 rebounds. ... The Hawks had a 50-42 rebounding advantage.\n\n\r\n                    Suns: Ayton (right leg contusion) didn't play for the second time in three games. He played on Thursday against the Rockets and finished with 16 points and 11 rebounds. Coach Monty Williams said Ayton was “sore” following the game and the team was being cautious by holding him out on Saturday. ... G Cam Payne (hamstring) played on Saturday for the first time in about two weeks. He finished with four points.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Travel to face the Golden State Warriors on Monday.\n\n\r\n                    Suns: Play eight of the next 12 games on the road, starting with the Sacramento Kings on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764993507.849751
}