{
  "game_id": "0022200302",
  "espn_id": "401468457",
  "date": "Nov 28, 2022",
  "matchup": "ORL @ BKN",
  "headline": "Durant scores 45, carries Nets to 109-102 win over Magic",
  "body": "NEW YORK -- — Kevin Durant scored a season-high 45 points, carrying the Brooklyn Nets to a 109-102 victory over the Orlando Magic on Monday night that got them back to .500.\n\n\r\n              Durant shot 19 of 24 from the field and added seven rebounds and five assists, playing 39 minutes on the second night of back-to-back games. \n\n\r\n              The 12-time All-Star went through his pregame routine and had no clue he was due for his biggest scoring outburst of the season.\n\n\r\n              “You really don’t know. I really don’t know,” Durant said. “I’ve had games where I shot incredible in warmups and had the worst shooting night that night. Mainly, if my mind is in the right place coming into the game, as far as following the game plan, I feel like that’s when I had solid games.”\n\n\r\n              His performance Monday came a night after scoring 31 points on 12-for-20 shooting in a victory over Portland.\n\n\r\n              “He just keeps going,” coach Jacque Vaughn said. “At this stage in age of his career, I mean the minutes he played, what he did last night to lead us into a win is huge. I think it shows the preparation that he puts into his body, what he feels about the game. He approaches it like we have to win this game.”\n\n\r\n              Kyrie Irving added 20 points and Nic Claxton had 17 points and 13 rebounds for the Nets (11-11), who had to play the second half without Ben Simmons after he was bothered by left knee soreness.\n\n\r\n              Simmons, who missed four games from Oct. 31 to Nov. 5 due to swelling in the left knee and had fluid drained out from it, picked up an offensive foul with 9:03 remaining in the second quarter and was immediately replaced by Claxton.\n\n\r\n              Paolo Banchero and Bol Bol each scored 24 points and Franz Wagner chipped in 21 for the Magic, who have lost five straight games and seven of their last eight. \n\n\r\n              A night after losing by 30 to a Philadelphia that was playing without Joel Embiid, James Harden and Tyrese Maxey, the Magic managed to keep it close despite Durant’s stellar performance.\n\n\r\n              “It’s tough playing against a player like that, but it also makes you better as a player, as a team,” Wagner said. “\n\n\r\n              Durant broke a 60-all tie with a pair of baskets during an 8-0 run that helped the Nets take a 68-60 lead with 7:41 left in the third quarter. He later sparked a 10-0 spurt down the stretch with seven points of his own and a block that gave the Nets an 87-76 lead heading into fourth quarter.\n\n\r\n              The All-Star forward was 8 for 9 for 19 points in the third. \n\n\r\n              “Super-efficient, fun to be a part of. Bailed us out a lot of times on possessions,” Irving said. “When he’s got it going like, we don’t want to force him the ball, but we definitely want to let him work.”\n\n\r\n              Brooklyn led by as many as 11 points early in the final period before Bol knocked down a runner to cut the lead 106-102 with 1:01 remaining in regulation. \n\n\r\n              Claxton was fouled by Bol on the ensuing possession and made one free throw. Wagner then missed a 3-pointer and Irving found Claxton wide open for a dunk that sealed the victory.\n\n\r\n              Durant scored 17 points in the first half to help Brooklyn take a 52-51 advantage into the third quarter. \n\n\r\n              The Nets have won four consecutive games at Barclays Center.\n\n\r\n              TIP-INS\n\n\r\n              Magic: Orlando at one point missed 17 consecutive shots that spanned a little over 10 minutes between the end of the first quarter and the second quarter before Wagner hit a jumper with 7:04 left in the period. \n\n\r\n              Nets: G Joe Harris scored 17 points. \n\n\r\n              UP NEXT\n\n\r\n              Magic: Host the Atlanta Hawks on Wednesday night. \n\n\r\n              Nets: Continue their seven-game homestand against the Washington Wizards on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994652.571584
}