{
  "game_id": "0021601125",
  "espn_id": "400900520",
  "date": "Mar 30, 2017",
  "matchup": "HOU @ POR",
  "headline": "Lillard leads Trail Blazers past Rockets 117-107",
  "body": "PORTLAND, Ore. --  The Portland Trail Blazers are finishing the regular season on a good note, and the Houston Rockets are the latest to be frustrated by them.\n\nDamian Lillard had 31 points and 11 assists, leading the Trail Blazers past the Rockets 117-107 on Thursday night. Lillard is the first player in franchise history to score 30 points eight times in a calendar month.\n\nJusuf Nurkic had a team-high 11 rebounds to go along with 19 points for the Trail Blazers, who have a season-high five-game winning streak and a 1  1/2-game lead over the Denver Nuggets for the eighth seed in the Western Conference.\n\n\"They'll be a handful in the playoffs,\" Rockets coach Mike D'Antoni said of the Blazers.\n\nJames Harden finished with 30 points and eight rebounds to lead the Rockets. Harden's 3-pointer at the end of the first quarter gave the Rockets 1,078 3s, an NBA single-season record.\n\nPortland held a 96-85 lead into the fourth, but Houston made a run early in the quarter. Trevor Ariza's dunk tied the game at 105 with 2:29 left, but Nurkic's post-up gave Portland the lead right back with 2:05 remaining.\n\nAllen Crabbe sealed the win with steal on Harden, taking it coast-to-coast to give the Blazers a 113-105 lead with 1:12 left.\n\nHarden had three turnovers in the fourth quarter.\n\nAfter recording 13 turnovers or more in four straight games, the Blazers have had 12 or fewer in the past two games.\n\n\"We've been really in tune with every possession,\" Blazers coach Terry Stotts said of his team's low turnover total in the past two games. \"Consistency in the first half of the season was a challenge. I think we are valuing each possession at both ends much better.\"\n\nAfter Eric Gordon's 3-pointer gave the Rockets a two-point lead early in the second quarter, the Blazers outscored Houston 19-6 to reclaim the lead and push it to as high as 12 before taking a 65-56 lead into halftime.\n\nPortland's supporting cast, particularly Crabbe, Al-Farouq Aminu and Maurice Harkless, were crucial in creating the lead, helping them survive a 4-of-15 night from CJ McCollum.\n\nThe trio combined for 49 points and six 3-pointers.\n\n\"I think we're tough to beat when we're playing like that,\" Harkless said.\n\nROCKETS LACK OF URGENCY\n\nFollowing the loss, D'Antoni expressed his concerns with his team's play.\n\n\"There's not an urgency to what we're doing,\" D'Antoni said. \"We've got to figure a way that even when you're not shooting well you've got to win.\"\n\nHouston shot 8 of 34 (23 percent) from long range.\n\n\"You've got to come out to play no matter what,\" Ariza said. \"No matter who you're playing against, you've got to come out and be ready.\"\n\nTIP-INS\n\nRockets: Expect to get big man Montrezl Harrell back in the lineup Friday, when they face the Golden State Warriors, after he attended to the birth of his child. D'Antoni praised Harrell for how he has handled being the team's third center. \"You can sweet-talk it, but reality is what it is and he's accepted it,\" D'Antoni said. \"He keeps working with John Lucas, keeps getting better. He's trying to improve his 3-point shooting. That way we can move him over to the 4 some. If he can do that, that will open up some space for him. I have nothing but good things to say about him. He's been terrific.\" ... D'Antoni said the Rockets plan to rest backup center Nene on Friday.\n\nBlazers: They've impressed D'Antoni, who praised his coaching counterpart, Stotts, saying the Blazers are a much different team than the one they faced on Nov. 27. \"Nurkic has helped give them new life,\" D'Antoni said. \"They're a lot different now, they're a lot better right now. Terry has done a great job, as he always does. This is really good what he's done.\"\n\nUP NEXT\n\nRockets: Head to Oakland on Friday to face the Warriors, who beat them 113-106 Tuesday in Houston.\n\nBlazers: Host the Phoenix Suns on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995737.104953
}