{
  "game_id": "0021600626",
  "espn_id": "400900047",
  "date": "Jan 17, 2017",
  "matchup": "LAL vs. DEN",
  "headline": "Jokic scores 29, Nuggets hold off struggling Lakers 127-121",
  "body": "LOS ANGELES --  All the Denver Nuggets needed was a trip across the Atlantic Ocean to find their groove.\n\nAfter snapping a five-game losing streak Thursday with a win over the Indiana Pacers in London, the Nuggets have returned to find home suddenly more accommodating. They held off a furious rally by the Los Angeles Lakers for a 127-121 victory Tuesday night that marked their third straight.\n\nDenver led by 19 late in the third quarter only to see the Lakers close to 120-119 with under two minutes to play. Wilson Chandler responded with a dunk and scored five points in the final 1:40 as the Nuggets hung on.\n\n\"They had all the momentum and the crowd going, but we had enough poise down the stretch to get the win,\" coach Michael Malone said.\n\nDenver's offense was led by center Nikola Jokic, who had 29 points and 15 rebounds. Will Barton added 26 points and eight assists, and Kenneth Faried had 20 points and seven rebounds.\n\n\"We had a little more time in London just to bond, just to be around (each other) off the court,\" Jokic said. \"We had more time to be together and I think that helped us.\"\n\nThe Lakers looked lost for most of Tuesday's game. They came out flat, fell behind by 14 points in the first quarter and were down by 17 heading into the final period.\n\nVeteran guard Lou Williams scored 14 of his team-high 24 points in the fourth to key the comeback bid. Nick Young had 22 points, and Jordan Clarkson scored 19 for the Lakers.\n\n\"We just started playing for each other,\" Clarkson said. \"We have to figure out how to play that way to start the game.\"\n\nThe struggling Lakers have lost five consecutive games and 21 of 26.\n\nThey were still down by 11 with five minutes to play when the 3-pointer helped make for a nervous finish. Williams hit two 3s and Young one to pull the Lakers within two. Moments later, a Clarkson 3-pointer had them within one at 120-119 with 1:52 to play.\n\nBut then Chandler scored five of his 14 points the rest of the way to help the Nuggets escape. They had beaten Orlando on Monday, making Tuesday's victory only their second in eight back-to-backs.\n\n\"Early in the season we probably lost this game, to be honest,\" Chandler said. \"But everybody held their composure, everybody made big plays.\"\n\nAfter his starters struggled, Lakers coach Luke Walton went largely to his reserves, particularly in the fourth quarter.\n\n\"We found that competitive spirit again,\" Walton said. \"We found that passion where we want to play.\"\n\nTIP-INS\n\nNuggets: Jokic is on a roll. In his previous 19 games, he's had 12 double-doubles and averaged 18.1 points and 9.6 rebounds. ... Denver has outrebounded its opponent in 33 of its first 40 games, with two ties.\n\nLakers: F Luol Deng missed the game with a sprained right wrist. ... Two of the team's top three scorers are reserves (Williams at 17.6 points per game and Clarkson at 13.9), which explains why the Lakers lead the NBA in bench scoring (49.4 ppg). ... Los Angeles has started 13 different players and no Laker is averaging 30 minutes per game.\n\nZUBAC RESPONDS\n\nLakers center Ivica Zubac, a 19-year-old rookie drafted in the second round, had the best game of his young career. Zubac has spent time in the Development League and had appeared in only 10 NBA games, but Tuesday he put together his first double-double, scoring 11 points and pulling down a team-high 13 rebounds. He also had three blocked shots.\n\n\"They were getting everything they wanted for most of the game, and then when he got in there he started changing shots,\" Walton said. \"I'm not going to say he turned a corner. I'm just saying he was really good tonight.\"\n\nUP NEXT\n\nNuggets: Thursday night at the Spurs, who have defeated Denver seven consecutive times in San Antonio. The Spurs beat the Nuggets by 28 points two weeks ago in Denver.\n\nLakers: Host the Indiana Pacers on Friday night. The teams met in the Lakers' fourth game of the season, with Indiana winning at home 115-108. That loss preceded the Lakers' only three-game winning streak.",
  "source": "espn_api",
  "crawled_at": 1764995397.615475
}