{
  "game_id": "401810005",
  "espn_id": "401810005",
  "date": "Nov 02, 2025",
  "matchup": "CHA vs UTAH",
  "headline": "Kon Knueppel's career-high 24 points helps Hornets to a 126-103 rout of Jazz",
  "body": "CHARLOTTE, N.C. -- — Miles Bridges scored 29 points, Kon Knueppel added a career-high 24 and the Charlotte Hornets routed the Utah Jazz 126-103 on Sunday night to snap a three-game losing streak.\n\n\r\n              High-energy backup center Moussa Diabate provided a huge spark for the Hornets with 17 points and 12 rebounds. Sion James, Knueppel’s college teammate at Duke, also had a career-high 15 points.\n\n\r\n              Collin Sexton added 10 points and 12 assists for the Hornets, who played without Brandon Miller (shoulder subluxation) and LaMelo Ball (ankle impingement).\n\n\r\n              Lauri Markkanen had 29 points and Keyonte George added 25 for the Jazz, who lost their third straight.\n\n\r\n              After opening the season shooting a blistering 53% (16 of 30) from beyond the 3-point arc, Knueppel cooled off significantly the previous two games making just 2 of 12 from deep.\n\n\r\n              But the No. 4 overall pick was again on his game, making 4 of 9 3s as the Hornets made 18 3-pointers. Knueppel received a standing ovation from the crowd at the Spectrum Center when he left the game with 1:38 remaining and the Hornets up by 25.\n\n\r\n              This one was never close.\n\n\r\n              The Hornets, who started three rookies for the second time this season in Knueppel, James and Ryan Kalkbrenner, raced to a 39-25 lead after the first quarter and extended the advantage to 28 before halftime behind 17 first-half points from Knueppel and the aggressive play of Diabate on the glass, who kept alive several possessions.\n\n\r\n              Charlotte made 12 of 26 shots from beyond the arc in the opening half, while the Jazz were just 4 of 20.\n\n\r\n              Utah got within 16 points near the end of the third, but Diabate's hustle came into play as he tipped in an offensive rebound at the buzzer to swing the momentum back to Charlotte.\n\n\r\n              Up next\r\n              Jazz: At Boston on Monday night.\n\n\r\n              Hornets: At New Orleans on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042546.041305
}