{
  "game_id": "0021600276",
  "espn_id": "400899365",
  "date": "Dec 01, 2016",
  "matchup": "CHA vs. DAL",
  "headline": "Walker lifts Hornets past Mavericks, 97-87",
  "body": "CHARLOTTE, N.C. --  Kemba Walker had no nice way to describe the Charlotte Hornets' 97-87 victory over the Dallas Mavericks.\n\n\"That was pretty ugly,\" Walker said, before quickly adding that the Hornets will take the wins any way they can get them.\n\nWalker scored 18 points, Michael Kidd-Gilchrist added 14 and the Hornets got their third win in the last four games Thursday night to remain in first place in the Southeast Division.\n\nThe Mavericks slowed the tempo of the game, but the Hornets didn't get frustrated and never trailed.\n\n\"At the end of the day, it shows toughness,\" Walker said. \"It shows that we can withstand games. They really slowed it down tonight. But we really stayed with the game and won. ... That's what you have to do on some nights.\"\n\nWalker was just 7 of 19 from the field and Charlotte again struggled from the foul line at home.\n\nHowever, the Hornets got a big boost from their bench, which combined for 46 points on 25 shots, led by Jeremy Lamb, who had 12 points.\n\n\"That was a hard game to play,\" Hornets coach Steve Clifford said. \"It wasn't a conventional tempo for a NBA game to be played. It was slower. They really execute and they really changed their defenses. The tempo of a NBA game usually lets you get into a rhythm. But there was no way they would let us get into a rhythm. Bottom line is that's a game that good teams win.\"\n\nHarrison Barnes scored 17 points and Justin Anderson added 15 for the Mavericks (3-15), who have lost 10 of their last 11 games.\n\nThe Hornets led by two when Walker drained a long 3-pointer to beat the shot clock with 3:51 to give his team the spark it needed. Lamb followed with a driving layup that resulted in a three-point play to push the lead to 86-78.\n\nThe Mavs would battle back behind Barnes to cut the lead to three, but Lamb hit two free throws and Walker buried a 3-pointer from the right wing with 41 seconds left to put the game out of reach.\n\nTIP-INS\n\nMavericks: Deron Williams did not play down the stretch in the fourth quarter because he was on a minutes restriction on the second night of a back-to-back. ... Dwight Powell fouled out with 1:18 left.\n\nHornets: Nic Batum, who received a $120 million contract this offseason, has struggled some with turnovers this season. He entered averaging 2.3 per game and had three in the first half. ... The Hornets were 22 of 31 from the foul line and shot 28 percent from 3-point range.\n\nGIANTS WRESTLING\n\nFor the most part it was a subdued, lackluster game until the middle of the fourth quarter, when Mavericks center Salah Mejri grabbed the ball after it went out of bounds and cradled it in his arms until Charlotte's Roy Hibbert inexplicably attempted to rip it out. In a bizarre sight, the two 7-footers started wrestling for the ball well after the whistle had blown ending the play. They finally tumbled to the floor together, sending long arms and legs flying in every direction. Several players were seen trying to keep themselves from laughing at the spectacle after the play, which resulted in Hibbert getting a technical foul.\n\nSTRUGGLING FROM 3\n\nDallas' Wesley Matthews was upset with himself after the game for making just 1 of 11 3-point shots.\n\n\"If I shoot halfway decent, you give me those looks, and it's a different game,\" Matthews said.\n\nECLECTIC SITUATION\n\nMavericks coach Rick Carlisle said his team is in an \"eclectic situation\" right now.\n\n\"We've got to get these guys healthy,\" Carlisle said. \"We've got to do it the right way. In the meantime, other guys are getting valuable experience. We're playing some guys in some different positions and finding out some different things. We just have to keep up the fight. If we do that, things will come around.\"\n\nDEFENSE WINS\n\nThe Hornets improved to 8-0 in games in which they've limited their opponent to fewer than 100 points.\n\nUP NEXT\n\nMavericks: Dallas returns home to host the Chicago Bulls on Saturday night.\n\nHornets: Charlotte concludes a three-game homestand on Saturday night against the Minnesota Timberwolves.",
  "source": "espn_api",
  "crawled_at": 1764995533.247066
}