{
  "game_id": "0022201075",
  "espn_id": "401469230",
  "date": "Mar 20, 2023",
  "matchup": "MEM vs. DAL",
  "headline": "Jackson scores 28 as Grizzlies rally late to defeat Mavs",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson Jr. scored 28 points, including a key layup with 17 seconds left as the Memphis Grizzlies defeated the Dallas Mavericks 112-108 on Monday night in Ja Morant's first game back with the team after an eight-game league suspension.\n\n\r\n              Santi Aldama added 22 points and 14 rebounds for Memphis, career-highs in both categories. Desmond Bane finished with 17 as Memphis won its sixth in the last seven. \n\n\r\n              The win, coupled with Sacramento's loss to Utah, moved Memphis into sole possession of second place in the Western Conference, 3 1/2 behind first-place Denver.\n\n\r\n              Kyrie Irving led the Mavericks with 28 points but missed all eight of his shots in the fourth quarter as Memphis outscored Dallas 29-12 in the period.\n\n\r\n              “Recently, we've had some (large) deficits, and we've tried to figure out how to play better in the fourth,” Memphis coach Taylor Jenkins said.\n\n\r\n              Mavs coach Jason Kidd added that Irving was running the Dallas offense and making plays, but “we just didn’t capitalize.” Part of Irving's performance in the fourth could be attributed to him hurting his foot in the third quarter. Irving was wearing a orthopedic boot in the postgame press conference saying he reaggravated a right foot problem. He said the boot was “just precautionary.”\n\n\r\n              “We got some great looks, they just didn't go down tonight,” Kidd said. “When you look at those looks, we would take those.”\n\n\r\n              Morant did not dress for the game but was on the Memphis bench, coming out to a hearty ovation from the fans just before tipoff. The NBA assessed the suspension after a video from a Denver-area strip club earlier this month showed Morant brandishing a gun.\n\n\r\n              Meanwhile, the Mavericks were again without leading-scorer Luka Doncic, who missed his fifth game with left thigh soreness.\n\n\r\n              That left the Dallas offensive surge to Irving, picked up in a trade deadline deal, along with Christian Wood, who scored 20, as did rookie Jaden Hardy.\n\n\r\n              Dallas built its lead to 16 points in the third quarter, but Memphis crafted a 24-7 run in the fourth, and the game settled into an exchange of leads for both teams until the Grizzlies pulled away.\n\n\r\n              “I thought we were sloppy. We weren't fully engaged,” Jenkins said of the early problems. “Our heads weren't in the right place in the first three quarters, and you can see a (opponent’s) 16-point lead grow.”\n\n\r\n              The Mavericks carried a 60-57 lead into halftime, led by 20 points from Irving. The third quarter belonged to Dallas, stretching lead to 96-83 as Hardy scored 10 in the stanza, while the Mavericks shot 62%.\n\n\r\n              But Memphis turned things around in the fourth as Hardy made the only three field goals Dallas converted in the final frame.\n\n\r\n              “In a situation like that, it's kind of do-or-die at the start of the fourth quarter,” said Grizzlies guard Tyus Jones, who finished with 16 points and six assists. “You've got to go on a run to bring the game back in striking distance.”\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Doncic's absence marked the eighth time in 17 games since acquiring Irving at the trade deadline that one or both of the All-Stars has been out. ... Davis Bertans' 3-pointer in the second quarter was the 800th of his career. \n\n\r\n              Grizzlies: Dillon Brooks picked up a technical foul for taunting after a dunk. It was his 18th of the season, and per league rules, he will be suspended for Wednesday's game against Houston. ... Memphis is 11-2 against the Southwest Division, with the only losses coming to Dallas and the New Orleans Pelicans. \n\n\r\n              THEY SAID IT\n\n\r\n              Dallas returns home after a three-game road trip to face Golden State. The defending champions have struggled away from home going 8-29 after Wednesday night's win in Houston. “Hopefully, they have trouble playing us on the road,” Wood said of the upcoming game.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host Golden State on Wednesday night.\n\n\r\n              Grizzlies: Play the first of consecutive home games against Houston on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994169.913886
}