{
  "game_id": "0022300053",
  "espn_id": "401584141",
  "date": "Nov 28, 2023",
  "matchup": "CHI @ BOS",
  "headline": "Jaylen Brown scores 30 points as Celtics pound Bulls 124-97 and advance in the In-Season Tournament",
  "body": "BOSTON -- — Jaylen Brown scored 30 points, Jayson Tatum had 21 and the Boston Celtics routed the Chicago Bulls 124-97 on Tuesday night to advance to the quarterfinals of the NBA In-Season Tournament.\n\n\r\n              The Celtics won a three-team tiebreaker with Orlando and Brooklyn via point differential to take Group C and earn the No. 3 seed in the Eastern Conference. They will visit the No. 2 Indiana Pacers next week.\n\n\r\n              “To be honest, it was a little weird but the ultimate goal was to come out and get a win tonight and that’s what we did,” Brown said, noting that that focus on point differential was more than a little unusual. “It’s tough because that’s just not how the game is supposed to be played. One, you’ve got to respect your opponents.”\n\n\r\n              The Celtics made a season-high 21 3-pointers, getting four each from Al Horford and Jrue Holiday. All five Boston starters scored in double figures.\n\n\r\n              Horford finished with 16 points and nine rebounds. Holiday, who returned after missing two games with a sprained right ankle, had 14 points, nine assists and seven rebounds. \n\n\r\n              “Any time you add Jrue back into the lineup it’s going to help your defense,” said Derrick White, who also had 14 points. “He does so many things out there that impact winning. It’s nice to have him back.”\n\n\r\n              The Celtics extended the Bulls' losing streak to five straight. They outrebounded the Bulls 51-38 and shot 52% (47 of 90) from the field. \n\n\r\n              Although the Celtics began the day with the best record in the NBA, Boston needed a win and a huge scoring night to have a chance at reaching the tournament quarterfinals.\n\n\r\n              Boston coach Joe Mazzulla said he was especially pleased with how his team continued to press in the second half despite the huge lead. \n\n\r\n              “Call it what you want, but at the end of the day there’s times human nature comes in and you get bored. You start to deteriorate from your habits or you take your execution or your shots for granted. Tonight, we didn’t do that,” Mazzulla said. “For that stretch tonight, we just kept playing. That was a win for us.\"\n\n\r\n              Mazzulla said he also wasn't comfortable running up the score and said as much to Billy Donovan during a discussion between the coaches during a stoppage in play. \n\n\r\n              Donovan said he was particularly upset with the Celtics' decision to repeatedly foul Andre Drummond in the fourth quarter and send him to the foul line, where he made 1 of 6 free throws. \n\n\r\n              “But I also understand the situation he’s in, too. He’s got to coach his team and do what’s right, but I think it was putting Andre in a tough spot down 30 points,” Donovan said. ‘‘But this is from the league. This is what the league has done, making this point-differential thing.’’\n\n\r\n              DeMar DeRozan and Coby White led Chicago with 19 points apiece. Patrick Williams added 14 points and seven rebounds for the Bulls, who could not stop the Celtics' outside shooting.\n\n\r\n              Boston finished 21 for 49 from beyond the arc. It topped its previous high of 20 3-pointers set Nov. 1 against Indiana. \n\n\r\n              Ayo Dosunmu added 10 points for the Bulls, who have lost eight of nine. Zach LaVine left with a sore right foot and did not return. He scored two points in just under 25 minutes. \n\n\r\n              Boston scored 38 points in the second quarter on its way to a 69-50 halftime lead. It continued to roll in the third. Tatum made a layup and a 3-pointer to help the Celtics increase their advantage to 78-55.\n\n\r\n              With the point differential in mind, Boston continued to push. Tatum missed a long jumper, but Sam Hauser was there to slam back the rebound for a 104-75 lead with 8:52 left in the game.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host the Milwaukee Bucks on Thursday night. \n\n\r\n              Celtics: Host the Philadelphia 76ers on Friday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995914.68556
}