{
  "game_id": "0022000426",
  "espn_id": "401267586",
  "date": "Feb 15, 2021",
  "matchup": "SAC vs. BKN",
  "headline": "Irving scores 40, Harden triple-double as Nets thump Kings",
  "body": "SACRAMENTO, Calif. -- — Even with one of their Big Three on the bench, the Brooklyn Nets had no problem keeping their high-powered offense running smoothly.\n\n\r\n                    James Harden expected that. \n\n\r\n                    What caught the three-time scoring champion by surprise was how well the Nets played defensively, if only for a short but pivotal stretch in the third quarter.\n\n\r\n                    Kyrie Irving scored a season-high 40 points, Harden had his fifth triple-double with Brooklyn and the Nets beat the Sacramento Kings 136-125 on Monday night as injured Kevin Durant watched from the bench.\n\n\r\n                    “Offensively, we’re going to have nights like this. What’s going to get us over the top is defense,” Harden said. “That third quarter we took it upon ourselves collectively to get stops and guard. That allowed us to get out in transition and get easy buckets.”\n\n\r\n                    The Nets led 82-80 midway through the third before going on a 20-0 run that broke the game open.\n\n\r\n                    Harden and Irving were responsible for much of it, another sign the two perennial All-Stars are getting more comfortable after a month of playing together.\n\n\r\n                    Irving went 15 of 22 and made nine of the Nets’ franchise-record 27 3-pointers, including consecutive shots from beyond the arc to start the game and three more as part of a 23-4 spurt in the third period.\n\n\r\n                    Harden got caught up watching Irving’s display.\n\n\r\n                    “It’s a movie, like a show. Sometimes I forget I’m on the court,” Harden said. “One of the reasons why I’m here. He makes the game so easy for the rest of the team when he has it going like that.”\n\n\r\n                    Harden had 29 points, 14 assists and 13 rebounds, his ninth straight game with a double-double. The club record is 10.\n\n\r\n                    “That’s the type of offensive output we’re capable of. For us it’s the defense we’re trying to work with,” Nets coach Steve Nash said. “They’re a difficult team to guard … and I thought we slowed them down.”\n\n\r\n                    Hassan Whiteside had 26 points and 16 rebounds for the Kings. De’Aaron Fox added 19 points and eight assists.\n\n\r\n                    Brooklyn had seven players in double figures while Sacramento had six in a matchup between two of the NBA’s three worst defenses.\n\n\r\n                    “Unfortunate, but we knew this was going to be that type of test,” Kings coach Luke Walton said. “They’re not an easy team to stop, and as soon as we made mistakes … they turned them into 3, 3, 3 like that. Tough to beat a team when they hit 27 3s.”\n\n\r\n                    The Nets were again without Durant, who sustained a mild left hamstring strain Saturday against the Warriors after returning from a weeklong quarantine due to COVID-19 issues. Durant watched from the end of the bench. \n\n\r\n                    It didn’t matter much against the overmatched Kings.\n\n\r\n                    Brooklyn scored 74 points in the first half, led by as many as 28 and shot 58% overall. \n\n\r\n                    TIP-INS\n\n\r\n                    Nets: DeAndre Jordan was back in the lineup after sitting out Saturday’s win at Golden State for personal reasons. Jordan finished with 10 points and eight boards. ... Brooklyn set a franchise record with its eighth game of 130 points or more. ... It was the seventh time in 20 games with the Nets that Irving scored 30 or more. \n\n\r\n                    Kings: Marvin Bagley III had 19 points and seven rebounds after missing two games because of a sore left calf. … Sacramento scored 22 points in the paint during the first quarter. … Because of the back-to-back, Richaun Holmes was rested with a sore right knee. Cory Joseph started and scored a season-high 22 points. \n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Visit the Phoenix Suns on Tuesday. The teams split two games last season but this will be their only matchup this season.\n\n\r\n                    Kings: Host the Heat on Thursday before leaving for a five-game road trip. Sacramento hasn’t lost a home game to Miami since April 1, 2016.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997178.487324
}