{
  "game_id": "0021600637",
  "espn_id": "400900058",
  "date": "Jan 19, 2017",
  "matchup": "DAL @ MIA",
  "headline": "Dragic scores 32, Heat top Mavericks 99-95",
  "body": "MIAMI --  Just like in 2006 and 2011, the Miami Heat and Dallas Mavericks are essentially in the same place.\n\nDifferent spot in the standings, though.\n\nGoran Dragic had 32 points, Tyler Johnson scored 10 of his 23 in the fourth quarter and the Heat beat the Mavericks 99-95 on Thursday night, snapping Dallas' season-high three-game winning streak.\n\n\"Like an old-school Miami-Dallas game,\" Heat coach Erik Spoelstra said.\n\nHe said it with a smile, not entirely serious, of course. The stakes in Heat-Mavs games are far different now, with both teams languishing in the bottom half of their respective conferences and not going back and forth in the NBA Finals. But both franchises have been a bit better of late, providing hope for the second half.\n\n\"We worked hard for this, the whole team,\" Dragic said. \"We lost a lot of close games, but we're getting better in those close games and we feel like tonight we defended well, the ball was moving and we made the right plays.\"\n\nHassan Whiteside scored 13 and Dion Waiters added 12 for the Heat.\n\nDirk Nowitzki had 19 points for Dallas, which went 1 for 8 from the field during a late stretch of the fourth quarter and never got the lead again.\n\n\"It was a really tough stretch for us,\" Nowitzki said. \"We went from being up a couple to down seven or eight and then we put the starters back in or the other unit, so that was a bad stretch ... and after that we had to play catch-up.\"\n\nWesley Matthews scored 18 for the Mavericks, who got 15 apiece from Harrison Barnes and Seth Curry.\n\n\"It's not exactly 2011,\" Mavericks coach Rick Carlisle said. \"It's two franchises that are competitive, and that are playing a little better in recent games. It's a competitive game. We've had health issues. They've obviously had health issues.\"\n\nNowitzki made two of three free throws with 18.5 seconds left to get the Mavs within 95-92. The Heat needed to burn two timeouts before even getting the ball inbounded on the ensuing possession, and Johnson hit two from the line five seconds later to help seal the win.\n\nTIP-INS\n\nMavericks: J.J. Barea scored 13 points and has reached double figures in 11 of his 17 games this season. At 32, he's on pace to average more than 12 points a game for the first time. ... Dallas took only 11 free throws to Miami's 29.\n\nHeat: Miami improved to 3-21 when trailing at halftime. Dallas led 53-44 at the break. ... Okaro White made his NBA debut. He was signed to a 10-day deal earlier this week. ... Wayne Ellington got his 1,000th career rebound and is one 3-pointer shy of 500.\n\nPROMOTION ISSUE\n\nA fan avoided injury when a door -- depicting a hotel room door -- on a wheeled frame fell over during a promotion after the first quarter. The promotion had several fans slide hotel \"keys\" into the door, and the one that worked won a hotel stay. The floor was slightly damaged near midcourt.\n\nBOGUT CLOSER\n\nDallas center Andrew Bogut missed his fourth straight game with a right hamstring strain. He worked out on the court before the game and is improving, though he isn't expected to play Friday against Utah.\n\nUP NEXT\n\nMavericks: Host the Utah Jazz on Friday. Dallas is 0-7 on the second night of back-to-backs this season.\n\nHeat: Host the Milwaukee Bucks on Saturday. Miami is 1-1 against the Bucks, with both teams winning at home.",
  "source": "espn_api",
  "crawled_at": 1764996129.0943098
}