{
  "game_id": "0021800063",
  "espn_id": "401070744",
  "date": "Oct 25, 2018",
  "matchup": "DET vs. CLE",
  "headline": "Pistons still unbeaten after 110-103 win over Cleveland",
  "body": "DETROIT --  Dwane Casey has coached Detroit to its best start in a decade.\n\nHe's also well aware the Pistons have a long way to go.\n\n\"It's good for our team, good for our morale, but we know that there's bigger mountains to climb down the road,\" said Casey, who was hired to coach the Pistons this past offseason. \"We've just got to continue to work and improve and get better in certain areas.\"\n\nAndre Drummond had 26 points and 22 rebounds, and the Pistons remained unbeaten with a 110-103 victory over the Cleveland Cavaliers on Thursday night. Detroit is 4-0 for the first time since the 2008-09 season.\n\nCleveland, which was without injured star Kevin Love, fell to 0-5 for the first time since 2003-04, when LeBron James was a rookie.\n\nBlake Griffin scored 26 points in his first game since a 50-point night against Philadelphia on Tuesday. Reggie Jackson added 16 points for the Pistons.\n\nKyle Korver led Cleveland with 21 points.\n\n\"As competitors we want to win, but I thought there was some good out there tonight,\" Korver said. \"I thought we were playing with more energy, we passed the ball earlier in the shot clock, kept things going in motion, scrapped on defense, but it's hard to win in the NBA.\"\n\nThe Pistons scored the first six points of the game before the Cavaliers scored the next 11. Detroit went on a 12-0 run late in the second quarter and led 58-50 at halftime.\n\nDrummond  -- who was ejected in the win over the 76ers --  had 20 points and 20 rebounds through three quarters against Cleveland. The Pistons were up 12 heading into the fourth.\n\nThe Cavaliers cut the margin to six with 49 seconds left in the fourth when Korver made a 3-pointer while being fouled for a four-point play. Detroit was able to close the game out after that.\n\nThe Pistons have won their four games by a combined 13 points, and they haven't played too tough a schedule. Three of the victories were against the Nets, Bulls and Cavaliers.\n\nDetroit's next two games are against the Celtics.\n\n\"We can't get too excited,\" Drummond said. \"It's still early in the season, and we have a lot of games to go. So we've got to take them win by win and game by game and just keep getting better.\"\n\nINJURIES\n\nLove missed the game with a sore left foot, and Detroit lost Luke Kennard to a right shoulder injury after a Cleveland player set a screen on him in the second quarter. Casey said Kennard may have a sprain, and the team should know more Friday.\n\nIN RESERVE\n\nKorver was one of four Cleveland backups who scored in double figures.\n\n\"Thought our bench was great all night -- even in the first half, I thought they did a great job,\" coach Tyronn Lue said. \"Then coming back in the second half, I thought Kyle got going, Larry (Nance Jr.) was good. J.R. (Smith) was missing shots, but I liked his competing against Blake, fronting the post, got a couple steals and deflections.\"\n\nTIP-INS\n\nCavaliers: Cleveland's starting backcourt of George Hill and Rodney Hood had no assists Wednesday against Brooklyn . Those two combined for just one assist against Detroit.\n\nPistons: Jackson reached the 2,000-assist mark early in the first quarter, but he got in foul trouble and played only 6:16 in the first half. ... Detroit had 20 turnovers to Cleveland's nine, which snapped a 72-game streak in which the Pistons had forced at least 10 turnovers in each game.\n\nUP NEXT\n\nCavaliers: Host Indiana on Saturday night.\n\nPistons: Host Boston on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994724.5178308
}