{
  "game_id": "0022400535",
  "espn_id": "401705101",
  "date": "Jan 11, 2025",
  "matchup": "MEM @ MIN",
  "headline": "Morant hits tiebreaking shot with 18 seconds left as Grizzlies beat Timberwolves 127-125",
  "body": "MINNEAPOLIS -- — Ja Morant made a tiebreaking jumper with 18 seconds left, Jaren Jackson Jr. scored 33 points and the Memphis Grizzlies beat the Minnesota Timberwolves 127-125 on Saturday night in a game that was tight from start to finish.\n\n\r\n              Morant finished with just 12 points, but he had the tying basket with 54 seconds to go before his 11-footer for the lead. Desmond Bane had 21 points for Memphis, going 4 for 8 from 3-point range. \n\n\r\n              Anthony Edwards missed two 3-pointers in the final 7.3 seconds of a game in which neither team led by more than six and featured 25 lead changes. \n\n\r\n              Donte DiVincenzo scored a season-high 27 points for Minnesota. Jaden McDaniels added 21 and Edwards scored 15 for the Wolves, whose three-game winning streak ended.\n\n\r\n              Takeaways\r\n              Grizzlies: Rookie Jaylen Wells was once again tasked with defending the opponent's top player, as he guarded Edwards for most of the game. Wells held his own against Edwards and added 13 points on the offensive end.\n\n\r\n              Timberwolves: Saturday was the fourth straight game with a new-look starting lineup that included DiVincenzo starting and veteran Mike Conley coming off the bench. Minnesota is now 3-1 since coach Chris Finch made the lineup switch.\n\n\r\n              Key moment\r\n              Minnesota had the ball with the game tied at 125 and under a minute to play but Julius Randle turned the ball over. It was the 19th turnover of the game by the Wolves, and perhaps the most costly.\n\n\r\n              Key stat\r\n              Memphis took 108 shots to Minnesota's 83, thanks in large part to 21 offensive rebounds. Rookie center Zach Edey had seven offensive boards.\n\n\r\n              Up next\r\n              The Grizzlies visit Houston on Monday while the Timberwolves play at Washington on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997733.91573
}