{
  "game_id": "0022300332",
  "espn_id": "401584960",
  "date": "Dec 15, 2023",
  "matchup": "HOU @ MEM",
  "headline": "Dillon Brooks scores 26, keys rally in 2nd half as Rockets defeat Grizzlies 103-96",
  "body": "MEMPHIS, Tenn. -- — Dillon Brooks scored 24 of his 26 points in the second half as the Houston Rockets overcame an early double-digit deficit and beat the Memphis Grizzlies 103-96 on Friday night.\n\n\r\n              Brooks, who was making his return to Memphis after being traded to Houston in the offseason after six seasons with the Grizzlies, was 1 of 9 in the first half. He keyed a second-half comeback and hit a 3-pointer with 40 seconds left for a 99-94 lead as the Rockets won their fifth straight. He also stole an inbounds pass later, sealing the Houston win.\n\n\r\n              “I knew we needed to get back in the game, and I was missing a lot of 3s,” Brooks said. “I knew when I started knocking down one, the confidence will come. I held the follow though, and it felt good. Then I started getting it rolling.”\n\n\r\n              Fred VanVleet had 16 points and eight assists for Houston, and Alperen Sengun finished with 15 points.\n\n\r\n              Desmond Bane led Memphis with 28 points and a career-high 13 rebounds. Jaren Jackson Jr. finished with 22 points and four blocks as Memphis dropped to 1-10 at home. Vince Williams Jr. and Santi Aldama finished with 11 points each.\n\n\r\n              “Give them credit,” Bane said. “They had a few guys play well. Really a balanced attack. Had some guys step up off the bench. ... They played well and made shots down the stretch.”\n\n\r\n              The Rockets had won the first two games in the season series, including a 117-104 defeat of Memphis on Wednesday night in Houston. This time, Memphis jumped to a 17-point lead in the first half, but Houston whittled away late in the half and into the third quarter.\n\n\r\n              Asked what he told his team, Rockets coach Ime Udoka said: “Wake up, and act like you want to be at the game.”\n\n\r\n              “We clawed our way back into it,” Udoka said. “It looked like we came out flat, but that's been the case the last (few) games.”\n\n\r\n              By late in the third quarter, behind a defensive scheme that took Memphis out of sync offensively, the Rockets had erased their deficit and carried a 75-74 lead into the fourth.\n\n\r\n              “It started at the beginning of the the third (period),” Memphis coach Taylor Jenkins said. “We just couldn’t get a rhythm going offensively, and they went on a run. They just found a groove on the offensive side.”\n\n\r\n              Memphis has worked with a thin lineup most of the season due to injuries to key starters and the 25-game suspension of Ja Morant, last year's leading scorer. That suspension ends on Tuesday, but the Grizzlies have struggled mightily at the start of the season. Before Friday's game, Memphis had won once at home and was mired in a three-game losing streak.\n\n\r\n              Then backup point guard Derrick Rose left the game in the first half with left hamstring soreness.\n\n\r\n              Morant addressed the media earlier Friday for the first time since the league handed down the suspension. His first game back will be against Zion Williamson, the player taken No. 1 overall before Memphis took the guard. Morant said he will start by trying to do whatever he can to help the Grizzlies win.\n\n\r\n              Houston endured a tough shooting first half, under 30% at the midway point of the second quarter. But while the Memphis' lead reached 17 points, Houston stayed close as the Grizzlies took a 55-45 advantage to the break.\n\n\r\n              The game changed in the second half behind Brooks' shooting.\n\n\r\n              The homecoming for Brooks included a tribute video during a timeout in the first quarter. Brooks said the recognition meant a lot to him and that it “felt like I was right back at home. The emotions and everything were there.”\n\n\r\n              But, in typical Brooks fashion as the tough-nosed defender and well-known bad boy of the league, he didn't let the emotions change his competitiveness.\n\n\r\n              “I don't ever want to lose to Memphis,” he said.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: At Milwaukee on Sunday.\n\n\r\n              Grizzlies: At Oklahoma City on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995623.269566
}