{
  "game_id": "0022001074",
  "espn_id": "401307888",
  "date": "May 16, 2021",
  "matchup": "OKC vs. LAC",
  "headline": "Pokusevski scores 29, Thunder top Clippers in season finale",
  "body": "OKLAHOMA CITY -- — Aleksej Pokusevski scored a career-high 29 points, and the Oklahoma City Thunder defeated the Los Angeles Clippers 117-112 on Sunday night in the regular-season finale for both teams.\n\n\r\n                    It was a promising close to the season for the 7-foot rookie from Serbia.\n\n\r\n                    “To think about where he was at the beginning of the season and then the way he played now is a true, tangible example of a player developing,” Thunder coach Mark Daigneault said. \n\n\r\n                    Josh Hall, a two-way player who had never scored more than 10 points in an NBA game, had career highs of 25 points and 10 rebounds for Oklahoma City.\n\n\r\n                    “Josh Hall — the guy was hurt the entire season. It’s his first year as a pro, he’s on a two-way contract,\" Daigneault said. \"It’s a pretty unstable existence when you’re an undrafted rookie and you’re injured all season. So for him to go out there tonight and play the way he did is just a really, really cool thing for that guy and is a credit to all the work he put in.”\n\n\r\n                    Moses Brown had a career-best 24 points and grabbed 18 rebounds for the Thunder, who snapped a nine-game losing streak. Oklahoma City finished in a tie for the league's fourth-worst record.\n\n\r\n                    Los Angeles sat stars Kawhi Leonard and Paul George for the second straight game. Terance Mann scored 19 points, two-way player Jay Scrubb scored 14 and rookie Daniel Oturu added career highs of 13 points and 12 rebounds for the Clippers, who claimed the No. 4 seed in the Western Conference and will play the Dallas Mavericks in the first round of the playoffs. \n\n\r\n                    Clippers coach Tyronn Lue was already looking ahead to facing All-Star Luka Doncic.\n\n\r\n                    “We know we’re playing a guy who controls the whole tempo of the game in Luka — by scoring, rebounding, passing, making his teammates better,” Lue said. “We know he’s the head of the snake and it’s going to be a tough challenge.”\n\n\r\n                    Pokusevski's 3-pointer with 48.8 seconds left gave the Thunder a 115-112 lead. The Thunder held defensively, then Brown's putback dunk off a miss by Pokusevski with 5.4 seconds to play put the game away.\n\n\r\n                    “I’m happy for our guys, especially the guys who finished the game,\" Daigneault said. \n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: C Ivica Zubac played six seconds, then intentionally committed a foul and left the game for good. He is the only Clipper to play every game this season. ... Forwards Marcus Morris and Nicolas Batum and guard Rajon Rondo did not play and were not on the injury report. ... Center DeMarcus Cousins sat out with a sore left foot.\n\n\r\n                    Thunder: Guard Charlie Brown Jr. was signed to a multiyear deal Saturday. He had previously signed two 10-day contracts. ... Pokusevski scored 13 points on 5-for-5 shooting in the first quarter. ... Guard Lu Dort sat out with right patellar tendinitis. ... Starting forward Darius Bazley did not play. He was not on the injury report. ... The Clippers’ bench scored 72 points. \n\n\r\n                    STAT LINES\n\n\r\n                    The Clippers set a franchise record by committing just three turnovers, and the starting lineup didn’t commit any. Los Angeles had two turnovers in the first half and one in the second. Jaylen Hoard had Oklahoma City's only steal. \n\n\r\n                    Lue joked that he wished he could get those numbers out of his regular starters, then commended his reserves.\n\n\r\n                    “I thought our young guys did a great job,\" Lue said. \"They played hard, competed. It’s good to see those guys on the floor like that.”\n\n\r\n                    FAMILIAR SETTING\n\n\r\n                    Several Clippers players were former Thunder players. Serge Ibaka had 12 points and seven rebounds in 18 minutes. Reggie Jackson scored six points in seven minutes. Patrick Patterson scored 10 points in 42 minutes. \n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Will play the Dallas Mavericks in the first round of the Western Conference playoffs.\n\n\r\n                    Thunder: Season over.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997058.580022
}