{
  "game_id": "0022200794",
  "espn_id": "401468949",
  "date": "Feb 04, 2023",
  "matchup": "PHX @ DET",
  "headline": "Ayton has 31 points and 16 rebounds, Suns beat Pistons",
  "body": "DETROIT -- — Deandre Ayton had 31 points and 16 rebounds to help the Phoenix Suns beat the Detroit Pistons 116-100 on Saturday night.\n\n\r\n              The surging Suns have won eight of 10 games, including a victory at Boston on Friday night, and have help on the way with Devin Booker nearing his return. The three-time All-Star guard has been out since Christmas with a groin injury, but dunked in warmups in another sign that he's close to coming back.\n\n\r\n              “I wouldn’t read too much into it,\" said Suns coach Monty Williams, who didn't want to speculate on the chances Booker will play Tuesday night at Brooklyn.\n\n\r\n              Phoenix started each half strong, leading 13-3 in the opening minutes and scoring the first eight points after halftime, to take and keep control against Detroit.\n\n\r\n              “It was huge because they set the tone,\" Pistons coach Dwane Casey said.\n\n\r\n              Chris Paul had 14 assists for the Suns' balanced offense that didn't need him to make shots, finishing 0 for 7 and without a field goal for the first time since March 18, 2017, when he helped the Los Angeles Clippers beat Cleveland by 30 points. \n\n\r\n              “It’s a great lesson that you don’t have to score to have an impact on the game,\" Casey said.\n\n\r\n              Mikal Bridges scored 24 points, Cameron Johnson had 20 points and Torrey Craig added 14 points for Phoenix.\n\n\r\n              “You don’t win eight out of 10 without moving in a good direction, but satisfied is probably not a word that I would ever use,” Williams said.\n\n\r\n              Johnson had a knee injury in November and has been working his way back into game shape since returning to the lineup two weeks ago.\n\n\r\n              “When he’s knocking down shots, it just gives everyone more room to operate,\" Williams said.\n\n\r\n              Bojan Bogdanovic scored 23 points for the Pistons, who are vying with Houston to have the No. 1 pick in the NBA draft and a shot to select 7-foot-3 French phenom Victor Wembanyama.\n\n\r\n              Detroit reserve Saddiq Bey had 25 points, Isaiah Stewart had 17 points and nine rebounds while rookie Jaden Ivey added 13 points and six assists. \n\n\r\n              Like Phoenix, the Pistons were coming off a win and playing on consecutive days.\n\n\r\n              “When you think you’re tired, you make mental mistakes and it turns into physical mistakes,\" Casey said.\n\n\r\n              STUNG BY SNUB\n\n\r\n              Williams is bothered that Booker, who he called one of the world's best players, was not selected to play in the All-Star Game.\n\n\r\n              “The fact that the fans have that much input on it doesn't make sense,\" Williams said. “He's the best two-guard in the league.\"\n\n\r\n              TIP-INS\n\n\r\n              Suns: Incoming team owner Mat Ishbia, who lives in suburban Detroit, was courtside in his usual seats near the visitors' bench at Little Caesars Arena with his three children wearing Suns gear. The former Michigan State walk-on guard agreed to purchase the Suns and Phoenix Mercury for $4 billion in December, and sale is still in the process of being completed.\n\n\r\n              “He stuck his neck out to buy our ballclub and we’re happy to have a leader like that,\" Williams said.\n\n\r\n              Pistons: Stewart missed all five of his 3-pointers in the first half, extending his streak without a make beyond the arc to 18 shots over seven-plus games. The power forward made all three of his 3-point attempts in the third quarter to end the drought.\n\n\r\n              “When we got opportunities to shoot 3s, we have to shoot them,\" Stewart said. “It’s frustrating because in practice, I hit like 10 in a row. Hopefully, this is a start of a great run for me.\"\n\n\r\n              UP NEXT\n\n\r\n              Suns: Play the Nets on Tuesday night in middle of five-game trip.\n\n\r\n              Pistons: Host Boston on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995074.021315
}