{
  "game_id": "0021600230",
  "espn_id": "400899680",
  "date": "Nov 25, 2016",
  "matchup": "DET vs. LAC",
  "headline": "Pistons hand Clippers first road loss with 108-97 win",
  "body": "AUBURN HILLS, Mich. --  Stan Van Gundy has been waiting all season for his Detroit Pistons to show the kind of determination that got them into the playoffs.\n\nFriday night, he got a glimpse.\n\nThe Pistons blew an 18-point lead in the third quarter, but rallied down the stretch to beat the Los Angeles Clippers 108-97.\n\nDetroit had lost 11 straight to the Clippers, including a 114-82 rout at the Staples Center on Nov. 7.\n\n\"We got embarrassed the last time we played that team, and I knew these guys didn't want that to happen again,\" Van Gundy said. \"But beating that team is going to take 48 minutes of effort and we haven't been able to do that many times this season.\"\n\nDetroit won its second straight and improved to 7-2 at home, as opposed to 1-7 on the road.\n\n\"I'm very happy with the way we played tonight, but we have to be able to take this level of effort on the road,\" Van Gundy said. \"We've got four road games in the next seven days against really good teams. We can't keep giving those games away.\"\n\nThe Clippers lost for just the second time in 13 games, falling to 7-1 on the road.\n\n\"Give the Pistons credit; Stan really had them ready to play,\" Clippers coach Doc Rivers said. \"They came out with so much more energy that we did in the first 10 minutes, and it is tough to dig yourselves out of a big hole on the road.\"\n\nKentavious Caldwell-Pope had 16 points and a career-high 10 assists for Detroit and Andre Drummond had 16 points and 10 rebounds. The Pistons got at least 15 points from all five starters and Jon Leuer added 11 points and 11 rebounds off the bench.\n\n\"We are really starting to come together,\" Drummond said. \"We are more in sync defensively, and the offensive is starting to come around.\"\n\nJ.J. Redick and Blake Griffith each had 24 points for the Clippers, while Chris Paul had eight points to go with 15 assists.\n\n\"This wasn't a lack of effort,\" Paul said. \"We were energized, but they made shots.\"\n\nThe Pistons trailed by as many as 43 earlier this month in Los Angeles, but jumped out to a 31-14 lead in Friday's first quarter. However, with Drummond limited to 8:19 in the first half by foul trouble and Morris playing just 3:42, the Clippers were able to pull within 57-48 at halftime.\n\nThe Pistons built the margin to as many as 18 early in the third, with Caldwell-Pope finding Drummond for several alley-oops. However, Redick took over the game, scoring 10 points in the final 1:27 of the quarter. His back-to-back 3-pointers pulled the Clippers within 82-80 at period's end.\n\n\"We cut into their lead at the end of the third quarter, but we were still making mistakes,\" Rivers said. \"When you are that far behind, you have to play perfect basketball or you use up everything getting it close.\"\n\nRedick finished with 18 in the quarter.\n\n\"He did all that against a really good defender in KCP,\" Van Gundy said. \"I was sitting on the bench wondering how I didn't win 65 games a year when I was coaching him in Orlando.\"\n\nLos Angeles scored the first four points of the fourth to take the lead, but stopped hitting shots. That let the Pistons respond with a 15-2 run, capped off by Caldwell-Pope's 3-pointer to make it 97-86 with 5:14 to play.\n\n\"We didn't panic,\" Caldwell-Pope said. \"We just kept doing what we had been doing all game, and kept trying to make J.J. work.\"\n\nTIP-INS\n\nClippers: Paul didn't score in the second half, but put up 10 assists. ... With the Pistons moving to Little Caesars Arena for the 2017-18 season, this was the Clippers' final regular-season visit to the Palace of Auburn Hills.\n\nPistons: Guard Stanley Johnson was suspended for one game after an unspecified violation of team rules. That left the Pistons without three rotation guards, as both Reggie Jackson and Reggie Bullock missed the game with left knee injuries.\n\nPLAY MAKER\n\nWith Jackson not expected to play his first game until next week, Caldwell-Pope was the first Detroit player to reach double figures in assists in a game.\n\nVISITING CELEBRITY\n\nDuring a timeout, the Palace scoreboard showed Darius Slay's interception of Sam Bradford's pass that helped the Detroit Lions beat the Minnesota Vikings 16-13 on Thanksgiving. Slay, one of several Lions in attendance, then autographed a football and tossed it to the crowd.\n\nUP NEXT\n\nClippers: Visit the Indiana Pacers on Sunday.\n\nPistons: Visit the Oklahoma City Thunder on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764996076.672996
}