{
  "game_id": "0021901256",
  "espn_id": "401224731",
  "date": "Aug 04, 2020",
  "matchup": "MIL vs. BKN",
  "headline": "Giannis watches in 2nd half as Nets beat Bucks 119-116",
  "body": "LAKE BUENA VISTA, Fla. --  Timothe Luwawu-Cabarrot hit back-to-back 3-pointers to put Brooklyn ahead to stay, and the Nets beat Milwaukee 119-116 on Tuesday to keep the Bucks from clinching the top seed in the Eastern Conference.\n\nLuwawu-Cabarrot finished with a career-high 26 points. Garrett Temple scored 19, Tyler Johnson and Justin Anderson each had 11 and Rodions Kurucs and Chris Chiozza had 10 apiece.\n\n\"We didn't have our best four out there, so obviously it's an opportunity for everybody coming up and next man up mentality,\" Luwawu-Cabarrot said.\n\nGiannis Antetokounmpo scored 16 points playing only the first half for Milwaukee, which has lost two of three seeding games. Kyle Korver scored 13 points, and Ersan Ilyasova had 12 points and 10 rebounds. Frank Mason III added 11 points.\n\nMilwaukee coach Mike Budenholzer wanted to get some of his Bucks rest at this point in the schedule.\n\n\"Thursday or whenever it is we play Miami we'll be back to something more what I guess you'd consider normal and continue to build toward the start of the playoffs,\" Budenholzer said.\n\nThe Bucks sounded eager to forget this loss.\n\n\"We've got to move on,\" said guard Eric Bledsoe, who made his bubble debut. \"Things like this happen. It happened last year. No one's perfect. We've got a great team, but no one's perfect.\"\n\nThe Nets have a patchwork lineup but are fighting Orlando for seventh place in the East and putting more distance between ninth-place Washington as they try to avoid a play-in for the final postseason spot.\n\nBrooklyn led 94-88 at the start of the fourth, and the Bucks went on a 16-10 run to take their first lead of the second half at 107-104 on a 3-pointer by D.J. Wilson with 5:31 left. Sterling Brown's 3 with 3:56 to play put the Bucks up 110-107.\n\nChiozza scored on a reverse layup, then Luwawu-Cabarrot hit a 3 with 2:59 left to put the Nets ahead to stay. He added a second with 2:31 to go. Korver hit a long jumper with 1:48 left, but it was ruled two points and not a 3 that would have tied it at 115.\n\nLuwawu-Cabarrot played 31 minutes and was 8 of 12, including 5 of 7 from 3-point range. Nets coach Jacque Vaughn said they've been trying to find the right role for the guard.\n\n\"Hopefully, we found a sweet spot for him,\" Vaughn said. \"Seems like he's in a good rhythm. We'll continue to put him in positions where he can take advantage of his speed and shooting ability.\"\n\nMilwaukee appeared ready to clinch from the opening tip as the Bucks scored eight of the first 10 points and hit 7 of 14 beyond the arc. The Nets led 40-34 at the end of the first quarter and 73-65 at halftime.\n\nTIP-INS\n\nNets: With a playoff spot all but wrapped up, they rested C Jarrett Allen, G/F Joe Harris and G Caris LeVert, who scored 34 points in a win over Washington on Sunday. That allowed Jamal Crawford, 40, to make his debut and become the oldest active player in the NBA after being signed as a replacement player. Crawford checked in with 4:35 left in the first quarter. He left early in the second with an injured left hamstring and didn't return. This was his first NBA game since April 2019.\n\n\"We'll get him diagnosed and see what happens from there,\" Vaughn said. \"I'm telling you, I love having him around. It was awesome to see him on the floor tonight, and I look forward to him being on the floor again.\"\n\nBucks: G Wesley Matthews sat out with a sore right calf with starting center Brook Lopez also out. But G Pat Connaughton joined Bledsoe in making their debuts inside the bubble. Both played 18 minutes and scored eight points each.\n\nHEY DADDY\n\nAntetokounmpo had his baby son on hand at the NBA bubble for this game. Liam made an appearance on the screen behind the Bucks' bench as a virtual fan. That might have been why the reigning NBA MVP got mad at Nets center Donta Hall when he was pushed to the floor early in the second quarter with both players given a foul.\n\nSTAT WATCH\n\nThe Nets made 14 3s in the first half for their best half all season beyond the arc and finished with 21 of 57. ... Brooklyn's best first quarter came March 6 when the Nets scored 41 points against San Antonio, but the Nets tied their second-best with 40. ... The Bucks turned it over 19 times.\n\nUP NEXT\n\nNets: Play Boston on Wednesday night.\n\nBucks: Play Miami on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996122.190148
}