{
  "game_id": "0022000064",
  "espn_id": "401267224",
  "date": "Dec 31, 2020",
  "matchup": "ORL vs. PHI",
  "headline": "Torrid shooting helps 76ers rout previously unbeaten Magic",
  "body": "ORLANDO, Fla. -- — Joel Embiid had 21 points and nine rebounds in three quarters and the Philadelphia 76ers handed the Orlando Magic their first loss with a 116-92 victory Thursday night.\n\n\r\n                    Off to a 4-0 start for the first time in franchise history, the Magic never had much of a shot at a fifth win because of the surprising outside shooting of the 76ers, who even got a 3-pointer from Ben Simmons.\n\n\r\n                    Philadelphia, which entered the game 27th in the NBA in 3-point accuracy, made eight of its first 12 attempts from beyond the arc and built a first-half lead as large as 37 points.\n\n\r\n                    Seth Curry added 21 points and five 3-pointers, and Tobias Harris chipped in 20 points, nine rebounds and three 3-pointers for Philadelphia (4-1), which had 38 first-quarter points and 75 by halftime. \n\n\r\n                    \"Tonight, we did a good job of moving that ball around and mixing it up with 3-point shots off the double teams and driving the basketball,’’ said Curry, who made seven of 12 shots and five of seven 3-point shots. \n\n\r\n                    The Sixers made a season-high 15 3-pointers. Simmons, who sank just the third 3-pointer of his career in the first quarter, finished with nine points, 10 rebounds and eight assists.\n\n\r\n                    \"We know we have a lot of potential and ways to grow, but to be 4-1 already is good,’’ Curry said. \n\n\r\n                    The Magic (4-1) were the NBA’s last undefeated team. Nikola Vucevic finished with 19 points and 10 rebounds for the Magic, while rookie guard Cole Anthony scored 16 points off the bench.\n\n\r\n                    \"We’re not putting enough into guarding the ball and helping. We’re not,’’ Magic coach Steve Clifford said. \"Things that we’ve been very good at for two years we’re not doing, and that’s the hard things.’’\n\n\r\n                    Orlando was without reserve guard Terrence Ross — its leading scorer at 21 points per game — because of a right hamstring irritation. The Magic also lost starting guard Evan Fournier eight minutes into the game because of back spasms. He had three points and two assists and watched the lopsided second half from the bench.\n\n\r\n                    Already up 38-22 after one quarter, the Sixers made 14 of 22 shots and four of seven 3-pointers in the second period to build their lead to as large as 72-35 late in the opening half. Harris and Curry each hit three 3-pointers in the early going, while Matisse Thybulle sank two shots from beyond the arc in the first half.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Dwight Howard, who starred in Orlando from 2004-12, was booed when he first checked into the game and fans derisively cheered when he picked up his first foul nine seconds later. Howard drilled Philadelphia’s 14th 3-pointer of the game — and the 10th of his 17-year NBA career — in the fourth quarter. Howard had seven points and five rebounds in 14 minutes. … Thursday’s game was Philadelphia’s second of the season with fans in attendance. Sixers coach Doc Rivers said he was \"surprised’’ at the number of \"mask-less’’ citizens walking around downtown Orlando a day earlier. Asked if he felt safe, Rivers said, \"I do in the arena. You go from state to state, but you still have the same NBA protocols and that’s really important.’’\n\n\r\n                    Magic: James Ennis III, who the Magic acquired last February in a trade with Philadelphia, went through drills on Thursday and Clifford said the forward is close to returning. \n\n\r\n                    UP NEXT\n\n\r\n                     76ers: Host Charlotte on Saturday night.\n\n\r\n                     Magic: Host Oklahoma City on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764997812.94831
}