{
  "game_id": "0021400020",
  "espn_id": "400578312",
  "date": "Oct 30, 2014",
  "matchup": "OKC @ LAC",
  "headline": "Blake Griffin clutch as Clippers upend Thunder; Russell Westbrook hurt",
  "body": "LOS ANGELES -- The Clippers didn't shoot well, couldn't build more than a 10-point lead and still managed to usher in the Steve Ballmer era with a victory for their new owner.\nBlake Griffin scored 23 points, making two free throws with five seconds left, and Chris Paul added 22 in a season-opening 93-90 win Thursday over the Oklahoma City Thunder, who lost another star to injury when Russell Westbrook broke his right hand.\n\"It was pretty ugly,\" Clippers coach Doc Rivers said. \"We have 81 more games to fix it.\"\n\nLos Angeles hardly resembled its new ad campaign of \"Be Relentless\" early on, when the Thunder scored the game's first eight points as Ballmer cupped his hands and yelled to his team from his baseline seat near the bench.\nHe paid a record $2 billion to buy the team after 33-year owner Donald Sterling was banned for life by the NBA for racist remarks. The Thunder sent the Clippers packing in the second round of the playoffs last spring, shortly after the Sterling scandal erupted.\n\"What I was proud of, they kept fighting defensively,\" Rivers said. \"I don't know that we win this game last year.\"\nAlready without the injured Kevin Durant, the Thunder lost Westbrook to a small fracture in his right hand in the second quarter. He left Staples Center wearing a soft cast on his hand and didn't talk with reporters. He will be reassessed Friday.\n\"It's unfortunate the way it is right now, but we have to figure out how to get better from all of our experiences,\" Thunder coach Scott Brooks said. \"Good teams and good players bounce back from adversity, and our guys understand that.\"\nPerry Jones scored a career-high 32 points, making nine of 11 free throws. The Thunder are 0-2, having dropped their opener a night earlier at Portland.\nSerge Ibaka's 3-pointer at the buzzer went off the rim. He finished with 17 points.\nWestbrook appeared to hurt his hand while going for a rebound in a crowd. He didn't return, and finished with two points and four assists in nine minutes. He also had a verbal exchange with a fan while exiting through the tunnel.\n\"I'm just glad we all fought and didn't give up despite the injury,\" Jones said. \"I don't know why it's going on, but all we can do is play our hearts out and keep fighting until everybody gets back.\"\nThe Thunder cut the deficit to four points on a 3-pointer by Ibaka with 4½ minutes left in the game. J.J. Redick answered with a 3-pointer after missing his first seven shots to extend the Clippers' lead to 89-82.\nDuring a timeout, the video board flashed to Ballmer, his face contorted and his hands clapping furiously as fans cheered. In wrinkled khaki pants and a checkered shirt and with his credential hung around his neck, Ballmer looked like an average fan.\n\nThe Thunder cut it to one, and after their 27th turnover, Sebastian Telfair fouled Paul, who missed both free throws with 13 seconds to go.\n\"I will be here early to shoot some,\" Paul said.\nTelfair forced up an out-of-control shot that missed, and Steven Adams fouled Griffin in a scramble for the ball with five seconds left. Griffin hit both free throws, which the Clippers needed because Nick Collison got fouled and made both to cut it to 91-90 with four seconds to go.\nGriffin fouled out after he and Ibaka were called for double fouls. Redick made up for his earlier misses when he went to the line and hit both free throws for a 93-90 lead with two seconds left.\nThe Clippers shot 39 percent from the floor and got outrebounded 47-33.\n\"We had to defend in order to win the game,\" Paul said. \"That's what great teams are built off of, defense and rebounding.\"\nSterling's estranged wife, Shelly, was in her usual midcourt seat. She retained it, along with some other perks, and was given the title of \"owner emeritus\" by Ballmer as part of the sale. New NBA commissioner Adam Silver, who banned Donald Sterling, was applauded when he was introduced after the first quarter.\nOklahoma City's early lead took the home crowd out of it moments after the pregame hype ended. Before the Clippers were introduced, they stood watching a video that proclaimed it a new time in franchise history.\nQUOTE OF THE NIGHT\n\"I don't have a KD countdown every day,\" Brooks said.\nTIP-INS\nThunder: G Reggie Jackson (right ankle sprain) and G Jeremy Lamb (lower back sprain) sat out. Durant sat on the bench, wearing a walking boot with his black suit.\nClippers: F Glen Davis is out with a strained right groin, but he ran Thursday and could return next week. ... Paul had seven assists to pass Hall of Famer John Havlicek for 28th on the career list with 6,119. ... They improved to 21-24 on opening night.\nUP NEXT\nThunder: Host Denver on Saturday in their home opener.\nClippers: Are the designated visiting team against the Lakers on Friday.",
  "source": "espn_api",
  "crawled_at": 1764991949.9673758
}