{
  "game_id": "0022200391",
  "espn_id": "401468546",
  "date": "Dec 10, 2022",
  "matchup": "CHI vs. DAL",
  "headline": "DeRozan, Bulls rout Luka-less Mavericks, 144-115",
  "body": "CHICAGO -- — DeMar DeRozan had 28 points and nine rebounds and the Chicago Bulls took advantage of NBA scoring leader Luka Doncic's absence to rout the Dallas Mavericks 144-115 on Saturday night.\n\n\r\n              Doncic sat out with a strained right quadriceps. Swingman Josh Green also was out with a right elbow sprain and forward/center Maxi Kleber missed the game because of a sore right foot. Doncic had 33 points and 11 assists in the Mavericks’ 106-105 home loss to Milwaukee on Friday night.\n\n\r\n              Nikola Vucevic added 20 points and eight rebounds and Ayo Dosunmu had 17 points to help Chicago win its second straight game. Zach LaVine, Patrick Williams and Derrick Jones Jr. scored 16 points and the Bulls shot a season-high 63.5% from the floor in their biggest-offensive output of the season.\n\n\r\n              “You're not going to always shoot the ball like that, but the nights you do you appreciate them,” LaVine said. (The Mavericks) did come up with a crazy back-to-back where they got here late, but you've got to take advantage it it. I think we did that.\"\n\n\r\n              Just about all the Bulls players pitched in.\n\n\r\n              “We scored 144 points at it was spread around,” Bulls coach Billy Donavan said. “Zach and Vuce and DeMar are unselfish players that when they don't have it, they'll move it and it certainly gets other guys involved.”\n\n\r\n              Spencer Dinwiddie had 27 points for Dallas and Christian Wood added 21. The Mavs dropped their second game in two nights after winning three straight, allowing the most points in a game this season.\n\n\r\n              The Mavericks were pressed into a quick turnaround against the Bulls and their fatigue showed on both sides of the ball. Their flight to Chicago arrived at about 3 a.m.\n\n\r\n              Chicago came out flying early to force turnovers and fast breaks to set the tone.\n\n\r\n              “We got off to a real good start,” Donovan said. \"I thought we played really well on both ends.\n\n\r\n              The Bulls lead 82-53 at the halftime, setting a team record for points in a first half. Chicago fell just short of its record of 86 points in either half, set in 1990 in a second frame against Phoenix.\n\n\r\n              “We had three of the top eight (players) out tonight, but that means others get the opportunity,” Dallas coach Jason Kidd said. “But if you give up 82 points in the first half, it's going to be hard to beat anybody.”\n\n\r\n              LOVE CELEBRATES 80TH BIRTHDAY\n\n\r\n              Bob Love, a star of the Bulls' early teams for nine seasons starting in 1968, was in a United Center suite to celebrate his 80th birthday. The three-time All-Star was the second Bulls player to have his number retired.\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Coach Jason Kidd said before the game he expects updates Doncic, Green and Kleber on Monday. … G Kemba Walker played for the first time since signing with the Mavs on Nov. 29.\n\n\r\n              Bulls: LaVine said he plans to play in Atlanta on Sunday. The star guard has been held out of the the second of Chicago’s four back-to-back games three times this season as he continues to manage left knee injury. … G Alex Caruso left the game with bruised tailbone and is day-to-day. ... G Javonte Green missed his third game with a knee contusion. \n\n\r\n              UP NEXT:\n\n\r\n              Mavericks: Host Oklahoma City on Monday night.\n\n\r\n              Bulls: At Atlanta on Sunday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994293.847254
}