{
  "game_id": "0022200743",
  "espn_id": "401468898",
  "date": "Jan 28, 2023",
  "matchup": "DET vs. HOU",
  "headline": "Rockets beat Pistons 117-114 in matchup of NBA's worst teams",
  "body": "DETROIT -- — Kenyon Martin Jr. had a four-point possession with 31 seconds left to help the Houston Rockets beat the Detroit Pistons 117-114 on Saturday night in a matchup of the NBA's worst teams.\n\n\r\n              The Rockets had a 16-8 advantage in offensive rebounds, a 21-4 edge in second-chance points and outscored the Pistons 70-42 in the paint. \n\n\r\n              Houston played without Jalen Green (calf), Kevin Porter, Jr. (foot) and Apleren Sengun (non-COVID illness), while coach Stephen Silas missed the game to attend a memorial for his father Paul, who played and coached in the NBA for 48 years.\n\n\r\n              “I would say 98% of this win came from hustle and hard work,” Rockets interim coach John Lucas said. “With three key scorers out, I think a lot of guys were excited because the ball would be moving and they would get a chance to play.\n\n\r\n              “Coach has already texted us about getting a good win. Today was a celebration of his dad's life, but I hope this made it a little easier.”\n\n\r\n              Eric Gordon led the Rockets (12-38) with 24 points. Martin had 15 points and 13 rebounds, and Tari Eason added 16 points and 10 rebounds.\n\n\r\n              “This is a really good road win,” Martin said. “We got some stops, made some plays and now we can get out of this cold and get back home.”\n\n\r\n              Alec Burks had 21 points for the Pistons (13-38). They have lost five of six.\n\n\r\n              “It seems like all these games come down to the end, but it is all the small things that we aren't doing earlier in games that hurt us,” Pistons coach Dwane Casey said. “We aren't a good enough team to take anyone lightly. We can't do that.\"\n\n\r\n              With the Pistons leading 112-109, Martin was fouled as his layup bounced twice off the rim before dropping in. He missed the free throw, but Jae'Sean Tate kept the ball alive and Martin's putback gave the Rockets a 113-112 lead.\n\n\r\n              “Coaches start teaching you to box out on free throws in junior high,” Casey said. “In that situation, you almost have to be face guarding, because you know they will be crashing with a bad free-throw shooter on the line.”\n\n\r\n              Jabari Smith Jr. then tied up Burks, and the Rockets won the jump ball.\n\n\r\n              Gordon hit two free throws to make it 115-112, but Jalen Ivey's layup spun in to make it a one-point game with 10 seconds to go.\n\n\r\n              Gordon added two more free throws, making it 117-114, and Ivey's tying 3-point attempt was off the rim.\n\n\r\n              The Rockets were 3-of-20 on 3-pointers in the first 39 minutes but made five in a row to stay alive in the fourth quarter.\n\n\r\n              “We normally struggle in the fourth quarter by turning the ball over and getting pushed around,” Lucas said. “This time, we didn't let that happen.”\n\n\r\n              TIP INS\n\n\r\n              Rockets: Houston has won three straight in Detroit, but is still just 21-49 in the Motor City. However, they are 49-22 at home against the Pistons.\n\n\r\n              Pistons: Detroit was trying to win two straight games for only the second time this season. They beat the Denver Nuggets and Utah Jazz on Nov. 22-23.\n\n\r\n              LOPSIDED BATTLE ON THE GLASS\n\n\r\n              Neither team has done much right this season, but Houston’s biggest strength was a perfect match for Detroit’s most significant problems. The Rockets came into the game leading the league in offensive-rebound percentage at 29.6%, while the Pistons are one of the worst defensive-rebounding teams at 74.2%. Saturday, the Rockets grabbed 36.4% of their offensive-rebound attempts.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host Oklahoma City on Wednesday night.\n\n\r\n              Pistons: At Dallas on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995265.355107
}