{
  "game_id": "0021700865",
  "espn_id": "400975611",
  "date": "Feb 15, 2018",
  "matchup": "MIL vs. DEN",
  "headline": "Nuggets make 24 3-pointers, beat Bucks 134-123",
  "body": "MILWAUKEE --  There's something about playing in Milwaukee that brings out the best in Nikola Jokic.\n\nJust over a year after recording the first triple-double of his career at the BMO Harris Bradley Center, Jokic wrapped up the feat in the first half on the same floor Thursday night.\n\nBesides Jokic's big night, the Denver Nuggets put together one of the best 3-point shooting nights in league history in a 134-123 victory over the Bucks.\n\nDenver matched a franchise record with 24 3-pointers, one shy of the NBA record, on 40 attempts.\n\n\"Each guy kind of had their own little stretch,\" Nuggets coach Michael Malone said. \"Jamal (Murray) got going in the third quarter, and we rode him and ran some plays for him. Gary Harris had it going, and Nikola shot it well.\"\n\nJokic finished with 30 points, 15 rebounds and a career-high 17 assists, reaching a triple-double with 1:54 remaining in the second quarter. That was the quickest triple-double in the NBA in the last 20 seasons, according to ESPN Stats & Info.\n\nHe now has 11 career triple-doubles and five this season, four of which have come since Jan. 27.\n\n\"I just started playing well and making shots,\" Jokic said. \"I didn't have any extra motivation or anything like that though. I'm just playing the same way I always play. Maybe I was a little more aggressive tonight, but I'm playing the same.\"\n\nGiannis Antetokounmpo also recorded a triple-double, finishing with 36 points, 11 rebounds and 13 assists for his ninth career triple-double, passing Kareem Abdul-Jabbar for most in Bucks history.\n\nHarris added 28 points and Murray had 26 for the Nuggets, who led by double digits for most of the fourth quarter.\n\n\"When you have seven guys make two 3s or more and all starters three or more, you have multiple problems out there,\" Bucks interim coach Joe Prunty said. \"Give them credit for generating open shots. We made some adjustments, but even when we did that they got some pretty good looks.\"\n\nDenver scored 74 points in the first half for its second-highest scoring half of the season. The Nuggets had 82 points in the second half of a 146-114 win over New Orleans on Nov. 17.\n\nIt also marked the most points allowed by the Bucks in a half this season.\n\nThe Nuggets shot 63.6 percent in the first half, including hitting 13 of 19 attempts from beyond the arc. Denver finished at 55.3 percent from the field and 60 percent from 3-point distance.\n\n\"When you have 37 assists and you shoot that well, it's a question of how you make all those shots,\" Malone said. \"We generated great looks.\"\n\nWilson Chandler hit a 3-pointer on the first possession of the second quarter to put Denver up 38-28. The Bucks answered with a 15-3 run to go up 43-41.\n\nDenver then outscored Milwaukee 33-19 over the final 7:58 of the half.\n\nThe Bucks pulled to 83-78 with 5:18 to play in the third quarter, but the Nuggets then used a 12-3 spurt to take control.\n\n\"It was just one of those nights where, for some reason, we couldn't get it right,\" Bucks guard Khris Middleton said. \"We kept giving them 3-ball after 3-ball.\"\n\nDUELING TRIPLE-DOUBLES\n\nJokic and Antetokounmpo are the third opposing players to record 30-point triple-doubles in the same game in NBA history, joining Oscar Robertson and Richie Guerin in 1961, and Johnny Kerr and Dave DeBusschere in 1965.\n\nTOUGH ROAD AHEAD\n\nMilwaukee is 9-3 since firing Jason Kidd on Jan. 22, but only one of those victories has come against a team currently in playoff position. That win came against a Philadelphia team playing without Joel Embiid.\n\nThe Bucks will open the second half by facing current playoff teams in seven of eight games, with Detroit being the lone exception.\n\nTIP-INS\n\nNuggets: Denver's 13 3-pointers in the first half were their most since Feb. 13, 2017, when they connected on 16 in the first half of a 132-110 win over Golden State. ... G Torrey Craig missed his second consecutive game with groin and hamstring injuries. ... F Kenneth Faried (personal) and G Richard Jefferson (right wrist soreness) were not with the team.\n\nBucks: C John Henson missed his third consecutive game with right hamstring soreness. Thon Maker started in his place. ... Milwaukee had never allowed more than 19 3-pointers in a game.\n\nUP NEXT\n\nNuggets: Host San Antonio on Feb. 23.\n\nBucks: Visit Toronto on Feb. 23.",
  "source": "espn_api",
  "crawled_at": 1764993001.279527
}