{
  "game_id": "0022400710",
  "espn_id": "401705276",
  "date": "Feb 04, 2025",
  "matchup": "CLE vs. BOS",
  "headline": "Jayson Tatum scores 22, Celtics hold off Cavaliers 112-105 in matchup of Eastern Conference's best",
  "body": "CLEVELAND -- — Jayson Tatum scored 22 points, Derrick White added 20 and the Boston Celtics showed their championship makeup down the stretch with a 112-105 win over the Cleveland Cavaliers on Tuesday night in a matchup of the Eastern Conference's top teams.\n\n\r\n              The defending NBA titlists executed in the final minutes and held off the Cavs, who lost for just the fourth time in 28 home games.\n\n\r\n              Kristaps Porzingis added 19 points and Jaylen Brown 16 with nine rebounds as Boston won its fourth straight and improved to 2-1 against Cleveland this season.\n\n\r\n              Donovan Mitchell scored 31 points and Darius Garland 25 for the Cavs, who cut a 15-point deficit to four in the fourth quarter.\n\n\r\n              But the Celtics, who have won four straight, didn't buckle and responded in every crucial moment to put away the Cavs.\n\n\r\n               Jarrett Allen had 17 points and 18 rebounds for Cleveland.\n\n\r\n              Takeaways\r\n              Celtics: Porzingis' presence makes Boston that much tougher to defend. The 7-foot-3 big man was injured and missed last year's playoff series against Cleveland. The Cavs continually got caught making bad switches while trying to guard Porzingis.\n\n\r\n              Cavaliers: All-Star Evan Mobley had a rough night. He finished with just 7 points on 3 of 14 shooting and failed to make a significant impact at either end. Mobley recently returned from a calf injury and doesn't seem to have his explisiveness back.\n\n\r\n              Key moment\r\n              After the Cavs pulled within four late in the fourth, White hit a short jumper followed by back-to-back 3-pointers to give Boston a 107-97 lead with 2:41 left.\n\n\r\n              Key stat\r\n              Cleveland started just 1 of 14 on 3-pointers and finished 11 of 39 (28%) behind the arc. They've made at least 10 3s in 55 straight games.\n\n\r\n              Up next\r\n              On Thursday, the Celtics host Dallas, which just acquired Anthony Davis from the Lakers in a superstar swap for Luka Doncic. The Cavaliers are in Detroit on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998311.254116
}