{
  "game_id": "0021500638",
  "espn_id": "400828525",
  "date": "Jan 20, 2016",
  "matchup": "LAL vs. SAC",
  "headline": "Cousins' 36 points lead Sacramento past Lakers again, 112-93",
  "body": "LOS ANGELES -- DeMarcus Cousins is dominating every opponent in the Sacramento Kings' path during a remarkable January run that has coach George Karl calling him the best center in basketball.\nFor the third time this season, Cousins and the Kings were far too good for the Los Angeles Lakers.\nCousins had 36 points and 16 rebounds, and Rajon Rondo added 11 points and 17 assists in the Kings' sixth consecutive victory over the Lakers, 112-93 on Wednesday night.\nCousins continued his tear through 2016 with another brutally effective performance, scoring at least 29 points for the eighth time in nine games during the new year. He had 10 in the fourth quarter, leading the Kings away on a game-ending 21-6 run after Los Angeles trimmed their lead to four.\n\"DeMarcus has shown at a high, high level that he's an All-Star,\" Karl said. \"Is there a better center playing basketball right now in the NBA? I don't think there is. He's helped us at both ends of the court. ... I don't know anybody that's playing at this level right now, and I hope the NBA recognizes it and gives him an opportunity to play in Toronto (at the All-Star Game).\"\nWhen asked if he's the best center in the game, Cousins was calmly confident.\n\"That's not even a question,\" he replied. \"It's not even about that. I feel I can still improve in so many ways. I feel I can improve a lot on the defensive end. ... I feel like I can make the pass more than I have. Still a lot of areas I need to improve. It's not about that. It's about playing the right way and helping this team get to the next level.\"\nKobe Bryant scored just two of his 15 points after halftime and Brandon Bass had a season-high 18 for the Lakers, who have lost four straight and eight of nine to drop to a conference-worst 9-35.\nRudy Gay scored 16 points for the Kings, who have won three straight and six of nine. Sacramento never trailed, controlling the game in the same building where it ended the Clippers' 10-game winning streak four days earlier.\nThe Lakers fell behind early, but kept it close until Cousins led Sacramento on a 13-0 run midway through the fourth quarter of a game between two of the NBA's three worst defensive teams.\n\"For whatever reason, against this team we come out a little lackadaisical and they jump on us right away,\" Lakers coach Byron Scott said.\nPLAYOFF POSITION\nAfter its first three-game road winning streak of the year, Sacramento has the Western Conference's eighth-best record at 18-23. The Kings never made the playoffs or won more than 29 games in Cousins' first five NBA seasons, but they're clearly a postseason contender this year.\n\"It feels good, but I'm not satisfied,\" Cousins said. \"We shouldn't be satisfied as a team. I don't think it's just about making the playoffs. I think we have a chance to make some noise this year.\"\nRUNAWAY\nLou Williams scored 15 points for the Lakers, who have their seventh losing streak of at least four games this season. Bryant is fairly powerless to prevent the losing, but he insists he isn't taking it lightly in his farewell season.\n\"I swear if this was a couple years ago I would say something extremely inappropriate,\" Bryant said. \"You can't be chumps, and nobody in this locker room is a chump to capitulate to that and accept that fact. It's not going to happen, so you just come out and try to improve and work every single game and get better.\"\nKOBE'S MOVES\nBryant appeared in his 36th game of the season, surpassing his 35 total appearances last season. The third-leading scorer in NBA history seemed comfortable on his sore right Achilles tendon. The 20-year veteran was playing in his fifth straight game over nine days after sitting out four of the previous six.\nTIP-INS\nKings: Sacramento could sweep the season series when the teams meet March 15 at Staples Center. ... Rondo reached double digits in assists for the ninth consecutive game, extending the Kings' longest such streak in the Sacramento era.\nLakers: Rookie F Larry Nance Jr. missed his second straight game with a sore right knee. ... The Lakers are on their seventh losing streak of at least four games already this season.\nUP NEXT\nKings: Host the Hawks on Thursday.\nLakers: Host the Spurs on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994277.713964
}