{
  "game_id": "0021600826",
  "espn_id": "400900231",
  "date": "Feb 13, 2017",
  "matchup": "DAL vs. BOS",
  "headline": "Thomas, Smart help Celtics stay hot in 111-98 win over Mavs",
  "body": "DALLAS --  Isaiah Thomas and the Boston Celtics had little trouble with a batch of Western Conference opponents -- save for a hiccup in Sacramento.\n\nNow they're gaining fast in the East.\n\nThomas had 29 points and eight assists, backcourt mate Marcus Smart added 19 points against his hometown team and the Celtics beat the Dallas Mavericks 111-98 on Monday night.\n\nKelly Olynyk scored seven of his 15 points during a 12-2 run that started with the Celtics leading by one in the fourth quarter as the Atlantic Division leaders won for the 10th time in 11 games.\n\nBoston pulled within two games of defending NBA champion Cleveland atop the East by finishing a 5-1 stretch against the West with three straight road wins, following what now looks like a puzzling 16-point loss in Sacramento.\n\n\"We would love to go 4-0, but things happened,\" said Smart, who starred at a high school in a suburb near Dallas. \"But we bounced back. That's what good teams do. We're becoming a very, very great team.\"\n\nRookie Yogi Ferrell had 20 points for the Mavericks, who came in with three wins over division leaders in the past two weeks after spending the first three months at or near the bottom of the West.\n\nOlynyk started the decisive surge with a pair of layups, followed by a high-arching layup on a drive by Thomas, the NBA's second-leading scorer. After Olynyk hit a 3-pointer, Thomas made one for a 100-89 Boston lead.\n\n\"They've got a legitimate shot to get to the Finals with that team out of the East,\" said Dallas coach Rick Carlisle, who played for the Celtics. \"It's a very good basketball team, so when you're playing a team on that level, you've just gotta be on it from the very beginning.\"\n\nMavericks guard Deron Williams was ejected late in the second quarter after getting two quick technical fouls for arguing a foul call, part of an 8-0 Boston run over the final 58 seconds for the Celtics' 61-50 lead at the break.\n\nWilliams, who was in his second game back after missing eight games with a right big toe sprain, was called for pushing off while driving for a layup. He intercepted a pass intended for official Justin VanDuyne, who made the call, and began arguing with him.\n\nDallas' point guard pounded the ball on the floor with two hands while turning away as the first was technical was called, and VanDuyne quickly called the second tech.\n\nThomas and Smart combined for 23 points in the first quarter, but Ferrell had 13 at halftime to help Dallas get within three before Boston's late surge.\n\nHarrison Barnes scored 19 for Dallas, and Dirk Nowitzki and Wesley Matthews had 18 apiece.\n\nTIP-INS\n\nCeltics: Gerald Green played despite an illness, scoring 10 points in 13 minutes. ... The Celtics swept the two-game season series after having dropped seven straight against the Mavericks. ... Jae Crowder had 10 points, including a 3 to help put the game away against his former team.\n\nMavericks: Nowitzki's 26-point average against Boston coming into the game was the highest against any opponent for the 19th-year player. ... Despite the ejection, Williams got the assist he needed to pass Muggsy Bogues for 19th on the NBA's career list. Williams now has 6,727 assists.\n\nCUBAN AMUSED\n\nMark Cuban says President Donald Trump's tweet suggesting that the outspoken owner of the Mavericks wasn't smart enough to be commander in chief \"gave me a little giggles.\"\n\nA vocal supporter of Hillary Clinton during the campaign, Cuban said Monday that he woke up a day earlier to Trump's tweet, which read \"I know Mark Cuban well. He backed me big-time but I wasn't interested in taking all of his calls. He's not smart enough to run for president!\"\n\nCuban retweeted it with an \"Lol.\" Speaking to reporters before the game, Cuban said he woke up thinking \"there must be peace and harmony throughout the entire world because the president of the United States has chosen to wake up and tweet to me.\"\n\nUP NEXT\n\nCeltics: A back-to-back before the All-Star break, at home against Philadelphia on Wednesday and at Chicago on Thursday.\n\nMavericks: At Detroit in the last game before the break.",
  "source": "espn_api",
  "crawled_at": 1764996117.282557
}