{
  "game_id": "0021800470",
  "espn_id": "401071151",
  "date": "Dec 21, 2018",
  "matchup": "TOR vs. CLE",
  "headline": "Leonard scores 37 as Raptors beat Cavs 126-110",
  "body": "TORONTO --  The Toronto Raptors keep rolling along despite missing a couple key players because of injuries.\n\nHaving Kawhi Leonard on the court certainly helps.\n\nLeonard matched his season high with 37 points, helping the Raptors beat the Cleveland Cavaliers 126-110 on Friday night.\n\nOG Anunoby equaled his career high with 21 points as Toronto improved its NBA-leading record to 25-9. Pascal Siakam had 15 points and 10 rebounds, and Fred VanVleet scored 14 points.\n\nThe short-handed Raptors won their second straight despite injuries to three starters. Guard Kyle Lowry missed his fourth straight game because of a sore left thigh, and center Serge Ibaka was sidelined by a sore right knee for the second straight game. Guard Danny Green was shelved by a sore left knee after starting Toronto's first 33 games.\n\nRaptors coach Nick Nurse said he has been impressed with the way his team has responded to the rash of injuries.\n\n\"I think we're handling it really well,\" Nurse said. \"We're having to do a lot of different things, play a lot of different lineups, a little bit different style here and there.\"\n\nSiakam said the Raptors are trying to stay positive.\n\n\"All of us are waiting for opportunities to be on the floor,\" he said. \"It's tough to have three starters out but, at the same time, it's another day in the NBA, it's another game, so we've got to go out there and play it.\"\n\nJordan Clarkson scored 20 points for Cleveland, and Larry Nance Jr. had 16 points and 12 rebounds. Collin Sexton scored 17 points, and Cedi Osman finished with 12.\n\nThe Cavaliers lost for the fourth time in five games. They also dropped to 3-13 on the road.\n\nCleveland had injury problems of its own. Rodney Hood was limited to 17 minutes because of a sore left foot, and David Nwaba turned his left ankle in the second quarter and played only 14 minutes.\n\n\"Both guys are obviously a big part of what we do, they're starters,\" coach Larry Drew said. \"We had to kind of switch some things up.\"\n\nLeonard shot 12 for 16 from the field and went 11 for 12 at the free-throw line. He was working out after the game and did not speak to the media.\n\nToronto had a 102-97 lead with 7:36 remaining when Anunoby drove for a powerful one-handed dunk. After VanVleet stole the ball from Sexton, Siakam converted a layup to put the Raptors up by nine points.\n\nClarkson made a pair of free throws and Nance dunked to cut the gap to five again, but Leonard replied with a three-point play, and then teamed with VanVleet to hit back-to-back 3s.\n\n\"I thought our guys put up a good fight,\" Drew said. \"For 3 1/2 quarters we did some good things. We just couldn't overcome them.\"\n\nTIP-INS\n\nCavaliers: Cleveland's reserves scored 53 points. ... Matthew Dellavedova led Cleveland with six assists.\n\nRaptors: VanVleet led Toronto with eight assists while Anunoby matched his career high with eight rebounds. ... Toronto used its 12th starting lineup of the season, with VanVleet, Wright and Anunoby joining regulars Leonard and Siakam. ... Toronto sold out its 200th consecutive game, a streak that began in November 2014.\n\nCAN'T COME BACK\n\nCleveland is 0-18 when trailing at halftime.\n\nHIGH-SCORING\n\nToronto scored 120 or more for the 14th time, more than anyone else in the league.\n\nSTILL SITTING\n\nLeonard will sit against the 76ers on Saturday, Nurse said. Leonard has not played in both ends of a back-to-back yet this season after an injury-wracked season last year. Nurse said there's a chance Green and Lowry could return Saturday, but Ibaka is not expected to play.\n\nUP NEXT\n\nCavaliers: Host Chicago on Sunday night.\n\nRaptors: Visit Philadelphia on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994118.095847
}