{
  "game_id": "0021900098",
  "espn_id": "401160740",
  "date": "Nov 05, 2019",
  "matchup": "CLE vs. BOS",
  "headline": "Hayward ties career high with 39 as Celtics top Cavs 119-113",
  "body": "CLEVELAND --  Gordon Hayward capped a perfect night from inside the arc with the biggest basket of the game.\n\nHayward tied a career high with 39 points, making all 16 of his 2-point attempts, and the Boston Celtics won their fifth straight game by holding off the Cleveland Cavaliers 119-113 on Tuesday.\n\nHayward hit 17 of 20 shots, including one 3-pointer. He put in Kemba Walker's miss with 22 seconds left to give Boston a five-point lead. Walker stole the inbounds pass and sank a free throw to put the game away.\n\nThe only person in the building who wasn't impressed with his perfection on 2-pointers was Hayward.\n\n\"It seems like a pointless stat to me,\" he said. \"Tonight just felt sweet because we got the win, but I wish we could have closed out better.\"\n\nCeltics coach Brad Stevens took a different point of view.\n\n\"Certainly, you always felt like he could get a bucket at any time,\" Stevens said. \"He was aggressive going to the basket. He did a good job when guarded by big guys. He did a good job when guarded by small guys.\"\n\nWalker had 25 points for Boston, which hasn't lost since the season opener against Philadelphia.\n\n\"That's pretty impressive,\" he said of Hayward's stat line. \"He made all his 2s and only missed three 3s. That's nuts.\"\n\nHayward scored 16 points in the opening quarter and 22 in the first half, hitting all nine attempts from the field.\n\nCavaliers forward Larry Nance Jr. had a simple assessment of the performance.\n\n\"He didn't miss,\" Nance said. \"He's crafty. He plays the game at a very cerebral level.\"\n\nHayward suffered a horrific leg injury in Cleveland during the opening minutes of the 2017-18 season opener. He averaged 16.5 points in two games at Cleveland last season.\n\n\"I don't think about it,\" Hayward said. \"I haven't thought about it for a while. Hopefully, you guys won't be asking about it again.\"\n\nCollin Sexton, who scored 21 points, hit a 3 with 1:33 to play that cut Boston's lead to 116-113. The score remained that way until Hayward's crucial basket after his offensive rebound.\n\n\"Probably a case, I don't know what the film's going to show, ball-watching,\" Cavaliers forward Kevin Love said. \"I'd gone for the rebound and he just crashed weak side.\"\n\nBoston was 48 of 85 from the field (56%). Jayson Tatum scored 18 points and Carson Edwards had 13.\n\nTristan Thompson had 19 points and 13 rebounds for Cleveland, which has lost three straight. Love scored 17 and Larry Nance Jr. 15.\n\nTIP-INS\n\nCeltics: C Enes Kanter (bruised left knee) missed his fifth straight game. Stevens said Kanter \"really wants to play, but our medical staff doesn't feel like he's ready yet.\" ... F Jaylen Brown (illness) worked out in Boston and could join the team in time for Thursday's game at Charlotte. He has not played since Oct. 26 at New York, sitting out three games in a row.\n\nCavaliers: G Matthew Dellavedova returned after missing two games because of personal reasons. ... Nance played with his left thumb wrapped after injuring it Sunday. ... F Alfonzo McKinnie scored his first points of the season, a 3 in the first quarter. ... Cleveland Indians catcher Roberto Perez, who was awarded a Gold Glove this week, got a loud ovation when he was shown on the video board.\n\nRETURNING HOME\n\nWalker will play his first game in Charlotte on Thursday since signing with the Celtics in July. He was drafted by the Hornets in 2011 and played there for eight seasons, making the last three All-Star teams.\n\n\"I get to see my mom,\" he said. \"That's the only thing I'm thinking about. Getting to see my family is what I'm looking forward to.\"\n\nSITTING OUT\n\nCavaliers rookie Kevin Porter Jr. missed the game after being suspended by the NBA for bumping official Bill Spooner in Sunday's loss to Dallas.\n\nPorter brushed into Spooner's shoulder as he ran back down the floor after missing a shot at the end of the third quarter, knocking the official off balance.\n\n\"He was very contrite, very disappointed in himself,\" Cleveland coach John Beilien said. \"He apologized to the official right away. You cannot do that with the officials. You can't come close to them like that. I think we all realize that.\"\n\nUP NEXT\n\nCeltics: Visit the Charlotte Hornets on Thursday.\n\nCavaliers: At the Washington Wizards on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996334.956724
}