{
  "game_id": "0022200752",
  "espn_id": "401468907",
  "date": "Jan 29, 2023",
  "matchup": "MIA @ CHA",
  "headline": "Rozier, Washington help Hornets rally past Heat 122-117",
  "body": "CHARLOTTE, N.C. -- — Terry Rozier scored 31 points, P.J. Washington had 27 and the Charlotte Hornets stopped Miami's three-game win streak with a 122-117 victory over the Heat on Sunday.\n\n\r\n              LaMelo Ball scored 13 of his 19 points in the fourth quarter as Charlotte improved to 7-16 at home. Gordon Hayward was a perfect 7 of 7 from the field for 20 points.\n\n\r\n              Rozier also had seven assists and six rebounds. He was 11 for 19 from the field, including a 5-for-11 performance from 3-point range. He made two buzzer-beater 3s at the end of quarters.\n\n\r\n              Jimmy Butler scored 28 points for Miami, and Tyler Herro had 24.\n\n\r\n              The Hornets, who have been hampered by injuries all season, have won four of six for the team's best stretch of the season. Washington believes it's a reflection of the team getting healthier.\n\n\r\n              Charlotte's projected starting five to begin the season is finally back on the floor and appears to be starting to mesh.\n\n\r\n              “Everybody is back and everybody is healthy — and that is a major difference,” Washington said. “At the end of the day we have to keep going the way we are right now.”\n\n\r\n              Hayward has struggled with shoulder and hamstring issues, limiting the team's highest-paid player to just 24 games.\n\n\r\n              Sunday marked his best game in months.\n\n\r\n              “He's playing confident and getting easy baskets and just bullying guys down low,” Washington said. “He's playing great basketball and I expect that of him every night.”\n\n\r\n              Whether a now healthy Hornets team can make a playoff push remains to be seen, but coach Steve Clifford remains optimistic.\n\n\r\n              “Getting ’Melo and Gordon back, obviously you’re a different team,” Clifford said. “If we can get into playing set groups then we’ll have a good chance to hopefully put some good stretches together. (It helps) when they know who they’re playing with and they know where the shots are coming from.”\n\n\r\n              The Heat led 62-58 after Rozier banked in a 3 from the midcourt logo to close out the first half.\n\n\r\n              Miami went on a 10-1 run to start the third quarter. Herro knocked down two 3-pointers to help the Heat open a 13-point lead.\n\n\r\n              But Charlotte came storming back behind Washington and Rozier, who began knocking down shots from deep.\n\n\r\n              Charlotte pushed the lead to 12 with 5:54 left on a turnaround jumper by Rozier.\n\n\r\n              Miami rallied with a 10-0 run. Kyle Lowry found Bam Adebayo inside for a layup to cut the lead to 108-106.\n\n\r\n              But Charlotte had another burst as Mason Plumlee got the ball after Rozier won a jump ball and drove to the basket for a score. Ball canned an open 3-pointer to put Charlotte back up 114-106 with 1:50 left.\n\n\r\n              Washington's rebound and score off his own miss kept Charlotte up by seven and Plumlee dunked off a pass from Washington to put the game away in the final minute.\n\n\r\n              Charlotte shot 54.2% from the field and scored 25 points in transition. The Hornets also outrebounded Miami 47-36.\n\n\r\n              “They have had a lot of injuries but when they have been fully healthy, this team can score much different than their numbers may suggest for the season,” Miami coach Erik Spoelstra said. “We did not step up defensively, they got a lot of easy run-ups that quickly changed the momentum of the game.\"\n\n\r\n              TIP-INS\n\n\r\n              Heat: Adebayo scored 17 points, but he only had four rebounds. \n\n\r\n              Hornets: Plumlee entered the game shooting 76.5% from the field over his last 20 games, the highest percentage by any player in any 20-game span since the ABA-NBA merger in 1976-77, per Stathead. ... Charlotte's career leading scorer Kemba Walker attended the game.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Continue a four-game road trip Tuesday at Cleveland.\n\n\r\n              Hornets: Play five of their next six games on the road beginning Tuesday at Milwaukee. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993951.067994
}