{
  "game_id": "0021500919",
  "espn_id": "400828806",
  "date": "Mar 04, 2016",
  "matchup": "MIL vs. MIN",
  "headline": "Antetokounmpo leads Bucks to 116-101 win over Timberwolves",
  "body": "MILWAUKEE --  Giannis Antetokounmpo tried mightily for the rebound that would have given him another triple-double. He had to settle for a win instead.\n\nAntetokounmpo had 27 points, 12 assists and nine rebounds, and Khris Middleton had 32 points in the Milwaukee Bucks' 116-101 victory over the Minnesota Timberwolves on Friday night.\n\nAntetokounmpo battled Minnesota's Shabazz Muhammad for a rebound in the closing seconds, but the Timberwolves swingman got the ball.\n\n\"Shabazz, he doesn't like me,\" Antetokounmpo said with a smile. \"He just destroyed history right there.\"\n\nAntetokounmpo just missed his third triple-double in six games. Playing at a high level since the All-Star break, he had the first two of his career on Feb. 22 against the Los Angeles Lakers and Feb. 29 against the Houston Rockets. Antetokounmpo, whose 12 assists were a career high, shot 9 of 17 and went 9 of 10 from the foul line.\n\n\"I knew I was a rebound away from a triple-double, but you know it was a great game for us,\" he said. \"It doesn't matter at the end of the day.\"\n\nAntetokounmpo, at 6-foot-11, was effective playing point forward on offense, and then transitioning to sometimes guard big center Karl-Anthony Towns defensively.\n\nMiddleton made 11 of 16 shots, including 8 of 9 on 3-pointers, to open the middle for Antetokounmpo, Greg Monroe and Jabari Parker. It was the most 3s by a Bucks player since Carlos Delfino made eight on March 18, 2011, in a 110-95 win over New Jersey. He finally missed a 3 for the first time with 1:38 left in the third quarter.\n\nParker scored 16 points, Monroe had 14 points and nine rebounds and O.J. Mayo added 12 points for Milwaukee.\n\nMinnesota coach Sam Mitchell simply made a statement after the game, criticizing his starters, and didn't take questions.\n\n\"They have to understand, every single night you've got to earn it, you don't get to sleepwalk your way through 20, 25 minutes of the game and then decide you've got to play,\" he said.\n\nTowns scored 21 points for Minnesota, but only six after the first quarter. Zach LaVine added 20 points for the Timberwolves, who have lost six of eight since the All-Star break.\n\nMinnesota took a 49-39 lead in the second quarter and promptly fell apart, throwing the ball all over the court. Milwaukee went on a 49-13 run to end the first half and open the second half, taking an 88-62 lead on Middleton's eighth 3-pointer with 4:55 left in the third.\n\nThe Bucks took control with defense, forcing 26 Minnesota turnovers that led to 41 points. Minnesota came in averaging just under 15 turnovers a game.\n\n\"That's something that obviously we've got to fix,\" Towns said. \"You can't beat teams like this, especially a team that was a playoff team last year, looking to be a playoff team this year, with those kinds of mistakes happening over and over and over again.\"\n\nThe Timberwolves pulled within 102-95 in the fourth quarter, but could get no closer with Milwaukee sending its starters back into the game to squash the rally.\n\nBUCKS BENCH STRUGGLES\n\nMilwaukee coach Jason Kidd was disappointed his second unit allowed Minnesota to get back into the game.\n\n\"I thought it would be a game to get our bench some playing time,\" he said. \"Unfortunately, it never got there. The guys that were in, it got down to 10. I was tempted to just leave them out there and finish it because they kind of let it become a game again and I kind of wanted to see how they would respond. Having Giannis, Jabari and Khris go back in there to seal the deal was good.\"\n\nTIP-INS\n\nTimberwolves: Towns scored the team's first 11 points from basically everywhere on the court: a tip-in, post hook, a short jumper, mid-range jumper and a 3 pointer. ... It was the first in a stretch of four games in five nights for Minnesota.\n\nBucks: Michael Carter-Williams missed his third consecutive game with patella tendinitis.\n\nUP NEXT\n\nTimberwolves: Host Brooklyn on Saturday.\n\nBucks: Host Oklahoma City on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994023.383886
}