{
  "game_id": "0021501171",
  "espn_id": "400829058",
  "date": "Apr 06, 2016",
  "matchup": "OKC @ POR",
  "headline": "Al-Farouq Aminu leads Blazers past Thunder to clinch playoff berth",
  "body": "PORTLAND, Ore. -- If there was an award for the NBA's most overachieving team, the Portland Trail Blazers would be heavily favored this season.\nPicked by preseason pundits to finish near the bottom of the NBA standings because of drastic offseason roster turnover, Portland instead became a playoff team. The Blazers clinched a postseason berth Wednesday night with a 120-115 win over short-handed Oklahoma City.\nAl-Farouq Aminu scored 27 points and C.J. McCollum 26 as six Blazers scored in double figures.\nPortland (43-37) won for the sixth time in seven games and became the first team in NBA history to earn a playoff berth while returning a roster that had two or fewer players with 1,000 or more minutes from the previous season (Damian Lillard, Chris Kaman).\nExpectations were minimal for Portland heading into the season after losing four of its five starters from the 2014-15 campaign. The Blazers didn't exactly prove the experts wrong during the season's first eight weeks, taking an 11-20 record into a Dec. 26 game against Cleveland.\nBut since beating the Cavaliers 105-76, Portland is 32-17. The Blazers climbed from near the bottom of the Western Conference standings to have a shot at the West's No. 5 seed.\n\"We came back from whatever our record was in December to put together a run and stayed with the process,\" Portland coach Terry Stotts said. \"It's been very rewarding.\"\nLillard, who scored 11 points, repeatedly used the word \"satisfying\" in describing the team's feelings about clinching a playoff berth.\n\"Because there was so much doubt,\" he said. \"It wasn't just people saying they're not going to be a playoff team. People said we wouldn't win 20 games.\"\nStotts said the difference between the season's first two months and the team's post-Christmas play is simple.\n\"We kicked away some games early,\" Stotts said. \"We found ways either to hold on to leads or find ways to win games in the fourth quarter.\"\nEnes Kanter had a career-high 33 points and 20 rebounds for the Thunder, and Dion Waiters had 25 points.\nOklahoma City, which clinched the West's No. 3 seed with Tuesday's win at Denver, rested four starters, including All-Stars Kevin Durant and Russell Westbrook.\nPortland scored a season high for a first half in taking a 72-59 halftime lead, making 25 of 42 shots.\nMcCollum, Aminu and Maurice Harkless hit 3-pointers as the Blazers ran off 11 consecutive points to take a 17-6 lead. Aminu led Portland early, scoring 13 of the team's first 21 points.\nOklahoma City pulled to within four points at 36-32 early in the second quarter, but McCollum scored the first five points during a 9-0 run that helped the Blazers regain a double-digit lead. Portland tied a season high with 39 second-quarter points. Kanter helped keep the Thunder in the game, with 17 points and 10 rebounds during the first half.\nMcCollum and Aminu hit 3-pointers to start the second half, and Portland had an 84-63 lead four minutes into the third quarter. Oklahoma City was unwilling to go quietly, as Kanter scored back-to-back baskets early in the fourth quarter to cut the deficit to 10.\nBut the Blazers soon stretched the lead back to 16 and held on during the final minutes.\nTIP-INS\nThunder: Randy Foye and Kanter made their first Oklahoma City starts of the season against Portland. The only regular starter to play was C Steven Adams. ... Westbrook was the only regular starter who had played in each of Oklahoma City's previous 78 games. ... Oklahoma City split the four-game season series with the Blazers, each team winning two games at home. ... The Thunder have lost four straight in Portland.\nTrail Blazers: With a playoff bid clinched, Portland now has its eye on the No. 5 seed. The Blazers are currently one-half game behind No. 5 Memphis, with a far easier remaining schedule. Portland finishes the season with home games against Minnesota and Denver. Memphis (42-36) has four games remaining: two against Golden State, plus Dallas and the Los Angeles Clippers. ... Mark Mason, the Blazers' long-time public address announcer, missed Wednesday's game for the first time in 843 games with an illness. ... The Blazers have had at least five double-digit scorers in 12 consecutive games.\nOKLAHOMA CITY RESTING\nWith nothing to gain from a playoff perspective and coming off a Tuesday night game in Denver, Thunder coach Billy Donovan had no qualms about giving four starters the night off against Portland.\n\"My thinking on holding everyone out is just to rest our guys,\" Donovan said. \"It was a great opportunity to get those guys some extra rest and have two days before going to Sacramento.\"\nHOT FROM 3\nPortland hit 15 3-pointers against Oklahoma City to increase its season total to 844. That is the sixth-most by an NBA team in any season. Lillard and McCollum have combined for almost half of the Blazers' 3-pointers, with 417.\nUP NEXT\nThunder: At Sacramento on Saturday.\nTrail Blazers: Home vs. Minnesota on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994119.603188
}