{
  "game_id": "0022400202",
  "espn_id": "401704768",
  "date": "Nov 10, 2024",
  "matchup": "MIL vs. BOS",
  "headline": "Jayson Tatum scores 23 in second half to rally Celtics to a 113-107 victory over slumping Bucks",
  "body": "MILWAUKEE -- — Jayson Tatum had 31 points, 12 rebounds and six assists and the Boston Celtics rallied in the second half to beat the slumping Milwaukee Bucks 113-107 on Sunday afternoon.\n\n\r\n              Tatum put the Celtics ahead for good by hitting two free throws with 5:51 left as Boston erased a nine-point halftime deficit.\n\n\r\n              Giannis Antetokounmpo scored a season-high 43 points for the Bucks, who have lost eight of nine. Antetokounmpo also had 13 rebounds and five assists.\n\n\r\n              Payton Pritchard added 18, Jrue Holiday and Derrick White had 15 each and Jaylen Brown scored 14 for the Celtics. Brown returned after missing four games with a hip injury.\n\n\r\n              Bobby Portis scored 15 for Milwaukee.\n\n\r\n              Takeaways\r\n              Celtics: Pritchard, who scored 28 points in a 119-108 victory over the Bucks on Oct. 28, kept Boston in the game by scoring 17 in the first half. Tatum took over from there with 23 points in the second half. \n\n\r\n              Bucks: Milwaukee took a 16-2 lead in the first 2 1/2 minutes of the game, led by at least eight points for the entire first half and went into the break with a 69-58 advantage after its highest-scoring half of the season. But the Bucks scored just 15 points in the third, their lowest total in any quarter this season, and couldn't recover.\n\n\r\n              Key moment\r\n              The Celtics opened the third quarter by going on a 12-0 run which culminated with an Al Horford 3-pointer. The Bucks would respond -- the second half featured eight ties and seven lead changes -- but Boston answered every Milwaukee rally the rest of the way.\n\n\r\n              Key stat\r\n              Milwaukee's Damian Lillard scored 14 points but shot 1 of 8 from 3-point range. He's 1 of 12 from beyond the arc over his last two games.\n\n\r\n              Up next\r\n              The Celtics host the Atlanta Hawks on Tuesday, the same day the Bucks host the Toronto Raptors.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997859.351718
}