{
  "game_id": "0021900740",
  "espn_id": "401161382",
  "date": "Feb 02, 2020",
  "matchup": "TOR vs. CHI",
  "headline": "Raptors tie team record with 11th straight win, beat Bulls",
  "body": "TORONTO --  Terence Davis hasn’t forgotten about being passed over for a spot in the Rising Stars Challenge at All-Star weekend. Even so, the Toronto Raptors rookie is just happy he’s playing for a contender.\n\nDavis came off the bench to score a career-high 31 points and the Raptors tied a team record with their 11th straight win, beating the Chicago Bulls 129-102.\n\nToronto also won 11 straight in January 2016 and again from Feb. 26-March 16, 2018.\n\nPascal Siakam added 17 points, Serge Ibaka had 16, Chris Boucher 15 and Kyle Lowry 14 for the reigning NBA champions. The Raptors outscored the Bulls 69-39 in the second half to win their 12th consecutive meeting with Chicago.\n\nDavis made a career-high 12 of his 15 field goal attempts, including six of seven from 3-point range.\n\n“The ball was going in, so I kept shooting,” Davis said.\n\nDavis is the sixth rookie in Raptors history to score at least 30 in a game, and the first to do it as a reserve.\n\n“He’s reaping some of the benefits of all his hard work,\" coach Nick Nurse said.\n\nDavis said the All-Star snub was “definitely in the back of my mind,” but insisted he’s content with the Raptors, who are second in the East.\n\n“Im not saying I wouldn’t want to play in the game, because it’s a special event, but I would rather play in the playoffs,” Davis said.\n\nAn undrafted rookie from the University of Mississippi, Davis had scored 23 points twice this season, most recently against Washington on Jan. 17. He surpassed that mark with a 13-point fourth quarter, and received a hug from Lowry when he checked out with 3:12 remaining.\n\n“It just shows you what type of team this is,” Davis said. “We all love each other, we care for each other, and I wouldn't want to be anywhere else, honestly.”\n\nThaddeus Young fouled out with 21 points and Zach LaVine had 18 as Toronto swept Chicago for the third straight season.\n\nChandler Hutchison scored 17 points, and Ryan Arcidiacono and Coby White each had 12 for the Bulls, who are 8-18 on the road.\n\nThe Raptors were without guard Norman Powell, who broke the ring finger on his left hand in Friday’s win at Detroit. Center March Gasol missed his third straight game because of a sore left hamstring. Both players are out indefinitely.\n\n“With Norm being out, (Davis) is going to have an opportunity,” Lowry said. “He’s got to take advantage of it.”\n\nBulls guard Kris Dunn missed his first game of the season, with Hutchison starting in his place. Coach Jim Boylen said Dunn has been diagnosed with a sprained medial collateral ligament in his right knee.\n\nDunn was injured on the first possession of Friday’s loss at Brooklyn. He flew back to Chicago Saturday to be evaluated by team doctors.\n\nBulls forward Daniel Gafford didn’t return after suffering an apparent injury on an awkward fall in the first quarter, but Boylen said afterward that Gafford was OK. Gafford had missed the previous nine games because of a dislocated right thumb.\n\nChicago led 63-60 at halftime, but Toronto reclaimed the lead with a 17-4 run over the first five minutes of the third.\n\n“We dropped our heads a little bit in that third when the ball wasn’t going in and they made their run,” Boylen said.\n\nSiakam scored nine points in the third and Ibaka had eight as the Raptors took a 95-85 lead to the fourth.\n\n“We threw it away,” a disappointed LaVine said. “Same story we do most of the games we lead at halftime.”\n\nTIP-INS\n\nBulls: F Lauri Markkanen (stress reaction, right pelvis) missed his sixth straight game.\n\nRaptors: Toronto has won four straight at home. … F Rondae Hollis-Jefferson (right ankle) missed his fourth straight game. Nurse said Hollis-Jefferson could return Wednesday against the Pacers. … G-F Malcolm Miller (neck) did not play. … The Raptors outscored the Bulls 66-30 in bench points.\n\nKNOCKING ON THE PLAYOFF DOOR\n\nChicago is ninth in the East, three and a half games behind Orlando for the final playoff berth. The Bulls have lost three straight after winning four of the previous six.\n\n“When opportunity knocks, you’ve got to open the door,” LaVine said. “We just stood there. We might have jiggled the handle a little bit, but that’s about it.”\n\nMAGIC NUMBER\n\nToronto is 13-0 this season when shooting 50 percent or better.\n\nSUPER SUNDAY\n\nThe Raptors won on Super Bowl Sunday for the fourth straight season.\n\nUP NEXT\n\nBulls: Host New Orleans on Thursday night.\n\nRaptors: Host Indiana on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995601.816082
}