{
  "game_id": "0022000117",
  "espn_id": "401267277",
  "date": "Jan 06, 2021",
  "matchup": "SAC vs. CHI",
  "headline": "Hield's 4-point play helps Kings hold off Bulls, 128-124",
  "body": "SACRAMENTO, Calif. -- — Buddy Hield converted a four-point play with 38 seconds left to make up for a horrible shooting night, and the Sacramento Kings held off the Chicago Bulls 128-124 on Wednesday.\n\n\r\n                    Hield missed 12 of his first 14 shots and was 1 of 8 on 3-pointers before hitting one from the top of the arc and getting fouled by former Kings teammate Garrett Temple. Hield sank the free throw to give Sacramento a 124-119 lead and finished with 10 points.\n\n\r\n                    “I was joking that the only reason he made the last one is somebody hit him in the head,” Kings coach Luke Walton said. “It knocked off his calibration. The only time I ever worry about Buddy shooting is if he turns down a shot, and I haven’t seen him do that yet.”\n\n\r\n                    First-round draft pick Tyrese Haliburton scored 15 of his season-high 17 points in the fourth quarter and made a key steal in the backcourt. Haliburton followed Hield’s pivotal 3 with one of his own against a pair of Chicago defenders to help the Kings end a three-game losing streak.\n\n\r\n                    Marvin Bagley III had 21 points and 12 rebounds for Sacramento, which played most of the game without De’Aaron Fox. The point guard strained his right hamstring midway through the first quarter and did not return.\n\n\r\n                    Richaun Holmes had 24 points, eight rebounds and five assists for the Kings. Harrison Barnes added 20 points. \n\n\r\n                    Coby White had a career-high 36 points and seven assists for the Bulls. Zach Lavine scored 32 and Wendell Carter Jr. added 11 points and a career-best 17 rebounds.\n\n\r\n                    Hield’s clutch shot bailed out the Kings after Sacramento blew a 12-point lead in the first half and trailed with 6 minutes remaining.\n\n\r\n                    “Even if (Temple) didn’t foul him, he made the shot anyway,” Chicago coach Billy Donovan said. “They made three 3s coming down the stretch and one of them was a four-point play. I thought they were all well-contested.”\n\n\r\n                    Haliburton’s 3-pointer was equally big, making it 127-121 with 12 seconds remaining just before Barnes missed a pair of free throws for Sacramento. Lavine countered with a 3 to cut it to 127-124 with 2.6 seconds to play. \n\n\r\n                    Haliburton missed the previous two games with a bone bruise in his left wrist but played the entire fourth quarter of this one while Fox watched from the bench.\n\n\r\n                    “I was kind of disappointed in my performance up to that point,” Haliburton said. “Without me, De’Aaron has been asked to do a lot. When he’s out of the game, and even when he’s in the game, sometimes when we’re getting into our half-court offense we tend to walk it up. I was just trying to keep everyone involved. That leads to us winning games.”\n\n\r\n                    Before the game, players from both teams locked arms with their teammates during the national anthem. That followed a pattern set by other teams around the NBA after a mob stormed the U.S. Capitol in an attempt to prevent Congress from certifying the results of last November’s presidential election.\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Denzel Valentine had seven points in the final 3:51 of the first quarter. … Carter was called for defensive three seconds, resulting in a technical foul. … Temple scored 11 points in 33 minutes. … Patrick Williams spent much of the first half in concussion protocol after getting hit in the head. Williams finished with nine points.\n\n\r\n                    Kings: Walton lost a challenge after Bagley was whistled for a foul early in the fourth quarter. … Jabari Parker missed a second consecutive game for personal reasons. \n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Visit the Lakers in Los Angeles on Friday.\n\n\r\n                    Kings: Host the Raptors on Friday. Toronto has won six straight against Sacramento dating to 2016.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997198.947655
}