{
  "game_id": "0022200016",
  "espn_id": "401468171",
  "date": "Oct 20, 2022",
  "matchup": "LAC @ LAL",
  "headline": "Kawhi scores 14 in return, Clippers hold off Lakers 103-97",
  "body": "LOS ANGELES -- — Kawhi Leonard had 14 points and seven rebounds in his first game in 16 months, and the Los Angeles Clippers opened a season of sky-high expectations with a 103-97 victory over the Lakers on Thursday night.\n\n\r\n              Paul George scored 15 points and John Wall added 15 in his debut for the Clippers, who held on down the stretch to beat their more pedigreed Los Angeles rivals for the eighth consecutive time.\n\n\r\n              Leonard came off the bench for the first time since 2013 and played 21 minutes in his first game since he tore a ligament in his right knee in a playoff game in June 2021. The two-time NBA Finals MVP decided to ease back in a temporary reserve role after missing all of last season while recovering from surgery.\n\n\r\n              “My goal was to try to be great in my minutes,” Leonard said. “Have fun, obviously stay healthy and win the basketball game. We did that tonight. Just the first game, though. We've got a lot to go.”\n\n\r\n              The Clippers' high hopes for their first championship rest largely on Leonard's ability to return to elite form. Leonard and George are healthy now alongside five-time All-Star Wall, who provided an immediate spark in his first NBA game in 18 months after sitting out last season in Houston.\n\n\r\n              “I was turned up for sure,” Wall said of his return. “It felt great, I ain't gonna lie. ... We've got a new team, and it's just going to take some time for us offensively with me (and Leonard) on a minutes restriction, but with due time, we'll get there.”\n\n\r\n              Anthony Davis scored 25 points despite reduced mobility after a mid-game fall, while LeBron James had 20 points and 10 rebounds in the 20th home opener of his career. Lonnie Walker scored 26 points in his Lakers home debut.\n\n\r\n              The Lakers dropped to 0-2, but still rallied from two large deficits and kept it close into the final minute despite nightmare shooting performances from Russell Westbrook (0 for 11) and fellow point guards Patrick Beverley (1 for 7) and Kendrick Nunn (0 for 7) in their Lakers home debuts. The Lakers went 9 for 45 on 3-pointers overall.\n\n\r\n              “We're getting great looks, all our guys,” Davis said. “Continue to have confidence in yourself. Don't let missed shots take away your confidence. Keep shooting. Be confident in your shot, and they're going to fall.”\n\n\r\n              The oft-injured Davis gave fans a fright when he crashed to the floor after being undercut in the third quarter. He returned a few minutes later and played through back pain.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Marcus Morris and Ivica Zubac scored 14 points apiece. Zubac added 17 rebounds, including six offensive boards.\n\n\r\n              Lakers: This injury-plagued franchise already has four players sidelined, including G Dennis Schröder (thumb surgery) and C Thomas Bryant (thumb surgery).\n\n\r\n              KAWHI BENCHED\n\n\r\n              Leonard suggested the idea of coming off the bench until he feels fully up to speed. Leonard had started 447 consecutive regular season games and 100 playoff contests since Nov. 10. 2013, when he came off the bench for the Spurs in New York.\n\n\r\n              Leonard indicated he'll likely sit out one of the Clippers' back-to-back games this weekend.\n\n\r\n              RUSS NOT BENCHED\n\n\r\n              Lakers coach Darvin Ham said he briefly spoke to Westbrook about the guard's claim that coming off the bench possibly contributed to his preseason hamstring injury because he didn't know how to warm up properly for a reserve role after spending the previous 13 years as an NBA starter. Ham said he and the Lakers “would in no way, shape or form put a player in harm's way.\"\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Kings on Saturday.\n\n\r\n              Lakers: Host Trail Blazers on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995004.694664
}