{
  "game_id": "0021900201",
  "espn_id": "401160843",
  "date": "Nov 19, 2019",
  "matchup": "LAL vs. OKC",
  "headline": "LeBron sets triple-double mark, Lakers hold off OKC 112-107",
  "body": "LOS ANGELES --  To LeBron James, triple-doubles are not a goal.\n\nThey are only a side effect of the consistent, brilliant all-around play he has been dishing out for 17 NBA seasons, with no slowdown in sight.\n\nTriple-doubles also don't mean much to LeBron without wins attached to them, so James was pleased when his latest statistical superlative occurred during yet another successful night for the surging Los Angeles Lakers.\n\nJames became the first player in NBA history to record a triple-double against every team in the league, and Anthony Davis scored 34 points during the Lakers' fifth straight victory, 112-107 over the Oklahoma City Thunder on Tuesday night.\n\nJames finished with 25 points, 11 rebounds and 10 assists to post a triple-double against his 30th opponent for the NBA-leading Lakers, who have won 12 of 13 after a perfect four-game homestand. James was more surprised than thrilled by his latest statistical achievement, particularly while a different statistic glared at him from the box score.\n\n\"Coach (Frank) Vogel came in here and said, 'Congratulations,' and I thought he was joking about my seven turnovers,\" James said. \"I really don't know what to think about it. I just think it's a pretty cool stat to know, and I'm glad it happened in a win.\"\n\nJames has five triple-doubles in the Lakers' last 10 games, getting four in victories. There's a reason for this spree: Although James has constantly filled the stat sheet since he joined the league in 2003, he is leading the NBA this season with 11.1 assists per game, nearly four more than his career average. He has at least 10 assists in six consecutive games, the longest streak of his career.\n\nVogel has put the ball in James' hands constantly on offense, and his playmaking acumen has grown along with his chemistry with Davis, as they demonstrated repeatedly against the Thunder. Seven of LeBron's assists came on baskets by Davis.\n\n\"Amazing,\" Davis said. \"To be able to do that against every team is something special. I mean, (it's) trippy that he's been playing for a long time, so it was a matter of time before it happened, but just a tribute to all his hard work.\"\n\nJames is fifth in NBA history with 86 triple-doubles, but the four players in front of him -- Oscar Robertson, Russell Westbrook, Lakers great Magic Johnson and Lakers assistant coach Jason Kidd -- hadn't done it against 30 teams. Kidd, who did it against 28 teams, has served as a role model for James' efforts as a tall point guard.\n\n\"He's just playing terrific basketball,\" Vogel said. \"For him to be doing what he's doing in his 17th year is just nothing short of remarkable. There's no reason to believe he can't sustain that for the rest of the season and help us make a real strong playoff push.\"\n\nDennis Schroder scored 20 of his season-high 31 points in a phenomenal first half for the Thunder, who have lost four of five despite two solid performances at Staples Center. Danilo Gallinari added 25 points in his former home arena, and Nerlens Noel had 15.\n\n\"That's why (James) is considered probably the best of all time, but I think we did a great job on him,\" Schroder said. \"They obviously hit some tough shots.\"\n\nOne night after the Thunder barely missed an upset win over the Clippers thanks to a last-minute 3-pointer by former star Paul George, Oklahoma City couldn't quite catch up to the powerful Lakers despite keeping the game close all night.\n\n\"There's a lot of things we did well in there,\" Oklahoma City coach Billy Donovan said. \"But, you know, we came up short in all these games. I think the one sign you can point to is both teams, the Clippers and the Lakers, are really, really good teams, so we're competing well at a high level. But we've just got to do more in order to be able to finish and close out games.\"\n\nThe Thunder won't have to wait long for a rematch: These teams meet again in Oklahoma City in three days.\n\nTIP-INS\n\nThunder: F Hamidou Diallo missed his third straight game with a left knee sprain. ... Schroder got a technical foul in the third quarter for confronting Davis at the free throw line after Davis dunked and was fouled.\n\nLakers: Kyle Kuzma left the court in the second quarter with an eye abrasion after teenager Darius Bazley hit him in the right side of his face with an elbow on a drive. Kuzma returned to the bench in the second half, but with obvious damage above his eye. He didn't return to the game, although Vogel said he was available if necessary. The Lakers plan to re-evaluate him within the next 24 hours.\n\nCLOSEOUT SEQUENCE\n\nJames' 3-pointer put the Lakers up 109-98 with 3:08 to play, but the Thunder scored nine straight points to cut the Lakers' lead to two on Gallinari's free throws with 1:24 left.\n\nAfter Danny Green got a key offensive rebound for the Lakers, Kentavious Caldwell-Pope drilled a 3-pointer with 55 seconds left. James missed two free throws moments later to keep the Thunder in it, but Oklahoma City couldn't score again.\n\nPOINT GUARDS BEHAVE\n\nChris Paul had four points, 10 assists and five rebounds for the Thunder, and he didn't appear to clash with Rajon Rondo, his opponent in a fight early last season while he was with the Rockets. Rondo had eight points and a season-high 10 assists.\n\nUP NEXT\n\nThunder: Host the Lakers on Friday.\n\nLakers: Visit the Thunder on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996030.6168299
}