{
  "game_id": "401810003",
  "espn_id": "401810003",
  "date": "Nov 02, 2025",
  "matchup": "OKC vs NO",
  "headline": "Gilgeous-Alexander scores 30 points to help keep Thunder unbeaten, Pelicans winless",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had 30 points and seven assists in three quarters, and the Oklahoma City Thunder defeated the New Orleans Pelicans 137-106 on Sunday to extend their season-opening winning streak to seven games.\n\n\r\n              Gilgeous-Alexander made 8 of 14 field goals and all 13 of his free throws in 30 minutes to keep the Pelicans winless.\n\n\r\n              Isaiah Hartenstein had 14 points, 14 rebounds and eight assists for the Thunder, who shot 56% from the field and had eight players score in double figures. Oklahoma City's largest lead was 36 points in the fourth quarter. \n\n\r\n              The Thunder entered the game ranked last in the NBA in 3-point percentage at just under 30%, but made 20 of 48 (41.7%) against the Pelicans. \n\n\r\n              Oklahoma City dominated despite three starters from last season’s championship team missing the game. Thunder guard Lu Dort was out with an illness, forward Chet Holmgren missed his third straight game with a lower back sprain and guard/forward Jalen Williams hasn’t played this season as recovers from offseason surgery on his right wrist. \n\n\r\n              None of that stopped the Thunder from winning their 11th straight matchup with the Pelicans. The Thunder equaled their 7-0 start from last season, when they won the NBA title. Oklahoma City is the third team in league history to start 7-0 in back-to-back seasons, joining the Boston Celtics (1963-65) and Houston Rockets (1993-95).\n\n\r\n              Zion Williamson had 20 points and nine rebounds and Trey Murphy III added 19 points for New Orleans, which fell to 0-6.\n\n\r\n              Former Oklahoma star Jeremiah Fears, a rookie, scored 16 points for the Pelicans after getting a warm reception when he was introduced during starting lineups.\n\n\r\n              The Thunder made 13 of 24 3-pointers in the first half to take a 75-52 lead. Jaylin Williams tied a career high with four 3-pointers in the first half.\n\n\r\n              The Thunder led 114-90 in the fourth when Kevon Looney hit Oklahoma City's Ajay Mitchell in the face as Mitchell drove to the hoop. After review, Looney was called for a Flagrant-1. Mitchell made both free throws, then hit a floater on the extra possession to make it 118-90.\n\n\r\n              Up next\r\n              The Thunder visit the Los Angeles Clippers on Tuesday.\n\n\r\n              The Pelicans host the Charlotte Hornets on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042544.666678
}