{
  "game_id": "0022300529",
  "espn_id": "401585157",
  "date": "Jan 11, 2024",
  "matchup": "POR @ OKC",
  "headline": "Thunder roll past Trail Blazers 139-77, tie fifth-biggest victory margin in NBA history",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 31 points, Josh Giddey had a triple-double and the Oklahoma City Thunder rolled past the Portland Trail Blazers 139-77 on Thursday night, a 62-point victory that matched the fifth-largest rout in NBA history.\n\n\r\n              “It was almost like a perfect storm, to be honest with you,\" Portland coach Chauncey Billups said. \"Nothing really worked for us.”\n\n\r\n              Oklahoma City shattered its previous record for victory margin of 45 points, set twice during the 2012-13 season. The Thunder moved into a tie with the Minnesota Timberwolves for the best record in the Western Conference at 26-11.\n\n\r\n              The Thunder were on the wrong end of the NBA's biggest blowout, losing by 73 to Memphis on Dec. 2, 2021. Gilgeous-Alexander did not play that day, but he remembers being embarrassed for his teammates.\n\n\r\n              “After that game, we addressed it, and we just made a promise to ourselves to never feel that feeling again,\" he said. \"I think it’s been a little bit of our fuel to get to where we are tonight.”\n\n\r\n              It was the Trail Blazers' second-worst loss, having fallen by 65 to Indiana on Feb. 27, 1998.\n\n\r\n              Jalen Williams scored 21 points, Chet Holmgren added 19 and Giddey had 13 points, 10 rebounds and 12 assists for his ninth career triple-double as the Thunder shot 57% from the field. It was a complete victory for an Oklahoma City team that had won at Miami the night before and returned home at 3 a.m. Thursday.\n\n\r\n              “I thought we cleared a couple hurdles tonight,\" Thunder coach Mark Daigneault said. \"I thought the first one was the start of the game, how ready we were to play and the energy we were able to generate, obviously, with a tough schedule, which is a step forward. It’s mind over matter. And then the other hurdle was playing with a lead … I thought we played pretty well with a lead, both ends of the floor.”\n\n\r\n              Portland's Anfernee Simons scored 14 points and Scoot Henderson had 13 on 4-for-21 shooting. The Trail Blazers shot just 27.7% from the field.\n\n\r\n              On the other hand, Oklahoma City had 41 assists on 53 made field goals.\n\n\r\n              “I mean, this was, sheesh -- not much really good to say about this one for us,” Billups said. “I mean, I will say this. I thought that we generated some pretty good looks in the first half. The fact that we couldn’t make pretty much anything deflated us.”\n\n\r\n              Henderson scored the first five points of the game before the Thunder responded with a 22-2 run to take control. The highlight of the run was an odd basket by Holmgren. He drove to the rim on a fast break and was basically tackled from behind by Portland's Jerami Grant. Somehow, Holmgren threw the ball up over his shoulder and into the hoop to give Oklahoma City an 18-7 lead.\n\n\r\n              Oklahoma City dominated from there, stretching the lead to 75-39 at halftime. Portland's frustration boiled over when Shaedon Sharpe and Billups both were called for technical fouls with 1:45 left in the second quarter.\n\n\r\n              The Thunder kept it going in the second half. Giddey threw a pass like a quarterback nearly the length of the court and found Williams for a layup to put the Thunder up 86-46. Oklahoma City outscored the Trail Blazers 43-17 in the third quarter to take a 118-56 edge into the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Visit Minnesota on Friday.\n\n\r\n              Thunder: Host Orlando on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996580.473092
}