{
  "game_id": "0022300450",
  "espn_id": "401585078",
  "date": "Dec 31, 2023",
  "matchup": "ORL @ PHX",
  "headline": "Durant scores 31 points, Beal adds season-high 25 to help Suns beat Magic 112-107",
  "body": "PHOENIX -- — Bradley Beal took off on the break, received the pass in stride from Devin Booker and threw down a powerful two-handed jam over Orlando's Jalen Suggs in the third quarter.\n\n\r\n              The three-time All-Star's stop-and-start first season with the Suns is finally showing signs of promise.\n\n\r\n              Kevin Durant scored 31 points, Beal added a season-high 25 and Phoenix won its third straight game, beating the Magic 112-107 on Sunday night. It was only the fourth time this season that the Suns' star trio of Durant, Beal and Devin Booker played together.\n\n\r\n              “We're very talented, we're very good,” Beal said. “We make it easy for each other.”\n\n\r\n              Beal was playing in just his eighth game this season because of back and ankle injuries. The 30-year-old — acquired in an offseason trade with Washington — shot 10 of 13 from the field, including his powerful dunk in the third quarter.\n\n\r\n              “That's why we're really excited about what Bradley Beal's going to look like in a Suns uniform,” coach Frank Vogel said. \"He doesn't really have his legs under him fully, but he goes 10 for 13, 25 points, several great one-on-one defensive possessions, took a charge, had some really athletic rebounds. He's a dynamic player on both sides of the ball.”\n\n\r\n              Orlando trailed for a big chunk of the evening but rallied to cut it to 89-87 heading into the fourth. Paolo Banchero led the Magic with 12 points in the third on 5-of-7 shooting.\n\n\r\n              Gary Harris hit a long 3-pointer early in the fourth to give Orlando a 96-95 lead — its first since early in the first quarter.\n\n\r\n              The Suns would recover, using a 17-6 run to build a 10-point lead and regain control. Durant shot 12 of 21 from the field and added five rebounds and five assists. Booker scored 21 points and Jusuf Nurkic had 19 points and 13 rebounds. \n\n\r\n              The Suns' backups scored only six points, all by Chimezie Metu.\n\n\r\n              “They've got guys — particularly with Durant, Booker and Brad — any of them can close the game out,” Banchero said. “So when all three of them are out there it's tough. It's just hard to match their shot-making. We had some good looks that didn't go down.”\n\n\r\n              Banchero led the Magic with 28 points, while Franz Wagner added 27. Wendell Carter Jr. had 17 points off the bench. The 21-year-old Banchero shot 12 of 23 from the field and had nine rebounds and seven assists.\n\n\r\n              Durant, Beal and Booker combined for 22 points on the way to a 37-24 lead after one quarter. Phoenix settled for a 67-58 lead at halftime.\n\n\r\n              The Suns' ball movement has been noticeably better with Beal back in the lineup. They lost nine of 12 games before their current three-game winning streak.\n\n\r\n              “It happens when you go through a rough stretch — you watch a lot of film and try to figure out who you want to be as a team,” Durant said.\n\n\r\n              Phoenix also welcomed back guard Josh Okogie, who missed six out of the past eight games because of an ankle injury. He had two rebounds and two assists in seven minutes.\n\n\r\n              The Magic were playing without guard Markelle Fultz (knee) and forward Jonathan Isaac (hamstring). \n\n\r\n              UP NEXT\n\n\r\n              Magic: At Golden State on Tuesday night.\n\n\r\n              Suns: Host Portland on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995718.365778
}