{
  "game_id": "0022000272",
  "espn_id": "401267432",
  "date": "Jan 27, 2021",
  "matchup": "CLE vs. DET",
  "headline": "Sexton scores 29 points, Cavaliers beat Pistons 122-107",
  "body": "CLEVELAND -- — Collin Sexton scored 29 points and Andre Drummond had 23 points, 16 rebounds and five steals against his former team, powering the Cleveland Cavaliers to a 122-107 victory over the Detroit Pistons on Wednesday night.\n\n\r\n                    Taurean Prince added 16 points and rookie Isaac Okoro had 10 points and a season-high six assists to help the Cavaliers snap their two-game losing streak and move back to .500. Cleveland forced 22 turnovers, turning them into 30 points.\n\n\r\n                    “Our main goal is to beat up a team and wear them down,” said Drummond, who spent his first 7 1/2 seasons with the Pistons. “We did a great job of that tonight. We just tried to play aggressive the whole game and force them to make mistakes.\n\n\r\n                    “We got stops and just played our game. That’s really what happened.”\n\n\r\n                    Jerami Grant scored 26 points and Mason Plumlee had 15 points, 12 rebounds and a career-high eight turnovers for Detroit. The Pistons have the worst road record in the Eastern Conference at 1-7.\n\n\r\n                    Drummond made a bank shot midway through the fourth quarter to give Cleveland its largest lead of the night at 108-89. The Cavaliers went ahead for good at 72-69 on a Darius Garland 3-pointer in the third.\n\n\r\n                    “The 22 turnovers are a bad recipe and I take responsibility for that,” Detroit coach Dwane Casey said. “Against Philly (a 119-104 win Monday), we played beautiful basketball, but tonight I didn’t think our focus or understanding of passing was there.”\n\n\r\n                    Cleveland, which had seven players score in double figures, shot 54% from the field and made 11 of 21 3-pointers. Garland had 14 points, and Cedi Osman and Jarrett Allen scored 10 apiece.\n\n\r\n                    “The second half was a clear vision of what we want on the floor,” Cleveland coach J.B. Bickerstaff said. “We shared the ball and we made plays to make each other better on both ends of the court.”\n\n\r\n                    Detroit guard Derrick Rose returned after missing two games with a sore left knee, scoring 13 points in 19 minutes off the bench. Wayne Ellington had 17 points and Delon Wright scored 11 points and dished out seven assists.\n\n\r\n                    The Pistons have committed 46 turnovers in two games against the Cavaliers, both losses. They made a season-high 24 in a 128-119 double-overtime defeat on Dec. 26.\n\n\r\n                    “I don’t think they were necessarily forced,” said Grant, who made 10 of 10 free throws. “I think, more or less, it was us trying to do too much with the basketball.”\n\n\r\n                    “It's hard to stop (Cleveland) when they get going,” Rose said. “We've got to play smarter. That's all it is.”\n\n\r\n                    Cavaliers power forward Larry Nance Jr. was unavailable for the second straight game after spraining his right wrist at Boston on Sunday.\n\n\r\n                    SIMILAR STRATEGY\n\n\r\n                    Casey is encouraged by Cleveland’s development, specifically mentioning Sexton and Garland. The Cavaliers are seventh in the East after finishing with the second-worst record in the NBA last season. “A couple of years ago, Cleveland was where we are now,” Casey said. “They’re an exciting up-and-coming team, like we want to be.”\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: F Blake Griffin (left knee) and G Killian Hayes (right hip) were inactive. Griffin is not playing in back-to-back games for precautionary reasons. … Rookie G Saben Lee was assigned to the G-League in a procedural move. “Saben would have been inactive with Derrick (Rose) back, so this will save days on his two-way contract,” Casey said.\n\n\r\n                    Cavaliers: Garland made his first start since returning from a sprained right shoulder on Jan. 22. The second-year pro missed eight games, but Bickerstaff said he is no longer on a minutes restriction. … F Kevin Love (right calf strain), G Matthew Dellavedova (concussion) and rookie F Lamar Stevens (abdominal strain) were inactive.\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Host the Lakers on Thursday night.\n\n\r\n                    Cavaliers: At New York on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997893.10608
}