{
  "game_id": "0022200223",
  "espn_id": "401468378",
  "date": "Nov 17, 2022",
  "matchup": "DET @ LAC",
  "headline": "Clippers rally to beat Pistons 96-91 in Leonard's return",
  "body": "LOS ANGELES -- — A month into the season, the Los Angeles Clippers are still trying to see the team they're hoping to be.\n\n\r\n              They got a glimpse Thursday night, when Kawhi Leonard was in the starting lineup for the first time and helped stage a fourth-quarter rally to beat the Detroit Pistons 96-91.\n\n\r\n              Leonard finished with six points on 2-of-8 shooting and had five rebounds and four assists in 24 minutes. \n\n\r\n              “It was good to be back,” he said. “I felt good.”\n\n\r\n              Reggie Jackson led the Clippers with 23 points. Paul George and Marcus Morris added 16 points each and Ivica Zubac tied his career high with 18 rebounds.\n\n\r\n              Leonard had missed 12 straight games since coming off the bench in two of the first three games to begin the season. He had been dealing with stiffness in his right knee, which was surgically repaired in July 2021. He missed all of last season while rehabbing.\n\n\r\n              “It's going to be a long journey,” Leonard said. “ACL recovery isn't just one year. It's a two-year process.”\n\n\r\n              Leonard's availability is going to depend on how he's feeling day to day.\n\n\r\n              “He looked pretty good as far as his movement,” Clippers coach Tyronn Lue said. “His impact defensively is huge for us. With him on the floor we're a different team. It gives us a sense of calmness when he has the ball in his hand.”\n\n\r\n              Bojan Bogdanovic scored 26 points and Jaden Ivey added 18 points for the Pistons. They lost their fifth in a row playing without injured Cade Cunningham.\n\n\r\n              Killian Hayes scored to give the Pistons their last lead at 76-75 before the Clippers took over. \n\n\r\n              George hit a 3-pointer, Leonard made a pair of free throws and then assisted on Morris' 3-pointer. George dunked one-handed after a steal and Leonard scored to push the Clippers' lead to 87-79.\n\n\r\n              “The fourth quarter we just didn't execute what we wanted to do offensively, kind of rushed some shots,” Ivey said. “Paul George was just into the basket and it just opened up their offense. That's on us. We have to be better as a team.”\n\n\r\n              The Clippers took their first lead since the opening quarter on a three-point play by Terance Mann late in the third that made it 67-65. The second unit joined Zubac in outscoring the Pistons 13-6 to lead 68-67 going into the fourth.\n\n\r\n              Detroit led most of the game, using a 15-0 run in the first quarter to build its largest lead of 12 points. \n\n\r\n              The Clippers rallied to tie it at 30-all before the Pistons closed on a 20-12 run to head into halftime leading 50-42. Bogdanovic scored nine points in the spurt.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Cunningham (left shin soreness) is out this week. \n\n\r\n              Clippers: Luke Kennard (right calf strain) sat out. \n\n\r\n              UP NEXT\n\n\r\n              Pistons: At the Los Angles Lakers on Friday night.\n\n\r\n              Clippers: Host San Antonio on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994392.511625
}