{
  "game_id": "0022401019",
  "espn_id": "401705585",
  "date": "Mar 21, 2025",
  "matchup": "DAL vs. DET",
  "headline": "Dinwiddie and Washington lead Mavericks past Pistons 123-117, ending 4-game losing streak",
  "body": "DALLAS -- — Spencer Dinwiddie scored a season-high 31 points while P.J. Washington Jr. added 27, with a season-high five 3-pointers, as the Dallas Mavericks beat the Detroit Pistons 123-117 on Friday night.\n\n\r\n              Eleven of Dinwiddie’s points came at the free-throw line, where Dallas hit 27 of 36 to Detroit’s 14 of 19.\n\n\r\n              Klay Thompson scored 20 and Naji Marshall had 19 points and 11 rebounds for the Mavericks, who snapped a four-game losing streak and won for only the second time in 11 games as they battle to earn a play-in berth after playing in last year’s NBA Finals.\n\n\r\n              Cade Cunningham scored a game-high 35 points on 15 for 30 shooting for the Pistons, sixth in the East and one game behind Milwaukee.\n\n\r\n              Takeaways\r\n              Pistons: Starting guard Tim Hardaway Jr., who played five-plus seasons for Dallas before being traded to Detroit last summer, was honored with a video presentation in the first period but left midway through the second quarter with a right ankle sprain with no points in eight minutes.\n\n\r\n              Mavericks: They used all nine eligible players and set a franchise record using their 39th starting lineup. Forward Kessler Edwards, with one NBA game’s eligibility remaining on a two-way contract, was held out. Anthony Davis (left adductor strain), Dereck Lively II (right ankle stress fracture) and Daniel Gafford (right knee sprain) practiced Friday with the G League’s Texas Legends. Dallas coach Jason Kidd provided no timetable for their return to the Mavericks’ active roster with 11 games left.\n\n\r\n              Key moment\r\n              The Mavericks led 118-115 with 23.8 seconds left when they broke a full-court press with Brandon Williams, also a two-way player, driving to the basket to score with a foul for a three-point play.\n\n\r\n              Key stat\r\n              The Pistons, second in the NBA averaging 19.4 fast-break points, were held to six.\n\n\r\n              Up next\r\n              The Pistons will host New Orleans on Sunday. The Mavericks will visit Brooklyn on Monday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997137.3903081
}