{
  "game_id": "0022300880",
  "espn_id": "401585508",
  "date": "Mar 04, 2024",
  "matchup": "MIL vs. LAC",
  "headline": "Bucks don't have Antetokounmpo but still beat Clippers 113-106 for 6th straight victory",
  "body": "MILWAUKEE -- — Not even the absence of Giannis Antetokounmpo could cool off the Milwaukee Bucks.\n\n\r\n              Damian Lillard scored 41 points as the Bucks came from behind to beat the Los Angeles Clippers 113-106 on Monday night for their sixth straight victory. Antetokounmpo watched from the bench with left Achilles tendinitis as the two-time MVP missed his third game of the season.\n\n\r\n              “I think it just shows who we're becoming,” Lillard said.\n\n\r\n              The Bucks are unbeaten since the All-Star break as they get ready to begin a four-game trip to California that starts Wednesday at Golden State and includes a rematch with the Clippers on Sunday. It's an impressive turnaround for a team that entered the break 3-7 in new coach Doc Rivers' first 10 games.\n\n\r\n              The Bucks won without Antetokounmpo on Monday just as they've been winning without three-time All-Star Khris Middleton, who missed an 11th straight game with a sprained left ankle.\n\n\r\n              “Nobody talked about who wasn't playing before the game,” Lillard said. “It was literally like we were in the locker room, Doc didn't come in there and say, ‘All right, Giannis is out. Khris is out.’ It was like, we went in there, we talked about the scouting report and what we needed to do to win the game, and that was it. I think that just shows what's expected, the standard that we're starting to have and who we're becoming as a team.”\n\n\r\n              James Harden and Paul George scored 29 points each for the Clippers, who ran out of gas down the stretch while playing one night after an 89-88 victory at Minnesota. Kawhi Leonard added 16 points.\n\n\r\n              The Bucks trailed by 13 in the last minute of the third period but won by outscoring the Clippers 23-10 over the final five minutes.\n\n\r\n              “When they went to that zone, I think we got a little jump shot-happy rather than keep attacking the basket and getting into the paint,” Clippers coach Tyronn Lue said. “I think we were in the bonus pretty early in the fourth quarter. They did a good job of going to the zone, and then we didn't handle it well.”\n\n\r\n              Bobby Portis scored 14 of his 28 points in the fourth quarter and finished with a season-high 16 rebounds. He became the first NBA player this season to have at least 25 points and 15 rebounds while coming off the bench.\n\n\r\n              “Guys needed to step up in their roles,” Portis said. “I just feel like it was one of those times for me just to step up and be a little more aggressive than I probably was before.”\n\n\r\n              Patrick Beverley added 12 points and sparked the winning rally. His 3-pointer tied the game at 96 with 4:33 left.\n\n\r\n              On the Clippers’ ensuing possession, Beverley stole the ball to set up Lillard's driving layup with 4:10 remaining that gave the Bucks their first lead since the opening period.\n\n\r\n              After Brook Lopez blocked Leonard’s driving layup attempt, A.J. Green hit a deep 3-pointer to make it 101-96. Portis scored the last four points of the 15-0 surge that put the Bucks ahead for good.\n\n\r\n              The Clippers got the lead down to five with 1:31 left, but Portis scored five straight points and the Bucks didn’t look back.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Visit the Houston Rockets on Wednesday.\n\n\r\n              Bucks: Begin a four-game trip Wednesday at Golden State.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996507.992678
}