{
  "game_id": "0021700074",
  "espn_id": "400974825",
  "date": "Oct 27, 2017",
  "matchup": "MIN vs. OKC",
  "headline": "Towns has 33 and 19 as Timberwolves hold off Thunder 119-116",
  "body": "MINNEAPOLIS --  When Jimmy Butler was sidelined for two games with an upper respiratory infection, the Minnesota Timberwolves lacked energy and struggled on defense. The end result was a pair of losses by an average of 22 points.\n\nIn Butler's return Friday night against Oklahoma City, it was evident just how different a team Minnesota is with him on the court.\n\nButler scored 13 of his 25 points in the fourth quarter and helped the Timberwolves hold on for a 119-116 win over the Thunder. His veteran leadership was felt on both ends of the floor for Minnesota, which improved to 3-2.\n\n\"He makes a big difference,\" Timberwolves coach Tom Thibodeau said. \"Just having his presence -- he's a great leader, does the right things on the floor.\"\n\nKarl-Anthony Towns had 33 points and 19 rebounds to lead Minnesota. Towns also had arguably his best defensive game of the young season, posting a season-high four blocks.\n\nWhile Towns and other Timberwolves fed off Butler's energy, Butler did what he could at both ends to keep the Thunder at bay in the final minutes. He scored nine points in the final 4:09 to help the Wolves close it out. He also played a team-high 38 minutes in his return from illness.\n\n\"I just wanted to win, man,\" Butler said. \"These guys out there with me, they just played so incredibly hard. When we're playing like that, we look really good, we feel really good, and we end up winning games.\"\n\nRussell Westbrook led the way for Oklahoma City with 27 points. He had nine assists and eight rebounds, falling just shy of a triple-double. Carmelo Anthony added 23 points for the Thunder.\n\nIt was the second time in a week the Timberwolves edged the Thunder in a close game. Minnesota won Sunday in Oklahoma City on a buzzer-beater by Andrew Wiggins.\n\nThis time, Anthony's 3-point attempt to tie it at the end of regulation was no good.\n\n\"Obviously, they're a very talented team and we've got a talented team as well,\" Thunder coach Billy Donovan said. \"Both games have been hard-fought.\"\n\nMinnesota point guard Jeff Teague had 16 points and 10 assists for his first double-double of the season. Teague hit a free throw with 12.4 seconds to play, giving the Wolves a three-point lead.\n\nMinnesota overcame an 11-point deficit to enter halftime with the game tied at 59. A three-point play by Towns put the Wolves up two with just under a minute to play in the half.\n\nThere were 31 lead changes in all, and the game was tied 15 times.\n\nAnthony couldn't miss from the floor in the second quarter, scoring the Thunder's first nine points of the period on several long jumpers.\n\nThe Timberwolves used an 8-0 run in the third to go ahead 83-78. Towns and Taj Gibson each had four points during that stretch, which was capped by Gibson's dunk in transition.\n\nThe win helped Minnesota move past a pair of blowout losses to Indiana and Detroit.\n\n\"We got humbled the last few games,\" Gibson said. \"You just saw a completely different team today.\"\n\nTIP-INS\n\nThunder: Steven Adams scored the Thunder's first eight points after halftime, including a pair of free throws and an alley-oop dunk. . Oklahoma City entered with the worst free throw percentage in the NBA (67.5 percent), but was 22 of 25 from the line against Minnesota.\n\nTimberwolves: Wiggins shot 5 of 15 from the floor. . C Gorgui Dieng hit a long 2-point shot that beat the buzzer to end the third quarter. That gave Minnesota a 90-89 lead to start the fourth.\n\nANTHONY GETS LAST LOOK\n\nWestbrook has often been the one to take the last shot for the Thunder, but he deferred to Anthony late in this game. With Oklahoma City trailing by three, it was Anthony who had a look at a potential tying 3-pointer.\n\nHis shot in the final seconds was no good and Minnesota grabbed the rebound to seal it.\n\n\"We had to push the ball at that point in time and I think Russell was just surveying the field and trying to find a way maybe to get Carmelo trailing a little bit there,\" Donovan said. \"I'll see the film, but I do think that Russell is going to try in those situations to get the best shot, and if he can get Carmelo a shot, I think he's going to try to generate a shot for him.\"\n\nUP NEXT\n\nThunder: At Chicago on Saturday night.\n\nTimberwolves: At Miami on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764992696.9035242
}