{
  "game_id": "0021501079",
  "espn_id": "400828966",
  "date": "Mar 25, 2016",
  "matchup": "PHX @ SAC",
  "headline": "Cousins scores 29 points in Kings' rout over Phoenix",
  "body": "SACRAMENTO, Calif. -- Rookie Willie Cauley-Stein displayed his emerging game at the offensive end Friday night, and the Sacramento Kings got an elusive home victory.\nDeMarcus Cousins had 29 points and 11 rebounds and Cauley-Stein had a career-high 26 points while the Kings beat the Phoenix Suns 116-94.\nCauley-Stein entered the NBA with a reputation for being a strong, athletic defender who could guard multiple positions. Any offense he provided was typically a bonus, even during his college career at Kentucky.\nAgainst the Suns in a 29-minute reserve role, Cauley-Stein had plenty of opportunities, making 11 of 19 shots, both career-highs. He had numerous alley-oop dunks but also added a driving basket with his left hand, a hook shot and looked smooth on a short jumper.\n\"It was fun out there. I ain't put up 19 shots in my whole life. It was different. I liked it though,\" said Cauley-Stein, who also six rebounds, three steals and two blocks. \"I mean it was just good to put it into a game setting.\"\nCauley-Stein also shot a pair of 3s despite entering the game with no attempts.\n\"When your teammates are telling you to score and telling you to shoot 3s, when you ain't shot a 3 in your whole life, that's cool,\" Cauley-Stein said. \"I mean that makes you feel good and like all the work you've put in, they are telling you to show what you have been working on.\"\nIt was a rare home victory for Sacramento, which had dropped seven straight at Sleep Train Arena since defeating Denver nearly five weeks ago. The Kings are 15-20 at home and avoided matching their longest home losing streak in the Sacramento era, which they had done twice before.\nThe Kings entered the game having lost two straight and 9 of 11.\n\"Home court is an issue that's frustrated everyone,\" Kings coach George Karl said. \"I think to be a successful team you have to win 30 games at home, instead of 15 or 16.\"\nRudy Gay had 15 points for the Kings, who broke the game open in the third quarter. Quincy Acy had 14 points, Seth Curry had 12 and Darren Collison had 11.\nDevin Booker led Phoenix with 26 points but also committed nine turnovers, including eight in the first half. Alex Len had 14 points, Mirza Teletovic had 12 and John Jenkins added 11 points and seven assists.\n\"Personally, it was one of the worst games I've had this year,\" Booker said. \"It was evident with all the turnovers I had. I feel like that's why we started off so bad. But I'll take this one. That's what's good about the NBA. We play again tomorrow night.\"\nThe Kings took a 10-point lead into halftime and built the maring to 89-67 by outscoring the Suns 31-19 in the third quarter.\nThe Suns were 5-5 in their last 10 games and had a strong first quarter, leading 27-25. But they shot poorly the rest of the game and were sloppy with the ball, turning it over 22 times and shooting 37 percent.\n\"They pushed and played fast and we didn't get back on defense a few times,\" Len said. \"They kind of had their way in the second and third quarters.\"\nRONDO BREAKS KINGS ASSIST RECORD\nRajon Rondo, the NBA assist leader this season, had 12 assists and passed Reggie Theus' Sacramento-era single-season franchise assist record that was established in 1985-86.\n\"I just found out and I didn't know. But it's definitely an honor,\" Rondo said. \"A lot great players have played here and to be at the top of any list is humbling.\"\nOn Rondo's most spectacular assist, he tossed a court-length pass that Curry caught in stride and converted with a reverse layup. Later in the quarter, Rondo found Gay open for a 3-pointer to pass Theus with his 789th assist this season.\n\"I'm not surprised. I can tell you that,\" Cousins said. \"But it's great coming from that point-guard position.\"\nTIP INS\nSuns: Booker got called for a technical foul in the second quarter after battling Cousins for a loose ball near the Kings bench. ... Tyson Chandler missed his second straight game with back spasms. ... The Suns played without second leading scorer Brandon Knight, who had an upset stomach prior to game time.\nKings: Curry was a surprise starter, making the first start in his NBA career. He missed 4 of 5 shots in the opening quarter, but had 10 points in the second half. ... The Kings converted 29 of 39 free throws, while the Suns went 15 for 23. ... Reserve Marco Belinelli had a sore right heel and went scoreless in 10 first-half minutes.\nUP NEXT\nSuns: Face Boston at home on Saturday night.\nKings: Host Dallas at home on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764994825.210521
}