{
  "game_id": "0021701181",
  "espn_id": "400975927",
  "date": "Apr 06, 2018",
  "matchup": "DAL @ DET",
  "headline": "Jackson scores 24 as Pistons beat Mavericks 113-106 in OT",
  "body": "DETROIT --  The Detroit Pistons are just playing for pride in the final days of the NBA season.\n\nThey've been eliminated from the playoffs -- and haven't even won a postseason game in 10 years -- and they traded away their first-round pick for Blake Griffin.\n\nReggie Jackson, howver, found a reason to step up against the Dallas Mavericks.\n\nJackson scored 12 of his 24 points in the fourth quarter and overtime as the Pistons beat the Mavericks 113-106 Friday night.\n\n\"The plan was just to win the game,\" Jackson said. \"They had some young guys out there who really want to prove something, and they were all playing amazing, so we had to find a way to stop them.\"\n\nJackson played 35 minutes, his most since returning from missing 37 games with a sprained ankle.\n\n\"He made a lot of great plays out of the pick-and-roll, to the point that I was getting upset if we ran anything else,\" Pistons coach Stan Van Gundy said. \"He was able to keep that going into overtime, which was good to see, and he was one of the few guys we had trying on defense tonight.\"\n\nAndre Drummond added 19 points and 16 rebounds for the Pistons, who had six scorers in double figures.\n\nJohnathan Motley led the Mavericks with career highs of 26 points and 12 rebounds.\n\n\"You have to tip your cap to our player-development people and our G-League people, because they've been coaching him up all year to be ready for this opportunity,\" Dallas coach Rick Carlisle said.\n\nMotley, playing his ninth NBA game, also held Drummond in check for most of the game.\n\n\"He's a great player who is dominating the league, so this was really going into the fire for me,\" he said. \"I'm confident in my ability, and I think I can play in this league, so this was a good test for me.\"\n\nDetroit led 101-98 with a minute left in regulation, but Carlisle kept starters Harrison Barnes, Dwight Powell and Dennis Smith Jr. on the bench.\n\nLuke Kennard missed a clinching 3-pointer, and after Dallas turned the ball over, Jackson missed a shot that would have made it a five-point game with 30 seconds left.\n\nMotley tied the score with a 3 with 10.1 seconds left, and Jackson's buzzer-beater bounced off the front rim.\n\nDetroit moved ahead 110-105 with 1:29 in overtime, and after a Dallas offensive foul, Jackson's floater sealed the victory.\n\nThe game was Detroit's first since being eliminated from playoff contention by Wednesday's loss to the Philadelphia 76ers.\n\n\"I think we can call that a low-intensity game on both sides,\" Van Gundy said. \"There wasn't a lot of urgency to win the game by either team until overtime, but Reggie made the plays we needed to win it.\"\n\nWith both teams eliminated from playoff contention and playing short-handed, the quality of play suffered. On one first-quarter possession, the Pistons were forced into a 3-point try by Drummond as the shot clock expired. Drummond missed and fell to 0-for-10 on 3s this season and 5 for 29 in his six-year career.\n\nMaxi Kleber's buzzer-beating jumper gave the Mavericks a 54-53 lead at halftime. Motley and Barnes had 13 points each for Dallas, while Anthony Tolliver and Henry Ellenson combined for 20 points at Blake Griffin's power-forward spot.\n\nNeither team was able to take control in the third quarter, but a late 3 by Langston Galloway gave the Pistons a 78-75 lead going into the final 12 minutes of regulation.\n\nThe Mavericks began the fourth with a 10-2 run, but couldn't hold the advantage.\n\nTIP INS\n\nMavericks: Three of Dallas' top five scorers -- Jose Juan Berea (rib strain), Dirk Nowitzki (ankle) and Wesley Matthews (leg) -- missed the game. ... Nowitzki averaged 19.7 points and 8.0 rebounds in 19 games on the Pistons' home court at the Palace of Auburn Hills. This would have been his first, and possibly only, game at Little Caesars Arena.\n\nPistons: Reggie Bullock sat out with swelling in his left knee, while Griffin missed his fifth straight game with an ankle injury. ... Drummond needs 48 rebounds in the final three games to become the first NBA player to average 16 per game since Dennis Rodman in 1996-97. Rodman, who did it five times with the Pistons, San Antonio Spurs and Chicago Bulls, is the only player to average 16 for a season since Moses Malone in 1978-79.\n\nUP NEXT\n\nMavericks: At the Philadelphia 76ers on Sunday in their last road game of the season.\n\nPistons: At the Memphis Grizzlies on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764993934.734267
}