{
  "game_id": "0022300058",
  "espn_id": "401584146",
  "date": "Nov 28, 2023",
  "matchup": "MIN vs. OKC",
  "headline": "Timberwolves top Thunder 106-103 despite Edwards injury with big all-around game by Gobert",
  "body": "MINNEAPOLIS -- — Rudy Gobert had 17 points, 16 rebounds and four blocks, reserve Troy Brown Jr. scored a season-high 17 points and the Minnesota Timberwolves withstood an injury to Anthony Edwards to beat the Oklahoma City Thunder 106-103 on Tuesday night in the NBA In-Season Tournament.\n\n\r\n              Edwards had 12 of his 21 points in the third quarter to lead the Wolves (13-4) back after trailing most of the first half, before landing hard during a dunk attempt and leaving the game with a bruised right hip.\n\n\r\n              Shai Gilgeous-Alexander scored 32 points on 13-for-22 shooting for the Thunder. His 37-foot try to tie at the buzzer, his only 3-point attempt of the night, was well off the mark.\n\n\r\n              Brown made one of two foul shots with 4.5 seconds left to give the Thunder an opening, but the Wolves capped a stifling defensive performance in the second half — fueled by a switch to zone — with one more denial.\n\n\r\n              “I just think our mindset was much better. I thought we were more physical,” Gobert said.\n\n\r\n              Brown, in his first year with the Wolves after playing last season with the Los Angeles Lakers, swished a fadeaway 3-pointer from 29 feet for a five-point lead with 1:39 to go. Then he got a layup in traffic to fall with 31.6 seconds left to make it 103-98.\n\n\r\n              “My biggest thing is bringing energy, starting with defense and rebounding,” Brown said. “If the ball comes to me, that’s what I work out for.”\n\n\r\n              Chet Holmgren, who went 6 for 20 from the floor for 16 points, hit a 3-pointer with 26.6 seconds left to bring the Thunder back within two. Karl-Anthony Towns, who had 13 points and 10 rebounds, answered with a pair of free throws on the other end.\n\n\r\n              The Thunder (11-6) had only 42 points in the second half and shot 6 for 26 in the third quarter against a Wolves team that leads the Western Conference with the best 17-game start in franchise history.\n\n\r\n              “Teams are going to throw different things at you when things are working. To their credit, they went zone,” Thunder coach Mark Daigneault said.\n\n\r\n              Gobert, the three-time NBA Defensive Player of the Year, was determined not to let the 21-year-old Holmgren — they're both 7-foot-1 — get the best of him. \n\n\r\n              “He’s a tone-setter for your defense,” Wolves coach Chris Finch said.\n\n\r\n              Holmgren, who played at Minnehaha Academy High School and Gonzaga, was sidelined for all of last season with a foot injury. The Minneapolis native and second-overall pick in the 2022 draft was playing his first pro game in his hometown. \n\n\r\n              “It’s good experience that he can calibrate for the next time we play this team,” Daigneault said.\n\n\r\n              During one possession late in the fourth quarter, Gobert was all over the paint with a long arm in Holmgren's face — twice forcing him into missed shots, including an air-balled jumper from the top of the key. Gobert pumped his fist after each miss with the Timberwolves up 95-90.\n\n\r\n              “I love when a guy tries to attack me, especially multiple times in a row. And credit to Chet, because he kept going,” Gobert said. “He was being aggressive and pushed me to really move my feet even more.”\n\n\r\n              The Wolves finished 3-1 in the Western Conference Group C. The Thunder went 1-3. Golden State played at Sacramento later Tuesday to determine the group champion. By only winning by three points, the Wolves were eliminated from contention because point differential serves as the second tiebreaker behind head-to-head results.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host the Lakers on Thursday.\n\n\r\n              Timberwolves: Host Utah on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996490.777791
}