{
  "game_id": "0022200696",
  "espn_id": "401468851",
  "date": "Jan 21, 2023",
  "matchup": "MIN vs. HOU",
  "headline": "Edwards scores 44; Wolves hand Rockets 13th straight loss",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored a season-high 44 points, D'Angelo Russell added 23 and the Minnesota Timberwolves handed the Houston Rockets their 13th straight loss with a 113-104 victory Saturday night. \n\n\r\n              Edwards eclipsed 40 points for the first time this season on 17-of-29 shooting from the field, including seven 3-pointers and a trio of thunderous dunks. Minnesota has won eight of its last 11 games. \n\n\r\n              “We talked yesterday about how important this game was for us, how he needed to set the tone,” Timberwolves coach Chris Finch said. “He certainly did that. He was special today, both ends of the floor, really.”\n\n\r\n              Nathan Knight provided a jolt of the bench, scoring a season-high 19 points. \n\n\r\n              Houston's Alperen Sengun scored 19 points and grabbed 16 rebounds, taking advantage of a Timberwolves team that was without Rudy Gobert (right groin soreness) for the third consecutive game. Sengun made his first seven field goals and was the catalyst for Houston outrebounding Minnesota 56-30. \n\n\r\n              Eric Gordon added 16 points and Tari Eason finished with 14 points and nine rebounds. Jalen Green, Houston's leading scorer this season, was held to 10 points. \n\n\r\n              Edwards had eight of the Wolves' 16 field goals in the first half and scored 19 points. The rest of the team had 31 points on 26% shooting. Then in the third quarter, he scored 16 as the Timberwolves orchestrated a 15-2 run to climb out of a 10-point hole.\n\n\r\n              “I just knew we had to do something, man,” Edwards said of his third quarter. “My shot was actually going in tonight so I was pretty happy.”\n\n\r\n              Minnesota was helped by the Rockets' carelessness with the ball. Houston, the NBA leader in turnovers per game, committed 23 that led to 30 points for Minnesota. \n\n\r\n              “Turnovers were the story of the game,” Rockets coach Stephen Silas said. “Twenty-three turnovers in a nine-point game kill you, not to mention 14 missed free throws.”\n\n\r\n              STREAK CONTINUES\n\n\r\n              The 13-game losing streak is the longest in the NBA this season and longest since the Detroit Pistons lost 14 straight between November and December 2021. The Rockets' last win came Dec. 26, a 133-118 victory over the Chicago Bulls. \n\n\r\n              “Going through these moments and going through this time will make it even sweeter when we get through it,” said Silas, who added he's tried to keep the team to stick to its routines despite the struggles. “We are just young and we are going to make mistakes and there’s going to be adversity, but as a result we are going to be well tested as we move forward and get better.” \n\n\r\n              TIP-INS\n\n\r\n              Rockets: Kevin Porter Jr. (back) will be re-evaluated in about a week. He's missed the last six games. “The (doctors) are seeing there’s still pain and it has to be pain free,\" Silas said ... Jabari Smith Jr. (ankle) was held out, his second missed game of the season. Smith left in the third quarter of Wednesday's loss to Charlotte and did not return. ... The Rockets have turned the ball at least 20 times in 10 games this season.\n\n\r\n              Timberwolves: Taurean Prince left in the third quarter and did not return with a left ankle sprain ... Gobert has missed nine games this season. It's the second time he's missed three consecutive games. Naz Reid started in Gobert's place. There remains “no timetable” on the return of Karl-Anthony Towns, Finch said.\n\n\r\n              UP NEXT\n\n\r\n              The Rockets host the Timberwolves Monday in the second game of the home-and-home series.",
  "source": "espn_api",
  "crawled_at": 1764995170.434864
}