{
  "game_id": "0021600740",
  "espn_id": "400899433",
  "date": "Feb 01, 2017",
  "matchup": "CHI @ OKC",
  "headline": "Butler scores 28 and Bulls rout Thunder 128-100",
  "body": "OKLAHOMA CITY --  The Chicago Bulls got just the start they needed for their six-game road trip.\n\nJimmy Butler scored 28 points to help the Bulls rout the Oklahoma City Thunder 128-100 on Wednesday night.\n\nDwyane Wade had 18 points and seven assists for the Bulls, who shot 60.5 percent from the field overall and 68 percent in the second half. They needed the momentum on a trip that includes games at Houston and Golden State.\n\n\"This was just a great team win from start to finish,\" Wade said. \"We really came out and executed our game plan, especially offensively.\"\n\nRussell Westbrook had 28 points and eight assists, and Jerami Grant scored a season-high 15 points for the Thunder, who lost their third straight overall and had their five-game home winning streak snapped.\n\nWestbrook made 10 of 23 shots.\n\n\"You just gotta challenge every shot,\" Butler said. \"He's a hell of a player, getting downhill, at the basket. He can make the outside shot and loves to get his teammates involved.\"\n\nIt took until the fourth quarter for someone other than Westbrook to reach 10 points for the Thunder. Oklahoma City shot just 38 percent from the field and made 10 of 37 3-pointers. It was the second-worst loss of the season for Oklahoma City, behind a 34-point loss in Memphis.\n\n\"I don't think we were very good tonight, especially on the defensive end of the floor,\" Thunder coach Billy Donovan said.\n\nButler scored 18 points in the first half to help the Bulls take a 55-47 lead at the break.\n\nChicago started the second half on a 17-4 run to take a 72-51 lead. The Thunder trimmed the deficit to 14, but the Bulls bounced right back and led 94-73 at the end of the third quarter.\n\nWestbrook played less than a minute in the fourth quarter, sitting down for good with 8:14 remaining and the Bulls ahead 108-82.\n\n\"We just try to pack the paint and make them make shots,\" Wade said. \"We were able to get them to miss some and go down and not see their defense all night and score a little in transition.\"\n\nTIP INS\n\nChicago's Cristiano Felicio made a hook shot as time expired in the first quarter to put the Bulls up 21-20. ... C Robin Lopez was issued a technical foul in the third quarter. ... Chicago won 105-96 on Christmas Day last season in Oklahoma City.\n\nThunder: C Enes Kanter missed his third consecutive game with a fractured right forearm. He was on the bench with a cast on the arm. ... F Domantas Sabonis went 0 for 5 in the first half and finished 1 for 10 with two points.\n\nFAMILY TIES\n\nBulls: G Jerian Grant and his brother, Jerami were on opposing teams. Jerian scored 12 points. The game ended with Jerami playfully guarding Jerian. Their father, former NBA player Harvey Grant, attended the game.\n\nQUOTABLE\n\nButler, paraphrasing fictional super-villain Harvey Dent when asked why he's so outspoken: \"In the wise words of Harvey Dent, you either die the hero, or you live long enough to become the goat. It's an opportunity to be who I am.\"\n\nSTAT LINES\n\nOklahoma City's players other than Westbrook shot a combined 28 for 77 from the field.\n\nUP NEXT\n\nThe Bulls will play at the Houston Rockets on Friday.\n\nThe Thunder will host the Memphis Grizzlies on Friday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP",
  "source": "espn_api",
  "crawled_at": 1764995044.0044212
}