{
  "game_id": "401809792",
  "espn_id": "401809792",
  "date": "Nov 21, 2025",
  "matchup": "TOR vs WSH",
  "headline": "Brandon Ingram scores 24 points as Raptors rout Wizards 140-110 to reach NBA Cup quarterfinals",
  "body": "TORONTO -- — Brandon Ingram and RJ Barrett each scored 24 points, Scottie Barnes had 23 and the Toronto Raptors became the first team to reach the NBA Cup quarterfinals by beating the Washington Wizards 140-110 on Friday night.\n\n\r\n              Toronto secured first place in Group A with the victory and Indiana’s loss at Cleveland.\n\n\r\n              Sandro Mamukelashvili scored a season-high 23 points and Immanuel Quickley added 17 as Toronto improved to 3-0 in NBA Cup play and extended its winning streak to six games.\n\n\r\n              CJ McCollum scored 20 points, Tre Johnson had 14 and Cam Whitmore added 11 for the woeful Wizards (1-14), who lost their 13th straight and fell to 0-10 against Eastern Conference opponents.\n\n\r\n              Jamal Shead had a season-high 10 assists for the Raptors. Toronto has won 10 of 11 since a four-game skid that followed a season-opening win at Atlanta.\n\n\r\n              The Raptors set a season high in points. The 30-point margin of victory was Toronto’s biggest this season, eclipsing a 28-point home win over Milwaukee on Nov. 4.\n\n\r\n              Bilal Coulibaly gave Washington its only lead by scoring the game’s opening basket on a fast-break dunk. Toronto responded with 11 consecutive points and never trailed again.\n\n\r\n              Coulibaly didn’t make another shot, missing five attempts from long range.\n\n\r\n              The Raptors led 105-77 through three quarters and improved to 10-0 this season when taking a lead to the fourth.\n\n\r\n              The Wizards missed 12 of their first 13 attempts from 3-point range and finished 12 for 41 from distance. Washington’s starters combined to go 3 for 21 from beyond the 3-point line.\n\n\r\n              Wizards center Alex Sarr sat for the second straight game because of a sore left big toe. Marvin Bagley III (right hip contusion) was also out.\n\n\r\n              Raptors rookie Collin Murray-Boyles missed his second straight game because of a sore right knee.\n\n\r\n              Up next\r\n              Wizards: At Chicago on Saturday.\n\n\r\n              Raptors: Host Brooklyn on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042666.6992629
}