{
  "game_id": "401810091",
  "espn_id": "401810091",
  "date": "Nov 16, 2025",
  "matchup": "HOU vs ORL",
  "headline": "Durant's 35 points, Sengun's 30 points, 12 rebounds lead Rockets to 117-113 OT win over Magic",
  "body": "HOUSTON -- — Kevin Durant scored 35 points and Alperen Sengun had 30 points and 12 rebounds to help the Houston Rockets rally for a 117-113 overtime victory over the Orlando Magic on Sunday night.\n\n\r\n              Orlando led by a point when Amen Thompson put the Rockets on top on a dunk with an assist from Durant with less than a minute left in overtime. Jabari Smith Jr. blocked a layup by Franz Wagner and Durant’s step-back jumper made it 113-110 with 9.2 seconds left.\n\n\r\n              Wagner made two free throws with 8.7 seconds to go, pulling the Magic within 1. But, Reed Sheppard made two free throws for Houston to extend the lead to 115-112 with 4.1 seconds left.\n\n\r\n              Wendell Carter Jr. made one free throw, but was called for a lane violation on the second attempt, making it Houston leading 115-113. Thompson made two free throws after that to seal Houston’s fourth straight victory.\n\n\r\n              Wagner scored a season-high 29 points and Desmond Bane also set his season high with 26 points to lead the Magic on a night they were missing both Paolo Banchero and Jalen Suggs because of groin injuries.\n\n\r\n              The Rockets trailed by as many as 11 in the fourth quarter before using a big run to get back in it.\n\n\r\n              Durant made a 3-pointer with 21.4 seconds in regulation to tie it at 100.\n\n\r\n              Sengun blocked a layup by Bane with 5.3 seconds remaining and officials said it was Orlando’s possession after the ball sailed out of bounds. The Rockets challenged the call and it was overturned.\n\n\r\n              Sengun threw the inbounds pass intended for Durant, but he slipped and Anthony Black stole the ball and finished with a dunk to put the Magic on top. He was fouled by Sengun, but missed the free throw to give the Rockets another chance.\n\n\r\n              Sengun made a shot in the lane just before the clock expired to tie it at 102-all and send it to overtime.\n\n\r\n              Up next\r\n              Magic: Host Golden State on Tuesday.\n\n\r\n              Rockets: Visit the Cleveland Cavaliers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042636.40395
}