{
  "game_id": "0022200741",
  "espn_id": "401468896",
  "date": "Jan 28, 2023",
  "matchup": "DEN @ PHI",
  "headline": "Embiid scores 47 as 76ers beat Jokic, Nuggets 126-119",
  "body": "PHILADELPHIA -- — Joel Embiid won the battle of MVP candidates with 47 points and 18 rebounds as the Philadelphia 76ers extended their winning streak to seven games with a 126-119 win over Nikola Jokic and the Denver Nuggets on Saturday.\n\n\r\n              Jokic and Embiid have finished first and second in voting for the NBA's Most Valuable Player award over the last two seasons. Both are among the top candidates for MVP as this season hits the halfway mark, although Embiid was not named among the All-Star starters from the Eastern Conference.\n\n\r\n              “I'm used to it and it's not the first time,\" Embiid said. “I think it's more of a motivation to go out there and try to win the whole thing. That's the only way that I'll get that respect.”\n\n\r\n              Jokic gave Embiid a nod for his play.\n\n\r\n              “He’s really talented,” Jokic told the Denver Post of Embiid. “Really shifty.”\n\n\r\n              James Harden had 17 points and 13 assists, and Tobias Harris scored all 14 of his points in the second half after being shut down by Denver's defense in the first half.\n\n\r\n              “We were able to figure some things out and get some stops,” Harris said. “Guys stepping up and making shots was huge for us to cut the deficit in the fourth quarter to try and make something happen.”\n\n\r\n              Jokic had 24 points, eight rebounds and nine assists for Denver, which has lost three of its last four games. Jamal Murray chipped in 22 points and Michael Porter added 20.\n\n\r\n              “We turned it over and they just turned up the pressure on us,” Nuggets coach Michael Malone said. “They got to the basket way too easy with their attack mentality. And we just got way too careless with the basketball.\"\n\n\r\n              Embiid has scored 40 or more points nine times this season and 35 times in his career. In addition to the All-Star snub, Embiid was also given a $25,000 fine by the NBA on Friday for an on-court demonstration after-basket celebration during Wednesday night's win over Brooklyn.\n\n\r\n              “Let's keep offending Joel by fining him and not putting him among the All-Star starters,” Philadelphia coach Doc Rivers said sarcastically.\n\n\r\n              The Nuggets began the day with the second-best team field goal percentage at 50.7% and tops in 3-point percentage at 39.5%. In the first half, they overwhelmed Philadelphia's perimeter defense, shooting 65.9% (29 for 44) from the floor and 10 of 17 (58.8%) from beyond the 3-point line. The hot shooting helped the Nuggets to a 73-58 lead at halftime.\n\n\r\n              Embiid started to take over toward the end of the third quarter, putting together a 16-point quarter on 5-of-6 shooting that keyed a 14-0 run that allowed the Sixers to close within 99-98 early in the fourth. \n\n\r\n              In the final quarter, Philadelphia wore down a Nuggets team playing the final game of a three-game, week-long trip. P.J. Tucker- who had switched defenively to Jokic and slowed him down in the second half- followed a Harden missed 3-pointer with a tip-in with over a minute left to stretch the lead to five. Embiid then hit a 3-pointer to restore an eight-point lead.\n\n\r\n              “I've always like to think I am a closer and I am,” Embiid said. “Taking the last shot or taking a last second shot with the clock ticking is fun for me. I love getting into those types of possession where you have to make the plays. That's where you find out who is who and who is made up for those kinds of moments.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Jamal Murray did start after being listed as questionable with a left hip sprain. Murray missed the game at Milwaukee on Wednesday night. There were times in the third and fourth quarter where Murray appeared to try to stretch things out, but remained in to score 22 points.\n\n\r\n              76ers: For the second straight game, Embiid did start after being listed as a game-time decision with left foot soreness. Embiid had missed the final game of Philadelphia's five-game trip in Sacramento last Saturday night. .. Philadelphia was issued a third-quarter technical foul for only having four players on the floor.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Start a three-game homestand against New Orleans on Tuesday.\n\n\r\n              76ers: Play the first of back-to-back home games against Orlando on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994697.9052281
}