{
  "game_id": "0021800258",
  "espn_id": "401070939",
  "date": "Nov 21, 2018",
  "matchup": "HOU vs. DET",
  "headline": "Harden's 43 points leads Rockets over Pistons 126-124",
  "body": "HOUSTON --  The Houston Rockets are on a roll, putting their terrible start behind them.\n\nJames Harden scored a season-high 43 points and Clint Capela added 27 to help Houston withstand a late run by the Pistons and get their fifth straight victory, 126-124.\n\nThe Rockets have won eight of 10 to improve to 9-7.\n\nThey led by 14 with about five minutes left, but Blake Griffin made five 3-pointers that helped Detroit cut the lead to four points with about 90 seconds left. Houston struggled to contain Griffin late after defensive stopper P.J. Tucker was ejected in the third quarter after he received two technical fouls for arguing with officials.\n\n\"With P.J. getting kicked out of the game early it put more minutes on our guys,\" Harden said. \"But we found a way to win. There's going to be games like that where you've got to figure it out.\"\n\nGriffin had a turnover and a charge after his fifth 3 and Harden, who made all 19 of his free throw attempts, made two free throws to make it 122-116 with 19.1 seconds left. Ish Smith added a 3-pointer to cut the lead to three points with 9.6 seconds left, but Harden made two more free throws.\n\nGriffin was fouled on a 3-point attempt with 3.6 seconds remaining and made the first two free throws before missing the third. It was Harden at the line again after that, and he made both shots before Smith made a 3 at the buzzer.\n\n\"It was big,\" Chris Paul said. \"It was good for us. Blake got hot down the stretch ... but for us as we keep saying it's just about piling up wins.\"\n\nGriffin led the Pistons with 37 points and 11 rebounds Andre Drummond added 20 points with 11 rebounds for the Pistons.\n\n\"At the end of the game, two turnovers down the stretch killed us,\" Griffin said. \"It doesn't matter how many points you score ... in the big moments, that's where I have to be better.\"\n\nDetroit used a run to cut Houston's lead to six points with about six minutes left before the Rockets scored the next eight points, with six from Harden to make it 113-99 about a minute later.\n\nBut Griffin made three 3-pointers, with the first two on consecutive possessions, to fuel a 9-2 run that got Detroit to 115-108 with 3 1/2 minutes left.\n\nJames Ennis made a 3-pointer for Houston after that, but Griffin scored the next five points, with another 3-pointer to cut the lead to 118-113 with about two minutes left.\n\nHarden added a basket on a goaltending call, but Griffin made yet another 3 to make it 120-116 before his late errors.\n\nThe Rockets scored the first seven points of the third quarter to make it make it 65-57. But Detroit scored the next eight points, with 3s by Reggie Jackson and Langston Galloway to tie it a couple of minutes later.\n\nHouston went on another run after that, outscoring Detroit 9-2, to take a 76-67 lead midway through the quarter. Harden got the Rockets going in that span with a 3-pointer and Capela capped it with four straight points.\n\nThe Rockets were up 81-73 later in the third when Tucker got hit by Griffin on a screen and began complaining to an official. He received a technical foul, but that didn't stop him from continuing to get in the officials' face and yell at him, drawing a second technical and an ejection.\n\nTIP-INS\n\nPistons: Detroit made 16 3-pointers to give the team at least 10 in seven straight games, a franchise record. ... Luke Kennard missed his 11th game with a sprained right shoulder and coach Dwane Casey said that he hasn't been cleared for contact drills and will still be out for a while.\n\nRockets: Capela received a technical foul in the third quarter for hanging on the rim after a dunk. ... Chris Paul added 20 points with seven assists.\n\nTUCKER'S EJECTION\n\nCrew chief Courtney Kirkland on what led to Tucker's ejection: \"The first technical foul was assessed to Tucker for his use of profanity toward Ben Taylor. He walked to him aggressively; Taylor assessed the first technical foul. He stayed there patiently and then Tucker continued to use progressive profanity toward him in a very aggressive manner. That's what the two technical fouls were for.\"\n\nHARDEN'S MILESTONE\n\nHarden's performance on Wednesday night gave him 13,391 career points with the Rockets to move him past Rudy Tomjanovich and into third place on the team's all-time scoring list. Harden was pleased to move up the list but knows taking first place from Hakeem Olajuwon, who is Houston's all-time leading scorer with 26,511 points, will be a huge task.\n\n\"We all know how great he was in the league and for this team as well,\" Harden said of Tomjanovich. \"So, it's an honor, but I've got a long way to go to catch Dream.\"\n\nUP NEXT\n\nPistons: Host Houston on Friday night.\n\nRockets: Visit Detroit on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995315.334187
}