{
  "game_id": "0021600317",
  "espn_id": "400899759",
  "date": "Dec 06, 2016",
  "matchup": "CHI @ DET",
  "headline": "Pistons beat Bulls 102-91 for fourth win in 5 games",
  "body": "AUBURN HILLS, Mich. --  In the long run, Andre Drummond and Reggie Jackson are going to be the most important players on the Detroit roster.\n\nTuesday, though, they were spectators.\n\nPistons coach Stan Van Gundy went with his bench in the fourth quarter against the Bulls, and they outscored Chicago 31-19 to pull out a 102-91 victory.\n\n\"It's tough for guys like Andre and Reggie to have to watch a close game down the stretch, because they want to be out there,\" Van Gundy said. \"Marcus (Morris), too, but the bench guys were doing such a good job that I couldn't take them off the floor.\"\n\nTobias Harris, who led Detroit with 22 points, was the only Pistons starter to get his usual playing time in the final 12 minutes. He was joined by Ish Smith, Darrun Hilliard, Aron Baynes and Jon Leuer.\n\n\"Tobias was scoring and Ish got us 10 assists, but it was mostly great defense,\" Van Gundy said. \"That group took the game away from the Bulls.\"\n\nDrummond added 15 points and 10 rebounds for the Pistons, who won for the fourth time in five games.\n\nJimmy Butler scored 32 points and Dwyane Wade added 19 points and seven assists for Chicago, which lost its third straight. The Bulls were playing their fourth game in five nights and struggled in the fourth quarter.\n\n\"We battled back from a 17-point deficit and took the lead into the fourth,\" Chicago coach Fred Hoiberg said. \"That just takes so much energy out of you. We have to stop digging holes for ourselves.\"\n\nDrummond dominated early, scoring 10 points on three dunks and two tips. Even when he went to the bench with foul trouble, the Pistons put together an 11-0 run to lead 36-21 early in the second quarter.\n\nRajon Rondo had 10 points in his return to the Chicago lineup.\n\nDetroit maintained a double-digit lead for most of the second period, but Chicago rallied after Jackson picked up his third foul. The Pistons were ahead 51-44 at the half, thanks to a 16-6 edge on points off turnovers. Drummond had 14 in the half, while Butler had 16 for the Bulls.\n\nChicago was within 51-50 in the first two minutes of the third, and took a 72-71 lead into the fourth. Butler and Taj Gibson both had eight points in the period, while Drummond didn't score for Detroit.\n\nHillard's 3-pointer capped Detroit's 12-3 run to start the fourth, giving the Pistons an 83-75 lead with 7:28 to play.\n\n\"We had things rolling and Coach let us keep going,\" Leuer said. \"You appreciate that as a player, if you get it going and you are allowed to ride it out.\"\n\nThe Pistons pulled away down the stretch against the weary Bulls.\n\n\"We've just got to win a couple games,\" Butler said. \"When we do that, everything will be fine and dandy again.\"\n\nTIP-INS\n\nBulls: Rondo missed Monday's loss to Portland due to a team suspension.\n\nPistons: Due to his foul problems, Jackson only played 10 minutes in the first half. He's still on limited minutes after missing the season's first 21 games with knee tendinitis, and played eight minutes in the second half. Ish Smith played the entire fourth quarter.\n\nROTATION PROBLEMS\n\nLeuer, normally Detroit's sixth man, only played seven minutes in the first half, and Van Gundy blamed himself. \"I was trying to keep Tobias away from Jimmy Butler and screwed up my rotation. As it turned out, it didn't matter who guarded Jimmy, but we should never have a half where Jon only plays seven minutes.\"\n\nUP NEXT\n\nBulls: Visit the Charlotte Hornets on Wednesday.\n\nPistons: Host the San Antonio Spurs and Pau Gasol on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764995085.0526872
}