{
  "game_id": "0022200352",
  "espn_id": "401468507",
  "date": "Dec 05, 2022",
  "matchup": "LAC @ CHA",
  "headline": "Leonard returns, hits game-winner as Clippers beat Hornets",
  "body": "CHARLOTTE, N.C. -- — Kawhi Leonard couldn't have drawn up a better return.\n\n\r\n              The five-time All-Star had 16 points, including an 18-foot jumper with 1.4 seconds to lift the Los Angeles Clippers to a 119-117 victory over the Charlotte Hornets on Monday night in his return from a right ankle sprain.\n\n\r\n              “I don't think anybody loves playing this game more than me,” Leonard said. “It gives me joy when I'm able to play. And it was great that I was able to make that shot.”\n\n\r\n              Paul George also came back from a strained hamstring to score 19 points along with seven assists, helping the Clippers snap a two-game losing streak. Reggie Jackson and Nic Batum each had 13 points, and John Wall added 12 points and 12 assists.\n\n\r\n              Luke Kennard added nine points off the bench in his first game back from an injury as well.\n\n\r\n              Charlotte's Kelly Oubre scored 28 points and P.J. Washington added 26 after going 0 for 13 on Saturday night. Washington missed a fadeaway jumper as time expired that would have tied the game.\n\n\r\n              Getting Leonard, George and Kennard back should provide a huge boost for the Clippers (14-11). Leonard has been out since Nov. 21, George since Nov. 19 and Kennard since Nov. 15 with a calf strain.\n\n\r\n              George said it's “super important” getting everyone healthy again, and that it felt like the start of a new season.\n\n\r\n              “This is really a great opportunity to kind of get back on track,\" George said. “We were playing well when we were healthy and now we can start building toward the team we were trying to be.”\n\n\r\n              The win didn't come easily.\n\n\r\n              The Hornets (7-17) outscored the Clippers 26-8 to start the third quarter behind eight points from Terry Rozier to take an 80-71 lead.\n\n\r\n              The Clippers tied it up when George saved an offensive rebound from going out of bounds by flicking the ball to Leonard under the basket for an easy basket.\n\n\r\n              “We’ve got to get that rebound,\" Hornets coach Steve Clifford said. “It’s the second game this year, you make one play and they’ve got to foul, we’re up two. That’s the biggest play.”\n\n\r\n              After Jalen McDaniels missed a 3 at the other end, the Clippers found Leonard for an isolation play on the right side of the court.\n\n\r\n              He made a ball fake to freeze McDaniels, then dribbled once and stepped back to his left to drain the shot before exchanging a high-five with George and a flying chest bump with Marcus Morris Sr.. \n\n\r\n              “My teammates trusted me,” Leonard said. “I was able to get in my spot and my team gave me space. I was able to knock down a shot.\"\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Norman Powell remained out with a groin strain. ... Shot 15 of 36 from 3-point range.\n\n\r\n              Hornets: LaMelo Ball has now missed 21 of 24 games this season with a high ankle sprain. Gordon Hayward has missed 13 games with shoulder issues, Cody Martin 23 games with a knee injury and Dennis Smith Jr. 10 games with a right ankle sprain.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Orlando on Wednesday night.\n\n\r\n              Hornets: At Brooklyn on Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994986.470531
}