{
  "game_id": "0021600023",
  "espn_id": "400899457",
  "date": "Oct 28, 2016",
  "matchup": "HOU @ DAL",
  "headline": "Rockets top Mavs 106-98 with Nowitzki out for home opener",
  "body": "DALLAS --  James Harden walked the ball up the court in the final seconds of the third quarter, then decided he didn't want to set up the offense.\n\nThe Houston star simply pulled up and hit a long 3-pointer for the first double-digit lead during a late-quarter run that put the Rockets in control for good.\n\nTrevor Ariza scored 27 points, Harden had 26 and Houston beat Dallas 106-98 with Dirk Nowitzki missing from the Mavericks' home opener Friday night.\n\nHarden went scoreless while playing the entire first quarter, missing all five shots, before getting 10 points in the second and 12 in the third, including the punctuating 3 that followed two others on a 10-2 run to finish the quarter.\n\n\"I was in a groove and it was time to close out the quarter,\" Harden said. \"Think that's one of the things that we're preaching is we got to end quarters the right way.\"\n\nHarrison Barnes, playing his first home game for the Mavericks after signing a max contract in the summer, had a career-high 31 points.\n\nNowitzki didn't play for just the second time in 19 home openers with Dallas. The 38-year-old had a stomach ailment bad enough that coach Rick Carlisle wasn't sure he would make the trip to Houston for the Rockets' home opener Sunday.\n\n\"Dirk's not going to be around here forever. And we're going to be sitting him sometimes this year,\" Carlisle said. \"The other guys have got to step up and step forward. And I'm one of them. We've all got to really raise the level of our game when a guy like that's not on the floor.\"\n\nTwo nights after recording a career-high 17 assists in an opening loss to the Los Angeles Lakers, Harden had eight assists and seven rebounds.\n\nAriza was 5 of 7 from 3-point range, including one early in the fourth quarter to push Houston's lead back to nine points. He was fouled on 3-pointers twice and made all six free throws.\n\nTIP-INS\n\nRockets: Harden became the second player in NBA history with at least 30 points and 15 assists in an opener when he had 34 points and 17 assists in the 120-114 loss to the Lakers. Tim Hardaway had 32 and 18 for Golden State at Denver in 1990. ... Eric Gordon was the other double-figure scorer for Houston with 18 points. ... Clint Capela had nine rebounds.\n\nMavericks: Dallas has the two highest totals for 3-point attempts in a game in league history after shooting 48 in the 130-121 overtime loss to Indiana in the opener. The Mavericks made 18 (38 percent). Dallas shot a record 49 on March 5, 1996, against New Jersey, also making 18 (37 percent). ... Andrew Bogut, a starter alongside Barnes at Golden State before both joined Dallas after the Warriors landed Kevin Durant in free agency, had a game-high 12 rebounds. ... Deron Williams had 14 points, but just one in the second half.\n\nFILLING IN FOR DIRK\n\nThe only other home opener Nowitzki missed was in 2012 when he sat the first 27 games recovering from knee surgery. Sliding over to power forward, Barnes was strong inside and out, going 13 of 23 from the field with five rebounds. \"I think he has a chance to be a very special player. I've felt that all along,\" Carlisle said.\n\nDEFENSIVE TURNAROUND\n\nAfter giving up 51 percent shooting in the loss to the Lakers, the Rockets allowed Dallas to shoot 52 percent in the first quarter while Barnes scored 12 points . But the Mavericks were held to 15 of 40 (38 percent) in the second and third quarters, when Houston outscored them 53-43. \"We can't just rely on offense or James bailing us out like he did a lot last year,\" Ariza said. \"We have to do it collectively on the defensive end.\"\n\nSHOOTING STRUGGLES\n\nDallas' Wesley Matthews scored 13 points on a second straight bad shooting night. He's 7 of 30 from the field through two games, including 3 of 18 from 3-point range.\n\nLONG-RANGE SUCCESS\n\nThe Rockets were 15 of 32 from 3-point range (47 percent). Ariza, Harden (4 of 9) and Gordon (3 of 6) combined to make 12 of 20 from beyond the arc. \"I think our legs were a little bit better, and we'll get more in shape as we play more games,\" first-year coach Mike D'Antoni said.\n\nUP NEXT\n\nThe Rockets' home opener Sunday against the Mavericks is their only home game in the first eight this season. One of three five-game road trips -- a season high -- follows.",
  "source": "espn_api",
  "crawled_at": 1764995802.943415
}