{
  "game_id": "0022200462",
  "espn_id": "401468617",
  "date": "Dec 20, 2022",
  "matchup": "CHI @ MIA",
  "headline": "Bulls snap 4-game slide, top short-handed Heat 113-103",
  "body": "MIAMI -- — The only yells in the Chicago locker room were happy ones.\n\n\r\n              Nikola Vucevic had 29 points and 12 rebounds, DeMar DeRozan scored 24 points and the Bulls stopped a four-game slide by beating the short-handed Miami Heat 113-103 on Tuesday night.\n\n\r\n              Zach LaVine scored 21 and Coby White added 14 for the Bulls, who used a 30-7 run in the second half to take control — and looked nothing like the team that lost 150-126 to Minnesota on Sunday.\n\n\r\n              “It was good to get a win, get that positive feeling a little bit, especially after that very tough, terrible loss,\" Vucevic said. “It was needed. Hopefully we can learn from this.\"\n\n\r\n              Bam Adebayo made his first nine shots and scored 27 points. Adebayo also had 12 rebounds for the Heat, who got 19 points from Tyler Herro, 18 from Haywood Highsmith, 14 from Victor Oladipo and 13 from Duncan Robinson.\n\n\r\n              “They grabbed momentum and took it from there,\" Heat coach Erik Spoelstra said. \n\n\r\n              Miami was without three starters — Jimmy Butler (gastrointestinal illness), Kyle Lowry (left knee soreness) and Caleb Martin (sprained left ankle) — and had its season-best, four-game winning streak snapped.\n\n\r\n              And for one night, all was well with the Bulls again.\n\n\r\n              The 11-18 start entering Tuesday had clearly taken a toll. Players were confronting one another in the locker room at halftime of what became Sunday's rout, and Bulls coach Billy Donovan spent considerable time before the game Tuesday discussing the state of the team.\n\n\r\n              “Certainly, there’s times where you can see guys are frustrated,” Donovan said. “But, to me, there’s only one or two responses to that. Either try harder and fight harder, or be frustrated and have the same thing continue on. To me, frustration’s a feeling. We’ve got to stop worrying about feelings and start making choices.”\n\n\r\n              The choices Tuesday were good ones. Chicago shot 55%, its second-best clip of the season.\n\n\r\n              “They have highly skilled offensive players, and if they see a few go down then they start to make quite a few shots,\" Spoelstra said.\n\n\r\n              Herro made a 3-pointer to open the second half and put Miami up by eight. Chicago responded with its 30-7 run, highlighted by 14 consecutive points in one stretch, and Patrick Williams' 3-pointer put the Bulls up 82-67.\n\n\r\n              The lead stayed in double digits for most of the rest of the way.\n\n\r\n              TIP-INS\n\n\r\n              Bulls: Chicago went 2-0 in its two trips to Miami this season, after winning on opening night back in October. ... The Bulls were outscored 36-21 in the second quarter. It was the 14th time they lost a quarter by more than 10 points this season; they had been 0-13 in such games before Tuesday. ... Former Heat guard Goran Dragic, as always, got a warm ovation when entering the game from the still-appreciative Miami crowd.\n\n\r\n              Heat: After appearing in each of the season’s first eight games, Butler has missed 12 of Miami’s last 24 contests. ... Miami used its 12th starting lineup of the season. Each of the last five games has featured a different starting five. ... Adebayo was 7 for 7 in the first half, the best such mark of his career. He was 6 for 6 in the first half against Cleveland on Feb. 22, 2020.\n\n\r\n              NO BLOCKS\n\n\r\n              The NBA can — and often does — change stats upon review, but as of now, this Bulls-Heat game was the league’s first with zero blocked shots since Detroit-Toronto on Oct. 26, 2016. DeRozan and Andre Drummond (who played 7:02 for Chicago on Tuesday) played in that game, DeRozan for the Raptors, Drummond for the Pistons.\n\n\r\n              RESPECT\n\n\r\n              Lowry was on the Heat bench wearing an Argentina soccer jersey -- the No. 10, for Lionel Messi, the superstar who has been linked to Inter Miami for some time.\n\n\r\n              DOUBLE VUC\n\n\r\n              Vucevic had his team-best 14th double-double of the season. It was his first in his last six games.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Visit Atlanta on Wednesday.\n\n\r\n              Heat: Host Indiana on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994500.006685
}