{
  "game_id": "0021500043",
  "espn_id": "400827930",
  "date": "Nov 01, 2015",
  "matchup": "CHI vs. ORL",
  "headline": "Bulls withstand late surge to beat Magic 92-87",
  "body": "CHICAGO -- Derrick Rose doesn't see much point in shooting often right now. In fact, Rose doesn't see a lot of anything.\nWith his vision still blurred from a broken orbital bone suffered before the season, Rose is finding other ways to contribute to the Chicago Bulls, like his game-high eight assists Sunday that helped the Bulls hold off a late surge by the Orlando Magic in a 92-87 victory.\n\n\"There is no point in shooting the ball if I can't see,\" Rose said.\nInstead, Pau Gasol and Niko Mirotic did the shooting, each scoring 16 points with Jimmy Butler adding 14 to lead the Bulls.\nButler's late-game defensive heroics were just as important after the Bulls squandered a double-digit lead during a 14-0 Magic run -- they were only ahead by one with just over 3 minutes to play. Butler jumped to intercept a pass on a breakaway and squelch the comeback bid. Then, under the Bulls' basket after a Magic rebound, Butler came up with another takeaway to again foil Orlando.\n\"On the defensive end I have to be the one to ... get a couple stops, get us going,\" Butler said. \"On the offensive end it could be anybody, making shots, getting into the paint. But on the defensive end I'm going to be the one.\"\nIt was the third win in four games for Chicago. The Magic dropped to 0-3.\nThe Magic shot just 38.9 percent on 35-of-90 shooting. They also struggled at the free-throw line, converting just 10 of 17 for 58.8 percent.\n\"We were just lethargic on both ends,\" Magic coach Scott Skiles said. \"I know everybody will point to our offense tonight and then look at the Bulls' defensive numbers. We had a nice stretch in the fourth quarter where we had five stops in a row. We started kind of getting something going, but we were down 15. Most of the game we just weren't here tonight.\"\nRose averaged 17.7 points per game last season for the Bulls but scored just six on Sunday after scoring eight on Friday against Detroit. He said he's happy to be an assist man since Chicago has so many offensive weapons.\n\"As long as we're winning games I (couldn't) care less about anything else, about my eye or anything,\" Rose said.\nRose is still playing with a face mask, but he still hit two clutch free throws with 10 seconds to go that gave Chicago a 92-87 lead.\nEvan Fournier led the Magic with 19 points. Nikola Vucevic added 15 and a game-high 11 rebounds, and Tobias Harris had 11 points.\nDoug McDermott came off the bench to score 12 for the Bulls.\nTIP-INS: Rose didn't score in the second or third quarter. ... The Bulls didn't trail after taking a 17-15 lead with 5:15 to play in the first quarter. ... Orlando has connected on a 3-pointer in 659 consecutive games, dating to March 17, 2007. ... The Bulls' Kirk Hinrich sat out Sunday's game with a sore toe, but coach Fred Hoiberg said it wasn't a serious injury.\nFAMILIAR SURROUNDINGS\nSkiles coached parts of five seasons with the Bulls and has fond memories of his time in Chicago.\n\"Chicago's a great city, great sports town. We had a good run for a few years,\" Skiles said. \"We just couldn't quite get over the hump in the playoffs, but it was fun.\"\nSkiles, however, wasn't attaching any added significance to coaching in the United Center.\n\"I played for five teams and coached four now, so I'm working about a third of the league,\" Skiles said. \"At some point it's just another game.\"\nWINNING AT THE LINE\nThe Bulls shot 7 for 8 at the foul line down the stretch to hold the lead after Orlando's 14-0 run.\nBLOCK PARTY\nThe Magic blocked 11 shots, led by Vucevic and Victor Oladipo with three each. The Magic are averaging nine blocks a game.\nMIRO-TREY\nMirotic is second in the NBA in 3-pointers made with 13, behind Golden State's Stephen Curry with 17.\nUP NEXT:\nMagic: Orlando continues its three-game road trip at New Orleans on Tuesday night.\nBulls: Chicago travels to Charlotte on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764993983.780087
}