{
  "game_id": "0022201142",
  "espn_id": "401469297",
  "date": "Mar 29, 2023",
  "matchup": "DET @ OKC",
  "headline": "Jalen Williams' late tip-in gives Thunder win over Pistons",
  "body": "OKLAHOMA CITY -- — Rookie Jalen Williams' putback with less than a second remaining gave the Oklahoma City Thunder a 107-106 win over the Detroit Pistons on Wednesday night.\n\n\r\n              The pressure was on for the Thunder, who entered the night two games under .500 and hanging on to the final Western Conference play-in spot. The Thunder lost to the Charlotte Hornets on Tuesday night and couldn't afford another loss to a team near the bottom of the league's standings. \n\n\r\n              And Oklahoma City guard Shai Gilgeous-Alexander — the league’s No. 4 scorer with 31.3 points per game — was out with a sprained left ankle for the second straight game.\n\n\r\n              It wasn't pretty, but the Thunder found a way.\n\n\r\n              “We were grittier tonight than we were last night,\" Thunder coach Mark Daigneault said. “And I thought the response of our players coming off of a disappointing performance last night was right where it needed to be, and this team’s made a habit of that all year. We’re not perfect, but these guys do a great job of refocusing and getting the car back on the road, and I thought they did that tonight.”\n\n\r\n              Williams answered the call with 27 points, eight rebounds six assists — and the tip-in on Josh Giddey's miss in the closing second. Williams celebrated his first NBA game-winner with some of the fans.\n\n\r\n              “It was dope,\" Williams said. “Throughout all that, some fan grabbed me, and that’s when I was like, ‘Oh, OK, like I’m really close to the crowd.’ But that’s a moment that’s dope to share.”\n\n\r\n              Lu Dort scored 20 points, Aaron Wiggins had 19 and Giddey added 18 for the Thunder. \n\n\r\n              Dort said the players embraced the high stakes.\n\n\r\n              “I mean, we definitely all take a look at that, honestly,\" Dort said. “We’ve worked so hard this season to be in this position today.”\n\n\r\n              Jaden Ivey followed his season-high 32-point performance against Milwaukee on Monday with 24 against the Thunder. The Pistons have the league’s worst record and have lost seven straight and 18 of 19.\n\n\r\n              Detroit coach Dwane Casey said it came down to more than just the final basket.\n\n\r\n              “We always remember that play, but there’s so many other little things that led into that that we have to make sure we grow from and learn from and really correct to win close games like that,” he said.\n\n\r\n              Williams scored two quick buckets in close to put the Thunder ahead 97-90 with six minutes remaining, but the Pistons rallied and tied it on a 3-pointer by Ivey with 3:35 to play.\n\n\r\n              The Thunder led 103-100 with just under two minutes remaining when Oklahoma City's Jaylin Williams took a charge from Ivey with 1:48 remaining for Ivey's sixth foul. Williams then hit a short jumper to bump Oklahoma City's lead to five.\n\n\r\n              Detroit rallied and Cory Joseph hit a 3-pointer with 13.5 seconds left to put the Pistons ahead 106-105, setting up the final sequence.\n\n\r\n              It appeared the Thunder had taken the lead on a putback by Dort, but a jump ball was called. Dort won it and Giddey tracked it down. He got a decent turnaround shot off before Jalen Williams put it back in.\n\n\r\n              Daigneault said the sequence by Dort was typical of his style of play.\n\n\r\n              “I think his physicality, his toughness, his resilience — that stuff is contagious and it helps our team stick its chest out,” he said. “And you really can’t quantify that. But he brings that to us and the end of the game, you know, it’s just a small example that.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: F Eugene Omoruyi, waived by the Thunder earlier this season, finished with 14 points and five rebounds in 28 minutes. ... C James Wiseman was called for a Flagrant 1 for a hard foul to Jaylin Williams' head in the fourth quarter.\n\n\r\n              Thunder: G Lindy Waters sat out with plantar fasciitis in his left foot. ... G Isaiah Joe, one of the top 3-point shooters in the league this season, missed all seven of his shots from long range. He shot 4 of 5 inside the arc and finished with 12 points.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: In Houston to play the Rockets on Friday night.\n\n\r\n              Thunder: Take on the Pacers in Indiana on Friday night.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994353.90391
}