{
  "game_id": "0022201153",
  "espn_id": "401469308",
  "date": "Mar 31, 2023",
  "matchup": "ATL @ BKN",
  "headline": "Bridges has 42, Nets rout Hawks to boost lead for No. 6 seed",
  "body": "NEW YORK -- — Mikal Bridges remembers when he couldn't even score 30 points in a game.\n\n\r\n              These days he surpasses 40, giving the Nets the scoring that seemed lost when they traded Kevin Durant in the deal that brought Bridges to Brooklyn.\n\n\r\n              “I think it’s just, I’m really trying to win,\" Bridges said, \"so every shot I take I’m being aggressive and trying to make every shot I shoot.” \n\n\r\n              Bridges scored 42 points and the Nets increased their lead for the final guaranteed playoff spot in the Eastern Conference by beating the Atlanta Hawks 124-107 on Friday night. \n\n\r\n              Dorrian Finney-Smith added 19 points in his best game with the Nets, who led by only four at halftime before outscoring the Hawks 42-24 in the third quarter to open a 101-79 lead. Brooklyn moved two games ahead of idle Miami for the No. 6 spot with five games to play. \n\n\r\n              Bridges surpassed 40 points for the second time in three games and the third time since coming to the Nets in February. He finished March with 461 points, the second-highest total by a Nets player in their NBA franchise history in a month behind the 471 scored by Durant last November.\n\n\r\n              Cam Johnson, also part of the Durant trade, had 16 points. The Nets won for the third time in four games following a five-game skid that had dropped them behind the Heat into seventh place. The teams who finish between 7-10 have to go through the play-in tournament to reach the postseason.\n\n\r\n              “Even though we were losing, we felt like we were coming together as a team,” Finney-Smith said. “We haven’t been in that many battles together, but we’re still learning each and other and we’re figuring it out.” \n\n\r\n              The Hawks remained tied for the No. 8 spot with Toronto. Atlanta could have pulled within a game of Miami. \n\n\r\n              But the Hawks never gave themselves a chance after going just 8 for 37 from 3-point range and getting outscored 76-46 in the middle two quarters after leading by eight after one. \n\n\r\n              Dejounte Murray scored 21 points for the Hawks, who had a tough time with New York traffic and perhaps left their legs on the bus. Trae Young had 10 points and six assists, going 3 for 12 and missing all five 3-pointers.\n\n\r\n              Bridges' three-point play with 8:45 left in the third quarter gave Brooklyn a 69-58 lead, the first double-digit advantage by either team. The Nets had doubled that lead about 4 1/2 minutes later when another basket by Bridges made it 91-71. \n\n\r\n              Bridges finished off the quarter by scoring the final seven points as the lead ballooned by 22. He finished 16 for 24 from the field, 5 for 8 on 3-pointers.\n\n\r\n              “He’s been efficient forever. He’s made those 3s, he’s just more aggressive right now because he has to be and it’s a credit to him,” said Hawks coach Quin Snyder, who went against Bridges often when he coached Utah. \n\n\r\n              The Hawks led 33-25 after one, then missed all nine 3-point attempts and shot 29% overall in the second quarter. The Nets outscored them 34-22 to take a 59-55 edge to the break.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: De'Andre Hunter missed the game with soreness in his left knee. ... Jalen Johnson had six points after missing the previous five games with a strained left hamstring. \n\n\r\n              Nets: Brooklyn improved to 11-2 on Fridays, the NBA's best record this season on that day. ... Nic Claxton had 14 points, 12 rebounds and five assists. \n\n\r\n              BIG DAY FOR THE MINOR LEAGUERS\n\n\r\n              Shortly after Ronnie Burrell was announced as the NBA G League Coach of the Year early Friday, his Long Island Nets beat the Cleveland Charge 111-107 to reach the Eastern Conference finals. Nets coach Jacque Vaughn said he called Burrell, who was on the Brooklyn staff in 2018-19, after the game to congratulate him.\n\n\r\n              “I was here when Ronnie was with us previously and to see his growth, him lead that team, to see how well our guys are playing and how they’ve developed, you give him a lot of credit for that,” Vaughn said. “And good thing they won today, too.” \n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Dallas on Sunday night.\n\n\r\n              Nets: Host Utah on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994805.3729541
}