{
  "game_id": "0022200056",
  "espn_id": "401468211",
  "date": "Oct 26, 2022",
  "matchup": "ORL @ CLE",
  "headline": "Mobley has 22 points, Cavs beat Magic for 3rd win in row",
  "body": "CLEVELAND -- — Evan Mobley scored a season-high 22 points, Jarrett Allen had 18 points and 16 rebounds and the Cleveland Cavaliers beat the Orlando Magic 103-92 on Wednesday night.\n\n\r\n              Donovan Mitchell added 14 points and eight assists for Cleveland, which has won three in a row after dropping its opener at Toronto. All-Star center Allen is averaging 13.5 points and 11.5 boards with three double-doubles.\n\n\r\n              “You can work hard and have fun, that’s what Cavs basketball is all about,” Allen said. “Evan showed tonight that he can be one of the best in the league, and we just went out and competed hard. That’s what it came down to.”\n\n\r\n              Top overall draft pick Paolo Banchero had 29 points, eight rebounds and four assists for Orlando, extending his streak of 20-plus point games to begin his career to five. Orlando (0-5) is the lone team without a victory in the Eastern Conference.\n\n\r\n              The Cavaliers never trailed in the second half, but failed to push the lead past 11 until Mobley’s power layup put them up 97-85 with 1:37 remaining. Cedi Osman had 14 points and seven rebounds off the bench.\n\n\r\n              “Those two big guys, Allen and Mobley, are hard to deal with and they’ve got a lot of weapons,” said Banchero, who is averaging a rookie-best 24.0 points. “I think I’m playing well, but it’s not translating to wins, so I’m not satisfied.”\n\n\r\n              All-Star point guard Darius Garland, who missed his third consecutive game with a left eye laceration, took part in Cleveland’s morning shootaround. It was his first on-court activity since being poked in the eye by Toronto’s Gary Trent Jr. on Oct. 19.\n\n\r\n              Garland was seated with his teammates on the bench, wearing dark sunglasses and could return to action this weekend.\n\n\r\n              Orlando forward Franz Wagner scored 22 points and 7-foot-2 Bol Bol had nine points and a career-high 10 rebounds. Wagner and Mobley were first-team All-Rookie selections last season.\n\n\r\n              “(Coach J.B. Bickerstaff) kind of lit us up at halftime because we weren’t playing Cavaliers basketball,” Mobley said, adding that Bickerstaff used “a lot” of swear words. “In the second half, I was just looking to attack, and Jarrett got it going and was the spark we needed.”\n\n\r\n              MAGICAL ROOKIE\n\n\r\n              Duke product Banchero has made an immediate impact, posting the third-longest streak of 20-point games to start a career by a No. 1 overall pick.\n\n\r\n              Elvin Hayes of the San Diego Rockets (10 games in 1968) and Oscar Robertson of the Cincinnati Royals (6 games in 1960) hold the top two spots.\n\n\r\n              “Paolo is selfless, tough, confident, high basketball IQ, willing learner — all of those things,” Magic coach Jamahl Mosley said. “He also has such a great gift of humility and I think that’s huge. He’s just blended in like he belongs here.”\n\n\r\n              TIP-INS\n\n\r\n              Magic: Orlando plays six of its first eight games on the road, then has a seven-game homestand at Amway Center. … G Markelle Fultz (left big toe fracture), G Gary Harris (left knee rehabilitation), C Jonathan Isaac (left knee rehabilitation), G Jalen Suggs (right ankle sprain) and C Moritz Wagner (right foot sprain) were unavailable.\n\n\r\n              Cavaliers: F Dean Wade made his initial start of the season, replacing G Isaac Okoro in the lineup. … G Ricky Rubio (left knee surgery), G Dylan Windler (right ankle sprain), two-way F Isaiah Mobley (G League assignment) and Garland were inactive. … Cleveland took a 60-59 lead in its series with Orlando, which entered the NBA in 1989.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host Charlotte on Friday night.\n\n\r\n              Cavaliers: At Boston on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994664.383121
}