{
  "game_id": "0021600290",
  "espn_id": "400899732",
  "date": "Dec 02, 2016",
  "matchup": "HOU @ DEN",
  "headline": "Harden scores 20 in Rockets' runaway win over Denver 128-110",
  "body": "DENVER --  The Houston Rockets sure didn't look -- or play -- like a tired team.\n\nJames Harden scored 20 points and the Rockets led from start to finish in beating the Denver Nuggets 128-110 on Friday night.\n\nEric Gordon and Ryan Anderson had 18 points each and Sam Dekker added 17 for Houston, which completed an impressive back-to-back road sweep that began with a 132-127 win over Golden State in double overtime Thursday.\n\nThe latest victory came despite the Rockets' 5 a.m. Friday arrival in Denver. Most of the players and coaches got little sleep before playing the Nuggets.\n\n\"It's a good win for us,\" Harden said. \"Last night, double-overtime game, getting in at 5 a.m. and not really sleeping. ... We got off to a really good start, guys knocked down shots and just rode that wave the entire game.\"\n\nRockets coach Mike D'Antoni said the win was especially gratifying because of the circumstances and the way his team played.\n\n\"A lot of positives,\" he said. \"They found the energy to go ahead and finish up the game. It wasn't always pretty. It's a special group that can conjure that kind of energy in altitude after getting in at 5 o'clock in the morning.\"\n\nWilson Chandler had 24 points to lead the Nuggets, who had won three straight against the Rockets. The Nuggets have lost four of five overall and fell to 3-7 this season at home, the high-altitude venue where they once routinely dominated.\n\nMoreover, coach Michael Malone lit into his squad after the game over its lackluster performance.\n\n\"It's one thing to lose games but when you're outworked on your home floor -- Miami did it, Houston did it -- I have no explanation,\" Malone said. \"All I know is that it is unacceptable and that's why I do apologize to our fans because they deserve better.\n\n\"We're a bad team right now and I have to start doing a much better job because the direction we're headed right now is in a bad, bad place.\"\n\nUp by 10 points at halftime, the Rockets took a 99-84 lead into the fourth quarter and kept the pressure on the rest of the way as part of a sharpshooting display that included converting 17 of 37 3-point attempts against a listless Nuggets defense. Denver went 9 of 30 from beyond the arc.\n\nThe Rockets took a 73-63 halftime lead over the Nuggets, who allowed a season high in points by an opponent over the first two quarters.\n\nHouston led by as many as 15 in the first half, hitting nine 3-pointers, including four by Anderson, to gain early separation with its highest-scoring output over the first two quarters this season.\n\nThe lack of defensive urgency by Denver was epitomized by Gordon's fast-break layup at the halftime buzzer as he drove the length of the court virtually uncontested in the final 3 seconds of the period.\n\nTIP-INS\n\nRockets: F Trevor Ariza left the game in the final minutes with back spasms, D'Antoni said, apparently after coming down awkwardly while going for a rebound. ... Houston has made at least 10 3-pointers in 19 consecutive games, the longest streak of its kind in NBA history. ... Houston's previous high for first-half points was 71 against the Los Angeles Lakers on Oct. 26. ... The Rockets are 7-2 on the road since beginning the season 2-3.\n\nNuggets: C Nikola Jokic missed the game because of a sore left wrist. ... G Gary Harris remains sidelined with a right foot injury. ... G Will Barton returned from an ankle injury that sidelined him for the previous two games.\n\nQUOTABLE\n\n\"They played harder than us. They wanted the game more than us. It was a bad loss on our home court. They came back very, very late (to Denver). We should have jumped on them since the beginning and it was the opposite.\" -- Nuggets forward Danilo Gallinari.\n\nUP NEXT\n\nRockets: Completed a five-game trip and return home to host the Boston Celtics on Monday night.\n\nNuggets: Play at Utah on Saturday night in the first stop of a six-game trip.",
  "source": "espn_api",
  "crawled_at": 1764995782.159652
}