{
  "game_id": "0021900496",
  "espn_id": "401161138",
  "date": "Dec 30, 2019",
  "matchup": "PHX @ POR",
  "headline": "Booker, Oubre rally Suns from 19 down past Blazers 122-116",
  "body": "PORTLAND, Ore. --  In the first half, the Phoenix Suns trailed by 19 points. By the final seconds, Kelly Oubre Jr. was blowing goodbye kisses to the Portland Trail Blazers and their fans.\n\nDevin Booker scored 33 points, Oubre had 29 and Phoenix came back from way behind to beat Portland 122-116 on Monday night.\n\nA 3-pointer by Oubre gave the Suns a 120-114 lead with 43.8 seconds left. After the shot, he blew kisses to the crowd while jogging around the court as Portland called a timeout.\n\n\"I think I feel like the first two I blew `em some kisses, they booed me. And then after I hit `em, they just expected the kisses,\" Oubre said. \"It's love all the way around the world.\"\n\nRicky Rubio added 18 points and 13 assists for the Suns, who won their second consecutive game and handed Portland its fourth straight defeat.\n\n\"Terrible loss,\" Blazers guard CJ McCollum said.\n\nPhoenix coach Monty Williams liked the fight his team showed in sticking to its plan.\n\n\"If you're a boxer, you box your way,\" Williams said. \"You don't switch up and go southpaw in the middle of the fight. You have to fight your style and I think that's how we have to be. We have to play our style of basketball, make adjustments as we go along. I thought we started the game in a bit of a laze.\"\n\nWilliams also was proud of the effort from Deandre Ayton, who had 12 points in 20 minutes off the bench in just his third game of the season.\n\n\"I thought he gave us juice,\" Williams said. \"Guys had confidence in him to not only plug the middle, but just having that size and athleticism. We haven't had a hand above the rim in a long time.\"\n\nDamian Lillard scored 33 points and McCollum added 25 for Portland. Hassan Whiteside had 16 points and 22 rebounds.\n\n\"It hurt from the standpoint that we were winning the game, we came out extremely well,\" Carmelo Anthony said after shooting 4 for 16. \"This is one of those games that we let slip away from us.\"\n\nLillard hit his first five 3s and scored 16 points in the opening period. Portland led by 19 multiple times, but Phoenix went on an 8-0 run to close the first half down 64-55. The Blazers were up 89-83 after three.\n\nOubre's 3-pointer cut Portland's advantage to 108-107 with 3:31 left, and a tip-in by Ayton with 2:48 remaining gave Phoenix its first lead since the opening quarter. Booker's jumper put Phoenix up 115-110.\n\nTIP-INS\n\nSuns: Ayton missed the previous five games with an ankle injury. He got hurt after serving a 25-game suspension. Following consecutive workouts, the Suns decided to let the former No. 1 pick loose.\n\n\"It's just part of our season so far. We're just thankful to have him back. He's progressed well in his treatment and workouts on the floor,\" Williams said. \"He's been working his butt off in simulations of games. He felt really good yesterday and this morning and after shootaround. So we just thought it best to get him out there. We'll watch his minutes, obviously.\"\n\nAron Baynes remained the starting center as Ayton came off the bench.\n\nTrail Blazers: Second-year wing Gary Trent Jr. scored all 11 of his points in the first half, including three 3-pointers. Anfernee Simons also gave Portland a boost off the bench with 12 points. ... The Blazers sustained yet another injury to their frontcourt when Skal Labissiere injured his right knee against the Los Angeles Lakers on Saturday. Results of an MRI on Labissiere were inconclusive, but the Blazers have ruled him out for their upcoming five-game road trip. The Blazers called up two-way player Moses Brown from the G-League. Portland coach Terry Stotts expects 3-point specialist Anthony Tolliver to play more at center as the team is already without starting center Jusuf Nurkic and starting power forward Zach Collins. \"I think we kind of have to rethink some things because of what he can do on both ends,\" Stotts said of Tolliver.\n\nUP NEXT\n\nSuns: Visit the Los Angeles Lakers on Wednesday night.\n\nTrail Blazers: At the New York Knicks on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996563.1446989
}