{
  "game_id": "0022401066",
  "espn_id": "401705632",
  "date": "Mar 27, 2025",
  "matchup": "SAC vs. POR",
  "headline": "Zach LaVine, Domantas Sabonis lead Kings to 128-107 win over Trail Blazers",
  "body": "SACRAMENTO, Calif. -- — Zach LaVine scored 29 points and Domantas Sabonis finished with 22 points, 19 rebounds and six assists Thursday night to help the Sacramento Kings beat the Portland Trail Blazers 128-107 and snap a four-game skid. \n\n\r\n              LaVine made 13 of 18 from the field and Sabonis was 9-of-11 shooting for the Kings. DeMar DeRozan had 21 points and 10 assists, Keegan Murray scored 17 points and Malik Monk 16. \n\n\r\n              Deni Avdija had 24 points and nine rebounds, Shaedon Sharpe scored 22 points and Anfernee Simons had 20. Duop Reath scored a season-high 17. \n\n\r\n              Takeaways \r\n              Trail Blazers: Avdija, a 6-foot-9 forward acquired from the Washington Wizards last June in exchange for Malcolm Brogdon, the 14th pick in the 2024 NBA draft (Bub Carrington) and a 2029 first-round pick, continued his stellar March. The 24-year-old is averaging nearly 23 points and more than 10 rebounds in 12 games this month while shooting nearly 50% from the field and better than 46% from 3-point range. \n\n\r\n              Kings: Sacramento moved a half-game ahead of the Dallas Mavericks into sole possession of ninth in the Western Conference standings with about 2 1/2 weeks left in the regular season. The Kings lead the 11th-place Phoenix Suns by a game. \n\n\r\n              Key moment\r\n              Keon Ellis hit a 3-pointer and Monk made another in a 12-2 second-quarter run that gave the Kings a 45-29 lead and Portland trailed by at least nine points the rest of the way. \n\n\r\n              Key stat\r\n              The Kings shot 64.9% (48 of 74) and scored 60 points in the paint, while the Trail Blazers made 35 of 88 (39.8%) from the field. \n\n\r\n              Up next\r\n              The Trail Blazers play the second of five consecutive road games when they take on the Knicks on Sunday. The Kings kick off a six-game road trip Saturday against the Orlando Magic. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997308.3048902
}