{
  "game_id": "0022000079",
  "espn_id": "401267239",
  "date": "Jan 02, 2021",
  "matchup": "SAC @ HOU",
  "headline": "Wall, Rockets beat Kings 102-94; Harden sits with injury",
  "body": "HOUSTON -- — John Wall scored 28 points and the Houston Rockets beat the Sacramento Kings 102-94 on Saturday despite playing without an injured James Harden. \n\n\r\n                    Harden, who sat out with a sprained right ankle, was not listed on the injury report and coach Stephen Silas did not mention his injury in his pregame availability. The team announced that he wouldn’t play about 38 minutes before the game was scheduled to begin. \n\n\r\n                    Wall, who sat out Houston's first two games because of COVID-19 contact tracing, missed all of last season and played just 32 games two years ago because of injuries. He scored 22 points in his Rockets' debut on Thursday after a trade from Washington to make him the first player to score 50 points in his first two games after an absence of at least two years since Michael Jordan did it in 2001, according to the Elias Sports Bureau.\n\n\r\n                    “I just put in a lot of hard work and dedication to get to this point,\" Wall said. “I couldn’t ask for a better start to be 2-0 in my first two games.\"\n\n\r\n                    Silas wasn't sure what to expect from Wall after being out for so long. But he has definitely been impressed.\n\n\r\n                    “Whatever expectations I had, he’s obviously exceeded them,\" he said. \n\n\r\n                    The Rockets scored the first nine points of the fourth quarter to extend their lead to 92-81 with about 8½ minutes left. Eric Gordon led the team in that stretch, making a 3-pointer and three free throws. \n\n\r\n                    Sacramento ended a scoring drought of more than 3½ minutes soon after that on an alley-oop dunk by Richaun Holmes. \n\n\r\n                    Both teams struggled to score after that as they combined to miss 10 shots in a row. Gordon finally made a shot for Houston with just less than five minutes to go, and Wall added a bucket a few seconds later to extend the lead to 96-83.\n\n\r\n                    Silas raved about his team's defense on Saturday and said without Harden's scoring prowess it was even more important to concentrate on that part of the game. \n\n\r\n                    “We really buckled down and played some defense,\" Silas said. “In order for us to be good we have to be good on defense. We can’t just outscore people.\"\n\n\r\n                    The Kings used an 8-2 run, capped by four points from Harrison Barnes, to get within 98-91 with less than a minute to go. But Christian Wood responded with a dunk to put the game out of reach. \n\n\r\n                    Harden had started Houston’s first three games this season and is averaging a league-leading 37 points with 11 assists.\n\n\r\n                    De’Aaron Fox had 23 points for the Kings, who lost to the Rockets for the second straight game after winning three of their first four games. \n\n\r\n                    “The guys should feel bad about the loss just like I do, losing is painful,\" coach Luke Walton said. “But they should also feel very good about how they are playing as a group.”\n\n\r\n                    He said they got stagnant offensively in the second half and was particularly disappointed in their lack of assists. \n\n\r\n                    “We only had 11 assists tonight as a team, which is awful,\" he said. “That’s not who we are as a group.” \n\n\r\n                    Wood had 20 points and 16 rebounds and Gordon added 21 points for Houston. \n\n\r\n                    The Kings cut the lead to two points on a 3-pointer by Buddy Hield with about 7½ minutes left in the third quarter. Wall made four quick points after that to stretch the lead to 79-73. \n\n\r\n                    The Rockets were up by seven late in the third before Fox scored the last five points of the quarter to cut the deficit to 83-81 entering the fourth. \n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Barnes added 19 points with seven rebounds. ... Hield had 17 points and made five 3-pointers. ... Sacramento made 9 of 28 3-pointers. \n\n\r\n                    Rockets: Sterling Brown had 11 points and six rebounds. ... Houston made 13 3-pointers. .\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Sacramento visits Golden State on Monday before playing seven straight home games. \n\n\r\n                    Rockets: Houston hosts Dallas on Monday night and will play four of its next five games at home. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997201.1425438
}