{
  "game_id": "0022301108",
  "espn_id": "401585736",
  "date": "Apr 03, 2024",
  "matchup": "MIN vs. TOR",
  "headline": "Edwards, Reid help Timberwolves rout Raptors 133-85 to move into tie for first in West",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 28 points, Naz Reid added 23 and the Minnesota Timberwolves routed the short-handed Toronto Raptors 133-85 on Wednesday night to move into a tie for first-place in the Western Conference.\n\n\r\n              Rudy Gobert had 11 points and 15 rebounds for Minnesota, whose 48-point win marked its largest margin of victory this season. \n\n\r\n              The Timberwolves began the day tied with Oklahoma City for second in the West, one-half game behind first-place Denver. Minnesota’s win moved it into a tie with the idle Nuggets with six games remaining for both teams.\n\n\r\n              “Taking care of business, taking advantage of a severely depleted team, and just kind of kept growing the lead,\" Timberwolves coach Chris Finch said. \"That was the challenge at halftime was to play against our own standard. Guys I thought for the most part did a great job of that all game long.”\n\n\r\n              Immanuel Quickley, Gradey Dick and Javon Freeman-Liberty all had 16 points for Toronto, which has lost 15 straight since its last win on March 3rd.\n\n\r\n              The 48-point loss was the largest in Raptors franchise history.\n\n\r\n              \"First quarter, we were competitive. We did a good job of preventing them to get out in transition and run. We made them a half court team, and they scored 23 points,” Raptors coach Darko Rajaković said. “I thought as the game was wearing on, we were getting more and more tired. We just started to turn the ball over. Once we started to turn the ball over, everything opened up for them.”\n\n\r\n              Reid was hot from deep throughout the game as he shot 6 for 10 on 3-pointers. Edwards was 5 for 12 on 3s after combing to go 0 for 19 from deep over his last three games.\n\n\r\n              “They felt the same as yesterday,\" said Edwards, who missed all six shots he took from deep Tuesday against the Rockets. \"Yesterday, I had a couple ins and outs, so I knew today was going to be the day that they (were) going to fall.”\n\n\r\n              A bevy of injuries left Toronto with just eight available players. Gary Trent Jr. was a late scratch with back spasms, and Bruce Brown (knee), RJ Barrett (knee) and Kelly Olynyk rested after all playing in Tuesday night's 128-111 loss against the Lakers.\n\n\r\n              Malik Williams made his NBA debut, getting the start for the Raptors the same day he signed a 10-day contract. The former Louisville big man averaged 11.1 points and 9.3 rebounds per game this year for Sioux Falls of the G League. Williams was held scoreless but grabbed five rebounds and had two blocks in his debut.\n\n\r\n              Veteran guard Mike Conley rested for Minnesota after playing the previous night in a 113-106 win against Houston. The Wolves sat Edwards, Reid and Jaden McDaniels for the entire fourth quarter of this game with a 91-60 lead after three quarters.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Milwaukee on Friday night.\n\n\r\n              Timberwolves: At Phoenix on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996684.321784
}