{
  "game_id": "0021600063",
  "espn_id": "400899513",
  "date": "Nov 02, 2016",
  "matchup": "PHX vs. POR",
  "headline": "Bledsoe's 3 sinks Blazers in OT, 118-115",
  "body": "PHOENIX --  In need of a go-to guy at the end of a tight game, the Phoenix Suns turned to Eric Bledsoe, and the veteran guard delivered. Both times.\n\nBledsoe dropped in a rainbow 3-pointer at the overtime buzzer, giving the Suns a 118-115 victory over the Portland Trail Blazers on Wednesday night.\n\nHe had also scored a go-ahead basket with 1.1 seconds left in regulation.\n\nBledsoe finished with 20 points, his only 3 of the night being the game-winner. The shot, made over the outstretched arms of Blazers star guard Damian Lillard, gave the Suns their first win of the season.\n\n\"I wanted the ball,\" Bledsoe said. \"I was just going to get whatever they gave me. The shot was there, I took the shot and just took it with confidence, and you live with the results.\"\n\nThe Suns, who made 6 of 10 shots and both free throws in overtime, got 27 points from T.J. Warren and 18 from Alex Len while center Tyson Chandler had 18 rebounds.\n\nPhoenix outscored Portland 62-38 in the paint. The Blazers played the second of back-to-back games after a home loss to Golden State on Tuesday.\n\nThe Suns went ahead by six points with 38.5 seconds left in overtime, but the Blazers tied it at 115 when Lillard scored and was fouled with 6.4 seconds.\n\nLillard's 27 points led the Blazers, with C.J. McCollum adding 24.\n\n\"We played good defense, he just made a tough shot,\" Lillard said.\n\n\"I don't know what Bledsoe shot from the field (7 of 20) but I'll take that shot every day of the week,\" McCollum said.\n\nBledsoe's layup with 1.1 seconds left in regulation gave the Suns a 103-101 lead, but after a timeout, Mason Plumlee inbounded to Meyers Leonard for a layup at the buzzer to send the game to overtime.\n\n\"To be in two overtime games (this season) against playoff teams, there's no better experience for such a young group,\" Suns coach Earl Watson said. \"Today was the first time I really felt like we actually became a family.\"\n\nThe Blazers took a 90-83 lead midway through the fourth quarter, but the Suns came back to take a 93-92 lead on Warren's running bank shot with 2:47 to play.\n\nSuns guard Devin Booker, who missed Monday's game against the Los Angeles Clippers with a toe injury, returned to the starting lineup and finished with 15 points on 6-of-15 shooting.\n\nPortland led for much of the second quarter and went ahead 50-43 on Maurice Harkless' 3-pointer with 4:07 left. The Suns responded by going on a 10-0 run capped off by Bledsoe's layup and free throw and led 57-53 at halftime.\n\nThe Suns took a 76-73 lead into the fourth quarter.\n\nTIP-INS\n\nBlazers: C Festus Ezeli remains out with a left knee injury. ... No Blazer saw more time on the court than Lillard's 40 minutes.\n\nSuns: The Suns had been one of the most turnover-prone teams in the NBA, averaging 16 per game entering Wednesday. They committed only 12 against the Blazers.\n\nKNIGHT FLIER\n\nThe play that energized the Suns' comeback late in regulation time was Brandon Knight's one-handed throwdown over Turner with 5:41 left in the fourth. It brought the Suns' bench and the crowd to its feet.\n\n\"That was a huge play,\" Len said. \"He's just getting healthy ... so now you can see when we get him back, he has athleticism, his bounce back.\"\n\n`DAME' TIME\n\nLillard is the first NBA player to score 27 or more points in each of his team's first five games since Kobe Bryant did so with the Lakers at the outset of the 2005-06 season. Lillard's 163 points in the season's first five games are the most ever by a Blazer to start a season.\n\nFOCUS ON DEFENSE\n\nWatson believes the Suns can be a top defensive team in the NBA at some point this season. He said analytics showed they were 13th in the league in points allowed per 100 possessions before Monday's games.\n\n\"We know we're going to get better. We understand we just played three of the top four teams in the NBA (Oklahoma City, Golden State, Clippers) so the sample size is too soon to judge,\" Watson said before Wednesday's game. \"We believe we can end up top seven easily.\"\n\nCULTURAL CELEBRATION\n\nThe Suns celebrated Day of the Dead, a traditional Mexican holiday, to honor their Latino fan base Wednesday night. They wore their purple \"Los Suns\" jerseys, a group of mariachis played the national anthem and fans received \"calavera,\" or skull head, bobbleheads.\n\nUP NEXT\n\nBlazers: At Dallas on Friday night.\n\nSuns: At New Orleans on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764996014.673367
}