{
  "game_id": "0022200709",
  "espn_id": "401468864",
  "date": "Jan 23, 2023",
  "matchup": "MIN @ HOU",
  "headline": "Green scores career-high 42, Rockets end 13-game skid",
  "body": "HOUSTON -- — Jalen Green scored a career-high 42 points and the Houston Rockets held on for a 119-114 victory over the Minnesota Timberwolves on Monday night to snap a 13-game losing streak.\n\n\r\n              Green, the second overall pick in the 2021 draft, had 21 points by halftime and kept up his strong play in the second half to lead the Rockets to their first victory since Dec. 26 at Chicago. They ended their longest skid of the season and also a 10-game home losing streak, winning at home for the first time since Dec. 13 against Phoenix. \n\n\r\n              Green bounced back after shooting just 3 of 13 with 10 points in a loss to the Timberwolves on Saturday night. \n\n\r\n              Coach Stephen Silas could see the drive in Green to perform better from the start Monday night. \n\n\r\n              “He was ready for tonight,” Silas said. “It was time for us to buckle down and have a focused game for 48 minutes and he was the leader of that tonight.” \n\n\r\n              Green said he was “a little bit in my head” after his bad game Saturday but was determined to turn things around. He was thrilled that his big game helped Houston end its skid.\n\n\r\n              “It feels good,” he said. “My guys relied on me, coaches relied on me. We needed that. We were desperate for it. We came out and executed.” \n\n\r\n              Anthony Edwards had 31 points and D'Angelo Russell tied a season high with 30 for the Timberwolves, who had won two straight. \n\n\r\n              “You are what you repeatedly do,” Minnesota coach Chris Finch said. “We've repeatedly struggled with these types of games so focus... has to be part of the problem, but we just didn't have enough guys play well either.”\n\n\r\n              Rookie Tari Eason talked about the Houston's mindset entering Monday's game. \n\n\r\n              “I just told the team before the game, just be desperate,” Eason said. “And I think that’s what we did tonight. Everybody played desperate. Everybody played their tails off.”\n\n\r\n              The Rockets were clinging to a one-point lead before Green scored the next five points, capped by a 3-pointer, to make it 105-99 with two minutes to go. \n\n\r\n              Edwards made the second of two free throws before Green struck again, knocking down a long 2-pointer to leave Houston up 107-100 with 90 seconds to go. \n\n\r\n              Kenyon Martin Jr. then stole the ball from D’Angelo Russell and finished on the other end with a dunk to extend the lead to nine with less than a minute left. \n\n\r\n              Edwards made a 3 for Minnesota after that but Green hit a 3-pointer for Houston seconds later to make it 112-103 with 41 seconds to go. Minnesota closed within four with 12 seconds remaining but Green answer with a free throw. \n\n\r\n              Green swished a 3-pointer as time expired in the third quarter to leave Houston up 90-81. The Timberwolves used an 8-0 run, with five points from Russell, to cut the lead to 92-89 with about nine minutes left in the fourth quarter.\n\n\r\n              Houston went on a 7-0 run, with a 3 from Garrison Mathews, to take an 81-74 lead with less than four minutes left in the third quarter. \n\n\r\n              Austin Rivers made a 3 for Minnesota second later, but the Rockets scored the next six points to make it 87-77 with about two minutes left in the quarter. \n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Taurean Prince sat out with a sprained left ankle. … Rudy Gobert had 15 points and 16 rebounds in his return after missing three games right groin soreness. \n\n\r\n              Rockets: Rookie Jabari Smith Jr. missed a second straight game with a sprained right ankle. … Kevin Porter Jr. missed a sixth consecutive game with a bruised left foot. ... Alperen Sengun had 21 points, seven rebounds and seven assists. \n\n\r\n              THE BASEMENT\n\n\r\n              Houston, which finished with the NBA's worst record in each of the last two seasons, is again the league's worst team this season at 11-36. Silas hopes a game like this is proof that his team is improving despite its record.\n\n\r\n              “We’re a work in progress for sure,” he said. “We still made mistakes.. but we played through them tonight and that’s the important thing.” \n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Visit New Orleans Wednesday night. \n\n\r\n              Rockets: Host Washington Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995169.119384
}