{
  "game_id": "0022000135",
  "espn_id": "401267295",
  "date": "Jan 09, 2021",
  "matchup": "PHX @ IND",
  "headline": "Bridges, Booker help Suns break through with win at Indiana",
  "body": "INDIANAPOLIS -- — Mikal Bridges found his shooting touch quickly, then finished with a flourish.\n\n\r\n                    The third-year forward scored a career-high 34 points and made the 3-pointer to cap the decisive scoring spurt midway through the fourth quarter, helping the Phoenix Suns pull away from Indiana for a 125-117 victory Saturday. \n\n\r\n                    “Whenever you hit the first couple of shots everything feels good, so you start feeling more aggressive,” Bridges said. “It felt amazing. I know when I get comfortable, I keep telling myself to keep being aggressive. Don't relax and just keep going.\"\n\n\r\n                    Bridges was 12 of 18 from the field, 6 of 8 on 3s and 4 of 4 from the free throw line. Devin Booker added 25 points as the Suns pulled into a tie with the defending champion Los Angeles Lakers for the best record in the West at 7-3 while earning their first win in Indy since 2016.\n\n\r\n                    Phoenix knocked down 16 more 3-pointers after making 38 in its previous two games. The Suns also became the ninth team in league history to open the season with 10 straight games of 10 or more 3s.\n\n\r\n                    It was simply too much for the Pacers, despite All-Star forward Domantas Sabonis finishing with 28 points, a career high-tying 22 rebounds and the first 20-20 game of his career.\n\n\r\n                    “He was good, really good,\" two-time All-Star Victor Oladipo said. “He did a really good job following up misses and playing his iso plays, getting rebounds. It was big. Unfortunately, we came up short.\"\n\n\r\n                    Phoenix used a late first-half run to take a 56-53 halftime lead, then opened the second half by scoring the first five points.\n\n\r\n                    While Sabonis almost single-handedly kept the Pacers close with 16 points in the final six minutes of the third quarter, Indiana never took the lead.\n\n\r\n                    Instead, Bridges heated up again late, knocking down a 3 to cap an 11-0 run that gave Phoenix a 109-96 lead with 5:49 to go.\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Teammates doused Bridges with an ice cold celebration following the game. ... Phoenix had only three turnovers just one night after having 20. ... The Suns are 3-0 on the second game of a back-to-back this season. ... Perennial All-Star Chris Paul had 15 points and 10 assists. ... DeAndre Ayton didn't score until 8:43 left in the third quarter and finished with eight points and 14 rebounds. ... Phoenix has its best 10-game record since starting 8-2 in 2009-10.\n\n\r\n                    Pacers: Malcolm Brogdon had 22 points, nine assists and six rebounds. ... Oladipo scored 16 points while Myles Turner had 15 points and 10 rebounds and four more blocks. ... Justin Holiday continued his strong play as of late with 17 points, including 14 in 14 first-half minutes. ... Sabonis has a double-double in all nine games this season. ... Indiana is 4-3 at home this season. ... The eight-point difference was Indiana's most lopsided loss this season.\n\n\r\n                    ON THE BUBBLE\n\n\r\n                    The recent spike in positive COVID-19 tests around the NBA has prompted some to speculate whether the league might have to rethink playing inside a “bubble.” Oladipo made it clear he's no fan of going back in the bubble, especially with up to 1,000 fans to soon be allowed inside Bankers Life Fieldhouse.\n\n\r\n                    “I hope not,\" he said of the bubble talk. “But I think the NBA is doing all they can and the NBPA as well, working together to make sure we’re as safe as possible. But it’s tough. You can try your best and unfortunately some people may still catch it. We’ve got to do the best job to limit the virus as much as possible. Hopefully it doesn’t end up being another bubble, but at the end of the day we’ve got to do what’s safest for us.\"\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Complete a three-game road trip Monday at Washington.\n\n\r\n                    Pacers: Begin a five-game road trip when they visit Sacramento on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997768.527308
}