{
  "game_id": "0021600170",
  "espn_id": "400899620",
  "date": "Nov 17, 2016",
  "matchup": "MIL @ MIA",
  "headline": "Heat beat Bucks 86-73 to end 6-game losing streak",
  "body": "MIAMI --  Hassan Whiteside likes when teams challenge him inside.\n\nThe reigning NBA blocks leader piled up seven to go with 12 points and 17 rebounds and the Miami Heat beat the Milwaukee Bucks 96-73 on Thursday night to end a six-game losing streak.\n\n\"There's two different types of coaches and teams,\" Whiteside said. \"There's coaches that say, `Hassan Whiteside is down there, don't attack him.' And then there are coaches that say, `Hassan Whiteside is down there, let's attack him,' God bless those teams. Long live those teams. I need more of those teams.\"\n\nDion Waiters led Miami with 23 points, and Josh Richardson added 18. The losing streak was the Heat's longest since 2008.\n\n\"It's just another game, we can't get too happy about one win,\" Richardson said. \"We're glad we won, but we've got to move on to the next game.\"\n\nPoint guard Goran Dragic returned for the Heat after missing three games with a sprained left ankle. He had 16 points in 35 minutes.\n\n\"Rusty a little bit,\" Dragic said. \"I didn't feel quite fast enough. The first half I struggled a little bit and then I finally got my legs under me a little bit and in the second half I felt great.\"\n\nGiannis Antetokounmpo and Tony Snell each had 14 points for Milwaukee. The Bucks shot 32.9 percent (28 of 85) from the field and have lost four of five.\n\n\"As a team we struggled on the defensive end,\" Bucks head coach Jason Kidd said. \"We couldn't guard the ball. We couldn't grab rebounds when we had to. We gave them second opportunities. On the offensive end, we just lost our patience.\"\n\nRichardson hit a corner 3, Whiteside blocked a layup attempt by Antetokounmpo, and Dragic hit a 3 in a flurry of big plays to give Miami an 80-69 lead with 7 minutes left.\n\n\"That was a big sequence for us,\" Richardson said. \"Hassan, when he gets blocks like that it energizes everybody and we're running I think we're a dangerous team.\"\n\nThe Heat held on the rest of the way, with a 3 by Waiters making it 88-73 with 3:31 left.\n\nMiami outscored Milwaukee 29-11 in the fourth quarter.\n\nThe Bucks entered the game leading the NBA in points in the paint, averaging 49.8 a game after leading the league a year ago, but were held to 34 and just 10 in the second half.\n\n\"They cover so much ground in particular G.A. and (Jabari) Parker,\" Heat coach Erik Spoelstra said. \"They really have a way of cutting and attacking, and catching and going into the paint. You have to have guys who are willing to compete, be physical, and do it with technique and discipline. And then when you get beat it helps to have a great eraser back there (with Whiteside).\"\n\nMilwaukee jumped out to a 20-6 lead, which included three impressive dunks by Parker, including taking one around-the-back on a dribble to avoid Richardson, and holding the Heat to 3-for-18 shooting.\n\nMiami quickly bounced back as Tyler Johnson's 3 gave the Heat a 30-27 lead and the teams were knotted at 48 at the break.\n\nJosh Richardson hit a pair of 3-pointers for the Heat during a 13-4 run in the third quarter to give Miami a 65-54 lead.\n\nMiami led 67-62 to start the fourth quarter.\n\n\"Our best basketball was in the second half,\" Spoelstra said.\n\nBUCKS STARS STRUGGLE\n\nAntetokounmpo and Parker, who entered the game averaging over 41 points, combined to score 25 on 10-of-35 shooting (28.6 percent).\n\n\"(Whiteside) did a good job of contesting shots, but I go to the basket, and I didn't get nothing the whole game,\" Parker said. \"I didn't get no calls.\"\n\nMcGRUDER, COACHES RECEIVE RINGS\n\nMiami's Rodney McGruder and assistant coaches Dan Craig and Octavio de la Grana received their NBA D-League championship rings for winning the title last season with the Sioux Falls Skyforce, Miami's affiliate.\n\n\"That's the same rock we got, that's awesome,\" Spoelstra said in reference to the Heat's three championship rings. \"We all felt that we were a part of it.\"\n\nMcGruder, a Kansas State product who went undrafted in 2013, made his NBA debut this season and recently earned his first start.\n\nUP NEXT\n\nMilwaukee will host Golden State on Saturday. The Bucks handed the Warriors one of their nine regular-season losses last year ending their 24-game winning streak to start the season.\n\nMiami begins a four-game, seven-day trip Saturday at Washington.",
  "source": "espn_api",
  "crawled_at": 1764995220.5473862
}