{
  "game_id": "0022000418",
  "espn_id": "401267578",
  "date": "Feb 14, 2021",
  "matchup": "MEM @ SAC",
  "headline": "Valanciunas records double-double; Grizzlies beat Kings",
  "body": "SACRAMENTO, Calif. -- — Jonas Valanciunas scored a season-high 25 points and had 13 rebounds to offset a late technical foul and the Memphis Grizzlies beat the Sacramento Kings 124-110 on Sunday night.\n\n\r\n                    Ja Morant added 16 points and 10 assists despite a rough 7-for-18 shooting night from the field. Dillon Brooks scored 22 points and Kyle Anderson had 17 points and six rebounds for Memphis, which had lost five of six. \n\n\r\n                    “Our guys were great tonight up and down the entire roster,” Memphis coach Taylor Jenkins said. “Our starters set a tone for us from the start. Our defensive activity set a tone for us offensively. Our bench came in, gave us tremendous minutes. Definitely one of our better games all around from start to finish.”\n\n\r\n                    Two days after blowing a 20-point, first-quarter lead in a loss to the Lakers, the Grizzlies built another early advantage and withstood a late run by the Kings.\n\n\r\n                    The game got chippy late, after Sacramento’s Chimezie Metu dunked over Valanciunas and held onto the rim with both hands. Valanciuanas continued to stand under the rim and did not move to allow Metu to land. \n\n\r\n                    With Metu still hanging on the rim, Valanciunas appeared to get his left arm hooked around one of Metu’s legs and threw him off as players from both teams ran in. The play was reviewed and Valanciunas was called for an unsportsmanlike technical foul.\n\n\r\n                    Valanciunas was not made available to the media after the game, but Kings coach Luke Walton called the play unsafe. \n\n\r\n                    Morant felt Metu was at fault.\n\n\r\n                    “He went a little overboard. He got the dunk, probably was excited,” Morant said. “I felt like he wrapped his legs around (Valanciunas) and that’s a little disrespectful to a man. I don’t blame JV at all.”\n\n\r\n                    Sacramento’s Cory Joseph also didn’t see it as bad.\n\n\r\n                    “Jonas was kind of underneath (Metu), he didn’t want to go down and create an injury,” Joseph said. “They were both competing, playing hard. It is what it is.”\n\n\r\n                    A few minutes later, Valanciunas dunked and hung onto the rim for several moments, even though no one was near him. \n\n\r\n                    Memphis had seven players score in double figures, led by as many as 24 points and scored 68 points in the paint.\n\n\r\n                    It wasn’t just the Grizzlies starters who stood out. \n\n\r\n                    Xavier Tillman drove the lane for a thunderous one-handed dunk and Sean McDermott followed with another dunk off a baseline drive moments later.\n\n\r\n                    The Grizzlies had not won in Sacramento since Dec. 31, 2017.\n\n\r\n                    De’Aaron Fox had 23 point and nine assists for the Kings despite not playing in the fourth quarter.\n\n\r\n                    “I would have put him back in in a different scenario, if we didn’t have another game tomorrow, if we weren’t fighting back (from) 20,” Walton said. “There wasn’t a minutes restriction on him, I was just being careful.”\n\n\r\n                    The teams were scheduled to play back-to-backs in Memphis in late January before the games were postponed due to COVID-19 issues.\n\n\r\n                    BROOKS FAST START\n\n\r\n                    Brooks, who had not scored more than 15 points in four previous games against Sacramento, had 18 in 18 minutes to get Memphis off to the double-digit lead by halftime. Brooks picked up his fourth foul 25 seconds into the third quarter, but came back to score four in the fourth.\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Brandon Clarke returned for Memphis after missing four consecutive games with a sore right calf and scored 13. ... Brooks scored 12 of Memphis’ first 21 points. \n\n\r\n                    Kings: Sacramento missed eight of its first 10 shots. … Marvin Bagley III was held out for a second consecutive game with left calf soreness. DaQuan Jeffries started in place of Bagley and had three rebounds, but did not score. Jeffries sat out 21 games this season with ankle and back injuries. \n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Host the Pelicans on Tuesday. New Orleans beat Memphis on Feb. 6 and has won four straight in the series.\n\n\r\n                    Kings: Play the Nets on Monday in the second half of a back-to-back. Brooklyn has won four straight against Sacramento.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996967.346813
}