{
  "game_id": "0022000071",
  "espn_id": "401267231",
  "date": "Jan 01, 2021",
  "matchup": "MIA @ DAL",
  "headline": "Doncic leads Mavericks past Heat 93-83",
  "body": "DALLAS -- — Luka Doncic had season highs of 27 points and 14 rebounds for his first double-double of the season to lead the Dallas Mavericks past the Miami Heat 93-83 on Friday night.\n\n\r\n                    Tim Hardaway Jr. added 18 points as the Mavericks rebounded from a 118-99 loss at home to Charlotte on Wednesday during which they trailed by 30 points in the second half.\n\n\r\n                    Bam Adebayo scored 19 points and Avery Bradley 15 for Miami.\n\n\r\n                    The Mavericks scored the final nine points of the second quarter to lead 46-31 at halftime. They padded their lead with a 10-2 run to open the third quarter and led by as many as 24 before a late Heat surge.\n\n\r\n                    When Doncic hit a step-back 3-pointer late in the first half, it ended a personal 12-shot drought from long range. He finished 3 for 9 behind the arc and added seven assists.\n\n\r\n                    The 21-year-old two-time All-Star with 29 career triple-doubles recently acknowledged he's out of shape early this season.\n\n\r\n                    “Luka’s going to get there,” Dallas coach Rick Carlisle said. “He’s busting his tail. He’s working hard. You saw him working out after the game (Wednesday). Everything for him now is trending in a good direction conditioning-wise.”\n\n\r\n                    Heat All-Star Jimmy Butler scored two points, both on free throws, and shot 0 for 6 from the floor over 27 minutes in his first appearance since playing only the first half on Christmas against New Orleans because of a sprained right ankle.\n\n\r\n                    Miami missed all 12 of its 3-point attempts in the first half and finished 7 for 33 behind the arc.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Miami has used different starting lineups in all five games this season. … G Gabe Vincent, who played 15 minutes in his season debut Wednesday, was inactive with a right knee injury.\n\n\r\n                    Mavericks: James Johnson was fined $40,000 by the NBA for instigating a fourth-quarter incident in Wednesday’s loss.\n\n\r\n                    WE'RE NOT IN FLORIDA ANYMORE\n\n\r\n                    The Heat played their previous 35 games in the Sunshine State — 29 playoff games in the Orlando bubble, preseason games at home and in Tampa, four games this season at home and in Orlando – since playing at Washington on March 8. Because of pandemic protocols, coach Erik Spoelstra reported no highlights in coming to Dallas.\n\n\r\n                    “You get on a plane, you land, you take a bus, go to your hotel, order room service and that’s it,” Spoelstra said. “It’s a little bit different than our NBA experience in a typical year. That’s just the deal, and we’re grateful that we have an opportunity to continue to play.”\n\n\r\n                    SECOND EFFORT NEEDS WORK\n\n\r\n                    The Heat and Mavericks went into the game bringing up the rear in the NBA in second-chance points, averaging 7.8 and 7.5 respectively. And they couldn’t match those figures Friday. Dallas converted four offensive rebounds into seven points, Miami five offensive boards into four points.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: On Monday they host the Oklahoma City Thunder, who will be playing their second of five straight on the road.\n\n\r\n                    Mavericks: Begin their second three-game road trip of the young season Sunday at Chicago, then play at Houston the next night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996816.686309
}