{
  "game_id": "0021600991",
  "espn_id": "400900386",
  "date": "Mar 13, 2017",
  "matchup": "CHI @ CHA",
  "headline": "Rondo provides spark as starter, Bulls top Hornets 115-109",
  "body": "CHARLOTTE, N.C. --  Bulls coach Fred Hoiberg felt he needed to \"shake things up\" following a season-high, five-game losing streak that left his team on the outside looking in at the Eastern Conference playoff picture.\n\nEnter Rajon Rondo.\n\nRondo scored a season-high 20 points and had six assists and seven rebounds in his first start since Dec. 30 as the Bulls beat the Charlotte Hornets 115-109 on Monday night.\n\n\"Is it a position I lost? Yes,\" Rondo said. \"Now I guess it's coming back to me. I don't know.\"\n\nNikola Mirotic returned from a three-game absence and scored 24 points on five 3-pointers, and Dwyane Wade and Jimmy Butler each pitched in with 23 points for the Bulls (32-35).\n\nBut it was Rondo that provided the spark.\n\nLooking to \"inject some pace\" into the offense to start the game, Hoiberg turned to Rondo over Jerian Grant. The move couldn't have worked better, as the Bulls scored 36 points in the first quarter -- two shy of their season high -- while knocking down 8 of 13 3-pointers.\n\n\"We had to make a change,\" Hoiberg said. \"... Rajon has handled this situation so well. I take my hat off to him.\"\n\nRondo had three 3-pointers in the first quarter and added three assists as the Bulls built a 12-point lead. Chicago continually knocked down shots early on making 11 of their first 19 3-point attempts, many coming off easy kick-outs to the wing.\n\n\"We didn't do a good job of keeping our man in front of us,\" said Jeremy Lamb, who started and led the Hornets with 26 points. \"They got to the middle of the paint a lot and kicked it out for 3s.\"\n\nHoiberg called the ball movement a \"beautiful thing\" to watch.\n\n\"Let's put this thing on loop and show how we want to play,\" Hoiberg said. \"We were sharing it. We were making the unselfish plays. It wasn't sticking in guys' hands. We were driving into the paint and kicking it out with great spacing on the back side. It is how you want to do it.\"\n\nThe Hornets battled back from 16 points down to tie the game in the third quarter at 69 but could never take the lead. Every time Charlotte got close, Mirotic seemed to come up with a big basket.\n\nMichael Kidd-Gilchrist had 22 points and Kemba Walker 21 for the struggling Hornets. Marvin Williams had 13 points and tied a career high with 18 rebounds for his fifth double-double in six games.\n\nTIP-INS\n\nBulls: After a fast start, the Bulls finished 14 of 40 from beyond the arc. ... Outscored the Hornets 18-2 on fast-break points. ... Wade, Rondo and Butler were all 8 of 15 from the field.\n\nHornets: Nic Batum did not play because of a migraine. ... Frank Kaminsky returned after missing the last five games with a sprained AC joint. ... Carolina Panthers perennial Pro Bowl linebacker Luke Kuechly had a front row seat to the game along with Panthers coach Ron Rivera.\n\nMIROTIC BACK\n\nMirotic said he spent that extra time off getting up shots and working in the weight room while trying to stay patient.\n\n\"I was ready (and) had a lot of energy to make some shots and grab some rebounds and play simple basketball,\" Mirotic said.\n\nDID SOMEONE SAY PLAYOFFS?\n\nThe Hornets' playoff hopes are fading fast. They are four games behind Milwaukee for the eighth playoff spot with Chicago and Miami in between them.\n\n\"We are trying to stay optimistic and we keep telling each other we have time, but I'm not sure how (much) time we have now,\" Williams said.\n\nUP NEXT\n\nBulls: Return home to face Grizzlies on Wednesday night.\n\nHornets: Head to Indiana to face the Pacers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995021.502164
}