{
  "game_id": "0021601168",
  "espn_id": "400900546",
  "date": "Apr 05, 2017",
  "matchup": "HOU vs. DEN",
  "headline": "Rockets beat Nuggets 110-104 to secure 3rd seed in West",
  "body": "HOUSTON -- After missing his first game of the season on Sunday because he had the flu, James Harden was thrilled to not only be back on the court on Wednesday, but to be feeling like himself again.\nHarden scored 31 points and the Houston Rockets squandered a big early lead, but held on to outlast the Denver Nuggets for a 110-104 win that secured the third seed in the Western Conference.\n\"I can walk and talk now,\" he said. \"I was on bed rest for a couple of days just because I couldn't really talk, couldn't move. I had the shakes. But I'm back. So I'm good.\"\nThough the Rockets have been in third place in the West for the majority of the season, they were excited to know for sure that they'd have that spot in the postseason.\n\"It's good,\" Harden said. \"We've got the third-best record in the league right now. So we just want to close out the season the right way ... and just get some momentum going into the postseason. That's the most important thing.\"\nThe Nuggets cut the lead to two points on a layup by Nikola Jokic with 1:20 remaining. A 3-pointer by Harden a few seconds later pushed the lead to 106-101 and brought the crowd, which included rapper Travis Scott, to its feet.\nHarden added two free throws after that for the last of 15 straight points he scored for Houston in the second half of the fourth quarter. Along with being over the flu, the time off gave Harden's sore left wrist a chance to get better.\n\"He was shooting the ball better and he's just more fluid with his wrist,\" coach Mike D'Antoni said.\nThe Nuggets got a dunk from Danilo Gallinari next to cut the lead to four, but Eric Gordon added a pair of free throws to secure the win.\nThe victory improves Houston to 4-0 against the Nuggets this season after the Rockets lost all three games to Denver last season.\nGallinari had 23 points for the Nuggets, who are in ninth place and are fighting for the last playoff spot in the West.\n\"We still have our chances and we have to keep fighting and playing as we have four games left,\" Gallinari said. \"We have to get them all.\"\nHouston led by six entering the fourth quarter and remained up by that many before the Nuggets scored four quick points to cut the lead a basket with about nine minutes left.\nThe Nuggets cut the lead to two points after a layup by Wilson Chandler midway through the quarter. Houston then used a 5-2 spurt, with all of the points by Harden, to extend its advantage to 98-93 with about five minutes left.\nDenver trailed by nine early in the third quarter before using an 18-7 run to take a 73-71 lead with just under five minutes in the quarter. Garry Harris, Kenneth Faried and Jameer Nelson had six points each in that span to fuel the run.\nA layup by Harris soon after that left the Nuggets up by one before the Rockets scored seven straight points, capped by a 3-pointer from Harden to go on top 83-77 with about 90 seconds left in the quarter.\nEmmanuel Mudiay added a layup for the Nuggets after that before Houston's Troy Williams ended the third quarter with a put-back dunk to leave the Rockets up 85-79 entering the fourth quarter.\nThe Rockets led by as many as 17 in the first half and were up 59-50 at halftime.\nTIP-INS\nNuggets: Nelson returned after missing the last two games with a sprained right calf. He had eight points in 32 minutes. ... Harris finished with 17 points. ... The Nuggets made just 7 of 38 3-point attempts. ... Chandler had 16 points off the bench.\nRockets: Ryan Anderson could return on Friday after sitting out since spraining his right ankle on March 24. D'Antoni said if Anderson can practice on Thursday without pain, then he'll play Friday, but that he could have to sit out a few more days. ... Harden had 10 assists for his league-leading 61st double-double. ... Nene had 16 points.\nMCGRADY HONORED\nThe Rockets honored Tracy McGrady as part of their 50th anniversary celebration on Wednesday night. McGrady, who was elected to the Hall of Fame this week, spent 5 1/2 seasons with the Rockets. As part of the celebration, the Rockets handed out a \"13 in 35\" bobblehead to commemorate the time he scored 13 points in 35 seconds to beat the Spurs 81-80 on Dec. 9, 2004.\nUP NEXT\nNuggets: Host New Orleans on Friday.\nRockets: Host Detroit on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995732.5269399
}