{
  "game_id": "0022000829",
  "espn_id": "401307624",
  "date": "Apr 14, 2021",
  "matchup": "CHA vs. CLE",
  "headline": "Allen scores 15 in return, Cavaliers beat Hornets 103-90",
  "body": "CHARLOTTE, N.C. -- — Jarrett Allen felt better than he expected in his first game since March 26.\n\n\r\n                    “I thought I'd be sluggish and a step behind everybody,” Allen said. “But I scored the first basket on a dunk and it just went from there.”\n\n\r\n                    Taurean Prince scored a season-high 25 points with six 3-pointers, Allen had 15 points and eight rebounds and the Cleveland Cavaliers handed the Charlotte Hornets their third straight loss at home Wednesday night, 103-90. \n\n\r\n                    Kevin Love added 17 points and 11 rebounds as Cleveland (20-34) snapped a two-game skid and walked away with a renewed level of confidence.\n\n\r\n                    Things went so well, players talked after the game about the playoffs being a possibility with the roster getting back to full strength. Collin Sexton, who missed his second straight game with a strained groin, is the other key piece still out, but is expected to return soon.\n\n\r\n                    “We have 18 games to go and we're going to fight to get into that play-in game,” Allen said.\n\n\r\n                    “This is just a little glimpse” of our potential, said Cavaliers guard Darius Garland, who finished with 17 points and seven assists. “We are just getting started. ... I think you will see the best basketball from us as we try to make a playoff push.”\n\n\r\n                    It was Allen’s first action since suffering a concussion against the Los Angeles Lakers, forcing him to miss eight games. He opened strong with two dunks on Cleveland's first three possessions and had four for the game. He finished 5 of 9 from the field and played 30 minutes.\n\n\r\n                    Larry Nance Jr. also returned for Cleveland after missing seven games with an illness, but struggled to find his rhythm. He had five points on 1-of-7 shooting in 20 minutes and looked out sync.\n\n\r\n                    Prior to the game, the frontcourt tandem of Love and Allen had played just seven minutes together. Allen joked that “other than Kevin stealing a few of my rebounds, I thought we shared the court well.”\n\n\r\n                    “I think our chemistry is better than I could have imagined,” Allen said.\n\n\r\n                    Terry Rozier had 22 points, eight assists and seven rebounds to lead the short-handed Hornets. Miles Bridges added 20 points.\n\n\r\n                    Rozier returned to the starting lineup after sitting out Tuesday night against the Lakers, but the Hornets (20-20) were still without four of their top six scorers in LaMelo Ball, Gordon Hayward, P.J. Washington and Malik Monk — and it showed.\n\n\r\n                    Charlotte shot 40.5% from the field and 50% from the line.\n\n\r\n                    “We’re limited offensively right now,” Hornets coach James Borrego said. “We’ll try to get to 100 points as much as we can. It’s going to be a challenge. No excuses, this is our group.\"\n\n\r\n                    Cleveland led by nine entering the fourth quarter and held the Hornets at bay behind a series of 3-pointers, including three by Prince in the final four minutes. Prince finished 9 of 13 from the field and 6 of 8 from 3-point range.\n\n\r\n                    “He’s been able to be a really consistent punch off the bench, not only on the offensive end, but he gets a ton of deflections, he comes up with steals,” Cavs coach J.B. Bickerstaff said of Prince. “He provides you with opportunities in transition where he runs. He can attack off the dribble and make 3s.”\n\n\r\n                    TIP INS\n\n\r\n                    Cavaliers: This was the 25th different starting lineup this season. ... Had 27 assists with all 10 players recording at least one. ... Bench outscored Charlotte 41-19.\n\n\r\n                    Hornets: Were outrebounded 47-38.\n\n\r\n                    STEVENS GETS CONTRACT\n\n\r\n                    The Cavaliers have signed forward Lamar Stevens from the Cleveland Clinic Courts to a multi-year contract before the game.\n\n\r\n                    The 6-foot-8, 225-pound Stevens signed a two-way contract with Cleveland on Nov. 28 and has appeared in 37 games with averages of 4.4 points and 2.5 rebounds in 13.1 minutes.\n\n\r\n                    ROOKIES COULD SEE ACTION\n\n\r\n                    Borrego suggested he may give rookie big men Vernon Carey Jr. and Nick Richards some playing time coming up to spell centers Bismack Biyombo and Cody Zeller. \n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Host the Warriors on Thursday night on the second of a back-to-back.\n\n\r\n                    Hornets: Travel to face the Nets on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997351.675313
}