{
  "game_id": "0021900842",
  "espn_id": "401161484",
  "date": "Feb 23, 2020",
  "matchup": "LAL vs. BOS",
  "headline": "LeBron's clutch jumper sends Lakers past Celtics 114-112",
  "body": "LOS ANGELES --  Although LeBron James is still relatively new to the Los Angeles Lakers' rivalry with the Boston Celtics, he relishes the chance to participate in the history and passion behind this series.\n\nWhen James had the chance Sunday to make another significant mark in this chapter of NBA history, he stepped back and did it with pleasure.\n\nJames scored 29 points and put the Lakers ahead on a fallaway jumper with 30 seconds to play, and Los Angeles split its season series with Boston in a 114-112 victory.\n\nJames also had nine assists and eight rebounds in another superb all-around game. He missed a tying free throw moments before he coolly nailed the turnaround shot over Jayson Tatum to put the Lakers ahead to stay in their fifth straight win overall.\n\n\"I had been setting him up all night with the back-down to the drop step to the baseline,\" James said. \"I figured he would sit on it, thinking I would try it again, so I just went to my back-down, gave a little Dream Shake to the baseline and was able to open up the middle and get my fadeaway.\"\n\nWhen Tatum was called for an offensive foul in the final second, the Lakers could celebrate another memorable meeting between two clubs with 33 NBA titles between them.\n\nJames put up a triple-double when the Lakers won in Boston last season in his first taste of the rivalry, but LA had lost his ensuing two meetings with the Celtics.\n\n\"It's just special to be part of this rivalry,\" James said. \"We understand that this has been going on since the `50s, `60s, `70s, `80s, `90s, all the way through. So to be a part of a rivalry, to be a part of a historical two-franchise group, this is special. ... (We love) to represent this rivalry with the utmost respect and play this game the right way, as all the former players have done in the past.\"\n\nJames was thinking of Celtics great Bill Russell, who watched the game at courtside while wearing Kobe Bryant's jersey. He was also thinking of Tatum, who matched his career high with 41 points while wearing a purple wristband in memory of Bryant, a mentor and teacher to the Celtics star.\n\n\"That's a great atmosphere,\" said Boston's Jaylen Brown, who scored 20 points. \"It don't get too much better than that. To be honest, I had a great time. Even though we lost, it was fun being out there competing at the highest level, and it makes you thirsty for the postseason.\"\n\nAnthony Davis had 32 points and 13 rebounds for the Lakers, who took a 32-point blowout loss in Boston last month. The Celtics had won 12 of 14 starting with that dominant win.\n\nDavis hit two free throws with 12.3 seconds left in the rematch and added one more with 6.7 seconds to play. But Tatum was called for a push-off foul as he attempted to create space for one last shot against Kentavious Caldwell-Pope.\n\nTatum scored just six points in the final 18 minutes, with Caldwell-Pope doing much of the defensive work.\n\n\"It was a step in the right direction,\" Tatum said of his performance against James and Davis. \"I definitely looked up to those guys and know how great they are individually, so just trying to earn the respect of the guys I look up to.\"\n\nWith the Lakers' immediate return to excellence since beating out Boston to acquire Davis last summer, these longtime rivals are both playoff-bound championship contenders yet again.\n\nLos Angeles is comfortably atop the Western Conference standings, while the Celtics sit third in the East. Both teams have a decent shot of meeting in the NBA Finals for the 13th time if they continue to grow from big games like this thriller.\n\nThe Celtics played without star Kemba Walker, who missed his second straight game with left knee soreness.\n\n\"It was about who wanted it more,\" Davis said. \"With or without Kemba, they're a tough team. They've proven they can win without him. To play a team like that in a playoff atmosphere is something you want. We just stayed with it. We know how big this rivalry is.\"\n\nTIP-INS\n\nCeltics: Walker's injury is \"not a long-term thing,\" coach Brad Stevens said. Walker did work in the weight room before the game. ... The bench scored just five points in the first three quarters, including only one field goal, and finished with 11 points.\n\nLakers: James went down with the wind knocked out of him early in the fourth quarter when Daniel Theis ran into him under the basket. James stayed in the game after a timeout. ... Rajon Rondo received praise from his teammates for his stellar defensive play. He spent much of the pregame warmup chatting with Kevin Garnett, his longtime Celtics teammate.\n\nTATUM'S MOVE\n\nTatum underlined his growing superstardom by matching the career high he set against New Orleans last month. He scored 16 points in a five-minute barrage alone during the third quarter, finishing the period with 18.\n\nTatum said he came up for the idea for the purple wristbands along with the Celtics' equipment staff. Tatum was an enormous fan of Bryant, who shared tips about basketball and life with the young Boston star.\n\nWILD FINISH\n\nDavis' third 3-pointer put the Lakers up 108-105 with 2:08 to play, but Gordon Hayward hit a jumper before Brown's 3-pointer put the Celtics back ahead 110-108 with 1:17 to go.\n\nBoston turned the ball over with 15.5 seconds left after James' big shot, and Stevens got a technical foul for arguing about it. Davis missed that free throw, however.\n\nMARKIEFF ARRIVES\n\nAbout 90 minutes after the game, the Lakers announced they've signed veteran Markieff Morris and waived injured center DeMarcus Cousins. Morris will provide wing defense and rebounding in a backup role for the Lakers, who added him two days after he was bought out by Detroit.\n\nUP NEXT\n\nCeltics: Visit the Portland Trail Blazers on Tuesday night.\n\nLakers: Host the New Orleans Pelicans on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995973.288534
}