{
  "game_id": "0022400639",
  "espn_id": "401705205",
  "date": "Jan 25, 2025",
  "matchup": "TOR @ ATL",
  "headline": "Raptors sweep 2-game set in Atlanta, beating the Hawks 117-94",
  "body": "ATLANTA -- — Scottie Barnes had 24 points and 11 rebounds and the Toronto Raptors swept a two-game set in Atlanta for their season-high third straight victory, beating the Hawks 117-94 on Saturday night.\n\n\r\n              RJ Barrett and Chris Boucher added 23 points each for Toronto. The Raptors beat Atlanta 122-119 on Thursday night.\n\n\r\n              Vit Krejci led the Hawks with 20 points. Trae Young had 16 points. The NBA assist leader didn't have an assist in the first three quarters and finished with four.\n\n\r\n              Takeaways\r\n              Raptors: Barrett, Barnes and Boucher were the driving force behind Toronto's offense, combining for 70 points. \n\n\r\n              Hawks: Atlanta added Jalen Johnson to its ever-growing injury list, and the loss highlighted Atlanta's current lack of offensive options. In addition to Johnson, who sustained a left shoulder injury Thursdayi, key bench contributor De’Andre Hunter was out with an illness and rookie Zaccharie Risacher remained out with a left adductor strain.\n\n\r\n              Key moment\r\n              After jumping out to a 27-22 first quarter lead, Atlanta went cold from the field in the second quarter, shooting 32%, Toronto outscored the Hawks 33-21 on 54% shooting over that span. \n\n\r\n              Key stat\r\n              Toronto overcame a slow first quarter by shooting 54% from the field in both the second and third quarters. The Raptors also hit 50% of their shots from 3-point range during the span.\n\n\r\n              Up next\r\n              Both teams are back in action Monday night. The Raptors host New Orleans, and the Hawks are at Minnesota.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996958.536021
}