{
  "game_id": "0022200763",
  "espn_id": "401468918",
  "date": "Jan 30, 2023",
  "matchup": "ATL @ POR",
  "headline": "Lillard scores 42 as Trail Blazers hold off Hawks 129-125",
  "body": "PORTLAND, Ore. -- — Damian Lillard scored 42 points, Anfernee Simons hit a tiebreaking 3-pointer with 34 seconds left and the Portland Trail Blazers held off the Atlanta Hawks 129-125 on Monday night.\n\n\r\n              Dejounte Murray had 40 points, eight rebounds and six assists for the Hawks, who played without star point guard Trae Young (ankle). \n\n\r\n              Lillard added six assists in his fifth 40-point game this month. Jerami Grant had 22 points and Simons finished with 21, including his clutch 3 off a pass from Lillard to give the Trail Blazers a 124-121 lead. \n\n\r\n              “I wasn’t really expecting the ball but I was prepared for it,” Simons said. “Usually, they don’t help off me like that. (DeAndre Hunter) helped way off and I got pretty much an easy 3 to get off. It was as easy as it comes.” \n\n\r\n              Lillard had no trouble giving up the ball.\n\n\r\n              “They helped all the way off (Simons). It was an easy call,” he said. \n\n\r\n              Bogdan Bogdanovic scored 23 points for Atlanta off the bench. \n\n\r\n              “Every possession matters,” Hawks coach Nate McMillan said. “We did not finish and they did.” \n\n\r\n              Portland led by 10 in the fourth quarter before the Hawks made their run and tied it at 119 on two free throws by Murray with 1:06 left. \n\n\r\n              Lillard scored on a drive but then fouled Murray, who sank two more free throws to tie it 121-all with 41.1 seconds to go.\n\n\r\n              Simons put the Blazers in front for good with his 3-pointer. Bogdanovic was fouled on a 3 with 27.1 seconds to play but missed two of three at the line, leaving Portland ahead 124-122. \n\n\r\n              Grant hit two free throws before Bogdanovic missed a 3 at the other end with 15.1 seconds to go. \n\n\r\n              A free throw by Josh Hart and two more from Lillard helped the Blazers seal it.\n\n\r\n              Lillard drained all 17 of his foul shots. Hart finished with nine points, 12 rebounds and five assists.\n\n\r\n              Portland escaped despite getting outrebounded 45-29 and outscored 21-3 in second-chance points. \n\n\r\n              “You’d rather learn and keep talking about it in wins,” Lillard said about Portland’s struggles on the glass. “We can keep having that conversation. We’ve got to box out better, hit somebody and limit these opportunities.”\n\n\r\n              Lillard had 22 points in the first half to help the Blazers take a 64-60 lead into the locker room. Murray scored 20 before the break. \n\n\r\n              Portland got a big lift from 19-year-old rookie Shaedon Sharpe, whose chase-down block on Murray with 2:49 left in the third quarter gave the crowd a jolt of energy. Sharpe also had two alley-oop dunks and a near miss that drew the loudest reaction of the night. He finished with 10 points and four rebounds in 24 minutes off the bench. \n\n\r\n              “He’s been getting a lot more comfortable on both sides of the ball,” Trail Blazers coach Chauncey Billups said.\n\n\r\n              With 2:14 left in the third, Murray received a technical for arguing a foul called on the Hawks. Lillard made three free throws to extend Portland's lead to seven. He closed the quarter scoring five straight points to put the Blazers up 99-92 heading into the fourth. \n\n\r\n              SIDELINED \n\n\r\n              Young sat out with a right ankle injury, missing his sixth game of the season. Aaron Holiday started in his place. \n\n\r\n              HONORED\n\n\r\n              Earlier in the day, Lillard was selected Western Conference player of the week. Portland went 2-1 at home last week as Lillard averaged 42.3 points while shooting 63% from the field and 51% on 3-pointers. \n\n\r\n              “You’ve got to have somebody in his face when he crosses half court,” McMillan said before the game. “He’s shown the ability to be unstoppable at times with his ability to stretch the floor and create offense. I don’t think you can give him the same look and expect to have success against him. He’s seen everything and he’s still able to affect the game.” \n\n\r\n              UP NEXT\n\n\r\n              Hawks: Play at Phoenix on Wednesday night. \n\n\r\n              Trail Blazers: Play at Memphis on Wednesday night. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994824.230624
}