{
  "game_id": "0022200440",
  "espn_id": "401468595",
  "date": "Dec 17, 2022",
  "matchup": "CLE vs. DAL",
  "headline": "Cavaliers beat Mavericks 100-99 in OT on Allen's slam",
  "body": "CLEVELAND -- — Jarrett Allen’s dunk with 2:01 remaining in overtime gave Cleveland a 100-99 victory over the Dallas Mavericks on Saturday night, keeping the Cavaliers unbeaten in five OT games this season.\n\n\r\n              Allen outjumped two defenders to grab a lob from Darius Garland, then slammed home the ball over Christian Wood for the final points in the five-minute session. Kemba Walker had opened OT with a 3-pointer to give Dallas a 99-96 lead.\n\n\r\n              “It was a character win because we just didn’t have it tonight,” Cavaliers coach J.B. Bickerstaff said. “But that wasn’t an excuse for the guys. They went out and picked it up defensively, which you’ve got to do when your shots aren’t falling.”\n\n\r\n              The Mavericks had three opportunities to take the lead in the last minute, including Wood’s 30-footer as time expired. Frank Ntilikina was stripped by Donovan Mitchell and Walker’s jumper landed between the backboard and the rim on the other two.\n\n\r\n              Mitchell scored 25 points and Darius Garland had 18 points, seven rebounds and 12 assists for Cleveland, which has the best home record in the NBA at 14-2. Allen added eight points and 15 rebounds, and Evan Mobley had 17 points and eight rebounds.\n\n\r\n              “Nights like this, it’s all mental, so you’ve got to fight real deep and find that energy,” said Mobley, who scored 10 points in the fourth quarter. “But we got the stops we needed at the end.”\n\n\r\n              Four-time All-Star guard Walker, who signed with Dallas on Nov. 29, had 32 points and seven assists over 42 minutes in his third game. Wood had 26 points and 14 rebounds, and Hardaway scored 13 points.\n\n\r\n              Dallas forced OT on Walker’s driving layup with 3.5 seconds left in the fourth, tying the score at 96-all. After Mitchell was called for an offensive foul with 0.7 ticks left, Tim Hardaway Jr. missed a half-court shot at the buzzer.\n\n\r\n              Dallas was without its starting backcourt of Luka Doncic (right quadriceps strain) and Spencer Dinwiddie (right knee maintenance), and center Dwight Powell (left thigh bruise). Doncic is the second-leading scorer in the NBA at 33.0 points per game.\n\n\r\n              “You have to have a next-man up mentality -- and we had a lot of next men up tonight,” Mavericks coach Jason Kidd said. “This is the hardest part of our schedule, but we’re professionals and we’re here.”\n\n\r\n              The Cavaliers are 2-0 on their longest homestand of the season, a six-gamer that runs through Dec. 26. Cleveland is allowing a league-low 104.8 points per game.\n\n\r\n              Both teams were on the second half of a back-to-back set. The Cavaliers beat Indiana 118-112 at Rocket Mortgage FieldHouse, while the Mavericks did not check into their downtown Cleveland hotel until 3:37 a.m.\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Walker made his first start since Feb. 16 with the Knicks against Brooklyn. Walker, whose career scoring average is 19.4, is with his fourth team in five years. … G Josh Green (right elbow sprain) and F Maxi Kleber (right hamstring tear) were inactive, and F Davis Bertans (illness) did not play. … Dallas lost to the Cavaliers for the second time in four days, dropping a 105-90 decision Wednesday.\n\n\r\n              Cavaliers: F Lamar Stevens (right knee soreness) was unable to play. Stevens started the previous eight games, averaging 6.6 points and 5.9 rebounds. … Mobley appeared in his 100th NBA game. The second-year pro is one of 11 players in league history to surpass 1,400 points, 800 rebounds, 200 assists and 150 blocks while shooting better than 50% from the field in his first 100 contests.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: At Portland on Monday night.\n\n\r\n              Cavaliers: Host Utah on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995244.926741
}