{
  "game_id": "0021800860",
  "espn_id": "401071533",
  "date": "Feb 13, 2019",
  "matchup": "SAC @ DEN",
  "headline": "Jokic tips in winner as Nuggets beat Kings 120-118",
  "body": "DENVER --  Ejected in the first half, Nuggets coach Michael Malone didn't get to an in-person look at Isaiah Thomas' first 3-pointer in a Denver uniform. He also didn't watch from his usual vantage point as Nikola Jokic tipped in the winner.\n\nThe raucous reverberations from inside the arena told him everything.\n\nJokic knocked in a basket with less than a second remaining, Thomas hit two big 3-pointers in his long-awaited Denver debut and the Nuggets held off the Sacramento Kings 120-118 on Wednesday night.\n\n\"This was one of the few home games that's gone down to the wire, which is good for us,\" said Malone, who watched from the locker room after receiving two technicals just before halftime. \"We need to continue to be challenged and be forced to execute and get stops.\"\n\nJokic finished with 20 points, 18 rebounds and 11 assists for his 28th career triple-double, and Paul Millsap matched a season high with 25 points to help Denver overcome a 17-point first-half deficit.\n\nDown six late, the Kings tied it on Buddy Hield's layup with 15.1 seconds. In a timeout, it became next-coach-up time in the Denver huddle. Wes Unseld. Jr., filling in for Malone, helped design a play to get Jokic open.\n\nJokic went to work down low, missing his first shot attempt before tipping it in. Hield's last-gasp 3-pointer was off the mark at the buzzer.\n\n\"Coach Wes, everybody, all stepped up,\" said Jamal Murray, whose team is a league-best 25-4 at home this season.\n\nHield wouldn't mind another crack at that shot.\n\n\"I was trying to find the rim but I didn't get my eye on the rim,\" said Hield, who led six Sacramento players in double figures with 25 points. \"On to the next. Enjoy the weekend we have coming up.\"\n\nThe Nuggets head into the All-Star break with a 39-18 record and on the heels of Golden State for the top spot in the Western Conference. Denver's trying to make the postseason for the first time since 2012-13.\n\nThomas proclaimed his surgically repaired hip good to go prior to the game and was anxious to step back onto the court. He received a standing ovation when he entered the game late in the first quarter.\n\nThe 30-year-old Thomas showed flashes of his talent in shaking off some rust. He played 13 minutes and scored eight points -- all in the third quarter -- in his first NBA game since March 22 when he was with the Los Angeles Lakers. The Nuggets signed the two-time All-Star to a one-year deal in the offseason and gave him plenty of space to recover from his hip operation.\n\nThomas scored his first basket of the season on a 3-pointer with 2:16 left in the third quarter. Moments later, he drained another 3-pointer that gave Denver its first lead since early in the game.\n\n\"When my name is called, I'm going to always be ready,\" Thomas said. \"When I'm in the game, I'm going to make it hard for the coach to take me out.\"\n\nTIP-INS\n\nKings: Sacramento scored 41 points in the first quarter. ... F Harrison Barnes had 19 points and 11 rebounds. ... De'Aaron Fox had 15 points and 10 assists.\n\nNuggets: G Gary Harris sat out a seventh straight game with a strained adductor. ... G Malik Beasley was ejected in the fourth quarter after picking up a second technical. He had 21 points.\n\nWELCOME, FLACCO\n\nAsked to talk about Thomas, Malone quipped: \"I was hoping we could talk about Joe Flacco.\"\n\nThe veteran QB was acquired by the Denver Broncos on Wednesday in a trade with Baltimore that will become official next month when the league's new year begins, a person with knowledge of the agreement told The Associated Press.\n\n\"I want to welcome him to Nuggets country,\" Malone cracked.\n\nKINGS AT THE BREAK\n\nAt 30-27, Sacramento is very much in the playoff picture and quickly developing chemistry after acquiring Barnes and Alec Burks in deadline deals.\n\n\"We're competing. We like each other. They get along great,\" Kings coach Dave Joerger said. \"It's a time to take a breath, get your feet up a little bit, get some mental rest.\"\n\nJOKIC'S NIGHT\n\nJokic did a little bit of everything, including a pass off the backboard to himself for a layup and another full-length pass for an easy basket. The team is now 24-4 when Jokic goes for a triple-double, including 16-0 at home.\n\nUP NEXT\n\nKings: After the All-Star break, resume a road swing by playing at Golden State on Feb. 21.\n\nNuggets: At Dallas on Feb. 22.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994179.914078
}