{
  "game_id": "0021900856",
  "espn_id": "401161498",
  "date": "Feb 24, 2020",
  "matchup": "MEM @ LAC",
  "headline": "Clippers snap 3-game skid with 124-97 rout of Grizzlies",
  "body": "LOS ANGELES --  Kawhi Leonard and the Los Angeles Clippers served notice on Monday night just how dominant they can be with a healthy roster.\n\nLeonard scored 25 points in three quarters as the Clippers snapped a three-game losing streak with a 124-97 rout of the Memphis Grizzlies.\n\nMontrezl Harrell had 22 points for Los Angeles, which led throughout and was up by 35 early in the second quarter.\n\n\"I thought we played with high intensity. I thought our guys were excited to see everybody,\" coach Doc Rivers said. \"We set the tone with our defense. With the way we can score, if we get stops, we're going to score a lot of points.\"\n\nThe Clippers were buoyed by the return of Paul George and Patrick Beverley. George, who strained his left hamstring again before the All-Star break, was back after missing last Saturday's game and scored seven of Los Angeles' first nine points. Beverley, who was out five games with a groin injury, had six points. George played 21 minutes and Beverley 19.\n\nBoth were able to slowly work their way back into the lineup as Leonard set the tone. He had 14 points in the first quarter as the Clippers roared out to a 40-14 lead. The All-Star forward scored 10 straight, including two dunks, to extend Los Angeles' advantage to 24-6 with 3:49 remaining in the period.\n\nIt was the third time this season and second against Memphis that Los Angeles put up 40 or more points in the opening 12 minutes. George scored seven of the first nine points as the Clippers shot 16 of 25 from the field in the quarter.\n\n\"I'm hoping we can keep moving forward. It's important for everyone to be able to play, know their roles and keep being consistent,\" said Leonard, who finished 10 of 17 from the field and grabbed eight rebounds in 25 minutes.\n\nThe 14 points by Memphis were the fewest Los Angeles has allowed in a first quarter this season. The Grizzlies missed nine of their first 10 shots and 16 of 21 in the period while committing eight turnovers.\n\n\"That was a tough first quarter. We have to come out ready and know teams are going to get into us defensively,\" Memphis coach Taylor Jenkins said.\n\nHarrell scored six straight points early in the second to give the Clippers a 49-14 cushion. They were up 66-37 at halftime after setting a season low for points allowed in the first half.\n\n\"It felt good. We came out with the right mindset,\" Harrell said. \"We are going to continue to get better as a group and as guys get healthy.\"\n\nJa Morant had 16 points and Josh Jackson scored 14 for Memphis (28-29), which has dropped three straight to fall under .500. The Grizzlies -- who are hanging onto the eighth seed in the Western Conference -- got within 24 at the end of the third quarter before the Clippers (38-19) extended their advantage to 37 midway through the fourth.\n\n\"It's a great team. I knew they were ready for us,\" Morant said. \"Obviously playoffs are on our minds but we're not living and dying with one game.\"\n\nLONG DAY\n\nRivers spent the entire day at Staples Center. He was there as part of the Clippers' contingent during the Kobe Bryant memorial service and stayed as the arena was being changed over to basketball.\n\n\"This morning was sensational. The game was great, too. It has been a good long day,\" Rivers said. \"I thought the spirit inside the arena was beautiful this morning. There were so many people from our league who you lose touch with. What this thing did was bring a lot of people back together.\"\n\nTIP-INS\n\nGrizzlies: Brandon Clarke played only three minutes due to right hip soreness. Clarke got the start with Jaren Jackson out the next two weeks due to a left knee sprain.\n\nClippers: Marcus Morris Sr. got his first start with Los Angeles and scored 13 points. The eighth-year forward was acquired from the Knicks in a three-team trade on Feb. 6. The starting five of Leonard, Morris, Ivica Zubac, George and Beverley marked the 29th different lineup the Clippers have opened a game with this season.\n\nUP NEXT\n\nGrizzlies: Finish their four-game road trip against Houston on Wednesday. They have split the first two meetings with the Rockets this season.\n\nClippers: Play at Phoenix on Wednesday. They have won nine of their last 10 against the Suns.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995692.545502
}