{
  "game_id": "0021900781",
  "espn_id": "401161423",
  "date": "Feb 08, 2020",
  "matchup": "TOR vs. BKN",
  "headline": "Raptors top Nets 119-118, extend record winning streak to 14",
  "body": "TORONTO --  Overcoming the absence of injured stars is becoming a regular occurrence for the Toronto Raptors.\n\nSo is winning games.\n\nFred VanVleet scored 10 of his 29 points in the fourth quarter, Pascal Siakam scored 20 points, including the tiebreaking free throw with 22 seconds remaining, and the Raptors extended their franchise-record winning streak to 14 by beating the Brooklyn Nets 119-118 on Saturday night.\n\nTerence Davis scored 20 points in his first home start, Matt Thomas had a career-high 15 and Serge Ibaka added 12 as the Raptors won despite playing without All-Star guard Kyle Lowry, earning their 10th consecutive home victory over the Nets. Toronto has won 18 of 19 in the series, including six straight.\n\nDavis started for Lowry, who was inactive because of a whiplash injury caused by an accidental collision with Ibaka in the third quarter of Friday's win at Indiana. Lowry was pictured on social media wearing a neck brace on the flight back to Toronto.\n\nVanVleet said the Raptors have become accustomed to winning without a complete lineup.\n\n\"At this point, I think we're experienced enough in that realm, unfortunately,\" VanVleet said. \"We've had a ton of guys out this year. We don't really think about it.\"\n\nBesides Lowry, Raptors center Marc Gasol missed his sixth straight game because of a sore left hamstring, while guard Norman Powell sat for the fourth consecutive game because of a broken finger on his left hand.\n\nDavis shot 5 for 8 from 3-point range and VanVleet went 4 for 9 as the defending NBA champions remained unbeaten since a 105-104 home loss to San Antonio on Jan. 12. The Raptors swept their third straight set of back-to-back games.\n\nCaris LeVert scored a career-high 37 points, going 6 of 7 from long range, but missed a 3-pointer with a second left that would have given Brooklyn the win.\n\n\"I'm not really into moral victories,\" LeVert said of his high-scoring effort. \"I would much rather have played OK and got the win.\"\n\nSpencer Dinwiddie had 21 points and 11 assists and DeAndre Jordan had 15 points and 14 rebounds, but the Nets lost for the first time in three games without injured guard Kyrie Irving (sprained right knee).\n\nBrooklyn coach Kenny Atkinson praised Toronto for \"incredible depth\" that has prolonged its current streak.\n\n\"That's how you go on a long streak in this league,\" Atkinson said. \"You just can't do it with your top five or your top six. You've got to be deep, and they are deep.\"\n\nThe Nets trailed by 12 points to begin the fourth but LeVert scored on three straight possessions to tie it at 118 with 35 seconds left.\n\nSiakam restored Toronto's lead by splitting a pair of free throws with 22 seconds remaining. The Nets let the clock run down and gave LeVert a chance to win it, but his pull-up 3 bounced off the rim. Brooklyn's Joe Harris grabbed the rebound, but missed a layup as the buzzer sounded.\n\n\"They guarded it pretty well,\" LeVert said of the final play. \"I tried to get a good shot up but they played pretty good defense on it.\"\n\nLeVert has scored 20 or more in three straight games, the longest such streak of his career.\n\n\"He caught his rhythm and he's doing it consistently now.\" Atkinson said. \"It's game after game.\"\n\nUp 36-33 after one, Brooklyn missed seven straight shots to begin the second, a slump that ended on a reverse dunk by Jordan with 7:30 left in the quarter. Thomas scored 11 points in the second and Siakam had eight as Toronto outscored Brooklyn 33-18 to lead 66-54 at halftime.\n\nDavis scored 11 points in the third and VanVleet added nine as Toronto took a 100-88 lead to the fourth.\n\nTIP-INS\n\nNets: Taurean Prince missed seven of eight shot attempts in the first. He finished 6 for 16 and scored 17 points. . Brooklyn is 8-16 on the road. . Six of Jordan's double-doubles this season have come off the bench.\n\nRaptors: Davis led Toronto with eight rebounds. . Gasol shot on the court before the game, but isn't expected to return until after the All-Star break. . Toronto's 39-14 record after 53 games is the best in franchise history.\n\nOFF THE MATT\n\nThomas played a career-high 22 minutes and shot 6 of 9, including 3 of 4 from long range.\n\n\"Every time he rises up, you think it's going in,\" Raptors coach Nick Nurse said.\n\nThomas also matched his career best with six rebounds.\n\nTAKE CARE\n\nToronto matched a season low with seven turnovers. The Raptors didn't turn the ball over at all in the fourth.\n\nUP NEXT\n\nNets: Visit Indiana on Monday.\n\nRaptors: Host Minnesota on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995595.716853
}