{
  "game_id": "0021800328",
  "espn_id": "401071009",
  "date": "Nov 30, 2018",
  "matchup": "LAL vs. DAL",
  "headline": "LeBron, Lakers rally in 2nd half to beat Mavericks 114-103",
  "body": "LOS ANGELES --  The Los Angeles Lakers were stuck in neutral for most of the first half against Dallas. Then they ramped up their defense and rallied for a second win in as many nights, posting a 114-103 victory over the Mavericks on Friday night.\n\n\"From the second quarter on, our defense stepped up. We did a nice job of getting stops and getting out and running,\" Lakers coach Luke Walton said. \"We found our energy and were able to carry it on from there. It was ugly in the first. We weren't able to get back in transition and had too many turnovers.\"\n\nDallas shot 12 of 25 from the field in the first quarter and then shot just 36 percent (22 of 61) the rest of the game. The Lakers (13-9) had a 31-13 advantage in fast-break points and outscored the Mavericks 62-40 in the paint.\n\nLeBron James missed five of six from the field in the first quarter before going 11 of 15 the rest of the way and finishing with 28 points.\n\n\"I knew what type of basketball I played in the first quarter and the result of that was us playing poor. I hit the reset button and knew I would be much better,\" James said.\n\nBrandon Ingram added 19 points and was lauded by Walton for holding Dallas rookie Luka Doncic to six points and 2 of 13 from the field.\n\n\"We tried to contest every shot that he took, whether it was going to the lane, midrange or 3-pointers,\" Ingram said.\n\nKyle Kuzma added 15 points and 12 rebounds for the Lakers. It's the third time in five back-to-back sets this season that they have taken both games.\n\nLos Angeles trailed for most of the first three quarters -- and fell behind by as many as 15 in the second -- before going on a 10-4 run the final three minutes of the third to take a 78-75 advantage into the fourth.\n\nThe Lakers were up 90-86 before taking control with a 15-3 run that included nine points by Kentavious Caldwell-Pope.\n\nHarrison Barnes led Dallas (10-10) with 29 points, and Dwight Powell added 17 off the bench.\n\nDallas was assessed four technical fouls in the game, including three in the fourth quarter. JJ Barea was ejected midway in the fourth after receiving his second technical.\n\n\"The combination of second shots and turnovers really hurt us in stretches in the second half,\" Dallas coach Rick Carlisle said. \"Our bad stretches were longer than our good stretches. It was a very disappointing loss.\"\n\nDallas led 45-30 less than four minutes into the second quarter when the Lakers got back into it with 10 straight points, which included six by James. The Mavericks led 58-53 at halftime.\n\nTIP-INS\n\nMavericks: Dennis Smith Jr. scored 13 points and Wesley Matthews added 11. DeAndre Jordan had 12 rebounds and eight points. ... Dallas started 3 of 6 on 3-pointers and then went 3 of 21 from beyond the arc the rest of the half. ... The 27 3-point attempts in the first half marked a season high, surpassing the 26 the Mavs had on Oct. 20 against Minnesota. ... Barnes is averaging 17 points against the Lakers in the first half of games this season.\n\nLakers: Tyson Chandler (13 points, 12 rebounds) got his double-double with Los Angeles while Lonzo Ball added 10 points. ... James averaged 28.3 points in November, marking the sixth time in his career he has averaged 28 points or more during that month. ... Los Angeles had 11 turnovers in the first half, marking the 11th time this season it had 10 or more in the first 24 minutes. ... Kuzma scored 13 points in the third quarter, which is his second-most in a quarter this season. He had 14 in the second quarter against San Antonio on Oct. 22.\n\nUP NEXT\n\nMavericks: Remain in Los Angeles to face the Clippers on Sunday.\n\nLakers: Host Phoenix on Sunday afternoon to cap a stretch of three home games in four days.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995022.486083
}