{
  "game_id": "0022201227",
  "espn_id": "401469382",
  "date": "Apr 09, 2023",
  "matchup": "DEN vs. SAC",
  "headline": "Brown, Nnaji lead Nuggets over Kings, end 3-game skid",
  "body": "DENVER -- — Bruce Brown had a team-high 21 points and six assists, Zeke Nnaji added 18 points and seven rebounds off the bench, and the short-handed Denver Nuggets rallied from a 17-point first-quarter deficit to defeat the Sacramento Kings 109-95 on Sunday.\n\n\r\n              Both teams entered the matchup with little at stake, with Denver having secured the top seed in the western conference and Sacramento the third seed.\n\n\r\n              “To outscore them 83-52 after the first quarter with a lot of guys that haven’t played much this year was fun to watch,” Nuggets coach Michael Malone said. “Bruce was begging to go back in the game. I said ‘You’re not going back in the game, sorry.’ That’s a great problem to have.”\n\n\r\n              The Nuggets played without their top four scorers – Nikola Jokic (right calf tightness), Jamal Murray (right thumb sprain), Michael Porter Jr. (left heel injury) and Aaron Gordon (right shoulder inflammation). The Kings came out with their traditional starting lineup, but after taking a 67-59 lead into halftime, De’Aaron Fox, Domantas Sabonis and Harrison Barnes, three of the team’s top four scorers, didn’t play for the rest of the afternoon.\n\n\r\n              With the win, Denver ended a late-season skid in which it had lost five of six games entering Sunday. It ends the regular season with 53 wins, tied for the fifth most in the franchise’s NBA history, and a 34-7 home record, the second-best mark in the league.\n\n\r\n              “We needed to see what a win felt like,” Nuggets center DeAndre Jordan said. “It definitely meant something to us. The guys who were out there really wanted to play and compete and get a win.”\n\n\r\n              Sacramento made six of its first seven 3-pointers to jump out to a 24-10 lead and had a 43-26 advantage at the end of the first quarter. The Nuggets recovered, though, with a pair of DeAndre Jordan free throws with three minutes remaining in the third quarter giving them their first lead of the day. Their lead grew to as many as 18 in the fourth quarter.\n\n\r\n              “The plan was to play me in the first half and sit the second half,” Brown said. “I was like ‘Why?’ Let’s go win this thing.”\n\n\r\n              The Kings, who came into the game as the NBA’s highest-scoring team, shot just 35% in the final three quarters. Despite sitting for the final 24 minutes, Barnes finished with a team-high 17 points.\n\n\r\n              “You don’t know until you go through it with the group, but they put themselves in a pretty good position,” Kings coach Mike Brown said. “So now let’s see if we can continue our momentum going into the playoffs by stepping it up a notch higher than what we did during the regular season.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: G Davion Mitchell missed the game with left knee soreness. … Barnes appeared in his 82nd game this season, making him just one of 10 players across the league to appear in that many contests. … Sabonis and F Keegan Murray each had 14 points.\n\n\r\n              Nuggets: G Kentavious Caldwell-Pope (non-COVID illness) and F Jeff Green (facial contusion) also missed the game. … F Peyton Watson had a career-high 13 points while G Christian Braun had 10 points, giving him his third-straight double-figure scoring game, the first of his career.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Will face the western conference’s No. 6 seed in the playoffs.\n\n\r\n              Nuggets: Will play the second team to qualify for the playoffs via the play-in tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994670.16005
}