{
  "game_id": "0022200754",
  "espn_id": "401468909",
  "date": "Jan 29, 2023",
  "matchup": "LAC @ CLE",
  "headline": "Osman ties career high with 29 points, Cavs rout Clippers",
  "body": "CLEVELAND -- — Cedi Osman tied his career high with 29 points and matched the franchise record by making all seven of his 3-pointers as the Cleveland Cavaliers built a 40-point lead on their way to a 122-99 rout of the Los Angeles Clippers on Sunday night.\n\n\r\n              All-Star starter Donovan Mitchell had 11 points in his return for Cleveland after missing three games with a strained groin. The Cavaliers never trailed and took their largest lead of the season at 82-42 on Jarrett Allen’s first 3-pointer since Nov. 5, 2021.\n\n\r\n              “It was a great feeling, everybody was sharing the moment with me,” Osman said. “We played great offensively, and it was a great game for everybody. We’ve got such a good group of guys who support each other at all times.”\n\n\r\n              The Clippers, who had won five in a row, opted not to dress Kawhi Leonard, Paul George and Reggie Jackson, all of whom played Saturday in Atlanta. Officially, George and Leonard did not play because of right knee trouble and Jackson has a sore right Achilles.\n\n\r\n              Turkey national team member Osman made 11 of 13 shots on Turkish Heritage Night at Rocket Mortgage FieldHouse. He joined Kyrie Irving and Mo Williams as the only Cavaliers to go 7 of 7 beyond the arc in a game.\n\n\r\n              “That’s what Turkish Heritage Night will do for you,” Allen said, laughing. “Every single thing, except for his layups, went in. He did everything he was supposed to all night.”\n\n\r\n              Darius Garland collected 16 points and 10 assists, and Allen had 15 points and eight rebounds for Cleveland, which has the best home record in the East at 21-5.\n\n\r\n              The performance was in stark contrast to the Cavaliers’ 120-114 home loss to Golden State nine days earlier, when the Warriors sat Stephen Curry, Klay Thompson, Draymond Green and Andrew Wiggins.\n\n\r\n              “Tonight was a similar situation, but we took it serious,” Osman said. “We knew Golden State was missing a lot of pieces and learned a tough lesson from it.”\n\n\r\n              Brandon Boston Jr. scored 24 points and Moses Brown had 13 points and 16 rebounds for Los Angeles. Rookie Jason Preston from Ohio University had season highs of 12 points and eight assists.\n\n\r\n              The Clippers are 1-1 on a six-game road trip that ends Feb. 6 in Brooklyn. They missed 16 of their first 17 3-pointers and finished 2 of 19.\n\n\r\n              “I had a couple of friends and family here, so it was a good night, for sure,” Preston said. “The more I was out there, I kept getting a little more confident.”\n\n\r\n              WELCOME BACK\n\n\r\n              Clippers coach Tyronn Lue took the Cavaliers to three straight NBA Finals appearances, winning their lone championship in 2016. F Kevin Love and Osman are the only remaining players who played for Lue.\n\n\r\n              “When you lose LeBron (James) and Kyrie (Irving), usually it’s going to take a long time to get back,” said Lue, who went 128-83 in four seasons with the Cavaliers. “To be where they are now, they’ve done a great job putting together this team.\n\n\r\n              “It started with the trade for Jarrett Allen, which was out of this world, and getting Donovan Mitchell this year took them to the next level.”\n\n\r\n              TIP-INS\n\n\r\n              Clippers: G Terance Mann had the sole assist by a Los Angeles starter in the first half. … F Marcus Morris (bruised rib) missed his third consecutive game and F Robert Covington (personal reasons) sat out his second. G John Wall (abdominal soreness) last played on Jan. 13 against Denver. … Two-way C Brown was recalled from Ontario in the G League.\n\n\r\n              Cavaliers: Love (low back spasms) was inactive for the third straight game. The 34-year-old has missed six contests with the injury since the start of December. … Cleveland must win its next game to finish a winning record for the fourth consecutive month. It hasn’t started a season with four straight winning months since its 2015-2016 title campaign.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Visit Chicago on Tuesday night.\n\n\r\n              Cavaliers: Host Miami on Tuesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994966.58791
}