{
  "game_id": "401810040",
  "espn_id": "401810040",
  "date": "Nov 08, 2025",
  "matchup": "ATL vs LAL",
  "headline": "Banged-up Hawks roll to a 122-102 victory over the Lakers as Gueye scores a career-high 21 points",
  "body": "ATLANTA -- — Mouhamed Gueye scored a career-high 21 points, Dyson Daniels had 10 points, 13 assists and eight rebounds, and the banged-up Atlanta Hawks beat the Los Angeles Lakers 122-102 on Saturday night to even their record at 5-5.\n\n\r\n              The Hawks led by 30 points despite playing without three of their five starters. All-Star Trae Young is sidelined with an MCL sprain. Nickeil Alexander-Walker, Nikola Durisic, Jalen Johnson and Kristaps Porzingis (rest) were also inactive.\n\n\r\n              Yet Atlanta led 37-20 after one quarter behind 11 points from Gueye, who made his second start of the season and also had seven rebounds and seven assists. \n\n\r\n              The Hawks kept momentum rolling in the second quarter, extending the lead to 62-47. Los Angeles cut it to 10 before Atlanta bounced back with a pair of 3-pointers, ending the half with a 68-54 lead.\n\n\r\n              By the third quarter, the Hawks were up 26 points — the franchise's largest third-quarter lead against the Lakers since 1959. \n\n\r\n              Daniels notched his 10th assist of the night and solidified a double-double just over four minutes into the third quarter. He also had a steal in his 62nd consecutive game, establishing a club record. \n\n\r\n              Atlanta held Lakers star Luka Doncic, averaging 40 points this season, to 17 points. He also had 11 assists, five rebounds and was 4 for 6 from the free throw line. Doncic was done for the night halfway through the third quarter. \n\n\r\n              Zaccharie Risacher, Onyeka Okongwu, Keaton Wallace, Daniels and Gueye started for the Hawks.\n\n\r\n              LeBron James, Christian Koloko , Chris Manon, Austin Reaves and Gabe Vincent were out for the Lakers. The Lakers are on a five-game road trip and head to Charlotte next.\n\n\r\n              Up next:\r\n              Hawks: Play the Clippers on the road on Monday night.\n\n\r\n              Lakers: At Charlotte on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042584.645161
}