{
  "game_id": "0021800596",
  "espn_id": "401071272",
  "date": "Jan 07, 2019",
  "matchup": "LAL @ DAL",
  "headline": "Ingram, Ball lead Lakers to 107-97 win over Mavericks",
  "body": "DALLAS --  A challenge from their head coach gave Brandon Ingram and Lonzo Ball motivation. All they needed was an opening.\n\nThe cold-shooting Dallas Mavericks provided it.\n\nIngram scored 29 points and Ball added 21 as the Los Angeles Lakers handed the Mavericks a rare home loss, 107-97, on Monday night.\n\nAfter a blowout loss to Minnesota on Sunday, Lakers coach Luke Walton called for the two to bring more passion and fire. The duo responded, helping Los Angeles rally from a double-digit halftime deficit.\n\n\"I put so much responsibility on them because that's what I believe they're capable of doing,\" Walton said.\n\nBall and Ingram said they talked after the loss Sunday and agreed they needed to step up in the absence of LeBron James and veteran point guard Rajon Rondo.\n\n\"With the guys out, (we were) trying to take over and be the leaders of our team,\" Ingram said.\n\nThe Lakers won for just the second time in seven games since James strained his groin on Christmas Day, and they swept the season series from the Mavericks 3-0.\n\nDallas led 67-54 at halftime but had its worst-scoring half of the season with just 30 points after the break -- fewer than it scored in either of the first two quarters. The Mavs were 11-of-43 from the field in the second half and had 11 turnovers.\n\nLuka Doncic led the team with 27 points, and he had six of their 11 made field goals in the second half, including their only two 3-pointers.\n\n\"I think they played way better defensively in the second half,\" Doncic said. \"We didn't move the ball as well as we did in the first half. That was it.\"\n\nBall was held scoreless against Minnesota but responded with some clutch baskets in the second half. His fast-break dunk gave the Lakers their first lead of the game at 82-80 late in the third quarter. And he hit his only 3 of the second half with 4:23 to go to give LA a 100-89 lead.\n\n\"I just tried to be more aggressive,\" Ball said. \"I shoot when I'm open. I just tried to force the issue a little bit more.\"\n\nIngram scored 15 of his 29 in the second half and had six assists for the game. With Dallas cutting a 14-point Lakers lead to seven twice in the final minutes, each time Ingram drew the defense to him and dished to JaVale McGee for dunks.\n\nDallas fell for just the fourth time at home this season. The Mavericks entered the day tied for the fewest home losses in the NBA.\n\nTIP-INS\n\nLakers: Josh Hart scored 14 points, led the team with 12 rebounds and five steals and tied Ingram for a team-high six assists.\n\nMavericks: J.J. Barea played his 800th game, becoming the 11th undrafted player from a U.S. high school or college to play 800 games since the NBA-ABA merger in 1976. ... Numerous Dallas Cowboys, including running back Ezekiel Elliott and linebacker Jaylon Smith, attended the game, drawing an ovation from the sellout crowd.\n\nKUZMA RETURNS\n\nWith James still out, the Lakers got Kyle Kuzma back in the lineup after missing the past two games with a lower-back contusion. Kuzma missed his first eight shots and didn't score until midway through the second quarter, but he hit two 3s early in the third quarter to spark the Lakers' comeback. He finished with 13 points.\n\nOUT OF THE FLOW\n\nMavericks coach Rick Carlisle said a lack of ball movement has slowed the team in its losses this season, and on Monday, they had only 12 assists for a team that averages almost 23 a game.\n\nBarea could only laugh when told he led the team with three assists, saying, \"You can't win the game like that. Hopefully it won't happen again.\"\n\nUP NEXT\n\nLakers: Host Detroit on Wednesday.\n\nMavericks: Host Phoenix on Wednesday. Two of the Suns' nine wins this year have come against Dallas.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995007.536688
}