{
  "game_id": "0022400062",
  "espn_id": "401704628",
  "date": "Oct 22, 2024",
  "matchup": "LAL vs. MIN",
  "headline": "LeBron and Bronny James make NBA history by playing together in Lakers' 110-103 win over Minnesota",
  "body": "LOS ANGELES -- — LeBron James and Bronny James became the first father and son to play in the NBA together Tuesday night during the Los Angeles Lakers' 110-103 victory over the Minnesota Timberwolves.\n\n\r\n              The 39-year-old superstar and his 20-year-old son played almost 2 1/2 minutes together late in the first half of Bronny's NBA debut. They are also the first father and son to play in the NBA at the same time, let alone on the same team.\n\n\r\n              LeBron scored 16 points, while Anthony Davis had 36 points and 16 rebounds in a dominant performance for the Lakers. Rui Hachimura added 18 points.\n\n\r\n              JJ Redick won his head coaching debut for the Lakers, who hired the 15-year NBA veteran for his first coaching job at any level.\n\n\r\n              Anthony Edwards scored 27 points for the Timberwolves, who are coming off their best season in 20 years.\n\n\r\n              Julius Randle had 16 points and nine rebounds, and Donte DiVincenzo had 10 points in their Timberwolves debuts after the trade sending Karl-Anthony Towns to New York three weeks ago.\n\n\r\n              Dalton Knecht scored five points in the Lakers' first-round pick's debut.\n\n\r\n              Takeaways\r\n              Timberwolves: There will be growing pains in the post-Towns era. Davis ran rampant against Randle and Rudy Gobert, and nobody stepped up to score alongside Edwards.\n\n\r\n              Lakers: Their largely unchanged roster showed the benefits of continuity, playing disciplined ball on both ends and getting organized defense led by Davis.\n\n\r\n              Key moment\r\n              Davis was phenomenal down the stretch, either scoring or assisting on 13 of Los Angeles’ next 15 points after he returned to the game with 7:09 left. LeBron's 3-pointer put it away.\n\n\r\n              Key stat\r\n              LeBron officially joined Vince Carter as the only players in NBA history to play in 22 seasons. James is sixth in career games played with 1,493 — not counting his NBA-record 287 playoff games.\n\n\r\n              Up next\r\n              Timberwolves: At Sacramento on Thursday.\n\n\r\n              Lakers: Host Phoenix on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997223.239862
}