{
  "game_id": "0022400791",
  "espn_id": "401705357",
  "date": "Feb 20, 2025",
  "matchup": "BKN vs. CLE",
  "headline": "Donovan Mitchell scores 26 points as the Eastern Conference-leading Cavaliers beat the Nets 110-97",
  "body": "NEW YORK -- — Donovan Mitchell scored 26 points and three Cleveland teammates scored in double figures as the Cavaliers beat the Brooklyn Nets 110-97 on Thursday night.\n\n\r\n              Darius Garland scored 18 points, Evan Mobley added 18 points and 13 rebounds and Jarrett Allen finished with 16 points and 20 rebounds for Eastern Conference-leading Cleveland, which improved to 45-10.\n\n\r\n              Cam Johnson led Brooklyn with 18 points. Keon Johnson scored 16 points, Trendon Watford finished with 13 points off the bench and Ziaire Williams and Jalen Wilson each scored 10. \n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland coach Kenny Atkinson is looking to use the final 28 games of the regular season to prepare the Cavaliers for the playoffs. “You have to have a sense of urgency,” Atkinson said before the game. \n\n\r\n              Nets: Before the game, Brooklyn said it requested waivers on veteran forward Bojan Bogdanovic and, in corresponding roster moves signed Killian Hayes to a 10-day contract and agreed to what the team called “a multi-year contract” with Tyrese Martin. The Nets acquired Bogdanovic from the Knicks on July 6 in the trade that sent Mikal Bridges to New York. Due to a left foot injury, Bogdanovic did not play in any games with Brooklyn this season. \n\n\r\n              Key moment\r\n              Cleveland scored 11 straight points in a span of 1:41 late in the third quarter, turning a 69-63 deficit into a 74-69 lead. The Cavaliers never trailed after that point.\n\n\r\n              Key stat\r\n              The Cavaliers are 40-0 this season when leading after three quarters.\n\n\r\n              Up next\r\n              The Cavaliers host the Knicks on Friday night. The Nets travel to Philadelphia for a Saturday matinee against the 76ers. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997976.444285
}