{
  "game_id": "0021900570",
  "espn_id": "401161212",
  "date": "Jan 10, 2020",
  "matchup": "IND @ CHI",
  "headline": "Turner has 27 points, 14 boards as Pacers beat Bulls 116-105",
  "body": "CHICAGO --  Myles Turner dominated down low and the Pacers hit enough big shots to squeeze out the victory -- even though things got tight at the end.\n\nTurner set season highs with 27 points and 14 rebounds, and Indiana withstood a huge effort by Zach LaVine to beat the Chicago Bulls 116-105 on Friday night.\n\nThe Pacers overcame 43 points by LaVine and escaped with the victory after Chicago rallied from 16 down to cut the deficit to four in the closing minutes.\n\nAaron Holiday led a strong effort by the reserves with 19 points. T.J. Warren scored 17 after being fined $25,000 by the NBA for an altercation with Miami's Jimmy Butler on Wednesday night. Former Bulls player Doug McDermott finished with 16 points, and the Pacers won for the second time in three games even though Malcolm Brogdon (strep throat) and Domantas Sabonis (sore left knee) did not play.\n\n\"I thought we did a good job of `next man up' with Domas not playing tonight,\" coach Nate McMillan said. \"Myles was involved a lot more because of the absence of Domas. He was at the 5 position and he did a good job making plays. He took the shot when it was there. Really got us off to a good start and had an impact on this game at both ends of the floor.\"\n\nLaVine finished six points shy of his career high established at Charlotte in November. He scored 20 in a row for Chicago at one point.\n\nCoby White finished with 23 points, but the Bulls lost their sixth straight -- their worst skid since a 10-game slide in December and January last season.\n\n\"We've gotta find a way to dig one out,\" LaVine said. \"Obviously, it's frustrating. We've just got to find out how to scratch that win out.\"\n\nHANGING ON\n\nThe Pacers led by seven early in the fourth quarter when the Holiday brothers scored eight straight. Justin Holiday wrapped two 3-pointers around a basket by Aaron to make it 94-79 with 7:29 left.\n\nIt was 99-83 midway through the fourth before Chicago came storming back, cutting it to 103-99 on a 3 by Lauri Markkanen with just over three minutes remaining. Justin Holiday answered with a step-back 3, and the Pacers hung on from there.\n\nUNDER PRESSURE\n\nThe Pacers made 57.1% of their shots and committed 14 turnovers against a team that was forcing a league-high 18.2 per game.\n\n\"Especially late in the game, guys are confident, knocked down some big shots,\" Turner said. \"We faced a lot of adversity, with some guys being out. Guys stepped to the plate and made it happen.\"\n\nTIP-INS\n\nPacers: Indiana's reserves outscored Chicago's 58-31. ... Sabonis was inactive after McMillan said he would play. \"It was a miscommunication with the coaches. They knew I was going to give it a test before the game and it felt a little bit worse today,\" Sabonis said. JaKarr Sampson, starting in his place, had eight points and five rebounds. ... Brogdon missed his fifth straight game, this time because of strep throat after sitting out the previous four with a sore lower back. McMillan said Brogdon's back is fine, though he woke up ill Friday.\n\nBulls: LaVine has two games with 40 or more points this season and six in six NBA seasons. ... Rookie Daniel Gafford had two points and two rebounds in his first career start. The second-round pick from Arkansas is filling in at center with Wendell Carter Jr. expected to miss four to six weeks after spraining his right ankle in the loss at Dallas on Monday.\n\nUP NEXT\n\nPacers: host Philadelphia on Monday.\n\nBulls: visit Detroit on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995853.255235
}