{
  "game_id": "0022200745",
  "espn_id": "401468900",
  "date": "Jan 28, 2023",
  "matchup": "ATL vs. LAC",
  "headline": "Leonard scores 32, Clippers beat Hawks for 5th straight win",
  "body": "ATLANTA -- — Kawhi Leonard scored 32 points, including a season-high five 3-pointers, Paul George added 23 points and the Los Angeles Clippers won their fifth straight game, a 120-113 victory over the Atlanta Hawks on Saturday night.\n\n\r\n              “We limited them to 25% from 3 tonight, under 50% from the field, I think that’s big-time for us right now on defense,\" Leonard said. “That was one of the things that got us in a slump. We shot the ball well tonight.\"\n\n\r\n              Trae Young had 12 of his 31 points in the fourth quarter for the Hawks, who whittled a 14-point deficit down to four on De’Andre Hunter’s left corner 3 with 2:09 remaining. But they couldn’t get any closer after George buried a baseline jumper and Nicolas Batum hit a right corner 3 with 49.3 seconds to go.\n\n\r\n              George knocked down two free throws at the 17.6-second mark to put the game out of reach. \n\n\r\n              “I think we’re just taking the steps to grow as a team,\" George said. “We’re sharing the ball. We’re playing the right way. We’re playing for one another, and I think our defense has been impactful. It’s starting to affect games. \n\n\r\n              \"I think when we went through a stretch where we weren’t playing well, we were giving up a lot of points. I think we’re starting to cut that down.\"\n\n\r\n              The Hawks dropped to 8-6 in January, including 6-3 in their last nine outings.\n\n\r\n              The Clippers used an 8-1 run early in the fourth to build an 11-point lead on Reggie Jackson’s layup. Atlanta called timeout, but it made no difference as Los Angeles went up by 12 on Norman Powell’s left corner 3 with 9:13 remaining. A pair of free throws by Ivica Zubac and Zubac’s putback dunk made it a game-high 14-point lead at the 5:22 mark.\n\n\r\n              “You’ve got two guys out there that are all-NBA type players,\" Young said. “It’s easier said on how to stop those guys than just doing it. They played really good tonight. Kawhi did a really good job of scoring when he needed to and P.G. got everybody involved when he was getting in traps and stuff, but he was scoring early.\n\n\r\n              “Those guys played really well. You’ve got to give them credit.\"\n\n\r\n              The Hawks pulled within one midway through the third, but the lead swelled to 71-66 on a pair of 3s by Luke Kennard. Leonard followed with two 3s that made it 76-68, and Los Angeles entered the fourth leading 84-81. \n\n\r\n              “I was able to get some open looks and if it’s open, I’m going to shoot the ball,\" Leonard said. “It felt good.\" \n\n\r\n              Atlanta took the game’s first double-digit lead at 41-30 on Dejounte Murray’s 10-footer, but the Clippers went on a 26-8 run to go up 56-49 on Zubac’s dunk late in the second. They didn’t trail again for the rest of the game and led 58-53 at halftime.\n\n\r\n              “I think we limited them to one shot attempt and got the rebound, came back on the offensive end with pace and made shots,\" Leonard said. “We were able to control the game from there.\"\n\n\r\n              TIP-INS\n\n\r\n              Clippers: F Marcus Morris Sr. was held out with a rib contusion. ... F Robert Covington was not available due to personal reasons. ... Los Angeles has scored over 100 points in 12 straight games. ... The Clippers improved to 20-6 when leading after three. ... They shot 48.7% on 39 attempts on 3s.\n\n\r\n              Hawks: Outscored Los Angeles 62-32 on points in the paint. ... Young went without a 3 for the third time in the last four games, and Atlanta dropped to 1-5 when he fails to connect beyond the arc. He was 0 for 2. ... All five of the starters scored in double figures. ... Young had 10 assists. ... Clint Capela had 12 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Cleveland on Sunday.\n\n\r\n              Hawks: At Portland on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994825.563338
}