{
  "game_id": "0022200674",
  "espn_id": "401468829",
  "date": "Jan 18, 2023",
  "matchup": "IND @ OKC",
  "headline": "Thunder beat Pacers 126-106 for 4th straight victory",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander and Isaiah Joe each scored 23 points and the Oklahoma City Thunder rolled past the Indiana Pacers 126-106 on Wednesday night for their fourth straight victory.\n\n\r\n              Lu Dort had 22 points and a career-high 11 rebounds and Kenrich Williams added 12 points and a career-best 10 assists for the Thunder. Oklahoma City shot 50.5% from the field and made 16 of 38 3-pointers.\n\n\r\n              The Thunder are 7-2 in 2023. All seven wins are by double digits, including a 150-117 victory over Boston on Jan. 3.\n\n\r\n              “I think the team is growing in confidence, and the confidence is kind of a collective confidence,\" Thunder coach Mark Daigneault said. \"It’s not like an individual player just playing on a ridiculous streak or anything like that. The group is gaining confidence together, and we want to be a team that the whole is better than the sum of the parts.”\n\n\r\n              The team set a Thunder record with 41 assists on 47 baskets against Indiana's zone defense. Joe, a reserve who tied a career high with seven 3-pointers in just 22 minutes, said the commitment to passing is making the offense work.\n\n\r\n              “The ball has energy,” Joe said. “Whenever we move the ball like that, we get really good looks and we tend to make more shots. It’s a fun way to play.”\n\n\r\n              Andrew Nembhard scored 18 points for the Pacers, who lost their fifth straight. Buddy Hield, who entered the night averaging 18 points per contest, scored just three points on 1-for-4 shooting in 19 minutes. Indiana shot 41.5% from the floor.\n\n\r\n              The Pacers were without guard Tyrese Haliburton. The NBA's assist leader suffered sprains to his left knee and elbow last week and is expected to be out for at least another week.\n\n\r\n              Without him, Oklahoma City raced out to a 17-1 lead. Pacers coach Rick Carlisle said that was too much too early.\n\n\r\n              “We allowed them to do too many things they wanted to do in the first five minutes, and you get down 19-1 or whatever it was, playing out of that kind of hole on the road is almost impossible,\" he said.\n\n\r\n              Daigneault was worried about how much energy Oklahoma City would have in their first home game after a three-game rip. The Thunder handled it fine and led 58-44 at halftime, behind 17 points from Dort.\n\n\r\n              “I thought the first half was just super sharp stuff,” Daigneault said. “You can’t underestimate the power of getting off to a good start and particularly coming off the road, coming to a home game. Those are tough games.”\n\n\r\n              Oklahoma City shot 68% in the period to lead 100-73 heading into the fourth.\n\n\r\n              “The beginning of the game was ugly,\" Carlisle said. \"And most of the rest of it was ugly other than the fourth quarter.”\n\n\r\n              QUOTABLE\n\n\r\n              Daigneault on Joe's 3-point shooting: “He’s got a very mature floor game for game for a guy that shoots it like that. He really doesn’t take a lot of bad ones.”\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Hield played college basketball at the nearby University of Oklahoma and was cheered when he was announced as a starter. ... Went nearly four minutes without a made field goal at the start of the game. ... Indiana's bench was issued a technical foul in the second quarter. ... C Myles Turner had six blocks.\n\n\r\n              Thunder: Had 11 assists on 12 baskets in the first quarter. ... Shot 60% in the first quarter to take a 36-20 lead. ... G Josh Giddey fouled out with 16 points, 11 assists and six rebounds in 29 minutes. \n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Denver on Friday night.\n\n\r\n              Thunder: At Sacramento on Friday night.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994325.325818
}