{
  "game_id": "0021600528",
  "espn_id": "400899453",
  "date": "Jan 03, 2017",
  "matchup": "LAL vs. MEM",
  "headline": "Lakers hit 17 3s to beat Grizzlies; Randle has triple-double",
  "body": "LOS ANGELES --  With a dizzying flurry of long-range shots, the Los Angeles Lakers made Memphis look lost on defense.\n\nNick Young scored 20 points, D'Angelo Russell added 18 and both keyed an early barrage of 3-pointers that sent the Lakers past the Grizzlies 116-102 on Tuesday night.\n\nThe Lakers made a season-high 17 3-pointers, all but one coming in the first three quarters. They finished 17 of 33 from beyond the arc despite missing nine consecutive attempts in the final period. Young and Russell each connected on six 3s, and five Lakers hit at least one.\n\n\"When shooters get hot, a good offense is going to beat a good defense,\" Los Angeles coach Luke Walton said.\n\nAll that outside shooting opened things up inside for forward Julius Randle, who finished with a triple-double: 19 points, 14 rebounds and 11 assists.\n\nThe Lakers had 34 assists, outrebounded the Grizzlies 43-39 and held them to 39 percent shooting while winning for only the third time in 18 games.\n\n\"We had our L.A. cool jacket on tonight,\" Memphis coach David Fizdale said. \"I don't know who we were performing for, but it wasn't for each other.\n\n\"We show signs of greatness and then we are just zombies out there. Tonight was one of those nights.\"\n\nMarc Gasol led the Grizzlies with 22 points, seven assists and six rebounds. Mike Conley had 21 points.\n\nFor Randle, it was his third career triple-double. The 11 assists were a career best.\n\nWalton said he got on Randle at practice Monday about his inconsistency and later called him at home to see if he was still mad at him.\n\n\"I think he can be great and I'm going to continue to hold him to high standards,\" Walton said. \"He obviously responded pretty well and gave us a nice effort.\"\n\nThe Grizzlies have one of the NBA's top defenses. They are tied with Utah for allowing the lowest field goal percentage in the league, and are second to the Jazz in points allowed (97.6 per game).\n\n\"We didn't play with great effort, not to mention detail,\" Fizdale said. \"We looked silly out there guarding basic NBA sets. Stuff we run at each other every day, we couldn't even guard. For whatever reason, we just weren't there tonight.\"\n\nTIP-INS\n\nGrizzlies: After making only 12 3-pointers (on 66 attempts) during his first eight years in the league, Gasol has 49 (on 120 attempts) in his first 35 games. ... The Grizzlies have played more games decided by five or fewer points than any team in the league, going 10-2. ... The Grizzlies went 11-6 last month, the best December in team history. Their previous best was nine wins in 2009.\n\nLakers: Young is on a 3-point tear. He has hit 42 in his last nine games, shooting 56 percent (42 of 75). ... No Lakers player is averaging more than 29 minutes per game, while nine are averaging 20-plus minutes. ... The Lakers' bench leads the NBA in scoring (49.2 points per game).\n\nTAKING A TOLL\n\nThe Lakers had lost 15 of 17, a tough grind for a young team that won only 17 games last season and 21 the previous season.\n\n\"I think you have guys who want to get better and are tired of losing,\" Walton said. \"It's been a rough couple of years.\"\n\nGRIZZLIES IMPRESSED\n\nThe Lakers are trying to get Randle to remain focused and not fall victim to what Russell called one of his mood swings. The effort worked Tuesday.\n\n\"He really dictated the pace tonight,\" Conley said. \"He made us have to get into a lot of rotations and mismatches because of his ability to get out in transition and bring the ball up the court.\"\n\nUP NEXT\n\nGrizzlies: They stay in Los Angeles and return to Staples Center on Wednesday night to play the Clippers, who snapped a six-game losing streak Monday with a 109-98 home win over the Suns.\n\nLakers: Have a one-game road trip Thursday at Portland. In their 38th game of the season, they play the Trail Blazers for the first of four times. Portland has won the last eight meetings.",
  "source": "espn_api",
  "crawled_at": 1764995409.6420102
}