{
  "game_id": "0022000356",
  "espn_id": "401267516",
  "date": "Feb 06, 2021",
  "matchup": "TOR @ ATL",
  "headline": "Young, Capela pace Hawks in 132-121 win over Raptors",
  "body": "ATLANTA -- — Trae Young had 28 points and 13 assists, Clint Capela finished with 23 points and 16 rebounds, and the Atlanta Hawks held off the Toronto Raptors 132-121 to snap a three-game losing streak Saturday night. \n\n\r\n                    Chris Boucher scored 29 points off the bench to lead the Raptors, who were going for a season-high four-game winning streak. Fred VanVleet added 22 points and Kyle Lowry had 20 for Toronto.\n\n\r\n                    Snapping a 10-game losing streak in the series, Atlanta closed out the game late in the fourth quarter as Young fed Capela for an alley-oop dunk and Kevin Huerter hit a 3-pointer to push the lead to 10 with 53.4 seconds remaining.\n\n\r\n                    “We were able to get going on the fast break,\" Capela said. “Our play was pretty efficient tonight. I also feel like we shot the ball pretty well, so that helps.\"\n\n\r\n                    Hawks coach Lloyd Pierce called the performance Atlanta's best of the season.\n\n\r\n                    “I think it was such a great game for us because the spirit was great,\" Pierce said. “Thirty-one assists is how you get great spirit. Ball movement, empowerment, guys feeling like they're part of every play. We made simple plays throughout the night.\"\n\n\r\n                    Capela scored his 15th point on a left-handed jumper that gave the Hawks their first double-digit lead at the 10:23 mark of the third quarter. Three straight Atlanta turnovers contributed to the Raptors closing within two, and the Hawks called a timeout less than two minutes later. \n\n\r\n                    John Collins responded with a baseline jumper, Young with a runner and Danilo Gallinari with a 3 to make it 80-71. Huerter followed with a pair of free throws to put Atlanta up 84-73.\n\n\r\n                    The biggest lead Toronto had in the second was eight on Terence Davis’ 3 at the 10:22 mark. The Hawks soon went up 47-46 on Huerter’s 3 and led by five on three possessions before entering halftime with a three-point lead.\n\n\r\n                    “I think we probably had enough points to win tonight, scoring-wise,\" Raptors coach Nick Nurse said after his team dropped to 0-3 on the second night of a back-to-back. “I would like to think if we score 121, we can win a game, but we just didn’t have the juice to guard them tonight. They shot their way to a W.\"\n\n\r\n                    Young returned to full capacity after missing Thursday’s loss to Utah with a bruised right calf. Capela, the NBA’s leading rebounder, has pulled down at least 10 boards in 18 straight games, the longest active streak in the NBA.\n\n\r\n                    Toronto had dominated the Hawks even in Atlanta, winning the last six meetings.\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: F OG Anunoby missed his sixth straight game with a left calf strain, but Nurse said Anunoby is getting close to returning. “I think it is a little touchy with it, but they’re shooting for maybe the last part of this road trip,” Nurse said. “So I think there is a light at the end of the tunnel here, and we’re hopeful to get him out on this trip.” Toronto has three games left on the six-game trip.\n\n\r\n                    Hawks: Capela had four of the team's 10 blocked shots. ... Pierce said two of the team’s three injured players are progressing. F Bogdan Bogdanovic (right knee avulsion fracture) and Kris Dunn (right ankle surgery) have improved, but Pierce couldn’t give a prognosis on starting F De’Andre Hunter (right knee discomfort). “K.D. told me he feels great and is going to do some straight-line running, I think it was,” Pierce said. “Bogie I see shooting and not with a brace, and I just saw D-Hunt at the walkthrough for the first time since the other day. He’s out and hasn’t done anything on the court.”\n\n\r\n                    SHARP SHOOTERS\n\n\r\n                    The Hawks finished with season highs in field goal percentage (56.8) and 3-point percentage (52.8).\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Visit the Memphis Grizzlies on Monday.\n\n\r\n                    Hawks: Off until Wednesday when they visit Dallas.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996872.6772292
}