{
  "game_id": "0021600684",
  "espn_id": "400900105",
  "date": "Jan 25, 2017",
  "matchup": "MIL vs. PHI",
  "headline": "Without Embiid again, 76ers hold off Bucks 114-109",
  "body": "MILWAUKEE -- The Philadelphia 76ers showed plenty of resiliency playing without leading scorer Joel Embiid for the second consecutive night.\nAfter scoring a season-high 72 points in the first half, the 76ers had just 16 in the third quarter and watched a fourth-quarter lead evaporate before gaining control in the waning moments to defeat the Milwaukee Bucks 114-109 on Wednesday night.\n\"They were up early, they came back late in the game but we still found ways to get efficient shots and it worked out for us,\" said Nerlens Noel, who hit a late jumper to help seal the win.\nThe 76ers won for the fifth time in six games and have won back-to-back games without Embiid, who continues to recover after bruising his knee on Friday.\n\"We want to better execute some of the things we have drawn up, but in general, their perseverance in finding a way to get a win was outstanding,\" Philadelphia coach Brett Brown said.\nGerald Henderson led the 76ers with 20 points, Ersan Ilyasova and Dario Saric added 17 apiece.\n\"We had confidence down the stretch. It just comes with experience, good and bad,\" Henderson said.\nGreg Monroe's season-high 28 points led the Bucks. Jabari Parker added 20 and Giannis Antetokounmpo had 17 points and 12 rebounds.\nTrailing by 14 at the half, the Bucks cut into the 76ers' lead and trailed 88-82 heading to the fourth.\nA 3-pointer by Matthew Dellavedova gave Milwaukee a 97-96 lead with just less than six minutes left. A frenetic series of lead changes and ties then ensued over the next five minutes.\nWith the Bucks leading by three, Parker stole a cross-court pass but was called for a foul after inadvertently hitting Robert Covington in the face as he accelerated up the court. Covington made both free throws.\nAfter a backcourt violation, Noel drew a foul and converted two free throws to give Philadelphia the lead. Noel then hit a jumper and Ilyasova made two free throws to put the game out of reach.\n\"We just didn't execute having the lead,\" Bucks coach Jason Kidd said.\nKey turnovers hurt the Bucks late, including an errant in-bounds pass by Monroe that sailed over Antetokounmpo's head.\n\"That's definitely a game we should have won,\" Monroe said. \"We would have had a different outcome if I would have made that pass.\"\nPhiladelphia outscored Milwaukee by 20 in the second quarter to take a 72-58 lead at the half.\nROOKIE REWARD\nMilwaukee guard Malcolm Brogdon is the only second-round draft pick named to play in the Rising Stars Challenge during All-Star weekend.\n\"He's a very talented man on and off the floor,\" Kidd said. \"He's playing at a very high level and it's well deserved. I think he'll be considered for Rookie of the Year if he continues to play the way he's playing.\"\nBrown felt second-year player T.J. McConnell, the 76ers point guard, should have been selected, as well.\n\"We are 9-2 with him as a starter,\" he said. \"T.J. McConnell should be in that game.\"\nANTETOKOUNMPO ACCOLADES\nBrown said Antetokounmpo's level of play continues to develop.\n\"His balance as to how he uses his physical gifts is starting to be better realized,\" Brown said. \"There was always this sort of reckless abandon that he attacked the game with. I think that it's becoming more polished, more sophisticated.\"\nTIP-INS\n76ers: Embiid (left knee contusion) and Jahlil Okafor (right knee soreness) didn't make the trip. ... Richuan Holmes appeared to injure his right elbow after a hard fall in the second quarter. He left a short time later and received treatment on the bench from a trainer.\nBucks: Miles Plumlee made his second straight start at center. He was inserted into the starting lineup for Monday's game against Houston, replacing John Henson, who had started 34 consecutive games. Henson didn't see action.\nUP NEXT\n76ers: Host Houston on Friday. The teams last met on Nov. 14, with the Rockets coming away with a 115-88 win. Embiid and Ilyasova led Philadelphia with 13 points apiece.\nBucks: Play at Toronto on Friday. The Raptors have won 12 of their last 13 against the Bucks, including six straight. Antetokounmpo is averaging 29.5 points, 8.0 assists and 7.5 rebounds in two games against Toronto this season.",
  "source": "espn_api",
  "crawled_at": 1764995178.012398
}