{
  "game_id": "401810215",
  "espn_id": "401810215",
  "date": "Dec 07, 2025",
  "matchup": "MEM vs POR",
  "headline": "Aldama, Grizzlies to host Avdija and the Trail Blazers",
  "body": "Portland Trail Blazers (9-14, 10th in the Western Conference) vs. Memphis Grizzlies (10-13, ninth in the Western Conference)\n\n\r\n              Memphis, Tennessee; Sunday, 6 p.m. EST\n\n\r\n              BOTTOM LINE: Santi Aldama and the Memphis Grizzlies host Deni Avdija and the Portland Trail Blazers.\n\n\r\n              The Grizzlies are 9-7 in conference play. Memphis has a 3-9 record in games decided by 10 or more points.\n\n\r\n              The Trail Blazers are 7-9 in Western Conference play. Portland allows 120.7 points to opponents while being outscored by 2.4 points per game.\n\n\r\n              The Grizzlies' 12.9 made 3-pointers per game this season are only 0.3 more made shots on average than the 12.6 per game the Trail Blazers allow. The Trail Blazers average 13.7 made 3-pointers per game this season, 0.8 fewer makes per game than the Grizzlies give up.\n\n\r\n              TOP PERFORMERS: Aldama is scoring 12.7 points per game with 6.4 rebounds and 3.1 assists for the Grizzlies. Cedric Coward is averaging 23.0 points and 14.0 rebounds while shooting 55.6% over the last 10 games.\n\n\r\n              Avdija is averaging 26.2 points, 7.2 rebounds and 6.2 assists for the Trail Blazers. Jerami Grant is averaging 4.0 made 3-pointers over the last 10 games.\n\n\r\n              LAST 10 GAMES: Grizzlies: 6-4, averaging 114.1 points, 50.1 rebounds, 29.8 assists, 6.8 steals and 5.2 blocks per game while shooting 46.7% from the field. Their opponents have averaged 110.2 points per game.\n\n\r\n              Trail Blazers: 3-7, averaging 114.1 points, 49.0 rebounds, 23.9 assists, 6.9 steals and 6.1 blocks per game while shooting 43.0% from the field. Their opponents have averaged 118.8 points.\n\n\r\n              INJURIES: Grizzlies: Scotty Pippen Jr.: out (toe), Javon Small: out (toe), Ja Morant: day to day (calf), Brandon Clarke: out (knee), Ty Jerome: out (calf).\n\n\r\n              Trail Blazers: Scoot Henderson: out (hamstring), Matisse Thybulle: out (thumb), Jrue Holiday: out (calf), Blake Wesley: out (foot), Donovan Clingan: day to day (leg), Damian Lillard: out for season (achilles).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042772.1225579
}