{
  "game_id": "0022300109",
  "espn_id": "401584737",
  "date": "Oct 30, 2023",
  "matchup": "DET @ OKC",
  "headline": "Shai Gilgeous-Alexander scores 32 as Thunder top Pistons 124-112",
  "body": "OKLAHOMA CITY -- — Thunder coach Mark Daigneault got the response he was hoping for.\n\n\r\n              Daigneault wondered before Monday night's game against the Detroit Pistons what his players' approach would be a day after Oklahoma City was blown out by Denver.\n\n\r\n              They were up to the task. Shai Gilgeous-Alexander scored 32 points to help the Thunder beat the Pistons 124-112.\n\n\r\n              “Obviously, we did a really good job of getting to zero and zero,\" Daigneault said. \"And that is a critical skill in the NBA that scales and applies to every game. You know, whether you’re coming off a good game, winning streak, bad game, losing streak, you've got to wake up zero and zero. I thought the guys did a great job of that today with very little nudge on our part. I thought they got themselves there.” \n\n\r\n              Gilgeous-Alexander, a first-team All-NBA selection last season, made 11 of 23 field goals and had nine rebounds. He bounced back after scoring seven points on 2-for-16 shooting in Sunday's 128-95 loss to the Nuggets.\n\n\r\n              “Not surprised,” Daigneault said. “I mean, he’s as steady as they come. If there’s one thing that we’ve learned from him over the last few years, it’s that his ability to stay consistent through the ups and downs of a season is very impressive.”\n\n\r\n              Gilgeous-Alexander didn't have it easy — rookie Ausar Thompson embraced the opportunity to guard one of the league's elite scorers.\n\n\r\n              “He’s an impressive competitor,” Daigneault said of Thompson. “Great athlete, tough. The best defenders in the NBA have a mindset. They’re not shutting anybody out, but they’re making the other team earn it. And I thought he made Shai earn it tonight.” \n\n\r\n              Josh Giddey scored 17 of his 21 points in the second half and Jalen Williams added 19 points for Oklahoma City (3-1), which won at home for the first time this season.\n\n\r\n              “They were physical all night long,” Detroit coach Monty Williams said. “They had a tough, tough loss last night. We knew they were going to come in like a wounded animal. And they played with a lot more physicality and fight than we did for long stretches.”\n\n\r\n              Oklahoma City shot 53% from the field.\n\n\r\n              “We have to stick to our identity, which is defending, is playing with great effort and having great discipline,” Williams said. “And tonight was one of the first times I didn’t see the discipline at a great, great level. It was inconsistent.”\n\n\r\n              Jaden Ivey scored 20 points off the bench for Detroit. Cade Cunningham scored 17 points on 5-for-15 shooting, and Thompson had 15 points and 10 rebounds for the Pistons. \n\n\r\n              Oklahoma City's Chet Holmgren made all three of his 3-point attempts in the first quarter to help the Thunder take a 33-21 lead. Oklahoma City led 59-47 at halftime behind Gilgeous-Alexander's 18 points, six rebounds and four assists. The Thunder held Detroit to 35.4% shooting before the break.\n\n\r\n              Gilgeous-Alexander scored 10 points in the third quarter, including a two-handed dunk over Ivey and Joe Harris in the final minute of the period. Oklahoma City led 91-79 entering the fourth.\n\n\r\n              The Thunder opened the final period with an 8-3 run that included 3-pointers by Ousmane Dieng and Williams. The largest lead for the Thunder was 21 points.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Portland on Wednesday.\n\n\r\n              Thunder: Host New Orleans on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995800.666399
}