{
  "game_id": "0022200734",
  "espn_id": "401468889",
  "date": "Jan 26, 2023",
  "matchup": "PHX vs. DAL",
  "headline": "Dinwiddie scores 36, Mavs top Suns 99-95 after Doncic hurt",
  "body": "PHOENIX -- — Luka Doncic's early injury on Thursday night gave the Dallas Mavericks a very valid reason to lose on the road.\n\n\r\n              Instead, Spencer Dinwiddie responded to the adversity with a season-high 36 points, Dorian Finney-Smith added 18 points and 12 rebounds, and the Mavs held on for a 99-95 victory over the Phoenix Suns.\n\n\r\n              “It's just an all-around great team effort,” Finney-Smith said. “Once we found out (Luka) was out, we just stepped up.”\n\n\r\n              Dinwiddie's hot shooting helped the Mavs thrive without Doncic, who limped to the locker room early in the first quarter with a sprained left ankle and didn't return. The veteran guard shot 10 of 18 from the field, including 5 of 6 on 3-pointers. He also made 11 free throws.\n\n\r\n              The 29-year-old didn't shy from taking the lead scoring role after Doncic went down. It was the first game the Mavs won this season when Doncic was injured.\n\n\r\n              “It's just a shift in mindset in understanding the volume's going to come and I've got to be more aggressive,” Dinwiddie said.\n\n\r\n              The Mavs led the entire second half but Suns guard Chris Paul made a layup with 19.7 seconds left to cut the deficit to 96-95. The Mavs were able to close it out when Dwight Powell got fouled after grabbing an offensive rebound and sank his two free throws.\n\n\r\n              “It was the whole group defensively,” Mavs coach Jason Kidd said. “To hold a team like Phoenix under 100 points is a big deal. The guys in that locker room should be proud.”\n\n\r\n              Dinwiddie made tough shots all night, including a long 3-pointer with a few seconds left in the third quarter to give the Mavs a 76-69 lead going into the fourth. He banked in another 3 with 3:32 left that put them up 95-86.\n\n\r\n              Cam Johnson and Paul led the Suns with 22 points apiece. Deandre Ayton scored 19 points and grabbed 20 rebounds, but made just 6 of 20 shots. Paul added 10 assists.\n\n\r\n              “I thought we were a bit happy on the farm to be honest with you,” Suns coach Monty Williams said. “We did not bring the same juice, energy and focus we had been bringing.”\n\n\r\n              The Mavs pushed to a 54-48 halftime lead. Dinwiddie led all scorers with 20 points before the break while Johnson had 13 for the Suns.\n\n\r\n              The Mavericks snapped a six-game losing streak against the Suns in the regular season, though they beat Phoenix in the Western Conference semifinals in seven games in last year's playoffs.\n\n\r\n              Phoenix had its four-game winning streak snapped.\n\n\r\n              “Tonight was a battle even though Luka went out,” Ayton said. “I hope he is OK, but those dudes put up a fight man. We were supposed to take advantage of this.”\n\n\r\n              DONCIC HURT\n\n\r\n              Doncic played just three minutes before limping to the locker room during a timeout. The 23-year-old, who was voted an All-Star for the fourth straight season earlier Thursday, came into the game averaging 33.8 points, 9.1 rebounds and 8.6 assists.\n\n\r\n              He was trying to make a move close to the basket against Johnson, but stepped on Mikal Bridges’ foot before passing the ball and limping away. Kidd called for a timeout and the 6-foot-7 guard slowly made his way to the locker room.\n\n\r\n              Kidd said Doncic was in “good spirits” after the game.\n\n\r\n              “He looked good, he looked fine,” Kidd said. “But we'll see how he feels as we go forward.”\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: F Maxi Kleber (hamstring) and F Christian Wood (thumb) were out.\n\n\r\n              Suns: Guards Devin Booker (groin), Cameron Payne (foot) and Landry Shamet (foot) were out. ... Hosted their 52nd straight sellout. ... Williams used 13 players.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Travel to Utah on Saturday.\n\n\r\n              Suns: Travel to San Antonio on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995076.925591
}