{
  "game_id": "0021600064",
  "espn_id": "400899514",
  "date": "Nov 02, 2016",
  "matchup": "OKC @ LAC",
  "headline": "Westbrook gets 35, leads unbeaten Thunder past Clips 85-83",
  "body": "LOS ANGELES -- Russell Westbrook and the Oklahoma City Thunder could have been excused for looking ahead to a momentous visit to Golden State and a reunion with Kevin Durant looming Thursday night.\nInstead, Westbrook added another gutsy performance to his incredible start to his first season as the main man.\nWestbrook hit a jumper with 18.7 seconds left to finish with 35 points, and the Thunder remained unbeaten with an 85-83 victory over the Los Angeles Clippers on Wednesday night.\nWestbrook added six rebounds and five assists for the Thunder, who surged in the final minutes of a tight meeting between Western Conference contenders. Although he wasn't near a triple-double for the first time this season, the ferocious point guard carried the Thunder down the stretch, scoring their final six points and making a key hustle play in the last minute.\n\"That's the only way I know how to get it,\" Westbrook said. \"Nothing was ever given to me growing up, and I always had to find ways to get it. ... I play every game like it's my last. I play every game the same, always, like I've been saying for years. Regardless of who we play, I'm going to play the same way.\"\nWestbrook had triple-doubles in the Thunder's last two games, and was one assist shy of another in their opener. He mostly concentrated on scoring in his hometown, delivering a spectacular dunk in the third quarter while going 14 for 30 in 31 minutes.\n\"He's been great,\" Oklahoma City coach Billy Donovan said. \"Just being around him and seeing his commitment to his teammates, his leadership and his competitive fire rubbing off on his teammates, it's been great to watch. What he's doing statistically is amazing, but as a coach, I've been impressed with his leadership.\"\nChris Paul had 15 points, 11 rebounds and nine assists for the Clippers, who hit just one shot in a 5 1/2-minute span late in the fourth quarter. Blake Griffin scored 10 of his 14 points in the third quarter, but none in the fourth.\n\"The most frustrating part for me (is) the turnovers especially,\" said Paul, who made three of his five turnovers in the fourth quarter. \"My job is to orchestrate the offense, and I had some terrible turnovers down the stretch.\"\nTIP-INS\nThunder: Alex Abrines only played the final 12.3 seconds of the first half, but he hit a 3-pointer with 1.6 seconds left to stake OKC to a 49-41 lead. ... Victor Oladipo's nine points were the second-most by an Oklahoma City player.\nClippers: LA's early-season struggles from the 3-point line continued in the first half when the Clippers went 3 for 14, including 1 for 7 by the starters. ... Marreese Speights had 14 points.\nBIG FINISH\nWestbrook's layup put the Thunder up 81-78 with 2:17 left, and he converted Jamal Crawford's turnover into a dunk 66 seconds later. J.J. Redick hit a 3-pointer to trim Oklahoma City's lead to two points, but Westbrook hit a 17-footer to essentially seal it.\nRUSS BALL\nWestbrook averaged 38.7 points, 12.3 rebounds and 11.7 assists in a spectacular three-game start to the Thunder's post-Durant season. He became the first player since Magic Johnson in 1982 to start a season with triple-doubles in two of the first three games\nWestbrook's numbers were down against the Clippers in a defense-minded game featuring poor shooting by both sides. He had 16 points, four assists and two rebounds in the first half.\nNEW GUY\nJerami Grant made his Thunder debut one day after they acquired him from Philadelphia in a trade for Ersan Ilyasova and a protected draft pick. The third-year forward from Syracuse came off the bench in the second quarter and eventually finished with six points in 18 minutes.\nUP NEXT\nThunder: At Golden State on Thursday to complete a two-game California road trip.\nClippers: A two-game road trip begins in Memphis on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995341.136723
}