{
  "game_id": "0021801230",
  "espn_id": "401071903",
  "date": "Apr 10, 2019",
  "matchup": "SAC @ POR",
  "headline": "Blazers lock up No. 3 seed with 136-131 win over Kings",
  "body": "PORTLAND, Ore. --  It was a heck of a first start for rookie Anfernee Simons.\n\nSimons scored a career-high 37 points and the Portland Trail Blazers locked up the No. 3 seed in the Western Conference with a dramatic 136-131 victory over the Sacramento Kings using just six players on Wednesday night.\n\nSimons, who had seven 3-pointers, played all 48 minutes as the Blazers rested their starters for the regular season finale.\n\n\"To have all the young guys come in and secure the third seed, it felt good,\" he said. \"All of us felt good about that.\"\n\nThe Blazers have won 14 of 17 games en route to their sixth straight trip to the playoffs. Portland will open the postseason Sunday against the Oklahoma City Thunder, who finished in sixth.\n\nPortland had already clinched homecourt advantage in the opening round with a 104-101 victory over the Los Angeles Lakers the night before.\n\nDenver beat the Timberwolves 99-95 Wednesday night, locking the Nuggets into the No. 2 seed and a first-round series against San Antonio, and giving Portland the opening to claim the third seed. The Jazz wound up as a No.  5 seed and will play fourth-seeded Houston. The West's top finisher, Golden State, will face the No. 8 Clippers.\n\nPortland trailed by 28 points but made it interesting in the fourth quarter by closing within 117-116 with 7:53 left on Simon's 3-pointer. Simons found Jake Layman for an alley-oop dunk to pull the Blazers in front.\n\nPortland pushed the lead to 128-119 on Layman's basket with 2:49 left. Simons hit his seventh 3-pointer to make it 131-123 with just over two minutes left and Sacramento couldn't catch up.\n\n\"That was fun. That was probably the best time I've had all season,\" Simons said. \"Just winning by coming back from down 28. We all stuck together and our teammates all helping us out the whole way. That was fun.\"\n\nMarvin Bagley III had 20 points to lead the Kings, who lost their 11th straight game in Portland.\n\n\"It was a hell of a game. I was really proud of those six guys who played,\" Blazers coach Terry Stotts said. \"The NBA is a funny game and obviously at halftime, it didn't look like we had much going, defensively in particular.\"\n\nStotts said before the game that guard CJ McCollum would rest because it was the second of a back-to-back. McCollum missed 10 games with a left knee injury and had just been back for Portland's last two games.\n\nAs for his other players, Stotts said going in that it was \"fluid.\" Damian Lillard was available but did not play. Neither did any of the team's other regular starters, as Stotts went with Skal Labissiere, Layman, Meyers Leonard, Gary Trent, Jr. and Simons. Trent, Simons and Labissiere were making their first starts of the season.\n\nThe Kings' season is over, but coach Dave Joerger said he was encouraged.\n\n\"We haven't been great for the last couple of weeks, but I don't want that to dull the shine on what has been a terrific season of development and competitiveness, and competitive spirit, of laying down a foundation and an identity, a lot of success and a lot of good moments,\" Joerger said. \"I feel good about that, and I feel good about where we can be in the future.\"\n\nThe Kings stayed with their regular starters and went up by 11 points in the opening quarter. They extended the lead to 28 points during the second and were up 87-62 at the break. Da'Aaron Fox led the Kings with 17 points and nine assists at halftime.\n\nJoerger went to his reserves in the second half.\n\n\"Being a top-three seed in the West is an accomplishment,\" Lillard said. \"We should be proud of ourselves but obviously our business is just beginning.\"\n\nTIP-INS\n\nKings: Joerger was asked before the game why the Kings had not won in Portland since 2012. He replied: \"LaMarcus Aldridge, Damian Lillard, CJ McCollum, Wesley Matthews.\" ... The Kings gave up 76 points in the second half.\n\nTrail Blazers: Sacramento's 87 first-half points were the most Portland had allowed in the half this season. ... Simons became just the 11th rookie in franchise history to have a 30-point game. ... Portland earned the No. 3 seed for the second straight year. Last season they were swept by New Orleans.\n\nABOUT THE THUNDER: Oklahoma City won all four games against the Blazers this season. Portland swept the Thunder the year before.\n\n\"We know that we're capable of beating them. Each game this season came down to a possession here, a possession there,\" Lillard said. \"It's going to be a tough, tough series. And I think we've got to go out and just be aggressive going into it. Our mentality has to be as the aggressor, go in there with the attitude that we're getting it done.\"\n\nUP NEXT\n\nSacramento's season is over.\n\nThe Trail Blazers will host the Oklahoma City Thunder on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994154.099904
}