{
  "game_id": "0021500346",
  "espn_id": "400828233",
  "date": "Dec 12, 2015",
  "matchup": "DET vs. IND",
  "headline": "Pistons use balanced attack to rout Pacers 118-96",
  "body": "AUBURN HILLS, Mich. --  Stan Van Gundy has waited all season for a night like he got Saturday, when his entire roster clicked in the same game.\n\nPlaying their seventh game in nine nights, the Pistons outscored the Indiana Pacers 74-50 in the second and third quarters and went on to an easy 118-96 win.\n\n\"I think that was the first game we've had this year where everyone played well,\" he said. \"We've played some good games, but tonight was really about the whole team. That's not something I've been able to say before this season.\"\n\nDetroit has won six of eight, including three of the five games in rapid succession. The Pistons had one bad loss in Charlotte and lost to Memphis on a half-court shot with 1.1 seconds to play.\n\n\"This was a grind, and while we knew it was coming, it was still good to see the way our guys responded to this stretch,\" Van Gundy said. \"If (Memphis) doesn't hit that shot, we go 4-1. This is only the middle of this tough stretch, but we're handling it well thus far.\"\n\nReggie Jackson had 21 points and nine assists to lead a balanced attack. Ersan Ilyasova added 20 points, while Kentavious Caldwell-Pope finished with 18 points, a career-high eight assists and seven rebounds.\n\n\"We knew it was a back-to-back, but they were on one, too. So we just wanted to come out with great energy,\" Caldwell-Pope said. \"We picked it up on the defensive end. We got stops and got easy baskets in transition, and just continued that all game.\"\n\nSix Pistons scored in double figures, while Andre Drummond had eight points and 11 rebounds.\n\n\"Tonight was a disappointing effort on the defensive end,\" Pacers coach Frank Vogel said. \"They played last night too, so that's no excuse.\"\n\nGeorge Hill led the Pacers with 14 points, while Paul George finished with 13 on 4-of-16 shooting, missing all four of his 3-point attempts.\n\n\"They played with energy, they pushed the tempo and they pushed the pace,\" George said. \"Once they figured out that gave them an advantage, they went with it. We couldn't stop them in the half court or the fast break.\"\n\nThe Pacers lost for the fourth time in five games.\n\nThe teams traded the lead for much of the first half, but Jackson, Caldwell-Pope and Ilyasova hit three straight 3-pointers late in the second quarter to jump Detroit's advantage to 63-51.\n\nThe Pacers made a quick run, but Jackson's fallaway jumper at the buzzer gave Detroit a 65-55 lead at the half. Four Pistons starters were in double figures, led by Jackson's 13 points.\n\nThe Pacers shot 57.5 percent from the floor in the half, but only had one offensive rebound and turned the ball over nine times, leading to 19 Detroit points.\n\nDetroit, on the other hand, was 8 of 15 on 3-pointers in the half, with six players making at least one. The Pistons kept the pressure on at the start of the third quarter, quickly building a 79-60 lead on Ilyasova's layup.\n\nIndiana slowed Detroit enough to get within 86-71 late in the period, leading Van Gundy to call a timeout. The Pistons responded with a 16-4 run to take a 102-75 lead with a minute left in the third quarter.\n\nDetroit finished with 37 points in the third and cruised to an easy victory.\n\nTIP-INS\n\nPacers: George picked up a third-quarter technical for arguing a foul call. ... Indiana is hoping to get Myles Turner back from a fractured left thumb after New Year's.\n\nPistons: After getting outscored 43-2 in the teams' first meeting, the Detroit bench had 14 points in the first half, including a pair of 3-pointers by Steve Blake.\n\nHIGH PRAISE\n\nVan Gundy singled out Marcus Morris for his job on George. \"Marcus did a great job on one of the toughest players to defend in the league,\" he said. \"He made him work on both ends of the floor. We know we got lucky, because Paul missed some shots that he normally makes, but Marcus didn't make anything easy.\"\n\nUP NEXT\n\nPacers: Host Toronto on Monday.\n\nPistons: Host Clippers on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994944.4664881
}