{
  "game_id": "0022400826",
  "espn_id": "401705392",
  "date": "Feb 24, 2025",
  "matchup": "OKC vs. MIN",
  "headline": "McDaniels scores 27, and Timberwolves rally from 25-point deficit to beat Thunder 131-128 in OT",
  "body": "OKLAHOMA CITY -- — Jaden McDaniels scored 27 points, Anthony Edwards blocked Shai Gilgeous-Alexander's go-ahead shot attempt and the Minnesota Timberwolves overcame a 25-point deficit in the second half to beat the Oklahoma City Thunder 131-128 in overtime on Monday night.\n\n\r\n              Naz Reid had 22 points and 11 rebounds, and Nickeil Alexander-Walker added 21 points for the Timberwolves. Edwards had 17 points, 13 rebounds and eight assists for Minnesota, which lost 130-123 to the Thunder on Sunday night.\n\n\r\n              Gilgeous-Alexander had 39 points, 10 rebounds and eight assists, but Edwards blocked him at the rim with 13.2 seconds remaining in overtime. Gilgeous-Alexander also missed a 3-pointer with 2.9 seconds left in the extra period that would have tied the game.\n\n\r\n              Jalen Williams scored 27 points and Aaron Wiggins added 19 for the Thunder, who still lead the Western Conference at 46-11.\n\n\r\n              Thunder forward Chet Holmgren, who missed three months with a pelvic fracture before recently returning, rested. Center Isaiah Hartenstein left the game in the second quarter with a bloody nose and did not return.\n\n\r\n              Oklahoma City led 82-57 in the third quarter and was ahead 102-80 going to the fourth. But reserve Terrence Shannon scored 11 of his 17 points in the period, and the Timberwolves outscored the Thunder 41-19. \n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota's rally was mostly without Edwards, who played just 3 1/2 minutes in the fourth quarter. The Timberwolves won without center Rudy Gobert, who was out with lower back spasms.\n\n\r\n              Thunder: Oklahoma City simply missed a ton of open shots. The looks were there.\n\n\r\n              Key moment\r\n              McDaniels scored and was fouled with 11.9 seconds left in regulation. His free throw tied the game at 121, and that was the score heading into overtime.\n\n\r\n              Key stat\r\n              Minnesota was the first team in NBA history to win a road game when trailing by at least 20 points entering the fourth quarter against a team with an .800 or better winning percentage, according to OptaStats.\n\n\r\n              Up next\r\n              The Timberwolves visit the Los Angeles Lakers on Thursday. The Thunder visit the Brooklyn Nets on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997674.2927349
}