{
  "game_id": "0021600823",
  "espn_id": "400900228",
  "date": "Feb 13, 2017",
  "matchup": "ORL @ MIA",
  "headline": "Magic snap 4-game losing streak, top Heat 116-107",
  "body": "MIAMI --  Evan Fournier found himself wide-open at the 3-point line, no Miami player around to offer any help defense.\n\nIt was the last break Orlando needed.\n\nFournier scored 24 points, the last of those coming on that big 3 with 1:01 left, and the Magic beat the Heat 116-107 on Monday night to snap a season-worst four-game losing streak. It was the third time this season Orlando went on the road amid a four-game slide, and the Magic are 3-0 in those contests.\n\n\"It's just too bad we need a poor performance to really compete and play well,\" Fournier said. \"We know what we're capable of. We've had great wins this year. We're just not consistent enough.\"\n\nElfrid Payton scored 20 points for Orlando, which got 17 from Serge Ibaka. Nik Vucevic finished with 13 points and 17 rebounds for Orlando, which went 2-0 in Miami for the first time since 2007-08.\n\nThe Heat are now 0-2 since putting together a 13-game winning streak.\n\n\"We were moving the ball, playing for each other, defensively too, and it showed,\" Vucevic said. \"I think we have to understand that's the only way we can be successful.\"\n\nDion Waiters returned from a sprained ankle and scored 23 points for Miami, whose eight-game home winning streak ended. Goran Dragic scored 22 points, James Johnson scored 15 and Hassan Whiteside grabbed 19 rebounds for the Heat, who were outrebounded 52-37.\n\nWhiteside was subbed out by coach Erik Spoelstra three minutes into the game, with the Heat getting outrebounded 9-1 and outscored 10-2.\n\n\"He just took me out because the guy got a rebound,\" Whiteside said. \"Went over my head. Happens, man. I lead the league in rebounds, the last time I checked.\"\n\nLater, when asked about the lack of help on the late 3 by Fournier, Whiteside said his responsibility was to contain a drive -- and pointed out Vucevic shot 4 for 14 against him.\n\n\"I call that good defense,\" Whiteside said.\n\nThe Magic shot 49 percent, and their 116 points matched the fifth-most allowed by Miami this season.\n\n\"It just shows you how tough this league is,\" Spoelstra said. \"Every night, it's a challenge ... but we didn't play near our best defensive game. It's not a successful formula for this basketball team to give up 116 and 49 percent.\"\n\nTIP-INS\n\nMagic: After shooting 26 for 110 from 3-point range in their last four road games, the Magic were 8 for 14 from deep. ... The Magic surprised 17 nonprofit community groups in Central Florida with donations totaling $1 million last week, the ninth time the team's youth foundation has managed to do so.\n\nHeat: Miami led for a total of 21 seconds in the first three quarters, then for another 1:57 in the fourth. ... Johnson was scoreless until 1:35 remained in the third, then scored nine points in 90 seconds.\n\nGORDON RETURNS\n\nAaron Gordon was back in Orlando's lineup after missing two games with a bone bruise on his right foot. He's planning to compete in the dunk contest on All-Star Saturday in New Orleans, after finishing second to Minnesota's Zach LaVine last year -- exactly one year ago Monday. \"He's going to win it, hands down, going away,\" Magic coach Frank Vogel said. \"They should give it to him already.\"\n\nRICHARDSON CLOSE\n\nHeat guard Josh Richardson (sprained left foot) is close to returning. He'll accompany the team on its trip to Houston and may play Wednesday. He hasn't played since Jan. 6.\n\nUP NEXT\n\nMagic: Host San Antonio on Wednesday. Orlando plays seven of its next eight at home.\n\nHeat: Visit Houston on Wednesday. It's Miami's final game before the All-Star break.",
  "source": "espn_api",
  "crawled_at": 1764995832.5043688
}