{
  "game_id": "0021900093",
  "espn_id": "401160735",
  "date": "Nov 04, 2019",
  "matchup": "MEM vs. HOU",
  "headline": "Harden scores 44, Rockets bounce back to beat Grizzlies",
  "body": "MEMPHIS, Tenn. --  The Houston Rockets didn't let Sunday's anemic performance at Miami carry over into the second night of a back-to-back.\n\nWith James Harden leading the way with 44 points, Houston was much more solid on Monday night, beating the Memphis Grizzlies 107-100.\n\nAfter the game, many of the Rockets referenced the 129-100 loss to the Heat, in which Houston trailed by 41 points in the first half.\n\n\"We got smacked in the mouth in the first quarter. That should leave a mark,\" coach Mike D'Antoni said before the game.\n\nHarden carried the load for the Rockets, who shot 38% from the field and were without Russell Westbrook, who took the night off for rest. The former MVP finished 12 of 28 from the field, including 7 of 16 from 3-point range. He added 10 rebounds and six assists.\n\nHarden said a better energy level contributed to a better performance.\n\n\"When you bring energy to the game, good things happen for you and for our team,\" Harden said. \"If you don't bring energy (and) you're not active, good things won't happen. That's what happened (Sunday) night.\"\n\nEric Gordon added 16 points, while Danuel House Jr. scored 15. Clint Capela had 10 points and 13 rebounds.\n\nRookie Ja Morant led Memphis with 23 points and six assists. Dillon Brooks scored 17 points. Jonas Valanciunas had 10 points and 10 rebounds. Morant was 10 of 16 from the field.\n\nThere were 15 ties and seven lead changes, and the game was tied at 70 midway through the third period.\n\nMemphis, which has seen leads dwindle with poor second-half performances, saw Houston score 11 straight points, including six by Harden, to break the tie and build a cushion. Memphis never got closer than six points the rest of the way.\n\n\"Tough third quarter, in a sense, for both teams,\" Memphis first-year coach Taylor Jenkins said, \"but I really liked the way our guys competed in the second half.\"\n\nTIP-INS\n\nRockets: Closed out a four-game trip at 2-2. ... Have reached at least 60 points in the first half in four of eight games this season. ... Harden has 40-plus points in four straight games against the Grizzlies. ... D'Antoni challenged a foul against Ben McLemore in the fourth quarter, but officials upheld the call after review.\n\nGrizzlies: F Jaren Jackson Jr. (right knee soreness) and G Grayson Allen (left ankle) sat out the game. Both left Saturday's loss to Phoenix in the third quarter. ... With Jackson out, rookie Brandon Clarke made his first NBA start. ... Dillon Brooks grabbed a career-high nine rebounds. ... Memphis trailed at halftime for the second time this season. ... Were called for five technical fouls in the game. ... Were outscored 22-16 in the third. Memphis has not won a third quarter this season.\n\nROOKIE RECORDS\n\nMorant has scored 117 points this season, the most by a Grizzlies rookie in his first six games. He also is the first rookie since the team moved to Memphis in 2001 to record consecutive games with at least 20 points and five assists. \"He's a beast, man,\" Harden said of the second overall pick in this year's draft. \"He's aggressive. As a young guy in this league, some guys tend to be nervous. He has no nerves at all.\"\n\nTESTY TIMES\n\nThe game got testy with about two minutes left when Grizzlies forward Jae Crowder appeared to take a shot to the groin while guarding Harden. After the foul was called on Crowder, Harden and the Grizzlies exchanged words, leading to a technical against Crowder along with ejection. Harden was called for a flagrant-1 foul after a review by officials.\n\nLAST WORD\n\n\"It was better, but it was so bad (Sunday) night. So, the bar was really low.\" -- D'Antoni.\n\nUP NEXT\n\nRockets: Host the Golden State Warriors on Wednesday.\n\nGrizzlies: Host the Minnesota Timberwolves on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995766.882525
}