{
  "game_id": "0021500369",
  "espn_id": "400828256",
  "date": "Dec 15, 2015",
  "matchup": "HOU @ SAC",
  "headline": "Cousins' manager tossed for slap at Terry, Kings top Rockets",
  "body": "SACRAMENTO, Calif. --  Kings star DeMarcus Cousins had another strong game Tuesday night. His manager wasn't as fortunate.\n\nCousins amassed 26 points and 12 rebounds as Sacramento won its third straight by defeating the Houston Rockets 107-97.\n\nHis manager wasn't around to see the victory. Andrew Rogers was ejected for slapping at Rockets guard Jason Terry, who was trailing the play on a dunk by Sacramento's Ben McLemore in the third quarter.\n\nTerry put his hand out to slow down as he neared fans sitting along the baseline, and Rogers slapped at Terry's arm. The Houston guard stopped, turned around and started to step toward Rogers, who was then ejected from his seat.\n\nAnother fan, believed to be sitting with Rogers' group, was ejected later in the game.\n\n\"I don't know what happened. I didn't hear anything or see anything. That's all there is,\" said Terry, who clearly did not want to discuss the situation.\n\nThe Kings never trailed after the midway point of the second quarter in a sloppy game that included 49 turnovers and three technical fouls, one on Cousins.\n\n\"I'm not sure I've ever won a game by 10 points where my team committed this many turnovers,\" Sacramento coach George Karl said. \"I've got a crazy team and I'm kind of crazy. Some of our crazy decisions were amazing.\"\n\nStarting for suspended guard Rajon Rondo, Darren Collison had 14 points, a season-high 13 assists and six rebounds as the Kings won their third in a row.\n\nRondo was penalized one game by the NBA for directing a gay slur at official Bill Kennedy in a game Dec. 3 against Boston in Mexico City.\n\n\"We all know what kind of player Rondo is, but when somebody is down, we've still got to be able to win games,\" said Rudy Gay, who had 17 points and 13 rebounds for Sacramento. \"Darren came out there and he made an effort to keep his team in check and run the team like a point guard should. He did that.\"\n\nOmri Casspi had 19 points for the Kings, who have won seven of their past nine home games.\n\nJames Harden scored 33 points for Houston. Terry and Patrick Beverley both added 14.\n\nRockets star Dwight Howard was in foul trouble and wasn't much of a factor. He left the game early in the third quarter with his fourth foul and finished with four points and four rebounds in 28 minutes.\n\n\"Whatever it was, we need to play harder and figure it out,\" Harden said. \"That's the type of messages that are sent. Our defense will get there, but we have to make it get there. We're showing spurts on defense but we are not consistent.\"\n\nThe Kings led 82-74 entering the fourth quarter and three early 3-pointers by Marcus Belinelli helped them maintain control in snapping an eight-game losing streak against Houston.\n\nTRADE TALK\n\nA report earlier in the day speculated that Howard was unhappy with his role on offense, where he's only getting a little more than eight shots per game. The speculation had him possibly going to Miami.\n\n\"I haven't said nothing to nobody about anything,\" Howard said. \"I've been positive and trying to help turn this thing around every way possible. People are always going to make up lies and rumors to get off. But I haven't said nothing about anything to anybody. That has never been my focus. I'm trying to get these guys to play better and get myself to play better. So why would I say that to anybody?\"\n\nTIP-INS\n\nRockets: Howard fouled Cousins late in the opening half and picked up a technical. ... Harden scored 10 straight Rockets points to end the third quarter. . The Rockets missed 27 of 39 3-point shots.\n\nKings: Cousins drew a technical early in the game after battling underneath with Howard. ... Karl was called for a technical in the second quarter. ... Rap star Drake sat next to Kings owner Vivek Ranadive in courtside seats. ... Seth Curry played as the backup point guard and had six points in 20 minutes.\n\nUP NEXT\n\nRockets: At the Los Angeles Lakers on Thursday.\n\nKings: At Minnesota on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994647.9828858
}