{
  "game_id": "0022300884",
  "espn_id": "401585512",
  "date": "Mar 04, 2024",
  "matchup": "LAL vs. OKC",
  "headline": "D'Angelo Russell scores 26 points, leads surging Lakers past West-leading Thunder 116-104",
  "body": "LOS ANGELES -- — D’Angelo Russell hit five 3-pointers while scoring 26 points, and Anthony Davis added 24 points and 12 rebounds in the Los Angeles Lakers' 116-104 victory over the Oklahoma City Thunder on Monday night.\n\n\r\n              LeBron James had 19 points, 11 rebounds and eight assists in the Lakers' 10th victory in 14 games. Austin Reaves added 16 points while hitting four 3s for the Lakers, who won their third straight meeting with the Western Conference-leading Thunder to take the season series.\n\n\r\n              “They’re so well-coached that you can’t relax,” Russell said. “That team has got everything you need to win and to be efficient at this level. You’ve got to be ready to play against those guys. It’s no fluke (to beat them).”\n\n\r\n              In his first game since scoring his record 40,000th career point in a loss to Denver, James nearly got a triple-double before the Lakers’ big lead allowed him to sit out the final six minutes. Davis was able to sit out the entire fourth quarter when the Lakers hit six 3-pointers in quick succession during his absence, boosting their lead to 25 points.\n\n\r\n              Russell punctuated the Lakers' decisive rally by hitting 3-pointers on three consecutive possessions with increasing theatrics.\n\n\r\n              “My teammates find me when I’m hot,” Russell said. “It makes it easier when I can stretch the floor like that. That’s what shooting does. It’s a pleasure.”\n\n\r\n              Russell passed to James before his third 3-pointer with 9:06 to play, but James whipped the ball right back to him for a shot that left Russell sprawled on his back from uncalled defensive contact, putting the Lakers up 103-79 and earning a standing ovation.\n\n\r\n              “I didn’t know I made the shot,” Russell said. “I just kind of threw it up there. Lucky shot.”\n\n\r\n              Shai Gilgeous-Alexander scored 20 points — ending his streak of eight consecutive 30-point games — for the Thunder, who lost for only the second time in nine games. Lu Dort and Chet Holmgren added 15 points apiece.\n\n\r\n              “Our start was good offensively, but our overall sharpness just wasn’t there,” Thunder coach Mark Daigneault said. “Defensively, we turned them over a bunch of times, and that kept us in it. But certainly not our fastball tonight. ... I just didn’t think we were as sharp offensively as we needed to be. A team like that that’s got size and physicality, that’s a requirement to hit shots against them, but we just didn’t do that enough.”\n\n\r\n              Oklahoma City hit a season-low 30.6% of its shots in the first half while playing on possibly weary legs during the third stop of a four-game road trip that included a draining win at Phoenix on Sunday.\n\n\r\n              “Obviously, they’re coming off a tough back-to-back,” Reaves said. “But any time you can beat a team confidently going into the fourth of that caliber, it speaks to what you did offensively and defensively. … Anytime you beat a team like that that’s been playing really good basketball, it feels good and it gives you some momentum going forward.”\n\n\r\n              Both teams weren't in top form in the first half. The Thunder jumped to a quick 12-point lead, but then fell into a 2-for-21 shooting slump that allowed the Lakers to take a double-digit lead despite committing 12 turnovers.\n\n\r\n              Oklahoma City big man Jaylin Williams missed his second straight game with a sprained left knee. Mike Muscala made his first appearance since rejoining the Thunder from Detroit, scoring five points in 11 minutes.\n\n\r\n              Harry Giles III made his Lakers debut in the final minutes.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Portland on Wednesday.\n\n\r\n              Lakers: Host Sacramento on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995496.525955
}