{
  "game_id": "0021800564",
  "espn_id": "401071240",
  "date": "Jan 03, 2019",
  "matchup": "SAC vs. DEN",
  "headline": "Murray gets 17 in 4th quarter to lift Nuggets over Kings",
  "body": "SACRAMENTO, Calif. --  After watching the Sacramento Kings run off 66 first-half points, the Denver Nuggets focused on defense in the second half and let Jamal Murray take care of the rest.\n\nMurray scored 17 of his 36 points in the fourth quarter and the Nuggets beat the Kings 117-113 on Thursday night for their fourth straight win.\n\n\"Before halftime, they were getting everything they wanted, on transition, on the glass, and we turned the ball over. All the things we prioritized before the game, we didn't do in that first half,\" Denver coach Michael Malone said. \"But love the effort to start that third quarter ...  and get right back into the game. Then, obviously, Jamal went into the phone booth and came out like Superman in the second half.\"\n\nNikola Jokic had 26 points and 13 rebounds, and the Nuggets maintained their lead atop the Western Conference by winning for the eighth time in 10 games.\n\nMason Plumlee added 12 points and 10 rebounds for Denver, which outrebounded the Kings 54-33.\n\n\"I just thought we really responded at halftime. We realized we didn't play much defense in the first half,\" Plumlee said. \"I just think we took away their rhythm (in the second half), they were very comfortable in the first half.\"\n\nBuddy Hield had 29 points to lead the Kings, who have lost three straight.\n\nThe Kings held a 13-point lead at the half and were ahead 70-55 early in the third period when Murray scored eight straight points -- including a pair of 3-pointers -- to lead a 13-point Denver run. The Nuggets took the lead later in the period, and the game was tied 84-84 entering the fourth.\n\nMurray hit a 3-pointer to open the final period, and the Nuggets never trailed again. They built a 10-point lead with six minutes remaining, but Hield made three straight 3-pointers to keep Sacramento close.\n\nThe Kings pulled within 108-106 with 1:25 left before Murray made consecutive 3-pointers for the Nuggets.\n\n\"I just wanted to pick up our energy in the second half,\" Murray said. \"In the first half, we gave into everything they were doing. In the second half, we came out with a different energy and I tried to get my guys to start talking more and be more vocal. We all gang rebounded and came together on the defensive end.\"\n\nSacramento fell to .500 at 19-19, better than most prognosticators had predicted before the season but disappointing for a team that has now lost four of five.\n\n\"I'm trying to keep our guys very positive at this point,\" Sacramento coach Dave Joerger said. \"I'm very proud of our group and the effort that we're giving and the learning that is happening because of competition.\"\n\nSERBIAN TRIO\n\nBjelica and Jokic, both natives of Serbia, had big first quarters. Bjelica scored 12 of the Kings' 30 points in the period, and Jokic had 10 of the Nuggets' 30 points in the quarter. And then their compatriot, Sacramento's Bogdan Bogdanovic, scored the first six points of the second quarter and led all scorers with 11 points in the period. He finished with 14 points off the bench for the Kings.\n\nTIP-INS\n\nNuggets: Murray was 6 for 12 on 3-pointers. ... Denver outrebounded the Kings 54-33. ... Denver coach Michael Malone was the Kings' coach from 2013-15.\n\nKings: Nemanja Bjelica had 17 points, but only five after the first quarter. ... DeAaron Fox had 16 points and eight assists. ... Sacramento has lost three straight to the Nuggets, including both games so far this season.\n\nUP NEXT\n\nNuggets: At home Saturday against Charlotte in a reunion of the Hernangomez brothers (Denver's Juancho and Charlotte's Willy).\n\nKings: Host Golden State on Saturday in the third game of a four-game homestand.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994872.8817658
}