{
  "game_id": "0022000990",
  "espn_id": "401307794",
  "date": "May 05, 2021",
  "matchup": "ORL vs. BOS",
  "headline": "Walker returns from injury, scores 32  as Celtics whip Magic",
  "body": "ORLANDO, Fla. -- — Kemba Walker tied a season high with 32 points in his return from a four-game injury absence, Evan Fournier had 18 points in his first game back in Orlando since being traded, and the Boston Celtics routed the Magic 132-96 on Wednesday night.\n\n\r\n                    Jayson Tatum shook off a slow start and finished with 27 points for Boston, which swept the three-game series with the Magic and beat Orlando for a sixth straight time. The Celtics made 21 3-pointers, just two fewer than their season-best 23 against Orlando on March 21.\n\n\r\n                    Walker, who entered averaging 20.7 points in 34 career games against the Magic, showed no rust following a nine-day layoff because of a strained left oblique suffered on April 25. Walker made 11 of 18 shots and shot 6 of 9 from 3-point range in 28 minutes for Boston, which pulled even with Miami for sixth in the Eastern Conference standings. Walker scored 32 points for a third time this season.\n\n\r\n                    “He had good burst and looked good,” Boston coach Brad Stevens said. “Injuries are no fun, but you can tell the guys who've had time off their legs because you can see the different burst. (Walker) was great.”\n\n\r\n                    Fournier, who played for the Magic for 6 1/2 seasons before his trade to Boston, was honored with a highlight video in the first half. Fournier, who has struggled recently with the aftereffects of COVID, hugged and joked with many of the Magic’s coaches following the game.\n\n\r\n                    “I’ll always have fun playing against (Orlando coach Steve Clifford) and those guys, and I’m glad we got the win and that we won by 30,” Fournier said jokingly.\n\n\r\n                    Dwayne Bacon and Moritz Wagner each scored 20 points for Orlando, while Mo Bamba added 19 points, 15 rebounds and four blocks. The Magic saw their modest two-game winning streak end.\n\n\r\n                    “They’re seventh in the NBA in points off turnovers and we had eight first-quarter turnovers that led to (14) points and that really set the tone for the whole game,” said Clifford, who was back on the sidelines after missing the past six games following a positive COVID-19 test.\n\n\r\n                    FOURNIER RETURNS\n\n\r\n                    To illustrate how much he loved Orlando during his 6 1/2 seasons with the Magic, Fournier said in late March that he had never lived in the same city more than two years since he was 13 when he left his family home in France to chase his professional basketball dreams. The next day, the guard who was in the midst of a career year was traded from Orlando to Boston.\n\n\r\n                    Upon his return to Orlando, Clifford had this to say about the versatile guard: “There’s nothing more important when you play 82 games than having a guy who you never have to worry whether he’s going to try hard. It was a given with him. Played hurt, played really hurt, always ready to play, always into the game plan and badly wanted to win.” \n\n\r\n                    ON THIS DATE\n\n\r\n                    Wednesday marked the 26th anniversary of the Magic defeating the Celtics 3-1 in the first round of the 1995 NBA playoffs. That final game was historic for two reasons: It clinched Orlando's first playoff series win and it was the final game in the famed Boston Garden. “The Garden is closed for business,” said Shaquille O’Neal, who had 25 points and 13 rebounds that afternoon.\n\n\r\n                    TIP INS\n\n\r\n                    Celtics: Stevens said Jaylen Brown (ankle sprain) might rejoin the team in Chicago on Friday and could play. ... G Romeo Langford was put in the NBA’s concussion protocol program after experiencing headaches a day after an accidental collision in practice. ... One of the loudest cheers came in the fourth when 7-foot-5 center Tacko Fall checked in. Fall played college basketball at nearby UCF. He had an up-and-under layup with 4 minutes remaining and later stuffed R.J. Hampton's dunk attempt.\n\n\r\n                    Magic: Sindarius Thornwell became the 28th player to appear in a game this season for Orlando, tying an NBA record set by Memphis in the 2015-16 and ’18-19 seasons. ... Orlando briefly lost Cole Anthony when when his head collided with Bamba’s shoulder on a pick-and-roll. \n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Play at Chicago on Friday night\n\n\r\n                    Magic: Play at Charlotte on Friday night.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764997795.157575
}