{
  "game_id": "0022300097",
  "espn_id": "401584725",
  "date": "Oct 29, 2023",
  "matchup": "MIL vs. ATL",
  "headline": "Hawks use balanced scoring, hold Lillard to six points and cruise past Bucks 127-110 for first win",
  "body": "MILWAUKEE -- — Trae Young scored 20 points to lead eight players in double figures, and the Atlanta Hawks limited Damian Lillard to six points while routing the listless Milwaukee Bucks 127-110 on Sunday night for their first victory of the season.\n\n\r\n              Bogdan Bogdanovic added 17 points, Dejounte Murray had 15 and Jalen Johnson and Onyeka Okongwu finished with 14 apiece for the Hawks.\n\n\r\n              “It shows how they are playing together. It shows the unselfishness,\" Hawks coach Quin Snyder said. “Guys are just trying to make the right play. We’ve got a lot of guys who are capable of putting the ball in the basket.”\n\n\r\n              Lillard, who scored 39 points in his Bucks debut on Thursday, failed to score in the first half, missing all seven of his shots, including four from 3-point range, He also committed six of the team’s nine turnovers.\n\n\r\n              Lillard, who came to Milwaukee in a September trade for Jrue Holiday, Grayson Allen and draft choices, tallied his first points on a pull-up 3-pointer with 3:33 left in the third quarter. He shot 2 for 12 overall, 2 of 8 from behind the arc. \n\n\r\n              “Sometimes great players have rough nights,\" Snyder said, noting that Atlanta's defensive strategy involved having two players focused on Lillard.\n\n\r\n              “You can’t guard Damian Lillard with one guy,” he said.\n\n\r\n              Bucks coach Adrian Griffin said the team needs to be better at making adjustments when Lillard is double-teamed.\n\n\r\n              “We've got to make teams pay for doing that,\" he said.\n\n\r\n              The Bucks committed 23 turnovers, leading to 22 Hawks points.\n\n\r\n              “We have to execute on the offensive end just to give our defense an opportunity,” Griffin said. “Too many turnovers allowed them to get out in transition.”\n\n\r\n              Giannis Antetokounmpo led the Bucks (1-1) with 26 points and 11 rebounds. Malik Beasley added 18 points.\n\n\r\n              Bucks forward Khris Middleton didn’t play as the team monitors his workload in the three-time All-Star’s return from offseason knee surgery. He’s expected to be available for Monday’s game with the Miami Heat.\n\n\r\n              Milwaukee was sluggish from the start, missing seven of its first eight shots. Atlanta led 31-25 after one quarter after holding the Bucks to 38.5% shooting.\n\n\r\n              The Hawks (1-2) pulled away in the second and led by as many as 23. They held a 68-47 lead at the half. \n\n\r\n              Bogdanovic said the Hawks came in focused on not starting the season with three consecutive losses.\n\n\r\n              “Nobody likes to lose. This team is so competitive,\" he said. “Most of the guys on this team can take the ball and go and just score 30 points off skill, talent. But we know that we need to sacrifice and help others and put them in a better position and look for the better option.”\n\n\r\n              Young's early season shooting woes continued, as he shot 5 of 14. Young was 4 for 16 shooting in Friday’s loss at home to the New York Knicks. He was 4 of 19 in Atlanta’s 116-110 season-opening loss at Charlotte on Wednesday night.\n\n\r\n              “Trae’s had a couple games where the ball didn’t go in the hole, even tonight in the first half,” Snyder said. \"I thought his poise tonight was terrific. It’s easy to get discouraged when you don’t get the results that you want. Eventually the ball did go in because he’s a good shooter.”\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host the Minnesota Timberwolves on Monday.\n\n\r\n              Bucks: Host the Miami Heat on Monday as Milwaukee faces the team that knocked it out of last season’s playoffs.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996163.533768
}