{
  "game_id": "0022400114",
  "espn_id": "401704680",
  "date": "Oct 29, 2024",
  "matchup": "MIN vs. DAL",
  "headline": "Mavericks fend off Timberwolves 120-114 in West finals rematch behind Irving's 35 points",
  "body": "MINNEAPOLIS -- — Kyrie Irving scored 16 of his 35 points in the third quarter, Luka Doncic had a late surge to finish with 24 points, nine assists and eight rebounds, and the Dallas Mavericks held off the Minnesota Timberwolves 120-114 on Tuesday in the first rematch of last season's Western Conference finals.\n\n\r\n              Anthony Edwards had 24 of his 37 points in the first quarter to set a Target Center record, going 7 for 13 from 3-point range. He also went just 6 for 12 from the free-throw line. \n\n\r\n              Doncic put his stamp on the game with a 33-footer with 1:04 left to stretch the lead to eight points, barking at fans as he skipped back to the bench after a timeout. That was his only make in eight tries from behind the arc.\n\n\r\n              P.J. Washington added 17 points and eight rebounds for the Mavericks, who played on back-to-back nights after beating Utah 110-102 at home on Monday. Doncic went 5 for 22 from the floor and 1 for 9 from 3-point range for 15 points against the Jazz.\n\n\r\n              Julius Randle had 20 points, seven rebounds and seven assists for the Timberwolves.\n\n\r\n              Takeaways\r\n              Mavericks: With Doncic in a mini-slump, not only did the Mavericks get a superstar performance from Irving, the other half of their leading duo, they were especially active on defense with 12 steals.\n\n\r\n              Timberwolves: The breathtaking first quarter by Edwards gave way to some sloppy stretches. Minnesota had 20 turnovers that led to 25 points for Dallas.\n\n\r\n              Key moment\r\n              Irving went 6 for 8 from 3-point range, including a swish with 2:31 left and Randle tightly guarding him at the top of the key after the Timberwolves pulled within 109-107.\n\n\r\n              Key stat\r\n              \r\n              Edwards has five-plus 3-pointers in all four games this season, the longest streak in team history.\n\n\r\n              Up next\r\n              The Mavericks host Houston on Thursday night and the Timberwolves host Denver on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998114.642261
}