{
  "game_id": "0021700394",
  "espn_id": "400975145",
  "date": "Dec 11, 2017",
  "matchup": "OKC vs. CHA",
  "headline": "Howard's 23 points lead Hornets past Thunder",
  "body": "OKLAHOMA CITY --  The Charlotte Hornets finally won a road game. In a tough spot, too.\n\nDwight Howard scored 23 points to help the Charlotte Hornets beat the Oklahoma City Thunder 116-103 on Monday night. It was Charlotte's first victory on the road since Oct. 30 at Memphis.\n\n\"There are two ways you can go when you have a slow start,\" Howard said. \"You can either look down upon yourself and say, `I can't do it, it's too hard,' or you can look in the mirror and say `I want to get out of this.' That's how we are feeling. Together we can do something good.\"\n\nKemba Walker had 19 points for the Hornets, who had lost seven of eight. Marvin Williams scored 18, and Michael Kidd-Gilchrist finished with 17 points.\n\nRussell Westbrook had 30 points and seven assists, and Paul George scored 20 points for the Thunder after missing the previous two games with a right calf contusion.\n\nCharlotte shot 53 percent from the field against one of the league's best defensive teams. The Hornets made 13 of 25 3-point attempts while improving to 2-10 on the road.\n\n\"We played together, we moved the ball, our defensive intensity was great and when we needed a big play, they came up with the big plays,\" interim coach Stephen Silas said.\n\nThe game was tied at 66 in the third quarter when Charlotte went on a run and never relinquished momentum. A 3-pointer by Williams made it 74-66, leading to a Thunder timeout.\n\nCharlotte kept right on rolling. A 3-pointer by Frank Kaminsky put the Hornets up 86-68, and a layup by Kidd-Gilchrist made it a 20-point game. The Hornets made 7 of 10 3-pointers in the quarter to go up 92-74 at the end of the period.\n\nOklahoma City cut the deficit to 11 on a dunk by Westbrook, but the Hornets quickly regained control for good.\n\n\"We just gave them little bonehead plays,\" Westbrook said. \"Three-point, four-point plays. I think they had a 40-point quarter. We can't afford to do that.\"\n\nTIP-INS\n\nHornets: G Nicolas Batum sat out with a sore left elbow. ... G Jeremy Lamb, who started his career with the Thunder in 2012, started for the Hornets. He finished with 14 points and five rebounds on 6-of-17 shooting. ... The Hornets outrebounded the Thunder 41-39.\n\nThunder: Defensive stopper Andre Roberson sat out with a left ankle sprain. ... Carmelo Anthony scored 11 points. He passed Vince Carter and moved into 22nd place in NBA history with 24,605 points. ... Anthony was issued a technical foul in the second quarter for complaining too much to official Tony Brothers.\n\nSTAT LINES\n\nThe Thunder, who entered the night 29th out of 30 teams in free-throw percentage, made 24 of 25 at the line.\n\nQUOTABLE\n\n\"We're not a team like them where they have a bunch of stars and you have guys who can just go win games for you,\" Silas said. \"We have to do it as a group. Most of it, for us, is on the defensive end. We did that tonight, and hopefully, that'll carry on.\"\n\nUP NEXT\n\nHornets: Visit the Houston Rockets on Wednesday.\n\nThunder: Visit the Indiana Pacers on Wednesday. It will be George's first game back in Indiana since he was traded for Victor Oladipo and Domantas Sabonis in July.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball.",
  "source": "espn_api",
  "crawled_at": 1764993125.236711
}