{
  "game_id": "0022201210",
  "espn_id": "401469365",
  "date": "Apr 07, 2023",
  "matchup": "CHI @ DAL",
  "headline": "Depleted Mavs lose to Bulls, eliminated from play-in race",
  "body": "DALLAS -- — Kyrie Irving had a seat next to Dallas owner Mark Cuban, and fellow All-Star Luka Doncic wasn't far away in sweats after his limited duty was finished.\n\n\r\n              Neither was available to address how the Mavericks essentially pulled the plug on their season before they were eliminated from the postseason.\n\n\r\n              That chore was left to coach Jason Kidd — again.\n\n\r\n              Coby White scored 24 points and the short-handed Chicago Bulls rallied past the depleted Mavericks 115-112 on Friday night, eliminating Dallas from play-in contention a year after the club reached the Western Conference finals.\n\n\r\n              Kidd said before the game an “organizational decision” was made to limit Doncic to the first quarter while sitting Irving and four other regulars when Dallas still had a chance to catch Oklahoma City for the final play-in spot as the 10th seed in the West.\n\n\r\n              Despite the move, the Mavericks led by double digits in the second half before a rag-tag bunch filled mostly with players who spent the season on the end of the Dallas bench slowly let the lead slip away.\n\n\r\n              “It’s not so much waving the white flag,” Kidd said. “It’s decisions sometimes are hard in this business. We’re trying to build a championship team. With this decision, this is maybe a step back. But hopefully it leads to going forward.”\n\n\r\n              The Bulls sat their top two scorers in DeMar DeRozan and Zach LaVine, but they are already locked in to the 10th seed in the East. They will visit No. 9 seed Toronto in a play-in game Wednesday night.\n\n\r\n              The Dallas loss clinched the 10th seed and final play-in spot in the West for Oklahoma City.\n\n\r\n              Patrick Williams scored 23 points for Chicago, and Nikola Vucevic had 20 points and 10 rebounds. White also had 11 assists.\n\n\r\n              “I thought Coby did a really nice job,” Bulls coach Billy Donovan said. “It was good to see him be aggressive shooting it and get downhill.”\n\n\r\n              Irving was out for right foot injury recovery. The others sitting with him were Tim Hardaway Jr. with left ankle soreness, Maxi Kleber for right hamstring injury recovery and Josh Green and Christian Wood for rest.\n\n\r\n              Doncic, who scored 13 points, ended up playing a few seconds into the second quarter on a night when the Mavericks paid tribute to his home country of Slovenia.\n\n\r\n              Keeping Doncic in was an apparent attempt to get him an ovation after Kidd suggested before the game it would be the 24-year-old superstar’s final action of the season. The move didn’t work because fans didn’t seem aware and therefore didn’t cheer. \n\n\r\n              The move to sit the other three highest scorers for the Mavs in apparent attempt to lose almost didn't work either.\n\n\r\n              Markieff Morris scored 13 points in the second quarter and rookie Jaden Hardy hit a half-court shot to beat the halftime buzzer for a 67-54 Dallas lead.\n\n\r\n              Neither Morris nor Hardy played in the second half, and the seldom-used players who dominated the lineup after halftime managed to keep the game close in the final minutes.\n\n\r\n              McKinley Wright IV's layup got Dallas within a point with 39 seconds left before Dalen Terry scored on an alley-oop dunk from White with 23 to go.\n\n\r\n              Theo Pinson missed a potential tying 3-pointer for Dallas, which had three more attempts at a tying 3 in the final seconds.\n\n\r\n              Kidd said the decision was made by Cuban and general manager Nico Harrison to rest most of the regulars. Dallas entered the game tied with Chicago for the 10th-worst record in the NBA.\n\n\r\n              If the Mavericks have a top-10 pick in the draft in June, they get to keep it. If the pick is 11th or lower, it goes to the New York Knicks as final payment for Dallas' trade to acquire Kristaps Porzingis in 2019. Next month's draft lottery will determine the final order. \n\n\r\n              Kidd shared the front office's decision with the players before the game, and said he was pleased they carried out his orders to play to win.\n\n\r\n              “I don't think I have to smooth over anything with the players,” Kidd said. “I’ve been very honest with the players. I was very honest with them before the game.”\n\n\r\n              Wright joined Doncic and Morris with 13 points to lead the Mavs.\n\n\r\n              SCORING RACE\n\n\r\n              Kidd said Doncic — along with Irving — won't play in the lone remaining game, which should clinch the scoring title for Philadelphia's Joel Embiid. Doncic is at 32.4 points per game to Embiid's 33.1. The Sixers' MVP candidate is probably finished for the regular season with his team locked in to the third seed in the East.\n\n\r\n              UP NEXT\n\n\r\n              Both teams are at home for their regular-season finales Sunday. The Bulls play Detroit. The Mavs face San Antonio.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994459.809002
}