{
  "game_id": "0022301160",
  "espn_id": "401585788",
  "date": "Apr 10, 2024",
  "matchup": "BKN vs. TOR",
  "headline": "Cam Thomas scores 23 points, Nets rally to beat Raptors 106-102 in home finale",
  "body": "NEW YORK -- — Cam Thomas had 23 points, Dennis Schroder scored 15 of his 21 points in the fourth quarter and the Brooklyn Nets rallied to beat the Toronto Raptors 106-102 on Wednesday night.\n\n\r\n              Nic Claxton added 14 points, 11 rebounds and five blocked shots, and rookie Noah Clowney had 10 points and a career-high seven blocks for the Nets in their final home game of the season. They finished 20-21 at Barclays Center.\n\n\r\n              Schroder credited Claxton’s and Clowney’s play on both ends of the court for helping the Nets late in the fourth quarter following Sunday’s 107-77 loss to Sacramento.\n\n\r\n              The 19-year-old Clowney, who was the 21st overall pick in the 2023 draft and has spent most of the season with the team’s G League affiliate in Long Island, became the 12th teenager in NBA history to block seven or more shots in a game.\n\n\r\n              “They kept trying to lay the ball up and I kept blocking it,” he said.\n\n\r\n              Clowney’s seven blocks are second most for a rookie in franchise history. Mike Gminski set the record with eight at Milwaukee on Jan. 6, 1981, and Sean Williams matched it against Sacramento on Dec. 18, 2007.\n\n\r\n              “That’s a lot of blocked shots,” Schroder said. “He had so many shots, he just changed without getting a piece. As a rookie I was 18 ,19, he’s going to be special.”\n\n\r\n              Immanuel Quickley scored 32 points for Toronto. Gradey Dick had career highs with 24 points and 6 3-pointers.\n\n\r\n              The Nets limited the Raptors to 7 for 22 shooting from the field and blocked six shots in the fourth quarter.\n\n\r\n              Toronto shot 16 for 47 in the paint and finished with 32 points.\n\n\r\n              “Their length, their size vs our size, obviously we knew going into the game they had a couple of guys that are really good with that,” Raptors coach Darko Rajakovic said. “We were able to get in the paint but not able to score.”\n\n\r\n              Toronto led 76-67 with 3:45 left in the third quarter after Jordan Nwora’s three-point play. The Nets trimmed the deficit to one, then fell behind 88-83 with 8:45 left on Nwora’s basket.\n\n\r\n              Schroeder then fueled a 12-6 run with seven points, capping the spurt with a nifty layup that put the Nets up 95-94 with 4:46 remaining. Quickley briefly gave the Raptors a 97-95 advantage on a three-point play before a pair of dunks by Clowney and Claxton gave the Nets a 99-97 lead with 1:49 to play.\n\n\r\n              Quickley’s 3-pointer put Toronto back on top and Schroder followed with a three-point play to put Brooklyn up 102-100. Garrett Temple had a chance to tie after he stole the ball from Clowney but was met at the rim by Clowney for his seventh block of the night.\n\n\r\n              Schroder followed by hitting a pair of free throws and Quickley’s layup cut the deficit to 104-102 with 5.2 seconds. Schroder then hit two free throws to seal the victory.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Miami on Friday night.\n\n\r\n              Nets: At New York on Friday night.\n\n\r\n              ------\n\n\r\n               This story has been corrected to fix the Nets' home record. It is 20-21.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996319.8382452
}