{
  "game_id": "0022200070",
  "espn_id": "401468225",
  "date": "Oct 28, 2022",
  "matchup": "ATL @ DET",
  "headline": "Young scores 36 points, Hawks down Pistons again 136-112",
  "body": "DETROIT -- — Trae Young had 36 points and 12 assists in just three quarters, and the Atlanta Hawks overcame Cade Cunningham's career-high 35 points to beat the Detroit Pistons for the second time in three nights, 136-112 on Friday.\n\n\r\n              Young scored 35 points when the Hawks won the first matchup 118-113 on Wednesday. He made 16 free throws that night but did most of his damage from the field on Friday, shooting 12 for 20.\n\n\r\n              “I was able to knock down some shots,” Young said. “I was pretty much getting the same looks. I was getting in the paint, still getting some open 3s, but I was able to knock them down tonight. That was the difference.”\n\n\r\n              Dejounte Murray had 26 points for Atlanta, which outscored the Pistons 67-45 in the second half. \n\n\r\n              “I thought we needed to establish our defense,” Hawks coach Nate McMillan said. “I thought our guys took that challenge. Defensively we were much better in the second half guarding the ball and taking them out of what they wanted to run.”\n\n\r\n              McMillan couldn't have asked much more of his dynamic backcourt of Young and Murray, who had 17 assists and one turnover. The Hawks as a whole only made seven turnovers.\n\n\r\n              “We feel that we have two playmakers that can create opportunities for themselves as well as for the rest of our guys. But it's important that they take care of the ball,\" McMillan said. “We've had a couple of games where we haven't done that, but for the most part in this early season we've been pretty good at taking care of the ball.”\n\n\r\n              Onyeka Okongwu added 16 points, Aaron Holiday scored 14 and De'Andre Hunter chipped in 12. \n\n\r\n              Cunningham added nine rebounds and eight assists despite foul trouble but the Pistons dropped their fifth straight. Cunningham's previous high was 34 points, which he reached twice last season as a rookie.\n\n\r\n              Bojan Bogdanovic scored 22 points and Isaiah Stewart had 17 points and eight rebounds for Detroit.\n\n\r\n              Pistons coach Dwane Casey felt his team lacked pride defensively.\n\n\r\n              “This is the first night I didn't see that commitment on the defensive end of the floor,” he said. “They shot almost 57% and that's just a sign of lack of commitment.”\n\n\r\n              Cunningham had 27 first-half points but the Pistons only led once before the break. Young nearly matched him with 23 points, including a layup in the closing seconds to give Atlanta a 69-67 halftime advantage.\n\n\r\n              The Hawks reeled off 11 unanswered points early in the second half to gain an 85-74 advantage. Cunningham picked up his fifth foul late in the third quarter with his team down by nine. Young scored five more points before the quarter ended as the Hawks carried a 106-94 advantage into the fourth.\n\n\r\n              Murray had three baskets in the first three minutes of the fourth as Atlanta continued to pull away.\n\n\r\n              “When you win and your strategy works the first time, you try to stick to it as much as possible,” Young said. \n\n\r\n              The Pistons shot 43% overall but just 21.9% on 3-point attempts.\n\n\r\n              “When things don't go right, not making shots, it drains you a little bit,” Casey said. “But there's no excuse for some of the things we did defensively.”\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Young has reached the 30-point mark 99 times in his career. He's one 30-point game shy of tying John Drew for fourth-most in franchise history. ... Atlanta shot 56.7% from the field. \n\n\r\n              Pistons: The team wore teal jerseys for the first time since April 18, 2001. They regularly wore teal at home from 1996-2001. ... Detroit's reserves were outscored 53-19.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Visit Milwaukee on Saturday.\n\n\r\n              Pistons: Host defending champion Golden State on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995214.115681
}