{
  "game_id": "0021500968",
  "espn_id": "400828855",
  "date": "Mar 11, 2016",
  "matchup": "OKC vs. MIN",
  "headline": "Rubio's late 3 lifts Timberwolves past Thunder, 99-96",
  "body": "OKLAHOMA CITY --  Ricky Rubio has been working hard on his shot and his efforts paid off Friday night.\n\nRubio's 3-pointer with 0.2 seconds remaining lifted the Minnesota Timberwolves to a 99-96 victory over the Oklahoma City Thunder.\n\n\"I've been working a lot, hard work pays off,\" said Rubio, who finished with 13 points and 12 assists for his eighth double-double of the season.  \"It feels good to see the results.\"\n\nTeammate Karl-Anthony Towns, who also had a double-double with 17 points and 12 rebounds, knows how much Rubio has been practicing that shot.\n\n\"He works on it constantly,\" Towns said. \"That's something he works on every single day.  He puts up a lot of shots, and it just shows how all the work, how comfortable he was taking that shot.\"\n\nAndrew Wiggins drove hard to the basket in the closing seconds and drew the defense before finding Rubio open on the left side. Rubio knew right away that the shot was good, allowing the Timberwolves to snap a 10-game losing streak against the Thunder.\n\n\"I was in the zone, it took forever to hit the basket, but I knew it was going in,\" Rubio said.  \"It was playing in slow-motion in my head, and I'll remember that.\"\n\nGorgui Dieng had 25 points and nine rebounds, while Wiggins added 20 points, five steals and four assists for Minnesota, which is 2-13 all-time in Oklahoma City and just 3-17 in its last 20 road games.\n\nKevin Durant scored 28 points, along with six rebounds, to lead Oklahoma City, which committed a season-high 24 turnovers. Russell Westbrook had 26 points and eight assists.\n\n\"I thought the difference in the game was our turnovers,\" said Thunder coach Billy Donovan. \"We had a lot of obviously wasted possessions where we needed to get a shot to the basket. We've got to be more careful with the basketball, we have to make better decisions.\"\n\nDurant had a game-high six turnovers and shouldered some of the blame for the sloppy performance.\n\n\"It's all on me, it's my fault,\" said Durant, whose streak of 30-point games ended at four. \"I'm the leader and I take full responsibility for it. I have to be better.\"\n\nMinnesota coach Sam Mitchell was proud of the job his defense did against Durant, Westbrook, and the NBA's second-best offensive team.\n\n\"Think about it, these guys are averaging 110 points a game and we held them to 14 points below their average,\" Mitchell said. \"For these guys to step up and take the challenge on the road, and this is a tough building to play in, it was just a great win for us.\"\n\nMinnesota led 88-87 with 3:28 remaining after two free throws from Dieng.\n\nThe Thunder then went on a 7-2 run, with all of their points coming from Durant, to take a 94-90 lead with 59 seconds left. However, two free throws from Dieng and a 10-foot jumper from Towns tied the score again at 94-all with 41 seconds to go.\n\nTowns then hit another 10-footer with 16 seconds on the clock to give the Timberwolves a two-point lead, but Steven Adams' layup with 10.8 seconds remaining tied it.\n\nOklahoma City started quite sloppy and the Timberwolves took advantage, jumping out to a 13-4 lead over the first 5:05. The Thunder committed eight turnovers, misconnected on seemingly routine passes multiple times, and shot just 2 for 16 from the floor over the first 8:30. When Towns made a layup with 3:38 left in the opening quarter, Minnesota had a 21-8 advantage.\n\nThe Thunder went on a 19-3 run over the next five minutes, pulling to 24-21 by the end of the first quarter. They took their first lead of the game, 27-24, on Durant's 3-pointer 1:22 into second.\n\nTIP INS\n\nTimberwolves: Minnesota totaled 12 steals, two shy of its season high of 14 from its 102-88 loss to Indiana on Dec. 26. Wiggins led the Timberwolves with five. They also induced Oklahoma City into committing a season-high 24 turnovers, also two shy of Minnesota's season-high of 26, against Milwaukee on March 4.\n\nThunder: Oklahoma City outrebounded Minnesota 54-37, led by Enes Kanter's 14, while Adams had 13. It was the 33rd time this season that the Thunder had won the rebounding battle by more than 10, and they totaled more than their league-leading average of 48.1.\n\nMASH UNIT\n\nMinnesota F Kevin Garnett sat out his 21st straight contest with a sore right knee, while teammate Nikola Pekovic missed his 17th in a row with a sore right ankle. . Thunder G Andre Roberson suffered a sprained left ankle in the first half and did not return. In 14:01 of playing time, he totaled four points and three rebounds. . OKC G Dion Waiters missed his second consecutive contest, following the shooting death of his younger brother, Demetrius Pinckney, on Tuesday in Philadelphia.\n\nUP NEXT\n\nTimberwolves: At Phoenix on Monday.\n\nThunder: At San Antonio on Saturday.\n\n---\n\nThis story has been corrected to show Andrew Wiggins passed Rubio the ball for the game-winning shot, not Karl-Anthony Towns.",
  "source": "espn_api",
  "crawled_at": 1764994141.232022
}