{
  "game_id": "0021800582",
  "espn_id": "401071258",
  "date": "Jan 05, 2019",
  "matchup": "POR vs. HOU",
  "headline": "Trail Blazers beat Rockets as Harden's 40-point streak ends",
  "body": "PORTLAND, Ore. --  Portland's Evan Turner knew what he was up against with James Harden.\n\nHarden had scored 40-plus points in his previous five games and was coming off consecutive triple-doubles.\n\nTurner, charged with Harden from the start, stopped that streak and managed to slow him -- a bit. Harden finished with 38 points and the Trail Blazers snapped Houston's six-game winning streak with a 110-101 victory on Saturday night.\n\n\"I just had to be aggressive and try to limit what he likes to do. He's an amazing offensive player, he's been on a hell of a run and obviously he's the head of the snake, so I just tried to pick him up, wear him down, tire him out and not try to get any cheap fouls,\" Turner said.\n\nHarden was 13 of 35 from the field, and shot 5 of 17 from 3-point range, overcoming a slow first half that ended with just nine points.\n\nRockets coach Mike D'Antoni said Harden is clearly on another level.\n\n\"It's unbelievable. Now you grade him on that he wasn't very sharp tonight, he only had 38. Now if he doesn't get 40 it's like, `What's wrong with him?\" D'Antoni said.\n\nPortland coach Terry Stotts weighed in: \"Well, we held him under 40 so I guess that's a win.\"\n\nJusuf Nurkic had 25 points and 15 rebounds to lead the Blazers. CJ McCollum added 24 points and Damian Lillard finished with 17 points and 12 rebounds for Portland's third win in the past four games.\n\nPortland led by as many as 16 points in the third quarter, but Harden started to show some life after a surprisingly cold first half.\n\nGerald Green's dunk got Houston within 88-83 early in the fourth but Nurkic's layup pushed Portland's lead to 97-85 with just under 6 minutes left.\n\nAfter Harden collected his fourth foul, McCollum hit a long jumper to put Portland up 101-90 with 3:10 remaining. Turner's layup and free throw made it 106-95 and Moda Center fans started heading for the doors.\n\nThere was some controversy when Harden got three free throws on Turner's foul that appeared to be on P.J. Tucker, and he made all three to close the gap with 1:02 left. After Lillard made a free throw on the other end, Harden's step-back jumper got the Rockets within 107-101 with 34 seconds left -- but it was a close as they could get.\n\nHarden missed a layup with 15 seconds left that would have put him at 40 points.\n\n\"My shots were flat at the beginning of the game but I picked it up in that third quarter and the second half. I've just got to get off to a better start,\" he said.\n\nPortland was the last team to hold Harden under 30. He had 29 in Houston's 111-104 home victory on Dec. 11. Maurice Harkless had some success guarding Harden, but he out with a sore left knee after a loss to the Thunder on Friday and Turner made his second start of the season.\n\nHarden had his 11th career triple-double and made the go-ahead 3-pointer in a 135-134 overtime victory over Golden State on Thursday night. He finished with 44 points, 10 rebounds and 15 assists.\n\nNeither team was able to make much of a move until the final two minutes of the half, when Portland went up 54-46 on Turner's layup. Nene was charged with a flagrant foul on Nurkic, who made one of the two free throws then added a basket. Lillard had a floater before time ran out and the Blazers went to the break with a 59-46 lead.\n\nHarden was 0 for 8 from 3-point range in the opening half. It was just the second time this season he failed to reach double digits in the first half.\n\nLillard's 3-pointer pushed Portland's lead to 77-61, but Harden answered with his own. Harden had 20 points in the third quarter but the Blazers led 86-77 going into the final period.\n\nAustin Rivers scored a season-high 21 points for Houston, while Clint Capela had 13 points and 21 rebounds.\n\nTIP-INS\n\nRockets: It was the third and final meeting of the season between the teams. They split the first two. ... Harden hit his first two 3-point attempts in the second half. ... The five-game streak with 40-plus points was the longest of his career. It was tied for the NBA's third-longest streak dating back to the 1972-73 season.\n\nTrail Blazers: Nurkic has 20 double-doubles. ... It was the first time Portland has defeated the Rockets twice in a season since 2015-16. ... Portland snapped a two-game losing streak to the Rockets at home.\n\nUP NEXT\n\nRockets: Host the Denver Nuggets on Monday.\n\nTrail Blazers: Host the New York Knicks on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995177.0236769
}