{
  "game_id": "0021800580",
  "espn_id": "401071256",
  "date": "Jan 05, 2019",
  "matchup": "TOR @ MIL",
  "headline": "Leonard, Siakam each score 30 points, Raptors beat Bucks",
  "body": "MILWAUKEE --  Kawhi Leonard had a simple explanation after the Toronto Raptors' latest victory.\n\n\"If you want to win, you got to play defense,\" Leonard said. \"That is every game in the NBA.\"\n\nLeonard and Pascal Siakam each scored 30 points, with Siakam setting a career high, and the Raptors beat the Milwaukee Bucks 123-116 on Saturday night in a matchup of the top two teams in the NBA standings.\n\nLeonard also matched his season high with five steals.\n\nSerge Ibaka added 25 points and nine rebounds, Fred VanVleet had a season-high tying 21 points and Danny Green 12 points and nine rebounds for Toronto which snapped a three-game losing streak to Milwaukee.\n\nToronto improved to 29-12, and Milwaukee dropped to 27-11.\n\nMilwaukee led in the first quarter, but saw the margin shrink to one at the half as Toronto started making shots and playing defense.\n\n\"I thought that we kind of took some air out of them a little bit there,\" VanVleet said. \"That was a huge way to close the half. We closed it (the second) with a 7-0 run and came out in the third quarter with another run. I thought that we were in control for the rest of the way.\"\n\nThe Bucks clung to a 57-56 lead at the half, but the Raptors had already turned the game in their favor.\n\n\"We kind of let up the second quarter going into the half,\" the Bucks Eric Bledsoe said. \"They cut it to one and we kind of let up then. We never could get our rhythm back.\"\n\nToronto opened the third with a 26-12 run, capped by Siakam's turnaround bank hook for a 63-57 lead at the 10:05 mark.\n\n\"What helped us was the beginning of that third quarter,\" Leonard said. \"We came out in the first two minutes playing well, getting stops, getting some open looks. We kept moving from there.\"\n\nAntetokounmpo tried to rally the Bucks in the fourth when he scored eight points on a pair of 3s and a layup during a 14-4 run. His three-pointer gave Milwaukee a 96-95 lead with 8:12 to play, but the Raptors answered with a 15-2 surge capped by Siakam's wide-open 3 from the corner for a 110-98 lead with 5:14 to play.\n\nGiannis Antetokounmpo had 43 points and 18 rebounds, each stat one shy of his career-high. Malcolm Brogdon added 15 points and Middleton and Bledsoe each had 14. The Bucks had won five straight.\n\nMilwaukee was coming off a 144-112 victory over Atlanta on Friday night.\n\nTIP-INS\n\nRaptors: C Jonas Valanciunas (left thumb dislocation) missed his 11th consecutive game. G Kyle Lowry (lower back pain) missed his sixth straight game. ... The last time Lowry and Leonard played together was Dec. 9 against Milwaukee.\n\nBucks: F Ersan Ilyasova scored three points in 13:23 minutes in his second game back from broken nose. ... G Sterling Brown was back after missing one game with a right ankle injury.\n\nSTATS\n\nLeanard has seven games of 30 or more points on 50.0 percent shooting or better.\n\nThe Bucks lead the season series 2-1 with one more game remaining in Toronto on Jan. 31.\n\nNICE TURNAROUND\n\nToronto had a day to rest following a 125-107 loss to the Spurs on Thursday night in Leonard's return to San Antonio.\n\n\"Tonight, executed everything in our game plan defensively and one game (Spurs) we didn't execute any of it,\" Toronto's head coach Nick Nurse said. \"Also, (we) played with some juice and some physicality. That is the way we need to play if you want to be a serious contender.\"\n\nUP NEXT:\n\nRaptors: Host Indiana on Sunday night.\n\nBucks: Host Utah on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994269.993629
}