{
  "game_id": "0022301076",
  "espn_id": "401585704",
  "date": "Mar 30, 2024",
  "matchup": "MIL @ ATL",
  "headline": "Giannis Antetokounmpo has 36 points, 16 rebounds to power Bucks past Hawks, 122-113",
  "body": "ATLANTA -- — Giannis Antetokounmpo had six dunks while scoring 36 points and the Milwaukee Bucks overcame Bogdan Bogdanovic's 38 points to beat Atlanta 122-113 on Saturday night, ending the Hawks' four-game winning streak.\n\n\r\n              Antetokounmpo added 16 rebounds and Khris Middleton scored 21 points as the Bucks snapped a two-game losing streak.\n\n\r\n              Milwaukee point guard Damian Lillard was held out for personal reasons. The Bucks had been 0-5 without Lillard this season. Lillard’s availability for the Bucks’ game at Washington on Tuesday night is unknown. \n\n\r\n              Patrick Beverley, whose status had been uncertain due to a sprained right wrist, scored 18 points as the fill-in starting point guard.\n\n\r\n              Beverley said Bucks coach Doc Rivers “was kind of hesitant” to give him a full starter's share of minutes before he received clearance for his wrist injury.\n\n\r\n              “He wanted to protect me, as a coach should,” Beverley said after playing 36 minutes and having five assists with no turnovers.\n\n\r\n              Rivers said he was happy with the ball movement provided by Beverley and others.\n\n\r\n              Antetokounmpo made 12 of 16 free throws and led the team with eight assists.\n\n\r\n              “As I said, we take him for granted,” Rivers said. “I thought he played as clean a game as he can play.”\n\n\r\n              Dejounte Murray, who scored a career-high 44 points in Atlanta's 123-122 overtime win over Boston on Thursday night for Atlanta's second win over the Celtics in four days, had 20 points, 12 assists and eight rebounds. \n\n\r\n              The Hawks made 14 3-pointers, including five by Bogdanovic.\n\n\r\n              “I was really happy with the way we played overall because they did what they do, come out and make 3s,” Rivers said of the Hawks.\n\n\r\n              Bogdanovic set a career high with 10 rebounds. He scored 17 points in the fourth quarter while sinking two 3-pointers in the final minute.\n\n\r\n              Back-to-back 3-pointers by Atlanta's De'Andre Hunter and Bogdanovic midway through the final period cut the Bucks' lead to 94-89. Middleton and Brook Lopez answered with 3s for Milwaukee to quickly push the advantage back to double figures.\n\n\r\n              The Hawks again were missing injured forwards Onyeka Okongwu (left big toe sprain) and Jalen Johnson (right ankle), complicating the already difficult challenge of defending Antetokounmpo. \n\n\r\n              “It really does require multiple players to limit his ability to get to the rim,” Hawks coach Quin Snyder said. \n\n\r\n              Forward Saddiq Bey, another part of Atlanta's regular rotation when healthy, had season-ending knee surgery this week.\n\n\r\n              Atlanta All-Star point guard Trae Young (finger) has missed 18 consecutive games. The Hawks, who are a game behind No. 9 Chicago in the East, have about two weeks to have injured players return before their likely spot in the play-in tournament.\n\n\r\n              The Hawks averaged 123.8 points in the four straight wins before being held to 45 first-half points by Milwaukee. \n\n\r\n              UP NEXT\n\n\r\n              Bucks: Visit Washington on Tuesday night.\n\n\r\n              Hawks: Visit Chicago on Monday night in a possible preview of the play-in tournament opener.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996101.728255
}