{
  "game_id": "0022300695",
  "espn_id": "401585323",
  "date": "Feb 02, 2024",
  "matchup": "CHA @ OKC",
  "headline": "Shai Gilgeous-Alexander's 31 points lead the Thunder past the Hornets 126-106",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander is proving to be much more than one of the NBA's top scorers. \n\n\r\n              Sure, he scored 31 points to help the Oklahoma City Thunder roll past the Charlotte Hornets 126-106 on Friday night. But the league's No. 3 scorer also had nine assists, five steals and three blocks.\n\n\r\n              Gilgeous-Alexander leads the league in steals with 2.3 steals per game. Lu Dort, Oklahoma City's defensive stopper, is impressed with his teammate's play on that end.\n\n\r\n              “He’s really vocal on the defensive side, just calling the coverages and all that, too,\" Dort said. \"Just him being aggressive, it just feeds off on the other guys on the team. One, just our best player doing that, and also, it is great that he’s so good at this and he does it a lot so we can go run in transition.” \n\n\r\n              Gilgeous-Alexander did his usual thing on offense as an efficient shooter. He made 11 of 15 field goals and scored at least 30 points for the ninth straight game. \n\n\r\n              He prioritized setting others up early with four assists before he scored a basket. \n\n\r\n              “On the offensive end, I thought tonight he was really on one early,” Daigneault said. \"He had as good of a blend of his play and plays for other guys as he’s (had) all season. He had an unbelievable balance there in the first half of the game.”\n\n\r\n              Chet Holmgren added 16 points for the Thunder, who have won two straight and seven of nine. Oklahoma City moved into a tie for first place in the Western Conference with Minnesota at 34-15.\n\n\r\n              Oklahoma City's offensive output came despite missing forward Jalen Williams, out with a sprained right ankle, and guard Isaiah Joe, sidelined with a bruised sternum. Williams is the team's No. 2 scorer and Joe leads the Thunder in 3-point baskets.\n\n\r\n              Rookie Brandon Miller scored 28 points and Bryce McGowens added 15 for the Hornets, who lost their sixth straight. LaMelo Ball missed his fourth straight game for the Hornets with a right ankle overuse injury.\n\n\r\n              It took 2 1/2 minutes for Charlotte to score at the start of the game. Gilgeous-Alexander had 10 points, six assists, three steals, two blocks and two rebounds in the first quarter to help the Thunder take a 39-19 lead.\n\n\r\n              In the second quarter, Gilgeous-Alexander stole the ball, then delivered a perfect bounce pass behind his back to a trailing Cason Wallace, who finished the fast break with a two-handed jam to give Oklahoma City a 68-40 lead.\n\n\r\n              Gilgeous-Alexander scored and was fouled with three seconds left in the first half. His free throw gave the Thunder a 73-42 lead at the break. The Thunder shot 69.2% from the field in the first half.\n\n\r\n              Aaron Wiggins hit a 3-pointer in the final second of the third quarter to put Oklahoma City ahead 105-72.\n\n\r\n              Charlotte center Nick Richards said the Hornets' approach made things too easy for the Thunder.\n\n\r\n              “Instead of us hitting guys first, we let them hit us first and we try to fight back into it,\" he said. \n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host Indiana on Sunday night.\n\n\r\n              Thunder: Host Toronto on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995967.980135
}