{
  "game_id": "0021901304",
  "espn_id": "401224779",
  "date": "Aug 12, 2020",
  "matchup": "IND @ HOU",
  "headline": "Turner helps Indiana hold off Harden rally to beat Rockets",
  "body": "LAKE BUENA VISTA, Fla. --  Myles Turner had 18 points, reserve Edmond Sumner added a season-high 17 and Indiana held off a late rally by Houston and James Harden to break a five-game losing streak to the Rockets, 108-104 on Wednesday.\n\nIt looked as if the Pacers had locked up the win when they went up 104-90 with 5:05 remaining. That's when Harden got Houston going, cutting it to 106-104 on with a driving basket with 27 seconds to go.\n\nHarden had 11 of Houston's 14 points during the surge.\n\nBut after Victor Oladipo missed a 3-pointer, Turner tipped out the rebound to Justin Holiday with six seconds left. Holiday hit two foul shots to finish off Indiana's first victory over Houston since February 2017.\n\nIndiana coach Nate McMillan let starters like Malcolm Brogdon and T.J. Warren rest because of lingering injuries. The coach was glad to see the rest of the lineup step up in their absence of the pair, who've combined to average 36 points in a game this season.\n\n\"I think all of our guys, it seems like when they get an opportunity to play, they've done some good things. We had a number of guys out tonight. We wanted to give some guys opportunities and they played well,\" McMillan said.\n\nHarden could not get off a final 3-pointer before the buzzer sounded. The Rockets have lost two straight for the first time since the NBA restarted the season.\n\nHarden had 45 points and tied his career high with 17 rebounds. He came an assist shy of his fifth triple-double this season. It was Harden's 21st game this season with 40 points or more.\n\nHoliday also has 18 points for the Pacers. Oladipo and Doug McDermont had 16 points apiece. Turner led the Pacers with 12 rebounds.\n\nJeff Green had 14 points for Houston. The Rockets struggled from the outside, going just 16 of 57 on 3-pointers.\n\nMcMillan said they knew Houston liked to take a lot of threes and the plan was to control the rebounds and get back quickly the other way.\n\n\"They take a lot of threes, but they miss a lot of threes,\" he said. \"What we wanted to do is make sure that we won those long rebounds. We wanted to turn those into transition points.\"\n\nMcMillan said T.J. Warren didn't play because of plantar faciitis, something that he's dealt with all season. McMillan wanted Warren to rest. The coach was unsure if Warren would play in the regular-season finale Friday.\n\nHarden said it was important for the Rockets to have a healthy Russell Westbrook back for the playoffs. Westbrook sat out after he a MRI diagnosed a quad muscle injury in his right leg.\n\n\"We've just got to continue to get better,\" Harden said. \"Guys that have an opportunity to step up have got to be ready to go out and take advantage of the minutes. We obviously know how important Russ is to everything we're trying to accomplish, so the faster he can get his body right and get back on the court, the better off we'll be.\"\n\nTIP-INS\n\nPacers: McMillan was rewarded with a one-year extension to his contract that was set to expire after next season. ... Malcolm Brogdon, who had 12 points in Monday's loss to Miami, sat out against Houston with a sore neck.\n\nRockets: Westbrook won't play Friday and will be reevaluated before the playoffs. \"He's definitely going to be out Friday,\" D'Antoni said. \"Then we'll see.\" ... Houston had not lost consecutive games since dropping four straight in March before the pandemic shut down the NBA.\n\nLOCKED IN: Indiana is locked into fifth place and a matchup with No. 4 seed Miami in the Eastern Conference playoffs. The Heat have won all three games against Indiana this season, including on Monday.\n\nUP NEXT\n\nPacers: Play Miami on Friday.\n\nRockets: Play Philadelphia on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995826.129022
}