{
  "game_id": "0022200286",
  "espn_id": "401468441",
  "date": "Nov 26, 2022",
  "matchup": "TOR vs. DAL",
  "headline": "Anunoby scores 12 of his 26 in 4th, Raptors top Mavs 105-100",
  "body": "TORONTO -- — O.G. Anunoby scored 12 of his 26 points in the fourth quarter, Fred VanVleet also had 26, and the Toronto Raptors beat Dallas 105-100 Saturday, snapping a four-game losing streak against the Mavericks.\n\n\r\n              Chris Boucher scored a season-high 22 points and had 13 rebounds as the Raptors improved to 7-2 at home.\n\n\r\n              Luka Doncic scored 24 points and Dorian Finney-Smith had 16 as the Mavericks lost their third straight. Dallas is 1-6 on the road, with a visit to Giannis Antetokounmpo and the Bucks on tap Sunday.\n\n\r\n              “There’s no panic here,” Dallas coach Jason Kidd said. “We’ve got to start continuing to be consistent on both sides of the ball.”\n\n\r\n              Doncic, the NBA’s leading scorer, shot 8 for 15, going 2 of 4 from 3-point range. He had nine assists and seven rebounds.\n\n\r\n              “He did what he was supposed to do,” Kidd said. “He had two on him. That just shows the maturity. He didn’t force anything, he just accepted the double team.”\n\n\r\n              Doncic said the Mavericks need to be more attack-minded when he’s being double-teamed.\n\n\r\n              “If they’re going to put two or three on the ball, we’ve just got to be aggressive,\" Doncic said, \"get to the rim, dunk it, pass out and just keep trusting the shots.”\n\n\r\n              Spencer Dinwiddie scored 15 points for Dallas, Maxi Kleber had 11 and Christian Wood 10.\n\n\r\n              Anunoby played the entire second half, making 7 of 13 shots and scoring 20 points while also defending Doncic at the other end.\n\n\r\n              “I think he’s going to sleep well tonight,” Raptors coach Nick Nurse said of Anunoby.\n\n\r\n              Kleber called Anunoby ”a threat on all levels.”\n\n\r\n              “He can shoot the ball from outside, he’s really great on post-ups, he’s physical,” Kleber said.\n\n\r\n              Dallas trailed 81-73 to begin the fourth quarter but Finney-Smith tied it 90-all on a 3-pointer with 3:48 left. Juancho Hernangomez scored to restore Toronto’s lead, and Anunoby made a pair at the line to make it 95-92 with 2:12 remaining.\n\n\r\n              Doncic scored with 26 seconds left to cut it to 101-100, but Thad Young answered with a pair of free throws. Dallas used its final timeout to draw up a play, but Finney-Smith turned the ball over and Anunoby was fouled, sealing it at the line.\n\n\r\n              VanVleet returned for Toronto after sitting out Wednesday’s loss to Brooklyn because of a non-COVID illness, but Scottie Barnes missed his second straight game because of a sprained left knee.\n\n\r\n              The banged-up Raptors were also without Pascal Siakam (straight right adductor), Precious Achiuwa (left ankle), Dalano Banton (left ankle), and Otto Porter Jr. (dislocated left toe).\n\n\r\n              Dallas led by as many as 15 in the opening quarter, scoring 11 points off six Toronto turnovers to lead 29-24 after one. The Raptors led 54-52 at halftime.\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Kleber returned after missing the past four games because of a sore back.\n\n\r\n              Raptors: Boucher had six rebounds in the first quarter, one more than the entire Mavericks team. … Hernangomez matched his season high with 10 points. … Outscored Dallas 25-5 in second-chance points. … Had 17 offensive rebounds to Dallas’ four.\n\n\r\n              FINDING THEIR RANGE\n\n\r\n              Dallas shot 1 for 9 from 3-point range in the second quarter and went 1 for 7 in the third. The Mavericks finished 11 for 39.\n\n\r\n              “It’s about making 3s in today’s game,” Kidd said. “We’re able to get to the paint, we’re able to get to the rim and finish but right now we’re just not shooting the ball straight.\"\n\n\r\n              PICK ME UP\n\n\r\n              Doncic helped Anunoby to his feet with the ball in play after the two stars got tangled up during a second-half possession.\n\n\r\n              “I think he’s probably one of the nicest dudes in the league,” Doncic said. “He never talks trash, he never does anything. I tripped him, not on purpose, so that’s why I helped him up.”\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Visit Milwaukee on Sunday night.\n\n\r\n              Raptors: Host Cleveland on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994091.0765738
}