{
  "game_id": "0021601201",
  "espn_id": "400900579",
  "date": "Apr 09, 2017",
  "matchup": "MEM vs. DET",
  "headline": "Pistons use 3-point barrage in 4th to top Grizzlies 103-90",
  "body": "MEMPHIS, Tenn. --  Detroit's reserves used some sharp accuracy from long range in the fourth quarter to gain a victory.\n\nThe Pistons shot 6 of 7 on 3-pointers in the final period and defeated the playoff-bound Memphis Grizzlies 103-90 Sunday night.\n\n\"We were playing hard,\" Pistons coach Stan Van Gundy said. \"The ball just has to go in, and we finally started making some shots. The game looks a lot different when the ball starts going in the basket.\"\n\nReggie Bullock and Boban Marjanovic each scored 14 points to lead the Pistons. Marjanovic also had 10 rebounds.\n\nWhile the latter stages of the third quarter got the Pistons jumpstarted, the shooting was the key to the fourth. Detroit, which trailed by 12 early in the third period, using the shooting from outside the arc to pull away from Memphis, which played its reserves in the fourth with the seventh seed in the Western Conference secured.\n\n\"The third quarter, we made that run against their main guys,\" Van Gundy said. \"That was impressive. Then, obviously (Memphis coach David Fizdale) shut it down, and we played against younger guys.\"\n\nDarrun Hilliard scored 11 of his 13 points in the fourth, and Tobias Harris finished with 12 despite not playing in the final frame as Van Gundy, like Fizdale, relied on his bench down the stretch.\n\nMike Conley led Memphis with 15 points, while Marc Gasol added 13 and JaMychal Green had 12. In addition to sitting his starters in the final quarter, Fizdale also gave reserve forward Zach Randolph the night off for \"rest.\"\n\n\"We knew coming into the game, even if we played our guys at full minutes, the Pistons are no pushovers,\" Fizdale said.\n\nMemphis, as it did against the New York Knicks two nights earlier, struggled to control the game after building its 12-point lead immediately after halftime.\n\nThe Grizzlies fumbled their way to eight turnovers in the first nine minutes of the third quarter, allowing the Pistons to get within one possession several times. Detroit couldn't capitalize initially because it committed a half-dozen over the same span.\n\nBut Bullock's 3-pointer gave Detroit a 66-65 lead. That came as Memphis went more than four minutes without scoring.\n\nThe anemic Memphis performance allowed Detroit to outscore the Grizzlies 27-10 in the third and carry a 75-67 lead into the fourth.\n\nAnd the Grizzlies never retook the lead the rest of the way.\n\n\"I thought the way we closed out as a team was real big,\" said Henry Ellenson, who converted a pair of 3-pointers in the fourth.\n\nTIP-INS\n\nPistons: Harris connected on a floater with 4:51 left in the first quarter to record his second basket of the game and 2,000th bucket of his career. . The Pistons won at FedExForum for the first time since the 2009-10 season opener -- a string of six straight losses in Memphis. ... Bullock's 14 points were one shy of his season high and two short of his career best.\n\nGrizzlies: Reserve G Troy Daniels left in the second quarter with a left knee injury. He returned in the second half. ... The 10 points in the third quarter marked the second-lowest quarter of the season for Memphis. The Grizzlies scored nine in the fourth against New Orleans on Nov. 2.\n\nPROBABLY NO DAYS OFF: The Grizzlies close out their season Wednesday against Dallas, and Fizdale said the rotation and playing time will be similar to Sunday. \"I don't even know if we're giving a guy the game off,\" Fizdale said. \"We want to keep them in rhythm and keep the cardio up and still let them get the contact and execution and all the stuff you get with playing a real game.\"\n\nUP NEXT\n\nPistons: Face the Washington Wizards at home on Monday.\n\nGrizzlies: Close out their season Wednesday with a home game against the Dallas Mavericks.",
  "source": "espn_api",
  "crawled_at": 1764995557.560693
}