{
  "game_id": "0022200480",
  "espn_id": "401468635",
  "date": "Dec 23, 2022",
  "matchup": "LAC @ PHI",
  "headline": "Embiid, Harden help 76ers beat Clippers for homestand sweep",
  "body": "PHILADELPHIA -- — Joel Embiid scored 44 points, James Harden had a career-high 21 assists in a triple-double and the Philadelphia 76ers overcame a 20-point first-half deficit to beat the Los Angeles Clippers 119-114 on Friday night.\n\n\r\n              “That’s big-time for us. That just shows that we stayed together, we trust each other, and we know what we have to do,” Joel Embiid said about the comeback. “We started off the game soft, especially defensively, and as soon as we turned it up it changed the whole game.”\n\n\r\n              Harden also had 20 points and 11 rebounds to help Philadelphia sweep a seven-game homestand and improve to 19-12. Harden tied Wilt Chamberlain and Maurice Cheeks for the franchise game assist record.\n\n\r\n              “That’s some great company. Mo Cheeks was one of my coaches (in Oklahoma City), and then Wilt, I feel like he has every record,” Harden said. “So just being in the conversation with some of the best basketball players to ever touch a basketball is always a blessing.”\n\n\r\n              Harden’s performance, approach to the game and the evolving chemistry between Embiid and Harden drew praise from the coach Doc Rivers.\n\n\r\n              “This is a generational scorer that has taken and decided to be a point guard, who still scores, but to be a point guard for this team,” Rivers said. “That’s hard to do. A lot of people, most people, can’t do that, or will not do it is a better way of saying it. The fact that he is willingly doing it, running the team, organizing us, is huge for us.”\n\n\r\n              Rivers took a timeout after Nicolas Batum’s 3-pointer gave the Clippers a 108-107 lead with four minutes left. The 76ers then had a 10-0 run.\n\n\r\n              Kawhi Leonard had 28 points on 12-of-19 shooting for Los Angeles. Paul George added 22 points and Norman Powell had 21. The 76ers limited George to five points in the second half, led by a standout performance from De’Anthony Melton.\n\n\r\n              “We knew how good of an offensive team they were,” Harden said. “They caught us in that first half. The second half we picked up our defensive intensity, got out in transition and it made the game a lot easier for us.”\n\n\r\n              TIP-INS\n\n\r\n              Clippers: John Wall sat out because of a sprained right ankle.\n\n\r\n              76ers: Harden’s previous career high for assists was 17, accomplished 10 times. Before the game, Rivers said Tyrese Maxey is getting close to returning from a fracture in his left foot that has kept him out since Nov. 18.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Detroit on Monday night.\n\n\r\n              76ers: At New York on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994979.020857
}