{
  "game_id": "0021800185",
  "espn_id": "401070866",
  "date": "Nov 11, 2018",
  "matchup": "HOU vs. IND",
  "headline": "Harden's 40 lifts Rockets to 1st home win 115-103 over Indy",
  "body": "HOUSTON --  It's more than three weeks into the season and the Houston Rockets finally got their first home win on Sunday night.\n\nWith the hole they're in early, they'll need plenty more to dig their way out.\n\nJames Harden scored a season-high 40 points and Chris Paul added 26 to help the Rockets to a 115-103 victory over the Indiana Pacers on Sunday night.\n\n\"It's nice to get a win,\" Paul said. \"We've obviously been struggling ... but we've got to keep building.\"\n\nThe Rockets, who had lost the last two games of a season-long five-game road trip, dropped their first four home games. They're 5-7 this season and in 12th place in the Western Conference.\n\nHouston was up by 10 with about four minutes left after five quick points by the Pacers, but Harden made two free throws after that to stretch the lead. The Pacers got within 8 on a basket by Cory Joseph with about 90 seconds left, but Paul made a layup a few seconds later to put the game out of reach.\n\nVictor Oladipo had 22 for the Pacers, who have lost three of their last four games.\n\n\"We knew they were very capable of getting hot even though they hadn't shot the ball well early this season,\" Indiana coach Nate McMillan said. \"We knew they were very capable and tonight they did. It was tough matchups trying to stop those guys.\"\n\nThe win comes as the Rockets deal with a disappointing start to the season and rumors and reports about Carmelo Anthony's status and future with the team. Anthony, who is in his first year in Houston, sat out for the second straight game with an undisclosed illness on a day the New York Times had a sourced report that said he had been told he would soon be waived.\n\nGeneral manager Daryl Morey said before the game that the report was \"inaccurate\" and that singling Anthony out as the cause of Houston's struggles was unfair.\n\nThe Rockets, who entered the game ranking near the bottom of the league with a 3-point shooting percentage of just 31.7, shot 42.6 percent from long-range and made a season-high 20 3s on Sunday night. Harden had eight and Paul added five to lead the way.\n\n\"When we're like that we're going to score a bunch of points and if ... our defense can keep improving then we're the team that we want to be,\" coach Mike D'Antoni said.\n\nHouston had a big lead for most of the second half and was up by 21 entering the fourth quarter after Paul and Harden had piled up 55 points combined in the first three quarters.\n\nThe Pacers opened the fourth with an 11-2 run, with the last five points from Oladipo to cut the lead to 104-92 with about 7  1/2 minutes left.\n\nBut Harden, who finished with nine assists and seven rebounds, made all of Houston's points in a 5-2 run to stretch the lead and 109-94.\n\nThe Rockets led by 22 at halftime but Indiana scored the first 11 points of the third quarter to cut the lead to 76-65. Darren Collison made two 3-pointers in that span and Oladipo added another one.\n\nHouston finally scored its first points of the second half when P.J. Tucker made a 3-pointer with about 9  1/2 minutes left in the third.\n\nBut the Rockets couldn't get much going after that and the Pacers scored five straight points later in the period to cut the lead to 84-74 with about five minutes remaining in the third.\n\nHarden got hot after that, making 3-pointers on consecutive possessions to power a 12-3 spurt that extended the lead 97-77 about three minutes later.\n\nTIP-INS\n\nPacers: Oladipo received a technical foul in the third quarter for arguing with a referee after fouling Paul. ... Bojan Bogdanovic added 20 points and had six assists. ... Collison had 13 points.\n\nRockets: Clint Capela had 18 points and seven rebounds. He bruised his knee in a collision with Oladipo, but D'Antoni said he should be OK.  ... Gerald Green sat out with a sprained right ankle. ... Nene, who has not played this season, remains out with a strained right calf.\n\nTHEY SAID IT\n\nPaul on what he's seen from Anthony in his time in Houston: \"Melo's been great here. That's like a brother to me. I don't know what's being said or whatnot but Melo's been great working hard every day.\"\n\nUP NEXT\n\nPacers: Host Miami on Friday night.\n\nRockets: Visit Denver on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995319.5194628
}