{
  "game_id": "0022000510",
  "espn_id": "401267670",
  "date": "Feb 26, 2021",
  "matchup": "ATL @ OKC",
  "headline": "Shades of red: Thunder beat Hawks after uniform mix-up",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 24 points and the Oklahoma City Thunder beat the Atlanta Hawks 118-109 on Friday night after changing uniforms at halftime because a mix-up left the teams wearing similar colors at the start.\n\n\r\n                    The Thunder began the game wearing their sunset orange uniforms while the Hawks wore red, making it difficult to distinguish between the teams.\n\n\r\n                    “You could definitely tell playing on the court,” Oklahoma City's Kenrich Williams said. “Just kind of just -- you see somebody, and it’s like, ‘Oh. That’s not my teammate.’”\n\n\r\n                    Oklahoma City said in a statement that the Hawks wore the incorrect uniform color. The team said the league should have caught the error, but because the Hawks only brought red uniforms on their trip, the Thunder changed to white for the second half.\n\n\r\n                    “I certainly didn’t notice it or even think about it, to be honest with you,” Thunder coach Mark Daigneault said. “It was a league mandate that we just reacted to. They made me aware of it at halftime. When I went into the locker room, the guys were in white uniforms.”\n\n\r\n                    Atlanta Hawks coach Lloyd Pierce was in no mood to talk about uniforms after the loss. He felt his team had a poor approach to the game.\n\n\r\n                    “A lot of technical things, a lot of just effort things that we need to clean up,\" he said. \"We need to have that sense of urgency. We need to communicate a lot better than we did tonight.”\n\n\r\n                    Lu Dort scored 19 points and Darius Bazley added 18 points and 12 rebounds for the Thunder.\n\n\r\n                    John Collins scored 25 points and Clint Capela had 17 points and 21 rebounds for the Hawks. Trae Young, who played at the University of Oklahoma, finished with 17 points on 7-for-21 shooting.\n\n\r\n                    The Thunder were fine before the uniform switch — they shot 60% in the first half to lead 63-55 at the break. Oklahoma City got off to a strong start in white and led 96-80 after three quarters.\n\n\r\n                    The Hawks cut the deficit to six in the fourth quarter, but the Thunder regained control. Bazley drove to the hoop, rose, clutched to his left, then threw down a monster two-handed jam that put Oklahoma City up 116-105.\n\n\r\n                    “He’s a freak athlete,\" Gilgeous-Alexander said. \"He can do so many things in the air and get so high. He just made a regular basketball play for Baze, which is kind of crazy.” \n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Forward Danilo Gallinari helped the Thunder make the playoffs last season but was traded in the offseason. He finished with eight points in 25 minutes. ... Collins had 12 points and five rebounds in the first quarter.\n\n\r\n                    Thunder: Center Al Horford rested on the front end of Oklahoma City’s back-to-back. ... Guard Hamidou Diallo sat out with right groin soreness. ... Guard Ty Jerome scored for the first time as a member of the Thunder. He was called up from Oklahoma City's G League team and finished with nine points, seven assists and five rebounds in 22 minutes.\n\n\r\n                    STAT LINES\n\n\r\n                    Theo Maledon’s 12 assists tied Russell Westbrook’s Thunder rookie single-game record, set on Jan. 7, 2009 against Minnesota.\n\n\r\n                    Daigneault said Maledon used his speed to put the Hawks in binds.\n\n\r\n                    “That’s kind of the mode that we’d like him to play in is foot on the gas, stay aggressive, don’t worry about mistakes, gain advantages. Because when he does, he can obviously really pass the ball.”\n\n\r\n                    QUOTABLE\n\n\r\n                    Daigneault on Gilgeous-Alexander being left off the All-Star rosters: “There’s obviously more great players than there are All-Star spots, so every year, there’s people that are worthy that don’t get in because there’s a fixed number of spots, and I think we had one of those guys.”\n\n\r\n                    UP NEXT\n\n\r\n                    The Hawks visit the Miami Heat on Sunday.\n\n\r\n                    The Thunder host the Denver Nuggets on Saturday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997830.006221
}