{
  "game_id": "0021800841",
  "espn_id": "401071514",
  "date": "Feb 11, 2019",
  "matchup": "CHA @ IND",
  "headline": "Pacers use fast start, closing flurry to beat Hornets 99-90",
  "body": "INDIANAPOLIS --  The Indiana Pacers signed Wesley Matthews to make a difference.\n\nThey didn't necessarily expect it show up in his debut.\n\nJust two days after clearing waivers, the veteran guard scored eight points, had five rebounds and three assists and beat the shot-clock buzzer with the biggest basket of the game -- a 28-footer to help put away the Charlotte Hornets 99-90. The Pacers have won six straight -- all without two-time All-Star Victor Oladipo.\n\n\"We thought he (Matthews) was great,\" coach Nate McMillan said. \"Part of the agreement was that he would start when he came and we were OK with that because we thought bringing that type of talent to this roster and having a guy like that going down the stretch and in the playoffs with that type of experience, we were going to need it.\"\n\nIt has been a whirlwind week for the veteran guard, who was traded Thursday from Dallas to New York and was subsequently released. After clearing waivers Saturday, the Pacers announced Sunday they had signed Matthews.\n\nBy Monday night, he wasn't just wearing the blue-and-gold; he was starting.\n\nInitially, Matthews looked understandably out of sync. But as Matthews played on, he emerged as the difference-maker McMillan expected.\n\nWhile the stat line wasn't spectacular -- eight points, five rebounds and three assists -- his impact was huge. The long shot he made with 3:57 to play extended Indiana's lead to 92-82. And his second 3, with 2:15 left, gave Indiana a game-sealing 97-85 cushion.\n\n\"He'll take his shots, you see him, he struggled with his shot a little at the beginning but then he hits (two 3-pointers) toward the end that closes it out,\" Darren Collison said after finishing with 13 points and eight assists. \"That's what he brings to the table.\"\n\nThree other Indiana players reached double figures, including Myles Turner, who had 18 points, eight rebounds and three blocks. Thaddeus Young added 11 points, eight rebounds and six assists.\n\nCharlotte was led by Kemba Walker, who scored 26 of his 34 points in the second half when the Hornets attempted to rally from a 16-point halftime deficit.\n\nWalker scored half of the Hornets' points during a 10-3 spurt to open the third quarter, made three consecutive free throws to get Charlotte within 64-57 and then made 3 with 1:02 left in the quarter to cut the deficit to 72-71.\n\nBut Turner and Collison closed out the third with back-to-back baskets, Indiana scored the first eight points of the fourth and Matthews closed it out with his two big shots.\n\n\"Everybody's got to do their job,\" Hornets coach James Borrego said. \"Tonight we didn't have all of our guys on board.\"\n\nTIP-INS\n\nHornets: Walker has scored at least 30 points in five consecutive games. He also had nine rebounds. ... Jeremy Lamb had 21 points and Cody Zeller added 18 points and nine rebounds while returning to his home state.  ... Tony Parker sat out with a sprained back. ... The Hornets were 7 of 40 on 3s, 25 of 33 on free throws and shot a season-low 32.2 percent. ... Charlotte lost the season series 2-1 and only has one series win since 2007-08.\n\nPacers: The Pacers have won at least six straight three times this season, their highest single-season total since 2003-04. ... McMillan moved within three wins of tying Isiah Thomas for No. 6 on the Pacers' NBA franchise career victory list (131). ... Bojan Bogdanovic had 14 points. ... The Pacers were outrebounded 21-5 on the offensive end but were only outscored 16-8 in second-chance points.\n\nFAST START\n\nIndiana never trailed after taking a 12-11 lead in the first quarter. But the fast starts have become a staple since losing their first four games without Oladipo.\n\nThey charged out to a 32-19 lead after one, their fifth straight game with at least 30 points in the first quarter, and extended the margin to 39-19 early in the second.\n\n\"It's encouraging when you get out to good starts like this, but it's really (all) defense,\" Turner said. \"I think we held them to 38 points in that first half.\"\n\nTHEY SAID IT\n\nHornets: \"They're one of the best defensive teams, if not the best, in the league,\" Borrego said.\n\nPacers: \"I'm happy to see them, happy to see them playing well now. I don't expect anything less than that,\" Oladipo said on a conference call Monday morning.\n\nUP NEXT\n\nHornets: Hope to extend a 13-game winning streak over the Magic when they visit Orlando on Thursday.\n\nPacers: Will chase a fifth consecutive home win against Eastern Conference-leading Milwaukee on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994367.588674
}