{
  "game_id": "0021501007",
  "espn_id": "400828894",
  "date": "Mar 16, 2016",
  "matchup": "DET vs. ATL",
  "headline": "Hawks hold off Pistons for 118-114 win",
  "body": "AUBURN HILLS, Mich. -- Paul Millsap made a layup while being fouled to put Atlanta ahead with 3:51 to play.\nThat was the last field goal the Hawks needed.\nAtlanta made only free throws from that point on, but the Hawks defended well enough to hold off the Detroit Pistons 118-114 on Wednesday night. What was an offensive showcase for much of the night became a tight, tedious affair down the stretch, with Atlanta fouling Detroit star Andre Drummond throughout the fourth quarter.\n\"I thought there was great offense the first half. Both teams tightened up defensively and we were able to make enough plays and we were able to execute some things,\" Hawks coach Mike Budenholzer said. \"They played really well tonight, and we were fortunate to find a way to win.\"\nJeff Teague scored 22 points, including two crucial free throws with 17.9 seconds left, and Al Horford added 21 for the Hawks.\nAtlanta has won six of seven and pulled within a half-game of first-place Miami in the Southeast Division. The Pistons (34-34) are tied with Chicago (33-33) for the final playoff spot in the Eastern Conference.\nThe Pistons led by 11 in the third, but Atlanta wiped out that deficit before the quarter was even over, and the game was tight for most of the fourth. Drummond's free throw put the Pistons up 104-103, but Millsap answered with a three-point play.\nThat started a 10-0 run that gave Atlanta a 113-104 lead, but the Hawks let the Pistons back in the game. Marcus Morris cut the lead to two with a three-point play with 18.8 seconds remaining, but Teague's pair of free throws made it 118-114, and neither team scored after that.\n\"They are tough, because the ball is always moving and they do a great job of setting screens,\" Detroit guard Reggie Jackson said. \"It is tough to keep up with them.\"\nDrummond had 18 points and 18 rebounds, but he went only 8 of 17 from the free throw line, and the Hawks were more than willing to foul him.\nDetroit was playing the opener of a nine-game homestand that will be crucial to the Pistons' playoff hopes. Detroit was coming off a 43-point loss to Washington on Monday.\nThe Hawks made their first five shots from the field, and some early Detroit turnovers had the Pistons trailing 12-7 and coach Stan Van Gundy calling a timeout. Detroit bounced back nicely from that start, shooting 63 percent for the first quarter.\nThe Pistons led 62-61 at halftime.\nDELIBERATE FOULS\nDrummond attempted 12 free throws in the fourth quarter, making half of them. Van Gundy said he should have probably gone to backup center Aron Baynes sooner to put a stop to all the fouling.\n\"He was making one consistently, and we were getting some stops for a while,\" Van Gundy said. \"But I probably rode that too long. I should have gone to Aron sooner.\"\nSHUT DOWN\nAtlanta shot 7 of 22 in the fourth quarter, but Detroit wasn't much better at 7 of 19.\n\"They came out firing, they played really well tonight,\" Horford said. \"I just felt like in the fourth our defense, the intensity turned up a little bit.\"\nTIP-INS\nHawks: Detroit figured to have a big advantage on the boards, but Atlanta ended up with eight offensive rebounds, only one fewer than the Pistons had.\nPistons: Tobias Harris scored 19 points, and Jackson added 17 points and 10 assists. ... This is the start of the longest homestand in franchise history for Detroit. In 1971, the Pistons went nine straight games without being the road team, but one of them was at a neutral site.\nUP NEXT\nHawks: Host Denver on Thursday night.\nPistons: Host Sacramento on Friday night.\n---\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994902.944214
}