{
  "game_id": "0021601139",
  "espn_id": "400899396",
  "date": "Apr 01, 2017",
  "matchup": "ORL @ BKN",
  "headline": "Lopez leads Nets over Magic, 121-111",
  "body": "NEW YORK --  The Brooklyn Nets dominated inside the paint and off the bench to beat the Orlando Magic.\n\nBrook Lopez scored 30 points and Trevor Booker had a season-high 23 in a reserve role to lead the Nets to a 121-111 victory on Saturday.\n\n\"That must have been Booker's best game of the year, probably,\" Jeremy Lin said. \"He was incredible with the energy.\"\n\nSean Kilpatrick added 15 points for the Nets, who snapped a two-game losing streak. Booker and Kilpatrick helped Brooklyn's bench outscore Orlando's 72-16.\n\nBrooklyn also had a season-high 72 points in the paint.\n\n\"Brook is really hard to guard down there,\" Lin said. \"We keep trying to find ways to exploit the defense with his size and his touch. I think he's finding a great balance inside and outside. I felt like he really made his presence known tonight.\"\n\nElfrid Payton had 20 points, 11 assists and 11 rebounds for his fifth triple-double of the season for Orlando, which has lost four straight games. Nikola Vucevic had 27 points and 11 rebounds, while Aaron Gordon finished with 22 points and 15 boards.\n\n\"I think we were just a little step slow today,\" Payton said. \"They were really driving the paint. Just hard drive after hard drive and kick out until they got something they liked.\"\n\nBrooklyn opened the fourth quarter on an 11-0 run to take a 100-89 lead and never looked back.\n\n\"I think Brooklyn's bench came in and took over the game during that stretch to start the fourth quarter to build a big lead,\" Magic coach Frank Vogel said. \"I credit their bench.\"\n\nOrlando rallied from a seven-point deficit at halftime to tie the score at 89 heading into the fourth quarter. Vucevic scored 12 points in the third.\n\nBrooklyn took a 60-53 lead into halftime. Lopez led Brooklyn with 18 points while Gordon and Vucevic led Orlando with 13 points apiece at the half.\n\nOrlando opened the game with a 15-5 run before Brooklyn rallied to tie the score at 33 apiece after the first quarter.\n\nTIP-INS\n\nMagic: Vogel has been impressed with Terrence Ross since arriving from Toronto in a midseason trade. \"He's exceeded our expectations,\" Vogel said. \"We knew he was a good scorer off the bench. We're using him as a starter and with heavy minutes. He's a dynamic offensive player with his 3-point shooting and you can put the ball in his hands and he makes good decisions. He can attack long closeouts and get to the rim too with athleticism. He's multidimensional offensively and one of our better perimeter defenders as well.\" . Jeff Green (sore lower back) was out.\n\nNets: Brooklyn doesn't plan on resting veteran players. \"We're not going to rest,\" coach Kenny Atkinson said. \"I've been saying how important I think it is for us to finish this season strong and I do think seeing more of Jeremy together with the group is helpful. Our mentality is to have positive momentum heading into this important offseason.\" ... Quincy Acy (sore left ankle) and Joe Harris (sprained left shoulder) were out.\n\nBENCH BUNCH\n\nBrooklyn's bench came in averaging 45.5 points, second in the league to the Lakers' 48.0. The 72 points Saturday was the Nets' third-highest total this season. They had 81 points on March 23 at Phoenix and 73 on Jan. 20 at New Orleans.\n\nUP NEXT\n\nMagic: Visit Cleveland on Tuesday, which will conclude a three-game road trip.\n\nNets: Host Atlanta on Sunday. Brooklyn then hits the road four of the final five games of the regular season.",
  "source": "espn_api",
  "crawled_at": 1764995810.876776
}