{
  "game_id": "0021301220",
  "espn_id": "400490093",
  "date": "Apr 16, 2014",
  "matchup": "OKC vs. DET",
  "headline": "Kevin Durant pours in 42 as Thunder clip Pistons for No. 2 seed",
  "body": "OKLAHOMA CITY -- The Detroit Pistons had Kentavious Caldwell-Pope. The Oklahoma City Thunder had Kevin Durant. Even on a career night for Caldwell-Pope, advantage Oklahoma City.\nDurant scored 42 points, including 21 in the fourth quarter, and the Thunder secured the No. 2 playoff seed in the Western Conference, rallying from 10-point fourth-quarter deficit to beat the Pistons 112-111 Wednesday night.\nOklahoma City (59-23) had lost two straight to put itself in the must-win situation in the regular-season finale to earn the No. 2 seed.\nDurant rallied the Thunder while recording his 14th 40-point game of the season. He drove for the go-ahead dunk with 16.5 seconds left and won a tip over Greg Monroe with 1.8 seconds to go after a scramble for a loose ball resulted in a jump ball in Detroit's end. Detroit's Brandon Jennings could only manage a 30-foot heave at the buzzer that banged off the rim.\n\n\"We just figured it out,\" Durant said. \"We got it done. It wasn't the best game. We didn't play well defensively. We didn't shoot the ball well offensively. But there's something about just getting it done, having that willpower, having that fight in you, no matter what. It was a tough game, we persevered and we got a good win.\"\nThe Thunder extended their winning streak over Detroit (29-53) to nine games, dating to December 2008.\nCaldwell-Pope scored 30 points for the Pistons (29-53), while Monroe had 22, Kyle Singler added 20 and Andre Drummond recorded his ninth straight double-double to end the season for Detroit, finishing with 22 points and 13 rebounds.\n\"Our guys played their hearts out, competed from the opening tip,\" Detroit coach John Loyer said. \"I feel terrible for them because they deserved to win the game. They did anything we asked them to do tonight. Some guys stepped up and made some incredible shots and they put together 48 minutes of as good of basketball as we can play.\"\nRussell Westbrook added 22 points for Oklahoma City, which will play Memphis in the first round of the playoffs. It was the ability of Westbrook, and especially Durant, to attack the rim in the fourth quarter that made the difference. Durant's fourth quarter left Loyer almost speechless.\n\"He's one of the top one or two players in the world,\" Loyer said. \"That's what he did.\"\nFor much of Wednesday, the Thunder looked and played like a tired team. Oklahoma City's late-season defensive issues were on full display, as the Pistons shot 50.6 percent from the field and Caldwell-Pope joined other non-marquee players such as Jodie Meeks (Los Angeles Lakers), Gerald Green (Phoenix Suns) and Tyreke Evans (New Orleans Pelicans) in enjoying a career night against the Thunder.\nOklahoma City trailed for most of the first half before taking a one-point lead twice in the third quarter. Detroit went on a 15-7 run and took an 87-79 lead on a basket by Jonas Jerebko with 5 seconds left in the quarter. Detroit led 94-84 with 10:13 left in the game after a basket by Monroe.\nBut Durant's offensive flurry cut into that gap and the Pistons didn't score a basket in the final 3:17 or at all after Jennings hit two of three free throws with 2:07 left.\nOn the Pistons' final possession, the ball found its way to Jerebko, but he lost the handle as Thunder players slapped at the ball and officials ended up calling a tie ball.\nCaldwell-Pope hit four 3-pointers in the first half -- making one over the outstretched arm of the 6-foot-10 Durant -- and eclipsed his previous career high of 15 points by the 5:27 mark of the second quarter. His next basket put the Pistons ahead 48-37 with 4:52 left in the first half and hushed the crowd at Chesapeake Energy Arena.\nDurant, who was 2 of 8 from the field to that point, hit two free throws, then drained a 3-pointer to start a 17-7 run by Oklahoma City. Westbrook scored seven points in the final 2:41 and Durant drained an 18-foot jumper in the final second to pull the Thunder within 55-54.\nGame notes\nDrummond set the Pistons' record for highest field-goal percentage in a season, finishing at 62.3 percent. Dennis Rodman had held the previous team record of 59.5 percent, set during the 1988-89 season. ... Kendrick Perkins was called for a technical foul by official Tony Brothers with 8:01 left in the third quarter when he protested after picking up his fifth foul. ... The Thunder recorded their 130th straight regular-season sellout at Chesapeake Energy Arena, which seats 18,203 fans.",
  "source": "espn_api",
  "crawled_at": 1764992820.003019
}