{
  "game_id": "0022200323",
  "espn_id": "401468478",
  "date": "Nov 30, 2022",
  "matchup": "IND @ SAC",
  "headline": "Monk and Barnes score 22 each, Kings beat Pacers",
  "body": "SACRAMENTO, Calif. -- — Harrison Barnes and Malik Monk each scored 22 points and the Sacramento Kings beat the Indiana Pacers 137-114 on Wednesday night to snap a three-game losing streak.\n\n\r\n              Monk has scored 20 points or more in five games this season for Sacramento (11-9).\n\n\r\n              “Malik was fantastic,\" Kings coach Mike Brown said. \"He should start getting some mention for that Sixth Man of the Year stuff. Especially if we keep playing well.”\n\n\r\n              Prior to the three-game skid, the Kings had won seven straight games and are off to their best 20-game start since the 2004-05 season. The Kings were 14-6 that year. Domantas Sabonis had 11 points, 10 rebounds and seven assists. De'Aaron Fox added 19 points.\n\n\r\n              “We were excited to play this game,” Keegan Murray said. “We knew that it would be a big turnout.”\n\n\r\n              Jalen Smith and Bennedict Mathurin both scored 22 points for Indiana (12-9). \n\n\r\n              Buddy Hield scored 17 points. Tyrese Haliburton finished with nine points and 10 rebounds.\n\n\r\n              “Kings outplayed us tonight,” Haliburton said. “They're a good team.”\n\n\r\n              “Tough game,” Pacers coach Rick Carlisle said. “This game is on me. I didn’t have them prepared for what was coming.”\n\n\r\n              The Kings outscored the Pacers 31-8 in fast break points.\n\n\r\n              “The transition points really tell the story of the game, Carlisle said. “We were a step slow.”\n\n\r\n              SACRAMENTO REUNION\n\n\r\n              Hield and Haliburton returned to Sacramento for the first time since being traded to the Pacers last February. Hield and Haliburton faced the Kings during the spring in Indiana. Haliburton was the 12th overall pick in the 2020 NBA Draft. Hield is the Kings’ all-time leader in 3-point makes with 1,248.\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Haliburton was given a technical foul with 3:33 left in the second quarter... Indiana coming in had won seven of their last nine. ... The Pacers were given a technical foul late in the fourth quarter for a mandatory timeout. They used all of their timeouts prior to the quarter.\n\n\r\n              Kings: F Trey Lyles missed his second consecutive game with a non-COVID illness. ... Terence Davis was given a technical foul with 6:14 left in the first half. ... Sacramento went 9-5 during the month of November. ... Kings have scored over 100 points in every game this season. ... Kings are 8-1 when Barnes scores 13 or more points... Sacramento had a season-high 58 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Travel to Utah to play the Jazz Friday.\n\n\r\n              Kings: Face the Clippers Saturday in Los Angeles.",
  "source": "espn_api",
  "crawled_at": 1764994332.053254
}