{
  "game_id": "0021600180",
  "espn_id": "400899630",
  "date": "Nov 18, 2016",
  "matchup": "MEM @ DAL",
  "headline": "Parsons leads Grizzlies over Mavs 80-64 in return to Dallas",
  "body": "DALLAS -- Chandler Parsons swished a 3-pointer just a few feet from Dallas owner Mark Cuban and turned in the direction of his former boss.\nMaybe that was Parsons simply trying to say, `That's what I can do when I'm healthy.\"\nParsons scored 12 points in his first game against his former team, helping the Memphis Grizzlies to an 80-64 victory Friday night over the injury-plagued Mavericks, who flirted with franchise worsts for scoring and shooting percentage.\nCuban waited out Parsons' postgame TV interview before sharing a brief moment with a player who had both his seasons in Dallas shortened by knee surgery, part of the reason he landed in Memphis on a max deal.\n\"He just said, glad I'm playing and good to see me back out there,\" Parsons said. \"Obviously, he's frustrated with how their season's going, but they'll bounce back.\"\nParsons is on a minutes restriction, just as he was a year ago with the Mavericks. He was 3 of 5 from 3-point range and added a couple of rebounds in 23 minutes.\n\"I wish I would have played more, honestly, if it wouldn't have been a little out of hand there,\" Parsons said. \"I feel like every game I'm getting better, I'm getting more legs.\"\nDallas was without Dirk Nowitzki (strained Achilles tendon) and its top three options at point guard in Deron Williams (left calf strain), J.J. Barea (torn left leg muscle) and Devin Harris (right toe sprain).\nThe Mavericks avoided the franchise low of 62 points from 1997 when Argentine rookie Nicolas Brussino made a 3-pointer with 24 seconds remaining. Dallas (2-9) matched its worst start since going 2-9 during Nowitzki's rookie season in 1998-99.\n\"If you're looking for me to make some kind of a crazy statement about how bad things are, that's not how I do business,\" coach Rick Carlisle said. \"I'm going to keep stressing the positives, and we're going to keep working to get them better.\"\nHarrison Barnes led the Mavericks with 15 points on 5-of-17 shooting. Seth Curry, the starting point guard because of all the injuries, scored 11 while shooting 4 of 14 from the field.\nMarc Gasol scored 11 for Memphis, as did Tony Allen after missing four games with a right groin injury.\nFLIRTING WITH DISASTER\nThe Mavericks were shooting 25.4 percent through three quarters -- the franchise low is 27.4 percent from the expansion season of 1980-81 -- after going 8 1/2 minutes without a field goal in the second quarter and adding a 6 1/2-minute drought in the third.\nDallas, which matched a franchise low for the second quarter with 10 points, shot 43 percent in a 23-point fourth to finish at 28.8 percent.\nA FRIENDLY REMINDER\nThe Mavericks led 27-23 in the second quarter before a 17-minute stretch in which they scored just six points. The Grizzlies, who have another former Dallas player in Vince Carter, led 51-33 at that point. They were sluggish early two nights after handing the Los Angeles Clippers just their second loss, and in the finale of a four-game road trip.\n\"We stopped being friendly,\" Memphis coach David Fizdale said. \"If you watched the first quarter, everybody was having conversations with the other team like they were all pals. And we don't have the luxury to be buddies.\"\nTIP-INS\nGrizzlies: Zach Randolph scored 10 points, and JaMychal Green had a game-high 12 rebounds. ... Point guard Mike Conley had a season-low eight points but led the Grizzlies with two blocks.\nMavericks: Jonathan Gibson, a training-camp cut who re-signed Friday because of the injuries at point guard, had 11 points and a team-high three assists. ... Barea told a Spanish-language newspaper that he expected to miss four to six weeks with a muscle tear. He said he feared he had a more serious Achilles injury.\nUP NEXT\nBoth teams are in a stretch of playing six out of seven games on the road. The Mavericks just had their only home game and are headed to Orlando for the second night of a back-to-back before visiting San Antonio on Monday. The Grizzlies get their only home game in the stretch against Minnesota on Saturday night before a trip to Charlotte and Philadelphia.",
  "source": "espn_api",
  "crawled_at": 1764995625.2018719
}