{
  "game_id": "0022301115",
  "espn_id": "401585743",
  "date": "Apr 05, 2024",
  "matchup": "CHA vs. ORL",
  "headline": "Brandon Miller's big first half helps Hornets snap Magic's 3-game win streak, 124-115",
  "body": "CHARLOTTE, N.C. -- — Brandon Miller made his first 10 shots from the field and finished with 32 points as the Charlotte Hornets snapped the Orlando Magic’s three-game win streak with a 124-115 victory on Friday night.\n\n\r\n              Miles Bridges added 23 points and Grant Williams added 18 points as the Hornets won for only the second time in their last 11 games.\n\n\r\n              Paolo Banchero had 32 points, eight rebounds and eight assists in a potentially costly defeat for the Magic. Franz Wagner added 22 points.\n\n\r\n              Orlando (45-32) came in tied with the New York Knicks for fourth place in the Eastern Conference and hoping to take a step toward securing a home-court advantage in the first round of the playoffs.\n\n\r\n              But the Magic ran into a buzzsaw in Miller.\n\n\r\n              The No. 2 overall pick made five 3s and had 24 points less than two minutes into the second quarter as the Hornets built a 45-27 lead.\n\n\r\n              Miller finished the first half 10 of 10 from the field, joining Steph Curry as the only player in league history to record a first half of scoring at least 25 points, with perfect shooting from the field and the foul line while attempting a minimum of five 3-pointers.\n\n\r\n              “That’s a great accomplishment,” Miller said. “He’s one of the greats, definitely a great shooter. Being in that category, that’s a blessing.”\n\n\r\n              When asked if it felt like it was one of those nights where everything he threw up was going in, Miller smiled and said, “Every night is like that.”\n\n\r\n              Actually, not quite.\n\n\r\n              Miller had come off a 1 of 8 3-point shooting night against Portland on Wednesday and was visibly frustrated.\n\n\r\n              But he showed poise in bouncing back.\n\n\r\n              “I am very impressed with this young man and what he has accomplished,” Magic coach Jamahl Mosley said. “I know there was a lot of talk early on about what he was capable of doing and he wasn’t hitting that until a point, and then he just turned it up. He has been rookie of the month the last three months. You have to give him a ton of credit for the work he is putting in, and staying with it.”\n\n\r\n              Miller also moved passed Luka Doncic and Anthony Edwards into fifth place in NBA history for 3s made in a season by a rookie with 173. Keegan Murray set the record last season with 206.\n\n\r\n              Charlotte led by 19, but the Magic clawed back to within four with 9:30 to play behind Wagner, who scored 13 points in the fourth quarter.\n\n\r\n              But the Hornets surged back ahead by double digits after Vasa Micic found Williams for an open 3 from the top of the key after a pick and pop. Charlotte put the game away when Micic caught an outlet pass and made a one-handed lookahead pass to Miller for the layup.\n\n\r\n              Micic had 14 points and nine assists.\n\n\r\n              Mosley took responsibility for the loss.\n\n\r\n              “I have to do a better job of preparing them for what this situation is going to be,” Mosley said. “I will take the hit on this one.”\n\n\r\n              The Magic played without Jonathan Isaac due to back spasms.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host Chicago on Sunday night.\n\n\r\n              Hornets: Host Oklahoma City on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995933.622951
}