{
  "game_id": "0022300738",
  "espn_id": "401585366",
  "date": "Feb 08, 2024",
  "matchup": "MIL vs. MIN",
  "headline": "Timberwolves roll past short-handed Bucks 129-105 to spoil Doc Rivers' home debut",
  "body": "MILWAUKEE -- — Anthony Edwards had 26 points and nine assists and the Minnesota Timberwolves shot 21 of 41 from 3-point range to trounce the slumping Milwaukee Bucks 129-105 on Thursday night.\n\n\r\n              “It feels great to make some shots, take some shots and make some shots,” Edwards said. “It was a better feeling to see my teammates make a lot of shots and take confident shots and keep shooting them, keep shooting open shots and playing their game.”\n\n\r\n              Karl-Anthony Towns scored 19 points, Mike Conley added 18, Naz Reid 17 and Rudy Gobert 16 as the Timberwolves spoiled the home debut of new Bucks coach Doc Rivers, whose No. 31 Marquette jersey hangs from the Fiserv Forum rafters.\n\n\r\n              Rivers opened his Milwaukee coaching tenure with a five-game trip during which the Bucks went 1-4. \n\n\r\n              The Bucks were operating at far less than full strength.\n\n\r\n              Damian Lillard missed a second straight game and Khris Middleton also was out because of their sprained ankles, though Brook Lopez returned after missing three games as his wife gave birth to their child.\n\n\r\n              “This was going to be a tough one if we were not injured, coming back from the trip we just came back from,” Rivers said.\n\n\r\n              Both teams had short benches after making deals before Thursday’s trade deadline.\n\n\r\n              The Bucks sent Cam Payne and a second-round pick to the Philadelphia 76ers for Patrick Beverley, while Minnesota dealt Troy Brown, Shake Milton and a second-round pick to the Detroit Pistons for Monte Morris. Neither Beverley nor Morris was available for Thursday night’s game.\n\n\r\n              Without Lillard or Payne, the Bucks had no pure point guards. \n\n\r\n              With the game out of reach late in the third quarter, the Bucks also opted to rest Giannis Antetokounmpo for the last 16 minutes to give him as much rest as possible before they play again Friday.\n\n\r\n              Rivers said he thought before the game he might rest his top players if the Bucks fell behind by 18 to 20 points. Friday will mark the Bucks' fifth game in a seven-day stretch.\n\n\r\n              \"It was almost one of those things where you thought before the game, maybe sit all of them,\" Rivers said. “But at least they got that out of them now. Hopefully we'll be better tomorrow, and hopefully we'll get guys back tomorrow.”\n\n\r\n              A.J. Green scored a career-high 27 points for the Bucks while shooting 7 of 8 from 3-point range. Jae Crowder had 21 points, eight rebounds and five assists -- all season highs. Antetokounmpo had 17 points and seven assists.\n\n\r\n              Minnesota pulled ahead for good with 10 minutes left in the second quarter and led 63-53 at the half.\n\n\r\n              The Timberwolves extended their edge to 91-64 late in the third as Reid capped a 17-3 run by dunking and drawing a foul for a 3-point play. The Timberwolves eventually led by as many as 28.\n\n\r\n              “I thought that we made it a point tonight — KAT, Rudy, all the guys on the court — just communicating with each other, being loud, and it allowed our defense to kind of swarm and be all over the place,” Conley said. “When all those things are working together, we can have pretty good nights.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Visit the Los Angeles Clippers on Monday.\n\n\r\n              Bucks: Host the Charlotte Hornets on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996117.813814
}