{
  "game_id": "0021900867",
  "espn_id": "401161509",
  "date": "Feb 26, 2020",
  "matchup": "ATL vs. ORL",
  "headline": "Fournier scores 28, Gordon 25 as Magic beat Hawks 130-120",
  "body": "ATLANTA --  The Orlando Magic are hardly a championship contender.\n\nThey're not even a .500 team.\n\nNo wonder they're relishing the chance to be part of a playoff race.\n\nEvan Fournier scored 28 points, Aaron Gordon added 25 and the Magic pulled away in the fourth quarter for a 130-120 victory over the Atlanta Hawks on Wednesday night.\n\nOrlando improved to 26-32 with its second straight road victory, maintaining a 4 1/2-game lead for the final playoff spot in the East and closing within a half-game of Brooklyn for the No. 7 seed.\n\n\"It's a lot of fun,\" said James Ennis III, who hit a key 3-pointer midway through the fourth quarter after the Hawks had closed to 111-107.\n\nEnnis' lone 3 of the night sparked a 17-7 spurt that put the Hawks away. Fournier did most of the heavy lifting, scoring nine points in the game-clinching run before Gordon finished it off with a 3-pointer.\n\n\"My teammates were finding me,\" said Gordon, who also had 10 rebounds, six assists and three blocks. \"We're playing more together. We're playing smarter, more disciplined.\"\n\nThe Hawks lost despite a 37-point effort from Young. John Collins added 26 points, but was blocked twice in the fourth quarter -- first by Gordon, then by Nikola Vucevic -- to stymie any hopes of an Atlanta comeback.\n\nBattling flu-like symptoms and held to six points in the opening quarter, Young ripped off 20 in the second -- including a 3-pointer from inside the edge of the Hawks logo at center court.\n\nGordon countered with an 18-point third quarter, highlighted by a 360-degree dunk off a sloppy Atlanta turnover, that sent the Magic to the final period with a 103-95 lead.\n\n\"We let the foot off the pedal a little bit,\" Collins said. \"We didn't play with the same intensity in the third quarter.\"\n\nThe Hawks were leading 75-68 early in the third when Orlando suddenly seized control with a 29-9 outburst.\n\n\"The third quarter was brutal,\" Atlanta coach Lloyd Pierce said. \"The first timeout is called, and we just kind of fell apart the rest of that third quarter. It's really our defensive end. We just couldn't get stops.\"\n\nThe ailing Young looked exhausted by the end. He made only 2 of 14 shots in the second half.\n\n\"I'm not feeling too well right now,\" he said. \"Hopefully, I'll get over this soon.\"\n\nTRAE STUFFS BAMBA\n\nYoung did have something to smile about after the game.\n\nLate in the first quarter, as 7-footer Mo Bamba was going up for an apparent dunk, the 6-foot-1 Young came in from behind to swat the ball away.\n\nTalk about an unlikely block.\n\n\"Mo's my guy,\" Young said with a sly grin. \"I'm talking trash with him all the time, really since high school. I'll definitely be talking about this one for a long, long time.\"\n\nTIP-INS\n\nMagic: Fournier totaled 14 points in the final quarter. ... Orlando finished 2-2 in its season series against the Hawks, after winning all four meetings a year ago. ... Vucevic had 17 points and 12 rebounds. ... The Magic had nine blocks, including four from Bamba and three by Gordon. ... Orlando came to life offensively in the second quarter, scoring more points (25) in the first six minutes of the period than it did in the entire opening stanza (23).\n\nHawks: C Dewayne Dedmon was a late scratch because of a sore right elbow. \"We didn't know about it until right before the game,\" Collins said. \"We definitely missed his defensive presence.\" ... Rookie Bruno Fernando took Dedmon's place in the starting lineup, scoring 10 points and grabbing nine rebounds. ... The Hawks lost for only second time in their last eight home games. ... Young was 4 of 12 from 3-point range.\n\nUP NEXT\n\nMagic: Return home Friday night to face the Minnesota Timberwolves.\n\nHawks: Continue a four-game homestand against the Brooklyn Nets on Friday night.\n\n---\n\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 His work can be found at https://apnews.com\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996660.462929
}