{
  "game_id": "0022200094",
  "espn_id": "401468249",
  "date": "Oct 30, 2022",
  "matchup": "PHX vs. HOU",
  "headline": "Devin Booker scores 30 points, Suns beat Rockets 124-109",
  "body": "PHOENIX -- — Devin Booker scored 30 points on his 26th birthday in another stellar scoring performance, leading the Phoenix Suns over the Houston Rockets 124-109 on Sunday night.\n\n\r\n              The two-time All-Star — who's already in his eighth NBA season after being drafted in 2015 at 19 years old — is entering what many would consider the prime years of his career.\n\n\r\n              Booker said he doesn't think in those terms.\n\n\r\n              “I just try to continuously get better and continuously improve,\" Booker said. \"The thing about basketball — you can never perfect it. But I'm going to try everything in my power to do it.”\n\n\r\n              Booker might not feel like he's in his prime, but the numbers say he's among the league's elite. He's averaging more than 29 points through six games and shooting 52% from the field.\n\n\r\n              He was 14 of 24 from the field on Sunday, scoring from all over the court. Suns coach Monty Williams said he doesn't know if Booker's reached his peak or not, but he's certainly enjoyed watching him grow.\n\n\r\n              “Guys like Book, because they do it so consistently, you kind of take it for granted,” Williams said. “It's hard to say — he's only 26. There's certainly levels for guys to get better.”\n\n\r\n              The Rockets, who dropped to 1-6, never led in the game but also never fell too far behind. They threatened to push ahead a few times, even briefly tying it at 86 when Usman Garuba hit a corner 3-pointer.\n\n\r\n              Landry Shamet rattled home a 3-pointer to give the Suns a 90-86 advantage going into the fourth. The Suns (5-1) stayed in control from there, with Johnson and Mikal Bridges each hitting 3-pointers to push the advantage to 117-102.\n\n\r\n              The Rockets had some self-inflicted problems, including two technicals early in the fourth quarter that helped swing the momentum back toward the Suns. Kevin Porter Jr. and Garrison Mathews were both called for technicals after an altercation with Suns guard Damion Lee.\n\n\r\n              “Some of our late-game execution can get a little better,” Rockets coach Stephen Silas said. \"The possession where we fouled on the inbound then we got two technicals, it was like a three-point possession just for nothing. Our poise in those moments especially in the fourth quarter is important as well. \n\n\r\n              Booker did the bulk of the scoring while fellow All-Star Chris Paul added a season-high 15 assists. The Suns have beaten the Rockets nine straight times dating to 2019 and they won their 54th straight game when holding an opponent under 110 points.\n\n\r\n              Kevin Porter Jr. led the Rockets with 26 points. Alperen Sengun added 16 points and nine rebounds.\n\n\r\n              Booker scored 21 points in the first half on 10-of-16 shooting, pushing the Suns to a 65-56 advantage. Jock Landale scored all of his 16 points before the break.\n\n\r\n              TIP-INS\n\n\r\n              Rockets: F Bruno Fernando (left knee soreness), G Eric Gordon (right groin) and G TyTy Washington (left knee sprain) did not play. ... Had a 49-36 rebounding advantage.\n\n\r\n              Suns: C Deandre Ayton (left ankle sprain) missed his first game of the season. Williams said the fifth-year player will be out at least a week and then be reevaluated. ... Had 30th straight sellout, dating to last season. ... YouTuber-turned-boxer Jake Paul was at the game on Sunday, one night after beating Anderson Silva in a boxing match.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: At Los Angeles Clippers on Monday night.\n\n\r\n              Suns: Host Minnesota on Tuesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995115.007257
}