{
  "game_id": "0022200649",
  "espn_id": "401468804",
  "date": "Jan 15, 2023",
  "matchup": "LAC vs. HOU",
  "headline": "Mann, Leonard lead Clippers over last-place Rockets 121-100",
  "body": "LOS ANGELES -- — Terance Mann slipped the gold-chained championship belt proclaiming “Big Moment Fella Performance” over his head.\n\n\r\n              He clearly earned it, scoring a career-high 31 points in the Los Angeles Clippers' 121-100 win over the Houston Rockets on Sunday.\n\n\r\n              After Houston tore through their defense early, the Clippers settled down and dominated the fourth quarter to extend the Rockets' season-worst skid to 10 straight games.\n\n\r\n              Kawhi Leonard added 30 for the Clippers, who had dropped eight of nine. He scored 13 points, including nine straight, in 11 minutes of the opening quarter.\n\n\r\n              Both teams were shorthanded. Houston starters Jalen Green and Jae’Sean Tate served one-game suspensions for leaving the bench area during an on-court altercation in Friday’s loss at Sacramento. The Clippers were missing starters Paul George (right hamstring soreness) and Marcus Morris (left knee contusion). \n\n\r\n              The Clippers broke open a close game and outscored the Rockets 30-10 in the fourth.\n\n\r\n              “Nobody could get stops. Everybody was moving slow and that might have been because it was an early game,” Mann said. “Whichever team was going to play defense first was going to win.”\n\n\r\n              With Leonard on the bench to start the fourth, the second unit gave the Clippers their first double-digit lead of the game. Robert Covington opened an 11-0 run with a 3-pointer and scored inside before Moses Brown’s tip-in closed it for a 103-92 lead. Norman Powell led the bench with 18 points.\n\n\r\n              At the other end, the Rockets came up empty on consecutive possessions.\n\n\r\n              “Keep the pressure on the defensive end, that's really what I like to bring to the table,” Mann said.\n\n\r\n              Eric Gordon led the Rockets with 24 points. Kenyon Martin Jr. had 22 points and nine rebounds and Alperen Sengun had 15 points, eight rebounds and six assists.\n\n\r\n              The Rockets stretched their lead to eight early in the third. Leonard returned to score 12 points and Mann added five in a 25-16 run that gave the Clippers a 91-90 lead going into the fourth.\n\n\r\n              The Rockets didn't play like a team mired in last place in the West. They hammered the Clippers' defense for eight dunks in the first half, including four in the game's opening minutes. Martin accounted for six one-handed jams, one of the most vicious coming with a second left before halftime.\n\n\r\n              The crowd had barely finished reacting to it when Mann tossed up a high-arcing 3-pointer from midcourt that dropped in at the buzzer, drawing roars and leaving the Clippers trailing 63-62 at the break. Mann raised both arms as if to say, “How 'bout that?”\n\n\r\n              TIP-INS\n\n\r\n              Rockets: Green and Tate also were docked a game's pay. “Our guys got to stay on the bench,” coach Stephen Silas said. ... Garrison Mathews and Tari Eason were both fined for their roles in the incident. ... They got swept in the season series, 4-0. ... Daishen Nix got his first start of the season. ... Kevin Porter Jr. (left foot contusion) sat out.\n\n\r\n              Clippers: Luke Kennard (right calf soreness) and John Wall (abdominal soreness) were out. ... Wall will be re-evaluated in two weeks. Wall said he hurt himself dunking in Friday's loss to Denver but finished the game. “Can't really run,” he said. “It's definitely frustrating.” ... Amir Coffey started after being a DNP in two of his last three games and playing only a minute in the other. ... Reggie Jackson got a flagrant-1 foul midway through the second for not allowing Mathews to land on his shot attempt. ... Morris said he would be back to play Tuesday.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Stay in Los Angeles to play the Lakers on Monday.\n\n\r\n              Clippers: Host Philadelphia on Tuesday to wrap a five-game homestand. ------",
  "source": "espn_api",
  "crawled_at": 1764994972.8451772
}