{
  "game_id": "0022000934",
  "espn_id": "401307737",
  "date": "Apr 28, 2021",
  "matchup": "ATL @ PHI",
  "headline": "76ers rout Hawks 127-83 to clinch playoff spot",
  "body": "PHILADELPHIA -- — Seth Curry scored 20 points, Tobias Harris and Joel Embiid each added 17 and the Philadelphia 76ers built a big early lead and cruised to a 127-83 victory over the Atlanta Hawks on Wednesday night to clinch an Eastern Conference playoff berth.\n\n\r\n                    Shake Milton and Furkan Korkmaz scored 12 apiece and Tyrese Maxey added 11 for the Sixers, who became the second team in the Eastern Conference to secure a postseason spot. \n\n\r\n                    “Coming into the season, our goal was to win a championship,” Embiid said. “There are a lot of steps to get there. But we have everything we need to make it happen.”\n\n\r\n                    The Sixers are currently second in the East, a game behind Brooklyn and 2 1/2 games ahead of third-place Milwaukee with 10 games to play. Both the Nets and Bucks were off Wednesday. \n\n\r\n                    “We would have loved to be the first team to clinch the playoffs,” Harris said. “We’re not dwelling on that, but this is Philadelphia basketball, where greatness is expected from our fans and us as a group. We understand that. We’re not celebrating for clinching the playoffs.”\n\n\r\n                    Atlanta was missing star guard Trae Young, who missed his fourth game since spraining his left ankle on April 21 against New York. John Collins scored 21 points and Solomon Hill added 14 for Atlanta.\n\n\r\n                    “The first two quarters, we didn’t come out with intensity or sense of urgency,” Hawks coach Nate McMillen said. “I thought the third quarter was better with intensity, a little more scrap and fight. But we’ll look at this and we’ll learn from it. We have to get better from it.”\n\n\r\n                    Young did pick up a technical foul in the fourth quarter for yelling at officials from the Hawks bench following an incident where teammate Kris Dunn picked up an unsportsmanlike technical for getting in the middle of a post-play celebration between Milton and Matisse Thybulle.\n\n\r\n                    Philadelphia never trailed, jumping out to a 37-17 lead at the end of the first quarter thanks in large part to Curry’s 13 points on 5-of-7 from the floor. \n\n\r\n                    Atlanta shot just 33.3% from the floor, its second-worst mark of the season, and 32% from beyond the 3-point line. The 83 points for the Hawks were a season low, coming on the heels of an 86-point performance in a loss Monday night at Detroit.\n\n\r\n                    “When you have guys who are big parts of your team that are out, it’s tough,” Collins said. “Especially against a great team like Philly that was ready to go. But I feel like we could have competed harder out there.”\n\n\r\n                    Ben Simmons, who was limited to 15 minutes by foul trouble and the game’s lopsided nature, scored eight points and dished out six assists.\n\n\r\n                    Philadelphia’s starters didn’t play a lot of time in the second half for the second straight game after building up big leads.\n\n\r\n                    “It’s important,” Harris said. “It allows us to get a little extra rest, which is necessary for our group. But we play these guys (the Hawks) in a day. They are going to bring it as well. We have to be ready for another matchup for them.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Besides Young’s injury, Bogdan Bogdanovic sat out Wednesday night’s game due to left hamstring soreness. Bogdanovic, averaging 15.2 points, is listed as day to day. … Guard/forward Kevin Huerter was also out on Wednesday night with a left shoulder sprain. Reserve guard Brandon Goodwin was available despite a left shoulder impingement. \n\n\r\n                    76ers: Philadelphia played with its full starting lineup — Simmons, Curry, Embiid, Harris and Danny Green — for just the 25th time this season. The 76ers are 21-4 in those games. Embiid has missed 19 games and has been bothered by a sore shoulder in recent days. \n\n\r\n                    BACK AGAIN\n\n\r\n                    The 76ers made the playoffs for the fourth year in a row, the first time they’ve done that since Allen Iverson led the franchise to five straight appearances from 1999-03. \n\n\r\n                    UP NEXT\n\n\r\n                    The Hawks and 76ers will meet again for the second half of the back-to-back on Friday night in Philadelphia.",
  "source": "espn_api",
  "crawled_at": 1764997828.458451
}