{
  "game_id": "0021601159",
  "espn_id": "400900537",
  "date": "Apr 04, 2017",
  "matchup": "MIL @ OKC",
  "headline": "Westbrook ties triple-double mark; Thunder top Bucks 110-79",
  "body": "OKLAHOMA CITY --  For just a few moments, Russell Westbrook slowed down.\n\nThe Oklahoma City Thunder's mile-a-minute point guard took the time to soak in the atmosphere Tuesday night after he matched Oscar Robertson's single-season record with his 41st triple-double. The home crowd stood and chanted \"MVP! MVP!\" long after the assist, and he later waved to the crowd after play stopped .\n\n\"It's one of those nights, a special night, and something I definitely will never forget,\" he said. \"I'm just truly honored to do it here, especially in Oklahoma City.\"\n\nWestbrook finished with 12 points, 13 rebounds and 13 assists to help the Thunder beat the Milwaukee Bucks 110-79. He clinched his seventh straight triple-double on an assist to Taj Gibson with 9:17 left in the third quarter.\n\n\"An honor to just be mentioned in a conversation with Oscar Robertson, the different things he did for the game of basketball to allow me to play the game today,\" Westbrook said.\n\nRobertson set the record during the 1961-62 season, and Westbrook can break it Wednesday in Memphis. Westbrook said he just wanted to focus on the moment, yet his mind raced ahead to someday telling his unborn son about the experience.\n\n\"It's something that I could never dream about growing up in the inner city of Los Angeles,\" he said. \"I never dreamed about a moment like this, to be able to be on this stage.\"\n\nWestbrook also moved into a tie with Wilt Chamberlain for fourth on the career list with his 78th triple-double.\n\nBucks coach Jason Kidd, who is third with 107 triple-doubles, was impressed with Westbrook's ability to dominate without scoring as much as usual. Westbrook, the NBA's scoring leader, made just four field goals.\n\n\"He didn't have to score 40 tonight to help them win,\" he said. \"It showed that he was sharing the ball, and everybody was benefiting from that.\"\n\nEnes Kanter scored 17 points for the Thunder, who posted their largest victory margin of the season.\n\nMichael Beasley scored 14 points and Giannis Antetokounmpo added 11 points and 10 rebounds for the Bucks.\n\nMilwaukee had been one of the league's hottest teams. Kidd was voted Eastern Conference Coach of the Month after leading the Bucks to a 14-4 record in March, and though they lost to Dallas on Sunday, their recent success gained the Thunder's full attention.\n\nWestbrook had 12 points, eight rebounds and eight assists at halftime to help Oklahoma City take a 63-39 lead. He hit a 3-pointer with 8.6 seconds left in the first half to reach double figures in points.\n\nWestbrook got his 10th rebound and 10th assist six seconds apart. He left the game for good with 2:35 left in the third quarter.\n\n\"You could feel in the building, and you could see that his teammates were not going to let him down tonight,\" Kidd said.\n\nTIP-INS\n\nBucks: Made just 3 of 18 3-pointers and shot just 36 percent overall. ... Were outrebounded 53-38.\n\nThunder: Westbrook has matched a career best with his seven straight triple-doubles. ... Improved to 32-9 this season when Westbrook gets a triple-double. ... G Alex Abrines left the game in the second quarter with a sprained left knee and did not return. He made 4 of 6 3-pointers in 12 minutes. ... Oklahoma City's bench scored 65 points.\n\nSTAT LINES\n\nWestbrook is nearing a triple-double average for the season. He clinched a double-figure rebound average during Tuesday's game and needs 16 assists to average 10 for the season.\n\nQUOTABLE\n\nWestbrook, on trying to focus after tying Robertson: \"I airballed a 3 right after that. But at the same time, we were winning, and that's the most important thing. Tonight was a great night.\"\n\nUP NEXT\n\nBucks play at Indiana on Thursday.\n\nThunder play at Memphis on Wednesday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .",
  "source": "espn_api",
  "crawled_at": 1764995125.930022
}