{
  "game_id": "0021500401",
  "espn_id": "400828288",
  "date": "Dec 19, 2015",
  "matchup": "HOU vs. LAC",
  "headline": "Howard leads Rockets over Clippers 107-97",
  "body": "HOUSTON -- Dwight Howard played one of his best games of the season Saturday night and wore a huge grin as he did it, seemingly unbothered by recent unsubstantiated reports that he's unhappy in Houston and could be traded.\nHoward had 22 points and 14 rebounds, and the Rockets built a huge lead early and rolled to a 107-97 win over the Los Angeles Clippers.\n\"That's one thing we've been talking about in the locker room is not allowing the noise, the distractions to really affect who we are and what we're trying to accomplish as a team,\" Howard said. \"That's what we have to do. There's always going to be talk, there's always going to be noise but we have to be able to keep that noise out and only hear the voices of each other.\"\n\nHouston led by as many as 26 points in the first half and was up by 12 after three quarters. The Rockets opened the fourth with an 8-2 run to make it 91-73. Marcus Thornton highlighted that spurt when he drove into the lane, evaded Blake Griffin and finished with a layup.\nHouston pushed the lead to 95-76 with about 7 1/2 minutes left when Howard blocked a shot by Austin Rivers, and Trevor Ariza grabbed the ball and dished it to Howard, who finished with a dunk on the other end. The starters for both teams sat down a few minutes after that.\nGriffin's 22 points led the Clippers, who lost their second straight.\n\"They wanted to be the aggressors and get into our air space and they did that,\" Griffin said. \"By the time we looked up and tried to turn it around, we were in too deep of a hole.\"\nJames Harden added 18 points with 11 assists, and Ariza scored 17 for Houston.\nThe Rockets got things going with a 38-point first quarter in which they outrebounded the Clippers 20-5. Los Angeles intentionally fouled Howard and Clint Capela for a big chunk of the second to cut the lead to 11 by halftime.\nA 7-2 spurt, with five points from J.J. Redick, early in the third quarter got the Clippers to 61-53.\nAriza made a 3-pointer to extend Houston's lead, but the Clippers scored the next five points to make it 64-58. Ariza got Houston going again after that, making another 3 to hold off the rally.\nChris Paul made a 3-pointer just before the shot clock expired to get Los Angeles within seven points soon after that, but a third 3 by Ariza started a 10-2 run for Houston that made it 78-63 with about 90 seconds left in the third quarter.\nThe Clippers led by one early before Houston scored 15 straight points to make it 23-9 with 5 minutes left in the first quarter. Harden scored seven points during that span and made two nifty passes to Donatas Motiejunas to help add four more points.\nLos Angeles went almost 4 minutes without scoring as Houston built the lead. The Clippers finally broke the drought on a 3-pointer by Jamal Crawford with about 4 1/2 minutes left in the first.\nTIP-INS\nClippers: Griffin got a technical foul with about 4 1/2 minutes left in the third quarter. ... Rivers sprained his right ankle late in the fourth quarter and was helped off the court by Paul. ... Redick finished with 19 points and Paul had 12.\nRockets: Houston was without G Ty Lawson, who served the first of a two-game suspension without pay for a drunken-driving case in Colorado. ... Motiejunas had 10 points. ... The Rockets outrebounded the Clippers 55-38.\nHACKING\nThe Clippers trailed by 22 with about 8 minutes left in the second quarter when they started hacking Houston's big men. They intentionally fouled Howard on five possessions and Capela on three more over the next 3 1/2 minutes. Howard made five of 10 attempts and Capela two of six. The tactic helped the Clippers go on a 15-7 run to cut the lead to 50-36.\nRockets interim coach J.B. Bickerstaff took both players out after that, but Howard returned a couple of minutes later and so did the Hack-A-Howard. He made one of two free throws before heading back to the bench.\nHoward was asked if he would like to see the NBA ban the tactic.\n\"It doesn't matter,\" he said. \"It's a strategy. It's boring at times, but you've just got to go make them.\"\nQUOTABLE\nClippers coach Doc Rivers on his team's slow start: \"I just didn't think we had any energy tonight. I should have probably taken our guys out earlier, but we just kept the game close enough that you wanted to play them. But I sensed it really early.\"\nUP NEXT\nClippers: Host Oklahoma City on Monday.\nRockets: Host Charlotte on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994646.3501282
}