{
  "game_id": "0021900175",
  "espn_id": "401160817",
  "date": "Nov 16, 2019",
  "matchup": "CHI vs. BKN",
  "headline": "Nets beat Bulls 117-111 without Irving",
  "body": "CHICAGO --  Spencer Dinwiddie isn’t trying to be Kyrie Irving. Still, he gave the Brooklyn Nets the spark they needed Saturday night.\n\nDinwiddie scored 24 points and the Nets beat the Chicago Bulls 117-111 without Irving.\n\nIrving entered Saturday sixth in the NBA with 28.5 points per game but sat with a right shoulder injury. Brooklyn was just fine without the All-Star guard as Dinwiddie stepped into the starting lineup.\n\n“I’m not Kyrie, you know what I mean?” Dinwiddie said. “I just tried to gauge what needed to be done to win the game.”\n\nZach LaVine scored 36 points, but Chicago shot 35.2% from the field, 23.1% from 3-point range and committed 20 turnovers.\n\nJoe Harris had 22 points and eight assists for Brooklyn, which snapped a three-game skid. The short-handed Nets are also without Caris LeVert, who’s recovering from right thumb surgery.\n\n“Fifteen guys bonded together, and I don’t think it was pretty,” Brooklyn coach Kenny Atkinson said. “Your best player’s out -- let’s be honest -- and everybody steps it up a level. It’s really a real boost to our morale.”\n\nThe lead changed hands five times in the fourth, and Brooklyn pulled ahead for good on Dinwiddie’s dunk with 8:01 remaining. Dinwiddie scored 20 points in the fourth alone.\n\n“He took over,” Atkinson said.\n\nChicago briefly got within three points with just under 3 minutes left, and Lauri Markkanen hit a fading 3-pointer to make it 113-111 with 8.8 seconds remaining. But Harris made two free throws and the Bulls never got the ball with a chance to tie it.\n\nWendell Carter Jr. added 18 points and 14 rebounds for the Bulls, who trailed by double digits early before using a 23-5 run in the second quarter to take the lead.\n\nChicago led from then until the fourth quarter but allowed 43 points in the final period.\n\n“They just wanted it more than us,” LaVine said. “They made more plays to close out the third quarter and start the fourth.”\n\nTIP-INS\n\nNets: Atkinson said Irving’s status for Monday’s game against Indiana is unclear. … Six Nets scored in double figures.\n\nBulls: Coach Jim Boylen said he expects F Otto Porter Jr.’s return from a left foot sprain to be a matter of weeks, rather than months. He doesn’t think Porter will need surgery. “Otto’s is a slow, meticulous process,” Boylen said.\n\nBRICK CITY\n\nBrooklyn won despite shooting worse than 25% from 3-point range for the second straight game. The Nets shot 23.3% from beyond the arc after making just 21.1% at Denver on Thursday.\n\nDinwiddie missed all four of his 3-point attempts.\n\n“I’ve been broke from 3 this year, so (I’m) probably dragging our average down,” Dinwiddie said.\n\nHEADED HOME\n\nThe Nets finished their five-game road trip on a high note. Brooklyn had lost three of four to start the stretch and blew a 12-point halftime lead in Denver on Thursday.\n\n“Last game of the road trip, we all know how difficult those games are,” Atkinson said. “We avoided that super bad stretch that we’ve had in the past two or three games, where we just have a train wreck of an eight minutes or a quarter that doesn’t go right.”\n\nUP NEXT\n\nNets: Return home to face Indiana on Monday.\n\nBulls: Host Milwaukee on Monday in the second of a four-game homestand.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996365.28554
}