{
  "game_id": "0022200852",
  "espn_id": "401469007",
  "date": "Feb 11, 2023",
  "matchup": "CHI @ CLE",
  "headline": "Mitchell nets 29 as Cavs rally past Bulls, win streak hits 6",
  "body": "CLEVELAND -- — All-Star Donovan Mitchell scored 19 of his 29 points in the second half and Jarrett Allen had 23 points and 10 rebounds, rallying the Cleveland Cavaliers to a 97-89 victory over the Chicago Bulls on Saturday night.\n\n\r\n              Mitchell added 10 rebounds and Darius Garland scored 19 for Cleveland, which trailed 61-48 in the third quarter before unleashing a 43-17 run to go up by 13. The Cavaliers won their sixth straight and are 24-6 at Rocket Mortgage FieldHouse.\n\n\r\n              “This was a big-time win for us,” Mitchell said. “We were getting good looks early and making the right plays, but the shots weren’t falling. Once we started hitting them, we know it’s tough to play here because of our fight and our fans.”\n\n\r\n              Zach LaVine scored 23 points, Nikola Vucevic had 14 points and 14 rebounds, and All-Star DeMar DeRozan had 16 points and six assists for the Bulls. Chicago was outscored 20-4 to start the fourth and dropped its third in a row.\n\n\r\n              The Cavaliers were playing the second half of a challenging back-to-back set, arriving in Cleveland at 4 a.m. following their 118-107 win in New Orleans. That nationally-televised game tipped after 10 p.m. Eastern.\n\n\r\n              “To find the fortitude to grind this one out, that’s special,” Cavaliers coach J.B. Bickerstaff said. “The mental toughness the guys showed when things weren’t going our way, you talk about growth, that’s what this was.”\n\n\r\n              Evan Mobley had 14 points and Garland dished out seven assists, helping Cleveland extend its lead over Brooklyn for fourth place in the Eastern Conference to 2 1/2 games. The Cavaliers swept their four-game season series with Chicago.\n\n\r\n              The Bulls committed 23 turnovers, were 5 of 21 on 3-pointers and only managed 60 points over the final three quarters.\n\n\r\n              “We just shot ourselves in the foot an enormous amount tonight,” Chicago coach Billy Donovan said. “A lot of it is the team learning how to stop the bleeding. Everyone is trying their best, but we’re not getting the results we want.”\n\n\r\n              Cleveland’s reserves missed 18 of their 19 field goal attempts, including all 13 3-pointers, with Ricky Rubio coming up empty on six tries and Dean Wade missing his five shots.\n\n\r\n              Mitchell scored a franchise-record 71 points in the teams’ previous meeting Jan. 2, a 145-134 overtime win at home by the Cavaliers. It tied for the eighth-most points in a game in NBA history and was the highest total in the league in 17 years.\n\n\r\n              EYES WIDE OPEN\n\n\r\n              The Bulls are in the thick of the battle for a play-in tournament spot in the East. Chicago hasn’t made a roster move since mid-December, but that could change soon as vice president Arturas Karnisovas and general manager Marc Eversley are actively looking at contract-buyout possibilities around the NBA.\n\n\r\n              “There have definitely been discussions and we have talked some names, but obviously, I can’t say who they are,” Donovan said. “You would take a good player who we would all feel confident could help us.”\n\n\r\n              TIP-INS\n\n\r\n              Bulls: G Lonzo Ball (left knee surgery), who has not played in a game since Jan. 14, 2022, will have his status updated by Karnisovas following the All-Star break. Ball has been able to dunk in recent weeks and could be nearing a return. … C Andre Drummond averaged a franchise-high 12.9 rebounds over two seasons with Cleveland, leading the NBA in 2019-2020. … Chicago wrapped up a three-game trip.\n\n\r\n              Cavaliers: G Dylan Windler (right ankle sprain) was in uniform for the second time, but did not get into the game. The 2019 first-round selection has missed the entire season after experiencing multiple setbacks. “It’s been tough because there have been random bumps in the road that you can’t account for,” Bickerstaff said. Windler has only appeared in 81 games as a pro. … Cleveland has sold out all 30 home games.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Orlando on Monday night.\n\n\r\n              Cavaliers: Host San Antonio on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994480.73424
}