{
  "game_id": "401810165",
  "espn_id": "401810165",
  "date": "Dec 01, 2025",
  "matchup": "IND vs CLE",
  "headline": "Mitchell scores 43 points to lead Cavaliers to 135-119 win over Pacers",
  "body": "INDIANAPOLIS -- — Donovan Mitchell scored 43 points to lead the Cleveland Cavaliers to a 135-119 victory over the Indiana Pacers on Monday night.\n\n\r\n              Mitchell, who made 16 of 27 shots from the field, also had nine rebounds and six assists. Jaylon Tyson added 27 points on 10-of-13 shooting and a team-high 11 rebounds. Evan Mobley and DeAndre Hunter each scored 13 for the Cavs.\n\n\r\n              Pascal Siakam had 26 points for Indiana, and Andrew Nembhard scored 21.\n\n\r\n              Garrison Mathews, who signed a second 10-day contract Monday with the Pacers, added 15 points — hitting all three of his attempts from 3-point range. Jay Huff also scored 15.\n\n\r\n              The Cavaliers shot 51% from the field while the Pacers shot 49%. Cleveland had a 48-36 rebounding edge. Indiana had 14 turnovers, six more than Cleveland.\n\n\r\n              Cleveland led by 21 twice, the last time at 53-32 before settling for a 66-54 halftime lead. The Pacers' only lead was 2-0. Hunter put the Cavaliers ahead for good at 5-2 with a 3-pointer.\n\n\r\n              The teams shot nearly the same in the opening half as the Pacers were at 50% and the Cavaliers at 49%. The difference was Cleveland had a 27-15 rebounding advantage and committed just three turnovers while the Pacers had eight.\n\n\r\n              The Pacers trailed 99-90 after three quarters. The Cavaliers scored the first five points of the fourth quarter and retained a comfortable margin the rest of the game.\n\n\r\n              The Cavaliers were without Darius Garland, who sat out of the second of back-to-back games to manage his left toe injury. Lonzo Ball missed the game due to an illness.\n\n\r\n              Up next\r\n              Cavaliers: Host the Portland Trail Blazers on Wednesday night.\n\n\r\n              Pacers: Host the Denver Nuggets on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042729.078805
}