{
  "game_id": "0021900622",
  "espn_id": "401161264",
  "date": "Jan 17, 2020",
  "matchup": "MEM vs. CLE",
  "headline": "Brooks has 26 points as Grizzlies defeat Cavaliers 113-109",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies kept the NBA’s longest winning streak alive with a fourth-quarter burst and defensive stops in the final seconds.\n\nDillon Brooks scored 26 points, Ja Morant added 16 points and eight assists and the Grizzlies survived a late rally by Cleveland to defeat the Cavaliers 113-109 on Friday night for their seventh straight win.\n\nThe Grizzlies failed to score in the final two minutes, allowing Cleveland to chop away at a 12-point lead. But after a trio of free throws by Kevin Love cut Memphis' advantage to 113-109 with 52.3 seconds left, the Cavaliers could get no closer as Love missed a pair of 3-point attempts in the final 11 seconds.\n\n“We got defensive stops and we rebounded,” Brooks said of overcoming the late scoring drought. “They kept looking for Kevin Love to get that 3, and we were being patient enough, switching and getting him to take tough shots.”\n\nCollin Sexton led Cleveland with 28 points and six assists, while Love added 19 points, missing all six of his 3-point shots as the Cavaliers lost their third straight and eighth in their last 10.\n\n“They got on us, and we really fought back,” Cleveland coach John Beilein said. “We really had chances. A couple of more baskets going down the stretch, and we could have won the game.”\n\nCleveland trailed by as many as 21 early in the fourth, but had a couple of runs that brought the Cavaliers within single digits. An 8-1 Memphis rally extended the Grizzlies lead to 111-99 with three minutes left.\n\nCleveland would close the game by outscoring the Grizzlies 10-2, but it wasn’t enough to overtake Memphis.\n\n“I don’t think we played our best and they took advantage of it,” Memphis coach Taylor Jenkins said. “These are situations we’ve faced a number of times during the season where you’ve got a lead and maybe a play here or there could have just flipped the game. But our guys stuck with it, despite having a mostly off night.”\n\nTIP-INS\n\nCavaliers: Played their fifth game of a six-game road trip. ... Darius Garland was 1 for 5 from 3-point range, ending a streak of 10 straight games with multiple 3-pointers. His 11 points kept alive his string of 11 straight reaching double figures. ... Tristan Thompson grabbed his third rebound of the game in the second quarter to pass Brad Daugherty (5,227) for third in Cavs history. “It’s an honor for sure to pass the great Brad Daugherty,” Thompson said. “He’s a Cavalier legend.”\n\nGrizzlies: Jenkins announced before the game that former Memphis guard and defensive stalwart Tony Allen has been hired as head of player development for the G League Memphis Hustle. ... More than 1,000 Murray State fans attended the game. Morant, the second pick in last summer’s draft, played for the Racers. Murray, Kentucky, is about a three-hour drive from Memphis. ... Were 45 of 89 from the floor, and have shot at least 50% from the field in six of the past seven games. ... Jonas Valanciunas had 18 rebounds and four blocks.\n\nTRISTAN TOSSED\n\nThompson was ejected in the third when he drew his second technical of the game after ongoing bickering with Grizzlies forward Jae Crowder. The two had drawn double-technicals earlier. Crowder was crossing through the lane after Thompson went to the foul line and the Cavalier popped Crowder on the backside. The two were teammates with Cleveland during the 2017-18 season.\n\n“So, we have a history, and it was just a little competitive spirit,” Thompson said. “They might have taken it the wrong way because they may have forgotten we were teammates.” Thompson added he is “definitely calling (the Players Association) to appeal that.”\n\nKen Mauer, the officiating crew chief, told a pool reporter that the ejection was for “the physical taunt, slap to the backside of Jae Crowder.” Mauer said the ejection was simply for the “butt slap” and not anything to do with the previous incident where the two were assessed double-technicals.\n\nUP NEXT\n\nCavaliers: travel to Chicago to face the Bulls on Saturday.\n\nGrizzlies: host the New Orleans Pelicans on Monday.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995715.9084249
}