{
  "game_id": "0022300212",
  "espn_id": "401584840",
  "date": "Nov 19, 2023",
  "matchup": "SAC @ DAL",
  "headline": "Sabonis, Fox lead Kings past Mavs 129-113 for 6th consecutive win",
  "body": "DALLAS -- — Domantas Sabonis had 32 points and 13 rebounds, De'Aaron Fox scored 30 and the Sacramento Kings beat the Dallas Mavericks 129-113 on Sunday night for their sixth consecutive victory.\n\n\r\n              Keegan Murray added 17 points as all five starters scored in double figures for the Kings, who improved to 3-0 on a six-game road trip, one shy of their longest this season.\n\n\r\n              Luka Doncic scored 25 for the Mavericks, who faded in the fourth quarter on the second night of a back-to-back and have lost three of four — allowing at least 125 points in all the losses — since an 8-2 start.\n\n\r\n              Sabonis, who had a season high in points, was 13 of 15 from the field, and Fox hit six of 10 from 3-point range as the Kings shot 53% overall and 43% from beyond the arc. Their season high is 47.6%. \n\n\r\n              Dallas shot 21% in the fourth quarter and missed all nine of its 3s in the quarter a night after a 132-125 loss to Giannis Antetokounmpo and the Milwaukee Bucks in which Kyrie Irving scored 39 and Doncic had 35. It was a second consecutive back-to-back for the Mavs, with two days in between. \n\n\r\n              Irving scored all 23 of his points in the first three quarters before missing his only two shots in the fourth as the Mavs emptied the bench when down by 21 with 5 1/2 minutes remaining.\n\n\r\n              The Kings trailed for just 91 seconds, surging back in front each time the Mavs took leads late in the first quarter and early in the third.\n\n\r\n              Harrison Barnes scored 12 points against his former team as did reserve Malik Monk. Chris Duarte scored 13 while making 3 of 4 from long range.\n\n\r\n              UP NEXT\n\n\r\n              Kings: The first of consecutive games at New Orleans finishes a back-to-back Monday. The rematch is Wednesday.\n\n\r\n              Mavericks: A seven-game stretch with six road games wraps up with games against the Lakers (Wednesday) and Clippers (Friday) in Los Angeles.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996802.5029492
}