{
  "game_id": "0021600448",
  "espn_id": "400899890",
  "date": "Dec 23, 2016",
  "matchup": "MEM vs. HOU",
  "headline": "Conley scores 24 points, Grizzlies beat Rockets 115-109",
  "body": "MEMPHIS, Tenn. --  Mike Conley is starting to look like his old self again and so are the Memphis Grizzlies.\n\nConley scored 24 points and Zach Randolph and Marc Gasol each added 16 to help the Grizzlies beat the Houston Rockets 115-109 on Friday night.\n\n\"It's good to see us slowly but surely getting back our team,\" said Memphis coach David Fizdale, who's seen Conley, Chandler Parsons, James Ennis and Vince Carter all return from injury this month.\n\nMemphis snapped a three-game home skid and ended Houston's road winning streak at five.\n\nCarter made a pair of 3-pointers during a 10-0 Grizzlies run early in the fourth quarter that broke it open. Houston led 78-77 to start the final period on a Patrick Beverley 3-pointer.\n\nBut Memphis outscored the Rockets 21-5 over the next 5 minutes and took a 98-83 lead on Jarell Martin's putback dunk with 6:51 left.\n\n\"They made the run, but we gave them points, especially to start that fourth quarter off,\" Rockets guard James Harden said. \"You can't give a good team like Memphis, especially here, a (10-0) run. It makes it hard for anybody to come back. Tough. We fought back. We didn't give up, but you can't allow it to happen.\"\n\nRyan Anderson led Houston with a season-high 31 points. Harden had 16 points, 17 assists, seven rebounds and nine turnovers in 36 minutes.\n\n\"The guy is just reinventing the (point guard) position,\" Fizdale said about Harden, who finished 6-of-13 from the floor but attempted just three free throws. \"There's no other point guard in the league like that. \"Luckily we have a guy like Tony Allen who can at least make him work.\"\n\nIt was the Rockets' first road loss since Nov. 29, when they dropped a 120-101 decision at Utah.\n\n\"We weren't hitting our normal shots. That's not us,\" Anderson said.\n\nTIP-INS\n\nRockets: The Rockets had won five straight games on the road, starting with a 132-127 double-overtime win at Golden State on Dec. 1. ... C Montrezl Harrell started for the second straight game after getting his first start of the season Wednesday at Phoenix. He finished with 16 points and 8 rebounds after scoring a career-high tying 17 in the Rockets' 125-111 win at Phoenix ... Anderson entered Friday's game averaging 15.8 on the road this season compared to 10.2 points at home. He finished 10-of-18 from the field Friday, including 8-of-14 from long range.\n\nGrizzlies: Parsons started his second straight game after missing the last 17 with a bone bruise in his left knee. Parsons had just two points (on 1-of-5 shooting) and two rebounds in 15 minutes in his first game back Wednesday against the Pistons. He wasn't much better Friday, contributing four points and three rebounds in 15 minutes. ... Conley needs five more steals to reach 1,000 for his career. ... It was the 1,299th game of Carter's career. He'll become just the 21st player in NBA history to reach 1,300 in the next game he plays, likely when the Grizzlies face Orlando on Monday.\n\nCONLEY SHAKES OFF RUST\n\nIn his fifth game back since missing nine straight with transverse process fractures in vertebrae in his lower back, Conley went 9 of 17 from the field, including 3 of 6 from 3-point range. He had made a combined nine field goals in his previous two games, going 9 of 26 from the floor. \"He's back a month early and doing it without painkillers. That's as tough as it gets,\" Fizdale said before Friday's game. \"What he has is a really painful injury. I knew he was tough, but I didn't know he was that tough.\"\n\n`IT'S BASKETBALL'\n\nConley and Beverley were involved in a fourth-quarter scrum late in the game after they went after a loose ball. Beverley was assessed a technical foul on the play after getting tangled up with Conley.\n\n\"It's basketball. It's physical. If that was a pile-up at a football game, you guys wouldn't even be asking me that question,\" Fizdale said of the tussle. \"(Beverley) may have given him a little bit of extra, but that's part of the deal. When two really good teams are going at it, nobody is going to give it up. I wasn't worried about it at all.\"\n\nUP NEXT\n\nRockets: Host the Phoenix Suns on Monday.\n\nGrizzlies: Play six of their next seven games on the road, starting with back-to-back contests Monday at Orlando and Tuesday at Boston.",
  "source": "espn_api",
  "crawled_at": 1764995610.951881
}