{
  "game_id": "0021800162",
  "espn_id": "401070843",
  "date": "Nov 07, 2018",
  "matchup": "MIN @ LAL",
  "headline": "LeBron leads Lakers to 3rd win in 4, 114-110 over Wolves",
  "body": "LOS ANGELES --  Tyson Chandler savored the ovations when he first took the court in downtown Los Angeles. The cheers at the end were even sweeter.\n\nThe Lakers' newest big man got to represent his hometown Wednesday night for the first time in his 18 NBA seasons, and he came up bigger and better than even he expected in a hard-fought win.\n\nLeBron James had 24 points, 10 rebounds and nine assists, and Kyle Kuzma scored six of his 21 points in the final minutes of the Lakers' 114-110 victory over the Minnesota Timberwolves.\n\nJames, Kuzma and Josh Hart played major roles in the Lakers' third win in four games, but they all directed praise toward Chandler, who joined the Lakers on Tuesday after reaching a buyout agreement with Phoenix. After LA's savvy basketball fans welcomed Chandler to town with cheers, the veteran provided much of what the Lakers have been lacking this season.\n\n\"It's honestly all love,\" Chandler said. \"I love this city the way they love me. When you're homegrown from here and going to high school and all that and you've had these same fans, and now you represent the jersey that everybody has been cheering for their entire lives, you kind of become one. I've been on the other side and played the villain. Now it's great to be on this side and actually rep them.\"\n\nWith only a cursory knowledge of the Lakers' plays and schemes, Chandler still provided defense, rebounding and hard picks while playing a surprising 23 minutes.\n\nChandler's nine rebounds included two enormous offensive boards in the last minute. He then contested Derrick Rose's final 3-point attempt, forcing a miss that essentially sealed the win.\n\n\"You can tell he's a young-old guy that's happy to be back home, and he played with a lot of energy tonight,\" said Rajon Rondo, who was thanked by Chandler for vocally directing him around the court.\n\nHart scored 21 points and Brandon Ingram added 20 for the Lakers, who avenged a loss at Minnesota nine days earlier with a tenacious finish at Staples Center.\n\nKuzma's fourth 3-pointer put the Lakers up 111-104 with 1:51 to play, but Rose promptly hit back-to-back 3-pointers for the Wolves. After Chandler twice extended the Lakers' ensuing possession, Kuzma hit one of two free throws with 9.5 seconds left.\n\nRose then missed his last 3 under heavy defensive pressure from Chandler, and Hart hit two free throws to seal it. Minnesota coach Tom Thibodeau thought Rose deserved a foul.\n\n\"They're not going to give me that call,\" Rose said with a shrug. \"They haven't been giving me that call, so I've just got to get used to it.\"\n\nRose scored 31 points and Jimmy Butler added 24 for the Timberwolves, who dropped to 0-7 on the road this season with their fourth consecutive loss overall. Minnesota had won five straight over the Lakers.\n\nTIP-INS\n\nTimberwolves: Butler converted a four-point play to tie it at 94 with 7:44 to play. ... Thibodeau used the same starting lineup from Monday's loss to the Clippers.\n\nLakers: James fell just shy of his 75th triple-double, but scored nine points in the fourth quarter. ... Chandler grew up in several parts of California before moving to Compton, where he starred at Dominguez High School and became the No. 2 pick in the 2001 NBA draft. ... Chandler backed up JaVale McGee, who had 16 points on 8-of-10 shooting.\n\nGOOD STARTS\n\nMinnesota came out in an offensive groove during its second straight game at Staples Center following Monday's loss to the Clippers. All five Wolves starters reached double figures in the first half while hitting 66 percent of their shots. Rose and Wiggins hit three 3-pointers apiece and all five starters contributed to an 11-for-17 performance beyond the arc, tying the franchise record for 3s in a first half.\n\nBut the Lakers didn't get humiliated in the first quarter, as they did last Sunday in their loss to Toronto. Hart hit four 3-pointers in the first half, and Kuzma hit a buzzer-beating 3 to limit Minnesota's lead to 67-65.\n\nBAD BOARDS\n\nMinnesota was outrebounded 47-40, and it was most glaring in that final minute. \"Very, very frustrating to know we were that close, and all we have to do is rebound the basketball,\" Butler said. \"But that's been the story for us so far. We've been right there. We've been outrebounded. We have to figure out a way to go get the ball.\"\n\nUP NEXT\n\nTimberwolves: At the Sacramento Kings on Friday night.\n\nLakers: At the Sacramento Kings on Saturday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994073.0242019
}