{
  "game_id": "0021500574",
  "espn_id": "400828461",
  "date": "Jan 12, 2016",
  "matchup": "OKC @ MIN",
  "headline": "Durant helps OKC hold off Timberwolves, 101-96",
  "body": "MINNEAPOLIS --  The Oklahoma City Thunder were letting another big fourth-quarter lead start to slip away, and precocious Minnesota Timberwolves point guard Zach LaVine was starting to look a little too much like Damian Lillard for Kevin Durant's liking.\n\nSo the Thunder star took matters into his own hands to help the Thunder avoid what would have been a second straight ugly collapse.\n\nDurant shrugged off a slow start to score 12 straight points in the final three minutes and finished with 30 points in a 101-96 victory over the Timberwolves on Tuesday night.\n\n\"It felt like I need to get it going in the first three quarters,\" said Durant, who was 7 for 21 through three periods. \"I can't just come out and try to save the game and make shots in the fourth. I've got to get it going earlier. I've got to make shots, man. That's what it's about.\"\n\nRussell Westbrook added 22 points, 11 assists and seven rebounds to help the Thunder hold off a late charge from the struggling Wolves, one game after giving up a big lead to the Portland Trail Blazers. The Thunder made 9 of 22 3-pointers to cruise to their seventh win in nine games.\n\nLaVine broke out of a miserable slump with 21 points, nine rebounds and four assists. Shabazz Muhammad scored 20 points for the Timberwolves, who have lost seven straight games and 11 of their last 12.\n\nAndrew Wiggins scored 20 points for Minnesota, which is 5-17 at home.\n\n\"OKC's a really good team and got off to a really quick start on us, but everyone played well tonight,\" Muhammad said.\n\nThe Thunder came into the game ornery after giving up five 3-pointers to Portland's Lillard in the final three minutes of a 115-110 loss on Sunday night.\n\nWestbrook made 8 of 15 shots and forced Wiggins to expend much of his energy guarding the robo-guard. Enes Kanter scored 18 points off the bench and only missed two of his 10 shots.\n\nThe Thunder led 15-2 before the first quarter was half over and were up 78-60 in the third quarter before they started carelessly jacking up 3s to give the Wolves an opening.\n\nLaVine converted a three-point play and hit a 3 from the wing before Nemanja Bjelica hit another 3 to help the Wolves cut the deficit to three points with 3:15 to play.\n\nBut Durant hit four straight jumpers and four free throws for Oklahoma City to avoid another collapse.\n\n\"I think the one thing about him is he always stays engaged,\" Thunder coach Billy Donovan said. \"He's got a lot of confidence, he's put a lot of time in and he's worked really hard so in those moments he's prepared to step up regardless of what's happened with the shot before.\"\n\nLAVINE'S SLUMP\n\nOver the previous nine games, LaVine was shooting 25 percent from the field and 8 percent on his 3-pointers. He's shuffled between point guard and shooting guard this season, and interim coach Sam Mitchell said he's been hard on the 20-year-old, much like he was on Jose Calderon in Toronto.\n\n\"When he gets through this, he's going to be a much better player because he's going to have gone through the fire,\" Mitchell said. \"He's going to be tried and tested. He's going to have felt low and dejected sometimes, but that's how point guards are made.\"\n\nLaVine didn't appear to be terribly enamored with Mitchell's approach.\n\n\"It's not fun,\" he said. \"Sometimes unfair. But he's coach and I'm player and that's what you have to deal with.\"\n\nTIP-INS\n\nThunder: Donovan picked up his first career technical foul while arguing for a goaltending call in the first quarter.\n\nTimberwolves: C Nikola Pekovic sat out to rest after playing his first three games of the season in his return from Achilles surgery. He is expected to play on Wednesday in Houston while starter Kevin Garnett rests on the second night of a back-to-back. ... LaVine made a crazy layup after getting hammered by Durant with 3:25 to play, but a review showed the ball hit the top of the backboard first so it was waved off.\n\nUP NEXT\n\nThunder: Host Dallas on Wednesday.\n\nTimberwolves: Visit Houston on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994174.874178
}