{
  "game_id": "0021600911",
  "espn_id": "400900306",
  "date": "Mar 03, 2017",
  "matchup": "ORL vs. MIA",
  "headline": "Nikola Vucevic scores 25 points, Magic beat Heat 110-99",
  "body": "ORLANDO, Fla. --  As far as Aaron Gordon is concerned, his chemistry with Elfrid Payton is real basic.\n\n\"He likes to throw lobs. I like to catch and dunk lobs,\" Gordon said.\n\nTheir connection proved critical Friday night against Miami when Payton saw Gordon rolling to the basket and sent an alley-oop pass that Gordon powerfully threw it down with 3:43 to play. That play stemmed a late run by the Heat in Orlando's 110-99 victory Friday night.\n\nGordon's dunk sparked an 11-8 run to thwart Miami's comeback attempt.\n\n\"It was just big,\" said Gordon, who finished the night with 21 points and 10 rebounds. \"Dunks sometimes are worth more than two points. On that it seemed like that was a little extra.\"\n\nThe Magic, who are making the transition a smaller quicker style of play, seemed to have a little extra all night. They used to their speed and quick run past a Miami team that had won 17 of its previous 20 games to climb back into the Eastern Conference playoff race.\n\nBut the Heat couldn't keep pace with the Magic on either end. The Magic were either converting fast break baskets or moving the ball for efficient shots all night.\n\nCenter Nikola Vucevic outplayed Hassan Whiteside throughout, scoring 25 points, which include a 3-pointer in the first quarter. Whiteside scored 15 points and grabbed 18 rebounds, but like most his teammates found it hard to get open shots.\n\nThe Magic, which is a longshot to make the playoffs, recorded their third straight win over Miami this season and won the season series 3-1. James Johnson led the Heat off the bench with 19 points, while starting guards Dion Waiters and Goran Dragic struggled throughout for a combined four of 25 from the field.\n\n\"It's kind of frustrating when you are losing to a team that basically is already planning for vacation,\" said Dragic, whose team entered the night just one game out of eighth place in the Eastern Conference standings. \"It's tough.\"\n\nThe Magic beat Miami in the critical areas. They outscored the Heat 20-14 on fast break points and won the battle in the paint by a margin of 64-36 on a night in which they led throughout.\n\n\"Obviously this season this team has annihilated us in the paint this season but we got a little bit better each game with our containment,\" said Magic coach Frank Vogel, whose team led by as many as 19 points. \"We're built better now with our small ball attack to play against a team like this.\"\n\nTIP-INS\n\nHeat: After missing the last two games, backup center Willie Reed went through practice Thursday and shoot around Friday and was cleared to play Friday night. Reed had been out since suffering an ankle injury last Saturday against Indiana. ... During the first six minutes, the Heat were shooting 16.7 percent from the field and trailed Orlando 19-7.\n\nMagic: Point guard C.J. Watson returned to action Friday night after missing the previous three games with a sore right Achilles. But Watson did assume his starting role with Frank Vogel opting to stick with Payton for now. ... Fournier, who finished with 11 points Friday, averaged 23.3 points in the previous three meetings with the Heat this season. ... Gordon had 17 points and nine rebounds in the first half.\n\nPAYTON'S PLACE\n\nPayton has had an up and down year, but Vogel said Friday was his best performance of the season.\n\nPayton finished with 12 points, 10 rebounds, eight assists and just three turnovers while the Magic was plus-27 points with him on the floor.\n\n\"He didn't score a ton of points but played with great control and great confidence, worked to defend,\" Vogel said. \"He was a big part of the win.\"\n\nUP NEXT\n\nHeat: Host Cleveland on Saturday.\n\nMagic:  At Washington on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995827.2727349
}