{
  "game_id": "0021900594",
  "espn_id": "401161236",
  "date": "Jan 13, 2020",
  "matchup": "OKC @ MIN",
  "headline": "Gilgeous-Alexander's first triple-double leads Thunder",
  "body": "MINNEAPOLIS --  Shai Gilgeous-Alexander's goal was to play a better all-around game. He did that and then some.\n\nGilgeous-Alexander had 20 points, a career-high 20 rebounds and 10 assists in his first triple-double, leading the Oklahoma City Thunder to a 117-104 victory over the Minnesota Timberwolves on Monday night.\n\n\"Coach had challenged me before the game to fill up the stat sheet more and do more things,\" Gilgeous-Alexander said. \"Because he thought, as well as myself thought, that I was more capable of what I was doing.\"\n\nGilgeous-Alexander came in averaging 23.7 points in his previous 13 games but did much more than score in this one, also matching his career best in assists. He became the youngest player in league history to record at least 20 points, 20 rebounds and 10 assists in a game.\n\n\"He's tough. He's very tough,\" Minnesota's Andrew Wiggins said. \"He's a big guard that can put it on the floor and create for others, and he's a bucket. He can make a bucket when he needs to.\"\n\nGilgeous-Alexander is the fourth second-year player in NBA history to register a 20-20 triple-double. He joins Shaquille O'Neal, Charles Barkley and Oscar Robertson. The only other guard to have a 20-20 triple-double in the last 30 seasons is former Thunder star Russell Westbrook.\n\nThat after Gilgeous-Alexander did not record an assist in 35 minutes against the Lakers on Saturday.\n\n\"I just felt like we were on our heels a little bit in the previous game against the Lakers,\" Gilgeous-Alexander said. \"That was one of the things that Coach mentioned to us, attacking first. I felt we did that as a group. When you attack as a group, you get more comfortable faster.\"\n\nDanilo Gallinari scored 30 points for the Thunder, who have won 12 of their past 15 games and six of seven on the road.\n\nNaz Reid scored 20 off the bench for Minnesota, which was still without Karl-Anthony Towns. Reid has scored in double figures in six of the last eight games. Robert Covington scored 18 points.\n\nThe Thunder held a 63-60 lead at halftime. They went on an 11-2 run early in the third quarter and then a 10-3 burst midway through the third to push their lead into double figures. Oklahoma City led by as many as 18.\n\n\"I thought the third quarter for us was important,\" Thunder coach Billy Donovan said. \"We had some action, had some really good ball movement, had some great clips offensively. I thought that was critical.\"\n\nSteven Adams had 13 points, 11 rebounds and five assists for the Thunder.\n\nShabazz Napier scored 16 points for the Timberwolves. Rookie Jarrett Culver scored 14 points.\n\n\"We obviously need more from everybody when we have guys that are out who are big parts of this team,\" Minnesota coach Ryan Saunders said. \"I was happy with some of the guys.\"\n\nTIP-INS\n\nThunder: Forward/center Nerlens Noel missed his fifth consecutive game because of a left ankle sprain. Guard/forward Andre Roberson (left knee injury recovery) has yet to play this season. ... Gallinari was 11 for 12 from the free throw line. Gallinari's 30 points came on 8-for-12 shooting. ... Chris Paul was held without a point or assist in 15 first-half minutes and finished with 10 points and three assists. It was the first time in his career he did not record a point or assist in a half in which he played 10 or more minutes.\n\nTimberwolves: Towns has missed 14 games with a left knee sprain. He also was battling an illness Monday. ... Forward Jake Layman missed his 25th straight game with a left toe sprain. ... Minnesota had a three-game home win streak snapped.\n\nWELCOME HOME\n\nThunder big man Mike Muscala, who attended nearby Roseville High School, scored 11 points off the bench. Muscala hit three 3-pointers in 12 minutes of action.\n\n\"It was nice to be home, see my house,\" Muscala said. \"See a little bit of snow was kind of nice for a change.\"\n\nQUIET SECOND HALF\n\nWiggins scored 10 points in the first half but was held scoreless in the second half. After shooting 4 for 6 in the first half, he was 0 for 6 in the second half.\n\n\"Not too sure,\" Wiggins said. \"I couldn't figure it out.\"\n\nUP NEXT\n\nThunder: Host Toronto on Wednesday. Oklahoma City won the first meeting between the teams 98-97 in OT on Dec. 29.\n\nTimberwolves: Host Indiana on Wednesday in the first meeting of the teams this season.",
  "source": "espn_api",
  "crawled_at": 1764996222.825471
}