{
  "game_id": "0021601144",
  "espn_id": "400899431",
  "date": "Apr 02, 2017",
  "matchup": "MIL vs. DAL",
  "headline": "Barnes scores 31, Mavs beat Bucks 109-105 to end skid at 4",
  "body": "MILWAUKEE --  Dallas Mavericks coach Rick Carlisle had nothing but praise for his scrappy team.\n\nHarrison Barnes scored 15 of his 31 points in the fourth quarter to lift the Mavericks to a 109-105 victory over the listless Milwaukee Bucks on Sunday.\n\n\"We have a high-character group, just look at our entire season,\" Carlisle said. \"Guys have continued to play hard and play together the entire time.\"\n\nBarnes made 10 free throws, a 3-pointer and a fade-away jumper in the decisive fourth quarter. He came in for Dirk Nowitzki with 10:12 left and carried the team, especially at the foul line.\n\n\"The biggest reason (for the win) was we got to the bonus early,\" he said. \"That gave us some room to be aggressive, force them to call the whistle and try to get to the free throw line.\"\n\nThe Mavericks made a season-high 19 consecutive free throws, including 15 straight down the stretch, and finished the game 19 for 20.\n\nGreg Monroe said the Bucks did what the Mavericks wanted them to, and it cost Milwaukee.\n\n\"We played their game,\" Monroe said. \"We played at the pace they wanted to play at. Down the stretch, they got a lot of points at the free throw line. We've got to be better at not giving them easy points.\"\n\nBucks coach Jason Kidd agreed with Monroe's assessment.\n\n\"We were working into our game, and they were already into the game,\" Kidd said.\n\nBarnes played more minutes than Carlisle wanted because Nowitzki was experiencing some mild pain in his right Achilles tendon.\n\n\"We didn't want him to mess around,\" Carlisle said of Nowitzki.\n\nThe Mavericks fought as if they still had a chance at the playoffs, while the Bucks frittered away an opportunity to cement their hold on the fifth spot in the Eastern Conference.\n\n\"At this point, we're playing with pride and trying to build for next season,\" Barnes said. \"Slow starts have plagued us all season long. Tonight was a great opportunity for us to start off the game the right way.\"\n\nDallas capitalized on 15 turnovers, turning them into 19 points, and Nicolas Brussino's uncontested layup gave the Mavericks a 91-82 lead with 7:12 left to play.\n\nThe Bucks found some late energy and pulled to 106-103 on Matthew Dellavedova's 3-pointer with 1:24 to play, but got no closer.\n\nNowitzki and J.J. Barea each had 17 points as the Mavericks snapped a four-game losing streak. Yogi Ferrell had 13 filling in for the ailing Seth Curry.\n\nGiannis Antetokounmpo had 31 points and 15 rebounds for the Bucks, fresh off a 14-4 record in March. That was the franchise's third-most wins in a month and best mark since the 1970-71 NBA championship team went 16-2 in February.\n\n\"I think it wasn't who we are today,\" Antetokounmpo said. \"We didn't play hard enough. We didn't do what we usually do. That's the game, and we move on.\"\n\nGary Payton II, signed to a multiyear contract before the game, entered the game with 5:18 left in the third. He hit his first shot, a wide-open 3, and followed that up with a dunk that gave the Bucks a 74-68 lead.\n\nTIP-INS\n\nMavericks: Curry aggravated his injured left shoulder Friday night at Memphis. Carlisle is hopeful that Curry, who continues receiving treatment, could play Tuesday in Sacramento.\n\nBucks: Rookie G Malcolm Brogdon missed his second consecutive game with back tightness. He sat out Friday's win over Detroit and missed two games earlier in March with the same problem. Kidd said that Brogdon would make the road trip, if he felt better. ... C John Henson (sprained left thumb) missed his seventh consecutive game.\n\nSEASON SWEEP\n\nDallas has won nine of the last 11 meetings with the Bucks, including an 86-75 overtime victory earlier this season. Barnes scored a career-high 34 points and grabbed eight rebounds in that game.\n\nUP NEXT\n\nMavericks: Dallas continues its season-high, five-game road trip Tuesday against the Sacramento Kings.\n\nBucks: Begin a three-game road trip Tuesday against the Oklahoma City Thunder.",
  "source": "espn_api",
  "crawled_at": 1764995127.286889
}