{
  "game_id": "0022400704",
  "espn_id": "401705270",
  "date": "Feb 03, 2025",
  "matchup": "SAC @ MIN",
  "headline": "After dealing Fox, Kings eke out 116-114 road win over Timberwolves",
  "body": "MINNEAPOLIS -- — DeMar DeRozan scored 33 points, and the Sacramento Kings edged the Minnesota Timberwolves 116-114 on Monday night after finalizing their trade for Zach LaVine.\n\n\r\n              Malik Monk had 26 points for the Kings, who closed out a 2-6 road trip. Keegan Murray added 19 points.\n\n\r\n              Sacramento traded De’Aaron Fox to San Antonio as part of a three-team trade that put LaVine on the Kings. LaVine likely will play in his first game with his new team on Wednesday.\n\n\r\n              Naz Reid led Minnesota with a season-high 30 points, including 16 in the first quarter. Jaden McDaniels added 22, and Anthony Edwards finished with 21 points.\n\n\r\n              Minnesota was without forward Julius Randle for the second straight game. Randle was sidelined with a groin injury.\n\n\r\n              After trailing by as many as 12, the Timberwolves managed to take a brief 91-90 lead early in the fourth quarter. But the Kings regained the lead, and they had an answer every time the Timberwolves made a push down the stretch.\n\n\r\n              Takeaways\r\n              Kings: With Fox gone, Monk stepped in at point guard. In addition to his 26 points, Monk finished with five assists and eight rebounds while controlling Sacramento's offense. Monk hit a pair of big shots late in the fourth quarter, as well as four free throws in the final 17 seconds of the game.\n\n\r\n              Timberwolves: Minnesota didn't rebound from its loss Saturday to the NBA-worst Washington Wizards, losing its second straight game to a team with an inferior record.\n\n\r\n              Key moment\r\n              DeRozan made a layup to put the Kings up 110-106 with just 30 seconds remaining.\n\n\r\n              Key stat\r\n              Minnesota shot 16 more 3-pointers than the Kings (40-24) but made just two more shot from deep (12) than Sacramento.\n\n\r\n              Up next\r\n              The Kings host Orlando on Wednesday, while Minnesota hosts Chicago on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997326.701688
}