{
  "game_id": "401810155",
  "espn_id": "401810155",
  "date": "Nov 29, 2025",
  "matchup": "LAC vs DAL",
  "headline": "Flagg scores season-high 35 and Thompson rallies Mavericks past Clippers 114-110",
  "body": "LOS ANGELES -- — Cooper Flagg had a season-high 35 points and Klay Thompson scored 17 of his 23 in the fourth quarter to rally the Dallas Mavericks to a 114-110 victory over the Los Angeles Clippers on Saturday night. \n\n\r\n              Thompson hit four 3-pointers in the final period, his final one putting Dallas ahead for good with 1:51 left. He shot 6 of 10 from long distance overall as the Mavericks snapped a three-game losing streak. \n\n\r\n              Flagg went 13 for 22 from the field in his 20th career game. The top pick in this year's NBA draft also grabbed eight rebounds. His previous high was 29 points in a 118-115 win over New Orleans on Nov. 21.\n\n\r\n              Naji Marshall added 18 points and eight boards for Dallas. Brandon Williams had 14 points and seven assists. \n\n\r\n              Kawhi Leonard led Los Angeles with 30 points and eight rebounds. James Harden added 29 points, 11 assists and eight boards for the Clippers, who dropped their fourth consecutive game. John Collins scored 21 and Ivica Zubac had 19 points and 11 boards. \n\n\r\n              Los Angeles (5-15) has lost seven straight at the Intuit Dome since beating New Orleans 126-124 on Halloween night. \n\n\r\n              The Mavericks (6-15) scored 20 points off 18 Clippers turnovers.\n\n\r\n              Dallas trailed much of the third quarter before Thompson bookended a 13-2 run with 3-pointers to help the Mavericks grab an 87-83 advantage early in the fourth. The teams traded the lead throughout the period before Los Angeles went up 103-101 on a 3 from Collins.\n\n\r\n              Thompson answered with his sixth 3-pointer to put Dallas back in front, 104-103. Flagg hit six free throws in the final 1:20 to help the Mavericks hold on.\n\n\r\n              Flagg made 10 baskets and scored 21 points by halftime. His turnaround fadeaway jumper punctuated a 15-2 run that gave Dallas a 33-28 lead early in the second quarter.\n\n\r\n              Consecutive go-ahead baskets from Leonard helped the Clippers stop the Mavericks’ surge. Leonard knocked down two more shots later in the second to help Los Angeles extend its lead to 47-38.\n\n\r\n              Up next\r\n              Mavericks: At the Denver Nuggets on Monday.\n\n\r\n              Clippers: At the Miami Heat on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042720.202493
}