{
  "game_id": "0021600097",
  "espn_id": "400899547",
  "date": "Nov 07, 2016",
  "matchup": "OKC vs. MIA",
  "headline": "Kanter scores 24 as Thunder beat Heat 97-85",
  "body": "OKLAHOMA CITY --  Even without another scoring outburst from Russell Westbrook, the Oklahoma City Thunder easily handled Miami.\n\nWestbrook had just 14 points -- 19 below his season average entering the game -- but the Thunder still beat the Heat 97-85 on Monday night.\n\nEnes Kanter had 24 points and 10 rebounds, shooting 10 of 12 in 21 minutes off the bench. Victor OIadipo scored 17 and rookie Domantas Sabonis had a season-high 15 points to go with 10 rebounds for Oklahoma City.\n\nWestbrook finished with 11 assists, and his control of the action helped the Thunder build a 22-point lead after three quarters. He didn't play in the fourth.\n\n\"He's always looking for his teammates,\" Kanter said. \"He's looking to score, but he knows that he's going to get double-teamed, triple-teamed. They cannot guard him. There's no one guy in the league that can guard him 1-on-1. He's making himself better, and he's making everybody else better on the team.\"\n\nOklahoma City improved to 6-1, the best seven-game start for the franchise since moving to Oklahoma City in 2008.\n\nMiami's Hassan Whiteside, who entered averaging 20 points and 14.2 rebounds, finished with five points on 1-for-9 shooting and 12 rebounds.\n\nWestbrook said Thunder center Steven Adams played well against Whiteside.\n\n\"Steven did a good job of buckling down, using his size, using his ability to be able to use his body and his strength to match,\" Westbrook said.\n\nJames Johnson led the Heat with 18 points. Miami shot just 36.9 percent from the field.\n\n\"You have to give them credit defensively,\" Heat coach Erik Spoelstra said. \"They've shown this year they're long, they're athletic, they make multiple efforts.\"\n\nThe Thunder led 55-47 at halftime, despite Westbrook's 2-for-10 shooting.\n\nThe Heat chopped their deficit down to four before Westbrook went off. He converted a three-point play, a mid-range jumper and a 3-pointer to spark a 20-0 run that put the game out of reach.\n\n\"He's a great player, so he's going to have his fingerprints on the game one way or another,\" Spoelstra said. \"It's a matter of time, and you have to find a way as competitors to overcome all of that, and we didn't.\"\n\n---\n\nTIP-INS\n\nHeat: Former Thunder player Dion Waiters was cheered loudly during pregame introductions. He scored two points on 1-for-9 shooting. ... Whiteside had no points or rebounds in the first quarter. ... Double technicals were called on Kanter and Miami's Josh Richardson in the third quarter after an altercation. Heat C Willie Reed was called for a flagrant foul on Kanter late in the third quarter.\n\nThunder: Oklahoma City coach Billy Donovan said before the game that reserve point guard Cameron Payne is healing from his broken right foot, but there remains no timetable for his return. ... Adams banged his right thumb in the first quarter, but returned to play with it wrapped.\n\nHEAT UNIFORMS\n\nThe Heat wore patches bearing the names of deceased military members on the front of their uniforms for the first time, a tribute that will continue for four more games. The \"Home Strong\" uniforms -- which have been worn before, without the soldier-name patches -- feature military insignia and patriotic symbols. Heat President Pat Riley founded the program to honor returning soldiers in 2006, and the franchise has been active with several veterans' programs since. \"It's just a very small part that we can play in this, to let them know that their lives did have significance,\" Spoelstra said.\n\nQUOTABLE\n\nWestbrook on Sabonis' performance: \"I was very, very happy for Domas. He stayed aggressive all night long. He missed some shots early, but he stayed consistent.\"\n\nSTAT LINES\n\nThe Thunder held Miami to 7-for-24 shooting in the third quarter to take an 83-61 lead at the end of the period.\n\nUP NEXT\n\nHeat: Miami hosts former teammate Dwyane Wade and the Chicago Bulls on Thursday. Wade won three NBA titles with Miami. \"That will be a special moment,\" Spoelstra said. \"It means a lot to all of us, including myself. We know how to compartmentalize.\"\n\nThunder: Faces one of the best teams in the East on Wednesday night when they host the Toronto Raptors.\n\n---\n\nFollow Cliff Brunt on Twitter (at)CliffBruntAP",
  "source": "espn_api",
  "crawled_at": 1764995336.909417
}