{
  "game_id": "0022000419",
  "espn_id": "401267579",
  "date": "Feb 14, 2021",
  "matchup": "LAC vs. CLE",
  "headline": "Williams' 30 points leads Clippers in 128-111 rout of Cavs",
  "body": "LOS ANGELES -- — Lou Williams scored a season-high 30 points in his first start of the season, and the Los Angeles Clippers defeated Cleveland 128-111 on Sunday night, sending the Cavaliers to their seventh straight loss.\n\n\r\n                    The three-time Sixth Man of the Year added a season-high 10 assists and made all eight of his free throws on a night when the Clippers were without Kawhi Leonard and Paul George. Leonard has a lower left leg contusion and Paul is dealing with bone swelling in his right toe.\n\n\r\n                    Williams has been on a roll, scoring 20-plus points in three of his last four games.\n\n\r\n                    “He had to get his rhythm and his legs under him,” teammate Patrick Beverley said. “He's been in the league since high school, so he's got some miles on him. We're happy those legs are on him now. He's been dangerous.\"\n\n\r\n                    Marcus Morris had a season-best 23 points off the bench for the Clippers, who have won three in a row and seven of 10. Serge Ibaka finished with 21 points, nine rebounds and six assists.\n\n\r\n                    Collin Sexton scored 23 points for the short-handed Cavs. Darius Garland and reserve Cedi Osman each scored 20 points. \n\n\r\n                    Cleveland has dropped nine of 11.\n\n\r\n                    The Clippers got the rout going in the third when they scored 36 points after notching 38 in the second. Beverley and Williams combined to score their first 14 points, including eight in a row, for an 84-60 lead. Reggie Jackson's three-point play provided the Clippers' largest lead of 28 points.\n\n\r\n                    “It started at the end of the second,\" Cavs coach J.B. Bickerstaff said. “It was a six-point game and we had some costly decision-making errors. It went up to 12 at halftime. They got momentum and confidence and put the game out of reach.\"\n\n\r\n                    The Cavs never made a run in the fourth. Their only lead came in the first when they opened the game on a 7-2 spurt.\n\n\r\n                    “Defensively, we have to be better. It’s not enough against high-scoring teams,\" Osman said. “We have to play harder. They’re not letting us score easy but we gave up so many easy points.\"\n\n\r\n                    Beverley and Williams quickly shut down the Cavs, combining for 14 of the Clippers' first 16 points to start the game. Ibaka, Morris and Terrance Mann teamed to run off eight in a row after their teammates' early scoring binge.\n\n\r\n                    “With this new coaching staff, they've been telling me let it fly even if it's being contested,\" said Beverley, who had four 3-pointers. “Those shots have been going in.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: Played without Andre Drummond (rest), Matthew Dellavedova (concussion), Larry Nance Jr. (left hand fracture) and Kevin Love (right calf strain), who has been out since Dec. 27. ... They lost the season series, having been beaten by 22 points on Feb. 3.\n\n\r\n                    Clippers: Beverley reached 4,000 career points on a 3-pointer in the third quarter. “He's proud as hell right now,\" Williams said. ... They improved to 2-1 without Leonard and George in the lineup this season.\n\n\r\n                    HE SAID IT\n\n\r\n                    “I have one thing I haven't done in this business and that's win an NBA championship. That's the thing that gets me up and gets me motivated.” — Williams, in his 16th year in the league.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Visit Golden State on Monday to conclude five-game trip.\n\n\r\n                    Clippers: Host Miami on Monday in the second game of a back-to-back. They are 4-0 in such games.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997689.227784
}