{
  "game_id": "0021400681",
  "espn_id": "400578973",
  "date": "Jan 28, 2015",
  "matchup": "POR @ CLE",
  "headline": "Kyrie Irving scores 55, leads Cavs minus LeBron to 8th win in row",
  "body": "CLEVELAND -- Kyrie Irving put on a spectacular show, and LeBron James watched it from a front-row seat.\nIrving scored a career-high 55 points, breaking the arena record as James sat out with an injury to lead the Cleveland Cavaliers to their eighth straight win, 99-94 over the Portland Trail Blazers on Wednesday night.\n\nWith James sidelined because of a sprained right wrist, Irving delivered a dazzling, tour-de-force performance.\nOne day before the NBA names its All-Star reserves, Irving put an exclamation point on his resume.\nIrving, who scored 38 on Tuesday in a win at Detroit, made a team-record 11 3-pointers and finished 10-of-10 from the free throw line. He scored 24 of Cleveland's final 28 points and 16 of the Cavs' 20 in the fourth quarter. But it was his long jumper with 6.4 seconds left that shook Quicken Loans Arena.\nIrving buried a 3-pointer to break a 94-all tie, then grabbed a rebound off a missed 3-pointer by Portland's Damian Lillard. And as many in the crowd chanted \"M-V-P\" and James danced near the bench, Irving dropped two free throws with 2.1 seconds remaining to seal the win.\n\"It was a total team effort,\" Irving said, trying to spread praise to his teammates.\nJames knew better. The four-time MVP politely declined to speak to reporters, saying the focus should be only on Irving.\n\"This is his night,\" James said.\nNo doubt, although James later weighed in via Twitter.\n\n\nIrving, who missed his first seven shots, broke the previous arena scoring mark set by Allen Iverson on Jan. 6, 2001. His point total also was the highest in the league this season, bettering the 52 scored by Golden State's Klay Thompson and Minnesota's Mo Williams.\nIrving was at his best at the end of quarters, scoring Cleveland's last 11 points in the first, the final eight in the second and third, and 10 of the Cavs' last 12.\nHis final shot was magnificent in so many ways. Dribbling the ball on the right side as the clock ticked down, Irving froze 6-foot-8 forward Nicolas Batum with a move toward the basket before stopping and sinking his 11th 3-pointer. After the Trail Blazers called timeout, and as 20,562 fans screamed, James ran onto the floor and greeted his teammate with a chest bump.\n\nBatum felt he had done all he could to stop Irving.\n\"He's so quick you don't want to get too close,\" Batum said. \"You have to control the drive. I tried to contest the shot. I was on him, but he made a big shot.\"\nJames sprained his wrist Tuesday, when he fell hard after trying to block a shot against Detroit. James reached out with both arms to brace his fall and said afterward he was scared after breaking his left wrist on a similar play while in high school. The team said an MRI revealed the sprain and that James is doubtful for Friday's game against Sacramento.\nUntil he's ready, Irving can carry the load.\nLaMarcus Aldridge, playing his second game since deciding to delay thumb surgery until after the season, scored 38 to lead the Trail Blazers, who have dropped six of seven. Lillard added 14 on just 4-of-19 shooting and was unable to do much defending Irving.\n\"He played great,\" Lillard said. \"I've seen him get on streaks before, but usually they're midrange pull-ups and nice layups, not 11 3s. He's in a good rhythm.\"\nIrving was nearly unstoppable in the first half.\nHe scored 11 points in the final 1:39 of the first quarter, a mere appetizer for his scoring spree. He drove past Lillard for several layups, and when Portland's speedy guard gave him some space, Irving made him pay by dropping six 3-pointers.\nLOVE LOST\nCleveland's Kevin Love had another off night. He shot just 3-of-15 from the field, missing his last 11 attempts. In the past two games, he's 6-of-26. Love left briefly in the fourth quarter after banging knees with Portland's Chris Kaman.\nTIP-INS\nTrail Blazers: Portland spent two days in Cleveland, arriving earlier than planned after Monday night's game in New York was postponed by the massive snowstorm in the Northeast. \"I was glad we could get out of New York when we did,\" coach Terry Stotts said. \"The travel could have been much worse. With the way the forecasts were, if we had played the game, we would have been in New York for a little bit longer.\" ... Stotts said Aldridge's decision to delay surgery didn't surprise him. \"He's been a consummate pro since I've been here,\" he said. \"I like the fact he was very aggressive. He didn't shy away from contact. He didn't show any ill effects of the hand bothering him at all.\"\nCavaliers: Once James returns, coach David Blatt intends to keep a close eye on the minutes he plays going forward. \"We're doing our best to keep him fresh,\" Blatt said. \"We will try not to overplay him in any game.\" ... The Cavs improved to 2-8 without James.\nUP NEXT\nTrail Blazers: At Atlanta on Friday.\nCavaliers: Host Sacramento on Friday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764992070.2988338
}