{
  "game_id": "0022000471",
  "espn_id": "401267631",
  "date": "Feb 21, 2021",
  "matchup": "SAC @ MIL",
  "headline": "Antetokounmpo, Middleton lead Bucks past Kings 128-115",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 38 points and Khris Middleton scored 32 to lead the Milwaukee Bucks past the skidding Sacramento Kings 128-115 on Sunday night. \n\n\r\n                    “I thought individually they were good, and they had good moments together,” Milwaukee coach Mike Budenholzer said. “I thought our defense set the table and we were able to get out and both of them were able to be in attack mode.”\n\n\r\n                    The Bucks won their second straight after ending a five-game losing streak with a victory over Oklahoma City on Friday night. \n\n\r\n                    “It felt good. We were making the right plays. We were being aggressive. We were finding teammates,\" Antetokounmpo said. \"We’ve done this for eight years.” \n\n\r\n                    Antetokounmpo added 18 rebounds, one off his season best, as the Bucks sent the Kings to their seventh consecutive loss. Milwaukee has won nine in a row against Sacramento.\n\n\r\n                    The two-time reigning MVP attempted 24 free throws, a career high. He made 19, tied for his most ever.\n\n\r\n                    “Part of the game plan was if he has a layup, let’s wrap him up. He’s supposed to be a 64% free throw shooter,\" Kings coach Luke Walton said. “Unfortunately, tonight he looked like Steve Nash shooting free throws.”\n\n\r\n                    The Bucks led 28-25 after one quarter but poured it on in the second, leading by as many as 17. \n\n\r\n                    Milwaukee began to take control midway through the period when Jabari Parker appeared to draw a charge on Antetokounmpo as he sank a short jumper. Budenholzer challenged the call, which was reversed, resulting in a blocking call against Parker. Antetokounmpo made the foul shot to complete the three-point play. \n\n\r\n                    The Kings rallied to cut the lead to eight with just under two minutes left in the half before the Bucks scored six straight to put the finishing touches on a 42-point quarter.\n\n\r\n                    Milwaukee scored the first eight points of the third quarter to build a 22-point lead and held a 99-82 margin heading to the fourth. \n\n\r\n                    Sacramento pulled within 12 early in the fourth but the Bucks remained in command throughout the quarter. \n\n\r\n                    Rookie guard Tyrese Haliburton, a native of Oshkosh, Wisconsin, paced the Kings with 23 points. DaQuan Jeffries added 18.\n\n\r\n                    “I dreamt of playing for the Bucks or against the Bucks, just playing in Milwaukee, playing in the NBA, my whole life,” Haliburton said. “It was special to have a lot of my friends and family in the stands.”\n\n\r\n                    GENERAL PUBLIC RETURNS \n\n\r\n                    The Bucks welcomed back a limited number of regular fans for the first time since March 4 of last season. About 1,800 people attended the game, which amounts to 10% of the arena’s capacity. The Bucks played in front of 750 spectators — invited guests and family members of players — on Friday after inviting 250 spectators on Tuesday and 500 on Thursday. Bucks officials plan to seek permission from the Milwaukee Health Department to increase fan capacity to 25%, or about 4,300 fans, after the completion of the current eight-game homestand. \n\n\r\n                    PARKER SIGHTING\n\n\r\n                    After being inactive or not getting a single minute of playing time during Sacramento’s first 28 games, Parker saw action for a second consecutive game. After logging nine minutes Saturday night, the Bucks' first-round pick (second overall) in the 2014 draft played 16 minutes and tallied six points against his former team.\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: F Harrison Barnes (strained left foot) — Sacramento’s second-leading scorer — missed his third consecutive game. … F Richaun Holmes (sore right knee) returned after missing three games. … F Glenn Robinson III, unavailable Saturday night with a sore right knee, was away from the team Sunday for personal reasons. \n\n\r\n                    Bucks: G Jrue Holiday missed an eighth consecutive game due to the league’s health and safety protocols but was on the bench. Reserve guard Jaylen Adams was unavailable for the same reason for the second straight game. ... Milwaukee activated rookie second-round draft pick Sam Merrill, who was recalled from the NBA G League’s Memphis Hustle.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Visit Brooklyn on Tuesday in the third of a five-game road trip. The Nets defeated the Kings 136-125 in Sacramento on Feb. 15.\n\n\r\n                    Bucks: Host Minnesota on Tuesday in the fifth of eight consecutive games at home. Also the third of seven straight games against Western Conference opponents to close out the first half of the season.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997174.893066
}