{
  "game_id": "0022300871",
  "espn_id": "401585499",
  "date": "Mar 03, 2024",
  "matchup": "PHI @ DAL",
  "headline": "Harris and Maxey help Sixers win again without Embiid, beating Doncic's Mavs 120-116",
  "body": "DALLAS -- — Tobias Harris scored 28 points, Tyrese Maxey added 24 and the Philadelphia 76ers beat the Dallas Mavericks 120-116 on Sunday.\n\n\r\n              Kelly Oubre Jr. had 19 of his 21 points after the four-minute mark of the third quarter as the Sixers won consecutive games for the second time in the 14 straight games Joel Embiid has missed, improving to 6-8 overall. There is no timetable for the reigning MVP's return after surgery on his left knee.\n\n\r\n              “Everybody’s kind of figuring out our chemistry overall as a group,” said Harris, who broke out of a slump with 31 points in the previous game, a 121-114 victory over Charlotte. “We knew it was going to take some time … figuring out ways to be successful out there. We’ve just got to stay at it.”\n\n\r\n              Luka Doncic had 38 points, 11 rebounds and 10 assists for his third consecutive triple-double, but the NBA's scoring leader also had seven of 17 turnovers for the sloppy Mavericks.\n\n\r\n              Dallas was outscored 25-13 in points off turnovers and lost for the fourth time in five games since a seven-game winning streak, its longest of the season.\n\n\r\n              Kyrie Irving scored 28 points, and Derrick Jones Jr. had 21. But P.J. Washington Jr. and Tim Hardaway Jr. combined to go 4 of 18 from the field, including 1 of 13 from 3-point range, for Dallas.\n\n\r\n              Trying to maintain playoff positioning without Embiid, Philadelphia had a scare with Maxey in the third quarter when the first-time All-Star fell hard and stayed down for a couple of minutes.\n\n\r\n              Maxey walked off the court on his own and stayed out the rest of the quarter. He returned to start the fourth, finishing 8 of 15 from the field and making all seven of his free throws, including five in the fourth quarter. Maxey said he took a knee to the head but doctors cleared him to play.\n\n\r\n              “I just slipped,” Maxey said. “Probably moving too fast, thinking I'm Flash or something.”\n\n\r\n              A frustrated Doncic got his 14th technical of the season in the fourth quarter and now is two away from an automatic one-game suspension with 21 games remaining.\n\n\r\n              The Mavericks scored the first 11 points of the game but still found themselves behind by 10 before the end of the first quarter, thanks to 17 first-quarter points from Maxey.\n\n\r\n              A hot shooting start faded to 42% after three quarters before Dallas rallied behind better shooting in fourth.\n\n\r\n              “Our offense is our defense,” Mavs coach Jason Kidd said. “When we score, we’re going to be one of the best teams in this league. When we don’t score, we’re one of the worst teams. When we struggle to score, we tend to not do anything on the defensive end.”\n\n\r\n              The Mavericks had cut Philadelphia's biggest lead of 18 with seven minutes remaining to four when Oubre passed out of the lane to Harris for a corner 3 with 1:11 to go.\n\n\r\n              The Sixers held off the Dallas rally by making five of six free throws in the final 25 seconds, including one of two from Oubre to give Philadelphia a four-point lead with five seconds left.\n\n\r\n              Buddy Hield, who scored 11 points, hit a jumper to start a 10-0 run for a 74-59 Philadelphia lead midway through the third quarter.\n\n\r\n              UP NEXT\n\n\r\n              76ers: At Brooklyn on Tuesday.\n\n\r\n              Mavericks: Indiana at home Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996415.862842
}