{
  "game_id": "0022200771",
  "espn_id": "401468926",
  "date": "Feb 01, 2023",
  "matchup": "MEM vs. POR",
  "headline": "Lillard, Simons lead Trail Blazers past Grizzlies, 122-112",
  "body": "MEMPHIS, Tenn. -- — Damian Lillard had 42 points and 10 assists, Anfernee Simons added 26 points and the Portland Trail Blazers rallied to beat the Memphis Grizzlies 122-112 on Wednesday night.\n\n\r\n              Jerami Grant had 18 points in the first half, before leaving because of concussion symptoms. Portland outscored Memphis 38-22 in the fourth quarter to win for the fourth time in five games.\n\n\r\n              “I think we've had a couple of quality wins,” Lillard said. “This was the best team we've come up with a win against, especially as of late.”\n\n\r\n              Portland was able to rally late despite losing two starters — Jusuf Nurkic and Grant — to injuries in the first half. There were key stops down the stretch, and the Trail Blazers defense kept the Memphis shooting at 39%, including converting only 1 of 7 shots in from 3-point range in the fourth quarter.\n\n\r\n              “I knew I needed to be a little more aggressive just to give ourselves a chance,” Simons said. “Everybody else played well and everybody was ready to play.”\n\n\r\n              Ja Morant had 32 points, 12 assists and nine rebounds for Memphis. Jaren Jackson Jr. added 18 points and six blocks, and Desmond Bane had 17 points. \n\n\r\n              Lillard, who had five games of at least 40 points in January, continued the trend, converting 11 of 22 shots and 5 of 13 3-pointers. He also missed only one of his 16 free throws.\n\n\r\n              “They just found a way to get open shots,” Memphis coach Taylor Jenkins said. “... I thought our guys competed. You've just got to tip your hat. Lillard's on a roll right now, and we were on the wrong end of that.”\n\n\r\n              The teams were tied at 109 with two minutes to play, but Lillard's 3-pointer and Simons' layup was good on Morant's goaltending. When Drew Eubanks converted a three-point play on a dunk, Portland led 117-109 with just under a minute left.\n\n\r\n              Lillard scored 17 points in the third quarter, but Morant countered with 16 points in the period and Memphis took a 90-84 lead into fourth before the Portland rally completed the comeback.\n\n\r\n              “I didn't play good enough defense on Lillard,” said Memphis forward Dillon Brooks, who had the defensive assignment most of the night on Portland's top scorer. “He started hitting shots. Even though they were tough shots, I've got to do something to contest. Do something to discourage him from shooting when he started getting hot.”\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: Nurkic left early in the first quarter with left calf soreness and did not return. Nurkic was listed on the pregame injury report with the same injury. ... Lillard has at least 25 points in 12 of his last 13 games. \n\n\r\n              Grizzlies: C Brandon Clarke was 3 of 6 from the field and has made 24 of his last 35 shots. \n\n\r\n              ALL-STAR LOBBYING\n\n\r\n              Portland coach Chauncey Billups said he has filled out his All-Star ballot and acknowledged that he received some calls from other coaches lobbying for their teams. And maybe a bit more. “Definitely, there's some bribery going on,” Billups said with a smile.\n\n\r\n              GREEN'S RETURN\n\n\r\n              Memphis guard/forward Danny Green, who missed the first 50 games of the season, saw his first action, playing 10 minutes and scoring three points, hitting one of his four 3-pointers. Green, acquired by Memphis in a draft night trade, spent the first part of the season rehabbing a knee injury he suffered in last year's playoff when he was with the Philadelphia 76ers.\n\n\r\n              “It felt good,” Green said. “Game obviously moved fast, so I had to slow it down a little, but it was good to get out there.”\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Washington on Friday night.\n\n\r\n              Grizzlies: At Cleveland on Thursday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994190.2777731
}