{
  "game_id": "0022400323",
  "espn_id": "401704889",
  "date": "Dec 04, 2024",
  "matchup": "MIL vs. ATL",
  "headline": "Hawks win 5th straight game and halt the Bucks' winning streak at 7 with 119-104 victory",
  "body": "MILWAUKEE -- — Jalen Johnson had 23 points and 13 rebounds and the Atlanta Hawks halted Milwaukee's winning streak at seven games, beating the Bucks 119-104 on Wednesday night.\n\n\r\n              De’Andre Hunter scored 20 points, Trae Young 17, Bogdan Bogdanovic 15, Onyeka Okongwu 13 and Zaccharie Risacher 12 as the Hawks extended their winning streak to five games. Clint Capela added 17 rebounds. \n\n\r\n              Giannis Antetokounmpo had 30 points and 10 rebounds to lead Milwaukee. Damian Lillard added 25 points and Gary Trent Jr. had 11 points off the bench. Taurean Prince, the league's leading 3-point shooter had seven points in the first quarter for Milwaukee, but didn't score again until late in the fourth, finishing with 10 points.\n\n\r\n              The Hawks improved to 12-11 while Milwaukee slipped to 11-10. The teams are neck-and-neck for fifth place in the Eastern Conference. \n\n\r\n              Takeaways\r\n              Hawks: After building a 20-point lead, the Hawks kept the Bucks at bay for much of the second half, overcoming brief Milwaukee spurts. The Hawks had a 30-12 advantage in fast-break points, outrebounded Milwaukee 55-40, had a 64-34 edge in points in the paint and made 20 of 22 free throws.\n\n\r\n              Bucks: Milwaukee looked sluggish after a sharp shooting performance on Tuesday night in a dominant win over the Pistons in Detroit. Milwaukee shot 42% overall and 33% from 3-point range. The Bucks had won nine of 10.\n\n\r\n              Key moment\r\n              The Bucks jumped out quickly, building a 10-point lead, but the Hawks closed the first quarter on a 23-10 run to grab 38-35 lead. Atlanta’s push continued into the second quarter when it took a 13-point advantage at one point. The Hawks led the rest of the way.\n\n\r\n              Key stat\r\n              Atlanta’s bench outscored the Bucks 50-31 and had three players in double figures, with Hunter leading the way.\n\n\r\n              Up next\r\n              The Hawks host the Los Angeles Lakers on Friday, while the Bucks are at Boston on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997853.316653
}