{
  "game_id": "0021800345",
  "espn_id": "401071026",
  "date": "Dec 03, 2018",
  "matchup": "CLE @ BKN",
  "headline": "Burks' late dunk seals Cavs' 99-97 win over slumping Nets",
  "body": "NEW YORK --  Alec Burks had a more productive visit to Barclays Center than his last one.\n\nPlaying just his third game for Cleveland after a trade from Utah, Burks threw down a two-handed dunk with 3.2 seconds remaining, and the Cavaliers avoided a fourth-quarter collapse and edged the Brooklyn Nets 99-97 on Monday night.\n\nBurks was traded last Wednesday for veteran Kyle Korver and two future second-round picks. He was notified about the deal at Barclays Center and had to pack his bags hours before tip-off.\n\n\"It's crazy. Maybe I'll look back at it after this whole thing is over with,\" Burks said.\n\nThe eight-year veteran has quickly earned the trust of Cavaliers coach Larry Drew. He had 13 points and seven rebounds in 28 minutes off the bench.\n\n\"It feels great. (Drew) trusts my talent, my abilities and my teammates trust me,\" Burks said.\n\nJordan Clarkson had 20 points and 11 rebounds, and Tristan Thompson had 19 points and 14 rebounds for the Cavaliers, who snapped a four-game skid.\n\nCleveland led by 91-80 with 6:03 left in the fourth period after Rodney Hood hit an 18-foot jumper.\n\nThe Nets then went on a 17-6 run, tying it 97-all on rookie Rodion Kurucs' put-back layup with 18.9 seconds left.\n\nBurks then got an assist from his old Utah teammate, Rodney Hood, who set a screen and drew the attention of Allen Crabbe on the defensive switch.\n\nBurks drove past Spencer Dinwiddie, who had five fouls, for the dunk that sealed it for Cleveland. The Cavaliers had been winless since beating Philadelphia and Houston back-to-back on Nov. 23-24.\n\n\"He just made a fantastic, athletic play,\" Drew said. \"It was a clear-out for him and he just made a terrific move, got to the basket. I drew up the play but he made it happen.\"\n\nDinwiddie's potential game-winning 3-pointer fell short of the rim.\n\nD'Angelo Russell scored 28 points for Brooklyn, which has lost seven straight and nine of 11 overall, including their last six at home. Dinwiddie had 18 points off the bench.\n\n\"I mean, if you go back and look at it from game to game, at the end of the day it's a loss,\" Russell said. \"So, definitely looking for ways to improve, bringing those tactics to the next game but, at the end of the day it's still a loss on our side.\"\n\nTIP-INS\n\nCavaliers: Burks is averaging 13.3 points in his three games with Cleveland.\n\nNets: G Joe Harris missed his third straight game with a strained left hip. ... Russell scored 20 points or more for the 11th time this season. That's the most by a Nets guard in the team's first 25 games since Deron Williams' 12 such games in 2011-12.\n\nHOME WOES\n\nThe Nets' last victory at Barclays Center, where they are 3-9, was a 122-97 blowout of Philadelphia on Nov. 4.\n\nUP NEXT\n\nCavaliers: Host the Golden State Warriors on Wednesday night, their first meeting since Game 4 of the NBA Finals, when the Warriors clinched their second straight title against a far different Cleveland team led by LeBron James.\n\nNets: Continue their three-game homestand by hosting Oklahoma City on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994792.8181179
}