{
  "game_id": "0022400248",
  "espn_id": "401704814",
  "date": "Nov 18, 2024",
  "matchup": "HOU @ MIL",
  "headline": "Bucks win 101-100 on Lillard's late basket to snap Rockets' 5-game win streak",
  "body": "MILWAUKEE -- — Damian Lillard hit a driving layup with 3.9 seconds left to give the Milwaukee Bucks a 101-100 victory over Houston that snapped the Rockets’ five-game winning streak Monday night.\n\n\r\n              Lillard scored 18 points after missing the previous three games while in the concussion protocol.\n\n\r\n              The Rockets rallied from a 14-point, third-quarter deficit to take the lead early in the fourth quarter and stayed ahead until Lillard’s decisive basket. Giannis Antetokounmpo blocked a shot by Houston's Alperen Sengun with 20 seconds left.\n\n\r\n              Houston called timeout after Lillard's layup. After the Bucks fouled with 2 seconds left, Houston’s Fred VanVleet tried inbounding the ball to Sengun, who couldn’t catch it cleanly under the basket. VanVleet unsuccessfully tried passing to Jabari Smith Jr. as the horn sounded.\n\n\r\n              Brook Lopez had 27 points, 10 rebounds and four blocks for Milwaukee. Antetokounmpo had 20 points and 14 rebounds.\n\n\r\n              VanVleet scored 26 points, Jalen Green 21 and Sengun 18 for Houston.\n\n\r\n              Takeaways\r\n              Rockets: One night after a 143-107 victory at Chicago in which they were one point shy of the NBA’s highest scoring total this season, the Rockets were held to their fewest points of the season.\n\n\r\n              Bucks: Since a 2-8 start, Milwaukee has won three of four. Lopez briefly went in the locker room after taking a hard fall early in the second quarter, but he returned later that period and delivered one of his best games of the season.\n\n\r\n              Key moment\r\n              The Bucks trailed 100-96 when A.J. Green buried a 3-pointer to cut the margin to one with 1:17 left.\n\n\r\n              Key stat\r\n              Houston shot just 9 of 32 on 3-pointers and had its lowest field-goal percentage (.400) of the season.\n\n\r\n              Up next\r\n              Both teams play Wednesday, with the Rockets hosting Indiana and the Bucks hosting Chicago.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997409.65602
}