{
  "game_id": "0021300985",
  "espn_id": "400489858",
  "date": "Mar 15, 2014",
  "matchup": "MEM @ PHI",
  "headline": "76ers fall to Grizzlies, tie team mark with 20th straight loss",
  "body": "PHILADELPHIA -- Moments after the final horn sounded, the Twitter feed @DidTheSixersWin posted an update.\nFor the 20th straight game, 140 characters weren't needed, just two letters:\n\nNo.\n- Did the Sixers win? (@DidTheSixersWin) March 16, 2014\n\nIn a city painfully familiar with sports futility, the Philadelphia 76ers have added another sorry chapter, this one for the record book.\nMike Conley scored 19 points and Zach Randolph had 14 to lead the Memphis Grizzlies to a 103-77 win Saturday night, sending the 76ers to a franchise-tying 20th straight loss.\nThe Sixers, who scored a season low in points, can set the team mark with a loss Monday night at Indiana.\nThe Sixers also lost 20 straight games from Jan. 9, 1973-Feb. 11, 1973, in a 9-73 season. The NBA record for consecutive losses in a season is 26 set by the 2010-11 Cleveland Cavaliers.\n\"We have to come out swinging,\" coach Brett Brown said. \"We've got to compete.\"\nThey've absorbed their share of blows, and more may be coming: Over the next six games, the Sixers (15-51) play only one team with a losing record, the Knicks on Friday, and they are on a six-game winning streak.\nMichael Carter-Williams led the Sixers with 23 points and Thaddeus Young had 20.\n\"This is not slit-your-wrist time. This is not even close to that,\" Brown said. \"This is about building a program and understanding the short-term pain for a lot of long-term gain. That's my vision. That's how I approach it.\"\nAs the NBA season tipped off, the over-under in Las Vegas for total wins for the 76ers this year was 16.5, the lowest of any team in the league.\nThey stunned the league with a 3-0 start, including an opening-night win over the Miami Heat, and won four straight road games from Dec. 29-Jan. 4. Outside of those spurts, the Sixers have played down to their preseason projection as one of the NBA's worst.\n\"Any win we have right now would be considered an upset,\" Brown said. \"That's the way it's played out at this stage.\"\nThe Sixers last won on Jan. 29 on former guard Evan Turner's buzzer-beater at Boston. They've lost a team-record 16 straight home games, last winning at the Wells Fargo Center on Jan. 15.\n\"I try to ignore the comments about us losing however many straight,\" Carter-Williams said.\nThe 53-year-old Brown was part of three NBA title teams with San Antonio as an assistant and won another with the Spurs when he served in the basketball operations department in 1998-99. Brown is used to a winning program at San Antonio, so he's not familiar with starting from the bottom. But the Sixers realize it's not an overnight process and gave him a four-year contract to turn things around.\n\"I've been asked by so many people, 'Why would you take the job and screw up your coaching percentage?' \" he said. \"As if I care about that. I knew what I was getting in to.\"\nThe free-falling Sixers are gaining fast on Milwaukee (13-53) for the worst record in the NBA.\nUnlike Friday night's loss against Indiana when they never led, the Sixers held an early edge against Memphis and played a competitive first half.\nThe Grizzlies were coming off a 99-86 loss at Toronto on Friday and needed some time to warm up in Philly. Once they got going, they became just the latest team to stomp the Sixers.\n\"It's scary because they're looking to get a win and they're going to do whatever it takes to get one,\" Conley said.\nConley did his part to avert an upset, scoring nine points during Memphis' 15-6 run to open the second half that stretched the lead to 18. He kept the lead rolling with a 3-pointer and a fast-break layup off a turnover for a 67-46 lead. The Grizzlies, winners of 12 of 16, had 13 players score and their 29-point lead in the fourth was their largest of the season.\nEven a bit of an off night was enough for Memphis to cruise: The Grizzlies made only 4 of 15 3-pointers, were outrebounded, and had 22 turnovers.\nMarc Gasol scored 11 points, Ed Davis had 11 rebounds, and the Grizzlies had 27 assists on 38 baskets.\n\"It's a good rhythm, but it's not where we want to be yet,\" Gasol said. \"It's always on the good side. It's always better than losing, that's just for sure.\"\nJust ask the Sixers.\nGame notes\nThe 76ers sent F Arnett Moultrie, the 27th overall pick in the 2012 draft, to the D-League. He played only 12 games this season. \"He's a young player, he's a first-round draft pick, he needs to play,\" Brown said.",
  "source": "espn_api",
  "crawled_at": 1764993057.7699552
}