{
  "game_id": "0021300716",
  "espn_id": "400489589",
  "date": "Feb 03, 2014",
  "matchup": "OKC vs. MEM",
  "headline": "Kevin Durant starts new 30-point streak as Thunder down Grizzlies",
  "body": "OKLAHOMA CITY -- The Oklahoma City Thunder became familiar with Memphis' grind-it-out defensive style while losing to the Grizzlies during last season's NBA playoffs.\nOn Monday night, the Thunder beat Memphis at its own game.\nKevin Durant had 31 points, eight rebounds and eight assists, Serge Ibaka had 21 points and 12 rebounds and the Oklahoma City Thunder continued their home dominance, beating the Memphis Grizzlies 86-77.\nDurant returned to the 30-point threshold after being held to 26 points in his past two games, in a loss to the Wizards and a win over the Nets. He had previously scored 30 or more in 12 straight.\n\nOklahoma City (39-11) had a 10-game winning streak snapped Saturday at Washington, but the Thunder moved to 21-3 at home while winning their seventh straight game at Chesapeake Energy Arena.\nIn doing so, the Thunder posted its second-best defensive outing of the season. Oklahoma City's inside quartet of Ibaka, Kendrick Perkins, Steven Adams and Nick Collison combined to limit Memphis' potent frontcourt duo of Zach Randolph and Marc Gasol\nMeanwhile, Thabo Sefolosha limited Memphis' Courtney Lee -- who scored 24 points in the last meeting between the teams -- to 11 points. Memphis finished 2 of 16 from 3-point range.\n\"I thought we did a good job of playing tough defensive basketball throughout the game,\" Oklahoma City coach Scott Brooks said. \"One of the strengths of our team, obviously, is our versatility. I think tonight it showed that sometimes you have to play different styles of basketball to get a win.\"\nRandolph had 13 points and 13 rebounds and Gasol added 13 points for Memphis (26-21), which lost for the second time in 13 games. The Grizzlies had won six straight games, the NBA's longest winning streak entering Monday.\n\"We didn't play the basketball that we normally play,\" Randolph said. \"We made bad decisions at important times of the game. There were a lot of turnovers, including myself, but you've got to be smart. And we've got to hit shots.\"\nComing off a remarkable January during which he averaged 35.9 points per game on 54.9-percent shooting, Durant finished 11 of 21 from the field.\nIbaka went 10 of 17 from the field and posted his 19th double-double of the season while helping lead the Thunder's interior defense. Oklahoma City finished with nine blocked shots, four of those by Adams, a career high for the rookie from New Zealand.\n\"Steven only had three points and five rebounds and Perk only had one point and eight rebounds, but both impacted the game,\" Brooks said.\nMemphis, which trailed by 17 points late in the first half, pulled within three points three times in the final 6:45, the last time at 78-75 after Lee's driving 5-foot jumper with 4:54 left.\nDurant answered with a 14-foot jumper, then after an exchange of empty possessions, Sefolosha swished a 3-pointer and Durant followed with a steal and layup to give Oklahoma City an 85-75 cushion with 2:54 left.\n\"That gave us a boost when he hit that shot,\" Durant said.\nThe Thunder managed only one point after that, but the Grizzlies couldn't take advantage, scoring only on a follow shot by Randolph with 1:12 left.\nThe Thunder used an 18-2 run near the end of the first half to take a 51-36 halftime lead. By halftime, Ibaka already had a double-double with 12 points and 10 rebounds.\n\"We started the game great defensively and we built off of that,\" Durant said. \"Offensively we played a little slow but we picked it up in that second quarter and built some momentum going into the second half.\"\nWith a lineup of reserves, Oklahoma City didn't score for almost three minutes to start the fourth quarter, causing Brooks to reinsert Durant with 9:41 left. Durant promptly drew a foul on James Johnson and hit 1-of-2 free throws, then swished a 14-foot jumper from the left wing to put the Thunder up 72-63.\n\"We played from too far behind,\" Memphis coach Dave Joerger said. \"We gave them 51 points, lots of layups, in the first half. . It was very difficult for us. When you come back, you have a very small margin for error.\"\nReggie Jackson started the game with two airballs but eventually finished with 12 points for Oklahoma City. Mike Miller added 11 points for Memphis.\nGame notes\nWith starting point guard Mike Conley out with an ankle injury, Memphis signed G Darius Morris to a 10-day contract on Monday. Morris averaged 4.2 points and 1.6 assists in 22 games this season with the Philadelphia 76ers and Los Angeles Clippers. ... Memphis had a six-game road winning streak snapped. .. The Thunder recorded its 113th straight regular-season sellout, although there were some empty seats visible in the lower sections of Chesapeake Energy Arena. ... Joerger was named as the Western Conference coach of the month for January, beating out Brooks. Memphis went 12-3 in January, compared Oklahoma City's 13-5 mark. ... At least twice, Joerger complained about the volume level in the arena.",
  "source": "espn_api",
  "crawled_at": 1764992862.987482
}