{
  "game_id": "0021600985",
  "espn_id": "400900380",
  "date": "Mar 12, 2017",
  "matchup": "CHI @ BOS",
  "headline": "Thomas has 22, does wave, Celtics hand Bulls 5th loss in row",
  "body": "BOSTON -- Isaiah Thomas was having a good time on the bench while his teammates were closing out easy win over the Chicago Bulls.\nThomas scored 22 points and later joined fans doing the wave as it circled TD Garden, leading the Boston Celtics to a 100-80 romp and sending the Bulls to their season-high fifth straight loss.\n\"That was fun. They just did it a little too long,\" Thomas said, breaking into a smile. \"It's always nice when you've got a comfortable win and the fans get into it.\"\nThomas, the team's leading scorer at 29.2 points per game, played only 24 minutes and sat the entire final quarter. He had some fun in the final minutes of the blowout, taking part with teammate Jae Crowder in the crowd's cheer.\nThere were plenty of smiles to go around Boston's bench after they led the entire way. Avery Bradley didn't quite know if the Celtics were playing that good or Chicago was as poor as it looked.\n\"I asked our team that when I came out of the game,\" said Bradley, who scored 17 points. \"I was like: `Are we playing defense that good?\"\nThe Celtics rushed to a 13-0 lead, shutting out Chicago until Dwyane Wade's jumper nearly six minutes into the game.\nMarcus Smart and Al Horford both added 12 points, and no Boston starter played more than 32 minutes.\nRobin Lopez and Denzel Valentine paced the Bulls with 13 points apiece. Wade scored only eight points and Jimmy Butler had five.\n\"Nobody likes to lose, so, yeah, I definitely think it's bothering a lot of people,\" Butler said. \"We've got to figure it out. Ain't nobody going to come in here and show us a blueprint on how to win. We've got to go out there and make it happen.\"\nComing off a 2/3 road trip, the Celtics never trailed. After missing their first 12 shots and starting 1 for 19, the Bulls finished with a season-low points in the first quarter and trailed 22-9.\nBoston built its lead to 46-21 late in the first half on Bradley's driving basket. After Lopez opened the second half with a three-point play, the Celtics scored the next 10 points.\nThe Celtics were up by 19 points after three quarters and coasted to the victory, improving to 17-0 at home when they take a lead into the fourth period.\nTIP-INS\nBulls: Their club record for fewest points in a quarter was six, doing it in 1993 and 2001. They were flirting with the mark after the miserable start until scoring five points late. ... Chicago had won two of the first three meetings against Boston, the last coming on Butler's two free throws with less than a second left on Feb. 16.\nCeltics: Thomas hit his 200th 3-point shot in the opening quarter, becoming the third Celtics player all-time to reach that mark along with Antoine Walker and Paul Pierce. Walker owns the team record with 222, set in 2001-02. Pierce also did it the same season with 210, his only time reaching 200.\nHIGHLIGHT BASKET\nJaylen Brown drove into the lane with two Bulls defenders around him and -- while in the air -- brought the ball around his back before shifting it from his right hand to left and flipping in a shot.\nUP NEXT\nBulls: At Charlotte on Monday. The teams have split two games this season.\nCeltics: Host Minnesota on Wednesday. They beat the Timberwolves in Minnesota in November.",
  "source": "espn_api",
  "crawled_at": 1764995023.3124118
}