{
  "game_id": "0021500453",
  "espn_id": "400828340",
  "date": "Dec 26, 2015",
  "matchup": "POR vs. CLE",
  "headline": "Allen Crabbe's career night leads Trail Blazers' rout of Cavaliers",
  "body": "PORTLAND, Ore. -- Portland coach Terry Stotts came armed with a witty opening statement for his postgame press conference Saturday night following the Trail Blazers' 105-76 win over the Cleveland Cavaliers.\n\"Anybody see that coming?\" Stotts said.\nHard to imagine many raising their hands. Portland came into Saturday with a five-game losing streak, while LeBron James-led Cleveland had the best record in the Eastern Conference.\n\nAlmost from the opening tip, Portland was in control. Allen Crabbe scored 21 of his career-high 26 points during the first half to lead the Blazers (12-20) to their most lopsided win of the season.\nC.J. McCollum had 16 points, while Mason Plumlee had 11 points and 14 rebounds for Portland.\nThe Blazers ran out to a 34-12 first quarter lead and were never threatened, holding Cleveland to a season-low 76 points. James, playing only 27 minutes, matched his season low with 12 points.\n\"One of the things you love about the NBA, anything can happen,\" Stotts said. \"Obviously we played a very good game. Our defense allowed us to get into transition and took a little pressure off our half-court offense.\"\nCrabbe hit 4-of-6 from 3-point range. He said returning home after the recent 0-5 East Coast trip gave the Blazers a spark.\n\"I think it was good for us to get back home, see family. It was great to get back and play a good team like that. Everybody was up and excited to play them,\" Crabbe said.\nStotts saw a different team than the one he coached during the winless trip.\n\"Having two days off was good. We had a lot of energy. We were pushing the ball after stops. We seemed to have a little extra bounce,\" Stotts said.\nThe Cavaliers have lost two consecutive games, this one on the heels of an 89-83 defeat to Golden State on Friday night. The 76- and 83-point performances are season lows for Cleveland.\n\"Offensively, we are in a funk right now,\" said James, who also had four rebounds and five assists. \"Our energy was lacking at the beginning of the game. It picked up, but at some point it got so out of hand that it didn't matter.\"\nKevin Love had 13 points to lead the Cavaliers.\nBURNED OUT?\nJames said the Cavaliers spent a lot of energy in the Golden State loss, but \"you can't use that as an excuse. This Portland team beat us pretty good and you have to respect them for that.\n\"Throw it in the trash. There was nothing good we did tonight.\"\nSHORT OUTSIDE\nBoth teams played without their All-star guards.\nCleveland's Kyrie Irving sat out while he team eases him back from a broken kneecap suffered six months ago during the NBA Finals. Irving made his season debut earlier this week and played Friday but isn't ready to play in back-to-back games yet. Irving is expected to play Monday night at Phoenix.\nPortland's Damian Lillard missed his third consecutive game because of left foot plantar fasciitis. Stotts said Lillard is undergoing physical therapy but \"can't do much on his feet athletically.\" Lillard's timetable to return is unknown.\nFIRST STEPS\nPortland started fast and didn't let up throughout the first half as it led 63-34 at halftime.\nCrabbe scored 12 points and hit two 3-pointers to stake the Blazers to a 34-12 lead after the first quarter. Cleveland cut the deficit to 16 points early in the second after Matthew Dellavedova hit two 3-pointers during an 8-0 run. But Portland countered with 11 consecutive points to take a 51-24 lead.\nPortland went 8-of-15 from 3-point range, and didn't commit a turnover during the first half.\nTIP-INS\nCavaliers: Cleveland's 12 first-quarter points is a season low for any quarter. Portland's 63-point first half is a season-high for a Cavaliers opponent, and the Blazers' 34 first-quarter points ties a season high. ... James needs five points to pass Alex English for 17th on the NBA's career scoring list. ... Cleveland went 11-of-31 from 3-point range, with Love hitting a team-high four.\nBlazers: Crabbe established his career high by halftime with 21 first-half points. His previous high was 19. ... The Blazers' zero turnover first half was their first since the second half of a March 10, 2012 game against Washington. ... Plumlee is averaging 10.7 points and 10.8 rebounds over his past seven games. ... Portland's 34-point third-quarter lead is its largest in any game this season.\nNEXT UP:\nCavaliers: Play at Phoenix on Monday night.\nBlazers: Play at Sacramento on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764994522.3568199
}