{
  "game_id": "0022000345",
  "espn_id": "401267505",
  "date": "Feb 05, 2021",
  "matchup": "TOR @ BKN",
  "headline": "With Durant forced to leave, Raptors beat Nets 123-117",
  "body": "NEW YORK -- — With Kevin Durant forced out of the game in the third quarter because of the NBA’s health and safety protocols, the Toronto Raptors beat the Brooklyn Nets 123-117 on Friday night behind 33 points from Pascal Siakam.\n\n\r\n                    Durant’s first game against the Raptors since rupturing his Achilles tendon in the 2019 NBA Finals was a frustrating one for him and a confusing night for everyone. The superstar forward wasn’t available to start the game — entering as a reserve for the first time in his 867-game NBA career — then was told he had to depart in the third quarter.\n\n\r\n                    “It was confusing, frustrating, bizarre,” said Joe Harris, who finished with a team-high 19 points. “For him to not start, then play, then he couldn’t play, just doesn’t make any sense. But, I don’t make the decisions. I just work here.”\n\n\r\n                    Kyle Lowry added 30 points and seven assists for the Raptors. Siakam had 11 rebounds and six assists. Norman Powell finished with 18 points, Chris Boucher had 17 and Fred VanVleet finished with 11 points on 4-for-16 shooting after scoring a career-best 54 in his last game.\n\n\r\n                    “I think we were ready and I think that’s the main thing,” Raptors coach Nick Nurse said. “We believed we could come in and win from the start and even though it got a little kind of stop-startish and herky jerky there for lots of stretches, we kind of kept playing and hanging around and made some really big plays at the end.”\n\n\r\n                    The Nets rallied from a 17-point, second-quarter deficit and took the lead for the first time at 70-69 on Harris’ 3-pointer early in the third quarter. The advantage was extended to as many as six points, but Brooklyn couldn’t hold on without the NBA’s No. 2 scorer.\n\n\r\n                    James Harden had 17 points and 12 assists for the Nets, while Kyrie Irving added 15 points. \n\n\r\n                    Durant finished with eight points, after scoring 20 or more in each of his first 17 games, his longest streak to start a season in his career. \n\n\r\n                    “We missed some open looks and Lowry made some big shots,” Nets coach Steve Nash said. “We gave up offensive rebounds and turned the ball over. And you add it all up and they found separation in the last couple of minutes.”\n\n\r\n                    The Nets led 110-108 before Lowry’s 3-pointer gave Toronto the lead for good with 3:45 remaining. He scored 11 points in the final quarter. \n\n\r\n                    TIP-INS:\n\n\r\n                    Raptors: VanVleet’s 54 points against Orlando on Tuesday was the most by an undrafted player in NBA history, according to the Elias Sports Bureau. ... Toronto currently has seven undrafted players on its roster: VanVleet, Aron Baynes, Chris Boucher, Terence Davis, Matt Thomas, Yuka Watanabe, and Paul Watson.\n\n\r\n                    Nets: Irving was coming off a season-high 39 points in his last game. ... The Nets had scored 120 or more points in a franchise record-tying four straight games. They set the previous record from January 15-21, 1984.\n\n\r\n                    IS THAT REALLY YOU?\n\n\r\n                    This was the first meeting of the two teams since the Raptors swept the Nets 4-0 inside the bubble in Orlando during last summer’s playoffs. Only four players on the Nets roster during that series (Chris Chiozza, Joe Harris, Tyler Johnson, Timothe Luwawu-Cabarrot) remain on the team. \n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Visit Atlanta on Saturday night \n\n\r\n                    Nets: Visit Philadelphia on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764996874.67112
}