{
  "game_id": "0022400842",
  "espn_id": "401705408",
  "date": "Feb 26, 2025",
  "matchup": "CHI vs. LAC",
  "headline": "James Harden scores 30, Clippers hold off Bulls 122-117 to stop 3-game skid",
  "body": "CHICAGO -- — James Harden made seven 3-pointers and scored 30 points, and the Los Angeles Clippers beat the Chicago Bulls 122-117 on Wednesday night.\n\n\r\n              Kawhi Leonard had 17 points and eight rebounds after missing back-to-back games because of a sore left foot. Amir Coffey scored 20, and Los Angeles got back to winning after losing three in a row.\n\n\r\n              Derrick Jones Jr. added 16 points. Bogdan Bogdanovic made 4 of 5 3s and finished with 14 points, helping the sixth-place Clippers move a half-game ahead of Minnesota in the Western Conference.\n\n\r\n              Zach Collins set season highs with 21 points and a career-best 17 rebounds for Chicago, and Josh Giddey had 21 points and 12 assists. Coby White scored 19, but the Bulls lost for the seventh time in eight games.\n\n\r\n              Clippers leading scorer Norman Powell missed his fourth consecutive game because of a sore left knee. Chicago’s Nikola Vucevic sat out his second straight due to right calf tightness, and Ayo Dosunmu missed his third in a row with a sore left shoulder.\n\n\r\n              Takeaways\r\n              Clippers: The Clippers clearly need a healthy Leonard if they're going to make a playoff run. Wednesday's game was just the 17th for the two-time NBA champion, who missed the first nine weeks of the season as he recovered from a right knee injury.\n\n\r\n              Bulls: Chicago kept hanging in every time it looked as if the Clippers might put the game away.\n\n\r\n              Key moment\r\n              Harden went off in the third, scoring 20 points and hitting five 3s as the Clippers built a 98-93 lead. The 11-time All-Star sealed the win when he connected from beyond the arc with 14 seconds left in the game, making it 120-114.\n\n\r\n              Key stat\r\n              Los Angeles made 19 of 37 3-pointers. \n\n\r\n              Up next\r\n              The Clippers visit LeBron James and the Lakers on Friday and Sunday. The Bulls host Toronto on Friday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997048.194939
}