{
  "game_id": "401809942",
  "espn_id": "401809942",
  "date": "Oct 22, 2025",
  "matchup": "POR vs MIN",
  "headline": "Edwards has 41 points and Timberwolves rally to beat the Trail Blazers 118-114",
  "body": "PORTLAND, Ore. -- — Anthony Edwards had 41 points and the Minnesota Timberwolves rallied late in the fourth quarter for a 118-114 season-opening win over the Portland Trail Blazers on Wednesday night. \n\n\r\n              Edwards, who set a career high last season with an average of 27.6 points, was questionable for the game because of back spasms, but started. \n\n\r\n              The Blazers went ahead 46-40 midway through the second quarter on Kris Murray's 3-pointer. But Jaden McDaniels answered on the other end with an emphatic dunk over Portland's 7-foot-1 rookie Yang Hansen.\n\n\r\n              The Blazers, who missed out on the playoffs last season for the fourth straight year, led 61-57 at the break and maintained a narrow edge until late in the fourth quarter.\n\n\r\n              Edwards hit a step-back jumper to pull Minnesota within 107-105, then made a 3-pointer to make it 108-107 with 3:36 left. Another Edwards 3 gave Minnesota a 114-112 lead and Rudy Gobert’s dunk with 32.1 seconds to go sealed it. \n\n\r\n              Julius Randle finished with 19 points for the Timberwolves, who went to the Western Conference finals last season. \n\n\r\n              Jerami Grant led the Blazers with 29 points. \n\n\r\n              Damian Lillard, who returned to the Blazers in the offseason, got a rousing ovation from the fans at Moda Center when he was introduced before the game. Lillard has an Achilles injury and won't play this season. \n\n\r\n              Portland was also playing without guard Scoot Henderson, who was sidelined for the start of the season with a left hamstring tear. \n\n\r\n              Tom Dundon, owner of the Carolina Hurricanes, was at the game. Dundon leads a group that has agreed to purchase the Trail Blazers from Paul Allen's estate. The sale still must be approved by the NBA Board of Governors.\n\n\r\n              Up Next\r\n              The Timberwolves visit the L.A. Lakers on Friday night.\n\n\r\n              The Trail Blazers host the Golden State Warriors on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042484.7428842
}