{
  "game_id": "0022401104",
  "espn_id": "401705670",
  "date": "Apr 02, 2025",
  "matchup": "CHA @ IND",
  "headline": "Tyrese Haliburton scores 22 points to help send playoff-bound Pacers past Hornets 119-105",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton had 22 points and 10 assists, Aaron Nesmith scored 16 points and Pascal Siakam added 15 on his 31st birthday, leading the Indiana Pacers to a 119-105 victory over the Charlotte Hornets on Wednesday night.\n\n\r\n              The playoff-bound Pacers have won three of four and eight of 10. They clinched their second straight playoff spot Tuesday when Atlanta lost to Portland. Myles Turner also had 15 points and nine rebounds.\n\n\r\n              Miles Bridges scored 18 points to lead Charlotte, which has lost six of seven. Seth Curry and Mark Williams each scored 16 points and Williams had 12 rebounds.\n\n\r\n              Indiana controlled almost the entire game after making seven 3-pointers in the first quarter.\n\n\r\n              Charlotte cut the deficit to four midway through the second, watched Indiana extend the margin to 64-49 early in the third and then charged back within one at 68-67. But Indiana closed the third on a 19-6 run to pull away and the Hornets never really got close again.\n\n\r\n              Takeaways\r\n              Hornets: Charlotte gave Indiana problems in the teams' two previous matchups this season, but this is a very different team than the one the Hornets faced in November and December. And it showed.\n\n\r\n              Pacers: Indiana, meanwhile, continued its hot shooting and strong regular-season finish. The Pacers started the day in position to earn home-court advantage in the first round for the first time since 2014 and delivered again with the stakes high.\n\n\r\n              Key moment\r\n              A Hornets turnover led to a bounce pass alley-oop from Haliburton to Obi Toppin, giving Indiana an 81-71 lead and bringing the crowd to its feet. The Pacers only allowed one more basket in the quarter as they built an 87-73 cushion.\n\n\r\n              Key stat\r\n              Charlotte had 18 turnovers, compared with six for Indiana, and the Pacers took full advantage by outscoring the Hornets 29-4 in points off turnovers.\n\n\r\n              Up next\r\n              Charlotte hosts Sacramento on Friday, while Indiana hosts Utah on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997696.8102772
}