{
  "game_id": "0022000188",
  "espn_id": "401267348",
  "date": "Jan 15, 2021",
  "matchup": "SAC vs. LAC",
  "headline": "Short-handed Clippers manhandle Kings 138-100",
  "body": "SACRAMENTO, Calif. -- — Kawhi Leonard had 27 points and six assists in three quarters, Paul George scored 26 and the short-handed Los Angeles Clippers manhandled the Sacramento Kings 138-100 on Friday night.\n\n\r\n                    The Clippers have won 15 consecutive road games against the Kings. Los Angeles hasn’t lost in Sacramento since March 19, 2013.\n\n\r\n                    The 138 points were the most the Clippers had scored since putting up 150 against Washington on Dec. 1, 2019, although coach Tyronn Lue seemed more pleased with his team’s defense.\n\n\r\n                    “We challenged our guys to be better defensively,” Lue said. “I thought we played the right way throughout the course of the game. The whole 48 minutes we played the game the right way and that was good to see.”\n\n\r\n                    Playing without guards Patrick Beverley (personal reasons) and Lou Williams (sore left hip), the Clippers led by eight at halftime and then broke the game open in the third quarter when they outscored the Kings 37-16.\n\n\r\n                    Leonard had 11 points during the blitz, including a jarring, one-handed dunk over Cory Joseph as part of a 17-2 run. Leonard sat out the fourth period as Lue emptied his bench.\n\n\r\n                    Los Angeles’ backups came up big all game to ease the absences of Beverley and Williams.\n\n\r\n                    Reggie Jackson started in place of Beverley and had 11 points, three assists and four rebounds. Marcus Morris scored a season-high 18 points, Terance Mann had a season-best 13 points and nine rebounds, and Luke Kennard scored 14.\n\n\r\n                    “Pat and Lou are a big part of our team. Missing them is definitely a lot, but we got other guys to step up,” Morris said. “T-Mann stepped up and Reggie stepped up. Kudos to them for staying ready and being ready when their number’s called.”\n\n\r\n                    Marvin Bagley III had 20 points and five rebounds for Sacramento. Richaun Holmes added 17 points and five rebounds.\n\n\r\n                    “That team just came and pushed us around,” Kings coach Luke Walton said. “We have to understand as a group we have to be able to guard people and rebound when we get stops. Right now that’s something we have to figure out. It was evident tonight. They got what they wanted.”\n\n\r\n                    Serge Ibaka followed Leonard’s bucket with a backdoor feed to Kennard, and Mann’s dunk made it 99-69.\n\n\r\n                    Two nights after allowing Portland to match a franchise record for 3-pointers, Sacramento again struggled with its perimeter defense. \n\n\r\n                    The Clippers made seven 3s in the second quarter — three from George and four by Morris, one more than his previous season high. They finished 18 of 35 beyond the arc.\n\n\r\n                    MOVE IT, MOVE IT\n\n\r\n                    Lue lauded his team’s unselfishness as being key. Los Angeles had 29 assists, the sixth time this season the Clippers have had 28 or more. “When the ball’s hopping like that, everybody’s a part of it,” Lue said.\n\n\r\n                    MLK TRIBUTE\n\n\r\n                    In a nod to Martin Luther King Day on Monday, players for both teams wore black T-shirts with the phrase, “Now is the time to make justice a reality for all” on the front and “Honor King” on the back.\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Morris shot 7 of 12 from the floor. … Williams sat out after playing nine minutes against New Orleans on Wednesday and not at all in the second half. \n\n\r\n                    Kings: With Hassan Whiteside nursing a sore hip, Chimezie Metu’s playing time has picked up as the backup center. A second-round pick of the Spurs in 2018 who is on a two-way contract with Sacramento, Metu played in back-to-back games for the first time this season and matched his career high of 10 points while pulling down eight rebounds.\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Host Indiana on Sunday. The Pacers shot 35% from the floor when the teams met last season.\n\n\r\n                    Kings: Play the Pelicans on Sunday night at Golden 1 Center. Sacramento won two of three against New Orleans last season but lost its only home game in the series.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997193.060739
}