{
  "game_id": "0022000850",
  "espn_id": "401307646",
  "date": "Apr 16, 2021",
  "matchup": "MEM @ CHI",
  "headline": "Brooks scores 32, Grizzlies pull away to beat Bulls 126-115",
  "body": "CHICAGO -- — Dillon Brooks scored a season-high 32 points and the Memphis Grizzlies took control in the second half to beat the Chicago Bulls 126-115 on Friday night.\n\n\r\n                    Brooks had 15 points in the third quarter to lead Memphis’ charge. The game was tied at the end of both the first and second quarters before the Grizzlies pushed ahead to beat the Bulls for the second time this week.\n\n\r\n                    “This was a challenging one,” Grizzlies coach Taylor Jenkins said. “Beating the same team twice in the same week is never easy. They gave us a great test and I’m glad we came out on top.” \n\n\r\n                    Jonas Valanciunas scored the first points of the second half and Ja Morant buried a 3-pointer after Chicago scored, forcing Bulls coach Billy Donovan to call a timeout a little over a minute into the half. Memphis never trailed the rest of the game.\n\n\r\n                    Valanciunas added 16 points and seven rebounds while Morant scored 15. Xavier Tillman added 14 points off the bench.\n\n\r\n                    Coby White led the way for the Bulls with 27 points as the team played without All-Star Zach LaVine, who was sidelined by the NBA’s health and safety protocols.\n\n\r\n                    White had his biggest game since he scored 30 points against New Orleans on Feb. 10, but it wasn’t enough for Chicago, which lost its fifth straight and 11th of 14.\n\n\r\n                    “I’m sure every one of those guys in that room wants to win, but you’re finding out very clearly how hard it is and now you get to a place where you say you want to do it, but this is the point where I think adversity shows you the way and forces you to make a decision,” Donovan said. “Are you willing to step through the difficulties and challenges of doing it?” \n\n\r\n                    Nikola Vucevic had 24 points and 14 rebounds for the Bulls.\n\n\r\n                    Chicago trailed by nine at the end of the third quarter. Memphis started the fourth on a 9-2 run, highlighted by Desmond Bane’s 3-pointer and a hook shot by Valanciunas to make it 103-87. The Grizzlies led by 10 or more the rest of the way to win the first of a seven-game trip. \n\n\r\n                    “This was an important game to have,” Brooks said. “Start on the right tune and gain momentum on this road trip.”\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: F Brandon Clarke (hip) missed the game. ... Jenkins started his pregame media availability by sending condolences to the families of eight people who were fatally shot at an Indianapolis FedEx facility on Thursday. FedEx is headquartered in Memphis.\n\n\r\n                    Bulls: Donovan said LaVine wouldn’t be back in the next few days. “Everybody’s dealing with this and we obviously are missing a really good player. It’s fortunate that Zach, outside of his ankle, has been predominantly healthy for most of the year, so that part’s been great to have him available, but now he’s not.” ... G Tomas Satoransky missed Friday’s game with a non-COVID-19 related illness. ... Chicago canceled its shootaround on Friday but Donovan said no one else was impacted by LaVine’s absence.\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Visit Milwaukee on Saturday.\n\n\r\n                    Bulls: Host Cleveland on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996931.610005
}