{
  "game_id": "0021800888",
  "espn_id": "401071561",
  "date": "Feb 23, 2019",
  "matchup": "DET @ MIA",
  "headline": "Pistons reach 7th in East, top reeling Heat 119-96",
  "body": "MIAMI --  If there's been an area of concern for Detroit coach Dwane Casey in this playoff push, it's been the play of the Pistons' second unit.\n\nThe concern was unfounded Saturday.\n\nIsh Smith scored 22 points off the bench, fellow backup Langston Galloway added 15 points in the first five minutes of the fourth quarter to almost single-handedly turn a close game into a rout and the Pistons moved into seventh place in the Eastern Conference by downing the Miami Heat 119-96.\n\nDetroit's bench outscored Miami's 66-35.\n\n\"Guys responded,\" Casey said. \"Now it's the consistency part. We are on a journey. We can't relax.\"\n\nBlake Griffin had 20 points while Galloway and Luke Kennard each scored 17 for the Pistons (28-30), who are 1 1/2 games behind Brooklyn for the No. 6 spot. Reggie Jackson added 13 points and Andre Drummond had 12 points and 14 rebounds for Detroit, which started the fourth quarter on a 25-8 run.\n\nGalloway was the catalyst of all that, hitting four 3-pointers in the opening minutes. He had scored a total of 28 points in February before his dazzling fourth-quarter spurt put the game away for the Pistons.\n\n\"That's what they're supposed to do,\" Casey said of Detroit's bench. \"They did the job and that's all you ask.\"\n\nJosh Richardson scored 22 for Miami, which is 0-5 at home and 5-12 overall since Jan. 12. Dion Waiters scored 17, Dwyane Wade added 15 and Hassan Whiteside had 13 points and 15 rebounds for the Heat (26-32), who fell to 10th in the East.\n\n\"It's tough to explain,\" Heat coach Erik Spoelstra said. \"It is one game and we're just going to keep plugging away, as painful as it is.\"\n\nMiami got point guard Goran Dragic on the floor for the first time since Dec. 10, after a two-month rehab to recover from right knee surgery.\n\nThe rest of the Heat injury news was bad.\n\nMiami was without Justise Winslow -- who has been the starting point guard in Dragic's absence -- because of a sore left knee, and James Johnson also missed the game while dealing with a sprained left shoulder. If that wasn't enough, the Heat then lost starting forward Rodney McGruder in the first half with a bruised right knee and said his status would be evaluated further on Sunday.\n\nDragic came off the bench and finished with four points in 16 minutes. Duncan Robinson, who didn't play in the first half, started in McGruder's spot to open the third quarter.\n\nThe Heat were up 29-18 late in the first quarter, after making 13 of their first 23 shots. The rest of the night was all Detroit.\n\nThe Pistons outscored Miami 46-20 over the next 15 minutes, and never lost the lead again. Miami got within five in the third, but found itself down by as many as 26 in the fourth.\n\n\"They got momentum, they got confidence and they started making shots,\" Dragic said.\n\nTIP-INS\n\nPistons: Detroit, which went 6-10 in January, is 6-2 so far in February. ... The Pistons are exactly 28-30 after 58 games for the third consecutive year. They were 29-29 at this point in 2015-16. ... University of Miami coach Jim Larranaga and assistant Chris Caputo were at the game to watch Pistons rookie Bruce Brown, who played for the Hurricanes. Brown had two points.\n\nHeat: It was Miami's first home game in three weeks. Saturday started a run where the Heat play 10 times at home in a 12-game stretch. ... Miami was 7 for 28 from 3-point range, and was outrebounded 41-33.\n\nELLINGTON RETURNS\n\nFormer Heat guard Wayne Ellington, traded earlier this month to Phoenix and then waived to sign with Detroit, returned to Miami as an opponent for the first time since the moves. Ellington spent a good part of his pregame warmup greeting former teammates, coaches and Heat officials. He had six points.\n\nSECOND SWING\n\nDetroit outscored Miami 34-17 in the second quarter -- the biggest margin for the Pistons in a second quarter all season. It was the fifth time that Miami has been outscored by at least 15 points in that period this season.\n\nUP NEXT\n\nPistons: Host Indiana on Monday. Detroit lost to the Pacers 125-88 on Dec. 28.\n\nHeat: Host Phoenix on Monday. The Heat are 16-1 since 2009 against the Suns.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994672.172375
}