{
  "game_id": "0022300044",
  "espn_id": "401584132",
  "date": "Nov 24, 2023",
  "matchup": "MEM vs. PHX",
  "headline": "Devin Booker's 40 points leads Suns past Grizzlies 110-89",
  "body": "MEMPHIS, Tenn. -- — Devin Booker scored a season-high 40 points, Eric Gordon added 20 and the Phoenix Suns defeated the Memphis Grizzlies 110-89 in an NBA In-Season Tournament game on Friday.\n\n\r\n              Jordan Goodwin and Grayson Allen finished with 14 points each for the Suns, who played without leading scorer Kevin Durant, a late scratch due to right foot soreness. It was the Suns' sixth straight win, a streak that began when Booker returned from a calf injury.\n\n\r\n              “It's tough,” Booker said of not having Durant. “You can't replace what he brings to the court. His scoring ability. His versatility on defense. It's going to take a lot of extra from everybody else.”\n\n\r\n              Santi Aldama led Memphis with 21 points, while Derrick Rose added 17, while missing only one of his nine shots. David Roddy contributed 14 points as the Grizzlies lost their third game in a row and remained winless at home this season.\n\n\r\n              The win gave Phoenix a 3-1 record in the tournament, but left the team a game behind the Lakers, who won West Group A with a 4-0 record. The Suns must now wait on how other teams in the West fare to see who qualifies for the tournament wild-card spot.\n\n\r\n              Phoenix led by as many as 18 on Friday. Memphis whittled into the advantage, cutting it to single digits in the second half, but the Suns always seemed to have an answer. Goodwin scored eight straight Suns points in the fourth quarter to keep the Grizzlies at bay.\n\n\r\n              “He was great,” Suns coach Frank Vogel said of Goodwin. “He's had some ups and downs this year. We've been challenging him to be better on both sides of the ball. ...He's had some stretches where he's struggled with his shot making. So to see all of it come together for him was a great night.”\n\n\r\n              Memphis, which is 0-7 at home, still has to wait 10 more games for the return of last year's leading-scorer Ja Morant, who is serving a 25-game suspension.\n\n\r\n              The Memphis injury list, which includes six rotation players, is dire enough that the NBA granted the Grizzlies a pair of 10-day hardship contracts to sign guards Shaq Harrison and Jaylen Nowell. Those signings were announced earlier Friday. Nowell and Harrison played sparingly Friday and neither scored.\n\n\r\n              And the absences accentuate the problems, especially on the night when Memphis' two leading scorers — Desmond Bane and Jaren Jackson Jr. — combined for only 19 points, six from Bane who was 3 of 12 from the field and missed all five of his 3-point attempts, and 13 points from Jackson.\n\n\r\n              “We just need to be more on the same page,” Jackson said. “When you're down bodies, everything is a lot more critical. You can't make little errors. You can't make little mistakes that you might get away with if you had every single person with all of your weapons.”\n\n\r\n              Besides Durant, key Suns rotation players Bradley Beal and Drew Eubanks also missed the game.\n\n\r\n              But the Suns had Booker, who finished the game 15 of 21 from the field, including 3 of 4 from outside the arc. \n\n\r\n              “The guy's just a professional scorer,” Vogel said. “ He is a big reason we are having this six-game win streak.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: Travel to New York to face the Knicks on Sunday.\n\n\r\n              Grizzlies: Entertain the Minnesota Timberwolves on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996043.000521
}