{
  "game_id": "401809511",
  "espn_id": "401809511",
  "date": "Nov 07, 2025",
  "matchup": "WSH vs CLE",
  "headline": "Cavaliers rout Wizards 148-114 to improve to 1-1 in NBA Cup",
  "body": "WASHINGTON -- — Donovan Mitchell scored 24 points, Darius Garland had 20 points and nine assists and the Cleveland Cavaliers routed the Washington Wizards 148-114 on Friday night to improve to 1-1 in NBA Cup play.\n\n\r\n              Cleveland fell a point shy of matching the franchise record for a regulation game, set at Denver in a 149-135 victory last Dec. 28. The overall mark came in a 154-153 quadruple-overtime victory at home over the Los Angeles Lakers on Jan. 29, 1980. The Cavaliers also had 148 points at home in a December 1991 victory over Miami.\n\n\r\n              The Cavaliers have won three straight after dropping their Cup opener a week ago at home to Toronto, a game Mitchell missed because of hamstring tightness. \n\n\r\n              CJ McCollum scored 20 of his 25 points in the first half for Washington in its East Group A opener. The Wizards have lost seven straight to fall to 1-8.\n\n\r\n              Both teams are home Saturday night to complete back-to-backs.\n\n\r\n              Two days after Mitchell scored a season-high 46 points in a home victory over Philadelphia, Garland and Sam Merrill led Cleveland to a 76-59 advantage at the half. It was 109-86 after three quarters.\n\n\r\n              Garland played his second game after missing the first seven following surgery on his big toe to repair a turf toe injury. In his debut against the 76ers, he had eight points and four assists.\n\n\r\n              Garland and Merrill each had 14 points in the first half. Garland was 5 for 5 from the field in the half, hitting two 3-pointers, and making two free throws without a miss. Merrill was 5 of 6, going 4 of 5 from 3-point range. He failed to scored in the second half.\n\n\r\n              Evan Mobley had 18 points and 10 rebounds for Cleveland. Jarrett Allen added 16 points and 14 rebounds, and Tyrese Proctor scored 17 points. The Cavaliers had 25 offensive rebounds.\n\n\r\n              Alex Sarr had 20 points for Washington.\n\n\r\n              Up next\r\n              Cavaliers: Host Chicago on Saturday night.\n\n\r\n              Wizards: Host Dallas on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042575.1790369
}