{
  "game_id": "0021200509",
  "espn_id": "400278229",
  "date": "Jan 07, 2013",
  "matchup": "MEM @ SAC",
  "headline": "Wayne Ellington's hot hand leads Grizzlies in routing Kings",
  "body": "SACRAMENTO, Calif. --  Wayne Ellington made his first two shots and had a feeling he couldn't miss.\n\nHe was nearly correct.\n\nThe streak-shooting Ellington made 10 of 11 shots, including six 3-pointers, and scored a season-high 26 points to help the Memphis Grizzlies rout the Sacramento Kings 113-81 on Monday night.\n\n\"I hit those first two shots and it carried over from there,\" said Ellington, who made seven 3-pointers earlier this year against Miami. \"After I made the third or fourth 3, I thought they were all going in.\"\n\nZach Randolph scored 17 points and had seven rebounds in an extremely balanced offense for Memphis, which had a season-high for points. Mike Conley had 15 points and eight assists and Marc Gasol had 13 points for the Grizzlies, who outscored the Kings 36-20 in the third quarter to blow the game open and win their third straight road game.\n\nMemphis had a season-high 29 assists and have held their past six opponents under 89 points.\n\n\"This is an especially tough place to play well, and the Kings have beaten some good teams at home,\" Conley said. \"It's nice to get a relatively relaxing win like this one.\"\n\nJohn Salmons led the Kings with 17 points, Jason Thompson had 12 and DeMarcus Cousins had 10 and eight rebounds.\n\nSacramento had a season-low 28 field goals made and the point total was their lowest at home this season. The Kings shot just under 37 percent and were held to 36 second-half points.\n\n\"Our defense has been great of late,\" Conley said. \"We have a core group of guys who communicate well and pay attention to detail at the defensive end.\"\n\nTyreke Evans returned to the Kings after missing the previous 11 games with a sore left knee. He had five points in 12 minutes in a reserve role.\n\n\"I was just waiting for the game to come to me,\" Evans said. \"But unfortunately, the game got out of hand. Memphis played hard. Their big men were dunking a lot and they made shots. They are a good team overall.\"\n\nBesides playing well offensively, the Grizzlies did a nice job of containing Cousins. In the previous four games, Cousins had averaged 24.5 points and 15.2 rebounds.\n\n\"I wanted to keep a body on him (Cousins); I've got a big body, too, and I wanted to meet him early,\" Randolph said. \"We're a defensive team. When we get stops, we can score with the best of them.\"\n\nThe Grizzlies ran their offense with precision in the third quarter when they pulled away from the Kings. They used a pair of 10-0 runs in the period to build an 87-65 lead heading into the fourth.\n\nElllington came off the bench late in the third quarter and scored the last 10 points for Memphis, which made 13 of 20 shots (65 percent) in the period.\n\nEllington, who played under three minutes in the third quarter, made consecutive 3-pointers and hit a jumper at the buzzer.\n\n\"They were just hitting shots, especially in the third quarter,\" Kings guard Isaiah Thomas said. \"We couldn't get stops and they were running their offense great. They are both and offensive and a defensive team.\"\n\nRandolph scored on a one-handed putback, then made a long jumper with the shot clock running down to key a 10-0 run by Memphis in the third quarter. Conley's 3-pointer put the Grizzlies ahead 65-51 at the 7:15 mark.\n\nConley had 10 points, four assists and four rebounds in the opening half when the Grizzlies led 51-45. Gasol had nine points for Memphis, which connected on 13 of 14 free throws in the first half.\n\nSalmons made three 3-pointers and scored 13 first-half points for the Kings. Thompson scored 10 points and Cousins had six.\n\nGame notes Josh Selby was not with the team for personal reasons. ... The Grizzlies complete the three-game road trip Wednesday at Golden State. This was the first game of a five-game home stand for the Kings, who are now 10-8 in Sacramento. Jimmer Fredette missed all seven shots and was scoreless in nearly 20 minutes.",
  "source": "espn_api",
  "crawled_at": 1764993590.0816908
}