{
  "game_id": "0022400149",
  "espn_id": "401704715",
  "date": "Nov 02, 2024",
  "matchup": "POR @ PHX",
  "headline": "Booker scores 28, Durant has 21 as Suns down Trail Blazers 103-97",
  "body": "PHOENIX -- — Devin Booker had 28 points, nine rebounds and nine assists, and the Phoenix Suns used a dominant third quarter beat the Portland Trail Blazers 103-97 Saturday night.\n\n\r\n              Kevin Durant scored 21 points for Phoenix, which won its fourth in a row.\n\n\r\n              The Suns led by as many as 26 points, but the Trail Blazers cut the deficit to 99-97 in the final minute. Booker and Tyus Jones each made two free throws in the final 21 seconds to seal the win.\n\n\r\n              Grayson Allen scored 18 off the bench, making a team-high four 3-pointers. Jones and Bradley Beal each finished with 15 points, while Jusuf Nurkic had a game-high 15 rebounds.\n\n\r\n              Trailing 47-43 at halftime, Phoenix scored 44 in the third quarter to take a 22-point lead by the end of the period. The Suns had zero turnovers in the third quarter after committing nine in the first half.\n\n\r\n              Booker and Allen each had 10 points in the third quarter, while Portland only managed 18 points in the period.\n\n\r\n              Anfernee Simons and Jerami Grant led the Trail Blazers with 20 points apiece. Deni Avdija scored 13 points and former Sun Deandre Ayton had 10 points and 13 rebounds.\n\n\r\n              Takeaways\r\n              Trail Blazers: Simons missed his first six shots but hit 8 of 25 for the game, including a team-high four 3-pointers.\n\n\r\n              Suns: Beal returned after missing two of the last three games with a sprained left elbow and played 34 minutes. He had 15 points, seven rebounds and four assists.\n\n\r\n              Key moment\r\n              Jones’ 25-footer gave the Suns a 57-54 lead and ignited a 26-4 Phoenix run in the third quarter.\n\n\r\n              Key state\r\n              After shooting 27% from the field in the first half, Phoenix made 61% of its third-quarter shot attempts, including 50% (9 of 18) from 3-point range.\n\n\r\n              Up next\r\n              Portland is at New Orleans Monday, the same day the Suns host the 76ers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998197.409733
}