{
  "game_id": "0022300425",
  "espn_id": "401585053",
  "date": "Dec 28, 2023",
  "matchup": "MEM @ DEN",
  "headline": "Jokic perfect from field, line for 11th triple-double of the season, Nuggets beat Grizzlies 142-105",
  "body": "DENVER -- — Nikola Jokic was perfect from the field and free throw line, finishing with 26 points, 14 rebounds and 10 assists as the Denver Nuggets posted their highest point total of the season in a 142-105 win over the short-handed Memphis Grizzlies on Thursday night.\n\n\r\n              Jokic was 11 for 11 from the field, hit his only 3-point try and went 3 for 3 from the line. The performance followed another near-perfect outing after he converted all 18 free throws Monday in a 120-114 win over Golden State.\n\n\r\n              It was the 116th regular-season triple-double of Jokic’s career, and that ranks fourth all-time in NBA history and 22 behind Magic Johnson for third place. Russell Westbrook tops the list with 198, and Oscar Robertson has 181 all-time\n\n\r\n              Jokic went to the bench Thursday after feeding Christian Braun for a dunk with 1:31 left in the third quarter and completing his 11th triple-double of the season.\n\n\r\n              “I’ve never seen a triple-double before I played with him and now I see them all the time,” said second-year player Peyton Watson, who scored a season-high 20 points while starting in place of Aaron Gordon.\n\n\r\n              Gordon is out with lacerations on his face and hands suffered from dog bites on Christmas.\n\n\r\n              Memphis played without Ja Morant, who was sidelined due to illness. Morant missed his first game since returning from a 25-game suspension at the start of the season. The Grizzlies had won all four games in which Morant has played since making his season debut Dec. 19 at New Orleans.\n\n\r\n              “Obviously they’re much different team with Ja Morant, so we caught a break with him being out tonight,” Denver coach Michael Malone said. “That team was playing great basketball. I was proud of our guys, once we learned about Ja not playing right before tip-off, our guys handled their business.”\n\n\r\n              Desmond Bane led Memphis with 23 points, and Marcus Smart scored 17. Memphis is 6-20 when Morant is out of the lineup.\n\n\r\n              “It’s never an excuse, one man down, next man up,” Grizzlies forward Ziaire Williams said. “They played really well, executed really well, we just missed some shots.”\n\n\r\n              Jamal Murray scored 20 or more points for the fourth straight game, finishing with 23 points and nine assists for Denver, which has won a season-best six in a row. Murray had 10 points in a high-scoring third quarter when the Nuggets’ lead rached 32 points, before the Grizzlies cut it to 23.\n\n\r\n              Denver outscored Memphis 41-35 in the period and led by as many 38 in the fourth.\n\n\r\n              The Grizzlies led by eight early, but a 16-0 Denver run spanning the first and second quarters gave the reigning champs a 15-point lead. Memphis closed within 45-41 midway through the second period before the Nuggets went on an 18-2 run for a 65-48 lead at halftime.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At the Los Angeles Clippers on Friday night.\n\n\r\n              Nuggets: Host the Oklahoma City Thunder on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764996514.767244
}