{
  "game_id": "0022200948",
  "espn_id": "401469103",
  "date": "Mar 03, 2023",
  "matchup": "BKN @ BOS",
  "headline": "Mikal Bridges helps Nets rally to stun Celtics, 115-105",
  "body": "BOSTON -- — Mikal Bridges was considered a defensive star and complementary offensive player in Phoenix before abruptly having his five-year run there ended when he was shipped to Brooklyn as part of the trade that sent Kevin Durant to the Suns.\n\n\r\n              Bridges gave his new team another glimpse of the go-to potential he could grow into.\n\n\r\n              Bridges scored 38 points and the Nets overcame a 28-point deficit to stun the Boston Celtics 115-105 on Friday night. \n\n\r\n              He has reached 30 or more points in three of Brooklyn’s last six games. Bridges also had 10 rebounds, playing nearly 43 minutes.\n\n\r\n              “I think we kind or realized over a couple of games that offense wasn't really our problem,” Bridges said. “I feel like our offense is pretty good. But our defense, we got stops and stayed together possession-by-possession. ... We just kept and stayed together.”\n\n\r\n              It was Brooklyn's first victory over Boston in four meetings this season.\n\n\r\n              Bridges played through pain in the second half after knocking knees with Derrick White, hitting on the same spot he did in a similar collision with Jalen Brunson in Wednesday loss to the Knicks.\n\n\r\n              “I think when I got traded it was kind of at the right time because when everybody was out in Phoenix I had to take up another role offensively and be more aggressive,” Bridges said. “By the time I got traded I was in a great rhythm and was confident.” \n\n\r\n              Fellow former Sun Cam Johnson added 20 points. Dorian Finney-Smith finished with 17.\n\n\r\n              It is the largest comeback by a Boston opponent since the Los Angeles Clippers also rallied from 28 down to beat Boston 123-112 at TD Garden on Feb. 9, 2019.\n\n\r\n              The Celtics have lost two out of three and lost more ground on East-leading Milwaukee, which was idle Friday. Boston, which made 26 3-pointers in a 139-96 win over the Nets on Feb. 1, went just 9 of 30 from beyond the arc on Friday. \n\n\r\n              “They beat us in every analytical category possible,” Celtics coach Joe Mazzulla said. “If we don't commit to the margins, no matter how hard we play, we're not going to win.”\n\n\r\n              Jaylen Brown led Boston with 35 points. Jayson Tatum, who was celebrating his 25th birthday, added 22 points and 13 rebounds. \n\n\r\n              Boston led by 28 in the first half before being outscored 69-43 over the second and third quarters.\n\n\r\n              The Nets scored just 23 points in the first 16 minutes of the game, allowing Boston to go up 51-23 with 7:23 left in the first half. \n\n\r\n              It evaporated in a rash of pull up jumpers and one-and-done possesses for the Celtics as Brooklyn mounted a 57-23 run to nudge in front 80-74 with 3:56 in the third quarter. The lead was 106-90 early in the fourth.\n\n\r\n              During one wild sequence, the Nets secured four offensive rebounds and had five shots on a single possession before the Celtics were finally able to corral the ball, triggering a fast break and layup by Derrick White. It was one of the few highlights for Boston the rest of the way. \n\n\r\n              The Nets’ frantic rally also saw the Celtics lose big man Robert Williams for the night after he left early in the third with left hamstring tightness.\n\n\r\n              A 3-pointer by Marcus Smart got Boston as close as 110-102 with just over four minutes to play. But Finney-Smith answered with a triple of his own on the Nets’ next possession. \n\n\r\n              The lead grew as high as 51-23 early in the second, but the Nets chipped it down 64-55 at halftime.\n\n\r\n              NEW INJURY FOR SIMMONS\n\n\r\n              Nets coach Jacque Vaughn said Ben Simmons began experiencing some back soreness this week while starting to increase his activity to strengthen the sore left knee that has kept him sidelined since the All-Star break restart. There isn’t a timeline for him to return, and there hasn’t been discussion of sitting him down for the remainder of the season.\n\n\r\n              TIP-INS\n\n\r\n              Nets: Outscored the Celtics 40-27 in the second quarter, shooting 65% (15 of 23) from the field. Bridges had 15 points in the period. … Johnson, who celebrated his 27th birthday, was whistled for three fouls in less than three minutes of action. It contributed to the Nets putting Boston in the bonus at the 8:48 mark of the opening quarter.\n\n\r\n              Celtics: Finished with 19 turnovers, leading to 21 Brooklyn points. ...Went 0 for 6 from 3-point line in third quarter. … Al Horford played his 1,000th career regular-season game. He’s only the 11th active player to reach that plateau. After his milestone was announced to the TD Garden crowd, he capped the ensuing possession with a 3-pointer to put Boston in front 16-5. \n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Charlottes on Sunday night.\n\n\r\n              Celtics: Host New York on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994859.912033
}