{
  "game_id": "0022000208",
  "espn_id": "401267368",
  "date": "Jan 18, 2021",
  "matchup": "MEM vs. PHX",
  "headline": "Morant has 17 points, 10 assists; Grizzlies top Suns 108-104",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 17 points and 10 assists and took a key charge late as the Memphis Grizzlies won their fifth straight, beating the Phoenix Suns 108-104 on Monday.\n\n\r\n                    Morant assisted on Grayson Allen’s 3-pointer with 1:06 left to give Memphis a 101-98 lead, then scored on a drive with 30.8 seconds remaining. On the ensuing possession, Morant took a charge against Chris Paul to help maintain the Memphis lead.\n\n\r\n                    “Ja has a crazy good feel for the game,” said Brandon Clarke, who matched Morant’s 17 points. “I feel like those first three quarters, he’s just kind of like watching the defense, watching us, seeing what the defense gives him.\n\n\r\n                    “By the fourth quarter, he’s just kind of like already figured out everything with that, and he’s able to get in the paint, get his shot off, get his teammates shots.”\n\n\r\n                    Allen, who finished with 16 points, converted four free throws down the stretch to preserve the win.\n\n\r\n                    “We didn’t get stops. We didn’t execute,” said Paul, who finished with 16 points and seven assists. “I had six turnovers. This ain’t it. This ain’t it. ... We shouldn’t be losing this many close games like that.”\n\n\r\n                    Deandre Ayton led the Suns with 18 points and tied a season high with 16 rebounds, while Mikal Bridges had 17 points.\n\n\r\n                    Devin Booker added 12 points but struggled from the field, converting only five of his 21 shots.\n\n\r\n                    Memphis coach Taylor Jenkins said the Grizzlies tried to share the load of defending Booker.\n\n\r\n                    “I thought Grayson, in particular, did a really, really nice job,” Jenkins said. “We had a lot of guys switching on to (Booker) throughout the game. That’s just discipline team-wise.”\n\n\r\n                    The game — part of Memphis’ 19th annual Martin Luther King Jr. Day celebration — marked the first time Phoenix had played in a week after having three games canceled under the league’s health and safety guidelines.\n\n\r\n                    Monday’s game was a matchup of pieced-together lineups as both teams were dealing with injuries and the league’s health and safety protocols. Three players didn’t travel with the Suns, including Dario Saric. The Grizzlies had Jaren Jackson Jr. and Justise Winslow out with injuries and starting center Jonas Valanciunas entered the health and safety protocols after Saturday’s win over Philadelphia.\n\n\r\n                    In the end, the Suns were not able to hold the advantage in the final 2:39. After taking a 98-94 lead, Phoenix was outscored 14-6.\n\n\r\n                    Suns coach Monty Williams called Allen’s 3-pointer “a microcosm of the whole night,” adding: “Down the stretch, we had some shots, we just missed them.”\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: With the absence of Saric, Damian Jones and rookie big man Jalen Smith, that left only Ayton and Frank Kaminsky in the low post for the Suns. “I’m just grateful to have those two guys,” Williams said. ... The Suns have played in two other MLK Jr. Day games in Memphis — 2007 and 2010. ... Cameron Johnson moved into the starting lineup for Jae Crowder, who started the first 11 Phoenix games. ... Cameron Payne, who missed the previous two games with a sprained right ankle, returned to action.\n\n\r\n                    Grizzlies: With Valanciunas unavailable, rookie Xavier Tillman made his first NBA start. “Me and my wife (Sunday) were in the car geeked and screaming (thinking) ‘No way this is happening,’” Tillman said. “When coach told me, I was kind of ready for it, hoping it’s going to happen. So, I was kind of prepared for it.”... Memphis shot 13 of 18 in the second quarter, including missing on one of six 3-pointers.\n\n\r\n                    COVID CHAOS\n\n\r\n                    With the cancellations around the league because of health and safety protocols, every game seems up in the air until tipoff. “For us, we just kind of take it moment by moment, day by day, not trying to look too far ahead,” Jenkins said. “We always prepare that we’re playing a game until we’re not.”\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Face the Rockets in Houston on Wednesday.\n\n\r\n                    Grizzlies: Play the first of two games against the Trail Blazers in Portland starting Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996978.5672681
}