{
  "game_id": "0021400362",
  "espn_id": "400578654",
  "date": "Dec 15, 2014",
  "matchup": "DET @ LAC",
  "headline": "Griffin, Jordan lead Clippers over Pistons 113-91",
  "body": "LOS ANGELES --  After back-to-back road losses, Chris Paul thinks all the Clippers needed was a confidence boost. They got just what they needed with a 113-91 victory over the Detroit Pistons on Monday night.\n\n\"It's crazy. When you play so many games, you think the team doesn't play off confidence. But I think we just needed to see again what it was like to defend and see the ball go through the net at the other end -- and to win,\" Paul said. \"I think our spacing was a little better than the last two games, but our defense was better also. Hopefully we can start another streak now.\"\n\nBlake Griffin scored 18 points, DeAndre Jordan had 16 points and 15 rebounds, and Paul had 11 points and eight assists, committing one turnover in 24 minutes after getting six in each of his previous two games. Jamal Crawford shot 0 for 6 from the field.\n\nJ.J. Redick ended up with 14 points, hitting his first five shots, and his streak of 29 games with a 3-pointer ended one game shy of teammate Matt Barnes' franchise record.\n\n\"He didn't get the ball as much because they started paying more attention to him, I'm sure,\" coach Doc Rivers said. \"So give them credit. They made pretty good adjustments.\"\n\nDetroit's Jodie Meeks had 20 points in his third game of the season after missing the first 22 because of a stress reaction in his lower back.\n\n\"I felt like I got into a rhythm,\" Meeks said. \"It is only my third game back, so I have to take it day by day -- and shoot it with confidence when I am open.\"\n\nAndre Drummond added 18 points and 13 rebounds for the Pistons, who were coming off road wins against Phoenix and Sacramento after losing 13 straight.\n\nThe Clippers, coming off back-to-back road losses against Washington and Milwaukee, led the Detroit 55-44 at halftime. Griffin set up a pair of alley-oop dunks by Jordan 68 seconds apart, capping a 16-4 run that turned a one-point deficit into a 47-36 lead with 4:41 left in the second quarter.\n\nLos Angeles extended its lead to 73-53 on a four-point play by Barnes, who was fouled by Kyle Singler on a jumper with 4:57 left in the third quarter. The Pistons got no closer than 16 points after trailing by 27.\n\n\"We quit getting stops, so we could not run,\" Pistons coach Stan Van Gundy said. \"They shot the ball very well, moved the ball very well, and we could not keep up. They totally tore our defense apart.\"\n\nGriffin's final basket was a 3-pointer with 27.8 seconds left in the third. With the lead secure, Griffin sat out the fourth quarter.\n\nVan Gundy received a technical foul with 7:34 left in opening quarter after Brandon Jennings was called for a foul, and Drummond got one about 2 minutes later for complaining about a non-call under the Pistons' basket.\n\n---\n\nTIP-INS:\n\nPistons: All five of their victories have come against teams that entered Monday night's games with losing records. Last season, 19 of their wins were against clubs that finished under .500, and 10 were against teams that ended up with winning records -- including one each against division champions San Antonio, Indiana and Miami. ... The Pistons haven't shot 50 percent or better from the field in any of their first 25 games. Last season they did it 11 times (8-3). ... Drummond has 81 double-digit rebound games since the start of last season, the second-most in the league during that stretch behind Jordan's 94.\n\nClippers: The Clippers have beaten Detroit eight straight times -- their third-longest active winning streak against one club behind Utah (11) and Minnesota (10). ... Prior to their 104-98 win on Nov. 26 at Detroit, the Clippers were 3-12 against teams coached by Van Gundy. One of those wins went overtime against Orlando, and another was decided in double-OT against Miami. ... Reserve G Chris Douglas-Roberts had nine points in 24 minutes in his second game back after missing the previous 15 because of a strained right Achilles.\n\nNEXT UP:\n\nPistons: Host Dallas on Wednesday.\n\nClippers: Host Indiana on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764993805.201215
}