{
  "game_id": "0022300353",
  "espn_id": "401584981",
  "date": "Dec 18, 2023",
  "matchup": "MIA vs. MIN",
  "headline": "Edwards scores 32, Wolves rally from 17 down to beat Heat 112-108 and improve to 20-5",
  "body": "MIAMI -- — Nobody in the Minnesota locker room was happy at halftime. Karl-Anthony Towns was in foul trouble, coach Chris Finch had just gotten a technical foul and the Timberwolves were facing their second-biggest midgame deficit of the season.\n\n\r\n              Then the defense showed up to save the day.\n\n\r\n              The Timberwolves are tied for the NBA's best record through 25 games, and defense — once again — was why. Anthony Edwards scored 32 points, Towns added 18 and Minnesota allowed only 42 points after the break on the way to beating the Miami Heat 112-108 on Monday night.\n\n\r\n              “It takes for us to get punched in the face to wake up and do the things that we need to do,” Minnesota center Rudy Gobert said. “Every time we do the things that we're supposed to do, especially defensively, we put ourselves in position to win the game.”\n\n\r\n              Naz Reid scored 15, Mike Conley added 12 and Gobert grabbed 16 rebounds for the Timberwolves. They improved to 20-5, tying idle Boston for the NBA’s best record — and won after trailing by as many as 17.\n\n\r\n              Tyler Herro and Bam Adebayo returned from long injury absences and combined for 47 points for the Heat; Herro scored 25, Adebayo had 22. Jimmy Butler scored 15, Duncan Robinson 14 and Josh Richardson 13 for the Heat.\n\n\r\n              Herro returned after missing 18 games with a badly sprained right ankle. Adebayo was out for Miami’s most recent seven games with a bruised left hip.\n\n\r\n              “I felt good,” Herro said. “I tried to come and not force too much, just make the right play. That's the way the guys have been playing with me and Bam out. ... That's the way we should play anyway.”\n\n\r\n              It was Minnesota's league-leading seventh win after trailing by at least 10 points. It was also Miami's seventh loss after leading by double figures, four of those defeats coming at home.\n\n\r\n              The 20-5 start is Minnesota’s best through 25 games in franchise history; the 2001-02 Timberwolves started 17-8. Most Minnesota seasons — 21 of the previous 34 in franchise history — saw the team under the .500 mark at this point.\n\n\r\n              “It's all credit to the guys, their willingness to want to make it work,” Finch said.\n\n\r\n              Minnesota led for 20 seconds in the game's first 39 minutes — and that lead was only 4-2. Conley's 3-pointer with 8:37 remaining ended what essentially was three straight quarters of Minnesota trudging uphill, putting the Wolves up 87-84.\n\n\r\n              Miami settled for a 66-54 lead at the half, with Herro getting 17 points. It was the third-most points Minnesota — the NBA's best team so far in both points allowed per game and field-goal percentage allowed — had yielded by intermission this season and the Timberwolves' second-largest halftime deficit.\n\n\r\n              The defense that was missing in the first half showed up in the third quarter.\n\n\r\n              Miami managed only nine points in the first 8:04 of the second half, missing 10 of its 14 shots from the floor in that stretch and the game quickly got tight. The Wolves won the quarter 23-17, cutting the deficit in half going into the fourth and setting the tone to finish off the comeback.\n\n\r\n              “Look, they're the No. 1 defensive team in the league for a reason,” Heat coach Erik Spoelstra said.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Visit Philadelphia on Wednesday.\n\n\r\n              Heat: Visit Orlando on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995367.974744
}