{
  "game_id": "0022200962",
  "espn_id": "401469117",
  "date": "Mar 05, 2023",
  "matchup": "PHX @ DAL",
  "headline": "Durant tiebreaker lifts Suns over Mavs in showcase of stars",
  "body": "DALLAS -- — Kevin Durant's tiebreaker jumper was like so many before — right on target in the closing seconds.\n\n\r\n              Luka Doncic's potential tying floater moments later in front of the rim was unlike most of his — spinning around and out.\n\n\r\n              What happened next was familiar — a little bad blood from last season's playoff series spilling, with Doncic and Devin Booker nose-to-nose before getting double technicals.\n\n\r\n              Durant scored 37 points, including the go-ahead shot, to lift the Phoenix Suns to a 130-126 victory over the Dallas Mavericks on Sunday in a thrilling showcase of stars for both teams.\n\n\r\n              The first meeting between Durant and Dallas' Kyrie Irving since they were traded by Brooklyn before the deadline last month was even at 126-all when Durant pulled up over Tim Hardaway Jr. and Irving, who scrambled over for the double team when Durant went to his left.\n\n\r\n              Too late.\n\n\r\n              “Nobody’s ever going to retreat when they guard me,” Durant said. “So sometimes I’ve got to veer off instead of straight-line driving it. I felt like I had a good handle on the ball. Once I had it on my hip I felt like I was in good position to stop on a dime.”\n\n\r\n              Irving scored 30 points exactly four years to the day since the last time he faced Durant, when his Boston Celtics blew out Durant and his Golden State Warriors 128-95.\n\n\r\n              Doncic had 34 points and nine rebounds before the point-blank shot that could have tied it. He grabbed Durant for a foul after the rebound with 3.5 seconds remaining.\n\n\r\n              After the foul, Doncic and Booker, who scored 36 points, pushed and jawed at each other as officials and team personnel separated them before Durant's two clinching free throws.\n\n\r\n              It was the 14th technical of the season for Doncic, two away from a one-game suspension.\n\n\r\n              The teams finished tied 2-2 in the season series, with playoff seedings in the Western Conference wide open below top-seeded Denver.\n\n\r\n              The bunched-up standings could mean an early rematch from last season's West semifinals, when Doncic and the Mavs blew out Booker, Chris Paul and the Suns in Game 7 in Phoenix.\n\n\r\n              A photo of a goofy-grinning Doncic looking at Booker went viral after that series. The last regular-season meeting of 2022-23 brought more tension.\n\n\r\n              “I loved it,” said Hardaway, who scored 18 of his 21 points in the first half and was 6 of 8 on 3-pointers. “I know 77 isn’t going to back down from anybody. It was bound to happen at some point, them coming face to face. Just happy it happened here at home.”\n\n\r\n              Booker said he was talking to the official, but Doncic was skeptical.\n\n\r\n              “Based on the words, I don't think so,” Doncic said.\n\n\r\n              Because Booker said he was talking to an official, the Phoenix star believed Doncic said something first with his expletive-laced message.\n\n\r\n              “You guys say you don’t want everybody to be friendly-friendly, there you go,” Booker said. “We got some smoke.”\n\n\r\n              Paul scored eight of his 11 points in the fourth quarter for one of several tiebreaking or go-ahead buckets for both teams.\n\n\r\n              Phoenix two-way player Ish Wainwright, who was a role player 100 miles (160 km) down the road from Dallas at Baylor before a brief stint as a tight end for the Bears, went 4 for 5 from 3-point range in the second half for 12 points. The last of those 3s put the Suns up two with 2:07 remaining.\n\n\r\n              Durant was 12 of 17 from the field and 10 of 11 from the line in his first 30-point performance in three games since joining the Suns in a blockbuster deal with the Nets that came days after the Mavs acquired Irving.\n\n\r\n              Phoenix is 3-0 with Durant, while Dallas dropped to 3-6 since Irving joined the club. The Mavs are 2/3 on a six-game homestand, their longest of the season.\n\n\r\n              TIP-INS\n\n\r\n              Suns: Josh Okogie was 0 of 8 on mostly corner 3s when Torrey Craig hit one from the left corner and Wainwright dropped two in a row from the right corner to turn Phoenix’s 93-85 deficit into a 94-93 lead late in the third quarter. ... Deandre Ayton had nine points and 16 rebounds. Just three of the points came after the opening minutes, but two were on a putback during the frantic final minute.\n\n\r\n              Mavericks: F/C Maxi Kleber was inactive after playing two games coming off a hamstring tear that had sidelined him since December. ... F Davis Bertans (left calf strain) was available for the first time since Feb. 2.\n\n\r\n              THIGH ISSUE\n\n\r\n              Doncic left the court in the second quarter for treatment on a left thigh issue that he said has been affecting him for about a week. He said this was the worst the injury had felt but that it didn’t affect the missed shot late.\n\n\r\n              35 TIMES TWO\n\n\r\n              Durant and Booker are the first Phoenix teammates to score at least 35 points in the same game since Booker did it with TJ Warren in 2017.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Play Oklahoma City at home Wednesday.\n\n\r\n              Mavericks: Play Utah on Tuesday to finish the six-game homestand.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995066.407263
}