{
  "game_id": "0021800772",
  "espn_id": "401071445",
  "date": "Feb 01, 2019",
  "matchup": "OKC @ MIA",
  "headline": "Thunder win 7th straight, roll past Heat 118-102",
  "body": "MIAMI --  Paul George has endured some rough nights in Miami.\n\nFriday was not one of them.\n\nGeorge scored 43 points and had a career-high 10 3-pointers, Dennis Schroder scored 24 of his 28 points in the second quarter and the Oklahoma City Thunder extended the NBA's longest current winning streak to seven games by beating the Miami Heat 118-102.\n\n\"Paul George, tonight, was tremendous,\" Heat coach Erik Spoelstra said. \"We basically tried every coverage we had in our playbook: regular man, trapping him, zone. ... One of the more impressive shooting displays I've seen this season.\"\n\nGeorge once lost 11 consecutive appearances in Miami, going through some brutal defeats when he was with Indiana and the Pacers couldn't break through the Heat in what seemed like their annual battle for the Eastern Conference title. But he was never better on the Heat home floor than he was Friday, connecting on 14 of 23 shots and 10 of 16 from 3-point land.\n\nAt the end, he got to exchange jerseys with Heat guard Dwyane Wade.\n\n\"D-Wade is a guy I look up to and we've shared a bond through competition and now through a mentorship as a guy I look at and honestly want to model my brand and off-the-court stuff like,\" George said. \"It's great for him. He's had an amazing run. I couldn't say enough really about D-Wade and what he's been to this league and honestly for my development. He played a huge role in my development and who I am now as a player.\"\n\nRussell Westbrook got his fifth straight triple-double and 18th of the season, finishing with 14 points, 12 rebounds and 14 assists. Steven Adams added 13 for the Thunder.\n\nOklahoma City beat Miami for the sixth straight time, and became the second team to have two separate winning streaks of at least seven games this season. Golden State is the other, with streaks of 11 and eight games.\n\n\"There were some real good positive things to take from the game all the way around,\" Thunder coach Billy Donovan said.\n\nKelly Olynyk scored 21 for Miami, which fell to the No. 8 spot in the Eastern Conference. Josh Richardson scored 18 and Hassan Whiteside finished with 12 points and 16 rebounds for the Heat.\n\nWade was announced as an All-Star earlier in the day for the 13th time, after NBA Commissioner Adam Silver decided Wade and Dallas' Dirk Nowitzki merited becoming special additions to the player pool for the Feb. 17 game in Charlotte. Fans roared when Wade entered the game for the first time and was introduced as an All-Star.\n\nThey didn't have much else to yell about, at least in a positive light.\n\nGeorge, who set a franchise record for 3s in a game, had 16 points in the first quarter to get the Thunder going and 12 more in the fourth to finish things off.\n\n\"He's in a groove, man,\" Wade said. \"He's been playing phenomenal basketball. I've said it plenty of times: That's my favorite player. I love watching PG play.\"\n\nTIP-INS\n\nThunder: Schroder went 9 for 9 in the second quarter, helping stake Oklahoma City to a 72-53 halftime lead. ... Westbrook had eight assists in the first quarter. There have been 11 instances this season of a player having that many assists in a quarter, and Westbrook has three of them.\n\nHeat: Whiteside's double-double was his 100th at home.... One of the biggest roars of the night came after the third-quarter buzzer, when Bam Adebayo banked in a 90-footer. It didn't count. ... With his second basket of the night and the 8,242nd of his career, Wade passed Reggie Miller for 32nd on the NBA's all-time list.\n\nWESTBROOK REACTION\n\nWestbrook called getting picked for the All-Star team again a blessing. \"Definitely an experience you don't take for granted,\" he said.\n\nHOME WOES\n\nThe Heat fell to 11-15 at home, matching their home loss total from last season. Miami has dropped three straight at home, all by double digits.\n\nUP NEXT\n\nThunder: Visit Boston on Sunday, the Celtics' 11th consecutive year playing at home on Super Bowl Sunday.\n\nHeat: Host Indiana on Saturday, wrapping up the 21st home-home back-to-back in team history.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994578.2878258
}