{
  "game_id": "0022000322",
  "espn_id": "401267482",
  "date": "Feb 02, 2021",
  "matchup": "MEM @ IND",
  "headline": "Pacers top Memphis 134-116, snap Grizzlies' 7-game streak",
  "body": "INDIANAPOLIS -- — Just two days removed from a humbling home loss in which Indiana squandered a double-digit lead in the fourth quarter, the Pacers looked to right that wrong against the NBA's hottest team.\n\n\r\n                    This time, building a substantial lead proved to be enough.\n\n\r\n                    Domantas Sabonis had a season-high 32 points and 13 rebounds as the Pacers beat Memphis 134-116, snapping the Grizzlies' seven-game winning streak.\n\n\r\n                    “We were just playing loose out there,” Sabonis said.\n\n\r\n                    The Pacers built a double-digit lead early and kept adding to it, finishing with a season-high point total. The sooner they could get back on court after Sunday's inability to finish against Philadelphia, the better.\n\n\r\n                    “It was important, especially after last game,” Sabonis said of seizing control. “We felt like we gave it away.”\n\n\r\n                    Sabonis made 11 of his first 12 shots and had a double-double (24 points, 11 rebounds) by halftime. He recorded his 14th double-double in 16 starts.\n\n\r\n                    “This team has a ton of fight in ‘em,” Pacers coach Nate Bjorkgren said. “They play for each other. I’ve never questioned that.”\n\n\r\n                    Malcolm Brogdon added 23 points and Myles Turner 22 for the Pacers (12-9).\n\n\r\n                    The Grizzlies entered with the NBA's longest active win streak and ended up one victory shy of matching the franchise record of eight straight wins set four times, most recently in 2015. \n\n\r\n                    The lethargic visitors were playing for the third time in four days on the road. But the team's leading scorer for the season, Ja Morant, blamed himself after finishing with just 10 points, half of his average.\n\n\r\n                    “I have to be extremely better,” Morant said. “I feel like I was a no-show. We can't have that.”\n\n\r\n                    The Pacers started strong and led by as many as 15 points, on the way to a 37-27 edge after one period. The 37 points were a season high for the first quarter.\n\n\r\n                    The Pacers kept the pressure on, building a 71-50 lead at halftime. The 71 first-half points were another season high.\n\n\r\n                    “We just didn't have it tonight,” Grizzlies coach Taylor Jenkins said.\n\n\r\n                    Dillon Brooks led Memphis with 25 points.\n\n\r\n                    The Pacers' Jeremy Lamb finished with 19 points. He has scored in double figures in seven of eight games after starting the season late due to injury.\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Had another streak end at four games with at least seven players scoring in double figures. They had six in double digits. ... Are 6-2 on the road, 3-5 at home. ... Ja Morant is one of just two players averaging 20 points, seven assists, and shooting at least 50% (Nikola Jokic).\n\n\r\n                    Pacers: Improved to 5-5 since trading All-Star Victor Oladipo. ... Turner leads the NBA with 70 blocked shots, 17 more than the next player. ... Are No. 1 in points in the paint with an average of 54.4.\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Host Houston on Thursday.\n\n\r\n                    Pacers: At Milwaukee on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996974.741287
}