{
  "game_id": "0022300229",
  "espn_id": "401584857",
  "date": "Nov 22, 2023",
  "matchup": "MIA @ CLE",
  "headline": "Kyle Lowry makes 7 3-pointers, scores season-high 28 to lead Heat to 129-96 win over sluggish Cavs",
  "body": "CLEVELAND -- — Kyle Lowry made seven 3-pointers and scored a season-high 28 points, and the Miami Heat took advantage of Cleveland playing the second night of a back-to-back, rolling over the sluggish Cavaliers 129-96 on Wednesday.\n\n\r\n              Lowry made his first five 3s and finished 7 of 10 from long range. The Heat were without injured All-Star center Bam Adebayo, but built a 19-point lead in first half and never trailed in winning for the ninth time in 10 games.\n\n\r\n              “With Bam sitting out, I knew it was an opportunity for me to get more shots,” Lowry said. \"A good win on the road against a really, really good team.”\n\n\r\n              Miami’s been earning its frequent flyer mileage, as the Heat are playing a league-high 12 of 17 games to start the season outside South Florida.\n\n\r\n              Rookie Jaime Jaquez Jr. had his best game as a pro with 22 points, and the Heat tied a franchise record with eight players in double figures — as their reserves played the entire fourth quarter.\n\n\r\n              The Cavs had their winning streak stopped at four. They were understandably dragging after winning in overtime at Philadelphia on Tuesday night to keep their hopes alive for a wild card in the NBA's In-Season Tournament.\n\n\r\n              Darius Garland scored 14 points and Evan Mobley 13 to lead Cleveland, which has dealing with a spate of injuries. With the Cavs down 22 going into the fourth, coach J.B. Bickerstaff gave his starters some needed rest.\n\n\r\n              “You could see mentally, emotionally, physically, we just couldn’t find it tonight,” Bickerstaff said. \"We played a great game last night and obviously expended a lot of energy. We tried, but we just couldn’t find it.\n\n\r\n              “We don’t make excuses, but it’s the basketball reality that we live in.\"\n\n\r\n              Cavs rookie Craig Porter Jr. scored a team-high 16 in his first career start.\n\n\r\n              Both teams were missing their best players.\n\n\r\n              Adebayo sat out with a left hip bruise that he aggravated with a fall during a recent game. Adebayo leads the Heat in scoring (22.8 points), rebounds (10.2) and gives Miami a strong defensive presence inside.\n\n\r\n              “He’s able to do everything except jump, which is a really bad thing when you’re in the NBA,” Heat coach Erik Spoelstra said.\n\n\r\n              Donovan Mitchell was out again for the Cavs, who have been shorthanded due to injuries most of the season. Mitchell, who averages a team-high 29.2 points, has missed four straight games with a hamstring injury the team is treating very cautiously.\n\n\r\n              Lowry set the tone right after the opening tip, making four 3-pointerrs in the first 4:49 as the Heat sprinted to a 19-7 lead.\n\n\r\n              The Cavs regrouped and quickly closed the gap, but Lowry hit his fifth straight 3 to make it 27-20. The Miami point guard's first miss from deep came when he launched from 32 feet — a literal Heat check.\n\n\r\n              “Kyle was terrific, not just his shooting, but his pace,” Spoelstra said. “We needed him to be aggressive and assertive.”\n\n\r\n              Lowry said Miami's coaching staff has been urging him and his teammates to go hard.\n\n\r\n              “The last 10 games I've been trying to push the pace and play a little faster,” he said. \"Pushing the pace and keeping teams off balance is something we strive to do and we’re really good at it.”\n\n\r\n              Cleveland was still within striking distance in the third, but the Heat dropped five more 3-pointers — Lowry had two — to increase the lead to 101-79 after three.\n\n\r\n              “It seemed like they were all on fire,” Bickerstaff said. “They’re a veteran team and you could see the message early on was to run, run, run. We just couldn’t keep up.”\n\n\r\n              Miami reserve guard Dru Smith injured his right knee in the second quarter, when he stepped on a raised portion of the floor in front of Cleveland's bench.\n\n\r\n              “It is a dangerous floor,” Spoelstra said. \"We've had a couple of scares, when guys go in that corner. It's just so dangerous.”\n\n\r\n              Heat forward Kevin Love didn't make the trip for personal reasons. It would have been his first game back in Cleveland after being released last season. Love spent nine years with the Cavs and was a core member of their 2016 NBA title team.\n\n\r\n              UP NEXT\n\n\r\n              Heat: At New York on Friday.\n\n\r\n              Cavaliers: Host LeBron James and the Los Angeles Lakers on Saturday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995383.359686
}