{
  "game_id": "0021700481",
  "espn_id": "400975232",
  "date": "Dec 23, 2017",
  "matchup": "CHA vs. MIL",
  "headline": "Hornets storm back from 18 down, beat Bucks 111-106",
  "body": "CHARLOTTE, N.C. --  The Charlotte Hornets have been waiting for big-time production from their bench all season.\n\nThey finally got it Saturday night.\n\nDwight Howard had 21 points and 16 rebounds, and Charlotte's bench outscored Milwaukee's 50-28 as the Hornets battled back from an 18-point deficit to beat the Bucks 111-106. Treveon Graham had a career-high 14 points and Frank Kaminsky also had 14 as Charlotte's bench shot 16 of 27 from the field.\n\nGraham said the second team came with a defensive mentality, allowing the Hornets to chip away at the lead.\n\n\"We gotta want to,\" Graham said. \"When we get in the game, we can't let the intensity drop off. Even though we may not score as well as the starters, we can't let the defensive intensity drop.\"\n\nHornets associate head coach Stephen Silas, who's filling in while coach Steve Clifford deals with a health issue, felt he had to play his bench more given the team's recent schedule.\n\n\"This has been a brutal stretch -- 12 games in 20 days or something crazy like that,\" Silas said. \"As much as I'd like to kind of stick to my word as far as shortening the rotation, you do what's needed to win the game. I was proud of the guys. In a situation like that, guys earn minutes and some of them did that tonight.\"\n\nKemba Walker had a rough night shooting (4 of 11), but still scored 19 points -- including four late free throws to help seal the game.\n\nKhris Middleton had 31 points, while John Henson and Eric Bledsoe each had 16 for the Bucks, who had beaten the Hornets the night before in Milwaukee. All-Star forward Giannis Antetokounmpo did not play because of right knee soreness.\n\nThe Bucks led by one at halftime and appeared ready to break the game open after starting the second half on a 19-2 run.\n\nBut Charlotte, which missed its first six shots from the field in the third quarter, stormed back to take the lead with 3:46 left in the game after Howard backed down Henson in the lane and scored on a 3-point play and Marvin Williams converted two free throws.\n\nMiddleton knocked down a 3-pointer from the corner with 6.4 seconds remaining, cutting the Charlotte's lead to 1. Walker, who had missed three of his previous five free throws, calmly stepped to the line and made two more free throws.\n\nMilwaukee didn't take a timeout after Walker's made free throw and pushed the ball up the side of the court, where Bledsoe missed 3-pointer from the left wing that would have tied the game.\n\nWalker was fouled and added two more free throws to put the game away.\n\nANTETOKOUNMPO UPDATE\n\nAntetokounmpo had 26 points and seven rebounds while playing 36  1/2 minutes in Milwaukee's 109-104 victory over Charlotte on Friday night, but he developed soreness in the right knee and coaches decided to hold him out.\n\n\"We just have to be cautious in this situation,\" Antetokounmpo said afterward. \"We don't want to go deep into the season and this issue comes up again.\"\n\nAntetokounmpo, who is second in the league in scoring at 29.6 points per game, said he hopes to be ready to play Tuesday night against Chicago.\n\nKIDD-GILCHRIST'S DEFENSIVE STOP\n\nMichael Kidd-Gilchrist has been Charlotte's best defender in recent years, and he showed why in the closing seconds Saturday night.\n\nThe Bucks had a chance to tie it with 10 seconds left, but Middleton couldn't get to the rim while heavily guarded by Kidd-Gilchrist and settled for a fade-away 18-footer, which rimmed out. Michael Carter-Williams grabbed the rebound and was immediately fouled. He converted both free throws to make it a two-possession game with 8.4 seconds left.\n\n\"That was a big, big stop,\" Silas said.\n\nTOO MUCH FOULING\n\nBucks coach Jason Kidd wasn't happy the Bucks sent the Hornets to the line 40 times. Charlotte made 30.\n\n\"It's hard to beat a team when you foul that much,\" Kidd said.\n\nTIP-INS\n\nBucks: Were outrebounded 43-35. ... Shot 8 of 26 from 3-point range.\n\nHornets: Howard now has 18 double-doubles this season and is the NBA's active career leader with 684.\n\nUP NEXT\n\nBucks: Host the Bulls on Tuesday night.\n\nHornets: Host the Celtics on Wednesday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993359.7243662
}