{
  "game_id": "0022200196",
  "espn_id": "401468351",
  "date": "Nov 13, 2022",
  "matchup": "CHI vs. DEN",
  "headline": "Porter's 31 points lead Nuggets past Bulls 126-103",
  "body": "CHICAGO -- — Michael Porter Jr. scored a season-high 31 points and Nikola Jokic had 14 assists as the Denver Nuggets cruised past the Chicago Bulls 126-103 Sunday night.\n\n\r\n              Porter made 11 of 16 shots, including six from 3-point range, as the Nuggets won for the fifth time in their last six games.\n\n\r\n              “I let him roll pretty much that third quarter because he had it going,\" Denver coach Michael Malone said. “I didn't want to be the guy that put his fire out.”\n\n\r\n              Zach LaVine scored 21 points to lead the Bulls, who have lost four of five.\n\n\r\n              The Nuggets, who entered the game leading the NBA in field goal shooting (49.7%) and 3-point percentage (41.9%), made 48 of 80 shots (60%) from the field and 13 of 27 (48.1%) behind the arc.\n\n\r\n              Jamal Murray scored 23 points for Denver. Jokic tied his season high in assists despite playing only 27 minutes and sitting the entire fourth quarter.\n\n\r\n              “Fourteen assists in less than 28 minutes is a joke,” Malone said. “Only two turnovers. That's a 7-to-1 ratio. And that's what really makes him, not just a good player, but a great player.”\n\n\r\n              The Bulls showed the effects of a three-day layoff as they committed six turnovers and trailed by as many as 15 points in the first quarter. Leading scorer DeMar DeRozan didn't take a shot until midway through the second quarter and finished with 16 points.\n\n\r\n              “We should have been a fresh basketball team,” Bulls coach Billy Donovan said.\n\n\r\n              Porter made four of five shots and scored 12 points in the first quarter. He committed his third foul with 5 1/2 minutes left in the second period, but his teammates maintained a double-digit lead for most of the remainder of the half.\n\n\r\n              Andre Drummond became the 52nd center in NBA history and eighth Bulls center to reach the 10,000-point mark.\n\n\r\n              The Bulls' fortunes were summed up during a sequence in the third quarter in which guard Goran Dragic missed a shot on which he thought he was fouled and was assessed a technical foul moments later. \n\n\r\n              Kentavious Caldwell-Pope sank the free throw, and Porter hit a pair of 3-pointers to increase the lead to 86-66 with 3:18 left in the third period.\n\n\r\n              “That, I thought, was a key moment,” Donovan said. “That created the separation for us.”\n\n\r\n              TERRY'S TIME\n\n\r\n              Dalen Terry, the Bulls' first pick in the 2022 draft, didn't frown on a weekend assignment to play for Windy City of the G League. “It was a great experience,” said Terry, who averaged 16 points and 32 minutes in two games. “I just wanted to play. It felt good to go against somebody besides the imagination in my head.” Donovan was extremely pleased with Terry, who played only three minutes with the Bulls prior to this weekend. “He had an attitude of ‘how I can improve and get better?’” Donovan said. \"These are moments he can do that.” Terry played the final 5:34 of this game and scored five points and had two assists.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: G Bones Hyland (health and safety protocols) and G Ish Smith (right calf) didn't play.\n\n\r\n              Bulls: G Coby White (left quad bruise) missed his seventh consecutive game, and Donovan said White still doesn't have his full range of motion in his leg that has impacted his conditioning. This marks the latest setback for White, who underwent shoulder surgery last summer before testing positive for COVID-19 shortly after he was cleared to play. “You feel bad for him because he worked hard and had a good summer, and that contusion that's obviously been really hard to get the swelling out,” Donovan said.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Vs. New York Knicks Wednesday night.\n\n\r\n              Bulls: At New Orleans Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994297.4732149
}