{
  "game_id": "0022300621",
  "espn_id": "401585249",
  "date": "Jan 24, 2024",
  "matchup": "MIA vs. MEM",
  "headline": "Short-handed Grizzlies spoil Terry Rozier’s Miami debut and hand Heat 4th straight loss, 105-96",
  "body": "MIAMI -- — The Memphis Grizzlies were wildly short-handed. And the Miami Heat still couldn't handle them.\n\n\r\n              Vince Williams Jr. scored a career-high 25 points, GG Jackson added 17 off the bench and the Grizzlies — who had only nine available players because of injuries — spoiled Terry Rozier’s debut in Miami by topping the Heat 105-96 on Wednesday night.\n\n\r\n              Scotty Pippen Jr. and Jaren Jackson Jr. each scored 15 for Memphis, which led for the entire second half. John Konchar had 11 points and 10 rebounds for the Grizzlies.\n\n\r\n              “Just be authentic to who you are, understand the reality and every single day I think our group's maintained a great spirit,\" Grizzlies coach Taylor Jenkins said. “I think our staff, coaching staff, performance, medical team, everyone’s dealing with a lot right now trying to navigate the injuries and guys being in and out.”\n\n\r\n              Tyler Herro scored 18 for Miami, which has dropped four straight for the second time this season. Bam Adebayo finished with 15 points, 15 rebounds, six assists and six blocks for the Heat.\n\n\r\n              Jimmy Butler and Caleb Martin also scored 15 apiece, and Rozier — acquired Tuesday in a trade with Charlotte — had nine on 3-for-11 shooting.\n\n\r\n              “We know things are not going to be perfect right away,” Rozier said. “You see the assessment of the team and see how things are going. But I feel like I fit the Heat culture and I’m coming right in to pick things up on the defensive side and let everything else take care of itself. We’re all basketball players, so we’ll figure it out.”\n\n\r\n              Memphis had nine players out with injuries — Ja Morant and Steven Adams are done for the season — and the lineup that the Grizzlies rolled out to start the night was its 25th in 44 games this season. Combined, the five players that opened the game for Memphis are making about $35 million this season and most of that is going to Jaren Jackson Jr., who missed 16 of his 21 shots.\n\n\r\n              And the Grizzlies found a way anyway.\n\n\r\n              GG Jackson’s 3-pointer with 4:30 left in the half put the Grizzlies on top after a back-and-forth opening quarter and a half, the Memphis lead was 49-42 at the break and it reached 14 by the end of the third quarter. Going into the fourth, the Grizzlies held a 48-18 lead in points off 3-pointers and a 32-9 edge in bench scoring.\n\n\r\n              Miami got within 98-96 on a 3-pointer by Herro with 2:01 left, before the Grizzlies finished the game on a 7-0 run.\n\n\r\n              “It's just one of these periods of time in an NBA season that's funky,” Heat coach Erik Spoelstra said. “I can't even explain it. ... There were a lot of uncharacteristic plays offensively.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Orlando on Friday.\n\n\r\n              Heat: Host Boston on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995358.817887
}