{
  "game_id": "0022300245",
  "espn_id": "401584873",
  "date": "Nov 26, 2023",
  "matchup": "MIL vs. POR",
  "headline": "Bucks overcome 26-point deficit to beat Trail Blazers in Lillard's 1st game against former team",
  "body": "MILWAUKEE -- — Damian Lillard acknowledged his first game against his former team felt a little bit different at first.\n\n\r\n              For much of the day, it also was shaping up as an embarrassing loss for the Milwaukee Bucks. It ended up with their biggest comeback in more than a decade.\n\n\r\n              Giannis Antetokounmpo made a tiebreaking tip-in with 18.5 seconds left and had 33 points, 16 rebounds and six assists and the Bucks overcame a 26-point deficit to beat the Portland Trail Blazers 108-102 on Sunday.\n\n\r\n              Lillard added 31 points and sealed the victory by making four free throws in the final 10 1/2 seconds. The seven-time all-NBA guard played the first 11 seasons of his career with the Trail Blazers before requesting a trade over the summer and eventually landing in Milwaukee.\n\n\r\n              Leading up to the game, Lillard downplayed the prospect of facing his old team for the first time and noted it would be different Jan. 31, when the Bucks visit Portland.\n\n\r\n              “Once I walked in, I saw a lot of familiar faces,\" Lillard said after the game. “I thought about going to the visitors’ locker room for a second. I was like, ‘Man, this is a little bit different.’ Then when we got to the court, I saw everybody, and it was a weird feeling. But once we started playing, I kind of got over it quick. Just like before, I didn’t think it would be a big thing or a crazy thing, and it wasn’t.”\n\n\r\n              The Bucks trailed 81-55 early in the third quarter, the largest deficit overcome by a winning team in the NBA this season. It represented the Bucks' largest come-from-behind victory since Nov. 26, 2012, when they came back from 27 points down in a 93-92 victory over Chicago.\n\n\r\n              Portland overhauled its roster to such an extent during the offseason that only a handful of Blazers had played alongside Lillard last season. Even so, the Blazers seemed inspired early on.\n\n\r\n              The Blazers entered the day ranked last in the NBA in 3-point percentage (.324) and next-to-last in field-goal percentage (.434), yet they shot 52.1% overall and 10 of 17 on 3-point attempts in the first half.\n\n\r\n              But they shot just 27.9% in the second half and missed 12 of their last 13 attempts from 3-point range.\n\n\r\n              “To be a good team, a really really good team, contending team in this league, you've got to have composure,\" Blazers coach Chauncey Billups said. “Our composure was good for the most part, but when it really really counted, we came unraveled a little bit.”\n\n\r\n               Jerami Grant led Portland with 22 points, and Malcolm Brogdon had 18 points and 12 assists. \n\n\r\n              A shot-clock violation enabled Milwaukee to get the ball in a tie game with 39.3 seconds left. Lillard missed a 3-pointer and Bobby Portis couldn’t connect on a putback attempt, but Antetokounmpo got the tip-in.\n\n\r\n              “He’s one of the greatest players to play this game, and he showed it tonight,” Bucks coach Adrian Griffin said about Antetokounmpo. “We were kind of dead in the water, searching, trying to find some momentum. It was a gritty win.”\n\n\r\n              Portland appeared to have a chance to tie it when Antetokounmpo was called for his sixth foul on Brogdon's drive with 14.6 seconds left. Griffin challenged the call, and the foul was overturned upon a replay review.\n\n\r\n              The overturn led to a jump ball between Milwaukee’s Brook Lopez and Portland’s Deandre Ayton. The ball ended up in the hands of Lillard, who made two free throws. \n\n\r\n              After Portland's Shaedon Sharpe missed a 3-point attempt, Lillard made two more free throws to complete the scoring.\n\n\r\n              Sharpe had 17 points points for the Trail Blazers, and Ayton had 14 points and 13 rebounds. Rookie Scoot Henderson had a career-high 13 points.\n\n\r\n              Milwaukee played without Khris Middleton because of tendinitis in his left Achilles.\n\n\r\n              “No timeline,” Griffin said. “Just day to day. We’ll see how he responds to treatment. I think things are promising.”\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Indiana on Monday night.\n\n\r\n              Bucks: At Miami on Tuesday night in an In-Season Tournament game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996153.2625139
}