{
  "game_id": "0022000110",
  "espn_id": "401267270",
  "date": "Jan 06, 2021",
  "matchup": "CHA @ ATL",
  "headline": "Hayward's career-high 44 lead Hornets power Hawks, 102-94",
  "body": "ATLANTA -- — Gordon Hayward scored a career-high 44 points and the Charlotte Hornets recovered after trailing for the first time in the fourth quarter and beat the Atlanta Hawks 102-94 on Wednesday night.\n\n\r\n                    The Hornets led by double figures most of the game before Atlanta claimed its first lead, at 86-85, on John Collins' three-point play with 5:22 remaining. Hayward answered with a jumper and his own three-point play and the Hornets never trailed again. \n\n\r\n                    Hayward said it was a true career high — the most points he had scored at any level.\n\n\r\n                    “I never scored 40 in high school,” Hayward said before giving credit to his teammates. “People were finding me all night.” \n\n\r\n                    Hayward made 15 of 25 shots, including 4 of 9 from behind the arc.\n\n\r\n                    “I was proud of Gordy,” said Charlotte coach James Borrego. “He understood we needed pressure taken off our offense tonight, and he took the pressure.”\n\n\r\n                    Collins led Atlanta with 23 points and 11 rebounds. Kevin Huerter had 19 points. Trae Young, averaging 28.6 points, scored only seven points while making 2 of 9 shots from the field. De’Andre Hunter added 17 points.\n\n\r\n                    The Hawks entered the game fourth in the league in scoring, but with Young struggling they couldn't find their scoring touch against the Hornets. \n\n\r\n                    The Hawks have lost three consecutive games.\n\n\r\n                    “Tonight was nasty,” said Atlanta coach Lloyd Pierce. “There’s no shaking that. I’m thankful our guys were able to get back and take the lead and show the resiliency we need in this league.\"\n\n\r\n                    Pierce said he wasn't worried about his team.\n\n\r\n                    “Our guys, they’re high-confidence,\" Pierce said. \"They’re learning each other. They’re high-character guys. They’ll be fine.”\n\n\r\n                    Charlotte pushed its lead to double figures in the opening period and stretched it to 24 points late in the first half before settling for a 59-40 halftime lead.\n\n\r\n                    The Hawks cut the Hornets' advantage to 10 points, at 74-64, in the third period, before Devonte Graham answered with a 3-pointer for Charlotte.\n\n\r\n                    LaMelo Ball had 16 points and eight rebounds for Charlotte. Terry Rozer had 14 points.\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Rookie F Nick Richards did not play due to health reasons. Coach James Borrego said he expected to have an update Thursday “on what that looks like for him” in the next game. ... Hayward outscored the Hawks in the opening period 12-11. He tied his career high for points in any half with 25 in the first half. Hayward's previous career high was 39 points twice, most recently at Cleveland on Jan. 5, 2019 with Boston.\n\n\r\n                    Hawks: G Bogdan Bogdanovic, who hurt his right ankle and was unavailable in the fourth quarter on Monday night, was Atlanta's first substitute and did not appear to be limited. ... G Rajon Rando (right knee soreness) missed his fourth straight game. The Hawks said Tuesday he would be evaluated after resting the knee for three more games, including the game against Charlotte. ... Clint Capela had seven points and 19 rebounds.\n\n\r\n                    YOUNG'S OFF NIGHT\n\n\r\n                    Young’s only points of the first half came on a drive midway through the second period. He wasn’t the only Atlanta player to struggle from the field. The Hawks’ 40 first-half points set a season low for any half.\n\n\r\n                    Young had seven turnovers and three assists.\n\n\r\n                    “I don’t know what the cause was,” Young said. “For me, personally, I had a lot of turnovers in that first half, kind of just losing the ball out of my hands trying to make passes, things like that.”\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Play Friday at New Orleans.\n\n\r\n                    Hawks: Visit Charlotte on Saturday in a rematch with the Hornets.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997048.0791051
}