{
  "game_id": "0021801049",
  "espn_id": "401071722",
  "date": "Mar 17, 2019",
  "matchup": "BKN @ LAC",
  "headline": "Williams' 3-pointer lifts Clippers to 119-116 win over Nets",
  "body": "LOS ANGELES --  Lou Williams continues to prove that he is not only the Los Angeles Clippers' most valuable player, but the NBA's leading candidate for Sixth Man of the Year.\n\nThe veteran guard continued his hot play since the All-Star break, nailing a 28-foot 3-pointer from the top of the key at the buzzer to give the Clippers a 119-116 victory over the Brooklyn Nets on Sunday night.\n\nWilliams' buzzer-beater capped a rollercoaster game where the Clippers squandered two double-digit leads in the second half and the Nets saw an 18-point cushion in the second quarter evaporate before halftime.\n\n\"I can't explain that game. It made no sense,\" Clippers coach Doc Rivers said. \"The game was disjointed and it was a full of runs. The game was won, then it's lost, or tied, and then we made a miracle shot.\"\n\nThe victory was Rivers' 300th as Clippers coach, making him the seventh coach in NBA history with 300 or more regular-season wins with two or more teams.\n\nLos Angeles led 116-106 with 1:02 remaining, only to see Brooklyn score 10 straight points and tie it with 5.3 seconds remaining on DeMarre Carroll's dunk. The Clippers called a timeout to set up the winning shot for Williams, who scored 11 of his 25 points in the fourth quarter.\n\n\"Fade left, and get a shot at the rim,\" Williams said of the play. \"They put us in a position where we had our backs against the wall. It was a good shot. If I played it straight up, they would have had an opportunity to guard it. I don't think they were worried about that type of shot.\"\n\nWilliams is averaging 20.4 points on the season, but 24.3 this month as the Clippers have won seven of their last eight.\n\n\"He's been absolutely amazing. He makes big shots,\" Rivers said of Williams. \"Lou started making them early in the fourth quarter for us. He is one of those guys who is not scared.\"\n\nDanilo Gallinari had 20 points and 11 rebounds, while Montrezl Harrell added 20 points and 10 rebounds. Rookie Shai Gilgeous-Alexander also had a double-double with 14 points and 10 assists.\n\nD'Angelo Russell led the Nets with 32 points and 10 assists, while Carroll scored 22. Jarrett Allen had 13 points and 11 rebounds.\n\n\"It was a heck of shot. We definitely didn't want to foul him, because we know how good he is at drawing fouls in those situations,\" Nets coach Kenny Atkinson said of the final play. \"I think we forced him into something tougher than normal.\"\n\nThe Nets dominated the early part of the game and led 46-27 with 8:07 left in the second quarter before the Clippers took over, going on a 33-9 run over the final eight minutes to take a 60-55 lead at halftime. Gallinari scored 13 and Harrell added 12 during the run as Los Angeles went 11 of 14 from the field and was 3 of 4 on 3-pointers.\n\nBrooklyn started the game making nearly half its shots from the field, but was 3 of 17 during the Clippers' run.\n\nA 3-pointer by Landry Shamet gave the Clippers an 11-point lead four minutes into the third quarter before the Nets fought back. It was tied at 87 going into the fourth quarter.\n\n\"Teams are going to make runs, but we've got to take the same aggressive mentality that we had at the end of the game and bring it throughout the whole game,\" Carroll said.\n\nTIP-INS\n\nNets: Spencer Dinwiddie scored 13 points, while Joe Harris and Caris LeVert added 12 apiece. ... It is only the third time in 27 games since Dec. 7 that Brooklyn has had a double-digit lead and lost.\n\nClippers: Rivers, who was ejected during the third quarter of Friday night's win against Chicago, received another technical with 4:35 remaining in the second quarter. ... This was Shamet's 10th game with four or more 3-ponters. Shamet, who had 14 points, leads NBA rookies with 144 3s.\n\nTHE 300 CLUB\n\nRivers, who had 416 wins with the Celtics, joins Phil Jackson (Bulls and Lakers), George Karl (Sonics and Nuggets), Dick Motta (Bulls and Mavericks), Don Nelson (Bucks, Mavericks, and Warriors), Pat Riley (Lakers and Heat) and Lenny Wilkens (Sonics, Cavaliers and Hawks) as coaches with 300 or more regular-season wins with two or more teams.\n\nUP NEXT\n\nNets: Travel to Sacramento on Tuesday. The Nets beat the Kings by 29 in the first meeting.\n\nClippers: Host Indiana on Tuesday. The Pacers have won the last five in the series.\n\n---\n\nFollow Joe Reedy at www.twitter.com/joereedy\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995389.3571699
}