{
  "game_id": "0022400194",
  "espn_id": "401704760",
  "date": "Nov 08, 2024",
  "matchup": "MIA @ DEN",
  "headline": "Nikola Jokic's third straight triple-double leads Nuggets past Heat 135-122",
  "body": "DENVER -- — Nikola Jokic had 30 points, 14 assists and 11 rebounds for his third straight triple-double to lead the Denver Nuggets past the Miami Heat 135-122 Friday night.\n\n\r\n              The triple-double was Jokic’s NBA-best fifth of the season.\n\n\r\n              After missing the past three games in concussion protocol, Jamal Murray had 28 points and became the first player in Nuggets franchise history with 1,000 career 3-pointers.\n\n\r\n              The Heat played most of the game without Jimmy Butler, who turned his ankle on a drive against Murray seven minutes into the game and did not return.\n\n\r\n              Denver raced out to a 17-6 lead in the opening 4:10 as part of a 40-point first quarter in which it made 14 of its 20 shots. Though it fought back to get within seven in the final five minutes of the game, Miami never led and trailed by as many as 26 in the second half.\n\n\r\n              Tyler Herro had a team-high 24 points and 11 assists for the Heat.\n\n\r\n              Takeaways\r\n              Heat: Miami’s fourth loss in its past five games came with the added pain of losing Butler, who is second on the Heat with 18.1 points per game.\n\n\r\n              Nuggets: Though concerns continue to persist about the drop off between its starting five and its bench, Denver continued its recent surge, winning for the sixth time in the past seven games after an 0-2 start.\n\n\r\n              Key moment\r\n              After carrying an 11-point lead into halftime, the Nuggets outscored the Heat 15-4 in the opening 3:03 of the third quarter to extend its advantage to 86-64.\n\n\r\n              Key stat\r\n              Russell Westbrook continued a strong recent stretch, dishing out a season-high 10 assists for Denver. It’s just the second time he's had double-digit assists in his past 44 games.\n\n\r\n              Up next\r\n              The Nuggets host the Dallas Mavericks on Sunday, the same day the Heat continue a six-game road swing at the Minnesota Timberwolves.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996933.096719
}