{
  "game_id": "0021800265",
  "espn_id": "401070946",
  "date": "Nov 23, 2018",
  "matchup": "BKN vs. MIN",
  "headline": "Rose scores 25 as Timberwolves beat Nets 112-102",
  "body": "NEW YORK --  Karl-Anthony Towns thinks the real Derrick Rose is shining once again.\n\nRose scored 25 points, Towns had 21 points and nine rebounds, and the Minnesota Timberwolves beat the Brooklyn Nets 112-102 on Friday.\n\nRose was 11 for 17 from the field, helping Minnesota get back on track after dropping two in a row. The 30-year-old guard won the 2011 NBA MVP award with the Chicago Bulls. He had been hampered by injuries in recent years before his strong start to this season.\n\n\"I love telling Derrick how good he is and how MVP Derrick (has) always been there and is still there,\" Towns said.\n\nTaj Gibson had 16 points and 11 rebounds for Minnesota, and Jeff Teague finished with 15 points in the Timberwolves' first road win of the season.\n\n\"I trust every single person in the locker room to get the job done,\" Towns said.\n\nBrooklyn had six players score in double figures, but shot 41.8 percent from the field. Joe Harris and Spencer Dinwiddie had 18 points apiece, and DeMarre Carroll finished with 13.\n\n\"We have to do a better job coming out and setting the tone,\" Harris said. \"We just kind of came out and they definitely hit us in the mouth first before we could really engage with them and set the tone early.\"\n\nThe Nets pulled within four on Dinwiddie's two free throws with 3 minutes left. But Rose made a floater and Teague found Robert Covington for a dunk to help the Timberwolves close it out.\n\nMinnesota swept the season series, also winning 120-113 on Nov. 12 at Target Center. The Timberwolves have won three in a row against the Nets dating to last season.\n\nJarrett Allen and Shabazz Napier each scored 12 points for Brooklyn, and Allen Crabbe finished with 11.\n\n\"We came into the game a little lackadaisical,\" Allen said.\n\nThe Nets trailed by five at the break, but the Timberwolves grabbed control in the third. Towns had 17 points as Minnesota outscored Brooklyn 35-23 in the quarter for an 89-72 advantage heading to the fourth.\n\n\"I think we were searching for energy but we kind of just didn't have the juice,\" Nets coach Kenny Atkinson said. \"I see Towns hurt us in the post there in the third quarter. We tried different things, tried different guys on him, we tried fronting him. We just couldn't get the stops we needed.\"\n\nThe Nets scored 11 of the first 15 points in the final quarter to pull within 10 at 93-83 with 9:21 left. Following a timeout by the Timberwolves, Rose made a jumper and a 3-pointer to run the lead back out to 15.\n\nTIP-INS\n\nTimberwolves: Towns only played 8:13 in the first half due to foul trouble. He committed two fouls in the first quarter, and another early in the second. ... Minnesota shot 47.8 percent (44 for 92) from the field. It also went 15 for 17 from the foul line.\n\nNets: Harris went 4 for 10 from 3-point range. The team made 14 of 45 attempts from beyond the arc overall.\n\nGETTING ADJUSTED\n\nMinnesota coach Tom Thibodeau described the adjustment for Covington and Dario Saric since coming over in a trade as \"a work in progress.\" Covington scored seven points against the Nets, and Saric had three.\n\nCovington and Saric were acquired in the Jimmy Butler trade with Philadelphia on Nov. 12.\n\n\"Anytime you make a trade midseason that's part of the challenge because they've missed training camp and they know the NBA, but they have to learn their teammates,\" Thibodeau said. \"They're learning a new system, so for the most part I think they've done well. They've adapted well, but it's something we have to continue to work at. They come in early, get extra work in to develop a better understanding of what we're trying to do.\"\n\nUP NEXT\n\nTimberwolves: Host the Chicago Bulls on Saturday night.\n\nNets: Host the 76ers on Sunday night in the second of four straight at home.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995423.678057
}