{
  "game_id": "0022200227",
  "espn_id": "401468382",
  "date": "Nov 18, 2022",
  "matchup": "CHI vs. ORL",
  "headline": "Suggs nails 3, Magic beat Bulls 108-107 after blowing lead",
  "body": "CHICAGO -- — Jalen Suggs dribbled up court in the closing seconds, pulled up inside the arc, spun, stepped back and unleashed a 3-pointer from the right wing with a defender on him.\n\n\r\n              The ball swished through the net. And just like that, Orlando escaped with one wild win.\n\n\r\n              Suggs nailed a stunning 3 in the closing seconds and the Magic beat the Chicago Bulls 108-107 after blowing a 19-point lead Friday night.\n\n\r\n              Orlando led by 19 in the third quarter, only to see the Bulls tie it early in the fourth. The Bulls’ Nikola Vucevic had a chance to seal a win against his former team, but he missed two free throws with Chicago up 107-105 with 12.2 seconds remaining.\n\n\r\n              The Magic got the rebound, and Suggs came through with the winner over Ayo Dosunmu. It brought back some memories of the 2021 Final Four, when Suggs banked in a long 3 to give Gonzaga an overtime win against UCLA.\n\n\r\n              “I haven't hit a game-winner like that in ages, since the win in the tournament,” Suggs said. “But that's an amazing feeling.\" \n\n\r\n              DeMar DeRozan then missed a heave at the buzzer, giving the Magic their first victory in seven road games this season.\n\n\r\n              “It’s good to come out here with my guys and just hoop,” Suggs said. \"Everything that happened and didn’t happen last year, forgetting all of it, learning from it, getting better, to come out here this year where I can play with supreme confidence, have fun on the court with my guys. We all can go in the right direction, and I think that’s where we’re heading.”\n\n\r\n              Wendell Carter Jr. led Orlando with 21 points and grabbed eight rebounds against his former team. Suggs and Franz Wagner each scored 20. Bol Bol added 15 points and 10 rebounds.\n\n\r\n              “Jalen saw an opportunity to win the game, and he went out and did it,” Carter said. “It was amazing, his confidence, stepping into his shot, believing he was gonna make it. That's really big time, especially for a young player.”\n\n\r\n              BULLS FALL\n\n\r\n              DeRozan scored 41 for Chicago, but the Bulls lost their fourth in a row.\n\n\r\n              Vucevic had 14 points and 16 rebounds. Dosunmu scored 13, but Zach LaVine finished with just four points on 1-for-14 shooting. The two-time All-Star sat out the final 3:43.\n\n\r\n              “We just can't keep putting ourselves in a hole playing down 17, 19 points,” DeRozan said. “It's too tough. The margin of error is slim to try to make a comeback. You almost have to play perfect to win a game like that.”\n\n\r\n              BIG RUN\n\n\r\n              The Magic led 73-54 early in the third and were up 83-67 with just over three minutes left in the quarter when the Bulls went on a 12-1 run. DeRozan started it with a 3 and ended it with a 21-footer with 12 seconds left.\n\n\r\n              Suggs then nailed a 3 for Orlando to make it an eight-point game heading to the fourth. DeRozan knotted it at 92 when he hit a pull-up jumper with 7:13 remaining.\n\n\r\n              TIP-INS\n\n\r\n              Magic: F Paolo Banchero (sprained left ankle), the No. 1 overall draft pick, missed his fifth game in a row. ... Gary Harris scored seven points after missing the first 15 games following arthroscopic surgery on his left knee. He was not on a specific minutes limit, though coach Jamahl Mosley said the Magic would be “cautious” with him.\n\n\r\n              Bulls: Coach Billy Donovan said point guard Lonzo Ball's recovery from left knee surgery is “going slow” and had no timetable on his return. He said Ball is doing more, though he hasn't started running yet. Ball had surgery on his left knee in late September, his second in less than a year and third since entering the NBA with the Los Angeles Lakers in 2017. ... G Coby White (bruised left quad) played 4:20 after missing the previous eight games. ... F Patrick Williams, who sprained his right ankle in Wednesday’s loss at New Orleans, had 12 points.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host the Indiana Pacers on Saturday.\n\n\r\n              Bulls: Host the Boston Celtics on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994511.330316
}