{
  "game_id": "0022301079",
  "espn_id": "401585707",
  "date": "Mar 31, 2024",
  "matchup": "CHA vs. LAC",
  "headline": "Paul George pours in 41 points as Clippers continue dominance of Hornets with 130-118 victory",
  "body": "CHARLOTTE, N.C. -- — Paul George knocked down eight 3-pointers and finished with a season-high 41 points, and the Los Angeles Clippers defeated the Charlotte Hornets 130-118 on Sunday night for their fifth straight road win.\n\n\r\n              George finished 14 of 21 from the field and 8 of 12 from beyond the arc to beat the Hornets for the 12th consecutive time. \n\n\r\n              Ivica Zubac had 24 points and 12 rebounds and Kawhi Leonard chipped in with 23 points for the Clippers (47-27).\n\n\r\n              George said he wasn't sure what type of a night he was going to have after he airballed his first shot and had another blocked.\n\n\r\n              “You don't know,” George said. “But what I do know is you have to stay aggressive and it's all about catching a rhythm. And what I do know is that once you catch a rhythm you can't be stopped at that point.”\n\n\r\n              Miles Bridges scored 33 points on seven 3s and Brandon Miller had 22 for Charlotte (18-56), which has lost eight of nine and continues to limp toward the season finish line.\n\n\r\n              After the game, Miller did a jersey swap with George, someone he has idolized while growing up and calls his favorite player.\n\n\r\n              “That’s my guy. Big bro,\" Miller said. “I look forward to working out with him this summer. It’s going to be a tough matchup every time we play each other. Just always look for a show when he’s on the court. He’s a great shot-maker, but not just that, he takes pride on the defensive side.”\n\n\r\n              Although the Clippers have won five of their last seven games and find themselves in fourth place in the Western Conference, George refused to say that the team is starting to jell.\n\n\r\n              “No, we are still a work in progress,” George said. “I thought we were the better team so we should have won. But I thought it should have been more decisive than what it was. So we have room to improve. But we will get there.”\n\n\r\n              Clippers head coach Tyronn Lue said he was disappointed in his team's defensive effort, which included allowing 23 3-pointers.\n\n\r\n              “I just didn’t think we had a defensive mindset coming into the game,” Lue said. “We scored so easy that we let our guards down defensively, and (the Hornets) did a good job of running good stuff and taking advantage of the mismatches. We just didn’t lock in.”\n\n\r\n              The Clippers built a 12-point halftime lead behind George, who had 22 points on 8-of-13 shooting including five 3s and scored with ease while defended by the rookie Miller. \n\n\r\n              Los Angeles held a double-digit lead for most of the second half and Norman Powell’s driving layup for an and-one pushed the lead to 17 with 10 minutes remaining.\n\n\r\n              The Hornets would make a run behind three straight 3s by Davis Bertans, a driving layup by Grant Williams and a 3 from Miller to cut the lead to six with 5 1/2 minutes remaining. But Powell’s 3 from the left wing would push the lead back to 10 and give the Clippers some breathing room.\n\n\r\n              The Clippers outrebounded the Hornets 41-31.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Wrap up a four-game road trip at Sacramento on Tuesday night.\n\n\r\n              Hornets: Host Boston on Monday night. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995936.42992
}