{
  "game_id": "0022400660",
  "espn_id": "401705226",
  "date": "Jan 28, 2025",
  "matchup": "LAL @ PHI",
  "headline": "Tyrese Maxey scores 43 to lift 76ers past LeBron, Lakers 118-104",
  "body": "PHILADELPHIA -- — Tyrese Maxey scored 43 points to lead a Philadelphia 76ers team without injured Joel Embiid and Paul George to a 118-104 win over the Los Angeles Lakers on Tuesday night.\n\n\r\n              Last season’s NBA Most Improved Player, Maxey continued his recent hot scoring streak as he tries to keep the Sixers within striking distance of the play-in tournament. Maxey had averaged 30.4 points over the last 10 games and he blew past the mark in the third quarter, finishing with 41 headed into the fourth. \n\n\r\n              Maxey hit four 3-pointers and made 15 of 26 shots overall from the floor. He extended his career-best streak of 25-point games to 11 straight to the delight of a handful of NFC champion Eagles who sat courtside.\n\n\r\n              LeBron James scored 31 points for the Lakers. Anthony Davis left the Lakers without a key cog when he was forced out in the first half with an abdominal muscle strain.\n\n\r\n              Takeaways\r\n              Lakers: Bronny James got some decent playing time in the first half but did not score. His dad also moved into sixth place on the NBA's career steals list.\n\n\r\n              76ers: Led by Maxey, the Sixers scored 48 points in the second quarter to pull away and open a six-game homestand on a high note.\n\n\r\n              Key moment\r\n              Davis walked to the locker room with his right hand over his stomach when he left with 2:10 to go in the first quarter. Davis had four points in 10 minutes before he was hurt. Davis averaged 26.3 points and 12.1 rebounds in 41 games this season for the Lakers. \n\n\r\n              Key stat\r\n              Maxey (15) and Guerschon Yabusele (10) combined to score all the 76ers' points in the first quarter. They combined to make 10 of 16 shots while the rest of the Sixers missed five shots. \n\n\r\n              Up next\r\n              The Lakers play Thursday at Washington. The Sixers host Sacramento on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997167.225152
}