{
  "game_id": "0022400835",
  "espn_id": "401705401",
  "date": "Feb 25, 2025",
  "matchup": "DAL @ LAL",
  "headline": "Luka Doncic posts a triple-double against the Dallas Mavericks, leads the Lakers to a 107-99 win",
  "body": "LOS ANGELES -- — Luka Doncic had 19 points, 15 rebounds and 12 assists in his first game against the Dallas Mavericks since they traded him to the Lakers, leading Los Angeles to a 107-99 victory Tuesday night.\n\n\r\n              Doncic secured his first triple-double with the Lakers on an emotional night for the Slovenian superstar, who was blindsided by the seismic trade sending him to Los Angeles for Anthony Davis three weeks ago.\n\n\r\n              Doncic warmly greeted his former teammates, but also took a few portentous looks at the Mavs' bench during the night. He struggled with his shot, going 6 of 17, but capped a superb playmaking performance with an assist to LeBron James for a clinching layup with 32 seconds left.\n\n\r\n              James helped his new teammate by scoring 16 of his 27 points in the fourth quarter while Los Angeles held on for its third straight win and its 13th in 16 games.\n\n\r\n              Kyrie Irving scored 35 points and Klay Thompson added 22 for the Mavericks.\n\n\r\n              Dallas general manager Nico Harrison, who is reviled by many Mavs fans for making the trade, was serenaded by Lakers fans chanting “Thank you, Nico!”\n\n\r\n              Takeaways\r\n              Mavericks: Max Christie scored all 10 of his points in the first half. He was traded along with Davis by the Lakers, who drafted him.\n\n\r\n              Lakers: James wasn't about to let Doncic lose on this emotional night.\n\n\r\n              Key moment\r\n              Davis couldn't play due to a groin injury, but he got the biggest of several standing ovations after the Lakers aired a lengthy tribute video to the star big man in the first quarter. Davis waved back at the crowd with both arms.\n\n\r\n              Key stat\r\n              Doncic's triple-double was the 81st of his career — seventh in NBA history — and his fourth this season. His last for Dallas was on Dec. 15.\n\n\r\n              Up next\r\n              Both teams play Thursday. The Mavericks host the Hornets, and the Lakers host the Timberwolves.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997155.047765
}