{
  "game_id": "0022300874",
  "espn_id": "401585502",
  "date": "Mar 03, 2024",
  "matchup": "ORL vs. DET",
  "headline": "Paolo Banchero scores 29 as the Magic ease past the Pistons 113-91",
  "body": "ORLANDO, Fla. -- — Paolo Banchero scored 29 points for a second straight game and the Orlando Magic completed a four-game season sweep of the Detroit Pistons with a 113-91 victory on Sunday night.\n\n\r\n              Wendell Carter Jr. had 19 points and eight rebounds for Orlando and Markelle Fultz added a season-high 16 points, making all eight of his shots while playing 17 minutes.\n\n\r\n              Evan Fournier led the Pistons with 17 points and Simone Fontecchio added 15, both coming off the bench. Jalen Duren led Detroit's starters with 11 points.\n\n\r\n              The Magic (35-26) surpassed last season's victory total with 21 games remaining.\n\n\r\n              “I think it’s big but we’ve got a bigger picture,” Fultz said. “We definitely are aware of it, but we have bigger goals and higher standards for ourselves.”\n\n\r\n              Orlando has won 11 of 14 and is nine games over .500 for the first time since April of 2012.\n\n\r\n              “It's not easy to beat a team four times, but these guys understood what our game plan was from the start,” Magic coach Jamahl Mosley said. “Our ability to sustain our effort and continue to play together is something that I'm very proud of.”\n\n\r\n              Orlando shot 59.7% to Detroit's 38.4% and had a 48-28 rebounding advantage.\n\n\r\n              “We’ve played against physical teams all year and we’ve handled it better than we did tonight,” Pistons coach Monty Williams said. “To their credit, their defense was really physical. Did we get fouled some? Yeah, but the physical teams that are consistently putting forth that identity typically get the benefit of the doubt. So I didn’t think we handled that well at all. We spent too much time talking to the referees.”\n\n\r\n              Orlando led 59-50 after a first half in which Fultz scored 10 straight Magic points over a four-minute stretch.\n\n\r\n              Banchero scored 11 points during a 20-3 run that expanded the lead to 26 points early in the second half. The All-Star forward matched his scoring total from Thursday night's win over Utah and had eight rebounds and five assists.\n\n\r\n              “I thought we did a good job of getting stops, and not letting them get many second-chance opportunities,” Banchero said. “Then the offense just fed off of that.”\n\n\r\n              Fournier hit two 3-pointers and James Wiseman had four baskets during Detroit's brief bench surge late in the game. Wiseman's dunk with 10:36 left moved the Pistons within 13, but they got no closer.\n\n\r\n              Detroit (9-51) fell even with Washington for the league’s worst record.\n\n\r\n              “I was in this position my first year with the Magic (in 2014-15),” said Fournier, a 12-year NBA veteran. “We were very inexperienced. Unfortunately you have to go through that to learn because winning in this league is extremely hard.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Visit Miami on Tuesday.\n\n\r\n              Magic: Visit Charlotte on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995690.006817
}