{
  "game_id": "0022201197",
  "espn_id": "401469352",
  "date": "Apr 06, 2023",
  "matchup": "ORL vs. CLE",
  "headline": "Green, Osman lead Cavaliers to 118-94 win over Magic",
  "body": "ORLANDO, Fla. -- — Danny Green scored 21 points, Cedi Osman added 19 and the Cleveland Cavaliers beat the Orlando Magic 118-94 on Thursday night in a game in which both teams rested their starters.\n\n\r\n              Isaiah Mobley came off the bench with 18 points for the Cavaliers, who had clinched the fourth seed in the Eastern Conference playoffs by beating the Magic on Tuesday night.\n\n\r\n              Jalen Suggs led the Magic with 22 points in their home finale. Bol Bol added 18 points and eight rebounds in his first start since Dec. 30.\n\n\r\n              The 35-year-old Green, who signed as a free agent with the Cavaliers on Feb. 14 after being waived by Houston, played 26 minutes and shot 5 for 9 from behind the arc.\n\n\r\n              “It was fun to have the roles reversed a little bit,” said Green, who had played only 45 minutes in six games with Cleveland. “The starters did a great job of taking care of business and getting us home court (in the first round), and they got a chance to rest. They earned it, and we’ve got to hold the fort down by continuing to play good basketball and build good habits.”\n\n\r\n              Cavs forward Dean Wade was the only one of the 10 players who started Tuesday night's game to start again on Thursday. \n\n\r\n              The Cavs' Donovan Mitchell, who scored 43 points Tuesday to become the only NBA player this season to score 40 or more points in four straight games, sat out the game along with Evan Mobley, Jarrett Allen, Darius Garland, Caris LeVert and Isaac Okoro.\n\n\r\n              All five regular starters and sixth man Cole Anthony did not play for the Magic, who were mathematically eliminated Tuesday night.\n\n\r\n              Suggs hit four 3-pointers and scored 14 points in the Magic’s 42-point first quarter, in which Orlando shot 16 for 23 (59.5%) and led by nine.\n\n\r\n              “We didn’t have to say much. They knew we weren’t playing with the purpose necessary on that end of the floor,” said Cavs coach J.B. Bickerstaff. “Our guys always take the challenge, and they did a better job in the second quarter.”\n\n\r\n              Isaiah Mobley and Wade hit 3-pointers in a 12-0 Cleveland run early in the second quarter and the Cavs led by 10 at halftime.\n\n\r\n              Osman opened the second half with a couple of 3s, quickly pushing Cleveland's lead to 77-57.\n\n\r\n              The Magic shot 17 for 60 (28.3%) over the final three quarters and fell behind by as many as 33 points in the final minutes.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Officially listed injuries for players who did not play: Mitchell (finger), Allen (groin), Garland (lower leg), LeVert (knee), Okoro (knee). ... It was the fifth straight game missed by Okoro. ... The Cavs finished 20-21 on the road, winning seven of their final nine\n\n\r\n              Magic: Rookie Paolo Banchero missed his first game since November, when he missed seven games with a sprained left ankle. ... Officially listed injuries for players who did not play: Banchero (back), Franz Wagner (ankle), Wendell Carter Jr. (hip), Gary Harris (hip), Markelle Fultz (knee). ... The Magic finished 20-21 at home.\n\n\r\n              EXPLANATIONS FOR WHY THE STARTERS DID NOT PLAY\n\n\r\n              “It’s an opportunity for them to keep getting better, to continue to be evaluated,” Orlando coach Jamahl Mosley said. \"Once we were eliminated from that playoff position, I think what you have to look at now is: How do we help these guys get better? How do we help them grow?\"\n\n\r\n              Bickerstaff: “Just because other guys are getting an opportunity, this isn’t a free-for-all. There’s a purpose behind the minutes they’re getting — expecting them to get reps and opportunities at their roles of being helpful to us as we close out the season and move into the playoffs.” \n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Charlotte on Sunday.\n\n\r\n              Magic: Play at Brooklyn on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994305.34606
}