{
  "game_id": "0021800561",
  "espn_id": "401071237",
  "date": "Jan 02, 2019",
  "matchup": "PHX vs. PHI",
  "headline": "Embiid scores 42 points, 76ers hold off Suns 132-127",
  "body": "PHOENIX --  The Philadelphia 76ers were ready to go home from their trip west a little too early, and it almost cost them.\n\nJoel Embiid, playing despite a sore left knee, matched his season high with 42 points, 30 in the first half, and grabbed 18 rebounds and the Philadelphia 76ers blew most of a 30-point lead before holding on to beat the Phoenix Suns 132-127 on Wednesday night.\n\nBen Simmons added 29 points and J.J. Redick 27 for the 76ers, They were without Jimmy Butler and Wilson Chandler, both due to an upper respiratory infection.\n\nDevin Booker scored 37 points for the Suns. Deandre Ayton added 18 points and 11 boards, and Josh Jackson scored 16 points.\n\n\"I think we left Dec. 24 and now we're ready to go home,\" Philadelphia coach Brett Brown said. \"It didn't really end as authoritative as we'd hoped.\"\n\nPhiladelphia led by 23 at halftime and as many as 30 in the third quarter. The Suns cut it to three points before Redick finally sealed the victory with a pair of free throws with 4.3 seconds to play.\n\n\"We love to make the game interesting,\" Embiid said. \"We've done it a lot, but give credit to Phoenix. They hit a lot of 3s in the third quarter and they got back in the game. It was a fun game but we have to make sure next time we need to finish and push the lead even further.\"\n\nThe 76ers shot out to a 13-3 lead and consecutive 3-points by Redick made it 21-8. The 76ers led 44-32 after one, matching the most point allowed by the Suns in any quarter this season.\n\nEmbiid scored 10 points as Philadelphia opened the second quarter with a 13-2 run to lead 58-36 and the margin barely changed the rest of the one-sided half and the 76ers led 72-49 at the break.\n\nEmbiid made 8 of 14 shots, 14 of 16 free throws and grabbed 14 rebounds in the first half.\n\n\"Now eight of those types of first halves (for Embiid) this year,\" Brown said, \"just incredibly dominant.\"\n\nPhoenix finished the third quarter on a 13-2 run. Troy Daniels sank a pair of 3s and Ellie Okobo added another after a Philadelphia turnover cut the lead to 104-87 after three.\n\nA 19-5 Suns run reduced the lead to 116-110 when Jackson scored on a lob pass from Booker with 3:24 to go. Furkan Korkmaz sank a 3-pointer, Phoenix turned it over and Embiid's dunk boosted it to 121-110.\n\nBooker's 3-pointer cut the lead to 129-125 with 14.3 seconds, Redick made one of two free throws and Booker scored on a put-back to make it 130-127. Redick put it out of reach with his two final shots from the line.\n\n\"I think we played with them too much,\" Simmons said. \"We were playing around with them too much. The energy wasn't there. Guys were ready to go home.\"\n\nSlow starts have been a problem for the Suns twice on their current home stand and often during the season.\n\n\"As a team, we all just have to come out strong, just come out aggressive throwing the first punch,\" Ayton said. \"There's a really small margin of error to play against great teams like this so it's pretty hard to mess up and have silly mistakes against teams, and they'll make you pay.\"\n\nTIP INS\n\n76ers: Embiid's career high is 46 set last season. He scored 42 against Charlotte on Nov. 9. ...  Philadelphia wrapped up a 3-2 trip. ... 76ers shot 77 percent in the first quarter (13-of-17), including 4-of-5 3s. ... Embiid was 17 of 19 from the line.\n\nSuns:  Also allowed 44 points in the second quarter against the Los Angeles Lakers on Oct. 24. ... Phoenix's only lead was 2-0. ... Most points Suns have allowed in a half is 76, also in that game against the Lakers. ... The first 5,000 fans received Ayton bobbleheads.  ... After winning five of seven, Phoenix has lost the first four of a seven-game homestand.\n\nUP NEXT\n\n76ers: Host Dallas on Saturday night.\n\nSuns: Host the Los Angeles Clippers on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995077.563966
}