{
  "game_id": "0021800641",
  "espn_id": "401071317",
  "date": "Jan 13, 2019",
  "matchup": "HOU @ ORL",
  "headline": "Magic rally in fourth quarter to beat Rockets 116-109",
  "body": "ORLANDO, Fla. --  The Orlando Magic threw about everything they had at Houston's James Harden and the strategy worked. Barely.\n\nOrlando rallied in the fourth quarter to squeeze out a 116-109 win over Houston on Sunday behind 22 points apiece from Nikola Vucevic and Aaron Gordon, and 17 points from Evan Fournier.\n\nThe Magic outscored Harden and Houston 14-4 in the final four minutes of the game to win their second straight game.\n\n\"That was exhausting,\" said Fournier, who spent most of the game chasing Harden around pick-and-rolls. \"The guy is terrific. I thought overall, we did a pretty good job, but the guy still had 38.\"\n\nHarden scored 38 points to push his run of 30-point games to 16, but at a high price. Harden was just 1 for 17 on 3-point attempts. He did get fouled three times shooting from beyond the arc and was 9 for 9 from the free throw line on those occasions (15 of 16 overall), but it was never enough to give the Rockets a comfortable advantage.\n\n\"I thought we did well against him, except for the fouls,\" Magic coach Steve Clifford said. \"It's not easy to guard him without fouling and yet it's necessary, but he also was 11 for 32, 1 for 17 and we didn't make a lot of mistakes, except that.\"\n\nHouston led much of the game and was up 105-98 when Harden made a pair of free throws with 4:34 left.\n\nFrom there, however, he was 1 for 5 from the field, including three misses on step-back 3-pointers. His teammates were 0 for 3 during that span, giving him no help when the game was being decided.\n\n\"The problem is you can't rely on (Harden) to be super human every night,\" Houston coach Mike D'Antoni said. \"We have to have some contribution from other guys. I thought they came in with a lack of focus on the defensive end and it carried over on the offensive end. We didn't play well.\"\n\nHarden agreed with his coach.\n\n\"We scored enough points to win,\" Harden said. \"We didn't have our focus defensively, like we have the last few weeks. We gave them 70 points or something in the second half (actually, 64). You give a team like this some confidence and open shots and they made them. It's pretty simple.\"\n\nAustin Rivers scored 25 points and Clint Capela 17 points and 10 rebounds for Houston, which lost for only the fourth time in its last 17 games.\n\nTerrence Ross had 17 points for Orlando, including six straight in the late-game run when the Magic put away Houston.\n\nWith Harden on the bench for a brief rest, the Rockets used a 10-2 run to start the fourth period and grab a 98-88 lead, but the Magic passed them when Ross followed a three-point play with a 3-pointer to make it 106-105 with 3:11 left.\n\nFournier and D.J. Augustin followed with back-to-back 3-pointers and Vucevic hit a short jump hook that finished the run that sealed the game.\n\nTIP-INS\n\nRockets: Brandon Knight (knee) and Nene (rested because of back-to-back) joined Chris Paul (hamstring) and Eric Gordon (knee) on Houston's injured list. ... Houston is averaging nearly 10 points more in its last 16 games than it did in its first 16 games. (116.2 vs. 106.6) . ... Harden had his string of five or more 3-pointers in a game end at 12.\n\nMagic: Rookie C Mo Bamba missed his third straight game with a foot injury. ... Orlando is 10-8 in back-to-back situations, but only 3-7 in the second game.\n\nUP NEXT:\n\nRockets: Houston heads home to play Memphis in the second game of a back-to-back.\n\nMagic: Travel to Detroit Wednesday to play the Pistons.",
  "source": "espn_api",
  "crawled_at": 1764995299.925937
}