{
  "game_id": "0022400733",
  "espn_id": "401705299",
  "date": "Feb 06, 2025",
  "matchup": "LAC vs. IND",
  "headline": "Siakam scores 33 points to help Pacers overcome 22-point deficit in 119-112 win over Clippers",
  "body": "INGLEWOOD, Calif. -- — All-Star Pascal Siakam scored 33 points and the Indiana Pacers overcame a 22-point deficit after losing Myles Turner to beat the Los Angeles Clippers 119-112 on Thursday night.\n\n\r\n              Bennedict Mathurin added 25 points. He inadvertently struck Turner in the face going for a rebound in the first quarter. Turner got up and then staggered while making his way to the bench. He was being evaluated for a concussion and did not return. He was scoreless in six minutes.\n\n\r\n              Norman Powell and James Harden had 22 points each for Los Angeles. Ivica Zubac had 18 points and 15 rebounds. Kawhi Leonard had 19 points in a season-high 34 minutes.\n\n\r\n              The Pacers trailed 105-100 before closing the game on a 19-7 run. They made 9 of 10 free throws down the stretch. \n\n\r\n              The Clippers raced to a 13-2 lead. They led 29-14 and closed the quarter with three consecutive 3-pointers to lead 42-22.\n\n\r\n              Indiana came roaring back in the second, outscoring the Clippers 42-19 to lead 64-61. The Clippers ended the third with a 10-0 run to go into the fourth ahead 88-84.\n\n\r\n              Takeaways\r\n              Jazz: They stayed composed after losing Turner.\n\n\r\n              Clippers: It was their second tough loss this week, having been drubbed by 25 points in a home defeat to the Lakers. \n\n\r\n              Key moment\r\n              Leonard has been on a minutes restriction since he made his season debut last month. But he was on the floor for most of the fourth, when he scored 11 points. \n\n\r\n              Key stat\r\n              The Pacers had 31 assists on 43 baskets and seven turnovers to the Clippers' 19.\n\n\r\n              Up next\r\n              The Pacers visit the Lakers on Monday to conclude a three-game trip. The Clippers host Utah on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998029.755114
}