{
  "game_id": "0021500760",
  "espn_id": "400828647",
  "date": "Feb 06, 2016",
  "matchup": "HOU vs. POR",
  "headline": "Lillard scores 21 to help Portland beat Houston 96-79",
  "body": "HOUSTON -- The Portland Trail Blazers were determined that this trip to Houston would end much better than their last visit here when they were stung by a tough overtime loss to the Rockets.\nThat was clear from the beginning of this one. Damian Lillard had 21 points and 10 assists and the Trail Blazers built a big lead early and rolled to an easy 96-79 win over the Rockets on Saturday.\nIn their last game here they led by 15 in the fourth quarter before Houston rallied to force overtime and got a 108-103 win on the day coach Kevin McHale was fired in November.\n\n\"We talked about it for a little while after and we was sick about that one,\" Lillard said. \"We talked about it. Especially coming into tonight, we said to remember what happened last time.\"\nOn Saturday, the Trail Blazers were up by 19 at halftime and scored the first six points of the third quarter to make it 61-36 with about 10 minutes left in the quarter.\nJames Harden made four quick points after that before the Trail Blazers used a 13-2 run -- with 3s from Lillard, C.J. McCollum and Al-Farouq Aminu -- to push the lead to 74-42.\nThe Rockets scored the last 11 points of the quarter, with the first nine from Harden, to cut the lead to 74-53 entering the fourth. But Portland opened the fourth with an 8-2 spurt.\n\"That was a really good win,\" Portland coach Terry Stotts said. \"Defensively we were solid all (game). For the most part we took away and they didn't get 3s or transition.\"\nHarden led the Rockets with 33 points.\n\"We're just a slow step on everything,\" Harden said. \"When you get a slow step, you give guys confidence early on in the game. They kind of rode that wave out and were making shots.\"\nThe Trail Blazers had six players with 10 or more points. McCollum and Gerald Henderson had 16, Maurice Harkless had 14, Aminu had 11 and Mason Plumlee had 10.\nThe Rockets made a bit of a game out of it when they scored 11 straight points to get within 89-78 with about 3 minutes left. But Portland used a 5-1 spurt after that to fend off the late charge.\nHouston entered the game shooting 35.5 percent from 3-point range but made just 7 of 36 for a season-low 19.4 percent. But it wasn't just the Rockets' long-range shooting that was terrible on Saturday -- they shot just 32.5 percent overall, which is also a season-low. They were also outrebounded 54-43.\n\"It's disappointing the way we came out and played this game,\" Houston coach J.B. Bickerstaff said. \"As important as this game was it's disappointing to say the least.\"\nThe Trail Blazers led by six at the end of the first quarter and opened the second quarter with a 13-2 run to extend the lead to 42-25.\nThe Rockets got within 44-30 after an alley-oop dunk by Dwight Howard with about 7 minutes left in the second quarter. But Houston couldn't do anything on offense after that, making just one field goal the rest of the first half to trail 55-36 at halftime.\nHouston made four free throws in that span but missed 11 shots and had five turnovers.\nTIP-INS\nTrail Blazers: F Noah Vonleh sat out for the second game in a row with a left ankle sprain. ... The game was stopped with about 3 1/2 minutes left when Plumlee was cut over his right eye and blood was running down his face. ... Plumlee had two blocks.\nRockets: F Terrence Jones missed his second straight game after a car accident Wednesday. Bickerstaff said Jones is in the concussion protocol and isn't sure when he'll return. ... Trevor Ariza got a technical late in the second quarter when he kicked the ball off the court. ... Rookie Montrezl Harrell returned after missing two games with an illness.\nNEW THREADS\nThe Rockets debuted special uniforms to celebrate the Chinese New Year, which begins on Monday. The jerseys, which Houston will also wear in their upcoming games at Golden State and Portland, are Houston's signature red and white but feature Chinese characters. Houston and Golden State became the first teams in NBA history to wear Chinese New Year uniforms last season.\nHARDEN'S HAND\nHarden injured his right hand late in the game but said it isn't serious.\n\"It's sore a little bit,\" he said. \"But it should be all right.\"\nHarden had a season-high 10 turnovers after averaging just 2.9 turnovers a game in Houston's last 11 games.\nUP NEXT\nTrail Blazers: Visit Memphis on Monday night.\nRockets: Visit Golden State on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994622.267623
}