{
  "game_id": "0022200106",
  "espn_id": "401468261",
  "date": "Nov 01, 2022",
  "matchup": "PHX vs. MIN",
  "headline": "Suns win 5th straight behind Johnson, beat Wolves 116-107",
  "body": "PHOENIX -- — Cam Johnson scored 29 points, making seven 3-pointers, and the Phoenix Suns beat the Minnesota Timberwolves 116-107 on Tuesday night for their fifth straight victory. \n\n\r\n              Johnson finished 7 of 11 behind the arc and 10 for 17 overall in another strong outing for the former reserve who is now in the starting lineup.\n\n\r\n              “I think he is getting more comfortable with the role, but defensively he was really good,” Suns coach Monty Williams said.\n\n\r\n              The victory was the fifth straight for the Suns (6-1), who won without center Deandre Ayton, sidelined with a sprained right ankle.\n\n\r\n              Johnson helped pick up his team with Devin Booker having a tough night shooting. Booker still had 18 points but was 2 of 7 from 3-point range and 6 of 18 overall. He did have seven rebounds and five assists.\n\n\r\n              “Offensively he was really aggressive,\" Williams said of Johnson. “Everybody was telling him to shoot the ball. He is more than a shooter. He has the ability to make plays. He is a really good passer.” \n\n\r\n              Johnson also had the responsibility of guarding Karl-Anthony Towns. \n\n\r\n              “That is a challenge I really enjoy,” Johnson said. “They play a little bit different, so being able to execute what we worked on feels pretty good.”\n\n\r\n              Minnesota got within 87-85 after Anthony Edwards hit a 3-pointer midway through the fourth quarter. But the Timberwolves committed six turnovers in their next seven possessions and the Suns were never threatened after that.\n\n\r\n              “Carelessness, bad spacing, poor execution, certainly some heightened defense by Phoenix. But we've got to be better in those moments,” Timberwolves coach Chris Finch said. “Whatever the defense is giving us, we've got to take that.”\n\n\r\n              Mikal Bridges had 19 points for Phoenix and Chris Paul had 15 points, 12 assists and a team-high eight rebounds for the Suns, who led by as many as 18 points.\n\n\r\n              Towns and Edwards scored 24 points apiece. Towns had 10 rebounds and seven assists, while Edwards made five 3-pointers in 10 attempts.\n\n\r\n              Naz Reid scored 13 points, making 5 of 6 shots, and fellow reserve Jaylen Nowell scored 10 for Minnesota.\n\n\r\n              Despite the absence of Ayton, the Suns held their own on the boards against the taller Timberwolves, with Minnesota outrebounding Phoenix 42-34. The Wolves entered the night third in the NBA in rebounding with 49 per game.\n\n\r\n              Rudy Gobert had nine rebounds for Minnesota and scored seven points, all from the free throw line. He took just one shot from the field in 32 minutes. Two other Wolves starters didn't contribute much — D'Angelo Russell had five points and Jaden McDaniels, limited to 17 minutes by foul trouble, scored four.\n\n\r\n              WAINRIGHT UPDATE\n\n\r\n              Suns guard Ish Wainright’s father died Monday. Calvin Wainright, who was 68, was a longtime basketball coach and mentor in Kansas City. Ish Wainright has been out with a back injury since the beginning of the season, and away from the team in recent days.\n\n\r\n              “They all were taken aback by it, they have supported him the way they always do,” coach Monty Williams said of his players hearing the news.\n\n\r\n              NASH OUT\n\n\r\n              Williams said he felt bad for Suns great Steve Nash, who is no longer the coach of the Brooklyn Nets after a tumultuous tenure.\n\n\r\n              “It’s always tough. We all kind of know how hard these jobs can be,” Williams said. “I haven’t seen anybody have to deal with more than him in recent years as far as non-basketball stuff. It’s tough to watch from afar.”\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: G Jordan McLaughlin (right heel) played after missing two games. He finished with nine points.\n\n\r\n              Suns: F Torrey Craig returned from a left heel injury for Phoenix. C Dario Saric played his second game of the season. He missed the entire 2021-22 season after tearing his ACL in the 2021 NBA Finals. Craig finished with four points and Saric made a 3-pointer, leading to a loud roar from the crowd, in his six minutes of play.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Home vs. Milwaukee on Friday.\n\n\r\n              Suns: Host Portland Friday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995113.595019
}