{
  "game_id": "0022000274",
  "espn_id": "401267434",
  "date": "Jan 27, 2021",
  "matchup": "BKN @ ATL",
  "headline": "Durant's 32 points lead Nets past Young, Hawks 132-128 in OT",
  "body": "ATLANTA -- — Kevin Durant scored 32 points and James Harden had 31 to lead a productive effort for Brooklyn's big three scorers, and the Nets beat the Atlanta Hawks 132-128 in overtime on Wednesday night.\n\n\r\n                    Harden added 15 assists and eight rebounds. Kyrie Irving scored 26 points for Brooklyn.\n\n\r\n                    Harden, acquired from Houston on Jan. 14, started slowly before scoring 16 points in the second period. It was an indication he is finding his place in the Nets' offense after not scoring more than 21 points in any of his previous four games.\n\n\r\n                    “That’s who he is,” Irving said. “We just want him to come into this group and not think so much about fitting in, but just be who he is.”\n\n\r\n                    Trae Young had 28 points and 14 assists for Atlanta. Cam Reddish scored a season-high 24 points while John Collins and De'Andre Hunter each had 21 points.\n\n\r\n                    Hawks coach Lloyd Pierce described the game as “playoff basketball.”\n\n\r\n                    “That’s a good test for our guys against a really good team, a team that’s going to be there at the end at some point,” Pierce said. “I thought we were there. We had a couple miscues that we can learn from.”\n\n\r\n                    Durant's dunk gave the Nets a 127-121 lead in the extra period. After Young made one of two free throws to trim Brooklyn's lead to 129-126, Durant's turnover with 40 seconds remaining gave Atlanta an opening. Hunter missed a long jumper that would have tied the game.\n\n\r\n                    Harden stretched the lead by sinking two free throws with 4.6 seconds remaining.\n\n\r\n                    “Tonight was a great win,” Harden said. “We stuck with it in four quarters and overtime.”\n\n\r\n                    After scoring only two points in the opening period, Harden passed up a scoring opportunity on the Nets' first possession of the second quarter. He then looked toward the Nets bench, gestured in a shooting motion and then nodded as if to confirm he should have taken the shot.\n\n\r\n                    Harden made a 3-pointer to spark his scoring spree. The Hawks called a timeout about three minutes into the period after Harden's step-back 3 over Kevin Huerter.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Coach Steve Nash is looking forward to more practice time with the start of a three-game road trip. The game at Atlanta opened a stretch of 10 of 13 games on the road. “It’s a great opportunity for us to keep rolling,\" Nash said. “We’ve played so many games in a short period of time. We have a stretch now where we have a little bit of breathing room between games.\"\n\n\r\n                    Hawks: Clint Capela had 11 rebounds, his 14th consecutive game with at least 10. ... G Rajon Ronda (left ankle sprain) was held out. ... There was a pregame moment of silence for former Hawks beat writer Sekou Smith, who was 48 when he died on Tuesday due to COVID-19. Smith covered the Hawks for the Atlanta Journal-Constitution before working for Turner Sports for NBA TV and NBA.com.\n\n\r\n                    JUST MISSED\n\n\r\n                    Harden missed a 3-point attempt with less than a second remaining in regulation.\n\n\r\n                    “I was trying to create some separation and get off a shot,” Harden said. “I thought it was pretty good, just a little bit too long.”\n\n\r\n                    BREAKOUT FOR CAM\n\n\r\n                    Reddish (right Achilles tendon tightness) returned after missing one game. He also has missed games with a recent bruised knee and has struggled with inconsistent production before emerging with a strong performance against the Nets despite the difficult assignment of defending Durant.\n\n\r\n                    “Cam was great,” Pierce said. “We needed what he brought tonight, a downhill attacking mentality. ... He didn’t force anything.”\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Continue three-game road trip Friday at Oklahoma City.\n\n\r\n                    Hawks: Visit Washington on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997511.640064
}