{
  "game_id": "0021600460",
  "espn_id": "400899902",
  "date": "Dec 25, 2016",
  "matchup": "LAL vs. LAC",
  "headline": "Lakers snap 11-game skid vs rival Clippers, 111-102",
  "body": "LOS ANGELES --  The Los Angeles Lakers feel like they've spent at least a month short-handed due to injuries and weary from an extraordinarily grinding schedule.\n\nWhen they finally found an opponent with even more ailments and exhaustion, the Lakers didn't waste the opportunity to snap an embarrassing rivalry losing streak.\n\nNick Young and Timofey Mozgov scored 19 points apiece and the Lakers ended their 11-game skid against the Los Angeles Clippers with a 111-102 victory Sunday night.\n\nLou Williams and D'Angelo Russell added 14 points each for the Lakers, who hadn't beaten their Staples Center co-tenants since opening night of the 2013-14 season. The streak was tied for the Lakers' longest against any team since moving to Los Angeles a half-century ago, and it was the Clippers' longest active winning streak against any opponent.\n\nWith Clippers cornerstones Blake Griffin and Chris Paul sidelined by injuries, the Lakers won with a season-high seven scorers in double digits.\n\n\"It was needed, it was,\" Lakers coach Luke Walton said. \"It felt good to get this one back home. It's been a tough couple of weeks, and we had to come together to win that one.\"\n\nThe Lakers surged from a halftime deficit to an 18-point lead during a dynamite third quarter for their second win in 14 games. They also won on Christmas for the 22nd time, matching the Knicks' NBA record.\n\n\"A win is a win, and nobody makes excuses for us when we have guys down,\" Williams said. \"We got stops in the third quarter, and we were able to put a few (baskets) together. We were the most aggressive team coming out of the locker room.\"\n\nJ.J. Redick scored 22 points before sitting out the fourth quarter with a sore left hamstring for the Clippers, who couldn't overcome the absence of their two best players and top scorers in just their third loss in nine games. Griffin is out for at least a month after right knee surgery, while Paul was a late scratch for the second straight game with a left hamstring strain.\n\nJamal Crawford also scored 22 points, and DeAndre Jordan had seven points, 10 rebounds and a career-high six assists as the Clippers played the fourth of eight games in a 12-day stretch.\n\n\"We understand there's going to be times like this, weeks like this,\" said Marreese Speights, who scored 15 points. \"We just have to fight through it and be a better team.\"\n\nTHIRD BASE\n\nThe Clippers held an 11-point lead during the first half, but the Lakers scored the first 11 points out of halftime and eventually stretched their run to 28-12, taking a 15-point lead into the fourth. They outscored the Clips 34-16 in the third quarter. \"I thought we took our jobs very seriously in the third quarter,\" Walton said.\n\nRIVALRY RENEWED\n\nThe Lakers returned from a discouraging 1-6 road trip to begin a five-game homestand with their first meeting of the season against the Clippers, who have supplanted their 16-time champion neighbors as the most competitive team in basketball-crazy Los Angeles. Despite their recent monthlong slump, the Lakers are competitive again after the three worst seasons in franchise history and the retirement of Kobe Bryant, the leading scorer in NBA history on Christmas.\n\nINJURIES INCREASE\n\nPaul is likely to sit out again Monday against Denver before the star point guard tests his leg, coach Doc Rivers said. Redick wasn't sure when he will return, but acknowledged he could miss multiple games during this compressed schedule. \"Could be a day, could be seven,\" Redick said. \"It's not ideal to be out, but we have a deep team.\"\n\nTIP-INS\n\nClippers: The longest winning streak against any opponent in franchise history is a 14-game run against Minnesota from 2012-15. ... They played on Christmas for the sixth straight season. The franchise is 6-9 overall on the holiday.\n\nLakers: F Larry Nance Jr. will be out for about four weeks with a bone bruise in his left knee. The second-year pro and dunk machine is a key reserve. ... F Tarik Black and G Jose Calderon returned to uniform after lengthy injury absences, but didn't play.\n\nUP NEXT\n\nClippers: Host Nuggets on Monday.\n\nLakers: Host Jazz on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995415.563405
}