{
  "game_id": "0021801126",
  "espn_id": "401071799",
  "date": "Mar 28, 2019",
  "matchup": "HOU vs. DEN",
  "headline": "Harden's 38 helps Rockets cruise past Nuggets 112-85",
  "body": "HOUSTON --  Known for their high-powered offense, the Houston Rockets downed the Denver Nuggets on Thursday night with a big defensive performance.\n\n\"We played great defense tonight,\" coach Mike D'Antoni said. \"If we can do that, then I don't care who's out there.\"\n\nJames Harden scored 38 points and the Houston Rockets used a huge second quarter to build the lead and get an easy 112-85 win over the Nuggets.\n\nThe Rockets trailed by as many as seven in the first quarter, but built a 62-44 lead at halftime behind a 40-point second quarter.\n\n\"Outside of the first quarter, I feel like we played our defense,\" P.J. Tucker said. \"We were aggressive, we helped each other, we stuck to our principles on what we wanted to do against this team. And when we do that, we feel like we could beat anybody on any given night.\"\n\nHouston was up by 22 at the start of the fourth and a 5-0 run, with a 3 from Harden, made it 102-78 with five minutes remaining. D'Antoni cleared the bench with 3  1/2 to go after the Rockets extended that run to 10-0, with another 3-pointer from Harden.\n\nThe victory is Houston's third in four games as the Rockets bounced back from a 108-94 loss to Milwaukee on Tuesday night.\n\nHarden, Eric Gordon and P.J. Tucker managed just two 3-pointers combined against the Bucks on a night Houston went 16 for 52 from long range. The Rockets took a few less 3-point shots on Thursday with 40, but the trio fared way better in the area. Harden made five, Gordon added four and Tucker had one.\n\nThe Nuggets, who entered the day just a half-game behind the first-place Golden State Warriors, got 20 points from Jamal Murray as they lost for the second time in three games after winning their previous six. They did not shoot well on 3-pointers, making just four of 24, with three coming from Gary Harris.\n\nThe Rockets did a good job of feeding Clint Capela inside early and the center had 13 points and 11 rebounds by halftime. He finished with 17 points and 15 rebounds.\n\nThe Nuggets had cut the lead to 13 midway through the third before a 3-pointer by Gordon started a 5-0 run that made it 76-58. Denver went on a 5-1 run, with a 3-pointer from Harris, after that but Harden ended the run with a 3 that left Houston up 80-63 with 2  1/2 minutes left in the quarter.\n\nThat 3-pointer started a 10-2 run by the Rockets, with the first eight points from Harden that left them up 87-65 entering the fourth.\n\nTIP-INS\n\nNuggets: Nikola Jokic had 16 points, eight rebounds and six assists. ... Harris scored 11 points. ... Monte Morris scored 16 points off the bench.\n\nRockets: Capela extended his career-best streak of games with at least 10 rebounds to 11. ... Gordon had 18 points. ... Kenneth Faried sat out with a sore left knee. ... Gerald Green missed the game with a strained groin.\n\nSWEET COUGARS\n\nThe Rockets recognized the Houston Cougars for reaching the Sweet 16 for the first time in 35 years between the first and second quarters. They played a video with highlights from the Phi Slama Jama teams, which reached the Final Four three straight seasons from 1982-84, before showing clips of this year's Houston team, which faces Kentucky on Friday night. Rockets owner Tilman Fertitta, who graduated from Houston, then took the court with Hall of Famers Hakeem Olajuwon and Clyde Drexler, who starred for the Cougars in the Phi Slama Jama days, and congratulated the team on its success this season.\n\nOH BABY\n\nDenver's Malik Beasley returned Thursday night after missing Tuesday's game at Detroit for the birth of his first child.\n\nHis son Makai was born Tuesday and he rejoined the team on Wednesday night in Houston.\n\n\"Family is first,\" coach Michael Malone said. \"I think Malik was nervous to be a dad and he was nervous about missing the game. That was a lot more important than being here for the Detroit game.\"\n\nUP NEXT\n\nNuggets: Visit Oklahoma City on Friday night.\n\nRockets: Host Kings on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995283.491094
}