{
  "game_id": "0021900784",
  "espn_id": "401161426",
  "date": "Feb 08, 2020",
  "matchup": "PHX vs. DEN",
  "headline": "Murray scores 36, Nuggets finish season sweep over Suns",
  "body": "PHOENIX --  Jamal Murray poured in the points for the Nuggets, Torrey Craig stopped the Suns from scoring them and Denver finished off a season sweep of Phoenix.\n\nMurray had another big night on the Suns' home floor, scoring 36 points while making 14 of 17 shots from the field, including 6 of 8 from 3-point range in the Nuggets' 117-108 victory on Saturday night. He scored 28 in Denver's win in Phoenix on Dec. 23.\n\n\"A lot of guys can score 36 points, but can they do it as efficiently as he did tonight?\" Denver coach Michael Malone said. \"So that's a huge credit to him. A big, big night for him.\"\n\nDenver won all four games against Phoenix this season and has won five of six overall. The Nuggets led 83-78 going into the final quarter and never trailed in the fourth, turning back a few Phoenix rallies.\n\n\"I was making shots. I had the rhythm,\" Murray said. \"I wasn't going to force anything. I had five turnovers so I am disappointed about that, but we were just playing free. We weren't putting any pressure on ourselves.\"\n\nJokic added nine rebounds and six assists. Paul Millsap -- who was playing in his first game since Jan. 6 -- had 12 points, 11 rebounds and four assists in 18 minutes off the bench.\n\nDeandre Ayton finished with 28 points and 19 rebounds for the Suns. Devin Booker added 21 points and Kelly Oubre Jr. had 20. Booker's been one of the NBA's most efficient scorers this season, but Craig made life difficult for him, and Booker finished just 5 of 16 from the field.\n\n\"I really think Torrey Craig is an All-NBA defender,\" Malone said. \"I know people outside of Denver might not even know who Torrey Craig is, but if you look at the job he's done on some of the best players in the NBA, some of the top guards in the West, Torrey Craig deserves to be in that conversation.\"\n\nPhoenix led 37-28 after the first quarter but Denver rallied to take a 55-54 advantage by halftime. Murray had 17 points before the break while Jokic had 10. Ayton had 18 points and 11 rebounds.\n\nPhoenix has lost five of its last six games. The Suns couldn't keep their momentum from Friday night's impressive 127-91 win over the Houston Rockets.\n\n\"I thought we were a bit tired tonight,\" Suns coach Monty Williams said. \"We missed some open looks. Last night everything was dropping. Tonight, we missed a ton of 3s. We got 32 of them up, shot 28 percent. A little bit of that is fatigue on a back-to-back.\"\n\nAYTON'S REBOUNDS\n\nAyton grabbed his 1,000th career rebound in the third quarter and needed just 94 career games to reach the milestone, which was the fewest games needed to reach 1,000 in franchise history.\n\nSince 1992, only Shaquille O'Neal, Blake Griffin and Tim Duncan reached 1,000 rebounds faster.\n\n\"It shows where my hard work is going,\" Ayton said. \"I want a `W', that's the best milestone you can possibly get, but it's good to know that.\"\n\nAyton's been on a roll of late, averaging 22.2 points and 13.6 rebounds over the past five games.\n\nTIP-INS\n\nNuggets: Millsap missed 16 straight games with a left knee injury before playing against the Suns. ... Guard Will Barton (left knee inflammation) and forwards Bol Bol (left foot injury management), Mason Plumlee (right footid injury) and Michael Porter Jr. (right ankle injury) didn't play. ... Keita Bates-Diop played in his first game with the Nuggets since being traded from the Timberwolves earlier this week. He had four points and two rebounds in 14 minutes.\n\nSuns: The Suns made all 23 of their free throws on Saturday. It's the 29th time in franchise history that the team's been 100 percent from the line. ... Guard Tyler Johnson (right knee soreness) and forwards Aron Baynes (left hip soreness), Frank Kaminsky III (right patella stress fracture) and Dario Saric (left ankle sprain) didn't play.\n\nUP NEXT\n\nNuggets: Return home to host the Spurs on Monday.\n\nSuns: Go on the road to face the Lakers on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996547.657697
}