{
  "game_id": "0022400562",
  "espn_id": "401705128",
  "date": "Jan 15, 2025",
  "matchup": "TOR vs. BOS",
  "headline": "Barrett stars as Raptors beat Celtics 110-97 to snap 10-game losing streak against Boston",
  "body": "TORONTO -- — RJ Barrett had 22 points and 10 rebounds, and the Toronto Raptors snapped a 10-game losing streak against Boston with a 110-97 victory over the Celtics on Wednesday night.\n\n\r\n              Jakob Poeltl added 16 points and 11 rebounds as the Raptors won consecutive games for the third time. Scottie Barnes scored 18 points.\n\n\r\n              Toronto, which beat Golden State on Monday, has yet to win three straight this season.\n\n\r\n              Peyton Pritchard scored 20 points, Kristaps Porzingis had 18 and Jayson Tatum added 16 for Boston. The Celtics shot 16 for 46 from 3-point range.\n\n\r\n              It was Boston's first loss to Toronto since March 28, 2022. Brown, Tatum and Horford were among four Celtics regulars who missed that defeat.\n\n\r\n              Toronto’s third win in 19 games was a major turnaround from the Raptors’ previous meeting with the Celtics. Toronto lost by a franchise-worst 54 points, 125-71, on Dec. 31 at Boston.\n\n\r\n              Raptors guard Immanuel Quickley sat for the second straight game. He has a left hip injury.\n\n\r\n              Takeaways\r\n              Celtics: Boston lost for the third time in its past five. It is 7-7 since starting the season 21-5.\n\n\r\n              Raptors: Guard Ochai Agbaji needed three stitches to close a cut on his right hand after being injured in the second quarter. He did not return. \n\n\r\n              Key moment\r\n              Jamal Shead’s 3 with 7:36 to play capped a 12-4 Toronto run to start the fourth quarter and gave the Raptors a 100-86 lead, their biggest of the game at that point.\n\n\r\n              Key stat\r\n              Porzingis (4 for 5) and Pritchard (4 for 8) combined to go 8 for 13 from 3-point range, but the rest of the Celtics went a combined 8 for 33.\n\n\r\n              Up next\r\n              Both teams play again Friday. Boston hosts Orlando, and Toronto visits Milwaukee.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996964.027787
}