{
  "game_id": "0021600770",
  "espn_id": "400900175",
  "date": "Feb 06, 2017",
  "matchup": "OKC @ IND",
  "headline": "Pacers shake down Thunder with 2nd-half comeback",
  "body": "INDIANAPOLIS --  Paul George keeps taking care of business.\n\nLast week, he outplayed the NBA's second-leading scorer. On Monday night, George's encore against the league's top scorer was every bit as impressive.\n\nThe four-time All-Star scored 21 points, grabbed eight rebounds and rallied the Indiana Pacers from an 11-point halftime deficit to beat the Oklahoma City Thunder 93-90 for their seventh straight win.\n\n\"I thought the first half they brought the physicality. It took us until the second half to adjust to it,\" George said. \"I thought we played defense (in the second half). We played defense. We got stops -- simple basketball.\"\n\nIndiana's winning streak is its longest in nearly two years, and it has held four straight opponents under 100 points. Along the way, the Pacers have won four straight at home and have beaten James Harden and Russell Westbrook with defense. Westbrook was limited to two assists in the final two quarters Monday.\n\nGeorge, meanwhile, scored 15 points in the second half and helped the Pacers break out of their first-half shooting funk. And when the defense ramped it up in the second half, the weary Thunder broke down.\n\nWestbrook had an inefficient 27 points, a season-high 18 rebounds and nine assists. He shot 10 of 27 from the field and 4 of 10 on 3-pointers, including two missed 3s in the final 7.6 seconds when he could have forced overtime.\n\n\"The first look Russell got was OK, the second was pretty good,\" coach Billy Donovan said. \"The goal would be for our team to play the way we did in the first half, to try to have a complete game like that.\"\n\nInstead, Oklahoma City struggled in the second half, giving away a 52-41 halftime lead by midway through the third quarter. The Pacers then went on a 12-4 run to take a 79-72 advantage early in the fourth and never trailed again.\n\nIndiana led 91-82 with 4:48 to go, but the Thunder scored eight straight and had a chance to take the lead with 1:39 to play. But Westbrook missed a layup, Steven Adams missed a tip and George answered with an 18-footer. Westbrook then missed his final pair of 3-point attempts.\n\n\"He (Westbrook) might have gotten his numbers, but we got the win,\" Jeff Teague said after scoring 17 points.\n\nREVERSAL OF FORTUNE\n\nThe first and second halves were a complete reversal.\n\nAfter shooting 46.7 percent in the first half, the Thunder shot 30.2 percent in the second half. On the other hand, Indiana shot 30.4 percent in the first half and made 46.3 percent of its shots in the second.\n\nREBOUNDING EDGE\n\nPerhaps the most mystifying stat of the night showed up in the rebounding column: Thunder 61, Pacers 37.\n\nThose numbers usually spell doom for the team on the wrong end of the ledger. Coming into the game, Oklahoma City was 11-1 when holding a 10-rebound advantage against opponents. The Thunder only had a 19-15 scoring edge in second-chance points and committed 16 turnovers.\n\nTIP-INS\n\nThunder: They are 3-6 on the second night of back-to-backs this season. ... Oklahoma City was swept by the Pacers for the first time since 2008-09. ... Adams had 15 points and nine rebounds and Andre Roberson had 11 points and 11 rebounds. ... Jerami Grant had five blocks.\n\nPacers: Indiana moved within one win of extending the NBA's longest active streak of consecutive winning seasons at home to 28. ... The Pacers are 14-4 since Jan. 1. ... Myles Turner had 10 points and four blocks, his 13th game this season with at least four blocks. ... Glenn Robinson III had 14 points off the bench.\n\nUP NEXT\n\nThunder: Will host the defending NBA champion Cleveland Cavaliers on Thursday night before Kevin Durant and the Golden State Warriors come to town Saturday.\n\nPacers: Will wait to see if LeBron James suits up for the division-leading Cavs on Wednesday night. James did not play in his last two games in Indianapolis.",
  "source": "espn_api",
  "crawled_at": 1764995276.1865652
}