{
  "game_id": "0022200902",
  "espn_id": "401469057",
  "date": "Feb 24, 2023",
  "matchup": "LAC vs. SAC",
  "headline": "Kings outlast Clippers 176-175 in double overtime",
  "body": "LOS ANGELES -- — There were a couple moments Friday night when Sacramento coach Mike Brown wishes he could have enjoyed being a part of the second-highest scoring game in NBA history.\n\n\r\n              Brown and his Kings though were able to savor something that is more important in the long run — a hard-fought victory.\n\n\r\n              Malik Monk scored a career-high 45 points, De’Aaron Fox had the go-ahead basket and finished with 42 and Sacramento outlasted the Los Angeles Clippers 176-175 in double overtime.\n\n\r\n              It is only the second time in the NBA's 76-year history that both teams have scored at least 170 points. Detroit beat Denver 186-184 in triple overtime on Dec. 13, 1983, in what remains the highest-scoring NBA game. \n\n\r\n              The Kings are third on the scoring list with the 176 points and the Clippers fourth. A team has scored 170 points in a regular-season game only seven times.\n\n\r\n              “From a fan’s standpoint, I can see how this game would have been a lot of fun to watch,” Brown said. \"There was unbelievable shot making and great defense. There was high-level talent that was on display. Kudos to the players.\n\n\r\n              Sacramento and Los Angeles also combined for 44 3-pointers, tied for the most in a game in NBA history.\n\n\r\n              Both teams also shot at least 58% from the field and were 80% or better from the foul line.\n\n\r\n              “I thought was a great game. A lot of momentum shifts,” Clippers coach Tyronn Lue said.\n\n\r\n              The Clippers had a 175-169 advantage with 1:57 remaining before the Kings scored the final seven points, including Fox's jumper with 36.5 seconds remaining. The Clippers had the final shot, but Nico Batum missed a 3-pointer at the buzzer.\n\n\r\n              The Kings also overcame a 14-points deficit late in the fourth quarter and six-point deficits in both overtime periods. \n\n\r\n              “We just stuck with it. We got down 12 at one point but just had our heads up. We knew they were going to let us back in,” Monk said.\n\n\r\n              It was the first time in franchise history the Kings have had two players score at least 40 points in a game. It is the second time it has happened in an NBA game this season after Cleveland's Caris LeVert and Donovan Mitchell did it against Boston.\n\n\r\n              Fox — who also had 12 assists and five steals — is just the 12th player since 1973-74 with 40 points, 10 assists and five steals in a game. The last to do it was James Harden in 2019.\n\n\r\n              “We just had to grind this game out. We were on the second night of a back-to-back but it is what it is. We have a younger team than them,” Fox said.\n\n\r\n              Kawhi Leonard scored a season-high 44 points for Los Angeles and Paul George added 34. Leonard had 21 points in the third quarter, which tied his career high for points scored in a quarter.\n\n\r\n              “I thought he did a great job getting to a spot with the 3-point shots and attacking the basket,” Lue said about Leonard.\n\n\r\n              Russell Westbrook started and made his Clippers debut after he cleared waivers Wednesday. He had 17 points, 14 assists and five rebounds in 39 minutes before fouling out with 1:49 remaining in the second overtime. \n\n\r\n              RALLY KINGS\n\n\r\n              Los Angeles had a 145-131 advantage with 4:25 remaining before the Kings rallied back to force overtime with a 22-8 run. Monk forced the extra session with a 3-pointer from the corner with 1.1 seconds remaining.\n\n\r\n              Sacramento’s key spurt late in regulation was 10 straight points that got it to 147-146 with 1:22 left.\n\n\r\n              The Clippers had a 162-156 lead with 3:04 remaining in the first overtime before the Kings scored six straight to even it. Monk hit a pair of free throws with 20.4 seconds left to tie it at 164. Los Angeles had a chance to win it, but Leonard was unable to put in a tip in at the buzzer.\n\n\r\n              LEONARD'S NIGHT\n\n\r\n              It is the sixth 40-point game in Leonard’s 10-year career and his second since joining the Clippers in the summer of 2019. He was 16 of 22 from the field, including six 3-pointers, in 46 minutes.\n\n\r\n              TOUGH NIGHT\n\n\r\n              Sacramento center Domantas Sabonis played only 31 minutes after being in foul trouble most of the night. He picked up his four fouls in the first half and then drew his fifth with 6:46 remaining in the third quarter.\n\n\r\n              Sabonis, who got his seventh triple-double in Thursday night’s win over Portland, fouled out with 3:09 remaining in the first overtime. He finished with 20 points, 10 rebounds and four assists.\n\n\r\n              TIP INS\n\n\r\n              Kings: Are 6-4 in the second game of back-to-backs. ... Sacramento had a season high 18 steals. .... Keegan Murray had 15 points. ... Chimezie Metu tied a season high with nine rebounds.\n\n\r\n              Clippers: Batum had 19 points, including five 3-pointers, on French Heritage night. A bobblehead of Batum with France’s flag was given to fans entering the arena. ... Norman Powell had 24 points off the bench. ... Ivica Zubac did not play due to a right calf strain.\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Oklahoma City on Sunday.\n\n\r\n              Clippers: At Denver on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994961.221745
}