{
  "game_id": "0021501012",
  "espn_id": "400828899",
  "date": "Mar 17, 2016",
  "matchup": "TOR @ IND",
  "headline": "Lowry, DeRozan each score 28 in 101-94 win over Pacers",
  "body": "INDIANAPOLIS --  With Kyle Lowry and DeMar Derozan driving from the backcourt, the Toronto Raptors are on track for the best season in franchise history.\n\nAgainst Indiana on Thursday night, the Raptors duo wore down the Pacers late and gave the Raptors the clutch plays they needed to keep pace with Eastern Conference-leading Cleveland.\n\nBoth Lowry and DeRozan finished with 28 points and Bismack Biyombo set a franchise record with 25 rebounds in guiding the Raptors to a 101-94 win in overtime at Indiana after the Pacers appeared to be headed for yet another win against an Eastern Conference playoff team. Indiana was coming off a home win Wednesday over Boston.\n\n\"We understand that someone on our team is eventually going to get hot late in the game,\" DeRozan said. \"I started to hit some shots and then Kyle got going.\"\n\nToronto's All-Star guard combo did it when it mattered most.\n\nDeRozan scored 14 points in the fourth quarter and overtime combined, and it was his play during a 4-minute stretch in the middle minutes of the fourth that swung the game in Toronto's favor. After Paul George gave the Pacers a 74-70 advantage with 6:35 left, DeRozan scored 10 of Toronto's next 15 points. His fallback jumper on the right wing with 1:25 left gave Toronto an 85-84 lead.\n\nMonta Ellis had a chance at the foul line to put Indiana ahead, but he missed his first free-throw attempt. He made the second, tying the game at 85. DeRozan then had a chance to win the game at the end of regulation but missed a fade-away jumper on the wing as time expired.\n\nIn overtime, Lowry did his part to help Toronto improve to 26-7 since Jan. 1. He scored eight points in the extra period and his activity with the basketball and away from it disrupted the Pacers on the defensive end. That allowed Toronto to score 16 points in the extra 5 minutes.\n\nToronto scored on eight of its 10 overtime possessions, including the final seven offensive chances it had.\n\n\"They attacked one-on-one,\" Raptors coach Dwane Casey said of DeRozan and Lowry. \"They had to go to attacking the rim, finding other people and trying to create off the dribble, which is very difficult against the Pacers. But they found a way.\"\n\nLowry added four assists and eight rebounds, but he also committed eight turnovers. Biyombo added a career-high 16 points.\n\nFor Indiana, it's yet another close defeat in a season that continues to produce nail-biting games on a regular basis. The Pacers are 1-7 in overtime games and they've played 16 games decided by one possession.\n\n\"They're all the same, we don't do enough,\" George said of the number of close games the Pacers have played this year. \"Especially coming down to the end (of the season), games that we need, must wins, and we don't complete it.\"\n\nGeorge led the Pacers with 18 points and nine rebounds. George Hill added 18 points and CJ Miles had 13 off the bench.\n\nTIP-INS\n\nPacers: George has scored 30 or more points 18 times this season. ... The Pacers fell to 18-10 at home this season. ... Rookie Myles Turner, who finished with 15 points, is averaging 14.3 points per game since being inserted into the starting lineup 13 games ago. ... Rodney Stuckey played for the first time since Jan. 13 after sitting out with a bone bruise and finished with four points and five rebounds.\n\nRaptors: Toronto needs three more road wins to set a franchise record (Thursday's road victory was the 20th of the season). ... Dwane Casey became the first coach in franchise history to notch 200 career victories. ... DeRozan has scored at least 25 points in five of Toronto's last six games. ... DeRozan played in his 509th career game Thursday, tying Chris Bosh for third on the franchise's career games played list.\n\nUP NEXT\n\nPacers: Host Oklahoma City on Saturday.\n\nRaptors: Host Boston on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994701.480644
}