{
  "game_id": "0022000276",
  "espn_id": "401267436",
  "date": "Jan 27, 2021",
  "matchup": "LAL @ PHI",
  "headline": "Harris shot in final seconds leads 76ers past Lakers 107-106",
  "body": "PHILADELPHIA -- — Joel Embiid tried to dunk on LeBron James and instead his back slammed on the court. James’ push of the 76ers big man got him hit with a flagrant 1 and Embiid cried foul.\n\n\r\n                    He wanted the King tossed.\n\n\r\n                    “That’s a very dangerous play,” Embiid said. “I guarantee if that was me I would have probably been ejected from the game.”\n\n\r\n                    James stuck around -- long enough to watch Tobias Harris stick it to the Lakers. \n\n\r\n                    Harris swished a jumper with 3 seconds left, ending the Lakers’ 13-0 run and sending Philadelphia to a 107-106 victory over Los Angeles on Wednesday night.\n\n\r\n                    The James-Embiid flagrant took center stage in a game between teams that entered with the best records in their conferences. The 76ers lead the East at 13-6 and the Lakers are 14-5 in the West.\n\n\r\n                    “Some people think we haven’t played anybody,” Harris said. “For us, we wanted to go against the champs. We wanted to see where we’re at.”\n\n\r\n                    Philly was nearly on the losing end.\n\n\r\n                    Kentavious Caldwell-Pope hit a 3-pointer with 1:05 left that pulled the Lakers to 105-104. James hit Anthony Davis for the go-ahead basket with 11.2 seconds to go for a 106-105 lead and cap that run.\n\n\r\n                    Harris -- who campaigned for an All-Star nod -- saved the Sixers on a shot over Alex Caruso.\n\n\r\n                    Harris scored 24 points. Embiid had 28 and Ben Simmons had 17 points, 11 rebounds and 10 assists.\n\n\r\n                    James scored 34 points and Davis had 23.\n\n\r\n                    “It didn’t go our way but I loved our fight,” James said.\n\n\r\n                    Embiid, the All-Star center off to the best start of his career, drove down the baseline for an attempted right-handed dunk when James pushed him in flight. Embiid crashed hard on his tailbone, immediately grabbed his back and writhed on the court in pain as James simply looked down and walked past him. After a short video review, James was hit with a flagrant 1 -- “unnecessary contact committed by a player against an opponent” -- and Embiid sank both free throws. \n\n\r\n                    Embiid was quickly hit with his own flagrant when his elbow connected with Davis’ face on a drive to bucket. \n\n\r\n                    Embiid has a history of back issues and sat out Monday’s loss at Detroit with back tightness. He sat alone on a cool-down seat behind the basket for nearly the first 5 minutes of the fourth quarter. Embiid returned and threw his hands in the air in celebration when he buried a shot that gave the Sixers a 10-point lead. \n\n\r\n                    Embiid said James’ foul should have been a flagrant 2 -- an automatic ejection.\n\n\r\n                    “Clearly, he wasn’t the same after that as far as his movement,” coach Doc Rivers said.\n\n\r\n                    The Lakers suffered their first road loss of the season in 11 games.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Coach Frank Vogel was a diehard 76ers fan growing up in New Jersey and eventually spent one season as an assistant coach in the 2004-05 season. His trips to Philly are usually a big homecoming but the pandemic sidelined those plans. Vogel said he hasn’t seen his parents since he had dinner with them during the Lakers’ last visit to Philly. He said the 76ers’ 1983 NBA championship and the Charles Barkley-Allen Iverson years “were a big part of my upbringing.”\n\n\r\n                    76ers: Simmons moved into 13th on the NBA’s career triple-double list with 31. \n\n\r\n                    REMEMBER KOBE\n\n\r\n                    The Lakers played in Philadelphia for the first time since Jan. 25, 2020, when James passed Kobe Bryant for third place on the NBA’s career scoring list. Bryant, his daughter Gianna and seven other people were killed the next morning in a helicopter crash.\n\n\r\n                    A year and a day after Bryant’s death, the Lakers played for the first time since the grim anniversary and bowed their heads during a brief video tribute and a moment of silence for Bryant. \n\n\r\n                    Embiid was a teen in Africa when he first got hooked on basketball watching Bryant and wore sneakers Wednesday emblazoned with photos of Kobe and Gianna on one side and the 2, 8, 24 uniform numbers on the other. \n\n\r\n                    YOU AGAIN\n\n\r\n                    Green and backup center Dwight Howard played key roles in the Lakers’ championship last season. Green landed in Philly through a trade and Howard signed a one-year deal.\n\n\r\n                    “I miss those guys,” Vogel said. “They were two guys that really starred in their roles. It’s so necessary in a championship run. We don’t win a championship without those guys.”\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Play Thursday at Detroit.\n\n\r\n                    76ers: Play Friday at Minnesota. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997322.672647
}