{
  "game_id": "401810187",
  "espn_id": "401810187",
  "date": "Dec 03, 2025",
  "matchup": "DAL vs MIA",
  "headline": "Cooper Flagg and the Mavs extend their 1st winning streak to 3 with win over Heat",
  "body": "DALLAS -- — Cooper Flagg scored 22 points, Anthony Davis had 17 points and 17 rebounds and the Dallas Mavericks extended their first winning streak of the season to three games with a 118-108 victory over the Miami Heat on Wednesday night.\n\n\r\n              Undrafted rookie Ryan Nembhard had 15 points and a season-high 13 assists after scoring a career-high 28 points in the previous game, a 131-121 victory over Denver. Klay Thompson scored 17 points in his relatively new role off the bench.\n\n\r\n              Kel’el Ware had 22 points and 10 rebounds for Miami, while Tyler Herro scored 20 points but was shut out after halftime in his fifth game of the season coming off surgery to repair an issue affecting his left ankle and foot.\n\n\r\n              The Heat played without leading scorer Norman Powell, who has a sprained left ankle. Dallas center Daniel Gafford exited in the second half with a left ankle injury and didn't return.\n\n\r\n              Flagg, the rookie No. 1 overall pick, and Davis combined to score the last eight Dallas points after the Heat had cut a 17-point second-half deficit to four with three minutes remaining on a bucket by Bam Adebayo, who scored 21 points.\n\n\r\n              Davis was playing consecutive games for the first time since missing a month with a left calf strain.\n\n\r\n              Nembhard, who has made four consecutive starts that are the first of his career, made all three of his 3-point attempts during a three-minute stretch in the second quarter when Dallas took the lead for good. The Mavericks were 16 of 32 from long range.\n\n\r\n              Herro was 8 of 12 from the field in the first half but missed the only five shots he got after the break, four from beyond the arc.\n\n\r\n              Up next\r\n              Heat: At Orlando on Friday night.\n\n\r\n              Mavericks: At Oklahoma City on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042748.781516
}