{
  "game_id": "0021400237",
  "espn_id": "400578529",
  "date": "Nov 29, 2014",
  "matchup": "CHA @ ATL",
  "headline": "Hawks send reeling Hornets to 9th straight loss",
  "body": "ATLANTA -- For one night, Hawks coach Mike Budenholzer found no reason to criticize his team's defense.\n\"The guys have really committed and were very good defensively,\" Budenholzer said. \"We can't rest. We have to get better.\"\nPaul Millsap scored 18 points, Mike Scott added 14 and the Atlanta Hawks handed the Charlotte Hornets a ninth straight loss with a 105-75 victory on Saturday night.\nDennis Schroder and Kyle Korver each finished with 12 points for Atlanta (9-6), which has won two straight and four of five.\nThe Hornets (4-14) trailed by 20 early in the second quarter, by 32 late in the second and were down by 44 early in the third.\n\"Right now it doesn't matter what you tweak if you don't show up and play,\" Charlotte coach Steve Clifford said. \"You have to give a professional effort, and that was not a professional effort.\"\nThe Hawks began the game ranked 24th in defensive scoring, but Al Jefferson was the only Hornet in double figures before reserve guard P.J. Hairston scored his 10th point early in the fourth.\nHairston led Charlotte with 15 points. Hornets guard Gerald Henderson, who had 14 points, was the only starter for either team to play in the fourth quarter.\nJefferson finished with 11 points and reserve guard Jannero Pargo added 10. Starting guards Kemba Walker and Lance Stephenson missed a combined 13 of 18 shots from the field to finish with 10 total points.\nThe Hornets, who are 1-9 since starting forward Michael Kidd-Gilchrist suffered a stress reaction in his right foot, were horrible defensively in the first half, letting the Hawks shoot 61 percent, getting outscored by 18 in the paint and getting outrebounded by 13.\n\"We're at a point where we need a win and we're coming into a game with that kind of mentality and we give that kind of effort, that's never a good thing,\" Henderson said. \"That's not who we want to be.\"\nAtlanta led 64-28 at intermission and was up by 44 on Horford's hook shot with 7:45 left in the third. The Hawks improved to 7-2 at home.\nKorver hit a 3-pointer midway through the first to give the Hawks their first double-digit lead.\nMike Scott's free throw at 8:29 of the second put Atlanta up by 20 for the first time, and Carroll hit a 3-pointer at the 1:55 mark to make it a 32-point lead.\nThe Hawks led by 40 on Korver's free throw at the 9:38 mark of the third.\nTIP-INS\nHornets: Clifford said that Kidd-Gilchrist could return next week. ... Starting F Marvin Williams missed his second straight game with a strained left shoulder. ... Reserve G Gary Neal, Charlotte's third-leading scorer was out for a third straight game with a sprained left shoulder.\nHawks: Reserve big man Elton Brand, a 16th-year veteran, played a season-high 28 minutes, finishing with nine points and nine rebounds.\n\"He hadn't played much this season,\" Carroll said. \"It shows how much depth we have on this team. We just have to continue to keep playing hard.\"\nUP NEXT\nHornets: host the Chicago Bulls on Wednesday.\nHawks: host the Boston Celtics on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764992308.1926668
}