{
  "game_id": "0021800899",
  "espn_id": "401071572",
  "date": "Feb 25, 2019",
  "matchup": "DET vs. IND",
  "headline": "Drummond, Griffin lead Pistons over Pacers 113-109",
  "body": "DETROIT --  Detroit coach Dwane Casey downplayed the revenge factor after the Pistons beat Indiana.\n\n\"This is the way that we have to play, no matter who we play,\" Casey said.\n\nAndre Drummond had 26 points and 16 rebounds, Blake Griffin had a triple-double and the resurgent Pistons won for the seventh time in eight games, beating the Pacers 113-109 on Monday night. Indiana won the previous meeting with Detroit, 125-88 on Dec. 28 -- a blowout that was hard for the Pistons to forget.\n\n\"It left a bad taste in our mouth the last time we played these guys. They outworked us pretty much in all facets of the game,\" Griffin said. \"We wanted to come out and impose our will in a lot of different ways.\"\n\nGriffin had 20 points, 10 rebounds and 10 assists for Detroit, which is battling for a playoff spot in the Eastern Conference -- and right now is on the right side of that cutoff. Indiana lost for only the second time in 10 games.\n\nPacers center Myles Turner returned after missing two games with a bruised left hip. He scored seven points. Domantas Sabonis scored 23 for Indiana, but he left with a sprained ankle with just over a minute remaining. Bojan Bogdanovic scored 25 points.\n\nDetroit raced out to a 17-point lead in the first quarter. Indiana trimmed the deficit to four by halftime and tied the game at 75 in the third quarter. Detroit answered with nine straight points, including six by Drummond .\n\nThe Pistons later went on a 13-2 run in the fourth, taking a 100-86 lead on a 3-pointer by Langston Galloway. Detroit held on at the end in what became an increasingly contentious game.\n\n\"This is the type of basketball that we're going to see for the rest of the season,\" Indiana coach Nate McMillan said. \"Tonight you've got a team that's holding down the seventh spot trying to play themselves into the playoffs just as we are. You're going to see this type of game and you've got to expect that. I thought we kind of lost our composure.\"\n\nSTANDINGS\n\nThe Pacers are in solid playoff position with the third-best record in the East. The Pistons remain in seventh but increased their lead to 1 1/2 games over Charlotte and two games over Orlando.\n\nCHIPPY\n\nMcMillan was called for a technical foul in the third, and Bogdanovic and Griffin were hit with a double technical with 3:43 to play in the fourth. Thaddeus Young flagrantly fouled Drummond with 1:57 to go, and then Young and Drummond were given a double technical 25 seconds later.\n\n\"We've got to keep our head. The only way they were going to get back in that game was to get us discombobulated, and get us upset and out of sorts, and they did,\" Casey said. \"Nobody backed down, and that's the way you have to play, with that chip on your shoulder. But with that said, we've got to have an understanding of what they're trying to do. They're trying to just junk it up, mess it up, mess you up, and they did.\"\n\nTIP-INS\n\nPacers: Indiana is now 14-10 without guard Victor Oladipo this season. He ruptured a quad tendon in his right knee Jan. 23 and is out for the season.\n\nPistons: Luke Kennard scored 19 points. He and Griffin made five 3-pointers apiece.\n\nUP NEXT\n\nPacers: At Dallas on Wednesday night.\n\nPistons: At San Antonio on Wednesday night.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994669.9738612
}