{
  "game_id": "0022000781",
  "espn_id": "401307574",
  "date": "Apr 07, 2021",
  "matchup": "OKC vs. CHA",
  "headline": "McDaniels has career-high 21 points, Hornets beat Thunder",
  "body": "OKLAHOMA CITY -- — Jalen McDaniels had a career-high 21 points in his second career start to help the Charlotte Hornets beat the Oklahoma City Thunder 113-102 on Wednesday night.\n\n\r\n                    McDaniels also had six rebounds and three assists. Terry Rozier scored 17 points, Miles Bridges had 16 and Devonte’ Garaham and Cody Zeller added 15 each, and Zeller had 14 rebounds.\n\n\r\n                    Aleksej Pokusevski led the Thunder with a career-high 25 points behind a franchise rookie-record seven 3-pointers. Theo Maledon also had 25 points.\n\n\r\n                    Charlotte’s 11-point victory followed its most lopsided loss of the season, a 116-86 drubbing to the Boston Celtics on Sunday.\n\n\r\n                    The Hornets held the Thunder scoreless for nearly the first four minutes, jumping out to an 8-0 lead and briefly took a 10-point advantage in the opening frame. The early surge prompted Oklahoma City to call a timeout and collected itself to outscore the Hornets 21-14 in the final 5:47 of the period.\n\n\r\n                    The emergence of McDaniels, whose played in just 26 of Charlotte’s 50 games, was much needed as he fills in for the injured Gordon Hayward, who suffered a right foot sprain last Friday.\n\n\r\n                    “Really proud of Jalen,” Charlotte coach James Borrego said. “To go from not playing basically all season to stepping into this moment right now, it just speaks to his character and his mindset. The staff, they kept him ready and now it’s just about building on this effort.”\n\n\r\n                    Stabilized by Pokusevski’s career night from beyond the arc, the Thunder pulled ahead of the Hornets in the second quarter.\n\n\r\n                    “He was a major problem tonight,” Borrego said of Pokusevski, who left the game in the fourth with a hip injury. \n\n\r\n                    “When he’s making shots like that, it’s very difficult, because he’s got that high release, gets it off pretty quick. He can put it on the floor and move around in different schemes, so, a fantastic young player. He’s gonna be a handful for years to come.”\n\n\r\n                    A difficult defensive night from Oklahoma City, especially in the interior, led to Charlotte regaining control and taking a 56-51 lead at the break.\n\n\r\n                    McDaniels, who made 6 of 9 shots from the floor in the second half, helped the Hornets maintain their lead and pick up their third victory of a six-game road swing.\n\n\r\n                    The Thunder have lost four straight to start the month of April but showed more fight after losing back-to-back games by at least 24 points entering Wednesday night.\n\n\r\n                    “After a tough stretch of games, we got back on track competitively,” Thunder coach Mark Daigneault said. “I thought we really competed for 48 minutes, and I thought we really pulled together and played together. We tried to solve problems together. I just thought they were the better team.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Along with Hayward, LaMelo Ball (right wrist) and Malik Monk (right ankle) were unavailable. … Charlotte improved to 13-15 on the road. … The Hornets scored 22 second-chance points to the Thunder’s four. … Borrego earned his 88th win as Charlotte’s head coach, moving him into a tie with Larry Brown for the fifth most wins in franchise history. \n\n\r\n                    Thunder: Darius Bazley (left shoulder), Luguentz Dort (concussion protocol), Shai Gilgeous-Alexander (right foot), Josh Hall (concussion protocol), Mike Muscala (right ankle) and Isaiah Roby (concussion protocol) missed Tuesday’s game. … Moses Brown had a team-high 10 rebounds.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: At Milwaukee on Friday night.\n\n\r\n                    Thunder: Host Cleveland on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764997077.697802
}