{
  "game_id": "0021800937",
  "espn_id": "401071610",
  "date": "Mar 02, 2019",
  "matchup": "MIA vs. BKN",
  "headline": "Heat run away from Nets, win 117-88",
  "body": "MIAMI --  Getting big leads hasn't been a problem lately for the Miami Heat. Keeping them, however, has been an enormous issue.\n\nThat is, until Saturday.\n\nKelly Olynyk scored 25 points, Derrick Jones Jr. added 18 off the bench and the Heat never trailed on the way to easily topping the Brooklyn Nets 117-88.\n\n\"We needed that. We needed to keep that lead,\" Heat guard Dwyane Wade said. \"Obviously, at this time of the year everyone has games coming rapidly. You don't always want to be in a fourth-quarter battle.\"\n\nRodney McGruder scored 17, Justise Winslow added 13 points and Josh Richardson added 12 for the Heat. Bam Adebayo grabbed 16 rebounds for Miami -- giving him three more than the entire Brooklyn starting lineup had combined.\n\nThe Heat were without Goran Dragic (left calf strain) and Hassan Whiteside (left hip strain). James Johnson, who has been out with a sprained shoulder, was in uniform but did not play.\n\n\"We haven't had many games like this all year,\" Heat coach Erik Spoelstra said.\n\nActually, none. The 29-point margin was Miami's largest win of the season, and Brooklyn's largest loss. Brooklyn remained No. 6 in the Eastern Conference race, percentage points ahead of No. 7 Detroit. Miami remained No. 10 in the East, a game behind No. 8 Orlando and No. 9 Charlotte.\n\n\"Tonight we were searching for everything -- offense, defense, rebounding, just Miami was unbelievable,\" Nets coach Kenny Atkinson said. \"Give them a lot of credit. I think they dominated us in every fashion.\"\n\nJoe Harris scored 15 and Rodions Kurucs scored 11 for Brooklyn, which has dropped 10 of its last 15 games. D'Angelo Russell and Spencer Dinwiddie each scored 10 for the Nets.\n\nIt's the first time Miami has won back-to-back home games since Jan. 10 and 12. The Heat haven't had a three-game home winning streak this season.\n\nMiami led 54-44 at the half, and pushed the lead out to 20 for the first time with about 4 minutes left in the third when Jones muscled in a left-handed layup.\n\nAnd this time, a big lead wasn't problematic.\n\nThe Heat wasted double-digit leads in each of their last four games before Saturday -- 11 in what became a blowout loss to Detroit, 13 in a close loss to Phoenix, 24 against Golden State (the game where Wade hit the miracle buzzer-beater for the win) and 21 on Thursday in a loss to Houston.\n\nBut this time, they finished the job. The lead was 84-64 going into the fourth, and it stayed one-sided the rest of the way.\n\n\"They had more intensity,\" Brooklyn's Caris LeVert said. \"They played a lot better defense than we did. Our defense, again, wasn't up to par and it definitely showed in the score, the stat sheet, and just watching the game as well.\"\n\nTIP-INS\n\nNets: Brooklyn left a game below the .500 mark for the first time since Jan. 14, when it was 22-23. ... The Nets had won each of their last three games in Miami. ... It's been a season of wild swings for the Nets -- they started 8-18, then went 19-5, and are 5-10 since.\n\nHeat: This game started a stretch during which Miami will play seven of eight at home. ... Wade was a very rare 0 for 6 in the first quarter -- the third-worst opening-period shooting effort of his career. He was 0 for 7 twice, once in 2006 and once in 2016, and finished with nine points after making four of his final five shots. ... Udonis Haslem got first-quarter minutes at home for the first time since Dec. 22, 2017.\n\nWADE BLOCKADE\n\nWade has 1,050 blocked shots in his career -- counting regular-season and playoff games. That has him one shy of matching Michael Jordan's all-time block mark for guards. Jordan still has the regular-season record of 893, with Wade at 875 when not factoring in postseason games. Wade has the playoff-record for guards, at 175.\n\nEAST MESS\n\nThe gap in the East standings between No. 6 Brooklyn and No. 10 Miami is now down to just 2 1/2 games.\n\nUP NEXT\n\nNets: Host Dallas on Monday. Brooklyn has lost five of seven to the Mavericks.\n\nHeat: Host Atlanta on Monday. Miami is 0-3 against the Hawks this season.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995226.903691
}