{
  "game_id": "0021800486",
  "espn_id": "401071167",
  "date": "Dec 23, 2018",
  "matchup": "DET vs. ATL",
  "headline": "Alex Len, Vince Carter lift Hawks over Pistons 98-95",
  "body": "DETROIT --  The Detroit Pistons thought they had the right big guy on the line.\n\nWith 23 seconds left and trailing the Atlanta Hawks by a point, it was Blake Griffin with two free throws instead of Andre Drummond, one of the worst free-throw shooters in league history.\n\nGriffin missed both shots, and the Hawks held on for a 98-95 victory Sunday.\n\n\"I have to be better than that,\" he said. \"We fought back to give ourselves a chance to win the game, and I missed the shots.\"\n\nThe Hawks led by as many as 17 before Detroit's late rally and won their third straight to improve to 9-23. Alex Len had 15 points and a season-high 17 rebounds, while Vince Carter scored a season-best 18.\n\nAtlanta was playing without leading scorer John Collins because of an ankle injury.\n\n\"We were missing John tonight, so we had a unique opportunity to start two centers in Dewayne (Dedmon) and Alex,\" Hawks coach Lloyd Pierce said. \"Alex embraced it and took advantage of it.\"\n\nFacing Drummond, one of the best rebounders in the league, Len had eight offensive boards and held Drummond to two.\n\n\"Blake and Andre both had a lot of missed shots, and we were able to grab them and score on our own misses,\" Len said. \"I think our defense really kept us in the game.\"\n\nDetroit has lost nine of 11. Langston Galloway led the Pistons with 18, and Drummond had 13 points and 15 rebounds.\n\n\"We talked before the game about having to have a good approach in a game like this, playing just before Christmas against a team with a bad record,\" Pistons coach Dwane Casey said. \"We had that attitude in the fourth quarter, but you can't win a game by playing one quarter.\"\n\nAfter Griffin's misses, Jeremy Lin hit two foul shots to stretch the lead, Reggie Jackson dunked for the Pistons, and Lin hit two more free throws to make it 96-93. Galloway missed a layup, and the Hawks locked it up from the line.\n\nCarter had 14 points in the first half while Atlanta led by as many as 17.\n\n\"The OG, Vince Carter, put down the walker,\" Dedmon said. \"He dropped it and had a big game. So did Alex, because we needed people to step up and replace John.\"\n\nA late 3-pointer by Griffin helped the Pistons to narrow the margin to 57-43 at the break. Atlanta outshot Detroit 51.3 percent to 43.9 percent and got 13 points off 11 turnovers.\n\n\"We're trying to get out of this slump, but we have to have more energy,\" Galloway said. \"We can't only play hard in the fourth.\"\n\nThe Pistons got within nine early in the third, but back-to-back tip-ins by Len kept the Hawks comfortably ahead.\n\nGalloway hit back-to-back 3-pointers to pull the Pistons within 83-75 with 8:55 to play. He was the only Piston to score in the first 6:16 of the quarter, but his 14 points narrowed the gap to 85-80.\n\nZaza Pachulia's tip made it 88-85 with 3:17 left, and two free throws by Griffin got the Pistons within one.\n\nCarter answered with a fall-away basket, but Galloway scored over Len to make it 90-89. After misses on both ends, Lin's reverse layup put the Hawks up three with 1:22 to play.\n\nJackson's free throws cut the lead to 92-91 and Pachulia stole the ball from Lin, but Griffin couldn't hit the ensuing shots from the line.\n\nTIP-INS\n\nHawks: Len was only the ninth player to have eight or more offensive rebounds against the Pistons in the past five seasons. ... The Hawks had lost six of eight to Detroit but posted their first victory at Little Caesars Arena.\n\nPistons: Detroit is third in the NBA in offensive rebounds, mostly thanks to Drummond, but only had five to Atlanta's 15 on Sunday. ... Luke Kennard started at small forward but sat out the second half with both knees wrapped in ice.\n\nUP NEXT\n\nHawks: At Indiana on Wednesday.\n\nPistons: Host Washington on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994701.9902751
}