{
  "game_id": "0022400039",
  "espn_id": "401703408",
  "date": "Nov 26, 2024",
  "matchup": "LAL @ PHX",
  "headline": "Bradley Beal, Kevin Durant both return from injury, lead the Suns past the Lakers 127-100",
  "body": "PHOENIX -- — Bradley Beal and Kevin Durant each scored 23 points and the Phoenix Suns celebrated the healthy return of both players with a 127-100 win over the Los Angeles Lakers on Tuesday night.\n\n\r\n              Devin Booker led the way with 26 points and had 10 assists as the Suns snapped a five-game losing streak.\n\n\r\n              Beal had missed the past five games while Durant had missed seven in a row — both players were sidelined by a strained left calf.\n\n\r\n              Beal made 10 of 15 shots, including 3 of 6 from 3-point range. \n\n\r\n              The Lakers were led by Anthony Davis, who scored 25 points and grabbed 15 rebounds. LeBron James added 18 points, eight rebounds and 10 assists. Los Angeles has lost three straight.\n\n\r\n              The Suns outscored the Lakers 36-18 in the third quarter, turning a tight game into a 98-78 advantage. Booker had 11 points during the run while Jusuf Nurkic had 10.\n\n\r\n              Takeaways\r\n              Lakers: Los Angeles held its own throughout the first half, but went cold after the break. The Lakers made just 8 of 34 (23.5%) from beyond the 3-point arc. D'Angelo Russell scored 16 points while Austin Reaves had 15.\n\n\r\n              Suns: Phoenix looked more like its former self with Durant and Beal back on the court. Nurkic recovered from a rough start to finish with 12 points and 12 rebounds. Grayson Allen added 10 points off the bench while Royce O'Neale added nine on three 3-pointers, which came as the Suns built their second-half lead.\n\n\r\n              Key moment\r\n              Booker made three consecutive shots during the Suns' 14-2 run midway through the third quarter, helping push the lead to 86-72.\n\n\r\n              Key stat\r\n              The Suns are 9-1 when Durant is in the lineup and 1-6 when he's not.\n\n\r\n              Up Next\r\n              The Suns host the Nets on Wednesday night. The Lakers are on the road against the Spurs on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997207.081228
}