{
  "game_id": "0022400139",
  "espn_id": "401704705",
  "date": "Nov 01, 2024",
  "matchup": "MIN vs. DEN",
  "headline": "Anthony Edwards scores go-ahead basket, Timberwolves top Nuggets in 119-116 thriller",
  "body": "MINNEAPOLIS -- — Anthony Edwards hit a go-ahead 7-foot floater with 25.7 seconds left, and Rudy Gobert iced the game with two free throws to lead the Minnesota Timberwolves past the Denver Nuggets 119-116 on Friday night.\n\n\r\n              Edwards scored 29 points, Gobert had 17 points and 14 rebounds and Julius Randle added 23 points and seven assists for the Timberwolves, who recovered from a 25-3 fourth-quarter run by the Nuggets.\n\n\r\n              Nikola Jokic had 26 points, 13 assists and nine rebounds and hit two free throws with 2:30 left to put Denver up 116-109, before Minnesota roared back. Jokic had a chance to tie the game at 119, but Gobert forced an errant corner 3-pointer with 2.3 seconds to go. \n\n\r\n              Gordon led the Nuggets with 31 points and 11 rebounds in a rematch of last season's Western Conference semifinal.\n\n\r\n              Michael Porter Jr. added 26 points for the Nuggets, who lost point guard Jamal Murray to the concussion protocol in the third quarter after colliding with Randle.\n\n\r\n              Takeaways\r\n              Nuggets: Lightening some of the load that's on the three-time NBA MVP Jokic will be a key to keeping their window for championship contention open, and Gordon and Porter did their part. But the lack of depth is a concern. Their bench was outscored 31-13.\n\n\r\n              Timberwolves: After leading the league in defense last season, they've sprung some leaks, particularly in transition. The Nuggets had 22 fast-break points.\n\n\r\n              Key moment\r\n              \r\n              Braun dunked over the 7-foot-2 Gobert with 5:14 left and got even closer to his face with a taunting scream that egged Gobert into grabbing Braun by the neck. The benches cleared, shouts were exchanged, and both players got a technical.\n\n\r\n              Key stat\r\n              Gordon had his second-highest scoring total in four-plus seasons with the Nuggets. He shot 11 for 18.\n\n\r\n              Up next\r\n              The Nuggets host Utah on Saturday. while the Timberwolves play at San Antonio on the same day.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998113.22058
}