{
  "game_id": "0021500264",
  "espn_id": "400828151",
  "date": "Dec 01, 2015",
  "matchup": "PHX @ BKN",
  "headline": "Nets beat Suns 94-91 for 4th straight home victory",
  "body": "NEW YORK --  The Brooklyn Nets had a rough road to start, though they knew their schedule would have them largely home for the holidays.\n\nSo far, they are taking advantage of it.\n\nBrook Lopez scored 23 points and the Nets beat the Phoenix Suns 94-91 on Tuesday night for their fourth straight home victory.\n\nBrooklyn started 0-7 with a road-heavy November. The Nets have played just seven home games, but will play a combined 20 times here in December and January, most in the NBA.\n\n\"We started off I think every single weekend on the road somewhere,\" guard Shane Larkin said.\n\nThey won two in a row here -- their first consecutive victories all season -- and after a short trip to face the Knicks on Friday, open a six-game homestand Sunday against Golden State as part of a steady diet of home games.\n\n\"Win a bunch of those games, just keep playing hard, take it one game at a time and just see what we can do,\" Larkin added.\n\nLarkin and fellow reserve Wayne Ellington each had 11 points and both made a basket in the decisive flurry. Jarrett Jack also scored 11 and added eight assists.\n\n\"We're just starting to put some things together,\" Jack said.\n\nBrandon Knight scored 26 points and Eric Bledsoe had 17 for the Suns, who had a long dry spell from the field in the fourth quarter after leading by nine earlier in the period. They botched their final possession trailing by three with 4 seconds remaining.\n\nThe Suns fell to 1-1 on their six-game road trip.\n\n\"We gave up I think a nine- or 10-point lead,\" Knight said. \"We were up in the third, second half. We just stopped getting stops and they executed down the stretch, got the stops they wanted and they played better to close the game.\"\n\nLarkin broke an 85-all tie with a drive to the basket with 4:08 left, Ellington added a layup in transition and Lopez made a free throw for a 90-85 advantage. Alex Len missed from close range with the Suns down three, and after they got the ball back a final time, they couldn't even get a shot off after inbounding in the frontcourt.\n\nThe Nets led by 11 at halftime before Knight led the Suns on a 16-2 spurt in the third that gave them a 62-56 advantage. Bledsoe beat the buzzer with a 3-pointer to send Phoenix to the fourth leading 73-70.\n\nTIP-INS\n\nSuns: Tyson Chandler missed his second straight game after straining his right hamstring against Golden State on Friday. ... Mirza Teletovic scored 12 in his return to Brooklyn, where he played the previous three seasons. Suns coach Jeff Hornacek said the forward from Bosnia has been playing better after a slow start following a preseason illness that hindered his conditioning.\n\nNets: Reserve Andrea Bargnani sat out with a left hamstring injury. Coach Lionel Hollins said he had no timetable for the Italian center, who was hurt Sunday against Detroit. ... Starting forward Thaddeus Young shot 3 of 14, though he made a jumper with 1:03 left to put the Nets up five.\n\nSLIP SLIDING AWAY\n\nTeletovic slipped on the final possession, and both he and Hornacek indicated there were problems with the court.\n\n\"Guys looked like they were slipping all night,\" Hornacek said. \"Eric slipped several times. P.J. (Tucker) slipped on a baseline once.\"\n\nBOXERS AT BARCLAYS\n\nBoxers Daniel Jacobs and Peter \"Kid Chocolate\" Quillin announced the Nets' starting lineups. They face each other Saturday at Barclays Center in a middleweight championship bout. Retired champion Floyd Mayweather, who is friends with Bledsoe, watched from a courtside seat and laughed when he was shown on the overhead videoboard and booed.\n\nFILL THE SEATS\n\nThe announced attendance was 12,787, the fourth time this season the Nets couldn't even draw 13,000 at home, and Lopez is hoping some wins on the court will win them more fans.\n\n\"I think hopefully we'll see the environment continue to grow and turn in our favor if we continue to be successful on our home court, because it's going to be a huge advantage for us down the stretch,\" he said.\n\nUP NEXT\n\nSuns: At Detroit on Wednesday.\n\nNets: At New York on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994876.781446
}