{
  "game_id": "0021600533",
  "espn_id": "400899954",
  "date": "Jan 04, 2017",
  "matchup": "MEM @ LAC",
  "headline": "Clippers rally behind Rivers to beat Grizzlies 115-106",
  "body": "LOS ANGELES --  Usually coach Doc Rivers replaces his son at a certain point in the game. Austin Rivers wouldn't let him.\n\nThe younger Rivers scored a season-high 28 points while playing a game-high 44 minutes and helped rally the Los Angeles Clippers from a 12-point deficit in the third quarter to beat the Memphis Grizzlies 115-106 on Wednesday night for their second win in a row.\n\n\"We couldn't take him out. He was rolling and we needed points,\" the elder Rivers said. \"As Raymond (Felton) said, `He's the 24-year-old out here.\"\n\nJamal Crawford added 22 points off the bench and DeAndre Jordan had 18 points and 20 rebounds for the Clippers, who improved to 4-9 in the regular season without Blake Griffin and Chris Paul. Both injured stars watched from the bench; Paul could return from a sore hamstring this week.\n\n\"When these guys come back, we will be whole again,\" Crawford said. \"Other guys have gotten confident; they have gotten a better rhythm. It will be to our advantage.\"\n\nMarc Gasol scored 23 points and Mike Conley had 17 points and a season-high 12 assists for the Grizzlies.\n\n\"When they get going it's hard to stop them,\" Gasol said. \"We had too many defensive breakdowns and we got beat off the dribble too much.\"\n\nMemphis closed to 97-96 with seven straight points in the fourth. Jordan missed a pair of free throws but got bailed out by Crawford's 3-pointer that kept the Clippers ahead, 100-96.\n\nThe Grizzlies were limited to two field goals in the final 4:19. They have lost four of six.\n\nThe Clippers snapped a six-game skid Monday against Phoenix but they were in a close game early against the Grizzlies and fell into a 13-point hole in the second quarter.\n\nMemphis led by 12 early in the third before the Clippers engineered a dramatic turnaround. They ran off 11 consecutive points, including seven by J.J. Redick, to close to 73-70.\n\nRedick finished with 19 points.\n\nFrom there, Austin Rivers took over. He scored seven in a row before Jordan's three-point play on a dunk and free throw. Crawford had seven of the Clippers' final nine points to give them an 89-85 lead heading into the fourth.\n\nRedick scored 10 points during the spurt, which brought the crowd back into the game.\n\n\"We needed to have a little bit more fight, more aggression,\" Jordan said. \"We were attacking and when we do that, we're pretty good.\"\n\nMemphis built a 13-point lead in the second when the Grizzlies closed on a 26-13 run for a 63-53 halftime lead. Four players hit 3-pointers in that span.\n\nTIP-INS\n\nGrizzlies: C Deyonta Davis (left foot), F JaMychal Green (maxilla fracture), G Chandler Parsons (rest) and F-C Brandan Wright (left ankle) sat out, leaving the Memphis bench thin. Green sustained his facial injury against the Lakers a night earlier.\n\nClippers: Paul had a full workout and went up and down the court during practice. Doc Rivers said if Paul doesn't have any soreness on Thursday he could return Friday at Sacramento. ... Jordan had 20 rebounds for the second straight game. ... Rookie F Brice Johnson (acute herniated disk in lower back) also played at practice and was moving well.\n\nBIG BOARDS\n\nJordan grabbed at least 20 rebounds for the fifth time this season, most in the NBA. He has 35 such games in his career, good for second among active players behind Dwight Howard (72). Jordan is tied with Shaquille O'Neal for 10th overall since 1983-84.\n\nCROWD NOISE\n\nClipper Darrell, the team's longtime super fan, got the attention of Vince Carter when he did his \"you're ugly\" chant as James Ennis III was at the free throw line in the second quarter.\n\nCarter turned and stared at Darrell, pointed and shook his head.\n\nLater, Darrell shouted, \"Hey Vince, I love you,\" before Carter missed two free throws.\n\n\"We're friends,\" Carter said. \"I was just giving him some play.\"\n\nUP NEXT\n\nGrizzlies: Visit Golden State on Friday to conclude a four-game trip out West. They beat the Warriors 110-89 at home on Dec. 10.\n\nClippers: Visit Sacramento on Friday in their only road game during a seven-game home stretch.",
  "source": "espn_api",
  "crawled_at": 1764995605.893986
}