{
  "game_id": "0021900517",
  "espn_id": "401161159",
  "date": "Jan 03, 2020",
  "matchup": "ATL @ BOS",
  "headline": "Celtics survive 18-point deficit in 1st, beat Hawks 109-106",
  "body": "BOSTON --  Daniel Theis had already seen Trae Young make five 3-pointers -- a few from more than 30 feet away -- so he could pretty much figure out what the Atlanta Hawks guard was thinking in the final seconds of a two-point game.\n\n\"As soon as I switched on him, I knew he wanted to take the 3 to win the game,\" the Celtics center said. \"He probably would've beat me for a layup, but I think he just wanted the game-winner. That's why I said I just tried to take away the shot, and at the end I was right there to block it.\"\n\nYoung had 28 points and 10 assists, but Theis blocked his step-back 3-point attempt with 3 seconds left and Boston recovered from an 18-point, first-quarter deficit against the NBA's worst team to win 109-106 on Friday night.\n\n\"That's a big-time basketball play,\" Celtics coach Brad Stevens said. \"It sounds easy when we all sit here and talk about it, but in the throes of the game and knowing that Trae is capable of getting to the rim on anybody, that's a huge, huge play.\"\n\nJaylen Brown had 24 points and 10 rebounds for Boston. Marcus Smart started in place of the flu-ridden Kemba Walker and scored 15 points, adding nine assists and hitting a 3-pointer that gave Boston a four-point lead with 43 seconds left.\n\nAnd then he gloated about it to the Atlanta bench.\n\n\"I just told them to keep leaving me open,\" said Smart, who also grabbed the rebound after Young's last-second miss, got tripped up trying to step over Young's prone body and then got into a shoving match over it with Hawks center Alex Len.\n\nSmart and Alex Len were given matching technical fouls, then Smart made one of two free throws with 0.3 seconds left to ice the game.\n\nAtlanta coach Lloyd Pierce said he wasn't surprised to see Smart taking the key shot.\n\n\"Marcus Smart is a playmaker and that's not out of the realm of what he does,\" said Pierce, who was an assistant coach on the U.S. team that included Smart at last summer's World Cup. \"That's actually what they're looking for. He's looking for the moment, they're looking for him and they expect him to make those type of plays.\"\n\nGordon Hayward scored 18, and Enes Kanter had 14 points and 11 rebounds for Boston, which has won seven of eight.\n\nEARLY LEADS\n\nThe Hawks beat Orlando on Monday to snap a 10-game losing streak that left them with the worst record in the NBA. They opened a 29-11 lead against Boston in the first quarter, when John Collins had nine points and six rebounds. The Celtics erased almost all of it by halftime, scoring the last five points of the first quarter and the first six of the second before heading into the break trailing only 55-53.\n\nHayward hit a 3-pointer at the end of the third quarter to give Boston an 82-80 lead. The Hawks never led again, though they had a half-dozen chances to do so in the final minutes.\n\n\"They came out playing fast. They came out playing aggressive. They came out playing free,\" Brown said. \"Shout-out to those guys. They probably deserved to win, but we pulled it out.\"\n\nOUT OF ACTION\n\nWalker was ruled out in the morning with the flu. Collins left the game after colliding with Jayson Tatum trying to block his dunk. Both players were slow to get up, but Tatum remained in the game and Collins was ruled out with a back bruise.\n\nHawks guard Vince Carter did not play. In his next game, he will become the first person in NBA history to play in four decades. Carter, who turns 43 this month, made his debut with Toronto in 1999.\n\n\"He and Tom Brady are in a race for years and years to come,\" Stevens, who is only three months older than Carter, said before the game. \"I know how I feel after a whole day of playing half-court basketball, and I can't imagine doing it at his age.\"\n\nUP NEXT\n\nHawks: Host Indiana on Saturday night.\n\nCeltics: Visit the Chicago Bulls on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996688.355954
}