{
  "game_id": "0022200995",
  "espn_id": "401469150",
  "date": "Mar 09, 2023",
  "matchup": "MIL vs. BKN",
  "headline": "Lopez comes up big, Bucks edge short-handed Nets 118-113",
  "body": "MILWAUKEE -- — Brook Lopez had 24 points, 10 rebounds and a career-high nine blocks and the Milwaukee Bucks outlasted the short-handed Brooklyn Nets 118-113 on Thursday night.\n\n\r\n              The nine blocks are most by an NBA player this season. \n\n\r\n              “It was a close game, and he made the plays that made the difference down the stretch,\" Bucks coach Mike Budenholzer said.\n\n\r\n              Bobby Portis added a season-high 28 points to go along with 13 rebounds to \n\n\r\n              help the NBA-leading Bucks win for the 19th time in 20 games.\n\n\r\n              The Bucks were missing two-time MVP Giannis Antetokounmpo for a second straight game. Antetokounmpo didn't play due to a sore right hand after sitting out a 134-123 victory at Orlando on Tuesday night because of a non-COVID illness.\n\n\r\n              Brooklyn's injury situation was worse.\n\n\r\n              The Nets didn't have Nic Claxton (right thumb sprain/left Achilles tendinopathy), Spencer Dinwiddie (rest), Cam Johnson (right knee soreness), Royce O'Neale (left knee soreness) and Ben Simmons (left back/knee soreness).\n\n\r\n              Mikal Bridges and Dorian Finney-Smith were the only Nets available who started in their 118-96 victory at Houston two nights earlier. Neither of them played more than 12 minutes as Nets coach Jacque Vaughn opted to limit their workloads.\n\n\r\n              The Nets still made this one competitive, clawing back after the Bucks went 12 of 21 from 3-point range in the first 15 minutes to take a 46-24 lead.\n\n\r\n              “We picked up the energy,\" said Cam Thomas, who scored 21 for Brooklyn. “We started getting on the glass and getting stops. That was the main key -- getting stops, getting down and running and playing faster.”\n\n\r\n              Patty Mills led Brooklyn with 23 points. The Nets also got big contributions from Dru Smith and David Duke Jr., who are both on two-way contracts that shuttle them between Brooklyn and the NBA G League.\n\n\r\n              Smith had 17 points in his 10th career NBA game. His previous scoring high was five. Duke had a career-high 13 points.\n\n\r\n              Brooklyn trailed 99-97 and appeared to have a chance to tie it after officials ruled Lopez fouled Day’Ron Sharpe on a dunk attempt with 4:31 left.\n\n\r\n              But the Bucks challenged the call, and replays determined it was a clean block. Portis scored 15 seconds later to start an 8-2 run that extended the Bucks’ advantage to 107-99 with 2 1/2 minutes left.\n\n\r\n              “Great job by the arena, the guys in house putting it up on the board, because our bench didn’t have a great angle,” Budenholzer said. “It looked — obviously, it was successful so I feel fortunate — but it looked like it was clean up top. It looked like Brook went up and got all ball.”\n\n\r\n              Brooklyn cut it to 112-110 on Thomas’ driving layup with 46.7 seconds left, but Lopez delivered a putback of Jrue Holiday’s missed 3-point attempt with 30.6 seconds remaining.\n\n\r\n              Lopez then blocked Duke's driving layup attempt to set up Jevon Carter's basket with 16.1 seconds remaining. \n\n\r\n              “Brooklyn was out there shooting the ball,” Lopez said. “They were doing a great job shooting the ball, and so just in that last possession or those last couple possessions, they were doing a great job of sending those guys downhill. When they kind of give them that one option, I’m able to make the read and time it. If he’s going downhill with a full head of steam, I can time that pretty simply to get there at the right time.”\n\n\r\n              Mills made a 3-pointer with 13 seconds left before the Bucks sealed the victory with a pair of free throws from Grayson Allen, who had 19 points.\n\n\r\n              TIP-INS\n\n\r\n              Nets: Nerlens Noel was in the starting lineup in just his second game with the Nets. He signed a 10-day contract Monday. The Nets also started Bridges, Finney-Smith, Joe Harris and Seth Curry. ... They opened the second half with Duke, Mills, Sharpe, Smith and Thomas on the floor. \n\n\r\n              Bucks: Lopez spent his first nine NBA seasons with the Nets. ... Carter shot 2 of 12 and had just five points. He had scored at least 20 points in each of his last two games. ... Wesley Matthews missed an eighth straight game with a strained right calf.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Minnesota on Friday night.\n\n\r\n              Bucks: At Golden State on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995025.041693
}