{
  "game_id": "0021700371",
  "espn_id": "400975122",
  "date": "Dec 08, 2017",
  "matchup": "MEM vs. TOR",
  "headline": "Raptors use 4th-quarter surge to beat Grizzlies 116-107",
  "body": "MEMPHIS, Tenn. --  Toronto finally got untracked enough for a good start to a four-game trip.\n\nDespite trailing by 17 in the first half, the Raptors worked through their problems, upped their game after intermission and pulled away from Memphis for a 116-107 victory Friday night.\n\n\"I think we were more frustrated with ourselves that we let ourselves get down 17 points,\" said guard DeMar DeRozan, who led the Raptors with 26 points. \"It kind of made the job harder on ourselves. It was on us to play great basketball the rest of the game.\"\n\nThe Raptors, who have stops in Sacramento, Los Angeles against the Clippers and Phoenix in the next six days, pulled within five at halftime, trailed by one after three, then outscored the Grizzlies 24-14 down the stretch.\n\n\"The middle of the third quarter is when we made our move because we started off the (second) half a little stiff,\" Raptors coach Dwane Casey said, adding: \"But with the first half, we have to get our motor going earlier and not allow teams to jump on us like that.\"\n\nSerge Ibaka matched his season high with 21 points, Kyle Lowry added 16 points and eight assists, and Fred VanVleet had 12 points to help the Raptors win their fifth straight.\n\nFor Memphis, its play continues to be uneven. After shooting 74 percent in the first quarter, the Grizzlies returned to reality, shooting 43 percent the rest of the game. Seventeen turnovers contributed to the Grizzlies troubles as they lost for the 13th time in the last 14.\n\n\"Defensively, for us, you can't give (Toronto) 41 fast break points,\" Memphis interim coach J. B. Bickerstaff said. \"That's where they thrive, in the open court.\n\n\"You allow these guys to get out and play freely like they did, they're hard to beat.\"\n\nTyreke Evans led the Grizzlies with 27 points, Marc Gasol had 20, and Chandler Parsons 15.\n\nBlowing a big lead and having only one win since Nov. 7 frustrated Memphis. The Grizzlies were still within single-digits when Gasol drew a technical with 4:01 left. Then Evans got one with just under 2 minutes to go.\n\n\"We're not in a position to have those mental errors,\" Bickerstaff said. \"We need two points as bad as anyone right now.\"\n\nTIP-INS\n\nRaptors: Have scored at least 100 points in 11 straight games. ... C.J. Miles missed all four of his shots from outside the arc, ending his string of 11 straight games with a 3-pointer. ... Ibaka has at least one block in the last 12 games. ...Toronto has won seven of the last nine in the series.\n\nGrizzlies: Memphis announced Friday that the team has hired Greg Buckner as an assistant coach. Buckner, who finished his 10-year NBA career in 2009 with the Grizzlies, fills the vacant spot on the staff that resulted from Bickerstaff taking over for David Fizdale, who was fired Nov. 27. ... The Raptors are one of only two NBA teams over which the Grizzlies have an all-time, better-then-.500 record. The Washington Wizards are the other. ... Memphis is 0-8 against the Eastern Conference.\n\nTURNING POINT\n\nMemphis was rolling in the second quarter, building a 17-point lead. The Grizzlies were still up 13, when Mario Chalmers got a steal and passed the ball ahead to a streaking Ben McLemore. With the crowd rising, McLemore went for a 360-degree dunk -- and clanged it off the back of the rim. The Raptors went on a 15-5 run after that. \"Ben has made that play probably a hundred times in his career,\" Bickerstaff said. \"But that this moment, everything needs to be certain. VanVleet said: \"If he makes it -- whatever -- it's a cool highlight. But it's one of those things you don't want to do in a game. He might do it again, but he'll probably think twice.\"\n\nUP NEXT\n\nRaptors: Continue a four-game trip, traveling to Sacramento to face the Kings on Sunday.\n\nGrizzlies: Enjoy a home back-to-back, facing the Oklahoma City Thunder on Saturday.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992783.577426
}