{
  "game_id": "0021800315",
  "espn_id": "401070996",
  "date": "Nov 28, 2018",
  "matchup": "PHX @ LAC",
  "headline": "Clippers extend home winning streak to 9 by beating Suns",
  "body": "LOS ANGELES --  Nearly a quarter of the way into their season, Danilo Gallinari and the Los Angeles Clippers are the surprise leaders in the Western Conference.\n\nGallinari was one of three Clippers to record a double-double as they won their ninth straight home game, defeating the Phoenix Suns 115-99 on Wednesday night.\n\nLos Angeles improved to 14-6, which ties the fourth-best record after 20 games in franchise history. Along with being the surprise leaders in the West, the Clippers own the NBA's longest active home winning streak and have won 10 of their last 12 overall.\n\n\"We have a lot of confidence. We know what we can do,\" said Gallinari, who matched his season high with 28 points and grabbed a season-best 10 rebounds. \"We are happy but it is just the beginning. It is such a long marathon that the record we have now doesn't mean anything. It's just November.\"\n\nLou Williams scored 20 points while Tobias Harris (18 points, 10 rebounds) and Boban Marjanovic (12 points, 12 rebounds) also notched double-doubles for the Clippers, who outrebounded the Suns 56-34 but committed 21 turnovers.\n\n\"It was not a great night except for winning the game,\" coach Doc Rivers said. \"It was one of those games where we didn't execute well. You're going to have games like this but when you win them, they're forgivable.\"\n\nThe game was tied 49-all at halftime before Los Angeles took control with a 20-4 run over a five-minute stretch in the third quarter to go up 83-63. Gallinari scored 12 of the first 15 points during the run, including a pair of 3-pointers.\n\nLos Angeles was 11 of 17 from the field, including 5 of 7 on 3-pointers. The Clippers also went 13 of 15 from the foul line as they outscored Phoenix 40-25 in the quarter.\n\n\"The third quarter was brutal. We couldn't find the rhythm and the stops. We were taking individual action, which isn't the way to win,\" Suns coach Igor Kokoskov said.\n\nPhoenix, off to the worst start in franchise history at 4-17, pulled to 104-93 on Deandre Ayton's reverse layup with four minutes remaining but could not get any closer.\n\nDevin Booker led the Suns with 23 points and Elie Okobo added 19.\n\nTIP-INS\n\nSuns: T.J. Warren and Josh Jackson each scored 15. ... Ayton, the top pick in this year's NBA draft, had a season-low four points but led the team in rebounds with nine. ... Richaun Holmes came off the bench to score 10 points. ... This was the first time in five games Phoenix did not have the lead going into the fourth quarter. ... The Suns are 0-2 in the second game of back-to-backs. ... G Isaiah Canaan was waived. He appeared in 19 games and averaged 7.5 points and 3.3 assists. Kokoskov said it \"was a business decision but I feel good about his future.\" Canaan began the season as the team's starting point guard before Kokoskov moved Booker to the point and inserted rookie Mikal Bridges into the starting lineup.\n\nClippers: Montrezl Harrell scored 13 of his 18 points in the second half. ... Shai Gilgeous-Alexander had 13 points. ... Los Angeles has won nine straight against the Suns, dating to the start of the 2016-17 season. It is the club's second-longest active winning streak against a single opponent -- the Clippers have won 10 in a row vs. Orlando. ... F Marcin Gortat did not play due to back spasms. ... F Luc Mbah a Moute (sore left knee) and G Jerome Robinson (strained right foot) were inactive.\n\nUP NEXT\n\nSuns: Host Orlando on Friday.\n\nClippers: Play at Sacramento on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995098.5324469
}