{
  "game_id": "0021801145",
  "espn_id": "401071818",
  "date": "Mar 31, 2019",
  "matchup": "MIL @ ATL",
  "headline": "Hawks top Bucks in OT on Young buzzer-beater",
  "body": "ATLANTA -- Trae Young wanted the ball with the game on the line for the Atlanta Hawks.\nForget about that shooting trouble. The rookie star made the most of another opportunity.\nYoung grabbed a deflected inbounds pass and converted a last-second jumper to lift the Hawks to a 136-135 overtime win over the short-handed Milwaukee Bucks on Sunday.\nYoung missed each of his seven second-half shots from the field and his first two shots in the extra period. Even so, he plotted for a chance to grab what he figured would be a deflection on the final play of the game.\n\nJust as Young expected, Milwaukee's Brook Lopez deflected Atlanta's inbounds pass intended for John Collins near the basket. Young grabbed the ball with his left hand and sank the short game-winner.\nA video review confirmed Young got the shot off before the buzzer. The young guard finished with 12 points and 16 assists.\n\"I knew it was probably going to get tipped because Lopez was right there and I knew he was going to try to tip it out,\" Young said.\nLopez credited Young for spoiling his attempt to deflect the ball away from the basket.\n\"I just tried to bat it away,\" Lopez said. \"The kid made a good play.\"\nThe Bucks played without Giannis Antetokounmpo and Khris Middleton due to injuries. Antetokounmpo, one of the favorites for the NBA MVP award, was held out due to right ankle sprain. Middleton has a sore groin.\nCoach Mike Budenholzer also rested Eric Bledsoe, who is averaging 15.8 points and 5.5 assists.\n\"I think it was just a great team effort,\" said Lopez, who had 19 points.\nMilwaukee is three games ahead of idle Toronto in the race for the top spot in the Eastern Conference. The team's magic number is two for securing home-court advantage throughout the playoffs.\nSterling Brown scored a career-high 27 points for Milwaukee, including a go-ahead layup with 1.1 seconds remaining in overtime.\nYoung said his string of second-half misses didn't affect his confidence.\n\"I know I didn't play well as far as shooting, but for me it's all about the next shot,\" he said.\nJustin Anderson set season highs with 24 points and 12 rebounds for Atlanta. Collins finished with 23 points and 12 boards. Alex Len also scored 23 points.\nMilwaukee led by as many as 23 points during a high-scoring first quarter. Atlanta recovered to lead in the third quarter and rallied again after trailing by 10 points midway through the fourth period.\nLen's jam cut the Bucks' lead to 133-132 with 33 seconds remaining in overtime. Following Brown's missed jumper, Young's baseline floater with 6.6 seconds left gave Atlanta a 134-133 lead.\nTIP-INS\nBucks: Tim Frazier had 20 points and 15 assists. He is Milwaukee's first player with at least 20 points and 15 assists since Monta Ellis in 2013. ... Antetokounmpo has missed two games since spraining his ankle on March 17 against Philadelphia. ... Forwards D.J. Wilson and Bonzie Colson each made their first career starts.\nHawks: Vince Carter moved into fifth place in NBA history with 1,477 games played, passing Karl Malone. ... With 42 points in the second quarter, the Hawks set an Atlanta record with 14 quarters with at least 40 points, passing their 13 in the 1968-69 season.\nDEDMON OUT FOR SEASON\nLen, who sank a tying 3-pointer with 19 seconds remaining in regulation, started at center after the Hawks announced Dewayne Dedmon will miss the remainder of the season with a left ankle injury.\nANTETOKOUNMPO'S RETURN\nBudenholzer said \"there's a good chance\" Antetokounmpo could return on the team's road trip, which continues with games at Brooklyn on Monday and Philadelphia on Thursday. He aggravated the ankle injury in the fourth quarter of the Bucks' 128-118 win over the Los Angeles Clippers on Thursday night.\nUP NEXT\nBucks: Try to complete a three-game sweep of their season series with Brooklyn when they visit the Nets on Monday.\nHawks: Visit San Antonio on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994954.195065
}