{
  "game_id": "0021900491",
  "espn_id": "401161133",
  "date": "Dec 30, 2019",
  "matchup": "ATL @ ORL",
  "headline": "Hawks beat Magic to end 10-game skid with Young still out",
  "body": "ORLANDO, Fla. --  The Atlanta Hawks have been the worst team in the NBA this season -- except against the Orlando Magic.\n\nBrandon Goodwin scored 21 points, Kevin Huerter added 19, and the Hawks beat the Magic 101-93 Monday night to end a 10-game skid.\n\nPlaying without injured guard Trae Young for the second straight game, the Hawks trailed by 18 during the first half but rallied back in the third quarter. Alex Len scored eight of his 18 points to fuel a 15-4 run, while Atlanta's defense only yielded six field goals in the quarter.\n\nLen's drive and dunk just before the horn gave the visitors a 74-72 lead.\n\n\"It felt like I was getting fouled on every play and got no calls, but that's the way it goes in this league,\" Len said. \"Maybe I earned some (respect) by playing more aggressively. We don't get respect, but you've got to earn it, and a couple of wins like this will do that.\"\n\nAtlanta improved to 7-27 by snapping its second 10-game losing streak of the season. This one ended with the Hawks' second win in two tries against Orlando.\n\nYoung twisted his ankle in a loss to Milwaukee on Friday. He scored 39 points in a 103-99 win over Orlando in the first meeting between the teams Oct. 26.\n\nAtlanta pulled away Monday near the midpoint of the fourth quarter when Huerter scored nine points during an 11-0 run. The Magic trailed 90-78 but trimmed the deficit to five in the final minutes before John Collins' emphatic transition dunk all but ended the comeback bid.\n\n\"I thought the guys were spirited tonight,\" Atlanta coach Lloyd Pierce said. \"They executed, and the execution came from communication with each other.\"\n\nNikola Vucevic led the Magic with 27 points. Evan Fournier added 22 points, and D.J. Augustin finished with 17 and six assists. Orlando struggled to find any offense down the stretch, scoring only 36 second-half points after scoring 36 in the second quarter alone.\n\n\"We scored at times, but I feel like maybe for the first time this year, we didn't play ball as a team offensively from the get-go, and it just caught up to us,\" Fournier said.\n\nTIP-INS\n\nHawks: Wins have been scarce for Atlanta, but the road has been somewhat more favorable. Three of the Hawks' last four wins have come away from home. They have won only one home game since beating San Antonio on Nov. 5.\n\nMagic: Orlando held an 11-3 record against sub-.500 teams before the loss. ... C Mo Bamba returned after missing the prior two games due to soreness in his right foot. Bamba finished with three points and three rebounds. ... F Wes Iwundu started in place of the injured Aaron Gordon, who was out due to soreness in his left Achilles' tendon. Iwundu had four points and two rebounds in 25 minutes.\n\nCARTER HONORED\n\nThe Magic gave 42-year-old Vince Carter a video tribute during the first quarter. Carter, who grew up in nearby Daytona Beach, stepped out of a team huddle to acknowledge an ovation after the video.\n\nCarter played 97 games for the Magic in 2009-10, averaging 16.3 points. He had four points in 21 minutes Monday.\n\n\"I still live here, and people in the community still come up and say, `Hey, we miss you here,\" Carter said. \"We had a good time here.\"\n\nUP NEXT\n\nHawks: At Boston on Friday night.\n\nMagic: At Washington on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996690.1326132
}