{
  "game_id": "0022200803",
  "espn_id": "401468958",
  "date": "Feb 05, 2023",
  "matchup": "CLE @ IND",
  "headline": "Garland leads hot-shooting Cavs to 122-103 win over Pacers",
  "body": "INDIANAPOLIS -- — Darius Garland scored 24 points, Isaac Okoro added 20 and the Cleveland Cavaliers made 15 3-pointers Sunday in a 122-103 rout of the Indiana Pacers.\n\n\r\n              All five starters scored in double figures for the Cavaliers, who shot 52.3% percent from the field, including 15 of 37 (40.5%) from long range, to complement a top-ranked defense that held Indiana to 43.5% shooting.\n\n\r\n              Jarrett Allen contributed 18 points and 13 rebounds, Evan Mobley had 17 points and 10 rebounds, and Donovan Mitchell added 19 points and six assists for the Cavs. Garland — a Gary, Indiana, native who was not named an All-Star despite averaging 22 points and 8.2 assists — made four 3s and had six assists.\n\n\r\n              “No extra fuel,” Garland said. “I think I was a snub, but I’ve just got to come out and prove it every night.”\n\n\r\n              Myles Turner had 27 points and 10 rebounds for Indiana, which has lost 12 of 14. All-Star Tyrese Haliburton finished with 15 points and 11 assists, while Buddy Hield had 16 points.\n\n\r\n              After alternating wins and losses over its prior eight games, Cleveland took control in the second quarter, led 62-46 at halftime and stretched its advantage to 23 points in the third quarter and as many as 26 in the fourth.\n\n\r\n              “There’s a seriousness to our approach and an attitude to how we are playing,” Cleveland coach J.B. Bickerstaff said. “I think we are taking steps in the right direction. Sometimes when the offense comes easy, you just get in a back-and-forth, but in the fourth we did a much better job of tightening back up and controlling the tempo. We are growing in that area of understanding the intensity level that it takes.”\n\n\r\n              The Pacers were within 27-25 at the end of the first quarter but couldn’t keep up after that.\n\n\r\n              “They did a good job controlling us in the pick-and-roll,” Haliburton said. “We weren’t able to get stops, and that allowed them to set their defense. Kudos to them. A lot of different guys contributed for them. They just outplayed us.”\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: This was Cleveland’s NBA-best 23rd double-figure victory. ... Caris LeVert, who played parts of the 2020-21 and 2021-22 seasons with the Pacers, sat out his second straight game with a sore right hamstring. He is averaging 12.5 points per game. ... Backup point guard Ricky Rubio finished with seven points and nine assists.\n\n\r\n              Pacers: Indiana has lost two of the three games in the season series, which wraps up April 2 at Cleveland. ... Reserve guard Chris Duarte, averaging 7.8 points, was out with soreness in his right ankle. ... The Pacers’ high-frequency 3-point attack, which entered fifth in the league in attempts and sixth in makes, wound up 8 of 32 (25%). ... Indiana coach Rick Carlisle declined to comment on the substance of a report published Sunday by The Athletic that said members of the organization’s traveling party were aggressively confronted by associates of Grizzlies star Ja Morant following Indiana’s Jan. 29 loss at Memphis. Carlisle said he was in the locker room when the incident occurred and received a call about it.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Washington on Monday night.\n\n\r\n              Pacers: At Miami on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995236.8917398
}