{
  "game_id": "0022201044",
  "espn_id": "401469199",
  "date": "Mar 16, 2023",
  "matchup": "TOR vs. OKC",
  "headline": "Raptors win sixth straight at home, beat Thunder 128-111",
  "body": "TORONTO -- — Pascal Siakam had 25 points and 14 rebounds to help the Toronto Raptors beat the Oklahoma City Thunder 128-111 on Thursday night, extending their season-high home winning streak to six.\n\n\r\n              Jakob Poeltl had his third straight double-double with 16 points and 12 rebounds for the Raptors. Gary Trent Jr. added 23 points and Fred VanVleet and Scottie Barnes each had 19.\n\n\r\n              O.G. Anunoby scored 17 points for Toronto as all five Raptors starters reached double figures, and a season-high six scored 15 or more.\n\n\r\n              “There was a lot of good, good stuff there,” Toronto coach Nick Nurse said of his team’s balanced attack. “I really liked our transition offence tonight.”\n\n\r\n              The Raptors outscored Oklahoma City 23-6 on fast-break points.\n\n\r\n              “Toronto was on brand tonight,” Thunder coach Mark Daigneault said. “I thought they were the aggressor. A lot of the fast breaks in the first half were off of our turnovers, which we know they’re obviously really capable of.”\n\n\r\n              Shai Gilgeous-Alexander scored 29 points and rookie Jalen Williams had 15 for the Thunder, who came in having won three straight and six of seven. Oklahoma City is 13-21 on the road.\n\n\r\n              “Honestly, I didn’t think we deserved that win tonight the way we were playing for most of the night,” Gilgeous-Alexander said. “They played the better 48-minute basketball game, and they won.”\n\n\r\n              Josh Giddey scored 13 points, Tre Mann and Isaiah Joe each had 12 and Luguentz Dort scored 10 points for the Thunder.\n\n\r\n              “It was a tough fight,” Dort said. “They brought a lot of energy, they were physical on both sides of the floor.\n\n\r\n              Gilgeous-Alexander made nine of 10 field goal attempts in the first half but shot 3 for 9 in the second half.\n\n\r\n              “I thought they just probably went and got him a little earlier with the double teams, which I don’t think really impacts his shot quality,” Daigneault said. “It was more like they were trying to get it out of his hands and I thought that was disruptive.”\n\n\r\n              Raptors coach Nick Nurse also coaches Gilgeous-Alexander with Canada’s national team, and knows what kind of talent he has become.\n\n\r\n              “He’s just so hard to guard because he’s by you and he can score from every point by you all the way to the rim,” Nurse said. “He makes it look so easy.”\n\n\r\n              Toronto shot 6 for 12 at the free throw line in the first half but closed the quarter with a 10-2 run to lead 29-28 after one.\n\n\r\n              Anunoby and Trent each scored 10 points in the second but Gilgeous-Alexander replied with 13 to keep the Thunder close. Toronto led 64-59 at halftime and took a 93-87 lead to the fourth.\n\n\r\n              “We didn’t play our best but we kept the game in striking distance,” Daigneault said. “When you don’t play your best, that’s all you can hope for. We just never got to the solution, on either end of the floor, in a consistent way.”\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Dort shot 2 for 11, going 1 for 6 from 3-point range, but led Oklahoma City with eight rebounds and five assists. … F Jaylin William shot 2 for 7 and scored five points. … The Thunder made 13 turnovers, leading to 19 points for Toronto.\n\n\r\n              Raptors: Siakam had eight assists. … Toronto didn’t shoot a free throw in the second quarter. … Improved to 19-3 at home when leading after three quarters.\n\n\r\n              ON THE REBOUND\n\n\r\n              Toronto had a season-high 59 rebounds, outrebounding the Thunder 59-39. \n\n\r\n              WHISTLE WATCH\n\n\r\n              Brandon Schwab joined the officiating crew in place of Brandon Adair, who missed the game because of a non-COVID illness.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host Phoenix on Sunday.\n\n\r\n              Raptors: Host Minnesota on Saturday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994020.231338
}