{
  "game_id": "0022200484",
  "espn_id": "401468639",
  "date": "Dec 23, 2022",
  "matchup": "TOR @ CLE",
  "headline": "Siakam and Anunoby score 26, Raptors beat Cavs 118-107",
  "body": "CLEVELAND -- — Pascal Siakam had 26 points and nine assists, O.G. Anunoby scored 26 points and the Toronto Raptors rolled to a 118-107 victory over the Cavaliers on Friday night, becoming the first East team to win in Cleveland this season.\n\n\r\n              Scottie Barnes scored 25 points and Fred VanVleet added 18, helping Toronto beat the Cavaliers for the third time in three games this season. The Raptors made a season-high 19 3-pointers, with Anunoby tying his career best with six.\n\n\r\n              “We just wanted to play with speed and be aggressive from the start, make them take tough shots and go out and gang rebound,” Anunoby said. “If we play with energy and play with force, good things will happen.”\n\n\r\n              Siakam, who scored a career-high 52 points Wednesday at New York, also had seven assists. Barnes grabbed 10 rebounds, Anunoby had nine and VanVleet added eight.\n\n\r\n              VanVleet’s third 3 of the third quarter gave Toronto an 83-57 lead three minutes in, prompting Cleveland coach J.B. Bickerstaff to pull his entire starting lineup. Donovan Mitchell had four points at the time and finished with 12 on 4-of-16 shooting.\n\n\r\n              “They weren’t holding up their end of the bargain and they knew it,” Bickerstaff said. “If you get complacent in the NBA, someone will kick you in the face -- and Toronto is a team that can do it.”\n\n\r\n              The Cavaliers fell to 16-3 at Rocket Mortgage FieldHouse, including 11-1 against the East. Minnesota and Sacramento are the other teams to win in Cleveland.\n\n\r\n              Darius Garland had 17 points and eight assists, and Isaac Okoro scored 15 points for the Cavaliers, who are 4-1 on their season-high, six-game homestand. Cedi Osman and Kevin Love each scored 13 points off the bench.\n\n\r\n              “This game is part of our growth and we have to keep that in mind,” Bickerstaff said. “Donovan is the oldest dude in our lineup and he’s only 26. We’re still a very young team that’s learning how to win in this league.”\n\n\r\n              The Raptors, who entered shooting an NBA-low 32.2% on 3-pointers, made 12 of 21 in the first half and wound up shooting 51.4% beyond the arc.\n\n\r\n              Toronto won for the second time in eight games and is 4-9 since beating the Cavaliers on Nov. 28.\n\n\r\n              “Pascal kept saying, ‘Don’t get bored with the lead, keep getting stops,’” Barnes said. “So we came out in that third quarter really strong. Fred make some shots, Pascal made some shots. We just came out ready to play.”\n\n\r\n              The Cavaliers announced a sellout crowd of 19,432, but the arena was less than two-thirds full as a result of sub-zero temperatures and poor road conditions in Northeast Ohio.\n\n\r\n              TIP-INS\n\n\r\n              Raptors: C Khem Birch (non-COVID illness) missed his second straight game, but coach Nick Nurse said he was improving. … F Precious Achiuwa (right ankle sprain) last played on Nov. 9 and F Otto Porter Jr. (dislocated left toe) has been out since Nov. 16. … Toronto has the third-lowest field goal percentage in the NBA at .449. “At some point, we’ve got to make those shots, right?” Nurse said. “And I think we will.”\n\n\r\n              Cavaliers: F Evan Mobley is one of four players averaging more than 14.0 points, 9.0 rebounds, 2.5 assists and 1.0 blocks, along with Philadelphia’s Joel Embiid, Milwaukee’s Giannis Antetokounmpo and the Lakers’ Anthony Davis. … F Lamar Stevens (right knee soreness) returned from a three-game absence. … Love leads the NBA with 14 charges drawn and is third among bench players with 7.0 rebounds per game.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host the Los Angeles Clippers on Tuesday night.\n\n\r\n              Cavaliers: Host Brooklyn on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994454.422108
}