{
  "game_id": "0021600057",
  "espn_id": "400899507",
  "date": "Nov 02, 2016",
  "matchup": "DET @ BKN",
  "headline": "Lopez double-double Leads Nets over Pistons",
  "body": "NEW YORK --  The Brooklyn Nets hit nearly all their shots at the start, and Trevor Booker made the stops at the end.\n\nBrook Lopez had 34 points and 11 rebounds, Sean Kilpatrick added 24 points, and the Nets beat the Pistons 109-101 on Wednesday night.\n\n\"We made some big plays down the stretch that really sealed the deal,\" Booker said. \"It was a tremendous game by everybody. Defensive plays by me, offense by Sean and Brook. It was a great team effort.\"\n\nBrooklyn hit 16 of its 20 shots in the first quarter to take a 38-30 advantage. The Nets had more turnovers (5) than misses. Brooklyn's first miss came at the 6:03 mark in the first when Rondae Hollis-Jefferson was off on a 3-pointer. Lopez had 14 in the first quarter and 24 by the end of the first half to lead the Nets as Brooklyn took a 71-55 lead to the locker room.\n\nDetroit cut the lead to 11 heading into the fourth quarter and then as close as five with 1:34 remaining.\n\nBooker stole a rebound from Aaron Baynes with 1:20 remaining and then blocked a Caldwell-Pope layup on the break with 58 seconds remaining. After Bojan Bogdanovic then hit two free throws and Harris responded with a three with 38 seconds to go, Booker grabbed an offensive rebound with 16 seconds remaining before finding Lopez on the wing. Lopez was fouled and hit two free throws.\n\n\"Those plays are just so huge for us,\" Lopez said. \"He always brings that intensity and it's definitely contagious. If we can continue to play the way we did tonight as far as energy, effort and plays like that, 50-50 balls, we'll be alright.\"\n\nDespite the win, it wasn't all good news for Brooklyn. Already think at point guard with Greivis Vasquez out, Jeremy Lin left the game with a strained left hamstring.\n\n\"No update yet,\" Nets coach Kenny Atkinson said. \"The doctor said he'll let me know. They're still evaluating, they'll evaluate him again tomorrow when he comes to the facility. We can have more for you then.\"\n\nTobias Harris and Marcus Morris each scored 23 points, Kentavious Caldwell-Pope had 15 points and Jon Leuer added 11 for the Pistons.\n\n\"We didn't guard anybody,\" Pistons coach Stan Van Gundy said. \"We came with no energy. We couldn't keep up with their pace. We couldn't guard them on pick and roll. Brooklyn played very well, moved the ball, shot the ball very well. They outplayed us for 48 minutes in every aspect of the game. Every game is a new game and we brought nothing to the table defensively tonight and we couldn't guard anybody, so of course it's disappointing.\"\n\nTIP-INS\n\nPistons: Van Gundy praised the addition of Ish Smith. \"We wanted a backup point guard who would push the pace a little bit more, really pick up the tempo of the game, which I knew he would do,\" he said. \"I had Ish for a short time in Orlando and also knew what kind of person he is and I thought he'd be a great team guy for us.\" ... Reggie Bullock (back spasms) and Reggie Jackson (left knee rehab) were out.\n\nNets: Lopez made multiple 3-pointers in a game for the first time in his career. ... Brooklyn's 38-point first quarter was the team's highest scoring quarter of the season. ... Randy Foye (mild strain, right hamstring), Greivis Vasquez (sore right ankle) and Caris LeVert (left foot rehab) were out.\n\nVAN GUNDY ON RESTING PLAYERS\n\n\"Look, I'm not one to do it,\" Van Gundy said. \"Our guys get paid to play 82 games. Everybody that's healthy will play for us every single night, but that's just us. Unfortunately, you've got to be willing to -- as a coach now -- you're going to get criticized for that. If you try to win every game, you get criticized for that now. You don't have a long-term vision and you're short sighted. That all may be true of me, but we're going to put our best guys out there every night and try to win. It's been a little surprising to me the guys being rested already. I mean are guys really worn down already? We're four games into the year and guys are resting their players. That part has been surprising to me. I know it's a league-wide trend as we get into the season, but I really didn't expect to see it the first week to be quite honest.\"\n\nUP NEXT\n\nPistons: Host Denver on Saturday. Detroit heads to Denver as winners of three of its last four games.\n\nNets: Host Charlotte on Friday. Brooklyn looks to get its first winning streak of the season against the Hornets.",
  "source": "espn_api",
  "crawled_at": 1764996089.602078
}