{
  "game_id": "0022300473",
  "espn_id": "401585101",
  "date": "Jan 03, 2024",
  "matchup": "LAC @ PHX",
  "headline": "George scores 33 points, Leonard adds 30 to help surging Clippers beat Suns 131-122",
  "body": "PHOENIX -- — Los Angeles coach Tyronn Lue was still stewing a little in the postgame press conference, replaying in his head how the Clippers' offense got a little stagnant during the final eight minutes against Phoenix on Wednesday night.\n\n\r\n              The good news for the Clippers is the first 40 minutes were so good it didn't really matter.\n\n\r\n              Paul George scored 33 points, Kawhi Leonard added 30 and the Clippers extended their winning streak to four straight by beating the Suns 131-122. Los Angeles has won 13 of 15 while Phoenix had its four-game winning streak snapped.\n\n\r\n              George shot 8 of 14 from the field, going 5 of 10 from 3-point range. James Harden had 22 points and 11 assists. \n\n\r\n              The Clippers shot 55% from the field and 53% from 3-point range — efficient numbers all around. Harden said he expects that will be the norm as he continues to adapt to his new team after being traded from Philadelphia on Oct. 31.\n\n\r\n              “We still haven't figured it out, because different teams guard us differently,\" Harden said. \"Once we've seen every defense, which probably won't be until the end of the year, we'll figure out how to attack.”\n\n\r\n              Los Angeles appears to be a quick study with an 18-5 record after starting the season 3-7.\n\n\r\n              The Clippers kept a comfortable lead throughout most of the second half — pushing the advantage to 23 points midway through the third — but the Suns made a run in the fourth quarter and cut it to 118-110 with 5:13 remaining.\n\n\r\n              L.A.'s Norman Powell responded with a 3 that helped the Clippers regain control. He scored 13 points off the bench.\n\n\r\n              “It's just making the right pass and making the right play — that's what we've got to be good at,” Lue said. “We want teams to double team us with all the shooting we have, but we just didn't handle it the right way.”\n\n\r\n              Devin Booker led the Suns with 35 points on 11-of-15 shooting, with Kevin Durant missing his second straight game because of soreness in his right hamstring. Bradley Beal added 21 points, but shot just 7 of 20 and missed all six of his 3-point attempts. Bol Bol scored 14 points, including two 3s.\n\n\r\n              “Really proud of how we competed — we didn't give up on the game. That's a positive attribute for our team,” Suns coach Frank Vogel said. “I'm more concerned with how we started defensively. I don't think we had the necessary disposition to guard an elite offense.”\n\n\r\n              Los Angeles never trailed, taking a 30-13 lead late in the first quarter, unleashing waves of offense against the overmatched Phoenix defense. The Clippers led 70-51 at halftime after shooting 58.5% from the field.\n\n\r\n              “We've got to start games better and with a sense of urgency. Be ready for the fight,” Booker said. “We were fighting uphill the whole game. We showed some things in the second half, what it looks like when we turn up the energy and intensity.”\n\n\r\n              George had 21 points before the break while Leonard and Terance Mann both had 12.\n\n\r\n              The Suns seemed more interested in sniping at the referees rather than playing defense. Booker and Beal were both called for technical fouls in the first half. \n\n\r\n              Phoenix announced a 100th straight sellout crowd, counting games in both the regular season and postseason.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At New Orleans on Friday night.\n\n\r\n              Suns: Host Miami on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996554.82004
}