{
  "game_id": "0021800446",
  "espn_id": "401071127",
  "date": "Dec 17, 2018",
  "matchup": "SAC @ MIN",
  "headline": "Towns, bench help Timberwolves beat road-weary Kings 132-105",
  "body": "MINNEAPOLIS --  Karl-Anthony Towns got the Minnesota Timberwolves started and then enjoyed watching rookie Josh Okogie and the bench deliver the big blow.\n\nTowns had 14 points and 14 assists in just 21 minutes, Andrew Wiggins scored 17 and the Timberwolves beat the road-weary Sacramento Kings 132-105 on Monday night.\n\n\"You know, he comes off playing the way he played tonight, it makes all of us energized,\" Towns said about Okogie. \"Everyone has that guy that brings the best out of everyone, and Josh is that guy for us. When he comes in the game and plays that way every single time, it reinvigorates all of us.\"\n\nDerrick Rose added 13 points and a season-high 11 assists while starting for injured point guard Jeff Teague. Minnesota led by 36 in the first half against Sacramento, which was coming off a 120-113 victory at Dallas a night earlier.\n\nThe Timberwolves returned home following an 0-4 trip, including a 141-130 loss at Sacramento.\n\n\"You're always worried when you have a lead like that is sustaining your effort, and you're especially concerned with a team like that that shoots 3s the way they do,\" Minnesota coach Tom Thibodeau said. \"We were fortunate to work our way out of that and then I was very pleased with our bench.\"\n\nKings coach Dave Joerger had a different reason to turn to his reserves. Sacramento was playing for the third time in four nights with travel, and then trailed big early.\n\nBuddy Hield scored 21 points for the Kings but didn't play in the second half. Joerger didn't play any of his starters after halftime.\n\n\"I think that's one thing we're working on as a young team, learning how to play on back-to-backs and finding that energy from somewhere,\" forward Skal Labissiere said. \"We've been struggling with that this whole year. I think as we mature, we'll figure it out.\"\n\nMinnesota had a double-digit lead less than three minutes into the game. Hield tried to rally the Kings, scoring 16 of their first 17 points and hitting his first four 3-pointer before the Wolves' bench took over.\n\nKeyed by Okogie and Gorgui Dieng, Minnesota started the second quarter on a 25-5 run. Dieng scored seven of his season-high 15 points during the outburst, but it was the energetic rookie Okogie that had the Timberwolves and their fans celebrating.\n\nOkogie, drafted 20th this year out of Georgia Tech, finished with 10 points, three rebounds and three assists.\n\n\"I'm always in the gym working on different things, working on different ways to impact the game,\" Okogie said. \"Sometimes I play, sometimes I don't. When I do play, I'm going to do anything I can to help my team win.\"\n\nSacramento's reserves used a 21-3 spurt at the start of the second half to cut the deficit to 12.\n\n\"I commend those guys for going out there, being professional, playing hard and taking the minutes,\" Joerger said. \"We got off to a slow start, and I didn't think putting those guys back in was going to be worth it.\"\n\nTIP-INS\n\nKings: Sacramento starters De'Aaron Fox, Willie Cauley-Stein and Nemanja Bjelica all played fewer than 10 minutes. Fox, who entered averaging 18.5 points and 7.5 assists per game, was held scoreless on 0-of-4 shooting and didn't have an assist. ... The bench scored a season-high 78 points. ... Iman Shumpert missed the game due to personal reasons.\n\nTimberwolves: Teague missed the game with left ankle inflammation. Thibodeau said there was no specific injury, but the inflammation built up over time. ... The Timberwolves set a franchise record with nine players scoring in double figures. ... Minnesota had a season-high 37 assists on 48 made shots. ... The Wolves outscored Sacramento 66-36 in the paint.\n\nNO CONTROVERSY HERE\n\nJoerger addressed the backlash following his comments about Dallas rookie Luka Doncic a day earlier.\n\nJoerger complimented Doncic, saying he has no ceiling. Some took Joerger's quotes as displeasure at general manager Vlade Divac drafting Marvin Bagley III ahead of Doncic in the draft.\n\n\"In this case, all we were trying to do was say something positive about another team's player,\" Joerger said. \"There's no veiled shots at anybody. ... It was just a form of positivity and people try to turn it into something between Vlade and I.\"\n\nBagley missed his second straight game with a left knee bone bruise. Joerger spoke highly of his developing rookie big man before the game.\n\n\"When we drafted Marvin at 2, we were high-fiving like crazy,\" Joerger said. \"We got the right guy for us. Where we're going to be, this isn't going to be a story in three days. It's going to be definitely buried in five years from now when we've got the next Durant, Westbrook. That's how good they're going to be.\"\n\nUP NEXT\n\nKings: Return home Wednesday against Oklahoma City.\n\nTimberwolves: Host Detroit on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994882.4301262
}