{
  "game_id": "0021500357",
  "espn_id": "400828244",
  "date": "Dec 14, 2015",
  "matchup": "TOR @ IND",
  "headline": "Hill scores 20 points to lead Pacers over Raptors 106-90",
  "body": "INDIANAPOLIS --  Jordan Hill and Monta Ellis helped Indiana pull off a big come-from-behind win with hopes of getting the Pacers back to their winning ways.\n\nHill had season highs of 20 points and 13 rebounds, Ellis had 18 points and the Pacers beat the Raptors 106-90 on Monday night to end Toronto's four-game winning streak.\n\n\"We have our ups-and-downs sometimes,\" Hill said. \"We've got to shake them off and continue to play.\"\n\nThat's exactly what Indiana did, even when it looked as if the Raptors were going to run away with another win.\n\nIndiana used a 39-4 run in the first half to climb out of a 21-point deficit and Lavoy Allen made two free throws to give the Pacers a 29-28 lead at the 11:38 mark in the second quarter.\n\nIndiana took a 44-30 lead when Ellis converted a three-point play with 4:08 remaining in the first half.\n\n\"He's a mid-range assassin,\" C.J. Miles said. \"He's made big shots his whole career and he's been stepping up the last few games for us.\"\n\nMiles added 17 points for the Pacers, who have won two of three games and snapped a five-game skid against Toronto, including a 106-99 loss in the season-opener on Oct. 28.\n\nAs the Pacers search for a way to end the team's worst stretch since losing three straight to start the year and get back to winning games, Hill and Ellis stepped up in a big way.\n\nEllis made a 3-pointer early in the third quarter to put Indiana ahead 64-46 before Toronto went on a 10-0 run. Ellis scored on a lay-up to stop the spurt and later made a free throw when Lowry was called for a technical to give the Pacers a 67-56 lead with 4:43 left in the third.\n\n\"The biggest thing was we got a win,\" Ellis said. \"Hopefully we can string some wins together while we're back at home and get this thing back on the winning track.\"\n\nIndiana got off to a slow start and Toronto jumped out to a big lead right from the start.\n\nKyle Lowry and DeMar DeRozan each finished with 20 points and gave the Raptors a spark early on.\n\nLowry made two 3-pointers and a basket and DeRozan scored a basket and a 3 to put the Raptors ahead 15-3 early in the opening quarter. Lowry scored to make it 26-5 with 6:01 remaining in the first quarter.\n\nThen Indiana went on its big run.\n\n\"A lot of it was us, throwing the ball away, throwing it around and being careless with it,\" Toronto coach Dwane Casey said. \"They turned up their intensity and got us on our heels and we never recovered.\"\n\nHill never let it get close again and scored nine points in the fourth quarter. He finished with his fourth double-double of the season.\n\nTIP-INS\n\nRaptors: F DeMarre Carroll was out with a right knee contusion for the fifth straight game. ... Jonas Valanciunas was inactive for the 12th straight game with a fractured left hand. ... Toronto allowed more than 100 points for the first time in five games.\n\nPacers: Indiana's bench outscored Toronto's 25-8 in the first half. ... Ellis scored in double-figures for the third consecutive game. ... George was presented with the Eastern Conference Player of the Month award prior to tipoff.\n\nKILLER TURNOVERS\n\nAfter Toronto took a 26-5 lead in the first quarter, the Raptors turned the ball over 13 times. Indiana took full advantage and converted the turnovers into 17 points during the big run. Overall, the Pacers turned Toronto's 21 turnovers into 22 points.\n\nGROUNDBREAKING\n\nNBA Commissioner Adam Silver attended the game after a groundbreaking ceremony for a $50 million medical and training facility for the Pacers. The 130,000-square-foot building will be located across the street from Bankers Life Fieldhouse, where the team currently trains and plays its games. Construction is expected to be completed in 2017.\n\nUP NEXT\n\nRaptors: At Charlotte on Thursday night.\n\nPacers: Host Dallas on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994750.18726
}