{
  "game_id": "0022300294",
  "espn_id": "401584922",
  "date": "Dec 11, 2023",
  "matchup": "ORL vs. CLE",
  "headline": "Paolo Banchero, Magic hold Cavaliers to 15 points in 3rd quarter, win 104-94",
  "body": "ORLANDO, Fla. -- — Orlando's Paolo Banchero had 20 points and 10 rebounds, Franz Wagner scored 19 points and the Cleveland Cavaliers couldn't recover from a dismal third quarter Monday night in a 104-94 loss to the Magic.\n\n\r\n              Darius Garland scored 36 points for the Cavaliers, who made only two of 17 shots in the third and finished with 15 points in the period. Donovan Mitchell added 22 points for the Cavaliers, who had won four straight on the road.\n\n\r\n              Cleveland's scoring total was a season low.\n\n\r\n              “They had some momentum plays that shifted in their favor,” Cavs coach J.B. Bickerstaff said. “They got the crowd involved. They attacked us in the paint. ... We struggled to score there.”\n\n\r\n              Goga Bitadze had 15 points for the Magic, who have won 11 of 13 with one of the losses coming at Cleveland last Wednesday, when they shot 2-for-23 from 3-point range. They shot 7-for-26 Monday night, but the Cavs were even worse (9 of 40 from 3 and 35.3% overall).\n\n\r\n              “We knew we didn't have our best game in Cleveland, and we wanted to show them, and show everybody, that we don't want to be the doormat anymore,” said Jalen Suggs, who had 12 points and spent much of the game trying to slow down Garland and Mitchell.\n\n\r\n              Banchero sprained his right ankle late in the third quarter. He returned with the ankle re-taped with 6:39 remaining and helped the Magic hold onto the lead.\n\n\r\n              “It just shocked me at first, put me on the ground,” Banchero said, “but I put some weight on it and felt like I could come back.”\n\n\r\n              Cleveland led 54-51 after a first half in which Garland scored 19 points.\n\n\r\n              With 7-footer Evan Mobley missing a second straight game due to a sore left knee, Jarrett Allen was called for his fourth foul just 20 seconds into the second half, leaving the Cavaliers outmanned in the front court.\n\n\r\n              Banchero, Wagner and Bitadze took full advantage, scoring all the points during a 12-0 run late in the period that left the Magic with a 76-65 lead. By the time Allen fouled out early in the fourth quarter, the Cavaliers were down 89-71.\n\n\r\n              Garland and Mitchell got the Cavs back into the game in the fourth, but the closest they could get was 99-94 on steal and a layup by Mitchell with 1:36 left.\n\n\r\n              “It came down to shot-making at the end of it,” Bickerstaff said. “It was a good, competitive game, but at the end of the day the scoreboard ticks for a reason, and we just didn't make enough shots to win it.” \n\n\r\n              Joe Ingles, who led the Magic's first-half scoring with 12 points, left in the third quarter with a sprained left ankle but returned to start the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit Boston on Tuesday night.\n\n\r\n              Magic: Visit Boston on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995728.855074
}