{
  "game_id": "0021900583",
  "espn_id": "401161225",
  "date": "Jan 11, 2020",
  "matchup": "MIL @ POR",
  "headline": "Bucks beat Trail Blazers 122-101 for third straight win",
  "body": "PORTLAND, Ore. --  The Milwaukee Bucks have bigger goals than a 70-win season, though their star player isn’t taking their phenomenal start for granted.\n\nGiannis Antetokounmpo had 32 points and 17 rebounds, Khris Middleton scored 30 points and the Bucks beat the Portland Trail Blazers 122-101 on Saturday night.\n\nEric Bledsoe added 29 points for the Bucks, who made 14 3-pointers led by Middleton's 4-for-4 performance.\n\nAntetokounmpo was asked afterward if the Bucks have changed their mindset from the hunters to the hunted.\n\n“We're still hunting,” the reigning MVP said. “Obviously teams are going to come and play hard against us. But at the end of the day we have to be the hunters. We have to have that mentality. That’s what we’ve been doing. We’ve won 35 games and played 41. That’s crazy.”\n\nBut Middleton downplayed it.\n\n“You can’t win a championship in the regular season,” Middleton said.\n\nAntetokounmpo had 13 points and seven rebounds in the first quarter alone and Milwaukee went on to its third straight win. That matched his entire point total from Friday night’s win over Sacramento.\n\n“Usually when I’m not aggressive the previous game, I come out the next game more aggressive,” Antetokounmpo said. “I can remember since I started playing basketball and that’s what we did tonight.”\n\nAntetokounmpo also hit multiple 3-pointers for the 18th time this season, something he did only 13 times all of last season.\n\n“I’m comfortable, but I have to keep getting better,” he said.\n\nThe Bucks led 32-24 after the first quarter as Damian Lillard did his best to keep Portland within range, scoring 12 points in the first quarter.\n\nLillard finished with 26 points while CJ McCollum scored 20 and Carmelo Anthony had 19 points and 11 rebounds, but Portland lost for the eighth time in 10 games.\n\n“Yeah, it was a good effort but we don’t show up to have a good effort,” Lillard said. “We show up to win.”\n\nThe Blazers shot just 10 for 36 from the 3-point line.\n\nThe Bucks pushed their lead to as high as 17 multiple times in the third quarter and held a 97-80 lead after the period thanks to a tip-in by Pat Connaughton before the buzzer.\n\nA three-point play by Bledsoe pushed the Bucks lead to 116-94, their biggest of the game. A couple of possessions later, coach Terry Stotts removed the Blazers starters from the game.\n\nTIP-INS\n\nBucks: Though Antetokounmpo is the biggest reason for the Bucks' NBA-best 35-6 record, the Bucks outscore their opponents by 8.3 points per 100 possessions when the MVP sits, according to NBA.com. “I think (Bucks coach Mike Budenholzer) does a really good job of integrating all his players,” Stotts said. “They have interchangeable parts, they pass, they shoot, they’re unselfish, they have rim protection.”\n\nTrail Blazers: The Blazers, who are dealing with a host of injuries, were forced to deal with illness on Saturday night. Starting center Hassan Whiteside missed the game after playing through an illness in Thursday’s road loss to the Minnesota Timberwolves. McCollum missed a Jan. 5 game with an illness but according to Stotts, Whiteside was the only player still affected by the sickness that spread around the team over the past week. Anthony Tolliver started in Whiteside’s place, finishing with 11 rebounds and seven points in 28 minutes.\n\nUP NEXT\n\nBucks: Tuesday at home vs. New York Knicks.\n\nTrail Blazers: Monday at home vs. Charlotte Hornets.",
  "source": "espn_api",
  "crawled_at": 1764996146.052864
}