{
  "game_id": "0021800756",
  "espn_id": "401071429",
  "date": "Jan 30, 2019",
  "matchup": "CHA @ BOS",
  "headline": "Brown, Tatum carry Celtics over Hornets without Irving",
  "body": "BOSTON --  Jaylen Brown had 24 points and 10 rebounds, Jayson Tatum scored 20 points, and the Boston Celtics rolled over the Charlotte Hornets 126-94 on Wednesday night despite Kyrie Irving's absence.\n\nTerry Rozier had 17 points and tied a career high with 10 assists in place of Irving, who missed his second straight game with a left hip strain.\n\nMarcus Morris scored 15 points, Al Horford had 14 and Gordon Hayward 12 for the Celtics, who won for the seventh time in eight games.\n\nKemba Walker had 21 points to lead Charlotte, well short of the 43 he scored in a 117-112 home win over Boston on Nov. 19.\n\nMalik Monk scored 16 points, Nicolas Batum added 13 and Marvin Williams 10 in Charlotte's third loss in five games.\n\nMorris knocked down a 3-pointer from the right wing with 6:49 left in the third period to put Boston ahead 76-69 and started a 25-6 quarter-ending run.\n\nThe Celtics led 98-75 after three and ran the lead up to 35 during the fourth.\n\nTIP-INS\n\nHornets: After playing 19 minutes in Monday's win against the Knicks, PG Tony Parker sat to rest his sore right ankle. Rookie two-way G Joe Chealey was active for the first time in his NBA career. ... Coach James Borrego said C Cody Zeller, out since Dec. 31 while recovering from right hand surgery, is \"about a week away\" from returning.\n\nCeltics: Irving, who last week earned his sixth All-Star selection in eight seasons, missed his second straight game with an injury the team believes he suffered during Saturday's loss to Golden State. \"Hopefully he'll be available Friday (against the Knicks). If not, Sunday,\" coach Brad Stevens said. Boston improved to 6-2 without Irving this season.\n\nRISING RUMORS\n\nTatum will play for Team USA in the Rising Stars game for a second straight season during All-Star weekend in Charlotte. The 20-year-old Celtics forward isn't as certain where he'll play after that with the NBA's trade deadline looming on Feb 7.\n\n\"I mean, it's good to be wanted,\" Tatum said about his name popping up in trade rumors surrounding New Orleans Pelicans star Anthony Davis, whose agent publicly requested a trade Monday. \"I'm not a free agent. I don't have any control. I can control what I can control. Just go out there and play.\"\n\nBEAT L.A. (AGAIN)\n\nWith the Patriots set to face the Rams in Super Bowl LIII on Sunday, the Celtics were gifted Pats-themed T-shirts saying \"Beat LA\" from New England wide receiver Julian Edelman. The rally cry, which originates from the Celtics' rivalry with the Lakers, was also adopted by Red Sox fans during this year's World Series against the Dodgers.\n\nUP NEXT\n\nHornets: Begin three-game homestand Friday night versus Grizzlies.\n\nCeltics: Visit New York on Friday night before Super Bowl Sunday showdown with Thunder at home.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994378.3667789
}