{
  "game_id": "0022000727",
  "espn_id": "401307517",
  "date": "Mar 31, 2021",
  "matchup": "TOR @ OKC",
  "headline": "Oklahoma City tops Raptors 113-103, snaps 3-game skid",
  "body": "OKLAHOMA CITY -- — Svi Mykhailiuk scored 10 of his season-high 22 points during a key fourth-quarter stretch, and the Oklahoma City Thunder rallied to beat the Toronto Raptors 113-103 on Wednesday night.\n\n\r\n                    Mykhailiuk made 9 of 14 shots overall and had a career-high nine rebounds. \n\n\r\n                    Moses Brown had 20 points and 11 rebounds, and Isaiah Roby added 17 points and 10 rebounds for Oklahoma City, which snapped a three-game losing streak. \n\n\r\n                    “It was a team effort,” Thunder coach Mark Daigneault said. “We got contributions from all nine guys tonight. I thought we really played together, really competed. That’s an aggressive, tough team that you have to play connected basketball against, and I thought we did that tonight.”\n\n\r\n                    The Thunder outrebounded the Raptors 64-35.\n\n\r\n                    “It’s a good barometer of our competitiveness,” Daigneault said. “I thought we just made great extra efforts and kept balls alive. I just thought we went after it.”\n\n\r\n                    Oklahoma City was missing three regular starters. Shai Gilgeous-Alexander remained out with right foot plantar fasciitis, Lu Dort was out due to concussion protocols and Darius Bazley was out with a left shoulder contusion. Rookie Aleksej Pokusevski, a recent addition to the starting lineup, was out because of health and safety protocols. \n\n\r\n                    Gary Trent Jr. scored a career-high 31 points, and OG Anunoby added 20 points and 11 rebounds for the Raptors, who have dropped 13 of their last 14 games.\n\n\r\n                    “We’ve got to show up for work tomorrow and try to get another one Friday,\" Raptors guard Fred VanVleet said. \"I don’t think we’re at the point where we’re pointing fingers or guys are blaming. I think we passed that point a long time ago. So we’re pretty cohesive and together. We’re just not playing well.”\n\n\r\n                    Raptors guard Kyle Lowry sat out with a right foot infection. He played 24 minutes against Portland on Monday, but had missed the game before that against Portland on Sunday with right foot soreness.\n\n\r\n                    Trent scored 20 points in the first half to help the Raptors take a 67-59 lead. Toronto shot 52% from the field in the first half. Brown led the Thunder with 12 points and eight rebounds.\n\n\r\n                    Toronto led 89-87 heading into the fourth. The Thunder held the Raptors to 30% shooting in the third quarter to close the gap. \n\n\r\n                    Oklahoma City took the lead early in the fourth. Mykhailiuk went up high to throw down a two-handed dunk on a lob from Justin Jackson that put the Thunder ahead 98-93. Mykhailiuk followed with a 3-pointer to push Oklahoma City's lead to eight. It was part of a three-minute stretch in which he scored 10 points and helped the Thunder take control for good.\n\n\r\n                    It was Mykhailiuk's seventh game with the Thunder since being traded from Detroit, and he's made an impression.\n\n\r\n                    “One of the things our scouts told us when we acquired him is he's a basketball player, and that there's a lot there on both ends of the floor and that he's more versatile than he gets credit for,\" Daigneault said. \"That's definitely shining through right now.”\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Trent scored 10 points in the first quarter as Toronto shot 50%. ... Center Aron Baynes was issued a technical foul in the third quarter. ... Anunoby extended his streak of games with at least 10 points to 22 games.\n\n\r\n                    Thunder: It was the first Oklahoma City game since Fox Sports Oklahoma rebranded as Bally Sports Oklahoma. Only the name changed. ... Guard/forward Kenrich Williams had 10 points and nine rebounds. ... Guard Theo Maledon had 11 points, seven rebounds and six assists.\n\n\r\n                    QUOTABLE\n\n\r\n                    VanVleet, on Trent: “He played well. He made shots. Started off, got hot and he was pretty much most of our offense tonight. Coach ran a lot of sets for him tonight, so he was rolling and he played with great spirit and he made shots.”\n\n\r\n                    STAT LINES\n\n\r\n                    VanVleet had 18 points, seven assists, four blocks and four steals, becoming the first Raptors player to have at least four of each in a game.\n\n\r\n                    “It wasn’t enough tonight, so it really doesn’t matter to me,” he said. “Just trying to impact the game in different ways.\"\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Host the Golden State Warriors on Friday.\n\n\r\n                    Thunder: Visit the Phoenix Suns on Friday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996837.011072
}