{
  "game_id": "0021600636",
  "espn_id": "400900057",
  "date": "Jan 19, 2017",
  "matchup": "PHX @ CLE",
  "headline": "LeBron, Irving lead Cavs to 118-103 win over Suns",
  "body": "CLEVELAND -- Before their first home game following a long trip that ended with a miserable thud at Golden State, Cavaliers coach Tyronn Lue showed his team video clips to remind them who they are.\nThe message?\n\"Do that,\" LeBron James said.\nKyrie Irving scored 26 points, James, his All-Star teammate, had 21 points and 15 assists, and Cleveland looked more like an NBA champion in a 118-103 win over the Phoenix Suns on Thursday night.\nThe Cavs were back in Quicken Loans Arena following a six-game road swing (their longest of the season) that concluded with an embarrassing 35-point loss to the Warriors. But on their home floor, they had better offensive balance, ball movement and defense while improving to 30-11 -- the same record Cleveland had at the halfway point of its 2016 NBA title season.\nChanning Frye scored 18, Iman Shumpert 17 and James Jones 14 while filling in for star forward Kevin Love, still bothered by back spasms.\n\"Coming off our road trip we just weren't playing Cavalier basketball,\" said James, \"and getting the ball popping from one side to the other. It was good to get back to the way we've been playing for most of the season.\"\nTyson Chandler had 22 points and 16 rebounds, but the Suns lost for the fourth time in five games.\nPhoenix closed within 12 in the fourth, but was unable to get any closer.\n\"They always make the right play offensively and defensively,\" said Suns guard Devin Booker, who finished with 21 points on 4-of-12 shooting. \"They're always on a string together on both ends of the floor. You can hear them talking out there. You can hear them communicating. I guess that's one thing you can learn from them, how comfortable they are with themselves and the way they talk to each other.\"\nAlready thin on their front line with Love out, the Cavs lost forward Tristan Thompson in the second quarter with a dislocated left index finger. However, Thompson returned after halftime.\nAnd Cleveland's offense was in a much better rhythm from the start after a trip that wasn't always pleasing to the eye.\nIrving and James shined as always, but it was the contributions of Cleveland's supporting cast that made the difference.\n\"We definitely needed it,\" James said. \"We needed guys to step up and you know, we had that tonight out of everybody, especially Channing.\"\nWhile trying to integrate newly acquired Kyle Korver into their rotation on the road, the Cavs got into some bad habits as they forced passes to one of the league's best shooters. A couple of practices seem to have helped as Korver made a pair of 3-pointers in the second quarter of his home debut to help Cleveland open a 21-point lead.\nThe Suns made a brief run in the third and got within 12 before Shumpert hit a pair of 3s and Jones hit one from long range.\nIRON MAN\nThompson injured his finger when he got it caught on Chandler's jersey. For a moment, he was worried it might affect his consecutive games streak that now stands at 411 -- the longest current run in the league.\n\"Once they told me it was only dislocated, I knew the streak was still alive,\" he said.\nTIP-INS\nSuns: G Brandon Knight returned after missing two games with a sprained right wrist, but had a short night after committing four fouls in four minutes in the first half. ... Chandler has at least 15 rebounds in six straight games, matching the club record set by Jim Fox in 1969. ... Booker had averaged 30 points in his past six games.\nCavaliers: Korver finished with nine points. ... James, who missed his 46th career triple-double by one rebound, will be making his 13th consecutive All-Star Game appearance next month. He said the honor never gets old. \"Just means I've been doing something right in this league,\" he said. \"Means I'm consistent and taking pride in my individual ability to go out and produce for the team every night, and whatever team I've been on in my career. It's always great to see my name up there with the best guys in the league, so it's a pretty cool thing.\" ... G J.R. Smith has had the hard cast removed from his surgically repaired thumb. He's expected back in late March. ... Jones made his first start since April 2, 2015.\nUP NEXT\nSuns: At the New York Knicks on Saturday. Phoenix won the first meeting this season in overtime.\nCavaliers: Host the San Antonio Spurs on Saturday in a matchup between two of the NBA's best teams.",
  "source": "espn_api",
  "crawled_at": 1764995971.067617
}