{
  "game_id": "0022300841",
  "espn_id": "401585469",
  "date": "Feb 27, 2024",
  "matchup": "HOU @ OKC",
  "headline": "Gilgeous-Alexander scores 31 as Thunder top Rockets 112-95 for 6th straight win",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 31 points and the Oklahoma City Thunder beat the Houston Rockets 112-95 on Tuesday night for their sixth straight win. \n\n\r\n              Jalen Williams had 24 points and Chet Holmgren added 18 points and 13 rebounds for the Thunder, who are tied with Minnesota for the best record in the Western Conference.\n\n\r\n              The Thunder outrebounded the Rockets 55-46.\n\n\r\n              “I think we brought physicality from the jump tonight,” Gilgeous-Alexander said. “We didn’t have our best offensive game, but we brought the fight to them in the beginning. We were able to kind of get a lead and maintain the lead for most of the night because of it.”\n\n\r\n              Alperen Sengun had 23 points and 11 rebounds and Jabari Smith Jr. added 18 points and 13 rebounds for the Rockets, who also lost to the Thunder on Sunday. Oklahoma City packed the paint against the Rockets in the rematch and held them to 38.9% shooting from the field.\n\n\r\n              “They take away the pocket, obviously, and collapse and crowd, and you get a bunch of wide-open looks,\" Houston coach Ime Udoka said. \"You don’t make that stuff and it stresses everything else out and causes us to force it a little bit too much individually. So we love the looks we got — a lot of wide-open ones — and didn’t shoot it well tonight at all. So, you've got to live with the shots, but, play better.”\n\n\r\n              Houston fell apart late in the first half. With the Thunder leading 54-48, Rockets guard Fred VanVleet was whistled for a foul on a drive by Holmgren. Udoka challenged the call and was unsuccessful, then Smith and Udoka were called for technical fouls — Smith for questioning the integrity of the officials and Udoka for profanity directed toward the officials. \n\n\r\n              So instead of Houston trailing by six and getting the ball with a successful challenge, Oklahoma City made four free throws to extend its lead to 10. The Thunder led 60-50 at the break after closing the half on a 12-2 run.\n\n\r\n              Early in the third quarter, Holmgren caught a lob from Williams, dunked it two-handed behind his head and was fouled. Holmgren made the free throw to put the Thunder up 65-56.\n\n\r\n              Lu Dort missed his first seven shots before hitting a 3-pointer that put Oklahoma City up 71-61 and prompted Udoka to call a timeout. The Thunder led 84-74 at the end of the third as Gilgeous-Alexander scored nine points in a three-minute span late in the quarter.\n\n\r\n              “Just take what the defense gives me and trust my work,\" he said. \"There’s moments, and you can feel it when you’ve got it going and you should be aggressive. And there’s also moments when you need your teammates and you've got to kind of play the game. And it’s something that I notice and I try to work on every game, every day. And I’ve definitely gotten better.”\n\n\r\n              A driving dunk by Williams after a bounce pass from Josh Giddey put the Thunder ahead 96-79. A lob from Holmgren to new Thunder player Gordon Hayward made it 98-81, and Oklahoma City remained in control from there.\n\n\r\n              “Bottom line is play better,” Udoka said. \"They had three or four guys play better than ours.”\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Visit the Phoenix Suns on Thursday.\n\n\r\n              Thunder: Visit the San Antonio Spurs on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995588.022279
}