{
  "game_id": "0022200777",
  "espn_id": "401468932",
  "date": "Feb 01, 2023",
  "matchup": "ATL @ PHX",
  "headline": "Murray scores 21 points, Hawks roll past Suns 132-100",
  "body": "PHOENIX -- — Trae Young rose up for a 3-pointer in the second half that left his hands way too hard, hurtling toward the basket before slamming off the backboard and through the hoop.\n\n\r\n              Atlanta's star guard shrugged and ran back down the court with a sheepish grin.\n\n\r\n              Things were going the Hawks way Wednesday night, leading to a blowout victory. Dejounte Murray scored 21 points, Young added 20 points and 12 assists and Atlanta rolled past the Phoenix Suns 132-100.\n\n\r\n              The Hawks had lost four of five games coming into Wednesday's game, but played much better on both ends of the floor.\n\n\r\n              “We wanted to win really bad and knew it had to start on the defensive end,” Murray said. “The defense took care of the offense.”\n\n\r\n              The Hawks never trailed, jumping to a 9-4 lead with three 3-pointers. Atlanta never let up, pushing to a 102-67 advantage by the end of the third quarter and leading by 43 points in the fourth.\n\n\r\n              Just about everyone was hitting shots for the Hawks, who made 52 of 91 shots (57.1%), including 19 of 33 (57.6%) on 3-pointers. Bogdan Bogdanovic added 18 points off the bench.\n\n\r\n              “When you're getting downhill, moving the ball, sharing the ball, things like that can happen,” Hawks coach Nate McMillan said. “I thought tonight we did a good job moving the ball and getting it to the open man.”\n\n\r\n              Phoenix — with star guard Devin Booker close to returning from a groin injury — lost for just the second time in eight games. The Suns were sloppy with 16 turnovers that turned into 31 points for the Hawks and had a dismal shooting night, hitting just 4 of 28 (14.3%) shots from 3-point range.\n\n\r\n              “They were a lot faster then us especially in transition and we just couldn’t make a shot for whatever reason,” Suns coach Monty Williams said. \n\n\r\n              Mikal Bridges led the Suns with 23 points but shot just 6 of 18 from the field, including 1 of 7 on 3s. Deandre Ayton added 20 points and nine rebounds.\n\n\r\n              “It felt like we were on a treadmill,” Ayton said. “It felt like we were hamsters running in one spot. The game was going too fast and we were making some points but not putting a dent into the lead.”\n\n\r\n              The Hawks used a 13-0 run early in the second quarter to take a 66-47 lead into halftime. Murray led Atlanta with 15 points before the break while Bridges had 17 for the Suns.\n\n\r\n              Phoenix shot just 18 of 47 (38.5%) in the first half, including 2 of 16 (12.5%) from 3-point range.\n\n\r\n              SUNS SIGN LEE\n\n\r\n              The Suns announced Wednesday that they've signed guard Saben Lee for the rest of the season.\n\n\r\n              Lee has emerged as the team's backup point guard over the last three weeks after being signed to back-to-back 10-day contracts. He's filling in for Cam Payne, who remains out with a foot injury.\n\n\r\n              To make room for Lee on the roster, the Suns released Duane Washington Jr., who played in 31 games this season, starting three. He averaged 7.9 points, but shot just 36.7% from the field.\n\n\r\n              Lee had six points, three assists, three steaks and three rebounds in 21 minutes against the Hawks.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Onyeka Okongwu made all seven of his shots. He finished with 17 points. ... Former Suns center Frank Kaminsky got a technical foul in the fourth quarter. ... Young reached 3,000 career assists.\n\n\r\n              Suns: Booker, Payne and G Landry Shamet (foot) were out. ... Hosted a 54th straight sellout crowd.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Utah on Friday night.\n\n\r\n              Suns: At Boston on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994822.966756
}