{
  "game_id": "401810190",
  "espn_id": "401810190",
  "date": "Dec 04, 2025",
  "matchup": "BKN vs UTAH",
  "headline": "Markkanen scores 30 and the Jazz use a big fourth quarter to beat the Nets 123-110",
  "body": "NEW YORK -- — Lauri Markkanen scored 30 points, Keyonte George had 29 and the Utah Jazz used a huge fourth quarter to beat the Brooklyn Nets 123-110 on Thursday night.\n\n\r\n              The Jazz outscored the Nets 42-20 in the final quarter after trailing by 15 points in the first half. Markkanen and George nearly outscored the Nets by themselves, combining for 18 points.\n\n\r\n              Kyle Filipowski had 15 points and Walter Clayton Jr. added 13 off the bench for Utah, which shot 14 for 22 (63.6%) in the fourth.\n\n\r\n              Noah Clowney scored 29 points and Ziaire Williams had 23 off the bench for Nets, who had their two-game winning streak snapped.\n\n\r\n              With the game tied at 98 with 6:29 remaining, George hit consecutive 3-pointers. Williams answered with a 3 that made it 104-101.\n\n\r\n              On the ensuing possession, Tyrese Martin turned the ball over after stepping out of bounds and Bryce Sensabaugh was fouled on a 3-point attempt and made two free throws to extend the lead 106-101.\n\n\r\n              Filipowski then connected on another 3-pointer and Markkanen followed with one of his own after Clowney's layup with 3:39 to play to make it 112-103.\n\n\r\n              The Nets rested leading scorer Michael Porter Jr. for injury management in the second game of a back-to-back. Porter, who is averaging 25.3 points, scored 33 and had 10 rebounds in Wednesday’s win at Chicago.\n\n\r\n              Up next\r\n              Jazz: Remain in New York to play the Knicks on Friday.\n\n\r\n              Nets: Host the New Orleans Pelicans on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042751.5351481
}