{
  "game_id": "0022301205",
  "espn_id": "401616459",
  "date": "Dec 06, 2023",
  "matchup": "ORL @ CLE",
  "headline": "Paolo Banchero's career-high 42 not enough as Magic lose to Cavs, who get 35 from Donovan Mitchell",
  "body": "CLEVELAND -- — Already a No. 1 in his brief NBA career, Paolo Banchero is now a notable No. 2 for Orlando.\n\n\r\n              Banchero had his best game as a pro, scoring a career-high 42 points on Wednesday night for the Magic in a 121-111 loss to the Cleveland Cavaliers, who got 35 points from Donovan Mitchell and 26 from Darius Garland.\n\n\r\n              The top pick in the 2022 draft, Banchero went 16 of 26 from the field. The 21-year-old became the second youngest player in team history to score 40 points, surpassed by only Shaquille O'Neal, who was 20 when he got 40.\n\n\r\n              “I felt good coming in, but it’s crazy to have 42 points,\" said Banchero, whose previous best was 33 last season against Sacramento. \"It’s an honor being a part of a very storied organization with a lot of great players like the Orlando Magic.\n\n\r\n              \"A game like this gives you some confidence that you can use to become an even better player.”\n\n\r\n              It was another major step for Banchero, who is quickly developing into one of the league's bright young stars.\n\n\r\n              “I loved Paulo’s aggression, his level of confidence, his teammates trusting him,\" said Magic coach Jamahl Mosley. \"He’s willing to do whatever it takes to get the win.”\n\n\r\n              While they struggled to stop Banchero, this was one of the Cavs' best all-around performances in weeks.\n\n\r\n              Although they're 8-3 in their last 11 games, the Cavs have played inconsistently and came in just 4-8 against teams with winning records. They were booed at home last week when they blew a late lead to Portland.\n\n\r\n              Cleveland needed a solid bounce back with a tough schedule ahead — at Miami on Friday and two games in Boston next week — and got one.\n\n\r\n              “It was a step in the right direction for us,” said Cavs forward Max Strus, who had 17 points, six assists and five rebounds. “We kind of grew up a little, figured it out and came together as a team.”\n\n\r\n              The Magic, who fell behind by 23 points in the first half, went just 2 of 23 on 3-pointers, barely extending their streak of making at least one trey to 1,314 games, dating to 2007.\n\n\r\n              The Magic trailed by 18 in the fourth but kept fighting and used a 12-2 run to get within 106-98. That's when Mitchell again found Niang for a 3-pointer and Garland, who didn't have a turnover in 40 minutes, scored on a layup to hold off Orlando.\n\n\r\n              When Garland was asked about his mistake-free night, he pretended he didn't hear the reporter point out his stats.\n\n\r\n              “What did you say?” said Garland, who then broke into laughter.\n\n\r\n              “I was throwing it to the guys in the black jerseys,” he said. “I was just trying to find open guys, just trying to make the right read and make it easy for my teammates and they made shots.”\n\n\r\n              The Magic's visit to Cleveland was one of two games added for the teams that didn't advance beyond the group stage of the NBA's In-Season Tournament.\n\n\r\n              Orlando guard Jalen Suggs left in the second quarter with an injured right ankle.\n\n\r\n              Suggs, who came up limping in the first quarter, went down awkwardly while playing defense. He was on the floor for several minutes before being assisted off and taken directly to Orlando's locker room.\n\n\r\n              Mosley said Suggs would undergo further testing on Thursday.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host Detroit on Friday.\n\n\r\n              Cavaliers: At Miami on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995732.487649
}