{
  "game_id": "0021500285",
  "espn_id": "400828172",
  "date": "Dec 04, 2015",
  "matchup": "MIL @ DET",
  "headline": "Drummond leads Pistons past Bucks 102-95",
  "body": "AUBURN HILLS, Mich. --  Whatever Stan Van Gundy told his team, it seemed to work.\n\nAfter two weeks of mostly indifferent defensive performances, the Detroit Pistons shut down the Milwaukee Bucks in the second half of a 102-95 victory on Friday night.\n\n\"I think we made a step in the right direction today,\" point guard Reggie Jackson said. \"I still want us to play a complete 48 minutes of defense, but for the most part, we did what we wanted to do. They were taking the shots we wanted them to take, not the shots they wanted.\"\n\nJackson scored 23 points in Detroit's third straight win, and Andre Drummond had 17 points and 23 rebounds.\n\nDetroit held Milwaukee to 30 percent (12 for 40) shooting in the second half and 41.5 percent (34 for 82) for the game.\n\n\"We can't keep coming up with empty possessions,\" Bucks coach Jason Kidd said. \"We had it close toward the end, and we came down and didn't score three straight times.\"\n\nMilwaukee closed to 86-80 with two minutes to play, but Marcus Morris grabbed an offensive rebound and former Buck Ersan Ilyasova knocked down a 3-pointer to make it a nine-point game.\n\nDetroit's Greg Monroe had 14 points and 13 rebounds against his former team. Another ex-Piston, Khris Middleton, led the Bucks with 21 points.\n\n\"It was good to be back for the first time, but we came here to win the game,\" Monroe said.\n\nPlaying with a sore back, Morris had 23 points on 7-for-14 shooting. Ilyasova added 13 points and eight rebounds.\n\n\"Marcus can do a lot of things, and I need to create more things for him to do,\" Van Gundy said. \"We thought he was good when we went and got him, but he's better than I thought he was. I didn't realize he was a good a passer as he is, to be honest.\"\n\nThe Pistons never trailed, but weren't able to pull away, either. They finished the first half on an 11-2 run to carry a 51-40 advantage into the break. Detroit hit six 3-pointers in the half, compared to one for the Bucks, and had a 16-6 edge in points off turnovers.\n\n\"I really didn't enjoy the way we finished the half,\" Kidd said. \"This is something that has happened to us before -- we just didn't finish on a good note.\"\n\nDrummond had eight rebounds in the third, giving him 20 for the game. It was his fifth 20-rebound game of the season; the rest of the league has combined for only three.\n\nThe Bucks fouled Drummond, a 37 percent shooter from the line, on back-to-back possessions in the fourth, but both times it was under the basket. He split both pairs, putting Detroit up 78-72, but Kidd waited to the last moment to try to put him back on the line.\n\n\"At the very end, we tried to do it, but the refs didn't call the first one, and we didn't execute the second time,\" he said.\n\nTIP-INS\n\nBucks: Monroe was greeted with a mixture of cheers, boos and cries of \"Moose\" in his first regular-season return to the Palace of Auburn Hills. Monroe played his first five years in Detroit before leaving this summer as a free agent.\n\nPistons: C Aron Baynes played in a mask, one day after undergoing surgery on a broken nose. Baynes broke his nose on Nov. 27 in Oklahoma City, but played with the injury until Thursday's surgery. ... Jackson sported a bandage over his left eye. Jackson was hit above the eye late in Wednesday's overtime win over Phoenix and needed stitches after the game.\n\nUP NEXT\n\nBucks: Host the Knicks on Saturday.\n\nPistons: Host the Lakers on Sunday.\n\nBAYLESS OUT AGAIN\n\nThe Bucks lost Jerryd Bayless to an ankle sprain midway through the third quarter, resulting in more playing time for struggling Michael Carter-Williams. Carter-Williams, Milwaukee's only healthy point guard, finished with six points on 3-of-8 shooting in 26 minutes.\n\nKidd said Greivis Vasquez and Bayless will miss Saturday's game against the Knicks, meaning someone will have to play out of position to relieve Carter-Williams.",
  "source": "espn_api",
  "crawled_at": 1764994085.729825
}