{
  "game_id": "0021600307",
  "espn_id": "400899749",
  "date": "Dec 05, 2016",
  "matchup": "OKC @ ATL",
  "headline": "Westbrook's triple-double leads Thunder past Hawks 102-99",
  "body": "ATLANTA --  At first, Russell Westbrook couldn't get the shots to fall. No problem. He crashed the boards and kept looking for his teammates.\n\nThen, he found his shooting touch.\n\nThe result: another triple-double for the Oklahoma City star.\n\nWestbrook scored 32 points, grabbed 13 rebounds and dished out 12 assists, extending his streak of triple-doubles to six games as the Thunder held off the Atlanta Hawks 102-99 on Monday night.\n\nIt is the NBA's longest such run since Michael Jordan had seven in a row in 1989.\n\n\"I just read the game,\" Westbrook said. \"The game will tell you what to do.\"\n\nWestbrook has sparked a six-game winning streak by the Thunder and reached double figures in all three categories in half of their 22 games.\n\nBy contrast, Jordan had 15 triple-doubles for the entire 1988-89 season.\n\n\"Obviously, the league hasn't seen something like this in a long, long time,\" Thunder coach Billy Donovan said.\n\nWestbrook kept his streak alive with plenty of time to spare. He had 15 points and 11 rebounds when he picked up his 10th assist with 6:20 left in the third quarter. Scooping up a loose ball after a turnover by the Hawks, Westbrook led a 2-on-1 that ended with a pass to Victor Oladipo for a layup that gave the Thunder a 69-59 lead.\n\n\"My job is to find those guys,\" Westbrook said.\n\nHe found his range in the third quarter after missing eight of his first nine shots. Westbrook knocked down five of seven, three of them beyond the arc, and finished with 16 points in the period as the Thunder stretched a one-point halftime lead to 83-69 heading to the fourth.\n\nAtlanta rallied down the stretch, but Westbrook closed it out for the Thunder. He finished with 27 second-half points to send the Hawks to their seventh straight loss and 10th defeat in the last 11 games.\n\nIt's the longest losing streak for the Hawks since they dropped eight in a row in February 2014.\n\nCoach Mike Budenholzer decided to shake things up, sending Kyle Korver to the bench and putting Thabo Sefolosha in the starting lineup. The Hawks also were bolstered by the return of Paul Millsap, who had missed three straight games with a sore hip. He led five players in double figures with 24 points.\n\nIt didn't matter. Westbrook made sure of that.\n\n\"He can do so many different things,\" said Sefolosha, who was often matched on Westbrook. \"It's definitely mind-blowing. And the way he does it. He's everywhere.\"\n\nAtlanta had a shot to send the game to overtime after Korver forced a jump ball.\n\nWestbrook and the Thunder clamped down defensively off the inbounds play, and Tim Hardaway Jr.'s desperation 3-pointer at the buzzer failed to hit the rim.\n\n\"Can't dwell on it,\" Hardaway said. \"I've got to move on to the next play, the next game.\"\n\nKORVER'S NEW ROLE\n\nKorver played more than 31 minutes and seemed to thrive in his new role as a backup.\n\nHe finished with 15 points on 5-of-9 shooting, knocking down three of them beyond the arc. It was his most points in a game since Nov. 22.\n\nKorver had averaged 6.6 points over his last seven games, which led to his benching.\n\nMONSTER JAM\n\nOladipo wasn't afraid to take on Dwight Howard in the lane.\n\nDuring the second quarter, the 6-foot-4 Thunder guard drove the baseline and slammed one over Atlanta's 6-11 center, rocking the rim and drawing gasps from the crowd.\n\nOladipo savored the moment, pumping his fists, stomping his feet and posing briefly in the lane even as the Hawks took off the other way.\n\nRECRUITING DWIGHT\n\nDonovan made a recruiting pitch to Howard while coaching at Florida.\n\nDuring his pregame chat with the media, the Oklahoma City coach recounted a visit to Howard and his father at Southwest Atlanta Christian Academy.\n\nDonovan quickly gave up any hope of getting Howard to attend college.\n\n\"All I had to do was watch one AAU game and then I stopped recruiting him immediately,\" he quipped.\n\nHoward, of course, went straight from high school to the NBA in the days before the rules required at least one year of college. He was the first overall pick by the Orlando Magic in 2004.\n\nUP NEXT\n\nThunder: Off until Friday, when they host the Houston Rockets.\n\nHawks: Back in action Wednesday when the Miami Heat visit Philips Arena.\n\n---\n\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 . His work can be found at http://bigstory.ap.org/content/paul-newberry .",
  "source": "espn_api",
  "crawled_at": 1764995314.838646
}