{
  "game_id": "0022400376",
  "espn_id": "401704942",
  "date": "Dec 21, 2024",
  "matchup": "LAL @ SAC",
  "headline": "James scores 32, Lakers sweep 2-game set against Kings with 103-99 win",
  "body": "SACRAMENTO, Calif. -- — LeBron James had 32 points and the Los Angeles Lakers beat the Sacramento Kings 103-99 to sweep a two-game set on Saturday.\n\n\r\n              Trailing 101-99 with 12 seconds left, the Kings had a chance to tie after Anthony Davis missed two free throws but squandered the opportunity after they couldn't secure the rebound. Austin Reaves was fouled and made both free throws to put the game away.\n\n\r\n              Reaves finished with 16 points, and Davis had 10 points and 15 rebounds as the Lakers completed the sweep after beating the Kings 113-100 on Thursday.\n\n\r\n              De'Aaron Fox led Sacramento with 31 points. Domantas Sabonis had 19 points and 19 rebounds, and DeMar DeRozan added 12 points for the Kings.\n\n\r\n              Davis earned his 642nd block and passed Kobe Bryant for the fifth most in franchise history. \n\n\r\n              Takeaways \r\n              Lakers: Los Angeles turned the ball over 10 times in the first quarter but only turned it over four times in the remaining three quarters. \n\n\r\n              Kings: Head coach Mike Brown hoped to see fewer turnovers and fouls from his team, but Sacramento opened the game with a bad pass and a shooting foul on James. The Kings racked up four turnovers in the first five minutes, but when the Lakers started turning it over as well, Sacramento capitalized.\n\n\r\n              Key moment\r\n              After Davis missed the second free throw, Rui Hachimura tipped the ball back to Davis who quickly dumped it to Reaves, forcing the Kings to foul.\n\n\r\n              Key stat\r\n              Both teams shot under 30% from 3, but Sacramento (27%) had the slight edge over Los Angeles (25.7%).\n\n\r\n              Up next\r\n              The Lakers will host the Pistons on Monday, and the Kings will face the Pacers on short rest Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997194.5724149
}