{
  "game_id": "0022200250",
  "espn_id": "401468405",
  "date": "Nov 21, 2022",
  "matchup": "CHI vs. BOS",
  "headline": "DeRozan scores 28 as Bulls stop Celtics' 9-game win streak",
  "body": "CHICAGO -- — Zach LaVine was back where he wanted to be, on the court and helping the Bulls get a win they sorely needed.\n\n\r\n              Even better, it came against the team with the NBA's best record.\n\n\r\n              LaVine scored 22 points, DeMar DeRozan had 28 and Chicago stopped Boston’s nine-game win streak, beating the Celtics 121-107 on Monday night.\n\n\r\n              Patrick Williams scored a season-high 17, and the Bulls made it look rather easy against a team that's 13-4. They led by 13 at halftime, got it up to 21 in the third quarter and withstood a push to come away with the win after dropping four straight and five of six.\n\n\r\n              How important was the victory for the Bulls?\n\n\r\n              “Big time,” LaVine said. “We've lost a lot in a row and they've won a lot in a row. I think we're a really good team, but we go through little lapses or times where we play bad. That's how fast the game can change.\"\n\n\r\n              LaVine was coming off what might have been the worst performance of his career. The two-time All-Star was 1 of 14 with four points against Orlando on Friday and got benched for the final 3:43.\n\n\r\n              “Everybody has a career-worst night,” LaVine said. “Everybody in the NBA has. I guess that was my night.”\n\n\r\n              Against Boston, he was 8 of 20 from the field, but made five 3-pointers. He also scored nine in the fourth quarter.\n\n\r\n              DeRozan, who scored 41 in the previous game, had eight in a span of just over a minute late in the third. He also spun and fed Alex Caruso for a reverse layup that made it 116-101 with just under three minutes left in the game.\n\n\r\n              Jayson Tatum led Boston with 28 points. Jaylen Brown scored 25, and Malcolm Brogdon finished with 23 points, nailing 5 of 6 3-pointers.\n\n\r\n              “Just kind of a slow start for whatever reason and we should have known a little bit better that they haven't great recently,” Tatum said. “They were — not desperate — but they came out and played like they really wanted to win.”\n\n\r\n              TAKING CONTROL\n\n\r\n              The Bulls, who went a combined 2-21 against the top four teams in each conference last season, are 2-1 against the Celtics. \n\n\r\n              They led 46-31 in the second quarter after Coby White hit a 3 to cap a 15-2 run and were up 63-50 at halftime. \n\n\r\n              LaVine hit a 3 early in the third to make it 74-53. It was a 19-point game before Brogdon made a 3 in the closing seconds to start an 11-0 run. But the Celtics never got closer than eight in the fourth.\n\n\r\n              “Today, we came out from the get-go, we played well,” LaVine said. “We're not gonna play a perfect game. There are going to be swings in the game. We responded when they had their run.”\n\n\r\n              TIP-INS\n\n\r\n              Celtics: G Marcus Smart (right ankle inflammation) was available after missing the previous two games. Interim coach Joe Mazzulla said the Celtics will manage if Smart — the reigning Defensive Player of the Year — has to sit out games every now and then. “I trust his work ethic, his ability to stay healthy,” he said. “If it swells up, then he'll do what's best for the team. I trust that.” ... The Celtics attempted 22 shots in the first quarter and 17 were 3-pointers. They made five from beyond the arc and six field goals in all in the period, as Chicago grabbed a 28-23 lead.\n\n\r\n              Bulls: Coach Billy Donovan said White (bruised left quad) needs to rebuild his endurance before he is ready to play long stretches. He played 4:20 against Orlando on Friday following an eight-game absence. “He's a really, really good worker,” Donovan said. “His conditioning is probably not nearly what it was before the injury. But I think that he'll get back relatively quickly with the way he works.” \n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Dallas on Wednesday.\n\n\r\n              Bulls: Visit Milwaukee on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994510.025342
}