{
  "game_id": "0021800468",
  "espn_id": "401071149",
  "date": "Dec 20, 2018",
  "matchup": "DAL @ LAC",
  "headline": "Clippers snap 4-game losing streak by holding off Mavericks",
  "body": "LOS ANGELES --  Lou Williams' return from injury provided a much-needed lift for the Los Angeles Clippers.\n\nThe 6-foot-1 guard, who missed the past four games due to a sore left hamstring, scored 13 of his 26 points during the fourth quarter to help the Clippers hold off the Dallas Mavericks 125-121 on Thursday night and snap a four-game losing streak.\n\n\"It was a good game for me,\" Williams said. \"It's good to get a win. We've had a rough stretch of games and it is good to move forward.\"\n\nMaxi Kieber's jumper put the Mavericks up 109-104 with 5:14 remaining before the Clippers regained control with a 15-2 run. Danilo Gallinari, who led the Clippers with 32 points, had nine points during the rally and Williams made a pair of free throws with 3:08 remaining to give the Clippers a 113-111 lead, which they wouldn't relinquish. That was part of 12 straight Los Angeles points that gave the Clippers an eight-point lead with 1:02 remaining.\n\nDallas, which has dropped its last four, made a late run to get within 123-121 but Tobias Harris made a pair of free throws to ice it.\n\n\"Lou was fantastic. Early on I thought his passing was fantastic and then he started the scoring barrage down the stretch,\" Clippers coach Doc Rivers said. \"He gives us a confidence when you have him on the floor. It's not necessarily you are going to go to him but he is going to be involved.\"\n\nRookie Luka Doncic scored a season-high 32 points for the Mavericks and JJ Barea added 19. DeAndre Jordan had 11 points and 22 rebounds in his first game back at Staples Center against his former team.\n\n\"He was great. He made a lot of plays and made a lot of shots,\" Dallas coach Rick Carlisle said of Doncic. \"He got to the free throw line a lot. An awful lot (9 of 13). He made a lot of good things happen.\"\n\nDallas trailed 89-82 at the start of the fourth quarter before scoring eight straight points to take the lead, with six coming from Devin Harris. That would be the first of six lead changes and four ties over the final 10 minutes.\n\nLos Angeles led 32-30 early in the second quarter before scoring seven straight points. The Clippers would lead by as many as 13 late in the quarter before going to halftime up 65-54.\n\nDallas trailed 69-58 less than three minutes into the third quarter before it started to steadily whittle down the deficit. Doncic scored six points during an 8-1 run that got the Mavericks within four. Devin Harris' layup with 1:14 remaining drew the Mavericks within 85-82 before the Clippers scored the final four points of the quarter.\n\nTIP-INS\n\nMavericks: G Dennis Smith Jr. (right wrist sprain) missed his eighth game. ... Doncic has scored 20 or more points in 16 games this season. ... Harrison Barnes scored 14 of his 16 points in the first half. ... Harris added 13 points.\n\nClippers: Los Angeles had its second-best shooting game of the season, making 56.6 percent from the field (47 of 83). It made 59 percent against New Orleans on Dec. 3. . ... Montrezl Harrell scored 14 of his 18 points in the first half. ... Harris had 16 points and nine rebounds. He made all eight of his free-throw attempts.\n\nJORDAN'S RETURN\n\nThe Clippers played a video thanking Jordan for his 10 seasons with the franchise during the first timeout.\n\nIt was Jordan's third game in Staples Center this season, but this was the first time it came against his former club. Jordan, who opted out of his contract with the Clippers during the offseason and signed a one-year deal with Dallas, holds the Clippers' record for most games played, field goal percentage, rebounds and blocked shots.\n\n\"I wish we won the game, but it was fun to be back in front of Clippers fans,\" Jordan said. \"I watched a little bit of the video. I thought it was great. I really appreciate those guys doing that.\"\n\nRivers said that he hopes the franchise eventually retires Jordan's jersey.\n\n\"It all started with him. When you think of the LA Clippers you think of DeAndre,\" Rivers said.\n\nUP NEXT\n\nMavericks: Visit Golden State on Saturday. Dallas won the first meeting 112-109 on Nov. 17.\n\nClippers: Host Denver on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995461.985489
}