{
  "game_id": "0021800694",
  "espn_id": "401071370",
  "date": "Jan 21, 2019",
  "matchup": "MIL vs. DAL",
  "headline": "Antetokounmpo has 31 points as Bucks beat Mavericks 116-106",
  "body": "MILWAUKEE --  Giannis Antetokounmpo led the Bucks' offense as usual Monday, with a little help from Brook Lopez's blossoming long-range shooting.\n\nOn the other end of the floor, Lopez helped Milwaukee clamp down in a Martin Luther King Jr. Day matinee.\n\nAntetokounmpo had 31 points and 15 rebounds, Lopez had five blocks and 10 rebounds, and the Bucks beat the Dallas Mavericks 116-106.\n\n\"We have a lot of firepower offensively,\" Lopez said. \"But we definitely make our money and get our bread on the defensive end. That's what really identifies this team.\"\n\nLopez has 11 blocked shots in the past two games.\n\n\"His reads and his decision-making defensively are really, really good,\" Bucks coach Mike Budenholzer said. \"He's just getting better and better as the season goes on. He's getting more aggressive.\"\n\nMilwaukee has won five straight and 12 of 14 to improve to 34-12 overall. Eric Bledsoe added 21 points, and Malcolm Brogdon had 19. The 7-foot Lopez added four 3-pointers\n\nLuka Doncic had 18 points, 11 rebounds and 10 assists for Dallas, which has lost four in a row. Jalen Brunson had 16 points.\n\nDoncic, a rookie, had his first career triple-double despite making just 6 of 17 shots.\n\n\"I didn't play good at all,\" Doncic said. \"I missed some shots that I shouldn't miss.\"\n\nAfter trailing at the half, the Bucks built a double-digit lead in the third quarter and led 92-84 heading to the fourth. The game turned late in the third quarter when the Mavericks' Dwight Powell was ejected after being whistled for a pair of technical fouls following Sterling Brown's corner 3-pointer. Brogdon made both technical foul shots to give Milwaukee a nine-point lead.\n\nPowell thought he was held while going for a rebound, which prompted the outburst, Dallas coach Rick Carlisle said.\n\n\"He talked to me and the team about it and he's very sorry that he got thrown out,\" Carlisle said. \"In a game like this, you need all your guys, especially a mobile big man.\"\n\nTIP-INS\n\nMavericks: Carlisle called a timeout one minute into the game after Dallas fell behind 4-0. ... DeAndre Jordan started after spraining his left ankle in Saturday night's game against Indiana and only taking part in the walkthrough portion of Sunday's practice.\n\nBucks: Brogdon delivered brief on-court remarks about Martin Luther King prior to tip-off. ... Lopez blocked three shots in the first quarter after rejecting four first-quarter shots against Orlando on Saturday. ... Milwaukee recalled Christian Wood from the Wisconsin Herd of the G League. On Saturday, Wood scored 24 points and pulled down a Herd franchise-record 23 rebounds.\n\nHEY BROTHER\n\nAntetokounmpo suited up against his younger brother, Kostas, for the first time in the NBA. Kostas is with Dallas on a two-way contract and joined the Mavericks on this road trip after spending most of the season in the G League. Kostas was on the bench but did not play. \"I had mixed feelings when he was doing something good,\" Kostas said about watching his brother.\n\nSMITH RETURNING\n\nThe Mavs will be rejoined by guard Dennis Smith Jr. on Tuesday when they host the Los Angeles Clippers. Smith didn't play Monday, his sixth consecutive game missed and the 16th time he hasn't played in Dallas' last 24 contests. Smith and Carlisle spoke Sunday, and from there it was revealed that Smith, who has been a rumored trade possibility, will resume workouts.\n\nNOWITZKI FAREWELL\n\nIt's possible that Dallas' Dirk Nowitzki, who was drafted by the Bucks in 1998, made his final trip to Milwaukee as a player. Milwaukee traded Nowitzki in a prearranged draft-night deal -- the Bucks talked Dallas into taking Robert Traylor with the No. 6 pick on their behalf, then took Nowitzki for the Mavs three spots later. A 13-time All-Star, Nowitzki has played at Milwaukee 16 times in his career but didn't appear Monday. It's unclear if Nowitzki will play next season.\n\n\"He is one of the most incredible players,\" Budenholzer said. \"He's created more nightmares for game plans. He's just a great humble, normal, hard-working guy.\"\n\nUP NEXT\n\nMavericks: Host the Los Angeles Clippers on Tuesday night.\n\nBucks: Host Charlotte on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994482.579277
}