{
  "game_id": "0022200686",
  "espn_id": "401468841",
  "date": "Jan 20, 2023",
  "matchup": "MIA @ DAL",
  "headline": "Doncic scores 34, Mavs get defensive in 115-90 win over Heat",
  "body": "DALLAS -- — Luka Doncic had 34 points and 12 rebounds, and the Dallas Mavericks turned up the defensive intensity in a 115-90 victory over the Miami Heat on Friday night.\n\n\r\n              The Mavericks were without No. 2 scorer Christian Wood, who missed the first of what will be multiple games with a broken left thumb. \n\n\r\n              They responded two nights after blistering criticism of their defense from coach Jason Kidd by holding the Heat to 33% shooting in the first and third quarters combined while outscoring Miami 63-35. \n\n\r\n              Dallas gave up 40 points in the first quarter of a 130-122 loss to Atlanta, a third consecutive defeat in which the Mavs allowed at least 130 points. Miami's total was a season low for a Mavericks opponent.\n\n\r\n              “It wasn’t me calling them out or saying we had a walkthrough, shootaround during the game against Atlanta,” Kidd said. “I just think you could see they were flying around. So now we’ve got to hold them to that standard.”\n\n\r\n              Victor Oladipo scored 20 points and Bam Adebayo had 18 points and 11 rebounds for the Heat, who came to Dallas on a 4-1 roll that had them a season-high four games over .500.\n\n\r\n              Spencer Dinwiddie scored 19 for the Mavericks, and Reggie Bullock added 15 on 5-of-6 shooting from 3-point range. Doncic was 5 of 8 from deep as the Mavericks finished at 47% (18 of 38).\n\n\r\n              Miami cut a 17-point first-half deficit to six early in the third quarter but ended up getting outscored 32-16 in the period while shooting just 32%. Dallas led 92-67 after three.\n\n\r\n              “I don’t think we brought a great motor and level of detail to our offense,” Heat coach Erik Spoelstra said. “And I know that was a big point of emphasis for them to really get after us. They’d been giving up a lot of points, so you knew you were going to get their best defensive effort.”\n\n\r\n              Doncic capped the solid defensive first quarter for Dallas with a 3-pointer at the buzzer for a 31-19 lead. The NBA scoring leader had matching 11-point totals in the first and third. \n\n\r\n              TIP-INS\n\n\r\n              Heat: It was the last road game of the season against a Western Conference team. The Heat dropped to 15-9 against the West, including 7-7 on the road with a victory over San Antonio in Mexico City. ... Tyler Herro had 16 points but a game-high four turnovers. ... Jimmy Butler was limited to seven shots and scored 12 points. \n\n\r\n              Mavericks: Dorian Finney-Smith scored 10 points before getting into foul trouble in his second game after missing 14 with a right adductor strain. He picked up his fifth foul late in the third quarter. ... It was also the second game back for Josh Green after missing 20 with a right elbow sprain. He scored 12, including an alley-oop dunk on Doncic's seventh and final assist in the fourth quarter. \n\n\r\n              3-POINT SURGE\n\n\r\n              Bullock is 19 of 29 from 3-point territory (66%) over his past four games to bring his season percentage up from 31%, the lowest since his rookie season in 2013-14, to 36%. The current percentage is almost exactly where he was in 2021-22 in helping Dallas reach the Western Conference finals.\n\n\r\n              “Just continue to just keep believing in my shot,” Bullock said. “I believe in the work that I continue to keep putting in. It was a very slow start for me, but the organization, the team, every day they're telling me, ‘Shoot the ball, shoot the ball.’\" \n\n\r\n              UP NEXT\n\n\r\n              Heat: At home against New Orleans on Sunday for the second meeting in five days. Miami ended the Pelicans' 32-game streak of scoring at least 100 points in a 124-98 victory Wednesday.\n\n\r\n              Mavericks: The Clippers visit Sunday two weeks after Los Angeles won 113-101 at home in the first meeting of the season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993955.491127
}