{
  "game_id": "0022300369",
  "espn_id": "401584997",
  "date": "Dec 20, 2023",
  "matchup": "TOR vs. DEN",
  "headline": "Jokic has 31 points and 15 boards, Nuggets beat Raptors 113-104 for 5th win in 6 games",
  "body": "TORONTO -- — Nikola Jokic had 31 points and 15 rebounds, Canadian guard Jamal Murray scored 20 points in his only regular season appearance north of the border and the Denver Nuggets beat the Toronto Raptors 113-104 on Wednesday night.\n\n\r\n              Aaron Gordon and Michael Porter Jr. each scored 12 points and Peyton Watson had 11 as Denver won for the fifth time in six games.\n\n\r\n              “It wasn’t the prettiest of second halves but we’re .500 on the road now,” Nuggets coach Michael Malone said.\n\n\r\n              The Nuggets won their third straight away from home and evened their road record at 8-8.\n\n\r\n              “Our offense has been a lot more efficient (in road games),” Malone said. “We’re getting back to playing our style of basketball.”\n\n\r\n              By topping 30 points against Toronto for the first time, Jokic has scored 30 or more against every NBA opponent. He shot 13 for 23 and had six assists Wednesday, including a behind-the-back dish to Gordon in the first quarter.\n\n\r\n              “If you’re going to play on our team, you’d better be expecting the basketball because if you’re open, the ball will definitely find you,” Malone said. “Some of our young guys find that out the hard way.”\n\n\r\n              Raptors head coach Darko Rajakovic, who knows Jokic from working together with the Serbian national team, praised his countryman for recording his 400th career double-double and his NBA-leading 24th of the season.\n\n\r\n              “That’s Nikola Jokic,” Rajakovic said. “It’s nothing new in this league, it’s happening every single night.”\n\n\r\n              Jokic said he was at Rajakovic’s home on Tuesday to celebrate a Serbian holiday.\n\n\r\n              Murray shot 9 for 22 and matched Jokic with six assists, winning in Canada for the first time since Dec. 2018. The Raptors honored Murray’s contributions to Canadian basketball with a video tribute during a stoppage in the second quarter.\n\n\r\n              “I appreciate Toronto for having me on the screen like that,” Murray said. “Little stuff like that means a lot. Obviously it’s good to come here and try to put on a show for my family and friends.”\n\n\r\n              Jokic said Murray wasn’t the only one who felt pressure to perform for the Toronto fans.\n\n\r\n              “It’s not just him,” Jokic said. “There’s a Serbian population here, so I’m kind of glad that we won the game.”\n\n\r\n              Scottie Barnes had 30 points, two shy of his career-high, and 10 rebounds for Toronto. Pascal Siakam added 18 points for the Raptors. \n\n\r\n              Toronto came in having won five of seven home meetings with the Nuggets. In their most recent home matchup on March 14, the Raptors used a franchise-record 49-point first quarter to win 125-110, but they couldn’t duplicate that feat Wednesday.\n\n\r\n              Toronto fell behind by 21 before cutting the gap to five, 96-91, on a 3-pointer by Precious Achiuwa with 6:06 left in the fourth, but that was as close as the Raptors got. Jokic iced the win by scoring nine points down the stretch.\n\n\r\n              “That game got more interesting than it should have,” Malone said.\n\n\r\n              Toronto finished with 26 assists, ending a franchise-record five-game streak with 30 or more assists.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Visit Brooklyn Friday night.\n\n\r\n              Raptors: Visit Philadelphia on Friday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995437.382904
}