{
  "game_id": "0021500875",
  "espn_id": "400828762",
  "date": "Feb 27, 2016",
  "matchup": "MEM @ PHX",
  "headline": "Suns snap 13-game skid with 111-106 win over Grizzlies",
  "body": "PHOENIX --  For the first time in 34 days, the Phoenix Suns were winners.\n\nAlex Len had 22 points and 16 rebounds, and the Suns snapped a 13-game losing streak with a 111-106 victory over the Memphis Grizzlies on Saturday night.\n\nMirza Teletovic added 18 points, P.J. Tucker scored 17 and Devin Booker 15 for the Suns, who won for just the third time in 31 games and gave interim coach Earl Watson his first victory in his 10th try.\n\nZach Randolph and Mike Conley scored 19 apiece for the Grizzlies, who had won 13 of 17 and were coming off a 112-95 victory over the Lakers in Los Angeles on Friday night.\n\nThe Suns had Len and Tyson Chandler, both 7-foot-1, in the starting lineup, and Phoenix outrebounded Memphis 56-34. Chandler had 12 rebounds and Tucker 11.\n\nThe 13-game losing streak had tied for the longest skid in a single season in Suns history, and Saturday night's win prevented a winless February for Phoenix.\n\n\"It's just one win,\" Watson said. \"It's not a celebration, it's not a championship, it's not a major leap in the right direction. It's one step forward.\"\n\nThe victory followed two particularly difficult losses for the Suns, a 40-point blowout against the Clippers in Los Angeles and a home defeat to lowly Brooklyn.\n\n\"It was tough, especially after those two big losses to the Clippers and the Nets,\" Len said. \"Bad, bad losses. But we kept our heads up and we kept fighting.\"\n\nTucker made sure he got the game ball and gave it to Watson.\n\n\"Because he's been working hard, man,\" Tucker said. \"He really cares. It's a tough situation, not one you would want to wish anybody, especially for their first time being a head coach.\"\n\nThe Suns, who hadn't beaten the Grizzlies in two seasons, led nearly the entire game.\n\n\"When you are playing against a young team with pretty much nothing to lose, you are giving them confidence early in the game,\" Conley said. \"They start playing at a much higher level and they start making plays. ... It is frustrating. It is frustrating knowing that we felt like we were rolling (coming into the game). We still feel like we are rolling and playing good basketball, and for us to come out and not play our best. ...\"\n\nPhoenix was up by as many as 12 in the second half and was ahead 102-91 after Chris Andersen was called for goaltending on Archie Goodwin's layup with 4:26 to play. But Randolph made a short hook and Conley sank a 3-pointer to cut the lead to 102-96 with 2:46 left.\n\nLen responded with a 15-footer and Conley made a pair of free throws to make it 104-98 with 2:06 to play.\n\nNobody scored for the next minute before Len slammed home a rebound, putting Phoenix ahead 106-98 with 1:05 remaining. Vince Carter's 3-pointer sliced the lead to 106-101 with a minute to go before the Suns sealed it at the foul line.\n\nThe Grizzlies led just twice, the last time after a 12-3 run put them ahead 32-31 on Matt Barnes' 23-footer with 7:11 left in the first half. But the Suns outscored Memphis 16-7 over the next 3:55, with Booker's fast-break layup putting Phoenix up 47-39 with 3:16 left in the half. The Suns led 54-46 at the break.\n\n\"They were ready to play,\" Memphis coach David Joerger said. \"I thought they played with a lot more focus than we did. We gave up 15 offensive rebounds again, 12 3s.\"\n\nTIP-INS\n\nGrizzlies: Brandan Wright left with a right knee injury with 11:05 remaining in the third quarter. ... Memphis had won the last eight meetings. Its last lost to Phoenix was on Feb. 5, 2013. ... The Grizzlies beat the Suns in Memphis 95-93 on Dec. 6 on Jeff Green's dunk on an alley-oop pass just before the final buzzer. ... Memphis is 8-4 in the second of back-to-back games.\n\nSuns: Phoenix led after three quarters for the first time in 10 games. ... The Suns started their 18th different lineup this season. ... The Suns lost 13 straight to start the 1996-97 season.\n\nUP NEXT\n\nThe Grizzlies play at Denver on Monday.\n\nThe Suns play at Charlotte on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994430.7330189
}