{
  "game_id": "0021900766",
  "espn_id": "401161408",
  "date": "Feb 06, 2020",
  "matchup": "MIL vs. PHI",
  "headline": "Antetokounmpo shines as Bucks defeat 76ers 112-101",
  "body": "MILWAUKEE --  Giannis Antetokounmpo believes the Milwaukee Bucks did the right thing by standing pat at the trade deadline.\n\nThe reigning league MVP and his teammates kept rolling Thursday night.\n\nAntetokounmpo had 36 points and 20 rebounds in a 112-101 victory over the struggling Philadelphia 76ers.\n\nMilwaukee did not make a move at the deadline, preferring to stick with the team that has put up a league-best 44-7 record and is on pace to become the third team in league history to win 70 games.\n\n\"I think a lot of teams are getting players so they can play against us, so they can guard us better,\" Antetokounmpo said. \"But I think we're the best team in the NBA; we have the best record in the NBA.\n\n\"For me, I think there should not be any change. Thank God there wasn't. I think the guys we have, the chemistry we have on the team is amazing right now. The guys we have are playing great. These are the guys I've been going to war with all season and I'm happy we have the same team.\"\n\nMilwaukee's swarming defense stymied the 76ers and their all-star center Joel Embiid.\n\nPhiladelphia shot just 37.4% from the field (37 of 99) and Embiid was 6 of 26 while contributing 19 points and 11 rebounds in 33 minutes.\n\n\"Tonight I missed a lot of wide-open looks,\" said Embiid, who was 3 of 10 from 3-point distance. \"We came into the game with a plan of shooting a lot of 3s, especially with the way they guard us. I'm proud of my teammates. I felt tonight, compared to the previous games, we competed.\"\n\nThe Bucks won for the 12th time in 13 games, avenging a lopsided Christmas Day loss to the Sixers in Philadelphia. The Sixers closed out an 0-4 road swing that also included losses to Atlanta, Boston and Miami.\n\nBucks forward Khris Middleton, limited to four points in the first half, finished with 20 points and seven rebounds, and point guard Eric Bledsoe added 14 points, eight rebounds and six assists.\n\nTobias Harris led Philadelphia (31-21) with 25 points, and Ben Simmons narrowly missed a triple-double with 11 points, 14 rebounds and nine assists.\n\n\"I don't think they had much of the rhythm they wanted to,\" Middleton said. \"I think we did a great job playing physical and not fouling.\"\n\nAntetokounmpo had 30-plus points and 15-plus rebounds for the fifth straight game and the 14th time this season. He became just the fifth player in franchise history to record a 30-20 game and the first since Vin Baker in Feb. 1996.\n\nHe also became the first player in the NBA to have five straight 30-15 games since the 1985-86 season.\n\n\"It's crazy,\" Antetokounmpo said. \"I'm happy that we're winning and we're playing good. But I can get a lot better. I can be smarter; I can be sharper. I can make better passes on time, make 3-point shots and 2-point shots. That's the mindset I have.\"\n\nCenter Brook Lopez was in early foul trouble for the Bucks, but twin brother Robin filled in with nine points in 20 minutes while effectively guarding Embiid.\n\nMilwaukee, ranked No. 1 in the league in defense, held an opponent to under 40% shooting for the 22nd time this season, a league high.\n\n\"The defense stood out to me tonight, both the activity and the length,\" Bucks coach Mike Budenholzer said. \"Both teams are long and athletic, but I think we controlled the paint and controlled the boards. If we can get to the 3-point line, maybe we could shut somebody out.\"\n\nMilwaukee held the Sixers to 30 points in the paint and had a 60-50 rebounding advantage.\n\nAntetokounmpo had 19 points and 10 rebounds in the first half to help the Bucks to a 54-51 lead at intermission.\n\nEmbiid was 1 for 10 from the field and had four points, while Harris led the Sixers with 12 points.\n\nThe Bucks outscored the Sixers, 32-23, in the third quarter, helped by eight points each from Antetokounmpo and Middleton. Milwaukee led by as many a 17 points in the final quarter.\n\nTEAM GIANNIS\n\nAntetokounmpo and Los Angeles Lakers star LeBron James picked their respective teams for the All-Star Game in Chicago on Feb. 16. Team Giannis includes starters Embiid, Pascal Siakam, Kemba Walker, Trae Young and Antetokounmpo, while Team LeBron has a starting five with James, Anthony Davis, Kawhi Leonard, Luka Doncic and James Harden. Embiid was the Bucks star's opening pick. \"I think he's a cool guy, a great guy in the locker room,\" Antetokounmpo said. Antetokounmpo tabbed Bucks teammate Khris Middleton with his first reserve pick and added Bam Adebayo, Rudy Gobert, Jimmy Butler, Kyle Lowry, Brandon Ingram and Donovan Mitchell.\n\nTIP-INS\n\n76ers: Philadelphia acquired Glenn Robinson III and Alec Burks from Golden State in a trade deadline deal on Thursday, a move made to bolster the team's bench. Philadelphia coach Brett Brown was happy with the additions. \"In Alec, you get somebody that can make plays all by himself and can get to the rim,\" Brown said. \"And Glenn, kind of the two-way player who can make shots and is growing his defense.\" The Sixers also traded James Ennis to Orlando for a 2020 second-round pick to clear one roster spot and waived Trey Burke to clear another. . The Sixers have struggled on the road, going 9-19 while putting a 22-2 record together at home. \"In general, there is a mental toughness that you need to have on the road,\" Brown said. \"At times, we haven't had it to the volume and intensity that we need.\"\n\nBucks: Milwaukee remains on pace to become the third NBA team to win 70 games, which would put the franchise in elite company with the 1995-96 Chicago Bulls (72 wins) and 2015-16 Golden State Warriors (73 wins). Budenholzer has downplayed the 70-victory talk but co-owner Marc Lasry said recently he thinks the Bucks can join that club and win a championship. Asked about it in the pregame session, the Bucks coach said it has not been a topic in the locker room. . The Bucks stood pat at the trade deadline while Eastern Conference contender Miami made a key move to land former Warriors super-sub Andre Iguodala. \"I feel really great about our team,\" Budenholzer said. \"We've been even better for the first 50 games than we were last year. The continuity means a lot to us. We've been together for a season and a half, a lot of us. We feel that's an edge we have. Some years you make a trade and some years you don't.\" . George Hill remains out with a left hamstring injury, missing his fourth straight game on Thursday.\n\nUP NEXT\n\nSixers: Host Memphis on Friday night.\n\nBucks: Play at the Orlando Magic on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996135.351913
}