{
  "game_id": "0022200005",
  "espn_id": "401468020",
  "date": "Oct 19, 2022",
  "matchup": "ATL vs. HOU",
  "headline": "Murray, Young lead Hawks past pesky Rockets 117-107",
  "body": "ATLANTA -- — Dejounte Murray and Trae Young hardly looked like they were playing their first game together.\n\n\r\n              Murray had 20 points, 11 assists and five steals in his Atlanta debut Wednesday night, teaming with Young for a tantalizing glimpse of what the Hawks can expect from their new backcourt tandem.\n\n\r\n              “My goal is for me and Trae to make this team better,” Murray said after a 117-107 victory over the pesky Houston Rockets.\n\n\r\n              On the opening night of the season in Atlanta, there were no complaints from the sellout crowd. \n\n\r\n              Murray, an All-Star acquired from San Antonio in the Hawks' biggest move of the offseason, was a bit more critical of the team's performance.\n\n\r\n              Even with four of Atlanta's starters scoring at least 20 points, the Hawks struggled to put away a team that had the NBA's worst record the last two years.\n\n\r\n              \"I feel like the game was too close,\" said Murray, who rated his performance “6 out of 10.”\n\n\r\n              Young had 23 points and 13 assists. For one night, at least, a pair of star point guards showed they can co-exist — and get their teammates involved, for good measure.\n\n\r\n              “The Atlanta Hawks are not me and Trae, but we set the tone,\" Murray said. “We're gonna get better.”\n\n\r\n              Murray became the first player since Spud Webb in 1985 to have a double-double in his Atlanta debut. But his biggest impact may have been at the defensive end, where he's charged with helping the Hawks improve on one of their biggest problems a season ago. \n\n\r\n              The last of his steals came after he knocked down a three-pointer. \n\n\r\n              Murray swiped the ball from Jalen Green and dished off to Onyeka Okongwu for a lay-in that pushed the lead to 102-92 with less than 5 1/2 minutes to go.\n\n\r\n              “We've challenged Trae and all the guys to get better defensively,” Hawks coach Nate McMillan said. “That's the key to the season.”\n\n\r\n              The Rockets were led by Kevin Porter Jr, with 21 points, two days after he signed an $82.5 million, four-year contract extension to help lead Houston's major rebuilding project.\n\n\r\n              John Collins, who was the subject of incessant trade speculation during the offseason, led the Hawks with 24 points. De’Andre Hunter, his future in Atlanta solidified by a $95 million, four-year extension, chipped in with 22 points.\n\n\r\n              The Hawks are hoping to recapture the form that carried them to the Eastern Conference final in 2021.\n\n\r\n              Atlanta slipped to ninth in the East a season ago and needed to win two play-in games just to qualify for the postseason. The Hawks didn't last long in the playoffs, going down in five games to top seed Miami.\n\n\r\n              The Rockets, who had the NBA’s worst record the last two seasons, sent out a youthful lineup that included No. 3 overall pick Jabari Smith Jr. \n\n\r\n              The former Auburn star had 17 points and seven rebounds in a promising NBA debut.\n\n\r\n              “We were disjointed a little bit,” Rockets coach Stephen Silas said. ”But I loved our fight, I loved our competitiveness.\"\n\n\r\n              YOUTHFUL ROCKETS\n\n\r\n              Of the 13 players who dressed for Houston, only two had more than three seasons of NBA experience.\n\n\r\n              It showed.\n\n\r\n              “There were multiple times where I sat down and told our assistants, ’Man we’re just so young,'\" Silas said, managing a smile.\n\n\r\n              Most notably, the Rockets had 16 turnovers, which the Hawks turned into 28 points. Houston scored just 13 points off turnovers.\n\n\r\n              “It was the transition points that really hurt us the most,” Silas said. “I'm encouraged, even though we lost.” \n\n\r\n              TIP-INS\n\n\r\n              Rockets: Another first-round pick, Tari Eason, had eight points and seven assists in 15 minutes off the bench. ... Houston outrebounded the Hawks 54-38. ... Daishen Nix (sore back), Jae-Sean Tate (left ankle soreness) and rookie TyTy Washington (left knee sprain) were not available for the start of the regular season.\n\n\r\n              Hawks: The team's two rookies — first-rounder AJ Griffin and second-rounder Tyrese Martin — did not play. ... Atlanta had 30 assists and just nine turnovers. ... G Bogdan Bogdanovic was the only Atlanta player who didn't dress for the opener. He continues to recover from right knee surgery in June.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Return to Houston for their home opener Friday night against the Memphis Grizzlies.\n\n\r\n              Hawks: Host the Orlando Magic on Friday night in the second of three straight home games to begin the season. \n\n\r\n              ------\n\n\r\n              Follow Paul Newberry on Twitter at https://twitter.com/pnewberry1963\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995217.898773
}