{
  "game_id": "0022401032",
  "espn_id": "401705598",
  "date": "Mar 23, 2025",
  "matchup": "CHA @ MIA",
  "headline": "Wiggins scores 42 points and Heat roll past Hornets 122-105 to snap 10-game losing streak",
  "body": "MIAMI -- — Andrew Wiggins scored 42 points for the second-highest scoring game of his career, Tyler Herro added 29 and the Miami Heat beat the Charlotte Hornets 122-105 on Sunday night to snap a 10-game losing streak.\n\n\r\n              Wiggins had the most points by a Heat player this season — Herro had 40 three times — and finished five shy of his career high of 47, done Nov. 13, 2016, for Minnesota against the Los Angeles Lakers.\n\n\r\n              He'll face his former team, Golden State, on Tuesday for the first time since getting traded to Miami last month.\n\n\r\n              Nick Smith Jr. scored 19 and LaMelo Ball had 18 points and 11 assists for Charlotte, which led by 12 early but were eliminated from postseason contention. The Hornets haven't made the playoffs since 2016 — a seven-game Round 1 loss to Miami.\n\n\r\n              Takeaways\r\n              Hornets: It was the second time this season that Charlotte led a game by at least 12 before getting into a 20-point deficit. The other was Dec. 5 at New York, when the Hornets led by 13 before getting down by 28 and losing 125-101.\n\n\r\n              Heat: Nikola Jovic, who has missed Miami's last 15 games over the last four weeks with a broken bone in his right hand, is awaiting full clearance. “He's doing all the conditioning. He’s doing all the weight room work that he can do,” Heat coach Erik Spoelstra said.\n\n\r\n              Key moment\r\n              Miami closed the half on a 24-4 run, shooting 10 of 14 over the final 7:05 before intermission. Charlotte shot 1 for 12 in that stretch.\n\n\r\n              Key stat\r\n              The 10-game slide tied the sixth-longest in Heat history (with streaks of 17, 15, 13, 12 and 11 ahead of it, and two other 10-game streaks).\n\n\r\n              Up next\r\n              Charlotte hosts Orlando on Tuesday. Miami stays home Tuesday for a matchup against Jimmy Butler and Golden State.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997428.1001868
}