{
  "game_id": "0021900363",
  "espn_id": "401161005",
  "date": "Dec 11, 2019",
  "matchup": "MEM @ PHX",
  "headline": "Brooks, Jackson lead Grizzlies over Suns 115-108",
  "body": "PHOENIX --  Rookie Ja Morant had a quiet game by his standards but found himself on the perimeter with 45 seconds remaining, ball in hand and his Grizzlies clinging to a four-point lead.\n\nThe 6-foot-3 guard dribbled a few times and then blew past Phoenix's 6-foot-10 forward Aron Baynes, who desperately tried to stay in front before Morant elevated and slammed the ball over Baynes' outstretched arms.\n\nThe Memphis bench howled in delight. A tight game was essentially over and the Grizzlies finished with a 115-108 victory over the Suns on Wednesday night.\n\n\"Oh my gosh, I was screaming,\" Memphis guard Dillon Brooks said. \"That's how electric he is. He's a special player -- even if he's having a tough game, he can find a way to electrify. That just put us over the top.\"\n\nBrooks scored 27 points, Jaren Jackson Jr. added 24 and the Grizzlies won two games in a row for the first time in nearly a month. Morant had 13 points, six assists and four rebounds.\n\nJackson shot 10 of 18 from the field, including 3 of 7 from 3-point range, and the Grizzlies improved to 6-0 when Brooks scores at least 20 points.\n\nThe Grizzlies led 84-79 going into the fourth quarter after Jackson scored 11 points in the third and they pushed their advantage to 91-81 early in the fourth quarter. The Suns pulled within 93-90 with 6:37 left, but couldn't get any closer.\n\n\"We were guarding,\" Brooks said. \"We were taking it personal. They beat us at our house, so we wanted to beat them at their crib.\"\n\nBut the game was still in doubt until Morant's poster-worthy dunk. The rookie said the bench was laughing in the aftermath, joking that it took him two months to finally finish a huge slam in a clutch moment.\n\n\"It felt good,\" Morant said. \"I feel like everybody knows that's my game. To go to the rack with force and try to finish the play aggressive and was able to get one tonight.\"\n\nFrank Kaminsky III led the Suns with a season-high 24 points and Ricky Rubio tied a season-high with 22. Kelly Oubre Jr. added 14 points and 13 rebounds. Leading scorer Devin Booker had an off night with just 15 points on 6-of-17 shooting.\n\n\"I think we came in complacent thinking it was going to be easier than it was,\" Booker said. \"They came ready to play and credit them for playing hard, but we have to do better.\"\n\nPhoenix scored the first 11 points of the game but Memphis responded quickly, going on a 25-6 run to take a 27-19 lead by the end of the first quarter. The teams were tied at 51 going into halftime.\n\nKaminsky led the Suns with 15 points in the first half, shooting 6 of 7 from the field, including 3 of 3 from 3-point range. Brooks and Brandon Clarke -- who played high school basketball in Phoenix -- both had 13 for the Grizzlies before the break.\n\nBIG BENCH\n\nThe Grizzlies' got a lot of production from bench players Clarke and De'Anthony Melton. The 6-foot-2 Melton had nine points, six rebounds and three assists and the Grizzlies outscored the Suns by 22 points during the 19 minutes he was on the floor.\n\nGOOD STARTS, NO FINISH\n\nPhoenix started the game on an 11-0 run, the second quarter on a 7-0 run and the third quarter on a 6-0 run. None of that mattered after the loss.\n\n\"That was fool's gold,\" Phoenix coach Monty Williams said of the initial 11-0 start. \"We just didn't have a defensive focus tonight.\"\n\nTIP-INS\n\nGrizzlies: Guard Grayson Allen didn't play because of right ankle soreness. ... Kyle Anderson (heel) played after missing five straight games. He played 12 minutes and finished with three points and four rebounds. ... The Grizzlies improved to 8-16 for the season.\n\nSuns: Starting center Deandre Ayton missed the 23rd of his 25-game suspension for violating the NBA's drug policy. He's eligible to return on Dec. 17 in a road game against the Los Angeles Clippers. ... The Suns fell to 11-13 for the season.\n\nUP NEXT\n\nThe Grizzlies: Return home to face the Bucks on Friday.\n\nThe Suns: Face the Spurs in Mexico City on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995740.997588
}