{
  "game_id": "0022300805",
  "espn_id": "401585433",
  "date": "Feb 23, 2024",
  "matchup": "PHI vs. CLE",
  "headline": "Maxey, Payne lead 76ers past Cleveland, 104-97, send Cavaliers to 3rd loss in 4 games",
  "body": "PHILADELPHIA -- — Tyrese Maxey scored 24 points, Cam Payne added 16 points off the bench and the Philadelphia 76ers beat Cleveland 104-97 Friday night, sending the Cavaliers to their second straight loss and third in four games.\n\n\r\n              Maxey was having a quiet game until the fourth quarter. He scored 15 of the Sixers’ final 20 points and assisted on a 3-pointer by Buddy Heild that put Philadelphia ahead by eight points in the final minute.\n\n\r\n              “I was pretty stinky the first three quarters,” said Maxey, who shot 4 for 13 for nine points heading into the fourth. “If we could hang around and they could give me a chance in the fourth to close it out, I told them I got them.”\n\n\r\n              Maxey was the only member of the Sixers to make more than one basket in the fourth quarter. He also added four rebounds and two assists to a dominant period.\n\n\r\n              “I love his game,” Payne said. “Honestly, it surprised me. I didn’t know he was that good, but he’s a hooper, man.”\n\n\r\n              Payne, acquired from Milwaukee at the trade deadline, saw extended minutes and was a difference-maker, especially in the first half. He shot 6 for 11, making four 3-pointers in 20 minutes, and helped Philadelphia build its largest lead — 11 points — in the third quarter.\n\n\r\n              “The crazy part is, what really got me going was they didn’t count (a layup),” Payne said, about a basket he made at the end of the first quarter that was overturned during a review between quarters. “I was kind of hot about it, but I didn’t know the shot clock had run out.”\n\n\r\n              Tobias Harris added 15 points and nine rebounds, and Heild finished with 13 points.\n\n\r\n              “I thought (Harris) was excellent tonight,” Philadelphia coach Nick Nurse said. “I thought he played really tough. We needed his nine rebounds. … He has to use that athleticism, use that size and go chase the ball down. I thought he did a great job.”\n\n\r\n              Jarrett Allen had 24 points and Darius Garland added 20 points and nine assists for the Cavaliers, who had their six-game road winning streak halted and lost for the fourth time in 22 games. Cleveland, coming off a loss to Orlando on Thursday, was missing leading scorer and All-Star Donovan Mitchell, sidelined with an unspecified illness.\n\n\r\n              The Cavs, who shot 42.5% (34 for 80) from the field and 29.6% (8 for 27) from the line, were the hottest team in the NBA leading up to the All-Star break, building the second-best record in the Eastern Conference.\n\n\r\n              “The first half kind of bit us in the butt a little bit,” Cavs coach J.B. Bickerstaff said. “The ball was a little sticky. We were trying to play in small spaces and trying to create in spaces that weren’t there. That limited our kick outs and our drives — we only had one 3-pointer in the first half that came after we touched the paint.”\n\n\r\n              Garland made three free throws and then stole a pass and fed Max Strus for a layup that pulled Cleveland within three points in the final seconds. But, Maxey hit four free throws down the stretch to seal the win.\n\n\r\n              Kyle Lowry, who made his debut for Philadelphia Thursday, was ruled out against Cleveland before the game because he is attempting to return to competition conditioning. The six-time All-Star scored 11 points in 25 minutes in a loss to the New York Knicks on Thursday.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Washington on Sunday.\n\n\r\n              76ers: Host Milwaukee on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996418.906633
}