{
  "game_id": "0021501213",
  "espn_id": "400829100",
  "date": "Apr 12, 2016",
  "matchup": "DET vs. MIA",
  "headline": "Heat beat Pistons 99-93, pull within win of Southeast title",
  "body": "AUBURN HILLS, Mich. --  The Miami Heat will go into the final day of the regular season with a shot to win the Southeast Division and earn home-court advantage in the first round.\n\nA year after missing the playoffs, they'll take it.\n\nDwyane Wade got off to his slowest start offensively in a decade and finished with 14 points, helping the Heat beat the Detroit Pistons 99-93 on Tuesday night.\n\nMiami will win a division title and become the No. 3 seed in the Eastern Conference if it closes the regular season Wednesday night by beating Boston on the road.\n\nThe Celtics will have something at stake, too, trying to avoid slipping to the sixth spot that would set up a series with the Heat.\n\n\"It comes down to one game,\" Miami coach Erik Spoelstra said. \"And both teams have something to play for.\"\n\nThe Pistons' loss sealed their spot as the eighth-seeded team, setting up a matchup with top-seeded Cleveland.\n\n\"No one is picking us anyway, so we might as well go out there against the best team in the East,\" said Reggie Jackson, who didn't play against Miami. \"Everyone in this room thinks we can win any series, so we're not going to worry about who we play.\"\n\nWade didn't score until there was 4:14 left in the first half. He had not been scoreless that long at the start of a game since March 17, 2006, against Charlotte, according to STATS.\n\n\"I don't like shooting here,\" Wade said from The Palace's cramped visitors' locker room with an ice pack wrapped around his left shoulder.\n\nWade broke his scoreless start with a three-point play and had seven points in a 50-second stretch.\n\n\"Dwyane has that ability to move on from rough segments in a game,\" Spoelstra said.\n\nJoe Johnson scored 25 points, including consecutive 3-pointers to help the Heat take a seven-point lead midway through the fourth. He made another shot from beyond the arc with 46.5 seconds left to put them up by seven again.\n\nWade said when Johnson is on offensively, no one can stop him.\n\n\"I've seen it as a defender, as an opponent,\" Wade said.\n\nMiami's Goran Dragic scored 16 points, Hassan Whiteside had 14 points and nine rebounds while Luol Deng had 17 points and 10 rebounds.\n\n\"Everyone contributed to this win,\" Wade said.\n\nThe Pistons were without Jackson, their leading scorer, because of an abdominal strain.\n\n\"I had a little pull in my side at shootaround and it got worse during the day,\" he said. \"We talked it over, and decided I shouldn't play.\"\n\nPistons coach Stan Van Gundy said it is not expected to be a long-term injury.\n\n\"We don't think this is something that will be a problem for the playoffs,\" he said.\n\nDetroit's Kentavious Caldwell-Pope scored 17 points, Marcus Morris and Tobias Harris each scored 16. Steve Blake scored 10, starting in Jackson's place. Andre Drummond had nine points and 18 rebounds.\n\nTIP-INS:\n\nHeat: Dragic had a tooth jarred loose during the first half by Detroit's Spencer Dinwiddie. Dragic took the tooth and threw it toward Miami's bench. He said it was one of his cosmetic teeth. \"It's the second time that has happened this year and there wasn't a foul called,\" he said. ... Dorrell Wright did not play after returning to the franchise as a free agent earlier in the day, but Spoelstra is glad he'll be on the roster for the postseason. \"He has been in our system, understands the culture,\" Spoelstra said.\n\nPistons: Team owner Tom Gores said it was a \"milestone,\" for the Pistons to make the playoffs, but he said the franchise will not be satisfied with just getting into the postseason. ... Detroit will face Cleveland for the third straight time in the playoffs, and the first time since getting swept in 2009.\n\nUP NEXT\n\nHeat: Play at Boston Wednesday.\n\nPistons: Play at Cleveland Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994889.9875991
}