{
  "game_id": "0021801054",
  "espn_id": "401071727",
  "date": "Mar 18, 2019",
  "matchup": "OKC vs. MIA",
  "headline": "Dragic, Wade lead Heat past Westbrook-less Thunder, 116-107",
  "body": "OKLAHOMA CITY --  The Thunder were foundering without their star point guard, and the Miami Heat -- like Oklahoma City trying to improve their playoff position -- took advantage.\n\nGoran Dragic had 26 points and 11 assists, and Dwyane Wade added 25 points in the Heat's 116-107 win Monday night over the Thunder, who played without the suspended Russell Westbrook.\n\nKelly Olynyk added 18 points and nine rebounds for Miami, which moved within one game of seventh-place Brooklyn in the Eastern Conference. The Heat snapped a six-game losing streak against Oklahoma City, which now has lost nine of its last 13 games to fall to sixth in the Western Conference.\n\n\"We put our track shoes on, put all our pads on and went out there ready for a tough basketball game that has a playoff kind of feel to it,\" said Wade, who played 33 minutes.\n\nPaul George scored 31 points with nine rebounds and Jerami Grant had 27 points and 10 rebounds for Oklahoma City. Dennis Schroder, who started in Westbrook's place, scored 20 points. Steven Adams had 10 points and 12 rebounds but was limited by foul trouble to 25 minutes.\n\nWestbrook picked up his NBA-leading 16th technical foul in a loss to Golden State on Saturday, earning an automatic one-game suspension at a pivotal time for his team. He was not with the team on Monday and thus not inside Chesapeake Energy Arena to watch the Thunder struggle, shooting 43.7 percent and committing 19 turnovers.\n\nWithout Schroder running the second unit, Oklahoma City's bench lacked scoring punch and it showed, as Miami's reserves outscored the Thunder's 67-10. Dragic and Wade both came off the bench for the Heat, and reserve James Johnson had 14 points.\n\n\"The reality is, we're bringing some firepower off the bench,\" Heat coach Erik Spoelstra said. \"Our starters have been tremendous, but it's not going to work in this league all the time. You're not always going to be able to get off to the starts that you want. We're bringing a Hall of Famer off the bench, an All-Star. ... It's not like we're cringing when we go to the bench. It takes a collective effort.\"\n\nThe first half featured wild swings. The Thunder led 13-0 after the Heat missed their first eight shots, but a 17-0 run by Miami's reserves put the Heat ahead before the end of the first quarter. The Heat led 41-29 with 8:12 left in the second quarter, but Oklahoma City pulled within 58-55 by halftime.\n\nMiami rebuilt its lead to 15 points in the third quarter. A dunk by Grant with 11:02 left got the Thunder within 86-79 before a 15-3 run by the Heat ended all doubt. A 3-pointer by Josh Richardson -- who is from the Oklahoma City suburb of Edmond -- put Miami up 101-82 with 7:29 left.\n\n\"They hit some tough shots,\" Schroder said. \"We forced them to shoot non-paint twos and D-Wade and Dragic did a great job tonight. Credit to them.\n\n\"We've just got to keep working every game, try to get better as a team and play together. Especially during tough stretches like we're going through now, we've got to stay together as a team.\"\n\nENJOYING THE DRAMA\n\nSpoelstra acknowledges the Heat's schedule to close the season is difficult, but says his team is \"embracing the competition.\"\n\n\"We all feel alive in there,\" he said. \"It's not just because of the wins, because of the consequences, the pain of a loss and the celebration of getting the job done in a tough place. We know, even without Westbrook -- which is a significant difference, let's be fair about that -- but you still have to take care of business in a place where they don't lose very often. You have to play well and we were able to do that.\"\n\nTIP-INS\n\nHeat: Justise Winslow missed his second straight game with a right thigh bruise suffered Friday against Milwaukee, while Rodney McGruder sat out with left knee soreness. ... Former Thunder player Dion Waiters received louder-than-usual applause as starting lineups were introduced, but Wade received a standing ovation when he entered four minutes into the game. ... Wade's 674 career points vs. the Thunder is his second-highest total against a Western Conference foe, behind only Portland (699).\n\nThunder: Westbrook could earn another one-game suspension for every two technical fouls the rest of the regular season. He's now missed nine games this season because of injury or suspension. ... Backup C Nerlens Noel didn't play because of a left quad contusion. ... Markieff Morris picked up a technical foul with 1:40 left in the third quarter.\n\nUP NEXT\n\nHeat: Continue their four-game trip on Wednesday in San Antonio.\n\nThunder: Host Toronto on Wednesday before visiting the Raptors on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994552.546844
}