{
  "game_id": "0021900596",
  "espn_id": "401161238",
  "date": "Jan 13, 2020",
  "matchup": "SAC vs. ORL",
  "headline": "Gordon's late magic lifts Orlando past Sacramento, 114-112",
  "body": "SACRAMENTO, Calif. --  The Orlando Magic made a pair of costly defensive mistakes in the final 80 seconds. Evan Fournier's quick change of mind and a big shot by Aaron Gordon more than made up for it.\n\nGordon made a three-point play with 1.1 seconds remaining, and the Magic beat the Sacramento Kings 114-112 on Monday night.\n\n\"That's a terrific win,\" Orlando coach Steve Clifford said. \"That to me was more of a win where we fought like hell and made big plays at the end than it was a lot of stuff that you're going to look at and say we're on our way.\"\n\nGordon and Fournier made it possible with their freelancing at the end.\n\nDe'Aaron Fox put the Kings ahead 112-111 with a three-point play with 15 seconds left. After a timeout, Orlando inbounded the ball to Fournier, who went up for a shot at the right elbow before passing down low to Gordon.\n\n\"I got to my spot but I saw two bodies in the air,\" Fournier said. \"I was literally about to shoot and I saw AG and I had to pass it.\"\n\nFacing a double-team and with his back to the basket, Gordon flipped the ball up and in. He was fouled by Cory Joseph and made the ensuing free throw to give the Magic their fifth win in seven games.\n\n\"I was going to rebound. I thought Evan was going to shoot it but he made a great play,\" Gordon said. \"It was a good pass and I just put it on the rim. It went in. Evan did the hard part. He set the whole play up.\"\n\nGordon finished with 19 points and nine rebounds in his return to Orlando's lineup after missing one game with calf tightness. Nikola Vucevic had 26 points and 15 rebounds, and Fournier scored 25 points.\n\nGordon's game-winner came after the Magic blew a pair of defensive assignments down the stretch.\n\n\"What was disappointing is (those) plays are just blown coverages on stuff we covered in detail ad nauseam this morning,\" Clifford said. \"Should have never happened.\"\n\nFox had 31 points, 10 assists and eight rebounds for Sacramento. Nemanja Bjelica set career highs with 34 points and eight 3-pointers.\n\n\"Orlando knocked down shots and made plays down the stretch,\" Kings coach Luke Walton said. \"You don't want to come down to these one-point games because crazy things happen. You have to take care of business before that.\"\n\nFournier struggled with his shot all night but went 12 for 12 on free throws. Orlando was 25 for 30 from the line while Sacramento was 10 of 11.\n\nVucevic and Fournier had 15 points apiece in the first half to offset Bjelica's 22 before the break. Orlando led by eight after the first quarter and was up 65-52 at halftime.\n\nThe Magic were up by 10 midway through the third but went cold, while the Kings heated up.\n\nMarvin Bagley III scored eight straight, Buddy Hield made a 3-pointer and Trevor Ariza followed with a layup to cut Orlando's lead to 86-85.\n\nTIP-INS\n\nMagic: D.J. Augustin had six points after sitting out Friday's loss to Phoenix because of a left knee contusion. It was the first game that Augustin has missed this season. . Vucevic had a double-double before halftime.\n\nKings: Bjelica made his first four shots and was 8 of 9 with a banked-in 3-pointer late in the second quarter. . Richaun Holmes (right shoulder) and Bogdan Bogdanovic (right ankle) were held out.\n\nUP NEXT\n\nMagic: Play the Lakers on Wednesday in the first half of a back-to-back against the Los Angeles teams. Orlando lost to the Lakers in December.\n\nKings: Host the Mavericks on Wednesday. Sacramento won all three games against Dallas last season and beat the Mavericks on the road earlier this season.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995895.376003
}