{
  "game_id": "0021500681",
  "espn_id": "400828568",
  "date": "Jan 26, 2016",
  "matchup": "MIL vs. ORL",
  "headline": "Bucks rally from 16 down, top Magic in Jason Kidd's return from surgery",
  "body": "MILWAUKEE -- Jason Kidd spent a lot of time walking the sideline in his first game back as coach of Milwaukee. It wasn't because he didn't like what he saw, but more because of orders from his doctor.\nThe Bucks gave Kidd a 107-100 victory on Tuesday night over the Orlando Magic in his first game back after having surgery on his right hip Dec. 21. He missed 17 games.\n\"I was told not to sit long, so I had to get up and try to get in shape,\" said Kidd, who added that he felt great and would travel with the team to Memphis for its next game.\nThe Bucks have won four of six. Orlando has lost 11 of 12 since New Year's Day, sliding out of Eastern Conference contention.\nGiannis Antetokounmpo scored 25 points with eight dunks.\n\"I was scrapping, man,\" Antetokounmpo said. \"It feels very good to get the win. It felt great to have Coach back, too.\"\nJerryd Bayless had a pair of 3-pointers in the final 2:20, including a baseline shot with 13 seconds to go that put Milwaukee ahead 103-99. Khris Middleton, who had 25 points, made a pair of free throws with 7 seconds left for a 105-100 lead.\nThe Magic allowed the Bucks to score 62 points in the paint, one night after giving up 70 inside during an 108-102 overtime loss at Memphis.\n\"They did a great job of crowding it,\" Victor Oladipo said. \"They got out on a break, and they got offensive rebounds. They were scrappy. That's why they got a lot of points in the paint.\"\nOrlando coach Scott Skiles said before Tuesday's game that he was pushing his team to play tough defense near the basket, but Antetokounmpo and center Greg Monroe, who had 21 points, were too strong for the Magic.\nOladipo scored 18 points, and Nikola Vucevic added 16 for the Magic.\nThe Bucks had given up 32 3-pointers in losing their previous two games, and Skiles implored his team to get open looks. The strategy worked, with the Magic making 13 of 24 3-pointers.\n\"It turned out that was the only thing that actually kept us in the game,\" Skiles said after the game. \"That was the only way we'd have a chance. If those balls hadn't been going in, as bad as our defense was, this would have been a blowout on the other end.\"\nOladipo's 3-pointer gave the Magic their biggest lead, 48-32, with 5:35 left in the second quarter. Milwaukee ended the half on a 21-8 run to cut the lead to 56-53 at halftime on Middleton's 3-pointer with 16 seconds to go.\nAntetokounmpo scored on a running dunk with 6:39 left in the second quarter, keying a run of 10 consecutive made shots to help the Bucks get back into the game.\nFACETIME FUN\nAntetokounmpo held his phone next to his face while meeting with the media after the game, allowing his brother, Thanasis, to participate by Facetime with a big smile on his face. Thanasis, who plays for the New York Knicks D-League affiliate in Westchester, interjected comments and answered some of the questions that were directed to his brother. \"It's the first time in NBA history that you will have a press conference by Facetime,\" Giannis Antetokounmpo said.\nTIP-INS\nMagic: It was Skiles' first game at the BMO Harris Bradley Center since coaching the Bucks from 2008-2013. He went 162-182 with the Bucks and said before Tuesday's game that he considered it a failure because he didn't win enough games.\nBucks: Assistant coach Joe Prunty served as interim head coach in Kidd's absence. The team went 8-9 under Prunty's leadership. ... Middleton has scored at least 20 points in seven consecutive games.\nUP NEXT\nMagic: Visit Boston on Friday.\nBucks: Visit Memphis on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994048.550708
}