{
  "game_id": "0021900670",
  "espn_id": "401161312",
  "date": "Jan 24, 2020",
  "matchup": "MEM @ DET",
  "headline": "Jackson, Morant lift Grizzlies past Pistons 125-112",
  "body": "DETROIT --  Jaren Jackson Jr.'s big first half helped the Memphis Grizzlies return to their high-scoring ways.\n\nJackson scored 24 of his 29 points in the first two quarters, and he sank a big 3-pointer in the fourth to lift the Grizzlies to a 125-112 win over the Detroit Pistons on Friday night. Memphis took an early 15-point lead, and after the Pistons rallied, the Grizzlies controlled the last few minutes of the game.\n\n\"For us to come out and throw the first punch, it was good,\" said Jackson, a former Michigan State star. \"And then late, we didn't waiver, and we finished the game strong.\"\n\nMemphis was coming off a 119-95 loss at Boston, a game that snapped the Grizzlies' streak of 14 straight games with at least 110 points. They bounced back by shooting 54% from the field, 11 of 22 from beyond the arc and 28 of 31 on free throws against the Pistons.\n\n\"It shows our aggression, getting downhill and getting fouled,\" Memphis coach Taylor Jenkins said. \"Guys play the right way, we get the efficient shots, we get open shots, it usually leads to high percentages for us.\"\n\nThe Grizzlies are averaging 121 points this month.\n\nJackson was limited by foul trouble after halftime, but his 3-pointer with just over three minutes remaining gave the Grizzlies a 114-108 lead. Ja Morant had 16 points and 12 assists for Memphis, and Dillon Brooks scored 22 of his 27 points in the second half.\n\nDerrick Rose had 22 points for the Pistons, who were missing center Andre Drummond because of a lacerated lip.\n\nThe Grizzlies went on a 14-0 run and led 35-20 late in the first quarter. There was plenty of time for Detroit to come back, and the Pistons had the game tied before the midway point of the second.\n\nIt was close for most of the second half. Detroit look a 104-103 lead on a 3-pointer by Reggie Jackson, but Brandon Clarke's layup off an assist from Morant put Memphis back ahead.\n\nJaren Jackson's big 3-pointer gave the Grizzlies a little bit of a cushion, and the Pistons never really recovered.\n\n\"We just had some breakdowns toward the end of the game that's not supposed to happen,\" Detroit forward Markieff Morris said. \"They're a young, quick team. They play hard, they play together and they've got some young, great talent.\"\n\nSTANDINGS\n\nDetroit now trails eighth-place Brooklyn by 2 1/2 games in the Eastern Conference. Memphis entered the day a half-game behind eighth-place San Antonio in the West. The Spurs hosted Phoenix on Friday night.\n\nSPLIT UP\n\nRose and Reggie Jackson started for Detroit -- it was Jackson's second game back from a lumbar stress reaction that has kept him out most of the season. Jackson finished with 14 points but was not among the five players who started the third quarter for the Pistons. Coach Dwane Casey indicated that was because the team closed the first quarter so poorly while neither Rose nor Jackson was on the court.\n\n\"You give up a lead, now the rest of the night we are clawing from behind,\" Casey said. \"Trying to generate some offense with our second unit is why we split them up in the second half.\"\n\nTIP-INS\n\nGrizzlies: Memphis was missing F Bruno Caboclo (knee).\n\nPistons: In addition to Drummond, the Pistons have been without star F Blake Griffin (knee) -- and on Friday they were also without G Bruce Brown (illness), F Tony Snell (illness) and G Luke Kennard (knee). ... Rose scored at least 20 points for an 11th straight game, the longest streak of his career.\n\nUP NEXT\n\nGrizzlies: Host Phoenix on Sunday night.\n\nPistons: Host Brooklyn on Saturday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995710.308741
}