{
  "game_id": "0021900343",
  "espn_id": "401160985",
  "date": "Dec 09, 2019",
  "matchup": "IND vs. LAC",
  "headline": "George silences boos as Clippers hold off Pacers 110-99",
  "body": "INDIANAPOLIS --  Paul George had the perfect response to a crescendo of boos Monday night.\n\nHe silenced the crowd by making play after play and basket after basket.\n\nThe former Pacers star scored 36 points, grabbed nine rebounds, made a season-high seven 3-pointers and had five assists in his first game in Indianapolis with the Clippers, leading short-handed Los Angeles to a 110-99 victory.\n\n\"It brings incentive when the moments are dead, it brings energy when moments are dead, it brings an aggression when moments are light,\" George said. \"I feed off it. It's fun, it makes the game that much more fun to compete in.\"\n\nWhile George starred in the lead role, he got plenty of help, too.\n\nMontrezl Harrell added 26 points and eight rebounds and helped keep the Pacers at arm's length when they charged back in the final minutes. Patrick Beverley finished with 11 points, 12 rebounds and five assists, while Maurice Harkless snagged 14 rebounds as the Clippers earned their fourth win in five games.\n\nBut this night was all about George -- and the fans, many of whom still haven't forgiven him for forcing a summer trade three years ago.\n\nAnd with Kawhi Leonard sitting out, George took charge of his new team and didn't disappoint.\n\nHe turned the game with a quick scoring flurry late in the second quarter by drawing a foul, making three free throws and then knocking down 3s on the next two possessions to give the Clippers a 55-46 lead. Harrell and Ivica Zubac continued the flurry by making four straight free throws before Zubac capped the 14-4 run with a tip-in that made it 60-48 at the half.\n\n\"Given the circumstances, I always want to win here,\" George said. \"And I always enjoy playing here. You put those two together and I'm going to compete on every possession to try to get a win.\"\n\nGeorge was just warming up.\n\nHis fifth 3 extended the lead to 18 early in the third quarter and when Indiana cut the deficit to 13, George accounted for all of the Clippers' points in an 8-0 run to make it 84-65 and quiet the crowd.\n\n\"They got tired of booing when the fourth quarter came around and I cooled off a bit because they stopped booing,\" George said.\n\nIndiana, led by 20 points from Malcolm Brogdon, did make one last run. The Pacers got within 106-99 on T.J. Warren's 13-footer with 1:46 left, but Harkless answered with a layup and the Pacers didn't score another point.\n\n\"The last quarter, coach (Nate McMillan) just said go out and play, try to get it down to 10, put some pressure on them and try to make a run,\" Domantas Sabonis said after finishing with a career-high 22 rebounds. \"But we didn't make enough shots at the end.\"\n\nTIP-INS\n\nClippers: George has scored at least 31 points in three straight games. ... Zubac finished with 13 points. ... Los Angeles outscored Indiana 56-36 in the paint and was 10 of 32 on 3s. ... The Clippers won at Indiana for the first time since January 2016.\n\nPacers: Sabonis also scored 18 points. He's the franchise's first player to get 20 rebounds in a game since Troy Murphy had 21 in February 2009... Doug McDermott had 17 points and made five 3s, matching his highest total since joining Indiana last season. ... Jeremy Lamb and T.J. Warren each scored 12. ... Indiana's four game home winning streak ended.\n\nINJURY REPORT\n\nLeonard sat out on the second night of a back-to-back with a sore left knee. The three-time All-Star and two-time NBA Finals MVP has missed seven games this season.\n\nThe Clippers also played without JaMychal Green (bruised tailbone), Rodney McGruder (strained right hamstring) and Landry Shamet (sprained left ankle).\n\nBut George doesn't expect Leonard to receive a similar reception when he returns to Toronto on Wednesday.\n\n\"The exact opposite of what it was like tonight,\" George said.\n\nPOOR SHOOTING\n\nThe Pacers couldn't overcome their poor shooting Monday. They finished at 35.4% from the field, were 10 of 35 on 3s and 21 of 28 from the free-throw line.\n\n\"I can't explain this game,\" McMillan said. \"We got really good looks but we couldn't knock down shots. We just never really got anything going.\"\n\nUP NEXT\n\nClippers: Will visit the defending the league champs their third stop on a six-game road trip.\n\nPacers: Host Boston on Wednesday, the first meeting between the teams since the Celtics swept Indiana in the first round of the playoffs.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995868.0820422
}