{
  "game_id": "0022400651",
  "espn_id": "401705217",
  "date": "Jan 27, 2025",
  "matchup": "SAC @ BKN",
  "headline": "Sabonis grabs 22 rebounds in another triple-double as Kings beat Nets 110-96",
  "body": "NEW YORK -- — Domantas Sabonis had 21 points, 22 rebounds and 10 assists in his seventh triple-double of the season, De’Aaron Fox scored 30 points and the Sacramento Kings beat the Brooklyn Nets 110-96 on Monday night.\n\n\r\n              DeMar DeRozan added 17 points and Malik Monk finished with 16 for the Kings, who snapped a two-game losing streak.\n\n\r\n              Sacramento trailed by seven points at halftime and outscored the Nets 33-24 in the third quarter to take an 80-78 lead heading into the fourth.\n\n\r\n              The Kings then went on a 13-2 run, capped by Keegan Murray’s 3-pointer from the corner opposite the Nets bench, to make it 97-85 with 6:08 to play.\n\n\r\n              D’Angelo Russell had 19 points and Tosan Evboumwan chipped in 15 off the bench for the short-handed Nets, who have lost eight consecutive games.\n\n\r\n              The Nets were once again without Ben Simmons, who missed his fifth consecutive game due to lower back soreness.\n\n\r\n              Forward Noah Clowney sprained his left ankle and was helped off the court with 3:13 remaining in the second quarter when he jumped to block DeRozan’s shot and landed on Sabonis’ foot.\n\n\r\n              Takeaways\r\n              Kings: Sacramento outscored the Nets 63-42 in the second half after trailing 54-47 at the break.\n\n\r\n              Nets: Brooklyn’s current losing streak is its longest since dropping 11 straight from Jan. 23 to Feb. 12, 2022.\n\n\r\n              Key moment\r\n              Sacramento trailed by nine points with 10:12 left in the third quarter when Fox sparked a 12-0 run with eight points of his own. He finished the period with 16 points on 5-for-7 shooting from the field and made each of his four free throws.\n\n\r\n              Key stat\r\n              Sabonis became the fifth player in franchise history with 20 games of 20 or more rebounds. \n\n\r\n              Up next\r\n              Brooklyn visits Charlotte on Wednesday while Sacramento visits Philadelphia.\n\n\r\n              ------\n\n\r\n              This version corrects the final score to 110-96. A previous version stated it was 110-93.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997331.17713
}