{
  "game_id": "0022200228",
  "espn_id": "401468383",
  "date": "Nov 18, 2022",
  "matchup": "IND @ HOU",
  "headline": "Haliburton has 19 points, Pacers rally to beat Rockets 99-91",
  "body": "HOUSTON -- — Tyrese Haliburton had 19 points and the Indiana Pacers overcame a huge early deficit to beat the Houston Rockets 99-91 on Friday night. \n\n\r\n              Myles Turner added 17 points and Jalen Smith had a career-high 18 rebounds as the Pacers won their third straight game on a night where coach Rick Carlisle was ejected before halftime for yelling at the officials. \n\n\r\n              A 4-0 run by the Rockets cut the lead to 5 with about two minutes to go. They had two chances to get closer but turned the ball over before Jabari Smith Jr. missed 3. A layup by Haliburton after that made it 96-89 with less than a minute remaining. \n\n\r\n              “That wasn’t the prettiest game (but) our guys were resilient after a horrendous start,” Pacers assistant coach Lloyd Pierce said. \n\n\r\n              Pierce said the Pacers never got down despite the huge hole they were in early.\n\n\r\n              “There was never a moment where we thought we were out of it,” he said. \n\n\r\n              Houston led by one with about 10 minutes left in the fourth quarter before Haliburton got hot, scoring the next eight points to put the Pacers on top 82-75. Haliburton started the run with a 3-point play before knocking down a 3-pointer.\n\n\r\n              Smith made a jump shot for the Rockets, but Indiana used a 5-0 run after that to make it 87-77 with five minutes to go. \n\n\r\n              A modest 6-2 spurt by Houston cut the lead to 6. But Andrew Nembhard made a 3-pointer to start a 5-2 run to make it 94-85 with 2:40 left. \n\n\r\n              Eric Gordon had a season-high 24 points for the Rockets, who were unable to build on Wednesday night’s win over Dallas despite their strong start. \n\n\r\n              “It wasn’t like we weren’t getting the ball to the right spot,” Houston coach Stephen Silas said. “It wasn’t like we weren’t getting the ball to the rim. We just weren’t making the shots that could carry us over over the hump.”\n\n\r\n              Houston led as many as 20 early and was up 63-56 after a dunk by Kenyon Martin Jr. with about 5 1/2 minutes left in the third quarter. \n\n\r\n              Pierce said the entire bench was upset about Haliburton not getting a foul call in the second quarter on the play that led to Carlisle's ejection. \n\n\r\n              “To have a no call at the rim was frustrating,” he said. “He gets the first tech and probably gets emotional on the second one.”\n\n\r\n              With the way things were going for Indiana at that time, Pierce said it made sense that Carlisle got so upset about the call.\n\n\r\n              “We needed every break that we could get so to not have that called was one of those that we had to fight for,” he said. \n\n\r\n              TIP-INS\n\n\r\n              Pacers: Chris Duarte missed a fifth straight game with a sprained left ankle. … Hield had 10 points. … The Pacers made just 4 of their first 18 shots to allow Houston to jump out to the early lead. … Smith scored 10 points. \n\n\r\n              Rockets: Kevin Porter Jr. missed with a sore back. … Houston made just 6 of 28 3-pointers. ... Martin had 12 points and eight rebounds. ... Jalen Green had 16 points, five assists and five rebounds. \n\n\r\n              HAYES HONORED\n\n\r\n              Elvin Hayes had his No. 44 jersey retired in a halftime ceremony. He was the first overall pick by the Rockets 1968 from the University of Houston and spent his first four NBA seasons with the franchise including the team’s first season in Houston in 1971-72. He rejoined the team in 1981 and spent his last three seasons with the Rockets. \n\n\r\n              Hayes, a 12-time All-Star, was enshrined into the Hall of Fame in 1990, was named one of the NBA’s 50 greatest players in 1996 and to the league’s 75th anniversary team last year. \n\n\r\n              “This is something that I never thought that I would ever get to receive,” the 77-year-old said. “Now receiving this tonight is probably one of my greatest honors. I have received many honors in the game of basketball, but this one is really super great because of the fact that it is in Houston, where everything began for me at the University of Houston.”\n\n\r\n              Hayes also starred in the Game of the Century in 1968 when No. 2 Houston snapped top-ranked UCLA’s 47-game winning streak with a 71-69 win in front of more than 52,000 fans at the Astrodome. \n\n\r\n              UP NEXT \n\n\r\n              Pacers: Host the Magic on aturday night. \n\n\r\n              Rockets: Host Golden State on Sunday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994339.187229
}