{
  "game_id": "0022201161",
  "espn_id": "401469316",
  "date": "Apr 01, 2023",
  "matchup": "MIA vs. DAL",
  "headline": "Butler has 35, Miami gets needed win over Dallas, 129-122",
  "body": "MIAMI -- — Miami was desperate. So was Dallas.\n\n\r\n              Jimmy Butler and the Heat had just enough to help their playoff position — while dealing the Mavericks a big blow.\n\n\r\n              Butler had 35 points and 12 assists, Cody Zeller added 20 points and the Heat held off the Mavericks 129-122 on Saturday night to snap a three-game losing streak.\n\n\r\n              Max Strus and Kevin Love each scored 18 and Tyler Herro added 15 for the Heat. Miami won despite allowing Dallas to shoot a season-best 61%.\n\n\r\n              “I wouldn't necessarily have drawn it up this way,” Heat coach Erik Spoelstra said.\n\n\r\n              Luka Doncic was brilliant again for Dallas, finishing with 42 points, 10 rebounds and eight assists. Tim Hardaway Jr. had 31 points and Kyrie Irving added 23 points and eight assists for the Mavericks.\n\n\r\n              “A win is a win,” Butler said. “I don't like the fact that they shot 61%. But I do like the fact that we finally won a game.”\n\n\r\n              The Mavs had been 7-0 this season when shooting at least 54%, and fell to 30-2 all-time, including playoffs, in games where they shot at least 60%.\n\n\r\n              “Our defense was nonexistent,” Dallas coach Jason Kidd said. “Couldn't get stops.”\n\n\r\n              Both clubs went to the conference finals last season; the Heat are trying to get out of the play-in round, and the Mavericks are trying to just have a shot at the playoffs.\n\n\r\n              The win moves Miami (41-37) closer to securing no worse than the No. 7 seed and most advantageous spot in the Eastern Conference play-in tournament. The Heat are now 2 1/2 games ahead of both No. 8 Atlanta (38-39) and No. 9 Toronto (also 38-39).\n\n\r\n              Miami moved within 1 1/2 games of No. 6 Brooklyn (42-35). Even if the Heat win out and finish with 45 wins, the Nets — who hold the head-to-head tiebreaker — would only need to go 3-2 in their final five games to ensure they would finish ahead of Miami.\n\n\r\n              Meanwhile, it’s a big blow to Dallas (37-41).\n\n\r\n              The Mavs fell a full game back of No. 10 Oklahoma City (38-40) in the race for the last Western Conference play-in spot, and worse, the Thunder own the head-to-head tiebreaker. Dallas is now two games back of No. 9 Minnesota (39-39) and just a half-game ahead of No. 12 Utah (36-41).\n\n\r\n              “Just got to play hard, play with desperation and anything can happen,” Hardaway said. “Anything can happen.”\n\n\r\n              Miami changed its starting lineup, partly out of necessity. Center Bam Adebayo didn’t play because of a right hip contusion, so Zeller — starting a game for the first time since May 15, 2021, for Charlotte — took his spot and Strus took the forward starting spot that had been held by Love since he joined the Heat in February.\n\n\r\n              The moves paid immediate dividends. Strus was 3 for 3, all 3-pointers, in his first shift. Love was 3 for 3 from the field and 6 for 6 from the line for 13 points in his first 8 minutes off the bench, and Zeller had 12 points by halftime.\n\n\r\n              “K-Love is always, always has been about winning,” Butler said. “As long as we win, he's not going to complain.”\n\n\r\n              It all helped add up to the third highest-scoring first half in Heat history: Miami led 76-64 at the break, stretched the lead to 18 in the second half — then had to hang on in the final moments anyway.\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Dallas' string of three consecutive winning regular seasons will end. The best the Mavs can finish is 41-41. ... The Mavs fell to 5-16 in games where they allow more than 100 points. ... Dallas had one offensive rebound.\n\n\r\n              Heat: Butler’s 16 first-quarter points were his second-most in any quarter this season. He had 17 in the third quarter against Milwaukee on Feb. 4. … Miami will finish with a record of at least .500 for the fourth consecutive year and the 24th time in its 35 seasons.\n\n\r\n              WHAT’S LEFT\n\n\r\n              Dallas plays its final road game of the regular season at Atlanta on Sunday, then finishes with home games against Sacramento, Chicago and San Antonio.\n\n\r\n              Miami starts a trip to Detroit, Philadelphia and Washington on Tuesday, before finishing at home April 9 against Orlando.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Visit Atlanta on Sunday.\n\n\r\n              Heat: Visit Detroit on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993914.696238
}