{
  "game_id": "0021600844",
  "espn_id": "400900250",
  "date": "Feb 15, 2017",
  "matchup": "LAL @ PHX",
  "headline": "Bledsoe's triple-double leads Suns over Lakers, 137-101",
  "body": "PHOENIX --  The Phoenix Suns went into the NBA All-Star break flying high, soaring for 13 dunks in their most convincing win of the season.\n\nEric Bledsoe had his third career triple-double, the first for a Phoenix player since November 2015, and Devin Booker scored 23 points to lead the Suns over the Los Angeles Lakers 137-101 on Wednesday night.\n\nBledsoe got his 10th rebound with 6:06 to go and exited shortly after, finishing with 25 points and a season high-tying 13 assists.\n\n\"Great energy,\" Bledsoe said. \"It was fun to play in that game. When you've got horses running like Devin and T.J. (Warren), it racks up tons of assists.\"\n\nMarquese Chriss added 15 points and eight rebounds for Phoenix, with all four of his baskets on dunks. Alex Len came off the bench to contribute 15 points and nine boards.\n\n\"It's a tribute to Bled. He passes the ball when we're open,\" Chriss said. \"The bigs were running the floor and getting in position. We had the easy part, just putting in the ball at the rim.\"\n\nThe Suns led 102-76 after three quarters and coasted to their second victory in seven games and 11th straight over the Lakers at home. Phoenix credited a physical practice on Tuesday for its best offensive performance of the season.\n\n\"The guys came in, they always respond. This group, no matter how difficult the challenge is, they come back and want to get better,\" coach Earl Watson said.\n\nLou Williams and D'Angelo Russell led Los Angeles with 21 points apiece. The Lakers have lost three of four.\n\nPhoenix set season highs for points, field goal shooting (55.7 percent), assists (32) and fast-break points (41). The 137 points were the most for the Suns since they scored that many against the Lakers on March 22, 2011.\n\nPhoenix made eight of its first 12 shots, two of those on lobs for dunks by Chriss and Booker. Chriss threw down another alley-oop dunk with 5:13 left in the first quarter, giving the Suns a 23-6 lead, and his putback jam off Booker's miss at the 3:25 mark made it 27-8.\n\nPhoenix was up 32-15 at the end of the first quarter, with Los Angeles making just five of 19 shots with eight turnovers.\n\nThe Lakers cut the margin to 11 twice in the second quarter, but the Suns built it back to 20. Bledsoe banked in a 41-foot heave at the buzzer, and Phoenix led 68-48 at halftime behind 21 points from Booker and 10 assists from Bledsoe.\n\nLakers coach Luke Walton said it felt as though some players on his team already had the break on their minds.\n\n\"We're going to lose games and I'm OK with that and I know that,\" Walton said, \"but when we give in like that and don't play with a certain competitive level, that's not right for anybody that's involved.\"\n\nTIP-INS\n\nLakers: G Jordan Clarkson and F Larry Nance Jr. both played even though each is dealing with a sprained thumb. Russell played on a sore knee. ... Williams has scored at least 20 points 25 times this season, tops among NBA reserves.\n\nSuns: P.J. Tucker left midway through the second quarter when he tumbled over a photographer along the baseline after a missed transition layup. Tucker limped to the locker room with a bruised lower back but returned in the third quarter. ... The 15 points allowed in the first quarter were a season low for the Suns. Their 68 points in the first half were a season high. ... Bledsoe's previous triple-double came against Dallas on Dec. 23, 2014.\n\nHUSTLE PLAY\n\nWith the Suns up big late in the third quarter, Booker caught up to Clarkson on a fast break and blocked his layup attempt off the backboard. The play got Booker's teammates and fans on their feet with cheers.\n\nWORLD SERIES CHAMP\n\nChicago Cubs slugger Anthony Rizzo sat courtside. Rizzo and the Cubs just started spring training in nearby Mesa.\n\nWEEKENDERS\n\nFour players in the game will play for the U.S. team in Friday's NBA Rising Stars Challenge at All-Star weekend in New Orleans. Booker and Chriss will represent the Suns, while the Lakers will send Russell and Brandon Ingram. Also, Derrick Jones Jr. of the Suns, who had three dunks late in the fourth quarter, will compete in the Slam Dunk Contest, and the Lakers' Nick Young will take part in the Skills Challenge, both on Saturday.\n\nUP NEXT\n\nLakers: Return to regular-season action Feb. 24 at Oklahoma City.\n\nSuns: Start a three-game road trip Feb. 24 at Chicago.",
  "source": "espn_api",
  "crawled_at": 1764995380.478004
}