{
  "game_id": "0022200334",
  "espn_id": "401468489",
  "date": "Dec 02, 2022",
  "matchup": "PHX vs. HOU",
  "headline": "Rockets rally from 16 down to beat Booker, Suns 122-121",
  "body": "PHOENIX -- — Jalen Green sccored 30 points to jolt the Houston Rockets' offense and even managed to slow down the scorching Devin Booker — at least a little.\n\n\r\n              The result was a stunning 122-121 victory over the Phoenix Suns that featured a 16-point comeback in the second half and a white-knuckle final possession that included four missed shots for the Suns.\n\n\r\n              “That's what I want to be known as in this league, a two-way player who is also a scorer,” the 20-year-old Green said. “I've got to start somewhere. Tonight was a perfect opportunity and it worked out.”\n\n\r\n              Houston won after blowing a six-point lead in the final two minutes. Booker and Cameron Payne made back-to-back 3-pointers to tie it at 121, but the Rockets pushed ahead by a point when Green made hit free throw with 28.8 seconds remaining.\n\n\r\n              That set up a frantic final possession that included four missed shots by the Suns, including a 16-foot jumper by Booker at the buzzer.\n\n\r\n              “We were able to get good shots,” Suns coach Monty Williams said. “We just weren’t able to convert them.”\n\n\r\n              It was one of the few blemishes for Booker, who led the Suns with 41 points on 15-of-25 shooting. The three-time All-Star is in the midst of one of the best scoring stretches of his career. He had 44 points at Sacramento on Monday night and 51 against Chicago at home Wednesday night.\n\n\r\n              Booker was slightly more mortal in the fourth quarter, making just 3 of 8 shots. Green was guarding him for a big chunk of that time, trying to make life hard on the three-time All-Star.\n\n\r\n              “One thing about my young guys is they have a short memory, they keep going,” Rockets coach Stephen Silas said. “He took on the challenge of guarding Booker — doing it on both ends. That's growth. Showing his competitiveness, showing what he can be. I was really proud of him for that.”\n\n\r\n              Houston (6-16) had the worst record in Western Conference coming into Friday's game while the Suns (15-7) had the best. The Suns had their six-game winning streak snapped.\n\n\r\n              “All the hard work that we're putting in is paying off a little bit,” Silas said. “That last possession was heart stopping.”\n\n\r\n              The Rockets trailed by 16 late in the third quarter and by 10 going into the fourth, but tied it at 106 midway through the fourth. Garrison Matthews made a 3-pointer with 4:17 left that put Houston up 113-110. Eric Gordon added a corner 3 with 2:05 left to push the advantage to 118-113.\n\n\r\n              Green scored 21 points in the second half, including 20 in the third quarter.\n\n\r\n              “It just builds our confidence going forward,” Green said. “We're a talented young team, we've got a lot of power in the starting five and on the bench.”\n\n\r\n              Booker's high-scoring ways helped him earn Western Conference Player of the Month for November and the 6-foot-5 guard kept it up in the first quarter against the Rockets, scoring 18 points on 7 of 9 shooting. The three-time All-Star finished with 20 points in the first half, which helped the Suns take a 64-57 halftime lead.\n\n\r\n              Booker kept it up in the second half, scoring 13 more points in the third quarter. He pushed the lead to 96-86 after three quarters, making a contested, turnaround jumper in the final seconds.\n\n\r\n              The Rockets had a 43-19 advantage in free throw attempts and 13 offensive rebounds.\n\n\r\n              “Offensive rebounds and free throws. Fourth quarter they scored 36,” Payne said. “We've got to keep him off the boards, off the free throw line.”\n\n\r\n              TIP-INS\n\n\r\n              Rockets: G Jae'Sean Tate (right ankle soreness) was inactive. ... All five starters scored in double figures. \n\n\r\n              Suns: F Torrey Craig (right groin strain), F Cam Johnson (right meniscus tear) and G Chris Paul (right heel soreness) were inactive. Paul missed his 12th straight game. ... Hosted a 40th straight sellout crowd at Footprint Center. \n\n\r\n              UP NEXT\n\n\r\n              Rockets: At Golden State on Saturday night.\n\n\r\n              Suns: At San Antonio on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995089.648918
}