{
  "game_id": "0022400393",
  "espn_id": "401704959",
  "date": "Dec 23, 2024",
  "matchup": "ORL vs. BOS",
  "headline": "Da Silva's late 3 preserves Magic's 108-104 comeback win over Tatum-less Celtics",
  "body": "ORLANDO, Fla. -- — Tristan da Silva scored 18 points and made a critical 3-pointer with 9.9 seconds left, and the Orlando Magic rallied from a 15-point halftime deficit Monday night for a 108-104 victory over the Boston Celtics, who were missing Jayson Tatum because of an illness.\n\n\r\n              With Tatum sidelined two nights after his 43-point triple-double in a win at Chicago, Jaylen Brown led the Celtics with 35 points.\n\n\r\n              Boston led 58-43 at halftime, but the Magic dominated the third quarter to tie the game by the end of that period, and they pushed ahead by 10 in the fourth. The Celtics made a late run and Brown’s layup got Boston within 105-104 with 59.6 seconds left. Al Horford missed a potential go-ahead 3-pointer for the Celtics, and da Silva responded with his game-sealing 3.\n\n\r\n              Trevelin Queen added 17 points in his first NBA start and Jalen Suggs scored 16 for the Magic. Kristaps Porzingis and Derrick White each scored 17 for the Celtics.\n\n\r\n              Magic center Goga Bitadze was ejected with 3:36 left for stepping into an altercation between Suggs and Porzingis, both of whom drew technical fouls.\n\n\r\n              Takeaways\r\n              Celtics: The defending NBA champions went cold in the second half in their final road game of 2024.\n\n\r\n              Magic: Orlando was outplayed in the first half for a second straight game while playing without Paolo Banchero, Franz Wagner and Mo Wagner, but still found a way to win.\n\n\r\n              Key moment\r\n              Late in the third quarter, Cole Anthony lost the ball on a drive, stole it back in the corner and drove around the 7-foot-3 Porzingis and 7-2 Luke Kornet for a reverse layup to give the Magic their first lead, 73-72.\n\n\r\n              Key stat\r\n              The Celtics, who average almost 19 3-pointers per game on 51 attempts, shot 8 for 32 from distance.\n\n\r\n              Up next\r\n              Celtics: Host Philadelphia on Christmas Day.\n\n\r\n              Magic: Host Miami on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997558.9086342
}