{
  "game_id": "0022200357",
  "espn_id": "401468512",
  "date": "Dec 05, 2022",
  "matchup": "MIA @ MEM",
  "headline": "Jones' career-high 28 points lead Grizzlies past Heat 101-93",
  "body": "MEMPHIS, Tenn. -- — Tyus Jones had a career-high 28 points and 10 assists to lead the short-handed Memphis Grizzlies to a 101-93 victory over Miami Heat on Monday night.\n\n\r\n              Santi Aldama added 18 points and 10 rebounds, while Dillon Brooks finished with 17 for Memphis, which played without leading scorer Ja Morant and several other key players. Jones started in place of Morant, filling in for the Grizzlies' leading scorer.\n\n\r\n              “I view myself as a starter in this league. I feel like I am a starter in this league. I just come off the bench,” said Jones. “I have no shame in that.”\n\n\r\n              Tyler Herro led the Heat with 23 points and 13 rebounds. Jimmy Butler had 18 points and Caleb Martin finished with 16 for the Heat.\n\n\r\n              “This was the first game of the year where it just looked like we were flat; in the mud for a large portion of the game,” Heat coach Erik Spoelstra said. “Even when we were able to get some footing, we just weren’t able to take control of the game.”\n\n\r\n              Both teams entered the night having won four of their previous five games, and that included a Memphis win over Detroit on Sunday. But playing the second night of a back-to-back meant several Grizzlies were unavailable. Three of the five most recent starters — Morant, Jaren Jackson Jr. and John Konchar -- were out, leaving a load of minutes for reserves and two-way players.\n\n\r\n              “It’s a lot different when they start (different) guys,” said Heat center Bam Adebayo, who finished with 15 points. “That’s when the guys that come off the bench give more life.”\n\n\r\n              Miami opened with accurate shooting and built an early advantage, but Memphis stayed close and took the lead in the second quarter when the Heat’s shooting touch cooled. \n\n\r\n              After shooting 53% in the first quarter, the Heat were 21 of 60 from the field the rest of the way as the Memphis lead grew to 12 in the fourth quarter.\n\n\r\n              “Our activity was there. We were flying around,” Memphis coach Taylor Jenkins said of his team’s defense getting stronger. “I think that was just finding our way throughout the game.”\n\n\r\n              TIP-INS: \n\n\r\n              Heat: Made six of their first seven 3-point attempts. … Adebayo has 38 straight games in which he has scored in double figures. … Erik Spoelstra successfully challenged a foul on Kyle Lowry in the fourth quarter. Spoelstra is now 7-1 in coach’s challenges this season.\n\n\r\n              Grizzlies: The game was the first of a five-game homestand, the team’s longest of the season. … G Desmond Bane missed his 11th game with a right big toe sprain. With Bane and John Konchar unavailable, rookie David Roddy got his first professional start. … Grizzlies, who defeated Detroit on Sunday, are 1-2 in the second game of a back-to-back.\n\n\r\n              TAKE NO ONE LIGHTLY\n\n\r\n              Even with a chunk of the Grizzlies starters taking the night off, Spoelstra in his pregame comments – almost as a warning -- said his team is in no position to look past a short-handed opponent. He noted Miami started the night a game under .500. “It’s not anywhere we want to be,” Spoelstra said waving his arms for emphasis. “We’ve got a lot of work to do still ahead. We’re not where we want to be. Not in the slightest.”\n\n\r\n              MAN DOWN\n\n\r\n              A two-official crew – Scott Foster and JB DeRosa – had to call the game after Marat Kogut, the third member, was a late scratch due to non-COVID related illness.\n\n\r\n              UP NEXT: \n\n\r\n              Heat: Host Detroit on Tuesday.\n\n\r\n              Grizzlies: Host Oklahoma City on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993982.044352
}