{
  "game_id": "0021800726",
  "espn_id": "401071399",
  "date": "Jan 25, 2019",
  "matchup": "DET @ DAL",
  "headline": "Doncic's 32, Kleber's late 3 lift Mavs over Pistons 106-101",
  "body": "DALLAS --  Rookie sensation Luka Doncic's reputation as a scorer keeps growing. So does Maxi Kleber's penchant for blocking shots.\n\nDoncic scored 32 points, Kleber hit a crucial 3-pointer after blocking a shot by Blake Griffin and the Dallas Mavericks beat the Detroit Pistons 106-101 on Friday night.\n\nGriffin scored 35 for his eighth 30-point game in the past 11, but couldn't get a key bucket when trying to back down Kleber. After Griffin's attempt to save the ball inbounds was collected by Doncic, the 19-year-old found Kleber alone at the 3-point line.\n\nInitially, Kleber's fourth 3 gave Dallas a 100-97 lead, but the score changed to 100-95 on the subsequent timeout. The Pistons lost two points when Andre Drummond's basket more than two minutes earlier was overturned on review by a shot-clock violation.\n\n\"That was a tough one,\" Drummond said. \"They waited so long to take it away too and it got down to pretty much the three-minute mark before they finally got a chance to look at it. We can't control things like that.\"\n\nDallas got its 18th win in 24 home games in the first of two games between teams with matching 21-26 records.\n\n\"The game was won at the defensive end, which was great to see,\" Mavericks coach Rick Carlisle said. \"It was a game we have to have as we try to claw our way back into the playoff picture.\"\n\nDetroit had a chance to tie when Stanley Johnson missed a 3-pointer, and DeAndre Jordan dunked over fellow 6-foot-11 center Drummond for the second time, this one on an assist from Doncic, who had eight rebounds and eight assists.\n\nKleber's fourth and final block came on a dunk attempt by Drummond, and Doncic hit a fadeaway jumper for his fifth 30-point game and a 104-97 lead with 1:18 remaining.\n\nA second-year player from Germany, Kleber took over the team lead for blocks with 55. The 26-year-old has two more than Jordan, who was one of the league's top shot-blockers earlier in his career.\n\nThanks to Kleber's earlier work, it didn't matter as much when Griffin soared over him for a spectacular dunk in the final minute.\n\n\"I always try to see where the guy's taking off and then I judge, `Can he dunk it or not?\" said Kleber, who had 12 points. \"I didn't want to make the foul because I had five already, so I kind of twist to the side. I was like, `No, he's not going to make that.' Well, he dunked that.\"\n\nDrummond, who returned after missing three games while in the concussion protocol, got the better of Jordan in the battle of the NBA's top two rebounders and two of the league leaders in double-doubles, but Jordan made the clutch plays late.\n\nDetroit's big man had 23 points and 15 rebounds for his 37th double-double, while Jordan scored 13 points with 11 boards for his 30th double-double.\n\nTIP-INS\n\nPistons: Griffin scored 15 straight points in the second quarter before a put-back dunk by Drummond. ... Jackson was the other double-figure scorer with 12 points on 4-of-14 shooting and had nine assists.\n\nMavericks: Kleber made his first three 3s in the first half and finished 4 of 7 from long range. ... The Mavericks were more accurate on 3-pointers than free throws in the first half, going 9 of 20 from long range (45 percent) and 5 of 13 from the line (39 percent). ... Dirk Nowitzki, in his record 21st season with just one franchise, didn't score in 10 minutes.\n\nCLOSING TROUBLE AGAIN\n\nGriffin criticized his team's decision-making late in games after a win in New Orleans because the Pistons almost blew a comfortable lead. This time, they took too long to get off a shot after Griffin's highlight-reel dunk and a miss from Doncic at the other end. Reggie Jackson missed a 3 with less than five seconds remaining, securing the Dallas win.\n\nSMITH SOLID AGAIN\n\nDennis Smith Jr., in his second game back with Dallas after a week away from the team amid trade talk, scored 11 of his 19 points in the first quarter. He and Doncic combined to go 17 of 33 from the field after making just 11 of 32 in Smith's first game back, a win over the Clippers.\n\n\"He's back. We've got two wins,\" Doncic said of his 21-year-old backcourt mate. \"He brings a lot. He's aggressive. He's fast. He helps us a lot.\"\n\nUP NEXT\n\nPistons: Detroit returns home trying to avoid a four-game season sweep by Milwaukee on Tuesday.\n\nMavericks: Toronto at home on Sunday in the second of seven straight games against Eastern Conference teams.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994685.4598742
}