{
  "game_id": "0021500199",
  "espn_id": "400828086",
  "date": "Nov 22, 2015",
  "matchup": "OKC vs. DAL",
  "headline": "Westbrook helps Thunder snap Mavericks' 6-game win streak",
  "body": "OKLAHOMA CITY -- Despite having success with a balanced offense, there was no question the Oklahoma City Thunder would turn to Russell Westbrook during crunch time against the Dallas Mavericks.\nWestbrook had 31 points and 11 assists, hitting two key baskets in the final 63 seconds, and the Thunder rallied from a double-digit third-quarter deficit to win 117-114 Sunday night, ending the Mavericks' six-game winning streak.\nSerge Ibaka had 16 points, nine rebounds and a key late blocked shot for Oklahoma City, which was without star forward Kevin Durant (injured hamstring) for the sixth straight game. The Thunder are 3-3 in his absence.\n\nWestbrook again carried the heaviest load for the Thunder, but five other Oklahoma City players scored in double digits -- Ibaka, Dion Waiters (14), Anthony Morrow (14), Enes Kanter (12) and Nick Collison (10).\n\"I really felt like tonight for -- what's it been, 14 games? -- I thought this was the most complete game we've had offensively,\" first-year Oklahoma City coach Billy Donovan said. \"This is probably the closest I thought offensively, to an identity that I'd like to see us play with. The ball was moving. It was going from one side of the floor to the other. Guys made really good decisions. Hopefully we can build on it.\"\nWestbrook broke a 113-113 tie with a jumper with 1:03 left. Zaza Pachulia made 1 of 2 from the free-throw line to pull the Mavericks within a point before Westbrook's 18-foot jumper with 24 seconds left capped the scoring.\nDeron Williams, who led Dallas with 20 points, missed an 18-footer and Pachulia fouled Oklahoma City's Steven Adams while going for the rebound. Adams missed both free throws, but Ibaka blocked Williams' layup attempt with 8.4 seconds left and the Mavericks managed only an off-balance heave from 3-point range by Wesley Matthews, which came nowhere close to the basket.\nMatthews finished with 18 points, while Pachulia had 12 points and 10 rebounds.\nDallas coach Rick Carlisle was brief with media after the game.\n\"I thought we were poor on defense the entire game,\" Carlisle said. \"We gave up 117 points and we've been giving up under 100 on average. It's just not getting it done. I think we lost some of our defensive edge tonight and we have to get it back.\"\nOklahoma City led much of the first half. A basket by rookie Cameron Payne put the Thunder up 41-30 with 8:27 left in the second quarter, but the Mavericks rallied to forge a 50-all tie. Consecutive three-point plays by Westbrook fueled a 10-2 Oklahoma City to close the half and give the Thunder a 60-52 lead.\nDallas made its first 10 shots of the third quarter, taking an 82-72 lead on Devin Harris' basket at the 4:29 mark. But the Mavericks made one more field goal the rest of the quarter, allowing the Thunder to close the gap.\nTIP-INS\nMavericks: Dallas C JaVale McGee made his season debut after signing with the Mavericks during the offseason. McGee, who missed much of the past two seasons with a stress fracture in his left tibia, entered the game late in the first quarter and made his first four shots. He finished with eight points in 11 minutes. ... The last time Dallas had a winning streak longer than six games was in 2011-12, when they won 12 straight and eventually took the NBA title. ... Williams has reached double figures in scoring in 12 of the 13 games he's played this season.\nThunder: Waiters made his second straight start, filling Durant's usual spot in the lineup. ... After going 3 for 29 from 3-point range in a loss to the New York Knicks on Friday, the Thunder went 3 for 4 from behind the arc in the first quarter against Dallas. ... In a rarity, Oklahoma City's Ibaka and Dallas' Pachulia were called for consecutive three-second violations in the first quarter. ... The Thunder wore their alternate orange uniforms for the second time this season.\nDURANT RETURN IN `A FEW DAYS'\nDurant shot jumpers during pregame warmups before the game but again sat out. After Durant suffered the hamstring injury on Nov. 10, the Thunder said he'd be out seven to 10 days, but Sunday was 12 days out and Donovan said only that the team \"remains hopeful\" of Durant's return \"in a few days.\"\nWhile Donovan didn't strictly rule out Durant being available for Monday's game at Utah, it sounded more like he expected Durant back for Wednesday's home game against the Brooklyn Nets.\n\"Right now, when I say `a few days,' really what they're doing right now is I think they're re-evaluating every day,\" Donovan said. \"I think they're trying to push him a little bit further each day, up unto a point. But I think he's responded very, very well.\"\nUP NEXT\nMavericks: At Memphis on Tuesday\nThunder: At Utah on Monday",
  "source": "espn_api",
  "crawled_at": 1764994212.183449
}