{
  "game_id": "0022001046",
  "espn_id": "401307856",
  "date": "May 12, 2021",
  "matchup": "LAL vs. HOU",
  "headline": "Kuzma's late basket gives Lakers 3rd straight win",
  "body": "LOS ANGELES -- — Despite missing LeBron James and Anthony Davis, the Los Angeles Lakers are keeping alive their slim hopes of trying to avoid the play-in tournament.\n\n\r\n                    Kyle Kuzma's driving layup with 6.9 seconds remaining gave the short-handed Lakers a 124-122 victory over the Houston Rockets on Wednesday night.\n\n\r\n                    The defending NBA champions have won three straight for the first time since the middle of March, but remain in seventh place in the Western Conference.\n\n\r\n                    “It is time to tighten up the screws and get back on track,” said Kuzma, who finished with 19 points and 10 rebounds. “We need to continue to play the right way and with each other, which will bode well when we are at full strength.”\n\n\r\n                    James (sprained ankle) and Davis (groin) were not in the lineup, but spoke to fans before the game when the Lakers unveiled the banner for their 17th NBA championship before the game. They held off from doing it until fans were finally allowed to attend games at Staples Center.\n\n\r\n                    While James and Davis reiterated the desire to win back-to-back championships, the Lakers (40-30) could face a long road. They are one game behind Portland and Dallas in the battle for a top six spot, which would allow them to avoid being in next week’s play-in tournament. However, the Trail Blazers and Mavericks won the season series over the Lakers and hold the tiebreakers.\n\n\r\n                    Los Angeles' best hope is to win out and hope either Dallas or Portland drop their final two games.\n\n\r\n                    However, the Lakers' slim hopes almost flickered away against Houston.\n\n\r\n                    The Lakers led 121-113 with 2:57 remaining, but the Rockets scored nine straight points to go up by a point in the final minute. After a timeout, Kuzma was able to drive the lane and score the go-ahead points.\n\n\r\n                    “I took my time and waiting for everyone to flatten out. I was trying to get an angle to the basket and it worked out well,” Kuzma said.\n\n\r\n                    Houston had a final chance, but Kelly Olynyk had the ball stolen by Wesley Matthews with 0.9 seconds remaining. Talen Horton-Tucker — who led the Lakers with 23 points — then hit the first free throw, but missed the second.\n\n\r\n                    Horton-Tucker, who hit the go-ahead 3-pointer in overtime of Tuesday night’s win over the New York Knicks, got his fourth start of the season with Alex Caruso sidelined due to foot soreness. He also had 10 assists for his fourth double-double of the season while logging a season-high 37 minutes.\n\n\r\n                    “He’s had to shoulder a lot and has been helping us the past two games,” Lakers coach Frank Vogel said.\n\n\r\n                    Andre Drummond had 20 points and 10 rebounds and Montrezl Harrell added 16 points for the Lakers.\n\n\r\n                    Olynyk and Armoni Brooks scored 24 apiece for the Rockets (16-54) and Kenyon Martin Jr. added 20. Houston has dropped seven straight and 44 of its last 49.\n\n\r\n                    “I thought as a team we played well. We had a late lead but couldn't come out on top. It is something we can build on and hopefully keep going,” Olynyk said.\n\n\r\n                    TIP INS\n\n\r\n                    Rockets: Khyri Thomas made his first career start in his fourth game with Houston. Thomas, who had four points, is the 24th player to make at least one start with the Rockets this season. ... Cameron Oliver (17 points) is the third Rockets rookie since 1990 to have scored 10 or more points in each of his first two games, joining Cuttino Mobley (1998-99) and Kennard Winchester (1990-91). ... Danuel House Jr. and DaQuan Jeffries were unavailable after suffering ankle injuries Monday.\n\n\r\n                    Lakers: Los Angeles scored a franchise-record 86 points in the paint, breaking the old mark of 82, which was set against Houston in 2017. It is also the third-highest single-game total in the paint in the league this season. ... Markieff Morris got the start in place of Davis and finished with 14 points. ... Alfonzo McKinnie, who had not played in two of the past three games, had 10 points.\n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: Host the LA Clippers on Friday.\n\n\r\n                    Lakers: Travel to Indiana on Saturday.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764997934.410547
}