{
  "game_id": "0022000653",
  "espn_id": "401307442",
  "date": "Mar 22, 2021",
  "matchup": "CLE vs. SAC",
  "headline": "Fox scores 30, Haliburton has 28 as Kings beat Cavs 119-105",
  "body": "CLEVELAND -- — De’Aaron Fox scored 30 points, Tyrese Haliburton had a career-high 28 and the Sacramento Kings completed their longest road trip of the season with a 119-105 victory over the Cleveland Cavaliers on Monday night.\n\n\r\n                    Buddy Hield added 19 points and Richaun Holmes had 17 points and 16 rebounds for the Kings, who went 3-3 on their 10-day trip. Harrison Barnes made a late run at a triple-double with nine points, 10 rebounds and eight assists.\n\n\r\n                    “That will make the flight back a little bit easier for the guys and for the coaching staff,” Sacramento coach Luke Walton said. “We knew we had a great opportunity tonight, so I’m pleased with the road trip, for sure.”\n\n\r\n                    JaVale McGee paced the Cavaliers with 18 points and nine rebounds, while Collin Sexton had 15 points and seven assists. Cleveland, playing its third home game in four days, trailed for the final 25 minutes and has lost six of eight.\n\n\r\n                    “Understandably, some nights you just don’t have it,” Cavaliers coach J.B. Bickerstaff said. “The guys kept trying, but we were just hunting as a group and couldn’t put it together consistently.”\n\n\r\n                    The Kings seized control with a 23-9 run to open the third quarter, fueled by 11 points from Fox, to push their lead to 86-68. Haliburton followed with 14 points in the fourth when Sacramento went up by 19.\n\n\r\n                    Haliburton, the No. 12 pick, is averaging 15.0 points and 4.0 assists since moving into the starting lineup four games ago. He shot 11 of 15, including 4 of 5 on 3-pointers, and made both free throws in 36 minutes.\n\n\r\n                    “It felt nice to see the ball go in the hoop and that gave me confidence,” Haliburton said. “When the shots aren’t falling, I get really hard on myself, but I’ve got to learn to control what I can control. That’s how hard I play and the attitude I have.”\n\n\r\n                    Fox and Haliburton each had 14 points in the first half as the Kings held a 63-59 advantage. There were 15 lead changes and 10 ties with the clubs combining to make 51 of 97 shots.\n\n\r\n                    “De’Aaron has gotten a lot stronger and I think you see that in his game, and Tyrese was great,” Walton said. “There were stretches when De’Aaron took over and stretches where he did. It’s exciting to watch them grow together.”\n\n\r\n                    The Cavaliers may have a different look when they return to Rocket Mortgage FieldHouse on April 1. Center Andre Drummond and backup McGee could be dealt before the NBA trade deadline Thursday.\n\n\r\n                    “I thought JaVale gave us a nice lift off the bench with the group he was out there with,” Bickerstaff said.\n\n\r\n                    The Kings made their first trip to Cleveland since Dec. 7, 2018, and played the Cavaliers for the first time since April 4, 2019.\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: F Marvin Bagley III (left hand fracture) missed his fourth straight game and will be sidelined until at least mid-April. “We need to keep the mentality of getting to the rim,” Walton said. “Losing Marvin and his skill-set definitely hurts that.” … C Chimezie Metu (right wrist fracture) and rookie G Jahmi’us Ramsey (right hamstring strain) were inactive. … Both Sacramento games against Cleveland in 2019-20 were canceled.\n\n\r\n                    Cavaliers: G Matthew Dellavedova (appendectomy) was downgraded from questionable to out after taking part in back-to-back practices, further delaying his season debut. … F Kevin Love (right calf soreness) and F Taurean Prince (left shoulder sprain) remain unavailable. … G Quinn Cook signed a second 10-day contract before the game. … Two-way G Brodric Thomas finished third in the G League Rookie of the Year voting.\n\n\r\n                    MEMORY LANE\n\n\r\n                    Walton wrapped up his playing career with the Cavaliers, appearing in 71 games from 2011-13. He also became engaged to his now-wife Bre during his stay. “I had a great time in Cleveland,” Walton said. “The city is great. The fans are great. And I got the chance to play with a young Kyrie (Irving) and a young Tristan (Thompson). We didn’t win a ton, but we had a good time.”\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Host Atlanta on Wednesday. \n\n\r\n                    Cavaliers: Visit Chicago on Wednesday. The longtime Central Division rivals will play all three of their matchups in a 27-day span.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997874.427586
}