{
  "game_id": "0022301147",
  "espn_id": "401585775",
  "date": "Apr 09, 2024",
  "matchup": "MIA @ ATL",
  "headline": "Tyler Herro scores 33, Butler adds 25 as the Heat outlast the Hawks 117-111 in 2 OTs",
  "body": "ATLANTA -- — Tyler Herro scored four of his 33 points in the second overtime and the Miami Heat outlasted the Atlanta Hawks 117-111 on Tuesday night.\n\n\r\n              Jimmy Butler had 25 points and nine assists and Nikola Jovic added 23 points and eight rebounds as the Heat won for the fifth time in seven games.\n\n\r\n              With the win, Miami remained a half-game behind the Philadelphia 76ers, in eighth place in the Eastern Conference standings.\n\n\r\n              “I love it league-wide,” Miami coach Erik Spoelstra said. “There is a bunch of competition around the league fighting for something. Ten years ago at this time, everyone is resting or tanking. This is not the case right now. This brought out all of the emotions competition brings out.”\n\n\r\n              Dejounte Murray had 29 points, 13 rebounds and 13 assists in 49 minutes for the Hawks. De'Andre Hunter finished with 23 points and 10 rebounds.\n\n\r\n              The Hawks are in 10th place in the conference, a game behind the Chicago Bulls.\n\n\r\n              Herro missed over a month with a foot injury, and in only his third game back, he went 48 minutes and scored the first four points of the second overtime.\n\n\r\n              “He’s a winner,” Butler said. “He’s always willing to do whatever it takes. This time of year, you want to get in rhythm and do whatever it takes to win.”\n\n\r\n              The Hawks outscored the Heat 23-2 in second-chance points and held a 17-5 edge on the offensive glass. In the two overtime periods, however, Atlanta had just two offensive boards and did not score any second-chance points.\n\n\r\n              “They are a great offensive rebounding team,” Butler said. “I thought we did a decent job in the first half, it got away from us in the second, but in the end when we needed to get rebounds, we did, and when we needed to get stops, we did.”\n\n\r\n              Murray missed a potential game-winning 3-pointer at the end of the first overtime.\n\n\r\n              The Heat had the final possession of regulation with the score tied at 101. Herro missed badly on a desperation 3-point try after Butler ran down the clock. Butler scored the Heat’s final 10 points in regulation.\n\n\r\n              The Heat were in control early, and led by 12 at halftime. The Hawks put together a 19-6 run in the third quarter and tied the game at 75. Hunter had nine points during the spurt. Jalen Johnson turned his right ankle during the run and walked back to the locker room. He did not return and finished with 13 points and eight rebounds\n\n\r\n              The Heat were without starters Terry Rozier (neck) and Duncan Robinson (back). \n\n\r\n              Hawks All-Star Trae Young has resumed practice for the first time since his surgery for a torn ligament in his left fifth finger, but has not been cleared to play in a game. \n\n\r\n              UP NEXT\n\n\r\n              Heat: Host the Dallas Mavericks on Wednesday.\n\n\r\n              Hawks: Play their final regular-season home game against the Hornets on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995321.992147
}