{
  "game_id": "0022400770",
  "espn_id": "401705336",
  "date": "Feb 12, 2025",
  "matchup": "ORL vs. CHA",
  "headline": "Paolo Banchero has 24 points and 8 rebounds as Orlando beats injury-riddled Charlotte 102-86",
  "body": "ORLANDO, Fla. -- — Paolo Banchero had 24 points and eight rebounds and the Orlando Magic shook off a cold-shooting first half to beat the Charlotte Hornets 102-86 on Wednesday night.\n\n\r\n              Franz Wagner added 16 points and seven rebounds and Anthony Black came off the bench to score 18 points. \n\n\r\n              Miles Bridges led the injury-plagued Hornets with 19 points and eight rebounds. Josh Green and Damion Baugh added 16 points each for Charlotte, which shot 39.5% for the game and lost its third game in a row.\n\n\r\n              The Magic's Kentavious Caldwell-Pope and the Hornets' Nick Smith Jr. were ejected in the final seconds of the first half after an on-court verbal confrontation.\n\n\r\n              Takeaways\r\n              Hornets: With LaMelo Ball (sore right ankle ) and center Moussa Diabate (right eye abrasion) added to their long list of injuries, the Hornets go into the All-Star break having lost nine of 10.\n\n\r\n              Magic: Jalen Suggs, who missed his ninth straight game with a left quad contusion and his 19th game since Jan. 3, is expected to return after the All-Star break. Wednesday's win was only Orlando's fifth in 19 games without Suggs, dropping the Magic from fourth to ninth in the conference. \n\n\r\n              Key moment\r\n              With Cole Anthony and Banchero hitting two 3-pointers each, the Magic broke away from a 55-55 tie to a 12-point lead in the final six minutes of the third quarter, and led by double digits throughout the fourth.\n\n\r\n              Key stat\r\n              The NBA's poorest 3-point shooting team, the Magic made only 5 of 21 (23%) in the first half, then came back with 9 for 22 (41%) in the second half.\n\n\r\n              Up next\r\n              Hornets: Play at Los Angles Lakers on Feb. 19.\n\n\r\n              Magic: Play at Atlanta on Feb. 20.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997537.540787
}