{
  "game_id": "0022200736",
  "espn_id": "401468891",
  "date": "Jan 27, 2023",
  "matchup": "MIL @ IND",
  "headline": "Antetokounmpo scores 41 points, Bucks beat Pacers 141-131",
  "body": "INDIANAPOLIS -- — When the Milwaukee Bucks needed a steadying presence Friday night at Indiana, Giannis Antetokounmpo provided it — even from the free-throw line.\n\n\r\n              The Eastern Conference All-Star captain finished with 41 points, 12 rebounds, six assists and made five of eight free throws during the final four minutes to help Bucks fend off Indiana's second-half rally for a 141-131 victory.\n\n\r\n              “We had a good rhythm and were able to just hang on in the second half,\" Bucks coach Mike Budenholzer said. “These road wins are pretty sweet and there were some real positive things, especially in the first half.”\n\n\r\n              Jrue Holiday added 23 points and nine assists for Milwaukee, Khris Middelton added 17 despite playing just 15 minutes.\n\n\r\n              Budenholzer even liked Antetokounmpo's form on his late free throws as the Central Division-leading Bucks won their third straight, this one in front of a surprisingly friendly road crowd.\n\n\r\n              For the Pacers, it was a familiar script — slow start, deep hole and late comeback. They've won an NBA-leading 11 times after trailing by double digits this season, twice after trailing by 20 or more points.\n\n\r\n              This time, though, the 33-point first-half deficit was simply too much. Myles Turner led the Pacers with 24 points and Buddy Hield added 22 as Indiana lost for the ninth time in 10 games.\n\n\r\n              “The starts we've been getting off to have been atrocious,” T.J. McConnell said after finishing with 19 points and nine assists. “It was the pace. When we get out and run and play with pace, we're pretty good. When we can't get a stop, you see what happened in the first half.'\n\n\r\n              Milwaukee took control quickly with a balanced attack and incredible 3-point shooting. The Bucks' ninth 3 capped a 15-3 run to close the first quarter and gave them a 45-30 lead. The charge continued through the second quarter as the margin expanded to 85-52 in the final minute of the half. \n\n\r\n              But Indiana finally answered in the third quarter, trimming it to 114-99 and then methodically got closer in the fourth while repeatedly sending Antetokounmpo to the free-throw line. With 3:27 to go, they were within 131-124 but the Bucks didn't let Indiana get any closer.\n\n\r\n              TIP-INS\n\n\r\n              Bucks: The 85 first-half points were a season high. ... Antetokounmpo was playing his third straight game since missing five games with an injured right knee and was 7 of 18 on free throws. ... Brook Lopez had 15 points and Pat Connaughton had 14 as the Bucks made 19 3s. \n\n\r\n              Pacers: Indiana lost its 10th straight in the series and its fourth straight to the Bucks in Indy. ... Hield made five 3s to break a tie with Jason Richardson (1,608) for No. 31 on the NBA's career list. Hield now has 196 this season and 1,613 in his career. ... Rookie Bennedict Mathurin had 21 points and eight rebounds.\n\n\r\n              THE CAPTAIN\n\n\r\n              One day after Antetokounmpo was selected to his seventh All-Star Game and again selected as captain of the Eastern Conference squad, Pacers coach Rick Carlisle made it clear how much he thinks of the one-time NBA champion and two-time league MVP.\n\n\r\n              “He's as difficult a guy to guard as there is,” said Carlisle, winner of 885 career games and the 2010 championship. “Giannis is very unique, and I don't think there will ever be a player quite like him in this league, maybe ever. He's a beast, just an absolute beast.\"\n\n\r\n              HALIBURTON UPDATE\n\n\r\n              Pacers guard Tyrese Haliburton missed his ninth consecutive game since spraining his left elbow and left knee. When he initially got hurt against the New York Knicks on Jan. 11, team officials said he would be re-evaluated in two weeks. Apparently, that timeline has been revised.\n\n\r\n              “I think maybe early next week,” Carlisle said when asked for an update. “But he's doing well, doing well.\"\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host New Orleans on Sunday. \n\n\r\n              Pacers: At Memphis on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994570.674413
}