{
  "game_id": "0022400396",
  "espn_id": "401704962",
  "date": "Dec 23, 2024",
  "matchup": "BKN @ MIA",
  "headline": "Adebayo scores 23 points as Heat snap 3-game skid with 110-95 win over Nets",
  "body": "MIAMI -- — Bam Adebayo scored 17 of his 23 points in the second half and the Miami Heat snapped a three-game skid with a 110-95 win over the Brooklyn Nets on Monday night.\n\n\r\n              Nikola Jovic scored 18 points and Tyler Herro added 17 points and 12 rebounds for the Heat, who are 7-0 when holding opponents under 100 points. Miami’s Duncan Robinson had 17 points, shooting 5 for 10 from 3-point range.\n\n\r\n              Cam Johnson and Noah Clowney each scored 19 points for Brooklyn. The Nets’ Keon Johnson scored 15 and Tyrese Martin finished with 14.\n\n\r\n              Brooklyn closed the first half on a 17-6 run and cut its deficit to a point at the break. The Heat outscored the Nets 52-38 in the second half.\n\n\r\n              Heat star forward Jimmy Butler missed his second straight game because of a stomach illness. Miami reserve guard Dru Smith left the game because of a lower left leg injury early in the second quarter and did not return.\n\n\r\n              Takeaways\r\n              Nets: Brooklyn is 2-8 since a season-best three-game win streak in November. Six of the losses have been by double figures, including two by 25 or more points.\n\n\r\n              Heat: Miami snapped a three-game skid. The win marked the second time this season Miami avoided a four-game slide.\n\n\r\n              Key moment\r\n              After scoring eight points and squandering a 22-point lead in the fourth quarter of Saturday’s 121-114 loss at Orlando, Miami began the fourth period Monday with five unanswered points, stretching its lead to 88-78. The Heat outscored Brooklyn 27-17 in the period.\n\n\r\n              Key stat\r\n              Miami shot 21 of 24 from the line, with Adebayo going 7 for 8 and Herro 5 for 6.\n\n\r\n              Up next\r\n              Both teams are back in action Thursday. The Nets visit Milwaukee and the Heat are at Orlando.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997993.496656
}