{
  "game_id": "0022000928",
  "espn_id": "401307731",
  "date": "Apr 27, 2021",
  "matchup": "CHA vs. MIL",
  "headline": "Bucks avoid series sweep with 114-104 win over Hornets",
  "body": "CHARLOTTE, N.C. -- — Giannis Antetokounmpo wasn't about to let the Milwaukee Bucks get swept by the Charlotte Hornets this season.\n\n\r\n                    Antetokounmpo had 29 points, 12 rebounds and eight assists, Brook Lopez added 22 points and the Bucks held off the Hornets 114-104 on Tuesday night to avoid losing all three matchups this season.\n\n\r\n                    The Hornets (30-31) beat the Bucks by 12 at home in January, and then by eight on April 9 in Milwaukee.\n\n\r\n                    Antetokounmpo seemed determined not to let that happen again.\n\n\r\n                    The two-time NBA MVP played with aggression, finishing 11 of 19 from the field and 5 of 5 from the free throw line. \n\n\r\n                    “We came out with focus knowing they had beat us twice,” Antetokounmpo said. “We wanted to get one and not get swept. ... For sure everybody was locked in and extra motivated to win this game.”\n\n\r\n                    Antetokounmpo got fired up midway through the game when he thought Charlotte’s P.J. Washington intentionally tried to trip him after Antetokounmpo stole the ball from him. Antetokounmpo pointed his finger at Washington — and some replay angles appeared to justify the Greek star's anger over the play.\n\n\r\n                    “His leg came with force,\" Antetokounmpo said. “I was upset because it was a dangerous play. I was about to (run) and I felt like he tripped me a little bit. But he plays hard and I respect every single of one them. But if you're coming at me, I’m going to come at you, especially if I think you're doing it in purpose.”\n\n\r\n                    The Hornets have been playing small ball, but Bucks coach Mike Budenholzer refused to play that game, sticking with Lopez in the middle. The 7-foot, 282-pound Lopez responded in a big way, shooting 9 of 12 from the field while dominating the paint at both ends of the floor.\n\n\r\n                    The Bucks outrebounded the Hornets 48-38.\n\n\r\n                    “It was a kind of strange, when (Hornets center Bismack) Biyombo came into the game we were going the opposite way,” Budenholzer said. “But Brook was really big tonight -- literally and figuratively.”\n\n\r\n                    Milwaukee built a 62-45 halftime lead behind 15 points and eight rebounds from Antetokounmpo while the Bucks' defense held the Hornets to 4-of-18 shooting from beyond the arc.\n\n\r\n                    The Hornets battled back to cut the lead to 103-99 with four minutes left to play but Terry Rozier missed a key 3-pointer and Antetokounmpo answered with a dunk off a lethal spin move at the other end. Middleton then added a 3-pointer from the left wing off an inbounds play to push the lead to nine.\n\n\r\n                    Rozier had a rare off night for the Hornets, finishing with eight points and going 0 for 7 from 3-point range.\n\n\r\n                    Despite the loss, Hornets coach James Borrego seemed pleased with his team's effort as it prepares for a possible berth in the play-in tournament.\n\n\r\n                    “I feel like our attention to detail and our urgency and our competitive spirit’s there,” said Borrego, whose teams remains without Gordon Hayward, LaMelo Ball and Malik Monk due to injuries. “We’re moving in the right direction, which is great. This is where you want to be this time of year. It’s starting to feel like that, but we’ve got execute better I think overall for 48 minutes.”\n\n\r\n                    PLAYOFFS ARE COMING\n\n\r\n                    The Bucks are 9-9 in the last 18 games, but Antetokounmpo said he's not worried as long as his teammates have the \"right look in their eyes.\"\n\n\r\n                    “As long as we build good culture around this team we are going to be in a very good place — that is what I believe,” Antetokounmpo said. \n\n\r\n                    TIP INS\n\n\r\n                    Bucks: Had 28 assists.\n\n\r\n                    Hornets: Hayward remains in the walking boot, and Borrego said he doesn't view the Hornets star as being close to return. Hayward has missed the last 13 games with a sprained right foot. ... Bridges has scored at least 20 points in three straight games.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Continue four-game trip at Rockets on Thursday night.\n\n\r\n                    Hornets: At Celtics on second night of a back-to-back Wednesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997343.503372
}