{
  "game_id": "0021900758",
  "espn_id": "401161400",
  "date": "Feb 05, 2020",
  "matchup": "TOR vs. IND",
  "headline": "Raptors beat Pacers for team-record 12th straight win",
  "body": "TORONTO --  Serge Ibaka had missed five of his six attempts from 3-point range, but didn’t hesitate when it was time to take the biggest shot of the game.\n\nIbaka hit a go-ahead 3 with 30 seconds remaining and the Toronto Raptors rallied from 19 down to beat the Indiana Pacers 119-118 Wednesday night, setting a franchise record with their 12th consecutive victory.\n\n“He deserved it because he’s been working his tail off on his shooting,” Raptors coach Nick Nurse said.\n\nKyle Lowry had 32 points, 10 assists and eight rebounds, and Ibaka scored a season-high 30 as Toronto fought back after trailing by 11 with less than four minutes to play. The defending NBA champions scored the final 11 points of the game.\n\n“We play 48 minutes,” Lowry said. “That’s how we play. We gave ourselves a chance, put the press on, made some shots, got aggressive and played better defense down the stretch.”\n\nToronto’s closing offense was pretty good, too. A trio of Raptors scored in double figures in the fourth, led by Ibaka’s 15 points.\n\nIbaka said a pep talk from Nurse inspired him to keep firing even after he struggled from distance early.\n\n“Nick told me in a timeout, ‘Serge, keep shooting with confidence, just push the ball,’” Ibaka said. “He gave me a lot of confidence.”\n\nPascal Siakam scored 25 points, Terence Davis had 11 and Fred VanVleet added 10 to help the Raptors earn their 12th straight home win over Indiana.\n\nMalcolm Brogdon scored 24 points and Justin Holiday added a season-best 22, but the Pacers lost their third straight overall. Domantas Sabonis had 15 points, 11 rebounds and 10 assists for his third career triple-double.\n\n“Poor execution the last five minutes of the game,” Pacers coach Nate McMillan said.\n\nIndiana guard Victor Oladipo started for the first time since returning from injury last week and scored a season-high 13 points in 25 minutes.\n\n“I feel like I played a little better today,” Oladipo said. “I could actually feel my legs kind of getting under me, especially defensively.\n\n“It’s a tough loss, obviously, but there’s a lot of basketball left,” he added. “We’ve just got to continue to keep getting better, keep getting stronger, and getting healthy as well. Everything else will take care of itself.”\n\nToronto was the opponent in January 2019 when Oladipo had to be carried off the court on a stretcher because of a ruptured tendon in his right knee.\n\nOladipo played seven minutes in the first quarter, then checked back in with 4:17 left in the first half. He started the second half and was replaced by Aaron Holiday with 3:24 remaining in the third period. Oladipo returned for his final stint with 5:34 left in the fourth and closed out the game.\n\nHoliday shot 6 for 9 from 3-point range and Brogdon went 4 of 7 as the Pacers finished 19 for 39 from deep, a season high for made 3s.\n\nToronto’s Rondae Hollis-Jefferson returned after missing four games because of a sprained right ankle. He did not score in 13 minutes.\n\nThe Raptors trailed 106-103 after Siakam’s driving dunk with 5:05 left, but Holiday made a 3, Oladipo hit a jumper and Brogdon connected from deep to put the Pacers up 114-103 with 3:50 to go.\n\nSiakam hit one of two at the line with 1:15 left to bring Toronto within four, then forced a steal and drove for a layup to make it 118-116 with 1:06 remaining.\n\nThe Pacers called a timeout and gave the ball to Oladipo, but his shot didn’t fall, leading to Ibaka’s go-ahead 3 at the other end.\n\nOladipo missed a 3 with 10 seconds to play and VanVleet stripped Brogdon to seal an historic win for Toronto.\n\nTIP-INS\n\nPacers: Outscored the Raptors 55-22 in bench points. … Indiana is 13-13 on the road. … Doug McDermott scored 19 points.\n\nRaptors: C Marc Gasol missed his fourth straight game because of a sore left hamstring, while G Norman Powell sat out for the second consecutive game because of a broken ring finger on his left hand. Both players are out indefinitely.\n\nSLOPPY\n\nThe Pacers allowed 27 points off 19 turnovers, the most by an Indiana opponent this season.\n\nRECORD SETTING\n\nToronto is 37-14, its best record ever after 51 games.\n\nNEVER IN DOUBT\n\nNurse cracked a joke at the start of his postgame news conference: “Had ‘em all the way,” he said as he arrived at the podium.\n\nUP NEXT\n\nThe Pacers host the Raptors on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995599.4396129
}