{
  "game_id": "0021900940",
  "espn_id": "401161582",
  "date": "Mar 07, 2020",
  "matchup": "CHA vs. HOU",
  "headline": "Terry Rozier scores 24 points, Hornets beat Rockets 108-99",
  "body": "CHARLOTTE, N.C. --  The Charlotte Hornets entered a four-game homestand to open the week on a two-game winning streak that included a road victory at the defending NBA champion Toronto.\n\nAfter losses to Milwaukee, San Antonio and Denver, a meeting with the Houston Rockets didn't seem a recipe for snapping a three-game losing streak.\n\nBut Charlotte scored the first 20 points and Terry Rozier finished with 24 to help the Hornets beat the slumping Rockets 108-99 on Saturday night.\n\nThe Rockets had eight turnovers and missed five 3-pointers on their first 12 possessions.\n\n\"This was a good one for us tonight,\" said Hornets rookie P.J. Washington, who scored 22 points. \"We felt like we should have won the last two so just coming out the same intensity that we did those last two games tonight and it got us a win so we are trying to look to do that the rest of the season.\"\n\nHouston, which played without All-Star Russell Westbrook (rest), twice closed within three in the second quarter and within five in the third quarter. The Rockets have lost three straight after winning six straight and 10 of 12.\n\nJames Harden had 30 points, 10 rebounds and 14 assists for his 46th career triple-double and fourth this season. He also had 10 of Houston's 21 turnovers.\n\n\"I don't know,\" Houston coach Mike D'Antoni said about the slow start. \"I've never experienced that before, 20-0 that's a big deficit to overcome and for whatever reason when we did attack we turned it over, it was kind of weird. And we couldn't stop them. Just a little bit of sluggishness, for whatever reason.\"\n\nAdded Harden: \"We have to do a better job defensively to make our offense a lot better. We didn't make enough shots. Obviously, down 20-0 is tough to come back on anybody but we did, to give ourselves a chance, but we just couldn't continue to sustain that kind of intensity throughout the four quarter game.\"\n\nRobert Covington added 25 points for the Rockets, and Jeff Green had 20.\n\nDevonte' Graham added 23 points for Charlotte. Cody Zeller had 13 and Miles Bridges 10.\n\nHornets coach James Borrego was happy with how his team responded to each Houston challenge after Charlotte took the big early lead, especially when the Rockets had two potential tying 3-pointers misfire in the second quarter.\n\n\"The momentum was shifting a little there,\" Borrego said. \"Our heads were hanging for a second. I could feel it. We called a timeout there and rallied the troops again and everybody picked their spirits up.\n\n\"I think the way we closed the second quarter is a big part of this game. And I think that's the maturity that we're talking about with this young group.\"\n\nTIP-INS\n\nRockets: Rookie guard Chris Clemons estimated 200 fans came to see his first NBA game in his home state. The former Raleigh Millbrook High and Campbell University standout was recalled from the G-League on Friday. Clemons led the NCAA in scoring last season with a 30.1 average and is Big South Conference scoring leader with 3,225 points. He did not play Saturday.\n\nHornets: Charlotte entered Saturday with its seventh losing streak this season of three or more games. It's the most losing streaks of three or more games by the franchise since the 2014-15 season when it had eight such losing streaks.\n\nUP NEXT\n\nRockets: Host Orlando on Sunday night.\n\nHornets: At Atlanta on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764996046.355517
}