{
  "game_id": "0022000346",
  "espn_id": "401267506",
  "date": "Feb 05, 2021",
  "matchup": "MIL @ CLE",
  "headline": "Giannis scores 33 to lead Bucks past Cavaliers to start trip",
  "body": "CLEVELAND -- — The Bucks' plane never got off the ground Thursday night. It took them a little longer than usual to fly around the court Friday.\n\n\r\n                    Giannis Antetokounmpo scored 33 points, Jrue Holiday added 17 and Milwaukee beat the Cleveland Cavaliers 123-105 in the opener of a six-game road trip that began with the Bucks stuck at home due to travel delays.\n\n\r\n                    Antetokounmpo picked up two early fouls and started slowly. But the reigning NBA MVP, who had a triple-double in just three quarters earlier this week, found his groove in the second half, scoring 13 in the third and 22 after halftime.\n\n\r\n                    The Bucks outscored the Cavs 29-16 in the the fourth and won their third straight after a long day. Antetokounmpo added 12 rebounds, Bobby Portis scored 14 and Donte DiVincenzo had 11 points, a career-high 11 boards and six assists.\n\n\r\n                    “It was kind of weird,” Antetokounmpo said of Milwaukee's unusual 24-hour ordeal. \"It took us a little bit before we got out rhythm. But each quarter we got better.”\n\n\r\n                    Collin Sexton scored 19 and Andre Drummond 18 for Cleveland, which has been one of the NBA's surprise teams but is starting a difficult stretch, beginning with back-to-back home games with the talented Bucks.\n\n\r\n                    “They made us pay for our mistakes,” Cavs coach J.B. Bickerstaff said. “They keep coming.”\n\n\r\n                    Milwaukee's longest trip of the season's first half began ominously.\n\n\r\n                    The Bucks were supposed to leave Thursday night, but mechanical issues with their plane while they sat on the tarmac sent them home for the night and forced them to fly to Cleveland on game day. The Bucks didn't arrive until early in the afternoon.\n\n\r\n                    “It took me back to playing AAU, traveling the same day,” said DiVincenzo, who grabbed an offensive rebound and hit a 3-pointer early in the fourth to give the Bucks some momentum.\n\n\r\n                    Cleveland was still within four early in the fourth quarter when Middleton and Antetokounmpo drained 3-pointers to push Milwaukee's lead to 10. \n\n\r\n                    The Cavs, who made 11 3s after attempting just 10 on Wednesday night, stayed within striking distance before Bryn Forbes buried a long 3 for the Bucks to make it 117-105 and Budenholzer was able to pull his starters to get some rest after a long day.\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Embarked on their longest road trip since the 2017-18 season ... Portis sparked Milwaukee with 10 straight points over the first and second quarters. ... Milwaukee made just seven 3-pointers after getting 21 in each of its past two games. No team in history has ever made 20 3s in three straight games. ... Milwaukee is 7-0 against the Central Division.\n\n\r\n                    Cavaliers: Fan favorite G Matthew Dellavedova, who hasn't played this season because of a severe concussion, went on Twitter to dismiss a report he's considering retirement. He called it a “temporary setback” and said his “only focus is getting healthy and back with the boys to help make a playoff push.” ... F Larry Nance remained sidelined with a sprained right wrist. ... Cleveland had its biggest crowd this season — 2,720 fans —- after the state of Ohio granted a variance allowing the team to bump its attendance at Rocket Mortgage FieldHouse from 10% percent of capacity to 14%.\n\n\r\n                    FALLING (ALL)-STAR\n\n\r\n                    Like LeBron James, Antetokounmpo isn't happy about the NBA’s decision to hold an All-Star Game in Atlanta next month.\n\n\r\n                    “I want to see my family,” said Antetokounmpo, who was looking forward to the break. “I've got zero energy and zero excitement. But we've got to do it.”\n\n\r\n                    James called the league's decision “a slap in the face.”\n\n\r\n                    Sexton feels differently.\n\n\r\n                    “I’m definitely excited for it and hopefully I will be able to be a part of it,” Sexton said. “Everybody is going to voice their opinion, but I’d feel proud to represent my team, represent the organization and just go out there and be part of All-Star Weekend.”\n\n\r\n                    UP NEXT\n\n\r\n                    Milwaukee looks to extend its winning streak to seven straight over Cleveland on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997406.072402
}