{
  "game_id": "0022100013",
  "espn_id": "401359841",
  "date": "Oct 20, 2021",
  "matchup": "SAC @ POR",
  "headline": "Barnes has 36 and the Kings spoil Portland's opener 124-121",
  "body": "PORTLAND, Ore. -- — The Sacramento Kings will be in a good place this season if Harrison Barnes can consistently shoot like he did in the season opener. \n\n\r\n                    Barnes scored 36 points, including a career-high eight 3-pointers, and the Kings spoiled Chauncey Billups debut as Portland's head coach with a 124-121 victory over the Trail Blazers on Wednesday night. \n\n\r\n                    De'Aaron Fox added 27 points while Richaun Holmes had 21 points and 11 rebounds for the Kings, who led by as many as 18 points in the third quarter. \n\n\r\n                    “I've challenged Harrison, I want him to get eight threes up a night. He's a very good shooter, and there's no reason he can't make make those shots,” Kings coach Luke Walton said. “We needed all those points tonight. And that's really how we want to see Harrison playing all the time.”\n\n\r\n                    Portland rallied in the fourth. Damian Lillard and Jusuf Nurkic made back-to-back layups to get the Blazers within 117-111 with 3:49 to go, and Norman Powell's 3-pointer cut the margin to three. \n\n\r\n                    Barnes hit a 3-pointer to push the Kings' lead to 120-114 with 1:39 left. After Buddy Hield's free throws gave Sacramento a 122-117 lead, CJ McCollum and Lillard both hit baskets — but Barnes made free throws and Lillard's 3-point attempt to tie it at the buzzer was off. \n\n\r\n                    “Harrison, everybody in the team will tell you, he’s always putting his work in. He’s getting his work in early, late, so we expect that from him,” Holmes said. “The amount of work he puts in, we expect nothing less from him. He can be that type of player for us every night and we have the ultimate trust in him.” \n\n\r\n                    McCollum finished with 32 points and Lillard added 18 points and 11 assists. Lillard was uncharacteristically 0-for-9 from 3-point range. \n\n\r\n                    “It ain’t my first time going 0-for-nine, or 10, I’ve done it a few times in my career. I don’t think opening night is a night that you want it to happen, especially in game you lose by three,\" Lillard said. \n\n\r\n                    The Trail Blazers were coming off a winless preseason, losing all by an average of 23.7 points. \n\n\r\n                    Portland finished 42-30 last season and earned the sixth seed in the Western Conference. But the playoffs ended quickly with Denver eliminating the Blazers in the opening round.\n\n\r\n                    The team parted ways with longtime coach Terry Stotts following the season and hired Billups, who made his regular-season debut as a head coach on Wednesday. \n\n\r\n                    The Kings went 31-41 last season and finished tied for 11th in the Western Conference. It was the 15th straight season the Kings have missed the postseason.\n\n\r\n                    The Blazers swept the Kings 3-0 last season. \n\n\r\n                    TIP INS\n\n\r\n                    Kings: Forward Marvin Bagley III was not in the starting lineup, following reports that he would not be in the rotation for the opener. Kings coach Luke Walton would not discuss the situation. “I'm not getting into any of that. For me, we're a team. We've have a plan, we know what that plan is, and we're going to need everyone this season.” ... Hield tied Peja Stojakovic’s franchise record for career 3-point goals with 1,070.\n\n\r\n                    Trail Blazers: Coach Chauncey Billups said before the game that Little's minutes would be restricted because of a lingering hamstring injury. ... Norman Powell appeared to hit a 3-pointer in the second quarter but it was later taken away on review because he was judged to be out-of-bounds. ... Lillard, entering his 10th NBA season, broke into the NBA’s top 100 career scoring list with his 13th point of the night. \n\n\r\n                    CHAUNCEY'S DEBUT\n\n\r\n                    Billups hadn't quite digested his first real game as a head coach. \n\n\r\n                    “I came in here a few times in the preseason, not happy with our effort, not happy with our spirit. I don't feel that way today. We fought extremely hard. Yeah, I hated getting off to a tough start, but its the first game, there's going to be jitters, there's going to be nerves. But I'm feeling very happy about how hard we played.” \n\n\r\n                    UP NEXT\n\n\r\n                    The Kings host the Utah Jazz on Friday.\n\n\r\n                    The Blazers host the Phoenix Suns on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764993909.0438762
}