{
  "game_id": "0022001047",
  "espn_id": "401307857",
  "date": "May 13, 2021",
  "matchup": "CHA vs. LAC",
  "headline": "George scores 20, Clippers roll past slumping Hornets 113-90",
  "body": "CHARLOTTE, N.C. -- — Paul George had 20 points and 10 rebounds, Reggie Jackson added 19 points off the bench on five 3-pointers and the Los Angeles Clippers handed the slumping Charlotte Hornets their fourth loss in the last five games, 113-90 on Thursday night.\n\n\r\n                    Kawhi Leonard had 16 points and nine rebounds for the Clippers, who are jockeying for playoff position in the Western Conference. The Clippers (47-23) remain in third place, one game ahead of the Denver Nuggets with two games remaining.\n\n\r\n                    The NBA’s best 3-point shooting team this season lived up to expectations as the Clippers made 21 of 45 shots from beyond the arc. \n\n\r\n                    “We have been shooting it great all year,\" Leonard said. “I'm just happy guys are being aggressive and making the right play. (The Hornets) were packing the paint and we had a lot of double teams, so once we kicked it out, we were knocking down shots.\"\n\n\r\n                    The Hornets used several defenses to mix it up, including a zone. Nothing seemed to work in the second half.\n\n\r\n                    “We tried a number of things to keep them off balance,” Hornets coach James Borrego said. “But they have another gear they can get to and they did it that second half.”\n\n\r\n                    LaMelo Ball had 18 points and seven assists for the Hornets (33-37) in their regular-season home finale. Charlotte never really had a chance with guards Terry Rozier and Devonte Graham combining to shoot 4 of 20 from the field and 2 of 13 from beyond the arc.\n\n\r\n                    Despite the loss, the Hornets remained tied with the Indiana Pacers for eighth place in the Eastern Conference, but own the head-to-head tiebreaker with Indiana.\n\n\r\n                    Former Hornets forward Nic Batum, who was booed relentlessly by fans during the game, gave the Clippers some breathing room with back-to-back 3-pointers to close out the third quarter and give the Clippers an 84-77 lead.\n\n\r\n                    “I just let the game come to me,” Batum said. “I don't care if I take six or eight shots. I'm just trying to take the correct shot.”\n\n\r\n                    Los Angeles stayed hot in the fourth quarter, using drives and kickouts to knock down open 3s and build a 21-point lead, sending fans streaming to the exits with about 4 minutes remaining in the game. The Clippers outscored the Hornets 29-13 in the fourth quarter.\n\n\r\n                    “We’re searching for answers,\" Borrego said. “We’re looking for lineups, we’re looking for shot-making and we’ve gone dry in a lot of these fourth quarters.” \n\n\r\n                    The Clippers' bench outscored the Hornets 52-32. \n\n\r\n                    TIP INS\n\n\r\n                    Clippers: Batum finished with 11 points, but the baskets came at key times.\n\n\r\n                    Hornets: Gordon Hayward has missed 22 games with a foot sprain. ... Rapper DaBaby watched the game from the crowd.\n\n\r\n                    SCRUBB GETS IN THE BOOKS\n\n\r\n                    Clippers rookie Jay Scrubb scored the first points of his career, finishing with four. It was his second game this season following foot surgery after the NBA draft.\n\n\r\n                    “It's been awesome for him having Rajon Rondo here and a chance to learn from him,\" coach Tyronn Lue. \"It's great for him to get back on the floor.”\n\n\r\n                    BRIDGES ON THE MEND\n\n\r\n                    Hornets forward Miles Bridges could return this weekend after sitting out nearly two weeks as part of the league’s health and safety protocol. That would give the short-handed Hornets a much-needed lift, especially with Hayward struggling to get back on the floor.\n\n\r\n                    “Hopefully we’ll get good news on Miles here soon and that’ll help us,” Borrego said. \"But if not, we've got to continue to move forward. We got a big game on Saturday.”\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Visit the Rockets on Friday night. Lue said that he's unsure if Leonard and George will get the night off.\n\n\r\n                    Hornets: Wrap the regular season with road games Saturday at the Knicks and Sunday at the Wizards.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764997000.106674
}