{
  "game_id": "0022400135",
  "espn_id": "401704701",
  "date": "Nov 01, 2024",
  "matchup": "ATL vs. SAC",
  "headline": "De'Aaron Fox leads Kings to 123-115 win over short-handed Hawks",
  "body": "ATLANTA -- — De'Aaron Fox scored a season-high 31 points and the Sacramento Kings held off the short-handed Atlanta Hawks 123-115 for their third straight win. \n\n\r\n              DeMar DeRozan had 27, the fifth straight game he's scored more than 20 since joining the Kings in the offseason. Domantas Sabonis scored 15 points and grabbed 14 rebounds before fouling out, his fourth double-double in five games.\n\n\r\n              Trae Young led the Hawks with 25 points and 12 assists and Garrison Mathews hit a career-high seven 3-pointers off the bench en route to 23 points.\n\n\r\n              The Hawks played without starters De'Andre Hunter and Dyson Daniels, plus rotation players Bogdan Bogdanovic, Vit Krejci and Kobe Bufkin due to injury.\n\n\r\n              The Kings outrebounded the Hawks 50-41 and did not trail for the final 47 minutes of the game.\n\n\r\n              Takeaways\r\n              Kings: The Kings were in control most of the way but could not put the game away. Still, their four-game road trip is off to a 2-0 start.\n\n\r\n              Hawks: Despite being outmanned, the Hawks put forth a better fight than they did in losing two games to the Wizards. Mathews looks like he may have earned a starting spot with his outstanding 3-point shooting while the team is lacking bodies.\n\n\r\n              Key moment\r\n              Young tied the game with a long 2-pointer with 5:52 left, but a 6-0 burst from the Kings put them back in control. Fox had four of the six points and DeRozan hit a contested shot from the wing.\n\n\r\n              Key stat\r\n              Overall No. 1 pick Zaccharie Risacher made the first shot of the game, a 3-pointer from the corner, then missed his final eight shots. He is shooting 31.6% this season, including 22.2% from deep.\n\n\r\n              Up next\r\n              The Kings play the third game of a four-game road trip at Toronto on Saturday night. The Hawks play at New Orleans on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998303.486559
}