{
  "game_id": "0022201141",
  "espn_id": "401469296",
  "date": "Mar 29, 2023",
  "matchup": "MEM vs. LAC",
  "headline": "Westbrook has season-high 36 points, Clippers beat Grizzlies",
  "body": "MEMPHIS, Tenn. -- — Russell Westbrook had a season-high 36 points, Robert Covington also had a season best with 27 points and the Los Angeles Clippers beat the Memphis Grizzlies 141-132 on Wednesday night to open a two-game set.\n\n\r\n              The teams — both short-handed Wednesday — will meet again Friday night in Memphis.\n\n\r\n              Westbrook made five 3-pointers without a miss and had 10 assists. Covington was 9 of 10 from the field, making all seven of his 3-point attempts.\n\n\r\n              Bones Hyland added 20 points for Los Angles, including 12 in the fourth quarter as the Clippers pulled away in the final seven minutes. \n\n\r\n              “Just being composed,” Westbrook said about the difference down the stretch. “As a point guard, I was taught the last five or six minutes of the game were very important. Getting stops, getting good shots. We did a good job of executing down the stretch.”\n\n\r\n              Ja Morant led the Grizzlies with 36 points and nine assists. Dillon Brooks added 30 points as all five Memphis starters finished in double figures. The Grizzlies had won seven in a row and 12 straight at home.\n\n\r\n              While the Clippers were already without Paul George as he recovers from a right knee sprain, Kawhi Leonard was a late scratch for personal reasons.\n\n\r\n              The Grizzlies sat a number of key players on the second night of a back-to-back. Morant was back after sitting out against Orlando on Tuesday night, but Jaren Jackson Jr., Desmond Bane, Tyus Jones and reserve John Konchar were declared out with various ailments. \n\n\r\n              The game built in intensity and the teams got into a scrum near midcourt in the third quarter with Brooks and Covington barking at each other. Throughout the game, coaches were yelling at officials, players were mouthing to each other and the physical play put everybody on edge.\n\n\r\n              For the Clippers, the 3-point line was a benefit. Los Angeles made 22 of 37 3-pointers fueled by Covington and Westbook making all of their attempts.\n\n\r\n              “I think this is the first time in my career that I went perfect from the 3-point line,” said Covington in his 10th season.\n\n\r\n              The shooting percentage from outside the arc — just under 60% — was well above Los Angeles' average at 38%.\n\n\r\n              “Obviously, they made a lot of shots,” said Memphis forward Santi Aldama, who finished with 17 points on 6 of 7 from the field, adding: “I think the looks we gave them were very easy for the most part. They just got so many free looks.”\n\n\r\n              The win left the Clippers in fifth place in the Western Conference, one game ahead of idle Golden State. But the way the middle of the conference is jumbled, each game is important.\n\n\r\n              “It's going to be tight,” Covington said of the playoff spots. “The West from four through 12 or 13 is like a three-game gap, something like that? So, anything can happen. That's why these last five or six games for us are very important.”\n\n\r\n              TIP-INS\n\n\r\n              Clippers: In addition to George and Leonard, Marcus Morris Sr. sat out his second game under health and safety protocol. ... Terance Mann started in Leonard’s spot. ... G Norman Powell returned after missing 11 games with left shoulder subluxation. He scored 13 points.\n\n\r\n              Grizzlies: C Steven Adams missed his 30th game with a PCL sprain in his right knee. ... Former Clipper Luke Kennard, obtained in a trade-deadline deal, started his 12th game of the season, but first game in a Memphis uniform. He finished with 12 points. ...Memphis' last home loss was Feb. 5 to Toronto.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994164.525551
}