{
  "game_id": "0021400097",
  "espn_id": "400578389",
  "date": "Nov 09, 2014",
  "matchup": "CHA @ LAL",
  "headline": "Lakers rally to beat Hornets for first win of the season",
  "body": "LOS ANGELES -- Purple and gold streamers descended from the ceiling and fans were on their feet applauding at the end. The Los Angeles Lakers finally won a game after five straight losses to open the season.\n\"I know the city probably feels good about it,\" said Byron Scott, who got his first victory as Lakers coach after they rallied to beat the Charlotte Hornets 107-92 on Sunday night.\nThe party atmosphere didn't extend to the Lakers' locker room.\n\"They were all pretty quiet,\" Scott said. \"What I said was, 'OK, that's one.' \"\n\nKobe Bryant and Jeremy Lin each scored 21 points, and Carlos Boozer added 16 as the Lakers left Philadelphia as the NBA's only winless team at 0-7.\n\"We got to start somewhere,\" a subdued Bryant said.\nLin and Boozer's offense dominated the third, when the Lakers were down by seven before a 25-6 run sent them into the fourth leading 76-64.\nIt was a lead they never gave up.\n\"Mentally, it gives us the vision that we can win,\" Scott said.\nAl Jefferson scored 23 points and Kemba Walker added 17 for the Hornets, whose two-game winning streak ended. Gary Neal added 10 of his 14 in the fourth off the bench and Lance Stephenson had 10 rebounds.\n\"The difference was that they made shots and we didn't. Kobe hit a couple of tough fades and Lin hit a few,\" Neal said. \"It doesn't matter that the Lakers were 0-5. Any time you have a Hall of Famer like Kobe, you always have a chance to win.\"\n\nThe Lakers scored 14 unanswered points in their dominating third-quarter run, including eight in a row by Boozer, whose jumper gave them their first lead of the game at 61-59.\nThe Hornets were held to five field goals in the third, and just two over the final 3:48, while getting outscored 34-13 in the period.\n\"We sat down on them defensively,\" Bryant said. \"We flew around and made them take tough shots, made a conscious effort to post Booz early.\"\nBryant, prone to taking over games while his younger teammates watched, still put up the most shots (20) of any Laker, but he scored just nine points in the second half.\nBryant had one basket in the fourth, with six other Lakers contributing to the offense. Lin and Wesley Johnson hit consecutive 3-pointers that had the long-suffering crowd on its feet cheering a victory that wasn't in doubt.\n\"Guys weren't just looking to get the ball to Kobe and step out of the way,\" Scott said. \"I talked to Jeremy before the game about being more assertive on both ends of the floor.\"\nThe Hornets got no closer than eight in the fourth, when the Lakers shot 62 percent.\n\"We stopped playing defense in the second half,\" Charlotte coach Steve Clifford said. \"You could see our language starting to fade when we started missing shots and not playing defense.\"\nTIP-INS\nHornets: Their 92 points were the lowest by a Lakers opponent so far. ... It was Charlotte's first game not decided by single digits.\nLakers: F Ryan Kelly sat out with a sore right hamstring. ... The Lakers avoided losing six straight to open a season for the first time since 1957-58, when the franchise was in Minneapolis and that team lost seven in a row. ... They played just their second game in eight days.\nCOMFY AT HOME\nLin has had three consecutive solid games at Staples Center, with 18 points against Phoenix and 17 against the Clippers.\n\"It's a matter of keeping the aggression high,\" he said. \"I was going to come out guns blazing.\"\nSTREAKING JEFFERSON\nJefferson has had five straight games of 20 points or more and is the only player on the Hornets roster to score in double figures every game so far.\n\"I was surprised they didn't double-team me,\" he said.\nUP NEXT\nHornets: At Portland on Wednesday.\nLakers: At Memphis on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764992320.771961
}