{
  "game_id": "0022400648",
  "espn_id": "401705214",
  "date": "Jan 27, 2025",
  "matchup": "LAL @ CHA",
  "headline": "Anthony Davis scores 42 points, grabs 23 rebounds as Lakers top Hornets 112-107 for 4th straight win",
  "body": "CHARLOTTE, N.C. -- — Anthony Davis had 42 points and 23 rebounds, and the Los Angeles Lakers used a huge first quarter from the All-Star center to build a 23-point lead before beating the Charlotte Hornets 112-107 on Monday night for their fourth straight win.\n\n\r\n              LeBron James had 22 points and Austin Reaves chipped in 17 for the Lakers, who never trailed.\n\n\r\n              Miles Bridges had 26 points for the Hornets, who lost LaMelo Ball in the second quarter to a left ankle injury after he stepped on Jarred Vanderbilt’s foot as he backpedaled down the court after draining a 3-point jumper off one foot.\n\n\r\n              It was supposed to be a celebratory night for the Hornets in a game that was aired on free, local over-the-air TV throughout the Carolinas for the first time since the 2007-08 season — giving them a chance to potentially capture a new audience.\n\n\r\n              But it didn't go as planned. \n\n\r\n              Davis scored 21 points in the first quarter on 9-of-12 shooting to go along with 11 rebounds as the Lakers bolted to a 39-19 lead. \n\n\r\n              Takeaways\r\n              Lakers: Davis was dominant and there was nothing Mark Williams could do stop him. Williams struggled to defend Davis on the perimeter as he sank a series of uncontested fadeaway jumpers. Four Lakers starters played at least 36 minutes.\n\n\r\n              Hornets: Ball has missed 158 games during his NBA career due to injury. He came in averaging 28.9 points, but was not chosen an All-Star starter despite leading all Eastern Conference guards in voting.\n\n\r\n              Key moment\r\n              After Charlotte pulled within six with about a minute to play, Dorian Finney-Smith drove the lane for a high-flying dunk over Bridges. \n\n\r\n              Key stat\r\n              Los Angeles made 14 of 16 shots to open the game. \n\n\r\n              Up next\r\n              The Lakers are at Philadelphia on Tuesday; the Hornets host the Nets on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997168.716727
}