{
  "game_id": "0022400270",
  "espn_id": "401704836",
  "date": "Nov 23, 2024",
  "matchup": "LAL vs. DEN",
  "headline": "Jokic score 34, Porter adds 24 as Nuggets use strong second half to beat Lakers 127-102",
  "body": "LOS ANGELES -- — Nikola Jokic scored 34 points and Michael Porter Jr. added 24 as the Denver Nuggets used a strong second half to beat the Los Angeles Lakers 127-102 on Saturday night.\n\n\r\n              Russell Westbrook had 14 points, 11 assists and seven rebounds for Denver against his former team. \n\n\r\n              Austin Reaves scored 19 points and LeBron James added 18 for the Lakers, who lost consecutive home games after starting the season 7-0 at home. Rui Hachimura, back in the starting lineup after missed the previous five games with a left ankle sprain, scored 10 points in 22 minutes.\n\n\r\n              It was the teams' first meeting since the Nuggets beat the Lakers in the first round of the playoffs earlier this year. Denver also swept them in the Western Conference final the previous year.\n\n\r\n              Denver trailed by six points at halftime but outscored Los Angeles 37-15 in the third quarter and 70-39 for the second half while dominating inside and outside. \n\n\r\n              Takeaways \r\n              Lakers: The Lakers led 63-57 at halftime and let the game get away from them in a lackluster third quarter. It shows they still have much work to do to get out from Denver’s control. \n\n\r\n              Nuggets: Even in playing on the second of a back-to-back and traveling, Denver still had the legs for long-range shots. Denver was 16 for 32 on 3-pointers.\n\n\r\n              Key moment \r\n              Westbrook had a putback dunk at the end of the third quarter to put the finishing touches on an authoritative quarter and extend the lead to 94-77. Westbrook then twirled his arms around emphatically in celebration as he ran back down the floor. \n\n\r\n              Key stat \r\n              The Nuggets outscored the Lakers 20-4 in the paint in the third quarter.Jokic had nine points in the pivotal third in which Denver scored 37 points. \n\n\r\n              Up Next \r\n              Nuggets host the New York Knicks on Monday, and Lakers visit Phoenix to open a road back-to-back.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997208.298765
}