{
  "game_id": "0022000906",
  "espn_id": "401307706",
  "date": "Apr 24, 2021",
  "matchup": "DET @ IND",
  "headline": "Pacers use late 12-0 run to beat Pistons 115-109",
  "body": "INDIANAPOLIS -- — The Indiana Pacers were without their two best inside players and getting dominated on the boards, yet found a way to win thanks to a timely defensive switch, balanced scoring and the Detroit Pistons' sloppy ballhandling.\n\n\r\n                    Malcolm Brogdon scored 26 points, Caris LeVert had 25 and the Pacers had a late 12-0 run to beat the Pistons 115-109 on Saturday night.\n\n\r\n                    The Pacers were without All-Star forward Domantas Sabonis and center Myles Turner and got outrebounded 62-39, yet rallied in the fourth quarter after coach Nate Bjorkgren switched to a zone defense.\n\n\r\n                    “It was great switching to the 2/3 zone,” LeVert said. “We were able to get out in the open court and get some layups.”\n\n\r\n                    The Pacers trailed 101-97 with 4:41 remaining when LeVert made a layup to start the run. Brogdon hit a 3-pointer and added a layup, the latter making it 109-101 with 2:42 remaining.\n\n\r\n                    “Credit the guys for being active in it,” Bjorkgren said of the zone.\n\n\r\n                    The Pistons had 18 turnovers compared to the Pacers' four.\n\n\r\n                    “I think we out-competed them in a lot of areas,” Pistons coach Dwane Casey said. “But the turnovers are the difference.”\n\n\r\n                    Edmond Sumner added 22 points for the Pacers. They swept the season series from the Pistons for the first time since 2016-17 and have won 10 of 12 at home against Detroit.\n\n\r\n                    “They made their runs and we could have quit, but we fight to the final buzzer,” said Pacers guard T.J. McConnell, who had 13 assists and five steals. “It speaks volumes about the guys we have in this locker room.”\n\n\r\n                    Jerami Grant, who missed the previous game with a quad injury, led the Pistons with 25 points. Mason Plumlee had 17 points and 21 rebounds.\n\n\r\n                    The Pistons have lost six in a row on the road and seven of nine overall to fall to 18-43.\n\n\r\n                    Sumner scored 14 of his 22 points in the first quarter to help the Pacers take a 35-25 lead.\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: A 62-39 rebounding edge included 15-9 on the offensive glass. ... Stepped on the baseline twice for turnovers on inbounds plays.\n\n\r\n                    Pacers: LeVert has scored at least 20 points in six of eight starts and Brogdon has had 20 in five of seven starts.\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Host Atlanta on Monday night.\n\n\r\n                    Pacers: At Orlando on Sunday night.\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997902.838258
}