{
  "game_id": "0022301134",
  "espn_id": "401585762",
  "date": "Apr 07, 2024",
  "matchup": "POR @ BOS",
  "headline": "Jaylen Brown scores 26 points and reaches 10,000 in his career in Celtics' 124-107 win over Portland",
  "body": "BOSTON -- — Jaylen Brown scored 26 points and reached 10,000 in his NBA career, leading the Boston Celtics past the Portland Trail Blazers 124-107 on Sunday night for their 13th straight home victory.\n\n\r\n              Kristaps Porzingis had his third straight double-double with 12 points and 10 rebounds in just 27 minutes for NBA-leading Boston.\n\n\r\n              Payton Pritchard scored 20 points, Derrick White had 15 and Jrue Holiday 12 for the Celtics, who have won 14 of their last 16 overall.\n\n\r\n              “The type of guy that he is, the hard work that he puts in and the growth that he's shown this year to become a complete player at both ends of the floor, I know he's happy about that,\" Boston coach Joe Mazzulla said of Brown's career achievement. “It's cool to be able to coach guys that get to those type of milestones and be a part of that.”\n\n\r\n              Dalano Banton led Portland with 28 points and Deandre Ayton had 22 points and 14 rebounds. Jabari Walker added 14 points and 18 rebounds for the Trail Blazers, who finished 2-5 on their seven-game road trip.\n\n\r\n              Celtics star Jayson Tatum sat out because of a right knee contusion. It was the sixth game missed for the team’s leading scorer (27.0 points per game). \n\n\r\n              Boston locked up the league’s best record and home-court advantage throughout the playoffs last week.\n\n\r\n              Playing in his eighth season, the 27-year-old Brown reached 10,000 points with a driving left-handed scoop shot in the opening minute of the second half.\n\n\r\n              During the game’s next timeout, the PA announcer informed the crowd that he reached the milestone and the TD Garden crowd gave him a standing ovation. He walked onto the court, waved and smiled before play resumed.\n\n\r\n              “It was great, especially all of the supporters who have supported me from Day One,\" Brown said of the ovation. “Obviously, things have been up-and-down throughout the early stages of my career and I've been able to get different opportunities, been able to improve, but also been able to gain more responsibility. ... For the JB fans who stayed in my corner from Day One, I feel that love.” \n\n\r\n              Boston was up by eight in the final quarter before putting it away with consecutive 3-pointers from Sam Hauser and Xavier Tillman that closed a 12-0 spree, making it 112-94 with just over four minutes left.\n\n\r\n              The Celtics took the lead on Brown’s basket late in the first quarter and never trailed again.\n\n\r\n              During pregame lineup introductions, the Celtics congratulated Portland coach Chauncey Billups on being elected into the Naismith Basketball Hall of Fame. Billups and Vince Carter headed a 13-member class that was announced Saturday.\n\n\r\n              “That was very nice of them,” Billups said of the crowd's ovation. “I'm very appreciative of that. ... My time here was short, but it was good. I enjoyed being a Celtic for the cup of coffee, if you will. This is an incredible sports town, rich history with the Celtics. I was a part of it for a small amount of time. I appreciate the fact that they appreciate my time here.”\n\n\r\n              Billups was drafted by the Celtics but traded early in his rookie season.\n\n\r\n              White left Boston's locker room after the game wearing a Billups' Colorado jersey from the Hall of Famer's college days. \n\n\r\n              Early in the first quarter, Boston welcomed back former center Robert Williams III along with guard Malcolm Brogdon. Both were traded to Portland in an offseason deal that landed them Holiday. There was a picture of Williams with his nickname “Time Lord” on the video board. \n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Host New Orleans on Tuesday.\n\n\r\n              Celtics: At Milwaukee on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996603.674927
}