{
  "game_id": "0021900817",
  "espn_id": "401161459",
  "date": "Feb 12, 2020",
  "matchup": "LAL @ DEN",
  "headline": "James' triple double, Davis lead Lakers past Nuggets 120-116",
  "body": "DENVER --  LeBron James wasn't about to coast into the All-Star break, and neither was Anthony Davis.\n\n\"I could tell they were locked in pregame. LeBron had his jersey with like 80 minutes to go before the game,\" guard Alex Caruso said after the Los Angeles Lakers' 120-116 overtime triumph in Denver on Wednesday night.\n\nJames posted his 12th triple-double of the season, tied with Luka Doncic for the NBA lead, and Davis scored seven of his 33 points in overtime as the Western Conference leaders took a 41-12 record and a four-game lead over second-place Denver into the All-Star break.\n\n\"I was trying to be laser sharp, laser focused as I could,\" James said. \"I know the break was coming, but I wasn't going to take this opportunity for granted. I wanted to play extremely well tonight for our ballclub and I wanted us to play extremely well going into the break on a high note. And our team, we responded very well.\"\n\nThe Nuggets were the hottest team in the league, having won six of seven, including short-handed stunners at Milwaukee and Utah.\n\nSo, James, who had 32 points, 14 assists and 12 rebounds, saw this as playoff prep.\n\n\"Every opportunity we get to play in a close game against a tough opponent, it's a learning experience for all of us,\" he said. \"It prepares us for a postseason game where it's going to be back and forth, back and forth. I thought tonight was a playoff atmosphere for both teams, being No. 1 and No. 2 in the Western Conference, jockeying for position. We were just trying to make plays whatever it takes. And A.D. was there knocking down big 3s and getting a block and getting some stops, the jump ball, as well. It was big time.\"\n\nIn addition to his 33 points, Davis tied up All-Star Nikola Jokic for a key jump ball late in regulation when the officials had to waive off the basket by Denver's big man after he muscled the ball away from Davis and into the basket.\n\nJokic has 22 points and 11 rebounds for Denver, which saw its four-game winning streak snapped.\n\nDwight Howard added 14 points for the Lakers, who improved their NBA-best road record to 23-5.\n\nJamal Murray led the Nuggets with 33 points, but Jokic was in foul trouble late and made some crucial blunders in the extra period, including a turnover on a bad pass with 19 seconds left after he passed up an open 3-pointer with Denver down 119-116.\n\nThe back-and-forth game went to overtime tied at 111 when James' fadeaway 15-footer hit the iron and bounced away at the buzzer.\n\nGary Harris' 3-pointer tied it at 116 with 3:06 remaining in overtime, but the Nuggets suddenly went cold, especially Jokic, who missed three shots and bypassed a wide-open 3 with 20 seconds left and the Nuggets down 119-116. He followed with a bad pass right into the arms of Kentavious Cadlwell-Pope.\n\n\"It was a close game. We just didn't execute in the last minutes,\" Jokic said. \"I made a lot of terrible mistakes. Every decision was bad. So, I need to be better with my decision-making. I think I just need to look to shoot a little bit more.\"\n\nNO RUNAWAY\n\nLA opened the second half with a 3-pointer by Danny Green and a thunderous dunk by James for an 11-point lead, the Lakers' largest of the night. But the Nuggets used an 11-0 run capped by Jokic's long 3-pointer to tie it at 66.\n\nJokic picked up his fourth foul and went to the bench with 4:44 left in the third quarter. The Nuggets vehemently argued the call because Davis took three steps in the paint before contact and should have been called for a travel.\n\nBut his teammates picked up the slack to give the Nuggets an 87-84 lead heading into the fourth quarter. Jokic returned with Denver trailing 97-94 with 7 1/2 minutes left in regulation.\n\nJames' jumper put Los Angeles ahead 53-51 and his drive to the hoop with one-tenth of a second left gave the Lakers a 61-55 halftime lead.\n\nSILVER LINING\n\nDespite the disappointment, the Nuggets are pleased to take a 38-17 record into the All-Star break.\n\n\"Of course nobody wants to lose, but we lost to an amazing team,\" said Jokic, who was battered after 37 minutes of having James, Davis and Dwight Howard come at him in waves. \"They are one of the best teams in the NBA right now. They are playing at a really high level. It's not a bad thing to lose against them, especially because it's overtime and we put up a fight.\"\n\nAnd Denver was without the injured trio of Mason Plumlee, Michal Porter Jr. and Will Barton III.\n\n\"We are still second,\" Jokic said, \"so I like it.\"\n\nTIP-INS\n\nLakers: Took control in the second quarter by outscoring Denver 20-8 in the paint. ... The Lakers forced Denver into a pair of 24-second violations, including on the game's first possession.\n\nNuggets: Jokic was honored for his All-Star selection in a pregame ceremony that included a framed All-Star jersey. ... Reserves Paul Millsap, Monte Morris and Noah Vonlieh each sank their only 3-point attempt of the first half, whereas the starting five went a combined 3 for 10 from long range.\n\nUP NEXT\n\nLakers: host Memphis on Feb. 21 after the All-Star break.\n\nNuggets: visit Oklahoma City on Feb. 21.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995974.9131908
}