{
  "game_id": "0022400463",
  "espn_id": "401705029",
  "date": "Jan 02, 2025",
  "matchup": "MIA vs. IND",
  "headline": "Haliburton scores 33 and hands out 15 assists, leading Pacers to 128-115 win over Heat",
  "body": "MIAMI -- — Tyrese Haliburton scored 33 points and handed out 15 assists, Myles Turner added 21 points and the Indiana Pacers rolled past the Miami Heat 128-115 on Thursday night.\n\n\r\n              Pascal Siakam had 18 points and 11 rebounds for the Pacers, who shot 53% and led by as many as 28.\n\n\r\n              Kel’el Ware led the Heat with 25 points. Bam Adebayo scored 20, Tyler Herro added 17 and Terry Rozier had 16 for Miami.\n\n\r\n              Jimmy Butler scored nine points, and didn’t play in the fourth quarter for a second consecutive night. He also had nine points in Wednesday's win over New Orleans.\n\n\r\n              Takeaways\r\n              Pacers: Indiana made 17 3-pointers and the Pacers are now 8-2 this season when connecting at least 15 times from beyond the arc. They're 5-10 this season in games where they made 12 or fewer from 3-point range.\n\n\r\n              Heat: Thursday was the 25th anniversary of Miami's first game at what is now called Kaseya Center. The Heat beat Orlando 111-103 on opening night, Jan. 2, 2000. They're now 736-395 in the building, including 86-36 in playoff games.\n\n\r\n              Key moment\r\n              Miami was within 14 early in the third, before the Pacers got six points in 30 seconds — a three-point play from Turner and a 3-pointer from Siakam — to go up 78-58 with 8:08 left in that quarter.\n\n\r\n              Key stat\r\n              Haliburton had 16 points and five assists in the first quarter. It marked the third time in his career that he has done that in a quarter, joining the third quarter of a Pacers-Charlotte game on Nov. 4, 2023 (25 and 6) and the fourth quarter of a Pacers-San Antonio game on Oct. 21, 2022 (18 and 5). Oddly, the Pacers lost both of those games.\n\n\r\n              Up Next\r\n              Both teams are at home Saturday night, with the Pacers hosting Phoenix and the Heat hosting Utah.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996913.4890828
}