{
  "game_id": "0021700731",
  "espn_id": "400975477",
  "date": "Jan 28, 2018",
  "matchup": "MIL @ CHI",
  "headline": "Antetokounmpo scores 27, Bucks beat Bulls 110-96",
  "body": "CHICAGO --  The Milwaukee Bucks came into the season expecting to be in the top half of the Eastern Conference playoff race. They just might make a run if they keep playing like this.\n\nGiannis Antetokounmpo scored 27 points and Milwaukee beat the Chicago Bulls 110-96 on Sunday.\n\nThe All-Star forward added nine rebounds and eight assists to help the Bucks improve to 3-0 since interim coach Joe Prunty replaced the fired Jason Kidd. Milwaukee hasn't exactly been beating the heavyweights, knocking off Phoenix and Brooklyn before taking out Chicago.\n\nEven so, this is encouraging.\n\n\"I see that guys are playing harder,\" Antetokounmpo said. \"Some guys -- I don't know what they're thinking in their heads. Maybe (they were) not OK with what happened. I just see guys playing hard.\"\n\nKhris Middleton added 20 points and seven rebounds. Jason Terry came off the bench to score a season-high 12 points, nailing four of Milwaukee's 13 3-pointers.\n\nThe Bucks shot just over 53 percent overall for the game and used a big second quarter to build a 19-point halftime lead, sending Chicago to its fourth straight loss.\n\n\"Right now, you can tell guys are a little bit looser,\" Middleton said. \"With Joe, he preaches confidence. His plays are designed for us to move the ball side to side more. And just, not necessarily playing off one matchup, but just trying to use the matchup as a decoy to get other guys shots.\"\n\nHe said Prunty is \"much more relaxed\" and that teams \"usually take on the personality of the coach.\"\n\nDenzel Valentine scored 18 for the Bulls. Lauri Markkanen added 17 points and 10 rebounds, but Zach LaVine had another rough outing. The two-time slam dunk champion finished with six points on 2-of-11 shooting in his eighth game back from a torn ACL in his left knee, after going 3 of 17 in a loss to the Los Angeles Lakers on Friday.\n\nCoach Fred Hoiberg insisted LaVine will find his rhythm, and he likes what he is seeing from him on defense, particularly when he's guarding the ball.\n\n\"I'm not worried.,\" Hoiberg said. \"Zach's offense will come. He's a proven scorer. There's no doubt about that. He's missing shots that he normally makes and shots that he made when he first came back in those first couple games. ... The encouraging thing is, his defense has been better.\"\n\nTIP-INS\n\nBucks: Terry hadn't scored in double figures since a 15-point outing against Charlotte on April 10. That was also the only time in 74 games last season that he finished with 10 or more. ... G Malcolm Brogdon missed his second consecutive game because of a sore right calf. ... The Bucks had 11 steals -- nine in the first half.\n\nBulls: Markkanen now has 721 points, surpassing Hanno Mottola (715) as the career leading scorer among NBA players from Finland. He also recorded his 12th double-double -- second among NBA rookies. ... The Bulls don't have a timeline on when G Kris Dunn will return from a concussion. He missed his fifth game in a row.\n\nBREAKING IT OPEN\n\nThe Bucks took a 61-42 lead to the locker room after outscoring Chicago 35-22 in the second quarter.\n\nMilwaukee got back-to-back 3-pointers in the opening minutes of the period from the 40-year-old Terry and bumped the lead to 20 near the end of the half.\n\nSterling Brown and Middleton nailed 3s and a cutting Antetokounmpo threw down a dunk to make it 56-36. The Bucks then shook off 3s for Chicago by Valentine and Nikola Mirotic, with former Bull Tony Snell hitting one of his own and Antetokounmpo burying a turnaround jumper from around the foul line to make it a 19-point game.\n\nPARKER'S PROGRESS\n\nForward Jabari Parker said he expects to know a target date this week for his return from the second major knee surgery of his young career.\n\nThe Chicago product played 2-on-2 on Saturday and had \"a good workout\" prior to Sunday's game.\n\nParker, the second overall pick in the 2014 draft, was averaging 20.1 points when he tore his left ACL in a game against Houston on Feb. 8, 2017. It was his second major injury to that knee in three seasons. He had surgery six days later, and the Bucks said it would take a year for him to return.\n\nUP NEXT\n\nBucks: Host Philadelphia on Monday.\n\nBulls: Visit Portland on Wednesday.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993012.262641
}