{
  "game_id": "0021800225",
  "espn_id": "401070906",
  "date": "Nov 17, 2018",
  "matchup": "PHI @ CHA",
  "headline": "Jimmy Butler's last-second 3 lifts Sixers in OT despite Kemba Walker's 60 points",
  "body": "CHARLOTTE, N.C. -- JJ Redick jokingly bet new 76ers teammate Jimmy Butler on the bench that he wouldn't call \"game\" on the final shot.\nButler responded with \"bet.\"\nButler, in his third game with his new team, drained a 3-pointer as time expired in overtime and Philadelphia overcame an NBA season-high 60 points from Kemba Walker to beat the Charlotte Hornets 122-119 on Saturday night.\n\n\"As much as I wanted the shot to go in to win the game, I also wanted it to go in because I didn't want Kemba to give me 70,\" Butler said with a laugh. \"I wanted it to stop at 60.\"\nWalker's 60 points were a career high and topped Klay Thompson's 52 for Golden State against Chicago on Oct. 29 for most in the league this season.\nAnd after only scoring seven points in his last game, a loss at Cleveland on Tuesday, Walker set an all-time NBA record by increasing his total by 53 points from game to game.\nBut the two-time All-Star was noticeably upset after the game about the team's third loss this season to the 76ers, two of which have come in overtime.\n\"I'm still proud, that's an unbelievable thing to do right there,\" Walker said of scoring 60 points. \"I'm just mad that we lost. I'm a competitor. It would have been even better with a win.\"\nPhiladelphia coach Brett Brown called Walker's effort \"amazing and incredible.\"\n\"We tried double-teaming him, we tried hard-hedging him,\" Brown said. \"The reality of it is, is that you have Joel (Embiid) and Jimmy in that situation a lot and he is doing that against two all-league defensive players. He is just hard to guard and he is really unique. ... Sixty points in an NBA game against a pretty good defensive team is a remarkable effort.\"\nWalker had 37 and 30 points in his previous two games against the 76ers, but only shot a combined 33 percent.\n\nThis time he was making everything, including banking in a 3-pointer to give the Hornets the lead with 44 seconds left in regulation after they had trailed by 17 earlier in the game. Walker held up his palms and shrugged his shoulders after the ball went in, similar to that famous gesture by Hornets owner Michael Jordan many years ago with the Bulls.\nWalker finished 21 of 34 from the field and had six 3-pointers. He made all 12 foul shots and had seven rebounds and four assists.\nBut while Walker had the big numbers, Butler made the big plays.\nAlong with his game-winner, he also blocked Walker's shot on a drive with 15 seconds left and then saved the ball from going out of bounds. Walker thought he got fouled, but it wasn't called.\n\"That was an incredible 20 seconds of Jimmy Butler,\" Brown said.\nSaid Butler: \"I didn't think (Walker) would settle for a jump shot in that moment. So he did what I wanted him to do (and drove). I just got a piece of the ball.\"\nAs for the game-winner, he said it's a shot he practices often, and worked on it 50 times earlier that morning.\nSince the start of last season, Butler had been 0-for-11 on game-tying or go-ahead field goal attempts in the final 10 seconds -- the most misses without a make in the NBA.\n\n\nBUTLER ADJUSTING\nButler scored 15 points and said he is adapting well to his new teammates.\n\"Basketball is basketball to me,\" he said. \"We play basketball the right way. We guard and we are in it together. We are going to have practice time (coming up) and I will pick up quicker sooner rather than later.\"\nBIG AGAIN\nEmbiid finished with 33 points and 11 rebounds and Ben Simmons had 23 points, 11 rebounds and nine assists as the 76ers defeated Charlotte for the third time this season.\nEmbiid has feasted on the Hornets this season, with 42 points and 18 rebounds and 27 points and 15 rebounds in his previous two games.\nHAPPY ANNIVERSARY\nLarry Johnson, Alonzo Mourning, Glen Rice, Muggsy Bogues and Dell Curry were among those on hand as Charlotte celebrated its recently selected 30th anniversary team. Walker, the Hornets' all-time leading scorer, was also a member.\nTIP-INS\n76ers: Redick finished with 23 points, including two key jumpers in overtime. ... Simmons threw an alley-oop pass to a breaking Butler from three-quarters court.\nHornets: Nic Batum, who has struggled of late, was booed by the home crowd after an airball in the third quarter. He didn't score in the game and only played two minutes in the second half. ... James Borrego picked up his first technical foul as Hornets coach. ... Marvin Williams and Cody Zeller fouled out.\nUP NEXT\n76ers: Host the Phoenix Suns on Monday night.\nHornets: Host the Boston Celtics on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994066.351986
}