{
  "game_id": "0021601225",
  "espn_id": "400900603",
  "date": "Apr 12, 2017",
  "matchup": "OKC vs. DEN",
  "headline": "Robertson honors Westbrook, but Nuggets top Thunder",
  "body": "OKLAHOMA CITY --  Russell Westbrook soaked in all he had accomplished this season, with a little help from Oscar Robertson.\n\nWestbrook broke Robertson's single-season record for triple-doubles by getting his 42nd on Sunday against the Denver Nuggets. Robertson attended Wednesday's game between Oklahoma City and Denver as part of the Thunder's effort to honor Westbrook for his record-setting season. Robertson congratulated Westbrook, and at the end of a short speech, he got the crowd fired up with an endorsement.\n\n\"I only have one more thing to say: M-V-P!! \" Robertson said, triggering a loud ovation.\n\nWestbrook only played the first half of Oklahoma City's 111-105 loss Wednesday night, but because of the unique circumstances, he was in a good mood after the game. He said Robertson's presence was meaningful.\n\n\"That's obviously an unbelievable honor,\" he said. \"Overall, just having him here is a blessing in itself. It was something I could never dream about, especially to have the Big O here in Oklahoma City.\"\n\nRobertson said Thunder fans should be proud of Westbrook, the first player since Robertson in 1961-62 to average a triple-double for a season.\n\n\"When Russell was on this journey, I felt that I just had to be here,\" Robertson told the crowd. \"What he has done has been historic in nature. He's played with passion and pride and ability. It's is just outstanding what he has done and the way he did it.\"\n\nRobertson's presence meant something to Thunder coach Donovan, too. Donovan remembered his family talking about Robertson when he was a child.\n\n\"I think when you think of Oscar Robertson, everyone thinks of the triple-doubles,\" Donovan said. \"For Russell to be able to do that, and for Oscar Robertson to be here to share in it was a great moment.\"\n\nWestbrook was on pace for another triple-double at halftime with eight assists, five points and five rebounds in 18 minutes before Donovan decided to rest him for the second half.\n\nNikola Jokic finished with 29 points, 16 rebounds and eight assists for the Nuggets, who beat the Thunder for the first time in four tries this season.\n\nJerami Grant and Taj Gibson each scored 13 points for the Thunder, who will play the Houston Rockets on Sunday night in Game 1 of their playoff series.\n\nTIP-INS\n\nNuggets: F Danilo Gallinari (rest), F Will Barton (left foot soreness), F Kenneth Faried (lower back), G Gary Harris (knee), G Jameer Nelson (right calf strain) and F Wilson Chandler (coach's decision) did not play.\n\nThunder: Westbrook went 1 for 7 in the first quarter, but the Thunder still led 26-25. ... G Alex Abrines broke James Harden's Oklahoma City rookie record for 3-pointers in a season. ... F Andre Roberson (rest) and F Doug McDermott (knee) sat out. Donovan said McDermott could have played if needed.\n\nSTAT LINES\n\nWestbrook averaged better than 30 points, 10 rebounds and 10 assists this season. The last player to average 30 points and 10 rebounds was Karl Malone in 1989-90. The last to average 30 points and 10 assists was Nate Archibald in 1972-73.\n\nLUCKY FAN\n\nTiandre Nichols, a 25-year-old from Tulsa, Oklahoma, hit a halfcourt shot during a MidFirst Bank promotion and won $20,000. The team said it was the first game Nichols attended this season, and he brought his girlfriend to her first-ever Thunder game. The left-handed shot bounced up before it went in. He called it his \"Westbrook moment.\"  It's the 11th winner in Thunder history and the second this season.\n\nQUOTABLE\n\nNuggets coach Michael Malone on Denver finishing the season strong: \"The fact that we were 5-2 in our last seven games speaks directly to our guys understanding the pressure of the games we were playing, and even after that devastating loss at home (Sunday) to Oklahoma City, we still had a job to do.\"\n\nUP NEXT\n\nThe Nuggets' season is over.\n\nThunder will face the Houston Rockets on Sunday in the playoffs.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995237.237522
}