{
  "game_id": "0022000849",
  "espn_id": "401307645",
  "date": "Apr 16, 2021",
  "matchup": "TOR vs. ORL",
  "headline": "Watson, Watanabe lead Raptors past Magic, 113-02",
  "body": "TAMPA, Fla. -- — Paul Watson Jr. scored 20 of his career-high 30 points in the third quarter Friday night and the Toronto Raptors pulled away to a 113-102 victory over the Orlando Magic.\n\n\r\n                    Playing in only his second game after missing 11 games due to the NBA's COVID-19 protocol, Watson converted six straight 3-point shots in the period, in which Toronto outscored the Magic 38-19.\n\n\r\n                    “I had a tough little stretch of about three days,” Watson said of his coronavirus experience, “but I feel like my preparation since then is really helping me get to where I am now. It is taking a toll, fatigue-wise, but I think it has helped me.”\n\n\r\n                    Yuta Watanabe also had a career high for the Raptors, contributing 21 points and six rebounds. \n\n\r\n                    Wendell Carter Jr. led Orlando with 20 points and nine rebounds on his 22nd birthday. Rookie Cole Anthony added 19 points.\n\n\r\n                    “We made a lot of bad defensive reads. We made a lot of mistakes,” Carter said. “Instead of making them score over us or through us, they were having wide-open shots, dunks, layups.”\n\n\r\n                    Watson got his first NBA start for the Raptors, who used a different starting lineup for the sixth straight game. The game started badly for the Raptors, who missed their first seven 3-point shots and trailed throughout most of the first half.\n\n\r\n                    After Watson's scoring outburst it was a different story. The Raptors wound up shooting 50% for the game.\n\n\r\n                    “(Watson) got on one tonight, right?” Toronto coach Nick Nurse said. “I’m not sure anybody was expecting that. He’s had a tough go of it of late, but he came back into form. He has really become a threat.”\n\n\r\n                    Fred VanVleet returned from a seven-game absence (six games for a hip flexor and a one-game suspension) with six points and six assists.\n\n\r\n                    The win was the second straight for the Raptors, who were playing without four of the players in their regular rotation.\n\n\r\n                    Three free throws by Chris Boucher broke a 61-all tie midway through the third quarter, and Watson followed two straight Orlando turnovers with 3-pointers to put the Raptors up by nine.\n\n\r\n                    “When you fall into one of those zones, the basket looks really big,” he said.\n\n\r\n                    Playing only 26 minutes, Watson shot 10 for 13 overall and 8 for 11 from behind the arc. \n\n\r\n                    TIP-INS\n\n\r\n                    Magic: G Michael Carter-Wiliams (ankle), C Mo Bamba (hip) and F Otto Porter Jr. (foot) did not play. ... The Magic have lost seven straight to the Raptors, and seven of their last eight overall.\n\n\r\n                    Raptors: Pascal Siakam (rest) and OG Anunoby (knee), Toronto's top two scorers in Wednesday night's win over San Antonio, did not play, along with G Kyle Lowry (rest) and G Gary Trent Jr. (ankle). ... C Freddie Gillespie will get another 10-day contract this weekend, Nurse said.\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Play at home against Houston on Sunday night.\n\n\r\n                    Raptors: Play against Oklahoma City in Tampa on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764996825.13414
}