{
  "game_id": "401810103",
  "espn_id": "401810103",
  "date": "Nov 17, 2025",
  "matchup": "DEN vs CHI",
  "headline": "Huerter, Vucevic hit big 3-pointers down the stretch as Bulls hold off Nuggets 130-127",
  "body": "DENVER -- — Kevin Huerter and Nikola Vucevic hit big 3-pointers down the stretch and the Chicago Bulls overcame a triple-double by Nikola Jokic to hold off the Denver Nuggets 130-127 on Monday night.\n\n\r\n              The Bulls squandered an 18-point lead in the first half. They also let a 13-point lead in the fourth quarter slip away before rallying late to snap a five-game losing streak.\n\n\r\n              Huerter hit a go-ahead 3-pointer with 1:25 left and Vucevic later extended the lead with another with 33 seconds remaining. Denver had a chance to tie it, but Jokic's shot at the buzzer was off the mark.\n\n\r\n              Ayo Dosunmu and Josh Giddey led six Bulls players in double figures with 21 points each. Giddey also had 14 rebounds. \n\n\r\n              Chicago handed the Nuggets their first home loss of the season in a game in which the Bulls held a 66-9 advantage in bench scoring.\n\n\r\n              The Bulls showed no signs of exhaustion despite arriving in the Mile High City off a 150-147 double-overtime loss in Utah the night before. \n\n\r\n              Jokic finished with 36 points, 18 rebound and 13 assists for his eighth triple-double of the season. He was an assist shy of reaching the mark by halftime. Jamal Murray scored 18 of his 34 points in the fourth quarter.\n\n\r\n              Aaron Gordon had 24 points for the Nuggets, who saw their seven-game winning streak halted. Denver remains without shooting guard Christian Braun (left ankle).\n\n\r\n              The Bulls sat Coby White (strained right calf) after he played 30 minutes and scored 27 points on Sunday.\n\n\r\n              Up next\r\n              Bulls: Finish a four-game trip Wednesday at Portland.\n\n\r\n              Nuggets: Begin a two-game trip Wednesday at New Orleans.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042646.775794
}