{
  "game_id": "401809966",
  "espn_id": "401809966",
  "date": "Oct 26, 2025",
  "matchup": "DAL vs TOR",
  "headline": "Cooper Flagg scores 22 points as Mavs beat Raptors 139-129 for 1st win with No. 1 overall pick",
  "body": "DALLAS -- — Cooper Flagg scored 22 points and had a soaring one-handed dunk during the decisive run, helping the Dallas Mavericks beat the Toronto Raptors 139-129 on Sunday night for their first victory with the No. 1 overall pick.\n\n\r\n              Anthony Davis had 25 points and 10 rebounds as the Mavericks won the third of five consecutive home games to start the season, a night before they face defending champion Oklahoma City to finish a back-to-back.\n\n\r\n              Scottie Barnes had 33 points and 11 rebounds for the Raptors, who play another game in Texas at San Antonio on Monday night.\n\n\r\n              Flagg started a 13-0 run in the third quarter with a bucket and finished it by taking a bounce pass from D'Angelo Russell in transition, dunking over Sandro Mamukelashvili and getting fouled. The free throw put Dallas up 95-85.\n\n\r\n              The one-and-done star from Duke stopped a 7-0 Toronto run with a 3-pointer to reach 20 points for the first time and get the Dallas lead back to 12 midway through the fourth quarter.\n\n\r\n              P.J. Washington had a pair of three-point plays and a 3-pointer in the fourth to help keep the Raptors from rallying and finished with 17 points, seven rebounds and five assists.\n\n\r\n              Russell had 24 points and a team-high six assists to lead three double-figure scorers off the Dallas bench. Max Christie scored 17 points, and Naji Marshall made all four shots and all four free throws for 12 points.\n\n\r\n              Brandon Ingram scored 22 points for Toronto, and RJ Barrett and Mamukelashvili had 16 apiece.\n\n\r\n              Up next\r\n              Raptors: The Texas trip makes it three games in four nights, following Toronto's home opener Friday.\n\n\r\n              Mavericks: After the Thunder visit, the unusual five-game homestand to start the season wraps up with Indiana, which lost to Oklahoma City in the NBA Finals.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042507.36971
}