{
  "game_id": "0021500258",
  "espn_id": "400828145",
  "date": "Nov 30, 2015",
  "matchup": "MIL vs. DEN",
  "headline": "Monroe scores 18 in Bucks' 92-74 win over Nuggets",
  "body": "MILWAUKEE --  Michael Carter-Williams, who lost his starting job while struggling this season, had a new look Monday night.\n\nSporting a closely cropped haircut, Carter-Williams had 12 points, nine assists and six rebounds, and the Milwaukee Bucks forced 24 turnovers that led to 35 points in a 92-74 victory over the Denver Nuggets.\n\n\"A fresh haircut (leads) to a fresh start,\" said Carter-Williams, who shot 5 of 9 in 30 minutes after coming off the bench for the second consecutive game. \"I just wanted to go out there and feel good and play good.\"\n\nCarter-Williams keyed a 10-0 third-quarter run that allowed Milwaukee to take control of the game, scoring the go-ahead basket and adding two assists.\n\n\"Coaches don't measure a guy on scoring; we look at if he's making the right plays,\" Milwaukee coach Jason Kidd said. \"Sometime that gets overlooked. Mike did a lot of good things tonight which he carried over from last night (in Charlotte). Might have started with the haircut, but it was more that you could see his energy.\"\n\nThe Nuggets have lost seven consecutive games.\n\n\"Overall, a very poor performance for us as a team,\" Denver coach Michael Malone said, adding it \"seems like ages ago\" since his team won a game.\n\n\"But we've gotten far, far from that,\" he said. \"I just don't know how much it hurts for those guys in that locker room.\n\n\"I know some guys care,\" he said. \"Some guys hate to lose. I think other guys like to win. And there's a big difference.\"\n\nGreg Monroe had a game-high 18 points and Jabari Parker added 16 points for Milwaukee, which won for only the second time in eight games.\n\n\"Once we locked down (on defense) and we made shots on our end, it was easy for us,\" Parker said.\n\nDanilo Gallinari scored 13 points and Kenneth Faried added 11 for Denver, which managed just 30 points in the second half after scoring only five in the third quarter of its previous game, a 92-81 loss at Dallas on Saturday.\n\n\"We've got to find a way to wake up and win some games because we definitely cannot keep doing what we're doing and playing the way we play,\" Gallinari said. \"We've got to want to win the game. We've got to put more effort.\"\n\nIt was the most points allowed off turnovers this season by the Nuggets, who shot 3 of 4 to open the second half and took a 54-51 lead on Gallinari's 3-pointer with 8:19 left in the third quarter.\n\nThat's when Milwaukee took control, scoring 10 consecutive points to take the lead for good. Carter-Williams scored on a layup to make it 55-54, and the Bucks never trailed again.\n\nCarter-Williams then found Monroe for an easy layup and Giannis Antetokounmpo for a dunk during the key streak. Milwaukee led 67-60 after three quarters.\n\nThe Bucks opened the fourth on an 11-4 run to extend the lead to 78-64 on Parker's 6-foot jumper with 6:56 left, and Denver never came within single digits the rest of the way.\n\nDuring the seven-game losing streak, Denver is averaging 51 points in the first half and 39 in the second half.\n\nRookie guard Emmanuel Mudiay had a team-high five turnovers for Denver.\n\nSCORING DROUGHT\n\nIt was Denver's third consecutive game scoring 81 or fewer points, and the 74 points equaled a season low. \"We're one of the poorer shooting teams in the NBA, one of the poorer finishing teams in the NBA,\" Malone said.\n\nWHEN TO RETIRE?\n\nWith Kobe Bryant announcing his retirement after the season, Kidd said he knew it was time to retire when he was spending too much time in the trainer's room. \"If it's taking 30-45 minutes more to get to the car, that's when you know it's probably time to look at doing something else,\" he said.\n\nTIP-INS\n\nNuggets: G Gary Harris, who started the first 17 games, missed his second consecutive game after suffering a concussion\n\nBucks: G Greivis Vazquez missed his second straight game with right ankle soreness.\n\nUP NEXT\n\nNuggets: At Chicago on Tuesday night.\n\nBucks: At San Antonio on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994088.13088
}