{
  "game_id": "0021500039",
  "espn_id": "400827926",
  "date": "Nov 01, 2015",
  "matchup": "CHA vs. ATL",
  "headline": "Horford, defense lead Hawks to 94-92 win over Hornets",
  "body": "CHARLOTTE, N.C. --  Atlanta Hawks coach Mike Budenholzer wasn't pleased his team allowed 37 points to the Charlotte Hornets in the third quarter and surrendered the lead.\n\nHe let his players know about it and the veteran team responded appropriately.\n\nThe Hawks tightened up their defense, held the Hornets to 4 of 24 shooting in the fourth quarter and escaped with a 94-92 victory Sunday in Charlotte's home opener. It was the Hawks' second closely contested win in three days over their Interstate-85 division foes.\n\n\"They all know the third wasn't our best, but they found a way,\" Budenholzer said.\n\nKent Bazemore scored 20 points, Al Horford added 16 points and 12 rebounds and the Hawks improved to 3-1.\n\nJeff Teague had 18 points and Paul Millsap added 16, including a key 3-pointer to give Atlanta the lead for good with less than a minute to play.\n\n\"I think we picked up the intensity in the fourth,\" Horford said.\n\nThe Hornets had a chance to tie the game at the buzzer, but Kemba Walker's 17-footer from the left wing hit the back rim and bounced out. Walker also missed a 3-pointer in the final seconds of Charlotte's 97-94 loss to Atlanta on Friday night.\n\nWalker finished with 17 points and Nicolas Batum added 16 and eight assists for Charlotte (0-3). Al Jefferson contributed 10 points and 10 rebounds for the Hornets.\n\nThe Hornets led 76-70 entering the fourth, but missed 17 of their first 18 shots. Walker helped the Hornets break out of the funk with a long 3-pointer from the wing and four free throws to tie the game.\n\nBut with the score knotted at 89, Millsap shot an uncontested 3-pointer from the top of the key with 52.4 seconds that hit the rim a few times and rattled in.\n\nBatum missed a floater in the lane and Marvin Williams couldn't get the rebound to go on Charlotte's next possession. Bazemore was fouled on the rebound and made both shots to push the Hawks' lead to five with 14.8 seconds remaining.\n\nBut it wasn't over.\n\nWilliams would answer with a 3-pointer off the side inbounds play at midcourt to cut the lead to two with 12.3 seconds left.\n\nThe Hawks had trouble with their inbounds pass and it wound up with a scrum on the floor resulting in a jump ball. Batum corralled the loose ball off the jump, pushed the ball up the floor to Walker, who got an open look from the left wing but missed the jumper.\n\n\"We have a young new team and we missed some execution at the end,\" Batum said. \"We have to learn from those games. It's still early in the season, but we're right there -- we're going to be OK.\"\n\nTIP-INS\n\nHawks: Dennis Schroder surpassed 1,000 points for his career. ... The Hawks outscored Charlotte 44-30 in the paint.\n\nHornets:  The Hornets are 13-13 all-time in home openers. ... Batum had a season-high four 3-pointers.\n\nJORDAN GETS A LOOK: Hornets owner Michael Jordan got a close-up look at the game, watching from the end of the team bench.\n\nFACES SEEN: Ron Rivera, head coach of the NFL's Carolina Panthers, and linebacker Thomas Davis attended the Hornets season opener. The Panthers host the Indianapolis Colts on Monday night. ... North Carolina men's basketball coach Roy Williams was also at the game.\n\nWHERE'S THE LINE? The Hawks did not attempt a free throw until the third quarter, something Budenholzer was well aware of after the game.\n\nHe called it an anomaly. \"It's just one of those strange games where we didn't have a free throw.\"\n\nUP NEXT\n\nHawks:  Visit Miami on Tuesday.\n\nHornets: Host Bulls on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994419.510344
}