{
  "game_id": "0021400753",
  "espn_id": "400579045",
  "date": "Feb 06, 2015",
  "matchup": "MIL @ HOU",
  "headline": "James Harden scores 33 to lead Rockets past Bucks",
  "body": "HOUSTON -- With the Milwaukee Bucks throwing everything at him Friday night, James Harden relied on his teammates to knock down big shots.\nEven so, Harden finished with 33, and the Houston Rockets hit 15 3-pointers to beat the Milwaukee Bucks 117-111.\n\"They brought double-teams to half court to me,\" Harden said with a chuckle. \"So I just made the easy play and had trust in my teammates to make connections.\"\nTrevor Ariza added 24 for the Rockets. Giannis Antetokounmpo led the Bucks with a career-high 27 points and 15 rebounds.\nThe Rockets lead the league in 3-pointers made per game at 11.8. The 15 on Friday were two shy of their season high, and they improved to 30-7 when they make 10 or more. Five Rockets hit 3-pointers in the game.\nHarden scored 12 of his points from the free throw line on 17 attempts. He leads the league in free throws made and attempted, and the Rockets improved to 26-2 when a player tries eight or more.\n\"We did everything we could,\" Bucks coach Jason Kidd said. \"We threw multiple bodies at him and gave him different looks. He's just patient, and he can do it all. ... He's one of the best players in the world.\"\nMilwaukee trailed for much of the game, with a deficit reaching 18, but climbed within four with less than 40 seconds remaining in the fourth. However, the Rockets held on.\nThe Rockets drained 10 of their 3-pointers in the first half on just 17 attempts, and Milwaukee's defense had few answers.\n\"We're going to peak very soon,\" Harden said.\nAriza led the shooting charge, hitting five of six 3-point attempts for 21 first-half points.\nAntekounmpo topped his previous career high on a hook shot that pulled Milwaukee within four points in the final minute.\n\"The last two weeks, he's grown as a player and as a person,\" Kidd said.\nHouston led 68-56 at the half, with Milwaukee's second-quarter paint dominance helping it keep pace. With center Joey Dorsey filling in for Dwight Howard (knee), the Bucks used their superior length to outscore the Rockets 60-46 in the paint.\nHouston forward Josh Smith matched a career high with four 3-pointers on just five attempts, finishing with 14 points, 10 rebounds and eight assists, narrowly missing out on his fourth career triple-double.\n\"I was just trying to be available for the pocket pass, knowing that they were going to double-team James,\" Smith said.\nThe Rockets won for the sixth time in their past seven and their fourth straight at home.\nTIP-INS\nBucks: F Ersan Ilyasova returned to action for the first time in nearly two weeks after suffering a right groin strain Jan. 27 against Miami. Kidd said before the game that he expected him to play, with his minutes limited to fewer than 30, and Ilyasova played just less than 16 minutes, scoring six points.\nRockets: Houston improved to 5-1 since losing Howard to a knee injury. He is expected to miss four weeks after receiving a bone marrow aspirate injection Wednesday. ... The Rockets had a season-high 32 assists.\nSMITH HITTING HIS STRIDE\nAfter an inconsistent first month with the Rockets after being released by Detroit on Dec. 22, Smith is relishing his newfound role as a veteran coming off the bench. He has scored in double figures in five of his past seven games.\n\"Josh is one of the guys you can throw the ball to in the middle when they're double-teaming, and he just makes plays,\" Rockets coach Kevin McHale said.\nUP NEXT\nBucks: Home against Boston Celtics on Saturday.\nRockets: Host Portland Trail Blazers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764991782.3803499
}