{
  "game_id": "0022300714",
  "espn_id": "401585342",
  "date": "Feb 05, 2024",
  "matchup": "CLE vs. SAC",
  "headline": "Donovan Mitchell scores 29 as rolling Cavs improve to 14-1 in last 15 with 136-110 win over Kings",
  "body": "CLEVELAND -- — Donovan Mitchell was stuck in the foul lane after picking up his dribble, so he tossed the ball off the backboard to himself and dunked.\n\n\r\n              “I've never thrown it left-handed,\" Cleveland’s All-Star guard said with a laugh. \"Sometimes you just make (stuff) up.” \n\n\r\n              The Cavaliers can do no wrong right now.\n\n\r\n              Mitchell scored 29 points, Max Strus added 22 and Cleveland beat the Sacramento Kings 136-110 on Monday night for its sixth straight win and 14th in 15 games.\n\n\r\n              Cleveland is a league-best 19-4 since Dec. 16 — when starters Darius Garland and Evan Mobley went down indefinitely with injuries — and the Cavs have climbed to No. 2 overall (by percentage points over Milwaukee) in the Eastern Conference.\n\n\r\n              “It's good, but it's February,” Mitchell said. “We're just going to try to continue to play the way we've been playing. We're being cohesive as a group. We're playing great, but the biggest thing is: How do we keep going?\n\n\r\n              “Everybody has risen to the occasion when their number has been called. Heading into the All-Star break we're playing good ball, and we want to keep it going.”\n\n\r\n              The Cavs matched a season high with 23 3-pointers in winning their ninth straight home game and eighth in nine against teams from the West.\n\n\r\n              At the moment, it doesn't matter who the Cavs are facing. They're clicking on all cylinders offensively and are healthy after being without Garland (broken jaw) and Mobley (knee surgery) for six weeks.\n\n\r\n              Sacramento's Domantas Sabonis had 12 points, 19 rebounds and 15 assists for his 15th triple-double this season, tying him with Denver's Nikola Jokic for the league lead.\n\n\r\n              Harrison Barnes added 22 points and De'Aaron Fox had 19 as the Kings finished 5-2 on a season-long trip.\n\n\r\n              “Tough night for us,” Kings coach Mike Brown said. \"(Coach) J.B. (Bickerstaff) and his team were really good. We didn’t do a good job getting to their hot players and they shot the mess out of the basketball. They made 23 3s, shot 56%, that's almost unheard of. Offensively, we were fine, but they were so good they took the wind out of us.\"\n\n\r\n              Jarrett Allen had 19 points and Mobley added 14 rebounds and seven assists in his fourth game back since undergoing surgery last month.\n\n\r\n              The Cavs pushed a 15-point halftime lead to 21 in the third quarter before Fox hit a 3 and Kevin Huerter scored to pull the Kings within 13.\n\n\r\n              Sabonis then grabbed a defensive rebound, but while he was looking to make an outlet pass, Strus sneaked up behind him, tipped the ball away from the Kings' big man and buried a 3-pointer from the corner.\n\n\r\n              “Got lucky,” said Strus, who caught Sabonis on a similar play in the first half. “Got him twice. Any play to help impact winning, I’m willing to do so. Got lucky there and made a big shot.”\n\n\r\n              Mitchell then hit another 3 to put the Cavs ahead 101-82.\n\n\r\n              The Kings closed within 10 early in the fourth, but Mobley muscled inside for a bucket and the Cavs hit three 3-pointers — two by Caris LeVert — in a span of 79 seconds to regain control. \n\n\r\n              Afterward, Mitchell said he plans to participate in the All-Star 3-Point contest this month in Indianapolis.\n\n\r\n              “I don’t think I’m labeled as a shooter, like the guys who are in it are,” Mitchell said. “But I believe I can go out there and win it.”\n\n\r\n              The game was a homecoming for Brown, who had two stints with the Cavs (2006-10 and 2013-14). Brown has fond memories of his time in Cleveland, where he got his first head coaching gig and raised a family.\n\n\r\n              This is a big week away from the floor for Brown. His youngest son, Cameron, is a first-year quality control coach for the Super Bowl-bound San Francisco 49ers. \n\n\r\n              “I think I'm more excited than he is,” cracked Brown, who won't be able to attend the game because the Kings play Sunday at Oklahoma City. “But I'll be watching with my 49ers shirt on.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Detroit on Wednesday.\n\n\r\n              Cavaliers: At Washington on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996730.902265
}