{
  "game_id": "0022200810",
  "espn_id": "401468965",
  "date": "Feb 06, 2023",
  "matchup": "BKN vs. LAC",
  "headline": "Clippers surge late, overcome Thomas' 47 to top Nets 124-116",
  "body": "NEW YORK -- — Paul George scored 29 points, Kawhi Leonard added 24 and the Los Angeles Clippers overcame a career-high 47 points from Cam Thomas in his first start to beat the short-handed Brooklyn Nets 124-116 on Monday night. \n\n\r\n              Ivica Zubac added 19 points and 12 rebounds for the Clippers, who won for the eighth time in 10 games and finished 4-2 on their six-game Eastern Conference road trip.\n\n\r\n              “I’m happy with the road trip we had,” Leonard said. “We came out 4-2, and that’s a pretty good road trip for us.”\n\n\r\n              Thomas, who scored 44 to rally the Nets past Washington on Saturday, was even better on the day the Nets completed the trade that sent Kyrie Irving to Dallas. But Los Angeles outscored Brooklyn 25-9 over the final 6:20.\n\n\r\n              “Their objective (was) to come in and play hard and go hard, and they did that,” George said. “I thought it was a good experience for us to get good possessions down the stretch.”\n\n\r\n              Nic Claxton had 15 points and 15 rebounds for the Nets, while Edmond Sumner chipped in 23 points for Brooklyn. Before the game, the deal that sent Irving and forward Markieff Morris to Dallas for Spencer Dinwiddie, Dorian Finney-Smith and multiple draft picks was announced.\n\n\r\n              Neither Dinwiddie nor Finney-Smith were available, nor were stars Kevin Durant and Ben Simmons and guard Seth Curry due to injury, leaving coach Jacque Vaughn forced to rotate 11 of his 12 dressed players\n\n\r\n              “You just got to give credit to our group for being ready to play,” Vaughn said. “The optimism and belief that we can win a basketball game with the group we had was (good) to see, and our overall effort and energy and communication was good throughout the night.”\n\n\r\n              Still, Los Angeles’ bench still outscored Brooklyn’s 38-10.\n\n\r\n              “That’s huge,” Clippers coach Tyronn Lue said. “We have a really good bench that we really trust, and you saw that tonight, increasing the lead when (George) and Kawhi went to the bench in the first half. ... We really lean on those guys to be good for us.”\n\n\r\n              But Thomas almost single-handedly kept Brooklyn within striking distance. Thomas had 22 in the first half, then electrified the crowd with a combination of 3-pointers and mid-range jumpers, helping Brooklyn lead by 107-99 midway through the fourth.\n\n\r\n              “I came out hot early,” Thomas said. “I didn’t know it’d be another 40, but I knew I’d probably have a great game again. Kudos to the guys for believing in me and letting me make decisions down the stretch.”\n\n\r\n              Los Angeles rallied with a 9-0 run and outscored Brooklyn 33-28 in the fourth, keyed by Leonard’s nine points in the frame.\n\n\r\n              “Defensively we were able to get some stops and get out in transition a little bit,” Lue said. “Being down eight, we just came out settled down and came out and went on the 9-0 run and took control of the game.” \n\n\r\n              The Nets made 8 of 12 first-quarter 3-pointers and built an eight-point advantage. But the Clippers closed the first with a 10-0 run then George then scored nine in the second, helping the Clippers build an 11-point advantage. \n\n\r\n              But the Nets closed the half with a 13-4 run, cutting Los Angeles’ lead to 55-53 at halftime.\n\n\r\n              TIP INS\n\n\r\n              Clippers: Forward Marcus Morris Sr. was ejected with 1:57 left in the second quarter. … The Clippers improved to 14-11 against the Eastern Conference and 8-7 on the road.\n\n\r\n              Nets: Durant (sprained right MCL) missed his 13th straight game. The Nets are expected to give an update on his progress Tuesday. ... Simmons (left knee soreness) was unavailable for the fifth straight game but could play Tuesday against Phoenix on the second night of a back-to-back.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host Dallas on Wednesday.\n\n\r\n              Nets: Host Phoenix on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994864.4953249
}