{
  "game_id": "0022200786",
  "espn_id": "401468941",
  "date": "Feb 03, 2023",
  "matchup": "SAC @ IND",
  "headline": "Hield helps Pacers top Kings",
  "body": "INDIANAPOLIS -- — Buddy Hield scored 21 points against his former team and the Indiana Pacers beat the Sacramento Kings 107-104 on Friday night to stop a four-game losing streak.\n\n\r\n              Hield shot 5 of 9 from 3-point range and grabbed 10 rebounds. Aaron Nesmith added 17 points for the Pacers, going 4 for 7 on 3s. Myles Turner had 14 points and 13 boards.\n\n\r\n              “Especially against your old team, it’s always good to get the win,” Hield said.\n\n\r\n              Hield and Tyrese Haliburton were traded to the Pacers a year ago in a six-player deal that sent Domantas Sabonis to the Kings.\n\n\r\n              Turner said the Pacers had extra motivation to get the victory for Hield and Haliburton.\n\n\r\n              “(Hield) made some big shots down the stretch,” Turner said.\n\n\r\n              Harrison Barnes led the Kings with 23 points. Kevin Huerter scored 16, while Sabonis and Terence Davis each had 15.\n\n\r\n              Sacramento was without leading scorer De’Aaron Fox, who sat out for personal reasons. \n\n\r\n              Davis sank a 3-pointer with two minutes left to slice the Pacers’ lead to 107-104, but neither team scored the rest of the way.\n\n\r\n              Barnes missed a 3 with 9.1 seconds left, and Nesmith came up with the rebound.\n\n\r\n              “We didn’t react trying to foul,” Kings coach Mike Brown said. “It’s on us as a staff to remind them to foul, if we’re down three and the clock is below 24 seconds and we're down three points or two or one. That’s just a teaching point.”\n\n\r\n              Brown thought his team had several problems in the final quarter.\n\n\r\n              “You've got to be able to box out,\" he said. “You can’t give up second shots. We didn’t do any of that down the stretch. Throughout the course of the game, our turnovers were terrible. It really hurt in a one-possession game to have 20 of them on the road. Our inability to communicate on defense against a team — and give up too many good looks — that can shoot like the Pacers, was not good.\"\n\n\r\n              The Pacers, who led by 12 at halftime, took a 19-point lead in the third quarter before the Kings ended the period with a 20-8 run to narrow the deficit to 87-80 after three.\n\n\r\n              Indiana went 10 of 21 on 3s to take a 60-48 halftime lead. In contrast, the Kings were 6 for 23 from long range in the opening half.\n\n\r\n              The Pacers scored 14 straight points to build a 51-39 advantage. Nesmith hit a trio of 3-pointers during the stretch.\n\n\r\n              Haliburton, playing his second game after missing 10 with an elbow sprain and knee bruise, acknowledged he was tired after the game and struggled to make shots. He had 10 points on 4-of-12 shooting and nine assists.\n\n\r\n              “We knew the way they play, you’re going to have to make it a gritty game, an ugly game,” Haliburton said. “You need to be able to play defense and get stops, and we were able to do that tonight.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: The Pacers showed a pregame tribute to Sabonis on the scoreboard during his first game back in Indiana since the trade. Sabonis was inactive due to a knee injury when Sacramento played at Indiana last March. … Trey Lyles, the 2014 Indiana Mr. Basketball from Indianapolis Tech High School, scored seven points off the bench.\n\n\r\n              Pacers: Daniel Theis, in his second game of the season, scored eight points off the bench. Theis, traded to the Pacers from Boston, returned Thursday after having knee surgery in November. … With the return of Theis, two other Pacers post players, Jalen Smith and Isaiah Jackson, didn’t play.\n\n\r\n              BIG DUNK\n\n\r\n              Hield isn't known for his dunking ability, but he had a big one to put the Pacers up 104-99.\n\n\r\n              “That's number one,” Hield said. “I'm never the one cutting to the middle or baseline. I saw an opening and that's all she wrote. I trusted my legs. It was fun. My teammates were excited. They're always joking about me not dunking the ball. It was fun to see them laughing.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: At New Orleans on Sunday.\n\n\r\n              Pacers: Host Cleveland on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995300.5948129
}