{
  "game_id": "0021600139",
  "espn_id": "400899589",
  "date": "Nov 12, 2016",
  "matchup": "PHX vs. BKN",
  "headline": "Nets finish strong, beat Suns 122-104 for first road win",
  "body": "PHOENIX -- Rondae Hollis-Jefferson had a little extra energy on the court Saturday.\nThe second-year pro learned just before the game that his mother had been flown in to Arizona to watch her son play. She watched from her second-row seat as Hollis-Jefferson scored a career-high 20 points with 13 rebounds in the Brooklyn Nets' 122-104 victory over the Phoenix Suns.\n\"Just to have her here, that was more special to me than the 20 points,\" Hollis-Jefferson said. \"I winked at her about three times.\"\nBrooklyn got its first road win of the season, scoring 17 straight points late in the fourth quarter to extinguish the Suns' comeback attempt.\nThe Nets held a 102-100 lead with 4:16 to play when their decisive run began. It included Brook Lopez's 3-pointer with 1:47 to go to make it 113-100, and some tight defense on the Suns' top scorers.\n\"Defense, it gives you that energy, that joy that you want. When you stop someone and you go down and score, it's like `Woo! That was fun!\" Hollis-Jefferson said. \"We enjoy that whole process, the stop and the score.\"\nTrevor Booker added 19 points and eight rebounds, and Sean Kilpatrick had 19 points and nine boards for the Nets. Joe Harris also scored 19 points.\nT.J. Warren scored 18 points for the Suns. Jared Dudley added 17 off the bench.\nThe Suns fell apart after Devin Booker's short jumper pulled them within two points with a little more than 4 minutes left and lost for the third time in four games.\nPhoenix shot a season-low 37.4 percent. The Suns' 107 shot attempts were the highest in an NBA game this season, regulation or overtime.\n\"This is the first team that played the defense the way they played it,\" Suns coach Earl Watson said. \"They ... made us play out of the weak side, so they did a great job of taking away the paint, taking away the lane.\"\nThe Suns took a lot of shots early in possessions.\n\"We just locked down defensively,\" Trevor Booker said. \"We shut down their transition and made them play half court.\"\nHarris' two free throws gave Brooklyn its biggest lead of the first half at 57-41 with 1:08 to go. The Nets finished the half up 58-45 after leading by double digits for the last 5:19.\nTIP-INS\nNets: G Jeremy Lin remains out with a strained left hamstring. He watched Saturday's game from the bench and is expected to be re-evaluated this coming week. ... F Isaiah Whitehead missed his second straight game with a concussion and was not with the team Saturday.\nSuns: C Tyson Chandler remains away from the team due to a family matter and missed his third straight game. ... Rookie Tyler Ulis played 11 minutes, the most action he's seen since getting 18 on Halloween against the Los Angeles Clippers and the third game in which he's played this season.\nANOTHER COACH, ANOTHER COMPLIMENT\nAdd the Nets' Kenny Atkinson to the list of NBA coaches who have praised Booker's game. \"I'm impressed with the confidence, the swagger he plays with and the attack mentality,\" Atkinson said.\nBooker, the team's leading scorer at 21.5 points per game coming in, made only 5 of 18 shots and finished with 11 points.\nCHRISS SHOTS\nSuns rookie Marquese Chriss got his third start and finished with a career-high 16 points. Chriss eclipsed his high of seven shot attempts before halftime, and took 15 in the game.\nLOUD FAN HEARS IT\nA vociferous fan sitting a few rows up from the court yelled at Watson to take Booker out of the game after a missed shot in the fourth quarter. The fan had been critical of the Suns all night, and Watson turned to him and calm but audibly said \"Shut up.\"\nBROOK BLOCKS\nNets center Brook Lopez set the season high for blocks for a Nets player with four, three of those in the first five minutes.\nUP NEXT\nNets: At the Clippers on Monday night, their first of two straight games against the Los Angeles teams in the Staples Center.\nSuns: At Golden State on Sunday night, their third set of back-to-back games of the season.",
  "source": "espn_api",
  "crawled_at": 1764996009.2579432
}