{
  "game_id": "0021600262",
  "espn_id": "400899712",
  "date": "Nov 29, 2016",
  "matchup": "MIL vs. CLE",
  "headline": "Antetokounmpo ties career scoring high, Bucks rout Cavs",
  "body": "MILWAUKEE -- After building a big third-quarter lead against the defending NBA champions, the Milwaukee Bucks poured it on in the fourth.\nAnd when the Cleveland Cavaliers pulled their starters, including LeBron James, midway through the final period, the young Bucks still didn't let up.\n\"We didn't let them off the hook. We were attacking,\" said Giannis Antetokounmpo, who tied a career high with 34 points while the Bucks stunned the Cavaliers 118-101 on Tuesday night.\n\"They are the champs, but this is a great win.\"\nBucks coach Jason Kidd had high praise for Antetokounmpo, who was often matched up against James.\n\"He's getting better with hard work,\" Kidd said. \"He was going against the best player in the world.\"\nAntetokounmpo added 12 rebounds and five assists while Milwaukee ended Cleveland's four-game winning streak. Jabari Parker had 18 points and Michael Beasley had 17 off the bench for the Bucks.\n\"It was a matter of us trusting each other,\" Kidd said. \"For a young team, sometimes it takes time. You want to put it in the microwave and instantly get it right away, but if you're patient enough for the process and the journey, it will come.\"\nJames had 22 points for the Cavaliers, who fell to 13-3. Kyrie Irving added 20 points.\n\"You can't simulate how long they are in the passing lanes,\" James said. \"But four of my seven (turnovers) were unforced and that's careless.\"\nThe Bucks scored a season-high 68 points in the paint.\n\"They played harder than we did,\" Cleveland coach Tyronn Lue said.\nThe Bucks outscored Cleveland by 14 points in the third quarter and led by 22 in the fourth.\nCleveland rode hot early shooting to a 14-point first quarter lead, but Milwaukee closed on a 10-0 run and trailed by only two at the end of the period.\nAntetokounmpo and Beasley sparked Milwaukee in the second quarter as the Bucks built an advantage of eight points before leading 58-54 at the half.\nFRIENDLY TO A FAULT\nThe Bucks exploited J.R. Smith's affable nature for an easy dunk in the second quarter.\nRight before an inbound play, Milwaukee's Jason Terry stood up off the bench to say hello to Smith, sharing a handshake and hug along the baseline. Smith was supposed to be covering Tony Snell, but with Smith mingling, Snell cut to the basket, received the inbound pass and dunked with nobody around.\nTerry said it wasn't planned and he didn't realize play had restarted, and Smith at first said he just wasn't paying attention. When asked again, he said, \"I didn't even know I was in the game. My bad.\"\nFAMILIAR FACES\nMatthew Dellavedova played against his former team for the first time since signing with Milwaukee as a free agent in the offseason.\n\"He was with those guys in a lot of battles,\" Kidd said.\nLue said he misses having Dellavedova run his team's second unit.\n\"He's going to compete and play hard. He's going to scrap. His teammates loved him,\" Lue said.\nLOOKING FOR ANSWERS\nSmith entered the game just 1 for 22 in his last two contests, including going 0 for 11 against the 76ers on Sunday. He hit his first two shots, both 3-pointers, but missed his next five shots, all 3-pointers.\nIN THE HOUSE\nMichael Redd, the fourth all-time leading scorer in Bucks' history, attended the game. Redd played 11 seasons for the Bucks.\nIN REMEMBRANCE\nA moment of silence was observed for the victims of a plane crash in Columbia on Monday. A chartered airliner slammed into the Andes mountains while transporting a Brazilian soccer team traveling to the finals of one of South America's most prestigious club tournaments. More than 70 passengers were killed.\nTIP-INS\nCavaliers: Channing Frye missed his second straight game following the death of his father on Nov. 24. He is expected to rejoin the team by Thursday. ... Iman Shumpert (left hamstring strain) returned to the lineup after a one-game absence. ... Cleveland's bench totaled just five first-half points.\nBucks: Beasley, who entered averaging just more than eight points per game, scored 11 first-half points, connecting on 5 of 6 shots. ... Milwaukee shot 57 percent in the first half.\nUP NEXT\nCavaliers: Host Los Angeles Clippers on Thursday night. Lue was an assistant under Clippers coach Doc Rivers in Boston and Los Angeles.\nBucks: At Brooklyn on Thursday night. Milwaukee has won 12 of its last 16 meetings with the Nets, dating to Jan. 9, 2009, including a 110-108 win in Milwaukee on Oct. 29.",
  "source": "espn_api",
  "crawled_at": 1764995213.246691
}