{
  "game_id": "0022401037",
  "espn_id": "401705603",
  "date": "Mar 24, 2025",
  "matchup": "MIN @ IND",
  "headline": "Tyrese Haliburton and Obi Toppin lead 3-point flurry to help Pacers beat Timberwolves 119-103",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton finished with 24 points and 11 assists, and Obi Toppin made six 3-pointers and added 20 points to help the Indiana Pacers beat the Minnesota Timberwolves 119-103 on Monday night.\n\n\r\n              The Pacers have won five straight and seven of eight to stay ahead of Milwaukee in the chase for the Eastern Conference's No. 4 seed. Haliburton extended his career best streak to 11 straight games with double-doubles on a night six Pacers players scored at least 10 points.\n\n\r\n              \r\n                Haliburton made three of Indiana's 13 3s.\r\n              \n\n\r\n              Naz Reid led the Timberwolves with 20 points and Anthony Edwards added 17 despite being a game-time decision with a hand injury. Rudy Gobert finished with 16 points and 16 rebounds as Minnesota lost for the third time in four games.\n\n\r\n              Indiana never trailed, using a flurry of nine 3s in the third quarter to build a 95-73 lead. Minnesota couldn't get within single digits the rest of the game. Indiana has won eight straight home games.\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota is struggling at exactly the wrong time. They've won only once since having a seven-game winning streak snapped, and if they want to earn one of the top six spots in the West, they need to turn things around quickly.\n\n\r\n              Pacers: On the other hand, Indiana is playing perhaps its best basketball all season. They've won the first four of a five-game homestand and have done it by winning close games, crazy games and now pulling away in this one.\n\n\r\n              Key moment\r\n              After the Timberwolves cut the deficit to 65-57 early in the third quarter, Indiana outscored Minnesota 23-12, making six 3s during the span.\n\n\r\n              Key stat\r\n              Indiana was 9 for 14 on 3s in the third quarter.\n\n\r\n              Up next\r\n              Timberwolves host Phoenix on Friday, and Pacers host the Los Angeles Lakers on Wednesday to wrap up a five-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998077.058344
}