{
  "game_id": "0022300185",
  "espn_id": "401584813",
  "date": "Nov 12, 2023",
  "matchup": "PHX vs. OKC",
  "headline": "Gilgeous-Alexander, Thunder storm ahead in 4th quarter, beat Suns 111-99",
  "body": "PHOENIX -- — Shai Gilgeous-Alexander scored 35 points, Jalen Williams had 31 and the Oklahoma City Thunder used a big fourth quarter to beat the Phoenix Suns 111-99 on Sunday night.\n\n\r\n              The Thunder outscored Phoenix 31-13 in the fourth quarter — holding the Suns without a field goal for the final 6:42 — and won despite being outrebounded 52-33.\n\n\r\n              Rookie Chet Holmgren added 18 points and Josh Giddey had 10 points and 10 assists to help the Thunder win for the third time in four games to move to 6-4.\n\n\r\n              Gilgeous-Alexander and Williams combined to make 24 of 38 shots (63%) and the Thunder shot 49%. The Suns shot 38%, but only made 2 of 21 shots in the fourth quarter.\n\n\r\n              Thunder coach Mark Daigneault praised his team's effort against Kevin Durant and Bradley Beal in particular.\n\n\r\n              “Really good focus and execution. We made them earn everything,\" Daigneault said. \"I thought we did a great job collectively on their main guys, keeping them out of rhythm.”\n\n\r\n              “I thought we course-corrected in-game. There were some things in the first half that were a little loose, just on our rotations that we cleaned up.”\n\n\r\n              Gilgeous-Alexander echoed his coach's thoughts. “Our biggest emphasis was to make their main guys play outside their comfort zone.”\n\n\r\n              He also praised Williams, who he said has the ability to score. \n\n\r\n              “He’s just such an unselfish guy,\" Gilgeous-Alexander said. We’re always on him to stay more aggressive.”\n\n\r\n              Durant led the Suns with 28 points and nine rebounds and was 11 for 11 from the free-throw line. Beal had 15 points and eight rebounds, while Drew Eubanks scored 15 points off the bench. The Suns, playing without All-Star guard Devin Booker and backup Eric Gordon, fell to 4-6.\n\n\r\n              The Suns have had fourth-quarter troubles this season, including a loss to San Antonio in which the Spurs never led under the final second of the game, and a loss to the Los Angeles Lakers on Friday night in the NBA In-Season Tournament.\n\n\r\n              “I felt like our execution was better. Shots just didn’t fall,\" Suns coach Frank Vogel said. “Brad's battling through his back injury and trying to get his legs under him. KD has been carrying a heavy load for us all season. Played every game and pretty big minutes.”\n\n\r\n              Beal returned last week after being out with back spasms, Booker is sidelined by a sprained left ankle and Gordon sat out because of soreness in his left shoulder. Vogel said before the game that Gordon woke up with significant soreness from the last game.\n\n\r\n              “We can't win games that way,” Durant said about the fourth-quarter shooting drought. “If you don't make shots you can't win. And they made shots.”\n\n\r\n              Neither team led by double figures until Gilgeous-Alexander’s 3-pointer with under four minutes to go gave the Thunder a 95-85 edge. The final margin was Oklahoma City's largest lead of the night.\n\n\r\n              NEXT\n\n\r\n              Thunder: Host San Antonio on Tuesday night in an NBA In-Season Tournament game.\n\n\r\n              Suns: Host Minnesota on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996670.029918
}