{
  "game_id": "0022000704",
  "espn_id": "401307493",
  "date": "Mar 28, 2021",
  "matchup": "TOR vs. POR",
  "headline": "McCollum, Lillard lead Blazers past Raptors 122-117",
  "body": "TAMPA, Fla. -- — Damian Lillard helped Portland surge ahead in the third quarter. CJ McCollum finished the job in the closing minutes.\n\n\r\n                    McCollum scored seven of his 23 points in the final two minutes and the Trail Blazers beat the Toronto Raptors 122-117 on Sunday night.\n\n\r\n                    Lillard had 22 points and 11 assists for the Blazers, who took command of their third straight win — all on the road — by holding Toronto to 10 points in the third quarter.\n\n\r\n                    “I thought we did a good job on their two guys most of the night, but we couldn’t get by that dry quarter,” Raptors coach Nick Nurse said. “The biggest thing was the turnovers. We couldn’t quite handle the physicality.”\n\n\r\n                    Pascal Siakam finished with 26 points and eight rebounds, and Fred VanVleet added 20 points and eight assists for Toronto, which lost for the 11th time in 12 games. The Raptors shot 4 for 22 with five turnovers in the third quarter.\n\n\r\n                    The game was played three days after the trade deadline move in which the Raptors sent Norman Powell to the Blazers for Gary Trent Jr. and Rodney Hood.\n\n\r\n                    Lillard, who sat out Friday night's win at Orlando with a left knee contusion, joined Powell in Portland's three-guard starting lineup, which didn't get a long look..\n\n\r\n                    “Norman got two quick fouls and we only played about four minutes in that stretch with that group,” Portland coach Terry Stotts said. “But we’ll play that lineup. It’s just a matter of when and where and what the matchups are.”\n\n\r\n                    Derrick Jones Jr., bumped from the lineup, scored Portland's final seven points of the first half, but Hood's 3-pointer at the buzzer gave Toronto a 74-68 halftime edge.\n\n\r\n                    Jones finished with 16 points and three rebounds in 21 minutes.\n\n\r\n                    “He really had an impact on the game in he second half,” Stotts said.\n\n\r\n                    The Raptors led 82-75 when Siakam scored on a short jumper with 6:27 left in the third quarter. But Toronto was held scoreless for nearly six minutes.\n\n\r\n                    “We felt like a really good defense in that third quarter. We were out there communicating and working things out. It was good to have (Powell) out there,” said Lillard. “Typically, we do well with three-guard lineups, and he's a physical guard.”\n\n\r\n                    A steal and a dunk by Powell put the Blazers ahead 83-82, and Lillard scored seven points in a 16-2 run that closed the third quarter with Portland leading 91-84.\n\n\r\n                    VanVleet led a late rally that got the Raptors within one with 2:28 left, but McCollum answered with a jumper, a runner and a three-point play.\n\n\r\n                    “We've got to win a close game at some point,” VanVleet said, “but they've got two guys that can close the game for them.”\n\n\r\n                    TIP-INS\n\n\r\n                    Blazers: Powell scored 13 points in 27 minutes in his second Portland start. ... Robert Covington made the game's first 3-pointer with 6:01 left in the first quarter, and both teams made two 3-pointers in the next 48 seconds. ... F Nassir Little missed the game with an injured thumb. \n\n\r\n                    Raptors: G Kyle Lowry was out with a sore right foot. ... F DeAndre Bembry and G Paul Watson Jr. missed a second game due to the COVID protocol.\n\n\r\n                    UP NEXT\n\n\r\n                    Blazers: Play at Detroit on Wednesday night.\n\n\r\n                    Raptors: Play at Detroit on Monday night.\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764996840.660442
}