{
  "game_id": "0021500072",
  "espn_id": "400827959",
  "date": "Nov 05, 2015",
  "matchup": "CHA @ DAL",
  "headline": "Jefferson's 31 points leads Hornets over Mavericks, 108-94",
  "body": "DALLAS -- The Hornets fittingly turned to an old-school NBA tactic -- the post-up game -- to record Charlotte's first NBA victory in Dallas since 1998.\nCenter Al Jefferson scored a season-high 31 points on 15-of-18 shooting and Marvin Williams added 17 points and 12 rebounds as the Hornets pulled away in the second half and beat the Mavericks 108-94 on Thursday night.\nThe victory was the first in Dallas following 11 straight defeats for the franchise that began as the Charlotte Bobcats in 2004-05. The Mavericks had run off 14 straight home wins over Charlotte's two NBA teams since the original Hornets won at Reunion Arena in January 1998.\nThe 30-year-old Jefferson, a Boston Celtics rookie in 2004-05, was not only terrific shooting and rebounding (9) but also served as the hub of the Hornets' entire offense. Charlotte coach Steve Clifford cited the advantages of having an effective post-up game, particularly when defending a lead late.\n\"It takes time off the clock,\" Clifford said. \"Two, your floor balance is always set. Whether he makes or misses, there's usually not going to be a long rebound and you're in space where you should be able to get back. It's part of the NBA that's kind of going away.\"\nJefferson credited his success to a balanced attack, with four teammates scoring in double figures.\n\"I've got guys all around me,\" he said. \"These guys make my job a lot easier. Tonight, they didn't double-team me until toward the end.\"\nWith Jefferson leading the inside game, the Hornets outscored the Mavericks 58-36 on points in the paint. They out-shot Dallas 51.2 percent to 29.5 in the second half and led by as many as 24 points early in the fourth quarter.\n\"It's hard to be effective on offense when you're taking it out of the basket,\" Mavericks coach Rick Carlisle said. \"We are going to have to defend better -- there's no doubt about it -- and we are missing some shots that we normally should make.\"\nWilliams recorded his third double-double in five games.\nDeron Williams led the Mavericks with 15 points, while Dirk Nowitzki, Zaza Pachulia and Dwight Powell added 14 points each. That was a career high for the second-year Powell.\nTHAT WAS THEN\nThe Hornets went into the game leading the league averaging 11.5 3-pointers made per game after hitting 14 of 23 in Tuesday night's 130-105 win over Chicago. They hit 6 of 27 against Dallas.\nPATIENCE WASN'T REWARDED\nDallas held out Chandler Parsons, who is limited to about 15 minutes a game following offseason knee surgery, as a second-half spark for the first time this season. He played 14 minutes and scored two points on 1-for-5 shooting, missing three 3-point tries. \"It was worth a shot,\" Parsons said. \"It was something that I asked for, but it was like the basketball gods saying it was a (bad) idea.\"\nNEW DEAL\nEarlier Thursday, the Mavericks and coach Rick Carlisle agreed to a five-year, $35 million contract extension that runs through the 2021-22 season. \"He earned it; he's worth it,\" team owner Mark Cuban said. \"We're a better team, a better organization on and off the court because of him.\"\nTIP-INS\nDuring the first quarter, Nowitzki became the 16th player in NBA history to pass the 45,000 mark in career regular-season minutes.\nThe Hornets' Kemba Walker took sole possession of fourth place in all-time 3-pointers for Charlotte's NBA franchises at 377. He went into game tied with current Dallas guard Raymond Felton.\nUP NEXT\nHornets: At San Antonio on Saturday night.\nMavericks: Home against New Orleans on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994417.842308
}