{
  "game_id": "0022200522",
  "espn_id": "401468677",
  "date": "Dec 28, 2022",
  "matchup": "DEN @ SAC",
  "headline": "Monk scores 33, hits winning free throw as Kings top Nuggets",
  "body": "SACRAMENTO, Calif. -- — Malik Monk scored 33 points, including the tiebreaking free throw with 0.7 seconds left, and the Sacramento Kings came back from down 19 points late in the third quarter to beat the Denver Nuggets 127-126 on Wednesday night.\n\n\r\n              “I was talking to my old teammate, DeAndre Jordan, the whole time,” Monk said on the final free throws. \"That free throw felt the best it has all night, I thought it was going in. Then I just had to lock in and hit the next one. I don’t miss two in a row.” \n\n\r\n              Nikola Jokic scored 40 points for Denver but missed a 3-pointer at the top of the key as time expired. \n\n\r\n              “Sacramento played really well,” Jokic said. “It was not just one guy. We couldn’t stop a couple of them.”\n\n\r\n              De’Aaron Fox had 31 points and 13 assists, while Domantas Sabonis returned to the lineup with 31 points, 10 rebounds and five assists. The Kings had lost three of four at home.\n\n\r\n              “He literally has a broken thumb,” Fox said of Sabonis. “He still went out there and it just shows his toughness. He wants to win. When he came here it wasn’t just for the future, he wants to win games now.”\n\n\r\n              The Nuggets played without Jamal Murray, Aaron Gordon and Bruce Brown. They had their five-game winning streak snapped.\n\n\r\n              “I felt like we were bigger and when you play big it’s harder for them to share the basketball,\" Kings acting head coach Jordi Fernandez said. \"Our activity, our communication, our willingness to fly around, I feel like that really changed the game.”\n\n\r\n              Michael Porter Jr. had 19 points for Denver after a 30-point performance Tuesday in the Nuggets' victory in the opener of the two-game series in Sacramento. Bones Hyland scored 20 points in his first start of the season. \n\n\r\n              “Obviously tonight was not a great night for our defense,” Nuggets coach Michael Malone said. “That’s why we lost. You can’t rely on offense against a young hungry team that got beat last night.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Jokic had seven rebounds and six assists.\n\n\r\n              Kings: Sacramento coach Mike Brown missed his second consecutive game after he entered the health and safety protocols after testing positive for COVID-19. Fernandez took his place. … The Kings received a technical foul after a delay of game call with 11:09 left in the second quarter.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Miami on Friday.\n\n\r\n              Kings: Host Utah on Friday in the final game of a six-game homestand.",
  "source": "espn_api",
  "crawled_at": 1764995276.187019
}