{
  "game_id": "0021501090",
  "espn_id": "400828977",
  "date": "Mar 26, 2016",
  "matchup": "PHX vs. BOS",
  "headline": "Thomas scores 28, leads Celtics over Suns 102-99",
  "body": "PHOENIX -- Preventing a key shot late in the game was just as sweet for Evan Turner as making a clutch basket.\nThe Boston Celtics forward, held to two points in the second half, made his mark on defense by blocking a potential tying shot with 3.9 seconds to play, and the Celtics survived a furious comeback by the Phoenix Suns Saturday night in a 102-99 win.\nIsaiah Thomas scored 28 points against his former team, and the Celtics hung on despite almost blowing a 21-point lead.\n\nTurner added 17 points, 15 of those in the first half, to go with 11 rebounds for Boston, which won its fourth straight. His block of Devin Booker's short jumper in the final seconds preserved the lead.\n\"He did a great in-and-out move and I think I stayed with him,\" Turner said. \"That's just what it was. That was cool because I've been trying to get better on my defense, to tell you the truth. It worked out well.\"\nThe Suns cut a 10-point fourth quarter deficit to one, 98-97, with 1:16 left on a step-back jumper from Booker, who finished with 21 points. Phoenix had a chance to take the lead twice with under a minute left, but Booker missed from the top of the key with 57 seconds remaining and Knight failed to hit the rim with a 3-point attempt with 24 seconds left.\nMarcus Smart made two free throws after that. After Booker's put-back basket with 15.5 seconds left made it 100-99, Thomas and Smart each made a free throw around Turner's block, and the Suns couldn't get off a good shot before the final buzzer.\n\"I had a bad last play,\" Booker said. \"Probably shouldn't have been looking for a foul and just tried to score my shot.\"\nThe Celtics (43-30) moved within a half-game behind Atlanta for the No. 3 spot in the Eastern Conference playoff race. They have won consecutive road games for the first time since Feb. 2-5.\nBrandon Knight scored 19 points for the Suns, with Mirza Teletovic adding 17 points and nine rebounds.\nThe Suns trailed by 18 in the third quarter, but cut the lead to one at 74-73 with 2:43 to go on Booker's dunk off a pass from P.J. Tucker. Phoenix trailed 81-75 going into the final 12 minutes.\nThe Celtics maintained the lead in the third quarter thanks in large part to Thomas, who scored 15 of his points. All of Thomas' points in the game came after an air ball on his first shot of the game and being called for a technical foul early in the first quarter.\n\"I'm just glad we got the win,\" Thomas said. \"We came out playing well. That third quarter kind of hurt us and we sealed the deal. This time of year, no matter how you get wins, it's just about staying on top and we did that.\"\nBoston led by as many as 21 in the second quarter after a 3 from Avery Bradley made it 55-34 with 3:11 left before halftime. The Celtics took a 58-41 lead into halftime.\n\"We understand the way we played the second half is the way we need to start the game,\" Suns coach Earl Watson said.\nHONORING LEGENDS\nThe Suns brought back members of the 1975-76 team that made a run to the NBA Finals that season for a 40th anniversary reunion. Attendees included former players Alvan Adams, Dick Van Arsdale, Paul Westphal, Garfield Heard and Ricky Sobers. Phoenix lost the series to the Celtics 4-2.\nTIP-INS\nCELTICS: Bradley flew to Phoenix on Saturday and arrived in time to start the game. He'd been dealing with an illness, and finished with 15 points. \"Started getting a little tired in the second half,\" Bradley said. \"But I just want to play as hard as I can.\" ... The Celtics recalled F Coty Clarke and G/F James Young from the Maine Red Claws of the D-League on Saturday. ... Boston hasn't started a lengthy West Coast road trip this late in the season since 1988-89, when the Celtics had regular-season games out west April 4-7, 1989.\nSUNS: F Jon Leuer didn't play due to illness. ... C Tyson Chandler was held out with back spasms. ... Knight returned to action after missing Friday night's game in Sacramento with an upset stomach. ... Suns F John Jenkins took only three shots in his second consecutive start, and made all three 3-pointers. He has hit nine straight 3s in games since March 18.\nUP NEXT\nCeltics: At Los Angeles Clippers on Monday.\nSuns: At Minnesota on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994823.6922529
}