{
  "game_id": "0022301228",
  "espn_id": "401617581",
  "date": "Dec 08, 2023",
  "matchup": "PHX vs. SAC",
  "headline": "Fox scores 23 of 34 points in 4th quarter, Kings pull away late to beat the Suns 114-106",
  "body": "PHOENIX -- — The short-handed Phoenix Suns kept hitting shots in the fourth quarter, trying to steal a victory at home against the Sacramento Kings on Friday night.\n\n\r\n              De'Aaron Fox simply wouldn't let them.\n\n\r\n              Fox scored 23 of his 34 points in the fourth quarter, Domantas Sabonis added 15 points and 17 rebounds and the Kings pulled away late to beat the Suns 114-106 on Friday night.\n\n\r\n              “Shots started going in,” Fox said. “It's really simple as that. Tried to stay aggressive, teammates getting me open with screens and getting matchups that we like. It all just came together in the fourth quarter for myself.”\n\n\r\n              Fox — a seventh-year guard — shot 8 of 13 in the fourth quarter, including all four of his 3-point tries. The 2022 All-Star is averaging 30.5 points, which is easily a career high.\n\n\r\n              The Kings won their third straight game in the series. Devin Booker led the Suns with 28 points on 10-of-14 shooting and added seven rebounds and seven assists.\n\n\r\n              The Suns — playing without stars Kevin Durant (ankle) and Bradley Beal (back) — led 59-50 at halftime after a 13-3 run to end the second quarter. Booker shot 7 of 9 from the field before the break, scoring 18 points. Sabonis led the Kings with 10.\n\n\r\n              But the Kings flipped the advantage in hurry, taking an 83-71 lead into the fourth quarter. Phoenix scored just 12 points in the third, struggling to find opportunities for the double-teamed Booker.\n\n\r\n              “Really, we were just throwing junk defenses at them,” Fox said. “Stuff that we really hadn't even worked on. Those are the kinds of things you have to be able to do on the fly, especially when someone like Booker gets it going.”\n\n\r\n              Said Suns coach Frank Vogel: \"That's when they made their move. Credit their coaching staff, they did a good job mixing coverages throughout the game.\"\n\n\r\n              Sacramento pushed ahead by 15 early in the fourth but the Suns hit four straight 3-pointers to stay in the game. The Kings would remain in control — partly because of a five-point swing by Fox.\n\n\r\n              Fox was fouled on a 3-point attempt by Jusuf Nurkic with 6:08 left in the game and the call was upgraded to a Flagrant 1 because Nurkic didn't give space for Fox to land after the jumper. Fox hit two of three free throws and then made a 3-pointer on the ensuing possession, pushing the Kings ahead 101-90.\n\n\r\n              Sacramento got lots of production from its bench. Rookie Sasha Vezenkov scored 14 points, Malik Monk had 13 and Keon Ellis added 10. \n\n\r\n              The Suns fell to 5-6 at home this season. Eric Gordon scored 19 points while Nurkic added 15 points and nine rebounds.\n\n\r\n              “We're not there yet,\" Gordon said. “We're going to get there. We've just got to continue grinding through — lots of injuries, lots of things happening, but will be fine. Our effort's there.”\n\n\r\n              The teams played after both lost in the quarterfinals of the inaugural NBA In-Season Tournament. The Suns fell to the Lakers, while the Kings lost to the Pelicans.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Brooklyn on Monday night.\n\n\r\n              Suns: Host Golden State on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996746.292825
}