{
  "game_id": "0022300038",
  "espn_id": "401584126",
  "date": "Nov 21, 2023",
  "matchup": "TOR @ ORL",
  "headline": "Banchero, Magic beat Raptors 126-107 for 4th straight win",
  "body": "ORLANDO, Fla. -- — Paolo Banchero scored 25 points, Jalen Suggs added 18 points and a lot of energy, and the Orlando Magic won their fourth straight, 126-107 over the Toronto Raptors in an NBA In-Season Tournament game on Tuesday night.\n\n\r\n              Cole Anthony came off the bench with 15 points and 10 assists in the Magic's second win in three tournament games. They will conclude their group play with a home game Friday against Boston, the current East Group C leader at 2-0. The Raptors dropped to 0-2 in the tournament.\n\n\r\n              Dennis Schroder led Toronto with 24 points while Pascal Siakam had 16 points and eight assists for the Raptors, who shot 50.7% and made 14 of 28 3-point shots, but committed 23 turnovers.\n\n\r\n              The defensive effort that produced those turnovers included 12 Magic steals, eight blocked shots and floor play by Suggs that got so hectic that he needed a break — almost as badly as Toronto.\n\n\r\n              “In the first half I felt myself getting a bit too into it,” Suggs acknowledged. “I had to go back and breathe, take a second to come back to my center.”\n\n\r\n              The team fed off the energy.\n\n\r\n              “In one moment he was asking for a timeout for himself because he had played himself to exhaustion,\" said Magic coach Jamahl Mosley. “The next moment he makes a three and then they’re calling timeout. His energy is just contagious... it’s just incredible how he’s willing to throw his body everywhere.”\n\n\r\n              Suggs' 3-pointer broke a 4-4 tie in the first two minutes and put the Magic ahead to stay, and his defense set his team's mind set for the next 46 minutes.\n\n\r\n              “We strap up, simple as that. We take pride in it,” Anthony said. “I watch how hard Jalen plays at the defensive end, and it makes me want to play hard too.”\n\n\r\n              “Defense is the thing that’s going to travel every game,” Banchero said. “As long as the defense is there, we feel like we’ll be in every game.”\n\n\r\n              After setting a franchise record with 44 assists Sunday in a win over Detroit, the Raptors finished with 29 on Tuesday night, the 10th straight game in which they had at least 25 assists.\n\n\r\n              Gary Harris and Jonathan Isaac scored twice each in an 11-0 run that gave Orlando a 19-point lead midway through the second quarter.\n\n\r\n              “We just could not keep up with their pace,” said Toronto coach Darko Rajakovic. “We were late to get back, late to get in our defensive positions to help each other. And they were able to score in the paint a lot, which they do on an elite level.”\n\n\r\n              Scottie Barnes finished the first half with a 3-pointer to pull the Raptors to within 11, but the Magic opened the third quarter with six straight points and pulled away to a lead that reached 27 at one point.\n\n\r\n              Toronto center Jakob Poeltl, who came into the game second in the league in field-goal percentage (.699), shot 5 for 7 and had 10 points and 10 rebounds before fouling out with 6:56 left.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Indiana on Wednesday night.\n\n\r\n              Magic: At home against Denver on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995454.032612
}