{
  "game_id": "0021501195",
  "espn_id": "400829082",
  "date": "Apr 10, 2016",
  "matchup": "LAL @ HOU",
  "headline": "Harden scores 40 to help Rockets beat Lakers 130-110",
  "body": "HOUSTON -- James Harden shared a private moment with Kobe Bryant after leading the Houston Rockets to a crucial win over the Los Angeles Lakers on Sunday.\nOf course he congratulated Bryant on his illustrious career. But he also threw in a plea for assistance from the 18-time All-Star.\n\"On a side note I just told him: `We need y'all to beat Utah,\" Harden said. \"We just need some help.\"\nHarden scored 20 of his 40 points in the fourth quarter, and Houston kept its playoff hopes alive with a 130-110 victory. Utah won 100-84 at Denver, so the Rockets remained one game behind the Jazz for the eighth and final playoff spot in the Western Conference.\n\nThe Rockets close out the regular season with Minnesota and Sacramento. The Jazz play Dallas before finishing the season on Wednesday against the Lakers in Los Angeles.\nBryant laughed when asked about Harden's request.\n\"He did. He did,\" Bryant said. \"I said `Well they beat us by 40 the last two times we played them, so third time's the charm.\"\nHarden, who paid homage to Bryant by wearing an early pair of his Adidas shoes, also had 13 assists. Trevor Ariza and Patrick Beverley scored 19 points apiece for the Rockets (39-41), who had lost two in a row.\nThe Lakers (16-64) pulled within two early in the fourth quarter before Harden got rolling, scoring 16 points in less than four minutes to help push the lead to 108-96.\n\"When guys are making shots it makes it more fun, guys are getting into the game and so hopefully we can continue that (Monday) night,\" Harden said.\nBryant, who has just two games left before his retirement, had 35 points for Los Angeles, which has dropped five in a row. Jordan Clarkson had 21 points and eight rebounds.\nBryant shared a long hug with Hall of Famer Hakeem Olajuwon on his way off the court as the crowd cheered loudly.\n\"It's a beautiful thing,\" he said of the outpouring of support he has received on each stop of his farewell tour. \"I found enjoyment in it and in being able to say thank you to everybody and vice versa. Rarely as an athlete do you get an opportunity to do that. Normally your career comes and it goes . I'm very appreciative.\"\nClarkson hit a pair of 3s to help the Lakers stay close in the fourth, but Houston used a 9-2 run, powered by seven points from Harden, to make it 102-93 with about seven minutes remaining.\nMarcelo Huertas made a 3-pointer for the Lakers before Harden got going again, making two more 3s to help extend the lead to 12 midway through the quarter.\nBryant was 10 for 22 from the field and 11 for 11 at the line while playing 27 1/2 minutes, showing glimpses of the offensive force he was when he was younger.\nHouston had a 76-64 lead in the third when Bryant heated up. He scored nine straight points, highlighted by an off-balance reverse layup that went in as he crashed to the court. Bryant also wowed the many Los Angeles fans in the crowd when he shook off Clint Capela and stepped back for a 3-pointer.\nThe Rockets then got back on track, scoring the next six points, to make it 82-73. Bryant capped his big third quarter with a 3-pointer with three seconds left.\nTIP-INS\nLakers: Julius Randle scored 11 points. ... Bryant also had two steals, two rebounds and an assist.\nRockets: Dwight Howard had nine points, 13 rebounds and three blocks. ... Houston outscored the Lakers 62-48 in the paint. ... The Rockets made 17 3-pointers.\nHONORING KOBE\nThe Rockets played a video to honor Bryant before he was introduced on Sunday. Ariza, who spent two seasons with the Lakers, spoke on the video which highlighted Bryant's accomplishments and thanked him for his contributions to the game.\nAfter the game Ariza talked about the difficulties of guarding Bryant.\n\"When he gets like that, there's really nothing you can do,\" Ariza said. \"I remember my first ever game playing against him, he had 40 and my last one he had 35, so I guess I got a little bit better.\"\nUP NEXT\nLakers: Visit Oklahoma City on Monday.\nRockets: Visit Minnesota on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994231.7976708
}