{
  "game_id": "0021900549",
  "espn_id": "401161191",
  "date": "Jan 07, 2020",
  "matchup": "TOR vs. POR",
  "headline": "Melo hits 17th career go-ahead shot to sink Raps",
  "body": "TORONTO -- With Damian Lillard double-teamed, Carmelo Anthony stepped up to sink the game-winning basket for the Portland Trail Blazers.\nAnthony made a clutch shot with four seconds remaining, and Portland rallied to beat the Toronto Raptors 101-99 on Tuesday. He has hit 17 go-ahead field goals in the final five seconds of the fourth quarter or overtime, four more than any other player since 2003-04.\n\"A guy with his type of ability, it's just a matter of opportunity,\" Lillard said. \"He had one guy guarding him, and he got to his spot. Once he got to his spot and I saw him raising up, I thought it was going in.\"\nAnthony scored 28 points, Lillard had 20, and Hassan Whiteside added 14 points and 16 rebounds for his sixth straight double-double as the Trail Blazers snapped a four-game losing streak in Toronto and won for the second time in 10 meetings with the defending champion Raptors.\n\"This is a big confidence-booster for us, a big morale boost,\" Anthony said.\nBlazers coach Terry Stotts agreed.\n\"I was really proud of the way our team competed tonight, particularly in the fourth quarter,\" Stotts said. \"At the end of the season, you look back on different games, and this could very well be a game that we look back on that turned the tide.\"\nPortland had lost six of seven overall. The Blazers improved to 2-12 against opponents with winning records.\nAnfernee Simons scored 12 points, and CJ McCollum had 10 after sitting out Sunday's loss in Miami because of an upper-respiratory infection.\nThe Blazers trailed 78-69 through three quarters, then fell behind 85-73 with 8:20 to go. Lillard tied it at 99 on a 35-foot 3-pointer with 38 seconds left in the fourth, leading to a Raptors timeout.\nToronto coach Nick Nurse was adamant that Rondae Hollis-Jefferson had been the victim of an illegal screen by Whiteside on Lillard's deep 3.\n\"It was clearly, clearly an offensive foul on Whiteside that wiped us out to tie the game,\" Nurse said.\nToronto's Patrick McCaw turned it over with 13.6 seconds remaining, giving the Blazers a chance at a winning shot. With Lillard under wraps, McCollum took the inbounds pass and got the ball to Anthony, who connected from near the free throw line.\nKyle Lowry got one final chance for the Raptors, but his off-balance 3 bounced off the rim at the buzzer.\nPortland connected on 12 of 19 attempts in the fourth, making six shots from long range.\nLowry had 24 points and 10 rebounds, and Serge Ibaka added 17 points and 11 rebounds as the injury-ravaged Raptors lost for just the second time in 16 games against opponents with losing records. Toronto's only other loss to a sub-.500 team came against Boston in the second game of the season, when the Celtics were 0-1.\nOshae Brissett scored a career-high 12 points for Toronto, and Chris Boucher had 12, including 10 straight Raptors points in the fourth.\nRaptors guard Fred VanVleet sat out because of a strained right hamstring, joining a group of injured Toronto starters that includes Norman Powell (left shoulder), Marc Gasol (left hamstring) and Pascal Siakam (groin).\nVanVleet limped off late in the fourth quarter of Saturday's win at Brooklyn and did not practice Monday. Nurse said it would be \"a little bit\" before the team determined a timeline for VanVleet's return.\nHollis-Jefferson started for VanVleet.\nEJECTED\nPortland's Kent Bazemore was ejected with 3:06 left in the third after a double technical. Bazemore got tossed for arguing after complaining about several non-calls.\n\"Just frustrated and took it upon myself to express it,\" Bazemore said.\nTIME TO LEAD\nBesides the final score, Portland's only other lead was 4-3 in the first quarter. The Blazers led for a total of 18 seconds.\nMELO MOOD\nPortland is 5-3 when Anthony scores 20 or more.\nTIP-INS\nTrail Blazers: Portland shot 1-for-8 from 3-point range in the first quarter. ... Lillard attempted three shots in the first half. He shot 5-for-8 in the final two quarters.\nRaptors: In their first home game since his death on New Year's Day, the Raptors honored late NBA Commissioner David Stern with a video tribute and a moment of silence. ... Asked about Powell's return, Nurse said, \"We should see him soon.\" ... G Matt Thomas returned after missing 21 games because of a broken left middle finger. His first shot was an air ball.\nUP NEXT\nTrail Blazers: Visit the Minnesota Timberwolves on Thursday.\nRaptors: Visit the Charlotte Hornets on Wednesday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764995614.575234
}