{
  "game_id": "0022300488",
  "espn_id": "401585116",
  "date": "Jan 05, 2024",
  "matchup": "ORL @ DEN",
  "headline": "Banchero records 1st triple-double, hits go-ahead free throws as Magic hold off Nuggets 122-120",
  "body": "DENVER -- — Paolo Banchero was pleased with his first career triple-double. What made it even better was its central role in a stirring comeback. \n\n\r\n              Banchero hit a pair of go-ahead free throws with 9.7 seconds remaining and the short-handed Orlando Magic rallied Friday night for a 122-120 win over the Denver Nuggets.\n\n\r\n              The young Magic forward finished with 32 points, 10 rebounds and 11 assists. He hit four free throws in the last 34.6 seconds in a game where the Magic trailed by as many as 18 points in the third quarter.\n\n\r\n              “Just the power of just positive energy and just pushing each other,” said Banchero, who was 15 of 19 from the free throw line. “We just told each other, ‘We’re all we got. We're going to live with the result, whatever it is, but we’re not just going to roll over and let these guys blow us out.'” \n\n\r\n              With the game tied at 120, the Nuggets had a chance to take the lead. But Moritz Wagner stole a pass from Kentavious Caldwell-Pope and fed it to Banchero, who drew a foul and made the free throws. \n\n\r\n              The final play of the game was designed to go to either Jamal Murray or Nikola Jokic, but the Magic defended it well. Murray's 10-foot floater rimmed out at the buzzer. \n\n\r\n              “Sometimes, we miss,” Jokic explained. “Sometimes, we make.”\n\n\r\n              Like the night before, when the Nuggets rallied from an 18-point deficit in the fourth quarter to beat the Golden State Warriors on Jokic’s buzzer-beating 40-foot jumper.\n\n\r\n              Trailing 78-60 midway through the third, the Magic found their rhythm against a Nuggets team that showed signs of fatigue down the stretch. Orlando hit 17 3-pointers and went 23 of 34 from the free-throw line.\n\n\r\n              “We lost this game in the third quarter,” said Nuggets coach Michael Malone, whose team was outscored 41-31 in the pivotal quarter. “It’s back-to-back nights where our third-quarter defense has been just completely nonexistent. ... As I told our guys, whatever you’re doing at halftime, it’s not working — individually and collectively.\n\n\r\n              \"Disappointing outcome.”\n\n\r\n              Jalen Suggs had a career-high 27 points for an Orlando team that went 1/3 in a four-game swing out West. \n\n\r\n              The Magic had a lengthy list of players sitting out Friday, including Markelle Fultz (left knee), Gary Harris (right calf), Wendell Carter Jr. (right knee), Joe Ingles (left ankle), Jonathan Isaac (right hamstring), Goga Bitadze (illness) and Franz Wagner (right ankle).\n\n\r\n              “It speaks volumes to the character that we have on this team,” said Suggs, who was 7 of 9 from 3-point range. “Not only next man up, but the confidence to trust and believe in each other. We weren’t walking out there like, ‘Oh, let’s just get it over with and go back home.’ We wanted to go win the game.\"\n\n\r\n              Jokic led Denver with 29 points in a game where Malone utilized 11 players to spread out the minutes. Michael Porter Jr. had 22 and Murray 20. They're still working on getting everyone involved within the flow of the offense.\n\n\r\n              “It's tough, because we do have a lot of guys who game-to-game, it could be a different hot hand,” Porter said. “That's a blessing and a curse, sometimes. Maybe the answer is staggering a couple starters with the bench unit. I don't really know the answer. I do feel like there are times in the game where Aaron (Gordon) doesn't touch the ball for an extended period of time. Or myself ... It's definitely a tough balance to find.\n\n\r\n              \"That’s really up to the coaches. That’s their job. That’s not our job. So we just do what we’re told, try to space the floor the right way, play through big fella. That’s all we can do. As the season goes on, we’ll continue to get better and better at finding that balance.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: Return home to play Atlanta on Sunday night.\n\n\r\n              Nuggets: Host the Detroit Pistons on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996171.750145
}