{
  "game_id": "0021800780",
  "espn_id": "401071452",
  "date": "Feb 02, 2019",
  "matchup": "CLE vs. DAL",
  "headline": "Mavs' Luka Doncic sixth player since 2000 to score 1,000 points before age 20",
  "body": "CLEVELAND -- Rookie Luka Doncic matched his season high with 35 points and did a little bit of everything for Dallas, and Harrison Barnes scored 13 in the fourth quarter to lead the undermanned Mavericks to a 111-98 victory over the Cleveland Cavaliers on Saturday night.\nWith a contingent of fans waving Slovenian flags to support Doncic, the 19-year-old showed why the Mavericks are so excited about their future. He added 11 rebounds, six assists and made a couple long 3-pointers that drew gasps from the Quicken Loans crowd.\nBarnes made three 3-pointers in the fourth and finished with 17 points, and rookie Jalen Brunson added 15 for the Mavericks, who played their second game since acquiring star Kristaps Porzingis from New York in a blockbuster trade. Tim Hardaway Jr., Courtney Lee and Trey Burke also came in the deal but are not eligible to play until their physicals are completed.\nJordan Clarkson scored 19 for Cleveland.\nThe Cavaliers, who have been dealing with injuries all season, suffered another one as forward Cedi Osman went out in the first half with a right ankle injury and did not return.\nDue to the trade, Dallas coach Rick Carlisle had only nine dressed players.\nFortunately, one of them was Doncic, who sat out Thursday's game in Detroit with a sore left ankle.\nDoncic scored 18 points in the first quarter, when he became the sixth player since 2000 to score 1,000 points before turning 20. LeBron James, Kevin Durant, Carmelo Anthony, Devin Booker and Dwight Howard did it before Doncic, who will be 20 on Feb. 28.\nDoncic finished the first half with 28 points, 10 in the final 3:56 after the Mavericks went more than six minutes without a field goal.\nHowever, it was Brunson and Barnes who had the bigger impact in the second half. Shortly after replacing Doncic, Brunson converted a 4-point play with 8:56 left and Barnes made his 3s, the last giving Dallas a 106-91 lead with 4:34 left.\nTIP-INS\nMavericks: Dirk Nowitzki received nice ovations each time he checked in or out. The 40-year-old has not officially announced his retirement, but Cleveland fans showed their love to one of the NBA's most popular players. ... Carlisle hopes Hall of Fame voters recognize the accomplishments of former NBA coach Bill Fitch, whom he called \"a master\" with \"staggering accomplishments.\" Fitch won 944 games over 25 seasons, but Carlisle believes he doesn't get enough credit for rebuilding several franchises, including the Cavaliers. Fitch gave Carlisle his coaching start, hiring him after cutting him with the Nets.\nCavaliers: Rookie G Collin Sexton shot 4 of 17. ... Coach Larry Drew doesn't expect F Kevin Love to return for Tuesday's game against Boston. Love hasn't played since Oct. 24 following left foot surgery. Love began participating in contact scrimmages this week. ... G David Nwaba returned after missing 18 games with a sprained left ankle. He scored 12 points in 15 minutes. ... It was a doubleheader of sorts for three Cleveland players -- G Kobi Simmons, F Deng Adel and F Jarod Blossomgame -- who were on the floor earlier in the day as the G League Canton Charge hosted the Windy City Bulls.\nUP NEXT\nMavericks: Host Charlotte on Wednesday.\nCavaliers: Host Boston on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994760.850914
}