{
  "game_id": "0022200226",
  "espn_id": "401468381",
  "date": "Nov 18, 2022",
  "matchup": "MIL @ PHI",
  "headline": "Joel Embiid, short-handed 76ers rally to beat Bucks 110-102",
  "body": "PHILADELPHIA -- — Joel Embiid had 32 points, 11 rebounds and eight assists and the short-handed Philadelphia 76ers overcame a 13-point deficit to beat the Milwaukee Bucks 110-102 on Friday night.\n\n\r\n              Embiid, who averaged 40 points and 11 rebounds in his previous four games, had 19 points, eight rebounds and five assists in the second half after 76ers star guard Tyrese Maxey left just before halftime with a left foot injury.\n\n\r\n              “He’s so good right now,” Philadelphia coach Doc Rivers said about Embiid. “Down the stretch the game slowed down so much for him. We told him exactly what we wanted him to do in the last six minutes and he was terrific.”\n\n\r\n              Maxey had 24 points, five assists and four rebounds before rolling his ankle while driving to the basket against Jevon Carter. Philadelphia said he will have an MRI Saturday. Rivers added that Maxey was already wearing a walking boot after the game.\n\n\r\n              Giannis Antetokounmpo led the Bucks with 25 points and 14 rebounds, however, his struggles from the free-throw line — he went 4 of 15 — were amplified with each attempt in the second half by a raucous Philadelphia crowd.\n\n\r\n              He was so frustrated by his performance, that after the game he went back onto the court to practice free throws and got into an argument with an arena worker who was preparing to do some work on the basket. Antetokounmpo shoved the worker’s ladder across the court in disgust.\n\n\r\n              Already without starters James Harden and Tobias Harris, once Maxey went out Philadelphia stepped up the defensive effort, especially in the third quarter when it outscored Milwaukee 34-22.\n\n\r\n              Rivers praised veteran P.J. Tucker for leading that defensive charge. Tucker was tasked with guarding Antetokounmpo most of the game. Tucker didn’t score a point but was a plus-11. \n\n\r\n              “Our defense has been off the charts,” Rivers said. “Tucker may have been our most important player on the floor. It’s a great example of how you can help your team without scoring. He was huge tonight.”\n\n\r\n              Georges Niang added 17 points for Philadelphia, and Shake Milton had 15.\n\n\r\n              Bobby Portis had 21 points and 11 rebounds for Milwaukee. Brook Lopez added 15 points.\n\n\r\n              “We’ve been talking about it since training camp,” Milton said. “We need to have that next man up mentality. If one guy goes down we have to be ready to step in when called upon. We did that as a team tonight.”\n\n\r\n              TIP-INS\n\n\r\n              76ers: A little more than two weeks since suffering a right foot tendon strain that is expected to keep him out of action for a month, Harden said he believes he’s on track to return on time. Harden began taking shots at practice Thursday. ... F Tobias Harris missed Friday’s game with what the team called left hip soreness. Danuel House Jr. started in his place.\n\n\r\n              Bucks: Both G Grayson Allen and G Jrue Holliday returned to the lineup after missing time with right ankle sprains.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Portland on Monday night.\n\n\r\n              76ers: Host Minnesota on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994598.136974
}