{
  "game_id": "0021600007",
  "espn_id": "400899382",
  "date": "Oct 26, 2016",
  "matchup": "DET @ TOR",
  "headline": "DeRozan's 40 leads Raptors to 109-91 win over Pistons",
  "body": "TORONTO -- DeMar DeRozan had clearly been itching for the start of the regular season. Like so many other veterans, he had to grind his way through exhibition games in training camp, gradually moving from 11 points in his first preseason game, to 15, to 20 and finally to 34 in the final warm-up game last week.\nHis patience was rewarded Wednesday night as the Olympic gold medalist had 40 points in the Toronto Raptors' 109-91 season-opening victory over the Detroit Pistons, his third career 40-point outing and just two off his career high.\n\"Preseason (stunk),\" he said. \"But you've got to do it and now the real deal is here and you're just trying to catch a rhythm.\"\nDeRozan made a career-high 17 field goals on 27 shots and was a perfect 6 for 6 from the free throw line, while Jonas Valanciunas was 10 for 15 from the field to go along with 11 rebounds. Valanciunas' previous career high was 31, also against the Pistons, on Jan. 12, 2015.\nAccording to Elias Sports Bureau, the duo became the first teammates in NBA history with a 40-point game and a 30-point game in a season opener. DeRozan also broke Vince Carter's opening-night franchise record of 39 points, set against the-then New Jersey Nets in 2003.\n\"I never keep track,\" DeRozan said of his record-breaking exploits. \"Somebody always informs me after the game.\"\nValanciunas also played down his accomplishment, despite registering his second career 30-point game, as the Raptors led from the 5:13 mark of the first quarter and never looked back.\n\"Eighty-one games to go,\" he said. \"We should not get too excited; this is just the start.\"\nTobias Harris had 22 points and Marcus Morris had 17 points and nine rebounds for the Pistons, who lost for the eighth time in their last 11 games against Toronto.\nCoach Stan Van Gundy was particularly irked with his team's defensive play in losing their season opener for the fifth time in seven years, especially the fact that Detroit was outrebounded 51-40. It didn't help that center Andre Drummond left the court after getting elbowed in the jaw by Valanciunas early in the first quarter, though he later returned.\n\"The rebounding was a major concern,\" he said. \"(Giving up) 54 points in the paint was a major concern and 29 free throw attempts, so that just means the team took it right at you.\"\nTIP-INS\nPistons: Henry Ellenson, Detroit's first-round draft pick last June (18th overall) went scoreless in 2:10 of play, while second-round selection Michael Gbinije (49th overall), had two points in 2:10.\nRaptors: C Lucas Nogueira (ankle) sat out. . DeRozan started his franchise-record eighth straight season opener, breaking a tie with Carter. . First-round draft pick Jakob Poeltl became the first Austrian to play in the NBA. He finished with two points in 12:47 of court time. . Oct. 26 is the earliest date that Toronto has ever had a home opener. . The Raptors are 13-9 on opening night and have won four straight.\nHE SAID IT\n\"It's one thing to watch somebody on TV and see what he does every single night and actually being there and seeing how effortless it was. It was amazing, he was just getting to his spots, shooting over people and it's like, `How does he do that?\"\nRookie Pascal Siakam, drafted 27th overall in June, on the play of DeRozan. Siakam became the first Toronto rookie to start a season opener since Valanciunas in 2012, and rose to the occasion, hauling in nine rebounds to go along with four points in 21 minutes.\nUNITED NATIONS\nWith the draft-day additions of Poeltl (Austria) and Siakam (Cameroon), Toronto's roster has players representing five countries other than the United States. Valanciunas (Lithuania), Cory Joseph (Canada), Nogueira and Bruno Caboclo (Brazil) round out the group. In their 21 seasons, the Raptors have had players representing 16 countries.\nANOTHER DIMENSION\nEvery fan at the Air Canada Centre was given a pair of 3D glasses. As the Raptors opened their season some of the players were jumping out of the Jumbotron to highlight some of the more spectacular plays from last season.\nUP NEXT\nPistons: Host Orlando on Friday in their home opener. Van Gundy is 6-1 against his former team since taking charge in Detroit.\nRaptors: Host Cleveland on Friday in an early season rematch of last year's Eastern Conference Finals, won by the Cavaliers in six games.",
  "source": "espn_api",
  "crawled_at": 1764996091.835198
}