{
  "game_id": "0021500519",
  "espn_id": "400828406",
  "date": "Jan 04, 2016",
  "matchup": "MEM @ POR",
  "headline": "Randolph leads Grizzlies to 91-78 win over Trail Blazers",
  "body": "PORTLAND, Ore. --  Zach Randolph said he doesn't mind coming off the bench if that's what is best for the Memphis Grizzlies.\n\nAgainst his former team, it certainly was.\n\nRandolph had 26 points and a season-high 18 rebounds, and Memphis beat the Trail Blazers 91-78 on Monday night to spoil Damian Lillard's return to the Portland lineup.\n\n\"I'm a team-first guy. It's not about me, it's about winning and whatever the coach thinks is best for the team. So that's how I'm approaching it,\" Randolph said.\n\nRandolph also came off the bench Saturday when Memphis lost at Utah 92-87 in overtime, scoring just eight points with five rebounds in 25 minutes.\n\nGrizzlies coach David Joerger said Randolph was disappointed in his performance against the Jazz and told the coach he could do better.\n\n\"He doesn't like it, let's be honest,\" Joerger said. \"He's such a pro and his teammates respect him a lot and he respects his teammates a lot. He's out there doing everything he can.\"\n\nLillard had missed seven games for the Blazers because of plantar fasciitis in his left foot. The Blazers went 4-3 while he was out, with CJ McCollum sliding over to point guard.\n\nLillard looked rusty at the start of his return and the Grizzlies took advantage, leading by as many as 20 early in the fourth quarter.\n\nPortland closed the gap to 80-71 after Lillard's 3-pointer with 6:11 left. Meyers Leonard hit another 3 that got the Blazers to 84-76, but Randolph answered with a long jumper and Portland ultimately couldn't catch up.\n\nLillard led the Blazers with 17 points. He shot 4 of 14 from the field but made all seven free throws.\n\n\"I was just happy to be out there,\" Lillard said. \"I didn't put too much pressure on myself, it being the first game. I just wanted to come out and make sure that I was responsible and did what I needed to do defensively, get to the spots I needed to be on and make the right plays.\"\n\nCourtney Lee had 16 points and Mario Chalmers added 10 off the bench for Memphis, which got 50 points from its reserves.\n\nMatt Barnes returned to the Grizzlies after a two-game suspension for an altercation with New York Knicks coach Derek Fisher in October.\n\nRandolph, who spent his first six seasons with the Blazers, scored six points in his first 9 minutes and the Grizzlies had a 17-15 lead after the first quarter. Neither Lillard nor McCollum scored in the period.\n\nMemphis led 38-34 at halftime, with Lillard going 0 for 5.\n\nMcCollum's 3-pointer pulled the Blazers into a 40-all tie but Memphis wouldn't let Portland get in front, going on a 15-5 run to take a 55-45 lead capped by Randolph's long jumper.\n\nRandolph became the third Memphis player with multiple games of 20-plus points and 10-plus rebounds off the bench. He's got nine double-doubles this season.\n\nMcCollum finished with 16 points.\n\nPortland was coming off a 112-106 victory at Denver the night before.\n\nLillard had 27 points and McCollum scored 20 earlier this season when the Blazers beat the Grizzlies 115-96 at the Moda Center.\n\nTIP-INS\n\nGrizzlies: Mike Conley was questionable for the game because of a sore back but he started. ... Vince Carter acknowledged the cheers following a feature on the video scoreboard in which most of the Blazers said Carter was the game's best dunker.\n\nTrail Blazers: Lillard is on Forbes magazine's 30 under 30 list. ... Portland is 2-9 in the second game of back-to-backs. ... Portland's 78 points were a season low.\n\nMORE RANDOLPH\n\nHis points tied a season high and his rebounds set a season best. According to the Elias Sports Bureau, Randolph is the first player 34 or older to have 26-plus points and 18-plus rebounds off the bench.\n\nMATCHING UP WITH Z-BO\n\nThe task went to Al-Farouq Aminu, who finished with 15 points and 14 rebounds for his sixth double-double this season.\n\n\"I thought we gained a little traction with that lineup with (Aminu) guarding him and spacing at the offensive end,\" Trail Blazers coach Terry Stotts said. \"You've got to pick your poison with the offense struggling.\"\n\nUP NEXT\n\nThe Grizzlies visit Oklahoma City on Wednesday.\n\nThe Trail Blazers host the Los Angeles Clippers on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994449.877412
}