{
  "game_id": "0021900028",
  "espn_id": "401160670",
  "date": "Oct 26, 2019",
  "matchup": "ATL vs. ORL",
  "headline": "Trae Young scores 39 points, Hawks edge Magic, 103-99",
  "body": "ATLANTA --  Trae Young wants the ball when the game is on the line.\n\nHe knows he's expected to be Atlanta's big-time player.\n\nYoung scored 39 points, including Atlanta's last eight, to continue his hot start and the Hawks beat the Orlando Magic 103-99 on Saturday night.\n\nWhen asked how he flourished in the final minutes, Young said: \"That's what makes big-time players what they are. They step up in big moments.\"\n\nYoung, who had 38 points in Atlanta's season-opening win at Detroit, again carried the scoring burden for the Hawks. Atlanta had no other player with more than 10 points.\n\nThe second-year point guard added nine assists and seven rebounds.\n\nYoung took over the game after Orlando led 96-95. His baseline reverse layup gave the Hawk the lead. Following a tying free throw by Aaron Gordon, Young's layup again gave the lead back to the Hawks.\n\nYoung added a long, fallaway 3-pointer, stretching the advantage to 102-97 with 25 seconds remaining. He celebrated with a shimmy strut toward the other end of the court.\n\n\"He's clutch, man,\" Hawks forward John Collins said. \"He just has that clutch gene. Guys like him take the shots down the stretch and just expect them to go in.\"\n\nThe Magic couldn't find a way to stop Young.\n\n\"I tried to stay in front and make him shoot over top of me,\" said Markelle Fultz. \"He shot it. Just got to slap him on the butt and say, `Good shot.\"\n\nYoung's 38 points against Detroit were the most in a season opener since Dominique Wilkins' 39 against the Nets in 1986. Young led NBA rookies with nine 30-point games last season, and now he already has two.\n\n\"Whatever it takes,\" Young said. \"I'm just glad we're winning.\"\n\nIn a matchup of 21-year-old point guards, Young had 17 first-half points. Fultz finished with 12 points.\n\nEvan Fournier led Orlando with 23 points. Nikola Vucevic had 16 points and 10 rebounds. D.J. Augustin had 14.\n\nWhile Young sank 5 of 10 3-pointers, Orlando made only 5 of 31.\n\n\"You can't win an NBA game shooting 17% from the 3,\" Magic coach Steve Clifford said. The actual figure was 16.1%.\n\n\"We're all pros,\" Gordon said. \"We got to make those shots.\"\n\nThe Hawks' 9-2 run to open the second half included Young's back-to-back trademark one-handed floaters. He added a steal of Gordon's pass and a 3-pointer for a 61-52 lead -- Atlanta's biggest of the game.\n\nAtlanta led 85-84 before Augustin's four free throws and Michael Carter-Williams' powerful jam gave Orlando a 90-85 advantage.\n\nAtlanta twice pulled even on shots by Young. His long 3-pointer tied the game at 90, and his jumper knotted the score at 94-all.\n\nJabari Parker and Kevin Huerter each had 10 points for Atlanta.\n\nYOUTH IS SERVED\n\nThe Hawks' youth doesn't end with Young. Atlanta's other starters were 20-year-old Cam Reddish, 21-year-old De'Andre Hunter, 22-year-old Collins and 26-year-old Alex Len. Reddish and Hunter, the team's first-round draft picks, each had six points. Collins had nine points and a game-high 12 rebounds.\n\nFREE FOR ALL\n\nThe Hawks overcame a lopsided disadvantage at the free-throw line. The Magic made 24 of 26 free throws. The Hawks were only 8 of 15 from the line.\n\nTIP-INS\n\nMagic:  Orlando opened a string of five games in eight days. The stretch ends with home games against the Knicks, Milwaukee and Denver next week.\n\nHawks: Rookie F Bruno Fernando left the game in the third period with a right ankle sprain. He was helped off the court. ... Huerter, who missed all five preseason games with right knee soreness, saw his playing time expand. He was limited to 15 minutes in the opener at Detroit and had 10 points and four assists in 20 minutes.\n\nUP NEXT\n\nMagic: At Toronto on Monday night.\n\nHawks: Host Philadelphia on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996695.3964539
}