{
  "game_id": "0021900308",
  "espn_id": "401160950",
  "date": "Dec 04, 2019",
  "matchup": "PHX @ ORL",
  "headline": "Gordon scores season-high 32 points, Magic beat Suns 128-114",
  "body": "ORLANDO, Fla. --  After spending most of the season struggling to find ways to win despite an inconsistent offense, scoring suddenly seems to come easily for the Orlando Magic. On Wednesday night, the Phoenix Suns witnessed that shift firsthand.\n\nAaron Gordon scored a season-high 32 points, Terrence Ross had 22 and the Magic beat the Suns 128-114 at Amway Center.\n\nEvan Fournier added 21 points, and Markelle Fultz had 13 points, five assists and four rebounds for the Magic.\n\nFrank Kaminsky led the Suns with 23 points and five rebounds, and Devin Booker had 17 points and five assists.\n\nThe Suns led by 10 points in the first half on the strength of a hot start from Kaminsky. He made nine of his first 10 shots and had 21 points by halftime.\n\nGordon made a pair of 3-pointers to jump start a 14-1 run early in the third quarter. Fournier added a 3-pointer to punctuate the scoring spree, giving the Magic a 79-62 advantage.\n\nGordon was 5 for 5 from 3-point range after entering the game shooting 28.4% from long range.\n\n\"Nobody expected him to shoot like that,\" Suns coach Monty Williams said. \"But he's a good player, and you tip your hat to him. I thought we did not respect him enough.\"\n\n\"It's just about relaxing and shooting my shot,\" Gordon surmised.\n\nThat hot shooting trend held true for many of his teammates as well. After failing to shoot 50% from the field in any of its first 19 games, Orlando topped that mark for the second time in two nights.\n\nThe Magic shot 57.6% from the field, topping their then season-best 51.1% in a 127-120 victory at Washington on Tuesday night. They scored more than 125 points for the second consecutive outing, a feat they have accomplished only two other times in franchise history.\n\n\"Our No. 1 weakness so far this year has been 3-point shooting. I believe we were 30th,\" Orlando coach Steve Clifford said of his team, which actually entered the game 29th in the NBA at 32.1% from 3-point range. \"Last year, I think we were 11th. We have good shooters getting into rhythm, and they're starting to shoot the ball better.\"\n\nTIP INS:\n\nSuns: The Magic's 57.6% shooting was the worst defensive showing of the season for Phoenix, topping the 57.3% it allowed in a loss at Washington on Nov. 27 .... G Ricky Rubio started despite an injury to his left hand sustained on Monday night at Charlotte.\n\nMagic: G Michael Carter-Willams did not play due to a nasal contusion sustained when he caught an elbow from Washington's Bradley Beal on Tuesday night ... F Al-Farouq Aminu (torn right meniscus) is awaiting word on whether he will need surgery.\n\nFOUL TREATMENT:\n\nBooker spent several minutes on the bench receiving treatment on his back after taking a hard fall while scoring a layup that gave his team a 20-14 lead. He ultimately returned before halftime, but his coach was displeased a foul was not called on the play.\n\n\"He's tough. You guys have seen him,\" Williams said. \"I don't think he gets enough respect from the referees. What do you have to do? Get a tech, go act like you don't have any sense, for a guy to get a foul? That was a foul. We don't need to go to the league and have a conversation with them about it. That was a foul.\"\n\nMORE FROM MO:\n\nWhile Gordon's torrid shooting pace stole the show, Mo Bamba quietly put together a double-double, finishing with 10 points and 11 rebounds in less than 19 minutes of action. His success on the glass helped lead the Magic to a 45-29 advantage in total rebounds.\n\n\"Tonight might have been his best game,\" Clifford said. \"He's in a routine and he does a good job with it. He's made good progress since last year.\"\n\nUP NEXT:\n\nSuns: At New Orleans on Thursday night.\n\nMagic: At Cleveland on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764996580.812483
}