{
  "game_id": "0021800883",
  "espn_id": "401071556",
  "date": "Feb 23, 2019",
  "matchup": "PHX @ ATL",
  "headline": "Young, Bazemore lead Hawks past Suns 120-112",
  "body": "ATLANTA --  Taurean Prince sensed before Saturday's game that the Atlanta Hawks had learned from their mistakes in the closing seconds the night before.\n\nTrae Young and Kent Bazemore each scored 23 points, Prince added 21 and Atlanta extended the Phoenix Suns' franchise-worst losing streak to 17 games with a 120-112 victory.\n\n\"It means we're growing,\" Prince said. \"We're not letting what happened in the past affect us in the future. We put that Pistons game behind us and capitalized on the game today. I think we did a good job.\"\n\nJohn Collins finished with 19 points and 14 rebounds for Atlanta, which snapped a two-game skid to avoid a home loss against the NBA's worst team. Just two weeks ago at State Farm Arena, the Hawks allowed the New York Knicks, last in the Eastern Conference, to snap an 18-game slide.\n\nAtlanta fell apart in the final minute Friday night against Detroit, but Bazemore liked how his team didn't fall into similarly bad habits against Phoenix.\n\n\"You look at this last bunch of games we've had, and we've been playing some good basketball,\" Bazemore said. \"We've been a play away or a rotation away or a little poor execution away from those games coming out in our favor. These have been good learning experiences.\"\n\nThere were 13 lead changes and three ties in the first half, but the Suns were just 1 for 1 on free throws while Atlanta was 14 of 15. The Hawks led 63-59 at the break, but Phoenix got 17 points from Tyler Johnson in the third quarter to lead by one heading into the fourth.\n\nThe Suns took their biggest lead at eight on a pair of free throws by DeAndre Ayton with 5:46 remaining. Omari Spellman answered with five points on Atlanta's next two possessions, and Phoenix went without a field goal for the final 4:16.\n\n\"I thought we played really hard,\" Johnson said. \"I thought we got into our offense a lot faster than we have in the past. We were really moving. Other than that, just the lapses in judgment at the end.\"\n\nYoung stepped back and made a deep straightaway 3-pointer to force a 105-all tie. He hit a pair of free throws at the 2:56 mark to give Atlanta the lead for good.\n\nJohnson scored 29 points, and Devin Booker added 26 for the Suns. Ayton had 14 points and 12 rebounds.\n\n\"We didn't play smart and we didn't have enough discipline to finish the game,\" Phoenix coach Igor Kokoskov said. \"It's a shame because I think we tried and we gave our best. The effort was there, but as I keep saying, effort alone is not enough.\"\n\nTIP-INS\n\nSuns: Haven't won since Jan. 12 against Denver and have just two victories in their last 26 games. ... Phoenix has allowed at least 111 points in each game of the losing streak.\n\nHawks: Rookie starting G Kevin Huerter missed his second straight game with a left ankle sprain. Atlanta coach Lloyd Pierce said he will see how Huerter looks at Monday's shootaround before deciding if he's ready to return.\n\nUP NEXT\n\nSuns: Visit the Miami Heat on Monday.\n\nHawks: Visit the Houston Rockets on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995061.414264
}