{
  "game_id": "0021500153",
  "espn_id": "400828040",
  "date": "Nov 16, 2015",
  "matchup": "CHI vs. IND",
  "headline": "Butler, Bulls hold on for 96-95 win over Pacers",
  "body": "CHICAGO --  With the final seconds ticking away, they stared each other down one last time, Paul George with the ball, and Jimmy Butler right in front of him.\n\nWhen George went up for a potential winning shot, Butler was right there for the Chicago Bulls.\n\nButler scored 17 points and played tough defense on George on Indiana's final possession, helping the Bulls hold on for a 96-95 victory over the Pacers on Monday night.\n\n\"Jimmy made some huge plays for us down the stretch,\" Chicago coach Fred Hoiberg said. \"Not only the last play, but he made some big baskets.\"\n\nButler stayed right with George and challenged his difficult fadeaway shot that was well short as time expired, sending the Bulls to their third straight win and fourth in five games.\n\n\"He's a hell of a player, a tough guard for anybody in the league,\" Butler said. \"But he went right, pulled up and I was there to contest and got a piece of the ball.\"\n\nIndiana coach Frank Vogel said the Pacers got the final play they wanted.\n\n\"I don't think there was a foul,\" he said. \"He just made a good defensive play.\"\n\nDerrick Rose had 23 points on 9-for-18 shooting for Chicago, but departed with about six minutes remaining after he sprained his left ankle. Doug McDermott scored 11 points.\n\n\"My ankle is a little bit sore, but I'm just happy nothing's tore or broken,\" Rose said. \"I'll be all right.\"\n\nGeorge had 26 points for Indiana, and Monta Ellis finished with 20 points. C.J. Miles made five 3-pointers on his way to 19 points, and Jordan Hill and Ian Mahinmi each grabbed 12 rebounds.\n\nIndiana had won three straight and six of seven.\n\n\"It is my job to help lead this team to a win,\" George said. \"I failed to do so tonight.\"\n\nGeorge was 9 for 20 from the field in his seventh consecutive game with at least 26 points. He also drew a charge on Tony Snell with 1:02 remaining and Indiana down 96-93, giving the Pacers another chance.\n\nEllis drove inside for a tough leaner on the other side, and Indiana got the ball back with about 24 seconds left after Butler missed for Chicago. But the All-Star clamped down on George to help Chicago hold on.\n\nIndiana played without guards George Hill (upper respiratory infection) and Rodney Stuckey (sprained right ankle), and it took a while for the Pacers to get into the game. Rookie Myles Turner also had surgery Monday to repair a chip fracture in his left thumb, sidelining the center for at least six weeks.\n\nChicago opened with a 15-2 run and led 31-21 after one. Indiana shot 35 percent (7 for 20) in the first period.\n\nThe Pacers trailed by as many as 15 in the third, but Ellis scored eight in the period to help them get within four heading into the fourth.\n\n\"We've got to learn to build on our leads, but a win's a win,\" Butler said. \"I'd rather learn from a win than from a loss.\"\n\nTINKER, TINKER\n\nHoiberg inserted Snell into the starting lineup in place of McDermott. Snell started Chicago's first five games, but McDermott had started the last four in the small forward spot.\n\nThe Bulls are playing without Mike Dunleavy Jr., who is recovering from back surgery in late September.\n\n\"Just trying to find the best five guys to go out there and get us off to a good start,\" Hoiberg said. \"You know we haven't been great early on in games defensively.\"\n\nNO TURNER\n\nTurner was injured during last week's victory at Boston. Initially, the team said the No. 11 overall pick in the June draft would miss four weeks.\n\n\"During the surgery, they found a ligament tear as well and that's complicated things a little bit and prolonged the timeline,\" Vogel said. \"Six weeks is the earliest he'll get back. It could be longer.\"\n\nThe 6-foot-11 Turner was off to a solid start, averaging 6.1 points and 2.9 rebounds in his first eight games.\n\nTIP-INS\n\nPacers: Indiana shot 40.2 percent (35 for 87) from the field, including a 9-for-21 performance from 3-point range. ... Led by Mahinmi and Jordan Hill, Indiana had a 50-48 rebounding edge.\n\nBulls: Taj Gibson had nine points and a season-high 11 rebounds. ... Chicago improved to 5-1 at home. ... The Bulls attempted a season-high 32 foul shots, making 20.\n\nUP NEXT\n\nPacers: Visit the Philadelphia 76ers on Wednesday night.\n\nBulls: Visit the Phoenix Suns on Wednesday night.\n\n---\n\nJay Cohen can be reached at http://www.twitter.com/jcohenap",
  "source": "espn_api",
  "crawled_at": 1764993974.349353
}