{
  "game_id": "0022400560",
  "espn_id": "401705126",
  "date": "Jan 14, 2025",
  "matchup": "POR vs. BKN",
  "headline": "Cam Johnson returns from ankle injury and has 24 points in Nets' 132-114 win at Portland",
  "body": "PORTLAND, Ore. -- — Cam Johnson returned from a five-game absence with a right ankle sprain and scored 24 points in the Brooklyn Nets' 132-114 victory over the Portland Trail Blazers on Tuesday night. \n\n\r\n              Keon Johnson and Noah Clowney each added 20 for the Nets, who snapped a five-game losing streak. \n\n\r\n              Scoot Henderson had a career-high 39 points, including eight 3-pointers, for the Blazers. \n\n\r\n              Nets guard Ben Simmons, whose status was uncertain because of lower back injury management and a sore left knee, started and finished with five points, 11 assists and nine rebounds. He'll sit out of Wednesday's game at the Clippers. \n\n\r\n              Blazers rookie Donovan Clingan was hit in the face as he went down late in the first quarter and headed to the locker room. He returned, but left the game again in the final moments after another hard fall. \n\n\r\n              The Nets led by as many as 16 points in the opening half but Portland closed the gap to 66-61 at halftime. Brooklyn led the rest of the way. \n\n\r\n              Takeaways\r\n              Nets: D'Angelo Russell (shin) also played, but the Nets were without Nic Claxton because of a sore hamstring. \n\n\r\n              Trail Blazers: The Blazers were without forward Deni Avdija after he tweaked his ankle during practice on Monday. ... Toumani Camara had a career-high 23 points. \n\n\r\n              Key moment\r\n              The Blazers pulled within 112-103 on Camara's basket with 5:28 left, but Russell hit a pair of free throws and added a deep 3-pointer to extend Brooklyn's lead. Moments later, Keon Johnson's 3 with 3:44 remaining made it 120-105 and all but sealed the win. \n\n\r\n              Key stat\r\n              Henderson had 17 points in the first quarter alone, including four 3-pointers. He hit his first eight shots from the field and had surpassed his season high with 25 points for Portland by halftime. \n\n\r\n              Up next\r\n              The Nets visit the Los Angeles Clippers on Wednesday. The Trail Blazers host the Clippers on Thursday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998179.037256
}