{
  "game_id": "0021600337",
  "espn_id": "400899779",
  "date": "Dec 09, 2016",
  "matchup": "CHA vs. ORL",
  "headline": "Hornets blow out Magic 109-88 for 3rd straight victory",
  "body": "CHARLOTTE, N.C. --  Kemba Walker didn't mind a bit kicking back and watching the Charlotte reserves play the entire fourth quarter of a blowout win over the Orlando Magic.\n\nEspecially with an important road game at Cleveland coming up on Saturday night.\n\n\"It's always nice to get a little bit of a break,\" Walker said. \"(The starters) played well so we were deserving of it, I thought.\"\n\nNic Batum and Michael Kidd-Gilchrist each had 16 points, and the Hornets routed the Magic 109-88 on Friday night for their third straight victory. Walker had 15 points in 25 minutes, and the Southeast Division leaders held the Magic to 37 percent shooting while outrebounding them 59-40.\n\nCharlotte's starters didn't even play in the fourth after the Hornets opened a 21-point lead with a late third-quarter surge.\n\nThe Hornets (14-9) have won six of eight, but now head out on a five-game road trip beginning in Cleveland.\n\n\"It's good momentum, obviously,\" coach Steve Clifford said. \"Whenever you are going to go on an extended trip, it's good to win the last home game before you leave. You want to build as much of a cushion as you can.\"\n\nBatum, who has 39 rebounds in his last four games, missed out on a chance at a triple-double because he didn't play in the fourth quarter with the game out of hand. He finished with nine rebounds and seven assists.\n\nThis could easily have been a classic trap game for Charlotte, but the Hornets took all the drama out of it with a dominant third quarter.\n\nThey opened a 52-46 lead at halftime behind a late second-quarter push led by Kidd-Gilchrist, who had 14 points at the break on 6-of-8 shooting. Charlotte extended the margin to 21 late in the third period as Walker began to heat up, beating defenders off the dribble with his quickness and knocking down jumpers.\n\n\"Just a lot of breakdowns in the third quarter in particular, on the defensive end with our transition defense, offensive rebounds,\" Magic coach Frank Vogel said. \"This is not a great offensive rebounding team, but they burned us tonight and they hit 3s every time they got one, so we didn't match back up. We just had more breakdowns across the board.\"\n\nEvan Fournier had 14 points for the Magic.\n\nTIP-INS\n\nMagic: Fournier was assessed a technical foul in the first half for arguing a call. ... Nikola Vucevic played despite a right corneal abrasion and had seven points in 22 minutes. ... Orlando went 9 of 34 on 3-point attempts.\n\nHornets: Have beaten the Magic four consecutive times. ... Walker has reached double digits in every game this season. ... Batum's streak of double-doubles ended at three games.\n\nOFFENSIVE WOES\n\nThe Magic have struggled recently on the offensive end.\n\n\"We have a very slim margin for error,\" Vogel said. \"We have to get guys to play more the right way, more often.\"\n\nBALL MOVEMENT\n\nThe Hornets moved the ball extremely well on offense against a Magic team that looked a step slow.\n\n\"We are a very unselfish team,\" Batum said. \"We're going to move the ball and involve everybody. The guys off the bench did a great job to finish the game, they tried to move the ball, play as a team and we did a good job of that.\"\n\nCAVS COMING UP\n\nWalker said he's eager to face the Cavaliers, who will also be playing on the tail end of a back-to-back.\n\n\"It's going to be tough playing against the defending champs, of course, in their building,\" Walker said. \"We lost there already, but we want to go out and play as hard as possible, same thing as tonight. Play some great defense, offensively make some shots and just play a good game.\"\n\nUP NEXT\n\nMagic: Orlando returns home to host the Denver Nuggets on Saturday night.\n\nHornets: Charlotte travels to Cleveland on Saturday night. The Hornets lost 100-93 there earlier this season.",
  "source": "espn_api",
  "crawled_at": 1764995527.0285099
}