{
  "game_id": "0022300934",
  "espn_id": "401585562",
  "date": "Mar 11, 2024",
  "matchup": "PHX @ CLE",
  "headline": "Kevin Durant scores 37 points, rallying Suns to 117-111 victory over Cavaliers",
  "body": "CLEVELAND -- — Kevin Durant scored 37 points and Devin Booker had 27 in his return from a right ankle sprain, rallying the Phoenix Suns to a 117-111 victory over the injury-depleted Cleveland Cavaliers on Monday night.\n\n\r\n              Durant also had eight rebounds and six assists for the Suns, who are one game ahead of Sacramento for sixth place in the Western Conference. Booker had missed four games with his injury, but played 38 strong minutes and had seven assists and six boards.\n\n\r\n              “Book’s communication has been on-point, always, but his intangibles are what we missed the most,” Durant said. “It’s good to have him out there with his talent and I’m glad he was able to get his feet wet in a tight game, too.”\n\n\r\n              Phoenix trailed 63-44 midway through the second quarter, but answered with a 43-15 run that ended deep in the third. Booker later put the Suns ahead for good at 106-104 by scoring in transition with seven minutes remaining.\n\n\r\n              The Suns began a four-game trip that includes contests against East powers Boston and Milwaukee. Bradley Beal had 24 points, Grayson Allen scored 14, and Jusuf Nurkic added nine points and eight rebounds.\n\n\r\n              “We’ve got a chance to be elite with (Durant, Booker and Beal), so we’re grateful to have them all back,” Phoenix coach Frank Vogel said. “That type of game becomes a slugfest, but you could see the work Devin put in while he was out. He had a great performance.”\n\n\r\n              Darius Garland scored 30 points and Caris LeVert had 17 points and 11 rebounds for the Cavaliers. Cleveland trailed 113-111 with 51 seconds on the clock before Jarrett Allen and Isaac Okoro committed back-to-back turnovers to end its comeback hopes.\n\n\r\n              The Cavaliers, who are third in the East, were without shooting guard Donovan Mitchell for the seventh straight game because of left knee soreness. They also are missing starting forwards Evan Mobley (left ankle sprain) and Max Strus (right knee strain).\n\n\r\n              “We know we’re capable of winning those type of ballgames, regardless of who we have out there,” LeVert said. “After they threw a punch, I feel like we kept punching back, but they got hot and it was hard to stop them.”\n\n\r\n              Garland scored 21 points in the first quarter and had 25 in the opening half as the Cavaliers carried a 70-63 advantage into the break. Cleveland lost back-to-back home games, falling 120-101 to Brooklyn on Sunday.\n\n\r\n              As a result of missing his 18th game of the season, Mitchell is ineligible for All-NBA consideration. The five-time All-Star is the fifth-leading scorer in the league at 28.0 points per game and ranks third in steals.\n\n\r\n              “I don’t know if the number of games required is the right number,” Vogel said. “To see guys like Donovan and (76ers center Joel) Embiid left out, that does not feel right.”\n\n\r\n              Cavaliers coach J.B. Bickerstaff agreed, saying, “Everyone knows that Donovan Mitchell is an All-NBA player and he’s had an All-NBA season.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Boston on Thursday night.\n\n\r\n              Cavaliers: At New Orleans on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996641.657302
}