{
  "game_id": "0022000055",
  "espn_id": "401267215",
  "date": "Dec 29, 2020",
  "matchup": "SAC vs. DEN",
  "headline": "First-round pick Tyrese Haliburton leads Kings past Nuggets",
  "body": "SACRAMENTO, Calif. -- — Tyrese Haliburton scored eight of his 13 points in the fourth quarter as the Sacramento Kings pulled away to beat Denver 125-115 on Tuesday, spoiling a record-setting night for Nuggets big man Nikola Jokic.\n\n\r\n                    The 12th pick in this year’s draft, Haliburton made several sleek plays and gave the Kings a needed lift down the stretch. Sacramento’s rookie guard hit two of his three 3-pointers in the final 9½ minutes and added a steal and fast-break layup during an 11-0 run that put the Kings ahead 120-108.\n\n\r\n                    “Tyrese continues to impress,” Kings coach Luke Walton said. “He hit some big shots. He had some big-time playmaking for us. He was a plus-20 on the night. He’s one of those players, you feel confident when the ball’s in his hand.”\n\n\r\n                    Haliburton played the entire fourth quarter, when he also had five of his six assists.\n\n\r\n                    “I was just proud of our team being a young team playing against a team like that with experience,” Haliburton said. “We could easily have folded after a bad third quarter like that. We got a little complacent. We thought we were really going to open it up in the second half.”\n\n\r\n                    De’Aaron Fox had 24 points and 10 assists for Sacramento. Richaun Holmes scored 20 and Buddy Hield added 12 points and seven rebounds.\n\n\r\n                    Jokic had 26 points, 12 assists and 11 rebounds to set a Nuggets record with his 44th career triple-double. The NBA leader in assists going into the game, Jokic broke the previous mark he shared with Fat Lever while logging 38 minutes.\n\n\r\n                    As good as Jokic was offensively, he also was charged with 10 of Denver’s 20 turnovers. Essentially, the Denver 7-footer had a quadruple-double.\n\n\r\n                    “Twenty turnovers on the road for 37 points,” Nuggets coach Mike Malone said. “Nikola had 10. Unacceptable. He can’t have 10 turnovers in a game.”\n\n\r\n                    Jokic thought the Nuggets' offense got too stagnant.\n\n\r\n                    “We kind of made ourselves easy to guard,” he said. “Collectively we need to move our bodies better, then move the ball. We helped them a lot, just standing and not moving around.”\n\n\r\n                    Monte Morris had a career-high 24 points starting in place of Jamal Murray for Denver. Michael Porter Jr. finished with 30 points and 10 rebounds.\n\n\r\n                    Murray was held out of the game one day after the Nuggets guard bruised his head when he collided with Jae’Sean Tate of the Rockets in the third quarter. Murray held his hand to his head for a couple of minutes but got up and walked under his own power to the locker room for further examination. He was back on the bench midway through the fourth but did not re-enter. \n\n\r\n                    The Kings beat the Nuggets in Denver on Buddy Hield’s buzzer-beating tip-in in overtime in the season opener for both teams last Wednesday.\n\n\r\n                    QUOTABLE\n\n\r\n                    “I would say good teams don’t beat themselves, but that would be giving (us) a compliment we don’t deserve.” — Malone on the Nuggets.\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Porter had three 3s in the third quarter. … The game marked the 1,000th of Paul Millsap’s 14-year career. Millsap previously played for Utah and Atlanta. … Malone was whistled for a technical in the first quarter moments after Jokic’s dunk put Denver up 18-16. \n\n\r\n                    Kings: Hield has made at least one 3-pointer in 70 consecutive games, the longest active streak in the NBA. … Harrison Barnes dished out a career-high eight assists. … The Kings were charged with a technical after Fox yelled at officials from the bench in the third quarter.\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Host the Suns on New Year’s Day. Denver has won five straight against Phoenix.\n\n\r\n                    Kings: Visit the Rockets for the first of back-to-back games against Houston. The teams play again on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997204.156277
}