{
  "game_id": "0022000525",
  "espn_id": "401267685",
  "date": "Feb 28, 2021",
  "matchup": "MEM @ HOU",
  "headline": "Grizzlies hand Rockets 11th straight loss, 133-84",
  "body": "HOUSTON -- — Justise Winslow scored 20 points and the Memphis Grizzles pounded Houston 133-84 on Sunday night for the Rockets’ 11th straight loss.\n\n\r\n                    In just his fourth game back after missing more than a year because of a hip injury, Winslow — playing in his hometown — had his best scoring night since October 2019.\n\n\r\n                    “I think every day, Justise is feeling more comfortable,” Grizzlies coach Taylor Jenkins said. “He’s making strides every day. He’s healthy, playing hard and putting in the work. I give him a lot of credit for the journey he’s had to undertake to get back on the floor.”\n\n\r\n                    Winslow said he was embraced by Memphis after being traded from Miami last February. \n\n\r\n                    “It gave me life, gave me energy and helped me believe in myself again,” Winslow said. “It just felt like home, it just clicked to me, and I felt like I could truly be myself here.” \n\n\r\n                    Memphis had lost three of four before blowing out the slumping Rockets by 49 points, the largest margin of victory in franchise history. Houston has its longest losing streak since a 15-game skid in November and December 2001. The 84 points are the Rockets’ lowest total since Nov. 8, 2018, in a loss to Oklahoma City.\n\n\r\n                    Houston was 4 of 45 3s on 3-pointers. John Wall and Jae’Sean Tate each had 14 points for the Rockets.\n\n\r\n                    Houston’s field goal percentage of 27.7% was a franchise low. \n\n\r\n                    Rockets coach Stephen Silas was asked whether the loss was rock bottom. \n\n\r\n                    “I hope so,” Silas said. “This was embarrassing.”\n\n\r\n                    Brandon Clarke added 16 points for Memphis, Desmond Bane had 15, De’Anthony Melton 14 and Kyle Anderson and Tyus Jones 13 each.\n\n\r\n                    The Grizzlies led 25-18 lead after the first quarter, then outscored the Rockets 38-19 in the second for a 63-37 lead. After the break, the Grizzlies quickly scored two easy baskets, leading to a timeout by Houston just 54 seconds into the third quarter.\n\n\r\n                    Memphis outscored the Rockets 35-8 on fast-break points and 74-36 on points in the paint.\n\n\r\n                    “Very impressive victory by our group,” Jenkins said. “I give them a lot of credit. I thought our energy was phenomenal on the defensive end.”\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: SG Grayson Allen (concussion protocol) remained sidelined after taking an elbow to the head on Friday night against the Clippers. Bane started in Allen’s place, scoring 11 points in 23 minutes. . C Killian Tillie made his NBA debut and made down a late 3-pointer to loud cheers from the Memphis bench.\n\n\r\n                    Rockets: Center Justin Patton made his first career start. He had 10 points and five rebounds in 26 minutes and was the Rockets’ only starter to make a 3-pointer.\n\n\r\n                    BENCH SCORING\n\n\r\n                    Memphis’ reserves scored 85 points, which represented a franchise record, Jenkins said after the game. All eight bench players -- and all five starters -- scored in the game for the Grizzlies. Winslow’s 20 led bench scoring, following by 16 from Clarke, 14 from Melton, 13 from Jones and 12 from Dieng. \n\n\r\n                    BLACK HISTORY NIGHT\n\n\r\n                    The Rockets celebrated Black History Night at Toyota Center, which featured a performance of “Lift Every Voice and Sing” by the Houston Gospel Choir, video montages of key Black history moments in Houston, and the “First Shot” was performed by Kenneth Huewitt, Interim President of Texas Southern University. \n\n\r\n                    HE SAID IT\n\n\r\n                    “The missing of shots is really plaguing us this season. To go 4 for 45 from 3, there’s not a word for it.” — Rockets coach Stephen Silas\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: At Washington on Tuesday night. \n\n\r\n                    Rockets: Hosts Cleveland on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764996960.4270048
}