{
  "game_id": "0022300625",
  "espn_id": "401585253",
  "date": "Jan 24, 2024",
  "matchup": "PHX @ DAL",
  "headline": "Devin Booker scores 46 as Suns beat Mavs 132-109 for 7th consecutive win",
  "body": "DALLAS -- — Devin Booker has seen some chippy games between his Phoenix Suns and Luka Doncic's Dallas Mavericks.\n\n\r\n              Even with new faces, the taunts and trash talk are plentiful.\n\n\r\n              Booker scored 22 of his 46 points in a decisive third quarter and the Suns matched their longest winning streak of the season at seven with a 132-109 victory over the Mavericks on Wednesday night.\n\n\r\n              A triple-technical early was the first of seven such fouls in a matchup of teams that played an emotional seven-game playoff series won by the Mavs almost two years ago.\n\n\r\n              And yet, six of the seven techs came from players who weren't around then — Doncic being the exception.\n\n\r\n              “I just think when teams have a recent playoff series against each other, that just heightens the atmosphere and heightens everything,” Booker said. “The media does a good job of continuing it because they know it gets traction, which is good for the game, it’s good for viewership. I have no personal problem with anybody from Dallas, no fans or anything.”\n\n\r\n              Kevin Durant, still fairly new to the Dallas-Phoenix dynamic, had 12 points and 10 rebounds as the Suns opened a seven-game road trip, their longest this season, by turning a 16-point deficit in the second quarter into a 22-point lead after outscoring Dallas 43-20 in the third.\n\n\r\n              Kyrie Irving was out for the Mavericks, who have lost four of five, after spraining his right thumb early in a loss to Boston two nights earlier. It was the 22nd time in 44 games Dallas has played without one or both of its stars.\n\n\r\n              Doncic had 34 points, eight rebounds and nine assists without his All-Star sidekick, but didn’t have much help while the Suns got 20 points from Bradley Beal and 15 from Grayson Allen.\n\n\r\n              “I think we played very physical the first 17-18 minutes,” Doncic said. “But then our physicality went down and that’s when we struggled. We’ve got to be physical the whole game.”\n\n\r\n              Phoenix's scoring surge to start the second half began with a free throw from Booker for a 58-all tie after Doncic was assessed a technical for complaining to officials on his way to the locker room after the first-half buzzer.\n\n\r\n              The early triple-technical set into motion another chippy meeting when Grant Williams bumped Durant and stood over him after being called for the foul. Jusuf Nurkic shoved Williams, who went after the Phoenix center. All three players were given technicals.\n\n\r\n              In the third quarter, Nurkic said something to set off Williams again after they made contact, and the Dallas forward was given a second technical and ejected after complaining to an official about Nurkic.\n\n\r\n              Crew chief David Guthrie said Williams got his second technical for overtly yelling and gesturing while using profanity.\n\n\r\n              Nurkic got an unsportsmanlike technical, which doesn't count toward an ejection, when he was called for a flop after Dallas challenged a foul call against Dereck Lively II in the second quarter. The foul was erased and the flop assessed. \n\n\r\n              “Maybe ask him, honestly. I'm new to the whole Dallas rivalry thing,” Beal said, pointing at Booker as the star guard joined the postgame meeting with reporters. “That’s a playoff-type atmosphere, playoff-type teams. They’re just competing at a high level, and it’s going to get chippy. We did a good job of not letting it get us rattled.”\n\n\r\n              Doncic also was responsible for the ejection of a fan when he overheard a Suns supporter yell to Doncic that he was tired and needed to get on a treadmill. With the game still going, Doncic immediately turned and pointed in the direction of the fan. The fan was ejected a few minutes later.\n\n\r\n              Doncic's motion to get the fan ejected came while Booker was going 9 of 11 from the field in his dominant third quarter.\n\n\r\n              The Suns trailed 51-35 midway through the second, but Booker gave them their first 20-point lead on a driving layup with 4 1/2 minutes left in the third.\n\n\r\n              “I think it’s a trend here. Unfortunate,” Dallas coach Jason Kidd said of his players getting caught up in the officiating. “The referees are the referees. They’re going to make calls, good or bad, just the nature of the league. But we can’t get calls every time down.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Indiana on Friday.\n\n\r\n              Mavericks: At Atlanta on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996656.650979
}