{
  "game_id": "0022300562",
  "espn_id": "401585190",
  "date": "Jan 15, 2024",
  "matchup": "MIA @ BKN",
  "headline": "Butler scores 31 points in return, including two late free throws in OT as Heat beat Nets 96-95",
  "body": "NEW YORK -- — Jimmy Butler returned after missing seven games with a sprained toe and scored 31 points, including two free throws with 11.8 seconds left in overtime to help the Miami Heat beat the Brooklyn Nets 96-95 on Monday night.\n\n\r\n              “I’m just glad we won,” Butler said. “I think I did enough running and conditioning to be able to come back and play 40 (minutes). Whatever was needed, we got to do.”\n\n\r\n              Tyler Herro had 29 points and 11 rebounds, and Bam Adebayo added 11 points and 20 rebounds in Miami’s third straight win.\n\n\r\n              “I think this is good for us,” Heat coach Erik Spoelstra said. “This is what I wanted, to see if we could win some games with different solutions when we weren’t necessarily making shots, where it potentially could be a little bit ugly, and then you just figure out how to win at the end.”\n\n\r\n              Mikal Bridges scored 26 points, and Cam Thomas added 23 for Brooklyn. The Nets lost their third straight and eight of the last nine games.\n\n\r\n              “We’re just in a position right now where you have to perform, and that’s across the board,” Nets coach Jacque Vaughn said. “That’s a challenge to the entire group from the beginning of the game to the end to be locked in and give everything you have on both ends of the floor.” \n\n\r\n              After scoring a season-low 31 first-half points, the Heat came out strong after the break, led by Herro and Butler. Herro had 23 points in the second half and overtime, and Butler scored 21 in that span, helping Miami outscore Brooklyn 57-43 over the third and fourth quarters.\n\n\r\n              “The first half wasn’t pretty at all,” Herro said. “They were junking up the game when they were on defense, switching on everything and mucking everything up, and it was a slow pace. I was just trying to find gaps in the defense where I could be aggressive.”\n\n\r\n              Miami turned up the heat on Brooklyn, holding it to 30.9% shooting in the second half. Bridges forced overtime with two free throws with 4.4 seconds left and Brooklyn scored the first five points of OT, before Miami closed the game with an 8-2 run and stopped Bridges’ fall-away jumper in the closing seconds.\n\n\r\n              “That’s three straight games where we held our opponent under 100 (points),” Spoelstra said. “That’s progress, and there’s been a lot of moving parts, but I appreciate the group for not making any excuses about it.”\n\n\r\n              The Nets had lost 12 of their previous 15 entering play Monday and had allowed 120.3 points per game in that span. Yet, Brooklyn turned up the defense in the first half against the Heat, holding them to 26.2% shooting from the field in the first half, its lowest field-goal percentage against in a half since April 2022.\n\n\r\n              Led by Thomas’ 12 points off the bench, and Bridges’ 11 points and seven rebounds, the Nets led 45-31 at halftime.\n\n\r\n              “I don’t think a 14-point deficit feels good to anybody in this league,” Butler said. “But if we keep taking the right shots, eventually they’re going to go in. But the main thing is we have to start guarding somebody, and then good things happen.”\n\n\r\n              UP NEXT\n\n\r\n              Heat: At Toronto on Wednesday night.\n\n\r\n              Nets: At Portland on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com.hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995365.039264
}