{
  "game_id": "0022000930",
  "espn_id": "401307733",
  "date": "Apr 27, 2021",
  "matchup": "TOR vs. BKN",
  "headline": "Durant, Nets rally past Raptors 116-103, clinch playoff spot",
  "body": "TAMPA, FLA. -- — Kevin Durant scored seven of his 17 points in the fourth quarter, Jeff Green had 22 points and the Brooklyn Nets clinched a playoff spot Tuesday night by rallying late to beat the Toronto Raptors 116-103.\n\n\r\n                    Trailing 90-84 early in the fourth period, Brooklyn used a game-turning 16-2 run to grab control. Later, Durant hit a 3-pointer with 1:47 remaining and glared at the Toronto bench after putting his team up 111-101. \n\n\r\n                    Durant, who was playing his second game after returning from a thigh injury, added 10 rebounds in 33 minutes for his eighth double-double.\n\n\r\n                    “Just all of the adversity that we’ve fought through this year with injuries, protocols, trade situations and guys being in and out of the lineup, I’m very proud of everybody in the organization top to bottom,” Durant said.\n\n\r\n                    Kyrie Irving finished with nine points, six rebounds and four assists. Seven other Nets scored in double figures on the night Brooklyn became the first Eastern Conference team to lock up a playoff spot.\n\n\r\n                    “Tonight was a night where our connectivity really showed because Toronto put us under duress. When things weren’t going our way we could have started to splinter, but our guys stuck with it,” said Brooklyn coach Steve Nash, whose Nets made 13 of 19 shots in the fourth quarter. \n\n\r\n                    The Nets won for a third straight time and the fourth time in five games to prevent Toronto from pulling off the season sweep. The Raptors, who were led by Kyle Lowry’s 24 points, had their five-game home winning streak end. One of those victories was a 114-103 defeat of Brooklyn last week.\n\n\r\n                    On Tuesday, Toronto got outscored 31-24 in the fourth quarter after making just 7 of 21 shots. \n\n\r\n                    “I don’t think 116 is an outlandish number for that (Brooklyn) team, but we’ve just got to score a little bit more,” Toronto coach Nick Nurse said. “The opportunities were there.” \n\n\r\n                    Newly signed guard Mike James scored all of his 11 points in the fourth quarter as the Nets rallied from an 83-80 deficit to start the final period. Blake Griffin shot 6 of 11 and scored 17 points off the bench. \n\n\r\n                    “It seemed like there was a lot of back and forth for the majority of the game, but we were able to wear them down by the end of the game,” said Joe Harris, who had 16 points.\n\n\r\n                    It was just the 19th time all season that Durant has been on the floor with Irving because of injuries. The Nets are 12-7 in those games. \n\n\r\n                    Toronto was in action less than 24 hours after beating Cleveland 112-96 in Tampa on Monday. Back-to-back sets of games have been a problem all season for the Raptors, who are 2-12 on the second night of consecutive games.\n\n\r\n                    NO TIME TOGETHER\n\n\r\n                    Nash said he’s come to grips with the Nets not having James Harden, Durant and Irving on the floor together prior to the playoffs, if even then. Remarkably, Brooklyn’s trio of superstars have played just seven games together all season because of injuries and COVID protocols.\n\n\r\n                    “We recognize now that we’re not going to have the luxury of a run of games with everyone available, and we may not have that to start the playoffs,” Nash said. “It’s been like an avalanche of relentless injuries, games and travel and it’s just part of the challenge for this team.”\n\n\r\n                    Harden, who has been out April 5, is back with the team and Nash said the guard went through light drills on Tuesday. “He’s not doing any high-intensity stuff, but he’s shooting and doing all the strength and rehabilitation work. Positive signs, but still a ways to go.” \n\n\r\n                    TIP INS\n\n\r\n                    Nets: Brooklyn started a stretch of playing seven of the next eight on the road. \n\n\r\n                    Raptors: Toronto was once again without Chris Boucher, Gary Trent, Paul Watson and Jalen Harris. … Lowry made his first three 3s and 5 of his first 7 after missing 13 of 14 attempts in his previous two games. \n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Play at Indiana on Thursday night.\n\n\r\n                    Raptors: Play at Denver on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764997268.156121
}