{
  "game_id": "0022300687",
  "espn_id": "401585315",
  "date": "Feb 01, 2024",
  "matchup": "MEM vs. CLE",
  "headline": "Donovan Mitchell has 25 points, Cavaliers beat Grizzlies 108-101 for 4th straight victory",
  "body": "MEMPHIS, Tenn. -- — Donovan Mitchell had 25 points and seven assists and the Cleveland Cavaliers beat the Memphis Grizzlies 108-101 on Thursday night for their fourth straight victory and 12th in 13 games.\n\n\r\n              Caris LeVert added 16 points in a reserve role, Jarrett Allen finished with 14 points and nine rebounds, and Max Strus had 11 points and 10 rebounds.\n\n\r\n              Allen left three minutes into the third quarter because of injured left ankle, He did not return, and Cavaliers coach J.B. Bickerstaff said after the game that he did not have any update on the center. The injury stopped Allen's streak of consecutive double-doubles at a franchise-record 16.\n\n\r\n              Darius Garland scored nine points and added seven assists in his second game since returning from a fractured jaw that sidelined him for 19 games. He had 19 points Wednesday night in a home victory over Detroit.\n\n\r\n              Power forward Evan Mobley sat out for Cleveland, with the Cavaliers are watching his minutes after he returned this week from knee surgery.\n\n\r\n              The Cavaliers were in a hard-fought battle with Memphis, and the Grizzlies were within one possession in the latter stages of the fourth. Cleveland outscored Memphis 10-4 in the closing three minutes.\n\n\r\n              The Cavaliers benefitted from a stronger defensive performance in the second half, holding Memphis to 22 points in the third and 21 points in the fourth. Playing the second half of a back-to-back caused Cleveland to come out a big flat in the first half.\n\n\r\n              “I thought our guys did a good job just showing resolve,” Bickerstaff said. “Obviously, we were much better in the second half. Our defense is what makes us.”\n\n\r\n              Mitchell, selected Thursday as an All-Star reserve for the Eastern Conference, said the Cavaliers “made some mistakes early,” adding that “you could tell we were on the second half of a back-to-back.”\n\n\r\n              Jaren Jackson Jr. led the Grizzlies with 25 points. Santi Aldama had 18 points and nine rebounds, and Vince Williams Jr. scored 17 points.\n\n\r\n              Cleveland took an 81-80 lead into the fourth after making 4 of 8 3-pointers and shooting 61% in the third quarter.\n\n\r\n              But Cleveland couldn't create enough distance to get comfortable, and Memphis was within two — 101-99 with 2:12 remaining. But LeVert scored on a dunk and Strus made a 3-pointer with 1:16 left to push it to 106-99. \n\n\r\n              The fourth quarter marked another game where Memphis could have made a closing run, but was unable to put together enough stops to stay with the opponent. Whether it is because injuries have decimated the Memphis starters or just the trend of recent games, Jackson said they need to tighten things.\n\n\r\n              “I think it is just a coincidence,” Jackson said of the lack of scoring down the stretch. \"A lot of (opponents') stars and great players get going late. We've got to make sure we take care of their tendencies. And he added: “It's definitely tough when you are up late” and let the game slip away.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At San Antonio on Saturday night.\n\n\r\n              Grizzlies: Host Golden State on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996014.7960289
}