{
  "game_id": "0022000094",
  "espn_id": "401267254",
  "date": "Jan 04, 2021",
  "matchup": "CHA @ PHI",
  "headline": "Embiid's double-double leads 76ers past Hornets 118-101",
  "body": "PHILADELPHIA -- — Joel Embiid wore a sweatshirt with “The Process” emblazoned on the front, his nickname that’s a nod to the path the 76ers took from a forlorn franchise to one that has the best record in the NBA.\n\n\r\n                    And just maybe, the best player, too.\n\n\r\n                    Embiid had 14 points and 11 rebounds, Tobias Harris scored 22 points and Philadelphia beat the Charlotte Hornets 118-101 on Monday night for their fourth straight win.\n\n\r\n                    “The main thing we have is Joel,” coach Doc Rivers said. “Joel sets the table for us.”\n\n\r\n                    The Sixers swept the two-game set necessitated on the schedule this season because of the pandemic and beat the Hornets for the 13th straight time. Philadelphia has not lost to Charlotte since Nov. 2, 2016. \n\n\r\n                    Embiid has been the biggest reason the Sixers are off to a 6-1 start in Rivers’ first season. Perhaps motivated by the birth of his son, reinvigorated under a new coaching staff or both, the 26-year-old has seemingly harnessed his talent and developed into a workload-heavy force on both sides off the ball.\n\n\r\n                    Gone are the days when Embiid’s minutes were limited because of injuries — Sixers fans still cringe at “load management” — and he needed to sit out just one game of a back-to-back set to rest up. Embiid entered Monday night averaging 33.4 minutes (and 25.0 points), the most on the Sixers.\n\n\r\n                    “He can handle it,” Rivers said. “I think he played the other night almost 37, I didn’t like that, but that’s going to happen. You go through the year and it evens out, that 34, 33. I don’t really have a minutes barometer, I just know where I’d like to keep it.”\n\n\r\n                    Embiid added a personal chef, nutritionist, physical therapist and massage therapist — making $29.5 million this season, he can afford the staff — to help turn those flashes of greatness into a sustained MVP campaign.\n\n\r\n                    “Everything I’ve been doing, I guess has been working,” Embiid said. “I’m glad to have the support I put in place. I’ve got to keep on doing it. We’ve got to keep on doing it.′\n\n\r\n                    Want rim protection? Embiid can do it. Gordon Hayward learned on a drive late in the third when he saw Embiid’s outstretched arm and tossed a wild shot high above the rectangle. Embiid grabbed one of his 10 defensive boards.\n\n\r\n                    Also in the third, Embiid ran straight into a double team out on the wing. He didn’t force his way into making a play that wasn’t there — he kicked it to Seth Curry for a wide open 3 and a 61-45 lead. \n\n\r\n                    “Any time they come from any angle, we’re putting guys in spots where Joel can see them and make easy decisions,” Rivers said. “All great players are going to get trapped. I have this attitude, if you trap us, we will score. You can feel the guys believing it.”\n\n\r\n                    Embiid even hit a little fadeaway in the third as the Sixers turned this one into a rout and he got his rest at just 25 minutes\n\n\r\n                    Ben Simmons was steady with 12 points and 10 rebounds, and Danny Green hit three 3s for 13 points.\n\n\r\n                    Hayward had 18 points and struggling Devonte’ Graham added 15 for the Hornets, who also lost Saturday in Philly 127-112.\n\n\r\n                    “We couldn’t score tonight,” Hornets coach James Borrego said. “We couldn’t find the bucket and it bled over into our transition defense. Until we figure out the offense and find guys that can score and put the ball in the hole, we’re going to have to play defense consistently.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: C Cody Zeller still hasn’t been cleared to use his left hand in shooting drills after breaking his ring finger in the season opener. The Hornets hope Zeller can return in early February.\n\n\r\n                    76ers: Harris was named Eastern Conference player of the week, averaging 23.3 points, 9.7 rebounds and 4.0 assists over three games. ... Team owner Josh Harris sat courtside and chatted with decision makers Daryl Morey and Elton Brand.\n\n\r\n                    FINE MESS\n\n\r\n                    The NBA adopted a tougher policy regarding masks on Monday. Rivers, who frequently pulled his down to communicate with players and officials, said he was fined $10,000 by the league this season for violating policy.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Play Wednesday at Atlanta\n\n\r\n                    76ers: Host the Wizards on Tuesday in a rematch of the 76ers’ 113-107 opening-night victory.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997049.688106
}