{
  "game_id": "0022000057",
  "espn_id": "401267217",
  "date": "Dec 30, 2020",
  "matchup": "ATL @ BKN",
  "headline": "Irving gets hot in fourth as Nets outscore Hawks 145-141",
  "body": "NEW YORK -- — In a game that was almost all about offense, Kyrie Irving just couldn't get into the act.\n\n\r\n                    Then in the fourth quarter, he shot the Hawks down from the unbeaten list.\n\n\r\n                    Irving shook off three rough quarters to score 17 of his 25 points in the fourth, Kevin Durant had 33 points, 11 rebounds and eight assists, and the Brooklyn Nets handed Atlanta its first loss with a 145-141 victory on Wednesday night.\n\n\r\n                    The opener of a two-game series was the third game in Nets franchise history where both teams had 100 points through three quarters. But Irving was just 3 for 16 from the field and getting badly outplayed by point guard counterpart Trae Young.\n\n\r\n                    Then he made three 3-pointers in the final period after missing all seven through three as the Nets rallied to win after dropping two straight following their 2-0 start. Irving and Durant combined for Brooklyn's final 20 points over the final 5 1/2 minutes of a game that left everyone spent.\n\n\r\n                    “Yeah, I definitely need a beer,” Nets coach Steve Nash said.\n\n\r\n                    Young had 30 points, 11 assists and six rebounds, and John Collins had 30 points and 10 rebounds. But it wasn't enough for the Hawks, who had won their first three for the first time since 2016.\n\n\r\n                    The Hawks were down one after Collins made two free throws with 45 seconds left, but Irving knocked down a jumper, then found Durant for a dunk that made it 141-136 with 15 seconds to go.\n\n\r\n                    “This is what finishing is about, execution on both sides of the basketball,” Hawks coach Lloyd Pierce said.\n\n\r\n                    Bogdan Bogdanovic made six 3-pointers and scored 22 points and Cam Reddish had 20 for the Hawks, who led for most of the first three quarters but never by too much because the Nets — except Irving — were just as hot. \n\n\r\n                    Atlanta, which came into the game second in the league with 124.7 points per game, had 68 by halftime, when Irving was 1 for 10, but only led by one.\n\n\r\n                    “The good thing about that is even though we didn’t shoot the ball well, us two, we were still only down one point,” Durant said of he and Irving. \n\n\r\n                    Brooklyn put seven players in double figures, with Joe Harris adding 23 points.\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Danilo Gallinari, who missed the last two games with a bruised left foot, came off the bench in this one but played only five minutes before leaving with a sprained right ankle. ... Pierce wasn't sure how the Hawks planned to spend New Year's Eve in New York. “We’re definitely not going anywhere. But depending on what’s allowed, we’ll have a team dinner, maybe some champagne or something in the hotel, but it won’t be anything extensive,” he said. “We’re in New York, it’s a business trip, middle of a pandemic, I think we’ll be smart and do what we continually need to do.” \n\n\r\n                    Nets: Timothe Luwawu-Cabarrot started in place of the injured Spencer Dinwiddie and had three points. He made his first start Monday against Memphis and scored 21 points. ... Nash said F/C Nicolas Claxton, sidelined by a right knee injury, is improving, but he thought still weeks away from being ready to return.\n\n\r\n                    TEAMMATES TOGETHER\n\n\r\n                    Nash hosted Pierce on his college visit to Santa Clara, where they played together for two years and become close friends. Pierce said some of their teammates had a group text going in advance of the game and noted the slim odds of two guys from a mid-major college coaching in the NBA against each other. Nash said he was proud of all Pierce's accomplishments, praising his work on voting and civil rights initiatives in Georgia. “He’s inspired me and to get a chance to coach against him is really special,” Nash said. \n\n\r\n                    UP NEXT\n\n\r\n                    The teams play again Friday at Barclays Center.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997645.9535239
}