{
  "game_id": "0022000255",
  "espn_id": "401307863",
  "date": "May 13, 2021",
  "matchup": "MEM vs. SAC",
  "headline": "Brooks scores 30 as Grizzlies overcome Kings 116-110",
  "body": "MEMPHIS, Tenn. -- — Dillon Brooks scored 30 points and the Memphis Grizzlies used a late rally to defeat the Sacramento Kings 116-110 on Thursday night in the first of a back-to-back between the teams.\n\n\r\n                    Jonas Valanciunas had 24 points and 13 rebounds for Memphis, Kyle Anderson added 14 points hitting 5 of 6 shots, including three 3-pointers. Ja Morant had 12 points, seven rebounds and eight assists.\n\n\r\n                    The Grizzlies' win sets the stage for a Sunday showdown with Golden State for the eighth seed in the Western Conference. The teams split two games in Memphis earlier this season and have identical 37-33 records after Thursday’s games. Even if the Warriors enter the game with a one-game lead, a win by Memphis on Sunday would give the Grizzlies the tiebreaker.\n\n\r\n                    Justin James scored a career-high 31 points to lead the Kings, who were eliminated from contention for the play-in tournament. \n\n\r\n                    “I would be lying if I said this doesn’t feel different than any other loss,” James said. “Knowing we are out of the playoffs. It (stinks) for fans. It (stinks) for our city, but we will be there one day.”\n\n\r\n                    Chimezie Metu had 17 points and was key along with James to helping the Kings, who had won six of their previous seven, build a fourth-quarter lead. Buddy Hield and Terence Davis scored 16 points each, and Delon Wright had 15 points and eight assists.\n\n\r\n                    The Kings were without four of their top six scorers, but still increased the lead to eight in the fourth quarter behind James and Metu. Sacramento still led by six with 3:39 remaining after a 3-pointer from Metu.\n\n\r\n                    But Anderson answered with five straight points to bring Memphis within a point at 110-109. Valanciunas then converted a three-point play to give Memphis the lead for good — 112-110 — with 1:23 left.\n\n\r\n                    “Fortunately, we were able to get some stops at the right time, and they missed a couple of shots late,” Memphis coach Taylor Jenkins said, adding: “It was kind of one of those products where you’ve got to play the full 48 minutes.”\n\n\r\n                    Both teams shot well to open the game and the Kings benefitted from hitting seven of 11 3-pointers in the first quarter. Sacramento made 10 of 19 from 3-point range in the half.\n\n\r\n                    James had 16 in the half for the Kings, who led 60-59 at the break.\n\n\r\n                    Memphis’ half was lackluster coupled with bad ballhandling leading to 10 turnovers. \n\n\r\n                    Memphis built a slight buffer by outscoring the Kings 30-23 in the third quarter to carry an 89-83 lead into the fourth.\n\n\r\n                    “They scrapped. They fought. They competed and it was fun. It was a fun game,” Kings coach Luke Walton said of his team. “Unfortunately, we made a few too many mistakes down the stretch. They made us pay. ... Really proud of the guys. There was great energy. Great fight.”\n\n\r\n                    While the Kings and Grizzlies will play the second half of the back-to-back on Friday, the stage is set for Memphis’ game Sunday with Golden State.\n\n\r\n                    “We’ve got to leave it all out there,” Brooks said. “Let it hang out. Get your rest and be ready. ... Come ready with the energy and the enthusiasm to win a basketball game. That’s all we can ask.”\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Continued to play without key contributors such as G De’Aaron Fox (health and safety protocol), F Harrison Barnes (left abductor tightness), Marvin Bagley (right groin tightness) and rookie G Tyrese Haliburton (left knee hyperextension). ... Richaun Holmes left in the second quarter with right knee soreness and did not return. ... James’ previous career high in points was 16 against Utah on April 28.\n\n\r\n                    Grizzlies: The win guaranteed Memphis its first winning record for a season since 2016-17. ... Valanciunas recorded his 48th double-double this season and passed Shane Battier for 11th on the franchise list for defensive rebounds. Battier had 1,236. ... G Grayson Allen missed his fifth straight game with left abdominal soreness. ... Jaren Jackson Jr. and Brandon Clarke had 12 points each, with Clarke shooting 5 of 7.\n\n\r\n                    LAST WORD\n\n\r\n                    “Thirty-one would definitely be better with a win. I really can’t brag about me having (31 points) and we lost. A win always helps everything.\" — Kings guard Justin James, who was 12 of 17 form the field — including 4 of 5 from 3-point range.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764996910.1984022
}