{
  "game_id": "0022200911",
  "espn_id": "401469066",
  "date": "Feb 26, 2023",
  "matchup": "ATL vs. BKN",
  "headline": "Young's buzzer-beating jumper lifts Hawks past Nets 129-127",
  "body": "ATLANTA -- — Waiting for just the right moment to launch his game-winning shot was no problem for Trae Young. He says he has been envisioning similar shots since he was a kid.\n\n\r\n              Young waited patiently for Mikal Bridges to fly past him before sinking a buzzer-beating jumper over the reach of Spencer Dinwiddie to lift Atlanta to a 129-127 win over the Brooklyn Nets on Sunday, a few hours before the Hawks announced they hired Quin Snyder as their coach.\n\n\r\n              The Hawks took their final possession with 7.3 seconds remaining after Cam Johnson's 3-pointer tied the game at 127 with 7.8 seconds remaining. Young hit his pull-up 12-foot jumper as Dinwiddie tried in vain to block the shot from behind.\n\n\r\n              “I’ve been counting down those seconds since I was 5 years old, 6 years old,” Young said. “That’s nothing new.” \n\n\r\n              Young finished with 34 points for the Hawks, who recovered after blowing an 18-point lead to overcome four Nets scorers with at least 20 points.\n\n\r\n              Atlanta, No. 8 in the East, won its second consecutive game under interim coach Joe Prunty after Nate McMillan was fired Tuesday. General manager Landry Fields announced Sunday night Snyder had been hired to replace McMillan. The team scheduled a news conference for Monday to introduce Snyder. \n\n\r\n              Johnson had 27 points for Brooklyn. Mikal Bridges scored 24 for the Nets, who have lost four of five. Cam Thomas added 22 points and Dinwiddie had 20.\n\n\r\n              The Nets began the day fifth in the Eastern Conference, only a half-game ahead of the New York Knicks. Coach Jacque Vaughn is trying to find a new winning mix after the team traded Kevin Durant and Kyrie Irving.\n\n\r\n              “You can't feel sorry for yourself,” Vaughn said. “What we have to do is continue to stay together and believe we can get it done.”\n\n\r\n              Dorian Finney-Smith's 3 for Brooklyn with 48 seconds remaining cut Atlanta's lead to 127-124.\n\n\r\n              Both wins under Prunty have come against teams above the Hawks in the conference.\n\n\r\n              “It’s great,” said Dejounte Murray, who scored 28 points. “Like I continue to tell the players, we have no control over what the front office does. We’re going to continue to work and try to build as many wins as we can.”\n\n\r\n              Bogdan Bogdanovic added 22 for Atlanta. Bogdanovic's three 3-pointers early in the second quarter helped Atlanta take a 50-32 lead. Thomas had 11 points in the period, helping the Nets trim the Hawks' lead to 64-57 at halftime.\n\n\r\n              Brooklyn kept its momentum to open the second half, taking a 78-73 lead. Onyeka Okongwu scored the final four points of the third period as Atlanta took a 97-94 advantage into the final period.\n\n\r\n              “We would not give up in the second half even though we were down by double digits,” Vaughn said.\n\n\r\n              STICKING WITH THE STARTERS\n\n\r\n              Vaughn stuck with his starters after the first five combined for only 34 points as the team set a season scoring low in an ugly 131-87 loss at Chicago on Friday night. \n\n\r\n              Before the game, Vaughn said he's looking for consistency and a balance of offense and defense. He said Finney-Smith, who had only two points against the Bulls, is “one of our best defenders we have on the team.”\n\n\r\n              “It’s pretty tough to take him out of the lineup when there’s other offensive guys he’s covering sins up for,” Vaughn said of Finney-Smith.\n\n\r\n              TALKING ABOUT PRACTICE\n\n\r\n              When asked how many practices he has had with the team since the All-Star break, Vaughn referred to the blowout loss to the Bulls as “a scrimmage with referees.”\n\n\r\n              TIP-INS\n\n\r\n              Nets: C Nic Claxton, from the University of Georgia, had four steals, three blocked shots and 11 rebounds. ... G Ben Simmons (left knee soreness) missed his second consecutive game.\n\n\r\n              Hawks: F John Collins returned with 12 points after missing one game while on concussion protocol. Collins was questionable with lower back tightness and cleared to start after pregame warmups, but his minutes were restricted. Collins logged almost 26 minutes, which Prunty acknowledged was more than planned.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Milwaukee on Tuesday night.\n\n\r\n              Hawks: Host Washington on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994818.073931
}