{
  "game_id": "0021500337",
  "espn_id": "400828224",
  "date": "Dec 11, 2015",
  "matchup": "MIL @ TOR",
  "headline": "DeRozan has 27 points, Raptors hold off Bucks 90-83",
  "body": "TORONTO --  DeMar DeRozan's review of Toronto's win wasn't all that upbeat.\n\nAfter scoring a game-high 27 points in the Raptors' 90-83 victory over Milwaukee on Friday night, DeRozan said his team's failure to put the Bucks away nearly cost them.\n\n\"A couple mental mistakes, a couple of turnovers let them get going a little bit offensively,\" DeRozan said after the Raptors' 19-point lead midway through the third quarter shrunk to four with 5 minutes to go.\n\n\"But we didn't panic. We knew they weren't going to give up, they were going to fight throughout the game,\" he added. \"They're a hungry team, you've got to give them credit, but we did what we had to do to pull out the win.\"\n\nAfter Milwaukee's Giannis Antetokounmpo capped an eight-point run with a bucket with 5:11 to go to cut the score to 81-77, the Raptors scored the next five points, including a 3-pointer from Cory Joseph, to stretch the lead back up to nine on their way to winning their third straight.\n\nThe Bucks trimmed it back to five points with 1:24 left, but Toronto guard Kyle Lowry punctuated the victory with a driving layup in traffic with 24 seconds to go.\n\n\"They made their run. I thought we withstood it,\" Toronto coach Dwane Casey said. \"In no way, shape, fashion or form did I think it was going to be a 20-point game.\n\n\"We lost our focus a little bit. (But) I thought we responded with some positive plays down the stretch.\"\n\nJoseph had 13 points, Luis Scola had 12 points and eight rebounds and Lowry added 12 points and seven rebounds. Bismack Biyombo added a game-high nine rebounds to go along with his four points.\n\nKhris Middleton had 26 points for the Bucks, who lost their second straight. Antetokounmpo added 15 points and seven rebounds.\n\n\"We have to play a complete game,\" Middleton said. \"We can't take quarters, minutes, plays off.\n\n\"Our margin of error is very small right now, so we can't have any lapses. If we just play like we're down the whole game, I think we'd be in a different position right now.\"\n\nThe Bucks jumped to a 13-4 lead 4:40 into the game before Toronto stretched a seven-point lead after one quarter into an 18-point advantage at halftime and 19 with 5:22 to go in the third.\n\n\"We were fighting to the end of the game and they came back even better,\" Antetokounmpo said. \"We've just got to learn from our mistakes today and look forward.\"\n\nMilwaukee coach Jason Kidd credited his team's defensive intensity in the second half with getting them back into the game.\n\n\"That just shows that if we keep fighting we can find a way to get back in games,\" Kidd said.\n\nThe Bucks fell to 2-9 on the road this season while the Raptors improved to 7-4 at home.\n\nTIP-INS\n\nBucks: Milwaukee has now lost nine straight road games. ... Greg Monroe had his streak of four straight double-doubles stopped, finishing the night with 13 points and seven rebounds.\n\nRaptors: Toronto won its third straight home game for the first time all season. ... Friday marked the Raptors' 50th consecutive sellout at Air Canada Centre, including playoffs, dating back to Nov. 9, 2014.\n\nA FEW BUCKS SHORT\n\nMilwaukee is 1-12 when they score fewer than 100 points and 0-7 when they fail to reach 90 points.\n\nTOP BUCK\n\nMiddleton had 20-plus points for the fourth time this season.\n\nQUOTABLE\n\n\"I think he's just letting the game really come to him. He's staying aggressive and he's taking shots that are less difficult. He's just playing great basketball,\" Lowry said of DeRozan.\n\nUP NEXT\n\nBucks host the Golden State Warriors on Saturday night.\n\nRaptors wrap-up a six-game home stand Sunday night against the Philadelphia 76ers.",
  "source": "espn_api",
  "crawled_at": 1764994079.927495
}