{
  "game_id": "0022301207",
  "espn_id": "401616461",
  "date": "Dec 06, 2023",
  "matchup": "MIA @ TOR",
  "headline": "Martin has season-high 24 points and career-high 12 rebounds as Heat beat Raptors 112-103",
  "body": "TORONTO -- — Caleb Martin had a season-high 24 points and a career-best 12 rebounds, Duncan Robinson scored 10 of his 21 points in the fourth quarter and the Miami Heat beat the Toronto Raptors 112-103 on Wednesday night.\n\n\r\n              Jimmy Butler scored 19 points, Orlando Robinson had 15 points and a career-high 12 rebounds, and Jaime Jaquez Jr. added 15 points as the Heat won for the second time in six games.\n\n\r\n              After giving up 66 points in the first half, the Heat allowed 37 points in the final two quarters.\n\n\r\n              “I thought we had a good approach to that second half,” Duncan Robinson said. “We were able to get stops and then get out and go.”\n\n\r\n              Martin scored 15 points in the first quarter and had 23 at the half, eclipsing his previous season-high of 22.\n\n\r\n              “You can see why he is always one of our biggest X-factors, because he brings a lot of things you can’t necessarily schema against,” Heat coach Erik Spoelstra said.\n\n\r\n              Pascal Siakam scored 30 points for the fourth time this season and OG Anunoby had 23 for the Raptors, who had won the previous three meetings with Miami. \n\n\r\n              “Our discipline was not where it needs to be tonight on the offensive end,” Raptors coach Darko Rajakovic said. \n\n\r\n              Siakam went 11 for 11 at the free throw line but Toronto lost for the first time this season when the two-time All-Star scores 30 or more. \n\n\r\n              Gary Trent Jr. had 15 points for Toronto and Scottie Barnes had 12 points and 11 rebounds.\n\n\r\n              Barnes shot 5 for 17 while Toronto guard Dennis Schroder finished 4 for 18.\n\n\r\n              “This was not the best performance out of Scottie but I think he’s going to be much better going forward,” Rajakovic said.\n\n\r\n              Orlando Robinson made his second straight start for the Heat in place of injured All-Star center Bam Adebayo, who sat because of a bruised left hip. Adebayo left in the second quarter of Miami’s comeback win over Indiana on Thursday and has not played since.\n\n\r\n              “Orlando was terrific,” Spoelstra said of the second-year center. “He gets better each month and you saw that tonight. He had a lot of big plays.”\n\n\r\n              The Heat also played without forward Haywood Highsmith (lower back contusion).\n\n\r\n              Former Raptors guard Kyle Lowry scored three points in 28 minutes. Lowry was the only Miami starter not to score at least 10 points.\n\n\r\n              Lowry received a loud ovation when he was introduced before the game. A key part of Toronto’s championship-winning team in 2019, Lowry said Wednesday morning that he “definitely” plans to retire as a Raptor, and will sign a one-day contract with Toronto when he chooses to leave the sport.\n\n\r\n              Miami scored 37 points in the first quarter, extending its team-record streak of 30-point quarters to nine. The Heat were held to 27 points in the second.\n\n\r\n              Miami trailed 66-64 at the half but Butler scored eight points as the Heat took advantage of seven Toronto turnovers to open the third with a 16-0 run. \n\n\r\n              “We cannot be the team that plays defense only when we are scoring,” Rajakovic said.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Cleveland on Friday night.\n\n\r\n              Raptors: Visit Charlotte on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995377.440657
}