{
  "game_id": "0021800533",
  "espn_id": "401071209",
  "date": "Dec 29, 2018",
  "matchup": "PHX vs. DEN",
  "headline": "Murray scores 46, hits 9 3s as Nuggets hold off Suns 122-118",
  "body": "PHOENIX --  There was no getting around the pain in his right ankle, so Jamal Murray figured out a way to deal with the injury.\n\n\"I was trying not to move as much, kind of relied on my shot,\" Murray said.\n\nHe's rarely shot it better than he did Saturday night.\n\nMurray scored 46 points and made a career-high nine 3-pointers, carrying the Western Conference-leading Denver Nuggets to a 122-118 victory over the Phoenix Suns, the adrenaline from a big night helping him deal with the ankle.\n\nMurray was 16 for 24 from the field with the second-most points he's scored in a game this season. He scored 31 a night earlier in a win over San Antonio.\n\nThe Suns almost overcame a 22-point, fourth-quarter deficit, drawing to 113-110 on Mikal Bridges' 3-pointer with 1:51 to play. T.J. Warren hit a 3 to cut the lead to 117-113 with 30 seconds remaining, but the Nuggets closed it out with free throws in the final seconds.\n\nNikola Jokic added 23 points, nine assists and eight rebounds for Denver, while Malik Beasley came off the bench to hit a career-high five 3-pointers for his 15 points.\n\n\"He's my security blanket,\" Nuggets coach Michael Malone said of Jokic. \"At the end of the game, when the ball goes to him I know something good is going to happen.\"\n\nRookie Deandre Ayton scored a season-high 33 points and added 14 rebounds for the Suns. Ayton made 12-of-13 shots in the second quarter for 24 points, the highest-scoring quarter by a Suns rookie and sixth-highest by any Sun in franchise history.\n\n\"I don't think I started off playing well,\" Ayton said. \"Coach took me out and I got my second wind and went out and forgot about the scoreboard and just played hard.\"\n\nDenver improved to 4-1 in the second of back-to-back games this season. The Nuggets made a season-high 18 3s for the second straight night.\n\nPhoenix, the last-place team in the West, is 0-6 on the second night of back-to-backs this season and has lost four of its last five overall.\n\nSuns star Devin Booker bruised his lower back in the second quarter after he stepped in to draw a charge on the Nuggets' Torrey Craig. Though announced as questionable for the second half, he returned and scored 27 points for the game, 20 in the second half.\n\n\"We were worried if he could finish the game and be on the court,\" Suns coach Igor Kokoskov said. \"He was fighting through pain and he was leading the group when we needed him the most.\"\n\nMurray started hot, knocking down his first three 3s and finishing the first quarter with 13 points. He had 15 in the fourth.\n\nMurray lobbed to Mason Plumlee for a dunk with 2:39 left in the first half, giving Denver a 57-37 lead.\n\nThe Suns went on a 12-2 run to cut the lead to 59-49, but Juancho Hernangomez hit a 3 just before the halftime buzzer for Denver. The Nuggets made 11 3s in the first half.\n\nDenver led by as many as 23 in the third quarter, but Ayton's hook with 19 seconds got the Suns within 90-78. Denver scored the first seven points of the fourth quarter, but the Suns stormed back to make it interesting at the end.\n\nEXCHANGE OF THOUGHTS\n\nAs the Suns rallied in the fourth quarter, a fan yelled from the stands at Kokoskov. \"Hey Igor, we can make some free throws!\" the fan shouted.\n\nKokoskov looked at him, pointed and said, \"You're right!\" The Suns made nine of 14 for the game.\n\nTIP-INS\n\nNuggets: F Paul Millsap returned to action after missing the past eight games with a broken right big toe. He played 14 minutes. \"We'll see at altitude, I think that's going to be the big challenge,\" Millsap said about getting back into game shape. ... Beasley played through a sprained left ankle. ... Five other Nuggets players were inactive, including G Will Barton (hip/core surgery) and G Gary Harris (right hip).\n\nSuns: Booker was assessed a flagrant foul in the third quarter when his hard contact on Craig sent Craig sprawling to the floor under the basket after a breakaway. ... Booker has 25 or more points in eight straight games. ... Bridges, a rookie, made a career high five 3s.\n\nUP NEXT\n\nNuggets: Host New York on Tuesday night.\n\nSuns: Host Golden State on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995080.459506
}