{
  "game_id": "0021800469",
  "espn_id": "401071150",
  "date": "Dec 21, 2018",
  "matchup": "CHA vs. DET",
  "headline": "Williams' 7 3-pointers lift Hornets past Pistons 98-86",
  "body": "CHARLOTTE, N.C. --  When asked about the last time he made seven 3-pointers in a game, Marvin Williams paused for several seconds and then finally responded, \"High school?\"\n\nThat was a long time ago for the 32-year-old Williams.\n\nThe 13-year veteran found his shooting stroke on Friday night, making a career-high 7 of 11 shots from beyond the arc on the way to a season-high 24 points as the Charlotte Hornets beat the Detroit Pistons for the third time this season, 98-86.\n\n\"He was sniping tonight,\" teammate Jeremy Lamb said.\n\nThe Hornets skipped their morning shootaround, and Williams said he reported to the game feeling fresh.\n\nDetroit's Reggie Bullock said the Pistons suffered defensive breakdowns in guarding Williams.\n\n\"He's a pick-and-popper,\" Bullock said. \"We've just got to be able to rotate to him quicker or whatever we want to do to be able to get to him a lot quicker. He had a lot of open looks and he was shooting pretty quick, so we just have to do better with our switches or peel-backs or whatever we call it to be able to get back to shooters.\"\n\nWhen Hornets coach James Borrego speaks of Williams, he normally uses one word: pro.\n\n\"He's at the core of who we are,\" Borrego said. \"I'm really proud of him, he shot the ball well and his teammates were looking for him. He was locked and loaded tonight.\"\n\nKemba Walker finished with 22 points on 9-of-17 shooting and hit two 3-pointers down the stretch to seal Charlotte's second straight win at home. The Hornets moved back ahead of the Pistons for sixth place in the Eastern Conference.\n\nBlake Griffin had 23 points, and Andre Drummond had 17 points and 16 rebounds for the Pistons, who shot 39 percent from the floor and scored their fewest points of the season.\n\nThe Hornets opened a 15-point lead in the third quarter behind 13 points by Williams.\n\nBut Pistons would cut the lead to three with five minutes left in the game after the Hornets missed their first eight shots of the fourth quarter.\n\nEnter Lamb.\n\nLamb, who beat the Pistons on a last-second jumper 10 days ago, shook off a cold shooting night and scored on a driving left-handed layup and then buried a deep 3-pointer.\n\nWalker then connected on back-to-back 3s, the first coming after shaking off a defender. Walker even seemed to impress himself, smiling wide and holding his hands over his head mouthing the words \"Oh my!\" After his second, he ran back down the court lifting his legs high in the air while pumping his arms, knowing he had all but sealed the game.\n\nTIP-INS\n\nPistons: Bench was outscored 36-23. ... Shot 23.5 percent from 3-point range. .. Only made 14 of 22 free throws.\n\nHornets: Cody Zeller fouled out with 4:17 left and the Hornets leading 83-78. ... Michael Kidd-Gilchrist had 12 points and Willy Hernangomez had 11 off the bench.\n\nNOT UP TO SATISFACTION\n\nPistons coach Dwane Casey wasn't pleased with his team's effort.\n\n\"Our give-a-crap level was very low,\" Casey said. \"For a very important game like tonight, when you are a winner you come out and take this game and come ready to fight. I'll take the blame for it. I didn't get our team ready enough to come out and compete and fight.\"\n\nDEFENSE STEPS UP\n\nBorrego said it was his team's best defensive effort of the season.\n\n\"We found a group of men that's committed to the defensive end these last two games,\" Borrego said. \"Four fast-break points for them, 46 points in the paint, I think that was our low for the season for opponent points at 86. ... I think we made a lot strides defensively these last few days and that's what's got to sustain us, competing on both ends of the floor.\"\n\nUP NEXT\n\nPistons: Host the Atlanta Hawks on Sunday.\n\nHornets: Visit the Boston Celtics on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994403.9778008
}