{
  "game_id": "0022200382",
  "espn_id": "401468537",
  "date": "Dec 09, 2022",
  "matchup": "LAL @ PHI",
  "headline": "76ers recover in OT after blown lead to beat Lakers 133-122",
  "body": "PHILADELPHIA -- — De’Anthony Melton was an LA kid who rooted hard for the Clippers and not that other team in town.\n\n\r\n              Melton sure had more fun beating the Lakers in Philly.\n\n\r\n              Joel Embiid had 38 points and 12 rebounds, Melton scored a career-high 33 points off the bench and the 76ers recovered after blowing a nine-point lead in the final 30 seconds of regulation to beat Los Angeles 133-122 in overtime on Friday night.\n\n\r\n              “We will take the win,” 76ers coach Doc Rivers said. “Usually when you give up a lead like that, to gather yourself and play well in overtime is rare.”\n\n\r\n              Anthony Davis had 21 of his 31 points in the fourth and finished with 12 rebounds, while LeBron James scored 23 points for the Lakers. James (sore left ankle) and Davis (illness) both missed a loss in Toronto on Tuesday. \n\n\r\n              James gutted out his injury but made only 9 of 22 shots and missed 7 of 8 3-pointers.\n\n\r\n              Russell Westbrook had 12 points, 11 rebounds and 11 assists, joining Magic Johnson as the only Laker with a triple-double off the bench.\n\n\r\n              The Lakers were down 12 with 2 1/2 minutes remaining in regulation but rallied on clutch buckets and costly fouls by the Sixers. James converted a three-point play with a minute left that pulled the Lakers to 115-110.\n\n\r\n              Austin Reaves buried a 3 with 12 seconds left that pulled the Lakers to 119-117 and got a tremendous rise out of the Lakers fans well represented in the crowd. Down 120-117, Reaves was fouled by Matisse Thybulle on a 3-point attempt. He made the first two free throws and missed the third. \n\n\r\n              “I don’t know anybody that makes two and misses one,” Reaves said. “It sucks to miss. I'm sure my mom will be frustrated with me for missing a free throw.”\n\n\r\n              Davis then was fouled by Tobias Harris with 3.7 seconds left. Davis missed one of two that made it 120-all and sent the game into OT.\n\n\r\n              “It hurts, for sure, especially when you make the first one,” Davis said. “I watched the tape trying to see what I did wrong. Obviously, I left it short.”\n\n\r\n              The Lakers made 16 of 20 free throws in the fourth.\n\n\r\n              “I felt like a football coach when the guy has a field goal,” at the end, Rivers said. “I hope he misses one of the field goals. He did. We got it to overtime, which is an amazing statement. Really. That should never happen.”\n\n\r\n              The Lakers then missed their first nine shots of OT and were outscored 13-2. James Harden scored nine points in overtime and finished with 28 points and 12 assists.\n\n\r\n              Melton had a career game in the third alone with three steals, hit four 3s and he made all six shots in a 16-point quarter. He made eight 3s overall and had seven steals.\n\n\r\n              Embiid highlighted a wild first half with a 20-point first quarter of 8-of-9 shooting overall and two 3-pointers. Embiid actually scored as many points as the Lakers in the quarter when he led the Sixers to a 31-20 lead. Embiid’s eight baskets also matched the Lakers’ total.\n\n\r\n              He closed the quarter with a powerful dunk over poor Thomas Bryant that rattled into the second level of suites.\n\n\r\n              Embiid briefly went to the locker room at the start of the second and that left an opening for the Lakers. The Sixers traditionally struggle when Embiid is off court, not terribly surprising since he is the reigning NBA scoring champion.\n\n\r\n              But this was outing was particularly abysmal.\n\n\r\n              The Lakers went on a 13-2 run with Embiid on the bench, a run that wasn’t steadied until, yes, Embiid returned and hit a 3 for a 36-34 lead. The game then morphed into a 3-point shootout. The Lakers hit four, the 76ers made six and Philly took a 61-59 lead into the break.\n\n\r\n              Who kept the Lakers close in the half? It sure wasn’t James and Davis. Try Reaves, who hit two 3s and scored 15 points that kept the Lakers within striking distance. He finished with 25.\n\n\r\n              TIP-INS\n\n\r\n              Lakers: Johnson had a triple-double off the bench on Feb. 14, 1996 against the Hawks. ... James missed his first six shots and Davis was whistled for two fouls inside the first 4 minutes of the game and picked up his fourth early in the third. \n\n\r\n              76ers: Harden joined James, Westbrook and Oscar Robertson as the only players in NBA history with 23,000 career points and 6,500 career assists. ... Melton is the first Sixer ever and only the second NBA player ever with 30 points, eight 3s and seven steals in a game.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Wrap a six-game road trip Sunday at Detroit.\n\n\r\n              76ers: Play the second game of a seven-game homestand Sunday against Charlotte. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995053.7192588
}