{
  "game_id": "0022000007",
  "espn_id": "401266798",
  "date": "Dec 25, 2020",
  "matchup": "BKN @ BOS",
  "headline": "Irving scores 37, leads Nets to 123-95 win over Celtics",
  "body": "BOSTON -- — Kyrie Irving scored 37 points with eight assists in his return to Boston and Kevin Durant added 29 for Brooklyn on Friday to lead the Nets to a 123-95 victory over the Celtics.\n\n\r\n                    Jarrett Allen added 11 rebounds for the Nets, who remained perfect so far this season and sent Boston to its first loss. Irving was 7 of 10 from 3-point range in his first regular-season game at TD Garden since he opted out of his Celtics contract in 2019. \n\n\r\n                    “We’re going to continue to see them. We’re in the same division,” Irving said, adding that there was “nothing added” to his motivation in playing his former team.\n\n\r\n                    Jaylen Brown scored 27 with eight rebounds for the Celtics and Jayson Tatum had 20 points and eight boards. The Celtics beat Milwaukee in their opener on Wednesday on Tatum's last-second shot over Giannis Antetokounmpo, but they couldn't do it again in their second straight matchup against a team expected to contend in the Eastern Conference this season.\n\n\r\n                    “The benefit of playing these two games against two other great teams is that it forces you to be better,\" Celtics guard Marcus Smart said. \"It tests you to see where you’re at, it sets the bar, and now you know what you have to strive for.”\n\n\r\n                    The game began after a moment of silence for former Celtics player and coach K.C. Jones, who died earlier Friday. \n\n\r\n                    Durant scored 16 points in the third quarter, when the Nets outscored Boston 35-23 to turn a three-point deficit into an 86-77 lead. He scored nine straight Brooklyn points at the beginning of the third when the Nets took the lead for good.\n\n\r\n                    \"It’s still impressive to watch after all these years,\" Nets coach Steve Nash said. “For him to have little runs like that is nothing in his mind. For mere mortals in the NBA, it’s impossible to think of.” \n\n\r\n                    Boston led by three at the half before being outscored 35-23 in the third quarter, including a 9-0 run that turned a three-point edge into a 82-70 lead. It was 86-79 early in the fourth when the Nets, even with Irving and Durant on the bench, again scored nine in a row to open a 16-point lead.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Brooklyn has beaten the Warriors with Klay Thompson and Draymond Green sitting out and the Celtics with Kemba Walker injured. “We just need to stay hungry. This means nothing,” Nash said. ... It was Durant’s 10th visit to the TD Garden in 14 seasons -- his fewest in any NBA city. \n\n\r\n                    Celtics: Jeff Teague was perfect from 3-point range in the exhibition season and 4 for 4 in the regular season opener before missing his first in the third quarter on Friday. ... Tatum scored zero points in the first quarter and 12 in the second. ... Tatum’s passed Walter McCarty and moved into eighth place on the Celtics’ all-time 3-pointer list, with (418). Isaiah Thomas is seventh with 460 and Paul Pierce is first with 1,823. ... Celtics coach Brad Stevens was called for a technical foul arguing about a foul call against Daniel Theis in the second quarter.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Visit the Charlotte Hornets on Sunday.\n\n\r\n                    Celtics: Head to Indiana for games against the Pacers on Sunday and Tuesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997526.096246
}