{
  "game_id": "0022100679",
  "espn_id": "401360498",
  "date": "Jan 19, 2022",
  "matchup": "SAC vs. DET",
  "headline": "Joseph hits winner, Pistons rally late to stun Kings 133-131",
  "body": "SACRAMENTO, Calif. -- — Cory Joseph made a 14-foot jumper with 25.9 seconds remaining to cap a game-ending 11-0 run that rallied the Detroit Pistons past the Sacramento Kings 133-131 on Wednesday night.\n\n\r\n              Saddiq Bey had 30 points and seven rebounds to help the Pistons (11-33) win their fourth in seven games. Kelly Olynyk added a season-high 22 points and nine rebounds in his first game since November.\n\n\r\n              Joseph, the former Kings guard who was dealt to the Pistons at the trade deadline last year, finished with 19 points and nine assists.\n\n\r\n              “They showed the resilience that we have to have,” Detroit coach Dwane Casey said. “These are the dog days of the season, right before the All-Star break. You mentally have to get ready to go. We had some big-time defensive breakdowns down the stretch; we weren’t disciplined on switches. (But) we found a way.”\n\n\r\n              Terence Davis scored 14 of his career-high 35 points in the fourth quarter for the Kings. De’Aaron Fox added 27 points, eight assists and six rebounds but missed a 14-footer that bounced off the front of the rim at the buzzer.\n\n\r\n              Sacramento has dropped seven of nine.\n\n\r\n              “You have to guard in a way that you just don’t give up the last 11 points of the game. You just can’t do it,” Kings interim coach Alvin Gentry said. “The bottom line is that they made big shots when they had to and we didn’t get the last one in the basket. We played well enough to win. We just didn’t finish the game.”\n\n\r\n              The Kings led 131-122 with 2:34 left but went scoreless the rest of the way while the Pistons seized control.\n\n\r\n              Bey and Olynyk made consecutive 3-pointers, and Bey followed with a three-point play to tie it at 131. After Fox missed a short jumper, Joseph connected on the go-ahead shot to silence the crowd.\n\n\r\n              “I love Cory,” Casey said. “He means a lot to our organization. The way he’s been playing the last two or three weeks has been big-time. He’s been a sparkplug for us. Hopefully he’s setting the tone for our young guys here with his play, with his professional approach. He could probably go to a championship-caliber team and be a sparkplug, but to us he’s very important.”\n\n\r\n              The Pistons led by seven at the end of the first quarter and were up 39-34 after Olynyk blocked a shot by Davion Mitchell, then sprinted to the other end and dunked off an offensive rebound.\n\n\r\n              Davis, starting while Tyrese Haliburton remains in health and safety protocols, got the Kings going. Davis scored 16 of Sacramento’s season-high 45 points in the second quarter, connecting on six of eight shots — including a pair of 3s.\n\n\r\n              After trailing 93-82, the Pistons scored 12 straight points in the third.\n\n\r\n              WELCOME BACK\n\n\r\n              Olynyk’s return to the lineup after missing two months and 32 games with an MCL sprain provided a nice lift for the Pistons. He had seven points in the third quarter, scored Detroit’s first four in the fourth and added his clutch 3-pointer down the stretch.\n\n\r\n              “I try to tell these young guys to enjoy every night,” Olynyk said. “Life’s boring without basketball. It’s tough. It’s just good to be back, man.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Cade Cunningham scored 13 points before fouling out. … Bey had 17 points in the first half. … Hamidou Diallo was charged with a technical in the second quarter. … Jerami Grant has entered the NBA’s health and safety protocol. … Killian Hayes (bruised right hip) was held out.\n\n\r\n              Kings: Sacramento shot 31 of 44 on free throws. … Fox and Chimezie Metu were called for technicals in the first half.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Face the Jazz in Utah on Friday. Detroit beat Utah on Jan. 10 to end a four-game skid against the Jazz.\n\n\r\n              Kings: Begin a five-game road trip against the Bucks on Saturday. Milwaukee has won 10 straight against Sacramento dating to 2016.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993088.301107
}