{
  "game_id": "0022200014",
  "espn_id": "401468029",
  "date": "Oct 19, 2022",
  "matchup": "SAC vs. POR",
  "headline": "Grant rallies Blazers past Kings 113-108 in opener",
  "body": "SACRAMENTO, Calif. -- — Jerami Grant converted a three-point play with 50.4 seconds to play to give Portland the lead and the Trail Blazers spoiled Mike Brown's coaching debut in Sacramento with a 113-108 win over the Kings on Wednesday night.\n\n\r\n              Grant scored 23 points to lead Portland and Anfernee Simons added 22. Damian Lillard scored 20 in his first game back from an abdominal injury that had sidelined him since January.\n\n\r\n              “I just like to play the game the way that the game should be played,” coach Chauncey Billups said. “We have a generational guy in Dame. He’s going to have his nights. We got to have other guys be there when it’s actually not his night and you can actually go win a game or go steal a game. That’s exactly what happened tonight.” \n\n\r\n              The Kings came into the season with optimism that the hiring of Brown could help end an NBA-record 16-season playoff drought.\n\n\r\n              But they were dealt a loss in the opener despite 33 points from De'Aaron Fox and and 23 from Kevin Huerter in his Kings debut.\n\n\r\n              “I know this group should play a lot better on both ends of the floor,” Brown said. “I know this group can play a whole heck of a lot better on both ends of the floor.”\n\n\r\n              Terence Davis gave Sacramento a 106-104 lead when he followed a missed shot by Huerter with an emphatic dunk with 2:18 to play. But Davis was given a technical foul after the dunk and Lillard made the free throw to make it 106-105.\n\n\r\n              After a couple of empty trips on both ends, Grant gave Portland the lead for good with his driving layup and foul shot after an apparent turnover by the Blazers was wiped off because of a kicking violation on Sacramento.\n\n\r\n              Fox missed a 3 at the other end and Josh Hart added another three-point play to make it a five-point game and the Blazers held on for the win. \n\n\r\n              “We just grinding and fighting,” Hart said. “That’s going to be the biggest thing. ... Teams are going to go on runs and we got to make sure we’re connecting with each other when that happens. If we do that and play our game, I like our team.\"\n\n\r\n              The Kings fell into a 14-point hole in the second quarter as they struggled offensively and kept sending Portland to the foul line. They turned it around with a 16-1 run to move back ahead and had a 55-51 lead at halftime.\n\n\r\n              The Blazers trailed by 10 midway through the third quarter before tying it in the closing seconds on a layup by Simons.\n\n\r\n              Portland then pulled it out in the fourth.\n\n\r\n              “We still had a chance to win,” Fox said. “We can’t give up three 30-point quarters. They scored off a lot of our turnovers and I do think we were a bit sloppy.”\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: Shaedon Sharpe scored 12 points in 16 minutes in his NBA debut. Sharpe was selected seventh overall in the draft despite not playing last season at Kentucky. ... Key offseason acquisition Gary Payton II remains sidelined by a core muscle injury. ... Portland snapped a three-game losing streak in season openers. \n\n\r\n              Kings: Fox became the first Kings player to have at least 30 points, five rebounds and five assists in an opener since Oscar Robertson in 1966. ... First-round rookie Keegan Murray (COVID protocols) was sidelined and will have to wait to make his debut. ... Baseball Home Run King Barry Bonds rang the cowbell to open the game along with former Kings Metta Sandiford-Artest and Brad Miller. ... The Kings played a video tribute to their former coach Bill Russell, who died this summer. Russell coached one year in Sacramento following a Hall of Fame playing career for Boston. \n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Host Phoenix on Friday night.\n\n\r\n              Kings: Host the Clippers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995315.645558
}