{
  "game_id": "0021900013",
  "espn_id": "401160655",
  "date": "Oct 23, 2019",
  "matchup": "POR vs. DEN",
  "headline": "Jokic powers Denver past Portland 108-100",
  "body": "PORTLAND, Ore. --  Early foul trouble in the season opener wasn't going to get Nikola Jokic down.\n\nHe had 20 points and 13 rebounds despite sitting much of the first half, and the Denver Nuggets spoiled the first game of Portland's 50th season with a 108-100 victory over the Trail Blazers on Wednesday night.\n\nWill Barton added 19 points for the Nuggets, who also snapped Portland's 18-game winning streak in home openers, the longest streak in league history. Denver made 18 3-pointers.\n\n\"I didn't want to force it. I just wanted to win the game,\" said Jokic, who had 16 points in the fourth quarter alone. \"I wanted to go out there to be the positive energy to win the game.\"\n\nDamian Lillard led the Blazers with 32 points and eight assists, and Hassan Whiteside had 16 points and 19 rebounds in his Portland debut.\n\nWhiteside, acquired in an offseason trade with Miami, tipped in Lillard's 3-point attempt to help the Blazers to an 88-87 lead with just under five minutes left. But the Nuggets answered with consecutive baskets from Jokic and Gary Harris.\n\nJokic hit back-to-back 3-pointers to extend Denver's lead to 97-90. Lillard landed a 3-pointer with 1:58 left to narrow the gap but the Blazers couldn't catch up.\n\n\"Nikola in the fourth quarter was phenomenal,\" Denver coach Michael Malone said. \"I think he had 16 and 8 in the quarter. He showed everybody why he's an MVP-caliber player.\"\n\nIt was the first meeting between the teams since the Western Conference semifinals, won by the Blazers in seven games.\n\n\"When the game was being decided, we just had too many lapses on both ends of the floor,\" Lillard said. \"We put ourselves in a position where it was going to be hard to come back from them.\"\n\nThe Nuggets didn't make a lot of changes over the summer, returning the nucleus of the team that won 54 games last season and earned the West's second seed, ending a six-year postseason drought. The team's biggest move was acquiring Jerami Grant from Oklahoma City.\n\nPortland, meanwhile, has six new faces on the roster, including Whiteside, who started at center. The Blazers also picked up veteran big man Pau Gasol as they await Jusuf Nurkic's return from a broken leg.\n\nThe Blazers finished 53-29 last season and clinched the West's third seed, playing through to the conference finals for the first time in 19 years.\n\nJokic collected three early fouls and went to the bench with 8:15 left in the first quarter, and the Nuggets struggled.\n\n\"In the beginning of the game it brought out a lot of memories from last year's series,\" Jamal Murray said. \"We just wanted to come out and have a good game and come out with a win.\"\n\nRodney Hood hit a 3-pointer and made a free throw to give Portland a 19-7 lead. Lillard's first points of the game came on a dunk that made it 21-16.\n\nThe Blazers closed to 70-69 on Lillard's 3-pointer late in the third quarter and then tied it on Anfernee Simons' free throw. But they didn't regain the lead until Simons' driving layup made it 74-73 and capped a 16-6 run going in to the final period.\n\nCJ McCollum's 3-pointer pushed the lead to 79-73 and Portland held on until Murray's 3 made it 83-all. Jokic's jumper gave Denver back the lead before Whiteside's tip.\n\n\"They had won 18 straight openers here so to come in here and win on the road against a division rival to start the year off I couldn't ask for a better start,\" Malone said.\n\nTIP INS\n\nNuggets: Former Oregon center Bol Bol, the son of Manute Bol, warmed up with the Nuggets but was not available to play. A second-round pick, he signed to a two-way contract with the team. ... The 18 3-pointers were the team's most for an opener. ... Michael Porter Jr., the No. 14 draft pick in 2018 who sat out last season as he recovered from back surgery, did not play for the Nuggets.\n\nTrail Blazers: Gasol, who is still rehabbing from foot surgery, did not play. ... Lillard addressed the crowd before the game: \"Rip City! Rip City! We would like to welcome you to our 50th season, and hopefully our best.\" ... The previous record for longest winning streak in home openers was 14, held by Boston from 1979-92.\n\nWHITESIDE'S DEBUT: Whiteside gave his debut mixed reviews, lamenting Jokic's late 3-pointers. \"We need to get the 3-point defense down,\" he said. \"They made some tough shots, but we can definitely get better at defending the 3.\"\n\nUP NEXT\n\nNuggets: Host the Phoenix Suns on Friday.\n\nTrail Blazers: Kick off a four-game road trip against the Sacramento Kings on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996611.4227479
}