{
  "game_id": "0022301080",
  "espn_id": "401585708",
  "date": "Mar 31, 2024",
  "matchup": "TOR vs. PHI",
  "headline": "Kelly Oubre Jr. scores season-high 32 points, 76ers beat Raptors 135-120 to end 3-game skid",
  "body": "TORONTO -- — Kelly Oubre Jr. scored a season-high 32 points, Kyle Lowry had 11 points and 10 assists against his former team and the Philadelphia 76ers snapped a three-game losing streak, beating the Toronto Raptors 135-120 on Sunday.\n\n\r\n              Cam Payne scored 14 of his 24 points in the fourth quarter, Tobias Harris had 21 and Nicolas Batum 19 to help Philadelphia send Toronto to its 13th straight loss and seventh in a row against the 76ers.\n\n\r\n              Oubre shot 10 for 22, matching a season-best by making 6 of 11 3-point attempts. Philadelphia made a franchise-record 24 3-pointers on 43 tries.\n\n\r\n              “Every time it seemed like it was really getting closer, we came down and made a good play for an open 3,” 76ers coach Nick Nurse said. “I don’t know how many times we answered those rallies with a 3.”\n\n\r\n              Philadelphia is 3-0 this season and 7-1 all time when making 20 or more 3-pointers.\n\n\r\n              Guard Tyrese Maxey sat for the 76ers because of tightness in his left hip.\n\n\r\n              “Kelly was amazing, Cam was amazing,” Lowry said. “We all stepped up for Tyrese, because he’s an irreplaceable guy.”\n\n\r\n              Before the game, Nurse said injured center Joel Embiid participated Saturday in a light practice in Toronto. The reigning NBA MVP has been out since Feb. 6 following left knee surgery.\n\n\r\n              “When you’re playing without two main guys on offense you have to find ways,” Batum said. “We just tried to move the ball, find different ways on offense, and we did.”\n\n\r\n              Lowry and Nurse, pivotal parts of Toronto’s 2019 NBA championship team, each received a warm ovations when they were introduced before the game.\n\n\r\n              “I was here nine years with him,” Nurse said about Lowry. “He’s certainly, if not the best, one of the best to ever play here.”\n\n\r\n              Gary Trent Jr. scored 23 points for Toronto. Jordan Nwora added 19, and Kelly Olynyk had 18 points and 11 rebounds as the reeling Raptors matched the second-longest losing streak in team history. Toronto lost a franchise-worst 17 consecutive games in 1997-98.\n\n\r\n              Just as they did on Wednesday night in a 44-point loss to New York, the Raptors trailed throughout against the 76ers. Toronto has not led since early in the fourth quarter of Monday night in a loss to Brooklyn.\n\n\r\n              Guard Ochai Agbaji was unavailable for the banged-up Raptors after leaving Wednesday’s loss following a heavy landing on his right hip. Toronto’s list of eight absentees also included RJ Barrett and Immanuel Quickley, who are in return-to-competition reconditioning, plus injured starters Scottie Barnes (left hand) and Jakob Poeltl (left pinkie).\n\n\r\n              “It’s tough but that’s the reality of where we’re at,” Raptors coach Darko Rajakovic said. “We’ve just got to adjust and roll with it.”\n\n\r\n              Toronto has lost seven straight at home. The Raptors are 1-14 against Atlantic opponents with one divisional game remaining, April 10 at Brooklyn.\n\n\r\n              The 76ers led 35-27 after one quarter and stretched their advantage to 71-55 at the half. Oubre scored 12 points in the third as Philadelphia took a 101-93 lead to the fourth.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Oklahoma City on Tuesday night.\n\n\r\n              Raptors: Host the Los Angeles Lakers on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996185.278125
}