{
  "game_id": "0021500160",
  "espn_id": "400828047",
  "date": "Nov 17, 2015",
  "matchup": "DET vs. CLE",
  "headline": "Pistons rally for 104-99 win over Cavs despite James' 30",
  "body": "AUBURN HILLS, Mich. -- With his team down by four and less than 3 minutes to play, Andre Drummond was fouled intentionally. It's a strategy opposing teams will keep employing as long as the Detroit big man is making about 40 percent of his free throws.\n\"It comes to a point where I've just got to shoot with confidence,\" Drummond said. \"Tonight, I knew we had the game on the line, so I went back to the basics of that.\"\nDrummond had 25 points and 18 rebounds and made some crucial free throws down the stretch, helping the Pistons rally to a 104-99 victory over the Cleveland Cavaliers on Tuesday night.\n\nLeBron James scored 23 of his 30 points in the first half for the Cavs.\nDrummond's free throw with 2:07 left gave the Pistons a 98-97 advantage. It was 102-99 with 13.8 seconds remaining after Reggie Jackson made two free throws for Detroit. J.R. Smith then missed a contested 3-pointer from near the top of the key.\nJackson had 23 points and 12 assists for the Pistons, and Ersan Ilyasova added 20 points.\nDetroit snapped a four-game losing streak. The Cavs lost their second straight after winning eight in a row.\n\"We are too relaxed and too nice,\" James said. \"We need to get tougher, but I'm not talking about being an iron man. You have to be mentally tough, and that means performing at the best of your abilities at all times. We've got some guys who do that all the time, and some guys who don't.\"\nThe Cavs led 97-93 when they started intentionally fouling Drummond. He made two free throws with 2:58 remaining, and after the Pistons tied it on a basket by Jackson, Cleveland fouled Drummond again. This time he made one of two free throws.\n\"Andre's a 40 percent shooter, and despite what I might think about that, it is in the rules and we thought we could steal a couple possessions at a critical point in the game,\" Cavs coach David Blatt said. \"It just didn't work.\"\nDown by one, James passed out of a double team to Kevin Love, who missed from the corner before the Pistons turned the ball over. Then James, doubled again, threw the ball away with 48.8 seconds remaining.\nJackson missed a floater, but Cleveland's Timofey Mozgov missed from the baseline and the Cavaliers had to foul. Jackson made two free throws with 21.3 seconds remaining.\nJames answered with a driving layup, but Jackson was fouled again and pushed the lead back to three.\nLove scored 19 points, and Smith and Mo Williams had 15 each for Cleveland, which is without injured star Kyrie Irving (knee) and guard Iman Shumpert (wrist).\nRIVALRY TALK\nJames, a noted Ohio State football fan, was asked before the game about the Buckeyes' next two matchups, which are both against teams from the state of Michigan. Ohio State hosts Michigan State this weekend before playing at Michigan.\nJames was specifically asked if the rivalry with Michigan will have a bit more buzz now that Jim Harbaugh is coaching the Wolverines.\n\"It doesn't matter who is the coach over in Michigan. It's always a rivalry,\" he said. \"We really don't care who's at the helm over there.\"\nMILESTONE WIN?\nThe Pistons improved to 6-5 this season. They started 5-23 last season and didn't earn win No. 6 until after Christmas, and a reporter reminded Detroit coach Stan Van Gundy of that after the game.\n\"I'm well aware,\" Van Gundy said. \"I'm glad you brought that up. It was good to revisit that.\"\nTIP-INS\nCavaliers: James scored at least 30 points for the fourth straight game. In the first quarter, he passed Jerry West to take over 19th place on the NBA's career scoring list. \"Every day, every one of us represents `The Logo,\" James said. \"Every player, every person in this league. So passing him? That's a huge honor. I've had the chance to read his book, and I've had the chance to talk to him, and he's what this game is all about.\"\nPistons: Drummond has had a double-double in all 11 games this season. ... Jackson rebounded after a season-low nine points in a loss to the Los Angeles Lakers on Sunday.\nUP NEXT\nCleveland hosts Milwaukee on Thursday night.\nDetroit plays at Minnesota on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994952.8654988
}