{
  "game_id": "0022201206",
  "espn_id": "401469361",
  "date": "Apr 07, 2023",
  "matchup": "TOR @ BOS",
  "headline": "Hauser scores career-high 26, Celtics beat Raptors 121-102",
  "body": "BOSTON -- — Sam Hauser scored a career-high 26 points and the Boston Celtics cruised past the Toronto Raptors 121-102 on Friday night. \n\n\r\n              Jayson Tatum finished with 21 points and sat out the entire second half as the Celtics posted a 4-0 sweep in the season series. It is Boston’s first sweep over Toronto since 2009-10.\n\n\r\n              The Celtics, who secured the No. 2 seed in the Eastern Conference playoffs in Wednesday’s win over Toronto, played without All-Star Jaylen Brown after he accidentally cut a finger on his shooting hand on Thursday. He also will miss Sunday’s regular-season finale against Atlanta but expects to be ready to go in time for the start of the postseason. \n\n\r\n              Boston will face the winner of Miami and Atlanta in the first round.\n\n\r\n              With one game still left on its schedule, Tatum believes his team is in a good head space. \n\n\r\n              “Experience is the best teacher. And this group, the last two years, we’ve been through a lot,\" he said. \"We’ve accomplished a lot and we’ve failed. And we’ve failed together. Essentially, we’ve worked all off season and all preseason and had a great regular season…to get back to this point, to get back to the playoffs. To get another opportunity. Another shot.” \n\n\r\n              Hauser’s scoring barrage was punctuated in the third quarter when Al Horford intercepted a pass, tossed ahead a bounce pass and Hauser threw down a one-handed dunk. It was one of his three dunks for the game. \n\n\r\n              “I haven't had that many dunks in a game since high school, so I'll take it,\" Hauser said. \n\n\r\n              Tatum said Hauser's growth has put him in position to be called on in the postseason if needed. \n\n\r\n              “It's just a testament to how hard he's worked this offseason and this season to be prepared for moments like this,” Tatum said. “He wants to go out there and produce and we trust him to.”\n\n\r\n              Pascal Siakim led Toronto with 19 points, and Precious Achiuwa added 16 points and seven rebounds. \n\n\r\n              The Raptors entered Friday with a chance to improve their seeding for the play-in tournament. But the loss locks them into ninth. They will host 10th-seeded Chicago on Wednesday. \n\n\r\n              Toronto missed nine of its first 11 shots as Boston built an early 24-7 lead.\n\n\r\n              Tatum scored 15 points in the opening period and the Celtics ended it with a 34-16 advantage. \n\n\r\n              The lead ballooned to as many as 36 points in the second as Boston got to the rim with ease, connecting on 60% (24 of 40) of its field-goal attempts in the half. \n\n\r\n              TIP-INS\n\n\r\n              Raptors: Shot 30% (15 of 50) from the field in the first half. \n\n\r\n              Celtics: Marcus Smart (neck spasms) and Malcolm Brogdon (back) also sat out. … Payton Pritchard returned from an 11-game absence due to a left heel issue. … Boston went 15 of 15 on 2-point shots in the first half. \n\n\r\n              NEW KICKS\n\n\r\n              Tatum distributed several pairs of his first Jordan Brand Tatum 1 Blueprint Zoo sneakers to members of the Celtics on Friday. \n\n\r\n              He handed out pairs to the coaching and training staff after the team’s morning shoot-around. By game time, more pairs were visible on the feet of support staff at TD Garden from bench personnel to arena workers who mop the floor during timeouts. \n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host top-seeded Milwaukee on Sunday in regular-season finale.\n\n\r\n              Celtics: Host Atlanta on Sunday in regular-season finale. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994004.6671062
}