{
  "game_id": "0021800909",
  "espn_id": "401071582",
  "date": "Feb 26, 2019",
  "matchup": "TOR vs. BOS",
  "headline": "Siakam scores 25 as Raptors rout slumping Celtics 118-95",
  "body": "TORONTO --  A lack of togetherness is turning into big trouble for the struggling Boston Celtics.\n\nPascal Siakam scored 25 points, Kawhi Leonard had 21 and the Toronto Raptors used a huge second quarter to rout Boston 118-95 on Tuesday night.\n\nMarcus Morris scored 17 points, and Jayson Tatum and Terry Rozier each had 11 as Boston lost for the fifth time in seven games. The Celtics are 0-3 since play resumed following the All-Star break.\n\n\"We have to be a lot more connected as a team,\" Celtics coach Brad Stevens said. \"That's been the theme for a while.\"\n\nCeltics guard Marcus Smart echoed his coach's assessment.\n\n\"Nobody is together,\" Smart said. \"We've got to have everybody on the same page doing the same things at the same time.\"\n\nStill, Celtics guard Kyrie Irving wasn't on the same page when asked to respond to Smart's comments.\n\n\"That's Marcus' opinion,\" Irving said, declining to answer after being asked whether he agreed with his teammate.\n\nIrving also had little to say about Stevens' comment that Boston is taking too many \"shortcuts\" on defense.\n\n\"I don't know,\" Irving said. \"It's up to Brad.\"\n\nIrving scored seven points. It was his lowest-scoring game since he had three points against Detroit on Oct. 27.\n\nSerge Ibaka scored 14 points and Norm Powell added 11 as Toronto extended its home winning streak over Boston to eight. The Celtics have not win in Canada since a 117-116 overtime victory on April 4, 2015.\n\nKyle Lowry had 11 assists and Toronto led by as many as 31, turning the game around by outscoring Boston 36-13 in the decisive second.\n\n\"Everything they did took us out of what we wanted to do,\" Boston's Al Horford said.\n\nThe Raptors have won 15 of 17 at home, where they're 26-6 overall.\n\nToronto made 17 3-pointers, one shy of a season-high. Siakam matched his career-best by connecting four times in five attempts from long range.\n\nThe Celtics led 32-30 after one quarter and scored the opening points of the second, but the Raptors answered with an 18-0 run to lead 48-34 at 7:14. Leonard's fast break dunk at 3:06 put Toronto up by 20, 59-39.\n\n\"We locked in a little more,\" Siakam said. \"We got some stops. Obviously, when we get stops we're dangerous in transition.\"\n\nThe Celtics had twice as many turnovers in the second quarter (eight) as made baskets (four).\n\n\"I thought we were outplayed in every which way,\" Stevens said.\n\nToronto led 66-45 at halftime.\n\nTIP-INS\n\nCeltics: G Brad Wanamaker (illness) was not available. ... The Celtics shot six for 30 from 3-point range. ... Boston has lost three straight on the road.\n\nRaptors: Toronto had 11 assists on 14 made baskets in the second. ... The Raptors went 8-1 in February. ... Toronto lost both visits to Boston this season, including one overtime defeat. Boston and Toronto split their four meetings this season, with the home team winning each time. The home team has won 11 straight in the series.\n\nTITANS OF TUESDAY\n\nToronto improved to 9-0 on Tuesdays, while the Celtics dropped to 5-1.\n\nFAST WORK\n\nThe Raptors outscored the Celtics 29-9 in fast break points.\n\nUNDER 100\n\nToronto is 11-1 when holding opponents below 100 points, while Boston is 3-6 when failing to score at least 100.\n\nUP NEXT\n\nCeltics: Host Portland on Wednesday night.\n\nRaptors: Host Portland on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994099.572654
}