{
  "game_id": "0022300205",
  "espn_id": "401584833",
  "date": "Nov 18, 2023",
  "matchup": "MIL vs. DAL",
  "headline": "Antetokounmpo scores 40 as Bucks top Mavericks 132-125",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 40 points and Damian Lillard added 27 for the Milwaukee Bucks, who extended their winning streak to four games with a 132-125 victory over the Dallas Mavericks on Saturday night.\n\n\r\n              “It was a great character win,” Bucks coach Adrian Griffin said. “Back-to-back, short-handed … but everyone stepped up and it was a total team win.”\n\n\r\n              Antetokounmpo was averaging 41.3 points in his last three games before being held to 16 Friday night in Charlotte. Against the Mavericks, he connected on 18 of 26 shots including a pair of 3-pointers and grabbed 14 rebounds to go along with seven assists.\n\n\r\n              During that same five-game stretch, Lillard is averaging 27.4 points and with 12 assists Saturday night, has 30 over his last three games.\n\n\r\n              “Every game that goes by, I’m going to be more comfortable (playing with Lillard),” Antetokounmpo said. “As we move forward, we’re going to keep learning how to play with one another. It’s getting better. It’s a work in progress.”\n\n\r\n              Milwaukee’s streak looked like it might have been in jeopardy heading into the second-half of a back-to-back without a significant chunk of Griffin’s usual rotation including Khris Middleton, MarJon Beauchamp and Jae Crowder.\n\n\r\n              But the Bucks’ limited bench stepped up in a big way, combining for 46 points on 18-of-32 shooting while accounting for 10 of Milwaukee’s 17 3-pointers including four from Pat Connaughton who finished with a season-high 16 points and played the final 20 minutes.\n\n\r\n              Kyrie Irving scored 39 while Luka Doncic added 35 for Dallas (9-4).\n\n\r\n              Milwaukee trailed 109-99 with 9:04 left in the game before going on a 13-4 run, including seven from Antetokounmpo to get back within a point with 5:17 remaining.\n\n\r\n              The Bucks caught a break when Doncic missed a pair of free throws that would have given Dallas some breathing room. Antetokounmpo followed by sinking a pair from the line that put Milwaukee up 114-113 while Lillard connected on all three of his free throw attempts after being fouled by Irving to push the Bucks’ lead to four with 4:34 remaining.\n\n\r\n              “At that time in the game, you have to have the ball in the hands of a good decision-maker,” Lillard said. “I just feel like I can get it done at that time, whether I’m scoring, making a play or getting fouled and going to the free throw line.”\n\n\r\n              The Mavericks got within 127-125 on Irving’s three-point play with 1:26 left, but Pat Connaughton hit a 3-pointer 21 seconds later and Dallas, which hit just 3 of 15 3-point attempts while getting outscored 43-27 in the final quarter, couldn’t recover.\n\n\r\n              “We’ve made these shots in the past,” Mavericks coach Jason Kidd said. “We got great looks, they just went in and out but you can’t give up 40-plus points in the fourth quarter and expect to win.”\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Sunday, vs. Sacramento\n\n\r\n              Bucks: Monday, at Washington.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996157.5981572
}