{
  "game_id": "0021301181",
  "espn_id": "400490054",
  "date": "Apr 11, 2014",
  "matchup": "CHI vs. DET",
  "headline": "Bulls overcome 18-point deficit to Pistons, extend win streak to 7",
  "body": "CHICAGO -- They lost their star and they lost one of their best supporting players. The Chicago Bulls never lost their way, though.\nNow, they have home-court advantage for at least one playoff series and the lead in the race for the third seed in the Eastern Conference.\nD.J. Augustin scored 24 points, Taj Gibson added 17, and the Bulls rallied from 18 down to beat the Detroit Pistons 106-98 for their seventh straight win on Friday night.\nCarlos Boozer finished with 18 points. Mike Dunleavy Jr. scored all of his 14 in the second half, and the Bulls kept their longest win streak of the season going.\nThey moved a game ahead of Atlantic Division leader Toronto for third in the East, with the Raptors losing to the New York Knicks. The Bulls also clinched home-court advantage in the first round of the playoffs with Brooklyn falling to Atlanta.\n\"Right now, we're just focused on basketball and making plays for each other, moving forward and getting better,\" Gibson said. \"That's the only thing we're focused on right now. Everything that's gonna come with success is gonna come. But right now, we remember how nobody was on our bandwagon at the beginning of the year, how that felt.\"\nThe bandwagon started to empty out once Derrick Rose tore the meniscus in his right knee in November, cutting short his comeback after the former MVP sat out last season following surgery to repair a torn anterior cruciate ligament in his left knee. There was even more room on it after the Bulls dealt Luol Deng to Cleveland in early January. But rather than come apart, they came together.\nThe Bulls lead the Eastern Conference with 35 victories since Jan. 1, and the latest sure was a wild one.\nThey trailed by 56-38 at the half after getting dominated inside by Andre Drummond but turned things around in a big way after that.\nChicago outscored Detroit 32-24 in the third quarter to pull within 10 and went on a 15-0 run in the fourth to turn an eight-point deficit into a 90-83 edge. The Bulls then hung on in the closing minutes to keep their streak going.\nThey pulled this one out even though they got dominated by Drummond, who scored 26 and tied a career-high with 26 rebounds.\nRodney Stuckey scored 22 points and Brandon Jennings added 17 but the Pistons lost for the 18th time in 20 road games.\n\"Whether you're up 18 or down whatever, you're going to have to come in here and compete,\" Detroit interim coach John Loyer said. \"That team competes on every possession. It's a good learning experience for a lot of our guys.\"\nAugustin had 12 points in the fourth quarter. Gibson scored 11 in the period and had two blocks during the decisive run, which he also started with a pair of free throws with just over 10 minutes left and the Bulls down 83-75.\nGibson then blocked Kyle Singler's 9-foot shot. That led to a 21-foot jumper for Augustin, who followed that with a 19-footer to make it a two-point game.\nGibson then rejected Jonas Jerebko's short jumper, but Augustin quickly got whistled for a charge. He made up for it after a missed 3 by Peyton Siva, when he hit the final two free throws after missing the first to tie it at 83 with 8:10 remaining.\nJimmy Butler then put the Bulls ahead with a layup after Jonas Jerebko missed a 3 for Detroit, and Chicago continued to add to it.\nA three-point play by Gibson, who landed near the photographers along the baseline, and two more free throws by Augustin put the Bulls up 90-83 with 6:14 remaining.\nSiva answered with a 3 for Detroit, but Gibson dunked following a miss by Noah and the Bulls stayed in control the rest of the way.\nChicago's Joakim Noah had six points, 12 rebounds and 10 assists, giving him 408 on the season and putting him in some elite company. He became the ninth player in NBA history -- and third with Chicago -- with at least 400 assists and 100 blocks in a season, joining Kevin Garnett (six times), Sam Lacey (three times), Kareem Abdul-Jabbar (twice), Alex English, Michael Jordan, Scottie Pippen, Alvan Adams and Dwyane Wade.\n\"We can't go forward,\" Noah said. \"We can't think about the playoffs right now.\"\nGame notes\nThe Bulls finish out the regular season with games at New York on Sunday, at home against Orlando on Monday and at Charlotte on Wednesday. ... Chicago coach Tom Thibodeau on the Bulls signing Mike James, Lou Amundson and Ronnie Brewer, who had played for them in the past: \"It gives you more depth for practice, energy, insurance if you take on an injury. And the fact that they've been here before, we think is a plus.\" ... Pistons F Josh Smith missed his third straight game because of tendinitis in his left knee.",
  "source": "espn_api",
  "crawled_at": 1764992612.839521
}