{
  "game_id": "0022300300",
  "espn_id": "401584928",
  "date": "Dec 11, 2023",
  "matchup": "MIL vs. CHI",
  "headline": "Antetokounmpo leads Bucks past Bulls 133-129 in OT",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 32 points and 12 rebounds to lead the Milwaukee Bucks to a 133-129 victory over the Chicago Bulls in overtime Monday night.\n\n\r\n              Brook Lopez and Malik Beasley each had 19 points and Bobby Portis scored 17 for the Bucks, who were coming off a 128-119 loss to Indiana in the semifinals of the In-Season Tournament.\n\n\r\n              DeMar DeRozan had 41 points and Coby White scored 33 for Chicago, which had won four straight. DeRozan also had 11 assists, becoming only the second Bulls player and first since Michael Jordan in 1992-93 with at least 40 points and 10 assists in a game. Jordan did it nine times in his career.\n\n\r\n              Torrey Craig hit the second of two free throws to put Chicago up 119-118 to open overtime, but the Bucks answered with seven straight points, capped by Antetokounmpo’s layup to make it 126-119 with two minutes remaining.\n\n\r\n              Milwaukee left the door open, though, by missing three of six free throws down the stretch. DeRozan scored on a dunk to pull Chicago within 131-129 with 12 seconds left before Damian Lillard hit two free throws with 10.2 seconds remaining to make it 133-129.\n\n\r\n              “The Bulls played a terrific game,” Bucks coach Adrian Griffin said. “Every time we thought we had them down, they kind of fought and clawed back in the game. But when we need to get stops, we get stops. I thought that was encouraging.”\n\n\r\n              Antetokounmpo was 3 of 5 from the field and 6 of 8 from the free-throw line through three quarters. He shot 5 of 7 in the fourth quarter and went 5 for 6 at the line. He made his only shot in overtime, along with going 3 of 4 on free throws.\n\n\r\n              “There’s going to be teams around the league that I’m going to draw so much attention, which sometimes me taking a shot over two guys is not the best shot,” Antetokounmpo said. “Me trying to play in the crowd is not the best shot. I think I’ve got to the point where I’ve accepted that.”\n\n\r\n              DeRozan forced overtime, dropping in a floater from the lane with four seconds left in regulation to tie it at 118. Just before that, Lillard made one of two free throws to leave Milwaukee up 118-116 with 12 seconds remaining.\n\n\r\n              Antetokounmpo hit two free throws to put the Bucks up 117-112 with 1:11 to go. Patrick Williams answered with a dunk and DeRozan hit a pair of free throws to pull the Bulls to 117-116.\n\n\r\n              “I was really proud of the way these guys competed and fought and battled all the way through,” Bulls coach Billy Donovan said. “We got down by double digits, we came back several times. In overtime, we had some plays around the basket, we just couldn’t finish.”\n\n\r\n              Chicago, which trailed 74-65 at halftime, pulled to 91-89 on Jevon Carter’s 3-pointer at the end of the third quarter.\n\n\r\n              The Bucks shot 57.8% in the first half. Milwaukee hit 26 of 45 attempts, including 12 of 20 from beyond the arc.\n\n\r\n              Antetokounmpo took only two shots in the first half, making one, but had all six of his assists.\n\n\r\n              “He was playing a great game,” Griffin said. “He was moving the ball, sharing the ball, making the right play. He’s a veteran and he knows when to assert himself. In the second half, I thought he did a great job.”\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host the Denver Nuggets on Tuesday.\n\n\r\n              Bucks: Host the Indiana Pacers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996147.239228
}