{
  "game_id": "0022201010",
  "espn_id": "401469165",
  "date": "Mar 11, 2023",
  "matchup": "MEM vs. DAL",
  "headline": "Roddy leads fourth-quarter rally as Grizzlies beat Mavericks",
  "body": "MEMPHIS, Tenn. -- — Rookie David Roddy scored a career-high 24 points, including 17 points in the fourth quarter, as the Memphis Grizzlies rallied for a 112-108 victory over the short-handed Dallas Mavericks on Saturday night.\n\n\r\n              Roddy connected on 7 of 8 shots in the fourth, including 3 of 4 from outside the arc. Desmond Bane led the Grizzlies with 25 points, while Jaren Jackson Jr. finished with 14 points. \n\n\r\n              But it was Roddy's play that helped the Grizzlies overcome an 11-point deficit early in the fourth quarter after trailing 83-77 at the end of the third. He would finish the game 10 of 13 from the field, including connecting on 4 of 7 from outside the arc as Memphis outscored Dallas 35-25 to erase the Mavericks' lead.\n\n\r\n              “We really just needed energy coming out of that third quarter,” Roddy said, adding: “I knocked down a few shots and got into a rhythm. Whenever I had the opportunity, I took it.”\n\n\r\n              Mavericks coach Jason Kidd said his team had some turnovers down the stretch and “fouled a little too much in the fourth.\"\n\n\r\n              “We put ourselves in a position to win a game on the road,” Kidd said, “but you've got to take care of the ball, and you've got to get stops. Those are two things we just didn't do late.”\n\n\r\n              Tim Hardaway Jr. lead the Mavericks with 23 points, while Jaden Hardy finished with 22. Josh Green added 21 points and 10 rebounds for Dallas.\n\n\r\n              Two of the NBA's biggest stars — the Mavericks' Luka Doncic and Memphis' Ja Morant — were absent from the game. Doncic has a left thigh strain, while Morant is away from the team after posting a video last weekend in which he appeared to be displaying a gun at a Denver-area strip club.\n\n\r\n              That eliminated the top scorers from the two Western Conference teams. Then Dallas' Kyrie Irving was a late scratch with right foot soreness.\n\n\r\n              “We played hard, and we gave ourselves a chance to win without our top two dogs,” Hardy said.\n\n\r\n              After trailing 56-50 at the break, Hardaway had 13 points in the third as Dallas outscored the Grizzlies 33-21.\n\n\r\n              And the Mavericks continued to extend the lead to open the fourth. That's when Roddy and the Grizzlies were able to turn the tide down the stretch.\n\n\r\n              “He was a huge spark for us,” Memphis coach Taylor Jenkins said of Roddy from Colorado State, the 23rd pick in last summer's draft. “The winning plays that he made along with the rest of that group in the fourth quarter was the deciding factor.”\n\n\r\n              TIP-INS \n\n\r\n              Mavericks: Hardy started his first NBA game at G. ... Defeated the Grizzlies 137-96 in Dallas' home opener this season. ... Are 12-21 on the road.\n\n\r\n              Grizzlies: Tyus Jones recorded his 2,000th career assist in the second quarter. ... Snapped a four-game losing streak to Dallas. ...Roddy's previous high was 15 against Milwaukee on Dec. 15.\n\n\r\n              MORE ADVICE FOR MORANT\n\n\r\n              The troubles with Morant continue to be the talk of the league, whether its questions from the media or responses from coaches. The Grizzlies guard is expected to be away from the team at least two more games.\n\n\r\n              Prompted by a question, Kidd said sometimes young players are given high status too early. He said it is important for Morant to have someone to talk to without any negativity and provide the right advice. “Hopefully, with the time away from the team, he will become stronger on and off the floor, and he will be able to share his story to become a leader and a mentor.”\n\n\r\n              UP NEXT\n\n\r\n              The two teams play each other in Dallas on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994174.311135
}