{
  "game_id": "0021600393",
  "espn_id": "400899835",
  "date": "Dec 16, 2016",
  "matchup": "CHI vs. MIL",
  "headline": "Antetokounmpo, Bucks roll past Bulls again, 95-69",
  "body": "CHICAGO --  A day later, Giannis Antetokounmpo and the Milwaukee Bucks ran right by the Chicago Bulls again.\n\nAntetokounmpo had 22 points, 11 assists and seven rebounds, and the Bucks routed the Bulls 95-69 on Friday night for a sweep of their home-and-home series.\n\nIt was a nearly identical copy of Milwaukee's 108-97 win Thursday night, except there was no closing push by Chicago this time. Led by Antetokounmpo, the younger and more athletic Bucks had six players score in double figures and shot 46 percent from the field, compared to 30 percent for the weary Bulls.\n\n\"We talked about it: We would like to duplicate what we did in Milwaukee,\" Bucks coach Jason Kidd said. \"I thought our guys came out with that same intent to share the ball, move guys around. I think rebounding the ball and our defense put us in position to win a game on the road against a very talented team.\"\n\nAntetokounmpo also had three steals and blocked a shot. His streak of 30-point games ended at two, but he watched the last couple of minutes from the bench with Milwaukee in complete control.\n\nThe 22-year-old Antetokounmpo is averaging 27.5 points, 10.5 rebounds and 6.5 assists in his last four games.\n\n\"For me, I'm just starting to figure it out,\" he said.\n\nGreg Monroe added 14 points and 12 rebounds, and fellow reserve Mirza Teletovic finished with 13 points. The Bucks (13-12) had dropped four of five before the pair of wins against the Bulls.\n\nChicago (13-13) lost for the sixth time in eight games in the opener of a three-game homestand. Nikola Mirotic did not play for the second straight night after he missed the pregame walkthrough, and Taj Gibson exited in the third quarter with a bruised right hip.\n\n\"Where they exposed us last night, they got us again early tonight with rebounding, points off turnovers and not getting back and building a wall defensively,\" coach Fred Hoiberg said. \"A couple of times not getting back and not getting matched up. It's as simple as that.\"\n\nDwyane Wade scored 12 points for the Bulls, booed off the floor as the final seconds ticked off. Jimmy Butler was held to seven on 3-for-14 shooting.\n\n\"I think I've got to play better, but that's what tomorrow's for, getting in the gym and figuring it out,\" Butler said.\n\nAntetokounmpo scored 10 points to help Milwaukee to a 34-15 lead after one quarter, and he was only getting started. He had a rim-rocking dunk for a 53-31 advantage with 2:17 left in the first half, and Jabari Parker followed with a drive right by Doug McDermott for an easy layup.\n\nAntetokounmpo added a pretty lob to John Henson for a dunk in the third, and then shook the basket again on another vicious slam in the fourth, drawing a technical for hanging on the rim.\n\nMISSING MIROTIC\n\nMirotic said he forgot about the walkthrough, and he apologized to his teammates and Hoiberg.\n\nMirotic was fined for the unexcused absence, and said it had nothing to do with not playing Thursday night.\n\n\"No, I'm not that kind of guy. Even if things are not like how I would like them to be, I'm very professional,\" he said. \"It's not my first year here. Those guys respect me and I respect them. I would never do that, something like that.\"\n\nTIP-INS\n\nBucks: Parker, a Chicago native, had 12 points on 6-for-8 shooting. ... F Michael Beasley missed his second straight game with a left foot sprain. ... The Bucks had dropped their last five games at the United Center.\n\nBulls: The 69 points were a season low. ... G Michael Carter-Williams got the cast off his injured left wrist and said he is hoping to practice next week. \"It feels pretty good,\" he said. \"I still have to do some strengthening and things like that. Nothing is guaranteed, but that's what I'm going for.\" ... Bobby Portis had 10 points and eight rebounds. He was the only Bulls player besides Wade to score in double figures.\n\nUP NEXT\n\nBucks: Host LeBron James and the Cavaliers in the opener of another home-and-home on Tuesday night. The Bucks then visit Cleveland on Wednesday night.\n\nBulls: Host the Detroit Pistons on Monday night. The Bulls lost 102-91 at Detroit on Dec. 6.\n\n---\n\nJay Cohen can be reached at http://www.twitter.com/jcohenap",
  "source": "espn_api",
  "crawled_at": 1764995077.292725
}