{
  "game_id": "0021900573",
  "espn_id": "401161215",
  "date": "Jan 10, 2020",
  "matchup": "PHX vs. ORL",
  "headline": "Booker's late 3-pointers help Suns past Magic 98-94",
  "body": "PHOENIX --  Two deflating losses in their previous two home games had the Phoenix Suns doing some soul-searching going into Friday night.\n\nThen, defense and clutch shooting in the final minute got them a much-needed win.\n\nDevin Booker scored 24 points, including late back-to-back 3-pointers, and Ricky Rubio came up with a steal and a free throw to help the Suns rally past the Orlando Magic 98-94.\n\nBooker had scored only two points in the second half before hitting a 3-pointer with 52.9 seconds left that cut Orlando's lead to 94-93. He then hit a another 3-pointer with 36 seconds left. On defense, Rubio stole the ball from Nikola Vucevic with 16.7 seconds remaining.\n\n“Determination, desperation, obviously we've been needing one,” Booker said. He'd gotten an important steal of his own after his first 3 of the final minute.\n\n“I was just in the moment. I got a steal, felt the open shot for the two-for-one so I took it and it went in,” Booker said.\n\nThe Suns scored the final eight points of the game after Vucevic knocked down a 3 from the top of the arc with 59.4 seconds left, giving the Magic a 94-90 lead, Orlando's largest of the game.\n\nMagic coach Steve Clifford wanted a foul when Vucevic backed down Booker in the paint before Rubio's steal.\n\n“Not even close,” Clifford said. “He (Booker) fouled him twice, the second one was a slap and that's got to be called.\n\n\"We played hard enough, we did some good things, that's got to be called.”\n\nKelly Oubre Jr. scored 22 points and Rubio added 11 points, 10 assists and three steals, giving him 1,001 for his career.\n\nEvan Fournier led Orlando with 28 points, 16 in the second half. Vucevic added 18 points and 13 rebounds, and Terrence Ross scored 18 off the bench.\n\n“It's unfortunate that we had the lead with 58 seconds left and we couldn't hold on to it,” Vucevic said.\n\nPhoenix led by as many as 11 points in the third quarter, but the Magic roared back, taking their first lead of the game at 69-68 on a 3-pointer and two free throws by Fournier.\n\nThe Suns took a 77-75 lead when Deandre Ayton hit a short hook shot just before the buzzer at the end of the third. But Orlando scored the first six points of the fourth on 3s by Fournier and Josh Magette, It was Magette’s only basket of the game.\n\nThe game was mostly back-and-forth, with the exception of a few double-digit leads for the Suns.\n\nOff a blocked shot from Cam Johnson at the defensive end, Mikal Bridges took the ball coast to coast for a layup and a 27-25 lead the Suns carried into the second quarter.\n\nRoss bowled over Aron Baynes and put in a wild shot off the glass to cut the Suns’ lead to 40-38 at the 5:46 mark of the second. Markelle Fultz had 13 points and Ross 12 in the first half.\n\nBooker forced Fournier to lose his balance on defense, then swished a step-back 3 that gave Phoenix its largest lead of the first half, 10 points at 58-48, with 33 seconds to go.\n\nThe Suns took that lead into halftime. Booker scored 16 first-half points and Oubre 13.\n\n“We are not going through a good stretch and results shouldn't help that way, but it does,\" Rubio said. “It means we did the right thing. I'm happy how it happened, too, because it came down the stretch and we were locked in.”\n\nThe 94 points allowed and 37.1 field goal percentage were season lows for the Suns' defense. Booker led the Suns in scoring for the sixth straight game.\n\nTIP-INS\n\nMagic: F Aaron Gordon sat out with a right calf injury he sustained against the Washington Wizards on Wednesday. … G D.J. Augustin also missed the game with a left knee injury. … Wes Iwundu and Khem Birch started at the two forward spots for Orlando, with Jonathan Isaac and Gordon out due to injuries.\n\nSuns: Coach Monty Wiliams, in discussing the development of young centers during pregame comments: “I wish everyone could be Shaq. Everybody is not 7-1, 335 and can dance.” … F Frank Kaminsky III missed his sixth straight game with a stress fracture in his right knee. … Baynes got the start at center over former No. 1 overall pick Ayton, who’d started the previous three games. Ayton finished with 13 points and 9 rebounds.\n\nSWAT INTO THE SEATS\n\nOubre sent a Ross 3-point try into the seats behind the Suns bench with an emphatic block. The sound of hand hitting ball brought players and fans out of their seats with 6:53 left in the third quarter.\n\nUP NEXT\n\nMagic: Orlando plays at Sacramento on Monday, the second game of a six-game trip.\n\nSuns: Phoenix hosts Charlotte on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996559.56721
}