{
  "game_id": "401809234",
  "espn_id": "401809234",
  "date": "Oct 22, 2025",
  "matchup": "NY vs CLE",
  "headline": "Anunoby, Brunson lead Knicks to a 119-111 victory over the Cavaliers in Mike Brown's first game",
  "body": "NEW YORK -- — OG Anunoby had 24 points and 14 rebounds, Jalen Brunson scored 23 points and the New York Knicks beat the Cleveland Cavaliers 119-111 on Wednesday night in their first game under coach Mike Brown.\n\n\r\n              Karl-Anthony Towns added 19 points and 11 rebounds for the Knicks, who had a 17-point lead in the first half, fell behind after Donovan Mitchell led a comeback, then regained the lead for good with a 14-0 run early in the fourth quarter.\n\n\r\n              Mitchell finished with 31 points, 21 in the third quarter, but the Cavaliers couldn't pull out the win after starting last season with 15 straight en route to a 64-18 record, best in the Eastern Conference. Evan Mobley added 22 points and eight rebounds.\n\n\r\n              The Cavs and Knicks are expected to be two of the top contenders in the East, though neither is ready to look like it yet. The Knicks are without center Mitchell Robinson (left ankle injury management) and Josh Hart (lower back spasms).\n\n\r\n              The Cavs started the season with All-Star Darius Garland and swingman Max Strus recovering from offseason foot surgeries and on Wednesday were also without forward De'Andre Hunter, who averaged a league-high 16.9 points off the bench last season, because of a bruised right knee.\n\n\r\n              Brown took over when the Knicks surprisingly decided to fire Tom Thibodeau despite reaching the Eastern Conference finals for the first time since 2000. \n\n\r\n              Mikal Bridges hit all four shots and scored 10 points in the first quarter, helping New York lead 33-23. A 10-0 run late in the first half gave the Knicks their biggest lead at 63-46 before Mitchell, who had been quiet, had a couple free throws and a basket to give himself some momentum for his big third. \n\n\r\n              Up next\r\n              Cavaliers: Visit Brooklyn on Friday.\n\n\r\n              Knicks: Host Boston on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042475.5888379
}