{
  "game_id": "0022000868",
  "espn_id": "401307665",
  "date": "Apr 19, 2021",
  "matchup": "CLE @ DET",
  "headline": "Late baskets from Jacksons lead Pistons over Cavs, 109-105",
  "body": "DETROIT -- — Frank Jackson scored 20 points, including a tiebreaking baseline drive in the final minute, lifting the Detroit Pistons to a 109-105 victory over the Cleveland Cavaliers on Monday night.\n\n\r\n                    Jackson was fouled on his basket with 29 seconds left. He missed the free throw but the Cavaliers couldn’t secure the rebound. Josh Jackson grabbed it and then scored to go up 107-103 with 16.5 seconds remaining, giving the Cavaliers their fifth loss in six games.\n\n\r\n                    Collin Sexton scored 28 points and Darius Garland added 23 for the Cavaliers. The backcourt scored the final 20 points for Cleveland, which is fading in the race for the play-in tournament in the Eastern Conference.\n\n\r\n                    Saddiq Bey scored 20 points for the Pistons, who started three rookies and a second-year player making his first career start.\n\n\r\n                    “The young guys executed, both defensively and offensively, got stops when we needed and made some good plays,” Pistons coach Dwane Casey said. “That’s what we were looking for, making sure we executed and took care of business.”\n\n\r\n                    The youngsters flew around early, playing an exciting brand of basketball with rookie point guard Killian Hayes leading the way.\n\n\r\n                    “We’re just playing to our strengths. We’ve got a lot of young, athletic guys, a lot of guys that thrive in the open court,” forward Tyler Cook said. “That’s something that we’re good at, so we wanted to make that emphasis today.”\n\n\r\n                    Cook made his first career start and had a career-high 12 points, all on dunks.\n\n\r\n                    Bey made his first six 3-pointers, all in the first quarter. He had a personal 12-0 run on four 3-pointers during a 21-3 spurt early that gave Detroit a 32-9 lead.\n\n\r\n                    “To me all that other stuff that happened afterwards is irrelevant,” Cavs coach J.B. Bickerstaff said. “It’s a conversation about approach and a maturity level that we’ve yet to reach. The thought that we wouldn’t come out tonight and play spirited basketball is disappointing.”\n\n\r\n                    Cleveland was outscored 30-6 on 3-pointers in the first half but whittled the halftime deficit to 62-53.\n\n\r\n                    The Cavaliers tightened up the 3-point defense after that, keeping Detroit scoreless beyond the arc for the entire second half.\n\n\r\n                    Cleveland had the deficit down to two until Frank Jackson scored the last six points in the quarter to put Detroit up 84-76.\n\n\r\n                    The Cavaliers scored the first six points of the fourth and finally took their first lead on Garland’s 3-pointer with 6:19 remaining, going up 92-90.\n\n\r\n                    Rookie Isaiah Stewart was strong inside again, as his hook shot put the Pistons up 103-101 with 57 seconds left.\n\n\r\n                    Garland drove for a score to tie it for the final time.\n\n\r\n                    Stewart had 16 points and 16 rebounds for Detroit, while Josh Jackson added 16 points. Hayes added 12 points and a career-high nine assists.\n\n\r\n                    Kevin Love scored 15 points for Cleveland, while Isaiah Hartenstein added 13 and Taurean Prince had 11.\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: Larry Nance Jr. was out for personal reasons, and coach J.B. Bickerstaff said he had nothing to add to that before the game. Nance missed seven games recently before returning for the last three.\n\n\r\n                    Pistons: Only 10 players dressed for the Pistons and nine played, as Sekou Doumbouya (concussion), Wayne Ellington (rest), Jerami Grant (left quad contusion), Cory Joseph (bronchitis), Rodney McGruder (right elbow sprain), Mason Plumlee (rest) and Dennis Smith Jr. (left knee soreness) were held out.\n\n\r\n                    COOKING UP REVENGE\n\n\r\n                    Detroit’s Cook notched his career high against his former team in his first career start.\n\n\r\n                    Undrafted out of Iowa, Cook played 11 games with Cleveland last season.\n\n\r\n                    “It’s been a long journey for me,” Cook said. “For me to have a team and a front office and GM that believes in me, a coaching staff that believes in me too and all my teammates, means a lot.\n\n\r\n                    “I’m glad I got that opportunity and I’m glad that it resulted in a win for us.”\n\n\r\n                    RECORD HUNTING\n\n\r\n                    Bey set the NBA rookie record for most games with six or more 3-pointers with five.\n\n\r\n                    The Villanova rookie broke his own franchise record for 3-pointers made in a quarter by a rookie with six in the first. He was one shy of the all-time NBA mark for a rookie set by Coby White of Chicago last season.\n\n\r\n                    Bey’s 18 points in the first quarter were the most in any quarter for a Pistons’ rookie since 2012.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Host the Chicago Bulls on Wednesday.\n\n\r\n                    Pistons: Visit the Dallas Mavericks on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764997870.521431
}