{
  "game_id": "0021500952",
  "espn_id": "400828839",
  "date": "Mar 09, 2016",
  "matchup": "MIL vs. MIA",
  "headline": "Antetokounmpo scores 24 points, Bucks beat Heat 114-108",
  "body": "MILWAUKEE --  Khris Middleton and the Milwaukee Bucks held off the streaking Miami Heat.\n\nMiddleton made four free throws in the closing seconds to help the Bucks beat the Heat 114-108 on Wednesday night.\n\n\"We just wanted to stay with it, execute down the stretch,\" Middleton said. \"We haven't been doing that lately. We finally got back to doing it, and it worked out for us.\"\n\nGiannis Antetokounmpo scored 24 points, Jabari Parker added 23 points, Middleton had 22, and Miles Plumlee scored a season-high 18 for the Bucks. They snapped the Heat's winning streak at five games.\n\n\"I'm happy the whole team really showed up,\" Plumlee said. \"We played with a lot of energy. We played together and played the right way.\"\n\nThe Heat hadn't lost since signing Joe Johnson as a free agent on Feb. 27 after he was waived by the Brooklyn Nets. The big lift he had given Miami didn't materialize against the Bucks. He finished with 11 points.\n\nLuol Deng had 20 points and 11 rebounds for Miami. Hassan Whiteside added 23 points and 13 rebounds, and Dwyane Wade, playing with five fouls, had 18 points.\n\nAfter Wade scored on a fast-break layup to cut it to 110-106, Middleton made two free throws. Joe Johnson scored off a pass from Wade, but Middleton answered with two more free throws.\n\n\"I felt we didn't play our best game,\" Wade said. \"We took a lead and had control of the game. Then, it just went another way after that.\"\n\nDeng's 3-pointer gave the Heat a 92-89 lead early in the fourth, but Plumlee and Antetokounmpo sparked an 8-0 run that put the Bucks ahead 97-92 with 6:07 to play. Plumlee made both free throws after Justise Winslow was called for a Flagrant Type 1 foul. Antetokounmpo added a layup and a floater in the lane as the Bucks regained control. After Wade hit a jumper, Antetokounmpo scored on a putback.\n\n\"It was a normal rebound,\" Winslow said. \"I don't know if he ran into my elbow, or if I hit him. Whatever, I made contact. If you hit him in the head, you're most likely, probably going to get a flagrant. It wasn't intentional. I didn't swing my elbow.\"\n\nHOT SHOOTING\n\nMilwaukee and Miami were both 42 for 80 (52.5 percent) from the floor. The Bucks improved to 11-6 while the Heat fell to 8-3 when shooting 50 percent or better.\n\nTIP-INS\n\nHeat: Whiteside had two of the Heat's three blocked shots in the first half. ... C Amare Stoudemire picked up a technical 30 seconds into the game after jawing at Antetokounmpo. The two got tangled up fighting for a rebound under the Heat basket.\n\nBucks: Coach Jason Kidd juggled his starting lineup, again. C Greg Monroe, who had come off the bench the previous 12 games, started. G Jerryd Bayless made his eighth start of the season, filling in for O.J. Mayo, who was out with a stomach virus. ... Milwaukee was 6-6 with Monroe in a reserve role. ... The Bucks hope to have F John Henson (sore lower back) out on the practice floor by the weekend. He has missed 18 games.\n\nUP NEXT\n\nHeat: Play at Chicago on Friday night.\n\nBucks: Host New Orleans on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994017.6802518
}