{
  "game_id": "0022200424",
  "espn_id": "401468579",
  "date": "Dec 15, 2022",
  "matchup": "MIA @ HOU",
  "headline": "Herro hits 10 3s, scores career-high 41 points for Heat",
  "body": "HOUSTON -- — Tyler Herro matched the Miami record with 10 3-pointers and scored a career-high 41 points to help the Heat beat the Houston Rockets 111-108 on Thursday night.\n\n\r\n              A night after making nine 3-pointers and scoring 35 points in a victory at Oklahoma City, Herro became the fourth Heat player to hit 10 3s in a game — a feat most recently accomplished by Duncan Robinson on Dec. 10, 2019.\n\n\r\n              “I didn’t know it was the record until last night when I hit nine, and they said I was one short,” Herro said. “I didn’t have any intention of coming in to tie the record, but I was just trying to get 3s up. I think shooting more 3s is helping.”\n\n\r\n              Herro was 10 of 15 from 3-point range and 13 of 20 overall. He also had six rebounds. \n\n\r\n              “The last couple of games, that’s been really the scheme against him,” Heat coach Erik Spoelstra said. “That’s been open. But regardless, he’s too good of a shooter for us to not take 3s off the catch. He has to continue to be assertive in those opportunities. He’s just a brilliant shooter. He can do it off the dribble and off the catch.”\n\n\r\n              Jimmy Butler added 20 points, 10 rebounds and seven assists, and Caleb Martin had 13 points. Miami has won three straight to improve to 15-15.\n\n\r\n              Jalen Green led Houston with 22 points on 8-of-21 shooting. Kevin Porter Jr. added 21, Jabari Smith Jr. had 15 points and 11 rebounds, and Alperen Sengun finished with 12 points.\n\n\r\n              Herro had 25 first-half points, carrying the Heat to a 37-point second quarter where they took a 14-point halftime lead.\n\n\r\n              The Rockets rallied back in the third quarter, cutting Miami’s lead to 86-85 entering the fourth.\n\n\r\n              Porter missed a 3 in the closing seconds that would have tied it.\n\n\r\n              “Any shot I put up, I feel like I can make,” Porter said. “Personally, I would have liked it in the flow of that rebound on that last stop, but we had to play against a set defense, and Miami is good when they get a chance to set their defense up. It was a tough shot I can make. I missed it.” \n\n\r\n              Porter was referencing a timeout that Rockets coach Stephen Silas called when the team was in transition following a rebound with less than 15 seconds remaining. There were 12.7 seconds remaining for the Rockets’ final possession where Porter’s attempt to tie the game rimmed out. \n\n\r\n              “It was definitely encouraging to give the fight that we did at the end of the game,” Silas said. “Our late-game defense has been really good. But the way the first half went, where there were 50-50 balls and hustle plays that we weren’t getting, that’s not us.”\n\n\r\n              Miami was playing without Bam Adebayo, who was dealing with a left ankle sprain. The Heat also were missing Kyle Lowry (rest), Dewayne Dedmon (left foot plantar fasciitis), Nikola Jovic (back spasms) and Victor Oladipo (left knee injury management).\n\n\r\n              Miami’s pregame injury report also mentioned Butler, who missed the last game for right knee management, Herro, Robinson, Martin and Max Strus for various injuries, but those five played in the game.\n\n\r\n              TIP-INS\n\n\r\n              Heat: Spoelstra received a technical in the second quarter after yelling at the officials. Udonis Haslem and Strus later received technical fouls in the third quarter for talking to officials. … Rookie Orlando Robinson had nine points off the bench.\n\n\r\n              Rockets: Coach Stephen Silas received a technical in the third quarter after yelling at the officials. … The Rockets outrebounded the Heat 50-40, thanks in part to Smith’s and Usman Garuba’s eight in 20 minutes off the bench.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Vs. San Antonio in Mexico City on Saturday night.\n\n\r\n              Rockets: Host Portland on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993976.230601
}