{
  "game_id": "0022400914",
  "espn_id": "401705480",
  "date": "Mar 08, 2025",
  "matchup": "IND @ ATL",
  "headline": "Trae Young scores 36 points and Hawks hold off Pacers rally for 120-118 win",
  "body": "ATLANTA -- — Trae Young had 36 points and Caris Lavert added 26 off the bench as the Atlanta Hawks held off the Indiana Pacers 120-118 on Saturday night for their third win in four games.\n\n\r\n              Oneka Okongwu had 16 points and 16 rebounds for the Hawks.\n\n\r\n              The Hawks led by 20 points after the first quarter and 17 at halftime, but the Pacers took the lead midway through the fourth quarter before Atlanta made the key plays down the stretch.\n\n\r\n              Bennedict Mathurin had 30 points for the Pacers after missing four games with a wrist injury. Pacers All-Star Tyrese Haliburton, who entered the game fourth in the NBA in assists at 8.9 per game, missed his second straight game with a hip strain. Pascal Siakim had 23 points.\n\n\r\n              Young left the game with 2:58 to play in the third quarter with an apparent thigh injury, but he returned four minutes later. He favored his left leg the rest of the game, but still managed 10 points and three assists in the fourth quarter.\n\n\r\n              Takeaways\r\n              Pacers: Indiana put together a strong second-half rally without their best player, but they could not finish off the comeback.\n\n\r\n              Hawks: Pacers coach Rick Carlisle said he thought the Hawks improved their team at the trade deadline, and Lavert backed up that assessment with his big night off the bench.\n\n\r\n              Key moment\r\n              With Indiana trailing 119-116 with 7.4 seconds left, the Pacers drove the length of the floor and Siakim dunked with less than a second remaining instead of having someone attempt a 3-pointer.\n\n\r\n              Key stat\r\n              Dyson Daniels’ five steals give him 178 for the season, which is the most of any player since Ricky Rubio had 191 in the 2013-14 season.\n\n\r\n              Up next\r\n              The Hawks will host the Sixers on Monday night in the fifth game of a seven-game homestand. The Pacers will visit the Bulls on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998125.382137
}