{
  "game_id": "0021800329",
  "espn_id": "401071010",
  "date": "Nov 30, 2018",
  "matchup": "POR vs. DEN",
  "headline": "Harris has 27 and Nuggets edge Blazers 113-112",
  "body": "PORTLAND, Ore. --  With some three minutes left in a tight game against the Portland Trail Blazers, Paul Millsap gathered the Denver Nuggets for a pep talk.\n\nNuggets coach Michael  Malone set the scene, explaining that Millsap \"went out and grabbed the guys in the huddle and said `We've talked about being a playoff team but if we're really going to be a playoff team this is one we need to get.\"\n\nThe Nuggets, who had led by as many as 17 in the game, went on to withstand a frenzied final few minutes to edge the Blazers 113-112 on Friday night. It was Denver's fifth straight win.\n\nMillsap finished with 22 points and 10 rebounds while Gary Harris, who missed Denver's last two games with a sore left ankle, had 27 points -- including a crucial 3-pointer in the final minute.\n\nBut Harris also pointed to the words the normally reserved Millsap said to the team in the huddle as the difference in the game.\n\n\"He said if we're gonna be a playoff team it's time to show everybody. For him to open his mouth like that it shocked a lot of people,\" Harris said. \"That was big and it got us over the hump. He's our vet. He's our leader.\"\n\nCJ McCollum had 33 points, but missed a jumper at the final buzzer as the Blazers came up just short. Jusuf Nurkic added 17 points and 11 rebounds for Portland, which has lost four of its last five games.\n\nThe Blazers started to chip away at Denver's lead late in the third quarter. McCollum's jumper got Portland within 98-97 with 6:04 left but Monte Morris answered with a 3-pointer for the Nuggets and the Blazers couldn't get any closer until Nurkic's basket with 1:30 left counted on a goaltending call to close the gap to 108-106.\n\nMcCollum added step-back jumper to tie it at 108 with less than a minute left.\n\nJamal Murray made a pair of free throws for Denver before McCollum came through again with a layup to re-tie it with 37.1 seconds left -- but Harris nailed a corner 3-pointer to put the Nuggets in front 113-110.\n\nMcCollum dunked on the other end and Murray was called out of bounds after the inbound to give Portland back the ball. After a review, the call was overturned.\n\nThe game clock was re-set to 6.9 seconds and Murray was again called out of bounds on the inbound, but McCollum's jumper at the buzzer was off to end it.\n\n\"I saw CJ and he got a good look, it just didn't fall,\" Damian Lillard said about the final play. \"A lot of things we could have done to not be in that position, but we had our shot. It just didn't fall.\"\n\nIt was the first of a five-game road trip for the Nuggets, who were coming off of a 117-85 victory at home over the L.A. Lakers.\n\nHarris hit a 3-pointer that capped a 14-2 run that put the Nuggets in front 28-17 late in the first quarter. Denver led by as many as 14 points in the opening period.\n\nMeyers Leonard had an emphatic dunk over Mason Plumlee as Portland struggled to close the gap. McCollum got the Blazers within single digits with a layup that made it 53-45, but Harris' layup and free throw extended Denver's lead again.\n\nMillsap had 16 first-half points and the Nuggets went into the break with a 68-53 lead.  Portland was hurt by 10 turnovers.\n\nThe Trail Blazers snapped a three-game losing streak with a 115-112 victory over Orlando on Wednesday. Lillard had 41 points in the game, including a franchise-record 10 3-pointers. But against the Nuggets he was cold at the start with just five first-half points. He finished with 15.\n\nTIP INS:\n\nNuggets: It was the first of four games between the two teams this season. Denver won last year's series 3-1. ... The Nuggets held opponents under 100 points in each of the previous three games.\n\nTrail Blazers: Nurkic played for the Nuggets for more than two seasons before he was traded to Portland in early 2017. ... Portland has lost four straight to the Nuggets.\n\nENEMY TERRITORY: \"I like when the crowds really going. It gets me going. It gets me excited to hush them up. I've always been that guy. I like playing in hostile environments. When they get loud it gets me going. It's amazing,\" Harris said.\n\nUP NEXT\n\nThe Nuggets visit Toronto on Monday.\n\nThe Trail Blazers visit San Antonio on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995191.532939
}