{
  "game_id": "0022000229",
  "espn_id": "401267389",
  "date": "Jan 22, 2021",
  "matchup": "CHA vs. CHI",
  "headline": "LaVine continues strong play, leads Bulls past Hornets",
  "body": "CHARLOTTE, N.C. -- — Zach LaVine is proving he can be an elite scorer in the NBA.\n\n\r\n                    But what Bulls coach Billy Donovan likes the most about the seven-year veteran is that he's raising the game of others and helping his team win.\n\n\r\n                    LaVine, who has established himself as Chicago's main scoring option, continued his strong and balanced play with 25 points, nine assists and six rebounds to lead the Bulls to a 123-110 victory over the Charlotte Hornets on Friday night.\n\n\r\n                    “I think he understands that he has to lift up the level of play of the team,” Donovan said. \"The sign of a great player is a player that makes everyone else around them better and I thought that he made some really great passes and got guys some open looks. Everybody knows he can score. Can he raise up the group around him?”\n\n\r\n                    LaVine, who had averaged 32.2 points over his previous five games, converted on 8 of 12 shots from the field and made all six foul shots. He repeatedly made the right plays, setting up his teammates for open looks while running the break and dishing out assists.\n\n\r\n                    “A little bit is me understanding that over the last three years, you cannot go by yourself,” LaVine said. “I think I took a step in the right direction in the offseason looking at how I can help my teammates get better. Trust and having guys healthy helps a lot. ... I am trying to read the game. We are creating a lot of open shots, so it has been good.”\n\n\r\n                    Lauri Markkanen chipped in with 23 points and Coby White added 18 points and eight assists as the Bulls won their third straight.\n\n\r\n                    “We all know he can score, but he's doing a good job of getting others involved,” Markkanen said of LaVine. “He's doing a really good job all around.”\n\n\r\n                    Gordon Hayward scored 34 points for the Hornets and Devonte Graham had a season-high 24 points, 22 of those coming in the first half. But the Hornets committed 20 turnovers, leading to 26 Bulls points, as they dropped their fourth straight.\n\n\r\n                    Hornets coach James Borrego said he needs more production beyond what he's getting from Hayward.\n\n\r\n                    “To say ‘Gordon, go save us every single night from start to finish,’ that’s not what we’re looking for,” Borrego said. “Other guys have got to step up and play better.”\n\n\r\n                    The Hornets trailed most of the game before cutting the lead to six with four minutes to go. But Markkanen slammed home an inside feed from Thaddeus Young and LaVine buried a 3-pointer from the left wing to push the lead back to double digits.\n\n\r\n                    SHARING THE BALL\n\n\r\n                    The Bulls finished with 33 assists. \n\n\r\n                    \"I think we are doing a good job of sharing the ball and taking the open looks,\" Markkanen said.\n\n\r\n                    ZELLER'S RETURN\n\n\r\n                    Hornets center Cody Zeller was back on the floor after missing the last four games with a broken bone in his left hand. Zeller didn't start, played 11 minutes and scored five points and had three rebounds.\n\n\r\n                    At times he looked out of sync with his teammates.\n\n\r\n                    “Moving forward, I’ve got to figure out rotations and what’s best for our ball club,” Borrego said. “It was good to have him back out there on the floor.”\n\n\r\n                    TIP INS\n\n\r\n                    Bulls: Shot 57% and scored 38 points in the paint in the first half. ... Held a 46-20 edge in bench points. ... Reserve Otto Porter had 13 points and eight rebounds.\n\n\r\n                    Hornets: Shot 7 of 32 (21.9%) from 3-point range. ... Had 14 turnovers in the first half.\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Host LeBron James and the Lakers on Saturday night.\n\n\r\n                    Hornets: Face the Magic in Orlando on Sunday night and again on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997042.221926
}