{
  "game_id": "0021700545",
  "espn_id": "400975291",
  "date": "Jan 01, 2018",
  "matchup": "ORL @ BKN",
  "headline": "Allen, Crabbe help Nets beat Magic 98-95",
  "body": "NEW YORK --  The Brooklyn Nets had heard enough about not being able to win on the second night of back-to-back games.\n\nAllen Crabbe was tired of hearing his defensive approach questioned.\n\nWith the game on the line late in the fourth quarter on Monday night, they collectively answered.\n\nRookie Jarrett Allen had a career-high 16 points, Crabbe added 15 points and blocked a potential tying shot, and the Nets edged the Orlando Magic 98-95.\n\n\"I wish that reporter was here that kept telling us that we were not good on back-to-backs,\" coach Kenny Atkinson said jokingly. \"I wanted to thank him for motivating us.\"\n\nCaris LeVert also had 15 points, while DeMarre Carroll chipped in 14 points, 10 rebounds and the tiebreaking free throw with 34.5 seconds remaining. Rondae Hollis-Jefferson scored 13 for the Nets, who opened up the new year with a win after closing out 2017 with a 1-4 road trip.\n\nThe Nets are 3-5 in the back end of a back-to-back.\n\nAaron Gordon had 20 points and 12 rebounds, and Elfrid Payton added 17 points for an Orlando team that has lost its last seven games on the road.\n\nBismack Biyombo posted his own double-double with 13 points and a season-high 17 boards for the Magic, who have now lost 11 of their last 12 overall.\n\nCrabbe made two free throws to give the Nets their three-point lead with 18 seconds left. He then followed it by blocking Evan Fournier's 3-point attempt with seven seconds left, and DJ Augustin missed Orlando's final chance to tie.\n\n\"I'm just trying to take more pride in it. I'm low key tired of hearing people trying to question my defense,\" Crabbe said. \"Coming over here in this new role there are a lot of expectations now, so I don't want to be the liability, especially in film the next day.\"\n\nThe Magic led by as many as eight points in the first half, but couldn't gain control of the game in a fourth quarter that featured 13 ties and 11 lead changes.\n\nSaid Fournier of his failed shot: \"I felt (bad) all night long. Could never find my rhythm. So yeah, it wasn't good enough for sure.\"\n\nOrlando squandered a 93-90 lead with 1:51 to go in the fourth after Gordon made a pair of free throws.\n\nHollis-Jefferson then made two free throws to close the lead to 93-92 with 1:31 remaining and LeVert converted on a three-point play to put the Nets up 95-93. Orlando's Wes Iwundu then answered with a basket to even it again at 95-all.\n\nCarroll was then fouled under the basket and put the Nets ahead for good.\n\nTIP-INS\n\nMagic: Orlando's last road win took place Dec. 3 across town from Brooklyn at Madison Square Garden against the New York Knicks.\n\nNets: Brooklyn, second in the league with 34.3 3-pointers per game this season, attempted only nine 3s in the first half, making three. They hit 6 of 15 in the second half . Nets lead the lead season series 2-1.\n\nIT GETS TOUGHER\n\nThe Magic welcome two of the NBA's best teams this week at home. First up is a date on Wednesday night with the Houston Rockets, who own the second-best record in the Western Conference. Saturday night it's a matchup against LeBron James and Cleveland, the defending Eastern Conference champs, who this week get point guard Isaiah Thomas back.\n\nBiyombo, who is averaging 9.5 points, 13 rebounds and 3.3 blocks since stepping into the starting lineup in place of injured center Nikola Vucevic, believes they can still snap out of this slump.\n\n\"We need to keep improving. We need to keep playing and we have to remain patient because there's still a lot left in the season\", he said.\n\nPERFECT WAY TO START THE NEW YEAR\n\nThe Nets improved to 9-0 this season when holding their opponent under 100 points. They're also 7-0 when limiting the opposition's shooting under 40 percent.\n\nBLOCK PARTY\n\nThe Nets recorded a season-high 10 blocked shots. Crabbe had a career-high three rejections. Spencer Dinwiddie and Allen had two apiece.\n\nUP NEXT\n\nMagic: Host Houston on Wednesday.\n\nNets: Host Minnesota on Wednesday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993690.601074
}