{
  "game_id": "0022301200",
  "espn_id": "401585828",
  "date": "Apr 14, 2024",
  "matchup": "SAC vs. POR",
  "headline": "The Kings beat the Blazers 121-82 in regular season finale to earn at least 1 more home game",
  "body": "SACRAMENTO, Calif. -- — De'Aaron Fox scored 24 points and the Sacramento Kings assured themselves of at least one more home game by beating the Portland Trail Blazers 121-82 in the teams' regular-season finale on Sunday.\n\n\r\n              Sacramento will head into the play-in tournament on Tuesday night, hosting Golden State in the ninth versus 10th-place game in the Western Conference that is a rematch of a first-round series last year that the Kings lost in seven games.\n\n\r\n              “It’s exciting,” guard Davion Mitchell said. “We get to get a little payback for last year. We know they’re going to come here with energy. It’s a home game. We know it’s going to be loud. It’s going to physical. I think we ready for it.”\n\n\r\n              Sacramento will need to win that game and then again on the road on Friday night against the loser of the New Orleans Pelicans-Los Angeles Lakers in the No. 7 versus No. 8 matchup to make it into the playoffs.\n\n\r\n              After snapping an NBA-record long 16-year playoff drought last season, the Kings were in good position to finish in the top six and return to the postseason this year before losing five of six games headed into the season finale. Now they must get in through the play-in tournament without key injured players Malik Monk and Kevin Huerter. \n\n\r\n              Waiting for them is the Warriors team that spoiled their season last year when Stephen Curry scored 50 points in a Game 7 win for Golden State in Sacramento.\n\n\r\n              “We welcome anybody that’s in front of us,” Kings coach Mike Brown said. “Just excited about an opportunity to play, to go play one game right now and swing for the fences and try to get a win. It's a great opportunity for us to go do it.”\n\n\r\n              Sacramento cruised in the finale against a short-handed Blazers team playing out the string on a lost season. The Kings opened a 20-point lead in the second quarter and never were threatened.\n\n\r\n              Domantas Sabonis had 18 points and 11 rebounds for his 77th double-double of the season, the most since Moses Malone also had 77 in 1978-79. \n\n\r\n              “We just wanted to bring the physicality to them and kind of be the team that knocks them back,” forward Keegan Murray said. “I feel like we did that opening up the game that way and hit them in the mouth in the third quarter, too. That’s what we wanted to do.”\n\n\r\n              Dalano Banton led Portland with 17 points before getting ejected for a flagrant foul in the fourth quarter. Banton set a record for futility by missing all 15 of his attempts from 3-point range. \n\n\r\n              The Blazers were missing 10 players who accounted for more than three-quarters of the team's points this season because of injuries. \n\n\r\n              The patchwork lineup provided little resistance for Sacramento as Portland missed 21 of its first 22 attempts from 3-point range and trailed 65-37 at the half. Portland shot 7 for 45 from 3-point distance for the game.\n\n\r\n              The Blazers finished the season tied for the third-worst record in the NBA with the 61 losses, tied for the second-most in franchise history behind only the 64 in 1971-72.\n\n\r\n              “It’s been a challenge,” coach Chauncey Billups said. “It’s pretty challenging, but it is what it is. It’s been a long year, but also it goes by fast. It’s crazy.”\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996777.398946
}