{
  "game_id": "0021900773",
  "espn_id": "401161415",
  "date": "Feb 07, 2020",
  "matchup": "OKC vs. DET",
  "headline": "Paul, Gilgeous-Alexander lead Thunder past Pistons 108-101",
  "body": "OKLAHOMA CITY --  Nothing changed for the Oklahoma City Thunder before the trade deadline.\n\nAs a result, nothing appears to have changed after -- in their first game since, they won again with balanced scoring and solid defense.\n\nChris Paul scored 22 points and Shai Gilgeous-Alexander added 21 to help the Thunder beat the Detroit Pistons 108-101 on Friday night.\n\nDanilo Gallinari scored 19 points, Dennis Schroder 18 and Steven Adams 16 for Oklahoma City, which has won nine of 10.\n\nMost of the hype before the deadline involved Gallinari, the team's No. 2 scorer. Paul was happy that the Thunder were able to keep their team together.\n\n\"It's always uncertainty because it's a whole ordeal now with the deadline,\" he said. \"It shows. It's a frenzy. It's good to know that we're going to keep playing together.\"\n\nOklahoma City is now 12 games above .500.\n\n\"It's us,\" Paul said. \"Once the deadline passes, I don't care what they said -- this, that was going to happen. We're going to make a run at this thing, and we've got our group.\"\n\nFormer Thunder guard Reggie Jackson scored a season-high 28 points for Detroit. Christian Wood scored 27 points and Thon Maker added a season-high 19 for the Pistons.\n\nIt was Detroit's first game since trading Andre Drummond to the Cleveland Cavaliers. Drummond is a two-time All-Star who leads the league with 15.8 rebounds per game.\n\nDetroit coach Dwane Casey said before the game that the move was strictly business.\n\n\"Andre is a fabulous basketball player in our league,\" he said. \"Everybody makes a big thing about big guys. Still big guys -- as long as that basket's 10 feet, big guys are still going to be important.\"\n\nDetroit's leading scorer, Derrick Rose, sat out with a strained left hip. With the trade and injuries, Casey had just nine available players.\n\nOklahoma City shot 54.3% in the first half to lead 52-47 at the break.\n\nLate in the third quarter, Gilgeous-Alexander got the roll on a pull-up jumper and was fouled. He missed the free throw, but got the rebound and made a layup to put the Thunder ahead 74-63.\n\nThe Thunder led 78-68 at the end of the third quarter, then Jackson scored seven points in the first two minutes of the fourth quarter to cut Oklahoma City's lead to 85-78.\n\nDetroit cut its deficit to four in the closing minutes, but Paul made two free throws and a jumper to give the Thunder a 103-95 lead with 1:31 to play, creating enough of a cushion for Oklahoma City to hold on.\n\nCasey said part of the problem late was that he utilized so many young players.\n\n\"I thought we didn't do a great job of executing down the stretch,\" Casey said. \"Some of that -- a lot of guys hadn't been in those situations. But again, the effort and the intensity, I thought was there for the most part of the game.\"\n\nTIP-INS\n\nPistons: Had six players listed as out with injuries and five players listed as inactive. The inactives included John Henson and Brandon Knight, the players Detroit got back from the Drummond deal. ... Maker fouled out in the fourth quarter. ... Jackson scored 15 points on 5-for-6 shooting in the fourth quarter.\n\nThunder: G Terrance Ferguson played in his second game since returning from an eight-game personal absence. He finished with one point in 13 minutes. Rookie Luguentz Dort, who got the start, scored two points in 25 minutes. ... Schroder's streak with at least 20 points off the bench ended at seven games.\n\nSTAT LINES\n\nGilgeous-Alexander, a 6-foot-6 guard, has at least one block in nine straight games. During that stretch, he is averaging 1.89 blocks per contest. According to the Thunder, the only Oklahoma City players ever to post longer streaks are all at least 6-10: Nerlens Noel, Kendrick Perkins and Serge Ibaka.\n\nHE SAID IT\n\nPaul, on staying focused heading into the All-Star Break: \"Sometimes, these games, people start looking at the break, what not, but we've got a great group of guys that we can focus on every game, and it's nice to have.\"\n\nUP NEXT\n\nPistons: Host the New York Knicks on Saturday.\n\nThunder: Host the Boston Celtics on Sunday.\n\n---\n\nFollow Cliff Brunt on Twitter (at)CliffBruntAP.\n\n---\n\nMore AP NBA Coverage https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996209.157472
}