{
  "game_id": "401810113",
  "espn_id": "401810113",
  "date": "Nov 19, 2025",
  "matchup": "PHI vs TOR",
  "headline": "Raptors win 5th straight, surging in 3rd third to beat 76ers 121-112",
  "body": "PHILADELPHIA -- — Brandon Ingram and RJ Barrett each scored 22 points and the Toronto Raptors won their fifth straight game, surging in the third quarter to beat the Philadelphia 76ers 121-112 on Wednesday night.\n\n\r\n              Jakob Poeltl scored 19 points, and Immanuel Quickley had 18 — hitting two 3-pointers in the final two minutes — to help the Raptors win for the ninth time in 10 games. Scottie Barnes added 16 points, nine rebounds and five assists. \n\n\r\n              Tyrese Maxey led the 76ers with 24 points. VJ Edgecombe and Quentin Grimes had 21 points each.\n\n\r\n              The 76ers led 56-53 at halftime behind 15 points from Maxey. Toronto took the lead with an 18-7 run to start the third quarter, powered by seven points from Ingram. The Raptors outscored the 76ers 44-28 in the period.\n\n\r\n              Toronto shot 2 for 15 from 3-point range in the first half, then went 5 for 6 from deep in the third quarter. Toronto is 7-3 on the road and 9-2 against Eastern Conference opposition.\n\n\r\n              Sixers center Joel Embiid (right knee injury management) missed a fourth straight game and his ninth out of 14 this season. Paul George, who made his season debut Monday, was held out as part of management of his left knee injury. The 76ers announced before the game that Kelly Oubre Jr. will miss at least two weeks with a sprained LCL in his left knee.\n\n\r\n              Raptors rookie forward Collin Murray-Boyles missed the game because of right knee soreness.\n\n\r\n              Up next\r\n              Raptors: Host Washington on Friday night.\n\n\r\n              76ers: At Milwaukee on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042654.728571
}