{
  "game_id": "0021401006",
  "espn_id": "400579298",
  "date": "Mar 18, 2015",
  "matchup": "DET @ PHI",
  "headline": "76ers snap 4-game skid with 94-83 win over Pistons",
  "body": "PHILADELPHIA --  The lowly 76ers have been so good against Detroit, they didn't even need their most talented player down the stretch.\n\nIsh Smith scored 15 points to pace a balanced offense, and the 76ers won for the third time in six games with a 94-83 victory over the Pistons on Wednesday night.\n\nPhiladelphia rookie big man Nerlens Noel departed with 4 minutes, 27 seconds left in the third quarter with a bruised right foot and didn't return. Noel, who sat out all of last season with a left knee injury, finished with 11 points and four rebounds.\n\n\"I tried to tough it out and get back in the game, but coach said we didn't really need it,\" said Noel, one of the league's top rookies.\n\nJason Richardson added 14 points for Philadelphia, which beat Detroit for the third time in four meetings this season.\n\n\"It was terrible,\" Pistons coach Stan Van Gundy said. \"We just kept making the same mistakes. We never were in that game.\"\n\nKentavious Caldwell-Pope had 20 points for the Pistons, who have lost 11 of 12. Reggie Jackson, who set a career high with 20 assists on Tuesday, had a triple-double with 11 points, 11 rebounds and 10 assists but shot 4 for 17.\n\nDetroit, which entered 28th in the league in field-goal percentage (42.6 percent), struggled from the field against Philadelphia again. The Pistons hit 33 percent (29-for-88) on Wednesday. They shot a season-low 30.7 percent in an 89-69 loss Jan. 28 at Philadelphia.\n\n\"When you don't throw the ball to open people and continue to force shots in the paint . If we continue to take those shots against anybody, we're going to shoot in the 30 percent range,\" Van Gundy said. \"We're taking difficult shots at the rim. There are people open and we won't throw it to them.\"\n\nThe Pistons' hopes of a playoff spot all but evaporated with a 10-game losing streak that ended with Tuesday's 105-95 home win over Memphis. It was the first victory since Feb. 22 for Detroit, which entered Wednesday 6 1/2 games back of a playoff spot in 12th place in the Eastern Conference.\n\nThe 76ers, who began Wednesday with the third-worst record in the league, stretched their three-point lead entering the fourth quarter to double-digits at 83-72 on Furkan Aldemir's bucket with just under five minutes remaining.\n\nRichardson's 3-pointer with 2:37 remaining gave Philadelphia its largest lead, 87-72.\n\nDetroit never got closer than eight the rest of the way.\n\nPhiladelphia led by 10 at the half and matched its biggest lead to that point on Hollis Thompson's 3-pointer with 4:05 left in the third quarter that made it 65-52. But the Pistons finished the period by scoring 13 of the final 16 points to trim the margin to 68-65 entering the fourth quarter.\n\nThe Pistons and 76ers are two of the worst-shooting teams in the league. While Detroit entered 28th, Philadelphia (40.8 percent) was last before Wednesday's games. The Pistons struggled more in first half when they shot 33.3 percent (14 for 42) from the field, helping Philadelphia lead 49-39 at the break. Philadelphia ended at 42.9 percent (36 for 84) from the field.\n\nLACK OF FOCUS\n\nVan Gundy said the Pistons rehearsed Philadelphia's defensive strategy during the morning shootaround, but the players failed to execute the plan.\n\n\"It was a total lack of focus in getting ready to play a game and knowing who your opponent is and taking what you go through in the morning and preparing yourself to play,\" he said. \"I didn't see any focus whatsoever in being strong with the ball. I didn't see any focus whatsoever in finding open people.\"\n\nIn addition to their shooting woes, the Pistons committed 18 turnovers.\n\nSLUMP BREAKER\n\nRichardson was 6 for 27 from 3-point range in his three previous games before shooting 3 of 5 from long range against Detroit.\n\nHe didn't have to go far to hear about it, either.\n\n\"I hear it all day from my two sons -- I'm my worst critic -- they'd be second in line, telling me, `Dad, relax. You're bricking a lot. Just shoot the ball,\" he said. \"To finally see the ball go in, it's great (to) get back into that form.\"\n\nTIP-INS\n\nPistons: Greg Monroe (knee) sat out for the second straight game. ... Former Villanova standout Malik Allen is a Pistons assistant coach. The No. 1-seeded Wildcats begin NCAA tournament play Thursday against Lafayette. . Detroit dropped to 0-15 when scoring below 90 this season.\n\n76ers: The 76ers hosted the family of former Philadelphia police officer Robert Wilson III, who was killed during a robbery attempt earlier this month. Wilson's 10-year-old son, Quahmier, got a tour of the 76ers' locker room from Richardson.\n\nUP NEXT\n\nPistons: Host Chicago on Saturday.\n\n76ers: Host the Knicks on Friday.",
  "source": "espn_api",
  "crawled_at": 1764992388.680664
}