{
  "game_id": "0022000660",
  "espn_id": "401307449",
  "date": "Mar 22, 2021",
  "matchup": "ATL @ LAC",
  "headline": "Reserves lead Clippers' huge rally to 119-110 win over Hawks",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 25 points, Terance Mann added a season-high 21 and the Los Angeles Clippers rallied from a 22-point deficit in the second half to snap the Atlanta Hawks' eight-game winning streak with a 119-110 victory Monday night.\n\n\r\n                    Luke Kennard made all eight of his shots and scored all of his season high-tying 20 points in the second half for the Clippers, who fell behind 88-66 in the third quarter shortly after a frustrated coach Ty Lue put in a small lineup of five reserves.\n\n\r\n                    “With the team that we have, we know that we’re capable of making some comebacks,” Kennard said.\n\n\r\n                    With Mann and Kennard spurring the comeback, Los Angeles ended the game on a dominant 53-22 run.\n\n\r\n                    “I think we realized over the past few games that energy is one of the things that works for us,” said Mann, who scored 11 points in the fourth quarter. “When we’re hustling, rebounding the ball and showing personality, it’s made us open up our eyes.”\n\n\r\n                    Trae Young had 28 points and eight assists, and John Collins scored 23 points in the Hawks' first loss of March, and their first under new coach Nate McMillan. Atlanta's winning streak was its longest since January 2015.\n\n\r\n                    “I thought we just started celebrating,” McMillan said. “They made some adjustments, they went small, and we just lost our focus and didn’t finish this game. ... We lost our composure.”\n\n\r\n                    After Lue emptied his bench because he said he was “looking for life,” a lineup without All-Stars Leonard and Paul George shockingly trimmed the deficit to single digits. George finished with a season-low eight points, but the Clippers didn't need him.\n\n\r\n                    “I think it’s definitely one of the most fun games I’ve been a part of in my basketball career,” Kennard said. “That’s top two, if not at the top. The group that was in, and then just hearing the guys on the sidelines, the way they were cheering us on as we made that run, that’s what it’s all about.”\n\n\r\n                    After Mann hit the tying layup with 4:25 to play, he drilled a 3-pointer with 2:42 left to give Los Angeles its first lead of the second half.\n\n\r\n                    Leonard's decisive 3-pointer with 1:23 left capped a 50-20 surge by the Clippers, and the superstar added another on the next possession for a flourish on the stunned Hawks.\n\n\r\n                    “We’ve gone through this before,” Young said. “We’ve done a great job recently of closing out games. You’re not going to be perfect all season, but it felt like we had a real good chance of closing this one out.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Danilo Gallinari was whistled for a flagrant foul on Mann in the third quarter. Gallinari then missed the fourth quarter with a left knee bruise, McMillan said. ... Young hit five of their 12 3-pointers and had four of their seven turnovers.\n\n\r\n                    Clippers: They traded Mfiondu Kabengele to Sacramento during the game. Mann's collegiate teammate at Florida State appeared in 35 games over two seasons with LA. ... LA again played without two regular starters. Patrick Beverley has missed five straight games with right knee soreness, and Serge Ibaka has missed the last four due to lower back tightness.\n\n\r\n                    NIGHT OF THE HUNTER\n\n\r\n                    De’Andre Hunter scored eight points in 21 minutes for Atlanta in his first game since Jan. 29. He missed 23 games while recovering from arthroscopic knee surgery.\n\n\r\n                    “He went out there and played good,” Young said. “I know he was trying to get into a rhythm. He got a couple of shots to go down, and it was good to see.”\n\n\r\n                    Hunter averaged 17.2 points and 5.4 rebounds in his first 18 games. McMillan said Hunter is on a minutes restriction for now.\n\n\r\n                    LUUUUKE\n\n\r\n                    Kennard got a $64 million extension in the offseason, but had played only 64 minutes in the last 10 games. He shook off any rust with a dazzling effort against the Hawks, hitting four 3-pointers while adding seven rebounds and four assists without a miss.\n\n\r\n                    “Luke is a bucket,” Mann said. “He can get to it, and it was great to see.”\n\n\r\n                    Kennard even banked in a 3-pointer from halfcourt at the third-quarter buzzer to cap his 13-point quarter.\n\n\r\n                    “When that deep shot went in from halfcourt, I said, ‘Shoot, you know what? Let’s just keep this momentum going,’” Kennard said. “A 20-point (deficit) seems like a lot, but we just chipped away.”\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: At Kings on Wednesday.\n\n\r\n                    Clippers: At Spurs on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997636.5906281
}