{
  "game_id": "401810008",
  "espn_id": "401810008",
  "date": "Nov 02, 2025",
  "matchup": "NY vs CHI",
  "headline": "Brunson scores 31 as Knicks snap losing streak, hand Bulls first loss",
  "body": "NEW YORK -- — Jalen Brunson scored 31 points as the New York Knicks snapped a three-game losing streak and handed the Chicago Bulls their first loss of the season, 128-116 on Sunday night.\n\n\r\n              Karl-Anthony Towns had 20 points and 15 rebounds for his fifth double-double of the season, while Josh Hart had 14 points and nine rebounds for the Knicks, who scored the most points they've had in a game this season and avoided their first four-game losing streak since Feb. 8-14, 2024.\n\n\r\n              Josh Giddey led Chicago with 23 points, 12 assists and 12 rebounds for his first triple-double of the season, while Nikola Vucevic had 17 points and 14 rebounds. The Bulls (5-1) were the last Eastern Conference team to fall from the unbeaten ranks and were denied their first 6-0 start since 1996-97 during the Michael Jordan era.\n\n\r\n              The Bulls entered the game leading the NBA in defensive 3-point percentage (30.1%). But Chicago had no answer for the Knicks’ hot long-range shooting Sunday.\n\n\r\n              New York knocked down 20 of 42 from 3-point range (47.6%) — including 13 for 21 (61.9%) in the first half. Seven Knicks made at least two 3-pointers, led by Brunson, who was 4 for 11.\n\n\r\n              New York’s reserves also chipped in 46 points after averaging 18 bench points per game over the losing streak.\n\n\r\n              After leading by eight at halftime, New York scored 37 third-quarter points, while knocking down 5-of-10 3-point attempts in the period, and led 105-89 through three.\n\n\r\n              Up next\r\n              Chicago: Hosts Philadelphia on Tuesday night.\n\n\r\n              New York: Hosts Washington on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042548.431979
}