{
  "game_id": "0022000769",
  "espn_id": "401307560",
  "date": "Apr 06, 2021",
  "matchup": "IND vs. CHI",
  "headline": "Vucevic helps Bulls run past short-handed Pacers 113-97",
  "body": "INDIANAPOLIS -- — Nikola Vucevic looks as if he's finding his fit in Chicago.\n\n\r\n                    On Tuesday, he took advantage of Indiana's missing big men by posting 32 points and 17 rebounds to help the Chicago Bulls overwhelm the short-handed Pacers 113-97.\n\n\r\n                    Chicago has won two straight since snapping a six-game losing streak and moved within one game of the Pacers for the No. 9 spot in the Eastern Conference. Vucevic also had five assists while going 14 of 29 from the field. All-Star Zach LaVine added 19 points, eight rebounds and six assists.\n\n\r\n                    “He's very, very versatile and I think as he gets more comfortable with the guys he’ll become more and more efficient,\" coach Billy Donovan said. ““I think he tries to play the right way and when you have a guy of his talent and he tries to play the right way, I think it becomes contagious.\"\n\n\r\n                    The combination was simply too much for Indiana, which started the game without two-time All-Star Domantas Sabonis (sprained left ankle) and guard Malcolm Brogdon (sore right hip), before losing Myles Turner in the third quarter with a sprained left ankle.\n\n\r\n                    Caris LeVert led the Pacers with 20 points and six rebounds. Edmond Sumner and Jeremy Lamb each scored 15 points as Indiana lost for the ninth time in 10 home games.\n\n\r\n                    “We want to be better, I want to be better, guys want to be better,\" Indiana coach Nate Bjorkgren said. “We have guys on this team I believe in very much.\"\n\n\r\n                    Chicago took control with a 15-3 run early in the second quarter, taking a 45-33 lead. It was never really close afterward. The Bulls led 62-49 at halftime. When the Pacers cut the deficit to 81-72 in the third quarter, Chicago answered with a 9-0 run, led by Vucevic and Indiana never got close again.\n\n\r\n                    “If we can get him (Vucevic) his fair share of shots and have good balance with him and Zack that’s a big thing,\" Donovan said.\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Chicago won the season series 2-1 with the road team winning each game. ... Vucevic posted his 33rd double-double this season. He was tied for fourth in the league entering the game. ... Thaddeus Young had 14 points, seven rebounds and five assists against his former team. ... Lauri Markkanen had 15 points and Coby White had 13 points.\n\n\r\n                    Pacers: LeVert has scored in double figures 10 times in 13 games since returning from surgery to remove a cancerous growth on his left kidney. ... Turner had 10 points and has now had at least one block in 64 consecutive games. He wound up with three blocks. ... Doug McDermott scored 11 points.\n\n\r\n                    HOME WOES\n\n\r\n                    Indiana played just its fifth home game since the All-Star break Tuesday, a span of 32 days in which the Pacers also shared Bankers Life Fieldhouse with the NCAA men's basketball tournament and the four boys basketball state championship games. But given their home woes, they might have appreciated a little time on the road. The Pacers are 8-15 on their home court this season. And with 13 games remaining at Bankers Life, they'll need a strong finish to extend the NBA's longest active streak of consecutive winning seasons at home to 32.\n\n\r\n                    INJURY PLAGUE\n\n\r\n                    The Pacers played most of the second half without four of their projected opening day starters. In addition to Brogdon, Sabonis and Turner, T.J. Warren, last season's top scorer, will miss the rest of the season with a stress fracture in his left foot. Lamb played despite having a sprained right toe.\n\n\r\n                    “It’s tough to get a rhythm when you have different guys playing every night. But we can't make excuses, we have to fight through that,\" LeVert said. “Getting chemistry and is a tough thing. So we’re still trying to figure out lineups right now.\"\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Visit Toronto in Tampa, Florida, for a makeup game on Thursday. \n\n\r\n                    Pacers: Host Minnesota on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997130.064905
}