{
  "game_id": "0021501155",
  "espn_id": "400829042",
  "date": "Apr 05, 2016",
  "matchup": "DET @ MIA",
  "headline": "Dragic scores 22, Heat roll past Pistons, 107-89",
  "body": "MIAMI -- There was no way for the Miami Heat to gain ground in the Eastern Conference playoff race on Tuesday night.\nNo way they would lose any, either -- not with offensive balance on one end and another strong defensive effort on the other.\nGoran Dragic had 22 points and eight assists, Dwyane Wade added 16 points and the Heat beat the Detroit Pistons 107-89, staying in the fifth spot in the airtight East race.\n\"We want to play at home in the playoffs and that is the most important thing right now,\" Dragic said. \"We still have five games left and everything counts.\"\nJosh Richardson also had 16 for Miami, which got 14 points and 12 rebounds from Hassan Whiteside, 12 points from Luol Deng and 11 from Joe Johnson. The Heat held Detroit to 40 percent shooting, 24 percent from 3-point range.\n\n\"They just dominated us at both ends of the floor all night,\" Pistons coach Stan Van Gundy said. \"From the start to the finish, they dominated us, particularly on the perimeter.\"\nVan Gundy said he took a postgame look at the numbers and saw that Miami and Detroit both had 51 shots from the perimeter. Miami made twice as many, 28-14.\n\"Very disappointing effort, but give them credit,\" Van Gundy said. \"They were great.\"\nSo if nothing else, Miami didn't slip behind the teams it is chasing for home-court advantage in the first round. No. 3 Atlanta (46-32) beat Phoenix on Tuesday, No. 4 Boston (45-32) was idle but holds the tiebreaker over the Heat and No. 6 Charlotte (44-33) lost in Toronto to fall a game behind Miami.\nReggie Jackson and Tobias Harris each scored 21 for Detroit, which remained two games ahead of Chicago for the No. 8 spot in the East. The Bulls lost in Memphis on Tuesday.\n\"Thanks for the hookup,\" Jackson said, as if he were speaking to the Grizzlies postgame.\nAndre Drummond had 12 points and 13 rebounds for the Pistons.\nMiami's lead was three with 8 minutes left in the first half, and a 23-6 run over the next 7 minutes put the Heat in control. Deng started the run with a pair of baskets, Johnson capped it with back-to-back scores and the Heat found themselves up 52-32.\nDetroit got within 13 early in the third, before Richardson finished off a 7-0 flurry with a 3-pointer from the right corner that restored a 20-point cushion.\nThe exclamation point came in the final seconds of the third.\nWhiteside blocked Drummond near the rim with about 9 seconds left, chased down the loose ball and bounced it off Harris' body out-of-bounds to give Miami possession. Dragic capped the quarter with a 3, and Miami had an 82-63 lead.\n\"The energy on both ends was very good, so we'll take it,\" Heat coach Erik Spoelstra said. \"We move on. We've got to continue to protect home right now.\"\nTIP-INS\nPistons: With one win in its final four games, Detroit (41-37) would ensure finishing over .500 for the first time since 2007-08. ... The Pistons led for a total of 36 seconds, all in the opening 2 minutes. ... There were two Detroit at Miami matchups Tuesday night, with the Tigers also visiting the Marlins in the season opener for both of those clubs.\nHeat: Wade returned after missing Miami's last two games with neck and back soreness. \"I thought he was moving well. He wasn't turning his neck well. His shoulder and back are still tight. But I thought he had some juice to his step,\" Spoelstra said. ... Udonis Haslem got first-half minutes for the 16th time this season, the first time since Feb. 19. He hadn't appeared in the first half of a Heat home game since Christmas Day.\nTOP ROOKIE\nRichardson was announced Tuesday as the NBA's Eastern Conference rookie of the month for March. He's the third player in Heat history to win the monthly rookie prize, the first since Michael Beasley in April 2009. The only other Heat player to win the award is Caron Butler, a four-time recipient in the 2002-03 season.\nKEEPING IT 100\nIt was the 100th regular-season meeting between the clubs. The Heat are 52-48 in those games. Average score: Heat 93.9, Pistons 93.7.\nUP NEXT\nPistons: Visit Orlando on Wednesday.\nHeat: Host Chicago on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994893.7292612
}