{
  "game_id": "0021500569",
  "espn_id": "400828456",
  "date": "Jan 12, 2016",
  "matchup": "PHX @ IND",
  "headline": "Pacers pull away in fourth, beat Suns 116-97",
  "body": "INDIANAPOLIS --  The road woes continue for the Phoenix Suns, and Paul George and the Indiana Pacers took advantage of a team struggling to find ways to win.\n\nGeorge got hot late and a balanced scoring attack propelled the Pacers to a 116-97 home win Tuesday over Suns. He scored nine of his 21 points in the fourth quarter as the Pacers took a close game and turned it into a blowout by outscoring Phoenix 36-21 in the final 12 minutes. Monta Ellis scored 12 of his 14 points in the third quarter to give Indiana (22-16) a 1-2 punch in the second half.\n\n\"We just didn't let up,\" George said. \"We got some stops. We got some steals. We played with a faster tempo.\"\n\nThe game featured a 22-minute stoppage with 4:32 left in the second quarter when the lights briefly went out inside the arena. And when the lights went off, Phoenix (13-27) lost the momentum it had gained after falling behind early.\n\nA brief power outage in Indianapolis caused the outer bank of lights to turn off.\n\nLeading 36-34 at the time and in the midst of a 23-9 run, Phoenix came out of the break flat. The Pacers caught fire and finished the half with an 18-6 spurt that gave them a 52-42 halftime advantage.\n\nFor the Pacers, it was the second time in a week they'd been involved in a game that featured a temporary power outage. Tipoff for their Jan. 4 game in Miami was suspended 30 minutes after lightning in the Miami area caused the lights to go out.\n\n\"This one was weird, being in the middle of a quarter,\" George said. \"We did a good job of being ready when the lights came back on.\"\n\nA back-and-forth third quarter saw the teams combine for 33 points in the final three minutes of the period. Devin Booker had 12 points in the quarter for Phoenix as the Suns (13-27) erased the 10-point deficit to take a 73-72 lead on a Markieff Morris free throw with 1:37 left.\n\nThat set the stage for Indiana's blistering finish and runaway victory. The Pacers shot 67 percent in the fourth quarter. Phoenix faded on its way to an eighth consecutive road loss. Head coach Jeff Hornacek said his team simply went cold.\n\n\"We couldn't score,\" he said. \"They broke us down and we couldn't get stops.\"\n\nBooker, who shared team-high honors with Mirza Teletovic with 19 points, said the Suns couldn't keep up with the pace Indiana implemented in the final period.\n\n\"We just ran out of gas,\" Booker said. \"We hung in there as long as we could.\"\n\nPoint guard George Hill added 20 points and five assists for the Pacers. CJ Miles scored 19 points off the bench and went 4-of-6 from behind the arc. Center Ian Mahinmi added 10 points and five rebounds for Indiana.\n\nMorris scored 16 for the Suns, who were playing the second game of a three-game road trip. PJ Tucker grabbed 10 rebounds for Phoenix and he finished with five points. Archie Goodwin had 12 points and TJ Warren contributed 10 points for the Suns.\n\nTIP-INS\n\nSuns: Teletovic reached double figures for a career-best sixth straight game. ...Tuesday's contest was one of nine road games Phoenix will play this month. ...The loss was the eighth consecutive road defeat for Phoenix.The Suns had swept the last two season series with Indiana entering Tuesday.\n\nPacers: Since starting the season 12-5, Indiana is 10-11. ... George is currently second in all-star voting for the Eastern Conference behind Cleveland's LeBron James . ... Ellis pushed his streak of scoring in double figures to 11 games, finishing with 14 points. ... Rodney Stuckey left the game in the first quarter with a sore right foot and did not return.\n\nUP NEXT:\n\nIndiana plays at Boston on Wednesday.\n\nPhoenix plays at Boston on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994852.816917
}