{
  "game_id": "0022200544",
  "espn_id": "401468699",
  "date": "Dec 31, 2022",
  "matchup": "DET @ MIN",
  "headline": "Bogdanovic, bench send Pistons to 116-104 win over Wolves",
  "body": "MINNEAPOLIS -- — Bojan Bogdanovic scored 28 points, including 17 in the third quarter as Detroit erased a double-digit deficit, and the Pistons got 65 points from their bench in a 116-104 victory over the Minnesota Timberwolves on Saturday night.\n\n\r\n              Marvin Bagley Jr. had 18 points and 10 rebounds off the bench for Detroit, which had lost seven of eight and trailed by 18 points in the first quarter. The Pistons stayed within range and burst ahead with a 32-9 run at the end of the third and start of the fourth.\n\n\r\n              Reserve Alec Burks added 13 points for Detroit. The Pistons lead the NBA in bench points since the start of December.\n\n\r\n              “Our energy was very good in the third quarter, especially from our second unit,” Bogdanovic said. “The second group played great. When we play defense like we played in the second half, then our offense is kind of playing faster and we are moving the ball better.”\n\n\r\n              Anthony Edwards scored 30 and D’Angelo Russell added 25 points in a lackluster performance from Minnesota, which returned home after a winless four-game road trip and lost its sixth in a row.\n\n\r\n              “Tonight was the first time, I think, I saw them frustrated with each other through this stretch, through a lot of different ins and outs of the lineup, and tough losses on the road,” Timberwolves coach Chris Finch said. “Tonight, I think it manifested itself in a lot of frustration, guys not making the right, simple play.”\n\n\r\n              Russell scored 13 of the Timberwolves’ first 21 points and Minnesota used a 26-8 run early in the first to take an 18-point lead.\n\n\r\n              Detroit’s reserves entered and got back within 10 and the teams traded blows for the next two quarters.\n\n\r\n              Bogdanovic then hit three 3s midway through the third to spark the Pistons, who tied the game before the end of the quarter. Another reserve, Hamidou Diallo, supplied Detroit with its first lead with 10:37 left in the fourth.\n\n\r\n              “We know what we need to do, what we’re bad at,” Minnesota forward Jaden McDaniels said. \"We watch it every day in film, so I feel like it’s a care factor.”\n\n\r\n              The Wolves tied the game before the Pistons scored 11 in a row to take control.\n\n\r\n              “A lot of it was about our defense,” Detroit coach Dwane Casey said. “It’s about the second unit’s character. We have a lot of character guys in the group that hadn’t been getting a lot of run, but they came in and played with pure heart, pure mind and won the game for us.”\n\n\r\n              READY RESERVES\n\n\r\n              All five reserves that played for the Pistons scored in double digits. While rookies Jaden Ivey and Jalen Duren are starters, the bench consists of veterans such as Burks and Cory Joseph, both with 11 years in the league.\n\n\r\n              “I think that was the key to that second unit tonight is just communication and effort,” said six-year veteran Rodney McGruder. “We were all over. Even when we made mistakes, we talked it out and the effort made up for it.”\n\n\r\n              OLD DEMONS\n\n\r\n              Finch said “old demons” hurt Minnesota on Saturday, including rebounding. The Wolves were outrebounded 52-39. Finch also said he maybe needs to look at playing time as the team tries to solve its issues.\n\n\r\n              The third-year coach was also asked if there was a sense of entitlement with his team.\n\n\r\n              “There’s a lot of guys out there that maybe think we’re a lot better than we are,” Finch said. “Maybe it is a sense of entitlement or whatever. Certainly tonight we got what we deserved with the way we approached this game. \n\n\r\n              TIP-INS\n\n\r\n              Pistons: Diallo returned after his one-game suspension for his part in the altercation with the Orlando Magic on Wednesday. Killian Hayes served the second game of his three-game suspension. … Detroit held Minnesota to 40 points in the second half and 16 in the fourth quarter. \n\n\r\n              Timberwolves: Rudy Gobert returned after missing one game with an illness and had nine points and 10 rebounds. He was scoreless in the first half. … Edwards had 14 and Russell added 13 in the first.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Play the second game of a five-game road trip Monday in Portland.\n\n\r\n              Timberwolves: Host Denver on Monday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994369.119082
}