{
  "game_id": "401810129",
  "espn_id": "401810129",
  "date": "Nov 22, 2025",
  "matchup": "DEN vs SAC",
  "headline": "Kings overcome Jokic's 44 points, beat Nuggets 128-123 to end 8-game slide",
  "body": "DENVER -- — Russell Westbrook scored 15 of his 21 points in the fourth quarter against his former team, and the Sacramento Kings withstood 44 points from Nikola Jokic to beat the Denver Nuggets 128-123 on Saturday night, ending an eight-game slide.\n\n\r\n              Dennis Schroder also had 21 points for Sacramento, which lost every game during the streak by double digits — the last by 41 points at Memphis on Thursday night.\n\n\r\n              The Kings appeared on their way to a ninth straight defeat after falling behind by 13 in the third quarter, but they rallied to take the last of three games against Denver this season.\n\n\r\n              Keegan Murray had 19 points in his second game back from offseason surgery on his left thumb. DeMar DeRozan added 17, including a three-point play with 12 seconds left that sealed it.\n\n\r\n              It was the second consecutive home game in which the Nuggets fell to a team on an extended losing streak. Chicago handed them their first home loss Monday night to stop a five-game skid.\n\n\r\n              Jokic had 19 points in the fourth quarter. He finished with 13 rebounds and seven assists. \n\n\r\n              Jamal Murray scored 23 points and Cam Johnson had 20 for the Nuggets, who were without Aaron Gordon. The forward injured his right hamstring early in Friday night's win at Houston.\n\n\r\n              Spencer Jones made his first career start in place of Gordon.\n\n\r\n              Murray’s free throw midway through the third gave Denver a 79-66 lead, but the Kings rallied to take a lead late in the period, then scored 10 straight points early in the fourth to go up 104-98.\n\n\r\n              They extended it to 114-105 on Westbrook’s layup before Denver rallied to get within 123-120 on Jokic's 3-pointer. DeRozan iced it with a three-point play and hit two more free throws in the final seconds.\n\n\r\n              Up next\r\n              Kings: Host the Minnesota Timberwolves on Monday night.\n\n\r\n              Nuggets: At the Memphis Grizzlies on Monday night.\n\n\r\n              ------\n\n\r\n              AP NHL: https://apnews.com/hub/nhl",
  "source": "espn_direct_latest",
  "crawled_at": 1765042678.765404
}