{
  "game_id": "0022301101",
  "espn_id": "401585729",
  "date": "Apr 02, 2024",
  "matchup": "LAC @ SAC",
  "headline": "Domantas Sabonis has 22 points, 20 rebounds as Kings beat Clippers 109-95",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had 22 points, 20 rebounds and nine assists, and the Sacramento Kings beat the Los Angeles Clippers 109-95 on Tuesday night.\n\n\r\n              The Kings moved within one game of sixth-place New Orleans in the Western Conference as they seek to avoid the play-in tournament. Sacramento (44-31) is tied with Phoenix with seven games left, including a four-game trip that begins Thursday at New York.\n\n\r\n              The Clippers are fourth in the West. Sacramento held the Clippers to under 100 points for just the fifth time this season.\n\n\r\n              “This is how you win in the playoffs,” Kings coach Mike Brown said. “You don’t win in the playoffs averaging 125 points a game and think that’s how you’re going to win.\"\n\n\r\n              De’Aaron Fox added 20 points and seven assists for the Kings, and Keegan Murray had 19 points.\n\n\r\n              “We were being aggressive,” forward Trey Lyles said. \"We were talking. We were covering for one another. We were getting to their shooters. And we followed the game plan, basically, to a tee tonight. When we’re capable (of doing that), when we’re five guys on a string, we’re hard to score on.\"\n\n\r\n              Guard Davion Mitchell said the Kings embraced the physicality on defense. They blitzed James Harden, who had six points on 1-of-7 shooting, and forced him to go right. They showed different looks at Paul George, who scored 18 on 5-for-12 shooting after he had 41 points during Sunday's win at Charlotte.\n\n\r\n              “We’re just getting ready for the playoffs,” Mitchell said.\n\n\r\n              Los Angeles was without star Kawhi Leonard, who has a sore right knee. Coach Tyronn Lue said he hopes Leonard, who flew back to Los Angeles for treatment after playing Sunday, will be available Thursday against West-leading Denver.\n\n\r\n              Russell Westbrook led the Clippers with 20 points. Norman Powell, starting for Leonard, scored 17.\n\n\r\n              Lue liked his team's defense and intent, but said the Clippers couldn't rebound or make shots when they needed to. The Clippers had won the first three games of a four-game trip before Tuesday's loss.\n\n\r\n              “I want us to play like we have the last four games,” Lue said.\n\n\r\n              The Kings led by just five at halftime, but they outscored the Clippers 35-19 in the third quarter. Sabonis had nine points in the period.\n\n\r\n              Murray had one of the biggest highlights of the third with an emphatic dunk off a Clippers turnover on a fast break.\n\n\r\n              Neither Ivica Zubac nor Westbrook joined their teammates down the court on offense after the Kings committed a turnover, and when the Clippers gave it right back, Murray hesitated before slamming it on Zubac with his right hand to put the Kings up 76-62.\n\n\r\n              “Keegan’s starting to get a little wiggle now,” said Brown, who has been pushing for the second-year forward to be more aggressive. \n\n\r\n              He added: “It’s about time.”\n\n\r\n              Sacramento scored the last seven of the quarter, and a dunk by Alex Len lifted the Kings to a 91-70 lead heading into the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host Denver on Thursday night.\n\n\r\n              Kings: At the Knicks on Thursday night to open their last road swing of the season, which also includes stops in Boston, Brooklyn and Oklahoma City.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996536.2750988
}