{
  "game_id": "0022400586",
  "espn_id": "401705152",
  "date": "Jan 18, 2025",
  "matchup": "PHX @ DET",
  "headline": "Kevin Durant and Devin Booker power the Suns to a 125-121 win over the Pistons",
  "body": "DETROIT -- — Kevin Durant scored 30 of his 36 points in the second half and the Phoenix Suns defeated the Detroit Pistons 125-121 on Saturday.\n\n\r\n              Devin Booker scored 35 points, his fifth consecutive 30-point outing, as the Suns won for the fifth time in six games. \n\n\r\n              Center Nick Richards made a huge impact in his Suns debut. Richards, acquired in a trade with Charlotte earlier in the week, had 21 points and 11 rebounds off the bench. Ryan Dunn added 12 points and eight rebounds.\n\n\r\n              Tobias Harris led the Pistons with 21 points, while Cade Cunningham added 20 points and 11 assists. Cunningham, Detroit's All-Star candidate, shot 7 for 26 from the field. Jalen Duren finished with 15 points and 10 rebounds, Malik Beasley scored 14 points, Tim Hardaway Jr. and Marcus Sasser each had 11.\n\n\r\n              Takeaways\r\n              Suns: Richards could be the interior force Phoenix has been seeking to balance its lineup. He's expected to soon move into the starting lineup.\n\n\r\n              Pistons: Detroit has lost two straight after winning 10 of its previous 12 games.\n\n\r\n              Key moment\r\n              Grayson Allen made a offensive rebound with the Suns clinging to a two-point lead late in the game. Durant then hit a fadeaway jumper with 1:05 remaining. \n\n\r\n              Key stat\r\n              Durant was 1 for 9 from the field in the first half. He made 12 of 18 field-goal attempts after halftime.\n\n\r\n              Up next\r\n              The Suns continue their five-game trip at Cleveland on Monday. The Pistons open a five-game trip at Houston on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998237.736788
}