{
  "game_id": "0022400154",
  "espn_id": "401704720",
  "date": "Nov 04, 2024",
  "matchup": "MIL @ CLE",
  "headline": "Darius Garland scores 39, Cavs improve to 8-0 with 116-114 win over struggling Bucks without Giannis",
  "body": "CLEVELAND -- — Darius Garland scored 39 points, Evan Mobley added 17 and the Cleveland Cavaliers improved to 8-0 with a 116-114 win on Monday night over the Milwaukee Bucks, who played without injured superstar Giannis Antetokounmpo.\n\n\r\n              The Cavs also went 8-0 in 1976.\n\n\r\n              Garland drained a go-ahead 3-pointer with 45 seconds left and the Cavs rallied down the stretch, outscoring the Bucks 18-8 over the final 6:06.\n\n\r\n              Jarrett Allen added 14 points, 15 rebounds and had a huge block on Milwaukee's Damian Lillard in the final seconds.\n\n\r\n              Lillard scored 36 for the Bucks, but committed a costly turnover when he was called for an over-and-back violation with 56 seconds left.\n\n\r\n              Bobby Portis added 21 points and 18 rebounds for Milwaukee, which has lost six in a row.\n\n\r\n              It was Cleveland's second win in three days over Milwaukee. On Saturday, Donovan Mitchell made a jumper in the final seconds to give the Cavs a 114-113 win.\n\n\r\n              Antetokounmpo sat out with a strained adductor muscle, an injury the two-time MVP sustained during the loss to Cleveland.\n\n\r\n              Takeaways\r\n              Bucks: Showed grit in giving all they had despite not having Antetokounmpo, who averages 31 points. Milwaukee's schedule hasn't helped, with five of seven games on the road.\n\n\r\n              Cavaliers: Another good lesson to not take any team for granted. The Cavs also survived without Mitchell carrying them. He only scored one point after the first quarter, finishing with 14.\n\n\r\n              Key moment\r\n              Mobley displayed his all-around game over a span of seven seconds in the second quarter. Protecting under the rim, the 7-footer soared to block a layup, grabbed the rebound, dribbled the length of the floor and dunked to ignite a 10-2 run.\n\n\r\n              Key stat\r\n              The Cavs were just the second team in history to start 7-0 with every player averaging less than 30 minutes. Seattle did it in 1978.\n\n\r\n              Up Next\r\n              The Bucks host the Utah Jazz on Thursday. The Cavaliers are at New Orleans on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998120.076728
}