{
  "game_id": "0021500699",
  "espn_id": "400828586",
  "date": "Jan 29, 2016",
  "matchup": "DET vs. CLE",
  "headline": "Love, Irving sharp as Cavaliers beat Pistons 114-106",
  "body": "AUBURN HILLS, Mich. -- For the first time all season, LeBron James, Kevin Love and Kyrie Irving each reached 20 points in a game.\nThat was a big reason why the Cleveland Cavaliers rolled to another high-scoring win.\nLove scored 29 points, Irving had 28 and the Cavaliers beat the Detroit Pistons 114-106 on Friday night. James had 20 points, nine rebounds and eight assists.\n\"We always talk about, it starts and ends with the `Big Three,' and those two guys got it done,\" James said. \"I filled in, did what I needed to do to help us win.\"\n\nThe Cavaliers have won three straight since losing to Chicago in Tyronn Lue's first game as Cleveland's coach. Lue wants the Cavs to pick up the pace offensively, and they seem to be responding. Cleveland has scored at least 114 points in each of the past three games.\nJames shrugged off a rare missed dunk in the third quarter and surpassed the 26,000-point mark during that period, becoming the youngest player to do so at 31 years, 30 days. He also moved into the NBA's top 20 in career assists, passing Derek Harper.\nAndre Drummond had 20 points and eight rebounds for Detroit.\nCleveland has the best record in the Eastern Conference at 33-12, but it's hardly been a smooth ride of late for the defending conference champions. Lue took over when coach David Blatt was fired, and Cleveland ended up with only one player (James) picked for the All-Star team.\nLove was left out when the All-Star reserves were announced Thursday, but put up his second-highest scoring total of the season a night later. Part of the reason James, Love and Irving hadn't surpassed 20 points at the same time this season was because Irving didn't play until the latter part of December due to a knee injury.\n\"I don't know how many games we've had together,\" Love said. \"That's definitely coming back for us three.\"\nJames was one point shy of 26,000 when he breezed in on a breakaway in the third. As he went up for a dunk, the ball came loose from his right hand, and by the time he reached up with his left, he'd lost control.\nJames reached the milestone on a free throw with 4:04 left in the quarter.\nThe Cavs led 66-58 at halftime and scored the first seven points of the third. It was 96-78 after three, and when the Pistons cut the lead to nine in the fourth, Detroit's Reggie Jackson missed a 3-pointer and Cleveland was able to stay comfortably ahead.\n\"They played really, really well,\" Pistons coach Stan Van Gundy said. \"So, it's not all on us. I mean, they were terrific.\"\nKentavious Caldwell-Pope scored 19 points for the Pistons and roused the crowd a bit in the second quarter when he blocked James' 3-point attempt from behind.\nHEATED EXCHANGE\nJames and Detroit's Marcus Morris had words in the third quarter near midcourt, and officials called a double foul. The altercation didn't escalate.\nKEEPING THE BALL\nEach team had only two turnovers in the first half. Cleveland had eight for the game and Detroit had nine.\nTIP-INS\nCavaliers: Cleveland made 27 of 29 free throws. ... Tristan Thompson had 11 points and 14 rebounds.\nPistons: Detroit shot 7 of 23 from 3-point range. ... Drummond made 2 of 8 free throws, while the rest of the team went 17 of 18 from the line.\nUP NEXT\nCavaliers: Host San Antonio on Saturday night.\nPistons: Play at Toronto on Saturday night.\n---\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994916.71197
}