{
  "game_id": "401810127",
  "espn_id": "401810127",
  "date": "Nov 22, 2025",
  "matchup": "MIL vs DET",
  "headline": "Cunningham helps Pistons breeze past Bucks 129-116 for 12th consecutive victory",
  "body": "MILWAUKEE -- — Cade Cunningham had 29 points, 10 assists and eight rebounds as the Detroit Pistons capitalized on sizzling shooting to beat the Milwaukee Bucks 129-116 on Saturday night for their 12th straight victory.\n\n\r\n              Detroit's Jaden Ivey played 15 minutes and scored 10 points in his first game since breaking his left fibula on Jan. 1. Tobias Harris scored 18 points while playing for the first time since Nov. 1 after dealing with a sprained right ankle.\n\n\r\n              Milwaukee’s Giannis Antetokounmpo missed a second straight game due to an adductor strain. \n\n\r\n              The Pistons are one victory away from matching the longest winning streak in franchise history. Detroit won 13 straight games in 1989-90 and 2003-04, and the Pistons went on to win the NBA title both seasons.\n\n\r\n              Detroit also ended a 13-game skid in this series by beating the Bucks for the first time since a 115-106 triumph at Milwaukee on Jan. 3, 2022. That had been tied for the second-longest active win streak by any one team against another.\n\n\r\n              The longest such active streak is owned by the Los Angeles Clippers, who beat the Charlotte Hornets for a 15th straight time Saturday as James Harden scored 55 points in a 131-116 game.\n\n\r\n              Detroit coach J.B. Bickerstaff said during his pregame availability that Cunningham had brought up the Pistons’ lack of success against the Bucks to the rest of the team earlier in the day.\n\n\r\n              Jalen Duren had 19 points and Duncan Robinson 15 for Detroit, which shot 53.3% (16 of 30) from 3-point range and 62.8% (49 of 78) overall. Ryan Rollins had 24 and Bobby Portis added 18 for Milwaukee.\n\n\r\n              The Bucks have lost four straight to drop below .500 for the first time this season.\n\n\r\n              Detroit pulled ahead for good in the second quarter and led by as many as 29.\n\n\r\n              Up next\r\n              Pistons: Visit the Indiana Pacers on Monday night.\n\n\r\n              Bucks: Host the Portland Trail Blazers on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042677.498967
}