{
  "game_id": "0021700326",
  "espn_id": "400975077",
  "date": "Dec 02, 2017",
  "matchup": "PHX @ BOS",
  "headline": "Irving scores 19 points as Celtics top Suns 116-111",
  "body": "BOSTON --  With Boston in danger of blowing a big fourth-quarter lead, Kyrie Irving stepped up again for the Celtics.\n\nIrving had a key 3-pointer and a driving basket in the closing two minutes, helping Boston hold off the Phoenix Suns for a 116-111 victory on Saturday.\n\n\"Kyrie's ability to make those shots with very little space is pretty impressive,\" Celtics coach Brad Stevens said. \"We put ourselves in a bad spot after that fourth-quarter run.\"\n\nIrving finished with 19 points, leading a balanced attack for NBA-leading Boston (20-4). Jaylen Brown and Marcus Morris each scored 17 points, Jayson Tatum had 15 and Al Horford added 14 points and a career-best 11 assists.\n\nDevin Booker scored a season-high 38 points for Phoenix in his first game at TD Garden since he put up 70 against the Celtics on March 24. T.J. Warren had 19 points, and Tyson Chandler finished with 14 points and 18 rebounds.\n\nBooker was certainly thinking about playing in Boston again.\n\n\"This whole week I've been getting questions about the game,\" he said. \"But like I said, it was a great night. Tried to come out and be aggressive. Just fell a little short.\"\n\nPhoenix cut a 17-point deficit to 105-103 on Chandler's dunk late in the game. But Irving, who returned to the game with 4 1/2 minutes left with the lead down to eight, responded with a 3 from the right wing on the next possession, and his spinning shot off the backboard made it 112-106 with 29 seconds left.\n\n\"We have to do more of that for Kyrie, so he can just go out there and not have to work so hard all the time,\" Horford said.\n\nLeading by one late in the third, the Celtics closed the quarter with an 11-2 run. Marcus Morris' alley-oop jam in the final seconds made it 89-79.\n\nBoston then scored the first seven points in the fourth before Phoenix rallied with 15 of the next 19 points over a five-minute stretch.\n\n\"It's just understanding the game and what's available and not making mistakes down the stretch,\" Suns interim coach Jay Triano said.\n\nComing off a season-low two points when he played only 22 minutes, Brown scored 16 in the opening half.\n\nTIP-INS\n\nSuns: Reserve C Alex Len was sidelined by a sore left ankle. \"It's still bothering him a little bit,\" Triano said before the game. \"I think if we needed him, he could play.\"\n\nCeltics: Improved to 10-2 at home. ... They shot 57.5 percent (23 of 40) in the opening half, going 9 for 17 on 3-point attempts. ... Stevens switched his starting lineup for the second half, inserting Daniel Theis and removing Aron Baynes.\n\nOUCH\n\nBooker banged right knees with Brown late in the first quarter and limped slowly to the bench during a timeout. He pointed toward the right side of his knee while talking to the trainer, but returned at the start of the second and nailed a jumper in the opening minute.\n\nNOT WATCHING AGAIN\n\nA good portion of questions to Stevens in his pregame session with the media focused on the Suns' last visit, when Booker put on his show in a Celtics' victory.\n\n\"We didn't show much of him last year,\" Stevens said. \"We talked a little bit about how he gets his points, obviously.\"\n\nIn that game, Booker scored 51 after halftime, making an NBA-record 20 free throws for a half.\n\nUP NEXT\n\nSuns: At the 76ers on Monday in the fifth of a season-high six-game road trip. It's the first meeting between the teams this season.\n\nCeltics: Host the Bucks in the fourth of a five-game homestand. The teams have split two games.",
  "source": "espn_api",
  "crawled_at": 1764993913.792088
}