{
  "game_id": "0022300674",
  "espn_id": "401585302",
  "date": "Jan 31, 2024",
  "matchup": "CHI @ CHA",
  "headline": "Coby White scores 35 points to help Bulls hand Hornets their fifth straight loss 117-110",
  "body": "CHARLOTTE, N.C. -- — Coby White scored 35 points, Nikola Vucevic added 22 points and 12 rebounds and the Chicago Bulls outlasted Charlotte 117-110 on Wednesday night to send the Hornets to their fifth straight loss.\n\n\r\n              Ayo Dosunmu scored 16 points for the Bulls (23-26), who are in ninth place in the Eastern Conference.\n\n\r\n              White turned in one of his better outings of the season, attacking the hole with a purpose. He finished 12 of 22 from the field with four 3s, nine assists and seven rebounds after being limited to 13 points Tuesday night in a 118-107 loss to the Toronto Raptors.\n\n\r\n              “I personally don't think he was happy the way he played (Tuesday) night,” Bulls coach Billy Donovan said. “And that's the one thing I admire and respect about him is he's very introspective. He can course correct pretty quickly. ... He was really aggressive, he got downhill and did a lot of really good things and opened up things for himself and our team.” \n\n\r\n              White said that was by design from the opening tip.\n\n\r\n              While he said he tries to approach every game the same way, White acknowledged he wasn't thrilled with his performance against the Raptors and didn't want to make the same mistake on back-to-back nights.\n\n\r\n              “Obviously I wanted to come out and be more aggressive than I was (Tuesday) night,” White said.\n\n\r\n              It was White's second big game in Charlotte this month, scoring 27 points and recording six rebounds and five assists in a win against the Hornets on Jan. 6.\n\n\r\n              “We couldn’t stop Coby White,\" Charlotte's Miles Bridges said. “Coby White, Vuc (Nikola Vucevic), they had a good two-man connection going. We couldn’t stop Coby in the clutch. If we got like three stops on Coby, we win the game.”\n\n\r\n              Bridges had 30 points and 15 rebounds for the Hornets, whose losing streak has coincided with their trade of leading scorer Terry Rozier to Miami for a first-round draft pick and Kyle Lowry. Lowry has not played for the Hornets as the team looks to trade him or buy out his contract.\n\n\r\n              P.J. Washington added 26 points and Brandon Miller had 21 for Charlotte (10-36).\n\n\r\n              The Hornets finished out a four-game homestand that included lopsided losses to Houston, Utah and New York — games in which they trailed by at least 29 points as some point.\n\n\r\n              This one was much closer than the others.\n\n\r\n              The game was tied entering the fourth quarter, but the Bulls built an 11-point lead behind White and Andre Drummond, who finished with 10 points and eight rebounds off the bench. White, who played college ball at North Carolina, had 10 points in the fourth quarter, including a driving layup through the lane between two defenders to put the Bulls up by 10 with 1:26 remaining.\n\n\r\n              Hornets coach Steve Clifford wasn't happy with his team's on-ball defense.\n\n\r\n              “We couldn’t guard,\" Clifford said. \"They were just in the paint every pick and roll. ... We've been having problems just because our principles are bad and stuff. But those guys are terrific offensive players. They played well, and sometimes that happens.” \n\n\r\n              Charlotte played without LaMelo Ball for the third straight game due to ankle soreness. Fellow starters Gordon Hayward and Mark Williams also remain out.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Sacramento on Sunday night after three days off.\n\n\r\n              Hornets: At Oklahoma City on Friday night, the only away game during an eight-game stretch. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995888.1882
}