{
  "game_id": "0022400755",
  "espn_id": "401705321",
  "date": "Feb 10, 2025",
  "matchup": "MIN @ CLE",
  "headline": "All-Stars Evan Mobley, Donovan Mitchell pace Cavs to 128-107 win over slow-starting Timberwolves",
  "body": "CLEVELAND -- — Evan Mobley scored 28 points, fellow All-Star Donovan Mitchell added 23 and the Cleveland Cavaliers broke out to a big early lead and had little trouble against Minnesota, beating the Timberwolves 128-107 on Monday night.\n\n\r\n              The East-leading Cavs scored the game's first 16 points. They welcomed new addition De'Andre Hunter and improved to 25-4 at home.\n\n\r\n              The versatile Hunter, who gives Cleveland a much-needed wing defender for the playoffs, was acquired last week from Atlanta. He started his Cavs debut in place of an injured Max Strus and finished with 12 points in 23 minutes.\n\n\r\n              All-Star Anthony Edwards scored 44 to pace Minnesota, which missed its first 16 shots and scored just 12 in the first quarter.\n\n\r\n              Hunter's 3-pointer — his first basket for Cleveland — put the Cavs ahead 40-16 in the second quarter.\n\n\r\n              The Timberwolves didn't get closer than 15 the rest of the way.\n\n\r\n              Mitchell went 10 of 14 from the floor and added eight assists. Cleveland's Jarrett Allen had 14 points and 13 rebounds.\n\n\r\n              Before the game, an arbitration panel ruled t hat controlling Minnesota owner Glen Taylor must cede control of the team to Marc Lore and Alex Rodriguez, who agreed to buy the club for $1.5 billion three years ago.\n\n\r\n              Takeaways \r\n              Timberwolves: The brutal shooting start was dooming. Minnesota's first five points came on free throws before Edwards finally knocked down a 3-pointer with 2:54 left in the first.\n\n\r\n              Cavaliers: Coach Kenny Atkinson is intrigued by the possibilities with Hunter, who can start or come off the bench.\n\n\r\n              Key moment\r\n              The Cavs got 3-pointers from rookie Jaylon Tyson and Ty Jerome, after he stole an inbounds pass, in the final 3.2 seconds of the third quarter to push their lead to 26.\n\n\r\n              Key stat\r\n              Cleveland is 21-3 when Mobley scores at least 20.\n\n\r\n              Up next\r\n              Timberwolves host Milwaukee on Wednesday while Cavaliers are at Toronto in its final game before the break.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998283.728485
}