{
  "game_id": "0022200667",
  "espn_id": "401468822",
  "date": "Jan 17, 2023",
  "matchup": "DEN vs. POR",
  "headline": "Jokic leads Nuggets past Blazers for 14th straight home win",
  "body": "DENVER -- — Nikola Jokic had 36 points as part of his 13th triple-double of the season to offset a 44-point performance from Damian Lillard, and the Denver Nuggets won their 14th straight home game by topping the Portland Trail Blazers 122-113 on Tuesday night.\n\n\r\n              Jokic, who was 13 of 14 from the floor, finished with 12 rebounds and 10 assists. The Nuggets improved to 13-0 this season when the two-time reigning NBA MVP records a triple-double.\n\n\r\n              “We're going in the right direction,” Jokic said. “We're playing with a lot of confidence.” \n\n\r\n              The Nuggets were without head coach Michael Malone, who missed the game after entering the league’s health and safety protocols. Acting coach David Adelman stepped in and the Western Conference-leading Nuggets didn’t miss a beat. \n\n\r\n              In the locker room after the game, the team dumped a bucket of cold water on Adelman to celebrate.\n\n\r\n              “It was cold. No, it was cool,” cracked Adelman, who's the son of longtime NBA coach Rick Adelman. “The guys were excited.\"\n\n\r\n              This was a game that, at times, turned into the Jokic vs. Lillard Show. It was Lillard’s 214th career game with 30 or more points. \n\n\r\n              But Jokic proved too difficult to contain.\n\n\r\n              “You call plays for him and those plays sometimes turn into team-conceptual basketball because of him. He gets guys involved,\" Adelman explained.\n\n\r\n              Michael Porter Jr. had 23 points and Jamal Murray added 17 for Denver, which improved to 20-3 at home as a capacity crowd braved a snowstorm that was starting to hit the city. \n\n\r\n              The Trail Blazers dropped their eighth straight road game. \n\n\r\n              Denver led by 13 points in the fourth quarter but saw the Blazers slice into the lead. A Bruce Brown dunk helped spark another run by the Nuggets to pull away. \n\n\r\n              After the game, Lillard voiced his frustration with the officiating late in the game.\n\n\r\n              “It’s a lot of stuff that we could have done better, but down the stretch I just felt like the refs just decided the game,” said Lillard, who drew a technical foul late in the fourth quarter. “Obviously it’s going to be bumps, it’s going to be a physical game, both teams working hard to win a game. We get down the stretch and it was just like everything we did was a foul. That’s just what it seemed like to me.” \n\n\r\n              This time, there was no need for any late-game theatrics by Jokic, who hit a last-second, game-winning 3-pointer against Orlando on Sunday.\n\n\r\n              Lillard had a big first half with 30 points. He's no stranger to turning in an explosive half against Denver. He had 32 points in the second half against the Nuggets on Dec. 8. \n\n\r\n              “He’s an all-time, all-time player,” Adelman said of Lillard. “He’s something.”\n\n\r\n              TIP-INS\n\n\r\n              Blazers: F Jerami Grant had 18 points, while C Jusuf Nurkic grabbed 10 rebounds. ... Lillard was 14 of 14 from the free throw line.\n\n\r\n              Nuggets: F Aaron Gordon had 11 points. ... Denver closed out the season series against Portland with a 3-1 mark. ... It was Jokic's 89th career triple-double.\n\n\r\n              CHAUNCEY BILLUPS COURT\n\n\r\n              While in town, Denver native and Blazers coach Chauncey Billups attended a pep rally at his old high school, George Washington, where the basketball court was named in his honor. His daughter accompanied him to the event. \n\n\r\n              “I have some great memories obviously there,” Billups said. “It’s where it all started. It’s where I decided that I was going to take this basketball thing very, very serious and see where it took me. It was fun to go back over there — see the court, see it named after me, the logo on the court. It was cool.”\n\n\r\n              UP NEXT\n\n\r\n              Blazers: Start a six-game homestand Thursday against Philadelphia. \n\n\r\n              Nuggets: Host Minnesota on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994703.2624938
}