{
  "game_id": "0022300091",
  "espn_id": "401584719",
  "date": "Oct 28, 2023",
  "matchup": "IND @ CLE",
  "headline": "Aaron Nesmith has 26 points for the Pacers in a 125-113 win over the Donovan Mitchell-less Cavaliers",
  "body": "CLEVELAND -- — Aaron Nesmith scored a career-high 26 points and Tyrese Haliburton had 21 points, 13 assists and eight rebounds, sending the Indiana Pacers to a 125-113 victory over the short-handed Cleveland Cavaliers on Saturday night.\n\n\r\n              Cleveland played without three starters, including All-NBA shooting guard Donovan Mitchell (right hamstring soreness). Point guard Darius Garland (left hamstring strain) and center Jarrett Allen (left ankle bone bruise) also remain out.\n\n\r\n              Nesmith, who signed a three-year contract extension earlier in the week, had 17 points in the first half and finished with nine rebounds. The 6-foot-5 forward was acquired last summer in a trade with Boston, where he spent his first two seasons.\n\n\r\n              “After I made my first layup, then the second one, I said, ‘This is going to be a good day,’” Nesmith said. “And when I made a 3-pointer, I said it was going to be a really good day. It was all just my teammates finding me.”\n\n\r\n              Myles Turner had 20 points and 12 rebounds for Indiana, which outscored the Cavaliers 29-12 in the second quarter and won its second straight game to open the season. Bennedict Mathurin and Jalen Smith added 13 points apiece.\n\n\r\n              Mitchell was walking with a pronounced limp following the Cavaliers’ 108-105 home loss to Oklahoma City on Friday. The four-time All-Star scored 43 points in 42 minutes against the Thunder, but Cleveland blew a nine-point lead in the final two minutes.\n\n\r\n              “Donovan has some tightness that we don’t want to play around with,” Cavaliers coach J.B. Bickerstaff said. “The guys we had went out and competed their tails off.”\n\n\r\n              Evan Mobley had 33 points, 14 rebounds and three blocks for Cleveland, which has dropped two in a row. Caris LeVert started at the point and had 31 points and eight assists, while Max Strus had 21 points, 11 rebounds and six assists.\n\n\r\n              “I just tried to be aggressive and take some of the single coverage I got,” said LeVert, who scored 19 points in the first seven minutes when Cleveland jumped ahead 27-12. “Obviously, it was next man up for us because we’ve got some guys banged up.”\n\n\r\n              The Cavaliers pulled within 93-92 early in the fourth on Georges Niang’s 3-pointer, but Nesmith and Buddy Hield answered with back-to-back 3s. Indiana ended any doubt with three minutes left when Haliburton buried consecutive 3-pointers and made a layup.\n\n\r\n              The Pacers began their season Wednesday with a 143-120 home victory over Washington and lead the league with a 134.0 scoring average. Haliburton ranks first in assists at 12.0 per game.\n\n\r\n              “Tyrese was amazing in the fourth quarter and played pitch-perfect tonight,” Indiana coach Rick Carlisle said. “He found the creases, he found the advantages, and he finished the game off.”\n\n\r\n              Cavaliers guards Emoni Bates and Craig Porter Jr. were scoreless in their NBA debuts. Bates, the No. 49 draft pick, airballed his first shot, a 3-pointer in transition.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Chicago on Monday.\n\n\r\n              Cavaliers: Host New York on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996218.118405
}