{
  "game_id": "0021500961",
  "espn_id": "400828848",
  "date": "Mar 10, 2016",
  "matchup": "PHX @ DEN",
  "headline": "Mudiay's 30 points lead Nuggets overs Suns, 116-98",
  "body": "DENVER --  Devin Booker won the individual matchup, but Emmanuel Mudiay came away with the victory.\n\nMudiay scored a career-high 30 points in a matchup of rookie guards, and the Denver Nuggets beat the Phoenix Suns 116-98 on Thursday night.\n\nNikola Jokic had 18 points and 10 rebounds and Will Barton had 17 points and eight rebounds for Denver, which has won three straight. Denver has also won three in a row at home for just the second time this season.\n\n\"Anytime we can get wins at home, protect our home court, it's vital,\" Barton said. \"Keep winning, getting the crowd to come out in bunches, it makes us a more dangerous team.\"\n\nMudiay hit 13 of 20 shots but didn't outscore Booker, who had a career-high 35 in the loss. Booker scored 25 in the second half when the Suns made a run to briefly lead.\n\nBooker continued his strong rookie season by scoring in double figures for the 27th time in the past 30 games. He had 32 points Wednesday night in the Suns' home loss to New York.\n\n\"He's not afraid of the moment and the challenge and the opportunity that's been given to him,\" Denver coach Michael Malone said. \"He can play.\"\n\nSo can Mudiay, who has come on strong on this seven-game homestand. He has scored at least 15 points in the past five games and is averaging 21.6 points in that span.\n\n\"I was feeling good tonight,\" Mudiay said. \"Coach has confidence in me and told me to stay aggressive.\"\n\nBooker had 16 in the third quarter when the Suns wiped out a 15-point deficit to take a 70-69 lead on a 3-pointer by Mirza Teletovic.\n\nBooker hit his first five shots of the third quarter after going 3 for 11 from the field in the first half.\n\n\"I was more aggressive,\" he said. \"I saw them playing me tighter so I had to find other shots in transition.\"\n\nDenver, which had led the entire way until that shot, answered Teletovic's 3-pointer with a 13-4 run to end the third.\n\nBarton started the fourth with a steal and a dunk to make it 84-74.\n\nThe lead got to 11 but Phoenix, playing for the second consecutive night, got within seven on a basket by Jon Leuer, who finished with 19 points.\n\nDenver took over from there. Mudiay hit a driving layup and Jokic scored five straight points to make it 107-91 with 2:13 left.\n\n\"I thought (Jokic) and Emmanuel down the stretch made big plays,\" Malone said. \"They didn't panic.\"\n\nREAL ESTATE GUY\n\nPhoenix interim coach Earl Watson still owns a house in Denver from his brief stint with the team 10 years ago. He currently leases it to Denver G Will Barton.\n\n\"I'm beyond just a coach,\" Watson said. \"I'm business minded. I went to UCLA.\"\n\nTIP-INS\n\nSuns: G Brandon Knight scored 10 points in 25 minutes in his first game since Jan. 19. He didn't play Wednesday in the loss to New York, and Watson was fine with him sitting despite being active. \"He had a sports hernia, a slight tear, so you know that's serious,\" Watson said. \"That injury kind of ended my career, so I understand the seriousness of that injury.\"\n\nNuggets: C Jusuf Nurkic played for the first time in nine games. Nurkic missed the first 33 games after offseason surgery on his left knee, but his latest absence was a coach's decision. He had two points, two steals and three rebounds in four minutes.\n\nUP NEXT\n\nSuns: At Golden State on Saturday.\n\nNuggets: Host Washington on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994831.001293
}