{
  "game_id": "0021900516",
  "espn_id": "401161158",
  "date": "Jan 02, 2020",
  "matchup": "DET @ LAC",
  "headline": "Clippers beat Pistons 126-112; George leaves with hamstring",
  "body": "LOS ANGELES --  On a night when Paul George only played half a game, the Los Angeles Clippers had plenty in reserve.\n\nBench stars Montrezl Harrell scored 23 points and Lou Williams added 22 in a 126-112 victory over the Detroit Pistons on Thursday night that gave the Clippers consecutive wins for the first time since Dec. 13.\n\nGeorge didn't return after halftime because of left hamstring tightness. He finished with 12 points. He'll be evaluated on Friday.\n\n\"Nothing happened. He just felt tightness,\" Clippers coach Doc Rivers said. \"We just decided not to bring him back.\"\n\nKawhi Leonard scored 18 in three quarters for the Clippers, who had alternated wins and losses for nearly three weeks.\n\nBruce Brown led nine Pistons in double figures with 15 points. Andre Drummond added 10 points and 12 rebounds. They've lost four in a row on the road and eight of nine overall.\n\nTrailing by nine, the Clippers took control in the second quarter. They outscored the Pistons 35-20, including runs of 9-0 and 10-0, to take a 69-63 lead into halftime. George hit back-to-back 3-pointers and Leonard followed with another 3. Seven different Clippers scored in the spurts.\n\n\"Everybody is ready when their name is called,\" Harrell said. \"We're not really relying on one or two people. We just carried over our defensive mentality in the game and came out with a big win.\"\n\nOnce George was sidelined, his teammates stepped up. Landry Shamet hit consecutive 3-pointers that extended the lead to 18 points in the third. Maurice Harkless, who started, Williams and Harrell combined to score 13 of the Clippers' final 15 points and send them into the fourth leading 106-79.\n\n\"I enjoyed our third quarter coming out with energy and holding them to 16 points,\" Leonard said. \"We got out in transition, we ran the floor. We adjusted at halftime and did a good job defensively.\"\n\nDetroit scored on consecutive possessions just once in the third.\n\n\"I suggested at halftime that maybe we should play a little bit of defense cause we hadn't,\" Rivers said.\n\nHarrell and Williams anchored the second unit in the fourth when the starters rested. The Pistons outscored the Clippers 33-20, but they had too big a deficit to overcome.\n\n\"I liked the way we started the game and the way we ended it,\" Pistons coach Dwane Casey said. \"I liked our intensity and all of our young guys did a great job. If we would have played like that in the third quarter it would have been interesting.\"\n\nTIP-INS\n\nPistons: They're on a trip with at least one game in each time zone for the first time since Dec. 5-16, 1979. ... Nearly two years after Blake Griffin's shocking trade from the Clippers to Detroit, he's the only one of six players involved still on either roster.\n\nClippers: Patrick Beverley is expected back in the next couple games from a sprained right wrist. ... At 10-5, they tied for the league's third-best record in December. ... So far the Clippers have scored at least 130 points in six games, tied for second-most in the NBA.\n\nNEW YEAR'S SON\n\nWilliams had a son born on New Year's Eve named Syx (pronounced six), a reference to Williams being a three-time NBA Sixth Man of the Year. \"I just wanted to do something different,\" he said. Williams was in Sacramento with the team when he got word that girlfriend Rece Mitchell was going into labor. The baby wasn't due until next week. Williams caught a flight back to LA and arrived in plenty of time for the Tuesday afternoon birth of his first son. He also has two daughters. \"Lucky for us, we both have family in town,\" he said. \"A bunch of women taking care of things.\"\n\nNO GRIFFIN\n\nGriffin sat out with left knee soreness against his former team. Clipper Darrell shouted, \"I paid my money and I want to see Blake Griffin!\", drawing a smile from Griffin seated on the bench. The crowd then began chanting, \"We want Blake! We want Blake!\" \"I have a lot of love for these fans,\" Griffin said.\n\nREMEMBERING STERN\n\nRivers recalled that David Stern was the first call he received after being fired as Orlando coach in 2003.\n\n\"I'm thinking, `Wow, this is a cool thing. When you get fired the commissioner calls,\" Rivers said. \"But he was calling me to tell me was that tomorrow ABC was going to offer me the job and I better take it.\"\n\nRivers did, working with Al Michaels as a TV commentator for one season before returning to coaching with the Boston Celtics.\n\n\"He was the sheriff with love,\" Rivers said of Stern, who died Wednesday. \"People don't remember this league when he came in. This was a tough league. This was a drug-infested, image-problem league. David Stern came in and cleaned it up and kept it going.\"\n\nCasey credited Stern for doing more than any other sports commissioner to promote race relations and women in the workplace.\n\n\"I am a product of the '60s and I've seen everything, discrimination, segregation, and David made it known from the very start that he wanted diversity in the NBA,\" Casey said. \"He wanted it in the front offices and in the coaching ranks, and he made it happen.\"\n\nThere was a pregame moment of silence for Stern.\n\nUP NEXT\n\nPistons: Visit Golden State on Saturday in the middle of their six-game trip.\n\nClippers: Host Memphis on Saturday, a team the Clippers beat by two points on Nov. 27.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996284.161133
}