{
  "game_id": "0021500812",
  "espn_id": "400828699",
  "date": "Feb 19, 2016",
  "matchup": "OKC vs. IND",
  "headline": "Ellis scores 27 as Pacers beat Thunder 101-98",
  "body": "OKLAHOMA CITY -- The Indiana Pacers showed the scrappy determination they'll need to hold on to their playoff spot.\nMonta Ellis scored 27 points to help the Pacers beat the Oklahoma City Thunder 101-98 on Friday night. Indiana, looking to improve its playoff position in the tight Eastern Conference, overcame a seven-point deficit in the final three minutes.\n\"It's about us coming out of this All-Star break trying to play the right way, trying to get some wins and trying to turn our season around,\" Pacers forward Paul George said. \"Where they're (the Thunder) positioned right now, they're in the playoffs. For us, we're hanging on, and we're trying to remain and move up in the standings. So it was more so us playing desparate.\"\n\nGeorge had 22 points and 10 assists, Ian Mahinmi matched a career high with 19 points and grabbed 11 rebounds, and Myles Turner had 16 points and a career-high six blocks for the Pacers.\nGeorge Hill had nine points and nine assists and matched a career high with 11 rebounds for Indiana, which has won six of nine and is in sixth place in the East.\n\"Well, hopefully, this is a springboard victory,\" Pacers coach Frank Vogel said. \"What we talked about before the game is an opportunity to get the best win of the year, to have a momentum-building victory to start the final 29 games, this stretch run.\"\nKevin Durant had 31 points and eight rebounds and Russell Westbrook had 23 points and a career-high 18 assists for the Thunder. Serge Ibaka had 12 points and 11 rebounds and Enes Kanter added 13 points and 10 rebounds for Oklahoma City, which had won 14 of 16 heading into the All-Star break.\nThe Thunder gave up four 3-pointers in the final 2:28 to squander their lead.\n\"Breakdowns,\" Durant said. \"We gave up 3s, they broke our backs. That's the game.\"\nTurner hit a 3 from the right corner on an assist from Ellis to tie the score at 95 with 55.4 seconds to play. It was the first 3 of the season for the 6-foot-11 rookie center.\n\"I was surprised that Monta passed it to Myles,\" George said, laughing. \"We always joke with Monta shooting 3 and stepping out there. So I was surprised that Monta made that play and trusted the young fella.\"\nDurant missed a 3, then Ellis responded with a 3 with 18.8 seconds remaining.\nWestbrook missed a layup, the Pacers rebounded and George was fouled with 10.9 seconds remaining. He missed the first free throw and made the second to make it 99-95.\nDurant hit a 3 with 5.9 seconds remaining to pull the Thunder to 99-98. George was fouled with 5.1 seconds to play. He made both free throws to make it a three-point game, and Westbrook missed a deep, off-balance 3 at the buzzer.\nWestbrook had 11 points and 12 assists in the first half. He matched the most assists he's has had in a half in his career. He had 12 assists before he registered his first turnover. Durant scored 17 points and Ibaka added 10 before the break to help the Thunder take a 51-44 lead.\nOklahoma City led 76-67 at the end of the third before Indiana rallied.\n\"Just a little more focus on the floor and we'll be fine,\" Durant said. \"I think for the whole game, we played a really good defensive game outside of those last few minutes.\"\n---\nSTAT LINES\nGeorge had double-digit assists for just the fifth time in his career.\n\"Paul had a great game,\" Vogel said. \"He didn't shoot the ball that great, but he's always been a willing passer and a great reader of defense. He wants to attack, look for his shot, and when help comes, share it.\"\nQUOTABLE\nThunder general manager Sam Presti earlier in the day on rumors about Durant's eventual landing spot in free agency: \"I think we would have to cut him up into 29 pieces to get him to play every place he is supposed to be going, but I think you have to sit back and understand that is part of the business.\"\nTIP-INS\nPacers: G Rodney Stuckey sat out with a right foot sprain/bone bruise. ... G/F C.J. Miles did not play because of a stomach virus. ... The Pacers shot 50 percent in the fourth quarter.\nThunder: Assistant coach Mark Daigneault, who had moved from up head coach of the D-League affiliate Oklahoma City Blue to help Thunder coach Billy Donovan for the rest of the season, stayed with the Blue on Friday because interim Blue coach Jarrell Christian's wife was having a baby. Daigneault had moved up because assistant Monty Williams is mourning his wife's death and assistant Maurice Cheeks was out following hip surgery.\nUP NEXT\nPacers: At Magic on Sunday.\nThunder: Host Cavaliers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994154.114793
}