{
  "game_id": "0021600467",
  "espn_id": "400899909",
  "date": "Dec 26, 2016",
  "matchup": "PHX @ HOU",
  "headline": "Harden scores 32 points and Rockets cruise past Suns 131-115",
  "body": "HOUSTON --  Ask most anyone associated with the Rockets about Montrezl Harrell, and inevitably, they'll talk about his energy.\n\nNow that Harrell is starting, Houston is starting to see more of how that vigor can help the team.\n\nJames Harden had 32 points and 12 assists in three quarters, Harrell added 14 points and the Rockets never trailed in a 131-115 win over the Phoenix Suns on Monday night.\n\nIt was the third double-digit scoring game in a row for Harrell while filling in at center for Clint Capela, who is out for at least a month with a small fracture on his left fibula. Nene started the first game after Capela was injured before coach Mike D'Antoni decided to go with Harrell, a second-year player out of Louisville.\n\n\"He's playing great -- just his energy,\" D'Antoni said. \"His defense is really good, we can switch a lot and we can do different things. He covers up for a lot of people, he takes charges. I think he's been playing terrific.\"\n\nHarrell said his mindset didn't change when he was moved into the starting lineup.\n\n\"Just playing the game, that's all I got to do,\" he said. \"Come in with a lot of energy and try to bring that spark to my team every night. My team feeds off it great and I just try to keep it going. I'm not doing nothing special.\"\n\nIt was the 12th 30-point game this season for Harden, who made 12 of 15 free throws, and he had at least 30 points and 10 assists for the ninth time this season.\n\n\"They are a great all-around offensive team,\" Phoenix's Eric Bledsoe said. \"James pretty much controls everything out there. There's really nothing we can do about it now.\"\n\nHouston led by at least 20 points for most of the night and was up by 27 entering the fourth quarter. Harden didn't play after that, and D'Antoni had the rest of his starters on the bench by the middle of the fourth quarter.\n\nBledsoe led the Suns with 24 points, and Brandon Knight added 21 off the bench.\n\nThe Rockets led by 26 at halftime and opened the third quarter with a 12-4 spurt to extend their advantage to 81-47. Patrick Beverley got things going with a 3-pointer, and Harden added a 3.\n\n\"GRANNY\" STYLE HITS THE NBA\n\nRockets rookie Chinanu Onuaku made his NBA debut in the fourth quarter and hit a pair of free throws underhanded late. Onuaku has been using the \"Granny\" style at the free-throw line at least since he was in college at Louisville.\n\nHe finished with six points and three rebounds.\n\nTIP-INS\n\nSuns: Bledsoe received a technical foul in the third quarter. ... Devin Booker fouled out with 7.9 seconds left in the third quarter. He finished with 16 points. ... Dragan Bender had 11 points and 13 rebounds.\n\nRockets: The Rockets have won 12 games this month, which is their most ever in December. ... The Rockets had 69 points in the first half to give them at least 60 points before halftime for the 17th time this season. ... Trevor Ariza tied a season high with 10 rebounds. ... Beverley left the game in the fourth quarter with a bruised left thigh, and D'Antoni said he might have to sit out Tuesday.\n\nGETTING A BREAK\n\nHarden hasn't missed a game since the 2014-15 season when he had to sit one out because of a suspension. For a player who logs so many minutes, a game like this one where he could take the fourth quarter off was a nice break on the front end of a back-to-back.\n\n\"It's good,\" he said. \"I've had several of those this season and I don't remember the last time I had (so many). So it feels good, guys are playing well. We're confident in each other and another test for us tomorrow.\"\n\nUP NEXT\n\nSuns: Visit San Antonio on Wednesday night.\n\nRockets: Visit Dallas on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764995984.170702
}