{
  "game_id": "0022300279",
  "espn_id": "401584907",
  "date": "Dec 01, 2023",
  "matchup": "PHX vs. DEN",
  "headline": "Nikola Jokic has 21 points, 16 assists, Nuggets hold off Suns 119-111",
  "body": "PHOENIX -- — Nikola Jokic looked content to spend most of his Friday night facilitating, setting up baskets with passes left and right as the Denver Nuggets built a big first-half lead.\n\n\r\n              By late in the fourth quarter, that advantage had nearly vanished. That's when the two-time MVP went back to scoring.\n\n\r\n              Jokic had 21 points and 16 assists, including a difficult layup in traffic with 24.1 seconds left, and the Nuggets held off the Phoenix Suns 119-111 for a hard-fought victory.\n\n\r\n              “That’s another night of just incredible, unselfish basketball,” Nuggets coach Michael Malone said. “Everyone playing for the man next to them, making the right play.”\n\n\r\n              Down 17 in the first half, the Suns — on a night Kevin Durant moved into 10th place on the NBA's career scoring list — cut Denver's lead to 94-91 entering the fourth.\n\n\r\n              Phoenix tied it three times early in the fourth and the game stayed within one possession for much of the period, but Jokic and Michael Porter Jr. were among multiple players who made clutch buckets to keep the Nuggets ahead. \n\n\r\n              Denver has won four straight. All five starters — including Jokic, Jackson, Porter, Justin Holiday and Kentavious Caldwell-Pope — scored at least 15 points. Jackson finished with 20. The Nuggets had 38 assists and just nine turnovers.\n\n\r\n              “That's our play style,” Jokic said. “When we make shots like that, it's much easier for us to have a good game. I think we create open looks — it's just a matter of if we're going to make it or not.”\n\n\r\n              Jusuf Nurkic led the Suns — playing without Devin Booker — with a season-high 31 points but fouled out after being called for a charge with 45 seconds remaining, which was upgraded to a Flagrant 1, meaning Jokic got to shoot two free throws. He made one of two for a 115-111 lead and Denver retained possession.\n\n\r\n              Jokic followed with his tough layup, finishing over three Suns defenders, to put the game away.\n\n\r\n              “They're a good team,” Nurkic said. “Give them credit, they got the win.”\n\n\r\n              Durant added 30 points but shot just 8 of 25 from the field, including 0 for 10 in the second half. Nurkic made 13 of 22.\n\n\r\n              Durant moved in 10th place on scoring list late in the second quarter, driving the baseline for a layup to pass Moses Malone. Durant finished the game with 27,423 career points. Malone had 27, 409 in the NBA after starting his professional career with two seasons in the ABA.\n\n\r\n              Denver jumped out to a 41-30 lead going into the second quarter after shooting 79.2% (19 of 24) from the field. The Nuggets settled for a 70-63 advantage at halftime.\n\n\r\n              “We didn't play with nearly enough toughness and attention to detail in the first half,” Vogel said. “It was one of our worst defensive halves. But you've got to credit the Nuggets and Nikola Jokic — that's why he's one of the best in the world. He can take any four teammates and create great looks for those guys. He's really special.”\n\n\r\n              Both teams were missing key pieces. The Suns were playing without Booker (ankle) and Bradley Beal (back) while the Nuggets were without Jamal Murray (ankle) and Aaron Gordon (heel).\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At Sacramento on Saturday night.\n\n\r\n              Suns: Host Memphis on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996666.8840199
}