{
  "game_id": "0022200801",
  "espn_id": "401468956",
  "date": "Feb 04, 2023",
  "matchup": "DEN vs. ATL",
  "headline": "Nuggets beat Hawks 128-108, tie Boston for NBA's best record",
  "body": "DENVER -- — Jamal Murray scored a season-high 41 points, Nikola Jokic had his 18th triple-double of the season and the Denver Nuggets won their third straight game, beating the Atlanta Hawks 128-108 on Saturday night.\n\n\r\n              Jokic finished with 14 points, 18 rebounds and 10 assists and recorded the 94th regular-season triple-double of his career. Michael Porter Jr. added 23 points for the Nuggets, who are 19-1 in their last 20 home games and moved into a tie with the Boston Celtics for the best record in the NBA at 37-16.\n\n\r\n              With the Nuggets' success, Murray said Denver has to be ready to deal with the best effort from opposing teams on a nightly basis.\n\n\r\n              “We can’t underestimate any team. We’ve got to come prepared. We’ve got a target on our backs,” Murray said. “We’ve seen that, even today. They stuck in it for a while. We just had to lock in and we did that.”\n\n\r\n              Dejounte Murray scored 28 points to lead the Hawks. De’Andre Hunter added 20 points.\n\n\r\n              “This is a tough place to come back when you dig such a deep hole like as did in the first half,” Hawks coach Nate McMillan told the Atlanta Journal Constitution.\n\n\r\n              \"I thought they did a good job of making us earn everything that we got,” McMillan said. “We were making tough shots and I didn’t think we had the ball movement, but I thought it was due to their defense. They just made us work for everything on the offensive end the floor.”\n\n\r\n              Trailing by 18 points at the break, the Hawks narrowed the deficit to 97-86 by the start of the fourth quarter on a tip-in by Onyeka Okongwu in the final minute of the third. Atlanta defenders had blocked the Nuggets’ last three field goal attempts in the third period.\n\n\r\n              Hunter’s jumper with 5:49 remaining got the Hawks within 109-101. But the Nuggets, with Murray leading the way, responded with a 15-2 run that pushed their lead to 124-103 with 2:23 remaining. The Hawks never threatened again. Murray had 11 of his points in the late flurry, which Jokic helped get started with an alley-oop pass to Aaron Gordon for a layup for his 10th assist of the game. “It was such a weird game,” Nuggets coach Michael Malone said. “If you look at quarters one and three, we played no defense. Quarters two and four, I thought our defense was really good. Most importantly, the fourth quarter, 22 points allowed, a lot of good things for us and that allowed us to pull away.”\n\n\r\n              Murray had 22 of his points in the first half, including a 3-pointer off a feed from Jokic following an Atlanta turnover in the waning seconds of the second quarter. That helped the Nuggets take a 70-52 halftime lead.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: G Trae Young was held out of the game because of a non-COVID-19 illness. \n\n\r\n              Nuggets: Murray’s career-high is 50 points, at Cleveland ON Feb. 19, 2021. F Aaron Gordon was back in the starting lineup after missing the previous game with a left ankle sprain. … G Kentavious Caldwell-Pope left the game in the second quarter with a right ankle sprain. He did not return.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Visit New Orleans on Tuesday to cap a five-game trip.\n\n\r\n              Nuggets: Head to Minnesota on Sunday night for the second in a back-to-back set.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994694.439853
}