{
  "game_id": "0021900246",
  "espn_id": "401160888",
  "date": "Nov 25, 2019",
  "matchup": "TOR vs. PHI",
  "headline": "Joel Embiid held scoreless for 1st time in career as Raptors beat 76ers 101-96",
  "body": "TORONTO -- Joel Embiid returned to Toronto and had another night he'd rather forget.\nPascal Siakam scored 25 points, Fred VanVleet added 24 and the Raptors held Embiid scoreless for the first time in his career in a 101-96 victory over the Philadelphia 76ers on Monday night.\n\"I can't have this type of production,\" Embiid said. \"I would have never thought I would be here talking about zero points in an NBA game, but it is what it is. Some nights you make shots, some nights you don't. Some nights you're hot, some nights you're cold.\"\nIt was the first meeting between the teams since Kawhi Leonard's buzzer-beater that bounced off the rim four times before dropping, the winning basket in Game 7 of the second round of the playoffs in May. Toronto went on to win its first NBA title, before Leonard left for the LA Clippers.\nEmbiid, who was left tearful after that postseason defeat, didn't do much Monday to erase those bad memories. Still, his teammates didn't seem worried about their star center's scoreless outing.\n\"Everyone has down games,\" Sixers guard Ben Simmons said. \"No one is Superman. It happened tonight to Jo, but he's going to be good.\"\nEmbiid shot 0-for-11, missing all four of his shots from 3-point range and going 0-for-3 at the free throw line. He finished with a game-high 13 rebounds.\n\"Defensively, they're everywhere,\" Embiid said of the Raptors. \"They're so long and they make sure they pack the paint.''\nToronto's Marc Gasol scored just three points, but played a large part in controlling Embiid.\n\"I think you give Marc Gasol, a former Defensive Player of the Year, credit,\" Sixers coach Brett Brown said. \"It was a long night for Jo.\"\nEmbiid was playing for the fourth time in six days, but he denied feeling worn down by Philly's schedule.\n\"I didn't look fatigued, and I was definitely not fatigued,\" he said.\nRondae Hollis-Jefferson had 16 points and 10 rebounds for the Raptors, who posted their 14th consecutive home victory over the 76ers.\nOG Anunoby scored 12 points, Terence Davis had 11 and Norman Powell 10 as Toronto improved to 7-0 at home.\nJosh Richardson scored 25 points, Tobias Harris had 18 and Mike Scott 12 for the 76ers, who have not won a regular-season game in Toronto in more than seven years.\n\"We look back at this game, we know we should have won this one, but Toronto made plays,\" Simmons said.\nSimmons had 10 points, 14 assists and nine rebounds. Al Horford scored 11 points and added 10 rebounds for the 76ers, who had their four-game winning streak snapped.\nThe Raptors led 88-87 on a driving layup by Davis with 7:31 remaining in the fourth. Philadelphia's Furkan Korkmaz hit a 3, Horford made a baseline jumper and Harris added a hook shot as the 76ers used a 7-0 run to build a 94-88 lead with 5:16 left to play.\nPowell and VanVleet hit 3-pointers that cut the gap to two, 96-94, but Toronto missed three straight chances to tie it. Gasol missed a pair from the line, a jump shot by Siakam missed the mark and Harris blocked Anunoby's fast-break drive after an Embiid turnover.\nSiakam ended Toronto's drought with a three-point play, giving the Raptors a one-point edge, 97-96, with 1:01 left.\nSiakam forced a turnover on an entry pass from Simmons with 12 seconds remaining to preserve Toronto's lead. VanVleet was fouled and made two shots, giving the Raptors a three-point cushion.\nHarris and Simmons missed 3-pointers before Siakam finished it with a thunderous dunk.\n\"We ended it with eight consecutive stops to end the game,\" Raptors coach Nick Nurse said. \"That's pretty good, especially in a close game like that.\"\nTIP-INS\n76ers: F Kyle O'Quinn (left calf) was not available.\nRaptors: G Matt Thomas (fractured left finger) was not available. Thomas was one of six Raptors sidelined by injury, including G Kyle Lowry (left thumb), F Serge Ibaka (right ankle), C Dewan Hernandez (right thumb), F Patrick McCaw (left knee) and F Stanley Johnson (left groin). ... Coach Nick Nurse said Ibaka could return this weekend. After hosting the Knicks on Wednesday, Toronto visits Orlando on Friday, before hosting Utah on Sunday.\nBEEN A WHILE\nThe 76ers haven't won a regular-season game north of the border since Nov. 10, 2012, when they beat Toronto 93-83. Philadelphia's leading scorers that night were Jrue Holiday, Nick Young and Thaddeus Young, each of whom scored 16 points. At the time, it was Philadelphia's fifth win in six meetings with the Raptors.\nUP NEXT\n76ers: Host Sacramento on Wednesday night.\nRaptors: Host New York on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995644.7722828
}