{
  "game_id": "0022201201",
  "espn_id": "401469356",
  "date": "Apr 06, 2023",
  "matchup": "DEN @ PHX",
  "headline": "Paul makes 7 3s, Suns beat Nuggets for 7th straight win",
  "body": "PHOENIX -- — Chris Paul made a career-high seven 3-pointers and the Phoenix Suns won their season-best seventh game in a row, holding off the short-handed Denver Nuggets 119-115 on Thursday night.\n\n\r\n              Kevin Durant added six 3s and led the Suns with 29 points in 40 minutes, while Paul scored 25. Durant also had seven rebounds as the Suns improved to 8-0 with the 13-time All-Star in their lineup. But it wasn't easy even though the Nuggets were missing all five normal starters.\n\n\r\n              Devin Booker made just 3 of 12 shots, but still scored 15 as he was 8 for 8 from the free throw line. Booker also had eight assists, while Deandre Ayton scored 16 points and reserve Torrey Craig had 11 for the Suns (45-35), who made 17 3-pointers to eight for Denver.\n\n\r\n              “It was a weird game, sort of up and down,” Paul said. “I think every game we play is still a learning experience.”\n\n\r\n              Paul’s final 3-pointer of the night with 3:07 to play made it 114-107, the biggest lead of the night for either team at that point. Paul made 7 of 12 from behind the arc. \n\n\r\n              “I should have made more,” Paul said. “That's why these games are important. This is a new way, I never really played with guys getting doubled like this. You need to use these games.”\n\n\r\n              Durant said: “We just need CP to read the game like he has since college, high school. Whatever the game tells him to do, he's going to go out there and do it.”\n\n\r\n              As for playing 40 minutes, Durant was glad to get that opportunity. \n\n\r\n              “I felt good, but it's always good to log in to late-game minutes,” he said. \"Forty is a number I love; I like to hover around that number. We had to make some meaningful plays in the fourth so it was good for us.”\n\n\r\n              Bruce Brown led Denver (52-28) with 31 points on 11-of-18 shooting. Reggie Jackson had 20 points and six assists, Christian Braun had 15 points, Jeff Green scored 14 and DeAndre Jordan had 12 points and 11 rebounds.\n\n\r\n              Nikola Jokic had missed three games with a calf injury before returning to play 25 minutes in Tuesday’s loss to Houston. He was sidelined again Thursday, as were Aaron Gordon (right shoulder), Michael Porter Jr. (left heel), Jamal Murray (right thumb) and Kentavious Caldwell-Pope (illness).\n\n\r\n              Nuggets coach Michael Malone was pleased that his team gave the full-strength Suns a game all the way. \n\n\r\n              “I am happy and almost a little (ticked) because I thought we should have won,” Malone said. \"Our guys fought, competed, played their hearts out and gave us a chance to win.\n\n\r\n              “If you take away the 3-point line I think our defense was pretty good for most of the night.”\n\n\r\n              MANAGING THE WORKLOAD\n\n\r\n              The Nuggets clinched the No. 1 seed in the West on Wednesday when Memphis lost to New Orleans. They’re also dealing with enough injuries that the entire starting five was out Thursday.\n\n\r\n              Two-time MVP Jokic is averaging 24.8 points, 11.9 rebounds and 9.8 assists.\n\n\r\n              “We’re just trying to be smart about managing those injuries as we move forward,” Nuggets coach Michael Malone said before the game. “Speaking to the players individually and speaking to our training staff, having played 79-80 games to this point, those guys have been dealing with these injuries for a while. We want to be smart about what kind of positions we put them in.”\n\n\r\n              The Suns also are locked in to the No. 4 seed, but with Durant having so few games with his new Suns teammates, Williams is trying to strike a balance with what’s best for everyone entering the postseason.\n\n\r\n              “I think we have to try to use these games to get guys to a place that we think is comfortable for them,” Williams said.\n\n\r\n              NOTES\n\n\r\n              The Suns were without G T.J. Warren (illness). ... Thursday’s crowd of 17,071 at the Footprint Center was the 66th sellout in a row with one regular-season home game remaining. ... Phoenix won three of the four games between the teams this season.\n\n\r\n              NEXT\n\n\r\n              Nuggets: At Utah Saturday.\n\n\r\n              Suns: At Los Angeles Lakers on Friday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994671.4212291
}