{
  "game_id": "0021800191",
  "espn_id": "401070872",
  "date": "Nov 12, 2018",
  "matchup": "MIA vs. PHI",
  "headline": "Embiid scores 35, 76ers top reeling Heat 124-114",
  "body": "MIAMI --  Joel Embiid did whatever he wanted, and Jimmy Butler had to be thrilled.\n\nIt's now time to see what they'll do together.\n\nEmbiid scored 35 points and grabbed 18 rebounds, JJ Redick added 25 points and the Philadelphia 76ers added to Miami's early-season struggles by topping the Heat 124-114 on Monday night. The win came hours after the 76ers finalized a trade with Minnesota to land Butler, the four-time All-Star who was in Philadelphia and not with the club in Miami.\n\n\"It's hard to win on the road in this league, especially when you don't have your full team,\" Redick said.\n\nHaving Embiid helped.\n\nIt was the second time in a four-day span that Embiid went for at least 35 and 18; he had 42 points and 18 rebounds on Friday against Charlotte. Embiid was also 16 for 20 from the foul line -- marking the ninth time that a player took at least 20 free throws against Miami and the first since LeBron James did it on Feb. 4, 2010.\n\n\"The way he has been dominating, it truly doesn't surprise me,\" 76ers coach Brett Brown said. \"I will admit, when I come back and I see the stat sheet, I'm shocked at how dominating at times he is.\"\n\nFurkan Korkmaz scored 16 and Ben Simmons and Mike Muscala each had 13 for Philadelphia. Butler will be introduced at the 76ers' facility in Camden, New Jersey, on Tuesday, before he flies to Orlando and makes his debut with Philly on Wednesday night against the Magic.\n\nGoran Dragic scored 22 points for Miami, which got 17 from Josh Richardson and 14 from Wayne Ellington. The Heat have dropped three straight, all of them at home.\n\nMiami was called for 30 fouls -- five each on centers Hassan Whiteside and Kelly Olynyk, who were both limited to 22 minutes. The Heat also had 12 turnovers in the second half.\n\n\"Some costly ones, momentum-changing ones,\" Heat coach Erik Spoelstra said.\n\nIt was the first meeting between the clubs since last season's playoffs, when Philadelphia ousted Miami in five games in the first round. And while Philadelphia led most of the way in this one, the 76ers never really pulled away until the final moments.\n\nTheir first double-digit lead of the night came on Embiid's step-back 3-pointer with 1:59 remaining. Simmons got loose for a dunk on the next Philadelphia possession, and that was the signal for most Miami fans to start heading to the exits.\n\n\"It's time. It's definitely time to start looking in the mirror,\" Richardson said after Miami fell to 5-8. \"It shouldn't have gotten to this point but it's definitely time to start cracking down and problem-solving.\"\n\nTIP-INS\n\n76ers: Rookie Landry Shamet is now wearing No. 1 -- he was No. 23, which will be worn starting Wednesday by Butler. ... Embiid got his 14th double-double in 15 games this season. ... The 76ers scored exactly 32 points in each of the first three quarters, before settling for a mere 28 in the fourth.\n\nHeat: Dwyane Wade missed his fourth consecutive game because of the birth of his daughter. He'll miss at least the next three games as well. ... Miami has had a pair of four-game homestands already this season, and has gone 3-5 in those games. ... Whiteside had 13 points and 11 rebounds, and Olynyk scored 13 for Miami.\n\nSHOELESS SNAP\n\nMiami needed only 126 seconds of the second quarter to go on a 15-0 run, one that was snapped by a 3-pointer from Redick -- who was coming out of one of his sneakers at the time. Redick lost his left shoe one possession earlier, tried in vain to get it on properly, and wound up swishing a 3 with it still askew.\n\nTHANKING VETS\n\nOn Military Appreciation Night, the Heat -- who have paid tribute to veterans in pregame ceremonies for years -- honored one of their own. Derric Franklin, who served eight years in the Army and was deployed in both Iraq and Afghanistan, was the honoree. Franklin is the coach of the Heat team in the NBA 2K League, and was surprised on the court by his mother and stepfather.\n\nUP NEXT\n\n76ers: Visit Orlando on Wednesday.\n\nHeat: Visit Brooklyn on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995267.840568
}