{
  "game_id": "0021500962",
  "espn_id": "400828849",
  "date": "Mar 10, 2016",
  "matchup": "LAL vs. CLE",
  "headline": "Kobe outscores LeBron in their final duel, but Cavaliers top Lakers",
  "body": "LOS ANGELES --  LeBron James savored every bump from Kobe Bryant in the low post. He relished every down-court sprint, every big shot -- and even the fake that left him sailing helplessly through the air while Kobe pivoted around him for a layup.\n\nThe farewell duel between two of the greatest players in NBA history was quality entertainment, even for the two men involved.\n\n\"I wish I could play against him every single night,\" James said. \"Just that competitive juice, that feeling of just going against one of the greatest, you can never take that for granted.\"\n\nJames scored 24 points while sharing a court with Bryant for the final time, leading the Cleveland Cavaliers to a 120-108 victory over the Los Angeles Lakers on Thursday night.\n\nBryant, who will retire after the season, had 26 points on 11-of-16 shooting. He ignored his constantly sore right shoulder to make sure he didn't miss his 22nd meeting with James on an NBA court, albeit never in the playoffs.\n\n\"It was just fun,\" Bryant said. \"I enjoy the physicality of it. Playing against him is fun because of his size. It's always fun to bump with him and to have that physicality, backing him down and driving and bumping. That's fun.\"\n\nAfter a pregame chat and hug with the crowd on its collective feet just to watch pregame warmups, Bryant and James both had vintage individual moments in the final edition of this friendly rivalry.\n\nBryant got a raucous standing ovation in the first quarter after that graceful post move, faking James out of his shoes and stepping around him.\n\n\"It was everything for a competitor like myself,\" James said. \"I know he was not taking this game off for sure, and I definitely wasn't taking it off. It was great to be out there.\"\n\nKyrie Irving scored 26 points and Channing Frye had 21 for the Cavaliers, who have won on the first two stops of their four-game West Coast road trip. Irving needled Bryant after a short free throw, and Kobe responded by guarding the youngster.\n\n\"It's just great to have that mentorship out on the floor, but our relationship goes (further) off the court than it does on the floor,\" said Irving, who recalled challenging Bryant to a 1-on-1 game at U.S. national team camp. \"But to play against him one last time here in the Staples, it means a lot. I'll remember it for the rest of my life.\"\n\nBryant and James have been parallel superstars for the past 13 seasons. The U.S. national team teammates are the No. 3 and No. 13 scorers in NBA history, with 30 combined All-Star selections and seven championship rings.\n\nThe superstars are clearly friends, but their lack of a playoff showdown means they never developed enough history to suit Bryant. Either Bryant or James has played in the past nine NBA Finals, but never at the same time.\n\n\"It's not a rivalry, but I wouldn't say it's because we like each other too much,\" Bryant said. \"I don't like anybody that much.\"\n\nBryant hit back-to-back jumpers in the second quarter while James threw down a pair of thunderous dunks. Bryant scored seven quick points in the third quarter, but the Cavaliers stretched their lead with James leading the way.\n\nJames and Bryant returned to the game midway through the fourth quarter with Cleveland well in front. Bryant hit a 3-pointer with 3:17 to play to trim Cleveland's lead to 12 points, but went to the bench moments later with fans chanting his name.\n\nROOKIE LOVE\n\nD'Angelo Russell scored 24 points, Julius Randle added 15 and Marcelo Huertas had a career-high 13 for the Lakers, whose two-game winning streak ended. Russell scored at least 20 points for the seventh time in eight games. \"He's been playing some good ball,\" James said of the No. 2 pick. \"Obviously, as a rookie you have some ups and downs, but they have a good player.\"\n\nTIP-INS\n\nCavaliers: Timofey Mozgov played despite being questionable with an illness. ... Coach Tyronn Lue spent his first three NBA seasons with the Lakers, absorbing lessons from Bryant along the way. \"It was just his work ethic, his determination and his will to win,\" Lue said. \"In the summertime, if you wanted to work out with him, he's working out at 5:30 in the morning. And when we practiced during the season, he was there 2 1/2 hours, three hours before everyone else.\"\n\nLakers: Huertas, the Brazilian playmaker signed from Barcelona last summer, has been on a stretch of strong play after a quiet start to his NBA career. He scored nine points in the first quarter on 4-for-4 shooting. ... NFL MVP Cam Newton watched from courtside in a comically oversized hat similar to Pharrell Williams' trademark lid. Other celebrities in attendance included John Legend and Chrissy Teigen, Kings goalie Jonathan Quick and Rams cornerback Trumaine Johnson.\n\nUP NEXT\n\nCavaliers: At Clippers on Sunday.\n\nLakers: Host Knicks on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994251.6368709
}