{
  "game_id": "0021900692",
  "espn_id": "401161334",
  "date": "Jan 26, 2020",
  "matchup": "IND @ POR",
  "headline": "Lillard scores 50 as Trail Blazers beat Pacers 139-129",
  "body": "PORTLAND, Ore. --  On a night when he set another franchise mark, Damian Lillard's thoughts weren't on his game.\n\nThey were on Kobe Bryant.\n\nLillard had 50 points and 13 assists, becoming the first Portland player with 40-plus points in three straight games, and the Trail Blazers beat the Indiana Pacers 139-129 on a Sunday marked by grief over the death of the NBA great.\n\n“I think it was the right decision for us to go out there and compete today in his honor. I think that's what he would have wanted,\" Lillard said. \"Obviously, throughout the game you think about it. The timeouts, and just random dead moments of the game, he's on your mind, because it's just such an unfortunately sad situation. It was a tough game to play as far as your energy and where your heart is, to say the least.”\n\nThe Trail Blazers honored Bryant with 24 seconds of silence before the game, and the team took a 24-second shot-clock violation at the start before the Pacers took an eight-second timeline penalty, recognizing Bryant's jersey numbers. Several fans at the Moda Center wore Lakers jerseys, saluting a player who spent his entire career with rival Los Angeles.\n\nCJ McCollum returned after a three-game absence because of an ankle injury and added 28 points for the Blazers (20-27). Hassan Whiteside had 21 points and 14 rebounds.\n\nDomantas Sabonis, whose father Arvydas played for the Blazers, had 27 points, 14 assists and 11 rebounds for the Pacers in his second career triple-double. His first came last Sunday at Denver.\n\n\"We’ve been having a lot of injuries all year so I just wanted to come out, be aggressive and help the team any way I can,\" Sabonis said.\n\nIndiana (30-17) hasn't won in Portland since the 2007-08 season, a streak of 11 games.\n\nBut there was a pall over the game because of the helicopter crash earlier Sunday that killed Bryant, one of his daughters, and seven others in Southern California. Both coaches spoke about Bryant before the game.\n\n“Anytime you played against him, you knew you were going to get his best effort. That’s just the way he played the game,\" Blazers coach Terry Stotts said.\n\nPacers coach Nate McMillan was an assistant for U.S. national teams that featured Bryant in the 2008 and 2012 Olympics. A former coach of the Trail Blazers, McMillan recalled how Bryant once scored 65 points against Portland.\n\n“He’s a guy that, as he was growing up, I think there was that commercial, `I want to be like Mike.’ He wanted to be like Mike. And now he has young kids saying, `I want to be like Kobe,'\" McMillan said. \"I had the opportunity 2008, 2012, to see those great guys, Kobe, Wade and LeBron, work. And he really set the example in 2008 for how he prepared, and how the world respected him -- the attention he got in Beijing. It was unreal to see how those fans there treated him and respected him.\"\n\nNBA veteran Carmelo Anthony, who finished with 14 points for the Blazers, choked up while talking about Bryant after the game. They were teammates on the Olympic team and had spoken just a few days ago.\n\n“Our friendship, our relationship, was deeper than basketball,\" Anthony said. \"It was family. It was friendship. Basketball was the last piece of connective tissue between us two.”\n\nThe Pacers were without starter Malcolm Brogdon, who missed his second straight game in concussion protocol after taking an elbow against Phoenix on Wednesday. Indiana center Myles Turner also sat out because of illness.\n\nLillard hit a buzzer-beating 3-pointer to end the first quarter and give the Blazers a 36-27 lead. Whiteside's alley-oop dunk from Lillard put the Blazers up 57-49 late in the half, and Portland had a 66-56 lead at the break.\n\nWhiteside had another dunk off a pass from Anthony and added a free throw to put the Blazers up 93-76. Portland led by as many as 21 but Indiana closed to 103-96 at the end of the third quarter.\n\nTIP-INS\n\nPacers: Completed a 3-2 trip. \"We came in trying to go 4-1 on this road trip. I thought we fought and we gave it our all. Obviously we are down a couple of men but our mindset is always next man up,\" said Jeremy Lamb, who finished with 28 points. ... Victor Oladipo, who has been sidelined for a year by a ruptured quadriceps tendon, is eyeing a return Wednesday against Chicago at home.\n\nTrail Blazers: The team held ‘90s Night, part of its 50th anniversary celebration. Stars from that era such as Jermaine O’Neal, Chris Dudley, Terry Porter and Brian Grant were among those on hand. ... Lillard led all scorers with 23 points at halftime.\n\nLILLARD'S MILESTONES\n\nEarlier in the week, Lillard scored a franchise-record 61 points in an overtime win against the Warriors. He has also made eight or more 3-pointers in his last three games, joining Golden State star Stephen Curry as the only NBA players with as many over three games.\n\nUP NEXT\n\nThe Pacers host Chicago on Wednesday.\n\nThe Trail Blazers host Houston on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995843.989207
}