{
  "game_id": "0022400623",
  "espn_id": "401705189",
  "date": "Jan 23, 2025",
  "matchup": "TOR @ ATL",
  "headline": "Scottie Barnes, Raptors hold off Hawks 122-119 for just second road win of season",
  "body": "ATLANTA -- — Scottie Barnes had 25 points, including a key basket in the final minute, and the Toronto Raptors picked up their second road win of the season with a 122-119 victory over the Atlanta Hawks on Thursday night.\n\n\r\n              Bruce Brown had 18 points, while Jacob Poeltl and Chris Boucher each had 17 in the opener of a two-game series in Atlanta.\n\n\r\n              The Hawks had a chance to tie with 2.7 seconds left, but good defense forced a 3-pointer by Onekya Okongwu at the buzzer that was an airball.\n\n\r\n              Bogdan Bogdanovic shook off a recent shooting slump to score 23 points and hit three of his five 3-pointers for the Hawks. He had missed his last 14 field goal attempts entering the game. Dyson Daniels had 22 points, eight rebounds, five assists and four steals.\n\n\r\n              The Hawks have lost three straight. They host Toronto again on Saturday.\n\n\r\n              Grady Dick and RJ Barrett scored 15 points apiece for the Raptors, who have won four of five.\n\n\r\n              Hawks forward Jalen Johnson injured his left shoulder when he fouled Barnes in the second quarter. He left the court immediately and did not return to the game. He had been battling right shoulder inflammation coming into the game.\n\n\r\n              Takeaways\r\n              Raptors: The Raptors looked sharp in holding a double-digit lead for most of the first half and continue to play their best ball of the season. \n\n\r\n              Hawks: The Hawks have lost the first two home games to the Pistons and Raptors after an extended road trip and trailed by double digits for most of both games. The injury to Jalen Johnson is concerning as he entered the game averaging 19.3 points and 10.2 rebounds.\n\n\r\n              Key moment\r\n              Barnes hit a difficult floater with 55 seconds left to give the Raptors a 120-117 lead.\n\n\r\n              Key stat\r\n              The Raptors snapped a nine-game road losing streak.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996960.1026728
}