{
  "game_id": "401810191",
  "espn_id": "401810191",
  "date": "Dec 04, 2025",
  "matchup": "TOR vs LAL",
  "headline": "Hachimura hits 3 at buzzer on pass from James as Lakers beat Raptors 123-120",
  "body": "TORONTO -- — Rui Hachimura made a 3-pointer off a pass from LeBron James as time expired to give the Los Angeles Lakers a 123-120 victory over the Toronto Raptors on Thursday night.\n\n\r\n              The assist to Hachimura ensured that James’ NBA-record streak of 1,297 consecutive double-digit scoring games in the regular season ended. He finished with eight points, shooting just 4 for 17. He went 0 for 5 from 3-point range and did not attempt a free throw. His assist to Hachimura was his 11th.\n\n\r\n              Austin Reaves scored 44 points, 22 in the third quarter, as the Lakers overcame Luka Doncic's absence.\n\n\r\n              After Toronto’s Brandon Ingram came up empty on a layup with 23 seconds left in the fourth, James fed Hachimura in the corner for the winning basket. It was Hachimura’s only made shot of the final quarter.\n\n\r\n              Deandre Ayton scored 17 points, Jake LaRavia had 14, and Hachimura and Nate Smith Jr. each had 12 as the Lakers bounced back from Monday’s home loss to Phoenix to win for the eighth time in nine.\n\n\r\n              Reaves had 10 assists. He shot 13 for 15 at the free throw line and went 5 for 11 from long range.\n\n\r\n              Los Angeles is 9-2 on the road.\n\n\r\n              Scottie Barnes scored 23 points and Ingram had 20 for the Raptors. JaKobe Walter scored 17 points, and Sandro Mamukelashvili and Immauel Quickley each had 13.\n\n\r\n              Raptors rookie Collin Murray-Boyles scored 12 points and Jamison Battle had 10.\n\n\r\n              Doncic was out because of personal reasons. Marcus Smart (lower back) also sat for the Lakers.\n\n\r\n              Toronto’s Jakob Poeltl was out because of a sore lower back and Ochai Agbaji sat for personal reasons. RJ Barrett (right knee) missed his sixth straight game.\n\n\r\n              Up next\r\n              Lakers: At Boston on Friday.\n\n\r\n              Raptors: Host Charlotte on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042752.504732
}