{
  "game_id": "0021901248",
  "espn_id": "401224723",
  "date": "Aug 02, 2020",
  "matchup": "MIL @ HOU",
  "headline": "Westbrook scores 31 as Rockets get 120-116 win over Bucks",
  "body": "LAKE BUENA VISTA, Fla. --  Russell Westbrook scored 31 points and the Houston Rockets used strong defense down the stretch for a 120-116 victory over the Milwaukee Bucks on Sunday night.\n\nIt was the 36th straight game with at least 20 points for Westbrook, who led Houston's offense on a night James Harden scored 24.\n\nHarden called their defense on Sunday night \"very important\" to the victory.\n\n\"Throughout the course of the game we played some really good defense,\" he said. \"They're a good offensive team but we got stops when we needed to.\"\n\nHouston tied an NBA record for most 3-point attempts in a regulation game with 61, making 21 of them, and forced 22 turnovers.\n\n\"I think our execution, our certainty in what we wanted to do wasn't where it needs to be and that starts with me,\" Milwaukee coach Mike Budenholzer said. \"So, I think a lot of tonight's on me.\"\n\nGiannis Antetokounmpo had 36 points, 18 rebounds and eight assists for Milwaukee. He joined Kareem Abdul-Jabbar as the only players to have 15 games with at least 30 points, 15 rebounds and five assists in a season in the last 50 years.\n\nKhris Middleton scored 27 points and Brook Lopez added 23 as the Bucks missed a chance to clinch the best record in the Eastern Conference.\n\nMilwaukee led by one in the fourth quarter before Lopez scored the first four points of a 7-0 run that was capped by a 3 from Middleton to make it 112-104 with about 3 minutes remaining.\n\nBut Houston scored the next nine points, highlighted by a 3 and a steal from P.J. Tucker and a block by Harden on Antetokounmpo, to go on top 113-112 about a minute later.\n\n\"Usually when we're up six two minutes to go, we usually close the game out,\" Antetokounmpo said. \"But we didn't do that today, so we've got to learn from it and got to keep moving.\"\n\nLopez ended Houston's run with a basket in the paint to make it 114-113 with less than a minute to go.\n\nWestbrook made two free throws before a shot by Antetokounmpo left Milwaukee up 116-115 with 16.5 seconds remaining.\n\nWestbrook made two more free throws and Danuel House stole a pass from Antetokounmpo and was fouled. He added two free throws to leave Houston up 119-116 with 14 seconds left.\n\nMiddleton missed two 3-point attempts after that to allow Houston to hold on for the victory.\n\nHarden liked the tenacity his team showed in fighting back from the late deficit.\n\n\"Things weren't going our way, we weren't making shots, but we just stuck with it,\" he said.\n\nWestbrook agreed.\n\n\"Adversity showed up and we showed out,\" he said.\n\nThe Rockets were up by two after a basket by Westbrook with about 1  1/2 minutes left in the third quarter. Antetokounmpo and Kyle Korver hit late 3s to take a 90-89 lead into the fourth quarter.\n\nTIP-INS\n\nBucks: G Eric Bledsoe and Pat Connaughton both missed their second straight games as they continue to get back in shape after testing positive for COVID-19. ... Milwaukee out-rebounded Houston 65-36.\n\nRockets: G Eric Gordon missed his second game with a sprained left ankle. ... Tucker missed his first six 3-pointers before making his first two attempts of the second half. He finished with 11 points.\n\nFIRST TIME\n\nIt's the first time in NBA history a team lost despite scoring at least 110 points, holding an opponent to less than 40% shooting (39.6) and out-rebounding an opponent by at least 25. Before Sunday night all 177 teams who did that won.\n\nUP NEXT\n\nBucks: Play Brooklyn Tuesday.\n\nRockets: Play Portland Tuesday night.\n\n--\n\nMore AP NBA: https://apnews.com/NBA  and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996123.925874
}