{
  "game_id": "0022400060",
  "espn_id": "401703429",
  "date": "Dec 03, 2024",
  "matchup": "LAC vs. POR",
  "headline": "Powell scores 30 and Harden has 23 as the Clippers beat the Trail Blazers 127-105",
  "body": "LOS ANGELES -- — Norman Powell scored 30 points, James Harden had 23 and the Los Angeles Clippers beat the Portland Trail Blazers 127-105 on Tuesday night.\n\n\r\n              Amir Coffey scored 19 points, hitting five 3-pointers, and Derrick Jones Jr. added 15 for the Clippers. Los Angeles shot 55.3% from the field and was 19 of 37 (51.4%) from 3-point range en route to a season high in points.\n\n\r\n              DeAndre Ayton scored 16 points and Shaedon Sharpe and Deni Avdija each had 15 for Portland.\n\n\r\n              The Clippers and Trail Blazers each finished 2-2 in NBA Cup West Group A play. Neither team advanced to the knockout round.\n\n\r\n              Clippers guard Terance Mann left in the third quarter with a fractured left middle finger.\n\n\r\n              Takeaways\r\n              Trail Blazers: Defense continues to be a problem for the Trail Blazers. They’ve allowed at least 120 points in four of their last five games and have held an opponent under 100 just once in 22 games this season.\n\n\r\n              Clippers: Powell continues to be an offensive force amid the best season of his career. He scored 14 of the Clippers’ first 24 points, including three 3-pointers, to set the tone immediately. He is averaging a career-best 23.9 points, up from 13.9 points last season.\n\n\r\n              Key moment\r\n              The Trail Blazers overcame an early double-digit deficit to cut the Clippers' lead to 72-70 with 6:05 remaining in the third quarter, but the Clippers unleashed a 34-10 run to turn it into a rout. Powell, Harden and Mo Bamba hit 3-pointers to spur an 11-0 surge, and the Clippers rolled from there.\n\n\r\n              Key stat\r\n              Harden has 26,399 points, passing Paul Pierce for sole possession of 17th place on the NBA’s career scoring list.\n\n\r\n              Up next\r\n              The Trail Blazers host Utah on Friday and the Clippers host Minnesota on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998046.898648
}