{
  "game_id": "0021900724",
  "espn_id": "401161366",
  "date": "Jan 31, 2020",
  "matchup": "MIL vs. DEN",
  "headline": "Barton, Nuggets hand Bucks rare defeat at home, 127-115",
  "body": "MILWAUKEE --  Denver Nuggets coach Michael Malone couldn't have been any happier with a win than he was Friday night.\n\nWill Barton had 24 points and eight assists to lead the tired and short-handed Nuggets to a 127-115 victory that snapped Milwaukee's nine-game winning streak and handed the NBA-leading Bucks just their third home loss.\n\n\"It is our best win of the season,\" Malone said. \"I am so proud of our guys.\"\n\nMalik Beasley scored 16 points for Denver. Nikola Jokic had 15 points, 10 rebounds and nine assists, and Michael Porter Jr. added 15 points and 11 rebounds as every member of the Nuggets that played scored in double figures.\n\n\"I've never seen that,\" Malone said. \"Will Barton was tremendous, Nikola, Jerami Grant seven blocks, Malik Beasley five 3s, you can go on and on and on. This was a true team win and a true testament to the character of this group.\"\n\nGiannis Antetokounmpo had 31 points, 10 rebounds and nine assists for Milwaukee, finishing just shy of his fifth triple-double this season. Khris Middleton added 24 points for the Bucks, who hadn't lost at home since Dallas beat them 120-116 on Dec. 16.\n\nPorter said beating the NBA's best was huge.\n\n\"It is big,\" he said. \"The Bucks, they've got the best record in the NBA. I think they had won nine straight. They have a crazy good home record. So, to come in here and get this win on a back-to-back like this, big-time.\"\n\nPorter noted the balanced effort, too.\n\n\"Everybody scored double figures,\" he said. \"I've never seen that.\"\n\nDenver shot 7 of 13 on 3-pointers in the third while the Bucks were simply outhustled and lost their touch from behind the arc, going 2 for 8. After trailing by seven at halftime, the Nuggets took their first lead at 78-77 late in the quarter on a 3 by Beasley. Barton hit a jumper and Denver never lost the lead the rest of the way.\n\n\"The second half, they came out and were aggressive,\" Middleton said. \"They made tough shots.\"\n\nComing from behind has been a common theme for Denver lately.\n\nThe Nuggets rallied from an 11-point deficit Thursday night in a 106-100 win over the Utah Jazz. They arrived at their hotel at 4:30 a.m. and were without two key starters Friday in Paul Millsap (bruised left knee) and Jamal Murray (left ankle sprain). But their bench responded in the first half behind 11 points from Porter and 10 from Juancho Hernangomez.\n\n\"Even though we are down guys and all that, our guys have a tremendous belief,\" Malone said.\n\nDenver (34-15) leads the Northwest Division and has won eight of 11. The Nuggets improved to 15-9 on the road.\n\nAntetokounmpo and his brother, Thanasis, made some personal history when they started together for the first time in the NBA to put some splash on the Bucks' Greek Heritage Night. Thanasis Antetokounmpo stole an errant pass with a minute gone, raced the length of the court and threw down a two-handed dunk that brought the crowd to its feet.\n\nGiannis Antetokounmpo flirted with a triple-double by the second quarter with 12 points, nine rebounds and eight assists. Middleton added 16 points, going 4 for 4 from behind the arc. Eric Bledsoe chipped in with 10 points and the Bucks led 67-60 at the break.\n\nGiannis Antetokounmpo missed Tuesday's win with right shoulder soreness and hadn't played since putting up 30 points and 16 rebounds last Friday when Milwaukee beat the Charlotte Hornets 116-103 in Paris.\n\nTIP-INS\n\nNuggets: Millsap missed his 13th consecutive game and Murray his ninth. Backup center Mason Plumlee (right foot) and guard Gary Harris (personal) also were out.\n\nBucks: Milwaukee guards George Hill (left hamstring) and Donte DiVincenzo (left ankle) are both expected to miss a few games after getting hurt Tuesday against the Wizards.\n\nQUOTABLE\n\n\"I thought tonight we brought it,\" Porter said. \"We got in at 4:30 a.m last night. We started off a little sluggish, but we found the energy.\"\n\nSIGH OF RELIEF\n\nPorter got tangled up under the Bucks' basket and fell awkwardly at 10:27 of the fourth quarter. He was helped to the bench and did not return.\n\n\"I'm good,\" he said. \"I think I just rolled my ankle, but I am good.\"\n\nMalone thought the injury wasn't serious.\n\nUPDATE ON MURRAY\n\nThe Nuggets want Murray back as soon as possible, but not at the expense of his health.\n\n\"I think that it is smart for us and prudent for us to kind of be patient and not rush him back,\" Malone said. \"When he's out there, I want him playing with confidence and not worrying about that ankle injury.\"\n\nMurray is a key cog in Denver's offense, averaging 17.6 points and 4.1 assists in 40 games, all starts.\n\nIT'S ALL GREEK\n\nThe Bucks' starters were introduced in Greek as part of the night's Hellenic celebration.\n\nUP NEXT\n\nNuggets: Play at Detroit on Sunday.\n\nBucks: Host Phoenix on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996139.379166
}