{
  "game_id": "0021500415",
  "espn_id": "400828302",
  "date": "Dec 21, 2015",
  "matchup": "CHA @ HOU",
  "headline": "Harden scores 36 points, leads Rockets over Hornets 102-95",
  "body": "HOUSTON -- When James Harden draws a lot of fouls, it's usually bad news for whoever the Houston Rockets are playing.\nThat was the case on Monday night when 16 of his 36 points came off free throws in a 102-95 win over the Charlotte Hornets.\n\"Obviously spending time here, I know how great he is at drawing fouls,\" Jeremy Lin said. \"He played well tonight and he got a lot of calls. ... You've got your hands full and you have to try to make it as difficult as you can when you're defending a player of that caliber.\"\nThe Rockets squandered a double-digit lead in the fourth quarter before Harden helped them come back to get their third straight victory.\n\nThe game was tied before he drove into the lane and was fouled as he made a layup. He hit the free throw to put Houston up 94-91 with 31.6 seconds left.\n\"We put the ball in his hands. He's the closer,\" interim coach J.B. Bickerstaff said. \"So in those situations he's just got to make the right play.\"\nCody Zeller attempted a dunk contested by Terrence Jones and it bounced off the rim and back to the Rockets a few seconds after that. The Hornets fouled Patrick Beverley and he made two free throws to extend the lead to 96-91.\nLin made two free throws after that but missed a pair after Beverley made one for the Rockets.\nHarden attempted 19 free throws and secured the win by making two with 13.9 seconds remaining.\nKemba Walker led the Hornets with 14 points.\n\"We fought hard,\" Charlotte coach Steve Clifford said. \"I thought their defense was really good. We struggled to consistently get good shots.\"\nA 3-pointer by Beverley extended Houston's lead to 79-66 with about 9 minutes left before Charlotte scored the next 13 points to tie it up about 9 minutes later. Frank Kaminsky got things going in that span with a three-point play and Lin and Spencer Hawes both made 3-pointers to power the run.\nThe Rockets got back on track after that with a 3-pointer by Harden for their first points in almost 3 minutes and a two-handed dunk by Jones came next to put them up 84-79.\nThe Rockets were clinging to a one-point lead with about 3 1/2 minutes left when Harden juked Lin, causing him to topple to the ground before stepping back to make a jump shot to make it 86-83.\nMarvin Williams made a 3-pointer before Dwight Howard fouled out when he tried to stop Lin under the basket. Lin made one of the free throws to give Charlotte an 89-88 lead with less than 2 minutes left.\nThe Rockets led by one at halftime and opened the second half with eight straight points to make it 53-44.\nHoward received three fouls in less than 90 seconds soon after that and went to the bench with four fouls with about 7 1/2 minutes left in the quarter. Two of the fouls were on loose balls and one was an offensive foul.\nTIP-INS\nHornets: C Al Jefferson served the fourth game of a five-game suspension for violating the league's drug policy. ... Lin, a former Rocket, got a mixture of cheers and boos each time he entered the game. He finished with 13 points. ... Kaminsky and Williams added 12 points each.\nRockets: Houston was without G Ty Lawson, who served the second of a two-game suspension without pay for a drunken-driving case in Colorado. ... Howard had nine points and nine rebounds.\nPRAISE FOR JONES: Jones came off the bench to score 17 points with six rebounds and two blocks. Howard raved about his play.\n\"He made some tough baskets,\" Howard said. \"He got some good blocks downs the stretch. He had an amazing game. I was real proud to see him play the way he played tonight. He did just about everything.\"\nMISS UNIVERSE SPOOF: The Rockets made fun of the recent faux pas at the Miss Universe pageant with a skit involving their mascot Clutch and his mini-me named Baby Clutch. On Sunday night, host Steve Harvey incorrectly announced that Miss Colombia had won the pageant before the crown was taken from her and given to the actual winner, the contestant from the Philippines.\nThe Rockets reenacted the event by awarding Clutch a crown, only to have the public address announcer say there had been a mistake. The crown was snatched off Clutch's head, and he stomped around as Baby Clutch celebrated.\nUP NEXT\nHornets: Host Boston on Wednesday night.\nRockets: Visit Orlando on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994392.393127
}