{
  "game_id": "0022300762",
  "espn_id": "401585390",
  "date": "Feb 12, 2024",
  "matchup": "CLE vs. PHI",
  "headline": "Buddy Hield scores 24 as 76ers end Cavaliers' 9-game winning streak with 123-121 victory",
  "body": "CLEVELAND -- — Buddy Hield is still getting used to his new surroundings. He looked much more settled in on Monday night.\n\n\r\n              Hield scored 24 points in his third game for Philadelphia, Kelly Oubre Jr. also had 24 and the 76ers halted Cleveland's nine-game winning streak, hanging on for a 123-121 victory over the Cavaliers.\n\n\r\n              The Cavs nearly rallied from a 10-point deficit in the final 1:25. They had a chance to win at the buzzer, but Darius Garland missed a 3-pointer from the right corner.\n\n\r\n              “It felt good coming off,” Garland said. “It looked good.\"\n\n\r\n              All-Star Tyrese Maxey added 22 points as the Sixers won for just the third time in 11 games. Maxey split a pair of free throws with 6.9 seconds left, giving Cleveland a last possession to extend its longest winning streak since it had LeBron James in 2018.\n\n\r\n              Donovan Mitchell, who led the Cavs with 36 points, drove the lane and had a contested layup blocked by Oubre. Cleveland got the rebound under the basket and kicked the ball to Garland, who couldn’t convert.\n\n\r\n              Hield was acquired from Indiana before the trade deadline last week by the Sixers, who are trying to stay afloat while waiting for Joel Embiid to return from knee surgery. It’s going to be tough haul without the reigning MVP, but Hield will seek to prevent the Sixers from sliding too far in the standings.\n\n\r\n              “I’ve been in this position a long time,” said Hield, who also had eight assists before fouling out in the final minute. “In a close game like this, I know you have to play to your strengths and play together. The trades all happened fast, but we’ve all bought in and coach Nick (Nurse) is doing a great job just playing to our strengths. We’re playing fun. We’re playing unselfish.”\n\n\r\n              One of the NBA’s most dangerous outside shooters, Hield made two 3-pointers and scored nine straight points in the fourth quarter as Philadelphia opened a 113-106 lead.\n\n\r\n              “With Buddy down the stretch, it turned into him looking a guy right in the eye and nailing a 3,” Nurse said. \"He can shoot the ball — we know that.”\n\n\r\n              The Cavs, who had won 17 of 18, were still within seven when Oubre drained a 3-pointer with 1:25 left to put the Sixers up 120-110.\n\n\r\n              But Cleveland battled back with Garland hitting a 3-pointer and Mitchell converting a three-point play before hitting a 3 to make it 120-119 with 14 seconds to go. The Cavs put themselves in position to pull it out but dropped to 22-5 since Dec. 16.\n\n\r\n              “I don’t mean to say this in a harsh way, but we kind of deserve to lose this game just based off of how we started,” Mitchell said. “We came out as if they were going to lay it down and let us just continue to do what we do.”\n\n\r\n              Jarrett Allen added 21 points and 10 rebounds and Evan Mobley had 14 points and 10 boards for Cleveland.\n\n\r\n              The Cavs' winning streak was the club's longest since a 13-gamer in 2017-18, when James led them to their fourth straight NBA Finals appearance before leaving for second time as a free agent.\n\n\r\n              “This is nothing to overreact to and get upset at,” Mitchell said. “I think the biggest thing is just coming out with the right mentality. We hadn’t done that in months. It's OK to have a blip on the radar, but for us it’s continuing to sustain that and not getting bored with success.”\n\n\r\n              The short-handed Sixers were without forward Tobias Harris (sore left hip).\n\n\r\n              The Sixers were expected to sign guard Kyle Lowry on Tuesday once he clears waivers. The 37-year-old Philadelphia native had his contract bought out and was released over the weekend by Charlotte, which acquired him from Miami last month.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Miami on Wednesday.\n\n\r\n              Cavaliers: Host Chicago on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996729.506054
}