{
  "game_id": "0021600178",
  "espn_id": "400899628",
  "date": "Nov 18, 2016",
  "matchup": "OKC vs. BKN",
  "headline": "Westbrook's triple-double leads Thunder past Nets 124-105",
  "body": "OKLAHOMA CITY --  The Brooklyn Nets knew they couldn't afford to let Russell Westbrook run wild in the paint.\n\nIt didn't matter. Westbrook had 30 points, 13 assists and 11 rebounds in his fourth triple-double of the season, and the Oklahoma City Thunder rolled past the Nets 124-105 on Friday night.\n\nIt was the 41st triple-double of Westbrook's career. He attacked relentlessly, making 13 of 21 shots while taking just one 3-pointer, even with the Nets packing the paint on defense.\n\n\"Too many paint attempts, too many rim attempts,\" Brooklyn coach Kenny Atkinson said. \"A bunch of them came in transition, unfortunately, where you've really got to try to keep him out of there. That's easier said than done. He did a good job not settling.\"\n\nVictor Oladipo scored 26 points and Steven Adams added 15 for the Thunder, who won their second straight after a four-game losing streak. Oklahoma City shot 55.1 percent from the field and outrebounded the Nets 46-30.\n\nBrook Lopez scored 22 points, and Bojan Bogdanovic and Rondae Hollis-Jefferson each added 13 for the Nets, who lost their third in a row. Brooklyn scored 40 points in the first quarter but never managed more than 23 in a period the rest of the way.\n\n\"They hit some shots early,\" Westbrook said. \"Honestly, they played harder than us to start the game, and we turned the page. We did a good job of making them take tough shots and getting out on the break and finishing.\"\n\nThe Thunder led 64-61 at halftime behind Westbrook's 20 points, eight assists and six rebounds.\n\nOklahoma City began pulling away early in the third quarter. Westbrook found Oladipo for a reverse layup, then threw a long pass to Joffrey Lauvergne for a dunk that gave the Thunder a 76-66 lead.\n\nWestbrook got his triple-double midway through the period. Oladipo's floater in the closing seconds of the quarter made it 96-82, and the Thunder cruised in the fourth.\n\nOklahoma City got a season-high 13 points from Lauvergne and a season-high 10 from Alex Abrines.\n\nThe Thunder had a season-high six players in double figures.\n\n\"We did a really good job of finding the open man,\" said Enes Kanter, who scored 13 points. \"It was a really fun game because everybody was sharing the ball, and when somebody scored, everybody was just out there cheering for each other.\"\n\nTIP-INS\n\nNets: Former Thunder guard Randy Foye started and scored two points in 15:30. ... Lopez matched a career high for 3-pointers in a game by hitting four in the first quarter. ... Anthony Bennett scored a season-high 12 points.\n\nThunder: Shot 57.8 percent in the first half. ... Backup G Semaj Christon left in the third quarter after stepping on a Nets player's foot and banging his head against Kanter's knee because he couldn't control his fall. Christon was evaluated for concussion-like symptoms and did not return.\n\nHALL OF FAMER\n\nMichael Jordan inducted Westbrook into the Oklahoma Hall of Fame on Thursday. Westbrook is one of the most visible and successful Jordan Brand athletes. Jordan said he sees some of himself in Westbrook.\n\n\"This kid has the same passion,\" Jordan said.\n\nSTAT LINES\n\nOladipo has averaged 27.5 points the past two games and made 23 of 35 shots. He went 8 of 13 on 3-pointers in the wins over Houston and Brooklyn.\n\nQUOTABLE\n\nBrooklyn's Trevor Booker shoved Adams in the fourth quarter, and they were both issued technicals. Westbrook said Adams handled it well.\n\n\"He probably didn't feel it,\" Westbrook said. \"Probably knowing Steven, that stuff doesn't bother him. Obviously, he's a big dude and a very strong guy. A push don't do nothing for him. He went up there and knocked down a free throw.\"\n\nUP NEXT\n\nThe Nets host the Portland Trail Blazers on Sunday.\n\nThe Thunder host the Indiana Pacers on Sunday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995327.212013
}