{
  "game_id": "0021600960",
  "espn_id": "400900355",
  "date": "Mar 09, 2017",
  "matchup": "DET vs. CLE",
  "headline": "Pistons overcome James, Cavaliers in 106-101 win",
  "body": "AUBURN HILLS, Mich. -- If Reggie Jackson and Andre Drummond play like they did Thursday night, the Detroit Pistons shouldn't have much trouble making the playoffs.\nDrummond had 20 points and 16 rebounds, and the Pistons scored the first 13 points of the fourth quarter before holding on for a 106-101 victory over the injury-plagued Cleveland Cavaliers. Jackson led Detroit with 21 points, including 12 in the final period.\n\"My teammates were just telling me to go out there and be myself, be aggressive on offense and try to make the right play,\" Jackson said. \"It was a great team win, and most importantly, our defensive stops is what really got us the win.\"\nDetroit now leads Chicago by a half-game for the No. 7 spot in the Eastern Conference.\nLeBron James had 29 points, 13 rebounds and 10 assists -- and threw down over a half-dozen tremendous dunks -- but the Cavaliers have now lost three straight and five of their last seven. J.R. Smith played for Cleveland after a thumb injury had kept him out since December, but Kevin Love and Kyle Korver were out, and the Cavaliers lost Andrew Bogut earlier in the week with a broken leg .\nCleveland led 80-73 after finishing the third quarter with a 22-5 run, but the Pistons started strong in the fourth, and a tip-in by Jackson gave Detroit an 82-80 advantage.\nJackson also beat the shot clock with a floater with 55 seconds left, lifting the Pistons to a 103-98 lead.\nJames and Kyrie Irving had 19 points each in the first half, but Detroit led 55-52 after two quarters. James had five dunks in the half, including a two-hander in the first quarter in which he swung a bit on the rim and received a technical foul. That play gave Cleveland a 27-12 advantage.\nPistons coach Stan Van Gundy said Detroit's Marcus Morris asserted himself in the huddle at that point.\n\"He stopped and said, `I got this,\" Van Gundy said. \"He went after them pretty good, to the point that I had to be the one to be positive after he was done. I'm not usually good cop, so that was a little bit interesting.\"\nDetroit was up 68-58 in the third before Cleveland closed the quarter with a huge run. Channing Frye made four 3-pointers for the Cavs in that stretch, all from around the same spot on the right wing.\nIrving finished with 27 points.\nTIP-INS\nCavaliers: Smith, who had been out since Dec. 20, came on as a substitute in the first quarter. He finished with three points on 1-of-9 shooting. ... Love hasn't come back yet from knee surgery, and Korver has an injured left foot. Coach Tyronn Lue was back on the sideline after missing Monday's game against Miami with an illness.\nPistons: Detroit outscored Cleveland by 23 when James wasn't in the game.\nHIGHLIGHTS\nJames had two more dunks in the second half for a total of seven, but he wasn't effective at all from the perimeter, going 0 of 6 from 3-point range on the night.\n\"Just trying to be aggressive -- be aggressive and attack the rim. That's pressure on their defense. I was able to get into the lane,\" James said. \"My outside shot wasn't going for me tonight, so I'm able to switch off and go somewhere else.\"\nMEMORIES\nUnless the teams meet in the postseason, this was the last game for James at The Palace. The Pistons are moving downtown next season. James had one of his first transcendent postseason moments in this building back in 2007, when he scored 48 points -- including Cleveland's final 25 -- in a win over Detroit in the Eastern Conference finals.\nUP NEXT\nCavaliers: Visit the Orlando Magic on Saturday night. Cleveland beat the Magic 105-99 on Oct. 29.\nPistons: Host the New York Knicks on Saturday. Detroit has split two games against New York so far this season.\n---\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764996034.745933
}