{
  "game_id": "0021900039",
  "espn_id": "401160681",
  "date": "Oct 27, 2019",
  "matchup": "MIA @ MIN",
  "headline": "Wiggins leads Wolves past Heat 116-109 with late 3 barrage",
  "body": "MINNEAPOLIS --  Andrew Wiggins has been the face of unfulfilled potential for the Minnesota Timberwolves, beginning his sixth NBA season and starting the second year of his $147 million maximum contract.\n\nThe Timberwolves haven't come close to giving up on him, though, and Wiggins put on a late-game show in their home opener that provided another reminder of why they're counting on more progress.\n\nWiggins made four 3-pointers and scored 16 of his 25 points in the final six minutes, propelling the undefeated Timberwolves to a 116-109 victory over the Miami Heat on Sunday night.\n\n\"It's going to take time for all of it to come together with our emphasis and changing of systems, but he is going to have a good year,\" coach Ryan Saunders said. \"I'm in his corner, and I want to make sure he knows that.\"\n\nHow often does Wiggins hear that?\n\n\"Every day he's telling me I'm going to have a good year,\" he said. \"Just trust in the system.\"\n\nKarl-Anthony Towns added 23 points and 11 rebounds for the Wolves (3-0), who matched the second-best start in this long-languishing franchise's history. They were 6-0 in 2001-02 and 3-0 in 2013-14. The Wolves have trailed in all three games, and Wiggins produced clutch contributions in two of them.\n\n\"He's a star player, and he knows when he has to kick it up,\" Towns said. \"For some reason, he always hits those shots at the end when we need him the most.\"\n\nKendrick Nunn had 25 points on 5-for-9 shooting from 3-point range, Duncan Robinson pitched in with 21 points, and Justise Winslow scored 20 for the Heat, who played again without new star Jimmy Butler and took their first loss after playing in Milwaukee the day before.\n\n\"That's two straight games where the first half really hurt us and we expended a lot of emotional energy,\" coach Erik Spoelstra said. \"In the first half, we just didn't bring the necessary passion and communication.\"\n\nAfter erasing a 21-point deficit in the third quarter to beat NBA MVP Giannis Antetokounmpo and the Bucks in overtime Saturday, the Heat didn't flinch after trailing by 13 at the end of the first quarter and facing a double-digit margin for most of the second period. Goran Dragic swished a 3-pointer for a 57-53 lead, capping an 18-2 run just before the break.\n\nThe Heat had a lead as big as 84-74 on Robinson's 3-pointer late in the third quarter, but Towns answered from behind the arc in the final minute of that period to give the Wolves momentum. Adapting to a faster-paced, 3-point-friendly style under Saunders, they climbed back into striking range with stiffer defense before Wiggins delivered the decisive blows.\n\n\"I'm going to keep at it. Whenever they need me to make a play down the stretch, I'm going to give it my all to make a play,\" Wiggins said.\n\nAfter started the season 0 for 13 from long range, Wiggins had a well-timed first make with 5:52 left to tie the game at 96. He gave the Wolves the lead for good with 2:56 left, the first of three 3-pointers he hit in as many possessions. With 1:45 remaining, he simply dribbled back and forth on the left wing and, with Robinson trying to guard him, stepped back to swish the inevitable launch for a 110-101 edge that gave him 11 straight points. His teammates mobbed him on the court after the Heat called a timeout.\n\n\"If you're a scorer, you see the ball go in, you start to get some rhythm, now you can become a lot more dangerous,\" Spoelstra said. \"In the fourth quarter, basically you really have to treat everybody as a threat, regardless of where they are on the scouting report. You just can't give open looks.\"\n\nTIP-INS\n\nHeat: With Butler out, Derrick Jones Jr. (groin) injured and Dion Waiters and James Johnson still away from the team for disciplinary reasons, the bench was thinned to six backups, including a pair of two-way players. Veteran forward Udonis Haslem (wrist) was active for the first time this season but did not play. ... The Heat went 10 for 15 from the free throw line, perpetuating a problem from last season.\n\nTimberwolves: After joining Kevin Garnett (1999-2000) as the only players in franchise history to post consecutive 30-point, 10-rebound games to start a season, Towns went 2 for 11 from the field after the first quarter. ... The Wolves have won four straight home openers.\n\nNUNN BETTER\n\nNunn, one of four rookies on a Heat roster that's half-filled with under-25 players, has been quite the fill-in for Butler on the wing over his first three NBA games. Nunn came off the bench in the G League for the Santa Cruz Warriors last season, but he parlayed a strong Summer League performance for the Heat into a prominent spot in the rotation so far.\n\nNO JEERING JIMMY\n\nButler became a father earlier this week when his girlfriend had a baby, his paternity leave delaying the debut for Miami's prize offseason addition. The crowd in Minnesota was also deprived of the now-annual opportunity to direct boos at Butler, who forced his way out a year ago after helping the Wolves in 2017-18 end a 13-season absence from the playoffs. The fans had their first chance to jeer last spring when Butler played here with Philadelphia.\n\nUP NEXT\n\nHeat: Host Atlanta on Tuesday. Spoelstra said Butler will play against the Hawks, who are one of six unbeaten teams left in the NBA.\n\nTimberwolves: Play at Philadelphia on Wednesday. Robert Covington, the centerpiece of the package acquired for Butler, missed both games against the 76ers last season because of a bone bruise on his right knee.\n\n---\n\nMore AP NBA coverage: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996621.405199
}