{
  "game_id": "0022001079",
  "espn_id": "401307893",
  "date": "May 16, 2021",
  "matchup": "IND @ TOR",
  "headline": "Brissett has career-high 31 as Pacers beat Raptors 125-113",
  "body": "TAMPA, Fla. -- — Oshae Brissett scored a career-best 31 points and Domantas Sabonis added 25 points and 16 rebounds and the Indiana Pacers beat the Toronto Raptors 125-113 to lock up the Eastern Conference’s ninth seed.\n\n\r\n                    Indiana snapped a two-game losing streak and secured home-court advantage for Tuesday’s play-in game against the 10th-seeded Charlotte Hornets. \n\n\r\n                    The Pacers were 1-2 against Charlotte and lost 114-97 in Indiana on April 2. The Hornets were outscored 36-20 in Sunday’s fourth quarter and lost 115-110 to Washington, which secured the No. 8 seed.\n\n\r\n                    “They’re just really good, they play fast, they’ve got a lot of high-level scorers and the last time they came to (Indiana), I think from start to finish they really outplayed us,” said Indiana point guard T.J. McConnell, who tied a career high with 17 assists and added 12 points on Sunday. \n\n\r\n                    Up as much as 18 in Sunday’s third quarter, Indiana allowed Toronto’s makeshift lineup to get within 110-101 late in the fourth. Sabonis then sealed the game with a put-back layup, an assist to Brissett for a 3-pointer and a jumper.\n\n\r\n                    Sabonis returned from a one-game absence because of a left quad injury and earned his 48th double-double and his 14th game with at least 15 rebounds. He also had five assists and three steals for Indiana, which was still without Malcolm Brogdon, Myles Turner, Aaron Holiday, Jeremy Lamb and Edmond Sumner.\n\n\r\n                    “(Sabonis) going and saying he could play and fighting through that quad injury, that was big,” Indiana coach Nate Bjorkman said. “To go help his team get this (win) and fly back to Indiana for a home game was big.”\n\n\r\n                    Doug McDermott scored 20 points, while Caris LaVert added 13 points before leaving at halftime with a migraine. Kelan Martin scored 13 points for Indiana, which shot 50.5% for the game.\n\n\r\n                    Brissett, who signed two 10-day contracts in April prior to signing for the rest of the season, easily topped his previous career high of 23 points set on April 21 against Oklahoma City. Brissett, who played with the Raptors for 19 games last season, hurt Toronto by making 10 of 16 shots and 5 of 8 3s. He added 10 rebounds.\n\n\r\n                    “Oshae’s has been playing his role the right way and his size out there at that (forward) spot makes him very versatile,” Bjorkman said. \n\n\r\n                    Toronto point guard Malachi Flynn scored a career-best 27 points and hit five 3-pointers. Stanley Johnson scored 24 points and DeAndre Bembry had 23 for Toronto, which lost its final seven regular-season games and missed the playoffs for the first time since 2013. \n\n\r\n                    “When I look back, there were a lot of difficult things, but I’m actually very proud of how we navigated things,” said Toronto coach Nick Nurse, whose team played in Tampa because of COVID restrictions in Canada. “We were a million miles away roster-wise on some games, but we still found a way to play really well and together.”\n\n\r\n                    Up just one after a frantic first quarter, Indiana grabbed with a 37-25 edge in the second for a 13-point halftime lead. Brissett scored 16 first-half points and put the Pacers in position to secure the win.\n\n\r\n                    “It will be the same mentality as any other playoff game and we know the weight of this game,” Brissett said. “We know what it takes to win and we’re going to put our best foot forward. \n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Coach Nate Bjorkman said Turner has already been ruled out of Tuesday’s game. Turner, who hasn’t played since April 18 because of a toe injury, ranks first in the NBA in blocked shots at 3.4 a game. ... Brogdon, out since April 29 with a hamstring injury, worked out prior to the game and ran timed sprints under the supervision of a trainer. \n\n\r\n                    Raptors: Khem Birch added 18 points and 14 rebounds, while Aron Baynes added 14 points. ... Nurse said he doesn’t blame his team’s struggles on being forced to play in Tampa instead of Toronto. The Raptors were 16-20 at Tampa’s Amalie Arena. Said Nurse: “It was more COVID-related than location-related. It was the protocols, restrictions, testing, and I don’t think there were any restrictions on the floor being available.” \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997111.00389
}