{
  "game_id": "0022200651",
  "espn_id": "401468806",
  "date": "Jan 15, 2023",
  "matchup": "BKN vs. OKC",
  "headline": "Giddey, Gilgeous-Alexander lead Thunder over Nets 112-102",
  "body": "NEW YORK -- — Shai Gilgeous-Alexander and Josh Giddey each scored 28 points to lead the Oklahoma City Thunder to a 112-102 victory over the Brooklyn Nets on Sunday.\n\n\r\n              Lu Dort added 22 points for the Thunder, who earned a third straight win to wrap up a road trip to the East and improved to 21-23.\n\n\r\n              “It's positive times,” Giddey said. “For a young team, we're making improvements. Obviously it's such a long way to go but we're headed in the right direction. The morale around the group is really high right now. We're feeling good.” \n\n\r\n              The Nets aren't, after dropping their second straight since losing Kevin Durant to a sprained knee ligament. Seth Curry scored 23 points and Nic Claxton recorded his team-best 12th double-double of the season with 17 points and 12 rebounds. \n\n\r\n              Claxton also had four blocks, which stretched his streak of games with at least three to eight. The franchise record is 11 by Shawn Bradley, who did it twice in the 1995-96 season.\n\n\r\n              “The challenge for us as a group (is) to be able to sustain,” Nets coach Jacque Vaughn said. “That is harder mentally and physically because (Durant) does save you at times and give you a bucket, and now your defense is set. So the challenge with this group is they have to dig in and have a mental fortitude greater than before. Because every possession does matter.” \n\n\r\n              Kyrie Irving finished with 15 points and Royce O’Neale added 11, but Ben Simmons missed the game with back soreness.\n\n\r\n              The first of two regular-season matchups was a taut affair throughout as the biggest lead either team had was 10 points. Entering the fourth quarter, the Nets led 80-75.\n\n\r\n              It did not last especially long.\n\n\r\n              Oklahoma City used a 15-6 spurt over the first four minutes of the fourth to take a 90-86 lead. Giddy scored nine points to spearhead the Thunder’s push.\n\n\r\n              The teams then traded 3-pointers for a stretch, with Isiah Joe's second pushing the Thunder's advantage to 99-92. They extended it to 105-94 after Gilgeous-Alexander's basket with 3:05 left.\n\n\r\n              “We've got a really strong, connected group,” Giddey said. “That goes a long way as a young team because guys can get caught up in their own individual stuff. But (our) guys don't do that. It's all about the team.”\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Rookie Jalen Williams has made an impression on Oklahoma City coach Mark Daigneault. And to hear the coach of the Thunder, he and organizational decision-makers noticed the guard during the NBA draft combine. “(What stood) out to me was at the combine, a lot of players don’t play,” Daigneault said. “Even guys (who) feel like they’re solid second-round picks won’t play at the combine. And he played in the first day of the combine; played really well. …And he played the second day, and he played better the second day.” Williams, the 12th pick in the draft, is averaging 11.9 points, 3.8 rebounds, and 2.8 assists in 39 games this season.\n\n\r\n              Nets: Vaughn said the organization had not yet decided whether Durant would join the team for its upcoming five-game road trip. Durant suffered an isolated sprain of the right MCL in the third quarter of the Nets’ 102-101 win over the Heat in Miami on Jan. 8. The next day the team released a statement saying Durant would be “reevaluated in two weeks.” … Brooklyn recalled F Kessler Edwards and C Day’Ron Sharpe from Long Island of the G League prior to the game.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Hosts Indiana Wednesday.\n\n\r\n              Nets: Visits San Antonio on Tuesday.\n\n\r\n              ------\n\n\r\n              MORE AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994875.250744
}