{
  "game_id": "0022300639",
  "espn_id": "401585267",
  "date": "Jan 26, 2024",
  "matchup": "MIL vs. CLE",
  "headline": "Mitchell scores 32 as Cavs beat Bucks 112-100 for 9th win in last 10 games",
  "body": "MILWAUKEE -- — Cleveland Cavaliers coach JB Bickerstaff considered two road matchups with the Milwaukee Bucks in a span of three nights an opportunity to prepare his team for the postseason.\n\n\r\n              The Cavs responded by showing how they could bounce back and produce the kind of adjustments they'd need to make in a playoff series.\n\n\r\n              Donovan Mitchell scored 32 points, Jarrett Allen had 24 points and 14 rebounds and the Cavaliers beat the Bucks 112-100 on Friday night for their ninth win in their last 10 games. The Cavs gained a measure of revenge after their eight-game winning streak ended with a 126-116 loss at Milwaukee on Wednesday.\n\n\r\n              “You want to prepare for it as if it's a playoff game and use it as practice,” Bickerstaff said. “We still have young guys who haven't played a ton of playoff basketball. We want to give them that experience. How we studied, how we prepared, what we did yesterday, what happened at shootaround, we wanted to use it as kind of a dry run for us, so to speak, for what a playoff game would look like.”\n\n\r\n              Milwaukee's Giannis Antetokounmpo had 22 points, 11 rebounds and nine assists to end his string of two straight triple-doubles. \n\n\r\n              The game Wednesday took place one night after the Bucks had fired Adrian Griffin as coach.\n\n\r\n              Joe Prunty, an assistant on Griffin’s staff, worked as interim head coach for those two games. The Bucks announced in the final minute of Friday's game that they have hired Doc Rivers as Griffin's permanent replacement.\n\n\r\n              Damian Lillard scored 22 points for the Bucks, while Brook Lopez had 11 points and 12 rebounds.\n\n\r\n              After trailing 104-88 with four minutes left, the Bucks cut the lead to 106-100 on Lillard's free throws with 1:39 remaining. Caris LeVert sank a 3-pointer 23 seconds later, and the Cavs wouldn't look back.\n\n\r\n              “We felt like a step behind last game,” Allen said. “I don't think we were ready to play when we did the tipped ball. Tonight we came out with energy that we believed we could play with (and) the defense that we're supposed to play, too.”\n\n\r\n              Cleveland took the lead for good by going on a 14-0 run in the third quarter while holding the Bucks scoreless for nearly 6 ½ minutes.\n\n\r\n              Milwaukee led 57-54 at halftime and extended the advantage to 63-57 on Khris Middleton's follow shot with 10:51 left in the third, but the Bucks wouldn’t make another basket for nearly nine minutes. Milwaukee’s only points during that stretch came on two free throws by Lillard that gave the Bucks a 65-60 edge with 8 1/2 minutes remaining in the third.\n\n\r\n              After those free throws, Milwaukee wouldn’t score again until Pat Connaughton sank a 3-pointer with 2:02 left in the third. \n\n\r\n              “It wasn't them,” said Milwaukee's Bobby Portis, who had 12 points and eight rebounds. “It was us. I think we slowed ourselves down. We were attacking matchups. We weren't playing side to side. The ball wasn't moving side to side. We played a lot of 1-on-1 tonight.”\n\n\r\n              Connaughton’s shot was one of four straight 3-pointers the Bucks would make in a 90-second span as they cut a nine-point deficit to one.\n\n\r\n              The Cavs responded with 11 straight points to grab an 89-77 advantage, and they stayed ahead the rest of the way.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host the Los Angeles Clippers on Monday.\n\n\r\n              Bucks: Host the New Orleans Pelicans on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996126.1731
}