{
  "game_id": "0021600899",
  "espn_id": "400899405",
  "date": "Mar 01, 2017",
  "matchup": "MIL vs. DEN",
  "headline": "Jokic's 2nd straight triple-double leads Nuggets past Bucks",
  "body": "MILWAUKEE --  The way Nikola Jokic is playing, even his teammates are astonished.\n\nWith his second triple-double in two nights, Jokic led the Denver Nuggets to a 110-98 victory over the Milwaukee Bucks on Wednesday.\n\nThe 22-year-old center finished with 13 points, 14 rebounds and 10 assists for his fourth career triple-double -- all in his last 13 games.\n\n\"Amazing, amazing,\" Nuggets forward Danilo Gallinari said. \"That is all I can tell you. (Jokic) is playing great for us.\"\n\nGallinari scored 22 points for Denver, which built a 31-point lead despite playing without point guard Jameer Nelson (illness) for the first time this season.\n\nThe Nuggets, coming off a victory Tuesday at Chicago, have won back-to-back road games for the first time this season. They've also won consecutive games for the first time since taking three straight Jan. 24-28.\n\nMilwaukee's Khris Middleton finished with a season-high 21 points to go with five rebounds and five assists. The Bucks also got 15 points and nine rebounds from Giannis Antetokounmpo, but failed in their attempt to win back-to-back home games for the first time since Jan. 2.\n\n\"In our locker room right now, we don't understand the urgency -- we're young -- of what we're fighting for and that's a playoff spot,\" Milwaukee coach Jason Kidd said. \"This is growing pains. This is something we have to go through, the process of understanding we don't have that many games left. And our energy and effort has to be high.\"\n\nOnce Denver's 31-point cushion was significantly trimmed, the Nuggets could no longer rest their starters.\n\nAfter Matthew Dellavedova's basket cut Denver's lead to 90-77 with 8:41 left, Gallinari and Jokic walked to the scorer's table. And after Greg Monroe's offensive rebound and layup got Milwaukee to 94-82 with 6:57 remaining, Wilson Chandler and rookie Jamal Murray, starting in place of Nelson, got up off the bench.\n\n\"When we put our guys back in, obviously Nikola has that kind of impact where he is a calming influence,\" Denver coach Michael Malone said. \"You put the ball in his hands, keep on cutting, keep on moving and something good is going to happen.\"\n\nThat was as close as the Bucks got, but their rally did give Jokic a chance to get another triple-double. He needed three more points when he re-entered the game and surpassed it on his jumper with 4:22 left.\n\nJokic totaled 19 points, 16 rebounds and 10 assists against the Bulls.\n\nDenver led 84-53 after Murray stole the ball from Middleton, which led to a layup by Gary Harris with 3:50 left in the third.\n\nTIP-INS\n\nNuggets: Malone earned the 100th win of his three-year coaching career. . Nelson remained at the team hotel.\n\nBucks: Milwaukee honored Kareem Abdul-Jabbar at halftime for the Presidential Medal of Freedom he recently received from President Barack Obama. . The Bucks have lost 12 of their last 14 against Denver.\n\nLINEUP CHANGES\n\nMilwaukee second-year guard Rashad Vaughn made his first start of the season. He played five minutes and missed his only shot after playing 15 minutes Monday, one day after not even playing against Phoenix. Dellavedova came off the bench after starting the previous 16 games. He was 7 of 9 for 15 points after shooting a combined 3 for 22 for a total of just seven points in his last three games. ... Murray started for the third time this season and ended up with 10 points and five assists.\n\nBEASLEY SITS\n\nMilwaukee forward Michael Beasley did not play and will miss at least the next two games because of a left knee injury sustained Monday at Cleveland. He will then be re-evaluated.\n\nUP NEXT\n\nNuggets: Host the Charlotte Hornets on Saturday.\n\nBucks: Host the Los Angeles Clippers on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995156.5167732
}