{
  "game_id": "0022100415",
  "espn_id": "401401138",
  "date": "Jan 11, 2022",
  "matchup": "CHI vs. DET",
  "headline": "Vučević, DeRozan lift Bulls over Pistons 133-87",
  "body": "CHICAGO -- — Nikola Vučević scored 22 points, DeMar DeRozan had 20 points and 12 rebounds, and the Chicago Bulls routed the Detroit Pistons 133-87 on Tuesday night.\n\n\r\n              DeRozan sat for most of the final 16 minutes but still added seven assists. Eastern Conference-leading Chicago won after its season-best nine-game winning streak ended Sunday in Dallas.\n\n\r\n              “In the second half, we came out how we should’ve started the game,” DeRozan said. \n\n\r\n              Josh Jackson scored 16 points and Saddiq Bey added 14 for the Pistons, who had won two straight.\n\n\r\n              The Bulls led 61-52 at intermission and quickly turned it into a blowout by starting the second half on a 17-0 run that included four straight 3-pointers — two each from Derrick Jones Jr. and Vučević. \n\n\r\n              Vučević missed five of his first six shots but ended the night 10 for 18 from the floor. He was 7 for 9 in the third.\n\n\r\n              “He’s a guy that can course-correct. He just kind of figures things out,” coach Billy Donovan said. “In the third quarter you kind of saw his whole package.”\n\n\r\n              The Pistons helped dig the hole by missing their first seven shots and turning the ball over three times during the four-minute stretch.\n\n\r\n              Detroit managed just 14 points in the third quarter and trailed 97-66 when it ended.\n\n\r\n              Lonzo Ball added 18 points and Zach LaVine had 10 points and nine rebounds as Chicago picked up its ninth straight home win. The Bulls also got to rest their regulars in the final period to prepare for a two-game stretch that includes visits from Brooklyn — their nearest pursuer in the East — and Golden State. \n\n\r\n              The latter game has been tabbed for a national telecast after Chicago began the season with just a handful of such dates.\n\n\r\n              “You do your job right, you get a raise,” DeRozan said of the growing attention. “You have to put yourself in a position where you need to be seen. I feel like that’s where we’re at.”\n\n\r\n              The Bulls took the lead for good early in the second quarter with a 9-2 run that included a pair of baskets by DeRozan. He had 14 points in the first half.\n\n\r\n              DeRozan’s lone triple-double came during the 2018-19 season with San Antonio.\n\n\r\n              Detroit’s Cade Cunningham, the top pick in last year’s draft, scored a career-best 29 points a night earlier but struggled Tuesday. He spent the final six minutes of the opening half on the bench after picking up his third personal foul and ended the night with eight points on 3-of-11 shooting and six turnovers.\n\n\r\n              BRIEF BREAK\n\n\r\n              Detroit coach Dwane Casey was back on the bench Tuesday, a night after watching the team’s win over Utah on TV. Casey said a COVID-19 test Sunday morning came back positive, but two subsequent tests — one Sunday, another yesterday — were negative.\n\n\r\n              “I think it was a false positive,” said Casey, who added he’s received all the recommended vaccinations and takes special precautions due to his asthma. “I tell everyone, get vaccinated and get boosted.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Casey said he expects newly-acquired C Bol Bol to begin practicing Wednesday, two days after the team traded Rodney McGruder and a second-round pick in the coming draft to Denver. … The coach did not have timetables for Jerami Grant (right thumb) or Kelly Olynyk (left knee) to return.\n\n\r\n              Bulls: G Alex Caruso missed his ninth straight game and third since entering the NBA’s COVID-19 protocol. Donovan said Caruso is “progressing and moving in the right direction,” but would not say when the team expects him back on the court. Caruso missed the first six games recovering from a left foot sprain. ... Chicago has won 10 straight meetings with Detroit.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Welcome Toronto on Friday.\n\n\r\n              Bulls: Host Brooklyn on Tuesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992968.230934
}