{
  "game_id": "0021600166",
  "espn_id": "400899616",
  "date": "Nov 16, 2016",
  "matchup": "PHX @ DEN",
  "headline": "Wilson Chandler scores 28 points, Nuggets beat Suns 120-104",
  "body": "DENVER --  Kenneth Faried was animated about losing his spot in the Denver Nuggets' starting lineup earlier in the season.\n\nHe looks to have a hold on it now.\n\nFaried had a season-high 20 points and 15 rebounds, Wilson Chandler also had a season-high with 28 points and 11 rebounds, and the Nuggets won for the first time at home this season, 120-104 over the Phoenix Suns on Wednesday night.\n\n\"That's my spot,\" Faried said of his third straight start. \"I don't like people taking my spot. I didn't take kindly to that -- Coach knew that, my teammates knew that. I was outspoken about it, I was really upset.\n\n\"When I came out of my starting spot it kind of gave me a wake-up call that `Hey, you need to get back to who you are.\"\n\nThe Nuggets got back to their winning ways at home, too.\n\nDanilo Gallinari had 18 points for Denver, which snapped a four-game losing streak. Jameer Nelson added 17 points and Emmanuel Mudiay had 15.\n\nThe banged-up Nuggets played their second straight game without starting shooting guard Gary Harris. He's expected to be out until mid-December with a foot injury.\n\n\"We need every win we can get right now,\" Chandler said. \"Close games, blowouts, no matter how we can get them we need to win.\"\n\nBrandon Knight scored a season-high 32 points for Phoenix, and Devin Booker had 24 before he was ejected with 17.8 left after receiving his second technical foul. The Suns have lost five of six.\n\nTyson Chandler returned to the Suns' starting lineup after missing the last four games because of his mother's death. He had five points and five rebounds in 21 minutes.\n\n\"We are 3-9,\" Knight said. \"Our goal was to be a playoff team, so we have a lot (of major) issues.\"\n\nThe Suns never led, but cut a 20-point deficit to seven in the fourth quarter before Denver pulled away.\n\nMalone singled out Faried as a key reason the Nuggets held on and ended their recent slump.\n\n\"He has been amazing with his energy and game-changing type of plays,\" Malone said.\n\nThe Nuggets built an early double-digit lead with a pair of 8-0 runs. They led 12-4 thanks in part to a Mudiay's jumper and layup, then pushed it to 25-10 on the back of five straight points from Chandler and a 3-pointer from Nelson. Gallinari hit a 20-foot jumper to push it to 63-43 early in the third.\n\nKnight rallied Phoenix with 10 points in the fourth, and Jared Dudley's 3 cut the lead to 100-93 with 6:18 left.\n\nTIP-INS\n\nSuns: Booker cut it to 89-76 at the end of the third when grabbed an offensive rebound and hit an off-balance 17-foot jumper at the buzzer. .. Phoenix was outrebounded 49-35.\n\nNuggets: G Will Barton (ankle) missed his eighth straight game. ... The Nuggets waived little-used F/C Jarnell Stokes and signed F Alonzo Gee, who was waived by the New Orleans Pelicans earlier this season. The seven-year veteran had one assist in four minutes. \"In the past I've always admired him from afar,\" Malone said before the game. \"I like his approach.\"\n\nBOOKER EJECTED\n\nAfter he was fouled by Faried late in the game, Booker received his second technical. He lined up for a free throw anyways, before the official pointed him off the court.\n\n\"I didn't know I was ejected,\" he said. \"It was my first ejection, it's something new.\"\n\nNO TURNOVERS\n\nThe Nuggets have struggled to take care of the ball through their first 10 games, so Mudiay's zero turnovers on Wednesday was reason enough for praise.\n\n\"Thank the lord,\" he said. \"It's about time I had no turnovers.\"\n\nUP NEXT\n\nSuns: Continue a six-game trip at Indiana on Friday night.\n\nNuggets: Continue a four-game homestand against Toronto on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764996006.888258
}