{
  "game_id": "0021801151",
  "espn_id": "401071824",
  "date": "Mar 31, 2019",
  "matchup": "MEM @ LAC",
  "headline": "Clippers rout Grizzlies 113-96 to close March with 13-2 mark",
  "body": "LOS ANGELES --  The streaking Los Angeles Clippers are closing in on 50 wins with four games remaining in the regular season. It's a number few would have imagined last fall and again after trading leading scorer Tobias Harris in February.\n\nDanilo Gallinari wasn't one of them.\n\n\"I was very confident in this team from the beginning,\" he said.\n\nGallinari had 27 points and 15 rebounds in a 113-96 rout of the Memphis Grizzlies on Sunday night for the Clippers' league-leading 13th win in 15 games.\n\n\"It was a good night for the team, especially the second night of a back-to-back,\" Gallinari said. \"You always want to come out aggressive and keep the intensity up.\"\n\nThe Clippers (47-31) closed March with the NBA's best record at 13-2, tying the highest winning percentage in the month in team history set in 2014.\n\nMontrezl Harrell added 20 points, making 10 of 11 free throws, and Lou Williams had 17 points for the Clippers.\n\n\"It was one of them trap games,\" Harrell said. \"But we went out and took care of the things that we need to do as a team.\"\n\nAlready without Mike Conley, the injury-riddled Grizzlies lost Jonas Valanciunas with 6:16 left in the third quarter. The 7-footer injured his right ankle going for a rebound. He grimaced while being supported by two teammates as he hopped off the court.\n\nValanciunas' X-ray was negative and he will have an MRI on Monday, coach J.B. Bickerstaff said.\n\n\"It felt like I got kicked on the side of the leg and then I went down,\" said Valanciunas, who was on crutches afterward.\n\nValanciunas finished with nine points and seven rebounds, one night after a career-high 34 points and 20 rebounds in a comeback victory at Phoenix.\n\n\"It's really tough to see this happen at the end of the season. It's a setback for our players and our fans,\" Bickerstaff said. \"Injuries have made it frustrating but our guys still have no quit in them.\"\n\nDelon Wright led Memphis with 20 points and Chandler Parsons added 17.\n\n\"Fatigue definitely kicked in and we couldn't get stops and then J.V. went down,\" said Tyler Dorsey, who had 14 points. \"It's one of those nights in the NBA when you just can't get in rhythm.\"\n\nThe Grizzlies made up ground in the fourth against most of the Clippers' second unit. Memphis cut its deficit from 19 to 11 points but never got under double digits.\n\nThe Grizzlies scored the game's first basket for their only lead. The Clippers ran off the next 10 points.\n\nThen the rout was on.\n\nThe Clippers led by 20 points in the second on Ivica Zubac's highlight reel one-handed slam after catching a pass from Landry Shamet.\n\nLos Angeles stretched it to 26 points -- largest of the game -- in the third. Zubac scored six straight points and Harrell had the Clippers' final six points of the quarter, keeping them ahead 87-68.\n\nTIP-INS\n\nGrizzlies: Conley (left ankle soreness) didn't play after tweaking his ankle on Saturday night. He is one game from setting a personal record for most games played in a season. He's appeared in 70 so far. ... They fell to 1-6 this season without Conley in the lineup. ... Valanciunas' streak of double-doubles in a career-high six straight games ended. ... They fell to 11-27 on the road and 8-16 against the West away from home.\n\nClippers: Their 17-5 mark since the Feb. 7 trade deadline is the NBA's best. ... They improved to 36-6 when they grab more rebounds than an opponent.\n\nHE SAID IT\n\n\"You don't need to use your energy to look at the rankings. You need to use your energy to win games.\" -- Gallinari on the ever-changing playoff race in the West.\n\nREMEMBERING NIPSEY\n\nWord of rapper Nipsey Hussle's death in a shooting in South Los Angeles reached the team a few hours before tipoff.\n\nHussle had performed at halftime of a Clippers game last season and sometimes attended games. He was friends with Williams, who said, \"It's just rough. I haven't even been able to digest it all.\"\n\nWilliams and Harrell ordered up Hussle's name on replica Clippers jerseys that hung in their lockers.\n\n\"We really got to come together as people and stop promoting all this violence, man,\" Harrell said. \"There's a better way to go, it's a different way to go than just be able to take somebody's life. Now his fiancee, his kids, he's not going to be there for them. It's just tough.\"\n\nUP NEXT\n\nGrizzlies: At Portland on Wednesday.\n\nClippers: Host Houston on Wednesday, the first of three playoff-bound teams they'll face in their final four regular-season games.\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995334.178973
}