{
  "game_id": "0022400193",
  "espn_id": "401704759",
  "date": "Nov 08, 2024",
  "matchup": "MIN vs. POR",
  "headline": "Edwards hits 9 3-pointers as Timberwolves blow out Trail Blazers 127-102",
  "body": "MINNEAPOLIS -- — Anthony Edwards hit nine 3-pointers and scored 37 points to help the Minnesota Timberwolves beat the Portland Trail Blazers 127-102 on Friday night.\n\n\r\n              The nine 3s on 15 attempts were one short of a career high for Edwards, who scored 33 when Minnesota rallied past the Bulls in Chicago on Thursday. He added six rebounds and five assists as the Wolves dominated the Trail Blazers from the start.\n\n\r\n              Julius Randle scored 22 points and Rudy Gobert had eight points, 15 rebounds and three blocks for Minnesota, which won its third straight. \n\n\r\n              Scoot Henderson led the Blazers with 16 points. Anfernee Simons had 14 and Robert Williams III added 13 points.\n\n\r\n              Takeaways\r\n              Trail Blazers: Portland was playing its eighth game in seven different cities in 13 days, and it showed. Coming off a loss at San Antonio on Thursday night, the Blazers were flat from the start, falling behind by 27 in the second quarter. However, the Blazers are getting healthier, as Williams made his season debut and Shaedon Sharpe played his second game of the year. \n\n\r\n              Timberwolves: Third in the league in 3-point shooting, the Wolves were clicking from beyond the arc once again. They made a season-high 22 3s on 50 attempts.\n\n\r\n              Key moment\r\n              Portland started the third quarter with four quick points to cut Minnesota’s lead to nine. But over three straight possessions, Mike Conley hit a runner and Edwards buried a pair of 3s to push the lead back to 72-55.\n\n\r\n              Key stat\r\n              The Blazers were held scoreless for the first 5:12 of the game. They missed 11 field-goal attempts in that stretch and trailed 10-0 before Simons ended the drought with a long baseline jumper as the shot clock was about to expire.\n\n\r\n              Up next\r\n              The Blazers return home to face Memphis on Sunday, and the Timberwolves host the Heat on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998111.6939788
}