{
  "game_id": "0021800352",
  "espn_id": "401071033",
  "date": "Dec 04, 2018",
  "matchup": "POR @ DAL",
  "headline": "Doncic's 21 points lead Mavs past Trail Blazers 111-102",
  "body": "DALLAS --  The Dallas Mavericks hadn't won eight in a row at home since the year they won the NBA championship.\n\nOn Tuesday night, they matched that mark and continued their upward trajectory in the rugged Western Conference.\n\nLuka Doncic scored 21 points and Wesley Matthews added 17 as the Mavericks won for the ninth time in 11 games, beating the Portland Trail Blazers 111-102.\n\nDeAndre Jordan added 12 points and 17 rebounds for Dallas, which won its eighth in a row at American Airlines Center for the first time since March 2011 -- three months before they defeated Miami for the franchise's only NBA title.\n\n\"To be the team we want to be, we have to win the games at home,\" Matthews said. \"Our attention to defense is what's really doing it for us.\"\n\nThat defense made it difficult for Portland's vaunted backcourt. Damian Lillard had 33 points, but shot 10 for 23 from the field and 2 for 8 on 3s. His 11-for-12 shooting from the line helped his total.\n\nC.J. McCollum added 18 points for the Blazers, but made just 7 of 19 shots and 2 of 7 3s.\n\n\"Our guys did a great job executing the defensive game plan,\" Dallas coach Rick Carlisle said. \"Which was not an easy game plan because we were chasing guys who are great players 30 to 40 feet away from the basket.\"\n\nLillard scored 25 of his 33 points in the second half as Portland tried, but failed, to rally from a deficit that was mostly double digits through almost all the first three quarters.\n\n\"It's an uphill battle,\" Lillard said. \"I thought we still had a chance. When you create a hole, you got to fight out of it so hard to get there, you put yourself in a position where you got to be perfect down the stretch.\"\n\nThe Mavericks closed out the first quarter with a 17-3 run and held a double-digit lead until Lillard's drive and free throw made it 78-69 late in the third.\n\nDwight Powell hit consecutive 3-pointers and Maxi Kleber followed a Devin Harris miss with a dunk to put Dallas up by 14 after three quarters.\n\nJ.J. Barea's driving layup capped a 10-0 run that gave the Mavericks their biggest lead at 92-73. Portland got as close as six points in the game's final minutes, but Doncic hit a fall-away 3-pointer with 58.9 seconds to go for a 108-99 lead.\n\nHITTING THE SKIDS\n\nThe teams are going in opposite directions. While Dallas has heated up, Portland has lost eight of its last 11.\n\n\"This game was very similar to the last two we played,\" Blazers coach Terry Stotts said. \"Get off to a slow start, get down at halftime, make a good comeback and fall short. I think we're all getting tired of it.\"\n\nTIP INS\n\nTrail Blazers: Lillard scored the Blazers' final 15 points of the third quarter. . Portland's frustration became evident in the third quarter when Al-Farouq Aminu and Maurice Harkless were given technical fouls 35 seconds apart for arguing with referee Ed Malloy.\n\nMavericks: Guard Dennis Smith Jr. had 12 points and nine assists, one day after he had a root canal to fix a broken tooth suffered Sunday night after the Clippers' Patrick Beverley caught him with an elbow. ... Every Dallas starter scored in double figures and every Mavs player who saw action scored at least five.\n\nDONCIC HONORED\n\nDoncic was named Western Conference Rookie of the Month for October/November. Doncic started the team's first 20 games and averaged a team-high 18.5 points. He's second on the team in rebounds and assists.\n\n\"It means a lot,\" Doncic said. \"It's just another example for me to keep working hard and keep fighting for what I want. There's a lot to improve.\"\n\nThe last Dallas player to be selected Rookie of the Month -- and the only one since 2004 -- was Yogi Ferrell in February 2017.\n\nUP NEXT\n\nTrail Blazers: Host Phoenix on Thursday.\n\nMavericks: Second half of a back-to-back Wednesday at New Orleans.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995189.195075
}