{
  "game_id": "0022300231",
  "espn_id": "401584859",
  "date": "Nov 22, 2023",
  "matchup": "HOU vs. MEM",
  "headline": "Green scores 34 to help Rockets snap 3-game skid with 111-91 win over Grizzlies",
  "body": "HOUSTON -- — Jalen Green scored 26 of his season-high 34 points in the second half to lead the Houston Rockets to a 111-91 win over the Memphis Grizzlies on Wednesday night.\n\n\r\n              The victory snaps a three-game skid overall for Houston and a five-game losing streak in the series against Memphis.\n\n\r\n              Green said Fred VanVleet had a talk with him about how he was playing near the end of the first half that got him going. \n\n\r\n              “He was just telling me my energy was bad and that they need me out there,” Green said. “So I made a quick little change up because I did have some bad energy... just hearing that made me just step up into another gear.\"\n\n\r\n              Green is grateful to have some veterans like VanVleet on the team to help get the younger guys on track after not having that kind of leadership in the last couple of seasons. \n\n\r\n              “They obviously want to win the game just as bad as I do and want me to be as good as I can be,” Green said. “The last two years it would have just been that nobody would have said nothing and we would have just kept playing through that bad energy.”\n\n\r\n              The Rockets were up by six points to start the fourth, and used a 10-2 run, with the last seven points from Green, to make it 84-70 with about 10 minutes remaining.\n\n\r\n              VanVleet opened the quarter with a 3-pointer before Green added his seven points in just over a minute.\n\n\r\n              Desmond Bane made two free throws for Memphis before the Rockets got a three-point play from Alperen Sengun and a 3 from VanVleet to make it 90-72 with nine minutes to go.\n\n\r\n              Bane and Jaren Jackson Jr. scored 23 points each for the Grizzlies, who lost for the third time in four games. \n\n\r\n              “We have to be better,” Bane said. “We have to find ways to settle down offensively and get a basket when we need one and buckle down and get a stop on the defensive end when we need one. That's what good teams do and obviously we're working to get there.”\n\n\r\n              Dillon Brooks, who spent his first six seasons with the Grizzlies, had 13 points in the first game against his former team after signing with the Rockets in the offseason.\n\n\r\n              Jabari Smith Jr. added 18 points with nine rebounds as the Rockets improved to 7-1 at home this season. \n\n\r\n              A layup by Jackson got the Grizzlies within two with less than a minute left in the third quarter before Green made a 3-pointer and added a one-handed dunk on Houston’s next possession to push the lead to 74-67.\n\n\r\n              Green dunked over the 6-foot-10 Jackson, causing the Houston bench to go wild and Sengun received a technical during the celebration. Ziaire Williams made the technical shot as Houston led 74-68 entering the fourth.\n\n\r\n              The Grizzlies led by as many as 11 points in the first half, but the Rockets got within 46-45 by halftime.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Phoenix on Friday.\n\n\r\n              Rockets: Host Denver on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995634.774177
}