{
  "game_id": "0022400956",
  "espn_id": "401705522",
  "date": "Mar 13, 2025",
  "matchup": "CHI vs. BKN",
  "headline": "Coby White scores 31 points as Bulls rally to beat Nets 116-110",
  "body": "CHICAGO -- — Coby White scored 31 points, and the Chicago Bulls beat the Brooklyn Nets 116-110 on Thursday night.\n\n\r\n              White extended his streak of 20-point games to a career-best seven, helping the Bulls rally to win their season-high fourth in a row.\n\n\r\n              Kevin Huerter added 18 points and nine rebounds, and Tre Jones scored 18 points. Julian Phillips set career highs with 16 points, seven rebounds and five assists. Chicago is 10th in the Eastern Conference at 28-38 and holds the final play-in spot.\n\n\r\n              Cam Thomas led Brooklyn with 24 points and a career-high 10 assists, and Nic Claxton added 18 points and a season-best 14 rebounds. Tyrese Martin scored 19 points and Cam Johnson had 16, but the Nets lost for the 10th time in 12 games.\n\n\r\n              Takeaways\r\n              Nets: The Nets once again couldn't protect a lead, letting a 12-point advantage slip away after Cleveland rallied from 18 down in the third to beat them on Tuesday night.\n\n\r\n              Bulls: Josh Giddey sat out this one after spraining his right ankle against Indiana on Monday. The Bulls hope to get him back during a season-high, six-game trip.\n\n\r\n              Key moment\r\n              The Nets led 92-80 in the closing minute of the third quarter, only to have the Bulls answer with a 17-3 run. Brooklyn then led 101-99 with 4 1/2 minutes remaining when Chicago reeled off eight straight points, with Jones’ reverse layup putting the Bulls up by six with just under three minutes remaining.\n\n\r\n              Key stat\r\n              White is averaging 28.6 points in his past seven games.\n\n\r\n              Up next\r\n              Nets: Host Boston on Saturday.\n\n\r\n              Bulls: Open a season-high, six-game trip at Houston on Saturday. ------\n\n\r\n              AP NBA: https://apnews.com",
  "source": "espn_api",
  "crawled_at": 1764997038.6091242
}