{
  "game_id": "0022300387",
  "espn_id": "401585015",
  "date": "Dec 22, 2023",
  "matchup": "PHX @ SAC",
  "headline": "Domantas Sabonis has triple-double, Kings beat struggling Suns 120-105",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had 28 points, 12 assists and 11 rebounds for his fourth triple-double of the season and the Sacramento Kings beat the short-handed Phoenix Suns 120-105 on Friday night.\n\n\r\n              “We see the work that he puts in,” Kings forward Harrison Barnes said about Sabonis. “It's a testament to his commitment.”\n\n\r\n              Sacramento has won six of eight to improve to 17-10. Kevin Durant scored 28 points for Phoenix. The Suns have lost four of five to fall to 14-14. \n\n\r\n              The Kings made their first 11 shots in the third quarter, with De’Aaron Fox capping the streak by breaking the Sacramento-era assists record assists (2,581) on Harrison Barnes' shot. Fox finished with 23 points and seven assists.\n\n\r\n              “I’ve only known him for a couple of years but to see him break a lot of records while I’m here is pretty cool,” Kings forward Keegan Murray said about Fox’s assist record.\n\n\r\n              Devin Booker had 24 points and seven assists for the Suns. Durant, Booker and coach Frank Vogel were all issued technical fouls in the first half. \n\n\r\n              Suns guard Bradley Beal (ankle), forward Josh Okogie (hip strain) and center Jusuf Nurkic (personal reasons) were all missing from the lineup. Beal has appeared in only six games this season because of injury after being dealt from the Washington Wizards in the offseason.\n\n\r\n              “Another tough third quarter,” Vogel said. “We have to be better and improve our offensive execution. ... We are not playing well enough right now.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Dallas on Monday night.\n\n\r\n              Kings: Host Minnesota on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996665.391295
}