{
  "game_id": "0021800920",
  "espn_id": "401071593",
  "date": "Feb 27, 2019",
  "matchup": "SAC vs. MIL",
  "headline": "Bledsoe has triple-double as Bucks edge Kings 141-140 in OT",
  "body": "SACRAMENTO, Calif. --  With Giannis Antetokounmpo watching from the bench because of a minutes restriction and Khris Middleton joining him after cramping up, Milwaukee coach Mike Budenholzer leaned on two other starters in overtime.\n\nEric Bledsoe and Malcolm Brogdon were up to the task.\n\nBledsoe scored five of his 26 points in overtime, Brogdon added 25 points and a 3-pointer late in the extra period while Milwaukee's two All-Stars rested, and the Bucks beat the Sacramento Kings 141-140 on Wednesday night.\n\n\"It builds a lot of confidence,\" Budenholzer said. \"All year we've been talking about different guys can step up and make plays. For Malcolm to make a shot, for Bled to make all the big plays he did, it speaks well for us going forward.\"\n\nBledsoe added 13 assists and 12 rebounds to help the Bucks to their sixth straight win. Middleton and Nikola Mirotic scored 21 points apiece.\n\nMilwaukee improved to an NBA-best 47-14. It's the Bucks' best record since finishing the 2000-01 season 52-30.\n\nWinning while Antetokounmpo and Middleton sat down the stretch made it sweeter for Milwaukee.\n\n\"We've got the best record in the league for a reason,\" Bledsoe said. \"Even though those are our two best players we still have a full, complete team out there playing.\"\n\nAntetokounmpo scored 17 points in 25 minutes and made a pair of key baskets for Milwaukee late in the fourth quarter, but spent nearly all of overtime on the bench with a grey towel wrapped around his shoulders in his first game back from a sore right knee. He came back with 11.8 seconds remaining and made three inbounds passes but did not take a shot.\n\n\"He feels good,\" Budenholzer said. \"It's not just about the pain or what he's feeling today. It's how are we going to have him healthy, have him fresh, have him feeling good going forward. Sometimes you just have to maybe put a little money in the bank.\"\n\nBuddy Hield had 32 points and six rebounds for Sacramento. Bogdan Bogdanovic added 28 points, eight rebounds and eight assists, while Harrison Barnes had 15 points and 14 rebounds.\n\nSacramento rookie Marvin Bagley III departed with a left knee strain. The second overall pick in the draft, Bagley appeared to bang knees with Brogdon while trying to go around a screen. Bagley lay on the court for several moments before being helped to his feet and taken to the locker room.\n\n\"That's definitely a cloud over our locker room,\" Kings coach Dave Joerger said. \"Was it a foul or not? I'm not going to get into whether (Brogdon) hit him or not. I wouldn't think it was a bad or dirty play at all.\"\n\nMilwaukee led by 17 midway through the third but was outscored 12-4 over the final 3  1/2 minutes of the fourth quarter.\n\nThe Kings had the ball with 11.4 seconds left in regulation but failed to get off a shot. De'Aaron Fox took the inbounds but had the ball knocked away by Bledsoe as time ran out.\n\nTIP-INS\n\nBucks: Milwaukee has won nine straight road games. ... Bledsoe scored eight points in the fourth quarter after putting up 13 through the first three. ... Milwaukee made six 3s in the first quarter, three from Brogdon.\n\nKings: Bagley will undergo an MRI on Thursday. He finished with nine points and seven rebounds. ... Fox made one of the game's biggest defensive plays when he blocked Bledsoe's layup late in the fourth quarter and sent the Bucks guard crashing to the floor.\n\nQUOTABLE\n\n\"Even if they don't make it this year, even if they do, they've got a bright future.\" -- Bledsoe, on the Kings.\n\nBUCKS, KINGS UNITE FOR SUMMIT\n\nThe Kings and Bucks collaborated on a daylong summit at Golden1 Center to address social injustice and encourage engagement and thoughtful discussions to try to bring about change. The event came nearly a year after the March 18, 2018, fatal shooting of 22-year-old Stephon Clark. Clark's death ignited a series of protests that included protesters joining hands and blocking entrances to the Kings' downtown arena. Bucks guard Sterling Brown, who last year as a rookie was Tased by police and later filed a lawsuit, also took part in the summit.\n\nUP NEXT\n\nBucks: Play the Lakers in Los Angeles on Friday.\n\nKings: Host the Clippers on Friday.\n\n---\n\nMore AP NBA:https://apnews.com/tag/NBAandhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994174.6113431
}