{
  "game_id": "0021800334",
  "espn_id": "401071015",
  "date": "Dec 01, 2018",
  "matchup": "CHI @ HOU",
  "headline": "Harden scores 30 as Rockets beat Bulls 121-105",
  "body": "HOUSTON --  The Houston Rockets aren't where they want to be, but are feeling much better after following a season-high four game skid with consecutive wins, capped by Saturday night's victory over the Chicago Bulls.\n\nJames Harden made six 3-pointers and scored 30 points to help the Rockets down the Bulls 121-105.\n\nThe victory comes a night after the Rockets ended their losing streak with a win 136-105 win at San Antonio.\n\nNow coach Mike D'Antoni is looking for his team to maintain this momentum on its upcoming three-game road trip.\n\n\"We need to go show everybody who we need to be,\" D'Antoni said. \"We may not be there yet but we're getting there ... we just need to go get some wins.\"\n\nHarden said health is the biggest reason why Houston has played better recently.\n\n\"It's just having a full roster,\" he said. \"Chris (Paul), Gerald (Green) and Nene coming back in these last few games. Having a full roster and guys that can help each other out is key.\"\n\nHouston was up by 12 entering the fourth quarter and used a 13-7 run to start the period and make it 100-82 with 8 1/2 minutes left. Eric Gordon made two 3-pointers in that stretch and P.J. Tucker added a three-point play. Chicago couldn't cut into the lead after that and the Rockets were up by 20 with about three minutes left when D'Antoni cleared the bench.\n\nZach LaVine had 29 points for the Bulls, who lost their sixth straight game and for the 10th time in 11 games.\n\nChicago's Lauri Markkanen had 10 points and four rebounds in his season debut after missing the team's first 23 games with a sprained right elbow he sustained in training camp. He entered the game with about 4 1/2 minutes left in the first quarter and played 26 minutes.\n\n\"I felt good and I had no problems with my elbow,\" he said. \"That's a positive. I was just glad to be out there.\"\n\nClint Capela added 18 points and 15 rebounds for Houston and Paul had 12 points and tied a season high with 13 assists in his second game back after missing three with a sore hamstring.\n\nHouston led by 10 at halftime before the Bulls used a 12-6 run to open the third quarter and cut the lead to four. Parker led Chicago in that stretch, scoring eight points.\n\nThe Rockets got back on track after that, scoring the next five points to push the lead to 67-58 with about seven minutes left in the third.\n\n\"Coming out of the break, I thought we had great momentum in the second half, and they throw in a couple of bombs,\" Chicago coach Fred Hoiberg said. \"We have to keep fighting and work on being more consistent.\"\n\nHouston led by eight later in the third when Harden made a 3-pointer just before the shot clock expired to make it 74-63 with 4 1/2 minutes left in the quarter.\n\nThe Bulls added a layup seconds after that, but Houston scored the next six points, capped by a 3 from Harden with Jabari Parker in his face to make it 80-65 about 90 seconds later.\n\nLaVine scored all of Chicago's points in a 7-2 run later in the third to cut the deficit, but Green made a 3-pointer with a few seconds left in the quarter to put Houston up 87-75 entering the fourth.\n\nTIP-INS\n\nBulls: Hoiberg said that he will limit Markkanen's minutes in his first games back. ... LaVine has scored at least 20 points in 20 games this season. ... Justin Holiday, who had 11 points, has made at least one 3-pointer in a franchise-record 35 straight games. ... Parker finished with 21 points and 12 rebounds.\n\nRockets: Nene had 10 points and four rebounds in his season debut after missing Houston's first 21 games with a strained right calf. ... Harden has scored 30 points or more in six of the last eight games.\n\nREMEMBERING BUSH\n\nThe Rockets played a video before the game and had a moment of silence for former President George H.W. Bush, who died on Friday night in Houston at 94. The video featured images of Bush sitting courtside at several games and posing for pictures with various former players and coaches.\n\nUP NEXT\n\nBulls: Visit Indiana on Tuesday night.\n\nRockets: Visit Minnesota on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994837.367688
}