{
  "game_id": "0022301047",
  "espn_id": "401585675",
  "date": "Mar 26, 2024",
  "matchup": "SAC vs. DAL",
  "headline": "Luka Doncic scores 28, Mavericks rout Kings 132-96",
  "body": "SACRAMENTO, Calif. -- — Luka Doncic scored 26 of his 28 points in the first half and the Dallas Mavericks beat the Sacramento Kings 132-96 on Tuesday night for their fifth straight win.\n\n\r\n              Doncic added 11 rebounds, six assists and three steals as the Mavericks moved into sixth place in the Western Conference, a game ahead of the Kings, with both teams trying to avoid the play-in tournament.\n\n\r\n              “I thought just the plays for one another, on both ends, offensively and defensively, was at a high,” Dallas coach Jason Kidd said. ... “We’re just trying to take what’s in front of us and play the game that’s in front of us, take the one possession that’s in front of us to get better.”\n\n\r\n              Kyrie Irving had 24 points and eight assists, and Tim Hardaway Jr. added 22 points and six assists off the bench.\n\n\r\n              P.J. Washington had 14 points and a season-high 13 rebounds.\n\n\r\n              “We hit shots tonight,” Washington said. “We rebounded well. We played great defense for 48 minutes. So I’m happy.”\n\n\r\n              De’Aaron Fox led the Kings with 18 points but was held to 6-of-18 shooting. Keegan Murray added 17.\n\n\r\n              Domantas Sabonis had 12 points, 11 rebounds and nine assists for his 55th straight double-double, tying Jerry Lucas for the longest streak in franchise history.\n\n\r\n              “(Fox and Sabonis) are All-Stars,” Kidd said. “We just tried to make it tough on them. It’s a group effort, everybody. It’s not just one person. I thought the guys executed the game plan.”\n\n\r\n              Doncic scored 19 points in the second quarter to help Dallas build a 58-53 lead at the half.\n\n\r\n              The Mavericks used a 22-4 run to push the advantage to 89-65 with 4:31 left in the third quarter. Dallas led by 39 in the fourth, outscoring Sacramento 74-43 in the second half.\n\n\r\n              “I think in the second half we played horrible,” Fox said. “I think it was probably one of our worst halves of the season.”\n\n\r\n              The Mavericks shot 55.4% and made 22 of 39 3-pointers for a season-best 56.4% beyond the arc.\n\n\r\n              Sacramento was limited to 38.9% shooting and fell to 0-9 when failing to reach 100 points.\n\n\r\n              “Offensively, watching us play tonight, I’m a little surprised how we played,” Kings coach Mike Brown said. ... “Our offense tonight led to some easy baskets for them.”\n\n\r\n              UP NEXT\n\n\r\n              Sacramento will host Dallas again on Friday night.\n\n\r\n              —-\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996784.1362429
}