{
  "game_id": "0022300400",
  "espn_id": "401585028",
  "date": "Dec 23, 2023",
  "matchup": "MIN @ SAC",
  "headline": "Anthony Edwards scores 34 points as the Timberwolves beat the Kings 110-98",
  "body": "SACRAMENTO, Calif. -- — Anthony Edwards had 34 points and 10 assists, Rudy Gobert added 21 points and 17 rebounds, and the Minnesota Timberwolves defeated the Sacramento Kings 110-98 on Saturday night. \n\n\r\n              Jaden McDaniels had 20 points and Kyle Anderson scored 10 for the Timberwolves in place of star center Karl-Anthony Towns, who sat out with left knee soreness. Minnesota improved to 22-6, tied with Boston for the best record in the NBA.\n\n\r\n              “I think it’s starting to hit for a lot of us. We always kind of felt that we could compete with anybody. Now we've won a whole bunch of different ways,\" Minnesota point guard Mike Conley said.\n\n\r\n              \"We’ve learned to win and come back late in games. When you take a step back and look at it, that’s a recipe for success on how to win later in the season. We’re going to continue to grow and guys are going to continue to learn from what we’ve done so far.” \n\n\r\n              De’Aaron Fox had 27 points and six assists for Sacramento. Domantas Sabonis finished with a triple-double of 17 points, 10 rebounds and 10 assists.\n\n\r\n              The Kings shot 8 of 33 from beyond the arc, the fewest 3-pointers they've made in a game this season. Minnesota outrebounded Sacramento 43-40 and forced 11 turnovers. \n\n\r\n              “They’re long and athletic,” Fox said. “They get you off the line, and having Rudy back there makes you think twice about getting to the rim.”\n\n\r\n              After the Kings cut their deficit to 11 going into the fourth quarter, Minnesota went on a 12-2 run to open the period. \n\n\r\n              Sacramento trimmed it to 100-95 on a layup by Trey Lyles with two minutes left. But on the next Kings possession, Lyles threw away a pass that was stolen by Edwards and he threw down a dunk that made it 104-95.\n\n\r\n              “We knew they were going to make shots and the crowd was going to get into it, but as long as we got into our stuff we were going to be alright,\" Edwards said.\n\n\r\n              Sacramento tied it at 30 with under nine minutes left in the second quarter, but the Timberwolves closed the half with a 29-17 surge to go into the break with a 59-47 advantage.\n\n\r\n              The Timberwolves led by as many as 13 in the first quarter after Edwards hit a running layup to make it 28-15 at the 1:25 mark.\n\n\r\n              “We knew they were on a back-to-back,” Edwards said. “We definitely wanted to up the tempo.” \n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Play at Oklahoma City on Tuesday.\n\n\r\n              Kings: Play at Portland on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996484.093368
}