{
  "game_id": "0022400310",
  "espn_id": "401704876",
  "date": "Dec 01, 2024",
  "matchup": "HOU vs. OKC",
  "headline": "VanVleet has season-high 38 to lead Rockets to 119-116 win over Thunder",
  "body": "HOUSTON -- — Fred VanVleet had a season-high 38 points and Dillon Brooks made a go-ahead jump shot late to help the Houston Rockets to a 119-116 win over the Oklahoma City Thunder Sunday night.\n\n\r\n              The game was tied at 113 when Brooks hit the short jumper in the lane just before the shot clock expired to put the Rockets on top with 33.1 seconds to go.\n\n\r\n              Shai Gilgeous-Alexander missed a shot on the other end and Brooks grabbed the rebound. VanVleet was fouled and made both free throws to make it 117-113 with 4.6 seconds remaining.\n\n\r\n              Jalen Williams got the Thunder within 1 on a 3-pointer with 2.4 seconds left, but VanVleet made two more free throws to secure the win.\n\n\r\n              It’s the third straight win for the Rockets and their fifth in the last six games, and it came after Oklahoma City got a 126-107 victory in the first meeting on Nov. 8.\n\n\r\n              Gilgeous-Alexander had 32 points in his fourth straight 30-point game for the Thunder, whose four-game winning streak was snapped.\n\n\r\n              Takeaways\r\n              Thunder: Isaiah Hartenstein is off to a strong start in his return after missing the first 15 games of the season with a fractured hand. He had 19 points and 13 rebounds on Sunday and has had at least 10 points and 10 rebounds in each of his five games this season.\n\n\r\n              Rockets: Four of Houston’s starters finished in double figures with Alperen Sengun scoring 20, Brooks with 16 and Jabari Smith Jr. with 15. \n\n\r\n              Key moment\r\n              The shot by Brooks put the Rockets on top 115-113. It came after a jump ball that he won against Gilgeous-Alexander.\n\n\r\n              Key stat\r\n              These teams combined to shoot 64 free throws with Houston going 30 of 39 and Oklahoma City making 19 of 25.\n\n\r\n              Up next\r\n              The Rockets begin a three-game trip at Sacramento Tuesday night, and the Thunder host the Jazz that night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997400.914984
}