{
  "game_id": "0022000294",
  "espn_id": "401267454",
  "date": "Jan 29, 2021",
  "matchup": "PHI @ MIN",
  "headline": "Embiid has 37 points as 76ers ease past Wolves, 118-94",
  "body": "MINNEAPOLIS -- — Joel Embiid racked up 37 points and 11 rebounds in 27 minutes, leading the Philadelphia 76ers to a 118-94 victory over the depleted Minnesota Timberwolves on Friday night.\n\n\r\n                    Tobias Harris added 17 points and 11 rebounds for the 76ers (14-6), as the Eastern Conference leaders cruised away after a five-point halftime lead on the worst team in the Western Conference.\n\n\r\n                    Embiid went 16 for 18 from the free throw line, as a Timberwolves team missing centers Karl-Anthony Towns and Naz Reid was no match. Coming off a win on Wednesday over the defending champion Los Angeles Lakers, when Harris hit the go-ahead jumper with 3 seconds left, the Sixers avoided the type of letdown that has dogged them in the past.\n\n\r\n                    “I thought Joel posted deeper in the second half. We were waiting for them to trap, and they didn’t, so we just kept going to him,” Philadelphia coach Doc Rivers said.\n\n\r\n                    Embiid was a game-time decision due to back tightness, but the smooth-moving 7-footer sure didn't show much sluggishness as the 76ers beat the Wolves (4-14) for the seventh straight time. \n\n\r\n                    “You’ve got to keep pushing, I want us to build momentum,\" Embiid said. \"We've got to keep winning these games, every single one of them, and nights like tonight can help in the long run where I don't have to play 30 minutes or more.”\n\n\r\n                    The 76ers could use more production from Ben Simmons, Seth Curry and Danny Green, who shot a combined 4 for 13 from the floor in the first half, but that wasn’t necessary on this night. The three-time All-Star Embiid, who entered the evening fourth in the NBA in scoring, had his ninth 20-point half of the season, tied for the most in the league. He finished 10 for 19 from the floor.\n\n\r\n                    “It’s just dominance on his part. I think he’s figured it out, and he’s done such a good job of creating plays for other guys out of the post,” Harris said, later adding: “It's a pleasure to be out there on the floor with him.”\n\n\r\n                    With Towns out for the seventh straight game due to COVID-19 protocols and Reid sidelined for the first time by a wrist injury, Ed Davis took the big man spot for Minnesota with a four-guard lineup featuring rookie Anthony Edwards (15 points) in his first career start. This was the 10th different starting lineup used by coach Ryan Saunders in 18 games.\n\n\r\n                    “We knew what we were up against, how physical they are even when you’re at a full roster,” Saunders said.\n\n\r\n                    Malik Beasley led the Timberwolves with 22 points, and D'Angelo Russell added 14 points on just 3-for-11 shooting after a three-game absence due to a quadriceps injury.\n\n\r\n                    Davis did his best, and the Wolves scrapped their way through the first half to keep the score close until Embiid took over in the third quarter, but playing this short-handed they were never going to keep up with 18 turnovers.\n\n\r\n                    “We don’t play in our system enough. I think we kind of get away from it when things start going bad,” Russell said.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Harris had his second double-double of the season. ... Mike Scott missed his seventh straight game with knee swelling.\n\n\r\n                    Timberwolves: The last time Minnesota beat Philadelphia was here on Nov. 17, 2016, the only win over Embiid. ... Jarrett Culver missed his second straight game with a sprained ankle, and Juancho Hernangómez was sidelined for the eighth consecutive game due to COVID-19 protocols. That left the Wolves without three of their top six scorers and four of their nine most-used players.\n\n\r\n                    AT THE LINE\n\n\r\n                    Embiid leads the NBA in free throw attempts and makes, and this was his fifth game of the season with 16 or more tries.\n\n\r\n                    “A lot of people I guess call it flopping and all that stuff, but the way I see it is just about being smarter than your opponent,” Embiid said.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Visit the Indiana Pacers on Sunday night.\n\n\r\n                    Timberwolves: Host the Cleveland Cavaliers on Sunday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997101.31348
}