{
  "game_id": "0022201008",
  "espn_id": "401469163",
  "date": "Mar 11, 2023",
  "matchup": "ATL vs. BOS",
  "headline": "Tatum's 34 help Celtics hold off Hawks' comeback, 134-125",
  "body": "ATLANTA -- — When the Atlanta Hawks wouldn't give up their comeback bid late in the game, Boston coach Joe Mazzulla said his Celtics survived because they were able to “navigate the chaos.”\n\n\r\n              It helped that the Celtics sank 20 3-pointers.\n\n\r\n              Jayson Tatum led a balanced attack by scoring 11 of his 34 points in the fourth quarter, and the Celtics overcame Atlanta's fourth-quarter comeback bid, beating the Hawks 134-125 on Saturday night. \n\n\r\n              “We are playing at the level we are supposed to be playing,” Tatum said. “We responded when we needed to.”\n\n\r\n              The Celtics opened a six-game trip by having six players score in double figures. Jaylen Brown had 24 points. Tatum added 15 rebounds.\n\n\r\n              “We were intentional about what we wanted to accomplish,” Mazzulla said after the Celtics strengthened their hold on the No. 2 spot in the Eastern Conference standings.\n\n\r\n              Trae Young had 35 points and 13 assists for Atlanta, which could not maintain momentum following back-to-back wins at Washington. The Hawks remain eighth in the East.\n\n\r\n              With 1:25 remaining and Boston leading 129-121, Young and Marcus Smart had to be separated after the two were entangled and fell to the court under the Celtics' basket. Smart was called for an initial foul before a lengthy review by the officials called both players for technical fouls and ejected Smart.\n\n\r\n              “I just saw them both kind of go down, definitely chirping at each other going down,” Celtics center Al Horford said. “We were all in there trying to do damage control.”\n\n\r\n              The officials' crew chief, Sean Wright, told a pool reporter Smart was ejected “for the grab and takedown of Trae Young.” Wright said Young drew the technical foul \"for getting up and pointing in Marcus Smart’s face.”\n\n\r\n              Young said he had “nothing much to say” about the skirmish. He made two free throws to cut the deficit to six points.\n\n\r\n              The Celtics, who had only nine turnovers with 35 assists, had an answer for every Hawks challenge. Boston made 20 of 42 3s while Atlanta made only 10 of 34.\n\n\r\n              Boston led by 16 at 60-44, but the Hawks rallied in the final period. Clint Capela's tip-in cut Boston's lead to 108-103 with 8:06 remaining. Boston still led by only five points before Smart's 3-pointer stretched the advantage to 117-109.\n\n\r\n              Young's 3-pointer again pulled Atlanta within 119-114 before Horford answered with a 3 for Boston and Tatum's layup extended the advantage to 10 points. \n\n\r\n              “I feel like in the last couple of games we’ve been very conscious of taking advantage of our possessions,” Horford said. “We had some adversity there but as a group ... we have to keep moving and we did that.”\n\n\r\n              LOOKING FOR DEFENSE\n\n\r\n              Quin Snyder has stressed defense, including against 3-pointers, since he was named Atlanta’s coach on Feb. 26.\n\n\r\n              “If a team is going to make 20 3s in a game, it is tough to beat them,” Snyder said. “... It is something we continue to talk about and continue to work on and it is the end result of not staying in front of the ball.”\n\n\r\n              SELLOUT\n\n\r\n              Boston was welcomed to Atlanta by a strong turnout of fans wearing green in the sellout crowd of 17,884.\n\n\r\n              30-10 DOUBLE-DOUBLE (AGAIN)\n\n\r\n              Young has 10 games this season with at least 30 points and 10 assists, the most by any player in the Eastern Conference. His 61 career games with those totals are the seventh-most in NBA history.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: C Robert Williams (strained left hamstring) missed his fourth consecutive game. PG Payton Pritchard (left heel) missed his second straight game. ... Malcolm Brogdon and Derrick White each had 18 points.\n\n\r\n              Hawks: G Bogdan Bogdanovic (back tightness) was held out. ... Dejounte Murray had 14 points, his fourth game under 20 points in his last five.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Visit Houston on Monday night.\n\n\r\n              Hawks: Host Minnesota on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995202.5689359
}