{
  "game_id": "0022000257",
  "espn_id": "401267417",
  "date": "Jan 25, 2021",
  "matchup": "PHI @ DET",
  "headline": "Wright, Ellington lead Pistons over 76ers 119-104",
  "body": "DETROIT -- — Delon Wright scored a career-high 28 points and Wayne Ellington had another impressive shooting night for Detroit, leading the Pistons to a 119-104 victory over the Eastern Conference-leading Philadelphia 76ers on Monday.\n\n\r\n                    Jerami Grant scored 25 points for the Pistons (4-13), who still have the NBA's worst record but took advantage of Joel Embiid's absence. The Philadelphia star was out with back tightness. \n\n\r\n                    Detroit acquitted itself well in this two-game mini-series with the 76ers. Philadelphia needed a big game from Embiid to prevail 114-110 on Saturday night.\n\n\r\n                    The Pistons never trailed in the rematch. Ellington scored 20 points, shooting 6 of 9 from 3-point range. It was his fifth straight game with at least four 3s, tying a team record set by Joe Dumars in 1998-99.\n\n\r\n                    “I had Ray Allen and Dirk Nowitzki and some guys like that,\" Detroit coach Dwane Casey said. \"He’s right in that class as far as a shooter’s concerned.”\n\n\r\n                    Ellington is 30 of 50 from beyond the arc in his last six games.\n\n\r\n                    “We’re going to keep giving him the ball,\" Wright said. \"He’s a great shooter. He helps our offense flow.”\n\n\r\n                    Tobias Harris led Philadelphia with 25 points, but the 76ers (12-6) never made much of a run after the Pistons controlled the early going. Detroit's Josh Jackson was ejected in the fourth quarter, but Philadelphia couldn't take advantage.\n\n\r\n                    Sixers coach Doc Rivers wasn't panicking about the loss.\n\n\r\n                    “We didn't play well tonight. This was a very winnable game in my opinion, we just didn't win the game,” Rivers said. “I'm not going to overdo it right now. Way too early. ... I like our team. I like how we're playing overall.\"\n\n\r\n                    There were five technical fouls in the game.\n\n\r\n                    Detroit took an early 17-4 lead and was still ahead 64-50 at halftime. The third quarter came and went without the lead getting any tighter than seven, and it was never closer than nine in the fourth.\n\n\r\n                    \"We want to make this our normal thing,\" Wright said. \"We don’t want to celebrate a win. We want to continue to get wins and build on it.”\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Rivers and C Dwight Howard received technical fouls in the second quarter.\n\n\r\n                    Pistons: Derrick Rose (left knee) missed the game. ... Detroit came in averaging a league-high 44.1 bench points per game. The Pistons had only 29 on Monday.\n\n\r\n                    MISSED CHANCE\n\n\r\n                    Jackson and the Philadelphia bench were both called for technicals with 8:06 remaining in the fourth — the 76ers' technical was announced at the arena as being on Mike Scott, who wasn't even active for the game.\n\n\r\n                    Then, 33 seconds later, Jackson was called for an offensive foul and a second technical, meaning he was ejected. The foul was ruled a flagrant, so after all that, Philadelphia had three free throws and the ball.\n\n\r\n                    Ben Simmons missed two of the free throws and Harris missed the other, leaving the 76ers still down 99-85.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Host the Los Angeles Lakers on Wednesday night in a matchup of two of the top teams in the league so far.\n\n\r\n                    Pistons: Visit the Cleveland Cavaliers on Wednesday night. Detroit lost to Cleveland 128-119 in double overtime Dec. 26.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997102.950819
}