{
  "game_id": "0022200072",
  "espn_id": "401468227",
  "date": "Oct 28, 2022",
  "matchup": "CLE @ BOS",
  "headline": "Mitchell, LeVert score 41 points, Cavs beat Celtics in OT",
  "body": "BOSTON -- — A long, chainlink gold chain draped around his neck, Caris LeVert was wearing the spoils of his best night as a Cleveland Cavalier. \n\n\r\n              “It's the 'Junkyard Dog' we call it. We give it after every game — every win — to the guy that kind of digs in deep and kind of does the dirty work,” he said. “I got it this game.”\n\n\r\n              It was deserved. \n\n\r\n              LeVert and Donovan Mitchell each scored 41 points and the Cavaliers rallied to beat the Boston Celtics 132-123 in overtime on Friday night. The last time the Cavs had multiple 40-point scorers was Game 5 of the 2016 NBA Finals, when LeBron James and Kyrie Irving both had 41. \n\n\r\n              Cleveland trailed by as many as 15 in the first half and overcame a 75-point first half by the Celtics to earn its fourth straight win. \n\n\r\n              “For us to have the mental fortitude this early as a younger team that's honestly trying to get to where the Celtics were last year and continue to build, that says a lot about our character without our elite guard, too,” Mitchell said.\n\n\r\n              It was LeVert’s best game since joining the Cavs at the trade deadline last season, when he never figured out his role because of injuries. His previous high for Cleveland was 32 points last season against Dallas. He also had six 3s and three steals. \n\n\r\n              He scored Cleveland’s final 11 points Friday.\n\n\r\n              Jayson Tatum and Jaylen Brown led Boston with 32 points apiece. The Celtics shot 51% against the NBA’s second-rated defense, but also had 19 turnovers.\n\n\r\n              “We have to have make winning plays,\" Celtics interim coach Joe Mazzulla said. “We can't take anything for granted.”\n\n\r\n              Cleveland scored the first five points in OT. Boston rallied and tied it back up on a steal and dunk by Brown. \n\n\r\n              The Cavs led 126-123 when LeVert corralled an errant pass by Tatum, was fouled and hit two ensuring free throws. \n\n\r\n              Brown missed on the other end LeVert calmly drained a 24-footer with 31 seconds to play. \n\n\r\n              Boston built a 15-point lead before shooting 9 of 20 and committing six turnovers in the third quarter as their lead was trimmed to 99-95 entering the fourth. \n\n\r\n              “You can go one of two ways at that point,” Mitchell said. \"We continued to claw back,” \n\n\r\n              Cleveland stayed close throughout the period and took a 113-112 lead on a corner 3-pointer by LeVert with 1:10 to play. \n\n\r\n              The Celtics turned it over on a traveling call on Marcus Smart but got it back following a missed jumper by Mitchell. It started a fast break and led to layup by Brown with 28 seconds left. \n\n\r\n              Jarrett Allen was fouled underneath but connected only 1 of his 2 free throws. Tatum then missed 3 at the end of regulation. \n\n\r\n              The Cavaliers remained without All-Star Darius Garland, who continues to recover from the left eye laceration he sustained in their season opener. It left the point guard duties to Mitchell, who still managed to keep up his scoring with 17 points in the opening 24 minutes. \n\n\r\n              Mitchell also had the play of the night, stretching for a one-handed dunk over 7-footer Luke Kornet in the third quarter and then briefly staring down the big man before trotting back down the floor. \n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Shot 11 of 17 in third quarter, 6 of 9 from 3-point line. … Opened the game on a 22-9 run but were outscored 66-40 the rest of the first half. … J.B. Bickerstaff said it remains unclear when Garland will return to action. ”Still unsure,” Bickerstaff said. “He’s improving. He’s doing more and more on the floor. But, at this point it’s really a safety issue and not putting him in a compromising situation.”\n\n\r\n              Celtics: Mazzulla improved to 2-0 on coach’s challenges, getting a foul on Kornet overturned in the fourth quarter. … The 75 points they scored in the first half are their most in a first half since the 2007-08 title-winning team had 77 against Denver on Nov. 7, 2007. … Closed the first quarter on 25-11 run, including buzzer-beating 3-pointer by Sam Hauser, to take 34-33 lead into the second. … Led 75-62 at the half. \n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Knicks on Sunday.\n\n\r\n              Celtics: Host Wizards on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995261.028875
}