{
  "game_id": "0021500614",
  "espn_id": "400828501",
  "date": "Jan 17, 2016",
  "matchup": "LAL vs. HOU",
  "headline": "Harden scores 31 as Rockets rout Lakers 112-95",
  "body": "LOS ANGELES -- The Houston Rockets toyed with the Los Angeles Lakers in the first half before showing what they can do when they are motivated and working on all cylindars.\nJames Harden scored all of his 31 points in the first three quarters, and the Rockets pulled away from the Lakers with a pivotal run in the third en route to a 112-95 victory Sunday night.\nThe Rockets, who snapped a season-high five-game winning streak Friday night, began the second half of their schedule by beating the Lakers at Staples Center for the sixth straight time with seven players in double-digit scoring.\n\n\"We wanted to bounce back from that loss in the last game,\" Harden said. \"We allowed them to score too easy in the first half, but in the third quarter we turned it up. We knew we had to lock in on the defensive end, because we knew we could basically get anything we wanted on the offensive end if we got stops.\"\nThe Rockets (22-20) are 18-13 under interim coach J.B. Bickerstaff, who took over after Kevin McHale was fired on Nov. 18.\n\"I think the attitude and the camaraderie, the togetherness and the fight has been much better overall,\" Bickerstaff said. \"Time and time again there have been tough situations where we've been down in games, but we've stuck together and found a way to crawl back and win.\"\nDwight Howard had 14 points and 15 rebounds to earn his ninth straight double-double, his longest such streak since a 14-game run three seasons ago. He is averaging 18.9 points and 13.4 boards during this stretch.\nLou Williams led Los Angeles with 20 points. Kobe Bryant, trying to play through a sore right Achilles, had just five points in 24 minutes and tied a season high with nine assists before sitting out the fourth quarter.\n\"It's important to try and get out there and play if I can,\" Bryant said. \"You always feel terrible for the fans when you can't get out there and play. So If I can perform, I should.\"\nBryant got an assist on seven of the Lakers' first 12 baskets on his way to passing Jerry West for second place on the franchise's all-time list in that category behind Magic Johnson. On Thursday at Golden State, Bryant was on the receiving end of a heartfelt video tribute from West -- who also was in Oracle Arena that night in his present role as a Warriors executive board member.\n\"It means a lot. It's an accomplishment that I'm really really proud of,\" Bryant said.\nThe Rockets, who had fewer than 50 points in the paint in each of their previous 11 games, had 40 in the first half alone and finished with a season-high 70. The Lakers had 46 in the paint, after getting a season-best 54 in the previous meeting with Houston on Dec. 17 at Staples Center and losing 107-87.\n\"We were looking in there and we were making interior passes,\" Bickerstaff said. \"We know that the Lakers' big guys are coming to block shots. So when we attacked the paint, our bigs were able to get some easy buckets just by following the ball -- whether it was from the pass or off a rebound.\"\nJulius Randle started for the first time since Dec. 6 because of rookie Larry Nance's sore right knee knee, finishing with 12 points and 11 rebounds in 27 minutes.\nHarden, who began the night as the league's second-highest scorer this season, finished the first half with 21 points -- the 14th time this season that he had at least 20 before intermission.\nThe thrwe-time All-Star reached 30 with a 3-pointer that capped a 17-4 run in the first 5:08 of the third quarter and gave the Rockets a 77-61 cushion.\n\"We've seen it before. When we play the right way, we're a good team,\" forward Trevor Ariza said.\nTIP-INS\nRockets: Howard is within 31 minutes of the 30,000 mark in the regular season. The eight-time All-Star and five-time NBA rebounding champ missed only three games during his first six years in the league with Orlando. ... The Rockets are 13-7 when Howard has a double-double, including three wins over the Lakers.\nLakers: Bryant entered Sunday shooting 34.6 percent from the field -- the league's worst mark among qualifying players. ... The Lakers (9-34) would have to go no worse than 10-29 the rest of the way for Scott to avoid matching his career-worst 18-64 record with the New Orleans Hornets in 2004-05. ... Thursday is the 10th anniversary of Bryant's 81-point game against Toronto, the second-highest total in NBA history behind Wilt Chamberlain's 100 against the New York Knicks.\nUP NEXT\nRockets: At Los Angeles Clippers on Monday.\nLakers: Host Sacramento on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994279.759536
}