{
  "game_id": "0021600951",
  "espn_id": "400900346",
  "date": "Mar 08, 2017",
  "matchup": "CHA @ MIA",
  "headline": "Heat win again, rallying to beat Hornets 108-101",
  "body": "MIAMI -- Dion Waiters made the biggest shot of the night, then started walking toward midcourt with a look of disbelief on his face.\nHe was acting.\nThey're all believers in the Miami locker room right now.\nWaiters scored 24 points, including an acrobatic 3-pointer with 45 seconds left that helped seal things for Miami, and the Heat continued their improbable playoff push by beating the Charlotte Hornets 108-101 on Wednesday night.\n\"It came down to who wanted it more,\" Waiters said.\nGoran Dragic scored 22 points and handed out 10 assists for Miami, which moved within a half-game of No. 7 Detroit and No. 8 Chicago in the Eastern Conference standings. Luke Babbitt scored 12 points, Hassan Whiteside had 10 points and 15 rebounds, and James Johnson added 10 points for Miami, which is 20-4 in its last 24 games -- the NBA's best record in that span.\n\"You have to continue to try to get better,\" Heat coach Erik Spoelstra said. \"Our game can still get to another two, three, four levels. Whatever it is, we're not going to put a ceiling on it.\"\nKemba Walker scored 33 points for Charlotte, which got 16 from Nicolas Batum, 14 from Marvin Williams and 12 from Michael Kidd-Gilchrist.\nMiami outscored Charlotte 27-15 in the final quarter.\n\"They made shots,\" Hornets coach Steve Clifford said. \"Our defense in the fourth quarter actually was pretty good, much better than the stats will say. Neither team was able to get quality shots in the fourth quarter.\"\nThe Heat made 17 3-pointers, outscoring Charlotte 51-21 from beyond the arc.\nMiami opened the fourth on a 15-3 run, capped by James Johnson blocking a dunk attempt by Cody Zeller and setting up a Heat breakout where Dragic found Tyler Johnson for a 3-pointer and a 96-89 lead.\nAfter Charlotte got within four on a jumper by Walker with about two minutes left, Miami got offensive rebounds from Waiters and Whiteside on the same possession -- one that would last for more than a minute. Waiters capped the marathon trip by the big 3-pointer that put Miami up 105-98.\n\"Everybody contributed. Everybody played well,\" Dragic said. \"And Dion did his thing again.\"\nWalker missed a layup with about 25 seconds left, one that could have gotten Charlotte within two, and the Heat prevailed.\n\"We made a lot of mistakes defensively and those guys capitalized off our mistakes,\" Walker said. \"We did some really good things. We've got to keep building to try to keep getting better for this last stretch.\"\nTIP-INS\nHornets: Charlotte held Miami to 18 points in the first quarter, 11.4 points below the Heat average over their last 25 games. ... Johnny O'Bryant left early in the second quarter with a sprained right ankle, and Batum missed some of the second half with a sprained left ankle.\nHeat: Dragic got poked in the right eye early in the game. He briefly visited the locker room before returning later in the first quarter. ... Whiteside appeared in his 200th regular-season game, all but 19 of those with Miami.\nDRAWING DRAGIC\nDragic has become a savant at drawing fouls on 3-point attempts. He did it twice Wednesday, pushing his total to 18 such calls this season. He drew shooting fouls while beyond the arc only twice in the 2015-16 regular season.\nCLOSEOUT WOES\nCharlotte is now just 8-9 in road games this season when it leads entering the fourth quarter. The Hornets led 86-81 going into the fourth on Wednesday.\nUP NEXT\nHornets: Host Orlando on Friday. Charlotte is 2-0 against the Magic this season, winning by an average of 20 points.\nHeat: Host Toronto on Saturday. It'll be the first of three Heat-Raptors meetings in a four-week span.",
  "source": "espn_api",
  "crawled_at": 1764995476.3216288
}