{
  "game_id": "0022000822",
  "espn_id": "401307617",
  "date": "Apr 12, 2021",
  "matchup": "PHX vs. HOU",
  "headline": "Suns hit record-tying 18 3s in half, beat Rockets 126-120",
  "body": "PHOENIX -- — Jae Crowder scored 26 points, Devin Booker added 24 and the Phoenix Suns tied an NBA record with 18 3-pointers in the first half on the way to a 126-120 victory over the Houston Rockets on Monday night.\n\n\r\n                    The long balls came in bunches for both teams in this contest, which at times resembled a game of H-O-R-S-E. The Suns finished with a franchise-record 25 3-pointers and the Rockets added 17. The combined total of 42 3s was one shy of an NBA record.\n\n\r\n                    “The hoop did feel a little bigger tonight,\" Crowder said with a grin.\n\n\r\n                    The Suns jumped out to an 81-58 lead by halftime after making 18 of 24 (75%) 3s. Crowder was causing a big chunk of the damage, scoring all of his points in the first half while making 8 of 9 from behind the arc as a socially distanced crowd got louder with each shot.\n\n\r\n                    “It was fun to watch for sure,” Suns guard Jevon Carter said. “Love to see my man Jae out there hoopin.'”\n\n\r\n                    Crowder had previously never made more than six 3-pointers in a game. The Suns matched the record set by the Utah Jazz, who hit 18 3s in the first half earlier this season in a game against Orlando.\n\n\r\n                    Despite the Suns’ hot shooting, the Rockets were able to stay relatively close because they were pouring in buckets as well. \n\n\r\n                    The Suns led 103-88 at the end of the third. Suns coach Monty Williams was irritated that his team made so many 3s but struggled on defense, which allowed the game to remain close.\n\n\r\n                    “Yeah, we hit some 3s,\" Williams said. \"But we gave a team confidence when we could have put them away.”\n\n\r\n                    Crowder agreed: “We feel like we can close the game better as a group. We let those guys stick around, stick around, stick around.”\n\n\r\n                    Houston pulled within 114-109 with 5:45 remaining but Phoenix responded with the next six points — on three rare 2-point buckets — and the Suns were able to hold on for the win.\n\n\r\n                    Christian Wood led the Rockets with 25 points and 15 rebounds. Kevin Porter Jr. added 22 points.\n\n\r\n                    Phoenix was undeniably on a roll, especially in the first half, but one reason was Houston’s poor defense. Several of the Suns’ looks were wide open.\n\n\r\n                    “What they do is make 3s and we allowed them to do what they do, partly because we were making mistakes,” Rockets coach Stephen Silas said.\n\n\r\n                    The Rockets have lost eight of their past nine, including the last three in a row, and fell to 14-40 this season. The Suns have won nine of 10 and improved to 38-15.\n\n\r\n                    TIP-INS\n\n\r\n                    Rockets: Houston was without G Sterling Brown (left knee soreness), G Dante Exum (right calf strain), G Eric Gordon (right groin strain), F Danuel House Jr. (right ankle sprain) and G/F David Nwaba (right wrist sprain). ... The Rockets finished 17 of 42 from long range (41%).\n\n\r\n                    Suns: F Abdel Nader (knee soreness) missed his 12th straight game. ... This was the first season sweep for the Suns against the Rockets since the 2009-10 season. ... Deandre Ayton finished with 18 points. Chris Paul had 10 assists. ... Phoenix's bench added 43 points. Cam Payne and Cam Johnson both had 11 points. Carter added nine points on three 3-pointers in the second quarter. \n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: Host the Pacers on Thursday night.\n\n\r\n                    Suns: Host the Heat on Tuesday night.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt at www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997738.979991
}