{
  "game_id": "0021600059",
  "espn_id": "400899509",
  "date": "Nov 02, 2016",
  "matchup": "LAL @ ATL",
  "headline": "Williams lifts Lakers to 123-116 comeback win over Hawks",
  "body": "ATLANTA --  Lou Williams wasn't surprised he saved his best for the end.\n\nWilliams scored 16 of his 18 points in the fourth quarter, and the Los Angeles Lakers rallied after trailing most of the game to beat the Atlanta Hawks 123-116 on Wednesday night.\n\nWilliams, the Atlanta native who played for the Hawks from 2012-14, had a quiet game before his big final quarter.\n\n\"The fourth quarter is normally my best quarter of my career,\" Williams said.\n\nThe Hawks led 60-51 at halftime. The Lakers, led by D'Angelo Russell's 23 points, dominated the second half. It was an impressive performance for a team playing the second straight night at the end of a four-game road trip. It was their first win of the trip.\n\n\"We're just learning,\" said Nick Young, who had 17 points. \"We've pretty much been in every game. It was bound to go our way one of these nights.\"\n\nDwight Howard had 31 points and 11 rebounds and Tim Hardaway Jr. had 26 points for Atlanta.\n\nA 3-pointer by Brandon Ingram early in the fourth quarter gave the Lakers a 99-98 lead -- their first since the opening period. A layup by Williams stretched the Lakers' lead to 107-100.\n\nA steal and basket by Atlanta's Dennis Schroder and a 3-pointer by Kyle Korver -- his first points of the game -- cut the lead to two.\n\nWilliams beat the shot clock with a 3-pointer, and a jam by Larry Nance Jr. gave the Lakers a 118-112 lead.\n\nAfter Julius Randle blocked a shot by Schroder, Young's 3-pointer with 17.9 seconds remaining clinched the win.\n\nThe Lakers outscored the Hawks 72-56 in the second half while excelling in the up-tempo pace the Hawks hope to embrace.\n\nWhen asked if the Hawks like the fast pace, Korver said \"We like to play defense, too.\"\n\nClearly, giving up 123 points didn't fit Hawks coach Mike Budenholzer's plan.\n\n\"You can't ever feel good if you give up that kind of offense in two consecutive quarters,\" Budenholzer said.\n\nTIP-INS\n\nLakers: C Timofey Mozgov, who suffered a left eye contusion in Tuesday night's loss at Indiana, did not play. After results from a CT were inconclusive, Mozgov will have additional tests and will be examined by team doctors on Thursday when the team returns to Los Angeles. ... The Lakers shot 60.9 percent in the third quarter and 53.9 percent for the game. ... Luol Deng had 13 points and 10 rebounds.\n\nHawks: Hardaway hit two 3-pointers in the last minute of the opening quarter, giving him 14 points with four 3-pointers for the period. ... Schroder had 11 points and six assists. ... Paul Millsap had four of the team's 18 turnovers.\n\nTECHNICAL ISSUES\n\nTechnical problems with the scoreboard and shot clocks caused confusion in the third quarter. Hawks public address announcer Ryan Cameron had to announce the updated score following each basket for the final 3 minutes of the period.\n\nFACES IN THE CROWD\n\nBoxing champion Floyd Mayweather Jr. had a front-row seat. Former Atlanta Falcons star receiver Roddy White also drew cheers when shown on the video board.\n\nROOKIE DEBUT\n\nLakers rookie Ivica Zubac, 19, of Croatia had six points in his NBA debut as the fill-in starter for Mozgov. Howard went straight at Zubac with a jam on Atlanta's first possession, but the young Zubac didn't back down. Zubac answered by making a hook shot over Howard and then scored again for the Lakers' second field goal. Zubac lasted only about five minutes before going to the bench with his third foul.\n\nUP NEXT\n\nLakers: The Lakers return home to play Golden State on Friday night.\n\nHawks: After opening the season with a home win over Washington, Atlanta plays at the Wizards on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995451.552139
}