{
  "game_id": "0021700448",
  "espn_id": "400975199",
  "date": "Dec 18, 2017",
  "matchup": "DAL vs. PHX",
  "headline": "Len, Suns complete 97-91 comeback win against Mavericks",
  "body": "DALLAS --  Isaiah Canaan and the Phoenix Suns were confident they could come back to win. After all, they had just done it two days ago.\n\nAlex Len had 14 points and 14 rebounds to help Phoenix rally past the Dallas Mavericks 97-91 on Monday night for its second consecutive victory on the road.\n\n\"It's a long game and it's all about getting stops and converting on the other end,\" Canaan said. \"I told them when we get stops, the shots are going to fall in the second half and that's what happened.\"\n\nTJ Warren scored 19 points and Canaan added 17 as the Suns (11-21) improved to 2-0 on a three-game trip despite playing without injured guard Devin Booker. Phoenix erased a 15-point deficit Saturday in a 108-106 win against Minnesota.\n\nCanaan, Len and Troy Daniels (12 points) all reached double figures off the bench as the Suns' reserves outscored their Mavericks counterparts 55-28.\n\n\"It's crazy. When they come in with that high energy, playing the right way, spacing the floor, it works a lot for us,\" Warren said. \"Continue to do that, it's going to translate into wins.\"\n\nDallas (8-23) lost its third straight game and has one win in its last seven.\n\n\"You have to give credit to Phoenix; they beat us badly,\" Mavericks coach Rick Carlisle said. \"Bad starts and poor finishes are the recipe for losses.\"\n\nHarrison Barnes had 26 points and Devin Harris added 14 for Dallas. Yogi Ferrell and Wesley Matthews each scored 13.\n\nPhoenix came from behind and won the game in the fourth quarter.\n\n\"Our defense kept us in it again,\" Suns interim coach Jay Triano said. \"That was the key for us. ... If we can keep playing good defense and make it tough for teams to score and rebound the ball the way we have been, we'll figure out a way to score eventually.\"\n\nAfter the Suns had trailed for the entire second half, Canaan tied it 79-all on a 3-pointer with 7:29 remaining. Len gave Phoenix its first lead since the second quarter on a pair of free throws.\n\nPhoenix led by as many as eight in the fourth quarter, 89-81, but didn't seal the victory until Warren made one of two free throws with 11.4 seconds remaining and knocked down two more with 5.6 seconds left.\n\nIt was the second consecutive game in which Dallas let a fourth-quarter lead slip away. San Antonio went on a 13-0 run Saturday over the final 4:11, including a game-winning basket by Manu Ginobili for a 98-96 victory.\n\n\"Execution is a big part of it,\" Harris said. \"Tonight we gave up too many paint points, especially in the fourth quarter.\"\n\nNUMBER RETIRED\n\nThe Mavericks announced they will retire Derek Harper's No. 12 on Jan. 7 against the New York Knicks. Harper played 12 seasons for Dallas and holds franchise records for assists (5,111) and steals (1,551). He ranks fourth in points (12,597). He will be the third player in team history to have his number retired.\n\nZEKE SIGHTING\n\nDallas Cowboys running back Ezekiel Elliott sat courtside by the Mavericks bench. Elliott is back in town after serving a six-game suspension and spending his time training in Cabo San Lucas, Mexico. Elliott is eligible to return to the Cowboys this week.\n\nTIP-INS\n\nSuns: Booker missed his sixth game with a left adductor strain. ... Tyson Chandler was the starting center on the Mavericks' 2011 NBA championship team.\n\nMavericks: Rookie point guard Dennis Smith Jr. missed his sixth straight game with a left hip strain. ... Dirk Nowitzki made his 1,828th career 3-pointer, passing Kobe Bryant for 13th in NBA history. Chauncey Billups ranks 12th with 1,830.\n\nUP NEXT\n\nSuns: Visit the Los Angeles Clippers on Wednesday.\n\nMavericks: Host the Detroit Pistons on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993960.09863
}