{
  "game_id": "0022400866",
  "espn_id": "401705432",
  "date": "Mar 02, 2025",
  "matchup": "DEN @ BOS",
  "headline": "Brown scores 22, Celtics beat Nuggets 110-103 despite 20 points, 14 boards and 9 assists from Jokic",
  "body": "BOSTON -- — Jaylen Brown scored 22 points and Derek White hit a floater from the foul line with less than a minute left on Sunday to help the Boston Celtics recover after blowing most of a 20-point, first-half lead and beat the Denver Nuggets 110-103.\n\n\r\n              Jayson Tatum scored 16 points with 11 rebounds and White scored 17 for Boston, which has not lost three games in a row all season.\n\n\r\n              Nikola Jokic had 20 points, 14 rebounds and nine assists for the Nuggets. Jamal Murray scored 13 of his 26 points in the fourth quarter, and Christian Braun scored 24 for Denver, which has lost three of its last five games.\n\n\r\n              One game after blowing a 22-point lead and losing to the NBA-best Cleveland Cavaliers, the Celtics coughed up most of a 20-point lead against Denver, the No. 2 team in the West. The Nuggets, who trailed 59-39 in the final minutes of the first half, scored 10 straight points near the end of the third to cut a 15-point lead to five.\n\n\r\n              Takeaways\r\n              Nuggets: Jokic appeared to be limping from the opening tap. If he's hurt, that could be a big problem for Denver down the stretch.\n\n\r\n              Celtics: Have shown a tendency to relax after opening big leads. \n\n\r\n              Key moment\r\n              After Murray made a 3-pointer to make it a five-point game with about three minutes left, Boston missed three times and turned the ball over once before Murray's layup made it 102-99.\n\n\r\n              Brown drove to the basket and missed, but White followed the play, grabbing the ball near the free-throw line and floating in a basket to make it a two-possession game. At the other end, Murray threw the ball away, and Al Horford finished the fast break.\n\n\r\n              Key stat \r\n              Tatum was 4 for 15 from the floor, making just 1 of 7 from 3-point range.\n\n\r\n              Up next\r\n              Both teams are off until Wednesday, when the Celtics host Portland and the Nuggets host Sacramento.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998343.951054
}