{
  "game_id": "0022200498",
  "espn_id": "401468653",
  "date": "Dec 26, 2022",
  "matchup": "BKN @ CLE",
  "headline": "Nets push winning streak to 9 with 125-117 win over Cavs",
  "body": "CLEVELAND -- — The only drama surrounding the Brooklyn Nets right now is when they're going to lose again.\n\n\r\n              Kyrie Irving and Kevin Durant scored 32 points apiece and the Nets extended their longest winning streak since moving to Brooklyn to nine games with a 125-117 victory over the Cleveland Cavaliers on Monday night.\n\n\r\n              The Nets withstood a sensational 46-point performance by Darius Garland, who single-handedly brought the Cavs back in the fourth.\n\n\r\n              Brooklyn has won 13 of 14 and is beginning to look like an NBA title contender after months of distractions — mainly revolving around Irving and his off-court antics.\n\n\r\n              “To be honest, we’ve always been about basketball,\" said Durant, who fouled out in the final two minutes. \"The outside noise makes it seem like we don’t care about the game, but so many voices speak about our locker room who don’t have any idea what’s going on.\n\n\r\n              \"We’ve always been about the game.”\n\n\r\n              T.J. Warren added a season-high 23 points for the Nets, who handled one of the teams they're chasing in the Eastern Conference standings after beating Milwaukee by 18 on Dec. 23.\n\n\r\n              Durant moved past Tim Duncan (26,496) into 15th place on the career scoring list when he dropped a 20-foot jumper in the second quarter. Next up for Durant is Dominique Wilkins (26,668).\n\n\r\n              “At some point, you've got to be able to celebrate some small wins,” Durant said of overtaking Duncan. “To be able to pass a legend, it's something I'll call my folks about tonight. I know that I've got more to do.\"\n\n\r\n              Irving made a season-high seven 3-pointers — and two key free throws with 41.1 seconds left — while being booed nearly every time he touched the ball by fans who cheered him during six seasons with Cleveland.\n\n\r\n              Still, he was happy to be back where he began.\n\n\r\n              “Cleveland is never in the rearview,” he said.\n\n\r\n              Garland finished 14 of 20 from the field and added eight assists with just one turnover in 40 minutes to lead the Cavs, who dropped their second straight and are 16-4 at home.\n\n\r\n              Donovan Mitchell added just 15 points — 13 below his average — on 5 of 16 shooting while being guarded primarily by Brooklyn's Ben Simmons.\n\n\r\n              “They came out and punched first,” Mitchell said. “They have some of the best shooters in the league. I have to be better. We have to be better, and we will.”\n\n\r\n              The Cavs were only down 12 entering the fourth before Irving scored eight quick points, the last on a long 3-pointer from way beyond the top of the key to give Brooklyn its biggest lead at 102-83.\n\n\r\n              However, Garland wasn't done (he scored 18 in the fourth) and pulled the Cavs within 121-117 with 44 seconds left. With a chance to make it tighter, Garland's runner in the lane was blocked by Nic Claxton and the Nets survived.\n\n\r\n              Irving, who made his pro debut for Cleveland 11 years ago on Dec. 26, dropped four 3-pointers in the final three minutes of the first half and the Nets closed the second quarter with a 21-6 run to open a 64-49 halftime lead.\n\n\r\n              The Nets are finally playing like the powerhouse many expected. Coach Jacque Vaughn, who took over when Steve Nash was fired after seven games, was asked before the game what was at the heart of the team's rise.\n\n\r\n              “Basketball,” he said.\n\n\r\n              Afterward, Vaughn complemented his team for staying locked in.\n\n\r\n              “We stripped our playbook, and we created a little momentum,\" he said. \"Guys are playing extremely free of mind and they’ve done an unbelievable job keeping the focus on basketball.”\n\n\r\n              Nets: Durant previously passed Alex English, Vince Carter, Kevin Garnett, John Havlicek and Paul Pierce on the scoring list this season. ... G Seth Curry (non-COVID illness) was a pregame scratch ... Joe Harris (left knee) is not traveling with the team. Harris underwent an MRI that “showed soreness and swelling,” Vaughn said.\n\n\r\n              Cavaliers: Made their first 16 free-throw attempts. ... Coach J.B. Bickerstaff said G Ricky Rubio (knee) will not return before the end of the calendar year, but the 32-year-old remains on track to rejoin the team in 2023. ... The league's best defensive team, Cleveland has held opponents below 100 points an NBA-high 12 times.\n\n\r\n              UP NEXT \n\n\r\n              Nets: Visit Atlanta on Wednesday night.\n\n\r\n              Cavaliers: Visit Indiana on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994880.2046669
}