{
  "game_id": "0021900527",
  "espn_id": "401161169",
  "date": "Jan 04, 2020",
  "matchup": "OKC @ CLE",
  "headline": "Schroder, Gilgeous-Alexander lead Thunder past Cavs 121-106",
  "body": "CLEVELAND --  Kevin Love has been the subject of trade speculation all season, and the Cleveland Cavaliers star showed his frustration several times during Saturday night's 121-106 loss to Oklahoma City.\n\nDennis Schroder scored 22 points and Shai Gilgeous-Alexander had 20 as the Thunder rolled to their fifth straight victory.\n\nEarlier in the day, Love yelled at Cavaliers general manager Koby Altman over a recent fine, according to a report by The Athletic.\n\nCiting anonymous sources, The Athletic said the incident took place following the team's shootaround and Love was screaming in front of teammates, coaches and front office staff.\n\nLove became annoyed late in the second quarter when Collin Sexton didn't throw him the ball as he was getting position in the lane. The veteran forward threw his arms in the air and slowly walked toward Sexton at the top of the key.\n\nAfter receiving the ball, Love threw a low pass to Cedi Osman, who bobbled the ball before shooting a 3-pointer.\n\n\"We were making a play call,\" Love said. \"We were in the bonus and Chris Paul was on me, so I felt swing it to me and try to throw it in the post, see if they double team and get a good shot out of that. That's not what we did, and yeah, I was frustrated.\"\n\nCavaliers coach John Beilein took blame for the play call as the clock was winding down, but doesn't want his players to show frustration on the court.\n\n\"If I do it, if anyone does it, it really doesn't make you a better player or a better coach at that time,\" Beilein said. \"It's like carrying a suitcase around with you, that you have extra baggage. We don't need to do that. ... So as it's pointed out to me or I see it, we try to address it the best we can.\"\n\nThe report in The Athletic said Love was fined for $1,000 for his outburst on the bench during Tuesday's game in Toronto, where he pounded a chair in frustration as he came off the court during a timeout.\n\nLove's name has come up in trade talks as the rebuilding Cavaliers are looking to the future. He's in the second season of a four-year, $120 million contract extension.\n\nDanilo Gallinari added 19 points, hitting five 3-pointers, and Steven Adams grabbed 16 rebounds for the Thunder.\n\n\"The ability and talent of Chris, Shai and Dennis was the difference,\" Thunder coach Billy Donovan said. \"They have the ability to get around -- and through -- coverage. They can find a way to get downhill and find a way to the basket.\"\n\nOklahoma City went ahead late in the first quarter and steadily built the lead. The Thunder led 91-74 before Cleveland got within nine early in the fourth, but Oklahoma City pulled away.\n\nSexton scored 30 points for the Cavaliers, who have lost three straight.\n\nTIP-INS\n\nThunder: Oklahoma City lost its first six road games, but is 8-3 away from home since. ... C Nerlens Noel limped to the locker room after stepping on the foot of a Cavaliers player in the third quarter. He was diagnosed with a sprained left ankle and didn't return.\n\nCavaliers: Cleveland played without top bench players Larry Nance Jr. and Kevin Porter Jr. Nance could be out for two weeks because of a sore left knee, while Porter missed the game for personal reasons. The team expects Porter to return Sunday against Minnesota. ... Rookie guard Dylan Windler, who hasn't played this season because of a stress reaction in his left leg, is participating in 3-on-3 drills.\n\nMEMORIES\n\nBeilein was coaching West Virginia when the Mountaineers defeated Paul and Wake Forest in the second round of the NCAA Tournament on March 19, 2005, in a game played at Cleveland State.\n\nWest Virginia won 111-105 in double overtime despite Paul scoring 22 points with nine rebounds and six assists before fouling out.\n\n\"His last college game was right down the street,\" Beilein said. \"I remember him well. Now it's 15 years later and in the NBA, he's terrific.\"\n\nPaul, 34, is enjoying his first season with the Thunder.\n\n\"The guys on the team just tell me I'm old, but I feel damn good, so I'm cool,\" he said. \"I always try to stay in the moment, but I feel like I keep good perspective.\"\n\nUP NEXT\n\nThunder: At the Philadelphia 76ers on Monday.\n\nCavaliers: Host the Minnesota Timberwolves on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996229.8093078
}