{"game_id": "171104007", "title": "Synthetic Recap", "body": "**FOR IMMEDIATE RELEASE**\n\n**Mourning’s Magnificent 50-Point Outing Powers Wizards Past Nuggets**\n\nDENVER – On a night where the thin mountain air seemed to fuel a singular, historic performance, Alonzo Mourning didn’t just beat the Denver Nuggets; he authored a masterpiece.\n\nThe Washington Wizards’ center delivered a career-defining, monstrous 50-point performance, single-handedly dismantling the Nuggets in a commanding 120-96 road victory. From the opening tip, it was clear this was Mourning’s night, as he established an offensive onslaught the home team had no answer for.\n\nMourning was a force of nature in the paint, shooting a blistering 20-of-28 from the field. He dominated the low post with a series of thunderous dunks, feathery jump hooks, and relentless put-backs, drawing fouls and converting at the line, going a perfect 10-for-10. His 50 points were not just a season-high; they were a statement, echoing through McNichols Arena as the exclamation point on a truly elite individual effort.\n\nWhile the Nuggets scrambled to contain the unstoppable Mourning, the Wizards’ supporting cast capitalized. Rod Strickland orchestrated the offense with precision, dishing out a game-high 15 assists, many of which fed the hot hand of Mourning. The defensive effort was equally potent, with the Wizards forcing 21 Denver turnovers and converting them into easy transition buckets, further widening the gap.\n\nThe Nuggets, despite a balanced scoring effort, simply could not counter the hurricane in the middle. Antonio McDyess and others took turns trying to slow Mourning, but the Wizards’ center was in a zone that transcended defensive schemes.\n\nThis wasn't merely a win for the Wizards; it was a night of historic individual brilliance. The final buzzer didn't just signal a 24-point victory; it cemented Alonzo Mourning’s 50-point explosion into the annals of the franchise, a performance so dominant it left no doubt about who was the most formidable player on the court.", "source": "AI_Reconstruction"}