{
  "game_id": "0022200361",
  "espn_id": "401468516",
  "date": "Dec 06, 2022",
  "matchup": "DET @ MIA",
  "headline": "Pistons run away in 2nd half, embarrass Heat 116-96",
  "body": "MIAMI -- — The Detroit Pistons had a rare easy win.\n\n\r\n              Bojan Bogdanovic scored 28 of his 31 points in the second half, Alec Burks added 18 and the Pistons ran away in the final two quarters to beat the Miami Heat 116-96 on Tuesday night.\n\n\r\n              “Second half, we wanted to play faster and move the ball a little bit,\" Bogdanovic said. “I hit a couple 3s and everything opened up.\"\n\n\r\n              Saddiq Bey scored 14, Isaiah Stewart had 11 points and 11 rebounds and Cory Joseph also finished with 11 points for the Pistons, who trailed 50-47 at halftime — then outscored Miami 69-46 in the final two quarters.\n\n\r\n              It was Detroit’s biggest margin of victory this season. The Pistons had won only one game by more than seven points, that being a 128-114 triumph over Golden State on Oct. 30.\n\n\r\n              “It's a huge team win,\" Bogdanovic said. “We held a great offensive team under 100 points.\"\n\n\r\n              Tyler Herro led all scorers with a season high-tying 34 points for Miami, which has dropped three of its last four games. The Heat are off to an 11-14 start for the third time in the last five seasons.\n\n\r\n              “We simply just didn’t play well,\" Heat coach Erik Spoelstra said. “I thought we were pretty stable defensively through three quarters, and then the floodgates just opened.\"\n\n\r\n              Miami played without Jimmy Butler (right knee injury management), Dewayne Dedmon (left foot plantar fasciitis) and Gabe Vincent (left knee). But the Heat had Victor Oladipo for the first time all season; Oladipo, who had been sidelined with a knee issue since the preseason, had nine points in 18 minutes.\n\n\r\n              It was only the 80th appearance for Oladipo out of a possible 317 games since he suffered a severe knee injury while with the Indiana Pacers in 2019.\n\n\r\n              Herro made his first eight shots, seven of those in the first half, staking Miami to its slim early lead.\n\n\r\n              “He’s a dynamic player. ... He’s going to score on everybody,” Pistons coach Dwane Casey said.\n\n\r\n              Herro averages 27.8 points in five career games against Detroit, his most against any team. He and Bam Adebayo combined for 55 points but the other eight Heat players who played Tuesday combined for only 41.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Casey has coached against Spoelstra 44 times. Of the 102 coaches he’s faced in the NBA, he’s gone up against nobody more often than he has Spoelstra. ... Detroit is now 4-3 when holding opponents to 109 points or less. The Pistons are 3-16 when allowing 110 or more. ... The Pistons outscored Miami 57-30 from 3-point range. ... Cade Cunningham (left shin soreness) didn't play.\n\n\r\n              Heat: Adebayo also had 15 rebounds. ... Miami led by 11 in the first quarter and wound up losing for the second consecutive night. The Heat led 28-17 in Memphis on Monday in a 101-93 defeat; they led 17-6 on Tuesday. “Two games not to our standard,\" Spoelstra said. ... Oladipo has appeared in more playoff games with Miami (15) than regular-season games (13). ... The Heat trailed for the final 18:49.\n\n\r\n              USMNT VISITOR\n\n\r\n              Weston McKennie, a midfielder for the U.S. men’s national soccer team, was at the game and seated at a courtside table. McKennie played in all four games with the U.S. in the World Cup at Qatar; the Americans were eliminated with a round-of-16 loss to the Netherlands on Saturday.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Visit New Orleans on Wednesday.\n\n\r\n              Heat: Host the Los Angeles Clippers on Thursday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994380.7399108
}