{
  "game_id": "0021900874",
  "espn_id": "401161516",
  "date": "Feb 27, 2020",
  "matchup": "IND vs. POR",
  "headline": "Sabonis scores 20 points, Pacers beat Trail Blazers, 106-100",
  "body": "INDIANAPOLIS --  The Pacers are preparing for a playoff run with a starting five that's barely played together this season.\n\nDomantas Sabonis had 20 points and 11 rebounds to lead Indiana to a 106-100 victory over the Portland Trail Blazers on Thursday night.\n\nMalcolm Brogdon had 17 points, eight assists and six rebounds while T.J. Warren and Victor Oladipo scored 15 points each for the Pacers, who have won four of their last five. Oladipo was playing in his ninth game of the season.\n\n\"Tonight was about being consistent and really establishing ourselves, especially that first unit,\" coach Nate McMillan said. \"That group has only played about 100 minutes together this season. That's about three games, so it was really about them working on an identity.\"\n\nCJ McCollum had 28 points and eight assists, Gary Trent Jr. scored 16 of his 20 points in the second half and finished with five rebounds, and Hassan Whiteside had 18 points and 16 rebounds for the Trail Blazers, who have lost five of six.\n\nThe Pacers were able to hold off the Blazers' late push to snap a five-game losing streak in the series.\n\nIndiana led by as much as 14 when Warren made a fadeaway jumper to give the Pacers a 96-82 lead with 6:12 remaining.\n\n\"We started being aggressive,\" Sabonis said. \"We didn't have enough energy in the first half. We've got a lot of weapons and when we get stops, it's tough to guard us in transition.\"\n\nPortland then went on an 18-7 run to cut the deficit. After Brogdon made a jumper to give Indiana a 103-93 lead with 1:54 remaining, the Trail Blazers scored seven straight. McCollum's floater made it 103-100 with 30 seconds to go.\n\nMyles Turner drilled a 3-pointer with 9 seconds remaining to seal it.\n\n\"It felt like it was a winnable game, that's for sure,\" McCollum said. \"We had a chance. Probably shouldn't have let them get that run, but we were able to withstand it and come back.\"\n\nThe Trail Blazers went on a 10-1 run late in the first half to push ahead.\n\nMcCollum made a 3-pointer to give Portland a 42-40 lead with 3:13 to go in the second quarter. After a free throw by Oladipo, McCollum made another 3 and then a fadeaway to put the Trail Blazers in front 47-41.\n\nPortland led 49-43 at halftime.\n\nTIP-INS\n\nTrail Blazers: Carmelo Anthony had 12 points and seven rebounds. ... McCollum was 3 of 12 from 3-point range. ... G Damian Lillard missed a fourth straight game with a right groin strain.\n\nPacers: Turner had 14 points and 10 rebounds. ... Oladipo finished with seven rebounds. ... Indiana went 18 of 23 (78.3%) from the free-throw line. ... G Edmond Sumner was out with a sore left hip.\n\nFINDING HIS WAY\n\nOladipo was back in the lineup after missing the last two games with a sore lower back. He missed the first 47 games of the season while recovering from a right knee injury.\n\n\"He's still working his way back and I thought he had a better third quarter,\" McMillan said. \"I thought he had a couple attacks in transition, which is what we want to see. We want to advance and allow him to get to the basket. We had 15 fast break points in the third quarter, so we got to the tempo we wanted to play and Vic was a big part of that.\"\n\nUP NEXT\n\nTrail Blazers: At Atlanta on Saturday for the second of a three-game trip.\n\nPacers: At Cleveland on Saturday for the opener of a five-game trip.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995837.1260679
}