{
  "game_id": "0022200379",
  "espn_id": "401468534",
  "date": "Dec 09, 2022",
  "matchup": "TOR @ ORL",
  "headline": "Wagner, Banchero lead Magic over Raptors 113-109",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 34 points and the Orlando Magic turned to rookie Pablo Banchero in the final minutes Friday night to hold off Toronto 113-109 after the Raptors had wiped out a 20-point deficit in the second half.\n\n\r\n              Banchero finished with 23 points and six rebounds for the Magic, who have won two straight for only the second time this season.\n\n\r\n              Pascal Siakam had 36 points, nine rebounds and seven assists for Toronto. Gary Trent Jr. added 20 points and Fred VanVleet had 19.\n\n\r\n              The Raptors won 11 of their previous 12 games against the Magic, including a 121-108 victory in Toronto last Saturday.\n\n\r\n              “We came in and everyone was like, ‘Oh, we’re supposed to win.’ But it’s the NBA — there’s no games you’re supposed to win,” Siakam said. \"We’re all professionals and these teams come in and they play hard and they want to win, and we’ve got to have the same mentality.\n\n\r\n              “Those guys had a great rhythm early, and that’s what happens when we don’t come out with the energy we had when we beat them at home.”\n\n\r\n              Wagner scored 14 points in a span of 3:33, helping Orlando build a 14-point lead in the first half.\n\n\r\n              Behind the shooting of Trent (5 for 5, including three 3s), the Raptors erased that deficit quickly, but Banchero scored Orlando's final seven points of the half and the Magic led 67-63 at the break.\n\n\r\n              Another scoring burst by Wagner stretched it to 88-68 midway through the third quarter. Siakam scored 18 of the Raptors' 40 points as they charged back to tie it at 108 on OG Anunoby's two free throws with 1:58 remaining.\n\n\r\n              Wagner had the only field goal after that on a putback, and Banchero's two free throws with 4.8 seconds left clinched the win for the Magic.\n\n\r\n              Banchero, who shot 8 of 11, credited the play of point guard Markelle Fultz, who had 15 points and five assists in his sixth game back from a toe injury.\n\n\r\n              “Markelle’s unselfish. All of us are unselfish, so we know there’s a chance he can get it back to you and someone can make a play,\" Banchero said. \"When you know that, you don’t mind passing the ball to Markelle or Franz or whoever. Markelle’s a great point guard and you can always trust him with the ball.”\n\n\r\n              Orlando shot 67% in the first half and 59% for the game. Mo Bamba grabbed 13 rebounds to help the Magic to a 43-33 advantage on the boards.\n\n\r\n              “We actually fought pretty hard, I thought, for the last 16 or 17 minutes — about as hard as we could. But not very good at the start of either half,\" said Toronto coach Nick Nurse. \"We dug ourselves huge, huge holes in the first five minutes of each half.\"\n\n\r\n              TIP-INS\n\n\r\n              Raptors: F Otto Porter Jr. missed his 11th game with a dislocated toe on his left foot. Nurse said he expected some encouraging news from a specialist within a few days. ... F Precious Achiuwa (sprained right ankle) will probably play by the end of the month, Nurse said. \n\n\r\n              Magic: C Wendell Carter Jr. (right plantar fascia) missed his 11th straight game. ... G Jaylen Suggs did not play for the 13th time this season due to a sore ankle.\n\n\r\n              THANKS, BIG BRO\n\n\r\n              Asked to comment on Magic coach Jamahl Mosley's observation that he's one of the most competitive players he's seen, the 6-foot-10 Wagner gave the credit to his big brother, 6-11 Mo Wagner.\n\n\r\n              “It's probably from being a little brother and losing a lot of 1-on-1 games and all types of games on the playground,” Franz said. “I always hated losing so I guess it comes from that.”\n\n\r\n              Mo Wagner had 11 points and four rebounds Friday night in his fifth start.\n\n\r\n              UP NEXT\n\n\r\n              The teams play for the third time in nine days Sunday in Orlando.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994081.8453681
}