{
  "game_id": "0022400261",
  "espn_id": "401704827",
  "date": "Nov 21, 2024",
  "matchup": "TOR vs. MIN",
  "headline": "Barrett scores 31, Barnes adds 17 in return from injury, and Raptors beat Timberwolves 110-105",
  "body": "TORONTO -- — RJ Barrett scored 31 points, Scottie Barnes added 17 points in his return from injury, and the Toronto Raptors won back-to-back games for the first time this season by beating the Minnesota Timberwolves 110-105 on Thursday night.\n\n\r\n              Chris Boucher scored 22 points and Jakob Poeltl had 15 points and 12 rebounds for his fourth straight double-double as the Raptors beat Minnesota in Toronto for the 20th straight time.\n\n\r\n              Anthony Edwards scored 21 of his 26 points in the second half and Julius Randle added 23 for the Timberwolves. Edwards shot 2 for 5 in the first half but made 7 of 15 attempts in the second half.\n\n\r\n              Minnesota's Jaden McDaniels scored 22 points and Rudy Gobert had 13 points and 11 rebounds.\n\n\r\n              Minnesota has not won in Toronto since Jan. 21, 2004, when Sam Cassell, Kevin Garnett and Latrell Sprewell were the Wolves’ leading scorers in a 108-97 victory.\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota’s most recent road win over Toronto was Feb. 14, 2021, when the Raptors were playing in Tampa, Florida, because of border restrictions related to the COVID-19 pandemic.\n\n\r\n              Raptors: Barnes wore protective glasses in his return after missing the past 11 games because of a right orbital fracture. He shot 5 for 11 and had six assists in 27 minutes. \n\n\r\n              Key moment\r\n              Barnes scored six points as Toronto used a 13-1 run to turn a 95-92 deficit into a 105-96 lead with 2:33 left in the game. Boucher started the run with a 3 and Barrett capped it with an alley-oop dunk off Gradey Dick’s pass.\n\n\r\n              Key stat\r\n              The Raptors went 5 for 9 at the free-throw line in the first half but made 24 of 30 attempts in the second half.\n\n\r\n              Up next\r\n              Minnesota visits Boston on Sunday and Toronto begins a four-game road trip at Cleveland on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996990.109906
}