{
  "game_id": "0021900956",
  "espn_id": "401161598",
  "date": "Mar 08, 2020",
  "matchup": "TOR @ SAC",
  "headline": "Siakam, Lowry come up big to lead Raptors past Kings 118-113",
  "body": "SACRAMENTO, Calif. --  Raptors coach Nick Nurse made a risky call to keep Kyle Lowry in the game after the Toronto guard picked up his fifth foul 13 seconds into the fourth quarter.\n\nNurse's decision to get the ball to Pascal Siakam late was equally critical, a move that paid off well for the defending NBA champions and simultaneously dealt a big blow to Sacramento's playoff hopes.\n\nSiakam scored 11 of his 23 points in the final 2 1/2 minutes, Toronto got a big fourth quarter from Lowry and the Raptors held on to beat the Kings 118-113 on Sunday night.\n\n\"This is so good for us to be in these late games and these teams are playing awesome against us,\" Nurse said. \"It's great that we have to bring such a level of tenacity to match them. I'm good with them going either way as long as we're playing our butts off. That's part of the league.\"\n\nLowry scored 13 of his 30 points in the final quarter after picking up his fifth foul. He shot 5 of 7 in the fourth, including a go-ahead 3-pointer with 3:20 left.\n\n\"That's one thing where you don't want to let your teammates down, you don't want to let your coach down because he trusted you to be in that situation,\" Lowry said. \"I appreciate Nick for believing in me, believing I could play without fouling out.\"\n\nSiakam took over the scoring load late and helped the Raptors to their third straight win since a three-game skid.\n\nNorman Powell had 31 points, Serge Ibaka added 15 points and 10 rebounds, and OG Anunoby scored 12 for the Raptors. Marc Gasol had three points and two rebounds in 16 minutes off the bench after missing 15 games with a left hamstring injury.\n\nDe'Aaron Fox scored 28 points to pace the Kings. Alex Len and Kent Bazemore added 15 apiece off the bench.\n\nSacramento had won seven of nine since the All-Star break but dropped into a tie with New Orleans for ninth place in the West. The Kings and Pelicans are four games behind Memphis for the final playoff spot in the conference.\n\nThe teams traded the lead four times over the final four minutes and Toronto couldn't take control until Siakam's driving layup with 27.7 seconds remaining. After Fox missed a 3-pointer for Sacramento, Siakam was fouled and made two free throws.\n\n\"He's a guy we rely on to make big shots, big plays,\" Powell said. \"He's really playing within himself. He's not getting rattled or sped up by the defense. He's finding his space where he wants to shoot and he's taking his shots.\"\n\nAfter Richaun Holmes scored for the Kings, Anunoby and Powell combined for three free throws.\n\nThe Kings missed two desperation 3s in the final 15 seconds.\n\n\"There's a reason why they are a championship team,\" said Sacramento's Bogdan Bogdanovic, who had nine points on 4-of-10 shooting. \"The way they play, the way they affect the tempo. We couldn't find an open shot in the beginning. It was hard to get into a rhythm.\"\n\nSMART MOVE\n\nPrior to Siakam's pivotal layup, Lowry called a timeout while trying to inbound the ball, then convinced Nurse to change the play.\n\n\"I just didn't want to force nothing,\" Lowry said. \"That's why he had me taking the ball out, to make the right decision. I feel it was the right decision. We changed the play and (Siakam) got a layup.\"\n\nTIP-INS\n\nRaptors: Toronto has won six straight against Sacramento dating to 2016. . It was only the 15th time in his career that Gasol came off the bench. He started the previous 35 games he played in this season. . Powell took a half-court bounce pass from Siakam and threw down an emphatic, one-handed dunk against Sacramento's Harry Giles in the first quarter. Powell returned the favor a few moments later when he fed Siakam with an alley-oop lob for a dunk. . Fred VanVleet (left shoulder soreness) is expected back later this week.\n\nKings: Holmes had six points and three rebounds in his second game after missing 25 because of a shoulder injury. ... Fox picked up a technical foul for arguing with officials after getting called for a foul against Lowry in the first quarter. . Jabari Parker was a late scratch because of the stomach flu. . Len was fined $15,000 by the NBA for shoving Portland's CJ McCollum during Saturday's game.\n\nUP NEXT\n\nRaptors: Play the Jazz in Utah on Monday. Toronto has won three straight in the series.\n\nKings: Host the Pelicans on Wednesday. Sacramento has lost its last two home games against New Orleans, including a 117-115 defeat at Golden 1 Center in January.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995950.855959
}