{
  "game_id": "0021801001",
  "espn_id": "401071674",
  "date": "Mar 11, 2019",
  "matchup": "TOR @ CLE",
  "headline": "Sexton, Cavs beat Raptors 126-101; 2 ejected for fight",
  "body": "CLEVELAND --  Even with Kawhi Leonard back in the lineup, the best fight Toronto put up in Cleveland was when Serge Ibaka threw a punch at Marquese Chriss.\n\nIbaka and Chriss were ejected for fighting during the Cavaliers' 126-101 victory over the Raptors on Monday night.\n\nLeonard scored 25 points after sitting out Sunday's game, but the team with the league's second-best record trailed most of the way.\n\nCollin Sexton scored 28 points and Kevin Love had 16 points and 18 rebounds for Cleveland, which dominated the second half and seemed to gain momentum after the fight with a second left in the third quarter.\n\nIbaka went to the floor after he and Chriss were battling for position under Cleveland's basket as the Raptors attempted a full-court pass that sailed out of bounds.\n\nIbaka shoved Chriss from behind and grabbed near his neck before throwing a punch. Chriss responded with a punch before players from both teams separated the two. Ibaka immediately headed for the locker room and both players were kicked out after the officials conferred.\n\n\"I saw it out of the corner of my eye,\" Love said. \"It happened so fast. Everybody almost wants to run out there and check what's going on. It was broken up quick. That's usually how it goes.\"\n\nNeither player was available for comment following the game. A Raptors spokesman said Ibaka was reacting to something Chriss said to him after the Toronto player was knocked to the floor.\n\nCleveland held a 91-77 lead when the fight occurred and poured it on in the fourth quarter. Toronto coach Nick Nurse pulled his starters as the Cavaliers pulled away and the lead reached 27 points with just under a minute to play.\n\n\"That was a great win for us,\" Love said. \"Especially against a real good team at home. It was fun.\"\n\nCedi Osman scored 19 points and Ante Zizic had 17 for Cleveland, which placed six players in double figures.\n\nLeonard was 11 of 19 from the field, but the Raptors only led briefly in the first half.\n\n\"They did a great job, they played well, and they made open shots,\" Leonard said. \"That's pretty much the way the game played out.\"\n\nKyle Lowry scored 14 points for the Raptors. Toronto (48-20) trails Milwaukee by 2 1/2 games for the best record in the league.\n\nToronto rolled to a 125-104 win over the Heat without Leonard, tying a franchise record with 21 3-pointers and outscoring Miami 63-24 from beyond the arc.\n\nLeonard, averaging 27 points this season, hasn't appeared in more than two consecutive games since playing in five straight from Jan. 25 through Feb. 5.\n\nThe Raptors, showing signs of being tired in their third straight road game, struggled throughout the game. Toronto fell behind by 10 points and committed 11 turnovers leading to 13 points for the Cavaliers.\n\nCleveland coach Larry Drew said before the game Love, who hasn't played in back-to-back games since returning from foot surgery, will sit out Tuesday in Philadelphia.\n\nTIP-INS\n\nRaptors: G Fred Van Vleet (ligament tear in left thumb) missed his 11th straight game. ... G Patrick McCaw made his first start with the team Sunday at Miami with Leonard sidelined, scoring 10 points in 26 minutes. McCaw appeared in three games with the Cavaliers earlier this season.\n\nCavaliers: Cleveland is 5-4 since the All-Star break. ... F Larry Nance Jr. (bruised rib) was out after being injured Friday against the Heat. ... G Matthew Dellavedova (concussion) missed his second straight game.\n\nFIGHT ANALYSIS\n\nPlayers and coaches stepped in when Ibaka and Chriss squared off, but no one seemed to get a good view of the incident.\n\n\"I didn't see much of it, to be honest,\" Nurse said. \"Listen, it's always going to be concerning when something like that happens. We certainly don't want that in our game. We don't want to lose one of our guys.\"\n\nThe teams don't play again this season.\n\nTOUGH NIGHT\n\nNurse had a simple explanation for the loss that ended Toronto's three-game road trip that began with wins over New Orleans and Miami.\n\n\"It didn't seem like our energy was where theirs was,\" he said. \"Obviously, we're coming off a back-to-back and off a game where we played unbelievably well and we didn't handle the success that great.\"\n\nNurse said Lowry turned an ankle late in the game, but the injury isn't serious.\n\nUP NEXT\n\nRaptors: Host the Lakers on Thursday.\n\nCavaliers: Visit Philadelphia on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994095.362847
}