{
  "game_id": "0022000164",
  "espn_id": "401267324",
  "date": "Jan 13, 2021",
  "matchup": "CHA vs. DAL",
  "headline": "Doncic has 34 points, Mavs beat Hornets in Porzingis' return",
  "body": "CHARLOTTE, N.C. -- — The dangerous duo is back in Dallas.\n\n\r\n                    Luka Doncic had 34 points, 13 rebounds, nine assists and a career-high four blocks, Kristaps Porzingis scored 16 points in his return from a knee injury and the Mavericks beat the Charlotte Hornets 104-93 on Wednesday night.\n\n\r\n                    “When both of those guys are out there at the same time it’s a game changer for us,” said Mavericks coach Rick Carlisle, who became the 16th coach in NBA history to reach 800 career victories. “They are two guys who can play on the inside and space the court on the outside.\"\n\n\r\n                    Tim Hardaway Jr. added 18 points for the Mavericks. They've won four straight after opening 2-4.\n\n\r\n                    Terry Rozier had 18 points to lead the Hornets. They shot 38% from the field and had their four-game winning streak snapped.\n\n\r\n                    Porzingis played for the first time since having knee surgery in October.\n\n\r\n                    The 7-foot-3 Latvian impacted the game at both ends with his size, easily able to shoot over smaller defenders while altering shots in the paint against the smaller Hornets. Charlotte attempted to counter at times with a small ball lineup, but struggled all night with Dallas' height and length.\n\n\r\n                    “That’s the first time we’ve seen this lineup and they’re long, they’re physical,\" Hornets coach James Borrego said. “Those are two special players that can play at a high level. Give Doncic credit he played a great game tonight. Porzingis’ length and his size obviously was a factor out there.”\n\n\r\n                    Porzingis played 21 minutes, finishing 6 of 16 from the floor and 4 of 9 from beyond the 3-point arc. He had four rebounds.\n\n\r\n                    Porzingis said he felt good on the floor, but admitted he might have pressed himself into taking some bad shots because he was on a minutes restriction imposed by Carlisle.\n\n\r\n                    “I was trying to do as much as I could in the minutes that I had,” Porzingis said. “And sometimes you don't make the best decisions when you really want to be aggressive. But it's OK. It's a part of it. I wanted to be aggressive when I was out there.”\n\n\r\n                    “He’s an amazing player,\" Doncic said. “He has to get back into rhythm, but I think for the first game he played amazing.”\n\n\r\n                    Doncic appeared to grow frustrated with the lack of calls going his way in the second half, but used that as motivation. After a non-call, Doncic hustled back to block Gordon Hayward's shot, corralled the loose ball and drove the length of the floor where he lofted a one-handed alley-oop pass to Josh Green for the lay-in.\n\n\r\n                    Doncic got testy at the end of the third quarter after Charlotte's Caleb Martin said something to him. Doncic began walking toward Martin, shouting something back as officials assessed Martin a technical foul.\n\n\r\n                    800 WINS\n\n\r\n                    Carlisle said looking back on 800 career wins he's been fortunate to have had “great ownership” and “exceptional players” during his time on the bench. \"It's just a privilege to be one of 30 guys coaching in this great league,\" Carlisle said.\n\n\r\n                    TIP INS\n\n\r\n                    Mavericks: Jalen Brunson, Dorian Finney-Smith, Maxi Kleber, Dwight Powell and Josh Richardson did not play due to the NBA health and safety protocols.\n\n\r\n                    Hornets: Hornets coach James Borrego said Hayward left the game in the fourth quarter because of a strained hip. After averaging 29.2 points during the four-game winning streak, Hayward was held to 16 points on 5-of-15 shooting by the Mavericks. ... P.J. Washington had 16 points, 10 rebounds and six assists.\n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: At Milwaukee on Friday night.\n\n\r\n                    Hornets: Vs. Toronto in Tampa, Florida, on Thursday and Saturday nights.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997043.6038
}