{
  "game_id": "0021700347",
  "espn_id": "400975098",
  "date": "Dec 04, 2017",
  "matchup": "DAL vs. DEN",
  "headline": "Mavericks lead wire-to-wire to beat Nuggets 122-105",
  "body": "DALLAS --  After a tough start to the season, the Dallas Mavericks are starting to find their identity with consecutive wire-to-wire wins.\n\nHarrison Barnes scored 22 points and Dennis Smith Jr. added 20 to lead six Mavericks in double figures as Dallas beat the short-handed Denver Nuggets 122-105 Monday night.\n\nThe Mavericks never trailed once again after beating the Clippers by 26 on Saturday. Dallas had its highest scoring game of the season and has won five of eight since starting 2-14.\n\n\"Our identity just happens to be very gritty on defense and have each other's backs, and then ball security on offense,\" Smith said. \"If we do both of those things, we're gonna win a lot of games.\"\n\nDallas did both on Monday, building a 25-point, first-half lead as they held Denver to 35 percent shooting before the break. And the Mavs had only seven turnovers.\n\nWill Barton led Denver with 23 points, Jamal Murray added 22 and Gary Harris had 21.\n\nDenver played without two-thirds of its starting frontcourt as Paul Millsap (left wrist injury) and Nikola Jokic (sprained left ankle) remained out.\n\nThe Nuggets started the second half making their first six shots and got within 88-80 on Barton's 3 with 2:13 left in the third quarter. It was the first time Denver had been within single digits since trailing 16-8 early on.\n\n\"I think we had enough gas in the tank to come back, but the first quarter was such a big deficit on the road, it's going to be very tough,\" Murray said.\n\nBarnes hit a long jumper to restore a 10-point lead, and Dallas maintained a double-digit lead throughout the fourth quarter.\n\n\"We shot it well. We moved it well. We had low turnovers,\" coach Rick Carlisle said. \"There were a lot of good things.\"\n\nSOLDIERING ON\n\nDallas held its annual Seats for Soldiers Night, where the team's season-ticket holders provide their courtside seats to more than 100 wounded U.S. service members. Former president and first lady George W. and Laura Bush were also in attendance. The Mavericks improved to 11-2 in these games since starting the tradition in 2004.\n\n\"Coming out of halftime I told some of them that I personally appreciate everything that they do,\" Smith said. \"Their sacrifice -- some of the guys and women were missing limbs -- they made sacrifices a lot of people wouldn't make. That was a little added motivation for everybody tonight.\"\n\nROAD WOES\n\nDenver fell to 3-8 on the road against 10-2 at home as they began a six-game road trip.\n\n\"They hit us first and we hit back too late,\" Murray said. \"We can't afford that on the road.\"\n\nTIP-INS\n\nNuggets: Kenneth Faried had 13 points and 11 rebounds, his fifth-straight double-figure scoring game while starting in place of Millsap. ... The Nuggets got starting forward Wilson Chandler back, but Chandler scored just four points in 27 minutes after missing the last three games with lower back pain.\n\nMavericks: Yogi Ferrell scored 12 of his 16 points in the second half. Other Mavs scoring in double figures: Wesley Matthews (15), Devin Harris (14) and Dwight Powell (11).\n\nUP NEXT\n\nNuggets: At New Orleans on Wednesday night. Denver scored an NBA season-high 146 in beating the Pelicans on Nov. 17.\n\nMavericks: At Boston on Wednesday night to start a three-game trip. The Celtics beat the Mavs in overtime on Nov. 20.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993966.364821
}