{
  "game_id": "0022400464",
  "espn_id": "401705030",
  "date": "Jan 02, 2025",
  "matchup": "MIN vs. BOS",
  "headline": "Jayson Tatum's big night lifts short-handed Celtics past Timberwolves 118-115",
  "body": "MINNEAPOLIS -- — Jayson Tatum had 33 points, nine assists and eight rebounds, and the Boston Celtics beat the Minnesota Timberwolves 118-115 on Thursday night.\n\n\r\n              Derrick White scored 26 points for Boston, while Sam Hauser — filling in for the injured Jaylen Brown — hit five 3-pointers and scored 15 points.\n\n\r\n              Julius Randle led Minnesota with 27 points, eight rebounds and seven assists. Naz Reid added 20 points off the bench, while Jaden McDaniels had 19 points and eight boards.\n\n\r\n              The Timberwolves trailed by eight with two minutes to play but they had a chance to send it into overtime. However, Anthony Edwards' 3-pointer fell short at the buzzer.\n\n\r\n              Takeaways\r\n              Celtics: After winning 16 of its first 19 games, Boston had a ho-hum 8-6 record in December. A victory in Minnesota was a great way to kick off a four-game road trip to start 2025.\n\n\r\n              Timberwolves: Minnesota began the week with a chance to test itself against one of the heavy hitters in each conference. After a 113-105 loss at Oklahoma City on Tuesday, the Timberwolves came up just short against the Celtics.\n\n\r\n              Key moment\r\n              With the Celtics leading 46-45 midway through the second quarter, Tatum hit the second of two free throws, then drained 3-pointers on Boston's next two possessions. That was part of a 16-6 run to close the second quarter, sending the Celtics into the locker room with a 62-51 lead.\n\n\r\n              Key stat\r\n              Boston committed just four turnovers while the Timberwolves turned it over 16 times on the night.\n\n\r\n              Up next\r\n              The Celtics visit Houston on Friday while the Timberwolves face the Pistons in Detroit on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998095.288404
}