{
  "game_id": "0022400854",
  "espn_id": "401705420",
  "date": "Feb 28, 2025",
  "matchup": "IND @ MIA",
  "headline": "Mitchell hits big 3, Herro scores 29 and Heat dig deep to top Pacers 125-120",
  "body": "MIAMI -- — Davion Mitchell's 3-pointer broke a tie with 43.8 seconds left, Tyler Herro scored 29 points and the Miami Heat topped the Indiana Pacers 125-120 on Friday night.\n\n\r\n              Duncan Robinson scored 20 for Miami, which shot 57% — and has shot 58% in its last two games, tying the seventh-best two-game span in team history. Bam Adebayo scored 18 for Miami.\n\n\r\n              Pascal Siakam scored 36 for Indiana, while Myles Turner added 22 and Tyrese Haliburton had 19 points and 10 assists. The Pacers made 12 of their first 15 3-pointers, then went 9 for 24 from deep the rest of the way.\n\n\r\n              Takeaways\r\n              Pacers: Indiana led by as many as 28 in an easy win at Miami on Jan. 2, and Pacers coach Rick Carlisle knew Friday would be different. “They’ve got a history of doing things hard here and embracing hard times and difficulty. ... This game will be nothing like our last game here. I can promise anybody that,\" Carlisle said.\n\n\r\n              Heat: Andrew Wiggins missed the game with a sprained right ankle, and Jaime Jaquez Jr. — who started in Wiggins' place — left with 10:34 remaining in the third quarter after going down while handling the ball near midcourt. Jaquez was holding his knee, but the Heat said he turned his right ankle.\n\n\r\n              Key moment\r\n              The Heat went on a 13-0 run spanning nearly four minutes, the final 1:03 of the third quarter and the first 2:54 of the fourth, to turn a one-point deficit into a 104-92 lead.\n\n\r\n              Key stat\r\n              Indiana led 69-68 at the half. In 37 years of Heat basketball, including playoffs, this was only the fifth game where both teams had at least 68 points by intermission.\n\n\r\n              Up next\r\n              Indiana goes home to face Chicago on Sunday. Miami hosts New York on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998128.247233
}