{
  "game_id": "0021600767",
  "espn_id": "400900172",
  "date": "Feb 05, 2017",
  "matchup": "OKC vs. POR",
  "headline": "Westbrook powers Thunder past Blazers 105-99",
  "body": "OKLAHOMA CITY --  Another close game in the fourth quarter, another outstanding performance by Russell Westbrook.\n\nWestbrook scored 19 of his 42 points in the fourth quarter, leading the Oklahoma City Thunder to a 105-99 victory over the Portland Trail Blazers on Sunday.\n\nWestbrook also had eight assists and four rebounds in his eighth 40-point performance of the season. Victor Oladipo added 24 points and 13 boards, helping Oklahoma City (30-22) move within a half-game of idle Memphis for sixth in the Western Conference.\n\n\"It was a great collective team win,\" said Oladipo, who also had three assists, two steals and two blocked shots.  \"We did a great job defensively, especially in the second half. We just got to build on it.\"\n\nDamian Lillard had 29 points and seven rebounds for Portland (22-30), which has dropped three of four. C.J. McCollum added 19 points and eight boards.\n\n\"It's frustrating,\" Lillard said. \"I do think we competed. We were in position to win the game, once again. Like many games we have had this season, we had opportunities that we didn't always take advantage of.\"\n\nWestbrook punctuated his big day with a 3-pointer with 1:18 remaining, lifting Oklahoma City to a 100-93 lead. He capped it off by hitting five free throws in the final minute as the crowd chanted \"MVP! MVP!\"\n\n\"I hadn't made a 3 all night, that was a big one, especially to close the game out,\" Westbrook said.  \"I got the shot I wanted. Defensively, I thought we did a great job. I think that's the most important part, getting stops in the fourth quarter when we needed to, getting stops on demand.\"\n\nAfter scoring 19 points in the fourth quarter to spark a 114-102 comeback victory over Memphis on Friday, Westbrook again rallied the Thunder when they needed him most, scoring 31 points in the second half.\n\n\"I was really, really happy and really pleased with our guys' effort tonight,\" Oklahoma City coach Billy Donovan said. \"Obviously, Russell was spectacular.\"\n\nOklahoma City opened the final quarter with a 10-2 run that included back-to-back 3-pointers from Oladipo, but the Trail Blazers rallied to tie it at 85 when Mason Plumlee sank a free throw with 6:33 remaining.\n\nLed by six points from Westbrook, the Thunder then scored the next eight points to open up a 93-85 lead with 4:36 to go.\n\n\"They outplayed us in the fourth quarter,\" Portland coach Terry Stotts said. \"That's the bottom line. It came down to that. We didn't do the things in the fourth quarter that you have to do -- loose balls, execute on offense. And, Westbrook played great.\"\n\nTIP-INS\n\nTrail Blazers: Plumlee had 13 points, and Allen Crabbe finished with 10. ... Portland outscored Oklahoma City 36-22 in the second quarter for a 52-46 lead at the break.\n\nThunder: Andre Roberson scored 14 points on 6-for-8 shooting. He also had 11 rebounds and three steals. ... The Thunder went 1 for 13 from 3-point range through the first three quarters, and then hit 3 of 5 attempts from long range in the fourth. . The Thunder had 56 boards to the Trail Blazers' 44, marking the 12th time this year they've outrebounded an opponent by 10 or more.  They are 11-1 in those games.\n\nQUOTABLE\n\n\"My opinion with Russell in those situations is when he gets into mid-range space and he can create that space, he's a terrific shooter,\" Donovan said of Westbrook. \"I thought he did a really good job of making his decisions of how to get his man off balance and then obviously creating space to make those shots. He had room up there and he made a lot of great plays.  The thing I really liked that he did was he kind of mixed it up, keeping the defense very, very honest.\"\n\nUP NEXT\n\nTrail Blazers: Return to Dallas, where they just lost to the Mavericks 108-104 on Friday, for the final of four regular-season matchups on Tuesday.\n\nThunder: Visit the Pacers on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995277.8748522
}