{
  "game_id": "0022400879",
  "espn_id": "401705445",
  "date": "Mar 03, 2025",
  "matchup": "OKC vs. HOU",
  "headline": "Gilgeous-Alexander scores 51 as Thunder top Rockets 137-128 for 50th win",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 51 points and the Oklahoma City Thunder defeated the Houston Rockets 137-128 on Monday night for their 50th win of the season.\n\n\r\n              Gilgeous-Alexander reached 50 points for the fourth time this season, all in the past seven weeks. The NBA’s scoring leader finished with at least 40 for the ninth time in 2024-25. He made 18 of 30 field goals, went 5 of 9 on 3-pointers and hit all 10 of his free throws. \n\n\r\n              Jalen Williams added 24 points for the Thunder (50-11).\n\n\r\n              Cam Whitmore matched career highs with 27 points and 11 rebounds, and Reed Sheppard added a career-best 25 points for the Rockets.\n\n\r\n              Houston was without injured Alperen Sengun (lower back soreness), Amen Thompson (right shoulder), Dillon Brooks (bruised right knee), Fred VanVleet (strained right ankle) and Tari Eason (lower left leg).\n\n\r\n              Houston's largest lead was nine points early in the second quarter, but the Thunder rallied to lead 63-62 at halftime behind 28 points from Gilgeous-Alexander.\n\n\r\n              Oklahoma City took charge in the third. Gilgeous-Alexander was up to 45 points by the end of the period, and the Thunder led 102-89 heading into the fourth.\n\n\r\n              Houston made a final push, closing the gap to six before the Thunder regained control. Lu Dort made back-to-back 3-pointers 29 seconds apart, extending Oklahoma City's lead to 120-106.\n\n\r\n              Gilgeous-Alexander reached 50 points on a putback with just under three minutes left to give Oklahoma City a 132-120 advantage.\n\n\r\n              Takeaways\r\n              Rockets: Houston played fast but didn't have the manpower to run with the Thunder, one of the league's deepest teams.\n\n\r\n              Thunder: Oklahoma City was aggressive, and it led to the Thunder making 24 of 27 free throws.\n\n\r\n              Key moment\r\n              Dort stole the ball, leading to a fast-break dunk from Gilgeous-Alexander that gave Oklahoma City a 128-117 lead with just under four minutes remaining.\n\n\r\n              Key stat\r\n              Gilgeous-Alexander scored 20 points in the first quarter.\n\n\r\n              Up next\r\n              The Rockets visit Indiana on Tuesday. The Thunder visit Memphis on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997670.631287
}