{
  "game_id": "0021500878",
  "espn_id": "400828765",
  "date": "Feb 28, 2016",
  "matchup": "CHA @ ATL",
  "headline": "Bazemore, Horford propel Hawks past Hornets",
  "body": "ATLANTA --  The Atlanta Hawks were hoping to do a lot better than a 2/3 record on their home stand.\n\nAl Horford is grateful they at least salvaged the last two games.\n\n\"In my eyes, this was another must win because if you think about it, Charlotte is right behind us (in the standings),\" he said. \"They're in our division. They've been playing well.\"\n\nHorford had 13 points and tied a season high with 16 rebounds, Kent Bazemore added 14 points and the Atlanta Hawks beat the Charlotte Hornets 87-76 on Sunday.\n\nMarvin Williams finished with 16 points and Jeremy Lin scored 15 for Charlotte, which trailed the entire game. The Hornets were trying to be the first Charlotte team since 1996-97 to win eight games in February.\n\nThey pulled within two with 7 minutes left but couldn't rally after scoring a season-worst nine points in the first quarter.\n\nThe third-place Hornets dropped two games behind Atlanta in the Southeast Division.\n\n\"If we leave here being happy because we had a 3-2 road trip, we'll never be that good of a team,\" Hornets coach Steve Clifford said. \"If we leave here disappointed because we laid an egg when with a chance to go 4-1, then we have a chance to move forward.\"\n\nAtlanta led by 10 in the first on Bazemore's uncontested dunk. With his team down by 12, Clifford called timeout at the 3:59 mark of the first, but Charlotte missed its next six shots and was 1 for 19 from the field before Lin hit a 3.\n\nKemba Walker, who was leading the Eastern Conference with 24.1 scoring average this month, finished with nine points on 3 for 15 shooting.\n\n\"We just tried to make it tough on him,\" Jeff Teague said. \"He's a good player. We tried to make him see multiple bodies.\"\n\nPaul Millsap had 13 points, Tim Hardaway Jr. 11 and Teague 10 for the Hawks.\n\nAtlanta took its first 20-point lead on Mike Scott's layup early in the second and was up a game-high 24 on Millsap's layup at the 7:53 mark.\n\nCharlotte pulled within five early in the third, and the Hornets had a last surge in the fourth.\n\nLin scored five unanswered points, Frank Kaminsky hit a floater on the baseline, and Jeremy Lamb scored to make it 70-68 with 7:22 remaining, but Charlotte never got any closer.\n\nHorford hit a straightaway 3 and a layup to put the Hawks up 13 with 1:53 remaining.\n\n\"We made plays, but obviously they're a very good team,\" Williams said. \"They never got rattled when we went on our run.\"\n\nWith Atlanta about to begin a five-game road trip against defending NBA champion Golden State, Horford believes his team showed it could compete with the Warriors despite losing by 10 last week.\n\n\"It's going to be a big challenge,\" he said, \"but we have a good opportunity to do well.\"\n\nTIP-INS\n\nHornets: Charlotte teams have lost 16 of their last 18 at Philips Arena. ... Walker began the game at a career-best 37.3 percent on 3s but finished 0 for 7 beyond the arc. ... The team went just 7 for 32 on 3s. ... The Hornets finished with their second-lowest point total of the season.\n\nHawks: Horford had his 200th career double-double. ... Hardaway beat the first-quarter buzzer with a 41-footer inside the half-court line to put Atlanta up 25-9. ... The last time Atlanta allowed single digits in a quarter was Nov. 12, 2014, against Utah in the fourth.\n\nUP NEXT\n\nHornets: Host Phoenix on Tuesday.\n\nHawks: Visit Golden State on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994365.563961
}