{
  "game_id": "0021500729",
  "espn_id": "400828616",
  "date": "Feb 01, 2016",
  "matchup": "MIL @ SAC",
  "headline": "Gay scores 32 to lead Kings over Bucks, 111-104",
  "body": "SACRAMENTO, Calif. -- For the second time this season with teammate DeMarcus Cousins watching from the bench in street clothes, Rudy Gay tormented the Milwaukee Bucks.\nGay had 32 points, nine rebounds and six assists as the Sacramento Kings snapped a five-game losing streak by defeating the Bucks 111-104 on Monday night.\nSacramento won minus Cousins, the All-Star center who sprained his left ankle in Saturday's loss at Memphis. The Kings are 2-7 this season without him, with both wins coming against the Bucks.\nGay scored 36 points in a Nov. 25 victory at Milwaukee. He was just as effective in the second meeting, creating shots off the dribble, making jumpers and facilitating at the offensive end when double teams arrived.\n\nGay hit 13 of 20 shots and went 5-of-6 at the free throw line in his third game this season with at least 30 points. He scored nine in the decisive fourth quarter when the Kings had a 37-30 edge.\n\"DeMarcus being out had a lot to do with it. Obviously, he's been carrying us for the most part of the season,\" Gay said. \"When guys go down -- not just him, Ben [McLemore] is out -- guys have to step up.\"\nAlso stepping up was teammate Marco Belinelli, who has been in a prolonged shooting slump in his first season with Sacramento. The Kings took the lead for good early in the final period on two free throws by Belinelli, who made two 3-pointers and scored 10 of his 18 points in the fourth.\nBelinelli finished 5-of-15 overall but was encouraged by his effort with the game on the line.\n\"I'm going to keep shooting. That's what I do,\" said Belinelli, who entered shooting 38.4 percent from the field this season, the worst mark of his nine-year career. \"I'm trying to stay positive. I'm a shooter and when I'm on the court I'm trying to be aggressive.\"\nRajon Rondo made all four of his 3-point attempts and had 19 points and seven assists for the Kings. Darren Collison scored 14 and Omri Casspi 13.\nEven without Cousins, their leading rebounder, Sacramento held a 53-37 advantage on the glass.\nGreg Monroe had 24 points and 12 rebounds for the Bucks, who have dropped three straight and five of six. Michael Carter-Williams added 18 points and a season-high 13 assists. Giannis Antetokounmpo scored 17, Jabari Parker 16 and Khris Middleton 14.\nBut they couldn't stop Gay.\n\"You know he's definitely going to be more aggressive with Cousins out,\" Monroe said. \"We just have to do a better job containing him because he was pretty aggressive the whole game. When he's scoring and other guys are making 3s at the rate they were, it's going to be tough for us to win.\"\nA jumper by Gay and Belinelli's two free throws gave Sacramento a 91-84 lead midway through the fourth. A 3-pointer by Casspi and another by Rondo put the Kings ahead 102-91 with 2:43 left.\nSacramento shot 9 of 26 on 3s, but was 4 for 8 in the fourth quarter.\n\"Down the stretch we gave up 3s. I think at one point they were 6 for 23, and then they make three 3s in a row,\" Bucks coach Jason Kidd said. \"We have to get better at switching and understand who's shooting the ball. Understand Belinelli is going to fire it and he did all night.\"\nGay and Rondo both had eight points in the third quarter when the Kings outscored the Bucks 21-18 to tie the game at 74 heading into the fourth.\nBIG MINUTES\nShort-handed because of injuries to key reserves, Kidd used essentially an eight-man rotation. Even though Sacramento was missing two starters, the Kings' bench outscored Milwaukee's reserves 31-15.\nEvery Bucks starter played 33 or more minutes and perhaps that was a factor in Sacramento pulling away in the fourth quarter.\n\"We're not healthy. There are no excuses at this level, and you have to go with the guys you believe in off the bench that can help us,\" Kidd said. \"We've got to get more guys involved off the bench that can help the starters. The starters are playing a lot of minutes.\"\nTIP-INS\nBucks: Carter-Williams nearly matched his scoring average in the first quarter when he had 11 points and seven assists. ... O.J. Mayo has missed the last nine games with a hamstring injury. ... Monroe has scored 20 or more points in a career-high six straight games.\nKings: McLemore (sprained right wrist) had his consecutive games streak snapped at 211, which was the second-longest in the NBA behind Tristan Thompson (335). McLemore had never missed a game in two-plus seasons. ... The Kings played their 17th different starting lineup this season. ... Sacramento coach George Karl had 205 regular-season victories in five seasons as coach of the Bucks.\nUP NEXT\nBucks: At Portland on Tuesday.\nKings: Host Chicago on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994043.5228622
}