{
  "game_id": "0022400277",
  "espn_id": "401704843",
  "date": "Nov 25, 2024",
  "matchup": "CHA vs. ORL",
  "headline": "Franz Wagner helps Magic overcome 44 points by LaMelo Ball to beat Hornets 95-84",
  "body": "CHARLOTTE, N.C. -- — Franz Wagner scored 13 of his 21 points in the fourth quarter, and the Orlando Magic withstood a 44-point performance by the Hornets' LaMelo Ball to beat short-handed Charlotte 95-84 on Monday night.\n\n\r\n              Moritz Wagner and Cole Anthony each had 16 points and eight rebounds off the bench, and Jonathan Isaac knocked down three fourth-quarter corner 3s to finish with 11 points for the Magic.\n\n\r\n              Ball, coming off a career-high 50-point performance against the Milwaukee Bucks on Saturday night, also had nine rebounds and seven assists. Brandon Miller added 20 points and 10 rebounds for the Hornets, who had their four-game home win streak snapped.\n\n\r\n              Ball and Miller also combined for 13 of the Hornets' 27 turnovers. Those giveaways led to 33 Orlando points, and the rest of Charlotte's players combined for just 20 points.\n\n\r\n              Orlando shot just 39% from the field. But Charlotte, missing several players, was only slightly better at 41% and looked out of sync on offense most of the night.\n\n\r\n              Takeaways\r\n              Magic: Orlando got clobbered on the glass 52-39 against a Charlotte team without its top two centers. Guard Gary Harris suffered a hamstring injury in the first quarter and did not return.\n\n\r\n              Hornets: With Mark Williams, Nick Richards, Grant Williams and Tre Mann out, Ball and Miller had to play extended minutes. Coach Charles Lee went deep into his bench by playing rookie K.J. Simpson and Nick Smith Jr., which impacted chemistry on the floor.\n\n\r\n              Key moment\r\n              Franz Wanger and Isaac made back-to-back 3-pointers early in the fourth quarter to put the Magic ahead 69-64 as Orlando seized control. Wagner then hit another 3 with 1:33 left to put the Magic up by 11.\n\n\r\n              Key stat\r\n              Orlando's bench outscored Charlotte's 53-15.\n\n\r\n              Up next\r\n              The Magic host Chicago and the Hornets host Miami on Wednesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997457.522225
}