{
  "game_id": "0021600147",
  "espn_id": "400899597",
  "date": "Nov 14, 2016",
  "matchup": "OKC @ DET",
  "headline": "Harris leads Pistons past Thunder 104-88",
  "body": "AUBURN HILLS, Mich. --  Right now, Aron Baynes is probably best known for his samurai-style haircut.\n\nIf Andre Drummond misses much more time, Baynes could become known for his rugged play.\n\nWith Drummond sidelined by a sprained ankle, Baynes had 20 points and eight rebounds to help the Detroit Pistons beat the Oklahoma City Thunder 104-88 on Monday night.\n\n\"This was because of everyone else,\" Baynes said. \"They got me the ball in great position, and all I had to do is finish. They were drawing the defense and I was left with the easy part.\"\n\nBaynes came within a point of his career high and played tough defense on Steven Adams, who had just four points in 29 minutes.\n\n\"As the president of the franchise, I probably shouldn't promote my own players,\" Pistons coach Stan Van Gundy said. \"But Aron is a starting center in the NBA. The only reason people don't know that is because we've got an All-Star ahead of him.\"\n\nThe Pistons (6-5) improved to 5-0 at home despite being without Drummond and Reggie Jackson, who hasn't played this season due to knee tendinitis.\n\n\"Our defense at home has been great,\" Van Gundy said. \"I'm not quite sure why we haven't been able to duplicate that on the road yet, but we're locked in at home.\"\n\nRussell Westbrook had 33 points, 15 rebounds and eight assists for Oklahoma City (6-5), which has dropped four in a row. Victor Oladipo finished with nine points, but he was the only other starter to score more than four.\n\n\"I'm not worried about our offense -- that's fine,\" Westbrook said. \"It is our defense. We've got to defend at a high level, and we're not doing that.\"\n\nAndre Roberson, who finished with four points in 29 minutes, said the Thunder's defensive struggles are being amplified by their inability to hit shots.\n\n\"This is a humbling moment for us,\" he said. \"We've got to find a way to get past the lack of jump shots going in.\"\n\nKentavious Caldwell-Pope added 17 points for Detroit.\n\nThe Pistons used their post players to build a 59-47 halftime lead despite Westbrook's 25 points. Oklahoma City missed nine of 10 3-point attempts in the half, and Oladipo went 1 for 7 from the floor. Harris and Baynes each scored 13 points.\n\nDetroit led by as many as 19 in the third, but its reserves didn't have as much success as they had in the first half. The Thunder finished the quarter with a 13-2 run to trail 78-68.\n\nDespite Westbrook's best efforts, the Thunder couldn't put together a serious run down the stretch. On several occasions, he was able to pull defenders toward him and find an open teammate, only for them to badly miss the shot.\n\nTIP-INS\n\nThunder: Westbrook scored Oklahoma City's last 14 points in the first half. ... Jerami Grant and Enes Kanter combined to hit nine of 16 shots in the first three quarters, helping keep Oklahoma City in the game. ... Westbrook picked up a technical foul in the first half for an accidental low blow against Caldwell-Pope.\n\nPistons: Detroit is the last team in the NBA to be undefeated at home. ... With Drummond sidelined, the Pistons only grabbed one offensive rebound in the first half. ... Baynes got hit on his protective mask by Westbrook late in the fourth, and needed medical attention to stop the bleeding from his previously broken nose. \"Tonight was my last night with the mask, and it was good to have it on,\" he said.\n\nJUST TOO LATE\n\nWestbrook almost had 28 first-half points, but a replay review showed his 3-pointer at the halftime buzzer was still in his hand when time expired.\n\nBACK ON THE ROAD\n\nAfter a four-game road trip, the Pistons were only making a brief stop at home. They play their next two games on the road before coming back to the Palace on Saturday.\n\n\"I thought this was an outstanding homestand, and I can't wait to get back on the road,\" Van Gundy joked.\n\nUP NEXT\n\nThunder: Return home to host the Houston Rockets on Wednesday.\n\nPistons: Travel to Madison Square Garden to play the Knicks on Wednesday. Detroit beat the Knicks 102-89 on Nov. 1 behind 25 points from Harris. Carmelo Anthony led New York with 24 points.",
  "source": "espn_api",
  "crawled_at": 1764995330.053092
}