{
  "game_id": "0021801017",
  "espn_id": "401071690",
  "date": "Mar 13, 2019",
  "matchup": "OKC vs. BKN",
  "headline": "Westbrook's triple-double leads Thunder past Nets",
  "body": "OKLAHOMA CITY --  Once Russell Westbrook figured out which of his many skills to focus on, everything changed.\n\nOklahoma City's point guard had 10 of his 11 assists in the second half and posted a triple-double to help the Thunder beat the Brooklyn Nets 108-96 on Wednesday night.\n\nWestbrook scored 31 points in his 26th triple-double of the season, but it was the passing that made the difference for the league's assist leader.\n\n\"I just tried to stay in attack mode and find ways to continue to get my teammates -- I thought in the first half, I did a bad job in the first half of finding my guys,\" he said. \"In the second half, I made an adjustment.\"\n\nWestbrook also had 12 rebounds for the 130th triple-double of his career.\n\nPaul George had 25 points and nine rebounds and Jerami Grant added 15 points for the Thunder, who shot 49 percent in the second half. Oklahoma City has won three of four as it battles to secure home-court advantage in the first round of the playoffs.\n\nSpencer Dinwiddie scored 25 points and D'Angelo Russell added 14 points and seven assists for the Nets, who saw their four-game win streak snapped.\n\n\"I think against a team like this, you've got to be close to perfect to beat them on the road here,\" Nets coach Kenny Atkinson said. \"We weren't at that level.\"\n\nThe Nets were up by 17 at one point in the first half and led 52-42 at halftime behind 11 points from Dinwiddie. Westbrook scored 17 points in the first half to keep the Thunder in the game, but Oklahoma City shot just 35.6 percent from the field before the break.\n\nOklahoma City quickly eliminated Brooklyn's lead in the second half. The Thunder scored 20 points in the first 3:41 of the third quarter to take the lead, and they took an 80-78 edge into the fourth.\n\nOklahoma City dominated the fourth behind Westbrook's all-around play. He hit a 3-pointer after a scramble to put the Thunder ahead 100-87 with 4:51 to go. He had seven points, five rebounds and five assists in the final period.\n\n\"Russ creates opportunities,\" George said. \"He just made the game easy for everybody else around him. That's just Russ being in his element.\"\n\nTIP-INS\n\nNets: Opened the game with a 9-0 run. ... G Shabazz Napier sat out with right hamstring tightness. ... Shot 6 for 21 in the fourth quarter. ... Ed Davis had 11 rebounds.\n\nThunder: George scored 13 points in the third quarter. ... F Markieff Morris sat out with neck soreness. ... C Steven Adams scored 13 points. ... Outrebounded the Nets 51-43.\n\nHE SAID IT\n\nRussell, on Oklahoma City's defense: \"Give them a lot of credit defensively. They made it tough for us all night. They were physical all night.\"\n\nBOUNCING BACK\n\nGeorge, the league's No. 2 scorer, had averaged just 14.5 points in his previous two games on 7 for 24 shooting. He made 9 of 18 against the Nets.\n\nHe's been fighting through a right shoulder injury.\n\n\"It's not going to stop me from trying to help the team win and doing whatever I can,\" he said. \"My legs are perfectly fine. The shooting part -- it is what it is. I'll get through it. The trainers here will get me through it.\"\n\nWESTBROOK'S 3s\n\nWestbrook has struggled from 3-point range for most of the season, but he has made 18 of 39 in his past five games (46.2 percent). He made four of eight against the Nets to increase his season percentage to 28.9 percent.\n\nUP NEXT\n\nThe Nets play at the Utah Jazz on Saturday.\n\nThe Thunder play at the Indiana Pacers on Thursday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994556.758543
}