{
  "game_id": "0021600145",
  "espn_id": "400899595",
  "date": "Nov 14, 2016",
  "matchup": "ORL @ IND",
  "headline": "Pacers top Vogel, Magic 88-69",
  "body": "INDIANAPOLIS --  About 90 minutes before Monday night's game, Pacers coach Nate McMillan wasn't sure if Paul George was going to suit up.\n\nMagic coach Frank Vogel knew better.\n\n\"I'm expecting him to play,\" Vogel said with a grin.\n\nGeorge scored 13 points in his return from a sprained ankle, and the Pacers spoiled Vogel's return to Indiana with an 88-69 victory Monday night.\n\nVogel coached the Pacers for 5 1/2 seasons before he was let go in May. He was quickly scooped up by Orlando, and it looks as if he has plenty of work to do with the Magic.\n\nHe remains popular in Indiana, and he was cheered when he was introduced before the game.\n\n\"I love Frank,\" said Pacers reserve C.J. Miles, who made four 3-pointers and scored 16 points. \"Frank's one of the reasons I'm here. He believed in me and I'll never forget that.\"\n\nOrlando shot 32 percent from the field and committed 16 turnovers, resulting in 20 points for Indiana. Evan Fournier led the Magic with 14 points on 4-of-15 shooting, and Aaron Gordon had 11.\n\nGeorge also had six rebounds and five assists for the Pacers, who pulled away in the second half. Monta Ellis also scored 13 points, and Jeff Teague finished with 11.\n\nIndiana led by as many as 21 points during the fourth quarter.\n\nGeorge and Vogel exchanged text messages in recent weeks specifically talking about this game, but the coach was focused on his team after its fourth loss in its last five games.\n\n\"We're going to figure it out,\" Vogel said. \"I'm very disappointed in the inability to build momentum. We struggled on both ends. We need to go in and get back to work.\"\n\nTIP-INS\n\nMagic: Orlando has lost 12 of its last 14 meetings with the Pacers, dating to the 2012-13 season.\n\nPacers: After scoring in double digits in each of the last four games, Al Jefferson was shut out.\n\nUP NEXT\n\nMagic: Host New Orleans on Wednesday.\n\nPacers: Host Cleveland on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995881.1399481
}