{
  "game_id": "0021800242",
  "espn_id": "401070923",
  "date": "Nov 19, 2018",
  "matchup": "PHI vs. PHX",
  "headline": "Embiid has 33 points, 17 rebounds as 76ers beat Suns 119-114",
  "body": "PHILADELPHIA --  Joel Embiid gave another lesson in dominance. Only this time, Suns rookie Deandre Ayton actually was grateful for it.\n\nEmbiid scored 19 of his 33 points after halftime and added 17 rebounds to help the Philadelphia 76ers beat Phoenix 119-114 on Monday night.\n\nBen Simmons added 19 points, 11 rebounds and nine assists for Philadelphia, which won its third straight while improving to 9-0 at home, remaining the only team in the league unbeaten at home. The 76ers play five of their next six in Philadelphia.\n\nEmbiid upped his averages to 27.9 points and 13.1 rebounds while reaching at least 30 points and 10 rebounds in a game for the 11th time. He also has a league-leading 17 double-doubles.\n\n\"I know that's my job,\" Embiid said. \"They need me to dominate.\"\n\nAyton had 17 points and nine rebounds in his first matchup against fellow 7-footer Embiid.\n\nEmbiid scoffed at analysts' comparisons of Ayton to him made on draft day, saying on Twitter: \"Don't compare Ayton to me either. I play DEFENSE.\" The boisterous 76ers center then told ESPN in a preseason interview that Ayton was \"about to get his (butt) kicked.\"\n\nTo his credit, the No. 1 pick responded to pregame questions about Embiid by saying he would let his game do his talking.\n\nAnd Ayton did just that in the first possession, finishing Devin Booker's pass with an alley-oop dunk for an emphatic start to the game. Then, he forced Embiid into a turnover in the 76ers star's first touch on offense.\n\nBut Embiid got the better from that point.\n\nStill, Ayton was glad for the on-court tutorial.\n\n\"It was fun to finally play against Joel,\" he said. \"The way he used his body, I'm going to use that, steal that. Thank you for teaching me. He put in a lot of work; I have to put in a lot of work, too.\"\n\nEmbiid downplayed his previous comments about Ayton and spoke favorably of him.\n\n\"A lot of people misunderstand me; I talk a lot of trash,\" Embiid said. \"He's talented and has a lot of potential. I'm a big fan.\"\n\nBooker had 37 points and eight assists for the Suns, who started a four-game road trip with their sixth loss in seven games. Phoenix, which fell to 3-13 overall and 0-7 on the road, has the worst record in the West and is one of three winless road teams in the NBA.\n\nStrong first-half shooting helped Phoenix to a surprising 62-57 halftime lead. The 76ers took control in the third, going up for good on Embiid's three-point play 3:45 into the quarter. They ended the period ahead 92-86 and led by as many as 12 early in the fourth on J.J. Redick's runner.\n\nThe Suns hung around and T.J. Warren's 3-pointer with 3:06 remaining cut it to 109-104. But Embiid's follow layup with 58 seconds left made it 114-106 and was the clincher.\n\nBUTLER'S  CONTRIBUTION\n\nFour-time All-Star Jimmy Butler, in his fourth game with the 76ers after last week's trade with Minnesota, had 16 points after hitting a 3-pointer as time expired in overtime to lead Philadelphia to a 122-119 win at Charlotte on Saturday.\n\nBRIDGES' HOMECOMING\n\nPhiladelphia native and Villanova product Mikal Bridges had 13 points in 23 minutes for Phoenix. The rookie was drafted 10th by the 76ers before being shipped to the Suns for the No. 16 pick, Zhaire Smith, and a 2021 first-round pick. Smith has yet to play due to a left foot injury and an allergic food reaction that will sideline him at least until January.\n\nTIP-INS\n\nSuns: Veteran G Trevor Ariza returned after missing the previous two games due to personal reasons and had 10 points. ... Warren finished with 21. ... Former 76ers F Richaun Holmes received a warm ovation when he entered in the first quarter. Holmes had 10 points and three rebounds in 21 minutes.\n\n76ers: The teams will conclude their two-game season series on Jan. 2 in Phoenix. ... Jonah Bolden, a second-round pick in 2017, suffered a right leg injury on Saturday while playing for the 76ers' Delaware G League affiliate. He will be re-evaluated in 10 days. ... PG T.J. McConnell had two points in nine minutes after not playing in the last 10 games. ... Hall of Famer Allen Iverson was in attendance and received a standing ovation when he was introduced in the third quarter.\n\nUP NEXT\n\nSuns: At Chicago on Wednesday.\n\n76ers: Host New Orleans on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994064.273081
}