{
  "game_id": "0021600919",
  "espn_id": "400900314",
  "date": "Mar 04, 2017",
  "matchup": "DET @ PHI",
  "headline": "Pistons set season high for points in 136-106 rout of 76ers",
  "body": "PHILADELPHIA -- Pistons coach Stan Van Gundy wanted to get more energy from his first unit, especially Reggie Jackson. So, he used a new approach to Jackson's minutes and it produced high-octane results.\nKentavious Caldwell-Pope scored 13 of his 26 points in Detroit's dominating third quarter, and the Pistons set a season high for points while rolling to a 136-106 victory over the Philadelphia 76ers on Saturday night.\nA day after Van Gundy told reporters he wanted to see more energy from his starting point guard, Jackson had 21 points while playing in six-minute segments.\n\"The energy in that first unit has not been very good,\" Van Gundy said. \"It's certainly not all on (Jackson) but they sort of follow the point guard, so let's get the pace up a little bit and attack. He was better with that tonight.\"\nVan Gundy reasoned that lessening Jackson's minutes would allow him to go all-out while he's playing.\n\"Really push himself defensively and try to get the pace of the game up on offense,\" Van Gundy said. \"Let it loose a little more and go and keep our pace up.\"\nJackson played 25 minutes, down from his season average of 28, but was pleased with the end result.\n\"It felt good,\" he said. \"You have to respect that he made a decision, and I'm just going to go out there and leave it all on the line with the six-minute window.\"\nThe Pistons, holding the final playoff spot in the Eastern Conference, had lost two of three, including Wednesday's 109-86 drubbing at New Orleans that resulted in Van Gundy calling out Jackson and contemplating starting backup point guard Ish Smith over Jackson on Saturday. Jackson, though, did make the start while Smith finished with 11 points and 13 assists in 23 minutes.\n\"Ish came in and did phenomenal,\" Jackson said. \"It worked well for us tonight.\"\nMarcus Morris scored 22 points, Tobias Harris added 20 and Andre Drummond had 14 points, 14 rebounds, four steals and three blocks, one game after getting ejected for swatting the Pelicans' Tim Frazier in the back of the head.\nAlready short-handed due to the loss of Joel Embiid (knee) for the season, not to mention the absence of No. 1 pick Ben Simmons (foot) all season, Philadelphia was without center Jahlil Okafor (right knee soreness) while playing the second game of a back-to-back set. Nik Stauskas had 24 points to pace the 76ers.\n\"When you have a really good team against nine guys in a back-to-back situation, it's a perfect storm to the environment,\" Philadelphia coach Brett Brown said.\nPhiladelphia was playing one night after a 105-102 home win over the Knicks. Justin Anderson, who tied his career high with 19 points Friday while playing strong defense against Carmelo Anthony, had five just points against the Pistons.\nTIP-INS\nPistons: After setting an NBA mark for futility by a team attempting 10 free throws with a 3-for-17 performance from the foul line on Wednesday, the Pistons were 18 for 21 from the line against Philadelphia. ... Smith started the first 21 games of the season in place of the injured Jackson (knee). ... Detroit's previous scoring high was 125 in a 125-124 win at Portland on Jan. 7.\n76ers: Gerald Henderson (hip) missed his second straight game. ... Philadelphia's 15 first-half turnovers equaled the most in any half this season.\nDOMINATING THIRD\nThe Pistons put the game out of reach in the third quarter when they scored 39 points, their most in a third quarter this season, to expand their 67-52 halftime advantage to 106-82.\nDetroit led by as many as 30 points in the period and made 17 of 28 field goals, including 4 of 9 3-pointers. Drummond had eight points and six rebounds in the period.\nTOO EASY\nDetroit shot a season-best 56.8 percent, making 54 of 95 field goals.\n\"They didn't really feel us on defense at all,\" Philadelphia's Richaun Holmes said. \"They were way too comfortable, had way too much of a rhythm. That's something we can't do.\"\nUP NEXT\nPistons: Host Bulls on Monday night.\n76ers: Complete three-game homestand on Monday night against Milwaukee.",
  "source": "espn_api",
  "crawled_at": 1764996037.859549
}