{
  "game_id": "0021800750",
  "espn_id": "401071423",
  "date": "Jan 29, 2019",
  "matchup": "MIL @ DET",
  "headline": "Bucks beat Pistons 115-105 and improve to 13-0 after a loss",
  "body": "DETROIT --  The Milwaukee Bucks have been unbeatable after a loss.\n\nGiannis Antetokounmpo had 21 points, 11 assists and eight rebounds to help the Bucks beat the Detroit Pistons 115-105 on Tuesday night, keeping the distinction of being the league's only team without two straight setbacks.\n\n\"I love that about this team,\" said Antetokounmpo, who added three steals and two blocks. \"Every game we don't play well, the next game we try from the first minute to set the tone.\"\n\nMilwaukee coach Mike Budenholzer said the feat speaks to the character and the competitiveness of the team.\n\n\"Really good teams historically, they usually bounce back after a loss,\" Budenholzer said. \"And, so far this team has been able to do that.\"\n\nThe NBA-leading Bucks improved to 13-0 after losing a game.\n\n\"We learn from our mistakes,\" said Bucks reserve Pat Connaughton, who matched a season high with 16 points. \"The unfortunate thing in sports is you tend to learn a lot more from losing than you do winning.\"\n\nMilwaukee's Brook Lopez scored 12 of his 14 points in the first quarter when Antetokounmpo was limited to three points because he was on the bench for about half the quarter with two fouls.\n\nEric Bledsoe had 20 points and seven assists, Khris Middleton scored 15 points and Tony Snell added 11 points for the Bucks, who have won seven of eight games.\n\nDetroit's Reggie Jackson matched a season high with 25 points and Andre Drummond had 20 points and 13 rebounds. Blake Griffin had 18 points, nine assists and seven rebounds for the Pistons, who have lost four of five and dropped to 21-28 overall.\n\nGriffin said he has not given up hope the team can make the playoffs.\n\n\"It's still within our grasp,\" said Griffin, who insisted he has not asked the Pistons to trade him.\n\nThe Lopez-led Bucks had an eight-point advantage after the first quarter and built a 13-point lead at halftime. That cushion was big enough against the Pistons, who did not appear to be motivated to potentially rally for the win late in the game.\n\nDetroit's Stanley Johnson turned the ball over on a pass toward Reggie Jackson with 2:28 left, and Jackson stood and watched after Bledsoe took the ball near midcourt and went in for a layup.\n\n\"We're never trying to give up,\" Lopez said.\n\nTIP-INS\n\nBucks: Milwaukee swept the season series against Detroit for the first time in franchise history.\n\nPistons: Owner Tom Gores said he's still hoping Detroit makes the playoffs, adding the franchise will explore all possibilities before the NBA trade deadline next week.\n\n\"I have not lost faith in this team,\" Gores said. \"There is something there. We just need some time. Dwane (Casey) just got here.\"\n\nX-FACTOR\n\nBucks reserve D.J. Wilson, a former Michigan star, scored all nine of his points on 4-of-6 shooting in the second quarter. Wilson's scoring helped Milwaukee build a 62-49 lead at halftime after the Pistons pulled into a 35-all tie.\n\n\"That was a critical stretch,\" Budenholzer said. \"We needed somebody to put the ball in the basket, and he did it.\"\n\nCasey, meanwhile, lamented how poorly his team played late in the first half.\n\n\"They turned up the physicality and we didn't meet it in that stretch,\" he said.\n\nBIG PLAYMAKER\n\nThe 6-foot-11 Antetokounmpo scored twice and had two assists on 3-pointers instead taking shots of his own in the lane over the final 1:38 of the third after Detroit cut its deficit to four.\n\n\"He's a great decision-maker,\" Budenholzer said. \"Those are big momentum swings, going into a quarter.\"\n\nINJURY REPORT\n\nBucks: Shooting guard Malcolm Brogdon (bruised sternum) and guard Donte DiVincenzo (heel) missed the game.\n\nPistons: Guards Reggie Bullock (left ankle) and Ish Smith (groin) were out with injuries.\n\nUP NEXT\n\nBucks: Play at Toronto on Thursday night in a matchup of the top two teams in the Eastern Conference.\n\nPistons: Host the Dallas Mavericks on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports\n\n---\n\nFollow Larry Lage at https://twitter.com/LarryLage",
  "source": "espn_api",
  "crawled_at": 1764994479.567065
}