{
  "game_id": "0022301130",
  "espn_id": "401585758",
  "date": "Apr 06, 2024",
  "matchup": "ATL @ DEN",
  "headline": "Murray's return sparks Nuggets to 142-110 win over Hawks as Denver moves into first place in West",
  "body": "DENVER -- — Jamal Murray 's return rippled through Denver's roster in a rout of the Atlanta Hawks that left coach Michael Malone in a great mood and the Nuggets in sole possession of first place in the tight Western Conference playoff race.\n\n\r\n              Murray returned from a strained right knee after missing seven games and had 16 points and six assists in 21 minutes of a 142-110 victory Saturday night. He sat out the fourth quarter as did Nikola Jokic, who still recorded his 25th triple-double of the season, and Kentavious Caldwell-Pope, who added a season-high 24 points.\n\n\r\n              Hawks guard Bogdan Bogdanovic said Murray's presence was a game-changer.\n\n\r\n              “He's a tremendous player. Him and Jokic are the best duo in the league and it's tough to guard them,” Bogdanovic said. “When Jokic needs to find a guy to score, he's got Murray and that's basically it.”\n\n\r\n              Murray's impact in his first appearance since getting hurt March 21 in a game against the New York Knicks went well beyond the numbers he put up. \n\n\r\n              Reggie Jackson, who had started in Murray's place, returned to the bench and led Denver's second unit with 18 points despite a sickness that left him masked on the sideline and Malone surprised he even played.\n\n\r\n              “I have to give him a lot of credit because I didn't think he was going to play,” Malone said. \"For him to go out there ... it was just amazing and a testament to his toughness. \n\n\r\n              “Having Jamal back gets Reggie back to that second unit. (It's) more of a natural order of things for us, and it was great to have Jamal Murray back. And I was really grateful I didn't have to put him back in. He's on a minute restriction and ... I kept him well below his minute restriction.”\n\n\r\n              Denver's reserves erupted for 58 points one game after making just three baskets. Peyton Watson scored 13 points to go with five blocks and Justin Holiday dished out six assists to go with his eight points.\n\n\r\n              All of this propelled the Nuggets (54-24) into sole possession of first place in the Western Conference, a half-game ahead of the idle Minnesota Timberwolves, who visit Denver on Wednesday night. \n\n\r\n              Clint Capela led Atlanta with 19 points. \n\n\r\n              The showdown between the Wolves and Nuggets could decide the top seed in the West, although Oklahoma City is just a game back. Malone has insisted he's more concerned with his team's health than its seeding — as evidenced by his not rushing Murray back into the lineup despite a 4-3 record in his absence — but Denver did parley the No. 1 seed a year ago into a 10-1 home record in the playoffs on its way to winning the franchise’s first NBA championship.\n\n\r\n              “Of course it matters,” Murray said. “It's the No. 1 seed. You get the home-court advantage for the whole playoffs.”\n\n\r\n              Jokic had 19 points, 14 boards and 11 assists.\n\n\r\n              Michael Porter Jr. added 20 points for the Nuggets, who sank 23 3-pointers and dished out a season-best 38 assists despite Aaron Gordon sitting out with a sore right foot.\n\n\r\n              “It was a good win,” Malone said, adding, “I can't say enough good things about our bench tonight. Fifty-eight bench points ... and Nikola, oh yeah, he gets another triple-double.” \n\n\r\n              Malone said Murray will remain on a minutes restriction as the Nuggets look to get him back into a rhythm ahead of the playoffs.\n\n\r\n              “The way it used to be, the season ended on a Wednesday night and you were playing on Saturday. The way it is now, you finish, you've got a week off. So, I think that's why it's really important to Jamal to play and find a rhythm,” Malone said.\n\n\r\n              UP NEXT:\n\n\r\n              Hawks: Host the Miami Heat on Tuesday night.\n\n\r\n              Nuggets: Visit the Utah Jazz on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996259.751264
}