{
  "game_id": "0021700120",
  "espn_id": "400974871",
  "date": "Nov 03, 2017",
  "matchup": "ORL vs. CHI",
  "headline": "Bulls use strong second half to beat Magic 105-83",
  "body": "ORLANDO, Fla. --  For one night at least, the rebuilding project for the Chicago Bulls looked pretty good.\n\nJustin Holiday scored 19 points, Robin Lopez had 11 points and 10 rebounds, and the Bulls beat the Orlando Magic 105-83 on Friday.\n\nChicago had seven players score in double figures in its first road win of the season. David Nwaba had 16 points, and rookie Lauri Markkanen made three 3-pointers on his way to 13 points.\n\n\"There are going to be games where you progress and games you regress and this was progress for us,\" Lopez said. \"We did a great job of playing team defense and everyone having each other's backs. We have guys who are willing to sacrifice for each other in order for the team to grow.\"\n\nEvan Fournier led Orlando with 21 points, and Nikola Vucevic had 14 points. Aaron Gordon added 11 points and seven rebounds.\n\nThe Magic led 45-44 at halftime, but the Bulls pulled away with a big second half.\n\nLopez scored each of his 11 points in the third as Chicago outscored Orlando 29-15 in the period. Denzel Valentine hit three big 3-pointers to help the Bulls close it out in the fourth.\n\n\"I was really happy with the way we came out, the energy, the intensity at the defensive end,\" Bulls coach Fred Hoiberg said. \"This team has been scoring it as well as anybody in the league, to hold this team to 38 points in the second half, showed how locked in our guys were.\"\n\nValentine and Kris Dunn each scored 11 points for Chicago, which shot 14 for 29 from 3-point range. Fellow reserve Paul Zipser had 10 points.\n\nOrlando played without D.J. Augustin and Elfrid Payton due to injuries, leaving Shelvin Mack as their only true point guard. Jonathon Simmons also played some point with Augustin and Payton out.\n\n\"Yeah, it's a factor,\" Magic coach Frank Vogel said. \"It hurts your rhythm a little bit but it's not an excuse.\"\n\nThe Magic shot 40.7 percent (35 for 86) from the field, including a 10-for-35 performance from behind the arc.\n\nREVERSAL OF FORTUNES\n\nThe Magic came into the game with the NBA's best 3-point shooting percentages on offense (.442) and on defense (.283). The Bulls were 28th in 3-point shooting coming into the game.\n\nQUOTABLE\n\n\"We're putting in a lot of work to get better every day and today we took a big step forward,\" Holiday said. \"Hopefully, we'll see how we show up tomorrow.\"\n\nTIP-INS\n\nBulls: Led by Lopez, the Bulls enjoyed a 48-38 rebounding advantage. Markkanen finished with nine boards. ... The Bulls outscored the Magic 24-10 in the paint in the second half.\n\nMagic: Augustin strained his left hamstring during the second quarter of Wednesday night's win at Memphis. Payton is close to returning from a hamstring injury that has sidelined him since Oct. 20.\n\nUP NEXT\n\nBulls: Host the New Orleans Pelicans on Saturday.\n\nMagic: Host the Boston Celtics on Sunday.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993719.126209
}