{
  "game_id": "0022200340",
  "espn_id": "401468495",
  "date": "Dec 03, 2022",
  "matchup": "TOR vs. ORL",
  "headline": "Anunoby matches season high 32, Raptors rout Magic 121-108",
  "body": "TORONTO -- — O.G. Anunoby matched his season high with 32 points, Pascal Siakam had 26 points and 10 rebounds and the Toronto Raptors beat short-handed Orlando 121-108 Saturday, handing the slumping Magic their eighth consecutive loss.\n\n\r\n              Scottie Barnes scored 17 points and had a season-high 14 rebounds, and Fred VanVleet had 13 points as the Raptors won their third straight home game, improving to 9-2 north of the border.\n\n\r\n              Toronto shot a season-best .560, making 47 of 84 attempts.\n\n\r\n              Bol Bol scored 18 points for Orlando, which has the worst record in the NBA at 5-19. The Magic are 1-11 on the road.\n\n\r\n              Bol was the only Magic starter to reach double figures. Paolo Banchero, who came in as the NBA’s leading rookie scorer, shot 2 for 8 and finished with nine points.\n\n\r\n              “It’s a long season, a lot of games,” Banchero said. “You’re going to have nights like this. You’ve just got to move on to the next one.”\n\n\r\n              Former Raptor Terrence Ross scored 18 points, Admiral Schofield had 13 and Cole Anthony 12.\n\n\r\n              The banged-up Magic were again without top rebounder Wendell Carter Jr., who missed his ninth straight game because of an injured right foot, and point guard Jalen Suggs, who missed his fifth straight with a sore right ankle.\n\n\r\n              After being blown out at New Orleans on Wednesday and again at Brooklyn on Friday, the Raptors started better in this one.\n\n\r\n              “We just wanted to regroup, be better,” Barnes said. “It was a bad feeling in the locker room (Friday).”\n\n\r\n              Toronto had five dunks in the first quarter and scored 26 points in the paint to lead 36-22 after one.\n\n\r\n              “They came out like a team that was determined,” Magic head coach Jamahl Mosley said. “Anunoby set the tone early.”\n\n\r\n              Anunoby shot 12 for 17. Four of his 10 baskets from 2-point range were dunks.\n\n\r\n              “I like it when he goes down there and he’s making a move and all of a sudden, he’s dunking it,” Raptors coach Nick Nurse said. “There’s some power to get to that spot and then there’s a lot of burst left at the end.\"\n\n\r\n              After scoring 13 points and making six of seven shots in the opening quarter, Anunoby connected on all three of his field goal attempts and went 3 for 3 at the line in the second. With 23 points by the intermission, he matched his career high for points in a half.\n\n\r\n              Toronto led 64-48 at the break and took a 94-73 advantage to the fourth.\n\n\r\n              POWER MOVE\n\n\r\n              Bol grabbed the rebound on Siakam’s blocked shot late in the second and drove the length of the court for a huge one-handed slam that drew gasps from the crowd.\n\n\r\n              SAME STARTERS\n\n\r\n              After using 10 different starting lineups in the past 10 games, Toronto went with the same five starters from Friday’s loss to the Nets; Anunoby, Siakam, VanVleet, Barnes, and rookie center Christian Koloko.\n\n\r\n              TIP-INS\n\n\r\n              Magic: G Gary Harris (strained right hamstring) sat for the second straight game. Orlando was also without C Mo Bamba (back spasms), C Jonathan Isaac (left knee) and F Chuma Okeke (left knee). … Missed their first six 3-point attempts.\n\n\r\n              Raptors: F Juancho Hernangomez left in the first half because of a sprained right ankle and did not return. X-rays did not reveal a fracture. … F Precious Achiuwa (right ankle) missed his 11th straight game and F Otto Porter Jr. (dislocated toe, left foot) missed his eighth straight. … With his fourth point of the game, Siakam passed Andrea Bargnani (6,581) for fifth on Toronto’s all-time points list…. Siakam had eight rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host the Milwaukee Bucks on Monday night.\n\n\r\n              Raptors: Host the Boston Celtics on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994085.96977
}