{
  "game_id": "0022000874",
  "espn_id": "401307672",
  "date": "Apr 19, 2021",
  "matchup": "MEM @ DEN",
  "headline": "Jokic's 47 leads Nuggets over Grizzlies 139-137 in 2 OTs",
  "body": "DENVER -- — Nikola Jokic scored 47 points, including a go-ahead 3-pointer late in the second overtime, and the Denver Nuggets rallied to beat the Memphis Grizzlies 139-137 on Monday night.\n\n\r\n                    Jokic added 15 rebounds and eight assists, Will Barton scored 28 and Michael Porter Jr. 21 for the shorthanded Nuggets. Denver played without its top two point guards -- Jamal Murray, who has a torn ACL in his left knee and Monte Morris.\n\n\r\n                    Jokic burnished his MVP credentials by carrying the Nuggets to their third straight win since Murray went down.\n\n\r\n                    “Life is about a bunch of little moments and I think Nikola’s got around 56 little moments this year where he’s shown he’s the MVP,” Denver coach Michael Malone said. “Tonight was a character win.”\n\n\r\n                    Morris recently missed 11 games with a left quad injury but returned April 4 and played eight games. He hurt his left hamstring in Friday night’s win at Houston and will likely miss multiple games, Malone said before the game against the Grizzlies.\n\n\r\n                    Memphis was without Dillon Brooks due to left thigh soreness and Jonas Valanciunas, who suffered a concussion Saturday night.\n\n\r\n                    Ja Morant had 36 points and 12 assists, De’Anthony Melton had 25 points off the bench and Grayson Allen added 24 points for Memphis. The Grizzlies lost for just the second time in their last eight road games.\n\n\r\n                    “We had our chances, we just got to be better,” Memphis coach Taylor Jenkins said. “They made some great plays.”\n\n\r\n                    Morant gave the Grizzlies the lead in the second overtime with a 3-pointer and Kyle Anderson hit two free throws to make it 132-129. Porter tied it with a 3-pointer and then Jokic’s shot from the top of the circle gave Denver a 137-134 lead with 42 seconds left.\n\n\r\n                    Allen missed at the other end and P.J. Dozier iced it with two free throws.\n\n\r\n                    Jokic notched his 51st double-double of the season and just missed his 16th triple-double.\n\n\r\n                    “I had a really good night. I scored a lot and I had a couple of stupid turnovers I can easily fix,” Jokic said. “It was good night for me and the team.”\n\n\r\n                    The Grizzlies led by 12 with 3:52 left but Denver rallied to tie it on two free throws by Jokic with 20 seconds left. Allen missed a 3-pointer at the end of regulation to send it to overtime.\n\n\r\n                    Morant scored all nine points for Memphis in the first overtime but Barton’s 3-pointer late sent the game to a second overtime.\n\n\r\n                    “We live and learn from stuff like this,” Melton said. “But we know we can definitely beat those teams so I think we all got better here.”\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Xavier Tillman had 18 points and 14 rebounds. ... Brandon Clarke had missed two games with right hip soreness and Melton was out eight games with left leg soreness. Justise Winslow missed 12 games with soreness in his right thigh. ... Jenkins said Jaren Jackson Jr., who has yet to play this season, is closer to returning after having offseason surgery on his left knee. \n\n\r\n                    Nuggets: Former Broncos quarterback Peyton Manning was in attendance. ... The Nuggets had 15 turnovers in the first half and finished with a season high 23.\n\n\r\n                    LUCKY 1:40\n\n\r\n                    Denver benefited from a pair of reviews late in the game. With 1:40 left in regulation an out-of-bounds call on Facu Campazzo was reversed to off Morant and gave the Nuggets the ball. \n\n\r\n                    In the first overtime -- again with 1:40 left -- a foul originally called on Campazzo was overturned to an offensive foul on Morant. Denver scored the next five points to send it to the second overtime.\n\n\r\n                    Asked after the game to rate Campazzo’s defense on him, Morant chuckled.\n\n\r\n                    “I’m going to let you answer that question,” he said. “I feel like I played well today. I was 13-for-24 from the field, 36 points, 13 assists, plus-9.”\n\n\r\n                    BIG MAN LOVE\n\n\r\n                    If Jokic does win the MVP he will be the first center to do so since Shaquille O’Neal did it in 1999-2000.\n\n\r\n                    “It’s really good for big men,” Jokic said. “I’m just glad the world doesn’t put the bigs aside. We’re still popular.”\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: At the Los Angeles Clippers on Wednesday night.\n\n\r\n                    Nuggets: At the Portland Trail Blazers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764997612.810401
}