{
  "game_id": "0021500383",
  "espn_id": "400828270",
  "date": "Dec 17, 2015",
  "matchup": "TOR @ CHA",
  "headline": "Jeremy Lin returns to form with 35 as Hornets turn back Raptors",
  "body": "CHARLOTTE, N.C. -- Jeremy Lin finally got a chance to show the Charlotte Hornets what \"Linsanity\" is all about.\nMaking just his second start with the Hornets, Lin scored a season-high 35 points in a 109-99 overtime victory over the Toronto Raptors on Thursday night.\nKemba Walker added 27 points, and P.J. Hairston had 14, including a 3-pointer with 1:30 remaining in overtime that put the Hornets ahead to stay.\n\"That's what I wanted to do for a long time,\" said Lin, who got the start when Nicholas Batum couldn't play because of an illness that took him out in the second half Wednesday night in a loss at Orlando.\n\"I saw how much (being the playmaker) took out of Al (Jefferson) and Kemba. But I couldn't have done it without (Walker), and he couldn't have done it without me. He helps me out just as much as I hope I can help him.\"\nLin had 18 first-half points as Charlotte took a 56-44 halftime lead, but it took both Lin and Walker to take down the Raptors, who rallied from a 16-point deficit late in the third quarter.\nLin gave Charlotte a 72-56 lead on a layup with 4:14 left in the third quarter. But behind Kyle Lowry, who scored 13 of his 20 points in the fourth quarter, the Raptors fought back and tied it at 90-90 on DeMar DeRozan's jumper with 26 seconds remaining.\nToronto had a chance to win it in regulation, forcing a turnover that DeRozan turned into a jumper, only to have the points overturned because of a timeout called right after the steal was made.\n\"I was proud of the team and the way we competed late,\" Toronto coach Dwane Casey said. \"But we didn't compete early enough. It's almost like we have to get hit in the teeth before we compete. I do give our guys credit. They could have quit, but they didn't. They fought and put themselves in a position to win.\"\nToronto took its only lead on Lowry's layup 15 seconds into overtime. After two ties, Hairston hit his 3.\nThe Hornets closed the game on a 10-3 run over the final 1:07, going 8-of-8 from the free throw line.\n\"That was a really good win,\" Charlotte coach Steve Clifford said. \"It wasn't pretty there in the fourth (quarter), but I thought we had a lot of guys make a lot of good plays.\"\nTIP-INS\nRaptors: DeRozan finished with 31 points, and Terrence Ross had 17. ... Toronto was whistled for two technical fouls: on Bismack Biyombo in the second quarter and on Lowry in the third.\nHornets: Center Al Jefferson began a five-game suspension for violating the league's drug policy. Jefferson had missed the previous six games with a strained calf muscle.\nTOUGH NIGHT\nLowry, the Raptors' second-leading scorer at 21.6 per game, had just five points over the first three quarters on 1-of-13 shooting, including 0-for-8 on 3-pointers. But he made up for it in the fourth quarter, hitting 4-of-11, including 3-of 6-on 3-pointers, to force overtime.\nBIZMACK'S HOMECOMING\nBiyombo, who spent four seasons in Charlotte, had a memorable return. He finished with a career-best 18 rebounds and tied a career-best with seven blocks. He also had eight points.\nMany of those blocks were punctuated with a finger wag, a familiar sight to Charlotte fans, who saw Biyombo set a team record with 443 blocked shots.\n\"It was a different feeling,\" Biyombo said. \"I call him my brother, Kemba (Walker), but at the same time I play for my team and my teammates.\"\nUP NEXT\nRaptors: At Miami on Friday night.\nHornets: At Washington on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994748.747985
}