{
  "game_id": "0022000547",
  "espn_id": "401267707",
  "date": "Mar 03, 2021",
  "matchup": "CHA @ MIN",
  "headline": "Rozier leads Hornets to 135-102 rout of skidding T-Wolves",
  "body": "MINNEAPOLIS -- — Terry Rozier scored 31 points and Gordon Hayward added 23 as the Charlotte Hornets headed into the All-Star break with a 135-102 win over the skidding Minnesota Timberwolves on Wednesday night.\n\n\r\n                    Rozier was instrumental in helping the Hornets pull away in the third quarter. He hit three 3-pointers in a span of 1:29, the last of which pushed the lead to 79-65. Yet another 3 from Rozier capped an 18-0 run that made it 89-65.\n\n\r\n                    The Hornets have alternated wins and losses for the past 11 games, with Wednesday’s victory coming after a loss Monday at Portland.\n\n\r\n                    Charlotte now heads into the break hoping to get healthy for the second half.\n\n\r\n                    “I think this win just validates our first half of the season,\" coach James Borrego said. “It validates what we're doing, how we're playing. And tonight was a validation of the hard work and the togetherness of this group.”\n\n\r\n                    The Timberwolves have lost nine in a row and 13 of 14. Minnesota is 0-5 since Chris Finch replaced Ryan Saunders as coach.\n\n\r\n                    “Tonight’s performance was completely unacceptable,” Finch said.\n\n\r\n                    Four starters scored in double figures for the Timberwolves. Karl-Anthony Towns had 16 points and 15 rebounds, while Ricky Rubio finished with 20 points and nine assists. Rubio also had a team-high five turnovers.\n\n\r\n                    Minnesota committed five turnovers during Charlotte’s 18-0 run in the third. The Wolves finished the game with 19 turnovers, one shy of their season high.\n\n\r\n                    The Timberwolves limp into the break with an NBA-worst record of 7-29.\n\n\r\n                    “We've just got to take a long look at ourselves and solve the problem,\" Towns said. “This is not the way we should be playing.”\n\n\r\n                    Charlotte’s offense benefited early from the return of Hayward, who missed the previous two games with a right hand injury. Hayward set the pace for the Hornets in the first quarter, scoring 10 of the team’s first 12 points.\n\n\r\n                    “I thought he was fantastic tonight,” Borrego said. “He gave us great leadership and momentum. He really steadied us early on.” \n\n\r\n                    Hornets forward P.J. Washington left in the fourth quarter with a right ankle sprain and did not return. Borrego didn't have an update postgame but said he thought Washington will be good to go when the season resumes.\n\n\r\n                    PAIR OF RISING STARS\n\n\r\n                    The 2021 NBA Rising Stars rosters were announced Wednesday, and the Hornets-Timberwolves matchup featured two players on the Team USA roster.\n\n\r\n                    Minnesota rookie Anthony Edwards and Charlotte guard LaMelo Ball, the respective first and third overall picks in last year’s NBA draft, were both selected. However, this year’s Rising Stars game will not be played as part of All-Star weekend in Atlanta.\n\n\r\n                    Both players scored 19 points in Wednesday's game.\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: C Cody Zeller was initially listed as questionable with a bruised left hip but was later downgraded to out, missing his fourth straight game. … Rozier has scored 30 or more points seven times this season. He had 41 against Minnesota earlier this year.\n\n\r\n                    Timberwolves: Towns tallied his 13th double-double of the season. … Rubio’s first rebound of the game was the 2,500th of his career.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Following the upcoming All-Star break, Charlotte opens the second half of the season by hosting the Detroit Pistons on March 11.\n\n\r\n                    Timberwolves: Minnesota has eight days until its next game. After the All-Star break, the Wolves resume action on the road with a game March 11 at New Orleans.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997019.586358
}