{
  "game_id": "0022301161",
  "espn_id": "401585789",
  "date": "Apr 10, 2024",
  "matchup": "MIA vs. DAL",
  "headline": "Doncic scores 29, Irving adds 25 and Mavericks roll past Heat 111-92 to claim Southwest Division",
  "body": "MIAMI -- — Kyrie Irving clinched a $1 million bonus. Luka Doncic nearly got another triple-double. Daniel Gafford's latest can't-miss streak continued.\n\n\r\n              Oh, and the red-hot Dallas Mavericks won again.\n\n\r\n              Doncic scored 29 points and added nine rebounds and nine assists, Irving scored 25 points and the Mavericks wrapped up the Southwest Division title by beating the Miami Heat 111-92 on Wednesday night — Dallas' 16th win in its last 18 games.\n\n\r\n              “Sounds great,\" Mavericks coach Jason Kidd said. “We checked the box on one goal.”\n\n\r\n              Dallas (50-30) will face the Los Angeles Clippers in the first round of the Western Conference playoffs — that series starting either April 20 or 21. It'll be the third opening-round matchup between those teams in the last four seasons; the Clippers won each of the first two, prevailing in 2021 and 2022.\n\n\r\n              Irving got his bonus because Dallas got 50 wins and he has appeared in at least 50 games.\n\n\r\n              “We just know that the job isn't finished and we’re just getting started,\" Irving said. \"But we do have to celebrate the small wins. And tonight was a step in that direction of just celebrating a small win, just to get to 50 wins. Some guys in that locker room haven't experienced 50 wins.”\n\n\r\n              “It's a total organizational effort, top to bottom,” Irving said of reaching the 50-win mark and getting the division title.\n\n\r\n              Tyler Herro led the Heat with 21 points. Kevin Love had 16 points and 11 rebounds, Caleb Martin scored 14 and Jimmy Butler had 12 for the Heat, who made the NBA Finals out of the play-in last year and might have to try the same route this year.\n\n\r\n              “We have a great group,” Heat coach Erik Spoelstra said. “We have a very competitive locker room. We all want the same thing. And sometimes, this league can just really humble you. And that's what happened tonight.”\n\n\r\n              Miami could have assured itself no worse than the No. 7 spot in the Eastern Conference standings by winning its final three games, all at home, starting with the Mavericks and then wrapping up with games against Toronto on Friday and Sunday.\n\n\r\n              But once again, the home-court edge was not enough of an edge for the Heat. Miami fell to 20-19 at home this season, after going 24-17 in road games during the regular season. The Heat need two wins and a lot of help to avoid going on the road for the first play-in tournament game next week.\n\n\r\n              “We didn't come out with as much intensity as we should have,\" Heat center Bam Adebayo said. “We've got to be better than that.”\n\n\r\n              It was all Dallas early, and pretty much stayed that way; Miami got within nine and eight on separate possessions in the fourth quarter, but no closer. Dallas led by as many as 25 in the first half, the fifth time this season that Miami got that far behind on its home floor — and the third such game in the last seven Heat home contests.\n\n\r\n              Derrick Jones Jr., P.J. Washington and Gafford all finished with 12 points for Dallas; those three players, along with Irving and Doncic, are part of a starting lineup that is now 15-1 this season. Gafford — he of the streak of 33 consecutive made field goals that ended last month — was 6 for 6, extending his current streak of made shots to 22 and counting.\n\n\r\n              “It's amazing,” Kidd said.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host Detroit on Friday night.\n\n\r\n              Heat: Host Toronto on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995320.34064
}