{
  "game_id": "0022400640",
  "espn_id": "401705206",
  "date": "Jan 25, 2025",
  "matchup": "HOU @ CLE",
  "headline": "Thompson has triple-double as Rockets beat East-leading Cavaliers for second time in week, 135-131",
  "body": "CLEVELAND -- — Amen Thompson had his second career triple-double, Alperin Sengun and Jalen Green scored 26 points apiece and the Houston Rockets beat the Eastern Conference-leading Cleveland Cavaliers 135-131 on Saturday night.\n\n\r\n              Thompson finished with 23 points, 14 rebounds and 10 assists, and Fred VanVleet had 20 points and six assists for Houston. The Rockets beat Cleveland for the second time in four days, winning 109-108 at home Wednesday.\n\n\r\n              Darius Garland scored 27 of his 39 points in the second half for the Cavaliers. They have lost a season-high three in a row and dropped a half-game behind Oklahoma City for the NBA lead. Donovan Mitchell had 25 of his 33 points in the second half.\n\n\r\n              Cleveland also lost consecutive home games for the first time, but is a league-best 21-3 at Rocket Mortgage FieldHouse.\n\n\r\n              Takeaways\r\n              Rockets: Centers Sengun and Steven Adams dominated counterparts Jarrett Allen and Tristan Thompson, combining for 40 points and 12 rebounds. \n\n\r\n              Cavaliers: Power forward Evan Mobley returned after missing four games with a right calf strain, but was ineffective throughout. He had seven points, eight rebounds and two blocked shots in 29 minutes.\n\n\r\n              Key moment\r\n              After Garland made two free throws to even the score with 1:51 remaining, Houston answered with a 10-2 run to seize a 134-126 lead, fueled by five points from Thompson. Mitchell missed a wide-open, potential tying 3-pointer with 27 seconds left.\n\n\r\n              Key stat\r\n              Mitchell made his first three shots and had Cleveland’s first eight points, then missed 10 straight field goal attempts. The All-Star starter didn’t score again until the third quarter, winding up 11 of 27 from the field and 4 of 11 on 3-pointers.\n\n\r\n              Up next\r\n              Both teams are back in action Monday night. The Rockets are at Boston, and the Cavaliers host Detroit.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997379.506898
}