{
  "game_id": "0022200644",
  "espn_id": "401468799",
  "date": "Jan 14, 2023",
  "matchup": "TOR vs. ATL",
  "headline": "Young scores 29, Murray 27 as Hawks beat Raptors 114-103",
  "body": "TORONTO -- — Trae Young scored 29 points, Dejounte Murray had 27 and the Atlanta Hawks never trailed in a 114-103 victory over the Toronto Raptors on Saturday night.\n\n\r\n              “We just want to continue to grow and get better, game by game,” Young said. “It’s not going to be great every night, but we’ll definitely have nights like tonight where we can control the game and take over when we need to.”\n\n\r\n              Onyeka Okongwu had 10 points and 13 rebounds, and AJ Griffin came off the bench to score 13 as the Hawks won for the third time in four games after losing five of their previous six. Atlanta won at Indiana on Friday on a last-second basket by John Collins.\n\n\r\n              “This is probably our best road trip,” Hawks coach Nate McMillan said. “I know it’s only two games, but to go into Indiana and win there, and Toronto is always a tough place to play on a back-to-back.”\n\n\r\n              Ninth-place Atlanta came in one game ahead of 10th-place Toronto in the Eastern Conference standings. The Hawks snapped a three-game road losing streak north of the border to win the third and final regular-season meeting between the teams and take the series 2-1.\n\n\r\n              “It’s important,” Young said. “I think they had that in their minds, too. Both teams, we obviously understand where we’re at right now and how close the race is. Starting the second half, you want to win these tiebreakers.”\n\n\r\n              Scottie Barnes led Toronto with 27 points and 12 rebounds, and Pascal Siakam scored 15 points before fouling out as the Raptors finished a season-long six-game homestand at 3-3.\n\n\r\n              “We’ve got a long way to go with some consistency,” Raptors coach Nick Nurse said.\n\n\r\n              O.G. Anunoby and Precious Achiuwa each scored 14 points, and Chris Boucher had 13, but Toronto couldn’t extend its season-high three-game winning streak.\n\n\r\n              Raptors guard Fred VanVleet shot 1 for 9 and finished with three points, while fellow starting guard Gary Trent Jr. shot 2 for 7 and scored seven points. The pair went 1 for 8 from 3-point range. Trent did not play in the fourth quarter, while VanVleet came on after Siakam departed.\n\n\r\n              Boucher made a 3-pointer with 3:14 left in the fourth quarter, cutting it to 107-100, but Siakam fouled out trying to stop a driving Young on the next possession. Young made both free throws, putting Atlanta up nine with 2:48 remaining.\n\n\r\n              Atlanta jumped out to a 20-3 lead as Toronto missed 12 of its first 13 field goal attempts, but the Raptors responded by making eight of their next 10. The Hawks led 34-25 after one.\n\n\r\n              “We were ready to play,” Murray said. “We wanted to play and we wanted to win.”\n\n\r\n              Young and Murray combined for 16 points and six assists in the second and Atlanta led 69-57 at the half. The Hawks took a 96-79 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Young had nine assists. … Murray had eight rebounds and six assists. … Collins and De’Andre Hunter each scored 11 points. … G Bogdan Bogdanovic (left quad) was out. …C Clint Capela (right calf) missed his 10th consecutive game.\n\n\r\n              Raptors: Play 10 of the next 12 on the road, where they are 5-13. … VanVleet shot 0 for 6 and was scoreless in the first half. … Shot 7 for 29 from 3-point range.\n\n\r\n              FAMILY MATTERS\n\n\r\n              For the second time in three meetings, Hawks rookie AJ Griffin got the best of his father, Raptors assistant coach Adrian Griffin.\n\n\r\n              “I wanted him to get that household tiebreaker for sure,” Young joked.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Miami on Monday night.\n\n\r\n              Raptors: Visit New York on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994056.3180501
}