{
  "game_id": "0021900704",
  "espn_id": "401161346",
  "date": "Jan 28, 2020",
  "matchup": "MEM vs. DEN",
  "headline": "Brooks, Valanciunas lead Grizzlies to third straight win",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies have improved greatly since a month ago, and they showed that off against the Denver Nuggets.\n\nDillon Brooks scored 24 points, Jonas Valanciunas had 23 points and 12 rebounds, and the Grizzlies beat Denver 104-96 Tuesday night for their third straight win. The previous two games in the series this season were won by Denver, including a 131-114 victory back in November.\n\nThis time, Memphis led wire-to-wire, jumping ahead by as many as 19. It was the first time this year the Grizzlies have led from start to finish, and Memphis now has a 2 1/2-game cushion over San Antonio for the eighth and final spot in the Western Conference playoff race.\n\n\"I felt like our energy just stepped up, pressuring the ball,\" said Ja Morant, who had 14 points, including 10 in the fourth quarter. \"... We just try to get stops, forcing them into shots we want them to take, rebound and just run.\"\n\nAs evidence that the strategy worked, Memphis outscored the Nuggets in the paint -- 76-22 -- and had 19 fastbreak points to Denver's nine.\n\nJaren Jackson Jr. had 10 points and blocked a career-high seven shots.\n\n\"They dominated the transition game,\" Denver coach Michael Malone said. \"They had 19 fastbreak points, They had 76 points in the paint, which is a joke. Then Dillon Brooks, being an X-factor, he went out and got 24 points.\"\n\nDenver's Nikola Jokic had 25 points and 13 rebounds for his 22nd double-double in 28 games. Jerami Grant had 21 points, including 13 in the fourth quarter as the Nuggets tried to cut into Memphis' lead.\n\nFor the most part, they were unsuccessful. Memphis held a 16-point edge near the midway point of the fourth quarter as Valanciunas provided a burst with seven straight points. Denver crafted a short rally but got no closer than seven points in the closing minute.\n\nMemphis' defense held the Nuggets to under 38% from both the field and 3-point range, and Denver was held under 100 points for the first time in 25 games.\n\n\"We had a lot of failed possessions,\" Jokic said. \"Defense was not what it was supposed to be. We were living in the paint. They would blow by us.\"\n\nThe Grizzlies extended their lead to 19 early in the third quarter by beating the Nuggets down the floor. Memphis outscored Denver 19-16 in the low-octane period, but the Grizzlies still held an 82-66 lead heading to the fourth.\n\n\"I think we're in tunnel vision for the next step ahead,\" Jackson said. \"We're not really trying to settle or anything like that. We might do that eventually.\"\n\nTIP-INS\n\nNuggets: Played without Jamal Murray (left ankle sprain), Paul Millsap (left knee contusion) and Mason Plumlee (right cuboid injury). ... Denver's 24-game string of 100-plus-point games was the longest since a 38-game run in 1990-91 . ... Rookie Michael Porter Jr. was held to eight points. He had reached double figures in seven straight games in which he played.\n\nGrizzlies: Jae Crowder and Grayson Allen were out for the Grizzlies. ... De'Anthony Melton was a late scratch because of a sore left hand. ... Have won 11 of 13 home games. ... Are 14-13 at home this season. ... The 76 paint points was two shy of the franchise record set against Sacramento on Feb. 26, 2011.\n\nHELPING HAND\n\nThe Grizzlies had 32 assists, including seven each by Morant and backup point guard Tyus Jones. Memphis leads the league with 27.8 assists per game.\n\nNOT YET\n\nNuggets coach Michael Malone had praise for Morant but says he is not among the elite yet.\n\n\"I think he's a hell of a player,\" Malone said in the pregame comments. \"He's not an All-Star yet in my opinion. I think he has to go through the growing pains. He's Rookie of the Year.\"\n\nUP NEXT\n\nNuggets: Play at home against Utah on Thursday\n\nGrizzlies: Travel to New York to play the Knicks on Wednesday\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995706.0884962
}