{
  "game_id": "0021600549",
  "espn_id": "400899970",
  "date": "Jan 06, 2017",
  "matchup": "LAL vs. MIA",
  "headline": "Lakers roll past Heat 127-100 after Clarkson, Dragic ejected",
  "body": "LOS ANGELES --  Goran Dragic and Jordan Clarkson repeatedly collided while they fought for position with increasingly bad intentions. Clarkson finally knocked down Dragic with a shove.\n\nAlthough teammates and officials kept them apart before any punches flew, both the Heat's leading scorer and the Lakers' reserve guard were ejected.\n\nThat exchange was yet another bit of good news on an excellent night for Los Angeles.\n\nLou Williams scored 24 points and Luol Deng added 19 points and 14 rebounds for the Lakers in their fourth victory in 20 games, 127-100 over Miami on Friday.\n\nDragic scored 16 points before getting tossed, and the Heat couldn't keep up afterward. While both teams had differing interpretations of the physical play that led up to the near-fight, Miami coach Erik Spoelstra was the most displeased.\n\n\"That's really shameful, disgraceful that Goran Dragic got thrown out of that game,\" Spoelstra said. \"It's an elbow to his face, somebody that wants to fight, knocks him down on the ground, and just a bail-out, shameful, disgraceful ejection. There's no way he should be thrown out of that situation for just taking an elbow to the face, getting up, not even necessarily defending himself, just getting up. But at that point, it's an eight-point game, and we pretty much just let it go from there. I don't know if it would have made a difference, but he is our best player.\"\n\nLakers coach Luke Walton thought the whole incident was overblown, particularly given the long video review before the ejections.\n\n\"A couple of players pushing each other,\" Walton said. \"I don't think it's that big of a deal. You never want a fight to happen, but whatever, keep the game moving and let's go.\"\n\nWith the Heat's leading scorer in the locker room, the Lakers seized control in the fourth quarter of just their second win in 10 meetings with Miami. Williams led a decisive 19-4 run while scoring 16 points in the final period.\n\nWillie Reed had 22 points and 12 rebounds for the Heat, who have lost seven of eight overall and nine of 10 on the road.\n\nD'Angelo Russell scored 19 points, rookie Brandon Ingram had a career-high 17 and Julius Randle added 15 for the Lakers, who had their highest-scoring performance of the season.\n\nReed matched his career high, and James Johnson scored 20 points for the Heat.\n\nACT TWO\n\nJohnson and Randle exchanged harsh words moments after Dragic and Clarkson were tossed, but the big men were kept apart. Johnson scored nine points in the ensuing five minutes to keep the Heat close.\n\n\"Everything was already separated, so there was no need for anything else to go on,\" Johnson said. \"Just people woofing out there. That's all it is, woofing.\"\n\nMETTA'S LAST GAME?\n\nMetta World Peace knows a thing or two about NBA fights, but he kept it relatively clean in perhaps his final game with the Lakers. The 37-year-old veteran committed three fouls and missed his only shot while playing the final 2:12, getting raucous ovations from the Lakers' knowledgeable fans with every event. Los Angeles must decide this weekend whether to allow his one-year contract to become a guaranteed deal.\n\n\"I like him with us,\" Walton said. \"That's a front-office decision, but my recommendation is to keep him, obviously, with us.\"\n\nIf the Lakers decide not to keep World Peace in uniform, Walton says hiring him as an assistant \"would be my next recommendation. I want the guy around our players. I do. He's a professional. I think it's real beneficial when he's in practice in the trenches with them. He's someone that helps the team being around.\"\n\nTIP-INS\n\nHeat: C Hassan Whiteside rejoined his teammates in Los Angeles, and he could play Sunday after missing four straight games. The NBA's leading rebounder got poked in the eye a week ago during a game against Boston, and several days of headaches and double vision only ended recently. ... Dion Waiters had nine points off the bench in his second game since returning from a 20-game absence due to a groin injury.\n\nLakers: Deng missed Thursday's game with right biceps tendinitis. He spent the previous two seasons with Miami before agreeing to a four-year, $72 million free-agent deal with the Lakers. ... The Lakers played their 40th game of the season, most in the NBA. Los Angeles hits the halfway point Sunday.\n\nUP NEXT\n\nHeat: At the Los Angeles Clippers on Sunday.\n\nLakers: Host the Orlando Magic on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995406.434805
}