{
  "game_id": "0022400497",
  "espn_id": "401705063",
  "date": "Jan 06, 2025",
  "matchup": "TOR vs. MIL",
  "headline": "Antetokounmpo's triple-double, Lillard's 25 points power Bucks past struggling Raptors 128-104",
  "body": "TORONTO -- — Giannis Antetokounmpo had 11 points, 13 assists and 12 rebounds for his fourth triple-double of the season, Damian Lillard scored 25 points and the Milwaukee Bucks beat the struggling Toronto Raptors 128-104 on Monday night.\n\n\r\n              Antetokounmpo needed three stitches to close a cut near the base of his right pinkie, but returned to finish his third career triple-double against the Raptors.\n\n\r\n              Bobby Portis scored 20 points, Gary Trent Jr. had 17 against his former team and Brook Lopez added 16 for Milwaukee, which outscored the Raptors 63-24 in bench points and handed Toronto its 13th loss in 14 games.\n\n\r\n              Lillard scored 15 points in the third. \n\n\r\n              Milwaukee came in having lost two straight and four of five, all to teams with losing records. But the Bucks handled the Raptors, building a 33-point lead, 113-80, after a Lopez 3-pointer in the fourth quarter.\n\n\r\n              RJ Barrett scored 25 points and Scottie Barnes had 21 for the Raptors. Jakob Poeltl scored 12 points, and Immanuel Quickley and Gradey Dick each had 11.\n\n\r\n              Khris Middleton (ankle) sat for Milwaukee after playing the past eight games.\n\n\r\n              Takeaways\r\n              Bucks: Milwaukee has gone 16-8 in a stretch that began with a Nov. 12 home win over the Raptors, meaning the Bucks have won twice as many games as they’ve lost since starting the season 2-8.\n\n\r\n              Raptors: Toronto’s trio of Barnes, Quickley and Barrett played together for the first time this season, starting alongside Poeltl and Dick.\n\n\r\n              Key moment\r\n              Portis connected twice from deep as the Bucks turned the game in their favor with a 20-2 run late in the opening quarter.\n\n\r\n              Key stat\r\n              Milwaukee outscored Toronto 66-27 on 3-pointers. The Raptors shot 9 for 35 from long range, going 4 for 26 through the first three quarters.\n\n\r\n              Up next\r\n              Both teams play again Wednesday. Milwaukee hosts San Antonio, and Toronto opens a three-game trip at New York.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997611.727594
}