{
  "game_id": "0022000894",
  "espn_id": "401307693",
  "date": "Apr 22, 2021",
  "matchup": "MIL vs. PHI",
  "headline": "Bucks start out strong, defeat 76ers 124-117",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 27 points and Khris Middleton had 24 as the Milwaukee Bucks defeated the Philadelphia 76ers 124-117 on Thursday night in a matchup of two of the Eastern Conference's top teams. \n\n\r\n                    Bobby Portis added a season-high 23 points as the Bucks ended a five-game home losing streak. \n\n\r\n                    Milwaukee never trailed and led by as many as 21 to defeat Philadelphia for the fourth consecutive time. In their only previous meeting this season, the Bucks won 109-105 in overtime at Philadelphia on March 17.\n\n\r\n                    “We were moving the ball, knocking down shots. From the start, everybody was locked in,\" Antetokounmpo said.\n\n\r\n                    Joel Embiid scored 24 points for the Sixers. Shake Milton had 20 off the bench. \n\n\r\n                    “We were soft tonight,” Sixers coach Doc Rivers said. “We didn’t put up much resistance.”\n\n\r\n                    The Bucks, who hadn't played since Monday, improved to 36-22 and hold the third seed in the East. The Sixers, playing for the fifth time in eight days, fell to 39-20 and into a tie with idle Brooklyn for the top spot. Philadelphia plays in Milwaukee again Saturday.\n\n\r\n                    “I think playing teams like this, back to back, it’s awesome because it prepares you for the playoffs,\" Antetokounmpo said.\n\n\r\n                    The Sixers got closer to full strength with the return of two starters. Tobias Harris, who has been dealing with a right knee issue, came back after missing three games. Seth Curry, who missed Wednesday’s game with left hip flexor soreness, also returned to the lineup. \n\n\r\n                    Harris revealed he has been dealing with a bone bruise.\n\n\r\n                    “I felt good out there in terms of my health and knee,\" Harris said. \"We’ll continue to find the right rhythm and timing.”\n\n\r\n                    Another starter, Ben Simmons, one of the league’s top defenders, missed a third consecutive game with an unspecified illness. Rivers said he's unsure of Simmons' status for Saturday's matchup. \n\n\r\n                    “Right now, I'd say it's 50-50, at best,” he said.\n\n\r\n                    The Bucks jumped out to 10-0 lead and led by as many as 20 — at 33-13 — in the opening quarter. Milwaukee hit its first 10 shots, including five 3-pointers. The Bucks finished the quarter connecting on 14 of 19 shots and held a 40-26 lead. \n\n\r\n                    “They didn't feel us defensively,\" Harris said. “They got where they wanted to all night.”\n\n\r\n                    The Bucks maintained a double-digit lead throughout the second quarter and led 77-60 at the half on 66% shooting. Middleton had 21 first-half points. \n\n\r\n                    Philadelphia cut the lead to nine with 2:51 left in the third, but the Bucks closed the quarter with a 14-2 run, sparked by three straight 3-pointers by Portis, to lead 108-87. Portis made all five of his 3-point attempts.\n\n\r\n                    “I’ve was just trying to do what I’ve been doing all year, come off the bench and provide energy,\" Portis said. “It's fun to be on this team. We have a lot of unselfish guys that love to pass the basketball.”\n\n\r\n                    The Sixers pulled within six points with 7 seconds remaining in the game against the Bucks reserves, prompting Milwaukee coach Mike Budenholzer to reinsert his starters to close out the game. \n\n\r\n                    “It was a strange game after the big early lead,” Bucks coach Mike Budenholzer said. “It’s not easy in this league to play with a lead.”\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Former Bucks player George Hill started for Simmons. ... G/F Furkan Korkmaz was inactive after spraining an ankle against Phoenix on Wednesday night. ... Veteran power forward Anthony Tolliver was signed to a second 10-day deal. \n\n\r\n                    Bucks: Reported no injuries before the game. ... Antetokounmpo didn’t appear limited after missing the final four minutes of overtime of Monday’s game against Phoenix after experiencing what he described as a cramp in his calf. ... Signed F Justin Jackson to a two-way contract. Jackson fills the spot of F Mamadi Diakite, who signed a multiyear standard NBA contract with the team.\n\n\r\n                    3-POINT BARRAGE\n\n\r\n                    The teams combined to make 21 of 33 3-pointers in the first half. Milwaukee shot 13 of 21, with Brook Lopez shooting 4 of 5 from deep. \n\n\r\n                    BENCH BRINGS IT\n\n\r\n                    The bench accounted for half of the Sixers' points in the first half, tallying 30 of the 60 racked up in the first two quarters. For the game, the Sixers reserves scored 58 points, with Milton leading the way with 20. Tyrese Maxey and Mike Scott each had 11 points.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997378.8876228
}