{
  "game_id": "0021700993",
  "espn_id": "400975739",
  "date": "Mar 11, 2018",
  "matchup": "ATL vs. CHI",
  "headline": "LaVine, Portis lead Bulls past short-handed Hawks, 129-122",
  "body": "ATLANTA --  A visit to the lowly Atlanta Hawks provided a confidence boost for the Chicago Bulls.\n\nZach LaVine scored 21 points, including four free throws in the final 17 seconds to stop Atlanta's comeback, and the Bulls beat the injury-depleted Hawks 129-122 on Sunday.\n\nBobby Portis also had 21 points for Chicago (23-43), which has only three more wins than Atlanta (20-47) near the bottom of the Eastern Conference standings. The Bulls did not play like a draft lottery contender, shooting 49 percent from the field and committing only five turnovers.\n\n\"It's fun basketball, playing that way, playing for each other, making each other better,\" Portis said.\n\nThe Hawks lost Kent Bazemore to a right knee sprain and Jaylen Morris to a left ankle injury in the second quarter. Dennis Schroder was held out after hurting his left elbow in Friday night's loss at Indiana. The injury is not thought to be serious.\n\nBazemore appeared to be slightly favoring the right knee as he left the locker room following the game.\n\nHawks coach Mike Budenholzer said he hoped to have updates on Bazemore and Morris on Monday.\n\nTaurean Prince, who led Atlanta with a career-high 38 points, sank a 3-pointer in traffic with 1:26 remaining to cut Chicago's lead to 118-115.\n\nPrince added a four-point play with 18.3 seconds remaining, again cutting the Bulls' lead to three points at 125-122. LaVine's free throws padded the lead.\n\nPrince was benched by Budenholzer in the second half of Atlanta's loss at Indiana on Friday night but bounced back with a strong overall game, including seven assists.\n\n\"I just want to take what I can from this game and apply it to the next,\" Prince said.\n\nBudenholzer said Prince provided \"a lot of positives\" despite the loss.\n\nBudenholzer said he was impressed \"just to see Taurean grow in a game like this and grow in an opportunity where he has the ball in his hands more without Dennis, without Baze.\"\n\nMike Muscala also set a career high with 19 points for Atlanta.\n\nLauri Markkanen scored 19 points and Antonio Blakeney had 14 for Chicago.\n\nSchroder's backup, Malcolm Delaney (left ankle sprain), also did not play. Isaiah Taylor had seven points and eight assists in his first career start.\n\nPrince scored 10 of Atlanta's first 19 points, including two early 3-pointers. The Hawks led 24-8, forcing Bulls coach Fred Hoiberg to call two early timeouts.\n\nChicago outscored Atlanta 33-16 in the second period to lead 53-50 at halftime.\n\n\"I give our bench a lot of credit for turning that game around,\" Hoiberg said. \"I thought they came out and made simple plays.\"\n\nTIP-INS\n\nBulls: C Robin Lopez started but played only in the first quarter, and G Justin Holiday was held out as Hoiberg said the team was \"taking it game by game\" on lineups. Those two players were the focus of a reminder from the league to the team after the All-Star break about player rest and tanking. ... The Bulls made 8 of 13 3s in the third quarter and 17 of 37 for the game.\n\nHawks: Morris was signed to a second 10-day contract after averaging 4.8 points and 3.0 rebounds in five games. He had four points in six minutes before his injury. ... Josh Magette, on a two-way contract, played a career-high 22 minutes and had seven points with eight assists.\n\nFEW MISTAKES\n\nThe Bulls had 31 assists, including seven by Denzel Valentine and five by Kris Dunn and Portis, to go with the five turnovers.\n\nHOT SHOOTING\n\nThe Hawks set a season high with 19 3-pointers on 40 attempts. Prince made 7 of 13 3s.\n\n\"He came out hot and just kept feeling it,\" said teammate John Collins, who had 15 points.\n\nMuscala made five of six 3s.\n\nUP NEXT\n\nBulls: Host Clippers on Tuesday.\n\nHawks: Host Oklahoma City on Tuesday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993738.462634
}