{
  "game_id": "401809800",
  "espn_id": "401809800",
  "date": "Nov 25, 2025",
  "matchup": "PHI vs ORL",
  "headline": "Anthony Black nets career-high 31 points, leads Orlando to 144-103 win over Philadelphia",
  "body": "PHILADELPHIA -- — Anthony Black scored 27 of his career-high 31 points in the first half, Franz Wagner added 21 points and the Orlando Magic routed the injury-depleted Philadelphia 76ers 144-103 in an NBA Cup game on Tuesday night.\n\n\r\n              Orlando’s Jalen Suggs was ejected with 27 seconds left in the first half after receiving two technicals during a heated altercation between the teams. \n\n\r\n              Tyrese Maxey scored 20 points to lead the 76ers, whose absences included Joel Embiid (right knee injury management), Paul George (right ankle sprain) and rookie VJ Edgecombe (left calf tightness).\n\n\r\n              Orlando improved to 3-0 in the Cup and the 76ers dropped to 0-3.\n\n\r\n              The game was tied at 35-all after the first quarter before the Magic took control in the second period. Philadelphia fans started showering boos on the court when Orlando went up 17 points with 5 1/2 minutes left.\n\n\r\n              The frustration spilled onto the court with 27 seconds before the break when the altercation led to Suggs' ejection.\n\n\r\n              The Magic dominated the second quarter, outscoring Philadelphia by 26 points in the period to take an 86-60 lead at halftime.\n\n\r\n              Philadelphia’s Trendon Watford limped to the bench with just over four minutes left in the first half and did not return due to a left adductor strain. \n\n\r\n              Embiid missed his eighth game in a row and 11th this season. The seven-time All-Star and 2023 MVP began the season recovering from left knee surgery, limiting him to 20-to-25 minutes when available, but has since had issues with his right knee. \n\n\r\n              George, who signed a four-year, $212 million deal with Philadelphia prior to last season, made his season debut on Nov. 17 after offseason knee surgery. He missed the following game, played the next two before sitting out against Orlando.\n\n\r\n              For Orlando, Paolo Banchero was sidelined for his seventh consecutive contest with a left groin strain. \n\n\r\n              Up Next\r\n              Magic: At Detroit on Friday night.\n\n\r\n              76ers: At Brooklyn on Friday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042694.8242612
}