{
  "game_id": "0021400355",
  "espn_id": "400578647",
  "date": "Dec 15, 2014",
  "matchup": "CHA @ CLE",
  "headline": "LeBron James, Cavs jump out to 21-0 lead, beat Hornets",
  "body": "CLEVELAND -- LeBron James and Kevin Love were at the top of their game Monday night.\nThat's bad news for any opponent, which the Charlotte Hornets discovered in Cleveland's 97-88 win.\nJames scored 27 points with 13 assists while Love added 22 points and 18 rebounds in a game highlighted by big runs from both teams.\nThe Cavaliers jumped to a 21-0 lead, but the Hornets regrouped and got within two points early in the third quarter before Cleveland pulled away.\nIn information provided by the Cavaliers from Elias Sports Bureau, the 21-0 lead to start a game is the largest to start a game since Portland scored the first 22 points against Boston in 2004.\n\"Being 21 down against an elite team on their floor is tough to overcome,\" Hornets coach Steve Clifford said. \"We played a good enough offensive game to win against a terrific team, but our first-quarter defense was obviously poor.\"\n\nCharlotte got the deficit into single digits in the second quarter and trailed 59-57 early in the third, but Cleveland ended the third on a 21-9 run.\n\"We had a lull in the second quarter and in the third quarter, which really allowed them to get back in the game, but we sustained the effort for close to 48 minutes,\" James said.\nWhile James displayed his noted passing ability, he was the recipient of two length-of-the-court passes from Love for dunks that brought the crowd to its feet.\nThe plays brought back memories of James' high school days when he played football.\n\"It's a unique gift that he has that not too many guys in our league have,\" James said. \"He can go over the head, two-handed. Me, being a wide receiver in my day, I can go 'em also.\"\nKyrie Irving scored 16 points for the Cavaliers, who were coming off consecutive road losses to Oklahoma City and New Orleans after winning eight in a row.\nKemba Walker led Charlotte with 24 points. Al Jefferson added 14 for the Hornets, who are 1-10 away from home -- the worst road record in the NBA. Charlotte has lost three straight and 13 of 15.\nCharlotte center Cody Zeller left the game late in the fourth quarter after hitting his head on the floor while scrambling for a loose ball with Anderson Varejao.\nThe Hornets called the injury a nasal contusion, and Zeller had a large bump at the top of his nose. He will be examined Tuesday.\n\"Varejao went in on me, and I fell,\" he said. \"My face and my nose hit the floor. Then he landed on top of me.\"\nCleveland, which began a five-game homestand, has won six straight at Quicken Loans Arena.\nMichael Kidd-Gilchrist replaced Gerald Henderson in the starting lineup for Charlotte but scored one point in 21 minutes. Kidd-Gilchrist came off the bench in the previous three games after returning from a stress reaction in his right foot.\nJames also got a postgame visit in the locker room from billionaire Warren Buffett, who attended the game with Cavaliers owner Dan Gilbert. Buffett, wearing a Cavaliers jersey with James' No. 23, chatted with the four-time MVP for a few minutes.\nALMOST READY\nCoach David Blatt hopes F Mike Miller (concussion) will play Wednesday. Miller, who has missed six straight games, participated in three-on-three drills Sunday and could go through a full practice Tuesday.\nNO QUICK RETURN\nHornets small forward Jeff Taylor served the final game of his 24-game NBA suspension for a domestic violence incident in Michigan. Clifford doesn't plan on making him active for a game in the near future. \"He'll have to beat out one of our other guys for a spot, and he's missed a lot of time,\" Clifford said.\nTIP-INS\nHornets: Clifford is a longtime friend of Michael Malone, who was fired as Sacramento's coach Sunday. \"I was shocked,\" Clifford said. \"It shows this league gets crazy.\" ... It was Kidd-Gilchrist's first start since Nov. 11. \"I felt like I was telling him, 'Welcome back, young man. Now, here's LeBron to guard,'\" Clifford said, smiling.\nCavaliers: James is sticking behind Browns quarterback Johnny Manziel, despite the rookie's poor performance in his first NFL start Sunday. \"I'm not disappointed,\" said James, who attended the game. \"I'm a friend that supports, and it's only one game.\" ... Dion Waiters and Matthew Dellavedova, who both spent Friday night in a New Orleans hospital because of a stomach illness, returned Monday.\nUP NEXT\nHornets: Host Phoenix on Wednesday.\nCavaliers: Host Atlanta on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764992302.633972
}