{
  "game_id": "0021701077",
  "espn_id": "400975823",
  "date": "Mar 22, 2018",
  "matchup": "SAC vs. ATL",
  "headline": "Kings beat Hawks amid protests outside Golden1 Center",
  "body": "SACRAMENTO, Calif. --  On the best night of his rookie season, Sacramento's Justin Jackson had a difficult time keeping his mind off the protests going on outside of Golden1 Center.\n\nHe was far from alone in his feelings.\n\nPlayers from both the Kings and Atlanta Hawks were admittedly distracted by a large group of protesters who were locked arm-in-arm surrounding entrances to the arena before and during the game.\n\n\"It definitely throws you off for sure,\" Jackson said after Sacramento's 105-90 victory Thursday night. \"It even throws you off going out there and seeing all those seats empty and you know why. It was definitely tough. We did a good job of trying to stay as locked in as we could.\"\n\nJackson scored 11 of his season-high 20 points in the third quarter, shot 7 of 8 and was perfect on four shots beyond the arc to help the Kings split the season series with the Hawks while avenging their worst loss of the season. Atlanta beat Sacramento 126-80 in November.\n\nBuddy Hield and Frank Mason scored 16 points apiece, while Kosta Koufos added 14 points and 11 rebounds for the Kings.\n\nThe game and stats, though, were secondary to what was going on outside the arena.\n\nA massive crowd shut down nearby freeways and gathered in the surrounding streets to protest the police shooting of Stephon Clark, an unarmed black man who was in the backyard of his grandparents' house Sunday night. According to reports, Clark was shot 20 times.\n\nAn estimated crowd of fewer than 2,000 made it into the 17,600-seat Golden1 Center before police decided to not allow anyone else to enter. Several of those who did get in were allowed to move down into the lower bowl of the arena, leaving the upper deck empty.\n\nThere was also talk of cancelling or postponing the game before the NBA made the decision to play.\n\n\"Basketball was secondary tonight,\" Hawks coach Mike Budenholzer said. \"The league obviously made the decision that I think was in the best interest of the safety of the fans that were already in the arena. I think it was the right decision by the league but certainly not an easy one.\"\n\nAfter the game, Kings owner Vivek Ranadive addressed the small crowd from center court while surrounded by Sacramento's players and coaches and expressed his sympathies toward the Clark family.\n\n\"We are so very sorry for your loss,\" Ranadive said. \"We at the Kings recognize people's abilities to protest peacefully and we respect that. We here at the Kings realize that we have a big platform. It's a privilege but it's also a responsibility. It's a responsibility that we take very seriously and we stand here before you, old, young, black, white, brown, and we are all united in our commitment.\n\n\"We recognize that it is not just business as usual and we are going to work really hard to bring everybody together to make the world a better place, starting in our own community. We are going to work really hard to prevent this kind of tragedy from happening again.\"\n\nSacramento's Vince Carter said players from both teams talked to one another about the situation throughout the game. An eight-time All-Star, Carter praised Ranadive's postgame comments.\n\n\"What Vivek said speaks volumes,\" Carter said. \"Regardless of your skin color, it's just what's right and what's wrong and how we can support each other, even if it has nothing to do with you. Lend a hand and support. That's the message that needs to shine through all of this.\"\n\nWith so few fans in attendance, the game often had the look and feel of a high school playoff.\n\nThe Kings led most of the way and pulled away in the second half behind Jackson and Hield, who scored 10 points in the fourth quarter.\n\n\"It was a tough game to play under the circumstances,\" Sacramento coach Dave Joerger said. \"Your care is for your own safety and your family that is coming to the game, not knowing how things are going to come out.\"\n\nIsaiah Taylor scored 18 points, Dewayne Dedmon added 13 points and 10 rebounds, and Tyler Dorsey made three 3s and scored 11 points for Atlanta. The Hawks have lost three straight in Sacramento.\n\n\"It was a tough one for us as a team,\" Dorsey said. \"But the NBA felt it was best for us to play this game. That's a serious situation, for real. It's tough to play under that all game, knowing that's outside the arena going on.\"\n\nTIP-INS\n\nHawks: Dennis Schroder was given the night off by Budenholzer. ... Kent Bazemore missed his fifth consecutive game with a bruised bone in his right knee.\n\nKings: Zach Randolph (stomach) and Garrett Temple (sprained left ankle) did not play.\n\nTAYLOR'S CAREER BEST\n\nTaylor set a career high for scoring while making his second start of the season in place of Schroder. \"He's growing,\" Budenholzer said. \"Defensively he had some great possessions. I'm happy with how he's playing and how he's growing.\"\n\nUP NEXT\n\nHawks: At Golden State on Friday.\n\nKings: Host Boston on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764993228.944691
}