{
  "game_id": "0021900071",
  "espn_id": "401160713",
  "date": "Nov 01, 2019",
  "matchup": "MIL @ ORL",
  "headline": "Antetokounmpo, Bucks roll past Magic 123-91",
  "body": "ORLANDO, Fla. --  It was a pretty typical performance for Giannis Antetokounmpo.\n\nDonte DiVincenzo was a bit of a surprise.\n\nAntetokounmpo had 29 points and 14 rebounds, and the Milwaukee Bucks pounded the Orlando Magic 123-91 on Friday night.\n\nWhile the reigning NBA MVP was great once again, DiVincenzo scored 14 points in his most extensive action so far this season. He played two minutes in the Bucks' first four games and had not taken a shot.\n\nDiVincenzo went 4 for 7 from 3-point range. He also contributed three assists and two steals in 17 minutes.\n\n\"He hasn't played all season, and one thing I told him was to stay ready,\" Antetokounmpo said. \"You're going to get your opportunity, and he was ready tonight.\"\n\nEric Bledsoe added 18 points, six rebounds and six assists for Milwaukee, which was coming off a 116-105 loss at Boston on Wednesday night. Khris Middleton added 16 points and six rebounds.\n\nThe Bucks grabbed control by making nine 3-pointers during a key stretch in the first half. They went 17 for 47 from beyond the arc on the night.\n\nEvan Fournier led Orlando with 19 points. Nikola Vucevic had 14 points and seven rebounds.\n\nBrook Lopez, Robin Lopez, Bledsoe, Ersan Ilyasova (two), Sterling Brown, George Hill and DiVincenzo (two) connected from long range during a 32-7 run for the Bucks.\n\n\"You could feel things shifting in that first quarter,\" DiVincenzo said. \"Everybody on our team is so unselfish. We have guys who could get 25 every night, but instead we have a balanced attack and guys getting open looks.\"\n\nAfter making eight of their first nine shots on their way to a 20-7 lead, the Magic were outscored 40-9 over the next 11 minutes, most of it by Milwaukee's reserves.\n\n\"Orlando was doing a lot of things well early, but our bench came in and flipped the script,\" said Bucks coach Mike Budenholzer. \"We had really good bench play tonight.\"\n\nThe Bucks led 79-51 after Middleton scored seven straight points midway through the third quarter.\n\nMilwaukee shot 50.5 percent for the game. The Bucks also had a 57-41 rebound advantage and scored 54 points in the paint.\n\n\"They were wide open, wide open ... wide open. It wasn't like they made all these great shots, it was wide open,\" Magic coach Steve Clifford said. \"It was an unacceptable effort against a great team and they played well.\"\n\nTIP-INS\n\nBucks: Seventeen of the Bucks' first 21 shots were 3-pointers. ... G Pat Connaughton left the floor with a shoulder injury in the third quarter, but returned to the game. ... Kyle Korver rested. Budenholzer said the Bucks would look for periodic games off for the 38-year-old guard.\n\nMagic: F Amile Jefferson, who had been on a two-way contract with Orlando, signed a standard contract Friday. ... C Mo Bamba (load management) and G Michael Carter-Williams (bruised hip) were out.\n\nNO MAGIC TOUCH\n\nThe Magic came into the game last in the NBA in scoring (95.8 points per game) and shooting (.395) and second-last in 3-point shooting (.288). They didn't do anything to help themselves, shooting 37.4 percent and scoring under 100 points for the fifth straight time.\n\nUP NEXT\n\nBucks: Host Toronto on Saturday.\n\nMagic: Host Denver on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764996183.903798
}