{
  "game_id": "0021600786",
  "espn_id": "400900191",
  "date": "Feb 08, 2017",
  "matchup": "LAL @ DET",
  "headline": "Drummond, Pistons rout Lakers 121-102",
  "body": "AUBURN HILLS, Mich. --  Andre Drummond and the Detroit Pistons handed the Lakers one more defeat at The Palace.\n\nDrummond had 24 points and 17 rebounds, and the Pistons routed Los Angeles 121-102 on Wednesday night. It was the last scheduled appearance at The Palace for the Lakers, since the Pistons are set to move downtown next season.\n\nDetroit honored Isiah Thomas at halftime as part of the team's ongoing celebration of its years in Auburn Hills.\n\n\"Isiah's my guy. We're always in constant communication,\" Drummond said. \"Tonight was a very special night for him.\"\n\nSome of the Pistons' best memories at The Palace came at the expense of Los Angeles. The Lakers went 0-5 in NBA Finals games at this arena as Detroit took titles at their expense in 1989 and 2004.\n\nThe Pistons led 56-50 at halftime and broke the game open in the third quarter. Detroit went on an 11-0 run to take an 82-61 lead.\n\nJon Leuer scored 20 points for the Pistons, who have won four of five. Tobias Harris added 19 points.\n\nJulius Randle and Lou Williams scored 17 points apiece for the Lakers.\n\nDetroit went only 4 of 16 from 3-point range but outscored the Lakers 70-46 in the paint.\n\n\"Our game plan was simple. We wanted to guard the paint and make them shoot 3-pointers, because they aren't a great outside shooting team,\" Lakers coach Luke Walton said. \"They scored 70 points in the paint and beat us by 19 while only making four threes. That sums up how well we played tonight.\"\n\nHONORED\n\nThomas spoke to reporters before the game and talked about some memories from his playing days. He also showed optimism about the post-Palace future.\n\n\"Just closing one chapter and starting another,\" Thomas said before the game. \"It's an exciting time, going back downtown to Detroit. This place is really special to all of us.\"\n\nDECISIVE QUARTER\n\nThe Pistons outscored the Lakers 36-20 in the third period. It was the second straight game in which they pulled away at the start of the second half -- Detroit also did it Monday against Philadelphia.\n\n\"I thought that we defended in the third. That's what I really liked,\" Pistons coach Stan Van Gundy said. \"Then, we pushed the ball in transition very well there and also off of our defense.\"\n\nDrummond scored 14 points in the third quarter on 7-of-7 shooting, then wasn't needed at all in the fourth.\n\nDEPTH\n\nThe Lakers came into the game leading the league in bench scoring at 50.7 points per game, but their reserves only outscored Detroit's 51-50.\n\n\"The first unit wasn't good and neither was the second unit,\" said Larry Nance Jr., who had six points off the bench for the Lakers. \"That's really unusual for us -- usually if the first unit has an off night, the second group can pick them up and vice versa. Tonight, none of that happened.\"\n\nHarris was the top scorer among Detroit's backups, and Ish Smith and Aron Baynes added 10 points each for the Pistons.\n\nTIP-INS\n\nLakers: Los Angeles had 18 turnovers through the first three quarters and finished the game with 21. ... The Lakers scored 27 second-chance points in a win at New York on Monday. They managed only 11 against Detroit. ... G D'Angelo Russell scored only two points.\n\nPistons: Detroit assigned F Henry Ellenson and G Michael Gbinije to the team's Grand Rapids affiliate in the D-League.\n\nUP NEXT\n\nLakers: Visit Milwaukee on Friday night to wrap up a five-game road trip.\n\nPistons: Host San Antonio on Friday night in the final scheduled visit to The Palace by the Spurs.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764995383.366103
}