{
  "game_id": "0022300845",
  "espn_id": "401585473",
  "date": "Feb 28, 2024",
  "matchup": "MEM @ MIN",
  "headline": "Anthony Edwards scores 34, Timberwolves move into 1st in West with 110-101 win over Grizzlies",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 17 of his 34 points in the third quarter, helping the Minnesota Timberwolves move into sole possession of first place in the Western Conference with a 110-101 win over the Memphis Grizzlies on Wednesday night.\n\n\r\n              Naz Reid provided a spark off the Minnesota bench with 19 points, and Karl-Anthony Towns had 13 points and 11 rebounds in his return after missing Tuesday's win over San Antonio for personal reasons. The Wolves (42-17) have won three straight and lead Oklahoma City by one-half game in the West.\n\n\r\n              Minnesota trailed by 14 points in the first quarter and 11 early in the third but took an 88-85 lead into the fourth and never trailed again.\n\n\r\n              “You've got to stay mentally tough through all the ups and downs,” Edwards said. “We've just got to stay mentally focused, because we get disengaged a lot, especially myself. So I think it was a big win for us tonight.”\n\n\r\n              Jaren Jackson Jr. led Memphis with 33 points and 13 rebounds. Ziaire Williams added 16 points for the Grizzlies, who have lost three straight.\n\n\r\n              The Wolves improved to 6-2 in the second game of back-to-backs, including 4-0 at home.\n\n\r\n              Memphis jumped out to an early 14-0 lead — the biggest advantage for either team. Minnesota didn’t score until Towns made a 3-pointer 3:16 into the game.\n\n\r\n              “I thought it was a great game,” Grizzlies coach Taylor Jenkins said. “Both teams battled neck and neck for most of the game, and obviously a tight fourth quarter, too. The Timberwolves came away with a few more plays.”\n\n\r\n              Minnesota went on a 9-0 run late in the third quarter, including seven straight points by Edwards, to tie it at 81-all. Edwards also clamped down on Jackson during that sequence as the Wolves looked for ways to slow down the Grizzlies' top scorer.\n\n\r\n              “He took the Jackson matchup and basically shut his water off,” Wolves coach Chris Finch said. “He did a great job of turning the game around on both ends of the floor in the third.”\n\n\r\n              While Edwards has continued to shine on offense, he hopes his defense becomes more recognized. Wednesday's effort should help.\n\n\r\n              “It's not like it's my first time doing this,” Edwards said. “I have nights like this all the time where somebody gets hot or their best player gets hot and I shut them down the rest of the game.”\n\n\r\n              Edwards finished 11-for-11 from the free-throw line.\n\n\r\n              Jackson had a chance to make it a one-possession game in the final two minutes but airballed a 3-pointer. Edwards followed with a dunk that extended Minnesota's lead to 108-101 with 1:31 to play.\n\n\r\n              Minnesota was without forward Kyle Anderson, who suffered a left knee sprain Tuesday.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Portland on Friday.\n\n\r\n              Timberwolves: Host Sacramento on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996006.5929658
}