{
  "game_id": "0022000562",
  "espn_id": "401283399",
  "date": "Feb 17, 2021",
  "matchup": "MEM vs. OKC",
  "headline": "Allen,  Valanciunas lead Grizzlies past Thunder 122-113",
  "body": "MEMPHIS, Tenn. -- — Grayson Allen and Jonas Valanciunas each scored 22 points and Ja Morant posted his first triple-double of the season as the Memphis Grizzlies defeated the Oklahoma City Thunder 122-113 on Wednesday night.\n\n\r\n                    Six Memphis players scored in double figures. Kyle Anderson had 20 points, Dillon Brooks scored 17 points and Morant finished with 15 points, 11 rebounds and 12 assists for the third triple-double in his career.\n\n\r\n                    “Ja makes the game easier for a lot of people when he’s aggressive, whether he’s scoring the ball or sharing it, setting us up with easy shots,” Anderson said. \n\n\r\n                    Shai Gilgeous-Alexander led the Thunder with 22 points in his return after missing four games with a left knee strain. Mike Muscala added 21 points, including 5-for-9 shooting from 3-point range.\n\n\r\n                    Darius Bazley finished with 18 points as Oklahoma City lost for the fifth time in six games.\n\n\r\n                    The game was close through three-plus quarters as neither team built the lead to double digits. But a 19-3 run by Memphis early in the fourth quarter lifted the Grizzlies to a 105-90 lead near the midway point of the frame. The Thunder chipped away but never really threatened the rest of the way.\n\n\r\n                    “The ball didn’t go in our favor. They got a couple of offensive rebounds. We didn’t make enough shots,” Gilgeous-Alexander said. “Nights like that happen. … We just didn’t do enough defensively and offensively.”\n\n\r\n                    Both teams were playing the second night of a back-to-back after losing on Tuesday. The Thunder lost to Portland, and the Grizzlies by 31 to the New Orleans Pelicans.\n\n\r\n                    “It was very important that we came back with a win after a tough night (against New Orleans),” Anderson said.\n\n\r\n                    And the Thunder had another issue, being unable to get out of Oklahoma City after Tuesday’s loss. The team flew into Memphis on Wednesday afternoon, arriving about two hours before game time. While Oklahoma City players continually said there were no excuses, they were outscored in the fourth quarter 36-28 as Memphis built its lead.\n\n\r\n                    “We shot the ball well,” Muscala said. “I’m unhappy with how I rebounded. At the end of the third quarter and throughout the fourth, too many second-chance opportunities that (the Grizzlies) had. … If you can’t get stops, it doesn’t mean much.”\n\n\r\n                    For the Grizzlies, the stretch run was much better than some recent losses in which they let games slip away in the fourth.\n\n\r\n                    “We’re just learning from the past,” Morant said.\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: F Al Horford, the Thunder’s second-leading scorer did not play (rest on the second night of the back-to-back). Isaiah Roby started his ninth game of the season in Horford’s absence and scored 10 points. … As for the late arrival, coach Mark Daigneault said: “We’re just kind of taking our direction from the league. There’s a lot of forces outside of our control right now.”\n\n\r\n                    Grizzlies: Memphis had allowed a limited number of fans to attend games over the last month. However, the team announced Wednesday that no fans would attend the game because of the inclement weather. … A block late in the fourth quarter gave Valanciunas 600 for his career. … The Grizzlies, who lead the league with 9.8 steals, had 12 in the first half and 14 in the game. … Anderson had five steals in the first half, tying his career best.\n\n\r\n                    JENKINS EJECTION\n\n\r\n                    With less than a minute left, Memphis coach Taylor Jenkins picked up his second technical of the game. The first came at the end of the third quarter. “Heck of a game. Wish I was there at the end to be there to celebrate,” Jenkins said. Meanwhile, forward Kyle Anderson who spent time with the San Antonio Spurs and saw some Gregg Popovich techs laughed when asked for a comparison. “I’m sure (Jenkins) will get some better ones in the future,” Anderson said. “He’ll definitely have some better ones. I like it though.”\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Travel to Milwaukee to face the Bucks on Friday.\n\n\r\n                    Grizzlies: Continue a four-game homestand against Detroit on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996964.8831658
}