{
  "game_id": "0022200386",
  "espn_id": "401468541",
  "date": "Dec 09, 2022",
  "matchup": "MIL @ DAL",
  "headline": "Lopez layup, Mavs FT woes save Bucks after Giannis fouls out",
  "body": "DALLAS -- — Giannis Antetokounmpo fouled out before the Milwaukee Bucks hung on and beat Luka Doncic and the Dallas Mavericks.\n\n\r\n              That sixth foul set the stage for how the Bucks made it four consecutive victories.\n\n\r\n              Tim Hardaway Jr. missed all three free throws after getting fouled by the Greek Freak and Dorian Finney-Smith missed two more with Dallas in front in the final seconds, setting up Brook Lopez's go-ahead layup in Milwaukee's 106-105 victory on Friday night.\n\n\r\n              The Mavericks were a woeful 10 of 24 from the line — a franchise-worst 41.7% — and 7 of 15 in the fourth quarter. Their previous worst ever with at least 20 attempts, according to sportradar, was 47.6% (10 for 21) against the Nets in 1998. \n\n\r\n              Doncic had 33 points and 11 assists with a go-ahead layup with 29 seconds remaining, but was part of the free throw problem, going 4 of 10. \n\n\r\n              “We practice free throws all the time,” Dallas coach Jason Kidd said after his team's three-game winning streak ended. “It's just unfortunate that we didn't make them at the right time.”\n\n\r\n              Antetokounmpo had 28 points when he fouled out with 2:55 remaining, ending his eight-game run with at least 30 points.\n\n\r\n              Hardaway's misses preserved Milwaukee's 102-101 lead, and Doncic had put Dallas up 105-104 when Finney-Smith got to the line with 10 seconds to go.\n\n\r\n              The Bucks inbounded from near their bench, and Lopez slipped behind a screen from Khris Middleton for the easy bucket with seven seconds remaining on the throw-in from George Hill.\n\n\r\n              “Great screen by Khris, great catch by Brook, you've got to have a great inbounder in George,” Bucks coach Mike Budenholzer said. “The vision to see it and get the ball to Brook. Heck of a finish.”\n\n\r\n              Dallas didn’t immediately take a timeout, but was out of sorts with Doncic trying to find an opening before Kidd finally called time with 2.4 seconds to go. Doncic’s desperation 3 at the buzzer didn’t hit the rim.\n\n\r\n              “I wanted to give Luke a chance,” Kidd said. “We had too many people run to screen for him so it was a little crowded for him to be able to execute.”\n\n\r\n              Middleton scored 19 points and Jrue Holiday had 17 for the Bucks.\n\n\r\n              Spencer Dinwiddie scored 15 points, and Christian Wood had 14 points and nine rebounds for Dallas. \n\n\r\n              While missing the 30-point mark, Antetokounmpo, who had 10 rebounds, did make it a ninth straight game of shooting at least 50%, hitting his last eight shots after a 2-of-12 start to finish 10 of 20.\n\n\r\n              The Mavericks led by 12 in the third quarter, when Doncic had consecutive assists on behind-the-back passes to Maxi Kleber for 3-pointers.\n\n\r\n              After Doncic stole a pass and took it all the way to the other end for a one-handed dunk over Holiday, the three-time All-Star assisted on a 3-pointer by Wood that put Dallas up 78-66.\n\n\r\n              Antetokounmpo capped an 8-0 run with a three-point play for a 94-all tie, setting up the back-and-fourth finish that mostly played out without the two-time MVP.\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Antetokounmpo was trying to become the first player in 12 years to score at least 30 points and shoot at least 50% from the field in nine consecutive games. Amar'e Stoudemire did it with New York in 2010-11. ... Bobby Portis Jr. scored all 10 of his points in the first half.\n\n\r\n              Mavericks: Kemba Walker has been active but still hasn't made his Dallas debut since signing Nov. 29. The four-time All-Star has been battling knee issues in recent years. ... The five-game run of Hardaway and Doncic hitting at least four 3-pointers each ended.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Finish a two-game Texas swing in Houston on Sunday. \n\n\r\n              Mavericks: At Chicago on Saturday as the Mavs finish their third back-to-back in two weeks. Dallas lost both on the first back-to-back, then won both on the second.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994589.1302662
}