{
  "game_id": "0021600022",
  "espn_id": "400899456",
  "date": "Oct 28, 2016",
  "matchup": "CHA @ MIA",
  "headline": "Hornets rally from 19 down in second half, top Heat 97-91",
  "body": "MIAMI --  Kemba Walker already knows one thing about these Charlotte Hornets.\n\n\"We're resilient,\" Walker said.\n\nThat was proven in earnest Friday night.\n\nWalker scored 24 points and the Hornets erased a 19-point deficit in the third quarter on the way to beating Miami 97-91. Charlotte won in the building where its season ended in Game 7 of a first-round matchup last spring, albeit against a very different Heat team that played a home opener without Dwyane Wade on the roster for the first time since 2002.\n\n\"We could have given up, but we didn't,\" Walker said. \"We kept wanting it.\"\n\nHassan Whiteside led Miami with 20 points and 15 rebounds but sat a long stretch of the second half with foul trouble and needed four stitches to close a gash on his left elbow.\n\nDown 65-46, Walker made a 3-pointer to unknowingly start what became a 29-point turnaround. The Hornets clamped down on Miami in the second half, with the Heat shooting 6 for 17 from behind the arc in the final 24 minutes -- and just 6 for 26 from 2-point range in that time. Charlotte's reserves had 30 points after halftime, while the entire Miami roster combined for 34.\n\n\"One thing is we were able to stop their penetration more,\" Hornets coach Steve Clifford said. \"Our defense more energized the offense, and we got really good bench play.\"\n\nJeremy Lamb scored 16 points for the Hornets, who had six players in double figures and turned the 65-46 hole into a 94-84 lead with 3 minutes left -- a 48-19 run in about 18 minutes. Nic Batum and Marco Belinelli each scored 12 points for Charlotte.\n\n\"They're a well-coached, veteran team,\" Heat coach Erik Spoelstra said. \"They weren't punch-drunk or anything when we went up. ... We knew going in we would have to play a complete game against them and we weren't able to do that.\"\n\nGoran Dragic scored 14 points and Dion Waiters added 13 for the Heat, who lost a home opener for the first time in nine years. Charlotte had runs of 12-0 and 9-1 in the third quarter alone.\n\n\"We just stopped getting stops,\" Heat forward Justise Winslow said. \"That was it.\"\n\nTIP-INS\n\nHornets: Roy Hibbert started at center, played the first 4:29, and did not return because of right knee soreness. Cody Zeller started the second half in his place. ... Frank Kaminsky (right foot strain) went through a pregame workout but was inactive. ... Belinelli now has 11 regular season appearances in Miami with seven different teams.\n\nHeat: Team captain Udonis Haslem grabbed a microphone and addressed the crowd before tip-off, promising them that \"we will play as hard as we can for you guys every night.\" ... The locker Wade used for the last several years is now empty, not assigned to any current Heat player. ... Wayne Ellington (right thigh bruise) and Josh Richardson (right knee) were again sidelined.\n\nFOR STARTERS\n\nMichael Kidd-Gilchrist just recently turned 23, missed most of last season with a shoulder injury and still made the 200th start of his Charlotte career on Friday night. Miami's entire starting five -- Dragic (100), Whiteside (77), Winslow (10), Luke Babbitt (2) and Waiters (2) -- now have a combined 191 starts in Heat colors.\n\nRILEY SPEAKS\n\nHeat President Pat Riley sat down with team broadcast outlet Fox Sports Sun before the game and raved about the job Spoelstra has done with a new group that was largely assembled after Wade left for Chicago this summer (and before Chris Bosh failed his physical in September to essentially end his time with the team).\n\n\"There's a saying that Spo uses a lot, and I like to use it myself now ... when you look at a player, the player doesn't care what you know until he knows how much you care,\" Riley said. \"Spo and his staff cares a lot about these guys and these young players.\"\n\nUP NEXT\n\nHornets: Saturday, they play their home opener against Boston.\n\nHeat: Sunday, the homestand continues when San Antonio visits.",
  "source": "espn_api",
  "crawled_at": 1764995554.77347
}