{
  "game_id": "0022200445",
  "espn_id": "401468600",
  "date": "Dec 18, 2022",
  "matchup": "ORL @ BOS",
  "headline": "Banchero scores 31 as Magic win second straight in Boston",
  "body": "BOSTON -- — Paolo Banchero scored 31 points and Admiral Schofield had 11 of his 13 in the fourth quarter to help the Orlando Magic complete a sweep of consecutive games in Boston with a 95-92 victory on Sunday.\n\n\r\n              Franz Wagner added 12 points and Bol Bol had 11 with eight rebounds for Orlando, which was 1-11 on the road before its two straight wins over the Celtics at TD Garden.\n\n\r\n              It extended the Magic's winning streak to six games, their longest since March 2019.\n\n\r\n              “It means a lot to come out in this environment and get two straight wins against that team, a great team,” Banchero said. “I think it means a lot for our confidence going forward. We know we can compete against anybody. We just have to keep the same level of focus.”\n\n\r\n              Jaylen Brown led Boston with 24 points, Marcus Smart had 15 and Grant Williams 14. \n\n\r\n              “We just have to come in right off the gate with high energy,\" Smart said. “We come in all sluggish and then try to wake up, that's when we get ourselves in trouble. It's going to happen. We understand it. You're going to have game's like that.” \n\n\r\n              Celtics star forward Jayson Tatum missed the game due to personal reasons. The 24-year-old is the team’s leading scorer (30.2 points) and rebounder (8.2), and fifth in the league in scoring.\n\n\r\n              Boston center Robert Williams III played his second straight game after missing the first 29 following left knee surgery in September. He had six points and five rebounds in 17 minutes.\n\n\r\n              The Celtics hit 12-of-47 on 3-point attempts.\n\n\r\n              “I like the shots we got and, nah, you don't adjust your approach,” Boston's interim coach Joe Mazzulla said.\n\n\r\n              With Boston trailing 93-92, Smart stole the inbounds pass and went to the floor, calling timeout with 9.8 seconds to play before the Celtics turned it over on the other end.\n\n\r\n              Moritz Wagner sank two free throws with 5.3 seconds left before Grant Williams front-rimmed a 3-point attempt from the left corner. \n\n\r\n              Grant Williams had a put-back and was fouled, hitting the free throw that gave Boston a one-point edge with just under four minutes left, but Banchero nailed a 3 on the Magic’s next possession and they never trailed again.\n\n\r\n              “They're believing and they're understanding that they're doing it by committee,” Orlando coach Jamahl Mosley said. “That's who this team has to be: Gritty, tough and fighting for one another.”\n\n\r\n              Boston had sliced it to 93-92 on Malcom Brogdon’s 3 but Markelle Fultz snatched the rebound on Banchero’s miss and Orlando called timeout.\n\n\r\n              Boston lost Friday’s game 117-109.\n\n\r\n              LUKEWARM WELCOME\n\n\r\n              Stuff the Magic Dragon, Orlando’s mascot, was part of a group from around sports that was on hand for Kids’ Day. It received a spattering of boos when shown on the Jumbotron. \n\n\r\n              TIP-INS\n\n\r\n              Magic: It was Banchero’s seventh straight game with 20 points or more and his 19th this season. … Recalled R.J. Hampton from their NBA G League affiliate. … In a somewhat slow-paced, lackluster opening half, the Magic held a 50-41 lead at intermission. \n\n\r\n              Celtics: Center Al Horford was fined $25,000 by the league for making what it called “unnecessary and excessive contact” to the lower body of Magic center Moritz Wagner during Friday’s loss. … Missed 18 of their initial 21 on 3-point attempts and went just 5-of-24 in the opening half. … Brown picked up his second foul without time going off the clock, when he was whistled before the ball was inbounded after being called for his first.\n\n\r\n              UP NEXT \n\n\r\n              Magic: At the Hawks Monday in the third of a four-game trip.\n\n\r\n              Celtics: Host the Pacers Wednesday in their third of a seven-game homestand. They don’t play on the road again until 2023.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994642.762709
}