{
  "game_id": "0021500176",
  "espn_id": "400828063",
  "date": "Nov 19, 2015",
  "matchup": "MIL @ CLE",
  "headline": "James, Love lead Cavaliers past Bucks, 115-100",
  "body": "CLEVELAND -- The Cleveland Cavaliers are apparently good listeners.\nAfter LeBron James and coach David Blatt questioned their toughness following two straight losses, the Cavaliers looked more like the best team in the Eastern Conference on Thursday night.\nJames scored 27 points, and Kevin Love added 22 points and 15 rebounds in a 115-100 victory over the Milwaukee Bucks.\n\"This is how we need to play,\" James said. \"There's no ifs ands or buts. I think we answered the call on what we talked about. We're just trying to get better.\"\n\nBlatt gave credit to the players.\n\"It's not about what I said, it's about what they did,\" Blatt said. \"I thought those guys came with a real purpose tonight. You saw it on them. You saw it in their approach. We were sharp and we were aggressive and we were physical and we were pretty tough.\"\nJ.R. Smith added 18 points to help the Cavaliers improve to an East-best 9-3.\nCleveland avenged a double-overtime loss in Milwaukee on Saturday night.\nGiannis Antetokounmpo scored a career-high 33 points for Milwaukee, and the Bucks rallied from a 21-point deficit in the second quarter to cut the lead to 84-79 late in the third.\nAnderson Varejao, who came off the bench to score nine points, helped Cleveland build the lead to 97-84. James scored six points and Love had a three-point play in that stretch.\nAntetokounmpo was 12 of 15 from the field and made all eight of his free throws. Greg Monroe scored 17 points, and Khris Middleton added 15 for Milwaukee.\nAfter losing to the Bucks on Saturday, Cleveland blew a 10-point lead in the fourth quarter Monday night in a loss to Detroit.\nJames set the tone early when he tore a rebound away from Antetokounmpo and went up for an easy basket.\nCleveland used a 27-11 run to take a 63-42 lead late in the second quarter. The Bucks cut into the lead throughout the third quarter, but the Cavaliers regrouped.\nJabari Parker returned after missing a game because of a sprained right foot and scored 14 points.\nCavaliers point guard Mo Williams missed the game because of a sore right leg and center Timofey Mozgov strained his right shoulder in the second quarter and didn't return.\n\"One thing you can't control is injuries but one thing you can control is how you play with the guys who are out there,\" James said. \"We got a huge boost from Andy. We expect that out of him.\"\nBucks coach Jason Kidd was disappointed his team couldn't finish off the comeback.\n\"This is kind of what happened in Washington,\" he said. \"We cut it to two or five points, then the floodgates opened for them.\"\nMilwaukee had a franchise-low 22 rebounds.\nUP TO THE CHALLENGE\nKidd gave Antetokounmpo the challenge of going head-to-head with James and Love for most of the game.\n\"As a young player, I like to take the challenge, but I don't want to just talk about me,\" Antetokounmpo said. \"We've got to focus more on our defense. At home, we won against the best team in the world. The other night was like a playoff atmosphere.\"\nJames is impressed with the 6-foot-11 Antetokounmpo, who scored 16 points against the Cavaliers in Milwaukee.\n\"He's a guy who has that size and that speed and that length,\" James said. \"I think J-Kidd does a great job of putting him in lineups where he can have mismatches. He's all over the floor.\"\nBETTER AT THE STRIPE\nThe Cavaliers were 24 of 30 from the foul line after entering the game 29th in the league in free throw percentage.\nTIP-INS\nBucks: O.J. Mayo made his season debut after missing the first 11 games because of a strained right hamstring. ... Michael Carter-Williams picked up his fifth foul late in the third quarter and played 27 minutes, scoring nine points. .... The game was televised nationally by TNT, marking Milwaukee's first regular-season appearance on the network in 13 years.\nCavaliers: Tristan Thompson played in his 300th consecutive game, the second-longest streak in the league. .... Matthew Dellavedova started at point guard and had a career-high 13 assists and three turnovers in 38 minutes.\nUP NEXT\nBucks: Visit Indiana on Saturday night.\nCavaliers: Host Atlanta on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994099.089826
}