{
  "game_id": "0022400091",
  "espn_id": "401704657",
  "date": "Oct 26, 2024",
  "matchup": "CHI vs. OKC",
  "headline": "Gilgeous-Alexander, Holmgren lead Thunder to easy win over Bulls, 114-95",
  "body": "CHICAGO -- — Shai Gilgeous-Alexander scored 23 points, Chet Holmgren added 21 points and a career-high 16 rebounds, and the Oklahoma City Thunder pounded Chicago 114-95 in the Bulls’ home opener on Saturday.\n\n\r\n              Jalen Williams added 24 points, nine rebounds and eight assists.\n\n\r\n              Zach LaVine had 22 points and nine rebounds for Chicago. Nikola Vucevic added 18 points and 13 rebounds.\n\n\r\n              Josh Giddey finished with 14 points and seven rebounds in his first game against the Thunder since an offseason trade to Chicago for Alex Caruso. Oklahoma City granted his request to be dealt after his role in the playoffs was reduced.\n\n\r\n              Caruso, a popular player during his three seasons with the Bulls, got a standing ovation and waved to the crowd during an early timeout. He checked into the game late in the first quarter and finished with three points in 22 minutes.\n\n\r\n              Takeaways\r\n              Thunder: The Thunder are looking good through two games, after earning the No. 1 seed in the Western Conference last year. There was no letdown against Chicago after beating the Nuggets 102-87 in an important game to start the season. Oklahoma City and Denver both finished 57-25 last season, with the Thunder earning the No. 1 seed in the Western Conference by virtue of a tiebreaker.\n\n\r\n              Bulls: Chicago never found a rhythm after rolling past Giannis Antetokounmpo and the Bucks in Milwaukee on Friday. The Bulls shot 34.8% overall and made just 15 of 53 3-pointers.\n\n\r\n              Key moment\r\n              The Thunder ended the first half on a 22-3 run and took a 59-39 lead to the locker room.\n\n\r\n              Key stat\r\n              The Bulls cooled off in a big way from 3-point range after making 21 of 47 against Milwaukee. Coby White, coming off a 35-point outing, was 0 for 9 from beyond the arc.\n\n\r\n              Up next\r\n              The Thunder host Atlanta on Sunday, and the Bulls visit Memphis on Monday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997120.298113
}