{
  "game_id": "0022300372",
  "espn_id": "401585000",
  "date": "Dec 20, 2023",
  "matchup": "LAC @ DAL",
  "headline": "Leonard, Clippers extend win streak to 9 by holding off Mavs rally in 120-111 victory",
  "body": "DALLAS -- — Kawhi Leonard and the Los Angeles Clippers are in a far better place than they were for their previous trip to Dallas last month, just after James Harden had joined their lineup.\n\n\r\n              On the best run in the NBA at the moment.\n\n\r\n              Leonard scored 30 points, and the Clippers held on after leading by 22, extending their win streak to nine games with a 120-111 victory over the Mavericks on Wednesday night.\n\n\r\n              Norman Powell scored 21 points off the bench with Paul George sidelined by an illness, and Harden had 17 points and 11 assists. The Clippers have the NBA's longest active win streak, tied for the league high this season, and the franchise's longest streak since a 10-game run in 2015-16.\n\n\r\n              Dallas star Luka Doncic’s franchise record of 11 consecutive games with at least 30 points ended with 28 in a sixth straight game without All-Star guard Kyrie Irving, who has a bruised right heel.\n\n\r\n              Doncic recorded his sixth triple-double by getting 10 rebounds and 10 assists.\n\n\r\n              When they lost 144-126 at Dallas on Nov. 10, the Clippers hadn't won since acquiring Harden in a trade with Philadelphia. They were on their way to a six-game losing streak. They're 14-3 since that skid.\n\n\r\n              “It’s going to take time for them to find the rhythm, find the continuity, find the chemistry,” Powell, who tied his season high in scoring, said of matching Harden with Leonard, George and Russell Westbrook.\n\n\r\n              “It’s no summer league, summertime pickup basketball where you're doing whatever you want,” Powell said. “There’s a system in place, and everybody's got to figure out their role and how it goes.”\n\n\r\n              With the Clippers leading by one late in the fourth quarter, Leonard, who also had 10 rebounds, hit a layup and assisted on a three-point play by Powell. \n\n\r\n              The five-time All-Star then had a dunk and a layup on either side of two missed free throws from Doncic as part of a 9-0 run that made it 120-110 with 52 seconds remaining.\n\n\r\n              Amir Coffey scored 12 points in his second start of the season, both in place of George in the past four games. George missed the previous game with a hip injury.\n\n\r\n              Tim Hardaway Jr. scored 21 points for Dallas, and Derrick Jones Jr. had 19.\n\n\r\n              In addition to Irving, Dallas is without rookie center Dereck Lively II because of a sprained ankle and guard Josh Green, who has a sprained elbow. \n\n\r\n              The Dallas rally kicked into gear with an unusual sequence in the final minute of the first half after the Mavericks trailed by 22 midway through the second quarter.\n\n\r\n              Hardaway had three misses on the same possession, dropping him to 1 of 10, before getting a fourth shot and hitting a 3. Grant Williams had two of the three offensive rebounds. \n\n\r\n              Thirty seconds later, Hardaway beat the first-half buzzer with a 29-foot 3-pointer to get the Mavericks within 11 at 67-56, the closest they had been since early in the second quarter.\n\n\r\n              “When you’re short-handed, you’ve got to make shots,” Dallas coach Jason Kidd said. “We started to make shots there at the end of the second.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Oklahoma City on Thursday to finish a back-to-back and wrap up a three-game trip sandwiched between four-game homestands.\n\n\r\n              Mavericks: At Houston on Friday. The Rockets just had an 11-game home winning streak stopped in a 134-127 loss to Atlanta.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996558.762478
}