{
  "game_id": "0022200433",
  "espn_id": "401468588",
  "date": "Dec 16, 2022",
  "matchup": "TOR vs. BKN",
  "headline": "Irving hits game-winning 3 at buzzer, Nets win 5th straight",
  "body": "TORONTO -- — Kyrie Irving hit a game-winning 3-pointer at the buzzer and the Brooklyn Nets rallied to beat the Toronto Raptors 119-116 on Friday night, extending their winning streak to a season-high five.\n\n\r\n              Irving scored 15 of his 32 points in the fourth quarter, eluding Toronto’s Fred VanVleet to connect on the decisive basket — the first game-winning buzzer-beater of his NBA career.\n\n\r\n              “Honestly, I was thinking basket,” Irving said. “I saw Juancho (Hernangomez) come over a little bit earlier so I decided to pull it back and took my time, got my balance underneath me.”\n\n\r\n              Nets coach Jacque Vaughn said he planned to give Kevin Durant the ball for the final shot, but Durant convinced Vaughn to let Irving shoot instead.\n\n\r\n              “He was already cooking so I didn’t want to get in his way,” Durant said of Irving. “I felt like he could get whatever he wanted there. I also felt like they weren’t going to run and double him, either. They let him play 1-on-1 and it was a special, special shot.”\n\n\r\n              It was Brooklyn’s first game-winning buzzer-beater since Brook Lopez hit one in a home victory over Detroit on March 21, 2017.\n\n\r\n              Vaughn said Irving has the right personality for such a high-pressure shot.\n\n\r\n              “He definitely has an inner peace and poise that you have to have in that situation to not panic,” Vaughn said. “And he has an innate ability to get to his spot. He wanted to rise up, he created space with balance.\"\n\n\r\n              Irving said competitive desire, not comfort, is his main driver.\n\n\r\n              “I’m not really comfortable, I just want to be great in those situations,” he said. “I’ve failed more than I’ve succeeded.”\n\n\r\n              A disappointed VanVleet said Irving deserved credit for his cold-blooded basket.\n\n\r\n              “He’s the best in the world at that right there,” VanVleet said. “You have to salute him”\n\n\r\n              Durant scored 26 points and Nic Claxton had 15 points, 10 rebounds and a career-high six blocks as the Nets overcame an 18-point deficit to sweep the season series from Toronto for the first time since 2002-03.\n\n\r\n              VanVleet matched his season high with 39 points. Scottie Barnes had 26 and Pascal Siakam added 17 as the struggling Raptors lost their season-worst fourth straight.\n\n\r\n              Yuta Watanabe scored 17 points for the Nets against his former team, including a go-ahead 3 with 14 seconds left. Ben Simmons and T.J. Warren each had 10 points for Brooklyn, which has won nine of 10.\n\n\r\n              Toronto’s O.G. Anunoby sat out for the third straight game because of a sore left hip, while guard Gary Trent Jr. was not available because of a sore left quad.\n\n\r\n              Malachi Flynn scored 13 points as the Raptors lost back-to-back home games for the first time. Toronto is 10-5 north of the border.\n\n\r\n              The Raptors led 62-44 after a 3-pointer by Siakam with 1:17 left in the first half, but Brooklyn closed the second quarter on an 8-0 run, cutting it to 62-52.\n\n\r\n              “That was a huge little stretch for us to get to 10 at halftime,” Vaughn said.\n\n\r\n              The Nets outscored Toronto 17-8 in the first five minutes of the third to cut the deficit to 70-69, and Durant’s basket with 3:25 left in the quarter gave Brooklyn a 77-76 lead, its first of the game.\n\n\r\n              Toronto went 0 for 5 from 3-point range in the third and the Nets took an 88-84 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Nets: G Patty Mills (non-COVID-19 illness) did not travel to Toronto and is doubtful for Sunday’s game at Detroit. … Won their third straight road game, a season high. Brooklyn is 8-7 on the road. … Shot a season-best 60.5% (46 for 76), including going 14 for 20 in the fourth.\n\n\r\n              Raptors: VanVleet scored 25 points before halftime, a season high for any half. … Hernangomez made his second start of the season as Toronto used its 16th starting lineup in 29 games.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Detroit on Sunday night.\n\n\r\n              Raptors: Host Golden State on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994077.3030558
}