{
  "game_id": "0022200155",
  "espn_id": "401468310",
  "date": "Nov 07, 2022",
  "matchup": "BKN @ DAL",
  "headline": "Doncic extends 30-point streak to 9, Mavs edge Nets 96-94",
  "body": "DALLAS -- — Luka Doncic scored 36 points, becoming only the second NBA player ever with nine consecutive games of at least 30 to begin the season, and the Dallas Mavericks beat the Brooklyn Nets 96-94 on Monday night.\n\n\r\n              Dorian Finney-Smith scored 18 points and Josh Green had 16 for the Mavericks, who rallied from a 14-point first-quarter deficit and won their fourth straight.\n\n\r\n              “We started out down two touchdowns,” Mavericks coach Jason Kidd said. “We had a lot of careless turnovers (22 total after averaging 13.5) but found a way to win.”\n\n\r\n              Kevin Durant had 26 points for the Nets. Cam Thomas scored 19 points, Royce O’Neale had 15 and Joe Harris added 14.\n\n\r\n              Doncic joined Wilt Chamberlain as the only players to score 30 or more points in the first nine games of a season. Chamberlain did it in the first 23 games of 1962-63.\n\n\r\n              Doncic played 38 minutes and passed the 30-point mark on a step-back 3-pointer with 3 seconds left on the shot clock with 7:54 remaining in the fourth period to pull Dallas to 78-77.\n\n\r\n              It was another balanced night for the 23-year-old superstar. He shot 11 for 22 from the floor, including 5 for 9 on 3s and 9 for 12 from the free-throw line. \n\n\r\n              Before the game, Nets acting coach Jacque Vaughn stated a goal of limiting Doncic’s trips to the line after he shot 13 free throws, making 11, among his 41 points when Dallas won at Brooklyn 129-125 in overtime on Oct. 27.\n\n\r\n              Doncic’s 3-pointer began a 14-0 Mavericks run – including a technical foul on Durant followed by him jawing at the Dallas bench – for an 88-78 lead with 5 minutes left.\n\n\r\n              The Nets pulled to 92-91 on Thomas’ 3 with 25.3 seconds left. Doncic made two free throws with 13.8 seconds to play for a three-point lead. Durant was fouled on the dribble with 11 seconds to go and pulled Brooklyn to 94-93 with two free throws. Finney-Smith hit two free throws with 9.8 seconds left to push Dallas’ lead to 96-93.\n\n\r\n              Brooklyn inbounded with 6.7 seconds left and Durant was fouled by Reggie Bullock while attempting a 3-pointer. Durant, who hit all 52 of his free throws in the previous six games, hit the first but rimmed out the second. He intentionally missed the third free throw, and Dallas came away with the ensuing scramble for the ball.\n\n\r\n              Brooklyn fell to 2-2 since Vaughn replaced the fired Steve Nash last Tuesday, and 2-1 following the suspension of Kyrie Irving last Thursday.\n\n\r\n              The previous two games saw the Nets tie a franchise record with a 40-point road win at Washington followed by a four-point win at Charlotte during which they closed on a 23-7 run.\n\n\r\n              “We’re headed in the right direction,” said O’Neale, who hit 4 of 8 3-pointers. “We lost this one. Like to have it, but I feel like the whole road trip we did a lot of good things.”\n\n\r\n              TIP-INS\n\n\r\n              Nets: Ben Simmons came off the bench after missing the previous four games with left knee soreness. Simmons had two points and three rebounds in 16 minutes. ... F Yuta Watanabe left the game three minutes into the second period with a sprained left ankle after playing five minutes. Watanabe averages 17 minutes per game. ... The reserves shot 2 for 13 in the first half. ... Vaughn said he hasn’t yet spoken with Irving since the suspension was levied.\n\n\r\n              Mavericks: Doncic accounted for 23 of 25 points by Dallas starters in the first half. ... G Tim Hardaway Jr. scored 11 points off the bench and left the game late in the third quarter with a foot or ankle injury after he slipped and fell in the paint. Kidd had no update on him after the game.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host the New York Knicks on Wednesday in the first of the rivals’ four meetings.\n\n\r\n              Mavericks: At Orlando on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994894.826036
}