{
  "game_id": "0022300574",
  "espn_id": "401585202",
  "date": "Jan 17, 2024",
  "matchup": "MIA @ TOR",
  "headline": "Trent scores season-high 28 points, Barrett adds 26 as Raptors rout Heat 121-97",
  "body": "TORONTO -- — Gary Trent Jr. scored a season-high 28 points, RJ Barrett had 26 and the Toronto Raptors never trailed in a 121-97 win over the Miami Heat on Wednesday night.\n\n\r\n              Toronto led by 37 at one point despite playing without forward Pascal Siakam. The two-time All-NBA selection and two-time All-Star was traded to the Indiana Pacers\n\n\r\n              Scottie Barnes scored 20 points and Immanuel Quickley had 17 points, nine assists and eight rebounds for the Raptors.\n\n\r\n              Trent returned after sitting out Monday’s loss to Boston because of flu-like symptoms and made a season-high eight 3-pointers on nine attempts.\n\n\r\n              Jimmy Butler scored 16 points for Miami, whose 35-point halftime deficit was the biggest in team history. Wednesday’s 78-43 gap eclipsed a 33-point deficit against the Lakers on March 9, 1989.\n\n\r\n              “You never want to be playing from behind, let alone that far behind,” Butler said.\n\n\r\n              Tyler Herro and Bam Adebayo also had 16 points each while Duncan Robinson added 14.\n\n\r\n              Miami’s six made 3-pointers were a season-low. The Heat shot 6 for 28 from distance, going 1 for 16 in the first half.\n\n\r\n              “Our game does not need to be dependent on whether we make 3s or not,” Heat coach Erik Spoelstra said.\n\n\r\n              After shooting a season-worst 4 for 32 from 3-point range Monday, the Raptors set a season-high by making 20 3-pointers against the Heat. Toronto had 19 in an overtime win at San Antonio on Nov. 5.\n\n\r\n              The Raptors connected on 7 of 10 from long range in the first quarter, building a 41-18 lead after one. \n\n\r\n              “It was an avalanche at the beginning of the game,” Spoelstra said. “Our starters definitely did not set the tone for the game and it just proceeded to get worse as that first half went on.”\n\n\r\n              Toronto made seven more 3-pointers in the second. \n\n\r\n              “Tip your hat to those guys,” Miami guard Kyle Lowry said of the Raptors, his former team. “They shot the heck out of the ball.”\n\n\r\n              Toronto head coach Darko Rajakovic dedicated the win to fellow Serbian Dejan Milojević, the Golden State Warriors assistant coach who died Wednesday after suffering a heart attack.\n\n\r\n              Rajakovic said the play Toronto ran on its first possession, when Trent hit a 3, was one he learned from Milojević.\n\n\r\n              Siakam was the last remaining starter from Toronto’s 2019 NBA title team still with the franchise. He was averaging 22.2 points this season, and has averaged 17.4 points and 6.5 rebounds in his career. \n\n\r\n              “I love him as a brother,” Barnes said of Siakam. “It hurts but you’ve got to keep moving on, keep fighting.”\n\n\r\n              In exchange, Toronto received three future first-round draft picks and a pair of players with NBA championship rings, guard Bruce Brown and forward Jordan Nwora. Guard Kira Lewis, who was acquired earlier Wednesday by Indiana from New Orleans in a deal that helped make the Siakam trade possible, also went to the Raptors.\n\n\r\n              Heat forward Jaime Jaquez Jr. sat for the second straight game because of a strained left groin, while forward Kevin Love missed his second straight because of a sore left knee.\n\n\r\n              Raptors center Jakob Poeltl missed his fifth straight game because of a sprained left ankle.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Atlanta on Friday night.\n\n\r\n              Raptors: Host Chicago on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995363.25423
}