{
  "game_id": "0021601199",
  "espn_id": "400900577",
  "date": "Apr 09, 2017",
  "matchup": "PHX vs. DAL",
  "headline": "Warren, Booker lead Suns past Mavericks, 124-111",
  "body": "PHOENIX --  When both teams went with youngsters for the second half, the Phoenix Suns knew they had an advantage over the Dallas Mavericks.\n\nThe Suns have been giving quality minutes to their rookies and younger players for months. It showed, as Phoenix turned a three-point halftime lead into a 124-111 victory Sunday night in its home finale.\n\nT.J. Warren and Devin Booker each scored 21 points, and Tyler Ulis added 20 points and 10 assists. Warren made all eight of his shots.\n\n\"You get a chance to see how much further along our young guys are compared to other teams,\" Suns coach Earl Watson said. \"The confidence, the playmaking, everyone's talking, everyone's moving, protecting the rim, and just the way we play is really so far out from guys their age.\"\n\nBooker went to the bench for good with 8:35 left in the third quarter. Booker, with a 3-pointer less than two minutes into the game, passed Kobe Bryant to move into fourth place on the NBA scoring list of players before their 21st birthday. With 2,774 career points, Booker trails Carmelo Anthony, Kevin Durant and leader LeBron James.\n\nThe Mavericks rested starters Dirk Nowitzki, Nerlens Noel and Wesley Matthews in the second half.  Yogi Ferrell and Dwight Powell led Dallas with 21 points each. Dallas has lost four straight.\n\n\"These young guys are getting experience, they're getting their brains beat in in the second halves but this is how you learn,\" Mavericks coach Rick Carlisle said.\n\nThe Suns moved to 24-57 and will finish with either the second- or third-worst record in the NBA. The Los Angeles Lakers started Sunday 24-55.\n\nPhoenix turned a three-point halftime lead into a 104-85 lead after three quarters, with Ulis scoring 15 points in the third.\n\n\"I'm happy I got my opportunity, happy I got a chance to play in these games,\" Ulis said. \"Trying to still take each one seriously even though the season is coming to an end.\"\n\nRookie Derrick Jones Jr. highlighted the fourth with a rebound dunk with 8:55 to play. Jones scored 15 points, a career high.\n\nThe Suns used a 17-0 run to go up 24-14 with 5:50 left in the first quarter. The Mavericks went through a stretch of eight straight missed shots.\n\nWarren's corner 3 with one second left in the first gave Phoenix a 40-29 lead, part of his 15 points in the opening 12 minutes.\n\nThe Suns led by as many as 16 points in the second quarter, only to see Dallas take a 56-55 lead on Nowitzki's 12-foot turnaround at the 4:55 mark. But Phoenix took a 68-65 lead into the break.\n\nBooker had 12 of his 17 first-half points in the second quarter.\n\nSuns forward Marquese Chriss limped off the court with 8:06 to play in the third quarter after a Dallas player banged into his right knee. Chriss went the bench and ice was applied to the knee, and the injury was announced as a deep bruise.\n\nChriss finished with nine points in 17 minutes. and Watson said he should be fine for the team's last game.\n\nSUNS SIGN MILLSAP\n\nThe Suns announced the signing of guard Elijah Millsap before Sunday's game.\n\nMillsap played with the Northern Arizona Suns of the D-League this season and led the team in scoring at 19.7 points per game. Millsap has 67 games of NBA experience with the Utah Jazz in 2014-15 and last season.\n\nMillsap checked into the game for the first time to start the fourth quarter and played all 12 minutes.\n\nTIP-INS\n\nMavericks: G Seth Curry did not play, missing his fifth straight game with a left shoulder injury. Carlisle said the injury is not considered serious but it will need rehab. ... Carlisle remained mum on the subject of former Dallas Cowboys QB Tony Romo being added to the roster for the home finale Tuesday, which has been reported. ... F Harrison Barnes was held out of Sunday's game to rest, but Carlisle said he'll play Tuesday in the home finale. Barnes had played all 79 games this season. \"I would have liked to see him rest a little sooner. At a certain point he was kind of hell-bent on (playing all) 82 but he's come off of that,\" Carlisle said.\n\nSuns: Watson said the Suns plan to spend a lot of time together in the offseason, and a team trip to be determined is being planned to where the players can play pickup ball against other pros. ... Phoenix is 35-14 in 49 home finales. ... Before tipoff, veteran F Jared Dudley took to a microphone to thank the crowd for their support this season and told fans that better days lie ahead for the young Suns.\n\nUP NEXT\n\nMavericks: Host Denver in the home finale Tuesday.\n\nSuns: At Sacramento in their season finale Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764995942.060629
}