{
  "game_id": "0021901317",
  "espn_id": "401224792",
  "date": "Aug 14, 2020",
  "matchup": "OKC @ LAC",
  "headline": "Mann leads Clippers over Thunder as stars rest for playoffs",
  "body": "LAKE BUENA VISTA, Fla. --  Rookie Terance Mann hit a go-ahead 3-pointer with 2:30 left in overtime and had 25 points, 14 rebounds and nine assists for the Los Angeles Clippers, who beat the Oklahoma City Thunder 107-103 Friday night in a final seeding game for both teams devoid of stars.\n\nThe Clippers rested Kawhi Leonard, Paul George and Lou Williams for the playoffs starting next week. They wrapped up the second seed in the Western Conference playoffs with a 124-111 victory over Denver on Wednesday night.\n\n\"I'm just going to go with rest tonight,\" coach Doc Rivers said before the game.\n\nMann finished an assist short of a triple-double.\n\nAt one point, he made a driving layup in OT instead of going for the 10th assist. The Clippers kept going to the free throw line late and he didn't get a chance.\n\nLeonard spoke to Mann when he was within range of the triple-double.\n\n\"That moment was awesome,\" Mann said. \"He was just telling me, `You're one assist away; don't force it but go get it.' The leadership of these guys all year has been amazing.\"\n\nThe rest of his teammates let him know, too.\n\n\"I knew probably the fourth quarter when they were all telling me,\" Mann said. \"They were like, 'Oh, you only need two more assists, one more rebound, yada yada yada. They whole bench was making it clear to me. I've been playing like that my whole life. That's what I do: rebounds, assists, score. All three.\"\n\nAmir Coffey added 21 points for the Clippers while Patrick Patterson had 17 points and 14 rebounds.\n\nAssistant Sam Cassell was the de facto coach.\n\n\"We expect the same things from our young guys that we expect from the stars of our team: play hard, play together,\" Cassell said. \"I'm coaching them hard, Doc was out there the first half, he coached them hard. Those guys did a great job doing the things we need to do to win the basketball game.\"\n\nThe Thunder played without Chris Paul (sprained left hand) and Luguentz Dort (sprained right knee).\n\nOklahoma City came into the game locked into a first-round matchup with the Houston Rockets.\n\nHamidou Diallo had 27 points and 11 rebounds and Dennis Schroder 17 points for the Thunder.\n\nMann made a free throw with 1:23 left in regulation to tie it at 87 but missed the second. The Thunder missed three field goals and Joakim Noah had a layup blocked by Devon Hall with 4.8 seconds left.\n\nTIP-INS\n\nThunder: Will be either the No. 4 or 5 seed.\n\nClippers: George put the playoffs in perspective when he said, \"Seeding doesn't really mean anything in this bubble. There's no home-court advantage.\"\n\nUP NEXT\n\nThunder: Will face Houston in the playoffs next week.\n\nClippers: Will face Dallas in the playoffs next week.",
  "source": "espn_api",
  "crawled_at": 1764996191.502877
}