{
  "game_id": "0022200987",
  "espn_id": "401469142",
  "date": "Mar 08, 2023",
  "matchup": "MIA vs. CLE",
  "headline": "Garland scores 25 points, Cavaliers hold off Heat 104-100",
  "body": "MIAMI -- — Cleveland coach J.B. Bickerstaff called it grit. Miami coach Erik Spoelstra called it disruptiveness.\n\n\r\n              Whatever it was, it worked for the Cavaliers.\n\n\r\n              Darius Garland scored 25 points, Donovan Mitchell added 18 and the Cavaliers assured themselves of a second consecutive winning season with a 104-100 victory over the Miami Heat on Wednesday night.\n\n\r\n              The Cavaliers allowed the Heat to shoot 57% in the first three quarters — then cranked up the defense and limited Miami to 29% in the fourth quarter.\n\n\r\n              “The grit and the resilience that we showed,” Bickerstaff said. “It was an ugly fourth quarter for both teams. These are two really good defenses that put you in difficult situations, forced a ton of turnovers both ways, but I thought our guys did a great job of maintaining their poise.”\n\n\r\n              Jarrett Allen had 15 points and 12 rebounds for Cleveland. Evan Mobley also scored 15 points, and Isaac Okoro had 13.\n\n\r\n              The Cavaliers (42-26) are now two wins away from matching last season’s win total, with 14 games left.\n\n\r\n              “That's a big win on the road against a tough team,” Mitchell said. “We did a lot of things well.”\n\n\r\n              Jimmy Butler had 28 points for Miami (35-32), which got 22 from Tyler Herro and 17 from Bam Adebayo.\n\n\r\n              Herro made a 3-pointer with 20.1 seconds left to get Miami within two, but the Heat — who committed a season-high 24 turnovers, leading to 29 Cleveland points — got no closer the rest of the way.\n\n\r\n              “It is extremely tough to win in this league when you have 24 turnovers,” Spoelstra said. “You have to credit them. The last six weeks, they’ve really turned up that disruptiveness.”\n\n\r\n              The teams play again in Miami on Friday night.\n\n\r\n              Kevin Love scored eight points for Miami, facing Cleveland for the first time since Nov. 13, 2013, when he was with Minnesota. Love had an immediate impact against his former club, getting Miami’s first two field goals and drawing two offensive fouls in the first 3:53.\n\n\r\n              He was with Cleveland for nine seasons, the last player left there from the 2016 NBA championship team and asked for a buyout after he fell out of the Cavaliers’ rotation. He didn’t play in his final 12 games with the club, and joined the Heat during the All-Star break last month.\n\n\r\n              “It is a very sensitive topic,” Bickerstaff said. “It’s still an emotional topic for all of us. We tried to handle it as best we possibly could, always paying Kevin his respect and the relationships that he built and what he did for this organization and this team.”\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: This is the start of four one-city, two-game stops that Cleveland has left on its schedule. The Cavs go to Charlotte Sunday and Tuesday, Brooklyn on March 21 and 23, and Orlando on April 4 and 6. “You probably want to pick your towns a little better than this one,” Bickerstaff said. ... There were 18 lead changes and six ties in the first half, none in the second half.\n\n\r\n              Heat: Miami's previous season-high for turnovers was 23, at Toronto on Nov. 16. ... PG Kyle Lowry missed his 14th consecutive game with a sore left knee, and is still hoping to play later this week — either in the rematch with Cleveland on Friday or at Orlando on Saturday.\n\n\r\n              LOVE VS. CAVS\n\n\r\n              Context on how long it had been since Love faced the Cavaliers: San Antonio’s Gregg Popovich was 12th on the coaching wins list, the Los Angeles Lakers’ LeBron James was 32nd on the NBA scoring list and Golden State’s Stephen Curry was 140th in 3-pointers made. They’re all the NBA leaders in those categories now.\n\n\r\n              BUTLER’S SCHEDULE\n\n\r\n              Butler flew to Los Angeles after Monday night’s home win over Atlanta, landing around 2 a.m. Pacific time Tuesday, and was there for the Lakers’ jersey retirement for Pau Gasol — his former Chicago teammate and close friend — that night. He flew back to Miami early Wednesday, attended shootaround in the morning and played against the Cavaliers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993928.077366
}