{
  "game_id": "0021800239",
  "espn_id": "401070920",
  "date": "Nov 19, 2018",
  "matchup": "CHA vs. BOS",
  "headline": "Walker stays hot, scores 43 as Hornets upend Celtics 117-112",
  "body": "CHARLOTTE, N.C. --  The NBA's new scoring leader was determined his latest big night wouldn't go to waste.\n\nKemba Walker scored 43 points, giving him 103 in his last two games, and the Charlotte Hornets battled back to beat the Boston Celtics 117-112 on Monday night.\n\nWalker followed up his NBA season-best, 60-point effort in an overtime loss to the 76ers on Saturday night with another spectacular performance. He scored 21 points in the fourth quarter and made 14 of 25 shots overall, including seven more 3-pointers.\n\nHe finished 7 of 10 from the floor with four 3-pointers in the fourth quarter as Charlotte erased a 10-point deficit to pull even at 8-8 on the season.\n\n\"I just wanted to win, man,\" Walker said. \"I wanted to win a close game. We've been in every game for the most part. There's a couple we haven't been in but you know things just haven't been going our way in those situations and tonight it did and it felt good.\"\n\nWalker passed Golden State's guard Stephen Curry to take over the NBA scoring lead at 29.6 points per game.\n\nWalker also passed the injured Curry for the league lead in 3-pointers made with 65.\n\n\"It means a lot but it's still the early season,\" Walker said. \"I would've never, ever in my life thought I would be that high up in the rankings as far as scoring in the NBA. But I'm going to try to keep it up, do what I can to win games.\"\n\nWalker outdueled Boston's Kyrie Irving, who finished with 27 points and 11 assists.\n\nJeremy Lamb had 18 points and Willy Hernangomez added 14 as the Hornets beat the Celtics for the first time in eight tries.\n\nThe Celtics entered the fourth quarter leading 87-84 and quickly stretched the lead to double digits behind Irving, who scored and was fouled on a drive.\n\nBut Walker refused to lose this time.\n\nThe two-time All-Star simply took over, scoring on drives, midrange jumpers and from long distance. He scored 11 straight points in one stretch, including a 3-pointer from the right wing and a nifty Euro step move through the lane.\n\n\"He's been unbelievable, especially when your whole game plan is to stop him and he is still going off and doing what he does,\" said Celtics forward Gordon Hayward. \"He's an unbelievable player.\"\n\nIt was Walker who delivered the knockout punch with a clutch 3 from 27 feet away with 32 seconds left, bringing fans to their feet and putting the Hornets up by six. Irving missed two open 3s down the stretch and the Hornets escaped with the win to pull even at .500.\n\nAfter one big shot, a pumped-up Walker screamed \"This is my city!\"\n\n\"We were looking for another 60 but I think 43 will do tonight,\" joked Hornets coach James Borrego. \"He's incredible. This is a special player, a special performance and a special start to an NBA season.\"\n\nTIP-INS\n\nCeltics: Jayson Tatum finished with 18 points and six rebounds. ... Finished 9 of 32 from 3-point range.\n\nHornets: Nic Batum continued to struggle with his shot in the early going, missing his first four attempts before knocking down a pair of 3-pointers. Batum, who failed to score against the 76ers, had nine points. ... Malik Monk has missed his last 16 3-point attempts and didn't play in the second half.\n\nHAYWARD OFF THE BENCH\n\nAron Baynes got the start over Hayward at forward for Boston. The change didn't matter all that much as both were 1 of 4 from the field in the first half.\n\n\"I'm OK with whatever I can do to help us win,\" Hayward said. \"Right now, I just have to focus on myself and getting myself better and being a better basketball player.\"\n\nCoach Brad Stevens said it was more about getting Hayward in the right group, adding that \"we're probably not done tweaking the lineups.\"\n\nPARKER'S BIG CONTRIBUTION\n\nEighteen-year NBA veteran Tony Parker only had seven points, but made two clutch midrange jumpers in the final 2 minutes for the Hornets.\n\nThose possessions allowed Walker to play off the ball for a few possessions.\n\n\"Having Tony on the floor with him tonight allowed (Walker) to move off of the ball and that's what we try to do,\" Borrego said. \"We try to mix it up on them so they don't get locked in on his pick-and-roll. That's our job, to move him around and disguise him as much as we can.\"\n\nUP NEXT\n\nCeltics: Host Knicks on Wednesday night.\n\nHornets: Host Pacers on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994427.503227
}