{
  "game_id": "0021800033",
  "espn_id": "401070716",
  "date": "Oct 20, 2018",
  "matchup": "PHX @ DEN",
  "headline": "Jokic's triple-double leads Nuggets past Suns 119-91",
  "body": "DENVER --  On a historic night in which he was serenaded with \"MVP!\" chants for his eye-popping triple-double, Nikola Jokic's thoughts were with the Denver Nuggets' injured tone-setter.\n\nForward Will Barton will go for an MRI on Sunday morning after injuring his right hip on a reverse layup in the third quarter of Denver's 119-91 win over the Phoenix Suns on Saturday night.\n\n\"We're going to miss him -- a lot,\" Jokic said. \"Not just on the court, just vocally. He's a guy who can speak with everybody, with the coach, he can say whatever. He doesn't have that `hair on the tongue' is how we call it in Serbia.\n\n\"Hopefully he can be back soon.\"\n\nPaul Millsap called Barton \"the voice of this locker room.\"\n\n\"He's the one that's talking before games, he's the one that's bringing us together,\" Millsap said. \"It's going to be tough to lose that, if we have to. But hopefully, we're going to pray everything's OK and he's back with us soon.\"\n\nBarton, who had 14 points in 19 minutes before being wheeled off, said he felt something pop when he took off for the basket and was still sore, but in much less pain, after the game.\n\n\"I'll just wait for the MRI,\" Barton said. \"I don't want to predict anything or get to high or too low, just once I find out, take it from there.\"\n\nJokic, who had 11 assists and 12 rebounds, joined Wilt Chamberlain as the only players in NBA history to post a triple-double with 30 or more points without missing a field goal. Chamberlain did it twice, in 1966 and `67.\n\n\"He had one of those nights tonight,\" Nuggets coach Michael Malone said. \"He missed one shot tonight, from the foul line. And anytime you're mentioned in company with Wilt Chamberlain, you're doing something right.\"\n\nJokic made all 11 of his shots from the floor and missed just one of 11 free throws on a night the crowd serenaded him with chants of \"MVP! MVP!\"\n\n\"Individually and collectively we got spanked in every aspect of the game,\" Suns coach Igor Kokoskov said. \"Jokic had a monster game.\"\n\nJokic also had four steals, zero turnovers and a blocked shot.\n\n\"It was a perfect night for him,\" Jamal Murray said. \"He hit every shot today, no turnovers, triple-double. So, it couldn't get any better.\"\n\nSave for the one missed free throw.\n\nCO-STARS\n\nMurray added 26 points as Denver's starters outscored Phoenix's 107-58.\n\nThe Nuggets are off to their first 2-0 start since 2011-12 and will go for their first 3-0 start since 2009-10 when they host the two-time defending NBA champion Golden State Warriors on Sunday night.\n\nNO MATCH\n\nDevin Booker's 25 points led the Suns, who were hoping for another stellar game from top overall draft pick Deandre Ayton, who had 18 points, 10 rebounds and six assists in his po debut against Dallas. But Jokic dominated from the start and Ayton never got going, finishing with 5 points on 2-of-7 shooting.\n\n\"It was a learning lesson for me,\" Ayton said of his matchup with Jokic. \"In time I'm going to be doing the same thing.\"\n\nMillsap said Jokic's play was inspiring on both ends of the court.\n\n\"It's great. We all eat off him. He feeds us all (when) the offense is clicking,\" Millsap said. \"But most importantly, the job he did on the defensive end was important for us.\"\n\nTIP-INS:\n\nSuns: Phoenix was without G Troy Daniels, who sustained a concussion at practice. \"It was a contact practice, guys were scrimmaging and it happened right in front of me,\" Kokoskov said. \"It didn't look that hard but he didn't pass the test.\"\n\nNuggets: Denver was 31-10 at home last season, fourth-best in the NBA. ... Murray tried to get too fancy on a steal and layup and was stripped when he tried to go behind his back before scoring. ... Torey Craig's defensive versatility will be called upon if Barton misses much time.\n\nUP NEXT\n\nSuns: visit Golden State Warriors on Monday night.\n\nNuggets: host Golden State Warriors on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Arnie Melendrez Stapleton on Twitter: http://twitter.com/arniestapleton",
  "source": "espn_api",
  "crawled_at": 1764995109.5028448
}