{
  "game_id": "0021600246",
  "espn_id": "400899696",
  "date": "Nov 27, 2016",
  "matchup": "PHX vs. DEN",
  "headline": "Suns' rally falls short, Nuggets win 120-114",
  "body": "PHOENIX --  Poise down the stretch has not always been a virtue of the Denver Nuggets.\n\nIt certainly was Sunday.\n\nIt seemed that every time Phoenix pulled close, Denver's Wilson Chandler or Jameer Nelson would make a big shot and the Nuggets held on for a 120-114 victory.\n\n\"I am pretty cool all the time. That is just my demeanor, always laid back,\" Chandler said. \"I don't really think about it (taking and making a big shot). It is just another shot, if I miss it or if I make it.\"\n\nChandler scored 25 points and Nelson 21.\n\n\"The fourth quarter we showed a lot of poise down the stretch,\" Denver coach Michael Malone said. \"Guys stepped up and made big plays, made big free throws and we also got the ball inbounds, which has been an issue sometimes this year.\"\n\nDenver withstood an impressive second-half scoring onslaught by Suns guards Eric Bledsoe and Devin Booker.\n\nBledsoe led Phoenix with a career-high 35 points, 21 in the second half. Booker added 30, 25 in the last two quarters.\n\nCoach Earl Watson benched Marquease Chriss to start the second half after the 19-year-old rookie drew a technical foul from the bench in the first half.\n\n\"Bench T's put you on the bench in the second half,\" Watson said. \"It's a teachable moment, it's an accountable moment. But he'll learn. He knows I love him. He'll learn.\"\n\nWith Alex Len replacing Chriss, the Suns had a big lineup and it worked.\n\nThe Nuggets led by 20 at the half but Booker and Bledsoe led a rally that cut the lead to three early in the fourth quarter.\n\nDenver gained a slightly larger cushion from there before the Suns cut it to four in the final minute but could get no closer.\n\nEmmanuel Mudiay added 19 points for the Nuggets.\n\nThe Nuggets used a 16-point outburst that started late in the first quarter and extended well into the second to build their 20-point advantage. They outscored the Suns 34-15 in the second quarter to lead 53-33 at the break.\n\nBledsoe and Booker brought the Suns almost all the way back.\n\nFour consecutive Phoenix 3-pointers -- two by Booker, one by Bledsoe and one by P.J. Tucker -- cut the lead to 80-76, and five straight points by Brandon Knight -- a three-point play and two free throws -- sliced the Denver it to 86-83 with 10:49 to play.\n\nThe Nuggets scored the next eight points, including 3s by Chandler and Jamal Murray, lifted the visitors out of trouble. But Phoenix managed one more threat.\n\nBooker's driving layup down the lane cut it to 114-110 with 38.4 to play. The teams traded a pair of free throws to make it 116-112 with 12.4 seconds left before Murray sealed it with two from the line.\n\n\"It is very disappointing,\" Bledsoe said. \"At the same time, we came out the second half and played like we are supposed to play.\"\n\nBLEDSOE'S STREAK\n\nBledsoe is on a roll. The Phoenix point guard had his streak of outstanding performances grow to five. Going into the game, he had averaged 23.8 points, 7.3 rebounds, 6.8 assists and 1.5 steals in his previous four games.\n\nHis previous career high was 34 against Houston on March 21, 2015. Bledsoe has 10 career games scoring at least 30, including a 31-point effort at Portland this season.\n\nTIP-INS\n\nNuggets: Denver has beaten Phoenix four times in a row. ... Chandler and Nelson were a combined 7 of 13 on 3s, one or the other of them consistently sinking one from long-range when Phoenix crept close. ... Danilo Gallinari missed his third straight game with right thigh soreness.\n\nSuns: Booker has 10 career 30-point games, four this season. ... Jared Dudley missed the game with left foot soreness, T.J. Warren due to a \"mild\" head injury. ... Bledsoe had a 30-point game against the Nuggets last Nov. 14. ... Phoenix had held three of its previous five opponents under 100 points after allowing 100 or more in its first 12 contests.\n\nUP NEXT\n\nNuggets: Return home to face Miami on Wednesday night.\n\nSuns: Wrap up a three-game home stand against Atlanta on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764996000.2328498
}