{
  "game_id": "0021800958",
  "espn_id": "401071631",
  "date": "Mar 04, 2019",
  "matchup": "LAL vs. LAC",
  "headline": "Gallinari gets 23, Clips hold off slumping Lakers 113-105",
  "body": "LOS ANGELES --  The Los Angeles Clippers are rolling toward a playoff berth, even after a thorough upheaval over the past two years.\n\nLeBron James and the injury-riddled Los Angeles Lakers weren't much of an obstacle when two teams going in opposite directions passed each other in the Staples Center hallway they share.\n\nDanilo Gallinari scored 23 points, Lou Williams added 21 and the Clippers dealt another blow to the Lakers' fading playoff hopes with a 113-105 victory Monday night.\n\n\"That doesn't bother me or make me happy,\" Clippers coach Doc Rivers said of beating their fellow Angelenos. \"I just want us to do well.\"\n\nThe Clippers did splendidly, despite the odds against them. Although they have broken up their successful core and further stripped the roster with several recent trades, they're still on target for a playoff return. Rivers dismissed the notion of tanking before the game: \"I don't know that word,\" he said.\n\nGallinari led six Clippers scoring in double figures while they comfortably maintained a lead over their co-tenants down the stretch of their latest rivalry meeting. James and his few healthy teammates never threatened late as the Clippers (37-29) took sole possession of seventh place in the Western Conference standings with their sixth win in eight games.\n\n\"This is a critical time to win games, and we're locked in,\" Williams said. \"Tonight I felt particularly good about our focus.\"\n\nJames scored 27 points and Rajon Rondo had his 32nd career triple-double, but the Lakers took their ninth loss in 12 games since they beat the Clippers on Jan. 31.\n\nWhile the Clippers' playoff run is a pleasant surprise for their fans, the Lakers (30-34) dearly want to reach the postseason after a five-year absence.\n\nInstead, the 16-time NBA champions have all but fallen apart in February and March. The Lakers are in 10th place in the West, sitting 5 1/2 games behind San Antonio for the final playoff spot with 18 to play.\n\n\"You keep playing to the end and see what happens,\" James said. \"I've been talking about it for a while now. Everyone has been talking about the postseason, (but) we should be worried about each and every game and how we can continue to get better with our process and get better with our team.\"\n\nTwo days after an embarrassing road loss to NBA-worst Phoenix put a huge dent in their playoff chances, the Lakers played without forward Brandon Ingram, who developed right shoulder soreness after the morning shootaround. Ingram had played in 50 straight games, averaging 18.3 points and 5.1 rebounds in a strong first season alongside James.\n\nLonzo Ball was already out with his long-term ankle injury, leaving James without his two most important teammates. Kyle Kuzma then scored 13 points before he limped off the floor with an apparent ankle injury with 6:04 to play, and coach Luke Walton said he \"would be surprised\" if Kuzma's injury doesn't force him to miss the Lakers' next game.\n\nTIP-INS\n\nClippers: Luc Mbah a Moute warmed up before the game, but wasn't quite ready to return from the left knee injury that has kept him out for 61 games since Oct. 23. Wilson Chandler (strained right quadriceps) also sat out. ... The 6-foot-1 Williams drove the paint and dunked in the first quarter.\n\nLakers: Lance Stephenson (sprained toe) and Tyson Chandler (stiff neck) didn't play. ... Ball missed his 17th straight game with a sprained left ankle and bone bruise. He will be re-evaluated this week. ... LA Galaxy greats Zlatan Ibrahimovic and Robbie Keane watched the game at courtside.\n\nZU BACK\n\nIvica Zubac started for the Clippers and finished with seven points against the Lakers, who drafted the Croatian 7-footer in the second round in 2016 and fostered his development until trading him last month for Mike Muscala, who had six points for the Lakers. \"It was weird to go against guys I used to play with,\" Zubac said.\n\nRONDO FOR 3\n\nRondo had a season-high 24 points, 12 assists and 10 rebounds. The veteran point guard broke his tie with John Havlicek to take sole possession of 11th place in NBA history with 32 triple-doubles. Rondo and Mark Jackson are the only players to record a triple-double with five different teams.\n\nSHIFTING TIDES\n\nAlthough the Lakers still have an enormous overall lead in this rivalry, the Clippers have won the season series in each of the past six years. The Clippers have taken two of three heading into the final meeting this season on April 5.\n\nUP NEXT\n\nClippers: Host the Oklahoma City Thunder on Friday.\n\nLakers: Host the Denver Nuggets on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994328.208298
}