{
  "game_id": "401809506",
  "espn_id": "401809506",
  "date": "Oct 31, 2025",
  "matchup": "MEM vs LAL",
  "headline": "Doncic returns after 3-game absence, scores 44 to lead Lakers past Grizzlies 117-112",
  "body": "MEMPHIS, Tenn. -- — Luka Doncic had 44 points, 12 rebounds and six assists in his return after a three-game absence and the Los Angeles Lakers beat the Memphis Grizzlies 117-112 on Friday night in the opening game of the NBA Cup for each team.\n\n\r\n              Austin Reaves added 21 points for the Lakers and Jake LaRavia scored 13. It was Doncic's 11th straight games of scoring at least 25 against the Grizzlies.\n\n\r\n              Jock Landale and Jaylen Wells scored 16 points each to lead Memphis and Jaren Jackson Jr. finished with 15 points. Ja Morant was held to eight points — going 3 of 14 from the field — and seven assists. \n\n\r\n              The Lakers continued to play without LeBron James, who is dealing with right sciatica. But Doncic, who missed the last three games with a left finger sprain and a lower left leg contusion, returned to the starting lineup.\n\n\r\n              Both teams had significant runs before it settled into a closely played game. Memphis' rally came in the second quarter and the Lakers answered it in the third before pulling away in the fourth.\n\n\r\n              The Grizzlies built a double-digit lead in the second quarter while scoring 42 points, including a 27-4 rally in the closing minutes of the half. That gave them a 69-55 lead at the break.\n\n\r\n              But the Lakers with Doncic controlling the offense, sliced away at the Memphis advantage in the second half, erasing the deficit in the first seven minutes of the third. That led to an exchange of leads as Doncic had 16 in the quarter.\n\n\r\n              Entering the fourth, there had been 14 lead changes and seven ties.\n\n\r\n              Up next\r\n              Lakers: Host Miami on Sunday.\n\n\r\n              Grizzlies: Visit Toronto on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042535.7370949
}