{
  "game_id": "0022401230",
  "espn_id": "401734907",
  "date": "Dec 14, 2024",
  "matchup": "HOU @ OKC",
  "headline": "Gilgeous-Alexander scores 32 points to lead Thunder past Rockets 111-96 and into NBA Cup Final",
  "body": "LAS VEGAS -- — Shai Gilgeous-Alexander scored 20 of his 32 points in the second half, and the Oklahoma City Thunder pulled away late Saturday night to defeat the Houston Rockets 111-96 and advance to the NBA Cup championship.\n\n\r\n              The Thunder take a five-game winning streak into Tuesday night's final against the Bucks. Milwaukee defeated the Atlanta Hawks 110-102 in the Eastern Conference semifinal. The title game does not count in the league standings.\n\n\r\n              Isaiah Hartenstein added 21 points for the Thunder, Jalen Williams scored 20 and Luguentz Dort finished with 19 points and nine rebounds.\n\n\r\n              Amen Thompson led Houston with 19 points, one of six Rockets in double figures, and Alperen Sengun had 13 points and 11 rebounds.\n\n\r\n              The Rockets and Thunder have two of the three best records in the Western Conference, making Saturday's second semifinal a potential playoff preview.\n\n\r\n              Takeaways\r\n              Rockets: Fred VanVleet's 3-point shooting woes continued. He made 6 of 29 in his previous three games and missed his first nine shots from 3 and finished 1 of 11 against OKC.\n\n\r\n              Thunder: Gilgeous-Alexander entered this game averaging 30.2 points and shooting 51.5% but struggled to find his offensive game early. He found a way to get to the free throw line, making 14 of 15 to help surpass his season average.\n\n\r\n              Key moment\r\n              Oklahoma City went on a 13-3 run to go ahead 97-82 with 4:57 left and break open what was a close game.\n\n\r\n              Key stat\r\n              The Thunder scored 70 points in the second half. That second-half surge enabled Oklahoma City to turn a 42-41 halftime deficit into a fairly easy victory.\n\n\r\n              Up next\r\n              The Thunder will play Milwaukee in Tuesday’s championship game before returning to regular season play on Thursday at Orlando. The Rockets also return to regular season play on Thursday against New Orleans.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997395.175771
}