{
  "game_id": "0021800807",
  "espn_id": "401071480",
  "date": "Feb 06, 2019",
  "matchup": "CHA @ DAL",
  "headline": "Mavericks top Hornets 99-93 as Dallas deals Barnes to Kings",
  "body": "DALLAS --  Harrison Barnes stayed on the bench in the fourth quarter after news broke that the Dallas Mavericks forward had been traded to Sacramento.\n\nThe seventh-year player lingered on the floor a few extra moments after the game to chat up some Charlotte opponents, then walked through a throng of fans who seemed to want to say goodbye after seeing all the social media activity on their phones during the second half.\n\nThe makeover of the Mavericks continued even as parts of the blockbuster trade that brought Kristaps Porzingis from the New York Knicks were making their Dallas debuts. Porzingis isn't playing this season as he recovers from a knee injury.\n\nRookie sensation Luka Doncic scored 19 points in his third triple-double, Dorian Finney-Smith had 15 points and 10 rebounds and the Mavericks made another move by dealing Barnes while beating the Hornets 99-93 on Wednesday night.\n\n\"That's really the first time I've witnessed it,\" Hornets forward Nicolas Batum said of seeing someone traded during a game. \"During practice, on the plane, bus, stuff like that, yes, that happened to me. But during the game? I have not witnessed that being live.\"\n\nLeBron James of the Lakers blasted the move in an Instagram post late Wednesday.\n\n\"So let me guess this is cool cause they had to do what was best for the franchise right???\" James wrote. \"Traded this man while he was literally playing in the game and had ZERO idea.\"\n\nTim Hardaway Jr. scored 12 points in his first game since leaving the Knicks. Trey Burke went scoreless in four minutes while Courtney Lee didn't play.\n\nBarnes, who was traded for Kings forwards Zach Randolph and Justin Jackson, played most of the third quarter before reports of the deal surfaced, scoring seven of his 10 points. He wasn't available in the locker room after the game.\n\nDirk Nowitzki started realizing something was up when Barnes didn't replace him early in the fourth quarter as usual with the 40-year-old playing a limited role in his record 21st season with the same franchise.\n\nSince Nowitzki credited Barnes for being a positive influence in his two-plus seasons with the Mavericks, he wasn't surprised that Barnes stuck around after word of the trade got out.\n\n\"He's a better man than me,\" said Nowitzki, who scored eight points. \"Everybody else would have bounced out. He's just a genuinely good dude and he's obviously got bonds with some of these players here for life. That's the kind of guy he is.\"\n\nKemba Walker had 30 points and a season-high 11 rebounds for the Hornets, who got swept by Dallas after losing to the Mavericks by 38 points at home about a month ago.\n\nWith NBA Commissioner Adam Silver watching from not far behind the Mavericks bench, Doncic had a spinning layup for a 3-point play with Dallas leading by two and answered a bucket by Batum with a 3 to push the lead to six.\n\nThe first teenager with multiple triple-doubles, Doncic had 11 assists and 10 rebounds on a rough shooting night (5 of 20, including 2 of 10 from 3-point range).\n\nBatum, who finished with 14 points, got the Hornets within three with a 3-pointer before Finney-Smith answered from long range for a 97-91 lead in his second career double-double.\n\nTIP-INS\n\nHornets: G Tony Parker was out with a back strain in what would have been his first appearance in Dallas since leaving San Antonio after 17 seasons with the rival Spurs. ... Jeremy Lamb scored 15 points, and Cody Zeller had 13 rebounds with nine points. ... Batum was just 2 of 9 from 3-point range as the Hornets shot 24 percent from beyond the arc.\n\nMavericks: After setting franchise record for 3s in a quarter by going 10 of 17 from long range in the first quarter of the meeting in Charlotte, the Mavericks missed their first 10 before Hardaway and Doncic hit consecutive 3s in the final 1:11 of the first. ... All of Doncic's triple-doubles have come in the past seven games. ... Dwight Powell had his second double-double with 11 points and 12 rebounds. ... As part of the Sacramento trade, Dallas waived C Salah Mejri.\n\nCOMING AND GOING\n\nAfter trying to figure out how to incorporate three new guards into his rotation, and only using two, Mavericks coach Rick Carlisle has a couple of forwards coming in with Randolph and Jackson.\n\n\"With this trade now, a lot of things are in play,\" Carlisle said. \"Everything is going to bump a little here and a little there. I have to let the dust settle and figure out who the hell is going to start.\"\n\nUP NEXT\n\nHornets: Second stop on a four-game trip at Atlanta on Saturday.\n\nMavericks: Second of three straight at home against Milwaukee on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994370.562707
}