{
  "game_id": "0022400159",
  "espn_id": "401704725",
  "date": "Nov 04, 2024",
  "matchup": "MIA vs. SAC",
  "headline": "Sabonis' putback with less than a second left lifts Kings past Heat, 111-110",
  "body": "MIAMI -- — Domantas Sabonis scored off an offensive rebound with 0.7 seconds left, and the Sacramento Kings rallied from 15 points down to beat the Miami Heat 111-110 on Monday night.\n\n\r\n              DeAaron Fox scored 28 for Sacramento, while DeMar DeRozan finished with 26. Sabonis — who grabbed Fox's miss in the final moments and made the game's final basket — finished with 16 points, 16 rebounds and seven assists.\n\n\r\n              Jimmy Butler scored 15 of his 27 points in the fourth quarter and Tyler Herro added 27 for the Heat. Bam Adebayo — on the night his Olympic gold medal banner was unfurled — scored 16 for Miami, which got 13 from rookie Pelle Larsson.\n\n\r\n              Terry Rozier's 30-footer at the buzzer missed for the Heat, who were 7 for 12 from the foul line in the fourth. Sacramento improved to 6-31 all-time at Miami.\n\n\r\n              Takeaways\r\n              Kings: Sacramento was without Kevin Huerter (illness). He took part in the team's morning shootaround but remained at the team hotel for the game. Keon Ellis started in his place.\n\n\r\n              Heat: Kevin Love was back on the bench after being away for the first five games while dealing with a personal matter. He did not play, and Miami was also without Jaime Jaquez Jr. (gastroenteritis).\n\n\r\n              Key moment\r\n              Miami was up by five with 1:11 left when DeRozan got a four-point play that started a game-ending 8-2 Kings run.\n\n\r\n              Key stat\r\n              The Heat led by 15 early in the third but were outscored 37-17 in that quarter. They've been outscored 137-71 in four third quarters at home this season. They've been outscored by 20 or more points in third quarters eight times in 1,119 games at their current home arena — twice this season. \n\n\r\n              Up next\r\n              Sacramento hosts Toronto on Wednesday. Miami opens a six-game road trip in Phoenix on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996937.030695
}