{
  "game_id": "0022200618",
  "espn_id": "401468773",
  "date": "Jan 11, 2023",
  "matchup": "DET vs. MIN",
  "headline": "Bey, Bogdanovic lead shorthanded Pistons past Timberwolves",
  "body": "DETROIT -- — Saddiq Bey scored 31 points and the Detroit Pistons rallied to beat the Minnesota Timberwolves 135-118 on Wednesday night.\n\n\r\n              Bojan Bogdanovic added 27 points for the shorthanded Pistons, who were down 10-0 in the first three minutes. Four other players had at least 13 points, one night after a 147-116 loss in Philadelphia.\n\n\r\n              “I didn't know if we would win tonight, but I knew we would come out and play hard,\" Pistons coach Dwane Casey said. “This is a very resilient group of young men, and we felt we would have better matchups tonight.”\n\n\r\n              Anthony Edwards scored 20 for Minnesota, which had won four straight since a 116-104 loss to Detroit on New Year's Eve. D'Angelo Russell added 19 and Rudy Gobert had 16 points and 14 rebounds.\n\n\r\n              “There was zero defensive impact all night,” Minnesota coach Chris Finch said. “We didn't do anything to make them uncomfortable. They put 135 on the board, had at least 31 points in every quarter, and shot 60% from the floor and 53% on 3s.”\n\n\r\n              The Pistons were without three rotation post players: Marvin Bagley III (hand), Jalen Duran (ankle) and Isaiah Stewart (shoulder). That left Nerlens Noel, who had played in only nine of Detroit's first 45 games, as the starting center against Gobert.\n\n\r\n              Noel only scored two points in 21 minutes, but blocked four shots in the third quarter.\n\n\r\n              “I thought Nerlens changed the game defensively,” Casey said. “His shot-blocking presence at the rim gave us an opportunity to get out on a break and score some points with our defense.”\n\n\r\n              Minnesota was also missing a key big man in Karl-Anthony Towns (calf).\n\n\r\n              Edwards missed the third quarter with hip soreness and Russell picked up two fouls early in the period, sending him to the bench with four. Without them, Minnesota struggled at both ends of the floor, allowing the Pistons to take a 94-81 lead with three minutes left in the period.\n\n\r\n              “I thought Nerlens brought energy to the whole team in the third quarter,” said Jaden Ivey, who had 18 points and eight assists. “We started playing our brand of basketball, which was getting out on the break and making sure everyone was getting a touch of the ball.”\n\n\r\n              The Pistons outscored Minnesota 36-23 in the third to take a 101-87 lead. Edwards returned for the fourth, scoring 15 points, but Detroit was never threatened.\n\n\r\n              “They told me he wasn't going to be able to return and then they said he was good to go, so we got him back on the floor,” Finch said. “I don't know how much it is hurting him — you'd have to ask him that.”\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Taurean Prince had nine points in 27 minutes despite limping off the floor in the first half after stepping on Noel's foot and rolling his ankle.\n\n\r\n              Pistons: Detroit scored a season-high 67 points on jumpers: 51 on 3-pointers and 16 on long 2-pointers.\n\n\r\n              SMALL BALL\n\n\r\n              Detroit pulled away in the second half with a lineup that, at times, had 6-foot-7 Kevin Knox II and 6-foot-5 Hamadou Diallo playing center against the 7-foot-1 Gobert. Diallo was giving up 8 inches and 64 pounds to Gobert.\n\n\r\n              “We know how much he can impact a game with his energy and athleticism, but tonight he showed great discipline to play all over the floor,” Casey said of Diallo, who scored 18 points in 26 minutes before fouling out. “We were asking him to go up against Gobert and play the screen and roll. He did a heck of a job.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host the Phoenix Suns on Friday.\n\n\r\n              Pistons: Host the New Orleans Pelicans on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995266.82225
}