{
  "game_id": "0022000587",
  "espn_id": "401307370",
  "date": "Mar 13, 2021",
  "matchup": "BKN vs. DET",
  "headline": "Harden has triple-double, carries Nets over Pistons 100-95",
  "body": "NEW YORK -- — James Harden scored 12 of his 24 points in the fourth quarter and had his ninth triple-double with the Nets to help Brooklyn beat the Detroit Pistons 100-95 on Saturday night.\n\n\r\n                    Harden also added 10 rebounds and 10 assists in his 55th triple-double as Brooklyn improved to 26-13 with its 12th win in its last 16 games.\n\n\r\n                    “I play the game the right way,” Harden said, “and hopefully good things happen for me.”\n\n\r\n                    Kyrie Irving added 18 points and Landry Shamet had 15 off the bench. DeAndre Jordan chipped in with 14 and Joe Harris contributed 10 points.\n\n\r\n                    Whereas the Nets rolling, the Pistons are stuck in neutral.\n\n\r\n                    “We want to win these types of games,\" said Delon Wright, who finished with 13. Jerami Grant scored 22 points as Detroit fell to 10-28. Saddiq Bey chipped in with 13. Mason Plumlee added 11 and Rodney McGruder had 10.\n\n\r\n                    “It's a good thing that we're staying close in these games,” Wright said.\n\n\r\n                    The second of three regular-season matchups between the Eastern Conference teams was Brooklyn’s chance to get even for its 122-111 loss in Detroit on Feb. 9. That loss was part of a stretch in which the Nets dropped three of four.\n\n\r\n                    Thirteen games later, the Nets have jelled into a legitimate championship contender while Detroit has myriad weaknesses, such as 3-point shooting. \n\n\r\n                    After Wayne Ellington knocked down a 3 about 2 1/2 minutes into the game, the Pistons missed 19 straight 3-point attempts until Wright’s straightaway attempt from 26 feet out 4:42 into the third quarter ended the drought.\n\n\r\n                    “We have to make shots,” Wright said. “We got good looks so that's a good thing. We just have to knock them down.”\n\n\r\n                    The Nets only had 61-60 lead after Grant’s layup with 4:31 left in the third, but then ended the quarter on a 17-6 run.\n\n\r\n                    But the Pistons would not go away. Detroit outscored Brooklyn 25-12 over the first 9:01 of the fourth quarter to take a 91-90 lead on Plumlee’s putback dunk. \n\n\r\n                    “We have a chance to to extend the lead,” Wright said. “We didn't just come away with it.”\n\n\r\n                    Harden made two free throws which allowed Brooklyn to regain the lead and after Plumlee tied the game with a made free throw of his own, Harden connected on a layup and a floater on consecutive possessions.\n\n\r\n                    Bey made one of two free throws to cut Brooklyn’s lead to 96-93 but Harden's floater extended the advantage to five. After Detroit sliced the deficit to 98-95 on Plumlee's layup, Harden knocked down two free throws to put away the game.\n\n\r\n                    “We're more than capable of winning basketball games different ways,” Harden said. “We can be a team that's making shots and everything is going smooth or we can be a team that (has to) get down and do the dirty work. ...We held them to 95 (points). That's great defense. Our shot wasn't falling but we found a way to win. I think that's going to be key going into the postseason because everything isn't going to be sweet.”\n\n\r\n                    TIP-INS:\n\n\r\n                    Pistons: Before the game, Detroit formally announced the acquisition of Hamidou Diallo in a trade with Oklahoma City for Svi Mykhailiuk and a future second-round pick. Diallo, 22 is averaging 11.9 points on 48.1% shooting from the field in 32 games this season “He’s a wing defender,” Pistons coach Dwane Casey said. “He can guard one through three, four, the smaller fours. He’s an excellent wing runner. Quick, athletic, probably one of the most athletic wings in the league.”\n\n\r\n                    NETS: Brooklyn has won 19 of 26 games following the four-team blockbuster trade on Jan. 14 in which the Nets acquired Harden. “The wins speak for themselves but moreso the look and feel (of the team). It feels better,\" coach Steve Nash said. \"The care. The fight. The togetherness, connectivity. All those things.” \n\n\r\n                    UP NEXT:\n\n\r\n                    Pistons: Hosts San Antonio on Monday night.\n\n\r\n                    Nets: Host the Knicks on Monday in the second of matchups between the two New York City-based franchises.",
  "source": "espn_api",
  "crawled_at": 1764997491.8601868
}