{
  "game_id": "0021801008",
  "espn_id": "401071681",
  "date": "Mar 12, 2019",
  "matchup": "CLE @ PHI",
  "headline": "Simmons, Sixers survive scare from short-handed Cavaliers",
  "body": "PHILADELPHIA --  Asked to assess his overall performance, Joel Embiid said he was \"trash.\"\n\nWhen the Philadelphia 76ers needed him the most, however, their All-Star center came to play.\n\nBen Simmons scored 26 points, Embiid had 19 rebounds and made some big plays down the stretch, and the 76ers held off the Cleveland Cavaliers 106-99 on Tuesday night.\n\n\"Myself and Jo, we take a lot of responsibility to try to get the team going, whether it's with energy or defense,\" Simmons said. \"Jo did a great job on the defensive end.\"\n\nCollin Sexton led the Cavaliers with 26 points, including a layup with 3:10 left that pulled Cleveland within one. Cedi Osman added 18 and put the Cavs ahead 97-96 with under 3 minutes to go as boos rained down in Philly.\n\nBut Mike Scott responded with a 3-pointer to put the 76ers back ahead. And after Simmons made a free throw and Jordan Clarkson a layup for Cleveland, Embiid followed his own miss with a thunderous dunk to give the Sixers a 102-99 lead with under a minute left.\n\nEmbiid, playing in his second game after missing eight straight with a sore left knee, had a block on the other end and then made four consecutive free throws to seal the win as \"MVP! MVP!\" chants replaced the boos.\n\nEmbiid and JJ Redick finished with 17 points apiece. Simmons added 10 rebounds and eight assists.\n\n\"We're just getting back in the flow,\" Embiid said. \"By playoff time, we'll be back to normal.\"\n\nOne night removed from a surprising 25-point win over second-place Toronto, Cleveland, owner of the third-worst record in the NBA, put a big scare into the third-place team in the East.\n\nAfter shooting just 22 percent from the field in the first quarter to fall behind 24-12, the Cavs took a 38-37 lead midway through the second quarter on two straight 3-pointers by Osman. Playing against one of the league's worst defenses, the Sixers had 21 turnovers, including 14 in the first half.\n\n\"We did a lot of damage ourselves in terms of the turnover,\" Simmons said. \"At the same time, they had the energy, which we were lacking a little bit.\"\n\nBoth teams gave key players planned days of rest: Jimmy Butler for Philadelphia and Kevin Love for Cleveland. Besides Love, the Cavs were also missing, among others, Marquese Chriss (suspension), Tristan Thompson (foot), Matthew Dellavedova (concussion) and Larry Nance Jr. (ribs).\n\n\"I think we're moving in the right direction,\" Cleveland coach Larry Drew said. \"Playing against two tough teams, as we have the last couple of nights, and competing at the level that we've been able to compete at, I think it says a lot about the team.\"\n\nTIP-INS\n\nCavaliers: Former Sixer Nik Stauskas had nine points off the bench, hitting two straight 3-pointers in the second quarter. . Cleveland surprised the Sixers during its last trip to Philly, notching a 121-112 win in November.\n\n76ers: Zhaire Smith, a 2018 first-round draft pick, was recalled from the Delaware Blue Coats before the game but did not play. The rookie, who fractured his foot in August, has yet to make his NBA debut. . Center Boban Marjanovic, who returned to the court after missing six straight contests, scored 11 points after first checking into a big ovation.\n\nKING JAMES\n\nMaking his first start as a Sixer, in place of Butler, James Ennis III scored 10 of his 12 points in the first half. He also had an exciting follow slam at the beginning of the fourth quarter and was, according to coach Brett Brown, \"one of the team's best defensive players\" on the night.\n\n\"James did a great job,\" Embiid said. \"He's settling in comfortably. And we're going to need him for the rest of the season and the playoffs.\"\n\nEnnis came over to Philly in a trade deadline deal with the Rockets last month.\n\nUP NEXT\n\nCavaliers: Visit the Orlando Magic on Thursday night.\n\n76ers: Host the Sacramento Kings on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994741.8066401
}