{
  "game_id": "0022300644",
  "espn_id": "401585272",
  "date": "Jan 27, 2024",
  "matchup": "PHI @ DEN",
  "headline": "Jokic, Nuggets fend off gritty 76ers 111-105 as Embiid sits out for 4th consecutive time in Denver",
  "body": "DENVER -- — This matinee was no marquee, not with one of its co-stars missing again.\n\n\r\n              The Denver Nuggets fended off the gritty, short-handed Philadelphia 76ers 111-105 on Saturday behind 26 points and 16 rebounds from Nikole Jokic, who was again denied his rematch with fellow MVP contender Joel Embiid. \n\n\r\n              Philadelphia's star center missed the Sixers’ game at Denver for a fourth consecutive season after the team’s medical staff determined he shouldn’t play on his balky left knee.\n\n\r\n              Denying hoops fans another marquee matchup between the last two NBA MVPs, the Sixers scratched Embiid minutes before tipoff after he grimaced through his warmups. \n\n\r\n              “He really wanted to play, and the medical team did not deem him fit to play today,” Sixers coach Nick Nurse said. “That's too bad for those fans. That's too bad.”\n\n\r\n              Nuggets coach Michael Malone was miffed by the late nature of Embiid's scratch.\n\n\r\n              “We found out very late and again, I don't know how you go from being active/available to out,” Malone said. “And I'm sure the league will do their due diligence because that's frowned upon. We've had situations this year where we've talked to the league and they told us if a player goes from being active to out, there's going to be an investigation.”\n\n\r\n              Embiid tweaked his troublesome left knee against the Pacers on Thursday night, but he wasn't listed on the injury report Saturday.\n\n\r\n              “I'm sure he is hurt,” Malone said. “But it's just really tough on the (opponent) preparing for them and then all of a sudden, last minute, he's out. \n\n\r\n              \"But, we have to do a better job of handling those situations.”\n\n\r\n              Embiid was preparing to play without much of his supporting cast as Tyrese Maxey (ankle), Tobias Harris (illness) and Mo Bamba (knee) were all ruled out well before he was.\n\n\r\n              Counting Embiid, that’s 84 points of scoring averages that the Sixers were missing. But the tired Nuggets, coming off a season-long 12-day East Coast swing, couldn't shake the Sixers until the closing minutes.\n\n\r\n              Jamal Murray scored 23 points for Denver and Michael Porter Jr. had 20. Paul Reed led Philadelphia with a career-best 30 points and Kelly Oubre Jr. had 25.\n\n\r\n              Jokic didn't want to dwell on Embiid's latest absence on the Ball Arena court, saying Reed deserved the airtime instead for his spectacular performance.\n\n\r\n              Besides, Jokic said, what Embiid is doing this season is absolutely breathtaking.\n\n\r\n              “He's putting history right now in front of our eyes, and he's making it look so easy,” Jokic said.\n\n\r\n              Embiid is averaging 36 points and 11.4 rebounds, and Malone said 90 minutes before the game that the Sixers' All-Star center has become “really unguardable.”\n\n\r\n              That is, when he's not unavailable -- which is sometimes the case, especially in Denver, where he hasn't played since Nov. 8, 2019.\n\n\r\n              Embiid has missed 11 games this season and because of the NBA's new rules he can only miss six more to remain eligible for the league’s awards. That includes MVP, which he won last year for the first time while denying Jokic a third consecutive such honor.\n\n\r\n              Embiid and Jokic have jockeyed for MVP front-runner status each of the last four seasons, including this one. Each has been runner-up when the other won the award.\n\n\r\n              In the Sixers' 126-121 win over the Nuggets on Jan. 16, Embiid had 41 points and 10 assists to Jokic’s 25 points and 19 rebounds but complimented Jokic afterward as the game's best player and congratulated him on leading Denver to its first NBA title last summer.\n\n\r\n              Embiid was mocked last year with “Missing Person” signs in the stands at Ball Arena after he sat out the Sixers’ game in Denver with a sore right calf, leading to accusations he was ducking Jokic. When the crowd realized he wasn't playing Saturday, chants of “Where's Embiid?” broke out as the Nuggets jumped out to a 13-4 lead.\n\n\r\n              “I think everybody was like, ‘Oh, yeah, this is going to be a cakewalk today,’\" Malone said. “Well, it wasn't a cakewalk. This was a tough, tough win.\"\n\n\r\n              Embiid was street clothes and cheering on his teammates courtside by game's end, but he wasn't around afterward in the locker room to talk about his latest absence.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Visit the Portland Trail Blazers on Monday night.\n\n\r\n              Nuggets: Host the Bucks in Doc Rivers’ Milwaukee coaching debut Monday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996422.308458
}