{
  "game_id": "0022001014",
  "espn_id": "401307819",
  "date": "May 08, 2021",
  "matchup": "MEM @ TOR",
  "headline": "Valanciunas has double-double, Grizzlies beat Raptors 109-99",
  "body": "TAMPA, Fla. -- — Jonas Valanciunas had 18 points and 21 rebounds, De'Anthony Melton hit four 3-pointers in the fourth quarter, and the Memphis Grizzlies beat the Toronto Raptors 109-99 Saturday night to move closer to a play-in spot.\n\n\r\n                    Jaren Jackson Jr. had 20 points for the Grizzlies in his first start of the season, and Ja Morant added 12 points, seven rebounds and six assists.\n\n\r\n                    “It was a great bounce-back win by our guys,” said coach Taylor Jenkins, referring to a loss at Detroit on Thursday night. “I thought we had a great competitive edge and our defensive intensity was incredible.”\n\n\r\n                     Melton finished with 15 points on 5 of 10 shooting, all from 3-point range.\n\n\r\n                    “By the time the fourth quarter came around, we noticed what they were doing (defensively),” Melton said. “Finding the open guy was important and everybody did a great job of moving the ball around to get the shooter as open as possible. That's the result you get.\n\n\r\n                    “I'm pretty confident in my 3-point shooting now,” he added, “and I've always been about doing whatever the team needs.”\n\n\r\n                    Pascal Siakam and Gary Trent Jr. had 18 points each for the Raptors, who shot 38 % in losing for the seventh time in eight games. Siakam left the game with a left shoulder strain late in the third quarter.\n\n\r\n                    Jackson's 3-pointer with 2:02 left in the third quarter gave the Grizzlies a 12-point lead, the largest of the game.\n\n\r\n                    Starting for the first time after spending most of the season recovering from knee surgery, the 21-year-old Jackson played 26 minutes. He had four rebounds, three steals and a big block of Trent.\n\n\r\n                    “I'm playing basketball again with my friends. There's nothing more I can ask for. Even with all the pressure on us, it's great,” Jackson said.\n\n\r\n                    “I'm really proud of what J.J. did tonight, and we'll continue to look for ways for him to make an impact over 48 minutes,” Jenkins said. \n\n\r\n                    Back-to-back 3-pointers by Malachi Flynn and Trent pulled the Raptors to 85-84 midway through the fourth quarter but Melton nailed three 3-pointers in a one-minute span to lift Memphis out of danger.\n\n\r\n                    The Grizzlies need two wins in their remaining five games to be assured of a spot in the NBA's new play-in tournament.\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Valanciunas' double double was his 47th of the season. He is also second on Toronto's all-time list with 137. ... Morant, the Grizzlies' leading scorer, did not have a field-goal attempt until after rebounding his missed free throw attempt with 1:18 left in the second quarter. ... G Sean McDermott missed his fifth game with a sore left foot. ... G Grayson Allen missed a third game with a sore abdomen. \n\n\r\n                    Raptors: Two days after having been virtually eliminated from contention for a play-in spot, the Raptors played without G Kyle Lowry (rest), G Fred VanVleet (rest), F OG Anunoby (sprained left calf) and F Chris Boucher (sprained ACL). ... The Raptors used their 34th different starting lineup. ... Rodney Hood left the game with a fractured left finger.\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Host New Orleans on Monday night. \n\n\r\n                    Raptors: Host the Los Angeles Clippers on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764996913.802163
}