{
  "game_id": "0022400234",
  "espn_id": "401704800",
  "date": "Nov 17, 2024",
  "matchup": "MIN vs. PHX",
  "headline": "Randle hits 3 at the buzzer to lift Timberwolves over Booker, Suns with 120-117 win",
  "body": "MINNEAPOLIS -- — Julius Randle hit a buzzer-beating 3-pointer to cap his 35-point night and lift the Minnesota Timberwolves to a 120-117 win over the Phoenix Suns on Sunday afternoon.\n\n\r\n              Randle and the Wolves got the ball back with just 2.1 seconds remaining and called a timeout to advance the ball. The ball found Randle, who hit a 24-footer as time expired.\n\n\r\n              Minnesota overcame a season-high 44 points from Devin Booker, who needed to carry the offensive load for a Suns team still missing Kevin Durant and Bradley Beal with injuries.\n\n\r\n              Anthony Edwards added 24 points for Minnesota, most of that coming in the second half. He also picked up a technical foul on the same day he was fined by the league for an obscene gesture he made in Friday’s win over Sacramento.\n\n\r\n              Grayson Allen scored 18 points off the bench for Phoenix, including a few 3-pointers in the fourth quarter.\n\n\r\n              Takeaways\r\n              Suns: Phoenix led by as many as 16 points in the first half but let the Wolves hang around after halftime, which eventually cost it in the end.\n\n\r\n              Timberwolves: This was Randle's best game as a Timberwolf since he was acquired in a blockbuster trade from the Knicks before the season. He was Minnesota's most consistent scorer all game and capped the night with the winning shot.\n\n\r\n              Key moment\r\n              A timeout gave the Timberwolves the ability to advance the ball up the floor and allowed Minnesota to run the out-of-bounds play that ended with Randle's 3.\n\n\r\n              Key stat\r\n              Edwards was quiet in the first half for Minnesota, scoring just four points. It was his lowest point total in the first half this season and came when the Timberwolves needed a lift as they trailed by double digits.\n\n\r\n              Up Next\r\n              The Suns host Orlando on Monday, while the Timberwolves play at the Raptors on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998105.191295
}