{
  "game_id": "0021300954",
  "espn_id": "400489827",
  "date": "Mar 11, 2014",
  "matchup": "MIL @ MIN",
  "headline": "Timberwolves outlast Bucks for 112-101 victory",
  "body": "MINNEAPOLIS --  The shots were clanking and the frustration was mounting for J.J. Barea during a three-game shooting slump that was getting him booed off his home court with regularity.\n\nWith the lowly Milwaukee Bucks hitting everything in sight, Minnesota coach Rick Adelman gave Barea some time with the Ricky Rubio in the same backcourt, and the throwback lineup helped jumpstart Barea and the Minnesota Timberwolves.\n\nKevin Love had 27 points, 10 rebounds and six assists and Barea scored 19 points to lift the Timberwolves to a 112-101 victory over the Bucks on Tuesday night.\n\nAfter going 5 for his previous 25, Barea hit seven of 10 shots to help wake up the sluggish Wolves and Kevin Martin scored 26 points to help them finish a four-game homestand at 2-2. After carving a niche for himself in this league as a helter-skelter, mini-shooting guard who thrives when playing alongside a bigger point guard, roster limitations have forced Adelman to play Barea as a more prototypical backup point guard this season.\n\nBut Milwaukee plays a smaller backcourt, which allowed Adelman the chance to pair Barea and Rubio.\n\n\"I love it. I miss it,\" Barea said. \"I miss playing off the ball a little bit, especially with Ricky. When I'm making shots, it's great for our team.\"\n\nBrandon Knight scored 21 points for the Bucks (13-51), who led at halftime and were looking for their first set of back-to-back victories this season. But after scoring 61 points in the first half and leading by 11 points in the second quarter, the Bucks were outscored 19-4 to start the fourth quarter.\n\n\"Fourth quarter, we couldn't really get anything going,\" said Bucks guard Nate Wolters, who had 14 points. \"We've had problems all year in the fourth quarter closing games. We gave ourselves a chance to win, having a lead going into the fourth, but just couldn't get it going and win.\"\n\nRubio had 11 points and 10 assists and three steals for Minnesota.\n\n\"J.J.'s a great scorer and sometimes he needs to play the (shooting guard),\" Rubio said. \"But it's hard to do it when they have a (big) two. But I like playing with him. He made shots today and he played a lot.\"\n\nThe Timberwolves scored 30 points off of 15 turnovers by Milwaukee to offset some porous defense that allowed the Bucks to shoot 52.7 percent. They trailed by six points at halftime, but Love and Dante Cunningham fueled the game-clinching run with a flurry of jumpers that pushed the lead to 105-88.\n\n\"There was no pace and we let them get defensive stops,\" said Bucks forward ZaZa Pachulia, who had a career-high 10 assists with nine points and six rebounds. \"They are one of the best teams in transition and they got out in front of us and got easy buckets in transition. We just weren't able to get back.\"\n\nThe Wolves (32-31) entered the game five games behind Memphis for the final playoff spot in the Western Conference. In all likelihood, they kicked away their chance to make the postseason for the first time in 10 years with losses to the Knicks and Raptors earlier in this homestand. A loss to the worst team in the league at home surely would have ended any slim hopes that remained.\n\nThe Bucks have been playing better basketball, at least offensively, since a trade last month brought Ramon Sessions and Adrien from Charlotte and sent disgruntled guard Gary Neal to the Bobcats. Even so, they were playing the second night of a back-to-back while the Wolves were playing their fourth straight game at home.\n\nThe Bucks also were missing starting power forward Ersan Ilyasova because of a sore ankle. But as the Timberwolves have done all year long, they delivered a listless defensive effort to give their opponent life it had no business having. Milwaukee made its first 12 shots, the longest streak without a miss to open a game in the league this season, and shot over 71 percent in the first quarter to jump out to a 33-22 lead.\n\nBarea made his first six shots in the second quarter, including a layup that tied the game at 49.\n\nGame notes Wolters, from nearby St. Cloud, Minn., had a large contingent of fans who came both from his hometown and from South Dakota. Wolters starred in college at South Dakota State. ... Timberwolves F Luc Richard Mbah a Moute hosted a dozen young fans from the south of France. The fans made plans to travel to the U.S. to see him play for Sacramento against New York. But Mbah a Moute was traded to Minnesota in December, so he picked up the tab to change their flights.",
  "source": "espn_api",
  "crawled_at": 1764992735.2702851
}