{
  "game_id": "0021500143",
  "espn_id": "400828030",
  "date": "Nov 14, 2015",
  "matchup": "PHX vs. DEN",
  "headline": "Bledsoe leads Suns over cold-shooting Nuggets, 105-81",
  "body": "PHOENIX --  Eric Bledsoe and the Phoenix Suns jumped all over the weary Denver Nuggets.\n\nTough to play the Suns on the second part of games on consecutive days.\n\nBledsoe had 30 points, seven rebounds and four assists in three quarters, and the Suns cruised to a 105-81 win over the Nuggets on Saturday night.\n\nTyson Chandler added 11 points and eight rebounds as Phoenix stopped Denver's three-game winning streak. The Suns have won seven of the last eight meetings between the teams.\n\nBledsoe was 11 for 16 from the field and 5 for 5 at the free-throw line. He has four straight games of 20 or more points, matching the longest such streak of his career.\n\n\"I'm just playing, having fun and playing with my teammates and being aggressive,\" Bledsoe said. \"It's definitely with a better flow. Everybody is getting easy looks, creating for others as well. We're just playing team basketball at the end of the day.\"\n\nWill Barton led the Nuggets with 19 points and 12 rebounds. Rookie Emmanuel Mudiay scored 13.\n\nPhoenix led by as many as 37 points in the second half and improved to 4-0 against opponents in the second part of a back-to-back. Denver shot 35 percent (34 for 98) from the field and was hurt by a 57-42 rebounding deficit.\n\nBledsoe didn't play in the fourth and still finished three points off his season high. Archie Goodwin scored 12 points, and Mirza Teletovic had 11 points and nine boards.\n\n\"When he comes down and comes at you and pulls up for that jump shot, now these guys are going to have to come pick him up a little higher and he's just going to drive right by them,\" Suns coach Jeff Hornacek said of Bledsoe.  \"So he's just playing great right now.\"\n\nThe Suns made just two of their first 10 shots, but grabbed control with a 17-0 run and led 27-13 when the quarter was over.\n\nGoodwin came off the bench and made a difficult shot with 2:30 left. He cut down the lane and took a pass from Jon Leuer while being shoved by Denver's Randy Foye and threw the ball into the basket as he fell out of bounds, giving Phoenix a 22-9 lead.\n\nDenver's 13 points was its lowest total in a quarter during any game this season, and its 28 points at the break was a season low for a half.\n\n\"We're not going to say `It's the second night of a back-to-back, we have injuries,\" Nuggets coach Mike Malone said. \"That's the NBA. Our selfish play we saw in the first half was bothersome.\"\n\nLeuer made his first start of the season, replacing Markieff Morris. The forward sat out with a left knee sprain.\n\nThe Suns closed the first half on a 14-0 run for a commanding 60-28 lead at the break. The run was punctuated by P.J. Tucker's lob to Chandler for a dunk with 0.5 seconds left.\n\n\"Our defense was horrible, especially in the first half,\" Barton said.\n\nDenver forward Kenneth Faried did not return after halftime due to back spasms and finished with two points and seven rebounds in 14 minutes.\n\nTIP-INS\n\nNuggets: F Joffrey Lauvergne did not play due to a lower back strain, though he is close to returning, Malone said. Malone had Lauvergne, a native of France, check in with his family Friday night in the wake of the shootings in Paris. Lauvergne has missed the last seven games. ... Barton had his sixth career double-double and first since March 2015. ... Denver was coming off a 107-98 victory over Houston on Friday night.\n\nSuns: G Ronnie Price was sidelined by a concussion. ... Morris' streak of 171 consecutive games played, the sixth-longest active streak in the NBA before Saturday, came to an end. ... F Cory Jefferson scored his first two points as a Sun in the fourth quarter.\n\nONE-ON-FIVE\n\nBledsoe's 30 points matched the total scored by the Nuggets' starting five.\n\nVIVE LA FRANCE\n\nThe French national anthem, \"La Marseillaise,\" was played before the start of Saturday's game as fans stood in tribute. A cheer rose from the stands with the song's final note.\n\nUP NEXT\n\nNuggets: At New Orleans on Tuesday night.\n\nSuns: Host Los Angeles Lakers on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994883.694124
}