{
  "game_id": "0021601124",
  "espn_id": "400900519",
  "date": "Mar 30, 2017",
  "matchup": "PHX vs. LAC",
  "headline": "Griffin, Paul help Clippers hand Suns 10th straight loss",
  "body": "PHOENIX --  The Los Angeles Clippers, worn down from a tough game the previous night, still had enough energy to send the Phoenix Suns to their 10th straight loss.\n\nBut it was no blowout.\n\nBlake Griffin scored 31 points, Chris Paul added 29 points and 10 assists and the Clippers held on to beat the Suns 124-118.\n\n\"Back to back, all these games, me and Blake talked about it,\" Paul said. \"How to push through and find a way to win, and this goes in the win column. I'm not going to watch the film and dissect too much of it. We got the win.\"\n\nDevin Booker returned to the Suns' lineup and scored 33 points while playing in front of his former college coach, Kentucky's John Calipari, and matched his season high with nine assists, but fouled out with 4:45 to play.\n\nThe Clippers (46-31), coming off a 133-124 home win over Washington on Wednesday night, pulled within a game of Utah (46-29) for the No. 4 playoff spot in the Western Conference.\n\n\"We didn't necessarily play great. We won the game,\" Los Angeles coach Doc Rivers said. \"We'll take that.\"\n\nBooker, three games removed from his 70-point outburst in Boston, missed Tuesday's game in Atlanta with a sore right ankle.\n\nRookie Tyler Ulis, who also played for Calipari, had 16 points and matched his career best with 12 assists. Marquese Chriss scored 20 for the Suns, and Jamal Crawford had 19 for the Clippers.\n\nThe Suns, just back from a six-game road trip, trailed 113-106 when Booker fouled out but managed a 6-1 spurt to cut Los Angeles' lead to 114-112 on Chriss' inside basket on an underhanded pass from Ulis with 3:43 left.\n\nBut Paul sank a pair of free throws and found Griffin underneath for a dunk and Los Angeles was back up 118-112.\n\n\"That was a big shot,\" Paul said. \"That's got to be our bread and butter. Me and Blake talk about it all the time. We've got to have something that me and him can go to to close out games.\"\n\nThe Suns' T.J. Warren missed four straight free throws before Griffin and Paul sank consecutive jumpers to seal it at 124-116 with 48 seconds to play.\n\nLos Angeles made 24 of 34 free throws to the Suns' 13 of 24.\n\nDespite the losses, Phoenix coach Earl Watson likes what he's seen from his exceedingly young lineup.\n\n\"I think our players are growing in all areas,\" he said. \"They're getting an opportunity, and we all know opportunity in this level is the most important thing for growth and development and just improving.\n\n\"And they're so young and still believe that anything is possible.\"\n\nPhoenix trailed by as many as 12 in the third quarter before rallying to tie it at 102 on Booker's driving layup with 7:51 left. Griffin converted a three-point play and Paul scored the next four to stretch the lead to 109-102 with 6:45 left.\n\nGriffin scored 12 of his 20 first-half points and the Clippers pulled away late in the second quarter to lead 67-59 at the break.\n\nHis 3-pointer capped a 14-2 run that put the Clippers up 63-55 with 1:21 left in the half.\n\nLONG RANGE\n\nLos Angeles made nine of 13 3-point attempts in the first half and finished the game at 12 of 22. Eight players made at least one 3 for the Clippers, led by J.J. Redick's 3 for 6.\n\nBooker shot 4 of 7 on 3s for the Suns, but the rest of the team was just 3 of 16.\n\nTIP INS\n\nClippers: Four of Los Angeles' five remaining games are at home. ... Los Angeles swept the four-game season series. ... Three of the Clippers' five remaining foes have a losing record.\n\nSuns: Booker had his 12th 30-point game of the season. He passed Dwight Howard for the fifth-most points by an NBA player before age 21. Only LeBron James, Kevin Durant, Carmelo Anthony and Kobe Bryant had more. ... Phoenix is 0-9 since deciding to sit Eric Bledsoe for the rest of the season.\n\nUP NEXT\n\nClippers: Home against the Lakers on Saturday afternoon\n\nSuns: at Portland on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995944.4839392
}