{
  "game_id": "0022301078",
  "espn_id": "401585706",
  "date": "Mar 31, 2024",
  "matchup": "LAL @ BKN",
  "headline": "LeBron James ties career high with 9 3-pointers, scores 40 points as Lakers beat Nets 116-104",
  "body": "NEW YORK -- — LeBron James would only hint at how long he expects to keep playing NBA basketball.\n\n\r\n              “Not very long, I’m not going to play another 21 years, that’s for damn sure,” James said after he had one of the best shooting nights of his illustrious career, going 9 for 10 behind the arc to tie his career high for 3-pointers. “I don’t know when that door will close, but I don’t have much time left.”\n\n\r\n              James once again looked like an ageless wonder as he played is 1,485th career game and matched a season high with 40 points to lead the Los Angeles Lakers to a 116-104 victory over the Brooklyn Nets on Sunday night.\n\n\r\n              James had the sellout crowd at Barclays Center standing on its feet as he put the finishing touches on his 3-point shooting display in the fourth quarter. He reached 40 points for the third time this season, most recently on March 16 in a home loss to Golden State.\n\n\r\n              The Lakers have won five of six since then, and this victory moved them a season-high nine games over .500 with seven games remaining in the regular season. Los Angeles remained ninth in the Western Conference, but the Lakers could catch the Sacramento Kings for eighth or the Phoenix Suns for seventh in the West, taking them out of the single-elimination No. 9 vs. No. 10 play-in game.\n\n\r\n              If James has another game like this in the postseason, just about anything is possible for the NBA’s career scoring leader who continues to amaze at age 39.\n\n\r\n              The 20-time All Star finished 13 for 17 overall as the Lakers played the fourth game of a six-game road trip and rebounded from a loss Friday night at Indiana that snapped their five-game winning streak.\n\n\r\n              “I put in a lot of time working on my craft,” James said.\n\n\r\n              Anthony Davis added 24 points and 14 rebounds, and Rui Hachimura had 20 points and 10 rebounds in a game the Lakers led by 20 in the first quarter and controlled throughout. Brooklyn got its deficit inside double digits just once in the second half. \n\n\r\n              Cam Thomas led the Nets with 30 points, trying to rally them after their dismal start.\n\n\r\n              “But can’t do nothing when somebody hits 9 for 10 from 3,” Thomas said. “Made every 3 he put up so it's tough, but I feel like we played really well second through the fourth. It was just the first quarter was pretty tough on us, starting off that slow,”\n\n\r\n              The Lakers got 114 of their 116 points from their starters.\n\n\r\n              James also made nine 3-pointers Jan. 24, 2023, against the Clippers, shooting 9 for 14. His 90% accuracy was the second-best of his career in games in which he made at least five 3-pointers, according to the Elias Sports Bureau. He was 5 for 5 against Oklahoma City on Dec. 23 of this season.\n\n\r\n              Brooklyn was 0 for 8 from the field when interim coach Kevin Ollie called his first timeout just over 4 minutes into the first quarter after James grabbed a defensive rebound and hit Davis in stride with a long pass for a breakaway dunk, and the futility continued until Nic Claxton broke the ice after an 0-for-11 start by banking in a 10-footer.\n\n\r\n              Still, the lead rapidly grew to 24-4 with 4 ½ minutes left in the opening quarter, and the Barclays Center crowd was silenced as the Nets were laying this particular Easter egg. The Lakers’ lead was 31-10 after one quarter as Brooklyn shot 4-for-21 and was outrebounded 21-11.\n\n\r\n              James kept single-handedly holding off the Nets in the third and fourth quarters with 3s, the eighth of which came as he was falling to his left from the corner to give the Lakers a 108-91 lead.\n\n\r\n              James then was isolated against Claxton on the perimeter on the next possession and dribbled between his legs several times before making his ninth 3 to make it 111-93.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Toronto on Tuesday.\n\n\r\n              Nets: At Indiana on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995479.0950038
}