{
  "game_id": "0022300029",
  "espn_id": "401584117",
  "date": "Nov 17, 2023",
  "matchup": "ATL vs. PHI",
  "headline": "Joel Embiid goes for 32 as 76ers win NBA In-Season Tournament Game over Hawks",
  "body": "ATLANTA -- — Joel Embiid had 32 points, seven rebounds and eight assists and the Philadelphia 76ers put away the Atlanta Hawks 126-116 on Friday night in an NBA In-Season Tournament game.\n\n\r\n              The Sixers improved to 2-1 in Group A play, with one game remaining. The Hawks dropped to 1-1.\n\n\r\n              Tobias Harris had a season-high 29 points and 10 rebounds and Tyrese Maxey overcame a slow start to finish with 19 points and eight assists for the Sixers, who snapped a two-game losing streak. Danuel House Jr. had a season-high 14 points off the bench.\n\n\r\n              “It was a playoff mentality,” House said in reference to the tournament. \n\n\r\n              Trae Young led six Hawks in double figures with 22 points in a game that was played on a primarily light blue court in State Farm Arena for the tournament. Young also had 13 assists. Jalen Johnson had 18 points and 10 rebounds, Saddiq Bey had 17 points off the bench and Clint Capela had 15 points.\n\n\r\n              Harris has scored at least 15 points in every game for the Sixers this season and has been a key complementary component to Embiid and Maxey.\n\n\r\n              “This is what I expect out of him,” said Sixers coach Nick Nurse. “He can shoot the three, can take it in transition. He can iso on the block. He continues to make plays.”\n\n\r\n              Young and Dejounte Murray, the Hawks two leading scorers, shot 10 for 30 from the field.\n\n\r\n              “That's about as good of a job as you can do on those guys,” Nurse said. “They felt some intensity from us and some hard work.”\n\n\r\n              The Sixers hit 27 of 28 free throws.\n\n\r\n              The Sixers led by 7 at the end of the third quarter and gradually pulled away in the fourth. A layup by De'Anthony Melton with 3:46 to play capped a 6-0 run and stretched the lead to 117-101.\n\n\r\n              “We made defensive stops,” House said of the Sixers' fourth quarter. “We were scoring the ball and making the right read. We were in attack mode.”\n\n\r\n              Embiid entered the game questionable with a hip injury. Johnson dunked on the reigning MVP in transition less than two minutes into the game, but Embiid bounced back quickly. He played all 12 minutes in the first quarter, scoring 11 points to go along with four assists, and three rebounds.\n\n\r\n              Hawks forward De'Andre Hunter was ejected with 10:27 left in the third quarter after earning two technical fouls arguing with the officials. Hunter was on the ground when Embiid jumped to grab an offensive rebound. Embiid landed on Hunter's ankle and took a shot, and Hunter was whistled for a foul. He had nine points in 18 minutes before his ejection. It was the first career ejection for Hunter, who is in his fifth season.\n\n\r\n              “On that play De’Andre’s on the floor and laying on the floor is not a legal guarding position. So, now if he ends up tripping a player, such as he did with Joel Embiid, it would be a defensive foul,” officiating crew chief Ben Taylor told a pool reporter explaining the ejection.\n\n\r\n              UP NEXT\n\n\r\n              76ers: At Brooklyn on Saturday afternoon.\n\n\r\n              Hawks: Will host the Pacers in an NBA In-Season Tournament game Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996310.266167
}