{
  "game_id": "0021800818",
  "espn_id": "401071491",
  "date": "Feb 08, 2019",
  "matchup": "PHI vs. DEN",
  "headline": "Redick scores 34 points, 76ers beat Nuggets 117-110",
  "body": "PHILADELPHIA --  The new-look Philadelphia 76ers made a strong first impression with little time practicing together.\n\nJJ Redick scored a season-high 34 points, Jimmy Butler had 22 and the Sixers beat the Denver Nuggets 117-110 on Friday night with four players making their debut.\n\nTobias Harris had 14 points and eight rebounds in his first game for Philadelphia and Joel Embiid scored 15 and grabbed 12 boards despite playing with a stomach flu.\n\nThe Sixers made a flurry of moves before Thursday's trade deadline, acquiring Harris, Boban Marjanovic and Mike Scott from the Clippers, James Ennis from Houston and Jonathon Simmons from Orlando.\n\n\"You couldn't ask for any better,\" Harris said. \"To play like that, get that reaction from fans, it meant a lot to me. It was awesome. Feels good to be appreciated.\"\n\nNikola Jokic led Denver with 27 points and Jamal Murray had 23. The Nuggets, who have the second-best record (37-18) in the Western Conference behind Golden State, were missing two of their top five scorers: Gary Harris and Paul Millsap.\n\n\"You look at that starting lineup, aside from Redick, they have size, length and athleticism,\" Nuggets coach Michael Malone said. \"They're tough to handle.\"\n\nHarris hit a jumper to give the Sixers a 105-103 lead with under four minutes left and then grabbed a rebound to set up Embiid's layup. Butler stole the ball, got fouled and hit a pair of three throws to extend the lead to 109-103. Ben Simmons' driving, left-handed dunk over Mason Plumlee thrilled the crowd and deflated the Nuggets. Sixers legend Allen Iverson jumped from his courtside seat and smacked hands with fans after Simmons' thunderous slam.\n\n\"It's going to take time,\" Simmons said. \"Chemistry is going to start flowing. Right now, I'm happy with what I'm seeing.\"\n\nPhiladelphia (35-20) is ted with Boston for the fourth spot in the East.\n\nSixers coach Brett Brown said his play sheet was \"frugal\" because he couldn't prepare much in the short time since the trades.\n\n\"I thought they were unselfish,\" Brown said. \"They shared the ball. We moved when we didn't have the ball. We have more to give.\"\n\nThe Sixers took a 50-34 lead when Simmons lobbed an alley-oop pass to Butler for a one-handed jam and Ennis hit a 3 off a cross-court pass from Harris. But Denver answered with a 22-6 run to tie it at 56 at halftime. Philly led 83-82 after three quarters.\n\nHarris helped ignite an early 10-0 run. He hit a 3-pointer, 8-footer and dished to Redick for an open 3 to cap the burst. Marjanovic got a loud ovation when he entered the game midway through the first and another one after he scored on a driving layup.\n\nKEEP THE CORE\n\nSixers GM Elton Brand said the team plans to retain Butler and Harris, who are both playing the final years of their contracts.\n\n\"I've gotten all assurances from the managing partners that we can bring them back and sign them for whatever it takes to sign them. We want to keep this core long term,\" Brand said.\n\nTIP-INS\n\nNuggets: Harris missed his fifth consecutive game with a strained right groin. Millsap missed his third straight with right ankle soreness. ... Beat the Sixers 126-110 at home on Jan. 26.\n\n76ers: The Sixers retired Hall of Famer Moses Malone's No. 2 in a halftime ceremony. Malone helped lead Philadelphia to its last championship 36 years ago. ... Members of the 1983 NBA championship team, including \"Dr. J\" Julius Erving, rang the team's ceremonial bell at midcourt before the game. ... Ennis had six points and Marjanovic had four. Both played 15 minutes. ... Butler made all 14 of his free throws.\n\nUP NEXT\n\nNuggets: Host the Miami Heat on Monday night.\n\n76ers: Host the Los Angeles Lakers on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994018.742271
}