{
  "game_id": "0021700904",
  "espn_id": "400975650",
  "date": "Feb 26, 2018",
  "matchup": "DAL vs. IND",
  "headline": "Barnes, Barea lead Mavericks to 109-103 win over Pacers",
  "body": "DALLAS --  For one night, at least, things returned to normal for the Dallas Mavericks. With new leadership in the front office, the team turned to veteran leadership on the court.\n\nHarrison Barnes scored 21 points and J.J. Barea added 19 points and nine assists as the Mavericks ended a four-game losing streak and a turmoil-filled week with a 109-103 win over the Indiana Pacers on Monday.\n\nDallas scored 41 points in the fourth quarter on 60 percent shooting to open a double-digit lead and made seven of eight free throws down the stretch to hang on. The loss halted Indiana's four-game winning streak, and the Mavericks finished a season sweep of the Pacers.\n\nMyles Turner led Indiana with 24 points, and Victor Oladipo scored 13 of his 21 in the fourth quarter as the Pacers cut a 13-point deficit to two in the final minute before the Mavs put the game away.\n\nEarlier in the day, the Mavericks named Cynthia Marshall interim CEO, less than a week after a Sports Illustrated report included allegations of sexual misconduct against team employees and the NBA levied a $600,000 fine against owner Mark Cuban for suggesting the club would be best served by losing to secure a higher draft pick.\n\nOn the court, the team got a huge spark from Barea, who had nine points and four assists in the final quarter. The 12-year veteran has played nine seasons with the Mavericks over two stints, and he returned to the bench Monday after starting five of the previous six games.\n\n\"I'm playing great basketball,\" Barea said. \"I love my teammates and my coaches; they put me in great situations. My job is to bring a lot of energy, whether I start or come off the bench.\"\n\nDoug McDermott added another 15 points off the Dallas bench, and Dwight Powell had 10 points and 14 rebounds.\n\nThe Mavericks, held to 40 percent shooting through three quarters, hit 10 of their first 13 shots in the fourth, five of them 3-pointers, to build a 93-80 lead.\n\nOladipo missed the previous meeting, a 98-94 Dallas win on Dec. 27, with a knee injury and played just 14 minutes over the first three quarters this time, picking up two quick fouls early in the game and never getting into a rhythm until late.\n\nBut he helped lead Indiana back, scoring seven straight points for his team to pull the Pacers twice within two in the final minute.\n\n\"It just felt like every time I tried to do something, it was a foul,\" Oladipo said. \"Unfortunately, we came up short and I wish I had the opportunity to play a little bit more, but you can't do nothing about it.\"\n\nWesley Matthews hit a 3 with 32.4 seconds remaining to restore a five-point lead for Dallas, and the Mavericks put the game away at the line.\n\nNOT A FANTASY\n\nPowell has scored in double figures in seven of his last nine games and set his career high in rebounds Monday in just his second start of the season.\n\nMavericks coach Rick Carlisle was approached by fans on the team's recent trip to Los Angeles, asking him to continue giving Powell his minutes because he was helping their fantasy teams.\n\n\"If you would have ever suggested that kind of situation would have presented itself last year or earlier this year, a lot of people would have rolled their eyes,\" Carlisle said. \"But the thing I love about Powell is you're going to get unconditional, boundless energy and the highest of high care factors when it comes to the team.\"\n\nTIP-INS\n\nPacers: Oladipo's 1,303 points are the most he's scored in any of his five NBA seasons, and he still has 22 games to go. ... Indiana has outrebounded its opponent in the last five games after being outrebounded in 11 straight.\n\nMavericks: The club introduced Marshall, a former AT&T executive, to the crowd and she sat courtside next to Cuban. ... The team honored founder Donald Carter, who died Feb. 14 at age 84, with a moment of silence before the game and a video tribute during the first quarter. ... Dallas signed Scotty Hopson to a 10-day contract. Hopson, who most recently was playing professionally in Turkey, has played only two NBA games in his career, with Cleveland in 2014.\n\nUP NEXT\n\nPacers: At the Atlanta Hawks on Wednesday.\n\nMavericks: Host the Oklahoma City Thunder on Wednesday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993946.3899012
}