{
  "game_id": "0021900050",
  "espn_id": "401160692",
  "date": "Oct 28, 2019",
  "matchup": "SAC vs. DEN",
  "headline": "Nuggets remain undefeated with 101-94 win over Kings",
  "body": "SACRAMENTO, Calif. --  Jamal Murray took the blame for another slow start by Denver's offense and quickly pointed out how well the Nuggets have been playing defensively.\n\n\"Our defense has been our anchor,\" Murray said. \"It's been what's won us (games). Guys have to know we're a defensive team first. We can all score. We can all shoot. But defense is clearly how to win games.\"\n\nMurray scored 14 points of his 18 points in the second half, including four in the final 31 seconds, Gary Harris added a pair of late free throws and the Nuggets held on after nearly blowing a big lead in the fourth quarter, beating the winless Sacramento Kings 101-94 on Monday night.\n\nThe Nuggets (3-0) shook off a sluggish first half when they shot 17 of 52, took control in the third quarter with a stifling defense that repeatedly forced Sacramento into contested shots from the perimeter, then held off a late rally by the Kings to remain unbeaten.\n\n\"I challenged our guys to be a lot more physical and make them feel us,\" Denver coach Mike Malone said. \"We didn't change our game plan. We just changed how hard and how physical we were playing. This was another night our offense struggled, but some guys stepped up and made big plays down the stretch.\"\n\nHarris scored 17 points as Denver won its fifth straight against Sacramento. Nikola Jokic had nine points on 4-for-15 shooting with 13 rebounds and Will Barton added 13 points and nine rebounds.\n\nDenver led comfortably midway through the fourth quarter before Holmes scored five points as part of a 10-0 run that cut the Nuggets' lead to 90-88.\n\nHolmes later scored on a soaring one-handed dunk that made it 95-92, before Murray's deep shot just inside the 3-point line. After Barnes scored on a putback, Harris and Murray each hit two free throws.\n\n\"I came out more aggressive,\" said Murray, who missed five of his first six shots. \"That's something I have to change with myself from the jump. I can't just kind of be a part of the offense. I have to be aggressive and create for guys. That's what I did in the second half.\"\n\nRichaun Holmes had 24 points and 12 rebounds for the Kings (0-4). De'Aaron Fox added 20 points and nine assists, and Harrison Barnes and Nemanja Bjelica each scored 12.\n\nFirst-year Sacramento coach Luke Walton felt his team made progress despite the loss, particularly defensively.\n\n\"That's what we have to be,\" Walton said. \"That's why we stress, and there was a point made, becoming a team that comes on defense so that when we have off shooting nights we still have a chance to win.  We really played a competitive game and we stuck together.\"\n\nTIP-INS\n\nNuggets: Denver outscored Sacramento 30-17 in the third quarter. ... Murray and Barton were a combined 2 of 12 in the first half when Denver shot 32.7% from the floor.\n\nKings: The last time Sacramento started 0-4 was in 2008-09, when Reggie Theus was the coach. ... Trevor Ariza made three 3s in the first quarter. He went into the night 1 of 7 from beyond the arc. ... Holmes was called for a technical for taunting after dunking against Denver's Mason Plumlee. ... Marvin Bagley III missed his second consecutive game with a broken thumb. Harry Giles (left knee soreness) was also held out.\n\nTHIRD-QUARTER BLUES\n\nThe Kings have been outscored by 10 or more in the third quarter of every game so far this season. \"I think it's still a focus thing,\" Holmes said. \"We have to come in and just lock in, lock in to what we're doing and lock in fast.\"\n\nQUOTABLE\n\n\"This was a mature win. They were hungry, they played with a lot of energy. And we matched that energy and we finished the deal.\" -- Denver's Mason Plumlee.\n\nUP NEXT\n\nNuggets: Host Dallas Mavericks on Tuesday night.\n\nKings: Host Charlotte Hornets on Wednesday night.\n\n---\n\nMore AP MLB:https://apnews.com/tag/MLB andhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996425.9940531
}