{
  "game_id": "401810183",
  "espn_id": "401810183",
  "date": "Dec 03, 2025",
  "matchup": "NY vs CHA",
  "headline": "Towns, Brunson carry the Knicks to a 119-104 victory over the Hornets",
  "body": "NEW YORK -- — Karl-Anthony Towns had 35 points, 18 rebounds and five assists, Jalen Brunson scored 26 points and the New York Knicks beat the Charlotte Hornets 119-104 on Wednesday night.\n\n\r\n              Mikal Bridges had 16 points, Deuce McBride scored 15 and Josh Hart had 15 points, eight assists and eight rebounds. New York (14-7) improved to 11-1 at Madison Square Garden this season.\n\n\r\n              LaMelo Ball had 34 points, nine assists and eight rebounds, and Tidjane Salaun and Kon Knueppel each had 13 points. Charlotte (6-16) fell to 1-10 on the road and dropped its ninth straight away from home.\n\n\r\n              Playing for the second night in a row and without center Mitchell Robinson (left ankle injury management) did not seem to affect the Knicks, mainly thanks to Towns. The All-Star shot 13 for 23 from the field and nearly earned his 16th double-double of the season in the first half. He had 19 points and nine rebounds at the break.\n\n\r\n              After a slow start shooting, Brunson closed the first half with a buzzer-beating 3-pointer. The Knicks captain scored 18 points over the final 24 minutes, including his 3 to close the first half.\n\n\r\n              Keyed by Brunson, New York outscored Charlotte 42-24 over a 13-plus-minute span in the second half.\n\n\r\n              The Knicks never trailed and surrendered just 12 first-quarter points, their fewest in any quarter this season. They built a 41-21 lead midway through the second quarter.\n\n\r\n              The Hornets outscored the Knicks 26-9 over a 7:45 span of the second quarter, which cut New York’s lead to three. But Brunson’s 3-pointer put New York ahead 53-47 at the break.\n\n\r\n              Up next\r\n              Hornets: At Toronto on Friday.\n\n\r\n              Knicks: Host Utah on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042745.7043982
}