{
  "game_id": "0022001006",
  "espn_id": "401307813",
  "date": "May 07, 2021",
  "matchup": "MIL vs. HOU",
  "headline": "Bucks beat Rockets 141-133, tie Nets for 2nd place in East",
  "body": "MILWAUKEE -- — Brook Lopez had 24 points and Khris Middleton scored 21 of his 23 in the second half to help the Milwaukee Bucks beat the short-handed Houston Rockets 141-133 on Friday night for their fifth consecutive victory.\n\n\r\n                    The Bucks (43-24) tied Brooklyn for second place in the Eastern Conference standings. Milwaukee also has the tiebreaker advantage over Brooklyn because they won two of their their three regular-season meetings.\n\n\r\n                    Philadelphia (46-21) leads the East.\n\n\r\n                    “Looking at the big picture, it would be nice to hold on to it,” Middleton said. “I don’t think it would be the end of the world if we don’t. But I think the main focus for us is to find a way to get ourselves playing our best basketball going into the playoffs.”\n\n\r\n                    Giannis Antetokounmpo gave a more direct response when he was asked whether he was thinking about playoff seeding.\n\n\r\n                    “Hell no,” the reigning two-time MVP replied. “I don't care. I don't care about second. It does not matter. It does not matter. All that matters right now is building good habits and playing good basketball. Guys are playing great.\"\n\n\r\n                    Jrue Holiday had 20 points, Donte DiVincenzo 18 and Bobby Portis 16. Antetokounmpo had 17 points, 11 rebounds and seven assists despite dealing with a stomach ailment.\n\n\r\n                    KJ Martin had 26 points and seven assists — both career highs — as well as seven rebounds for the Rockets before fouling out. Kelly Olynyk added 23 points, 12 rebounds and seven assists. Armoni Brooks had 19 points, one off his career high.\n\n\r\n                    Milwaukee earned a measure of revenge after  falling 143-136 on  April 29 at Houston. Antetokounmpo left that game in the opening minute with a sprained right ankle.\n\n\r\n                    Houston had only eight available players for the rematch. Among the missing Rockets was Kevin Porter Jr., who scored 50 points against the Bucks last week but couldn’t play Friday due to a sprained left ankle.\n\n\r\n                    Khyri Thomas became the 28th player to get in a game for the Rockets this season — tying an NBA record — and he scored 16 points and shot 6 of 7 after signing a 10-day contract earlier Friday. Thomas said he flew from Houston to Chicago and then made the 90-minute drive to Milwaukee.\n\n\r\n                    “I'm never going to take this moment for granted,” Thomas said. “Whether it's 10 days or the whole year, I'm going to take the opportunity and run with it.”\n\n\r\n                    The Orlando Magic also have used 28 players this season. Other teams in NBA history to use 28 were the 2015-16 and 2018-19 Memphis Grizzlies.\n\n\r\n                    Milwaukee still struggled to put away the Rockets, who shot 25 of 53 from 3-point range.\n\n\r\n                    Rockets coach Stephen Silas said he told his players after the game how proud he was of the way they competed under difficult circumstances.\n\n\r\n                    “This is definitely something that we can look back on and hopefully build from,” Silas said.\n\n\r\n                    TIP-INS\n\n\r\n                    Rockets: D.J. Augustin played for the first time since April 12 and scored 17 points. This was Augustin's first time facing the Bucks since they traded him to Houston in a March 19 deal that brought P.J. Tucker to Milwaukee. ... Rookie Anthony Lamb made his first career start and scored 14 points. ... Houston had a season-high 36 assists, the most the Bucks have allowed all year. \n\n\r\n                    Bucks: Middleton returned after missing one game due to a sore left knee. ... After committing 14 turnovers in the first half, the Bucks had just three in the second half. ... Portis is having his foundation treat single mothers to manicures and pedicures at a nail salon in his hometown of Little Rock, Arkansas. “My favorite holiday of the year, it’s Mother’s Day because of my mom,” said Portis, who was raised by a single mother. “She’s like my rock. She’s everything to me.”\n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: At Utah on Saturday to continue this four-game trip. The Rockets lost to the Jazz 114-99 at Salt Lake City on March 12 and 112-89 at Houston  on April 21. \n\n\r\n                    Bucks: At San Antonio on Monday. The Bucks beat the Spurs 120-113 in Milwaukee on March 20.\n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997368.8706298
}