{
  "game_id": "0021701116",
  "espn_id": "400975862",
  "date": "Mar 28, 2018",
  "matchup": "CLE @ CHA",
  "headline": "James ties Jordan's double-figures streak; Cavs top Hornets",
  "body": "CHARLOTTE, N.C. --  LeBron James doesn't go into every game thinking he needs to score 10 points.\n\nThe 14-time All-Star said it just \"organically happens.\"\n\nIt helps, of course, to be a multi-talented 6-foot-8, 250-pound forward viewed by many as the most physically talented basketball player of all-time.\n\nThe 33-year-old James matched Michael Jordan's streak of 866 consecutive double-digit scoring games on Wednesday night, scoring 41 points to help the Cleveland Cavaliers beat the Jordan-owned Charlotte Hornets 118-105 and remain in third place in the Eastern Conference.\n\n\"I can't tell you how I've been able to do it,\" James said. \"Any time I'm mentioned with some of the greats, and arguably the greatest basketball player of all-time in Mike, it's just another feat for me to be just appreciative and humbled by what I'm able to do.\"\n\nHe wasn't the only one making history.\n\nAlthough the game got away from the Hornets in the fourth quarter, there was still the matter of Kemba Walker attempting to pass Dell Curry as the franchise's career scoring leader. After a sluggish three quarters, Walker scored 11 points in the fourth, including a reverse layup with 20 seconds left to break Curry's mark of 9,839 points.\n\n\"I wasn't supposed to be here,\" the 6-foot-1, 184-pound Walker told the crowd moments after the game ended. \"... Anything is possible. If I can do it, anybody can.\"\n\nWalker had to grab a towel to wipe away tears after breaking the record.\n\nJames approached Walker at midcourt as time expired, gave him a huge hug and whispered congratulations in his ear, telling him it was an incredible accomplishment.\n\n\"Listen, if you can be the all-time leading scorer in any franchise, that's incredible,\" James said. \"That's an incredible feat. I definitely went over and just told him how incredible that was. Even though with the season that they're having, when accomplishments happen throughout the season, you try not to take them for granted.  I think it's an incredible feat for him.\"\n\nJordan, who was not at the game, issued a statement through the team saying he was happy for Walker.\n\n\"Becoming a franchise's all-time leading scorer is a big accomplishment and it's a testament to his hard work, dedication and passion for the game of basketball,\" Jordan said. \"He exemplifies what it means to be a Hornet.\"\n\nJordan did not comment on James tying his streak.\n\nJames matched Jordan's 17-year-old mark in the second quarter when he scored his 10th point on a powerful alley-oop dunk off a pass from J.R. Smith.\n\nJames, who began his streak on Jan. 6, 2007, can break Jordan's record Friday night at home against the New Orleans Pelicans.\n\nHe scored 16 points in the second quarter and 13 in the third on 10-of-15 shooting during that span, including 4 of 6 from beyond the arc as the Cavaliers built a 17-point lead heading into the fourth quarter.\n\nThe Hornets cut Cleveland's 20-point lead to 11 points but James re-entered the game and made an immediate impact with a few more highlight reel plays.\n\nHe stole Frank Kaminsky's pass near the top of the key and raced the length of the floor and threw down an emphatic one-handed dunk over Jeremy Lamb that brought the crowd to its feet again. Then with 3:09 left in the game, he grabbed Rodney Hood's miss out of the air and dunked it hard with his right hand, punctuating the Cavaliers' victory.\n\nJames left the game to a standing ovation from the Charlotte crowd, which was filled with Cavaliers fans wearing James' No. 23 jersey.\n\nTIP INS\n\nCavaliers: Shot 71 percent from the field in the second quarter and outscored the Hornets 42-28 to take control.\n\nHornets: Walker established a new team record with his 44th consecutive made free throw. That free throw also brought his career total to 1,999, which broke Gerald Wallace's franchise record of 1,998.\n\nJAMES' DOMINANCE\n\nJames continued his dominance against the Hornets. He had his way against Charlotte in two previous meetings this season, combining for 58 points, 22 rebounds and 21 assists.\n\nIt was also a strong bounce-back game for James, who was limited to 18 points on 7-of-18 shooting in a lopsided loss to the Miami Heat on Tuesday night.\n\nJORDAN'S STREAK\n\nJordan's streak of 866 games with at least 10 points came with the Chicago Bulls and Washington Wizards from 1986-2001.\n\nUP NEXT\n\nCavaliers: Host Pelicans on Friday night.\n\nHornets: Visit Wizards on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764993156.607098
}