{
  "game_id": "0021900775",
  "espn_id": "401161417",
  "date": "Feb 07, 2020",
  "matchup": "SAC vs. MIA",
  "headline": "Kings make 19 3-pointers, thump Heat 105-97",
  "body": "SACRAMENTO, Calif. --  Bogdan Bogdanovic scored 23 points, Buddy Hield added 21 and the Sacramento Kings used 19 3-pointers to beat the Miami Heat 105-97 on Friday night.\n\nDe'Aaron Fox had 16 points and eight assists as the Kings won their fifth in seventh games. Nemanja Bjelica added 15 points and eight assists.\n\nEight days after setting a franchise record with 21 3-pointers, Sacramento nearly matched it while going 19 of 42 beyond the arc. Bogdanovic had six 3s, and Hield and Bjelica had five apiece.\n\nBam Adebayo had 26 points and seven rebounds for Miami. Duncan Robinson added 18 points, six assists and five rebounds.\n\nThe Heat played short-handed, although it won't be for long. All-Star Jimmy Butler did not play after straining his right shoulder in a loss to the Clippers on Wednesday, but got good news after an MRI test on his shoulder came back negative. Newcomers Andre Iguodala, Solomon Hill and Jae Crowder -- acquired in a trade from Memphis earlier this week -- were also held out.\n\nSacramento took advantage and earned a split of the season series with Miami.\n\nThe Kings trailed midway through the third quarter, then took over. Harry Giles scored on a putback, followed by consecutive 3s from Bjelica and Bogdanovic. Hield later added a 3-pointer and Fox made a steal near midcourt and went in for an easy layup.\n\nSacramento went on another big run in the fourth and led by 17.\n\nANXIOUS IGGY\n\nIguodala says he's looking forward to getting back on the court after spending the past few months making his rounds on TV and radio while his stalemate with Memphis went on.\n\n\"It was kind of good for me to step away to see what that life would be like,\" Iguodala said. \"It was a good experience. I was probably too busy.\"\n\nIguodala, 36, last played June 13, 2019, in the playoffs for Golden State but says he feels great after the time away. A two-year, $30 million extension from the Heat didn't hurt, either.\n\n\"I still feel like I have a lot of time left and I think it'll show,\" he said said. \"I'm sure I can get out there right now but I want to be in a position where I'm not being a hindrance. I want to be a plus and a positive every step of the way.\"\n\nTIP-INS\n\nHeat: Derrick Jones Jr. had nine points and six rebounds while starting in place of Butler. ... Tyler Herro (ankle) did not play. ... Miami lost for the first time in eight games this season when Robinson made at least six 3s. He went 6 of 9 beyond the arc.\n\nKings: Kent Bazemore sparked the surge in the fourth quarter with a pair of layups and a dunk that came after he made a steal from behind in the backcourt. He later added a blocked shot.\n\nUP NEXT\n\nHeat: play at the Trail Blazers on Sunday. Miami is looking to sweep the two-game season series with Portland for the second straight year.\n\nKings: host the Spurs on Saturday in the second half of a back-to-back. Sacramento won all three games against San Antonio last season, but lost in overtime at AT&T Center earlier this season.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996393.5263622
}