{
  "game_id": "0022300512",
  "espn_id": "401585140",
  "date": "Jan 09, 2024",
  "matchup": "SAC @ DET",
  "headline": "Domantas Sabonis' 37 points leads Kings to wild 131-110 victory over Pistons",
  "body": "DETROIT -- — Domantas Sabonis scored 37 points, and had 13 assists and 10 rebounds, to help the Sacramento Kings to a roller-coaster 131-110 victory over the Detroit Pistons on Tuesday.\n\n\r\n              The Kings trailed by 20 points in the first quarter, led by 15 in the third, let the Pistons tie the game in the fourth and then pulled away down the stretch. Keegan Murray added 32 points and De'Aaron Fox scored 26.\n\n\r\n              “I thought our defense was great after the first quarter — we gave up 47 points in the first and only 45 in the entire second half,” Kings coach Mike Brown said. “Offensively, I think we were really good as well. We had 39 assists on 54 buckets. That's big time.”\n\n\r\n              Detroit (3-34) has lost five straight since breaking its NBA-record 28-game losing streak. Bojan Bogdanovic scored 26 and Jaden Ivey added 22. \n\n\r\n              “We had too many turnovers and there were too many times where we struggled to get into our offense,” Pistons coach Monty Williams said. “When we start having some success, teams are going to hit us in the mouth and get physical with us. We have to be able to overcome that.”\n\n\r\n              The Pistons played without Cade Cunningham, who will be out at least 7-10 days with a knee sprain, but he was active on the sidelines.\n\n\r\n              “Cade was talking to us — telling us to keep going and keep our energy,” Ivey said. “It just feels like they got a lot of easy transition points off our turnovers.”\n\n\r\n              The Kings were coming off a 133-100 home loss to the New Orleans Pelicans on Sunday.\n\n\r\n              “I don't think there's anything we need to change,” Murray said. “We played five bad quarters, but once we got out of that mindset, we did a good job. We just need to play four quarters at that level to be a really good team.”\n\n\r\n              After Detroit tied the game at 101, Monk scored seven straight points to put the Kings up 110-101 with 7:44 to play. \n\n\r\n              Sacramento led by three points at the half, then started the third quarter with a 15-3 run to go ahead 83-68. Detroit, though, narrowed the gap to 98-95 on an Alec Burks 3-pointer at the end of the period.\n\n\r\n              Detroit hit 15 of its first 18 field-goal attempts, including 5 of 7 on 3-pointers, to take an early 32-17 lead. The Pistons finished the quarter with a season-high 47 points and an 18-point lead.\n\n\r\n              The Kings, though, hit 11 of their first 12 shots in the second quarter and led 68-65 at the half.\n\n\r\n              “I think we were just really aggressive,” Murray said. “We had nine deflections in that quarter, and I think that was the turning point of the game.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: Visit Charlotte on Wednesday for their third game in four nights.\n\n\r\n              Pistons: Host San Antonio on Wednesday for the third game in four nights.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996796.376276
}