{
  "game_id": "401809774",
  "espn_id": "401809774",
  "date": "Nov 07, 2025",
  "matchup": "SA vs HOU",
  "headline": "Barnes, Wembanyama lead Spurs to a 121-110 win over Rockets in the teams' NBA Cup opener",
  "body": "SAN ANTONIO -- — Harrison Barnes scored 24 points, Julian Champagnie and Victor Wembanyama added 22 points apiece and the San Antonio Spurs beat the Houston Rockets 121-110 on Friday night in the NBA Cup opener for both teams.\n\n\r\n              Kevin Durant scored 24 points and Alperen Sengun added 22 for Houston, which had its five-game winning streak halted.\n\n\r\n              Barnes scored the game’s final four points on a pair of free throws and a breakaway dunk after a steal at midcourt with 12 seconds remaining.\n\n\r\n              Champagnie had nine points in the final quarter and finished 6 for 13 on 3-pointers. Champagnie also collected and saved a contested offensive rebound and scooped a loose ball on the defensive end with the Spurs up 115-108.\n\n\r\n              The Rockets were aggressive defensively against Wembanyama. Houston guards Josh Okogie and Reed Sheppard got under Wembanyama and pushed him repeatedly in the chest and out of position offensively in the first half. \n\n\r\n              Wembanyama had four points on 2-for-6 shooting in the opening quarters.\n\n\r\n              San Antonio closed the first half on a 12-0 run, fueled by five turnovers in the final two minutes. Devin Vassell had a 3-pointer and Stephon Castle completed a three-point play during the run. Durant was called for his third personal foul at the start of the run after shoving Barnes to the court. \n\n\r\n              San Antonio and Houston are in West Group C of the NBA Cup, along with Portland, Denver and Golden State.\n\n\r\n              Both teams entered the game with a 5-2 record, but reached that mark differently. The Spurs won their first five games, while the Rockets lost their first two before winning five straight.\n\n\r\n              Up next\r\n              Rockets: At Milwaukee on Sunday.\n\n\r\n              Spurs: Host New Orleans on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042577.620512
}