{
  "game_id": "0022400612",
  "espn_id": "401705178",
  "date": "Jan 22, 2025",
  "matchup": "ATL vs. DET",
  "headline": "Cade Cunningham scores 29 points to lead Pistons past cold-shooting Hawks",
  "body": "ATLANTA -- — Cade Cunningham had 29 points and 11 assists and the Detroit Pistons won for the seventh time it their last eight road games, 114-104 over the Atlanta Hawks on Wednesday night.\n\n\r\n              Malik Beasley had 19 points off the bench and Ausar Thompson had 16 points for Detroit.\n\n\r\n              Dyson Daniels led the Hawks with 20 points and 10 rebounds and Trae Young had 13 points and nine assists. Jalen Johnson had 17 points and nine rebounds.\n\n\r\n              The Hawks shot a season-low 16% from 3-point range, hitting only 6 of 38 attempts.\n\n\r\n              The Pistons led 69-51 at the half, their biggest halftime lead of the season.\n\n\r\n              Takeaways\r\n              Pistons: The Pistons, 12-4 over their last 16 games, slipped past the Hawks into sixth place in the Eastern Conference standings. They are trying to reach the playoffs for the first time since 2019.\n\n\r\n              Hawks: The Hawks played just their second home game in a 25-day period, and they looked weary. The poor 3-point shooting prevented them from making any sort of challenge in the second half. The six Hawks who entered the game averaging at least 10 points per game — Young, Daniels, Johnson, De'Andre Hunter, Bogdan Bogdonovic and Onyeka Okongwu — shot a combined 1 for 29 from beyond the arc.\n\n\r\n              Key moment\r\n              The Pistons went on a 14-2 run late in the second half to stretch the lead from 10 to 22 and the Hawks never cut the deficit under 10 until the final seconds. \n\n\r\n              Key stat\r\n              Bogdanovic was 0 for 9 from the field and has missed his last 14 shots over three-plus games. He is 4 for 29 from 3-point range in his last five games and is shooting a career-low 30.3% from 3 this season.\n\n\r\n              Up next\r\n              The Hawks continue a three-game homestand against the Raptors on Thursday night. The Pistons are at the Magic on Saturday night for the third game of a five-game road trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997946.465881
}