{
  "game_id": "0021801050",
  "espn_id": "401071723",
  "date": "Mar 18, 2019",
  "matchup": "DET @ CLE",
  "headline": "Sexton scores 27, leads Cavaliers past Pistons 126-119",
  "body": "CLEVELAND --  The Cleveland Cavaliers squeaked by without Kevin Love.\n\nThe Detroit Pistons, playing without Blake Griffin, weren't as fortunate.\n\nThe Cavaliers made clutch shots down the stretch for a 126-119 win Monday night in a game that featured six ties and five lead changes in the fourth quarter.\n\nCollin Sexton scored 27 points, including the go-ahead 3-pointer with just under two minutes to play, and the Cavs defeated a Pistons squad that is fighting for a playoff spot in the Eastern Conference.\n\nDetroit coach Dwane Casey, whose team beat Toronto on Sunday, was unhappy following the game, especially with the fact that Cleveland shot 58 percent.\n\n\"I'm totally disappointed in myself and our team and everyone in our locker room,\" he said. \"Our defensive disposition was nil. Nil.\"\n\nThe Pistons (36-34) are sixth in the East, a game ahead of Brooklyn and 2 1/2 in front of Miami, but their previous visit to Cleveland -- when they routed the Cavaliers 129-93 on March 2 -- might have played a role in this loss.\n\n\"I don't think we came out with a healthy enough respect for our opponent -- and we should have,\" Casey said. \"Until we grow up and understand there are no nights we can take for granted in this league, we're not going to be ready for this playoff push.\"\n\nLove was out with a sore back for Cleveland after taking a hard fall in Saturday's loss to Dallas, while Griffin sat out to rest for Detroit.\n\nAndre Drummond nearly made up for Griffin's absence with 21 points and 21 rebounds, but Detroit's center was also displeased with the outcome.\n\n\"We tip-toed around with them the whole game, and they went out and took advantage of it,\" he said.\n\nSexton's 3-pointer gave Cleveland a 115-114 lead with 1:54 left. Following a missed 3 by Wayne Ellington, Cedi Osman hit a 3 with 1:24 to play, putting the Cavaliers up 118-114.\n\nDetroit's Reggie Jackson missed a 3 before Sexton knocked down another shot from behind the arc with 39 seconds left to make it 121-114 and complete a 10-0 run.\n\n\"Those are the moments people remember -- end of the game and you make a big shot,\" Sexton said.\n\nCleveland placed seven players in double figures. Osman had 21 points and Nik Stauskas scored 17, including 15 in the fourth.\n\n\"We made some tough shots and some clutch shots,\" Osman said. \"We had a really good night.\"\n\nDrummond has had 12 games with at least 20 points and 20 rebounds this season.\n\nWayne Ellington hit seven 3s and finished with 25 points.\n\nCasey is monitoring Griffin's workload as the Pistons begin a five-game road trip that will take them to the West Coast. Griffin scored 25 points in 33 minutes Sunday.\n\nCavaliers coach Larry Drew said Love was still sore Monday and didn't participate in the team's morning shootaround. Love has played in 12 games since returning from foot surgery.\n\nGOOD COMPANY\n\nDrummond has 33 games of at least 15 points and 15 rebounds this season, breaking the franchise record previously held by Hall of Famer Bob Lanier, who did it 32 times in 1972-73.\n\nDrummond wasn't paying much attention to the accomplishment.\n\n\"Nah, I'd rather we won,\" he said. \"Winning the game is more important than any individual accolade.\"\n\nMAKING PROGRESS\n\nDrew thought it was gratifying to see Sexton and Osman hit big shots with the game on the line.\n\n\"Those guys have come a long way and you can certainly see the growth in their games,\" Drew said. \"It tells me these guys are starting to get it.\"\n\nTIP-INS\n\nPistons: Jackson scored 15 points. Langston Galloway and Ish Smith each had 13. ... F Thon Maker started in Griffin's spot and had seven points with nine rebounds.\n\nCavaliers: Brandon Knight scored 16 points. Marquese Chriss had 10 points and 10 rebounds. ... F Larry Nance Jr. (bruised rib), G Matthew Dellavedova (concussion), C John Henson (right wrist) and F Tristan Thompson (sore left foot) remain out.\n\nUP NEXT\n\nPistons: Visit the Phoenix Suns on Thursday.\n\nCavaliers: Host the Milwaukee Bucks on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994657.798315
}