{
  "game_id": "0022200490",
  "espn_id": "401468645",
  "date": "Dec 23, 2022",
  "matchup": "MEM @ PHX",
  "headline": "Bane returns, Grizzlies rout Booker-less Suns 125-100",
  "body": "PHOENIX -- — Jaren Jackson Jr. had 24 points and 11 rebounds, Desmond Bane scored 17 points in his return and the Memphis Grizzlies took advantage of Phoenix star Devin Booker's absence to rout the Suns 125-100 on Friday night.\n\n\r\n              Phoenix played without Booker because of groin soreness for the third straight game, with the Suns losing the last two. In his last game, Booker scored a season-high 58 points in a home victory over New Orleans.\n\n\r\n              Tied with Denver for the Western Conference lead at 20-11, the Grizzlies had their starting lineup from last season on the floor for the first time this season. Bane played 24 minutes after missing 18 games because of a sprained right big toe.\n\n\r\n              Memphis scored the first eight points and led 15-4 when Phoenix called its first timeout. The Grizzlies were up 39-20 after 12 minutes after dropping the first two games on a four-game road swing.\n\n\r\n              “Those guys have played a lot together,\" Grizzlies coach Taylor Jenkins said. \"They set a tone, they take pride in that. We definitely needed to play better coming out of the gate, especially on the road. Obviously, offensively the execution was great, but it really started with our defense.”\n\n\r\n              Brandon Clarke had 24 points and nine rebounds off the bench for Memphis. Dillon Brooks added 16 points, Ja Morant had 12 points and 11 assists and Steven Adams grabbed 11 rebounds. The Grizzlies dominated the boards, 53-35.\n\n\r\n              The teams will meet again Tuesday night in Memphis.\n\n\r\n              “We fear nobody. We got a different type of swag to us,\" Brooks said. \"It’s great to have everybody back, it’s great to win like this. We got these guys (Tuesday) so we’re going to be ready.”\n\n\r\n              Deandre Ayton led Phoenix (19-14) with 18 points. Duane Washington Jr. had 14 points in 19 minutes, and Landry Shamet — who scored a career-high 31 points in a loss to Washington on Tuesday night — added 13 points and a team-high five rebounds. Chris Paul had 10 points.\n\n\r\n              “We got to get back chasing something and right now I feel like the prey,\" Suns coach Monty Williams said. \"I don't like that feeling. I told our guys the same thing. We got to get our edge back right from the jump.\n\n\r\n              “They just put their hands on us. Their mentality was we may lose the game, but we are not going to lose the fight and they won both tonight.\"\n\n\r\n              Shamet agreed with his coach.\n\n\r\n              “The basketball stuff doesn't matter if you don't have that kind of physicality, that approach that you need to win games in the NBA,” he said. “We were a step slow and they just played with more energy and purpose than we did.”\n\n\r\n              Before the game, Williams said Booker has been shooting the last couple of days and is progressing a bit, but he “didn’t want to speculate” if Booker would return on Christmas at Denver.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Coach Taylor Jenkins said before the game of Bane’s return: “Real proud of what he’s done the last couple weeks. He’s progressed ahead of schedule.” ... Morant, averaging 27.0 points per game entering Friday, was 4 of 14 from the floor and missed both 3-point attempts. ... Memphis is 9-8 against fellow Western Conference teams.\n\n\r\n              Suns: Jock Landale (concussion protocol) and Josh Okogie (right hip) returned to the Phoenix rotation. “Just having big depth is a plus,” Williams said. Cameron Payne remains sidelined by a sprained right foot. ... The Suns play their next six games on the road.\n\n\r\n              NEXT\n\n\r\n              Grizzlies: At Golden State on Sunday.\n\n\r\n              Suns: At Denver on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994211.8795002
}