{
  "game_id": "0022200905",
  "espn_id": "401469060",
  "date": "Feb 25, 2023",
  "matchup": "ORL vs. IND",
  "headline": "Turner, Haliburton help Pacers rally past Magic 121-108",
  "body": "ORLANDO, Fla. -- — Myles Turner scored 24 points, Tyrese Haliburton had 15 points and 14 assists and the Indiana Pacers ran away from the Orlando Magic in the second half for a 121-108 victory on Saturday night.\n\n\r\n              Indiana shot 59% in the second half and won for only the fourth time in 21 games.\n\n\r\n              “That was one of the better games we’ve played in a while, on the road,” coach Rick Carlisle said. “We've played some good home games, but it's been a while (more than two months) since we've won on the road.”\n\n\r\n              Bennedict Mathurin scored 19 points and Jordan Nwora had 18 for the Pacers, while Jalen Smith added seven rebounds and five blocks.\n\n\r\n              “Jalen Smith and Nora really were exceptional off the bench,” Carlisle said.\n\n\r\n              Franz Wagner led Orlando with 21 points. Paolo Banchero scored 19 points and Markelle Fultz 18. The Magic struggled with their shooting, going 6 for 29 from 3-point range and finished the game at 38.9% overall.\n\n\r\n              Both teams shot below 40% in the first half, while the Pacers blocked nine shots, including four by Smith.\n\n\r\n              Andrew Nembhard, Buddy Hield and Haliburton hit 3-pointers in a 17-2 run to open the second half that put Indiana up by 68-54.\n\n\r\n              “We knew we were due for a big quarter there,” Haliburton said. “I don’t know if the first half was as much them doing a good job on us defensively or us not playing our brand of basketball. But we were able to do that in the third and that was big for us.”\n\n\r\n              Mathurin, Nwora and T.J. Connell sparked another rally that stretched the lead to 19 points with 7:51 left in the game, and a 3-pointer by Mathurn pushed the Pacers' lead to 21, their largest of the game.\n\n\r\n              “Our second unit really helped us today,” Haliburton said. “They have been struggling of late, just getting comfortable playing with each other. I thought they were really good today.”\n\n\r\n              The Magic, who are just behind the Pacers in the conference playoff race, never recovered from the start of the second half.\n\n\r\n              “I think something happened that we can't let happen,” Wagner said. “After a couple of shots being missed or us not getting what we wanted, we let it affect how we played on the other end. That's when they made that run.”\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Indiana's last road win was Dec. 23 at Miami. . . . The Pacers had 34 assists on 48 field goals. . . . Turner, who tied his career high with 40 points against Boston on Thursday night, had only two points until hitting a 10-footer with 3:24 left in the first half. ... Nwora finished the game with a plus-minus of 17.\n\n\r\n              Magic: F Jonathan Isaac, who played a season-high 16 1/2 minutes Thursday night, was held out of the game due to “injury recovery management.” ... Newly acquired C Goga Bitadze had six points and four rebounds in his first minutes with Orlando after Wendell Carter Jr. left the game with three fouls in the first quarter. . . . Carter shot 1 for 11 while taking down a game-high 11 rebounds in 18 minutes. . . . Gary Harris opened the game's scoring with a 3-pointer, but never made another shot in eight filed goal attempts.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Dallas on Tuesday.\n\n\r\n              Magic: At New Orleans on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994322.320111
}