{
  "game_id": "0021600505",
  "espn_id": "400899947",
  "date": "Dec 31, 2016",
  "matchup": "CHA vs. CLE",
  "headline": "James, Love help Cavs end 2016 with 121-109 win over Hornets",
  "body": "CHARLOTTE, N.C. --  LeBron James and Kevin Love picked up much of the slack with Kyrie Irving sidelined by a hamstring injury. They got some help, too.\n\nJames scored 17 of his 32 points in the first quarter, and the Cavaliers beat the Charlotte Hornets 121-109 on Saturday night.\n\nLove added 28 points and 10 rebounds for Cleveland, which played without Irving after the point guard got hurt during Thursday's 124-118 victory over Boston. Jordan McRae, who got the start with Irving out of the lineup, had 20 points, and Kay Felder finished with 13.\n\nJames was 6 for 7 from the field in the first quarter, including a perfect 3 for 3 from beyond the arc.\n\n\"I was just locked in from the beginning,\" James said. \"I had to get off to a good start. Then finding out Kyrie was scratched late ... I just took it upon myself and the team, and we just got off to a great first quarter and it helped us a lot.\"\n\nJames was 12 for 25 from the field in 35 minutes. He also had nine assists and six rebounds.\n\nLove scored 15 points in the second, helping Cleveland to a 71-59 lead at the break. The Cavs went 12 for 18 from 3-point range in the first half.\n\n\"It was great shooting, good ball movement, taking open shots,\" coach Tyronn Lue said. \"Guys were open, and we found open guys. Kevin did a great job of setting the tone with that 3-point shooting early, and we just continued from there.\"\n\nKemba Walker scored 37 points for the Hornets, who had won five of six. Frank Kaminsky added 15 points and Nicolas Batum finished with 13 points and eight assists.\n\nWalker had 20 points on 8-for-12 shooting in the second half, but the Hornets couldn't catch the Cavaliers.\n\n\"They really just brought the intensity early and we didn't match,\" Walker said. \"We just have to be better. By the time we picked it up, it was kind of too late.\"\n\nTIP-INS\n\nCavaliers: McRae was 8 for 12 from the field. \"It was big for our team, and it was big for him to let him know what he's capable of doing in this league,\" James said. \"We needed that from him.\" ... The Cavs' 71 first-half points were their third-most of the season. . Since James returned to Cleveland prior to the 2014-15 season, the Cavs are 9-1 against Charlotte.\n\nHornets: Walker's 37-point effort marked his 31st game of 30 points or more. The only Hornets player with more such games in team history is Glen Rice with 54. ... Charlotte went 20 for 23 at the free-throw line. . Marco Belinelli missed his fourth straight game with a sprained left ankle.\n\nDEFENSIVE STRUGGLES\n\nHornets coach Steve Clifford said he was disappointed with his team's effort on the defensive end of the floor.\n\n\"We don't have the firepower to come in here and win 120-115,\" Clifford said. \"We don't. If our defense is going to be like tonight, it's going to be hard to play well consistently. Hopefully, we can learn from it and play better in Chicago.\"\n\nUP NEXT\n\nCavaliers: Return to Cleveland on Monday night to host the Pelicans in the first game of a two-game homestand.\n\nHornets: Travel to Chicago on Monday night to play the Bulls.",
  "source": "espn_api",
  "crawled_at": 1764995513.425819
}