{
  "game_id": "0022000613",
  "espn_id": "401307398",
  "date": "Mar 16, 2021",
  "matchup": "ATL @ HOU",
  "headline": "Hawks beat Rockets 119-107; Houston drops 17th straight",
  "body": "HOUSTON -- — Danilo Gallinari scored 20 of his 29 points in the first half and the Atlanta Hawks beat Houston 119-107 on Tuesday night, dealing the Rockets a franchise record-tying 17th straight loss.\n\n\r\n                    Atlanta won its sixth straight, matching its longest since the first month of the 2016-17 season. \n\n\r\n                    Houston's losing skid ties the the franchise record by the San Diego Rockets in the team’s inaugural 1967-68 season. The Rockets haven’t won since Feb. 4. \n\n\r\n                    Atlanta led 73-58 at the half, but Houston won the third quarter 34-20 to pull within 93-92 entering the fourth.\n\n\r\n                    “Our defense in the fourth quarter really gave us the win,” Hawks coach Nate McMillan said. “Our guys, they stayed with it, didn’t get rattled and we kept our composure.”\n\n\r\n                    The Hawks were without starting and backup centers Clint Capela (heel) and Onyeka Okongwu (adductor). Without their main two big men, the Hawks started power forwards Gallinari and John Collins. \n\n\r\n                    “I thought both of those guys did a good job of taking advantage of the small-ball they were playing,” McMillan said. “We did a really good job of recognizing where the matchup was and taking advantage of it.”\n\n\r\n                    Gallinari hit 5 of 8 from 3-point range and has scored at least 20 points in four of his last five games after reaching that mark just twice in his first 23 games this season. \n\n\r\n                    “I’m just a lucky guy,” Gallinari said of his recent hot stretch. “I think we have a good rhythm and our chemistry is really getting going. We’re moving the ball and finding the right guy at the right time.”\n\n\r\n                    Collins scored 20 points, and Trae Young had 13 points and 14 assists. Five Hawks scored in double figures by halftime, and six scored at least 10 in the game. \n\n\r\n                    Victor Oladipo led Houston with 34 points, Jae’Sean Tate had 25, and Kevin Porter, Jr., scored 22. \n\n\r\n                    The Rockets were without a slew of players, including Christian Wood, John Wall, Eric Gordon, P.J. Tucker and Ben McLemore. Houston played with the league-minimum eight players, including two players on two-way contracts and one on a 10-day contract. \n\n\r\n                    “I thought we tried hard, and we fought, and we had eight guys and we kind of ran out of gas in the fourth quarter,” Rockets coach Stephen Silas said. “It’s painful, regardless, but you look for small victories in this stretch when we are completely decimated.” \n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Capela, who was traded last February from Houston to Atlanta, received a highlight tribute video and was given an ovation by the Toyota Center crowd during a timeout in the first quarter. ... Without their big men, the Hawks were narrowly outrebounded 38-37. \n\n\r\n                    Rockets: Houston is hopeful Wood (ankle) can return Wednesday against the Warriors. The Rockets have gone 0-17 since his injury. Oladipo is unlikely to play, Silas said. The Rockets are also hoping for a Wednesday return for Danuel House Jr., (right knee contusion). Wall (left knee contusion) is hopeful for a Friday return. \n\n\r\n                    BACK TO .500\n\n\r\n                    The win moves Atlanta to 20-20, back to a .500 record for the first time since Feb. 1. The team fired Lloyd Pierce on March 1 and named McMillan the interim. The Hawks are 6-0 under McMillan. \n\n\r\n                    “Of course, I’m looking at it, but we’re just taking this one game at a time and focusing on trying to get better every game,” McMillan said. “I haven’t talked with the guys a whole lot about our schedule, but this was a goal to try and get on a winning streak and put together a string of wins.”\n\n\r\n                    HE SAID IT\n\n\r\n                    “The fact that we’re in this awful stretch, and they’re not letting go of the rope, and they’re fighting their tails off and showing so much character. Everything I ask them to do, they try to do and that’s what a coach wants his group to do.” -- Rockets coach Stephen Silas \n\n\r\n                    WOMEN’S HISTORY NIGHT\n\n\r\n                    As part of Women’s History Night, the Rockets honored four-time WNBA champion and two-time WNBA League MVP Cynthia Cooper-Dyke, who played for the Houston Comets and is the current head women’s basketball coach at Texas Southern. \n\n\r\n                    “My journey with the Houston Comets was amazing, and I’ll never forget it,” Cooper said in a video. \n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Atlanta returns home to host the Thunder on Thursday night. \n\n\r\n                    Rockets: Houston hosts Golden State on Wednesday night.\n\n\r\n                    ------ \n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997639.361343
}