{
  "game_id": "0022400064",
  "espn_id": "401704630",
  "date": "Oct 23, 2024",
  "matchup": "ATL vs. BKN",
  "headline": "Young scores 30, Okongwu adds career-high 28 as Hawks open with 120-116 win over Nets",
  "body": "ATLANTA -- — Trae Young had 30 points, Onyeka Okongwu added a career-high 28 and the Atlanta Hawks opened the season with a 120-116 victory over the Brooklyn Nets on Wednesday night.\n\n\r\n              Young, who also had 12 assists, sealed it with a pair of free throws with two seconds remaining. \n\n\r\n              Okongwu made 11 of 12 shots from field and all six free throws to eclipse his previous best of 22 points. \n\n\r\n              Cam Thomas led the Nets with 36 points, but it wasn't enough to prevent a loss for Jordi Fernández in his NBA head coaching debut.\n\n\r\n              Atlanta's Jalen Johnson, coming off a $150 million contract extension, had 11 points and 10 rebounds.\n\n\r\n              Zaccharie Risacher, the first overall pick in the NBA draft, made his first shot from 3-point range but finished with just seven points on 2-of-8 shooting for the Hawks.\n\n\r\n              Takeaways\r\n              Nets: Thomas should be able to put up some big numbers for a rebuilding team that doesn't have a whole lot of weapons.\n\n\r\n              Hawks: Dyson Daniels, the No. 8 pick in 2022, didn't do much in his first two seasons with the New Orleans Pelicans. But the Australian guard showed signs of turning things around with the Hawks. He had 15 points and five steals on Wednesday.\n\n\r\n              Key moment\r\n              Brooklyn's Nic Claxton was ejected with 8:03 remaining when he delivered a clothesline shot to Daniels' neck while the Hawks guard was driving for a layup. \n\n\r\n              Daniels hopped up quickly and went after Claxton among the fans behind the hoop. No punches were thrown, but the incident seemed to fire up the Hawks. \n\n\r\n              Key stat\r\n              The Hawks struggled much of the night at the foul line, finishing 33 of 46 and squandering chance after chance to extend their lead.\n\n\r\n              Up next\r\n              Nets: Travel to Orlando to face the Magic on Friday night.\n\n\r\n              Hawks: Host the Charlotte Hornets on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997959.8050098
}