{
  "game_id": "0022200431",
  "espn_id": "401468586",
  "date": "Dec 16, 2022",
  "matchup": "CLE vs. IND",
  "headline": "Mitchell scores 41, Cavaliers rally to beat Pacers 118-112",
  "body": "CLEVELAND -- — Donovan Mitchell scored 18 of his 41 points in the fourth quarter and the Cleveland Cavaliers rallied from a 13-point deficit to beat the Indiana Pacers 118-112 on Friday night.\n\n\r\n              Mitchell buried his eighth 3-pointer of the game with 3:41 remaining, putting Cleveland ahead for good at 112-110. Indiana had taken its largest lead earlier in the fourth at 103-90 on a 3-pointer by Aaron Nesmith.\n\n\r\n              “Mitchell was spectacular, what else are you going to say?” Pacers coach Rick Carlisle said. “He was out of this world. It was breathtaking the plays he continued to make and the shots that he made.”\n\n\r\n              The Cavaliers outscored the Pacers 35-18 in the final period, holding Indiana without a field goal in the final 5:42. Cleveland improved to 13-2 at Rocket Mortgage FieldHouse, tying Memphis for the best home record in the NBA.\n\n\r\n              “I love playing here, I love shooting the ball here,” said Mitchell, who made 14 of 24 field goal attempts and was 8 of 15 beyond the arc. “We were kind of tired, I thought, so I was just trying to do my job the best I could for my team.”\n\n\r\n              The 28-9 game-ending run followed a feisty exchange between Mitchell and Pacers rookie Bennedict Mathurin, who both tightly held onto the ball after a whistle. Their arms remained entangled for nearly 30 seconds after a foul was called on Mitchell, but no words were exchanged.\n\n\r\n              “You don’t poke the bear, and that’s what they did with Donovan,” Cavaliers coach J.B. Bickerstaff said. “There was a lot of chirping and talking and they added a little fuel to the fire.”\n\n\r\n              Darius Garland had 20 points and 10 assists, and Evan Mobley finished with 16 points and nine assists for the Cavaliers. Mitchell has 11 games with at least five 3-pointers, good for second in the league behind Golden State’s Stephen Curry (14).\n\n\r\n              Sixth overall draft pick Mathurin scored 22 points off the bench to lead Indiana, which has lost seven of its last 10. NBA assists leader Tyrese Haliburton had 17 points and 14 assists, and Myles Turner added 12 points and 11 rebounds.\n\n\r\n              It was Haliburton’s 17th double-double in 28 games. The Pacers shot 52.5% percent, but were held to 7 of 19 from the field in the fourth quarter.\n\n\r\n              “We paid a price, a pretty heavy price, and we need to learn from this game,” Carlisle said. \n\n\r\n              STRAIGHT TALK\n\n\r\n              Mitchell is averaging 29.7 points, but Carlisle said scoring is just part of what he has brought to the Cavaliers. “Donovan has simply elevated their entire situation here,” Carlisle said. “With him, Garland is not asked to put up huge numbers every single night, even though he can. They’ve got so many good young players and (Kevin) Love is still capable of hitting six 3-pointers in a row off the bench.”\n\n\r\n              TIP-INS\n\n\r\n              Pacers: G Chris Duarte (left ankle sprain), who last played in an NBA game on Nov. 4, scored 18 points in 22 minutes in the first game of his G League assignment with Fort Wayne. Carlisle said Duarte “could be back with us soon.” He said his conditioning level was good after missing six weeks. … G Kendall Brown (right tibia stress reaction) and C Daniel Theis (right knee surgery) were inactive.\n\n\r\n              Cavaliers: F Cedi Osman leads all NBA bench players in plus-minus. Cleveland has outscored its opponents by 155 points in his 648 minutes played. … C Jarrett Allen is third in the league in contested shots per game with 12.3. Milwaukee’s Brook Lopez is first at 17.7. … G Ricky Rubio (left knee conditioning), F Dean Wade (right ankle sprain) and G Dylan Windler (right ankle sprain) remain out.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host New York on Sunday.\n\n\r\n              Cavaliers: Host Dallas on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995246.24246
}