{
  "game_id": "0022200383",
  "espn_id": "401468538",
  "date": "Dec 09, 2022",
  "matchup": "MEM vs. DET",
  "headline": "Jackson has 20 points, Grizzlies beat Pistons 114-103",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson Jr. had 20 points and four blocks and the Memphis Grizzlies beat the Detroit Pistons 114-103 on Friday night for their fifth straight victory.\n\n\r\n              Brandon Clarke added 17 points for Memphis, missing only one of his eight shots. Dillon Brooks had 16 points, and Ja Morant finished with 15 points and 12 assists.\n\n\r\n              Bojan Bogdanovic led the Pistons with 19 points, Marvin Bagley III scored 14 points, and Kevin Knox II and Isaiah Stewart finished with 13 points each.\n\n\r\n              Memphis pulled away in the third quarter as Morant scored early and the Grizzlies shooting was above 57% in the game. They stretched the lead to 21 and carried a 98-78 advantage into the fourth.\n\n\r\n              “I thought we were just going through the motions in the first half,” Memphis coach Taylor Jenkins said. “We were just dragging in the second quarter. Just didn’t have our energy. “I thought our defense picked up in that third quarter, which really sparked us.”\n\n\r\n              Pistons coach Dwane Casey pointed to the start of the first and third quarters where the game got away, particularly after halftime. He noted the miscues that led to Memphis having a 37-25 advantage in the frame.\n\n\r\n              “We gave up a 37-point third quarter not coming out with the right disposition,” Casey said. “Eight turnovers in the third quarter. That’s the ballgame.”\n\n\r\n              Bagley and Knox came off the Detroit bench to give the Pistons a burst in the second quarter before Memphis carried a 61-53 lead into the break. For Bagley, it was a change in roles after starting most of the season.\n\n\r\n              “I’m just going to keep doing my job. Being ready,” Bagley said, later adding: “You have to be ready no matter what, and that’s what I’ve trained myself to do.”\n\n\r\n              Injuries to key players through the first 26 games hampered Memphis early in the season. Clarke said the team has its rhythm, and the winning streak seems to have come at a familiar time.\n\n\r\n              “We just know this is around the time where we start to win, and we win even if we’ve got guys out,” Clarke said.\n\n\r\n              TIP-INS: \n\n\r\n              Pistons: The game was rookie Jaden Ivey’s first appearance in Memphis, where his mother — Niele Ivey — served as an assistant coach before leading the Notre Dame program. … C Jalen Duren, the rookie who played one season at the University of Memphis, got his first professional start, finishing with 10 points and 12 rebounds. … Bogdanovic connected on a 3-pointer in the third quarter to give him 1,300 3-pointers in his career. \n\n\r\n              Grizzlies: Tied the series at 27 wins each. … Memphis, which entered the game last in the league shooting 70% from the free throw line, made 17 of 32. … …C Steven Adams limped to the locker room in the fourth quarter with an ankle injury and did not return. “He felt fine after the game, but we’ll see how it is (Saturday),” Jenkins said.\n\n\r\n              GRINER HOMECOMING\n\n\r\n              In their pregame remarks, both coaches mentioned the return of WNBA star Brittney Griner to the United States after her release from Russian custody. “I definitely wanted to say how happy myself and the organization is about Brittney Griner being free from her situation,” Casey said.\n\n\r\n              Jenkins said: “I know this was an extremely tough lesson we couldn’t even fathom, but to have our sister back whole with her family, the NBA community, the WNBA community is super important. Super special. But obviously, there’s more work to do to bring other Americans home.”\n\n\r\n              UP NEXT: \n\n\r\n              Pistons: Host the Los Angeles Lakers on Sunday night.\n\n\r\n              Grizzlies: Host Atlanta on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994219.242419
}