{
  "game_id": "0022401000",
  "espn_id": "401705566",
  "date": "Mar 19, 2025",
  "matchup": "MIA vs. DET",
  "headline": "Cunningham banks in a 3 for the win and Pistons send Heat to their 9th straight loss, 116-113",
  "body": "MIAMI -- — Cade Cunningham banked in a 3-pointer with less than a second remaining, giving the Detroit Pistons a 116-113 win over Miami on Wednesday night and sending the Heat to their ninth consecutive loss.\n\n\r\n              Cunningham had his ninth triple-double of the season — 25 points, 12 rebounds and 11 assists for the Pistons, who trailed for most of the second half and never led by more than two until the final second.\n\n\r\n              Bam Adebayo finished with 30 points, nine rebounds and eight assists for the Heat, who are stuck in their longest losing streak since an 11-game slide during the 2007-08 season. \n\n\r\n              Miami was ahead 93-88 going into the fourth quarter and led by eight in the final period. The Heat lost for the NBA-leading 12th time this season when holding a lead at any point in the fourth.\n\n\r\n              Takeaways\r\n              Pistons: How times have changed. Detroit was a 5-point favorite going into the game according to  Sportsbook — ending a streak of 20 consecutive Heat-Pistons games since February 2019 in which Miami was favored. Detroit hadn't been such a big favorite over Miami since it was a 6.5-point pick on Jan. 1, 2017.\n\n\r\n              Heat: Tyler Herro had 29 points for Miami, and the Heat outscored the Pistons by eight points in the 37 minutes he was on the floor. But the Heat got outrebounded 47-37 and gave up 70 paint points.\n\n\r\n              Key moment\r\n              Cunningham had Detroit's final two baskets — both 3-pointers in the final 57 seconds.\n\n\r\n              Key stat\r\n              Cunningham is the fourth player with two triple-doubles against Miami in a season, joining James Harden (2016-17), Domantas Sabonis (2023-24) and Nikola Jokic (this season).\n\n\r\n              Up next\r\n              Detroit goes to Dallas on Friday, before playing seven of its final 11 games at home. Miami plays the second game of its five-game homestand Friday against Houston.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998285.402896
}