{
  "game_id": "0022300933",
  "espn_id": "401585561",
  "date": "Mar 11, 2024",
  "matchup": "CHA @ DET",
  "headline": "Cade Cunningham's 22 points, 8 assists help Pistons top Hornets 114-97 to take 3-game season series",
  "body": "DETROIT -- — Cade Cunningham scored 12 of his 22 points in the first quarter to help Detroit build a double-digit lead and he finished with eight assists in a 114-97 win over the Charlotte Hornets on Monday night, the Pistons' largest margin of victory this season.\n\n\r\n              Cunningham reached 1,200 points and 400 assists in his 54th game, getting those totals in a season quicker than any player in franchise history — one game faster than Hall of Famer Isiah Thomas did during the 1984-85 season.\n\n\r\n              “Playing with a guy like that, it makes the game really simple for me and the team,” said Jalen Duren, who had 20 points and 10 rebounds. “He gets it done every night.”\n\n\r\n              The Pistons have won just 11 games, but they swept the three-game season series against Charlotte.\n\n\r\n              “We haven’t been able to score on them,” coach Steve Clifford said.\n\n\r\n              Brandon Miller, drafted No. 2 overall out of Alabama by the Hornets, had 19 points and seven assists.\n\n\r\n              “He doesn’t play like a rookie,” Clifford said.\n\n\r\n              Charlotte's Miles Bridges had 24 points, but the Flint native and former Michigan State star missed 15 of 24 shots.\n\n\r\n              The Hornets didn't have a third player with 10-plus points until early in the fourth quarter, when Grant Williams made a shot. Williams scored 13 in the final period and finished with 22 points.\n\n\r\n              Detroit, meanwhile, had all five starters scoring in double digits through two-plus quarters. \n\n\r\n              Simone Fontecchio scored 17 points, Isaiah Stewart and Jaden Ivey each added 12 points for the Pistons.\n\n\r\n              The Hornets were without Tre Mann for a third straight game with a groin injury. Since the 23-year-old point guard was acquired from Oklahoma City, he has averaged 11.6 points and 4.7 assists in 11 games for Charlotte. \n\n\r\n              Detroit led 34-23 after the first quarter and was ahead by as much as 17 before halftime.\n\n\r\n              “We got off to a really bad start,” Clifford said.\n\n\r\n              The Hornets went on a 15-0 run to pull within two points late in the first half before giving up five straight points to fall behind 53-46 at halftime.\n\n\r\n              “Our energy went down in the second quarter for whatever reason on the defensive side the ball,” Pistons coach Monty Williams said. “We talked about being greedy, and doing what we did in the first quarter and coming out with that energy so we can run.”\n\n\r\n              Detroit restored its double-digit lead in the third quarter and entered the fourth ahead 86-67. James Wiseman helped the Pistons keep a comfortable cushion in the final quarter, scoring eight of his 10 points with some glimpses of the talent that led to Golden State drafting him No. 2 overall in 2020.\n\n\r\n              “When you can hold a team to 99 points and force 12 turnovers, that's a huge deal,” Williams said.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At Memphis on Wednesday night.\n\n\r\n              Pistons: Host Toronto on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995947.735163
}