{
  "game_id": "0022200653",
  "espn_id": "401468808",
  "date": "Jan 15, 2023",
  "matchup": "ORL @ DEN",
  "headline": "Jokic's late 3 lifts Nuggets past Magic 119-116",
  "body": "DENVER -- — Nikola Jokic hit a go-ahead 3-pointer with 1.2 seconds remaining, capping his 12th triple-double of the season, and the Denver Nuggets won their 13th in a row at home by beating the Orlando Magic 119-116 on Sunday night.\n\n\r\n              Jokic connected from the top of the key, stepping back to get the shot away over Franz Wagner to finish with 17 points, 14 assists and 10 rebounds. It was his 88th career triple-double.\n\n\r\n              “He stepped back, got the space and just shot over the top,” said Aaron Gordon, whose 25 points led the Nuggets. “It was a beautiful shot.”\n\n\r\n              Added Jokic: “It was a good feeling because we won the game basically.” \n\n\r\n              Gordon's final points came on a pair of free throws that gave the Nuggets a 116-115 lead with 16 seconds remaining. Jamal Murray added 18 points.\n\n\r\n              Markelle Fultz had 20 points for the Magic and made one of two free throws with 14 seconds left to play to tie it at 116, setting the stage for Jokic’s shot. Wagner added 19 points and Paolo Banchero had 18. Magic coach Jamahl Mosley said he liked the way his team fought back after falling behind at the half, and noted it took a superb play by Jokic at the end to beat them.\n\n\r\n              “To be on the back end of a five-game road trip and to give that intensity and that effort, coming down the stretch, where an MVP-type player makes the MVP-type play, that’s what it came down to,” said Mosley, whose club closed out a 2/3 road swing.\n\n\r\n              Down by 15 at the half, the Magic pulled within six points on Wagner’s layup just before the close of the third quarter.\n\n\r\n              Orlando went in front 103-102 with 7:47 remaining on a dunk by Bol Bol off an alley-oop pass from Cole Anthony. Bol had seven points in just over a minute to help push Orlando in front, but the game remained tight with the teams trading the lead down the stretch.\n\n\r\n              Michael Porter Jr., who finished with 16 points, connected on his four 3 pointers in the first half, helping the Nuggets take a 69-54 lead. Jokic had nine assists in the first half, matching the Magic’s team total in the first two periods.\n\n\r\n              TIP-INS\n\n\r\n              Magic: G Gary Harris, who was forced to leave Friday’s game at Utah early due to a right hand injury, was back in the starting lineup for his return to Denver. Harris spent more than six years with the Nuggets before going to Orlando as part of the March 2021 trade that brought Gordon to Denver.\n\n\r\n              Nuggets: G Bones Hyland left the game midway through the second quarter with a right ankle sprain and did not return. He landed awkwardly trying to defend against a running dunk by Bol Bol. … F Vlatko Cancar was ruled out of the game against the Magic with a lower left leg contusion.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Return home to host New Orleans on Friday night.\n\n\r\n              Nuggets: Host the Portland Trail Blazers on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994629.058292
}