{
  "game_id": "0021700970",
  "espn_id": "400975716",
  "date": "Mar 07, 2018",
  "matchup": "CLE @ DEN",
  "headline": "James scores 39 as Cavs beat Nuggets 113-108",
  "body": "DENVER --  LeBron James was knocking down shots no matter the angle, the degree of difficulty, the distance or the number of hands in his face.\n\nClosing time just brings the best out in him. Still, as teammate Larry Nance Jr. aptly said of all James' off-balanced makes: \"It was ridiculous.\"\n\nJames scored 39 points, including nine down the stretch, and dished out 10 assists as the Cleveland Cavaliers beat the Denver Nuggets 113-108 on Wednesday night after squandering a 16-point, first-half lead.\n\n\"I just tried to implement my imprint on the game by just closing it out for us,\" James said.\n\nHe certainly did that.\n\nJames made one off-balanced shot after another in the waning minutes to turn back the Nuggets, who didn't take their first lead of the game until 8:35 remaining on a driving layup by Mason Plumlee. Jeff Green gave Cleveland the lead for good minutes later with a 3-pointer on a play set up by James after he tapped a loose ball out to him.\n\nIt was that kind of night for James. He made a deep 3-pointer with 1:11 remaining, thumping himself in the chest with two fists in exuberance.\n\n\"That's why he's the best in the league right now,\" said Nikola Jokic, who had a monster game with 36 points and 13 rebounds.\n\nJames wound up two rebounds shy of a triple-double to help the Cavs kick off a six-game trip in fine fashion. No matter what the Nuggets tried to slow him down, nothing worked. James was in that kind of rhythm.\n\n\"Those are shots that as a defender you just turn around to your coach and go, like, `Sorry,\" Nance said. \"It was incredible.\"\n\nNance once again was in the starting lineup with big men Kevin Love and Tristan Thompson sidelined with injuries. Nance scored 13 points and grabbed 13 boards.\n\nJames was fueled in part by a 126-117 home loss to Denver last Saturday. He said in the morning shootaround: \"You always want to try to give some giveback.\"\n\nThe Nuggets started out sluggish -- trailing by 16 in the second quarter -- as playing on the second night of a back-to-back caught up with them. They rebounded, though just a little too late in losing for a second straight night. They dropped a costly game at Dallas on Tuesday to tighten an already tight playoff chase.\n\n\"Everybody is talking playoff, playoff, playoff,\" Jokic said. \"But we need to think about the next game.\"\n\nTIP-INS\n\nCavaliers: Green was back on the floor after missing two games with lower back soreness. He finished with 10 points. ... F Rodney Hood added 15 points.\n\nNuggets: Denver native and longtime NBA standout Chauncey Billups was part of the ESPN broadcast team. .. Denver had 10 3-pointers. The team hit 19 against the Cavs over the weekend. ... The Nuggets committed 21 turnovers.\n\nFULL-COURT PRESS FOR FOOTBALL\n\nPittsburgh Steelers receiver JuJu Smith-Schuster is trying to court James to the football field. On his Twitter account, Smith-Schuster posted a picture of James in a No. 23 uniform for the Steelers.\n\n\"I'm fine with my sport. Pretty funny, though,\" James said. \"I like tank tops and shorts. I've tried the shoulder pads and it was fun while it lasted. But I'm a tank top and shorts guy.\"\n\nPOSITIVE FEEDBACK\n\nLove was astonished by all the positive feedback he received after opening up about his struggles with mental health issues. Love addressed the subject in a story for The Players' Tribune. He's already received more than 4,000 messages.\n\n\"So many people reaching out,\" said Love, who's sidelined by a broken hand.\n\nDEVELOPING CHEMISTRY\n\nThe Paul Millsap and Jokic combination remains a work in progress, but they're starting to get on the same page. Millsap missed 44 games following surgery on his left wrist.\n\nCoach Michael Malone stressed to Jokic he needed be more assertive. He was, too, connecting on 12 of 14 shots.\n\n\"He's our best player and we need him to step up,\" Malone said.\n\nHIT IN THE HEAD\n\nNear the end of the game, Nuggets guard Jamal Murray appeared to hit his head on James' knee. Malone doesn't think Murray will have to enter the concussion protocol.\n\n\"Being with LeBron for five years, he has big knees,\" Malone said. \"I'm sure for Jamal that hurt him.\"\n\nUP NEXT\n\nCavaliers: Game No. 2 on their trip is Friday in Los Angeles against the Clippers.\n\nNuggets: Host the Los Angeles Lakers on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993168.744529
}