{
  "game_id": "0022200680",
  "espn_id": "401468835",
  "date": "Jan 19, 2023",
  "matchup": "TOR @ MIN",
  "headline": "Russell scores 16 points in 4th, Wolves beat Raptors 128-126",
  "body": "MINNEAPOLIS -- — D’Angelo Russell scored 16 of his 25 points in the fourth quarter, Anthony Edwards had 23 and the Minnesota Timberwolves rallied to beat the Toronto Raptors 128-126 on Thursday night.\n\n\r\n              Kyle Anderson added 20 points and 10 rebounds for Minnesota, which was down Rudy Gobert and Austin Rivers and playing the second game of a back-to-back after a fourth-quarter collapse a night earlier in Denver.\n\n\r\n              The Timberwolves erased a 14-point deficit midway through the fourth with a defensive effort not typically seen from Minnesota, particularly without Gobert making an impact down low. Toronto scored just seven points in the final 9:46.\n\n\r\n              “I just think, as a group, we all held each other accountable,” Russell said. “We all had some early lapses throughout the game where we kind of looked a little subpar just to start, using just what you said as an excuse for us, getting in late and all that. Eventually, we just kind of locked in and tried to do what we’re supposed to do.”\n\n\r\n              Scottie Barnes had 12 of his season-high 29 points in the fourth for Toronto, which had won four of six. Fred VanVleet added 25 points and 10 assists for the Raptors. Toronto scored 62 points in the paint without Gobert to protect the rim and added 23 fast-break points.\n\n\r\n              “Russell obviously got them going, shook free a little bit,” Raptors coach Nick Nurse said. “A few miscues there on defense and then, I don’t know, we just didn’t probably get enough quality looks at the offensive end either. And it was too bad on some of them because we made the right plays and then didn’t take the shot.”\n\n\r\n              Edwards, who was 4 of 12 from the field through three quarters, tied the game at 124 with 3:56 left. Anderson’s runner in the lane gave Minnesota its first lead since 4:42 remaining in the first, and Russell added a pair of free throws.\n\n\r\n              O.G. Anunoby’s 3-point attempt with 0.4 seconds remaining was off the mark. \n\n\r\n              “Encouraged by our guys stepping up,” Minnesota coach Chris Finch said. “They didn’t have a lot of gas. Took them a long time to find it. I think the key to the game was we were able to keep scoring until we could find a defensive rhythm.”\n\n\r\n              The Timberwolves outscored Toronto 23-7 over the final 9:46.\n\n\r\n              “We struggled to stop them all night,” VanVleet said. “They got hot and we kind of stalled out a little bit there the last couple minutes.”\n\n\r\n              Russell was 4 of 4 from 3 in the closing stretch.\n\n\r\n              “It’s like, you seen ‘Bad Boys 2,’ when they like, ‘From now on, that’s how you shoot,’” Anderson said. “I’d say when he’s knocking down shots like that, that’s the Lo we know and the Lo we love. So that’s big time. That’s what we need from him. I expect that from him every time we step onto the floor.”\n\n\r\n              VANVLEET KEEPS GOING\n\n\r\n              VanVleet continued his strong run, taking advantage of Gobert’s absence down low by continually going inside. He was also 4 of 6 from 3-point territory.\n\n\r\n              VanVleet had scored at least 33 points in each of the previous two games.\n\n\r\n              TIP-INS\n\n\r\n              Raptors: VanVleet scored or assisted on Toronto’s final 16 points of the first half. … Joe Wieskamp, on his second 10-day contract, saw his first action for the Raptors this season and was 3 of 3 from 3. … Barnes has scored at least 21 points in four of his past five games \n\n\r\n              Timberwolves: Gobert (right groin soreness) and Rivers (left knee contusion) each missed his second straight game for Minnesota, which is still without Karl-Anthony Towns and Jordan McLaughlin due to longer-term calf injuries. ... The Timberwolves arrived back in town early Thursday morning from Denver. … Anderson added six assists, falling just short of another triple-double. He had a triple-double on Jan. 16 against Utah and was two assists shy of one Wednesday in Denver.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Boston on Saturday\n\n\r\n              Timberwolves: Host Houston on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994453.120534
}