{
  "game_id": "0022401158",
  "espn_id": "401705724",
  "date": "Apr 09, 2025",
  "matchup": "TOR vs. CHA",
  "headline": "Mogbo becomes 1st NBA rookie with a triple-double this season, helps Raptors beat Hornets",
  "body": "TORONTO -- — Jonathan Mogbo had 17 points, a career-high 11 assists and 10 rebounds for the first triple-double by a rookie in the NBA this season, helping the Toronto Raptors beat the short-handed Charlotte Hornets 126-96 on Wednesday night.\n\n\r\n              Jared Rhoden scored 23 points in the Raptors' ninth straight home victory over the Hornets. Scottie Barnes added 17 points and 11 rebounds as the Raptors finished 18-23 at home.\n\n\r\n              AJ Lawson scored 14 points and the Raptors matched their biggest margin of victory this season. Toronto also had a 30-point win at Brooklyn on March 26.\n\n\r\n              Nick Smith Jr. had 28 points and 10 rebounds and Jusuf Nurkic added 26 points for Charlotte. The Hornets have lost five straight and seven in a row in the road.\n\n\r\n              Charlotte’s Taj Gibson had two points and five rebounds in the 1,00th game of his NBA career. Gibson started with Chicago in the 2009-10 season.\n\n\r\n              Toronto’s RJ Barrett and Immanuel Quickley both played 14 minutes in the first half before sitting out the second half. Barrett scored 11 points, and Quickley added eight.\n\n\r\n              Takeaways\r\n              Hornets: Miles Bridges (left hip) was one of nine Charlotte absentees, a list that also included Josh Okogie (left hamstring) and Mark Williams (left foot).\n\n\r\n              Raptors: Forward Brandon Ingram has been shut down for the season after receiving an injection in his injured left ankle, head coach Darko Rajakovic said. Ingram visited a specialist in New York City last week and received a platelet-rich plasma injection on Tuesday.\n\n\r\n              Key moment\r\n              Barnes and Rhoden combined for 18 points in the third quarter as Toronto outscored Charlotte 35-23 to take a 20-point lead.\n\n\r\n              Key stat\r\n              The Raptors scored 64 bench points — 44 more than the Hornets.\n\n\r\n              Up next\r\n              Both teams play Friday night. Charlotte is at Boston, and Toronto is at Dallas. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997601.9790761
}