{
  "game_id": "0021900556",
  "espn_id": "401161198",
  "date": "Jan 08, 2020",
  "matchup": "MIA @ IND",
  "headline": "Heat's Jimmy Butler irate after jawing with Pacers' T.J. Warren: 'He's trash'",
  "body": "INDIANAPOLIS -- The Miami Heat were irritated ahead of their game against Indiana after coach Erik Spoelstra categorized his team as \"mediocre\" on the road.\nAn altercation in the third quarter elevated the Heat's game even more.\nIn the midst of the Heat's outscoring the Pacers 38-23 in the third quarter on the way to a 122-108 rout, Jimmy Butler exchanged bumps, words and gestures with Indiana's T.J. Warren, who was ejected.\nAfterward, Warren said nothing. Butler didn't hesitate to speak his mind.\n\"I mean, to me, I think it's tough for him because I can guard him, and he can't guard me,\" Butler said. \"At the end of the day, that's what it comes down to. I think you just gotta watch your mouth in certain situations. Some s--- you just don't say as a man. He gotta see me the next time because I feel like what he said was truly disrespectful, and it's all good 'cause we see him again.\"\nButler blew kisses to Warren after the latter's ejection. \n\"He's soft,\" Butler said. \"He's not even in my f---ing league. Nowhere near me. If I was their coach, I would never put him on me. Ever again. ... He's trash.\"\n\nThe Heat had little trouble handling the Pacers.\nButler scored 14 points and was one of seven Miami players in double figures. Another was Bam Adebayo, who had 18 points in three quarters. The Heat improved to 10-9 in road games.\n\"It was a real big emphasis because Coach called us 'mediocre' on the road,\" Adebayo said. \"We didn't appreciate that. We tried to prove him wrong.\"\nThe Heat built a 28-point lead by the end of the third quarter and rested their starters.\n\n\"It wasn't about me or my message,\" Spoelstra said. \"It was about this team taking ownership of what we've done so far on the road. Nobody has felt great about that in the locker room, and one of the qualities of this team has been to own things we haven't been doing well and try to correct it.\"\nTyler Herro led Miami with 19 points, Derrick Jones Jr. had 18, and Duncan Robinson scored 11 of his 17 in the third quarter. Goran Dragic and Kendrick Nunn each scored 14.\n\"That's how this team is built,\" Spoelstra said. \"That's how our best player [Butler] is wired. It's fun basketball to be a part of if everybody can embrace it -- that it could be multiple guys, different guys on different nights, and it doesn't necessarily have to be one guy with a high usage rate. Jimmy really facilitates this kind of attitude, and it permeates throughout the team.\"\nThe Pacers were led by forward Domantas Sabonis, with 27 points and 14 rebounds for his 30th double-double of the season.\n\"Just collectively as a unit, they controlled this game from the start,\" Pacers coach Nate McMillan said.\nOLADIPO TARGETS JAN. 29 RETURN\nTwo-time All-Star Pacers guard Victor Oladipo confirmed that the plan for his season debut is a Jan. 29 home game against Chicago, which will mark a little more than a year since he ruptured a right quadriceps tendon in a Jan. 23, 2019, home victory over Toronto.\n\"I think waiting a year was good for me,\" he said Wednesday. \"I think the date is good, something I'm going to look forward to.\"\nA healthy Oladipo could elevate the Pacers to among the Eastern Conference's elite. Without him, they recently defeated defending champion Toronto, as well as LeBron James and the Los Angeles Lakers at home. The sixth-year pro was averaging 18.8 points, 5.6 rebounds, 5.2 assists and 1.7 steals in 36 games before the injury.\n\"I'm just looking forward to going out there and playing basketball again,\" he said. \"It's what I love to do. ... It's been a crazy journey. It's been a tough journey, but it's molded me into a better person. I truly believe that.\"\nTIP-INS\nHeat: Miami has won two games in 12 days against Pacers after losing four in a row last season. ... The Heat improved to 8-0 against Central Division teams.\nPacers: Two days after scoring a season-high 36 points in a win at Charlotte, Warren had just three points before he was ejected after the third-quarter altercation with Butler. ... Point guard Malcolm Brogdon missed his fourth consecutive game due to a lower-back injury.\nUP NEXT\nHeat: At Brooklyn on Friday.\nPacers: At Chicago on Friday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764995516.921081
}