{
  "game_id": "0022401051",
  "espn_id": "401705617",
  "date": "Mar 25, 2025",
  "matchup": "POR vs. CLE",
  "headline": "Darius Garland scores 27 points to lead Cavaliers over Trail Blazers 122-111",
  "body": "PORTLAND, Ore. -- — Darius Garland had 27 points and eight assists to lead the Cleveland Cavaliers to a 122-111 win over the Portland Trail Blazers on Tuesday night.\n\n\r\n              Ty Jerome scored 25 points off the bench and Evan Mobley had 21 points and 12 rebounds in the win. \n\n\r\n              Portland’s Scoot Henderson and Shaedon Sharpe each had 18 points in the loss. \n\n\r\n              Cleveland (58-14) has a five-game lead over Boston for first place in the Eastern Conference with 10 games left to play.\n\n\r\n              Portland (32-41) is 3½ games behind Phoenix for 10th place in the Western Conference and the final spot in the play-in tournament.\n\n\r\n              The Cavaliers were without star guard Donovan Mitchell, who is managing a left groin injury.\n\n\r\n              Takeaways\r\n              Cavaliers: Coach Kenny Atkinson isn’t overly concerned with the Cavs owning the No. 1 seed in the Eastern Conference. His main goal is for his team to be healthy and hit their stride come playoff time. “If it’s the first seed, second seed, third seed, I don’t know. Maybe I should be putting more credence into that,” Atkinson said. “But I do think there have been cases where teams have really tried to bust it and you know, really go for a seed, and I’m not sure that’s the right approach either.”\n\n\r\n              Blazers: Toumani Camara has improved his 3-point shooting in his second season, jumping from 33.7% to 37.8% while taking nearly two more attempts per game. “Last year a lot of fives were guarding him and he took it very personal,” Blazers coach Chauncey Billups said. “That shot is legit and it’s real. We depend on that.”\n\n\r\n              Key moment\r\n              Jerome scored 13 of his 25 points in the third quarter to help the Cavaliers maintain their distance.\n\n\r\n              Key stat\r\n              Cleveland outscored the Blazers 64-42 in the paint.\n\n\r\n              Up next\r\n              Cleveland hosts San Antonio on Thursday night. Portland visits Sacramento on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998157.7558022
}