{
  "game_id": "401809503",
  "espn_id": "401809503",
  "date": "Oct 31, 2025",
  "matchup": "PHI vs BOS",
  "headline": "Brown scores 32 points to lead Celtics past 76ers 109-108 for third straight win",
  "body": "PHILADELPHIA -- — Jaylen Brown scored 32 points, Anfernee Simons added 19 and the Boston Celtics never trailed in a 109-108 win against the Philadelphia 76ers on Friday night. \n\n\r\n              Payton Pritchard and Derrick White had 15 points apiece for the Celtics, who evened their record at .500 by winning their third straight after beginning the season with three consecutive losses. Boston evened a 117-116 season-opening defeat to the 76ers on Oct. 22. \n\n\r\n              Tyrese Maxey scored 26 points to lead Philadelphia, which entered as one of four unbeaten teams in the league. \n\n\r\n              The game was the first as part of the NBA Cup for both teams.\n\n\r\n              Maxey’s drive with 20.8 seconds to play pulled Philadelphia to 109-108. After a Boston turnover on its ensuing possession, Maxey missed on an underhand scoop shot from the lane with 4 seconds left that would have given Philadelphia the lead. \n\n\r\n              Boston's Josh Minott then missed both free throws with 3.8 seconds left, but Joel Embiid was long on a 3-pointer at the buzzer. \n\n\r\n              Boston led by 20 points in a dominating first half. Maxey’s drive with 6 1/2 minutes left in the third tied it at 72-all, but Philadelphia never was able to go in front.\n\n\r\n              Embiid, playing a minutes restriction of about 20 minutes after offseason knee surgery, had 20 points in 25:04. Rookie VJ Edgecombe had 17 points after scoring 34 against the Celtics in his NBA debut.\n\n\r\n              Philadelphia came back from a 16-point, fourth-quarter deficit against Washington on Tuesday in a 139-34 overtime win and nearly rallied against the Celtics. \n\n\r\n              Up next\r\n              Celtics: Host Miami on Saturday night.\n\n\r\n              76ers: At Brooklyn on Sunday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042533.4701362
}