{
  "game_id": "0022200466",
  "espn_id": "401468621",
  "date": "Dec 21, 2022",
  "matchup": "MIL @ CLE",
  "headline": "Mitchell scores 36, leads Cavs past Giannis, Bucks 114-106",
  "body": "CLEVELAND -- — On their third try, the Cavaliers didn't collapse against the Bucks.\n\n\r\n              Donovan Mitchell wasn't going to let that happen again.\n\n\r\n              Mitchell scored 36 points and Cleveland finally put together a complete game against Milwaukee, withstanding superstar Giannis Antetokounmpo's season-high 45-point performance in a 114-106 victory Wednesday night.\n\n\r\n              Darius Garland added 23 points and Jarrett Allen had 19 for the young Cavs, who lost their first two games against the Eastern Conference's top team this season — both times caving in the third quarter and losing by 15 in Milwaukee. \n\n\r\n              Cleveland didn't stumble in the third this time, and held on in the fourth as Antetokounmpo brought Milwaukee back.\n\n\r\n              “You get up 20, 21 against a team like this, its hard to keep them down,” Mitchell said. \"They’re going to continue to fight. There’s no way they just roll over especially a team like this, especially trying to send a message to an Eastern Conference opponent.\n\n\r\n              “When you go against a team that’s been together for this long after the two games we had over there to come here and protect home court. That’s big time.”\n\n\r\n              Mitchell has transformed the Cavs into a playoff team, and perhaps one capable of going deep in the postseason.\n\n\r\n              “The Cavs are very, very dangerous,\" Antetokounmpo said. \"They have great players and a great system. I don’t see any reason for them not to get into the playoffs and have a good run — not against us, though.”\n\n\r\n              Mitchell scored 15 points in the third as the Cavs opened a 24-point lead. But Antetokounmpo wasn't done and the Bucks chipped away to close within five on Pat Connaughton's 3-pointer with 2:21 left.\n\n\r\n              “I was just trying to be aggressive,\" said Antetokounmpo, who missed his first three free throws but finished 11 of 16 from the line. \"When I’m aggressive, I know I can make the right play. I was just trying to do anything to spark the team.”\n\n\r\n              But the Cavs held on down the stretch thanks to Mitchell, who went 9 of 9 from the free-throw line in the fourth as Cleveland closed out the Bucks and perhaps sent a message in the process. Mitchell made 15 of 16 free throws.\n\n\r\n              The Cavs improved the NBA's best home record to 16-2, matching their start in the 2016 championship season. They also displayed maturity in not making the same mistakes as in their first two matchups.\n\n\r\n              “We held our poise,” Cavs coach J.B. Bickerstaff said. “They're a championship team. They're not going to give in. They're going to make their runs. In the past we haven't been able to sustain their runs. Tonight was a great step for us.\"\n\n\r\n              Milwaukee coach Mike Budenholzer is impressed by the Cavs' growth.\n\n\r\n              “With the addition of Mitchell, everyone has the ultimate respect for those guys,” Budenholzer said. \"They’re not surprising anyone at this point, they’ve earned everyone’s respect around the league.”\n\n\r\n              Antetokounmpo scored 24 points in the second half and added 14 rebounds. Brook Lopez had 14 points for the Bucks, who were without injured All-Star forward Khris Middleton.\n\n\r\n              “Giannis was phenomenal tonight,\" Budenholzer said. \"He put the team on his back and had an aggressive mindset the whole game. If he saw a crack tonight, he busted it. But there are times when even he can’t get through five guys.\n\n\r\n              \"If we make 1-2 more shots, maybe we get over the hump.”\n\n\r\n              BANKS ARE OPEN\n\n\r\n              Mitchell banked in a 39-foot 3-pointer with 2.1 seconds left in the third quarter only to be matched by Jrue Holiday, who kissed one off the glass from the same distance at the horn.\n\n\r\n              The two guards shared a laugh and playfully patted each other on the back.\n\n\r\n              “I couldn't help but laugh,” said Mitchell, who said the basketball gods punished him for enjoying his make. “That's what you get when you celebrate too early.”\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Holiday finished with nine points, nine rebound and eight assists. ... Milwaukee didnt record its first assist until midway through the second quarter. ... Middleton missed his third straight game and a timetable for his return is unclear. The three-time All-Star has been limited to seven games after undergoing offseason wrist surgery.\n\n\r\n              Cavaliers: Mobley is one of four players averaging at least 15 points, nine rebounds, 2.5 assists and one block. Antetokounmpo, Joel Embiid and Anthony Davis are the others. ... F Lamar Stevens (knee) missed his third straight game with soreness.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Visit Brooklyn on Friday night. \n\n\r\n              Cavaliers: Host Toronto on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994584.507348
}