{
  "game_id": "0021500349",
  "espn_id": "400828236",
  "date": "Dec 12, 2015",
  "matchup": "HOU vs. LAL",
  "headline": "Harden leads Rockets to lopsided 126-97 win over Lakers",
  "body": "HOUSTON -- The Houston Rockets are certainly not where they want to be yet.\nHowever, they feel like they're getting close.\nThey reached .500 on Saturday night with an easy 126-97 win over the Los Angeles Lakers behind 30 points from James Harden.\n\"We've come a long way,\" interim coach J.B. Bickerstaff said. \"We've got to give guys credit for accepting responsibility of where we were and accepting responsibility and putting responsibility on themselves that they had to do something to change it.\"\n\nA 3-pointer by Nick Young with about seven minutes left got the Lakers within 11, but a 13-2 run by Houston pushed the lead to 115-93 and the Rockets cruised to the victory. Donatas Motiejunas, Harden and Patrick Beverley each made a 3-pointer to cap the key stretch.\nMotiejunas had 11 points in his best game since returning from back surgery.\nKobe Bryant had 25 points, seven rebounds and six assists for the Lakers, who have lost six in a row and 13 of 14.\n\"It's like my rhythm is starting to come back a little and my legs are moving pretty well,\" Bryant said. \"I'm feeling good. I just worked and continued to run and lift and just hoping for the best.\"\nDespite Houston's blowout win, the home crowd seemed to be filled with more Bryant fans than Rockets fans. They cheered loudly every time he touched the ball and chanted \"Kobe! Kobe! Kobe!\" as the final seconds ticked away.\nBryant, who plans to retire after this season, stopped on his way off the court for a hug with former Rocket Steve Francis as the crowd continued to chant his name.\nHarden wasn't bothered by the outpouring for Bryant by the home crowd.\n\"He's a legend,\" Harden said. \"This is his last year. I was chanting his name, too. It's a once in a lifetime chance that you're going to see this guy play again. I haven't had the chance to see Michael (Jordan) play in person, but he's a modern Michael.\"\nThe Rockets shot 52.2 percent (47 for 90) from the field and 15 for 33 from 3-point range, compared to 40 percent (35 for 88) for the Lakers and 10 for 32 from beyond the arc.\nHouston led 63-46 at halftime and scored seven of the first nine points of the third quarter. Beverley's layup made it 70-48 with 9:52 left.\nTerrence Jones made a layup at the end of the third after Corey Brewer blocked a shot by Bryant, giving the Rockets a 91-76 advantage.\nHouston had a 52-29 lead in the first half when Bryant scored 11 points in a 13-0 run for Los Angeles. He made two 3-pointers in the surge and capped the run with three straight free throws after he was fouled by Harden.\nHouston star Dwight Howard scored six straight points to end the first half, highlighted by a soaring, two-handed dunk after a steal.\nTIP-INS\nLakers: G Jordan Clarkson missed his second straight game with a sprained right ankle. ... The loss closed out an eight-game road trip, the team's longest since a nine-game trip from Jan. 31, 2007, to Feb. 13, 2008. ... Young finished with 13 points.\nRockets: Trevor Ariza was back in the starting lineup after missing Houston's last game with a bruised lower back, which snapped a streak of 172 straight games played. ... Ty Lawson was feeling better after recovering from the flu. ... Howard had 18 points and 12 rebounds.\nHARDEN'S TRIBUTE\nHarden wanted to do something to honor Bryant on Saturday night, so he donned special shoes for the occasion.\n\"I even wore the first Kobe's from Adidas tonight,\" he said. \"Just to show how much I respect him and how much he's done for the game of basketball.\"\nIMPRESSED BY BRYANT\nLos Angeles coach Byron Scott was impressed with how well the 37-year-old Bryant played on Saturday night, considering it was the last game of a grueling road trip and the Lakers also played a game on Friday night.\n\"I have no idea,\" Scott said when asked about how he did it. \"I swear to God, I wish I knew. We talked about that earlier that this was on a back-to-back game and he seems to play better, but I don't understand it.\"\nUP NEXT\nLakers: Host Milwaukee on Tuesday.\nRockets: Visit Denver on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994649.758611
}