{
  "game_id": "0021500385",
  "espn_id": "400828272",
  "date": "Dec 17, 2015",
  "matchup": "LAL vs. HOU",
  "headline": "Harden, Jones lead Houston Rockets past Lakers again, 107-87",
  "body": "LOS ANGELES -- Kobe Bryant and Dwight Howard shared a brief pregame hug and a few in-game laughs during the Houston Rockets' comfortable win over the Lakers.\nEven though Howard refused to stay on Bryant's team 2 1/2 years ago, the center still felt some sentimentality for the superstar in his farewell season.\nJames Harden scored 25 points, and Howard added 16 points and 15 rebounds in the Rockets' second victory over Los Angeles in six days, 107-87 on Thursday night.\nBryant scored 22 points and dunked for the first time in his farewell season, elevating over Clint Capela for a one-handed jam. Howard admired it along with everybody in the building.\n\"I already know what the headlines are going to say: Kobe turned back the hands of time,\" Howard said. \"I didn't think he had enough legs to do it, but it's pretty cool. We got to see the old guy still has the legs a little bit.\"\n\nHoward and Bryant parted under acrimonious circumstances in 2013, with Howard leaving millions on the table by refusing to return to the Lakers as a free agent. Howard's move also essentially guaranteed Bryant would finish his career without a sixth ring with the Lakers.\nBut Bryant's third-quarter jam was the latest evidence of rejuvenation for the 20-year veteran over the last two weeks. He went 9 for 16 and grabbed eight rebounds.\n\"My legs felt lively and they felt springy,\" Bryant said. \"I don't know where it came from, but it was there. I can't really explain it. I feel like I can maintain this, but it's always a give-and-take with Father Time. Sometimes he lets me lead the way, and sometimes he leads the way, so you just kind of roll with it. It's a good idea not to mock Father Time. So I'll just say that as long as he lets me lead the way, I'm cool with that.\"\nSTEADY WIN\nTerrence Jones had 16 points to help the Rockets avoid a winless three-game trip. They never trailed in their fifth straight win over the Lakers at Staples Center, Houston's longest road winning streak in the rivalry's history.\n\"There weren't as many periods that we've had in the past of letdown, loss of intensity, loss of focus,\" interim coach J.B. Bickerstaff said.\nKOBE'S DUNK\nThe 37-year-old Bryant hadn't dunked in the Lakers' first 25 games, and Staples Center roared when he drove the lane and threw down on Capela in the third quarter. Bryant had dunked just eight times in 63 games over the past three seasons since his 2012-13 campaign ended early due to a torn Achilles tendon.\n\"Honestly, I don't know where that came from,\" Bryant said. \"It's like the Casey Jr. train: `I think I can, I think I can, I think I can.' First dribble, second dribble, I'm thinking, `My legs feel pretty good.' And then I jumped and I was like, `Oh, I'm still going up.' And then I said, `I might as well give it a try.\"\nHe got the crowd standing again with an under-the-hoop layup later in the quarter. Bryant scored 10 points in the third.\nLOSING CONTINUES\nThe Lakers followed up their fourth victory of the season -- beating Milwaukee by 18 points, their largest margin of victory in two seasons -- with their 14th loss in 16 games. Julius Randle added 18 points and 10 rebounds for the Lakers, who at least avoided another blowout loss to the Rockets after losing by 29 last week.\nTIP-INS\nRockets: Howard got his usual chorus of boos whenever he touched the ball at Staples Center. Even Clippers fans boo Howard for his decision to leave L.A. ... Trevor Ariza got Bryant to sign a pair of Bryant's shoes from their championship season together with the Lakers in 2009. \"We're starting to see him get back to his old self,\" Ariza said.\nLakers: Randle hit the first 3-pointer of his NBA career in the second quarter, beating the shot clock. ... Rookie D'Angelo Russell got so excited about Bryant's dunk that he got a technical foul for leaving the bench area while running along the far baseline. The No. 2 overall pick finished a quiet game with two points on 1-for-9 shooting and seven assists in 26 minutes.\nUP NEXT\nRockets: Host Clippers on Saturday.\nLakers: At Thunder on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994297.954765
}