{
  "game_id": "0021900006",
  "espn_id": "401160628",
  "date": "Oct 23, 2019",
  "matchup": "BKN vs. MIN",
  "headline": "Irving scores 50 but misses last shot, Wolves top Nets in OT",
  "body": "NEW YORK --  Kyrie Irving fell down and frantically rose up, still with a shot to save his Nets debut.\n\nMoments later he was back on the court, laying on his back in disbelief after falling just short in the highest-scoring first game for a team in NBA history.\n\nIrving scored 50 points but lost his balance and missed a potential winning shot that allowed the Minnesota Timberwolves to pull out a 127-126 victory over Brooklyn in overtime Wednesday night.\n\nDespite the loss, Irving said the first game in his new uniform felt incredible.\n\n\"It's a great starting point,\" he said. \"Obviously, you wanted to come out and get a win in front of our home crowd, but we got another chance on Friday.\"\n\nKarl-Anthony Towns had 36 points and 14 rebounds for Minnesota, and Andrew Wiggins finished with 21 points, including the go-ahead basket with 1:19 remaining.\n\nFollowing a Nets timeout, Irving had the ball in his hands with a chance to cap his dazzling debut with a victory. He ran the clock down and then began his drive, but went down after spinning near the foul line. He retained his dribble, got up and shot, but his jumper missed. He then fell back onto the court, hands on his head.\n\nAfter signing with the Nets during the summer, Irving broke Kiki Vandeweghe's record for most points by a player in his first game with a team. Vandeweghe scored 47 for Portland at Kansas City on Oct. 27, 1984.\n\nIrving finished with eight rebounds and seven assists. Caris LeVert added 20 points.\n\nIrving signed along with Kevin Durant in July, wanting to come back home after growing up in New Jersey. He had to pause during his remarks to the crowd before the game but had no trouble keeping his composure -- but ultimately not his footing -- once it started, making seven 3-pointers as the Nets tried desperately to win a season opener for the first time in seven years.\n\nBut Brooklyn didn't have many answers for Towns, who also made seven 3s. Then in OT it was Wiggins, who shot only 10 for 27 but made two straight baskets after the Nets took a 124-123 lead.\n\nIrving sandwiched two 3-pointers around three free throws in just over a minute late in regulation, and with the game tied found a cutting Jarrett Allen in the lane. Allen was fouled but missed both free throws with 5.7 seconds remaining, and the game went to overtime when Wiggins missed a long jumper at the buzzer.\n\n\"This is a special group where very rarely this happens in the NBA,\" Towns said. \"Everyone in this locker room is here for one goal. That's to win.\"\n\nEarly on it was all Minnesota as it started its first full season under coach Ryan Saunders. The Wolves led 20-19 in the first quarter before breaking it open with an 18-3 run that lasted into the second and expanded their lead to 38-22. It would increase to 46-28 and Minnesota took a 68-56 advantage into halftime.\n\nBut the Nets outscored the Wolves 37-20 in the third and it was close from there.\n\n\"It was eventful,\" Saunders said. \"You're kind of lost for words.\"\n\nTIP-INS\n\nTimberwolves: Jarrett Culver, the No. 6 overall pick from NCAA runner-up Texas Tech, had four points. His parents and grandmother were at the game. ... Minnesota has won the last four meetings.\n\nNets: Durant, recovering from Achilles tendon surgery, was the first player announced when the Nets introduced the entire roster before the game. He walked onto the court and eventually joined his teammates to watch from the bench. ... Brooklyn has lost seven straight season openers. ... The Nets signed Timothe Luwawu-Cabarrot, a former first-round pick, to a two-way contract.\n\nOPENING NIGHT EMOTIONS\n\nIrving spoke to the crowd from the court before the game and briefly had to stop his speech when it appeared he was getting choked up.\n\n\"It just hit me before the game,\" Irving said. \"I wasn't trying to get too emotional or anything like that, but I'm just a Jersey kid playing for his home team. There's nothing like it. This has been brewing since I was in fourth grade.\"\n\nSLEEPING IN\n\nThe Wolves opted against holding a morning shootaround. Saunders said the team will at times look to get players extra rest while on the road.\n\n\"I'll use the word fluid and say that it'll be a game-by-game decision and see how these guys feel,\" he said. \"Obviously we're a team that looks at analytics and looks at data and looks at numbers. We want to make sure we take care of our players and these players especially, the pace we were able to play at in preseason, we want to make sure these guys are rested.\"\n\nUP NEXT\n\nTimberwolves: At Charlotte on Friday night.\n\nNets: Host New York on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996729.476862
}