{
  "game_id": "0022300037",
  "espn_id": "401584125",
  "date": "Nov 17, 2023",
  "matchup": "HOU @ LAC",
  "headline": "James Harden's tiebreaking 4-point play snaps Clippers' 6-game skid, beats Rockets 106-100",
  "body": "LOS ANGELES -- — James Harden hit a tiebreaking 3-pointer while getting fouled with six seconds to play, sending the Los Angeles Clippers to their first victory since his arrival with a 106-100 win over the Houston Rockets on Friday night in the NBA In-Season Tournament.\n\n\r\n              Harden dramatically drew the foul from Jae'Sean Tate and drilled his vintage 26-footer from atop the key before completing the four-point play to secure the win. The Clippers had lost six games in a row, including their first five since acquiring Harden from Philadelphia.\n\n\r\n              “We've still got a long way to go, but obviously it felt good to get a win,” Harden said. “You can't take those for granted. But like I continue to say, it's a building process, and I can see a lot of (areas for) improvement on both sides of the ball to correct and get used to.”\n\n\r\n              Jabari Smith Jr. forced Kawhi Leonard to give up the ball on the decisive possession, but Harden came through with the biggest shot of his short tenure with his hometown team. Harden finished with a season-high 24 points and nine rebounds against the Rockets, his team for nine seasons from 2012-2021. \n\n\r\n              “He played great,” Leonard said, mentioning Harden’s 8-of-11 shooting with seven assists and just three turnovers. “That’s a great ratio with as much as he has the basketball. We know how good he is.”\n\n\r\n              Leonard added two free throws in the final second and finished with 26 points as the Clippers avoided their longest losing streak since the 2019 arrivals of Leonard and Paul George, who added 23 points and eight rebounds.\n\n\r\n              “I feel like Kawhi was their first option,” Smith said of Harden's four-point play. “But with three All-Stars and Hall of Famers on their team, I feel like the job wasn’t done, and he just made a tough shot.”\n\n\r\n              Alperen Sengun had 23 points and eight rebounds for the Rockets, whose six-game winning streak ended because they allowed the Clippers to finish the game on a 12-1 run. Jalen Green added 20 points and Fred VanVleet had 19 points and 10 assists in the opener of Houston's three-game California road trip.\n\n\r\n              Russell Westbrook had eight points in just 17 minutes after coming out of the Clippers’ starting lineup at Westbrook’s suggestion in an attempt to balance their rotation. The changes appeared to help for stretches, but Los Angeles still struggled to pull away until their stars took charge late.\n\n\r\n              “Just got to get Russ comfortable,” Clippers coach Tyronn Lue said. “Just switching units and playing with different guys, got to get him used to it. It’s tough to go from starting to the bench, especially the caliber of player he is. We’ve just got to make sure we’ve got the right people on the floor with him.”\n\n\r\n              The Clippers got their first victory in three tournament games, while the Rockets dropped to 1-1 in tournament play.\n\n\r\n              Neither team managed to hold a substantial lead. Houston was up 99-94 with 2:02 left, but George’s driving layup trimmed the lead to one point before Harden drove and dished to Ivica Zubac for a go-ahead dunk in the final minute.\n\n\r\n              Sengun made one of two free throws to tie it 100-100 after Leonard fouled him with 29 seconds to play.\n\n\r\n              Dillon Brooks got another night of enthusiastic boos in the city where his insults of LeBron James did nothing to slow the second-seeded Grizzlies' swift playoff exit last spring. Westbrook laughed in Brooks' face after Brooks fouled the former Lakers guard on a dunk attempt in the first half.\n\n\r\n              Before the game, the Clippers signed big man Daniel Theis, who had two points and three rebounds in his debut. The German veteran, waived by Indiana earlier in the week, will be a backup big man with Mason Plumlee sidelined by a sprained knee.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: At Lakers on Sunday.\n\n\r\n              Clippers: At San Antonio on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995638.769053
}