{
  "game_id": "401809505",
  "espn_id": "401809505",
  "date": "Oct 31, 2025",
  "matchup": "CHI vs NY",
  "headline": "Giddey, Vucevic lead Bulls past Knicks 135-125 and a 5-0 start, their best in 29 years.",
  "body": "CHICAGO -- — Josh Giddey scored a career-high 32 points with 10 rebounds and nine assists, Nikola Vucevic added 26 points, and the Chicago Bulls beat the New York Knicks 135-125 on Friday night to stay undefeated and get out to their best start in nearly three decades.\n\n\r\n              Ayo Dosunmu came of the bench to score 22 points with nine assists for the Bulls, who improved to 5-0 and are off to their best start since the 1996-97 season when they opened 12-0 and went on to win the NBA Championship.\n\n\r\n              Billy Donovan earned his 200th coaching win with Chicago.\n\n\r\n              Jalen Brunson scored 29 points and OG Anunoby had 26 to help power New York’s second-half comeback attempt. The Knicks cut Chicago's lead to two points midway through the fourth quarter after trailing by 22 late in the second quarter.\n\n\r\n              Karl-Anthony Towns added 22 points and 10 rebounds despite playing with a right quad strain and landing hard on his hip in the third quarter. Mikal Bridges scored 23 points in the NBA Cup group play opener for both teams.\n\n\r\n              Both teams relied heavily on 3-pointers, with Chicago hitting 17 of 37 and New York converting 18 of 45. The Bulls outshot the Knicks overall from the floor, 53.6% to 49.5% .\n\n\r\n              The Bulls opened a 72-53 lead at the half, penetrating with crisp passing plays.\n\n\r\n              The Knicks went on a 23-9 run to start the third quarter and closed to 115-113 on Anunoby's 3 with 5:43 left in the fourth quarter before Vucevic and Giddey connected on key possessions to ice it.\n\n\r\n              Mitchell Robinson returned to the Knicks starting lineup after missing New York's first four games with a left ankle injury and had 11 rebounds. Guerschon Yabusele returned after sitting out one game with a sprained left knee.\n\n\r\n              Up next\r\n              Knicks and Bulls: The teams meet again, on Sunday in New York.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042535.001805
}