{
  "game_id": "0021900233",
  "espn_id": "401160875",
  "date": "Nov 23, 2019",
  "matchup": "MIL vs. DET",
  "headline": "Antetokounmpo paces Bucks past Pistons 104-90",
  "body": "MILWAUKEE --  Giannis Antetokounmpo continued to provide the offense, and the Bucks’ defense eventually caught up.\n\nAntetokounmpo had 28 points and 10 rebounds for his 16th consecutive double-double to lead Milwaukee past the Detroit Pistons 104-90 on Saturday night for its seventh straight victory.\n\n\"There were different guys stepping up, making plays,” Bucks coach Mike Budenholzer said. “I think the defense held them tonight. They’re a little banged up on a back-to-back. Unfortunate for them, but kind to us.”\n\nWesley Mathews added 13 points and Eric Bledsoe had 11 for the Bucks, who improved their record to an Eastern Conference-best 13-3.\n\nDerrick Rose scored 20 points, Langston Galloway added 13 and Andre Drummond had 12 points and 17 rebounds for Detroit, which was without Blake Griffin.\n\nThe star forward, who has played in just four games this season, was inactive for injury recovery after playing 32 minutes in a 128-103 victory over Atlanta on Friday in the first game of the back-to-back.\n\n“It doesn’t change my approach. Coming into the game, my mindset is to win,” Antetokounmpo said. “Obviously, when you don’t have a guy like Blake that’s a really great player, and (has) a lot of experience playing, now you’ve got to figure out who you’re guarding and whose going to go against you.”\n\nAntetokounmpo is the first player to open the season with 16 double-doubles in a row since Moses Malone did it for the Houston Rockets in 1981.\n\nAntetokounmpo and George Hill hit consecutive 3-pointers to fuel a 12-0 run to open the fourth quarter and put Milwaukee in front 89-69. Detroit missed its first eight shots of the period before Langston Galloway finally hit a 3 with 5:47 remaining.\n\n“We had some ill-advised shots and didn't execute the way we should have,” Pistons coach Dwane Casey said. “In those moments you’ve got to have a clear understanding of what you are trying to do. We didn't do that.”\n\nThe Bucks used a 15-2 run midway through the third quarter to build a 71-54 lead. Detroit whittled it to 77-69 entering the final period.\n\nCasey said he thought fatigue played a factor, especially down the stretch. The Pistons shot 60% in the victory over Atlanta, but dipped to 41% against the Bucks.\n\n“Shooting is the first part you saw,” Casey said. “The same shots we were getting last night were all short. That is a back-to-back, but that is the whole NBA.”\n\nHill’s 3-pointer at the buzzer put the Bucks up 54-47 at halftime. Milwaukee shot 51% in the first half, making 21 of 41 shots, but Detroit stayed close thanks to nine second-chance points.\n\n“A lot of this is such a two-way sport; offense takes care of the defense, defense takes care of the offense,” said Bucks guard Wesley Matthews. “We start taking care of the ball a little bit better, we had a lot of turnovers on our end, three I think, at least three myself, and it kind of puts the defense in a tough spot. But we responded, we compete and we’re always going to compete.”\n\nTIP-INS\n\nDetroit has four players who were with the Bucks last season: Tim Frazier, Thon Maker, Tony Snell and Christian Wood. “As I went through their depth chart I was like, wow, don’t remember having four from a previous team, previous season and then playing them,” Budenholzer said.\n\nUP NEXT\n\nPistons: Host the Orlando Magic on Monday.\n\nBucks: Host the Utah Jazz on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996169.560048
}