{
  "game_id": "0022000805",
  "espn_id": "401307599",
  "date": "Apr 11, 2021",
  "matchup": "CHA vs. ATL",
  "headline": "Bogdanovic scores 32 as Hawks beat Hornets 105-101",
  "body": "CHARLOTTE, N.C. -- — The Charlotte Hornets hadn't lost a game all season when leading entering the fourth quarter.\n\n\r\n                    Bogdan Bogdanovic put an end to that 22-game streak by scoring 32 points on a career-high eight 3-pointers as the Atlanta Hawks erased a 10-point fourth quarter deficit to beat the Hornets 105-101 Sunday without Trae Young.\n\n\r\n                    Clint Capela added 20 points and 15 rebounds for the surging Hawks, who have won six of seven to take sole possession of fourth place in the Eastern Conference. Brandon Goodwin had 17 points and eight assists for Atlanta (29-25) starting in place of Young.\n\n\r\n                    The short-handed Hawks won despite Young (left calf contusion) and reserve Danilo Gallinari (right foot soreness) sitting out along with John Collins, De’Andre Hunter, Cam Reddish, Tony Snell and Kris Dunn.\n\n\r\n                    “I'm really excited to see us with a full healthy roster,\" Bogdanovic said. \"It is going to bring us to another level.”\n\n\r\n                    Hawks coach Nate McMillan said he spoke to Bogdanovic about passing up too many open shots recently. The 28-year-old responded by making 9 of 22 shots from the field, including 8 of 16 from beyond the arc.\n\n\r\n                    “We had to lean on him probably a little more tonight because we were without a couple of guys,\" McMillan said. “I thought he was aggressive. He had some shots that I thought were tough shots, but he was playing with a lot of confidence.”\n\n\r\n                    Miles Bridges led the Hornets (27-25) with 23 points, and Terry Rozier had 18 points. \n\n\r\n                    The Hawks built a 24-7 lead in the early going, holding the Hornets to just 2 of 13 from the field. \n\n\r\n                    Charlotte battled back to take its first lead midway through the third quarter behind Rozier, who knocked down a pair of 3s from the top of the key. Charlotte later pushed its lead to 10 with 7:16 remaining in the game behind back-to-back driving layups from Brad Wanamaker, a trade deadline acquisition.\n\n\r\n                    But the Hawks rallied to tie it with 2:42 left after Lou Williams connected on two 3s and Capela got free for a dunk off a pretty feed from Goodwin. Williams put the Hawks ahead for good when he scored over Jalen McDaniels on a floating bank shot with 57 seconds left.\n\n\r\n                    The Hornets had a chance to take the lead after a defensive stop with 13.8 seconds left. They pushed the ball up the court, but Rozier missed a hurried 3 from the right corner.\n\n\r\n                    Hornets coach James Borrego elected not to call a timeout after the stop.\n\n\r\n                    “Most times, I’m going to let our guys play in that situation,\" Borrego said. \"We had them on their heels, they’re in transition and that’s our best offense. The ball found the most clutch guy we have right now, and I trust him. I’ll just leave that there.”\n\n\r\n                    Bogdanovic was fouled after the Rozier miss and iced the game with a pair of free throws.\n\n\r\n                    TIP INS\n\n\r\n                    Hawks: Capela had a double-double in the first half with 10 points and 12 rebounds. ... Shot 17 of 39 from 3-point range.\n\n\r\n                    Hornets: P.J. Washington left midway through the third quarter with a right ankle sprain and did not return. ... Charlotte continued to play without LaMelo Ball, Gordon Hayward and Malik Monk due to injuries. ... Former Hornets forward Marvin Williams and former Carolina Panthers linebacker Thomas Davis were in the crowd.\n\n\r\n                    CAPELA'S IMPACT\n\n\r\n                    McMillan called Capela the “glue” for the Hawks all season long, and his impact was certainly felt against the Hornets, who tried to play small ball with P.J. Washington starting in the middle of the defense.\n\n\r\n                    “His ability to defend the basket and cover up mistakes and rebound the ball, his ability to set screens and these guys are finding him on the roll and the lob,” McMillan said. “He’s a threat on both ends of the floor. We are taking advantage of these teams who play small ball.”\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: at Raptors on Tuesday night.\n\n\r\n                    Hornets: Host Lakers on Tuesday night.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997353.1134982
}