{
  "game_id": "0022400093",
  "espn_id": "401704659",
  "date": "Oct 26, 2024",
  "matchup": "TOR @ MIN",
  "headline": "Randle, Edwards each score 24 and Timberwolves top Raptors 112-101",
  "body": "MINNEAPOLIS -- — Julius Randle had 24 points nine rebounds and five assists and the Minnesota Timberwolves beat the Toronto Raptors 112-101 on Saturday night.\n\n\r\n              Anthony Edwards also scored 24 for Minnesota, while Rudy Gobert added 15 points, 13 rebounds and four blocks.\n\n\r\n              Toronto's Gradey Dick led all scorers with 25 points, while Scottie Barnes had 20 points and Ochai Agbaji added 19 for the Raptors.\n\n\r\n              Takeaways\r\n              Raptors: Playing again without leading returning scorer RJ Barrett, who is day-to-day with a shoulder injury, Toronto could not get its offense to click early. The Raptors missed eight of their first nine shots as they fell behind 16-3.\n\n\r\n              Timberwolves: Coming off their run to the Western Conference finals, the Timberwolves sold 11,000 season tickets for the first time since 1990, their first season at Target Center. The crowd for the home opener got its first look at Randle and Donte DiVencenzo, who were acquired in a trade with the New York Knicks, and the duo didn't disappoint. Randle filled the stat sheet, while DiVincenzo scored 16 points, including four 3-pointers.\n\n\r\n              Key moment\r\n              The Raptors trailed by 12 at halftime but started the third quarter with a spurt, cutting Minnesota’s lead to single digits for the first time since early in the first quarter. But Edwards, Jaden McDaniels and Randle combined for 13 straight points to build Minnesota’s lead back to 78-56. The Wolves kept the Raptors at arm's length the rest of the night.\n\n\r\n              Key stat\r\n              After shooting 46 free throws in their win over Milwaukee on Friday, the Raptors went to the line just 13 times, making nine.\n\n\r\n              Up next\r\n              The Timberwolves host Dallas on Tuesday night in a rematch of last season’s Western Conference finals. Toronto returns home to face Denver on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997011.368767
}