{
  "game_id": "0022300528",
  "espn_id": "401585156",
  "date": "Jan 11, 2024",
  "matchup": "MIL vs. BOS",
  "headline": "Portis, Antetokounmpo spark 25-0 spurt in Bucks' 135-102 blowout of Celtics",
  "body": "MILWAUKEE -- — Facing the NBA-leading Boston Celtics got the Milwaukee Bucks to break out of their slump and deliver their most dominating performance of the season.\n\n\r\n              Giannis Antetokounmpo wants to make sure the Bucks maintain that same sense of urgency when they're playing less formidable foes.\n\n\r\n              “There was a respect-slash-fear factor also that's very important for this team, that we have to go out there and play at our best today,” Antetokounmpo said after the Bucks trounced the tired-looking Celtics 135-102 on Thursday for just their second win in six games. \n\n\r\n              Bobby Portis and Antetokounmpo combined to score 20 straight points during a 25-0 spurt midway through the first half. The Bucks led by as many as 43 points in Jrue Holiday’s return to Milwaukee, and their 75-38 lead at the break was their fourth-biggest halftime advantage in franchise history. \n\n\r\n              “Hopefully we can keep this up not just against the Boston Celtics, not just when we have two days off or not when we have not played well,\" Antetokounmpo added. \"Even if we’ve played well and even if we’ve played bad, be able to come in the game and play with the same urgency and with the same focus and with the same energy.”\n\n\r\n              The Bucks hadn’t played a game since losing 132-116 at home to the Utah Jazz on Monday in a game they'd trailed by 31 at halftime. The Celtics were back in action one night after beating the Minnesota Timberwolves 127-120 in overtime. \n\n\r\n              Bucks guard Malik Beasley said the Bucks had a meeting after the Jazz game on how to improve that focused mainly on playing with more effort and energy.\n\n\r\n              “I think we did that,” Beasley said. “We came out and competed. I think the main thing for us, we came out physical. We hit first instead of getting hit.\"\n\n\r\n              Portis scored 28, Antetokounmpo added 24 and both players had 12 rebounds. Damian Lillard chipped in 21 points while returning to Milwaukee’s lineup after missing the Jazz game for personal reasons.\n\n\r\n              “I love the way we responded,\" Bucks coach Adrian Griffin said. \"We responded like champions today.”\n\n\r\n              Boston allowed its highest point total of the season and rested all its starters for the entire second half. The Bucks didn’t play any of their starters in the fourth quarter. \n\n\r\n              Payton Pritchard scored 21 and Sam Hauser 15 for the Celtics, who missed 16 of their first 17 3-point attempts and ended up going 9 of 34 from beyond the arc. Milwaukee shot 56.5% overall.\n\n\r\n              “We just didn't have it tonight,” Celtics coach Joe Mazzulla said. “That can happen from time to time.\"\n\n\r\n              After Boston's Oshae Brissett dunked to cut Milwaukee’s lead to 31-23 with 2:14 remaining in the first quarter, the Celtics wouldn't score again for over 6 1/2 minutes.\n\n\r\n              Portis scored 13 points and Antetokounmpo had seven during that 25-0 spurt. Portis, who had been 1 of 12 from 3-point range this month, was 5 of 6 from beyond the arc on Thursday.\n\n\r\n              Holiday scored six points and shot 2 of 9 in his first game at Milwaukee since the Bucks traded him in September as part of the package to acquire Lillard from the Portland Trail Blazers. Portland sent him to the Celtics a few days later. \n\n\r\n              Holiday played for the Bucks from 2020-23. He received a standing ovation when a tribute video aired on the Fiserv Forum scoreboard during the game’s first timeout.\n\n\r\n              “It was cool to kind of see that,” Holiday said “The fans here have always been great.”\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host the Houston Rockets on Saturday.\n\n\r\n              Bucks: Host the Golden State Warriors on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996134.915539
}