{
  "game_id": "0022200737",
  "espn_id": "401468892",
  "date": "Jan 27, 2023",
  "matchup": "MEM @ MIN",
  "headline": "Timberwolves top Memphis after moment of silence for Nichols",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 13 of his 25 points in the third quarter as Minnesota extended its lead, D’Angelo Russell added 19 points and the Timberwolves topped the short-handed Memphis Grizzlies 111-100 on Friday night.\n\n\r\n              The Grizzlies took the court minutes after v ideo footage was released of 29-year-old Tyre Nichols being beaten by Memphis police officers. \n\n\r\n              There was a moment of silence prior to the game but no demonstration by the Grizzlies or Timberwolves. Both teams offered thoughts to Nichols’ family and friends in messages tweeted before the video was released.\n\n\r\n              “There’s way harder things going on in the city versus what’s going on with our basketball right now,” Memphis coach Taylor Jenkins said. “I’m proud of our guys going out there. As I said before the game, we’re playing with heavy hearts, but we’re also playing for our city that’s going through a lot right now.\"\n\n\r\n              “So, it’s hard, but our guys went out there and competed. I told them the last two games, as we’ve been talking about everything that’s been going on in Memphis with the tragedy to Tyre Nichols, we’ve been staying together.”\n\n\r\n              Jenkins said he had not watched the video footage of the incident when speaking after the game and didn’t think the team had a chance to watch before the game. The Memphis locker room was closed to media after the game and no players were made available.\n\n\r\n              Kyle Anderson had 23 points for Minnesota, which has won four of five. Nathan Knight added 10 points off the bench. The Timberwolves scored 58 points in the paint\n\n\r\n              “I thought we were pretty decisive, drawing a crowd and then making the right play,” Minnesota coach Chris Finch said. “They were pretty heavy in the gaps and do a good job of having multiple bodies at the rim. So, I thought we generated a lot of really, really good looks.”\n\n\r\n              Ja Morant had 27 points, 11 assists and 10 rebounds for Memphis. Dillon Brooks scored 17 for the Grizzlies.\n\n\r\n              Minnesota established a double-digit lead in the first quarter and made it stand. Memphis’ only lead was 7-6.\n\n\r\n              Edwards had eight points during a 12-4 run in the third to give the Timberwolves a game-high 17-point lead.\n\n\r\n              “I’m not worried, I know it’s going to come,” Edwards said. “I’m going to keep making the right play until they loosen up, and then when they loosen up, that’s when I’m going to go. And that’s what I did tonight.”\n\n\r\n              PRAISE FOR ANT\n\n\r\n              Edwards came in averaging 27.8 points, 5 rebounds, 4.8 assists and 1.8 steals per game over his previous 10 games. He’s scored at least 20 points in 10 of his last 11 games.\n\n\r\n              Anderson told the Target Center crowd after the game that Edwards could be in the MVP conversation every season.\n\n\r\n              “He’s playing as an All-Star starter, like and All-Star starter right now, like one of the best 10 players in the league these last few games,” Anderson said later in the locker room. “He’s shown it. And he has a higher ceiling, a lot more room to grow, it’s scary.”\n\n\r\n              ROUGH TRIP\n\n\r\n              Memphis finished its season-long road trip 0-5 during which it lost Steven Adams, Desmond Bane and John Konchar to injuries. Three of the losses were by a combined five points, but there was also a 33-point loss at Sacramento and Friday’s showing at Minnesota.\n\n\r\n              “I called it the road trip of revelations,” Jenkins said. “We’re just learning a lot about ourselves, meat of the season. Told the guys at the end of the game, we’ve put ourselves in a still really good spot. We’ve got 30-plus games left and this happens during a season where you have ups and downs.”\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Bane, who’s second on the team with 21.6 points per game, was held out with right knee soreness. Adams (right knee PCL sprain) missed his third straight game. Konchar (concussion protocol) was out for the second straight game. … Ziaire Williams started for Bane and had seven points.\n\n\r\n              Timberwolves: Taurean Prince missed his third straight game with a left ankle sprain. … Minnesota had 20 turnovers leading to 21 points for the Grizzlies. The Timberwolves scored 12 points on Memphis’ 21 turnovers.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Return home to host Indiana on Sunday.\n\n\r\n              Timberwolves: Play two in a row against Sacramento at home, beginning Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994193.02805
}