{
  "game_id": "0022000008",
  "espn_id": "401266799",
  "date": "Dec 25, 2020",
  "matchup": "LAL vs. DAL",
  "headline": "LeBron becomes No. 2 Xmas scorer, Lakers top Mavs 138-115",
  "body": "LOS ANGELES -- — When LeBron James checked the stat sheet as he left the Staples Center court after his latest high-scoring Christmas victory, he realized the Lakers had scored 138 points with a mere 22 from him.\n\n\r\n                    The NBA champions already look like they could be even better this year. In their second game of the new season, even Luka Doncic didn't stand a chance of keeping up.\n\n\r\n                    Anthony Davis scored 28 points and James became the second-leading Christmas scorer in NBA history during the Los Angeles Lakers' 138-115 victory over the Dallas Mavericks on Friday night.\n\n\r\n                    Montrezl Harrell scored 17 of his 22 points in the second half, and Dennis Schröder had 18 points and six assists in a second strong game for both new additions to the champs. Los Angeles outrebounded Dallas 53-27 and closed out its first win of the season with a dominant fourth quarter.\n\n\r\n                    “We have the ability to where we can have four, maybe even five guys that can score in the 20s any given night,” James said. “As long as we defend and we’re efficient, it’s a beautiful thing to see.”\n\n\r\n                    Doncic had 27 points and seven assists in his first starring role in the NBA’s showcase Christmas evening game for Dallas. Josh Richardson and Trey Burke had 17 points apiece as the Mavs started 0-2 with a late fade.\n\n\r\n                    Dallas' three offensive rebounds were fewer than Harrell, who had five.\n\n\r\n                    “You can’t win a game where the second-chance points are 35-0,” Doncic said. “It’s as simple as that. We box out, we win the game.\"\n\n\r\n                    The Lakers were aggressive and accurate from the opening tip, taking a 69-57 halftime lead while hitting 61.4% of their shots. Doncic went 3 for 10 in the first half but combined with Burke for 22 points in the third quarter to keep it close.\n\n\r\n                    “The more we play with each other, the more we’re going to figure things out,” Davis said. “We prided ourselves on not losing two in a row last year, so we wanted to come out and make sure we do that.”\n\n\r\n                    HOLIDAY CHEERS\n\n\r\n                    James moved into second place behind Kobe Bryant for the most points scored on Christmas, passing Oscar Robertson in the third quarter. James has 383 points in 15 games on Christmas, while Bryant had 395 in 16 holiday appearances.\n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Kristaps Porzingis is on the Mavericks’ trip while recovering from knee surgery in October. Coach Rick Carlisle said the Latvian big man is “making progress all the time. I’m confident in saying it’s weeks, not months (before his return, but that’s all I’m going to tell you. He has a ways to go.” ... This was Dallas' only scheduled meeting with the Lakers this season.\n\n\r\n                    Lakers: Davis was accidentally elbowed in the face by Burke in the first quarter. He had a split lip, but stayed in. ... ESPN reported Schröder has already opened contract extension talks with LA, and the German guard confirmed he would “love to” sign a long-term deal: “It's just got to be fair on both sides.” ... Wesley Matthews, Marc Gasol and Alfonzo McKinnie all scored their first points for the Lakers after going scoreless in the opener. ... They wore powder-blue warmups over their silver-on-white Christmas uniforms with blue accents.\n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: Visit Clippers on Sunday.\n\n\r\n                    Lakers: Host Timberwolves on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997338.3100622
}