{
  "game_id": "0021600031",
  "espn_id": "400899481",
  "date": "Oct 29, 2016",
  "matchup": "MIL vs. BKN",
  "headline": "Henson's tip-in at buzzer leads Bucks past Nets",
  "body": "MILWAUKEE --  Rashad Vaughn's teammates have been urging him to take more shots. He finally listened.\n\nVaughn scored a career-high 22 points, 10 more than his previous best, and hit six 3-pointers in 12 attempts to lead the Milwaukee Bucks past the Brooklyn Nets 110-108 on Saturday night. He connected on three 3s in the fourth quarter with the game on the line.\n\n\"My teammates were giving me a lot of confidence,\" Vaughn said. \"I was feeling it tonight. There were a couple times I didn't shoot and they got on me.\"\n\nVaughn, the Bucks first-round draft pick last season, made just 29 percent of his 3-point attempts during his rookie campaign.\n\n\"He's a threat,\" Bucks coach Jason Kidd said.\n\nDespite Vaughn's hot long-range shooting, the game wasn't decided until John Henson's buzzer-beating tip-in of Jabari Parker's missed layup, which gave the Bucks their first win of the season.\n\nBojan Bogdanovic nailed a 3-pointer to tie the score with 11.6 seconds remaining, setting up Henson's heroics.\n\n\"Their strength is getting to the paint but (Vaughn) was the X factor,\" Nets coach Kenny Atkinson said. \"I give him credit. He came in and hit some big shots.\"\n\nGiannis Antetokounmpo added 21 points and 11 rebounds for Milwaukee. He scored all of his points in the paint, including seven dunks.\n\nBogdanovic's 26 points led the Nets, who made just 11 of 35 3-point attempts.\n\nThe Nets played without oft-injured starting center Brook Lopez, who rested after logging 26 minutes and scoring 25 points on Friday night in a home win over Indiana.\n\n\"(Brook) is our best player. We missed him a lot tonight,\" Bogdanovic said.\n\nTIP INS\n\nNets: The team plans to closely monitor Lopez, who has had three surgeries on his right foot. \"This doesn't mean that he won't play back-to-backs the rest of the year,\" Atkinson said. \"We will look at what is best for him and the team. We want peak performance for the long term.\" . G Greivis Vasquez left the game in the first half with a sore right ankle and didn't return.\n\nBucks: After missing the season opener with a sprained left ankle, Tony Snell made his first appearance with the Bucks since being acquired in an Oct. 17 trade that sent Michael Carter-Williams to Chicago. \"We thought that'd be the best thing, to get him in the flow of things right of the bat instead of sitting and waiting around,\" Kidd said.\n\nMORE TIME\n\nThe Bucks exercised the third-year contract option on Vaughn. The 20-year-old appeared in 70 games during his rookie season and averaged 3.1 points. \"This is a case where we'd love for him to make shots every time he takes the floor but it just doesn't happen right away,\" Kidd said.\n\nSCARY SITUATION\n\nThe Nets have lost 14 straight games on the road and five in a row to Milwaukee. They haven't been over .500 since they were 4-3 on Nov. 12, 2014.\n\nFAMILIAR FACE\n\nSean Kilpatrick, who was on the Bucks summer league roster in 2015, turned in another solid effort for the Nets, tallying 15 points in about 24 minutes. He credited the Bucks coaching staff with improving his overall game. \"They wanted to be me aggressive and just continue to keep playing within the flow of the game,\" Kilpatrick said. \"Coach Kidd, he actually believed in me. The fact that he believes in his players now is something that is helping them.\"\n\nUP NEXT\n\nNets: On Monday, they host Chicago and key newcomers Dwyane Wade and Rajon Rondo.\n\nBucks: At Detroit on Sunday. Milwaukee lost three of four games to the Pistons last season.",
  "source": "espn_api",
  "crawled_at": 1764995233.7875688
}