{
  "game_id": "0021600611",
  "espn_id": "400900032",
  "date": "Jan 15, 2017",
  "matchup": "CHI @ MEM",
  "headline": "McDermott scores career-best 31 to lead Bulls past Grizzlies",
  "body": "MEMPHIS, Tenn. --  Doug McDermott's troubles vanished in one quarter against the Memphis Grizzlies.\n\nMcDermott scored a career-high 31 points, including the final two free throws of the Chicago Bulls' 108-104 victory over Memphis on Sunday night.\n\nMcDermott, who was 7 of 31 from the field in his four previous games, got 20 of his points in the second quarter, helping replace the scoring missing from Dwyane Wade, who did not play on the second night of a back-to-back after the Bulls beat New Orleans at home Saturday.\n\n\"You can't be perfect every game, so you've just got to find a way to contribute out there and continue to work on your game,\" said McDermott, who missed only one of seven shots in the second frame. \"That's what I've done, and I was rewarded for the hard work.\"\n\nTaj Gibson finished with 18 points and eight rebounds for Chicago, and Jimmy Butler had 16 points.\n\nDespite McDermott's first-half scoring, the Bulls were still in a battle at the end. Chicago broke a 104-all tie -- the 11th in the game -- with 26 seconds left on a 15-footer from Butler, who also made an 18-footer with 53.6 seconds remaining. McDermott closed the scoring with a pair of free throws with just under seven seconds left.\n\nButler's steal of the ensuing inbound pass sealed the Bulls' second-straight win.\n\nMike Conley led Memphis with 28 points and eight assists, and Marc Gasol had 24 points and 11 rebounds. Zach Randolph finished with 15 points and a season-best 16 boards.\n\nThe game featured 16 lead changes, and neither team held a double-digit lead.\n\n\"We couldn't get to our defensive coverage to save our lives down the stretch,\" Memphis coach David Fizdale said. \"The second and fourth quarters, we didn't defend at the level we are capable of defending.\"\n\nTIP-INS\n\nBulls: Nikola Mirotic missed his fourth straight game dealing with an illness. ... McDermott's 22 first-half points were more than his total for the four previous games (21). ... Chicago scored 14 points in the first quarter, a season low for the opening frame, but its 38 points in the second was a season-high for a quarter by any Memphis opponent.\n\nGrizzlies: Gasol made a pair of 3-pointers in the first half, marking 17 games this season he has made multiple shots from outside the arc. ... Memphis made 11 3-pointers in the game and has converted at least 10 3s in 20 games this season, including 11 of the last 14 games.\n\nMLK HOLIDAY\n\nThis is the 15th season Memphis has hosted a game on Martin Luther King Jr. Day weekend. The Grizzlies are 6-9 in the holiday game.\n\nIn recognition of the holiday, Memphis wore special MLK50 Pride uniforms. The black jerseys have sea foam blue numbers, letters and piping with the full T-shirt look instead of the normal sleeveless. The piping replicated the railing in front the rooms at the Lorraine Motel, where King was assassinated in 1968, and the blue color was similar to the doors on the rooms.\n\nMISSING WADE\n\nWade's absence meant missing a reunion with Fizdale. Both left the Miami Heat organization after last season -- Wade signing with the Bulls and Fizdale getting his first head coaching job in Memphis. Fizdale said he is sort of a \"basketball romantic\" and would like to have seen Wade retire in Miami. But he predicted after the player's career \"his statue will be out front and (Wade) will be remembered as the great player that he should be.\"\n\nUP NEXT\n\nBulls: Return home to face the Dallas Mavericks on Tuesday night.\n\nGrizzlies: Memphis travels to Washington to face the Wizards on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995056.308896
}