{
  "game_id": "0022201039",
  "espn_id": "401469194",
  "date": "Mar 15, 2023",
  "matchup": "MIN vs. BOS",
  "headline": "Brown scores 35, Celtics hold on to beat Wolves 104-102",
  "body": "MINNEAPOLIS -- — Jaylen Brown scored 35 points and Jayson Tatum added 22 as the Boston Celtics held on to beat the Minnesota Timberwolves 104-102 on Wednesday night.\n\n\r\n              Malcolm Brogdon added 12 points off the bench for Boston, which overcame a tough shooting night to win for the third time in four games.\n\n\r\n              The Celtics shot 40.5% from the field and were 12 of 40 (30%) from 3-point territory. They remained a game ahead of Philadelphia for second in the Eastern Conference and closed within 2 1/2 games of Milwaukee for first.\n\n\r\n              “I thought our physicality, that competitive nature was at a 10 and we just have to continue to execute the margins in clutch situations,” Boston coach Joe Mazzulla said. “We won most of them tonight.”\n\n\r\n              Anthony Edwards had 28 points and 10 rebounds for Minnesota, which has lost three of four. The Timberwolves started the day seventh in the West, one game ahead of Oklahoma City, Dallas and the Los Angeles Lakers.\n\n\r\n              Kyle Anderson scored 15 for Minnesota and Naz Reid added 15 off the bench.\n\n\r\n              “I like the way we fought tonight,” Timberwolves center Rudy Gobert said. “The way we stayed locked in on defense, playing defensively. Not having a lot of things going our way. But we, for the most part, kept our composure. Kept our physicality throughout the whole game. I’m really proud of the way we played.”\n\n\r\n              Trailing 101-99, Edwards missed a 3 with 32.2 seconds left that would have given the Timberwolves their first lead since the first quarter. Grant Williams collected an offensive rebound for Boston and won a jump ball after being tied up.\n\n\r\n              Tatum finished with a pair of free throws to put the game away. Edwards and Anderson were then ejected with 1.7 seconds left after arguing with officials.\n\n\r\n              “For us to be able to win games with adversity, it’s going to be key for us,” Celtics guard Marcus Smart said. “We’re going to get everybody’s best shot. For us, it’s just to keep playing. Teams are going to go on runs and we’ve just got to do a good job of taking the blow and then delivering our own.”\n\n\r\n              Mazzulla went the length of the court to call a timeout while Williams was tied up. Official Brian Forte told a pool reporter that the officiating crew didn’t assess a technical foul on Mazzulla because they didn’t see him cross the mid-court line.\n\n\r\n              Forte also said that Edwards was ejected for “directly questioning the integrity of the officiating crew” and Anderson “was ejected after being assessed his second technical foul for multiple profanities directed at the officiating crew.”\n\n\r\n              Wolves coach Chris Finch said, “I just thought it was just rough. You know, it was really rough out there. A little unbalanced at times.”\n\n\r\n              PHYSICAL PLAY\n\n\r\n              Brown was assessed a technical foul in the first half after an altercation with Gobert. Brown, who is wearing a mask after sustaining a facial fracture, seemed to take offense after getting hit with an elbow from Gobert.\n\n\r\n              Gobert was given a Flagrant I foul in the second half after he challenged a dunk from Tatum. Gobert hit Tatum with his hands as he elevated and Tatum fell hard to the court.\n\n\r\n              Moments earlier, Gobert also got a technical foul for hanging on the rim after a dunk.\n\n\r\n              TOWNS GETTING CLOSER\n\n\r\n              The Wolves released an injury update on Karl-Anthony Towns on Wednesday and said the big man is expected to return “in the coming weeks” from his right calf strain. Towns, out since Nov. 28, has started basketball activities.\n\n\r\n              He was averaging 20.8 points, 8.2 rebounds and 5.3 assists in 21 games before the injury.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Mazzulla said Robert Williams, who missed his sixth straight game with a left hamstring strain, could be back “in the next week or so.” … Tatum was 0 for 8 on 3s but 14 of 16 from the free-throw line. ... Boston led by as many as 14 in the third.\n\n\r\n              Timberwolves: Austin Rivers missed his third straight game with back spasms. Jaylen Nowell has missed eight games with left knee tendinopathy. … Edwards was 7 of 11 shooting in the first half while the rest of the team was 9 of 33.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Play at Portland on Friday.\n\n\r\n              Timberwolves: Play at Chicago on Friday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995014.464205
}