{
  "game_id": "0021800434",
  "espn_id": "401071115",
  "date": "Dec 15, 2018",
  "matchup": "OKC vs. LAC",
  "headline": "George scores 33 to help Thunder top Clippers 110-104",
  "body": "OKLAHOMA CITY --  Paul George rendered the Los Angeles Clippers' traps and double-teams useless.\n\nOklahoma City's forward shredded the Clippers for 33 points, seven rebounds and six assists in a 110-104 victory on Saturday night.\n\n\"I'm fine being trapped,\" George said. \"That's where we're going to need our guys the most -- for them to make plays out of it. Honestly, I think that's the easiest way for me to get myself going because I make those plays early. And we burn them, we hurt them on those plays. They can't trap me anymore. They put two on the ball, find the open guy.\"\n\nGeorge isn't just handling pressure, he's thriving in it. He made 11 of 19 shots against the Clippers and didn't have a turnover.\n\n\"He's great,\" Clippers coach Doc Rivers said. \"He's just so long, tough, plays at a great pace. Can't speed him up, really. He knows he's bigger than most of those guys that's guarding him, so when he's shooting the ball like that, he's tough.\"\n\nIt was the fourth time in seven December games George scored at least 30 points. He's averaging 29.1 points this month while shooting 52 percent from the field.\n\nRussell Westbrook had 13 points, 12 assists, nine rebounds and six steals for Oklahoma City. He made just 4 of 17 shots, yet he had a positive effect on his team.\n\n\"The hustle plays, diving on the floor, the deflections that he generated, and by being disciplined doing that -- it wasn't like he was running around helter skelter,\" Thunder coach Billy Donovan said. \"He was really disciplined. I thought it was a game where, yeah he didn't shoot it great, but I'm not really worried about that. But what he did do was impact the game in a lot of other ways, which I think were important for us.\"\n\nJerami Grant scored 18 points and Steven Adams added 16 for the Thunder, who bounced back from a 109-98 loss at Denver on Friday night.\n\nDanilo Gallinari matched a season high with 28 points, Tobias Harris scored 22 and Montrezl Harrell added 21 for the Clippers.\n\nThe Thunder led 61-50 at halftime, despite Westbrook going scoreless for almost 22 minutes to start the game. George picked up the slack with 21 points in the first half.\n\nLos Angeles' Patrick Beverley got called for a technical foul in the closing seconds of the third quarter, and George made the free throw to give the Thunder an 86-69 lead at the end of the period.\n\nHarrell scored, was fouled and made the free throw with just over a minute remaining to cut Oklahoma City's lead to six. With the margin still six, Harrell was fouled by Westbrook on a dunk attempt with 20.7 seconds left. He missed both free throws, and the Thunder called timeout. Oklahoma City got the ball inbounds, and George passed his way out of a trap to find Grant for a dunk that put the game out of reach.\n\nTIP-INS\n\nClippers: G Lou Williams missed his third straight game with a sore left hamstring. ... C Marcin Gortat was called for a technical in the second quarter. ... Beverley, long hated by Thunder fans for his numerous run-ins with Westbrook, scored nine points but committed five fouls.\n\nThunder: Forced 26 turnovers, the most for an opponent this season. ... Shot 47 percent from the field.\n\nSTAT LINES\n\nWestbrook passed Kobe Bryant for 30th in NBA history in assists.\n\nHE SAID IT\n\nGeorge, on the defensive pressure: \"When we're rotating, when we're in the right spots, we shrink the floor. We make the game easy defensively. We cause guys that aren't necessarily playmakers to make plays. I thought that's what we did.\"\n\nUP NEXT\n\nClippers: Host the Portland Trail Blazers on Monday.\n\nThunder: Host the Chicago Bulls on Monday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994608.01597
}