{
  "game_id": "0021600465",
  "espn_id": "400899907",
  "date": "Dec 26, 2016",
  "matchup": "CHI vs. IND",
  "headline": "Mirotic, Wade lead Bulls over Pacers 90-85 to snap skid at 3",
  "body": "CHICAGO -- Less than two weeks after falling out of the rotation for a couple of games, Nikola Mirotic is playing again and proving his worth to the Chicago Bulls.\nDwyane Wade scored 21 points, Mirotic added a season-high 20 -- including a key basket down the stretch -- and Chicago survived a poor shooting performance for a 90-85 victory over the Indiana Pacers Monday night to snap a three-game losing streak.\n\"We need him to win; it's as simple as that,\" Wade said of Mirotic. \"We need him to play big and he's knows that we believe and trust in him.\n\"Tonight he made big shots and obviously made the biggest one at the end.\"\nJimmy Butler had 16 points despite making only 3 of 12 field-goal attempts. Chicago, which had dropped nine of 12, was 32-for-83 (38.6 percent) from the field for the game.\nAaron Brooks had a season-high 19 points to lead the Pacers, who have lost three straight.\nIndiana, which dropped to 4-12 on the road, has lost five straight and eight of nine at the United Center.\n\"Aaron did a good job out there,\" Pacers coach Nate McMillan said. \"Our second unit got us back in the game.\"\nMirotic pumped in 14 points in 12 first-half minutes to pace the Bulls to a 51-41 halftime lead. He made three 3-pointers to provide the kind of spark Chicago had been looking for from him on a consistent basis.\nHowever, the Bulls' offensive woes returned at the start of the second half. They managed just 12 points in the third quarter as Indiana closed within 63-61 heading into the fourth.\nJust 30 seconds into the final quarter the Pacers pulled even at 64 on a 3-pointer by Brooks. The Bulls, though, answered with 10 straight points for a 74-64 edge. Midway through the quarter Indiana ran off eight straight points to trim the deficit to 76-74 and pulled within 86-85 in the final minute on a 3-pointer by Paul George.\nBut Mirotic hit a long, contested two-pointer with 21.2 seconds left -- and the shot clock running out -- for an 88-85 lead.\n\"I tried to go to the basket with my left hand, but he played great defense -- Thaddeus Young -- and I had to step back,\" Mirotic said. \"I feel comfortable with that shot, but maybe it's not the best shot.\"\nWade then followed with a steal and basket to wrap it up. \"I kind of played free safety on that and baited them to throw it a little bit,\" he said.\nTIP-INS:\nPacers: G Rodney Stuckey (left hamstring) returned after missing two games but lasted only six minutes before reinjuring it. ... G Monta Ellis (strained right groin) missed his fifth straight game and there is no timetable for his return. \"He is getting better, but he hasn't done anything (in practice) with the team,\" McMillan said.\nBulls: F Doug McDermott didn't play because of a left shin injury suffered Sunday at San Antonio. The third-year forward missed 10 games earlier in the season because of two concussions. \"It's unfortunate,\" coach Fred Hoiberg said. \"You could tell Doug's been getting more comfortable as we've been going on and he's been shooting the ball with more confident.\"\nRONDO SITS\nRajon Rondo didn't play in the fourth quarter after playing 24 minutes in the first three. \"It's just the way the game was going,\" Hoiberg said.\nMCW RETURNS\nMichael Carter-Williams returned to the Bulls lineup after missing nearly two months with left knee and left wrist injuries. He finished with one point (0-for-5 from the field) in 19 minutes.\nFREE-THROW WOES\nChicago had a 28-10 edge in free-throw attempts, which left Indiana complaining about the officiating.\n\"(The referees) have got to give us more respect,\" McMillan said. \"We shot only 10 free throws. Paul shot only one free throw the entire game, played 39 minutes. Butler shoots 12 free throws tonight. I mean, they've got to call the game both ways.\"\nUP NEXT\nPacers: Wrap up a quick two-game road trip at Washington on Wednesday.\nBulls: Host Brooklyn on Wednesday after posting 30-point win in first meeting Oct. 31.",
  "source": "espn_api",
  "crawled_at": 1764995069.924542
}