{
  "game_id": "0021600381",
  "espn_id": "400899823",
  "date": "Dec 14, 2016",
  "matchup": "DET @ DAL",
  "headline": "Jackson, Drummond lead Pistons over last-place Mavs 95-85",
  "body": "DALLAS --  Reggie Jackson took another step forward in his return from a knee injury.\n\nJackson scored 20 points -- a season high in his sixth game -- and Andre Drummond led a dominant rebounding effort with 17 as the Detroit Pistons beat the Dallas Mavericks 95-85 on Wednesday night.\n\nDetroit's floor leader had nine points and three of his six assists in the fourth quarter, when the Pistons finished a run that started late in the third to overcome a 12-point Dallas lead. Jackson missed the first 21 games this season recovering from left knee tendinitis.\n\n\"That's the player he can be,\" said teammate Jon Leuer, who scored a season-high 19 points. \"That's the player we need him to be because he is a great floor general and a good leader for us.\"\n\nLeuer was a plus-25 off the bench as the Pistons beat the team with the worst record in the Western Conference three nights after losing to Philadelphia, the last-place team in the East.\n\nDrummond grabbed 10 rebounds in the first 7 1/2 minutes and the Pistons had a 29-9 edge on the boards at halftime and 50-30 for the game. The 6-foot-11 center had more rebounds than Dallas by himself until the middle of the third quarter, when the Mavericks finally went ahead 15-14.\n\nHarrison Barnes led the Mavericks with 19 points.\n\nThe Pistons went on a 27-5 run covering about 10 minutes in the third and fourth quarters, turning a 64-52 deficit into their first double-digit lead at 79-69 after an alley-oop layup by Aron Baynes with about 5 minutes remaining.\n\nDallas' Wesley Matthews had a season-low four points on 2-of-10 shooting, ending a three-game stretch with at least 25 points. Deron Williams scored 16 but was just 3 of 13 as one of the NBA's worst-shooting teams finished at 41 percent, just below its average.\n\n\"This one was frustrating tonight because we had control of the game for most of it,\" Matthews said. \"So we'll learn from it and look at what went wrong.\"\n\nKentavious Caldwell-Pope had seven of his 11 points in the fourth quarter, including a 3-pointer when the Mavericks were within four points with about 3 minutes remaining.\n\nTIP-INS\n\nPistons: Drummond had at least 15 rebounds for the 11th time in 25 games. ... Baynes had 10 rebounds and eight points. ... Jackson's previous season high was 18 points in his debut Dec. 4 against Orlando.\n\nMavericks: Barnes was Dallas' leading scorer for the 13th time in 25 games. ... Williams was 9 of 9 on free throws. ... The Mavericks had a season-high 13 steals.\n\nANOTHER DALLAS INJURY\n\nMavericks center Salah Mejri, who led the team with eight rebounds, injured his left ankle in the fourth quarter and didn't return. He said an X-ray didn't show any damage but he planned to get an MRI on Thursday. Dallas is already missing starter Andrew Bogut with a right knee injury, and there's no timetable for his return.\n\nStar forward Dirk Nowitzki missed his 10th straight game and 18th out of 20 with a strained right Achilles tendon. Key backup guard J.J. Barea missed his 15th straight with a left calf strain.\n\nHOW WAS IT TIED?\n\nThe Pistons were tied 43-all at halftime despite the huge rebounding edge and holding two Dallas starters scoreless, in part because of 13 turnovers to just three for the Mavericks. \"Besides the turnovers, even the ones we didn't turn the ball over, we had a lot of sloppy possessions that we didn't get good shots because we didn't handle the ball well,\" coach Stan Van Gundy said.\n\nUP NEXT\n\nPistons: Friday at Washington, where Detroit has lost four straight games.\n\nMavericks: Friday at Utah, where Dallas lost 97-81 to drop to 0-4 on the way to a franchise-worst 0-5 start.",
  "source": "espn_api",
  "crawled_at": 1764996070.206835
}