{
  "game_id": "0021600746",
  "espn_id": "400900151",
  "date": "Feb 03, 2017",
  "matchup": "ORL vs. TOR",
  "headline": "Magic hold on to defeat Raptors 102-04",
  "body": "ORLANDO, Fla. --  With the season more than halfway over, the Orlando Magic are looking for any sign their playoffs goal is still possible.\n\nToronto, a playoff-tested team and one of the top teams in the Eastern Conference, is giving Orlando hope. The Magic defeated Toronto 102-94 on Friday night for their second win over the Raptors in less than a week.\n\nOrlando pulled out a one-point road win Sunday and then used an impressive second-half to upend the short-handed Raptors at Amway Center on Friday.\n\n\"I think we matchup with them pretty well,\" said Orlando guard C.J. Watson, who came off the bench to score 18 points on Friday. \"We played well against them on the road so we came in pretty confident with this game.\"\n\nIt didn't hurt that the Raptors (30-21) have been reeling with star guard DeMar DeRozan in and out of the lineup with an ankle injury. He played in Sunday's game but didn't suit up Friday night, marking the sixth game in the last seven he has missed.\n\nBut that didn't matter to an Orlando team that has won just twice in its last seven games with both wins coming against the Raptors.\n\n\"Our guys showed a healthy enthusiasm for the game tonight, it's been a tough run for us,\" said Magic coach Frank Vogel, whose team snapped a two-game losing streak to improve to 20-32. \"Nobody is happy with the way we played or what our record looks like but we are not quitting and we are not giving in.\"\n\nThat was obvious in the second half when the Magic fought back from a two-point halftime deficit with a big third period in which they outscored Toronto 21-12. Nikola Vucevic set the tone, scoring 14 straight points in a stretch that saw Orlando go from a one-point deficit leading 68-59. Orlando would not trail again.\n\nVucevic finished with 18 points while scoring just four points in the first half.\n\nIt wasn't just Vucevic alone. Serge Ibaka (20 points and 12 rebounds) played well early and then Evan Fournier (20 points and 10 rebounds) and Watson carried Orlando during the fourth quarter as the Raptors stayed within reach.\n\n\"That was definitely good win tonight,\" said Fournier. \"We've been there before but we have to make sure we have the same approach tomorrow.\"\n\nRaptors coach Dwane Casey felt like the third quarter did his team in. They came close down the stretch but couldn't make up for the double-digit deficit that was built in the third.\n\n\"You can't score 12 points in the third quarter and beat any team in the NBA,\" Casey said. \"We didn't come out with our guns blazing in the third quarter.\"\n\nTIP-INS\n\nRaptors: DeRozan did not suit up for Friday's game due to continued problems with his ankle. He has now missed six of the Raptors last seven games because of the injury. ... Patrick Patterson suffered a left knee contusion in the first quarter and  did not return.\n\nMagic: Aaron Gordon has been selected to compete in the NBA Slam Dunk Contest during All-Star Weekend. He finished second in the competition last year.\n\nSUMMERTIME FEELING\n\nWatson said felt good matching up on Kyle Lowry late because the two practice together in Las Vegas during the summer. So he knows Lowry's tendencies.\n\n\"Just to stay close to him,\" Watson said. \"I know him a little because sometime together in the summer time so there are is a little familiarity with him so it's pretty easy to guard him.\"\n\nUP NEXT\n\nRaptors: Toronto concludes a three-game road swing with a stop in Brooklyn to play the Nets on Sunday afternoon.\n\nMagic: Orlando sets out a two-game road trip with the first game at Atlanta on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995838.525153
}