{
  "game_id": "0021800303",
  "espn_id": "401070984",
  "date": "Nov 27, 2018",
  "matchup": "TOR @ MEM",
  "headline": "Lowry, VanVleet lead Raptors to 122-114 win over Grizzlies",
  "body": "MEMPHIS, Tenn. --  The Toronto Raptors were teetering on the edge of their winning streak ending, facing a 17-point, second-half deficit.\n\nA 3-point shooting show erased any worries.\n\nThe Raptors converted 10 of 17 shots from outside the arc in the second half, including 7 of 12 in the fourth to pull away from the Memphis Grizzlies for a 122-114 victory on Tuesday night.\n\n\"We had a real gut check at halftime there,\" Raptors coach Nick Nurse said after Toronto trailed 71-59 at the break. \"We weren't really doing the things that we wanted to do, and then we came out and played a lot better in the second half.\"\n\nKyle Lowry had 24 points and six assists, and Fred VanVleet added 18 points to lead the Raptors. VanVleet made all six shots on the night, including three from outside the arc in the fourth.\n\n\"We know I haven't been shooting the ball well,\" VanVleet said. \"That's no secret. So, to get back on track a little bit is always fun.\"\n\nKawhi Leonard finished with 17 points and 10 rebounds, and Serge Ibaka scored 16 points as the Raptors won their sixth straight and maintained the best record in the NBA (18-4).\n\nThe loss marked the second time in two games that Memphis lost a double-digit lead early in the third by allowing its opponents to dominate after halftime. The Grizzlies squandered a 13-point lead in their loss to the New York Knicks on Sunday.\n\n\"They put a ton of pressure on you. Their style won the fight,\" Memphis coach J.B. Bickerstaff said of the Raptors, later adding: \"I think we got rushed to be honest with you. They turned up their defensive pressure and we got sped up. Again, we play a certain style, and we weren't comfortable with some of the shots because they were rushed.\"\n\nMarc Gasol led Memphis with 27 points, making 10 of his 14 shots. Mike Conley added 20 points and six assists.\n\nThe barrage of 3-pointers from Toronto in the middle stages of the fourth keyed a 17-2 burst. The Raptors would never trail again.\n\nThe Raptors steadily cut into the deficit in the second half before the 3-point shooting display. Three straight 3-pointers from OG Anunoby, Delon Wright and VanVleet, pulled the Raptors even at 105-all near the midway point of the fourth.\n\n\"I felt like we didn't play defense at all,\" Grizzlies guard Shelvin Mack said. \"Even in the first half, giving up 59 points in a half is unlike us. .Scoring 71 points, you get kind of disguised about how bad we were defensively.\"\n\nTIP-INS\n\nRaptors: Jonas Valanciunas came off the bench for the seventh time this season. ... Memphis led 32-31 after the first quarter, breaking a string of five straight games where Toronto led after the first. ... Both Ibaka and coach Nick Nurse drew technical fouls in the last two minutes of the second quarter. ... Toronto has won four straight and six of seven in the series.\n\nGrizzlies: Jaren Jackson Jr. became the fourth player in NBA history with at least 250 points, 20 steals, and 40 blocks in first 20 career games. The other three were David Robinson, Bill Walton and Patrick Ewing. ... Lost consecutive home games for the first time this season. ... Lost their third straight, the longest skid of the season.\n\nSTREAKING\n\nThe sixth straight win matched a season-best for Toronto. In fact, it was the third time Toronto has won six straight, equaling its 18 wins for the season. The Raptors lost at Milwaukee after winning their first six, then went on another six-game tear. There was a three-game slide before the current victory stretch.\n\nGASOL LIMPING\n\nGasol came up limping late in the fourth quarter after apparently rolling his ankle. The team didn't release anything official after the game, saying medical personnel would evaluate him Wednesday.\n\nUP NEXT\n\nRaptors: Host the Golden State Warriors on Thursday\n\nGrizzlies: Travel to Brooklyn to face the Nets on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994285.651465
}