{
  "game_id": "0021801200",
  "espn_id": "401071874",
  "date": "Apr 07, 2019",
  "matchup": "PHX @ HOU",
  "headline": "Rockets top own NBA mark with 27 3-pointers",
  "body": "HOUSTON -- In a game that was decided by halftime, Houston's prolific 3-point shooting added a little excitement in the last few minutes.\nJames Harden scored 30 points in just three quarters as the Rockets broke their NBA record by making 27 3-pointers in a 149-113 win over the Phoenix Suns on Sunday night.\nEric Gordon led the 3-point brigade by tying a career high with eight, Harden added five, PJ Tucker had four and Danuel House three.\nGary Clark tied the record with a little over three minutes to play and Houston missed the next four before Austin Rivers broke it with 1:09 remaining. He crouched a bit and pointed at the Phoenix bench after the make as fans bellowed: \"Threeeeeeee!\"\n\"There was no choice,\" Rivers deadpanned. \"The ball was coming to me.\"\nHe said he didn't realize they were close to breaking the record until he heard the crowd yelling at them to take more 3s.\n\"I think it made it interesting, especially toward the end,\" Rivers said. \"It made guys play for something else. When you're up by like 35, 40 points, that's a lot of points.\"\nHouston has made 26 3-pointers twice this season, with the last time coming Tuesday at Sacramento.\nThe Rockets had a 10-point lead after one period and a 43-point second quarter allowed them to tie a season high with 77 points in the first half to take a 30-point lead into halftime.\nHouston led by 15 with just more than four minutes left in the second before ending the quarter with a 21-6 spurt to pad the lead. Harden had 10 points in that span, and Gordon and Tucker added 3-pointers to help the Rockets turn this one into a blowout early.\nHarden, who had 13 rebounds and nine assists, scored 16 points in the third quarter, capped by a 3-pointer just before the buzzer that gave Houston a 40-point advantage entering the fourth quarter. Harden made the shot and held his follow-through for a couple of seconds before walking to bench -- where he'd remain for the rest of the night with the game well in hand.\nIt was the second straight game in which Harden sat out the entire fourth quarter, giving the league's leading scorer, who averages almost 37 minutes a game, some much-needed rest as the playoffs approach.\nChris Paul was pleased that the Rockets played to their level despite playing one of the league's worst teams.\n\"We understand that we're playing for something and we're all trying to stay sharp,\" he said.\nAssociate head coach Jeff Bzdelik coached the Rockets for the second straight game with coach Mike D'Antoni out with the stomach flu. It's unclear whether D'Antoni will be healthy in time to travel with the team to Oklahoma City for Tuesday night's game.\nHarden wasn't the only one who sat in the final period, with all of Houston's starters getting a little break in this lopsided game.\nJamal Crawford had 27 points off the bench for the Suns with rising stars Devin Booker and Kelly Oubre Jr. out for the season with injuries.\n\"As a young team we have a lot to learn ... we didn't necessarily play smart,\" Phoenix coach Igor Stefan Kokoskov said.\nTIP-INS\nSuns: Richaun Holmes missed his second straight game with a sprained left ankle. ... Mikal Bridges and Dragan Bender scored 19 each.\nRockets: Harden has scored at least 20 points in 56 straight games. ... The Rockets have made at least 20 in six of their past 12 games and 18 times this season. ... Clint Capela added 22 points and 13 rebounds.\nTHEY SAID IT\nPaul on the team's mindset when opponents double-team Harden: \"I get it. He scores a lot of points, so you want to double him. But that means you're leaving me, Gordy, Tuck, all of us wide open.\"\nUP NEXT\nSuns: Play the season finale at Dallas on Tuesday night.\nRockets: Wrap up the regular season at Oklahoma City on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764995115.17388
}