{
  "game_id": "0021800990",
  "espn_id": "401071663",
  "date": "Mar 09, 2019",
  "matchup": "CHA @ MIL",
  "headline": "Antetokounmpo powers Bucks past Hornets for 50th win",
  "body": "MILWAUKEE --  Giannis Antetokounmpo delivered for Milwaukee once again, and Brook Lopez got going inside.\n\nIt was too much for Charlotte to overcome.\n\nAntetokounmpo had 26 points, 13 rebounds and six assists, and the Bucks beat the Hornets 131-114 on Saturday night for their NBA-best 50th victory.\n\nLopez added 25 points and eight rebounds as Milwaukee used a second-half surge to knock out Charlotte. It's just the second 50-win season in the past 30 years for the Bucks (50-16), who went 52-30 during the 2000-01 season and reached the Eastern Conference finals.\n\n\"We have great belief in one another,\" Lopez said. \"We can just play so many different ways.\"\n\nThe Bucks went 17 for 44 from 3-point range and placed six players in double figures. Malcolm Brogdon and reserve Nikola Mirotic each scored 18 points, and Donte DiVincenzo and Eric Bledsoe had 11 points apiece.\n\nKemba Walker paced Charlotte (30-36) with 25 points, and reserve Frank Kaminsky had 16.\n\nCharlotte, which has bothered Milwaukee with its switching defense this season, opened a 14-point lead in the second quarter before the Bucks closed to 59-55 at halftime.\n\nMilwaukee responded with a 39-point outburst in the third quarter to grab a 94-87 lead. Lopez had 18 points in the period on 5-for-6 shooting. His only miss came on a 3-point attempt.\n\n\"The game was in the balance right there,\" Charlotte coach James Borrego said. \"We were stretching them out with Frank as the 5, and they went inside to Lopez. You've got to give them credit. He's a handful; he can play inside and out.\"\n\nAntetokounmpo credited the hustle of DiVincenzo with helping the Bucks snap out of their first-half funk. The rookie from Villanova was playing just his second game since returning from a heel injury that sidelined him for 22 games.\n\n\"Usually it takes a couple games to get back into the rhythm and get back in basketball shape,\" Antetokounmpo said. \"He had three rebounds in a row. He dove for the ball and he got a deflection.\n\n\"He kept us in the game and kept our energy really high. He was amazing tonight. He knocked down shots and was all over the place.\"\n\nAntetokounmpo scored the first 10 Bucks points in the fourth quarter -- including back-to-back 3-pointers -- as Milwaukee pulled away to beat Charlotte for the third time in four meetings this season.\n\n\"It was hard for everybody to get a rhythm; I don't know for what reason,\" Antetokounmpo said. \"They were loading to me.\"\n\nSCORING\n\nThe Bucks had their NBA-high 13th game of 130 or more points. Only the 1969-'70 (15) and 1970-'71 (14) Bucks teams had more 130-point games in franchise history.\n\nTIP-INS\n\nHornets: Kaminsky, the former University of Wisconsin star, was out of Charlotte's rotation the last time the Hornets were in Milwaukee in late January. But the 7-foot forward has made an impact lately. He scored a season-high 20 points in a loss to Miami on Wednesday. \"We needed some scoring punch off our bench,\" Borrego said. \"Frank has given us that, stretching the floor, driving the ball. He's playing with a lot of confidence.\" ... F Michael Kidd-Gilchrist (left knee strain) and PG Tony Parker (rest) were not available, but C Bismack Biyombo returned after sitting out Charlotte's 112-111 win over Washington on Friday night. Charlotte started the night one game out of the eighth and final playoff spot in the Eastern Conference, in a three-way battle with Miami and Orlando. \"We understand every game feels like a must-win for us,\" Borrego said. \"We've been in the top eight in the conference 93 percent of the season. There's a will to survive and win, and I think we have that.\"\n\nBucks: G George Hill (left groin strain) missed his seventh consecutive game but could return at some point on the Bucks' three-game road swing that opens Monday in San Antonio, according to coach Mike Budenholzer. ... G Sterling Brown (right wrist soreness) has resumed shooting on a limited basis. He also has missed the last seven games. ... Veteran C Pau Gasol will continue his adjustment to the Bucks after being signed last weekend. The two-time NBA champion and six-time All-Star was released by San Antonio in time to be eligible for the postseason with Milwaukee. \"It's a wide variety of experiences that he brings,\" Budenholzer said. \"His international play, the things he has done with Spain. I think Giannis has an immense respect for him. To have guys like that in the locker room that can speak up or can say something in a timeout that's beneficial, all those things add up.\"\n\nUP NEXT\n\nHornets: At Houston on Monday night.\n\nBucks: At San Antonio on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764994353.015285
}