{
  "game_id": "0021500553",
  "espn_id": "400828440",
  "date": "Jan 09, 2016",
  "matchup": "DET vs. BKN",
  "headline": "Pistons ease past Nets 103-89 for 3rd straight win",
  "body": "AUBURN HILLS, Mich. -- Marcus Morris' injury gave Detroit's two most recent draft picks a chance to play bigger roles.\nStanley Johnson made his first start of the season, but it was seldom-used guard Darrun Hilliard who really made an impression.\nHilliard scored a season-high eight points in his most extensive action yet, and the Pistons pulled away at the beginning of the fourth quarter for their third straight victory, 103-89 over the Brooklyn Nets on Saturday night.\nAndre Drummond had 23 points and 11 rebounds for Detroit.\nThe Pistons played without Morris, who sat out with left knee tendinitis. Johnson, a first-round draft pick in 2015, made his first start and scored eight points on 4-of-13 shooting. Hilliard, a second-round pick, played more than 20 minutes in a reserve role and looked comfortable.\n\"It was good to see him play like that,\" coach Stan Van Gundy said. \"Darrun's going to be a good player, he just hasn't gotten a lot of a chance so far.\"\nReggie Jackson had 23 points and eight assists for Detroit, and Ersan Ilyasova added 19 points and 13 rebounds.\nBrook Lopez had 19 points and seven rebounds for the Nets, who have lost four straight.\n\"This has been a theme all season,\" Lopez said. \"A team makes an early run at us and we can't respond, so we spend the rest of the game digging ourselves out of a hole.\"\nThe Pistons led by as many as 14 in the first half and were up 56-46 after two quarters. Brooklyn cut the lead to two in the third, and it looked as though this game might come down to the wire when Detroit led 72-66 after three.\nThe Pistons began the fourth with a 9-2 run, and a three-point play by Hilliard made it 86-72.\n\"He got in, he showed what he could do,\" Johnson said. \"Made multiple shots and made plays on defense and offense. ... It feels a lot better as a rookie getting your number called, especially in a situation like tonight. To get your number called, you know that Coach trusts in you. He hasn't really been playing all year, but he knows that he's next in line.\"\nAnthony Tolliver scored 10 points for the Pistons. Donald Sloan had 15 for Brooklyn, and Joe Johnson added 14.\nBrandon Jennings, who has looked sharp at times for Detroit since coming back from an Achilles tendon injury, was held scoreless.\nThe Pistons had only three turnovers in the first half, when they outscored Brooklyn 19-0 on fast breaks.\n\"In the first half, they had 19 fast-break points and 34 points in the paint, so there was a lot we didn't do well,\" Nets coach Lionel Hollins said. \"Detroit can run, and we gave them a lot of chances with all of our missed shots.\"\nBIG MEN\nDrummond and Lopez each had a solid game on offense. Drummond went 11 of 15 from the field and Lopez was 8 of 11.\nINJURED\nMorris hadn't missed a game all season before Saturday, and Van Gundy wasn't too concerned about Morris' knee going forward.\n\"He went through the walkthrough today, but he just couldn't get it feeling right,\" Van Gundy said. \"I don't think it'll be long.\"\nTIP-INS\nNets: Joe Johnson surpassed Peja Stojakovic for 11th on the career 3-pointers list. He has 1,761. ... Brooklyn had won three of its previous four on the road.\nPistons: Detroit made almost as many 3-pointers (eight) as the Nets attempted (nine). ... Drummond, Jackson and Ilyasova had 10 points each in the first quarter.\nUP NEXT\nNets: Host San Antonio on Monday night.\nPistons: Host San Antonio on Tuesday night.\n---\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994926.325124
}