{
  "game_id": "0022300526",
  "espn_id": "401585154",
  "date": "Jan 10, 2024",
  "matchup": "TOR @ LAC",
  "headline": "Leonard, George score 29 apiece as Clippers rally in fourth quarter to defeat Raptors 126-120",
  "body": "LOS ANGELES -- — On a night when Kawhi Leonard scored 29 points after agreeing to a three-year contract extension earlier in the day and the Los Angeles Clippers won for the seventh time in the past eight games, coach Tyronn Lue and the rest of his squad were far from pleased after a 126-120 victory over the Toronto Raptors on Wednesday night.\n\n\r\n              With the Clippers having perhaps its most talented roster in franchise history, Lue has an eye on what it is going to take in the playoffs if they want to get to the NBA Finals for the first time.\n\n\r\n              And now that James Harden has meshed with a core that includes Leonard, Paul George and Russell Westbrook, the expectations are beginning to get higher.\n\n\r\n              “I think half of it is great talent, and I think half of it is execution, and we got to be 100% execution with our talent, and that makes for a dangerous team,\" Lue said. \"When you get to the playoffs it’s a whole different animal, and so we've got to start building those habits. We’re doing it a little bit at a time, but we gotta start progressing a little bit more as far as being better with our execution and what we’re trying to do.”\n\n\r\n              Leonard, who also had three rebounds and seven assists, agreed with this coach's assessment.\n\n\r\n              “I think we got a lot to improve, you know, just like tonight,\" he said. \"They were pretty good at getting whatever they wanted, started getting to the free throw line. Those guys did a good job of pushing the pace, getting into the paint, as well as knocking down the 3-point shots. I mean, tonight felt like we were in mud a little bit, moving a little slow, no communication.\"\n\n\r\n              George added 29 points, including 15 in the fourth quarter, as the Clippers rallied in the fourth quarter.\n\n\r\n              It was the fifth time this season George and Leonard both scored at least 25 points in the same game.\n\n\r\n              Immanuel Quickley paced the Raptors with 25 points, RJ Barrett added 24 and Dennis Schroder had 22 as Toronto fell in Crypto.Com Arena for the second straight night after a one-point loss to the Lakers on Tuesday.\n\n\r\n              The Raptors were missing Pascal Siakam due to back spasms. Toronto has split its six games since acquiring Barrett and Quickley from the New York Knicks.\n\n\r\n              “I felt that we are really competing against a really good team. Our guys gave 110% of all their abilities today and we stayed in the game all the way to the end,\" Raptors coach Darko Rajakovic said. \"A couple of missed opportunities to do a better job in the rotations, to take away a couple of layups and a couple opportunities for us where we created a lot of easy shots around the rim that did not go our way.\"\n\n\r\n              James Harden (14 points, 11 assists) and Ivica Zubac (12 points, 11 rebounds) both had double-doubles as the Clippers improved to an NBA-best 16-3 since Dec. 1.\n\n\r\n              The Clippers trailed 92-89 with 28 seconds remaining in the third quarter before they went on a 22-9 run over a five-minute span during the third and fourth quarters. George had seven points during the run.\n\n\r\n              Toronto rallied back with a 10-2 spurt to get within 121-118, but George made a 3-pointer with 36 seconds remaining to help the Clippers hold on.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Wrap up a six-game trip at Utah on Friday night.\n\n\r\n              Clippers: At Memphis on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995423.3360288
}