{
  "game_id": "0022200447",
  "espn_id": "401468602",
  "date": "Dec 18, 2022",
  "matchup": "DET vs. BKN",
  "headline": "Kevin Durant, Kyrie Irving lead Nets past Pistons, 124-121",
  "body": "DETROIT -- — Kevin Durant scored a career-high 26 of his 43 points in the third quarter, helping the Brooklyn Nets overcome a 17-point halftime deficit in a 124-121 victory over the Detroit Pistons on Sunday night.\n\n\r\n              Kyrie Irving added 38 points in Brooklyn's seventh straight victory over Detroit. Bojan Bogdanovic led the Pistons with 26 points.\n\n\r\n              Durant was 8 of 10 from the floor, going 3 of 3 on 3-pointers and 7 of 7 from the free-throw line as he outscored the Pistons 26-25 in the third. \n\n\r\n              “I got a few free throws, and then I got some really good looks off of screens,” he said. “I wanted to stay locked in on defense, because that usually gets me going on offense.”\n\n\r\n              However, his turnover led to a Bogdanovic 3-pointer that cut Brooklyn's lead to 120-119 with 40 seconds left. \n\n\r\n              “We've been talking all day about the World Cup fnal — what a game that was,” Nets coach Jacque Vaughn said. “Our mission tonight was to be even more exciting.”\n\n\r\n              Irving missed a 3-pointer at the other end, but Killian Hayes was called for a foul. Pistons coach Dwane Casey unsuccessfully challenged the call, and Irving hit two free throws before missing the third to make it 122-119 with 29 seconds left.\n\n\r\n              Bogdanovic missed, but Alec Burks hit a layup before fouling Durant, who made both free throws to keep it a three-point game.\n\n\r\n              Bogadanovic's last attempt was tipped by Nic Claxton and Durant grabbed the rebound as time expired.\n\n\r\n              “We almost take Nic for granted, but he's a unique player,” Durant said. “His ability to guard guys on the perimeter with his length adds a new dimension to our team.”\n\n\r\n              Durant has scored at least 40 points in his last three games against Detroit — the first player to do that since Rick Barry in 1966-67 — including an arena-record 51 in Brooklyn's 116-104 win in Detroit on Dec. 21, 2021.\n\n\r\n              “They are a long, athletic team that plays us hard, so we're always in tight games with them,\" Durant said. “I just keep trying to get downhill.\"\n\n\r\n              The Pistons led 71-54 at halftime, but Durant's third-quarter run ended with a 3-pointer with three seconds left to give the Nets a 98-96 lead. \n\n\r\n              “We talked about it before the game and again at halftime -- that's a great team and you know they are going to come guns blazing,” Casey said.\n\n\r\n              Durant scored 20 of his 26 points in the final 3:18 of the period.\n\n\r\n              “The scoring was coming back in our favor a little bit, and we're thinking about how we're going to climb the rest of the way back into it,” Vaughn said. “Then he started to string possessions together and we suddenly had the lead.”\n\n\r\n              With Durant getting a rest, Irving scored eight points in the first 4:20 of the fourth, helping Brooklyn to a 109-104 advantage.\n\n\r\n              TIP INS\n\n\r\n              Nets: Durant passed John Havilcek (26,395) and Paul Pierce (26,397) on the NBA scoring list in the first quarter. He is currently at 26,437 — 61 behind Tim Duncan. ... Durant has scored at least 25 points in his last 12 visits to Detroit, the second-longest streak behind Wilt Chamberlain's 23. \n\n\r\n              Pistons: Jalen Duren finished with 11 rebounds, his sixth straight game with at least 11, the longest streak by a teenager since Dwight Howard had seven straight for Orlando in 2005.\n\n\r\n              STRUGGLING STARTERS\n\n\r\n              Detroit's starters were outscored 102-72 against Brooklyn after trailing Sacramento's starters 99-66 in a 122-113 loss on Friday night. \n\n\r\n              “I don’t know if it is having two rookies in the starting lineup, but they have to understand it’s going to be a street fight,” Casey said.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Golden State on Wednesday night.\n\n\r\n              Pistons: Host Utah on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994375.770415
}