{
  "game_id": "0022301087",
  "espn_id": "401585715",
  "date": "Apr 01, 2024",
  "matchup": "CHA vs. BOS",
  "headline": "Jayson Tatum, Sam Hauser each score 25 as Celtics beat Hornets 118-104 for 11th win in 13 games",
  "body": "CHARLOTTE, N.C. -- — Jayson Tatum had 25 points and 10 rebounds, Sam Hauser poured in 25 points on seven 3s and the Boston Celtics avenged an early season loss to the Charlotte Hornets with a 118-104 victory on Monday night.\n\n\r\n              Kristaps Porzingis added 20 points and Derrick White had 19 points and nine rebounds for the Celtics, who’ve won 11 of their last 13 games.\n\n\r\n              Hauser finished 7 of 11 from beyond the arc and the Celtics made 19 3s against the Hornets to avenge a 121-118 overtime loss on Nov. 20 in Charlotte when Miles Bridges hit a game-winning 3 with 6.6 seconds left.\n\n\r\n              Boston (59-16), which has already clinched the top seed in the Eastern Conference playoffs, is now 27-0 this season when it makes at least 18 3s in a game.\n\n\r\n              Hauser was quick to attribute his hot shooting — many of which were open looks — to Tatum.\n\n\r\n              “I feel like we are always making the right pass and making the extra reads,” said Hauser, who was 7 of 11 from beyond the arc. “JT (Tatum) draws a lot of traps and and extra help and he's able to make the right plays out of that.”\n\n\r\n              Celtics coach Joe Mazzulla credited Hauser for playing confident, while adding his production is a byproduct of what the Celtics do offensively.\n\n\r\n              “I think just layers of our offense is what unleashes him,\" Mazzulla said. \"The guys understand that he’s a weapon in different ways, and so when we get to the second and third layer of our offense, especially when teams are guarding us a certain way, it really unleashes guys like Sam. And his teammates continuing to trust him and find him within the layers of our offense.”\n\n\r\n              Bridges paced the Hornets with 26 points and 11 rebounds, while Grant Williams added 23 points and Brandon Miller 19 points.\n\n\r\n              Charlotte hung tough for awhile against Boston.\n\n\r\n              But the Celtics blew the game open in the third quarter, exerting its size advantage as Porzingis scored 11 points to help open a 16-point lead. Porzingis feasted on a Hornets team playing without 7-foot centers Nick Richards and Mark Williams due to injuries.\n\n\r\n              Hauser then added two dagger 3s in the fourth quarter, stretching the lead to 19. He had five 3s in the second half.\n\n\r\n              The Celtics dominated the smaller Hornets on the glass 51-40, and grabbed three offensive rebounds on one fourth quarter possession before White scored on a driving layup to put Boston up 111-96 with 5:37 left in the game. The look of exasperation could be seen on the Hornets faces, after being unable to corral a rebound.\n\n\r\n              Hornets coach Steve Clifford said his team struggled to get its defense set at different times during the game.\n\n\r\n              “The fastbreak points are totally misleading,” Clifford said. \"They only had seven, but they had us on our heels for so many possessions because we just didn’t get ahead of the ball and get our defense set. To me, watching them play, you have to do that. They’re maybe 10th in fastbreak points, but they get the ball up the floor and into things quickly, and those were our worst possessions tonight.”\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Oklahoma City on Wednesday.\n\n\r\n              Hornets: Host Portland on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995934.925339
}