{
  "game_id": "0021601044",
  "espn_id": "400900439",
  "date": "Mar 20, 2017",
  "matchup": "CHA vs. ATL",
  "headline": "Hornets hand Hawks 4th straight loss, 105-90",
  "body": "CHARLOTTE, N.C. --  Hornets second-year forward Frank Kaminsky said his biggest problem on the court has been letting go of the past.\n\n\"I'm always thinking through stuff, and it's hard to get over things,\" Kaminsky said. \"When you miss four of five shots early in the season, it's hard. I was getting down on myself.\"\n\nBut not anymore.\n\nNicolas Batum and Kemba Walker each had 16 points and increasingly confident Kaminsky added 14 points and five assists off the bench as Charlotte handed the slumping Atlanta Hawks their fourth straight loss, 105-90 on Monday night.\n\nKaminsky again provided a spark as the Hornets took control early in the second period with a 23-4 run. The Hornets led by nine at the break and stretched the lead to 23 in the fourth quarter.\n\nThe 7-footer came into the game averaging 16.9 points, 5.9 rebounds and 2.3 assists in his previous 15 games. He was 5 of 11 from the field with three 3-pointers, helping stretch the Hawks defense.\n\n\"Now, if I miss my first couple of shots, I just keep thinking to myself, `The next one is going to go in,\" Kaminsky said. \"My entire thought process has changed.\"\n\nThat's a big step, said Hornets coach Steve Clifford.\n\n\"He's not worrying about mistakes as much to me,\" Clifford said. \"When he plays off his instincts and everything, his talent will shine through. His issue is he's hard on himself. He gets down on himself.  I think that as he's kind of played going forward, not worried about mistakes and everything, he's played better and better.\"\n\nBehind Kaminsky, Charlotte's bench outscored the Hawks 43-22.\n\nIt was another rough night for Atlanta, which appeared disinterested and sloppy at times. The Hawks turned the ball over 18 times leading to 17 points.\n\nAtlanta played without All-Star forward Paul Millsap and top reserve guard Kent Bazemore and never got back in sync on offense after opening an 8-1 lead to start the game. Millsap will miss at least another game with tenderness in his right knee, while Bazemore will be reevaluated in seven to 10 days after suffering a bone bruise on his right knee on Saturday night.\n\n\"I think it's more than just looking for a way to make up for Paul,\" Hawks coach Mike Budenholzer said. \"Obviously, he's a big part of what we do and a good player. I think just collectively, we all have to be better.\"\n\nDennis Schroder had 20 points to lead the Hawks, while Dwight Howard had 13 points and 10 rebounds.\n\nTIP INS\n\nHawks: Howard has reached double digits in rebounds in 12 straight games. ... Schroder tallied his 27th 20-point game of the season. ... Mike Dunleavy (right ankle) was declared available before the game but did not play.\n\nHornets: Michael Kidd-Gilchrist left the game with a right ankle strain in the third quarter and did not return. ... Charlotte improved to 14-0 at home when holding an opponent to fewer than 100 points. ... Walker became the sixth NBA player to reach 200 3-pointers this season.\n\nPLAYOFF PUSH\n\nCharlotte has won back-to-back games over Washington and Atlanta to pull within three games of Detroit for the eighth spot in the Eastern Conference.\n\n\"We still believe that we can get in,\" said Hornets forward Marvin Williams, who had 13 points and a team-high eight rebounds. \"We know we have a small margin for error, but everybody still believes that we can make it to the postseason so we're going to go out there and play like it every night.\"\n\nALL IN ON THE BADGERS\n\nKaminsky said he wasn't surprised that his alma Wisconsin upset No. 1 seed Villanova on Saturday. He joked that he picked the Badgers to go all the way and has them \"winning the championship game 100-0.\"\n\nUP NEXT\n\nHawks: Travel to face the Wizards on Wednesday night.\n\nHornets: Travel to face the Magic on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995471.0536451
}