{
  "game_id": "0022400209",
  "espn_id": "401704775",
  "date": "Nov 10, 2024",
  "matchup": "PHX vs. SAC",
  "headline": "DeRozan scores 34, Kings rally to win in OT 127-118, ending Suns' win streak at 7",
  "body": "PHOENIX -- — DeMar DeRozan scored the Kings’ first eight points in overtime and Sacramento snapped the Phoenix Suns’ winning streak at seven with a 127-118 win Sunday night.\n\n\r\n              The Suns played without Kevin Durant, who was injured Friday and will miss at least two weeks.\n\n\r\n              DeRozan finished with 34 points.\n\n\r\n              The Suns led through the fourth quarter until Keegan Murray tipped in his own missed shot with 3.9 seconds to play to give Sacramento a one-point lead. But Murray committed a foul on the Suns’ inbounds play, and Devin Booker made a free throw to tie the game at 111. Booker missed a shot from the corner that would have won it.\n\n\r\n              Domantas Sabonis recorded his ninth consecutive double-double for the Kings with 20 points and 12 rebounds before fouling out in overtime.\n\n\r\n              Murray had 14 points and 13 rebounds while De’Aaron Fox put up 21 points and 11 rebounds. Kevin Huerter, who also fouled out in the extra period, had 17 points for Sacramento. \n\n\r\n              Bradley Beal led Phoenix (8-2) with 28 points. Booker had 23 points and 12 assists, and Tyus Jones finished with 22 points.\n\n\r\n              Suns center Jusuf Nurkic was questionable for Sunday’s game with left ankle soreness. He started and played 15 minutes, grabbing seven rebounds before being ruled out at halftime.\n\n\r\n              Takeaways\r\n              Kings: DeRozan scored 16 points in the fourth quarter to keep the Kings in the game.\n\n\r\n              Suns: Rookie Ryan Dunn, who started in place of Durant, averaged 16 minutes per game entering Sunday. \n\n\r\n              Key moment\r\n              DeRozan scored on a three-point play to start the overtime period and the Kings never trailed after that.\n\n\r\n              Key stat\r\n              Mason Plumlee, who played in Nurkic’s place, finished with six points, 11 rebounds and six assists.\n\n\r\n              Up next\r\n              The Kings play at San Antonio on Monday. The Suns travel to play Utah on Tuesday for the In-Season tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/nba",
  "source": "espn_api",
  "crawled_at": 1764998244.906108
}