{
  "game_id": "0022000736",
  "espn_id": "401307527",
  "date": "Apr 01, 2021",
  "matchup": "LAC vs. DEN",
  "headline": "Nuggets lead all the way in beating Clippers 101-94",
  "body": "LOS ANGELES -- — Jamal Murray scored 23 points and the Denver Nuggets led all the way in beating the Los Angeles Clippers 101-94 on Thursday night for their fourth straight victory.\n\n\r\n                    The Nuggets dominated the first three quarters on a night when Nikola Jokic didn’t reach double figures until hitting a 3-pointer with 5:20 left in the game. He finished with 14 points, seven rebounds and seven assists.\n\n\r\n                    “We expect 30, 20 and 15 from him every night,” Nuggets coach Michael Malone said of Jokic. “He didn’t play poor but he didn’t play to the level he’s played at in the last 15 games.”\n\n\r\n                    Jokic’s supporting cast came through. Michael Porter Jr. added 20 points and Will Barton had 19 points. Aaron Gordon added 14 points as Denver improved to 3-0 since Gordon arrived last week via a trade from Orlando.\n\n\r\n                    “We set the tone and were able to sustain that,” Murray said. “We were in control and especially on the road that’s a big deal.”\n\n\r\n                    Kawhi Leonard led the Clippers with 24 points and 12 rebounds. Paul George had 17 points and eight rebounds in his return after missing two games with a sore right foot. Terance Mann added 18 points off the bench. \n\n\r\n                    George said the soreness and swelling in his foot is related to the bone edema issue that sidelined him earlier.\n\n\r\n                    “It’s a day-to-day process, but I’m doing better,” he said. “Some days it’s more sore than others.”\n\n\r\n                    The Clippers made a run in the fourth, opening with a 13-3 spurt that left them trailing 84-83. \n\n\r\n                    But Denver outscored them the rest of the way. Jokic’s 3-pointer extended the Nuggets’ lead to six and Murray’s 3 made it 96-88. \n\n\r\n                    “That’s back-to-back games that we’ve led wire-to-wire which is really impressive when you consider who we played, with Philadelphia being a very good team, as are the Clippers,” Malone said.\n\n\r\n                    The Clippers, who lead the NBA in 3-point shooting, were 10 of 34 from long-range. \n\n\r\n                    Leonard scored 11 points in the third, when the Clippers trailed by 18 early on. He set up a dunk by Patrick Patterson and a 3-pointer from Mann before Leonard hit just his second 3 of the game. They trailed 81-70 heading into the fourth.\n\n\r\n                    Jokic was the only Denver starter not in double figures by halftime. He had four points on 2-of-7 shooting, five rebounds and four assists.\n\n\r\n                    The Clippers were out of sorts from the start. They were just 6 of 17 from the floor in the first quarter when Denver led by 13. Their foibles continued in the second. George was out on the break and missed an easy dunk. Nicolas Batum came in to clean up and also missed. \n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Gordon had 13 and six points in his first two games. ... They dished out 28 assists, the 14th straight game they’ve had 25 or more. \n\n\r\n                    Clippers: They held Denver to 39 points in the second half after giving up 62 in the first half. ... They got outscored 42-40 in the paint. ... The ball got stuck behind the backboard in the fourth and Batum’s height came in handy in getting it dislodged. \n\n\r\n                    COACH RONDO\n\n\r\n                    Newly acquired Rajon Rondo is injured, but he’s still contributing to the Clippers from the sideline acting as a coach.\n\n\r\n                    “Every time I came back to the bench he’s letting me know something he saw,” Mann said. “It’s been really cool. He just knows the game so well.”\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Host Orlando on Sunday.\n\n\r\n                    Clippers: Host the Lakers on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997677.194494
}