{
  "game_id": "0021600455",
  "espn_id": "400899897",
  "date": "Dec 23, 2016",
  "matchup": "DAL @ LAC",
  "headline": "Mavs beat Clippers 90-88 on Barnes' jumper",
  "body": "LOS ANGELES --  It was a play the Dallas Mavericks had run countless times, although seemingly always for veteran Dirk Nowitzki.\n\nThis time the call went to forward Harrison Barnes and the emerging star delivered, hitting a tough 10-foot floating jumper with 3.7 seconds left Friday night to give the Mavs a 90-88 victory over the Los Angeles Clippers.\n\n\"(Nowitzki) reminds be frequently that he wrote the playbook,\" Barnes said.\n\nThe jumper provided the last of Barnes' team-high 24 points. Nowitzki, returning to play in the first half after missing 14 consecutive games with a strained right Achilles' tendon, added 17 points and Wesley Matthews 16 for Dallas.\n\nThe Clippers were playing without both their stars, Chris Paul (hamstring) and Blake Griffin (knee).\n\nTheir bench stepped up for the second consecutive night, outscoring the Mavericks' reserves 54-21. They outscored the Spurs' bench Thursday 58-33.\n\nBut the Clippers were done in by turnovers (20 to Dallas' 12), the Mavericks controlling the offensive boards (14 to six) and the inability of center DeAndre Jordan to convert from the free throw line.\n\n\"What killed us, honestly, wasn't (Barnes), it was the 20 turnovers and the offensive rebounds,\" said Clippers coach Doc Rivers.\n\n\"We tried to do too much with the ball tonight.\"\n\nWith the score tied at 80 with 27.4 seconds left, Jordan missed a layup but was fouled. A 55 percent free-throw shooter on the season, he missed both opportunities to set up Barnes for his first game-winning shot as a Maverick. He spent his first four seasons with the Golden State Warriors.\n\n\"It felt good,\" Barnes said. \"It means a lot when the coaches and players trust you to take that shot.\"\n\nThe 6-foot-8 Barnes, 24, is averaging a career-high 20.4 points.\n\nLed by reserve Jamal Crawford's 26 points, the Clippers led for most of the night but could not come up with the big play at the end.\n\n\"We can't have 20 turnovers ever,\" Jordan said. \"We can't do that. It's just about getting back to our defense, limiting teams to one shot and not giving them 14 offensive rebounds.\"\n\nTIP-INS\n\nMavericks: Dallas coach Rick Carlisle said guard Jose Juan Barea had an MRI that confirmed a mild left leg strain and only expects him to miss a short period. ... Nowitzki has missed 22 games overall.\n\nClippers: Raymond Felton started in place of Paul (left hamstring strain), who is hopeful he can return for their next game Sunday. ... Paul Pierce started his third consecutive game for Blake Griffin (knee surgery).\n\nFELTON PRAISED\n\nGuard Raymond Felton spent last season with the Mavericks, playing in 80 games with 31 starts, averaging 9.5 points.\n\nSaid Carlisle: \"He's a winner, always ready and a great competitor. Really he was one of our X-factors for getting into the playoffs last year. That was a very underrated move when they signed him.\"\n\nFelton, however, had a rough night. He hit just three of 11 field goals and had two assists.\n\nDOWN TWO\n\nRivers simply shrugged off not having Paul and Griffin.\n\n\"Not having Blake, not having C.P., you have to find different ways to defend, different ways to score,\" Rivers said.\n\n\"We've got a lot of guys that can play. My saying is: We play them all. We don't just play one or two guys.\"\n\nUP NEXT\n\nMavericks: Travel to New Orleans on Monday to meet the Pelicans. Dallas has won 13 of their last 16 meetings.\n\nClippers: Will be the designated visiting team when they meet the Lakers on Sunday on Christmas. The Clippers have won their last 11 games against their city rivals.",
  "source": "espn_api",
  "crawled_at": 1764996139.814552
}