{
  "game_id": "0022200575",
  "espn_id": "401468730",
  "date": "Jan 04, 2023",
  "matchup": "ATL @ SAC",
  "headline": "Hunter, Collins star as Hawks beat Kings 120-117",
  "body": "SACRAMENTO, Calif. -- — De’Andre Hunter and John Collins each scored 22 points and the Atlanta Hawks beat the Sacramento Kings 120-117 on Wednesday night to end a four-game slide.\n\n\r\n              “Feels great,” Hawks coach Nate McMillan said. “That’s what we have been talking about. We have to close out games and make plays down the stretch.”\n\n\r\n              Collins also grabbed 12 rebounds as Atlanta bounced back after losing 143-141 in double overtime at Golden State on Monday night. Trae Young and Dejounte Murray each scored 21 points.\n\n\r\n              “It’s been a long week, dropping four games,” Murray said. “This is the NBA. It’s a long season. You get to redeem yourself. …we are going in the right direction.\n\n\r\n              The Hawks trailed 117-113 with 1:16 left. But Young converted a layup and a foul shot, and Murray made two free throws and a layup as part of a game-ending 7-0 run for Atlanta.\n\n\r\n              “We couldn’t get the necessary stops down the stretch,” Kings coach Mike Brown said. “They basically just went at what they thought was the mismatch and got layups.”\n\n\r\n              Sacramento had the ball in the final seconds, but De’Aaron Fox had a floater blocked by Onyeka Okongwu and Domantas Sabonis also missed a jumper.\n\n\r\n              The Hawks had dropped five of six.\n\n\r\n              Fox led Sacramento with 25 points. Kevin Huerter made four 3-pointers on his way to 24 points, and Harrison Barnes scored 22. Sabonis had 20 points, 14 rebounds and eight assists.\n\n\r\n              “We fouled too much late,” Huerter said. “I think just a lot of mental mistakes at the end of the game there. We got a lead and just didn’t lock in.”\n\n\r\n              The Kings were 25 of 25 at the free-throw line before Sabonis missed a pair in the final minute.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: C Clint Capela was ruled out before the game with a right calf strain. ... Young and coach Nate McMillan both received technical fouls with 2:54 left in the second quarter.\n\n\r\n              Kings: Sabonis recorded his 15th consecutive double-double, tying DeMarcus Cousins for the longest double-double streak in franchise history. His 28 double-doubles leads the NBA this season.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Los Angeles Lakers on Friday night.\n\n\r\n              Kings: Host Lakers on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994832.7970738
}