{
  "game_id": "0022201064",
  "espn_id": "401469219",
  "date": "Mar 19, 2023",
  "matchup": "PHX @ OKC",
  "headline": "Gilgeous-Alexander scores 40 as Thunder top Suns 124-120",
  "body": "OKLAHOMA CITY -- — The M-V-P chants rained down on Shai Gilgeous-Alexander as he hit two critical free throws with 10 seconds remaining to help the Oklahoma City Thunder hold off the Phoenix Suns on Sunday.\n\n\r\n              The All-Star scored 40 points in Oklahoma City's 124-120 victory. \n\n\r\n              The Thunder have won four of five as they push for at least a play-in spot. Oklahoma City has missed the playoffs the past two years, but a postseason slot is within reach. The players said the crowd at the Paycom Center shared their sense of urgency.\n\n\r\n              “We had a home-court advantage for sure,” Gilgeous-Alexander said. “They were energetic. They were their usual selves. It was a big game tonight, and it felt like it.”\n\n\r\n              Gilgeous-Alexander made 12 of 24 field goals and 16 of 19 free throws. He made all 11 of his free throws in the second half after not shooting any in the second quarter.\n\n\r\n              “I just thought he didn’t have his normal jugular-type mentality on his drives (in the second quarter),\" Thunder coach Mark Daigneault said. \"And he got back to that in the second half and really put pressure on them. That gets the fouls going.”\n\n\r\n              Luguentz Dort added 20 points for the Thunder, who trailed by 15 in the first half. \n\n\r\n              “The key to that type of win is just staying alive long enough for when the game turns,” Daigneault said. \n\n\r\n              Devin Booker scored 46 points and Chris Paul added 14 points and 13 assists for the Suns.\n\n\r\n              Phoenix led 69-57 at halftime behind 16 points from Booker. The Suns shot 52.2% from the field before the break. Gilgeous-Alexander had 21 points in the first half to keep the Thunder in it.\n\n\r\n              Gilgeous-Alexander stole the ball in the closing seconds of the third quarter and scored a layup while being fouled with 0.4 seconds remaining. He made the free throw to cut Phoenix's lead to 96-90 at the end of the period.\n\n\r\n              “The tough turnover at the end of the third ... it turned into an and-one, and the momentum just shifted,\" Phoenix coach Monty Williams said. \"So that was a tough exchange.”\n\n\r\n              Phoenix went up 100-90 before the Thunder went on an 18-2 run. Oklahoma City tied the game at 100 on a layup by Aaron Wiggins with a little over seven minutes remaining. Oklahoma City took a 103-102 lead about 40 seconds later on a 3-pointer by Dort, and the Thunder pushed the lead out to 108-102 before Phoenix called timeout. The Thunder held off a late surge in the final minute.\n\n\r\n              “That’s been their hallmark for the last couple of years where they’re just going to play a certain way,\" Williams said. \"That’s their mentality. They’re just a team that’s going to keep coming. They’re going to play 48 minutes plus.”\n\n\r\n              TIP-INS\n\n\r\n              Suns: F Kevin Durant remained out with a sprained left ankle. ... C Deandre Ayton sat out with a bruised right hip. ... C Bismack Biyombo was issued a technical foul in the first quarter. \n\n\r\n              Thunder: C Dario Saric scored four points against the Suns, the team he was traded from earlier this season. Suns F Darius Bazley, who moved from Oklahoma City in the Saric deal, scored three points in seven minutes. He was cheered when he entered the game as a reserve in the second quarter. ... G Josh Giddey was given a technical in the second quarter.\n\n\r\n              STAYING READY\n\n\r\n              Thunder guard Aaron Wiggins did not play until the fourth quarter. He played almost the entire final period and scored seven points on 3-for-4 shooting.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Visit the Los Angeles Lakers on Wednesday.\n\n\r\n              Thunder: Visit the Los Angeles Clippers on Tuesday.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995223.883714
}