{
  "game_id": "0021500708",
  "espn_id": "400828595",
  "date": "Jan 30, 2016",
  "matchup": "TOR vs. DET",
  "headline": "Raptors power past Pistons for 11th straight win, 111-107",
  "body": "TORONTO --  The Toronto Raptors led from start to finish Saturday night while stretching their franchise-best winning streak to 11 games.\n\nCoach Dwane Casey was anything but impressed with the way his team closed out, though.\n\n\"We have to make sure we value playing at home and treating our fans to quality basketball, but that last quarter wasn't quality,\" Casey said after the Raptors' 111-107 win over the Detroit Pistons. \"You give up 35 points, and turnovers and lack of focus, human nature letting human nature take over down the stretch is not winning basketball.\"\n\nThe Raptors let a 20-point fourth-quarter lead shrink to four by the buzzer, and Casey thought that took the sheen off a largely dominant performance. DeMar DeRozan scored 29 points, Kyle Lowry had 18 and Cory Joseph had 16 off the bench for Toronto. Bismack Biyombo also had 12 points and 13 rebounds.\n\n\"This game is fleeting,\" Casey said. \"You can win 11 in a row and also you can lose seven, eight in a row if you continue to play with the lack of focus we did in the fourth quarter. Hopefully we learn from it and continue to go. We have to learn from it.\"\n\nReserve guard Brandon Jennings led the way for Detroit with 22 points, with starter Kentavious Caldwell-Pope contributing 15. Andre Drummond had 11 points and 12 rebounds for his NBA-leading 39th double-double.\n\nAfter sweeping a seven-game homestand for the first time in team history, the Raptors may have been fatigued late. But Lowry, whose two free throws pushed the lead to 20 with 6:19 remaining, chose to credit the Pistons for making the game close at the end.\n\n\"I don't think we ran out of gas,\" he said. \"I think they played ultra-aggressive and they made some good plays down the stretch. At the end of the day, we got the win.\"\n\nIt was aggression that got Drummond thrown out of the game. He got his sixth personal foul with 6:37 remaining in the game after getting through the first half without picking up a single one. He had four fouls in the first half of the third quarter to put himself in trouble for the remainder of the game.\n\nCoach Stan Van Gundy singled Drummond out after the game for not putting a better focus on rebounding. Drummond grabbed 12 in the game but entered as the NBA leader with 15.1 boards per game and 20 games of 15 points and 15 rebounds.\n\n\"It starts with Andre's not dominating on the boards. He's just not,\" Van Gundy said. \"He had eight last night (against Cleveland), he's not dominating on the boards and it starts there. Then our other guys have to do a better job.\"\n\nDrummond's recent struggles on free throws continued, too, with the All-Star center going 1 for 9 from the line after going 2 of 8 in Friday night's loss against the Cleveland Cavaliers.\n\nVan Gundy thinks Drummond is getting distracted.\n\n\"He's got to get back to rebounding,\" he said. \"It has to be a focus of his. One of the things that's happened is that his focus and everybody else's focus has gone to free-throw shooting instead of to the fact that he needs to be a dominant rebounder, so I don't think his head is where it needs to be right now.\"\n\nBRANDON'S BRIGHT SPOT\n\nIf there was any bright spot for Detroit, it was Jennings, who was 5 of 11 from beyond the 3-point line. Jennings credited a chat he had with assistant coach and former NBA player Tim Hardaway for his resurgent play. \"Just control what I can control,\" was how Jennings described the message from Hardaway. \"Just play basketball. It's a blessing to be able to play this game so he told me just control what you can control and go out there and play hard every night.\"\n\nSTAR POWER\n\nDespite being passed over as the main musical act for the NBA All-Star Game next month in Toronto in favor of Sting, award-winning Toronto-born rapper Drake was all smiles sitting courtside Saturday night. Also taking in the action was former UFC light-heavyweight champion Rashad Evans.\n\nTIP-INS\n\nPistons: Drummond has now grabbed five or more rebounds in 64 straight games, the second-longest active streak in the NBA after Los Angeles Clippers center DeAndre Jordan (115). ... After losing the rebounding battle 45-40, Detroit is 22-10 when outrebounding its opponent this season but 3-13 when its opponent is either tied or ahead in rebounding.\n\nRaptors: DeRozan and Lowry were both presented with their white Eastern Conference NBA All-Star Game jerseys before the opening tip-off. All-Star Weekend takes place in Toronto from Feb. 12-14. ... After playing Detroit, Toronto has now played every team in the Eastern Conference and has a 23-8 record in intra-conference games. The only team the Raptors haven't beaten in the Eastern Conference this season is the Chicago Bulls. ... Toronto is shooting a combined .498 (291 for 584) from the field and .453 (68 for 150) from 3-point range in the team's first 24 minutes of games this month.\n\nUP NEXT\n\nPistons: Visit Brooklyn on Monday night.\n\nRaptors: Visit Denver on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994725.496659
}