{
  "game_id": "0022400786",
  "espn_id": "401705352",
  "date": "Feb 13, 2025",
  "matchup": "DAL vs. MIA",
  "headline": "Dante Exum scores 27 points to lead undermanned, undersized Mavericks past Heat, 118-113",
  "body": "DALLAS -- — Dante Exum scored a season-high 27 points, one short of his career high, and the Dallas Mavericks beat the Miami Heat 118-113 on Thursday night.\n\n\r\n              Max Christie added 19 points, Spencer Dinwiddie had 17 and Kessler Edwards finished with season highs of 15 points and nine rebounds as the undermanned, undersized Mavericks swept a home back-to-back and won for the fourth time in five games.\n\n\r\n              Tyler Herro scored 40 points for the Heat, who were swept in a road back-to-back and have lost four consecutive games. Rookie Kel’el Ware had 17 points and Kyle Anderson added 15 points and 10 rebounds \n\n\r\n              The Mavericks had eight players listed on the injury report, with Kyrie Irving (shoulder strain) and Klay Thompson (sprained foot) added after playing extensive minutes Wednesday night.\n\n\r\n              Dallas’ tallest regulars were Edwards and Olivier-Maxence Prosper, each 6-foot-8.\n\n\r\n              Takeaways\r\n              Heat: Miami played without starting forwards Bam Adebayo (knee contusion) and Andrew Wiggins (illness). Herro scored only two points in the first period, starting 1 of 7 from the floor.\n\n\r\n              Mavericks: It was the first time Exum has led Dallas in scoring in 62 regular-season games over two seasons. Edwards, on a two-way contract, played a career-most 40 minutes. \n\n\r\n              Key moment\r\n              The Heat brought the ball upcourt trailing 116-113 with 28 seconds left. Herro was short on a tying 3-pointer from the right corner, leaving him 3 of 14 behind the arc, and Christie grabbed the rebound.\n\n\r\n              Key stat\r\n              Despite the presence of the 7-foot Ware and 6-10 Nikola Jovic in Miami’s lineup, the Mavericks broke even 25-25 on points in the paint.\n\n\r\n              Up next\r\n              Both teams will come out of the break playing Feb. 21. The Heat will play three more road games, beginning at Toronto. The Mavericks will host New Orleans, their fifth consecutive home game.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997157.575159
}