{
  "game_id": "0022201212",
  "espn_id": "401469367",
  "date": "Apr 07, 2023",
  "matchup": "LAL vs. PHX",
  "headline": "Lakers beat Suns to keep hopes alive of avoiding play-in",
  "body": "LOS ANGELES -- — Darvin Ham gets briefed every morning on where his team could end up in the Western Conference playoff race. While the various scenarios are enough to warp the mind of any fan, the Los Angeles Lakers' coach knows the only thing he can do is make sure his team keeps on winning.\n\n\r\n              The Lakers kept their hopes alive of avoiding a spot in the play-in tournament with a 121-107 victory over the resting Phoenix Suns on Friday night.\n\n\r\n              “However it falls, we need to take care of what we need to do,” Ham said after the Lakers improved to 42-39 with their eighth win in the last nine games.\n\n\r\n              Even with the win, Lakers remained the seventh seed and in a play-in spot in the Western Conference after Golden State’s victory over Sacramento.\n\n\r\n              On a night when LeBron James and Anthony Davis were held to a combined 30 points, it was two players acquired at the trade deadline that helped propel the Lakers. DeAngelo Russell led Los Angeles with 24 points and Malik Beasley had 21.\n\n\r\n              Austin Reaves, who has emerged as Los Angeles' most improved player this season, scored 22.\n\n\r\n              “Nobody can key in on just AD and me. When you have Beasley shooting the way he was, Russell shooting at a high rate and Reaves playing exceptional it keeps the defense always out there,” said James, who had 16 points on 6-for-19 shooting.\n\n\r\n              Russell and Beasley also combined to make 10 of the Lakers' 18 3-pointers as they pulled away in the fourth quarter.\n\n\r\n              “We're not going to always shoot the ball tonight. LeBron and I struggled tonight but we have a complete team. The depth on our team is strong to where we had a very convincing win,” said Davis, who finished with 14 points and 21 rebounds.\n\n\r\n              The Suns, who are locked into the fourth spot in the West, rested starters Kevin Durant, Devin Booker, Chris Paul and Deandre Ayton. It was the second game of a back-to-back set after Phoenix beat Denver on Thursday.\n\n\r\n              Torrey Craig led Phoenix with 18 points, Jock Landale had 17 points and 10 rebounds and Josh Okogie scored 16 points.\n\n\r\n              Suns coach Monty Williams did not say if he would sit his core four starters again in Sunday's regular-season finale against the LA Clippers.\n\n\r\n              “We’ll evaluate tomorrow and do what’s best for our guys. Thankfully, we’re in a position where we’ll have time to play next week and get the conditioning level where it needs to be,” he said.\n\n\r\n              It was tied at 96 early in the fourth quarter before the Lakers scored 11 straight points as part of a 13-2 run. James had seven points during the spurt and Rui Hachimura added four.\n\n\r\n              “I thought we played great, we just couldn't make a shot in the second half,” Williams said. “They made 18 3s and a lot of them happened at the end of plays. We had a lot of open shots we just couldn't convert and that happens on a back-to-back.”\n\n\r\n              TIP INS\n\n\r\n              Suns: Phoenix had a pair of injuries occur during the second quarter. Bismack Biyombo injured his right knee after a collision with Anthony Davis. Earlier, Cameron Payne tweaked his lower back in a hard fall.\n\n\r\n              “It’s one of the reasons why you're cautious this time of the year. We’re grateful that they weren’t worse,” Williams said. “We’ll wait to get all the images and official stuff done before we make anything from an announcement standpoint.” \n\n\r\n              Lakers: Beasley scored 11 points in the second quarter. ... Davis had eight rebounds during the third quarter.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host the Los Angeles Clippers on Sunday in what could be a first-round preview.\n\n\r\n              Lakers: Host Utah on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994110.624427
}