{
  "game_id": "0021900937",
  "espn_id": "401161579",
  "date": "Mar 06, 2020",
  "matchup": "MEM @ DAL",
  "headline": "Porzingis, Doncic lead Mavericks past Grizzlies 121-96",
  "body": "DALLAS --  Kristaps Porzingis had 26 points and 11 rebounds and Luka Doncic added 21 points as the Dallas Mavericks beat the Memphis Grizzlies 121-96 on Friday night.\n\nIt was Porzingis' fifth straight game with at least 20 points and 10 rebounds. He has averaged 30.0 points and 12.2 rebounds in the five games. On Friday, he also had four blocks, only one turnover and was a plus-38.\n\n\"It took me a little bit of time to figure some things out and feel really comfortable out there,\" said Porzingis, who has played 48 games this season for Dallas after playing only 48 last season for the New York Knicks because of injury. \"Now, it feels natural. It feels organic. It feels just in the rhythm of the game.\n\n\"I know where my shots are going to come from and when I can be aggressive. It feels much more just simple and natural, I'm in a good rhythm now and want to keep that going.\"\n\n\"Everyone's caught up in the offensive stats,\" Dallas coach Rick Carlisle said of Porzingis, \"but for me it's a combination of his offensive production and what he's doing defensively and rebounding. It's ridiculous.\"\n\nThe Mavericks quickly built on a 12-point halftime lead, dominated the third quarter 34-16 and improved to 14 games over .500 for the first time this season. Seventh in the Western Conference, they remain a half-game behind Oklahoma City.\n\nJosh Jackson led the Grizzlies, eighth in the West, with 16 points off the bench. Dillon Brooks added 15, two after the first quarter, and Jonas Valanciunas had 14 points and 11 rebounds as Memphis failed to move over .500 for the first time since Feb. 20. The Grizzlies came off the first back-to-back 39-point road wins in NBA history.\n\n\"They competed really, really hard, shot it really great,\" Grizzlies coach Taylor Jenkins said of the Mavericks. \"Our defense kind of let us down in that first quarter, start of the third quarter. Got to get better.\"\n\nJa Morant, leading Memphis with 17.6 points per game coming in, was limited to 11, shooting 4 for 11 from the floor, in his matchup with Doncic.\n\n\"It's my job to play against the best, play this game,\" Morant said. \"I'm just happy to be here.\"\n\nWith Dallas leading 33-28 after one quarter, Memphis scored the first nine points of the second period to take a 37-33 lead. But with the Grizzlies ahead 39-37 with 8:26 left in the half, the Mavericks went on a 19-2 run to pull ahead with 4:16 to go in the period. Porzingis closed the run with nine straight points on two 3-pointers and three free throws after being fouled behind the arc.\n\nThe Mavericks played without two starters, guard Tim Hardaway Jr. (illness) and forward Dorian Finney-Smith (injured right hip). Then, starting guard Seth Curry was lost with an injured left ankle after scoring 15 points in the first half, shooting 7 of 9 from the floor.\n\nTIP-INS\n\nThe road team won in this series for the first time in six games . . Finney-Smith was the last Dallas player to have appeared in every game this season, including 60 starts. He played in every game for the Mavericks in two of his three previous seasons. ... Courtney Lee made his sixth start this season for Dallas, replacing Finney-Smith, and had a season highs with 13 points in 29:16.\n\nMUM ON DENIED PROTEST\n\nCarlisle and Mavericks owner Mark Cuban had little to say before the game on the NBA's denial of Dallas' protest of the 111-107 loss at Atlanta on Feb. 22 and the $500,000 fine of Cuban for his public criticism of the officiating at the end of that game in which Dallas was called for goaltending, a putback was made as play continued and the officials then ruled there was no goaltending.\n\n\"What I'll say on the record is hopefully they'll let us release our actual filing of the protest,\" Cuban said. \"I'm waiting to hear back from them. Then everybody gets to see why we thought it needed to be protested.\"\n\nCarlisle said, \"This situation, this set of circumstances will improve the game long term, and that's a good thing.\"\n\nTHE INS AND OUS\n\nDallas went into the game second in the NBA attempting 3-points (41.4) while Memphis led the league in points in the paint (56.6). The Mavericks indeed fired from long range (18 for 47) but led in points in the paint through three quarters 40-34 before falling behind 52-46.\n\nUP NEXT\n\nThe Grizzlies host the Atlanta Hawks on Saturday having gone 6-3 on the back ends of back-to-backs this season.\n\nThe Mavericks will finish a three-game homestand on Sunday against the Indiana Pacers.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995682.753851
}