{
  "game_id": "0022200590",
  "espn_id": "401468745",
  "date": "Jan 06, 2023",
  "matchup": "LAL vs. ATL",
  "headline": "LeBron leads Lakers past Hawks 130-114 for 4th straight win",
  "body": "LOS ANGELES -- — LeBron James had 25 points and 10 assists in his return from an illness, Russell Westbrook added 18 points, 11 rebounds and nine assists, and the Los Angeles Lakers beat the Atlanta Hawks 130-114 Friday night for their first four-game winning streak in just under a year.\n\n\r\n              Kendrick Nunn had 23 points in the highest-scoring performance of his tenure with the injury-depleted Lakers, who never trailed while beating the Hawks for the second time in eight days. Los Angeles won in Atlanta on Dec. 30 with James scoring 47 points on his 38th birthday.\n\n\r\n              The Lakers jumped to a 26-point lead in the first half of the rematch and hung on comfortably for their fifth win in six games overall. They hadn't won four straight since Jan. 7, 2022, when they also beat Atlanta in Los Angeles.\n\n\r\n              Thomas Bryant had 19 points and 13 rebounds for LA, while Dennis Schröder scored 21.\n\n\r\n              “There are going to be times where guys go down, unfortunately, and we have a group of guys that have just been preparing themselves for when it's their moment to play and play well,” Westbrook said. “Seems like we've been hitting a good stride of figuring that out.”\n\n\r\n              Trae Young scored 21 of his 32 points in the second half for the Hawks, who have lost five of six. Unable to overcome a dismal first half, Atlanta has lost two of three on its four-game California road trip.\n\n\r\n              “We didn't do a good job stopping the ball (or) protecting the paint,\" Atlanta coach Nate McMillan said. “We had some fight in the second half, but just too deep of a hole.”\n\n\r\n              James returned to the Lakers' lineup after sitting out Wednesday's impressive victory over Miami with a bad cold, but Los Angeles played without Anthony Davis, Lonnie Walker, Troy Brown, Damian Jones and Austin Reaves, the newest addition to Los Angeles' long injury list with a strained left hamstring.\n\n\r\n              Coach Darvin Ham sees a bright side in Davis' latest lengthy injury absence for the healthy Lakers.\n\n\r\n              “It's motivating them to step their games up,” Ham said. “They know I'll put anybody out there, and if they're playing the right way, they'll play a significant amount of minutes.”\n\n\r\n              Reaves and Walker, who has left knee tendinitis, are both out for at least two more weeks, depriving the Lakers (18-21) of two key rotational players as they attempt to keep up their overall solid play since a 2-10 start. Los Angeles used its 21st starting lineup of the 39-game season against Atlanta.\n\n\r\n              “The Rubik's Cube was one of my favorite toys growing up,” Ham said before the game. “Coming in real handy right now.”\n\n\r\n              After putting up 37 points in their highest-scoring first quarter of the year, the Lakers opened a 26-point lead in the second. Their 21-point halftime lead was also their largest of the season.\n\n\r\n              Young scored 17 points in the third quarter.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: McMillan got a technical foul while Atlanta trailed by 13 with 4:10 to play for arguing a foul called on John Collins. ... Clint Capela missed his sixth straight game with a right calf strain.\n\n\r\n              Lakers: Sterling Brown played three minutes for LA about nine hours after signing a 10-day contract with the Lakers. He played under Ham while both were with the Bucks from 2018-20. Brown is the younger brother of Shannon Brown, who won NBA titles with the Lakers in 2009 and 2010. ... Gail Goodrich was the honorary captain. The 79-year-old Los Angeles native and Hall of Famer played nine of his 14 NBA seasons with the Lakers.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At the Los Angeles Clippers on Sunday.\n\n\r\n              Lakers: At the Sacramento Kings on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994136.347808
}