{
  "game_id": "0021500001",
  "espn_id": "400827888",
  "date": "Oct 27, 2015",
  "matchup": "DET @ ATL",
  "headline": "Pistons surprise Hawks on opening night, winning 106-94",
  "body": "ATLANTA -- The Atlanta Hawks picked up Tuesday where they left off in the Eastern Conference finals.\nAnother loss.\nHardly looking like the team that went 60-22 last season, the Hawks were dominated on the boards and struggled to find their offensive rhythm in a surprising 106-94 loss to the Detroit Pistons on opening night in the NBA.\nKentavious Caldwell-Pope scored 21 points to lead all five Detroit starters in double figures, while Andre Drummond pulled down 19 rebounds to lead a commanding 59-40 edge. The Hawks fell behind by as many as 19 and couldn't rally even when the Pistons missed 20 of their final 22 shots from the field.\n\"They were very good tonight. We weren't,\" Atlanta coach Mike Budenholzer said. \"We get to go to work tomorrow.\"\nThe Pistons, who haven't had a winning season since 2008 and finished 28 games behind the East-leading Hawks a year ago, began to pull away just before halftime. They led by double figures through most of the final two quarters.\n\"We had a hard training camp, you know what I'm saying?\" Marcus Morris said. \"We didn't put in as much hard work as we did to just come out here and lay an egg.\"\nDrummond had 18 points. Morris also had a double-double with 18 points and 10 rebounds. Ersan Ilyasova chipped in with 16 points, while Reggie Jackson added 15.\nDuring one especially frustrating sequence for the sellout crowd in Atlanta, the Pistons grabbed four offensive rebounds before Ilyasova got one to drop. It looked like keepaway on the playground, the Hawks jumping around futilely trying to get the ball.\n\"We rebounded the hell out of the ball,\" Piston coach Stan Van Gundy said. \"Our guys really worked.\"\nAfter the best regular season in franchise history, the Hawks won two playoff series before getting swept by the Cleveland Cavaliers in the conference final.\nLooking to improve on the glass, their biggest weakness, the Hawks acquired 6-foot-11 Tiago Splitter from San Antonio. He made no immediate difference, picking up as many fouls as rebounds (four apiece).\nDetroit won despite shooting just 38.5 percent (37 of 96).\nDennis Schroder led the Hawks with 20 points. Paul Millsap had 19 and Jeff Teague 18, but new starter Kent Bazemore -- who stepped in at small forward after DeMarre Carroll left in free agency -- was held scoreless.\n\"This is a lot different than last year,\" Bazemore said. \"A lot of teams slept on us last year. We've got to answer the call.\"\nThe Pistons gave a glimpse of what was to come right from opening tipoff. Caldwell-Pope knocked down a 3-pointer midway through the first quarter to push Detroit to a 20-10 lead.\nAtlanta tied it up by the end of the period and finally pushed out to a lead early in the second. But the Hawks were never up by more than five points.\nDetroit seized control with a 17-4 spurt that finished up the second quarter and carried on into the third. Caldwell-Pope started the stretch with a 3-pointer and finished it with a three-point play, putting the Pistons ahead 56-43.\n\"We need time to get back into a good rhythm,\" Millsap said. \"Hopefully it will happen sooner than later.\"\nQUOTABLE\n\"We keep flying under the radar, that's cool with us.\" -- Jackson, hoping the Pistons can sneak up on a few more teams in the early going after starting last season 5-23.\nTIP-INS\nPistons: F Anthony Tolliver missed the game after getting word that his pregnant wife was in labor. He took a flight home early Tuesday to be with his spouse and their new daughter. ... The Pistons got only 18 points from the bench.\nHawks: G Tim Hardaway Jr., who was acquired from New York for a first-round draft pick, was surprisingly on the inactive list for his first game with Atlanta. He was denied a chance to go against his father, an assistant coach for the Pistons. ... Rookie G-F Lamar Patterson, a second-round pick in 2014 who played last season in Turkey, had 5 points in 18 minutes. ... Atlanta picked up the fourth-year contract options on both Hardaway and Schroder. ... F Mike Muscala went out with a sprained right ankle and did not return.\nUP NEXT\nPistons: Host Utah in their home opener on Wednesday night.\nHawks: After a day off, travel to New York to face the Knicks on Thursday night.\n---\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963",
  "source": "espn_api",
  "crawled_at": 1764994964.54565
}