{
  "game_id": "0021300984",
  "espn_id": "400489857",
  "date": "Mar 15, 2014",
  "matchup": "DET vs. IND",
  "headline": "Pacers rally from 25-point deficit, beat Pistons in OT",
  "body": "AUBURN HILLS, Mich. -- Down by 25 in the second quarter, the Indiana Pacers still had plenty of time.\n\"We needed a little reminder of what we are playing for here,\" coach Frank Vogel said.\nThe Pacers responded with one of the most impressive comebacks of the NBA season, catching the Detroit Pistons in the fourth quarter and eventually pulling away in overtime for a 112-104 victory Saturday night. Indiana leads Miami by 3 1/2 games in the race for the top seed in the Eastern Conference.\nPaul George had 30 points, eight rebounds and seven assists for the Pacers.\n\"We knew this was going to be a long game,\" George said. \"We knew we had a chance to come back and we just had to take small steps. We had to chip away and get this win.\"\nJosh Smith scored 23 points for the Pistons, who lost star center Andre Drummond in the first quarter to a neck injury. Drummond was able to walk off with some assistance and was a bit sore after the game.\n\"Just a little bit of a scare,\" Drummond said. \"It's hard for me to make moves left and right sometimes, but it shouldn't be anything that should stop me from the next few days.\"\nEvan Turner added 20 points for the Pacers, and David West scored six of his 15 points in overtime.\nDetroit led 56-31 in the second quarter but couldn't hold on. The Pistons trail Atlanta by five games for the final playoff spot in the East.\nIt was the second-biggest comeback victory in the NBA this season, according to STATS. Golden State rallied from 27 down against Toronto on Dec. 3.\n\"Really proud of our guys,\" Vogel said. \"I did not like the deficit we built especially in that first half, but we stayed with the game and came back with better energy.\"\nDrummond, Detroit's promising second-year center, left with 6:32 remaining in the first quarter. He appeared to be hit in the head inadvertently by the Pacers' Roy Hibbert during a scramble near the basket.\n\"I got my hand on the ball and the ball rolled between my legs,\" Drummond said. \"I reached down and came up and I ended up, my head hit Roy Hibbert in his thigh and sent a shock throughout my whole body.\"\nDrummond stayed down through an entire timeout. A stretcher was eventually brought onto the court, but he was able to get up and walk off toward the tunnel.\nEven without him, Detroit dominated the first half. A putback dunk by Jonas Jerebko pushed the lead to 25, and it was 60-41 at halftime.\nThe Pacers started the second half with eight straight points, and George scored 14 points in the third quarter. Detroit led 79-73 after three.\nIt was tied at 83 when Smith put Detroit back ahead with a layup. Then Detroit's Greg Monroe and Indiana's Luis Scola became entangled, leading to a brief skirmish and technical fouls on both players.\nA three-point play by Turner put Indiana ahead, but the Pacers couldn't shake the Pistons, and George missed a jumper from the left elbow that could have won the game at the end of regulation.\n\"I thought we had a good stand at the end,\" Detroit interim coach John Loyer said. \"They put it in their best player's hands. I thought we did a pretty good job contesting the shot.\"\nIt was 100-all heading into overtime. With Indiana up 104-102, West made a couple jumpers to give the Pacers a six-point lead.\n\"In the overtime we just tried to get good quality looks,\" West said. \"We didn't want to turn the ball over and we just wanted to make sure we got quality looks at the rim.\"\nGame notes\nIt was Indiana's 17th victory of the season when trailing at halftime. ... Andrew Bynum scored 15 points with nine rebounds in 20 minutes for the Pacers. ... Detroit came into the game averaging an NBA-best 52.7 points in the paint. Indiana was allowing an NBA-low 35.4. Both teams ended up with 46 on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764993288.637673
}