{
  "game_id": "0021501099",
  "espn_id": "400828986",
  "date": "Mar 28, 2016",
  "matchup": "CHI vs. ATL",
  "headline": "Teague free throws help Hawks hold off Bulls, 102-100",
  "body": "CHICAGO -- Jeff Teague and the Atlanta Hawks used a solid night at the line to turn away a big push by the Chicago Bulls.\nIt was a nice little tune-up for the playoffs.\n\nTeague scored 26 points, including four free throws in the final 22.2 seconds, and the Hawks edged the Bulls 102-100 on Monday.\n\"You want to have some close games and execute and do some things defensively and offensively, feel the pressure a little bit and make some free throws,\" Atlanta coach Mike Budenholzer said. \"So it was good to find a way to win on the road in a close game.\"\nAl Horford had 14 points and 10 rebounds for the Hawks, and Paul Millsap finished with 11 points and 11 boards. Dennis Schroder also scored 14 points.\nAtlanta (45-30) completed a season sweep of Chicago with its fourth consecutive victory. The Hawks are sitting in third in the Eastern Conference, while the Bulls are in danger of missing the playoffs.\n\"We knew they were going to come out tonight and throw a big punch early, their season's kind of on the line right now,\" said Kyle Korver, who scored 12 points for the Hawks. \"We heard that they had a big meeting. They came out and really got on us early.... We were able to hold on and those are the things you got to do to make the playoffs.\"\nThe Bulls (36-37) have lost four in a row and trail Detroit by 2 1/2 games for the eighth and final playoff spot in the East. They had a team meeting over the weekend to address the slide, but shot just 38 percent against the Hawks.\nAtlanta went 8 for 8 at the line in the final minute. Korver and Thabo Sefolosha each hit two before Teague added two more with 6.6 seconds remaining, icing the game before Derrick Rose's meaningless 3-pointer for Chicago at the very end.\nThe Bulls trailed by as many as 15 in the second half, but had a chance to tie the game in the final seconds. Mike Dunleavy missed a late layup and then fouled Teague, who went 8 for 8 at the line for the game.\n\"I like the way we competed tonight,\" Rose said. \"We just have to keep it up. We are still fighting, still trying to find our rhythm.\"\nRose finished with 20 points on 8-for-25 shooting. Pau Gasol had 19 points and 11 rebounds, and Aaron Brooks scored 16 points.\n\"Yeah, we got to win,\" said Chicago star Jimmy Butler, who had 15 points. \"We've been in this position all year long. It's an uphill fight. We've just got to keep battling.\"\nTIP-INS\nBulls: Taj Gibson had nine points and 12 rebounds. ... G E'Twaun Moore missed his sixth straight game because of a left hamstring injury. Coach Fred Hoiberg said he hoped Moore would be able to play by the end of the week. ... The Bulls will play six of their final nine games on the road.\nHawks: Atlanta went 25 for 28 at the line, including 10 of 12 in the fourth quarter. ... Atlanta's 4-0 record against the Bulls marks its first season sweep of Chicago since 2008-2009, and only its second since the team moved to Atlanta before the 1968-69 season. ... The Hawks have won 12 of their last 14.\nHIGHLIGHTS OF HINRICH\nThe Bulls welcomed Kirk Hinrich, traded to Atlanta in February, back to the United Center with a video montage of Hinrich's plays through the years in a Bulls uniform. Hinrich was drafted by Chicago in 2003 and played for the Bulls until 2010 and then again from 2012 until earlier this season. Hinrich watched the video tribute and acknowledged an ovation from the Chicago fans.\nUP NEXT\nBulls: At Indiana on Tuesday.\nHawks: At Toronto on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764993901.110955
}