{
  "game_id": "0021800006",
  "espn_id": "401070696",
  "date": "Oct 17, 2018",
  "matchup": "MIA @ ORL",
  "headline": "Bamba, Gordon lead Magic over Heat 104-101",
  "body": "ORLANDO, Fla. --  Mohamed Bamba made a big impact in his first NBA game.\n\nOrlando's 7-foot rookie dunked twice and blocked a shot during a 9-0 fourth quarter run, and the Magic held on for a 104-101 win over the Miami Heat in the season opener for both teams Wednesday night.\n\n\"I was so nervous going out there, but it was everything that I expected. It was a fun game to play in,\" said Bamba, who came off the bench for 13 points, seven rebounds and two blocks in 25 minutes. \"It's just a matter of doing that 81 more times.\"\n\nAaron Gordon had 26 points and 16 rebounds for the Magic, who went without a field goal over the final 4 1/2 minutes.\n\nGoran Dragic led Miami with 26 points and Josh Richardson added 21.\n\nWith the Magic leading 86-81 early in the fourth quarter, Bamba swatted away a shot by Richardson, and Terrence Ross got his hands on two more Heat shots during Miami's scoreless stretch of nearly four minutes. Bamba dunked in two Orlando misses, and Jerian Grant hit a jumper to lift the Magic to a 92-81 lead with 7:50 remaining.\n\nRichardson, Dragic and backup center Bam Adebayo rallied the Heat in the closing minutes, and after the Magic missed three free throws in the final seconds, Miami had a chance to win. But Richardson dribbled out of bounds before Evan Fournier hit two free throws with 1.6 seconds left for the game's final points.\n\n\"If I had a little more space on the baseline, I was going to attack, probably spin and make something happen, but I ran out of real estate,\" Richardson said. \"I've just got to make a better play.\"\n\nThe Heat started well and ended with a rally. But after making 11 of their first 20 shots, they finished the game shooting just 39 percent (38-for-97).\n\n\"We had a tough time creating looks the way we wanted to, but you have to credit their defense,\" sad Miami coach Eric Spoelstra. \"They're long, they do a really good job of protecting the paint.\"\n\nMiami led 28-14 after Richardson's 3-pointer late in the first quarter.\n\nA 3-pointer by Nik Vucevich gave Orlando its first lead at 37-36, and the Magic led 54-51 at halftime in spite of Dragic's 16 points and Fournier's 0-for-5 from behind the 3-point line.\n\nThe Magic's bench (Bamba, Ross, Grant and Jonathon Simmons) contributed 36 points, 18 rebounds and seven blocks.\n\n\"Offensively, we were here and there, but the story of the game was the bench,\" said Magic coach Steve Clifford. \"When they went in the game they picked up our defense and we played offense off our defense, which is something you have to do earlier in the year.\"\n\nFINAL RUN FOR WADE\n\nDwayne Wade entered his 16th and final NBA season at the 8:22 mark of the first quarter and played 26 minutes, finishing with nine points and 11 rebounds. \"I'm not going to play him playoff minutes, or anywhere near that, right now,\" said Spoelstra. \"He knows how to approach an 82-game season even better than I do.\"\n\nBIG STEPS UP?\n\nWhile declining to predict a number of wins, Clifford said a \"realistic goal\" is to finish among the NBA's top 10 in defense and top 15 in offense in points per possession. Orlando was 21st and 24th, respectively, in those categories last season.\n\nTIP-INS\n\nHeat: F Justise Winslow (hamstring), G Wayne Ellington (ankle), G Dion Waiters (ankle) and F James Johnson (hernia) did not play and are not expected to play Thursday night.\n\nMagic: The Magic made 7-of-25 3-point shots and missed 12 free throws. . ... Orlando is 52-64 all-time against its intrastate rival, but has won 7 of the last 11.\n\nUP NEXT\n\nHeat: At Washington on Thursday night.\n\nMagic: At home against Charlotte on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995277.121664
}