{
  "game_id": "0021800132",
  "espn_id": "401070813",
  "date": "Nov 03, 2018",
  "matchup": "LAL @ POR",
  "headline": "James scores 28 points, Lakers defeat Blazers 114-110",
  "body": "PORTLAND, Ore. --  It took LeBron James to help the Los Angeles Lakers snap a lengthy losing streak against Portland.\n\nJames had 28 points and seven assists and the Lakers defeated the Trail Blazers 114-110 Saturday night.\n\nThe Lakers snapped the franchise's 16-game losing streak against the Blazers. In addition to the streak, Saturday was the Lakers' first road win this season against a team with a winning record.\n\n\"Great to snap that,\" James said of the Lakers' streak of futility against Portland. \"They're a very good team, obviously. To beat Portland, you can't just come in and win without playing really hard and really well.\"\n\nRajon Rondo gave the Lakers a huge lift off the bench, finishing with 17 points and 10 assists in 25 minutes.\n\nDamian Lillard and CJ McCollum each scored 30 points for Portland.\n\nThe Lakers used a 16-0 run in the third quarter to take a 17-point lead. Josh Hart hit a 3-pointer with 9:44 left that gave the Lakers their biggest lead at 95-75, forcing a Portland timeout.\n\nAnd the timeout might have been just what Portland needed to get back into the game.\n\nThe Blazers went on a 22-8 run, cutting the Lakers' lead to six points with 3:34 left after a layup by Jusuf Nurkic.\n\nSloppy play once again came back to hurt the Lakers in the fourth quarter, but the Blazers couldn't get much closer as James and JaVale McGee made crucial baskets in the final two minutes.\n\n\"LeBron closed them out over the final three minutes,\" Lakers head coach Luke Walton said of James.\n\nMcGee, who James said is a candidate for Defensive Player of the Year, also had six blocks to add to his league-leading total.\n\n\"He's doing a little bit of everything,\" James said of McGee. \"He's leading the league in blocks. And tonight he saved us and covered our defensive mistakes with blocks at the rim.\"\n\nPortland shot a 6 for 35 (17 percent) from beyond the arc and shot just 42 percent from the field overall.\n\n\"Our defense won us the game tonight,\" Walton said. \"They missed some 3s, but we were contesting, chasing over the top and defending.\"\n\nThe Lakers had seven turnovers in the fourth quarter and finished with 20 overall, but they survived their mistakes.\n\nThe Lakers sped to a good start, but the Blazers quickly regained control. Turnovers and second chances fueled a 17-2 run by Portland in the first quarter.\n\nThe Lakers bench helped get Los Angeles back into the game in the first half and outscored the Blazers subs 51-26.\n\n\"Our second unit was outstanding tonight,\" Walton said. \"Rondo led it and then the lift that (Ivica) Zubac gave us off the bench was incredible.\"\n\nTIP-INS\n\nTrail Blazers: Blazers head coach Terry Stotts says it's hard to get a handle for where his team really is on the defensive end due to the league's uptick in pace and scoring so far this season.\n\n\"It's hard to get a handle around the league where defense is,\" Stotts said. \"The numbers say we're 11th but it doesn't feel like it, but we are. I think this season has to settle in to see where we are with it. Unless you hold a team to 80 or 90 you'll always find things you have to get better at.\"\n\nLakers: Phoenix Suns center Tyson Chandler will join the Lakers once he clears waivers after agreeing to a contract buyout. A person with direct knowledge of the situation confirmed the buyout plan to The Associated Press on Saturday, speaking on condition of anonymity because the Suns had not yet revealed it publicly.\n\nWhile Lakers head coach Luke Walton dodged direct questions about the move, Stotts likes what Chandler brings to the table for the Lakers. Stotts coached Chandler in Dallas in 2011.\n\n\"I like Tyson Chandler,\" Stotts said. \"Great teammate, obviously that was a few years ago but he impacts the game at the defensive end. He's a great locker room guy, great teammate. He's all about winning. So, any team that has Tyson is going to be better for it.\"\n\nUP NEXT\n\nLakers: Home against Toronto Raptors on Sunday.\n\nTrail Blazers: Home against Minnesota Timberwolves on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995036.736755
}