{
  "game_id": "0021900627",
  "espn_id": "401161269",
  "date": "Jan 18, 2020",
  "matchup": "MIL @ BKN",
  "headline": "Bucks win easily again, beat Nets 117-97 for 6th straight",
  "body": "NEW YORK --  Their lead was only nine with a minute left in the first half and it looked like the Milwaukee Bucks might be on their way to a close game.\n\nThen Khris Middleton hit two 3-pointers, and another rout was on for a team that just keeps racking them up.\n\n\"I think they are playing as good as anybody I've seen in a while in this league,\" Nets coach Kenny Atkinson said.\n\nGiannis Antetokounmpo had 29 points and 12 rebounds, Middleton scored 20 points, and the Bucks beat Brooklyn 117-97 on Saturday night for their sixth straight victory.\n\nThe Bucks ran the NBA's best record to 38-6. They came in beating opponents by 12.4 points per game, which would be a league record if it holds up all season, and their lead was never below that after Middleton hit consecutive 3s in the final minute of the second quarter when Brooklyn trailed just 51-42.\n\n\"I think we're playing great basketball right now, but we know the later the season goes, the deeper we go into the playoffs, that we've got to continue to raise our level of play,\" Middleton said.\n\nMilwaukee coasted through the second half and fell just short of a fifth consecutive game with 120 points, which would have tied a franchise record set last season. The Bucks shot 50% from the field, made 17 3-pointers and held the short-handed Nets to 33% shooting.\n\nThat wasn't enough to satisfy Antetokounmpo, the league MVP when the Bucks had the league's best record last year before they couldn't even reach the NBA Finals.\n\n\"We were good last year, but obviously we didn't win the championship,\" he said. \"We want to (be) a team that can be (there) at the end of the year to compete for the championship. We've got to get better. There's not another option.\"\n\nKyrie Irving had 17 points, six rebounds and six assists for the Nets. Rookie reserve Nic Claxton added 14 points and six boards.\n\nThe Nets dropped their third straight as they scuffle through a rough part of their schedule that includes visits from both conference leaders in a six-night stretch. They host the Los Angeles Lakers on Thursday.\n\n\"Great players come in and great teams come in, they're playing well. We're still trying to establish what that continuity, consistency looks like for us, so we'll continue to battle,\" Irving said.\n\nThe Bucks, who didn't trail in either of their previous two games, fell behind by four early in this one. They quickly erased that and closed the first quarter with a 7-0 run for a 30-22 lead, then got 10 points apiece from Antetokounmpo and Middleton in the second quarter to extend the lead to 57-42.\n\nAntetokounmpo then knocked down Milwaukee's third straight 3 to open the scoring in the second half, and the lead would eventually grow to 25 points.\n\nMilwaukee has won 16 of the last 19 meetings.\n\nTIP-INS\n\nBucks: Robin Lopez sat out because of an illness. ... Milwaukee scored 100 or more points for the 68th straight game, dating to last February, to break a tie with Dallas in the 1985-86 and 1986-87 seasons for the second-longest streak in the last 35 seasons. Denver did it in 75 straight games from Dec. 2, 1986, to Nov. 20, 1987.\n\nNets: Brooklyn is without Joe Harris (sore lower back), DeAndre Jordan (dislocated right middle finger) and Garrett Temple (bruised right knee). Atkinson said there was a chance Temple and Harris could return Monday against Philadelphia.\n\nDURANT DOINGS\n\nAtkinson can see the progress, but he still doesn't expect to see Kevin Durant on the floor this season.\n\n\"No, I think we're all on the same page. That's not going to happen,\" the Nets coach said.\n\nThat's the same thing Durant and the Nets said before the season, with the All-Star forward recovering from surgery for a ruptured Achilles tendon. Atkinson said he can tell that Durant is getting better, and even if he isn't on the court, he can still lend his knowledge on the bench and in the locker room.\n\n\"He's a quiet personality, but when he needs to say something he says it,\" Atkinson said. \"And usually what he says is spot on.\"\n\nTHE BROOKLYN BUCKS\n\nMilwaukee has won eight straight games in Brooklyn, the Nets' longest current home losing streak against an opponent. The Bucks' last loss at Barclays Center was a triple-overtime defeat on March 20, 2015, when Antetokounmpo was in his second season.\n\nUP NEXT\n\nBucks: Host Chicago on Monday before traveling to Paris to face Charlotte.\n\nNets: Host Philadelphia on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996142.779551
}