{
  "game_id": "0022000123",
  "espn_id": "401267283",
  "date": "Jan 08, 2021",
  "matchup": "PHX @ DET",
  "headline": "Pistons rally from 23 down, beat Suns 110-105 in OT",
  "body": "DETROIT -- — Even while losing seven of their first eight games, the Detroit Pistons competed. None of those defeats was by more than 15 points.\n\n\r\n                    So perhaps it was no surprise that after falling behind by 23 against an impressive Phoenix team, Detroit gamely fought back.\n\n\r\n                    Jerami Grant had 31 points, 10 rebounds and a crucial assist near the end of regulation, and the Pistons beat the Suns 110-105 in overtime Friday night. Coach Dwane Casey was pleased his team's effort resulted in a win.\n\n\r\n                    “They’ve got to get some reward,\" Casey said. \"Slowly but surely, I think we’re going to come together — we’re coming together.”\n\n\r\n                    Detroit scored the first nine points of the extra session after barely leading at all during regulation. Grant had only two assists on the night, but one of them was to Mason Plumlee for a dunk that tied it at 93 with 9.6 seconds remaining in the fourth quarter. \n\n\r\n                    “I’m very impressed with his patience and his decision-making,” said teammate Blake Griffin, who had 16 points and 12 rebounds. “Had a big pass to Mason, obviously, to tie the game. So his decision-making is unbelievable.”\n\n\r\n                    Devin Booker missed a jumper that could have won it for the Suns at the end of the fourth.\n\n\r\n                    Booker scored 23 points for Phoenix, including a 3-pointer with 40.7 seconds left in overtime that brought the Suns within three. Grant answered with a 3-pointer in front of the Detroit bench to double the lead.\n\n\r\n                    The Pistons said the win marked their largest comeback victory in at least the last 20 years.\n\n\r\n                    Phoenix entered the game with the best record in the Western Conference. Detroit came in with the worst mark in the NBA. It looked like that for much of the first half.\n\n\r\n                    Langston Galloway scored 17 points in the half for the Suns against his former team, and Phoenix led 54-31 in the second quarter. Detroit went on a 17-2 run to end the half and eventually tied it at 70 in the third quarter.\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: F-C Jalen Smith was out due to health and safety protocols. ... After making 21 3-pointers in a win over Toronto on Wednesday, the Suns made 17 on Friday, but they needed 52 attempts. They also shot just 6 of 13 on free throws.\n\n\r\n                    Pistons: Detroit was 25 of 29 on free throws, and that was important because the Pistons shot 41% from the field. ... Detroit has won eight in a row against the Suns. ... The Pistons tied a franchise record with their fourth straight game shooting at least 85% on free throws.\n\n\r\n                    ADJUSTMENTS\n\n\r\n                    Detroit slowed Phoenix by playing plenty of zone defense.\n\n\r\n                    “It was good to us,\" Casey said. \"We weren’t stopping them man to man, so we had to give them a different look.”\n\n\r\n                    Suns coach Monty Williams said his team didn't make the zone work hard enough.\n\n\r\n                    “We got 52 3s up, so we didn’t have a problem getting up shots. We didn’t make shots,” he said. “When we’re flowing offensively, teams are throwing different defenses at us, and we have to respond the right way.”\n\n\r\n                    BIG HALF\n\n\r\n                    Galloway, who played three seasons with the Pistons from 2017-20, made his first six shots — five from 3-point range. He didn't score after that, however.\n\n\r\n                    “It felt good,” he said. “Just kind of upset and disappointed we didn’t pull that one out. That’s one you’ve got to have.”\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Visit Indiana on Saturday night. Phoenix hasn't won on the road in that series since 2016.\n\n\r\n                    Pistons: Host Utah on Sunday. Detroit has dropped eight in a row against the Jazz.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997769.9645262
}