{
  "game_id": "0022300077",
  "espn_id": "401584705",
  "date": "Oct 27, 2023",
  "matchup": "CHA vs. DET",
  "headline": "Alec Burks scores 24, more physical Pistons outlast Hornets 111-99 for 1st victory of the season",
  "body": "CHARLOTTE, N.C. -- — Alec Burks scored 24 points, Jalen Duren dominated the paint with 14 points and 17 rebounds and the Detroit Pistons defeated the Charlotte Hornets 111-99 on Friday night for their first win of the season.\n\n\r\n              Jaden Ivey had 18 points and Isaiah Stewart scored 11 of his 15 points in the fourth quarter for the Pistons, whose bench outscored the Hornets 58-19. \n\n\r\n              Cade Cunningham, who had 30 points in the season opener against Miami, was held to 12 points on 4-of-13 shooting before fouling out.\n\n\r\n              But the Pistons didn't need much from Cunningham, the No. 1 overall pick in 2021, on this night. They were bigger, stronger, tougher and more aggressive than the Hornets, winning the battle on the glass (52-41) while scoring 16 second-chance points to Charlotte's seven.\n\n\r\n              “Our main goal as a team is to play physical and get into people on defense,” Stewart said. \"That's just our identity and what we're trying to do.\"\n\n\r\n              The Pistons clearly imposed their will.\n\n\r\n              By the end of the game, all of Charlotte's big men were in foul trouble and forward P.J. Washington was ejected after committing a flagrant two out of frustration.\n\n\r\n              “We got badly out-physical-ed,” Hornets coach Steve Clifford said. \n\n\r\n              Clifford called Duren the “MVP of the game.”\n\n\r\n              Duren had six offensive rebounds, while Charlotte's two centers, Mark Williams and Nick Richards, combined for seven total boards.\n\n\r\n              “That guy is a monster — and so are they,” Clifford said.\n\n\r\n              This was a Pistons type of game. There were 52 fouls called and plenty of bodies ended up on the hardwood, some with fouls called and others not. Detroit was 21 for 25 from the free throw line, while Charlotte went 26 for 34.\n\n\r\n              Detroit turned 18 Charlotte turnovers into 25 points.\n\n\r\n              LaMelo Ball had 20 points, nine rebounds and nine assists for the Hornets, who shot just 37.5% from the field. Terry Rozier scored 20 points and Gordon Hayward added 19 for Charlotte.\n\n\r\n              The Pistons used a scrappy, physical defense to set the tone during an early 13-0 run en route to 54-47 halftime lead.\n\n\r\n              The Hornets trailed most of the game, but mounted a rally midway through the fourth quarter, cutting the lead to three with 6:15 remaining behind eight straight points from Rozier.\n\n\r\n              But Stewart knocked down a clutch 3-pointer after a Pistons offensive rebound by Ausar Thompson and kickout.\n\n\r\n              The Hornets never challenged again.\n\n\r\n              “A.T. got the rebound and kicked it back out,” Stewart said. “It was wide open and I didn't think about it. I was in rhythm, so I just shot the ball.”\n\n\r\n              Cunningham all but put the game away when he drove the baseline and slipped a pass into the middle of the lane to Thompson for a dunk, giving the Pistons a 106-93 lead with 2:08 left. Thompson finished with six points and 12 rebounds.\n\n\r\n              The Hornets got another encouraging performance from No. 2 overall pick Brandon Miller, who finished with 17 points on 6-of-13 shooting and six rebounds. He had a flying one-handed dunk and knocked down two more 3s. \n\n\r\n              That effort came after he scored 13 points and played a key role in Charlotte’s win over Atlanta on Wednesday night.\n\n\r\n              “He can score in a lot of different ways,\" Clifford said. \"He also competes hard and plays well at both ends of the floor. He played 33 minutes. He’s going to play big minutes. I don’t look at him when he’s out there as inexperienced or anything like that.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host the Chicago Bulls on Saturday night.\n\n\r\n              Hornets: Close out three-game homestand on Monday night versus Brooklyn. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995672.491661
}