{
  "game_id": "0022300418",
  "espn_id": "401585046",
  "date": "Dec 27, 2023",
  "matchup": "PHX @ HOU",
  "headline": "Kevin Durant has 18th career triple-double, Suns beat Rockets 129-113 to end losing streak",
  "body": "HOUSTON -- — Kevin Durant had 27 points, 10 rebounds and a career-high 16 assists for his 18th career triple-double, helping the Phoenix Suns beat the Houston Rockets 129-113 on Wednesday night to snap a three-game losing streak.\n\n\r\n              Durant was 9 of 16 from the field and also had two steals and a block in Phoenix’s first road victory since Nov. 26. The Suns improved to 15-15.\n\n\r\n              “It was amazing to get back on the winning side,” Durant said. \"It sucks losing. Having a tough stretch in the NBA is one of the worst feelings you can have, regardless of how many games we play in a season.”\n\n\r\n              Eric Gordon matched Durant with 27 points in his first game back in Houston since being traded in February. He scored 17 points in the Suns’ 43-point second quarter en route to a 73-55 halftime lead. Devin Booker added 20 points, and Grayson Allen had 16.\n\n\r\n              “It was great to be back here,” Gordon said. “I had a lot of good memories and a lot of fun here and it was a major turning point in my career, coming to Houston, and tonight, we did what we’re supposed to do.”\n\n\r\n              Alperen Sengun led Houston with 24 points, and Jalen Green added 23 with a season-high six 3-pointers. The Rockets are 15-14.\n\n\r\n              “(Green) was aggressive,” Rockets coach Ime Udoka said. “Hunting his shots, looking at the basket more aggressively, getting downhill, and just making the right reads. With their big (playing) back he got some easy ones early on and it snowballed from there\n\n\r\n              Phoenix shot 76% in the second quarter to push its lead to 20, and 12 was the closest the Rockets would get in the second half. Durant scored or got the assist on 10 of their 16 baskets.\n\n\r\n              “Kevin just got into an aggressive mode to score or pass,” Suns coach Frank Vogel said. “Taking the ball in the backcourt, running a high volume of pick and rolls and just being aggressive. He really led us during that stretch.”\n\n\r\n              Jabari Smith Jr scored nine points for Houston before leaving in the third quarter because of a sprained left ankle sprain. A night earlier, the Rockets lost Dillon Brooks to an oblique strain, which forced him to miss a game for the first time this season.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Charlotte on Friday night.\n\n\r\n              Rockets: Host Philadelphia on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996662.7871099
}