{
  "game_id": "0021900831",
  "espn_id": "401161473",
  "date": "Feb 21, 2020",
  "matchup": "OKC vs. DEN",
  "headline": "Chris Paul scores 29 points, leads Thunder past Nuggets",
  "body": "OKLAHOMA CITY --  Chris Paul lectured his teammates on the importance of handling their business after the All-Star break, then he showed them how to do it.\n\nPaul scored 29 points to help the Oklahoma City Thunder beat the Denver Nuggets 113-101 on Friday night.\n\nThe Thunder entered the night sixth in the Western Conference standings. Paul believes Oklahoma City should have a sense of urgency about finishing higher.\n\n\"Some teams try to warm up into it,\" Paul said. \"We don't got that benefit. We've got to come out, 20-something games left -- it's the homestretch.\"\n\nSteven Adams had 19 points and 17 rebounds, and Shai Gilgeous-Alexander added 11 points, nine rebounds and nine assists for the Thunder. They have won 11 of their past 14 games.\n\nThe Thunder had seven players score in double figures. Once again, the point guard trio of Paul, Gilgeous-Alexander and Dennis Schroder set the tone.\n\n\"If you guys had mics on us, you'd see that we are all each other's biggest cheerleaders,\" Paul said. \"I've seen teams where guys aren't necessarily rooting for each other. They want you to do bad so they can be in the game. We're not like that, and it's refreshing and nice to see.\"\n\nNikola Jokic scored 32 points on 12-for-15 shooting and Jamal Murray had 21 points for the Nuggets. They entered the night with the second-best record in the Western Conference.\n\nOklahoma City scored 25 points off Denver's 19 turnovers.\n\n\"We didn't take care of the ball,\" Denver coach Michael Malone said. \"That was a huge issue that happened all night long. We didn't value the ball for 48 minutes.\"\n\nPaul banked in a shot and was fouled with 2.7 seconds left in the first half to tie it, but missed the free throw and the score remained 48-all at halftime.\n\nThe Thunder opened the second half on a 9-1 run that forced the Nuggets to call a timeout. Denver responded, and a 10-0 run cut Oklahoma City's lead to 60-59.\n\nA steal and dunk by Oklahoma City's Luguentz Dort sent the floor cleanup crew scrambling and gave the Thunder a 66-61 lead.\n\n\"I can't say enough about Lu,\" Paul said. \"He makes all the plays that nobody else would. That steal he got -- I just thought about it. And that dunk.\"\n\nPaul was fouled on a made 3-pointer, and his free throw put Oklahoma City up 72-65. The Thunder took a 78-77 edge into the fourth quarter.\n\nOklahoma City, as it has done so often this season, took over in the final period. A dunk by Nerlens Noel on a lob from Schroder put the Thunder up 95-85. A dunk by Adams gave Oklahoma City a 109-97 edge with just under two minutes remaining.\n\nAdams scored 10 points in the fourth quarter, one of eight Thunder players to score in the period.\n\n\"If you got it going, we're going to get it to them,\" Paul said. \"And we just take what's open.\"\n\nTIP-INS\n\nNuggets: Missed all seven of their 3-point attempts in the first quarter and made just 6 of 27 overall. ... Made 31 of 50 shots inside the 3-point line and 21 of 23 free throws.\n\nThunder: Dort made the first 3-pointer by either team more than eight minutes into the game. ... Former University of Oklahoma tight end Blake Bell of the Super Bowl champion Kansas City Chiefs attended the game. ... F Danilo Gallinari was called for a flagrant 1 in the second quarter.\n\nQUOTABLE\n\nPaul, on committing seven of Oklahoma City's 12 turnovers: \"How many did we have? I probably had seven or eight. I had more than half of them. I've got to be better.\"\n\nGRANT'S RECEPTION\n\nFormer Thunder player Jerami Grant received a nice ovation from the crowd when he checked into the game in the first quarter. Oklahoma City traded the forward to Denver this past summer.\n\n\"I thought it was great,\" Grant said. \"I love the fans here. Got a bunch of great memories here. I think it was definitely good.\"\n\nSTAT LINES\n\nThe Thunder have had the best record in the Western Conference since Dec. 18. The 21-8 record comes out to a .724 winning percentage.\n\nUP NEXT\n\nNuggets: Host Minnesota on Sunday.\n\nThunder: Host San Antonio on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Cliff Brunt on Twitter (at)CliffBruntAP",
  "source": "espn_api",
  "crawled_at": 1764996203.8107278
}