{
  "game_id": "0022201178",
  "espn_id": "401469333",
  "date": "Apr 04, 2023",
  "matchup": "ORL vs. CLE",
  "headline": "Mitchell scores 43 to lead Cavs to 117-113 win over Magic",
  "body": "ORLANDO, Fla. -- — Donovan Mitchell scored 43 points, his fourth straight 40-point game, to lead the Cleveland Cavaliers to a 117-113 victory over the Orlando Magic on Tuesday night.\n\n\r\n              The win secured the No. 4 seed in the Eastern Conference and home-court advantage in the first round for the Cavaliers (50-30).\n\n\r\n              “Fifty wins, that’s no small thing, and now we’ve got to be locked in for the playoffs,” Mitchell said.\n\n\r\n              “You want to start at home, be in your own bed, your own facility. All those little things have a major impact in a series. That was a big spark for tonight. You could see it with everybody.”\n\n\r\n              The New York Knicks are currently fifth and Cleveland’s likely first-round opponent with three games left.\n\n\r\n              Mitchell scored Cleveland’s last six points to become the first Cavalier to score 40 or more points in four straight games, and the first player in the NBA since James Harden had five straight in the 2018-19 season.\n\n\r\n              Caris LeVert added 19 points and Darius Garland had 16 points and 10 assists in the opener of a two-game series. The teams meet again Thursday.\n\n\r\n              “When you look at this regular season, this has been a massive success for us,” said Cleveland coach J.B. Bickerstaff. “We’re not done. We’re looking forward to the next part of this, but to win 50 games in the NBA is an accomplishment for sure.”\n\n\r\n              Markelle Fultz had 23 points and eight assists, and Paolo Banchero had 20 points and 10 rebounds for the Magic (34-45).\n\n\r\n              The loss eliminated Orlando from playoff contention.\n\n\r\n              The Magic ran off 13 straight points while the Cavs went scoreless for more than four minutes of the first quarter, and Orlando led by nine — the largest lead of the game — when Gary Harris hit a 3-pointer midway through the second period.\n\n\r\n              But after being held to four shots and six points in the first 17 minutes, Mitchell got it going late in the first half, combining with Levert on a rally that pulled Cleveland ahead just before halftime.\n\n\r\n              “These guys trust me to go out there and do it,” Mitchell said. ”For me, it’s not like it’s forced. Those guys are out there finding me, allowing me to attack, keep going. But I’m also playing within the flow of the offense.\"\n\n\r\n              Two 3-pointers by Mitchell, with a couple of Jarrett Allen blocks in between, lifted the Cavs to a 108-99 lead with 6:04 left.\n\n\r\n              Wendell Carter, who finished with 17 points and 12 rebounds, hit two 3-pointers to regain a one-point lead for the Magic before LeVert’s final 3-pointer put the Cavaliers back ahead with 3:31 remaining. Mitchell took over from there.\n\n\r\n              “Donovan got some clutch baskets down the stretch,” said Fultz. “They just executed down the stretch. They’re a great team. They’re the fourth seed and they came in trying to clinch that, and we came up short in the end.”\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Cleveland’s 50-win season is its first since 1993 without LeBron James on the roster. ... In his four-game 40-plus spurt, Mitchell has scored 169 points in 161 minutes, shooting 60.6% (63 for 104) ... F Isaac Okoro missed a fourth straight game with a sore left knee.\n\n\r\n              Magic: The Magic had a 47-30 rebound advantage.. ... The Magic are 20-20 at home going into Thursday night’s home finale.\n\n\r\n              MEANINGFUL GAME IN APRIL\n\n\r\n              The Magic, out of the postseason for the ninth time in 11 years, came back to play a rare “meaningful game in April” after a 5-20 start, leaving coach Jamahl Mosley with a good feeling after their mathematical elimination.\n\n\r\n              “That’s the fourth seed in the East,” Mosley said. “We held our own, and more so, and our guys have to understand and believe what we’re capable of doing moving forward.”\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994306.4041972
}