{
  "game_id": "0022000824",
  "espn_id": "401307619",
  "date": "Apr 13, 2021",
  "matchup": "TOR vs. ATL",
  "headline": "Bogdanovic, Capela lead Hawks past Raptors 107-103",
  "body": "TAMPA, Fla. -- — Bogdan Bogdanovic scored 23 points, Clint Capela added 19 points and 21 rebounds, and the short-handed Atlanta Hawks beat the Toronto Raptors 107-103 on Tuesday night for their seventh win in eight games.\n\n\r\n                    “Our depth is something we talked about when the season started, and now it's really showing,” said Kevin Huerter, who scored 14 of his 17 points in the first half for Atlanta. “We're going into every game thinking we can win no matter who goes out on the court.”\n\n\r\n                    Brandon Goodwin added 18 points for the Hawks, who were missing seven injured players including Trae Young, who has sat out two games with a left calf contusion after a 42-point, nine-assist performance against Chicago on Friday night.\n\n\r\n                    Pascal Siakam led the Raptors with 30 points, six rebounds and seven assists, and rookie Malachi Flynn scored 22 points.\n\n\r\n                    Toronto played from behind all night, but a 3-pointer by Flynn brought the Raptors within eight with 6:20 left. Bogdanovich and Goodwin answered with 3s for Atlanta. The Raptors made it closer in the final 72 seconds with the help of three more 3-pointers by Flynn. They were 6 of 30 from behind the arc before Flynn made four late in he game.\n\n\r\n                    “Tonight he was pretty much our offense down the stretch,” Raptors coach Nick Nurse said.\n\n\r\n                    Atlanta led 66-54 after shooting 53% in the first half.\n\n\r\n                    Siakam scored 21 points in the half and hit a baseline jumper with 0.6 seconds left — enough time for Solomon Hill to throw a full-court pass to Huerter, who laid it in at the horn.\n\n\r\n                    “That was a lot of fun,” Huerter said. “We looked up and saw point-6 so I knew I had enough time to catch and finish. Great way to end the half.”\n\n\r\n                    The end of the game wasn't quite as great, coach Nate McMillan said.\n\n\r\n                    “We got the win and we did a lot of good things, but we've got to be sharper in the fourth quarter,” he said. “We just did not execute down the stretch.”\n\n\r\n                    Capela, the NBA's leading rebounder, dunked for the Hawks' final field goal with 2:38 left.\n\n\r\n                    “These teams that are playing a lot of small ball, he's done a good job of punishing them in the paint,” McMillan said.\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Capela had his 36th double-double by halftime. ... F Danilo Gallinari sat out a second straight game with a sore right foot. ... G Tony Snell, whose jump shot at the buzzer beat the Raptors on March 11, is out with a sprained ankle.\n\n\r\n                    Raptors: Despite a 21-34 record, the Raptors have outscored their opponents by 19 points. ... G Fred VanVleet missed his sixth game with a left hip flexor. ... G Kyle Lowry (rest) did not play for the seventh time in eight games.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Host Milwaukee on Thursday night.\n\n\r\n                    Raptors: Host San Antonio in Tampa on Wednesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996827.425355
}