{
  "game_id": "0022300019",
  "espn_id": "401584107",
  "date": "Nov 14, 2023",
  "matchup": "IND @ PHI",
  "headline": "Haliburton, Toppin lead the way as the Pacers snap 76ers' 8-game win streak 132-126",
  "body": "PHILADELPHIA -- — Tyrese Haliburton had 33 points and 15 assists, and Obi Toppin chipped in 27 points as the Indiana Pacers beat the 76ers 132-126 in an NBA In-Season Tournament game on Tuesday night and snapped Philadelphia's eight-game winning streak.\n\n\r\n              “We know there was higher stakes in this game with it being the in-season tournament,” Haliburton said. “I've never played in a playoff game, so this is my first chance to compete for a championship and I took it very seriously. ... And I never beat Philly before, so this was an exciting win for me.”\n\n\r\n              The Pacers took the upper hand in the tourney's East Conference Group A standings, improving to 2-0 in pool play. The Sixers slipped to 1-1. \n\n\r\n              Myles Turner added 17 points — including 15 in the fourth quarter — for the Pacers, whose bench outscored Philadelphia's 33-6.\n\n\r\n              “We had to be up to the mental challenge of playing in difficult situations against a team with two great players and a lot of hard playing guys and our guys got the job done,\" Pacers head coach Rick Carlisle said. \n\n\r\n              Joel Embiid scored 39 points and De'Anthony Melton added 30. Tyrese Maxey was held to 27 points on 9-of-23 shooting after scoring a career-high 50 points against the Pacers on Sunday. \n\n\r\n              “Sometimes, the ball is just not bouncing your way,” Sixers head coach Nick Nurse said. “There were times when I was amazed about how we had them in difficult situations and they threw a wild pass and completing it. They would end up with the ball somehow — they only had 11 turnovers — and I felt like we could have doubled it somehow with the sequences. It just wasn't happening tonight for some reason.”\n\n\r\n              In a reversal of the Sixers win on Sunday, it was the Pacers who were in control for most of the first three quarters. The Sixers held the lead for just 26 seconds in the first three quarters as the Pacers built a 13-point lead early in the third thanks to hot shooting from Haliburton and Toppin. Haliburton was sharp from beyond the arc, going 6 for 8 from 3-point distance in the first half to help the Pacers build a 63-54 lead at intermission.\n\n\r\n              The Pacers, after allowing 23 offensive rebounds to the Sixers on Sunday, held Philadelphia to five on Tuesday.\n\n\r\n              “We made some adjustments, but the big adjustment was the disposition and the persistence and the understanding that this was an enormous part of the game,” Carlisle said. “We did rebounding drills in practice (Monday) and its every NBA coach's nightmare because you worry about someone getting hurt. But we established that this was a necessary thing.”\n\n\r\n              For the game, Haliburton was 11 for 18 from the floor and 7 for 12 beyond the 3-point line. He had 32 assists and no turnovers in two games against Philadelphia. Toppin was 12 for 15 from the floor.\n\n\r\n              Philadelphia climbed back into the game in the fourth, taking its first lead on a Harris turnaround jumper shortly after he returned after he was staggered and removed when Kendall Brown fell on his head and neck area. Harris returned after being cleared by concussion protocol..\n\n\r\n              But after a back-and-forth stretch, Indiana went on an 11-2 run that gave it the separation it needed and a lead it never relinquished.\n\n\r\n              “We just got to clean up finishing up games,\" Embiid said. “We've been doing a good job, but tonight we had a few traveling calls and were a little disorganized at times. We're just not getting ourselves open, so we have to do a better job.”\n\n\r\n              Pacers forward Jalen Smith left the game with a head injury, and the team said he was being transported to a hospital for evaluation and additional testing. Smith was knocked down in a collision at the defensive end of the floor midway through the second quarter as Sixers forward Paul Reed went up for a dunk. The team had no update on Smith's condition after the game.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Off until Sunday when they host the Orlando Magic.\n\n\r\n              76ers: Host the Boston Celtics on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996211.060298
}