{
  "game_id": "0022400699",
  "espn_id": "401705265",
  "date": "Feb 02, 2025",
  "matchup": "MEM @ MIL",
  "headline": "Jackson scores 37 points as Grizzlies beat Bucks 132-119 without Morant",
  "body": "MILWAUKEE -- — Jaren Jackson Jr. scored 37 points and the Memphis Grizzlies continued their recent mastery of Milwaukee with a 132-119 victory over the Bucks on Sunday night.\n\n\r\n              Memphis has won its last seven meetings with the Bucks, who last beat the Grizzlies 126-114 in Milwaukee on Jan. 19, 2022. The Grizzlies won this one without star guard Ja Morant, who missed a second straight game due to a sore right shoulder.\n\n\r\n              Jackson briefly went to the locker room late in the first quarter after taking an inadvertent elbow to the face from Ryan Rollins on the Bucks guard’s drive attempt. Jackson returned at the start of the second period and shot 7 of 13 from 3-point range.\n\n\r\n              Milwaukee lost for the fourth time in five games despite getting 30 points, 11 rebounds and seven assists from Giannis Antetokounmpo. Khris Middleton added 20 points.\n\n\r\n              Santi Aldama scored 23 points and Desmond Bane added 22 for the Grizzlies, who have won eight of nine. Zach Edey had 14 points and 11 rebounds. Scotty Pippen Jr. had 9 points, 10 assists and five rebounds.\n\n\r\n              Takeaways\r\n              Grizzlies: Memphis trailed throughout the third quarter, but outworked the Bucks in the final period and got big contributions off the bench from Aldama and Pippen.\n\n\r\n              Bucks: Defense continues to be a problem. Milwaukee has allowed at least 125 points in each of its last four losses.\n\n\r\n              Key moment\r\n              Jackson made a pair of 3-pointers to cap a 10-0 run that put Memphis ahead 108-103 and gave the Grizzlies their first second-half lead early in the fourth quarter. Milwaukee tied it at 112 on a 3-pointer by Antetokounmpo, but Aldama scored to put Memphis back ahead for good with 6:14 left.\n\n\r\n              Key stat\r\n              Memphis outrebounded Milwaukee 61-36 and outscored the Bucks 66-36 in the paint.\n\n\r\n              Up next\r\n              Both teams also have games Monday. The Bucks go back on the road to visit the Western Conference-leading Oklahoma City Thunder, while the Grizzlies host the San Antonio Spurs.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997729.0857081
}