{
  "game_id": "401810104",
  "espn_id": "401810104",
  "date": "Nov 18, 2025",
  "matchup": "ORL vs GS",
  "headline": "Magic turn back Warriors 121-113",
  "body": "ORLANDO, Fla. -- — Desmond Bane had 23 points and five steals, Anthony Black came off the bench to score 21 points, and the Orlando Magic beat the Golden State Warriors 121-113 on Tuesday night.\n\n\r\n              Six Orlando players scored at least 13 points, offsetting 34 points and nine assists from Golden State's Stephen Curry and 33 points from Jimmy Butler.\n\n\r\n              Franz Wager had 18 points and eight rebounds and Wendell Carter Jr. had 17 points and 12 rebounds for Orlando, which has won four of its last five games. Tristan da Silva had 15 points and Jalen Suggs finished with 13 points and eight assists.\n\n\r\n              Orlando shot 50.6% overall but made only 8 of 32 3-point shots. After making five of their first six 3-pointers, the Warriors made only 8 of their next 30. Curry, who scored 56 points in Orlando in February and put up 49 and 46 points in games last week, shot 12 for 23 overall and made 7 of 15 3-pointers.\n\n\r\n              The Magic led by 15 in the middle of the second quarter before Curry closed the half with three 3-pointers and two free throws in the final four minutes to pull Golden State within 67-60 at halftime.\n\n\r\n              But after bursting down the lane for a layup late in he third quarter that left the Warriors down by 10, Curry went almost 12 minutes without a point. The Magic led 115-101 when Curry nailed a 3-pointer with 3:44 left.\n\n\r\n              Warriors forward Jonathan Kuminga missed a third straight game with a knee injury and Magic forward Paolo Banchero missed his third straight game with a groin strain.\n\n\r\n              Up next\r\n              Warriors: Play at Miami on Wednesday night.\n\n\r\n              Magic: Play at home against LA Clippers on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042647.842356
}