{
  "game_id": "0022300447",
  "espn_id": "401585075",
  "date": "Dec 31, 2023",
  "matchup": "BKN @ OKC",
  "headline": "Gilgeous-Alexander scores 24, Thunder beat Nets 124-108, extend winning streak to 4 games",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had 24 points and six assists and the Oklahoma City Thunder won their fourth straight game, beating the Brooklyn Nets 124-108 on Sunday night.\n\n\r\n              Josh Giddey had 20 points, six rebounds and five assists, and rookie Chet Holmgren added 18 points, 10 rebounds and two blocked shots for Oklahoma City, which improved to 22-9, good for second place in the Western Conference.\n\n\r\n              “We’ve gotten a lot better,” Gilgeous-Alexander said. “We’ve put in a lot of work. I expect us to get better. I’m not surprised. We’ve got to keep going and keep getting better.”\n\n\r\n              The Thunder have hosted a New Year’s Eve game every year since the franchise moved to town and have a 12-4 record in those games. Brooklyn is 2-8 all-time on New Year’s Eve.\n\n\r\n              Holmgren and Jalen Williams, who scored 17 points, scored all the Thunder’s points in a 16-8 run that extended Oklahoma City’s lead from seven points to 102-87 with 8:49 left. Brooklyn got no closer than 12 points the rest of the way and Oklahoma City eventually led by as many as 21 points.\n\n\r\n              “I think we picked up our energy,” Holmgren said. “Early in the game, they were making shots from the outside. Some of that was them coming out ready to play and some of that was us just being a little late on rotations and close-outs. Once we picked that up, we really made shots tough on them and we started to get some stops.”\n\n\r\n              Mikal Bridges had 22 points – 15 in the first quarter – to go with seven rebounds and seven assists for Brooklyn, which has lost three straight games. Cam Thomas had 20 points and Nic Claxton had 15 points, 16 rebounds and five assists. The Nets, who have lost four straight games against Oklahoma City, are 1-16 this season when allowing an opponent 120 or more points.\n\n\r\n              Oklahoma City shot 54.2% from the field (45 of 83), while Brooklyn shot just 38% (38 of 100). The Nets made 12 of 46 3-point attempts, for 26.1%, which offset the fact they committed only six turnovers.\n\n\r\n              “You look at the stat sheet and we did some really good things tonight,” Brooklyn coach Jacque Vaughn said. “They had 20 corner (3-point attempts) and made two of them. We missed some free throws. We shoot 40 3s, pretty good. We shared the basketball and didn’t turn it over. How many more shots did we have? Seventeen more shots. Pretty good recipe for us.\n\n\r\n              “A lot of our shots were open tonight. We sprayed that thing around and we were really unselfish and getting each other good shots tonight. … It was just one of those nights the ball didn’t go in for you.”\n\n\r\n              Brooklyn made its first five shots (three of them 3-pointers) and built a 10-point first-quarter lead at 18-8, but the Thunder shot 54.6% in the half and eventually led 59-56 at halftime.\n\n\r\n              The Nets were within 67-65 before Giddey fueled an 11-2 spurt by Oklahoma City, making two baskets before feeding Gilgeous-Alexander on a fast-break layup that made it 78-67 with 5:37 left in the third quarter. That caused Vaughn to call his second timeout in a 99-second span.\n\n\r\n              A 3-pointer by Holmgren in the final seconds of the quarter put Oklahoma City ahead 89-79 and started the Thunder’s game-clinching run.\n\n\r\n              “Tonight it was a variance night,” Oklahoma City coach Mark Daigneault said. “There’s nights when the other team makes shots and you don’t, and tonight was the night we made shots and they didn’t. They shot a lot of 3s. I thought we contested a lot of them. I thought we did made them uncomfortable. … But it’s hard to explain that boxscore other than shooting variance on this night.”\n\n\r\n              UP NEXT:\n\n\r\n              Nets: Visit the New Orleans Pelicans on Tuesday.\n\n\r\n              Thunder: Host the Boston Celtics on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996353.6115289
}