{
  "game_id": "0021800359",
  "espn_id": "401071040",
  "date": "Dec 05, 2018",
  "matchup": "PHI @ TOR",
  "headline": "Leonard scores 36 points as Raptors beat 76ers 113-102",
  "body": "TORONTO --  Kawhi Leonard insisted he doesn't try to do anything extra in big games. His numbers suggest otherwise.\n\nLeonard had 36 points, Jonas Valanciunas scored 18 of his season-high 26 in the fourth quarter and the Toronto Raptors beat Philadelphia 113-102 on Wednesday night, handing the 76ers their 13th consecutive loss in Canada.\n\nSerge Ibaka added 18 points as the Raptors bounced back from Monday's loss to Denver to win for the ninth time in 10 games. Toronto, with the best record in the NBA at 21-5, improved to 11-3 at home.\n\nLeonard shot 13 for 24, finishing one point shy of his season high, and set a season best by making five of six attempts from 3-point territory. The rest of the Raptors struggled from long range, combining to shoot 3 for 23.\n\nLeonard's season high of 37 points came last Thursday in an overtime victory against two-time defending champion Golden State. Leonard has led Toronto in scoring in four straight games.\n\n\"He's an immense talent, he really is,\" coach Nick Nurse said. \"And when the stakes go up a little bit, he's going to play his hand a little harder.\"\n\nLeonard, who set a season best with five steals, said he doesn't let the opponent or circumstances dictate his effort.\n\n\"I try to perform every night,\" he explained. \"If you try to turn it on against the good teams, it's really hard to do that. You've got to do it on a nightly basis.\"\n\nLeonard has never lost in 12 career meetings with the 76ers, including two victories this season.\n\n\"That's what you're going to get out of big-time players,\" Philadelphia's Jimmy Butler said. \"He had a great game.\"\n\nButler scored a season-high 38 points and added 10 rebounds. Joel Embiid had 10 points and 12 rebounds for Philadelphia, whose last win in Toronto was 93-83 on Nov. 10, 2012.\n\n\"Jimmy showed why he's an All-Star,\" 76ers coach Brett Brown said. \"He came in and gave us some tremendous things.\"\n\nThe day before, Brown suggested the game would be a \"barometer\" for the 76ers. Afterward, he said his team's 21 turnovers and 22 second-chance points allowed underscored the gap between the Sixers and Raptors.\n\n\"We leave disappointed,\" Brown said. \"We also leave, we feel, a little bit smarter about what it's going to take to beat the best team right now in the NBA.\"\n\nToronto's 17 offensive rebounds were a season high.\n\n\"We gave ourselves a chance to win with our effort but the execution just wasn't there,\" 76ers guard JJ Redick said.\n\nRedick scored 25 points and Ben Simmons had eight points, 11 assists and 10 rebounds for the 76ers, who had their four-game winning streak snapped.\n\nThe Raptors held a 78-77 lead after three quarters, and Philadelphia's T.J. McConnell tied it 81-all with a hook shot at 11:07. Valanciunas scored a pair of baskets as Toronto's reserves replied with a 9-0 run, opening a 90-81 advantage at 9:07.\n\n\"Our bench did an unbelievable job,\" Toronto guard Kyle Lowry said. \"Tonight was one of those games where they just had it clicking.\"\n\nTIP-INS\n\n76ers: Embiid's double-double was his league-best 24th. ... The 76ers committed 11 turnovers in the second quarter. Toronto scored 27 points off Philadelphia's 21 total turnovers. ... Butler was called for a technical foul in the third quarter and Embiid got one in the fourth.\n\nRaptors: Lowry shot 0 for 5 in the first half and missed his first six attempts from 3-point range. ... Leonard led Toronto with nine rebounds. ... The Raptors outscored the 76ers 62-42 in the paint and 41-18 off the bench. ... Toronto has won 20 of the past 22 meetings with Philadelphia. ... G Malachi Richardson (illness) was inactive.\n\n500 CLUB\n\nLeonard has 522 points in his first 20 games with Toronto, more than any other player in franchise history. He's the fourth active player to score 500 or more in his first 20 games with his current team. The others are Kevin Durant (Golden State), James Harden (Houston) and LeBron James (Los Angeles Lakers).\n\nCAN'T HANDLE IT\n\nSimmons had seven turnovers, giving him 18 in two games against Toronto this season.\n\nSTAR-STUDDED\n\nThe game drew several celebrities who attended Tuesday's gala for Giants of Africa, the charity of Raptors president Masai Ujiri. That group included former Raptors All-Star Chris Bosh, former Blue Jays slugger Joe Carter, soccer player Didier Drogba, and comedian Chris Tucker.\n\nUP NEXT\n\n76ers: Visit Detroit on Friday night.\n\nRaptors: Visit Brooklyn on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994053.384809
}