{
  "game_id": "0022300978",
  "espn_id": "401585606",
  "date": "Mar 17, 2024",
  "matchup": "DEN @ DAL",
  "headline": "Kyrie Irving's running left-hander at the buzzer lifts Mavs over Nuggets 107-105",
  "body": "DALLAS -- — A floater, a runner, a hook shot, call it whatever.\n\n\r\n              Maybe Kyrie Irving would settle for crucial game-winner.\n\n\r\n              The Dallas star hit a running left-handed shot at the buzzer, capping a wild final 26 seconds and giving the Mavericks a 107-105 victory over the Denver Nuggets on Sunday.\n\n\r\n              Luka Doncic scored 37 points and Irving had 24 as the up-and-down Mavericks (39-29) beat the defending champs for their fifth win in six games, answering a 1-5 stretch that followed a seven-game winning streak, Dallas' longest of the season.\n\n\r\n              The Mavs pulled even with Phoenix as part of a virtual three-way tie with Sacramento for the sixth and final guaranteed playoff spot in the Western Conference.\n\n\r\n              “In Kyrie we trust,” said rookie center Dereck Lively II, who had 14 points. “Whenever we see him get the ball, sit back and watch it happen.”\n\n\r\n              The Nuggets rallied from 13 points down midway through the fourth quarter and went ahead on Jamal Murray's tiebreaking 3-pointer with 26 seconds remaining.\n\n\r\n              Doncic answered almost immediately on the inbounds pass after a timeout, hitting from several feet behind the arc for a 105-105 tie.\n\n\r\n              After Murray missed an elbow jumper, Dallas called timeout with 2.8 seconds to go. The right-handed Irving took the inbounds pass, dribbled with his left hand as Nikola Jokic pursued and had to throw up the shot from 21 feet to beat the buzzer.\n\n\r\n              “Sometimes I spend just an hour straight just working on straight left-hand stuff,” the 6-foot-2 Irving said. “Just being a small guard, you've just got to have a multitude of finishes. And that's something I've been working on since I was a kid.”\n\n\r\n              After the shot went in, Irving ran toward his teammates coming off the bench and was mobbed near midcourt as Jokic and company walked by quietly on the way to the Denver locker room.\n\n\r\n              “I wasn’t going to jump into the pile,” Dallas coach Jason Kidd said. “Thought about it. But knowing my luck, I would have missed and hit the floor. I thought I’d just stand there and celebrate with those guys. A lot of fun. It should be fun.”\n\n\r\n              The Nuggets had a five-game road winning streak stopped. They had won all five by double digits, a first in franchise history. Denver is the only team this season with two road streaks of at least five victories.\n\n\r\n              Denver (47-21) dropped a half-game behind Oklahoma City for the West's best record while falling to 11-2 since the All-Star break. The other loss came in overtime after Phoenix's Kevin Durant hit a tying 3 with 26 seconds to go in regulation.\n\n\r\n              “I saw Kyrie Irving make a running, left-handed hook from the elbow,” Nuggets coach Michael Malone said when asked what he saw on the final sequence. “We’ve been on both sides of it.” \n\n\r\n              Murray scored 23 points, while the Mavs frustrated Jokic into a 6-of-16 shooting day. Jokic had 16 points and 11 rebounds, and he was agitated over no-calls while the Mavs made plenty of contact in the first half. \n\n\r\n              So was Malone, who eventually called timeout and walked across the court to complain and was given a technical. He almost got a second just before guard Reggie Jackson was called for one as well. \n\n\r\n              Irving and Doncic tag-teamed for consecutive 3s to give Dallas a nine-point lead with eight minutes remaining, and the margin reached 13 before the Nuggets started clawing back.\n\n\r\n              Michael Porter Jr., who had 12 of his 20 points in the first quarter, started the rally with a 3-pointer. Jokic pulled the Nuggets even at 102-102 with a bucket inside with 1:05 to go.\n\n\r\n              P.J. Washington Jr. had 11 rebounds, his most for Dallas since coming over in a trade with Charlotte last month. The Mavs outrebounded Denver 59-37. Dallas had a season-high 21 offensive boards and a 23-6 edge in second-chance points.\n\n\r\n              “I can’t remember the last time we got outrebounded by 22,” Malone said.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At Minnesota on Tuesday.\n\n\r\n              Mavericks: At San Antonio on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996750.523371
}