{
  "game_id": "0021800712",
  "espn_id": "401071385",
  "date": "Jan 23, 2019",
  "matchup": "ATL @ CHI",
  "headline": "Collins scores 35 as Hawks beat Bulls 121-101",
  "body": "CHICAGO --  John Collins was on the move for the Atlanta Hawks, all night long. He cut along the baseline for layups and dunks. He stepped out for 3-pointers.\n\nThe Chicago Bulls just kept losing track of him.\n\nCollins scored a career-high 35 points, Trae Young had 12 assists and the Hawks beat the Bulls 121-101 on Wednesday.\n\n\"It's a big part of my game, moving without the basketball,\" Collins said. \"And like I said, I have unselfish guys on my team that are able to find me.\"\n\nCollins was 14 for 16 from the field as Atlanta kicked off a season-high, seven-game trip with its first victory against Chicago in two years, stopping a five-game slide against the Bulls. Jeremy Lin, Young's backup, had 15 points, and Dewayne Dedmon finished with 14.\n\nThe Hawks had a full practice on Tuesday for the first time in a while, and coach Lloyd Pierce felt like it helped.\n\n\"To carry that over to the game, I thought there was no surprise,\" he said. \"But very good performance for our guys tonight.\"\n\nChicago lost for the 11th time in its last 12 games. Zach LaVine scored 23 points, and Lauri Markkanen had 22 in the opener of a three-game homestand.\n\n\"We have to contest shots better,\" Markkanen said. \"We can score the ball, but we need to get some stops.\"\n\nThe Bulls trimmed a 20-point deficit all the way down to six when Markkanen made a 3-pointer at the halftime buzzer. But the Hawks pulled away with an 11-2 run at the end of the third quarter.\n\nLin had seven points in the spurt, including a 3-pointer that lifted Atlanta to a 98-83 lead heading into the final period. Young, who finished with five points on 1-for-12 shooting, also made a 3 with 1:14 left.\n\nChicago never made a serious charge in the fourth, and what was left of the crowd chanted \"We want Vince! We want Vince!\" in the final minutes in an effort to persuade Pierce to put Vince Carter in the game.\n\nThe Hawks encouraged the fans by pointing and motioning toward Carter, who turns 42 on Saturday. But the veteran guard stayed on the bench.\n\n\"I walked down with about 7 minutes to go and I said, `Yes or no?' and it was the loudest no I heard all night,\" Pierce said, \"so I walked away. Yeah, you're not going to question Vince Carter on a move like that.\"\n\nTaurean Prince also had 15 points for Atlanta, which had dropped three of four. Alex Len finished with 14 points and 10 rebounds.\n\nNO MELO\n\nThere was no sign of Carmelo Anthony, save for his name on Chicago's inactive list. The Bulls acquired the forward in a trade with Houston on Tuesday, but are planning to trade the 10-time All-Star before the Feb. 7 deadline or ultimately waive him and make him a free agent.\n\nAsked if his team might benefit from having Anthony around even for a short time, coach Jim Boylen said: \"We have not had those conversations and from what I understand is that's not the direction we're going to go.\"\n\nBOOM\n\nAtlanta's 42-point first quarter included a terrific one-handed slam by Justin Anderson over Chicago's Bobby Portis, prompting Young and the Hawks on the bench to jump out of their seats.\n\nTIP-INS\n\nHawks: Rookie G Kevin Huerter missed his second straight game with a sore neck. \"He just needs a little more time,\" Pierce said. \"The neck was still sore. No panic, no rush and nothing to be concerned about.\"\n\nBulls: Bulls F Jabari Parker was sidelined by a right patellar tendon strain. Boylen said he was told it happened during warmups. \"It's surprising to all of us and disappointing for him,\" Boylen said. \"We'll see how that shakes out. Hopefully, it's something that passes quickly.\" ... Kris Dunn had 16 points, and reserve Wayne Selden finished with 11.\n\nUP NEXT\n\nHawks: Visit the Portland Trail Blazers on Saturday night.\n\nBulls: Host the Los Angeles Clippers on Friday night. They have dropped five in a row against LA.\n\n---\n\nJay Cohen can be reached at https://twitter.com/jcohenap\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995358.627201
}