{"game_id": "260122008", "title": "Synthetic Recap", "body": "AP SPORTS\n\nDETROIT (2006) – The final score will read Detroit 99, Houston 97, but the history books will tell a different story. They will tell the tale of Tracy McGrady.\n\nIn a breathtaking, virtuoso performance that defied belief and ultimately broke the Houston Rockets, McGrady authored one of the most spectacular individual chapters in NBA history, pouring in 43 points. Yet, in a cruel twist of basketball fate, his heroic effort was rendered a heartbreaking footnote by a relentless Detroit Pistons squad that simply refused to lose on its home floor.\n\nMcGrady was unstoppable. He sliced through the Pistons’ vaunted defense, a unit renowned for suffocating greatness, and treated it like a mere inconvenience. Every pull-up jumper, every acrobatic drive to the rim, was a brushstroke on his masterpiece. He carried the Rockets on his back, and with the game hanging in the balance, it seemed his singular brilliance would be enough to steal a victory on the road.\n\nBut the defending Eastern Conference champions, true to their identity, weathered the storm. While McGrady’s 43 points were a firestorm, the Pistons’ victory was a product of their collective will. They countered with balanced scoring and immaculate execution down the stretch, chipping away at the lead McGrady had built almost single-handedly.\n\nIn the final, frantic seconds, with the score tied, it was a Detroit stop—not a McGrady basket—that decided the game. The Pistons secured the defensive rebound and drew a foul, calmly sinking two free throws to snatch the win as the clock expired.\n\nThe Pistons celebrated a hard-fought team victory, but the stunned silence of the arena was a tribute to the man they could not stop. On this night, Tracy McGrady was immortal, scoring 43 points in a legendary performance that, on any other night, would have been more than enough for victory. But against the Pistons, even history sometimes needs a helping hand, and it simply wasn't meant to be.", "source": "AI_Reconstruction"}