{
  "game_id": "0022401224",
  "espn_id": "401736818",
  "date": "Dec 16, 2024",
  "matchup": "BKN vs. CLE",
  "headline": "Evan Mobley scores 21 to lead the Cavaliers over the Nets 130-101",
  "body": "NEW YORK -- — Evan Mobley scored 21 points, Caris LeVert added 19 and the Cleveland Cavaliers rolled to a 130-101 win over the Brooklyn Nets on Monday night.\n\n\r\n              Donovan Mitchell had 18 points and five assists, and Georges Niang had 17 points and nine rebounds for Cleveland (23-4), which won its second straight and for the sixth time in seven games.\n\n\r\n              Cameron Johnson led Brooklyn with 22 points and five assists, and Day’Ron Sharpe had 15 points and seven rebounds. The Nets (10-16) lost their third straight and fell for the sixth time in seven games.\n\n\r\n              Kenny Atkinson returned as a head coach to Brooklyn with the Cavaliers. The 57-year-old led the Nets for four seasons.\n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland, which entered play ranking first in the NBA in field-goal percentage (50.3) and 3-point field-goal percentage (39.9), shot 53.1% from the field. They had 33 assists on 43 made baskets.\n\n\r\n              Nets: Playing their first game since point guard Dennis Schroder was traded to Golden State, the Nets shot just 42% from the field and scored a season-low 40 first-half points. Brooklyn scored nearly as many points in the third quarter (37) as it did in the first 24 minutes.\n\n\r\n              Key moment\r\n              Brooklyn scored the game’s first seven points, but the Cavaliers closed the first quarter with a 32-5 run and led by 20.\n\n\r\n              Key stat\r\n              The Cavaliers have scored at least 130 points in seven games, which already is a single-season franchise record.\n\n\r\n              Up next\r\n              The Cavaliers host Milwaukee on Friday. The Nets play Thursday at Toronto.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997994.626195
}