{
  "game_id": "0021801058",
  "espn_id": "401071731",
  "date": "Mar 18, 2019",
  "matchup": "POR vs. IND",
  "headline": "Blazers prevent Pacers from clinching with 106-98 win",
  "body": "PORTLAND, Ore. --  Damian Lillard plans to take a bit more control over games in the absence of backcourt mate CJ McCollum.\n\nLillard had 30 points and 15 assists as the Portland Trail Blazers beat the Indiana Pacers 106-98 on Monday night in their first game since McCollum injured his left knee.\n\n\"I guess being a little more hands-on and managing what's going on out there, just knowing that a guy who averages 22 points isn't on the floor,\" Lillard said of his adjustment. \"It doesn't mean I have to score more points, or dominate the ball, but just making sure that I've got control over what's happening out there a little bit more.\"\n\nJusuf Nurkic added 18 points and 11 rebounds for the Blazers, who led by as many as 21. Portland has won four of five and is holding onto fourth place in the Western Conference.\n\nMyles Turner had a season-high 28 points and 10 rebounds for the Pacers, who missed out on clinching a playoff spot in the East. Indiana (44-27) has lost six straight on the road.\n\nThe Blazers (43-27) have won 10 in a row against the Pacers in Portland.\n\nBojan Bogdanovic's layup pulled the Pacers to 100-91 with just under three minutes left, and Turner made free throws to get Indiana closer. The teams traded free throws down the stretch, but Portland was stung when Nurkic fouled out.\n\nWesley Matthews' layup closed the gap to 102-97, but Al-Farouq Aminu made free throws on the other end and Portland held on.\n\nMcCollum, averaging 21.3 points per game this season, got hurt during Saturday's loss at San Antonio. He has a popliteus strain and will be re-examined in a week, the team said. It isn't known whether he'll be back before the end of the regular season.\n\n\"I don't like to miss games, but I've got to do what's best for myself from a health standpoint, and doctors will sign off when they think I'm ready,\" he said before the game.\n\nLillard said the first reaction was that the Blazers would miss him.\n\n\"But you're just happy that it wasn't a more long-term thing. It could have been a more serious injury,\" he said.\n\nTurner scored 11 points in the opening six minutes and the Pacers led 19-12. They stretched the margin to 11, but Portland got to 31-28 by the end of the first quarter.\n\nLillard closed out the first half with a 3-pointer from nearly the pinwheel logo at center court, and the Blazers went to the locker room with a 55-48 lead. Lillard had 18 points and eight assists in the half. Turner also scored 18 to go with six rebounds.\n\nAfter hitting just three 3-pointers in the first half, the Blazers made eight in the third quarter. Aminu had four of those and scored 14 points in the third quarter alone.\n\n\"We did miss some opportunities,\" Matthews said. \"We're going to continue to fight, no matter what. Up 19, down 19, it doesn't matter, we're going to fight. We've just got to find ways to finish these games out, build on leads instead of losing them a little bit and come away with victories in tough environments.\"\n\nTIP-INS\n\nPacers: Domantas Sabonis received warm applause from the crowd when he entered. His dad, Arvydas, played for the Blazers from 1995-2001 and again during the 2002-03 season. ... Matthews, who played five seasons in Portland and was a fan favorite, was similarly greeted.\n\nTrail Blazers: Portland won the first meeting this season 103-93 in October. It is the second straight year that the Blazers have swept the season series against Indiana. ... It was Lillard's ninth double-double of the season.\n\nKANTER MEETING\n\nOregon Congressman Ron Wyden met with Blazers forward Enes Kanter before the game to discuss Kanter's concerns about retribution from Turkey, his native country, over his criticism of the government there. Turkish President Recep Tayyip Erdoan has issued an international warrant for Kanter's arrest.\n\nKanter did not travel with the Blazers to Toronto while on a road trip earlier this season, fearing reprisal. Wyden has urged Secretary of State Mike Pompeo to make it clear to Turkey that any action against Kanter is unacceptable.\n\n\"Here in Rip City, we push back against bullies. We expose them, we try to make sure the world knows what kind of sleazy tactics they're using. I told Mr. Kanter as Oregon's senior senator and Oregon's guy on the senate Intelligence Committee, that I'm in this fight all the way, because we're a community that values the rights of free speech and free expression, and we don't walk away when a bully comes in and tries to shove around one of our own,\" Wyden said.\n\nUP NEXT\n\nThe Pacers visit the Los Angeles Clippers on Tuesday.\n\nThe Trail Blazers host Dallas on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995161.233187
}