{
  "game_id": "0022300472",
  "espn_id": "401585100",
  "date": "Jan 03, 2024",
  "matchup": "POR @ DAL",
  "headline": "Doncic scores 41 and Irving adds 29 as Mavs blow out Trail Blazers 126-97",
  "body": "DALLAS -- — Luka Doncic scored 30 of his 41 points in the first half, Kyrie Irving added 29 in his second game back from a heel injury and the Dallas Mavericks routed the Portland Trail Blazers 126-97 on Wednesday night.\n\n\r\n              The All-Star pair went a combined 23 of 40 from the field before sitting out the fourth quarter. They were just 12 of 34 during a 37-point loss at Utah in Irving's return after missing 12 games with a bruised right heel.\n\n\r\n              “Great response to what happened in Utah,” Dallas coach Jason Kidd said. “I thought the ball movement was great. Defensively, was really, really good. We were locked in.” \n\n\r\n              Irving tied his season high with nine rebounds and Tim Hardaway Jr. scored 14 points for the Mavericks, who opened a seven-game homestand — their longest of the season — with the first of two in a row against Portland.\n\n\r\n              Shaedon Sharpe scored 16 points and Anfernee Simons had 15 for the Trail Blazers, who fell to 0-2 on the first of two seven-game trips that are their longest of the season. \n\n\r\n              On the verge of being as healthy as they've been all season, the Mavs lost two frontcourt players to ankle injuries during the second half in rookie center Dereck Lively II and forward Grant Williams. \n\n\r\n              Kidd said both were mild sprains, and the team would know more about their outlook Thursday.\n\n\r\n              Lively re-sprained his left ankle. The first injury sidelined him four games last month. \n\n\r\n              Irving and Doncic were 17 of 28 from the field as the Mavs shot 62% in the first half while scoring a season high for a half and taking a 78-47 lead. \n\n\r\n              Doncic, who had his NBA-leading seventh game with at least 40 points, made 10 of 12 free throws in the first half, when Portland committed 20 fouls and 14 turnovers. Dallas had 21 first-half points off turnovers.\n\n\r\n              “This team’s hard enough to guard in the halfcourt, period,” Portland coach Chauncey Billups said. “And then you give them the easy ones in transition. That compounds things and just makes it tough.”\n\n\r\n              Two nights after not much of anything went in for either Dallas superstar, Irving banked one in when he was trying to throw an alley-oop pass over his shoulder to Lively.\n\n\r\n              Portland rookie Duop Reath, who missed the previous three games with a back injury, was ejected for a flagrant-2 foul in the second quarter. Reath caught Josh Green with an elbow to the face when trying to make a move on a shot attempt in the lane.\n\n\r\n              Simons was back from a three-game absence, and rookie Toumani Camara returned after missing a game with right knee soreness. But Camara and Ibou Badji fouled out as the Blazers finished with 34 fouls.\n\n\r\n              UP NEXT\n\n\r\n              Dallas' homestand starts with consecutive games against Portland — the rematch is Friday — and ends with two in a row against New Orleans on Jan. 13 and 15. The Mavs and Pelicans split when they played a pair in New Orleans on Nov. 12 and 14.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996583.544105
}