{
  "game_id": "0021500075",
  "espn_id": "400827962",
  "date": "Nov 06, 2015",
  "matchup": "TOR @ ORL",
  "headline": "Harris scores 20, Magic give Raptors 1st loss 92-87",
  "body": "ORLANDO, Fla. --  With several early season matchups against playoff-caliber teams, the Orlando Magic have been flirting with posting a signature win.\n\nThey finally got one, at the expense of one of the league's hottest teams.\n\nTobias Harris had 20 points, including what turned out to be the decisive free throw, and the Magic handed the Toronto Raptors their first loss of the season, 92-87 on Friday night.\n\nVictor Oladipo added 18 points, and reserve C.J. Watson had 12 as the Magic snapped an 11-game losing streak to the Raptors.\n\n\"That's what we have to do,\" Magic coach Scott Skiles said. \"When a team might not have their `A' game, and we're doing something to affect their game, we need to take advantage of it.\"\n\nTrailing 88-86 after Harris' free throw, Toronto had a chance to take the lead but Jonas Valanciunas was forced to put up an awkward runner that rolled off the rim, and was rebounded by Orlando.\n\nThe Magic played without starting center Nik Vucevic, who sat with a bone bruise in his right knee.\n\nThe loss ended what had been a franchise-best 5-0 start for Toronto.\n\nDeMar DeRozan led the Raptors with 23 points, while Cory Joseph had 19, and Kyle Lowry added 17.\n\nEntering Friday it had been hard to spot a weakness in the Raptors' play this season.\n\nThey showed plenty on the offensive end against the Magic.\n\nToronto struggled shooting the ball all game, finishing 30 of 86 from the field.\n\nBut they were able to erase what had been a nine-point halftime deficit just 1:36 into the third quarter.\n\nToronto hit eight of their first 10 shots during a 19-4 run to start the third, taking a 55-49 lead on a three-point play by Lowry.\n\nThe Magic started the quarter 2 for 6 from the field with three turnovers, prompting Skiles to pull all five starters.\n\nThe move worked, with the reserves keeping Orlando within striking distance heading into the fourth quarter.\n\nTIP-INS: The Raptors had 18 second-chance points. ... Toronto was 5 for 23 from 3-point range. ... Orlando's Dewayne Dedmon had three blocks. ...The Magic had three defensive 3-seconds calls against them in the first half.\n\nPAYTON'S STRUGGLES: Magic starting point guard Elfrid Payton struggled for the fourth straight game, this time going scoreless with two assists and two turnovers. Skiles said the adjustment that the second-year guard needs to make is internal. \"He's got to get himself over it,\" Skiles said. \"At some point it's the player's responsibility to get himself going. He's got a lot to learn at that position, like all younger players do, and right now he's got to dust himself off, pick himself up and come back and have a good game (Saturday).\"\n\nSHOT CHART: Entering Friday, three Raptors -- DeRozan, Lowry and DeMarre Carroll -- had taken 50 percent of team's field goal attempts. Coach Dwane Casey said that is not just by happenstance. \"We're not a democracy,\" he said. \"We have some guys that have some freedom and some leeway as far as shot selection, but it's not a democracy as far as guys shooting the ball.\"\n\nSTAR WATCH: Former NBA all-star Tracy McGrady sat courtside. He played for the Magic from 2000 to 2004.\n\nUP NEXT\n\nRaptors: Conclude four-game trip at Miami on Sunday.\n\nMagic: Visit Philadelphia on Saturday.\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764994772.896808
}