{
  "game_id": "0021800566",
  "espn_id": "401071242",
  "date": "Jan 04, 2019",
  "matchup": "DAL @ BOS",
  "headline": "Hayward has 16 points, 11 rebounds, Celtics beat Mavs 114-93",
  "body": "BOSTON --  Gordon Hayward followed up his top scoring game of the season with his best overall performance since coming to the Boston Celtics.\n\nGordon Hayward had 16 points, 11 rebounds and eight assists for the short-handed Celtics in a 114-93 victory over the Dallas Mavericks on Friday night.\n\n\"It was fun,\" said Hayward, who was coming off a season-high 35 points Wednesday night in a victory over Minnesota. \"I think when we have good spacing, we have talented players and it just makes the game easier. If you make the right read, everybody gets involved and it's fun.\"\n\nJaylen Brown scored 21 points, Jayson Tatum added 18 points, and Al Horford had 10 points, eight rebounds and eight assists.\n\nThe Celtics won easily despite playing their second straight game with star guard Kyrie Irving sidelined by scratched corneas. Without Irving, the Celtics moved the ball around and had 35 assists on 42 field goals.\n\nHayward and Horford had eight apiece and Terry Rozier, who started for Irving, added seven assists for the Celtics.\n\n\"We've really tried to emphasize that all year,\" coach Brad Stevens said. \"For the most part everybody was in a good rhythm and playing well together and seeking out the right shot. We've just got to keep doing that as much as possible.\"\n\nLuka Doncic had 19 points and nine assists for Dallas. Harrison Barnes scored 20 points, and DeAndre Jordan had 12 points and 15 rebounds.\n\nFOND FAREWELL?\n\nDirk Nowitzki, who received two standing ovations, was scoreless and had two rebounds for Dallas. Celtics fans chanted \"Dirk! Dirk!\" in the final minute, hoping he would make a shot in what might have been his final appearance in Boston.\n\n\"It's sweet when not only your home fans, but fans on the road appreciate what you've done for the last two decades,\" Nowitzki said after going 0 for 10. \"I appreciate the fans of Boston. Unfortunately, I'm really disappointed I couldn't even make one. I had some great looks.\"\n\nNowitzki said he hasn't made up his mind about a 22nd season, but was grateful to Boston's fans for the sendoff they gave him if Friday was it.\n\n\"They're great sports fans. It's a great sports town. They know the game and they appreciate the game,\" Nowitzki said.\n\nDOUBLE TIME\n\nHayward was flirting with his first career triple-double before going to the bench midway through the fourth quarter with Boston up by 22.\n\nHayward said he's never had a triple-double, but has thought about it.\n\n\"I'm big enough to see over the defense and make skip passes and those type of things. It's something I've been working on,\" Hayward said. \"It's a little bit of a different role. I've always enjoyed making plays for others more than for myself. I like getting assists.\"\n\nHayward, who missed all but a few minutes of last season after breaking his leg in the season opener, started the week with his only scoreless game of the season.\n\n\"It's good to see him getting back to his movement and looking like his old self, and being more consistent,\" Dallas coach Rick Carlisle said.\n\nROAD WOES\n\nDallas, which ended a nine-game road losing skid Wednesday with a victory at Charlotte, fell to 3-14 on the road.\n\nThe Mavs committed six of their 14 turnovers in the first quarter and never recovered.\n\n\"The early turnovers were a big problem. It got us behind the eight-ball early,\" Carlisle said. \"Then you're  playing from behind all night. They took advantage of it.\"\n\nThe Mavericks trimmed an 18-point first-half deficit to a point early in the third quarter, but could get no closer.\n\nThe Mavericks had a 13-0 run late in the second quarter, to pulling to 53-46 on Matthews' 3-pointer with 2:13 left. Jordan followed with a layup to cut it to 53-48 before Tatum hit a 3-pointer for Boston with 39 seconds left, ending a 4:01 scoring drought. Boston hadn't scored since Smart's 3-pointer with 4:40 left put Boston up 53-36.\n\nTIP-INS\n\nMavericks: Nowitzki received a standing ovation when he was introduced and entered the game with 1:07 left in the first quarter. Boston fans stood and cheered again in the final minute for Nowitzki, playing in his 21st season, who put his hands to his head after his final attempt bounced off the rim at the buzzer.\n\nCeltics: Tatum, a last-minute starter at forward with Marcus Morris out because of a stiff neck, scored 10 points in the first quarter. ... Daniel Theis had 13 rebounds. ... Rookie Brad Wanamaker scored a career-high eight points, three better than his previous high. ... Irving was on the bench, still recovering after scratching both corneas in a collision Monday at San Antonio. Irving also sat out Wednesday against Minnesota.\n\nUP NEXT\n\nMavericks: At Philadelphia on Saturday night to end a four-game trip.\n\nCeltics: Host Brooklyn on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995457.693125
}