{
  "game_id": "0021900097",
  "espn_id": "401160739",
  "date": "Nov 05, 2019",
  "matchup": "IND @ CHA",
  "headline": "Graham, Biyombo lift Hornets past Pacers 122-120 in OT",
  "body": "CHARLOTTE, N.C. --  Bismack Biyombo spent the better part of three quarters stretching and waiting on the Charlotte Hornets bench.\n\nThe reserve center had a feeling his time was coming.\n\n\"I always say, `You gotta stay ready so you don't have to get ready,\" Biyombo said. \"You could tell by the momentum of the game that we were going to need some energy from somebody.\"\n\nDevonte Graham scored a career-high 35 points, Biyombo provided a huge spark off the bench late and the Hornets battled back from a 14-point, fourth-quarter deficit to beat the Indiana Pacers 122-120 in overtime Tuesday night.\n\nGraham sank 2 of 3 free-throw attempts with 1.7 seconds left in overtime after drawing a foul on JaKarr Sampson, helping the Hornets win their third straight game.\n\nBut it was Biyombo who changed the momentum when he entered to start the fourth quarter with the Hornets trailing 92-78.\n\nHe made an immediate impact, scoring down low to start the quarter before coming up with a block against T.J. McConnell that led to a three-point play by Terry Rozier on a fast break. Biyombo then stole the ball at midcourt and went in for a one-handed dunk. He added several put-backs along the way, giving Charlotte a presence it badly needed on the glass.\n\nBiyombo finished with 15 points on 6 of 7 shooting, six rebounds and two blocks in 17 minutes.\n\n\"I thought Biz turned the game, just his energy, his defense ... he was all over the place,\" Hornets coach James Borrego said.\n\nGraham added to a spectacular start to his second NBA season.\n\nWhen he wasn't getting steady updates from teammates on the Duke-Kansas college basketball season opener, he was making plays all over the court. He shot 11 of 20 and had four more 3-pointers, along with six assists, four rebounds and three steals.\n\nGraham struggled shooting from the outside on the team's four-game road trip but fixed that Tuesday night.\n\n\"Let me tell you, I stayed in the gym last night,\" Graham said. \"I came in early this morning, I was in the gym. I worked out more than usual.\"\n\nBorrego called him a winner.\n\n\"To continue to play this way, to be poised and unfazed, he's grown right before our eyes,\" Borrego said. \"I trust him, believe in him and I think that's apparent. I think our guys do also. He's a special player.\"\n\nTerry Rozier added 22 points and Miles Bridges had 18 for the Hornets (4-3).\n\nT.J. Warren scored 33 points on 15-of-18 shooting and Malcolm Brogdon added 31 points for the Pacers (3-4). But it was enough, as Indiana had its three-game winning streak snapped.\n\nSeveral Pacers mentioned the discrepancy in the foul count.\n\n\"They were the aggressors, they were marching to the free-throw line,\" Pacers coach Nate McMillan said. \"They shot 42 free throws tonight and we only shot seven free throws. Offensively we had some opportunities and we didn't make plays. It comes down to making plays and getting stops and they did tonight.\"\n\nTIP INS\n\nPacers: Jeremy Lamb had 18 points in his return to Charlotte. ... Goga Bitadze and TJ Leaf both fouled out. ... Myles Turner (sprained ankle) and Domantas Sabonis (strained calf) continued to be held out while rehabbing injuries.\n\nHornets: Rookie P.J. Washington suffered a lower left leg contusion, Borrego said. He continued his impressive season scoring 16 points, including a driving left-handed dunk over Sampson that brought the crowd to its feet. ... Graham, Biyombo and Rozier combined to score 40 of the team's last 42 points.\n\nTHE NO-CALL\n\nMcMillan didn't agree that Graham was fouled by Sampson with 1.7 seconds left in overtime.\n\n\"Devonte was driving a lot tonight and initiating the contact, I didn't feel that was a foul at all,\" McMillan said. \"He got two calls tonight that our guys had their hands up. He is initiating the contact and he got the free throws on that. We did get a lot of fouls this game, but I did not think that was a foul.\"\n\nTHE SAME FIVE\n\nThe Hornets played the entire fourth quarter and overtime with the same five players -- Graham, Biyombo, Rozier, Bridges and Cody Martin. Martin didn't score in 33-plus minutes but had 11 rebounds and made a major impact on the game with his defense on Brogdon in the fourth quarter and overtime.\n\nOnly Rozier and Bridges are regular starters.\n\nUP NEXT\n\nPacers: Host the Wizards on Wednesday night, Indiana's third game in four nights.\n\nHornets: Kemba Walker makes his return to Charlotte as a member of the Celtics on Thursday night. Walker is the Hornets' all-time leading scorer.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995883.228876
}