{
  "game_id": "0021500587",
  "espn_id": "400828474",
  "date": "Jan 14, 2016",
  "matchup": "CHI @ PHI",
  "headline": "Jimmy Butler scores career-high 53 as Bulls edge 76ers in OT",
  "body": "PHILADELPHIA -- There was no secret formula to Jimmy Butler's career night. He kept taking shots, and they kept going in.\nButler scored a career-high 53 points, and E'Twaun Moore had seven of his 14 in overtime to lead the Chicago Bulls to a 115-111 victory over the Philadelphia 76ers on Thursday.\n\"I was just shooting the ball,\" Butler said. \"I just kept being aggressive, taking the shots the defense was giving me.\"\nButler also had 10 rebounds and six assists, and he made 15 of 30 field goals and 21 of 25 free throws to help the Bulls snap a three-game losing streak. He became the first Chicago player to score 50 points since Jamal Crawford in 2004.\n\n\"That's as good of a performance as I've seen,\" Bulls coach Fred Hoiberg said. \"The guys hopped on his shoulders, and he carried us home. Play after play, it was an unbelievable performance.\"\nRobert Covington scored 25 points, and Ish Smith had 24 for the 76ers, who fell to 4-37.\nBut the Sixers didn't go down easily in this one.\nNerlens Noel's follow put Philadelphia in front 108-104 just more than a minute into overtime. Moore followed with a 3-pointer, a drive and then a 15-footer for a 7-0 run that put Chicago up 111-108 with 2:35 remaining.\nButler's layup made it 113-108 before Smith's 3-pointer cut the lead to 113-111 with 1:05 remaining.\nSmith had a chance to tie it, but his layup with 25.9 seconds left rimmed out, and Doug McDermott clinched the victory with a pair of free throws with 10.4 seconds to play.\n\"E'Twaun making big baskets late, that guy gets a lot of the credit for this win,\" Butler said.\nChicago was without star guard Derrick Rose (knee) and starting center Pau Gasol (rest). Joakim Noah, making just his second start of the season, had six points, 16 rebounds and eight assists in Gasol's place.\nAnd, of course, the Bulls had Butler.\n\"I got some help from my teammates,\" he said. \"Keep giving me the ball, telling me to score, be aggressive, just supporting me on defense. This is a team win.\"\nThe Bulls outrebounded the 76ers 53-34.\nPhiladelphia scored the first eight points of the fourth quarter, capped by one of Covington's four fourth-quarter 3s, to take an 87-77 lead. But the Bulls, behind Butler's array of offensive skills, whittled away at the lead. He finally put Chicago ahead on a layup with 2:24 left in the fourth that made it 98-97.\nAfter Smith's jumper put Philadelphia back in front on the ensuing possession, Butler converted a three-point play after draining a 15-footer to eclipse 50 points.\nSmith then tied it at 101 on a drive before Moore's 3-pointer from the left wing put the Bulls ahead 104-101 with 1:17 left in regulation. Smith responded with a 3 of his own with 17.6 seconds left to tie it at 104.\nThe Bulls had a chance to win in regulation, but Butler lost control of the ball before attempting a shot.\nA HALF TO FORGET\nThe 76ers led by as many as 24 in the opening half, shooting 54.5 percent from the field, and took a 62-46 lead into the break.\n\"Turnovers, hanging heads, no urgency at all on the defensive end,\" Hoiberg said. \"It couldn't have been a worse start for us.\"\nButler said Hoiberg lit into the Bulls at halftime.\n\"He was fired up,\" Butler said. \"I like it, though. He let us know, this is not how we're going to play.\n\"We came out lazy, weren't guarding, turned the ball over, but we picked it up in the second half.\"\nON TRACK\nA day after team president Jerry Colangelo said the 76ers could turn things around \"sooner than people understand,\" they put on one of their best performances of the season.\n\"I was pleased with them the whole game. Really, really pleased,\" Philadelphia coach Brett Brown said. \"How can we not leave that game feeling like the team is heading in the right direction?\"\nTIP-INS\nBulls: Rose sat out after participating in pregame warmups. He left in the fourth quarter of a 106-101 loss at Milwaukee on Tuesday. ... Butler's previous career high was 43 points on Dec. 18 in a four-overtime game against Detroit.\n76ers: Celebrities in attendance included Meek Mill, George Lopez and Montell Jordan, who sang the national anthem and performed at halftime. ... F Jerami Grant (calf) didn't play. ... Noel left the court because of nausea just before the opening tip. He was replaced in the starting lineup by Carl Landry. ... Nik Stauskas left early in overtime with a bruised left shoulder.\nUP NEXT\nBulls: Host Dallas on Friday night.\n76ers: Host Portland on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764993930.5945652
}