{
  "game_id": "0021600288",
  "espn_id": "400899730",
  "date": "Dec 02, 2016",
  "matchup": "DET @ ATL",
  "headline": "Caldwell-Pope, Harris push Pistons to blowout win over Hawks",
  "body": "ATLANTA --  Point guard Ish Smith has the Detroit Pistons talking to each other on the court, moving the ball fluidly and getting stops on defense.\n\nThe result has been an impressive run against quality opponents.\n\n\"We were just flying around,\" Smith said. \"That's going to be the key for us going forward, just constantly getting better defensively. If we can do that, then we'll be pretty good.\"\n\nKentavious Caldwell-Pope scored 23 points, Tobias Harris added 18 and Detroit beat the reeling Atlanta Hawks 121-85 on Friday night.\n\nThe Pistons, who tied a team record with 17 3-pointers, have won five of six and are 3-1 on a trip that included stops at playoff contenders Oklahoma City, Charlotte and Boston.\n\n\"To win three in a row against three teams ahead of you in the standings, all over .500, on the road, in four days?\" coach Stan Van Gundy said. \"That's a pretty good trip. So now the challenge is don't get full of ourselves.\"\n\nAndre Drummond finished with 14 points and 14 rebounds and Smith had 13 assists as seven players scored in double figures for Detroit.\n\nThe Hawks, losers in eight of their last nine games, were 9-2 and tied for the Eastern Conference lead after beating Milwaukee on Nov. 16. Now they are one-half game behind eighth-place Detroit and headed to play Toronto, the East's second-best team, on Saturday.\n\nDennis Schroder had 17 points and 13 assists for Atlanta. Tim Hardaway Jr. and Mike Muscala scored 11 each.\n\nCaldwell-Pope had 15 points in the first quarter and finished the first half with 20 points on 8-for-16 shooting, 4 for 5 on 3s. The former University of Georgia standout and former Southeastern Conference player of the year finished 9 for 20 from the field.\n\nThe outcome was decided early and resembled Atlanta's recent blowout losses to New Orleans and Utah.\n\nIt's been a difficult run and the Hawks' worst stretch of games under coach Mike Budenholzer, now in his fourth season, since they lost 14 of 15 from Feb. 4-March 8, 2014.\n\nThe Hawks played their second straight game without leading scorer Paul Millsap, who averages 16.1 points and is sidelined with a left hip injury. But star center Dwight Howard had just two points, took only four shots and was whistled for five fouls.\n\n\"I think as a team we've got to find a balance that we play inside and outside,\" Schroder said. \"We've got to keep moving the ball. We can't throw it into Dwight and he plays 1-on-1. That's not how we play, but I've got to do a better job of finding him and getting him more post touches.\"\n\nAtlanta missed 10 straight shots from the field during a stretch in which it trailed 51-32 in the second.\n\nThe Hawks never led after Caldwell-Pope hit a 3 at the 4:39 mark of the first. Detroit led 58-34 on Drummond's dunk of an alley-oop pass with 2 minutes left in the second.\n\nTIP-INS\n\nPistons: Two games after hitting 12 3s in Tuesday's win at Charlotte, Detroit was torrid beyond the arc. Jon Leuer, who finished with 16 points, went 4 for 5 on 3s. Caldwell-Pope finished 5 for 8. The team record of 17 3s was first set Dec. 28, 2014, at Cleveland.\n\nHawks: Budenholzer went with his second unit -- Hardaway, Muscala, Malcolm Delany, Taurean Prince and Kris Humphries -- to begin the third quarter. The starters -- Schroder, Howard, Kyle Korver, Thabo Sefolosha and Kent Bazemore -- combined for 20 points on 8-for-28 shooting. They were outrebounded by Detroit's starters 24-13 in the first half.\n\nUP NEXT\n\nPistons: Host Orlando on Sunday.\n\nHawks: Visit Toronto on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764996073.357118
}