{
  "game_id": "0022400752",
  "espn_id": "401705318",
  "date": "Feb 09, 2025",
  "matchup": "CHA @ DET",
  "headline": "Cade Cunningham's triple-double leads Pistons to 112-102 win over Hornets",
  "body": "DETROIT -- — Cade Cunningham had 19 points, 12 assists and 10 rebounds, and the Detroit Pistons beat the short-handed Charlotte Hornets 112-102 on Sunday.\n\n\r\n              The triple-double was Cunningham's eighth of the season, the third-highest total in franchise history. Grant Hill had 13 in 1996-97 and 10 in 1995-96.\n\n\r\n              Tobias Harris added 20 points for the Pistons, who never trailed, and Jalen Duren had 16 points and 12 rebounds.\n\n\r\n              Miles Bridges scored 30 points for Charlotte, which has lost seven of eight. Seth Curry added 26.\n\n\r\n              The Pistons led 90-73 going into the fourth quarter, but the Hornets started the period with a 14-0 run.\n\n\r\n              Cunningham and Dennis Schroeder hit back-to-back jumpers to give Detroit a 97-90 lead with 6:33 left, and the Pistons pulled back away down the stretch.\n\n\r\n              Takeaways\r\n              Hornets: LaMelo Ball (ankle) and Nick Smith Jr. (back) were downgraded from questionable to out about an hour before tipoff. Moussa Diabate left the game early in the second quarter after being accidentally hit in the face by Isaiah Stewart under the basket.\n\n\r\n              Pistons: Schroeder, acquired at the trade deadline, made his Pistons debut, getting five points and three assists in 15 minutes as the backup point guard.\n\n\r\n              Key moment\r\n              The Pistons took control immediately after the opening tip, taking a 13-4 lead in the first five minutes on their way to a 39-15 edge after the first quarter. Harris (14) and Malik Beasley (11) outscored the Hornets by 10 points as Detroit tied a franchise record for the biggest first-quarter lead.\n\n\r\n              Key stat\r\n              Charlotte shot 30% from the floor and turned the ball over eight times in the first quarter.\n\n\r\n              Up next\r\n              The Hornets are back in action on Monday when they visit the Brooklyn Nets in the second of nine straight road games. The Pistons play in Chicago on Tuesday and Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997703.793281
}