{
  "game_id": "0021900024",
  "espn_id": "401160666",
  "date": "Oct 25, 2019",
  "matchup": "SAC vs. POR",
  "headline": "Lillard scores 35 as Trail Blazers top Kings 122-112",
  "body": "SACRAMENTO, Calif. --  As he watched Damian Lillard take over in the fourth quarter, Hassan Whiteside stood up from his spot on Portland's bench and began pointing to his wrist.\n\nHaving seen Lillard repeatedly burn teams with late shots while playing against him, Whiteside knew his new teammate was ready to do it once again.\n\nLillard scored 13 of his 35 points in the fourth quarter and the Trail Blazers pulled away to beat the Sacramento Kings 122-112 on Friday night.\n\n\"I knew what time it was,\" Whiteside said. \"I think everybody knew what time it was.\"\n\nLillard added five assists and five rebounds, Whiteside had 22 points and nine rebounds despite sitting out the entire fourth period, and C.J. McCollum scored 19.\n\n\"In the first half we didn't think we played well at all,\" Lillard said. \"We were able to come out and assert ourselves starting the third quarter and pretty much controlled the game through the finish.\"\n\nPortland (1-1) overcame a sluggish first half but couldn't shake Sacramento until Lillard took over midway through the fourth.\n\nThe All-Star point guard weaved through the Kings defense for an uncontested layup, then nailed back-to-back 3-pointers, including one from 31 feet, and a pair of free throws to make it 114-101.\n\nHield hit a 3-pointer for the Kings but McCollum scored on consecutive trips down the floor and Lillard added his third 3 of the quarter.\n\nIt was nothing new to Whiteside. He's seen it all before from both Lillard and McCollum. The only difference now is Whiteside's vantage point.\n\n\"That's part of the reason I was so excited coming here,\" Whiteside said. \"I knew what it was. I've guarded it. Being out there with those guys means a lot.\"\n\nBlazers coach Terry Stotts credited his team's defense for making the difference.\n\n\"That was a really challenging game,\" Stotts said. \"Sacramento plays a style that's really tough to guard. We made most of our runs when we defended well.\"\n\nDe'Aaron Fox had 28 points, five assists and six rebounds for Sacramento. Buddy Hield added 21 points but the Kings remained winless in two games under new coach Luke Walton.\n\n\"We need to be able to get stops, and tonight we were not able to,\" Walton said. \"I actually thought we had some nice strides toward the end of the preseason with our defense but it has unfortunately not carried over into the regular season.\"\n\nAnfernee Simons added 15 points off the bench for Portland.\n\nSacramento controlled most of the first half and led by seven late in the second quarter before Portland closed on a 12-5 run. McCollum fueled the surge with a steal, dunk and short floater, and Lillard made a step-back 22-footer over Fox to tie it at 57.\n\nRESTING HASSAN\n\nStotts rested Whiteside in the fourth quarter after the big man logged 26 minutes in the first three periods. Whiteside also played 26 minutes in the opener against Denver.\n\nIt helped that Sacramento's two centers, Dewayne Dedmon and Richaun Holmes, were in foul trouble, forcing the Kings to go with a smaller lineup.\n\nTIP-INS\n\nTrail Blazers: Lillard picked up two fouls in a five-second span early in the first quarter. ... Simons scored 10 points in the second quarter after being held to five on 2-of-7 shooting in the season-opening loss to Denver.\n\nKings: Marvin Bagley III, who broke his right thumb in the opening loss at Phoenix, did not play and is expected to miss four-to-six weeks. Harry Giles (left knee soreness) also was held out.\n\nWEBBER, WALTON ON HAND\n\nChris Webber attended the game and sat courtside next to Kings owner Vivek Ranadive. Webber, a four-time All-Star with Sacramento and one of the most popular players in franchise history, was greeted with a loud ovation from the Golden 1 Center crowd.\n\nFormer Blazers star Bill Walton, the father of Sacramento's coach, was also in attendance wearing a purple Kings shirt.\n\nUP NEXT\n\nTrail Blazers: Play at Dallas on Sunday. The teams split four games last season.\n\nKings: Play at Utah on Saturday. Sacramento has lost two straight against the Jazz.\n\n---\n\nMore AP NBA:https://apnews.com/tag/NBA andhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996427.7187772
}