{
  "game_id": "0021501214",
  "espn_id": "400829101",
  "date": "Apr 12, 2016",
  "matchup": "TOR vs. PHI",
  "headline": "Raptors earn 12th straight win over 76ers, 122-98",
  "body": "TORONTO -- Toronto coach Dwane Casey probably could be forgiven for a bit of scoreboard watching Tuesday night.\nThough the Raptors' 12th straight win over the Philadelphia 76ers, 122-98, did not affect their Eastern Conference playoff standings, a couple other games did.\nThe Indiana Pacers beat the New York Knicks and the Detroit Pistons fell to the Miami Heat. That meant the Pacers secured the seventh seed and will face the Raptors in the first round starting this weekend.\nCasey, who had refused to talk about who his team might play, finally turned his attention to that matchup.\n\"They're an experienced team, a talented team,\" he said of the Pacers, who finished 11 games back of Toronto. \"Paul George is one of the elite players in the league. The young kid Myles Turner has really come on. Ian Mahinmi is one of the most improved players in the league. You can go right down the list, they have a very talented roster and their core has been there before.\"\nWith the postseason in mind, Casey carefully regulated the minutes of most of his players, with rookie Norman Powell the only one to get more than 30 minutes of action.\nPowell responded with 18 points, while Jonas Valanciunas chipped in with 17 more and 11 rebounds for his team-leading 22nd double-double of the season. Philadelphia, which lost its 15th straight road game, last beat Toronto on Jan. 18, 2013.\nWith the loss, Philadelphia became just the fourth team in NBA history with 71 or more losses in a single season. The 1972-73 76ers (9-73), the 1992-93 Dallas Mavericks and 1997-98 Denver Nuggets (both 11-71) are the others.\n\"You give them credit,\" Sixers coach Brett Brown said of the Raptors. \"They're getting ready to go into a playoff series, they're trying to find some level of rhythm and I thought we had a good first half.\"\nIt was a record-setting first 24 minutes for the Sixers, who converted 11-of-20 from beyond the arc, setting a new team mark for 3s in a first half, per Elias Sports.\nRobert Covington had 24 points for Philadelphia on 6-for-10 shooting from 3-point range, Ish Smith added another 18, and Nerlens Noel had 14 points and 10 rebounds, matching a career-long streak with his third straight double-double.\n\"It was just finding each other, the open man, moving the ball really well and getting into gaps and sinking the defense,\" Covington said. \"That's what we did tonight that really helped us in the first half, and then we did in the second as well, we just didn't make as many shots as we did in the first half.\"\nTHE CHAMP HOLDS COURT\nFormer three-time UFC welterweight champion Georges St. Pierre was sitting courtside. The Montreal native, who hasn't retired but hasn't fought in the Octagon since 2013, was given a team jersey and play-fought with the Raptors' mascot.\nELITE COMPANY\nCovington had his seventh game of the season with six or more 3-pointers, joining Stephen Curry, Klay Thompson and J.R. Smith in a select group. \"That's a good group to be a part of,\" he said.\nTIP-INS\n76ers: In his sixth career game against his hometown team, Sixers forward Nik Stauskas, who grew up down the road from the Air Canada Centre, was warmly cheered when his name was announced in the starting line-ups and had 13 points, a career-high against Toronto.\nRaptors: The 2015-16 Atlantic Division banner to celebrate their third consecutive division crown, was hanging in the rafters. ... James Johnson (plantar fasciitis) sat out his second straight game to rest his foot. ... Just four players (DeRozan, Valanciunas, Terrence Ross and Kyle Lowry) remain on the Toronto roster from Bryan Colangelo's tenure as president and general manager. Colangelo was named the 76ers' president of basketball operations earlier this week. ... The Raptors are now 13-2 against division foes this season, tied with the San Antonio Spurs for the second-best mark in the NBA, behind only the Golden State Warriors (15-1). ... With the victory, Toronto has become just the ninth team in the last four seasons to register 55 or more regular-season wins.\nUP NEXT\n76ers: Visit Chicago on Wednesday.\nRaptors: Visit Brooklyn on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994684.641862
}