{
  "game_id": "0021500619",
  "espn_id": "400828506",
  "date": "Jan 18, 2016",
  "matchup": "CHI @ DET",
  "headline": "Pistons lose cool, Bulls take advantage in 111-101 win",
  "body": "AUBURN HILLS, Mich. -- Chicago coach Fred Hoiberg dismissed the idea that the Bulls might be better off without Joakim Noah.\n\"I don't think you could find one guy in that locker room that would say we're a better team,\" Hoiberg said. \"He does so many things.\"\nThe Bulls will face plenty of challenges playing without Noah, but they're off to a good start after Monday's 111-101 win over the Detroit Pistons. Pau Gasol had 31 points and 12 rebounds, and Derrick Rose added 20 points for Chicago.\nNoah dislocated his left shoulder Friday and likely will miss the rest of the season, but the Bulls have had success without him. They improved to 9-2 in 2015-16 when he doesn't play.\n\"I'm not going to say that we're over him or we don't need him. We need him for sure,\" Rose said. \"But we're professionals. We know that once someone goes out, somebody has to step in and do that job, and we believe in everybody on this team.\"\n\nErsan Ilyasova had 19 points and 11 rebounds for Detroit, which was outplayed after taking a 13-point lead in the first quarter. The Pistons also lost their cool, getting called for three technical fouls in the third. Detroit guard Kentavious Caldwell-Pope received two of them and was ejected.\nJimmy Butler had 16 points and nine assists for Chicago.\nThe Pistons had plenty to feel good about coming into the game. They beat defending champion Golden State by 18 on Saturday night, and they had won their first two matchups this season with Chicago, including a four-overtime affair in December.\nDetroit shot 68 percent in the first quarter Monday and led 32-26, but the Bulls rallied and led 56-53 at halftime.\nChicago scored the first six points of the third, and although the Pistons were able to erase the deficit during that period, they showed constant frustration with the officials. Caldwell-Pope and Andre Drummond received technicals, and then Caldwell-Pope got another in the final seconds of the quarter and was ejected.\nGasol put the Bulls up by 10 in the fourth with a 3-pointer as the shot clock ran down. Later, with the score 98-91, Gasol appeared trapped beyond the arc with the shot clock running out, but he was fouled by Drummond while attempting a desperation shot, and the Chicago center made all three free throws.\n\"Fouling him 30 feet from the basket? That's not a smart move,\" Detroit coach Stan Van Gundy said.\nDrummond had 13 points and 16 rebounds.\nBENCH PLAY\nReserve Aaron Brooks had six points and 10 assists for Chicago, and Doug McDermott added 11 points.\nThe Bulls' reserves outscored Detroit's 33-18.\n\"We started the game pretty well with our starters,\" Van Gundy said. \"We went to the bench, and the bench didn't have anything going today. We got crushed with the bench and then after that we just got pretty well taken apart for the rest of the game.\"\nTIP-INS\nBulls: One area in which Noah's absence was felt was on the boards, where the Pistons had a 50-38 advantage. Chicago was outrebounded for the first time in 12 games. ... The Bulls allowed 20 offensive rebounds but finished only one point behind (17-16) in second-chance points.\nPistons: After a promising start, Detroit finished the game at only 44 percent from the field. ... Drummond made 3 of 10 free throws. ... The Pistons were 5 of 26 from 3-point range. ... Caldwell-Pope had 14 points.\nUP NEXT\nBulls: Host Golden State on Wednesday night.\nPistons: Play at Houston on Wednesday night.\n---\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764993927.411267
}