{
  "game_id": "0022400322",
  "espn_id": "401704888",
  "date": "Dec 04, 2024",
  "matchup": "ORL @ PHI",
  "headline": "Franz Wagner and Jalen Suggs power the Magic to a 106-102 win over the short-handed 76ers",
  "body": "PHILADELPHIA -- — Franz Wagner scored 35 points and Jalen Suggs had 17 to lead the Orlando Magic to a 106-102 win over the Philadelphia 76ers on Wednesday night.\n\n\r\n              Wagner made 12 of 23 shots from the floor with a 3-pointer and converted all 10 free throws to lead the Magic past the short-handed Sixers.\n\n\r\n              Philadelphia was not at full strength. Joel Embiid, Paul George, Andre Drummond and Kyle Lowry sat out due to injuries or rest.\n\n\r\n              An expected Eastern Conference favorite in the preseason, the Sixers dropped to 5-15. Coach Nick Nurse said there was a chance Embiid, who has played only four games this season, could play Friday when the teams play again in Philadelphia.\n\n\r\n              Wagner scored 25 points through three quarters before snapping a tie game in the fourth and helping the Magic stretch the lead.\n\n\r\n              Suggs hit four of Orlando's eight 3-pointers.\n\n\r\n              Jared McCain, Philadelphia's first-round pick who has emerged as an early Rookie of the Year candidate, scored 24 points. Tyrese Maxey had 16.\n\n\r\n              The Magic, an emerging team out of the Eastern Conference, played only four players off the bench but three of them scored in double digits.\n\n\r\n              Takeaways\r\n              76ers: Failed to secure their first three-game winning streak of the season.\n\n\r\n              Magic: Rebounded from a loss a night earlier in New York and won for the seventh time in eight games.\n\n\r\n              Key moment\r\n              Tied at the end of three quarters, the Magic opened the fourth on a 10-2 run to take a lead they never lost the rest of the game.\n\n\r\n              Key stat\r\n              Maxey missed all seven 3-point attempts and didn't attempt a free throw until the waning moments, when he hit two that pulled the 76ers to 99-98.\n\n\r\n              Up next\r\n              The 76ers and Magic play again Friday in Philadelphia.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997568.3190908
}