{
  "game_id": "0021600990",
  "espn_id": "400900385",
  "date": "Mar 12, 2017",
  "matchup": "LAL vs. PHI",
  "headline": "Saric, Okafor lead 76ers past Lakers 118-116",
  "body": "LOS ANGELES -- The Philadelphia 76ers won the game Sunday night -- and then had to wonder if they did not lose in the larger picture.\nThe Sixers got a career-high 29 points from rookie Dario Saric and 23 from Jahlil Okafor to edge the Los Angeles Lakers 118-116 on Sunday night.\nThe teams are in something of an odd battle, though, for finishing with the worse record. If the Lakers end up with one of the three worst records in the NBA this season, they get to retain their No. 1 draft pick. If they're out of the bottom three, it goes to the 76ers.\nThe 20-46 Lakers currently have the league's second-worst record. With the victory, the 76ers went to 24-43, now tied with the Orlando Magic for the fourth-worst mark.\nA loss would have left them just one game ahead of the Lakers with 16 to play.\n\"I don't think like that at all,\" Sixers coach Brett Brown said. \"Anybody who sees us play understands we play a certain way and our guys play to win. It's really that simple.\"\nBoth young teams continue to play hard, but the 76ers made the headier plays down the stretch.\nSparked by Jordan Clarkson's career-high 30 points and eight assists off the bench, the Lakers overcame a 12-point Philadelphia lead in the second half. Clarkson's 12-foot jumper gave the Lakers a 112-111 lead with 1:12 to play.\nBut T.J. McConnell 10-foot fallaway put the 76ers back up for good. Down by one with 31.8 seconds left, but with only 5 left on the 24-second clock, the Lakers called timeout.\nD'Angelo Russell said he did not realize the clock situation and took too long to shoot, the Lakers turning the ball over on a 24-second violation. Philadelphia iced the win with free throws.\nThe Lakers also had 21 points and 12 rebounds from Julius Randle, while the 76ers got 18 points from Timothe Luwawu-Cabarrot.\nTIP-INS\n76ers: Philadelphia got guard Gerald Henderson (hip) back against the Lakers, but was without forward Robert Covington. The Sixers said Covington, who fouled out Saturday against the Clippers, has right knee swelling.\nLakers: With an eye to the future, Lakers coach Luke Walton said starting shooting guard Nick Young will begin coming off the bench as the team looks at younger guards Tyler Ennis and David Nwaba. \"Nick's great,\" Walton said. \"He's been our best No. 2 guard all year long. I don't think anybody is going to look at this as him getting benched.\" Nwaba started Sunday.\nROOKIE STARS\nThe Sixers have a wealth of young big men. Center Joel Embiid was averaging 20.2 points and 7.8 rebounds in 31 games before his season ended with a torn meniscus in his left knee. With him out, Saric came into Sunday averaging 19.1 points 8.1 rebounds in his last 14 games and then had a career night.\nGOING YOUNG\nThe Lakers are looking forward, playing their younger players while veterans Luol Deng, Timofey Mozgov and Young stay on the bench. \"We're very aware there are going to be a lot of mistakes made and we have to simplify the offense to some basic sets,\" Walton said. \"What we're looking for are characteristics as far as the culture we're trying to build. How are they competing individually and as a group? How are they handling adversity?\"\nUP NEXT\n76ers: Travel to Golden State on Friday to complete a three-game road trip. The Warriors won their only previous meeting this season, 119-108, in Philadelphia in February.\nLakers: Travel to Denver for the first time this season on Monday. They split two contests in Los Angeles in January.",
  "source": "espn_api",
  "crawled_at": 1764995370.423223
}