{
  "game_id": "0022300107",
  "espn_id": "401584735",
  "date": "Oct 30, 2023",
  "matchup": "MIA @ MIL",
  "headline": "Antetokounmpo, Lillard help Bucks build big lead, hold off Heat in playoff rematch",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo showed up for his postgame press conference dressed as The Incredible Hulk to celebrate Halloween following Milwaukee's win over Miami.\n\n\r\n              Pretty appropriate, considering he had just helped the Bucks survive a late scare.\n\n\r\n              Antetokounmpo and the Bucks built a 25-point lead and then saw most of it wither away against Miami’s reserves before they held off the Heat 122-114 Monday night.\n\n\r\n              “Once you’re up 20, you’ve got to put them away,” said Antetokounmpo, who scored 33 points. “You’ve got to put them away. We weren’t able to do that tonight. Hopefully we can learn from this.”\n\n\r\n              After trailing 103-78 with less than 10 1/2 minutes remaining, Miami got the margin down to single digits over the next seven minutes. A jumper by Duncan Robinson cut the lead to 115-109 with 1:22 left, but Antetokounmpo converted a three-point play six seconds later.\n\n\r\n              The Bucks’ lead didn’t drop below six the rest of the way.\n\n\r\n              “We earned that 25-point deficit,” Heat coach Erik Spoelstra said. “And then that young group came in and really battled, did a lot of good things. I'm sure Milwaukee was just wanting to play it out and hoping we were going to go away.”\n\n\r\n              Damian Lillard scored 25 points and Bobby Portis had 16 for the Bucks. Tyler Herro had 35 points to lead the Heat, who were playing without two-time All-Star center Bam Adebayo due to a bruised hip.\n\n\r\n              This game carried more intrigue than a typical October matchup because of the postseason and offseason connections between the teams.\n\n\r\n              The Heat stunned the top-seeded Bucks in last season’s playoffs, winning their first-round series in five games. The Heat ended up going all the way from the play-in round to the NBA Finals, while the Bucks responded to the upset by firing coach Mike Budenholzer and replacing him with former Toronto Raptors assistant Adrian Griffin.\n\n\r\n              Milwaukee executed the biggest move of the offseason by acquiring Lillard, who expressed a preference to play for the Heat when he initially requested a trade from the Portland Trail Blazers.\n\n\r\n              Lillard said before the game he wouldn’t have any particular emotion about this matchup just because of this summer’s trade discussions. He still felt that way afterward.\n\n\r\n              \"There really was no extra energy toward that, I think, on either side,\" Lillard said.\n\n\r\n              The Bucks took the lead for good at the start of the second quarter and seemed on their way to a blowout until the Heat's late rally.\n\n\r\n              Miami outscored Milwaukee 41-25 in the fourth quarter, even though Herro was the only Heat starter on the floor during that final period. Spoelstra said he didn't put Jimmy Butler or the other starters back in because the bench had helped get the Heat back within striking distance.\n\n\r\n              Butler ended up with 13 points in 29 minutes.\n\n\r\n              “Our guys were changing the momentum,” Spoelstra said. “That sometimes can be frustrating when you’re on the other side. They just want you to go away. Our guys were doing it with great energy and doing a lot of good things. Part of me also wanted to see if they could just continue to get it over the top.”\n\n\r\n              The Bucks are all too familiar with the Heat's penchant for late rallies. \n\n\r\n              In last year's playoffs, Miami produced a 119-114 Game 4 victory by outscoring the Bucks 30-13 in the final six minutes. The Heat rallied from a 16-point, fourth-quarter deficit to win the clinching game 128-126 in overtime.\n\n\r\n              “When you have a chance to put them away, you've got to put them away -- because they're going to keep coming,” Antetokounmpo said.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Brooklyn on Wednesday.\n\n\r\n              Bucks: At Toronto on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995399.0728111
}