{
  "game_id": "0021900195",
  "espn_id": "401160837",
  "date": "Nov 18, 2019",
  "matchup": "PHX vs. BOS",
  "headline": "Tatum scores 26 to lead Celtics over Suns 99-85",
  "body": "PHOENIX --  Boston’s Kemba Walker took his time during the final seconds of the first half before accelerating around one defender and splitting two more while scooping a layup off the glass for the buzzer-beating basket.\n\nOne night after their 10-game winning streak was snapped, the Celtics were right back to their dominating basketball.\n\nJayson Tatum scored 26 points, Walker added 19 and Boston won for the 11th time in 12 games by beating the Phoenix Suns 99-85 on Monday night.\n\n“We showed a lot of heart, a lot of fight,” Tatum said. “We could have held our heads down after yesterday. The streak ended and we lost a close game.\n\n“But that’s the good thing about the NBA, no matter how good or bad you play, there’s another game coming up real soon. That’s what matters.”\n\nBoston (11-2) had its lengthy win streak snapped Sunday by the Sacramento Kings but bounced back with a relatively easy road victory. The Celtics led by 15 at halftime thanks to a 20-4 run at the end of the second quarter and never had their lead cut to less than nine in the second half.\n\n“You know you’re not going to win every game but when you have opportunities to bounce back and learn from mistakes and then you actually come out and do it, it just feels good,” Walker said.\n\nTatum shot 8 of 16 from the field and added 11 rebounds.\n\nMarcus Smart scored 17 points but left early in the fourth quarter because of a sprained right ankle. Smart said he might have tried to return if the game had been close and that there wasn’t much swelling after the injury.\n\n“It just irritated the exact same ankle I was coming back from in the same spot,” Smart said. “But everything’s fine. I should be fine to play the rest of the trip.”\n\nPhoenix (7-5) was playing without starting point guard Ricky Rubio, who was out because of back spasms. The offense never looked comfortable without him, relying on individual plays instead of their usual crisp ball movement.\n\nSuns coach Monty Williams said Rubio’s absence hurt, but it didn’t explain all the offensive issues.\n\n“We haven’t had 20-point quarters all year, we had two tonight. It’s a great learning experience for us,” Williams said. “We have an identity and one of those components is sharing the ball. When we move the ball and have player movement, we’re pretty good.”\n\nDevin Booker led the Suns with 20 points and Kelly Oubre Jr. added 15.\n\nPhoenix shot just 40% from the field, including 28% from 3-point range, and had its lowest-scoring game of the season.\n\nPhoenix had a 38-37 lead midway through the second quarter but scored just four points over the final six minutes of the half.\n\n“Credit to (Boston), they’re playing well, but I’m not sure if it was them or if it was just us,” Suns center Aron Baynes said. “We just have to be better at sticking to what we do. We didn’t look like ourselves tonight.”\n\nWILLIAMS ADDS BIG MINUTES\n\nBoston reserve Grant Williams had a big impact on the game with two blocked shots during the team’s 20-4 run to end the first half. He finished with four points and two rebounds in 18 minutes, one night after not playing against Sacramento.\n\n“Grant’s two blocks were huge because we were dead on those plays and he covered for us,” Boston coach Brad Stevens said.\n\nTIP-INS\n\nCeltics: Boston missed nine of its first 10 shots but rallied for a 26-22 lead after one quarter. ... Brad Wanamaker scored 10 points off the bench. ... Daniel Theis had no points and 11 rebounds in 27 minutes.\n\nSuns: Rubio’s issues with back spasms were announced less than an hour before the game. Jevon Carter started in his place and finished with three points and two assists in 25 minutes. ... Booker came into the game averaging 31 points against Boston over seven career games, which was his highest against any opponent.\n\nUP NEXT\n\nCeltics travel to face the Los Angeles Clippers on Wednesday.\n\nSuns travel to face the Sacramento Kings on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996587.978359
}