{
  "game_id": "0021900315",
  "espn_id": "401160957",
  "date": "Dec 04, 2019",
  "matchup": "SAC @ POR",
  "headline": "McCollum has 33 points, Trail Blazers beat the Kings 127-116",
  "body": "PORTLAND, Ore. --  CJ McCollum was confident it would all start to come together.\n\nMcCollum scored 33 points and the Portland Trail Blazers pulled away in the final quarter to beat the Sacramento Kings 127-116 on Wednesday night.\n\nIt was McCollum's 10th straight game with 20 or more points, tying a career high. That's a trend upward from the start of the season, when he struggled in a few games.\n\n“I know who I am as a basketball player. I know what I'm capable of doing. My body of work proves itself, it shows who I am as a basketball player,\" he said. “So if I have two or three poor games, poor shooting nights, I don't get discouraged because it's an 82-game season.”\n\nHassan Whiteside added 22 points and 16 rebounds, as well as a career-high seven assists. Damian Lillard had 24 points and 10 assists in Portland's third straight win at the Moda Center.\n\nCarmelo Anthony finished with 20 points, his fourth game with 20 or more in seven games with the Blazers.\n\nRichaun Holmes had 28 points and 10 rebounds for the Kings.\n\n“They made some shots to kind of break our backs there in the fourth quarter but I feel like we competed all the way through,” Holmes said.\n\nKent Bazemore's corner 3-pointer gave the Blazers a 108-101 lead early in the final quarter. Lillard's 31-footer made it 113-105 with 6:46 left.\n\nBazemore had another 3-pointer that gave the Blazers their biggest lead of the game to that point, 119-108 with 4:28 remaining.\n\nThe Blazers were playing the second of a back-to-back. They lost on the road to the Clippers 117-97 on Tuesday night, snapping a three-game winning streak.\n\nPortland has been boosted by the addition of Anthony, who was chosen the Western Conference player of the week for averaging 22.3 points, 7.7 rebounds and 2.7 assists over the three-game winning streak.\n\nAnthony's strong return after being out of the NBA for more than a year has been a surprise to some. But the 10-time All-Star seems to have meshed well in Portland.\n\nSacramento was without guard Bogdan Bogdanovic because of a knee contusion. He's also dealing with a hamstring injury. Bogdanovic is averaging 14.8 points, 2.7 rebounds and 4.7 assists this season.\n\nA 10-0 run at the end of the first quarter put the Kings up 28-26 but Anthony's jumper ended it. Buddy Hield had 14 points as Sacramento closed out the period ahead 35-30.\n\nMcCollum made four straight field goals for 10 points, pulling Portland within 43-42.\n\nThe Blazers had a 66-64 lead at the half, led by McCollum with 23 points. He also had career-high four blocks, all in the first half.\n\nMcCollum's 3-pointer gave the Blazers an 83-80 lead. Anthony added another 3 to extend it.\n\nSacramento kept kept it close and briefly re-took the lead, but Portland led 100-95 heading into the final quarter.\n\nLillard said the team tightened up its defense in the final quarter.\n\n“I think it was obvious that it wasn't good enough the first three quarters or so. The fourth quarter, we stepped it up and that was when we won the game,” he said.\n\nPortland has won 12 straight over the Kings at the Moda Center.\n\nIt was the third of four meetings between the teams this season. They split the previous two.\n\nTIP-INS\n\nKings: The Kings continue to play without De’Aaron Fox (ankle) and Marvin Bagley III (thumb), although Bagley is expected to return soon. “ You don't want any of your guys to get hurt, but a lot of what we built we built around having certain guys, and they haven't been with us,\" Kings coach Luke Walton said. “That's why I go back to giving our guys credit. They've adjusted, they've adapted, continued to work.” ... It was the first of a four-game road trip for the Kings, who play their next three in Texas. ... Hield finished with 23 points.\n\nTrail Blazers: It was the start of a four-game homestand for Portland. ... Whiteside's double-double was his 13th this season. ... Anfernee Simons fouled out with 11:17 left in the game. It was the first time he'd fouled out in his NBA career. ... Blazers coach Terry Stotts said Rodney Hood was bothered by an Achilles injury. Hood finished with six points.\n\nABOUT THOSE BLOCKS\n\nMcCollum finished with four, a career high. “I'll be at the rim every now and then. Being a rim protector, helping people's fantasy teams,\" he joked.\n\nUP NEXT\n\nKings: Visit San Antonio on Friday night.\n\nTrail Blazers: Host the L.A. Lakers on Friday night.\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996743.846793
}