{
  "game_id": "0021600660",
  "espn_id": "400900081",
  "date": "Jan 21, 2017",
  "matchup": "CHI vs. SAC",
  "headline": "Wade's 30 points, key steals lead Bulls over Kings, 102-99",
  "body": "CHICAGO -- Following an embarrassing road loss the previous day, Dwyane Wade felt the Bulls were desperate for a win on Saturday night.\n\"I like this team when we're desperate,\" he said. \"For some reason, we play better desperate.\"\nWade had 30 points and two key steals in the final minute, Jimmy Butler added 23 points and Chicago overcame a 42-point performance by DeMarcus Cousins for a 102-99 victory over the Sacramento Kings.\nWade, who had 13 points in the fourth quarter, snapped a 99-all tie by making a free throw with 14 seconds left. He had missed a breakaway dunk after making a steal, but Cousins was called for a questionable foul for putting his hand on Wade's hip as he tried to dunk the ball.\nCousins was incredulous immediately after the call and turned over four trash cans on his way to the locker room after the game. But by the time the media was allowed in the locker room -- nearly a half hour after the game ended -- his tone was more sarcastic than angry.\n\"They made the absolute right call,\" he said. \"Incredible job by the referee crew tonight. I don't have a complaint in the world. They should get more recognition on how well they ref these games. They don't get the credit they deserve, so kudos to them. I applaud them.\"\nAt that point, Cousins -- who also had 14 rebounds and was 16 for 28 from the field -- clapped his hands several times.\nWade acknowledged that the contact by Cousins wasn't the reason he missed the dunk. He said he simply took off too early and came up a little short.\n\"Hey, sometimes you get a call, sometimes you don't,\" Wade said. \"Personally, I haven't gotten a lot all year, so I'm not gonna apologize for nothing.\"\nBesides, Sacramento still had plenty of time for a potential game-winner at the other end. But Wade came up with another steal and fed Michael Carter-Williams for a breakaway basket to seal the win.\nChicago had dropped two straight, including a loss Friday night at Atlanta where coach Fred Hoiberg questioned the team's effort.\n\"The last couple of minutes, it was a desperate team trying to win a ballgame and doing whatever it takes,\" Wade said.\nTIP-INS\nKings: They have dropped seven straight in Chicago. Sacramento's last win was a 102-98 victory on Dec. 21, 2009 -- a game in which the Kings trailed 79-44 for the largest comeback in franchise history.\nBulls: F Doug McDermott appeared to break out of slump with a 31-point effort (in 33 minutes) against Memphis on Jan. 15, but has a combined 12 points on 5-for-18 in the three games since. He had three points on 1-for-5 shooting on Saturday.\nBOOGIE'S NIGHT\nThe loss and the disputed foul call overshadowed a great game by Cousins, who pumped in back-to-back 3-pointers down the stretch to give the Kings a 97-95 lead with just over two minutes left.\n\"His play is incredible,\" Sacramento coach Dave Joerger said. \"He just keeps getting better.\"\nSaid Wade: \"DeMarcus was giving us everything we could have asked for.\"\nON THIN ICE\nCousins wasn't whistled for a technical foul on Saturday, but has a league-high 14 this season. If he accumulates 16, he will be suspended one game, then one game for every other infraction thereafter.\nFREE-THROW EDGE\nIn a game where neither team held a double-digit lead, a deciding factor likely was Chicago making 12 more free throws (28 to 16). Wade and Butler were a combined 22 for 25 from the line. Cousins was 8 for 9 from the line.\nUP NEXT\nKings: Visit the Detroit Pistons on Monday night in the third game of eight-game road trip.\nBulls: At Orlando on Tuesday night. Chicago had a 112-80 victory in the first meeting with the Magic on Nov. 7.",
  "source": "espn_api",
  "crawled_at": 1764995051.3912718
}