{
  "game_id": "0021900802",
  "espn_id": "401161444",
  "date": "Feb 11, 2020",
  "matchup": "LAC @ PHI",
  "headline": "Richardson, Simmons lead 76ers past Clippers 110-103",
  "body": "PHILADELPHIA --  Ben Simmons and Joel Embiid kept the Philadelphia 76ers close until Josh Richardson took over.\n\nRichardson scored 17 of his 21 points in the fourth quarter, helping the Sixers beat the Los Angeles Clippers 110-103 on Tuesday night.\n\nSimmons had 26 points, 12 rebounds and 10 assists for Philadelphia, which has the NBA's best home record at 25-2. Embiid also scored 26 points, and Tobias Harris added 17 points and 12 boards.\n\n“In the fourth quarter, I started attacking more,” Richardson said. “I was reading the defense. Coach put the ball in my hands and gave me the freedom to read it and attack. It's great. I itch for moments like that. In close games, we all want to be part of that positive effort and I had a part of it.”\n\nSixers coach Brett Brown credited Richardson's ability to run the pick-and-roll and spell Simmons at point guard for helping the team pull away from Los Angeles.\n\n“Him being a leader and coming to life has a lot to do with some of those other things,” Brown said.\n\nKawhi Leonard led Los Angeles with 30 points, and reserve Landry Shamet scored 19 against his former team.\n\n“I thought we lost the game because we didn't play with any continuity offensively,” coach Doc Rivers said.\n\nRichardson nailed his third 3-pointer of the quarter to give Philadelphia a 102-94 lead with 4:44 left. Then he scored on a driving left-handed layup and made the free throw to complete the 3-point play, extending the lead to 11. His free throw made it 110-100 with 1:15 remaining after the Clippers cut the deficit to single digits.\n\n“We didn't make shots (in the fourth quarter),” Leonard said. “(Richardson) got to the paint, made some big 3s for them. He made shots.”\n\nLeonard faced the Sixers for the first time since his quadruple-doink, buzzer-beater knocked Philadelphia of the playoffs last May. Leonard's shot gave Toronto a 92-90 victory in Game 7 and the Raptors went on to win the NBA championship.\n\nThe Sixers opened the second half with a 16-5 run, taking a 70-59 lead. Simmons, Embiid and Glenn Robinson III combined for 14 of the 16.\n\n“It's arguably the best game those two have paired up with since I've been here,” Brown said of Simmons and Embiid.\n\nSimmons took 22 shots, just two short of tying his career best set as a rookie in 2017. Brown moved him around, giving him opportunities away from the ball.\n\n“I just love being a player. I don't put myself at any one position because I'm so versatile,” Simmons said.\n\nThe Sixers led by 12 in the second quarter after Embiid's reverse layup two minutes in, but the Clippers chipped away. Los Angeles closed out the half with a layup by Williams and pull-up jumper by Leonard to tie it at 54.\n\nALL LOVE\n\nEmbiid heard some boos mixed in with loud cheers when he was introduced. The All-Star center shushed the crowd and screamed an expletive following a shot Sunday after the team heard boos. He exacerbated the situation with a social media post Monday and a friendly exchange with Jimmy Butler, hinting he might join his former teammate who now plays for Miami.\n\nBut it was all love for Embiid in the fourth quarter after he and Marcus Morris got into a shoving match. Embiid did a shimmy for fans and got a loud ovation.\n\n“I could've shushed them again but it was all about having fun,” Embiid said.\n\nHe added: “If you dish it, you gotta take it back. But I love my city. We have a special relationship.”\n\nTIP-INS\n\nClippers: Leonard was back in the lineup after sitting out a lopsided win over Cleveland. ... Guard Patrick Beverley missed his third straight game and sixth since Jan. 21 because of a sore right groin. ... The Clippers dropped to 1-2 with one game remaining on a four-game road trip.\n\n76ers: Forward Al Horford came off the bench for the first time since his rookie season in 2007. Horford didn't score a point Sunday for the first time in 835 games. Furkan Korkmaz started instead and Robinson took Korkmaz's spot to begin the third quarter. Korkmaz had no points in 23 minutes after scoring 65 total in the past two games. ... Guard Alec Burks made his Sixers debut. He was acquired along with Robinson from Golden State for draft picks last week.\n\nUP NEXT\n\nClippers: At Boston on Thursday in their final game before the All-Star break.\n\n76ers: Host Brooklyn on Feb. 20 after eight days off for the All-Star break.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996493.094031
}