{
  "game_id": "0021500111",
  "espn_id": "400827998",
  "date": "Nov 10, 2015",
  "matchup": "CHA @ MIN",
  "headline": "Lin, Lamb lead Hornets over short-handed Timberwolves",
  "body": "MINNEAPOLIS -- Charlotte Hornets coach Steve Clifford knows that if his team is going to surprise some people and make a push for an Eastern Conference playoff berth, his bench players will play a pivotal role.\nOne game after getting smoked by the San Antonio Spurs, Charlotte's reserves made all the difference against the short-handed Minnesota Timberwolves.\nJeremy Lin scored 19 points and Jeremy Lamb added 18 to lead the Hornets to a 104-95 victory on Tuesday night.\nNicolas Batum added 17 points for the Hornets, who overcame a combined 7-for-21 shooting from Al Jefferson and Kemba Walker to beat the depleted Timberwolves.\nThe Hornets were outrebounded 48-34, but outscored Minnesota's bench 57-23. Cody Zeller added 14 points and six rebounds.\n\"I think if we're going to be really good, then we're going to have good bench play,\" Clifford said. \"I mean, I think that our starters are good, but to be a really good team our bench is going to have to be like they were tonight.\"\nKarl-Anthony Towns had 19 points, 13 rebounds and three blocks for the Timberwolves, who played without starters Andrew Wiggins (sore right knee), Ricky Rubio (sore left knee) and Kevin Garnett (rest). Zach LaVine added 20 points, eight rebounds and five assists.\nCoach Sam Mitchell said he didn't find out Rubio and Wiggins would be out until just before the game.\n\"We just had way too many turnovers,\" Mitchell said.\nLamb hit eight of his 10 shots, including 2 for 3 from 3-point land, and Lin hit a tough fallaway jumper over Towns' outstretched hand with under four minutes to play that helped turn back the Wolves.\nThe Timberwolves turned the ball over 22 times, which led to 22 Hornets points. LaVine turned it over eight times.\nOne night after a stirring victory at Eastern Conference power Atlanta gave the surprising Timberwolves a 4-2 record in which every victory has come on the road, they jumped out to an 11-point lead in the first quarter thanks to some inspired play from Towns and Adreian Payne, who started for Garnett.\nThe Hornets fought back by getting to the free throw line relentlessly, going 14 of 17 on freebies in the first quarter alone. Lamb and Line got going in the second quarter against Minnesota's porous backcourt defense from the reserve guards.\nLamb scored 12 in the second quarter and Lin got into the paint at ease against a defense that had been in the top five in the league through the first six games. But with defensive stalwarts Garnett, Wiggins and Rubio all out, the Wolves were powerless to stop the fresher Hornets.\nA 9-0 run bridging the end of the third and start of the fourth quarters pushed Charlotte's lead to 11, and the Hornets (3-4) held on.\nIt was a stark contrast from the Spurs game, when Zeller, Lamb and Lin all were a minus-29 or worse when they were on the floor.\n\"It's not going to be like that every night but tonight we felt like we really needed a boost off the bench,\" Lin said. \"We wanted to make up for what we did last game, which was give them a negative boost against the Spurs when the starters came out strong.\"\nTIP-INS\nHornets: P.J. Hairston had to go to the locker room in the first half with a migraine headache and did not return. ... Jefferson scored nine points in 27 minutes.\nTimberwolves: PG Tyus Jones made his NBA debut. He had one point and one rebound and missed all four of his shots in 11 minutes. ... Kevin Martin had 18 points and five assists. ... Payne finished with 10 points and five rebounds and hit both of his 3-pointers.\nTOWNS EXCELS\nThe No. 1 overall pick posted his fifth double-double in seven games and made life miserable for Jefferson, as crafty a post player as there is in the league. Jefferson started the game 0 for 6. Two of his three made field goals came with Towns on the bench.\n\"I knew that tonight I had to go out there and produce at a high level with two great players in Ricky Rubio and Andrew Wiggins not playing,\" Towns said. \"I tried to go out tonight and contribute as much as possible on both ends. I came up short. I didn't do what I had to do to help us win this game.\"\nUP NEXT\nHornets: Host New York on Wednesday.\nTimberwolves: Host Golden State on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994415.196507
}