{
  "game_id": "401809935",
  "espn_id": "401809935",
  "date": "Oct 22, 2025",
  "matchup": "ATL vs TOR",
  "headline": "Raptors set team scoring record for season opener in 138-118 win over Hawks",
  "body": "ATLANTA -- — RJ Barrett scored 25 points and Brandon Ingram added 16 points and nine rebounds in his Toronto debut as the Raptors ran away from the Atlanta Hawks for a 138-118 victory Wednesday night in the season opener for both teams.\n\n\r\n              Scottie Barnes had 22 points and nine assists and Gradey Dick scored 19 off the bench for the Raptors, who set a franchise record for points on opening night and surpassed last season's high. Toronto shot 57% from the field, including 69% on 2-pointers, as the Raptors repeatedly beat the Hawks in transition for easy buckets.\n\n\r\n              Ingram missed the final 56 games last season with an ankle injury. He was traded to Toronto midseason but never played for his new team. He shot 7 of 16 from the floor Wednesday and had three assists and two steals.\n\n\r\n              Hawks forward Jalen Johnson, who missed the final 38 games last season with a shoulder injury, had 22 points, eight assists and seven rebounds. He assumed more of the playmaking role that coach Quin Snyder envisions for him this season.\n\n\r\n              Trae Young finished with 22 points, but he was 1 for 7 from 3-point range and was constantly pressured by Toronto's guards.\n\n\r\n              The Raptors used a 14-0 run at the end of the third quarter to stretch a nine-point lead to 23 and effectively put the game out of reach. Five players scored during the spurt, led by five points from Dick. Toronto never let the Hawks get within 20 in the fourth.\n\n\r\n              Kristaps Porzingas, acquired in a trade with Boston during the offseason, had 20 points, seven rebounds and two blocks in his Hawks debut.\n\n\r\n              Up next\r\n              The Raptors will host the Bucks while the Hawks will be in Orlando to play the Magic in the front end of a back-to-back on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042477.850482
}