{
  "game_id": "0021600926",
  "espn_id": "400900321",
  "date": "Mar 04, 2017",
  "matchup": "POR vs. BKN",
  "headline": "McCollum scores 31 in Trail Blazers' 130-116 win over Nets",
  "body": "PORTLAND, Ore. --  The Portland Trail Blazers know their margin for error is as thin as it could be. On Saturday night, their 3-point precision reflected that urgency.\n\nCJ McCollum scored 31 points to lead the Portland Trail Blazers past the Brooklyn Nets 130-116 on Saturday night.\n\nAl-Farouq Aminu made five 3-pointers and finished with 23 points off the bench. He also tied for a team-high six rebounds for Portland, which won consecutive games for the first time since a three-game win streak from Jan. 21-27.\n\nThe Blazers went 16 of 25 (64 percent) on 3-pointers and shot 57 percent from the field overall.\n\nWith its win and Denver's loss to Charlotte on Saturday night, the Blazers moved within 1 1/2 games of the Nuggets for the final playoff spot in the Western Conference.\n\n\"We only gave up 25 3-point attempts, so that's a positive,\" Nets coach Kenny Atkinson said. \"But Aminu makes 4 of 5 from deep, and he's a 30 percent 3-point shooter. Lillard and McCollum got their 3s going, and they were amazing on 3s all night.\"\n\nPortland's positioning, along with a 3-3 record since acquiring center Jusuf Nurkic from Denver, has given them a jolt in an otherwise disappointing season after last season's second-round playoff appearance.\n\n\"It's fun to be chasing something,\" Lillard said. \"People are saying `Oh, you can get a pick.' And, `They're not going to make the playoffs,' and all these things. We've been presented a challenge. That's been a challenge all year but now, it's gut-check time. It's do-or-die. That makes it fun.\"\n\nBrook Lopez led the Nets with 26 points.\n\nLopez got things started for the Nets on a positive note with a three-point play on the first play of the game -- but that would be Brooklyn's largest lead.\n\nPortland led by as many as 15, shooting 75 percent from the field in the first quarter. The Blazers cooled considerably in the second, allowing the Nets to close the gap to one at halftime.\n\nTIP-INS\n\nNets: Brooklyn G Joe Harris' Northwest homecoming was ruined when he took a nasty spill in the team's 112-97 loss to the Utah Jazz on Friday. Harris, a native of Chelan, Washington, about a 5-hour drive from Portland, is now in the NBA's concussion protocol. \"It's a shame, it was a good opportunity for him to play close to home,\" Atkinson said. \"He had a lot of people coming, so I feel bad about that. He's in our rotation, playing well. His spirits are up, hopefully he'll be back soon.\"\n\nBlazers: The team announced that C Festus Ezeli will have surgery on his knee next week in Vail, Colorado. Ezeli, acquired from Golden State in free agency, hasn't played this season. Ezeli signed a two-year deal with Portland last summer, but next season is only partially guaranteed. ... Damian Lillard led the Blazers with 11 assists. ... Lillard also made a 3-pointer for the 41st consecutive game, tying a franchise record.\n\nTURNER CLOSER TO RETURN\n\nBlazers F Evan Turner had the cast removed from his broken right hand and is making progress. Turner broke the third metacarpal on Feb. 7 and is wearing a splint. The team announced he would be out for five-to-six weeks and he appears to be on schedule. Turner said doctors won't allow him to touch a basketball with his dominant hand for another week. \"Obviously, they went to school or whatever for that. I'd be stupid to not listen,\" Turner said.\n\nUP NEXT\n\nNets: At Memphis on Monday.\n\nBlazers: At Minnesota on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995650.359099
}