{
  "game_id": "0021700426",
  "espn_id": "400975177",
  "date": "Dec 15, 2017",
  "matchup": "MIL vs. CHI",
  "headline": "Portis scores career-high 27 as Bulls beat Bucks 115-109",
  "body": "MILWAUKEE --  Bobby Portis says it's fun playing with Nikola Mirotic, his Chicago Bulls teammate who suffered facial fractures when the two fought in October.\n\nDespite their troubles earlier this season, they made for an impressive duo Friday night against the Milwaukee Bucks.\n\nPortis scored a career-high 27 points and grabbed 12 rebounds as the Bulls won their fifth consecutive game, beating the Bucks 115-109. The winning streak coincides with the return of Mirotic, who had 22 points.\n\n\"Me and Niko, we don't really care about that situation anymore,\" Portis said about their fight. \"Everything's for the team. We're professionals, we're basketball players and this is our job.\n\n\"Ultimately, we have to come in here every day, put our shoes on and play together, find a way to make it work,\" he said. \"I feel we've done that up until this point.\"\n\nMirotic made a wildly off-balance 5-footer while being fouled and converted the free throw to give the Bulls a 112-107 lead with 1:07 to go.\n\n\"We both have stepped up,\" Mirotic said. \"I think we've learned how to play with each other.\"\n\nEric Bledsoe and Rashad Vaughn each missed a 3-pointer for Milwaukee in the final minute. Mirotic made three free throws over the last 13 seconds to seal the victory.\n\nGiannis Antetokounmpo had 29 points and 16 rebounds for the Bucks, who lost for just the third time in nine games. Khris Middleton also scored 29, while Bledsoe had 12 points and seven assists.\n\nMilwaukee's guards struggled offensively. Bledsoe shot 5 of 13 in 34 minutes, while reserve Malcolm Brogdon went just 3 for 12 in 32 minutes.\n\n\"Honestly, I thought it was just one of those nights where me and Eric were just out of rhythm,\" Brogdon said. \"I didn't think they did a specifically good job on us. There are just games where you are out of rhythm and it happens.\"\n\nIn addition, Vaughn played 28 minutes and shot only 3 of 10, including 2 for 8 on 3-pointers.\n\n\"He got a lot of wide-open shots that we all think he can make,\" Milwaukee coach Jason Kidd said. \"They just didn't go down for him. I thought he was good out there while he was on the floor. He's got to be able to knock down those wide-open shots.\"\n\nPortis hit a pair of foul shots to give Chicago the lead for good, 106-104, with 2:58 left. After a Milwaukee turnover, Mirotic drained a 3-pointer for a 109-104 lead with 2:42 to go.\n\nRobin Lopez scored 18 points and Kris Dunn added 17 for the Bulls.\n\nCENTURY MARK\n\nMilwaukee scored at least 100 points for the 11th consecutive game. \"You've got three guys playing at a high level with Bled, Khris and Giannis,\" Kidd said before the game. \"Sharing the ball is the key, and being able to make your free throws. Just making a play for a teammate and finding the open guy. Guys are moving the ball. Right now, the ball is going in for us.\"\n\nTHINKING ABOUT MIRZA\n\nThe Bucks announced Thursday that Mirza Teletovic is out because of pulmonary embolisms in both lungs. He missed three months of the regular season due to blood clots in his lungs while playing for the Brooklyn Nets in 2015. \"It's not about basketball, it's about life,\" Kidd said. \"We're hoping for a speedy recovery and hopefully he has a chance to come back and play.\"\n\nTIP-INS\n\nBulls: Rookie forward Lauri Markkanen didn't make the trip to Milwaukee, missing his third consecutive game with back spasms. Chicago coach Fred Hoiberg said Markkanen was being held out as a precaution. \"He felt a lot better this morning,\" Hoiberg said, adding that Markkanen still had some soreness.\n\nBucks: Lost for only the second time in nine home games.\n\nUP NEXT\n\nBulls: Host the Philadelphia 76ers on Monday night.\n\nBucks: At the Houston Rockets on Saturday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993032.801844
}