{
  "game_id": "0022400174",
  "espn_id": "401704740",
  "date": "Nov 06, 2024",
  "matchup": "LAL @ MEM",
  "headline": "Morant, Wells, Jackson Jr. score 20 apiece as Grizzlies beat Lakers 131-114",
  "body": "MEMPHIS, Tenn. -- — Ja Morant scored 20 points before leaving in the third quarter with a right hamstring injury and the Memphis Grizzlies used their 3-point shooting to beat the Los Angeles Lakers 131-114 on Wednesday night.\n\n\r\n              Rookie Jaylen Wells and Jaren Jackson Jr. also scored 20 points each for the Grizzlies. There was no immediate word on the extent of Morant's injury.\n\n\r\n              LeBron James led the Lakers with 39 points, while Austin Reaves added 19 despite going 2 for 9 from 3-point range.\n\n\r\n              The Lakers played without starting center Anthony Davis, who was suffering from left heel soreness. Rui Hachimura was also out with an illness, givig rookie Dalton Knect from Tennessee his first NBA start.\n\n\r\n              Meanwhile, Grizzlies coach Taylor Jenkins missed the game because of a death in the family. Assistant coach Tuomas Iisalo led the team.\n\n\r\n              Takeaways\r\n              Lakers: With Davis out, Los Angeles was missing 32.6 points and 11.6 rebounds a game and a dominant force in the middle. James tried to make up for the scoring but got little help.\n\n\r\n               Grizzlies: Davis' absence in the middle helped the Grizzlies stay right at their average scoring 60 points in the paint.\n\n\r\n              Key moment\r\n              Memphis held a 72-68 lead in the third quarter when reserve Jay Huff, a 7-foot-1 center, connected on three consecutive 3-pointers, then capped the run off with an offensive rebound leading to a reverse dunk. The rally took the Grizzlies' advantage to 85-71. \n\n\r\n              Key stat\r\n              Neither team attempts a lot of 3-pointers compared to the rest of the league, but Memphis was shooting 48% from outside the arc at the midway point of the fourth period. Meanwhile, the Lakers were stuck at 25%. \n\n\r\n              Up next\r\n              Lakers host Philadelphia on Friday while the Grizzlies host Washington,.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997214.238338
}