{
  "game_id": "0022001044",
  "espn_id": "401307853",
  "date": "May 12, 2021",
  "matchup": "CLE vs. BOS",
  "headline": "Love scores 30, Cavs beat Celtics to end 11-game slide",
  "body": "CLEVELAND -- — The Celtics can stop chasing, get some rest and hopefully heal up. They're play-in bound.\n\n\r\n                    Kevin Love scored a season-high 30 points, Collin Sexton added 28 and the Cleveland Cavaliers snapped an 11-game losing streak with a 102-94 win in their home finale, locking Boston into one of the four play-in spots in the Eastern Conference.\n\n\r\n                    It has been a rough few days for the Celtics. They lost All-Star Jaylen Brown for the rest of the year with a wrist injury, dropped two straight games to Miami and then faced Cleveland without starters Kemba Walker and Marcus Smart due to injuries.\n\n\r\n                    They still had a chance to catch New York for the No. 6 spot, but a loss to the lowly Cavs means they'll be involved in the play-in involving the Nos. 7-10 seeds.\n\n\r\n                    “This is tough,” said Jayson Tatum, who scored 29 but shot just 11 of 26, “especially losing games like this.”\n\n\r\n                    Boston will most likely be the No. 7 seed and host either Charlotte or Indiana, depending on how the final few days play out.\n\n\r\n                    Love made six 3-pointers, including two in an 11-0 run early in the fourth quarter, and had 14 rebounds as Cleveland closed out a miserable season at Rocket Mortgage FieldHouse with its first win since April 21.\n\n\r\n                    While their fans may want them to lose as many games as possible to help their lottery chances, the Cavs wouldn't consider tanking.\n\n\r\n                    “I just wanted to win one at home before the season was over,” said Love, who missed two months with a calf injury and then had an on-court tantrum that stained his reputation. “I didn't want to come back in the locker room and feel angry. I didn't want to feel that. Winning is definitely more fun.”\n\n\r\n                    Evan Fournier had 15 for the Celtics, who have lost eight of 11.\n\n\r\n                    It was Boston’s first road game since losing Brown with a torn wrist ligament. His absence is a devastating blow to the club’s playoff chances, which were looking shaky in recent weeks anyway. The Celtics have plenty of talent, but there seems to be missing something.\n\n\r\n                    With playoff positioning on the line, and in need of a confidence boost after a rough stretch, the Celtics were also without Walker (knee management) and Smart (bruised calf), leaving Tatum to carry too much of the offensive load.\n\n\r\n                    The Cavs have dealt with their own injury issues and were without several key players, including starting point guard Darius Garland. He missed his seventh straight game with a sprained ankle.\n\n\r\n                    Love's two 3s helped the Cavs open an 80-72 lead, and after the Celtics got within seven, he and Sexton hit consecutive long-range shots to put Cleveland ahead 89-76.\n\n\r\n                    THOMPSON TRIBUTE\n\n\r\n                    Boston's Tristan Thompson received a warm ovation in his first game back in Cleveland.\n\n\r\n                    The No. 4 overall pick in 2011, Thompson spent nine seasons with the Cavs before signing as a free agent with the Celtics in November. He finished with 10 points and seven rebounds.\n\n\r\n                    “He’s a great person. He’s a great teammate,” said Cavs coach J.B. Bickerstaff, who appreciated Thompson's leadership and work ethic. \"The legacy here speaks for itself. He’s a guy who this city embraced, obviously, part of a rebuild all the way to a championship. He was there the entire way. His style is respected and appreciated.”\n\n\r\n                    GOOD BYE, GOOD LUCK\n\n\r\n                    The home finale was also a send-off for Cavs center Anderson Varejao and assistant coach Lindsay Gottlieb.\n\n\r\n                    Varejao signed a 10-day contract with the Cavs last week to finish season, returning for a farewell after he spent 11-plus seasons with Cleveland.\n\n\r\n                    Gottlieb is leaving after two seasons to coach at USC.\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Coach Brad Stevens said even if Boston was still in the hunt for a higher playoff spot that Walker would not have played. He has sat the second game of back-to-backs all season. “No reason to push it,” Stevens said. ... C Robert Williams received a cortisone injection in his turf toe injury Monday. Stevens said the team is being cautious with the big man, hoping he'll be available for the postseason.\n\n\r\n                    Cavaliers: In a season of few positives, Garland was a bright spot. The second-year guard averaged 17.7 points and 6.2 points, an increase from his rookie stats (12.3, 3.9). Beyond that, he showed a better understanding of what it takes to be an NBA point guard. “The improvement from his rookie season to his second year, the leap, is almost unheard of,” Bickerstaff said. ... Finished (13-23, 12-23 coming in) at home.\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: At Minnesota on Saturday. Tatum scored a career-high 53 in Boston's overtime win against Minnesota on April 9.\n\n\r\n                    Cavaliers: Visit Washington on Friday before finishing the season Sunday at Brooklyn.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997861.260731
}