{
  "game_id": "0022401129",
  "espn_id": "401705695",
  "date": "Apr 05, 2025",
  "matchup": "MEM @ DET",
  "headline": "Desmond Bane scores 38 in the Grizzlies' 109-103 victory over the Pistons",
  "body": "DETROIT -- — Desmond Bane scored 38 points, Zach Edey had a career-high 21 rebounds and the Memphis Grizzlies held off the Detroit Pistons 109-103 on Saturday night.\n\n\r\n              Ja Morant was a late scratch for the Grizzlies, who had lost seven of nine, because of an illness. Jaren Jackson had 27 points and 11 rebounds.\n\n\r\n              Cade Cunningham, returning after missing six games with a calf strain, had 25 points and nine rebounds for the Pistons, who have lost three of four. Ausar Thompson added 18 points and 11 rebounds.\n\n\r\n              Detroit trailed 91-85 when center Isaiah Stewart sat with five fouls. With Detroit's usual starter, Jalen Duren, missing the game with an injury, the Pistons were forced to use 6-foot-6 Thompson against the 7-3 3/4 Edey.\n\n\r\n              The Pistons were as close as 93-91 with four minutes left, but struggled to stop the Grizzlies around the rim. Bane hit a 3-pointer to make it 104-98 with 56 seconds left and Memphis wrapped it up at free-throw line.\n\n\r\n              Takeaways\r\n              Grizzlies: Memphis has beaten the Pistons nine straight times. Detroit's last win came on May 6, 2021.\n\n\r\n              Pistons: Duren missed the game with a contusion of the peroneal nerve in his right leg. \n\n\r\n              Key moment\r\n              Detroit was within two with 3:56 left, but Thompson fouled Santi Aldama on a 3-point attempt, then could only split a pair of free throws at the other end.\n\n\r\n              Key stat\r\n              Memphis struggled from the field in the first half, shooting 36.7% (18-49) and making just four of 18 3-point attempts (22.2%), but only trailed by one point at the intermission by grabbing 11 of 30 (36.7%) offensive-rebound opportunities. The Grizzlies finished the half with a 10-2 advantage in second-chance points.\n\n\r\n              Up nex\r\n              t\r\n              Memphis is at Charlotte on Tuesday night. The Pistons host Sacramento on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997715.477793
}