{
  "game_id": "0021700703",
  "espn_id": "400975449",
  "date": "Jan 24, 2018",
  "matchup": "PHX @ IND",
  "headline": "Pacers take easy path to get past fatigued Phoenix 116-101",
  "body": "INDIANAPOLIS --  Victor Oladipo decided to share Wednesday night's All-Star selection party with his teammates.\n\nThey joined right in.\n\nA night after the announcement came, Oladipo had 21 points and nine assists to help the Pacers pull away from the Phoenix Suns 116-101.\n\n\"I drew a lot of attention and guys were open. When my teammates are playing well, shooting the ball well, it makes it that much easier for me and everyone else,\" Oladipo said. \"When we play as a unit on both ends of the floor we're really effective.\"\n\nIndiana was efficient and dominant despite playing without two starters. The Pacers never trailed, never allowed the Suns to get closer than 10 points after the first quarter, built a 38-point lead in the third and still led by 27 with 4:41 left to play.\n\nFive Pacers scored in double figures and Oladipo wasn't even Indiana's top scorer. Thaddeus Young had 22 points.\n\nSure, Phoenix looked like a team ready to head home following the final stop on a four-game road trip.\n\nBut Oladipo and the Pacers took full advantage with a devastating one-two combination: a 13-4 scoring flurry to end the first half and a 16-2 spurt to start the second. That made it 79-44, all but assuring Indiana of its fifth win in six games and its second double-digit victory over Phoenix in 10 days.\n\n\"They were a physical team, and we didn't match their physicality,\" Suns coach Jay Triano said. \"For us to compete with a team like this we've got to have everybody play well and it didn't happen.\"\n\nJosh Jackson scored 20 points and Greg Monroe had 16 points and a season-high 17 rebounds for the Suns, who have lost two straight and five of six.\n\nThe Suns started the second half with three turnovers and five missed shots before making their first basket -- Jackson's 3-pointer to cut the deficit to 79-49 with 7:24 left in the third. Phoenix only managed to make the score more respectable by finishing the game on a 16-4 run.\n\nTIP-INS\n\nSuns: Phoenix was 9 of 35 on 3-pointers but still extended the league's longest active streak of consecutive games with a 3 to 1,106. Dallas holds the NBA record at 1,108. ... Devin Booker and Troy Daniels each scored 19 points.\n\nPacers: Bojan Bogdanovic scored 17 points and grabbed seven rebounds while Al Jefferson had 10 points. ... Lance Stephenson had seven points, nine rebounds and four assists. ... The 15-point victory coupled with last week's 23-point rout gave Indiana its most lopsided season sweep over Phoenix in franchise history. ... The Pacers shot 56.2 percent from the field and are 16-0 when topping 50 percent this season.\n\nSHORT-HANDED\n\nPacers guard Joe Young made his first career start because point guard Darren Collison was out for personal reasons. McMillan made the announcement shortly before the tip but provided no details about why Collison was out or how many games he might miss.\n\nYoung had six points.\n\nStarting center Myles Turner also sat out again, missing his eighth straight with an injured right elbow. Turner's replacement, Domantas Sabonis, was selected for the Rising Stars Challenge game Wednesday and finished with 19 points, eight rebounds and three assists.\n\nIndiana also lost backup forward TJ Leaf with a sprained right ankle early in the second quarter. He did not return.\n\nHE SAID IT\n\n\"This was an embarrassing game,\" Booker said. \"I'm not sure how many transition points they had, I'm sure it was a lot. A lot more than we had.\"\n\nUP NEXT\n\nSuns: Play their first home game in 12 days when the Knicks visit Friday.\n\nPacers: Can sweep the four-game season series by winning Friday at Cleveland.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993901.420733
}