{
  "game_id": "0021900484",
  "espn_id": "401161126",
  "date": "Dec 28, 2019",
  "matchup": "LAL @ POR",
  "headline": "Kuzma, James lead Lakers past Trail Blazers 128-120",
  "body": "PORTLAND, Ore --  Kyle Kuzma’s season may have turned a corner on Saturday night, and the Los Angeles Lakers snapped their season-long four-game losing streak in the process.\n\nKuzma scored 24 points, LeBron James had 21 points and 16 assists, and the Lakers beat the Portland Trail Blazers 128-120.\n\nKuzma highlighted a strong performance by the Lakers' reserves, who provided 72 bench points. Portland’s bench scored 39 points.\n\nIt was the type of night the Lakers have expected for Kuzma all season as he has battled through several injuries and a reduction in minutes. Kuzma scored over 20 points for the second straight game.\n\n“Yeah, I’m just healthy now,” Kuzma said of another strong performance. “I’m confident in my body. I took a little bit of time off, sitting out for five games and really just self-collected what I needed to do and got it done.”\n\n“We want him to be that third scorer for us, consistently get to 18 to 20 points a night and more important you know, it’s just the efficiency right now that I love,” James said of Kuzma, who was nine for 17 from the field. “He’s just been very efficient mixing it up with his 3s, his paint touches. You saw it tonight on the break as well, just mixing it up.”\n\nAnthony Davis added 20 points and nine rebounds for the Lakers. The win also helped the Lakers move on from a disappointing Christmas day loss to their crosstown rival Clippers.\n\n“We were all pretty upset about the last game,” Davis said. “We just wanted to make an effort to come in and get back in the win column. We were able to pull this one out.”\n\nHead coach Frank Vogel, who told his team prior to the game that he wanted his team “angry and edgy,” picked up a technical in the first quarter.\n\n“I got an early tech, I wanted our group to feel that,” Vogel said after the game “It's not fun losing. We're a good team and we we're able to use that to our advantage and take it out on this team.”\n\nDamian Lillard had a game-high 31 points for Portland, which dropped its third straight. Hassan Whiteside had 19 points and 16 rebounds.\n\nThe game was a high-scoring affair. Both teams scored over 30 points and shot over 50% from the field in the first quarter as the Lakers built a two-point lead. In the fourth quarter, neither team cracked 30 points.\n\nThe Lakers continued to extended their lead in the first thanks in large part to the play of Kuzma. Kuzma had 20 points in the first half, a season-high for him in any half this season. He had 11 points in the second quarter as the Lakers carried a 71-64 lead into halftime.\n\nPortland opened the second half on a 5-0 run before the Lakers seized control again. James connected with Davis twice on full-court passes that led to Lakers baskets.\n\nFoul problems for the Lakers kept the Blazers in it. With seven minutes left in the third quarter, a foul by JaVale McGee put the Lakers in the penalty for the remainder of the period.\n\nA 3-pointer by CJ McCollum gave Portland their first lead since the first quarter with 5:13 left in the third. Lillard scored 12 points in the quarter.\n\nDavis had nine points in the third quarter and an assist to Kentavious Caldwell-Pope for a 3-pointer with 0.1 seconds left to give the Lakers a 103-95 lead after three.\n\n“Anytime he’s on the floor, any second he’s on the floor he makes an impact,” James said of Davis’ stretch to close the third quarter. “We expect nothing less. He’s just great.”\n\nAnthony Tolliver gave the Blazers a nice lift off the bench with a season-high 12 points, including four 3-pointers. Anfernee Simons also had a strong game off the Portland bench with 14 points and six rebounds.\n\nAnother 3-pointer by Caldwell-Pope pushed the lead to 123-112 with 2:54 left. A dunk by Davis on a lob from James pushed the Lakers to a 127-115 lead with 1:37 left.\n\nTIP-INS\n\nLakers: Despite coming into the game listed as questionable, the Los Angeles Lakers got LeBron James back on Saturday. That may help their self-described “angry and edgy” head coach Frank Vogel. After their Christmas day loss to the Clippers, the Lakers entered Saturday riding a season-worst four-game losing streak. “I started the film session telling them I’m angry and edgy,” Vogel said. “Forgive me, that’s just how I am. That’s how I was feeling yesterday, that’s how everyone was feeling. Following up with our guys that was just the pulse of the group. We’re not happy losing that Christmas day game and certainly we’re not happy losing four in a row. We have a lot of habits that we need to tighten the screws on.”\n\nTrail Blazers: The Blazers still have one win against teams above .500 this season after losing a close game on Thursday to the Utah Jazz. They came back from 23 points down to get to within one point but were unable to close it out. They made the comeback attempt while Hassan Whiteside was on the bench, in part to the play of their back-up center. “I thought Skal (Labissiere) was part of the positive momentum of the quarter. (Carmelo Anthony) and CJ (McCollum) played the whole quarter, (Labissiere) played the whole quarter, I brought (Damian Lillard) in, I think Anfernee (Simons) played the whole quarter, so really it was more about keeping the positive momentum in there and I thought Skal played well.” Stotts gave Labissiere the start on Saturday in place of Kent Bazemore. It was the 13th different starting lineup Portland has tried this season. However, Labissiere’s night was cut short less than three minutes into the game as he left with an apparent bruised left knee. He did not return.\n\nUP NEXT\n\nLakers: Host Dallas Mavericks on Sunday night.\n\nTrail Blazers: Host the Phoenix Suns on Monday night.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996006.835266
}