{
  "game_id": "0022300963",
  "espn_id": "401585591",
  "date": "Mar 15, 2024",
  "matchup": "ORL @ TOR",
  "headline": "Franz Wagner scores 19 points, Banchero adds 17 as Magic beat short-handed Raptors 113-103",
  "body": "TORONTO -- — Franz Wagner had 19 points, Paolo Banchero scored 11 of his 17 points in the third quarter and the Orlando Magic beat short-handed Toronto 113-103 on Friday night, handing the Raptors their season-worst sixth straight loss.\n\n\r\n              Jalen Suggs scored 16 points, Wendell Carter Jr. added 15 and Cole Anthony had 12 for the Magic, who have won seven of nine.\n\n\r\n              “It’s hard to win in this league, so I think it says something about our group that we’re finding ways to win games,” Franz Wagner said. “At least for me, this is the first year where we’re really doing that. That progress is really cool to see.”\n\n\r\n              Banchero also had nine rebounds and eight assists.\n\n\r\n              Gary Trent Jr. scored a season-high 31 points for the Raptors and Immanuel Quickley had 10 points and 10 assists. Quickley has a career-high eight games with 10 or more assists this season, all of them coming since he was traded to Toronto last Dec. 30.\n\n\r\n              The Raptors were without All-Star forward Scottie Barnes (left hand), center Jakob Poeltl (left pinkie), forward Chris Boucher (right knee), guard DJ Carton (right ankle), and forward RJ Barrett (personal).\n\n\r\n              Before the game, Raptors head coach Darko Rajakovic said Barrett will get as much time as he needs following the death of his younger brother, Nathan Barrett. The Barrett family said in a statement released Thursday night that 20-year-old Nathan died Tuesday. The statement did not disclose a cause of death.\n\n\r\n              “Players and coaches, all of us are in touch with RJ and his family, and they know we are here for them,” Rajakovic said. “They’re going to get any kind of support that we can offer.”\n\n\r\n              The Raptors honored Nathan Barrett with a moment of silence before tipoff.\n\n\r\n              Toronto came in having won 17 of its past 20 home meetings with the Magic, including eight of the previous nine. The Raptors led by nine in the first half but couldn’t make the lead stand up.\n\n\r\n              “As the game progressed, their offensive attributes came to the full sight,” Rajakovic said.\n\n\r\n              Banchero, who made all six of his field goal attempts in Wednesday’s win over Brooklyn, shot 2 for 8 in the first half Friday. He finished 5 for 15 from the field and went 6 for 6 at the free-throw line.\n\n\r\n              Magic coach Jamahl Mosley praised Banchero for coming through in the third after a tough first half.\n\n\r\n              “That’s growth,” Mosley said. “That’s who he is, though, a young man who is able to recognize how the game is being played, not to put his head down and get discouraged because he knows how much we believe in him. He knows how much his teammates believe in him and what he’s capable of doing, and that’s what we saw there.”\n\n\r\n              Toronto led 69-67 after Jordan Nwora’s 3-pointer with 4:26 left in the third but Banchero scored seven points as the Magic answered with a 14-0 run. Orlando took an 84-73 lead to the fourth.\n\n\r\n              “They were playing great basketball there to start the third,” Suggs said. “We withstood that and continued to move the ball, got great shots. Defensively, I think we turned up the pressure a bit and that led to good things for us.”\n\n\r\n              UP NEXT\n\n\r\n              The teams play again in Orlando on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996179.479574
}