{
  "game_id": "0021900736",
  "espn_id": "401161378",
  "date": "Feb 01, 2020",
  "matchup": "LAL @ SAC",
  "headline": "James has a triple-double, Lakers throttle Kings 129-113",
  "body": "SACRAMENTO, Calif. --  The Lakers say they are fully prepared for the steady stream of tributes for Kobe Bryant that they will surely see the rest of the season.\n\nLeBron James welcomes it, calling it a therapeutic and needed part of the Lakers' healing process.\n\nJames had another triple-double despite an off-night shooting, Anthony Davis scored 21 points and Los Angeles thumped the Sacramento Kings 129-113 on Saturday, its first win since Bryant's death.\n\n\"It's never going to feel normal. It's never going to feel the same,\" Lakers coach Frank Vogel said. \"But we got our first win since this happened. There's going to be a lot of important steps for us along the way and this was definitely one.\"\n\nJames had 15 points, 11 assists and 10 rebounds while helping Los Angeles end a two-game skid. James shot 6 of 15 and missed three of four 3-pointers but made up for it with his 11th triple-double of the season and the 92nd of his career.\n\nThe Lakers were playing the second half of a back-to-back, one night after an emotional 127-119 loss to Portland at Staples Center in their first game since Sunday's helicopter crash that killed Bryant, his daughter Gianna and seven others.\n\nDuring the first timeout less than four minutes into the game, a video of both Bryant and Gianna playing basketball was shown on the giant scoreboard as members of both the Lakers and Kings watched. The numbers 8 and 24 flashed on the court as Bryant's voice echoed through the building.\n\nTributes continued to play throughout the game as fans -- many wearing Bryant's jerseys -- repeatedly chanted his name.\n\n\"We're prepared for it. We understand it and we hope it happens every night just because of the legacy that he's left behind,\" James said. \"We're prepared for it as a team, as an organization and we're going to continue to get through it. It's our obligation just to go out and play the game, have that winning mentality because that's what he would want.\"\n\nA memorial wall with pictures of Bryant and Gianna was set up outside one of the main entrances to Golden 1 Center. Fans scrawled messages on the wall and left flowers.\n\nInside, the Lakers did their best to move forward following the tragedy that left the entire organization reeling.\n\nThey scored 44 points in the first quarter, made 14 3s and dished out 26 assists before halftime, dominating the Kings on both ends while building an 81-64 lead.\n\nAvery Bradley added 19 points, Kentavious Caldwell-Pope scored 15 and Rajon Rondo had 13 points and eight assists for Los Angeles.\n\nJames capped a fast break with a two-handed dunk in the second quarter that drew roars from the crowd, then made a long bounce pass to Caldwell-Pope for a layup. James followed that with another dunk, and Rondo added a 3-pointer.\n\n\"Tonight, it was get back on track,\" Vogel said. \"Let's get back to business and go out and get a win, no matter what.\"\n\nDe'Aaron Fox scored 24 points and Buddy Hield had 22 for Sacramento.\n\n\"That was a really good team that was unfortunately . they were locked in,\" Kings coach Luke Walton said. \"Give them credit, they came out firing.\"\n\nThe Kings got within 108-93 early in the fourth quarter before the Lakers pulled away. James had a 3-pointer, Rondo scored twice and Caldwell-Pope made three free throws.\n\n\"We wanted to put together a complete game and we did that tonight,\" James said.\n\nTIP-INS\n\nLakers: Los Angeles finished with 33 assists. . The 81 points in the first half were a season high. That also matched Bryant's career high for scoring. . Bradley had 16 points with four 3s in the first half. . Kyle Kuzma scored 12 points.\n\nKings: Eric Mika had six points and seven rebounds in his NBA debut. Mika, who had been with Stockton of the G League, was signed to a 10-day contract earlier in the day.\n\nRECORD ROAD STREAK\n\nThe Lakers have won 15 consecutive games in Western Conference road arenas, the longest such streak in NBA history according to the team's website. \"I know we've had success on the road but you do something that's never been done before in this league, that's pretty special,\" Vogel said.\n\nUP NEXT\n\nLakers: Host the Spurs on Tuesday. Los Angeles has won both games against San Antonio this season.\n\nKings: Play the Minnesota Timberwolves on Monday.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995981.805103
}