{
  "game_id": "0021701199",
  "espn_id": "400975945",
  "date": "Apr 08, 2018",
  "matchup": "MEM vs. DET",
  "headline": "MarShon Brooks scores 25 points, Grizzlies beat Pistons",
  "body": "MEMPHIS, Tenn. --  In the home finale, the Memphis Grizzlies sent their fans home happy with a rare victory in a disappointing season.\n\nMarShon Brooks scored 25 points, Dillon Brooks added 22 and the Grizzlies snapped a four-game losing streak with a 130-117 victory over the Detroit Pistons on Sunday.\n\nOf the Grizzlies' 22 wins this season, 16 were at home, a far cry from the last seven years when the final home game was just a stopping point before the playoffs.\n\n\"I understand how tough it's been for everyone,\" said center Marc Gasol, who applauded fans as he left the floor in the closing minutes, finishing with 20 points, nine rebounds and nine assists. \"For them to still show support through the bad and the worse and how bad it really got, to me it means a lot.\"\n\nKobi Simmons matched Gasol with a career-high 20 points, converting 7 of 10 shots.\n\nAnthony Tolliver led the Pistons with 19 points, and Luke Kennard added 18, including making all four of his shots from outside the arc. Henry Ellenson had a career-high 17 points.\n\nThe game featured 3-point sprees from the two teams -- both reaching season highs on made shots from beyond the arc. Memphis made 16 from outside the arc; the Pistons made a franchise-record 23, the highest number of 3-pointers for a Grizzlies opponent this season.\n\nBut throughout his postgame comments, Pistons coach Stan Van Gundy harped on the defensive effort.\n\n\"Our defense was horrendous,\" he said. \"I mean (the Grizzlies) are the next to the worst offensive team in the league, and they scored over 30 (points) in every quarter. ... Our effort was bad, our concentration was bad. We were terrible defensively.\"\n\nMemphis led by 20 in the first half, but a late rally in the second period left the Grizzlies with a 62-56 lead at the break. While Detroit got close a couple of times in the third quarter, it could never overtake Memphis. The Grizzlies led by double digits the bulk of the fourth quarter. Detroit got closer than nine points only once in the final 7 minutes.\n\n\"We weren't very locked in defensively,\" Kennard said, adding: \"We weren't engaged defensively from the start.\"\n\nInterim Grizzlies coach J.B. Bickerstaff said the victory was a reward for everyone involved as a season -- among the worst since the franchise moved to Memphis in 2001.\n\n\"The guys are deserving, but our fans are deserving too,\" Bickerstaff said. \"I think our guys understood that from the beginning of the game. Through the ups and downs, the fans have stuck with us, and they deserve the performance our guys put on (Sunday).\"\n\nTIP-INS\n\nPistons: F Blake Griffin missed his sixth straight game with a right ankle bone bruise. ... Andre Drummond posted his 10th straight double-double with 12 points and 18 rebounds. ... Ellenson's previous career high was 15 points on April 7, 2017, at Houston.\n\nGrizzlies: Ben McLemore started the game 4-4, including a trio of 3-pointers, and finished with 13 points. ... While Gasol was one rebound and an assists shy of a triple-double, Dillon Brooks also flirted with the standard. In addition to his 22 points, he had eight rebounds and eight assists.\n\nOH, HENRY\n\nEllenson, a 6-foot-11 forward in his second season out of Marquette, collected his career-high by converting 6 of 10 shots, including 4 of 6 from outside the arc. He entered the game averaging 3.1 points. \"He's really a good player. It's not a secret,\" Tolliver said about Ellenson, the 18th overall pick in the 2016 draft. \"There's a reason why was such a high draft pick. He has a lot of potential. He's just a young guy trying to find his way.\"\n\nSEASON-BEST NIGHT\n\nThe Grizzlies recorded season-highs in several categories, including points (130), field goal percentage (57.8 percent) and 3-pointers made (16). They also had a season-best 36 assists.\n\nUP NEXT\n\nPistons: Host Toronto on Monday night.\n\nGrizzlies: Hit the road for their final two games starting in Minnesota on Monday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992705.968738
}