{
  "game_id": "0021800537",
  "espn_id": "401071213",
  "date": "Dec 30, 2018",
  "matchup": "MIA vs. MIN",
  "headline": "Towns has huge night, Minnesota tops Miami 113-104",
  "body": "MIAMI --  Karl-Anthony Towns had a perfect day, unlike many Minnesota fans.\n\nHis beloved Philadelphia Eagles earned the chance to defend their Super Bowl title -- and got that postseason berth because Minnesota lost its season finale, which kept the Vikings from the playoffs.\n\n\"Fly Eagles Fly,\" Towns said.\n\nVikings fans probably weren't thrilled to hear that. Timberwolves fans, after the night Towns had, may forgive him.\n\nTowns' monster game -- 34 points, 18 rebounds, seven assists and six blocked shots -- led Minnesota past the Miami Heat 113-104 on Sunday night. He became the first player to post such a stat line since Kareem Abdul-Jabbar, who had 35 points, 19 rebounds, nine assists and eight blocks for the Los Angeles Lakers against Phoenix on Nov. 14, 1975.\n\n\"I wanted to make the right plays that we needed to win,\" Towns said. \"I'm glad I was able to make them.\"\n\nHe made them in bunches.\n\nWhen Miami cut an 11-point Minnesota lead to two midway through the fourth, Towns took over: a short hook stopped what was a 9-0 Heat run, and was soon followed by a three-point play and then a 3-pointer to restore the 11-point lead. Miami didn't challenge again.\n\n\"The stat line was very impressive by itself,\" Heat coach Erik Spoelstra said. \"But the impact of the timeliness of his plays ... every time it seemed we got it to six, he had a big bucket or a rebound or something that kept their momentum going.\"\n\nRobert Covington scored 16 and Taj Gibson added 14 for Minnesota. The Wolves also got 13 apiece from Andrew Wiggins and Dario Saric, while Tyus Jones scored 12.\n\nDwyane Wade led Miami with 21 points. Josh Richardson scored 17, Derrick Jones Jr. added 16 and Hassan Whiteside grabbed 13 rebounds for the Heat -- who ended the 2018 calendar year with a 43-43 record.\n\n\"We made strides this month,\" Wade said. \"The loss can take away from the success of this month, but we're making strides. We want to make sure in the new year, we understand how well we can play.\"\n\nMiami led only once, and that was for all of 25 seconds. The Heat missed their first eight shots, and gave up 24 points off turnovers.\n\n\"I thought our defense was good,\" Wolves coach Tom Thibodeau said. \"I thought the start of the game was obviously important for us. It's hard to win on the road and this team has been playing great basketball. So it's a good solid win for us.\"\n\nTIP-INS\n\nTimberwolves: It was the 13th time Towns has posted at least 30 points and 15 rebounds in a game. Minnesota, somewhat surprisingly, is now only 6-7 in such contests. ... Minnesota forced 20 turnovers, while committing only 11.\n\nHeat: Chris Bosh was back in the stands for a second consecutive game, plus was with Miami at practice on Saturday. ... Miami missed its first eight shots. ... Whiteside got three stitches over his left eye in the first quarter. He returned to the game. ... James Johnson missed the game with an illness. Jones Jr. started in his place, giving Miami its 15th starting lineup in 35 games.\n\nWAITERS CLEARED\n\nHeat guard Dion Waiters returned after two days of practice with Miami's G League affiliate in Sioux Falls, complained about how cold it was there, but more importantly declared himself ready to play again. \"I feel great. You ask those guys out there, I don't think I missed a shot. I'm talking about a lot of deep shots, too,\" Waiters said. He hasn't been in a game for the Heat since Dec. 22, 2017 -- but may make his season debut Wednesday in Cleveland.\n\nTWO POINTS\n\nMinnesota was without its two primary point guards: Derrick Rose missed the game with a right ankle sprain, and Jeff Teague missed his seventh consecutive game with left ankle inflammation. Rose hasn't appeared in a game at Miami since Dec. 6, 2016. Also out for Minnesota was Keita Bates-Diop, who was ill.\n\nUP NEXT\n\nTimberwolves: Visit New Orleans on Monday.\n\nHeat: Visit Cleveland on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995249.739528
}