{
  "game_id": "0022300606",
  "espn_id": "401585234",
  "date": "Jan 22, 2024",
  "matchup": "MIL @ DET",
  "headline": "Antetokounmpo's triple-double helps Bucks pull away late for 122-113 win over Pistons",
  "body": "DETROIT -- — Giannis Antetokounmpo had a triple-double and Khris Middleton added 26 points as the Milwaukee Bucks pulled away late and beat the Detroit Pistons 122-113 on Monday night.\n\n\r\n              Antetokounmpo finished with 31 points, 17 rebounds and 10 assists as the Bucks won for the fifth time in six games. Brook Lopez finished with 15 points and 11 rebounds.\n\n\r\n              “Giannis just took over the game in the last five minutes,” Bucks coach Adrian Griffin said. “He's a phenomenal player, but he's also a winning player who makes winning plays when we need them. He got to the line, he found open teammates, he got on the offensive glass and he was getting stops and blocks at the other end.”\n\n\r\n              Middleton now has 12,012 points for the Bucks, moving past Glenn Robinson Sr. for third place in franchise history.\n\n\r\n              “That's pretty cool — I'm happy,” he said. “I still have a lot I think I can do for this franchise and for our city.”\n\n\r\n              Griffin paid tribute to Middleton's determination.\n\n\r\n              “It's remarkable when you think about him being the 38th pick in the draft. It is a testament to what being a pro is all about,” Griffin said. “It takes a lot to come from where he started — he was drafted right here by the Pistons — to where he is now, an NBA champion.”\n\n\r\n              Marcus Sasser led the Pistons with 23 points, and fellow reserve Isaiah Stewart had 19 points and eight rebounds. Jaden Ivey led the starters with 17 points as Detroit lost to Milwaukee for the second time in three nights.\n\n\r\n              “We're competing with (the best) teams, but we're not closing,” Pistons coach Monty Williams said. “That has to be our next step.”\n\n\r\n              Lopez's 3-pointer put Milwaukee up 110-109 with 4:59 left, and Antetokounmpo extended the lead to three points from the free-throw line before Malik Beasley's 3-pointer made it 117-111 with 3:30 to go.\n\n\r\n              Detroit struggled offensively and a 3-pointer by Middleton made it a 15-2 run and an 11-point Milwaukee lead.\n\n\r\n              “The last five or six minutes, we just stopped making winning plays,” Sasser said. “We gave up too many offensive rebounds and gave them too many second-chance points.”\n\n\r\n              Milwaukee led by as many as nine points in the third quarter, but their struggles from long distance kept the Pistons in the game. The Bucks were 3 for 13 from 3-point distance in the quarter and finished the period with an 89-85 lead.\n\n\r\n              Detroit took a 96-95 lead on a driving layup from Sasser with 9:24 to play, and he and Ivey continued to score over Milwaukee’s post players. However, they went 1-10 in the last five minutes, missing all five 3-point attempts.\n\n\r\n              “We took some transition 3s and didn't make them work,” Williams said. “I think that got them into a rhythm.”\n\n\r\n              Milwaukee hit 3 of 17 3-point attempts in the first half and still led 58-56 behind 13 points from Antetokounmpo. \n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host the Cleveland Cavaliers on Wednesday and Thursday.\n\n\r\n              Pistons: Host the Charlotte Hornets on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996128.896053
}