{
  "game_id": "0021400735",
  "espn_id": "400579027",
  "date": "Feb 04, 2015",
  "matchup": "CHI @ HOU",
  "headline": "Harden scores 27 points and the Rockets top Bulls, 101-90",
  "body": "HOUSTON -- Chicago Bulls coach Tom Thibodeau watched in disappointment as Houston Rockets guard James Harden picked apart his team's defense.\n\"Guys like that, you've got to guard them with your whole team, and they still have the ability to make,\" Thibodeau said. \"You have to stay the course against them.\"\nHarden's 27 led the Rockets to a 101-90 victory over the Bulls on Wednesday night. Fifteen came in a pivotal second quarter that helped the Rockets build a lead that they never relinquished.\nThe Bulls lost their third straight game for the first time all season and have now lost four of five. The Rockets have won five of six.\nHarden overwhelmed the Bulls in the second, menacing small forward Jimmy Butler in multiple one-on-one battles to score 13 consecutive points in the fading minutes of the first half.\nHe was more excited about the Rockets' defense that held a versatile Bulls offense to just 90 points.\n\"Every night, that's our motto is to be aggressive,\" Harden said. \"We have so many guys that can come in and play that we don't worry about getting tired.\"\nFatigue and a lack of consistent effort seemed to be a common theme in the Chicago locker room following the loss.\n\"We can't afford to have those lulls,\" Thibodeau said.\nJimmy Butler led Chicago with 27 points, and Derrick Rose scored 23, playing in his 12th consecutive game for the first time since the 2010-11 season.\n\"It shouldn't be anywhere near this, knowing how talented we are and knowing how much guys really want to win,\" Rose said. \"We've got time, but we've got to figure out a way out.\"\nDespite the win, the Rockets missed Dwight Howard's boards. The center was out for a fifth straight game with a right knee injury and Chicago's big men dominated the glass, 60-47.\nJoakim Noah pulled down a season-high 19 rebounds in 32 minutes. However, he had just one point, finishing 0 for 8 shooting.\n\"We're playing hard in spurts, but we just can't do it for 48 minutes right now,\" Noah said. \"We've got to figure it out or it's going to be a long year.\"\nIn all other categories, however, the Rockets owned Chicago's big men, outscoring the Bulls 50-28 in the paint and notching eight blocks to just five from Chicago, who entered the game as the league's leaders in blocks at 6.7 per game.\n\"I thought we tried to attack the basket well, especially early,\" Rockets coach Kevin McHale said. \"We weren't getting to the line very much, but we just kept attacking.\"\nTIP-INS\nBulls: F Paul Gasol had a double-double in his 10th consecutive game, finishing with 16 points and 12 rebounds. ... F Mike Dunleavy missed his 17th straight game with a right ankle injury suffered on Jan. 1.\nRockets: F Trevor Ariza complemented Harden's performance with 20 points, matching Harden's 3-for-5 line from beyond the arc. ... Rockets legend Hakeem Olajuwon sat courtside, next to the broadcast table with former Rocket Shane Battier and former Rockets head coach Jeff Van Gundy.\nBEST IN THE WEST, AGAIN\nHarden earned his second consecutive West Conference Player of the Month award, becoming the first player in Rockets franchise history to win in consecutive months. Harden averaged 25.8 points, 6.7 assists, 4.7 rebounds and 2.2 steals per game, leading the Rockets to an 11-6 record in January.\nHEADBAND OF BROTHERS\nOn a headband giveaway promotional night in the Toyota Center, Houston's \"Headband of Brothers,\" in veterans Corey Brewer, Josh Smith and Jason Terry all made solid contributions. With Smith and Brewer both scoring nine points, the trio combined for 23 points and eight assists, with Smith pulling down 11 rebounds.\nLIMITING TURNOVERS\nThe Rockets turned the ball over just six times, compared to 12 from the Bulls. Harden attributed the improvement to the team's newfound decisiveness and confidence in their decisions.\nUP NEXT\nBulls: Visit New Orleans on Saturday before finishing a six-game road trip in Orlando, Florida, on Sunday.\nRockets: Home against Milwaukee Bucks on Friday.",
  "source": "espn_api",
  "crawled_at": 1764991671.103115
}