{
  "game_id": "0022401096",
  "espn_id": "401705662",
  "date": "Mar 31, 2025",
  "matchup": "HOU @ LAL",
  "headline": "Lakers hold off Rockets 104-98 with 6 3-pointers apiece from Dorian Finney-Smith, Gabe Vincent",
  "body": "LOS ANGELES -- — Luka Doncic had 20 points and nine assists, and Gabe Vincent added 20 points on six 3-pointers in the Los Angeles Lakers’ 104-98 victory over the Houston Rockets on Monday night.\n\n\r\n              LeBron James finished with 16 points and eight rebounds for the Lakers, who solidified their hold on fourth place in the Western Conference.\n\n\r\n              Dorian Finney-Smith also scored a season-high 20 points and hit six 3-pointers while Los Angeles sent second-place Houston to only its second loss in 14 games.\n\n\r\n              After James hit two free throws with 11.1 seconds left to put the Lakers up 102-98, he soared across the key to block Alperen Sengun's layup attempt. Dillon Brooks then missed a 3-point attempt to seal the Lakers' 29th home victory.\n\n\r\n              Amen Thompson scored 20 points and Brooks had 16 for the Rockets, who had won three straight.\n\n\r\n              The Lakers' two superstars both looked weary, and much of LA's offense consisted of Doncic and James drawing defenders before kicking to Finney-Smith and Vincent for 3-point attempts.\n\n\r\n              Neither team led by more than eight points all night, but Los Angeles nursed a small lead throughout the final 17 minutes of play.\n\n\r\n              Takeaways\r\n              Rockets: They remained defensively tenacious in the second game of a road back-to-back, but their offense was lacking. Leading scorer Jalen Green had only nine points on 4-of-13 shooting, and Sengun managed just 14.\n\n\r\n              Lakers: They sometimes looked exhausted in their 19th game in 35 days, but got the job done.\n\n\r\n              Key moment\r\n              After Brooks missed one of two free throws with 20.1 seconds left to trim Los Angeles’ lead to 100-98, the Rockets nearly tied up Finney-Smith for a jump ball — but the Lakers called a timeout first.\n\n\r\n              Key stat\r\n              Finney-Smith posted his Lakers highs in points and 3-pointers.\n\n\r\n              Up next\r\n              The Rockets host Utah on Wednesday. After their first back-to-back days off in three weeks the Lakers host Golden State on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997346.1761
}