{
  "game_id": "0022400575",
  "espn_id": "401705141",
  "date": "Jan 16, 2025",
  "matchup": "LAC @ POR",
  "headline": "Norman Powell scores 23 points to help the Clippers beat the Trail Blazers 118-89",
  "body": "PORTLAND, Ore. -- — Norman Powell scored 23 points, James Harden had 19 points and the Los Angeles Clippers beat the Portland Trail Blazers 118-89 on Thursday night.\n\n\r\n              The Clippers routed Portland a night after beating Brooklyn at home by a franchise-record 59 points.\n\n\r\n              Dalano Banton led the Trail Blazers with 23 points. Scoot Henderson had 16 points.\n\n\r\n              Kobe Brown's dunk in the fourth pushed the Clippers to their biggest lead at 34.\n\n\r\n              Takeaways\r\n              Clippers: Clippers guard Norman Powell formed a special relationship with Blazers coach Chauncey Billups during Billups’ first season as Portland’s coach. With Powell averaging a career-high 23.7 points, Billups is loving what he’s seen from his former protege. “(I’m) really proud,” Billups said. “I didn’t get to coach him for that long, but we got very, very close in that short time. And he always shared with me that this is the player he could be.”\n\n\r\n              Blazers: Portland’s Shaedon Sharpe entered the game having scored 20 points in five straight games. Clippers coach Ty Lue came into the game aware of what Sharpe can do. “We’ve got to make it work. You know, he can do it all,” Lue said of Portland’s young guard. Sharpe finished with 12 points.\n\n\r\n              Key monent\r\n              Ivica Zubac had two blocks on the same possession in the first half. The first block came on a dunk attempt by Scoot Henderson and the second came only seconds later when Deandre Ayton picked up the loose ball and tried a dunk of his own.\n\n\r\n              Key stat\r\n              Portland's Anfernee Simons went 0 for 9 from the field and failed to score.\n\n\r\n              Up next\r\n              The Clippers host the Lakers on Sunday night. The Trail Blazers host Houston on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998034.672322
}