{
  "game_id": "0022400054",
  "espn_id": "401703423",
  "date": "Dec 03, 2024",
  "matchup": "TOR vs. IND",
  "headline": "Scottie Barnes scores career-high 35 as Raptors win 122-111, extend Pacers' road skid to 7",
  "body": "TORONTO -- — Scottie Barnes scored a career-high 35 points, RJ Barrett added 29 and the Toronto Raptors never trailed in a 122-111 win over the Pacers on Tuesday night that extended Indiana’s road losing streak to seven.\n\n\r\n              Jakob Poeltl had 17 points and 10 rebounds, and Ochai Agbaji scored 13 points for the Raptors, who led by 24 points in the third quarter.\n\n\r\n              Barnes shot 13 for 20 and had nine assists and six rebounds. His previous scoring high was 32 points, set twice.\n\n\r\n              Tyrese Haliburton scored 30 points for the Pacers, who have not won away from home since beating Dallas on Nov. 4. Bennedict Mathurin had 17 points, Myles Turner scored 16 and Obi Toppin added 15.\n\n\r\n              Indiana’s Pascal Siakam fouled out with 13 points on 4-of-13 shooting against his former team. He was called for a technical foul in the fourth quarter.\n\n\r\n              The Raptors finished 1/3 in NBA Cup group play for the second straight year. The Pacers fell to 0-4 in the tournament.\n\n\r\n              Takeaways\r\n              Pacers: Last year, Indiana went 4-0 in group play and advanced to the championship game of the debut In-Season Tournament, losing to the Los Angeles Lakers. The Pacers lost their four group games this season by a combined 60 points.\n\n\r\n              Raptors: Toronto won its fourth straight at home and improved to 6-4 there this season. The Raptors are 1-11 on the road.\n\n\r\n              Key moment\r\n              Agbaji’s 3-pointer with 5:55 left in the fourth gave Toronto some breathing room after Indiana cut the deficit to two points. He finished 3 for 3 from long range.\n\n\r\n              Key stat\r\n              Toronto scored 12 points off eight Indiana turnovers in the first quarter and added five more points off four Pacers miscues in the second period. Indiana finished with 21 turnovers, leading to 23 points for Toronto.\n\n\r\n              Up next\r\n              Indiana visits Brooklyn on Wednesday. Toronto hosts Oklahoma City on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996984.5865111
}