{
  "game_id": "0022200808",
  "espn_id": "401468963",
  "date": "Feb 06, 2023",
  "matchup": "DET vs. BOS",
  "headline": "Jayson Tatum scores 34, Celtics cruise past Pistons 111-99",
  "body": "DETROIT -- — Jayson Tatum started slow and finished strong with 34 points, 11 rebounds and six assists, leading the Boston Celtics to a 111-99 victory over the Detroit Pistons on Monday night.\n\n\r\n              “You know at some point, he’s going to be a superstar,\" Pistons coach Dwane Casey said.\n\n\r\n              The All-Star forward missed his first five shots and had as many fouls (three) as field goals after missing 10 shots in the first half. Tatum made three 3-pointers and an array of driving layups in the third, scoring 18 points in the quarter to turn a seven-point halftime lead into a 18-point cushion.\n\n\r\n              “He took what the defense gave him,\" Celtics interim coach Joe Mazzulla said. “He got downhill. He was aggressive. I thought he took some really good shots early in the shot clock to keep his confidence going.\"\n\n\r\n              With Tatum on the bench, Detroit rallied to pull within seven points midway through the fourth quarter. Seconds after entering the game, the All-NBA player promptly set up Robert Williams for a dunk on his fourth assist to help stunt the potential comeback.\n\n\r\n              Tatum was 11 of 23 overall, 3 of 9 on 3-pointers, and 9 of 10 at the line.\n\n\r\n              “A guy like that, you give him any opportunity, he’s going to take it,\" Detroit guard Killian Hayes said. “He didn't make a 3-pointers in the first half, and then he hit one and he's hard to guard. A guy like that, you can't let him get going.\"\n\n\r\n              Celtics guard Jaylen Brown, who averages 27 points, missed the game with a non-COVID illness. Sam Hauser filled in, making his first start in two seasons, and had five 3-pointers in the first half when he scored all of his 15 points.\n\n\r\n              Hauser said he was informed of the opportunity about 90 minutes before the game started.\n\n\r\n              “It kind of took me by surprise,\" he said. “I thought they would maybe plug someone else in to start. They called my number and I was ready for it. It was my first start ever in the NBA, and it was a cool moment.\"\n\n\r\n              Boston reserves Marcus Smart and Luke Kornet (left ankle) missed the game with ankle injuries.\n\n\r\n              Derrick White had 23 points, and reserve Malcolm Brogdon and Williams scored 15 points apiece for the Eastern Conference-leading Celtics, who lost four of their previous six games.\n\n\r\n              “For 95% of the game, I thought we did a great job of taking away the momentum plays that Detroit is capable of making,\" Mazzulla said.\n\n\r\n              Bojan Bogdanovic scored 21 for the Pistons, who have won just one-fourth of their games and are likely vying with Houston and Charlotte for the No. 1 pick and a chance to select 7-foot-3 French phenom Victor Wembanyama.\n\n\r\n              Detroit rookies Jaden Ivey had 14 points and five assists, while Jalen Duren scored seven points and grabbed 14 rebounds. Hayes scored 17 points and fellow reserve Saddiq Bey added 14 for the Pistons, who have lost eight of their last 10 games.\n\n\r\n              BEY OFF THE BENCH\n\n\r\n              Casey likes what he's seeing with Bey, a former starter, settling into being a backup.\n\n\r\n              “He’s found a rhythm and a niche with the second unit,\" Casey said. “Once we are ready to play for playoff positioning and championships, I feel like that’s going to be his role with us.\"\n\n\r\n              TIP-INS\n\n\r\n              Celtics: The 24-year-old Tatum is the youngest player in team history to be a four-time All-Star. ... Hauser's younger brother, Joey, is a senior forward at Michigan State.\n\n\r\n              Pistons: The NBA rescheduled Detroit's home game against Washington to March 7 that was postponed last week when the Pistons were stranded in Dallas due to a winter storm.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Philadelphia on Wednesday night.\n\n\r\n              Pistons: Play at Cleveland on Wednesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995262.399876
}