{
  "game_id": "0021900632",
  "espn_id": "401161274",
  "date": "Jan 18, 2020",
  "matchup": "TOR @ MIN",
  "headline": "VanVleet scores 29 in return as Raptors beat Wolves 122-112",
  "body": "MINNEAPOLIS --  Fred VanVleet knew he was on a minutes restriction as he made his return from a hamstring injury after missing five games. The Raptors guard tried not to think much about it while on the court.\n\nInstead, he made the most of the minutes he did play.\n\nVanVleet led Toronto with 29 points as the Raptors beat the Minnesota Timberwolves 122-112 on Saturday night.\n\nKyle Lowry added 28 points and seven assists while Norman Powell scored 20 points off the bench for the Raptors, who have won three straight games.\n\nMinnesota's Andrew Wiggins recorded his first career triple-double. He had 18 points, a career-high 11 assists and 10 rebounds. Rookie Jarrett Culver had 26 points for the Timberwolves, who have lost five straight.\n\nVanVleet's injury sidelined him for five games before Saturday. He was 11 of 16 from the field and 7 of 8 from 3-point range.\n\n\"It looked like it was just riding a bike,\" Raptors coach Nick Nurse said of VanVleet. \"He was really good.\"\n\nNurse said pregame that VanVleet would play between 25 to 28 minutes. He played 28:30 -- the most of any Raptor on Saturday.\n\n\"I think playing at ease like that allowed me to not press and just let the game come to me,\" said VanVleet, who scored 10 points in the fourth quarter.\n\nToronto took a five-point lead into the fourth quarter thanks in large part to Lowry's efforts in the third. Lowry scored 17 points in the quarter to erase a four-point halftime deficit.\n\nThe Raptors pushed the lead to as many as 22 in the fourth. Serge Ibaka and Powell each had six points off the bench during a 21-6 stretch to open the period.\n\n\"They kind of extended the lead and it was kind of hard to come back after that,\" Wiggins said.\n\nSaturday was the second night of back-to-back games for both teams. Toronto beat Washington 140-111 on Friday, while Minnesota lost 116-114 at Indiana.\n\nMinnesota got big first quarters from Wiggins and Culver. Wiggins had 11 points on 4-of-4 shooting and added five assists in the quarter. Culver led Minnesota with 14 points in the first, including 4 of 6 from deep.\n\n\"He shot ten 3s and made four,\" Wolves coach Ryan Saunders said of Culver. \"I was happy with him tonight.\"\n\nTIP-INS\n\nRaptors: Toronto scored 58 points in the paint. . Powell's 20-point game was the fourth time this season he's topped 20 points while coming off the bench. . Pascal Siakam and Marc Gasol both picked up technical fouls with 1:01 to play in the first half.\n\nTimberwolves: G Allen Crabbe was inactive Saturday with an illness. Minnesota acquired Crabbe on Thursday in a trade with Atlanta that sent Jeff Teague and Treveon Graham to the Hawks. . Culver topped 20 points for the fourth time this season.\n\nCHEERING SECTIONS\n\nRaptors coach Nick Nurse grew up in Carroll, Iowa, and was initially planning on a big group of family members making the 4-hour drive to Minneapolis. But those plans were thwarted by a snowstorm Friday night.\n\n\"There were at least one or two buses coming up from my hometown and that all got canceled,\" Nurse said.\n\nRaptors guard Matt Thomas only played 3 minutes but had his own fan club that was vocal the few times he stepped on the court. Thomas grew up in Onalaska, Wisconsin, 145 miles from Minneapolis.\n\nQUIET KAT\n\nTimberwolves center Karl-Anthony Towns had 12 points in the first half but was held scoreless after halftime. It was Towns' second game back after missing 15 games with a combination of a knee injury and illness.\n\n\"I think tonight still shows that I've got to find a way to implement myself back into the offense,\" Towns said.\n\nUP NEXT\n\nRaptors: Visit Atlanta on Monday night.\n\nTimberwolves: Host Denver on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995609.0622761
}