{
  "game_id": "0021500057",
  "espn_id": "400827944",
  "date": "Nov 03, 2015",
  "matchup": "TOR @ DAL",
  "headline": "Lowry, Raptors start 4-0 for 1st time, beating Mavs 102-91",
  "body": "DALLAS -- Kyle Lowry wasn't sure what kind of start Toronto would have with plenty of new faces.\nHow about the best one in franchise history.\nLowry scored 27 points, and the Raptors spoiled the home opener in Dallas, beating the Mavericks 102-91 on Tuesday night and opening the season 4-0 for the first time.\n\"I think it was the start that we needed,\" said Lowry, a former Dallas rival in Houston and now in his fourth season with Toronto. \"Either we could have a real good start, or a tough start with pretty much 10 new guys. But I think we've done a good job of just staying focused with our principles.\"\n\nThe Raptors took the lead for good on a 12-0 run that started in the middle of the fourth quarter. Jonas Valanciunas had six of his 16 points during the decisive stretch.\nThe Mavericks went almost 4 minutes without a basket after Dirk Nowitzki hit a 3-pointer for an 86-82 lead. Nowitzki finished with 18 points.\nDeMar DeRozan scored 20 points, and Luis Scola had 19 points and 12 rebounds for the Raptors, who opened with three straight wins twice in their first 20 seasons.\nLowry had a game-high 10 assists, and Toronto held Dallas to 6-of-22 shooting in the fourth quarter and 38 percent for the game. It's the second time the Raptors have held their opponent under 40 percent.\n\"They made it more their type of game, physical, grinding and a lot of physical contact,\" Dallas coach Rick Carlisle said. \"They turned it into a boxing match, and we needed it to be a basketball game.\"\nDallas forward Dwight Powell, a Toronto native, had his first career double-double with 10 points, all in the first half, and 10 rebounds.\nValanciunas started the decisive run with a layup on an assist from Lowry and finished it with a tip-in and a pair of free throws after he was fouled getting a defensive rebound.\n\"We are off to a great start, but we have to remember this is a marathon, not a sprint,\" Toronto coach Dwane Casey said.\nTAKING IT EASY\nDallas forward Chandler Parsons played 14 minutes in the first half of his second game after offseason right knee surgery, but didn't play after halftime for precautionary reasons. He scored nine points after getting two in 12 minutes in his debut Sunday at the Los Angeles Lakers.\n\"I'd almost rather play the second half to be honest,\" Parsons said. \"But a team develops their rhythm in the first half, and you can't just throw a guy out there in the second half and change it on them.\"\nMUTUAL ADMIRERS\nCarlisle became Dallas' leader in coaching wins the same night Casey, his former assistant, did that for Toronto. Carlisle passed Don Nelson with win No. 340 on Sunday at the Lakers, and Casey topped Sam Mitchell with No. 157 against Milwaukee. Casey spent three seasons under Carlisle, leaving after they won a championship together in 2011.\n\"He has been a major factor in rebuilding this team,\" Carlisle said of Casey, who called his former boss \"my friend, a colleague, a mentor, a guy who I learned a lot from.\"\nDALLAS HOME DEBUTS\nDeron Williams, who starred at a Dallas-area high school, had 13 points in his home debut for the Mavericks. The other two new starters, Wesley Matthews and Zaza Pachulia, struggled with foul trouble, finishing with five each. Matthews had eight points, and Pachulia scored four.\nTIP-INS\nRaptors: Tuesday was the 20th anniversary of the first game in franchise history. Toronto beat the then-New Jersey Nets 94-79 at SkyDome. ... Terrence Ross scored four points on the day the team announced his multiyear contract extension. He beat a deadline that would have made him an unrestricted free agent on July 1.\nMavericks: Carlisle is 7-7 in home openers, including 4-4 with Dallas. The Mavericks had a four-game winning streak in home openers snapped. ... Williams' 3-pointer in the second quarter gave him 1,000 for his career.\nUP NEXT\nRaptors: At Oklahoma City on Wednesday night.\nMavericks: Home against Charlotte on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994774.314532
}