{
  "game_id": "0022300597",
  "espn_id": "401585225",
  "date": "Jan 20, 2024",
  "matchup": "CHI vs. MEM",
  "headline": "Dosunmu, DeRozan lead way as Bulls pound Grizzlies, 125-96",
  "body": "CHICAGO -- — The Chicago Bulls know what they have to do to come away with a win when Zach LaVine is not in the lineup.\n\n\r\n              They're getting plenty of practice, after all.\n\n\r\n              Ayo Dosunmu scored 20 points, DeMar DeRozan added 18 and Chicago pounded the Memphis Grizzlies 125-96 on Saturday night.\n\n\r\n              The Bulls regrouped after falling behind in the third quarter and went on a 17-0 run to pull away to their sixth win in eight games, even though LaVine sat out because of a sprained right ankle.\n\n\r\n              The two-time All-Star was hurt Thursday night in a victory at Toronto, and coach Billy Donovan had no timetable for his return. LaVine also missed 17 games because of inflammation in his right foot before returning two weeks ago. The Bulls went 10-7 in that span and are 11-8 overall in games he has missed this season.\n\n\r\n              “You just find a way,” Patrick Williams said. “The end goal is to win the game (no matter) who's playing, who's not playing. That's your job as a team, that's your job as a player is to win games. We're all trying to find a way to do that. Would love to have him here. Can't wait ‘til he gets back. But we’ve got to hold down the fort.”\n\n\r\n              Coby White scored 17 points for Chicago. Williams added 15 and Andre Drummond chipped in with 15 points and 10 rebounds. The Bulls had seven players score in double figures and dished out 32 assists, just the sort of balance they needed with one of their top players unavailable.\n\n\r\n              “I thought we sustained it for the whole game, which was good to see,” coach Billy Donovan said. “I know we didn't shoot it particularly well to start the game, but I thought we were really generating a lot of good looks. They missed a lot of 3s as well, so there wasn't much separation there in that first quarter. But I liked the fact that we kept staying with it and were really unselfish and guys moved the ball, shared it. Everybody kind of got involved in one way or another.”\n\n\r\n              Jaren Jackson Jr. led Memphis with 26 points after scoring 36 points Thursday night in a loss at Minnesota. Luke Kennard and Vince Williams Jr. each had 14 points.\n\n\r\n              “I thought we gave great effort in the first half, only gave up 50 points in the first half,” coach Taylor Jenkins said. “I thought our defensive gameplan execution was really good. Our offense really just set us back tonight.”\n\n\r\n              Scotty Pippen Jr., playing in the arena where his father’s No. 33 hangs from the rafters, had three points in five minutes. \n\n\r\n              The Grizzlies — with three of their top four scorers sidelined — lost for the fourth time in five games. Memphis is 9-24 without Ja Morant, who served a 25-game suspension from the NBA for off-the-court behavior to start the season and suffered a season-ending shoulder injury. The Grizzlies were 6-3 with him. Marcus Smart ( finger ) and Desmond Bane ( ankle ) are out at least another month.\n\n\r\n              Chicago went up by 15 in the second quarter and took a 50-40 lead to the locker room before Memphis went on a run early in the third. \n\n\r\n              The Grizzlies led 55-53 after Jackson's three-point play and floater with 8:33 remaining in the quarter. But the Bulls quickly regained control.\n\n\r\n              DeRozan started the big run with a fadeaway jumper. White, Dosunmu and Alex Caruso hit consecutive 3s, and just like that, the Bulls were on their way.\n\n\r\n              White drove for a dunk. Vucevic scored on a tip-in, and DeRozan nailed a 23-footer to cap the run, making it 70-55 with 5:22 remaining in the third.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At Toronto on Monday night.\n\n\r\n              Bulls: At Phoenix on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995893.253068
}