{
  "game_id": "0022000460",
  "espn_id": "401267620",
  "date": "Feb 20, 2021",
  "matchup": "SAC @ CHI",
  "headline": "LaVine scores 38, Bulls hold off struggling Kings 122-114",
  "body": "CHICAGO -- — Zach LaVine scored 38 points and the Chicago Bulls beat the slumping Sacramento Kings 122-114 on Saturday night.\n\n\r\n                    The Bulls bounced back after getting dominated by Joel Embiid in a tight loss at Eastern Conference-leading Philadelphia on Friday night. They withstood a fourth quarter push and handed the Kings their sixth loss in a row.\n\n\r\n                    LaVine, making a case for his first All-Star invitation, hit 15 of 20 shots in his fourth straight game with 30 or more points. He also had three steals.\n\n\r\n                    “Zach LaVine is deserving of being an All-Star,” coach Billy Donovan said. “He has played as well as anybody. I can't imagine that there's been many guys that have played better than him.” \n\n\r\n                    LaVine will find out Tuesday if he made it when the reserves — voted on by the coaches — are announced.\n\n\r\n                    “You just want to be recognized,” he said. “I feel like I played at an All-Star level the last couple of years and I don't think that (many) people have had better seasons than me over the last couple years in the Eastern Conference. It comes down to winning. You have to show that. I'm glad that we're in the hunt.”\n\n\r\n                    Coby White scored 19 points, hitting 5 of 8 3-pointers. Thaddeus Young added 18 points and made a key layup in the closing minute.\n\n\r\n                    Patrick Williams hit the shot of the night when he buried a 52-footer at the end of the third quarter, and the Bulls improved to 6-9 at the United Center.\n\n\r\n                    Sacramento’s Marvin Bagley III tied a season high with 26 points and grabbed 11 rebounds. Buddy Hield scored 23 points, and De’Aaron Fox added 20 points and nine assists. The Kings remained winless since they beat Kawhi Leonard and the Los Angeles Clippers on Feb. 8.\n\n\r\n                    “It's always concerning, obviously, when you're stringing together some losses like this,” Fox said. “You got to keep the course. Obviously, no one's gonna feel sorry for you — especially around this league. If you keep your head down, people will keep you down. Every team in this league will just continue to keep you down. ... There are stretches in the game where we look really good as a team, but we have to be able to do that for as long as possible.\"\n\n\r\n                    HANGING ON\n\n\r\n                    The Bulls led 101-92 early in the fourth quarter before Sacramento scored seven straight, Bagley's driving layup cutting it to two.\n\n\r\n                    Garrett Temple stopped that spurt with a 3-pointer. LaVine answered Fox's layup with one of his own, and White followed with a 3 for Chicago to make it 109-101 with just under six minutes remaining.\n\n\r\n                    After a three-point play by Sacramento's Tyrese Haliburton, LaVine scored seven points in just over a minute to help Chicago stretch the lead to 116-106.\n\n\r\n                    The Kings scored six straight, with Fox hitting two free throws to make it a four-point game with 1:12 remaining. A driving Young hit a floater to make it 118-112 with 45 seconds remaining. \n\n\r\n                    Temple then blocked Hield's 3. LaVine hit a 16-footer to bump the lead to eight and the Bulls hung on for the win.\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: F Harrison Barnes (strained left foot) — Sacramento's second-leading scorer — missed his second consecutive game. F Richaun Holmes (sore right knee) missed his third in a row, while F Glenn Robinson III (sore right knee) was also unavailable. \n\n\r\n                    Bulls: Chicago made 11 of 23 3-pointers. ... The Bulls were 13 of 15 on free throws after making all 18 in the previous game. ... Williams had 11 points and 11 rebounds. ... F Lauri Markkanen (sprained right shoulder) still is experiencing soreness and the Bulls have “no more clarity” on when he might return, coach Billy Donovan said. The 7-footer from Finland missed his eighth game in a row. The Bulls announced Feb. 8 they expected him to miss two to four weeks, and Donovan said Saturday Markkanen has not experienced a setback. ... Veteran F Otto Porter Jr. (lower back spasms) has been shooting in practice, though his timetable remains up in the air. He missed his 10th game in a row.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Visit Milwaukee on Sunday.\n\n\r\n                    Bulls: Visit Houston on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997176.439727
}