{
  "game_id": "0021800294",
  "espn_id": "401070975",
  "date": "Nov 26, 2018",
  "matchup": "CHA vs. MIL",
  "headline": "Hornets beat Bucks 110-107 after nearly squandering big lead",
  "body": "CHARLOTTE, N.C. --  Michael Kidd-Gilchrist's stat line was nothing to get excited about: seven points, seven rebounds, two blocks and one assist.\n\nBut the forward's return to the floor after missing six games with an ankle injury provided a huge spark for the Charlotte Hornets, who built a 25-point, third-quarter lead and held on to beat the Milwaukee Bucks 110-107 on Monday night to snap a two-game losing streak.\n\nKidd-Gilchrist brought energy on both ends of the floor, including a rejection of Khris Middleton off the glass on a fast-break layup attempt.\n\nCharlotte forced 16 turnovers, limited Milwaukee to a season-low 40 points in the paint and played perhaps its best defensive game of the season.\n\n\"He's special on that end of the floor,\" Kemba Walker said of Kidd-Gilchrist's defense. \"He takes pride in it. ... We missed him. He came in and gave an unbelievable effort. He's still not 100 percent, but the effort that he gave was just unbelievable.\"\n\nKidd-Gilchrist said it was \"not fun\" to sit out six games, saying he had a lot of energy bottled up inside of him.\n\n\"The energy is why I'm here,\" Kidd-Gilchrist said.\n\nCoach James Borrego praised his team's defense one night after an ugly loss at Atlanta, which has the worst record in the Eastern Conference.\n\nHe said Kidd-Gilchrist provided the spark the Hornets needed.\n\n\"We have felt his absence the last four or five games,\" Borrego said. \"I don't think it's a coincidence that we have that type of effort tonight with him back in the lineup.\"\n\nWalker and Jeremy Lamb shared the scoring load for the Hornets, each finishing with 21 points. Marvin Williams added 16 points and eight rebounds, and Tony Parker returned from a two-game absence and had 15 points off the bench for the Hornets.\n\nThe Bucks nearly came all the way back, cutting the lead to one with 17 seconds left on a layup by Giannis Antetokounmpo.\n\nBut Walker made two free throws with 7.1 seconds remaining and the Bucks failed to get off a good shot after a side inbounds, with Eric Bledsoe forced to launch an off-balance 3-pointer that hit off the glass and the rim and bounced away as time expired.\n\nAntetokounmpo had 20 points, 13 rebounds and nine assists. Bledsoe scored 17 points.\n\nTIP-INS\n\nBucks: Were 7-of-9 on 3-pointers in the game's first 5  1/2 minutes to build a 28-14 lead.\n\nHornets: Lamb has scored at least 18 points in six of his last seven games. ... After spotting the Bucks a 28-14 lead in the first quarter, the Hornets outscored the Bucks 57-24 over the next 22 minutes behind a 3-point barrage led by Lamb and Williams.\n\nTURNOVERS\n\nThe Bucks looked sloppy and disorganized on offense for most of the game and struggled making shots in the final two minutes.\n\n\"For two-and-a-half quarters we were not able to match them,\" Bucks coach Mike Budenholzer said. \"I am proud of the group for finding a way to fight back. We had a bunch of chances late and just couldn't quite convert.\"\n\nPARKER'S IMPACT\n\nParker's return was big for Charlotte, allowing Walker to take a breather down the stretch and play off the ball while Parker ran the offense. Borrego said Parker, who made two big shots late in the fourth quarter after the Bucks had closed the lead to four, provided a \"calming influence\" down the stretch.\n\n\"Having Tony back just steadies us,\" Borrego said. \"He's a winner. He's been a winner his entire career. He helped us close that game out.\"\n\nSaid Bucks center Brook Lopez: \"He's been doing that his whole career, for a long time. He's always ready, always prepared to go. He definitely came through when they needed him to.\"\n\nUP NEXT\n\nBucks: Host Bulls on Wednesday night.\n\nHornets: Host Hawks on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994420.21573
}