{
  "game_id": "0021800965",
  "espn_id": "401071638",
  "date": "Mar 06, 2019",
  "matchup": "CHA vs. MIA",
  "headline": "Kelly Olynyk, Hassan Whiteside lead Heat over Hornets 91-84",
  "body": "CHARLOTTE, N.C. --  Hassan Whiteside may not be a starter right now, but he proved that isn't going to keep him from having a major impact for the Heat.\n\nMiami's 7-foot center, who is coming off a hip injury and has been relegated to a reserve role for the first time since signing a four-year, $98 million contract in 2016, turned in a big game at a big time in his return home.\n\nKelly Olynyk had 22 points and 11 rebounds, and Whiteside added 18 points, 15 rebounds and four blocks as the Heat defeated the Charlotte Hornets 91-84 on Wednesday night to break a tie for the eighth spot in the Eastern Conference.\n\n\"Hassan was tremendous,\" Miami coach Erik Spoelstra said. \"Really had a tremendous impact on both ends of the floor. That's his best version.\"\n\nIf Whiteside is upset about Spoelstra's decision to start Bam Adebayo, he didn't show it after the game.\n\n\"It's whatever coach Spo wants, I'm going to do that,\" Whiteside said. \"If he wants me to start, I'm going to start. If he wants me to come off the bench, I'm going to come off the bench.\"\n\nA return home may have been what Whiteside needed.\n\nHe smiled as he answered questions, and talked about growing up 20 miles west of Charlotte in Gastonia, North Carolina where there was \"only a Walmart.\" He said he spent time with his mother and younger brother at their nearby home in Mount Holly watching television before heading to the arena. He also bought Bojangles chicken for his team after the win.\n\n\"It brings me back to reality,\" he said of his return home.\n\nOlynyk had a big game, too.\n\nAfter a rollercoaster season, he played 44 minutes and shot 8 of 14 from the field -- including 5 of 7 from beyond the 3-point arc -- on a night when almost everyone was struggling hitting shots.\n\nIn a game full of travels and bad passes -- the teams combined for 39 turnovers -- and plenty of poor shooting, the Heat emerged with the win largely because of a 16-2 fourth-quarter run.\n\nOlynyk was huge during the stretch by hitting a pair of 3-pointers and grabbing a steal near the foul line leading to an uncontested dunk to give Miami an 80-67 lead. That prompted chants of \"Let's Go Heat!\" from the crowd -- many of those fans wearing No. 3 jerseys in honor of Dwyane Wade's final NBA game in Charlotte.\n\nThe win was crucial for the Heat's playoff chances given the Hornets had won the previous two games this season. The teams meet again March 17 in Miami.\n\nKemba Walker and Frank Kaminsky each scored 20 points for Charlotte. Cody Zeller finished with 10 points and 10 rebounds.\n\nDespite the loss, Hornets guard Nic Batum said of the team's playoff chances: \"We're still in the race. ... There is a lot of basketball left.\"\n\nTIP INS\n\nHeat: Had 13 turnovers in the first half, including nine in the second quarter -- the most they've had in any quarter this season.\n\nHornets: Charlotte snapped a streak -- barely -- of allowing at least 30 points in the first quarter in nine straight games. They surrendered 29.\n\nZONE PLAY\n\nBoth teams used plenty of zone and it certainly had an impact on the offense.\n\nThe teams combined for 119 points in the first three quarters -- the third-lowest total of the NBA season -- and struggled from the floor. Charlotte shot 36.6 percent; Miami 41.8 percent.\n\n\"I think early on (in the year) we really struggled (against the zone), but we have gotten better,\" Hornets forward Marvin Williams said. \"Their team is built a little different when you have Bam and Whiteside back there and you can't get past them and they have really pesky, scrappy perimeter guys and you still have the big fellow back there waiting for you.\"\n\nWADE JERSEY EXCHANGE\n\nThe Hornets honored Wade with a video highlight tribute in the first quarter that notably left out his remarkable performance in Game 6 of the 2017 NBA playoffs when he rallied the Heat to a 4-3 series win over Charlotte.\n\nWade had a rough night shooting, going 4 of 15 from the field and missed both free-throw attempts. He finished with eight points and six assists.\n\nAfter the game, Walker exchanged jerseys with Wade at midcourt.\n\nOn the jersey, Wade wrote to Walker, \"I love your heart. Keep going.\"\n\n\"D-Wade is an unbelievable player. I had a chance to play against him in two playoff series,\" Walker said. \"He's been a special player for years in this league. This is his last one here and for me to swap jerseys is an honor for me.\"\n\nUP NEXT\n\nHeat: Host Cavaliers on Friday night.\n\nHornets: Host Wizards on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994355.405937
}