{
  "game_id": "0022000230",
  "espn_id": "401267390",
  "date": "Jan 22, 2021",
  "matchup": "DET vs. HOU",
  "headline": "Rockets withstand final review in 103-102 win over Pistons",
  "body": "DETROIT -- — Jerami Grant's driving layup on the final play came too late, and the Houston Rockets held on for a 103-102 victory over the Detroit Pistons on Friday night.\n\n\r\n                    Down one with 3.4 seconds remaining, the Pistons inbounded to Grant, who faked a handoff to Blake Griffin and then drove down the right side of the lane. Time clearly ran out before he laid the ball in, but he was also bumped by Houston's P.J. Tucker.\n\n\r\n                    Replays showed that contact also came after time expired, and after a review, the game ended with the Rockets holding on.\n\n\r\n                    “I tried to wait as long as I could before I fouled him,\" Tucker said. \"He got a little edge on me.”\n\n\r\n                    Grant scored 21 points for Detroit, which rallied from a 20-point second-quarter deficit and nearly erased a four-point gap late in the fourth. Griffin's 3-pointer with 29.9 seconds remaining made it 103-102, and the Pistons stopped Houston at the other end to set up Grant's final bid.\n\n\r\n                    Detroit coach Dwane Casey felt a foul could have been called earlier on the final play. Grant was pressured quickly after receiving the ball.\n\n\r\n                    “I thought he got fouled three times before he got to the rim,\" Casey said.\n\n\r\n                    Eric Gordon scored 20 points for Houston, which snapped a three-game losing streak. The Rockets were without John Wall and Christian Wood but had seven players score in double figures.\n\n\r\n                    “Everybody kind of played a role and did their job. It feels good,\" Houston coach Stephen Silas said. \"The crazy part is, if that foul had been point-one second earlier, then we wouldn’t feel so good, I guess.”\n\n\r\n                    It was an ugly first quarter for the Pistons, who turned the ball over nine times and trailed 34-21 at the end of the period. David Nwaba’s layup put Houston up 43-23 in the second.\n\n\r\n                    The Pistons, however, have been a bit more competitive this season than their league-worst 3-12 record suggests. They chipped away at the deficit and trailed 55-47 at halftime despite the fact that Griffin hadn’t scored yet.\n\n\r\n                    Grant’s 3-pointer put the Pistons ahead in the third, and they finished the quarter leading 81-77.\n\n\r\n                    TIP-INS\n\n\r\n                    Rockets: Wood, who went from Detroit to Houston in a sign-and-trade this offseason, missed the game against his former team with a sprained right ankle. Wall is dealing with left knee issues.\n\n\r\n                    Pistons: Wayne Ellington scored 18 points — all on 3-pointers — and was a big part of Detroit's comeback. ... Delon Wright also scored 18. ... Griffin finished with seven points and 10 rebounds.\n\n\r\n                    KEY SEQUENCE\n\n\r\n                    With Detroit down 97-95, Mason Plumlee secured a defensive rebound, but when he held the ball behind his head, Houston's Jae'Sean Tate ripped it away from him and drew a foul with 2:05 remaining. Tate made the first free throw and missed the second, but the Pistons were called for another foul on that rebound. Tucker's two free throws made it a five-point game.\n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: Visit the Dallas Mavericks on Saturday night. Dallas beat Houston 113-100 on Jan. 4.\n\n\r\n                    Pistons: Host the Philadelphia 76ers on Saturday night. That's the first of two straight games the teams are scheduled to play in Detroit.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997921.075998
}