{
  "game_id": "0022300774",
  "espn_id": "401585402",
  "date": "Feb 13, 2024",
  "matchup": "PHX vs. SAC",
  "headline": "Kevin Durant scores 28, Devin Booker adds 25, Suns outlast Kings 130-125",
  "body": "PHOENIX -- — Kevin Durant scored 28 points, Devin Booker added 25 and the Phoenix Suns outlasted the Sacramento Kings 130-125 on Tuesday night.\n\n\r\n              Eric Gordon had 23 points, filling in nicely for starting guard Bradley Beal, who left with a hamstring injury after just five minutes on the floor. Recently acquired veteran Royce O'Neale added nine points, five assists, four rebounds and four steals for Phoenix.\n\n\r\n              “I just liked everybody's minutes,” Durant said. “Everybody understood the assignment, kept the game simple on both ends, and we just played.”\n\n\r\n              The Kings lost despite another monster game from Domantas Sabonis, who had his third straight triple-double with 35 points, 18 rebounds and 12 assists. De’Aaron Fox scored 40 for Sacramento, and Malik Monk added 22 off the bench.\n\n\r\n              The Suns erased an 11-point deficit in the third quarter to take a 94-92 lead going into the fourth. Gordon and O'Neale hit back-to-back 3-pointers early in the final period to push Phoenix ahead 103-94.\n\n\r\n              The Kings fought back, tying it at 108 on a putback by Sabonis with 5:25 left. The game stayed tight the rest of the way, and O'Neale's 3-pointer with 47 seconds left put the Suns up 122-118.\n\n\r\n              Fox responded with a 3 to cut the margin to 122-121 with 41 seconds remaining, but Booker hit a jumper after a timeout for a 124-121 advantage and the Suns made enough free throws on the final possessions to stay in control.\n\n\r\n              Booker scored 20 points in the second half and passed Alvan Adams to become the second-leading scorer in franchise history.\n\n\r\n              “He’s got a unique knack for feeling the game out,” Suns coach Frank Vogel said. “Big part of the W.\"\n\n\r\n              The Kings outrebounded the Suns 50-39 but made just 29% of their 3-pointers, going 9 for 31 behind the arc.\n\n\r\n              Beal injured his left hamstring in the first quarter and didn't return. The three-time All-Star has had a hard time staying healthy this season, also dealing with back and ankle ailments. He's played in 30 of the team's 54 games.\n\n\r\n              Vogel said Beal would definitely miss the next game against Detroit on Wednesday, but was optimistic he wouldn't miss much more time. Beal is averaging 18.5 points per game this season.\n\n\r\n              Sacramento shot 58% from the field on the way to a 67-64 halftime lead. Sabonis led the Kings with 19 points before the break, while Gordon scored 20 for Phoenix.\n\n\r\n              The Suns have won 13 of their past 17 games. \n\n\r\n              UP NEXT\n\n\r\n              Kings: At Denver on Wednesday.\n\n\r\n              Suns: Host Detroit on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996652.1196108
}