{
  "game_id": "0022200398",
  "espn_id": "401468553",
  "date": "Dec 11, 2022",
  "matchup": "TOR @ ORL",
  "headline": "Wagner, Banchero lead Magic past Raptors for 3rd win in row",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 23 points, Paolo Banchero added 20 points and 12 rebounds and the Orlando Magic beat the Toronto Raptors 111-99 Sunday night for their third straight win.\n\n\r\n              The Magic didn't win three in a row at any point last season. Orlando's last three-game winning streak was in February 2021.\n\n\r\n              “You put three games in a row — I think we’re headed in the right direction,” Magic coach Jamahl Mosley said. “We’re asking our guys to defend at a high level, which they did. We’re asking them to move the basketball, which they did, and to stay poised down the stretch which they’ve done.”\n\n\r\n              Wagner was encouraged by what he saw.\n\n\r\n              “I think we’re figuring stuff out, especially these last couple games,” Wagner said. “People are beginning to adjust to how we play and throw different stuff at us, so we’ve got to keep working.”\n\n\r\n              Gary Trent Jr. led the Raptors with 24 points. Fred Van Vleet added 20 and Pascal Siakam 19. \n\n\r\n              It was Toronto's second loss in three nights to the Magic, a team they had defeated in 10 of the preceding 11 meetings.\n\n\r\n              “It was a little bit of a gut punch,” Van Vleet said. “It just wasn't our night tonight, which is why you have to take care of business on Friday night. We had some critical breakdowns to give them threes at the wrong parts of the game, especially late in the fourth quarter.” \n\n\r\n              Mo Bamba and Cole Anthony came off the bench and made major contributions for the Magic. Bamba had 18 points, nine rebounds and two blocks while Anthony, playing 29 minutes while starting point guard Markelle Fultz sat in foul trouble, finished with 14 points and six assists. \n\n\r\n              The Magic went more than 4 1/2 minutes without scoring in the first quarter and didn't make a 3-point shot until Terrence Ross hit at 6:19 of the second quarter. Bamba followed quickly with two more on a 10-0 run that gave Orlando a 41-29 lead. \n\n\r\n              “Shots were not falling early, but I loved our ability to stay the course and stay in the fight,” Mosley said. “I think that’s a great sign of growth for a young team in a situation like this.”\n\n\r\n              The Magic led by 14 midway through the third quarter when a flagrant foul on Fultz -- his fifth personal foul -- helped the Raptors score four quick points. Trent scored eight straight Toronto points and the Raptors cut their deficit to four before the end of the period.\n\n\r\n              But they got no closer, and when Wagner made three straight 3-pointers early in the fourth quarter, Orlando led 95-79.\n\n\r\n              “One time was in a late-clock situation; somebody gambled for a steal and I got a three. Two other times I was just open and I was feeling like I was in a rhythm,” Wagner said. “The coaches are telling me to shoot when I’m open and I’ve worked a lot on it.”\n\n\r\n              TIP-INS\n\n\r\n              Raptors: F O.G. Anunoby missed his first game of the season after straining his left hip early in Friday night's game. ... The Raptors lost two replay challenges in a span of 13 seconds in the second quarter, but another replay give them three points after an initial call that Van Vleet had launched a shot after the 24-second clock had expired. \n\n\r\n              Magic: After missing their first seven 3-points attempts, the Magic shot 14 for 24. . . . Ross was the only player still on the active roster who participated in the Magic's last three-game winning streak 22 months (and 151 games) ago. ... After being outrebounded 43-29 in a loss at Toronto on Dec. 3, the Magic had an 85-60 edge in the two games here, led by Bamba's 22.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Play at home against Sacramento on Wednesday night.\n\n\r\n              Magic: Play at home against Atlanta on Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994080.2522712
}