{
  "game_id": "0022400480",
  "espn_id": "401705046",
  "date": "Jan 04, 2025",
  "matchup": "IND vs. PHX",
  "headline": "Tyrese Haliburton scores 27 to help Pacers reach .500 with a 126-108 victory over the Suns",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton scored 27 points and Myles Turner added 20 points, six rebounds and three blocks, leading the Indiana Pacers past the Phoenix Suns 126-108 on Saturday.\n\n\r\n              Haliburton also had eight assists and, for the second straight game, did not commit a turnover. Indiana has won three of its last four to even its overall record at 18-18. The Pacers also swept the two-game season series from Phoenix.\n\n\r\n              Kevin Durant led the Suns with 25 points, seven rebounds and seven assists, while Devin Booker had 20 points in the same venue he scored an arena-record 62 in his last trip to Gainbridge Fieldhouse in January 2024. Booker also had nine rebounds and nine assists.\n\n\r\n              The Pacers swung the game by breaking a 56-all halftime tie with the first five points of the second half and used a pivotal 40-point third quarter — their third-best quarter all season — to seize control. Indiana never trailed in the second half. \n\n\r\n              Takeaways\r\n              Suns: Phoenix continues to create consternation over what's wrong. Booker, Durant and Bradley Beal were supposed to form the nucleus of a title contender. Instead, they've lost seven of eight and 10 of 13, forcing coach Mike Budenholzer to continue waiting for career win No. 500.\n\n\r\n              Pacers: Indiana has finally started playing the way it envisioned over these past 11 games. Haliburton is in sync, the defense has improved and the Pacers have won eight times during that span to reach .500. \n\n\r\n              Key moment\r\n              Indiana capped its big third quarter with a late 12-5 run that extended an eight-point lead to 96-82. Phoenix played catch-up the rest of the game.\n\n\r\n              Key stats\r\n              Indiana had 35 assists on 46 baskets and only six turnovers while outrebounding the Suns 47-37.\n\n\r\n              Up next\r\n              Phoenix makes the second stop on a three-game trip Monday at Philadelphia, while the Pacers travel to Brooklyn on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998143.929155
}