{
  "game_id": "0021900795",
  "espn_id": "401161437",
  "date": "Feb 10, 2020",
  "matchup": "ATL @ ORL",
  "headline": "Gordon, Vucevic lift Magic over Hawks 135-126",
  "body": "ORLANDO, Fla. --  The Orlando Magic aren’t built to shoot their way out of slumps, so know they won't have many nights like they did Monday.\n\nAaron Gordon scored 26 points, Nikola Vucevic had 24 points, nine rebounds and nine assists, and the Magic surged past the Atlanta Hawks 135-126.\n\nThe Magic, who had lost eight of nine overall and five straight at home, stunned themselves and the Hawks with a 79-point second half that included a season-high 42 points in the fourth quarter. The Magic are 7-0 this season when scoring more than 120 points.\n\n“When the ball goes through the net like that, it’s more enjoyable for everyone,” Vucevic said. “But we can’t expect to make shots like that every night. We don’t have that kind of firepower. The reality is, we’re not going to win many games giving up 126 points.”\n\nBut they had it rolling against Atlanta. The Magic hit 52.6% from the field, including a season-high 18 3-pointers, in their highest-scoring game this season.\n\nOrlando hit 13 of 25 3-point attempts in the second half and used a pair of 11-0 runs in the fourth quarter to run down Atlanta.\n\nEvan Fournier had 22 points and Terrence Ross had five 3-pointers and 21 points off the bench. Markelle Fultz contributed 13 points and eight assists.\n\n“The way we’ve been struggling, our guys knew this was an important game,” Magic coach Steve Clifford said. “And that’s the way we’ve got to play. It’s got to be five-man basketball.”\n\nAtlanta was playing the second half of a back-to-back that started with a double-overtime win over New York. The Hawks held their own for three periods, taking a 96-93 into the final period, but ran out of gas.\n\nTrae Young had 29 points and nine assists for Atlanta. John Collins scored 22 points and Dewayne Dedmon had 14 points and nine rebounds off the bench.\n\n“Back-to-backs have really been an Achilles heel for us,” Atlanta coach Lloyd Pierce said. “There was nothing we could do. We didnt have enough pressure on their passes, their shooters got hot and that’s tough.”\n\nBack-to-back dunks by James Ennis III finished off the first 11-0 Magic run early in the final period to put the Magic up 106-101 with just over 9 minutes left.\n\nYoung helped the Hawks close the gap to 116-115, but the Magic suddenly got hot from the perimeter and shot Atlanta out of the game. Fournier started the second 11-0 run with a 20-footer and Gordon finished it with a 3-pointer that gave Orlando 127-115 lead with 3 1/2 minutes to go.\n\nAtlanta never got closer than six the rest of the game.\n\nTIP-INS\n\nHawks: Collins had his run of scoring 20 or more points and grabbing 10 or more rebounds stopped at five straight games. ... Young took all 11 Atlanta free throws in the first half, making 10. ... Vince Carter, a resident of Orlando, received his second farewell tribute from the Magic during the first quarter.\n\nMagic: Ennis made his debut after being obtained from Philadelphia at the trade deadline. He had six points and five rebounds. … Orlando is last in the NBA in shooting percentage at 43.1% and 28th in 3-point shooting at 33.4%. … The Magic received unanimous approval from the City Council to buy land a half-mile from the Amway Arena to build a practice facility.\n\nHOW FAR IS TOO FAR?\n\nYoung was just 3 of 11 on 3-pointers with five of the misses coming from 30 feet and beyond, but Pierce said he’s not about to draw the line on how far Young can back up. “He’s proven he can make those shots,” Pierce said. “Sometimes he takes them a little too early for my liking, but we’re looking for that balance of when to take it and when to execute. He’s capable of getting that shot any time and he’s capable of making it.”\n\nUP NEXT\n\nHawks: At Cleveland Wednesday.\n\nMagic: Home against Detroit Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764996667.307088
}