{
  "game_id": "0021600142",
  "espn_id": "400899592",
  "date": "Nov 13, 2016",
  "matchup": "LAL @ MIN",
  "headline": "Wiggins scores 47 to lead Timberwolves over Lakers, 125-99",
  "body": "MINNEAPOLIS --  Andrew Wiggins: 47.\n\nAll five Los Angeles Lakers starters: 47.\n\nWiggins hit 14 of 21 shots to blow past his previous career high of 36, leading the Minnesota Timberwolves to a 125-99 victory over the Lakers on Sunday night.\n\n\"I'm finding myself, finding things I'm good at and things I need to work on,\" said Wiggins, nine games into his third season in the league. \"The game has kind of slowed down for me a little bit. I'm able to read defenses better now and see how the defense is set.\"\n\nWiggins hit 17 of 22 free throws and Nemanja Bjelica added a career-high 24 points and eight rebounds for the Timberwolves, who played without starting guard Zach LaVine and reserve forward Shabazz Muhammad. Both missed the game with sore right knees.\n\nLou Williams scored 13 of his 17 points in the fourth quarter for the Lakers, who got 47 points from their starters and 52 from their bench. Julius Randle had 14 points and six rebounds and Jordan Clarkson scored 14.\n\n\"You let a player as good as him get an additional 22 free chances on that, one he's going to score a lot and two he's going to get hot because he's in a rhythm from all the free throws he's shooting,\" Lakers coach Luke Walton said. \"We couldn't really contain him tonight.\"\n\nWiggins was a team-best plus-34 in 41 minutes, and LaVine showered his close friend with Gatorade during his postgame television interview. The Wolves went 13 of 27 from 3-point range, many of them clean shots coming after the defense collapsed on Wiggins.\n\n\"I think he's just scratching the surface,\" Wolves coach Tom Thibodeau said. \"I think he can do a lot more.\"\n\nThe game featured two of the most promising young cores in the league, with Wiggins, LaVine and Karl-Anthony Towns hoping to end Minnesota's 12-year playoff drought and D'Angelo Russell, Randle and Brandon Ingram reviving the Lakers in the post-Kobe era.\n\nEntering the season, the Lakers were believed to be a step behind the Wolves in the process, but they won six of their first 10 games while Minnesota got off to a disappointing 2-6 start.\n\nBoth teams played on Saturday night, but the Wolves were finishing a rare home back-to-back, and appeared to have the fresher legs all night. The Timberwolves scored 21 points off of 17 Lakers turnovers.\n\nTIP-INS\n\nLakers: C Timofey Mozgov was in foul trouble all game, playing just 15 minutes before fouling out. ... Ingram played after being listed as questionable with a sprained ankle suffered on Saturday night in New Orleans. Ingram finished with 10 points in 26 minutes. ... The Lakers wrapped up their three-game road trip at 2-1.\n\nTimberwolves: Wiggins scored a career-high 25 points in the first half. ... F Brandon Rush missed his fourth straight game, and coach Tom Thibodeau  revealed that Rush has been dealing with a bruised big toe on his right foot.\n\nBJELICA STARTS\n\nWith LaVine injured, Thibodeau inserted the 6-foot-10 Bjelica, normally a power forward, into the lineup at small forward and moved Wiggins to shooting guard. The former Euroleague MVP made five 3s and also had three steals and a block.\n\n\"I thought he played a beautiful game tonight,\" Thibodeau said. \"He made really good decisions.\"\n\nLAKERS BENCH\n\nThe second unit has been a strength for the Lakers all season, averaging 52.1 points per game in the first 10. The leading scorer from the game has come from their bench in eight of 11 games so far this season.\n\n\"No excuse,\" Russell said of playing three games on the road in four nights. \"We just lost.\"\n\nTOWNS STRUGGLES\n\nTowns finished with 22 points and 12 rebounds, but he really had to work for it. The reigning rookie of the year made 7 of 22 shots, including just 6 of 10 free throws.\n\nUP NEXT\n\nLakers: Head home from a three-game road trip to face Brooklyn on Tuesday.\n\nTimberwolves: Continue a four-game home stand with a game against the Hornets on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995443.836237
}