{
  "game_id": "0021600773",
  "espn_id": "400900178",
  "date": "Feb 06, 2017",
  "matchup": "DET vs. PHI",
  "headline": "Pistons pull away in 3rd quarter, beat 76ers 113-96",
  "body": "AUBURN HILLS, Mich. --  Detroit coach Stan Van Gundy wants his team to do a better job during the first few minutes of the second half, and the Pistons certainly responded against Philadelphia.\n\n\"We've really not played well lately to start the third quarter, and tonight we were really good,\" Van Gundy said. \"I was really happy with our starting group.\"\n\nThe Pistons made their first six shots of the second half and went on to an easy 113-96 victory over the 76ers on Monday night. Andre Drummond finished with 16 points and 17 rebounds, and seven Detroit players scored in double figures.\n\nDetroit led 55-46 at halftime before outscoring Philadelphia 34-21 in the third period. The Pistons were never seriously challenged after that.\n\nNine players scored at least eight points for the Pistons. Marcus Morris led the way with 19, and Reggie Jackson scored 14. Jon Leuer, Kentavious Caldwell-Pope and Aron Baynes had 12 each.\n\n\"Their physical side got the better of us,\" 76ers coach Brett Brown said. \"They have a veteran team. There's a physical side to their team, a physical side to their center. There were a lot of things to be worried about coming into this building.\"\n\nJahlil Okafor scored 16 points for the 76ers, who have lost four straight. Philadelphia's Joel Embiid missed his sixth straight game with a left knee problem.\n\nDetroit outscored Philadelphia 31-19 in the second quarter, and Drummond already had 11 rebounds by halftime. The third quarter was just as bad for the 76ers. After a couple of 3-pointers by Caldwell-Pope, the Pistons were up 67-52, and the lead eventually reached 26 after a 3 by Jackson. That shot put Detroit up 82-56, and it came after the Detroit point guard left Philadelphia's T.J. McConnell on the ground with a crossover dribble .\n\n\"We were able to get defensive stops and get out and run,\" Jackson said. \"We got some easy baskets and second-chance points as well, but most importantly we were able to get stops.\"\n\nThe Pistons took over sole possession of the eighth and final playoff slot in the Eastern Conference, breaking a tie with idle Charlotte.\n\nSTAYING FOCUSED\n\nOkafor returned after missing Saturday's game at Miami with right knee soreness. He's been the subject of trade speculation, and he was asked about that after the game.\n\n\"As a professional in the NBA, that's something I'll probably have to deal with the rest of my career,\" Okafor said. \"It's something I dealt with last year and something I'll probably deal with next year, too. I just try to worry about what I can control.\"\n\nOkafor shot 7 of 11 from the field.\n\n\"He's been a star,\" Brown said. \"My level of respect for Jahlil Okafor, how he's managed and handled this situation, how you can still remain a wonderful teammate and still retain a competitive edge ... he's got a lot to be proud of. He's a wonderful person and for him to come out and jump into this game like he did and show his skill, I'm proud of him.\"\n\nRELIEF\n\nDrummond picked up his second foul with 5:44 remaining in the first quarter, but Baynes filled in well and finished the half with eight points on 4-of-4 shooting. Drummond ended up playing only 25:45.\n\nTIP-INS\n\n76ers: Philadelphia went 5 of 28 from 3-point range. Nik Stauskas and Ersan Ilyasova each went 0 for 5.\n\nPistons: G Reggie Bullock (illness) missed the game. ... Detroit recalled F Henry Ellenson and G Michael Gbinije from its Grand Rapids affiliate in the D-League. ... The Pistons improved to 15-10 at home.\n\nUP NEXT\n\n76ers: Host the San Antonio Spurs on Wednesday night.\n\nPistons: Host the Los Angeles Lakers on Wednesday night in the final scheduled visit to The Palace by the Lakers.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister\n\n---\n\nThis version corrects Philadelphia's next game to Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764996046.7744598
}