{
  "game_id": "0021900349",
  "espn_id": "401160991",
  "date": "Dec 09, 2019",
  "matchup": "PHX vs. MIN",
  "headline": "Booker, Oubre carry Suns past Timberwolves 125-109",
  "body": "PHOENIX --  Kelly Oubre Jr. was ready for a low-key night on the town with friends and family to celebrate his birthday, dressed head to toe in black with a jacket, shirt, pants and shoes.\n\nHis work was already done and the results were exactly what he wanted. The new 24-year-old had just poured in 24 points to help the Phoenix Suns top the Minnesota Timberwolves 125-109 on Monday.\n\n\"It's easy to get lost in the sauce when it comes to the emotions of the game,\" Oubre said. \"It's my birthday, definitely wanted to win, so I just wanted to go out there and do everything I possibly could to get the win.\"\n\nDevin Booker led the Suns with 26 points, Oubre shot 8 of 15 from the field and Ricky Rubio finished with 16 points and 14 assists. The Suns won at home for the first time since Nov. 14, snapping a four-game losing streak at Talking Stick Resort Arena.\n\nDario Saric added 20 points for Phoenix. Rubio has dished out at least 13 assists in three straight games and had only one turnover on Monday.\n\n\"You better keep your eyes up, don't get hit in the head with it, because it's going to come if you're open,\" Oubre said of Rubio's passes. \"He's just a wizard with it. He can do a lot of things on the basketball court that, looking at him, you wouldn't think he could do.\"\n\nMinnesota lost its fifth in a row. The Timberwolves were led by Karl Anthony-Towns, who scored 33 points and grabbed 15 rebounds. He shot 12 of 18 from the field.\n\nAndrew Wiggins added 23 points and Jeff Teague had 16 off the bench.\n\n\"Not a good road trip for our defense,\" Minnesota coach Ryan Saunders said. \"Not a good road trip for us in general. We have things we need to clean up going home. We will have challenges but opportunities.\"\n\nPhoenix trailed by three at halftime but rallied for a 94-85 advantage at the end of the third quarter. The Suns pushed that margin to 12 early in the fourth after Rubio's 3-pointer.\n\nThe Timberwolves made a few small runs in the final period but could never get the deficit under seven. Rubio hit another 3 with 4:26 left to push the Suns ahead 111-98, and they cruised in the final minutes.\n\n\"We dug deep, found out what worked and spread the love,\" Oubre said.\n\nTowns had 21 points and eight rebounds in the first half as the Timberwolves took a 64-61 halftime lead. Oubre and Saric both scored 13 for the Suns.\n\nDEFENSIVE THIRD\n\nSuns coach Monty Williams said the game was won in the third quarter when his team held the Timberwolves to 21 points. Minnesota had 44 points in the paint in the first half, but Phoenix made it much tougher after the break.\n\n\"It wasn't anything we changed,\" Williams said. \"We just made a concerted effort to do what we wanted to do better.\"\n\nPLAYOFF POSITION\n\nIt's probably a little early to talk about playoff positioning, but the Suns and Timberwolves appear to be among the teams that could end up fighting for the final few spots in the Western Conference.\n\nPhoenix is 11-12 and tied with Oklahoma City for seventh place. Minnesota fell to 10-13 and is tied with Sacramento for the No. 9 spot. The top eight teams make the playoffs.\n\n\"We've been losing games that are important, that might come back to haunt us,\" Wiggins said.\n\nSaid Anthony-Towns: \"We know the team we can be, we've just got to go out there and act and get it done.\"\n\nTIP-INS\n\nTimberwolves: F Jake Layman (toe sprain) missed his ninth straight game. ... Towns scored at least 30 points against the Suns for the fourth time in his five-year career. The 33 points were a career high for him in the series.\n\nSuns: C Aron Baynes returned after missing nine of the past 10 games because of hip and calf injuries. Baynes has been productive when healthy this season, averaging 14.7 points and 5.7 rebounds per game. He played 15 minutes on Monday, finishing with 12 points and four rebounds. ... The Suns are 11-0 when leading after three quarters.\n\nUP NEXT\n\nThe Timberwolves host the Utah Jazz on Wednesday.\n\nThe Suns host the Memphis Grizzlies on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996577.154525
}