{
  "game_id": "401810107",
  "espn_id": "401810107",
  "date": "Nov 18, 2025",
  "matchup": "SA vs MEM",
  "headline": "Fox, Barnes lead Spurs past Grizzlies 111-101 in a battle without stars Wembanyama, Morant",
  "body": "SAN ANTONIO -- — De’Aaron Fox had 26 points, Harrison Barnes added 23 points and the San Antonio Spurs escaped with a 111-101 victory over the Memphis Grizzlies on Tuesday night in a battle of injury-riddled rosters.\n\n\r\n              San Antonio was without All-Star center Victor Wembanyama and Memphis was without star point guard Ja Morant.\n\n\r\n              Barnes was 9 for 14 from the field, including seven straight points on a running hook, nine-foot floater and 3-pointer to give the Spurs a 107-101 lead with 53.2 seconds remaining. Keldon Johnson added 18 points on 8-for-15 shooting.\n\n\r\n              Cedric Coward had 19 points and Jaren Jackson Jr. added 18 points for Memphis, which lost its fifth straight. \n\n\r\n              San Antonio has won two straight and five of seven. \n\n\r\n              The Spurs are also without injured guards Dylan Harper (strained left calf) and Stephon Castle.\n\n\r\n              MRIs revealed Wembanyama has a left calf strain and Castle has a left hip flexor strain. Both Wembanyama and Castle are expected to miss two to three weeks.\n\n\r\n              The Spurs are 18-31 without Wembanyama and the Grizzlies are 76-93 without Morant.\n\n\r\n              Memphis took advantage of Wembanyama's absence to outrebound San Antonio 59-38 and capture a 22-2 advantage on second-chance points.\n\n\r\n              The Spurs were able to overcome those lopsided margins by outscoring the Grizzlies 25-14 in the fourth quarter after a sloppy start.\n\n\r\n              Memphis opened the game on an 8-0 run, prompting San Antonio coach Mitch Johnson to call a timeout 89 seconds into the game. The Spurs opened the game shooting 17% from the field, missing 10 of 12 attempts.\n\n\r\n              Up next\r\n              Grizzlies: Host Sacramento on Thursday.\n\n\r\n              Spurs: Host Atlanta on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042650.088081
}