{
  "game_id": "0022000299",
  "espn_id": "401267459",
  "date": "Jan 30, 2021",
  "matchup": "CHA vs. MIL",
  "headline": "Ball has career-high 27 points, Hornets top Bucks 126-114",
  "body": "CHARLOTTE, N.C. -- — LaMelo Ball has been bringing energy all season for the Charlotte Hornets off the bench.\n\n\r\n                    Now he may get a chance to do it as a starter.\n\n\r\n                    The rookie point guard made the most of his increased playing time Friday night following a first half ankle injury to starter Terry Rozier, scoring a career-high 27 points to go along with nine assists and four steals as the Charlotte Hornets handed the Milwaukee Bucks their second loss in two nights, 126-114.\n\n\r\n                    The Hornets outscored the Bucks by 37 when Ball was on the court, and he was difference maker in the game's final 6:09 in which Charlotte outscored Milwaukee 16-4.\n\n\r\n                    Hornets coach James Borrego said Ball's energy was “infectious.” \n\n\r\n                    “That is what makes his special, he just loves the game,\" Borrego said. “He has a great joy for his teammates and playing the game. ... The guys love playing with him and they play with more joy when he's in there. I want to coach with more joy because of him.”\n\n\r\n                    Ball senses the impact he has on his teammates.\n\n\r\n                    “I definitely feel that, even at a young age playing basketball, just getting the ball and getting out and going kind of affects people’s games, so they all do it,\" Ball said.\n\n\r\n                    Said teammate Miles Bridges: \"He just makes everyone around him better.”\n\n\r\n                    It was the second straight night the Bucks were victimized by a member of the Ball family. LaMelo's older brother, Lonzo, scored 27 points on seven 3-pointers on Friday night to lead the Pelicans to a 131-126 victory. \n\n\r\n                    Borrego said he will wait to see how severe Rozier's ankle injury is before making a decision on if Ball would start Monday night at Miami. \n\n\r\n                    Gordon Hayward added 27 points, Malik Monk had 18 and Cody Zeller chipped in with a career-best 15 rebounds for the Hornets, who beat the Pacers and Bucks on back-to-back nights.\n\n\r\n                    Giannis Antetokounmpo nearly had a triple-double, finishing with 34 points, 18 rebounds and nine assists for the Bucks. The two-time MVP appeared to bang knees with Miles Bridges with about seven minutes to play but remained in the game.\n\n\r\n                    “I think he kind of just knocked knees, so knee-to-knee,\" said Bucks coach Mike Budenholzer. \"He was obviously able to play. We’ll see how he feels in the morning, see how sore he is and hope for the best”\n\n\r\n                    Jrue Holiday had 21 points, and Khris Middleton 18 for the Bucks, They fell to 11-8.\n\n\r\n                    Ball was clutch down the stretch on both ends of the court.\n\n\r\n                    The Hornets led by two with less than three minutes to play when Hayward intercepted a Antetokounmpo and delivered a look ahead pass to Ball, who twisted his body to avoid having his shot blocked, scoring and drawing the foul. On Milwaukee's next possession Ball came up with a steal and fed Devonte Graham for a 3-pointer and soon the Hornets led by double digits.\n\n\r\n                    “Their activity, their hands, they created a few turnovers and they were obviously able to turn some of those turnovers into some baskets and they just out-executed us down the stretch the last two or three minutes,” Budenholzer said.\n\n\r\n                    TIP INS\n\n\r\n                    Bucks: Antetokounmpo was just 10 of 18 from the free throw line.\n\n\r\n                    Hornets: Terry Rozier left the game with a sprained right ankle in the first half and did not return. If Rozier can't play in Charlotte's next game, LaMelo Ball is expected to get his first NBA start. ... Ball was 9 of 9 from the foul line.\n\n\r\n                    3-POINT DEFENSE\n\n\r\n                    After falling behind 20-10 to start the game, the Hornets caught fire from long range. Behind Hayward and Monk, Charlotte made 15 of its next 17 shots, including eight 3-pointers, as part of a 41-11 run.\n\n\r\n                    It was the second straight night the Bucks have allowed 21 made 3-pointers.\n\n\r\n                    “Have pride, keep your man in front of you, don’t allow them to have easy looks,\" Antetokounmpo said. “Don’t allow them to get easily to the free throw line. Rebound the ball. Make sure when we miss or make shots, you got to box (out). The little things add up in 48 minutes and then you’ll have the result of being good on defense. But if you let the guy shoot an open 3 then let somebody go backdoor, let somebody get offensive rebound then throw it to the 3-point guy so he can knock down the 3, all that builds up and you have a bad night.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Host Portland on Monday night.\n\n\r\n                    Hornets: At Miami on Monday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997033.8892841
}