{
  "game_id": "0022300487",
  "espn_id": "401585115",
  "date": "Jan 05, 2024",
  "matchup": "POR @ DAL",
  "headline": "Kyrie Irving scores 24 with Luka Doncic out, Mavs finish sweep of Blazers with 139-103 win",
  "body": "DALLAS -- — Kyrie Irving scored 24 points with fellow All-Star Luka Doncic sidelined by a sore ankle, and the Dallas Mavericks swept a two-game home set against Portland by beating the Trail Blazers 139-103 on Friday night.\n\n\r\n              The Mavericks were missing six other players besides Doncic. But they led from the middle of the first quarter on, two nights after never trailing in a 29-point win over the Blazers.\n\n\r\n              Doncic showed up on the injury report earlier Friday with right ankle swelling and was ruled out before the game. \n\n\r\n              The four-time All-Star joined two other sidelined starters in rookie center Dereck Lively II and forward Grant Williams, who each sprained an ankle in the previous victory over Portland.\n\n\r\n              Jerami Grant scored 18 points and Scoot Henderson had 17 points and 10 assists for the Trail Blazers, who lost their third straight to start a seven-game trip and are 3-13 since the beginning of December to fall 16 games under .500.\n\n\r\n              Irving, who tied his season high of nine rebounds for the second game in a row, and Doncic combined for 70 points in the first win over Portland, when both sat out the entire fourth quarter. \n\n\r\n              In his third game back since missing 12 with a bruised right heel, Irving rested the entire fourth again with Dallas up 33 after outscoring the Blazers 40-16 in the third. The eight-time All-Star scored 12 points in the first 5:08.\n\n\r\n              “A lot of bodies out, next-man mentality,” Dallas coach Jason Kidd said. “Ky got us off to a really good start there. I thought Ky picked up right where he left off. Everyone who participated played at a high level.”\n\n\r\n              There were plenty of contributors behind Irving in the rematch, with Jalen Hardy and Tim Hardaway Jr. leading five other double-figure scorers with 19 points apiece. Josh Green and A.J. Lawson scored 14 each, and Derrick Jones Jr. added 12. \n\n\r\n              Hardy had career highs with nine rebounds and seven assists.\n\n\r\n              Jones, Dwight Powell and Green each had a breakaway dunk off a steal as the Blazers finished the two-game set with 41 turnovers that led to 47 Dallas points.\n\n\r\n              “Just disappointing all the way around,” Portland coach Chauncey Billups said. “Rarely this year have I sat up here disappointed in our effort. Our effort was poor. It was lousy all game. The starters got us off to a bad start with that. It was just tough.”\n\n\r\n              The Blazers were within six midway through the second quarter and trailed by nine at halftime before the Mavs scored the first 12 points after the break, including eight from Jones, for a 74-53 lead.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: The fourth game of the first of two seven-game trips this season is a Sunday matinee in Brooklyn. \n\n\r\n              Mavericks: Dallas is on a seven-game homestand, its longest of the season. The third game is Sunday against Minnesota.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996582.054025
}