{
  "game_id": "0022400356",
  "espn_id": "401704922",
  "date": "Dec 08, 2024",
  "matchup": "HOU @ LAC",
  "headline": "Jalen Green scores 31 to lead Rockets past Clippers 117-106",
  "body": "INGLEWOOD, Calif. -- — Jalen Green scored 31 points, Amen Thompson added 22 and the Houston Rockets defeated the Los Angeles Clippers 117-106 on Sunday night.\n\n\r\n              The Rockets ended a two-game skid without starter Fred VanVleet, who missed his first game of the season because of a right knee contusion.\n\n\r\n              Bones Hyland led the Clippers with 22 points off the bench, making a team-best five 3-pointers, and Ivica Zubac added 21 points and 12 rebounds. Kevin Porter Jr. had 19 points in his first career start for the team. \n\n\r\n              The Clippers lost their second straight at home after they suffered a 28-point drubbing at the hands of Minnesota on Wednesday. They kept it close in the first quarter before the Rockets took control.\n\n\r\n              Takeaways\r\n              Rockets: They had six players in double figures, with Jabari Smith Jr. having 13 points and 13 rebounds. Alperen Sengun had 11 points, 10 rebounds and six assists. \n\n\r\n              Clippers: They were already missing James Harden (sore right groin) when two more players went down. Amir Coffey sustained a right shoulder contusion in pre-game warmups and starter Derrick Jones Jr. left after the first quarter with right hamstring soreness. Their bench still outscored the Rockets' reserves, 38-21, but they were outdone 50-33 on the boards.\n\n\r\n              Key moment\r\n              The Rockets ran off 12 straight points, including seven in a row by Green, near the end of the second quarter to lead 64-52 at halftime. They kept the Clippers in catch-up mode the rest of the game, with Houston stretching its lead to 16 points in the third. \n\n\r\n              Key stat\r\n              The Rockets shot 49% from the floor and made 22 of 26 free throws. \n\n\r\n              \r\n              Up next\r\n              The Rockets host Golden State in an NBA Cup West quarterfinal on Wednesday. The Clippers visit Denver on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997397.3391209
}