{
  "game_id": "0021900508",
  "espn_id": "401161150",
  "date": "Jan 02, 2020",
  "matchup": "CHA @ CLE",
  "headline": "Graham breaks late tie, Hornets beat Cavaliers 109-106",
  "body": "CLEVELAND --  Devonte Graham hit the biggest shot of the game. And then his coach came up with a clutch timeout.\n\nGraham hit a 3-pointer with 26 seconds left to break a tie and cap Charlotte's late rally in the Hornets' 109-106 victory over the Cleveland Cavaliers on Thursday night.\n\n\"It was late in the clock, so I just let it fly,\" said Graham, who had 16 points after being held scoreless in the first half.\n\nGraham's shot from about 30 feet at the the top of the key gave Charlotte a 106-103 lead, but coach James Borrego's timeout a few seconds later might have saved the game.\n\nGraham hit two free throws with 9.7 seconds left for a 108-103 lead. After Cedi Osman's 3-pointer made it 108-106 with four seconds remaining, Dwyane Bacon's pass from under the basket went out of bounds.\n\nBecause the ball wasn't touched by a Cleveland player, Cavaliers coach John Beilien and his players erupted in protest when it was ruled Charlotte maintained possession. The Cavaliers were then informed that the Hornets were awarded timeout an instant before the ball was thrown in.\n\n\"I know we turned it over,\" Borrego said. \"The ball went out of bounds. I think we were very fortunate there.\"\n\nCavaliers guard Collin Sexton was close to the play, but wasn't aware the timeout had been called. He also thought the Cavaliers' failure to hold the lead played a bigger role in the loss.\n\n\"It could have went either way,\" he said. \"Once he (Bacon) got it, it went through the net and he threw it out real quick. We shouldn't have been in that position.\"\n\nTerry Rozier hit a foul shot with 3.6 seconds left, giving Cleveland a final chance but Sexton's 3-pointer from just inside halfcourt bounced off the rim.\n\n\"When I shot it, it felt looked good, felt good,\" Sexton said. \"I was feeling it and I let it go. It was right on target, but I missed it.\"\n\nThe Hornets came back from a nine-point deficit with five minutes to play to end a six-game losing streak Rozier led the Hornets with 30 points while Graham also had 11 assists. Bacon scored 15 points and P.J. Washington had 14.\n\nCleveland led 100-91 with 5:31 to play before Charlotte rallied. Sexton scored 21 points, and Kevin Love had 18 for Cleveland.\n\nTIP-INS\n\nHornets: F Marvin Williams left the game in the second half with what was announced as \"nasal trauma\" after being hit in the face. Borrego said Williams' status will be updated Friday. ... Graham and starting forward Miles Bridges were held scoreless in the first half. ... G Nicolas Batum missed his fourth straight game as a result of a coach's decision..\n\nCavaliers: G Dante Exum, appearing in his fourth game since being acquired on Dec. 23, scored seven points in 12 minutes. He was picked up from Utah for G Jordan Clarkson. ... Cleveland opened a four-game homestand.\n\nHE LIKES IT HERE\n\nRozier played high school basketball in suburban Shaker Heights. He scored a career-high 35 points against the Cavaliers on Dec. 18 and has hit 13 of 27 on 3-pointers in the two games in his hometown.\n\n\"Maybe we'll send him to Cleveland any time he needs a jolt,\" Borrego said.\n\nTOUGH ENDING\n\nBeilein was unhappy the Cavaliers couldn't finish off the Hornets especially after building a double-figure lead midway through the final quarter.\n\n\"Really disappointing, that one,\" he said. \"I don't think I'd say that I think we had it, but we played well enough at times. I told the team that when we look back at it there are going to be segments where we didn't play very good defense. They got layups or dunks or an open three that came back to haunt us.\"\n\nUP NEXT\n\nHornets: At Dallas on Saturday.\n\nCavaliers: Host Oklahoma City on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764996075.645099
}