{
  "game_id": "0021601096",
  "espn_id": "400900491",
  "date": "Mar 26, 2017",
  "matchup": "LAL vs. POR",
  "headline": "Blazers beat Lakers 97-81, tie Denver for final spot in West",
  "body": "LOS ANGELES -- As their surprising turnaround rolls on, the Portland Trail Blazers are now tied for the final playoff spot in the Western Conference.\nDamian Lillard scored 22 points and Portland beat the Los Angeles Lakers 97-81 on Sunday night to pull even with Denver for eighth place in the West. Both the Blazers and Nuggets are 35-38 with nine games left in the season -- and they play each other Tuesday night in Portland.\n\"We wanted to get to this point since the All-Star break,\" Trail Blazers coach Terry Stotts said. \"We put ourselves in a good position, but our hardest work is ahead of us.\"\nAfter overcoming an ugly first half for both teams, the Blazers bounced back with a decisive third quarter to win for the 11th time in 14 games.\nBoth teams shot only 32.6 percent in the first half, but Lillard got going in the second and the Blazers pushed an eight-point lead at the break to 21. They outscored the Lakers 37-24 in the third period.\nAllen Crabbe added 18 points off the bench for Portland. Noah Vonleh grabbed a career-high 14 boards, and the Blazers outrebounded the Lakers 61-42.\n\"They got a little hot,\" Lakers forward Julius Randle said. \"Guys made shots and we struggled all day offensively. It's tough.\"\nD'Angelo Russell had 22 points, but Tyler Ennis' 14 made him the only other Lakers player in double figures. Los Angeles shot 39.3 percent on the night.\n\"I thought our defense was solid the entire game,\" Stotts said. \"The first half, they only had 32 points.\"\nThe Blazers shot just 40.4 percent themselves, but were playing on back-to-back nights. They are 8-6 on the second night of a back-to-back.\nPortland, which has beaten the Lakers 12 consecutive times, hardly looked like a team with playoff ambitions when it finished February at 24-35. But the Blazers have gone 11-3 since to catch the Nuggets and set up a huge game Tuesday.\nDenver lost at home to the New Orleans Pelicans earlier Sunday night.\n\"Obviously, it takes on significance when you are playing the team you are tied with,\" Stotts said. \"So it's important, but after that one is over the next one is going to be more important.\"\nThe Lakers, who won their previous game against the Timberwolves, have won consecutive games only once since mid-November.\nTIP-INS\nTrail Blazers: Shot 62.4 percent against Minnesota on Saturday, their best mark since hitting 64.1 percent on March 12, 2003. Coming into Sunday, they had shot 50.6 percent over their last five games.\nLakers: Rookie forward Brandon Ingram, who started the previous 19 games and averaged 12.1 points on 48.4 percent shooting, did not play because of right patellar tendinitis. Said coach Luke Walton: \"He was out there warming up and it's not right.\" Corey Brewer got his first start for the Lakers.\nVONLEH RISING\nThe third-year forward is looking more and more comfortable for the Blazers. He's started the last 17 games, and his 14 rebounds Sunday came two games after he established his previous high with 12.\nCLARKSON INJURED\nLakers guard Jordan Clarkson bruised his right pinkie in the second quarter. X-rays at halftime were negative and he started the third period with the finger taped. He was only 4 of 16 from the field.\nUP NEXT\nTrail Blazers: Face the Nuggets for the final time this season Tuesday in Portland. The Blazers lead the season series 2-1. Lillard is averaging 36.3 points against Denver.\nLakers: Host the Washington Wizards on Tuesday and will face a top NBA backcourt for the second consecutive game. Los Angeles lost the first meeting 116-108 when John Wall and Bradley Beal combined for 56 points for Washington.",
  "source": "espn_api",
  "crawled_at": 1764995360.602828
}