{
  "game_id": "0021600596",
  "espn_id": "400900017",
  "date": "Jan 13, 2017",
  "matchup": "OKC @ MIN",
  "headline": "Russell Westbrook's 19th triple-double is most in season since Wilt Chamberlain",
  "body": "MINNEAPOLIS -- Russell Westbrook piled up another triple-double in a season full of them.\nThe Minnesota Timberwolves' improving defense made sure he had a fourth double that he wanted nothing to do with.\nKarl-Anthony Towns had 29 points and 17 rebounds and Ricky Rubio added 14 points and 14 assists to help the Timberwolves to their third straight victory, 96-86 over the Oklahoma City Thunder on Friday night.\nWestbrook has been a one-man wrecking crew this season, entering the game as the second player in league history to average at least 30 points, 10 assists and 10 rebounds per game through the first 40 games. His 19 triple-doubles are the most in a season since Wilt Chamberlain had 31 in 1967-68.\nBut he made just 7 of 23 shots against the Wolves and was 1-for-10 from 3-point range.\n\"It don't mean [expletive],\" Westbrook cracked. \"We lost.\"\n\nWestbrook had 21 points, 12 assists and 11 rebounds on Friday. But he also had 10 turnovers in Oklahoma City's first loss in four games.\nWestbrook is the only player since 1973-74 to record multiple triple-doubles with at least 10 turnovers in a single season, according to Elias Sports Bureau.\n\"Just some miscues, my fault on my passes,\" Westbrook said. \"Some were open, some was not. But it happens.\"\nAndrew Wiggins scored 19 points and Brandon Rush had 11 for the Timberwolves, who have won three in a row for the first time all season. The Wolves held the Thunder to 38.8 percent shooting and scored 33 points off of 19 Oklahoma City turnovers.\n\"There's nothing better than a talented player with confidence,\" Towns said. \"Those are the most dangerous players. I think right now we have a lot of confidence. So right now we're just rolling with it.\"\nZach LaVine missed his second straight game for Minnesota with a hip pointer, but the Wolves still managed to shoot 45 percent. Towns made 11 of 17 shots, including a beauty of a scoop with five minutes to go that gave Minnesota a 13-point lead.\nThe Wolves' defense had been startlingly poor in its first season under defensive guru Tom Thibodeau but has shown marked improvement of late. Minnesota entered the game sixth in the league in defensive rating over the previous 15 games, then put the clamps on Oklahoma City to improve to 8-8 after a 6-18 start.\nEnes Kanter had 21 points and eight rebounds for the Thunder.\nTIP-INS\nThunder: Westbrook surpassed his triple-double total for all of last season. ... Victor Oladipo scored 19 points. ... Kanter hit a 3-pointer at the end of the first quarter, just his fifth of the season.\nTimberwolves: Rubio also had four steals and five turnovers. ... Rubio's 46 assists over the past three games is tied with Westbrook for the most dimes in a three-game span this season. ... Towns had his 10th straight double-double and 30th of the season.\nRUBIO SHINES\nRubio tied a franchise record with 17 assists in a win over the Rockets on Wednesday, had another 15 assists in the win over Dallas on Monday and was at his best in the third quarter on Friday night. He had six points and seven assists in the quarter, scoring or assisting on nine of Minnesota's 12 field goals in the period. He also checked Westbrook for the entire period, helping to hold him to 0 for 7 shooting with five turnovers in 12 minutes.\n\"The results are there,\" Rubio said. \"I don't want it to be just a four-game stand. I want to be all season long like that.\"\nNO-KC\nThe 86 points were a season low for the Thunder, who were coming off impressive wins over Denver, Chicago and Memphis. They shot 32 percent from the field and 8 percent (1 for 12) from 3-point range and scored just 36 points in the second half on Friday.\n\"You're going to have games where you don't shoot the ball particularly well from the 3-point line,\" OKC coach Billy Donovan said. \"That was one of those games. But I thought the turnovers coupled with the fact that we just could not make any plays around the basket when we needed to hurt us.\"\nUP NEXT\nThunder: Oklahoma City heads to Sacramento for a game on Sunday, the second of its six-game road trip.\nTimberwolves: Minnesota starts a three-game road trip in Dallas on Sunday.\nInformation from The Associated Press was included in this report.",
  "source": "espn_api",
  "crawled_at": 1764995289.3712928
}