{
  "game_id": "0022400495",
  "espn_id": "401705061",
  "date": "Jan 06, 2025",
  "matchup": "BKN vs. IND",
  "headline": "Tyrese Haliburton scores 23 points to help Pacers beat Nets 113-99",
  "body": "NEW YORK -- — Tyrese Haliburton scored 23 points, Bennedict Mathurin added 20 and the Indiana Pacers beat the Brooklyn Nets 113-99 on Monday night.\n\n\r\n              Pascal Siakam contributed 19 points and Obi Toppin scored 11 for the Pacers, who have won three straight and nine of 12.\n\n\r\n              Day'Ron Sharpe had 16 points and 13 rebounds, Tyrese Martin added 15 points and Noah Clowney scored 14 for the Nets, who have lost 10 of 13.\n\n\r\n              Indiana led by 24 points in the third quarter before the Nets went on a 12-0 run over the last 4:30 of the period to trim the deficit to 78-70.\n\n\r\n              Brooklyn fell behind by 14 early in the fourth quarter and got within 10 before the Pacers responded with a 14-2 spurt, capped by a dunk and a 3-pointer from Toppin that increased the lead to 105-83 with 4:33 left.\n\n\r\n              Indiana shot 53% from the field and hit 41% beyond the arc before halftime to take a 55-39 lead at the break as the Nets had their lowest-scoring first half of the season.\n\n\r\n              Takeaways\r\n              Pacers: Andrew Nembhard was the lone starter not to score in double figures. He went 3 for 8 and finished with eight points.\n\n\r\n              Nets: Brooklyn’s previous season-worst first half was a 41-point effort against San Antonio on Dec. 27.\n\n\r\n              Key moment\r\n              \r\n              During the 14-2 run late in the fourth quarter, Haliburton made a 3-pointer and on the next possession was dribbling just past halfcourt when he zipped a pass to Mathurin for a dunk.\n\n\r\n              Key stat\r\n              \r\n              The Pacers shot 50.6% from the field and 91.3% (21 of 23) from the free-throw line. They held the Nets to 30.3% shooting from long distance.\n\n\r\n              Up next\r\n              Pacers: Host Chicago on Wednesday.\n\n\r\n              Nets: Host Detroit on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997988.8358111
}