{
  "game_id": "0022300160",
  "espn_id": "401584788",
  "date": "Nov 08, 2023",
  "matchup": "BKN vs. LAC",
  "headline": "Reserve Lonnie Walker scores 21 points as Nets send Clippers to their 4th road loss",
  "body": "NEW YORK -- — Lonnie Walker came off the bench to score 21 points and Day’Ron Sharpe added 11 points and 10 rebounds as the Brooklyn Nets beat the Clippers 100-93 on Wednesday night, sending Los Angeles to its fourth road loss.\n\n\r\n              Cam Thomas scored 14 points in the first half for the Nets before leaving the game early in the third period with a sprained left ankle after being tripped by PJ Tucker while driving to the basket. Dorian Finney-Smith added 12 points for Brooklyn, which snapped a two-game losing streak.\n\n\r\n              With Thomas out, Brooklyn coach Jacque Vaughn said he entrusted Walker more, drawing plays for him during timeouts and placing him on pick-and-rolls toward the end of the game.\n\n\r\n              It paid off. Walker shot 5 for 11 from the field, including 3 for 5 from long distance, for 13 points in the last two quarters.\n\n\r\n              “Just a lot of self-confidence,” Walker said. \"Understanding my capabilities. I really put a lot of time and effort into the game. I sacrifice a lot of time and effort into the game. What you put in is what you’re going to get out of it.”\n\n\r\n              Paul George scored 24 points and Kawhi Leonard 17 for the new-look Clippers, who lost their third straight. Ivica Zubac had 10 points and 10 rebounds and James Harden added 12 points and eight rebounds in his second game with Los Angeles since being acquired from Philadelphia on Oct. 30.\n\n\r\n              Clippers coach Tyronn Lue noticed that his quartet of stars — George, Leonard, Harden and Russell Westbrook — appeared too passive for the second consecutive night – after losing by 14 points to New York at Madison Square Garden on Monday night.\n\n\r\n              “When we were getting open shots they were not taken and that forces us to take even harder shots,” Lue said. “So, just trying to find those guys on the floor, just not step on each other’s toes. But they got to be themselves. That’s the biggest thing, that’s the biggest message, be who you are and if you’re doing too much we’ll let you know.”\n\n\r\n              Los Angeles shot 36 for 91 from the field, 8 for 36 from the 3-point line, and had 15 turnovers.\n\n\r\n              George said the team didn’t expect all four stars to click immediately.\n\n\r\n              “We’re going to go through growing pains. We’re going to come out of this and we’ll probably have to make another adjustment based on how the season goes later in the year,” he said. “I’m not worried about this. We want to win these games. These are games that we feel we should win.”\n\n\r\n              Sharpe gave the Nets a needed boost off the bench, scoring nine points in the fourth quarter.\n\n\r\n              “We all, as a collective group, just stepped up,” he said.\n\n\r\n              Sharpe hit an off-balanced shot off the glass as Zubac tried for the block that put the Nets ahead 98-79 with 6:42 remaining.\n\n\r\n              Leonard cut the deficit to 94-90 with 1:17 to remaining, but Spencer Dinwiddie answered with a 3-pointer.\n\n\r\n              Los Angeles called a timeout, but George turned the ball over on its following possession. Westbrook later had a shot blocked and Harden missed a 3-point try.\n\n\r\n              Royce O’Neal then hit a 3-pointer to seal the win for the Nets.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Conclude a four-game trip at Dallas on Friday night.\n\n\r\n              Nets: Visit the Boston Celtics on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996611.428399
}