{
  "game_id": "0022301090",
  "espn_id": "401585718",
  "date": "Apr 01, 2024",
  "matchup": "ORL vs. POR",
  "headline": "Franz Wagner scores 20, Magic escape with a 104-103 win over struggling Trail Blazers",
  "body": "ORLANDO, Fla. -- — The Portland Trail Blazers' 10th straight loss came down to one shot, and it was a good one.\n\n\r\n              But Deandre Ayton missed an open baseline jumper at the buzzer and the Orlando Magic won 104-103 on Monday night.\n\n\r\n              Franz Wagner scored 20 points, Wendell Carter Jr. had 17 points and 13 rebounds and the Magic, sitting in a tight pack of Eastern Conference playoff hopefuls with seven games left, escaped with a victory in the last of eight straight home games.\n\n\r\n              “You want to play a great game but basketball is an imperfect game,” said Jalen Suggs, who scored Orlando's final points from the foul line with 1:19 left. “It’s important to understand that. We learned something tonight. We need to be better, but we got a win.”\n\n\r\n              The Magic are fifth in the East, a half-game behind New York, 1 1/2 ahead of Indiana and 2 1/2 ahead of Miami.\n\n\r\n              Three nights after losing by 60 points at Miami, the Blazers came back twice in the second half and put themselves into position to win with the final shot.\n\n\r\n              After Paolo Banchero missed a long jumper, Ayton got the rebound and Portland called timeout.\n\n\r\n              Scoot Henderson drove the lane, drew some defenders and found Ayton open.\n\n\r\n              “Scott maybe got fouled, but you’re playing against one of the best defenses in the league. There's going to be physicality,” Portland coach Chauncey Billups said. “But at the end of the day we get D.A. a wide-open 15-foot shot, which is his money.”\n\n\r\n              Ayton had 20 points and 12 rebounds. Dalano Banton came off the bench to score 26 points for Portland. Henderson finished with 13 points, nine assists and eight rebounds.\n\n\r\n              “We're not going to let anybody come in an roll over on us,” Banton said. “I feel that was the biggest thing, even when we were down 15 and knowing where we came from last game.”\n\n\r\n              Carter hit a 3-pointer early in the third quarter, opening a 17-point run that gave Orlando the first double-digit lead of the game. But the Blazers charged back and took the lead on Banton's 3 with 5:42 remaining.\n\n\r\n              Suggs answered with a 3 and a three-point play for the Magic, and Wagner's three-point play with 3:04 left stretched Orlando's lead to 102-93.\n\n\r\n              But the Blazers came back again before Ayton's shot missed at the buzzer.\n\n\r\n              “I couldn’t have drawn up a play any better than that to get a guy like that a good shot,” Billups said. “So we’ll live with that.”\n\n\r\n              Magic coach Jamahl Mosley's 100th career victory turned out to be a narrow escape.\n\n\r\n              “This is a win we're going to learn from, and how we have to respect and approach every single night when we come out,” Mosley said.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Visit Charlotte on Wednesday.\n\n\r\n              Magic: Visit New Orleans on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996174.695188
}