{
  "game_id": "0022300312",
  "espn_id": "401584940",
  "date": "Dec 13, 2023",
  "matchup": "MIA vs. CHA",
  "headline": "Robinson scores 23 points, Heat top Hornets 115-104 to finish off home-and-home sweep",
  "body": "MIAMI -- — Sweeping a two-game set hasn't been easy for the Miami Heat, and changing that was on coach Erik Spoelstra's mind Wednesday night.\n\n\r\n              His team responded.\n\n\r\n              Duncan Robinson scored 23 points, Jaime Jaquez Jr. and Kyle Lowry each added 17 and the Miami Heat beat the Charlotte Hornets 115-104 — finishing off a two-game home-and-home series that started on Monday.\n\n\r\n              “We haven't been able to do it this year and, you know, not many teams have been able to do that,” Spoelstra said, noting that Miami had gone 1-1 in its other two-game series opportunities this season. “It's a small thing. It's not everything. But it's something.”\n\n\r\n              Lowry was perfect shooting — 5 for 5 from the floor, 4 for 4 of those on 3-pointers and 3 for 3 from the line. Jimmy Butler had 15 points and 10 assists, and Jamal Cain added 14 points for the Heat. Thomas Bryant finished with 11.\n\n\r\n              Robinson made six 3-pointers, tying his season-best. The Heat are 8-1 when he makes at least four 3-pointers this season.\n\n\r\n              “These guys put a lot of pressure on the defense in the paint,” Robinson said. “It's helped me to kind of move without the ball and find a window.”\n\n\r\n              Terry Rozier scored 28 points for Charlotte, which got 20 points from Gordon Hayward, 19 from Miles Bridges and 18 from Brandon Miller.\n\n\r\n              The Heat had a 45-13 edge in bench scoring and a massive edge in points off turnovers. They turned 21 Charlotte giveaways into 32 points, while the Hornets turned Miami's season-high of 22 turnovers into only 13 points.\n\n\r\n              “They’re going to create a lot of turnovers,\" Hornets coach Steve Clifford said. \"I think we had eight in the first quarter. You know, we were better in the second quarter until the end. But they’re good at it. We had some careless ones. It's a big part of what they do.”\n\n\r\n              The Heat were again without Bam Adebayo (hip), Haywood Highsmith (back) and Tyler Herro (ankle), plus saw Josh Richardson miss the game with a non-COVID illness. There may be hope for Herro to return soon, given that he posted a video of himself shooting on the Heat game court Tuesday night.\n\n\r\n              The Hornets lost PJ Washington to a left shoulder injury; he played four first-half minutes and did not return. Charlotte was also without LaMelo Ball (ankle) for the seventh straight game — the Hornets are 2-5 since he got hurt — and Mark Williams (back) for the third time in the last four games.\n\n\r\n              Charlotte scored the opening four points in the game's first 17 seconds, tying the quickest start to a game this season. And that four-point lead was also the largest the Hornets would enjoy at any point in the game.\n\n\r\n              The middle two quarters were all Miami: The Heat outscored the Hornets 69-47 in those 24 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host New Orleans on Friday night.\n\n\r\n              Heat: Host Chicago on Thursday night, the start of another two-game series that continues Saturday in Miami.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995372.7017071
}