{
  "game_id": "0021800306",
  "espn_id": "401070987",
  "date": "Nov 28, 2018",
  "matchup": "CHA vs. ATL",
  "headline": "Lamb, Zeller lift Hornets past Hawks 108-94",
  "body": "CHARLOTTE, N.C. --  Hornets coach James Borrego told Jeremy Lamb before the season that the starting spot at shooting guard was his -- as long as he earned it.\n\nThat was all Lamb needed to hear.\n\nLamb scored 22 points, Cody Zeller had a season-high 19 and Charlotte avenged a loss to Atlanta with a 108-94 victory over the Hawks on Wednesday night.\n\nLamb is taking advantage of his first real chance for a regular starting job in the NBA by scoring at least 18 points in seven of Charlotte's last eight games.\n\n\"It was huge,\" Lamb said of Borrego expressing confidence in him. \"You always want your coaches to believe in you, to trust you. He didn't just give me the spot. He told me I had to earn it. And that's what I am trying to do.\"\n\nBorrego was hired in May. The former San Antonio assistant felt a backcourt of former Connecticut stars Kemba Walker and Lamb could be \"dynamic\" in his offense.\n\nThe 6-foot-4 Lamb came into the league with a reputation as a shooter, but has been improving on getting to the rim and creating shots for himself. Borrego also liked Lamb's length.\n\n\"I thought he fit well next to Kemba,\" Borrego said. \"I thought he could play-make, but I didn't know to this level. I didn't know he could play off the bounce like this. To his credit, he's advanced and grown off the dribble.\"\n\nAs for Lamb's recent scoring stretch, Borrego said: \"We're starting to expect this out of Lamb now, which is a good thing.\"\n\nThe win helped the Hornets erase a bad memory from Sunday night when the Hawks snapped a 10-game losing streak with a 124-123 victory, with John Collins blocking Walker's shot at the buzzer.\n\nThere was no such drama this time around.\n\nCharlotte (11-10) limited Atlanta to 34 percent shooting to move back above .500 on the season and improve to 8-3 at home.\n\nTrae Young had 18 points for the Hawks, who were coming off a 115-113 win at Miami on Tuesday night.\n\nTIP-INS\n\nHawks: Opened by making four of five shots from beyond the 3-point arc but finished the game 11 of 44.\n\nHornets: Malik Monk left in the second half with a quad contusion. ... Frank Kaminsky continued to see extensive minutes off the bench ahead of Willy Hernangomez. Kaminsky finished with eight points on 3-for-9 shooting.\n\nWALKER'S OFF NIGHT\n\nWalker, who came in averaging 27.9 points per game, finished with 19 points while battling through an off shooting night. He was 6 of 19 from the field and 6 of 10 from the foul line.\n\n\"Anytime you have a player like Kemba, he's hard to scheme,\" Hawks coach Lloyd Pierce said. \"But when he has an off night you have to take advantage of it. For them, they did. He still played well I thought. He just didn't have the explosive Kemba Walker-type of night.\"\n\nPLAYING THROUGH ZELLER\n\nWith the Hornets struggling offensively early on, they began playing through the 7-foot Zeller.\n\n\"The way they guard us, they create a lot of one-on-one matchups so we start to play through our bigs a lot,\" Borrego said. \"Cody got to the rim some, was playmaking. A lot of our stuff tonight was playmaking through the five-man.\"\n\nANDERSON RETURNS\n\nAtlanta shooting guard Justin Anderson returned after missing time with a leg injury. He scored 10 points and grabbed eight rebounds.\n\n\"It obviously feels good for me having had the game taken away from me for about six months, being able to get back out there and everything for me, just competing,\" Anderson said. \"Obviously it wasn't the result that we wanted, but we hung in there and we fought.\"\n\nUP NEXT\n\nHawks: Visit the Thunder on Friday night.\n\nHornets: Host the Jazz on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994418.53394
}