{
  "game_id": "0022200360",
  "espn_id": "401468515",
  "date": "Dec 06, 2022",
  "matchup": "LAL @ CLE",
  "headline": "Mitchell upstages LeBron at home, Cavs down Lakers 116-102",
  "body": "CLEVELAND -- — As a kid growing up in New York, Donovan Mitchell idolized LeBron James. On Tuesday night, he upstaged him.\n\n\r\n              Mitchell scored a season-high 43 points and Jarrett Allen returned from injury to add 24, leading the Cleveland Cavaliers to a 116-102 victory over the Los Angeles Lakers in James' only visit home this season.\n\n\r\n              With Anthony Davis missing the final three quarters because of illness, the Cavs improved to an NBA-leading 11-1 on their floor, their best start at home since 2015-16, when James led them to a championship.\n\n\r\n              Mitchell, who has Cleveland fans dreaming of another title run, took over in the second half and scored 29 points with the kind of performance James had routinely during his 11 seasons for the Cavs.\n\n\r\n              “You always want to spoil the homecoming,” Mitchell said with a smile.\n\n\r\n              With Cleveland leading by 12 in the fourth, Mitchell buried a 3-pointer from the left wing to finish the Lakers. After dropping the shot, the All-Star guard strutted around the Rocket Mortgage FieldHouse floor nodding his head as James helplessly watched.\n\n\r\n              “He's Mitchell,” James said. “He's a special kid.”\n\n\r\n              Darius Garland added 21 points and 11 assists for Cleveland.\n\n\r\n              James finished with 21 points and 17 rebounds, losing for just the third time in 20 games against the Cavs. \n\n\r\n              Dennis Schroder and Russell Westbrook added 16 points apiece as Los Angeles had its four-game winning streak stopped.\n\n\r\n              Davis went out after eight minutes with flu-like symptoms. The eight-time All-Star had scored 99 points in his previous two games and had been playing as well as he has in several seasons after being plagued by injuries.\n\n\r\n              Davis didn't attempt a field goal and scored just one point before leaving.\n\n\r\n              “It got progressively worse as the day went on,” Lakers coach Darvin Ham said. \"His temperature was 101 and some change. A-D wanted to try to play, but he felt too weak. He’s drained and dehydrated.\n\n\r\n              “That’s a huge loss, obviously, with the way he’s been playing lately.”\n\n\r\n              Without Davis clogging the middle, Allen, who missed the last five games with a bruised back, made his first 10 shots and helped the Cavs take a 57-49 halftime lead.\n\n\r\n              “Next man up,” James said when asked how he reacted to losing Davis. “That's a tall task — literally and figuratively.”\n\n\r\n              The Cavs welcomed James back with a video tribute during an early timeout. After a montage of clips, including some from 2016, James waved to the crowd and then blew kisses to show his appreciation.\n\n\r\n              The warm scene was in contrast to what happened almost exactly 12 years ago, when he came back with the Miami Heat and was met with boos and worse on a night James has said he'll never forget.\n\n\r\n              James said he was caught off guard by the tribute.\n\n\r\n              “It's always love coming back here,” he said. “The memories I have here will never be forgotten.”\n\n\r\n              GRUDGE MATCH\n\n\r\n              Ham wasn't aware of James' dominance over the Cavs until it was brought up during his pregame availability.\n\n\r\n              Ham has two theories on why James takes it out on Cleveland.\n\n\r\n              “Either he likes to put on a show or he really doesn't like (Cavs owner) Dan Gilbert,” Ham joked.\n\n\r\n              James and Gilbert had a famous falling out when the four-time champion left for Miami as a free agent in 2010.\n\n\r\n              TIP-INS\n\n\r\n              Lakers: James' 17 rebounds are his most in a road game. ... Davis was limited to just 76 games over the previous two seasons due to injuries. ... Los Angeles has not won a game that it did not lead at halftime, losing all nine. The Lakers are 0-10 when trailing after three quarters. ... Shot 6 of 36 on 3-pointers. \n\n\r\n              Cavaliers: Mitchell's 17 field goals are a career high. ... Kevin Love came in leading the league with 13 charges drawn. ... Competitive eating champion Joey Chestnut scarfed down more than 40 pierogies at halftime to defeat three fans who couldn't beat him while combining their totals.\n\n\r\n              UP NEXT \n\n\r\n              Lakers: Continue six-game trip in Toronto on Wednesday. \n\n\r\n              Cavaliers: Host Sacramento on Friday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995054.973407
}