{
  "game_id": "0022000260",
  "espn_id": "401267420",
  "date": "Jan 25, 2021",
  "matchup": "BKN vs. MIA",
  "headline": "Harden, Durant help Nets break away late, beat Heat 98-85",
  "body": "NEW YORK -- — Kevin Durant wasn’t making shots. James Harden was barely taking them.\n\n\r\n                    That sent the Brooklyn Nets into a defensive struggle, and the NBA’s highest-scoring team handled it well until their superstars showed up. \n\n\r\n                    Harden and Durant each scored 20 points despite three relatively quiet quarters, and the Nets broke away with a big run in the fourth to beat the Miami Heat 98-85 on Monday night. \n\n\r\n                    Kyrie Irving added 16 points for the Nets, who completed a sweep of the Heat in two games that couldn't have been more different. Brooklyn won 128-124 on Saturday, then took the rematch despite barely topping its lowest-scoring game of the season.\n\n\r\n                    “I think our defense held tight the whole game,” Durant said. “Once we were able to start making some shots there in the fourth, we were able to pull away. But our defense won us this game for sure.”\n\n\r\n                    Harden had only 10 points and five shots through three, then scored 10 more in the 18-2 spurt that turned a tie game into a 96-80 lead. The NBA's assists leader finished with eight, but struggled to search for his own shot until changing his mentality in the fourth. \n\n\r\n                    “Just being aggressive,” he said. “I think I wasn’t very aggressive throughout the course of the game.” \n\n\r\n                    Durant shot just 4 for 17 through three, then hit two 3-pointers in the fourth, the latter snapping a 78-all tie and igniting the big run.\n\n\r\n                    Bam Adebayo had 26 points, 10 rebounds and five assists in a strong follow-up to his career-high 41 points Saturday. But outside of Goran Dragic's 21 points, there was little else for a short-handed Heat team that is without Jimmy Butler and Avery Bradley because of health and safety protocols. Tyler Herro, Meyers Leonard and Maurice Harkless are injured. \n\n\r\n                    But it looked for a while as though they could pull it out anyway, shutting down a team that came in averaging 120.3 points per game until midway through the final period.\n\n\r\n                    “Their talent just took over at the end,” Heat coach Erik Spoelstra said. “I love the way our guys competed.” \n\n\r\n                    The Nets were 4 for 21 (19%) in the first quarter, missing all 10 3-pointers in their lowest-scoring period of the season, which ended with Miami leading 21-15.\n\n\r\n                    The second quarter was slightly easier on the eyes — and rims. Miami took a 45-41 edge into halftime, going just 4 for 19 on 3s but doubling the Nets' makes after they went 2 for 17.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Adebayo beat the buzzer to end the third quarter with a 3-pointer that gave Miami a 71-70 lead. He also made a 3 as time expired to end the first half Saturday, followed by a long jumper in the final second of the third quarter. ... Duncan Robinson was 1 for 10, all from 3-point range.\n\n\r\n                    Nets: Durant missed his first six 3-point attempts before sinking one in the third quarter. He finished 3 for 12 behind the arc and has scored 20 points in every game this season. ... The Nets have won five straight at home.\n\n\r\n                    KYRIE AND KOBE\n\n\r\n                    Irving arrived at the arena wearing a No. 8 Kobe Bryant Lakers jersey. In a video posted by the Nets, he pulled his jacket open for a full view of the jersey, saying: “You know who I was rocking tonight. Come on, it’s obvious.”\n\n\r\n                    The Nets were scheduled to play at the Knicks last Jan. 26, hours after the helicopter crash that killed Bryant. Irving left the arena, too distraught to play following the death of his friend. \n\n\r\n                    HARDEN'S ADJUSTMENTS\n\n\r\n                    Harden had just two baskets, both in the fourth quarter, during Saturday's game. He then took only two shots in the first half Monday in another passive performance.\n\n\r\n                    But coach Steve Nash said before the game he wasn't worried about the three-time scoring champion as he adjusts to his new team. \n\n\r\n                    “Would I like James to be more aggressive? Yes. Will he be more aggressive in time? I think so,” Nash said. “I think once he gets more comfortable with his teammates, when he gets in better shape, when he’s adapted to this whole new environment, we’ll see an improved James scoring the ball.\"\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Host the Denver Nuggets on Wednesday to start a six-game homestand.\n\n\r\n                    Nets: Open a three-game road trip Wednesday at Atlanta.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997513.342844
}