{
  "game_id": "0021701198",
  "espn_id": "400975944",
  "date": "Apr 08, 2018",
  "matchup": "DAL @ PHI",
  "headline": "76ers rout Mavericks to win 14th in row, tie club mark",
  "body": "PHILADELPHIA -- Philadelphia 76ers coach Brett Brown acknowledged that after he told his players and the media before the season began that the goal was to make the playoffs, it \"wasn't well received\" by many in the cautious front office.\nTurns out, Brown had the pulse of The Process. Not only are the Sixers headed to the postseason, they're poised to make some noise.\nJJ Redick scored 18 points, and the surging 76ers matched a single-season franchise record with their 14th consecutive victory, 109-97 over the Dallas Mavericks on Sunday.\nBen Simmons added 16 points, seven rebounds and nine assists, and Robert Covington had 15 points and 10 rebounds. Two years after going 10-72, the Sixers (50-30) clinched home-court advantage in the first round of the playoffs and secured their first 50-win season since Allen Iverson's 2000-01 team, which lost in the Finals.\n\"In our profession, Brett has become a legend,\" said Dallas coach Rick Carlisle, whose team has begun its own rebuild. \"He's just been unshakable as a leader and as a guy that's always pushed his teams to always play at their highest capacity in terms of energy and effort.\n\"And as this thing has gone along, in the fourth or fifth year, they've built up the guys that they like and they've gotten rid of a lot of other guys that weren't quite good enough. They've added a few veterans and they've done a great job with the draft.\"\nThe only other time the Sixers won 14 straight in a single season, Dr. J and Moses Malone delivered Philadelphia its last NBA title in 1983. The 76ers won 18 straight spanning the 1966-67 and 1967-68 seasons for the franchise's longest overall win streak.\n\"I wouldn't want to play these guys in the first round with them having home-court,\" Carlisle said. \"Not in this place.\"\nBut Brown, now 125-283 in his fifth year in Philly, is still taking the long view after experiencing the pain of The Process' early years.\n\"We are growing a culture,\" Brown said. \"And, oh by the way, we've won 50 games and we have home-court advantage and we've tied a record. That's true. But that is never really what's most on my mind.\"\nHarrison Barnes scored 21 points on 9-of-25 shooting, and Dennis Smith Jr. added 20 points for the Mavericks, who have lost three straight and six of seven.\n\"I thought we played pretty hard,\" Carlisle said. \"This is a very hard team to play.\"\nThe undermanned Mavs were no match for the Sixers, who won their sixth in a row without injured All-Star Joel Embiid, who is out until at least the start of the playoffs with an eye injury. They moved a game ahead of idle Cleveland for the No. 3 seed in the Eastern Conference with two games left.\nTwo days after an emotional win over the Cavaliers, the Sixers missed five of their first six shots. But Simmons keyed a 17-3 second-quarter run by assisting on Covington's consecutive 3-pointers before his twisting layup in traffic that made it 50-34.\nThe Sixers led by 19 before Smith helped get the Mavs within four points late in the third quarter. But the Sixers quickly got the lead back to double figures.\nDallas shot 11 of 40 from 3-point range in its final road game. The Mavs will soon face big decisions in the draft and free agency that the Sixers were once contemplating.\n\"I hope that I represent a real-time example to other owners that can say, `Here's the plan, and we're really going to adhere to the plan and walk it down and not blink,\" Brown said. \"We have fantastic owners that have said something to me and they have delivered.\"\nTIP-INS\nMavericks: Barnes started 0 of 7 from the field and missed his first three free throws. ... Dallas finished 9-32 on the road.\n76ers: The 1982-83 Sixers won 14 straight from Dec. 21-Jan. 21. ... Philadelphia won 18 straight over two seasons in 1966. ... The Sixers last lost March 13 to Indiana. ... Ersan Ilyasova had 11 points and 12 rebounds.\nEMBIID UPDATE\nBrown said Embiid could resume conditioning and shooting as soon as Monday.\nFULTZ OVER MCCONNELL\nBrown thought rookie Markelle Fultz was just \"OK\" after getting nearly all the backup minutes at point guard ahead of T.J. McConnell. Brown said he hasn't decided if Fultz will be part of the postseason rotation.\n\"That remains a little bit of a mystery to us,\" Brown said. \"And it should. He hasn't played, as we all know, much NBA basketball.\"\nLOTTERY LOWDOWN\nThe Mavericks ensured they will stay below Orlando and keep the fourth-worst record in the NBA. Only Atlanta, Memphis and Phoenix have poorer records.\nUP NEXT\nMavericks: Season finale Tuesday night at home vs. Phoenix.\n76ers: Monday night at Atlanta.",
  "source": "espn_api",
  "crawled_at": 1764993933.194622
}