{
  "game_id": "0021800261",
  "espn_id": "401070942",
  "date": "Nov 21, 2018",
  "matchup": "BKN @ DAL",
  "headline": "Barnes scores season-high 28 as Mavericks beat Nets 119-113",
  "body": "DALLAS --  Devin Harris didn't return to the game when the Dallas guard was replaced shortly after scoring eight straight points to break a fourth-quarter tie.\n\nIt might have had something to do with him getting two of his game-high four steals in the same span.\n\nHarrison Barnes scored a season-high 28 points, Harris did the same with 18 -- sparked by his energetic surge -- and the Dallas Mavericks beat the Brooklyn Nets 119-113 on Wednesday night.\n\n\"He was absolutely gassed by the time he came out,\" coach Rick Carlisle said. \"I suppose we could have gone back to him in the fourth, but felt that it we could avoid it, it would be best.\"\n\nHarris, in his sixth game back after missing 10 with a left hamstring strain, made two free throws to put Dallas ahead for good early in the fourth and got a steal that led to another free throw before hitting a 3-pointer .\n\nAfter another steal, Harris hit a bank shot in the lane for a 95-87 Dallas lead. Those eight points alone were more than Harris scored in any of his six previous games.\n\n\"He's been awesome since he came back,\" said guard J.J. Barea, who also had 18 points and added seven assists. \"Smart player, defensively, offensively. He really had a great game tonight. And we needed it from the bench.\"\n\nTeenage rookie Luka Doncic had 21 points and nine rebounds as the Mavericks won their fifth consecutive home game. They kept the Nets from winning straight three straight on the road for the first time since late in the 2014-15 season, a night after a 12-point win in Miami.\n\nAllen Crabbe scored a season-high 27 points for the Nets, including consecutive 3-pointers followed by an assist on a dunk for Jarrett Allen on an 8-0 run that got Brooklyn within two with four minutes remaining.\n\nCrabbe was 10 of 16 from the field, including 7 of 11 behind the arc . The sixth-year guard came in shooting 27 percent.\n\n\"This has been a struggle,\" Crabbe said. \"The first 18 games, and in those 18 I think I was solid in two of those like tonight. So it feels good man. Like I told you guys the other night, shooter's gotta shoot. It'll click.\"\n\nBarnes, who was 5 of 8 from long range, answered the Crabbe-led run with a 3 to help the Mavericks get the lead back to nine with less than a minute to go.\n\nDallas won for the fifth time in six games on a night when Dirk Nowitzki was presented a key to the city by Dallas Mayor Mike Rawlings at halftime.\n\nThe German star is still waiting to start a record 21st season with the same franchise because of a longer-than-expected recovery from left ankle surgery seven months ago.\n\nTIP-INS\n\nNets: Leading scorer Caris LeVert missed his fifth straight game with a right foot injury. ... Ed Davis made all eight shots and finished with 17 points, while D'Angelo Russell also scored 17 but was just 6 of 18 from the field.\n\nMavericks: G Wesley Matthews was out for the fourth time in five games with a left hamstring strain. F/C Dwight Powell missed his second straight game with a left knee injury. ... G Dennis Smith Jr. played despite a right wrist sprain, finishing with season lows of four points and 19 minutes. ... C DeAndre Jordan had his 11th double-double with 12 points and 14 rebounds.\n\nDIRK CONNECTION\n\nNets coach Kenny Atkinson played for the team in Nowitzki's German hometown, Wurzburg, and said he remembers Nowitzki's mom having a role in handling the team's laundry. Atkinson also played for Braunschweig, and said he faced Nowitzki's Wurzburg team. \"He dropped 30 on us. He was 18 of 19,\" Atkinson said. Early the next morning, Atkinson said, he went to the gym to lift weights and Nowitzki was already there with longtime personal coach Holger Geschwindner. \"Right then, you're like, `This guy's special,\" said the 51-year-old Atkinson, who is in his third season with Brooklyn.\n\nSIXTH MAN PLUG\n\nBefore the game, Carlisle suggested Brooklyn's Spencer Dinwiddie would be a strong candidate for sixth man of the year. Then Dinwiddie went out and had 19 points while matching Barea with a game-high seven assists. \"He's accepted, he's embraced it, he's never complained about not starting,\" Atkinson said.\n\nUP NEXT\n\nNets: Face Minnesota on Friday to start stretch of seven of eight at home.\n\nMavericks: Host Boston on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995425.462368
}