{
  "game_id": "0022300842",
  "espn_id": "401585470",
  "date": "Feb 27, 2024",
  "matchup": "MIA @ POR",
  "headline": "Butler and Rozier make strong returns to the lineup, Heat beat Blazers 106-96",
  "body": "PORTLAND, Ore. -- — Jimmy Butler had 22 points and nine assists, Terry Rozier scored 19 points and the Miami Heat beat the Portland Trail Blazers 106-96 on Tuesday night for their fifth straight win.\n\n\r\n              Rozier was one of three players returning to the Miami lineup, playing in his first game since sustaining a knee injury on Feb. 11 against Boston.\n\n\r\n              “He has an ability to break the defense down, or at least get a defense to overreact,” Heat coach Erik Spoelstra said. “When you have multiple guys who are weapons like that, it’s good for your offense. I also really respect how much time he put into this to be able to get back and fast-track this.”\n\n\r\n              Added Rozier: “Just really no vacation for the (All-Star) break, trying to get back, putting in 2- or 3-a-days at a time. But I feel good. Credit to the medical staff, they did a great job of making sure I’m back and making sure I’m really fully healthy, making sure we didn’t rush nothing. I’m happy to be back.”\n\n\r\n              Butler and Nikola Jovic both made their returns after serving a one-game suspension for their roles in an on-court altercation in New Orleans on Feb. 23.\n\n\r\n              The Heat also used their 31st different starting lineup of the season, tying a franchise record. The Heat also had 31 combinations in the 2014-15 season; they needed only 58 games to match that mark this season.\n\n\r\n              Anfernee Simons scored 26 points for the Blazers, who led by 15 points. Jerami Grant had 24 points, seven rebounds and six assists.\n\n\r\n              Portland’s Deandre Ayton did not play in the second half, being ruled out with a right hand sprain. Ayton took a hard fall after a collision with Kevin Love in the first quarter and continued playing before being pulled at half, finishing with 12 points and 10 rebounds.\n\n\r\n              “X-rays were negative. I think there will be some further testing because he was in quite a bit of pain,” Blazers coach Chauncey Billups said. “I thought (Ayton) dominated that first half. Offensively, defensively, he dominated the game.”\n\n\r\n              The Heat quickly cut into the Blazers’ 10-point halftime lead, going on an 8-0 run to cut it to 56-54.\n\n\r\n              The Heat took their first lead at 73-71 with 4:07 left in the third quarter and led 80-76 entering the final period.\n\n\r\n              Portland tied the game twice early in the fourth quarter before the Heat pushed their lead to double digits.\n\n\r\n              Butler slowly brought the Heat back in the second quarter. Butler scored five quick points to cut the Blazers’ lead to eight and then assisted on a basket to make it 33-27.\n\n\r\n              Tyler Herro missed his second straight game with a knee injury while Thomas Bryant continues to serve his three-game suspension for his role in the New Orleans incident.\n\n\r\n              UP NEXT\n\n\r\n              Heat: At Denver on Thursday night.\n\n\r\n              Trail Blazers: At Memphis on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995345.32553
}