{
  "game_id": "0021800935",
  "espn_id": "401071608",
  "date": "Mar 02, 2019",
  "matchup": "DET @ CLE",
  "headline": "Kennard scores 26, Pistons punish Cavaliers 129-93",
  "body": "CLEVELAND --  Due to an arena-wide computer glitch, there were still several seconds remaining on the scoreboard clock when the officials signaled the game was over.\n\nThe Pistons ended it much earlier.\n\nLuke Kennard scored 26 points, Reggie Jackson added 24 and Detroit made sure it didn't have a letdown against a depleted Cleveland team as the Pistons built a 33-point lead in the first half and rolled to a 129-93 win Saturday over the Cavaliers, who were without star forward Kevin Love.\n\nAfter coach Dwane Casey said he wanted his group to play \"as a desperate team\" while pushing toward the playoffs, Detroit came out flying.\n\nThe Pistons, who entered holding the No. 7 spot in the Eastern Conference, scored 42 in the first quarter while taking a 71-38 halftime lead.  The score could have been more lopsided, but the officials convened at halftime and took away a basket by Detroit. It may have been Cleveland's best defensive stop of the night.\n\n\"We put together a really solid game, offensively, defensively,\" said Blake Griffin, who had 14 points, nine assists and seven rebounds in 26 minutes. \"The ball was moving. We played the right brand of basketball. I know I keep saying that, but we've been on a much better streak regardless of wins or losses.\"\n\nAndre Drummond had 13 points and 10 rebounds and got some extra rest for the Pistons, who play at Toronto on Sunday.\n\nRookie Collin Sexton scored 14 for the Cavs. Cleveland was again missing Love, who was rested while he continues to build up strength following a foot surgery that sidelined him for 50 games earlier this season. Love isn't ready to play in consecutive games, and with the Cavs hosting Orlando on Sunday, the team sat him.\n\nEven Love wouldn't have helped much.\n\nHis absence, along with big men Tristan Thompson (foot) and Ante Zizic (concussion) both being out, left Cleveland vulnerable inside and Detroit took advantage. The Pistons did whatever they pleased on offense, getting easy looks in the lane and behind the arc.\n\n\"They came out and punched us in the mouth early,\" Cavs forward Larry Nance said.\n\nJackson scored 12 points in the first quarter on 5-of-5 shooting, making a pair of 3-pointers as the Pistons began pulling away.\n\nKennard picked it up from there. He scored 14 in the second half, draining a 29-foot 3-pointer in the fourth quarter to put Detroit ahead 103-72.\n\n\"The one was deep,\" Kennard said. \"I was kind of surprised it went in. It felt good.\"\n\nNearby, teammate Langston Galloway warned reporters to be careful around the hot-shooting Kennard.\n\n\"Back up,\" he joked. \"You'll catch on fire.\"\n\nTIP-INS\n\nPistons: Drummond has reached double-digits in points and rebounds in 14 straight games. ... Detroit has made at least 12 3-pointers in 11 straight, extending the franchise record. ... Came in averaging 107 points, their highest average since 1987-88.\n\nCavaliers: Sexton missed his first seven field-goal tries and finished 3 of 13. ... Thompson has missed 18 straight games. ... Zizic remains in concussion protocol. He was injured in Thursday's win at New York. ... Cleveland had won its previous four home games against Detroit by at least 17.\n\nSTEP BACK\n\nThe Cavs have been without Love for much of the season, but Nance said that's doesn't excuse for selfishness.\n\n\"Not pleased with it from top to bottom,\" he said. \"It's easy to point fingers and blame one another. That's certainly what I thought we did. There was whole lot of finger pointing. I thought we took a step back, even without Kev. That shouldn't have been a 40-point game.\n\n\"We gotta look in the mirror tonight and come back tomorrow with a better attitude.\"\n\nFRYE'S GOODBYE\n\nCavs forward Channing Frye said his decision to retire after this season was easy. Family first.\n\n\"The straw that broke the camel's back, I was on vacation,\" explained Frye, who announced Friday on Twitter that he intends to stop playing after his 13th NBA season. \"I went to Puerto Rico with my kids and I saw our best friends who live down there and their kids are 12, 11, 10. My son is eight now. I'm like, `I want to go his practice and not have to worry about my practice.' I want to make time for them.\"\n\nThe 35-year-old Frye, who played on Cleveland's title team in 2016, hopes to be remembered for his honesty.\n\n\"By being real, whether it was goofy or rude or brash, whatever it is, just know that I was me all the time, I tried to be,\" he said. ... I met some amazing guys. Hopefully they say Channing was an amazing guy and send me a text once in a while.\"\n\nUP NEXT\n\nPistons: At Toronto on Sunday.\n\nCavaliers: Come right back and host Orlando on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994666.657067
}