{
  "game_id": "0021600295",
  "espn_id": "400899737",
  "date": "Dec 03, 2016",
  "matchup": "LAL @ MEM",
  "headline": "Daniels scores career-best 31 to lead Grizzlies past Lakers",
  "body": "MEMPHIS, Tenn. -- Memphis Grizzlies coach David Fizdale refers to the remaining members of his injury-plagued squad as the Nasty Nine.\nOn Saturday night, it was Troy Daniels turn to fill the void for the short-handed Grizzlies.\nDaniels scored a career-high 31 points, and the Grizzlies hung on for a 103-100 victory over the Los Angeles Lakers after Julius Randle three free throws with 5.9 seconds left.\nDaniels shot 12 of 23 from the field, including 6 of 12 from outside the arc. Marc Gasol had 19 points while JaMychal Green finished with 16 points and 13 rebounds as Memphis won its second straight.\n\"I was just taking what the defense gave me,\" Daniels said. \"And my teammates helped me get into those spots.\"\nLou Williams scored a season-best 40 points for the Lakers. Luol Deng added 18, and Timofy Mozgov had with 13.\n\"It just flowed,\" Williams said about his shooting. \"It was just one of those games.\"\nMemphis pulled away in a tight game with a 9-2 burst that erased a 95-94 Lakers lead in the final 5 minutes.\nWilliams converted a three-point play with 51 seconds remaining to pull the Lakers within one possession. They then had a chance to tie when Gasol fouled Randle on a 3-point attempt.\nAfter Randle missed the third free throw, there was a scramble for the ball, and Jordan Clarkson hurled up a 3-pointer from the right corner that was off the mark.\n\"They made the little plays,\" Lakers coach Luke Walton said about Memphis. \"Down the stretch, they got to a couple of loose balls that they turned into big plays.\"\nBoth teams were short-handed with injuries, particularly in the backcourt. Starters D'Angelo Russell and Nick Young already were out for the Lakers and Jose Calderon, who started, left in the first quarter with a right hamstring strain.\nThe Lakers held a 62-54 lead into the break.\nBut Memphis opened the second half with a 10-4 run, and the game settled into a close affair with 17 lead changes, nine of them in the fourth quarter.\nMemphis forward Tony Allen said Memphis came out a different team after intermission thanks to Fizdale's halftime speech.\n\"He's not going to sugarcoat anything,\" Allen said. \"He came in and gave us a scolding, and the guys responded.\"\nTIP-INS\nLakers: Williams' 40 points were the most ever scored by an opponent's reserve against Memphis. J.R. Smith had 35 for the Knicks on March 27, 2013. . Williams, who hit all 14 of his free throws in the game, has converted a free throw in 30 straight contests, longest streak in the league. ... The Lakers wrapped up a four-game trip over five days.\nGrizzlies: A contingent of Grizzlies executives, including coach David Fizdale, went to Marion, Indiana for the visitation of F Zach Randolph's mother, Mae Randolph, earlier Saturday. .Green recorded his second double-double of the season. ... Memphis had 32 assists on 41 made field goals. Gasol had eight and rookie Wade Baldwin had a season-best nine assists. .Memphis converted 18 turnovers into 25 points.\nTRIAGE UNIT:\nLakers: Russell (left knee injury), Young (strained calf, right leg) and reserve F Larry Nance Jr. (right knee contusion)\nGrizzlies: G Mike Conley, G Vince Carter, F Chandler Parsons and F James Ennis. Randolph remains away from the team after the death of his mother.\nWELCOME BACK NO. 1\nLakers reserve C Tarik Black is from Memphis and played at the University of Memphis before playing his final year at Kansas.\nWELCOME BACK NO. 2\nSome may forget that Lakers coach Luke Walton was hired as an assistant for the Memphis Tigers during the lockout prior to 2011 NBA season.\nUP NEXT\nLakers: Return home for the first time in a week to face the Utah Jazz on Monday night.\nGrizzlies: Travel to New Orleans to face the Pelicans on Monday night, the only road game over a six-game stretch.",
  "source": "espn_api",
  "crawled_at": 1764995433.066834
}