{
  "game_id": "0021300069",
  "espn_id": "400488942",
  "date": "Nov 06, 2013",
  "matchup": "OKC vs. DAL",
  "headline": "Kevin Durant's double-double, Westbrook's 22 lead Thunder over Mavs",
  "body": "OKLAHOMA CITY -- If there were any doubts left about whether Russell Westbrook still had his same explosiveness, the Oklahoma City point guard put those to rest once and for all.\nWestbrook finished with 22 points, including two thundering dunks, as the Thunder pulled away in the second half for a 107-93 victory over the Dallas Mavericks on Wednesday night.\nKevin Durant had 23 points and 10 assists, and Serge Ibaka added 17 points and 13 rebounds as Oklahoma City (3-1) won its 11th straight game over the Mavericks, including the playoffs. The last loss for the Thunder against Dallas was Jan. 2, 2012.\n\nThe win also was the Thunder's second straight since the return of their All-Star point guard, who rebounded from a 5-of-16 shooting performance in his first game back to finish 10-of-20 on Wednesday.\nThe two dunks -- including one in the fourth quarter when he soared down the lane to give the Thunder their biggest lead at 97-80 -- were the true measure of Westbrook's health after two offseason knee surgeries.\n\"That's God-given ability; you can't take that away,\" Durant said. \"I knew he would come back right, and he looked great tonight.\"\nMonta Ellis led Dallas (3-2), which was playing its second game in two nights, with 20 points. Jae Crowder and Shawn Marion added 17 points each, while Dirk Nowitzki finished with 16.\nEllis had seven of the Mavericks' 21 turnovers, which resulted in 27 fast-break points for Oklahoma City.\n\"They are a good team, and to win this game in this atmosphere, you really have got to be right and really have to be functioning well on all levels,\" Dallas coach Rick Carlisle said. \"And it just wasn't there for us tonight.\"\nThe Thunder led 57-51 at halftime, quickly extending that lead to as many as 15 points in the third quarter and remaining ahead by double figures throughout the fourth.\nWestbrook provided several of the game's biggest highlights and took control early against the Mavericks.\n\"It's what we expect,\" Oklahoma City coach Scott Brooks said. \"That's who he is. He's an aggressive player. He's a talented player that has improved every year.\n\"This is the guy that we all knew what he was going to do when he came back.\"\nWestbrook wasted little time in showing there were no ill effects, scoring eight of Oklahoma City's first 11 points.\nHe finished with only four assists, but he had plenty of help in the facilitating role from Durant and his 10 assists, as well as five assists off the bench from Reggie Jackson. The Thunder finished with a season-high 28 assists as a team.\nAlso, rookie Steven Adams finished with six points and nine rebounds in 20 minutes of action. The center dunked off an assist from Durant to put Oklahoma City up 42-39 in the second quarter, and he followed with a steal on the other end.\nAdams then threw the outlet pass to a streaking Westbrook, who finished the break with a one-handed dunk that put the Thunder up 46-39 and set the tone for the comfortable second half.\n\"It was good for me,\" Westbrook said. \"I'm still on the road to getting back to where I need to be.\"\nDallas led by as many as five points in the first quarter, taking a 20-15 lead after a drive by Ellis. Nowitzki put the Mavericks up 29-26 with a 3-pointer late in the first quarter, but they shot 42.2 percent (36-of-85) for the game compared to a 54.4 percent (43-of-79) shooting effort by Oklahoma City.\n\"They're one of the best teams,\" Dallas forward DeJuan Blair said. \"We're also one of the best teams, and that's just what you get.\"\nNOTES: Ellis entered averaging 25 points per game, ahead of Nowitzki's 20.3. ... Dallas' Marion moved into 21st on the NBA's all-time list with his two steals for the game, passing Charles Barkley. Marion has 1,649 steals for his career. ... Vince Carter was ejected with 4:01 remaining in the third quarter after an elbow to Adams' face.",
  "source": "espn_api",
  "crawled_at": 1764992920.639775
}