{
  "game_id": "0022401138",
  "espn_id": "401705704",
  "date": "Apr 06, 2025",
  "matchup": "SAC @ CLE",
  "headline": "Zach LaVine scores 37 as Kings remain in position for a play-in spot after 120-113 win over Cavs",
  "body": "CLEVELAND -- — Zach LaVine scored 37 points, including 11 in the decisive fourth quarter, and the Sacramento Kings remained in position for a play-in spot with a 120-113 victory over the Cleveland Cavaliers on Sunday night.\n\n\r\n              DeMar DeRozan scored 28 points and Domantas Sabonis added 27 points and nine rebounds for the Kings, who moved into ninth place in the Western Conference with their second straight victory.\n\n\r\n              Ty Jerome led Cleveland with 20 points and Donovan Mitchell added 19. Jerome saw his first action since March 25 after he had missed five games due to left knee tendinitis. \n\n\r\n              The Cavaliers had a three-game winning streak snapped and will have to wait at least one more game to wrap up the top seed in the Eastern Conference. They dropped to 62-16.\n\n\r\n              Sacramento trailed 106-105 with five minutes remaining before taking control of the game with a 13-5 run.\n\n\r\n              Takeaways\r\n              Kings: DeRozan passed Jerry West (25,192) for 26th on the NBA's career scoring list with a free throw with 5:03 remaining in the third quarter. DeRozan, who is in his 16th season, has 25,209 points in 1,183 games.\n\n\r\n              Cavaliers: Mitchell appeared to injure his left ankle early in the second half. He went to the locker room, but returned to the bench and then came back into the game six minutes later.\n\n\r\n              Key moment\r\n              Keon Ellis hit a halfcourt shot from 43 feet to get Sacramento to 57-56 at halftime. Ellis had one foot beyond the midcourt line when he released the shot.\n\n\r\n              Key stat\r\n              Sacramento was 4 of 17 on 3-pointers during the first half but went 10 of 16 from beyond the arc in the second half. LaVine made all six of his attempts after halftime.\n\n\r\n              Up next\r\n              The Kings wrap up their six-game road in Detroit on Monday night. The Cavaliers host Chicago on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997304.324699
}