{
  "game_id": "0021800178",
  "espn_id": "401070859",
  "date": "Nov 10, 2018",
  "matchup": "CLE @ CHI",
  "headline": "LaVine, Archidiacono help Bulls edge Cavs 99-98",
  "body": "CHICAGO --  Zach LaVine delivered another solid effort for Chicago, yet his only turnover of the game nearly cost the Bulls a victory.\n\nLaVine scored 24 points, rookie Ryan Arcidiacono added 15 and the Bulls rebounded after blowing an early 16-point lead to edge the Cleveland Cavaliers 99-98 on Saturday night.\n\nWendell Carter Jr. also had 15 points as Chicago won for the second time in six games.\n\nLaVine has scored 20 more points in each of Chicago's 13 games this season and in a career-high 14 straight overall, dating to his final game of 2017-18. The last Bulls player to score 20-plus points in 14 consecutive games was Jimmy Butler, who did it 15 straight times in 2016.\n\n\"I thought it was Zach's best game as far as making the simple play,\" coach Fred Hoiberg said. \"We've really been on him about making the right play and the right read, and tonight I thought he was really about that when they were blitzing him on the floor.\"\n\nBut Cleveland nearly pulled this one out after LaVine's lone turnover\n\nWith 13 seconds left, Carter couldn't handle LaVine's pass and Cleveland recovered. Coach Larry Drew called a timeout to set up a final play, but Cavs rookie guard Collin Sexton was blocked by Jabari Parker as he drove to the basket at the buzzer.\n\n\"I made a dumb mistake at the end,\" LaVine said. \"I shouldn't have nonchalant passed it to Wendell. That was my bad, but we made a good stand.\"\n\nThe 23-year-old LaVine was flashy at times, scoring on several highlight-reel dunks. Arcidiacono, making his first career start, scored 10 of his points in the first half.\n\n\"I thought I was able to get into a rhythm when I got a few defensive possessions and got on the floor once,\" Arcidiacono said.\n\nTristan Thompson had 22 points and 12 rebounds for the league-worst Cavs. Sexton scored a season-high 20 points in his second straight start and second of his career.\n\nStill, the 19-year-old couldn't connect on the final shot as he played more than 34 minutes.\n\n\"I felt like I got to my spot and that was the right spot,\" Sexton said. \"They told me to take that, I'm going to make it the next time.\"\n\nDrew said Sexton executed the final play perfectly.  Parker just stopped him.\n\n\"We got the shot that we wanted,\" Drew said. \"It was clear off of Collin, he got all the way to the basket and the ball didn't go in.\"\n\nRodney Hood also had 20 points and Jordan Clarkson came off the bench to score 15, but the Cavaliers lost their fifth straight. Cleveland's only win this season was on Oct. 30 over Atlanta.\n\nCavs forward Cedi Osman sat out the game with back spasms. He was forced to leave Wednesday's loss to Oklahoma City in the first quarter, becoming the latest Cavs player to join an injury list that includes All-Star forward Kevin Love, point guard George Hill and forward Sam Dekker.\n\nThe Bulls came out firing, shooting 64 percent from the floor through the first quarter and taking a 37-23 lead as LaVine scored 11 points and Arcidiacono had 10.\n\nThen Chicago opened its biggest lead, at 16 points, when Antonio Blakeney hit a running jumper 42 seconds into the second quarter.\n\nBut Cleveland roared back to tie it 53-all at halftime as it outscored Chicago 30-16 in the second quarter, including a 9-0 run. The Cavs' bench, led by Clarkson with 10 points and Kyle Corver with eight in the quarter, led the comeback.\n\nChicago led 79-77 after three quarters.\n\nBUTLER TRADE REACTION\n\nBulls coach Fred Hoiberg thinks Butler, who spent his first six seasons with Chicago, will be \"really good fit\" with the Philadelphia 76ers. Butler is being traded from Minnesota to Philadelphia in a package that sends Dario Saric and Robert Covington to the Timberwolves, a person familiar with the deal told The Associated Press on Saturday.\n\n\"I think (Philadelphia has) three of the best players at their position in (Joel) Embiid and (Ben) Simmons,\" Hoiberg said. \"He brings a toughness. He's a guy who's a great player in the clutch. He's a player that guys are going to go out there and guard every time he steps on the floor.\"\n\nTIP-INS\n\nCavaliers: Guard Andrew Harrison, signed to a two-way contract, made his debut with the Cavs and played 13 minutes off the bench. He did not score. Harrison made 64 starts over the past two seasons for Memphis, but was waived by the Grizzlies after one game this season. ... With Osman out, JR Smith and Larry Nance Jr. were Cleveland's starting forwards. ... Against the Thunder on Wednesday in his first career start, Sexton played 42 minutes and had 15 points while shooting 7-for-14 from the field.\n\nBulls: Arcidiacono replaced Cameron Payne, who had started in 11 of Chicago's first 12 games, in the starting lineup. Payne didn't play Saturday. \"(Arcidiacono) is a guy who is going to go out there and play with toughness,\" Hoiberg said. \"He's somebody we feel deserves this opportunity to go out there. He gets us extra possessions. He gets you into things offensively.\"\n\nUP NEXT\n\nCavaliers: Host Charlotte on Tuesday.\n\nBulls: Host Dallas on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994804.286751
}