{
  "game_id": "0021300781",
  "espn_id": "400489654",
  "date": "Feb 12, 2014",
  "matchup": "CHA @ BKN",
  "headline": "Paul Pierce drops 25 to propel Nets past Bobcats",
  "body": "NEW YORK -- In their previous game against New Orleans, the Brooklyn Nets pulled off an impressive feat: They were able to win even though all their starters were held to single digits in points.\nAgainst the Charlotte Bobcats on Wednesday night, the Nets found the 10-point plateau a little easier to clear.\nFive players scored in double figures for the Nets as they easily defeated Charlotte 105-89 at Barclays Center.\nPaul Pierce led the way with 25 points for Brooklyn, including 5-for-5 shooting from 3-point range. Deron Williams added 13 points and seven assists, and Andre Blatche scored 13 off the bench.\nBrooklyn was 13 of 31 from beyond the arc. The Nets were consistently able to use dribble penetration and solid ball movement to find the open man. And when they got open looks, they took advantage.\nPierce said ball movement has been the difference in his team's resurgence of late, and it was largely responsible for his big night against the Bobcats.\n\"When we make the extra pass, the ball is eventually going to find the open man,\" Pierce said. \"I've been a product of that as of late, and I'm knocking down shots right now.\"\nNets coach Jason Kidd agreed that ball movement was critical to his club's success, but thought its defensive play in limiting Al Jefferson to 12 points was equally crucial.\n\"It all started on the defensive end,\" Kidd said. \"Getting stops and then being able to take advantage. ... We wanted to double-team (Jefferson) a little bit early to not let him get in a rhythm. The guys executed the game plan.\"\nKemba Walker led the Bobcats with 16 points. Jefferson, who scored at least 26 in each of his previous three games, was held to 5-for-13 shooting.\nWith the win, the Nets improved to 14-5 this calendar year. Pierce believes that as good as things have been for Brooklyn lately, the Nets have the potential to get even better as they get more comfortable with each other.\n\"We've developed some chemistry since the new year. I mean, you can tell by the way we've moved the ball, the way we're defending. Everybody seems to be on the same page. And when you have that type of chemistry, and that type of talent, we're going to be a tough team to beat when we put it together,\" he said.\nBrooklyn went on a 15-3 run to open the third quarter, extending its lead to 17, and never looked back.\nThe lopsided margin of victory afforded Kidd the opportunity to rest his starters for much of the fourth quarter. With a quick turnaround Thursday night against Chicago to close out the first-half schedule, Kidd recognized the importance of being able to get his key players a breather.\n\"A veteran ballclub understands that the games right before the break are important because you're planning vacations, or planning to go to All-Star weekend, and sometimes the game becomes secondary,\" he said. \"A lot of the guys, for the most part, didn't play a lot of minutes, so we'll see what happens tomorrow.\"\nCharlotte got off to a solid start offensively in its final game before the All-Star break. But the Bobcats struggled mightily after that, putting up a meager 34 points combined in the second and third quarters.\nBobcats coach Steve Clifford thought the fact that his club only turned the ball over 10 times was somewhat misleading. He thought his team was listless, and made a number of unforced errors that cost it a chance to win.\n\"You have to play with more discipline,\" Clifford said. \"When the chance is there to make a play, you have to make it. I thought our turnovers were just terrible.\"\nThe Bobcats defeated Dallas at home Tuesday, but Jefferson didn't think the loss could be chalked up to fatigue.\n\"They were ready and we weren't,\" he said. \"We can't just have excuses because we played last night. That's the NBA; we have to be ready to play these types of games, especially to be a playoff team.\"\nThe Bobcats have lost their last nine games when finishing off a back-to-back. Clifford understands that needs to change if his squad is going to contend for a playoff spot.\n\"The bottom line is we have to be able to play better in these games,\" Clifford said. \"The second night of back-to-backs earlier in the year, we were better. The last few times back-to-backs, we've been inconsistent.\"\nThe Bobcats will be have a chance to reverse the trend right away when they open the second half with a back-to-back against the Detroit Pistons starting next Tuesday.\nGame notes\nPierce scored 14 of his 25 points in the third. ... The Nets have won four straight at Barclays Center, and 11 of their last 13. ... One night after posting a season-high 54.9 field goal percentage, Charlotte managed only 41.4 percent from the floor. ... The Nets will play their next seven games on the road, starting with a national TV date against Chicago on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764993156.739027
}