{
  "game_id": "0022400730",
  "espn_id": "401705296",
  "date": "Feb 06, 2025",
  "matchup": "ORL @ DEN",
  "headline": "Nikola Jokic has 24th triple-double of the season, Nuggets rout Magic 112-90",
  "body": "DENVER -- — Nikola Jokic had 28 points, 12 assists and 10 rebounds for his 24th triple-double of the season, Michael Porter Jr. added 30 points and the Denver Nuggets won their fifth in a row by beating the Orlando Magic 112-90 on Thursday night.\n\n\r\n              Christian Braun finished with 16 points for a Nuggets team that saw the trade deadline come and go without making a move. The Nuggets had the game so well in hand that Jokic didn't play in the fourth quarter.\n\n\r\n              Porter turned in another electric offensive performance by hitting 11 of 16 shots, including five 3-pointers. It's his third straight game with 30 or more points.\n\n\r\n              Wendell Carter Jr. led the Magic with 19 points, and Paolo Banchero added 18. Orlando was outscored 33-17 in the third quarter.\n\n\r\n              Both teams played the night before. The Nuggets routed New Orleans 144-119 at home while the Magic beat Sacramento 130-111.\n\n\r\n              Takeaways\r\n              Magic: Kentavious Caldwell-Pope received an ovation and a video tribute in his return to Denver. Caldwell-Pope spent two seasons with the Nuggets, helping them to the 2023 NBA title, before leaving for Orlando last summer. He had seven points. \n\n\r\n              Nuggets: Julian Strawther made his first NBA start and had two points on 1 of 8 shooting. He was starting in place of Jamal Murray, who had inflammation in his left knee. Peyton Watson (knee) and Russell Westbrook (hamstring) also were sidelined. \n\n\r\n              Key moment\r\n              Jokic showed off his passing exploits in the third quarter with a back-to-the-basket, over-his-head pass to Aaron Gordon for a dunk. \n\n\r\n              Key stat\r\n              Denver is 10-1 n the second night of a back-to-back.\n\n\r\n              Up next\r\n              Both teams play Saturday. The Magic host San Antonio, and the Nuggets are at Phoenix.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997541.689153
}