{
  "game_id": "0022301128",
  "espn_id": "401585756",
  "date": "Apr 06, 2024",
  "matchup": "BKN vs. DET",
  "headline": "Nets rally to beat Pistons 113-103 behind Cam Thomas' 32 points",
  "body": "NEW YORK -- — Cam Thomas scored 32 points and the Brooklyn Nets rallied with a big fourth quarter for a 113-103 victory over the Detroit Pistons on Saturday night.\n\n\r\n              Dennis Schroder added 24 points and Noah Clowney had 17 off the bench for the Nets, who won their second straight game. Mikal Bridges chipped in with 13 and Jalen Wilson finished with 10.\n\n\r\n              “Just having something to build on for next year,” Thomas said of the two-game winning streak. “We just have to finish strong. Keep developing the culture that we (were) preaching during training camp. ...Just finishing strong (and) seeing what we can build on for next year so we don’t have another season like this.”\n\n\r\n              Detroit dropped to 13-65 with its fourth straight loss. Chimezie Metu led the Pistons with 20 points. Marcus Sasser finished with 18 and Jaden Ivey added 16. \n\n\r\n              Troy Brown Jr. had 15 and Jaylen Nowell contributed 12 off the bench for the Pistons, who led by 19 and were still ahead 83-75 after three before the Nets outscored them 38-20 over the final 12 minutes.\n\n\r\n              “We competed,\" Pistons coach Monty Williams said. \"If you compete, you give yourself a chance. I thought our guys competed.”\n\n\r\n              Trailing 99-91 after Schroder knocked down a jumper with 6:28 remaining, the Nets used a 22-4 run to clinch the win. \n\n\r\n              In the stretch, Clowney drilled a corner 3 right in front of the Brooklyn bench, which was followed shortly thereafter by Nic Claxton’s two-handed alley-oop jam that cut Detroit’s lead to 103-101.\n\n\r\n              The Nets took their first lead since the first quarter on Schroder’s straightaway 3 with 2:54 remaining. Brooklyn’s point guard knocked down two free throws and a jumper from the foul line on the next two possessions to extend the lead to 108-103.\n\n\r\n              Wilson’s 3 with 40 seconds remaining put the game out of reach.\n\n\r\n              “They just kept hunting,” Nets interim coach Kevin Ollie said. \"We finally found a pace that we wanted on defense and offense, and then it really started with (Clowney) and (Wilson) and our young guys playing and blocking shots, getting steals ... and then Nic took it to (another) level. So it’s just hunting season, and we’re not finished yet. We just want to keep hunting until the last seconds run out on the season.”\n\n\r\n              One night after being dismantled 108-90 by the Memphis Grizzlies, the Pistons jumped out to a quick start.\n\n\r\n              Detroit led 35-23 at the end of the first quarter, and enjoyed a 57-46 advantage at halftime. Detroit shot 54.5% from the field in the first half and turned 13 Brooklyn turnovers into 19 points. \n\n\r\n              Still, the Nets fought back. Trailing 71-55 following Thomas’ free throw with 7:08 left in the third quarter, Brooklyn used a 24-12 run to cut the deficit to 83-75 entering the fourth.\n\n\r\n              During a stoppage in play between the end of the first quarter and start of the second, the Nets played a video honoring Vince Carter for being elected to the Naismith Memorial Basketball Hall of Fame. Carter spent five seasons with the then-New Jersey Nets, where he averaged 23.6 points per game.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Visits Philadelphia on Tuesday night.\n\n\r\n              Nets: Host Sacramento on Sunday night. \n\n\r\n               MORE AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764996321.282913
}