{
  "game_id": "0021900135",
  "espn_id": "401160777",
  "date": "Nov 10, 2019",
  "matchup": "MIL @ OKC",
  "headline": "Antetokounmpo's 36 points lead Bucks past Thunder",
  "body": "OKLAHOMA CITY --  Giannis Antetokounmpo couldn't contain his frustration after a subpar first half.\n\nSomewhere between the court and the locker room, the Milwaukee Bucks star kicked -- and destroyed -- a sign with a Thunder logo that is part of a temporary barrier.\n\nThe reigning league MVP regretted his actions.\n\n\"You know, there's no excuse there, and obviously I'll try to pay for the sign, or I can trade you guys for the Bucks sign when you guys come to Milwaukee,\" he said. \"But there's no excuse for that. But obviously, playing basketball is a lot of frustration and a lot of emotion, and obviously, moments like that happen.\"\n\nHe channeled his fire in the second half. He scored 24 of his 35 points after the break to help the Milwaukee Bucks rally and beat the Oklahoma City Thunder 121-119 on Sunday night.\n\nHis first half, by his standards, was forgettable. He scored 11 points on 4-for-8 shooting and had six rebounds. Most important, the Thunder led by six.\n\n\"I wasn't playing good basketball,\" he said. \"I wasn't being as aggressive as I wanted.\"\n\nIn the second half, he made 9 of 11 shots and grabbed 10 rebounds.\n\nThunder guard Chris Paul said it's a challenge to defend a 6-foot-11 player who can drive.\n\n\"You think `back up, back up,' but by the time you keep backing up, he's at the rim,\" Paul said.\n\nEric Bledsoe added 25 points and nine assists for the Bucks, who have won five of six.\n\nDennis Schroder scored 25 points and Shai Gilgeous-Alexander added 22 for the Thunder, who had won three straight home games.\n\nThe Thunder led by nine points early in the third quarter before Milwaukee rallied and led 87-80 heading into the fourth.\n\nOklahoma City's Danilo Gallinari hit a 3-pointer with 32.3 seconds left to tie the game at 114, but Milwaukee's Brook Lopez made a 3-pointer at the other end with 25.4 seconds remaining.\n\nGallinari missed a clean look at a 3, then Milwaukee's George Hill made two free throws with 10.5 seconds left to put the Bucks in control.\n\n\"We always fought back, and we didn't shoot the ball the way we usually do, especially me,\" Gallinari said. \"It was a very good game. Unfortunately we couldn't get it done.\"\n\nTIP-INS\n\nBucks: F Kyle Korver sat out with a head contusion. ... G Khris Middleton left the game with a left thigh contusion and did not return. He finished with 10 points. ... Lopez was called for a technical foul in the fourth quarter.\n\nThunder: C Steven Adams sat out with a left knee contusion. Coach Billy Donovan said he doesn't consider the injury serious. ... G Andre Roberson (recovery, left knee) still hasn't played this season.\n\nKEEP FIRING\n\nGallinari was 3 for 15 from the field before he made the game-tying 3-pointer in the final minute. He finished 4 for 17 overall and 2 for 10 from 3-point range. Oklahoma City's No. 2 scorer for the season entered the night shooting 46.9% from the field overall and 47.5% from 3-point range.\n\nSECOND HALF SWISHES\n\nMilwaukee shot 60.5% in the second half. The Bucks made 21 of 30 shots inside the 3-point line after the break.\n\nThe Thunder shot 52.3% in the second half and made 9 of 21 3-pointers. Schroder scored 17 points in the second half on 6-for-7 shooting.\n\nQUOTABLE\n\nBucks coach Mike Budenholzer on holding on against the Thunder in the fourth quarter: \"They had 39 points in the fourth quarter, so we are just lucky the clock ran out, but they hit tough shots.\"\n\nUP NEXT\n\nThe Bucks host the Chicago Bulls on Thursday.\n\nThe Thunder visit the Indiana Pacers on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996178.307167
}