{
  "game_id": "0022300972",
  "espn_id": "401585600",
  "date": "Mar 16, 2024",
  "matchup": "MEM vs. OKC",
  "headline": "Thunder beat Grizzlies 118-112, move into a tie with Denver atop the Western Conference standings",
  "body": "MEMPHIS, Tenn. -- — Chet Holmgren had 22 points and 11 rebounds, Jalen Williams added 23 points and six assists and Oklahoma City held off the Memphis Grizzlies 118-112 on Saturday night to claim a share of first place in the Western Conference.\n\n\r\n              Shai Gilgeous-Alexander added 20 points and Josh Giddey finished with 13, despite going 1 of 6 from 3-point range. Oklahoma City's fifth win in six games pulled the Thunder even with idle Denver atop the West at 47-20. \n\n\r\n              “It didn't go our way the whole game, or even down the stretch,” Holmgren said. “But we put together enough plays.”\n\n\r\n              Desmond Bane, playing in his first game since Jan. 12 due to injury, led the Grizzlies with 22 points and seven assists. Jaren Jackson Jr. and GG Jackson finished with 19 points apiece for Memphis, which lost its second straight and fourth in five games. Jaren Jackson Jr. matched Bane's seven assists, while going 7 of 11 from the floor and 3 of 4 outside the arc.\n\n\r\n              “I felt okay,” Bane said of his first time on the court, playing almost 32 minutes. “Got my first wind. Then kind of caught my legs. I'll be better for sure.”\n\n\r\n              After a closely contested game early-on, the Thunder were able to create a bit of a buffer in the third, stretching the lead to 14 points while shooting 53% at that point for the game. They went on a 19-5 run in the final minutes of the frame. \n\n\r\n              Memphis fought back to within one possession early in the fourth, but another Oklahoma City run, fueled by a couple of Holmgren baskets inside, stretched the Thunder lead to double digits, thwarting a Memphis comeback try.\n\n\r\n              “We showed great intensity and played up to the level the game required if we wanted to win it. That was an impressive show of resiliency, I thought,” Thunder coach Mark Daigneault said.\n\n\r\n              The Grizzlies got an offensive punch back as Bane, who averages 24.4 points and is one of the team's top 3-point shooters, returned after missing 29 games with a sprained left ankle. Also, Jaren Jackson, the team's third-leading scorer who averages 22.4 points, played after missing two games with right quadricep tendonitis.\n\n\r\n              ‘It was a breath of fresh air,\" Jaren Jackson Jr. said of Bane's return. “Des did exactly what I know Des to do and all the attention he attracts. Him being out there makes it easier for all of us.”\n\n\r\n              The Thunder easily won the first two meetings between the teams this season, including a 124-93 decision on March 10.\n\n\r\n              This time was different as Bane opened the floor making 4 of 9 3-pointers, including the first shot of the game. That helped keep Memphis close. But down the stretch the Grizzlies couldn't keep pace. And while Memphis is already looking ahead to next season, the Thunder now has a share of the top spot in the conference.\n\n\r\n              “It's extremely important this late in the season,” Holmgren said of sharing first place, adding that the Thunder are heading in the right direction for a good postseason seed. \"It's also good to see all the work we're putting in is putting us in a good position.\n\n\r\n              “But we have a long ways to go.”\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host Utah Jazz on Wednesday.\n\n\r\n              Grizzlies: Travel to Sacramento Kings on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995995.717338
}