{
  "game_id": "0021801202",
  "espn_id": "401071875",
  "date": "Apr 07, 2019",
  "matchup": "MIL vs. ATL",
  "headline": "Giannis-led Bucks win 60th for first time since '81",
  "body": "MILWAUKEE -- Giannis Antetokounmpo is in a perfect position to put the Bucks' 60-win season in perspective.\nAntetokounmpo scored 30 points and Khris Middleton added 21 to send Milwaukee to a methodical 115-107 victory over the Atlanta Hawks on Sunday night, giving the Bucks 60 wins for the first time since 1981.\n\"Six years ago, my first year here, we won 15 games,\" said Antetokounmpo, who was a 19-year-old rookie in 2013-14. \"Now we have four times that amount. It's big. Our goal coming into the season was to get 60 wins. You definitely have to appreciate it because it's pretty special.\n\"Now we have to refocus and look forward to the playoffs.\"\nThe Bucks, who have clinched the best record in the Eastern Conference, led from the outset as the Hawks rested leading scorers John Collins and Trae Young.\nMilwaukee led 85-72 entering the final period, but Atlanta pulled to 101-98 on a drive by DeAndre' Bembry with 3:28 left.\nMiddleton countered with consecutive 3-pointers, and Antetokounmpo connected from beyond the arc to put Milwaukee up 110-98.\n\"It was great for them to close it,\" said Bucks coach Mike Budenholzer, who coached Atlanta to 60 wins in 2014-15. \"Khris has a knack for hitting those big shots, and it's great of Giannis to see a 3 go down to kind of finish the night. Those two guys are special. It makes a big difference.\"\nAlex Len had a career-high 33 points for Atlanta, including a career-best six 3-pointers.\n\"I was wide-open. I was surprised,\" Len said. \"After I made like three or four, they were still letting me shoot. All the power to my teammates. They found me on open shots and I knocked them down.\"\nNone of the Bucks' starters played more than 27 minutes, and 11 of 12 available players each logged at least 19 minutes.\n\"It's almost exactly what we wanted,\" Budenholzer said. \"It was good. We have depth. We have a lot of guys that can play. A lot of guys stepped up.\"\nMilwaukee led 28-21 after one quarter and pushed their lead to 46-30 before the Hawks trimmed it to 54-45 at halftime.\nVince Carter hit two free throws to cap a 10-point run that pulled Atlanta to 78-71, but the Bucks pushed the lead to 85-72 entering the fourth.\nMilwaukee, which lost in the first round of the playoffs each of the past two seasons, has not advanced past the opening round since making the Eastern Conference finals in 2001.\nThe 1980-81 Bucks team that finished 60-22 under coach Don Nelson included Sidney Moncrief, Marques Johnson, Junior Bridgeman and Bob Lanier.\n\"It's a special season,\" Middleton said. \"From the beginning of training camp until now. The ups and downs, the injuries, our guys stayed with it. It was a collective effort from everybody. It's definitely a special moment, but we want to do more.\"\nTIP-INS\nHawks: Young (19.1 points per game), who had started all 80 games, and Collins (19.5 PPG) did not play due to load management. \"We figured today would be a good day to sit them and finish the season on a high note at home,\" coach Lloyd Pierce said. \"That's really important for us as a team and with what we've been through this year.\"\nBucks: Antetokounmpo, who did not play in Saturday's 133-128 loss to the Nets because of left calf soreness, was questionable for this one. But he was back in the lineup after experiencing no setbacks during pregame warm-ups.\nLOPEZ'S STREAK\nIf Brook Lopez starts Wednesday night for the Bucks as expected against Oklahoma City, he'll have started all 82 games this season. Lopez, signed as a free agent after playing last season with the Los Angeles Lakers, also started all 82 games in 2009-10 and 2010-11 with the Nets, with whom he spent his first nine seasons. \"Playing 82 games is tough,\" Middleton said. \"You get banged up all the time, some nagging injuries from time to time, but he fought through it all and stayed with it. He's had a hell of a season. These 60 wins wouldn't be close without him.\"\nUP NEXT\nThe Hawks host Indiana on Wednesday.\nThe Bucks host Oklahoma City on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994447.7749
}