{
  "game_id": "0021900746",
  "espn_id": "401161388",
  "date": "Feb 03, 2020",
  "matchup": "PHX @ BKN",
  "headline": "LeVert starts, ties career best with 29 as Nets beat Suns",
  "body": "NEW YORK --  With Kyrie Irving sidelined, Caris LeVert picked the perfect time to deliver his best game of the season.\n\nLeVert tied his career high with 29 points in his first start in nearly three months, helping the Brooklyn Nets overcome the absence of their leading scorer to beat the Phoenix Suns 119-97 on Monday night.\n\n“It was like the old Caris, how dynamic he was and athletic and moving great,\" Nets coach Kenny Atkinson said.\n\nLeVert snapped out of a slump on offense and played a key role in a strong defensive effort that limited Suns star Devin Booker to 11 points on 3-for-15 shooting.\n\n“They did a good job of taking me out,\" Booker said. “Face guarding the whole game. Switching our matchups. So, it’s one of those nights.\"\n\nJoe Harris added 16 points and Taurean Prince had 11 of his 15 in the decisive third quarter for the Nets, who will be without Irving at least for this week after he sprained his right knee Saturday at Washington.\n\nSo Spencer Dinwiddie went back into the starting lineup at point guard and LeVert made his first start since Nov. 10. After that, he had right thumb surgery and missed the next 24 games.\n\nA starter in the first nine games of the season, LeVert had struggled in his bench role lately, shooting just 3 for 14 for a total of nine points over the previous two games. Atkinson thought longer stints on the floor could help get the guard back on track.\n\nLeVert broke out with some nice drives to the basket along with two 3-pointers and 7-for-7 shooting from the foul line. He even added seven assists and agreed his performance could be a stepping stone.\n\n“Yeah, I think so,\" he said. “Like I said, it’s definitely good to see the ball going through the basket, be aggressive like I was tonight.\"\n\nDeandre Ayton had 25 points and 17 rebounds for the Suns, who were even with the Nets for most of the first half but then ran out of gas after halftime in the second of their back-to-back games and lost their third straight.\n\n“We just lost a bit of our poise tonight,\" Suns coach Monty Williams said. “It was a three-point game at the half and we didn’t make shots in the third.\"\n\nNeither team led by more than six in a first half that featured 12 ties and nine lead changes and ended with Brooklyn ahead 55-52. LeVert and Prince each scored 11 points in the third, combining for one more than Phoenix had as a team.\n\nWith the Nets leading by five, Prince had two 3-pointers and LeVert a three-point play in a 13-0 burst that made it 78-60 midway through the third. Brooklyn went on to lead by 26.\n\nTIP-INS\n\nSuns: The Suns got Ricky Rubio back in the lineup after he missed their loss in Milwaukee on Sunday with right ankle soreness, but they're still weakened by injuries up front to Dario Saric and Aron Baynes. ... Booker had scored 29 or more points in 11 straight road games.\n\nNets: Brooklyn snapped a seven-game losing streak against Western Conference teams. The Nets' last victory over one had been at New Orleans on Dec. 17. ... Dinwiddie had 14 points.\n\nSEEKING A REPEAT\n\nHarris decided to accept an invitation to defend his 3-point shooting title at the All-Star Game. He won last year in Charlotte but wondered if the break would be better than going to Chicago. Atkinson said the team wouldn't stop him from going.\n\n“Joe’s a competitor, man. Joe would go down to the Y if you told him there was a pickup game or a 3-point shooting contest,\" Atkinson said. “I don’t think any of us would dare hold him back and it was such a joy, such a big positive for our organization, too. Really hope he wins it again. I know he’s more than capable.”\n\nSETTING DOWN THE SUNS\n\nThe Nets improved to 12-4 against the Suns since moving to Brooklyn in 2012-13. That's their best mark against any opponent.\n\nUP NEXT\n\nSuns: Visit Detroit on Wednesday.\n\nNets: Host Golden State on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996550.872351
}