{
  "game_id": "0022400998",
  "espn_id": "401705564",
  "date": "Mar 19, 2025",
  "matchup": "DAL @ IND",
  "headline": "Pascal Siakam scores 29 points, has key late steal to help Pacers rally past Mavs 135-131",
  "body": "INDIANAPOLIS -- — Pascal Siakam scored 29 points, Bennedict Mathurin scored 16 of his 23 points in the fourth quarter and the Indiana Pacers rallied from an 11-point deficit in the final six minutes to beat the short-handed Dallas Mavericks 135-131 on Wednesday night.\n\n\r\n              The Pacers retook the lead with 14.7 seconds left when Siakam stole the ball and a wide open Andrew Nembhard knocked down a 3-pointer to make it 131-130. Indiana closed it out at the free-throw line.\n\n\r\n              Nembhard finished with 22 points and eight assists while Tyrese Haliburton sat out with a back injury. Mathurin also had seven rebounds.\n\n\r\n              The Pacers have won four of their last five games and now lead Milwaukee by one game for the No. 4 seed in the Eastern Conference.\n\n\r\n              P.J. Washington Jr. finished with 26 points to lead the Mavericks, who had six of their eight available players score in double figures. Jaden Hardy had 24 points and Kai Jones added 18 points and 11 rebounds points for Dallas, which has lost nine of 10.\n\n\r\n              Takeaways\r\n              Mavericks: Coach Jason Kidd's squad certainly played with heart with three All-Stars — Anthony Davis, Kyrie Irving and Klay Thompson — all sitting out. They just ran out of gas late and couldn't finish it off.\n\n\r\n              Pacers: It looked like the Pacers might coast for 2 1/2 quarters — and that may have been the problem. But after digging themselves into the late deficit, they flipped a switch and pulled out a crucial win.\n\n\r\n              Key moment\r\n              The Pacers trapped Mavericks guard Max Christie in the corner following an inbound pass, Siakam ripped it away and Indiana moved the ball around until finding Nembhard.\n\n\r\n              Key stat\r\n              Indiana had a 15-3 advantage in fast-break points.\n\n\r\n              Up next\r\n              The Mavericks host the Pistons on Friday night while the Pacers host Brooklyn on Thursday night in the second contest of their five-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997138.951861
}