{
  "game_id": "401810186",
  "espn_id": "401810186",
  "date": "Dec 03, 2025",
  "matchup": "MIL vs DET",
  "headline": "Bucks lose Antetokounmpo to injury early but rally past Pistons 113-109",
  "body": "MILWAUKEE -- — Kevin Porter Jr. scored 26 points, Ryan Rollins added 22 and the Milwaukee Bucks overcame the loss of Giannis Antetokounmpo to an injury three minutes into the game to beat the Detroit Pistons 113-109 on Wednesday night.\n\n\r\n              AJ Green had 19 points and Jericho Sims finished with a career-high 15 points and tied a career best with 14 rebounds as Milwaukee won for just the second time in 10 games.\n\n\r\n              Antetokounmpo left with what the Bucks said was a right calf strain, not long after coach Doc Rivers said before the game there have been no talks between team officials and the two-time MVP about a potential exit from Milwaukee. \n\n\r\n              Tobias Harris had 20 points, Cade Cunningham 17 and Jaden Ivey 15 for the Pistons, who had won 15 of 17.\n\n\r\n              Sims' three-point play with 1:34 remaining gave the Bucks a 109-108 lead. A pair of free throws by Rollins with 13 seconds left pushed the Bucks' lead to three. After a Detroit miss, Green sealed the win with a pair of free throws.\n\n\r\n              The Pistons led 27-9 in the first quarter. The Bucks closed the gap to 52-49 at the half with Porter tallying 16 first-half points.\n\n\r\n              The Bucks took their first lead at 56-55 early in the third quarter on Myles Turner’s 3-pointer but Detroit held an 85-78 lead at the end of the period.\n\n\r\n              Late in the third, Milwaukee’s Bobby Portis and Detroit’s Isaiah Stewart had a heated exchange after Portis fouled Stewart in the lane. A double technical foul was called, leading to the ejection of Stewart, who was whistled for a technical earlier in the quarter.\n\n\r\n              Up next\r\n              Pistons: Host Portland on Friday night.\n\n\r\n              Bucks: Host Philadelphia on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042748.059145
}