{
  "game_id": "0022400117",
  "espn_id": "401704683",
  "date": "Oct 30, 2024",
  "matchup": "TOR @ CHA",
  "headline": "Tre Mann scores 27, Hornets get 72 points from their bench to beat Raptors 138-133 for 1st home win",
  "body": "CHARLOTTE, N.C. -- — Tre Mann scored 27 points off the bench, Nick Richards had 24 points and 14 rebounds and the Charlotte Hornets defeated the Toronto Raptors 138-133 on Wednesday night for their first home win of the season.\n\n\r\n              Cody Martin had a career-high 25 points, and LaMelo Ball scored 19 for Charlotte, which allowed a 23-point first half lead to evaporate before recapturing it with a 12-0 run to end the third quarter.\n\n\r\n              RJ Barrett had 31 points, Gradey Dick had a career-high 30 and Jakob Poeltl had 20 points and 16 rebounds to lead the Raptors, playing without Scottie Barnes.\n\n\r\n              The Hornets got 72 points from their bench, 69 from Mann, Martin and Grant Williams, who had 17. \n\n\r\n              Takeaways\r\n              Raptors: Toronto looked completely out of sync offensively in the first quarter in its first game without Barnes, who'll miss at least three weeks with an orbital fracture. Toronto turned the ball over seven times leading to 10 Charlotte points and trailed 30-16 before exploding for 43 points in the second quarter. \n\n\r\n              Hornets: Charlotte is a different team when Ball is on the floor. Although he's prone to silly turnovers, there is no disputing he makes everyone around him better. It showed when he sparked a 12-0 run late in the third quarter by scoring five straight points, grabbing a steal and assisting on Mann's 3-pointer as Charlotte went from down five to up 103-96. \n\n\r\n              Key moment\r\n              Leading by three, Ball drove the left side of the lane and scored to make it two-possession game with 29 seconds left. It was a free throw shooting contest from there and the Hornets closed it out.\n\n\r\n              Key stat\r\n              Mann, Martin and Williams shot a combined 67% (24 of 36) from the field.\n\n\r\n              Up next\r\n              The Raptors host the Lakers on Friday night. The the Hornets hosts Celtics in back-to-back games Friday and Saturday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997007.4894762
}