{
  "game_id": "0022300168",
  "espn_id": "401584796",
  "date": "Nov 08, 2023",
  "matchup": "TOR @ DAL",
  "headline": "Siakam, Raptors beats Doncic, Mavs 127-116 to finish 2-game sweep in Texas",
  "body": "DALLAS -- — Pascal Siakam had 31 points and 12 rebounds, OG Anunoby scored 26 and the Toronto Raptors finished a two-game sweep in Texas with a 127-116 victory over the Dallas Mavericks on Wednesday night.\n\n\r\n              Three nights after Toronto rallied from 22 points down for a win at San Antonio, Siakam and Anunoby combined for all the points in an 11-0 run that broke a 73-all tie in the third quarter.\n\n\r\n              Luka Doncic scored 31 points and Kyrie Irving had 22 for the Mavericks, who lost for the first time in four home games this season with Texan and two-time Super Bowl MVP Patrick Mahomes of the Kansas City Chiefs watching courtside with his wife, Brittany.\n\n\r\n              Siakam finished with season highs in points and rebounds in what has been a sluggish start offensively for the two-time All-Star. He was 15 of 25 from the field and had five assists.\n\n\r\n              “He’s been putting all the work in,” Raptors coach Darko Rajakovic said. “He got us in a really amazing spot in the first half and just continued down the stretch making the right plays.”\n\n\r\n              The Mavericks were without rookie center Dereck Lively II for the first time due to a non-COVID-19 illness and got outrebounded 50-38 while matching a season high by allowing 72 points in the paint. \n\n\r\n              Siakam scored all of his points in the paint while missing all five of his 3-pointers.\n\n\r\n              “We had 11 turnovers in the first half,” Dallas coach Jason Kidd said. “A lot of their points in the paint were in transition. If you don’t take care of the ball ... they’re going to get out and run and they did that at a high level tonight.”\n\n\r\n              Dennis Schroder scored 18 points, Gary Trent Jr. added 16 on 4-of-8 shooting from 3, and Scottie Barnes had 14 points, 14 rebounds, seven assists, four steals and two blocks.\n\n\r\n              Anunoby hit a pair of 3s for the first six points of the game and finished 9 of 17 from the floor while helping hold Doncic to 11-of-26 shooting, including 2 of 10 from long range.\n\n\r\n              “He's developing all over,” Rajakovic said. “And defensively, you're not going to stop Luka Doncic. That's not happening. But how hard are you going to make it on him?”\n\n\r\n              Tim Hardaway Jr. scored 17 points and Derrick Jones Jr. had 15 for Dallas, which was looking for its first 7-1 start since 2004-05.\n\n\r\n              The Mavericks got within five on a 3-pointer by Hardaway late in the third quarter, but Toronto pushed the advantage back to 11 going to the fourth. The lead was at least nine the rest of the way.\n\n\r\n              “They were aggressive,” Kidd said of the Raptors. “Understanding protecting the paint, they drove the ball, they dominated the glass and we have to do a better job, coaches and players.”\n\n\r\n              Dallas hurt its chances for a rally with poor free throw shooting after the break, making just 14 of 24 and finishing 19 of 31 overall.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Boston on Saturday to finish a four-game trip.\n\n\r\n              Mavericks: The Clippers at home Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995463.2799842
}