{
  "game_id": "0022300147",
  "espn_id": "401584775",
  "date": "Nov 06, 2023",
  "matchup": "ORL vs. DAL",
  "headline": "Doncic returns after bumping head, scores 29 as Mavs rally again, beat Magic 117-102",
  "body": "ORLANDO, Fla. -- — \n\n\r\n              Luka Doncic returned from a brief absence after bumping his head to score 12 of his 29 points in the fourth quarter, leading the Dallas Mavericks to a 117-102 win over the Orlando Magic on Monday night.\n\n\r\n              Kyrie Irving and Tim Hardaway Jr. added 21 points as the Mavericks erased a 15-point deficit for the second night in a row to sweep their first back-to-back of the season.\n\n\r\n              Paolo Banchero led Orlando with 22 points. Cole Anthony and Mo Wagner came off the bench with 19 points apiece for the Magic, who led 63-48 late in the first half but shot 34% and made just one of 16 3-pointers after the break.\n\n\r\n              Doncic sat the final 7:17 of the third quarter after bumping his head on the lower leg of an Orlando player when the Dallas superstar lost his footing trying to back down a defender off the dribble. \n\n\r\n              The four-time All-Star went to the locker room but was back on the bench before the end of the third quarter and played the entire fourth.\n\n\r\n              “No concussion protocol,” he said. “I mean they checked, but it was all good.” \n\n\r\n              Doncic and Irving combined to score the final 13 Dallas points, and scored 23 of the 31 points and had all five assists for the Mavericks in the fourth quarter.\n\n\r\n              “You've just got to pick your poison,” Hardaway said. “They’re two of the best on the floor in a pick-and-roll situation. The other three guys just try to do our best to make their jobs easier when they kick it out to us to knock down a shot or make a play.”\n\n\r\n              Wagner scored twice on an 8-0 run late in the first half, and the Magic led 66-53 after a first half in which they shot 59% and had 20 assists on 26 field goals.\n\n\r\n              Dallas opened the second half with eight straight points to get back in the game quickly, but did not take the lead until Josh Green's layup late in the third quarter.\n\n\r\n              Anthony had the only made 3 for Orlando after the break, midway through the fourth quarter, after the Magic went 7 of 11 from deep in the first half.\n\n\r\n              “We did a lot of good things in the first half obviously,” said Anthony. “Hitting shots always helps, but we can’t let the missed shots affect what our defense does.”\n\n\r\n              The Mavericks, who beat Charlotte 124-118 after trailing 60-45 late in the first half, clinched their sixth win in seven games with a 9-0 spurt midway through the fourth quarter. \n\n\r\n              Irving finished with 21 points, 10 assists and six rebounds with a plus-18 after shooting 4 of 14 in the first three quarters.\n\n\r\n              “I'm looking forward to the future and having games like this, when I'm able to take my time as a point guard alongside Luka and just take some pressure off him,” Irving said. \n\n\r\n              The Magic played without center Wendell Carter Jr. (fractured left hand), guard Markelle Fultz (left knee patella tendinitis) and Jonathan Isaac (sore left hamstring).\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Toronto at home Wednesday.\n\n\r\n              Magic: Atlanta in Mexico City on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995749.6007612
}