{
  "game_id": "0022300725",
  "espn_id": "401585353",
  "date": "Feb 06, 2024",
  "matchup": "MIL @ PHX",
  "headline": "Booker scores 32, Durant adds 28, Suns push past short-handed Bucks 114-106",
  "body": "PHOENIX -- — Kevin Durant sized up the Milwaukee Bucks defense and then attacked, driving straight down the lane for a thunderous dunk over Giannis Antetokounmpo.\n\n\r\n              The 35-year-old — who just made his 14th All-Star team — looks like he might make 14 more the way he's playing these days.\n\n\r\n              “When it's time to attack the rim,” said Phoenix Suns coach Frank Vogel, “he tears that thing down.”\n\n\r\n              Devin Booker scored 32 points, Durant added 28 with a big fourth quarter and the Suns beat the short-handed Bucks 114-106 on Tuesday night.\n\n\r\n              The Suns took a 79-73 lead into the fourth quarter and didn’t trail again. Durant threw down his thunderous dunk — while being fouled — and hit the free throw to push Phoenix ahead 93-80 with 8:51 left.\n\n\r\n              “They just forget me for a split-second, then I'm in the middle of the paint, and it's on me to finish,” Durant said. “I'm glad I didn't pull up for a floater or a mid-range.”\n\n\r\n              It was part of a big final quarter for Durant, who hit five straight shots and had 14 points. After a difficult, injury-filled first half of the season, the Suns have an 11-3 record since Jan. 11.\n\n\r\n              The Bucks played without star guard Damian Lillard, who missed the game with a sprained ankle, and starting center Brook Lopez, who was out for personal reasons. Milwaukee also played most of the night without forward Khris Middleton, who left in the first quarter with a sprained ankle.\n\n\r\n              Antetokounmpo led Milwaukee with 34 points on 13-for-24 shooting and grabbed 10 rebounds. Malik Beasley added 22 points.\n\n\r\n              “I thought we fought — hung in there,” Bucks coach Doc Rivers said. “You knew at some point, you just felt at some point, we wouldn't have enough offense on the floor and that's probably what happened. \n\n\r\n              \"I thought defensively we were really good tonight.”\n\n\r\n              The Bucks fell to 1-4 since hiring Rivers, who replaced the fired Adrian Griffin, but Antetokounmpo said he believes the team is making progress, particularly on the defensive end. \n\n\r\n              “We've got to keep getting better, keep watching film,” Antetokounmpo said. “Now we have to work twice as hard. If we're willing to do that we'll be OK.”\n\n\r\n              The Suns, who were playing their first game since a 4-3 road trip, won despite shooting just 8 of 28 (29%) on 3-pointers. Bradley Beal added 25 points and 10 rebounds. \n\n\r\n              Booker — who was recently named to his fourth All-Star team — shot 12 of 21 from the field. Jusuf Nurkic had 10 points and 10 rebounds.\n\n\r\n              Milwaukee took a 49-48 halftime lead despite shooting just 38% from the field.\n\n\r\n              Middleton twisted his ankle when landing on Durant’s foot after he attempted a jumper. Durant was called for a foul and it was upgraded to a Flagrant 1 after officials judged that the Suns forward didn’t give Middleton space to land.\n\n\r\n              The 32-year-old, who is a three-time All-Star, scored six points in eight minutes before the injury. Rivers said X-rays were negative.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Minnesota on Thursday night.\n\n\r\n              Suns: Host Utah on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996119.2888021
}