{
  "game_id": "0022100566",
  "espn_id": "401360385",
  "date": "Jan 04, 2022",
  "matchup": "SAC @ LAL",
  "headline": "LeBron, Monk lead Lakers' late rally past Kings, 122-114",
  "body": "LOS ANGELES -- — LeBron James scored 14 of his 31 points in the fourth quarter, Malik Monk added 11 of his 24 in the final seven minutes, and the Los Angeles Lakers held off the Sacramento Kings 122-114 on Tuesday night for their fourth win in five games.\n\n\r\n              Talen Horton-Tucker scored 19 points for the Lakers, who rallied from a late seven-point deficit with one big basket after another from Monk and James. Monk hit six 3-pointers in yet another impressive offensive game, and Russell Westbrook added 19 points and drew a key late charge as the Lakers climbed back above .500.\n\n\r\n              Westbrook played 34 minutes in his first turnover-free game since March 14, 2016. The Lakers committed only five total turnovers, allowing them to take 16 more shots than Sacramento.\n\n\r\n              “That’s the reason we won the game,” James said. “We did not turn the ball over tonight. When we get shots at the goal, we can be very dangerous. We weren’t shooting the ball well at all, (but) because we didn’t turn the ball over, we caught on fire.”\n\n\r\n              De'Aaron Fox scored 30 points and Buddy Hield added 26 with seven 3-pointers for the Kings, who scored 11 consecutive points early in the fourth quarter before wilting down the stretch. Harrison Barnes had 14 points for Sacramento, which had won three straight over the Lakers in Los Angeles.\n\n\r\n              Tyrese Haliburton's jumper put the Kings up with three minutes to play, but Monk's 3-pointer and James' layup put the Lakers back ahead 114-110. Westbrook and James added layups as LA held on by scoring on nine consecutive possessions down the stretch.\n\n\r\n              “You’ve got to give (James) credit,” Barnes said. “He made some shots, but as a collective we could have done a better job making him work for some of those shots. In this league, it’s hard to guard one-on-one, especially great players.”\n\n\r\n              Dwight Howard had a season-high 14 points and 14 rebounds for the Lakers, who beat a Pacific Division opponent at home for the first time in six tries this season.\n\n\r\n              Despite an unimpressive start, James extended a torrid stretch that began before the holidays and included seven consecutive 30-point games before he only produced 26 Sunday against Minnesota. LA also got another boost from Monk, who has scored at least 15 points in six straight games.\n\n\r\n              “I always think that I can do that for any team I’m on, and I’m ready for whatever happens,” Monk said. “We’re short a couple of people, but even when they come back, I’m still going to be ready and still going to produce.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: USC product Chimezie Metu went into the NBA's health and safety protocols earlier in the day, joining Richaun Holmes. Metu was one of the few Kings who didn't enter the protocols when Sacramento was at its most short-handed last month, and he hit the last-second 3-pointer to beat Dallas last week. ... G Terence Davis missed his fourth straight game with an ankle injury. ... Holmes missed his second straight game.\n\n\r\n              Lakers: Kendrick Nunn has yet to make his debut for Los Angeles due to a preseason bone bruise, but coach Frank Vogel said the mid-level exception signing is working out with Lakers coaches and getting closer to a return. Although Nunn will miss at least half of the regular season unless he returns this week, Vogel said the third-year NBA pro will play “a lot of minutes” when he's healthy.\n\n\r\n              TOUGH CALL\n\n\r\n              Kings interim coach Alvin Gentry was incensed when officials were forced to call a jump ball after Monk missed a free throw with 24.8 seconds to play and the game clock started running before Fox touched the rebound. Sacramento still trailed by five at the time, but the Kings lost the jump ball and any chance of a comeback.\n\n\r\n              Gentry was profane in his criticism of the rule, but stressed he didn't blame the officials for enforcing it: “The referees did what they were supposed to do. If there’s anything that needs to be changed, it’s the rule that needs to be changed. We didn’t start the clock. It wasn’t our error. We got punished for a (stupid) rule.\"\n\n\r\n              A.B. DECISION\n\n\r\n              Avery Bradley scored seven points in his final game for the Lakers before they must decide whether to allow the guard’s contract to become guaranteed for the rest of the season. The Lakers claimed Bradley off waivers while they were short-handed in October, and he surprisingly has been a rotation regular with 26 starts.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Atlanta on Wednesday.\n\n\r\n              Lakers: Host Atlanta on Friday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993098.138376
}