{
  "game_id": "0022300102",
  "espn_id": "401584730",
  "date": "Oct 30, 2023",
  "matchup": "CHI @ IND",
  "headline": "Nikola Vucevic helps the Bulls rally past the Pacers for a 112-105 win",
  "body": "INDIANAPOLIS -- — Nikola Vucevic scored nine of his 24 points in the fourth quarter, and the Chicago Bulls rallied past the Indiana Pacers 112-105 on Monday night.\n\n\r\n              The Bulls trailed by five entering the fourth, but surged down the stretch as Vucevic delivered three key layups. The first two tied the game and the third gave Chicago a one-point lead. DeMar DeRozan put the Bulls ahead to stay on a layup that made it 101-99 with 3:46 remaining.\n\n\r\n              “The last five minutes, we played downhill,” Bulls coach Billy Donovan said. “We played down to the basket, at the basket. ... We're not trying to win by shooting jump shots.”\n\n\r\n              Zach LaVine had 23 points and DeRozan scored 20 for the Bulls, who have split four games to start the season. The pair shot a combined 12 of 36 from field.\n\n\r\n              “If we can get everybody involved and play downhill, there's plenty to go around for everybody to eat,” Donovan said.\n\n\r\n              Chicago went 26 of 31 at the line, where Indiana went 21 of 25.\n\n\r\n              The Pacers, who had opened with a pair of victories, were their own worst enemy in settling for long-range shots. They made 12 of 46 3-pointers (26.1%). \n\n\r\n              “Look, our guys played hard too, we just didn't play well,” Pacers coach Rick Carlisle said. “The quality of our 3s could have been better.”\n\n\r\n              Myles Turner led the Pacers with 20 points. Tyrese Haliburton had 19 points and 13 assists, and Bennedict Mathurin and Bruce Brown each scored 15 points.\n\n\r\n              Haliburton's driving layup in the final seconds gave Indiana a 55-53 lead at halftime.\n\n\r\n              “This was a big boys game, physical,” Carlisle said. “We've got to learn from it.”\n\n\r\n              Two nights after scoring a career-high 51 points at Detroit, LaVine struggled early. The All-Star made two of seven shots but hit five free throws for 10 points in the first half. DeRozan missed six of seven shots in a four-point half.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Dallas on Wednesday.\n\n\r\n              Pacers: At Boston on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995924.777914
}