{
  "game_id": "0021900069",
  "espn_id": "401160711",
  "date": "Nov 01, 2019",
  "matchup": "HOU @ BKN",
  "headline": "Nets slow down Harden, Rockets in 123-116 victory",
  "body": "NEW YORK --  Even though James Harden's jumpers weren't falling, Nets coach Kenny Atkinson wanted to make sure his players kept defending them.\n\nSo he held up a sign with a picture of former Orlando Magic player Dennis Scott, wearing his No. 3 uniform, with a red line crossing through it.\n\nThe message came through loud and clear.\n\n\"It was a ridiculous sign,\" center Jarrett Allen said, \"but it made us look and it worked.\"\n\nTaurean Prince had 27 points and 12 rebounds, and the Nets slowed down Harden and the Houston Rockets in a 123-116 victory Friday night.\n\nTwo nights after scoring a franchise-record 159 points in a victory at Washington, the Rockets couldn't get nearly enough shots to drop after opening an early 15-point lead. They went 12 for 48 from 3-point range, with Harden a dismal 2 for 16 in the face of an improved Nets defense -- and Atkinson's unusual sign.\n\n\"It's just a defensive coverage we have and we've had trouble communicating it to the guys in the past, so we came up with this idea to find a way to communicate so everyone knows,\" Atkinson said. \"Sometimes if you use humor in things it sinks in a little more with the guys.\"\n\nHarden, the NBA's leading scorer last season, fell to 14 for 70 from behind the arc this season.\n\n\"I had a lot of opportunities,\" Harden said. \"The 3-ball hasn't been going for me but I'm just going to continue to shoot. I was here yesterday, this morning was here shooting so I'm not worried about it. Those are good shots. Those are shots that I've been taking the last couple of years, so even if teams are trying to take the 3-ball away, I'm going to still shoot them.\"\n\nHarden finished with 36 points and eight assists, but he was 10 for 31 from the field. Russell Westbrook added 27 points, eight assists and seven rebounds.\n\nThe Nets also forced sixth man Eric Gordon to miss all five 3s in his 0-for-7 night. Westbrook was 1 for 6.\n\n\"Wide open,\" Westbrook said. \"Just got to make them.\"\n\nNeither Harden nor Kyrie Irving was at his best in a matchup of the NBA's two leading scorers.\n\nHarden came in leading the league with 36.8 points per game, and scored 59 in the Washington outburst. Irving was at 35.3 per game and had scored at least 26 in all four games, but he finished with 22 points on 7-for-18 shooting with 10 assists.\n\nThe Nets didn't need a big scoring performance from him in a well-balanced effort. Caris LeVert scored 25 points, Garrett Temple had 16 and Joe Harris 15.\n\nHouston led 45-30 early in the second quarter, but LeVert scored 12 points in the period to send the Nets into halftime with a 61-59 lead.\n\nPrince hit two 3-pointers during his run of eight straight points for Brooklyn that extended the lead to 85-73, and the Nets were still up 12 after three.\n\nWestbrook had three baskets early in the fourth as Houston climbed within eight, but then he checked out for a few minutes when Harden came back on, and the Rockets' push fizzled.\n\nTIP-INS\n\nRockets: Houston had won three in a row. ... Houston has scored 30 or more in the first quarter three times in five games.\n\nNets: Brooklyn committed 10 turnovers in the first quarter. ... Temple scored in double figures for the first time this season. He went 4 for 6 from 3-point range after going 2 for 9 in the first four games.\n\nFIRST-QUARTER FLURRY\n\nHarden lost three points in the first quarter when a review of his 3-pointer showed he stepped out of bounds first. The Nets went from a 23-18 lead going into a timeout to 23-15 coming out of it. The Rockets then ran off the next 13 points and outscored Brooklyn 18-1 the rest of the period to lead 33-24.\n\nUNSTOPPABLE SCORER?\n\nRockets coach Mike D'Antoni was asked what Westbrook's presence prevents teams from doing against Harden that they could do before.\n\n\"To be honest with you, it wouldn't matter if he's out there, I'm out there. You could play with him,\" D'Antoni responded. \"He's getting 60 if he wants. They can try anything they want to.\"\n\nUP NEXT\n\nRockets: At Miami on Sunday night.\n\nNets: At Detroit on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996657.682168
}