{
  "game_id": "0021600918",
  "espn_id": "400900313",
  "date": "Mar 03, 2017",
  "matchup": "LAL vs. BOS",
  "headline": "Celtics send Lakers to 6th straight loss, 115-95",
  "body": "LOS ANGELES --  Isaiah Thomas was close to going back into the game after the Lakers got within 13 points at the start of the fourth quarter.\n\nInstead, the Celtics reserves made sure Thomas stayed on the bench by extending the lead to 22 points.\n\nThomas finished with 18 points and Boston rode a 70-point first half to a 115-95 rout of Los Angeles on Friday night.\n\n\"We were just making the right plays, moving the ball from side to side,\" Thomas said. \"Making the easy plays for the most part.\"\n\nJae Crowder scored 10 of his 14 points in the first half, when the Atlantic Division-leading Celtics shot 51 percent on the way to opening their road trip 2-0.\n\n\"We were really moving the ball, we were playing with great purpose and we got the ball to the right guys in the right situations,\" Boston coach Brad Stevens said.\n\nJordan Clarkson led the Lakers with 20 points off the bench in the third quarter in their sixth straight loss. They haven't won since before the All-Star break and have dropped four in a row at Staples Center.\n\n\"I love how we've been practicing, but we've just got to translate it to the game,\" said Julius Randle, who had 13 points.\n\nTrailing by 31 in the third, Clarkson singlehandedly cut the Lakers' deficit to 15 by scoring their final 13 points. The Celtics managed just four points over the final 4  1/2 minutes of the quarter, but took a 93-78 lead into the fourth.\n\n\"We knew the game was out of hand, but I was just trying to compete,\" Clarkson said.\n\nThomas drew aahs from the crowd with a pretty assist before the Lakers' run, tossing the ball off the glass to set up Jaylen Brown's dunk.\n\n\"It's embarrassing for us to see,\" said rookie Brandon Ingram, who took and missed his only two shots of the game in the fourth quarter.\n\nThat's the effect Lakers coach Luke Walton was hoping Thomas' lob had on his young team.\n\n\"This team is showboating on our home court,\" Walton said. \"If we're not running back on defense, rub it in the players' faces. Hopefully, it (ticks) the players off.\"\n\nThe Lakers went cold early in the fourth and the Celtics capitalized with a 10-0 run that extended their lead to 105-82. Brown scored six in a row in the spurt while Thomas watched from the bench.\n\n\"It all came from getting stops,\" said Avery Bradley, who had 15 points. \"When you are able to get stops, you are able to get steals or rebounds and push the ball out. It is fun playing that way.\"\n\nBoston closed the first half on a 19-6 run, with five different players contributing, led by Thomas' six points. A pair of 3-pointers by Nick Young accounted for the Lakers' only points.\n\nD'Angelo Russell added 17 points for the Lakers, while Al Horford had 17 for the Celtics.\n\nTIP-INS\n\nCeltics: F Amir Johnson finished with 13 points in a homecoming game. He made the NBA out of nearby Westchester High. ... Their 70 points in the first half were a season high. ... C Tyler Zeller was out sick.\n\nLakers: Longtime Lakers fan Dyan Cannon walked over to team co-owner Jeanie Buss and hugged her during a timeout. Buss is embroiled in a power struggle with her brothers over control of the team.\n\nUP NEXT\n\nCeltics: Visit Phoenix on Sunday in the second game of a five-game trip before returning to LA to play the Clippers on Monday in a back-to-back.\n\nLakers: Host New Orleans on Sunday, a team they've split games with this season.",
  "source": "espn_api",
  "crawled_at": 1764995376.4425988
}