{
  "game_id": "0022400513",
  "espn_id": "401705079",
  "date": "Jan 08, 2025",
  "matchup": "BKN vs. DET",
  "headline": "Malik Beasley scores 23 and Pistons win 5th straight, 113-98 over Nets",
  "body": "NEW YORK -- — Malik Beasley scored 23 points, Cade Cunningham had 13 points, five assists and five rebounds, and the Detroit Pistons won their fifth straight game, 113-98 over the Brooklyn Nets on Wednesday night.\n\n\r\n              Detroit’s bench outscored Brooklyn’s 50-20, led by reserves Simone Fontecchio with 17 points and Marcus Sasser, who added 15 points. Detroit has won eight of its last nine games to climb above .500 at 19-18.\n\n\r\n              Noah Clowney finished with a game-high 29 points, and Tyrese Martin scored 12 points and had 10 rebounds for the Nets, who dropped their third straight overall and seventh in a row at Barclays Center.\n\n\r\n              Takeaways\r\n              Detroit: Cunningham leads Detroit in scoring (24.4 points per game) and assists per game (9.5) yet had down nights in both categories.\n\n\r\n              His teammates picked up the slack, especially Fontecchio, Sasser and Tim Hardaway Jr. (10 points), who helped the Pistons shoot 52.3% from the field and outscore the Nets 38-13 on the fast break.\n\n\r\n              Brooklyn: The Nets were missing six rotation players, including their top three scorers in Cam Johnson, Cam Thomas and D’Angelo Russell, and second- and third-leading rebounders in Day’Ron Sharpe and Ben Simmons.\n\n\r\n              As a result, Brooklyn shot just 38.4% from the field and was outscored 54-36 in the paint.\n\n\r\n              Key moment\r\n              Trailing by 13, midway through the third quarter, Brooklyn went on a 7-0 run that cut Detroit's lead to 70-64 with 5:37 left. The Pistons responded with a 6-0 spurt that ballooned to a 21-4 run.\n\n\r\n              Fontecchio had eight points in the run, including two 3-pointers, helping Detroit build a 91-68 lead.\n\n\r\n              Key stat\r\n              Detroit is above .500 through 37 games for the first time since 2017-18 when it was 20-17.\n\n\r\n              Up next\r\n              Detroit: Hosts Golden State on Thursday night.\n\n\r\n              Brooklyn: At Denver on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997987.269671
}