{
  "game_id": "0021900898",
  "espn_id": "401161540",
  "date": "Mar 01, 2020",
  "matchup": "TOR @ DEN",
  "headline": "Jokic's triple-double leads Nuggets over Raptors, 133-118",
  "body": "DENVER --  A lackluster effort in Los Angeles prompted Will Barton to challenge his Denver teammates after their worst loss of the season.\n\nThe veteran's words hit home and the Nuggets responded with one of their best outings.\n\nNikola Jokic had 23 points, 18 rebounds and 11 assists for his 12th triple-double of the season to lead Denver over the short-handed Toronto Raptors, 133-118 on Sunday night.\n\nThe Nuggets tied a season high with 38 assists, doubling their total from their 29-point loss to the Clippers on Friday night. Coach Michael Malone said after that game that his team played soft, and Barton echoed that sentiment in the postgame locker room.\n\n\"We sometimes we can do a lot of assuming, being around each other so much. You can get complacent,\" Monte Morris said. \"For Will to stand up like that and let everyone know, down the line, play your role to a T, for him to stand up and do that made us come together even more.\"\n\nDenver played with more intensity Sunday, led by its All-Star center. Jokic has 40 triple-doubles in his short career, completing his latest by feeding Jerami Grant on a dunk that helped the Nuggets pull away from the Raptors, who lost their third straight.\n\nGrant finished with 16 points for Denver, which had eight players score in double figures.\n\n\"Even though Nikola had a triple-double and other guys played well, I thought Jerami Grant's performance was the most impactful,\" Malone said.\n\nToronto played without Serge Ibaka and Fred VanVleet for a second straight game but got a career night from OG Anunoby, who finished with 32 points on 12-of-16 shooting.\n\n\"It's not tough,\" Kyle Lowry, who finished with 17 points, said of playing short-handed. \"Honestly, you've just got to play harder, and we've got to play a lot harder.\"\n\nDenver hit its first nine 3-point attempts -- five by Jamal Murray, who had 17 of his 22 points in the first 12 minutes -- before Morris missed with 1:06 left in the first quarter. The Nuggets shot 63.6% in the first quarter and 60% in the first half.\n\nDenver hit 50 percent from long range and finished the game 56.6% from the field.\n\n\"We didn't do a good job of guarding them and putting some pressure on them,\" Pascal Siakam said. \"They had a lot of back-cuts, easy layups. Not a lot of protection under the rim.\"\n\nJokic had 10 points and 10 rebounds at halftime and and was already three assists shy of a triple-double.\n\nThe Raptors withstood the hot shooting to tie it at 60 in the second quarter and trailed just 73-69 at intermission. It was a two-point Denver lead late in the third quarter but the Nuggets opened up a 112-101 lead with 8:10 left in the fourth.\n\nToronto twice cut the deficit to five points but Denver closed it out for the win. Jokic got his ninth assist on a court-length pass to Gary Harris for a layup midway through the fourth.\n\nTIP-INS\n\nRaptors: C Marc Gasol (left hamstring tightness) missed his 13th straight game but was doing some work on the court before the game. \"All of them are getting some work in, they're just not ready for game activity,\" coach Nick Nurse said of Gasol, Ibaka and VanVleet.\n\nNuggets: The 73 points in the first half tied their season high set seven days earlier. The 69 points allowed also tied a season high. ... F Paul Millsap (right ankle) missed his 17th game this season. Millsap rolled his ankle at the Los Angeles Clippers on Friday night. ... The team is expected to buy out the contract of guard Jordan McRae. Denver acquired McRae from Washington on Feb. 6 for Shabazz Napier.\n\nPAST AND PRESENT\n\nThe capacity crowd included two Denver Broncos quarterbacks sitting courtside -- future Hall of Famer Peyton Manning and Drew Lock, who took over as Denver's starter late in the 2019 season. The Nuggets' mascot had them both sign a football in the fourth quarter, and then he tossed it into the crowd.\n\nHIGH PRAISE\n\nRaptors rookie Terence Davis II played one summer league game with Denver before Toronto signed him. Malone is happy for Davis, who is the only player on the Raptors to play in all 60 games.\n\n\"Our guys liked him a lot after the draft when he went undrafted, so a lot of teams missed on Terence Davis,\" he said. \"He's another guy like Pascal that a lot of people missed on and has just done wonders his rookie season. Toughness, not afraid, confident -- intangibles that don't jump off your stat sheet.\"\n\nUP NEXT\n\nRaptors: Play at Phoenix on Tuesday night.\n\nNuggets: Host Golden State on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764995583.5428312
}