{
  "game_id": "0022000316",
  "espn_id": "401267476",
  "date": "Feb 01, 2021",
  "matchup": "MIL vs. POR",
  "headline": "Bucks sizzle from 3-point range to blast Blazers 134-106",
  "body": "MILWAUKEE -- — Jrue Holiday scored 22 points, Bobby Portis added 21 and the Milwaukee Bucks snapped a two-game skid by trouncing the Portland Trail Blazers 134-106 on Monday night.\n\n\r\n                    The Bucks pulled ahead for good midway through the first quarter and led by as many as 39 points early in the fourth period.\n\n\r\n                    “Obviously we really, really needed this win really, really bad,” Portis said. \"We didn’t want to drop three in a row. Us getting this win tonight was big.”\n\n\r\n                    Milwaukee went 21 of 42 from 3-point range and shot 55.2% overall. That represented a reversal of fortune for the Bucks, who had been lit up from long range during their three-game road trip. \n\n\r\n                    The Bucks went 1-2 during that stretch and allowed at least 21 3-pointers in each of those games.\n\n\r\n                    “Tonight they came out with an edge,” Bucks coach Mike Budenholzer said. “They took a first punch from Portland. Portland made some shots in the first quarter, but our offensive execution, our unselfishness, our playing with each other was really at a high level.”\n\n\r\n                    Holiday shot 10 of 14 and had seven rebounds and six assists. Portis shot 9 of 13 and had eight rebounds.\n\n\r\n                    Nassir Little led the Blazers (10-9) with 30 points – 2 1/2 times the second-year pro’s previous career high of 12. \n\n\r\n                    “It was a bright spot for tonight, for sure,” Trail Blazers coach Terry Stotts said. “He shot the ball really well. (Little's) had a tough go the last few months. It was good to see him get out there and see the ball go in the basket, get some extended run.”\n\n\r\n                    Milwaukee sizzled from the start of the night to take command.\n\n\r\n                    The Bucks shot 18 of 26 overall and 8 of 10 on 3-point attempts in the first quarter to grab a 46-36 lead. In the closing seconds of the first quarter, Portis grabbed a loose ball off a mishandled Portland inbounds pass and dunked before the buzzer.\n\n\r\n                    Milwaukee extended that lead to 79-56 by halftime. The Bucks shot 59.2% overall and were 14 of 22 from 3-point range in the first half.\n\n\r\n                    The Bucks remained in control the rest of the way.\n\n\r\n                    “Tonight we played with swag, played with grit, played with fire,” Portis said. “And I think that's kind of contagious for the whole team.”\n\n\r\n                    Milwaukee's Giannis Antetokounmpo scored 18 points. Khris Middleton made all four of his 3-point attempts and scored 17. D.J. Augustin went 4 of 6 from beyond the arc and had 13 points. Bryn Forbes was 3 of 5 on 3-point attempts and also had 13.\n\n\r\n                    Damian Lillard scored 17, Anfernee Simons had 15 and Enes Kanter added 10 for Portland.\n\n\r\n                    “We knew it was a tough game coming in,” Lillard said. \"I watched their previous few games and they had not been playing the best. Coming back to their home floor, you had to expect they were going to come out and try to have a much better effort and get things turned around at home.”\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: Derrick Jones Jr. missed a second straight game with a sprained left foot. Stotts says he’s hoping Jones will be able to play at some point during this four-game road swing. The Trail Blazers also were missing guard C.J. McCollum (hairline fracture in his left foot) and center Jusuf Nurkic (fractured right wrist), who have been out since mid-January.\n\n\r\n                    Bucks: By ending this brief skid, the Bucks avoided suffering their ninth loss of the season in their 20th game. Last season, the Bucks didn't lose for the ninth time until their 61st game. \n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Host Indiana on Wednesday in their first matchup with the Pacers this season. Milwaukee went 3-1 against Indiana last season.\n\n\r\n                    Trail Blazers: Visit Washington on Tuesday as they continue a stretch of three road games in four days. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997407.505703
}