{
  "game_id": "0022001066",
  "espn_id": "401307880",
  "date": "May 16, 2021",
  "matchup": "ATL vs. HOU",
  "headline": "Hawks head to playoffs after 124-95 rout of woeful Rockets",
  "body": "ATLANTA -- — Rookie Onyeka Okongwu set career highs with 21 points and 14 rebounds, and the Atlanta Hawks headed to the playoffs on a roll with a 124-95 rout of the woeful Houston Rockets in the regular-season finale Sunday night.\n\n\r\n                    The Hawks went with a makeshift lineup after their Eastern Conference playoff spot was locked in before taking the court. \n\n\r\n                    It didn't slow them down at all.\n\n\r\n                    “The fact that we had a number of guys sitting out, we've been there before, we didn't want to use that as an excuse,\" interim coach Nate McMillan said. “We wanted to finish the season off right.\"\n\n\r\n                    Okongwu, the No. 6 pick in the draft, posted his second career double-double. \n\n\r\n                    “He was a really good two-way player for us,\" McMillan said. “It was good to get him minutes, meaningful minutes, in this last game going into the playoffs.”\n\n\r\n                    Seven other players scored in double figures to lead Atlanta’s second-biggest win of the season, surpassed only by a 135-103 triumph over Phoenix on May 5.\n\n\r\n                    New York clinched the fourth seed and home-court advantage in the first round against the fifth-seeded Hawks with a 96-92 victory over Boston.\n\n\r\n                    The Knicks beat the Hawks on the tiebreaker with three straight wins over Atlanta during the regular season. Both teams finished 41-31, breaking long playoff droughts.\n\n\r\n                    “We've got a lot of momentum, a lot of confidence going into New York,” Okongwu said.\n\n\r\n                    Atlanta sat starters Clint Capela and Bogdan Bogdanovic, in addition to top sub Danilo Gallinari. Trae Young and John Collins only played in the first half.\n\n\r\n                    \r\n                      The Hawks had more than enough to blow out the Rockets, who went into full rebuilding mode when they dealt James Harden to Brooklyn in January.\n\n\r\n                    Atlanta raced away in the second quarter and led 72-54 at halftime as Collins scored 15 points, De'Andre Hunter added 13 and Young 10.\n\n\r\n                    \r\n                      Young played long enough to dish out nine assists, as well.\n\n\r\n                    Houston finished 17-55, the worst record in the league and its most dismal season since a 14-68 campaign in 1982-83. D.J. Augustin and Armoni Brooks each scored 18 points to lead the injury-ravaged Rockets, who dressed only nine players.\n\n\r\n                    Coach Stephen Silas looked for the bright spots, pointing to the improvement of players such as Brooks, Jae’Sean Tate and Kenyon Martin Jr.\n\n\r\n                    “They should have confidence going into next season,” Silas said. “I tell them all the time how much I appreciate them.”\n\n\r\n                    The Hawks pulled off a remarkable turnaround under McMillan, who led the team to a 27-11 record after Lloyd Pierce was fired with Atlanta mired at 14-20.\n\n\r\n                    HUNTER STARTS\n\n\r\n                    Hunter scored 14 points in his first start since Jan. 29. \n\n\r\n                    A budding star early in the season, he has battled a lingering right knee injury that kept him off the court for all but five of the last 53 games. \n\n\r\n                    But it looks like he’s ready to contribute in the playoffs after going more than 24 minutes.\n\n\r\n                    “He looked fine,” McMillan said. “We asked Trae and John to give us a few minutes because we wanted to start Dre tonight and we wanted that combination of players to play together. Trae did a really good job of getting Dre involved, getting him the ball and allowing him to play. I wanted to get a look at that.”\n\n\r\n                    TIP-NS \n\n\r\n                    Rockets: After a six-game winning streak that boosted their record to 10-9 on Feb. 1, they managed only seven victories in their last 53 games — a .132 winning percentage. ... Spent most of its final game hoisting up 3s. Houston took more than two-thirds of its shots beyond the arc, finishing 18 of 63 from long range and 32 of 93 (33.7%) overall. \n\n\r\n                    Hawks: Won their 11th straight game at State Farm Arena. ... Capela became the first Atlanta player to lead the league in rebuilding (14.3 per game) since Dikeme Mutombo in 1999-2000. ... Mutombo watched the game from a courtside seat. ... The Hawks also got double-figure scoring from Skylar Mays (16), Nathan Knight (13), Lou Williams (11) and Bruno Fernando (10). \n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: Looking forward to the NBA draft.\n\n\r\n                    Hawks: Heading to the playoffs for the first time since 2017. The best-of-seven series against the Knicks opens next weekend at Madison Square Garden.\n\n\r\n                    ------\n\n\r\n                    Follow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 His work can be found at https://apnews.com/search/paulnewberry\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997854.9104278
}