{
  "game_id": "0022100079",
  "espn_id": "401359903",
  "date": "Oct 30, 2021",
  "matchup": "ORL @ DET",
  "headline": "Grant scores 22, Pistons beat Magic in Cunningham's debut",
  "body": "DETROIT -- — Jeremi Grant scored 22 points, No. 1 pick Cade Cunningham added seven rebounds in his NBA debut and the Detroit Pistons beat the Orlando Magic 110-103 on Saturday night for their first victory of the season.\n\n\r\n                    Cunningham missed the preseason and the first four games of the regular season with a sprained ankle.\n\n\r\n                    “There's no way you can sit out a month and come back 100 percent,” said Pistons coach Dwane Casey, who limited Cunningham to 19 minutes, including five in the second half. “I loved the way he played and the effort he gave us, but there was going to be rust.”\n\n\r\n                    Kelly Olynyk had 18 points for Detroit, while Saddiq Bey and Josh Jackson each scored 13 points.\n\n\r\n                    “I think it is tough for teams to handle Kelly and me,” said Pistons starting center Isaiah Stewart, who had 11 points and eight rebounds. “They have to guard me one way and guard Kelly in a completely different way because our games are so different. That's tough.”\n\n\r\n                    Brothers Franz (19 points) and Moritz Wagner (13) combined for 32 points for the Magic (1-6), including seven 3-pointers. Cole Anthony had 15 points and 10 rebounds.\n\n\r\n                    “I think we gave up too many offensive rebounds in the first half, and we had too many turnovers in the second half,” Franz Wagner said. “We hit some shots, but we gave away too many possessions.”\n\n\r\n                    Cunningham struggled from the floor in the first half of his debut, going 1 for 7 and missing all four 3-point attempts. However, he had seven rebounds and two assists in 14 minutes of action. He missed his only shot while playing five minutes in the second half.\n\n\r\n                    “I thought it was a good night,” he said. “I wanted to make sure my ankle was good, and I was able to go out there and make some plays and grab some rebounds. Now I know I'm fine, so I can play free and easy moving forward.”\n\n\r\n                    Detroit led 48-47 at the half, but Orlando led for most of the third quarter thanks to 20 points from the Wagner brothers. Grant kept the Pistons close with nine points in the period before Olynyk added 10 with the second unit.\n\n\r\n                    The Pistons used a 15-0 run to take an 82-70 lead before Mortiz Wagner's 3-pointer to pull the Magic within nine at quarter's end.\n\n\r\n                    Detroit scored the first six points of the fourth, expanding their lead to 88-73, and Orlando never threatened down the stretch.\n\n\r\n                    “I think we ran out of gas a little bit,” Magic coach Jamahl Mosley said. “This is our third game in four nights, and we can't use that as an excuse, but we wore down. Those guys used a lot of energy keeping us in the game for three quarters.”\n\n\r\n                    TIP INS\n\n\r\n                    Magic: The Wagner brothers both attended nearby Michigan, as did Ignas Brazdeikis, while Gary Harris went to Michigan State. Harris almost certainly enjoyed Saturday afternoon more than his teammates, as the Spartans upset Michigan 37-33 in East Lansing.\n\n\r\n                    “It was nice to see a lot of people from Michigan,” said Franz Wagner, who played for the first time in Detroit. “There were a lot of people heckling us about today, but there were also a lot yelling ‘Go Blue!'\"\n\n\r\n                    Pistons: Cunningham's NBA debut came on the 40th anniversary of Isiah Thomas' first game for the franchise. ... The Pistons got 59 points from the bench.\n\n\r\n                    “I thought our bench was really good,” Casey said. “With Cade playing tonight, we were able to put the group we had in training camp back together, and they are getting that chemistry back.”\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: At Minnesota on Monday night.\n\n\r\n                    Pistons: At Brooklyn on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764993470.722362
}