{
  "game_id": "0022200085",
  "espn_id": "401468240",
  "date": "Oct 29, 2022",
  "matchup": "MIL vs. ATL",
  "headline": "Bucks outlast Hawks 123-115 to maintain perfect record",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo and Jrue Holiday each scored 34 points as the Milwaukee Bucks responded after falling behind in the fourth quarter to beat the Atlanta Hawks 123-115 on Saturday night and remain unbeaten.\n\n\r\n              Antetokounmpo scored 30 of his 34 points after halftime and also had 17 rebounds. Holiday also had 12 assists as the Bucks withstood Trae Young’s 42-point effort and improved to 5-0.\n\n\r\n              “We really just stayed confident,” Holiday said. “I don't think we felt any type of pressure. We kind of knew what we had to do. Down the stretch, we did a great job.\"\n\n\r\n              The Hawks trailed 118-115 after calling a timeout with 23.2 seconds left, but De'Andre Hunter was called for an offensive foul on Wesley Matthews before Atlanta could throw the ball inbounds. Hunter made contact with Matthews, who then collided with Young.\n\n\r\n              “The guy basically ran him over,” Bucks coach Mike Budenholzer said. “I don't know if he's trying to create some confusion and try to create a call the other way, but good officiating to see it and call it. That's the kind of thing Wes does to help us win.”\n\n\r\n              Young had a different opinion.\n\n\r\n              “I think the refs got it wrong, but it is what it is,\" Young said. “We've got to move on to the next one.”\n\n\r\n              The Bucks went 19 of 29 on free-throw attempts, while the Hawks were 12 of 15. In the fourth quarter, the Bucks were 9 of 16 and the Hawks never got to the foul line.\n\n\r\n              “We’ve got to be more aggressive getting to the basket,” Hawks coach Nate McMillan said. “Tonight I thought we settled a lot for the jump shot and the deep ball.”\n\n\r\n              Milwaukee sealed the win after the offensive foul, with Antetokounmpo delivering the emphatic punctuation by dunking in the closing seconds after Holiday stole the ball from Young.\n\n\r\n              Antetokounmpo has scored 151 points over his last four games, which represents the highest output he's had for any four-game stretch in his career. The two-time MVP still believes he has plenty of room to grow.\n\n\r\n              “I'm not going to lie to you -- I haven't had that feeling, this feeling I always have when I play big-time games,” Antetokounmpo said. “I haven't had it yet. I don't think I'm in a rhythm yet. I'm still chasing it. I'm still chasing that feeling.”\n\n\r\n              Brook Lopez had 21 points and Jordan Nwora 11 for the Bucks. \n\n\r\n              Dejounte Murray scored 21, Hunter 14 and Clint Capela 11 for the Hawks.\n\n\r\n              The Hawks trailed by 10 with less than 10 minutes left but rallied to tie the game at 104-all on Young’s 10-footer with 4:36 remaining, the first time Milwaukee hadn’t led since about seven minutes remained in the fourth quarter.\n\n\r\n              After Antetokounmpo responded by driving the lane and throwing down a left-handed dunk, Young sank a 3-pointer from over 30 feet away with 4:09 remaining, giving the Hawks their first lead since the opening period.\n\n\r\n              Antetokounmpo answered with another dunk that put the Bucks back ahead for good with 3:56 remaining, though the game remained tight until Milwaukee closed on a 7-0 run.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Atlanta had a 53-19 edge over Detroit in bench scoring in a Friday victory over the Pistons but couldn’t get the same type of production from its reserves Saturday. Milwaukee’s reserves outscored Atlanta’s bench 30-23. … Justin Holiday’s 10 points were a season high. Justin Holiday is Jrue’s older brother. Justin’s younger brother is Atlanta’s Aaron Holiday who scored three points in 24 minutes.\n\n\r\n              Bucks: After shooting a combined 1 of 11 from 3-point range in victories over Brooklyn and New York this week, Lopez was 5 of 8 from beyond the arc Saturday. He made his first five attempts and had 19 points in the first 19 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Toronto on Monday in the fourth of five straight road games. \n\n\r\n              Bucks: Host Detroit on Monday in the first of two straight games with the Pistons.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994608.535153
}