{
  "game_id": "0022000184",
  "espn_id": "401267344",
  "date": "Jan 15, 2021",
  "matchup": "CHI @ OKC",
  "headline": "Gilgeous-Alexander's 33 lead Thunder past Bulls in OT",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had a career-high 33 points and 10 assists to help Oklahoma City beat the Chicago Bulls and former Thunder coach Billy Donovan 127-125 in overtime Friday night.\n\n\r\n                    Oklahoma City rallied from 22 points down in the second half. Zach LaVine, who led the Bulls with 35 points, could have won it in overtime but he missed a deep, off-balance 3-pointer in the closing seconds.\n\n\r\n                    Donovan knew all too well how good Oklahoma City can be under challenging circumstances. His Thunder team made a habit of rallying and winning close games last season on the way to a surprising playoff berth. \n\n\r\n                    “Those guys are great competitors when they’re down,\" Donovan said. “They play all the way through. I knew even being up 18 at the half that they were going to fight their way through and have some kind of momentum push there.” \n\n\r\n                    First-year Thunder coach Mark Daigneault, an assistant under Donovan last season, didn't get caught up in the matchup with his mentor.\n\n\r\n                    “I have great respect, obviously, for him,\" Daigneault said. \"I love the guy. But I have a responsibility. It’s like when players play against guys that they were teammates with. Once the ball goes up in the air, we’ve got to do our jobs. At that point, it’s just another game. The relationship lies outside of the competition.”\n\n\r\n                    Lu Dort scored 21 for the Thunder, who claimed their first home win in six tries this season.\n\n\r\n                    Coby White had 22 points for the Bulls, who lost their fourth straight.\n\n\r\n                    The Bulls led 68-50 at halftime, but Daigneault could tell the Thunder hadn't given up.\n\n\r\n                    “Coming out of the half, the guys — I thought it came from them today,\" Daigneault said. \"They made a decision walking out of the half to not let go of the rope.”\n\n\r\n                    The Bulls led 78-56 early in the second half, but the Thunder responded with a 13-0 run to get back into the game. Dort scored 13 points in a span of 2:33 to help trim the deficit, and Oklahoma City got as close as two points in the period. Chicago took a 95-87 lead into the fourth quarter.\n\n\r\n                    Gilgeous-Alexander scored 12 points in the fourth to help force overtime. LaVine missed a contested 3 in the closing seconds that could have won it for Chicago.\n\n\r\n                    Lavine's 3-pointer with 6.1 seconds to play in overtime cut the Thunder lead to 126-125. Oklahoma City's George Hill was fouled with 5.2 seconds left. He missed the first free throw and made the second to set up LaVine's final attempt.\n\n\r\n                    “I thought our relentless spirit in the game was what stood out,\" Daigneault said. \"And even if we didn’t win it, we stood back up tonight, which is progress for us. It was a really good response from the guys, and it came from inside them.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: F Lauri Markkanen hadn't played since Dec. 29 because of COVID-19 protocols. He scored 16 points but shot just 5 of 14. ... Oklahoma City scored 19 points off Chicago's nine turnovers in the third quarter.\n\n\r\n                    Thunder: C Al Horford sat out for personal reasons. He missed Wednesday's game against the Los Angeles Lakers to rest in the second game of a back-to-back. ... Oklahoma City shot 56% in the third quarter and outscored the Bulls 37-27. ... Second-year C Isaiah Roby fouled out with 14 points. ... Reserve G/F Kenrich Williams scored 14 points.\n\n\r\n                    STAT LINES\n\n\r\n                    Dort had a career-high six steals, blowing past his previous best of three. He also grabbed eight rebounds. \n\n\r\n                    UNSUNG HERO\n\n\r\n                    Oklahoma City reserve center Mike Muscala scored six of the Thunder's nine points in overtime and finished with 11 points. He shot 1 of 6 in regulation and 2 of 3 in the extra period.\n\n\r\n                    UP NEXT\n\n\r\n                    The Bulls visit the Mavericks on Sunday.\n\n\r\n                    The Thunder host the 76ers on Sunday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997601.331831
}