{
  "game_id": "0022400517",
  "espn_id": "401705083",
  "date": "Jan 09, 2025",
  "matchup": "TOR @ CLE",
  "headline": "Darius Garland scores season-high 40 points, Cavaliers beat Raptors 132-126 for 12th straight win",
  "body": "CLEVELAND -- — Darius Garland scored a season-high 40 points, Jarrett Allen had 18 points and 15 rebounds, and the NBA-leading Cleveland Cavaliers beat the Toronto Raptors 132-126 on Thursday night to extend their win streak to 12.\n\n\r\n              Evan Mobley finished with 21 points, 11 rebounds and six assists for the Cavaliers, who are tied for the fifth-best record in league history through 37 games at 33-4. Cleveland also has the top home mark in the NBA, going 20-1 at Rocket Mortgage FieldHouse.\n\n\r\n              Scottie Barnes had 24 points, 10 rebounds and eight assists for Toronto, which is a league-worst 1-17 on the road and has lost 15 of its last 16 overall. Chris Boucher added 23 points and 12 rebounds off the bench.\n\n\r\n              Cavaliers guard Donovan Mitchell was given the night off after playing a team-high 35 minutes Wednesday in a 129-122 win over the Thunder. West leader Oklahoma City had won a franchise-record 15 in a row.\n\n\r\n              Takeaways\r\n              Raptors: Boucher and rookie Jamal Shead combined to make 12 of their first 13 shots, including all eight 3-pointers, as Toronto built a 93-81 lead midway through the third quarter. Shead didn’t play in the fourth and finished with 15 points.\n\n\r\n              Cavaliers: Coach Kenny Atkinson said wrapping up a back-to-back set against the Raptors was “a perfect trap game.” Cleveland’s players didn’t take the message to heart until the final quarter, when they outscored Toronto 34-23.\n\n\r\n              Key moment\r\n              Allen dove into the courtside seats to rebound Barnes’ missed turnaround that could have tied the score with 1:02 remaining. Garland followed with a 3-pointer that extended the Cavaliers’ lead to 129-124.\n\n\r\n              Key stat\r\n              Center Allen and power forward Mobley made 15 of their 20 field goal attempts, continuing to bolster their case for being chosen to the Eastern Conference All-Star team.\n\n\r\n              Up next\r\n              The Raptors visit Detroit on Saturday. The Cavaliers host Indiana on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996967.8806
}