{
  "game_id": "0021600577",
  "espn_id": "400899998",
  "date": "Jan 10, 2017",
  "matchup": "LAL vs. POR",
  "headline": "McCollum has 25, Blazers beat Lakers for 10th straight time",
  "body": "LOS ANGELES -- If there's a mystery to it, the Los Angeles Lakers can't solve it. They can only seem to repeat the same story over and over.\nPlay the Portland Trail Blazers, lose to the Portland Trail Blazers.\nIt happened yet again, with the Blazers using a dominant third quarter to defeat the Lakers for the 10th consecutive time, 108-87 on Tuesday night.\nThe Blazers trailed by two to start the second half, but held the Lakers to 21.7 percent shooting (5 of 23) and blocked four shots in the third quarter, outscoring Los Angeles 23-12.\n\"I'm still trying to figure out exactly what happened in the second half,\" Lakers coach Luke Walton said. \"I was shocked.\"\nC.J. McCollum led the Blazers with 25 points, but Damian Lillard sparked the third-quarter rally. After starting the game 0 for 8 from the field, Lillard scored 11 points in the third, perhaps inspired by a double technical on him and Lakers guard D'Angelo Russell when they exchanged brief but heated words.\n\"Don't poke the bear,\" said Portland forward Maurice Harkless, who had 14 points. \"Let him sleep.\"\nAfter scoring 31 points in the second quarter, the Lakers managed only 30 more in the second half.\n\"I really didn't recognize that team,\" Walton said.\nLuol Deng led the Lakers with 14 points, but did not make a field goal after the first half.\nRussell was 4 of 14 on the night, finishing with nine points, eight rebounds and six assists.\n\"A little incident happened and then they turned up the pressure,\" he said. \"They started making shots, started getting stops and we didn't.\"\nThe Blazers shot 50.6 percent. Harkless hit all but one of his six field goal attempts and blocked three shots. Al-Farouq Aminu had 15 rebounds, and Evan Turner added seven assists off the bench.\n\"I was really pleased with our defensive effort in the second half,\" Portland coach Terry Stotts said. \"Particularly in the third quarter, we did a really nice job in a lot of different areas.\"\nTIP-INS\nTrail Blazers: When guard Allen Crabbe scored 30 points Sunday against Cleveland, he became the first Portland player to score 30 off the bench since Jamal Crawford went for 34 on April 11, 2012. ... Mason Plumlee's 10 rebounds and 12 assists vs. the Cavs made him the first Blazers forward or center to have a double-double in those categories since Mychal Thompson on Jan. 6, 1984.\nLakers: G Lou Williams leads the team in scoring (17.9 points per game) off the bench. He could become only the second Lakers reserve to lead the club in scoring. The other was Nick Young, three seasons ago. ... Los Angeles' bench remains the NBA's best offensive unit (49.1 points per game).\nLAMAR ODOM\nWalton seemed hesitant to discuss any possible role with the team for the former Lakers star in the future. But the coach said he had been in contact with the 37-year-old Odom and would not rule out him joining the Lakers later in some coaching capacity. \"I think when he's ready, he would be great,\" Walton said. Odom reportedly completed a monthlong substance-abuse program at a San Diego rehab facility Thursday.\nUP NEXT\nTrail Blazers: Play on back-to-back nights when they host Cleveland on Wednesday. The Cavaliers won the earlier meeting 137-125 in Cleveland, but the Blazers have won the last three matchups in Portland.\nLakers: Travel to San Antonio for Thursday's game against the Spurs. The two have met once this season, with the Spurs winning 116-107 in Los Angeles when both starting forwards, Kawhi Leonard and LaMarcus Aldridge, scored 23 points.",
  "source": "espn_api",
  "crawled_at": 1764995403.3643079
}