{
  "game_id": "0022000761",
  "espn_id": "401307552",
  "date": "Apr 04, 2021",
  "matchup": "ORL @ DEN",
  "headline": "Aaron Gordon's 24 points leads Denver past Orlando 119-109",
  "body": "DENVER -- — Aaron Gordon scored 24 points against his former team, rallying the Denver Nuggets past the Orlando Magic 119-109 Sunday night.\n\n\r\n                    “Those are my brothers, man,” Gordon said, “but business is business.”\n\n\r\n                    Gordon said he was proud of his team’s resilience, evidenced by its 72-44 recovery in the second half.\n\n\r\n                    “A lot of teams that get down by 18 in the first half, they would just let go of the rope, they would just give up,” Gordon argued.\n\n\r\n                    Not these guys.\n\n\r\n                    “It’s a testament,\" he said, “to where this team can go.”\n\n\r\n                    Gordon scored Denver's first dozen points, then helped the Nuggets erase an 18-point halftime deficit for their 14th win in 17 games and their 10th straight over the Magic. \n\n\r\n                    “Poor offense, poor defense, poor effort,” Denver coach Michael Malone said of his team's awful first half, which he called “our worst half of the season.”\n\n\r\n                    Which was followed by a masterpiece.\n\n\r\n                    “It was great to see the comeback, but I'd rather see 48 minutes” of that kind of basketball, Malone said.\n\n\r\n                    Jamal Murray added 22 points and Michael Porter Jr. 20 for Denver, which got 17 points, 16 assists and nine rebounds from Nikola Jokic. Chuma Okeke and Terrence Ross led Orlando with 19 points each.\n\n\r\n                    Rookie R.J. Hampton, who was dealt by Denver in the Gordon trade, scored 16 points, including Orlando's first seven.\n\n\r\n                    “It was definitely fun to see those guys and compete against those guys,\" Hampton said. “They're a great basketball team.”\n\n\r\n                    Malone said before tip-off that he didn’t have to give Gordon any advice about keeping his emotions in check going against his former team that dealt him to Denver last week after seven seasons in Orlando.\n\n\r\n                    But he did admonish his team not to take Orlando lightly because they're a rebuilding team, one that's also riddled by injuries and illnesses.\n\n\r\n                    “If we think we can just show up because we’re playing a team that doesn’t have maybe a marquee name, we’re going to find ourselves in a ballgame,\" Malone warned.\n\n\r\n                    They sure did. \n\n\r\n                    The Nuggets trailed by double digits for most of the first half, and after cutting their deficit to 54-47, they surrendered the final 11 points of the second quarter and trailed 65-47 at halftime.\n\n\r\n                    Denver erased all of that in the third quarter before Ross put Orlando back on top 86-85 with a jumper in the closing seconds.\n\n\r\n                    But the Nuggets pulled away in the final minutes for their fourth consecutive win since the big trade for Gordon.\n\n\r\n                    TIP-INS\n\n\r\n                    Magic coach Steve Clifford called his team’s injury epidemic “like nothing I’ve ever been through before as a head coach or an assistant.” Sidelined against Denver were: Cole Anthony (ribs), Michael Carter-Williams (non-COVID illness), Markelle Fultz (left ACL), Harris (strained left adductor), Karim Mane (hamstring) and Otto Porter Jr. (left foot). Limited were Chasson Randle (hamstring), James Ennis III (non-COVID-illness) and Mo Bamba (non-COVID illness).\n\n\r\n                    Nuggets: The Nuggets played a video tribute to Harris in the second quarter, which earned him a standing ovation from the 4,050 fans at Ball Arena in the first game open to the public since before the pandemic hit last year (employees and front-line workers were at last game). Hampton, a rookie, got his video tribute later in the quarter. ... Denver was outshot in the first half 57 percent to 39 percent.\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Hosts the Washington Wizards on Wednesday night. \n\n\r\n                    Nuggets: Host the Detroit Pistons and former teammates Jerami Grant and Mason Plumlee on Tuesday night. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997581.696556
}