{
  "game_id": "0022400886",
  "espn_id": "401705452",
  "date": "Mar 04, 2025",
  "matchup": "CHI vs. CLE",
  "headline": "Donovan Mitchell scores 28 and NBA-best Cavs beat Bulls 139-117 for 11th straight win",
  "body": "CHICAGO -- — Donovan Mitchell scored 28 points, Jarrett Allen added 25 points and 17 rebounds, and the NBA-best Cleveland Cavaliers won their 11th straight game, 139-117 over the Chicago Bulls on Tuesday night.\n\n\r\n              Darius Garland added 19 points on 7-of-22 shooting for the Cavs, who rested forward Evan Mobley and fell behind by 15 points in the first half but still found a way to extend their third double-digit winning streak of the season. Cleveland began the season 15-0 and had a 12-game run in December and January.\n\n\r\n              Coby White led the Bulls with 25 points. Talen Horton-Tucker scored a season-high 22 and Zach Collins had 20.\n\n\r\n              Cleveland closed within 58-57 at halftime and the game was close throughout the third quarter. It was 107-all midway through the fourth when the Cavs began a decisive 14-0 run. Allen scored six points during the burst, and Garland's 3-pointer made it 121-107 with 4:54 left.\n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland had to rally from double-digit deficits in each of its past three games to keep its winning streak going. The Cavs trailed 25-3 at Boston on Friday night but came back to win 123-116, and they rallied from 18 points down to beat Portland in overtime on Sunday.\n\n\r\n              Bulls: Chicago (24-38) has lost nine of 11 and fell to 11-22 at home but is still clinging to the final play-in spot in the Eastern Conference.\n\n\r\n              Key moment\r\n              Allen's dunk put the Cavs ahead 109-107. He then blocked a layup attempt by Tre Jones on the other end, and Max Strus found a trailing Allen for a transition layup.\n\n\r\n              Key stats\r\n              The Cavs outscored the Bulls 43-23 in the fourth quarter.\n\n\r\n              Mitchell surpassed 13,000 points for his career. He has a 24.8 points-per-game average over eight seasons.\n\n\r\n              Up next\r\n              Cavaliers: Host Miami on Wednesday night.\n\n\r\n              Bulls: At Orlando on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997044.168171
}