{
  "game_id": "0022300645",
  "espn_id": "401585273",
  "date": "Jan 27, 2024",
  "matchup": "HOU @ BKN",
  "headline": "Cam Thomas scores 37 points, Nets hold off Rockets 106-104",
  "body": "NEW YORK -- — Cam Thomas scored 37 points and the Brooklyn Nets outlasted the Houston Rockets 106-104 on Saturday night to snap a three-game losing streak.\n\n\r\n              The Nets led by 28 points in the second quarter, with the Rockets rallying in the fourth quarter to cut it to one with seven seconds left.\n\n\r\n              Brooklyn was outscored 34-18 in the final period and committed seven turnovers, but remained composed following a fourth-quarter meltdown Sunday in Los Angeles when the Clippers scored 22 straight points to steal a victory.\n\n\r\n              Thomas, who shot 11 for 19 from the field and made 12 of 13 free throws, found some positives despite the near meltdown.\n\n\r\n              “We just got to stay locked in and try to put teams away early instead of giving away some possessions,” Thomas said. “It is definitely a positive that if we come out like we did, come out aggressive, fast, defend really well, that’s what can happen against any team we play.”\n\n\r\n              Mikal Bridges and Dorian Finney-Smith each had 19 points, and Nic Claxton added 10 points and 13 rebounds for Brooklyn. The Nets never trailed.\n\n\r\n              “We just relaxed and they came out and played harder than us,” Bridges said.\n\n\r\n              Finney-Smith, who shot 7 for 12 from the field, including 4 for 8 from the 3-point line, left because of a sore left ankle in the third quarter and did not return.\n\n\r\n              Jalen Green, Dillon Brooks and Cam Whitmore each had 19 points for the Rockets, who were on the backend of a back-to-back and have lost seven of 10 games.\n\n\r\n              “We just could have played hard from the start, we can’t be lackadaisical from the start,” Whitmore said.\n\n\r\n              Brooklyn appeared to have sealed it after a Dennis Smith Jr.’s free throw extended the lead to 107-97 with 19 seconds.\n\n\r\n              Sengun was fouled under the basket and converted both shots and Amen Thompson stole Royce O’Neal’s inbound pass and hit a 3-pointer from the corner to make it 103-102.\n\n\r\n              Thomas then made a pair of free throws and VanVleet was fouled on the ensuing possession, making one free throw to cut it to 105-102.\n\n\r\n              Segun made it 105-104 after he was fouled while trying to recover the ball after VanVleet missed a free throw. Dinwiddie was fouled on the inbound play and made one free throw.\n\n\r\n              “We’ve been in these close games and I never looked at it as a negative,” Nets coach Jacque Vaughn said.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host the Los Angeles Lakers on Monday night.\n\n\r\n              Nets: Host Utah on Monday night.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995604.003822
}