{
  "game_id": "0022000520",
  "espn_id": "401267680",
  "date": "Feb 28, 2021",
  "matchup": "MIL vs. LAC",
  "headline": "Antetokounmpo, Bucks rally late to to beat Clippers 105-100",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo and the Milwaukee Bucks showed they can still rally in the fourth quarter to win games with their defense.\n\n\r\n                    Antetokounmpo scored 36 points and sparked a game-closing 9-0 run as the Bucks rallied to beat the Los Angeles Clippers 105-100 on Sunday for their fifth consecutive victory.\n\n\r\n                    Milwaukee led the NBA in defensive efficiency while posting the league’s best regular-season record each of the last two years. The Bucks generally haven’t performed quite as well on defense this season but stifled the Clippers down the stretch.\n\n\r\n                    The Bucks held the Clippers scoreless over the final four minutes of the game and won for the first time in 11 games this season when trailing after three quarters. \n\n\r\n                    “It's great when you go against the best in the world down the stretch,” said Antetokounmpo, who also had 14 rebounds and five assists. “You're trying to get a stop, and they're trying to score on you to win the game. ... I love just taking that individual pride in guarding the best players.\"\n\n\r\n                    Kawhi Leonard’s potential tying 3-point attempt bounced off the front rim in the closing seconds. Khris Middleton got the rebound and sealed it by making two free throws with 2.1 seconds remaining.\n\n\r\n                    “It’s a step in the right direction,” said Middleton, who had 19 points, eight assists and six rebounds. “We have to prove it by doing it over and over again, not just one game or two games. But I think tonight was a great sign that we’re headed in the right direction as far as defensively.”\n\n\r\n                    After trailing by seven points in the fourth quarter, the Bucks regained the lead 101-100 when Antetokounmpo made two free throws with 1:57 left.\n\n\r\n                    The Clippers had the ball with a chance to take the lead on three separate occasions after that but couldn’t convert. Paul George missed a contested layup with 1:35 remaining. Leonard missed a 3-point attempt with 1:05 left. George missed a 3-point try with about 35 seconds left.\n\n\r\n                    \r\n                      Middleton found Antetokounmpo for a dunk to make it 103-100 with 10.3 seconds left. Antetokounmpo high-stepped up the court in celebration as the Clippers called a timeout.\n\n\r\n                    George said after the game that the Clippers should have picked up the pace on offense down the stretch. Leonard agreed.\n\n\r\n                    “I thought we came down too slow,\" Leonard said. \"As a team, I don't feel like we're there yet. We're looking to the sideline a lot for plays. I feel like our pace has pretty much slowed down. You've got to give them credit, though. They locked in.”\n\n\r\n                    George had 16 points, seven rebounds and seven assists for the Clippers. Serge Ibaka had 15 points and 11 rebounds. Lou Williams added 14 points.\n\n\r\n                     Donte DiVincenzo had 11 and Brook Lopez added 10 for the Bucks. \n\n\r\n                    HOLIDAY'S RETURN\n\n\r\n                    Bucks guard Jrue Holiday returned to action after missing 10 games due to the NBA’s health and safety protocols. Holiday acknowledged after the game that he had tested positive for COVID-19.\n\n\r\n                    “I had symptoms,” Holiday said. “It wasn’t fun, but I’m glad everyone’s OK and that I’m OK now.”\n\n\r\n                    Holiday came off the bench midway through the first quarter and finished with two points and three assists in 18 minutes. \n\n\r\n                    “Conditioning is just a little behind,” Holiday said. “I felt like I was a step slow.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Leonard and George carried Los Angeles in the first half by scoring 30 of the Clippers' 48 points. They got much more help in the second half, particularly from Ibaka and Williams. Ibaka scored 12 points during an 18-4 run that helped the Clippers carry an 81-77 lead into the fourth quarter. But everything fell apart in the last four minutes.\n\n\r\n                    Bucks: Antetokounmpo has scored at least 35 points in four straight games, making him the first Bucks player to accomplish that feat since Kareem Abdul-Jabbar from Jan. 6-14, 1973. ... The Bucks' five-game winning streak follows a five-game skid that marked their longest losing streak since 2017. The Bucks went 5-5 in their 10 games without Holiday.\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: At Boston on Tuesday night.\n\n\r\n                    Bucks: Host Denver on Tuesday night.\n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997392.709715
}