{
  "game_id": "401810180",
  "espn_id": "401810180",
  "date": "Dec 03, 2025",
  "matchup": "IND vs DEN",
  "headline": "Jamal Murray scores season-high 52 points, Nuggets hold off Pacers 135-120",
  "body": "INDIANAPOLIS -- — Jamal Murray scored a season-high 52 points and Nikola Jokic fell just short of another triple-double to help the Denver Nuggets hold off the short-handed Indiana Pacers 135-120 on Wednesday night.\n\n\r\n              Murray was 19 of 25 from the field and even better from 3-point range, 10 of 11, despite being listed as questionable because of a sprained right ankle late in the afternoon. He fell three points short of matching his career high.\n\n\r\n              Jokic had 24 points, eight rebounds and 13 assists playing in front of NBA Commissioner Adam Silver. He came up two rebounds short of starting December with back-to-back triple-doubles but he still holds the league lead with 11 this season.\n\n\r\n              Bruce Brown, Tim Hardaway Jr and Peyton Watson all finished in double figures as the Nuggets won for the third time in five games.\n\n\r\n              Pascal Siakam led the Pacers with 23 points while Andrew Nembhard had 16 points and seven assists on a night six Indiana players scored in double figures. The Pacers have lost their two straight since winning back-to-back games for the first time season.\n\n\r\n              But the discrepancy between the NBA's highest-scoring team and one trying to fight through a rash of early-season injuries was never more obvious. Denver finished with its second-highest point total of the season. \n\n\r\n              The Nuggets seized control with a 13-0 first quarter run that made it 27-17. And after the Pacers managed to cut the deficit to 50-45 midway through the second quarter, Denver closed the half on a 22-3 run, holding Indiana scoreless more than four minutes.\n\n\r\n              While the Nuggets extended the lead to 92-63 midway through the third quarter and looked like they were headed for an easy rout, they instead spent the fourth quarter fighting off the hard-charging Pacers who cut the deficit to 13 multiple times.\n\n\r\n              Up next\r\n              Nuggets: At Atlanta on Friday night.\n\n\r\n              Pacers: At Chicago on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042742.77025
}