{
  "game_id": "0021500085",
  "espn_id": "400827972",
  "date": "Nov 07, 2015",
  "matchup": "CHI vs. MIN",
  "headline": "Wiggins, Timberwolves beat Bulls 102-93 in overtime",
  "body": "CHICAGO -- Andrew Wiggins and the Minnesota Timberwolves clamped down on the Chicago Bulls with the game on the line on Saturday night.\nWiggins scored 31 points, and the Timberwolves shut out the Bulls in overtime in a 102-93 victory.\nKarl-Anthony Towns added 17 points, 13 rebounds and four blocked shots for Minnesota, which had lost two in a row. Fellow rookie Nemanja Bjelica also scored 17.\nThe Timberwolves outscored the Bulls 9-0 in the extra session, marking the first time in franchise history Chicago failed to score in an overtime period.\n\"We just had to fight -- we wanted it,\" Wiggins said. \"We were hungry for this game.\n\n\"When we went to overtime, we stayed aggressive.\"\nTowns' layup made it 98-93 with 2:32 remaining in overtime, and then the No. 1 overall draft pick set up Tayshaun Prince for a layup with 30 seconds to go. Bjelica added two free throws for the final margin.\nPau Gasol had 21 points and 14 rebounds for Chicago, which was coming off a 104-98 victory against Oklahoma City on Thursday night. Tony Snell scored 14 points.\nThe Bulls shot 35.5 percent (33 for 93) from the field and were outrebounded 58-50 by the Timberwolves. Chicago missed all nine of its shots in overtime.\n\"I don't know how we play with as much energy as we did (against Oklahoma City) and then just show up the next (game) just expecting to win the game,\" Bulls coach Fred Hoiberg said. \"It's tough to fathom how that can happen.\"\nBulls guard Derrick Rose agreed.\n\"It's all about effort,\" Rose said.\nWiggins spun away from Taj Gibson for a tying dunk with a minute left in regulation, and then Prince gave Minnesota the lead with a driving layup. But Gasol tipped in a miss by Nikola Mirotic with 21 seconds remaining and Wiggins missed badly on a long jump shot as time expired.\n\"I told the guys whatever you do, don't leave time on the clock because Derrick Rose and those guys are so explosive,\" Minnesota coach Sam Mitchell said. \"They make plays and are used to those situations.\"\nRicky Rubio had seven points, 10 assists and eight rebounds for Minnesota, which shot 40.6 percent (36 for 96).\nWiggins scored 22 points to help the Timberwolves to a 58-57 halftime lead. Wiggins had been struggling so far this season, averaging just 13.8 points on 29 percent shooting coming into the night.\nThe win came at a critical time for Minnesota, especially after losing back-to-back games at home.\n\"This is a great win on the road with a young team,\" Prince said. \"Hopefully, it's a confidence booster as we continue to move forward.\"\nTIP-INS\nTimberwolves: Kevin Garnett played 12 minutes and scored for the first time in three games. ... G Kevin Martin missed the game due to a family issue.\nBulls: Rose's 3-pointer in the third quarter was his first of the season after he missed his first 10 attempts. He finished with 11 points on 3-for-13 shooting. ... It was Gasol's third double-double of the season. ... G Kirk Hinrich (sore toe) missed his fourth straight game.\nUP NEXT\nTimberwolves: Visit Atlanta on Monday.\nBulls: Visit Philadelphia on Monday.\nROAD WARRIORS\nThe Timberwolves improved to 3-0 on the road for the first time since 2001-02.\nQUOTABLE\n\"I don't remember an overtime where a team didn't score,\" Gasol said. \" Give them credit. They played well and they went after it. They wanted it more than we did.\"",
  "source": "espn_api",
  "crawled_at": 1764993979.181438
}