{
  "game_id": "0021600737",
  "espn_id": "400899404",
  "date": "Feb 01, 2017",
  "matchup": "MEM @ DEN",
  "headline": "Gasol scores 24 as Grizzlies beat Nuggets, 119-99",
  "body": "DENVER --  Marc Gasol is a big fan of Denver big man Nikola Jokic. That said, he sure didn't mind taking advantage of his absence Wednesday night.\n\nGasol scored 24 points, Mike Conley had 18 and the Memphis Grizzlies beat the short-handed Nuggets 119-99.\n\nMemphis led for most of the game and won its third in a row, all on the road, and fourth in five games.\n\n\"It feels like we've finally got a good little stride going,\" Conley said. \"I definitely think this is one of the best stretches we've played.\"\n\nEmmanuel Mudiay had 14 points, seven assists and six rebounds in his return to the Nuggets' lineup. Denver came in without Jokic (left hip flexor strain) and Will Barton (left ankle soreness).\n\nJokic averaged 23 points, 11 rebounds and six assists in January before getting hurt. The injury deprived Gasol the chance to play against the 21-year-old Serb.\n\n\"I love Jokic. I love him,\" Gasol said. \"That's one of the reasons I watch Denver is because of Nikola. I love his game.\"\n\nThe Nuggets were trying to overcome his absence when two more players went down. Point guard Jameer Nelson was ejected just 4:07 into the game, leaving the Nuggets with three guards, and leading scorer Danilo Gallinari exited late in the third quarter with a left groin strain.\n\nNuggets coach Michael Malone said Nelson was hit with two quick technicals after he went to the bench with two fouls.\n\n\"J.T. Orr made the decision to give him a tech, Jameer had something to add and he gave him another tech,\" Malone said. \"That's where the referee can walk away, give a warning. J.T. felt it warranted a second tech and that's his prerogative as an official.\"\n\nThat compromised Malone's ability to match up with Memphis.\n\n\"This was one of the harder games I've had to coach all year. We're already thin because of injuries and then Jameer gets thrown out (four) minutes into the game,\" he said. \"So trying to juggle all that and Gallo goes down, it was a very tough game from every facet.\"\n\nThe Grizzlies took advantage of a tired Nuggets team that lost on the road to the Lakers on Tuesday. They led by 16 in the first half and increased it to 19 in the third when Gasol had 10 points.\n\nMemphis stretched the lead to 25 midway through the fourth quarter.\n\nTIP-INS\n\nGrizzlies: The last time Memphis won three in a row was when it reeled off five straight from Dec. 1-10. The last of those was a 21-point win over Golden State. ... G Wade Baldwin IV was assigned to the Iowa Energy of the D League on Tuesday.\n\nNuggets: Malone said Gallinari will get an MRI on Thursday morning. He said it appeared the groin bothered him throughout the first half before giving way in the third quarter. ... Barton had an MRI done on his injured left ankle, but the results weren't announced. He missed 11 games during two different stretches earlier this season with a left ankle injury. ... The Nuggets were held below 100 points for the first time in 12 games.\n\nBRIGHT FUTURE\n\nMemphis coach David Fizdale was around Nuggets forward Mike Miller for three seasons when they were both with the Miami Heat, and even back then he saw the makings of a coach -- or more.\n\n\"Mike is a super-high IQ player and guys always like him,\" Fizdale said. \"Mike can do anything he wanted to in basketball. If Mike wanted to be a GM, he can be a GM; if he wanted to coach, he can coach.\"\n\nMiller has played sparingly in his one-plus season with Denver, but he still is a commanding presence in the locker room. Fizdale said that's because he can relate to anyone.\n\n\"Mike Miller just has a brotherly quality about him,\" Fizdale said. \"He relates to everyone; that's the thing that makes him special. No matter what color you are, what year you are in the league, it doesn't matter. He finds a way to connect with his guys.\"\n\nUP NEXT\n\nGrizzlies: At Oklahoma City on Friday night.\n\nNuggets: Host Milwaukee on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995591.1119292
}