{
  "game_id": "0022301023",
  "espn_id": "401585651",
  "date": "Mar 23, 2024",
  "matchup": "CHI vs. BOS",
  "headline": "Tatum, Hauser, Horford lead way as NBA-leading Celtics beat Bulls 124-113 for 9th straight win",
  "body": "CHICAGO -- — Whether Jayson Tatum is missing a game or Jaylen Brown is sitting out the next night, the Boston Celtics just keep rolling along. Make it nine straight wins now for the team with the NBA's best record. \n\n\r\n              Tatum scored 26 points, Sam Hauser and Al Horford added 23 apiece, and the Celtics made enough plays down the stretch to beat the Chicago Bulls 124-113 on Saturday night.\n\n\r\n              “We're just hungry for more,” Hauser said. “It's not in our character to just, like, mail it in for the rest of the season.”\n\n\r\n              Hauser made 7 of 8 3-pointers, while Horford hit five of Boston's 21 from beyond the arc. Derrick White scored 17. Payton Pritchard added 15 points and eight assists, and Luke Kornet grabbed 13 rebounds.\n\n\r\n              The Celtics pulled within two wins of their season-best streak even though Brown (sprained right ankle) and Kristaps Porzingis (right hamstring) sat out the game.\n\n\r\n              Playing its fifth game in seven nights, Boston scored nine straight to go up by eight early in the fourth quarter and remained in the lead the rest of the way. It was a six-point game when Luke Kornet scored on a tip-in and Tatum — who missed Friday's game at Detroit to rest his ailing right ankle — drove for a layup to make it 117-107 with 3:04 remaining.\n\n\r\n              “Different people, different guys, are ready to step up when their number’s called,” said Horford, who sat out the Pistons game because of a sprained left big toe. “We all understand what we’re trying to do, how we’re trying to play. Guys are just staying ready and taking advantage of the opportunities.”\n\n\r\n              DeMar DeRozan led Chicago with 26 points. Alex Caruso, Nikola Vucevic and Ayo Dosunmu each scored 14 as the Bulls dropped their second in a row. Chicago shot 57% and committed just seven turnovers, but got dominated 23-2 on second-chance points.\n\n\r\n              Chicago's Dalen Terry had the crowd roaring late in the third quarter with a thunderous tip-in dunk off a missed jumper by DeRozan to give the Bulls a one-point lead. They were up 92-91 in the closing minute of the quarter when Pritchard made a finger-roll layup and two free throws to start a nine-point spurt for Boston. Hauser capped it with a 3 in the opening minute of the fourth to make it 100-92.\n\n\r\n              Tatum scored 19 and Sam Hauser added 14 points as hot-shooting Boston grabbed a 66-60 halftime lead.\n\n\r\n              The Celtics made 13 of 27 3-pointers, with Hauser nailing 4 of 5 and Horford hitting three. Tatum buried a step-back jumper and a 3 to make it 66-55 with just over a minute remaining, before Vucevic made a hook shot for Chicago and White connected from beyond the arc to make it a six-point game.\n\n\r\n              The Bulls signed guard/forward Javonte Green to a 10-day contract, bringing him back for a second stint with the team. Green spent parts of three seasons in Chicago after being acquired from Boston as part of a three-team trade involving Washington in March 2021. He played in 10 games this season for Golden State's G League affiliate.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Visit Atlanta on Monday.\n\n\r\n              Bulls: Host Washington on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995864.001904
}