{
  "game_id": "0021800517",
  "espn_id": "401071193",
  "date": "Dec 28, 2018",
  "matchup": "CHA vs. BKN",
  "headline": "Walker, Parker lead Hornets over Nets 100-87",
  "body": "CHARLOTTE, N.C. --  With 8  1/2 minutes remaining, Hornets coach James Borrego subbed out Tony Parker.\n\nThe 18-year veteran gave Borrego a quizzical look as he walked toward the bench, then quickly told the coach he wasn't tired. Borrego wasted no time sending Parker to the scorer's table to check back in.\n\nIt was a good decision.\n\nParker re-entered the game and scored 17 of his 19 points on 8-of-10 shooting over the final 6:41 to help Charlotte hold off Brooklyn 100-87 on Friday and avenge a double-overtime loss to the Nets two nights earlier.\n\n\"He thought I was getting tired,\" Parker said. \"I told him, `I'm not tired. I'm ready to go.' He's always worried about my body and my age and thinking about the big picture, because the most important time of the year is the playoffs. But at the same time I tell him, `J.B., we still have to get into the playoffs first.\"\n\nThe Hornets once again used the small but speedy backcourt of Parker and Kemba Walker to close out a win to pull even at .500 on the season.\n\n\"I think the fourth quarter fuels a number of players,\" Borrego said. \"Not every player, but the special ones are fueled by the fourth. It's winning time, and both (Parker and Walker) are fueled by it.\"\n\nWalker scored 29 points and made seven 3-pointers -- most of them playing off the ball -- and the Nets seemed to have no answer for the combination.\n\n\"Speed kills in this league,\" said Nets coach Kenny Atkinson. \"They got by us, whether it was in the pick-and-roll or just 1-on-1 defense. They got into the heart of defense and really hurt us.\"\n\nThe Hornets (17-17) bounced back from a difficult loss in Brooklyn on Wednesday night, when they surrendered an eight-point lead with 3 minutes remaining in regulation and were beaten when Joe Harris stole a loose ball at midcourt and drove for the go-ahead layup with 3.4 seconds left in the second OT for a 134-132 victory.\n\nCharlotte seemed extra motivated coming out of the gates, jumping out to a 35-17 lead in the first quarter behind 15 points from Jeremy Lamb and 10 from Cody Zeller, who finished with a double-double.\n\n\"Our start to this game was fueled by what happened the other night,\" Borrego said. \"We gave that game away.\"\n\nTIP-INS\n\nNets: DeMarre Carroll had 15 points off the bench. ... Allowed 54 points in the paint.\n\nHornets: The team honored longtime broadcaster Steve Martin at halftime for his 30 years of service. ... Nic Batum and Marvin Williams, two of the most composed Hornets players, both picked up rare technical fouls in the third quarter.\n\nRUSSELL CARRIES NETS\n\nD'Angelo Russell was the only Nets starter to finish in double digits, scoring 33 points on 13-of-24 shooting. The Nets lost for only the second time in the last 11 games.\n\nSpencer Dinwiddie, who had 37 points and 11 assists in the Nets' win over the Hornets on Wednesday night, was held to three points on 1-of-7 shooting. Harris had just four points after scoring 27 in the previous matchup.\n\nThe Nets were just 4 of 27 from beyond the arc after making 19 3s on Wednesday night.\n\n\"They did a better job of being more aggressive and switching out,\" Harris said.\n\nMORE SUBSTITUING\n\nWith the Nets traveling to Milwaukee for the second night of a back-to-back on Saturday, Atkinson said he'll likely need to play his bench more because his starters looked tired.\n\n\"We weren't ready physically or mentally,\" Atkinson said. \"I think physically they dominated us and then we made a bunch of breakdowns, a bunch of breakdowns in our man-to-man defense and we had to resort to zone again just because we couldn't stop them in our man-to-man.\"\n\nWEAK BENCH\n\nThe Hornets won despite an off night from their bench. Aside from Parker, Charlotte's reserves were 3 of 21 from the field.\n\nUP NEXT\n\nNets: Visit Bucks on Saturday.\n\nHornets: Visit Wizards on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994398.814816
}