{
  "game_id": "0022400656",
  "espn_id": "401705222",
  "date": "Jan 27, 2025",
  "matchup": "ATL @ MIN",
  "headline": "Timberwolves fend off depleted Hawks 100-92 despite DeAndre Hunter's career-high 35 points",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 23 points and Julius Randle added 20 to help the Minnesota Timberwolves hold off the short-handed Atlanta Hawks 100-92 on Monday night.\n\n\r\n              DeAndre Hunter had a career-high 35 points and Keaton Wallace added 13 for the Hawks, who played without leading scorer and NBA assist leader Trae Young (hamstring) and starters Dyson Daniels (ankle) and Jalen Johnson (shoulder).\n\n\r\n              Rudy Gobert had 18 points and 10 rebounds for the Wolves, who had nine turnovers and just five field goals in the third quarter as Hunter and the Hawks closed the gap to six. Hunter missed a dunk on Gobert with 44 seconds left that would've cut the deficit to four. \n\n\r\n              Fittingly for this ragged game, a small horn fell from the overhead scoreboard at the end of the first quarter and nearly hit Gobert in the head.\n\n\r\n              Takeaways\r\n              Hawks: With Young, Johnson and Daniels accounting for 42% of Atlanta's scoring, this was a valuable opportunity for Hunter in a heightened role against one of the league's best defenses. Hunter had his 17th game with 20-plus points, the most among all reserves in the league.\n\n\r\n              Timberwolves: Coming off a signature victory in this bumpy season, a 133-104 dominance of Denver on Saturday, the Wolves just had to get through this one without meltdowns or injuries. Key reserve Nickeil Alexander-Walker limped off with a leg injury in the fourth quarter, and they nearly blew a 17-point halftime lead with a lackluster finish.\n\n\r\n              Key moment\r\n              Gobert dunked on Onyeka Okongwu and stared him down before lowering his shoulder into the Hawks center. Both players got technical fouls before the feud escalated further.\n\n\r\n              Key stat\r\n              Young has averaged 30.6 points over 13 career games versus Minnesota, his second-highest mark against an opponent behind Portland (31.7). \n\n\r\n              Up next\r\n              Atlanta hosts Houston on Tuesday. Minnesota visits Phoenix on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997926.613078
}