{
  "game_id": "0022400029",
  "espn_id": "401703398",
  "date": "Nov 22, 2024",
  "matchup": "MIL vs. IND",
  "headline": "Antetokounmpo gets triple-double as surging Bucks beat slumping Pacers 129-117 in NBA Cup play",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 37 points, 11 assists and 10 rebounds for his second triple-double in his last four games, and the Milwaukee Bucks beat the Indiana Pacers 129-117 on Friday night.\n\n\r\n              Antetokounmpo had 22 points, 15 rebounds and 12 assists Saturday in a 115-114 loss at Charlotte.\n\n\r\n              Damian Lillard had 24 points and 12 assists for the Bucks. Gary Trent Jr. scored a season-high 18 points and Bobby Portis added 17.\n\n\r\n              Pascal Siakam scored 25, Bennedict Mathurin 20 and Tyrese Haliburton 18 for the Pacers. Haliburton also had nine assists.\n\n\r\n              The Bucks have won three straight and five of six. The Pacers have lost three straight and five of six.\n\n\r\n              Milwaukee improved to 2-0 in NBA Cup action. Indiana, the tournament runner-up last season, is 0-2. Both are playing in East Group B.\n\n\r\n              Takeaways\r\n              Pacers: Indiana won eight of 11 meetings with the Bucks last season, including a 4-2 victory in a first-round playoff series. Friday's game showed how much things have changed so far this year for the Pacers, who are struggling to recapture the form they showed on their run to the 2024 Eastern Conference finals.\n\n\r\n              Bucks: Milwaukee coach Doc Rivers acknowledged before the game the Bucks would have extra motivation in their first meeting with the team that knocked them out of the playoffs last season. They sure played that way while never trailing all night.\n\n\r\n              Key moment\r\n              After trailing by 20 with less than 10 minutes left, Indiana got the deficit down to 108-102 with 5:52 remaining. Antetokounmpo found Trent for a 3-pointer with 5:33 left. Antetokounmpo then blocked a shot from Mathurin to start a fast break, with Trent laying the ball off the glass to set Antetokounmpo up for a dunk. \n\n\r\n              Key stats\r\n              The Bucks shot 17 of 36 from 3-point range. \n\n\r\n              Up next\r\n              The Pacers host the Washington Wizards on Sunday. The Bucks host Charlotte on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997856.428959
}