{
  "game_id": "0022201207",
  "espn_id": "401469362",
  "date": "Apr 07, 2023",
  "matchup": "ORL @ BKN",
  "headline": "Nets beat Magic 101-84, will be No. 6 seed in East playoffs",
  "body": "NEW YORK -- — The Brooklyn Nets made sure a season that started turbulently will end in the playoffs.\n\n\r\n              Not only that, they did it with a better record and seeding than last season, even after trading Kevin Durant and Kyrie Irving.\n\n\r\n              “This group just endured,” coach Jacque Vaughn said. “I mean, we chose to be courageous over comfort many times and that’s hard to do in this league.” \n\n\r\n              Mikal Bridges scored 22 points and the Nets, shortly after clinching the No. 6 seed in the Eastern Conference, beat the Orlando Magic 101-84 on Friday night.\n\n\r\n              The Nets no longer needed the victory by the time the game was over, having wrapped up a playoff spot when Miami lost at Washington while their game was in the fourth quarter. Brooklyn earned the final guaranteed spot in the East and will face the No. 3 Philadelphia 76ers in the first round.\n\n\r\n              First, those teams meet on Sunday afternoon in Brooklyn for what is now a meaningless regular-season finale.\n\n\r\n              The Nets lost their star power when they dealt Durant and Irving in February. But the players they brought back have recent postseason success, with Bridges and Cam Johnson playing for Phoenix in the 2021 NBA Finals, and Spencer Dinwiddie and Dorian Finney-Smith helping Dallas reach the West finals last year.\n\n\r\n              “Now again, we have to come together, new system, new city, all of the other stuff, so it’s not going to be an easy task by any stretch and they have the probable MVP (Joel Embiid),\" Dinwiddie said of the 76ers. ”So again, like I said, there’s an appropriate respect, give Philly their credit, but at the same time we do feel like we belong in that arena.\"\n\n\r\n              Bridges was 1 for 12 from 3-point range and fellow starting guard Dinwiddie was 0 for 6 on a night both teams were miserable behind the arc. But Johnson scored 18 points, Nic Claxton finished with 14 points and 15 rebounds, while Dinwiddie had 14 assists and seven rebounds. \n\n\r\n              The Nets replaced coach Steve Nash with Vaughn after starting 1-5, traded Durant and Irving within days of each other and got a disappointing, injury-shortened season out of Ben Simmons.\n\n\r\n              Despite all that, Brooklyn fared better than last season. The Nets improved to 45-36 after going 44-38 in 2021-22, when they had to win a play-in game to get the No. 7 seed before being swept by Boston in the first round. \n\n\r\n              Cole Anthony had 14 points, nine rebounds and six assists for the Magic. Goga Bitadze added 12 points and 15 rebounds. \n\n\r\n              After being eliminated from contention for a play-in spot Tuesday with a loss to Cleveland in the opener of a two-game series, the Magic sat all of their starters while losing the second game Thursday. They kept No. 1 pick Paolo Banchero out again Friday but started regulars Franz Wagner and Markelle Fultz.\n\n\r\n              The Nets blew it open in the second quarter, with an 11-0 spurt to open the period pushing a four-point lead to 38-23. It grew to 46-28 when Seth Curry made his second four-point play of the period — giving him eight points on just two field goals — and would reach 24 before the Nets took a 58-39 lead to the break.\n\n\r\n              “When they broke that lead open, it was a lot of turnovers and a lot of fouls,\" coach Jamahl Mosley said. \"So I think the more we can focus on being able to take care of the basketball and defend without fouling, those will continue to be our keys.”\n\n\r\n              It was 78-62 entering the fourth, matching the fewest points the Nets allowed through three quarters this season.\n\n\r\n              Brooklyn was 9 for 42 (21.4%) on 3s and Orlando finished 7 for 38 (18.4%).\n\n\r\n              TIP-INS\n\n\r\n              Magic: Wagner scored 12 points. ... Orlando has lost 15 of its last 19 games in Brooklyn. \n\n\r\n              Nets: Curry scored 13 points. ... The Nets converted the deal for guard David Duke Jr. into a standard NBA contract. Terms were not released. He has appeared in 22 games off the bench for Brooklyn this season . ... The Nets finished 16-2 against the Southeast Division. \n\n\r\n              GOOD FRIDAY\n\n\r\n              The Nets finished 12-2 on Friday, the best record in the NBA on that day.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Miami on Sunday.\n\n\r\n              Nets: Host Philadelphia on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994303.982709
}