{
  "game_id": "0022200329",
  "espn_id": "401468484",
  "date": "Dec 02, 2022",
  "matchup": "TOR @ BKN",
  "headline": "Nets build huge lead, beat Raptors 114-105 for 4th straight",
  "body": "NEW YORK -- — Kyrie Irving scored 27 points and the Brooklyn Nets built a huge lead before beating the Toronto Raptors 114-105 on Friday night.\n\n\r\n              Kevin Durant had 17 points and Nic Claxton chipped in 15 for the Nets, who have won four consecutive games and seven of 10.\n\n\r\n              Brooklyn shot 53.7% and had 27 assists on its 44 baskets. \n\n\r\n              “(We’re) just playing with a lot more confidence, everybody’s accepting their role,” Irving said, adding that Brooklyn “is catching a good rhythm right now. We just want to keep it going.”\n\n\r\n              Pascal Siakam had 24 points and 11 rebounds and O.G. Anunoby added 21 points for the Raptors, losers of two straight games. \n\n\r\n              It was the second consecutive game that Toronto was down by at least 31 points.\n\n\r\n              “We got punched in the mouth,” said Fred VanVleet, who added 10 points. “And waited (until) we were down 30 points to fight back, which was a little too late. That’s just part of being professional and being ahead of punching, being more physical and just being more aggressive and on your toes to start the game.”\n\n\r\n              Brooklyn led by 36 points midway through the second quarter and held a 93-72 advantage at the start of the fourth.\n\n\r\n              The Raptors rattled off 11 straight points to pull within 110-103 after Scottie Barnes’ dunk with 37 seconds left.\n\n\r\n              Durant was then fouled on the next possession and hit a pair of free throws. Anunoby missed a 3-pointer and Seth Curry knocked down a pair of free throws to seal the victory.\n\n\r\n              Brooklyn has won all three games against the Raptors this season.\n\n\r\n              Irving and Joe Harris combined for 31 points to help the Nets take a 72-49 lead at halftime. \n\n\r\n              Brooklyn’s 72 first-half points were a season high as they shot 28 for 48 from the field and 8 for 17 from long distance.\n\n\r\n              “We talked about it before, who was going to hit first, and we hit first,” Nets coach Jacque Vaughn said.\n\n\r\n              Brooklyn raced out to a 41-17 lead in the first quarter. Siakam hit a pair of free throws with 8:01 to play and Irving answered by initiating 15-0 run with a basket before T.J. Warren — playing for the first time in nearly two years — capped it with a pullup jumper to extend the lead 32-10 lead with 3:38 remaining. \n\n\r\n              The Raptors missed seven shots and turned over the ball three times during a stretch of five minutes before Thaddeus Young hit a jumper.\n\n\r\n              TIP-INS\n\n\r\n              Raptors: Toronto has lost three straight games on the road. … Barnes had 15 points and Gary Trent Jr. added 16 off the bench.\n\n\r\n              Nets: Brooklyn’s previous high for points in the first half was 69 against New York on Nov. 9. \n\n\r\n              IT’S BEEN A LONG TIME\n\n\r\n              Warren was back on the court for the first time in two years, coming off the bench in the first quarter with 4:14 left and got his first shot to fall on his first attempt a minute later. \n\n\r\n              The 29-year-old forward had not played in a game since Dec. 29, 2022, while he was with Indiana, due to multiple stress fractures on his left foot.\n\n\r\n              Warren said it took him two to four months to recover following both surgeries, which he said was a “difficult process dealing” with.\n\n\r\n              Warren led the Pacers with 19.8 points per game during the 2019-20 season and enjoyed a breakout performance in the NBA bubble, averaging 31 points, including a 53-point outburst. \n\n\r\n              He hopes his addition to the rotation would be a boost to a team that has struggled during the early on this season and entered play Friday night just one game over .500.\n\n\r\n              “Just effort, my ability to be versatile out there, just be a two-way player, something I took pride in since coming in the NBA, just being able to guard multiple guys and just be able to be that three-level scorer at the same time and just try to feed off guys that just play hard,” Warren said.\n\n\r\n              Warren had 10 points in 17 minutes. \n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host the Charlotte Hornets on Saturday night.\n\n\r\n              Nets: Host the Boston Celtics on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764994087.382914
}