{
  "game_id": "0022401172",
  "espn_id": "401705738",
  "date": "Apr 11, 2025",
  "matchup": "IND vs. ORL",
  "headline": "Trevelin Queen's big night leads Magic past Pacers 129-115 in battle of backups",
  "body": "INDIANAPOLIS -- — Trevelin Queen scored a career-high 25 points and Anthony Black added 21 points, six rebounds and seven assists to help the Orlando Magic pull away from the Indiana Pacers 129-115 in a battle of backups Friday night.\n\n\r\n              Queen made five 3-pointers for the Magic, who won their fifth straight despite benching four starters after locking up a spot in the play-in tournament. Guard Cory Joseph, the other starter, only played 6 minutes, 16 seconds.\n\n\r\n              All five of Indiana's starters also sat out one day after securing home-court advantage in its first playoff series since 2014. Bennedict Mathurin led the Pacers with 20 points and eight rebounds. Johnny Furphy had 17 points and six rebounds as Indiana's six-game winning streak was snapped. \n\n\r\n              The loss locked the Pacers into the No. 4 seed in the Eastern Conference and creates a first-round rematch against the Milwaukee Bucks. Indiana won that series last season.\n\n\r\n              Orlando closed the first quarter tied at 29, but broke away with a 17-4 spurt to open the second and never let the Pacers get close again.\n\n\r\n              Each team had eight players score in double figures.\n\n\r\n              Takeaways\r\n              Magic: Orlando followed a perfect script. Coach Jamahl Mosley gave his starters what they needed — rest — then got the best out of his bench. \n\n\r\n              Pacers: Coach Rick Carlisle played with some unusual rotations and it showed. The Pacers were out of sync offensively and struggled to defensively on an ugly night that certainly wasn't indicative of how well Indiana had been playing.\n\n\r\n              Key moment\r\n              \r\n              Orlando's fast second-quarter start swung the game, but it was a 14-0 run later in the quarter that led to a 68-39 lead and turned this one into a blowout.\n\n\r\n              Key stat\r\n              The Magic shot 63% from the field in the first half and nearly matched that total in the second half, finishing with a season best 57.6%.\n\n\r\n              Up next\r\n              Orlando visits Atlanta and Indiana travels to Cleveland on Sunday, the final day of the regular season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997477.964483
}