{
  "game_id": "0021800859",
  "espn_id": "401071532",
  "date": "Feb 13, 2019",
  "matchup": "MIA @ DAL",
  "headline": "Wade helps Heat top Mavs 112-101 in likely final Dallas game",
  "body": "DALLAS --  Dwyane Wade finished his pregame warmups by re-enacting his launch of the basketball toward the rafters from the moment he won his first championship with Miami on the home floor of the Dallas Mavericks nearly 13 years ago.\n\nThe Heat star closed his night on the bench, with a win secure and many of his fans wearing or holding No. 3 jerseys standing and chanting, \"We want Wade,\" in the closing minutes.\n\nWade had done enough already in what was almost certainly his last game in Dallas, scoring 22 points in one his better games of the season to help the Heat to a 112-101 victory over the Mavericks on Wednesday night.\n\nThe 37-year-old who has already said this is his final season was a little better despite a gallant effort from Dirk Nowitzki, his two-time NBA Finals foe whose record 21st season with the same franchise has the feel of an unofficial farewell tour.\n\nThe 40-year-old German finished two points shy of his season high with 12, although most of the highlights in their first meeting of the season came in the first half before the Heat outscored the Mavericks 32-16 in the third quarter and led by as many as 21 points in the fourth.\n\n\"Talking to Dirk at the end, he was just like, `Man, you look good,\" said Wade, relating their conversation while surrounded by cameras during a jersey swap at midcourt after the game.\n\n\"I said, `You have those days, right?' But those are the scary days, those days that you can mess around and be like, `Well, I can keep playing.' And then it'll be a day that you're like, `No, there's a reason why I'm retiring.\"\n\nNowitzki and Wade, both added to this weekend's All-Star game to recognize their decorated careers, entered the final game before the break together midway through the first quarter , which eased the boos on a Wade farewell tour that has been well-received everywhere else.\n\nThere were some boos as they took the court, but those were quickly drowned out when many in the crowd stood and cheered two players mostly relegated to supporting roles on mediocre teams after so many years of leading championship-chasing franchises.\n\n\"There was a lot of obviously Wade fans in the building, well-deserved,\" Nowitzki said.\n\nThe true reaction of Dallas fans to Wade came later when they booed the 13-time All-Star whenever he touched the ball. The Mavericks have always thought Wade was the beneficiary of questionable calls in the 2006 NBA Finals, which the Heat clinched with a Game 6 win in Dallas.\n\nFans probably still remember the video of Wade and LeBron James faking coughs while leaving the Mavericks' arena after losing Game 4 of the 2011 Finals when Nowitzki, who was sick before the game, hit the winning shot. Dallas took Game 6 in Miami to win the series.\n\nFor those who forgot, there were plenty of Twitter posts before the game noting the irony of Wade missing Miami's shootaround because of an illness in what should be his final Dallas appearance.\n\nWade, who went on to win two more titles with James, was healthy enough to play, and had some vintage moments in the first half. He hit a 3 over Nowitzki before the smooth-shooting 7-footer answered with his familiar one-legged fadeaway over Wade at the other end.\n\n\"There's a great karma to each one of them,\" Heat coach Erik Spoelstra said. \"As soon as Wade got his opportunity to go one-on-one against him in the corner, you just knew that somehow Dirk was going to get him with an opportunity on the other end.\"\n\nSome of the loudest boos for Wade came with him dribbling out the final seconds of the first half isolated on Dallas rookie Jalen Brunson. Wade swished a jumper over the two-time NCAA champion from Villanova to finish the half with a team-high 14 points.\n\nThe Heat took control without Wade in the third quarter, with Josh Richardson scoring six of the first eight points on a 12-0 run that extended a one-point lead and put Miami ahead by double digits for good.\n\nRichardson scored 14 points, and Dion Waiters had 20. Justise Winslow had 11 points and 11 rebounds.\n\nDallas rookie sensation Luka Doncic had 18 points, 12 rebounds and nine assists. The only teenager in NBA history with multiple triple-doubles just missed his fourth. Tim Hardaway Jr. led the Mavericks with 20 points.\n\nABOUT THAT RE-ENACTMENT\n\nWade and Nowitzki ended up next to each other at the scorer's table waiting to enter the game for the first time. They shared a laugh. Turns out Nowitzki was giving Wade a hard time about recreating his 2006 ball toss.\n\n\"We just had a little laugh about it,\" Wade said. \"It's moments when you go through this, for me this is the last dance and there are certain games, there's certain ones that are a little bit more special.\"\n\nNowitzki smiled when asked about the exchange after the game. \"I was like, `That's bringing some bad memories back.' He had to laugh. He's like, `Yeah, I had to do it man. This is the building where everything started for me.\"\n\nTIP-INS\n\nHeat: Finished with seven players in double figures. The others were James Johnson with 12 points and Kelly Olynyk and Bam Adebayo with 10 apiece. ... Richardson and Winslow had six assists each.\n\nMavericks: C Salah Mejri returned after missing three games and made his second start of the season. The 7-foot-2 Tunisian was re-signed after getting waived as part of the trade that sent Harrison Barnes to Sacramento. Brunson started the second half instead of Mejri, who had two points and one rebound in eight minutes.\n\nUP NEXT\n\nBoth teams are headed into All-Star break. The Heat return to finish the second of two season-long six-game road trips at Philadelphia on Feb. 21. The Mavericks are home against Denver on Feb. 22.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995231.486625
}