{
  "game_id": "0022400111",
  "espn_id": "401704677",
  "date": "Oct 28, 2024",
  "matchup": "LAL @ PHX",
  "headline": "Booker scores 33, Durant adds 30 as the Suns rally for 109-105 win and hand Lakers first loss",
  "body": "PHOENIX -- — Devin Booker scored 33 points, Kevin Durant added 30 and the Phoenix Suns rallied to beat the Los Angeles Lakers 109-105 on Monday night.\n\n\r\n              The Lakers took an 83-76 advantage into the fourth, but couldn't hold on, suffering their first loss of the season after winning three in a row. Durant made back-to-back jumpers to give the Suns a 105-101 lead with 2:17 left.\n\n\r\n              LeBron James responded with a 3-pointer with 1:58 left to cut the margin to 105-104, but the Lakers never regained the lead. James finished with 11 points, narrowly extending his NBA-record streak of at least 10 points in a game to 1,226.\n\n\r\n              The Suns bounced back from an early 18-point deficit to get the win. The Lakers beat the Suns 123-116 on Friday at home after climbing out of an early 22-point hole.\n\n\r\n              Austin Reaves hit a 3-pointer with 5:16 left in the first quarter to give the Lakers a 26-8 lead, but the Suns rallied to take a 50-48 lead by halftime. L.A.'s Anthony Davis scored 20 points before the break on 9-of-14 shooting. He finished with 29.\n\n\r\n              Takeaways\r\n              Lakers: The most impressive part of L.A.'s early burst was that James didn't even take a shot as the team built an 18-point lead. Davis continues to excel as the team's primary offensive option, shooting 12 for 24 and adding 15 rebounds. James had a tough night, shooting just 3 of 14 from the field.\n\n\r\n              Suns: It was a rough game for starting center Jusuf Nurkic, who scored just two points in 15 minutes. He was coming off his best game of the season — an 18-point, 14-rebound effort in Saturday's win over the Mavericks.\n\n\r\n              Key moment \r\n              Phoenix's Royce O'Neale hit a crucial 15-foot floater to give the Suns a 107-104 lead with 1:25 left.\n\n\r\n              Key stat \r\n              There were six ties and 14 lead changes.\n\n\r\n              Up next \r\n              Lakers visit Cleveland on Wednesday, and Suns visit the Los Angeles Clippers on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997218.4279711
}