{
  "game_id": "401809785",
  "espn_id": "401809785",
  "date": "Nov 14, 2025",
  "matchup": "MIL vs CHA",
  "headline": "Antetokounmpo returns to help Bucks outlast Knueppel and Hornets, 147-134 in overtime",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 25 points, 18 assists and seven rebounds in his return and the Bucks outlasted former Milwaukee high school star Kon Knueppel and the Charlotte Hornets 147-134 in overtime Friday night in an NBA Cup game.\n\n\r\n              The teams split a home-and-home set, with both also playing the front end of a back-to-back. On Wednesday night in Charlotte, with Antetokounmpo sidelined because of patellar tendinopathy in his left knee, the Hornets beat the Bucks 111-100.\n\n\r\n              Knueppel scored a season-high 32 points in his first NBA game in his hometown. Drafted fourth overall, he spent last season at Duke after leading undefeated Wisconsin Lutheran High School to the 2024 Wisconsin Division 2 title.\n\n\r\n              Knueppel hit two late tying 3-pointers in regulation, the first pulling the Hornets even at 125 with 1:34 to go and the second squaring it at 129 with 21 seconds left. The latter came after Knueppel grabbed the rebound after Miles Bridges missed a dunk. Antetokounmpo — who also had seven turnovers — shot an air-ball at the buzzer for Milwaukee, sending it to overtime.\n\n\r\n              Kyle Kuzma led Milwaukee with 29 points and 10 rebounds. Ryan Rollins added 20 points.\n\n\r\n              Bridges also had 32 points for Charlotte. LaMelo Ball had 16 points and 10 assists, and Moussa Diabate added 15 points and 11 rebounds.\n\n\r\n              Pat Connaughton also had a homecoming, but failed to score in 10 minutes in his first game in Milwaukee since being traded to the Hornets in the offseason.\n\n\r\n              Milwaukee improved to 8-5 overall and 2-0 in NBA Cup play. Charlotte is 4-8 overall and 0-2 in the in-season tournament.\n\n\r\n              Up next\r\n              Hornets: Host Oklahoma City on Saturday night.\n\n\r\n              Bucks: Host the Los Angeles Lakers on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042624.5337012
}