{
  "game_id": "0022100871",
  "espn_id": "401360690",
  "date": "Feb 15, 2022",
  "matchup": "CHA @ MIN",
  "headline": "Towns scores 39, Wolves beat Hornets 126-120 in overtime",
  "body": "MINNEAPOLIS -- — Karl-Anthony Towns had 39 points and 15 rebounds, D’Angelo Russell added 18 points and 11 assists, and the Minnesota Timberwolves came back to beat the Charlotte Hornets 126-120 in overtime on Tuesday night.\n\n\r\n              Minnesota came back from a 13-point deficit in the fourth, but Miles Bridges tied the game for Charlotte with a 3-pointer and free throw in the final minute. Russell’s last-second 3 was off the mark, forcing overtime.\n\n\r\n              “You call yourself a superstar, you got to act like a superstar,” said Towns, who scored seven points to lead the way in overtime. “The game wasn’t going my way. I didn’t have it, but I better find it if we were going to win this game.”\n\n\r\n              Bridges had 28 points and 13 rebounds for the Hornets, who have lost eight of nine. LaMelo Ball scored 22 before fouling out in overtime, Terry Rozier added 25 points and Mason Plumlee finished with 14 points and 17 rebounds.\n\n\r\n              “There’s definitely mental growth that we have to build on,” Charlotte coach James Borrego said. “That’s OK. We’re a young team. We’re growing. We’re going to have highs and lows. We just have to stay with it. … But I saw a lot of mental growth out there tonight, too.”\n\n\r\n              Minnesota was without their energetic young swingman, Anthony Edwards, for the second half and overtime. He limped off the court with a right ankle sprain in the final seconds of first half and didn't return.\n\n\r\n              Jarred Vanderbilt had 10 points and 14 rebounds for Minnesota, who used a 15-4 run in the final minutes to take the lead.\n\n\r\n              “It’s a great win, great win,” Wolves coach Chris Finch said. “One of the best wins of the year. … We figured at halftime it was going to be about finding five guys. As soon as we found them, we made our run. Guys stepped up big as big players do and brought us home.” \n\n\r\n              Russell had called out the Timberwolves’ fans for being quiet after the team beat Detroit just before a four-game trip. Russell took to Twitter to ask fans to stand up Tuesday until the Wolves scored. \n\n\r\n              “I called, they answered,” Russell said of fans, who stood until he hit a corner 3-pointer.\n\n\r\n              Charlotte had scored the first five points of the game, but Russell keyed a 19-2 run. \n\n\r\n              When the Wolves went to the bench, the Hornets took advantage. The momentum continued late in the half as Charlotte used a 23-8 run to take control at half.\n\n\r\n              Minnesota’s fans had no trouble staying engaged as the team made the comeback. The Timberwolves scored 30 points in the fourth, including 12 by Towns. They outrebounded the Hornets 19-8 in the quarter, including nine offensive boards.\n\n\r\n              “We had an opportunity to close out this game,” Borrego said. “The piece we’ll look back on is the offensive rebounds. They shot 39% from the field. Most nights, we win that game.”\n\n\r\n              FAN BALL\n\n\r\n              Russell brought a ball to his postgame news conference, saying it was a game ball for all of the fans.\n\n\r\n              “That was electric,” Russell said. “This is for all the fans that came out, all the fans that was in their living room, all the fans on Twitter, everything. We appreciate you all. We need that every game. You see what happens when you all are here. We got the win. Appreciate you all. That was nice.”\n\n\r\n              TIP-INS\n\n\r\n              Hornets: Gordon Hayward missed his fourth straight game with a left ankle sprain. Cody Martin was out for the fifth straight game with left ankle/Achilles soreness. … Borrego made a switch to the starting lineup, giving PJ Washington the start and having Kelly Oubre Jr. come off the bench. … Plumlee just missed his third career triple-double with nine assists. … Charlotte fell to 0-5 in overtime games this season.\n\n\r\n              Timberwolves: Jaden McDaniels started the second half for Edwards. McDaniels finished with 16 points and tied a career-high with four steals. … Minnesota was 13 of 55 (23.6%) from 3 and 27 of 43 (62.8%) from the free-throw line. … Finch didn’t have an update on Edwards after the game.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Home against Miami on Thursday.\n\n\r\n              Timberwolves: Host Toronto on Wednesday for the second game of a back-to-back.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992871.903834
}