{
  "game_id": "0021401035",
  "espn_id": "400579327",
  "date": "Mar 21, 2015",
  "matchup": "POR @ MEM",
  "headline": "Green scores 23, Conley 21 as Grizzlies beat Blazers 97-86",
  "body": "MEMPHIS, Tenn. --  The Portland Trail Blazers lost their season-worst fourth straight and may have lost leading scorer LaMarcus Aldridge for an extended period.\n\nMeanwhile, the Memphis Grizzlies seem to be morphing into playoff mode as the regular season hits the stretch run.\n\nJeff Green had 23 points and Mike Conley scored 21 with nine assists to lead Memphis to a 97-86 victory over the struggling Trail Blazers on Saturday night.\n\nThe loss dropped Portland four games behind Memphis for the Western Conference's second seed and left the Trail Blazers wondering about the latest injury to Aldridge.\n\nThe All-Star forward injured his left hand in the first half and left the arena with his swollen hand wrapped. The injury was to the same hand but not isolated to the left thumb he injured in January.\n\nIn addition to Aldridge, who had 16 points in the first half, starter Nicolas Batum also didn't play in the second half because of a sore back.\n\n\"We've got our backs up against the wall right now,\" said guard Damian Lillard, who led the Trail Blazers with 27 points and seven assists. \"Lose four tough games and now we've got two guys go down.\"\n\nGreen returned to the Memphis starting lineup after a change against Dallas on Friday night had him coming off the bench. Green regained starting status when Courtney Lee sat out with an injured right hand.\n\n\"Same confidence, same approach, just shots are starting to fall,\" Green said. \"Just continuing to be aggressive and play off of (Marc Gasol and Zach Randolph).\"\n\nRandolph added 17 points for Memphis, which won its second straight. Gasol had 13 points, and Tony Allen finished with 10 points and 11 rebounds.\n\nC.J. McCollum had 13 points, and Dorell Wright scored 10 for Portland.\n\nThe Blazers were creeping up the Western Conference standings a week ago. But the losing skid has them sliding back to the middle of the playoff standings.\n\n\"It was a tough game to begin with and after (the injuries) it became a little more tough,\" Lillard said. \"But I think we're still a good team. We've just got to keep playing and keep believing and we'll be fine.\"\n\nMemphis shot 42 percent to 43 percent for Portland. Memphis, however, connected on 11 of 18 from outside the arc. The 11 3-pointers matched Memphis' season high.\n\n\"The 3-point line was the difference,\" Portland coach Terry Stotts said. \"They made a good amount of 3s for them. I like the way we competed. It was a tough game, and we knew it was going to be a tough game on the road.\"\n\nMemphis carried a 53-44 lead into halftime and extended the advantage to double digits through much of the third quarter.\n\nPortland managed to cut into the lead in the fourth, but never got closer than seven as Randolph scored 11 points in the final period.\n\nMemphis looked disjointed after the All-Star break, but the Grizzlies have found their stride the past two games.\n\n\"We are playing different together,\" Gasol said. \"Everybody is engaged. Everybody is talking. Everybody is much more aggressive defensively.\"\n\n---\n\nTIP-INS\n\nTrail Blazers: Portland has lost nine of its last 10 to Memphis. ... Portland C Chris Kaman sat out with a right shoulder strain sustained in Friday night's loss at Orlando. ... Portland wrapped up a five-game road trip.\n\nGrizzlies: Memphis scored 35 points in the first quarter, its most in an opening period this season. ... Memphis won all four games against Portland this season, the first season sweep of the Trail Blazers in franchise history.\n\nINJURIES ABOUND\n\nWith Kaman not playing, Aldridge and Batum missing the second half and Wesley Matthews out for the season with an Achilles injury, Portland is dealing with significant injuries to key players. \"When it rains, it pours,\" Aldridge said. \"I have been here nine years, and I've seen things like this happen all throughout my time in Portland.\"\n\nUP NEXT\n\nTrail Blazers: Host the Warriors on Tuesday.\n\nGrizzlies: Visit the Knicks on Monday.",
  "source": "espn_api",
  "crawled_at": 1764992040.6638021
}