{
  "game_id": "0021801047",
  "espn_id": "401071720",
  "date": "Mar 17, 2019",
  "matchup": "SAC vs. CHI",
  "headline": "Bagley just misses double-double as Kings top Bulls 129-102",
  "body": "SACRAMENTO, Calif. --  The Sacramento Kings are a long shot to end the NBA's longest active playoff drought, so Dave Joerger's team is taking solace in the little things.\n\nGetting their 34th win of the season -- the most by the Kings in more than a decade -- certainly stands out. The development of rookies Marvin Bagley III and Harry Giles is near the top of the list as well.\n\nBagley had 21 points and nine rebounds, Giles added 16 points and the Kings beat the Chicago Bulls 129-102 on Sunday.\n\n\"Both of them are accentuating the positives and reducing the mistakes,\" Joerger said. They've been a little bit more aggressive, they've been a little less aggressive to thread the needle on passes so there's less turnovers. Maybe they have a shot and maybe they're playing to the second side, and just growing up into pro basketball players and taking what the defense gives them.\"\n\nBagley, the second overall pick in the draft, managed to upstage his teammate with yet another strong game. Bagley scored 14 points in the second half to help the Kings pull away, made a handful of big plays including a coast-to-coast layup after blocking a shot by Robin Lopez, and finished one rebound shy of his 14th double-double this season.\n\n\"I wanted to dunk it, but I tripped,\" Bagley said of his layup following the block.\n\nGiles complemented Bagley on the interior, and took a pass from his rookie teammate and dunked to put Sacramento up 88-61 in the third quarter. Giles also tied his career high with three blocks.\n\n\"I'm starting to come into myself, taking my time, patience,\" Giles said. \"It's all starting to come along for me. It's taken some time but it's right where I want to be.\"\n\nThe Kings needed it as they continue to maintain slim hopes of ending the NBA's longest active playoff drought. Sacramento, 4-8 since the All-Star break, began the day six games behind the Clippers for the eighth spot in the crowded Western Conference.\n\n\"Whether we talk about it or not, it feels like every game is a must-win coming out of the break,\" Joerger said. \"Just to have a little bit of mental relief is good for us at this point in the season.\"\n\nBuddy Hield added 16 points and inched closer to the Kings' single-season record for 3-pointers, Harrison Barnes scored 15 points and De'Aaron Fox had 17 to help Sacramento complete a second straight season sweep of Chicago.\n\nZach LaVine had 18 points for the struggling Bulls (19-52). Chicago has lost five straight.\n\n\"Their speed and athleticism, physicality and toughness overpowered us,\" Bulls coach Jim Boylen said. \"We lost the boards and we lost the turnover game, which you can't do on the road. Our starters need to play better. They know it and they have to play better.\"\n\nHield made two 3s and has 231 this season. He needs 10 more to break Peja Stojakovic's single-season Kings record set in 2003-04. Stojakovic is currently Sacramento's assistant general manager.\n\nThe Kings trailed early but got a buzzer-beating 3-pointer from Bogdan Bogdanovic to end the first quarter, then opened the second with a 20-4 run.\n\nHield had 10 points during the surge, Bagley split a pair of defenders on a three-point play, and Harrison Barnes added a breakaway dunk to put Sacramento ahead 44-27.\n\nThings got chippy when Lopez and Giles picked up offsetting technical fouls with 1 second left in the first half.\n\nPAYING HIS OWN FINE\n\nLaVine had offered to pay Boylen's fine after the Bulls coach was ejected from Friday's game against the Clippers but a thankful Boylen declined the gesture. \"That shows what kind of kid he is and what kind of leader he's becoming,\" Boylen said. \"It was really cool to me personally. Real emotional to me. With that being said, he will not pay my fine. I appreciate it, but I'll pay my own fine.\"\n\nTIP-INS\n\nBulls: Lauri Markkanen had 11 points and has scored in double figures for the 29th consecutive game, the longest streak by a Chicago player in eight years. ... The Bulls had four offensive rebounds and two second-chance points in the first half.\n\nKings: The 40 points scored in the first half by Chicago matched the fewest allowed by Sacramento this season. Phoenix was limited to 40 by the Kings on Dec. 4. ... The Kings have led by 30 points or more in three games this season.\n\nUP NEXT\n\nBulls: Play at Phoenix on Monday.\n\nKings: Host Brooklyn on Tuesday.\n\n--\n\nMore AP NBA:https://apnews.com/NBA andhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994171.046635
}