{
  "game_id": "0021900277",
  "espn_id": "401160919",
  "date": "Nov 29, 2019",
  "matchup": "PHX vs. DAL",
  "headline": "Luka Doncic bounces back from rough outing as Mavericks beat Suns",
  "body": "PHOENIX -- Luka Doncic was in total control, getting into the lane when he wanted, getting the shots he wanted and getting the ball to teammates in places where they could do some damage.\nBecause of that, the Dallas Mavericks got the result they wanted with an 120-113 victory over the Phoenix Suns on Friday night.\nDoncic tied a career high with 42 points, Tim Hardaway Jr. added 26 and the Mavericks bounced back from a disappointing loss to the LA Clippers three days earlier.\n\"Great players have a short memory for tough games,\" Dallas coach Rick Carlisle said about Doncic's big night. \"They move forward. They're always thinking ahead and about the next challenge. He was spectacular tonight from start to finish.\"\nThe second-year guard just missed a triple-double with 11 assists and nine rebounds. Hardaway shot 6-of-9 from 3-point range to help offset a quiet night from Kristaps Porzingis, who finished with two points.\nThe teams entered the final quarter tied at 89. The Mavericks went on an 8-0 run midway through the fourth to take a 104-97 lead and never trailed again.\nDoncic was coming off a subpar outing Tuesday night in a loss to the Clippers, where he shot 4-of-14 from the field and missed all eight 3-point attempts. The 20-year-old was superb in Phoenix, making 12 of 24 shots from the field and 15 of 18 free throws.\nHe said he didn't get too low after the Clippers loss and was no more motivated than normal Friday, even if his performance suggested he had a little extra fire.\n\"It's just one game -- we lost one game,\" Doncic said. \"We shouldn't be worried about that. You go to the next game and pretend like nothing happened. I'm anxious to go out there every night. I'm excited about every game. That's me.\"\nPhoenix has lost six of its past seven games. Kelly Oubre Jr. led the Suns with 22 points and 10 rebounds, and Ricky Rubio added 21 points and nine assists.\n\"We didn't play our game the last quarter,\" Rubio said. \"I think we got focused on the wrong things, things we can't control.\"\nDoncic had 14 points, six rebounds and six assists in the first quarter as the Mavericks edged to a 53-50 halftime lead. Oubre had 13 for the Suns.\nEMOTIONAL SUNS\nFriday's game was entertaining and a little emotional, with a handful of moments where Suns and Mavericks players had to be separated.\nPhoenix coach Monty Williams said his team struggled with composure.\n\"Both teams were pretty emotional tonight,\" Williams said. \"But I just felt like it affected us more.\"\nHARDAWAY'S BIG NIGHT\nCarlisle recently moved Hardaway into the starting lineup and the 6-foot-5 guard has responded with a string of big games. Over the past two weeks, he's had 16 points against Cleveland, 31 against Houston and now 26 against the Suns.\n\"It's seizing the opportunity and being prepared,\" Hardaway said.\nA FREE THROW ADVENTURE\nSuns forward Frank Kaminsky inadvertently contributed to a rally with two of the worst free throws of his professional career.\nKaminsky -- a respectable 76% career free throw shooter -- had a stunning air ball on his first of two free throws during the third quarter. He overcompensated on the second, pounding it off the backboard and rim before getting his own offensive rebound.\nThe extra possession led to a huge dunk by Devin Booker to put the Suns up 69-63.\nTIP-INS\nMavericks: Porzingis and Phoenix's Aron Baynes both received technical fouls in the second quarter when they got into an argument coming off the court during a timeout. ... Doncic averaged a 30-point triple-double in November, becoming just the third NBA player to accomplish that feat in a calendar month, joining Oscar Robertson (five times) and Russell Westbrook (twice). ... The Mavericks improved to 12-6 for their best start since the 2010-11 season, when they won an NBA title. ... Porzingis missed all eight shots he took from the field, including six 3-pointers.\nSuns: Baynes returned to the lineup after a five-game absence because of a right hip flexor sprain. He finished with 17 points and seven rebounds in 25 minutes. ... Phoenix fell to 8-10.\nUP NEXT\nMavericks: At Los Angeles Lakers on Sunday.\nSuns: At Charlotte on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764996582.590324
}