{
  "game_id": "0022301003",
  "espn_id": "401585631",
  "date": "Mar 20, 2024",
  "matchup": "LAC @ POR",
  "headline": "George and Harden lead Clippers past Trail Blazers 116-103",
  "body": "PORTLAND, Ore. -- — Paul George scored 27 points, James Harden had 19 points and 14 assists and the Los Angeles Clippers beat the Portland Trail Blazers 116-103 on Wednesday night.\n\n\r\n              The victory gave the Clippers a one-game lead over the New Orleans Pelicans for the fourth seed in the Western Conference playoff picture.\n\n\r\n              Scoot Henderson had 18 points and five assists for Portland and fellow rookie Kris Murray had a season-high 17 points.\n\n\r\n              The teams meet again Friday night in Portland to complete a two-game set.\n\n\r\n              The Clippers used a 34-point third quarter, which included 17 of Kawhi Leonard’s 24 points, to put the game out of reach.\n\n\r\n              After leading 60-50 at halftime, the Clippers took things into overdrive. Portland cut the Clippers’ lead to eight multiple times early in the third quarter before Los Angeles pushed the lead to 72-58, forcing a Blazers timeout.\n\n\r\n              Portland turned the ball over after the timeout on back-to-back possessions, including a 3-point play from Leonard, pushing the lead to 77-58.\n\n\r\n              “We got really good individuals on the defensive side and we put it together tonight,” George said. “We played good defense, we got stops, we got out and got some easy opportunities. \n\n\r\n              \"Honestly, that’s when we are clicking and at our best — when we don’t have to come against a loaded defense every possession.” \n\n\r\n              The Blazers committed seven turnovers in the third quarter leading to 13 Clippers points. \n\n\r\n              “It was a lot of turnovers that led to points. That was the biggest thing. That was kind of all it is,” Murray said of Portland’s third-quarter struggles. \n\n\r\n              Amir Coffey’s 3-pointer pushed the lead to 84-60, forcing another timeout by Portland.\n\n\r\n              “We had a mindset of let’s get another run,” Clippers coach Tyronn Lue said of the Clippers' ability to extend leads. “Even though they called a timeout to stop the run, let’s be professional. I give our guys credit — tonight, they did that.” \n\n\r\n              The Clippers, whose largest lead was 27, outscored the Trail Blazers 34-20 in the third quarter. \n\n\r\n              Los Angeles jumped out to a 47-35 lead midway through the second quarter. Harden hit back-to-back 3-pointers to force a Blazers timeout with 6:04 left in the half. \n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996541.280662
}