{
  "game_id": "0021800309",
  "espn_id": "401070990",
  "date": "Nov 28, 2018",
  "matchup": "HOU vs. DAL",
  "headline": "Doncic helps Mavs rout Rockets 128-108",
  "body": "HOUSTON --  The Dallas Mavericks had struggled on the road this season. They had come up empty against the Houston Rockets for the last couple years.\n\nSo this one was pretty big.\n\nRookie Luka Doncic and Devin Harris each scored 20 points, and Dallas beat Houston 128-108 on Wednesday night despite a triple-double by Rockets star James Harden.\n\nIt's the third straight win for the Mavericks and just their second victory on the road this season after dropping seven of their first eight games away from home. They had dropped their last eight regular-season games against the Rockets.\n\n\"We're just improving,\" Harris said. \"Obviously we've got a long way to go. Defensively I think we're playing better, offensively I think there's still room for improvement. We're trending in the up direction. We got off to a slow start but now we're starting to play catch up.\"\n\nHarden had 25 points, 17 assists and 11 rebounds, but it wasn't nearly enough for a team missing Chris Paul because of an injury. Houston dropped its fourth in a row after winning a season-high five straight.\n\n\"Obviously nobody's happy and everyone is searching for answers and talking to ourselves and running into walls and everything else,\" Houston coach Mike D'Antoni said. \"We did see a glimpse of when we could be really good and we've got to get back to there.\"\n\nHarden knows the Rockets have to get better, but pointed out it's still early in the season.\n\n\"We went through a tough stretch and then we regrouped and won five in a row,\" he said. \"So we've just got to figure it out. We've got a lot of new guys and it's only 20 games into the season so we've got 60 more to go.\"\n\nThe 19-year-old Doncic, who was the third overall pick in the draft, has scored 20 or more points in 10 of 18 games this season. He is encouraged with the Mavs' improvement since starting the season 3-8.\n\n\"We just needed time,\" he said. \"From the beginning I said I wanted to go to the playoffs and we're doing a great job.\"\n\nHouston trailed for most of the night but used a 33-point third quarter to trim a huge deficit to seven heading into the fourth. The Mavericks got going again in the final period, opening with a 10-2 run highlighted by back-to-back reverse layups by J.J. Barea.\n\nClint Capela made a layup for Houston before the Mavericks used an 11-2 spurt to push their lead to 117-95 with seven minutes remaining, prompting D'Antoni to clear the bench.\n\nPaul sat out for the third straight game after resting the first game and missing the last two with a sore left hamstring. Capela and James Ennis had 18 points apiece for the Rockets, who are in 13th place in the Western Conference.\n\nThe Mavericks led by 18 entering the third quarter after scoring 74 points in the first half behind 15 points from Doncic. The Rockets opened the second half with a 13-5 run to cut the lead to 79-69 with about eight minutes left in the third. Ennis led the way, scoring nine points.\n\nDallas pushed its lead back out to 13 before Danuel House and Harden made back-to-back 3-pointers to get Houston within seven at 86-79. The Mavericks' advantage was down to five when a layup by Dwight Powell made it 96-89 entering the fourth.\n\nHARDEN'S NIGHT\n\nIt was Harden's first triple-double this season and No. 36 for his career. The reigning NBA MVP also had six steals to join Magic Johnson as the only players in NBA history with at least 25 points, 17 assists, 11 rebounds and six steals in a single game since steals became an official statistic in 1973-74, according to the Elias Sports Bureau. Johnson did it on March 29, 1981.\n\nTIP-INS\n\nMavericks: Dennis Smith had 10 points in his return after missing Saturday's game with a sprained right wrist. ... DeAndre Jordan had 13 points and seven rebounds. ... The Mavericks made 19 of 24 free throws.\n\nRockets: Capela has scored at least 10 points in 19 straight games. ... D'Antoni said Nene, who hasn't played all season because of a strained right calf, was making progress but he still doesn't know when he'll be ready to return. ... Gerald Green missed his second game in a row with a sore right ankle.\n\nUP NEXT\n\nMavericks: Visit Lakers on Friday night.\n\nRockets: Visit San Antonio on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995313.6152508
}