{
  "game_id": "0021900907",
  "espn_id": "401161549",
  "date": "Mar 02, 2020",
  "matchup": "CHI vs. DAL",
  "headline": "White scores 19, Bulls beat Mavericks 109-107",
  "body": "CHICAGO --  Coby White scored 19 points, Otto Porter Jr. added 18 in his return from a broken left foot and the Chicago Bulls hung on to beat the Dallas Mavericks 109-107 Monday night when Luka Doncic's desperation heave bounced off the rim.\n\nDenzel Valentine added a season-high 17 points and the Bulls won for just the second time in 12 games even though leading scorer Zach LaVine sat out with a strained left quadriceps.\n\n\"We have been there a lot with winning teams,\" Valentine said. \"We've been right there. It actually feels good to come out here and beat a team like that.\"\n\nThe Bulls thought they were ready to make a jump in the Eastern Conference and contend for a playoff spot after winning only a combined 49 games the previous two seasons. They've been hit hard by injuries and haven't performed the way they envisioned. But they're still in the running for a postseason berth, though their odds aren't great.\n\n\"We're not thinking about that,\" Porter said. \"We're just trying to get guys back and (pick up) the Ws right now. When it gets down to we're gonna need a couple games, then we'll get into a playoff mode where everything is very detailed.\"\n\nHANGING ON\n\nThe Bulls outscored Dallas 33-17 in the third quarter to turn a 10-point halftime deficit into an 81-75 lead, and withstood a big push in the final minute.\n\nThe Mavericks were trailing 107-99 when Maxi Kleber dunked with 18 seconds left. Delon Wright then got a steal and fed Dorian Finney-Smith for a 3-pointer that made it a three-point game.\n\nChicago's Thaddeus Young missed the first free throw before hitting the second with 13 seconds remaining.\n\nFinney-Smith hit another 3 to make it 108-107 with three seconds left before Chicago's Wendell Carter Jr. made the second free throw after missing the first. Finney-Smith then threw a long inbound to Doncic, who barely missed from in front of the scorer's table and was annoyed he didn't make it.\n\n\"I'm supposed to make that shot,\" said Doncic, who practices desperation heaves. \"I wanted to make that shot, but I just missed it.\"\n\nPorter played 17 minutes and made three 3s in his first appearance since Nov. 6. Valentine surpassed his previous season high of 16 points, and White continued his strong run. The rookie is averaging more than 28 points over his past five games.\n\nTim Hardaway Jr. led Dallas with 26 points. Doncic scored 23 after sitting out Sunday's win at Minnesota because of a sprained left thumb. Finney-Smith added 18 points. But with Kristaps Porzingis and Seth Curry (lower back tightness) sitting out after dominating the previous day, the Mavericks lost for the second time in three games.\n\n\"The third quarter was obviously our downfall,\" coach Rick Carlisle said. \"They came out of the locker room with great intensity, and we didn't respond. We did a few things to make runs at them. I loved the way we finished the game in terms of being scrappy, and finding ways to make things happen with steals and putting points on the board. Luka's shot, I was standing right behind it, it was right on the line.\"\n\nQUOTABLE\n\n\"It's going to take some time to feel better. It's getting better.\" -- Doncic on his thumb.\n\nTIP-INS\n\nMavericks: Dallas' 17 points in the third quarter were a season low. ... C Willie Cauley-Stein was available after missing six games for personal reasons. ... G Jalen Brunson (right shoulder sprain) missed his straight fifth game.\n\nBulls: Porter's 18 points were his most ever when playing 20 minutes or less. He scored 15 in 18 minutes for Washington against Houston on March 29, 2015. ... LaVine is day to day. ... F Lauri Markkanen practiced Monday with the Windy City Bulls and is close to returning from a right hip injury that has sidelined him since Jan. 22, coach Jim Boylen said. The 7-footer from Finland is averaging 15 points and 6.5 rebounds.\n\nUP NEXT\n\nMavericks: Host New Orleans on Wednesday.\n\nBulls: Visit Minnesota on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996346.1640582
}