{
  "game_id": "0021500022",
  "espn_id": "400827909",
  "date": "Oct 30, 2015",
  "matchup": "OKC @ ORL",
  "headline": "Russell Westbrook, Kevin Durant fuel rally as Thunder tame Magic in 2 OTs",
  "body": "ORLANDO, Fla. -- Russell Westbrook and Kevin Durant have delivered plenty of highlights during their NBA careers.\nTheir latest stole and then saved a game the Orlando Magic seemed poised to win.\nWestbrook banked in a 3-pointer from just inside midcourt at the end of regulation on his way to 48 points, Durant scored 43 and the Oklahoma City Thunder rallied to beat the Magic 139-136 in double overtime on Friday night.\nWestbrook also added 11 rebounds and eight assists. Durant finished with 12 rebounds.\n\nOrlando had a chance to tie it with six seconds to play but twice had 3-point attempts blocked by Durant.\n\"They played extremely hard. We fought back and were able to control the game in the second half,\" Durant said. \"This game helped me a lot. Just being able to play a double-overtime game, and just getting used to that again.\"\nOklahoma City trailed by as many as 18 but outscored the Magic 42-24 in the fourth quarter. Westbrook had 14 points in the extra periods.\nTobias Harris led the Magic with 30 points. Nik Vucevic added 26, and Victor Oladipo had 21 points, 13 rebounds and 10 assists. His 3-pointer forced the second overtime.\nThe Thunder got out to a five-point lead in the first overtime, but the Magic were able to get it down to 124-123 with 38 seconds remaining. Orlando had a chance to take the lead, but Evan Fournier came up empty on a jumper.\nOut of a timeout, Westbrook got free and dropped in a 17-footer with 7.8 left.\nBut with the clock winding down the Magic got the ball to Oladipo in the corner, and he got his 3-pointer to go as time expired.\nThe Magic had no answers against Oklahoma City last season when they gave up a franchise-record 79 points in the first half of a game.\nThe roles were reversed in the opening 24 minutes of regulation on Friday night.\nOrlando scored 67 points in the first half, hovering near 70 percent shooting for a good portion of it.\nTIP-INS: The Thunder were held to just 22 points in both the second and third quarters. ...Westbrook was 2-for-11 from the field in the first half. ...Orlando has connected on a 3-pointer in 658 consecutive games, dating to March 17, 2007. ...The Magic announced Wednesday that Disney Parks has extended its sponsorship with the team and Amway Center arena.\nREGULATION HEROICS: It took an incredible fourth-quarter finish to get the game into overtime. Westbrook got a driving layup out of timeout to get the Thunder within 112-111. Orlando's Aaron Gordon was fouled with 16.2 seconds but was able to convert on both free throws. Out of an Oklahoma City timeout, Durant got free at the top of the key and drilled a 26-footer to tie it with 13.5 to play. Oladipo dribbled the clock down and hit his own 26-footer to put the Magic back in front 117-114. The Thunder got the ball into Westbrook, who banked it in from 38 feet out.\nPREMATURE CELEBRATION: Magic coach Scott Skiles was not pleased with how he said his team was celebrating after Oladipo's go-ahead 3-pointer in regulation. \"They had no timeouts left. We were unaware,\" he said. \"[Westbrook] drove down and banged in a 3 and tied the game while we were celebrating. Totally unacceptable and unprofessional, so we have to address that.\"\nSMALL BALL: Orlando started Fournier at small forward for the second straight game. Skiles said that is a position where personnel could change a lot based on the early schedule and matchups. \"We've got to remain flexible, depending on how we play and what our record is,\" Skiles said.\nSTAR WATCH: Boxer Floyd Mayweather, draped in a diamond-encrusted necklace and all black -- including a leather hat -- sat courtside on Friday night. When a shot of him was put on the video screen, he smiled as he received a chorus of boos.\nUP NEXT:\nThunder: Oklahoma City hosts Denver on Sunday night.\nMagic: Orlando begins a three-game road trip at Chicago on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994228.358281
}