{
  "game_id": "0022400501",
  "espn_id": "401705067",
  "date": "Jan 06, 2025",
  "matchup": "SAC vs. MIA",
  "headline": "DeRozan shines as Kings hold off Heat 123-118 in double overtime",
  "body": "SACRAMENTO, Calif. -- — DeMar DeRozan scored nine of Sacramento’s 11 points in the second overtime, and the Kings beat the Miami Heat 123-118 on Monday night to extend their winning streak to a season-high five games under interim coach Doug Christie.\n\n\r\n              DeRozan finished with 30 points on 12-of-26 shooting. Domantas Sabonis had 21 points, 18 rebounds and 11 assists as the Kings (18-19) won their second straight without injured point guard De’Aaron Fox.\n\n\r\n              Malik Monk scored 23 points, Keon Ellis had 17 and Keegan Murray added 14 points and 12 rebounds.\n\n\r\n              Jaime Jaquez Jr. had a triple-double with 16 points, 12 rebounds and 10 assists for Miami. Tyler Herro scored 26 but was called for a costly 8-second violation toward the end of the fourth quarter.\n\n\r\n              Terry Rozier added 18 points, and Haywood Highsmith had 14.\n\n\r\n              The game was tied at 102 at the end of regulation and at 112 after the first overtime.\n\n\r\n              DeRozan took over after that with a 3-pointer and a trio of step-back jumpers that stunned Miami and left the Heat winless in three overtime games on the road this season.\n\n\r\n              Takeaways\r\n              Heat: Coach Erik Spoelstra’s team played solid for the first four quarters but got sloppy in overtime.\n\n\r\n              Kings: Sacramento is playing with a lot more heart and effort under Christie than it did the final two weeks under former coach Mike Brown.\n\n\r\n              Key moment\r\n              With his team clinging to a one-point lead in the first overtime, Jaquez missed a pair of free throws with 3 seconds left. That opened the door for the Kings to score and force the second OT.\n\n\r\n              Key stat\r\n              The Heat are 4-7 without Jimmy Butler this season.\n\n\r\n              Up next\r\n              Heat: Face the Golden State Warriors on Tuesday.\n\n\r\n              Kings: Begin a four-game trip against the Boston Celtics on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997341.096558
}