{
  "game_id": "0021900483",
  "espn_id": "401161125",
  "date": "Dec 28, 2019",
  "matchup": "SAC vs. PHX",
  "headline": "Booker scores 32 to help Suns hold off Kings and end skid",
  "body": "SACRAMENTO, Calif. --  Monty Williams felt it was appropriate that Phoenix's first win in nearly three weeks came down to a last-second miss by Sacramento.\n\nAfter coming close to ending their skid three times earlier, the Suns naturally needed to sweat this one out, too.\n\nDevin Booker had 32 points and 10 assists and Phoenix held off a late surge to beat the Kings 112-110 on Saturday night and snap an eight-game losing streak.\n\n\"We’ve lost a few games that way,\" Williams said. \"Stuff happens in games. We’re happy to get a win. Off of a tough game yesterday, the resiliency that we showed today was something to be proud of.\"\n\nKelly Oubre Jr. added 20 points and 16 rebounds for the Suns, who had not won since beating Memphis on Dec. 9. Three of the losses were by two points or fewer, including a 113-111 defeat against Denver on Dec. 23.\n\nThat’s why holding off the Kings felt so satisfying.\n\n“We did it the right way, too,” Oubre said. “We got some kick-aheads, sped up the pace, we got to put pressure on their defense early. Everything happens that way when we play together.”\n\nRicky Rubio had 21 points and eight assists, and Aron Baynes scored 17 points for Phoenix.\n\nBuddy Hield scored 23 points for Sacramento, two days after complaining about his lack of playing time late in games. The Kings have lost six straight.\n\nBooker scored 11 points in the fourth quarter and the Suns overcame his missed free throw with 5.9 seconds remaining that would have given them a three-point lead.\n\nSacramento failed to capitalize as Harrison Barnes missed a 3-pointer at the buzzer.3\n\n“Fighting back from 14 down we really locked in and gave ourselves a chance,” Kings coach Luke Walton said. “It's tough to come out there with another loss but it's good to see our guys fighting like that. When you do that, eventually, you'll start winning again.”\n\nIt’s the ninth time this season that Booker has had 30 points or more. It’s also the 72nd of his career, fourth-most in Suns history.\n\n“As many bodies and hands as he has on him, he still makes shots,” Williams said. “He just willed us to a victory tonight.”\n\nThe Kings' frustrations boiled over in the second quarter when Richaun Holmes and Walton were called for technical fouls after Holmes was whistled for fouling Oubre. Holmes was upset with the call, and Walton continued the argument as Booker went to the line for a free throw.\n\nPhoenix used the four-point swing to pull away and take a 59-49 halftime lead.\n\nTIP-INS\n\nSuns: Oubre, who sat out much of the first half against Golden State in foul trouble, had nine points in the first quarter and a double-double by halftime. … Phoenix committed 14 turnovers, one night after having a season-high 27 in a loss to Golden State. … Mikal Bridges scored 10 points.\n\nKings: Marvin Bagley III will miss a few games with a mid-foot sprain, according to a statement put out by the team. Bagley wore a walking boot on his left foot when he left Golden 1 Center after getting hurt against Houston on Thursday. Sacramento was also without De’Aaron Fox (back spasms). Fox played two minutes against the Rockets before coming out.\n\nMEETING OF THE MINDS\n\nWilliams met with Booker, Oubre and Rubio before the game and allowed the players to let their emotions out. “Long story short was we all just have to hold each other accountable more and be willing to be coached,” Oubre said. “We have to continue to hold everybody to a standard, and that’s what we told Coach. We want him to hold us to the same standard that he holds the 15th man. If we’re not doing the right things, do what you have to do. Take us out.”\n\nUP NEXT\n\nSuns: Head to Portland to face the Trail Blazers on Monday. Portland has won 11 straight against Phoenix.\n\nKings: Play the Nuggets in Denver on Sunday. The teams split a pair of games, both in Sacramento, earlier this season.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996406.09956
}