{
  "game_id": "0022300379",
  "espn_id": "401585007",
  "date": "Dec 21, 2023",
  "matchup": "LAC @ OKC",
  "headline": "Gilgeous-Alexander scores 31, Holmgren has highlight dunk as Thunder end Clippers' 9-game win streak",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 31 points, Chet Holmgren gave Oklahoma City the lead for good with a dunk he threw off the backboard to himself, and the Thunder beat the Clippers 134-115 on Thursday night, ending Los Angeles' nine-game winning streak.\n\n\r\n              With Oklahoma City trailing by a point in the third quarter, Holmgren pump-faked Ivica Zubac at the free-throw line, then caught his own lob and threw down a two-handed jam.\n\n\r\n              “I don’t know where it came from, really, honestly,” Holmgren said. “That was like an at-the-park move ... I guess it just happened.”\n\n\r\n              Gilgeous-Alexander was impressed.\n\n\r\n              “He’s 7 feet, so he’d better have that in him,” Gilgeous-Alexander said. “I didn’t expect him to do it. I thought he was just going to step through and shoot. But it was tough.”\n\n\r\n              Holmgren's play sparked a 13-0 run, and Oklahoma City led by double digits the rest of the way.\n\n\r\n              Holmgren finished with 23 points and Lu Dort added 21 for the Thunder, who shot 58.6% from the field to win for the fifth time in six games.\n\n\r\n              Oklahoma City (18-8), which is second place in the Western Conference standings, began its current three-game winning streak with a victory at defending champion Denver. Now, the Thunder have knocked off one of the more star-studded teams in the league.\n\n\r\n              “Obviously, they’re a super talented group,\" Gilgeous-Alexander said. “A bunch Hall of Famers over there, and we knew what the task was waking up this morning.”\n\n\r\n              James Harden scored 23 points and Paul George added 22 for the Clippers, who hadn't lost since falling at Golden State on Nov. 30.\n\n\r\n              Los Angeles forward Kawhi Leonard was out with a bruised right hip. The Clippers played at Dallas a night earlier.\n\n\r\n              “They did a good job of just attacking us,\" Clippers coach Tyronn Lue said. \"We couldn’t get back, we couldn’t get set, we couldn’t get matched, and they took advantage of that early.”\n\n\r\n              Former Thunder star Russell Westbrook got a standing ovation and was cheered loudly while entering the game as a reserve for the Clippers with 6:51 remaining in the first quarter. He finished with 15 points and 13 rebounds.\n\n\r\n              Harden hit a 3-pointer early in the third quarter to put the Clippers ahead for the first time, 70-69. Holmgren responded with a 3. LA took its only other lead before Holmgren's dunk with 8:43 left in the third. Oklahoma City was ahead 109-92 to start the fourth.\n\n\r\n              Gilgeous-Alexander’s steal and two-handed dunk over Daniel Theis put the Thunder ahead 123-104 with just under five minutes remaining.\n\n\r\n              Thunder guard Josh Giddey fell hard late in the second quarter and left the game with a sprained left ankle. He did not return. Giddey scored 11 points on 4-of-5 shooting.\n\n\r\n              Harden made just one of his first 10 shots, but he turned it around late in the first half to help the Clippers trim a 14-point deficit to 64-59 at the break. He made his final three field goals in the half and had 11 points at halftime.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host Boston on Saturday.\n\n\r\n              Thunder: Host the Los Angeles Lakers on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996557.5321019
}