{
  "game_id": "0022401079",
  "espn_id": "401705645",
  "date": "Mar 29, 2025",
  "matchup": "IND @ OKC",
  "headline": "Gilgeous-Alexander scores 33 as league-leading Thunder top Pacers 132-111 for 9th straight win",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 33 points and the Oklahoma City Thunder routed the Indiana Pacers 132-111 on Saturday night for their ninth straight win.\n\n\r\n              Gilgeous-Alexander, the league's leading scorer, made 10 of 23 field goals and 10 of 12 free throws.\n\n\r\n              Lu Dort scored 22 points and made 6 of 7 3-pointers while Jalen Williams added 18 points for the Thunder.\n\n\r\n              Tyrese Haliburton had 18 points and Andrew Nembhard added 16 for the Pacers, who had won six of their previous seven games.\n\n\r\n              Oklahoma City dominated, even though forward/center Chet Holmgren sat out to manage the left hip injury he suffered early in the season. The Thunder now have a three-game lead on the Cleveland Cavaliers in the race for the league’s best record and homecourt advantage throughout the playoffs with eight to play.\n\n\r\n              The Pacers entered Saturday fourth in the Eastern Conference standings and are trying to hold off the Detroit Pistons and Milwaukee Bucks to earn homecourt advantage in the first round of the playoffs.\n\n\r\n              The Pacers were coming off a 162-109 win against the Washington Wizards, but they couldn’t duplicate the effort against a Thunder team with the league’s best defensive rating.\n\n\r\n              Takeaways\r\n              Pacers: Indiana ran into the rare team that could handle playing at its breakneck pace. Even with the teams running and gunning, the Thunder shot 51.1% from the field and committed just nine turnovers.\n\n\r\n              Thunder: Oklahoma City took an in-game injury in stride. Isaiah Hartenstein left with left hip soreness and did not play in the second half. Oklahoma City outscored the Pacers 71-62 after the break.\n\n\r\n              Key mome\r\n              nt\r\n              Oklahoma City's Isaiah Joe hit a pair of 3-pointers 45 seconds apart late in the third quarter. The second pushed the Thunder lead to 98-78.\n\n\r\n              Key stat\r\n              Gilgeous-Alexander made 6 of 18 shots the first three quarters, then made 4 of 5 in the fourth.\n\n\r\n              Up next\r\n              The Pacers host Sacramento and the Thunder host Chicago, both on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997482.250605
}