{
  "game_id": "401810120",
  "espn_id": "401810120",
  "date": "Nov 20, 2025",
  "matchup": "MEM vs SAC",
  "headline": "Aldama scores 29 points to help Grizzlies send Kings to 8th straight loss, 137-96",
  "body": "MEMPHIS, Tenn. -- — Santi Aldama scored 29 points, Jock Landale added 21 and the Memphis Grizzlies built a big first-half lead and sent the Sacramento Kings to their eighth straight loss, 137-96 on Thursday night.\n\n\r\n              Cedric Coward scored 19 points and Zach Edey finished with 16 points as Memphis snapped a five-game losing streak. Vince Williams had a career-best 15 assists, part of the Grizzlies setting a franchise record with 42 assists.\n\n\r\n              Zach LaVine led the Kings with 26 points, connecting on 10 of 17 shots. Maxine Raynaud finished with 12 points. Russell Westbrook and Keegan Murray, making his season debut, scored 11 points each. Murray had been out of action since a left thumb injury in the preseason. \n\n\r\n              The Kings have lost all eight in the skid by double digits. Four of the losses have come by at least 27 points. The 41-point setback Thursday was their largest of of the season.\n\n\r\n              Before the game, the Kings announced that an MRI revealed a partial meniscus tear in the left knee of starting center Domantas Sabonis. The team said he will be reevaluated in three to four weeks. He suffered the injury in Sunday's loss at San Antonio.\n\n\r\n              With Sabonis out of the middle, Memphis worked inside with Edey and Landale. The tandem missed only one of their 13 shots in the firsts half, Edey scoring 16 points, Landale adding 13. Memphis shot 54% in the first two quarters, and the Grizzlies scored their most points in a half this season for a 75-47 lead at intermission.\n\n\r\n              The Grizzlies stretched the lead to 37 — 113-76 — entering the fourth.\n\n\r\n              Up next\r\n              Kings: Close out five-game trip at Denver on Saturday night.\n\n\r\n              Grizzlies: At Dallas on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042661.7585669
}