{
  "game_id": "0021900849",
  "espn_id": "401161491",
  "date": "Feb 24, 2020",
  "matchup": "MIA @ CLE",
  "headline": "Porter leads Cavs to comeback win over Heat, 125-119 in OT",
  "body": "CLEVELAND --  The Cleveland Cavaliers turned what looked like another lopsided loss into a stunning win Monday night.\n\nRookie swingman Kevin Porter Jr. scored a season-high 30 points, including the go-ahead basket in overtime, and Cleveland rallied from a 22-point deficit for a 125-119 victory over the Miami Heat.\n\nPorter was 9 of 18 from the field and hit four 3-pointers in his 41 minutes on the floor.\n\n\"You can play a perfect game, but if you don't close at the end it doesn't matter,\" he said. \"We're extremely happy we could close it out.\"\n\nCleveland, which trailed 84-62 midway through the third quarter, handed the Heat their first loss in nine overtime games this season.\n\nMiami played without All-Star Jimmy Butler, who missed his second straight game because of personal reasons, but coach Erik Spoelstra wasn't interested in any excuses.\n\n\"Whoever is out there, we've got enough,\" he said. \"It doesn't matter who's out there. We've got enough to win.\"\n\nPorter's dunk after a pass from Kevin Love gave Cleveland a 119-118 lead with 1:20 to play. Fellow rookie Darius Garland's runner in the lane put the Cavaliers ahead 121-118 with 40 seconds remaining.\n\nJae Crowder missed a 3-pointer from the corner before Love scored after an offensive rebound with six seconds left and Porter hit two free throws to seal it.\n\nMiami scored one point over the final 1:44, a technical free throw by Kendrick Nunn with 1.4 seconds to play.\n\nCleveland's comeback came with Andre Drummond and Collin Sexton on the bench. Love had 17 points and 14 rebounds as seven Cleveland players scored in double figures. Larry Nance Jr. scored 16 points and Tristan Thompson added 15.\n\nThe Cavaliers played their first home game since J.B. Bickerstaff replaced John Beilein as head coach. Beilein resigned during the All-Star break.\n\n\"We're going to call on different people,\" Bickerstaff said. \"On a given night it could be your night.\"\n\nBam Adebayo had 22 points and 13 rebounds for Miami. Goran Dragic also scored 22 and Kendrick Nunn, who tied the game with six seconds left in regulation, added 21.\n\nThe Heat routed Cleveland 124-105 on Saturday, a game in which Miami never trailed and led by 31 points, and appeared headed to another easy win on this night. Miami scored the first 10 points and stretched a double-figure lead until the Cavaliers rallied.\n\nPorter hit consecutive 3s to give the Cavs their first lead, 107-104, with four minutes left in regulation.\n\nNunn's rebound basket tied the game with six seconds remaining. Porter missed a fadeaway jumper, and a rebound dunk by Nance came after time expired.\n\nThe Heat, who are fourth in the Eastern Conference, fell to 13-18 on the road.\n\n\"It's our job,\" Adebayo said. \"We play on the road. We've got to figure it out. Until we figure it out, we're going to keep losing over and over.\"\n\nTIP-INS\n\nHeat: F Derrick Jones Jr. started in place of Butler. ... G Tyler Herro (sore right ankle) and C Meyers Leonard (sprained left ankle) have not played since Feb. 3.\n\nCavaliers: G Dante Exum went to the floor with a sprained left ankle and limped to the locker room in the second quarter. He did not return. ... Cleveland made seven shots and had four turnovers in the first quarter. ... Sexton has scored in double figures in 28 straight games.\n\nDON'T ASK\n\nDragic was given a technical foul when it appeared he bumped into Nance while play was stopped in the fourth. Love made the foul shot. Spoelstra was given a technical for complaining about a no-call in the second quarter, but thought the officiating was a non-issue.\n\n\"Who cares?\" he said. \"You could see the frustration level on both sides about that. It didn't have anything to do with the outcome of the game.\"\n\nBIG ADDITION\n\nDrummond had 13 points and six rebounds in 24 minutes during his fifth game since being acquired from Detroit at the trade deadline.\n\n\"He has the ability to score without plays being called for him and that's a coach's dream,\" Bickerstaff said. \"You got a guy who can go get you 20 points and you don't have to call a play for him. Defensively, he has the impact to protect the paint. He can, with his brute forces and skillset, change a game.\"\n\nUP NEXT\n\nHeat: Host the Minnesota Timberwolves on Wednesday. Miami begins a five-game homestand that runs through March 4.\n\nCavaliers: Host Philadelphia on Wednesday. The 76ers are 3-0 against Cleveland this season, including a 141-94 win on Dec. 7.",
  "source": "espn_api",
  "crawled_at": 1764996614.2352278
}