{
  "game_id": "401810137",
  "espn_id": "401810137",
  "date": "Nov 23, 2025",
  "matchup": "UTAH vs LAL",
  "headline": "Lakers outlast Jazz 108-106 as Doncic scores 33 and James 17 in his 1st road test of season",
  "body": "SALT LAKE CITY -- — Luka Doncic had 33 points and 11 rebounds and LeBron James scored 17 points in his first road game of the season as the Los Angeles Lakers beat the Utah Jazz 108-106 on Sunday night.\n\n\r\n              James, who scored most of his points on fast breaks and strong drives to the hoop, added eight assists and six rebounds in 34 minutes. He had 11 points and 12 assists in a win against the Jazz on Tuesday, in the first game of his 23rd NBA season. James missed training camp and the Lakers' first 14 games due to sciatica.\n\n\r\n              Lauri Markkanen scored 12 of his 20 points in the fourth quarter and keyed a Jazz comeback. His 3-pointer was the last of a 17-5 run that brought Utah within 107-106. After Doncic made one of two free throws, Keyonte George's contested jumper from the corner glanced off the rim just before the final horn.\n\n\r\n              George had 27 points and eight assists for the Jazz (5-11), who led Wednesday's game at halftime before falling 140-126. This one was more competitive from tipoff to buzzer.\n\n\r\n              Austin Reaves scored 22 points and Rui Hachimura added 13 for the Lakers (12-4), who have won four in a row.\n\n\r\n              Neither team led by more than nine points until the Lakers went on a 13-0 run that was punctuated by Doncic’s 3-pointer with 6:06 remaining to give Los Angeles a 98-85 lead.\n\n\r\n              The largest advantage before that was when Lakers were up 67-58. The Jazz went on a 16-2 run for a 74-69 lead midway through the third.\n\n\r\n              Deandre Ayton scored two points in 13 minutes before leaving midway through the second quarter with a knee bruise.\n\n\r\n              Maxi Kleber made his 1,000th career field goal, his only basket of the game. It was a crucial dunk and the Lakers' last field goal to make it 107-101 with 1:21 to play.\n\n\r\n              Up next\r\n              Lakers: Host the Los Angeles Clippers on Tuesday.\n\n\r\n              Jazz: Visit Golden State on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042684.9405708
}