{
  "game_id": "0022401189",
  "espn_id": "401705755",
  "date": "Apr 13, 2025",
  "matchup": "IND @ CLE",
  "headline": "Pacers rally from 23-point deficit in 4th quarter to defeat Cavaliers 126-118 in double overtime",
  "body": "CLEVELAND -- — Quenton Jackson scored 21 points, RayJ Dennis had seven points in the second overtime and the Indiana Pacers rallied for a 126-118 victory over the Cleveland Cavaliers on Sunday after trailing by 23 with 7:35 remaining in regulation.\n\n\r\n              Tony Bradley added 14 points. His hook shot with 4:41 remaining in double overtime put Indiana up by two and gave it the lead for the first time since there was 4:21 left in the first quarter.\n\n\r\n              The Pacers (50-32), who'll be the fourth seed in the Eastern Conference in the playoffs, reached 50 wins for the first time since the 2013-14 season. Indiana reached the milestone even though two starters and four regular rotation players didn't play.\n\n\r\n              Jaylon Tyson scored a career-high 31 points for Cleveland (64-18), which ended the regular season with three straight losses after clinching the top seed in the Eastern Conference. .\n\n\r\n              Cleveland sat out nine of its regular rotation players, including four starters. Jarrett Allen was the only Cavaliers starter to see playing time, marking the first time in his eight-year career he played in all 82 games.\n\n\r\n              The Cavaliers had a 27-point advantage during the third quarter and were up 96-73 until Indiana rallied with a 32-9 run to even it at 105 with 10.5 seconds remaining.\n\n\r\n              Takeaways\r\n              Pacers: Took three of four from the Cavaliers in the regular-season series. Both teams could meet again in the second round of the playoffs.\n\n\r\n              Cavaliers: Emoni Bates scored 25 and Nae’Qwan Tomlin had 24 points and 12 rebounds in his fifth NBA game and first career start.\n\n\r\n              Key moment\r\n              After Bradley's bucket, Dennis scored Indiana's next seven points, including a 3-pointer to make it 118-111. \n\n\r\n              Key stat\r\n              Allen missed his only shot, but became the third player in NBA history to average at least 13 points and shoot at least 70% from the field. Allen, who averaged 13.5 points and shot 70.6%.\n\n\r\n              Up next\r\n              Indiana will have home court in its first-round series against Milwaukee. Cleveland won't know its first-round opponent until Friday night when the play-in tournament concludes.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997476.829431
}