{
  "game_id": "0021800644",
  "espn_id": "401071320",
  "date": "Jan 13, 2019",
  "matchup": "CLE @ LAL",
  "headline": "Cavs stun Lakers 101-95 to end 12-game losing streak",
  "body": "LOS ANGELES --  Wins have been hard to come by for the Cleveland Cavaliers this season, so coach Larry Drew has been focused on the incremental signs of progress.\n\nAgainst the Los Angeles Lakers, Drew saw those little things help put the Cavaliers into the right side of the win column.\n\nCedi Osman scored 20 points, Collin Sexton added 17 and the Cavaliers ended a 12-game losing streak with a 101-95 victory on Sunday night.\n\n\"Any time you go through a rebuilt process you're going to have bumps in the road, that's to be expected,\" Drew said. \"But the most important thing for this group is that they learn and there is growth. We understand where we are and who we are, and the most important thing for us right now is just to continue to grow every game we play.\"\n\nTristan Thompson had 15 points and 14 rebounds, and Alec Burks had 17 points and 13 rebounds as the short-handed Cavaliers split the two-game season series by forcing the Lakers into a choppy game.\n\nLos Angeles was 7 for 34 on 3-pointers, 16 for 27 from the free throw line and had 11 fast-break points.\n\nKyle Kuzma had 29 points and nine rebounds for the Lakers, who have lost two straight and five of their past seven. Brandon Ingram scored 22 points and Lonzo Ball had 13 points, eight rebounds and eight assists.\n\n\"No disrespect to the Cavs, but they're still an NBA team and for us we can't take anything lightly, especially in this league,\" Kuzma said. \"Because we're all professionals and you can lose on any given night if we don't bring the effort, and that's what happened tonight.\"\n\nBurks delivered an emphatic dunk after Ingram couldn't handle a defensive rebound to help the Cavaliers re-establish control after Kuzma scored five straight to cut the Cavaliers' lead to 84-79 midway though the four quarter.\n\nSexton drove for a layup and Osman hit a floater during a quick 6-0 run, which allowed the Cavaliers to hold off another late push by the Lakers. Kuzma hit a 3-pointer with 22 seconds remaining to trim the margin to 96-93, but Burks made both free throws with 16 to play.\n\n\"When they did score, we continued to play,\" said Cavaliers forward Rodney Hood, who had 18 points. \"We didn't look around and we didn't cave in.\"\n\nThe Cavaliers had a 10-0 run in the third quarter after Kuzma hit a floater to pull the Lakers within 51-50 early in the period. Burks and Osman hit 3-pointers to bookend the push, and Cleveland was able to sustain a 10-point margin going into the fourth by holding Los Angeles to 8-for-26 shooting.\n\n\"When we're playing like that and playing together it's fun,\" Sexton said. \"I felt like tonight we had fun and it's been a long time since we had fun.\"\n\nSTEP FORWARD\n\nIt was a modest night for Sexton, making 7 of 14 shots and adding three rebounds and three assists. Drew was most excited that the rookie from Alabama committed one turnover in 33 minutes. \"He made some really good decisions,\" Drew said. \"He made some really smart plays that probably a month ago he probably wouldn't make, so I saw growth tonight.\"\n\nSLOW START\n\nThe Lakers trailed 32-24 after the first quarter, the fifth time in the past six games they allowed at least 30 points in the opening period. Lakers coach Luke Walton said he would consider lineup changes to stop the trend. \"By the end of games we're doing a nice job of stabilizing our defense and getting the stops we need, but we can't just keep giving up 30 points to start the games,\" Walton said.\n\nTIP-INS\n\nCavaliers: Osman scored eight of the Cavaliers' first 13 points. ... The Cavaliers made 56 percent of their shots in the first quarter (14-for-25 shooting). . Former Laker Jordan Clarkson had nine points and two assists.\n\nLakers: Michael Beasley had eight of the Lakers' 20 bench points. ... The Lakers were out-rebounded for the fourth straight game.\n\nUP NEXT\n\nCavaliers: Visit Portland on Wednesday.\n\nLakers: Host Chicago on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994774.125553
}