{
  "game_id": "0021900261",
  "espn_id": "401160903",
  "date": "Nov 27, 2019",
  "matchup": "MIL vs. ATL",
  "headline": "Bucks beat Hawks 111-102 in Middleton's return",
  "body": "MILWAUKEE --  Without Khris Middleton’s productive return, the Milwaukee Bucks might not have outlasted the Atlanta Hawks.\n\nGiannis Antetokounmpo had 30 points and 10 rebounds, Middleton scored 16 points in his return from injury and the Bucks beat the Atlanta Hawks 111-102 for their ninth consecutive victory.\n\nMiddleton, who had been out since Nov. 10 with a thigh contusion, didn’t start and played 20 minutes. He helped the Bucks rally after they trailed through three quarters.\n\n\"I think guys were trying to pull it together and trying to fight through a little bit of fatigue or (being) banged up,\" the All-Star forward said. \"We're still figuring out ways to win ballgames, which is the most important thing.\"\n\nAntetokounmpo followed his season-high 50 points on Monday by notching his 18th consecutive double-double. The reigning MVP’s streak of double-doubles is the longest to begin a season since Bill Walton opened with 34 straight in 1976-77.\n\nAntetokounmpo was 5 for 13 from the free throw line for the Eastern Conference leaders, on their longest winning streak since winning 10 straight in 1985-86.\n\nFormer Bucks forward Jabari Parker scored a season-high 33 points for the Hawks and added 14 rebounds, also a season high. Trae Young scored 29 points as Atlanta (4-14) dropped its eighth straight.\n\n“It’s always going to be about putting that complete game together and understanding from a strategic standpoint, from a game-plan standpoint, from an effort standpoint, how to do that,\" said Atlanta coach Lloyd Pierce. \"The makes and misses aren’t the issue.”\n\nParker, who played for Milwaukee from 2014-18, scored the Hawks’ first eight points on their way to a 17-15 lead. Then Milwaukee scored 18 straight, getting seven from Middleton, to jump to a 33-17 lead at the end of the first quarter.\n\nThe Hawks battled back in the second period, behind Parker’s 15 points and Young’s 14. By the time Young drained a 3-pointer at the buzzer going into halftime, they had shaved the Bucks’ lead to 60-59.\n\nThe Hawks took an 82-81 lead into the fourth, but Antetokounmpo sparked the crowd by scoring over Parker on a drive to the hoop and drawing Parker’s fourth foul. Robin Lopez tipped in Antetokounmpo’s missed free throw, giving Milwaukee an 87-84 lead with just over 10 minutes left.\n\n\"The fourth quarter is where we lost, so I'd rather have the momentum at the right time,\" said Parker, who scored only two in the fourth.\n\nThe game stayed tight until Middleton hit a 3-point basket with just under 4 minutes left to put Milwaukee up 102-93.\n\nMilwaukee held Atlanta to 43 points in the second half.\n\nTIP-INS\n\nHawks: Guard Kevin Huerter (left rotator cuff strain) missed his eighth straight game. He has also been ruled out for the next two games, on Friday and Saturday.\n\nBucks: Middleton, the team’s second-leading scorer who entered Wednesday averaging 18.5 points per game, had been expected to miss three to four weeks. “It’s probably going to be one or two games and he’ll be starting,” coach Mike Budenholzer said. ... Guard George Hill (back soreness) was out for a second straight game.\n\nNET PLUS\n\nEntering Wednesday, Milwaukee guard Sterling Brown had the league’s best net rating of 19.6. That is the Bucks’ point differential per 100 possessions while he is on the court. His teammate, guard Donte DiVincenzo, was second (17).\n\nDOUBLES DUTY\n\nParker has scored in double figures in 17 of 18 games. \"It's insane what this kid has gone through,\" Antetokounmpo said of Parker, who suffered two torn ACLs in Milwaukee. \"He's back, he's healthy. He's jumping out of the gym and shooting 3s. I'm really happy for him. I know he had a lot of dark times after both injuries he had, but he's back.\"\n\nUP NEXT\n\nHawks: At Indiana on Friday.\n\nBucks: At Cleveland on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996167.889247
}