{
  "game_id": "0021900464",
  "espn_id": "401161106",
  "date": "Dec 26, 2019",
  "matchup": "SAC vs. MIN",
  "headline": "Timberwolves edge Kings 105-104 in 2 OT to stop 11-game skid",
  "body": "SACRAMENTO, Calif. --  As he watched Buddy Hield's last-second 3-point attempt clang off the back of the rim at the end of double overtime, Minnesota's Andrew Wiggins breathed a sigh of relief that was nearly a month in the making.\n\nFor the first time in December, the Timberwolves won a game.\n\n\"All you could do was look and watch,\" Wiggins said. \"I was looking at the shot and it missed. Thank God.\"\n\nWiggins scored the first basket of the second overtime and then fed Robert Covington for another score, and Minnesota ended its 11-game losing streak by beating the Sacramento Kings 105-104 on Thursday night.\n\nMinnesota hadn't won since Nov. 27 before limiting Sacramento to 11 points in the fourth quarter and then outlasting the Kings in two overtimes. The Wolves did it without Karl-Anthony Towns, who missed his fifth straight game with a left knee sprain.\n\n\"We did a lot of great things tonight,\" coach Ryan Saunders said. \"Our offense was not pretty tonight but we found ways. That locker room deserves to feel good.\"\n\nWiggins got the Wolves going in the second OT with a short jumper that started a 6-0 run. After Jeff Teague made a floater, Wiggins passed to Covington for a layup.\n\nGorgui Dieng's dunk with 3:11 left put Minnesota up 105-99. Hield scored five straight points for Sacramento to close the gap, but the Wolves held on after Hield missed the potential game-winner.\n\n\"Winning in double overtime, winning in regulation, either way I would have took it,\" Minnesota's Treveon Graham said.\n\nWiggins finished with 18 points, 10 rebounds and seven assists. Dieng had 21 points and 15 rebounds, and Covington scored 19 for the Timberwolves.\n\nRichaun Holmes had 20 points and a career-high 18 rebounds for the Kings, who have their own injury concerns.\n\nDe'Aaron Fox left two minutes into the first quarter with back spasms. Sacramento's point guard missed 17 games this season with an ankle injury sustained in practice. Marvin Bagley III limped off the court in the third quarter and was wearing a walking boot on his left foot after the game. Bagley had also recently returned after missing 22 games because of a broken right thumb sustained in the season opener.\n\n\"Give Minnesota credit. They knocked down some big shots when they had to and we didn't,\" Kings coach Luke Walton said. \"We have to keep scrapping and fighting. We have to be better.\"\n\nBoth teams turned chances to win in the first overtime into turnovers. In the final 0.5 seconds alone, Teague threw away an inbounds pass and Bogdan Bogdanovic missed the rim on a 3-point try.\n\nTIP-INS\n\nTimberwolves: Shabazz Napier scored two points on 1-of-7 shooting in 22 minutes after missing Monday's game at Golden State with an illness. . Towns is getting closer to returning, although his status for Saturday's game against the Cavaliers is uncertain. . Wiggins had an emphatic one-hand dunk in the first quarter but clanged another attempt off the rim in the second.\n\nKings: Fox had two points and two assists before leaving. ... Bagley, who had 18 points, was called for a technical after picking up his fourth foul.\n\nQUOTABLE\n\n\"There are some trust issues going on, I guess. Guys are now starting not to believe in players. It is what it is. They have who they have out there and I've got to be supportive. I am a team-first guy no matter what.\" -- Hield, who was on the bench for most of the first overtime.\n\nUP NEXT\n\nTimberwolves: Return home to play Cleveland on Saturday. Minnesota won both meetings last season.\n\nKings: Host the Phoenix Suns on Saturday. The teams have split a pair of matchups this season.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995897.260014
}