{
  "game_id": "0022200571",
  "espn_id": "401468726",
  "date": "Jan 04, 2023",
  "matchup": "MIN vs. POR",
  "headline": "Edwards scores 32, helps Wolves close out Blazers 113-106",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 13 of his 32 points in the fourth quarter, Rudy Gobert had 17 points and 12 rebounds, and the Minnesota Timberwolves beat the Portland Trail Blazers 113-106 on Wednesday night.\n\n\r\n              Luka Garza added 14 points off the bench for Minnesota, which saw another halftime lead slip away in the third quarter but held on for its second straight win after a six-game skid.\n\n\r\n              “I thought defensively we were great pretty much all night long,” Timberwolves coach Chris Finch said. “We gave them a lot of different looks and to close out the game, a lot of winning plays really.”\n\n\r\n              Jerami Grant scored 20 of his 26 points in the first half for Portland, which trailed by as much as 13 in the opening half while Damian Lillard and Anfernee Simons combined for three points.\n\n\r\n              Lillard finished with 27 points and Simons had 16 for the Trail Blazers, who had 18 turnovers that led to 22 points for the Timberwolves.\n\n\r\n              “I was never really happy from the start of the game,” Portland coach Chauncey Billups said. “Our mindset from the very start wasn’t right. It just wasn’t right. That’s our inconsistency. Sometimes, we come out with the right type of mindset, set the tone, be the aggressor on both sides of the floor. When we don’t, you come back and you want to counterpunch, you put yourself in a tough spot.”\n\n\r\n              Minnesota has had no trouble getting ahead, such as in Monday’s win against Western Conference-leading Denver. Holding those leads has been the issue, like when the Timberwolves led NBA-worst Detroit by 18 in an eventual loss Saturday.\n\n\r\n              With Lillard and Simons finding their way, the Trail Blazers erased a seven-point halftime deficit early in the third quarter.\n\n\r\n              “I think we’re just really inconsistent right now,” Lillard said. “Not only from game to game but from quarter to quarter. We’re just not able to sustain that level of focus, that level of urgency, the energy.”\n\n\r\n              Jusuf Nurkic gave the Trail Blazers a 92-91 lead with 9:33 remaining in the fourth.\n\n\r\n              Veteran teammates have implored the young Edwards to take control of games at certain points and he did so again. He scored six points as the Wolves went on an 11-3 run to pull back in front for good, and the offense ran through Edwards late in the fourth.\n\n\r\n              “I’m always ready for the fourth,” Edwards said. “When the fourth come, I’m like, ‘Man, it’s showtime now.’ So, I’m getting kind of used to it now.”\n\n\r\n              LEANING ON LUKA\n\n\r\n              Garza provided the early boost, scoring 11 points in the first quarter. When the seldom-used, second-year player replaced Gobert, Minnesota went on a 14-1 run for a 25-12 lead. Garza had nine points during the run, capping it with a wide-open 3-pointer.\n\n\r\n              “His offense was carrying us there for a little bit and we were feeding him,” Finch said. “He’s a very gifted offensive player, but defensively he was outstanding.” \n\n\r\n              PRINCELY RETURN\n\n\r\n              Minnesota's Taurean Prince returned after missing 20 games with a right shoulder subluxation. His impact was limited due to foul trouble, but he finished with 11 points in 21 minutes. The seven-year veteran also provided energy and defense off the bench.\n\n\r\n              “I feel like I bring a presence that’s infectious,” Prince said. “So, I guess that’s something that plays to a benefit when I’m able to play.”\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: Grant missed time in the second half with a left quad contusion but finished the game. ... Gary Payton II, who made his season debut on Monday, was held out with a right ankle sprain. Payton had recovered from offseason core muscle surgery. Justise Winslow missed his fifth straight game with a left ankle sprain. ... Nurkic and fellow center Drew Eubanks each fouled out.\n\n\r\n              Timberwolves: D’Angelo Russell returned after missing Monday’s game due to an illness. ... Naz Reid missed his second straight game with back spasms and Bryn Forbes was out with right shoulder soreness. ... Minnesota entered the day being outscored by a league-high 122 points in the third quarter.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Indiana on Friday.\n\n\r\n              Timberwolves: Host the Los Angeles Clippers on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995174.609246
}