{
  "game_id": "0022000900",
  "espn_id": "401307699",
  "date": "Apr 23, 2021",
  "matchup": "CHA vs. CLE",
  "headline": "Bridges, Hornets battle back to beat Cavs 108-102",
  "body": "CHARLOTTE, N.C. -- — Miles Bridges is taking his game to a new level this season.\n\n\r\n                    And Hornets coach James Borrego doesn't believe Charlotte's high-flying 6-foot-7 forward has come close to reaching his full potential yet.\n\n\r\n                    “He’s big and powerful and athletic,” Borrego said. “There is another level to Miles. I don’t think any of us saw the level he would get to this year. If you look at his size and skillset, there is still another level.”\n\n\r\n                    Bridges had 25 points and 10 rebounds, and the Hornets erased a 10-point second-half deficit to beat the Cleveland Cavaliers 108-102 on Friday night to secure a much-needed win. P.J. Washington and Terry Rozier also each had 25 points and Devonte Graham added 10 assists for the Hornets, who won for only the second time in eight games.\n\n\r\n                    Bridges is averaging 18 points and 7.2 rebounds per game in 13 starts this season, while shooting 52.4% overall from the field and 44% from 3-point range.\n\n\r\n                    Bridges has become known for his powerful highlight reel dunks, but he’s proving he can shoot from long range, too. He was 4 of 6 from beyond the arc against the Cavs, including a big 3 to give the Hornets a 10-point lead late in the game.\n\n\r\n                    “The more confidence I play with, you will see more of the work I have put in,” Bridges said. “My coach has confidence in me and I have confidence in myself too.”\n\n\r\n                    Collin Sexton had 28 points and Darius Garland scored 27 for the Cavaliers, who continue to struggle and have now lost six of their last eight.\n\n\r\n                    “We were a little stagnant in the second half and played into their switches” on defense, Sexton said.\n\n\r\n                    Charlotte (29-30) entered the night in eighth place in the Eastern Conference and looking to make up ground with 10 of its final 14 games at home.\n\n\r\n                    So far, so good.\n\n\r\n                    The score was tied at 78 entering the fourth quarter when the Hornets went on a 10-1 run behind driving three-point plays from Rozier and Brad Wanamaker to take a 93-85 with less than five minutes to play. Bridges helped put the Cavs (21-38) away in the game's closing minutes, scoring seven straight points during one stretch including a backbreaking 3 from the right corner to give the Hornets their largest lead at 95-85 with 1:31 left.\n\n\r\n                    “Offensively, we got bogged down a little bit,” Cavs coach J.B. Bickerstaff said.\n\n\r\n                    TIP INS\n\n\r\n                    Cavaliers: Bickerstaff was back on the bench after missing Wednesday night's game because of personal reasons. ... Taurean Prince, who scored 25 points and had four 3s in the fourth quarter of a 103-90 win over the Hornets on April 14, did not play because of left knee soreness.\n\n\r\n                    Hornets: Charlotte forced 17 turnovers, while turning it over a season-low five times.. ... Center Cody Zeller (coach's decision) did not play despite the Hornets being at a significant height disadvantage. Borrego went with Bismack Biyombo instead because of his defense.\n\n\r\n                    CAVS GUARDS\n\n\r\n                    Borrego walked away impressed with Cleveland's backcourt of Sexton and Garland, even though the Hornets were able to control them better in the second half and prevent them from finding Jarrett Allen for easy dunks.\n\n\r\n                    “Those two guards are a handful,” Borrego said. “That is a dynamic backcourt. When those two guards get downhill, it’s tough to defend.”\n\n\r\n                    PLAYING MINUTES\n\n\r\n                    Borrego played only eight guys and four of the team's starters played at least 36 minutes. He's not sure if that is sustainable, though, saying he will take things on a game-to-game basis.\n\n\r\n                    “My hope is we can get at least one body in the rotation,” Borrego said.\n\n\r\n                    The good news is rookie LaMelo Ball recently got his cast off and could return sometime next week now that his broken wrist has healed.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Visit the Wizards on Sunday night.\n\n\r\n                    Hornets: Host the Celtics on Sunday afternoon.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997346.1304488
}