{
  "game_id": "0022400476",
  "espn_id": "401705042",
  "date": "Jan 03, 2025",
  "matchup": "SAC vs. MEM",
  "headline": "Monk scores 31 points in the Sacramento Kings 138-133 win over the Grizzlies",
  "body": "SACRAMENTO, Calif. -- — Malik Monk scored 31 points, DeMar DeRozan added 29 and the Sacramento Kings beat the Memphis Grizzlies 138-130 on Friday night.\n\n\r\n              De’Aaron Fox added 23 points for the Kings, who won their third in a row.\n\n\r\n              Jaylen Wells had 30 and Jarren Jackson Jr. scored 28 for the Grizzlies.\n\n\r\n              The Kings led 78-72 the half, and 102-100 after three quarters. The Grizzlies took a 110-109 lead on Scottie Pippen Jr.'s two free throws at the 7:56 mark of the fourth quarter.\n\n\r\n              But the Kings went on a 20-10 run to regain the lead capped with a 3-pointer by Monk with 4:21 remaining.\n\n\r\n              Zach Edey returned from a two-game absence due to a concussion and had nine points and seven rebounds off the bench.\n\n\r\n              Ja Morant (right AC joint strain) and Marcus Smart (right index finger) did not play. Keegan Murray missed his second straight game for the Kings (left ankle soreness). \n\n\r\n              Kings guard Devin Carter, the son of Grizzlies assistant coach Anthony Carter, made his debut with the team in the first quarter. The No. 13 overall selection in the 2024 draft out of Providence underwent left shoulder surgery to repair a torn labrum last July.\n\n\r\n              Takeaways\r\n              Kings: Dished out 21 assists in the first half. Three players had four or more.\n\n\r\n              Grizzlies: Down by 15 points early in the third quarter, the Grizzlies surged back to tie the game 100-all on two free throws by Jackson with 1:27 left in the quarter.\n\n\r\n              Key moments\r\n              The teams combined for 150 points in the first half. The Kings made 29 of 59 shots from the field (52.7%) while the Grizzlies knocked down 26 of 50 shots (52%).\n\n\r\n              Key stats\r\n              The teams made 17 3-pointers combined in the first quarter. The Kings were 10 of 18 while the Grizzlies made 7 of 11.\n\n\r\n              Up next\r\n              The Kings travel to San Francisco to play the Golden State Warriors on Sunday. The Grizzlies end their five-game road stretch at the Warriors on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997343.564193
}