{
  "game_id": "0022000933",
  "espn_id": "401307736",
  "date": "Apr 28, 2021",
  "matchup": "ORL @ CLE",
  "headline": "Magic squander 23-point lead in fourth, beat Cavs 109-104",
  "body": "CLEVELAND -- — Cole Anthony made the tiebreaking layup with 45 seconds left, and the Orlando Magic squandered a 23-point lead before edging the Cleveland Cavaliers 109-104 on Wednesday night to snap a six-game losing streak.\n\n\r\n                    The Magic went up 86-63 on R.J. Hampton’s hoop with 10:42 remaining, but Cleveland responded with a 41-18 run to tie the score at 104 on a 3-pointer by Kevin Love. \n\n\r\n                    Love was held scoreless until the fourth quarter, two days after his on-court tantrum against the Raptors in Tampa, Florida.\n\n\r\n                    Anthony put Orlando in front for good with a tough driving layup, then made a pair of free throws after a Cavaliers turnover to make it 108-104. The rookie from North Carolina scored 12 of his 18 points in the fourth.\n\n\r\n                    “In order to make the right play, I felt like I had to have the ball in my hands, to be honest,” Anthony said. “My job as a point guard is to make things happen for my team the best way I can.”\n\n\r\n                    Gary Harris had 19 points, six rebounds and seven assists for Orlando, which won for the second time in 14 games and pulled into a tie with Detroit for the worst record in the East. Chuma Okeke had 18 points before exiting with a twisted ankle.\n\n\r\n                    “Cole is a gamer who wants the moment, he wants the ball in his hands,” Harris said. “He’s going to be a very good player for a long time in this league. We’ve had some ups and downs, but we’re building something here.”\n\n\r\n                    Love missed his first eight shots, seven of them 3-pointers, and finished with six points on 2 of 11 from the field. He added 10 rebounds, six assists and three steals in 35 minutes.\n\n\r\n                    The five-time All-Star received a mixed reaction from the crowd after publicly apologizing earlier in the day.\n\n\r\n                    “I think Kevin put the burden on himself because of the last couple of days, but when it came time, he made the big shot,” Cleveland coach J.B. Bickerstaff said. “He didn’t make shots early, but he was contributing in other ways all night.”\n\n\r\n                    Darius Garland scored 25 points in the Cavaliers’ fourth straight loss, while Cedi Osman had 19 points and Jarrett Allen added 17 points and 13 rebounds. Cleveland, which began a season-high, five-game homestand, is 1-7 in its last eight.\n\n\r\n                    The Cavaliers were without seven injured players, including leading scorer Collin Sexton, who missed his third game after suffering a concussion at Charlotte on April 23.\n\n\r\n                    “You can talk about injuries or us coming home from a road trip, but we have to come out as professionals at the start,” Allen said.\n\n\r\n                    James Ennis III returned for the Magic after being sidelined for five games with a sore right calf. He started at small forward and had eight points.\n\n\r\n                    Orlando coach Steve Clifford has been away from the team since Sunday because of NBA health and safety protocols. Tyrone Corbin, serving as acting coach, said Clifford is not experiencing any COVID-19 symptoms.\n\n\r\n                    “Steve is feeling good, but he is bored by himself in quarantine,” Corbin said, chuckling.\n\n\r\n                    Heisman Trophy winner DeVonta Smith of Alabama was in attendance. Cleveland will host the NFL Draft beginning Thursday.\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: F Otto Porter Jr. (left foot pain) has been sidelined since April 3 and has only appeared in three games since being acquired in a four-player trade with Chicago on March 25. Corbin said there is no timetable for his return, but Porter does report to the team facility each day. … G Markelle Fultz (left knee reconstructive surgery), G Terrence Ross (back spasms), G Michael Carter-Williams (left ankle sprain), C Jonathan Isaac (left knee and rookie G Devin Cannady (right ankle dislocation) also were out.\n\n\r\n                    Cavaliers: F Taurean Prince (left ankle surgery) will miss the rest of the season after an arthroscopic procedure Tuesday in New York. Prince averaged 10.1 points in 29 games after being acquired from Brooklyn on Jan. 14. …. G Matthew Dellavedova (neck strain), C Isaiah Hartenstein (concussion), F Larry Nance Jr. (right thumb fracture), F Lamar Stevens (concussion) and F Dylan Windler (left knee surgery) were inactive. … G Jeremiah Martin, who played with the Nets last season, signed a two-way contract.\n\n\r\n                    SPECIAL GUEST\n\n\r\n                    Former Cavaliers owner Gordon Gund, whose purchase of the franchise in 1983 prevented it from relocating, was honored during the game. Gund sold controlling interest to current owner Dan Gilbert in 2005, and had his minority share bought out on April 14. “With Mr. Gund, Wayne Embry as general manager and Lenny Wilkens as coach, they were just super people to be around,” said Corbin, who played from Cleveland from 1986-88. “I really enjoyed my time here.”\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Visit Memphis on Friday. The teams will complete their two-game season series at Amway Center on Saturday.\n\n\r\n                    Cavaliers: Host Washington on Friday. Cleveland plays eight of its final 10 games at Rocket Mortgage FieldHouse.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997571.369895
}