{
  "game_id": "0021800266",
  "espn_id": "401070947",
  "date": "Nov 23, 2018",
  "matchup": "MEM @ LAC",
  "headline": "Clippers win in OT to snap Grizzlies 5-game winning streak",
  "body": "LOS ANGELES --  Two early surprises to the NBA season met Friday and regulation wasn't enough to settle things.\n\nThe surging Memphis Grizzlies thought they had things under control, up by eight with less than 2 minutes to play in the fourth quarter, but the Clippers surged to the finish. Danilo Gallinari hit three free throws with 3 seconds to play to force overtime and Los Angeles then ran off with a 112-07 victory.\n\nThe Clippers outscored Memphis 11-3 to close regulation, holding the Grizzlies without a field goal over the last 3:26 and tying it up when Gallinari swished his pressure free throws.\n\n\"It's something I can say I'm pretty good at,\" said Gallinari, a 95.5 percent free-throw shooter on the season. \"It's a mental game at the free throw line.\"\n\nGallinari led the Clippers with 20 points, connecting on all nine of his free throws.\n\n\"I don't know if his blood pressure ever goes up or down,\" said Clippers coach Doc Rivers. \"He is one of the best, if not the best free-throw shooter in the league.\"\n\nMemphis' Marc Gasol, who did not score until the 4:50 mark of the second quarter, led all scorers with 27 points, to go with his 13 rebounds. Rookie Jaren Jackson Jr. added 20 points and Mike Conley 19 for the Grizzlies.\n\nConley fouled out with 2:51 to play in regulation. Memphis coach J.B. Bickerstaff called the sixth foul a \"joke\" and wasn't thrilled with several of the calls that went against the Grizzlies, who have one of the league's best defenses.\n\n\"Our defense is where we live,\" Bickerstaff said. \"It's frustrating when we are not allowed to defend the way that we are. That's our reputation and it's frustrating.\n\n\"We deserve the respect because of the character of the guys we have, to play this style of basketball. Our technique is good, our position is good. We work on it every single day. There's going to be contact sometimes, but if you're in legal guarding position you're allowed to do it.\"\n\nThe loss snapped the Grizzlies' five-game winning streak and left them and the Clippers at 12-6, temporarily tied with the Portland Trail Blazers for first in the Western Conference. Portland was scheduled to play later Friday.\n\nNeither the Grizzlies nor Clippers made the playoffs last season.\n\nMontrezl Harrell added 22 points and 11 rebounds for the Clippers, with five points coming in OT. Lou Williams had 15 points.\n\nTIP-INS\n\nGrizzlies: Bickerstaff remains impressed by the early play of rookie forward Jackson (12.5 points, 4.4 rebounds), who just turned 19 last month: \"He's extremely gifted and athletic, but the most important thing is his want-to. The first thing he does every day is work on his defense.\"\n\nClippers: G Milos Teodosic, who has played in only eight games, told Serbian media he expects to return to European basketball, possibly this season. Rivers said he'd heard the report, but doesn't expect him to return this season. Said Rivers: \"We want Milos to be happy. Obviously, he hasn't played the minutes or at a level he'd like to.\"\n\nDEFENSIVE STOPPER\n\nThe Grizzlies trailed 110-107 with 18.7 seconds left in overtime and had the ball, when guard Avery Bradley stripped it from Memphis' Garrett Temple.\n\nBradley was then quickly fouled and made both free throws to seal the win.\n\n\"The key to this team -the key to this league -- is when you have your name called, be prepared for every situation,\" Bradley said.\n\n\"The opportunity presented itself and I took advantage.\"\n\nMISSING CONLEY\n\nConley leads the Grizzlies in scoring (20.2 points) and assists (6.0), but they had to play the game's final 7:51 without him after he fouled out.\n\n\"I felt like we deserved to win that game,\" Conley said. \"We had plenty of opportunities at the end, that didn't go our way, and they were the better team in overtime. It's tough to play in the situations we were put in at the end of tonight.\"\n\nUP NEXT\n\nGrizzlies: Host New York on Sunday night.\n\nClippers: At Portland on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994945.604327
}