{
  "game_id": "0022000012",
  "espn_id": "401267152",
  "date": "Dec 23, 2020",
  "matchup": "MIA @ ORL",
  "headline": "Fournier has late surge, helps Magic beat Heat 113-107",
  "body": "ORLANDO, Fla. -- — For a third time in the past four years, the Orlando Magic opened their season on their home court with a stirring victory beat the rival Miami Heat.\n\n\r\n                    Clearly, though, it will take more than just a victory over the defending Eastern Conference champion Heat for the Magic to back up forward Aaron Gordon’s bold talk of the team being \"overlooked.’’\n\n\r\n                    Evan Fournier hit a go-ahead 3-pointer late in the fourth quarter, converted a three-point play off another driving layup in the final minute and scored 25 points in the Magic’s 113-107 victory over Miami on Wednesday.\n\n\r\n                    \"It was a good win and you always want to win the first game, especially when it’s at home,’’ said Fournier, who scored nine points in the final period for Orlando. \"It’s definitely rewarding to win against a team like Miami because it’s always tough to play against them.’’\n\n\r\n                    The Sunshine State rivals opened the regular season against one another for the sixth time. Oddly, the two rivals have started their seasons in Orlando four times in the past five years. The Magic are 5-1 in their six openers against their rivals from South Florida. \n\n\r\n                    Bam Adebayo led Miami with 25 points and 11 rebounds, Goran Dragic added 20 points, and Jimmy Butler had 19 points and seven assists. The Heat turned the ball over 22 times, leading to 24 Magic points.\n\n\r\n                    \"One, empty possessions. Two, we didn’t get the necessary ball movement … and thirdly, (the Magic) are a good defensive team,’’ said Heat coach Erik Spoelstra’s, whose team was playing for the first time since losing to the Los Angeles Lakers in the NBA Finals in October. \n\n\r\n                    Miami led 83-79 after three periods and it was up 93-91 with 4:29 to play following Adebayo's dunk. However, Fournier soon after swung the momentum to the Magic’s side with his strong finish. Fournier, who is looking to bounce back this season after struggling in last season’s playoffs, made all three of his shots in the fourth quarter.\n\n\r\n                    Gordon had 20 points and seven rebounds, Terrence Ross chipped in 19 and Nikola Vucevic added 15 points and 11 rebounds. Point guard Markelle Fultz added 15 points and made two clutch free throws with 1:11 to play.\n\n\r\n                    Gordon is confident that the Magic can open some eyes with their play this season.\n\n\r\n                    \"I don’t think, outside of Orlando, people have a lot of belief in us,’’ said the forward, who made 8 of 11 shots. \"I don’t think they think that we’re going to become potential contenders or even have a playoff slot and I don’t think that’s true. I feel like we’re really ready to make that next leap.’’\n\n\r\n                    TIP-INS \n\n\r\n                    Heat: Dragic, who played well despite struggling with a foot injury much of training camp, was upset with his team’s hustle. \"We talked and thought we did not play hard enough,’’ Dragic said. \"This is what we need to correct.’’ \n\n\r\n                    Magic: The Magic held a moment of silence prior to tipoff to honor franchise co-founder Jimmy Hewitt. He died last month at the age of 79. Hewitt, along with Pat Williams, helped bring the NBA in the 1989-90 season.\n\n\r\n                    UP NEXT \n\n\r\n                    Heat: Hosts New Orleans on Friday.\n\n\r\n                    Magic: At Washington on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764996818.796431
}