{
  "game_id": "401809787",
  "espn_id": "401809787",
  "date": "Nov 14, 2025",
  "matchup": "NO vs LAL",
  "headline": "Doncic, Ayton and Reaves lead the Lakers past the Pelicans 118-104 to improve to 2-0 in NBA Cup play",
  "body": "NEW ORLEANS -- — Austin Reaves scored 31, Luka Doncic had 24 points and 12 assists, and the Los Angeles Lakers cruised to a 118-104 victory over the New Orleans Pelicans in an NBA Cup game on Friday night.\n\n\r\n              Deandre Ayton made 10 of 11 shots and finished with 20 points, 16 rebounds, two steals and a block for the Lakers, who improved to 2-0 in cup play to remain atop West Group B.\n\n\r\n              Trey Murphy III scored 35 for the Pelicans, who lost their fourth straight game, fell to 0-2 in the in-season tournament, and to a Western Conference-worst 2-10 overall. \n\n\r\n              Rui Hachimura scored 14 and Marcus Smart 13 for the Lakers, who led 65-52 at halftime after Doncic fed Ayton for an alley-oop dunk.\n\n\r\n              Doncic, Ayton and Reaves all scored during an 11-0 third quarter run that pushed Los Angeles' lead to 88-66, a surged capped by Reaves' 16-foot driving floater as he was fouled by Jose Alvarado.\n\n\r\n              The Pelicans briefly trimmed the Lakers' lead to eight when Alvarado and Saddiq Bey hit back-to-back 3s to make it 96-88 with more than eight minutes left.\n\n\r\n              Doncic hit a 12-foot fade and Reaves, who was 11 of 13 on free throws, hit five late foul shots — along with a 13-foot pullup — to help Los Angeles keep New Orleans at bay.\n\n\r\n              Murphy surpassed 34 points for the second time in four games for New Orleans. Jeremiah Fears had 19 points and eight steals, and Herb Jones scored 13, Bey scored 11 and Derik Queen grabbed 10 rebounds.\n\n\r\n              Both teams played without their biggest stars. The Lakers' LeBron James is still working his way back from a preseason bout with sciatica and the Pelicans' Zion Williamson remained sidelined by a recent left hamstring strain.\n\n\r\n              Up next\r\n              Lakers: Visit the Milwaukee Bucks on Saturday.\n\n\r\n              Pelicans: Host the Golden State Warriors on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042626.738631
}