{
  "game_id": "0022400678",
  "espn_id": "401705244",
  "date": "Jan 30, 2025",
  "matchup": "ORL @ POR",
  "headline": "Trail Blazers beat the Magic 119-90 for their 6th victory in 7 games",
  "body": "PORTLAND, Ore. -- — Scoot Henderson had 23 points, seven assists and five rebounds in the Portland Trail Blazers' 119-90 victory over the Orlando Magic on Thursday night.\n\n\r\n              Shaedon Sharpe also had 23 points and Deandre Ayton added 22 points and eight rebounds to help Portland win for the sixth time in seven games.\n\n\r\n              Franz Wagner led Orlando with 24 points. Paolo Banchero had 21.\n\n\r\n              Portland outscored Orlando 21-5 in fast break points and had a 12-5 edge in 3-pointers. \n\n\r\n              The Trail Blazers pushed their lead to 16 on Henderson's layup with 8:26 left in the third. The onslaught continued, with Portland up by 25 points in the quarter.\n\n\r\n              Takeaways\r\n              Magic: The Magic had their lowest-scoring game of the season against Portland a week ago in Orlando. “Seventy-nine points is not what you are looking to do,” Magic coach Jamahl Mosely said. “But we have to continue to defend and turn those turnovers and steals into points. I don’t think we did that.\"\n\n\r\n              Trail Blazers: Henderson is shooting 43.8% on 3-pointers in January. If teams adjust their coverages to account for his shooting, the Blazers would welcome that challenge. “I hope so, I really do. When that happens, they really won’t be able to keep him out of the paint,” coach Chauncey Billups said.\n\n\r\n              Key moment\r\n              Toumani Camara had two blocks on dunk attempts by Banchero in the final two minutes of the first half, energizing the crowd.\n\n\r\n              Key stat\r\n              The Trail Blazers had 23 assists to only 13 for the Magic.\n\n\r\n              Up next\r\n              The Magic are at Utah on Saturday night. The Trail Blazers host Phoenix on Saturday and Monday nights.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997544.186665
}