{
  "game_id": "0022101076",
  "espn_id": "401360895",
  "date": "Mar 21, 2022",
  "matchup": "TOR @ CHI",
  "headline": "DeRozan, LaVine propel Bulls to 113-99 win over Raptors",
  "body": "CHICAGO -- — DeMar DeRozan and Zach LaVine each scored 26 points and Nikola Vucevic had 19 points and 13 rebounds as the Chicago Bulls beat the Toronto Raptors 113-99 on Monday night.\n\n\r\n              DeRozan shot 11 for 14 as the Bulls snapped a three-game losing streak and remained in fifth place in the Eastern Conference.\n\n\r\n              Toronto hung around until LaVine scored six-straight points to break the game open in the third quarter as the Bulls pieced together a 21-8 run. LaVine scored 14 of his 26 points in the third, going 6 of 8 from the floor in that span.\n\n\r\n              “We need (LaVine) to be aggressive,” Bulls coach Billy Donovan said. “We need him to play downhill. We need him to take his shots when they’re there. The thing I love about Zach is, one thing people look at, but he generated a lot of offense for us. He made great passes.”\n\n\r\n              Pascal Siakam led Toronto with 22 points on 8-of-14 shooting and had five rebounds. Fred VanVleet scored 19 points on 7-for-22 shooting from the field and 3-for-12 sniping from 3-point range. Chris Boucher had 19 points, and a team-high 10 rebounds. \n\n\r\n              VanVleet said it was fair to say the Raptors ran out of gas during the third quarter. Chicago took advantage, building its lead as Toronto endured a six-minute scoring drought. \n\n\r\n              “You probably could say that,” VanVleet said. “Give Chicago credit, they were really physical. They pushed us off the line, off our spots a little bit. I think we were begging a little bit for some calls there. ... They really asserted themselves and got out in transition, and we just never really closed the gap after that (15-0) run.”\n\n\r\n              The Raptors, who had won six of seven heading into Monday’s game, remain in seventh place in the Eastern Conference.\n\n\r\n              Toronto forward Thaddeus Young got the deficit under 10 points with a layup with 35.1 seconds left in the third quarter, but LaVine buried a 3-pointer from the left corner to put the Bulls back up by double digits, 84-73, to start the fourth quarter. \n\n\r\n              The Bulls assisted on 28 baskets and turned the ball over just six times, despite Toronto building a 62-48 scoring edge in the paint.\n\n\r\n              Chicago forward Patrick Williams returned to the court for the first time since Oct. 28 after undergoing surgery to repair torn ligaments in his left wrist.\n\n\r\n              “Can’t really put it into words, honestly,” Williams said. “Just having something taken from you for so long, something that you love, to finally be able to get it back and enjoy it again, there’s nothing like it.”\n\n\r\n              TIP-INS\n\n\r\n              Raptors: F Thaddeus Young has brought valuable veteran experience since being acquired from San Antonio in February, according to coach Nick Nurse. “(VanVleet) has gravitated to (Young) a little bit. He’s a real pro. He’s very involved in the game plan and the teaching of the guys already,” Nurse said. ... Toronto was without guard Gary Trent Jr. after he hyperextended his toe late in a 93-88 win over Philadelphia on Sunday. F OG Anunoby was out with a finger fracture, missing his 15th game since Feb. 16. Nurse said Toronto is getting used to filtering players in and out of the lineup due to injuries and acquisitions after an adjustment period earlier in the season. \n\n\r\n              Bulls: After undergoing left knee surgery to repair a torn meniscus in January, G Lonzo Ball will miss more time, according to Donovan. Ball and the medical staff met and decided to stop running and cutting for 10 days in the hope of eliminating pain as Ball also recovers from a bone bruise. “There’s no complications from the surgery ... they’re trying to figure out why he’s having this discomfort, and some of that could be he’s got a little bruising there.” ... Williams didn’t look limited in 11 minutes of first-half action, scoring five points on 2-of-5 shooting, and grabbing two rebounds. He finished with seven points in 19 minutes as Donovan kept him on a 25-minute cap. \n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Cleveland Cavaliers on Thursday.\n\n\r\n              Bulls: At Milwaukee Bucks on Tuesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992704.885866
}