{
  "game_id": "0022300846",
  "espn_id": "401585474",
  "date": "Feb 28, 2024",
  "matchup": "CHI vs. CLE",
  "headline": "DeMar DeRozan scores 35 points, Bulls outlast Cavaliers 132-123 in 2OT",
  "body": "CHICAGO -- — DeMar DeRozan made the big shots down the stretch and Andre Drummond dominated on the glass. It was just enough to lift the Chicago Bulls past one of the Eastern Conference's best teams.\n\n\r\n              DeRozan scored 35 points, Drummond had 26 rebounds and Chicago outlasted the Cleveland Cavaliers 132-123 in double overtime Wednesday night.\n\n\r\n              DeRozan scored 16 points in the 10 extra minutes, helping the Bulls bounce back from a loss to lowly Detroit one night earlier.\n\n\r\n              Nikola Vucevic added 24 points and 13 rebounds. Ayo Dosunmu scored 21. Drummond finished with 17 points and helped the Bulls set an NBA high this season with 74 rebounds.\n\n\r\n              “It just speaks to this team, we continue to fight,” Drummond said. “We gave a good fight. Yesterday, we let our guard down a little bit. We knew what we did wrong. Tonight, we played a team that was very high in the standings and came out ready to play.”\n\n\r\n              The Cavaliers were coming off a wild 121-119 victory over Dallas on Tuesday night, with Max Strus hitting a 59-footer as time expired. Evan Mobley led Cleveland with 25 points and 13 rebounds. Darius Garland scored 23 while making 7 of 14 3s. Donovan Mitchell finished with 19 points, but the Cavaliers came up short after winning 12 of 15.\n\n\r\n              “We had opportunities to seize it,” Mobley said. “We just got to capitalize. Sometimes, games don't go your way so you got to learn from them and try to do better for the next games.”\n\n\r\n              DeRozan missed a turnaround jumper at the end of regulation with the game at 103 after Chicago rallied from 11 down in the fourth. He made three free throws to tie it in the first OT and keyed an 8-0 spurt to start the second OT.\n\n\r\n              DeRozan drove for a layup and made a 3 to put the Bulls on top 120-115. A tip-in dunk by Drummond and free throw by DeRozan stretched the lead to eight, and the Bulls hung on from there.\n\n\r\n              The Cavaliers led 114-110 after Mitchell drove for a layup with 26 seconds remaining in the first OT. But the Bulls weren’t finished.\n\n\r\n              DeRozan drove for a layup. Mitchell made a free throw with 14 seconds remaining to make it a three-point game, only to miss the second attempt\n\n\r\n              DeRozan then got fouled attempting a 3 from the wing and made all three free throws to tie it with 12 seconds remaining. Mitchell pulled up for a 20-footer and missed, sending it to a second overtime.\n\n\r\n              The Cavaliers looked like they were in control, leading 89-78 early in the fourth quarter after Okoro nailed a 3, but the Bulls came roaring back.\n\n\r\n              Vucevic gave Chicago a 98-97 lead with 3:45 remaining when he connected from beyond the arc. It was 100-all when Mitchell nailed a step-back 3 with about 2:15 remaining.\n\n\r\n              Drummond then scored on a put-back to make it a one-point game, and a wild finish to regulation sent the game to regulation. Vucevic missed an open 3 in the final minute, got the ball back and made the second free throw to tie it after missing the first with 38 seconds remaining.\n\n\r\n              Coby White then picked off a bad pass by Mitchell, giving the Bulls a chance to win the game. But DeRozan missed a 21-foot turnaround jumper in the closing seconds.\n\n\r\n              The Bulls were missing a key player with guard Alex Caruso sidelined because of a strained right hamstring. Coach Billy Donovan wasn’t sure about the timeline for his return. That likely hinges on how Caruso responds to treatment he received on Wednesday.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Detroit on Friday night.\n\n\r\n              Bulls: Host Milwaukee on Friday night. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996697.490319
}