{
  "game_id": "0022000367",
  "espn_id": "401267527",
  "date": "Feb 08, 2021",
  "matchup": "CHA vs. HOU",
  "headline": "Ball, Hornets use strong 4th quarter to beat Rockets 119-94",
  "body": "CHARLOTTE, N.C. -- — Everywhere LaMelo Ball has played basketball, people have tried to change his 3-point shot.\n\n\r\n                    But the 19-year-old has steadfastly refused.\n\n\r\n                    “I stick with it. I say, ‘This is how I shoot,'\" Ball said. “I'm confident in it and I feel good letting it go. I came here and they tried to adjust it a little, but I'm like, ‘Ah, this is how I shoot.’\"\n\n\r\n                    And right now, there's no reason to change.\n\n\r\n                    Ball made a career-high seven 3-pointers — most of them from several feet behind the arc — and finished with 24 points, 10 assists and seven rebounds Monday night as the Charlotte Hornets defeated the short-handed Houston Rockets 119-94.\n\n\r\n                    Ball is 21 of 40 from beyond the arc in his last six games.\n\n\r\n                    Miles Bridges had another strong outing with 19 points and 10 rebounds, and Gordon Hayward added 19 points for the Hornets, who opened the fourth quarter on a 19-1 run to blow open a tight game.\n\n\r\n                    Victor Oladipo had 21 points to lead the Rockets, who shot 2 of 19 from the field and scored just seven points in the fourth quarter.\n\n\r\n                    Ball's release point is at his chest, not above his shoulders like most shooters. Hornets coach James Borrego said he had some initial concerns about Ball's form prior to the NBA draft.\n\n\r\n                    But Borrego said that ended when he and general manager Mitch Kupchak watched Ball work out in person after a trip to Los Angeles.\n\n\r\n                    “When we went there, there was just a confidence about him and his shot,” Borrego said. “As I sat there with Mitch I looked over and said 'he's going to be fine.' The kid is confident and believes it is going in. And that is at least half the battle.”\n\n\r\n                    Borrego said he has been most impressed by Ball's range.\n\n\r\n                    “Whether he’s at the line or two feet behind the line, it’s almost effortless,” Borrego said.\n\n\r\n                    The momentum of the game changed when Malik Monk, who scored 14 points off the bench, knocked down a 3-pointer in the waning seconds of the third quarter to give the Hornets a 90-87 lead.\n\n\r\n                    Charlotte then held the Rockets without a field goal for more than 7 1/2 minutes to start the final quarter. It wasn't until 4:18 remained when Oladipo finally broke the drought with a 3 from the wing.\n\n\r\n                    SHORT-HANDED ROCKETS\n\n\r\n                    Houston played without three of its top four scorers — John Wall, Eric Gordon and Christian Wood. Gordon and Wall were given a night of rest, while Wood missed his second straight game with a sprained right ankle. Together, the trio is accounting for more than 59 points per game.\n\n\r\n                    Rockets coach Stephen Silas said he expects Wall and Gordon to play Tuesday night, but said Oladipo will sit out.\n\n\r\n                    “It impacted us a lot,\" Silas said of playing without Wall and Gordon. “Those guys are good defenders. We’re one of the best defensive teams when they’re on the floor. They weren’t on the floor tonight and I didn’t like our defensive approach, so we’re going to need them tomorrow night.”\n\n\r\n                    TIP INS\n\n\r\n                    Rockets: Ben McLemore had 15 points off the bench on four 3-pointers. ... P.J. Tucker picked up three fouls in the game's first eight minutes and didn't score.\n\n\r\n                    Hornets: Point guard Devonte Graham missed his second straight game with a strained groin. ... Charlotte is 10-0 this season when leading entering the fourth quarter. ... Ball's seven 3s tied a rookie franchise record.\n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: At New Orleans on Tuesday night as the second part of a back-to-back.\n\n\r\n                    Hornets: At Memphis on Wednesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997029.441077
}