{
  "game_id": "0022200636",
  "espn_id": "401468791",
  "date": "Jan 13, 2023",
  "matchup": "CHI vs. OKC",
  "headline": "Giddey scores 25, leads Thunder to 124-110 win over Bulls",
  "body": "CHICAGO -- — Josh Giddey matched a season high with 25 points and added 10 rebounds, helping the Oklahoma City Thunder to a 124-110 win over the Chicago Bulls on Friday night.\n\n\r\n              Rookie Jalen Williams scored 22 points and Shai Gilgeous-Alexander added 21 for the Thunder, who have won two straight, four of five and completed a sweep of their season series against Chicago.\n\n\r\n              “I thought we drifted from our identity, especially in the third quarter,” Oklahoma City coach Mark Daigneault said. “But we got it back on track to start the fourth quarter. Those were growth points for us.”\n\n\r\n              Zach LaVine scored 25 points and Nikola Vucevic had 19 points and 11 rebounds as the Bulls lost their third straight. Leading scorer DeMar DeRozan missed a second straight game due to a quadriceps injury suffered in Monday’s loss at Boston.\n\n\r\n              The Bulls trailed by as many as 18 points early in the second half before going on an 18-5 run and closing within 91-90 by the end of the third period. Chicago never did overtake Oklahoma City, which got consecutive baskets off Chicago turnovers to push the lead to 104-94 midway through the final period. \n\n\r\n              “We were able to get the car back on the road,” said Darius Bazley, who came off the bench to add 14 points and three of the Thunder’s 10 steals. “When we get stops like that and teams aren’t even getting shots at the rim, it feels really good.”\n\n\r\n              The Bulls never got closer than eight points the rest of the way.\n\n\r\n              “Self-inflicted wounds,” Bulls coach Billy Donovan said after his team’s 16 turnovers turned into 23 Thunder points. “We knew going in they were a hard-driving team and we needed to stop a little bit shorter and defend one on one.”\n\n\r\n              Giddey said the Thunder’s ability to shake off Chicago’s third-quarter charge shows how far its young core has come.\n\n\r\n              “Twelve months ago, if a team goes on a run like that, maybe we crumble a little bit more; maybe guys go into their shells,” he said. “Tonight guys stood up and were ready for the challenge.\n\n\r\n              “We didn’t flinch when they threw their punch.”\n\n\r\n              Gilgeous-Alexander scored six points during a first-half-ending 18-6 run that gave the Thunder a 72-58 lead at the break.\n\n\r\n              LaVine, who averaged 35.5 points in his last four games, was 14 for 15 from the free-throw line. Coby White added 19 points.\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Oklahoma City has won two straight road games after a six-game skid away from home. … C Mike Muscala made his third start of the season.\n\n\r\n              Bulls: DeRozan (quadriceps) was in street clothes for the second straight game. Coach Billy Donovan said the team doesn’t want to rush him back and risk a setback. The All-Star had played in Chicago’s first 41 games. … G Lonzo Ball (left knee) posted videos of himself dunking during a rehab workout to his Instagram account earlier in the day, but Donovan said a return isn’t imminent. “There’s going to be a significant ramp-up period before he’s ready to play,” the coach added. Ball, who last appeared in a game Jan. 14, 2022, underwent surgery in September.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Brooklyn on Sunday.\n\n\r\n              Bulls: Host Golden State on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994490.464745
}