{
  "game_id": "0021600694",
  "espn_id": "400900115",
  "date": "Jan 27, 2017",
  "matchup": "HOU @ PHI",
  "headline": "James Harden's 51 in historic triple-double lead Rockets past Joel Embiid, 76ers",
  "body": "PHILADELPHIA -- The 76ers closely guarded Houston's potent 3-point threats rather than double-team James Harden, and the Rockets' All-Star guard made them pay with a memorable offensive performance.\nHarden scored 51 points and added 13 rebounds and 13 assists to lead the Rockets to a 123-118 victory over Joel Embiid and Philadelphia on Friday night.\nHarden became the first player in league history with multiple 50-point triple-double performances in a single season. He scored 53 points and added 16 rebounds and 17 assists in a win over the New York Knicks on New Year's Eve.\nThere now have been three 50-point triple-doubles this season (Russell Westbrook has the other one) after there were just six in the first 70 seasons of the NBA.\nHarden, who had 19 of his points in the third quarter Friday night, has posted at least 30 points and 10 assists in 18 games this season. The NBA's second-leading scorer, he finished two points shy of tying his career high from that Dec. 31 game. He was 16-for-28 from the field, including 6-for-11 from 3-point range, while making 13 of 14 free throws.\n\"He played about as good as you can play,\" Houston coach Mike D'Antoni said. \"I've been around a lot of players, but it doesn't get much better than that. I've never seen better than that.\"\nHarden recognized Philadelphia's strategy and took advantage.\n\"Just tried to be aggressive [in] attack mode and make plays for my teammates,\" he said. \"They weren't leaving our shooters, so we had to figure different ways to be aggressive and attack them. In the second half, we figured it out.\"\nHarden had 36 points at halftime.\nNene added 21 points for the Rockets, who snapped a two-game skid while winning for just the fourth time in 10 games.\nEmbiid had 32 points and seven rebounds in his return to the lineup after missing the previous two games with a knee contusion. Embiid, who was questionable until about 45 minutes before tipoff, showed that he was just fine with an emphatic, left-handed dunk over Nene for Philadelphia's first two points, drawing loud cheers from the 76ers' crowd.\n\"You're not going to see a more jaw-dropping play in the league, really,\" 76ers coach Brett Brown said.\nIt was also the 7-foot-2 center's first game since Thursday's announcement that he was not among the reserves chosen for the All-Star Game, which some in Philadelphia considered a snub.\n\"He's a problem,\" Harden said. \"Big, athletic, can shoot the 3. He has an extremely bright future as you can see.\"\nThe streaking 76ers lost for just the third time in the past 11 games.\nThe Rockets were without second-leading scorer Eric Gordon, who missed his second straight game with a back injury.\nBut the relentless Harden made up for Gordon's absence.\n\"You saw a legitimate candidate for MVP,\" Brown said.\nPhiladelphia's coach didn't second-guess his decision not to double-team Harden.\n\"You have to pick your poison,\" he said. \"You say, 'What sword are we going to die on?' And you saw it.\"\nHouston snapped a 61-all halftime tie with a 12-0 run over the first 2:51 of the second half. Harden scored 10 of the points, including a dunk that made it 75-63. Houston's lead reached as high as 13 in the period, and the Rockets entered the fourth ahead 94-82 after Harden's step-back baseline jumper as time expired.\nEmbiid scored eight straight to open the fourth quarter, drawing roars from the capacity crowd that has become the new norm in Philadelphia these days after he hit his second straight 3-pointer to make it 94-90 with 10:47 to play. But the Rockets scored the next six points, and Philadelphia never got closer than four the rest of the way.\nNik Stauskas pulled the 76ers within five at 117-112 with 52.8 seconds to play on a reverse layup. After a miss by Houston, Nene blocked Embiid's 3-point attempt with 20 seconds left to seal the victory.\nEmbiid's health\nEmbiid said afterward that his knee injury is a bone bruise and that doctors said he would need two to three weeks to heal. He injured the knee Jan. 20 versus Portland.\n\"It's a little bit sore,\" Embiid said. \"But I felt great. I think I could have done more to help us win, especially on the defensive end.\"\nElectric atmosphere\nPhiladelphia's home fans were loud and raucous, something that had been missing during the team's rebuild over the previous three seasons.\nHarden took note.\n\"Exciting,\" Harden said. \"Philly fans are always exciting. The atmosphere was good. It got me going a little bit. I'm sure it got my teammates going. It's always fun to play in games like that.\"\nTip-ins\nRockets: D'Antoni assisted Brown for part of last season. ... Houston, which beat the 76ers 115-88 at home on Nov. 14, has won seven straight over Philadelphia. ... Harden has 14 triple-doubles this season.\n76ers: Philadelphia lost at home for the first time in 2017, dropping to 6-1. ... Allen Iverson rang the replica Liberty Bell before the game. ... Among the A-listers seated courtside were Meek Mill, Kevin Hart and Philadelphia Eagles safety Malcolm Jenkins. ... Embiid fell one point shy of matching his career high.\nUp next\nRockets: Conclude a five-game road trip at Pacers on Sunday night.\n76ers: At Bulls on Sunday night.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764995767.0596428
}