{
  "game_id": "0021500861",
  "espn_id": "400828748",
  "date": "Feb 26, 2016",
  "matchup": "CHA @ IND",
  "headline": "Walker hits game-winner to lead Hornets past Pacers, 96-95",
  "body": "INDIANAPOLIS -- The surging Charlotte Hornets know exactly where to go with the ball when the game is on the line.\nKemba Walker scored 22 points and hit the game-winning shot with 2.4 seconds left to lead the Hornets over the Indiana Pacers 96-95 on Friday night.\nMonta Ellis gave Indiana the lead with a layup over Walker with 16.2 seconds to go. Walker then split two defenders above the 3-point line to get to the rim on Charlotte's ensuing possession and sank a left-handed scoop shot over Paul George.\n\"Everyone was counting on me,\" Walker said. \"My teammates, they wanted me to have the basketball.\"\nThe Pacers had a chance at the buzzer, but George's shot from the top of the key missed. George finished with 32 points.\nIndiana coach Frank Vogel said he would have liked to see George attack the rim on the final play.\n\"I want to see him go to the basket in those situations, but he's got to make a basketball play,\" Vogel said. \"He's got to read and feel his man and he thought he could get the step-back.\"\nGeorge said he intended to maneuver into the paint but lost his footing.\n\"I slipped, which screwed up my momentum going to the basket, but I thought I got a good enough look,\" George said. \"Had I not slipped I would have taken it to the basket.\"\nMarvin Williams scored 26 points -- 15 in the third quarter -- and grabbed 13 rebounds for the Hornets, who have won eight of 10. They are tied with Chicago for seventh place in the Eastern Conference, and both teams are 1 1/2 games ahead of Detroit for the final playoff spot.\nCharlotte won for the second time this month at Indiana after dropping 12 straight on the Pacers' home court.\nTrailing most of the game, the Pacers clawed back into it and finally took the lead with 5 1/2 minutes left. Walker, who also had 10 assists, scored nine points in the final 5:08 to help fend off the late Indiana charge.\nWalker is second in the Eastern Conference in scoring since Christmas at 23.8 points per game.\n\"He wants the ball, there's no question about that,\" Hornets coach Steve Clifford said. \"He wants to take the big shot. Make or miss, he has courage.\"\nRookie center Myles Turner scored 15 for Indiana. Ellis finished with 14, and George Hill added 10 points and seven assists.\nIndiana native Cody Zeller finished with 14 points and five rebounds for Charlotte.\nTIP-INS\nHornets: Charlotte also won at Indiana on Feb. 10. ... The Hornets entered averaging 10.3 3-pointers per game and hit 11 shots from behind the arc.\nPacers: George has scored 30 or more 18 times this season. ... The Pacers fell to 18-10 at home. ... Turner is averaging 14.3 points per game since being inserted into the starting lineup 13 games ago. ... Rodney Stuckey played for the first time since Jan. 13 after sitting out with a bone bruise. He had four points and five rebounds. ... The Pacers are 7-8 in games decided by three points or fewer.\nUP NEXT\nPacers: Host Portland on Sunday.\nHornets: At Atlanta on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994366.9080992
}