{
  "game_id": "0021400028",
  "espn_id": "400578320",
  "date": "Nov 01, 2014",
  "matchup": "MEM @ CHA",
  "headline": "Marc Gasol converts 3-point play late to push Grizzlies by Hornets",
  "body": "CHARLOTTE, N.C. -- Marc Gasol isn't reading too much into the Memphis Grizzlies' first 3-0 start.\n\"That's better than being 0-3,\" he said with a shrug of his shoulders.\nGasol scored 22 points, Zach Randolph had 12 points and 12 rebounds and the Grizzlies defeated the Charlotte Hornets 71-69 on Saturday night.\nGasol said the Grizzlies, who played without the concussion-sidelined Courtney Lee, will have to improve dramatically on offense if they hope to keep winning. They beat the Hornets despite shooting 36 percent from the field.\n\"It wasn't pretty,\" Gasol said. \"It felt like a quarter was missing. But we'll take the win.\"\nThe Hornets (1-1) were led by Al Jefferson, who scored 19 points on 8-of-19 shooting. Michael Kidd-Gilchrist had 11 points and 12 rebounds, but the team's big free-agent acquisition, Lance Stephenson, scored two points and didn't play in the fourth quarter.\nThe Hornets gave Stephenson a $27 million, three-year contract in the offseason.\nBut coach Steve Clifford used Gary Neal late in the game. He also seemed to send a message to Stephenson afterwards.\n\"He just didn't play very well,\" Clifford said. \"I coach to win. I went with the team that played the best. The guys that know what they're doing out there and played the best are the guys that played. The guys that continue to play like that will be the guys that play.\"\nStephenson, who has been bothered by a groin injury, stood near the end of the bench for most of the last five minutes and cheered his teammates, although he looked a little perturbed.\n\"I'm frustrated,\" Stephenson said. \"But that's part of being a pro, just learning from your mistakes, getting better every time and have no regrets.\"\nWith the Grizzlies trailing 69-68, Gasol scored off a drive on a pick-and-roll and drew a foul from Marvin Williams for a 3-point play 58 seconds left.\n\"They were playing so far off the pick-and-roll, I made a little space and just drove it to the basket and got lucky and scored,\" Gasol said.\nKemba Walker, who made two big shots including the overtime winner in the opener against Milwaukee, missed a 16-foot jumper with 5 seconds left that would have tied the game.\nThe Grizzlies limited Charlotte's version of the big three -- Jefferson, Stephenson and Walker -- to a combined six points on 2-of-14 shooting to take a 36-30 lead at halftime. Kidd-Gilchrist kept Charlotte in the game with 10 points and 10 rebounds in the first half.\n\"To go 2-1 on your first week I'd be high -fiving you, bot to go 3-0 and beating Indiana on the road is very good,\" Grizzlies coach David Joerger said.\nBENCH PLAY\nGrizzlies' starters outscored opposing starters 171-95 in their previous two games, but the team's bench production had been limited. Vince Carter gave Memphis a boost with nine points, although the Grizzlies' reserves were still outscored 29-20.\nNO DEFENSE\nClifford was visibly upset with his team's play, particularly on defense, and pounded a table several times during his news conference as if slamming home a point. \"The disappointment, to be honest, if we defend in the last three minutes, we win the game,\" Clifford said. \"So we bit on two shot fakes that you can't do in this league. ... Two blown coverages and two things we worked on this morning. We did a good job the whole game but two bad individual defensive plays and two blown coverages in the last three minutes cost us. It's disappointing. Very disappointing.\"\n---\nTIP-INS\nGrizzlies: Joerger said Lee will be \"out a while\" with a concussion. Lee was injured in the first half of Memphis's 97-89 win over Indiana on Friday. Tayshaun Prince started in his place.\nHornets: Bobby Phills' retired No. 13 jersey has returned to the rafters in Charlotte. The Hornets raised Phills' jersey during a ceremony at halftime. Phills' jersey originally was raised at the Charlotte Coliseum on Feb. 9, 2000, following his death in an automobile accident a month earlier. When the Hornets moved to New Orleans, his retired jersey went with the team.\nUP NEXT\nGrizzlies: Host New Orleans on Monday.\nHornets: Play at New York Knicks on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764992200.298472
}