{
  "game_id": "0022200570",
  "espn_id": "401468725",
  "date": "Jan 04, 2023",
  "matchup": "CHI vs. BKN",
  "headline": "Durant scores 44, but Bulls snap Nets' 12-game win streak",
  "body": "CHICAGO -- — DeMar DeRozan and Patrick Williams each scored 22 points, and the Chicago Bulls stopped Brooklyn's 12-game win streak with a 121-112 victory over Kevin Durant and the Nets on Wednesday night.\n\n\r\n              Durant scored 44 points, but Chicago had six players score in double figures. Nikola Vucevic had 21 points and 13 rebounds, and Ayo Dosunmo finished with 17 points. The Bulls had dropped two in a row.\n\n\r\n              “They came to play,” Brooklyn coach Jacque Vaughn said. “They were pretty desperate to get a win, and we needed that same desperation.”\n\n\r\n              Durant rested at the beginning of the fourth quarter and Chicago put together an 8-0 run. Dosunmu stole a pass at midcourt and went in for the jam for a 106-95 lead with 6:46 left.\n\n\r\n              “Ayo brought it defensively,” Bulls guard Zach LaVine said. “Bring the energy, getting steals, getting blocks.” \n\n\r\n              Williams and DeRozan each hit two foul shots in the final minute to help close it out.\n\n\r\n              Durant scored a season-high 28 points in the first half, but Brooklyn trailed 69-59 at the break. He went 15 for 22 from the field for the game, finishing one point shy of his season high against Orlando on Nov. 28.\n\n\r\n              The Bulls, playing without reserve Javonte Green, lost another key guard when Alex Caruso sprained his right ankle with 3:11 left in the first quarter. Caruso missed three games earlier this season due to a concussion and shoulder sprain.\n\n\r\n              LaVine scored 13 points for Chicago, and Coby White finished with 10.\n\n\r\n              “Their top two guys (DeRozan and LaVine) were 12 for 31 for 35 points,\" Durant said. “We can live with that. But Pat Williams made some shots and easy rolls to the rim. Ayo is playing great this year and put pressure on the rim.\" \n\n\r\n              Kyrie Irving scored 25 points for Brooklyn, and Seth Curry had 22. Irving went 1 for 8 from 3-point range.\n\n\r\n              “We could not get over the hump, and a big part of it was that we were playing catchup,” Vaughn said. “A 40-point first quarter (by Chicago) set the tone. A little uncharacteristic by our group.”\n\n\r\n              Nets forward Yuta Watanabe, who entered the game leading the league with a 52.1 3-point percentage, played only six minutes because of foul trouble and scored one point.\n\n\r\n              TIP-INS\n\n\r\n              Nets: Vaughn shared a text message he received from a friend following his selection as the Eastern Conference Coach of the Month for December. “'What's so special about a turtle sitting on top of a fence post? He didn't get there on his own.' So I'm very smart to know that award is the performance of the team, the coaching staff, at the end of the day it was the players,” Vaughn said.\n\n\r\n              Bulls: Coach Billy Donovan stressed that LaVine has been an option on several last-second plays that have went to DeRozan. “I totally trust Zach, and I have no problem with Zach with the ball in his hands and no problem with Zach shooting the ball at the end of games,” Donovan said. “But I think everyone would agree with what DeMar has done at the end of games has been very powerful.” ... Green (right knee soreness) was placed in a treatment program to determine the extent of his injury with hopes of him returning soon, Donovan said.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Visit Pelicans on Friday.\n\n\r\n              Bulls: Visit Sixers on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994494.3259552
}