{
  "game_id": "0021800128",
  "espn_id": "401070809",
  "date": "Nov 03, 2018",
  "matchup": "MIA @ ATL",
  "headline": "Trae Young scores 24 as Hawks beat Heat 123-118",
  "body": "ATLANTA --  On one of the best nights of his young career, Trae Young's favorite pass set up Vince Carter, the league's oldest player.\n\nYoung had 24 points and a career-high 15 assists, Carter's jumper gave Atlanta the lead for good, and the Hawks beat Josh Richardson and the Miami Heat 123-118 on Saturday.\n\nCarter's 17-foot jumper off a pass from the 20-year-old Young broke a 118-all tie.\n\n\"Vince is the man,\" Young said of the 41-year-old Carter.\n\n\"It was crazy, like a little throwback moment for me. From a few guys talking in here after the game, it was a throwback moment for everybody.\"\n\nTaurean Prince and Dewayne Dedmon each scored 15 points for the Hawks, who had dropped four in a row. Young also had six rebounds in his ninth NBA game.\n\nCarter had 12 points despite giving up his starting spot so rookie Omari Spellman could make his first start.\n\n\"It was Vince Carter being a pro, wanting to help some other guys get going and sacrificing,\" Hawks coach Lloyd Pierce said.\n\nRichardson scored 32 points, setting a career high for the second time this week, but Miami was held scoreless in the final three minutes of its third straight loss.\n\nThe Heat trailed by 15 in the third quarter before rallying to a 111-110 lead in the fourth.\n\nPlayers on each team were quick to launch 3-pointers in the fast-paced game.\n\nThe Hawks made 13 of 32 3s, and the Heat connected on 16 of 40, including 6 of 10 by Richardson.\n\nMiami allowed more than 120 points for the third straight game.\n\n\"I feel like there wasn't a whole lot of defense being played both ways,\" Richardson said. \"We let them score too easy.\"\n\nA 12-0 run, capped by a 3-pointer and pullup jumper by Young, gave Atlanta its biggest lead at 86-71.\n\nYoung dribbled through traffic and made a short floater at the buzzer to give Atlanta a 102-93 lead entering the final period.\n\nRichardson's jumper tied it at 116. Following a flagrant foul against Justise Winslow, Young's two free throws got the lead back for Atlanta.\n\nMiami held out point guard Goran Dragic due to persistent pain in his right foot. Dragic, second on the team with 17.7 points per game, had a cortisone shot earlier in the week.\n\nDwyane Wade had 19 points for the Heat.\n\nTIP-INS\n\nHeat: Wayne Ellington made his season debut after returning from a left ankle injury. He finished with five points. ... Winslow had 15 points, 10 rebounds and eight assists in his first start of the season. ... Richardson had 31 points against Sacramento on Monday.\n\nHawks: Spellman had seven points in his first start. ... G Kevin Huerter scored 12 points after spraining his right ankle in Thursday night's loss to Sacramento. ... Atlanta had a season-high 32 assists.\n\nSTRONG START\n\nThe Hawks scored 41 points in the first period and led 74-68 at the break after making 60 percent of their shots from the field. The Hawks shot 52.3 percent for the game.\n\n\"Giving up 40-something in the first quarter, that's hard to come back from in this league,\" Wade said.\n\nJERSEY SWAP\n\nWade and Carter swapped jerseys following the game.\n\nWade, who has announced this is his final NBA season, said he enjoyed the on-court competition with Carter.\n\n\"We were having fun,\" the 36-year-old Wade said. \"Guys our age, that's what we're here for, to enjoy the game. He's a little older than me but we're here to enjoy the game. It was good to have that banter back and forth. The guy can still play. I can still play.\"\n\nUP NEXT\n\nHeat: At Detroit on Monday night.\n\nHawks: At Charlotte on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995272.7926788
}