{
  "game_id": "0021800369",
  "espn_id": "401071050",
  "date": "Dec 07, 2018",
  "matchup": "PHI @ DET",
  "headline": "Butler, 76ers rally without Embiid, beat Pistons 117-111",
  "body": "DETROIT --  The Philadelphia 76ers gave their standout center a night off, fell behind by 15 points on the road -- and then came back to beat the Detroit Pistons anyway.\n\n\"This was our best win of the year under those circumstances,\" coach Brett Brown said.\n\nJimmy Butler scored 38 points, and the 76ers overcame Joel Embiid's absence Friday night, rallying from a sizable third-quarter deficit to beat the Pistons 117-111. Blake Griffin had 31 points and 12 rebounds for Detroit, but the Pistons squandered their 15-point third-quarter lead, as well as a six-point advantage in the fourth.\n\nThe 76ers rested Embiid, who missed his first game of the season, but Detroit couldn't take advantage of the big man's absence. Butler, who also scored 38 points in a loss at Toronto on Wednesday night, had 26 in the second half Friday, but it was Philadelphia's fourth-quarter defense that stood out.\n\nDetroit shot 9 of 26 from the field in the fourth. The Pistons attempted 33 free throws in the first three quarters, but they took only four in the final period as Philadelphia defended the rim impressively.\n\n\"Defense is always going to win games,\" Butler said. \"Especially late in the year, which is what we want to end up playing.\"\n\nThe Pistons led 71-56 in the third before Philadelphia went on a 22-5 run to take the lead. Detroit was up 98-92 in the fourth, but the 76ers went on a 16-2 tear to take control.\n\nThe Pistons were up 100-97 when Detroit coach Dwane Casey received a technical foul arguing a foul call. JJ Redick made the free throw, and then added a 3-pointer to put Philadelphia ahead to stay. The 76ers then ran off another seven points in a row.\n\nGriffin received a technical of his own in the last couple minutes of the game.\n\nPhiladelphia had 30 points off 18 Detroit turnovers.\n\n\"I like our guys' effort. I like our guys' fight,\" Casey said. \"They're scratching and clawing but you have to take care of the ball. If you turn the ball over against any team in the NBA, you're not going to survive very long.\"\n\nTOUGH TO HANDLE\n\nGriffin scored 50 points in an overtime win over Philadelphia in October, and then had 38 in a loss to the 76ers the following month. He filled up the stat sheet again Friday, but Philadelphia held him to only five points in the fourth quarter.\n\nThe teams will meet again Monday.\n\nBIG GAME\n\nMike Muscala scored 18 points for Philadelphia and played key minutes after Amir Johnson fouled out. Muscala had three of the 76ers' 12 blocks.\n\n\"I thought defensively, at the end of the game, those last four or five minutes, I thought he was excellent,\" Brown said. \"We needed it all and his versatility, where he can take Drummond away from the basket and make those perimeter shots.\"\n\nINJURIES\n\nDetroit was missing Reggie Bullock (left ankle sprain) and Ish Smith (right adductor tear), and Stanley Johnson (sore left knee) was a late scratch. In addition to Embiid, the 76ers were also without Markelle Fultz (thoracic outlet syndrome), Justin Patton (right foot surgery) and Zhaire Smith (left foot fracture).\n\nTIP-INS\n\n76ers: Redick and Ben Simmons had 18 points apiece.\n\nPistons: Griffin made 17 free throws in 24 attempts -- both career highs. ... Drummond scored 21 points and Reggie Jackson added 13. ... Detroit was 1 for 13 from 3-point range in the second half.\n\nUP NEXT\n\n76ers: Host Detroit on Monday night.\n\nPistons: Host New Orleans on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994051.9320982
}