{
  "game_id": "401810130",
  "espn_id": "401810130",
  "date": "Nov 23, 2025",
  "matchup": "PHI vs MIA",
  "headline": "Powell, Ware lead Miami Heat to fourth straight win with 127-117 victory over the Philadelphia 76ers",
  "body": "PHILADELPHIA -- — Norman Powell scored 32 points while Kel’el Ware had 20 points and 16 rebounds to help the Miami Heat win their fourth in a row with a 127-117 victory over the Philadelphia 76ers on Sunday.\n\n\r\n              Jaime Jacquez Jr. scored 22 points, and Bam Adebayo contributed 18 for the Heat.\n\n\r\n              Tyrese Maxey had 27 points to pace Philadelphia, which played without former MVP Joel Embiid for the seventh straight game. Embiid (right knee injury management) has missed 10 of 16 contests this season. Maxey, who. entered second in the NBA in scoring at 33.4 points per contest, was coming off a career-high 54 points in Thursday's 123-114 overtime win at Milwaukee. \n\n\r\n              Andre Drummond added 14 points and 23 rebounds for the 76ers. Rookie VJ Edgecombe (left calf tightness) also was sidelined for Philadelphia. \n\n\r\n              This was the first of three contests between the clubs. \n\n\r\n              Miami controlled the contest throughout, but the 76ers got within 105-103 with 8:28 left after Trendon Watford’s layup. The Heat then scored 13 of the next 15 points, capped by Powell’s running layup with 4:40 remaining, to go ahead by 13. \n\n\r\n              The 76ers honored the 25-year anniversary of the 2001 Eastern Conference champions by wearing replica black jerseys from that era. Allen Iverson, who was named MVP that season, was in attendance. Theo Ratliff rang the ceremonial Liberty Bell prior to the contest. Ratliff helped the 76ers to a 41-14 record before a midseason trade sent him to Atlanta for Dikembe Mutombo. \n\n\r\n              Up Next\n\n\r\n              Heat: Host Dallas on Monday night.\n\n\r\n              76ers: Host Orlando on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042679.9261131
}