{
  "game_id": "0021300316",
  "espn_id": "400489189",
  "date": "Dec 10, 2013",
  "matchup": "MIL @ CHI",
  "headline": "John Henson, Bucks top Bulls in matchup of injury-riddled teams",
  "body": "CHICAGO -- John Henson cracked a smile as he headed down the court after his desperate turnaround splashed through the net.\nIt was that kind of night for Milwaukee.\nHenson had 25 points, 14 rebounds and six blocked shots, and the Bucks beat the Chicago Bulls 78-74 on Tuesday in a matchup of slumping teams racked by injuries.\n\n\"We just kept fighting,\" Henson said. \"Man, we just kept fighting. As a young team, a scrappy team out here, that's what we got to do.\"\nBrandon Knight added 19 points and 10 boards for Milwaukee, which had dropped three of four. O.J. Mayo was just 2 for 12 from the field, but had seven assists and made a couple of big plays in the fourth quarter.\nMilwaukee only used nine players due to injuries, and Miroslav Raduljica logged all of 83 seconds. Chicago went with an eight-man rotation after Joakim Noah was sidelined by a bruised right thigh.\n\"It doesn't matter,\" Bulls coach Tom Thibodeau said. \"Everyone who's called upon is capable of doing their job. Eighteen turnovers hurt us. In the first half we had great ball movement with 14 assists. In the second half, we have to do better.\"\nMike Dunleavy scored 18 of his 24 points in the second quarter, but the Bulls struggled on offense in the latter part of their fourth loss in five games. Carlos Boozer, the only starter from the season opener at Miami, had 21 points and 12 rebounds.\n\"This is a winnable game,\" point guard Kirk Hinrich said. \"Just couldn't play well enough to do it.\"\nThe Bucks (5-16) trailed by seven at halftime, but cut the deficit to two heading to the fourth quarter, and then opened the final period with a 10-2 run. Henson's dunk over Tony Snell off a pass from Mayo made it 65-59 with 8:30 to go.\nChicago (8-11) had a chance after Dunleavy made a 3 to trim Milwaukee's lead to 73-72 with 1:59 remaining. But Henson responded with a long turnaround jumper as the shot clock expired, prompting the wide grin as he headed back to play defense.\n\"I guess the basketball gods were with us tonight,\" Bucks coach Larry Drew said. \"It was a hope and a prayer. It went in.\"\nEkpe Udoh then blocked Snell's 3-point attempt, and the Bucks held on for their third road win of the season.\nThibodeau said Noah aggravated the injury during the morning shootaround. He said he thinks the big man will be able to travel to New York for Wednesday's game against the Knicks.\nLuol Deng (left calf tightness) and Jimmy Butler (sprained right big toe) were ruled out earlier in the day. Derrick Rose is likely out for the season after right knee surgery.\n\"They're missing guys. We're missing guys,\" Knight said. \"But at the end of the day, that's how it's going to be (in) NBA basketball. You're never going to have all your guys, more than likely.\"\nIt was the same problem on the other side for Milwaukee, which was without reserve guard Gary Neal due to plantar fasciitis in his left foot. Neal, who played seven minutes in the Bucks' 90-82 loss to Brooklyn on Saturday, did not make the trip to Chicago.\nCenter Zaza Pachulia broke his right foot in last week's 105-98 loss to Detroit, and the Bucks also are playing without injured starters Larry Sanders (thumb) and Caron Butler (knee).\nAll those injuries took a toll on both teams, especially early on. The Bulls shot 25 percent (6 for 24) in the first quarter, and the Bucks struggled to 33 percent (7 for 21) in the second quarter.\nDunleavy helped Chicago find its stride after the sloppy start. He had 10 points in a 12-2 spurt that gave Chicago a 40-31 lead with 2:44 left in the first half.\nDunleavy was 7 for 7 from the field and 3 for 4 at the line in the second quarter. Snell had nine first-half points as the Bulls carried a 42-35 lead into the break.\n\"The main thing is we have to play hard and compete and grind it out,\" Dunleavy said. \"You can do that whether Joakim Noah or Luol Deng or Derrick Rose is in the lineup or not. That's a mindset thing. That's not a skill thing.\"\nGame notes\nIt was the first game of the season between the teams. They split four games last season, with the two wins for each side coming on the road. ... Bulls rookie Erik Murphy made a jumper in the first quarter for his first NBA basket. He played 10 minutes after playing just 15 minutes all season coming into the night.",
  "source": "espn_api",
  "crawled_at": 1764992794.4906518
}