{
  "game_id": "0021601087",
  "espn_id": "400900482",
  "date": "Mar 26, 2017",
  "matchup": "CHA vs. PHX",
  "headline": "Walker scores 31, Hornets beat struggling Suns 120-106",
  "body": "CHARLOTTE, N.C. --  The Charlotte Hornets appear to playing their best basketball of the season heading down the homestretch.\n\nThe big question will be whether it's a case of too little, too late.\n\nKemba Walker had 31 points and nine assists, and the Hornets beat the Suns 120-106 on Sunday for their fourth victory in the last five games. The only loss during that stretch came on a close defeat Saturday night to LeBron James and the Cleveland Cavaliers.\n\n\"This time of year, especially in the situation we're in, the whole idea is to win the game,\" Hornets coach Steve Clifford said. \"And we won the game. We need some help and people will lose and we'll come back Tuesday (against Milwaukee) and try again.\"\n\nDevin Booker, who became the sixth player in NBA history to score 70 points in a loss Saturday night to the Boston Celtics, got off to a slow start but finished with 23 points. TJ Warren had 21 points and 10 rebounds for the Suns, who have lost eight straight.\n\n\"We knew we had to match those guys,\" Walker said. \"They've been playing hard all year. They had some scorers. Everybody knows how hot Devin can get. We all saw the 70-point game he had. We just wanted to be locked into him and play some good team defense.\"\n\nBooker said he was anticipating extra attention from the Hornets -- and he got it.\n\n\"I expect it to be hard from here on out and we're all going to learn from this as a young group,\" Booker said. \"At the end of the day, I think it's going to be good for us.\"\n\nSuns coach Earl Watson wasn't expecting a repeat performance from Booker but was pleased with his 7-for-17 performance.\n\n\"We knew Devin is going to play well pretty much almost every game,\" Watson said. \"It wasn't waiting to see how he responded to last game. ... He's going to come out and just play the right way.\"\n\nMarvin Williams added 21 points and Nic Batum chipped in with 18 points and 10 assists for the Hornets.\n\nCharlotte (33-40) entered the day three games behind Miami for the eighth playoff spot in the Eastern Conference with 10 games remaining and played inspired basketball on a rare weekend matinee home game.\n\nThe Hornets bolted to a 30-7 lead in the first quarter after making 10 of their first 13 shots and led by 22 at halftime.\n\nWilliams sparked the early run, connecting on three 3-pointers.\n\nThe Suns cut the lead to 105-101 with 4  1/2 minutes left on a reverse layup by Warren and some big jumpers by Booker. But Batum knocked down a long 3-pointer from the wing and Walker scored on cutting layup to ignite an 11-0 run to put away the game.\n\nTIP-INS\n\nSuns: Warren had his third double-double of the season. ... Outscored the Hornets 50-30 in the paint.\n\nHornets: Walker became the fourth player in team history to have 50 20-point games in a season.  ... Cody Zeller had four steals.\n\nMKG STEPS UP\n\nHornets defensive specialist Michael Kidd-Gilchrist shut down Booker for the first 10 minutes of the game, not allowing him to score or get into a rhythm.\n\n\"He did a great job,\" Clifford said. \"He was smart.\"\n\nSCOREBOARD WATCHING\n\nThe Hornets keep saying they are trying not to pay attention to what other teams around them -- particularly Miami, Detroit and Chicago -- are doing as they try to catch all three.\n\n\"We don't have much room for error, but we're still here,\" Williams said. \"We're still in it. We've just got to take care of our own business and hopefully we can get a little bit of help from some of those other teams. We have an opportunity to play some of those teams.\"\n\nUP NEXT\n\nSuns: Travel to Atlanta on Tuesday to face the Hawks.\n\nHornets: Host the Milwaukee Bucks on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995466.4506161
}