{
  "game_id": "0022000848",
  "espn_id": "401307644",
  "date": "Apr 16, 2021",
  "matchup": "CHA @ BKN",
  "headline": "Durant, Harris lead Nets to 130-115 win over Hornets",
  "body": "NEW YORK -- — Kevin Durant had 25 points and 11 assists, Joe Harris scored 26 points and the Brooklyn Nets beat the Charlotte Hornets 130-115 on Friday night. \n\n\r\n                    Landry Shamet added 20 points for the Nets. Kyrie Irving had 12 on the day after LaMarcus Aldridge retired after experiencing an irregular heartbeat in a game Saturday. \n\n\r\n                    The Nets connected on 51% of their 3-pointers (21 for 41), with Harris (6 for 9) and Shamet (6 for 11) leading the way.\n\n\r\n                    “When we share the ball we’re tough to beat,” Harris said. “We got a lot of catch-and-shoot 3s tonight. When the 3s go in for us, it opens up a lot of other options.”\n\n\r\n                    Miles Bridges had a career-high 33 points for the Hornets, who were playing without five of their top six scorers. \n\n\r\n                    “I just stayed aggressive,” said Bridges, who shot 13 of 18 overall and 6 of 10 from 3-point range. “A lot of my shots were falling tonight. My teammates did a good job of finding me. They sacrificed, set good screens for me.”\n\n\r\n                    Terry Rozier added 27 points and 10 assists, and Vernon Carey Jr. scored a career-high 21 as the Hornets lost their fourth straight. \n\n\r\n                    The Hornets used an early 23-6 run to take a 27-13 lead. Brooklyn cut it to 35-29 after the opening quarter, then began the second with the first six points to tie it. It remained tied at 61-all at halftime. \n\n\r\n                    “You can’t be comfortable when a team has KD and Kyrie, two of the most gifted scorers who ever played this game,” Bridges added. “And Joe Harris, he can shoot the blood out of the ball.” \n\n\r\n                    The Nets pushed to a 94-89 after three, then opened the final quarter on a 19-5 run to put away the game.\n\n\r\n                    A four-point play by Harris put the Nets up 98-91 early in the quarter. He then extended the lead to 104-93 with another 3-pointer followed by three free throws on the next possession.\n\n\r\n                    Griffin’s flying dunk and following 3-pointer increased the Nets’ advantage to 16 points and the Hornets never got closer than 14 the rest of the way.\n\n\r\n                    “We moved the ball well tonight,” said Nets coach Steve Nash. “They’re a good defensive team, but they do give up a lot of 3s.” \n\n\r\n                    Jalen McDaniels added 12 points and Cody Martin had 10 for Charlotte. \n\n\r\n                    TIP-INS:\n\n\r\n                    Hornets: Charlotte was without F Gordon Hayward – right foot sprain (19.6 ppg), LaMelo Ball – fractured right wrist (15.9), Devonte’ Graham – left quad contusion (14.2), Malik Monk – sprained right ankle (13.1), and P.J. Washington – sprained right ankle (11.6) all did not play. \n\n\r\n                    Nets: James Harden remains sidelined with a right hamstring strain. General manager Sean Marks said Harden is progressing well but couldn’t put a timetable on his return, saying Harden needs another day or two of playing 4-on-4 or 5-on-5 in practice and hopefully would be back soon. \n\n\r\n                    IRON MEN\n\n\r\n                    Harris is the only member of the Nets to have played in each of the team’s 56 games this season. He has also started the most (53). Bridges is the only Hornets’ player to see action in each of the team’s 55 games. His received his ninth start of the season on Friday. \n\n\r\n                    TWICE IS NICE\n\n\r\n                    The Nets are currently 20 games over .500. It is only the second time in franchise history that the team has reached that plateau during the season. The only other time was in 2001-02, when the then-New Jersey Nets finished a franchise-high 22 games over .500 (52-30) and lost to the Lakers in the NBA Finals. \n\n\r\n                    ALDRIDGE RETIRES\n\n\r\n                    Nash said he wasn’t aware of Aldridge’s heart scare Saturday night against the Lakers until the following day. He had mixed emotions about the retirement of the 15-year veteran and seven-time All Star, who would have played an important role for the Nets.\n\n\r\n                    “Most importantly though, he avoided a terrible situation in a sense,” Nash said. “So you feel sad for him that he’s not playing, but you feel happy that he’s made a sound decision and is comfortable with his decision and he can be healthy and have a great life with his family. That’s more important than basketball.”\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Host Portland on Sunday.\n\n\r\n                    Nets: Visit Miami on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764997350.312814
}