{
  "game_id": "401810019",
  "espn_id": "401810019",
  "date": "Nov 03, 2025",
  "matchup": "LAC vs MIA",
  "headline": "Bam Adebayo scores 25 points, Heat hold off Clippers 120-119 following 3rd-quarter surge",
  "body": "INGLEWOOD, Calif. -- — Bam Adebayo had 25 points and 10 rebounds, Norman Powell added 21 points in his return to Southern California and the Miami Heat held off the Los Angeles Clippers 120-119 on Monday night.\n\n\r\n              Andrew Wiggins scored 17 points and Kel’el Ware added 16 to help the Heat end a two-game losing streak and win on the road for the second time in five games. Miami is 1-2 to open a four-game trip.\n\n\r\n              James Harden scored 29 points and Kawhi Leonard added 27 as the Clippers lost at home for the first time in four games this season.\n\n\r\n              Ivica Zubac had nine points and 18 rebounds for Los Angeles. Derrick Jones Jr., Bradley Beal and John Collins each scored 12 points.\n\n\r\n              The Heat shot 54.2% from the floor and made 12 of their 25 3-point attempts to 50% for the Clippers, who were 17 of 41 from long range. Los Angeles had 21 turnovers that the Heat turned into 37 points.\n\n\r\n              Miami led 120-116 after two free throws from Adebayo with 56 seconds remaining. Adebayo missed a shot inside with 26 seconds left and Harden made a 3-pointer on the other end with 20 seconds left to pull the Clippers within a point.\n\n\r\n              The Clippers had a chance to win it, but Leonard missed a 26-foot step-back 3-pointer at the buzzer.\n\n\r\n              The Clippers trailed by as many as 13 points in the third quarter before getting even 105-105 with 9:55 remaining on a 3-pointer from veteran Chris Paul.\n\n\r\n              Up next\r\n              Heat: At Denver on Wednesday night.\n\n\r\n              Clippers: Host Oklahoma City on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042557.88027
}