{
  "game_id": "0021500795",
  "espn_id": "400828682",
  "date": "Feb 10, 2016",
  "matchup": "LAL @ CLE",
  "headline": "Love injured as Cavs down Kobe, Lakers 120-111",
  "body": "CLEVELAND -- With 20,000 fans roaring, Kobe Bryant and LeBron James hugged and seemed to be in a world of their own.\nOne on one.\n\"It was just a lot of mutual respect,\" James said of the embrace. \"Sometimes what is known doesn't need to be said.\"\n\nThe two superstars shared the same floor in Cleveland for the final time on Wednesday night as the Cavaliers, despite playing the second half without Kevin Love, downed the Los Angeles Lakers 120-111 in their last game before the All-Star break.\nKyrie Irving scored a season-high 35 points and James added 29 for the Cavs, who feared Love had re-injured his surgically repaired left shoulder in the first half. However, following the game Love said he only has a \"stinger\" and doesn't expect to miss any time.\nBryant finished with 17 points in his last performance in Cleveland, where many fans cheered his every move and fans serenaded him with \"Ko-be\" chants throughout the night.\nFor James, there has been no player of his era quite like Bryant.\n\"His competitive nature,\" James said when asked what he admires most about Bryant. \"A lot of guys might be bigger, taller or jump higher, but it's something that's in you that gets you to that level.\"\nLou Williams scored 28 to lead the Lakers, who have dropped 13 of 15.\nThe Cavs caught a major scare late in the second quarter when Love quickly left the floor after getting his arm caught under Bryant's while working in the post.\n\"At the time I really didn't know what it was,\" Love said. \"It's like when you get hit in the funny bone in your elbow, it's just shooting pain. It felt like fire was running down my arm. It's just a stinger.\"\nIt's the same shoulder Love had dislocated in the first round of last season's playoffs when Boston center Kelly Olynyk yanked it from the socket while battling for a loose ball. Losing Love disrupted the Cavs' title chase and for a moment Wednesday night, it appeared Cleveland would be without him again.\nCleveland carried a 19-point lead into the fourth quarter, but struggled to put away the lowly Lakers.\nBryant converted a 4-point play and made three free throws to get Los Angeles within 108-100, but J.R. Smith and James made 3-pointers in the final three minutes.\nThe Cavs tastefully saluted Bryant during pregame introductions with a video presentation of some of his best moments. Bryant watched the tribute on the arena's gigantic scoreboard before hearing his name and taking the floor with his teammates. He patted his chest in appreciation as Cleveland's crowd -- dotted with fans wearing Bryant's purple-and-gold No. 24 jersey -- chanted his name.\n\"It felt great to play here so many years and get that type of reaction,\" Bryant said of the crowd's salute. \"It was really special.\"\nBefore the opening tip, Bryant hugged Cleveland coach Tyronn Lue, who won two NBA titles as his teammate in Los Angeles.\nBryant and James started out guarding each other, a matchup NBA fans never got to witness in the Finals and will only see one more time when the Cavs visit the Lakers on March 10.\nBefore the game, Bryant said he's never viewed James as a rival.\n\"I never looked to see what he was doing,\" Bryant said. \"I just felt like we were a completely different generation. I just missed that thing completely. Not like a Magic-Bird sort of thing. From the time he came into the league it was more helping him, giving him direction, advice.\"\nJames said he's sorry he never developed a rivalry with Bryant.\n\"We never had the matchup that everybody wanted, that we wanted,\" he said.\nSAYING GOODBYE\nBryant said there have great moments and some hard ones to handle during his league-wide farewell tour.\n\"That we stink, that's tough,\" he said. \"But being able to say, `thank you' to the fans, it's tough for me to express how I feel. It's hard to put into words how much I appreciate it.\"\nSENSITIVE SHOT\nLakers rookie D'Angelo Russell got drilled in his groin area by a hard pass thrown by James in the fourth quarter. Russell dropped to the floor and stayed there for several moments before he walked gingerly to the bench, where Bryant was laughing at him.\n\"Once I knew he was OK, the jokes write themselves,\" Bryant said.\nACHES AND PAINS\nBryant will make his 16th All-Star game appearance this weekend, but he could use the extra rest.\n\"I feel horrible, my ankles, knees, everything,\" Bryant said. \"This stretch couldn't come at a better time. My ankles hurt. My knees hurt. I'm looking forward to having a complete week where I do nothing.\"\nTIP-INS\nLakers: One of Bryant's roles in his final season is to mentor Russell, the No. 2 overall pick in last year's draft. \"Well, it's like a big brother, or a grandfather,\" Bryant cracked. \"I just talk to him often about the game and the mentality and technique and execution, as well as some of the psychological things that he's going through and how to navigate through those. ... The Lakers have lost eight of nine on the road.\nCavaliers: G Matthew Dellavedova missed his fifth straight game with left hamstring soreness. ... James entered the night trailing Paul Pierce for 15th place on the NBA's career scoring list. ... Because he's played with Bryant and coached James, Lue is as qualified as anyone to compare the two superstars. \"They're both the same,\" he said. \"Kobe is more ready to fight you, he'll cuss you out. LeBron is more by example.\"\nUP NEXT\nLakers: Host San Antonio on Feb. 19.\nCavaliers: Host Chicago on Feb. 18.",
  "source": "espn_api",
  "crawled_at": 1764994263.3809779
}