{
  "game_id": "0022001002",
  "espn_id": "401307808",
  "date": "May 06, 2021",
  "matchup": "LAL @ LAC",
  "headline": "Clippers rout Lakers 118-94, move into No. 3 spot in West",
  "body": "LOS ANGELES -- — Paul George led seven players in double figures with 24 points and the Los Angeles Clippers routed a Lakers team minus LeBron James 118-94 on Thursday night, moving into the No. 3 spot in the Western Conference playoff race.\n\n\r\n                    The loss kept the defending NBA champion Lakers at No. 6. The Staples Center co-tenants could potentially face each other in the first round.\n\n\r\n                    The Lakers have lost four of five, with six games remaining in the regular season. The only thing they've clinched so far is a spot in the new play-in tournament, which James has derided. Still dealing with a high ankle sprain, he will be out again Friday night for a pivotal game at Portland. That season series is tied at one.\n\n\r\n                    “We don’t look at it as something bad,” Anthony Davis said of the play-in format. “We need games to get back accustomed to each other anyway. We don’t want to go that route, but if it happens, it happens.”\n\n\r\n                    Davis was limited to four points on 2-of-9 shooting in nine minutes. He said he tweaked his ankle after stepping awkwardly on the scorer's table in the first. He fell, but got up and stayed in the game. He was later ruled out due to back spasms.\n\n\r\n                    “I know it looked bad, but it's fine,” Davis said of his ankle, adding that his back locked up. He had it worked on and expects to play Friday in what he called the Lakers' biggest game left in the regular season.\n\n\r\n                    “When we’re 100% healthy we are the top team in the league, so we keep that in our minds,” Davis said. \n\n\r\n                    Kawhi Leonard had 15 points, eight rebounds and six asssists, and Ivica Zubac added 14 points and eight rebounds for the Clippers, who have already clinched a playoff berth. They've won two straight after dropping three in a row, and are a half-game ahead of fourth-place Denver in the standings.\n\n\r\n                    “Our intensity was great from jump,” George said. “We got to the paint, made extra plays and defensively we were locked into the game plan.”\n\n\r\n                    Kyle Kuzma led the injury-plagued Lakers with 25 points. \n\n\r\n                    Davis' latest setback comes after he already lost two months recovering from a calf injury.\n\n\r\n                    “I don’t know if we got juju issues around here,” Kuzma said. “Every game is something different — injuries, mishaps. Can’t complain, can’t dwell, can’t have excuses.”\n\n\r\n                    The Clippers shot 63% in the first half, when they led by 24 points. The Lakers' only lead came when Davis scored the game's first basket.\n\n\r\n                    “We’re hanging in there,” Lakers coach Frank Vogel said. “No one is feeling sorry for themselves. We know we've got to be better even under adverse circumstances.”\n\n\r\n                    The Lakers got within four early in the second quarter, but the Clippers responded by scoring 11 straight to restore a double-digit lead that stretched to 65-42 at halftime. DeMarcus Cousins had nine of his 11 points in the second, hitting a 3-pointer and getting a steal and dunk as part of an 8-0 spurt.\n\n\r\n                    The Lakers outscored the Clippers 29-27 in the third, but couldn't make a serious dent in the deficit. Kuzma's 3-pointer drew them within 17 early in the period, when Andre Drummond picked up his fourth and fifth fouls. \n\n\r\n                    Kuzma played part of fourth with the Lakers' second unit, which scored all of the team's 23 points in the period.\n\n\r\n                    The Clippers were better on the boards (47-34) and at the free throw line, making 23 of 26. The Lakers hit 18 of 29.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Alex Caruso had eight points and seven assists in his second start of the season at guard. ... Talen Horton-Tucker (right calf strain) sat out and will be out Friday, too. ... Also missing the game was Dennis Schröder (health and safety protocols). ... It's possible Jared Dudley, out since March 15 with a right MCL tear, could still play this season. He has returned to the court.\n\n\r\n                    Clippers: Swept the season series, winning by seven, 18 and 24 points. ... Made just two 3-pointers in the second half. ... Amir Coffey remained out due to health and safety protocols. \n\n\r\n                    WHERE'S LBJ?\n\n\r\n                    James hasn't been on the Lakers' bench the last two games. He won't travel with the team to Portland, either. Vogel said there isn't a medical reason why James isn't present.\n\n\r\n                    “He's just not here,” the coach said.\n\n\r\n                    SLOPPY PLAY\n\n\r\n                    The Clippers committed 22 turnovers, with five each by George and Leonard. Coach Tyronn Lue wasn't happy his team gave up 30 points on miscues, calling it “just messing around too much.”\n\n\r\n                    “We’ll be all right,” Leonard said. “Two of my turnovers were offensive fouls. That’s just being aggressive, physical. We can live with that.”\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Visit the Portland Trail Blazers on Friday in the second game of a back-to-back.\n\n\r\n                    Clippers: Host the New York Knicks on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997276.109714
}