{
  "game_id": "0022200421",
  "espn_id": "401468576",
  "date": "Dec 14, 2022",
  "matchup": "CLE @ DAL",
  "headline": "Mitchell leads Cavs to 105-90 win over 2022 playoff foe Mavs",
  "body": "DALLAS -- — Donovan Mitchell said he was thankful, in a strange way, for the playoff loss to Dallas last season because it helped send him to Cleveland.\n\n\r\n              The smile said there might have been a bit more adrenaline flowing for the first meeting since then. \n\n\r\n              Mitchell scored 34 points facing Luka Doncic and the Mavericks for the first time since his final game with Utah last April, and the Cavaliers rolled to a 105-90 victory Wednesday night.\n\n\r\n              The Jazz lost to Dallas 98-96 at home in Game 6 of the first round in the Western Conference, then Mitchell switched to the East as the centerpiece of a blockbuster offseason trade that vaulted the Cavaliers into the conversation of title contenders.\n\n\r\n              “It could have been anybody,” Mitchell said. “I think for me it’s just understanding at the end of the day, they’re kind of the reason I’m in Cleveland. So I’m thankful I’m here. I’m glad to be here.”\n\n\r\n              Cleveland had slipped a bit after a strong start, thanks in part to eight losses in the past nine road games, including a surprising defeat at San Antonio to start a two-game Texas swing.\n\n\r\n              The Cavs found a fix with a 17-0 run in the first half, and now gear up for a season-high six in a row at home, where they are 12-2, starting with Indiana before seeing Dallas again Saturday.\n\n\r\n              “What we do, when we do it right, travels,” Cleveland coach J.B. Bickerstaff said. “Defense goes everywhere. With us, our defense sets the tone for everything else we do.”\n\n\r\n              Doncic scored 30 points and had the Mavericks within nine late in the third quarter and midway through the fourth. \n\n\r\n              Mitchell answered Dallas' fourth-quarter surge with a 3-pointer, and the Cavs led by at least 10 the rest of the way. \n\n\r\n              Mitchell was 13 of 20 overall and 6 of 9 from 3 as the Cavs shot 53%. \n\n\r\n              Lamar Stevens scored 18 points and was part of a strong defensive first half that limited Doncic to 4-of-13 shooting as Dallas shot 35% and trailed by 19 before the break against one of the NBA's best defenses.\n\n\r\n              “You could look at the subs. You could look at a lot of things,” Dallas coach Jason Kidd said. “I just think that we just couldn't get in sync. We just couldn’t put the ball in the basket.”\n\n\r\n              Cleveland big men Jarrett Allen and Evan Mobley had 14 points apiece and limited Doncic's ability to get to the rim, a key facet for the NBA's scoring leader. \n\n\r\n              “They have a pretty big team,” said Doncic, who finished 9 of 23 and was held below his averages with five rebounds and six assists. “And a great team.”\n\n\r\n              Christian Wood scored 20 points for Dallas. \n\n\r\n              COUNT TO FIVE\n\n\r\n              Darius Garland, who scored 12 points, finished the third quarter with three free throws to get Cleveland's lead back to 15. The third freebie was a technical because Dallas had four players on the court coming out of a timeout used for an unsuccessful challenge on Doncic's foul of Garland.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Cleveland had four consecutive road wins as part of an 8-1 start. Five straight road losses followed. ... Caris LeVert scored 11 of the Cavs' 13 bench points as Cleveland went just eight deep before emptying the bench in the final two minutes. ... Mobley had seven rebounds and six assists.\n\n\r\n              Mavericks: G Josh Green missed a third consecutive game with a right elbow sprain, and F Maxi Kleber was out for the second time in three games. Kleber had a sprained right knee this time after right foot soreness kept him out Saturday at Chicago. ... Doncic set a franchise record with a 35th consecutive game with at least 20 points.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Cleveland swept the four-game season series from the Pacers last season for the first time since 2007-08.\n\n\r\n              Mavericks: A three-game homestand ends Friday against Portland before a four-game trip that starts in Cleveland, then continues with consecutive games at Minnesota.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995247.598568
}