{
  "game_id": "0022400442",
  "espn_id": "401705008",
  "date": "Dec 30, 2024",
  "matchup": "CHI @ CHA",
  "headline": "Coby White, Torrey Craig lead the Bulls past the Hornets in overtime, 115-108",
  "body": "CHARLOTTE, N.C. -- — Coby White narrowly missed his first career triple-double, finishing with 23 points, 10 rebounds and nine assists, and Torrey Craig scored 18 with five 3-pointers after halftime as the Chicago Bulls held on to beat the Charlotte Hornets 115-108 in overtime Monday night.\n\n\r\n              Nikola Vucevic added 16 points and 13 rebounds for the Bulls (15-18).\n\n\r\n              Miles Bridges had 31 points, 12 rebounds and eight assists for the Hornets (7-25), who’ve lost 16 of 17.\n\n\r\n              Trailing by 3 in regulation, Bridges missed a corner 3 to tie it and Vucevic was fouled. But the Bulls center missed both free throws, giving Charlotte another chance. This time, Bridges connected on a leaning 3-pointer with 2 seconds left to send the game into OT.\n\n\r\n              The extra period was all Chicago.\n\n\r\n              The Bulls raced to an eight-point lead as White scored on a drive and Vucevic and Craig knocked down 3s.\n\n\r\n              The Ball brothers matchup never materialized. LaMelo missed the game wrist soreness. Brandon Miller (sprained ankle) also sat for the Hornets. Zach LaVine (toe soreness) and Ayo Dosunmu (soleus strain) were out for Chicago.\n\n\r\n              Takeaways\r\n              Bulls: Craig didn't play in the first half, but was a huge spark after the break. He finished 6 of 10 from the field and 5 of 7 from 3-point range. \n\n\r\n              Hornets: Guard Tre Mann will miss at least another two weeks with disc irritation. Mann is averaging 14.1 points off the bench, but hasn't played since Nov. 21.\n\n\r\n              Key moment\r\n              Patrick Williams knocked down a corner 3 off an assist from Lonzo Ball with 49 seconds left in overtime to push the Chicago lead to seven. He had 17 points. \n\n\r\n              Key stat\r\n              LaMelo Ball has now missed 116 of Charlotte's last 196 games over the past three seasons.\n\n\r\n              Up next\r\n              The Wizards host the Bulls on Wednesday night. The Hornets visit Detroit on Friday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997080.611372
}