{
  "game_id": "0021501158",
  "espn_id": "400829045",
  "date": "Apr 05, 2016",
  "matchup": "CHI @ MEM",
  "headline": "Randolph's double-double leads Grizzlies past Bulls, 108-92",
  "body": "MEMPHIS, Tenn. -- The Memphis Grizzlies solidified their grip on a Western Conference playoff spot, while the Chicago Bulls saw their postseason chances slip further away.\nDespite missing several key players, the Grizzlies forced the Bulls out of their offense, stymied Chicago's leading scorer and captured a 108-92 victory on Tuesday night.\nMemphis snapped a six-game losing streak and remained in the Western Conference's fifth playoff spot.\n\"It was a great win,\" said Zach Randolph, who led the Grizzlies with 27 points and 10 rebounds. \"We've been searching, and we've been desperate for a win.\"\n\nVince Carter added 17 points as Memphis displayed a strong defense missing in recent games. The Bulls, who had won three of four, never got the deficit under double digits in the fourth quarter of a loss that damaged their playoff hopes.\nChicago remained two games behind the Detroit Pistons for the final playoff spot in the Eastern Conference. The Pistons lost 107-89 at Miami.\n\"It was very disappointing to throw away an opportunity like this, especially with Detroit losing,\" Bulls coach Fred Hoiberg said.\nNikola Mirotic led Chicago with 20 points, going 6 of 9 from 3-point range. Pau Gasol had 17 points and 10 rebounds.\nDerrick Rose had 12 points and eight assists, while Bobby Portis also finished with 12 points.\n\"They just played like they wanted to get into the playoffs,\" Rose said of the Grizzlies. He added he was baffled by the Bulls' lack of effort.\n\"I think everyone was surprised,\" Rose said. \"I still can't believe it.\"\nBulls leading scorer Jimmy Butler was held scoreless through three quarters before finishing with five points, converting only 2-of-8 shots and missing all four shots outside the arc.\nThe Grizzlies caused 20 Chicago turnovers, leading to 38 Memphis points. Tony Allen, who guarded Butler much of the night, had four of Memphis' 13 steals in the game.\n\"We know he's prolific,\" Allen said of Butler. \"I thought I tried to limit his touches. . I just locked in, keyed in and tried my best to compete for the whole 48 minutes. Well, the minutes I was out there.\"\nMatt Barnes scored 16 points, and Jordan Farmar had a season-high 15 for Memphis, which has stumbled down the stretch, playing without key starters Marc Gasol and Mike Conley, both done for the season.\nMemphis, which led by as many as 22 in the third quarter, still held a 91-70 lead after a pair of free throws from JaMychal Green with 8:45 left. But the Bulls clicked off the game's next 10 points to make it interesting. Mirotic's 3-pointer near the 6-minute mark capped the run and made it 91-80.\nThat was as close as the Bulls could get.\n\"If we come out and play like that every game,\" Randolph said, \"we give ourselves a chance to win even with the circumstances of our team.\"\nTIP-INS:\nBulls: Rose, who missed his previous two games with a left elbow contusion, played 35 minutes. ... F Taj Gibson missed his fourth game with a rib contusion. E'Twaun Moore missed his second with a left hamstring injury. ... It marked only the fourth time this season Butler was held under double digits. ... The Bulls are in danger of missing the postseason for the first time since the 2007-08 season.\nGrizzlies: Memphis avoided its first seven-game losing streak since November, 2009. ... Randolph recorded his 17th double-double of the season. ... Memphis reserve G Lance Stephenson, a contributor of late, did not play (coach's decision). ... The win assured Memphis of its sixth straight winning season.\nRARE ROSE APPEARANCE\nRose, who played one season at the University of Memphis, made a rare road appearance against the Grizzlies. In his previous seven seasons, Rose played only twice in Memphis, during the 2011-12 season and his rookie year of 2008-09.\nSPEAKING OF APPEARANCES\nPau wasn't the only Gasol in the building. Marc Gasol, who is out for the season with a right foot fracture, was shown on the scoreboard sitting in a suite during the first half. It was the first time Gasol has been seen at a game since he injured the foot Feb. 8 against Portland.\nUP NEXT\nBulls: Visit Miami Heat on Thursday\nGrizzlies: Visit Dallas Mavericks on Friday",
  "source": "espn_api",
  "crawled_at": 1764993893.125171
}