{
  "game_id": "0022200820",
  "espn_id": "401468975",
  "date": "Feb 07, 2023",
  "matchup": "DEN vs. MIN",
  "headline": "Jokic posts triple-double by halftime, Nuggets rout Wolves",
  "body": "DENVER -- — Nikola Jokic may not always dazzle with his athleticism. He sure does with his numbers.\n\n\r\n              Jokic posted his 19th triple-double of the season by halftime and the Denver Nuggets rode a 49-point first quarter to a 146-112 rout of the Minnesota Timberwolves on Tuesday night.\n\n\r\n              Jokic finished with 20 points, 16 assists and 12 rebounds. It was the second time in his career the big man has notched a triple-double by halftime. Jokic took a seat late in the third quarter with the Western Conference leaders ahead by a large margin.\n\n\r\n              “It’s incredible he had a triple-double in the first half,\" Nuggets coach Michael Malone said. “LeBron (James) did it with just so much athleticism and Nikola does it with much un-athleticism — but equally as effective.\"\n\n\r\n              Denver led 49-19 after the first quarter — including a 32-2 run — as the Nuggets shot 79.2% from the floor. The 49 points tied for the second-most in a quarter in the franchise's NBA history. Michael Porter Jr. led the way by scoring 19 of his 30 points in the opening period. \n\n\r\n              Aaron Gordon added 24 for the Nuggets, who set season highs in points and assists (44). \n\n\r\n              “Everybody who was in today's game was kind of doing the simple things,” Jokic explained. \"We didn’t do anything complicated. So we didn’t turn the ball over, and we were just playing the right way.”\n\n\r\n              Anthony Edwards and Luka Garza both had 19 points for Minnesota. D’Angelo Russell was ejected after picking up two technical fouls in the third quarter. He finished with 10 points.\n\n\r\n              “We didn’t play with a lot of physicality. It wasn’t there early,” Timberwolves coach Chris Finch said. “Bunch of bad turnovers to start the game, then transition was a disaster. Their shot-making, they got hot and it was over. They kicked our butt in every way you can.” \n\n\r\n              It was much different than Sunday in Minnesota, where the Timberwolves cruised past Denver 128-98. But in that game, the Nuggets were without four starters: Jokic, Kentavious Caldwell-Pope, Jamal Murray and Gordon.\n\n\r\n              Murray also missed Tuesday's game due to inflammation in his right knee. He was sidelined all last season as he recovered from a torn ACL in his left knee.\n\n\r\n              The Nuggets had 12 players who scored at least five points and the team finished at 62.4% shooting from the field.\n\n\r\n              “We had a night where we were firing on all cylinders,” Malone said. “When we play like that, it’s a lot of fun to watch.”\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: F Kyle Anderson was sidelined with back spasms. ... G Austin Rivers served the second of his three-game suspension for his part in last Friday’s fight between Minnesota and the Orlando Magic. \n\n\r\n              Nuggets: F Zeke Nnaji was out with a sprained right shoulder. ... G Bruce Brown appeared to turn his ankle early in the game, but returned and finished with nine points. ... It was Jokic's 95th career triple-double. ... Porter was plus-43 for the game. “When I told him plus-43, his smile was ear to ear,” Malone recounted.\n\n\r\n              TRADE TALK\n\n\r\n              Nuggets guard Bones Hyland didn't play as his name surfaces in trade speculation. The trade deadline is Thursday.\n\n\r\n              “Bones is one of my favorite players,” Porter told the media contingent during the morning shootaround. “I wish he would stay here. I wish it could be figured out.\"\n\n\r\n              KAT APPEARANCE\n\n\r\n              Timberwolves center Karl-Anthony Towns joined the team on the trip, but there’s no timetable for his return from a strained right calf.\n\n\r\n              “It’s good for him to get back in the mindset of being around the team, start to fall into the rhythm of what that is,” Finch said. “Just having him around has been great.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Utah on Wednesday night.\n\n\r\n              Nuggets: Start a three-game trip Thursday at Orlando.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994691.822185
}