{
  "game_id": "0022300329",
  "espn_id": "401584957",
  "date": "Dec 15, 2023",
  "matchup": "ORL @ BOS",
  "headline": "Celtics beat Magic 128-111, remain unbeaten in Boston for the season",
  "body": "BOSTON -- — The Boston Celtics keep winning at home. \n\n\r\n              And this time they did it without their top three big men.\n\n\r\n              Jayson Tatum scored 30 points, Payton Pritchard added 21 off the bench and the Celtics remained unbeaten in Boston this season with a 128-111 victory over the Orlando Magic on Friday night. The Celtics were playing on back-to-back nights — their third game in four days — and without Kristaps Porzingis, Al Horford and even Luke Kornet. \n\n\r\n              “We had to change our game a little bit,” said Pritchard, who went 6 for 7 from 3-point range and led a bench that outscored Orlando's 47-28. “When you have guys like KP and Al and we get in half-court sets, we need them for sure. But not having them we had to .. use our speed to our advantage.” \n\n\r\n              Porzingis and Kornet were scratched with muscle tightness, and the 37-year-old Horford got the night off after playing 23 minutes in Thursday night’s win over Cleveland.\n\n\r\n              The victory was the Celtics’ 13th straight in Boston — the second-longest streak to start a season in franchise history. Bill Russell, Bob Cousy and Tommy Heinsohn led Boston to 17 home wins in a row to open the 1957-58 season.\n\n\r\n              The Celtics have not lost at home in 20 regular-season games dating to March 5 of last season. (They did lose in last season’s playoffs, including a Game 7 to the Miami Heat in the Eastern Conference finals.) \n\n\r\n              “We’ve dropped some games that we should have, or we didn’t want to, over the years at home,” said Jaylen Brown, who scored 18. “The mentality is: You can’t skip any steps. Every shootaround, every practice, every warmup, any time you’re walking to the bus, you’ve got to be aware of what the job is, what the ultimate goal is, and what our mission is. ... I think that’s why we’ve been able to have such a good run at home.”\n\n\r\n              Derrick White scored 19 points with eight assists and four steals, Sam Hauser also had four steals and Neemias Queta — Boston’s only available 7-footer — blocked three shots. Six-foot-6 Lamar Stevens started at center, and Neemias Queta, playing in his fourth game of the year, blocked three shots.\n\n\r\n              “It’s great for them when they get their opportunity, they come out and they ball,” Brown said. “Games like this are big for those guys.”\n\n\r\n              Jalen Suggs scored 19 points and Goga Bitadze had 15 points and 11 rebounds for the Magic, who had beaten the Celtics four times in a row. One of them was an In-Season Tournament game in Orlando – Boston’s only loss in the group stage.\n\n\r\n              The Celtics missed their first eight 3-point attempts before Pritchard sank one with five minutes left in the first quarter to cut a six-point deficit in half. He added another 30 seconds later and one more as the final basket of the quarter during an 18-7 closing run that gave Boston a 30-24 lead.\n\n\r\n              Orlando came within one point early in the second on back-to-back 3s by Cole Anthony before Boston scored 16 of the next 21 points to pull away. The Celtics led by as many as 16 points in the second quarter and 25 points in the third. \n\n\r\n              UP NEXT\n\n\r\n              The teams meet again on Sunday in Boston.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995727.122763
}