{
  "game_id": "0021900336",
  "espn_id": "401160978",
  "date": "Dec 08, 2019",
  "matchup": "CHA vs. ATL",
  "headline": "Trae Young scores 30 points, Hawks beat Hornets 122-107",
  "body": "CHARLOTTE, N.C. --  Trae Young took a knee to the face, then returned to deliver a knockout blow to the Hornets.\n\nYoung turned in perhaps his most complete game of the season with 30 points, nine assists and six rebounds and the Atlanta Hawks beat Charlotte 122-107 on Sunday night for their second victory in three games after a 10-game losing streak.\n\n\"I thought I was going to be out forever,\" a fat-lipped Young said about the blow. \"But I just cut my lip though. It felt worse than it looks.\"\n\nJabari Parker added 19 points and Vince Carter had 17 off the bench on 7-of-9 shooting to help the Hawks improve to 6-17. Center Alex Len finished with 13 points and 10 rebounds and played a big role in helping turn the tide of the game in the third quarter.\n\nBut it was Young who provided the daggers.\n\nHe had 20 points in the second half, including 14 in the decisive fourth quarter in which the Hawks blew open a game in which they trailed at halftime.\n\nThis was Young's 10th 30-point game of the season, but only the second time the Hawks have won when he's reached that scoring plateau.\n\n\"I love it, whenever we win that's all that matters to me,\" Young said. \"If I play good and we win, I feel great. Play good and we lose, I'm mad.\"\n\n\"I thought that was his best game of the year,\" Hawks coach Lloyd Pierce said. \"He had leadership on both side of the floor. He was engaged. He was yelling out their plays and barking to us. When you're locked in on both side of the ball and leading your team, I just thought it was his best game as a floor general.\"\n\nThe 7-foot Len scored 11 points in the third quarter after being shut out in the first half. He played aggressive, scoring on a 3 from the top of the key, a pick-and-roll dunk from Carter and was strong on the offensive glass, helping give the Hawks a five-point lead entering the fourth quarter. From there, Young took over as the Hawks broke open the game with a 19-8 run to start the fourth quarter. Young was 5 of 7 from the field in the final quarter with two 3-pointers.\n\nMiles Bridges and P.J. Washington each had 20 points to lead the Hornets.\n\nCharlotte has lost three of four during a five-game homestand.\n\nWashington left the game midway through the fourth quarter after rolling his right ankle on a drive. Its unclear if he will miss any time.\n\n\"I just thought we were going through the motions in the second half,\" Washington said. \"It felt like we could have put them away, but we just let them hang around, they got on a run and started making shots and they just put us away.\"\n\nTIP INS\n\nHawks: DeAndre Hunter returned after missing a game because of a dislocated right index finger. He had 10 points and five assists. ... Atlanta's backups outscored Charlotte's 57-36.\n\nHornets: Marvin Williams did not play due to a knee injury. He tried to warm up before the game, but wasn't able to go. ... Shot just 40% from the field. ... Scoring leader Devonte Graham had a rough night shooting, finishing with 12 points on 4-of-17 shooting. He had eight assists.\n\nCARTER STILL HAS IT\n\nThe 42-year-old Carter still has what it takes to bring the crowd to its feet.\n\nReturning to North Carolina, where he played college ball, Carter always gets a little more amped. He made one move to the basket and finished with his left hand, drawing \"ooohs\" from the crowd.\n\n\"I mean the stuff he did today was unbelievable,\" Len said. \"He had steals, was making moves, spin and step back making 3s. It was just great to see. When he was playing that way we all just picked it up and played with it like it was contagious.\"\n\nKIDD-GILCHRIST RETURNS\n\nMichael Kidd-Gilchrist has spent the majority of the season on the bench, but did see his most extensive action against the Hawks and scored seven points in nearly 23 minutes.\n\n\"I was giving MKG a look,\" Hornets coach James Borrego said of the former No. 2 pick in the NBA draft. \"He's the one guy that has stayed ready. He's working and I went with him tonight instead of Nic (Batum). That's where we're at.\"\n\nBatum, the team's highest-paid player at more than $20 million per season, did not play at all.\n\nUP NEXT\n\nHawks: At Miami on Tuesday night.\n\nHornets: At Washington on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996089.425291
}