{
  "game_id": "0021800126",
  "espn_id": "401070807",
  "date": "Nov 03, 2018",
  "matchup": "CHA vs. CLE",
  "headline": "Lamb scores 19, Hornets rout Cavaliers 126-94",
  "body": "CHARLOTTE, N.C. --  This was the effort Hornets coach James Borrego was hoping to get from Jeremy Lamb when he named him the team's starting shooting guard before the season.\n\nLamb had a season-high 19 points and eight rebounds, and Charlotte made light work of the Cleveland Cavaliers, winning 126-94 on Saturday night.\n\nBorrego said Lamb was \"fantastic,\" and now wants to see him bring that same aggressive attack-the-basket mentality every night.\n\n\"This is where I see Jeremy helping us,\" Borrego said. \"I think he fits in that starting unit. ... I loved his aggressiveness tonight, getting to the rim. I think he got to the paint more than anybody tonight. If people want to put two guys on Kemba (Walker) that's his time to attack and a lot of his attacks and aggressiveness now are in transition.\"\n\nBorrego said his only concern with Lamb entering the season was if he could guard the opposing team's shooter night after night. He's had some help so far from Nic Batum, but it's clear he has improved in that area.\n\n\"Night after night at the two guard position you have to be ready to guard,\" Lamb said. \"I've been working to try to keep getting better on both ends of the floor. Defensively is a big thing I need to work on, and I'm gonna keep working.\"\n\nTwo-time All-Star Kemba Walker had 18 points and Malik Monk added 16 for the Hornets, who improved to .500 on the season. Charlotte had balanced scoring throughout, with seven players finishing in double digits, including five off the bench.\n\nJ.R. Smith scored 14 points for the struggling Cavaliers (1-8), who are playing without the injured Kevin Love and put up very little resistance on defense.\n\nThe Hornets looked sluggish early on, but broke the game open late in the third behind a 26-11 run that made it a 20-point game.\n\nTony Parker, who has been a big addition for the Hornets as a player and as a leader of the second team, led the way during the key stretch, scoring on a pair of floaters and then delivering a perfect alley-oop pass to Monk, who soared above the rim after losing his man on a backdoor cut.\n\nUnlike Thursday night, when the Hornets surrendered a 19-point third quarter lead to Russell Westbrook and the Thunder, Charlotte had no intention of letting this one slip away. They quickly extended the lead to 29 points when Walker knocked down his fourth 3-pointer with 7:14 remaining in the game. He exited the game shortly after.\n\nTIP INS\n\nCavaliers: Were outrebounded 49-28. ... Kyle Korver had 11 points, with three 3-pointers.\n\nHornets: Owner Michael Jordan took in the game courtside, sitting at the end of the Hornets' bench. ... David Tepper, the owner of the other major sports franchise in the city, the NFL's Carolina Panthers, also attended the game.\n\nBENCH GETTING IT DONE\n\nThe Hornets entered the game second in the NBA in bench scoring and got it done again against the Cavs with five reserves scoring in double digits. Borrego said he feels like the second unit is establishing an identity, adding that \"I love our bench.\"\n\n\"They are playing with haste, playing with urgency,\" Borrego said. \"Tony Parker understands what we're trying to get done offensively and getting Malik Monk in the right spots.\"\n\nDIFFERENT LOOKS\n\nCavaliers acting head coach Larry Drew used several different combinations on the floor throughout the night, but nothing seemed to work.\n\n\"This team is obviously going in a different direction than it's been the last four years,\" Drew said of the post-LeBron James era. \"As a coach, you still have to find what works. And right now I don't know what works for this team. Trying to mix it up and give it a different look as far as playing guys and different combinations. \"\n\nUP NEXT\n\nCavaliers: At Orlando on Monday.\n\nHornets: Host Atlanta on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994434.980979
}