{
  "game_id": "0022200057",
  "espn_id": "401468212",
  "date": "Oct 26, 2022",
  "matchup": "ATL @ DET",
  "headline": "Trae Young scores 35 points, Hawks beat Pistons 118-113",
  "body": "DETROIT -- — Trae Young scored 35 points and the Atlanta Hawks beat the Detroit Pistons 118-113 on Wednesday night to open a two-game set at Little Caesars Arena.\n\n\r\n              The team will meet again Friday night.\n\n\r\n              “We found a way to get stops at the end and we found a way to make baskets,” Young said. “That's all that matters.”\n\n\r\n              John Collins added 19 points, 10 rebounds and four blocks, and De'Andre Hunter had 17 points to help the Hawks improve to 3-1.\n\n\r\n              “We knew we all needed to bring more energy tonight,” said Clint Capela, who had eight rebounds and four blocked shots in the second half. “For me, that's going to be blocking shots, playing defense and getting after rebounds.”\n\n\r\n              Bojan Bogdanovic scored 33 points for Detroit. The Pistons have lost four in a row after an opening victory. Cade Cunningham added 26 points, seven rebounds and six assists, but had seven turnovers.\n\n\r\n              “I think we needed a little more organization down the stretch,” Cunningham said. “We needed to take care of the ball and get the shots we wanted. I thought we got away from our game plan a little bit, and that includes rebounding and defense.”\n\n\r\n              Pistons coach Dwane Casey was pleased by his team's performance one night after a 120-99 loss in Washington.\n\n\r\n              “This was a different team than what we saw last night,” he said. “It was night and day in terms of execution and effort, but we just had a few too many mishaps down the stretch. We have to learn how to close out games.”\n\n\r\n              Bogdanovic's two 3-pointers pulled Detroit to 109-106 and his four-point play cut it to 111-110 with 1:23 to go.\n\n\r\n              After Young answered with two free throws, Saddiq Bey missed two on the other end. John Collins scored inside and, after Cunningham was blocked at the rim, the Hawks finished it from the line.\n\n\r\n              “I thought we were solid for 48 minutes,” Hawks coach Nate McMillan said. “We didn't play a perfect game of basketball, but I thought we were locked into our game plan.\"\n\n\r\n              Young had 23 points in the first half, including a three-point play that gave Atlanta a 62-57 lead with nine seconds left. However, Bogdanovic hit two free throws and, after the Hawks threw away a long pass, Cunningham hit a jumper to pull Detroit to 62-61. \n\n\r\n              TIP INS\n\n\r\n              Hawks: Atlanta’s two-game set in Detroit is the first of three such trips this season. The Hawks will play in Miami on March 4 and 6, then visit Washington on March 8 and 10.\n\n\r\n              “Everyone is talking about this being like the playoffs with the two games in a row,” Young said. “We're not thinking about that.”\n\n\r\n              Pistons: Even though Detroit is hosting Atlanta twice in three days, it won’t wear its traditional white jerseys in either game. On Wednesday, it wore black with the Hawks in white. On Friday, the Pistons will debut their teal retro jerseys.\n\n\r\n              BIG MONEY FOR DIRTY WORK\n\n\r\n              The Hawks had seven of their 10 offensive rebounds in the fourth quarter, including three from Clint Capela. \n\n\r\n              “That's what Clint Capela does, and that's why they pay him $30 million a year or whatever it is,” Casey said. “Isaiah (Stewart) and Jalen (Duren) were really battling him on the boards, but those turned out to be big possessions.”\n\n\r\n              Capela also had two of his four blocked shots in the fourth.\n\n\r\n              “He makes a huge difference for us on that end,” Young said. “He's not always going to score, but he's always going to be great on defense.”\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995215.156808
}