{
  "game_id": "0021600610",
  "espn_id": "400900031",
  "date": "Jan 15, 2017",
  "matchup": "OKC @ SAC",
  "headline": "Russell Westbrook gets 20th triple-double; Thunder beat Kings",
  "body": "SACRAMENTO, Calif. -- Russell Westbrook had a big second half and another triple-double, and it still almost wasn't enough for Oklahoma City.\nWestbrook had 36 points, 11 rebounds and 10 assists for his 20th triple-double of the season and the Thunder beat the Sacramento Kings 122-118 on Sunday night.\nThe dynamic, five-time All-Star guard had 19 triple-doubles last season. He entered Sunday averaging a triple-double and is trying to match Hall of Fame guard Oscar Robertson as the only NBA player to average a triple-double for a full season.\nWhat pleased Thunder coach Billy Donovan regarding the latest triple-double was how well Westbrook played after intermission. Westbrook had 25 points, seven rebounds and four assists in the second half, and scored 13 points in the fourth to help thwart a late Sacramento charge.\n\"Russell's second half was phenomenal. He was really efficient scoring and passing,\" Donovan said.\nWhat didn't please Donovan was allowing the Kings to rally from a 12-point deficit in the final 2:04. An 11-2 run capped by a DeMarcus Cousins' 3-pointer pulled the Kings within 116-113 with 26.5 seconds left.\n\"We played really well on defense outside of the final minute and a half of the fourth quarter,\" Donovan said. \"We allowed 39 points in the fourth quarter. We were fortunate we won. The things we did at the end of the game will get you beat.\"\nEnes Kanter had 29 points and 12 rebounds for the Thunder. Victor Oladipo had 17 of his 23 points in the first half and Alex Abrines had 13 points. Oklahoma City had dropped three of its previous four games.\nDeMarcus Cousins had 31 points, 11 rebounds and seven assists for the Kings, who have lost two straight and five of six. Rudy Gay had 22 points and 10 rebounds, and Darren Collison had 21 points.\nThe Kings committed 22 turnovers that led to 23 points after having 21 giveaways in a loss Friday to the Cavaliers. They are 1-5 on this seven-game homestand.\n\"I didn't think we had a lot of momentum,\" Kings coach Dave Joerger said. \"At the end of day, I can yell about referees and this and that, but we had 15 turnovers at halftime. It doesn't have to do with anything else.\"\nThe Kings battled back and twice cut the lead to three points in the final 25 seconds, but Abrines and Oladipo each made two free throws and Westbrook had a steal and layup to fend off Sacramento.\nWestbrook made a pair of 3-pointers and had seven points in an 80-second span to put the Thunder up by 15 just past the midway point in the fourth.\nAfter a subpar first half where he missed frequent shots and committed five turnovers, Westbrook got going in the third quarter, scoring 11 points and helping the Thunder take an 88-79 lead into the fourth.\nThunder starting center Steven Adams took a fall early in the third quarter and eventually headed to the locker room. He was evaluated for a concussion and didn't return.\n\"We will evaluate him (Adams) some with testing to find out where's he's at,\" Donovan said.\nTIP INS\nThunder: Domantas Sabonis missed all four 3-point attempts and has now misfired on 22 of 23 attempts.\nKings: Entering the game, Cousins had a career shooting percentage of 38.6 percent against the Thunder, his lowest versus any team. He was 4 of 11 in the first half.\nUP NEXT\nThunder: The next three road games are against three formidable Western Conference teams -- Clippers, Golden State and Utah. They next play in Los Angeles on Monday night.\nKings: Wrap this homestand against the Pacers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995287.89393
}