{
  "game_id": "0022000753",
  "espn_id": "401307544",
  "date": "Apr 03, 2021",
  "matchup": "OKC @ POR",
  "headline": "McCollum scores 20 and Blazers rout the Thunder 133-85",
  "body": "PORTLAND, Ore. -- — CJ McCollum scored 20 points to lead eight Trail Blazers in double figures and Portland routed the Oklahoma City Thunder 133-85 on Saturday night. \n\n\r\n                    Damian Lillard and Anfernee Simons each added 16 points for the Blazers, who sent their starters to the bench before Portland took a 104-59 lead into the final quarter. \n\n\r\n                    Portland led by as many as 52 points and the final margin was the largest ever for the team at the Moda Center. The Blazers also forced a season-high 22 turnovers. \n\n\r\n                    Kenrich Williams had 18 points for the short-handed Thunder, who have lost five of their last six games. It was the most lopsided defeat ever for the team. \n\n\r\n                    Just one of Oklahoma City's starters broke double figures: Moses Brown, who made his first start for the Thunder last month, had 10 points and 14 rebounds. \n\n\r\n                    McCollum said he joked with Norman Powell, who joined the Blazers at the trade deadline, that Portland gets about four blowouts every season. \n\n\r\n                    “So I'm glad we were able to get one done tonight so we could get some rest and let some of the young guys play,” McCollum said. \n\n\r\n                    The Thunder were without guard Shai Gilgeous-Alexander with a right foot injury for the sixth straight game. They also didn't have Luguentz Dort for the fourth game because of concussion protocol. \n\n\r\n                    Both teams were playing the second of back-to-backs. The Thunder were coming off a 140-103 loss at the Phoenix Suns on Friday night. The bright spot was rookie Theo Maledon, who had 33 points. He finished with seven against Portland. \n\n\r\n                    Portland was likewise coming off a big loss a night earlier, 127-109 to the Milwaukee Bucks. It snapped a four-game winning streak.\n\n\r\n                    \"You just have to learn the lesson. These sting, obviously. The question is what to do with it? We have to learn the lesson,\" Thunder coach Mark Daigneault said about the takeaway for his young and experienced team. \n\n\r\n                    “It was good to bounce back from the Milwaukee game, play a good defensive game and just allow the subs to play, rest the starters,” Blazers coach Terry Stotts said. “In that sense, it was really good for us.”\n\n\r\n                    The Blazers led by as many as 21 points in the first quarter, taking a 35-14 lead after Lillard's 3-pointer. Portland led 65-46 at the half with four Blazers already in double figures, led by McCollum with 12 points. \n\n\r\n                    McCollum's step-back 3-pointer in the third quarter capped a 16-5 run to start the half and stretched the Blazers lead to 81-51.\n\n\r\n                    Simons' 3-pointer gave the Blazers a 100-57 lead with more than two minutes left in the third and by that time most of the starters were already seated for the rest of the game. Enes Kanter finished with 12 points and 17 rebounds. \n\n\r\n                    “I just tell the guys to stay together. In this league you’re going to see a lot,\" Williams said following the loss. \"The main thing we can do as a group is stick together.”\n\n\r\n                    TIP INS\n\n\r\n                    Thunder: Gilgeous-Alexander warmed up with the Thunder but did not play. ... Williams led the Thunder off the bench in the opening half with 11 points. ... Rookie Josh Hall didn't return for the second half because of concussion-like symptoms.\n\n\r\n                    Trail Blazers: McCollum was called for a flagrant one against Isaiah Roby in the third quarter. ... It was Portland's third and final game against the Thunder this season. The teams split the first two meetings. ... Portland's biggest margin of victory ever was 50 points (1982 against Cleveland). ... It was the first time this season that the Blazers have had eight players in double figures. \n\n\r\n                    A FEW FANS\n\n\r\n                    The Blazers have had a small number of employees and their families act as fans during the past two games so that they can refine policies for when Oregon allows spectators to attend indoor sporting events. So far, only outdoor events can have fans, and only in limited capacity. \n\n\r\n                    UP NEXT\n\n\r\n                    The Thunder host the Detroit Pistons on Monday. \n\n\r\n                    The Trail Blazers visit the Los Angeles Clippers on Tuesday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997080.389885
}