{
  "game_id": "0022201085",
  "espn_id": "401469240",
  "date": "Mar 22, 2023",
  "matchup": "TOR vs. IND",
  "headline": "Back home in Canada, Nembhard nets 25 as Pacers top Raptors",
  "body": "TORONTO -- — Rookie guard Andrew Nembhard had 25 points and 10 assists in his first NBA game back home in Canada, and the Indiana Pacers beat the Toronto Raptors 118-114 on Wednesday night to snap their home winning streak at seven.\n\n\r\n              Myles Turner scored 16 points, Bennedict Mathurin added 15 and Buddy Hield had 13 for the Pacers, who swept the three-game season series between the teams.\n\n\r\n              Canadian-born players Mathurin, Nembhard and Oshae Brissett all started for Indiana as the Raptors celebrated Canada Basketball Night. It was the first time since the NBA began tracking starters in 1970-71 that three Canadians started for the same team.\n\n\r\n              “For it to happen in Toronto, it’s pretty cool,” Pacers coach Rick Carlisle said. “All three of those guys played well. Nembhard had a great game. Mathurin was terrific. I thought Brissett did what he does. He gave us energy, rebounded, he scored the first five points of the game. That was great.”\n\n\r\n              Pascal Siakam scored 18 of his 31 points in the fourth quarter but the Raptors lost their second straight. Siakam also had 10 rebounds and seven assists.\n\n\r\n              Fred VanVleet had 28 points and 11 assists for Toronto, and Jakob Poeltl scored 23.\n\n\r\n              Poeltl missed two free throws with 1:24 left when Toronto could have cut the deficit to two. After a missed 3 by VanVleet, Nembhard connected from long range to give the Pacers a 114-107 lead with 33 seconds to play.\n\n\r\n              “That was the shot that put the game away,” Carlisle said. “Just an amazing night for him and his family.”\n\n\r\n              Nembhard shot 11 for 17, going 3 of 5 from long range. \n\n\r\n              “I didn’t really feel too much pressure to play out of character tonight,” he said. “I just wanted to be aggressive.”\n\n\r\n              Fellow rookie Mathurin made three of his five shots and earned praise from Carlisle for his defensive effort on VanVleet.\n\n\r\n              “It was really fun just to play in Toronto my first time,” Mathurin said. “The fact that we got the win makes it even more exciting.”\n\n\r\n              The short-handed Raptors were without forward Scottie Barnes, who exited Sunday’s loss at Milwaukee because of a sore left wrist. Toronto was also without forward Precious Achiuwa (right hamstring) and guard Gary Trent Jr. (right elbow).\n\n\r\n              Toronto lost at home for the first time since Feb. 10 against Utah, when the Jazz overcame a 12-point deficit in the final five minutes to beat the Raptors 122-116.\n\n\r\n              “Didn’t feel super organized at either end at the start or for a while,” Raptors coach Nick Nurse said. “I thought that we let a lot of chances go.”\n\n\r\n              The Raptors shot 7 for 34 from 3-point range. Chris Boucher’s buzzer-beating shot helped Toronto avoid matching a season low for makes and setting a new low for shooting percentage from beyond the arc.\n\n\r\n              Nembhard scored 14 points in the first, the most he's ever had in a single quarter, as the Pacers led 36-26 after one.\n\n\r\n              “Nembhard obviously at the start was big,” Nurse said.\n\n\r\n              Indiana led 58-52 at halftime and took an 83-78 lead into the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Pacers: T.J. McConnell scored 14 points and Jordan Nwora had 10. … G Tyrese Haliburton (right ankle), G Chris Duarte (left ankle) and G/F Kendall Brown (right leg) all sat for Indiana. … The Pacers committed 18 turnovers, leading to 21 points for Toronto. … Indiana outscored the Raptors 40-21 in bench points. ... The Pacers are 3-1 when Nembhard scores 20 or more.\n\n\r\n              Raptors: Barnes sat for the fourth time this season and first since Nov. 26. … Actor Mike Myers sat opposite the Toronto bench. Actor Nicholas Braun also attended the game, sitting in a baseline seat.\n\n\r\n              HIELD FINED \n\n\r\n              Hield was fined $25,000 for making an obscene gesture while sitting on the bench during the second quarter of Monday’s loss at Charlotte. TV cameras caught him raising his middle finger to someone on the court.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Visit Boston on Friday.\n\n\r\n              Raptors: Host Detroit on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994016.148231
}