{
  "game_id": "0022000330",
  "espn_id": "401267490",
  "date": "Feb 03, 2021",
  "matchup": "ATL vs. DAL",
  "headline": "Doncic, Mavericks snap 6-game skid, hold off Hawks 122-116",
  "body": "ATLANTA -- — Luka Doncic scored 27 points and dished out 14 assists as the Dallas Mavericks snapped a six-game losing streak, defeating Trae Young and the Atlanta Hawks 122-116 on Wednesday night.\n\n\r\n                    Kristaps Porzingis added 24 points and 11 rebounds for the Mavericks, including a crucial tip-in of a miss by Doncic with 32 seconds remaining that helped Dallas hold off a furious Atlanta comeback.\n\n\r\n                    Winning was a big relief for the Mavericks.\n\n\r\n                    “It wasn't perfect,” Doncic said. “But we got the win, and that's all that matters to me. We were so happy after the game. It's been a tough stretch.”\n\n\r\n                    \r\n                      Doncic clearly won the individual matchup between two of the NBA’s brightest young stars, who are forever linked after being dealt for each other in a blockbuster trade during the 2018 draft.\n\n\r\n                    With Dallas players hassling him the length of the court and coming at him with frequent double-teams, Young needed a late flourish to reach 21 points on 8-of-18 shooting. He had nine assists and four turnovers.\n\n\r\n                    “They were denying Trae the ball from pretty much the second we inbounded it,” said Kevin Huerter, who also had 21 points for the Hawks. “They made it tough on him.”\n\n\r\n                    \r\n                      Doncic had no such issues against the Hawks. He got plenty of help from his teammates — six Dallas players scored in double figures — and continually earned trips to the foul line, where he finished 10 of 10.\n\n\r\n                    Doncic came up just two rebounds shy of another triple-double.\n\n\r\n                    After a game that was tight for three quarters, the Mavericks pulled away at the start of the fourth and held on to snap their longest losing streak since a seven-game skid from March 2-14, 2019.\n\n\r\n                    Tim Hardaway Jr. pushed the margin to double digits for the first time all night with a pull-up jumper that gave the Mavericks a 95-85 lead with 10:14 remaining.\n\n\r\n                    Doncic pulled off another of his dazzling plays to help extend the margin. He stripped the ball from Cam Reddish and led a fast break, brushing off Hawks center Clint Capela with a crossover and hesitation at the 3-point line, accelerating toward the hoop before dishing off to Porzingis cutting down the lane for the dunk.\n\n\r\n                    \r\n                      John Collins led the Hawks with 35 points and 12 rebounds.\n\n\r\n                    Atlanta keeps struggling at the most crucial points of the game. Nine of their 11 losses have been by less than 10 points.\n\n\r\n                    “That's been out Achilles heel a little bit,” Collins said. “We've got to continue to work on it as a young team.”\n\n\r\n                    PORZINGIS PLAYING TIME\n\n\r\n                    The Mavericks have been careful with Porzingis' minutes, still mindful of the knee injury he sustained in last year's playoffs.\n\n\r\n                    The 7-foot-3 Latvian wants coach Rick Carlisle to be a little more generous with the playing time — especially in the first quarter. They've talked about an expanded role. \n\n\r\n                    “I feel it's best to play the whole first quarter,” Porzingis said. “Especially coming back from an injury. It's hard to get into a rhythm playing four minutes here, five minutes there.”\n\n\r\n                    NO FREEBIES\n\n\r\n                    Collins turned in a big night without a single trip to the foul line.\n\n\r\n                    “I honestly feel like with how athletic I am, it's hard for the referees to judge what's a foul, what's not a foul,” he said. “It says my game is real. To do it without getting to the line, those are all real buckets.”\n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Dallas also snapped a seven-game losing streak in Atlanta. ... The Mavs have won three of five games against the Hawks in the Doncic-Young rivalry. ... Hardaway had another big game against his former team with 22 points, including five 3-pointers. He came in averaging 21.5 points in seven games since leaving the Hawks in 2017.\n\n\r\n                    Hawks: Capela extended the NBA's longest active streak of games with at least 10 rebounds to 17 in a row before halftime. He finished with 14 boards. ... Capela's double-digit rebounding streak is the longest by an Atlanta player since Dwight Howard’s 19-game run in 2017.\n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: Return home Thursday night to host the Golden State Warriors.\n\n\r\n                    Hawks: Also facing a back-to-back, hosting the Utah Jazz on Thursday.\n\n\r\n                    ------\n\n\r\n                    Follow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 and find his work at https://apnews.com/search/paulnewberry\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997844.864596
}