{
  "game_id": "0022400351",
  "espn_id": "401704917",
  "date": "Dec 08, 2024",
  "matchup": "MIA vs. CLE",
  "headline": "Herro scores 34, Robinson adds 23 and Heat beat Cleveland 122-113, only 4th loss for Cavs",
  "body": "MIAMI -- — Tyler Herro scored 34 points, Duncan Robinson had 23 and the Miami Heat stayed hot by beating the Cleveland Cavaliers 122-113 on Sunday night.\n\n\r\n              Jimmy Butler scored 18 and Bam Adebayo had 16 points, 13 rebounds and six assists for Miami. Terry Rozier added 14 for the Heat.\n\n\r\n              Darius Garland scored 23 for Cleveland, which fell to 21-4 — still matching the best 25-game start in team history. Georges Niang scored 15 for the Cavs, who lost Evan Mobley in the first half to a sprained ankle.\n\n\r\n              Donovan Mitchell was held to 12 points on 5-of-16 shooting for Cleveland. \n\n\r\n              Both teams shot exactly 41 for 86 — 47.7% — in the game.\n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland is now 5-3 against the Southeast Division — and 16-1 against the rest of the NBA. The Cavs are 6-4 after their 15-0 start.\n\n\r\n              Heat: Miami has scored at least 121 points in each of its last three games, tying the longest such streak in franchise history — it was done twice previously. The Heat have won three consecutive games overall and four in a row at home, both season bests.\n\n\r\n              Key moment\r\n              A huge possession for Miami during the closing push: Dru Smith — a 6-foot-2 reserve guard — got two offensive rebounds on the same trip, then got the ball back and made a 3-pointer from the left corner to give the Heat a 112-99 lead with 4:22 left.\n\n\r\n              Key stat\r\n              Herro's two highest-scoring third quarters of his career were in a five-day span: 21 points against the Lakers on Wednesday and 19 points on Sunday.\n\n\r\n              Up next\r\n              The teams not in the NBA Cup knockout round get a few days off now. Cleveland hosts Washington on Friday and Miami hosts Toronto on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996919.905108
}