{
  "game_id": "0021901275",
  "espn_id": "401224750",
  "date": "Aug 07, 2020",
  "matchup": "MEM vs. OKC",
  "headline": "Grizzlies roll past Thunder for first win since restart",
  "body": "LAKE BUENA VISTA, Fla. --  Dillon Brooks scored 22 points, and the Memphis Grizzlies claimed their first win since the restart with a 121-92 victory over the Oklahoma City Thunder on Friday.\n\nJonas Valanciunas had 19 points and 11 rebounds and Ja Morant had 19 points and nine assists for the Grizzlies.\n\nMemphis lost its first four restart games and would have fallen into a tie with Portland for eight place in the Western Conference standings with a loss.\n\n\"As a whole, we never doubted ourselves, doubted what we can accomplish as a team,\" Morant said. \"But like, we all was very confident in our team and feel like tonight, we just went out and played freely and we were able to come out with a win.\"\n\nChris Paul scored 17 points and Luguentz Dort added 16 for the Thunder. Shai Gilgeous-Alexander, Oklahoma City's leading scorer this season, finished with 10 points on 3 for 13 shooting.\n\nThe Thunder looked nothing like the team that rolled past the Los Angeles Lakers on Wednesday. Oklahoma City missed a chance to move into a tie with the Houston Rockets for fourth place in the West.\n\nOklahoma City led by 18 in the first quarter, but the Grizzlies rallied to take the lead in the second. The Thunder made 7 of 13 3-pointers in the first quarter but 6 of 30 the rest of the way.\n\n\"I thought it was a little bit of fool's gold in the first quarter,\" Thunder coach Billy Donovan said.\n\nMemphis led by nine in the final seconds of the first half. Danilo Gallinari hit a 3 for the Thunder with 4.6 seconds left, then Paul got a steal and hit a corner 3 to cut the Grizzlies' lead to 63-60 at halftime.\n\nThe Grizzlies outscored the Thunder 32-18 in the third quarter to go up 95-78 at the end of the period.\n\n\"They started making shots,\" Paul said. \"We never really made them feel us all game long. They were just so comfortable. They got a little bit of everything. They got floaters, they got the threes, they got to the free-throw line. Our defense was just bad today.\"\n\nTIP-INS\n\nThunder: C Steven Adams was out with a left leg injury. ... Committed just one turnover in the first quarter and finished with 10. ... Dort scored 11 points in the first quarter. ... F/C Mike Muscala is in concussion protocol and did not play.\n\nGrizzlies: Valanciunas was issued a technical foul in the second quarter. ... Brooks was issued a Flagrant 1 in the second quarter after body checking Dort. ... Outscored the Thunder 18-11 from the free-throw line.\n\nSTAT LINES\n\nThe Thunder entered the day second in scoring defense with 100.3 points per games since the restart, but the Grizzlies shot 55 percent.\n\nBIRTHDAY BLUES\n\nMorant missed his daughter Kaari's first birthday party. He wore her name on his shoes.\n\n\"This morning I woke up I wasn't in a good mood at all,\" Morant said. \"I talked with my parents, told them it was probably one of the toughest days of my life not being able to be at m daughter's first birthday party. It's kind of tough but I think ... today was a win. So hopefully she's thankful for that and all the gifts she got back at the house.\"\n\nSTEPPING UP\n\nAnthony Tolliver stepped into Memphis' starting lineup at forward for Jaren Jackson Jr., who is out for the season with a knee injury he suffered on Monday. Tolliver finished with eight points and five rebounds in just under 26 minutes.\n\n\"A.T. brought so much juice to the lineup,\" Grizzlies coach Taylor Jenkins said. \"I just felt it was time for a change just to get a different look out there. It also helped our bench too. I thought we got great production from our bench.\"\n\nUP NEXT\n\nThunder: Play the Washington Wizards on Sunday.\n\nGrizzlies: Play the Toronto Raptors on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995673.69139
}