{
  "game_id": "0022200347",
  "espn_id": "401468502",
  "date": "Dec 04, 2022",
  "matchup": "MEM @ DET",
  "headline": "Ja Morant has 21-point 3rd quarter, Grizzlies beat Pistons",
  "body": "DETROIT -- — Ja Morant scored 21 of his 33 points in the third quarter and the Memphis Grizzlies beat the Detroit Pistons 122-112 on Sunday night.\n\n\r\n              “He’s a special player and he has a special impact on us winning games,” Grizzlies coach Taylor Jenkins said. “Obviously, he scored 33 points, but he also did a really good job of distributing the basketball. He was huge.”\n\n\r\n              Morant added 10 assists to help Memphis win for the fourth time in five games. \n\n\r\n              Dillon Brooks and Jaren Jackson Jr. each scored 22 points and Brandon Clarke had 14 points and 14 rebounds.\n\n\r\n              “We know Detroit, especially with Dwane Casey as their coach, is never going to give up,” Clarke said. “They put up a fight, for sure.”\n\n\r\n              Saddiq Bey led Detroit with 20 points and Bojan Bogdanovic had 18.\n\n\r\n              “We won the last game and we want to carry that momentum, but we've got to stay focused on the present,” said Bey, who is adjusting to his new role as the top scorer on the second unit. “We've got to approach every game like it is our last.\"\n\n\r\n              Memphis played without center Steven Adams (hip), the NBA's leading offensive rebounder, but still finished with a 16-8 edge in second-chance points.\n\n\r\n              The Grizzlies scored the first seven points and led by 19 early in the second quarter. The margin was still 12, 69-57, at the half, thanks to 35 points from Brooks and Jackson.\n\n\r\n              Morant took over in the third quarter, going 8 of 10 from the floor while his teammates went 3 of 13. Morant assisted on all three baskets he didn't score, helping Memphis build a 101-83 lead.\n\n\r\n              “He's one of the best players in the league for a reason,” Casey said. “If you aren't locked in together defensively -- everyone on the same page about how you are going to defend the pick-and-roll, he's going to do what he does on a regular basis. You have to slow him down and break his rhythm and we never did that.”\n\n\r\n              The Grizzlies led by 22 in the fourth.\n\n\r\n              TIP INS\n\n\r\n              Grizzlies: Jackson, who attended Michigan State, is averaging 21.1 points in his last seven games. ... Memphis is 3-0 against Detroit in the last two seasons with an average victory margin of 21.7 points.\n\n\r\n              Pistons: Detroit has allowed an average of 129 points in its last three games, including a 140-110 loss to the New York Knicks on Tuesday.\n\n\r\n              ONE-MAN TEAM\n\n\r\n              Morant had 26 points and four assists in 19 second-half minutes. His teammates combined for 27 points and five assists in 101 minutes.\n\n\r\n              LATE START\n\n\r\n              The Pistons outscored Memphis 86-82 in the final three quarters, but couldn't recover from the Grizzlies' 40-26 lead after the first.\n\n\r\n              “We had no rhythm to start the game -- we were mentally flat when we have to be the hungriest team on the planet,” Casey said. “Our second unit had a little more energy, but that has to come from our starters.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Miami on Monday night to start a five-game homestand.\n\n\r\n              Pistons: At Miami on Tuesday night to start a three-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994222.28638
}