{
  "game_id": "0022300036",
  "espn_id": "401584124",
  "date": "Nov 17, 2023",
  "matchup": "LAL @ POR",
  "headline": "James has 35 and Lakers stay atop In-Season Tournament group with 107-95 win at Portland",
  "body": "PORTLAND, Ore. -- — LeBron James matched his season-high with 35 points and the Los Angeles Lakers handed the Portland Trail Blazers their sixth straight loss with a 107-95 victory in an In-Season Tournament game on Friday night.\n\n\r\n              Anthony Davis added 16 points and 14 rebounds, and the Lakers moved to 3-0 in Group A with the victory that counts toward the regular season.\n\n\r\n              “It's an incentive for sure, this early in the season,” James said about the tournament. “We understand what's at stake, that's not saying we're putting all our eggs in one basket in the In-Season Tournament.”\n\n\r\n              Jerami Grant had 24 points for Portland. With the loss, the Blazers fell to 1-2 in the tournament and were eliminated from a shot at winning their group. \n\n\r\n              The Lakers led by as many as 17 points in the final quarter. Rui Hachimura's 3-pointer put Los Angeles in front 97-83 with just over seven minutes left, sending fans to the exits. \n\n\r\n              James was listed as questionable with a calf contusion but he started and played with a sleeve on his calf, finishing with nine assists — seven of them in the fourth quarter. He also made five 3-pointers. \n\n\r\n              “He shot the ball extremely well tonight, he was in a great rhythm, especially from 3. Made some huge plays, big time shots for us, the kind that just slowed them down,” Davis said about James. \n\n\r\n              Los Angeles (7-6) kept its starters in until the end, because point differential matters in the group standings. The Lakers are the only undefeated Western Conference team in the tournament.\n\n\r\n              “I mean, it’s been a little topsy-turvy for us, a little inconsistency mixed in, in those first 13 games,” Lakers coach Darvin Ham said. “But this is the early part of the season. Those first 20 games, you’re trying to figure yourselves out.”\n\n\r\n              The Lakers led by as many as 13 points in the first quarter and took a 30-23 lead into the second. They stretched it to 54-40 on D'Angelo Russell's 3-pointer before going into halftime in front 60-50.\n\n\r\n              Grant's 3-pointer and free throw for Portland closed the gap to 63-60 early in the third. The Blazers got as closes as 68-67 on Skylar Mays' 3.\n\n\r\n              Russell finished with 14 points for the Lakers, who were coming off a 125-110 loss to the Sacramento Kings that snapped a three-game winning streak. \n\n\r\n              “When it (the tournament) started we just started to find our rhythm, click as a team, just kind of getting things rolling,\" Davis said. “Obviously a tough loss a couple of days ago at Sac, and we just wanted to come back and get in the win column.”\n\n\r\n              Deandre Ayton had 17 points and 12 rebounds for the struggling and shorthanded Blazers, coming off a 109-95 loss to the Cavaliers on Wednesday. \n\n\r\n              While trying to rebuild after the departure of All-Star Damian Lillard in the offseason, Portland has been beset by injuries, with starting guard Anfernee Simons (right thumb), rookie Scoot Henderson (right ankle) and Malcolm Brogdon (left hamstring) all absent.\n\n\r\n              “We’re so young. A lot of times even our walkthroughs and shootarounds, we spend most of our time talking about our concepts or things we want to do, and a little time on the Lakers or the Grizzlies or whoever,′ coach Chauncy Billups said. ”We’re still learning so much.”\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host the Houston Rockets on Sunday. \n\n\r\n              Trail Blazers: Host the Oklahoma City Thunder on Sunday. \n\n\r\n              --------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995547.221756
}