{
  "game_id": "0021400798",
  "espn_id": "400579090",
  "date": "Feb 11, 2015",
  "matchup": "LAL @ POR",
  "headline": "Blazers hand Lakers 11th straight road loss with 102-86 win",
  "body": "PORTLAND, Ore. --  The Portland Trail Blazers were more concerned about themselves than the struggling Los Angeles Lakers.\n\nWary of a letdown following a win on the road and with the All-Star break looming, the Blazers jumped on the Lakers early and never let up in a 102-86 victory Wednesday night.\n\nThe loss was the 11th straight on the road for the Lakers, a franchise record.\n\n\"We were focused,\" Portland's Nicolas Batum said. \"Those games can sometimes be like a trap or tricky game, and maybe we could focus on the break. But we were focused. We knew we had a job to do tonight.\"\n\nLaMarcus Aldridge had 18 points and 12 rebounds, while Wesley Matthews added 20 points for the Blazers, who won their second straight before heading into the break.\n\nIt was the sixth straight loss overall for the struggling Lakers, who trailed by as many as 23. Los Angeles was hurt late in the third quarter when Nick Young appeared to injure his left ankle on a jumper and did not return.\n\n\"He didn't seem to be overly concerned about it,\" coach Byron Scott said about Young. \"I don't know if he's going to need treatment the next three or four days or not.\"\n\nMired in second-to-last place in the Western Conference, the Lakers (13-40) began their road losing streak in Portland with a 98-94 loss on Jan. 5.\n\nWayne Ellington had 16 points and eight rebounds for the Lakers and Jordan Clarkson had 17 points.\n\nThe Blazers also won the previous two meetings with the Lakers this season and have taken four straight overall. All those wins have come with Kobe Bryant sitting out because of injuries.\n\nPortland, coming off a 109-98 victory at Houston, was without center Chris Kaman because of a sprained right ankle.\n\nThe Blazers jumped out to a 30-20 lead in the first quarter and stayed in front for the rest of the game. Nicolas Batum's 20-foot jumper off a pass from Aldridge gave Portland a 50-39 lead, and the Blazers went into the break ahead 54-46.\n\nPortland extended the lead in the third quarter to 77-56 following Matthews' 3-pointer and a fast-break layup from Aldridge.\n\nDamian Lillard finished with 15 points and eight assists, becoming the only NBA player to score in double figures in all of his team's games this season. He and Aldridge sat out the fourth quarter.\n\n\"Everybody did their part, everybody understood that we had to be the team that we've been the last couple games to win it and we did that,\" Lillard said.\n\nPortland's 36-17 record is identical to their record going into last year's All-Star break.\n\n\"Hopefully, you reflect a little bit on the first 50 games and you come back with a different sense of purpose as well,\" Scott said. \"It's always good to get a little bit of a break.\"\n\n---\n\nTIP-INS\n\nTrail Blazers: Team owner Paul Allen and general manager Neil Olshey presented Aldridge and Lillard with their All-Star jerseys before the game. ... It was Aldridge's 27th double-double of the season.\n\nLakers: Coach Byron Scott suggested before the game that the best way to stop Aldridge was to lock him in the locker room. ... Scott also joked that he's not really buying Young's assertion that a dolphin tried to drown him on a snorkeling excursion with girlfriend Iggy Azalea in Cabo San Lucas. Azalea posted on Twitter that Young was afraid of dolphins, and the matter took on a life of its own from there.\n\nREADY FOR THE REST\n\nFollowing the game, Young was pretty emphatic about the need for some time off. He said he's headed for Hawaii. He didn't mention dolphins.\n\n\"I'll get back Monday or Tuesday and get back in the gym, but for now I think I just need to get away,\" he said.\n\nBESTING THE LAKERS\n\nThe Blazers haven't won four straight games against the Lakers since 1997. With three wins this season and only one more game to go, Portland has won back-to-back season series against the Lakers for the first time since 1993-94.\n\nUP NEXT\n\nLakers: host the Nets on Feb. 20.\n\nTrail Blazers: visit the Jazz on Feb. 20.",
  "source": "espn_api",
  "crawled_at": 1764991990.988023
}