{
  "game_id": "0021601188",
  "espn_id": "400900566",
  "date": "Apr 08, 2017",
  "matchup": "CHI @ BKN",
  "headline": "Wade returns but Nets hand Bulls potentially costly loss",
  "body": "NEW YORK --  The Chicago Bulls could have used Dwyane Wade's leadership late in the fourth quarter. Instead, he was on the bench for a rest in his first game in nearly a month.\n\nThose minutes he sat could keep the Bulls out of the playoffs for the second straight year.\n\nThe rusty 35-year-old star headed to the bench with a six-point lead and saw it collapse during a three-minute stretch before the Bulls sustained a potentially costly defeat when the Brooklyn Nets beat them 107-106 Saturday.\n\n\"Elbow felt cool,\" said Wade, who scored 14 in his first game back since March 15 after the Bulls originally said he'd miss the remainder of the regular season. \"It's just my legs. I'm trying to get my legs back and my wind back.\"\n\nSpencer Dinwiddie made four free throws in the final 13.6 seconds for the Nets in their home finale. He scored 19 points, as did rookie Caris LeVert.\n\nDinwiddie played for the Bulls during the preseason before being waived on Oct. 21. He then caught on with Chicago's D-League affiliate and played nine games before the Brooklyn signed him to a multi-year deal in December.\n\nThe Bulls could have definitely used him off the bench throughout this up-and-down season.\n\n\"I think my confidence in terms of just playing at this level consistently, not having a short leash, being able to make mistakes in general, has grown tremendously and I credit the staff and the organization for that,\" Dinwiddie said.\n\nJimmy Butler scored 33 points for the Bulls, who fell into a tie with Miami for the eighth and final playoff spot in the Eastern Conference.\n\n\"We're still in this thing. They're a good team. They've been playing as well as anybody. They've got guys who played incredibly hard,\" Butler said. \"We lost, there's nothing we can really do about it right now. We have to go get better. We were saying how we needed to get this one today and now we need these next two (games).\"\n\nWade started and played 25 minutes.\n\nThe Bulls allowed 32 points in the fourth quarter, with Dinwiddie snapping a 103-all with two free throws with 13.6 seconds to play. Butler missed a jumper and Dinwiddie put it away with another pair with 2.4 to play.\n\nWade was supposed to be limited to about 20 minutes and exited the game with 5:09 left in the fourth quarter and the Bulls leading 94-88. Nikola Mirotic's three-point play with 4:24 remaining increased the lead to 97-88 before Brooklyn stormed back to go with a 10-0 run with the three-time NBA champion on the bench.\n\n\"As the game went on you can tell he got a little more comfortable. Early on you could tell he had a little rust,\" Bulls coach Fred Hoiberg said. \"We wanted to get him back in there at the end because we just felt it was our best five-man lineup to put out there to finish games for us. Unfortunately, we couldn't get it done.\"\n\nLeVert's consecutive 3-pointers pulled Brooklyn to 97-94 with 3:28 to go before Rondae Hollis-Jefferson made back-to-back baskets to give the Nets a 98-97 advantage with 2:21 left. Wade then re-entered and Chicago went back ahead 101-98 before Dinwiddie tied it with a 3.\n\n\"Even though we have lost a lot of games this year, we have played in a lot of close games,\" LeVert said. \"I think we played very smart down the stretch. It obviously showed on both ends of the court.\"\n\nBulls point guard Rajon Rondo missed his second straight game after spraining his wrist during Tuesday's loss to the New York Knicks.\n\nHollis-Jefferson had 16 points and 12 rebounds, while Brook Lopez scored 13 points for the Nets before a sold-out crowd of 17,732 that came out for the NBA's worst team's last home game.\n\nTIP-INS\n\nBulls: With two games remaining on the schedule, Hoiberg is unsure whether Rondo will be healthy enough to play Monday night when the Bulls host the Toronto Raptors since the point guard `'still has a lot of stiffness in that wrist.\"\n\nNets: Isaiah Whitehead's block in the first quarter tied an all-time team record by a guard with 36, set by Darwin Cook during the 1980-81 season. ... Brooklyn finished its home schedule at 13-28.\n\nOL' RELIABLE\n\nWade came in averaging 18.5 points and the Bulls could use his veteran leadership. `'I think the biggest thing with Dwyane is just the experience factor. He's obviously been in a lot of huge games over the course go his career, probably more than anybody in the roster,\" Hoiberg said. `'Obviously Rondo has the championship experience as well, but Dwyane has been there at this time of year when you're fighting like we are right now. He's a guy we rely on and we lean on heavily to finish out the season. Hopefully we have an opportunity to play beyond.\"\n\nUP NEXT\n\nBulls: Continue their playoff quest when they face the Orlando Magic on Monday night.\n\nNets: Play the first two road games to finish the season Monday night at Boston.",
  "source": "espn_api",
  "crawled_at": 1764995002.9679658
}