{
  "game_id": "0022000600",
  "espn_id": "401307384",
  "date": "Mar 14, 2021",
  "matchup": "TOR @ CHI",
  "headline": "Williams scores 23, Bulls beat Raptors 118-95",
  "body": "CHICAGO -- — Rookie Patrick Williams had a career-best 23 points to lead the Chicago Bulls past the Toronto Raptors, 118-95 Sunday night. \n\n\r\n                    Zach LaVine scored 15 to help the Bulls end a two-game slide. Coby White had 13 points and Wendell Carter Jr. added 12 points and 11 rebounds after the two were removed from the starting five for the first time this season.\n\n\r\n                    Chicago maintained a double-digit lead for most of the second half and enjoyed a nice cushion after Denzel Valentine made three 3-pointers during a 9-0 run that pushed the lead to 96-78 with eight minutes left. Toronto, which had won 12 straight against Chicago, never got closer than 11 the rest of the night.\n\n\r\n                    Norman Powell scored 32 points as the depleted Raptors, down five regulars, lost their fifth straight. Kyle Lowry had 20 points and eight assists before being ejected in the final minutes after picking up his second technical foul for arguing with officials.\n\n\r\n                    Lowry said he didn’t think the pressure of fighting to stay in the playoff hunt — a new experience for the Raptors after several seasons of riding in the upper half of the Eastern Conference standings — or even his actions led to his ejection.\n\n\r\n                    “I really didn’t do anything,” he said. “Sometimes I guess egos get bigger. ... This is very unconventional but we’ve just got to find a way to get through it.”\n\n\r\n                    Chicago coach Billy Donovan hinted at lineup changes a day earlier and followed through Sunday as Thaddeus Young and Tomas Satoransky each made their first starts of the season, bumping White and Carter from the opening five. Each of the new starters finished with 10 points.\n\n\r\n                    Donovan, disappointed with his regular starters’ lapses after they returned from last weekend’s All-Star break, said the move was hardly meant to punish White and Carter — or set in stone.\n\n\r\n                    “I really appreciate Coby and Wendell making sacrifices for the team,” Donovan said. “It’s not like those guys are out of the rotation or not important pieces of the team.\n\n\r\n                    “It’s more about trying to get a consistent combination through 48 minutes.” \n\n\r\n                    Carter was a reserve most of last season and didn’t seem to take the lineup shift personally.\n\n\r\n                    “It was fun mixing the lineups,” he said. “It was really nothing new to me. I just knew I had to come in and be aggressive. ... (The change) had to be made and it is what it is. We weren’t clicking on all cylinders like we’re supposed to.”\n\n\r\n                    The Bulls took the lead for good late in the opening quarter and went on a 9-0 run near the end of the first half to take a 58-49 lead to the break. \n\n\r\n                    Carter, a starter in all 25 games he’d played this season, made his first four shots after entering the game late in the first.\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Starters Fred VanVleet, Pascal Siakam and OG Anunoby, and reserves Patrick McCaw and Malachi Flynn remained out to comply with the NBA’s COVID-19 protocol. Siakam has missed six straight games, one more than the remaining quartet. The team hopes to get some of the players back in time for the finale of the three-game road swing. … Lowry earned his first technical late in the third quarter for remarks from the bench. … Toronto fell to 1-7 this season in the second game of back-to-back outings.\n\n\r\n                    Bulls: Chicago had last beaten the Raptors on Feb. 14, 2017. … Fans still aren’t allowed to attend games at the United Center, but the neighborhood was buzzing an hour before Sunday’s tipoff. Parking lots just north of the arena recently began hosting a makeshift mass-vaccination center and several people were filing in or out.\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Visit Detroit on Wednesday night\n\n\r\n                    Bulls: Host Oklahoma City on Tuesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996851.486418
}