{
  "game_id": "0021900538",
  "espn_id": "401161180",
  "date": "Jan 05, 2020",
  "matchup": "LAL vs. DET",
  "headline": "Lakers block 20 shots, hold off Pistons 106-99 in wild 4th",
  "body": "LOS ANGELES --  After Dwight Howard blocked Andre Drummond's shot with a perfect combination of timing and athleticism, he wagged a Mutombo finger at the uproarious Staples Center crowd.\n\nThe rest of the Lakers took off on a fast break that left them with a double-digit lead over Detroit in the fourth quarter.\n\nAlthough that lead vanished and the game got a whole lot scarier, the Lakers' historically huge block party propelled them to another win.\n\nLeBron James had 21 points, 14 rebounds and 11 assists, and Anthony Davis had eight of the Lakers' 20 blocked shots in their fifth straight victory, 106-99 over the Detroit Pistons on Sunday night.\n\nBy the time the Lakers' three big men were done swatting almost everything they could get their hands on, the Lakers had blocked more shots than any NBA team since March 2001.\n\n\"We were just protecting the paint,\" said Davis, who finished two blocks shy of his career high. \"Last game (against New Orleans), we gave up 60-something points in the paint. It's something we don't like doing, and we tried to make an emphasis tonight on protecting the paint.\"\n\nThat's an understatement: JaVale McGee blocked six shots, and Howard had four of his five blocks in the fourth quarter as the Lakers finished one blocked shot short of their franchise record. Los Angeles had 21 blocks against Denver in April 1982.\n\nHoward swatted Drummond twice in the final quarter, and he didn't regret playing to the fans.\n\n\"I was just in the moment, trying to get the crowd going,\" said Howard, who added 11 points and nine rebounds. \"Detroit had hit some big shots, and we needed a lift. AD, he inspired me to want to go out there and try to get as many as I can.\"\n\nDavis scored 11 of his 24 points in the final 3:40 and added 11 rebounds for the Lakers, who blew a late 11-point lead and nearly lost to a team with a losing record for the first time all season. Instead, Alex Caruso scored 13 points while they hung on to remain unbeaten since Christmas.\n\n\"Our three big guys just played exceptional basketball,\" Lakers coach Frank Vogel said. \"Those guys took a lot of pride in protecting our rim tonight.\"\n\nJames finished with his 90th career triple-double, his ninth of the season and his second in five days.\n\nDerrick Rose scored 28 points and former Lakers guard Svi Mykhailiuk had 14 -- one off his career high -- for the Pistons, who have lost nine of 11 despite a strong effort against the Western Conference leaders.\n\n\"Everything has got to go right to beat the top team in the league,\" Pistons coach Dwane Casey said. \"We played well, but we made just enough mistakes.\"\n\nDrummond added 12 points on 2-of-13 shooting and 18 rebounds before fouling out late, and the Pistons finished the California portion of their six-game road trip with a heartbreaker.\n\n\"There's a reason they're the No. 1 team in the league blocking shots,\" Rose said. \"They've got great length, but it's not going to change the way we play our game. We've got a chance to learn from our mistakes.\"\n\nTIP-INS\n\nPistons: Blake Griffin missed his fourth straight game with knee soreness. The injury forced the longtime Clippers star to miss both of Detroit's games at Staples Center this season. ... Casey got a technical foul in the third quarter for arguing the severity of a foul call against James.\n\nLakers: Caruso had a strong game off the bench after missing Friday's game with tightness in his right calf. ... Ohio State defensive end Chase Young watched the game from courtside next to agent Rich Paul, who represents Davis and James. Young announced Friday he'll enter the NFL draft, where he could be the first overall pick.\n\nINJURED LAKERS\n\nAvery Bradley got the Lakers' only blocked shot by a non-center, but he sprained his right ankle shortly before halftime and didn't return. The starter missed 13 games earlier in this season with a hairline fracture in his leg. Kentavious Caldwell-Pope also went to the Lakers' locker room shortly before halftime after rolling his ankle, but the swingman walked it off and returned in the third quarter.\n\nFRANTIC FOURTH\n\nThe Lakers scored the first 15 points of the fourth quarter in a rally spearheaded by James and Caruso, turning a four-point deficit into a 90-79 lead. After finally scoring nearly five minutes into the quarter, Detroit strung together nine straight points and a 13-1 run to reclaim the lead with 4:51 left.\n\nJames' driving, two-handed dunk put the Lakers up 96-92 with 3:22 left, and Davis was unstoppable down the stretch.\n\nAfter Rose hit a 3-pointer with 1:52 left to trim LA's lead to one point, Davis replied with a corner 3, and Howard got the Lakers' 20th blocked shot moments later.\n\nSWAT TEAM\n\nThe Lakers blocked eight shots in the first quarter alone, including four by Davis and three by McGee. Los Angeles blocked 12 shots and held Detroit to 35% shooting in the first half, but couldn't pull away while the Pistons made their first 21 consecutive free throws.\n\nUP NEXT\n\nPistons: Visit Cleveland on Tuesday to begin a home-and-home set with the Cavaliers.\n\nLakers: Host the New York Knicks on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996002.1083488
}