{
  "game_id": "0021900399",
  "espn_id": "401161041",
  "date": "Dec 16, 2019",
  "matchup": "OKC vs. CHI",
  "headline": "Paul hits 5 3s in fourth, Thunder rally past Bulls 109-106",
  "body": "OKLAHOMA CITY --  Chris Paul had a simple message for the Oklahoma City Thunder amid a 19-point halftime deficit.\n\n\"We always got a chance,\" he said.\n\nHe made sure of that Monday night.\n\nPaul hit five 3-pointers in the fourth quarter and the Thunder overcame a 26-point second-quarter deficit to beat the Chicago Bulls 109-106.\n\nPaul took over in the fourth, going 5 for 5 from deep and scoring 19 of his 30 points. His fourth 3-pointer of the quarter put Oklahoma City ahead 101-100, its first lead since the opening seconds. Paul also had nine rebounds and 10 assists.\n\nThe Bulls tied it at 106 before Steven Adams put the Thunder ahead with a free throw and Paul added two more in the final five seconds.\n\n\"I told the guys at halftime that it's a long game, it's never over,\" Paul said.\n\nChicago led 55-29 midway through the second quarter by turning 12 Thunder turnovers into 26 points. Zach LaVine scored 17 points, Wendell Carter Jr. had 12 and Ryan Arcidiacono added 10 while the Bulls shot 58% in the half. LaVine finished with 39 points.\n\n\"They were so aggressive and a lot of our turnovers were turning into buckets for them,\" Paul said. \"Once we settled down and let the game come to us, I think we got better.\"\n\nPaul had two points at the break.\n\n\"He really did a great job. Not only finding his spots to go score, but certainly making the game easy for everybody else,\" Thunder coach Billy Donovan said. \"I'm really glad that he's around a lot of our younger players. He understands how long the game and he understands the number of possessions. I think guys like him have a mental computer that helps them gather information on what's available.\"\n\nThe Thunder pulled within 19 at halftime, with Danilo Gallinari keeping them close with 17 first-half points. Oklahoma City whittled it down to eight after three quarters and an 8-0 run in the final minute of the period.\n\nGallinari finished with 22 points and Dennis Schroder had 18 off the bench for the Thunder.\n\n\"Chris Paul made some big-time plays,\" Bulls guard Kris Dunn said. \"That's him being a vet. You've got to take the positives out of there. The biggest thing we've got to harp on is finishing games.\"\n\nTIP-INS\n\nBulls: Chicago had 10 steals in the first 16 minutes, adding to their league-leading total. The Bulls finished with 17 and have 14 games with at least 10 steals this season.\n\nThunder; Terrance Ferguson returned to the starting lineup after missing five games with a sore hip. He hit a 3-pointer with his first shot and was 4 of 7 from deep while totaling 12 points.\n\nUP NEXT\n\nBulls: Visit Washington on Wednesday night.\n\nThunder: Host Memphis on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996236.91138
}