{
  "game_id": "0022400616",
  "espn_id": "401705182",
  "date": "Jan 22, 2025",
  "matchup": "CHA @ MEM",
  "headline": "Bane, Kennard help the Grizzlies build early lead in 132-120 victory over the Hornets",
  "body": "MEMPHIS, Tenn. -- — Desmond Bane scored 24 points, Luke Kennard added 23 on a season-high seven 3-pointers and the Memphis Grizzlies built an early lead and beat the Charlotte Hornets 132-120 on Wednesday night.\n\n\r\n              Jaren Jackson Jr. added 22 points, and Ja Morant had with 16 points and 13 assists to help Memphis win its fourth straight. Bane was 10 of 15 from the field, Kennard 8 of 12 and the Grizzlies shot 50% overall.\n\n\r\n              Mark Williams led the Hornets with a career-high 38 points, connecting on 14 of 18 shots. LaMelo Ball added 22 points, eight rebounds and six assists. Miles Bridges scored 17 points as the Hornets three-game winning streak came to an end.\n\n\r\n              Memphis was up 13 at the end of the first quarter and outscored the Hornets 40-23 in the second. The lead reached 34 in the third, enough to easily weather a 12-0 run by Charlotte to close the period.\n\n\r\n              Takeaways\r\n              Hornets: Charlotte shoots a 42.9% from the field, last in the league and was at 36.4% at the break. The Hornets had 14 turnovers leading to 21 Memphis points.\n\n\r\n              Grizzlies: Memphis controlled both the inside and the outside in building its first-half lead, scoring 32 points in the paint before the break, while making 11 of its 21 3-pointers for the game.\n\n\r\n              Key moment\r\n              Memphis already had the lead to 32 in the first half and led 78-48 at the break, the 78 points matching the team high in a half. \n\n\r\n              Key stat\r\n              Kennard already had a season high six 3-pointers in the first half, part of Memphis shooting 53.7% overall and 11 of 24 from outside the arc.\n\n\r\n              Up next\r\n              Charlotte opens a nine-game homestand on Friday night against Portland. Memphis continues its four-game homestand that night against New Orleans.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997445.2448761
}