{
  "game_id": "0022300532",
  "espn_id": "401585160",
  "date": "Jan 12, 2024",
  "matchup": "PHI vs. SAC",
  "headline": "Harris scores 37 points as 76ers, minus Embiid, rout Kings 112-93 to stop 3-game slide",
  "body": "PHILADELPHIA -- — Tobias Harris had 37 points and Tyrese Maxey added 21 as the Philadelphia 76ers snapped a three-game losing streak, beating the Sacramento Kings 112-93 on Friday night.\n\n\r\n              It was Philadelphia’s 10th consecutive victory over Sacramento, dating to 2019.\n\n\r\n              Harris scored 14 points in the first period, his most in any quarter this season, and never slowed down. It was the most points he’s scored in a regular-season game in six seasons with Philadelphia, and his most since setting a career high with 39 for the Los Angeles Clippers in December 2018 against Portland.\n\n\r\n              “I wish it was a closer game because then I probably would have gotten (to 40 points),” Harris said, laughing. “For me personally, having big games like that are important. Confidence-wise, game-wise, and preparation.” \n\n\r\n              Harris was also tasked with defending Domantas Sabonis, and he turned in a spirited defensive effort — limiting the Sacramento big man to 14 points.\n\n\r\n              “He had 23 at the half and he was puffing pretty hard,” said 76ers coach Nick Nurse. “He was taking a lot of shots from Sabonis. He was playing hard at both ends, which was good for him to withstand it, but (at halftime) I told him, `Forget about the first half and get revved up to do it again.' … I thought he did a decent job.”\n\n\r\n              It was the first time in Harris’ career that he scored 30 or more points in consecutive games.\n\n\r\n              Playing without reigning NBA MVP Joel Embiid, who missed his third straight game with left knee soreness, as well as rotation forwards Kelly Oubre Jr. (big toe soreness) and Robert Covington (left knee soreness), the 76ers needed contributions from other parts of their lineup.\n\n\r\n              They got it from Nicolas Batum, who scored 14 points on 5-for-5 shooting from the field. Filling in for Embiid at center, Paul Reed (eight points, seven rebounds) and Mo Bamba (11 points, four blocks) were also productive.\n\n\r\n              “I keep talking about it: When Joel goes out, those guys have got to step up,” Maxey said. “Joel protects a lot of us and cleans up at the rim, and those guys did the same thing tonight.”\n\n\r\n              Once the Kings recognized Harris was going to be a thorn in their side offensively, they stopped doubling Maxey, and he was able to start scoring as well, forcing Sacramento to pick its poison defensively.\n\n\r\n              Kings coach Mike Brown had some high praise for Maxey and the way he plays.\n\n\r\n              “He’s not Allen Iverson, but he’s fearless like A.I. was,” Brown said. “He’s going to be a tremendous talent in this league for a long time.”\n\n\r\n              De’Aaron Fox had 21 points for Sacramento. Malik Monk and Keegan Murray each scored 15.\n\n\r\n              Both teams shot under 40% in the first quarter, but the Sixers pulled away with a 29-12 surge in the second. Batum scored eight points in a minute, making three consecutive shots — the last two of which were 3-pointers. That stretched Philadelphia's lead to 22, and the Kings never got closer than 12 again.\n\n\r\n              Kevin Heurter (right ankle sprain) missed the game for Sacramento.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Visit the Milwaukee Bucks on Sunday night.\n\n\r\n              76ers: Host the Houston Rockets on Monday afternoon.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996427.8016279
}