{
  "game_id": "0022200629",
  "espn_id": "401468784",
  "date": "Jan 12, 2023",
  "matchup": "TOR vs. CHA",
  "headline": "Siakam scores 35, Raptors beat Hornets for 3rd straight win",
  "body": "TORONTO -- — Pascal Siakam scored 35 points, Scottie Barnes added 21 and the Toronto Raptors have won three consecutive games for the first time this season, beating the Charlotte Hornets 124-114 on Thursday night.\n\n\r\n              Gary Trent Jr. scored 19 points and O.G. Anunoby had 15 as the Raptors swept a pair of home games against the struggling Hornets.\n\n\r\n              “We’ve just got to keep going,” Barnes said. “Don’t settle for less. Stay hungry. That’s what the team mindset is right now, stay hungry.”\n\n\r\n              Toronto led by as many as 18 points and never trailed. The Raptors have won five straight home games against Charlotte.\n\n\r\n              Fred VanVleet scored 11 points and Precious Achiuwa had 10 points and a career-best five steals as Toronto improved to 3-2 on a season-high six-game homestand that concludes Saturday against Atlanta.\n\n\r\n              Siakam shot 11 for 13, going 3 for 3 from 3-point range and 10 for 12 at the line in the 50th 30-point game of his career.\n\n\r\n              LaMelo Ball scored 32 points before fouling out, and Terry Rozier had 21 points as Charlotte lost for the sixth time in seven games.\n\n\r\n              “We got beat on all the toughness plays,” Rozier said. “We’ve just got to dig deep and really look ourselves in the mirror and crack down.”\n\n\r\n              Ball shot 11 for 19. He missed a 3-pointer with 1:19 to go in the fourth quarter that would have cut the deficit to two points. Later on the same possession, Ball missed a driving layup. VanVleet answered with a 3-pointer, putting Toronto up 117-109 with 48 seconds remaining.\n\n\r\n              “We double-teamed there late when we didn’t need to,” Hornets coach Steve Clifford said. “That was not what we were doing. That led to the VanVleet 3.”\n\n\r\n              Charlotte made 10 turnovers in Tuesday’s loss and had a season-worst 22 miscues Thursday, leading to 26 points by the Raptors.\n\n\r\n              Toronto shot 28 for 36 at the line, while Charlotte was 19 of 27.\n\n\r\n              “If you turn the ball over 22 times and you’re minus-nine in the free throw game, end of story,” Clifford said. “It’s hard to win.”\n\n\r\n              Mason Plumlee had 16 points and 15 rebounds for the Hornets, who are 5-21 against Eastern Conference opponents.\n\n\r\n              “Our defense is just not where it needs to be,” Clifford said.\n\n\r\n              Siakam and Anunoby each scored 12 points in the first quarter and the Raptors led 38-29 after one.\n\n\r\n              Ball scored 13 points in the second, but Charlotte turned the ball over eight times in the quarter, coughing it up on five straight possessions at one stretch. Toronto led 69-55 at the break.\n\n\r\n              Siakam had 10 points in the third, but the Hornets closed the gap behind 14 points from Rozier. Toronto took a 97-88 lead to the fourth.\n\n\r\n              PASCAL PRODUCES\n\n\r\n              Siakam scored 30 or more for the seventh time this season. Toronto is 15-6 over the last two seasons when Siakam scores at least 30 points.\n\n\r\n              TIP-INS\n\n\r\n              Hornets: F Gordon Hayward (left hamstring) missed his fifth straight game and G Kelly Oubre Jr. (left hand surgery) missed his seventh. … Recorded a season-high 42 rebounds. … Dropped to 6-18 on the road, and 1-9 against Atlantic Division teams.\n\n\r\n              Raptors: Recorded assists on 12 of 15 made baskets in the first quarter. … Barnes had nine assists and eight rebounds… Shot 10 for 28 from 3-point range after making a season-high 20 from long distance Tuesday.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host Boston on Saturday night.\n\n\r\n              Raptors: Host Atlanta on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994058.325423
}