{
  "game_id": "0022400227",
  "espn_id": "401704793",
  "date": "Nov 13, 2024",
  "matchup": "PHX @ SAC",
  "headline": "Fox, Kings beat short-handed Suns for 2nd time in 4 days, 127-101",
  "body": "SACRAMENTO, Calif. -- — De’Aaron Fox had 29 points and 10 assists, Kevin Huerter scored a season-high 22 points and the Sacramento Kings beat the Phoenix Suns 127-101 on Wednesday night.\n\n\r\n              Domantas Sabonis added 11 points, 10 rebounds and seven assists to help the Kings to their second victory in four days against the Suns, who were without Kevin Durant for the third straight game because of a strained calf.\n\n\r\n              Josh Okogie had a season-high 25 points and eight rebounds for the Suns, who also were without Bradley Beal (calf) and Grayson Allen (hamstring). Devin Booker had 18 points.\n\n\r\n              The Kings' DeMar DeRozan did not play in the second half because of lower back tightness.\n\n\r\n              The Kings led by 26 before Phoenix made a charge in the fourth quarter and got five at 93-88 on Okogie’s layup with 10:22 remaining. Fox stopped the Suns’ run with a short jumper then made a 3-pointer.\n\n\r\n              Takeaways\r\n              Suns: Phoenix showed a lot of grit while playing the second game of a back-to-back and kept the game competitive despite trailing most of the game.\n\n\r\n              Kings: Sacramento made significant strides in a lot of areas, most specifically in defending the 3-pointer. Phoenix had 18 3s against Sacramento four days earlier, but shot shot just 13 of 43 behind the arc Wednesday.\n\n\r\n              Key moment\r\n              Sacramento was settling for mid-range shots early in the third quarter until Fox drove around and Mason Plumlee in the paint and scored, sparking a 10-2 run.\n\n\r\n              Key stat\r\n              The Kings were much sharper with their perimeter offense than they have been. Four days after shooting 11 of 37 behind the arc in Phoenix, Sacramento went 11 of 22.\n\n\r\n              Up next\r\n              The Suns are at Oklahoma City on Friday night. The Kings host Minnesota on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998335.9788082
}