{
  "game_id": "0022200606",
  "espn_id": "401468761",
  "date": "Jan 09, 2023",
  "matchup": "CHI @ BOS",
  "headline": "Celtics top Bulls 107-99, improve NBA's best record to 29-12",
  "body": "BOSTON -- — Jayson Tatum scored 32 points and Jaylen Brown added 19 as the Boston Celtics beat the Chicago Bulls 107-99 Monday night and reached the midway point of their season with the NBA's best record.\n\n\r\n              Grant Williams added 20 points and Al Horford had seven rebounds and eight points, including a clutch 3-pointer with 24 seconds to play that helped seal the win for the defending Eastern Conference champions, who are 29-12 after the first 41 games. \n\n\r\n              \"That was big. Regardless of their record, it’s a really talented team. Any given night, they can beat anybody,\" Tatum said, noting the Celtics were able to only split the four-game season series with the Bulls.\n\n\r\n              Chicago also lost star forward DeMar DeRozan to an injury in the third quarter, yet managed to trim Boston's 16-point lead to two points with two minutes left to play. \n\n\r\n              “They’re always going to play you tough,\" said Tatum, who also had eight rebounds and seven assists. \n\n\r\n              Malcolm Brogdon scored 20 points for Boston, which played without injured point guard Marcus Smart. \n\n\r\n              Zach LaVine led Chicago with 27 points, scoring 15 in the fourth quarter while leading the Bulls' furious comeback bid. \n\n\r\n              “The way he played gave us a chance to win and I thought our guys competed and battled,” Chicago coach Billy Donovan said. “But I thought there were some things we needed to clean up, like the rebounding and some of the straight-line drives and some of the late rotations.\"\n\n\r\n              Chicago, which had won three straight, lost DeRozan in the third quarter with a strained right quadriceps. Nikola Vucevic had 21 points and 13 rebounds for Chicago. DeRozan finished with 13 points in 23 minutes. \n\n\r\n              A 3-pointer by LaVine pulled Chicago within 99-97 late in the fourth, but the comeback stalled when he missed a jumper in the final minute and the Celtics got the rebound to Tatum, who dribbled about 20 seconds off the clock before getting the ball to Horford for a 3-pointer. Horford's shot bounced off the rim, then found its way through for a 104-99 lead with 24 seconds left. \n\n\r\n              “Credit to Al. That was a big-time shot,” Tatum said. \n\n\r\n              LaVine missed again for the Bulls and Tatum broke free for a two-handed dunk, drawing a foul and converting the free throw to seal it with 12 seconds remaining. \n\n\r\n              Down 11 points entering the fourth quarter, a layup by LaVine pulled Chicago within 89-84. But the Celtics answered the surge with Brown’s back-to-back jumpers and a three-point play by Williams. \n\n\r\n              The Celtics led 59-50 at halftime, matching their largest lead of the game after the Bulls committed three of their six turnovers in the final few minutes and the Celtics capitalized with a 9-2 run to close the period.\n\n\r\n              NOW STARTING \n\n\r\n              Without Smart, Boston coach Joe Mazzulla shuffled his lineup and gave center Robert Williams his first start of the season. Williams, who was recovering from knee surgery and didn't make his season debut until December, finished with six points, seven rebounds and blocked a pair of shots. \n\n\r\n              DEROZAN UPDATE\n\n\r\n              Donovan hoped DeRozan wouldn't be out long, although he was working with very few details after the game and waiting for a more definitive report. \n\n\r\n              TIP-INS\n\n\r\n              Bulls: G Alex Caruso returned in the first quarter after missing the last two games with a sprained right ankle. He finished with six points .... G Javonte Green (right knee soreness) and C Tony Bradley (health and safety protocols) did not play. \n\n\r\n              Celtics: Tatum had 10 points midway through the first quarter and scored 12 of Boston’s 28 points in the opening the period. ... Smart left in the third quarter Saturday in a win at San Antonio after bumping knees with Zach Collins. \n\n\r\n              UP NEXT\n\n\r\n              Bulls: Visit Washington on Wednesday night. \n\n\r\n              Celtics: Host New Orleans on Wednesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994492.7780118
}