{
  "game_id": "0022300690",
  "espn_id": "401585318",
  "date": "Feb 02, 2024",
  "matchup": "ATL vs. PHX",
  "headline": "Trae Young posts 32 points, 15 assists as the Hawks beat the Suns 129-120",
  "body": "ATLANTA -- — Trae Young had 32 points and 15 assists and the Atlanta Hawks beat the Phoenix Suns 129-120 on Friday night.\n\n\r\n              Young, who was not selected for the upcoming All-Star game, shot 7 for 11 from 3-point distance and added three steals. He entered the game averaging 27 points and 10.9 assists.\n\n\r\n              “Obviously Trae wants to be in the All-Star game. Anyone who plays in this league wants to,\" Hawks coach Quin Snyder said. \"One of the things about the way he is playing, he’s not playing for accolades. He’s playing to win, and you saw that tonight. ... Trae did some special things tonight and I don’t know if he did that because he had any extra motivation. You’ll have to ask him. I just felt like he was playing well.”\n\n\r\n              Young said he would go as an injury replacement if asked by the league. It would be his third All-Star appearance.\n\n\r\n              Bogdan Bogdanovic came off the bench to hit 4 of 7 shots from long distance and finish with 23 points for Atlanta, which has won three straight games. Dejounte Murray scored 22 points and Jalen Johnson 16.\n\n\r\n              “Sometimes you take it for granted, the shots that (Bogdanovic) hits,” Snyder said. “He’s always ready to shoot. He can shoot contested shots.”\n\n\r\n              Plenty of fans sported Kevin Durant jerseys for the Phoenix star's only visit to Atlanta. He led the Suns with 35 points, eight rebounds and eight assists. Devin Booker added 24 points.\n\n\r\n              But Young was the star of the game, accounting for the bulk of the Hawks' 17 3-pointers and, at one point, hitting a shot from behind the backboard. That basket didn't count, however, because it came after the whistle.\n\n\r\n              He hit some deep threes early, and the Suns tried trapping him to slow him down.\n\n\r\n              “The deep 3s pull the defense out, and it opens up the court not only for me, but my teammates once I get it out of the trap,” Young said.\n\n\r\n              The Suns, who committed 17 turnovers and were outrebounded 43-38, entered the game having won nine of their last 11 games, with all but three of those contests being road games.\n\n\r\n              “Our disposition wasn't great to start the game,” Suns coach Frank Vogel said. “We didn't have the same energy, focus and awareness that we had the last two games.”\n\n\r\n              The Hawks went on an 11-0 run at the end of the third quarter and the beginning of the fourth, with five team members scoring in the spurt. Atlanta led 104-95 after three periods.\n\n\r\n              Atlanta's Saddiq Bey sprained his ankle late in the first half and did not play in the second half. He finished with two points on 1-of-7 shooting. \n\n\r\n              Hawks forward De'Andre Hunter (knee) sat out after making his return Tuesday against the Los Angeles Lakers following a 19-game absence. He is expected to play Saturday against the Warriors. \n\n\r\n              UP NEXT\n\n\r\n              Suns: At the Wizards on Sunday in the final game of a seven-game trip.\n\n\r\n              Hawks: Host the Warriors on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996287.61659
}