{
  "game_id": "0021900044",
  "espn_id": "401160686",
  "date": "Oct 28, 2019",
  "matchup": "TOR vs. ORL",
  "headline": "Lowry scores 26 as Raptors beat Magic 104-95",
  "body": "TORONTO --  The Orlando Magic are the only NBA team still looking for their first 100-point game of the season. Another score in the 90s wasn't enough to stop the Toronto Raptors.\n\nKyle Lowry got 10 of his 26 points in the fourth quarter, Pascal Siakam added 24 and the Raptors withstood a late rally to beat the Magic 104-95 on Monday night for their third win in four games to start the year.\n\nMarc Gasol had 10 points and 10 rebounds, Fred VanVleet scored 14 and OG Anunoby added 12 as the Raptors won for the 10th time in 15 regular-season meetings with Orlando.\n\nJonathan Isaac scored a career-high 24 points, Evan Fournier had 18 and Markelle Fultz 13 for the Magic, who have lost two straight.\n\nEx-Raptor Terrence Ross scored 11 for Orlando, and D.J. Augustin had 10.\n\nIsaac and Fultz combined to shoot 13 for 21, but the rest of the Magic went 21 for 68.\n\n\"We've just got to stick to the plan,\" Isaac said. \"Guys haven't shot the ball great. I hit some shots tonight but I haven't shot the ball great. All of us, we just need to step up, make open shots and continue to trust the offense and we'll be OK.\"\n\nOrlando center Nikola Vucevic finished 1 for 13 and scored five points in 25 minutes. He did not play in the fourth.\n\n\"Offensively, we can't get much going,\" Vucevic said. \"We need to figure it out sooner than later.\"\n\nThe Magic trailed 81-67 after VanVleet's three-point play to begin the final quarter, but Ross' 3-pointer with 4:18 to play capped a 13-0 run that gave Orlando an 89-87 lead, its first since being up 9-7.\n\nAfter a timeout, Siakam halted the run with a three-point play. Fultz replied with a reverse layup but Lowry hit a 3, then made a pair of free throws to put Toronto ahead 95-91 with 2:35 to go.\n\n\"That's a sign of us hanging in there real strong,\" Raptors coach Nick Nurse said.\n\nLowry was later fouled on a 3-point attempt and made all three at the line. Toronto went 13 for 13 on free throws in the fourth.\n\n\"Lowry scored six points on mistakes late,\" Magic coach Steve Clifford said. \"That was it.\"\n\nAfter finishing 5 of 31 from 3-point range in Saturday's 103-99 loss to Atlanta, the Magic went 4 for 10 in the first quarter Monday. However, they shot 4 of 15 from inside the arc, missing 10 straight to begin the game. Isaac had three of Orlando's 3-pointers in the opening quarter.\n\nSiakam scored 11 points in the first and the Raptors were 6 of 13 from long range to lead 31-22 after one.\n\nToronto shot 4 for 20 in the second, missing 11 straight before consecutive baskets from Lowry in the final 28 seconds, including a buzzer-beating reverse layup that gave the Raptors a 51-46 halftime lead.\n\nGasol scored five points in an 11-2 Toronto run to start the third, and the Raptors took a 78-67 lead into the fourth.\n\nTHROWBACK\n\nOn the first of six nights scheduled to celebrate the Raptors' 25th anniversary season, Toronto wore its original warmups and pinstriped dinosaur jerseys. The game was played on a replica of the 1995 court, with 2-point territory shaded purple.\n\nFAMILIAR FOE\n\nOrlando beat Toronto in Game 1 of the first round of the playoffs last spring, but the Raptors bounced back to win the series in five games before going on to capture the first NBA title in franchise history.\n\nBAD MEMORY\n\nVucevic said he couldn't recall enduring such a rough shooting performance.\n\n\"I don't remember going 1 for 13,\" he said. \"I don't think I've ever done that before.\"\n\nUNDER 100\n\nToronto, which beat Chicago 108-84 Saturday, has held opponents below 100 points in back-to-back games. The Raptors did that three times last season.\n\nSONG REMAINS THE SAME\n\nThe national anthems were performed by Canadian musical act Barenaked Ladies, the same group that sang the anthems on the first opening night in Raptors history in 1995.\n\nTIP-INS\n\nMagic: Vucevic led all players with 12 rebounds. ... Isaac shot 4 for 5 in the first but the rest of the Magic went 4 for 20. He finished with a career-high five 3-pointers on seven attempts.\n\nRaptors: Lowry and VanVleet each had six assists. . Serge Ibaka had nine points and 10 rebounds. . F Patrick McCaw was active for the first time this season after missing the previous three games because of a sore left knee.\n\nUP NEXT\n\nMagic: Host the New York Knicks on Wednesday.\n\nRaptors: Host the Detroit Pistons on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995666.608007
}