{
  "game_id": "0021600192",
  "espn_id": "400899642",
  "date": "Nov 19, 2016",
  "matchup": "CHI @ LAC",
  "headline": "Led by Speights, Clippers rally in 4th to beat Bulls 102-95",
  "body": "LOS ANGELES --  The Clippers needed more offense and Mo Buckets delivered in the clutch.\n\nMaurice Speights scored 11 of his season-high 16 points in the fourth quarter, rallying Los Angeles past Chicago 102-95 on Saturday night to snap the Bulls' four-game winning streak.\n\n\"You can take losing in this league, but you don't want to lose that way,\" Chicago's Dwyane Wade said.\n\nEven with all the offense, Speights' biggest play came on an assist with 49 seconds left . Jamal Crawford missed a 3-pointer and Speights grabbed the offensive rebound. He fed Crawford for a driving reverse layup that restored the Clippers' lead to five points.\n\n\"I was in position to get it and he didn't expect it so I surprised him,\" said Speights, who was yanked after going scoreless during a brief stint in the first half.\n\nClippers coach Doc Rivers said, \"It was a great example where you just got to figure it out.\"\n\nBlake Griffin had 26 points and 13 rebounds and Chris Paul added 19 points for the Clippers, whose only two losses have come at home to Oklahoma City and Memphis. Rallying from a 19-point deficit for the victory moved them to an NBA-best 12-2.\n\nWade led Chicago with 28 points, hitting five 3-pointers. Jimmy Butler added 22 points, making 11 of 12 free throws.\n\n\"They had to dig deep into their bag to pull this one out at home,\" Wade said. \"That's what we want to do, make teams walk away scarred up. Feeling like that got away with one, and that's what they should be feeling.\"\n\nThe Bulls made just one field goal over the final 6:30, keeping it close on seven consecutive free throws, including five by Butler. Isaiah Canaan hit a 3-pointer to draw them to 97-95 with 44 seconds left.\n\nButler fouled Griffin with 20 seconds to go and he made both for a 99-95 lead. Wade missed a pullup jumper before Taj Gibson and coach Fred Hoiberg were hit with technical fouls in the closing seconds. Hoiberg was ejected.\n\n\"That's a great team, playing the best basketball in the league,\" Hoiberg said. \"We fought them and we gave ourselves a chance.\"\n\nWade scored 10 of the Bulls' first 12 points to start the second quarter, pushing their lead to 19 points before the Clippers suddenly awakened.\n\nThey outscored Chicago 21-7 to head into halftime trailing 52-47.\n\nGriffin scored eight points, highlighted by his dunk over Robin Lopez off a bounce pass in the lane from Paul. Griffin elevated, with his left hand on Lopez's shoulder, and slammed the ball down, drawing a foul. Wade's wife, Gabrielle Union, grimaced from her fourth-row seat while the crowd roared.\n\nTIP-INS\n\nBulls: They shot 68 percent in the first quarter, their best in a quarter this season. ... They are 0-3 in the first game of a back-to-back and 1-1 in the second game.\n\nClippers: Griffin has scored 20-plus points in seven straight games. ... Since their home opener on Oct. 30, they have played 12 games in 20 days, most in the league in that span. They don't have two days off in between games until Dec. 5-6. ... C Diamond Stone was assigned to the Santa Cruz Warriors of the D-League after appearing in three games for the Clippers. Stone was the 40th overall pick in the June draft after playing one season at Maryland. ... F Wesley Johnson missed his fifth straight game with a left heel contusion.\n\nHE SAID IT\n\n\"He proves you can be a gentleman and a killer at the same time.\" -- Rivers on Butler.\n\nRONDO RETURNS\n\nRajon Rondo returned to Chicago's starting lineup after missing two games because of a sprained left ankle and bronchitis. He just missed a triple-double, finishing with nine points, 10 rebounds and eight assists.\n\nHoiberg said the team missed Rondo's energy.\n\n\"He's done a nice job of throwing the ball ahead, getting the ball to our wings where we can attack or getting the ball to the post,\" Hoiberg said.\n\nUP NEXT\n\nBulls: They stay in LA to play the Lakers on Sunday in the second game of a back-to-back, their third of the season. They swept the Lakers last season for the second time in three years.\n\nClippers: Host Toronto on Monday before departing on a six-game trip, their longest of the season.",
  "source": "espn_api",
  "crawled_at": 1764995099.139473
}