{
  "game_id": "0021900852",
  "espn_id": "401161494",
  "date": "Feb 24, 2020",
  "matchup": "BKN vs. ORL",
  "headline": "Magic rally to beat Nets 115-113, move closer to 7th place",
  "body": "NEW YORK --  The Orlando Magic were way down and in danger of falling further behind in the race for seventh place in the Eastern Conference.\n\nThey turned things around with their biggest comeback of the season and hope it shows they have plenty of fight left for the final stretch.\n\nAaron Gordon had 27 points, 10 rebounds and a big blocked shot in the final seconds, helping the Magic rally for a 115-113 victory over the Brooklyn Nets on Monday night.\n\nOrlando charged back from a 19-point deficit to move within 1 1/2 games of the Nets for the seventh spot in the East.\n\n\"We're in the hunt, so this was a good win to get for us,\" Gordon said. \"I feel like we've let go of a lot of games and now it's time to get a hold of them.\"\n\nTerrence Ross added 21 points and eight rebounds, Evan Fournier scored 21 and Nikola Vucevic had 16 points and 10 boards for the Magic, who were superb offensively in the second half when they couldn't rely on their trusty defense to get stops.\n\nOrlando scored 74 points after halftime, sparked in part by Vucevic urging his teammates to move the ball. Ross was 8 for 9 in the second half, when he had all his points.\n\n\"Every team in our league will have really good wins this year,\" Orlando coach Steve Clifford said. \"This was a really good win and we'll see, we'll see what we make of it.\"\n\nSpencer Dinwiddie had 24 points and eight assists for the Nets, who had won five straight at home by double digits and appeared poised to extend that streak.\n\n\"We all know what happened. There wasn't too much to talk about,\" Dinwiddie said. \"It ain't no secret sauce. . We got to play defense.\"\n\nThe Nets extended their lead to 67-48 early in the third before Vucevic rebounded from a two-point first half by going 5 for 5 for 12 points in Orlando's 40-point third quarter that cut it to 87-81.\n\nOrlando then opened the fourth with a 7-0 spurt, with Ross' dunk with 10:35 remaining making it 88-87 and giving the Magic their first lead since the first quarter. Neither team led by more than four from there.\n\nGordon's 3-pointer made it 115-111 with 1:12 to play, but Brooklyn cut it to two on Jarrett Allen's dunk. The Nets had a chance to tie, but Gordon blocked Caris LeVert near the rim with 14 seconds remaining.\n\nBrooklyn got a final chance after Orlando threw away an inbounds pass as Clifford tried to call a timeout, but couldn't get off a good shot.\n\nTIP-INS\n\nMagic: Injured F Jonathan Isaac, sidelined by a left knee injury, is with the team and Clifford said the plan is for him to travel for all road trips of more than one game. Isaac was hurt Jan. 1. \"He's feeling a lot better, so it's good to have him around,\" Clifford said.\n\nNets: LeVert scored 19 points and Allen had 16 points and 11 rebounds. ... The Nets fell to 10-3 against Orlando at Barclays Center, still their most wins against any opponent.\n\nIRVING UPDATE\n\nKyrie Irving still hasn't had surgery on his right shoulder that will end his first season in Brooklyn. The decision to have surgery was made last week after Irving saw a specialist, but coach Kenny Atkinson said there's a lot that goes into the timing of when the procedure will be done.\n\n\"I think you're tying to gather as much information and I know he's talking to the medical team, the performance team to find the best time, the best place, all that, best doctor,\" Atkinson said. \"And it's not even the best, it's like, what fits. And when we have more information we'll get it to you.\"\n\nSLAMMING THE DOOR\n\nGordon again said he won't enter the Slam Dunk Contest anymore at All-Star weekend after coming up short for the second time in a close contest this month in Chicago. Fans at Barclays Center taunted him at one point by chanting \"Wade don't like you! Wade don't like you!\" in reference to Dwyane Wade giving him a 9 on his final dunk that helped Miami's Derrick Jones Jr. win.\n\n\"I'm not going back there so they could rob me again,\" Gordon said.\n\nUP NEXT\n\nMagic: Visit Atlanta on Wednesday.\n\nNets: Visit Washington on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764996704.882103
}