{
  "game_id": "0022300895",
  "espn_id": "401585523",
  "date": "Mar 06, 2024",
  "matchup": "ATL vs. CLE",
  "headline": "Bey, Bogdanovic each score 23 points as Hawks recover, beat Cavaliers 112-101",
  "body": "ATLANTA -- — Saddiq Bey scored 23 points and the Atlanta Hawks recovered after losing a 21-point lead to beat the Cleveland Cavaliers 112-101 on Wednesday night.\n\n\r\n              Bogdan Bogdanovic also scored 23 points for the Hawks, who prevented the Cavaliers from sweeping the four-game season series.\n\n\r\n              Hawks coach Quin Snyder said he liked his players “not becoming discouraged or disconnected” when they were outscored 40-23 in the third period.\n\n\r\n              “Any time a team can go through some adversity like that and respond, it’s a good thing,” Snyder said.\n\n\r\n              One night after erasing a fourth-quarter deficit of 22 points in a 105-104 home win over Boston, the Cavaliers rallied to take the lead after trailing the Hawks by 21 points in the third. This time Cleveland couldn't make the comeback stand.\n\n\r\n              Cleveland led 89-87 but scored only 12 points in the final period. Bey scored 10 of Atlanta's 25 points in the fourth.\n\n\r\n              The Hawks gave credit to consistent play from their defense in the second half when their shooting faltered.\n\n\r\n              “No matter what happens on the offensive end, we can control our defensive effort,” Bey said. “... It was trying to lock in on that end.”\n\n\r\n              Jarrett Allen led Cleveland with 18 points and 19 rebounds. Isaac Okoro added 17 points.\n\n\r\n              Hawks forward Jalen Johnson sprained his right ankle early in the third period and was helped off the court. Johnson rolled the ankle while competing for an offensive rebound and did not return to the game.\n\n\r\n              Johnson, averaging 15.9 points and 8.7 rebounds, missed 14 games with a left wrist injury early in the season.\n\n\r\n              Dejounte Murray's jumper gave Atlanta its biggest lead at 73-52 in the third period. Murray scored 18 points and had nine assists.\n\n\r\n              The Cavaliers dominated the remainder of the period, taking an 89-87 lead on Caris LeVert's 3-pointer from the corner to end the period. LeVert's basket gave Cleveland its first lead since 28-25 in the first quarter.\n\n\r\n              Craig Porter Jr. sank a jumper for a 93-93 tie before a jam by Fernando Bruno gave Atlanta the lead for good.\n\n\r\n              Dean Wade, who scored 20 fourth-quarter points and a career-high 23 in Cleveland's win over Boston on Tuesday night, scored nine points. \n\n\r\n              The Cavaliers lost forward Evan Mobley with a sprained left ankle in the third period of the win over Boston. Mobley was held out against Atlanta and will be evaluated in about a week after tests confirmed the sprain. \n\n\r\n              Coach J.B. Bickerstaff said Mobley's ankle was “tender” on Wednesday. “We'll see how it goes,” Bickerstaff said.\n\n\r\n              Mobley missed 16 games in December and January following left knee surgery. \n\n\r\n              Cleveland also was still without All-Star guard Donovan Mitchell with a left knee bone bruise and guard Max Strus (right knee strain).\n\n\r\n              Hawks All-Star guard Trae Young is expected to miss at least two more weeks with a torn ligament in his left pinkie finger. Snyder said forward Onyeka Okongwu (left big toe sprain) is “making progress.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Minnesota on Friday night.\n\n\r\n              Hawks: Visit Memphis on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996274.798783
}