{
  "game_id": "0022100634",
  "espn_id": "401360453",
  "date": "Jan 14, 2022",
  "matchup": "IND vs. PHX",
  "headline": "Booker, Ayton help NBA-leading Suns beat Pacers, 112-94",
  "body": "INDIANAPOLIS -- — Devin Booker scored 35 points, Deandre Ayton had 27 points and 12 rebounds and the NBA-leading Phoenix Suns beat the Indiana Pacers 112-94 on Friday night.\n\n\r\n              Chris Paul added 12 points and nine assists for Phoenix, and Cam Payne had 11 points and five assists. The Suns finished the first half of the season 32-9, their second-best record in franchise history through 41 games.\n\n\r\n              “I'm a scoring guard and I get paid to make plays and put the ball in the bucket, that doesn't come without Deandre setting good screens, Chris getting the ball there on time,” Booker said. “Deandre having a dominant first half (21 points) made things open things up for all of us in the second half.”\n\n\r\n              Justin Holiday scored 25 points for Indiana, hitting seven 3s, Caris LeVert had 20, and Domantas Sabonis added 14 points and 14 rebounds. The Pacers have lost three in a row and nine of 10.\n\n\r\n              Booker scored 22 points in the third quarter to help the Suns take an 80-76 lead into the fourth. With the Pacers ahead 76-73, Phoenix had a 23-2 run to take a 96-78 lead.\n\n\r\n              “(Booker) made some tough shots,” Suns coach Monty Williams said. “We gave up 38 points in that third quarter so we needed something to offset that.”\n\n\r\n              Williams said the defense was the difference in the fourth quarter.\n\n\r\n              “We kept getting stop after stop after stop and it really helped us,” Williams said.\n\n\r\n              Neither team shot well in a low-scoring first half, with the Suns ahead 46-38 lead at the intermission. But Ayton kept the Suns in the lead.\n\n\r\n              “Their pick-and-roll coverage freed (Ayton) up in the middle and we did a good job finding him in the pocket,” Williams said. “He was able to take advantage of a smaller guy guiding him in the middle. The physicality of our guys tonight stepped up.”\n\n\r\n              Jalen Smith had 12 rebounds off the bench and Jae Crowder had 11.\n\n\r\n              “That's what we've talked about our team having to be more physical,” Williams said. “We outrebounded them by nine (51-42), that's huge for us. They had just nine offensive rebounds. Even games we didn't rebound as well, the effort was there. Tonight we just saw much more will and pursuit of the ball.\"\n\n\r\n              Pacers coach Rick Carlisle said he liked his team's competitive spirit in the first half.\n\n\r\n              “We couldn't get in rhythm offensively and they hit us with (8-0) late in the first half,\" Carlisle said. “The third quarter was tremendous. We were able to take a lead as brief as it was. We put defense and offense together and got into the type of game we need to play, which is pace, ball movement and recognition. The end of the third quarter and fourth they hit us with a run they are most capable of doing. They do it on a consistent basis to a lot of teams. It was a tough one to answer. Disappointed with outcome, but not with the effort.”\n\n\r\n              TIP-INS\n\n\r\n              Suns: Cam Johnson did not play for the second consecutive game because of a left ankle sprain. ... The Suns have a 1 1/2-game lead over Western Conference rival Golden State for top spot in the NBA.\n\n\r\n              Pacers: Jeremy Lamb was sidelined with a sore left knee. … Malcolm Brogdon, who played 17 minutes Wednesday night in a loss to Boston, was out with a sore right Achilles. The game against Boston was his first since Dec. 21 because of the Achilles injury. … Chris Duarte returned after missing the previous two games because of the birth of his daughter.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Detroit on Sunday.\n\n\r\n              Pacers: At Los Angeles Clippers on Monday.",
  "source": "espn_api",
  "crawled_at": 1764993036.482929
}