{
  "game_id": "0022000183",
  "espn_id": "401307799",
  "date": "May 05, 2021",
  "matchup": "MEM @ MIN",
  "headline": "Morant, Grizzlies hold on for 138-132 win over Wolves",
  "body": "MINNEAPOLIS -- — Ja Morant had 37 points and 10 assists and the Memphis Grizzlies held on for a 139-135 victory over the Minnesota Timberwolves on Wednesday night.\n\n\r\n                    Desmond Bane scored 22 points off the bench, including a few key 3-pointers late, and Kyle Anderson added 20 points for the Grizzlies.\n\n\r\n                    Morant had his highest total since a 44-point effort in the first game of the season. It was also his fifth 30-point, 10-assist effort this year.\n\n\r\n                    The big game for Morant came one day after he said in an interview that he believes he's a top-5 NBA point guard.\n\n\r\n                    “I believe in myself 100 percent. What I said was the confidence that I’ve got in myself to be in the top five point guards in the league,” Morant said. \"You have to back it up. That’s what I did.”\n\n\r\n                    Memphis overcame a big game from Timberwolves rookie Anthony Edwards, who tied his career high with 42 points. Karl-Anthony Towns scored 22 points but ran into foul trouble when he picked up his fifth foul late in the third quarter. D’Angelo Russell had 22 points and 14 assists in the loss.\n\n\r\n                    After trailing for much of the second half, Minnesota finally took a 128-127 lead on a Towns 3-point play with 3:04 remaining. Morant answered with a step-back 3-pointer over Towns, and Memphis never trailed again.\n\n\r\n                    Towns attempted a cross-court pass that went out of bounds with 1:43 remaining. Morant responded with a jumper at the other end. Bane later connected from downtown for a 135-130 Memphis lead with 55.5 seconds to play.\n\n\r\n                    “As they were making runs, we were trying to build a lead,” Grizzlies coach Taylor Jenkins said. “Our guys just stuck with it. Great communication, great execution on the defensive end.”\n\n\r\n                    Minnesota previously used a 16-2 run in the third quarter to take a 93-88 lead. Keying the run was a sequence from Edwards in which he scored a transition dunk and immediately stole the inbounds pass for another basket.\n\n\r\n                    Memphis answered Minnesota’s run, thanks in part to a pair of 3-point plays by Morant. The Grizzlies took a 107-103 lead into the fourth with a 17-8 run and never trailed in the fourth.\n\n\r\n                    Edwards set a Minnesota rookie record for most 3-pointers in a game when he hit his seventh 3 in the fourth quarter. He was 8 of 9.\n\n\r\n                    “He played outstanding tonight,\" Timberwolves head coach Chris Finch said of Edwards. “I'm sure he wants to win more than he wants to score 42, but it certainly shows what he's capable of, and for that we should all be pretty excited.”\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Dillon Brooks picked up a technical foul with 6:59 left in the third quarter. … Grayson Allen left Wednesday’s game with an abdominal strain and did not return. He played just six minutes.\n\n\r\n                    Timberwolves: Edwards became the youngest player in NBA history to make 150 3-pointers. … Edwards now has 31 20-point games this season, two shy of tying Christian Laettner for Minnesota’s rookie record.\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Memphis continues its three-game trip Thursday night at Detroit. The Grizzlies won their only meeting so far this year against the Pistons.\n\n\r\n                    Timberwolves: Minnesota begins its final trip of the season, a three-game swing beginning at Miami on Friday night. The Wolves beat the heat in mid-April in their lone meeting of the year.",
  "source": "espn_api",
  "crawled_at": 1764996916.840628
}