{
  "game_id": "0022300849",
  "espn_id": "401585477",
  "date": "Feb 29, 2024",
  "matchup": "CHA vs. MIL",
  "headline": "Giannis Antetokounmpo scores 24 points, Bucks beat Hornets 111-99 to sweep season series",
  "body": "CHARLOTTE, N.C. -- — Giannis Antetokounmpo had 24 points and 10 rebounds and the Milwaukee Bucks swept the four-game season series with Charlotte, beating the Hornets 111-99 on Thursday night to finish a home-and-home set.\n\n\r\n              Malik Beasley added 19 points — hitting five 3-pointers — and Bobby Portis had 14 points and 10 rebounds. The Bucks shot 16 of 39 from beyond the arc to give coach Doc Rivers his first four-game winning streak with the team.\n\n\r\n              The Bucks thrashed the Hornets by an average of 29.2 points this season — the largest margin in team history — after outscoring them by 38, 36 and 31 in the other three games. This game was closer, but not by much.\n\n\r\n              “It's veterans versus young players,” Rivers said about the matchup with the Hornets, three of which come after he was hired. “(Hornets coach) Steve Clifford is a hell of a coach and it's obvious to see, but he's a got a bunch of young guys who are learning how to play winning basketball. And one of his best players (LaMelo Ball) is out.”\n\n\r\n              Milwaukee shot 55% in the first half, including 9 of 18 on 3s, to build a 19-point lead at the break and was seriously challenged in the second half.\n\n\r\n              The Bucks have moved the ball extremely well during their four-game winning emphasizing extra passes to turn good shots into great ones.\n\n\r\n              Portis said that is a reflection on Rivers’ leadership.\n\n\r\n              “Shout to Doc,” Portis said. “Having a guy that can sit down with everybody and tell every player what he expects from them, it makes you own your role more. And I think the ball finds energy when you move it, play free and drive and kick. The ball finds the right man and everybody just lines up and shoots it.” \n\n\r\n              Brandon Miller led the Hornets with 21 points and Miles Bridges added 15 points and 10 rebounds.\n\n\r\n              It looked early on like it would be a replay of Tuesday night when the Bucks held the Hornets to 26 points in the first half en route to a 123-85 victory in Milwaukee.\n\n\r\n              Milwaukee jumped out to a 10-2 lead behind a driving dunk from Antetokounmpo to take control early. \n\n\r\n              The Hornets briefly clawed back into the game late in the first quarter after Thanasis Antetokounmpo was whistled for a technical foul on the bench for arguing a non-foul call against his younger brother Giannis. Thanasis Antetokounmpo screamed at officials after a scramble for the ball under the basket involving his brother and Charlotte's Bridges and Grant Williams. Giannis Antetokounmpo eventually came up with the loose ball and scored off the glass.\n\n\r\n              But the Hornets couldn't sustain the momentum, as the Bucks closed the first half with a 24-10 run behind Antetokounmpo and Damian Lillard, who finished with 17 points.\n\n\r\n              Clifford wasn't real happy with his team's defense.\n\n\r\n              “We gave up drives where we just had wrong stances, wrong angles and no help,” Clifford said. “Guys should not be blowing by us like they were.\"\n\n\r\n              Miller said the Bucks are playing at a “high clip,” adding that \"I think they’re getting ready for the playoffs, so of course it’s a great team.”\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Chicago on Friday night.\n\n\r\n              Hornets: At Philadelphia on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995954.29527
}