{
  "game_id": "0022000671",
  "espn_id": "401307460",
  "date": "Mar 24, 2021",
  "matchup": "CHI vs. CLE",
  "headline": "Balanced Cavaliers beat Bulls 103-94 without Sexton",
  "body": "CHICAGO -- — Darius Garland had 22 points and nine assists, Jarrett Allen added 19 points and nine rebounds, and the Cleveland Cavaliers used a balanced attack to defeat the Chicago Bulls 103-94 on Wednesday night without leading scorer Collin Sexton.\n\n\r\n                    Larry Nance, Jr. had 14 points and pulled down 14 rebounds as Cleveland limited Chicago’s top scorers Zach LaVine and Lauri Markkanen in the second half. Isaac Okoro finished with 12 points for Cleveland, which won for just the fourth time in its last 10.\n\n\r\n                    “We had contributions from everyone,\" Cleveland coach J.B. Bickerstaff said. “I thought we did a great job of moving and sharing the ball tonight.”\n\n\r\n                    Garland, a 21-year-old second-year pro, quarterbacked Cleveland's attack and strong second half. The point guard had 14 points in the half to help Cleveland nudge ahead to a six-point lead after three quarters before the Cavs put it away in the fourth.\n\n\r\n                    “Darius is a good player and he's growing into a leadership role,” Bickerstaff said. “He usually has what it takes when the ball is in his hands.\"\n\n\r\n                    Garland found himself in Nance's playful grip during a postgame Zoom interview. \n\n\r\n                    Moments after Garland started answering a reporter's question and said, “I was just trying to be aggressive like I always do,” the 6-foot-7 Nance pulled the 6-foot-1 Garland away from the camera. After kidding around, both players sat down and concluded the session.\n\n\r\n                    “(Darius) is great on that point guard job and he did it to perfection tonight,” Nance said. “He got his team across the finish line. He did an awesome job of directing us.”\n\n\r\n                    LaVine led Chicago with 22 points, getting 18 by the half on 6-for-8 shooting, including four 3-pointers. But the All-Star didn’t connect again until late and was held to two baskets on 12 shots in the second half.\n\n\r\n                    Markkanen had 13 points in the first half before cooling off and finishing with 17.\n\n\r\n                    “I don't think it was good game for anybody offensively,\" Bulls coach Billy Donovan said. “We didn't have any flow. We didn't play with any pace.”\n\n\r\n                    Coby White and Tomas Satoransky each had 11 points for Chicago, which has lost four of five.\n\n\r\n                    Sexton sat out after he experienced right hamstring soreness in the morning shootaround. Bickerstaff said the injury to the guard averaging 24 points wasn’t serious. \n\n\r\n                    The Bulls led 55-53 after a tight first half, during which each team hit 22 shots from the floor. But Chicago was more efficient, shooting at 53.7% opposed to Cleveland’s 43.1%.\n\n\r\n                    Both teams hit cold shooting stretches early and the Bulls committed six turnovers in the first quarter. That helped Cleveland open an eight-point lead with 4:32 left in the quarter, the biggest for either team in the half.\n\n\r\n                    The Bulls pulled into a 25-all tie at the end of the quarter as LaVine lofted in a 3 as time ran out.\n\n\r\n                    The Cavaliers opened a 78-72 lead after three quarters as the Bulls cooled off, shooting just 6 for 20 from the floor. LaVine went 0 for 5.\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: Bickerstaff hinted Sexton’s injury could be day-to-day. “It’s no major concern of anything lingering at this point. We’ll continued to monitor,” he said. ... With Sexton out, F Cedi Osman made his 16th start this season in a tweaked lineup. “Everybody has to chip in and do a little more,” Bickerstaff said. ... Kevin Love (right calf strain), Matthew Dellavedova (concussion, appendectomy) and Taurean Prince (left shoulder sprain) remained out.\n\n\r\n                    Bulls: Donovan said G/F Garrett Temple (sprained left ankle) was healthy enough to play, but he didn’t enter the rotation Wednesday. Temple had missed six games entering Wednesday and Donovan was concerned about his lack of playing time.\n\n\r\n                    LIMPING IN\n\n\r\n                    LaVine appeared to be limping late in the game, but Donovan didn't have a medical report. “There was no question he was limping. I got him off the floor immediately,\" Donovan said. “He said he wanted to play and I left him in there.\"\n\n\r\n                    ROAD TRIPPING\n\n\r\n                    The Cavaliers started a four-game trip Wednesday, the first of seven of eight games on the road. \n\n\r\n                    The Bulls play nine of their next 10 games away from United Center, all during a 17-day span in the pandemic-condensed schedule. “When you look at a schedule like that, you can get overwhelmed,” said Donovan, who noted the lack of time to practice. “These players have never been through this before.”\n\n\r\n                    UP NEXT:\n\n\r\n                    Cavaliers: At the Los Angeles Lakers on Friday.\n\n\r\n                    Bulls: At San Antonio on Saturday to start a four-game road trip. \n\n\r\n                    —\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997584.499894
}