{
  "game_id": "0021800112",
  "espn_id": "401070793",
  "date": "Nov 01, 2018",
  "matchup": "CLE vs. DEN",
  "headline": "Hernangomez, Paul Millsap lead Nuggets past Cavs 110-91",
  "body": "CLEVELAND --  The Denver Nuggets aren't getting too excited about their early season success.\n\nDenver moved to 7-1 with a 110-91 victory over the Cleveland Cavaliers on Thursday, the Nuggets' best start since going 8-0 in 1976-77.\n\nThe Nuggets are keeping their feet on the ground despite having the second-most wins in the NBA.\n\n\"I love the 7-1 start, but it doesn't mean a lot to me, to be honest,\" coach Michael Malone said. \"For us, the only real success will be measured in the postseason.\"\n\nJuancho Hernangomez scored 23 points and Paul Millsap added 16 to lead six players in double figures.\n\nThe Nuggets won their third straight. On Wednesday night in Chicago, they beat the Bulls 108-107 in overtime on Millsap's put-back with 0.1 seconds left.\n\nMillsap, in his 13th season, is not only being productive, but he's also a veteran voice in the locker room.\n\n\"We can't be content,\" he said. \"We can't be complacent. We just want to stay in the moment.\"\n\nJordan Clarkson led Cleveland with 17 points, and Cedi Osman added 13. Collin Sexton, the No. 8 overall pick, had 12 points. The Cavaliers dropped to 1-7. They have split two games under \"acting\" coach Larry Drew.\n\nDenver shot 6 for 17 in the first quarter and fell behind 29-17. After cutting it to 38-34, the Nuggets finished the second period on 16-4 run that included 13 straight points.\n\nMillsap had a simple explanation for the first quarter.\n\n\"At the start, we were shaking off some of the rust, I guess,\" he said.\n\nAsked what happened on Cleveland's end, Drew chuckled and said, \"That's a good question. We made bad decisions, we turned the basketball over, we couldn't make shots and our defense let us down.\"\n\nHernangomez had 12 points in the quarter, including three 3-pointers. The backup forward came into the game with 22 points for the season and didn't get off the bench Wednesday.\n\n\"Juancho was the best player on the floor for long stretches,\" Malone said. \"You've got to give a lot of credit to him.\"\n\nDenver led 50-42 at halftime and dominated the second half. The Nuggets' biggest lead was 26 points at 106-76.\n\nThe Nuggets won going away despite an off-night from leading scorer Nikola Jokic, who had averaged 21.6 points. The 7-footer scored four points in 22 minutes and didn't play in the fourth quarter.\n\nThe Cavaliers had another busy day off the court. Drew said contract negotiations with the team are going in a positive direction. Drew replaced Tyronn Lue, who was fired Sunday, but wants the Cavs to restructure his contract if he's going to become the team's interim coach.\n\nGuard J.R. Smith said he wants to be traded after being dropped from the rotation. The 15-year veteran has played in four of Cleveland's eight games. A few fans began a \"We want J.R.\" chant as Denver built the lead in the second half.\n\nNBA Commissioner Adam Silver announced Thursday that the Cavaliers have been awarded the 2022 NBA All-Star Game. The game will be a cornerstone event during the league's 75th anniversary.\n\nIT'S NOT EASY\n\nThe Cavaliers knew the transition without LeBron James would be difficult when he signed with the Los Angeles Lakers after leading Cleveland to four straight Finals and a championship in 2016. Forward Kevin Love is out indefinitely with a left foot injury, making matters more complicated.\n\n\"With LeBron leaving we take on a whole new identity,\" Drew said. \"We have no Kevin Love. We're trying to find out ways to score. We're trying to find out ways to play without Kevin and we have to find it out really quick.\"\n\nSTILL AILING\n\nNuggets G Isaiah Thomas has yet to appear in a game after undergoing hip surgery in March. Cleveland acquired Thomas from Boston for All-Star G Kyrie Irving prior to last season, but he didn't play until January because of the hip injury.\n\nThomas played in only 15 games with the Cavaliers before being dealt to the Lakers. He signed with the Nuggets in July.\n\nTIP-INS\n\nNuggets: Jokic scored 22 points with 12 rebounds and nine assists against the Bulls. He was 2 for 5 from the field Thursday. ... Denver was 12 for 22 from the field in the second quarter. ... Assistant coach Mark Price is in his first season with the Denver. He spent the first nine seasons of his playing career with the Cavaliers and his No. 25 hangs in the rafters at Quicken Loans Arena.\n\nCavaliers: G Kyle Korver, a 16-year veteran, took a charging foul in the lane with Cleveland trailing 93-72 in the fourth quarter. ... Cleveland was held to 15 points in the second quarter and was 5 for 22 from the field with five turnovers.\n\nUP NEXT\n\nNuggets: Host Utah on Saturday.\n\nCavaliers: At Charlotte on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994807.187042
}