{
  "game_id": "0022300352",
  "espn_id": "401584980",
  "date": "Dec 18, 2023",
  "matchup": "DET @ ATL",
  "headline": "Trae Young stays hot with 31 points, 15 assists as Hawks hand Pistons 24th straight loss, 130-124",
  "body": "ATLANTA -- — Trae Young extended his recent hot streak with another double-double, scoring 31 points with 15 assists, as the Atlanta Hawks beat Detroit 130-124 on Monday night, handing the Pistons their 24th consecutive loss.\n\n\r\n              “I was not going to let them break their streak against us,” Young said.\n\n\r\n              The Pistons' last win came on Oct. 28 against Chicago. Detroit is two losses away from matching the NBA's longest losing streak in one season.\n\n\r\n              “I want to win, we all do,” said Cade Cunningham, who led the Pistons with a career-high 43 points. \n\n\r\n              “We've got a young team. We need these moments to learn and get better,\" he said.\n\n\r\n               Bojan Bogdanovic had 25 points for Detroit.\n\n\r\n              Young scored at least 30 points with at least 10 assists for the fourth consecutive game with his team-leading 16th double-double against the Pistons. \n\n\r\n              The Hawks made 9-of-12 3s in the first quarter, including two by Young, as they claimed an early lead they never lost despite repeated comeback attempts by the Pistons. Overall, Atlanta made 16-of-36 3s.\n\n\r\n              Pistons coach Monty Williams said Cunningham, the second-year player who was the No. 1 overall pick in 2021, “is just growing” and has been a leader through more than seven weeks without a win.\n\n\r\n              “It's tremendous watching his leadership through what will probably be the toughest stretch of his career,” Williams said.\n\n\r\n              Cunningham added team-leading totals of seven assists and three steals.\n\n\r\n              The NBA record for the longest losing streak within a single season is 26, shared by the 2010-11 Cleveland Cavaliers and 2013-14 Philadelphia 76ers. The 76ers lost a record 28 consecutive games over the 2014-15 and 2015-16 seasons.\n\n\r\n              Saddiq Bey scored 21 points for Atlanta and Dejounte Murray had 20. De'Andre Hunter's 19 points included two 3-pointers after Detroit pulled to within six points at 115-109. The Pistons again cut the deficit to six points at 126-120 on James Wiseman's layup with 1:34 remaining.\n\n\r\n              Wiseman missed two free throws with 1:03 remaining.\n\n\r\n              Atlanta appeared to be on the verge of putting the game away when Hunter stole a pass by Marvin Bagley III to set up a basket by Bey for a 47-31 lead midway through the second quarter. The Pistons trimmed the deficit to 61-52 at halftime.\n\n\r\n              Williams said before the game that center Isaiah Stewart is day to day with a left shoulder sprain. Center Jalen Duren (left ankle sprain) is not able to practice.\n\n\r\n              Atlanta's Clint Capela (left knee bone bruise) scored 17 points with a game-high 15 rebounds in his return after missing one game.\n\n\r\n              Hawks coach Quin Snyder said he hopes F Jalen Johnson (left wrist) can return soon. The Hawks improved to only 3-8 since losing Johnson. \n\n\r\n              “We definitely miss what he brings to our team,” Young said. “I just want him to be healthy when he gets back.”\n\n\r\n              Hawks guard Bogdan Bogdanovic (right ankle inflammation) participated in pregame drills but missed his second consecutive game.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host the Utah Jazz on Thursday.\n\n\r\n              Hawks: Visit Houston Rockets on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995781.186837
}