{
  "game_id": "0022400521",
  "espn_id": "401705087",
  "date": "Jan 09, 2025",
  "matchup": "POR @ DAL",
  "headline": "Hardy scores 25 and Mavericks use late 16-0 run to rally past Trail Blazers 117-111",
  "body": "DALLAS -- — Jaden Hardy scored a season-high 25 points off the bench, P.J. Washington had 23 points and 14 rebounds and the Dallas Mavericks used a late 16-0 run to beat the Portland Trail Blazers 117-111 on Thursday night.\n\n\r\n              Dereck Lively II added season highs with 21 points and 16 rebounds for the Mavericks, who are still without All-Star guards Luka Doncic and Kyrie Irving. Dallas has won two straight following a season-long five-game losing streak. \n\n\r\n              Anfernee Simons and Shaedon Sharpe each scored 22 points to lead the Blazers, who split a road back-to-back are are 2/3 on their trip.\n\n\r\n              Scoot Henderson scored 20 off the bench, hitting all 12 of his free throws.\n\n\r\n              Portland led 109-99 with 4:33 to play but then missed its next six field-goal attempts and committed two turnovers. Washington hit two free throws tying the score at 109-109 with 2:26 left and followed with a right-corner 3-pointer for a 112-109 lead with 1:58 to go.\n\n\r\n              Takeaways\r\n              Blazers: They went in averaging 12.1 3-pointers and surpassed that late in the third period but were only 3 of 9 behind the arc in the fourth quarter.\n\n\r\n              Mavericks: Hardy, averaging 7.6 points per game this season, has averaged 18.0 over the past four games. It was a quiet night for Klay Thompson, who went 1 of 6 from the floor and 0 for 4 from 3-point range for three points.\n\n\r\n              Key moment\r\n              With the score 112-109, Dallas’ Quentin Grimes tipped back Spencer Dinwiddie’s miss with 40 seconds left, then turned a one-hand heave into a three-point play to complete the 16-point run at 115-109 with 31.8 seconds left.\n\n\r\n              Key stat\r\n              Dallas, playing without its best outside shooters, outscored Portland 58-38 in the paint.\n\n\r\n              Up next\r\n              The Blazers host Miami on Saturday night. The Mavericks will play the first of consecutive home games against Denver on Sunday.\n\n\r\n              ------\n\n\r\n              This story has been changed to correct that Lively had 16 rebounds, not 15.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998181.657022
}