{
  "game_id": "0021500014",
  "espn_id": "400827901",
  "date": "Oct 28, 2015",
  "matchup": "PHX vs. DAL",
  "headline": "8 Dallas players reach double figures, Mavs rout Suns 111-95",
  "body": "PHOENIX -- Talk about balance. The Dallas Mavericks had double-figure scorers galore in a season-opening rout of the Phoenix Suns.\nRaymond Felton scored 18 points to lead eight Dallas players in double figures and the Mavericks rolled past the Suns 111-95 on Wednesday night.\n\"It was a tremendous team effort,\" Dallas coach Rick Carlisle said. \"We had eight guys in double figures, which is going to be one of our calling cards because we got to have great balance.\"\n\nDirk Nowitzki, in his 17th NBA season, scored nine of his 11 points in the third quarter when the Mavericks built a 27-point lead. Phoenix never got closer than 14 again.\nDeron Williams and Dwight Powell scored 12 apiece for the Mavs.\nRookie Devin Booker scored 14 points on 6-of-7 shooting for the Suns, all in the second half. Brandon Knight had 15 points, Jon Leuer 14 and Eric Bledsoe 13 for Phoenix.\nDallas ended the first half with a 13-4 run and started the second with a 12-4 burst for a 66-49 lead on Nowitzki's 22-footer.\n\"We really got after them and we started to attack the basket,\" Felton said. \"We started making things easy for us.\"\nPhoenix managed a run late. Bledsoe's three-point play, followed by a 13-foot jumper, cut it to 92-78 with 8:06 left. Dallas scored the next seven points with Felton's 3-pointer putting the Mavericks comfortably back on top 99-78 with 6:54 to go. Dallas led by as many as 28 points in the final quarter.\n\"We stayed in attack mode all night and never let up,\" Carlisle said, \"and that is how we are going to have to play. `'\nThe game was close most of the first half. The Suns' Archie Goodwin made a 3-pointer to tie it 41-41 4:04 before the break. Charlie Villanueva made a 22-footer and a 3-pointer in the surge that put Dallas up 54-45 at halftime.\nCoach Jeff Hornacek said the Suns just need to \"flush it down the toilet\" and go on to the next game.\n\"I think everybody from top to bottom can take a piece of this loss,\" said the Suns' Tyson Chandler, who has twice left Dallas in free agency over the past four years.\nWILLIAMS SCARE\nWilliams had been out with a calf injury and didn't play at all until a 15-minute appearance in the team's final preseason game. But he gave the Mavericks a scare when he went down in front of the scorer's table midway through the third quarter. He was helped to his feet and limped off. But the Mavericks pronounced it only a sore knee and Williams was back on the court before the quarter ended.\nROOKIE SHOW\nBooker, barely 19 years old, was the designated sharpshooter off the bench for Kentucky last season, and he made the most of his time on the court in his NBA opener.\nHis first basket as a pro was a 15-foot jumper with 2:50 left in the third quarter. He ended the quarter with his first NBA 3-pointer.\nHornacek appreciated Booker's aggressive offense, but the youngster has a lot to learn about NBA defense.\n\"I think he got back-doored on one and that's when a veteran says, `I got a rookie and I'm going to pick on him,\" Hornacek said. \"That's how you learn. Overall, for the first game, I thought he played pretty well.\"\nTIP-INS\nMavericks: Friday is a day off so Nowitzki plans to fly back to Phoenix for the ceremony inducting friend and former teammate Steve Nash into the Suns Ring of Honor. ... All 10 of Villanueva's points came in the first half. ... The Mavericks' Salah Mejri became the first Tunisian to appear in an NBA game.\nSuns: The honor for Nash comes just five years after he led the team to the playoffs for the last time. He led Phoenix to the Western Conference finals three times in six years. The Suns haven't been in the postseason since. ... Knight had six turnovers. ... Phoenix had 10 players with at least one foul in the first half. ... Hornacek played all 13 players in the first half. ... The Suns made 6 of 24 3s.\nUP NEXT\nThe Mavericks are at the Los Angeles Clippers on Thursday night.\nThe Suns are home against Portland on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994888.36948
}