{
  "game_id": "0021901250",
  "espn_id": "401224725",
  "date": "Aug 03, 2020",
  "matchup": "MIA vs. TOR",
  "headline": "VanVleet scores career-best 36, Raptors top Heat 107-103",
  "body": "LAKE BUENA VISTA, Fla. --  Fred VanVleet made another case for a big payday later this year\n\nVanVleet scored a career-high 36 points and made seven 3-pointers, and the defending NBA champion Toronto Raptors added to their strong restart with a 107-103 victory over the Miami Heat on Monday.\n\nVanVleet, who is set to become an unrestricted free agent after the season, finished 7 of 12 from beyond the 3-point arc and was a perfect 13 of 13 from the foul line, topping his 34-point total against the Pelicans last December.\n\nThe 26-year-old VanVleet is in the midst of a two-year, $18 million contract, but figures to cash in this coming offseason after helping the Raptors win a championship and then following that up with another strong season in which he's averaging 17.5 points and 6.7 rebounds.\n\nPascal Siakam added 22 points and Kyle Lowry had 14 points and eight rebounds for the Raptors, who improved to 2-0 in the bubble. Toronto resumed its season by beating the Lakers and remains in second place in the Eastern Conference.\n\nGoran Dragic had 25 points for the Heat.\n\nMiami beat Toronto twice this season, but the Raptors avoided the season sweep behind VanVleet, who poured in deep 3s and repeatedly found his way to the foul line in the third quarter with strong drives.\n\nThe Raptors led by 17 midway through the third quarter before the Heat pulled ahead on Dragic's corner 3 with 10:11 remaining in the game. The Raptors regained command when Serge Ibaka, who had 15 points, added two dunks on back-to-back possessions.\n\nStill, Miami wouldn't go away.\n\nJae Crowder hit a 3 and Dragic drew a charge on VanVleet to give the Heat a chance. Dragic scored on a drive on the ensuing possession and drew a foul, but missed the potential game-tying free throw with 40 seconds left -- Miami's first miss in 16 attempts.\n\nThe Heat still had a chance when Lowry missed a reverse layup.\n\nBut two late turnovers cost the Heat a chance to win. Jimmy Butler couldn't handle a pass from Dragic on a backdoor cut and the ball scooted out of bounds with 17,.4 seconds left. Then Butler turned it over after a side inbounds play when his pass to Dragic was deflected by VanVleet.\n\nHeat coach Erik Spoelstra refused to blame rust from the time off as a reason for the mistakes, saying \"that's basketball.\"\n\n\"You have the ball in those two guys' hands and you live with the results,\" Spoelstra said. \"You hear it can be a make-or-miss league, but it can be something like that as well.\"\n\nOlynyk added 17 points and Crowder and Butler each had 16 for Miami, which fell to 1-1 since the restart.\n\nTIP-INS:\n\nRaptors: Siakam carried his team early with 15 points in the first quarter on 5-of-7 shooting, including three 3s. The rest of the team was just 3 of 16. ... Lowry drew his league-leading 32nd charge of the season. ... Lowry also passed Michael Jordan in career assists.\n\nHeat: The Heat made just 5 of 23 3-pointers in the first half, but trailed only by four. ... Kendrick Nunn, Duncan Robinson, Bam Adebayo, Jae Crowder and Butler started for the Heat for the second straight game. ... Duncan Robinson has made a 3-pointer in 52 straight games.\n\nTHE ATTIRE\n\nThis is the first game with both the names and social messages on the backs of the jerseys.\n\nUP NEXT:\n\nRaptors: Play Magic on Wednesday.\n\nHeat: Play Celtics on Tuesday. \"We know it's a back-to-back and there are no excuses,\" Dragic said. \"We need to bring our best.\"\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995479.927531
}