{
  "game_id": "0022000648",
  "espn_id": "401307437",
  "date": "Mar 21, 2021",
  "matchup": "TOR @ CLE",
  "headline": "Sexton scores 36, Cavs hand Raptors eighth straight loss",
  "body": "CLEVELAND -- — Collin Sexton scored 23 of his 36 points in the second half, Jarrett Allen had 17 points and 15 rebounds and the Cleveland Cavaliers beat Toronto 116-105 on Sunday night, handing the Raptors their eighth straight loss.\n\n\r\n                    Dean Wade scored 16 points and Darius Garland had 15 points and six assists for Cleveland, which had dropped five of its previous six. Sexton’s 3-pointer gave the Cavaliers their largest lead at 97-75 early in the fourth.\n\n\r\n                    As time expired in the first half, Sexton and Toronto’s Norman Powell were involved in a dust-up and received technical fouls. The third-year pro said it placed a chip on his shoulder for the rest of the game.\n\n\r\n                    “They were jawing at me earlier, so I said some stuff back to them because I don’t back down,” Sexton said. “Coach (J.B. Bickerstaff) said you woke them up, now what are you going to do?\n\n\r\n                    “We knew they were going to be physical and punk us a little bit, so we just had to be ready to shoot and don’t pass up anything good.”\n\n\r\n                    Fred VanVleet had 23 points and seven assists for Toronto, while Kyle Lowry and Powell each scored 18 points. The Raptors have lost eight in a row for the first time since Jan. 10-22, 2012 and are a season-worst eight games below .500.\n\n\r\n                    VanVleet nailed a 3-pointer with 54 seconds left to pull Toronto within 110-105, but Larry Nance Jr. answered with a dunk and Wade and Sexton made two free throws apiece to complete the win.\n\n\r\n                    Toronto has fallen to 11th in the Eastern Conference, one spot out of the play-in tournament, and faces a decision on impending free agent Lowry before the NBA trade deadline Thursday.\n\n\r\n                    “I know that’s my (35th) birthday, so whatever else is happening on that day, I’m not worried about it,” Lowry said. “We’re trying to get everybody back together and into the groove and on the same page, so it’s tough. We just need that one win to get going.”\n\n\r\n                    The Cavaliers scored the first 12 points in the third, capped by Sexton’s 3-pointer to seize control 71-57. They finished 17 of 33 beyond the arc and dominated the rebounding battle 54-37, allowing them to overcome 27 turnovers that cost them 26 points.\n\n\r\n                    Sexton shot 13 of 24 and tied his career best with six 3-pointers, raising his scoring average to 24.2. Cleveland has moved within three games of a play-in spot, but may deal disgruntled center Andre Drummond before the deadline.\n\n\r\n                    “I know Sexton is hard to play off the dribble, but you’ve got to come out to him,” Toronto coach Nick Nurse said. “Yeah, he may be 5 feet behind the line, but he made those shots.”\n\n\r\n                    Cleveland carried a 59-57 lead into the break as Sexton scored 13 points and Wade had 11. There were 10 lead changes and seven ties in the first half, but none after intermission.\n\n\r\n                    “You saw a different fire in Collin’s eyes after what happened at the end of the first half,” Allen said, laughing. “He wanted to go after Norman Powell. He wanted to go after all those guys.”\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: VanVleet has made at least one 3-pointer in a franchise-record 69 consecutive games. … F Chris Boucher is the only Toronto player to appear in all 42 contests. … The Raptors play 14 of their next 20 at their temporary home of Tampa. “This season has been about as hard as it could have been, to be honest,” Nurse said. “But I believe these things even out, so things should be looking awesome soon.”\n\n\r\n                    Cavaliers: C JaVale McGee (illness) returned after missing one game. … G Matthew Dellavedova (appendectomy) has participated in back-to-back practices, but was inactive. He suffered a concussion in December and has yet to make his season debut. … G Quinn Cook is expected to sign a second 10-day contract. … F Kevin Love (right calf soreness) and F Taurean Prince (left shoulder sprain) remain out.\n\n\r\n                    SAFETY FIRST\n\n\r\n                    Nurse was fined $50,000 for throwing his facemask behind the scorer’s table Thursday after Toronto’s 115-112 loss to Utah in Tampa, Florida. He expressed regret, explaining that he was struggling to communicate. “Coaching is difficult to do while wearing a mask, but I’ve got to do a better job,” Nurse said. “That’s on me to adjust to it. I just hope the money goes to a good cause.”\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Visit Houston on Monday. \n\n\r\n                    Cavaliers: Host Sacramento on Monday, the Kings' first trip to Cleveland since Dec. 7, 2018.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996847.085237
}