{
  "game_id": "0022000881",
  "espn_id": "401307679",
  "date": "Apr 21, 2021",
  "matchup": "CLE vs. CHI",
  "headline": "Collin Sexton scores 30 points, Cavs beat Bulls 121-105",
  "body": "CLEVELAND -- — Collin Sexton scored 30 points, Darius Garland added 25 and the Cleveland Cavaliers never trailed in a 121-105 victory over the Chicago Bulls on Wednesday night, snapping a five-game home losing streak.\n\n\r\n                    Cleveland coach J.B. Bickerstaff was not at the game for personal reasons, but is expected to return to the bench Friday. Assistant coach Greg Buckner, a former NBA guard, filled in for his longtime friend and colleague.\n\n\r\n                    “It was a blast, to be honest with you,” said Buckner, who served as a head coach for the first time. “You don’t get in this business to be an assistant coach, you get in it to be a head coach. This is cool and all, but I know our team has got bigger fish to fry.”\n\n\r\n                    Kevin Love posted 15 points and nine rebounds for the Cavaliers, who built their largest lead of the season at 94-61 in the third quarter on their way to their first win at Rocket Mortgage FieldHouse in a month. Sexton also had a game-high seven assists.\n\n\r\n                    Lauri Markkanen scored 14 of his 16 points in the second half and Thaddeus Young had 14 points and eight rebounds for Chicago. The Bulls fell a half-game out of the final play-in tournament spot in the East, while Cleveland moved within 3 1/2 games.\n\n\r\n                    “Teams are coming out ready to jump us and they imposed their will tonight,” Young said. “We’re not the type of team that can feel our way out. We need to be aggressive and get right into it from the start.”\n\n\r\n                    Coby White had 14 points and six assists, and Tomas Satoransky scored 13 points off the bench for Chicago. Zach LaVine — the sixth-leading scorer in the NBA at 27.5 points — missed his fourth straight game because of the league’s health and safety protocols.\n\n\r\n                    The Bulls pulled as close as 112-97 on Denzel Valentine's layup with 5:33 remaining, but the Cavaliers scored the next five points to end the threat. Larry Nance Jr. and Isaiah Hartenstein finished with 10 points apiece for Cleveland, which forced 20 turnovers.\n\n\r\n                    “We were playing free and having fun, which is big because when you feel better, you play better,” Sexton said. “You have to have each other’s back. We were passing up good shots to find better ones for our teammates tonight.”\n\n\r\n                    Love’s third 3-pointer of the opening half gave the Cavaliers a 47-22 advantage midway through the second quarter. Chicago had seven turnovers, six field goals and no free throw attempts in the first.\n\n\r\n                    “They were the aggressive team right from the start, which was disappointing because we were playing catch-up from there,” Bulls coach Billy Donovan said. “Sexton and Garland really were able to control and maintain the basketball.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: F Troy Brown Jr. (left ankle sprain) was unavailable and is expected to be sidelined until at least this weekend. “I don’t think it’s severe and something that will take weeks,” Donovan said. “It looks more like a short-term situation.” Brown was acquired from Washington in a March 25 trade. … Chicago has only had one winning month, going 8-6 in February. The Bulls are 5-7 in April with five games remaining.\n\n\r\n                    Cavaliers: Rookie F Dylan Windler (left knee soreness) underwent surgery Tuesday to address pain in his left patella tendon. The Belmont product was a first-round draft pick in 2019, but missed last season with a stress fracture in his left leg. There is no timetable for his return. … C Mfiondu Kabengele signed a second 10-day contract. … G Damyean Dotson (left knee soreness) missed his sixth game in a row.\n\n\r\n                    THE NAME GAME\n\n\r\n                    Buckner is in his 10th season as an assistant coach in the NBA after a 10-year playing career, but Cavaliers center Jarrett Allen said earlier in the day that he didn’t realize his first name was Greg. “I can understand that because there are only two people in the world who don’t call me Buck,” Buckner said, laughing. “My son even calls me Buck.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Host the Charlotte Hornets on Thursday. Chicago is 11-18 at United Center and has the second-most home losses in the East.\n\n\r\n                    Cavaliers: Visit the Hornets on Friday. Cleveland has won the first two games in the three-game season series by 20 total points.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997869.036652
}