{
  "game_id": "401809960",
  "espn_id": "401809960",
  "date": "Oct 26, 2025",
  "matchup": "SA vs BKN",
  "headline": "Wembanyama has 31 points and 14 rebounds as Spurs remain unbeaten with 118-107 victory over Nets",
  "body": "SAN ANTONIO -- — Victor Wembanyama had 31 points, 14 rebounds and six blocks, and the San Antonio Spurs recovered after blowing a 26-point lead to beat the Brooklyn Nets 118-107 on Sunday and remain unbeaten.\n\n\r\n              San Antonio rookie Dylan Harper had 20 points, including seven in the final quarter to quell Brooklyn's rally. \n\n\r\n              The Spurs improved to 3-0 after quietly unveiling a banner to honor longtime coach Gregg Popovich and his 1,390 career victories in the regular season. In keeping with his humble personality, the Hall of Fame coach did want a ceremony to commemorate the banner or honor him and the franchise heeded his words as it has for three decades.\n\n\r\n              Cam Thomas scored 40 points to tie Kevin Durant for third on the Nets' career list with 10 40-point games, behind Vince Carter (17) and Kyrie Irving (14). \n\n\r\n              Michael Porter Jr. added 16 points and Nic Claxton had 10 for Brooklyn, which remained winless to open its second season under coach Jordi Fernandez.\n\n\r\n              San Antonio had four turnovers as Brooklyn built a 9-2 lead in the opening three minutes. The Spurs responded by closing the first quarter on a 29-15 run.\n\n\r\n              San Antonio led 81-55 with nine minutes left in the third but Brooklyn closed the quarter on a 26-7 run to narrow the gap to 88-81. Jalen Wilson’s 3-pointer capped a 9-1 run to open the fourth, giving the Nets their first lead since the opening minutes at 90-89.\n\n\r\n              San Antonio closed the game on a 10-0 run to win its home opener.\n\n\r\n              The Spurs remain without De'Aaron Fox (strained right hamstring), Jeremy Sochan (sprained left wrist) and Kelly Olynyk (left heel surgery). Reserve center Luke Kornet joined that early injury list with a sprained left ankle sustained Friday in San Antonio's 120-116 win in New Orleans.\n\n\r\n              Up next\r\n              Nets: Visit Houston on Monday.\n\n\r\n              Spurs: Host Toronto on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042502.994221
}