{
  "game_id": "0021800380",
  "espn_id": "401071061",
  "date": "Dec 08, 2018",
  "matchup": "ATL vs. DEN",
  "headline": "Collins leads Hawks past Nuggets 106-98",
  "body": "ATLANTA --  John Collins was most pleased that Atlanta avenged a blowout loss to Denver.\n\nCollins scored a career-high 30 points, and Vince Carter and DeAndre' Bembry came off the bench to fuel a third-quarter rally that helped the Hawks beat the Nuggets 106-98 on Saturday night.\n\nCollins thought back to a 138-93 loss to the Nuggets last month.\n\n\"It's very important when you're going against a team like that runs almost every offensive set they have through him,\" Collins said. \"It's very important to stay aggressive and make every touch as tough as possible.\"\n\nCollins added 12 rebounds and five assists and played Denver center Nikola Jokic at least evenly although they were not always matched up.\n\nJokic had 24 points, 11 rebounds and seven assists, but in closing a five-game trip with the final four games in the Eastern time zone, the injury-riddled Nuggets ran out of gas and faded while watching a 56-51 halftime lead vanish in Atlanta's 35-21 third quarter.\n\nThe Hawks (6-20) snapped a four-game losing streak.\n\n\"They came out in the third quarter and beat our butts,\" said Denver coach Jeff Malone. \"The third quarter our defense was non-existent. This was one of our worst performances of the year.\"\n\nDenver (17-9) dropped games on back-to-back nights for the first time all season after sweeping the first three situations. The Nuggets fell 113-107 Friday in Charlotte. Juancho Hernangomez pitched in 17 points and 10 rebounds for Denver.\n\nThe Nuggets were in charge most the first half, especially in the first quarter as Jokic scored 15 points, but rookie guard Trae Young scored on a driving lineup with 8:28 to go in the third quarter to give the Hawks a 61-60 lead. Atlanta built the margin to 84-72 on a driving layup by Bembry with 58 seconds left in the period.\n\nCarter scored 11 of his 13 points in the third, when Bembry added eight of his 18 and the Hawks took a 86-77 lead into the fourth quarter. Atlanta made 13-of-22 shots in the period, including 8-of-12 3-pointers.\n\nAtlanta had a 31-23 rebounding edge in the second half, and center Dewayne Dedmon grabbed 11 boards.\n\n\"I thought John and Dewayne really set the tone, our two bigs, on the boards,\" said Hawks first-year head coach Lloyd Pierce. \"To control the boards against a team like this really helped us get out and run.\"\n\nTIP-INS\n\nNuggets: It's not hard to see how they lost. Denver shot just 29.4 percent in the second half while making 15-of-51 shots. . . . Mason Plumlee scored six points off the bench for the Nuggets, but missed the chance to play against his brother Miles, whose sore knee kept him out of action for the Hawks.\n\nHawks: Played without backup G Jeremy Lin (lower back strain) and Fs Taurean Prince (left ankle sprain) and Omari Spellman (right hip).\n\nBEAT UP AND BRUISED\n\nDenver went without starting forward Paul Millsap for the first time since he fractured his right big toe Friday at Charlotte, and guard Jamal Murray left the game when kicked in an already sore shin. Also, high-scoring guards Will Barton (right hip/core) and Gary Harris (right hip) remained sideline for Denver.\n\nMOVING IT AROUND\n\nThe Hawks had 33 assists, one short of their season high, as forward Kent Bazemore tied his career high with eight dimes. He was more impressed by Collins. \"The future is very bright for John,\" Bazemore said of the second-year forward from Wake Forest who has scored 19, 24, 26 and 30 points in the past four games.\n\nUP NEXT\n\nNuggets: Return home to play the Grizzlies Monday.\n\nHawks: Wednesday at the Mavericks, whom Atlanta beat 111-104 on Oct. 24.",
  "source": "espn_api",
  "crawled_at": 1764995376.23315
}