{
  "game_id": "0021600439",
  "espn_id": "400899881",
  "date": "Dec 22, 2016",
  "matchup": "LAL @ MIA",
  "headline": "Heat erase 19-point deficit, top Lakers 115-107",
  "body": "MIAMI --  Halftime was longer than usual on Thursday night in Miami, to accommodate the ceremony in which the Heat retired Shaquille O'Neal's number and raised a banner to the rafters.\n\nO'Neal said he was humbled.\n\nThe Heat were apparently inspired.\n\nDown 11-0 to start the game and once facing a 19-point deficit, the Heat got 23 points and 13 rebounds from Justise Winslow and Hassan Whiteside and beat the Los Angeles Lakers 115-107.\n\n\"It felt like 2006 in the arena,\" Heat coach Erik Spoelstra said. \"Our young players were sitting there, eyes wide open, and they saw a vision of what we're trying to build.\"\n\nWinslow set a career high for points and tied a career best in rebounds. Goran Dragic scored 21 and James Johnson added 19 for Miami, which snapped a three-game slide.\n\n\"Emotions came out,\" Dragic said. \"I was really glad we were part of the Shaq retirement. It gave us an extra boost, extra energy.\"\n\nLou Williams scored 27 points for the Lakers, who fell to 5-14 on the road. Nick Young scored 20 and D'Angelo Russell had 17.\n\n\"We'll get there,\" Lakers coach Luke Walton said. \"I told the guys, we will get there. We're playing good basketball. We're not doing the little things that make you win ballgames very well right now.\"\n\nWilliams made three free throws with 1:01 to cut a six-point Heat lead in half. But on the ensuing possession, Whiteside tipped in a miss by Winslow to make it 112-107 and the Heat held on.\n\nO'Neal brought Heat captain Udonis Haslem to center court for part of the ceremony. Fitting, then, because both had a role in the Heat rally -- and neither played in the game.\n\nHaslem emotionally spoke in the timeout when the Heat trailed 11-0, and his words resonated.\n\n\"The point I was making to those guys was nobody could look each other in the eye and say they were giving their best effort,\" Haslem said.\n\nThat wasn't the case in the second half, when Miami shot 53 percent, held the Lakers to 38 percent and outrebounded them 29-19.\n\n\"We're supposed to put the nail in the coffin when we got teams down by 18,\" Young said. \"We have to keep going and not let up.\"\n\nTIP-INS\n\nLakers: Julius Randle left the team to fly back to Los Angeles and be with his fiancee, about to deliver their first child. ... Luol Deng became the sixth player to record a start with both teams in the Lakers-Heat rivalry.... Larry Nance Jr. (bone bruise, left knee) will be evaluated again this weekend in Los Angeles.\n\nHeat: Miami's largest comeback win this season had been 14, against Milwaukee. ... Tyler Johnson addressed the crowd pregame, wishing fans a happy holiday season. ... Miami was again without Dion Waiters (groin), Rodney McGruder (ankle) and Wayne Ellington (hamstring).\n\nSHAQ'S IMPACT\n\nO'Neal not only has his numbers (32 in Miami, 34 with the Lakers) retired by both teams, he remains a fixture in their respective record books. O'Neal ranks among the top 10 for both franchises in several categories -- including field goal percentage (No. 1 with Heat, No. 2 with Lakers), points per game (No. 2 with Lakers, No. 3 with Heat), rebounds per game (No. 6 with Lakers, No. 7 with Heat) and blocked shots (No. 2 with Lakers, No. 6 with Heat).\n\nWITH SHAQ\n\nThe Lakers were 9-2 against the Heat with O'Neal in the lineup. The Heat were 3-1 against the Lakers when they had the Hall of Famer on the court.\n\nUP NEXT\n\nLakers: Visit Orlando on Friday, before going home for a Christmas matchup with the Clippers.\n\nHeat: Visit New Orleans on Friday, then do not play again until hosting Oklahoma City on Dec. 27.",
  "source": "espn_api",
  "crawled_at": 1764995418.689478
}