{
  "game_id": "0022000259",
  "espn_id": "401267419",
  "date": "Jan 25, 2021",
  "matchup": "CHA @ ORL",
  "headline": "Vucevic posts 13th double-double, Magic beat Hornets 117-108",
  "body": "ORLANDO, Fla. -- — Orlando Magic rookie point guard Cole Anthony is getting more comfortable the more he plays in the NBA.\n\n\r\n                    Anthony’s comfort level showed Monday night when he posted a career-best scoring performance and outplayed fellow rookie guard LaMelo Ball.\n\n\r\n                    Anthony scored a career-best 21 points and got plenty of help from center Nikola Vucevic’s 13th double-double of the season as the Magic defeated the Charlotte Hornets 117-108 to snap a two-game slide.\n\n\r\n                    “We keep playing like that we can be a pretty good team,” said Anthony, who made 8 of 12 shots and 4 of 5 3-pointers. “Every single time I step out there, I feel like I’m getting more comfortable playing with every dude on the team. … I’m just going to keep getting more comfortable, but I’ve got a long way to go.”\n\n\r\n                    Orlando wasted a double-digit lead in the fourth quarter a night earlier in a loss to the Hornets.\n\n\r\n                    On Monday, Orlando led by as many as 20 points in the third quarter and took an 11-point lead into the fourth before Charlotte made a charge and got within seven — but no closer.\n\n\r\n                    Vucevic scored 28 points and grabbed 12 rebounds.\n\n\r\n                    “Our shotmaking was great tonight and we made a bunch of 3s, which always helps,” said Vucevic, who made 4 of 7 3-point shots. “We were able to hold on at the end.\"\n\n\r\n                    Orlando made a season-best 19 3-pointers, including seven in the third quarter. Evan Fournier hit five 3's and scored 19 points. Aaron Gordon, who missed Sunday’s loss with hip and back soreness, returned Monday and finished with 12 points, 11 rebounds and seven assists.\n\n\r\n                    Anthony, the No. 15 pick in the November NBA draft, scored 10 points and made two 3-pointers in a third period that saw Orlando surge ahead by as many as 20. Ball, the No. 3 pick, finished the game with nine points and four assists, but missed all five of his 3-point shots.\n\n\r\n                    Gordon Hayward, the hero of Charlotte’s 107-104 win a night earlier with his 39 points and a game-winning layup, finished with 24 points, as did Terry Rozier. Devonte Graham had 21 for Charlotte, which lost to the Magic for the fifth time in six meetings.\n\n\r\n                    The Hornets made just 11 of 38 3-point shots and were outscored 68-46 in the middle two quarters.\n\n\r\n                    “We had good momentum going into halftime and for whatever reason we came out flat in the third quarter,” Charlotte coach James Borrego said.\n\n\r\n                    HISTORY MADE\n\n\r\n                    For the first time in NBA history, two female officials — Natalie Sago and Jenna Schroeder — worked the same game. Schroeder and Sago worked with veteran official Sean Wright on Monday.\n\n\r\n                    The only controversy of the night involving the referees came with 1:46 to play when Anthony was called for a blocking foul and Magic coach Steve Clifford challenged the call. The challenge was unsuccessful — a first in seven tries this season by Clifford. \n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Borrego said he will continue to evaluate his center rotation now that Cody Zeller is back after missing four games with a broken bone in his hand. Bismack Biyombo started his 16th game on Monday, while Zeller made one start. … Hayward’s last-second layup a night earlier was the sixth game-winner of his career in the final five seconds.\n\n\r\n                    Magic: Clifford admitted that he is worried about the extended minutes his players are seeing because of injuries and the compacted schedule, stressing, “We’re in unchartered waters. This is Year 21 (in the NBA) for me and I’ve never been involved in a schedule like this. Their bodies can only take so much sometimes.” … The Magic unveiled plans for the AdventHealth Training Center, a 130,000-square-foot facility that will include two practice courts, training and recovery facilities, physical therapy and hydrotherapy capability, sports science and nutrition facilities, as well as state-of-the-art audio-video and imaging technology.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Host Indiana on Wednesday in the first of two meetings over three nights.\n\n\r\n                    Magic: Host Sacramento on Wednesday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997039.010388
}