{
  "game_id": "0022200821",
  "espn_id": "401468976",
  "date": "Feb 07, 2023",
  "matchup": "LAL vs. OKC",
  "headline": "LeBron sets NBA career scoring mark in Lakers' loss to OKC",
  "body": "LOS ANGELES -- — LeBron James became the NBA's career scoring leader on a step-back jumper late in the third quarter, passing Kareem Abdul-Jabbar's record during his 38-point performance in the Los Angeles Lakers' 133-130 loss to the Oklahoma City Thunder on Tuesday night.\n\n\r\n              James surpassed the mark held since April 1984 by Abdul-Jabbar, who watched the game from a baseline seat near the Lakers' bench. Abdul-Jabbar then joined a clearly emotional James and NBA Commissioner Adam Silver on the court after the historic basket.\n\n\r\n              James' mother, wife and children also sat courtside amid a celebrity-studded crowd that rose in waves of anticipation nearly every time he touched the ball.\n\n\r\n              James didn't let them down: After scoring 20 points in the first half with a full showcase of the offensive talent that still shines blindingly after two decades in the NBA, he set the new record with a 16-point third quarter capped by that pretty jumper.\n\n\r\n              “I didn’t set this as a goal, so that’s probably why it’s so surreal and so weird to me,” James said. “I never talked about being the all-time scorer in NBA history … until my numbers started getting closer and closer, and I was like, ‘Oh wow, this is crazy. This is weird, but I guess I’m doing it.’”\n\n\r\n              The game was stopped for about 10 minutes while James hugged his family and participated in a brief ceremony with Silver and Abdul-Jabbar. James said he almost never cries, but he acknowledged the tears in his eyes.\n\n\r\n              “I just want to say thank you to the Laker faithful,\" James said. “You guys are one of a kind. To be able to be in the presence of such a legend as great as Kareem, it’s very humbling.”\n\n\r\n              James has five 40-point games since turning 38 on Dec. 30, and he has scored 30 points in 10 of his 17 games since his birthday. But he scored only two points in the fourth quarter, putting him atop the career scoring list with 38,390 points — three ahead of Abdul-Jabbar. \n\n\r\n              “That was a great feeling, a great moment,” said teammate Anthony Davis, who managed just 13 points. “Well deserved to a guy who puts in so much work on and off the floor. It’s a real moment. Everybody was very happy for him.”\n\n\r\n              While James hit his mark, the Lakers took another discouraging loss in their attempt to avoid the humiliation of missing the playoffs for a second straight season.\n\n\r\n              Shai Gilgeous-Alexander scored 30 points and Jalen Williams had 25 for the Thunder. Oklahoma City never trailed in the second half, holding off the Lakers' 14-4 rally in the final two minutes.\n\n\r\n              “It was a blessing and an honor to be a part of it,” Lakers coach Darvin Ham said. “He gave the people what they wanted, in true LeBron fashion. ... It (stinks) we didn’t get the win on a night like this, but there’s a lot of things to pull from it, a lot of things to take away.”\n\n\r\n              The young Thunder appeared to feed off the energy created by James' momentous night, even if they couldn't guard him much. Oklahoma City jumped to a 15-point lead in the first half and hit nearly 60% of its shots.\n\n\r\n              Oklahoma City moved 1 1/2 games ahead of the 13th-place Lakers (25-30) near the bottom of the Western Conference standings.\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Josh Giddey had 20 points. ... One-time Lakers forward Mike Muscala scored 16 points, hitting four 3-pointers.\n\n\r\n              Lakers: Austin Reaves returned from a 16-game absence with a hamstring injury and played seven scoreless minutes. ... Russell Westbrook had 27 points, eight assists and six turnovers.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Portland on Friday.\n\n\r\n              Lakers: Host Milwaukee on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995048.8265018
}