{
  "game_id": "0021800074",
  "espn_id": "401070755",
  "date": "Oct 27, 2018",
  "matchup": "DET vs. BOS",
  "headline": "Celtics hand Pistons first loss of season, 109-89",
  "body": "DETROIT --  With Jaylen Brown struggling offensive so far this season, Brad Stevens still asked him if he wanted a shot at defending one of the NBA's hottest players.\n\nNot only did Brown slow down the much bigger Blake Griffin, his offense also perked up in the process.\n\nBrown scored 19 points and Marcus Morris added 18 for the Boston Celtics in a 109-89 victory on Saturday night over the Detroit Pistons, who lost their first game of the season.\n\nBrown came in averaging 8.6 points per game this season, down from 14.5 last year.\n\n\"I wasn't tripping,\" Brown said. \"And I've guarded bigs before, especially my rookie year. Actually when Blake was (with the Los Angeles Clippers), I guarded him a little bit. So I was familiar when Brad asked me.\"\n\nAndre Drummond had 18 points and eight rebounds, and Stanley Johnson scored a season-high 16 for Detroit, which had won its first four games of the season for the first time since 2008-09.? Griffin came in averaging 33.8 points per game, shooting 55.7 percent from the field and 65.2 percent from 3. He missed his first seven shots, including four from 3-point range.\n\n\"I just missed open shots early,\" Griffin said. \"I thought that I tried to attack at times and get to the foul line but it didn't go that way.\"\n\nHe scored seven points in 30 minutes, finished 2 of 13 from the field and 0-4 from deep.\n\n\"Blake's a handful,\" Stevens said. \"We knew we were mostly going to have to play small on (Griffin) or Drummond, so we just tried to be very active around those guys.\"\n\nDetroit came in shooting 37.6 percent from 3-point range this season, and went 7 for 37 (18.9 percent). Boston shot 14 for 34 (41.2 percent) from deep.\n\n\"It is disappointing,\" Pistons coach Dwane Casey said. \"One game doesn't make a season. It should get our attention and show us how well we have to play each and every night.\"\n\nThe Celtics opened up a 103-74 lead with 5:15 left to play, cruising in the first of consecutive games.\n\nCasey was assessed his first technical foul with Detroit, protesting a first-quarter no-call after Griffin hit the ground. The subsequent Morris free throw capped an 8-0 run that made it 23-11 Boston in the first quarter.\n\nThe Boston bench outscored Detroit's 34-9 in the first half, as the Celtics opened up a pair of 26-point leads in the second quarter. The Pistons previous largest deficit of the season was 12 points in the opener against Brooklyn.\n\nDaniel Theis, who Stevens said was questionable to play with a foot injury, scored 14 points and had seven rebounds before halftime. He finished with 17 points and eight rebounds.\n\nGordon Hayward scored season-high 15 points and Terry Rozier added 14 points off the bench for Boston.\n\nTIP-INS\n\nCeltics: Aron Baynes, who played two seasons in Detroit, missed his third straight game with a right hamstring strain. . Jabari Bird has not played yet this season because of personal reasons.\n\nPistons: Detroit was playing its first game since the injury to guard Luke Kennard, who sprained the AC joint in his right shoulder on Thursday. ... Drummond took an inadvertent shot from Al Horford in the third quarter, resulting in a bloody nose. He did not leave the game. . Jon Leuer played for the first time this season, his first appearance since Oct. 31, 2017. He missed 74 games last season with an ankle injury and then had offseason knee surgery. Leuer scored four points.\n\nGETTING COMFY\n\nTheis was two points away from his career high of 19, which he set last season in Detroit.?\n\n\"He probably wanted to play here,\" Stevens said. \"When we lose a guy like Baynes, we need everybody else to step up.\"\n\nTheis was being evaluated after the game with a right heel injury, according to the Celtics.\n\nMOVING BETTER\n\nStevens thought the Celtics had been plodding offensively this season, leading to a 100.0 points per game average entering Saturday, second-worst in the league.\n\n\"Our pace is better, which is good,\" Stevens said. \"If we're going to play nine guys this much, or 10 guys this much, then we might as well move a little faster.\"\n\nBEASTING BOSTON\n\nDrummond entered the game scoring 17.1 points per game on Boston in his career, the highest against any opponent.\n\nGET THE BALL\n\nRookie Bruce Brown scored his first NBA points for the Pistons, finishing with six points. He had missed his first four career field-goal attempts and two free throws.\n\nUP NEXT\n\nCeltics: Tuesday they play host to Detroit in the second game of the set.\n\nPistons: Tuesday will open a six-game stretch where the Pistons will play five on the road.",
  "source": "espn_api",
  "crawled_at": 1764994723.080499
}