{
  "game_id": "0021600386",
  "espn_id": "400899828",
  "date": "Dec 15, 2016",
  "matchup": "POR @ DEN",
  "headline": "Gallinari scores 27 as Nuggets beat Trail Blazers 132-120",
  "body": "DENVER --  Gary Harris' return was supposed to strengthen Denver's defense. Instead, the Nuggets relied on their offense to finally solve the Portland Trail Blazers.\n\nHarris had 18 points in his first game back from a foot injury, Danilo Gallinari scored 20 of his 27 in the first half and the Nuggets led big early before holding on late to beat the Trail Blazers 132-120 Thursday night.\n\nWilson Chandler added 17 points and Jameer Nelson scored 13 of his 15 in the fourth quarter as the Nuggets withstood a late push. It was Denver's second victory in the last 15 games against the Blazers, who got 40 points and 10 assists from Damian Lillard.\n\n\"That's the team we have to be,\" Harris said. \"We show flashes of that, so we need to put it together every night.\"\n\nCJ McCollum scored 23 for Portland, which has lost five of six.\n\n\"We didn't have much of an impact on the defensive end,\" Lillard said. \"They felt comfortable. They made uncontested shots and when we picked our energy up and our effort up they had themselves going.\"\n\nHarris missed 16 games after getting hurt Nov. 12 against Detroit. Nuggets coach Michael Malone planned on easing the third-year guard back into action but Harris played 32 minutes, third-most on the team.\n\n\"I didn't know what was going to happen,\" Harris said. \"I was glad to get back out there.\"\n\nThe Nuggets snapped a three-game skid at Pepsi Center, where they are 4-7 this season. One of those defeats came in their home opener against Portland when they blew a late lead and lost in overtime.\n\nDenver never trailed in this one, but the Trail Blazers tried to make it a game in the fourth behind Lillard. Harris was given the tough task of guarding Lillard and helped hold him in check for three quarters.\n\nBut the All-Star guard scored 14 points in the last 12 minutes as Portland rallied. After trailing by as many as 25 in the first half and 21 in the third quarter, the margin was just 10 in the fourth.\n\nDenver responded with an 11-5 run to push the lead to 16, and Portland never got the deficit under 10 again.\n\n\"We were able to make enough plays on offense to stem the tide,\" Malone said. \"They just ran out of time, thank goodness. That clock was moving very slow.\"\n\nTIP-INS\n\nTrail Blazers: F Al-Farouq Aminu missed his second straight game with a back injury. ... Lillard has scored 30 or more points in three of his last five games.\n\nNuggets: The 132 points were a season high. ... Denver Broncos LB Shaquil Barrett was in attendance. He hit a halfcourt shot during a late timeout to the delight of the sparse crowd. ... After getting Harris back, Denver was at full strength for the first time this season. Alonzo Gee was inactive and Malik Beasley is with Sioux Falls of the D-League.\n\nREMEMBERING CRAIG SAGER\n\nThere was a moment of silence before the national anthem following the death of Sager, the longtime TNT sideline reporter. Malone and Portland coach Terry Stotts spoke about Sager before the game. Malone said it is \"a tough loss for the entire NBA family,\" while Stotts said \"his legacy will go well beyond just his suits and colorful personality. Just the way he lived his life, the way he battled cancer will long be remembered.\"\n\nUP NEXT\n\nTrail Blazers: At the Golden State Warriors on Saturday night.\n\nNuggets: Welcome back Carmelo Anthony when the New York Knicks visit Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995665.006183
}