{
  "game_id": "0022400132",
  "espn_id": "401704698",
  "date": "Nov 01, 2024",
  "matchup": "CHA vs. BOS",
  "headline": "Tatum scores 32, Celtics pull away to beat Hornets 124-109 after 2 Charlotte players ejected",
  "body": "CHARLOTTE, N.C. -- — Jayson Tatum had 32 points and 11 rebounds, Jaylen Brown added 25 points and the Boston Celtics pulled away late to beat Charlotte 124-109 in a heated game on Friday night in which two Hornets players were ejected.\n\n\r\n              Derrick White had 17 points and Jrue Holiday chipped in with 14 for Boston.\n\n\r\n              LaMelo Ball had 31 points before fouling out to lead the Hornets, who continue to play without injured starters Brandon Miller and Mark Williams.\n\n\r\n              The game got chippy in the fourth quarter as Grant Williams was ejected for a flagrant foul 2 after he ran over Tatum near halfcourt. Moments later, Ball fouled Tatum on a 3-point attempt and was assessed a flagrant for a dangerous foul. Then in the closing seconds Miles Bridges was ejected.\n\n\r\n              The game featured new Hornets head coach Charles Lee facing the team he won an NBA championship with last season as an assistant coach.\n\n\r\n              The Hornets got a strong game out of rookie Tidjane Salaun, who had nine points on three 3s.\n\n\r\n              Takeaways\r\n              Celtics: Boston showed its championship toughness down the stretch by keeping its cool while the Hornets imploded. The Celtics benefited from 26 fouls against the Hornets, while committing just 13.\n\n\r\n              Hornets: Center is becoming an issue for the Hornets. Starting center Mark Williams has not played this season and Nick Richards left the game with shoulder soreness. Charlotte could be playing small ball for awhile.\n\n\r\n              Key moment \r\n              After the Hornets closed within six, Jrue Holiday knocked down a 3-pointer from the left wing with 2:24 left to give the Celtics some breathing room. \n\n\r\n              Key stat\r\n              The Celtics were 29 of 35 from the foul line.\n\n\r\n              Up next \r\n              The teams meet again Saturday night on the same court.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997473.9760692
}