{
  "game_id": "0021800584",
  "espn_id": "401071260",
  "date": "Jan 06, 2019",
  "matchup": "CHI vs. BKN",
  "headline": "Russell leads Nets past Bulls 117-100 for 3rd win in a row",
  "body": "CHICAGO --  D'Angelo Russell is on a roll, and so are the Brooklyn Nets.\n\nRussell scored 28 points, DeMarre Carroll had 20 points off the bench and the Nets beat the Chicago Bulls 117-100 on Sunday for their third straight victory.\n\nJarrett Allen added 19 and six rebounds as the Nets improved to 12-3 in their last 15 games, matching their best 15-game stretch since moving to Brooklyn in 2012.\n\nRussell topped 20 points for the fourth straight game and is averaging 26.5 points in the span.\n\n\"D'Angelo is just taking it to a whole other level,\" Carroll said. \"He's getting everybody involved, he's scoring the ball when he needs to.\n\n\"He's got a complete game right now and I think that's what we need from him in order to go far and go deep.\"\n\nBrooklyn (20-21) didn't win its 20th game last season until Feb. 26, also against Chicago. The Bulls (10-30) lost their fourth straight overall and fifth in a row to the Nets.\n\nThe Nets, who finished 28-54 last season and in 12th place in the East, are in the running for their first playoff berth since 2014-15.\n\n\"We've been playing at a good level,\" Russell said. \"Just taking care of what we're supposed to take care of. Giving ourselves a chance when the numbers aren't in our favor. Our confidence is high.\"\n\nThe Nets made 16 3-pointers. Russell was 6 for 14 from beyond the arc.\n\n\"They made shots,\" Bulls coach Jim Boylen said. \"They got to where they wanted to get to. And they made shots. We can't give up 117 at home.\"\n\nZach LaVine had 27 points for Chicago and Bobby Portis scored 17 in 20 minutes off the bench after missing seven games with a sprained right ankle. Kris Dunn added 16 points, but the Nets pulled away in the fourth quarter, outscoring the Bulls 29-18.\n\n\"They hit a lot of 3s, but we played good and we battle them,\" LaVine said. \"But overall as a team, we've just got to be tougher.\"\n\nBoth teams started slowly with the Bulls hitting just one of their first eight shots and the Nets connecting on just three of 10. But with Carroll kicking in nine points, Brooklyn moved ahead 28-21 after the first quarter.\n\nThe Nets opened a 12-point lead when Russell hit a 3-pointer 58 seconds into the second quarter.\n\nLed by energized play from LaVine and Porter, the Bulls roared back to briefly take a one-point lead before the half, then settle for a 55-all tie at halftime.\n\nLaVine had 16 points and Portis had nine in the second quarter. LaVine made five straight baskets -- four on driving layups, plus a 3-pointer -- in a 3  1/2-minute stretch to put the Bulls back in the game.\n\nRussell had 10 points and Allen had nine at the half, then both kicked into a higher offensive gear to start the third as the Nets pulled out to a another 12-point lead midway through the quarter. Russell hit three straight 3-pointers in 2:31 stretch.\n\nThe Nets settled for an 88-82 lead entering the fourth quarter, then used a 16-5 run to seal the victory as Russell kept rolling.\n\nTIP-INS\n\nNets: The Nets recorded their 10th road win, something they didn't do last season until March 28. . Rondae Hollis-Jefferson (right adductor strain) missed his third straight game. Swingman Allen Crabbe (sore right knee) sat out his 11th. ... Before the game, coach Kenny Atkinson attributed Russell's recent offensive success to \"really finding that nice niche between scoring and finding open guys\" and \"really stepping it up in terms of his pace, his energy, a lot of juice out there.\"\n\nBulls:  LaVine got hit in the groin late in the third period and went to bench, but returned. After the game, he said he was fine. . Boylen said before the game that Portis would be limited to 20 minutes. After the contest, Boylen said that restriction could be lengthened or eliminated based on how Portis feels after practices of the next two days. ... G Wayne Selden Jr., acquired by the Bulls in a trade Thursday that sent guard Justin Holiday to Memphis, joined the team and scored one point in a little over three minutes. ... The Bulls started their youthful core again, with forwards Chandler Hutchison and Lauri Markkanen, guards LaVine and Dunn and center Wendell Carter, Jr. All were first-round picks. Dunn, who's 24, is the oldest in the group. Carter is the youngest at 19.\n\nUP NEXT\n\nNets: At Boston on Monday night in the finale of the three-game road trip.\n\nBulls: At Portland on Wednesday in the opener of a five-game trip.",
  "source": "espn_api",
  "crawled_at": 1764994819.3607411
}