{
  "game_id": "0022200003",
  "espn_id": "401468018",
  "date": "Oct 19, 2022",
  "matchup": "ORL @ DET",
  "headline": "Bogdanovic shines in Detroit debut, helps Pistons beat Magic",
  "body": "DETROIT -- — The Detroit Pistons are excited about their future thanks to some young, dynamic players.\n\n\r\n              Bojan Bogdanovic provides a reason to hope the present is promising, too.\n\n\r\n              Bogdanovic scored 24 points in his debut with the Pistons, helping them beat the Orlando Magic 113-109 on Wednesday night.\n\n\r\n              “The guy averaged 18 on a 60-win team so I’m not surprised,\" Detroit coach Dwane Casey said.\n\n\r\n              The Pistons acquired the 33-year-old Bogdanovic from the cost-cutting Utah Jazz in exchange for spare parts to kick their rebuilding plans into another gear.\n\n\r\n              “In practice and games, he’s constantly giving us advice,\" said Detroit rookie Jaden Ivey, the No. 5 pick overall. “His veteran voice is going to be huge for us.\"\n\n\r\n              Orlando's Paolo Banchero, the No. 1 overall pick last summer, had 27 points, nine rebounds and five assists in his debut.\n\n\r\n              “I left a lot of points on the board, like three layups missed, some shots I feel like I could have made, so a lot to work on,\" said Banchero, who was 11 of 18. “ But I wasn’t disappointed with the way I played.\"\n\n\r\n              The former Duke star joined Kareem Abdul-Jabbar and LeBron James as No. 1 picks since 1969 to have at least 25 points, five rebounds and five assists in an NBA debut.\n\n\r\n              “He’s going to be a problem in our league for a long time,\" Casey said.\n\n\r\n              Jalen Suggs, the No. 5 pick last year, had 21 points for the Magic before fouling out with 3:47 remaining.\n\n\r\n              “All of our guys have to understand that we have to do a better job of defending without fouling,\" coach Jamahl Mosley said. “Putting them on the line 24 times, whave to be smarter. There’s a level of aggression we can have, but we’ve got to be smart about it.”\n\n\r\n              Cade Cunningham, the No. 1 pick last year, had 18 points and 10 assists. Cunningham's last assist set up Isaiah Stewart for a 3-pointer with 11.6 seconds left that gave the Pistons a four-point lead.\n\n\r\n              “That was huge for (Stewart) and his confidence,\" Casey said.\n\n\r\n              In their NBA debuts, first-round picks Ivey had 19 points and Jalen Duren had 14 points, 11 rebounds and three blocks for the Pistons. Duren was acquired in a draft-night deal after being selected No. 13 overall.\n\n\r\n              “He’s a freak,\" Ivey said. “He’s has a strong build and is very athletic. He played comfortable.\"\n\n\r\n              Ivey looked at ease on the court, too, and wasn't surprised that he was able to dribble and drive past the Magic.\n\n\r\n              “I feel like I can get past some of the quickest guys,\" he said.\n\n\r\n              The season opener for both teams matched up young squads with high draft picks playing key roles.\n\n\r\n              Detroit was 23-59 last season, finishing ahead of just Houston and Orlando at the bottom of the league standings. The Magic went 22-60 last season and won the draft lottery, giving them the chance to draft the 6-foot-10 Banchero.\n\n\r\n              Detroit got off to a strong start in the opening minutes before Orlando took control and went into the second quarter with a 28-17 lead.\n\n\r\n              “We got our tails handed to us in the first, but we didn't drop our heads,\" Casey said.\n\n\r\n              The Pistons found their groove in the second quarter, outscoring the Magic 40-27, to lead by two points at halftime.\n\n\r\n              Detroit opened up an eight-point lead after three quarters, but it could not pull away due in large part to Banchero's play at both ends of the court.\n\n\r\n              TIP-INS\n\n\r\n              Magic: Markelle Fultz (broken toe), Gary Harris (left knee), Jonathan Isaac (left knee) and Moritz Wagner (foot sprain) were not in uniform.\n\n\r\n              Pistons: Marvin Bagley III (sprained right knee), Alec Burks (left foot) and Isaiah Livers (hip) were out of the lineup.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Atlanta on Friday night.\n\n\r\n              Pistons: At New York on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994668.3839831
}