{
  "game_id": "0022200174",
  "espn_id": "401468329",
  "date": "Nov 10, 2022",
  "matchup": "MIA vs. CHA",
  "headline": "Butler scores 35, Heat hold off Hornets 117-112 in OT",
  "body": "MIAMI -- — Another night, another close game for the Miami Heat. And Jimmy Butler wouldn't let this one get away.\n\n\r\n              Butler scored 35 points, finishing two assists shy of a triple-double, and the Heat recovered to beat to beat Charlotte 117-112 in overtime Thursday night.\n\n\r\n              Miami led by as many as 15 points, as many as 12 in the fourth, but needed Butler to score eight consecutive Heat points at the end of regulation just to get into the extra session.\n\n\r\n              “I thought it was an important game, an important win for us, mentally and emotionally,” Heat coach Erik Spoelstra said.\n\n\r\n              Butler had 10 rebounds and eight assists for Miami. Bam Adebayo scored 18 points and grabbed 14 rebounds, while Duncan Robinson scored 14. Max Strus and Gabe Vincent each added 12 points for the Heat.\n\n\r\n              Kelly Oubre Jr. scored 29 points for Charlotte, which got 22 from Terry Rozier and 16 from Jaden McDaniels. Mason Plumlee had a 13-point, 15-rebound game for short-handed Charlotte, which dropped its seventh straight.\n\n\r\n              “I’ve been around teams that didn’t care that much,” Hornets coach Steve Clifford said. “We have a good group. Is it concerning? We’re in a tough spot. I mean, we have no room for error. We have to knock it out of the park here to win right now with what we have. And yet, we’ve done it a couple of times and we can do it again.”\n\n\r\n              They almost did it Thursday.\n\n\r\n              The Hornets for 14 seconds in the game’s opening moments, and for the next 3 1/2 quarters, the lead was held nonstop by Miami.\n\n\r\n              Until midway through the fourth.\n\n\r\n              Miami led by 12 going into the final quarter and quickly wasted every bit of that edge. A 12-0 run by the Hornets tied the game, and a three-point play by Plumlee with 6:50 left in the fourth put Charlotte up 90-89 — its first lead since 3-0.\n\n\r\n              The Hornets would lead by as many as five, but couldn’t finish it off. And Miami, for the 10th time in 12 games this season, played a contest that was decided by single digits.\n\n\r\n              “We're not trying to have that happen,\" Adebayo said. “But it makes the game interesting.\"\n\n\r\n              Miami had 30 points off turnovers to Charlotte's 10.\n\n\r\n              Charlotte got a Miami stop late in overtime and called time, down by one. But the Hornets’ ensuing possession went nowhere — Oubre traveled almost immediately after the ball was inbounded. And Charlotte’s next play was equally disastrous, with Rozier throwing up a desperation 3-pointer with about 8 seconds left on the clock and the Hornets down three.\n\n\r\n              The ball bounced off the side of the backboard, and there went Charlotte’s last good chance.\n\n\r\n              TIP-INS\n\n\r\n              Hornets: LaMelo Ball (sprained left ankle) has missed all 13 games this season, Cody Martin (left quad soreness) missed his 12th and Gordon Hayward (left shoulder contusion) missed his fifth. ... Charlotte fell to 1-2 in overtime this season. ... The Hornets lost Dennis Smith Jr. in OT to what appeared to be a sprained left ankle.\n\n\r\n              Heat: Tyler Herro (left ankle) remained out. ... Basketball enthusiast — and pretty good pickup player — Adam Sandler, the actor and comic who performed shows in South Florida earlier in the week, watched the game from a suite. ... It was Miami’s first OT game of the season.\n\n\r\n              HEAT 3K\n\n\r\n              It was the 3,000th game in Heat history, including playoffs. Their record is 1,585-1,415.\n\n\r\n              NO STORM\n\n\r\n              As Hurricane Nicole was making landfall in Florida on Wednesday night, the Hornets were flying in from Charlotte — their flight path taking them over the storm. But the team landed in Miami without incident.\n\n\r\n              UP NEXT\n\n\r\n              The teams play again Saturday in Miami.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993989.723882
}