{
  "game_id": "0021601153",
  "espn_id": "400899475",
  "date": "Apr 02, 2017",
  "matchup": "HOU @ PHX",
  "headline": "Rockets, without Harden, send Suns to 12th straight loss",
  "body": "PHOENIX -- Patrick Beverley knew much more would be expected of him with his Houston Rockets missing James Harden on Sunday night.\nThat motivated the veteran guard to play well, which Beverley did in the Rockets' 123-116 win over the Phoenix Suns.\nBeverley scored a career-high 26 points and the Rockets sent the Suns to their 12th straight loss without Harden in the lineup. Harden was ruled out with acute viral syndrome, the team announced before the game. He had not missed a game all season and entered Sunday tied for second in the league in scoring at 29.2 points per game.\n\"Coach walked up to me (and said), `We need a triple-double out of you tonight,\" Beverley said of the conversation with Rockets coach Mike D'Antoni, who told him Harden was out. \"I know I'm not even close to what James Harden is, but I just try to go out and try to lead these guys by example.\"\nBeverley, who added nine assists and eight rebounds, played despite a sore right ankle and scored 11 of his points in the third quarter. Lou Williams scored 16 of his 23 points in the fourth quarter, and Troy Williams, called up from the D-League early Sunday, scored 18 of his career-high 21 points in the first half.\nTroy Williams, who last appeared in an NBA game on Dec. 16 with Memphis, shot 5 of 7 from 3-point range in the first 20 minutes.\n\"He really played,\" D'Antoni said. \"He's rangy and long. He made the most of it, that's for sure.\"\nThe Rockets became the first NBA team to make at least 1,100 3s in a season. They surpassed that mark with 14 on Sunday.\nTyler Ulis finished with a career-high 34 points for the Suns, who were swept in a season series by the Rockets for the first time in franchise history. At 22-56, Phoenix has the West's worst record by a half-game below the Los Angeles Lakers.\nUlis, a rookie, added nine rebounds and nine assists, and Devin Booker scored 27 for the Suns.\nHouston fended off the Suns' comeback attempts in the fourth quarter and pulled away, snapping a three-game losing streak.\n\"We can start back on a winning streak,\" Beverley said. \"This was a must-win game, we're trying to solidify third (place in the Western Conference.) We wanted to come out here and set the tone and I think that we did that from the beginning.\"\nBack-to-back 3-pointers by Jared Dudley preceded a driving layup by Ulis to tie the score at 47 with 4:59 left in the second quarter, and Ulis hit a free throw after being fouled on the play to give the Suns a lead.\nPhoenix trailed by as many as 15 in the first quarter and 10 after 12 minutes. The Suns went on a 13-2 run that ended with Ulis' three-point play.\n\"I'm just trying to pick my spots,\" Ulis said. \"I usually look to pass coming off screens and things like that, and I'm learning to ... pick my battles, when to shoot, when to pass.\"\nThe Rockets scored the last seven points of the first half to take a 59-54 halftime lead on baskets by Nene, Beverley and Williams.\nTIP-INS\nRockets: F Ryan Anderson did not play due to a sprained right ankle. ... F Trevor Ariza missed the game for personal family reasons. ... Another D-League call-up, G Isaiah Taylor, made his NBA debut coming off the bench for the Rockets.\nSuns: Booker was issued a technical foul after arguing an offensive foul call against him late in the third quarter. ... F T.J. Warren did not play due to illness. ... Green Bay Packers QB Aaron Rodgers attended the game, sitting along the baseline.\nDEKKER BREAKS HAND\nRockets forward Sam Dekker left in the fourth quarter when he broke his left hand in a collision with Booker. Dekker had a cast over the hand after the game and will see a specialist in Houston on Monday. He said he hopes to return in three or four weeks and contribute in the playoffs.\nBENDER'S BACK\nSuns forward Dragan Bender played in his first game since surgery to remove a bone spur from his right ankle on Feb. 8. The rookie had not appeared in a game since Feb. 1.\n\"He's part of our core, our young core,\" Suns coach Earl Watson said before the game, adding that he hoped for 10 to 15 minutes out of the 19-year-old. Bender played 14.\nUP NEXT\nRockets: Host Denver on Wednesday in their second-to-last home game of the regular season.\nSuns: Host Golden State on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995734.1336372
}