{
  "game_id": "0022000173",
  "espn_id": "401267333",
  "date": "Jan 13, 2021",
  "matchup": "SAC vs. POR",
  "headline": "Lillard has 40, Blazers tie team record for 3s to beat Kings",
  "body": "SACRAMENTO, Calif. -- — Damian Lillard scored eight of his season-high 40 points in the final four minutes, and the Portland Trail Blazers tied a franchise record with 23 3-pointers to beat the Sacramento Kings 132-126 on Wednesday night for their fourth straight victory.\n\n\r\n                    Lillard and CJ McCollum led Portland’s shooting barrage from behind the arc with six 3s apiece. Lillard added 13 assists without a turnover, while McCollum had 28 points, 10 assists and seven rebounds. Jusuf Nurkic had a season-best 18 points and 13 rebounds.\n\n\r\n                    “I liked the way we kept our focus,” Blazers coach Terry Stotts said. “Sacramento was hot all night. More than anything else, I like how we fought back after things weren’t going our way in the third quarter.”\n\n\r\n                    The Blazers trailed by 20 midway through the second and were down 105-100 going into the fourth before rallying to win their second consecutive game against the Kings in five days. Portland won 125-99 on Saturday.\n\n\r\n                    Nurkic had 10 points in the fourth period but it was Lillard who came up big down the stretch. He made four free throws and a pair of driving layups as the Blazers outscored the Kings 16-9.\n\n\r\n                    De’Aaron Fox had 29 points, six assists and six rebounds for Sacramento. Buddy Hield scored 26, and first-round draft pick Tyrese Haliburton added 17 points and nine assists.\n\n\r\n                    The Kings have lost six of eight. This one was particularly painful after they blew big leads of 58-38 and 94-75.\n\n\r\n                    “That’s the NBA. The elite teams find ways to finish those off and that’s what we’re building toward. We’re not there yet,\" Kings coach Luke Walton said. \"Down the stretch Dame and CJ hit some big shots.”\n\n\r\n                    Portland tied a team record for 3s set last year in the bubble. The Blazers shot 23 for 48 from deep but missed their final four attempts at breaking the mark.\n\n\r\n                    “Coach has been emphasizing we need to get more 3s up,” Lillard said. “We continued to penetrate and pitch and take those open shots. It really helped us that we were getting high-quality looks. We didn’t pass any of them up. We took them and kept firing.”\n\n\r\n                    The Kings led by 20 early in the second quarter following back-to-back buckets from Marvin Bagley III. Portland responded with a flurry of 3s, making four straight as part of a 20-4 run.\n\n\r\n                    After Derrick Jones Jr. dunked off an offensive rebound and Fox missed one of two free throws, McCollum made another 3 to pull Portland to 68-65.\n\n\r\n                    BLAME CJ\n\n\r\n                    It was the first time Lillard and McCollum both had 10 or more assists in the same game as teammates. \n\n\r\n                    “A lot of guys made shots tonight, too, so that helped,” McCollum said. “I don’t get 10 assists very often so that’s probably why we both haven’t done it.”\n\n\r\n                    DIFFERENCE MAKER\n\n\r\n                    Richaun Holmes sat out with left ankle soreness when Sacramento lost to Portland last Saturday, the only game the 6-foot-10 center has missed this season. Holmes was back in the lineup Wednesday and gave the Kings a big lift inside with 17 points, nine rebounds and six assists.\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: Lillard is seven field goals shy of becoming the third player in franchise history to reach 5,000 for his career. Clyde Drexler (6,889) and LaMarcus Aldridge (5,121) are the others. … Nurkic was questionable before the game with a quad injury.\n\n\r\n                    Kings: Walton won his fourth coach’s challenge in five tries this season. … Several players locked arms during the national anthem, something they’ve done since the violence at the U.S. Capitol last week.\n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Host the Pacers on Thursday. Portland has won 10 of the last 12 against Indiana dating to 2014-15. \n\n\r\n                    Kings: Play the Clippers at Golden 1 Center on Friday. The Kings have lost 14 consecutive home games in the series, last winning on March 19, 2013.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997194.578269
}