{
  "game_id": "0021500498",
  "espn_id": "400828385",
  "date": "Jan 02, 2016",
  "matchup": "DET @ IND",
  "headline": "George scores 32 to lead Pacers to a 94-82 win over Pistons",
  "body": "INDIANAPOLIS -- Paul George is doing his part to keep the rivalry between Indiana and Detroit heated.\nHe scored 21 of his 32 points in the fourth quarter to lead the Pacers to a 94-82 victory over the Pistons on Saturday night.\nThen he was part of a scuffle at the end of the game, getting shoved by Marcus Morris twice, once before and once after the final buzzer.\n\"It was just competition,\" George said. \"It was just the heat of the moment, playing hard and you're going to have moments like that. There wasn't much trash talking going on between me and him (leading up to that), it was just talking with our play.\"\nAnd George spoke volumes.\n\nThe Pacers went on a 12-2 run in the third quarter to take a 62-53 lead after George made two free throws and a dunk.\nIn the fourth, George broke away and scored 21 of Indiana's 30 points in the final period. He made a layup on a hard drive to the basket, then made three 3-pointers, including one to give the Pacers an 88-79 lead with 2:11 left to play.\n\"He got going from the perimeter, we kept going to him and he kept delivering,\" Pacers coach Frank Vogel said. \"It was a great fourth quarter.\"\nWhen George scored with 22.6 seconds left to play to put Indiana ahead 92-82, Pistons coach Stan Van Gundy picked up back-to-back technical fouls and was ejected.\nGeorge made both free throws after that, too.\n\"Paul George got it going at the end,\" Van Gundy said. \"Yeah, he got it rolling. I mean, he did a great job. He hit a lot of tough shots.\"\nGeorge Hill had 18 points and Monta Ellis added 14 for the Pacers (19-14), who snapped a two game skid.\nKentavious Caldwell-Pope had 16 points and 10 rebounds, and Ersan Ilyasova and Reggie Jackson each scored 12 points for the Pistons (18-16), who have lost four of five games.\nEven when the Pacers went on their run in the third, the Pistons stuck around for awhile.\nMorris hit a 3-pointer at the end of the third and Aron Baynes made a pair of free throws at the start of the fourth to get Detroit to 64-61.\nJohnson converted a 3-point play to pull the Pistons to 71-69.\nGeorge made two free throws and scored a layup on a hard drive to the basket to put the Pacers ahead 77-71 before he made back-to-back 3-pointers, including one to give the Pacers an 83-75 lead with 3:14 left to play.\nSCORING DEFENSE\nDetroit shot just 35.5 percent from the field and the Pacers improved to 7-0 this season when holding teams to under 40 percent. \"I think we forced them into some tough shots,\" George Hill said. \"For a long stretch I think we were doing well on the defensive end by getting some stops, getting out on the break and trying to get some early strikes.\" The Pistons shot only 29.2 percent (7-24) in the fourth quarter alone and was 34.1 in the second half.\nTIP-INS\nPistons: Andre Drummond finished with 11 points and 18 rebounds for his 29th double-double of the season. ... Ilyasova also had seven rebounds. ... All of Detroit's starters scored in double figures.\nPacers: George also had 14 rebounds. ... Ian Mahinmi (knee) returned to the starting lineup and Jordan Hill (dental work) played after both missed Thursday's game against Milwaukee.\nUP NEXT\nPistons: hosts Orlando on Monday.\nPacers: at Miami on Monday to start a four-game road trip.",
  "source": "espn_api",
  "crawled_at": 1764994930.6335192
}