{
  "game_id": "0021800169",
  "espn_id": "401070850",
  "date": "Nov 09, 2018",
  "matchup": "DET @ ATL",
  "headline": "Drummond, Johnson pace Pistons to easy win over Hawks",
  "body": "ATLANTA --  The Detroit Pistons were so efficient on offense that they didn't need Blake Griffin to take many shots.\n\nThe NBA's fifth-leading scorer loved sharing the ball on an easy night for his team.\n\n\"We just did a great job of taking exactly what the defense gave us,\" Griffin said. \"When we play like that and the ball is zipping and moving around, then it's a lot more fun.\"\n\nAndre Drummond had 23 points and 11 rebounds, Stanley Johnson added a season-high 22 points and the Detroit Pistons beat the Atlanta Hawks 124-109 on Friday night.\n\nIn a game that was essentially decided in the first quarter, the Pistons were so dominant that they scored 74 points and led by 23 at halftime Griffin 0 for 2 from the field.\n\n\"He was very unselfish,\" Pistons coach Dwane Casey said. \"He made the right plays.\"\n\nDrummond's double-double was the 300th of his career, most in the league since his rookie season of 2012-13. The Hawks had nobody capable of matching up with his 6-foot-11, 279-pound frame. Drummond has hit 31 field goals, shot 62 percent and pulled down 54 rebounds in his last three games.\n\nThe rebuilding Hawks, featuring one of the NBA's youngest rosters, have lost three straight and seven of eight. Jeremy Lin finished with 19 points. Trae Young added 16, and Omari Spellman had 14 points and 10 rebounds.\n\n\"It was right off the bat,\" Atlanta coach Lloyd Pierce said. \"Slow start, sluggish. Our starting group, whether it's after halftime or to start the game, just lacking in the effort department. We have to figure it out. Rough night.\"\n\nGriffin didn't take a shot until the 2:20 mark of the second, heading to halftime with seven assists and five rebounds in his first 10 minutes. His first basket, a 3-pointer from the left corner, came with 5:14 to go in the third, pushing the lead to 93-67. He finished with nine rebounds, nine assists and six points.\n\n\"It was just kind of the flow of the game,\" Griffin said. \"When we play like that, it's fun.\"\n\nThe Pistons, who have won two straight, took their first 26-point lead on Stanley Johnson's three-point play midway through the second. They matched it several times in the third, the last coming in the final minute when Ish Smith's layup made it 103-77.\n\nTIP-INS\n\nPistons: Griffin began the night with 273 points, the most for a Detroit player through 10 games since Jerry Stackhouse had 277 in 2000-01. ... Detroit had seven players in double figures. ... . ... G Reggie Bullock finished with 13 points and four assists in 23 minutes. He returned against Orlando and had one point and four assists in 18 minutes after missing the previous two games with an ankle sprain. ... The Pistons hit 12 free throws, 18 less than Atlanta, and had their 19 attempts were 21 less.\n\nHawks: The state of the organization could be summed by the loudest cheer of the night, which came midway through the fourth when Drummond missed two free throws to guarantee fans a promotional card for a free chicken sandwich. ... Alex Poythress had four fouls in six minutes of the first half and spent the rest of the game on the bench. ... Kevin Huerter returned to the team after missing Wednesday's loss to New York for personal reasons and had two points in 29 minutes.\n\nNEW DESIGN\n\nThe court and the Hawks' uniforms had a new color combination with the standard white -- black trim with gold numbers and letters -- to acknowledge their 50th year in the city.\n\nUP NEXT\n\nPistons: Host Charlotte on Sunday.\n\nHawks: At the Los Angeles Lakers on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994714.2007291
}