{
  "game_id": "0021800976",
  "espn_id": "401071649",
  "date": "Mar 07, 2019",
  "matchup": "OKC @ POR",
  "headline": "Thunder get wild 129-121 OT victory over the Trail Blazers",
  "body": "PORTLAND, Ore. --  Despite something of a strange ending to regulation, the Oklahoma City Thunder toughed it out in overtime.\n\nRussell Westbrook had 37 points and Paul George added 32 points and 14 rebounds for the Thunder in a chippy 129-121 OT win over the Portland Trail Blazers on Thursday night.\n\nThe victory gave the Thunder a four-game series sweep of the Blazers this season.\n\n\"We were resilient tonight and we did a good job of staying together,\" Westbrook said. \"This is a tough place to play, as we know. We had to do the right things down the stretch to win. That's what we did tonight.\"\n\nDamian Lillard had a season-high 51 points for the Blazers, while Jusuf Nurkic added 13 points and 17 rebounds before he was sent off with his second technical with under a minute to go in regulation.\n\nThe teams had gone into the game knotted for third in the Western Conference -- along with the Houston Rockets -- with identical 39-25 records.\n\n\"Every time we've played them over the years, it's pretty much been a war -- physical, close games, chippy,\" Lillard said. \"This one was no different.\"\n\nWestbrook's 3-pointer in overtime put the Thunder up 118-117 and he made a pair of free throws to extend the lead. After George made the second of a pair of free throws, Westbrook's layup gave Oklahoma City a 123-117 lead.\n\nThe Thunder led by a slim 85-83 margin going into the fourth quarter in a game where neither side stretched the advantage to double digits.\n\nRegulation ended with a wild final minute.\n\nGeorge appeared to elbow Nurkic, who was knocked to the floor as Terrance Ferguson made a layup that put the Thunder up 113-111. Portland players protested, but no call was made.\n\nWords were then exchanged between Nurkic and George in a skirmish under Portland's basket. After a review both received offsetting technicals, and a foul was called on the Thunder. Because Nurkic already had a technical, he was ejected and the Thunder chose Blazers reserve Skal Labissiere to make the free throws. He missed both, but a loose-ball foul was called on the Thunder and Al-Farouq Aminu made both shots to tie it at 113 with 2.9 seconds left.\n\nAfter a turnover by the Thunder, the game went to overtime. But Portland was without Nurkic for the rest of the way.\n\n\"It was a hell of a game,\" Portland coach Terry Stotts said. \"It went back and forth, both teams were going at it, physical game. The difference was overtime. It was a hell of a game.\"\n\nThunder coach Billy Donovan lamented the overtime, coming on the front end of a back-to-back. Oklahoma City visits the Clippers on Friday night.\n\n\"The fact that the game got prolonged was strange in itself,\" he said. \"But that's the reality of it, we've got a quick turnaround.\"\n\nFollowing the game, official Ed Malloy told a pool reporter that the apparent elbow did not trigger a replay because no call was made. He also said the offsetting technicals were the result of physical contact between Nurkic and George, \"which is an unsportsmanlike act.\"\n\nThe Blazers were home after a largely successful seven-game, post-All-Star break road trip, during which they went 5-2. But Portland was coming off a 120-111 loss at Memphis on Tuesday night.\n\nThe Thunder had lost five of their previous six games, including a 131-120 loss at the Timberwolves on Tuesday.\n\nIn the second quarter, Westbrook shoulder checked Nurkic so hard he fell to the court. Westbrook got a flagrant, but Nurkic was given a technical for what looked like a trip a few moments earlier.\n\n\"I may have tripped him, but I didn't do it on purpose,\" Nurkic said afterward.\n\nThe Blazers led 61-58 at the break, with Lillard leading the way with 21 points.\n\nTIP INS\n\nThunder: It was the first night of a back-to-back for the Thunder, who face the Clippers on Friday night. ... Paul George was the West's Player of the Month for February.\n\nTrail Blazers: Portland's 5-2 road trip matched its best for a trip of that length since the 2000-01 season. ... Terry Stotts was the West's Coach of the Month for February. ... It was Blazers forward Jake Layman's 25th birthday. ... The Blazers were without Evan Turner because of personal reasons.\n\nPLAYOFF PREVIEW? Asked afterward if he'd like to see the Thunder in the playoffs despite the bad blood, Nurkic replied: \"For sure. I'd be the happiest man on Earth. Because that's what you want, you want to compete, nothing dirty but you want to compete in those types of games.\"\n\nKANTER'S HOME DEBUT: It was the first chance for the home fans to see Enes Kanter, who the Blazers picked up after he was waived by the Knicks following the trade deadline. He was once a starter in New York, but fell out of the rotation when the team turned its focus to younger players. Kanter came into Thursday's game to a rousing ovation with 3:56 to go in the first quarter.\n\nUP NEXT\n\nThunder: visit the Los Angeles Clippers on Friday night.\n\nTrail Blazers: host Phoenix on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994560.82103
}