{
  "game_id": "0021700239",
  "espn_id": "400974990",
  "date": "Nov 19, 2017",
  "matchup": "PHX vs. CHI",
  "headline": "Warren leads balanced Suns past Bulls, 113-105",
  "body": "PHOENIX --  The Phoenix Suns -- the starters and the guys off the bench -- piled up the assists against Chicago and sent the Bulls to another loss.\n\nT.J. Warren scored 27 points to lead six Phoenix players in double figures and the Suns handed the Bulls their sixth loss in seven games, 113-105 on Sunday night.\n\nRookie Lauri Markkanen, the former University of Arizona standout, scored a career-best 26 points for the Bulls in a matchup of the NBA's youngest teams.\n\nThe Suns had a season-high 32 assists on 45 baskets. Their season best had been 28 in each of the previous two games.\n\n\"We're moving from side to side and everybody's touching the ball,\" Warren said. \"Everybody's getting the ball.\"\n\nDevin Booker and Mike James added 15 points apiece for Phoenix. Eight of James' points came in the final 10 minutes.\n\nJames, who is coming off the bench after starting most of the young season, said the team's chemistry is getting better.\n\n\"I think it's really high,\" he said. \"It shows in our assists and how we're sharing the ball, and how we're playing defense, how we're helping each other.\"\n\nTroy Daniels added 14 for the Suns, including four of seven 3s. Centers Greg Monroe and Alex Len had 10 apiece.\n\nPhoenix interim coach Jay Triano stuck with bench players, including James at point guard, down the stretch. Reserves scored 24 consecutive points for the Suns in an 8:24 stretch in the third and fourth quarter.\n\n\"I think we're getting better, we're getting more familiar with each other,\" he said, \"and I think our guys are understanding that it could be a variety of players in there. ... I think everybody is starting to figure out where they're supposed to be, therefore we're passing the ball a whole lot better.\"\n\nKris Dunn scored 17 points and Robin Lopez 16 for the Bulls. They were coming off a Friday night victory over Charlotte that snapped a five-game losing streak.\n\nMarkkanen made 10 of 18 shots, 4 of 9 from 3-point range, and grabbed 13 rebounds.\n\n\"I thought Lauri was phenomenal,\" Chicago coach Fred Hoiberg said. \"But when he is open, we got to get him the ball. When he has got it rolling like he did tonight, guys were switching and we had him a couple of times with the point guard buried in his back and we didn't get him the ball.\"\n\nThe Suns scored the first seven of the second quarter to tie it at 37 and neither team led by more than six the rest of the half. Warren's basket capped a 10-0 run that gave Phoenix a 54-48 lead with 2:42 left in the half and the Suns led 61-56 at the break.\n\nChicago outscored Phoenix 16-5 over a five-minute span to take an 84-79 lead with 2:17 left in the third. But the Bulls didn't score again in the quarter while Daniels and Josh Jackson each sank 3-pointers to put the Suns up 85-84 entering the fourth.\n\nPhoenix took the lead for good 87-85 on Len's dunk. James scored six and Warren the final four in a decisive 15-5 surge that put the Suns up 106-95 with 3:37 to go.\n\nChicago cut it to 108-103 on Markkanen's fourth 3 with 1:37 to play and got the ball back. But Dunn threw it away and the Suns held on for the win.\n\n\"It was a two-possession game with a minute 20 left and we throw a behind the back pass. That can't happen with two guys open, two of our better shooters and we throw it out of bounds,\" Hoiberg said. \"Then next possession down we throw the ball away. We had two key turnovers late that just can't happen if you want to win a game on the road.\"\n\nTIP-INS\n\nBulls: Chicago has not won two in a row yet this season. ... Bulls opened a four-game road trip. ... Ex-Sun Lopez had 10 points and five rebounds in the first quarter, six points and five rebounds the rest of the way. ... Teams have split their series each of the previous three seasons.\n\nSuns: Booker had six assists, James five. ... Phoenix won consecutive games for the third time this season. ... Booker, who has seven 30-point games this season, was just 5 of 15 from the field. ... Phoenix is in midst of stretch when nine of 10 games are at home.\n\nUP NEXT\n\nBulls: At Los Angeles Lakers on Tuesday night.\n\nSuns:  Host Milwaukee in the return to Phoenix of Eric Bledsoe on Tuesday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993921.1227782
}