{
  "game_id": "0021800325",
  "espn_id": "401071006",
  "date": "Nov 30, 2018",
  "matchup": "OKC vs. ATL",
  "headline": "Russell Westbrook leads Thunder past Hawks, 124-109",
  "body": "OKLAHOMA CITY --  The Thunder went against the numbers and made it work.\n\nThe worst 3-point shooting team in the NBA by percentage, Oklahoma City made a season-high 18 on 41 attempts in a 124-109 victory over the Atlanta Hawks on Friday night.\n\nRussell Westbrook, who made a pair of 3s, fell a rebound short of a triple-double. He finished with 23 points, 10 assists and nine rebounds.\n\nAlex Abrines scored 21 points on seven 3-pointers, Paul George had 20 points and Dennis Schroder added 18.\n\nThunder forward Patrick Patterson, who made three 3-pointers, said the way Oklahoma City got the 3s was critical.\n\n\"The guys did a great job finishing at the basket,\" he said. \"That made opportunities throughout the course of the game for all of us to take open shots. All of us had great looks. Despite them going in or not, our teammates still find us and they don't just take it upon themselves to score. It shows how much we believe in one another.\"\n\nJohn Collins and Alex Len each scored 19 points for Atlanta, and Taurean Prince added 15.\n\nHawks guard Trae Young had nine points and eight assists on 4-for-15 shooting in his return to his home state.\n\n\"You know, it's tough,\" Hawks coach Lloyd Pierce said. \"The ball just keeps going in and out for him.\"\n\nYoung was an All-American at Oklahoma last season, and he received a nice ovation during starting lineup introductions. He grew up attending Thunder games, so he knew what to expect.\n\n\"Of course, I know how hard it is for a team to come in here and get a win,\" he said. \"And with as good as the team is over there on that side, the crowd is one of the best in the league.\"\n\nThe Thunder took control in the second quarter by making 7 of 13 3-pointers to take a 66-46 lead at the break. George scored 19 points, and Westbrook had 15 in the first half.\n\n\"We didn't make plays,\" Young said. \"Couldn't make plays, couldn't get stops, turning the ball over a lot. They just got on a run and we just couldn't stop it.\"\n\nThe Hawks got it going in the third quarter and cut the deficit to 10 before Abrines answered with a 3-pointer. The Thunder pushed their advantage back out to 91-76 by the end of the period. Patterson hit a 3-pointer early in the fourth to bump Oklahoma City's lead back up to 20.\n\n\"We had great pace,\" Schroder said. \"We put pressure on the rim. Everybody found open teammates. Everybody knocked them down tonight.\"\n\nTIP-INS\n\nHawks: Young got a technical in the second quarter after complaining to an official. ... Atlanta's Vince Carter got a technical from the bench in the third quarter. He did not play. ... Collins also had 11 rebounds.\n\nThunder: G Andre Roberson had a setback Thursday in his rehab from a knee injury and will be re-evaluated in six weeks. He initially was injured in January and has not played this season. ... Westbrook got a technical in the third quarter after jawing back and forth with Atlanta's DeAndre' Bembry. ... C Steven Adams had 13 rebounds. ... Oklahoma City shot 52.3 percent from the field.\n\nHE SAID IT\n\nYoung, on the response from the crowd: \"It's all love,\" he said. \"I mean, Anytime I'm able to come back and play in the state of Oklahoma, it's a blessing. I represent this state as best as I can, the city of Norman, everybody in the state as best as I can no matter where I am at.\"\n\nSTAT LINES\n\nWestbrook's averages the past five games are 20.6 points, 12.2 rebounds and 11.6 assists, with three triple-doubles and two near misses.\n\nUP NEXT\n\nHawks: Host Golden State on Monday night.\n\nThunder: At Detroit on Monday night.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994617.811193
}