{
  "game_id": "0022200308",
  "espn_id": "401468463",
  "date": "Nov 28, 2022",
  "matchup": "IND @ LAL",
  "headline": "Rookie Nembhard hits 3 at buzzer, Pacers stun Lakers 116-115",
  "body": "LOS ANGELES -- — Rookie Andrew Nembhard hit a 3-pointer at the buzzer, and the Indiana Pacers rallied from a 17-point deficit in the fourth quarter for a stunning 116-115 victory over the Los Angeles Lakers on Monday night.\n\n\r\n              Tyrese Haliburton scored 24 points and hit a tying layup with 39 seconds left for the Pacers, who trailed 101-84 early in the fourth. LeBron James hit a one-handed floater with 20.9 seconds left, and Myles Turner missed an ensuing 3-point attempt for Indiana — but Haliburton got the long rebound and eventually found Nembhard alone on the perimeter with a crosscourt pass.\n\n\r\n              The Canadian second-round pick from Gonzaga drilled his fourth 3-pointer of the night over the onrushing James' outstretched hand. The bucket crushed the LA crowd and set off a frenzied on-court group celebration that even included Pacers president of basketball operations Kevin Pritchard.\n\n\r\n              “I think you stay calm (because) you work in the gym for those types of moments,” Nembhard said. \"You’ve just got to bring your confidence, and when it comes, you’ve just got to step up for the team in that way. I think it was a great team win. We had a lot of contributions from a lot of guys, and it was just my turn to step up in that moment.\n\n\r\n              Haliburton had 14 assists while rookie Bennedict Mathurin added 23 points for the Pacers, who avoided their first back-to-back losses since October in dramatic fashion.\n\n\r\n              “To be able to hang in, keep your sights on the rim and let it go over a 6-9, 6-10 player is special,” Pacers coach Rick Carlisle said. “When you have success like tonight, when you overcome some odds to find a way, it's just a joyous moment for everybody to appreciate.”\n\n\r\n              Anthony Davis had 25 points and 13 rebounds for the Lakers, who were well on their way to their sixth victory in seven games before their defense and ball movement both faltered down the stretch. Davis missed one of two free throws right after the Pacers missed three consecutive layups and tip-in attempts in the final minute, leaving the door open for Nembhard's eventual heroics.\n\n\r\n              James had 21 points and seven rebounds, while Russell Westbrook scored 17 of his 24 points in the second half and energized a crowd that seemed thrilled to be witnessing a corner-turning evening for the slow-starting Lakers — until Indiana closed with a 20-8 run in the catastrophic final five minutes.\n\n\r\n              “I wish we would have been a lot more aggressive, continued playing with pace, and also being organized and continuing to move the ball,” Lakers coach Darvin Ham said. “And that falls on me.”\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Buddy Hield had 15 points, missing five of his six 3-pointers. ... Injured C Daniel Theis played alongside the Lakers' Dennis Schröder on Germany's third-place EuroBasket team this summer. Theis has yet to make his Pacers debut after knee surgery.\n\n\r\n              Lakers: Patrick Beverley served the third game of his three-game suspension for shoving Phoenix's Deandre Ayton last week. Schröder had eight points and four assists in his third straight start. ... Lakers fan Jaime Murry hit a shot from well behind midcourt to win $75,000 between the third and fourth quarters. He celebrated by hitting the Griddy and getting hugs from much of the Lakers' roster.\n\n\r\n              SAME TEAMS\n\n\r\n              Westbrook, Hield and Turner were the main characters in months of trade rumors between these clubs, but no deal was ever reached. Turner’s positional versatility and Hield’s outside shooting seem to make them ideal fits for the current Lakers, but the 17-time champions have been unwilling or unable to meet Indiana’s price.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Sacramento on Wednesday.\n\n\r\n              Lakers: Host Portland on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994333.558889
}