{
  "game_id": "0022300066",
  "espn_id": "401584694",
  "date": "Oct 25, 2023",
  "matchup": "HOU @ ORL",
  "headline": "Cole Anthony scores 20 points to help Orlando Magic beat Houston Rockets 116-86 in opener",
  "body": "ORLANDO, Fla. -- — Cole Anthony had 20 points and eight rebounds, and the Orlando Magic beat the Houston Rockets 116-86 on Wednesday night in the season opener for both teams.\n\n\r\n              Anthony went 8 for 12 from the field and played 24 minutes in a reserve role. Franz Wagner scored 17 points for Orlando, and Paolo Banchero finished with 12 points, five rebounds and five assists.\n\n\r\n              Fred VanVleet and Dillon Brooks each scored 14 points in their first game with Houston. VanVleet and Brooks signed with the Rockets in free agency.\n\n\r\n              Houston center Alperen Senguin added 14 points, eight rebounds and six assists.\n\n\r\n              Magic power forward Jonathan Isaac, who played in only 11 games over the last two seasons due to a series of injuries, had 11 points and four rebounds in 14 minutes.\n\n\r\n              Isaac finished the third quarter with a block of a Jalen Green layup and drew a technical foul for standing over Green and taunting him.\n\n\r\n              “I kind of shocked myself,” Isaac said. \"The excitement poured over, and I was just excited about the play, excited about the moment. I went over to the coach and I was apologizing and he said ‘Listen, we are with it!’\"\n\n\r\n              “That was such a momentum-building play,” Magic coach Jamahl Mosley said. “I know he got the technical, and we don’t want to do that. But the other side of it is we have said we’re a defensive team, and that set the tone. That let 'em know we’re going to protect the rim, whatever that looks like.”\n\n\r\n              The game marked the Rockets debut for Ime Udoka, who coached the Boston Celtics to the NBA Finals in his only other season (2021-22) as an NBA head coach.\n\n\r\n              “Overall defensively, we weren’t good as a group,” Udoka said. “It kind of masked it when we scored some baskets there, but in general we just weren’t good enough all-around.”\n\n\r\n              The Magic had a 56-31 rebounding advantage, and the Rockets committed 18 turnovers.\n\n\r\n              Wagner hit his first three 3-point shots while leading the Magic to an 11-point lead in the first quarter. Banchero scored six points during an 8-0 spurt to help Orlando stretch its lead to 17 before VanVleet and Brooks closed the first half with a couple of 3s for Houston.\n\n\r\n              Two more 3-pointers by VanVleet got the Rockets within one midway through the third quarter. But Banchero hit a jumper and Wagner followed a steal with a baseline runner, starting a 24-7 run that took the Magic into the fourth quarter with a 17-point lead.\n\n\r\n              Orlando is coming off four straight losing seasons.\n\n\r\n              “(The win) is going to validate us for about 30 minutes, and then we practice tomorrow and go on a tough road trip on the West Coast,” Anthony said. “We didn’t put in all this work to win one game.”\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Visit San Antonio on Friday night.\n\n\r\n              Magic: Visit Portland on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995649.437289
}