{
  "game_id": "0022200272",
  "espn_id": "401468427",
  "date": "Nov 25, 2022",
  "matchup": "MIN @ CHA",
  "headline": "Oubre scores 28, Hornets snap T-Wolves' 5-game win streak",
  "body": "CHARLOTTE, N.C. -- — Kelly Oubre Jr. scored 28 points, and the Charlotte Hornets stopped Minnesota's five-game win streak with a 110-108 victory over Anthony Edwards and the Timberwolves on Friday night.\n\n\r\n              Terry Rozier had 22 points and eight assists, helping the Hornets (6-14) win back-to-back games for the first time this season. P.J. Washington scored 16 points, and reserve Theo Maledon finished with 14 points and seven rebounds.\n\n\r\n              “It's a great mood booster for sure,\" Oubre said of getting two wins in three nights. “We have to continue to learn from our losses and mistakes and learn how to win. The more you win the more you can do the same things you did in the game before.”\n\n\r\n              Edwards scored 25 points for the Timberwolves (10-9), who shot 22% from 3-point range. D’Angelo Russell had 20 points and 10 assists, and Rudy Gobert finished with 17 points and 17 rebounds.\n\n\r\n              The Timberwolves bolted to a 62-52 halftime lead as Edwards and Karl-Anthony Towns combined for 30 points.\n\n\r\n              But Charlotte battled back to take a 91-83 lead after outscoring the Timberwolves 39-21 in the third quarter behind 11 points from Oubre and 10 from Rozier.\n\n\r\n              “We just came out with not much energy or focus and not a lot of purpose,\" Timberwolves coach Chris Finch said of his team's effort in the third. \"We haven’t done that for a long time. It was kind of our habit at the beginning of the season. Tonight, we just didn’t have it in the third quarter for whatever reason.” \n\n\r\n              Charlotte carried that momentum into the fourth. Nick Richards rejected Gobert at the rim, setting up a high-flying dunk by Kai Jones off a feed from Rozier that brought the crowd to its feet and helped push the lead to 14.\n\n\r\n              The Timberwolves had a chance to tie the game in the final seconds after Rozier missed a floater, but they were unable to corral the rebound. That forced them to foul Washington, who made one of two throws with 4.7 seconds left to help close it out.\n\n\r\n              After the free throw, Washington smiled and gave a nod to his bench.\n\n\r\n              “We are figuring out how to play,” Washington said. “The game we played tonight and the one before (a 107-101 win over the Philadelphia 76ers on Wednesday night) are two that we can grow from. If we play to our strengths it is going to be hard for teams to beat us.\"\n\n\r\n              JONES STEPS UP\n\n\r\n              Jones, a lanky, athletic 6-foot-11 2021 first-round draft pick out of Texas, was the first player off the Hornets bench as Charlotte looked to combat Minnesota’s height. The gamble paid off as the seldom-used Jones finished with nine points and 12 rebounds — both career bests.\n\n\r\n              “I don’t see that he’s doing anything that he can’t do every night,\" Hornets coach Steve Clifford said. “He’s playing to his real strengths. He’s tough, he’s a terrific athlete, he’s got a good nose for the ball, and he’s playing very smart.”\n\n\r\n              TIP INS\n\n\r\n              Timberwolves: Towns was 0 for 8 from 3-point range in the second half. ... Jaden McDaniels opened the game matched up against his older brother Jalen McDaniels.\n\n\r\n              Hornets: Played without PG LaMelo Ball (ankle), F Gordon Hayward (shoulder), PG Dennis Smith Jr. (ankle) and Cody Martin (knee).\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host Golden State on Sunday.\n\n\r\n              Hornets: Visit Boston on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995182.489703
}