{
  "game_id": "0022200454",
  "espn_id": "401468609",
  "date": "Dec 19, 2022",
  "matchup": "ORL @ ATL",
  "headline": "Murray hits winning free throws, Hawks end Magic's streak",
  "body": "ATLANTA -- — Dejounte Murray hit two decisive free throws with 1.3 seconds left, Trae Young had 37 points and 13 assists, and the Atlanta Hawks held off the Orlando Magic 126-125 Monday night to snap their six-game winning streak.\n\n\r\n              Orlando went on a 12-0 run over 2:17 late in the fourth quarter to wipe out a 13-point deficit and take a 125-124 lead on Markelle Fultz’s layup with 3.8 seconds remaining. Young inbounded from the sideline, and Murray drew a foul from Paolo Banchero. Murray hit both free throws, and Banchero missed a 3-pointer at the buzzer.\n\n\r\n              “Like I was preaching after the game, we've got to grow up, starting with me,\" Murray said. “Just what we're playing for, these type of games show we're not playing to win and get to the playoffs and try to make noise. We've got to stop being comfortable. We almost lost the game.\"\n\n\r\n              The Magic were trying for their first seven-game winning streak since January 2011. Before the surge, Orlando had lost nine in a row and 11 of 12.\n\n\r\n              “The results do matter, but the process is way more, so I think we’re a little encouraged with that fourth quarter, with the fight that we showed, and that’s kind of the mentality we need to have,\" Moritz Wagner said. “If you’re a good team, you come back from losses, too, and you keep fighting no matter what happens, so I think that’s what the mood is.\" \n\n\r\n              Atlanta welcomed back Murray and John Collins from injuries as both were game-time decisions with left ankle sprains. Collins, who finished with 12 points, missed the last eight games and Murray, who had 17, the past five.\n\n\r\n              With center Clint Caplea still sidelined by a right calf strain, Hawks coach Nate McMillan used a smaller starting lineup with Collins at center, De’Andre Hunter at forward and three guards: Young, Murray and Bogdan Bogdanovic.\n\n\r\n              Young scored 17 points in the third as the Hawks opened a 104-94 lead in the closing seconds of the period. \n\n\r\n              Murray hit a straightaway 3 with 7:30 remaining to make it 114-102, but Orlando kept chipping away and pulled within one on Fultz’s layup with 28.8 seconds left. Young missed an awkward runner with 8.7 seconds to go, and the Magic grabbed the rebound and called a timeout.\n\n\r\n              Fultz, who led the Magic with 24 points, then got to the rim easily — too easily for Hawks coach Nate McMillan.\n\n\r\n              “We’ll take the win, of course,\" he said, “but we know we’ve got to be better and we’ve got to finish better in order to continue to win ballgames.\" \n\n\r\n              Young knocked down a 34-foot straightaway 3 to put the Hawks up 124-112 with 3:03 to play, but it wasn't enough to put Orlando away.\n\n\r\n              “I knew we were going to get good looks tonight and being at home we were able to make more shots,” Young said. “We got some really good looks.”\n\n\r\n              Atlanta built an 11-point lead in the second quarter, but the Magic went on a 13-3 run and trailed 68-65 at halftime.\n\n\r\n              TIP-INS\n\n\r\n              Magic: Franz Wagner finished with 19 points. His brother Moritz had 16 and Banchero scored 19. ... Terrence Ross and Mo Bamba combined for 25 points off the bench. ... Orlando outscored the Hawks 20-19 on fast-break points. ... The Magic outrebounded Atlanta 45-41.\n\n\r\n              Hawks: AJ Griffin finished with 19 points off the bench. ... Atlanta outscored Orlando 62-48 in the paint. ... Young went 12 for 12 on free throws. ... Young picked up a technical foul with 3:03 remaining for complaining to an official about contact from Moritz Wagner on his 34-footer. ... McMillan successfully challenged a foul call on Onyeka Okongwu with 2:54 remaining.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Houston on Wednesday and host San Antonio on Friday.\n\n\r\n              Hawks: Host Chicago on Wednesday and Detroit on Friday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994641.3055449
}