{
  "game_id": "0022000362",
  "espn_id": "401307660",
  "date": "Apr 18, 2021",
  "matchup": "CHA vs. POR",
  "headline": "Rozier, Hornets snap 4-game skid, beat Blazers 109-101",
  "body": "CHARLOTTE, N.C. -- — Terry Rozier told coach James Borrego before Sunday night's game that the Charlotte Hornets needed a win over Portland, and that he was available to play extra minutes, if needed. \n\n\r\n                    Rozier broke loose 34 points, 10 assists and eight rebounds in 39 minutes, and the Hornets rode a strong first quarter to a 109-101 win over the Trail Blazers, snapping a four-game losing streak and moving to .500.\n\n\r\n                    “He was great tonight,” Borrego said. “He came out and set the tone and was making shots. It has to be one of his finest performances as a Hornet.”\n\n\r\n                    P.J. Washington had 23 points and eight rebounds after missing three games with an ankle injury, and Miles Bridges added 19 points, including two highlight-reel dunks, for the Hornets (28-28).\n\n\r\n                    Rozier knew the Hornets needed a win as they fight to earn a top-six seed in the playoffs and avoid a play-in game situation.\n\n\r\n                    “This was huge after losing the last four,\" Rozier said. \n\n\r\n                    Rozier, Washington and Bridges were a combined 15 of 31 from 3-point range as Charlotte snapped a seven-game losing streak against Portland.\n\n\r\n                    Carmelo Anthony had six 3-pointers and 24 points for the Trail Blazers (32-24), who played without star Damian Lillard for the second straight game due to a hamstring injury. CJ McCollum scored 22 points.\n\n\r\n                    The Hornets charged to an early lead, building a 43-18 lead in the first quarter behind 17 points on 7-of-8 shooting from Rozier. Rozier, despite the focus of the Blazers defense, also had six assists in the quarter, meaning he either scored or assisted on 31 of Charlotte's 44 first quarter points.\n\n\r\n                    As a team, Charlotte shot 77.3% in the opening quarter with Rozier and Bridges combining to go 6 of 6 from 3-point range.\n\n\r\n                    “Those guys came out firing,” Anthony said of the Hornets. “They were locked in. They are a scary team. They played freely and play spaced out. They play with a lot of confidence. They play fast paced and you have to match that pace or contain that pace.”\n\n\r\n                    “Their transitions kind of really set the tone for the quarter and their 3-point shooting set the tone the rest of the way,” Trail Blazers coach Terry Stotts said.\n\n\r\n                    Rozier is having to play more point guard with LaMelo Ball and Devonte Graham out with injuries — and he likes it.\n\n\r\n                    “It's unpredictable when I'm on the ball as opposed to when I'm off the ball and teams can focus on me more,” Rozier said. \n\n\r\n                    Rozier, who was 7 of 13 from 3-point range in the game, helped Charlotte push its lead to 27 points in the third quarter.\n\n\r\n                    But the Blazers battled back and cut the lead to nine with 3 1/2 minutes remaining behind four forth-quarter 3-pointers from Anthony. But after back-to-back Anthony misses, the Hornets got an open dunk from P.J. Washington to push the lead to 12 that all but sealed the win.\n\n\r\n                    TIP INS\n\n\r\n                    Trail Blazers: Charlotte’s Cody Martin had a backcourt steal and thunderous dunk on McCollum in the first quarter. McCollum seemed to take offense, as he got the ball on the next possession and drove hard for a reverse layup.\n\n\r\n                    Hornets: Graham sat out his second straight game with a quad injury but spent most of the game standing on the sideline cheering on his teammates. ... Rookie Vernon Carey Jr. who scored 21 points in his NBA starting debut against the Nets on Friday night, picked up two fouls in the game’s first 21 seconds and had to be replaced. He played seven minutes and did not score.\n\n\r\n                    BRIDGES DOES IT AGAIN\n\n\r\n                    Bridges is becoming a nightly highlight reel.\n\n\r\n                    He had two incredible dunks, one coming on a drive down the lane where he blew past Anthony near the end of the first half, and another on a one-handed put-back, extending his arm to grab the rebound and reaching back to stuff it home with authority.\n\n\r\n                    SWINNEY BOOED\n\n\r\n                    Clemson football coach Dabo Swinney was at the game. But when the Hornets showed him on the scoreboard, the crowd began to boo. The Hornets quickly tried to cover it up by adding pumped-in crowd noise consisting of cheers. \n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Host Clippers on Tuesday night.\n\n\r\n                    Hornets: At Knicks on Tuesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997349.048186
}