{
  "game_id": "0022400003",
  "espn_id": "401703372",
  "date": "Nov 12, 2024",
  "matchup": "CHA @ ORL",
  "headline": "Franz Wagner scores 32 as Magic cruise past Hornets, 114-89",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 32 points and Jalen Suggs hit his first seven shots, including three 3-pointers, to lead the Orlando Magic to a 114-89 win over the Charlotte Hornets on Tuesday night.\n\n\r\n              LaMelo Ball scored 16 of his 35 points in the first quarter for the Hornets in the opening round of Group A play in the NBA Cup. Coming off a career-high 38 points in Sunday’s overtime loss at Philadelphia, Ball added six rebounds and seven assists.\n\n\r\n              Suggs had 13 points in the first quarter and finished with 17 points and two steals.\n\n\r\n              Greg Williams scored 15 points and Moussa Diabate had 12 points and 15 rebounds for Charlotte.\n\n\r\n              Takeaways\r\n              \r\n              Hornets: Ball’s big first quarter (16 points, two assists) and 3-point shooting (10 of 21) kept the Hornets in the game despite 10 turnovers in the second quarter. But then the shots stopped falling and Charlotte quickly fell behind by 23.\n\n\r\n              Magic: In the absence of the injured Paolo Banchero and Wendell Carter Jr., the Magic have turned up their defense in three consecutive home wins by 27, 27 and 25 points.\n\n\r\n              Key moment\r\n              Wagner was the only player for either team to score a field goal during a 4 1/2-minute stretch of the second quarter while the Magic went on a 19-3 run to take a 52-35 lead.\n\n\r\n              Key stat\r\n              The Magic had a 45-27 edge in bench scoring.\n\n\r\n              Up next\r\n              \r\n              Hornets: Host Milwaukee on Saturday.\n\n\r\n              Magic: Host Indiana on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997465.74098
}