{
  "game_id": "0022200051",
  "espn_id": "401468206",
  "date": "Oct 24, 2022",
  "matchup": "DEN @ POR",
  "headline": "Simons, Lillard lead unbeaten Blazers past Nuggets 135-110",
  "body": "PORTLAND, Ore. -- — Anfernee Simons had 29 points, including seven 3-pointers, and the Portland Trail Blazers won their fourth straight game to start the season with a 135-110 victory over the Denver Nuggets on Monday night. \n\n\r\n              Simons had 22 points and six 3s in the third quarter alone as Portland became the only 4-0 team in the NBA. Damian Lillard finished with 31 points and eight assists for the Blazers, who took over in the second half after a sluggish start. \n\n\r\n              “Explosive, and fun,” Lillard said about Simons' third-quarter outburst. “Just being able to see it — I was looking into the crowd. It was crazy, like he's blowing the roof off this place.” \n\n\r\n              The last time Portland opened 4-0 was 1999. The Blazers are the lone undefeated team in the Western Conference. \n\n\r\n              Aaron Gordon scored 26 for the Nuggets (2-2). Nikola Jokic, who had consecutive triple-doubles in Denver's previous two games, got into foul trouble and finished with nine points, nine rebounds and nine assists. \n\n\r\n              “We were embarrassing tonight,” Nuggets coach Michael Malone said. “It was a poor effort after that first quarter. We did not defend at all. We cannot guard one-on-one right now at all.”\n\n\r\n              The Nuggets, with their bigger lineup, led by 11 early. Gordon's dunk gave Denver a 53-40 advantage. \n\n\r\n              Portland rallied with Lillard's 3-pointer and Jusuf Nurkic's layup and free throw to close the gap to 57-51 late in the first half, but Denver led 61-55 at the break. \n\n\r\n              Simons tied it at 64 early in the second half and his 3-pointer put the Blazers up 79-70. On a timeout, Simons was mobbed by teammates in celebration. Portland outscored the Nuggets 44-25 in the third quarter. \n\n\r\n              “You can’t let a guy get to that space in the first place, but some of those shots he was making you've just got to — the old adage, you know — shake his hand, pat him on the back and say good shot,” Gordon said. \n\n\r\n              Simons said it occurred to him that he was on a roll on his fourth 3. He missed just one shot from the perimeter in the quarter. \n\n\r\n              “I shot one from on top of the key when I fell down, that was when I was like, I guess it's one of those nights,” Simons said. “I shot that one blind.” \n\n\r\n              Portland had a 99-86 lead heading into the final period. Josh Hart's tip extended it to 107-88. \n\n\r\n              Nurkic finished with 13 points and 12 assists.\n\n\r\n              “Our understanding for what we're trying to do is just getting better,” Lillard said. “I think the best thing about it is that it feels sustainable.” \n\n\r\n              HONORS\n\n\r\n              Lillard was selected the NBA Western Conference Player of the Week for the week ending Sunday. He averaged 34 points, 5.3 rebounds and 4.3 assists over the Blazers' first three games of the season. He made 12 3-pointers during that span. \n\n\r\n              HIGH MOTOR\n\n\r\n              Blazers coach Chauncey Billups said Hart is such a high-level competitor that sometimes he even has to sit him in practice because “he’s got no switch.” Hart finished with six points and 11 rebounds against the Nuggets. \n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Denver won last season's series against the Blazers 3-1. ... Jokic was called for his fourth foul with 6:55 left in the third quarter. ... Jokic has matched Wilt Chamberlin for sixth on the career list with 78 triple-doubles. ... Michael Porter Jr. finished with 18 points. \n\n\r\n              Trail Blazers: Played without Justice Winslow because of a right ankle sprain. Billups indicated before the game it did not appear to be a long-term injury. “I don't think so. I hope not,” he said. \n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host the Los Angeles Lakers on Wednesday.\n\n\r\n              Trail Blazers: Host the Miami Heat on Wednesday. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994741.149125
}