{
  "game_id": "0021600887",
  "espn_id": "400900293",
  "date": "Feb 27, 2017",
  "matchup": "DAL vs. MIA",
  "headline": "Curry, Mavs hand Heat 3rd loss in 19 games with 96-89 win",
  "body": "DALLAS --  Seth Curry signaled for a three-point play when he was knocked down after making a jumper to give Dallas its first lead.\n\nThe younger sibling of Golden State's Stephen Curry didn't need any gestures -- but still provided them along with some shouts to the crowd -- on two long 3-pointers in the second half, the latter putting the Mavericks ahead for good in the final two minutes.\n\nCurry scored 29 points, Harrison Barnes added 24 and the Mavericks handed the Heat just their third loss in 19 games with a 96-89 victory Monday night.\n\nTwo games after scoring a career-high 31 points in a loss at Minnesota, Curry was 5 of 7 from long range on the same night his more famous brother was a career-worst 0 for 11 from deep in the Warriors' win at Philadelphia.\n\n\"I haven't played this many minutes in my career, so it was good for me to get some rest and come back with a new, fresh mindset and just try to play to win,\" said Curry, whose go-ahead 3 gave Dallas a 90-89 lead.\n\nGoran Dragic scored 24 points for the Heat, who were outscored 12-0 over the final 4:37 as a three-game winning streak ended along with a franchise-best run of 16 games with at least 100 points.\n\nHassan Whiteside, a free agent target for Dallas last summer, had 19 points and 19 rebounds. Now the Mavericks are preparing for a future with 22-year-old Nerlens Noel, who came from Philadelphia before the trade deadline.\n\nThe rangy 6-foot-11 forward-center had a crowd-energizing block from behind on Whiteside and finished with six points and six rebounds. Dallas is 2-0 with him in the lineup.\n\n\"I want to win these guys over and let them know that I'm playing for them,\" Noel said. \"Any way possible.\"\n\nDragic completed a 9-0 Heat run with a 3-pointer for an 89-84 lead. But Miami missed its last seven shots, and the Mavericks scored the final six points on free throws after Curry put them in front.\n\nCurry scored 11 points in the second quarter, including the three-point play that gave Dallas its first lead at 48-46.\n\nTIP-INS\n\nHeat: C Willie Reed won't need a boot or crutches to treat bursitis in his right ankle. Coach Erik Spoelstra said Reed was day to day. ... The visit to Dallas was the Miami's last road game against the West this season. ... Whiteside had his 38th double-double this season and the 101st of his career.\n\nMavericks: Coach Rick Carlisle said G J.J. Barea is at least a week away from returning from a left calf strain that has sidelined him the past 16 games and for 33 of the 41 games he has missed this season.\n\nTOP-HEAVY SCORING\n\nCurry and Barnes were the only Dallas scorers in double figures, but Dirk Nowitzki had a season-high 12 rebounds to go with eight points.\n\nDELAY OF GAME PENALTY\n\nThe Heat were given a technical for delay of game coming out of a timeout when they had the ball with an 89-86 lead with 3:26 remaining. Curry made the free throw, then hit the go-ahead shot after the teams traded turnovers. \"A little bit of communication of who was taking the ball out, but it's not as if we were in the huddle,\" Spoelstra said. \"That's not why we lost the game.\"\n\nUP NEXT\n\nHeat: Home against Philadelphia on Wednesday in the third game of a six-game stretch alternating between home and road. That stretch ends at defending champion Cleveland on the second night of a back-to-back Saturday.\n\nMavericks: At Atlanta on Wednesday before a season-long five-game homestand starting with Memphis on Friday.\n\n---\n\nThis story has been corrected to show Seth Curry had two long 3-pointers in the second half, not the fourth quarter.",
  "source": "espn_api",
  "crawled_at": 1764996113.1459498
}