{
  "game_id": "0022400022",
  "espn_id": "401703391",
  "date": "Nov 19, 2024",
  "matchup": "CHA @ BKN",
  "headline": "Cam Johnson and Dennis Schroder carry the Nets to a 116-115 win over the Hornets",
  "body": "NEW YORK -- — Cam Johnson scored 34 points, Dennis Schroder had 14 points and 12 assists and the Brooklyn Nets beat the Charlotte Hornets 116-115 Tuesday night.\n\n\r\n              Charlotte's Brandon Miller missed a 3-pointer that would have tied the game with 1.1 seconds left. Grant Williams then tipped the ball as time expired.\n\n\r\n              Jalen Wilson had 17 points and Dorian Finney-Smith added 15 as Brooklyn snapped a three-game skid.\n\n\r\n              Trendon Watford scored the Nets' last seven points in the final two minutes and finished with 10 points off the bench.\n\n\r\n              Miller had 29 points, Miles Bridges 21 and reserve Tre Mann 19 as the Hornets lost for the fourth time in five games.\n\n\r\n              Takeaways\r\n              Hornets: Ball, Bridges and Miller sparked a hot start by each scoring eight points enroute to a 37-20 lead at the end of the first quarter. Charlotte shot 13 for 19 from the field and 8 for 12 from 3-point range. Five of the first six shots made in the period were 3-pointers.\n\n\r\n              Nets: Ben Simmons scored in double figures for the first time this season with 10 points. It’s his first since Feb. 10 against San Antonio, when he scored 13.\n\n\r\n              Key Moment\r\n              Ahead by three points with two minutes remaining, Brooklyn's Trendon Watford drove the lane for a layup and extended the lead to 111-108. On the play, Watford made contact with Mann's face. A relay review took the basket away and there was a ruling of a defensive foul. Watford made both free throws.\n\n\r\n              Key stat\r\n              The Nets had 31 assists. It was New York's fourth game of the season with at least 30.\n\n\r\n              Up next\r\n              The Hornets host Detroit on Thursday. The Nets open a four-game trip at Philadelphia on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997461.639869
}