{
  "game_id": "0021501098",
  "espn_id": "400828985",
  "date": "Mar 28, 2016",
  "matchup": "OKC @ TOR",
  "headline": "Russell Westbrook posts his 16th triple-double; OKC wins 8th straight",
  "body": "TORONTO -- Russell Westbrook might be putting up numbers like Michael Jordan and Magic Johnson, but he isn't about to get caught star gazing.\nWestbrook had 26 points, 12 assists and 11 rebounds in his 16th triple-double of the season, and the Oklahoma City Thunder beat the Toronto Raptors 119-100 on Monday night for their eighth straight victory.\n\nIt was Westbrook's seventh triple-double in March, the most in a month since Jordan had seven in April, 1989. He has the most in a season since Johnson had 17 in 1988-89.\n\"I think it's something I never take for granted, but I like winning, so regardless of what the numbers say I like to win the game and make sure my teammates feel good about themselves and figure it out from there,\" Westbrook said.\nKevin Durant scored 34 points for the Thunder, who extended the NBA's longest current winning streak and their longest since a 10-game run from Jan. 16-31, 2014. The victory also tied the season series after Toronto's 103-98 win in Oklahoma City on Nov. 4.\nDeMar DeRozan had 19 points and Norman Powell added a career-high 18 for the Raptors, who lost at home for just the fourth time in 2016 and remain one win shy of a first 50-win season in franchise history.\nDurant wouldn't call this the Thunder's best road win of the season but said the previous matchup had been brought up before the game. The Thunder sent the Raptors to the line 39 times in that game. The Raptors were held to just 23 trips on Monday.\n\"We talked about that. We gave them the game out in OKC,\" he said. \"That was so long ago, but we had that in the back of our minds tonight, and we came out and responded well.\"\nA 15-3 run to open the game put Oklahoma City in control early on, and though the Raptors took the lead for the only time in the game on Patrick Patterson's 3-pointer with 9:30 to play in the second quarter, the Thunder responded with 11 straight points and led by as much as 26 in the fourth quarter.\nThe Thunder had a 24-14 advantage in second-chance points.\n\"Meet their physical force with your physical force,\" Raptors coach Dwane Casey said. \"When somebody is pushing you under the basket legally, hit them first before they hit you. We were reacting instead of being the actor in those situations.\"\nLOWRY DRAINED\nToronto's Kyle Lowry's right elbow was drained after the game, stemming from some inflammation he first experienced in the game in London in January. But he wasn't going to use that as a reason for his performance in the loss. \"I'm not going to make excuses,\" said Lowry, who had 14 points on 4-of-14 shooting and four assists. \"It's definitely something I don't want to play with ... but it is what it is. This time of year you just play through it.\"\nRUSSELL REACTS\nWith Oklahoma City up 102-87 with 7:52 to play in the fourth quarter, Westbrook missed his second of two free throws but was the first to react, grabbing the rebound to score on an unconventional three-point play. Durant, who put his hands on his head in awe, was suitably impressed. \"That was unreal,\" he said. \"You've got to time that right and you've just got to be as athletic as hell. I don't know if there's anybody in the league that can do that. You've got to make the free throw but I'll take the two points and the acrobatic play instead. He's a freak of nature, man.\"\nMAGICAL THUNDER\nDuring the Thunder's eight-game win streak, the team is averaging 117.3 points and has won by an average margin of 17.1 points. According to the Elias Sports Bureau, the last team to win eight straight games and score at least 110 points in each was the Orlando Magic in 1994.\nTIP-INS\nThunder: In the Thunder's only trip to Toronto this season, Durant passed Canadian icon Steve Nash (17,387 points) for 79th on the NBA's career scoring list. Additionally, it was the 59th consecutive game that Durant has scored 20-plus points, the longest such streak since Kobe Bryant put together a 63-game run from Dec. 9, 2005, to Nov. 3, 2006. .... For the 22nd time this season, Westbrook and Durant finished with at least 20 points, five rebounds and five assists, extending their NBA single-season record for the most such games by a pair of teammates. The previous high was 20, set by Michael Jordan and Scottie Pippen 1991-92.\nRaptors: Terrence Ross (thumb) missed his third consecutive game.\nUP NEXT\nThunder: Visit Detroit on Tuesday.\nRaptors: Host Atlanta on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994128.809205
}