{
  "game_id": "0021500205",
  "espn_id": "400828092",
  "date": "Nov 23, 2015",
  "matchup": "MIL vs. DET",
  "headline": "Monroe helps Bucks beat Pistons 109-88",
  "body": "MILWAUKEE --  Greg Monroe put together a big night against his former team. His new teammates also had a lot of fun.\n\nMonroe had 20 points and 13 rebounds, leading the Milwaukee Bucks to a 109-88 victory over the Detroit Pistons on Monday.\n\n\"I am trying to win every game,\" Monroe said. \"They just happen to be my former team. No matter who comes in here, I going to come in with the same focus. That is do what I need to do to help my team win on that night. They just happen to be the only other team I have played for.\"\n\nMilwaukee had seven players score in double figures, including each of its starters. Giannis Antetokounmpo had 17 points, Khris Middleton scored 16 and Jerryd Bayless had 14 points.\n\nThe Bucks had lost three straight and five of six.\n\nMonroe was selected by Detroit with the seventh pick in the 2010 draft and played his first five NBA seasons with the Pistons. But he signed a free-agent deal with Milwaukee in July.\n\nMonroe played a key role as the Bucks grabbed control by outscoring the Pistons 33-22 in the second quarter and 30-14 in the third period. Monroe's putback lifted Milwaukee to an 88-62 lead heading into the fourth.\n\nIt was so bad that Pistons coach Stan Van Gundy ripped into his team before opening the locker room doors.\n\n\"Look, we didn't match up to their intensity and energy,\" he said. \"If you play like that, you deserve to get blown out.\"\n\nAndre Drummond had 15 points and 15 rebounds for Detroit, but appeared to hurt himself late in the second quarter. He walked slowly up the court holding his left side after trying to defend Monroe.\n\nDrummond started the third quarter, but the NBA's leading rebounder wasn't the same in the second half. He went 6 for 11 from the field in the first half and 0 for 3 in the second.\n\n\"We just tried to be physical,\" Middleton said of the Bucks' plan for Drummond. \"We know he doesn't like contact. Once he misses a couple, he is going to get down on himself and start forcing tough shots. Greg did a great job of just making him shot tough shots and not letting him get to his right hand.\"\n\nVan Gundy downplayed any idea of an injury to Drummond.\n\n\"Nah, he just got hit,\" Van Gundy said. \"He's fine.\"\n\nKentavious Caldwell-Pope scored 17 points for the Pistons, who have dropped six of eight. Stanley Johnson had 16 points and Anthony Tolliver scored a season-high 13.\n\nTIP-INS\n\nPistons: Darrun Hilliard, the 38th overall pick in the 2015 draft, made his Pistons debut at the start of the second quarter. ... The Pistons were 3 of 13 from 3-point range in the first half.\n\nBucks: Michael Carter-Williams and Jabari Parker scored 12 points apiece, and Greivis Vasquez had 10. ... The Bucks beat Detroit for the fourth consecutive game.\n\nUP NEXT\n\nPistons: Host Miami on Wednesday night.\n\nBucks: Host Sacramento on Wednesday night.\n\nSEVEN STITCHES\n\nMilwaukee guard O.J. Mayo needed seven stitches to close a cut above his right eye.\n\n\"Caught an elbow,\" he said. \"Not a bad play. Things happen. It is all good. I don't mind getting stitches if we get a W.\"\n\nASSIST BATTLE\n\nMilwaukee had 30 assists, including eight from Carter-Williams, while Reggie Jackson had seven of Detroit's 19.\n\nUGLY SHOOTING\n\nDetroit was 31 of 91 (34.1 percent) from the floor, including a 6-for-28 performance from 3-point range.",
  "source": "espn_api",
  "crawled_at": 1764994095.710321
}