{
  "game_id": "0021900386",
  "espn_id": "401161028",
  "date": "Dec 14, 2019",
  "matchup": "DET @ HOU",
  "headline": "Kennard and Rose help Pistons over Rockets 115-107",
  "body": "HOUSTON --  When the Detroit Pistons had a comfortable lead entering the fourth quarter Saturday night, coach Dwane Casey knew the Houston Rockets would make a run late and he'd need someone to step up to hold them off.\n\nHe got that boost from Derrick Rose, who came off the bench to score 10 of his 20 points in the fourth quarter to help the Pistons outlast the Rockets 115-107.\n\n\"That's what you've got to have and that's what his league is about is having players that can create their own shot,\" Casey said. \"And he did that. He was tough downs the stretch.\"\n\nLuke Kennard scored 22 points as the Pistons didn't trail in the last two quarters and were up by double figures for most of the second half.\n\nHouston used a 9-2 run, with a 3 from Chris Clemons, to cut the lead to 112-107 with 41 seconds remaining. But Tony Snell made two free throws after that and Bruce Brown made one of two free throws after a miss by Houston to secure the victory.\n\nJames Harden led the Rockets with 39 points after two straight 50-point games, but it wasn't enough to keep Houston's winning streak going on a night Russell Westbrook sat out to rest. Harden played 38 1/2 minutes, but was taken out with 1:23 left and didn't return.\n\n\"Our 3s were short and James got beat up and tired,\" coach Mike D'Antoni said of Harden, who played 36 minutes in a win over Orlando on Friday night. \"He carries a big load, but there were other things that needed to happen that just didn't happen for us.\"\n\nRose had 12 assists, Bruce Brown had 16 points and 10 rebounds and Markieff Morris added 15 points as the Pistons won for the third time in four games.\n\nCasey gave Brown credit for making things tough on Harden. He made just 14 of 33 shots.\n\n\"What Bruce did to pick up full court for every minute he was in there was a man's job because you're tired,\" Casey said. \"He's a little bit more tired because he played last night but it takes discipline and a lot of grit.\"\n\nThe Rockets used a 5-0 run to cut the lead to 8 with two minutes left. But Detroit got baskets from Rose and Kennard after that to push the lead to 110-98 with about 90 seconds to go.\n\nDetroit led by 12 after a 6-0 run capped by two dunks from Brown before the Rockets used a 7-2 spurt to get within 98-91 with about five minutes left. An 8-2 run by the Pistons, with the last six points from Rose, came next to push the lead to 106-93 with 3 1/2 minutes to go.\n\nThe Pistons led by 10 at halftime and opened the second half with a 7-2 run to push the lead to 69-54 with about eight minutes left in the third.\n\nDetroit was still up by 15 later in the third quarter before the Rockets made the next eight points, with six from Harden, to cut it to 80-73 with three minutes left in the quarter.\n\nBut the Pistons scored the next six points, with a 3 from Morris, to push the lead to 86-73 with about a minute left in the third.\n\nDetroit led 88-75 entering the fourth.\n\nTIP-INS\n\nPistons: F Blake Griffin didn't return after halftime because of a sore left knee. ... Christian Wood had 11 points and 13 rebounds.\n\nRockets: C Tyson Chandler missed his fifth straight game with flu-like symptoms. ... Harden received a technical foul in the first quarter for chirping at the officials after not getting a foul call on a 3-point attempt. ... Saturday snapped a streak of a franchise-record 10 straight games where the Rockets scored at least 115 points.\n\nTHEY SAID IT\n\nHarden on not using the schedule as an excuse for a loss -- \"We all know how difficult it is. You've just got to continue to fight through it. Tough one for us tonight.\"\n\nA TALE OF TWO HALVES\n\nHouston center Clint Capela had 12 points and 19 rebounds but struggled after halftime. He made 6 of 7 shots before the break, but was 0 for 6 after that.\n\nUP NEXT\n\nPistons: Host Washington on Monday night.\n\nRockets: Host San Antonio on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764996292.1592672
}