{
  "game_id": "0021801135",
  "espn_id": "401071808",
  "date": "Mar 29, 2019",
  "matchup": "LAL vs. CHA",
  "headline": "James, Caldwell-Pope shoot Lakers past Hornets, 129-115",
  "body": "LOS ANGELES --  The Los Angeles Lakers wanted to move the ball on offense and contain Charlotte Hornets guard Kemba Walker on defense.\n\nThey succeeded on both goals, completing an emphatic sweep of the two-game season series.\n\nLeBron James had 27 points and nine assists, Kentavious Caldwell-Pope scored 25 points and the Lakers ended the Hornets' four-game winning streak with a 129-115 victory on Friday night.\n\nRajon Rondo had 17 of the Lakers' 34 assists, and Kyle Kuzma added 20 points as the Lakers won their third straight at home.\n\n\"The ball movement has been great. We've been spacing the floor, getting it to the open guy,\" Caldwell-Pope said. \"It's been good for us, and the way we've been playing on both ends of the ball has been amazing.\"\n\nWalker scored 24 points and had six assists for the Hornets, who trail Miami for the final playoff spot from the Eastern Conference by two games with seven games remaining.\n\nCaldwell-Pope did most of his damage from 3-point range, where he was 6 of 10, and the rest of the Lakers dominated from inside the arc by making 62 percent of their shots there (33 for 53).\n\nWhile many of their best offensive performances have come when playing fast and getting out in transition, Los Angeles only had 16 fast-break points, which reflected Charlotte coach James Borrego's assessment of a poor defensive effort.\n\n\"They didn't feel us all night on the other end,\" Borrego said. \"They got the shots they wanted. Guys we were trying to run off the line, they got shots, so you got to give the Lakers credit. We've got to come to compete a little bit more at that end of the floor.\"\n\nCaldwell-Pope had 17 points in the first half and made 4 of 6 3-point attempts, helping the Lakers take a 69-59 lead at the break.\n\nThe Hornets didn't fare much better to start the second half, with the Lakers opening the third quarter on a 14-4 run and pushing out the lead to as many as 20 points.\n\n\"It basically comes down to us just not being all the way locked in,\" said Hornets guard Dwayne Bacon, who had 21 points.\n\nLos Angeles was just as effective in limiting Walker, who was 1 for 7 from 3. It didn't help the Hornets' cause that Jeremy Lamb was 1 for 11 for seven points in 20 minutes after spraining his right ankle against San Antonio on Tuesday.\n\n\"We just wanted to contain (Walker), get the ball out of his hands as much as possible, make other guys make plays,\" Caldwell-Pope said.\n\nEMBRACING THE ROLE\n\nLakers coach Luke Walton downplayed the idea that his team had taken to playing spoiler after being eliminated from playoff contention for the sixth consecutive season, but Caldwell-Pope liked dealing a blow to someone else's aspirations.\n\n\"Why not? We wanted to be in the playoffs as bad as the other team, but, unfortunately, we're not there,\" Caldwell-Pope said. \"So why not wreck some other teams?\"\n\nThe Lakers could still have a say in postseason seeding and matchups as their final five games are against Western Conference teams currently holding playoff spots.\n\nSHAKE IT OFF\n\nThe Hornets got off to a good start with a 12-0 run in the first quarter, but rookie forward Miles Bridges said they \"kind of backed up a little bit\" after taking an early eight-point lead.\n\n\"We have to keep the pedal to the metal,\" Bridges said.\n\nTIP-INS\n\nHornets: The Hornets had six players score in double figures. Bridges had 17, Frank Kaminsky III and Marvin Williams each added 13, and Devonte Graham scored 11. ... Charlotte was 16 of 17 at the free throw line, with the only miss from Bismack Biyombo.\n\nLakers: Rondo had five steals to go with his season high in assists, becoming the first Laker with at least 17 assists and five steals since Magic Johnson on Dec. 15, 1989, at Boston. . Lance Stephenson got his first double-double of the season with 14 points and 13 rebounds.\n\nUP NEXT\n\nHornets: Visit Golden State on Sunday.\n\nLakers: Visit New Orleans on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994313.622941
}