{
  "game_id": "0022400435",
  "espn_id": "401705001",
  "date": "Dec 28, 2024",
  "matchup": "LAL vs. SAC",
  "headline": "Anthony Davis, Lakers spoil interim coach Doug Christie's Kings debut with 132-122 win",
  "body": "LOS ANGELES -- — Anthony Davis had 36 points, 15 rebounds and eight assists in the Los Angeles Lakers' 132-122 win over Sacramento on Saturday night in the Kings’ first game under interim coach Doug Christie.\n\n\r\n              LeBron James didn’t play for the Lakers because of illness, but a balanced effort helped make up for his absence, led by Austin Reaves with 26 points and a career-high 16 assists. Rui Hachimura had 21 points, Max Christie chipped in with 16 and Dalton Knecht had 18 off the bench. \n\n\r\n              Playing for the first time since Mike Brown was fired on Friday in controversial fashion, De’Aaron Fox led the Kings with 29 points and 12 assists, and DeMar DeRozan had 25 points.\n\n\r\n              Los Angeles erupted for 12 straight points to end the third and start the fourth to open up a 20-point advantage. \n\n\r\n              Sacramento got it to 123-117 with less than four minutes to go, but Reaves and Christie made sure the home team held on. \n\n\r\n              Takeaways\r\n              Kings: Doug Christie made it 15 years in the NBA because of his commitment to defense. He'll need to instill that into his team after the Kings gave up 33 free-throw attempts. \n\n\r\n              Lakers: Reaves' playmaking isn't needed as much when James is in the lineup, but he can distribute the ball when he is asked to.\n\n\r\n              Key moment\r\n              Domantas Sabonis picked up his fifth foul with 4:17 left in the third, and the power forward was missed as the Lakers pulled away by attacking the paint when he was on the bench. He would foul out with 5:20 remaining in the game.\n\n\r\n              Key stat\r\n              The Lakers are now 2-1 without James in the lineup, with Hachimura helping out in both wins. He had 23 against Portland on Dec. 8.\n\n\r\n              Up next\r\n              The Kings host Dallas on Monday, and the Lakers continue their four-game homestand against Cleveland on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997190.064219
}