{
  "game_id": "0022400831",
  "espn_id": "401705397",
  "date": "Feb 25, 2025",
  "matchup": "HOU vs. MIL",
  "headline": "Green has 25 points as Houston Rockets hold on for 100-97 win over Milwaukee Bucks",
  "body": "HOUSTON -- — Jalen Green had 25 points and Alperen Sengun added 23 to lead the Houston Rockets to a 100-97 win over the Milwaukee Bucks on Tuesday night in a game where Amen Thompson was ejected for a hard foul on Giannis Antetokounmpo.\n\n\r\n              The game was tied at 95-all when Sengun made 1 of 2 free throws to put Houston on top. He made two more free thors with 30 seconds left to make it 98-95.\n\n\r\n              Brook Lopez missed a 3-pointer, but a turnover by Sengun gave the Bucks the ball back and a dunk by Antetokounmpo cut the lead to one with 8.1 seconds to go.\n\n\r\n              Green added two free throws to make it 100-97 and Damian Lillard was fouled and missed the first free throw before a double lane violation on the second one triggered a jump ball.\n\n\r\n              Lillard came away with the ball and his 3-point attempt bounced off the rim.\n\n\r\n              The Bucks were down by 2 with about 4 1/2 minutes left when Thompson pulled Antetokounmpo down from behind by the head and neck as he went up for a shot in the lane. The play was reviewed and determined to be a flagrant foul 2 and Thompson was ejected.\n\n\r\n              Antetokounmpo had 27 points and 10 rebounds to lead the Bucks, who had a four-game winning streak snapped.\n\n\r\n              Takeaways \r\n              Bucks: Milwaukee needs to work on offensive consistency after failing to score in the fourth quarter until Lillard made two free throws with about six minutes to go.\n\n\r\n              Rockets: Houston needs to do a better job of capitalizing on offense when its defense shuts teams down. They only scored seven points in the first six minutes of the fourth when they held Milwaukee scoreless.\n\n\r\n              Key moment\r\n              Sengun’s free throws that put the Rockets up for good.\n\n\r\n              Key stat\r\n              Milwaukee scored 12 points in the fourth quarter.\n\n\r\n              Up next\r\n              The Rockets host San Antonio on Wednesday night and the Bucks host Denver on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997364.948724
}