{
  "game_id": "0022400807",
  "espn_id": "401705373",
  "date": "Feb 22, 2025",
  "matchup": "BKN @ PHI",
  "headline": "Claxton scores winner at the horn to send Nets past 76ers 105-103",
  "body": "PHILADELPHIA -- — Nic Claxton scored 16 points and tipped in the winner as time expired, Cam Johnson had 23 points and the Brooklyn Nets edged the Philadelphia 76ers 105-103 on Saturday night.\n\n\r\n              Tyrese Maxey buried a 3 with 25 seconds left that tied it at 103 and helped the 76ers rally from a 17-point deficit. \n\n\r\n              The game seemed set for overtime when Keon Johnson missed a long 3, only for Claxton to be in the right spot to score at the horn and send the Nets storming onto the court in a wild celebration.\n\n\r\n              Trendon Watford also scored 16 points for the Nets.\n\n\r\n              Maxey led the 76ers with 31 points.\n\n\r\n              The 76ers played at full strength with All-Stars Joel Embiid, Paul George and Maxey in the starting lineup. It didn't seem to matter until the fourth. Quintin Grimes hit a 3 for the Sixers for a 95-94 lead and Maxey snapped another tie with a 3 that made it 100-97.\n\n\r\n              Even with little to play for except a better spot in the NBA draft lottery, the Nets kept at it and Keon Johnson hit a go-ahead 3 that made it 102-100.\n\n\r\n              Takeaways\r\n              Nets: The Nets made a whopping 15 of 20 shots (75%) in the first quarter for a double-digit lead that was enough to sustain them until late in the fourth.\n\n\r\n              76ers: Embiid scored just 14 points and sat out the entire fourth quarter. He did appear to tweak his left knee and was slow to get up late in the third. He also was just ineffective, missing all six 3-point attempts.\n\n\r\n              Key moment\r\n              Claxton getting left wide open for the winner made the difference. But another poor shooting night from George doomed the 76ers. Down five in the fourth, George missed a running pullup jump shot and a 3-pointer on the same possession. \n\n\r\n              Key stat\r\n              The 76ers missed 21 of 28 3-pointers.\n\n\r\n              Up next\r\n              Both teams play Monday night, with the Nets at Washington, while the 76ers host Chicago.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997975.0247822
}