{
  "game_id": "0021800833",
  "espn_id": "401071506",
  "date": "Feb 09, 2019",
  "matchup": "MIL vs. ORL",
  "headline": "Playing without Antetokounmpo, Bucks lose to Magic 103-83",
  "body": "MILWAUKEE --  With Giannis Antetokounmpo on the bench in street clothes, the Milwaukee Bucks had their lowest scoring output of the season and fell flat.\n\n\"We'll probably throw this one in the trash can and move on,\" coach Mike Budenholzer said. \"We just didn't have it tonight.\"\n\nAntetokounmpo sat out with right knee soreness after scoring 29 points and grabbing 17 rebounds in Milwaukee's win over Dallas on Friday night. His absence was clearly felt in a listless 103-83 blowout loss to the Orlando Magic on Saturday night that snapped the Bucks' six-game winning streak.\n\nJonathan Isaac scored 17 points and Nikola Vucevic and Terrence Ross each added 15 for Orlando. Vucevic also pulled down 17 rebounds.\n\n\"Obviously, without Giannis it is a different team. He is a huge part because he brings so much attention,\" Vucevic said. \"You have to game plan just for him. It did help a little bit that he wasn't out there because he is such a great player. I am glad that we took care of business and we got this win.\"\n\nAaron Gordon chipped in 14 points as Orlando prevented Milwaukee form sweeping the three-game season series.\n\nThe Bucks, who have the league's best record at 41-14, lost for just the second time in 14 games.\n\n\"They played hard, they hit shots. They made us uncomfortable,\" Bucks forward Khris Middleton said.\n\nThe Magic led by as many as 25 in the fourth quarter and clamped down on defense, especially in the second half, to stymie the Bucks high-powered offense. Milwaukee's previous low point total was 87 in a loss to Miami on Dec. 22.\n\n\"I thought in the second half we did a lot better job just keeping the ball out of the paint,\" Orlando coach Steve Clifford said.\n\nEric Bledsoe had 19 points and Malcolm Brogdon 14 for Milwaukee, which shot just 33 percent overall and made only six of 35 shots from 3-point range, tying their fewest number of 3s made in a game this season.\n\n\"I'm thinking everybody was tired,\" Bledsoe said. \"We had no legs. We missed a lot of threes.\"\n\nThe Bucks took an early 8-0 lead, but Orlando answered with a 20-4 run and held a 20-19 lead after the first quarter. Milwaukee shot just 30 percent in the period.\n\nOrlando led 59-49 at the half, shooting 53 percent.\n\nTIP-INS\n\nMagic: Ross had 13 points in the second quarter. ... Rookie C Mo Bamba missed a fourth straight game with a stress fracture of his left tibia.\n\nBucks: Middleton returned after sitting out Friday night to rest. ... With Antetokounmpo out, Tony Snell started. ... Scored a season-low 15 third-quarter points. The team's previous low was 17 on Oct. 22 against the Knicks.\n\nGIANNIS SITS\n\nAntetokounmpo missed his fourth game this season. \"The soreness and the pounding of his body is pretty significant,\" Budenholzer said. \"I don't think it's a long-term thing, but I think a back-to-back, and the loads his puts himself through for us, he needs this.\"\n\nMIROTIC ARRIVES\n\nNikola Mirotic, acquired from New Orleans in a three-team trade near the trading deadline, donned a Bucks uniform for the first time but didn't see action as he continues to recover from a right calf strain. The fifth-year forward missed his last seven games with the Pelicans and wasn't with the Bucks for their game at Dallas on Friday. \"We were very, very excited for him to be in our gym this morning, shooting and working,\" Budenholzer said. \"We'll just see how the next days go.\"\n\nMORE THAN A SCORER\n\nWith a reputation as a sharpshooter, Mirotic is eager to show his new Bucks teammates that he can do more than score. \"They want somebody who will spread the floor, someone who can shoot,\" Mirotic said before the game. \"There is much more I can do. This year has been (my) best year for rebounding. I am not just a shooter.\"\n\nBudenholzer concurred.\n\n\"He can make shots from deep. As a big guy, he can also be a playmaker,\" Budenholzer said. \"He's just a really versatile player. I also think there's a toughness to him that's underappreciated. He's shown to be a better defender than people give him credit for.\"\n\nUP NEXT\n\nMagic: At Atlanta on Sunday\n\nBucks: At Chicago on Monday. Milwaukee has won four in a row against the Bulls.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994957.209881
}