{
  "game_id": "0021900435",
  "espn_id": "401161077",
  "date": "Dec 21, 2019",
  "matchup": "MEM vs. SAC",
  "headline": "Jackson, Crowder lead Grizzlies to a 119-115 win over Kings",
  "body": "MEMPHIS, Tenn. --  This time, the Memphis Grizzlies made their fourth quarter lead hold.\n\nJaren Jackson Jr. scored 18 points, Jae Crowder added 17 points and 10 rebounds, and the Grizzlies beat the Sacramento Kings 119-115 Saturday night.\n\nMemphis lost road games to Oklahoma City and Cleveland earlier this week, squandering fourth quarter leads in both defeats. The Grizzlies were able to hold on despite the Kings slimming the advantage to 118-115 in the closing seconds.\n\nSeven Grizzlies reached double figures, including 16 from Dillon Brooks. Grayson Allen and Ja Morant had 13 each as Memphis snapped a two-game losing streak.\n\n\"Hopefully we're learning, trying to find out how to close games. That's a big part of the NBA being able to close games,\" Crowder said. \"We withstood some runs and responded. The other two nights, other teams went on runs, and we sort of didn't answer the bell.\"\n\nHarrison Barnes led the Kings with 25 points. De'Aaron Fox, easing back after missing 17 games with a left ankle sprain, scored 22, and Richaun Holmes had 18 points and 12 rebounds.\n\nSacramento dominated the paint 60-40 against a Memphis team that is among the league leaders in that category. Sacramento's 18 offensive rebounds contributed to a 31-5 advantage in second-chance points.\n\n\"We should've won that game,\" Kings coach Luke Walton said. \"I was proud of the guys continuing to fight being down in the fourth quarter.\"\n\nBarnes' 13 points in the third quarter helped Sacramento put a dent in a Memphis lead that reached 16 in the first half. The Grizzlies built the lead back to double-digits and led by at least eight until the final 49 seconds when Fox scored five straight points. Barnes hit three free throws and Trevor Ariza's 3-pointer with five seconds left pulled the Kings to 118-115.\n\n\"Everybody is upset when you lose,\" said Kings guard Buddy Hield, who continued to struggle with his shooting. \"I don't know who is not upset. If you're not upset, you shouldn't be playing on this team.\"\n\nTIP-INS\n\nKings: G Bogdan Bogdanovic missed his second straight game because of right ankle soreness. ... Fox was back in the starting lineup after coming off the bench the past two games following the ankle injury. ... Marvin Bagley III had 11 points and 11 rebounds. ... Hield, who was 3 of 15 from the floor and 1 of 9 from 3-point range in Friday's loss at Indiana, was 3 of 18 overall and 2 of 11 from outside the arc against Memphis. It was only Hield's fourth game this season not reaching double figures, half of those coming the last two games.\n\nGrizzlies: C Jonas Valanciunas was out with right foot soreness. Solomon Hill started his second game of the season in Valanciunas' absence. ... Had 15 3-pointers, marking a franchise-best nine straight games where Memphis has made at least 10 3-pointers. ... Morant, who matched his season-low with eight points at Cleveland on Friday night, was 4 of 13 from the floor. ... Crowder had his fifth double-double of the season.\n\nNO WORRIES ON BUDDY\n\nHield is 9 of 33 on 3-pointers over the past four games. Despite the misfires, Kings coach Luke Walton said before the game he's not worried about the guard's recent shooting woes.\n\n\"Buddy's a great shooter. He's a hard worker,\" Walton said. \"People are going to make and miss shots in this league. ... We're not concerned with Buddy. He'll get it going more nights than not.\"\n\nUP NEXT\n\nKings: Host the Houston Rockets on Monday night.\n\nGrizzlies: Entertain the San Antonio Spurs on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995733.175082
}