{
  "game_id": "0021900241",
  "espn_id": "401160883",
  "date": "Nov 25, 2019",
  "matchup": "DET vs. ORL",
  "headline": "Pistons shut down Magic after halftime in 103-88 win",
  "body": "DETROIT --  Dwane Casey had an easy time identifying when and how his team won this game.\n\n\"I think our defense was exceptional in the second half,\" the Detroit coach said.\n\nCasey shouldn't get much argument from the Orlando Magic about that. They were held to 15 points in the third quarter and 33 in the second half of Detroit's 103-88 win Monday night. Luke Kennard scored 20 points and Blake Griffin added 17 to lead the Pistons past the short-handed Magic.\n\nOrlando was playing a second straight game without Nikola Vucevic, out with a right ankle sprain. The Magic are now 0-7 on the road this season.\n\n\"They're good defensively and they were aggressive with their coverages,\" Orlando coach Steve Clifford said. \"I thought in the first half we did a good job; the second half we just got away from it. ... The ball has got to move.\"\n\nDetroit went on an 11-0 run near the end of the third and led 78-70 at the start of the fourth. Orlando never really threatened after that. The Magic shot just 39% from the field and 8 of 25 from 3-point range.\n\nThe Pistons entered the day shooting 39.2% from beyond the arc, the second-best mark in the NBA. They were a bit below that clip Monday, going 14 of 38, but Langston Galloway and Svi Mykhailiuk made four 3-pointers each, and Kennard added three.\n\n\"When people play basketball and people play games, they get more adjusted to the game,\" Mykhailiuk said. \"When coach trusts you, it relaxes you and gives you more freedom on the court.\"\n\nTerrence Ross led Orlando with 19 points and Evan Fournier added 17. Andre Drummond had seven points and 18 rebounds for Detroit.\n\nThe Magic led by 11 early in the second quarter, but Detroit quickly erased that deficit, and Orlando led 55-53 at halftime.\n\n\"If we play the right way and lose it's one thing, but that's not what we did,\" Clifford said. \"In this league, you pay the price.\"\n\nOVERTURNED\n\nDetroit won a coach's challenge in the fourth quarter when a foul on Mykhailiuk was changed to an offensive foul on Markelle Fultz.\n\nCasey said he thinks the spirit of the replay system is good, although there might be room for some tweaks.\n\n\"It's tough,\" Casey said. \"When you only have one, and it takes a timeout, and there's so many plays you want to use it on.\"\n\nINJURIES\n\nThe Pistons were without point guard Reggie Jackson (lumbar stress reaction), as well as Tony Snell (left hip strain).\n\nIn addition to Vucevic, Orlando was missing forward Aaron Gordon (right ankle contusion) and guard Michael Carter-Williams (left hip irritation).\n\n\"We have taken a no-excuse approach because there really is no excuse,\" Orlando's Jonathan Isaac said. \"We have to win these games.\"\n\nTIP-INS\n\nMagic: Isaac had 10 points, six rebounds and four blocks. ... Orlando shot 5 of 21 from the field in the third quarter and 6 of 18 in the fourth.\n\nPistons: Mykhailiuk equaled a career high with 12 points. ... Galloway scored 12 points of his own for his 13th straight game in double figures.\n\nUP NEXT\n\nMagic: Visit the Cleveland Cavaliers on Wednesday night.\n\nPistons: Visit the Charlotte Hornets on Wednesday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996298.592032
}