{
  "game_id": "0022400652",
  "espn_id": "401705218",
  "date": "Jan 27, 2025",
  "matchup": "ORL @ MIA",
  "headline": "Heat, playing without Butler, get 30 from Herro and top Magic 125-119 in double overtime",
  "body": "MIAMI -- — Tyler Herro scored 30 points, Bam Adebayo finished with 26 and the Miami Heat erased a 14-point deficit in the fourth quarter before beating the Orlando Magic 125-119 in double overtime on Monday night.\n\n\r\n              Adebayo had 10 rebounds and nine assists, Herro had 12 assists and eight rebounds, and Kel’el Ware finished with 19 points and 10 rebounds for Miami — which played hours after Jimmy Butler was suspended yet again.\n\n\r\n              Miami improved to 10-10 without Butler this season. The Heat are 13-12 when he plays.\n\n\r\n              Franz Wagner had 29 points for Orlando, which got 17 apiece from Paolo Banchero and Tristan da Silva. The Magic were outscored 9-3 in the second overtime.\n\n\r\n              Orlando is 18-2 in games it leads by double figures in the fourth quarter this season. Both losses were to Miami.\n\n\r\n              Takeaways\r\n              Magic: Orlando got Goga Bitadze back after he spent six games — five of them losses — in the concussion protocol. The Magic are 22-15 when Bitadze plays this season, 2-9 when he doesn't. Bitadze was plus-21 in 22 minutes on Monday. “He's doing whatever's necessary to help this team,” coach Jamahl Mosley said.\n\n\r\n              Heat: Miami split the season series with Orlando 2-2. The Heat have either won or split the season series with Orlando 27 times in 36 seasons.\n\n\r\n              Key moment\r\n              The Heat were down 12 with 6:27 left in the fourth, then went on a 15-3 run to start the push toward overtime.\n\n\r\n              Key stat\r\n              The last time Miami trailed by 14 or more in a fourth quarter and won a regular-season game was Feb. 17, 2022, at Charlotte. (It has happened twice in playoff games since, both against Milwaukee in 2023.)\n\n\r\n              Up next\r\n              The Magic start a five-game West Coast swing Thursday at Portland. The Heat host Cleveland on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997545.611893
}