{
  "game_id": "0022000921",
  "espn_id": "401307725",
  "date": "Apr 26, 2021",
  "matchup": "TOR vs. CLE",
  "headline": "Siakam, Raptors beat Cavaliers 112-96",
  "body": "TAMPA, Fla. -- — Pascal Siakam scored 25 points, rookie Malachi Flynn added 18 and the Toronto Raptors pulled away in the second half for a 112-96 win over the depleted Cleveland Cavaliers on Monday night.\n\n\r\n                    OG Anunoby finished with 20 points and Kyle Lowry contributed nine points and 10 assists for the Raptors, who have won five of six.\n\n\r\n                    “I think we played with great pace defensive pressure,” said Lowry. “We held a team under 100 points, which is rare in today's NBA.”\n\n\r\n                    Isaac Okoro led Cleveland with 20 points. Jared Allen had 15 points and Darius Garland had 13 points and 10 assists for the Cavaliers, who have lost five of six.\n\n\r\n                    The Cavaliers played with the same starting lineup they used in Sunday night's 119-110 loss at Washington, but without the first four players who came off their bench in that game.\n\n\r\n                    Larry Nance Jr. fractured his right thumb in the fourth quarter Sunday night and is expected to be out for several games. Matthew Dellavedova had a strained neck, and Lamar Stevens and Isaiah Hartenstein came out of the Washington game with concussion symptoms.\n\n\r\n                    The broken thumb is the latest medical setback for Nance, who missed seven games recently with an undisclosed illness and more than a month with a broken left hand.\n\n\r\n                    The injuries left the Cavaliers with nine players.\n\n\r\n                    “They gave us what they had tonight,” coach J.B. Bickerstaff said of what was left of the Cavaliers. “Couldn't ask for anything more.” \n\n\r\n                    All five Toronto starters had a dunk or a layup on a 14-0 run that put the Raptors up 22-12, and they led 49-48 after a first half in which they missed 14 of 15 3-point shots.\n\n\r\n                    When Siakam was whistled for his fourth personal foul midway through the third quarter, the Raptors led 62-59 despite shooting 2 for 21 from behind the arc.\n\n\r\n                    Siakam, Lowrey, Malachi Flynn, Stanley Johnson and Yuta Watanabe then hit 3-pointers to help the Raptors expand their lead to 17, on a short bank shot by Siakam, with 3:47 remaining.\n\n\r\n                    Lowry gave credit to Flynn, who had five rebounds, five assists and two steals in 24 minutes.\n\n\r\n                    “When you've got multiple ball handlers, it makes it a lot easier for everyone else,” Lowry said. “He's just taking advantage of the opportunity given, and it's taking the pressure off me and Freddie (VanVleet) to have another ballhandler on the floor.” \n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: A total of seven Cavs were listed as “out” for the game. ... After shooting better than 50% in three straight games, the Cavs made four of their first five shots but finished the first quarter 8 for 21. ... Garland's streak of of six straight 20-plus scoring games ended. \n\n\r\n                    Raptors: F Chris Boucher, who sprained the MCL in his left knee last Wednesday, will miss several more games. ... F Gary Trent Jr. sat with a leg injury, and G Paul Watson missed a third game with left knee tendonitis. ... Toronto's 43 field goals included eight dunks and 14 layups. The Raptors shot 54% overall.\n\n\r\n                    TANTRUM COSTLY FOR CAVS\n\n\r\n                    The game got away from the Cavaliers late in the third quarter when Flynn nailed a 3-pointer after a careless turnover by Kevin Love on an inbounds pass.\n\n\r\n                    “He apologized to his teammates for it and we moved on,” said Bickerstaff, who did not back away from a suggestion that Love was having a tantrum. “He had a lapse in judgment,” Bickerstaff said..\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Play at home against Orlando on Wednesday night.\n\n\r\n                    Raptors: Play Brooklyn in Tampa on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764997269.4006789
}