{
  "game_id": "0022300315",
  "espn_id": "401584943",
  "date": "Dec 13, 2023",
  "matchup": "MIL vs. IND",
  "headline": "Giannis Antetokounmpo scores franchise-record 64 points, Bucks beat Pacers 140-126",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored a franchise-record 64 points to help the Milwaukee Bucks outscore the Indiana Pacers 140-126 on Wednesday night, with Antetokounmpo then at the center of a post-game confrontation over the game ball.\n\n\r\n              Antetokounmpo broke the team record of 57 set by Michael Redd in 2006 in a 113-111 loss to the Utah Jazz. Antetokounmpo’s previous career high was 55 in a 123-113 victory over Washington in January 2023. He had 54 at Indiana on Nov. 9.\n\n\r\n              “He’s an unstoppable player. You can’t guard him one-on-one. You’ve got some really good guys surrounding him, but at the end of the day, it’s all him,” Bucks coach Adrian Griffin said. “His talent. His ability. His will. He has an incredible will to win, and he’ll do whatever it takes to win. I’m just coaching the game and one of the coaches told me, ‘Yeah, Giannis has 50. I had no idea.’ But wow, what a great performance.”\n\n\r\n              Antetokounmpo was 20 of 28 from the field, made 24 of 32 free throws and had 14 rebounds.\n\n\r\n              He became the first player in NBA history to make at least 20 field goals and 20 free throws in a game while shooting at least 70% on each. It’s also the most points with fewer than 30 field goal attempts in a game in NBA history.\n\n\r\n              “It’s a great feeling. It’s a great feeling, being able to do it,” Antetokounmpo said. “As much as I can, I try to play basketball for the right reason. I try to play basketball to win, try to play basketball to help my teammates be great, but at the end of the day, being able to break this record in front of the fans here in this stadium, it’s a great feeling, too.”\n\n\r\n              The postgame was marred by an incident in the hallway near the Indiana locker room over who had the game ball, and who was entitled to it.\n\n\r\n              “What happened after the game was unfortunate,” Pacers coach Rick Carlisle said. “There was a misunderstanding about the game ball. It was Oscar Tshiebwe’s first official NBA point, so we always get the game ball. We were not thinking about Giannis’ franchise record, so we grabbed the ball.\n\n\r\n              “A couple of minutes later, several of their players ended up in our hallway, and there was a big, I don’t know what to call it — a fracas, melee, whatever. I don’t think any punches were landed, but my general manager got elbowed in the ribs by one of their players.”\n\n\r\n              There also was a brief heated exchange during the game involving several players.\n\n\r\n              Antetokounmpo was tackled by Aaron Nesmith on a play underneath with 10:10 remaining, setting off the exchange. Nesmith was called for a flagrant-1, and Nesmith and the Bucks’ Bobby Portis were assessed technical fouls.\n\n\r\n              Antetokounmpo hit both free throws, and Khris Middleton hit a jumper on the next possession to put the Bucks up 108-96. Portis was called for a second technical and ejected with 9:13 remaining, finishing with 19 points.\n\n\r\n              Antetokounmpo scored seven straight for the Bucks to push the lead to 118-100 with 6:26 left.\n\n\r\n              Damian Lillard added 21 points for the Bucks. Lillard’s second 3-pointer with 8:06 left in the third quarter was the 2,451st of his career, moving past Kyle Korver for fifth place in NBA history.\n\n\r\n              Tyrese Haliburton and Myles Turner had 22 points apiece for the Pacers, who beat the Bucks 128-119 in the semifinals of the In-Season Tournament on Thursday night.\n\n\r\n              Antetokounmpo scored on a drive to put the Bucks up 96-80 with 3:40 left in the third period, but the Pacers to 101-94 entering the final period.\n\n\r\n              Antetokounmpo had 21 points in the first half to pace the Bucks to 70-63 lead.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Washington on Friday night.\n\n\r\n              Bucks: Host Detroit on Saturday night. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996145.567897
}