{
  "game_id": "0021800703",
  "espn_id": "401071376",
  "date": "Jan 22, 2019",
  "matchup": "OKC vs. POR",
  "headline": "George nets 36, Westbrook 29 as Thunder tops Blazers 123-114",
  "body": "OKLAHOMA CITY --  A renewed focus on defense has the Oklahoma City Thunder on another winning streak.\n\nPaul George had 36 points, eight rebounds and five steals, Russell Westbrook had a triple-double of 29 points, 14 assists and 10 rebounds and the Thunder beat the Portland Trail Blazers 123-114 on Tuesday night.\n\nSteven Adams and Terrance Ferguson each added 14 points for Oklahoma City, which snapped a three-game losing streak to Portland at Chesapeake Energy Arena. After a stretch of losing five of six games, during which they gave up 154, 142 and 138 points in defeats, the Thunder have won three straight and moved back into third place in the fluid Western Conference standings.\n\nDamian Lillard had 34 points and eight assists, and C.J. McCollum scored 31 for Portland, which committed 19 turnovers -- five more than its average -- and had a three-game winning streak snapped. Jusuf Nurkic had 22 points and 15 rebounds.\n\nSixteen of those Portland turnovers came on Thunder steals. George -- who ranks second in the NBA (behind Westbrook) in steals at 2.33 per game -- led the way, and Ferguson added four steals, many of which led to points at the other end for Oklahoma City.\n\n\"That's what we lean on -- our size, our length, our ability to be able to make it tough for 48 minutes,\" Westbrook said. \"Eventually we wear out teams.\"\n\nExcept for McCollum, who went 7 of 12 from 3-point range, the Blazers struggled from behind the arc, going 10 for 36. Oklahoma City hit 11 of 23 3-point attempts.\n\n\"They've been shooting the three well in recent games,\" Portland coach Terry Stotts said of the Thunder. \"That made the difference, but I thought the biggest difference in the game was our turnovers that they created. The two quarters that we lost, we had six turnovers in each of those quarters and that just fueled their runs.\"\n\nMcCollum's seventh 3-pointer, with 5:07 left, pulled Portland within 109-106, but George keyed a game-sealing run by the Thunder, hitting four free throws and then stealing a pass intended for Nurkic and going for a layup to extend Oklahoma City's lead to 117-108 with 2:17 left. Westbrook capped the win with a pair of ferocious dunks in the final 1:24.\n\nOklahoma City led almost all the way -- trailing for less than 30 seconds -- but Portland never let the Thunder become comfortable. Through three quarters, only once did the Thunder push their lead to double digits, and that was 11 points late in the second quarter.\n\nThe Thunder hit 8 of 14 3-point attempts in the first two periods on the way to a 62-55 halftime lead. George was 3 of 5 from long range and had 20 points. McCollum hit five of his 3-pointers in the third quarter, twice pulling Portland within a point, but the Thunder held their lead and were ahead entering the fourth quarter.\n\nDennis Schroder keyed an 8-0 run by Oklahoma City early in the fourth quarter that put the Thunder ahead 101-89, but the Blazers scored seven straight to narrow the gap. Schroder scored 13 points for the Thunder.\n\nROCK THE BABY\n\nWestbrook, the father of 2-month-old twin daughters, often does his \"rock the baby\" move -- moving his arms back and forth as if cradling an infant  -- after a big play. Portland's Evan Turner mimicked that move after a first-quarter basket, but Westbrook claimed not to notice.\n\n\"I didn't even see it, honestly,\" Westbrook said. \"I didn't see it. He can rock right back to Portland.\"\n\nTIP-INS:\n\nTrail Blazers: Portland had the second-fewest turnovers in the NBA (12.2) over the previous 12 games, but had 19 against the Thunder. ... McCollum's seven 3-pointers increased his career total to 756, passing Nicolas Batum (751) for fourth on the franchise's all-time list. ... Nurkic has scored at least 17 in seven of his last eight games against Oklahoma City.\n\nThunder: G Alex Abrines was active for a second straight game, but did not play. He missed the previous 13 games due first to illness, then personal reasons. ... Westbrook's triple-double was his 14th this season and the 118th of his career. . The Thunder's bench produced only 19 points.\n\nUP NEXT:\n\nBlazers: Visit Phoenix on Thursday.\n\nThunder: Host New Orleans on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994580.355511
}