{
  "game_id": "0021800657",
  "espn_id": "401071333",
  "date": "Jan 16, 2019",
  "matchup": "DET vs. ORL",
  "headline": "Griffin scores 30, leads Pistons past Magic 120-115 in OT",
  "body": "DETROIT --  Andre Drummond's bad habits bother Detroit Pistons coach Dwane Casey.\n\nLuckily for Casey and the Pistons, Drummond's good moments can win basketball games.\n\nDrummond put up his version of a triple-double on Wednesday and the Pistons notched a crucial 120-115 overtime victory over the Orlando Magic.\n\nDrummond had 14 points, 11 offensive rebounds and 11 defensive rebounds to record his 11th career \"Moses Malone triple-double.\" Only Malone (24) and Dennis Rodman (17) have recorded more since the ABA-NBA merger.\n\n\"Andre's the best rebounder in the league -- it isn't even close -- and that's a huge asset,\" Casey said.\n\nDrummond, though, doesn't impress his coach as a point guard, especially when he tries to go coast-to-coast after a rebound.\n\n\"Andre and I are going to have a heart-to-heart talk about his sashays down the court,\" he said. \"Those aren't winning plays, because teams aren't going to let a center dribble down the floor and score. It might happen once a month.\"\n\nDrummond finished with 11 of the game's 22 rebounds. Detroit ended up with a 14-8 edge on the boards.\n\n\"That was the game,\" Magic coach Steve Clifford said. \"In the last 42 seconds, we were up two and got two stops, but they got three offensive rebounds and tie the game.\"\n\nBlake Griffin scored 30 points for the Pistons, who won for the third time in 11 games and moved a half-game ahead of Orlando in the Eastern Conference standings. Detroit had six players with at least 13 points.\n\n\"I thought we were sluggish, which is understandable coming off a West Coast trip, but we dug down defensively,\" Griffin said. \"In overtime, we were getting stops and forcing them into shots that we wanted. That was great.\"\n\nNikola Vucevic and Terrence Ross each scored 24 points for Orlando, which had won two in a row after a four-game losing streak.\n\n\"We had to find a way to win that game,\" Ross said. \"We didn't play a consistent defensive game. We weren't physical enough in the third quarter.\"\n\nDetroit led by as many as 11 in the fourth quarter, but Vucevic helped pull the Magic within 105-104 with 3:23 to play and tied it at 107 with 2:14 to go. D.J. Augustin followed with a layup to put Orlando ahead, and the teams went scoreless on their next possessions.\n\nDrummond's tip-in tied the game at 109-all, and Vucevic missed a jumper with 20.4 seconds left.\n\n\"It was a good play, but no one makes every shot,\" Clifford said. \"We scored 109 points in regulation, and if we defend the way we are capable, we win the game. This wasn't about making shots.\"\n\nGriffin ran down the clock, but missed a jumper at the end of regulation.\n\nDetroit scored the first four points of overtime, but Ross answered with a pair of 3-pointers.\n\n\"I raised T from a pup, and I'm thrilled that he's become one of the best shooters in the game,\" said Casey, who coached Ross in Toronto during his first five seasons. \"I just wish he wouldn't do it against us.\"\n\nBoth teams struggled to score after that, and the Magic called a timeout with 42.5 seconds left, trailing 117-115.\n\nVucevic missed a hook, and Griffin hit a layup in traffic to give Detroit a four-point lead.\n\nThe Magic shot 67.5 percent from the floor in the first half, but the Pistons were able to hold the margin to 63-58 with a 6-1 rebounding advantage on the offensive glass and nine free throws to Orlando's three. Vucevic and Ross had 15 each for the Magic, while Griffin led Detroit with 12.\n\nIsh Smith's 3-pointer gave the Pistons a 75-74 lead late in the third quarter, and Griffin's nine points in the period helped Detroit take a 90-84 lead into the fourth.\n\nThe Pistons reserves, supplemented by Drummond, started the final period with a 7-2 run to expand the margin to 11 with 9:45 to play.\n\nTIP INS\n\nMagic: Orlando has lost 20 of its last 26 games in Detroit. They trail this season's series 2-1, with the final game on March 28 at Little Caesars Arena.\n\nPistons: Detroit, which leads the league in offensive-rebound margin, had 10 or more for the 30th time this season. . Griffin came into the game averaging 20.2 points in 13 career games against Orlando, his lowest average against any team other than 18.7 against the Memphis Grizzlies.\n\nDRUMMOND'S PERSONAL STAT\n\nDrummond's 11 triple-doubles of points, offensive rebounds and defensive rebounds is four more than any active player (Tyson Chandler 7) and more than twice than the players in third (Hassan Whiteside, Dwight Howard 4). This season, he has three of the league's five with Whiteside and Clint Capela each having one.\n\nUP NEXT\n\nMagic: Host the Brooklyn Nets on Friday.\n\nPistons: Host the Miami Heat on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994690.47366
}