{
  "game_id": "0022300507",
  "espn_id": "401585135",
  "date": "Jan 08, 2024",
  "matchup": "IND vs. BOS",
  "headline": "Pacers rally past Celtics 133-131 after Tyrese Haliburton injures hamstring",
  "body": "INDIANAPOLIS -- — Bennedict Mathurin scored 26 points, including the deciding free throws with 0.6 seconds remaining, and the Indiana Pacers rallied after All-Star point guard Tyrese Haliburton suffered a hamstring injury to beat the Boston Celtics 133-131 on Monday night.\n\n\r\n              Haliburton strained his left hamstring when he slipped and did the splits on a drive in the second quarter. He was carried to the locker room by two teammates. An MRI was scheduled for Tuesday.\n\n\r\n              “That was a very deflating moment,” Pacers coach Rick Carlisle said. “(But) this was an important game. Every game that we play has the ability to be a season-defining game.”\n\n\r\n              Mathurin was fouled by Kristaps Porzingis on a 3-pointer just before time expired. The call was reviewed and upheld. Mathurin sank the first two free throws and missed the third on purpose. \n\n\r\n              “I was excited,” Mathurin said. “It was a pretty good thing to be a part of.”\n\n\r\n              He finished 8 of 15 from the field, including five 3-pointers, as Indiana split a two-game home series against the top team in the Eastern Conference.\n\n\r\n              “Really amazing effort from our team,” Carlisle said. “A lot of emotions in this game, for a lot of reasons: you're playing the best team in basketball and Tyrese's injury situation.”\n\n\r\n              All-Star Jaylen Brown scored a season-high 40 points on 17-of-26 shooting for the Celtics, who were without leading scorer Jayson Tatum. The four-time All-Star sat out to manage a left ankle sprain. Tatum averages 27.5 points, and he had 38 points, 14 rebounds and six assists in Saturday’s 118-101 win over the Pacers.\n\n\r\n              “He stepped up and didn't force anything,” Celtics coach Joe Mazzulla said of Brown. “He let the game come to him. He scored in many different ways.”\n\n\r\n              Jrue Holiday scored 21 points and Porzingis had 19 for Boston.\n\n\r\n              “We all played a relatively decent offensive game,” Mazzulla said, “but we all have to be better on defense.”\n\n\r\n              The Pacers trailed by nine points at halftime but finished with seven double-figure scorers. Aaron Nesmith scored 17 points, Myles Turner 16 and Buddy Hield 15.\n\n\r\n              Brown thought he was headed to the line for potential game-deciding free throws after officials whistled Hield for a foul with the game tied at 131 and 3.2 seconds remaining. But a review overturned the call and awarded possession to the Pacers.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Minnesota on Wednesday.\n\n\r\n              Pacers: Host Washington on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996198.246263
}