{
  "game_id": "0021900227",
  "espn_id": "401160869",
  "date": "Nov 23, 2019",
  "matchup": "IND vs. ORL",
  "headline": "Sabonis, Holiday help Pacers edge Magic 111-106",
  "body": "INDIANAPOLIS --  With the game on the line, Indiana’s Holiday brothers leaned on the chemistry they’ve been building since childhood.\n\nJustin Holiday could have taken a contested shot to break a 106-all tie between the Pacers and the Orlando Magic, but instead he dished to younger brother Aaron, who despite missing his previous 3-pointers didn’t hesitate to drill the go-ahead shot with 8.7 seconds remaining as Indiana beat Orlando 111-106 on Saturday night.\n\nAaron said he hand his brother have practiced those scenarios for years.\n\n“For sure, that’s what we dreamed about when we were younger,” Aaron said. “I’m obviously a confident guy. Hitting the 3 at the end, I was going to shoot it no matter what. Even though I missed the last few, one has got to go in for me.”\n\nJustin drove to draw Aaron’s defender away before dishing to his brother.\n\n“The missed shots don’t matter at that point,” Justin said. “It was the right basketball play. I passed it to him and thought, ‘Hes going to make this.’”\n\nDomantas Sabonis led the Pacers with 25 points, including 20 in the first three quarters, but the Magic led by two points entering the fourth.\n\nAfter Aaron’s clutch shot, Justin sealed the outcome when he recognized the Magic’s formation from the last time these teams played 13 days ago and intercepted the inbounds pass. He was fouled and hit two free throws for the final points.\n\n“I was sitting there, waiting for it,” Justin said.\n\nHis brother expected more from that play.\n\n“He did a great job on defense for us at the end of the game,” Aaron said. “He should have went in and dunked the ball, but we’ll talk about that later.”\n\nThe Pacers have won six of seven at home and 11 of their past 13 against the Magic, who are winless in six road games.\n\nEvan Fournier scored 26 points and Jonathan Isaac had 25 for the Magic.\n\n“We played well enough to win,” Isaac said. “It just sucks the way the game ended.”\n\nThe Magic lamented defensive breakdowns as the Pacers shot a season-best 54.4% (43 of 79), including 55.6% (10 of 18) in the final quarter.\n\n“You have to make the coverages and schemes work,” Magic coach Steve Clifford said. “That’s our whole mentality right there. If we get back to the point where permanent players decide they want to get into the ball and do what they’re supposed to do, then we’ll have a better chance.”\n\nThe Pacers had six players score in double figures, including Aaron with 13 points and Justin with 12.\n\nTIP-INS\n\nMagic: The visitors didn’t look like the NBA’s worst 3-point shooting team, making 13 of 31 (41.9%) from beyond the arc. The last time these teams met, a 109-102 Pacers win on Nov. 10, the Magic hit a season-high 15 3-pointers. ... Orlando is averaging 13.1 turnovers per game, the second-best average in the league.\n\nPacers: All-Star guard Victor Oladipo scrimmaged on Thursday, another positive step in his lengthy rehabilitation from surgery to repair a torn ACL that ended last season. No timetable has been announced for his return, but he’s also worked out twice recently with the Fort Wayne Mad Ants of the G League. ... Point guard Malcolm Brogdon, sidelined for a third consecutive game with a sore back, joined the pregame shoot-around.\n\nMORE ON THE LINE\n\nThe previous time these teams met, the Magic and Pacers made NBA history for fewest free throws combined at 11. They attempted 25 on Saturday.\n\nUP NEXT\n\nMagic: At Detroit on Monday.\n\nPacers: Host Memphis on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995875.2412958
}