{
  "game_id": "0021600361",
  "espn_id": "400899803",
  "date": "Dec 12, 2016",
  "matchup": "CHA @ IND",
  "headline": "George, Turner score 22 to lead Pacers over Hornets, 110-94",
  "body": "INDIANAPOLIS --  Paul George and Myles Turner were determined to end Indiana's recent woes against Charlotte.\n\nGeorge and Turner scored 22 points each to lead the Pacers to a 110-94 win over the Hornets on Monday night,  snapping Indiana's four-game losing streak against Charlotte in the regular season.\n\n\"We knew this team has kicked us in the past, four or five times, so we wanted to come out here and send a message,\" Turner said. \"We were so connected in the first quarter on defense and it just carried over to the rest of the game.\"\n\nJeff Teague had 16 points, 11 assists and five rebounds, and Rodney Stuckey added 14 points for the Pacers, who have won two straight since returning home from a five-game road trip.\n\nMarco Belinelli scored 14 points for the Hornets, Marvin Williams and Nicolas Batum each had 13 and Kemba Walker added 12.\n\nC.J. Miles made the go ahead 3-pointer with 5.6 seconds remaining in the third quarter to start an 11-1 run by the Pacers. It gave Indiana a 76-73 lead and Stuckey's two free throws with 8:56 to play put the Pacers ahead 84-74.\n\nThe Hornets had a short spurt in the fourth as Frank Kaminsky made a 3-pointer and Jeremy Lamb scored on a fast break layup to make it 87-82 with 7:03 left. But Turner's 3 with 1:12 put the Pacers ahead 103-92 to seal it for Indiana.\n\nAt the start of the game, George appeared to pick up from where he left off on Saturday when he scored 37 points in the Pacers' 118-111 win over Portland. He started the game with a 3-pointer and a flashy, turnaround jumper, but never went off to help Indiana pull away until the fourth quarter when he scored three times, including a basket to give the Pacers a nine-point lead.\n\nMostly it was a game of runs.\n\nTurner and Glenn Robinson III made back-to-back 3s in the first quarter to help Indiana get off to a good start. Later Turner hit another 3-pointer and Thaddeus Young scored on a layup to put the Pacers ahead 20-10 with 3:20 to go in the first before the Hornets went on a 9-0 run to get back within a point.\n\n\"When you're down, you have to stick to the game plan and keep playing,\" Batum said. \"You can't give up. We did it a couple of times. We almost got the lead and when we get the lead we just have to keep it.\"\n\nThe Pacers went on another lead in the second quarter and the Hornets closed out the half on an 8-1 run to trail 45-43 at halftime.\n\nTIP-INS\n\nHornets: Charlotte shot just 30.8 percent in the first half and trailed by only two points, 45-43. ... The Hornets finished shooting 33.3 percent from the field.\n\nPacers: George and Turner each had five rebounds. . Stuckey left the game in the fourth quarter with a left knee contusion . G Monta Ellis was out with a sore groin.\n\nA HOMECOMING OF SORTS\n\nHornets center Cody Zeller, who attended Indiana University and is a native of the Hoosier state, received a warm welcome from fans during pregame introductions. The welcome wasn't quite the same for Roy Hibbert when he checked into the game late in the first quarter. Hibbert, who played for the Pacers for seven seasons from 2008-15, was met with scattered boos when he entered the lineup. The jeers were noticeably louder when he first got the ball, though his hook-shot in the middle of a 9-0 run in the first quarter quieted fans.\n\nFIRST QUARTER SPARK\n\nHibbert actually created a bit of a spark off the bench in the first quarter. He set a screen twice for Belinelli that cleared him for open baskets, including one he was fouled on before he completed the and-one. Then Hibbert made back-to-back shots, including one to get the Hornets within a point.\n\nUP NEXT\n\nHornets: At Washington on Wednesday night for their third game of a five-game road trip.\n\nPacers: At Miami on Wednesday night, where they have lost three straight regular season games.",
  "source": "espn_api",
  "crawled_at": 1764995524.281824
}