{
  "game_id": "0022400205",
  "espn_id": "401704771",
  "date": "Nov 10, 2024",
  "matchup": "CHA @ PHI",
  "headline": "Jared McCain and Guerschon Yabusele lead the 76ers to 107-105 OT win over the Hornets",
  "body": "PHILADELPHIA -- — Jared McCain had a career-high 27 points as the Philadelphia 76ers snapped a five-game losing streak with a 107-105 overtime win over the Charlotte Hornets on Sunday night.\n\n\r\n              The Sixers first-round draft pick out of Duke had 23 points in the second half and overtime was 9 for 15 from the floor.\n\n\r\n              Guerschon Yabusele finished with his career high of 20 points for Philadelphia (2-7), which has yet to win a game in regulation. Paul George added 15 points and nine assists, but did not play any of the overtime period after tallying 33 minutes in his fourth game back from a bone bruise.\n\n\r\n              Lamelo Ball finished with 38 points in the losing effort for Charlotte (4-6). Ball hit a fadeaway 3-pointer with eight seconds left in the 4th quarter to send the game to overtime. Brandon Miller had 22 points while Grant Williams added 17.\n\n\r\n              Takeaways\r\n              Hornets: The Hornets shot 14 of 54 from the 3-point arc and had several sloppy possessions, often forced to take long shots with the shot clock running out.\n\n\r\n              76ers: Without Joel Embiid (suspension, knee injury) and Tyrese Maxey (hamstring strain), Philadelphia’s offensive burden fell on McCain and Yabusele, who are promising but still young in their NBA careers.\n\n\r\n              Key moment\r\n              The Sixers only had two field goals in the overtime period, but shot 6 of 8 from the foul line to nail the game down.\n\n\r\n              Key stat\r\n              Philadelphia missed 14 of its 15 3-point attempts in the first half, yet still lead by one. They hit five of their first seven from beyond the arc in the third quarter to extend their lead to 10 late in the period.\n\n\r\n              Up next\r\n              Both teams begin play in the NBA Cup round-robin on Tuesday, with the Hornets heading to Orlando. The 76ers host the Knicks in a rematch of last year’s first-round playoff matchup.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997467.2737222
}