{
  "game_id": "0021500134",
  "espn_id": "400828021",
  "date": "Nov 13, 2015",
  "matchup": "OKC vs. PHI",
  "headline": "Westbrook's triple-double leads Thunder past 76ers 102-85",
  "body": "OKLAHOMA CITY -- Brett Brown saw it coming,\nPhiladelphia's coach knew he wasn't much better off with Kevin Durant injured for the Thunder because that just meant more Russell Westbrook.\n\"You realize what Russ is going to do,\" Brown said before the game about last season's scoring champion. \"You assume that he's going to really try to stamp his imprint on the game a little more.\"\nWestbrook did just that. He had his second straight triple-double, and Oklahoma City beat the 76ers 102-85 on Friday night. With Durant nursing his strained left hamstring, Westbrook finished with 21 points, a career-high 17 rebounds and 11 assists for the 21st triple-double of his career. It was his third in his past four games against Philadelphia.\nWestbrook emphasized the rebounding.\n\n\"I learned over the summertime that whenever I rebound and start the break, it's better for our team,\" he said. \"It gives opposing teams problems when I'm able to do that, and pushing the break gives us easy points.\"\nDion Waiters scored 14 points and Enes Kanter had 13 for the Thunder, who won their third straight.\nOklahoma City outrebounded Philadelphia 55-43 and held the 76ers to 34.9 percent shooting. It was just the second time this season the Thunder held an opponent under 100 points.\nChristian Wood scored 15 points and Nerlens Noel had 13 points and 11 rebounds for the 76ers. It was Philadelphia's 19th straight loss dating to last season, matching the third-longest streak in franchise history.\nPhiladelphia's Jahlil Okafor, who had led all rookies with 20.6 points per game, finished with six on 3-for-18 shooting. The Thunder's focus was making sure Okafor didn't catch the ball where he wanted to.\n\"I think he's obviously a real good player, but I think we did a good job, and we were able to focus on just get him out of the block,\" Kanter said. \"We fought him really well, and he just got frustrated.\"\nA fast-break slam by Andre Roberson put the Thunder ahead 53-47 early in the third quarter. The 76ers rallied, and Hollis Thompson's corner 3-pointer cut Oklahoma City's lead to 62-61.\nWestbrook's steal and slam with just under two minutes left in the third pushed Oklahoma City ahead 66-61 and bumped his point total into double figures. He got the triple-double early in the fourth quarter on an assist to Waiters for a 3-pointer that gave the Thunder a 79-65 lead.\nGOING COASTAL:\nIn the second quarter, Kanter, a 6-foot-11 center, grabbed a defensive rebound, then went coast-to-coast for a slam.\n\"That was nice,\" Westbrook said, laughing. \"That was E. That was vintage Enes right there. He did a good job. That's the first time I've seen him dunk in a while.\"\nSTAT LINES\nWestbrook's 17 rebounds were the most for any point guard since Portland's Damian Lillard had 18 on March 4, 2015, against the Los Angeles Clippers.\nSTAT LINES II\nWood's 15 points were a season high for the rookie from UNLV. He made 5 of 7 shots and grabbed eight rebounds in 18:47.\nQUOTABLE\nBrown, on his team's fighting spirit: \"More nights than not, we're not going to go away.\"\nTIP-INS:\n76ers: Philadelphia shot 53 percent in the first quarter to lead 24-18. ... Shot just 24 percent in the second period to fall behind 48-43. ... Committed 18 turnovers. ... Noel missed the previous two games with soreness in his left wrist.\nThunder: Had six offensive rebounds and eight second-chance points in the second quarter. ... Westbrook, who leads the league in assists, had at least 10 for the sixth straight game. ... Improved to 28-28 the past two seasons without Durant.\nUP NEXT:\n76ers play at San Antonio on Saturday.\nThunder host Boston on Sunday.\n---\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .",
  "source": "espn_api",
  "crawled_at": 1764994219.120425
}