{
  "game_id": "0021500666",
  "espn_id": "400828553",
  "date": "Jan 24, 2016",
  "matchup": "TOR vs. LAC",
  "headline": "Raptors down Clippers for eighth straight win, 112-94",
  "body": "TORONTO --  The Toronto Raptors used a stellar game from its reserves to cruise past the Los Angeles Clippers for their season-high eighth straight win.\n\nAll-Star guard Kyle Lowry scored 21 points, Jonas Valanciunas had 20 and DeMar DeRozan added 18 as the Raptors beat the Los Angeles Clippers 112-94 on Sunday.\n\nToronto's backups outscored their Clippers counterparts 51-29 while shooting 57.6 percent and finishing with their highest total of the season. Terrence Ross led the reserves with 18 points on 5-for-7 shooting on 3-pointers for his fourth straight game with at least 10 points off the bench.\n\nCory Joseph had 12 points, and Patrick Patterson and Bismack Biyombo added 10 each.\n\n\"We gave up 34 points in the first quarter and I thought that it was going to be a long night,\" Toronto coach Dwane Casey said. \"The second unit, Terrence and that group came in and changed the game; started getting into bodies and getting into players, being physical. I thought that changed the mentality.\"\n\nThe Raptors beat the Clippers for the fourth straight time, completing a second straight season sweep. It also marked the first time in franchise history the Raptors swept both Los Angeles teams in the same season, having beaten the Lakers in both meetings already.\n\nThe Raptors' winning streak is the second-longest in franchise history, one short of the team-record set in the 2001-02 season.\n\n\"We are playing team basketball, so that's how it goes,\" Ross said. \"It's halfway through the season so we all know how to play. We all know where we like the ball and the tendencies of the other players, so it's all about playing together.\"\n\nChris Paul had 23 points and 11 assists for the Clippers, and DeAndre Jordan had 15 points and 13 rebounds. JJ Redick added 17 points.\n\nLos Angeles -- which fell to 11-3 while Blake Griffin recovers from a strained left quad -- led by as many as 13 points in the first quarter, but Toronto's second unit sparked a change in the second quarter as they began the period on a 17-3 run to turn the game around and help the Raptors take a 62-49 lead  at halftime.\n\nClippers coach Doc Rivers didn't mince his words when it came to discussing the performance of his bench players.\n\n\"They were just awful,\" he said. \"I think that's it. It's rare when you lose by 18 points and your starters all have a plus. That doesn't happen very often. Our bench has been good but tonight they were awful.\"\n\nThe Clippers got within four points at one point in the third, but the Raptors then pulled away again. With Toronto leading 78-71 with 1:48 left in the quarter, Joseph made a layup and DeRozan followed with a 3 in the final minute to push the lead to 12 heading into the fourth.\n\n\"It's not about the first unit, the second unit, it's our team,\" Paul said. \"There's been nights where the starters have come out and haven't played well and the second unit has brought us back so I told us after the game that we've just got to find a way to put it all together.\"\n\nQUOTABLE\n\nRivers, who coached in Boston for nine seasons and led the Celtics to the NBA title in 2008, took note of the New England Patriots' loss to Denver in the AFC championship game earlier in the day.\n\n\"Patriots lost, bad night,\" he said.\n\nSOLID OAK\n\nCharles Oakley -- who spent 17 of his 19 seasons in the NBA with the Chicago Bulls, New York Knicks and Toronto Raptors -- sat courtside. After being given a rousing reception from the Air Canada Centre crowd, he then held court with an attentive Chris Paul and Jamal Crawford in the visitors' locker room after the game.\n\nDEEP BENCH\n\nThe last time Toronto had four second-unit players score 10-plus points each in the same game was Dec. 12, 2014, against the Indiana Pacers.\n\nSHARP SHOOTING\n\nThe Raptors have made 11 or more 3-pointers in each of the last four games, going 49 of 100 from beyond the arc. Toronto is 12-4 this year when it makes at least 10 3s.\n\nTIP-INS\n\nClippers: The newest Clipper, Jeff Ayres played five minutes and registering two points on free throws. Ayres signed a 10-day contract on Saturday. He had previously been playing for the Idaho Stampede of the NBA Development League, averaging 16.3 points, 9.5 rebounds and 2.3 assists while appearing in 23 games. The power forward has previously played in 220 NBA games with Portland, Indiana and San Antonio, winning a championship with the Spurs in 2013-14. ... Before Sunday's game, Paul had averaged 10.6 assists per game against the Raptors, the most of any player against Toronto in the franchise's history.\n\nRaptors: Toronto is now 9-7 against Western Conference teams this season, including six wins against four of the top five teams in the conference (San Antonio and Oklahoma City once each, and the Clippers and Dallas twice each).\n\nUP NEXT\n\nClippers: At Indiana on Tuesday night.\n\nRaptors: Host Washington on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994728.696884
}