{
  "game_id": "0022300210",
  "espn_id": "401584838",
  "date": "Nov 19, 2023",
  "matchup": "CLE vs. DEN",
  "headline": "Darius Garland scores 26 points as the Cavaliers beat the defending champion Nuggets 121-109",
  "body": "CLEVELAND -- — Darius Garland scored 26 points and undrafted rookie Craig Porter Jr. had a career-high 21 points, powering the Cleveland Cavaliers to a 121-109 victory over the defending NBA champion Denver Nuggets on Sunday night.\n\n\r\n              Evan Mobley had 16 points and 10 rebounds, and Jarrett Allen added 15 points for Cleveland, which built a season-high 26-point lead en route to winning its third in a row. The Cavaliers outscored Denver by 42 in the 29 minutes that Allen was on the court.\n\n\r\n              “Everyone stepped up to the plate, that’s what got us the win,” Mobley said. “J.A. played a huge part with putting pressure on the rim. Between him and me and D.G., it was just a work of art playing basketball the right way and doing things together.”\n\n\r\n              Nuggets center Nikola Jokic battled foul trouble and had 18 points, 10 rebounds and seven assists in 28 minutes. The two-time MVP had been the first player to start a season with 12 games of at least 20 points and 10 rebounds since Elgin Baylor in 1967.\n\n\r\n              “They were better than us today,” Jokic said. “I thought we played a little stagnant and needed more movement. They were getting whatever they wanted on the offensive glass and in the lane.”\n\n\r\n              Cavaliers guard Donovan Mitchell, who is averaging 29.2 points, was inactive with a right hamstring strain and sixth man Caris LeVert did not play because of a sore left knee.\n\n\r\n              Cleveland, which did not trail in the final three quarters, outrebounded the Nuggets 47-33 with power forward Mobley and center Allen both fronting and playing behind Jokic on many possessions.\n\n\r\n              “Give all credit to our bigs, they did a hell of a job guarding Jokic and made it hard for him to catch the ball,” said Garland, who also had six assists. “We were a little short-handed and our defense carried us the entire game. That was the key, I thought.”\n\n\r\n              Michael Porter Jr. scored 21 points and Christian Braun had 13 points off the bench for Denver, which dropped its fourth straight on the road after winning its first two. The Nuggets are 0-2 on a five-game trip that ends Friday in Houston.\n\n\r\n              “We're not rebounding as a team,” Jokic said. “Sometimes we don't box out and sometimes it's lucky bounces, but those are excuses.”\n\n\r\n              Garland scored 16 points and Mobley had 12 in the first half as the Cavaliers took a 66-58 advantage into the break. Allen scored their first eight points in the third, then absorbed a flagrant foul from Jokic minutes later that was his fifth personal.\n\n\r\n              “I thought Jarrett was phenomenal, taking the challenge guarding one of the best players in our game,” Cleveland coach J.B. Bickerstaff said. “He made Jokic work for everything.”\n\n\r\n              Nuggets shooting guard Jamal Murray, who missed his sixth straight game with a right hamstring strain, is traveling with the team. Coach Michael Malone has not ruled out him returning on the trip.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Visit Detroit on Monday night.\n\n\r\n              Cavaliers: Visit Philadelphia on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996739.205874
}