{
  "game_id": "0022400078",
  "espn_id": "401704644",
  "date": "Oct 25, 2024",
  "matchup": "TOR vs. PHI",
  "headline": "Barnes scores 27 as Raptors win 115-107, hand 76ers second straight loss to open season",
  "body": "TORONTO -- — Scottie Barnes scored 27 points, Jakob Poeltl had 19, and the Toronto Raptors beat Philadelphia 115-107 on Friday night to snap a seven-game losing streak against the 76ers.\n\n\r\n              It had been nearly two years since Toronto’s last win over Philadelphia, a 119-109 victory on Oct. 26, 2022.\n\n\r\n              Raptors rookie Jamison Battle scored 10 of his 12 points in the fourth quarter before fouling out. Fellow rookie Jonathan Mogbo had 12 points, five assists and nine rebounds. The Raptors outrebounded Philadelphia 54-28.\n\n\r\n              Kelly Oubre Jr. scored 28 points and Tyrese Maxey had 24, and the 76ers are still winless after losing to Milwaukee on Wednesday.\n\n\r\n              Philadelphia guard Kyle Lowry got a loud ovation when he was announced as a starter against his former team. Lowry scored 14 points.\n\n\r\n              Takeaways\r\n              76ers: For the second straight game, Philadelphia played without two-time NBA scoring champion Joel Embiid, who sat because of a sore left knee. Without him, the 76ers were outscored 56-30 on points in the paint. Embiid is also expected to miss Sunday’s game at Indiana. \n\n\r\n              Raptors: Barnes shot 8 for 11 and went 11 for 13 at the free-throw line, bouncing back after shooting 3 for 14 in Wednesday’s home loss to Cleveland.\n\n\r\n              Key moment\r\n              Battle scored nine consecutive points for Toronto in a two-minute span in the fourth as the Raptors extended their lead from 10 points to a game-high 19 with 7:29 to play. Battle made back-to-back 3-pointers, then completed a three-point play.\n\n\r\n              Key stat\r\n              Maxey shot 3 for 7 in the first quarter and went 3 for 16 the rest of the way. He finished 2 for 12 from 3-point range but shot 10 for 12 at the line.\n\n\r\n              Up next\r\n              Toronto hits the road for the first time this season when it visits Minnesota on Saturday night, and the 76ers visit the Pacers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997013.533931
}