{
  "game_id": "0022200703",
  "espn_id": "401468858",
  "date": "Jan 22, 2023",
  "matchup": "MEM @ PHX",
  "headline": "Paul returns, Suns hold on for 112-110 win over Grizzlies",
  "body": "PHOENIX -- — Chris Paul played so well in his return from a hip injury that it appeared the Phoenix Suns would have a surprise snoozer on Sunday night.\n\n\r\n              The Memphis Grizzlies had other ideas, but couldn't quite complete a monster comeback.\n\n\r\n              Paul had 22 points and 11 assists after missing the past seven games and the Suns built a 29-point lead early in the third quarter before hanging on in the final seconds for a 112-110 win over the Grizzlies.\n\n\r\n              The Suns have been hit hard by injuries over the past couple months. Now the team is starting to get its best players back, but the chemistry is a work in progress. Paul believes the adversity will help in the long run.\n\n\r\n              “We've just got to build confidence,” Paul said. “Over the past few years, that's when we've been at our best, the last four or five minutes of the game. You build that confidence by being put in those situations.\"\n\n\r\n              The Suns grabbed a 32-18 lead by the end of the first quarter and led 72-43 with about eight minutes remaining in the third quarter.\n\n\r\n              But the Grizzlies methodically cut into that advantage and Ziaire Williams hit a 79-foot heave at the third quarter buzzer to slice the Suns' lead to 87-72. \n\n\r\n              The Grizzlies continued to chip away and Desmond Bane's free throws cut the margin to 110-106 with a little less than a minute left. After a Phoenix turnover, Ja Morant was fouled and made two more free throws to cut it to 110-108 with 28.6 seconds remaining.\n\n\r\n              Phoenix forward Dario Saric hit two free throws after being fouled on the ensuing possession and the Grizzlies finally ran out of time. \n\n\r\n              “We won the game, so that's the goal,” Suns coach Monty Williams said. “If everyone could keep a 20-or 30-point lead they would, but most teams make a run. I'm proud the guys were able to withstand the moment.”\n\n\r\n              The 6-foot-10 Saric had one of his best games this season with 14 points and eight rebounds. He missed all of last season after tearing his ACL in Game 1 of the NBA Finals in 2021.\n\n\r\n              The Suns have won three straight, pushing back to .500 for the season. The Grizzlies have dropped two in a row after their 11-game winning streak was snapped by the Lakers on Friday.\n\n\r\n              Mikal Bridges led the Suns with 24 points, while Torrey Craig added a season high 20. Morant scored 27 for the Grizzlies, while Bane added 24.\n\n\r\n              “It was a tale of two halves,” Morant said. “They put their foot on the gas in the first half. We did in the second half and were able to cut the lead to two.”\n\n\r\n              The Suns were closer to full strength than they've been in a few weeks, though All-Star guard Devin Booker is still out with a groin injury. \n\n\r\n              Paul was stellar in the first half, scoring 17 points to lead the Suns to a 62-37 halftime lead. The Grizzlies shot just 15 of 50 (30%) before the break.\n\n\r\n              \"When you come back from any injury, you never know how it's going to feel until you actually play 5-on-5,” Paul said. \n\n\r\n              ANGRY BROOKS\n\n\r\n              Grizzlies guard Dillon Brooks was called for a flagrant foul in the second quarter after smacking Cam Johnson on the face. Brooks — who has a reputation as a hard-nosed player — was also called for five fouls.\n\n\r\n              Brooks said he believes the officials are keeping a close eye on him and it's a problem.\n\n\r\n              “They are picking on me every night,” Brooks said. “Can’t play my game. They are not letting me play physical every night and I don’t appreciate it.”\n\n\r\n              ROAD BLUES\n\n\r\n              The Grizzlies are one of the best teams in the NBA with a 31-15 mark that's second-best in the Western Conference. But the home-road splits are jarring. Memphis is 20-3 at home, but fell to 11-12 on the road after Sunday's loss.\n\n\r\n              “It doesn’t matter who is in the lineup, who we are playing,” Grizzlies coach Taylor Jenkins said. “We've got to be better on the road. ”\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Williams' 79-foot basket was the longest basket in franchise history.\n\n\r\n              Suns: C Deandre Ayton missed his second straight game with a non-COVID-19 illness. Guards Cameron Payne and Landry Shamet were also out.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At Sacramento on Monday.\n\n\r\n              Suns: Host the Hornets on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994197.109746
}