{
  "game_id": "0022401034",
  "espn_id": "401705600",
  "date": "Mar 23, 2025",
  "matchup": "POR vs. BOS",
  "headline": "Celtics extend their winning streak to 5 games with a 129-116 win over Trail Blazers",
  "body": "PORTLAND, Ore. -- — Jayson Tatum had 30 points, nine assists and nine rebounds and the Boston Celtics extended their winning streak to five games with a 129-116 win over the Portland Trail Blazers on Sunday.\n\n\r\n              Sam Hauser shot 8 for 10 from long distance and scored 24 points, and Derrick White added 17 points and eight assists for Boston, which was without Jaylen Brown, Jrue Holiday and Kristaps Porzingis. The Celtics (52-19) are five games behind the Cleveland Cavaliers for the top seed in the Eastern Conference with 11 games remaining.\n\n\r\n              Shaedon Sharpe scored 23 points for the Trail Blazers (32-40), who are 2 1/2 games behind Phoenix and Dallas in the race for 10th place in the Western Conference.\n\n\r\n              Tatum’s four-point play early in the third quarter gave Boston a 75-57 lead before Portland rallied. The Trail Blazers closed within seven points, but couldn't get any closer.\n\n\r\n              Takeaways\r\n              Celtics: Prichard scored a career-high 43 points against Portland on March 5. The Oregon native is enjoying a career-best season. “I’m just so happy for him,” Blazers coach Chauncey Billups said. “... It’s always a big game for him coming back home. But he’s just been outstanding.”\n\n\r\n              Blazers: Portland said this week center Robert Williams III had arthroscopic left knee surgery. It’s the latest in a string of lower-body injuries for the former Celtics big man. “We all feel so bad for Rob,” Billups said. “He worked his butt off this summer to be ready and he was. ... His voice in the locker room is really huge for us.\"\n\n\r\n              Key Moment\r\n              The Celtics closed the first half on a 21-8 run for a 13-point halftime lead. \n\n\r\n              Key Stat\r\n              Eight of the nine Celtics who played made a 3-pointer.\n\n\r\n              Up Next\r\n              Boston visits Sacramento on Monday. Portland hosts Cleveland on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998159.593599
}