{
  "game_id": "0021800930",
  "espn_id": "401071603",
  "date": "Mar 01, 2019",
  "matchup": "TOR vs. POR",
  "headline": "Leonard hits winner, Raptors beat Trail Blazers 119-117",
  "body": "TORONTO --  One day after the Toronto Raptors practiced \"game-winning shots,\" Kawhi Leonard made one against the Portland Trail Blazers.\n\nLeonard scored the go-ahead basket with three seconds remaining and the Raptors held on to beat the Trail Blazers 119-117 Friday night.\n\nToronto won it when Leonard used a screen by Kyle Lowry to drive against Portland's Damian Lillard, then rose over his smaller opponent for the decisive basket.\n\n\"We just practiced that exact scenario yesterday,\" Raptors coach Nick Nurse said. \"It was great. Kyle sets a screen and we try to get the smaller guy so (Leonard) can just vault up over him and shoot.\"\n\nToronto had run the same play moments earlier, with Lowry making a layup. When the play was called again, Leonard was more interested in keeping the ball himself.\n\n\"I was looking to get baseline,\" Leonard said. \"That first time I had seen I could be a little bit more aggressive and that's what I did the second time down.\"\n\nLeonard scored 38 points and Lowry had 19 points and 10 assists as the Raptors won for the ninth time in 10 games. Toronto is an NBA-best 11-4 in games decided by three points or fewer.\n\n\"Just staying composed and understanding that situations aren't always going to be perfect,\" Lowry said.\n\nMarc Gasol scored 19 points and Pascal Siakam had 16 for Toronto, which has won four straight home meetings with Portland and seven of the past eight overall.\n\nC.J. McCollum scored 35 points and matched a career best by making seven 3-pointers, but it wasn't enough to extend Portland's season-best five-game winning streak.\n\nLillard scored 24 points and Jake Layman had 13 as the Trail Blazers suffered their first lost after winning four straight to begin a seven-game trip.\n\n\"Obviously it's disappointing to lose but I like the way we competed,\" Portland coach Terry Stotts said.\n\nAhead 93-84 to begin the fourth, the Raptors missed nine consecutive field goal attempts, allowing Portland to close to within one, 95-94, on a 3-pointer by Lillard at 6:47.\n\nLeonard ended Toronto's drought with a layup, but the Raptors couldn't hold the lead, and Lillard tied it 103-all with another 3 at 3:27.\n\nLillard made another tying 3 with 13 seconds left, but Leonard won it with his baseline jumper.\n\n\"The ball hit every part of the rim,\" Lillard said. \"That took time off. If it had gone straight in, it almost would have been better.\"\n\nBy the time Portland inbounded the ball, there was barely enough time for a full-court heave.\n\nThe Raptors connected on 11 of 17 shots in the first quarter and led 31-24 after one.\n\nLeonard scored 10 points in the second and Toronto led 61-54 at halftime.\n\nMcCollum scored 14 points in the third but the Raptors responded with five 3-pointers, taking a 93-84 lead into the fourth.\n\n\"They had an answer every time,\" Lillard said.\n\nTIP-INS\n\nTrail Blazers: Slowed by foul trouble, C Jusuf Nurkic did not attempt a shot in five first-half minutes. ... Portland is 18-5 against Eastern Conference opponents. ... The Trail Blazers are 0-15 on the road when trailing through three quarters.\n\nRaptors: Toronto had nine assists on 11 made baskets in the first. ... The Raptors made their final six shots of the game. ... Lowry has had at least 10 assists in three straight games.\n\nMAKING HIS MARC\n\nGasol's 19 points were his most with Toronto. He also had six assists and eight rebounds.\n\n\"He was really good tonight,\" Nurse said. \"It looked like all of a sudden the rust was gone.\"\n\nLONG DIVISION\n\nPortland lost for the first time in nine games against Atlantic Division opponents. Toronto, which is 9-0 against the Pacific Division, is the only NBA team with an unbeaten record against a single division.\n\nBORDER BLUES\n\nPortland center Enes Kanter did not travel to Toronto with the team. An outspoken critic of Turkish President Recep Tayyip Erdogan, Kanter's Turkish passport was revoked in 2017, and Turkish prosecutors have accused Kanter of membership in a terror organization. While playing for the Knicks earlier this season, Kanter did not accompany the team for a game in London because he feared he could be killed over his opposition to Erdogan.\n\nUP NEXT\n\nTrail Blazers: Visit Charlotte on Sunday.\n\nRaptors: Visit Detroit on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994255.162587
}