{
  "game_id": "0022300496",
  "espn_id": "401585124",
  "date": "Jan 06, 2024",
  "matchup": "MIL @ HOU",
  "headline": "Rockets overcome Antetokounmpo's 48 points, beat slumping Bucks 112-108",
  "body": "HOUSTON -- — Alperen Sengun scored 21 points and the Houston Rockets overcame 48 points from Giannis Antetokounmpo to beat the Milwaukee Bucks 112-108 on Saturday night.\n\n\r\n              Antetokounmpo shot 16 of 25 from the field and added 17 rebounds in his seventh straight double-double. But the Bucks lost for the third time in four games to start 2024 after going 11-2 in December.\n\n\r\n              “We have to be better. We have to play better, we have to defend better, we have to trust one another better, we have to be coached better,” Antetokounmpo said. “Every single thing, everybody has to be better. It starts from the equipment manager — he has to wash our clothes better. The bench has to be better, the leaders of the team have to be more vocal, we have to make more shots, we have to defend better, we have to have a better strategy, we have to be better. We have four months to get better, so we’ll see.”\n\n\r\n              Jalen Green scored 16 points for Houston. Fred VanVleet had 14 points and seven assists, and Jabari Smith Jr. added 14 points and 12 rebounds.\n\n\r\n              The Rockets entered the fourth quarter with an 89-73 lead.\n\n\r\n              Damian Lillard had 18 points and nine assists in a poor-shooting night. He missed a season-high three free throws, on 10 attempts, and went 5 for 16 from the field, including 1 for 8 from 3.\n\n\r\n              “It’ll come. It’s a team sport, it’s five guys out there,” Bucks coach Adrian Griffin said. “I thought we dug ourselves in a hole as a unit and did a good job of getting out of it but just ran out of time. They did a good job defensively.”\n\n\r\n              Khris Middleton added 10 points on 3-of-9 shooting for the Bucks.\n\n\r\n              Veteran Rockets reserve Jeff Green had a season-high 16 points. Cam Whitmore added 12 off the bench and Aaron Holiday had 11. The Rockets’ bench outscored Milwaukee’s 43-22.\n\n\r\n              “We played as hard as we can,” Sengun said. “They’re a really good team. We did everything to stop them except Giannis. He played a great game, but we guarded everybody else good so we won the game.”\n\n\r\n              Houston closed the first quarter on a 13-0 run to take a 29-16 lead.\n\n\r\n              The Rockets outscored Milwaukee 15-6 in the last four minutes of the second quarter to enter halftime with a 63-43 lead. Houston led by as many as 21 points in the game and didn't allow anyone other than Antetokounmpo to make more than five baskets.\n\n\r\n              “He’s a hard guard,” Rockets coach Ime Udoka said. “We can live with one guy going off as long as we keep everybody else under wraps. Giannis is a tough one. You’ve got to pick your poison at times. We’ve shown this year that when we go after everybody else and let one guy loose, we have good results.”\n\n\r\n              Rockets forward Dillon Brooks remained sidelined for a sixth straight game with a right abdominal oblique strain.\n\n\r\n              The Rockets wrapped up a seven-game homestand in which they went 3-4 to move to 18-16. Their next six games will be on the road against Eastern Conference opponents.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host the Jazz on Monday night.\n\n\r\n              Rockets: Visit Miami on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996137.1495092
}