{
  "game_id": "0022000808",
  "espn_id": "401307602",
  "date": "Apr 11, 2021",
  "matchup": "ORL vs. MIL",
  "headline": "Middleton, Portis lead Bucks past slumping Magic 124-87",
  "body": "ORLANDO, Fla. -- — Khris Middleton scored 21 points, Bobby Portis added 16 points, including four 3-pointers, and 10 rebounds off the bench and the Milwaukee Bucks defeated the Orlando Magic 124-87 on Sunday night to end a three-game losing streak.\n\n\r\n                    Milwaukee was again without star Giannis Antetokounmpo, but it mattered little as Middleton shot 8 of 13 from the field and added eight rebounds and five assists to help the Bucks lead wire to wire. Middleton also hit two 3-pointers to give him 1,000 for his NBA career.\n\n\r\n                    “He’s the ultimate professional, so consistent, a great scorer and he does it in a lot of different ways,” Milwaukee coach Mike Budenholzer said of Middleton. “I think, at the same time, he’s a great leader. He’s really taken on a more impactful leadership role. The scoring and the 3s, everybody sees, but I like how he’s taken on leadership.”\n\n\r\n                    Milwaukee shot 48.9% and made 19 3-pointers to beat the Magic for the sixth straight time — five of those wins coming in Orlando. The Magic shot 37.2% and hit only 8 of 36 3s.\n\n\r\n                    Jrue Holiday added 12 points, five rebounds and seven assists for Milwaukee, which never saw its lead dip below 13 points in the second half. Milwaukee pulled its starters early in the fourth period and extended its lead to as much as 37 late.\n\n\r\n                    Brynn Forbes added 13 points off Milwaukee’s bench. Pat Connaughton made all four of his shots and added 11 points.\n\n\r\n                    “The focus of the group was good and both ends of the court some good things were happening,” Budenholzer said. “So, a lot of positives.”\n\n\r\n                    Mo Bamba scored a career-best 21 points for Orlando, which lost its fifth straight game and 18th in 22 games. Bamba, who has gotten significantly more playing time since the team waived Khem Birch, shot 8 of 11 overall and 5 of 6 from 3-point range. He topped his previous high of 19 points set two games ago.\n\n\r\n                    The Magic are 2-7 since trading Nikola Vucevic, Evan Fournier, Aaron Gordon and others at the NBA’s trade deadline on March 25.\n\n\r\n                    “I just told the guys that we’re going to have some nights like this because it’s where we’re at,” Magic coach Steve Clifford said. “Listen, it was a bad performance, I’m in charge of the team and we’ve got to do better.”\n\n\r\n                    GIANNIS’ GAINS\n\n\r\n                    Antetokounmpo missed his fifth straight game with a sore left knee, but Budenholzer said the reigning two-time MVP is trending upward.\n\n\r\n                    The forward, who has 32 double-doubles and seven triple-doubles, worked out with the team Sunday morning in Orlando. Budenholzer said Antetokounmpo showed no signs of trouble with the knee and added, “I think he’s in a good place and is making progress.”\n\n\r\n                    Antetokounmpo famously hates missing games for any reason, but the Milwaukee coach said the star understands the importance of getting healthy.\n\n\r\n                    “He’s such a hard worker and he always has a plan for how he’s going to improve and attack a game or the season, so he’s in a good place,” Budenholzer said of Antetokounmpo, who has missed seven of the last 12 games. “The conversations are positive and he understands the plan. Just keeping working your way through it, don’t rush it and have patience.”\n\n\r\n                    TIP INS\n\n\r\n                    Bucks: Milwaukee is in the midst of playing nine out of 10 games on the road over an 18-day span from March 29 through April 15. ... P.J. Tucker, out the last 10 games with a calf strain, worked out Sunday morning and again before tipoff and Budenholzer said his progress is “trending well.” \n\n\r\n                    Magic: Rookie forward Chuma Okeke missed the game with a sore right hip. He was injured in Friday’s loss to Indiana and was unable to practice Sunday morning. ... Gary Harris made his first start in a Magic uniform Sunday, while James Ennis played exclusively at power forward. It is the Magic’s 25th different starting lineup thus far — the fifth most in franchise history. The most is 28 in the 1991-92 and 2012-13 seasons. … Orlando opened by missing its first seven shots and eight of 10.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: At Minnesota on Wednesday night.\n\n\r\n                    Magic: Host San Antonio on Monday night.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764997579.6605701
}