{
  "game_id": "0021900045",
  "espn_id": "401160687",
  "date": "Oct 28, 2019",
  "matchup": "OKC @ HOU",
  "headline": "Westbrook scores 21 as Rockets beat Thunder 116-112",
  "body": "HOUSTON --  After Russell Westbrook helped the Houston Rockets beat the Oklahoma City Thunder on Monday night in his first meeting against his former team he insisted there weren't different emotions in facing the guys he played with for so long.\n\n\"When I hoop I have no friends,\" he said. \"On the court they know not to talk to me.\"\n\nBut as soon as Westbrook finished saying that, he walked right down the hall and bounded into the visitor's locker room for a reunion with his former teammates.\n\nJames Harden scored 40 points and Westbrook scored 21 and fell an assist shy of a triple-double as the Rockets got the 116-112 win.\n\nSome players seemed taken aback to see Westbrook in their locker room and a confused Dennis Schroder asked him what he was doing in there.\n\nWestbrook smiled and said: \"Same thing I've been doing, coming to check on my homies.\"\n\nWestbrook had 12 rebounds and nine assists after notching his 139th triple-double in his last game to pass Magic Johnson for second-most all-time.\n\nA 3-pointer by Shai Gilgeous-Alexander with 19 seconds left got Oklahoma City within 3. Westbrook made 1 of 2 free throws before fouling Nerlens Noel, who made both free throws.\n\nBut Harden, who was 21 of 22 from the line, made four free throws down the stretch to secure the victory.\n\nIt was the first game between these teams since a blockbuster summer trade reunited Westbrook with Harden and sent Chris Paul to Oklahoma City after the nine-time All-Star failed to help the Rockets to a title in two seasons in Houston.\n\nPaul had 15 points, four assists and five rebounds.\n\nJust before tipoff, Westbrook approached the Thunder bench and hugged coach Billy Donovan before slapping hands and greeting virtually every player on the bench. Westbrook spent the first 11 years of his career in Oklahoma City where he was the face of the franchise before moving to Houston in the deal the Rockets hope will help bring them their first title since 1995.\n\nGilgeous-Alexander had 22 points and Schroder added 22 points to lead the Thunder, who fell to 1-3.\n\nHouston used a 39-point third quarter to take an 11-point lead into the fourth quarter.\n\n\"We picked up our defensive intensity,\" Harden said. \"That's going to be what gets us over the top, what gets us where we want to go. We got a little lackadaisical in the first half. Second half we picked it up and look at the results.\"\n\nThe Rockets opened the third quarter with a 17-4 run to erase a 10-point halftime deficit and take a 69-66 lead with about seven minutes left in the quarter. A 3-pointer by Tucker put Houston on top and Westbrook punctuated the run with a dunk before screaming and flexing as he passed the Thunder bench.\n\nPAUL HONORED\n\nThe Rockets honored Paul with a video tribute that recounted some of his Houston highlights during a timeout in the first quarter. Paul got a huge ovation at the end of the video and smiled and waved to the crowd when he was shown on the Jumbotron.\n\n\"Extremely grateful,\" he said of the tribute. \"The fans here were always great to me and my family ... some of the people here became like family to me and I try to stay in touch with those who were as genuine as could be.\"\n\nTIP-INS\n\nThunder: Steven Adams went to the locker room in the fourth quarter and didn't return. He has a bruised left knee. ... Oklahoma City made 13 of 35 3-pointers. ... The Thunder attempted just two more free throws than Harden did alone.\n\nRockets: G/F Gerald Green, who has been out since Oct. 10, had surgery on Monday to repair a broken bone in his left foot and is expected to be out about six months. ...  Tucker finished with 17 points.\n\nUP NEXT\n\nThunder: Host Portland on Wednesday night.\n\nRockets: Visit Washington on Wednesday night to start a four-game road trip.",
  "source": "espn_api",
  "crawled_at": 1764996257.828608
}