{
  "game_id": "0022101137",
  "espn_id": "401360956",
  "date": "Mar 30, 2022",
  "matchup": "IND vs. DEN",
  "headline": "Jokic has 37 points to lead Nuggets past Pacers 125-118",
  "body": "INDIANAPOLIS -- — Nikola Jokic flirted with another triple-double with 37 points, 13 rebounds and nine assists, helping the Denver Nuggets hold off the Indiana Pacers 125-118 on Wednesday night.\n\n\r\n              The Nuggets led by as many as 31 points in the second quarter before the Pacers stormed back. Indiana led 102-100 with 7:40 left in the fourth quarter before the Nuggets scored seven straight points to regain control.\n\n\r\n              Jokic made his first nine shots in the first half and finished 15 of 19 from the field for Denver. He fell one assist shy of his 20th triple-double of the season after getting one Monday night at Charlotte. Bones Hyland scored 20 points and Will Barton added 18 for the Nuggets, who shot 62.5% for the game.\n\n\r\n              \"My frustration is we get bored with success,\" Nuggets coach Michael Malone said. “I hate when we get up 31 points early.\"\n\n\r\n              Hyland said Malone told the team a win is a win.\n\n\r\n              “We pulled it out,\" Hyland said. “It may have been ugly. We have to clean things up. We could have won the game by a lot of points, but the biggest thing is we came out with a win.'”\n\n\r\n              The Nuggets had 19 turnovers, 11 more than the Pacers.\n\n\r\n              “We had too many turnovers, I had seven of them,” Jokic said. \n\n\r\n              Malone said the important thing is the Nuggets are going back home as the No. 5 seed.\n\n\r\n              Seven of the nine Pacers who played scored in double figures, led by Buddy Hield with 20 points, Terry Taylor with 18 and Goga Bitadze 17. The Pacers shot 45.4% for the game.\n\n\r\n              After trailing big early in the first half, Indiana cut the deficit to forge a 91-all tie after three quarters. Indiana shot 62.5% to hold a 38-22 edge in the third quarter.\n\n\r\n              “Give Indiana credit, they got back in the game,” Malone said. “They turned up the heat, the intensity, the pressure. They became the attacker until the last six or seven minutes. You want guys that are going to fight and not sit there and take it. You want guys that will fight for every inch and I think we have had bunch of guys like that.”\n\n\r\n              With the Nuggets leading 100-98 with 8:41 left in the fourth quarter, Denver’s Austin Rivers shoved Lance Stephenson after he felt Stephenson hit him while guarding him. Both players were called for technicals.\n\n\r\n              Rivers was ejected later after a second technical because he faked throwing an elbow at Stephenson, but didn’t make contact. Malone said referee Tony Brothers said it was malicious act by Rivers. Malone said he would talk to the league about the ejection.\n\n\r\n              The Nuggets shot 68% in the first quarter to take a 43-15 lead. The 28-point margin was the largest by any team in the league after the first quarter this season.\n\n\r\n              The Pacers were able to trim the deficit to 69-53 at halftime by holding a 38-26 edge in the second quarter.\n\n\r\n              “Obviously a bad start,” said Pacers guard Tyrese Haliburton, who had 15 points and 12 assists. \"The crowd got involved, and that’s what got us going. We've just got to figure out how to bottle up that third and fourth quarter and second half and sustain it.’\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: JaMychal Green missed his second consecutive game with a wrist injury. ... Jamal Murray, who hasn’t played this season after ACL surgery, did strength training in the hallway and had a workout on the court before team workouts.\n\n\r\n              Pacers: Isaiah Jackson remains out. He missed two games because of a concussion. He tried to play March 23 against Sacramento, but left after a short stint with a headache. ... Oshae Brissett missed his second consecutive game with a sore back. However, Duane Washington Jr. returned after missing the past two games with a hip injury.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Hosts Minnesota on Friday.\n\n\r\n              Pacers: At Boston on Friday.\n\n\r\n              —",
  "source": "espn_api",
  "crawled_at": 1764993005.121548
}