{
  "game_id": "0022200140",
  "espn_id": "401468295",
  "date": "Nov 06, 2022",
  "matchup": "LAL vs. CLE",
  "headline": "Garland, Mitchell lead Cavs past Lakers to 8th straight win",
  "body": "LOS ANGELES -- — Donovan Mitchell scored 33 points and Darius Garland added 24 in the dynamic Cleveland backcourt's return from injury absences, and the Cavaliers rolled past LeBron James and the Los Angeles Lakers 114-100 Sunday for their eighth consecutive victory.\n\n\r\n              Jarrett Allen added 16 points to back the Cleveland guards' latest two-man show while the Cavs improved to 8-1, extending their longest winning streak since a 13-game run in late 2017 during James’ final season with the team.\n\n\r\n              James scored 27 points, but lost to his hometown Cavaliers for only the second time in 19 meetings during his 20-year NBA career. He took his only other loss in March 2011 while with Miami.\n\n\r\n              “You've always got to have respect for greatness,” said Mitchell, who grew up a fan of James and the Cavs. “When the greatest are on the floor, you just go out there and try to find a way to compete and get a win. We came out there and were just trying to do what we've been doing, and fortunately it was against Bron, but that wasn't a talking point or anything.”\n\n\r\n              Mitchell remained in a groove with his new team, topping 30 points for the sixth time in eight games.\n\n\r\n              Cleveland hasn’t made the playoffs without James on its roster since 1998, but this current group appears primed to make its own history. The Cavs trailed by 12 in the first half during a slow start that coach J.B. Bickerstaff dryly attributed to “LA,” but they smoothly surged away in the second half.\n\n\r\n              “LeBron does a lot for the city, did a lot for the city,” Garland said. “So just having a whole different generation of guys with a whole bunch of talent, and just a great team overall that everybody loves, it would mean a lot for us and the city of Cleveland (to make the playoffs again). That’s what we’re pushing for.”\n\n\r\n              Anthony Davis had 19 points and 12 rebounds for the Lakers, who dropped to 2-7 with their second straight home defeat. Russell Westbrook had 19 points and 10 assists with seven turnovers in another lively performance as a reserve, but the Lakers had no defensive answers for Mitchell or Garland.\n\n\r\n              “I got in trouble last time when I was just giving an honest opinion” about the Cavs during last season’s All-Star break, James said with a smile. “Which I don’t care, so I’ll give another. ... They did a great job in the offseason of picking up a big-time player. They have a really good team and a great coach. A well-balanced team and a bunch of players (who) seem like they just really want to play ball.”\n\n\r\n              Garland had played in just one of the Cavs' previous seven games due to an eye injury and a subsequent knee injury. Garland and Mitchell (left ankle sprain) sat out Cleveland's win over Detroit on Friday, but both stars returned in top form with a combined 17-for-35 shooting, four 3-pointers and a 19-for-20 performance at the free throw line.\n\n\r\n              “We just didn't come out ready (in the second half),” Westbrook said. “We were playing catch-up.”\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: USC product and Southern California native Evan Mobley had five points on 2-of-7 shooting and seven rebounds in 30 minutes.\n\n\r\n              Lakers: Had the lead after the first quarter of play for the first time this season. ... Kendrick Nunn played 18 scoreless minutes in his first start in place of Patrick Beverley, who sat out with an illness. ... James snapped his skid of 16 consecutive missed 3-point attempts across four games with a bucket in the fourth quarter.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Clippers on Monday.\n\n\r\n              Lakers: At Jazz on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994155.133527
}