{
  "game_id": "0022400067",
  "espn_id": "401704633",
  "date": "Oct 23, 2024",
  "matchup": "TOR vs. CLE",
  "headline": "Mobley scores 25, Mitchell adds 21 as Cavaliers rout Raptors 136-106 in season opener",
  "body": "TORONTO -- — Evan Mobley scored 25 points, Donovan Mitchell had 21 and the Cleveland Cavaliers routed the Toronto Raptors 136-106 on Wednesday night.\n\n\r\n              Caris LeVert shot 8 for 9 and scored 19 points, and Jarrett Allen had 14 for the Cavs, whose biggest lead was 33. Cleveland won for the first time in five season-opening meetings with Toronto.\n\n\r\n              Raptors forward Scottie Barnes shot 3 for 14 and scored nine points in a disappointing season debut.\n\n\r\n              Toronto’s Chris Boucher scored 18 points off the bench, Gradey Dick added 16 and guard Immanuel Quickley scored 13 points in 14 minutes before exiting because of an injury.\n\n\r\n              Takeaways\r\n              Cavaliers: Mobley shot 9 for 14 to help Cleveland outscore Toronto 68-38 in the paint. Dean Wade started in place of the injured Max Strus (right ankle) and had eight rebounds.\n\n\r\n              Raptors: Toronto kicked off its 30th NBA season by welcoming former stars Damon Stoudamire, T.J. Ford and Jerome Williams back to town, but didn’t offer much on-court excitement in the season opener. The Raptors made 19 turnovers, leading to 30 points for Cleveland. Many in the sellout crowd of 19,800 left early.\n\n\r\n              Key moment\r\n              Quickley fell heavily under his own basket when he was fouled in the second quarter. He checked out with 2:24 to go in the first half and did not return. The Raptors said Quickley was ruled out because of a right pelvic contusion.\n\n\r\n              Key stat\r\n              Cleveland outscored Toronto 20-4 over the final 5:09 of the first half as the Raptors turned the ball over six times. The Cavs had five dunks in that stretch, three of them from Allen. Cleveland led 69-49 at the break.\n\n\r\n              Up next\r\n              The Cavaliers play their home opener against Detroit on Friday night. Toronto hosts former coach Nick Nurse and the Philadelphia 76ers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997015.6293151
}