{
  "game_id": "0021500449",
  "espn_id": "400828336",
  "date": "Dec 26, 2015",
  "matchup": "CHI @ DAL",
  "headline": "Barea hits career-high 7 3s, Mavericks top Bulls 118-111",
  "body": "DALLAS -- J.J. Barea pulled up from a couple of feet behind the 3-point line just after returning to the game and hit the last of his five straight from long range in the first half.\nThe diminutive guard simply has that can't-miss feeling right now.\nBarea made a career-high seven from beyond the arc and finished with 26 points coming off his first 30-point game, and the Dallas Mavericks beat the Chicago Bulls 118-111 Saturday night in a game delayed 30 minutes by tornadoes in the Dallas area.\n\nStarting for the injured Deron Williams for the second straight game, Barea made his first seven from long range and is 12 of 15 going back to an overtime win against Brooklyn on Wednesday, when he had a career-high 32 points.\n\"When you're in a good rhythm, you basically try to look for more shots,\" Barea said. \"But today they were good ones. With the ball screens on top, I just kept working until I was open, and it worked out.\"\nDerrick Rose led the Bulls with 25 points, including nine in the fourth quarter, but had a key turnover before getting called for a 5-second violation when Chicago had a chance to tie in the final 11 seconds.\n\"I think I lost this game with the turnovers,\" Rose said. \"We were down to such a critical point in the game. I feel bad. I feel like I lost this game for the team.\"\nDirk Nowitzki scored 16 points in his first home game since passing Shaquille O'Neal on the career scoring list, and Zaza Pachulia had 17 points and 12 rebounds. Barea was 7 for 8 from beyond the arc.\nNikola Mirotic had 23 points, seven rebounds and three blocks for the Bulls, who were trying for back-to-back wins a night after winning at Oklahoma City. The Mavericks had a mini two-day Christmas break.\nRaymond Felton broke a late tie with two free throws after a strong drive to the basket, and then tipped a pass from Rose that Nowitzki grabbed and threw ahead to Chandler Parsons. After stopping at the basket, Parsons handed off to Wesley Matthews for a layup and a 112-108 lead.\nAfter Rose missed a runner that he had success with earlier in the game, Felton made two more free throws for a 114-108 Dallas lead with 38 seconds left.\nJimmy Butler hit a 3-pointer that bounced around the rim, and the Bulls got another chance after a Dallas miss. But with Felton defending him, Rose couldn't get the ball in. Felton had six of his 13 points on free throws in the final 1:07.\n\"I just thought our guys' collective will carried them in this game,\" Dallas coach Rick Carlisle said. \"We got great contributions from every position.\"\nChicago's Pau Gasol had 18 points, nine rebounds and three blocks, and Butler scored 17 points with a game-high eight assists.\nANOTHER DIRK MOMENT\nNowitzki got a standing ovation early in the first quarter after a video tribute for him passing O'Neal for No. 6 on the NBA's scoring list in the Mavericks' last game at Brooklyn. The 37-year-old German promptly hit a fadeaway jumper coming out of the timeout.\nNOT QUITE\nThe Bulls had another solid game coming off a three-game losing streak that ended with the victory at the Thunder.\n\"We went on the road in two very tough environments and got a great win yesterday in Oklahoma City and had a chance in this one in a tough building,\" coach Fred Hoiberg said.\nGETTING CLOSER\nParsons is getting closer to completing his recovery from offseason knee surgery. He had a season high in minutes for the second straight game, matched his season best with 20 points and perhaps had his best overall game. He tied Barea and Felton with a team-high five assists in 35 1/2 minutes.\n\"Parsons is ready,\" Carlisle said. \"He's feeling good. His all-around game was great.\"\nTIP-INS\nBulls: F Joakim Noah missed his second straight game with a left shoulder sprain. He got hurt Monday against Brooklyn and is expected to miss at least another week. ... Rose and Mirotic both had their fourth 20-point game of the season.\nMavericks: Carlisle wouldn't put a timetable on Williams' return from a left hamstring strain. ... G Devin Harris returned after missing three games with a right hamstring injury. ... Pachulia had his 16th double-double, surpassing last season's total in Milwaukee.\nUP NEXT\nBulls: Host Toronto on Monday.\nMavericks: Host Milwaukee on Monday.",
  "source": "espn_api",
  "crawled_at": 1764993946.2944992
}