{
  "game_id": "0021600748",
  "espn_id": "400900153",
  "date": "Feb 03, 2017",
  "matchup": "DET vs. MIN",
  "headline": "Morris, Leuer lead Pistons over Timberwolves 116-108",
  "body": "AUBURN HILLS, Mich. --  Two days after Kentavious Caldwell-Pope reached a career high in scoring, Marcus Morris and Jon Leuer followed suit.\n\nThe Detroit Pistons can be tough to beat when they're getting that type of production from so many different players.\n\nMorris scored 36 points and Leuer added 24 to lift the Pistons over the Minnesota Timberwolves 116-108 on Friday night. Caldwell-Pope, who scored 38 in a win over New Orleans on Wednesday, was held to two points against Minnesota, but the Pistons didn't need a big night from him.\n\n\"We're a balanced team, when guys play unselfish and move the ball,\" Leuer said. \"The main thing is just to get quality looks.\"\n\nMorris and Leuer surpassed their previous career highs of 34 and 23 points.\n\n\"They played very well,\" Minnesota coach Tom Thibodeau said. \"They made 3s tonight, put a lot of pressure on us. I thought some of their 3s were a result of maybe reckless gambles on our part.\"\n\nDetroit won despite 5-for-20 shooting from its starting backcourt of Reggie Jackson and Caldwell-Pope. Morris scored 13 of his points in the third quarter.\n\nKarl-Anthony Towns had 24 points and 11 rebounds for Minnesota, and Andrew Wiggins added 21 points. Zach LaVine scored 20 points for the Timberwolves but was set to be evaluated for a left knee contusion.\n\nAndre Drummond had 12 points and 18 rebounds for the Pistons.\n\nDetroit led 92-82 in the fourth quarter before a 7-0 run by the Timberwolves cut the lead to three. The Pistons responded with a 10-0 run of their own.\n\n\"I thought for the most part we were pretty good down the stretch,\" Detroit coach Stan Van Gundy said. \"I think we are capable of playing good defense, it's just we don't do it nearly consistently enough.\"\n\nMorris surpassed his previous career high when he scored his final two points on free throws with 24.2 seconds remaining. Those put Detroit up 112-106.\n\nEXTRA OPTIONS\n\nMorris and Leuer were a combined 9 of 16 from beyond the arc. The rest of the Pistons went 2 of 10.\n\n\"They're a good team, they spread you out,\" Wiggins said. \"We just have to close out better and not give those guys easy looks at the basket.\"\n\nSTANDINGS\n\nThe Pistons pulled even with Charlotte for the No. 8 spot in the Eastern Conference.\n\n\"Right now it's so tight, you win two games, you're in seventh,\" Morris said. \"You win three, you're in sixth. You lose one, you're in ninth.\"\n\nCARELESS\n\nDetroit's 10-0 run in the fourth was aided by turnovers by Wiggins and Ricky Rubio.\n\n\"Overall, the turnovers weren't high, but those to me were very costly,\" Thibodeau said. \"That's what we're talking about, the difference of the first three quarters and the fourth quarter -- understanding the intensity and the decision making that's necessary to not turn it over.\"\n\nTIP-INS\n\nTimberwolves: F Adreian Payne (illness) missed the game. ... Minnesota had won eight of its previous 12 games before Friday's defeat.\n\nPistons: Detroit assigned F Henry Ellenson and G Michael Gbinije to the team's Grand Rapids affiliate in the D-League before the game. ... The Pistons had 18 offensive rebounds, including six by Drummond. ... Jackson shot just 4 of 13 from the field, but he and backup point guard Ish Smith combined for 13 assists and no turnovers.\n\nUP NEXT\n\nTimberwolves: Host Memphis on Saturday night, the start of a six-game homestand.\n\nPistons: Visit Indiana on Saturday night.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764996050.0175412
}