{
  "game_id": "0022300896",
  "espn_id": "401585524",
  "date": "Mar 06, 2024",
  "matchup": "MEM @ PHI",
  "headline": "Jaren Jackson Jr. scores 30 points, Jake LaRavia drops 19 in Grizzlies' 115-109 win over 76ers",
  "body": "PHILADELPHIA -- — The Philadelphia 76ers played without injured All-Stars Joel Embiid, Tyrese Maxey and a pair of pivotal role players. Memphis missed Ja Morant, Desmond Bane and, well, seemingly a longer list of injured players than the ones available to suit up.\n\n\r\n              In a matchup of undermanned teams Wednesday night, the Grizzlies had the resolve on the road in crunch time to pull off one of their rare bright spots of the season.\n\n\r\n              Jaren Jackson Jr. had 30 points, 11 rebounds and six blocks, Jake LaRavia had 19 points and 13 rebounds and the Grizzlies used an 11-0 run late in the fourth quarter to rally to a 115-109 win over the 76ers.\n\n\r\n              The Grizzlies trailed by 12 entering the fourth before getting hot in the final minutes, much like they did in a win Monday night at Brooklyn. One of the worst teams in the NBA, Memphis has won two in a row following a five-game losing streak.\n\n\r\n              “If we don't get the job done, a lot of times it's that fourth quarter execution on both sides of the floor,” coach Taylor Jenkins said. “Make the winning plays. That's the thing I keep stressing. Luckily, they did the last two games and we get to carry hopefully some momentum back home and play a little better back at home.”\n\n\r\n              The Grizzlies outscored the 76ers 34-16 in the fourth.\n\n\r\n              Vince Williams Jr., who had 17 points and nine assists, put the Grizzlies ahead 105-104 with a pair of free throws and they never trailed again. Memphis won its 15th game on the road against only seven at home. \n\n\r\n              Kelly Oubre Jr. led the 76ers with 25 points and Paul Reed had 17 points and 11 rebounds.\n\n\r\n              Tobias Harris, in the final months of a five-year, $180 million, has continued to shrink as more was expected of him in Maxey and Embiid's absence. Harris scored just eight points on 3-of-12 shooting.\n\n\r\n              “We couldn't get a bucket to fall for us,” Harris said. “That was the name of the game in the fourth.”\n\n\r\n              The Sixers played a second straight game without Maxey as he recovers from a concussion. Maxey lost his balance on a drive Sunday in the third quarter of a game at Dallas and banged his head on another player’s knee. He left the game, but was able to return and finish. With the Sixers coming off a loss a night earlier at Brooklyn, Maxey was expected to sit this one out, given the NBA’s protocols governing returning to play after a concussion.\n\n\r\n              Coach Nick Nurse said Maxey still experienced “very mild symptoms.”\n\n\r\n              The Sixers have gone a month without Embiid and there is still no timetable on his return from knee surgery. While he and Maxey are clearly the biggest names sitting out, the Sixers have been riddled by injuries this season and an expected Eastern Conference contender is now fighting to stay out of the play-in tournament.\n\n\r\n              Robert Covington hasn't played this calendar year because of a left knee bone bruise and could start on-court activities within a week to 10 days. De’Anthony Melton hasn't played since the end of March with lumbar spine bone stress. The Sixers said ahead of the game that Melton would be evaluated again in two weeks.\n\n\r\n              The Sixers started three players — Nicolas Batum, Buddy Hield and Cam Payne — who weren't on the opening night roster. \n\n\r\n              They were forced to rely on guard Jeff Dowtin Jr., who scored 10 in just his second game since he signed a two-way contract. He spent this season with the G League Delaware Blue Coats but did play 25 games last season under Nurse in Toronto. \n\n\r\n              The Grizzlies are fighting through their own injury woes with Ziaire Williams (hip) and Derrick Rose (groin) recently added to a lengthy list of achy players that included Morant, Bane and Marcus Smart. While the Grizzlies weren't necessarily expected to contend for a playoff spot, the injuries wreaked havoc with their rotations and had them ahead of only Portland and San Antonio in the Western Conference standings.\n\n\r\n              “These guys have just been really hanging in,” Jenkins said. “There's still a lot more basketball left to play in the season. We keep reminding them, here's what's in front of us, here's our reality. What are we going to do about it?”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Atlanta on Friday.\n\n\r\n              76ers: Host Pelicans on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996001.143401
}