{
  "game_id": "0021501101",
  "espn_id": "400828988",
  "date": "Mar 28, 2016",
  "matchup": "PHX @ MIN",
  "headline": "Wiggins, Wolves hold off late charge by Suns in 121-116 win",
  "body": "MINNEAPOLIS --  A 20-point lead had disappeared in a matter of minutes, and the Minnesota Timberwolves were in danger of succumbing to the small-ball Phoenix Suns for the second time in just over two weeks.\n\nThis time they dug deep and held on, the latest sign of a young group coming together.\n\nAndrew Wiggins scored 32 points, Karl-Anthony Towns added 27 points and 10 boards and the Timberwolves beat the Suns 121-116 on Monday night for their third win in four games.\n\nWiggins needed just 13 field goal attempts to score his points. He made a career-high 17 of 21 free throws and 3 of 5 3-pointers and also blocked three shots. Minnesota shot 50.6 percent and turned 21 Suns turnovers into 26 points.\n\n\"It's a process and this can lead into next year,\" Wiggins said. \"We don't want to stop. We play hard for a reason. We're building something here.\"\n\nDevin Booker scored 12 of his 30 points in the fourth quarter as the Suns mounted a furious comeback from 20 down. Brandon Knight scored 30 points and tied a career high with seven 3-pointers, but the Suns lost for the eighth time in their last 11 games.\n\nMuch like the last game in Phoenix, when the Suns went small to rally and beat the Wolves on a last-second 3 from Mirza Teletovic, coach Earl Watson employed a similar lineup to force Wolves coach Sam Mitchell to remove stalwart big man Gorgui Dieng.\n\nA 23-4 run trimmed a 20-point deficit to one point midway through the fourth quarter and Booker hit a 3 for a 112-110 lead with under 3 minutes to play.\n\nThe Suns had a chance to tie the game in the closing seconds, but Teletovic rushed a turnaround 3 in the corner and the Wolves hung on.\n\n\"I was just trying to get to the 3-point line as soon as possible and try to get it up before they try to foul me because we needed three points to get to overtime,\" Teletovic said.\n\nTeletovic scored 19 points and Alex Len had 14 points and 13 boards.\n\nRicky Rubio had 17 points, 11 assists and seven rebounds for Minnesota.\n\nPLAY OF THE GAME\n\nAfter the Wolves fell behind on Booker's 3, Rubio hit a 3 of his own, then baited Booker into an ill-advised pass just over the halfcourt stripe. Rubio leaped in front for the steal and fed LaVine for a dunk that gave the Wolves a 117-112 lead with 90 seconds to play.\n\n\"Booker is a great player, but still not a good passer,\" Rubio said. \"He prefers to get to the rim. I saw that chance ... I took a gamble. When you take the gamble you've got to go all for it.\"\n\nROOKIE SHOWDOWN\n\nTowns and Booker played together at Kentucky last season and are close friends. Towns has been named the Western Conference's top rookie in each of the first four months of the season, but the baby-faced Booker has put together an impressive March to try to end his buddy's streak.\n\nTowns tried to put that debate to a rest early, racking up 18 points on nine shots in the period. He blew by Jon Leuer before elevating, switching the ball from his left hand to his right in the air and dunking over Teletovic.\n\nBut Booker hit 3 of 5 shots in the fourth and 5 of 6 free throws, helping the Suns outscore the Wolves 32-22 in the quarter.\n\n\"I thought he was going to score 80 points in the game,\" Booker said. \"You know, he's fun to watch, but at the same time I'm still competitive with him. He's a good friend of mine, my brother for life, but I wish the best for him just not when he plays us.\"\n\nTIP-INS\n\nSuns: Leuer, a Minnesota native, fought off an illness and played 11 minutes. ... C Tyson Chandler played after being questionable with back spasms, but was limited to 19 minutes because of foul trouble. ... It was Knight's fifth 30-point game of the season, but he scored just three points in the second half.\n\nTimberwolves: Towns' 18 points in the first quarter were the most by a Wolves player in a quarter all season. ... Mitchell said before the game he's given thought to resting Towns, Wiggins and LaVine some down the stretch after the three youngsters have played so many minutes over the last two months. But so far he believes they want to play out the season.\n\nUP NEXT\n\nSuns: Visit Milwaukee on Wednesday.\n\nTimberwolves: Host Los Angeles Clippers on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994822.2116978
}