{
  "game_id": "0021800055",
  "espn_id": "401070736",
  "date": "Oct 24, 2018",
  "matchup": "MIN @ TOR",
  "headline": "Leonard scores 35, Raptors beat Wolves 112-105 to reach 5-0",
  "body": "TORONTO --  With his highest-scoring game of the season, Kawhi Leonard kept the Toronto Raptors rolling along.\n\nLeonard scored 35 points, Kyle Lowry had 13 points and 10 assists, and the Raptors beat the Minnesota Timberwolves 112-105 on Wednesday night to improve to 5-0 and match the best start in franchise history.\n\n\"We're on the right track,\" Leonard said. \"We've won every game so far and we've just got to keep going.\"\n\nJonas Valanciunas scored 16 points, Serge Ibaka had 15 and Norman Powell added a season-high 10 for the Raptors, who also won five straight to start the 2015-16 season.\n\n\"They got points in the paint, they got open 3s, they got out in transition,\" Minnesota's Jimmy Butler said. \"We didn't take too many things away from them tonight and they capitalized at every opportunity.\"\n\nToronto won its 15th straight home game against Minnesota, extending its franchise record for consecutive home victories over a single opponent. The last time the Raptors lost at home to the Timberwolves was Jan. 21, 2004.\n\nButler scored 23 points, Derrick Rose had 16 and Taj Gibson 13 for Minnesota, which has yet to win back-to-back games this season.\n\n\"We played from behind all night,\" Timberwolves coach Tom Thibodeau said.\n\nMinnesota guard Andrew Wiggins was inactive for only the second time in his career, sitting out because of a bruised right quadriceps. Wiggins, who is from suburban Toronto, left in the first quarter of Monday's win over Indiana and did not return.\n\nRookie Josh Okogie started in place of Wiggins and finished with 10 points and 11 rebounds.\n\nLeonard shot 15 for 23, going 2 for 4 from 3-point range, and had 10 points came in the fourth quarter.\n\nButler said Leonard looks like the player he was before missing all but nine games because of injury last season.\n\n\"He's there,\" Butler said. \"He's shooting the ball with confidence. The athleticism is there, he's passing it well, guarding. I think he's going to be just fine here.\n\n\"When you have a team like they have and a player of his caliber, the game gets really easy for him and for everybody else,\" Butler added.\n\nToronto was up by 17 points in the fourth but Towns scored to cut it to 106-101 with 1:16 remaining. Following a timeout, Leonard drove for a jumpshot over Rose, pushing the lead to seven.\n\nMinnesota called timeout and gave the ball to Jeff Teague, but his missed shot was rebounded by Ibaka. Leonard was fouled and made both, putting the Raptors up by nine points with 38 seconds to go.\n\nTIP-INS\n\nTimberwolves: The last time Wiggins was inactive was Nov. 10, 2015, when he sat out a loss to Charlotte because of a sore right knee. ... Teague led Minnesota with nine assists. ... All five Minnesota starters reached double figures in scoring.\n\nRaptors: G Delon Wright (left thigh) returned after missing the first four games of the season. Wright went scoreless in five first-half minutes but did not return following the intermission because of soreness in his groin. ... G Fred VanVleet (sprained left big toe) was inactive. ... Valanciunas matched a career high with two made 3-pointers. ... Lowry had six rebounds. ... Toronto outscored Minnesota 56-38 in the paint.\n\nDEAR MR. FANTASY\n\nMinnesota's Karl-Anthony Towns shot 5 for 17 and scored 14 points, but was more upset at the result than his poor shooting.\n\n\"A loss is a loss,\" Towns said. \"It's about winning. It's not about the statistical achievements, doing this or that for whoever my fantasy owner is.\"\n\nCENTURY CLUB\n\nFor the first time in franchise history, Toronto has won five straight games despite allowing 100 or more points in each.\n\nCAGED WOLVES\n\nToronto is 30-15 against Minnesota, its best record against any opponent.\n\nUP NEXT\n\nTimberwolves: At Milwaukee on Friday night.\n\nRaptors: Host Dallas on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994080.459579
}