{
  "game_id": "0022300840",
  "espn_id": "401585468",
  "date": "Feb 27, 2024",
  "matchup": "CHA @ MIL",
  "headline": "Bucks roll to 123-85 blowout of Hornets for their third consecutive victory",
  "body": "MILWAUKEE -- — The Milwaukee Bucks apparently just needed the All-Star break to discover how to play winning basketball under new coach Doc Rivers.\n\n\r\n              Giannis Antetokounmpo scored 24 points, Damian Lillard had 23 and Bobby Portis added 21 as the Bucks pounded the Charlotte Hornets 123-85 on Tuesday night for their most lopsided victory of the season.\n\n\r\n              “This is who we are,” Antetokounmpo said. “This is who we're trying to be.”\n\n\r\n              Milwaukee has won three straight since the All-Star break to improve to 6-7 since Rivers' arrival.\n\n\r\n              “We had time, like six or seven days, to kind of think what this coaching staff and what the team expects from us,” Antetokounmpo said. “Coming back from the break, I think everybody got the opportunity to talk about everybody's role and what the team expects from us so we can keep one another accountable.”\n\n\r\n              Milwaukee rolled to a 58-26 lead at the break by holding Charlotte to the lowest point total any team had produced in a half all season. This represented the second-lowest point total the Bucks had ever allowed in the first half of a game, behind the 25 they yielded in a 94-81 victory over the Philadelphia 76ers on March 3, 1972.\n\n\r\n              The Bucks have given up fewer than 100 points in four of their last seven contests after reaching that goal just once in their first 52 games of the season.\n\n\r\n              “It's kind of cool to see us playing how we know how to play,” Portis said.\n\n\r\n              This blowout enabled the Bucks to give their two biggest stars some extra rest as they began a four-day stretch in which they play three games. Lillard had nine rebounds and seven assists before leaving the game with 5 ½ minutes left in the third quarter. Antetokounmpo departed 1 ½ minutes later.\n\n\r\n              Brook Lopez went scoreless but had two blocks to move into second place on the Bucks' career list with 806, breaking a tie with Alton Lister. Antetokounmpo is the Bucks' career blocks leader with 966.\n\n\r\n              Lopez has 1,876 blocks over his 16-year career, including a franchise-record 972 with the Brooklyn Nets from 2008-17.\n\n\r\n              Miles Bridges scored 17, Tre Mann 16, Brandon Miller 14 and Davis Bertans 12 for the Hornets, who lost for just the second time in their last seven games.\n\n\r\n              The Bucks have romped in each of their three matchups with the Hornets this season. They won 130-99 in Charlotte on Nov. 17 and 120-84 in Milwaukee on Feb. 9.\n\n\r\n              Charlotte had overhauled its roster since the last time these teams faced each other by acquiring Mann, Bertans, Grant Williams, Vasa Micic and Seth Curry at the trade deadline. Those players had helped the Hornets surge the past couple of weeks, but they couldn’t do anything to stop the Bucks.\n\n\r\n              “Right now, watching them on film and again tonight, you can tell they sense that they're starting to feel good about each other,” Hornets coach Steve Clifford said of the Bucks. “They're starting to get a feel for how they want to play, and they're playing with great confidence and energy.”\n\n\r\n              The Bucks had missed their first five 3-point attempts before Lillard made a move that sent Charlotte’s Cody Martin sprawling to the floor and hit a wide-open 3-pointer to break an 11-all tie.\n\n\r\n              That spectacular play was part of a 15-0 run for the Bucks that turned an 11-9 deficit into a 24-11 lead. Lillard scored eight points during that stretch and capped the spurt with another 3-pointer.\n\n\r\n              UP NEXT\n\n\r\n              The Hornets and Bucks face off again Thursday night in Charlotte.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995956.1106591
}