{
  "game_id": "401810207",
  "espn_id": "401810207",
  "date": "Dec 06, 2025",
  "matchup": "CLE vs GS",
  "headline": "Golden State plays Cleveland, aims to end road skid",
  "body": "Golden State Warriors (11-12, eighth in the Western Conference) vs. Cleveland Cavaliers (14-10, eighth in the Eastern Conference)\n\n\r\n              Cleveland; Saturday, 7:30 p.m. EST\n\n\r\n               Cavaliers -7.5; over/under is 227.5\n\n\r\n              BOTTOM LINE: Golden State hits the road against Cleveland looking to break its three-game road slide.\n\n\r\n              The Cavaliers are 9-5 on their home court. Cleveland is sixth in the Eastern Conference with 27.3 assists per game led by Donovan Mitchell averaging 5.6.\n\n\r\n              The Warriors have gone 4-9 away from home. Golden State is 6-8 against opponents with a winning record.\n\n\r\n              The 119.6 points per game the Cavaliers score are 6.2 more points than the Warriors give up (113.4). The Warriors are shooting 44.9% from the field, 1.6% lower than the 46.5% the Cavaliers' opponents have shot this season.\n\n\r\n              TOP PERFORMERS: Evan Mobley is averaging 19 points, 9.1 rebounds, 4.2 assists and 1.7 blocks for the Cavaliers. Mitchell is averaging 28.0 points over the last 10 games.\n\n\r\n              Jimmy Butler III is scoring 19.5 points per game with 5.6 rebounds and 5.0 assists for the Warriors. Pat Spencer is averaging 16.0 points and 4.0 rebounds while shooting 62.5% over the past 10 games.\n\n\r\n              LAST 10 GAMES: Cavaliers: 5-5, averaging 117.4 points, 44.6 rebounds, 26.7 assists, 7.9 steals and 5.5 blocks per game while shooting 48.2% from the field. Their opponents have averaged 114.9 points per game.\n\n\r\n              Warriors: 4-6, averaging 111.3 points, 44.6 rebounds, 27.5 assists, 9.7 steals and 4.3 blocks per game while shooting 44.1% from the field. Their opponents have averaged 111.2 points.\n\n\r\n              INJURIES: Cavaliers: Sam Merrill: day to day (hand), Max Strus: out (foot), Darius Garland: day to day (toe), Tyrese Proctor: day to day (personal), Larry Nance Jr.: out (calf), Jarrett Allen: out (finger).\n\n\r\n              Warriors: Alex Toohey: out (knee), Seth Curry: day to day (toe), Draymond Green: day to day (midfoot), Al Horford: out (back), Stephen Curry: out (quadricep), De'Anthony Melton: day to day (knee), Jimmy Butler III: day to day (knee).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042766.183496
}