{
  "game_id": "0022200430",
  "espn_id": "401468585",
  "date": "Dec 16, 2022",
  "matchup": "ORL @ BOS",
  "headline": "Moritz Wagner powers Magic past NBA-leading Celtics 117-109",
  "body": "BOSTON -- — Moritz Wagner scored 25 points and Paolo Banchero added 20 as the Orlando Magic beat the NBA-leading Boston Celtics 117-109 on Friday night.\n\n\r\n               Franz Wagner scored 19 points as Orlando won its fifth straight game — the first four coming at home. The Magic outrebounded the Celtics 53-38 and held the lead for the final 37 minutes of the game.\n\n\r\n              “One of the (Magic) coaches came up to me before the game and said, ‘We’re on the road against the best team in the NBA. Either we can prove that we’re a good team and really rolling or blame that we’re on the road and just roll over.’ We didn’t want to do that,” said Banchero, who shot 3 of 3 from 3-point range and 7 of 8 at the line. “To get a lead and keep a lead is the biggest thing I’m proud of about tonight.”\n\n\r\n              Jayson Tatum scored 31 points and Jaylen Brown 26 as Boston (22-8) lost for the third time in four games. The Celtics attempted 46 3-pointers and made 11.\n\n\r\n              “We had good looks. Even when they’re not going in, you have to keep moving the ball and shooting it,” Celtics interim head coach Joe Mazzulla said.\n\n\r\n              Boston’s Robert Williams played in his first game since the NBA Finals after undergoing surgery on his left knee during the preseason and finished with nine points and five rebounds in 18 minutes. \n\n\r\n              Helped by two 3-pointers in the opening minutes from Al Horford, the Celtics jumped out to a 14-5 lead against a team with the third-worst record in the Eastern Conference. The Magic surged back, closing the opening quarter with a 15-4 run that was capped with a buzzer-beating 3-pointer by Banchero.\n\n\r\n              Orlando kept the pressure on Boston, leading 62-54 at halftime and extending the lead to 19 points early in the third quarter. The Celtics cut their deficit to single digits on a few occasions, but the Magic remained comfortably ahead.\n\n\r\n              “They went on their run in the third but our guys understand that they have to stay the course and continue to communicate with one another and stick back to the principles of what we do,” Orlando head coach Jamahl Mosley said. \n\n\r\n              Markelle Fultz scored five straight, including jumper that gave the Magic a 108-96 lead with 3:55 remaining. Fultz had 12 points and four assists before fouling out. \n\n\r\n              WILLIAMS’ RETURN\n\n\r\n              Williams’ surgery in the offseason was his second procedure on the same knee in a six-month span. The 25-year-old was upgraded to questionable on Thursday, with Mazzulla confirming before Friday’s game that “there isn’t a minutes restriction” concerning Williams, who came off the bench against the Magic.\n\n\r\n              “I’m glad he’s back healthy and back with the team. That’s a plus tonight,” said Tatum. \n\n\r\n              Williams received a standing ovation at 7:03 of the first quarter. He connected on an alley-oop slam dunk on a pass from Marcus Smart, but picked up three fouls over a four-minute span. \n\n\r\n              SILAS REMEMBERED\n\n\r\n              Boston honored former player Paul Silas, who died last Saturday. Silas packed a lot into his four seasons with the Celtics (1972-76). He was part of two NBA championships (1974, 1976) and appeared in the All-Star Game in 1975.\n\n\r\n              TIP-INS:\n\n\r\n              Magic: Orlando entered Friday with one road win in 12 tries. \n\n\r\n              Celtics: Horford returned to the lineup on Friday after missing the previous five games. He wasn’t around for the finish after being assessed a flagrant-two foul at 10:39 of the third quarter. At the time of the ejection, Horford had six points and six rebounds in 16 minutes. … Friday marked the start of a seven-game homestand for Boston after a six-game trip. \n\n\r\n              UP NEXT\n\n\r\n              The teams meet again in Boston on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994644.3789928
}