{
  "game_id": "0022400478",
  "espn_id": "401705044",
  "date": "Jan 04, 2025",
  "matchup": "BKN vs. PHI",
  "headline": "Embiid powers 76ers to a 123-94 victory over the short-handed Nets",
  "body": "NEW YORK -- — Joel Embiid had 28 points and 12 rebounds, and the Philadelphia 76ers beat the Brooklyn Nets 123-94 on Saturday night.\n\n\r\n              Tyrese Maxey added 18 points and Paul George and Caleb Martin each had 17 for the 76ers, who snapped a two-game losing streak.\n\n\r\n              Ziaire Williams had 19 points and Keon Johnson chipped in 15 for the short-handed Nets, who have lost 12 out of their last 16 games.\n\n\r\n              Brooklyn was playing without starters Cam Thomas (left strained ankle), Cam Johnson (right sprained ankle) and Ben Simmons (sore left calf).\n\n\r\n              The injuries to Thomas and Cam Johnson took place during Thursday’s victory at Milwaukee while Simmons was ruled out just before tip-off.\n\n\r\n              Philadelphia fell behind 11-0 with 10:20 remaining in the opening period before blitzing the Nets with a 29-8 run to close out quarter.\n\n\r\n              The 76ers kept the rhythm going in the second quarter, shooting 57% to take a 64-47 lead heading into the break.\n\n\r\n              Takeaways\r\n              76ers: Philadelphia had 31 assists on 42 of the shots that were made. Maxey had seven assists, while Embiid and George contributed six apiece.\n\n\r\n              Nets: The team said Cam Johnson will miss the next three games, and that he and Thomas will also be evaluated again during the upcoming western trip that starts Friday in Denver.\n\n\r\n              Key moment\r\n              The 76ers trailed 13-9 when Embiid got called for a technical foul after he got tangled up with Keon Johnson, who refused to let go off the ball under the basket. Embiid, who had missed his first two shots of the game, then scored three consecutive baskets and finished the first quarter with 15 points on 6-for-9 shooting.\n\n\r\n              Key stat\r\n              Embiid hit all 10 free throws.\n\n\r\n              Up next\r\n              The 76ers return home Monday to host Phoenix, while the Nets host Indiana.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997990.426272
}