{
  "game_id": "0022000133",
  "espn_id": "401267293",
  "date": "Jan 09, 2021",
  "matchup": "PHI vs. DEN",
  "headline": "Denver tops short-handed 76ers hit with virus, injuries",
  "body": "PHILADELPHIA -- — The Philadelphia 76ers opened the week with the best record in the NBA — and now face an uncertain future with a starting lineup fit for the preseason.\n\n\r\n                    Nikola Jokic had 15 points and 12 assists to lead the Denver Nuggets past Philadelphia 115-103 on Saturday, beating a 76ers team that had only seven available players.\n\n\r\n                    “COVID created this but the concern is not COVID now,” Sixers coach Doc Rivers said. “The concern is injuries.”\n\n\r\n                    The Sixers tipped without four regular starters — All-Stars Ben Simmons (sore left knee) and Joel Embiid (back) sat due to injury, and Seth Curry and Tobias Harris over virus concerns. Curry tested positive for the virus Thursday, and the ensuing contact tracing and COVID-19 health and safety protocols led to a slew of unavailable players.\n\n\r\n                    The team met the minimum eight active players by including injured forward Mike Scott, who was not actually able to play.\n\n\r\n                    Rivers said he didn’t think the game should be played.\n\n\r\n                    “We’ve got be very careful in how we navigate the next week,” Rivers said.\n\n\r\n                    Tyrese Maxey, Philadelphia's 2020 first-round pick out of Kentucky, scored 39 points in 44 minutes on 18-of-33 shooting in his first career start. Isaiah Joe had 13 points.\n\n\r\n                    “I had to hunt my shot just a little more because it was needed,” Maxey said.\n\n\r\n                    Gary Harris scored 21 points for the Nuggets, who played without Michael Porter Jr. (19.5 points per game) because of health and safety protocols.\n\n\r\n                    Danny Green was the only regular in Philly’s starting lineup, joined by backups Dakota Mathias, Dwight Howard, Joe and Maxey. Mathias and Joe also made their first career NBA starts. Mathias, Maxey and Joe all played at least 41 minutes.\n\n\r\n                    “It was a good thing for the team even though I still hate losing,” Rivers said.\n\n\r\n                    The Sixers play Monday in Atlanta, the first of five games in seven days, and the roster may not change much. Curry will miss five more games at least. Harris and reserves Shake Milton, Matisse Thybulle and Vincent Poirier could miss at least a week because of the protocols.\n\n\r\n                    “We don’t know anything,” Rivers said. “I don’t know enough about any of this.”\n\n\r\n                    The team was forced to spend Friday in New York after playing at Brooklyn on Thursday and underwent additional testing before arriving back in Philadelphia at 1 a.m. — 14 hours before the afternoon tipoff.\n\n\r\n                    “The last 36 hours have been nuts,” Rivers said.\n\n\r\n                    Sparked by Maxey, the undermanned, feisty Sixers stuck with Denver throughout the first half. Maxey scored on a fastbreak dunk and Joe hit consecutive 3s to tie the game at 26. A 13.5-point favorite, the Nuggets led only 28-26 at the half before foul trouble caught up with Philadelphia.\n\n\r\n                    The Nuggets were off to a slow start at 3-5 but got a chance to regroup against the Sixers and took control in the third. Harris hit two 3s, the Nuggets shot 68% (13 of 19) and outscored the Sixers 35-21.\n\n\r\n                    “It seems like every time we get off to a good start and build a lead, we get kind of lax in our approach and allow teams to get back in the game rather quickly,” Nuggets coach Michael Malone said.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Maxey’s 22 points were the most in the first half for a Sixer this season. ... Howard moved into 13th on the NBA’s career rebounds list.\n\n\r\n                    Nuggets: Jamal Murray and Will Barton each scored 14 points.\n\n\r\n                    ALL-STAR ABSENCE\n\n\r\n                    Simmons and Embiid sat out with previously undisclosed injuries.\n\n\r\n                    “Joel started complaining about his back, that started yesterday,” Rivers said. “And we didn’t know if he was playing or not but honestly, with the minutes we would have to ask, it would be insane to play him tonight.”\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: With seven players or more, the 76ers are set to play Monday in Atlanta.\n\n\r\n                    Nuggets: Play Saturday in New York.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997108.241735
}