{
  "game_id": "401810132",
  "espn_id": "401810132",
  "date": "Nov 23, 2025",
  "matchup": "BOS vs ORL",
  "headline": "Jaylen Brown's 35 points lead Celtics in a 138-129 victory over the short-handed Magic",
  "body": "BOSTON -- — Jaylen Brown scored 35 points and Josh Minott scored 12 of his 16 points in the second quarter when Boston shot 81.8% as the Celtics beat the short-handed Orlando Magic 138-129 on Sunday night.\n\n\r\n              Anfernee Simons added 23 points and Payton Pritchard chipped in with 19 and eight assists for the Celtics, who were coming off a tough home loss to Brooklyn on Friday. Brown also had eight assists.\n\n\r\n              The Celtics nearly squandered a 26-point, third-quarter lead. But, Brown scored 12 straight points. The Magic whittled away at their deficit and closed within six points in the final minute.\n\n\r\n              Jett Howard scored a season-high 30 points for the Magic, who were missing three of their top five scorers and had their three-game winning streak snapped. Desmond Bane had 18 points and Franz Wagner 15.\n\n\r\n              Orlando coach Jamahl Mosley was back back after missing the second half of a victory over the New York Knicks on Saturday due to illness.\n\n\r\n              Boston connected on 18 of 22 shots in the second quarter, turning a five-point lead after one period into an 80-57 edge at halftime.\n\n\r\n              Minott was 5 for 5 from the floor, connecting on two attempts from 3-point range.\n\n\r\n              Pritchard keyed a quick 10-3 spurt with a steal and layup before hitting a 3-pointer from the right corner 11 seconds later that made it 66-49. He also made a mid-range jumper with two seconds left in the half, capping the Celtics’ 48 points in the period.\n\n\r\n              Coming off the victory at home against the Knicks, the Magic seemed a bit sluggish and had their franchise record-tying string of eight straight quarters of 30-or-more points end in the opening quarter as they were held to 27 points.\n\n\r\n              Up next\r\n              Magic: At the Philadelphia 76ers on Tuesday in the second game of a three-game trip.\n\n\r\n              Celtics: Host the Detroit Pistons on Wednesday.\n\n\r\n              \r\n                ------\r\n              \n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042681.418002
}