{
  "game_id": "0022400993",
  "espn_id": "401705559",
  "date": "Mar 18, 2025",
  "matchup": "ATL @ CHA",
  "headline": "Trae Young scores 31 as Hawks rout Hornets 134-102 to sweep 4-game season series",
  "body": "CHARLOTTE, N.C. -- — Trae Young scored 31 points, Dyson Daniels added 22 points, seven rebounds and seven assists and the Atlanta Hawks clobbered the short-handed Charlotte Hornets 134-102 on Tuesday night to sweep the four-game season series.\n\n\r\n              Zaccharie Risacher knocked down four 3s in the second half to finish with 21 points for the Hawks, who snapped a two-game skid.\n\n\r\n              DaQuan Jeffries and Seth Curry each had 19 points for Charlotte, which played without LaMelo Ball and Miles Bridges.\n\n\r\n              The Hawks led 70-57 at halftime, then Risacher hit four 3s in the third quarter — including three on three consecutive possessions — to quickly push the lead to 26. Atlanta’s lead ballooned to 100-65 late in the third quarter after Young hit a deep 3.\n\n\r\n              Risacher finished the third quarter with 16 points on 6-of-7 shooting, along with three rebounds, a block and an assist.\n\n\r\n              Takeaways\r\n              Hawks: The Hawks entered the night 5 1/2 games behind the Detroit Pistons for sixth place in the East but still have time to make a run at them. But they'll need to win the easy games and they took care of business against the Hornets.\n\n\r\n              Hornets: As if the Hornets needed anymore injury problems, backup center Moussa Diabate had to be helped off the court with about four minutes to play with a lower-body injury.\n\n\r\n              Key moment\r\n              Onyeka Okongwu had 10 points in the first four minutes to set the tone as the Hawks bolted to a 20-7 lead and never looked back. He finished with 15 points and 10 rebounds.\n\n\r\n              Key stat\r\n              Atlanta made 22 of 45 3-pointers. \n\n\r\n              Up next\r\n              The Hawks host the Warriors on Saturday and the Hornets host the Knicks on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997916.212045
}