{
  "game_id": "0022400961",
  "espn_id": "401705527",
  "date": "Mar 14, 2025",
  "matchup": "DAL @ HOU",
  "headline": "Eason's career-high 30 helps Houston Rockets extend win streak to 5 games with rout of Dallas",
  "body": "HOUSTON -- — Tari Eason scored a career-high 30 points to lead the Houston Rockets to an easy 133-96 win over the Dallas Mavericks Friday night.\n\n\r\n              Jalen Green added 23 points with nine rebounds, despite sitting the entire fourth quarter to help the Rockets to their fifth straight win, tying their longest such streak of the season. \n\n\r\n              Houston led by double digits most of the night and was up by 16 in the third quarter before scoring the next seven points, with a 3 from Eason, to make it 80-57 midway through the quarter.\n\n\r\n              The Rockets were up by 21 later in the third before using a 10-0 run to push the lead to 96-65 near the end of the period, and most of their starters didn't play in the fourth. \n\n\r\n              Brandon Williams scored 25 points off the bench for the Mavericks as they lost for the seventh time in eight games. Klay Thompson was 2 of 16 for five points with nine rebounds.\n\n\r\n              Takeaways \r\n              Mavericks: Dallas continues to struggle with most of its top players out with injuries and lost another one Friday with coach Jason Kidd saying that Dante Exum sustained a broken left hand that will likely end his season.\n\n\r\n              Rockets: Houston has taken advantage of a schedule with six straight home games, going 4-0 so far on the homestand as it tries to climb the Western Conference standings.\n\n\r\n              Key moment\r\n              Houston was in control of the game from the start but put it out of reach with its 37-point third quarter.\n\n\r\n              Key stat\r\n              The Rockets had 29 second-chance points to just two by Dallas on a night Houston had a 17-6 advantage in offensive rebounds. \n\n\r\n              Up next\r\n              Houston hosts Chicago on Saturday night and Dallas hosts Philadelphia on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997142.292565
}