{
  "game_id": "0022000384",
  "espn_id": "401267544",
  "date": "Feb 10, 2021",
  "matchup": "ATL @ DAL",
  "headline": "Doncic, Mavericks rally in 4th for 118-117 win over Hawks",
  "body": "DALLAS -- — Luka Doncic and the Dallas Mavericks were trying to hang on to a one-point lead in the final seconds after rallying in the fourth quarter against Atlanta.\n\n\r\n                    Trae Young never got a chance to answer for the Hawks.\n\n\r\n                    Doncic had 28 points, 10 assists and 10 rebounds, and Young was knocked down setting a screen on the final play as the Mavericks beat the Hawks 118-117 on Wednesday night, a week after ending a six-game losing streak in Atlanta.\n\n\r\n                    With Young on the ground after Willie Cauley-Stein ran into him, Danilo Gallinari ended up with the ball and missed a jumper just before the buzzer.\n\n\r\n                    Atlanta coach Lloyd Pierce thought Young was fouled and said an official told him it was an illegal screen. Pierce and Young disagreed.\n\n\r\n                    “The play was for me to get the ball,” said Young, who finished with 25 points and 15 assists. “I’m not going to run away from the ball with four seconds left and we’re trying to win the game. I’m not going to just fall at the end. That’s the most frustrating part is not really having the opportunity to make a play at the end.”\n\n\r\n                    Crew chief Josh Tiven told a pool reporter the crew felt the contact was incidental, and therefore no foul was called.\n\n\r\n                    “After reviewing the play postgame, we still feel that a no-call was the correct decision,” Tiven said.\n\n\r\n                    Cauley-Stein said he didn't see Young, adding he didn't think there was any way the Atlanta guard would get the call when the Hawks would have had free throws to take the lead and maintain possession.\n\n\r\n                    “Good try, though,” Cauley-Stein said. “That was smooth. It was sneaky.”\n\n\r\n                    Tim Hardaway Jr. scored 13 of his 16 points in the fourth quarter to spark the comeback, starting with a quarter-opening 3 to get the Mavericks within six after they trailed by 13 in the third. Dallas won its third straight and fourth in five games.\n\n\r\n                    John Collins scored 33 points for the Hawks, who have lost four of five in a stretch that included a 122-116 Dallas win in Atlanta that ended the Mavericks' longest skid since 2019. Kevin Huerter scored a season-high 23 points for the Hawks.\n\n\r\n                    Dallas played the national anthem before the game for the first time this season, a day after owner Mark Cuban revealed he had decided not to play “The Star-Spangled Banner.” \n\n\r\n                    The NBA initially said teams had been given latitude for pregame activities in the coronavirus pandemic before reversing course and declaring all teams would play the anthem before games, as news of Cuban's decision sparked a national conversation.\n\n\r\n                    Most teams aren't playing in front of fans, but this was the second of the season for the Mavs to have up to 1,500 vaccinated essential workers attending for free.\n\n\r\n                    Jalen Brunson, who scored 11 of his 21 points in the fourth quarter, put Dallas ahead for good on a jumper for a 111-109 lead with less than four minutes to go and assisted on a 3-pointer by Dorian Finney-Smith for a four-point lead before Young answered with a 3 in the final minute.\n\n\r\n                    Hardaway scored seven points in the first minute and a half of the fourth quarter after assistant Jenny Boucek went to coach Rick Carlisle and said the Mavericks needed to get the guard a shot. He was 5 of 6 in the fourth, making all 3 of his 3s.\n\n\r\n                    “We set up a play, we got him a shot and he banged in a 3 and that kind of got the team going,” Carlisle said. “It got us going. It got the fans in the building going. It ignited our defense and a lot of good things happened after that.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Coach Lloyd Pierce said F De'Andre Hunter was going through strength work after surgery on his injured right knee. ... Clint Capela's NBA-best streak of 19 straight games with at least 10 rebounds ended because of foul trouble. He picked up his fourth foul early in the third quarter and had seven rebounds.\n\n\r\n                    Mavericks: Doncic had his NBA-leading seventh triple-double. ... Kristaps Porzingis was in foul trouble but finished with 15 points. ... Cauley-Stein scored 14 points and was a plus-19, with Carlisle crediting his defense for the fourth-quarter rally and praising the effort after sitting for consecutive games. \n\n\r\n                    LATE FIRST SURGE\n\n\r\n                    The Hawks led 62-52 at halftime after finishing the first half on a 14-4 run that started when Young hit a 3-pointer as Porzingis ran into him for his third foul. Young, an 89% free throw shooter, didn’t convert that four-point play but hit another 3 just before Doncic also picked up his third foul to join Porzingis on the bench in the final two minutes of the first half.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Atlanta plays San Antonio at home Friday. The Hawks swept the two-game series with the Spurs last season for the first time since 1996-97.\n\n\r\n                    Mavericks: The Pelicans visit Friday in the first meeting of the season after a Jan. 11 game in New Orleans was postponed by COVID-19 protocols. The Mavericks swept the four-game series last season, their first sweep of the Pelicans since 2013-14.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997842.6678772
}