{
  "game_id": "0022300930",
  "espn_id": "401585558",
  "date": "Mar 10, 2024",
  "matchup": "BKN @ CLE",
  "headline": "Cam Thomas scores 29 points, Nets pull away to beat injury-riddled Cavaliers 120-101",
  "body": "CLEVELAND -- — Cam Thomas scored 29 points in 31 minutes, Mikal Bridges had 25 points and the Brooklyn Nets pulled away to beat the injury-riddled Cleveland Cavaliers 120-101 on Sunday night.\n\n\r\n              Dennis Schroder added 17 points and eight assists, and Nic Claxton had 16 points and 10 rebounds for Brooklyn, which built a 26-point lead midway through the fourth quarter. The Nets only trailed for 1:41 in the game, all early in the third period.\n\n\r\n              “This game, I had to get out of my comfort zone, get the team fired up and lead the guys by example,” said Thomas, who also had seven rebounds and five assists. “Cleveland always tries to take away the mid-range a little bit, but with certain lineups, I can be a little more aggressive.”\n\n\r\n              Georges Niang scored 20 points and Jarrett Allen had 15 points and nine rebounds for Cleveland, which fell a half-game behind Milwaukee into third place in the Eastern Conference. Darius Garland had 14 points and five assists.\n\n\r\n              “We just never really got out of the mud,” Niang said. “We never really seemed to get it rolling tonight.”\n\n\r\n              Cavaliers shooting guard Donovan Mitchell missed his sixth straight game because of soreness in his left knee, but resumed on-court work earlier in the day. The five-time All-Star is the fifth-leading scorer in the NBA at 28.0 points per game.\n\n\r\n              Cleveland also was without two additional starters in forwards Evan Mobley (left ankle sprain) and Max Strus (right knee strain), along with backup big man Dean Wade (personal reasons).\n\n\r\n              “Our guys competed and I’m proud of them, but at some point in time, you just run out of gas,” Cavaliers coach J.B. Bickerstaff said. “The third quarter kind of broke our back.”\n\n\r\n              The Cavaliers took their first lead at 53-52 on Isaac Okoro’s layup to open the second half, but the Nets answered with a 44-27 run behind 11 points apiece from Thomas and Bridges. Thomas and Schroder each made 40-footers during the surge.\n\n\r\n              “Cam displayed it all tonight, it wasn’t just his scoring, he was contributing in other ways,” Brooklyn interim coach Kevin Ollie said. “We want him to be a masterpiece on offense and a masterpiece on defense. Just his toughness, his resiliency, it means the world for us.”\n\n\r\n              The Nets are 1-2 on a six-game trip that ends March 17 against San Antonio in Austin, Texas. Brooklyn only plays one home game between March 7-27 -- on March 19 against New Orleans -- and is 3 1/2 games out of the final play-in tournament spot.\n\n\r\n              “If we want to get in the play-in, we just have to do it,” Thomas said. “That’s all there is to it. I’m tired of all the talking about energy after games.”\n\n\r\n              Nets guard Lonnie Walker IV had four points after sitting out Saturday at Charlotte with an illness, but forward Cam Johnson missed his third consecutive game with a sprained right ankle. Ollie said Johnson is considered day-to-day.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Orlando on Wednesday night.\n\n\r\n              Cavaliers: Host Phoenix on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996328.153186
}