{
  "game_id": "0021500577",
  "espn_id": "400828464",
  "date": "Jan 13, 2016",
  "matchup": "CHA vs. ATL",
  "headline": "Walker scores 23 as Hornets rout Hawks 107-84",
  "body": "CHARLOTTE, N.C. --  Steve Clifford wasn't surprised that the Charlotte Hornets finally broke out of their seven-game losing streak Wednesday night.\n\nThat it came against the Atlanta Hawks -- well, that did catch the Hornets coach by surprise.\n\n\"We've really struggled against them since I've been here, especially trying to defend them,\" Clifford said after Charlotte's 107-84 victory over the Hawks.\n\n\"So it feels good to win. We started the game better, after we struggled in the first quarter in the last four (games). That was probably as complete a game as we've played all year,\" he said.\n\nKemba Walker scored 23 points, Cody Zeller added 19 points and 10 rebounds, and Jeremy Lin had 19 for the Hornets, who led by as many as 35 points.\n\n\"We did it from start to finish,\" Walker said. \"We came out aggressive, came out some great intensity and some great togetherness. We played some good defense from the start, and maintained it. We came out with a big win.\"\n\nLeading by 45-36 at halftime, Charlotte stretched its lead to as many as 22 points in the third quarter, then opened the fourth quarter with a 21-8 run.\n\n\"This was an important game for us to kind of put that road trip behind us,\" Zeller said. \"We knew we had to get off to a good start to beat this team. We kind of carried it all through. To come out and play defense the way we did tonight was a big key for us.\"\n\nAtlanta entered Wednesday's game with a winning track record against Charlotte -- three straight wins, four of the past five and 15 of their past 18 games.\n\nBut the Hawks led just once Wednesday and struggled nearly the entire game against the Hornets. Paul Millsap scored 20 points for Atlanta, which shot just 37 percent from the field, and made just 7 of 25 3-pointers.\n\n\"Our whole group did not play well,\" Hawks coach Mike Budenholzer said. \"(Charlotte was) the aggressive team. . Our entire group, from top to bottom, I don't think anybody feels real great about how we played.\n\n\"Give them a lot of credit -- their activity on both ends of the court was indicative of how they pretty much had us one our heels the whole night.\"\n\nTIP-INS\n\nHawks: Only led once, when Millsap scored the game's opening basket with 11:33 left in the first quarter. . Jeff Teague and Kent Bazemore were held to nine points each, and Al Horford finished with just two points and two rebounds.\n\nHornets: Nicolas Batum scored just six points, all in the second half, but finished with 10 assists. . Averaging a league-low 12.9 turnovers per game, had 13 alone in the first half and 18 for the game. . Shot 43.9 percent from the field (36 of 82), and made 13 of 40 3-pointers. . Also had a 54-37 rebounding advantage.\n\nFG FAILURES\n\nBoth teams had long stretches in the first quarter where a field goal couldn't be bought.\n\nThe Hawks went nearly 6 1/2 minutes early in the period between baskets, allowing Charlotte to take a 17-4 lead.\n\nBut the Hornets went through their own dry spell later in the quarter, going the final 6 minutes, 19 seconds without a field goal.\n\nThat allowed Atlanta, which went 7 of 9 from the field over the span, to close to within 20-19 at the end of the period.\n\nPEP TALK\n\nHornets owner Michael Jordan -- the one with six NBA championship rings and five NBA Most Valuable Player awards -- spoke to the players after practice Tuesday.\n\nIt may have been the impetus behind Wednesday's win over the Hawks.\n\n\"We all know what he's done through his career, but the first thing he told he was `I've been through that before, too,\" Batum said.\n\n\"He said, `All the players in this league go through tough situations -- can't win, can't get anything going your way, got injuries, can't make a shot. It happens. The only thing we can do it stick together. We can't fall apart and start pointing fingers. No, we've got to take care of ourselves.\"\n\nUP NEXT\n\nHawks: Visit Milwaukee on Friday night.\n\nHornets: Visit New Orleans on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994382.922406
}