{
  "game_id": "0022300031",
  "espn_id": "401584119",
  "date": "Nov 17, 2023",
  "matchup": "TOR vs. BOS",
  "headline": "White hits tiebreaking 3, Celtics hold on to beat Raptors 108-105 in tournament game",
  "body": "TORONTO -- — Derrick White made a tiebreaking 3-pointer with 26.8 seconds remaining in the fourth quarter and the Boston Celtics recovered after blowing a 16-point halftime lead to beat the Toronto Raptors 108-105 in an NBA In-Season Tournament game on Friday night.\n\n\r\n              Jaylen Brown scored 23 points and Kristaps Porzingis added 14 points and 12 rebounds as the Celtics won their sixth straight meeting with Toronto. Jayson Tatum scored 17 points for Boston, Jrue Holiday had 14 and White 13.\n\n\r\n              Sam Hauser and Al Horford each scored 11 points. Boston improved to 2-0 in tournament play after beating Brooklyn last Friday. The Celtics have won five straight overall.\n\n\r\n              “I felt like we did a good job tonight, but I thought it was one of our lesser performances,” Boston coach Joe Mazzulla said. “It was the first time last year where we just weren’t the best version of ourselves.”\n\n\r\n              White agreed that the Celtics weren’t at their best against the Raptors.\n\n\r\n              “I kind of felt like we didn’t really have that extra gear, or that gear that we’ve been playing with for the year so far,” White said. “Sam came in and made some big shots, Al made some big shots. It’s just finding a way to win when you don’t have that gear.”\n\n\r\n              Brown (non-COVID illness) and Porzingis (right knee) returned after sitting out Wednesday’s win at Philadelphia.\n\n\r\n              Brown said he strained his groin “a little bit” when he slipped on the court late in the game. He was one of several players to lose their footing on the special tournament court. \n\n\r\n              A frustrated Brown said the condition of Toronto's black and gray court was “kind of unacceptable.”\n\n\r\n              “The court was just slippery all game,” Brown said. “As players, we’re all here for the in-season tournament because it’s going to generate revenue, excitement, competition, et cetera. But you’ve got to make sure the floor is safe to play on. We can’t put our players out there and risk their health.”\n\n\r\n              Brown said he had no problem with Boston’s tournament court last Friday, but said he’s heard from other players around the NBA that they’ve been slipping on tournament courts.\n\n\r\n              “I think they need to make sure that’s an emphasis before somebody gets seriously hurt,” Brown said.\n\n\r\n              Raptors forward Precious Achiuwa said he slipped “a few times” against the Celtics. Achiuwa strained his left groin during training camp and has missed five games because of the injury.\n\n\r\n              “Coming back (from injury), I’m extra cautious,” Achiuwa said.\n\n\r\n              Toronto’s Scottie Barnes got open for a 3-pointer with 11 seconds left that would have tied the game, but his shot bounced off the rim.\n\n\r\n              Pascal Siakam and Dennis Schroder each scored 23 points in a losing cause as Toronto made its tournament debut, the last NBA team to do so. Gary Trent Jr. and Barnes both scored 14 points and Jakob Poeltl had 11. \n\n\r\n              Toronto’s O.G. Anunoby missed his third straight game because of a cut finger on his right hand, while Otto Porter Jr. was unavailable because of personal reasons.\n\n\r\n              Trent started after missing the previous three games because of plantar fasciitis in his right foot.\n\n\r\n              Buffalo Bills safety Damar Hamlin and musician Fat Joe attended the game.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Visit the Grizzlies on Sunday. Memphis guard Marcus Smart won’t face his former team because of a sprained left foot\n\n\r\n              Raptors: Host Detroit on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995457.2283058
}