{
  "game_id": "0021500751",
  "espn_id": "400828638",
  "date": "Feb 05, 2016",
  "matchup": "CHA vs. MIA",
  "headline": "Whiteside gets triple-double as Heat hold off Hornets 98-95",
  "body": "CHARLOTTE, N.C. -- Miami Heat center Hassan Whiteside did his part to prevent the Charlotte Hornets from scoring inside.\nMix in a couple of key steals in the final seconds, and the Heat had a nice win on the road.\n\nWhiteside had 10 points, 10 rebounds and 10 blocked shots, and Miami beat Charlotte 98-95 on Friday night.\nDwyane Wade scored 22 points and Chris Bosh added 20 points for the Heat, who have won six of seven. Goran Dragic had 12 points, nine assists and eight rebounds.\nWhiteside, a native of nearby Gastonia, North Carolina, posted his third triple-double of the season and No. 4 for his career.\n\"I was at the YMCA around the corner two years ago; now I'm here,\" Whiteside said. \"When a ball is around my elbow area, I'm going to try and catch it.\n\"The last three minutes, they were so worried about pump-faking, pump-faking. I told the guys to just stay with the 3-point shooters.\"\nMarvin Williams scored 27 points for the Hornets, and Nicolas Batum added 21. Kemba Walker had 20 points.\n\"Whiteside just dominated every aspect of that game,\" Hornets coach Steve Clifford said. \"Right now, he's the premiere rim protector in the league. It changed the game when he came in; they were a totally different team when he was out there.\"\nThe Heat were coming off a close 93-90 win at Dallas on Wednesday. The last time Miami played at Time Warner Cable Arena on Dec. 9, Charlotte won 99-81.\n\"It's hard not to notice what they've done on this home court,\" Heat coach Erik Spoelstra said. \"It seems that every top team in the East that comes in here walks out of here with a double-digit loss.\n\"It was something that we wanted to collectively do -- get a win to put us at .500 on the road, and in a building that we haven't played well.\"\nThe Hornets led 93-90 with 1:10 remaining, but Wade made a layup and Bosh added a three-point play to make it 95-93 with 23.5 seconds left.\nCharlotte had a chance to tie it, but Justise Winslow's steal set up a free throw by Luol Deng for a 96-93 advantage with 13.2 seconds left.\nWade then stole the ball from Walker and passed to Deng for a fast-break dunk with 4.3 seconds remaining and the Heat's biggest lead of the game.\nBefore Miami's flurry at the very end, neither team was able to grab much of an advantage. There were 26 lead changes and 12 ties, including 47-47 at halftime.\n\"We know we have to get stops,\" Wade said. \"We know we have enough offensive firepower down the stretch to get great looks. Tonight, Hassan was incredible down the stretch with protecting the basket.\"\nTIP-INS\nHeat: Winslow had eight points and 10 rebounds. ... Miami finished with 12 blocked shots. ... The Heat outscored the Hornets 64-32 in the paint, and also enjoyed an 18-6 edge in second-chance points thanks to eight offensive rebounds.\nHornets: Shot 44.4 percent from the field (36 of 81), and made 10 of 26 3-pointers. ... Also shot 13 of 15 from the free-throw line. ... Charlotte's reserves scored just 12 points, while Miami got 29 points from its backups.\nNO TREYS FOR HEAT\nMiami went 0 for 9 from 3-point range. The last time Miami failed to hit a 3-pointer was May 13, 2012, when it was 0 for 6 from long range in a second-round playoff win over the Indiana Pacers, 95-86.\nThe last time it happened in the regular season was March 7, 2012, when the Heat went 0 for 10 while beating the Atlanta Hawks 89-86.\nHONORING `ZO'\nFormer Hornets star and 15-year NBA veteran Alonzo Mourning, now the vice president of player programs and development for the Heat, was honored by the home team during halftime of Friday's game.\nWhile he spent only three seasons in Charlotte (1992-1995), Mourning still holds franchise records for career blocks (684) and blocks per game (3.2), and is second in career scoring (21.3 points) and rebounds (10.1 per game).\nUP NEXT\nHeat: Host the Los Angeles Clippers on Sunday.\nHornets: Host the Wizards on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994375.632339
}