{
  "game_id": "0022201217",
  "espn_id": "401469372",
  "date": "Apr 09, 2023",
  "matchup": "BKN vs. PHI",
  "headline": "76ers beat Nets 134-105 before they meet in the playoffs",
  "body": "NEW YORK -- — Shake Milton couldn't wait for next weekend. Once Cam Thomas got hot, Milton started competing at a playoff level even in an otherwise meaningless finale. \n\n\r\n              The 76ers guard scored 20 points and chased Thomas all over the floor in the fourth quarter to keep him at 46 points, and Philadelphia beat the Brooklyn Nets 134-105 on Sunday. \n\n\r\n              “I just tried to take the challenge,” Milton said. “Didn’t want him to get 50. Tried to get everybody to be on the same page to not let him get 50. But that’s just part of the competitive nature, that’s all.” \n\n\r\n              The teams face each other next weekend to begin the first round of the NBA playoffs. Doc Rivers joked that all he wanted from the game was to go quickly enough so he could watch the Masters, but saw what it meant to his players when they started double-teaming Thomas without asking him.\n\n\r\n              “We went into our playoff prevent defense,” he said. \n\n\r\n              Mikal Bridges was the only starter for either team to play, and he did so for just four seconds. It was his 83rd game starting this season, extending his streak to 392 straight to begin his career. Then he committed a foul and left the game.\n\n\r\n              The rest of the day belonged to the backups, with scoring championship Joel Embiid and assist leader James Harden waiting until next weekend to suit up again.\n\n\r\n              Thomas reached 40 points for the fourth time this season after doing it in three consecutive games in early February before falling out of the rotation after the Nets brought in four new starters in the trades for Kevin Durant and Kyrie Irving. \n\n\r\n              He had 42 after three quarters Sunday and made two quick baskets after checking back into the game with 9:16 remaining. Milton soon after began defending the Nets guard well away from the basket, even when he didn't have the ball.\n\n\r\n              Even after Milton departed in the final minutes, the 76ers continued running second defenders at Thomas to keep him from scoring again, adding some spice to an otherwise meaningless matchup.\n\n\r\n              “It is what it is,” Thomas said. “Final game, last game of the season. We’ve got another season coming up so hopefully we can get them then.” \n\n\r\n              Their first-round series was set up Friday when the Nets clinched the No. 6 seed. The Sixers had already been resting their top players and the Nets were finally able to do the same Sunday. \n\n\r\n              Nets coach Jacque Vaughn let Bridges play to extend his ironman streak, but with instructions to foul quickly and get out of the game. Once the 76ers won the opening tip, Bridges hurried over to grab Milton and was immediately subbed out. \n\n\r\n              After starting 56 games for Phoenix before coming to Brooklyn in the trade for Kevin Durant, Bridges started the Nets' final 27. He became the 42nd NBA player to play in 83 or more games in a season and the first since Josh Smith for Detroit and Houston in 2014-15.\n\n\r\n              That left a crowd featuring Julius Erving, who won titles with the Nets in the ABA and 76ers in the NBA, and Billie Jean King to watch All-Star slam dunk champion Mac McClung finished with 20 points, nine rebounds and nine assists for the 76ers.\n\n\r\n              TIP-INS\n\n\r\n              76ers: Philadelphia finished 54-28, its best record since going 56-26 in 2000-01 en route to the NBA Finals. ... The 76ers won all four meetings with the Nets this season. \n\n\r\n              Nets: Thomas joined Durant, Kyrie Irving, Vince Carter and John Williamson as Nets to score 40 or more four times in a season in the NBA. Carter did it three times and Irving twice. ... RaiQuan Gray, signed to a two-way contract Saturday, scored 16 points.\n\n\r\n              THE PLAYERS' CHOICE\n\n\r\n              Rivers relied on other players to make the case for why Embiid should win his first MVP award.\n\n\r\n              “It’s funny, when you hear from (Damian) Lillard said it the other day, Steph Curry said it,\" Rivers said. \"When you hear other players, and they rarely chime in on MVP, but when you hear other players chime in and they’re saying Joel because he’s the most dominant, they’re telling you something. They really are. They’re speaking it into existence.\" \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995107.091532
}