{
  "game_id": "0022201070",
  "espn_id": "401469225",
  "date": "Mar 19, 2023",
  "matchup": "ORL @ LAL",
  "headline": "Reaves gets career-high 35, pushes Lakers past Magic 111-105",
  "body": "LOS ANGELES -- — Austin Reaves scored a career-high 35 points, D’Angelo Russell added 18 points and the Los Angeles Lakers hung on for a 111-105 victory over the Orlando Magic on Sunday night.\n\n\r\n              Anthony Davis had 15 points and 11 rebounds on another rough shooting night, but Reaves carried the Lakers to victory with 13 points in the fourth quarter, including Los Angeles' last 10 points over the final 1:33. The undrafted second-year pro has earned a vital role his star-studded team, and Reaves factored in almost every big play down the stretch as the Lakers snapped a two-game skid.\n\n\r\n              Lakers fans serenaded Reaves with chants of “M-V-P! M-V-P!” as he repeatedly earned trips to the line in the fourth quarter. Reaves shot a career-high 18 free throws, while the Magic shot 17.\n\n\r\n              “For them to recognize what I do — obviously I'm not an MVP-caliber player, those guys are really good — but for them to do that is special,” Reaves said. “It means a lot to me.”\n\n\r\n              The Lakers entered this game off back-to-back losses to Houston and Dallas, imperiling their tenuous position in the playoff race. This win put Los Angeles (35-37) back in ninth in the Western Conference, tied with Minnesota.\n\n\r\n              “I thought it was (Reaves) being his normal self,” Lakers coach Darvin Ham said. “What he's been all year. Coming up in clutch moments for us, trying to make plays downhill, putting the defense in uncomfortable situations with his ability to attack the paint and draw fouls. He was great. He ended up with 35, and we needed all of them.”\n\n\r\n              Rookie Paolo Banchero scored 21 points for Orlando, but got an unwise technical foul with 25.3 seconds to play after repeatedly arguing with officials during the night.\n\n\r\n              “It just puts you in a hard situation when they’re calling it like that,” Banchero said. “You want to defend without fouling, but we keep getting called. We keep fouling, I guess. We keep getting foul calls against us, so it just makes it hard, but we still had a chance to win. You can’t blame it all on that.”\n\n\r\n              Franz Wagner also scored 21 points in the Magic's sixth loss in eight games to wrap up a four-game road swing. Wendell Carter Jr. had 16 points and 11 rebounds, but Orlando couldn't repeat the dominance of its 39-point fourth quarter in a victory over the Clippers one day earlier in the same arena.\n\n\r\n              \"It’s difficult, because I think we’re an aggressive, attacking team,” Orlando coach Jamahl Mosley said. “We’ve got to just, I guess, continue to do a better job of defending without fouling, show our help early and earn the respect of being able to get those calls.”\n\n\r\n              Cole Anthony hit a tying 3-pointer with 2:37 left for the Magic, who had trailed throughout the second half. Banchero fouled Reaves on a 3-point attempt a minute later, and Reaves hit two free throws before Wagner tied it again.\n\n\r\n              But Reaves hit a mid-range jumper with 57 seconds left and then grabbed the long rebound of Wagner's missed 3 before making two more free throws. Banchero missed a layup and got the technical foul that helped the Lakers to seal it.\n\n\r\n              The Lakers improved to 6-5 during the latest injury absence for LeBron James, who has been out for three weeks with a sore right foot. Ham reiterated before the game that Los Angeles expects James to return before the regular season ends in three weeks.\n\n\r\n              TIP-INS\n\n\r\n              Magic: Markelle Fultz had 12 points and 10 assists one night after dropping a career-high 28 points on the Clippers. ... Jalen Suggs missed his second straight game with an apparent concussion.\n\n\r\n              Lakers: Mo Bamba missed his seventh straight game with a high ankle sprain, preventing him from playing against the team that drafted him sixth overall in 2018 and traded him to Los Angeles at the deadline. ... The Lakers have won six consecutive meetings with Orlando.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host Washington on Tuesday.\n\n\r\n              Lakers: Host Phoenix on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994313.265524
}