{
  "game_id": "0021800713",
  "espn_id": "401071386",
  "date": "Jan 23, 2019",
  "matchup": "CHA @ MEM",
  "headline": "Walker, Batum lead Hornets over the Grizzlies 118-107",
  "body": "MEMPHIS, Tenn. --  The Charlotte Hornets have used a nice run to keep a grasp on one of the final Eastern Conference playoff spots.\n\nKemba Walker had 22 points and seven assists, Nicolas Batum scored 18 points, and the Hornets beat the Memphis Grizzlies 118-107 on Wednesday night for their fourth win in five games.\n\nJeremy Lamb and Tony Parker had 17 points each for Charlotte, which moved into the seventh spot in the East, a half-game ahead of eighth-place Miami, which lost to the Los Angeles Clippers 111-99 Wednesday night.\n\n\"Our energy's been good. Our togetherness has really come back the way it was early in the season,\" Walker said. \"We're just playing hard, playing the game with great energy from start to finish.\"\n\nWhile Charlotte is enjoying a nice run, Memphis continues to struggle both internally and on the court. The loss was the seventh straight for the Grizzlies and 13th in the past 14. The game was also the first since Grizzlies owner Robert Pera informed cornerstones Mike Conley and Marc Gasol they may be traded.\n\nThe two Memphis stars did their jobs -- Gasol with a triple-double on 22 points, 17 rebounds and 10 assists, and Conley adding 31 points -- but the Grizzlies couldn't threaten in the fourth quarter.\n\nCharlotte shot 53 percent from the field, including 12 of 30 from outside the arc. That included Batum converting 4 of 6 from 3-point range.\n\n\"I think defensively, we weren't very good,\" Memphis coach J.B. Bickerstaff said. \"Every time you looked up, they were in our paint. ... I think we scored enough points to win, but giving up 118 points, you don't give yourself a shot.\"\n\nJaren Jackson Jr. added 15 points for Memphis, and JaMychal Green finished with 14.\n\nCharlotte, which led 86-76 after three, never let the Grizzlies get closer than eight in the final quarter. Walker scored 15 of his points in the frame, keeping Memphis from getting closer down the stretch\n\n\"He's special. He does that in the fourth quarter when the pressure is on,\" Charlotte coach James Borrego said. \"That is his time to shine, and that's what All-Stars do -- top level players like him perform in those times.\"\n\nTIP-INS\n\nHornets: Batum's 3-pointer in the first quarter moved him past Deron Williams for 66th on the NBA's career 3-point list with 1,180. ... Marvin Williams passed Rex Chapman for 12th on the franchise's scoring list. ... Parker has reached double figures in scoring three of the past four games. ... The Hornets reserves outscored Memphis' bench players 41-24. Charlotte's subs average 44.5 points a game, third-best in the league.\n\nGrizzlies: Gasol recorded his fifth career double-double. ... The game started on time despite an electrical fire near the sauna in the Grizzlies locker room about three hours before game time, leaving a distinct smoky smell in FedExForum. ... Memphis was moved from its locker room to the Memphis Tigers dressing area. ... Conley had 15 points in the fourth quarter, matching his season-best scoring in the final frame. .Jackson reached double figures for the fourth-straight game.\n\nTRADE TALK\n\nBefore the game, Conley and Gasol addressed reports that Memphis planned to shop the duo, both of whom have been with Memphis their entire NBA careers. Neither expressed a desire to leave the franchise. Gasol said he didn't ask for a trade, and when asked if he was surprised by the reports, he replied: \"Uh, Irrelevant.\"\n\nConley said there was no indication that an eventual trade is a done-deal.\n\n\"It was just making us aware that our names would be thrown out there,\" he said. \"Not that one of us or both of us are going to be gone by next Tuesday or by All-Star break. I feel just as good about being here as the next person. I'm not worried right now. A lot can happen in a few weeks. Right now, I'm just taking it in stride.\"\n\nUP NEXT\n\nHornets: Face the Bucks in Milwaukee on Friday, the final stop of a three-game road trip\n\nGrizzlies: Host the Sacramento Kings on Friday\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994382.8645508
}