{
  "game_id": "0021400321",
  "espn_id": "400578613",
  "date": "Dec 10, 2014",
  "matchup": "POR @ MIN",
  "headline": "Wolves stun Blazers, powered by Andrew Wiggins' double-double",
  "body": "MINNEAPOLIS -- The Portland Trail Blazers had trimmed a 20-point deficit to four in the fourth quarter, and the young Minnesota Timberwolves looked a little jittery as they tried to hold off the charge.\nWhile his teammates scrambled, 19-year-old Andrew Wiggins was as calm as can be, and the No. 1 overall pick responded with the flurry that saved the night.\nWiggins scored five straight points at the game's most crucial moment, and finished with 23 points, 10 rebounds and four assists to help the Timberwolves stun the Trail Blazers with a 90-82 victory Wednesday night.\n\"The baby Wolves grew up a little bit,\" Timberwolves coach Flip Saunders said.\nCorey Brewer had 19 points, eight rebounds, five assists and five steals for the Timberwolves, who snapped a six-game losing streak and won for just the third time since Ricky Rubio went out with an injured ankle Nov. 7. They outrebounded Portland 56-38 to overcome four key players being out with injuries.\nDamian Lillard had 23 points and seven rebounds for the Trail Blazers. But LaMarcus Aldridge managed just 10 points on 3-for-14 shooting, and Portland turned the ball over 20 times and shot a season-low 38.8 percent. The Blazers scored 16 points in the second quarter and 15 in the third, their two lowest outputs of the season, and lost for just the second time in 16 games.\n\"We kind of were just like, 'We'll fix it, we'll fix it.' And they just kept doing it,\" Lillard said. \"So it was just a matter of them outcompeting us for most of the game until we actually made a run.\"\nPlaying on the second night of a back-to-back against a team missing Rubio, Nikola Pekovic, Kevin Martin and Mo Williams, the Blazers were sluggish throughout in a loss that could sting when they look back at it in April.\n\"You don't want to lose at all, and to lose right now with the West being so tight, it's tough,\" Aldridge said.\nAldridge missed his first six shots and went scoreless in the first half, Shabazz Muhammad attacked the step-slow Portland defense, and the Blazers turned the ball over five times in the first seven minutes of the second half to fall behind 60-40.\nThe Wolves closed the third quarter with a flurry as Wiggins thwarted a 3-on-1 break and fed Brewer for a 3-pointer that gave them a 66-51 lead going into the fourth.\nPortland still trailed 72-60 with 8:30 to play. Aldridge and Wesley Matthews hit back-to-back 3-pointers during a 10-4 surge that cut the deficit to four points.\nBut Wiggins made a jumper, a free throw and another pretty pull-up to push the lead back to nine points.\n\"I feel comfortable and I know my team is always going to be there,\" Wiggins said. \"We made plays together. It wasn't just me. Without them executing the plays, helping me get open, I wouldn't have found my shots.\"\nTIP-INS\nTrail Blazers: Aldridge's scoreless first half was his first since 2008. ... Chris Kaman had an eventful second quarter, stuffing Jeff Adrien on a dunk attempt and then getting dunked on by Muhammad in transition. ... Matthews scored 18 points.\nTimberwolves: Adrien was re-signed to another 10-day contract Wednesday. Saunders said the Wolves considered adding a guard instead with Williams ailing, but they felt they needed another big man because Gorgui Dieng is the only healthy center on the roster. Adrien had 11 boards in 26 minutes. ... Muhammad has been receiving acupuncture treatments to try to ease the soreness in his left ankle.\nBLAZERS STATEMENT\nLillard, Aldridge, Matthews, Will Barton and Dorell Wright joined the likes of Derrick Rose, LeBron James and Kobe Bryant in donning black T-shirts with \"I Can't Breathe\" in white letters in response to a grand jury not issuing an indictment in the death of Eric Garner, who died after being choked by a New York police officer in July. Lillard had the shirts shipped to Minnesota, and they arrived after Portland played in Detroit on Tuesday. The players wore them during the national anthem and introductions.\n\"I think it's good for our players to have a social conscience,\" coach Terry Stotts said.\nNO 3s\nThe Blazers have been among the most prolific 3-point shooters this season, and they let it fly against the Wolves. They shot a season-high 35 3s but made only 10, which was just 28.6 percent.\nUP NEXT\nTrail Blazers: At Chicago on Friday.\nTimberwolves: Host Oklahoma City on Friday.",
  "source": "espn_api",
  "crawled_at": 1764992096.5781262
}