{
  "game_id": "0021600581",
  "espn_id": "400900002",
  "date": "Jan 11, 2017",
  "matchup": "OKC vs. MEM",
  "headline": "Westbrook's 18th triple-double leads Thunder past Grizzlies",
  "body": "OKLAHOMA CITY --  Russell Westbrook made fewer than a third of his shots and still dominated the Memphis Grizzlies.\n\nOklahoma City's point guard posted his 18th triple-double of the season, and the Thunder defeated the Grizzlies 103-95 on Wednesday night.\n\nWestbrook shot just 6 of 19 and missed all seven of his 3-pointers, but finished with 24 points, 13 rebounds and 12 assists for the 55th triple-double of his career. He already has matched his total from last season less than halfway through this one, and his 2015-16 total was the most for an NBA player since Magic Johnson had 18 during the 1981-82 season.\n\nWestbrook isn't just rolling up stats. The Thunder are 15-3 this season and 33-3 the past two seasons when he gets a triple-double.\n\n\"People can get wrapped up in numbers and talk about numbers, and the numbers don't reflect winning,\" Oklahoma City coach Billy Donovan said. \"When Russell has gotten the triple-doubles, we've won, and that's what he, I think, is most focused about.\"\n\nEnes Kanter scored 19 points and Victor Oladipo added 16 for the Thunder, who won their third straight and avenged their worst loss of the season. Oklahoma City lost 114-80 in Memphis on Dec. 29, a game Westbrook was ejected from.\n\nMike Conley scored 22 points, and Zach Randolph and Chandler Parsons each scored 14 for the Grizzlies.\n\n\"It was just one of them games, man,\" Randolph said. \"We couldn't hit shots, but we were still in the game. We didn't play good at all. It was one of them games. Give them credit. They hit shots and we didn't. We didn't execute down at the end and they won.\"\n\nThe Thunder led 55-44 at halftime, but Memphis pulled to 59-58 midway through the third quarter. Westbrook got his 10th assist on a pass to Oladipo for a 3-pointer as the Thunder tried to regain their footing. Oklahoma City closed the quarter strong and led 75-67 heading into the fourth.\n\nWestbrook clinched his triple-double when he snagged his 10th rebound on a missed free throw in the fourth.\n\nThunder center Steven Adams got back to thwart a fast break, then blocked a 3-pointer by Conley. Oladipo made a 3 on the other end to put Oklahoma City up 93-86 with just more than a minute to play.\n\nWestbrook's teammates shot just under 50 percent from the field to make up for his rough shooting.\n\n\"Even with his numbers, it's really a complete and total team effort,\" Donovan said. \"Guys have got to put the basketball in the basket to get him assists. Steven and Enes screen to get him loose, to get him downhill to make plays. Everybody's kind of contributed.\"\n\nTIP-INS\n\nGrizzlies: Committed just three turnovers in the first half and 10 in the game. ... C Marc Gasol, the team's leading scorer at nearly 20 points per game, finished with nine on 4-for-12 shooting.\n\nThunder: G Semaj Christon, a reserve who played regular minutes while Cameron Payne was out with a broken foot, was inactive and hasn't played in three games since Payne returned as Westbrook's backup.\n\nSTAT LINES\n\nThe Thunder outrebounded the Grizzlies 53-39 and outscored them 23-12 from the free throw line.\n\nHIGHLIGHT REEL\n\nOklahoma City's Jerami Grant took a pass from Westbrook and threw down a wicked, two-handed, reverse jam with 30 seconds to play.\n\nQUOTABLE\n\nAdams, a New Zealander, on the defensive focus: \"Pretty much physicality, mate. That's what we try to do.\"\n\nUP NEXT\n\nGrizzlies: At the Houston Rockets on Friday.\n\nThunder: At the Minnesota Timberwolves on Friday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995290.762597
}