{
  "game_id": "0021600274",
  "espn_id": "400899724",
  "date": "Nov 30, 2016",
  "matchup": "PHX vs. ATL",
  "headline": "Knight scores 23, bench leads Suns to 109-107 win over Hawks",
  "body": "PHOENIX --  The Phoenix Suns' veterans are sometimes forgotten on a team with several players in their teens and early 20s. It was experienced players who made the difference Wednesday night, though.\n\nBrandon Knight scored 23 points off the bench and Phoenix reserves combined for 54 as the Suns held off the slumping Atlanta Hawks 109-107 thanks to a key fourth-quarter run.\n\nJared Dudley and P.J. Tucker added 17 points apiece for the Suns, who had lost four of five. Leandro Barbosa made three important baskets in the fourth.\n\n\"That's what we need from them, is stability,\" Phoenix coach Earl Watson said. \"Our young guys are going to have ups and downs, trying to make it as consistent as possible.\"\n\nEric Bledsoe's bank shot with 28.4 seconds left gave the Suns a 104-99 lead and all but sealed Atlanta's fourth consecutive defeat. Bledsoe, who shot 5 for 17 from the field, pounded the scorer's table in celebration.\n\n\"Eric claims he called bank on the shot. I don't believe it,\" Watson said with a smile.\n\nBarbosa made baskets on three straight possessions midway through the fourth to give Phoenix an 89-84 advantage, part of an 11-0 run.\n\n\"I like that,\" Barbosa said. \"That's what we're supposed to do. We're supposed to show some things to these guys. Hopefully I give some spark to the team and some energy.\"\n\nThe Hawks cut it to 96-95 with 2:50 to play on Thabo Sefolosha's 17-footer, but Phoenix held on. Dennis Schroder scored 14 of his career-high 31 points in the fourth.\n\nKent Bazemore had 22 points, Tim Hardaway Jr. scored 21 and Dwight Howard added 17 points with 14 rebounds for Atlanta.\n\n\"We are playing the right way, trying to do the right things, but we just can't get it to go our way,\" Bazemore said.\n\nThe Suns turned a five-point deficit at the 5:12 mark of the first quarter into a 36-27 lead to start the second.\n\nKnight scored 14 points in 5 minutes off the bench in the first quarter and Tucker had nine -- seven in the first 2 minutes of the game.\n\nThe Suns took a 47-33 lead, their largest of the game, when Tucker scored and made a free throw in the second quarter. But the Hawks responded, going on a 10-0 run over the final 2:37 of the period. Hardaway hit two 3-pointers and flew in for a dunk during that stretch, finishing the first half with 12 points.\n\nThe teams traded leads for about 4 minutes of the third quarter before the Suns ended it with a 77-75 lead.\n\n\"We just didn't get that stop that we needed to in the last couple of minutes and we didn't get the basket,\" Hawks coach Mike Budenholzer said.\n\n\"You never feel good when you have a tough road trip and you have lost a few in a row, but I think we are looking forward going home.\"\n\nTIP-INS\n\nHawks: F Paul Millsap was held out with a left hip injury, and F/C Tiago Splitter (right calf strain) also did not play. Mike Muscala started in Millsap's place. ... The Hawks shot 10 free throws to 25 for the Suns. ... Hardaway was knocked into the scorer's table chasing down a loose ball in the fourth quarter but stayed in the game.\n\nSuns: F T.J. Warren (minor head injury) did not play and has missed the past six games. ... Dudley crashed to the floor in front of the Suns' bench after a hard foul on Sefolosha in the third quarter, but got up and made two of three free throws right afterward.\n\nDUDLEY DOES JOKES\n\nDudley made sure Tucker was within earshot in the locker room when responding to a question about the veterans playing well. \"P.J. started it off, he hit a couple of pull-up jumpers, which he hasn't done since Texas,\" Dudley said, referring to Tucker's college days.\n\nBLEDSOE'S BURDEN\n\nBledsoe had earlier expressed that it's his fault the Suns are not winning much, despite his most recent stretch of five games before Wednesday in which he averaged 26 points, seven rebounds and 6.6 assists. Phoenix had one win in that span. \"Bledsoe takes a lot of things to heart,\" Watson said. \"He's very purposeful with his words. ... It's going to be transparent. We understand Bled's purpose, and his commitment to this team is second to none.\"\n\nBUDENHOLZER'S BACK\n\nBudenholzer is from Holbrook, Arizona, a town of around 5,000 about 185 miles northeast of Phoenix. He wasn't expecting a big turnout of townsfolk Wednesday night, citing a midweek game after a holiday and no bus service.\n\nUP NEXT\n\nHawks: Host the Detroit Pistons on Friday night and play three of the next four at home.\n\nSuns: At the Golden State Warriors on Saturday, the first of a two-game road trip.",
  "source": "espn_api",
  "crawled_at": 1764995996.638837
}