{
  "game_id": "0022300367",
  "espn_id": "401584995",
  "date": "Dec 20, 2023",
  "matchup": "MIN @ PHI",
  "headline": "Joel Embiid scores 51 points as the Philadelphia 76ers beat the Minnesota Timberwolves 127-113",
  "body": "PHILADELPHIA -- — Joel Embiid scored a season-high 51 points and grabbed 12 rebounds, and the Philadelphia 76ers used a big fourth quarter to close out the Minnesota Timberwolves for a 127-113 win on Wednesday night. \n\n\r\n              Tyrese Maxey scored 35 points as Philadelphia (19-8) won for the seventh time in eight games, bouncing back nicely after a 108-104 loss to Chicago on Monday night.\n\n\r\n              “I felt like I was playing within the offense and not forcing anything,” said Embiid, who is averaging 38.3 points in the last 12 games and has scored 40 or more in four of his last five contests. “I took what was being given to me. And I've been trying to figure out is when to be aggressive and when to let my teammates do their thing.”\n\n\r\n              Minnesota (20-6) got 27 points from Anthony Edwards, 23 points from Karl-Anthony Towns and 21 from Jaden McDaniels. The Timberwolves entered Wednesday night as winners of nine of its last 10 games and possessors of the league's best record.\n\n\r\n              “We didn't play a clean or pretty game,” Timberwolves coach Chris Finch said. “I thought we would find a run or a rhythm. Thirty-seven points (for Philadelphia) in the fourth quarter is way too much — we needed it to be under 30 for sure.”\n\n\r\n              It was Embiid's seventh career game with at least 50 points. He also recorded his 12th straight game with 30 or more points and 10-plus rebounds. It is the NBA's longest such streak since Kareem Abdul-Jabbar did it in 16 straight games for the Milwaukee Bucks in the 1971-72 season. \n\n\r\n              “We're winning and that's all that matters,” Embiid said. “Stats are great and it's great to put up stats. But if it comes with a loss, then that's a different story. If it comes with a win, it means a lot.”\n\n\r\n              “He's continuing to get better and he's just doing enough different things rhythmically to keep those guys guessing,\" Sixers coach Nick Nurse said. “He has a feel that if guys step into him, he can get them. And I like when he goes downhill.”\n\n\r\n              A game that was billed as a clash of defensive styles turned toward the Sixers during an impressive display of offensive moves by Embiid in the third quarter. He scored 19 of Philadelphia's 26 points in the period and kept the Sixers in the lead at 90-87 going into the fourth.\n\n\r\n              Embiid was 17 for 18 from the foul line on the night, taking advantage of foul trouble for Minnesota forward Rudy Gobert.\n\n\r\n              “Certainly, Rudy exiting the game in the first four minutes certainly hurt us,” Finch said.\n\n\r\n              Maxey scored 15 points in the final quarter, most of that coming during a five-minute stretch at the beginning of the period when Embiid was on the bench. No other Philadelphia player scored in double figures for the second game in a row.\n\n\r\n              “You have to use speed and be decisive,” Maxey said. “I think that if anyone is going to pick me up high (off the arc), they can't keep up with me with speed, skill and work. I tried to be extremely aggressive.”\n\n\r\n              Philadelphia ended up losing starting guard De'Anthony Melton in the second half with a left thigh contusion. \n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Return home for a Thursday night game against the Los Angeles Lakers.\n\n\r\n              76ers: Host Toronto on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996486.7777221
}