{
  "game_id": "0022000948",
  "espn_id": "401307751",
  "date": "Apr 29, 2021",
  "matchup": "TOR @ DEN",
  "headline": "Jokic, Porter lead Nuggets past Raptors 121-111",
  "body": "DENVER -- — Nikola Jokic had 19 points and 11 rebounds in just three quarters to lead the Denver Nuggets past the Toronto Raptors 121-111 on Thursday night.\n\n\r\n                    Michael Porter Jr. scored 23 points for the Nuggets, who had seven players score in double figures and used a 31-8 run over the third and fourth quarters to win their fourth straight. They are a half-game behind the Los Angeles Clippers for third in the Western Conference.\n\n\r\n                    “This is the point you want to be at,” Porter said. “Nine, 10 games until playoffs, so this is the fun. We have to make sure we’re in prime-time shape and ready to go once the playoffs start.”\n\n\r\n                    Denver improved to 8-1 since Jamal Murray went down with a torn ACL in his left knee on April 12. The Nuggets also lost guards Monte Morris and Will Barton to hamstring injuries, but both are expected to return this season.\n\n\r\n                    Without its starting backcourt, Denver has relied on reserves Facu Campazzo, P.J. Dozier and Shaquille Harrison, a two-way player getting a chance to make an impact. He did Thursday with a season-high 11 points, and Campazzo followed up his first double-double on Wednesday night with 12 points.\n\n\r\n                    Jokic’s double-double was his 53rd of the season.\n\n\r\n                    OG Anunoby scored 25 points for the Raptors, Kyle Lowry and Khem Birch had 20 each, and Malachi Flynn, who started in place of injured Fred VanVleet (hip), pitched in with 16.\n\n\r\n                    The Nuggets led by six in the second quarter and again late in the third, but Toronto rallied both times to tie it. It was 87-85 after three quarters. Denver scored the first 12 points of the fourth against the Raptors’ bench and held them to just a pair of 3-pointers by Lowry in the first 5:40 of the fourth.\n\n\r\n                    “It turned the tide of the game, got them feeling pretty good and they didn’t stop pretty much until the end,” Toronto coach Nick Nurse said. “It was not a good lineup. They didn’t get any stops and didn’t get any scores.”\n\n\r\n                    Lowry’s flagrant foul on P.J. Dozier led to a six-point possession for Denver and a 21-point lead. Denver held the Raptors two just two made field goals in the first 7:28 of the fourth.\n\n\r\n                    “For me, being a defensive-minded coach, that was some of the best basketball I’ve seen that group play,” Denver coach Michael Malone said.\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: VanVleet is getting an extra couple of days of rest for his hip, Nurse said. VanVleet said after Tuesday’s loss to Brooklyn that he didn’t feel great. ... G Jalen Harris returned after being out since March 14 with a hip injury. He played the final five minutes of mop-up time.\n\n\r\n                    Nuggets: Porter rolled his left ankle late in Wednesday’s game but was fine Thursday night. ... Malone said Murray is still in Los Angeles after having surgery, and the team hopes to see him when it flies there Friday. “I think I speak for everybody in our group that we miss him, and we can’t wait to see him,” Malone said.\n\n\r\n                    RESTFUL TIME\n\n\r\n                    Jokic has played every game this season, so Malone was happy to sit him for the entire fourth quarter.\n\n\r\n                    “He’s a tough cookie. He doesn’t want to take a night off,” Malone said. “He takes tremendous pride in his Serbian heritage. As he always says, Serbian guys don’t sit out, which I respect the hell out of, but you have to be smart about it.”\n\n\r\n                    NUMBERS GAME\n\n\r\n                    Lowry played his 600th game with Toronto and Malone got the 300th win of his career and 261st with Denver. The Nuggets players doused Malone with water in the locker room after the game.\n\n\r\n                    Lowry has played 958 games with Memphis, Houston and Toronto.\n\n\r\n                    “It’s been an amazing time, it’s been fun,” he said. “Ups and downs, but you enjoy the moment of being able to play basketball.”\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: At Utah on Saturday night.\n\n\r\n                    Nuggets: At the Los Angeles Clippers on Saturday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997266.797593
}