{
  "game_id": "0022000941",
  "espn_id": "401307744",
  "date": "Apr 28, 2021",
  "matchup": "LAC @ PHX",
  "headline": "Suns beat Clippers, clinch first playoff spot in 11 years",
  "body": "PHOENIX -- — Devin Booker was in middle school and starting center Deandre Ayton was 11 years old when the Phoenix Suns were last in the playoffs.\n\n\r\n                    As for point guard Chris Paul? He was an NBA star in those days, just like he was on Wednesday night.\n\n\r\n                    Paul scored 28 points, Booker added 21 and the Suns beat the Los Angeles Clippers 109-101 to secure a spot in the postseason for the first time since 2010.\n\n\r\n                    “We are not satisfied, we’re not settling,” second-year Suns coach Monty Williams said. “We feel like we’re just scratching the surface.”\n\n\r\n                    Williams has been the architect of a remarkable turnaround in Arizona. The Suns had a 19-63 record just two seasons ago and had languished near the bottom of the West for years. Now they're a trendy pick to push deep into the summer's playoffs.\n\n\r\n                    “Our players have worked their tails off, they’ve done everything I’ve asked them to do,” Williams said. “I’m just happy for them.”\n\n\r\n                    The Suns finally figured out a way to beat the Clippers, who won the first two games of the season series. Phoenix didn't trail the entire game but needed a fourth-quarter push to turn back a Los Angeles rally.\n\n\r\n                    The Suns took an 86-80 lead into the final quarter. The Clippers pulled within 93-92 midway though the fourth but Paul scored three consecutive tough baskets to give Phoenix some space.\n\n\r\n                    The 35-year-old Paul continued to play excellent basketball in his 16th NBA season, shooting 10 of 15 from the field, dishing 10 assists and generally looking like a player a decade younger. The 11-time All-Star was serenaded with \"MVP! MVP!\" chants from the crowd by the end of the fourth.\n\n\r\n                    Clippers coach Tyronn Lue said Paul “picked his spots” and was extremely hard to defend.\n\n\r\n                    “He controls the whole game,” Lue said. “He plays at his own pace, he gets guys involved, he knows where everybody is at. That is what a true point guard does and he did it tonight.”\n\n\r\n                    The addition of Paul — who came to the Suns in an offseason trade with the Thunder — has been a huge boost for the franchise, giving the Suns a Hall of Fame-caliber point guard who has 109 games of playoff experience. He said he wasn't surprised the Suns are in this position.\n\n\r\n                    “I know who I am,” Paul said. \"I knew coming to this situation, I knew who Book was, he told me about some of the guys on the team. I knew playing for Monty, how detail-oriented he is.”\n\n\r\n                    The Suns improved to 44-18 while the Clippers fell to 43-21. The teams are currently ranked No. 2 and 3, respectively, in the Western Conference standings.\n\n\r\n                    Paul George led the Clippers with 25 points and 10 rebounds, while Marcus Morris Sr. added 16 points. \n\n\r\n                    The Suns jumped out to a 39-31 lead after one quarter, making 7 of 9 shots from 3-point range. Phoenix pushed the lead to 14 points by midway through the second before settling for a 63-53 halftime advantage.\n\n\r\n                    Frank Kaminsky led the Suns with 13 points before the break while Booker had 12. George scored 16 for the Clippers. The Phoenix bench outscored LA's reserves 28-8 in the first half.\n\n\r\n                    CLOSE TO NORMAL\n\n\r\n                    The Suns are able to have about 5,500 fans these days at Phoenix Suns Arena, slowly increasing capacity as the COVID-19 pandemic wanes.\n\n\r\n                    It was a festive atmosphere for Wednesday's game that felt almost pre-pandemic, with shirtless fans with S-U-N-S dancing in the stands and huge cheers when Paul hit his crucial buckets in the fourth.\n\n\r\n                    “I love it,” Booker said. “I love these types of games and atmosphere.”\n\n\r\n                    The Suns haven't been in the playoffs since 2010, when Steve Nash and Amar'e Stoudemire made the team a huge draw in the desert.\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Guard Patrick Beverley (hand fracture) and forwards Kawhi Leonard (sore right foot) and Serge Ibaka (lower back) didn't play.\n\n\r\n                    Suns: Forwards Jae Crowder (right ankle sprain), Dario Saric (left ankle) and Abdel Nader (right knee) didn’t play. ... Kaminsky was out of the playing rotation for several weeks before stepping up with Crowder and Saric out. He finished 6 of 8 from the field, scoring seven points in a row at one point in the second quarter.\n\n\r\n                    “Speaks to the work and speaks to his attitude,” Williams said of Kaminsky. “He was ready.”\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Host the Nuggets on Saturday.\n\n\r\n                    Suns: Host the Jazz on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997662.9344141
}