{
  "game_id": "0021500927",
  "espn_id": "400828814",
  "date": "Mar 05, 2016",
  "matchup": "CHI vs. HOU",
  "headline": "Gasol, Butler lead Bulls over Rockets, 108-100",
  "body": "CHICAGO -- Deep down, Jimmy Butler insists he still thinks the Chicago Bulls can do something big.\nMaybe this is a start.\nPau Gasol finished with 28 points and 17 rebounds, Butler scored 24 points in his return from a strained left knee, and the Bulls snapped a four-game losing streak with a 108-100 victory over the Houston Rockets on Saturday.\nGasol hit four free throws after Patrick Beverley nailed a 3-pointer to cut it to 104-100 with 34.8 seconds remaining. And Chicago withstood a late rally to avoid matching its longest skid even though James Harden scored 36 for Houston. The Bulls also moved a half-game ahead of Detroit for eighth place in the Eastern Conference.\n\n\"I don't ever think that we're gonna lose,\" Butler said.\nGasol delivered his 35th double-double and Butler added 11 rebounds after missing the previous 11 games.\nAn aggressive Derrick Rose contributed 17 points and nine assists, although he did commit six of his team's season-high 26 turnovers. Mike Dunleavy Jr. scored 12 and the Bulls picked up the win.\n\"Twenty one games left. We have a quarter of the season,\" Gasol said. \"That's a lot of games.\"\nWhile Harden went off in a big way, he was about the only one scoring for the Rockets.\nDwight Howard was non-factor down low with eight points and 12 rebounds, and Houston once again struggled in a big way from the outside.\nThe Rockets were just 9 for 35 on 3-pointers with Chicago basically daring them to shoot. And that came on the heels of a 3-for-35 meltdown that ranked among the worst performances in NBA history during Wednesday's win over New Orleans.\n\"\"We've been struggling shooting the ball and it makes it that much harder on defense,\" Beverley said. \"We've got to hang our hat on the defensive end and try to get stops. We've just to find a way to do it consistently.\"\nFULL STRENGTH\nThe late push by Houston aside, Chicago simply had a different energy after sluggish losses at Miami and Orlando.\nThe Bulls were just about at full strength with Butler playing for the first time since Feb. 5, Taj Gibson (hamstring) and Nikola Mirotic (appendectomy) returning from a 16-game absence.\nButler got a loud ovation during pregame introductions and gave fans plenty to cheer in the first half, scoring 14. Gasol added 13 points and 10 rebounds, and Rose pushed the tempo to help Chicago grab a 55-43 lead.\nBIG SHOTS\nA 3 by Dunleavy and a turnaround hook shot by Butler made it 68-53 just over four minutes into the third quarter. And with the lead at eight going into the fourth, Mirotic hit two 3s with Rose burying one of his own in between to bump the lead 92-75 with 9:59 remaining.\nIt was 100-82 with just over five minutes left before Houston ralllied. A four-point play by Harden and a free throw by Corey Brewer made it 104-97, and a 3 by Beverley cut the lead to four with 34.8 seconds left.\n\"It's frustrating, I know our guys are frustrated,\" Houston coach J.B. Bickerstaff said. \"But we gotta keep going, keep attacking the rim, keep putting pressure on the rim.\"\nTIP-INS\nRockets: F Michael Beasley played 4:16 after signing with Houston on Friday. The second overall pick in the 2008 draft, he spent this season in the Chinese Basketball Association and had not played in an NBA game since last year with Miami. \"We're not going to throw him right into the fire so he has a chance to succeed,\" coach J.B. Bickerstaff said.\nBulls: F Cameron Bairstow sat out because of a back injury.\nUP NEXT\nRockets: At Toronto on Sunday.\nBulls: Host Milwaukee on Monday.",
  "source": "espn_api",
  "crawled_at": 1764993913.6945379
}