{
  "game_id": "0021801023",
  "espn_id": "401071696",
  "date": "Mar 14, 2019",
  "matchup": "TOR vs. LAL",
  "headline": "Kawhi Leonard scores 25 points, Raptors beat Lakers 111-98",
  "body": "TORONTO --  LeBron James is finding it hard to stay chill about his season-ending cool down.\n\nKawhi Leonard scored 25 points, Norman Powell had 20 and the Toronto Raptors beat James and the Los Angeles Lakers 111-98 on Thursday night.\n\nJames scored 29 points and Alex Caruso had a career-high 16 for Los Angeles. The struggling Lakers lost for the sixth time in seven games, further denting their fading playoff hopes.\n\nEarlier this month, after consulting with James' personal trainer, the Lakers said James would play limited minutes the rest of the season, and might sit out one of any back-to-back games\n\n\"It's challenging for me mentally, because I'm so accustomed to being out on the floor, especially when I'm healthy,\" James said. \"This is the direction they wanted to go the remainder of the season, given the lack of success we've had with our ball club.\"\n\nJames played 32 minutes Thursday and has not played more than 33 in any of the past four games. His status for Friday's game at Detroit is not known.\n\n\"With the injuries we have and with LeBron watching his minutes, we've got to get creative with some of our lineups and make sure we have groups out there that give us a chance to win still,\" Lakers coach Luke Walton said. \"Ultimately, we're trying to get a win each and every time out.\"\n\nPascal Siakam scored 16 points and Marc Gasol added 15 to help Toronto win its ninth consecutive meeting with the Lakers, extending a franchise record. The Raptors have not lost to the Lakers since Nov. 30, 2014. They also set a franchise record with their 20th victory of the season against a Western Conference opponent.\n\nRajon Rondo scored 13 points but the Lakers failed to win back-to-back games for the first time since Jan. 15 and 17, when they beat Chicago and won at Oklahoma City.\n\nLos Angeles overturned a 20-point deficit to win at Chicago on Tuesday night, snapping a five-game losing streak. The Lakers kept it close through three quarters against Toronto, the Atlantic Division leader, but couldn't hang on in the fourth as the Raptors started the quarter with a 13-4 spurt.\n\nThe Lakers made 7 of 31 attempts from 3-point range.\n\n\"We gave ourselves a chance to stay around and stay in the game,\" Walton said, \"but to win against a good team on the road, for the most part you're going to have to knock down more than that.\"\n\nLakers forward Kyle Kuzma shot 3 for 11 and scored seven points. He missed all three of his attempts from long range.\n\n\"It just wasn't my night,\" Kuzma said. \"You can't be perfect all 82. I've got to be better, for sure.\"\n\nKuzma got an earful from his coach after he failed to defend a 3 by Toronto's Danny Green in the third quarter.\n\nToronto guard Malcolm Miller, who played 24 minutes in a G-League game earlier Thursday, made two 3-pointers in the fourth.\n\nThe Raptors were without guard Kyle Lowry, who sat because of a sore left ankle, and forward Serge Ibaka, who began serving a three-game suspension for throwing a punch at Cleveland's Marquese Chriss on Monday night.\n\nThe Raptors were up 65-54 at halftime and took a 90-84 lead into the fourth.\n\nTIP-INS\n\nLakers: Los Angeles has not won consecutive road games since victories at Miami on Nov. 18 and Cleveland on Nov. 21. ... C Tyson Chandler missed his fifth straight game because of a sore neck, and G Lance Stephenson sat for the sixth time in seven games because of a sprained toe on his left foot. ... James missed three straight free throws in the fourth. ... The Lakers are 1-6 in March.\n\nRaptors: Gasol started in place of Ibaka, and Jeremy Lin started in place of Lowry. ... Toronto signed F/C Eric Moreland to a 10-day contract. ... The Raptors are 10-0 against Pacific Division opponents. The last team to go 10-0 against a single division was Golden State, which did it against the Southeast in 2015-16. ... Toronto's 28 home wins are the most in the NBA.\n\nHALFWAY HOME\n\nToronto has won 17 straight when leading at halftime, extending a franchise record.\n\nWHAT'S IN A NAME?\n\nThe Raptors said their practice facility has been renamed the the OVO Athletic Centre. It's a nod to the team's partnership with Grammy award-winner Drake. The Toronto-born rapper has been involved with the Raptors since being named the team's `global ambassador' in September 2013. OVO is an acronym for October's Very Own, Drake's record label and clothing line.\n\nUP NEXT\n\nLakers: At Detroit on Friday night.\n\nRaptors: At Detroit on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994093.596791
}