{
  "game_id": "0021900875",
  "espn_id": "401161517",
  "date": "Feb 27, 2020",
  "matchup": "OKC vs. SAC",
  "headline": "Gallinari scores 24; Thunder rally from 19 down to top Kings",
  "body": "OKLAHOMA CITY --  The Oklahoma City Thunder continue to thrive in seemingly uncomfortable situations.\n\nDanilo Gallinari scored 24 points and the Thunder rallied from 19 points down in the third quarter to beat the Sacramento Kings 112-108 on Thursday night.\n\nIt was the 15th time this season that the Thunder have won after trailing heading into the fourth quarter -- by far, the most in the league.\n\n\"We've just been in this situation a lot and we know what to do,\" Thunder guard Shai Gilgeous-Alexander said. \"I think I can speak for all five guys that are in the game (late) most of the time. We're confident and work hard and trust it.\"\n\nGilgeous-Alexander scored 20 points and Chris Paul added 17 for the Thunder, who have won five straight and 14 of 17.\n\nHarrison Barnes scored 21 points and Harry Giles added a season-high 19 for the Kings, who had won three in a row. De'Aaron Fox, the Kings' No. 2 scorer, sat out with lower abdominal muscle tightness.\n\nSacramento led 61-50 at halftime. Giles scored 15 points and Buddy Hield scored 12 on 4-for-4 shooting from 3-point range.\n\n\"We got to a point there, if they made a shot, we were hanging our heads trying to figure out whose fault it was instead of playing with the right pace,\" Paul said.\n\nThe Kings quickly increased their advantage in the third quarter. A deep 3-pointer by Nemanja Bjelica put Sacramento up 75-57. Sacramento's biggest lead was 78-59 before Oklahoma City rallied. The Thunder went on a 15-0 run and held the Kings scoreless for nearly six minutes.\n\n\"It's like we flipped a switch,\" Paul said. \"Fortunately, we could do it tonight, but we can't rely on that every night.\"\n\nSacramento's lead was down to 82-81 at the end of the period. The Thunder made 11 of 18 field goals and all eight of their free throws in the third quarter.\n\n\"We put them at the foul line,\" Hield said. \"They slowed the game down. When they get to the halfcourt, they're a really good halfcourt defensive team and it's hard to get offensive opportunities and the momentum shifted away.\"\n\nThe Thunder led 110-106 in the final minute and had possession when Hield stole the ball. He missed an open 3-pointer and the Thunder ended up gaining possession.\n\nSacramento's Cory Joseph stole the ball and Barnes made a layup to cut Oklahoma City's lead to two with 9.9 seconds remaining, but Paul made two free throws with 9.5 seconds left to put the game away.\n\nTIP-INS\n\nKings: Made all 10 of their free throws in the first half. ... Sacramento's Kent Bazemore and Oklahoma City's Hamidou Diallo were called for a double technical in the third quarter. ... Joseph had 11 assists and one turnover.\n\nThunder: Had six players score in double figures. ... Outscored the Kings 21-14 at the free throw line. ... Guards Paul and Dennis Schroder each had seven assists. ... The Thunder had just nine turnovers.\n\nSLOWING HIELD\n\nHield, who played at the nearby University of Oklahoma, finished with 15 points after his hot start. The 3-point shootout champion during All-Star weekend made 1 of 5 shots in the second half, all 3-pointers.\n\n\"Just tried to stay attached to him as much as possible,\" Paul said. \"Buddy likes to hunt 3's. He's one of them guys that he might have a wide open layup and he's trying to get to the 3-point line.\"\n\nSTAT LINES\n\nDuring Oklahoma City's five-game win streak, center Steven Adams is averaging 16.4 points and 11.6 rebounds per game while shooting 62.3% from the field.\n\nHE SAID IT\n\nThunder coach Billy Donovan on how the Thunder closed the game: \"I thought from about the six-minute mark (in the third quarter) on to the end of the game, the guys really turned it up and made a lot of winning plays.\"\n\nUP NEXT\n\nKings: Visit the Memphis Grizzlies on Friday.\n\nThunder: Visit the Milwaukee Bucks on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996200.043232
}