{
  "game_id": "0021600220",
  "espn_id": "400899670",
  "date": "Nov 23, 2016",
  "matchup": "DAL vs. LAC",
  "headline": "Clippers rout Mavs 124-104 in matchup of best, worst records",
  "body": "DALLAS --  Chris Paul had to be reminded that the Los Angeles Clippers are up to an NBA-leading 14 wins.\n\nThey won't get much easier than this one over the injury-plagued Dallas Mavericks.\n\nPaul scored 18 points, DeAndre Jordan had 16 points and eight rebounds and the Clippers cruised past the Mavericks 124-104 on Wednesday night in a matchup of the teams with the best and worst records in the NBA.\n\n\"I honestly didn't know we had 14 wins,\" said Paul, who added four assists and four steals. \"I know we have two losses. But for us, when you've been in this league for a while, it's not necessarily about the wins. It's about how you're playing and about the spirit.\"\n\nDirk Nowitzki scored 10 points on 3-of-10 shooting in 20 minutes in his return for Dallas after the 13-time All-Star missed eight games with a strained left Achilles tendon.\n\nAustin Rivers added 22 points -- half of them in a meaningless fourth quarter -- for the Clippers. They had a 30-6 run in the second and third quarters on the way to their fourth straight win and 11th in 12 games.\n\nHarrison Barnes had 22 to lead the Mavericks (2-12). They lost their seventh straight game to match their longest skid since February 1999, during Nowitzki's rookie season.\n\nDallas, missing its top three point guards and facing a trip to defending champion Cleveland, is off to its worst start since going 1-23 in 1993-94. The Mavericks started the week with a valiant effort in a loss at San Antonio.\n\n\"This is obviously as tough a week as you can get in the NBA,\" Nowitzki said. \"So hopefully we'll fight through this and grind out a win here and there. And when the schedule turns in our favor hopefully get more healthy and run off some wins. That's the only way to do it.\"\n\nBlake Griffin had 12 points, seven assists and six rebounds, all in the first three quarters along with the rest of the starters. The Clippers led by 31 in the third.\n\nRivers scored 11 points in the first half, including 3-pointers just four seconds apart after he hit one, stole the inbound pass and made another. He was 6 of 7 from long range.\n\nTIP-INS\n\nClippers: LA shot 61 percent in the first half and made 9 of 14 from 3-point range. ... Marreese Speights scored 16 and Jamal Crawford added 15 as the Clippers had a 65-43 advantage in bench scoring. ... Speights had his first double-double with a season-high 12 rebounds. The 16 points matched his season high. ... JJ Redick had 10 points.\n\nMavericks: PG Deron Williams sat for the eighth time in nine games with a left calf strain. He said he's hopeful to play next week. ... C Andrew Bogut was called for a flagrant foul on a hip-check of Paul as the Clippers point guard drove to the basket. Paul jumped up and went at Bogut, and the pair kept jawing as the referees prepared to review the play. ... Bogut had 12 rebounds and six assists after missing a game with a sore right calf.\n\nCOWBOY UP\n\nThe Clippers will stay in the Dallas area to attend the Washington Redskins-Dallas Cowboys game on Thanksgiving before continuing a six-game trip Friday at Detroit. Paul is a well-documented fan of the Cowboys, who have the NFL's best record at 9-1. He wore the jersey of rookie running back Ezekiel Elliott, the NFL's rushing leader, on the flight from Los Angeles. Paul has attended Cowboys training camp in the LA area.\n\nWhile acknowledging that his team has a bevy of Dallas fans, Clippers coach and Chicago Bears fan Doc Rivers had a parting shot for reporters. \"I'm not going to call you any of you guys bandwagon, OK, but this is the first time you guys have mentioned the Cowboys in like four years,\" Rivers said.\n\nLOSING THE LUSTER\n\nThe boos were still there for Jordan, who spurned the Mavericks in free agency in the summer of 2015 after agreeing to join them. But they weren't quite as loud or persistent as the 6-foot-11 center's two visits last season.\n\nUP NEXT\n\nClippers: The visit to the Pistons on the season's longest trip is the first of four straight against Eastern Conference teams. Defending champion Cleveland is the last of those four opponents.\n\nMavericks: A quick trip to face LeBron James, another Cowboys fan, and the Cavaliers on Friday before home games against New Orleans and San Antonio.",
  "source": "espn_api",
  "crawled_at": 1764996154.95492
}