{
  "game_id": "0021800123",
  "espn_id": "401070804",
  "date": "Nov 02, 2018",
  "matchup": "TOR @ PHX",
  "headline": "Raptors finally pull away from Suns 107-98, improve to 8-1",
  "body": "PHOENIX --  The Toronto Raptors weren't at their best, but good enough to pull away from the Phoenix Suns for another victory in the best start to a season in the Canadian franchise's history.\n\nKawhi Leonard scored 19 points and the Raptors used a 14-2 fourth-quarter run to finally put away the pesky Phoenix Suns 107-98 on Friday night.\n\nJonas Valanciunas added 16 points and Serge Ibaka 14 for the Raptors, who improved to 8-1, the best nine-game start in franchise history. Kyle Lowry had 11 points and 12 assists.\n\n\"It is a 48 minute game and I think we are playing pretty good basketball for about 28 minutes right now,\" Raptors coach Nick Nurse said. \"We got to stretch that. I don't think we will ever get to 48 minutes, but we want to get in the 40s probably after the new year.\"\n\nDeandre Ayton, the No. 1 overall pick in the draft, had 17 points and 18 rebounds for the Suns, losers of seven in a row since winning their season opener. Isaiah Canaan scored 19 and Devin Booker 18 for Phoenix. Booker returned after missing three games with a strained hamstring.\n\nPhoenix trailed by only four early in the fourth quarter before Toronto's decisive 14-2 surge.\n\n\"Well, our effort was better,\" Suns first-year coach Igor Kokoskov said. \"Having book and Canaan back, I mean that helps a lot. We have to sustain playing a physical, strong team like Toronto. We have to sustain and play 48 minutes. We had a stretch in the fourth quarter that we couldn't handle the physicality, their length, their size. ... And we were just tired.\"\n\nThe Suns led most of the first half but never by more than seven points.\n\nPhoenix was up 52-48 at the break, with Canaan scoring 12 points and Ayton adding 10 points and 10 rebounds.\n\nThe Raptors opened the third quarter with a 13-2 run. Leonard's three-point play on a drive to the hoop put Toronto up 56-54 and Danny Green's 3-pointer from the corner made it 61-54. Phoenix, though, scored the next seven, tying it at 61-61 on Booker's 18-footer.\n\nDespite missing four free throws during that stretch, the Raptors responded with a 13-3 run to lead 74-64 after Fred VanVleet's 3-pointer with 2:04 left in the third quarter. Josh Jackson's 3 at the third-quarter buzzer cut Toronto's lead to 77-71 entering the fourth.\n\nJackson's jumper to start the fourth quarter cut it to35 77-73 but the Raptors finally took control for good.\n\nVanVleet sank a 3-pointer, followed by a steal and layup and Norman Powell sank a 3 to finish a 14-2 outburst that put the Raptors up 91-75 with 8:35 remaining.\n\nToronto stretched it to 99-81 on Valanciunas' layup. Phoenix outscored the Raptors 17-8 the rest of the way.\n\n\"We want to be an aggressive, defense team, get hands on some balls, deflect, get out and transition, get out and get some 3s and layups,\" said Leonard, who jammed his left foot late in the fourth quarter but later said he was OK. \"We did a good job for about six or seven possessions in a row.\"\n\nTIP-INS\n\nRaptors: Toronto started the season 7-2 in 2014 and in 2016. ... Toronto opened a four-game road trip through the West ... Green left after taking a shot to the head in the third quarter. ... Raptors have three straight wins over Phoenix, matching longest streak in franchise history.\n\nSuns: Suns lost their previous six games this season by 28, 20, 18, 21, 7 and 30. ... Phoenix has three games left on a five-game home stand. ... On this date in 1990, Phoenix defeated Utah in Tokyo in first NBA regular-season game outside North America. Tom Chambers scored 38 for the Suns, Karl Malone 33 for the Jazz. ... Phoenix led at halftime for only the second time this season.\n\nUP NEXT\n\nRaptors: At the Los Angeles Lakers on Sunday night.\n\nSuns: Host the Memphis Grizzles on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994298.002064
}