{
  "game_id": "0022000852",
  "espn_id": "401307648",
  "date": "Apr 16, 2021",
  "matchup": "MIA @ MIN",
  "headline": "Towns scores 24, helps Timberwolves beat Heat 119-111",
  "body": "MINNEAPOLIS -- — Karl-Anthony Towns scored 24 points, including eight in the fourth quarter before fouling out, to lead the Minnesota Timberwolves to a 119-111 win against the Miami Heat on Friday night.\n\n\r\n                    Ricky Rubio added 17 points and Naz Reid scored 16 off the bench as Minnesota had seven players score in double-figures to overcome 21 turnovers. Towns keyed a 22-6 run midway through the fourth as the Timberwolves pulled away.\n\n\r\n                    Towns missed the past two games due to personal reasons on the one-year anniversary of his mother’s death. Minnesota lost both games by at least 25 points to Brooklyn and Milwaukee. Against another Eastern Conference playoff contender, the Timberwolves finished strong to win for just the second time in six games, a stretch against all East teams.\n\n\r\n                    “This win meant a lot to me, just being able to do what I love and be able to be on the court with these guys,” Towns said.\n\n\r\n                    Jimmy Butler had 30 points, 10 rebounds and eight assists, but Miami lost its third straight game, all coming on the road. Trevor Ariza scored a season-high 21 points for the Heat, who started the night seventh in the East and a half-game ahead of Charlotte.\n\n\r\n                    “We don’t deserve to win,” Butler said. “Whenever we take these teams lightly, we don’t do what we’re supposed to do on the defensive end, we just look bad as a whole, as a group, as a unit. It’s not good basketball.”\n\n\r\n                    Miami appeared ready to put away the Wolves, the West’s worst team at the start of the day. The Heat finished the third quarter on a 15-5 and led by five points with Goran Dragic hitting a buzzer-beating 3-pointer.\n\n\r\n                    Towns didn’t let Minnesota fade away. He finished the pivotal fourth-quarter run with a deep 3 and walked back up the court holding out three fingers to the hometown crowd.\n\n\r\n                    “Tough couple games this week for us, but we responded tonight,” Wolves coach Chris Finch said. “Total team effort; what I love about it is it was probably our best team effort of the season.”\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: G Victor Oladipo missed his fourth straight game with right knee soreness. ... Butler, the former Timberwolves star who forced his way out with a trade, was booed loudly the first time he touched the ball by the limited fans in attendance. ... Butler recorded multiple steals for the ninth straight game, setting a franchise record and extending the longest streak of his career. Sherman Douglas had eight consecutive such games in 1990.\n\n\r\n                    Timberwolves: G Jaylen Nowell missed the game with a right tibia contusion. ... Towns extended his streak of games with a 3 to 70 games, the longest stretch by a player in franchise history. ... Edwards had a steal for the 25th straight game, the longest active streak in the NBA, and longest by a rookie in team history. The NBA record for a rookie is 31 straight games by Chris Paul in 2005-06.\n\n\r\n                    KEY STAT\n\n\r\n                    Heat coach Erik Spoelstra highlighted an important factor in the win: second-chance points. Minnesota had 10 offensive rebounds leading to 23 second-chance points. Miami only had five second-chance points.\n\n\r\n                    “That’s tough to overcome,” Spoelstra said. “That’s a problem right now, us being able to finish our defense. At least the last three games, that has not been good enough.”\n\n\r\n                    JOINT FUNDRAISER\n\n\r\n                    The Timberwolves and Heat agreed to auction their pregame “With Liberty and Justice FOR ALL” warmup shirts to raise money for The Daunte Wright Memorial Fund. Wright was the Black man fatally shot by a police officer on April 11 in a nearby suburb.\n\n\r\n                    The Brooklyn Nets and Milwaukee Bucks – the previous two teams to play in Minnesota – along with the WNBA’s Minnesota Lynx joined the cause. Each shirt will be autographed by players. The auction ran concurrently on the Timberwolves’ website during Friday’s game.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Host the Nets on Sunday.\n\n\r\n                    Timberwolves: Travel to Los Angeles to play the Clippers on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996762.842818
}