{
  "game_id": "0021800820",
  "espn_id": "401071493",
  "date": "Feb 08, 2019",
  "matchup": "BKN vs. CHI",
  "headline": "Markkanen leads Bulls to 125-106 rout of Nets",
  "body": "NEW YORK --  Otto Porter Jr. had a strong debut for the Chicago Bulls -- even without a practice or walkthrough with his new teammates.\n\nTwo days after being acquired from Washington, Porter scored 18 points to help lift the Bulls to a 125-106 rout of the Brooklyn Nets on Friday night.\n\n\"He played great,\" Lauri Markkanen said. \"I'm glad we have him.\"\n\nMarkkanen wasn't bad, either. He led all players with 31 points and 18 rebounds, and has at least 30 points in three straight games for Chicago. He knocked down 11 of 18 shots from the field, including 4 of 7 from 3-point range. And in the final minutes, the second-year pro finished the game at center after starting at power forward.\n\n\"He's smart,\" Bulls coach Jim Boylen said. \"He knows if he rebounds, it gets him into the game. So he's trying to get every rebound he can and then he's suddenly driving the ball more.\"\n\nPorter Jr. and Markkanen were hardly a two-man operation for Chicago, which has scored more than 100 points in 17 consecutive games.\n\nZach LaVine added 23 points, Robin Lopez and Kris Dunn each had 12, and Wayne Selden Jr. finished with 11. The win snapped a two-game skid for the Bulls.\n\nChicago has still lost three of five, seven of nine, and 16 of 19 dating to Dec. 30.\n\n\"We got a lot from a lot of guys,\" Boylen said. \"I felt like we looked like a team out there and played like a team. I'm happy for them. I'm happy for our guys. I'm proud of our guys.\"\n\nWhile the Bulls were reveling in a job well done, the Nets left feeling as if they gifted a win to one of the worst teams in the league.\n\nD'Angelo Russell, named to the Eastern Conference All-Star team earlier in the week, led the Nets with 23 points but Brooklyn dropped to 29-28 with its third loss in five games. Allen Crabbe and Joe Harris each finished with 19 points.\n\n\"We just weren't really locked in defensively,\" Crabbe said. \"They got basically whatever they wanted, did whatever they wanted to do. I don't think we gave them any resistance on the defensive side. Guys were comfortable out there.\"\n\nAt first glance, the game seemed liked a mismatch. The Nets have been one of the NBA's surprise stories as they find themselves in the Eastern Conference playoff picture, while the Bulls are in a heated race with Atlanta, Cleveland, Phoenix and the New York Knicks to be in the best position to win the NBA draft lottery and potentially select Duke power forward Zion Williamson.\n\nBut, the Bulls led 55-48 at halftime. Chicago's biggest lead in the first half was 10 at 40-30, but the Nets used 17-6 run spanning 6:28 to go up by 1 at 47-46, before the Bulls ended the first half by outscoring Brooklyn 9-1. Chicago made 21 of 44 shots from the field in the first half, including 6 of 11 from 3-point range, while the Nets struggled at 16 for 43 overall, and 5 of 17 from beyond the arc.\n\nFor the game, the Bulls made 54.1 percent (46 for 85) of its shots from the field, and knocked down exactly 50 percent (14 for 28) of its 3s. By comparison, the Nets made 39 of 94 (41.5 percent) shots from the field, and misfired on 28 of 41 3-point attempts (31.7 percent).\n\n\"They outplayed us 1 through 12,\" Nets coach Kenny Atkinson said.\n\nChicago extended its lead to as many as 14 in the third quarter, and had a 93-80 advantage going into the fourth. The advantage grew to 19 in the fourth after LaVine's layup with 2:44 left.\n\n\"Our defense was just non-existent,\" Atkinson said.\n\nTIP-INS:\n\nBULLS: The win snapped Chicago's six-game losing streak to Brooklyn, and its four-game losing streak at Barclays Center. The Bulls had lost the three previous meetings this season.\n\nNETS: About 45 minutes before the opening tip-off, Brooklyn general manager Sean Marks spoke to reporters about the state of the team. While he spoke cautiously, Marks was unquestionably proud of how his team has played through the first 56 games. \"I give our players a heck of a lot of credit for how they've handled this first, you know, over half of the season,\" he said. \"It's really been led by them. They took the reins of this thing and they've been pushing and believing.\"\n\nCOMEBACK CARIS\n\nNets third-year guard Caris LeVert played for the first time since suffering a subtalar dislocation of the right foot in a 120-113 loss to the Timberwolves in Minnesota on Nov. 12. He had missed 42 games.\n\n\"It felt good to get back out there with the team,\" said LeVert, who finished with 11 points in nearly 15 minutes. \"Obviously we didn't get the win out there, but it felt good to be back.\"\n\nUP NEXT:\n\nBulls: Host Washington on Saturday night.\n\nNets: Visits Toronto on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995396.722014
}