{
  "game_id": "0022100534",
  "espn_id": "401360353",
  "date": "Dec 31, 2021",
  "matchup": "TOR vs. LAC",
  "headline": "Pascal Siakam scores 25, Raptors beat Clippers 116-108",
  "body": "TORONTO -- — Pascal Siakam had 25 points and matched his career-high with 19 rebounds, Fred VanVleet scored 31 points and the Toronto Raptors beat the Los Angeles Clippers 116-108 on Friday night.\n\n\r\n              OG Anunoby scored 26 points and Gary Trent Jr. had 10 as the Raptors won for the first time in three games and snapped a four-game losing streak against the Clippers.\n\n\r\n              Weakened by COVID-19 absentees in their last two games, Toronto welcomed VanVleet, Anunoby and Justin Champagnie back from health and safety protocols.\n\n\r\n              “It’s just good to have most of your weapons,” VanVleet said.\n\n\r\n              Raptors rookie Scottie Barnes also exited protocols, but was unavailable because of a sore right knee.\n\n\r\n              Anunoby, who missed 13 games in November and December because of a hip injury, started alongside Siakam for the first time since Nov. 15.\n\n\r\n              “It felt good tonight to have most everyone out there and just seeing how we can play together,” Siakam said.\n\n\r\n              Marcus Morris Sr. scored 20 points, Terance Mann had 18 and Reggie Jackson 17 as the Clippers lost for the second time in 14 games when leading after three quarters.\n\n\r\n              Amir Coffey scored a season-high 15 points for Los Angeles. Luke Kennard added 13 points.\n\n\r\n              The game was played in a mostly empty arena after the Ontario government reduced capacity limits to 1,000 people in an attempt to control the spread of COVID-19. No tickets were sold, and only a few dozen friends and family were allowed in. Toronto’s previous two home games had been limited to 50% capacity.\n\n\r\n              “That was more normal than not, to be honest with you,” VanVleet said. “I didn’t even think about it. We’ve probably played just as much, if not more, fan-less basketball than we have in packed stadiums.”\n\n\r\n              Clippers coach Tyronn Lue entered health and safety protocols Friday afternoon. He’s the 10th NBA coach to do so this season, but the first to have it happen in Canada. Assistant coach Brian Shaw coached in place of Lue.\n\n\r\n              “Coach did a great job stepping in, having us prepared and making adjustments on the fly,” Jackson said.\n\n\r\n              Jackson returned for the Clippers after missing the last four games, three while in the health and safety protocols. Los Angeles was without center Ivica Zubac, who entered the protocols Thursday.\n\n\r\n              Center Khem Birch started for Toronto, his first action since Nov. 21, while Precious Achiuwa was back after missing the last four games after being in the health and safety protocols.\n\n\r\n              The Raptors finished with 18 offensive rebounds, compared to three for the Clippers, outscored Los Angeles 21-3 in second-chance points, and had 96 field goal attempts to LA’s 78.\n\n\r\n              “To me, that’s the game right there in a nutshell,” Shaw said.\n\n\r\n              Toronto’s Chris Boucher snapped a 105-all tie with a pair of free throws with 2:08 remaining, and Siakam’s slam with 1:34 left gave Toronto a four-point edge.\n\n\r\n              Mann countered with a 3-pointer for the Clippers, but VanVleet drove for a layup and, after a missed 3 by Morris, added a decisive 3-pointer with 25 seconds left. Anunoby capped it at the free throw line as Toronto closed with a 7-0 run.\n\n\r\n              GOING VIRAL\n\n\r\n              Like Siakam, VanVleet missed time last season with a COVID-19 infection. He said it, “felt like my muscles were falling off the bone” in his return.\n\n\r\n              “The sickness was just definitely more intense and took more of a toll on my body,” he said.\n\n\r\n              This time, however, getting back on the court after battling the virus was significantly easier.\n\n\r\n              “This just felt like I was sitting at home for seven, eight days,” VanVleet said.\n\n\r\n              BOARD MEETING\n\n\r\n              The Raptors have recorded 19 offensive rebounds in a game twice this season, most recently in an overtime loss at Brooklyn on Dec. 14.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Zubac missed his first game of the season. He had played in 205 consecutive regular-season games. … Signed F Wenyen Gabriel to a 10-day contract under the COVID-related hardship allowance.\n\n\r\n              Raptors: F D.J. Wilson entered the health and safety protocols. … VanVleet made three of Toronto’s seven field goals in the third, and had all four Toronto assists in the quarter. He finished with nine assists.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Visit Brooklyn on Saturday.\n\n\r\n              Raptors: Host New York on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992753.3318348
}