{
  "game_id": "0022200904",
  "espn_id": "401469059",
  "date": "Feb 25, 2023",
  "matchup": "MIA @ CHA",
  "headline": "Williams, Hornets send Heat to 4th straight defeat 108-103",
  "body": "CHARLOTTE, N.C. -- — Gordon Hayward scored 21 points, rookie center Mark Williams had a huge game with 18 points and 20 rebounds — both career highs — and the surging Charlotte Hornets defeated the Miami Heat 108-103 on Saturday night for their season-best fourth straight win.\n\n\r\n              LaMelo Ball had 16 of his 19 points in the second half and finished with 13 assists for his sixth straight double-double. Kelly Oubre Jr. and Dennis Smith Jr. each had 15 points off the bench for the Hornets.\n\n\r\n              Tyler Herro had 33 points on six 3-pointers and Jimmy Butler added 28 points as Miami lost its fourth straight. Kevin Love had 13 points and 13 rebounds in his second game since joining the Heat.\n\n\r\n              Herro called losing games on back-to-back nights coming out of the All-Star break “disappointing.”\n\n\r\n              “This is a point in the year where we can either come together or we can go away and split,” Herro said. \n\n\r\n              The Hornets earned a season series split with the Heat, with each team winning twice at home.\n\n\r\n              Williams was a dominant force inside all night for the Hornets and scored the game's final four points on an alley-oop from Ball and a thunderous dunk of an offensive rebound to help bury the Heat. He finished 9 of 12 from the field.\n\n\r\n              “I think everybody viewed him as a talented defensive rim protector, but he has a chance to be a very good offensive player, too,\" Hornets coach Steve Clifford said of Williams, the 15th overall pick in last year's draft.\n\n\r\n              Williams stepped into a starting role when the team sent veteran Mason Plumlee to the Los Angeles Clippers at the trade deadline.\n\n\r\n              “The more and more I play, the more and more comfortable I get,\" Williams said. “Offensively, getting ready to catch passes from whoever, lobs, drop offs, on the offensive glass.”\n\n\r\n              Charlotte led by 22 in the first half before Miami clawed back to cut the lead to three at the break.\n\n\r\n              But Ball, who was 1 of 11 from the field in the first half, erupted with three 3-pointers in the first three minutes of the third quarter to set the tone for the second half. He added two more crucial 3s in the fourth quarter after Miami had cut the lead to one.\n\n\r\n              “He’s super confident and he puts so much time in, so that gives you confidence,” Clifford said. “He works at it and his game is in rhythm, so I think he feels like he's always going to be able to make them.”\n\n\r\n              Miami's offensive struggles — it has failed to reach 110 points in six straight games — carried over to the first half.\n\n\r\n              The Heat shot 20.8% from the floor in the first quarter to fall behind 29-16. Charlotte extended the lead to 22 in the second quarter before Miami closed the first half on a 24-6 run sparked by 10 points by Love and a pair of 3s from Herro.\n\n\r\n              “We put ourselves in a hole and it's just tough to get out of in this league with a bunch of good teams and good players,” Herro said. “That's on us as players to bring out best effort every night.” \n\n\r\n              Miami would cut the lead to one with under two minutes to play in the game on Bam Adebayo's driving dunk and had a chance to take the lead on its next possession. But Adebayo turned the ball over on a fast-break opportunity with 1:30 left.\n\n\r\n              Williams made the Heat pay with back-to-back baskets.\n\n\r\n              Miami failed to score on its final four possessions, turning it over twice.\n\n\r\n              TIP INS\n\n\r\n              Heat: Kyle Lowry (left knee soreness), Nikola Jovic (lower back stress reaction) and Omer Yurtseven (ankle surgery) did not play. ... Butler was 16 of 20 from the foul line.\n\n\r\n              Hornets: P.J. Washington (right foot soreness) and Cody Martin (left knee soreness) sat out. ... Dennis Smith Jr. had a monster one-handed dunk over Max Strus in the second quarter that brought the crowd to its feet, but was assessed a technical foul for talking trash after the play.\n\n\r\n              UP NEXT\n\n\r\n              Heat: At Philadelphia on Monday night.\n\n\r\n              Hornets: Host Detroit on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993936.309153
}