{
  "game_id": "0022200640",
  "espn_id": "401468795",
  "date": "Jan 13, 2023",
  "matchup": "SAC vs. HOU",
  "headline": "Sabonis has triple-double, Kings rout skidding Rockets",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had 19 points, a career-high 16 assists and 15 rebounds in his fourth triple-double of the season, and the Sacramento Kings beat the skidding Houston Rockets 139-114 on Friday night for their third straight win.\n\n\r\n              The Kings (23-18) moved five games over .500 for the first time since April 2006, when they made their most recent playoff appearance. \n\n\r\n              “You don’t just feel it at the arena, you feel it out and about in Sacramento,” Kings coach Mike Brown said of the response to the highest-scoring team in the NBA. “It’s genuine. You genuinely feel their joy when you talk to them... We love them to death, and we are happy that we can bring some joy to them.”\n\n\r\n              Sabonis joined Oscar Robertson as the only players in franchise history with at least 15 points, 15 rebounds and 15 assists in a game. Robertson did it 15 times for the Cincinnati Royals. \n\n\r\n              Harrison Barnes scored 27 points and De’Aaron Fox added 24. \n\n\r\n              “They were making a ton of 3s in transition,” Rockets coach Stephen Silas said. “We are a help team and we’re gonna give up some, but too many.”\n\n\r\n              With 11:09 left, Malik Monk, Chimezie Metu, Tari Eason and Garrison Matthews were all ejected. Monk and Matthews went face-to-face after a foul was called on Monk during a fast break.\n\n\r\n              “I had no issue with it,” Barnes said of the altercation. “At the end of the day that’s the fight that we need as a team, that’s the fight that we’ll need this season, and that’s the fight we’ll need for the playoffs.”\n\n\r\n              Jalen Green and Jabari Smith Jr. each scored 27 points for the Rockets (10-32). They have lost nine consecutive games and 14 of 15.\n\n\r\n              “Just my teammates trusting me,” Smith, the No. 3 pick, said of his career night. “Me trying to get to the basket more and trying to expand my game a little bit.\"\n\n\r\n              TIP-INS\n\n\r\n              Rockets: G Kevin Porter Jr. was ruled out with a bruised left foot.\n\n\r\n              Kings: G Kevin Huerter was ruled out for the second consecutive game with a non-COVID-19 illness. Terence Davis started in his place and scored 22 points. \n\n\r\n              UP NEXT\n\n\r\n              Rockets: Travel to Los Angeles to face the Clippers on Sunday.\n\n\r\n              Kings: Travel to San Antonio to face the Spurs on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995305.049357
}