{
  "game_id": "401810121",
  "espn_id": "401810121",
  "date": "Nov 20, 2025",
  "matchup": "MIL vs PHI",
  "headline": "Maxey scores career-high 54 points as 76ers outlast Bucks 123-114 in overtime",
  "body": "MILWAUKEE -- — Tyrese Maxey scored a career-high 54 points and tied the game by hitting two free throws with seven seconds left in the fourth quarter of the Philadelphia 76ers' 123-114 overtime victory over the Milwaukee Bucks on Thursday night.\n\n\r\n              Maxey's previous career high was a 52-point performance in a 133-126, double-overtime victory over San Antonio on April 7, 2024. He also had nine assists and played over 46 1/2 minutes.\n\n\r\n              Maxey, who entered Thursday averaging a league-high 40.3 minutes, had played 39 minutes one night earlier in a 121-112 home loss to the Toronto Raptors.\n\n\r\n              Milwaukee's Ryan Rollins scored 32 points to match a career high and also had a career-best 14 assists. The Bucks have lost four of their last five games.\n\n\r\n              Neither team had its former league MVP available.\n\n\r\n              Milwaukee’s Giannis Antetokounmpo, the MVP in 2019 and 2020, got hurt Monday at Cleveland and is expected to miss about two weeks. The Bucks labeled it a left groin strain Monday but have since specified that it’s a left adductor strain.\n\n\r\n              Philadelphia’s Joel Embiid, who won the award in 2023, missed a sixth straight game due to an issue with his right knee.\n\n\r\n              The 76ers scored the first five points in overtime on a 3-pointer from Justin Edwards – who scored just two points in regulation – and a basket from Maxey.\n\n\r\n              Milwaukee got the margin down to 113-112 on a driving layup from Rollins with 1:43 remaining, but Quentin Grimes hit a 3-pointer 20 seconds later and Philadelphia stayed ahead by at least two the rest of the way.\n\n\r\n              Milwaukee trailed 94-87 midway through the fourth quarter but rallied to take the lead on Myles Turner’s 3-pointer with 14.8 seconds remaining.\n\n\r\n              Philadelphia tied the game with seven seconds left when Maxey drove into the lane, drew a foul hit his free throws. Rollins missed a 3-pointer at the buzzer.\n\n\r\n              Paul George added 21 points for Philadelphia. Bobby Portis had 19 and Kyle Kuzma 17 for Milwaukee.\n\n\r\n              Up next\r\n              76ers: Host the Miami Heat on Sunday.\n\n\r\n              Bucks: Host the Detroit Pistons on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042662.870919
}