{
  "game_id": "401810196",
  "espn_id": "401810196",
  "date": "Dec 05, 2025",
  "matchup": "CLE vs SA",
  "headline": "Donovan Mitchell scores 28 points, Cavaliers beat Spurs 130-117",
  "body": "CLEVELAND -- — Donovan Mitchell had 28 points and eight assists, Jaylon Tyson scored 16 of his 24 points in the third quarter and the Cleveland Cavaliers rallied to beat the San Antonio Spurs 130-117 on Friday night.\n\n\r\n              Evan Mobley had 17 points and 10 rebounds, and Dean Wade added 12 points and eight rebounds for Cleveland, which won for the second time in its last six games and snapped a two-game skid at Rocket Arena. Mobley and Wade also each had five assists.\n\n\r\n              The Cavaliers, who trailed by 10 throughout the first half, used a 23-4 run in the third quarter to pull in front 98-81. Tyson scored 11 points during the 5 1/2-minute surge that fueled a 44-point period, giving Cleveland a 108-91 lead.\n\n\r\n              Devin Vassell had 25 of his 28 points and made seven 3-pointers in the first half for the Spurs. De’Aaron Fox had 25 points and nine assists, and Keldon Johnson added 14 points off the bench.\n\n\r\n              Vassell's 13 points in the first quarter and 25 in the opening half were season highs for San Antonio, which is 4-3 during its ongoing stretch of playing in nine cities over an 18-day span. The Spurs only play once at home between Nov. 21 and Dec. 16.\n\n\r\n              Spurs rstar Victor Wembanyama missed his 10th straight game with left calf tightness, while guard Stephon Castle sat out his ninth in a row with left hip soreness. Coach Mitch Johnson said both are “definitely progressing in the right direction.”\n\n\r\n              Center Luke Kornet also was inactive after spraining his left ankle Thursday in Orlando.\n\n\r\n              The Cavaliers were without three starters in point guard Darius Garland (left great toe soreness), center Jarrett Allen (right third finger strain) and small forward Sam Merrill (right hand sprain).\n\n\r\n              Up next\r\n              Spurs: At New Orleans on Monday night.\n\n\r\n              Cavaliers: Host Golden State on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042757.155838
}