{
  "game_id": "0022301069",
  "espn_id": "401585697",
  "date": "Mar 29, 2024",
  "matchup": "PHX @ OKC",
  "headline": "Josh Giddey scores 23 points, Thunder rout Suns 128-103 without Gilgeous-Alexander",
  "body": "OKLAHOMA CITY -- — Oklahoma City's No. 4 scorer has been playing more like a first option lately.\n\n\r\n              Josh Giddey scored 23 points to help the Thunder roll past the Phoenix Suns 128-103 on Friday night, despite All-Star guard Shai Gilgeous-Alexander sitting out with a bruised right thigh.\n\n\r\n              Giddey, who averages about 12 points, has averaged 26.3 in his past three games. He made 10 of 15 field goals against Phoenix and had nine assists and seven rebounds. He’s helping the Thunder stay well-positioned for the postseason — Oklahoma City tied with the Minnesota Timberwolves for the best record in the Western Conference.\n\n\r\n              Giddey said he struggled early in the season as he struggled with his shot teams sagged off of him. \n\n\r\n              “Probably the first, you know, 50 or so games, I used to overthink everything,\" he said. \"A lot of the time when I would touch the ball, I would think too much about what I’m doing. And it’s hard to play that way. You know, it’s hard to play freely and comfortably when that’s what’s happening.\"\n\n\r\n              He's made 65% of his field goals in the three-game stretch.\n\n\r\n              “Now I’ve kind of changed my mindset going into games where it’s like, if teams are going to leave me open, I’m going to punish them and I’m going to make them pay and make them change their defensive scheme,” he said. \n\n\r\n              The effort to fill Gilgeous-Alexander's void was collective Friday. Chet Holmgren scored 20 points and Jalen Williams and Cason Wallace each added 16 for Oklahoma City. Without Gilgeous-Alexander, the NBA’s No. 3 scorer at 30.4 points per game, the Thunder still shot 56.3% and made 16 of 30 3-pointers. \n\n\r\n              Kevin Durant scored 26 points for the Suns. Thunder fans still haven't forgiven him for leaving Oklahoma City to join the Golden State Warriors after the 2015-16 season. They booed him during pregame introductions and whenever he touched the ball once the game started.\n\n\r\n              Oklahoma City swept the season series 3-0, something Durant doesn’t consider a big deal.\n\n\r\n              “I like our chances of getting anybody regardless,” he said. “Who knows, maybe we’ll see them again. But you’ve got to tip your hat to them. They play a great brand of basketball.”\n\n\r\n              Bradley Beal scored 15 points and Devin Booker added 14 for the Suns, who slipped as they try to avoid the Play-In Tournament. They started the night in seventh in the Western Conference, a half- game behind the Dallas Mavericks for sixth. The Suns need to finish sixth or better to stay out of the Play-In.\n\n\r\n              Oklahoma City shot 62% in the first half to lead 70-59 at the break. Isaiah Joe scored all 14 of his points in the first half and made all four of his 3-pointers. The Thunder made 8 of 11 threes before the break. \n\n\r\n              The Thunder continued their blistering shooting in the third quarter. Oklahoma City's Aaron Wiggins stole an errant Durant pass, then made a layup on the other end to put the Thunder ahead 90-68. Oklahoma City led 101-80 at the end of the period.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At New Orleans on Monday night.\n\n\r\n              Thunder: At New York on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996637.0180721
}