{
  "game_id": "401810054",
  "espn_id": "401810054",
  "date": "Nov 10, 2025",
  "matchup": "DET vs WSH",
  "headline": "Cunningham scores 46 points, rallies Pistons to a 137-135 victory over the Wizards in overtime",
  "body": "DETROIT -- — Cade Cunningham scored a career-high 46 points on a whopping 45 shots, Daniss Jenkins made the tying 3-pointer to force overtime and the Detroit Pistons rallied to beat the Washington Wizards 137-135 on Monday night.\n\n\r\n              Cunningham finished with 12 rebounds, 11 assists, five steals and two blocked shots, becoming the first player to reach all those totals in a game since the NBA began tracking steals and blocks in 1973-74. \n\n\r\n              He helped will the Eastern Conference-leading Pistons to their seventh straight victory on a night he shot just 14 for 45, by far the most field goal attempts in the NBA this season.\n\n\r\n              Jenkins scored a season-high 24 points and Jalen Duren had 19 points and 14 rebounds as the Pistons improved to 9-2.\n\n\r\n              CJ McCollum scored a season-high 42 points for the last-place Wizards, but he missed twice in the closing seconds as they lost their ninth straight and fell to 1-10.\n\n\r\n              McCollum's 3-pointer gave Washington a 117-108 lead with 4:05 remaining in regulation. But Cunningham, the reigning Eastern Conference player of the week, brought the Pistons back and they tied it when he inbounded to Jenkins in the corner for a 3-pointer that tied it at 127. \n\n\r\n              Duncan Robinson's 3-pointer with 1:04 left in overtime gave Detroit the lead for good at 134-133.\n\n\r\n              Cunningham shot 2 for 11 from 3-point range but 16 of 18 from the free throw line in his 12th career triple-double. The previous high in the NBA this season was 32 field goal attempts, done by three players. \n\n\r\n              Cam Whitmore scored 20 points and Alex Sarr had 15 points and 15 rebounds for the Wizards.\n\n\r\n              Up next\r\n              Wizards: At Houston Rockets on Wednesday.\n\n\r\n              Pistons: Host Chicago Bulls on Wednesday in the second game of a four-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042596.323812
}