{
  "game_id": "0021800562",
  "espn_id": "401071238",
  "date": "Jan 02, 2019",
  "matchup": "OKC @ LAL",
  "headline": "Paul George gets 37 amid boos in OKC's 107-100 win at Lakers",
  "body": "LOS ANGELES --  Paul George got booed last season in Indianapolis because he left. He got booed by Lakers fans on Wednesday night because he never arrived.\n\nThe Oklahoma City star learned from the first experience and translated it into a performance that quieted Staples Center.\n\nGeorge scored 37 points while getting jeered whenever he touched the ball by Lakers fans still angry he didn't choose their team in free agency, leading the Thunder to a 107-100 victory over Los Angeles.\n\nRussell Westbrook had 14 points, 16 rebounds and 10 assists despite 3-for-20 shooting, but his fellow Southern California native was the center of attention in the Thunder's only visit to the Lakers this season.\n\n\"I was prepared for it,\" George said. \"I'm the bad guy, and that's fine.\"\n\nThe boos started in pregame introductions for George, whose perceived crime is his decision to re-sign quickly with Oklahoma City when he became a free agent last summer despite years of mutual interest between the scoring sensation and the Lakers.\n\nGeorge grew up idolizing Kobe Bryant while rooting for both the Lakers and Clippers in Palmdale, California, on the far-flung edge of Los Angeles suburbia. Yet he didn't even deign to meet with the Lakers about a return to his home state after years of hopeful speculation by Lakers fans and Magic Johnson, who wanted to team LeBron James with George.\n\n\"I'm not the only guy from SoCal, the LA area, that didn't decide to play here,\" George said. \"You can go down the whole list of guys from this beautiful city. It is what it is. The decision has been made. No ill will.\"\n\nAt least not on George's part -- but he got the last laugh on his haters despite struggling with early foul trouble.\n\nAfter collecting 13 points in the second quarter and 11 more in the third, George scored nine points in the fourth while the Thunder rallied from a five-point deficit and easily held on for their seventh win in 10 games.\n\n\"I feel like every game is important to him, so I don't want to say that he was extra amped up for this game,\" Oklahoma City coach Billy Donovan said. \"Obviously the Lakers have great history, great tradition. It's a great place to play, great environment ... but as it relates to his personal feelings, I think he's probably best to answer that.\"\n\nWhen George returned to face the Pacers on Dec. 13, 2017, he managed just 12 points on 3-of-14 shooting amid scathing boos. He had been traded five months earlier after seven seasons with the Pacers, who shipped him to Oklahoma City instead of the Lakers, widely thought to be his preferred destination.\n\n\"I thought I handled it better tonight, given I've been in that situation before in Indy now,\" George said. \"It was just being locked, being ready. In Indy, I expected to be booed, but I didn't know to what extent. Here, coming into this situation, I knew what to expect.\"\n\nKentavious Caldwell-Pope scored 18 of his 25 points in the first half for the Lakers, who dropped to 1/3 during James' absence with a groin injury. Los Angeles has lost six of nine after managing just six field goals in the fourth quarter, along with the Lakers' usual awful free-throw shooting.\n\nGeorge struggled with his outside shooting, going 2 of 11 from beyond the arc, but otherwise carved up the Lakers' perimeter defense. George and the Thunder appeared to draw motivation from the booing: George got a technical foul for slapping the backboard after slamming an alley-oop from Westbrook, who mimicked Lakers guard Lance Stephenson's air guitar celebration moments later when George drew a foul from Stephenson while hitting a jumper.\n\n\"It was fun,\" George said. \"The booing wasn't going to throw me off my game. I've been playing basketball for a really long time. A little booing and a little noise wasn't going to make me forget how to play basketball.\"\n\nSome Lakers fans still chanted \"We don't need you!\" at George in the fourth quarter while he sewed up the win.\n\n\"I thought the effort and competitive level was top-notch for us,\" Lakers coach Luke Walton said. \"We were getting good looks. We just weren't making them.\"\n\nTIP-INS\n\nThunder: Spanish guard Alex Abrines missed his fifth consecutive game for personal reasons. ... The Thunder host the Lakers on Jan. 17.\n\nLakers: Rajon Rondo also missed his fourth straight game and watched from the bench. The veteran point guard won't be back from hand surgery for a month. ... Michael Beasley missed his 13th consecutive game.\n\nBIG NUMBERS\n\nWestbrook recorded his 115th career triple-double despite his horrific shooting, which included a 1-of-7 showing on 3-pointers. Westbrook still has 11 triple-doubles this season and eight in his last 15 games.\n\nAILING LAKERS\n\nJames watched from the Lakers' bench in street clothes. The four-time NBA MVP has resumed shooting, but Walton still isn't guessing how long he will be out. Kyle Kuzma also sat out the second half for the Lakers with a bruised lower back. He will have an MRI exam Thursday.\n\nUP NEXT\n\nThunder: At Trail Blazers on Friday.\n\nLakers: Host Knicks on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994592.453711
}