{
  "game_id": "0022400800",
  "espn_id": "401705366",
  "date": "Feb 21, 2025",
  "matchup": "TOR vs. MIA",
  "headline": "Tyler Herro scores 28 points as Heat beat Raptors 120-111 in overtime to snap 4-game skid",
  "body": "TORONTO -- — Tyler Herro scored 10 of his 28 points in the fourth quarter and overtime, Andrew Wiggins added 25 points and the Miami Heat snapped a four-game skid by beating the Toronto Raptors 120-111 on Friday night.\n\n\r\n              Miami’s Bam Adebayo had 19 points and 12 rebounds, and Heat guard Davion Mitchell scored 16 points against the team that traded him earlier this month.\n\n\r\n              Duncan Robinson scored 14 points as Miami won for the first time since Feb. 5 at Philadelphia.\n\n\r\n              In the fourth and final meeting of the season between the Heat and Raptors, Miami became the first road team to win.\n\n\r\n              RJ Barrett scored 29 points for Toronto, Immanuel Quickley had 23 and Scottie Barnes added 13. Gradey Dick had a career-high 10 rebounds for the Raptors, who lost for the sixth time in seven games.\n\n\r\n              Barnes and Adebayo missed driving shots on their teams' final possessions of regulation. Wiggins tried to tip in Adebayo’s miss but Barrett blocked it to force overtime.\n\n\r\n              Takeaways\r\n              Heat: Adebayo scored six points in the extra period as Miami won in overtime on the road for the first time in four tries this season.\n\n\r\n              Raptors: Barnes was helped off the court late in the first after appearing to injure his right ankle. Fans cheered when the 2022 Rookie of the Year returned midway through the second.\n\n\r\n              Key moment\r\n              Toronto erased a 14-point first-half deficit to take the lead in the final minute of regulation, but Wiggins tied it at 107-all by making three free throws after a costly foul by Barrett.\n\n\r\n              Key stat\r\n              Miami coach Erik Spoelstra won his 886th game, passing Red Auerbach and moving into third in NBA history in wins by a coach with one team. Gregg Popovich has 1,582 victories and Jerry Sloan had 1,223.\n\n\r\n              Up next\r\n              Both teams play Sunday. Miami visits Milwaukee and the Raptors host Phoenix.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996949.108094
}