{
  "game_id": "0022000712",
  "espn_id": "401307501",
  "date": "Mar 29, 2021",
  "matchup": "MEM @ HOU",
  "headline": "Valanciunas has season-best 30 points, Griz beat Rockets",
  "body": "HOUSTON -- — Jonas Valanciunas scored a season-high 30 points, including eight down the stretch, to help the Memphis Grizzlies outlast the Houston Rockets 120-110 on Monday night. \n\n\r\n                    It was a much different game than Houston’s last meeting with Memphis, when the Grizzlies routed the Rockets 133-84, but the outcome was the same. Houston led by as many as 12 points in this one and was up by a point entering the fourth. But, the Rockets couldn’t hold on late and lost for the third time in four games. \n\n\r\n                    Valanciunas, who had 15 rebounds, made two consecutive baskets to extend the Memphis lead to 114-106 with two minutes to go. Danuel House Jr. made one of two free throws for Houston after that . Valanciunas then added another basket to extend the lead. \n\n\r\n                    Jae’Sean Tate, who had 24 points, hit a 3 for Houston before Valanciunas struck again, adding a dunk with about 30 seconds to go to make it 118-110.\n\n\r\n                    “Down the stretch our defense was solid,\" Memphis coach Taylor Jenkins said. “We did a great job rotating and making them take heavy, contested shots.\" \n\n\r\n                    Kelly Olynyk had a season high 25 points to lead the Rockets in his second game since being traded from Miami as part of the Victor Oladipo deal on Thursday. \n\n\r\n                    “He opens up things a lot, not just with his scoring ability, but with his ability to find the open man,\" Tate said. “He’s been great.\" \n\n\r\n                    De’Anthony Melton added 23 points off the bench for the Grizzlies, who snapped a two-game skid. \n\n\r\n                    “Our depth was on full display tonight,\" Jenkins said. “Those guys are hungry to go out there and make a difference. ... We definitely needed all that production off the bench to get that win.\" \n\n\r\n                    Houston cut the lead to a point on a three-point play by Olynyk with about seven minutes left before the Grizzlies scored the next five points that made it 110-104 with five minutes to go. \n\n\r\n                    The Rockets were up by 10 in the third when the Grizzlies went on a 10-2 spurt to cut the lead to 82-80. Dillon Brooks and Melton powered that run, scoring five points each. \n\n\r\n                    Houston had built the lead again late in the third quarter before another 10-2 run by Memphis cut the lead to a point entering the fourth. Melton took over in that stretch, scoring eight of 10 points with two 3-pointers.\n\n\r\n                    There were plenty of lows in Houston’s franchise-record 20-game losing streak that ended March 22. But that lopsided loss to the Grizzlies on Feb. 28 had to be the lowest point. The 49-point win was the biggest victory in team history and the 85 points the Memphis reserves scored in that game was also a franchise record. \n\n\r\n                    This team is a lot different than that one after the trades of P.J. Tucker and Oladipo brought several new players to Houston, led by Olynyk.\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Brooks received a flagrant foul 1 in the second quarter when he hit Wall in the head as he drove for a basket. ... Justise Winslow sat out with a sore right thigh. ... Desmond Bane and Brooks scored 17 points each. ... Grayson Allen injured his hip on Monday. X-rays were negative but Jenkins isn't sure if he'll be available on Wednesday.\n\n\r\n                    Rockets: D.J. Augustin received a flagrant foul 1 for pushing Kyle Anderson in the chest in the second quarter. ... Christian Wood sat out with an illness after missing Saturday’s game with a sore right ankle. ... Avery Bradley had three points in his debut after being acquired in a trade on Thursday.\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Host Utah on Wednesday night. \n\n\r\n                    Rockets: Begin a two-game trip against James Harden and the Brooklyn Nets on Wednesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996944.8199291
}