{
  "game_id": "0022200188",
  "espn_id": "401468343",
  "date": "Nov 12, 2022",
  "matchup": "ATL @ PHI",
  "headline": "Embiid scores season-best 42 points, 76ers top Hawks 121-109",
  "body": "PHILADELPHIA -- — Joel Embiid had a season-high 42 points and 10 rebounds as the Philadelphia 76ers turned a blistering shooting performance in the first half into a 121-109 win over the Atlanta Hawks on Saturday night.\n\n\r\n              “The standards are high and I'm OK with that,” said Embiid, who shot 14 of 25 in his 28th career game with at least 40 points. “I have to do whatever it takes to win. If it takes playing 40 minutes to win or taking 20 or 30 shots or getting 10 assists, that's what I have to do.”\n\n\r\n              Tyrese Maxey scored 26 points, Tobias Harris added 21 and Embiid had six assists for the Sixers. Philadelphia lost in Atlanta 104-95 on Thursday night.\n\n\r\n              “It was wide open,” said Maxey, who had nine assists. “We had to go right through them and that’s what we did tonight.”\n\n\r\n              Trae Young scored 27 points and Dejounte Murray added 21 for the Hawks, who had a 43-31 rebounding advantage — including a 12-2 advantage on the offensive glass — but struggled by shooting just 24 percent from beyond the 3-point arc.\n\n\r\n              “We never established defense,” Hawks head coach Nate McMillan said. “The first three quarters, they came out and put up 37 points, then 30 and 32. ... We did continue to fight, but we had 19 turnovers and when you give up 34 points, you are not going to win that game.”\n\n\r\n              Embiid and the Sixers went right at Hawks center Clint Capela by posting him just outside the paint, allowing the option for a turnaround jumper or a skip pass to a wide-open Harris or Maxey when Atlanta came over in coverage. \n\n\r\n              Embiid scored Philadelphia first 10 points of the game and then became a distributor as the Sixers raced out to a big lead in the first half by shooting 58.1% from the floor. \n\n\r\n              “There's so much attention (paid to him defensively) and I'm a willing passer,\" Embiid said. “All credit to my teammates for making great cuts. Tonight, we played well together and we moved well without the ball. We shot the ball well. That's the way we should play every night.”\n\n\r\n              Atlanta kept chipping away, cutting a 27-point deficit to six late in the fourth with Young and Murray driving into the lane and kicking out. A late five-point Philadelphia run in the last 2:30 of the game held off the Hawks' surge.\n\n\r\n              “You are not going to get into a flow when you are turning the ball over and you aren't getting any stops,” McMillan said. “We have to get some stops so we can get out and get something easy going to the basket.”\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Forward Onyeka Okongwu missed Saturday night's game for what Atlanta described as personal reasons. ... Bogdan Bogdanovic worked out before the game as he continues his recovery from a right knee injury that has sidelined him the first 13 games of the season. \n\n\r\n              76ers: Sixers guard Furkan Korkmaz suffered a left knee injury in the second quarter and was declared out before halftime. ... Guard De'Anthony Melton, who started and played 29 minutes in Philadelphia's loss to Atlanta on Thursday night, missed Saturday's game with stiffness in the left side of his back. \n\n\r\n              UP NEXT\n\n\r\n              Hawks: Travel to Milwaukee for a Monday night game against the Bucks. It will be the third meeting between the teams in 16 days, with each side winning once so far.\n\n\r\n              76ers: Hosts Utah on Sunday night in the second game of a five-game homestand.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995211.443933
}