{
  "game_id": "0021501047",
  "espn_id": "400828934",
  "date": "Mar 21, 2016",
  "matchup": "MIL @ DET",
  "headline": "Drummond's tip-in lifts Pistons over Bucks 92-91",
  "body": "AUBURN HILLS, Mich. --  Stan Van Gundy took Andre Drummond out fairly early in the third quarter because the franchise center wasn't showing enough energy.\n\nDrummond was a different player after he went back in, and he came through in a big way for Detroit at the end.\n\nDrummond's tip-in with 2 seconds remaining lifted the Pistons to a 92-91 victory over the Milwaukee Bucks on Monday night. Drummond had eight points and six rebounds in the final period.\n\n\"I thought he played a lot better in the fourth quarter,\" Van Gundy said. \"I just didn't think he was bringing us any energy in the third quarter. ... I would like to see our starters take more responsibility in terms of an energy and intensity.\"\n\nThe Pistons (37-34) are a percentage point behind Chicago (36-33) for the last playoff spot in the Eastern Conference. Detroit came out inexplicably flat Monday and trailed by 17 points in the first half. The Pistons were down 13 in the third quarter before chipping away at Milwaukee's lead in the fourth.\n\nDrummond was outplayed early on by Greg Monroe, but when Kentavious Caldwell-Pope missed from the perimeter in the final seconds, he was able to tip the ball in. The Bucks weren't able to get a clean shot off after that.\n\n\"Just was in the right place at the right time,\" said Drummond, the NBA's leading rebounder. \"To come out with that type of win at the end of the game is pretty satisfying.\"\n\nKhris Middleton led Milwaukee with 27 points, and Giannis Antetokounmpo added 21. Monroe had 18 points and 10 rebounds.\n\n\"We play great defense on their last shot, force a miss and the ball bounces to the best offensive rebounder in the league,\" Milwaukee coach Jason Kidd said. \"We did just about everything right and still lost the game.\"\n\nThe Bucks were up 91-88 after Middleton's jumper with 30 seconds left. Reggie Jackson's driving basket cut the lead to one, and Milwaukee's Jerryd Bayless missed two free throws with 10 seconds left, giving the Pistons a chance to win it.\n\n\"If you hang in there, sometimes you get a chance to get lucky, and we got lucky at the end,\" Van Gundy said. \"But you have to hang in there to give yourself a chance to get lucky.\"\n\nMarcus Morris scored 21 points for Detroit. He went 4 of 4 from 3-point range, while the rest of the team went 5 of 29.\n\nDetroit was down 36-19 in the first half but came all the way back to tie it before the second quarter was over. Milwaukee led 48-45 at halftime, then the Bucks made their first five shots of the third. Milwaukee was up 74-65 after three.\n\nDEFENSIVE STRUGGLES\n\nThe Pistons have won three straight, but they've let the opposition shoot at least 50 percent in each of those games.\n\n\"I want this to be a very positive press conference,\" Van Gundy said afterward. \"But I can't sit here and tell you, like, we defended. We didn't.\"\n\nRARE MISSES\n\nBayless is an 82 percent free throw shooter for his career, but his misses at the end of the game proved costly.\n\n\"They both felt great coming out of my hand, and they just didn't go in. There's nothing else you can do in that situation,\" he said. \"We played great defense and left them with a tough shot. Drummond just made a play.\"\n\nTIP-INS\n\nBucks: Milwaukee outscored the Pistons 54-38 in the paint. ... Middleton was drafted in the second round by Detroit in 2012, then was traded to the Bucks after one season. Monroe went from Detroit to Milwaukee last offseason via free agency.\n\nPistons: Morris made a four-point play in the second quarter. He is 16 of 21 from 3-point range over the past six games. ... Detroit was in the fourth game of a nine-game homestand.\n\nUP NEXT\n\nBucks: At Cleveland on Wednesday night.\n\nPistons: Host Orlando on Wednesday night.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994008.375173
}