{
  "game_id": "0021900675",
  "espn_id": "401161317",
  "date": "Jan 24, 2020",
  "matchup": "HOU @ MIN",
  "headline": "Westbrook scores season-high 45, Rockets beat Wolves 131-124",
  "body": "MINNEAPOLIS --  When James Harden went through shooting slumps in the past, the Houston Rockets would be hard-pressed to survive lackluster production from their star guard.\n\nWith Russell Westbrook, Houston has another player who can shoulder a huge scoring burden.\n\nWestbrook scored a season-high 45 points and had 10 assists, and the Rockets overcame another tough night from Harden to rally past the Minnesota Timberwolves 131-124 on Friday night.\n\nWestbrook helped key a second-half comeback after Minnesota led by six points in the third quarter. He finished 16-of-27 shooting, was 13 of 13 from the free-throw line and added six rebounds. Eric Gordon scored a season-high 27 points off the bench for Houston, which won its second straight game following a season-long, four-game losing streak.\n\n\"That's MVP Russ,\" Rockets coach Mike D'Antoni said.\n\nHarden, who went 1 for 17 from 3-point range in a home loss to Oklahoma City on Monday night, was 3 of 13 overall and 0 for 6 from beyond the arc against Minnesota. He finished with a season-low 12 points. Harden also left the game in the third period after taking a knee from Karl-Anthony Towns to his thigh. He was limping badly but returned in the fourth.\n\nOver his past five games, Harden is shooting 33% from the field.\n\n\"Guys are playing well, and that's what we need throughout the course of the year,\" Harden said. \"Russ got it going, Eric made some big-time shots. Austin (Rivers) played well. That's what you need. Tonight was just a great team win for us.\"\n\nAccording to Stats, it was the second time in Harden's career that he started a game and a teammate outscored him by at least 33 points. The other occasion was Feb. 2, 2011, with the Thunder, when Kevin Durant had 43 points to Harden's seven.\n\nTowns had 30 points and 12 rebounds for Minnesota, which has lost eight straight. Andrew Wiggins scored 28 points for the Timberwolves.\n\n\"We didn't come out with the win, but we fought very well and competed very well,\" Towns said. \"We did a lot of good things defensively, actually, doing a lot of good things and sticking to our game plan. Russell hit some big shots. He was MVP for a reason, and in the fourth quarter he hit some really big shots, especially in the second half.\"\n\nAfter Wednesday's 117-110 loss at Chicago, Minnesota coach Ryan Saunders said the team is simply not playing well. Saunders also challenged Wiggins at halftime of that game to be more productive.\n\nThe Wolves started strong while Houston was missing shots. Minnesota led by six in the opening quarter. The Rockets hit just two of their first 11 shots and Harden was 1 of 5. The Rockets also trailed in Minnesota in November before recovering for a 125-105 win.\n\nLed by Westbrook, Houston led by as many as 13 on Friday, but the Wolves didn't fade.\n\nMinnesota cut the Rockets' lead to 110-108 with 6 minutes remaining.\n\nHouston had the finisher in Westbrook. He scored 15 points in the fourth quarter, including 11 after the Wolves closed within two.\n\n\"There's a reason Russell Westbrook and James Harden are who they are, and why that team is so dangerous,\" Saunders said. \"If one guy has a night where he's not reaching his average, you have another guy who can pick up the scoring load. I liked a lot of things tonight. The effort. Obviously did not like the outcome.\"\n\nWESTBROOK'S BURST\n\nWestbrook has averaged 33.6 points, 8.7 rebounds and 9.1 assists over the last seven games. His season-high scoring output came without him attempting a 3-pointer. He is the first guard since Dwyane Wade in 2007 to score at least 45 points without a 3-point try.\n\n\"I was only taking shots I wanted to take,\" Westbrook said. \"That's me just maturing in this game and figuring out my spots and shooting the ball when I'm ready to.\"\n\nRUNNING WOLVES\n\nThe Wolves emphasized getting out on the break more against Houston, and responded with 18 fast-break points.\n\n\"And I don't think we were playing fast enough,\" Saunders said. \"The way we were getting some of the 18 fast-break points were the ways we want to get them.\"\n\nTIP-INS\n\nRockets: Houston scored 23 points off 17 Minnesota turnovers. ... The Rockets only had 10 turnovers, leading to 13 points for the Wolves. ... Westbrook is averaging 26.8 points per game this season. No teammate has averaged more than 18.6 points per game in any of Harden's seven seasons with Houston.\n\nTimberwolves: Josh Okogie started in place of rookie Jarrett Culver, in part for matching up against Harden. Okogie finished with 17 points. ... Starting PG Shabazz Napier left the game late in the second quarter, limping off the court. He returned for the second half and had nine points, five rebounds and five assists. ... Minnesota outrebounded Houston 52-34. The Wolves grabbed 36 rebounds in the first half, tied for the second most all-time franchise history for a half. They had 36 in the first half against Memphis on April 12, 2008.\n\nUP NEXT\n\nRockets: At Denver on Sunday.\n\nTimberwolves: Host Oklahoma City on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996631.0531158
}