{
  "game_id": "0021501150",
  "espn_id": "400829037",
  "date": "Apr 03, 2016",
  "matchup": "CHI @ MIL",
  "headline": "Jimmy Butler scores 25 points, Bulls hold off Bucks 102-98",
  "body": "MILWAUKEE -- Jimmy Butler shined inside a familiar arena, then exchanged his Chicago Bulls jersey in the postgame locker room for a powder blue Marquette uniform like the one he wore during his college days.\nButler sure felt at home Sunday night at the Bradley Center.\nThe former Golden Eagles star scored 25 points on 10-of-11 shooting while adding eight assists, and Chicago held off a second-half surge by the Milwaukee Bucks for a 102-98 win Sunday night.\nButler had six points and an assist in the final 3:45, when the Bucks had narrowed a 19-point deficit to one at 87-86.\n\"The beginning of the game was great. The end of the game was good,\" Bulls coach Fred Hoiberg said. \"That third quarter, we have to figure out a way to come out and bury a team when you've got them down.\"\nThe Bulls came up with an answer just in time in the closing minutes.\nJustin Holiday hit a tough jumper from the corner with 1:15 left and later grabbed a defensive rebound on a missed finger roll by Milwaukee's Giannis Antetokounmpo with 43.9 seconds to go.\nThe Bulls stayed two games back of Indiana and Detroit, who were tied for seventh and occupied the last two spots in the Eastern Conference playoff race.\n\"I think it's how our backs are against the wall right now, and how we have to win every game and play every possession like it's the last one,\" Butler said about how the team held up in the end.\nAntetokounmpo scored a career-high 34 points, while Jabari Parker added 24 for Milwaukee. The Bucks' franchise cornerstones had their way for much of the night with an array of drives and moves in the paint.\nBut Milwaukee came up just short while playing without scorer Khris Middleton, who was a late scratch with a strained left thigh.\n\"We missed Khris,\" Antetokounmpo said. \"I told (Parker) before the game we have to be aggressive, we have to push the team. We have to make the other guys play hard and just try to compete.\"\nBUTLER DID IT\nWith point guard Derrick Rose sidelined, the offense went through Butler in the final minutes in familiar surroundings. Marquette plays its home games at the Bradley Center.\nButler followed a dunk with a driving layup with 3:04 left after the Bucks had drawn to within one. Butler found Holiday in the corner for his tough jumper for a four-point lead with 1:17 left.\nFor a while in the second quarter, the Bulls looked as if they had never missed Rose or fellow injured starter Taj Gibson.\nChicago tracked down loose balls and hit open 3s, going 3 of 5 from behind the arc in the second. The Bucks coughed up six turnovers in the second and had trouble especially making clean entry passes.\nBy halftime, Chicago had raced out to a 57-41 lead. It was a bit more nerve-racking for the Bulls in the second half.\n\"They don't go by points for who's in the eighth seed. It's all about winning and losing,\" Butler said. \"If we continue to win, hopefully we'll find ourselves\" in the postseason.\nNikola Mirotic added 19 points and six rebounds for Chicago.\nFIRST FORWARDS\nAntetokounmpo and Parker instigated the Bucks' comeback, just like in a first quarter when they combined for 24 points on 7-of-11 shooting.\nBut without Middleton, the already short-handed team had to give even more minutes to less-proven players.\n\"We tried our best. We were limited, just one guy away from beating them,\" Parker said.\nTIP-INS:\nBulls: Rose missed a second straight game after testing his sore left elbow in pregame warmups. ... Gibson missed a third straight game with a rib contusion. Hoiberg said he would test the injury Monday.\nBucks: Rookie Rashad Vaughn started a second straight game, with veteran G Jerryd Bayless missing a second consecutive game with a hyperextended right knee. ... NBA Hall of Famer David Robinson sat courtside and watched as his son, Corey, sang the national anthem. The younger Robinson is a receiver at Notre Dame.\nUP NEXT:\nBulls: At the Memphis Grizzlies on Tuesday.\nBucks: Host the Cleveland Cavaliers on Tuesday.\n---\nFollow Genaro Armas at http://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764993894.816681
}