{
  "game_id": "0021800035",
  "espn_id": "401070222",
  "date": "Oct 20, 2018",
  "matchup": "LAL vs. HOU",
  "headline": "Fight in LeBron's home Lakers debut, 124-115 loss to Houston",
  "body": "LOS ANGELES --  Once the fists started flying late in the fourth quarter, LeBron James' home debut with the Los Angeles Lakers was relegated to the undercard.\n\nA wild multiplayer fight that included the normally mild-mannered Chris Paul and Brandon Ingram stole part of the spotlight shining on LeBron's official landing on the West Coast.\n\nThe Houston Rockets stole the rest with a gritty victory.\n\nJames scored 24 points, but Paul, Ingram and Rajon Rondo all were ejected after trading blows late in the Rockets' 124-115 win Saturday night.\n\nBefore the late drama overshadowed everything, James got several big ovations from a tremendously lively sellout crowd in his first home game since joining the Lakers as a free agent.\n\n\"The atmosphere was great,\" James said. \"The fans were extremely excited. We gave them everything that we could. Wish we could have gave them more with this win, but it was very electric.\"\n\nBut perhaps that energy -- and a flagrant foul by Houston's James Ennis III against Josh Hart earlier in the fourth quarter -- contributed to the shocking fight that broke out with 4:13 to play.\n\nThe Rockets were clinging to a 109-108 lead when Ingram was called for a foul while trying to defend an aggressive drive by James Harden, who finished with 36 points.\n\nFurious with the call, Ingram shoved Harden and then confronted referee Jason Phillips after getting a technical foul.\n\nIn the ensuing group argument, Paul stuck a finger into the face of Rondo, who responded by punching his fellow point guard. Ingram then threw punches in the melee. James attempted to break up the fight by grabbing Paul, his friend.\n\nPaul claimed Rondo caused their fight by spitting on him.\n\n\"Unacceptable,\" Houston's Carmelo Anthony said. \"We all know what happened. Ain't no need to keep going back and forth about that. What happened was unacceptable. It shouldn't have happened.\"\n\nRondo's teammates said they didn't know whether Paul's claim was accurate. Lakers coach Luke Walton said his players were playing with extra aggravation after Ennis clotheslined Hart on a flagrant foul 4  1/2 minutes earlier.\n\n\"I felt like the other team was trying to provoke us, and we fell for it,\" said the Lakers' Lance Stephenson, another peacemaker in the brawl.\n\nWhen tempers cooled after a nearly 10-minute break, Houston finished the game on a 15-8 run. Harden hit a key 3-pointer with 1:12 left to propel the Rockets to their first win of the season.\n\n\"We played amazing tonight, and I feel like the fight probably put us back,\" said JaVale McGee, who had 16 points and six rebounds in his own Lakers home debut. \"If there wasn't the fight, we probably would have won that game.\"\n\nPaul had 28 points, 10 assists and seven rebounds before getting tossed. Clint Capela had 19 points and 12 rebounds, and Anthony scored seven points off the bench as Houston rebounded from an embarrassing season-opening loss to New Orleans.\n\nRondo had 13 points and 10 assists before getting thrown out. LeBron also had five rebounds and five assists, but he went 1 for 8 in the fourth quarter, missing all three of his 3-point attempts.\n\n\"Yeah, James was James. That's what he does,\" Houston coach Mike D'Antoni said. \"I thought it was a great game. It had some intensity and quickness, and how fast it was.\"\n\nTIP-INS\n\nRockets: Harden got a technical foul in the second quarter when he halfheartedly shoved Stephenson, who sold it impressively. ... Houston hasn't lost a season series with the Lakers since 2010-11. ... Gerald Green scored 13 points.\n\nLakers: Ingram had 12 points before his ejection. ... Rookie C Moe Wagner wasn't ready for his home debut while he recovers from a bruised left knee. ... Lonzo Ball showed off his retooled jumper with four 3-pointers and 14 points.\n\nDISCIPLINE COMING\n\nThe fight could leave with both teams without key rotation players due to suspension. NBA fights rarely get serious enough for the punches thrown by the principals in this brouhaha, and league discipline executive Kiki VanDeWeghe was actually in attendance.\n\nThe Rockets are staying in LA to play the Clippers on Sunday night, and Houston coach Mike D'Antoni laughed at the possibility of a suspension for CP3.\n\n\"I don't know, I might rest him (on a) back-to-back,\" D'Antoni said. \"We'll see what the NBA says.\"\n\nFIRST STEP\n\nThe Lakers dropped to 0-2 after James' West Coast chapter formally began Thursday with a 128-119 road loss to the Trail Blazers. James scored 26 points in Portland, but the Lakers' team vibe could take many weeks to solidify before they can compete regularly with veteran playoff-contending rosters.\n\nThe Rockets are a few months removed from reaching Game 7 of the Western Conference finals, and they've added Anthony to their attack.\n\n\"We've got a long way to go to get to the Rockets, to get to a lot of teams in the Western Conference,\" James said. \"They've just been together for so long. We'll learn from our mistakes and get better.\"\n\nUP NEXT\n\nRockets: At Los Angeles Clippers on Sunday.\n\nLakers: Host San Antonio Spurs on Monday.\n\n---\n\nMore AP NBA: www.apnews.com/tag/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995044.932178
}