{
  "game_id": "0021800997",
  "espn_id": "401071670",
  "date": "Mar 10, 2019",
  "matchup": "HOU @ DAL",
  "headline": "Gordon, Paul helps Rockets top Mavericks 94-93",
  "body": "DALLAS --  This time, James Harden was reduced to a supporting role for the Houston Rockets.\n\nEric Gordon and Chris Paul led the way.\n\nGordon scored 26 points and Paul blocked Jalen Brunson's jumper in the final seconds, sending the streaking Rockets to a 94-93 victory over the Dallas Mavericks on Sunday.\n\nHarden was saddled by foul trouble and finished with 20 points in Houston's eighth straight win, 16 below his season average. The reigning NBA MVP led the Rockets in scoring in his previous 43 games for the league's longest such streak since Michael Jordan's 66-game run ended in 1988, according to STATS.\n\n\"We've had a lot of games where it was ugly and we lost earlier in the season,\" Harden said. \"But we'll take the ugly win.\"\n\nIn a matchup of teams going in opposite directions in the Western Conference, Dallas pushed its in-state rival to the end. After Harden missed a runner with 8.9 seconds to play, the Mavericks had a chance to win.\n\nCoach Rick Carlisle opted to let it play out and rookie Luka Doncic rushed the ball up court. As three Rockets converged on him, Doncic found Brunson on the right wing, but Paul recovered to make a clean block on Brunson's running 14-footer at the buzzer.\n\n\"I read (Doncic) and knew he was going to throw it to Jalen,\" Paul said. \"Jalen didn't have enough time to do anything else but shoot it. If he pump-faked it, I'm in trouble. But then, he might not have had enough time to get the shot off.\"\n\nBrunson said he liked Carlisle's decision to not use a timeout.\n\n\"It just shows that Coach trusts us, and obviously we want the ball in Luka's hands,\" Brunson said. \"He made an unselfish play. I just have to knock it down.\"\n\nGordon snapped a tie with a layup with 3:42 left, and P.J. Tucker's 3-pointer put Houston up by five with 1:29 remaining. Dwight Powell's dunk cut the lead to one with 31 seconds left.\n\nDoncic had 19 points and a career-high 15 rebounds for Dallas, and Brunson finished with 18 points. The Mavericks lost for the 10th time in 11 games.\n\nHARD ROAD FOR HARDEN\n\nHarden picked up his fifth personal 20 seconds into the second half when Doncic took a charge. He re-entered with 3:03 left in the third and converted a three-point play and then a 3-pointer to put the Rockets up 79-70.\n\nHarden had scored 30 or more points in 47 of his 61 games this season, including 37 of the last 38 entering Sunday.\n\n\"I can't be aggressive on both ends of the floor,\" Harden said of his foul trouble. \"In the back of my mind, I'm conscious and keep thinking about it. But that's what you got a team for.\"\n\nDONCIC DINGED\n\nDoncic limped off the court for a timeout with 4:17 to play, but he stayed in the game. Carlisle said he either banged his knee or landed on it awkwardly.\n\n\"The hope is that it's not serious,\" Carlisle said. \"We will know more tomorrow.\"\n\nDoncic wasn't available after the game.\n\nWATCHING DIRK\n\nDallas star Dirk Nowitzki scored six points. He needs 35 more to pass Wilt Chamberlain for sixth place on the NBA's career scoring list.\n\nNowitzki did not play in the second half, something Carlisle called \"a coach's decision because the matchups were very difficult.\"\n\nTIP-INS\n\nRockets: Clint Capela had 17 points and 12 rebounds. ... Coach Mike D'Antoni said Kenneth Faried would return to the lineup Monday after missing five games with a left hip contusion, and Nene would rest on the second half of the back-to-back.\n\nMavericks: Maxi Kleber returned after missing the last two games with left knee trouble. He had 10 points and a career-high 11 rebounds. He also was a primary defender on Harden, frustrating the guard into a 7-for-25 shooting performance.\n\nUP NEXT\n\nRockets: Start a four-game homestand Monday against Charlotte.\n\nMavericks: Host San Antonio on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995292.0815659
}