{
  "game_id": "401810143",
  "espn_id": "401810143",
  "date": "Nov 24, 2025",
  "matchup": "MIL vs POR",
  "headline": "Jerami Grant's 35 points lead Trail Blazers to 115-103 win over slumping Bucks",
  "body": "MILWAUKEE -- — Jerami Grant scored a season-high 35 points and the Portland Trail Blazers rolled to a 115-103 victory while handing the Milwaukee Bucks their fifth consecutive loss on Monday night.\n\n\r\n              Portland won for just the second time in its last seven games and bounced back one night after losing 122-95 at Oklahoma City.\n\n\r\n              Milwaukee’s Giannis Antetokounmpo missed a third straight game due to a left adductor strain. Portland didn't have Jrue Holiday (right calf strain), Scoot Henderson (torn left hamstring), Shaedon Sharpe (right calf strain), Matisse Thybulle (torn left thumb ligament) and Blake Wesley (fractured right foot).\n\n\r\n              Deni Avdija scored 22 points for Portland, while Donovan Clingan added 14 points and 12 rebounds. \n\n\r\n              Milwaukee's Bobby Portis got 22 points, Cole Anthony 16 and Kyle Kuzma 15. Myles Turner had 13 points and 11 rebounds.\n\n\r\n              Portland pulled ahead for good with 7:35 left in the second quarter and maintained a double-digit advantage throughout the second half.\n\n\r\n              The Trail Blazers put the game away by going on an 18-0 run that began late in the third period and carried over to the fourth, for a 102-74 lead. \n\n\r\n              Portland eventually led by as many as 33.\n\n\r\n              The game was Portland's first at Milwaukee since seven-time all-NBA guard Damian Lillard rejoined the Trail Blazers after two seasons with the Bucks. Lillard, who was waived by the Bucks this summer to give them cap room to sign Myles Turner, made the trip to Milwaukee even though he isn’t playing this season to recover from a torn Achilles tendon.\n\n\r\n              Antetokounmpo greeted Lillard on the court well before the game. Lillard received a standing ovation from the Milwaukee crowd after a video tribute to him aired on the scoreboard during the first timeout.\n\n\r\n              Up next\r\n              Trail Blazers: Host the San Antonio Spurs in an NBA Cup game on Wednesday.\n\n\r\n              Bucks: Visit the Miami Heat in an NBA Cup game on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042689.482368
}