{
  "game_id": "401810026",
  "espn_id": "401810026",
  "date": "Nov 05, 2025",
  "matchup": "CLE vs PHI",
  "headline": "Mitchell's season-high 46 points lead Cavaliers to 132-121 victory over 76ers",
  "body": "CLEVELAND -- — Donovan Mitchell scored a season-high 46 points, Jarrett Allen had 24 points and 10 rebounds and the Cleveland Cavaliers pulled away in the second half for a 132-121 victory over the Philadelphia 76ers on Tuesday night.\n\n\r\n              Evan Mobley added 23 for Cleveland, which won its second straight.\n\n\r\n              Cavaliers' All-Star point guard Darius Garland had eight points in 26 minutes in his season debut. Garland missed the first seven games after offseason surgery on his left big toe. \n\n\r\n              Philadelphia, which never led in the game, got 27 points apiece from Tyrese Maxey and Quentin Grimes.\n\n\r\n              Mitchell followed up Sunday's 37-point, eight 3-pointer performance against Atlanta by going 15 of 21 from the floor, 6 of 11 from long distance and making all eight of his foul shots against a 76ers squad that dropped games on back-to-back nights.\n\n\r\n              Joel Embiid did not play on Wednesday as Philadelphia is not having him play on consecutive nights early in the season due to left knee issues.\n\n\r\n              Cleveland stormed out to a 17-point lead eight minutes into the game before Philadelphia slowly rallied.\n\n\r\n              Kelly Oubre Jr.'s 3-pointer tied it at 72 with 9:48 remaining in the third quarter before the Cavaliers regained control, scoring 13 straight points. Allen scored six during the run and Mobley added five.\n\n\r\n              Cleveland outscored Philadelphia 35-15 the rest of the quarter after the 76ers tied it and were up 107-87 going into the final 12 minutes.\n\n\r\n              The Cavaliers' largest lead was 116-90 early in the fourth quarter after Mitchell's driving jumper in the lane.\n\n\r\n              Philadelphia made a late charge to get within nine late in the game.\n\n\r\n              Up Next\r\n              76ers: Host Toronto on Saturday.\n\n\r\n              Cavaliers: At Washington on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042564.029889
}