{
  "game_id": "0022000240",
  "espn_id": "401307714",
  "date": "Apr 25, 2021",
  "matchup": "MEM @ POR",
  "headline": "Morant has 28 points, Grizzlies beat Blazers again, 120-113",
  "body": "PORTLAND, Ore. -- — Ja Morant had 28 points and the Memphis Grizzlies beat the Portland Trail Blazers for the second time in three days, 120-113 on Sunday. \n\n\r\n                    Jonas Valanciunas, back after missing three games because of concussion protocol, added 21 points and 10 rebounds and the Grizzlies held off a late rally by Portland. \n\n\r\n                    “The most impressive thing for us tonight was to not panic late in the game. When they went on that run we stayed locked in,” Morant said. “We got stops late and that was needed for us to get the win. Every punch they threw we threw a punch back and that allowed us to win the game.”\n\n\r\n                    CJ McCollum had 27 points, and Jusuf Nurkic added 16 points and 19 rebounds for the Blazers. They have lost five straight and nine of their last 11 to fall to seventh in the Western Conference — a half-game ahead of Memphis.\n\n\r\n                    Sunday's contest was the second of three meetings between the two teams in less than a week. Morant had 33 points and 13 assists in a 130-128 Memphis victory over the Blazers on Friday night.\n\n\r\n                    Memphis stretched the lead to as many as 16 points in the third quarter but Portland closed the gap to 94-92 on Carmelo Anthony's pullup 3-pointer with just over 10 minutes left. It was Anthony's fourth straight 3. But Portland went cold and the Grizzlies went on a 10-0 run to lead 104-92 after Dillon Brooks' 3-pointer with 8:35 left. Brooks' short jumper pushed it to 111-96. \n\n\r\n                    Portland rallied, getting to 114-111 on Nurkic's layup and free throw with 58.3 seconds left. \n\n\r\n                    After Morant's free throws, Norman Powell's layup made it a three-point game. Morant added another pair of free throws before Damian Lillard missed on a 3-point attempt that all but ended it. \n\n\r\n                    Brooks finished with 18 points for Memphis. \n\n\r\n                    “The whole game we just said `Keep staying locked in,'” Grizzlies coach Taylor Jenkins said. “Our discipline was phenomenal for the entire game.”\n\n\r\n                    The Grizzlies were in the midst of a seven-game road trip, longest of the team’s Memphis-era. They'll wrap it up on Monday at Denver, before hosting the Trail Blazers on Wednesday. \n\n\r\n                    The Grizzlies were without Jaren Jackson Jr. because of injury management. Jackson has played in two games this season after left knee surgery and had 23 points in 25 minutes off the bench against the Blazers on Friday night. \n\n\r\n                    The Blazers were off at the start but went on a 12-0 run that put them up 20-16 in the opening quarter. The lead was short-lived, however, and the Grizzlies built a 51-40 second-quarter lead capped by Morant's 3 pointer. \n\n\r\n                    The Grizzlies had a 58-47 halftime advantage, paced by Valanciunas with 13 points. Portland was shooting just 29.4 points from the field in the first half. \n\n\r\n                    The game was heated at times in the third quarter. Anthony and Brooks exchanged words and were given offsetting technical fouls. Earlier in the quarter, McCollum was charged with a flagrant foul on Brooks. \n\n\r\n                    “I talk the whole game,” Brooks said. “They don't like that. I’m physical and I don't think a lot of guys in the league see this type of defense so I’m bringing it every single night and trying to rise to the occasion.”\n\n\r\n                    TIP INS\n\n\r\n                    Grizzlies: The teams were scheduled to meet in January but the game was called off because of coronavirus protocol. Memphis did not have the league-required eight players for the game due to contract tracing. ... The Grizzlies have won eight of their last 11 games on the road. \n\n\r\n                    Trail Blazers: The Blazers had five fast-break points in the opening half — compared to 25 for the Grizzlies. ... Portland now heads out on a six-game trip. \n\n\r\n                    LILLARD'S STRUGGLES\n\n\r\n                    Lillard finished with 23 points, well off his average this season of 28.5 points. He missed three games earlier this month because of a hamstring injury, but recently he hasn't looked like himself.\n\n\r\n                    Coach Stotts was asked after the game what was going on: “He's missing some shots that he normally makes, but I think that he's competing. His ankle's a little bit sore today from the last game. But that's what I see.\"\n\n\r\n                    For his part, Lillard said: “Right now, I'm not really sure. The only think I can do is look in the mirror at myself, evaluate myself. Just not playing well enough.” \n\n\r\n                    He added, “I've just got to be better.”\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: At Denver on Monday night. \n\n\r\n                    Trail Blazers: At Indiana on Tuesday night. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996925.543715
}