{
  "game_id": "0021600814",
  "espn_id": "400900219",
  "date": "Feb 11, 2017",
  "matchup": "ORL @ DAL",
  "headline": "Mavs rout Magic 112-80 in what's becoming turnaround season",
  "body": "DALLAS --  Wesley Matthews and the Dallas Mavericks keep working their way back from an injury-plagued and miserable start to the season.\n\nThere's no better illustration than the Orlando Magic.\n\nMatthews scored 12 of his 20 points in the first quarter, and the Mavericks cruised to a 112-80 victory over the Magic on Saturday night.\n\nDallas' first meeting with the Magic in November was in the middle of an eight-game losing streak, which was the longest for the Mavericks in 19 years and ended with them at 2-13.\n\nThe Mavericks (22-32) won for the sixth time in eight games -- including three victories against division leaders -- and are in contention for the final playoff spot in the Western Conference.\n\n\"We got dealt a messed-up thing to start the season,\" Matthews said. \"What it says about us is we're tough, we're not going to go anywhere, we're confident and we're going to fight.\"\n\nDirk Nowitzki scored 14 points in 18 minutes , hitting a 3-pointer to give Dallas its first 30-point lead at 67-37 in the first minute of the third quarter before going to the bench for good a little more than six minutes later. Seth Curry also had 14.\n\nBismack Biyombo scored 15 points, nine in a meaningless fourth quarter, as the Magic lost their fourth straight. They are 14-29 since that victory over the Mavericks.\n\n\"I don't know where to start,\" said Evan Fournier, who had 14 points. \"In every aspect of the game, we're not doing what we have to do.\"\n\nDallas point guard Deron Williams returned after missing eight games with a sprained right big toe, getting seven points and four assists in 16 minutes in the first half before sitting out the second half on a minutes restriction.\n\nWilliams' return meant Yogi Ferrell didn't start at point guard for the first time in eight games since joining the Mavericks on a 10-day contract to help with injuries. He played his way into a two-year deal and was solid again with 10 points and seven of Dallas' season-high 32 assists.\n\nCoach Rick Carlisle said starting Williams was an easy decision.\n\n\"Let's not forget how well he was playing before he had the injury,\" Carlisle said. \"Yogi's done a great job. The role he had tonight is a perfect role for him. He's proven that he can fill in as a starter. But Deron Williams is a two-time Olympic champion.\"\n\nAfter Matthews made all four of his 3-pointers in the first quarter, the Mavericks outscored the Magic 32-12 in the second while shooting 61 percent. Dallas' biggest lead was 37.\n\nDallas' shooting guard had six assists and finished one 3 shy of his season high, going 6 of 8 as the Mavericks went 17 of 35 from long range compared to 3 of 23 (13 percent) for the Magic.\n\nTIP-INS\n\nMagic: F Aaron Gordon, who missed his second game with a bone bruise in his right foot, didn't do any work on the court before the game. Coach Frank Vogel said he was waiting for trainers to tell him when Gordon was cleared for activity on the court. ... The other double-figure scorer was C.J. Watson (10 points). ... Nikola Vucevic had 10 rebounds.\n\nMavericks: C Andrew Bogut, who has missed 13 of 16 games with a strained right hamstring, is unlikely to play before the All-Star break. Carlisle essentially ruled Bogut out of Monday's game and gave him a 25 percent chance of playing at Detroit, the last game before the break. ... Salah Mejri had 10 of his 15 rebounds in the first half.\n\nTHERE'S A PATTERN HERE\n\nDallas' leading scorer, Harrison Barnes, had his second single-digit game of the season with eight points. The other was a six-point showing in the Mavericks' biggest blowout win, 122-73 over the Los Angeles Lakers. The 49-point loss was the worst in Lakers history. Dallas' 32-point margin over the Magic was its second-biggest this season.\n\nTEXAS-FLORIDA SHUTTLE\n\nThe Magic are in the middle of a Florida-Texas shuttle that seems a little quirky even by NBA standards. After losing at Houston, Orlando went home and lost to Philadelphia. Then it was back to Texas for the blowout loss to the Mavericks, and now it's on to Miami. The upside: no back-to-backs, with a day between each game. Orlando doesn't have another back-to-back until March 5-6.\n\nUP NEXT\n\nMagic: After visiting the Heat on Monday, Orlando has a season-high, five-game homestand wrapped around the All-Star break. It starts with San Antonio in the last game before the break Wednesday. The Miami game ends a stretch of 13 of 19 on the road.\n\nMavericks: A four-game homestand ends Monday against Boston, and a three-game stretch against East teams ends against the Pistons.",
  "source": "espn_api",
  "crawled_at": 1764995834.1447942
}