{
  "game_id": "0021900119",
  "espn_id": "401160761",
  "date": "Nov 08, 2019",
  "matchup": "SAC @ ATL",
  "headline": "Bogdanovic leads Kings past Young, Hawks, 121-109",
  "body": "ATLANTA --  Once Bogdan Bogdanovic and the Sacramento Kings starting making 3-pointers, they didn't stop.\n\nThat's just what coach Luke Walton wants to see.\n\nBogdanovic scored 20 points and hit two of his 3-pointers in a key fourth-quarter flurry and the Sacramento Kings fought off Atlanta's comeback attempt to beat the Hawks 121-109 on Friday night.\n\nSacramento led by 21 points in the second period before Trae Young, who had 30 points, led Atlanta's second-half comeback. The Hawks cut the Kings' lead to one point, 94-93, before Sacramento answered with a string of five 3-pointers, including the two by Bogdanovic.\n\nThe Kings made 18 of 31 3-pointers for the game.\n\n\"We have really good shooters on our team,\" Walton said. \"We know that. ... When our guys are open we want them letting it fly.\"\n\nBuddy Hield led the Kings with 22 points. De'Aaron Fox had 17 with nine assists.\n\nYoung scored 16 points in the third quarter, when the Hawks whittled away at the Kings' lead.\n\nAtlanta's comeback carried into the fourth quarter. Young's steal set up a layup by Cam Reddish, leaving Sacramento's lead one point.\n\nBogdanovic then sparked the Kings' flurry of 3-pointers that ended Atlanta's comeback.\n\n\"I think we had to fight too much to get back in the game, and that's something we've got to get better at,\" Young said.\n\nAfter opening the season with five straight losses, the Kings have won three of four. Hield said strong shooting has led the recovery.\n\n\"Guys are shooting the ball and making shots at a high clip,\" Hield said.\n\nSacramento led 63-47 at halftime. The Kings' big first-half lead was 21 points, 59-38.\n\nYoung had only eight points in the first half but scored Atlanta's first three baskets after the break.\n\n\"I was mad at the way I played,\" Young said of his quiet first half. \"I wanted to come out and make a difference.\"\n\nJabari Parker had 25 points and eight rebounds for Atlanta.\n\nYoung's 3-pointer trimmed the Kings' lead to 68-54.\n\nSacramento led 72-54 before Atlanta's 12-0 run, capped by Damian Jones' jam on a pass from Young, cut the lead to six points.\n\nTIP-INS\n\nKings: Trevor Ariza had 14 points with four 3s. ... F Harry Giles III made his season debut with four points. He returned from a sore left knee. ... The Kings have won four straight in their series against Atlanta, including a sweep of two games last season.\n\nHawks: Kevin Huerter scored 17 points off the bench while making four of seven 3s. ... Coach Lloyd Pierce said an upcoming five-game road trip will be a good test for his young team. He said he wasn't happy with the way his team responded to its first challenge of games on back-to-back nights, losing at home to Chicago on Wednesday following a win over San Antonio. ... Parker has scored in double figures in seven of eight games.\n\nSOONERS REUNION\n\nIn the matchup of high-scoring former Oklahoma standouts, Hield scored 11 points in the third quarter. That helped the Kings overcome Young's hot streak. It also helped prevent Young from finally winning a matchup against his former teammate.\n\n\"Obviously I know Buddy,\" Young said. \"... I always try to win when I go up against him. I haven't done it yet.\"\n\nHOT SHOOTING\n\nThe Kings built their big first-half lead on 63.4% shooting (26 of 41) from the field. They finished at 55.3% (42 of 76) overall and 58.1% on 3s.\n\nCOLD SHOOTING\n\nThe Hawks couldn't keep pace with the Kings' long-range shooting. Atlanta made 9 of 28 3s. \"We're getting 3s, but we're not getting the ones we want,\" Pierce said. \"That will change.\"\n\nUP NEXT\n\nKings: After completing a three-game trip, Sacramento returns home to play Portland on Tuesday night.\n\nHawks: Atlanta begins a five-game, West Coast trip when it plays at Portland on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996423.128076
}