{
  "game_id": "0021800792",
  "espn_id": "401071465",
  "date": "Feb 04, 2019",
  "matchup": "MIL @ BKN",
  "headline": "Giannis, Bucks beat cold-shooting Nets 113-94",
  "body": "NEW YORK --  They already had the NBA's best record, so Giannis Antetokounmpo knew the Bucks were a good team.\n\nA powerful finish to a five-game road trip showed him they might be even better than that.\n\n\"To finish our road trip with four wins in a row says a lot about this team and how great it can be,\" Antetokounmpo said.\n\nAntetokounmpo had 30 points, 15 rebounds and nine assists, and Milwaukee beat the cold-shooting Brooklyn Nets 113-94 on Monday night.\n\nThe injury-depleted Nets missed 19 of their first 20 3-point attempts, making it another easy night for the team with the league's top record. Brooklyn finished 5 for 42 (11.9 percent) behind the arc and had its nine-game home winning streak snapped.\n\nMalcolm Brogdon added 16 points and Eric Bledsoe had 15 for the Bucks, who won their fourth straight -- all by double digits -- after dropping the first game of the trip in Oklahoma City.\n\nThe teams entered with the two best records in the East since Dec. 7, with the Bucks coming in 22-6 and Brooklyn 20-8. But the Nets were minus a lot of the firepower that produced that strong stretch.\n\n\"Brooklyn's really banged up so it's almost not fair, but for us at the end of a road trip it's a good win,\" Bucks coach Mike Budenholzer said.\n\nD'Angelo Russell scored 18 points for the Nets, who have been forced to go deep down their roster because of injuries and lost their third in a row.\n\nBrooklyn shot 32 percent overall while playing without Caris LeVert, Spencer Dinwiddie, Joe Harris, Jared Dudley and Allen Crabbe, all either starters or key reserves.\n\n\"We obviously have some guys out and some guys back and are mixing and matching,\" coach Kenny Atkinson said. \"I like what we do offensively. Sure we can move it better, but it's tough when you're not making shots.\"\n\nThe remaining Nets were no match for the Bucks, especially with Shabazz Napier going 0 for 10 behind the arc and DeMarre Carroll missing his first eight overall before finishing 2 for 11.\n\n\"It just seemed like everything that we did, they had a plan for it. They just played their butts off defensively,\" Brooklyn center Jarrett Allen said.\n\nDespite all that, the Nets trailed by only nine at halftime. It was nearly 11, but Antetokounmpo's basket was ruled too late after he picked up an inbounds pass with three seconds left near one foul line and got all the way to the other basket to attempt a layup.\n\nBut the Bucks broke out for 36 points in the third quarter, extending their lead to 87-64.\n\nTIP-INS\n\nBucks: Bledsoe missed Saturday's game at Washington with a sore Achilles tendon. ... Antetokounmpo was the Eastern Conference player of the week last week for the second consecutive week. He has won the award six times this season.\n\nNets: Atkinson said LeVert (dislocated right foot) and Crabbe (sore right knee) would practice with the Nets' G League affiliate on Tuesday. Atkinson said he wasn't sure yet if they would be able to get into games before the All-Star break. ... The Nets signed F Mitch Creek to a second 10-day contract.\n\nDRAFT STRATEGY\n\nAntetokounmpo, as the highest vote-getter among fans in the East, will draft one of the All-Star rosters Thursday. LeBron James has the first pick, so Antetokounmpo said he hasn't made a list of who he wants because James can get them first in the first round.\n\nBut he did say he's leaning toward Stephen Curry with his first pick.\n\n\"I might pick Steph because he picked me first last year and I've got to return the favor,\" Antetokounmpo said.\n\nBACKCOURT BOOST\n\nBesides LeVert and Crabbe, the Nets are also without Dinwiddie (right thumb surgery) and Harris (sore right hip). So Atkinson said the nearing returns of some regulars is \"good timing.\"\n\n\"Listen, it doesn't have to be 40 minutes, right?\" Atkinson said. \"I think that would be kind of the best scenario, just kind of integrating those guys slowly into the lineup. That's going to be a big boost for us. I think right now, like I said, it's good timing.\"\n\nIN THE CROWD\n\nFormer President Bill Clinton and Brooks Koepka, last year's U.S. Open and PGA Championship winner, were in attendance.\n\nUP NEXT\n\nBucks: Host the Washington Wizards on Wednesday.\n\nNets: Host the Denver Nuggets on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994476.742631
}