{
  "game_id": "0022400682",
  "espn_id": "401705248",
  "date": "Jan 31, 2025",
  "matchup": "CHI @ TOR",
  "headline": "Bulls beat the Raptors 122-106 to end Toronto's season-best winning streak at 5",
  "body": "TORONTO -- — Coby White scored 25 points, Nikola Vucevic had 21 points and 12 rebounds and the Chicago Bulls beat the Raptors 122-106 on Friday night to end Toronto’s season-best winning streak at five.\n\n\r\n              Jalen Smith added a season-high 17 points, Josh Giddey had 15 and Matas Buzelis added 12 to help the Bulls win their third straight north of the border.\n\n\r\n              Scottie Barnes had 20 and 10 rebounds, RJ Barrett scored 19 points and Immanuel Quickley added 14 for the Raptors, who came in having won seven of eight.\n\n\r\n              Quickley returned to the starting lineup after missing the past eight games because of a strained left hip. It was his 10th appearance of the season. Toronto is 1-9 in those games.\n\n\r\n              The Raptors fell to 1-24 when trailing at the half.\n\n\r\n              Takeaways\r\n              Bulls: Leading scorer Zach LaVine (personal reasons) missed his second consecutive game. Chicago couldn’t win at Boston without him Wednesday, but the Bulls fared better against Toronto.\n\n\r\n              Raptors: The Raptors went 8-7 in January for their first winning month since November 2023. \n\n\r\n              Key moment\r\n              Toronto led 64-63 on Barrett’s layup with 7:17 left in the third quarter but Buzelis scored seven points as the Bulls responded with an 18-8 surge over the next five minutes. Chicago took an 88-74 lead to the fourth.\n\n\r\n              Key stat\r\n              The Bulls outscored the Raptors 50-32 in bench points.\n\n\r\n              Up next\r\n              Both teams play Sunday. Chicago is at Detroit, and Toronto hosts the Los Angeles Clippers. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997061.00239
}