{
  "game_id": "0021600498",
  "espn_id": "400899940",
  "date": "Dec 30, 2016",
  "matchup": "DET @ ATL",
  "headline": "Korver, Howard lead Hawks past Pistons, 105-98",
  "body": "ATLANTA --  Paul Millsap wasn't in uniform the last time the Atlanta Hawks played the Detroit Pistons. He filled it up Friday night, scoring 26 points to lead Atlanta to a 105-98 victory.\n\nThat helped the Hawks forget the first time these teams met here four weeks ago, when Detroit walloped Atlanta 121-85 on Dec. 2 in Philips Arena.\n\nMillsap missed that game with a thigh contusion.\n\n\"We moved the basketball well,\" Millsap said. \"That's who we are; we're an active team, especially at the defensive end.\"\n\nKyle Korver scored a season-high 22 points for Atlanta to complement Millsap, who was 9 of 20 from the field to break out of an 11-of-48 shooting slump.\n\nThe Hawks had 29 assists, and through three quarters limited the Pistons to 37.5 percent shooting as the Hawks built a 74-62 lead.\n\nHawks center Dwight Howard added 10 points and 15 rebounds to help Atlanta forge a 44-43 edge on the boards. Four weeks earlier, he had two points and five rebounds as the Pistons won 54-32 on the boards.\n\nMillsap had his hands full with Detroit forward Jon Leuer, who paced the Pistons with a career-high 22 points. Detroit has lost seven of eight, the only win in that span coming Monday over the Cleveland Cavaliers.\n\nKorver's three consecutive free throws broke a 21-all tie early in the second quarter, and the Hawks never again trailed nor were tied.\n\nAtlanta built a 51-41 halftime lead, and grew the lead to 17 points in the third quarter only to see the Pistons close within 92-88 on Reggie Jackson's layup with 4:17 left in the game. Jackson tied his season high with 20 points.\n\nHoward scored seconds later on a one-handed dunk on an alley-oop pass Dennis Schroder. Fouled on the play by Leuer, Howard added the free throw for a seven-point lead.\n\nDetroit came no closer than five points from there.\n\n\"I think there were two main differences and then a lot of little things,\" Pistons coach Stan Van Gundy said. \"Eighteen turnovers ...  and Kyle Korver. We lost him too many times.\"\n\nTIP-INS\n\nPistons: Starting F Marcus Morris, Detroit's fourth-leading scorer (13.1), did not play because of a sore left knee. Tobias Harris started instead. ... Leuer, who entered the game averaging a career-high 11.1 points, has averaged 18.7 over the past three games. ... Center Andre Drummond had 15 points and 15 rebounds.\n\nHawks: Millsap had six rebounds and five assists. ... Schroder had 17 points and seven assists. ... Reserve PG Malcolm Delaney had seven assists.\n\nDROPPING OFF\n\nThe Hawks frequently sagged into the paint defensively rather than leave Howard alone to block shots (he had just one). It worked. The Pistons were outscored 46-32 inside and made just 16 of 35 shots. Meanwhile, Detroit missed its first 11 3-point attempts Friday before finishing 9 of 31. \"We played a more aggressive coverage tonight, actually a coverage that can give up more 3s, but it helped us,\" Korver said.\n\nUPHILL CLIMB\n\nDetroit was outscored 11-4 to start the second half and fell behind 62-45. Not even a 36-point fourth quarter was enough to climb out of the hole. \"The start of the half, we can't get down like that,\" said guard Kentavious Caldwell-Pope, a former University of Georgia star. \"We've got to come out strong. We've got to hit them first.\"\n\nUP NEXT\n\nPistons: After a Sunday meeting with the Heat in Miami, whom the Pistons have already beaten once, Detroit will return home for games Tuesday against the Pacers and Thursday against the Hornets.\n\nHawks: The season's first meeting with the Spurs is on tap for Sunday, at home, before Atlanta will play four consecutive road games.",
  "source": "espn_api",
  "crawled_at": 1764996064.499954
}