{
  "game_id": "0021700671",
  "espn_id": "400975417",
  "date": "Jan 19, 2018",
  "matchup": "PHX @ DEN",
  "headline": "Booker scores 30, Warren 25 as Suns beat Nuggets 108-100",
  "body": "DENVER --  A sturdy plane and a good night's sleep did wonders for the Phoenix Suns.\n\nDevin Booker scored 30 points, T.J. Warren had 25 and the Suns defeated the Denver Nuggets 108-100 on Friday night.\n\nJosh Jackson and Isaiah Canaan added 16 points apiece off the bench for Phoenix, which snapped a seven-game losing streak to the Nuggets.\n\nThe Suns benefited from an earlier arrival than their last game in Denver. Mechanical issues delayed their flight for the Jan. 3 game until five hours before the opening tip, and the Nuggets raced to a 134-111 win.\n\nPhoenix led that game by two at halftime before fading in the second half.\n\n\"To be in that game as long as they were, I was surprised and proud of them,\" Suns center Tyson Chandler said. \"I didn't play and I was falling asleep on the bench. I was exhausted.\"\n\nThe extra night in Denver helped Phoenix to its first win against the Nuggets since Nov. 20, 2015.\n\nJamal Murray scored 30 in his return to the lineup and Nikola Jokic had 14 points and 17 rebounds for Denver. Murray missed Wednesday's game at the Los Angeles Clippers with concussion symptoms. He was evaluated by doctors before the game and cleared to play.\n\nMurray was one of the few bright spots for Denver. The Nuggets have lost six of eight, including two at home to teams who combined were 34 games below .500.\n\n\"How many times do we need to come in at halftime to talk about effort?\" Denver coach Michael Malone said. \"As a coach, it's the hardest thing to do that.\n\n\"I can't coach effort. I can't make you play hard. I can't draw it up on a board. It's something that you have to bring to the table as a professional athlete every night. We didn't have that collectively.\"\n\nThe Suns grabbed the lead with a 17-3 run to start the second quarter and never trailed again. They led by as many as 15 in the first half, but Murray scored seven straight points to start the third quarter to get Denver within 62-59.\n\nPhoenix scored the next 11 points to push the lead to 14. Denver made it 101-97 on a 3-pointer by Jokic and runner by Gary Harris with 3:57 left, but the Nuggets missed their last six shots and the Suns pulled away.\n\n\"You're a little concerned, they've got momentum, they're at home, they're starting to come back,\" Phoenix interim coach Jay Triano said. \"We executed pretty good plays and got fouled.\"\n\nHarris finished with 16 points and Trey Lyles had 15 points and seven rebounds in his second start of the season.\n\nTIP-INS\n\nSuns: Warren missed the previous two games with lower back soreness. ... F Marquese Chriss missed his fourth straight game with a hip injury. Triano said Chriss might undergo further testing. \"I know that he is concerned,\" Triano said. \"I'm sure he will do what he wants to do.\" ... The Suns won on the road for the first time in 2018.\n\nNuggets: G Monte Morris was brought up from the G League but did not dress once Murray cleared the concussion protocol and was able to play. ... Several Colorado Rockies players were on hand during the team's winter caravan. Charlie Blackmon, Chris Rusin, Tony Wolters and manager Bud Black sat courtside. Denver Broncos linebacker Von Miller also was courtside.\n\nTHROWBACK FRIDAY\n\nChandler and Nuggets center Mason Plumlee exchanged hard fouls at the end of the second quarter, evoking memories of the 1990s NBA. Chandler's foul was slightly harder and resulted in a flagrant-1 call, but both players kept their cool.\n\n\"It was nothing personal,\" Chandler said. \"He fouled me hard, I fouled him back hard and it ends there.\"\n\nBLUE BLOODS\n\nThe Kentucky Wildcats were well-represented in the game. Four of the 10 starters played at least one year for coach John Calipari, including the two leading scorers in the game.\n\n\"That's the powerhouse,\" Booker said. \"Calipari knows what he's doing over there. Trey's playing really well now, too. I'm really proud of all of these guys.\"\n\nUP NEXT\n\nSuns: At the Milwaukee Bucks on Monday night.\n\nNuggets: Host the Portland Trail Blazers on Monday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993905.503693
}