{
  "game_id": "0021900906",
  "espn_id": "401161548",
  "date": "Mar 02, 2020",
  "matchup": "MIA vs. MIL",
  "headline": "Heat stun Bucks 105-89, holding Antetokounmpo to 13 points",
  "body": "MIAMI --  The Miami Heat stand alone, the first team to beat the Milwaukee Bucks twice this season.\n\nJae Crowder and Jimmy Butler each scored 18 points, Goran Dragic added 15 and the Heat beat the Bucks 105-89 on Wednesday night -- moving to 2-0 against the NBA's best team.\n\nBam Adebayo had 14 points and 12 rebounds for the Heat, who improved to 39-22 and matched their win total from last season with 19 games remaining. Kendrick Nunn had 13 points and Kelly Olynyk added 11 for Miami.\n\n\"Collective effort,\" Crowder said. \"All hands on deck.\"\n\nIt was a season-low in points for the Bucks, set for the second straight day after Milwaukee managed only 93 in a win Sunday at Charlotte. The difference was from the 3-point line: Miami was 18 for 37, Milwaukee was 7 for 34.\n\n\"Not saying we can hold great offensive teams like this regularly under 90 ... but we have it in us to do it more consistently,\" Heat coach Erik Spoelstra said.\n\nMilwaukee has faced 21 of the 29 other NBA teams more than once this season. Most of those clubs have had minimal, or no, success: Chicago and Orlando went 0-4, Atlanta, Cleveland, New York and Charlotte are 0-3. The Heat clinched the season series, and Boston -- which would have to sweep its last two matchups with the Bucks -- is the only other Eastern Conference team with a chance to do that.\n\n\"Tough game,\" Bucks coach Mike Budenholzer said. \"The physicality, the defensive activity from both teams was very good. Credit to Miami, they played very well on both ends, shot the ball well, they made tough shots. It wasn't our night.\"\n\nBrook Lopez led the Bucks (52-9) with 21 points. Giannis Antetokounmpo matched a season-low with 13 points on 6 for 18 shooting, and grabbed 15 rebounds.\n\n\"The Heat, they're a team that plays hard,\" Antetokounmpo said. \"It's not just hard for me, it's hard for everybody. They just move the ball so much, they move their bodies, they just play hard.\"\n\nGeorge Hill left with 4:33 remaining, after taking a knee to the midsection and remaining down for a couple minutes. He was in obvious distress as he took a seat near the Milwaukee bench and did not return.\n\nHill finished with 12 points in 24 minutes. The Bucks were down 15 when he departed and emptied the bench not long afterward, conceding the ending.\n\nKhris Middleton also scored 12 and Donte DiVincenzo scored 11 for the Bucks.\n\nMiami led by one at the half, then pushed the lead to 12 late in the third and took an 81-70 lead into the final 12 minutes -- after Dragic beat the buzzer with a quarter-ending 3-pointer for the third consecutive game, this one as time expired. He also made a beat-the-clock 3 to end the first half against Brooklyn on Saturday and another with 2 seconds left in the half against Dallas on Friday.\n\nAnd the late lead didn't get wasted, which had been a big problem for Miami in recent games -- leading to losses against Cleveland, Atlanta and Minnesota in the last couple weeks.\n\n\"We take away from this that we can compete at the highest level,\" Butler said. \"But we know that we have to play this way every day from here on out.\"\n\nTIP-INS\n\nBucks: Middleton returned after missing two games with neck soreness and came out flying, with 10 points in a six-minute span of the opening quarter. ... Milwaukee is now 9-6 when trailing at the half. ... The 11-point deficit after three quarters matched the Bucks' second-largest of the season. They trailed by 27 at Philadelphia on Christmas and 11 at Indiana on Feb. 12.\n\nHeat: Miami's bench had 30 points in the first half, 28 of them on 3-pointers -- nine makes, and the extra on a free throw that came when Crowder finished a four-point play. ... Duncan Robinson extended his streak of games with at least one 3-pointer to 46, three shy of matching Rafer Alston's Heat record.\n\nRARE HALF\n\nAntetokounmpo's six first-half points were a rarity. It matched his third-lowest-scoring half of the season, the others coming with a six-point second half against Sacramento on Jan. 10 (playing 12:37), a five-point second half against Charlotte on Nov. 30 (playing only 6:13) and a two-point first half against Utah on Nov. 8 (shooting 0 for 7 in 17:04).\n\nVIDEO GUYS\n\nSpoelstra has immense respect for Budenholzer -- and has since they were video-room guys at the same time more than 20 years ago, Budenholzer under the guidance of Gregg Popovich and Spoelstra for Pat Riley. \"I have as much deep respect for Mike as anyone in this game,\" Spoelstra said. Added Budenholzer: \"Erik Spoelstra is consistently, every year, one of the best coaches in our league.\"\n\nUP NEXT\n\nBucks: Host Indiana on Wednesday.\n\nHeat: Host Orlando on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995487.313225
}