{
  "game_id": "0022000195",
  "espn_id": "401267355",
  "date": "Jan 16, 2021",
  "matchup": "ATL @ POR",
  "headline": "Lillard helps Blazers rally for a 112-106 win over Hawks",
  "body": "PORTLAND, Ore. -- — Damian Lillard scored 36 points and the Portland Trail Blazers rebounded from a first-half deficit to beat the Atlanta Hawks 112-106 on Saturday night. \n\n\r\n                    Enes Kanter added 12 points, 15 rebounds and five blocks for the Blazers, who have won five of their last six. Guard CJ McCollum left the game at halftime because of a left foot sprain, but coach Terry Stotts said afterward that X-Rays had ruled out more serious injury. \n\n\r\n                    “I think we should be proud of ourselves and the effort that we had in the second half,\" Lillard said. ”We know that first half wasn't good enough. This was a game we had to have.\"\n\n\r\n                    Trae Young had 26 points and 11 assists, while Clint Capela added 25 points and 15 rebounds for Atlanta, which was playing the second of a back-to-back following a 116-92 loss at Utah a night earlier.\n\n\r\n                    Portland led 98-94 with just under six minutes left after trailing by as many as 16 points in the opening half. Gary Trent Jr.'s 3-pointer extended the lead to 101-96. \n\n\r\n                    After Capela's dunk, Trent hit another 3 and Lillard dished to Derrick Jones Jr. for the alley-oop to put the Blazers in front 106-98 with 3:53 left. \n\n\r\n                    Atlanta chipped away, getting within 106-104 on Capela's tip. After Lillard made free throws, Young's layup made it 108-106 with under a minute left. Carmelo Anthony missed a pull-up jumper from out front, but Young was called for an offensive foul on Lillard at the other end. After review, the call stood, and Lillard made free throws to close it out. \n\n\r\n                    “Tough loss. I thought they executed down the stretch. I thought the biggest area for us was just the fourth quarter lack of execution of our offense,\" Hawks coach Lloyd Pierce said. \"Defensively, we did a few nice things to speed the game up and try and take the ball out of Lillard's hands, but we just struggled down the stretch.”\n\n\r\n                    The Blazers (8-5) were playing in their first game without big man Jusuf Nurkic, who fractured his right wrist in the third quarter of a 111-87 loss to the Indiana Pacers on Thursday.\n\n\r\n                    Kanter, who started in his place, said the Blazers were playing for Nurkic. \n\n\r\n                    “It's just sad because what he was doing was just bringing so much to our team,” Kanter said. “He was a big part of our family.”\n\n\r\n                    Cam Reddish did not play for Atlanta (5-7) because of a knee contusion. Pierce said before the game he was just sore and hadn't had time to recover after Friday night's game. Young had back tightness going into the game but started. \n\n\r\n                    The Hawks had a 14-5 run to close the opening quarter up 38-34 then extended the lead to 52-36 on Young's 3-pointer. Portland rebounded, pulling within 62-59 on Kanter's layup but the Hawks went into the break ahead 66-59. Capela led Atlanta with 19 points, while Lillard had 19 for Portland. \n\n\r\n                    McCollum, who had 16 points in the first half, did not return for the second. It was unclear when he was hurt but it appeared that Capela stepped on his foot following a layup in the opening quarter.\n\n\r\n                    Rodney Hood's 3 pointer got the Blazers with 82-79 late in the third and Portland pulled into an 82-all tie with less that a minute left. Portland took an 88-86 lead on Gary Trent Jr.'s layup and Anthony's 3-pointer made it 94-90 with 7:33 left. \n\n\r\n                    TIP INS\n\n\r\n                    Hawks: Heading into the game, Trae Young was averaging 8.4 assists, fourth in the NBA. ... The Hawks are the league’s second-best rebounding team, averaging 48.9. ... Atlanta has lost six of their last seven games. \n\n\r\n                    Trail Blazers: The The Blazers have won four straight against the Hawks in Portland. ... Lillard needs three 3-pointers to pass Kobe Bryant for the 17th on the NBA's all-time list. He had four against the Hawks. \n\n\r\n                    SURPRISE\n\n\r\n                    Kanter about his blocks during a post-game interview. \n\n\r\n                    “I got five blocks? No way,\" he said. ”Hey, good for me.\" \n\n\r\n                    UP NEXT\n\n\r\n                    The Hawks host the Minnesota Timberwolves on Monday. \n\n\r\n                    The Trail Blazers host the San Antonio Spurs on Monday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997853.40946
}