{
  "game_id": "0022200888",
  "espn_id": "401469043",
  "date": "Feb 23, 2023",
  "matchup": "ORL vs. DET",
  "headline": "Wendell Carter beats buzzer with tip-in, Magic beat Pistons",
  "body": "ORLANDO, Fla. -- — Wendell Carter Jr. tipped in Paolo Banchero's missed layup at the buzzer to give the Orlando Magic a 108-106 victory over the Detroit Pistons on Thursday night.\n\n\r\n              Franz Wagner led Orlando with 21 points, and Carter controlled the boards in the fourth quarter, finishing with 14 points and 14 rebounds.\n\n\r\n              “Tonight was his night — big-time rebounds, battling on the boards,” Magic coach Jamahl Mosley said.\n\n\r\n              “I didn’t want to go into overtime so I had to figure out something,” said Carter, who barely avoided reaching over the rim and getting called for basket interference. It took a review to confirm the non-call. \n\n\r\n              Jaden Ivey led Detroit with 25 points. He hit a 3-pointer with nine seconds left to tie it, but he missed two free throws with 51 seconds left and Detroit down by three.\n\n\r\n              “It just came down to the last possession,” said Ivey, who made 5 of 7 threes. “It could have been a different situation if I hit free throws, and I’ve just got to live with the consequences and learn from it.”\n\n\r\n              Alec Burks added 16 points for the Pistons, who stayed in the game with 17-of-34 3-point shooting.\n\n\r\n              Markelle Fultz had 14 points and eight assists for Orlando and Cole Anthony added 15 points off the bench.\n\n\r\n              Ivey and Burks combined on 6 of 7 3-point shooting in the first half, but 12 Pistons turnovers led to 11 Magic points and a 47-46 Orlando lead at the break. Detroit finished the game with 21 turnovers.\n\n\r\n              “We came out with a lot of energy, which is difficult to do after the All-Star break,” noted Pistons coach Dwayne Casey. “The timing, the rhythm, we did all that, except for the turnovers. Twenty-one (turnovers) for 21 points in a one-point game. We can’t gift them 21 points.”\n\n\r\n              Wagner and Fultz sparked a 15-0 Magic run early in the third quarter that netted a 14-point lead, the largest of the game. But Hamidou Diallo scored six of Detroit's 14 straight points to get the Pistons right back in it.\n\n\r\n              Two free throws by Carter put the Magic up 104-99 with 1:36 left, but a hook shot by James Wiseman with 9.5 seconds left brought the Pistons within one. After two free throws by Wagner, Ivey hit a 26-footer to tie it.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: F Marvin Bagley III, out since Jan. 2 after having surgery on his right hand, might be activated as early as Saturday. ... The Pistons have given up 100 or more points in 34 straight games... . Burks shot 4 for 4, all 3-pointers\n\n\r\n              Magic: Banchero finished with 11 points, six rebounds and six assists. . . . Jonathan Isaac had 10 points and seven rebounds in a season-high 16 1/2 minutes. . . . The win was only the second in the last seven games against Detroit.\n\n\r\n              PLAY-IN FEVER\n\n\r\n              The Magic are 20-15 since a 5-20 start, but still 13th in the East and hesitant to proclaim a rare playoff push.\n\n\r\n              “We believe we can be a playoff team and do something very special this year and that’s what we’re focused on -- just trying to get better every day and let the results come,” said Fultz.\n\n\r\n              “Guys are talking about the play-in and the playoff push, and we understand that,” said Mosley. “But the most important thing is always going to be: Are we getting better? Are we improving? Are we focusing on little details, no matter the game, no matter the time of the year.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: At Toronto on Saturday.\n\n\r\n              Magic: Host Indiana on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994617.152401
}