{
  "game_id": "0022300605",
  "espn_id": "401585233",
  "date": "Jan 21, 2024",
  "matchup": "LAL vs. POR",
  "headline": "Russell and James dominate 4th quarter in Lakers' 134-110 rout of Trail Blazers",
  "body": "LOS ANGELES -- — D’Angelo Russell scored 34 points, LeBron James added 28 and the Los Angeles Lakers routed the Portland Trail Blazers 134-110 on Sunday night to get back to .500.\n\n\r\n              Austin Reaves scored 15 points, and Anthony Davis had 14 points and 14 rebounds to help the Lakers (22-22) bounce back from an 18-point loss to Brooklyn two nights earlier.\n\n\r\n              Russell and James combined to score the Lakers’ first 19 points of the fourth. \n\n\r\n              Russell showed off on one of the Lakers' season-high 35 fastbreak points. He faked a behind-the-back pass to James who was running alongside, but kept the ball and completed the layin.\n\n\r\n              “That was dope,” said James, who was shaking his head afterward. “The only way to get fastbreak points is to defend, defend without fouling, and we did that.”\n\n\r\n              James dunked, hit a 3-pointer and made four free throws as he and Russell built a 23-point lead. Russell returned to the starting lineup five games ago, determined to complement James and Davis by being assertive.\n\n\r\n              “He’s been aggressive looking for his shot and we continue to try to find him, especially in transition,” James said.\n\n\r\n              With the rout in hand, James sat out the game's final six minutes, joining Davis and the other starters on the bench.\n\n\r\n              Malcolm Brogdon led Portland with 23 points and nine assists. Anfernee Simons added 19 points and Jerami Grant had 17 as the West's next-to-last team had its two-game winning streak ended.\n\n\r\n              “The Trail Blazers have a certain record but at the end of the day they've still got a lot of firepower over there,” Lakers coach Darvin Ham said.\n\n\r\n              Russell had 13 points in third, making three 3-pointers, when the Lakers stretched their lead from 13 to 22 points. He made two more 3s in the fourth to tie his season high of six.\n\n\r\n              Russell finished one point off his season high of 35 points and he had eight assists.\n\n\r\n              “He's really locked in on his game and focused on ways he can help the team,” Ham said. “Tonight was one of the most complete games I've seen him play since he's been back in a Laker uniform.”\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Oklahoma City on Tuesday night.\n\n\r\n              Lakers: At the Clippers on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995515.190468
}