{
  "game_id": "0022300056",
  "espn_id": "401584144",
  "date": "Nov 28, 2023",
  "matchup": "MIL @ MIA",
  "headline": "Antetokounmpo, Lillard combine for 65, and Bucks earn quarterfinal berth by topping Heat 131-124",
  "body": "MIAMI -- — With the game on the line, the Milwaukee Bucks were just about perfect.\n\n\r\n              And they're headed to the In-Season Tournament quarterfinals.\n\n\r\n              Giannis Antetokounmpo scored 33 points, Damian Lillard added 32 and the Bucks rallied in the fourth quarter to beat the Miami Heat 131-124 on Tuesday night and clinch a home quarterfinal game in the NBA's inaugural in-season event.\n\n\r\n              “The one thing that we do have going for us is we know how to win the game,” Lillard said. “We know how to do the things to win a game.”\n\n\r\n              The Bucks closed the game on a 16-6 run, going 5 for 6 from the field and 5 for 5 from the line in that stretch. Khris Middleton scored 17, Malik Beasley had 16 and Brook Lopez 12 for the Bucks, who won East Group B with a 4-0 record.\n\n\r\n              They'll host wild-card New York next Tuesday, with East Group C winner Boston going to Group A winner Indiana for the other quarterfinal before the Final Four in Las Vegas.\n\n\r\n              “Let's focus on Chicago and go from there,\" Bucks coach Adrian Griffin said, noting that his team still has games against the Bulls and Atlanta before the quarterfinal game against the Knicks.\n\n\r\n              Bam Adebayo scored 31 points for the Heat, who got 21 from Kyle Lowry and 20 from Josh Richardson. Jaime Jaquez Jr. and Caleb Martin each scored 14 and Duncan Robinson added 13 for the Heat.\n\n\r\n              “I felt like we played a very good basketball game,” Heat coach Erik Spoelstra said. \"A very good offensive game, in particular.”\n\n\r\n              Miami was without Jimmy Butler (ankle) and Haywood Highsmith (back); Butler averaged 37.6 points in Miami’s five-game ouster of Milwaukee in last season’s playoffs, with games of 56 and 42 in the final two matchups of that series.\n\n\r\n              The Bucks lost Pat Connaughton to a sprained right ankle late in the second quarter.\n\n\r\n              Lowry made a 3-pointer with 3:25 left to put Miami up 118-115, but the Bucks finished on a 16-6 run. Lillard made three free throws with 1:03 remaining to help put the game out of reach, following a foul call against Richardson and a technical assessed to Spoelstra.\n\n\r\n              The Heat missed 10 of their first 11 shots and quickly got down 15-2. The 1-for-11 start was the third-worst stretch over the first 5 1/2 minutes of a game this season; Chicago was 0 for 8 against Miami on Nov. 18 and the Los Angeles Clippers were 1 for 12 against Orlando on Oct. 31.\n\n\r\n              The Bulls went on to win that game. So did the Clippers. And the Heat had the lead at halftime Tuesday.\n\n\r\n              They had two separate 7-for-8 shooting stretches later in the half, and a 40-point second quarter helped Miami go into the break up 62-59. The lead reached five points in the second half, before Milwaukee rallied.\n\n\r\n              Miami entered the night with a chance to win its group or be a wild card.\n\n\r\n              “The In-Season Tournament does give the fans something to get riled up about,” Adebayo said. “And obviously, we're playing an opponent that we've seen before in the playoffs. It was one of those games that was already intense and the In-Season Tournament just added to it.”\n\n\r\n              UP NEXT\n\n\r\n              Milwaukee: Visit Chicago on Thursday.\n\n\r\n              Miami: Host Indiana on Thursday, then again on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996151.9458518
}