{
  "game_id": "0022200639",
  "espn_id": "401468794",
  "date": "Jan 13, 2023",
  "matchup": "DEN @ LAC",
  "headline": "Nuggets beat Clippers 115-103 for 5th straight win",
  "body": "LOS ANGELES -- — No Nikola Jokic, no problem for the Denver Nuggets. Especially when it comes to the Clippers.\n\n\r\n              Jamal Murray scored 24 points and Michael Porter Jr. added 22 in a 115-103 victory over Los Angeles on Friday night that Jokic missed because of right wrist management.\n\n\r\n              “We got a lot of guys that can play,” said Murray, who rolled his ankle. \n\n\r\n              The Nuggets gained sole possession of first in the Western Conference over the idle Memphis Grizzlies with their fifth straight win.\n\n\r\n              “I didn't want to make a big deal of Nikola not being here,” Nuggets coach Michael Malone said. “That's disrespectful to those other players.”\n\n\r\n              The Nuggets defeated the Clippers for the second time in a week, although this one was much closer than the 31-point beatdown they handed out at Ball Arena.\n\n\r\n              At least until the fourth quarter. That's when the Nuggets pulled away, stretching a three-point lead into double digits. They scored nine in a row to go up 104-92, their largest lead of the game. Aaron Gordon hit a 3-pointer and Bruce Brown added four points. Gordon finished with 17 points.\n\n\r\n              Kawhi Leonard scored 24 points for the Clippers. He didn't have running mate Paul George, who sat out with a hamstring injury. Norman Powell added 18 points off the bench and John Wall had 16. They've dropped seven of eight.\n\n\r\n              “The effort is there,” Leonard said. “The execution part wasn't in that second half.”\n\n\r\n              Murray crashed into a woman sitting courtside while chasing the ball in the fourth. She emerged laughing and he grabbed her hand to make sure she wasn't hurt. He finished with eight rebounds and four assists in 39 minutes.\n\n\r\n              “Jamal Murray is more than a scorer. Jamal Murray is a complete basketball player,\" Malone said. “He's a guy who should be given All-Star recognition because of the way he impacts the game.”\n\n\r\n              Denver's Zeke Nnaji got posterized twice — first by Leonard on a one-handed jam in the third and then by Wall on a dunk in the fourth. Both drew raucous cheers.\n\n\r\n              Trailing by five, the Nuggets outscored the Clippers 20-8, including nine in a row, to lead 81-74 in the third. Former Clipper DeAndre Jordan and Porter dunked and Gordon hit a 3-pointer.\n\n\r\n              “It was a great opportunity for a lot of people to play,” Jordan said. “It was really good for us.”\n\n\r\n              Robert Covington hit a 3-pointer and Wall made a pair of free throws to leave the Clippers trailing 86-81 going into the fourth. \n\n\r\n              The Clippers controlled the first half, when they led by seven.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Malone said he's hoping Jokic's wrist calms down so he can play Sunday. ... Improved to 3-0 over LA this season.\n\n\r\n              Clippers: Their bench outscored Denver's reserves, 46-30. ... Luke Kennard (right calf soreness) sat out his third straight game. ... Fell to .500 at 22-22. ... Have dropped five straight to the Nuggets.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Orlando on Sunday to open a five-game homestand.\n\n\r\n              Clippers: Host Houston on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994704.675327
}