{
  "game_id": "0021600195",
  "espn_id": "400899645",
  "date": "Nov 20, 2016",
  "matchup": "OKC vs. IND",
  "headline": "Teague, Pacers outlast Westbrook, Thunder 115-111 in OT",
  "body": "OKLAHOMA CITY --  Indiana coach Nate McMillan wrote an instruction on the white board in the Pacers' locker room Sunday: \"Scrap.\"\n\nJeff Teague did just that, scoring eight of his 30 points in overtime, harassing Russell Westbrook defensively all night and lifting the short-handed Pacers to a 115-111 victory over the Oklahoma City Thunder.\n\nIt was Indiana's first road victory of the season and it came without star forward Paul George, who missed his second straight game with a sore left ankle.\n\n\"You've got to fight for everything,\" McMillan said. \"I thought the guys tonight, we did that. We were without a couple of players, but the guys in uniform came out and played the game the right way. They played hard and we got our first road win.\"\n\nOklahoma City's Russell Westbrook had his fifth triple-double of the season -- as many as the rest of the NBA combined -- with 31 points, 15 assists and 11 rebounds, but went 13 of 34 from the field. Westbrook calmly used an expletive to describe the way he played.\n\n\"We just wasn't ready,\" he said. \"Just wasn't ready tonight, starting with myself. ... I could have did a lot of things better, man. Got to come out and be ready to play. Tonight I felt like I let my guys down all around. I've got to be better.\"\n\nTeague matched his season scoring high and added nine assists and six steals. He hit two free throws with 4.6 seconds left in regulation to put the Pacers up three.\n\nWestbrook hit a 3-pointer with 2.4 seconds left to tie it for the Thunder and Glenn Robinson III missed a well-guarded 10-footer at the buzzer, forcing overtime.\n\nTeague's 3-pointer in the opening minute of overtime put the Pacers ahead for good. With 1:09 left, he converted a three-point play to make it 113-107, and he hit two free throws with 19.1 seconds left to put Indiana up 115-111. He said the Pacers weren't flustered after Westbrook's tying 3-pointer at the end of regulation and that McMillan told his team \"just to go win the game.\n\n\"We had nothing to lose there,\" Teague said. \"We knew they were going to make some plays, so we just have to go out and win the game.\"\n\nSix Pacers scored in double figures and two of them had double-doubles -- Robinson with 16 points and 11 rebounds, and Thaddeus Young with 20 points and 11 rebounds. Myles Turner just missed another with 15 points and nine rebounds.\n\nEnes Kanter added 16 points for the Thunder.\n\nOklahoma City rallied from a 15-point second-half deficit to force overtime but wasn't able to recover from a dismal third quarter in which it missed 12 of its first 13 shots and went 4 of 17 from the field.\n\nTIP-INS:\n\nPacers: Robinson III made his first start of the season in place of George (ankle) and C.J. Miles (knee), who also sat out due to injury. ... Another forward, Kevin Seraphin, also missed the game with a sore left knee ... Teague matched his career high with six steals.\n\nThunder: Oklahoma City saw its Northwest Division lead shrink to a half-game over Portland. ... The Thunder ended a stretch during which they played eight out of nine games at home. ... The overtime was the second of the season for Oklahoma City, which beat Phoenix on Oct. 28 after an extra period.\n\nGEORGE, MILES OUT:\n\nGeorge missed his third game, and his second in a row, since spraining his left ankle against Philadelphia on Nov. 11, while the player who's started in his place, Miles, sat out with a sore left knee that he hurt on Friday in a loss to Phoenix.\n\nBoth players underwent MRIs on Saturday and while the results were negative for structural damage, McMillan said George and Miles would also be out for Monday's home game against Golden State, and then will be reassessed to determine their availability for Wednesday's game against Atlanta.\n\nQUOTABLE:\n\n\"I have been waiting on my opportunity, just working hard the whole offseason. This guy (Seraphin) told me a couple of days ago, literally, `Be ready. You never know.' Then I walk in the gym and (George) is out, C.J. is hurt and I got to step up. I am just proud of this whole team for sticking together and fighting even though we are a couple of men down.\" -- Robinson on his performance.\n\nUP NEXT:\n\nPacers: Host Golden State on the second night of a back-to-back featuring last season's Western Conference finalists.\n\nThunder: At the Los Angeles Lakers on Tuesday night to start a three-game trip.",
  "source": "espn_api",
  "crawled_at": 1764995325.2462568
}