{
  "game_id": "0022200483",
  "espn_id": "401468638",
  "date": "Dec 23, 2022",
  "matchup": "MIL @ BKN",
  "headline": "Nets beat Bucks, tie longest win streak in Brooklyn at 8",
  "body": "NEW YORK -- — Kevin Durant scored 24 points, and the Nets held Giannis Antetokounmpo scoreless in the fourth quarter to beat the Milwaukee Bucks 118-100 on Friday night, winning their eighth straight to match their longest winning streak since moving to Brooklyn a decade ago.\n\n\r\n              Nic Claxton made his first nine shots and finished 9 for 10 for a season high-tying 19 points for the Nets, who own the NBA's longest current winning streak and have won 12 of their last 13 games. \n\n\r\n              “We just want to keep it up,” Nets guard Kyrie Irving said. “We don’t want to take our foot off the gas pedal.”\n\n\r\n              After scoring 91 points in the first half Wednesday against Golden State, the third-highest total in NBA history, the Nets had to win a different type of game against a Bucks team that came in with an NBA-leading 22-9 record.\n\n\r\n              Royce O'Neale scored 17 points and Ben Simmons had 12 points, 11 rebounds and eight of Brooklyn's 30 assists.\n\n\r\n              “That shows us a locked-in team right there,” Durant said. \n\n\r\n              Claxton, Brooklyn's 6-foot-11 center, came in as the league's leading shooter at 73.8%.\n\n\r\n              Antetokounmpo finished with 26 points, 13 rebounds and seven assists, but didn't take a shot in the fourth as neither he nor Durant reached their usual scoring averages that place both in the top six in the league.\n\n\r\n              Brook Lopez added 23 points, but the Bucks committed 18 turnovers that led to 24 points.\n\n\r\n              “We’ve got to take better care of the ball,\" Bucks coach Mike Budenholzer said. “We’ve got to make better decisions. We can’t just have possessions without shots. It’s on me. I think I’ve got to coach them better and we’ve got to work to take care of the ball better.” \n\n\r\n              The Nets started 8 of 10 from 3-point range and improved to an NBA-best 9-1 in December. They also won eight in a row in February 2021.\n\n\r\n              The Nets led 60-47 at halftime, with their 50% shooting nowhere near the 71% they had against Golden State while taking a 40-point lead on Wednesday. But it was an impressive effort against a Bucks team that came in second in the league, holding teams to about 45%.\n\n\r\n              The Bucks were within 10 nearly midway through the fourth quarter. But Irving, back after a one-game absence, had 14 points in the fourth after scoring four points on 1-of-9 shooting through three quarters and soon it was back over 20 again. \n\n\r\n              TIP-INS\n\n\r\n              Bucks: Antetokounmpo appeared to hurt his hand in a fall but Budenholzer said an X-ray came back clean. ... Khris Middleton missed his fourth straight game with right knee soreness. ... Jevon Carter was in the starting lineup for the first time since Saturday. MarJon Beauchamp had filled the spot usually occupied by Middleton in Milwaukee’s last two games.\n\n\r\n              Nets: Joe Harris missed the game with right knee soreness. Coach Jacque Vaughn said Harris would have been the first sub off the bench before reporting pain. \n\n\r\n              HOME FOR THE HOLIDAY\n\n\r\n              Other than 2019, the season he missed with injury, Durant isn't scheduled to play on Christmas Day for the first time since 2009. He would like a city rivalry matchup with the Knicks in the future but was aware the uncertainty created by his trade request in the summer made the Nets unattractive when this schedule was put together.\n\n\r\n              “I probably am responsible for us not playing on Christmas with what went on this summer,” he said this week. “But hey, it is what it is. We play on the 26th, that’s close enough.” \n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Boston on Sunday.\n\n\r\n              Nets: At Cleveland on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994583.058387
}