{
  "game_id": "0021800606",
  "espn_id": "401071282",
  "date": "Jan 08, 2019",
  "matchup": "CHA @ LAC",
  "headline": "Clippers beat Hornets 128-109 for 9th straight time at home",
  "body": "LOS ANGELES --  The Clippers are showing signs of regaining their November form when they won 11 of 14 games.\n\nLou Williams had 27 points and 10 assists, and the Clippers beat the Charlotte Hornets 128-109 for the ninth straight time at Staples Center on Tuesday night.\n\nMontrezl Harrell added 23 points and 11 rebounds, Tobias Harris had 23 and Danilo Gallinari 20 in the Clippers' third win in a row overall.\n\nHarrell even busted out a turnaround fadeaway, a shot he's not known for.\n\n\"I wait until the defense takes something away and I counter,\" he said.\n\nThe Hornets got within two early in the third before the Clippers took control for good. They closed the period on a 17-9 run, led by Harrell's eight straight points, to take an 86-77 lead into the fourth.\n\n\"Once we picked our pressure up, we got more focused on that end and that was big,\" Harris said.\n\nLos Angeles stretched its lead to 20 points in a 42-point fourth on Williams' basket after Gallinari's 3-pointer. Avery Bradley and Williams hit back-to-back 3-pointers that extended the lead to 121-98.\n\n\"We got really good efforts from everybody,\" Harris said. \"We're pretty close to getting back.\"\n\nMalik Monk scored 19 of his 24 points in the fourth for the Hornets, who fell to 5-13 on the road with their fourth loss in six games.\n\n\"They made very few mistakes. They rarely turned the ball over,\" Monk said. \"We were rushing and out of our own rhythm. They forced us out of our rhythm and they outworked us.\"\n\nKemba Walker, who leads the league in fourth-quarter points at 8.6, didn't score in the period. He finished with 13.\n\n\"We trapped all night. He warrants that,\" Clippers coach Doc Rivers said. \"It was just try to coral him.\"\n\nCharlotte's only lead was four points in the game's opening minutes.\n\nTIP-INS\n\nHornets: Their last win at Staples Center against the Clippers was on Feb. 28, 2009. ... F-C Cody Zeller (right hand surgery) is still 4-to-6 weeks away from returning. ... G Jeremy Lamb returned to start after missing three straight games with a right hamstring strain. He had 16 points.\n\nClippers: They had a season-high 11 blocks, with rookie Shai Gilgeous-Alexander getting four. ... Manny Pacquiao helped toss T-shirts during a timeout and came over to Floyd Mayweather's courtside seat to shake hands with his former foe on Filipino Heritage Night.\n\nSTRANGE LOOK\n\nTony Parker had 12 points, four assists and three turnovers in nearly 15 minutes for the Hornets. Rivers couldn't adjust to seeing Parker in a uniform other than that of the San Antonio Spurs, where he played for 18 seasons.\n\n\"It's just strange,\" Rivers said. \"Looking at Tony Parker in another uniform is outright wrong.\"\n\nUP NEXT\n\nHornets: At Portland on Friday in the fourth of a six-game trip.\n\nClippers: At Denver on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994390.729202
}