{
  "game_id": "0021600492",
  "espn_id": "400899934",
  "date": "Dec 30, 2016",
  "matchup": "CHI @ IND",
  "headline": "George brings back fun for Pacers in 111-101 win over Bulls",
  "body": "INDIANAPOLIS --  Paul George took out his frustrations on the Chicago Bulls, and the Indiana Pacers finally had some fun Friday.\n\nIt's about time.\n\nGeorge scored 32 points including 11 during a closing flurry to help the Pacers snap a four-game losing streak with a 111-101 victory.\n\n\"We have a great time in the locker room,\" George said. \"I was questioning my team to show that on the court.\"\n\nThey did one day after the three-time All-Star acknowledged publicly he hasn't had much fun this season.\n\nSo less than two hours before tipoff, coach Nate McMillan offered a solution -- keep the focus on basketball.\n\nGeorge & Co. made it work all night.\n\nThey started fast, making their first seven shots, closed it out by scoring nine of the last 11 points and in between mostly kept the Bulls an arm's length away.\n\nGeorge was 10 of 20 from the field and was 9 of 9 from the free-throw line. And there was plenty of help to go around.\n\nMyles Turner scored 15 points despite getting into foul trouble, and Jeff Teague had seven points and a career-high 17 assists.\n\n\"We had a little more energy, just talking to each other and smacking each other on the back,\" Teague said. \"We've got to continue to play like we did tonight.\"\n\nJimmy Butler scored 25 points and Dwyane Wade added 20, but the Bulls never quite figured it out after facing an early 20-8 deficit.\n\nThey didn't closer than three until Michael Carter-Williams' three-point play finally tied the score at 95 with 6:03 to go. After tying it again at 97, George answered with three free throws and a layup to give Indiana a 102-99 lead that it never relinquished.\n\n\"We didn't get stops early or late,\" Butler said. \"Our play at the very end was frustrating because we came all the way back. Credit Paul George, he's a heck of a player and can definitely finish.\"\n\nTIP-INS\n\nBulls: Despite having seven turnovers in the first quarter, Chicago trailed 28-22.  ... Wade left the game with 7:28 to go after appearing to hurt his left wrist after taking an awkward tumble. He returned with 4:07 to go. Even before the game, coach Fred Hoiberg wouldn't commit to using Wade on Saturday. ... Chicago was 6 of 23 on 3-pointers.\n\nPacers: Scored a season-high 62 first-half points to take 62-50 lead. ... The home team has won all four games in this season's series and this was the last scheduled meeting of the season. ... Turner has scored 10 or more points in 13 straight games and now has 22 consecutive games with at least one block. ... Glenn Robinson III had 12 points and 10 rebounds.\n\nSITTING RONDO\n\nBulls guard Rajon Rondo had a miserable night. He picked up two fouls in the first seven minutes and his third late in the first half.\n\nHis poor first half, which including more fouls than assists (two) or made shots (zero) combined, earned him a spot on the bench to start the second half. Michael Carter-Williams started in Rondo's place and scored nine of his 12 points in the final two quarters.\n\n\"Nothing surprises me in this league,\" Rondo said. \"I'm a veteran, I'm a professional. I will always prepare well with the expectation to play and contribute.\"\n\nTHE HOT SEAT?\n\nBefore the game, Hoiberg was asked about a report from earlier this week suggesting his job may be in jeopardy.\n\nThe second-year coach tried to shrug off speculation by noting all he really wanted to do was put together a game plan that would help the Bulls play more consistently -- and win some games.\n\nUP NEXT\n\nBulls: Chicago will try to turn the tables Saturday when Milwaukee visits. The Bulls scored a season low 69 points in a Dec. 15 loss when these two last met.\n\nPacers: Hosts Orlando on Sunday. Indiana has won 12 of the last 14 regular-season games in the series.",
  "source": "espn_api",
  "crawled_at": 1764995066.895561
}