{
  "game_id": "0022400992",
  "espn_id": "401705558",
  "date": "Mar 17, 2025",
  "matchup": "SAC vs. MEM",
  "headline": "Kings lose Sabonis but hang on to beat Grizzlies 132-122",
  "body": "SACRAMENTO, Calif. -- — Malik Monk had 28 points and seven assists, and the Kings beat the Memphis Grizzlies 132-122 to end a four-game losing streak despite losing center Domantas Sabonis to a pair of injuries Monday night.\n\n\r\n              Sabonis suffered a cut over his left eye and blood trickled down his face after the Kings’ big man was hit in the face by the back of Luke Kennard’s head. Sabonis returned but left for good in the third quarter after rolling his right ankle.\n\n\r\n              DeMar DeRozan had 22 points, six rebounds and nine assists. Keegan Murray added 16 points and 10 rebounds.\n\n\r\n              The Kings are 21-15 since interim coach Doug Christie replaced Mike Brown in December.\n\n\r\n              Memphis played its second consecutive game without injured guard Ja Morant.\n\n\r\n              Desmond Bane scored a season-high 44 points for the Grizzlies. Zach Edey had 12 points and eight rebounds.\n\n\r\n              The Kings had lost five of their previous six and dropped to the No. 9 seed in the West. Beating the Grizzlies expanded Sacramento’s lead over Dallas to two games.\n\n\r\n              Takeaways\r\n              Grizzlies: Memphis put up a good fight even without their best player, an encouraging start to their longest road trip of the season.\n\n\r\n              Kings: Sacramento has historically had some problems without Sabonis on the court. That wasn’t the case Monday. The Kings did a great job moving the ball around and got a big contribution from Jake LaRavia.\n\n\r\n              Key moment\r\n              The Kings responded very well each time Sabonis was taken to the locker room. They expanded their lead both times without him, which enabled Sacramento to not to have to rush Sabonis back.\n\n\r\n              Key stat\r\n              The teams combined for 71 3-point attempts.\n\n\r\n              Up next\r\n              The Grizzlies continue their longest road trip of the season against the Trail Blazers on Wednesday. The Kings host the Cavaliers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997314.57466
}