{
  "game_id": "0021800458",
  "espn_id": "401071139",
  "date": "Dec 19, 2018",
  "matchup": "PHX @ BOS",
  "headline": "Booker, Ayton carry Suns past Celtics for 4th straight win",
  "body": "BOSTON --  It appears the Phoenix Suns have finally figured things out.\n\nDevin Booker had 25 points and eight assists, and rookie Deandre Ayton added 23 points and 18 rebounds to lead the suddenly resurgent Suns past the Boston Celtics 111-103 on Wednesday night.\n\n\"We had multiple conversations when we were losing early in the year,\" Booker said. \"We looked around the locker room and said, `Nobody's going to feel bad for us.\"\n\nIt was the fourth consecutive victory for the Suns since opening the season 4-24. Phoenix has its first four-game winning streak since March 2015.\n\n\"There's so much positivity,\" said Ayton, who tied his season high in rebounds. \"You can just tag along and add your piece.\"\n\nT.J. Warren scored 21 points and Kelly Oubre Jr. had 13 in his Suns debut.\n\nKyrie Irving led Boston with 29 points and Jayson Tatum had 18. The Celtics lost their second straight after winning eight in a row.\n\nBoston center Aron Baynes broke a bone in his left hand early in the game and the team announced that he'll be sidelined indefinitely.\n\nThe Celtics opened a quick 11-point lead early in the game, but the Suns came charging back.\n\n\"I think it started after the first quarter,\" Irving said. \"They just picked up their aggressiveness and they were pretty much in rhythm for the rest of the night.\"\n\nThe Suns led by six entering the final quarter and pushed it to 92-80 on Jamal Crawford's 3-pointer from the top of the arc with just under 10 minutes to play.\n\nThey led 97-84 before Boston sliced it to five on Marcus Smart's 3 with 1:49 to go. Warren was fouled by Smart taking a 3 on the ensuing possession and made all three free throws.\n\nAfter a 3 by Irving, Oubre nailed a 3-pointer at the other end to help the Suns hold on.\n\nSmart's 3 at the second-quarter buzzer gave the Celtics a 62-59 halftime lead.\n\nBoston grabbed its 11-point lead early in the first only to see the Suns use a 25-7 run over a 6 1/2-minute stretch in the second.\n\nBaynes blocked Ayton's pass and shook his hand in visible pain before heading to the locker room during a stoppage in play.\n\nTIP-INS\n\nSuns: Warren went to the floor hard in the second quarter and walked slowly to the bench during a timeout. He did return to the game. ... Phoenix lost the first meeting between the teams in overtime at home on Nov. 8. . Oubre was acquired Monday in a trade with Washington.\n\nCeltics: C Al Horford missed his sixth straight game with a sore left knee. Boston coach Brad Stevens said Horford didn't practice Tuesday but did some things on the court Wednesday morning. \"Feeling better, getting better. Reassess pretty much every day,\" Stevens said. ... F Marcus Morris also missed the game with a sore right knee. ... Boston shot 70.8 percent (17 of 24) in the first quarter.\n\nNOT THIS TIME\n\nBooker had scored 38 points or more in his last three games against Boston, including 70 at TD Garden on March 24, 2017.\n\n\"If I get on any social media (site) I'm going to hear about it all day when this game's coming up,\" Booker said, smiling. \"Obviously that was a special night in my career.\"\n\nBUSY STRETCH\n\nThe Celtics played their first of a game every other day for the next 36 days.\n\nIrving said it's just about taking care of bodies and getting through the workload.\n\n\"You want to prepare yourself the best you know how,\" he said. \"It's more about maintenance and survival right now.\"\n\nIt was also their first of four games in a row at home, which culminates with a Christmas Day matchup with the Philadelphia 76ers.\n\nNICE COMPANY\n\nIrving is the first Celtics player with five games of 20-plus points and 10-plus assists within the first 30 games of a season since Larry Bird did it in 1990-91.\n\nUP NEXT\n\nSuns: At the Washington Wizards on Saturday.\n\nCeltics: Host the Milwaukee Bucks on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995085.4767501
}