{
  "game_id": "0021800398",
  "espn_id": "401071079",
  "date": "Dec 10, 2018",
  "matchup": "MEM @ DEN",
  "headline": "Jokic scores 27 as Nuggets hold off Grizzlies 105-99",
  "body": "DENVER --  Little surprise, Nikola Jokic had another big game.\n\nPleasant surprise, Monte Morris found a groove.\n\nJokic had 27 points and 12 rebounds, Morris tied a career high with 20 points and the injury-depleted Denver Nuggets beat the Memphis Grizzlies 105-99 on Monday night.\n\nMorris gave the Nuggets the lead for good on a 3-pointer with 5:22 remaining. The reserve also had five assists and five rebounds.\n\n\"Monte Morris was MVP of the game,\" Nuggets coach Michael Malone said. \"He was phenomenal tonight. His floor game. His shot making. His rebounding. His playmaking. We do not win that game without Monte.\"\n\nOver the offseason, Morris overhauled his jumper -- more of a follow-through, less of a flicking motion -- and it has given him added confidence. He also received some recent advice from Malone that he has taken to heart -- if a defender is guarding him too close, don't run the play, just attack the basket.\n\nSo that's what he's been doing. He scored 15 points in the second half.\n\n\"I have to change my mindset from being that facilitator and scoring here and there to being more in attack mode for the team,\" Morris said. \"Especially with guys out.\"\n\nMason Plumlee added 12 points and 10 rebounds in his first start of the season for the Nuggets, who were missing Gary Harris, Paul Millsap and Will Barton due to injuries. Jamal Murray also was dealing with a bruised right shin and took a hard hit on a screen just before halftime, knocking the wind out of him. He finished with 16 points.\n\n\"We're just a deep team,\" Plumlee said. \"We have a lot of guys that can play and we have some guys that you haven't even seen yet.\"\n\nThis was a tightly contested game that featured 15 lead changes. Neither team opened more than an eight-point advantage.\n\n\"They made extra plays,\" said Mike Conley, who had 19 points for Memphis despite playing with a dislocated right pointer finger. \"On our end, we didn't execute our offense. Guys weren't ready to shoot the ball. We weren't all in sync at the right time. When you aren't playing on the same page late in the game like that, it's hard to win.\"\n\nConley pulled the Southwest Division-leading Grizzlies to 98-97 with 3:44 left on a three-point play, but the Nuggets responded with baskets from Jokic and Murray.\n\nIt was a little more high-scoring than their Nov. 7 contest, when the Grizzlies won 89-87. In that game, Jokic attempted just one shot.\n\nThis time, Jokic was more aggressive in going 9 of 14 from the floor.\n\n\"He had to play better with all those guys out,\" said Marc Gasol, who scored seven points for Memphis. \"Tonight, there wasn't much we could do about him.\"\n\nTIP-INS\n\nGrizzlies: The Grizzlies had a stretch in the first half where they hit 11 straight shots. ... F JaMychal Green had 13 points and 10 rebounds.\n\nNuggets: The Nuggets returned home after a 3-2 trip. ... Denver and Memphis each had 22 assists.\n\nNICE SHOT\n\nJokic was pretty much hitting everything in the first half, including a shot when he was inbounding the ball toward the rim with 2.9 seconds remaining before halftime.\n\nOf course, it didn't count.\n\nINJURY UPDATE\n\nConley briefly left in the third quarter with a hamstring that tightened up on him.\n\n\"We went back in the room and we stretched it out,\" Conley said. \"I played a lot better after I returned.\"\n\nYOUNG AT HEART\n\nOn Monday, the Nuggets signed veteran guard Nick Young under the injury hardship relief exception granted by the NBA. He didn't get in the game against the Grizzlies, but the team plans on getting Young up to speed quickly. Malone said Young brings a little more of a long-range threat to the floor.\n\nYoung has been a 37.6 percent shooter from 3-point land for Golden State, Los Angeles Lakers, Philadelphia, Los Angeles Clippers and Washington.\n\n\"Whatever uniform he's worn, he's a proven scorer and a proven shooter,\" Malone said.\n\nUP NEXT\n\nGrizzlies: Host Portland on Wednesday.\n\nNuggets: Face Oklahoma City on Friday in the second of a four-game homestand.\n\n---\n\nFor more AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994937.1616619
}