{
  "game_id": "0021500223",
  "espn_id": "400828110",
  "date": "Nov 25, 2015",
  "matchup": "OKC vs. BKN",
  "headline": "Durant, Westbrook stop Nets' win streak in Oklahoma City",
  "body": "OKLAHOMA CITY -- The Oklahoma City Thunder were tired of losing to Brooklyn on their home floor.\nSo when the game got close, Kevin Durant quickly made sure it wouldn't stay that way.\nDurant scored 17 of his 30 points in the final 20 minutes to help Oklahoma City beat the Nets 110-99 on Wednesday night for their third straight victory.\nThe game was tied for the final time at 85-all with 8:09 remaining. Durant hit two 3-pointers and assisted on a third by Dion Waiters to give the Thunder a nine-point advantage. Brooklyn got no closer the rest of the game.\n\"We played with a sense of urgency. They tied the game up and we didn't want it come down to the last minute,\" Durant said. \"We did a good job of staying focused and staying with it. I just stayed patient with it and I was able to knock some down.\"\n\nRussell Westbrook provided plenty of help with 27 points and 13 assists, many of those on kick outs to Durant after penetrating the lane.\n\"He makes it look easy,\" Westbrook said. \"Obviously he makes everything he does look easy, but he works hard and he's put himself in position to come back and show how good a player he is.\"\nThe surge by Durant left Nets coach Lionel Hollins feeling helpless.\n\"I mean, Durant walks up and shoots a 3, they get penetration and then throw it back out and the guy in the corner hits a 3,\" Hollins said. \"They had two or three of those later on where they just ran pick-and-roll and Westbrook gets in the paint, you got to deal with him and then he throws it out and they make a 3.\"\nWaiters scored 16 and Serge Ibaka added 12 points and eight rebounds for the Thunder.\n\"When you've got shooters all around the court and you've got good finishers, it makes it easier,\" said Durant. \"When you've got a dynamic point guard that can get to the rim off pick-and-roll and make passes, it makes it easier for everybody.\"\nBrook Lopez scored 26 points for the Nets, who had their three-game winning streak in Oklahoma City snapped. They were trying to join San Antonio as the only teams to win four straight games there.\nTIP-INS:\nNets: Joe Johnson shot just 2 of 11 and had six turnovers.\nThunder: Westbrook made his first appearance against the Nets since the 2012-13 season. He missed the previous four meetings due to injuries.\nUP NEXT:\nNets: At Cleveland on Saturday night\nThunder: vs. Detroit on Friday night",
  "source": "espn_api",
  "crawled_at": 1764994208.8564842
}