{
  "game_id": "0022400698",
  "espn_id": "401705264",
  "date": "Feb 02, 2025",
  "matchup": "PHI vs. BOS",
  "headline": "Celtics rally from 26-point deficit to top 76ers 118-110",
  "body": "PHILADELPHIA -- — Jayson Tatum scored 13 of his 35 points in the fourth quarter and the Boston Celtics rallied from a 26-point deficit to beat the Philadelphia 76ers 118-110 on Sunday night.\n\n\r\n              Tatum added 11 assists and seven rebounds. Jaylen Brown scored 21 points and had 10 rebounds and six assists. Kristaps Porzingis scored 18 points and Derrick White added 17.\n\n\r\n              Tyrese Maxey scored 23 points in the first half to help put the 76ers up by 23 at the break. Maxey finished with 34 points, his fifth straight 30-point game and 14th consecutive game of 28 or more.\n\n\r\n              Kelly Oubre had 18 points and 13 rebounds for Philadelphia, Guerschon Yabusele scored 21 points and Ricky Council IV added 11 points, eight assists and seven rebounds.\n\n\r\n              Takeaways\r\n              Celtics: It wasn’t just Tatum and Brown for the Celtics in the fourth quarter as they scored 25 of the first 31 points of the frame. White and Sam Hauser hit two 3-pointers each, and a 3 by Tatum with 6:51 left put Boston up for good at 101-100.\n\n\r\n              76ers: Philadelphia beat the Celtics 118-114 in Boston on Christmas Day thanks to 27 points from Joel Embiid and seven 3-pointers from Caleb Martin. Both missed Sunday’s game. Martin sat out his 12th straight with a hip strain and Embiid his 15th straight with a knee issue.\n\n\r\n              Key moment\r\n              The 76ers went ahead 94-72 on a dunk by Yabusele with 1:31 left in the third, but the Celtics cut the deficit to 14 after three quarters. The total run was 33-6 into the fourth.\n\n\r\n              Key stat\r\n              After shooting 33.3% from the field in the first half, the Celtics shot 28 for 42 (67.7%) after the break and 15 for 22 (68.2%) in the fourth quarter.\n\n\r\n              Up next\r\n              Celtics: Visit Cleveland on Tuesday for a matchup between the top two teams in the East.\n\n\r\n              76ers: Host Dallas on Tuesday. \n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998214.881655
}