{
  "game_id": "0021600510",
  "espn_id": "400899383",
  "date": "Jan 01, 2017",
  "matchup": "ORL @ IND",
  "headline": "Turner's double-double leads Pacers over Magic, 117-104",
  "body": "INDIANAPOLIS --  Myles Turner is rolling right into the New Year.\n\nThe second-year center had 23 points and 12 rebounds to lead the Indiana Pacers to a 117-104 victory over the Orlando Magic on Sunday.\n\n\"I've just been a recipient of great passes,\" Turner said. \"I'm playing off my teammates right now and that's been big for us.\"\n\nTurner has scored double-figures in 14 straight games and blocked at least one shot in 23 straight. He blocked Aaron Gordon's shot during a 6-0 spurt in the fourth quarter when Indiana pulled away. Monta Ellis capped off the run with back-to-back baskets to put the Pacers ahead 101-82. Later, Paul George made a 3-pointer to give Indiana a 108-88 lead with 4:48 to go.\n\nGeorge finished with 19 points for the Pacers (17-18), who have won two straight after a season-worst four-game losing streak last month.\n\n\"Right now it's fun,\" George said. \"We're beyond the stage of figuring it out. Now we're sustaining it and we know what level we need to play at.\"\n\nNikola Vucevic had 18 points and 11 rebounds while Jeff Green and Serge Ibaka each scored 17 points for the Magic (15-20).\n\nIndiana went on a 6-0 spurt midway through the fourth to pull away. After a rough ending to December, the Pacers were looking to get the New Year off to a good start. Sunday's win is the second against Orlando this season. Indiana will travel to Orlando in a month and again in April to complete the four-game regular season series.\n\nThe Magic were searching for a way to bounce back after spending four days mulling over a 120-101 loss to Charlotte. Orlando never found a way to do it against the Pacers.\n\n\"They made it difficult for us,\" Vucevic said. \"The way to fix (the defensive struggles) is simple. It is having a will to do it. Basketball is a simple game. We have to play the right way every night.\"\n\nGreen scored early in the fourth quarter to put the Magic within nine. But the Pacers answered with baskets by Aaron Brooks and Al Jefferson, and then Jefferson dunked to give Indiana a 95-80 lead with 8:51 to go.\n\nJeff Teague limped to the locker room late in the second quarter and was listed as questionable with a sprained left ankle, but then created a spark early in the second half.\n\nTeague scored on lay-ups off missed 3-pointers by George and Glenn Robinson III, and then drove to the basket for another basket before tossing a pass to Turner for an alley-oop dunk to put the Pacers ahead 74-56 with 8:30 remaining in the third quarter.\n\nAfter Ibaka scored and Jodie Meeks made a 3-pointer to put the Magic within six with 36 seconds remaining in the first half, Brooks scored a basket and threw up a 3 at the buzzer to give the Pacers a 62-51 halftime lead.\n\nVOGEL'S HOMECOMING\n\nFrank Vogel had less anxiety going into Sunday's game, he said, compared to when he returned to Indianapolis to face the Pacers for the first time since he became Orlando's head coach. Vogel's first head coaching job was with the Pacers from 2011-16 and he still has a home in the Indy area. The Pacers beat the Magic 88-69 in a meeting on Nov. 14.\n\nCREDIT TO TEAGUE\n\nTeague is getting the nod from teammates for helping the Pacers get things going lately. He had a career-high 17 assists in a 111-101 win over Chicago on Friday and 11 in a loss at Washington last Wednesday. Against the Magic, Teague finished with nine assists.\n\n\"Credit our last three games to Jeff,\" George said. \"He's almost throwing the ball blindly knowing where we're at.\"\n\nTIP-INS\n\nMagic: Gordon had 13 points and six rebounds. ... Orlando shot 20 percent (3-of-15) from 3-point range in the first half. . PG Evan Fournier missed his fourth straight game with a bruised right heal. . F Damjan Rudez was out with a strained right calf.\n\nPacers: Indiana is 13-5 at home this season. . PG Rodney Stuckey was out with a sore left hamstring.\n\nUP NEXT\n\nMagic: Monday they travel to New York after a second straight road game on back-to-back days.\n\nPacers: Tuesday they travel to Detroit where Indiana has won seven of the last nine road games there.",
  "source": "espn_api",
  "crawled_at": 1764995856.4448361
}