{
  "game_id": "0022200066",
  "espn_id": "401468221",
  "date": "Oct 27, 2022",
  "matchup": "BKN vs. DAL",
  "headline": "Doncic has 41 in triple-double, Mavs beat Nets 129-125 in OT",
  "body": "NEW YORK -- — When Luka Doncic's pass to Reggie Bullock with a second left in regulation led to a missed shot, the Dallas Mavericks weren't discouraged. \n\n\r\n              They knew their superstar teammate would keep creating more chances for them — and they did their jobs when he did.\n\n\r\n              Doncic had 41 points, 14 assists and 11 rebounds, setting up three 3-pointers in overtime to send the Mavericks to a 129-125 victory over the Brooklyn Nets on Thursday night.\n\n\r\n              “We’re just trying to do the best we can to make his job a lot easier out there on the floor when he gives the ball up, and the only way you can do that is knock down shots and take them with confidence and make a play,” Tim Hardaway Jr. said.\n\n\r\n              Doncic found Hardaway, Maxi Kleber and Bullock for 3s in the extra period as Dallas built a nine-point lead en route to its first road victory of the season. \n\n\r\n              “Obviously, Luka is probably the best guy to make tough shots and make shots when they count, but he also knows when to make the right basketball plays,” Kleber said. “And especially when we came into overtime, they were like really aggressive with him and he made the right play, I don’t know, three or four times in a row. We just got hot and made all those shots.” \n\n\r\n              Doncic also had two baskets in overtime on the way to becoming the 10th player in NBA history with three 40-point triple-doubles. \n\n\r\n              Kyrie Irving scored 39 points and Kevin Durant had 37 for the Nets, who have run into some of the NBA's most dynamic players this week and fallen short each time. First it was Ja Morant with 38 points in Memphis and then Giannis Antetokounmpo with 43 on Wednesday night in Milwaukee. \n\n\r\n              This time it was Doncic, who had scored more than 30 points in each of the first three games and now has his first 40-point game of the season, with his drives into the middle setting up open looks all around him. \n\n\r\n              “When we attack the paint, we’re a very dangerous team,” Doncic said. \n\n\r\n              The Nets fell to 1-4.\n\n\r\n              “I felt like we did some good things tonight but it just wasn’t good enough,” Irving said. \n\n\r\n              The game was briefly delayed in overtime when a fan threw what appeared to be a cup of ice that landed on the court near the Dallas bench.\n\n\r\n              The Mavs led by two with under a minute remaining in regulation and appeared to have an insurance basket when Durant was called for goaltending on Doncic’s drive. But the call was overturned on replay, allowing the Nets to tie it when Ben Simmons stole the ball from Doncic and set up Durant for a dunk with 8.8 seconds remaining. \n\n\r\n              Doncic passed to Bullock on the next possession but his jumper from the corner missed.\n\n\r\n              But Doncic scored 16 seconds into overtime to give the Mavs the lead for good, then found Hardaway for a 3. After Irving made two free throws, Kleber and Bullock hit consecutive 3s to make it 123-114. \n\n\r\n              Simmons finished with seven points, eight rebounds and four assists. He matched his season high for points despite shooting an airball on a short attempt in the first half. \n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Dallas begins a five-game homestand that ends with the return matchup with the Nets on Nov. 7. ... Hardaway scored 18 points after missing the loss in New Orleans on Tuesday because of right foot soreness. \n\n\r\n              Nets: G Seth Curry, who hasn't played this season while recovering from left ankle surgery, practiced with the Nets' G League team Thursday. Coach Steve Nash said he is getting closer to playing and the team would see how he feels Friday. \n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host Oklahoma City on Saturday.\n\n\r\n              Nets: Open a two-game series against Indiana on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994898.9794319
}