{
  "game_id": "0022300683",
  "espn_id": "401585311",
  "date": "Jan 31, 2024",
  "matchup": "MIL @ POR",
  "headline": "Trail Blazers spoil Lillard's return to Portland with a 119-116 victory over Bucks",
  "body": "PORTLAND, Ore. -- — Damian Lillard's former team took a bit of the shine off his gala homecoming. \n\n\r\n              Anfernee Simons scored 24 points, including a key floater with 17.1 seconds left, and the Portland Trail Blazers beat Lillard and the Milwaukee Bucks 119-116 on Wednesday night. \n\n\r\n              Lillard finished with 25 points for the Bucks in their second straight loss under new coach Doc Rivers. Giannis Antetokounmpo added 27 points and eight rebounds. \n\n\r\n              It was Lillard's first game in Portland since he was traded to the Bucks in the offseason. Lillard was the beloved face of the Blazers' franchise for his first 11 seasons in the NBA.\n\n\r\n              “It was a fun night, celebrating a great player, a great person,” Simons said. “We came in here like we've got stuff we want to accomplish as well. We came in wanting to win the game.\"\n\n\r\n              Blazers coach Chauncey Billups said the moment was not too big for the young Blazers. \n\n\r\n              “It felt like just a big, big character win for us,” Billups said “A culture win for us.” \n\n\r\n              The Blazers held a narrow lead at the half and kept it close in the third quarter, pulling ahead 86-81 on Matisse Thybulle's 3-pointer. Simons hit a jumper that gave Portland a 96-61 lead going into the final quarter. \n\n\r\n              Malcolm Brogdon hit a 3-pointer that stretched Portland's lead to 101-91. Lillard's 3 closed the gap to 101-95 for the Bucks. \n\n\r\n              Milwaukee pressured Portland down the stretch. Brook Lopez's 3-pointer narrowed it to 113-112, but Jerami Grant answered with an off-balance jumper for Portland on the other end with 2:21 left. \n\n\r\n              Lillard's layup pulled the Bucks within a point again. Antetokounmpo put the Bucks in front on an ally-oop dunk from Lillard with 37.2 seconds left. But Simons' floater gave Portland back the lead. \n\n\r\n              Brook Lopez missed a three-pointer with 8 seconds left before Grant made free throws. Then in the final seconds, the Blazers fouled Antetokounmpo, who missed both free throws to give Portland the win. \n\n\r\n              “There were a lot of things that could have gone wrong, like a couple of turnovers. Sometimes with a young team that kind of derails a team, but we stuck with it,” Simons said. “We were calm and understood what we wanted to get.”\n\n\r\n              Deandre Ayton added 20 points and 11 rebounds for the Blazers, who have won two straight. \n\n\r\n              Despite the loss, it was Lillard's night. The eight-time All-Star was treated to a lengthy ovation before the game and tributes played on the video scoreboard during timeouts. At one point, he appeared to be moved to tears. \n\n\r\n              Lillard's driving layup was Milwaukee's first basket of the game. \n\n\r\n              “These games are tough games. The home teams want to beat the guy coming back. You could see it in their jubilation over the game,” Rivers said. \n\n\r\n              It was just the second game for the Bucks under Rivers. The Denver Nuggets spoiled his debut on Monday night with a 113-107 victory. \n\n\r\n              Rivers took over last week for first-year Bucks coach Adrian Griffin, who was fired after 43 games and a 30-13 record. While Milwaukee sits just behind leaders Boston in the Eastern Conference, there were concerns about the Bucks' slipping defensive rating. \n\n\r\n              Lillard was acquired just before the start of the season to team up with two-time MVP Antetokounmpo in hopes of another NBA title. The Bucks won the championship in 2021. \n\n\r\n              The Blazers have focused on developing young talent in Lillard's absence. Scoot Henderson, the No. 3 overall pick in the draft last year, had 15 points in the first half off the bench. \n\n\r\n              Portland, second to last in the Western Conference, stayed close with the Bucks throughout the first half. Simons' 3-pointer near the end of the half tied it at 61 and Portland went into the break ahead 67-65. \n\n\r\n              A kid in the crowd held a sign directed at Lillard that read: “Go get your ring then come back home.” \n\n\r\n              “These types of games where there’s a lot of meaning and lot of emotion, these are always fun,” Lillard said. “These games have a little bit more juice in them. That’s what tonight was. It was an entertaining game.” \n\n\r\n              The teams met earlier this season, with the Bucks winning 108-102 in Milwaukee. \n\n\r\n              UP NEXT\n\n\r\n              Bucks: Visit the Dallas Mavericks on Saturday. \n\n\r\n              Trail Blazers: Play the first of two straight at the Denver Nuggets on Friday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996122.895106
}