{
  "game_id": "0022300337",
  "espn_id": "401584965",
  "date": "Dec 16, 2023",
  "matchup": "MIA vs. CHI",
  "headline": "Butler wins it at the buzzer for Miami, as Heat top Bulls 118-116",
  "body": "MIAMI -- — Kyle Lowry called the play. Kevin Love set the screen. Jimmy Butler took the shot.\n\n\r\n              It all worked perfectly for the Miami Heat.\n\n\r\n              Butler scored 28 points — the last of them on a step-back jumper as time expired — to give the Heat a 118-116 victory over the Chicago Bulls on Saturday night.\n\n\r\n              “Anybody can make that shot,” Butler said. “All in all, it's really dope to win because wins are super-hard to come by in this league.”\n\n\r\n              Love added 22 points for Miami, while Jaime Jaquez Jr. had 18, Caleb Martin 17 and Lowry finished with 10 points and seven assists.\n\n\r\n              DeMar DeRozan led Chicago with 27 points. Patrick Williams scored 25 points, Coby White added 22, Torrey Craig had 16 and Nikola Vucevic finished with 12 points and 11 rebounds.\n\n\r\n              Vucevic missed what would have been a go-ahead shot with 15 seconds left. Butler grabbed the rebound and Lowry whispered something to him, then waved his arms to get Butler and Love where he wanted them. The Heat had two time-outs; coach Erik Spoelstra didn't even think about calling one.\n\n\r\n              “That's the no-brainer of no-brainers,” Spoelstra said.\n\n\r\n              Butler came up the left side of the floor, then went to the right with Love and Lowry setting screens to help get the matchup he wanted. Butler then headed toward the lane and coolly hit the step-back over White as time expired.\n\n\r\n              “He obviously got to his spot,” Bulls coach Billy Donovan said. “I think we can certainly learn something from that.”\n\n\r\n              Miami again played without Bam Adebayo (hip) and Tyler Herro (ankle). They went through a workout a couple hours before the game and are likely to return in the coming week, possibly as early as Monday.\n\n\r\n              Craig was ruled out at halftime with an injured right heel, and the Bulls were again without Alex Caruso — who aggravated a left ankle issue when got stepped on by teammate Nikola Vucevic in the opening minutes of Chicago's victory at Miami on Thursday night.\n\n\r\n              “Hopefully, a few days clears it up,” Donovan said about Caruso. “But we don’t anticipate him missing any major time.”\n\n\r\n              The teams combined for 21 3-pointers in the first half, the seventh-most in a game so far this season. Chicago made 11, Miami 10 — and Love started 5 for 5. His fifth 3-pointer put the Heat up 39-24 just 13 seconds into the second quarter, before Chicago outscored Miami 33-19 over the rest of that period and went into the half down just 58-57.\n\n\r\n              The Bulls led by as many as seven in the third, before Miami finished with a big run to go up 91-80 headed into the fourth. Chicago rallied again, taking the lead three separate times in the fourth on scores by White and DeRozan — but Butler had the last word.\n\n\r\n              “Best closer in the game,” Love said.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Philadelphia on Monday night.\n\n\r\n              Heat: Host Minnesota on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995369.83547
}