{
  "game_id": "0021601045",
  "espn_id": "400900440",
  "date": "Mar 20, 2017",
  "matchup": "ORL vs. PHI",
  "headline": "Magic storm back to beat 76ers 112-109 in OT",
  "body": "ORLANDO, Fla. --  Magic coach Frank Vogel had a simple message for his players at halftime, and he wrote it in bold letters on the locker room white board:\n\nENERGY -- Orlando found it after the break.\n\nThe invigorated Magic rallied from a 17-point second-half deficit, then outlasted the Philadelphia 76ers 112-109 in overtime Monday night.\n\nOrlando won consecutive games for the first time since late December. It was coming off a three-game West Coast swing.\n\n\"It did a lot,\" point guard Elfrid Payton said Vogel's halftime emphasis on energy. \"Obviously, we knew we were sluggish. Playing against a team like that that just plays hard, we have to match that. I think we were able to do a good job of that.\"\n\nThe Magic, which had fallen behind by 16 points in the first two quarters, bounced back when their hustle level went up a notch in the third quarter and continued to elevate in the fourth and overtime periods. Players like Terrence Ross, Evan Fournier, Bismack Biyombo and Payton all came out with improved energy in the second half.\n\nNikola Vucevic led the Magic with 26 points and 13 rebounds, but it was the play of Ross, Fournier, Biyombo and Payton after halftime that seemed to make a difference against a Philadelphia team that had just nine available players.\n\nRoss had all 11 of his points after halftime, including a jumper to put Orlando up 106-104 with 34.7 seconds remaining in overtime -- he was just 3 for 14 from the field when he took the shot. The Magic made six straight free throws from there to hold off Philadelphia.\n\n\"He is a confident guy and he knows we have the utmost confidence in him. If he is open, we want him to shoot that shot, we know he can make that,\" Payton said of Ross. \"It's tough to go out when you are shooting 3 for 14 and shoot that shot with the same confidence as you shot that first one. He did, and that's a big shot for us.\"\n\nThe Sixers, meanwhile, feel like they let one slip away on a night they were severely undermanned but got a dominant performance from their third-string center Richaun Holmes, who was pressed into duty with Jahlil Okafor out. Holmes tied a career high in points with 24 and established a career best in rebounds with 14. Philadelphia also got 24 points and 13 rebounds from Robert Covington after defeating Boston on Sunday.\n\n\"We ended up with a beaten down group,\" 76ers coach Brett Brown said. \"We played yesterday, but I think it really does show the character of the team and how we've been trying to play almost the entire year.\"\n\nTIP-INS\n\n76ers: Okafor missed the game with right knee soreness, and veteran Gerald Henderson was given the night off to rest because it was a back-to-back game. ... With Okafor and Henderson out, the 76ers were down to eight healthy players, but second-year swingman Justin Anderson flew out to Orlando on Monday morning to join the team. Anderson missed Sunday's game and was listed as doubtful for Monday with the flu.\n\nMagic: Meeks was on the floor for the first time since dislocating his thumb on Jan. 18. Meeks, acquired in a trade with Detroit last summer, had missed 26 straight games and has missed a total of 45 games this season after sitting out the first 19 games after undergoing foot surgery after the trade. ... Payton had a rough start, scoring two points, committing two turnovers and committing three fouls in the first 6:50 of the game. He didn't play the rest of the first half.\n\nUP NEXT\n\n76ers: Philadelphia continues its five-game trip in Oklahoma City on Wednesday. The Thunder are 14-1 against the 76ers since moving to Oklahoma City.\n\nMagic: Orlando will host Charlotte on Wednesday night. The Hornets have won six straight over the Magic.",
  "source": "espn_api",
  "crawled_at": 1764995816.9022038
}