{
  "game_id": "0022200317",
  "espn_id": "401468472",
  "date": "Nov 30, 2022",
  "matchup": "MEM @ MIN",
  "headline": "Edwards sparks Towns-less T-wolves, 109-101 over Grizzlies",
  "body": "MINNEAPOLIS -- — Anthony Edwards had 29 points, five steals and three blocks to lead Minnesota to a 109-101 victory over the Memphis Grizzlies on Wednesday night in the first game of an extended absence for injured Timberwolves star Karl-Anthony Towns.\n\n\r\n              “When he plays with great energy, it pulsates through our guys,\" coach Chris Finch said.\n\n\r\n              Jaylen Nowell added a season-high 24 points and D'Angelo Russell had 15 points and 10 assists for the Timberwolves, who forced a season-high 27 turnovers by the Grizzlies and snapped a three-game losing streak despite being outrebounded 59-29 in this sloppy but spirited matchup that included seven technical fouls.\n\n\r\n              “That’s why we’re a team,” said Edwards, who had 17 points in the fourth quarter after a scoreless third and one point in the second. “We’ve got guys who are going to step up and play their roles.”\n\n\r\n              Ja Morant scored 24 points and Jaren Jackson Jr. had 16 points and 11 rebounds for the Grizzlies, who lost their cool down the stretch with successive ejections for Dillon Brooks and Morant. They had only 17 assists.\n\n\r\n              Grizzlies rookie David Roddy, who finished 13 points and five rebounds in his native city, had eight points over three consecutive possessions midway through the fourth quarter. Then Edwards sprang to life with a tiebreaking 3-pointer and a block on Brandon Clarke’s layup that sparked a break he finished with a one-handed slam for a 90-85 lead. \n\n\r\n              “He tries to get going at anytime,” Jackson said. “We just let him get a little too comfortable.\"\n\n\r\n              Edwards and Brooks each picked up a technical foul for jawing at each other with 3:13 left after Edwards felt contact to his face while Brooks was defending him. Then Edwards made two drives on Brooks for hard-fought layups and lobbed a pass to Rudy Gobert for a dunk to delight a crowd that hasn't had much to be excited about lately.\n\n\r\n              “It could be one of his most complete games he’s played since I’ve been with him, very facet,” Finch said. “He made the big plays. He made the little plays. He played all the way through the game.”\n\n\r\n              The Grizzlies made their first visit to Minnesota since they closed out the first-round matchup last spring in Game 6 with their third rally of the series from a double-digit fourth-quarter deficit. Morant, who was coming off a triple-double in a win at New York, had seven turnovers.\n\n\r\n              “They were loading the paint a lot. Kudos to them. They’ve got great defenders over there,\" Roddy said. \"They were just really active from the jump.”\n\n\r\n              DOWN TOWNS\n\n\r\n              The Timberwolves surrendered 279 points over their previous two contests and lost Towns in the process. Kyle Anderson drew the start against his former team for Towns and pitched in 10 points, six rebounds and five assists. Naz Reid saw extended time inside and gave the Wolves seven points, a career-high tying five blocks and plenty of energy on both ends of the court. \n\n\r\n              Gobert was mostly out of it, finding himself in foul trouble early and picking up a technical for complaining about his second one midway through the first quarter, but he finished with 10 points, six rebounds and five assists.\n\n\r\n              “Some nights you’re not going to make shots and you’re still going to win those games,” Gobert said. “With that defensive mindset we can win every night.”\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Desmond Bane missed his eighth game in a row with a sprained toe. ... Roddy played about 4 miles from where he was a high school star for Breck. ... The Grizzlies had their most turnovers since they had 27 on Feb. 6, 2018, per Sportradar.\n\n\r\n              Timberwolves: Rookie Wendell Moore Jr., who had logged a total of 11 minutes to date, got his first career start in place of Jaden McDaniels, who missed his third consecutive game with an illness.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Philadelphia on Friday night.\n\n\r\n              Timberwolves: Host Oklahoma City on Saturday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994225.084682
}