{
  "game_id": "0022000926",
  "espn_id": "401307729",
  "date": "Apr 26, 2021",
  "matchup": "SAC vs. DAL",
  "headline": "Fox-less Kings jump on Mavs early, win 113-106",
  "body": "SACRAMENTO, Calif. -- — Tyrese Haliburton had 14 points and 10 assists in his second straight start in place of leading scorer De’Aaron Fox, and the Sacramento Kings beat the Dallas Mavericks 113-106 on Monday night.\n\n\r\n                    Richaun Holmes added 24 points for Sacramento in his second game back after sitting out five with a strained hamstring. Harrison Barnes had 19 points, and Buddy Hield scored 16 including a clutch 3-pointer late in the fourth quarter.\n\n\r\n                    “Tonight we finished some plays down the stretch,” Kings coach Luke Walton said. “What I was most pleased about other than the teamwork was we outrebounded them. We rebounded from the wing and guard position. That’s what it takes. It was great to see us get better at that.”\n\n\r\n                    Fox, the Kings point guard, is in the NBA’s health and safety protocols and could miss up to two weeks.\n\n\r\n                    Luka Doncic had 24 points, eight assists and seven rebounds for Dallas. Doncic, who was questionable before the game with a left elbow bruise, missed a free throw with 2:05 remaining and the Mavericks down by seven.\n\n\r\n                    “Really simple. Another poor start did us in,” Dallas coach Rick Carlisle said. “(We) have to be way better to start the game. The last three quarters were obviously better but this is very disappointing. Early holes are hard to dig out of. It’s tiring talking about it over and over again, but we’ve got to be better.”\n\n\r\n                    Trey Burke and Tim Hardaway Jr. scored 19 points apiece for Dallas. The Mavericks had won three straight including back-to-back victories over the Lakers.\n\n\r\n                    Haliburton struggled with his shot for much of the game and missed the rim with a 3-point try and the Kings leading 109-104.\n\n\r\n                    “The turnovers, the missed shots, the mistakes that I make, I use them all as learning experiences,,” Haliburton said. “I feel like I have the potential to play a lot better than I have been. That’s part of it, part of the development and part of the growth.”\n\n\r\n                    Doncic was also off down the stretch and missed a pair of 3s in the final 30 seconds.\n\n\r\n                    Sacramento led comfortably for most of the first half.\n\n\r\n                    The Kings led 20-3 behind three quick 3s from Harrison Barnes and held the Mavericks to 17 points in the first quarter.\n\n\r\n                    Dallas made two runs in the second to get close. Doncic’s 3-pointer cut the gap to 50-47, but Haliburton responded with a make outside the arc for Sacramento.\n\n\r\n                    Doncic made a pair of 3s coming out of halftime, then dished assists to Dwight Powell and Hardway to give Dallas its first lead.\n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Kristaps Porzingis was held out for a second consecutive game with a left ankle sprain. JJ Reddick (right heel) did not play. \n\n\r\n                    Kings: Holmes had missed five games with a right hamstring strain. … Hassan Whiteside was healthy but did not play.\n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: Play the Warriors in San Francisco on Tuesday in the second half of their back-to-back. Dallas has won five of the last six against Golden State, though the two teams split a pair of games earlier this season.\n\n\r\n                    Kings: Face the Jazz at Golden 1 Center on Wednesday. Utah won when the two teams played earlier this season in Salt Lake City.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997943.939222
}