{
  "game_id": "0021500588",
  "espn_id": "400828475",
  "date": "Jan 14, 2016",
  "matchup": "TOR @ ORL",
  "headline": "Lowry helps Raptors beat Magic 106-103 in OT in London",
  "body": "LONDON --  After a long trip overseas, the Toronto Raptors and Orlando Magic went the extra mile to entertain an international audience.\n\nKyle Lowry scored 24 points, Cory Joseph added 19 and the Raptors beat the Magic 106-103 in overtime Thursday night at O2 Arena.\n\nDeMar DeRozan had 13 points and 11 rebounds to help the Raptors win their fourth straight game.\n\n\"We needed that win,\" Lowry said.\n\nThe Raptors avenged a Nov. 6 loss in Orlando that spoiled Toronto's franchise-best 5-0 start.\n\n\"That's a well-coached team,\" Lowry said of the Magic. \"They play so hard. We feel good to beat a team that's that good, that talented and that well-coached.\"\n\nJoseph, who shot 9 for 11,  matched his season high. He also had 19 in the November loss to the Magic.\n\n\"Cory came off the bench with some juice,\" coach Dwane Casey said.\n\nJoseph's contribution was especially important given that DeRozan and Lowry combined to shoot 9 for 39.\n\n\"He carried us a lot, especially with me and Kyle struggling\" DeRozan said.\n\nJoseph said he enjoyed playing in front of the vocal London crowd.\n\n\"The atmosphere was great,\" he said. \"With all the media, it felt like a playoff game.\"\n\nVictor Oladipo scored 27 points, and Evan Fournier had 21 for Orlando. The Magic lost for the sixth time in seven games.\n\n\"We've definitely got to find solutions,\" Fournier said. \"It's unacceptable.\"\n\nLowry made two free throws to put Toronto up 105-100 with 43 seconds left in overtime, but Oladipo answered with a 3-pointer. After Lowry missed a shot, he stole the ball from Oladipo and was fouled by Tobias Harris.\n\n\"It was was a big play by a big player,\" Joseph said of Lowry's timely steal.\n\nLowry made one of two, making it a three-point game, and Nikola Vucevic's last-second shot from near halfcourt bounced off the rim.\n\nVucevic had 17 points and 11 rebounds for the Magic, while Harris had 16 points and 11 rebounds.\n\nDown 88-77 with 7:34 left, the Magic tied it at 96 on Oladipo's jumper with 32.9 seconds left.\n\nAfter a miss by Lowry, Oladipo had a chance to win it, but missed a 21-foot jumper with less than a second to go. A replay review gave possession to Orlando, but Jason Smith bounced a shot off the rim as the buzzer sounded, sending it to overtime.\n\nOrlando's Elfrid Payton came off the bench, returning after sitting out the past four games with a bruised left ankle. Forward Aaron Gordon played despite rolling his right ankle during practice Wednesday.\n\nBefore the game, and after the playing of \"O Canada,\" `'The Star-Spangled Banner\" and \"God Save the Queen,\" Lowry and Vucevic stood at center court and briefly spoke to the crowd, thanking the fans for their support.\n\nFREQUENT FLYERS\n\nThis is the second long distance trip of the season for the Magic, who went to Rio de Janeiro in October to play Brazilian League team Flamengo in preseason action.\n\nSTAR-STUDDED AFFAIR\n\nCelebrities in the crowd included soccer player Didier Drogba, actor Michael B. Jordan and chef Gordon Ramsey. Current NBA Commissioner Adam Silver and former Commissioner David Stern were also in attendance.\n\nPLANS FOR PARIS?\n\nSpeaking before the game, Silver said Paris could be the next destination for an international NBA game. Silver said the prospect of a game in Paris is \"something that we will look at closely,\" calling France \"a fantastic basketball market.\"\n\nNBA LEGENDS\n\nFormer NBA players John Amaechi, Muggsy Bogues, Horace Grant, Rick Fox and Hakeem Olajuwon were honored at center court between the first and second quarters.\n\nTIP-INS\n\nRaptors: The last time the Raptors visited London, back in March 2011, they lost in triple overtime to the Nets, a game where DeRozan and former Raptors center Andrea Bargnani both missed last-second shots.\n\nMagic: Orlando came in 8-0 against Atlantic Division opponents. ... G Shabazz Napier (illness) was not available.\n\nUP NEXT\n\nRaptors: Host Brooklyn on Monday night.\n\nMagic: Visit Atlanta on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994734.921807
}