{
  "game_id": "0022400215",
  "espn_id": "401704781",
  "date": "Nov 11, 2024",
  "matchup": "OKC vs. LAC",
  "headline": "Gilgeous-Alexander scores career-high 45 as Thunder beat Clippers in first game without Holmgren",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored a career-high 45 points, and the Oklahoma City Thunder beat the Los Angeles Clippers 134-128 on Monday night in their first game this season without Chet Holmgren.\n\n\r\n              Holmgren will miss at least eight weeks with a pelvic fracture after a hard fall during Sunday's loss to Golden State. The 7-foot-1 forward/center had been one of the league's most efficient scorers and top shot blockers.\n\n\r\n              Gilgeous-Alexander picked up the slack by making 13 of 21 field goals and 15 of 16 free throws. He also had nine assists. Jalen Williams scored 28 points and Lu Dort added 19 for Oklahoma City.\n\n\r\n              With their tallest starter at 6-foot-6, the Thunder ran relentlessly, yet committed just 11 turnovers. They were outrebounded 47-29.\n\n\r\n              Norman Powell scored 31 points, but he fouled out with the Clippers down four with 1:32 remaining. Ivica Zubac had 22 points and 14 rebounds and Derrick Jones Jr. added 20 points for Los Angeles. James Harden had 17 points, 11 rebounds and nine assists, but he shot 5 of 15 and had five fouls.\n\n\r\n              The Thunder led by 20 midway through the third quarter. Powell's fadeaway corner 3 at the end of the third trimmed Oklahoma City's lead to 99-94, and the game was close throughout the final period.\n\n\r\n              Takeaways\r\n              Clippers: Los Angeles was careless with the ball. Oklahoma City scored 32 points off the Clippers' 24 turnovers.\n\n\r\n              Thunder: Even with several players injured, Oklahoma City's depth was too much for the Clippers, especially with Los Angeles in foul trouble.\n\n\r\n              Key moment\r\n              Gilgeous-Alexander made two free throws with 22.7 seconds left to put the Thunder ahead 132-128 and reach his career-high point total.\n\n\r\n              Key stat\r\n              Oklahoma City made 22 of 23 free throws while Los Angeles made 20 of 29.\n\n\r\n              Up next\r\n              The Clippers visit Houston on Wednesday and the Thunder host New Orleans on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997686.601645
}