{
  "game_id": "0021801186",
  "espn_id": "401071859",
  "date": "Apr 05, 2019",
  "matchup": "OKC vs. DET",
  "headline": "George scores 30, Thunder beat Pistons 123-110",
  "body": "OKLAHOMA CITY --  Paul George had a simple explanation for why the Oklahoma City Thunder pulled away from the Detroit Pistons on Friday night.\n\n\"Blake Griffin wasn't Steph Curry no more,\" he said.\n\nGeorge scored 30 points, and the Thunder held off Griffin's 45-point onslaught to beat the Pistons 123-110 on Friday night.\n\nGriffin was a game-time decision after missing the previous three games with left knee soreness. He made 11 of 15 shots and had 44 points the first three quarters, including nine of 14 3-pointers. He missed all five of his field goal attempts in the fourth and scored just one point.\n\n\"His legs was probably a little shot, but he played an unbelievable game,\" George said. \"That was the key at that point, was just try to wear him down and force somebody else to beat us.\"\n\nRussell Westbrook added 19 points, 15 assists and eight rebounds for the Thunder, who have won two straight as they try to avoid the No. 8 seed in the Western Conference playoffs.\n\nWestbrook clinched a triple-double average for the third straight season.\n\n\"I do what I do every single night,\" Westbrook said. \"Regardless of what anybody says, what they call it, what they say, I'm just thankful. All the teammates in this locker room, all the teammates over these last couple years have made my job easy. I just try to do what I can to impact the game, every facet.\"\n\nGeorge is impressed with what he has seen in two years as Westbrook's teammate.\n\n\"He'll go down as a Hall-of-Famer, one of the best,\" George said. \"Nobody, I don't believe, will be able to match that or beat that. You've got to be wired a certain way on a nightly basis to compete at that level. He's special.\"\n\nGriffin made a deep 3-pointer in the closing seconds of first half to put the Pistons up 66-65 at the break. He scored 31 points before the break and made 6 of 9 3-pointers.\n\nWestbrook drove to the rim and spun 360 degrees and dropped off a perfect pass behind his back and over his left shoulder for Steven Adams, who dunked it to give the Thunder a 92-86 lead late in the third quarter.\n\n\"I saw him when I got the rebound,\" he said. \"I just hoped he kept running.\"\n\nWhen it was suggested that it looked like a Magic Johnson pass, he said, \"No, I got a little Russell Westbrook. That's what you got.\"\n\nBack-to-back 3s by Westbrook and Grant put the Thunder up 113-101 midway through the fourth, and a lob from Dennis Schroder to Jerami Grant for a jam pushed the lead to 14.\n\nThe Pistons are battling to get into the Eastern Conference playoffs and have three games remaining.\n\n\"It's the season,\" Detroit coach Dwane Casey said. \"Three games. It's in our hands. It's right in our hands, and nobody else but us.\"\n\nTIP-IN\n\nPistons: Griffin scored 17 points in the first quarter. ... Former Thunder backup point guard Reggie Jackson scored 10 points in 27 minutes. He was booed during pregame introductions.\n\nThunder: Westbrook was called for a Flagrant 1 in the second quarter for a hard foul on Zaza Pachulia in the second quarter. ... Adams committed three fouls in the first six minutes, but finished with four in 24 minutes. ... George was called for a technical in the third quarter.\n\nGEORGE'S SHOULDER\n\nGeorge has had problems with his shoulders in recent weeks. He had his left shoulder covered at one point as he waited at the scorers' table.\n\n\"When I'm just doing that, it's just to keep it warm, keep it loose so I'm not stiff or tighten up,\" he said.\n\nQUOTABLE\n\nWestbrook, on how people will remember his three straight seasons averaging a triple-double: \"I take it one day at a time. That's it, man. That's it. It'll hit me at some point, just like it's going to hit everyone else in this room, too.\"\n\nUP NEXT\n\nPistons: Host Charlotte Hornets on Sunday.\n\nThunder: At the Minnesota Timberwolves on Sunday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994543.8222988
}