{
  "game_id": "0021800719",
  "espn_id": "401071392",
  "date": "Jan 24, 2019",
  "matchup": "LAL vs. MIN",
  "headline": "Towns powers Timberwolves to 120-105 win over Lakers",
  "body": "LOS ANGELES --  The Minnesota Timberwolves needed three players to step up when guard Derrick Rose went down injured.\n\nAndrew Wiggins, Jerryd Bayless and Jared Terrell all delivered in the absence of Rose, who didn't play in the second half because of a sore right ankle, and another dominant performance by Karl-Anthony Towns helped the Timberwolves keep rolling.\n\nTowns had 27 points and 12 rebounds to propel Minnesota past the Los Angeles Lakers 120-105 on Thursday night.\n\nWiggins added 23 points and Bayless scored 16 off the bench for the Timberwolves, who have won three straight. Terrell, a rookie guard, had 10 points to help make up for the loss of Rose, who had six points in 12 minutes before exiting.\n\n\"It was a huge team win,\" Wiggins said. \"We have a lot of guys out, a lot of guys that (are) hurt, and people came in and stepped up.\"\n\nInterim coach Ryan Saunders did not know if Rose would be available to play Friday against Utah.\n\nIt was the frontline of Towns and Taj Gibson that put Minnesota ahead with an 11-1 run early in the third quarter. Towns had seven points, including a 3-pointer to push the Timberwolves back in front 69-66 with 7:34 to play in the period. They did not trail again.\n\nGibson had the other four points and finished with 14 points and 10 rebounds.\n\nWiggins was effective in closing out the game with nine points and three assists in the fourth quarter. Terrell scored seven in the period after totaling nine in his first four career games.\n\n\"Guys banding together all the way, we were great,\" Saunders said. \"All the way down the line we had great efforts.\"\n\nRajon Rondo had 15 points, 13 assists and six rebounds in his first game since injuring a finger on his right hand at Golden State on Christmas, but the Lakers lost their third in a row.\n\nBrandon Ingram had 20 points and Kentavious Caldwell-Pope scored 13.\n\nRondo went right to work after missing 14 games because of a sprained finger that required surgery, getting eight points and four rebounds in the first quarter.\n\nBut Los Angeles centers Ivica Zubac and JaVale McGee had seven of the Lakers' 20 turnovers, which led to 34 points for the Timberwolves.\n\n\"It went back to physicality,\" Lakers coach Luke Walton said. \"They didn't get turnovers from trying to play-make. They got the ball stripped from them.\"\n\nSWEET LUOL\n\nThe Timberwolves also got an unexpected contribution from Luol Deng, who had seven points and three rebounds in 11 minutes after playing in one game for the Lakers last season. Deng was bought out by Los Angeles in September after signing a four-year, $72 million free agent contract in 2016, but said he was not interested in any personal retribution against his former team.\n\n\"I tried not to make this me against them,\" Deng said. \"This was really the Timberwolves coming in here and needing a win. I try to clear my mind from all that. What happened, happened. I'm blessed in so many other ways. I just wanted just to focus on winning the game.\"\n\nLOST KUZ\n\nLakers forward Kyle Kuzma couldn't get on track, finishing with 10 points and failing to make any of his four 3-point attempts. Walton attributed the poor performance to a hip injury. Kuzma said he landed on the hip after making his first shot and hoped that two days of treatment would be enough to allow him to play Sunday against Phoenix.\n\n\"We're fighting to be in the playoffs, we're fighting for seeding and the season is ticking down,\" Kuzma said. \"Everything has to be serious right now. Every game matters, every possession, every second.\"\n\nTIP-INS\n\nTimberwolves: F Jeff Teague missed his second straight game because of soreness in his left foot. ... Minnesota went 3-1 in the season series. The Timberwolves are 15-8 over their past 23 games against the Lakers following a 22-game losing streak.\n\nLakers: Walton said he would not update a timetable for the return of LeBron James, who missed his 15th straight game because of a groin strain. \"I'm not going to throw out weeks or day,\" Walton said after James returned to practice on a limited basis Wednesday. \"He knows what he's doing, he's taking care of his body, and when he's ready to go, he'll go.\" ... Los Angeles shot 50.6 percent from the field despite going 8 of 28 from 3-point range.\n\nUP NEXT\n\nTimberwolves: Visit the Utah Jazz on Friday.\n\nLakers: Host the Phoenix Suns on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995447.2696068
}