{
  "game_id": "0022100738",
  "espn_id": "401360557",
  "date": "Jan 28, 2022",
  "matchup": "MIA vs. LAC",
  "headline": "Butler scores 26 points, Heat hold off late Clippers rally",
  "body": "MIAMI -- — Jimmy Butler scored 26 points and the Miami Heat withstood another furious comeback from the Los Angeles Clippers during a 121-114 victory Friday night.\n\n\r\n              Bam Adebayo had 20 points and 12 rebounds for the Heat, who have won 10 of 12. Gabe Vincent finished with 23 points.\n\n\r\n              The Eastern Conference-leading Heat snapped a six-game losing streak against the Clippers. Miami’s last win over Los Angeles was on Dec. 8, 2018.\n\n\r\n              “It’s one of those things, we’ve got to learn how to play with leads, big leads at that,” Adebayo said. “Got to learn how to not let them come back, get those timely stops, get those timely buckets where it creates that distance.”\n\n\r\n              Down 23 late in the third period, the Clippers closed to 117-113 on Amir Coffey’s layup with 33 seconds remaining. Butler hit four foul shots on Miami’s final two possessions to secure the win. He converted all 16 of his free-throw attempts.\n\n\r\n              “We don’t want to keep getting down for sure,” Los Angeles coach Tyronn Lue said. “We are going to keep battling, keep fighting. I just think in the huddle, coming back, we just try to get some energy guys back in the game once the lead kind of goes south.”\n\n\r\n              For Los Angeles, the late rally followed the team’s historic 35-point comeback in its 116-115 win over Washington on Tuesday.\n\n\r\n              Luke Kennard scored 23 points for the Clippers, including 16 in the fourth quarter. Eric Bledsoe finished with 19 points and Coffey had 15.\n\n\r\n              “We always give ourselves a chance, no matter what,” said Kennard, who made four 3-pointers during the final period. “But, again, we can’t dig ourselves in a hole that early in the game. We always believe but it’s tough getting down that much in games. It wears us down.”\n\n\r\n              Limited to three points in the first half, Vincent hit six 3-pointers in the third as the Heat extended a 12-point lead at halftime. Duncan Robinson’s 3 with 5:06 remaining in the period gave Miami its largest lead at 85-62.\n\n\r\n              The Heat converted 26 of 27 free throws and had 28 assists.\n\n\r\n              “I just think these experiences for our ballclub are really important to go through,” Heat coach Erik Spoelstra said. “The guys’ hearts are in the right place. From our perspective, we didn’t feel like we played well when we got that lead, but again I think you have to credit the other side for a lot of that.”\n\n\r\n              Miami’s Kyle Lowry and Los Angeles’ Marcus Morris missed their sixth and third games, respectively, because of personal reasons.\n\n\r\n              “I think it’s always really important to realize basketball is second, third, if not around that area on people’s list of importance,” Butler said of Lowry’s absence. “You’ve always got to make sure the family’s good, yourself is good. It just feels good to know that we’ve got guys who can step in and do what Kyle does for us. But I miss him. We all miss him. We want him and his family to be OK.”\n\n\r\n              TIP-INS\n\n\r\n              Clippers: F Justise Winslow had 10 points, 10 rebounds and five assists against the club that drafted him with the 10th overall pick in 2015. Miami traded Winslow to Memphis in 2020. ... Kennard has converted 12 of 23 3-pointers in the last three games. ... Dropped to 3-3 on their six-game road trip.\n\n\r\n              Heat: Led by Vincent, Miami went 15 for 34 from 3-point range. ... P.J. Tucker had 18 points, and Robinson finished with 16.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Visit Charlotte on Sunday.\n\n\r\n              Heat: Close their four-game homestand against Toronto on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764992649.80637
}