{
  "game_id": "0021801212",
  "espn_id": "401071885",
  "date": "Apr 09, 2019",
  "matchup": "PHI @ MIA",
  "headline": "Wade goes out a winner in Miami, Heat top 76ers 122-99",
  "body": "MIAMI --  Dwyane Wade's wife was slapping his backside in celebration.\n\nHis oldest son, the heir to the Wade basketball throne, was on the Miami bench for the final minutes.\n\nFormer President Barack Obama sent a video. John Legend and Chrissy Teigen were courtside. The \"M-V-P\" chants rained down while Wade played, one more time, the last Miami steps in this season-long One Last Dance.\n\nWade's final game in Miami was everything he wanted, and then some. He scored 30 points in the tribute-filled game, and the Heat sent him off a winner by defeating the Philadelphia 76ers 122-99 on Tuesday night. It was festive, all the way to the end, even though the Heat learned during the third quarter that they were eliminated from playoff contention.\n\n\"Wade County,\" Wade shouted to the crowd after the game after he jumped up onto the courtside table where Heat managing general partner Micky Arison sits, one last time, one last celebration. \"I love you.\"\n\nThey loved him back. They have for 16 years. They will for 16 more, and 16 more after that, and 16 more after that, too.\n\n\"I'm still just amazed, even after all these years,\" Heat coach Erik Spoelstra said. \"I've seen him go into his bag of tricks so many times and just compartmentalize. But I'm truly amazed that he was able to perform like that tonight.\"\n\nBam Adebayo scored 19, Justise Winslow scored 16 and Hassan Whiteside added 15 for the Heat. The Heat were aware that Memphis had a big lead against Detroit, a must-win for the Grizzlies to keep Miami alive in the playoff race, but the Pistons rallied.\n\n\"It still was a beautiful night,\" Spoelstra said.\n\nWade's career will end Wednesday in Brooklyn, when Miami plays its regular-season finale. He checked out for the last time with 1:02 left, embracing teammates and his son Zaire -- who was on the Heat bench.\n\nGreg Monroe scored 18 points and Ben Simmons scored 16 for Philadelphia, which entered Tuesday already locked into the No. 3 seed for the Eastern Conference playoffs and rested Joel Embiid and J.J. Redick. Simmons played only 21 minutes, Tobias Harris shot 3 for 16 in 20 minutes and Jimmy Butler scored only four points in 16 minutes.\n\nButler did get one prize -- he was the recipient of Wade's final postgame jersey exchange with an opponent.\n\n\"Special, to see my brother get as much love as he deserves,\" Butler said. \"He's one of the greatest to play this game and I'm so happy he gets to go out on his terms.\"\n\nJonathon Simmons scored 14 for the 76ers, who knew they were witnessing Wade history.\n\n\"To see him be celebrated that way was the only positive of the night,\" 76ers coach Brett Brown said.\n\nWade scored the first basket of the game on a dunk, Philadelphia scored the next eight -- and it was all Miami the rest of the way. Winslow had three 3-pointers and Wade scored six points in a 22-2 Heat run that put Miami in control early, and the outcome was never in question again.\n\nThe final minutes were all Wade. He swished a 3-pointer. He banked in a pair of them. He got slapped on his backside by a fan -- in this case, it was permitted, since the fan was his wife Gabrielle Union-Wade. He scored 14 of his points in that final quarter.\n\nIt was his night.\n\nThe game was the sideshow.\n\nThe 20,153 fans came to see him.\n\nWade did not disappoint, one last time.\n\n\"I'm the most thankful person in this city,\" Wade said.\n\nTIP-INS\n\n76ers: This is the first time Philadelphia has posted consecutive seasons of 50 or more wins since 1984-85 and 1985-86. ... Philadelphia missed 17 of its first 18 tries from 3-point range.\n\nHeat: Udonis Haslem -- also a three-time Heat champion, like Wade -- played most of the fourth quarter with Wade. It took Haslem less than a minute to do one of the things he does best -- take a charge. ... Wade played in 575 games in a Heat uniform at home. Miami won 401 of them, and he scored 13,323 points in those contests.\n\nMcGRUDER DECISION\n\nMiami will not be a tax team this year, saving about a $5 million payment because Rodney McGruder was claimed Tuesday by the Los Angeles Clippers -- two days after he was waived by the Heat. If Miami had won at Toronto on Sunday, McGruder would likely still be with the Heat. \"That was one of the tougher franchise moves our organization has had to make,\" said Spoelstra, who raves about McGruder.\n\nREST DAY\n\nThe 76ers plan to sit Embiid and Redick again Wednesday, and will also give Ben Simmons and Harris the night off. \"Some people like to have a rhythm going into it, some people like to have time off. I don't think you can appoint the perfect formula,\" Brown said.\n\nUP NEXT\n\n76ers: Host Chicago on Wednesday.\n\nHeat: Visit Brooklyn on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764993983.59448
}