{
  "game_id": "0021900387",
  "espn_id": "401161029",
  "date": "Dec 14, 2019",
  "matchup": "OKC @ DEN",
  "headline": "Nuggets' Nikola Jokic breaks out of mini-slump with triple-double vs. Thunder",
  "body": "DENVER -- Breaking out of a mini-slump, Nikola Jokic is reasserting himself as the centerpiece of the Denver Nuggets' offense.\nJokic had 28 points, 14 rebounds and 12 assists for his fourth triple-double of the season, leading the Nuggets past the Oklahoma City Thunder 110-102 on Saturday night.\nJokic now has 32 regular-season triple-doubles to tie Rajon Rondo for 11th on the career list. The stat line signaled his return to form after a series of off-target shooting performances and sluggish ball movement that bogged down the Nuggets' attack over the last two weeks.\n\"He's definitely well past rounding back into form,\" Nuggets coach Michael Malone said. \"For Nikola, getting past those struggles that everybody goes through, it's just handling that adversity, staying with it and finding a way to stay aggressive, knowing that's the only way you're going to right the ship.\"\nJokic was effective from the perimeter and the low post, hitting three 3-pointers and muscling in a pair of dunks. When the defense collapsed on him, he was dishing off to the open man and figuring prominently in all five Denver starters scoring in double figures. Will Barton had 18 points and Jamal Murray scored 14 as the Nuggets beat the Thunder for a seventh straight time.\n\"When (Jokic) is aggressive, it just opens up everything for everybody else,\" said Gary Harris, who finished with 11 points. \"We were all clicking today. He was able to get assists, rebounds, points. He was able to do whatever he wanted.\"\nSaid Jokic: \"I've been playing like that my whole life, so it kind feels like I'm playing the way I'm supposed to play.\"\nDennis Schroder had 22 points to lead the Thunder. Steven Adams had 18 points and Shai Gilgeous-Alexander scored 16 for Oklahoma City. Chris Paul finished with 15 points and 10 assists.\n\"I think it was a game where we just didn't shoot well,\" Thunder coach Billy Donovan said. \"This was a game where we needed to have our defense be really elite, but we had some breakdowns, some missed opportunities, some blown coverages, and we couldn't overcome those things.\"\nLeading by three at the break, Denver used a 12-2 burst late in the third quarter to take a 77-62 lead. Abdel Nader had the Thunder's lone basket in that span while Murray highlighted the Denver surge with a lob off the backboard that he put back through the net with a two-handed dunk.\nTorrey Craig later hit a 3-pointer and Juancho Hernangomez had a driving layup to help Denver take an 82-68 lead into the fourth quarter.\nThe Thunder narrowed the deficit to five points on a jumper by Gilgeous-Alexander with 6:50 left to play, but the Nuggets then scored nine straight points, including a dunk and 3-pointer by Jokic for a 102-88 advantage with 4:35 remaining. The Thunder couldn't mount another threat.\nThe Nuggets got off to a hot start, opening a 22-6 lead early, but the Thunder steadily gained on them and Adams' dunk pulled Oklahoma City within 52-49 at halftime.\nTIP-INS\nThunder: G Hamidou Diallo remains sidelined with a hyperextended right elbow strain. ... G Terrance Ferguson missed a fifth consecutive game with right hip soreness.\nNuggets: F Paul Millsap was inactive after leaving Thursday night's game early because of a right quadriceps strain.\nUP NEXT\nThunder: Return home to play the Chicago Bulls on Monday night.\nNuggets: Complete a back-to-back by hosting the New York Knicks on Sunday night.\n---\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996238.34173
}