{
  "game_id": "401810081",
  "espn_id": "401810081",
  "date": "Nov 13, 2025",
  "matchup": "PHX vs IND",
  "headline": "Booker scores 33, Brooks adds 32 and the Suns roll to 5th straight win by beating Pacers 133-98",
  "body": "PHOENIX -- — Devin Booker scored 33 points, Dillon Brooks added 32 and the Phoenix Suns won their fifth straight game by beating the Indiana Pacers 133-98 on Thursday night.\n\n\r\n              The Suns led by 20 early in the third quarter, but the Pacers cut it to 83-73 a few minutes later. Phoenix responded with a 16-0 run — highlighted by 10 straight points from Booker — to take a 106-84 lead into the fourth.\n\n\r\n              Booker shot 12 of 22 from the field and added seven assists and five rebounds. Brooks made 12 of 18. The Suns were shooting well above 60% from the field deep into the fourth quarter.\n\n\r\n              Oso Ighodaro had 17 points, seven rebounds and three blocks off the bench.\n\n\r\n              The Pacers were last season's Eastern Conference champions but have been ravaged by injuries. They've lost six in a row and fell to 1-11 for the season. Andrew Nembhard had 21 points while Pascal Siakam added 19.\n\n\r\n              Indiana gave up 133 points two nights after surrendering 152 in a loss to Utah — the most given up in the NBA this season.\n\n\r\n              The Suns stretched their lead to 70-52 by halftime. Brooks scored 24 points on 9-of-13 shooting before the break. Nembhard led the Pacers with 16 points.\n\n\r\n              Both teams dealt with injuries during the game.\n\n\r\n              Suns guard Grayson Allen left the game in the second quarter with a right quadriceps injury. He had 12 points before the injury and scored a career-high 42 points in a win over the Pelicans on Monday.\n\n\r\n              Pacers guard Aaron Nesmith was hurt in the third quarter after slipping and falling awkwardly to the floor. The team said it was left knee soreness.\n\n\r\n              Up next\r\n              Pacers: Host the Toronto Raptors on Saturday.\n\n\r\n              Suns: Host the Atlanta Hawks on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042619.179551
}