{
  "game_id": "0022200663",
  "espn_id": "401468818",
  "date": "Jan 16, 2023",
  "matchup": "MEM vs. PHX",
  "headline": "Grizzlies beat Suns 136-106, extend winning streak to 10",
  "body": "MEMPHIS, Tenn. -- — The Memphis Grizzlies are making lengthy winning streaks an annual occurrence.\n\n\r\n              Ja Morant scored 29 points, Desmond Bane added 28 and the Grizzlies extended their season-high winning streak to 10 games with a 136-106 win over the injury-depleted Phoenix Suns on Monday night.\n\n\r\n              Memphis set a franchise record last season by winning 11 in a row.\n\n\r\n              Despite another double-digit win streak, Grizzlies coach Taylor Jenkins sees room for improvement.\n\n\r\n              “There’s no finished product whatsoever, we’re just trying to find different ways to win ball games, especially at this juncture of the season,” Jenkins said. \n\n\r\n              The Suns played without starters Chris Paul and Devin Booker. Paul missed his fifth straight game with a right hip injury. Booker has not played since Christmas Day because of a groin injury.\n\n\r\n              Mikal Bridges scored 21 points and Deandre Ayton added 18 for the Suns. Phoenix (21-24) lost for the ninth time in 10 games.\n\n\r\n              Jaren Jackson Jr. contributed 18 points and six blocks for the Grizzlies (30-13), who did not play starters Morant or Dillon Brooks in the fourth quarter when Memphis stretched its lead to as many as 36 points.\n\n\r\n              Memphis also scored 130 or more points for the third straight game, matching the franchise-record run of last February.\n\n\r\n              Bane said the win streak has been aided, in large part, by the team’s defense. The Grizzlies had eight steals and six blocks against the Suns.\n\n\r\n              The win streak followed a stretch in which the Grizzles lost four of five. The last loss was to Phoenix on Dec. 27 in Memphis.\n\n\r\n              “Every team is going to have ups and downs,” Bane said. “They either make you stronger or you give in to them.”\n\n\r\n              The Grizzlies started slow, trailing by as many as 11 in the opening quarter before using a dominating third quarter to pull away. Memphis outscored the Suns 39-23 in the third quarter and built a 22-point advantage (103-81) following a three-point play by Morant.\n\n\r\n              The Suns started strong, hitting 11 of their first 15 shots, including their first six, to lead by as many as 11 in the opening quarter. \n\n\r\n              The Grizzlies regained the lead late in the second quarter after Morant drained three consecutive 3-pointers for a 60-58 Memphis lead and never trailed again. \n\n\r\n              Memphis outscored the Suns 68-41 in the second half.\n\n\r\n              “We’ve just got to regroup and go back home,” Suns coach Monty Williams said. “This has been a tough, tough stretch for us on a number of fronts. The wins and losses. The injuries. And we lose (Josh Okogie) tonight and he was playing his tail off. So you just pack it up, go home and get ready for the next one.”\n\n\r\n               TIP-INS\n\n\r\n              Suns: Landry Shamet returned and scored nine points after missing the last three games with a hip injury. ... Josh Okogie left the game with 4:03 to go in the second quarter after being fouled by Steven Adams and suffering a nose injury. Okogie walked to the locker room under his own power, but did not return. \n\n\r\n              Grizzlies: The Grizzlies honored NBA greats Gary Payton and Luol Deng, women’s basketball pioneer Nancy Lieberman and former NFL running back Eddie George before the game with the 18th Annual National Civil Rights Museum Sports Legacy Award. ... Memphis improved its home record to 19-3 at FedExForum, an .863 home winning percentage that leads the NBA. ... Morant is averaging 29 points during the team’s 10-game win streak.\n\n\r\n               A SPECIAL OCCASION\n\n\r\n              Phoenix coach Monty Williams said it was an honor to be selected to play on Martin Luther King Day. And although he wasn’t able to make it to the National Civil Rights Museum in downtown Memphis on this trip, he said visiting the museum is educational and emotional.\n\n\r\n              “I think it’s really cool for us and I hope it’s cool for the younger plays who may have only heard about Dr. King or read something about him in school,” Williams said. \n\n\r\n              UP NEXT\n\n\r\n              Suns: Return home after four-game trip to play Brooklyn on Thursday.\n\n\r\n              Grizzlies: Host the Cleveland Cavaliers on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994199.8106508
}