{
  "game_id": "0022400794",
  "espn_id": "401705360",
  "date": "Feb 20, 2025",
  "matchup": "CHA @ DEN",
  "headline": "Jamal Murray scores 34, Nuggets hold off Hornets 129-115 for their 9th straight win",
  "body": "DENVER -- — Jamal Murray scored 34 points, Nikola Jokic finished an assist shy of his 26th triple-double of the season and the Denver Nuggets extended their winning streak to nine games by holding off the depleted Charlotte Hornets 129-115 on Thursday night.\n\n\r\n              Jokic finished with 29 points, 17 rebounds and nine assists. He attempted a career-high 14 3-pointers and made six.\n\n\r\n              Murray picked right up where he left off before the All-Star break when he erupted for 55 points. Against Charlotte, Murray was 12 of 18 from the floor, including seven 3-pointers. \n\n\r\n              A 17 1/2-point favorite, the Nuggets didn't put away the Hornets until a late spurt. The win, coupled with a loss by Memphis, moved the Nuggets into second place in the Western Conference. \n\n\r\n              Miles Bridges had a season-high 36 points to go with 13 rebounds for a Hornets team missing LaMelo Ball (ankle management) and Mark Williams (return to competition reconditioning). Charlotte was playing on the second night of a back-to-back after beating the Lakers 100-97 in Los Angeles. It was a game rescheduled from January due to the devastating wildfires in Southern California. \n\n\r\n              Takeaways\r\n              Hornets: Tied Denver in fast-break points (15-15) and points in the paint (52-52). The Nuggets entered the game leading the league in both categories.\n\n\r\n              Nuggets: Russell Westbrook (hamstring), Michael Porter Jr. (hamstring) and Aaron Gordon (calf) all returned to the court Thursday. Gordon had 18 points and Porter grabbed 11 boards.\n\n\r\n              Key moment\r\n              Julian Strawther hit a pair of 3-pointers to fuel a 13-2 run early in the fourth quarter to help the Nuggets gain some separation.\n\n\r\n              Key stat\r\n              Jokic's opening seven shots of the game were all from 3-point range. \n\n\r\n              Up next\r\n              Both teams play Saturday. The Nuggets host LeBron James, Luka Doncic and the Los Angeles Lakers, while the Hornets play at Portland.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997702.586199
}