{
  "game_id": "0021900694",
  "espn_id": "401161336",
  "date": "Jan 27, 2020",
  "matchup": "MIA vs. ORL",
  "headline": "Adebayo's triple-double lifts Heat past Magic, 113-92",
  "body": "MIAMI --  Bam Adebayo never got a chance to meet Kobe Bryant. He was hoping it would come at this year's All-Star Game.\n\nCoaches might be sending Adebayo there.\n\nAdebayo got his third triple-double of the season in his last opportunity to impress Eastern Conference All-Star voters, Duncan Robinson scored 21 points and the Miami Heat eased past the Orlando Magic 113-92 on Monday night.\n\n\"It was about honoring Kobe,\" Adebayo said. \"I felt like I had the `Mamba Mentality' tonight. ... I never got to meet him but he's here in spirit.\"\n\nAdebayo finished with 20 points, 10 rebounds and 10 assists. He's a candidate to be a reserve selection for the All-Star Game; coaches pick those teams, and their ballots are due at the NBA office on Tuesday for an announcement on Thursday.\n\nHeat coach Erik Spoelstra doesn't lobby colleagues to sway their vote.\n\n\"Maybe that's wrong,\" Spoelstra said. \"I don't feel comfortable doing that. ... Your play should speak louder than anything else and I feel at the core of my heart that Bam's play has made him an All-Star and our winning should also be proof of that.\"\n\nJimmy Butler scored 19 points, Goran Dragic had 14 and Tyler Herro scored 13 for Miami. The Heat improved to 13-0 at home against Eastern Conference teams.\n\nNikola Vucevic had 13 points and 12 rebounds for Orlando. Aaron Gordon scored 12 points, Markelle Fultz had 12 and Terrence Ross had 11 for Orlando.\n\n\"Our starters got badly outplayed to start the game and got crushed to start the third quarter,\" Magic coach Steve Clifford said. \"To me that was the biggest factor.\"\n\nBryant, his daughter Gianna and the other seven victims of the helicopter crash in Southern California were remembered, as has been the case in every game since the news broke on Sunday.\n\nThe Heat played a video tribute pregame, putting 24.8 seconds -- part of a series of nods to Bryant's jersey numbers with the Los Angeles Lakers -- on the scoreboard. The Heat took a 24-second violation to start the game, the Magic then took an 8-second violation. Several players had messages to remember Bryant and his daughter scrawled on their sneakers.\n\nAnd at halftime, the Oscar-winning animated version of Bryant's poem \"Dear Basketball\" was shown on the arena screens.\n\n\"I don't know if there's enough you can do,\" Spoelstra said.\n\nThe Heat went on a 19-2 run over a six-minute stretch of the third quarter, taking a game that it led by six at the half and seven when that spurt began and turning things into a 76-52 cushion. Orlando was 1 for 8 from the field with a pair of turnovers during that stretch.\n\nOrlando played its league high-tying 15th game of January, its third game in four nights and sixth in a span of nine days. And now the Magic get a very unusual break after such a hectic stretch, with four full days off before playing host to Miami on Saturday.\n\n\"We see them on Saturday,\" Gordon said. \"We have to figure this out or the same thing will happen.\"\n\nTIP-INS\n\nMagic: Orlando's four-game losing streak ties a season-worst, last done in early November. The Magic haven't lost five in a row since March 2018. ... It was Vucevic's 23rd start against Miami, the fourth-most by anyone in Magic history.\n\nHeat: Adebayo played in his 132nd consecutive game, tying Grant Long for the fifth-longest streak in Heat history. He's two away from matching Isaac Austin's fourth-longest Heat streak. ... Kendrick Nunn (sore Achilles tendon) remained out for a second straight game.\n\nTIME CHANGE\n\nWith the Lakers-Clippers game in Los Angeles being postponed Tuesday, the NBA moved the start of Tuesday's Boston at Miami game back 30 minutes to 8 p.m. to accommodate a national television audience.\n\nUP NEXT\n\nMagic: Host Miami on Saturday.\n\nHeat: Host Boston on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995505.907263
}