{
  "game_id": "0022000703",
  "espn_id": "401307492",
  "date": "Mar 28, 2021",
  "matchup": "CHA vs. PHX",
  "headline": "Booker's 35 points leads Suns past Hornets 101-97 in OT",
  "body": "CHARLOTTE, N.C. -- — Devin Booker scored 35 points, Chris Paul had 16 and the Phoenix Suns outlasted the Charlotte Hornets 101-97 in overtime Sunday.\n\n\r\n                    Deandre Ayton added 14 points, and Mikal Bridges had 13 points, eight rebounds and a career-high six steals. The Suns, second in the Western Conference at 31-14, won three of four on their Southeast swing.\n\n\r\n                    “I think both teams wish they made more shots, but there are some games like that,” Booker said. “It was a real high-intensity game and we had our chance to make an all right trip into a good trip and we did that.”\n\n\r\n                    Devonte Graham led the Hornets with 30 points, and Terry Rozier had 22 points and 10 rebounds. Miles Bridges added 18 points, 12 rebounds, and Gordon Hayward scored 15 points.\n\n\r\n                    “Defensively, (Mikal Bridges’) contests are some of the best in the league at his position after a screen,” Suns coach Monty Williams said. “He has the length and ability to stay in a play. Graham got going and we needed somebody to get their hand up and make it tough on him and that is what Mikal does. He has knack for making plays.”\n\n\r\n                    A crowd of 3,850 saw the Hornets force overtime, with Rozier's 3-pointer tying it at 90 with 33.5 seconds left.\n\n\r\n                    “That’s the second-best team in the West, playing as well as anybody in the NBA, and we just held them to 35% shooting, 14 points in the fourth quarter, and we were one bucket away from winning this game,” Hornets coach James Borrego said. “A lot of it was on the defensive end. I like where our defense is. It’s got to carry us every night.”\n\n\r\n                    Phoenix opened the second half on an 11-0 run. A 3-pointer by Hayward was Charlotte’s first field goal in the half, at 6:20.\n\n\r\n                    “It’s (about) staying poised,” said Mikal Bridges, whose team has the NBA’s best road record at 16-6. “Going on the road and playing just for us – you got some crowd there, but it’s usually just us. It’s that road attitude. I feel like playing on the road is a lot more fun because you know everybody is going against you.”\n\n\r\n                     CRAIG MESHING WELL\n\n\r\n                     The Suns got a player they’d wanted in the offseason when they traded for Bucks forward Torrey Craig last week. He has meshed well with Phoenix in four games, averaging 6.5 points.\n\n\r\n                     “It has been pretty seamless, and a couple of guys respected the way he defended when he was with Denver,” Suns coach Monty Williams said. “He has shown the ability to play the way that we play — slashing, cutting to the basket, defending multiple positions.”\n\n\r\n                     TIP-INS\n\n\r\n                     Suns: Improved to 1/3 in overtime this season. ... Phoenix had two players in double-digit scoring in the first period. Ayton got there first with a layup with 4:34 to go in the period but didn’t score again until a layup early in the third. … Booker joined him with a shot clock-beating 3 late in the first.\n\n\r\n                     Hornets: Guard Brad Wanamaker made his Charlotte debut late in the third period and committed a foul in his first minute. The Hornets acquired Wanamaker in a trade with Golden State on Thursday. … Guard Malik Monk didn’t dress (sore right foot).\n\n\r\n                     UP NEXT\n\n\r\n                     Suns: Host Atlanta on Tuesday night.\n\n\r\n                     Hornets: At Washington on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764997360.5572538
}