{
  "game_id": "401809974",
  "espn_id": "401809974",
  "date": "Oct 27, 2025",
  "matchup": "DAL vs OKC",
  "headline": "Thunder withstand furious Mavericks rally to win 101-94, improving to 4-0",
  "body": "DALLAS -- — Isaiah Hartenstein had 16 points and 12 points — and scored Oklahoma City’s only two field goals of the final 8:28 — as the Thunder withstood a furious Dallas rally to beat the Mavericks 101-94 on Monday night to improve to 4-0.\n\n\r\n              Shai Gilgeous-Alexander scored 23 points to lead the defending NBA champions. Chet Holmgren had 18 points, 11 rebounds and four blocks.\n\n\r\n              Anthony Davis had 26 points and 11 rebounds for the Mavericks (1-3), playing their fourth straight home game to open the season.\n\n\r\n              Oklahoma City led 93-74 before Dallas went on a 13-0 run before Hartenstein’s tip-in gave the Thunder a 95-89 lead with 2:52 to play. The Mavericks pulled within one point on a jumper by D’Angelo Russell with 54 seconds left, and Hartenstein answered with a left-handed layup with 33 seconds to play. Gilgeous-Alexander hit two free throws with 21.3 seconds left, and Holmgren added two more with 3.3 left.\n\n\r\n              Dallas’ Cooper Flagg, last summer’s No. 1 draft pick, had his lowest scoring game with two points on 1 of 9 shooting after suffering a contact injury to his left shoulder during the game’s first possession. Flagg held his shoulder multiple times during the first half and used a heat wrap when out of the game in the second half.\n\n\r\n              Gilgeous-Alexander went into play leading the NBA averaging 40.0 points, topped by a career-best 55 in a double-overtime win at Indiana last Thursday.\n\n\r\n              The Mavericks’ “jumbo” forecourt was downsized with center Dereck Lively II sidelined with a knee contusion. The Thunder outscored the Mavericks 68-36 in the paint and outrebounded Dallas 55-36.\n\n\r\n              Up next\r\n              The Thunder host Sacramento on Tuesday.\n\n\r\n              The Mavericks’ season-opening five-game homestand, the first in the NBA since the 1983-84 Kansas City Kings, will end Wednesday against Indiana.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042513.827033
}