{
  "game_id": "0022300735",
  "espn_id": "401585363",
  "date": "Feb 08, 2024",
  "matchup": "BKN vs. CLE",
  "headline": "Cavaliers beat short-handed Nets 118-95 for 8th straight victory and 16th in 17 games",
  "body": "NEW YORK -- — Donovan Mitchell scored 27 points and the Cleveland Cavaliers beat the short-handed Brooklyn Nets 118-95 on Thursday night for their eighth straight victory and 16th in 17 games.\n\n\r\n              Evan Mobley added 14 points and 12 rebounds, Jarrett Allen had 14 points and 10 rebounds and Darius Garland also scored 14 points.\n\n\r\n              Cleveland shot 53% from the field and had a 45-33 rebounding edge and assisted on 25 of the 41 made baskets on the second game of a back-to-back after winning at Washington on Wednesday night.\n\n\r\n              “You have fun because of the results, and you can enjoy it because of the results and what our message to the guys is,\" ” Cavaliers coach J.B. Bickerstaff said. “You can have fun in the competition, you can have fun supporting one another, pulling for one another, doing the gritty, dirty things, sharing the ball.”\n\n\r\n              Mikal Bridges led Brooklyn with 26 points in its third straight loss. Cam Thomas added 17. The Nets have lost each of their three meetings against Cleveland, including the Jan. 11 meeting in France.\n\n\r\n              “It started pretty early for them again,\" Brooklyn coach Jacque Vaughn said. \"Just like in Paris, Mitchell started off aggressive and really got it going early, kind of set the tone, was able to do that again tonight.” \n\n\r\n              The Nets were busy Thursday at the trade deadline. They sent Spencer Dinwiddie to Toronto for Dennis Schroder and Thaddeus Young, and moved Royce O’Neale to Phoenix for Keita Bates-Diop, Jordan Goodwin and two second-round picks. They also acquired the rights to Vanja Marinkovic from Memphis.\n\n\r\n              Cleveland led 59-51 to start the second half when Brooklyn’s Ben Simmons shoved Allen to the floor. Allen retaliated by charging past Mitchell and pushing Simmons back. Both players received technical fouls.\n\n\r\n              The Cavaliers responded with a 21-0 run, holding the Nets to 0-for-9 shooting and forcing two turnovers. Allen capped the run with a hook shot that made it 80-51.\n\n\r\n              “It was just the moment,” Allen said. “It’s a day-by-day type of thing. I’m just a guy that tries to stay even keeled, but when buttons are pushed there is a retaliation.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Toronto on Saturday night.\n\n\r\n              Nets: Host San Antonio on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996336.475969
}