{
  "game_id": "0021300495",
  "espn_id": "400489368",
  "date": "Jan 04, 2014",
  "matchup": "MIL @ PHX",
  "headline": "Green scores 24, Phoenix beats Milwaukee 116-100",
  "body": "PHOENIX --  Milwaukee gave one to the Phoenix Suns Thursday night in the form of a season-worst 26 turnovers.\n\nThe result was a 116-100 Phoenix victory.\n\nAfter yet another loss for a Milwaukee squad with the NBA's worst record, teammates Larry Sanders and Gary Neal got into a heated, face-to-face argument in the Bucks' locker room.\n\nThe Suns, on the other hand, couldn't say enough nice things about each other.\n\nGerald Green had a season-best 24 points and a career-high five steals starting in place of the Suns' injured Eric Bledsoe.\n\n\"Really it was kind of easy for me,\" Green said. \"My teammates, man, were just doing the job. They were pressuring guys, making guys throw lazy passes and I'm just able to use my athleticism to make the steal.\"\n\nChanning Frye added 22 points, going 6 of 9 on 3-pointers, Goran Dragic scored 13 of his 15 in the second half and Markieff Morris added 14 for the Suns, who have won 11 of 14 but were coming off a home loss to Memphis on Thursday.\n\nBrandon Knight had 25 points for the Bucks and O.J. Mayo scored 18 of his 20 in the second half.\n\nThe Suns had 38 points off Milwaukee turnovers. Phoenix had 11 turnovers for just seven Bucks points.\n\n\"You give them that many easy ones and it's tough to come out with a win,\" Mayo said. \"On the road especially.\"\n\nSanders was overheard questioning Neal's attitude in the tense, loud postgame confrontation as Mayo ushered reporters out into the hallway. The locker room was opened about five minutes later, and Neal was still visibly upset as he left.\n\n\"I earn my money,\" he yelled back into the locker room. \"You should try it some time.\"\n\nSanders, who signed a four-year, $44 million contract extension in the offseason, declined to talk about the incident.\n\n\"I just had a bad game,\" he said.\n\nMayo called the run-in \"a little Kumbaya moment. `'\n\n\"It is team bonding,\" he said. \"There are different ways you go about it.  It is an emotional roller coaster. When things aren't going well, that is when the real men reveal their true colors. `'\n\nThe Bucks have lost 10 of 12 to drop to 7-26.\n\nThe run-in occurred after coach Larry Drew had spoken to reporters.\n\n\"It was the turnovers that really hurt us,\" Drew said, \"and turnovers that you can't even recover from. That's the disheartening part about a game like this.\"\n\nBledsoe missed his second game in a row with a sprained right knee and is expected to be out for another week.\n\nGreen's performance included a pair of breakaway windmill dunks and four 3-pointers.\n\nCoach Jeff Hornacek said Green had some trouble defending Knight one-on-one, but when he was playing defense off the ball, it was another story.\n\n\"They were running off screens and he did a great job of shooting the gap, getting the steals and putting the highlights up there,\" Hornacek said.\n\nPhoenix led by 20 in the second quarter and 23 in the third before Milwaukee twice cut it to seven early in the final quarter.\n\nThe Suns never trailed, breaking away from a 28-28 tie with 12 consecutive points to take a 40-28 lead on Ish Smith's 21-footer.\n\nGreen's first windmill dunk, followed by his 3-pointer, gave the Suns their biggest lead of the half, 58-38, 2:13 before the break. But the Bucks ended the half with a 9-2 run to cut the lead to 60-49, Knight sinking a 3-pointer with 16.9 seconds to go.\n\nDragic scored nine in a 13-2 run that put Phoenix back in control, 74-53, with 7:49 left in the third quarter. But Knight scored five and Mayo sank a 3 in a 9-0 Bucks burst that sliced the lead to 87-80 on Mayo's steal and dunk with 11:26 to play. Mayo's 21-footer again made it a seven-point game at 91-84 with 8:40 to play.\n\nGreen responded with a 3, then Morris made three shots in a row, the last a fadeaway 9-footer and it was 100-84. Caron Butler's 3 cut it to 104-92, but consecutive 3s by Frye and Green's last windmill made it 112-92 3:11 from the end.\n\nPhoenix improved to 20-12. The Suns didn't win their 20th last season until Feb. 27.\n\nGame notes  The Bucks, who have used 15 different starting lineups this season, had the same one for the third straight game. ... Phoenix leaves Monday for a five-game road trip, beginning Tuesday night in Chicago. ... Phoenix is 19-1 against Milwaukee at US Airways Center. Last season, the Bucks won to snap a 24-game losing streak in Phoenix.",
  "source": "espn_api",
  "crawled_at": 1764992778.148316
}