{
  "game_id": "0021301134",
  "espn_id": "400490007",
  "date": "Apr 04, 2014",
  "matchup": "DET @ BKN",
  "headline": "Mirza Teletovic, Nets use 3-point attack to beat Pistons, up home streak",
  "body": "NEW YORK -- Lately, it seems as though the Brooklyn Nets just can't get enough home cooking.\n\"You feel comfortable when you have dinner at your house, rather than when you go to someone else's house and don't know what they're going to cook,\" Nets forward Paul Pierce said.\nShaun Livingston scored 23 points, Mirza Teletovic made six 3-pointers and added 20 off the bench, and the Nets beat the Detroit Pistons 116-104 on Friday night for their 15th straight victory at Barclays Center.\nThe Nets went 15 for 31 from behind the arc.\nBrooklyn used a 35-9 run that began late in the first quarter, and lasted halfway through the second, to build a strong working margin. The Nets led by as many as 22, and were never truly threatened, although the Pistons did cut the lead to single digits on several occasions.\nPierce added 17 for Brooklyn, which had six players reach double figures in scoring.\nThe Nets topped the 110-point mark for the eighth time this season. Coach Jason Kidd credited his team's ball movement as a primary reason for Brooklyn's strong offensive output.\n\"The one thing that leads to 3s is everyone being unselfish,\" Kidd said. It doesn't matter if it's (Andray) Blatche, if it's (Deron Williams), if it's Joe (Johnson) -- guys are posting up, and they're finding their teammates. When you're unselfish like that, you get the looks that we're getting from behind the 3.\"\nBrooklyn remained 2 1/2 games behind the Chicago Bulls and Toronto Raptors, who both won, in the race for the No. 3 seed in the East.\nThey could potentially get a lift from Kevin Garnett, who, according to Kidd, may return to action Saturday night in Philadelphia after sitting out the last 19 games due to back spasms.\n\"We'll see,\" Kidd said, about the prospect of the 37-year-old center returning to the lineup. \"We would like to try to get him to go tomorrow, but it's up to him.\"\nLivingston, for one, can't wait to see his teammate back on the floor.\n\"It means everything to this team,\" Livingston said. \"He's our leader.\"\nOn the other side, the Pistons just couldn't seem to do anything about the easy looks that the Nets were getting. Their lax perimeter defense, particularly in the game-defining second quarter, ultimately proved to be their undoing.\nPistons guard Rodney Stuckey offered very basic analysis of his team's loss.\n\"They made 3s. They were on fire. That was it,\" he said.\nThe Nets shot a season-high 60.5 percent from the field.\n\"They shot 60 percent,\" Pistons interim coach John Loyer said. \"You're not going to win an NBA game when (your opponent) shoots 60 percent.\"\nThe Pistons were unable to take advantage of their massive rebounding edge. They pulled down 46 rebounds to Brooklyn's 26, and 19 offensive boards to Brooklyn's two. Loyer felt that despite the edge, the Nets did what they needed to do inside, as they kept Pistons forward Greg Monroe in check. Monroe, who averages over 15 points a game, could manage only six.\n\"Brooklyn came and got the ball out of Greg Monroe's hand,\" Loyer said. \"They were going to try to get it out of his hands and make someone else beat (them). I thought what it did was force us to shoot 21 3s in the first half. That's not us. We're last in the league in 3-point shooting.\"\nThe Nets have seven games remaining to try to close the gap on Chicago and Toronto. They remain hopeful that they can catch at least one, if not both clubs, thanks to the fact that only one of their final seven opponents has a record above .500.\nGame notes\nThe game was the first of a back-to-back for Brooklyn, its 18th of the season. The Nets are 13-5 in back-to-back openers. They head to Philadelphia on Saturday night. ... The Pistons had won three straight against Brooklyn dating to last season. ... The Nets are now 32-7 when scoring more than 100 points.",
  "source": "espn_api",
  "crawled_at": 1764993274.473482
}