{
  "game_id": "0021800217",
  "espn_id": "401070898",
  "date": "Nov 16, 2018",
  "matchup": "MIA @ IND",
  "headline": "Evans scores 23 points to lead Pacers past Heat 99-91",
  "body": "INDIANAPOLIS --  Tyreke Evans hit five 3-pointers and scored a season-high 23 points off the bench, leading the Indiana Pacers to a 99-91 victory over the Miami Heat on Friday night.\n\nBojan Bogdanovic had 16 points and six rebounds and Domantas Sabonis added 15 points and 12 rebounds off the bench for the Pacers in the first of three games in four nights at home.\n\nJosh Richardson scored 28 points, including 7 of 10 from beyond the arc, and Hassan Whiteside had 12 points and 17 rebounds for the Heat, losers in four of their last five games.\n\nThe Pacers used a 16-0 run in the second quarter to take the lead for good. Indiana did just enough in the second half to fend off its Eastern Conference rivals.\n\nSabonis converted a three-point play with 7:24 left in the second quarter to give the Pacers a 34-32 lead, and they led the rest of the way.\n\nThe win comes a week after the Pacers rallied to beat the Heat 110-102 in Miami, closing out the victory with a 16-2 run that included the final 12 points.\n\nMiami was unable to return the favor in the second of three regular-season meetings between the teams.\n\nBam Adebayo made a lay-up at the start of the fourth quarter that pulled the Heat within three, but the Pacers scored seven straight and extended the lead to 79-69 on a fast-break dunk by Bogdanovic with 9:21 remaining.\n\nThe Heat cut the lead again with a late 7-0 run, including a layup and 3-pointer by Richardson to make it 92-89 with 1:27 left. Victor Oladipo answered with a 3-pointer that put Miami away for good.\n\nIndiana trailed by as many as 12 points in the opening quarter before going on a 10-2 run at the start of the second.\n\nEvans made two 3-pointers and a pair of free throws in Indiana's go-ahead run. The Pacers took a 12-point lead when Cory Joseph hit a 3 to make it 44-32 with 5:14 left in the first half.\n\nIndiana led 50-43 at halftime\n\nTIP-INS\n\nHeat: Whiteside has finished with a double-double in each of the last six games. . Rodney McGruder had 11 points and five rebounds. . G Dwyane Wade missed his sixth straight game for personal reasons after the recent birth of his daughter.\n\nPacers: Indiana has won 12 of the last 13 regular-season home games against the Heat. . Evans finished with 10 rebounds and shot 6 for 6 from the line. . Oladipo finished with eight points after scoring 20 or more in each of the previous 13 games.\n\nUP NEXT\n\nHeat: Home against the Los Angeles Lakers on Sunday.\n\nPacers: Home against Atlanta on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA andhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995264.144743
}