{
  "game_id": "0021900267",
  "espn_id": "401160909",
  "date": "Nov 29, 2019",
  "matchup": "BKN vs. BOS",
  "headline": "Dinwiddie has 32, Nets beat Celtics as Irving sits again",
  "body": "NEW YORK --  Kyrie Irving is getting closer to a return, and at some point he will face his former team.\n\nWhen he does, the Brooklyn Nets can only hope he plays as well as Spencer Dinwiddie.\n\nDinwiddie had 32 points and 11 assists while Irving remained sidelined, and the Nets beat the Boston Celtics 112-107 on Friday to split a home-and-home series.\n\nIrving missed his eighth straight game with a right shoulder injury but was at the arena to get an evaluation and watch from the bench along with Kevin Durant. Coach Kenny Atkinson said afterward that the All-Star point guard has started work on the court and would miss one more game before potentially being ready to rejoin a team that has done well in his absence thanks to Dinwiddie's strong performances.\n\n\"When Kyrie comes back I think that's just going to give us a team with more depth, a more powerful team. But listen, he's playing as good as anybody in the NBA right now in my humble opinion,\" Atkinson said of Dinwiddie.\n\nThe Eastern Conference player of the week last week matched his highest assist total of the season and was two shy of his best scoring performance of the season.\n\n\"The role's completely different so obviously there's a change there,\" Dinwiddie said. \"My approach to the game is very similar either way, so whatever the team needs to win and then the role kind of dictates what that is.\"\n\nJarrett Allen added 14 points and 11 rebounds for the Nets, who bounced back from their 121-110 loss in Boston on Wednesday to win for the fifth time in six games.\n\nJayson Tatum had 26 points and nine rebounds for the Celtics, who had won two straight. Kemba Walker finished with 17 points and six assists, but the Nets handled Irving's replacement much better this time after he scored a season-high 39 points Wednesday.\n\nBoston coach Brad Stevens talked about the importance of a strong start with the early tip, but the Celtics couldn't deliver it. They were called for a double dribble and a 3-second violation during a six-turnover first quarter, when the Nets opened a 14-point lead. Boston was much sharper in the second, with Tatum making four 3-pointers, including one that cut it to 58-55 at halftime.\n\nThe Nets extended it back to 14 in the third when Dinwiddie hit his second straight 3-pointer, but Boston got it back down to 87-81 by the end of the period. Again, Brooklyn pushed it back to double digits in the fourth and held on after Boston cut it to four in the final minute.\n\n\"It was too late,\" Celtics guard Marcus Smart said. \"We tried to turn it on too late and it burned us in the end.\"\n\nTIP-INS\n\nCeltics: Tatum was 4 for 8 from 3-point range after going 0 for 11 in his previous three games. ... Marcus Smart scored 15 points. ... The Celtics will remain in New York before visiting the Knicks on Sunday.\n\nNets: DeAndre Jordan had eight points and 11 rebounds after missing two games with left ankle soreness. ... Taurean Prince scored 16 points. ... The Nets finished 9-6 this month, their first winning November since going 11-4 in 2012, their first full month in Brooklyn.\n\nMORE ON KYRIE\n\nTwo days after Celtics fans taunted Irving even in his absence, and he responded with a long Instagram post saying sports and entertainment were \"ignorant and obtrusive.\", a group of Nets fans chanted \"Kyrie's better! Kyrie's better!\" when Walker shot free throws. None of the anger in Boston toward Irving is coming from Stevens.\n\n\"I like Kyrie, I appreciated Kyrie, wished him well and I think that him coming home has been something that he wanted to do and he was a free agent,\" Stevens said. \"You get to make that choice and we can't do anything but respect that and be happy for him.\"\n\nNEW LOOK\n\nThe Nets debuted their uniforms in tribute to the Bedford-Stuyvesant neighborhood of the borough that was home to The Notorious B.I.G. The white uniforms say Bed-Stuy across the front, with a camouflage pattern along the sides of the jerseys and shorts. The Nets plan to wear them 28 times this season.\n\nUP NEXT\n\nCeltics: Visit New York Knicks on Sunday.\n\nNets: Host Miami on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996727.038257
}