{
  "game_id": "0022201133",
  "espn_id": "401469288",
  "date": "Mar 28, 2023",
  "matchup": "MEM vs. ORL",
  "headline": "Bane's 31 points, late free throws lead Grizzlies over Magic",
  "body": "MEMPHIS, Tenn. -- — Desmond Bane scored 31 points and made 8 of 10 free throws down the stretch as the Memphis Grizzlies held off the Orlando Magic 113-108 on Tuesday night.\n\n\r\n              Bane's free throws thwarted a last-minute rush by the Magic, led by Franz Wagner, who ended up with 25 points, including nine in the final 1:10.\n\n\r\n              \"We've just got to keep our composure,\" Bane said. “We had a couple of silly turnovers. I thought we just kind of played with the game.”\n\n\r\n              Xavier Tillman had a career-high 20 points for Memphis, while Luke Kennard and Jaren Jackson Jr. finished with 16 points apiece. Jackson added 10 rebounds and three blocks.\n\n\r\n              Ja Morant, the Grizzlies' leading scorer, sat out the first night of a back-to-back with right thigh soreness.\n\n\r\n              Paolo Banchero finished with 24 points and Wendell Carter Jr. added 14 for the Magic.\n\n\r\n              Orlando, which trailed by 23 in the third quarter, got the deficit to single digits early in the final period. Then a 10-2 run pulled Orlando within 105-100 with 38 seconds left. Bane's free throws kept Memphis ahead for its seventh straight win.\n\n\r\n              “Being ready to go from the beginning of the game. That's the biggest key,” Magic coach Jamahl Mosley said. “Knowing (the Grizzlies) are a playoff team that's fighting for a championship, they're going to come out and set the tone early. Our guys felt that right off the bat.”\n\n\r\n              Memphis led by as many as 22 in the first half, benefitting from the Magic shooting 37%. A dozen turnovers only added to the Magic troubles. Memphis would extend the lead to 23 in the third.\n\n\r\n              Still, Orlando made a push to get back in, partially fueled by Goga Bitadze, who came off the bench for 11 of his 13 points in the third to cut the Memphis lead to 87-73. Things got even tighter in the fourth, but Memphis was able to hang on. Orlando has faced similar close games on several occasions lately.\n\n\r\n              “It's very valuable,” Banchero said. “Just knowing how to manage games and coming down and putting good possessions together at the end of the game. Today was different. It was more of us just chasing them.”\n\n\r\n              By holding off the late-charging Magic, the Grizzlies won their 33rd game at home, setting a franchise record for home wins in a season.\n\n\r\n              “A win is a win. Glad we got it, but we can definitely play a whole lot better,” Bane said.\n\n\r\n              TIP-INS\n\n\r\n              Magic: Entering the game, Orlando had averaged 117.2 points a game in March. If the Magic continue on that pace, it would be the highest-scoring month in franchise history, eclipsing the 116.8 points a game in November 1994. ... Banchero, who leads NBA rookies in scoring with a 19.8 average, has reached double figures in 65 games. ...Franz Wagner recorded his 500th career assist in the third quarter. \n\n\r\n              Grizzlies: Jackson's three blocks gave him 177 for the season, tying his own record for the most in franchise history. ... Kennard, who was 17 of 25 from 3 in his last three games, made all four of his 3-pointers in the first half. \n\n\r\n              MORANT SITS\n\n\r\n              Morant sat for the first time since returning March 22 from his eight-game, league-imposed suspension. Memphis coach Taylor Jenkins said as the team set up the playmaking guard's return to action, they were aware that Tuesday's game would be the first back-to-back he would face. The Los Angeles Clippers visit Memphis on Wednesday night. Jenkins emphasized the decision was precautionary and not anything long term.\n\n\r\n              THEY SAID IT\n\n\r\n              Bane makes 89% of his free throws, among the top 15 in the league. Yet he missed two in the final 40 seconds. “A couple of them rattled in and out, and I was like: ‘What the hell is going on?’” Bane said after the game. “But I regathered myself and was able to knock them down down the stretch.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Washington on Friday.\n\n\r\n              Grizzlies: Host the Los Angeles Clippers on Wednesday in the first of two consecutive games between the teams.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994165.8294919
}