{
  "game_id": "0021900255",
  "espn_id": "401160897",
  "date": "Nov 27, 2019",
  "matchup": "CLE vs. ORL",
  "headline": "Fournier leads Magic over Cavs for 1st road win of season",
  "body": "CLEVELAND --  The short-handed Orlando Magic finally left a road arena with a victory.\n\nEvan Fournier scored a season-high 30 points and the Magic won away from home for first time this season, beating the Cleveland Cavaliers 116-104 on Wednesday night.\n\nThe Magic, playing without center Nikola Vucevic and forward Aaron Gordon, were 0-7 on the road going into the game.\n\n\"The guys could have put their heads down and mailed it in at the end of a road trip, but they fought through it tonight,\" Orlando coach Steve Clifford said.\n\nVucevic and Gordon both missed their third straight game with right ankle injuries, but the Magic didn't need two of their top players.\n\n\"The way we came out with defense and playing hard, that's a true test of character,\" Fournier said.\n\nNot only has Cleveland lost eight of nine, Kevin Love's sore back continues to be an issue. The veteran forward returned after missing two games but was limited to 24 minutes, scoring nine points and grabbing five rebounds.\n\nLove went to the locker room early in the second half and returned to play five minutes in the fourth quarter before being removed.\n\nCavaliers coach John Beilein said Love wasn't himself and isn't sure what the next step will be in dealing with the injury.\n\n\"I have no idea how to interpret it yet,\" Beilein said. \"If you've had a bad back, from one day to another day you don't know what it's going to be like. He wants to go out there and give it his all. He wants to play even when he's hurt. When he's out there playing hurt but he can't move the way he functionally needs to move, it's not good for him and it's not good for us.\"\n\nTerrence Ross and Jonathan Isaac each scored 16 points for Orlando, which went ahead for good early in the second quarter and steadily built the lead.\n\nCleveland cut a 17-point deficit to 98-90 midway through the fourth, but Markelle Fultz and Mo Bamba hit 3-pointers on back-to-back possessions for the Magic.\n\nFournier was 10 of 22 from the field and made all six of his free throws, falling two points shy of his career high.\n\nCleveland committed a season-high 25 turnovers. Collin Sexton scored 20 points and rookie Darius Garland added 16, but also had eight turnovers.\n\nOrlando, which led by nine at halftime, used a 13-3 run to begin the third quarter to go ahead 72-55 for its biggest lead. The Magic maintained a double-figure advantage for most of the second half.\n\nVucevic averages a team-high 11.6 rebounds and is Orlando's second-leading scorer at 17.1 points per game. Gordon averages 13.1 points and 6.2 rebounds.\n\nTristan Thompson had 13 points and 15 rebounds for Cleveland.\n\nTIP-INS\n\nMagic: Fultz and Bamba each scored 15 points. ... D.J. Augustin had 10 assists. ... Gordon went through drills during shootaround, but still isn't ready to play.\n\nCavaliers: Love didn't play against Portland on Saturday when Cleveland broke a six-game losing streak. He also missed Monday's loss to Brooklyn. ... C John Henson hasn't played since the second game of the season because of a strained right hamstring. \"He decided he was not ready yet, that he needs more time to heal,\" Beilein said.\n\nIT'S NOT EASY\n\nVucevic and Gordon were injured against Toronto and didn't play against Indiana or Detroit.\n\n\"It stinks having a teammate down like Vuch and Aaron, but you have to do your job and do your best,\" Bamba said.\n\nTHAT'S TOO MANY\n\nBeilein was unhappy with the turnovers, which included several traveling violations.\n\n\"You have 25 turnovers in a game, you're not going to win,\" he said. \"It's one thing if we're throwing the ball away, but not getting a shot at the basket because of a walk, I've got to figure that out.\"\n\nUP NEXT\n\nMagic: Host the Toronto Raptors on Friday. Orlando has won three straight home games.\n\nCavaliers: Host the Milwaukee Bucks on Friday. The Bucks beat visiting Cleveland 129-112 on Oct. 28.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996326.039668
}