{
  "game_id": "0022400814",
  "espn_id": "401705380",
  "date": "Feb 23, 2025",
  "matchup": "ATL vs. DET",
  "headline": "Cade Cunningham scores 38 as Pistons win 148-143 shootout over Hawks",
  "body": "ATLANTA -- — Cade Cunningham had 38 points, 12 assists and seven rebounds, and the Detroit Pistons extended their winning streak to a season-high six games with a 148-143 win over the Atlanta Hawks on Sunday night.\n\n\r\n              Malik Beasley scored 24 points, shooting 6 of 10 from 3-point range.\n\n\r\n              The Pistons shot a season-best 59.1% from the field en route to a season high in points. They were 20 for 40 from 3-point range. Tim Hardaway Jr. scored 18 points and Dennis Schroder added 16 off the bench.\n\n\r\n              Trae Young had 38 points and 13 assists for the Hawks, who lost their third straight. Georges Niang scored 27 points and tied a career high with seven 3-pointers.\n\n\r\n              Cunningham had his big night while being guarded primarily by Hawks guard Dyson Daniels, a candidate for Defensive Player of the Year. Daniels had four steals to give him an NBA-best 156 for the season, but Cunningham dominated so thoroughly in the first half that the Hawks double-teamed him almost every time he touched the ball — including in the backcourt — after the break.\n\n\r\n              Takeaways\r\n              Pistons: The Pistons are sixth in the Eastern Conference and continue to march toward their first playoff berth since 2019.\n\n\r\n              Hawks: The Hawks couldn't get enough stops and couldn't capitalize on an 11-attempt advantage at the free-throw line.\n\n\r\n              Key moment\r\n              Schroder hit a driving layup while getting fouled with 33 seconds left. His free throw gave the Pistons a 142-140 lead after an 11-2 Hawks run put them in front.\n\n\r\n              Key stat\r\n              Cunningham had 29 points and 10 assists at halftime, the first time in his career he had a double-double at the break.\n\n\r\n              Up next\r\n              The Hawks wrap up a three-game homestand on Monday when the face Miami. The Pistons face the Los Angeles Clippers on Monday in the first of four straight home games.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998296.905751
}