{
  "game_id": "0021801180",
  "espn_id": "401071853",
  "date": "Apr 05, 2019",
  "matchup": "TOR @ CHA",
  "headline": "Lamb hits 3-point winner, Hornets beat Raptors 113-111",
  "body": "CHARLOTTE, N.C. --  The Toronto Raptors are hoping they don't have to see Jeremy Lamb in the playoffs.\n\nLamb beat the Raptors on a last-second 3-pointer for the second time in less than two weeks, knocking down a 27-footer from near the top of the key with 3.3 seconds left to lift the Charlotte Hornets to a 113-111 win Friday night.\n\nThe winning shot came after Lamb hit an improbable half-court buzzer-beater to shock the Raptors in Toronto on March 24 in one of the craziest endings in the NBA this season.\n\n\"He's made two great shots -- tonight's was a little easier than the other one,\" said Raptors guard Fred VanVleet. \"Give them credit, those guys are making plays and they're playing for their playoff lives and you can see it in their energy and enthusiasm they have.\"\n\nKemba Walker had 29 points, Lamb finished with 22 points and Frank Kaminsky added 22 points and 13 rebounds for the Hornets (37-42), who kept their slim postseason hopes alive and surpassed their win total of the previous two seasons. Charlotte is two games behind eighth-place Brooklyn in the Eastern Conference, with three games remaining. Miami is in ninth place, a game behind the Nets.\n\nIt was Lamb's fourth game-winning shot of the season, but he was quick to deflect praise to Walker, who drove the length of the court and delivered a perfect wraparound pass from underneath the basket to set up the winning shot.\n\n\"Man, Kemba made a great pass, and everybody said if I get it, shoot it,\" Lamb said. \"I just tried to shoot it with confidence.\"\n\nSaid Kaminsky: \"It feels like every time we've needed a big score at the end of the season so far it's been Jeremy.\"\n\nKawhi Leonard finished with 29 points for Toronto, but missed a fall-away jumper with 1 second left. Serge Ibaka had 20 points and 12 rebounds and Kyle Lowry had 16 points and 11 assists for the Raptors, who had their five-game win streak snapped.\n\nIt was essentially a meaningless game for Toronto (56-24), which is locked into the No. 2 seed in Eastern Conference playoffs regardless of how the rest of the season plays out.\n\nLeonard gave the Raptors the lead when he spun around a defender near the foul line and scored on a layup off the glass with 15 seconds left.\n\nThat's when Walker drove the length of the court, drew a double team and kicked it out to Lamb near the top of the key, who found nothing but net. Leonard's fall-away 19-footer got stuck between the rim and the backboard with 1 second left on the clock, forcing a jump ball at midcourt.\n\n\"They switched it pretty good and got him down there,\" Raptors coach Nick Nurse said of Leonard's attempt. \"But it wasn't too bad (of a shot) with 3.3 to go that we got Kawhi the ball. He had been hitting everything in sight up until that point.\"\n\nTIP INS\n\nRaptors: Ibaka scored 12 straight points for the Raptors in the fourth quarter.\n\nHornets: Played without Marvin Williams (right foot strain) and Cody Zeller (knee). ... Nic Batum saw action off the bench after not playing at three of the team's last four games because of a coach's decision.\n\nWALKER REACHES 2000\n\nWalker was 11 of 18 from the field and joined Glen Rice as the only players in franchise history to score 2,000 points in a season. Rice scored 2,115 points in the 1996-97 season.\n\nUNDER THE RADAR\n\nVanVleet said the hopes the Raptors are mostly flying under the radar entering the playoffs.\n\n\"We're not the most famous team in the world, obviously, Kawhi (Leonard) is probably the biggest star and he's quiet and that kind of gives us our identity to go about our business and do our thing and not worry about anything else,\" he said. \"We'll get enough accolades and praise and pats on the back if we do what we're supposed to do and make it all the way to the NBA finals.\"\n\nBENCH PLAY\n\nThe Hornets bench outscored the Raptors' 59-38 behind Lamb and Kaminsky.\n\n\"Yeah, they did an amazing job, especially Frank, man,\" Walker said. \"He came in and had an amazing game. He gave us a huge spark. Everyone contributed and it's a big win for us.\"\n\nUP NEXT\n\nRaptors: Host the Heat on Sunday.\n\nHornets: Visit Pistons on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994240.704593
}