{
  "game_id": "0022100647",
  "espn_id": "401360466",
  "date": "Jan 15, 2022",
  "matchup": "CHI @ BOS",
  "headline": "Celtics rally late, edge Bulls 114-112 on Williams' FTs",
  "body": "BOSTON -- — Robert Williams hit a pair of free throws with 9.7 seconds left and the Boston Celtics scored the final eight points to edge the Chicago Bulls 114-112 on Saturday night. \n\n\r\n              Williams, who tied it at 112 with two foul shots with 31 seconds to go, finished with 14 points and 13 rebounds. Boston rallied after trailing 112-106 with 1:57 to play. \n\n\r\n              “It’s a moment everybody in this league wants and waits for. I’m glad I made them,” said Williams, who was shooting 66% from the foul line entering the game. “I’m glad my teammates had my back. It boosted my confidence.”\n\n\r\n              Jayson Tatum led the Celtics with 23 points and 12 rebounds. Jaylen Brown scored 19 points and Dennis Schroder had 16 points and eight assists for Boston. \n\n\r\n              The Celtics, who lost 111-99 in Philadelphia on Friday night, won for the fourth time in five games. Coach Ime Udoka said the team seems to have learned from mistakes that cost Boston earlier in the season. \n\n\r\n              “We’ve been in a lot of tough games like this and the guys have been growing from it,” Udoka said. “To the credit of our guys, they got down a little bit and never hung their heads, continued to fight and dug their way back out of it.”\n\n\r\n              Nikola Vucevic had 27 points for Chicago and rookie Ayo Dosunmu scored a career-high 21 points and added 10 assists. DeMar DeRozan, who missed a shot at the buzzer that could have tied it, scored 23. \n\n\r\n              Chicago was coming off a 138-96 loss at home to Golden State on Friday night and lost for the fourth time in five games. The Bulls couldn't hold off the Celtics down the stretch despite numerous mistakes by Boston, which led 54-49 at halftime and 84-83 after a tight third quarter. \n\n\r\n              “They went out and did a great job — not a great job losing a game, but we competed,” Chicago coach Billy Donovan said. “It’s always how you respond. I thought today we did a much better job controlling our response.” \n\n\r\n              The Celtics faltered down the stretch with several mistakes, including a bad pass by Tatum, a traveling call on Brown and an offensive foul committed by Tatum. But Chicago couldn't quite close out the Celtics, who still had a chance after Brown hit from the corner to pull the Celtics within 112-110 with 1:06 left.\n\n\r\n              Malcolm Hill missed a shot for Chicago and Williams drew a foul at the other end, tying it with a pair of free throws with 31 seconds left to play. \n\n\r\n              DeRozan missed from the lane with 11 seconds left and Boston got the rebound. Williams drew foul on Vucevic and went to the line with 9.7 seconds left, sinking both to put the Celtics back up. \n\n\r\n              HALFWAY POINT\n\n\r\n              The Bulls fell to 27-14 but still hold the top spot in the Eastern Conference halfway through their season. Donovan said that's a bit surprising, considering all the turnover he's had on the roster in what has been a chaotic first half for all. \n\n\r\n              “We are not whole and we’ve got to get healthy. It’s hard for me to say. It may be hard to evaluate your team because you haven’t really seen your whole team play,” Donovan said. “I've got a lot of confidence in the group and a lot of belief in the group.” \n\n\r\n              TIP-INS\n\n\r\n              Bulls: G Zach LaVine did not travel with the club after injuring his left knee early in Friday night’s game. An MRI on Saturday did not reveal any significant structural damage and LaVine will be reevaluated early next week, the Bulls said. Although there was no timetable for his return, the Bulls said LaVine was not expected to miss significant time. LaVine tore the ACL in the same knee while playing for Minnesota in February 2017. … The Bulls were also without G Lonzo Ball (left knee soreness). G Alex Caruso remained in COVID-19 health and safety protocols. \n\n\r\n              Celtics: Tatum scored 13 in first quarter. ... G Marcus Smart (health and safety protocols) missed his third straight game. ... The Celtics improved to 1-1 against Chicago this season and snapped a three-game slide against the Bulls.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Memphis on Monday afternoon. \n\n\r\n              Celtics: Host New Orleans on Monday afternoon. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992964.0779572
}