{
  "game_id": "0022000131",
  "espn_id": "401267291",
  "date": "Jan 08, 2021",
  "matchup": "LAL vs. CHI",
  "headline": "LeBron gets 28, Lakers hold off Bulls 117-115 without Davis",
  "body": "LOS ANGELES -- — LeBron James had 28 points, seven rebounds and seven assists, and the Los Angeles Lakers overcame the absence of two injured starters for a 117-115 victory over the Chicago Bulls on Friday night.\n\n\r\n                    Zach LaVine scored 38 points, but the UCLA product missed a 17-foot jumper with 4.7 seconds left that would have put Chicago ahead.\n\n\r\n                    Montrezl Harrell had 17 points and 14 rebounds for the defending NBA champions, who have won five of six. James and Harrell led the way as Los Angeles held off the Bulls down the stretch without injured starters Anthony Davis and Kentavious Caldwell-Pope.\n\n\r\n                    The Lakers lead the Western Conference at 7-3 despite the challenges of injuries and several roster changes.\n\n\r\n                    “Through the first 10 games, I think we’ve played B, B-plus basketball, and that is absolutely OK,” James said. “We’re a team that added basically five pieces to the rotation, and we’re still learning each other. We’re getting accustomed to different lineups, playing different guys, and we’re playing pretty good basketball. We want to be better. That lets me know we have room to improve, which is a bright spot.”\n\n\r\n                    LaVine scored 19 points in the first quarter for the Bulls, who have lost seven straight to the Lakers.\n\n\r\n                    Dennis Schröder scored 17 points and hit a 3-pointer with 2:39 to play to put the Lakers up 113-107, but Chicago trimmed the lead to 116-115 on Garrett Temple's 3-pointer with 37 seconds left.\n\n\r\n                    James missed an extra-long 3-pointer to put the game in Chicago's hands, but LaVine missed his contested jumper, and his teammates fumbled the ball out of bounds.\n\n\r\n                    “From my view, he got off a pretty good look,” Chicago coach Billy Donovan said. “That’s what we wanted. ... I think we’ve gotten better competing. Now I think we’ve got to start to address getting better and not beating ourselves. The Lakers beat us, but there’s things we could have done better that impacted the game.”\n\n\r\n                    Wendell Carter Jr. scored a season-high 23 points and Thaddeus Young had 15 for Chicago.\n\n\r\n                    “It was far from perfect,” Lakers coach Frank Vogel said. “We weren’t playing our best basketball on the second night of a back-to-back, but we hung in there and competed and grinded it out.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Otto Porter Jr. didn't return for the second half after experiencing back spasms. He played six minutes. ... The teams meet again Jan. 23 in Chicago. ... Lauri Markkanen stayed home from the West Coast trip due to coronavirus protocols.\n\n\r\n                    Lakers: Davis missed his second game of the season, sitting out with a right adductor strain. The superstar big man couldn't get loose during pregame workouts. ... Wesley Matthews had 14 points on four 3-pointers in his first start for the Lakers. ... Caldwell-Pope missed his fourth straight game with a sprained left ankle.\n\n\r\n                    PRACTICALLY PERFECT\n\n\r\n                    The teams combined to make their first 30 free throws before James missed with 5:19 to play. Only four games in NBA history have been completed without a missed free throw.\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: At Clippers on Sunday.\n\n\r\n                    Lakers: At Rockets on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997334.227612
}