{
  "game_id": "0021400905",
  "espn_id": "400579197",
  "date": "Mar 04, 2015",
  "matchup": "LAL @ MIA",
  "headline": "Wade, Whiteside lead way late, Heat beat Lakers 100-94",
  "body": "MIAMI -- When Dwyane Wade started his drive, Hassan Whiteside and Erik Spoelstra thought he was shooting.\nThey were wrong -- and thrilled.\nWade's lob set up Whiteside for a spectacular one-handed dunk in the final minute, and the Miami Heat rallied to beat the Los Angeles Lakers 100-94 on Wednesday night -- giving them, almost unbelievably, their first two-game home winning streak in more than four months.\nWade finished with 25 points and six assists, Whiteside had 18 points and 25 rebounds -- second-most by any Heat player ever -- and Miami held on to the No. 7 spot as the race for Eastern Conference playoff spots remained jampacked.\n\"Always be aware, Hassan,\" Wade said. \"You never know when I'm going to pass it. I thought we kind of did a good job with me attacking, so they were kind of used to that. And then, when they least expected it, it kind of came at the perfect time.\"\nGoran Dragic scored 21 points for Miami, which got 15 from Luol Deng. Dragic's 3-pointer with 3:30 left put Miami ahead to stay, and he became the first player since 1993-94 to play against the Lakers five times in a regular season and win them all.\n\"I'm not scared to take those shots,\" said Dragic, 4-0 against the Lakers when he was with Phoenix before getting traded to Miami.\nEd Davis had 14 points and 12 rebounds, Wayne Ellington scored 14 points and Jordan Hill had a 13-point, 10-rebound night for the Lakers. Carlos Boozer scored 13 points, Wesley Johnson and Jeremy Lin each had 12 and Jordan Clarkson finished with 10 for Los Angeles.\n\"We just had a couple of defensive lapses,\" Lakers coach Byron Scott said. \"When Whiteside got the dunk, weak side wasn't there. ... You've got to do it in the heat of the battle. We just didn't do it in the last couple of minutes.\"\nThe Lakers got to 91-90 late, before Wade took over. He rebounded his own miss, got fouled and made two free throws for a three-point lead. He then set up Whiteside for the monster dunk off the lob, and found Whiteside again for a layup with 21.3 seconds left.\n\"It was good to see us show some grit,\" Heat coach Erik Spoelstra said.\nThe Lakers shot 58 percent in the first half and led 51-46 at the break. Miami took control in the third, Wade scoring 10 points in what was a 22-5 Heat spurt, plus a full-court assist to Dragic for a layup.\nMiami took a 70-60 lead, then gave it all back.\nThe Lakers clawed to 76-73 to end the third. Ryan Kelly made a 3-pointer while getting fouled by Michael Beasley, and Whiteside -- who had been hit in the face at the other end -- got a technical foul in the same sequence.\nThe Lakers led 84-80 when Wade and Whiteside returned with 7:29 left, and Miami outscored them 20-10 from there.\n\"Whiteside got that dunk ... that's all it takes in a game like this,\" Lin said.\nTIP-INS\nLakers: G Nick Young (sore left knee) sat out his fifth straight game, which means he won't be playing at AmericanAirlines Arena this season -- but his girlfriend, singer Iggy Azalea, will perform there May 16. ... Kobe Bryant has missed three of the last four Lakers-Heat games.\nHeat: Miami started 2-0 at home, then lost 17 of 25 there before this two-game streak. ... Gladys Knight and Lynda Carter were among those in attendance, along with golfer Matt Kuchar -- who front-rimmed a try from midcourt. ... The Heat sent Zoran Dragic to their NBA Development League affiliate in Sioux Falls.\nSTRESS RELIEVER\nSome Heat players, coaches and executives attended Shane Battier's karaoke event for charity -- Battioke -- on Tuesday night, and Spoelstra was among the performers. \"Making fools of ourselves\" helps with team bonding, Spoelstra said. Proceeds went to the Battier Take Charge Foundation for at-risk children.\nCLIMATE CHANGE\nThe Lakers are going from sandal weather to snowy weather. It was sunny and 81 degrees in Miami on Wednesday -- only 72 degrees warmer than the forecast low for Memphis, the Lakers' next destination, on Thursday night.\nUP NEXT\nLakers: At Memphis on Friday night.\nHeat: At Washington on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764991981.7095392
}