{
  "game_id": "0021500423",
  "espn_id": "400828310",
  "date": "Dec 23, 2015",
  "matchup": "CHA vs. BOS",
  "headline": "Olynyk scores 20 as Celtics hold off Hornets, win 102-89",
  "body": "CHARLOTTE, N.C. -- Boston Celtics coach Brad Stevens has been preaching balance to his players this season.\nThe lessons are finally sinking in, as Kelly Olynyk scored 20 points and the Celtics held off a fourth-quarter rally for a 102-89 victory over the Charlotte Hornets on Wednesday night.\nLed by Olynyk, five players finished in double figures for Boston, which scored the game's first six points and never trailed after that in winning its fourth straight over the Hornets.\n\"We're tough to guard,\" Olynyk said. \"You can't key in on one person. That's how we have to play to win.\"\nJae Crowder added 19 points and 12 rebounds, Isaiah Thomas and Avery Bradley had 18 points each, and David Lee 10 for the Celtics, who have now won two straight after losing four of their past five games.\n\n\"Obviously, when we've played like that, we've usually won,\" Stevens said. \"I thought our starters really played well. I thought a lot of our guys on the bench did a really good job.\n\"I thought it was a pretty good performance overall. We responded to their runs, went on runs of our own, and I thought we played pretty well tonight.\"\nFrank Kaminsky scored a season-high 23 points, Nicholas Batum added 17, Jeremy Lamb and Jeremy Lin had 12 each and Kemba Walker 10 for Charlotte, which trailed by 20 points in the second half before rallying.\nBoston had pulled ahead 72-52 on Jared Sullinger's layup with 3:28 remaining in the third quarter, but the Hornets cut the Celtics' lead to 74-62 at the end of the period.\nCharlotte then pulled within six points, 92-86, on Batum's 3-pointer with 3:17 left in the fourth quarter. But Boston outscored the Hornets 10-3 over the final three minutes.\n\"We for sure tried to bounce back from those losses,\" Crowder said. \"I think we did a great job with these two wins in a row. We have to keep it going. I know Brad (Stevens) is happy with the effort and the energy of the players. It's resulted in wins.\"\nBehind Thomas and Crowder, who had 11 points each in the first half, the Celtics led by as many as 12 points in the second quarter en route to a 47-40 lead at the halftime break.\nThe Hornets never led at any point, but came close late in the first quarter, pulling within 16-14 on Marvin Williams' 3-pointer with 4:44 remaining. But Boston outscored Charlotte 13-7 over the final 4:40 for a 29-21 lead.\nThe Celtics would increase their lead to 12 points three times in the second quarter, the last at 40-28 on Crowder's jumper with 7:24 left.\n\"The reoccurring theme for us when we haven't played well in this stretch has been first-quarter turnovers, which have led to getting off to really poor starts,\" Charlotte coach Steve Clifford said. \"It was the same thing tonight.\n\"When we got our defense set, we were pretty good. But we were playing in a hole because, again, it's turnovers. You can't get past turning the ball over. It leads directly to baskets.\"\nTIP-INS\nCeltics: Sullinger was back in the lineup after missing Monday's win over the Minnesota Timberwolves with back spasms. He finished with eight points and 10 rebounds. . Boston shot 42.4 percent from the field (36 of 85) and made 23 of 26 from the free throw line, but only hit 7 of 29 3-pointers.\nHornets: Had seven turnovers in the first quarter, the most they've given up all season, and finished the game with 17 turnovers, leading to 18 Celtics points. ... Charlotte shot 35.8 percent (29 of 81) from the field, and 8 of 28 on 3-pointers.\nLAST GAME OUT\nHornets center Al Jefferson served the last game of a five-game suspension for violating the NBA's drug policy on Wednesday. His first game back in the lineup will be Saturday, when Charlotte hosts the Memphis Grizzlies.\nUP NEXT\nCeltics: Visit Detroit on Saturday night.\nHornets: Host Memphis on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994390.852772
}