{
  "game_id": "0021900221",
  "espn_id": "401160863",
  "date": "Nov 22, 2019",
  "matchup": "CLE @ DAL",
  "headline": "Doncic rolls with Nowitzki watching, Mavs rout Cavs 143-101",
  "body": "DALLAS --  Luka Doncic finally had a chance to give former teammate Dirk Nowitzki a live look at how the Dallas Mavericks are coming along without the best player in franchise history.\n\nNot too bad so far.\n\nDoncic had 30 points and 14 assists with Nowitzki watching courtside next to owner Mark Cuban, and the Mavericks won by more than 40 points for the second straight game, routing the Cleveland Cavaliers 143-101 on Friday night.\n\nNowitzki stayed away for the first eight Dallas home games after setting an NBA record of 21 seasons with the same franchise while finishing last season as the highest-scoring foreign-born player in league history.\n\nThe big German got a standing ovation when shown on the video board in what was also his first peek in person at Dallas' new European pairing of Doncic and Kristaps Porzingis, the 7-foot-3 Latvian who missed his five shots but made his last six, finishing with 17 points.\n\n\"I'm here to make this franchise, make this team a better team,\" said Porzingis, who also had four blocks in his 200th career game. \"I'm trying to do my part. I'm sure Luka's trying to do his part. He's doing it well.\n\n\"As I said before, those are some huge shoes that we have to fill with Dirk ending his career and how high he set the standard for this organization.\"\n\nRookie Darius Garland scored a career-high 23 points for the Cavaliers, who lost their sixth straight game while getting swept in a second consecutive season series against Dallas. Cleveland lost at home by 20 early this month.\n\n\"They can really shoot,\" coach John Beilein said. \"The couple of shots that Porzingis made and Luka made, you can't defend them. They're stepping back, they've got great size and they're shooting it in from 30 feet. Really a talented team.\"\n\nDallas (10-5) moved five games above .500 for the first time since late in the 2015-16 season, which ended up being Nowitzki's final trip to the playoffs after leading the franchise to its only championship in 2011.\n\nNowitzki gave a hint that he might be on the way by tweeting about the traffic near his old home arena on the street that was renamed in his honor before the season started.\n\n\"Awesome,\" coach Rick Carlisle about seeing Nowitzki in the arena, while quickly noting that Shawn Marion, also retired, and guard J.J. Barea were nearby. All three played important roles in the championship.\n\nDoncic is the first Dallas player to score at least 30 points in three straight games since Nowitzki in 2010, but is still waiting to record three straight triple-doubles for the first time.\n\nFor the third time in the rookie of the year's two seasons, the 20-year-old Slovenian fell short, finishing with seven rebounds while sitting all of the fourth quarter for the second straight game.\n\nPorzingis also was on the bench the whole fourth two nights after Dallas led Golden State by 50 in the second half of a 142-94 win. The final margin of 42 was also the Mavericks' biggest lead against the Cavaliers in their first sweep of a four-game homestand since the title year.\n\n\"A lot of guys did a lot of good things,\" Carlisle said. \"It's a successful homestand, and we've done some good things. But the schedule's going to get a lot more difficult now.\"\n\nTIP-INS\n\nCavaliers: Garland's previous high was 15 against Washington on Nov. 8. He was 5 of 7 from long range. ... Tristan Thompson had 10 points, eight rebounds and four assists after missing a game for rest. ... Cedi Osman was 4 of 6 from 3 and scored 18 points.\n\nMavericks: G Seth Curry missed a second straight game with an illness. ... Doncic was 4 of 8 from 3-point range as the Mavericks shot 20 of 37. Doncic was 11 of 18 overall in Dallas' second straight game of shooting at least 57% from the field.\n\nMICHIGAN MEN\n\nTim Hardaway Jr. gave Beilein another a reminder of his Michigan days.\n\nHardaway hit four of five 3-pointers and scored 16 points two days after another of Beilein's former Wolverines, Duncan Robinson, scored a career-high 29 points in Miami's 124-100 victory.\n\nHardaway briefly went into the concussion protocol but was cleared after bumping heads with Porzingis in the second half\n\nWHO NEEDS DONCIC?\n\nThe Mavericks took control with a 16-0 run while Doncic was on the bench in the first half, turning a 26-24 deficit into a 40-26 lead. Justin Jackson, who scored a season-high 19, hit two 3-pointers early in the run.\n\nUP NEXT\n\nCavaliers: Portland at home Saturday to finish second back-to-back in a week.\n\nMavericks: At Houston on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996330.1306822
}