{
  "game_id": "0022400884",
  "espn_id": "401705450",
  "date": "Mar 04, 2025",
  "matchup": "MIL @ ATL",
  "headline": "Giannis Antetokounmpo posts triple-double as surging Bucks finish strong to beat Hawks 127-121",
  "body": "ATLANTA -- — Giannis Antetokounmpo had 26 points, 12 rebounds and 10 assists for his seventh triple-double of the season, and the surging Milwaukee Bucks beat the Atlanta Hawks 127-121 on Tuesday night.\n\n\r\n              Damian Lillard scored 23 points for the Bucks, who have won three straight and seven of eight. Milwaukee remained in fourth place in the Eastern Conference, with the same record as fifth-place Indiana (35-25).\n\n\r\n              Trae Young led Atlanta with 28 points and 13 assists. Caris LeVert — who made the game-winning layup at the buzzer in Atlanta's 132-130 victory at Memphis on Monday night — scored 21 points.\n\n\r\n              Neither team led by more than eight points. Following the final tie at 121, the Bucks scored the final six.\n\n\r\n              Takeaways\r\n              Bucks: Brook Lopez scored 13 points and had a season-high 13 rebounds. ... F Kyle Kuzma (right ankle) started and had 17 points and 10 rebounds after initially being listed as doubtful.\n\n\r\n              Hawks: Atlanta signed F Dominick Barlow to a multi-year contract. Barlow signed a two-way deal on July 30, 2024. The team terminated the 10-day contract G Kevon Harris signed on Saturday and signed F Jacob Toppin to a two-way contract.. ... F Zaccharie Risacher, named the Eastern Conference Rookie of the Month on Tuesday, was held to seven points.\n\n\r\n              Key moment\r\n              LeVert's 3-pointer tied the game at 121-all before a jam by Lopez gave Milwaukee the lead. Following a missed jumper by Young, Lillard's layup gave the Bucks a 125-121 advantage.\n\n\r\n              Key stat\r\n              Milwaukee's Kevin Porter Jr. scored 12 of his 15 points in the fourth quarter.\n\n\r\n              Up next\r\n              Milwaukee hosts Dallas on Wednesday to begin a string of six of seven games at home. Atlanta plays Indiana at home on Thursday night before again facing the Pacers at home on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997828.119898
}