{
  "game_id": "0022301150",
  "espn_id": "401585778",
  "date": "Apr 09, 2024",
  "matchup": "HOU vs. ORL",
  "headline": "VanVleet has season-high 37 as Rockets get 118-106 win over Magic, who fall into tie for fourth",
  "body": "HOUSTON -- — Fred VanVleet scored a season-high 37 points and the Houston Rockets snapped a five-game skid with a 118-106 victory over the Orlando Magic on Tuesday night.\n\n\r\n              The Magic fell into a tie for fourth place with Cleveland in the Eastern Conference. They came into the night with a chance to clinch the Southeast Division title with a win and a loss by the Miami Heat, but they couldn’t get it done against Houston and the Heat beat the Hawks 117-111 in double overtime.\n\n\r\n              “We can't hang our heads,” Magic coach Jamahl Mosley said. “We've got to come out and go after Milwaukee tomorrow. That's what it's got to be. Take the lessons from this one. Bounce back tomorrow.”\n\n\r\n              A basket by Markelle Fultz got the Magic within eight with about four minutes to go but VanVleet made a jump shot followed by a three-point play to make it 114-101 about a minute later to secure the victory.\n\n\r\n              Paolo Banchero and Jalen Suggs scored 21 points apiece for the Magic and Fultz added 18. \n\n\r\n              VanVleet made six 3-pointers and had eight rebounds and six assists. Jabari Smith Jr. added 23 points and Dillon Brooks had 15 as the Rockets played their last home game of the season.\n\n\r\n              “We wanted to continue to build and we know we're out of the race but we have four to go,” coach Ime Udoka said. “We don't want to just lay down and chalk it up... we fought hard and played well.”\n\n\r\n              The Magic scored the first nine points of the fourth quarter, with the last five from Joe Ingles, to cut the lead to 97-91 with about nine minutes to go.\n\n\r\n              Houston got its first points of the quarter on a 3-pointer by VanVleet, but Fultz made a layup seconds later.\n\n\r\n              The Rockets hadn't forgotten about the 116-86 loss they suffered to Orlando in their season opener. \n\n\r\n              “They kicked our butts the first game of the season,” VanVleet said. “We definitely remember that. So it was good to get some get back there.”\n\n\r\n              The Rockets led by 12 at halftime and opened the second half with an 11-4 run to make it 74-55 with nine minutes left in the third. Jalen Green had the first five points in that stretch and VanVleet added a 3-pointer.\n\n\r\n              Houston was up by 18 after another 3 from VanVleet later in the third quarter before the Magic went on a 10-4 run, with five points from Suggs, to get withing 90-78 with 3 ½ minutes left in the quarter.\n\n\r\n              Soon after that Ingles and Houston’s Cam Whitmore were both given technical fouls after bumping into one another and jawing at each other. Whitmore was ejected 14 seconds after that for arguing with an official after being called for a loose ball foul.\n\n\r\n              Ingles made two free throws but the Rockets outscored Orlando 5-2 to close out the quarter and take a 97-82 lead into the fourth quarter.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Visit Milwaukee Wednesday night.\n\n\r\n              Rockets: Visit Utah Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995561.0344288
}