{
  "game_id": "0021601142",
  "espn_id": "400899406",
  "date": "Apr 02, 2017",
  "matchup": "OKC vs. CHA",
  "headline": "Walker scores 29; Hornets overcome Westbrook's triple-double",
  "body": "OKLAHOMA CITY --  Desperately needing a victory to stay in the Eastern Conference playoff race, the Charlotte Hornets picked up one in a place they'd never won before.\n\nKemba Walker scored 29 points to help Charlotte overcome Russell Westbrook's sixth straight triple-double to beat the Oklahoma City Thunder 113-101 on Sunday. It was the Hornets' first win in Oklahoma City, a place where they'd been 0-8.\n\nWestbrook finished with 40 points, 13 rebounds and 10 assists. It was Westbrook's 40th triple-double of the season, putting him one behind Oscar Robertson's NBA record of 41, set during the 1961-62 season. It was Westbrook's first career triple-double against Charlotte.\n\nFrank Kaminsky had 18 points and Michael Kidd-Gilchrist added 16 for Charlotte, which entered the day in 10th place in the East, two games behind Chicago, Indiana and Miami, who were tied for seventh. Charlotte has six games remaining.\n\n\"The readiness, one through 10 -- every guy that played contributed,\" Charlotte coach Steve Clifford said.\n\n\"The starters got off to a great start, which is important against a good team on the road and then the guys off the bench got the cushion there in the fourth quarter, Jeremy Lamb especially, so we got contributions from everybody.\"\n\nWalker went 6 of 12 from 3-point range. It was the 14th time this season Walker hit five or more 3-pointers in a game.\n\nCharlotte had 18 steals against Oklahoma City, the most in a regular-season game for the Hornets since Nov. 23, 2012, against Atlanta. The Hornets scored 35 points off 24 Oklahoma City turnovers.\n\nThe Hornets \"want to play in the playoffs,\" Oklahoma City coach Billy Donovan said.\n\n\"They're laying it on the line their last five or six games. I like playing against desperate teams, because what it does is it exposes what you have to do to really compete at that extraordinary high level.\n\n\"Give Charlotte a lot of credit. They played an exceptional game. They played really, really well all the way around. They had a lot to do with how we played.\"\n\nCharlotte seized control with a 13-0 run to open the second half, as the Thunder missed their first seven shots after halftime, allowing the Hornets to build a 72-54 lead.\n\nWestbrook ended Oklahoma City's scoring drought at the 6:24 mark and the Thunder closed within 12 points twice early in the fourth quarter, but Lamb, a former Thunder guard, scored nine points in a 13-4 run by Charlotte that made it 101-80 with 7:21 left.\n\n\"Coach ran a couple of plays for me and (Brian Roberts) just hit me and I was able to knock some shots down,\" Lamb said. \"That was a big point in the game and I was just happy to be able to knock something down and help the team.\"\n\nAn 8-0 spurt by Oklahoma City, capped by a layup by Andre Roberson, got the Thunder within 102-91 with 4:37 left but a three-point play by Cody Zeller keyed Charlotte.\n\nOklahoma City shot out to a 13-6 lead, but the Hornets used a 28-9 run to go up 34-22 early in the second quarter. The Thunder pulled within 39-38, but Charlotte answered with a 16-4 run to build a 55-42 lead before Westbrook almost single-handedly cut the gap to 59-54 by halftime.\n\nTIP-INS:\n\nHornets: Walker had four steals, moving him past 600 for his career. He's the fourth Hornets player to reach that number, joining Muggsy Bogues, Gerald Wallace and Dell Curry. ... Walker's 229 3-pointers this season are the second-most in a single season in Charlotte franchise history. Jason Richardson had 243 in 2007-08. ... Charlotte, which entered the game averaging the fewest turnovers in the NBA (11.5 per game), had 18 on Sunday. ... Lamb scored 13 points against his former team.\n\nThunder: Taj Gibson returned to the starting lineup after missing Friday's game against San Antonio due to illness, but scored only four points in 13 minutes. ... Westbrook has 77 career triple-doubles -- fifth on the NBA's all-time list, one behind Wilt Chamberlain. ... To clinch a season triple-double, Westbrook needs 11 rebounds and 29 assists over the Thunder's final six games. ... Chicago is the only team against which Westbrook hasn't recorded a triple-double during his career.\n\n15K FOR WESTBROOK\n\nWestbrook passed the 15,000-point career scoring mark during the game, but shook his head when asked about that milestone afterward.\n\n\"It's definitely something that I don't take for granted, to be able to play this game long enough to do that is a blessing in itself,\" he said.\n\nAsked about being one triple-double away from tying Robertson, Westbrook was even more succinct: \"We've got to win. That's my thoughts.\"\n\nQUOTABLE:\n\nClifford, on defending Westbrook: \"This was one of the best defensive games we've played in a while. I know he had 40 and we didn't make a lot of mistakes on him. He's just so good. ... We didn't have a lot of dumb fouls. He's such a great shot maker. He had 40, but I felt our defense on him was good.\"\n\nUP NEXT:\n\nHornets: Will finish a two-game road trip at Washington on Tuesday before a potentially key home game on Wednesday against Miami.\n\nThunder: Will host Milwaukee on Tuesday to wrap up a three-game homestand.",
  "source": "espn_api",
  "crawled_at": 1764995245.4326231
}