{
  "game_id": "0021900442",
  "espn_id": "401161084",
  "date": "Dec 22, 2019",
  "matchup": "OKC vs. LAC",
  "headline": "Gilgeous-Alexander helps Thunder beat Clippers 118-112",
  "body": "OKLAHOMA CITY --  Paul George's return to Oklahoma City was spoiled by a player the Thunder got back when they traded him.\n\nShai Gilgeous-Alexander matched his career high with 32 points and the Oklahoma City Thunder rallied to beat the Los Angeles Clippers 118-112 on Sunday night.\n\nGeorge, who finished third in the MVP voting last season, was sent to the Clippers for Gilgeous-Alexander and Danilo Gallinari in a deal that began the restructuring of the Thunder roster. George was cheered when he was introduced during the starting lineups.\n\n\"It was great,\" he said. \"It made me feel appreciated, just being here. I enjoyed my time here.\"\n\nGeorge scored 18 points, but he made just 6 of 17 shots and had five turnovers. Gilgeous-Alexander made 12 of 25 field goals.\n\nOklahoma City trailed by 18 points in the second quarter, making it the third time in seven days the Thunder overcame a deficit that big to win. This time, the victory came against the No. 2 team in the Western Conference standings.\n\n\"That's a really good team over there,\" Thunder guard Chris Paul said. \"Obviously, they've been in all type of different situations. It's good. It's really good, especially they way we were down in the first half.\"\n\nLos Angeles scoring leader Kawhi Leonard sat out because of left knee soreness.\n\nDennis Schroder scored 16 of his 28 points in the fourth quarter and Steven Adams added 20 points and 17 rebounds to help the Thunder win their fourth straight. Oklahoma City has won nine of 12 to move above .500 for the first time this season.\n\n\"You just go on chemistry, being more comfortable with the offense, defense, you could do all that sort of stuff,\" Adams said. \"Figuring out playing habits -- you could go on, mate.\"\n\nLou Williams scored 22 points for Los Angeles, and Montrezl Harrell had 18.\n\nThe Clippers led 63-57 at the half, with Gilgeous-Alexander scoring 19 points for the Thunder.\n\nGilgeous-Alexander's layup tied it at 66 in the third quarter. After the Clippers seemed to regain control, the Thunder remained competitive. Paul's 3-pointer at the third-quarter buzzer cut it to 89-86.\n\nWith 5:35 to play, Harrell appeared to score and draw a foul from Nerlens Noel. The basket would have given the Clippers a 100-94 lead with a free throw coming. The Thunder challenged the call and it was changed to a charge on Harrell.\n\nThe Clippers weren't sure if the challenge worked as it was supposed to. Some time passed as Harrell waited to shoot the free throw.\n\n\"I just thought the delay was strange,\" Clippers coach Doc Rivers said. \"We kept asking, 'What was the delay for? What was the delay for?' The ref kept holding the ball.\"\n\nThe Thunder took advantage. Schroder's 3-pointer put the Thunder ahead, then Adams had a steal and a layup to make it 110-106 with 1:19 to play. After the Thunder got a stop, Schroder's layup put the Thunder up by six.\n\n\"I think as mad as we are that we're letting games get away early, we're starting to figure out how to win them now,\" Paul said. \"We've got to keep it going. Even if we're not making shots, knowing we can get stops. Really good teams in this league -- that's when they buckle down -- the fourth quarter.\"\n\nTIP-INS\n\nClippers: Patrick Patterson, who played for the Thunder last season, started and also was cheered during pregame introductions. ... G Patrick Beverley sat out with a sore right groin. Williams got his fourth start of the season in Beverley's place.\n\nThunder: Gallinari did not play due to left ankle soreness. He ranks second on the team with 18.0 points per game. ... Rookie Darius Bazley got his second career start in Gallinari's place. He finished with seven points.\n\nANOTHER ONE\n\nGilgeous-Alexander scored 32 points for the second straight game. In the two games combined, he has made 25 of 43 shots from the field, including 4 of 5 3-pointers and 10 of 11 free throws.\n\nHE SAID IT\n\nRivers on Leonard and Beverley not playing: \"It was funny -- I didn't think Pat one time or Kawhi one time. I thought we should have won the game with what we had on the floor.\"\n\nUP NEXT\n\nClippers: Play the Los Angeles Lakers on Wednesday night.\n\nThunder: Host Memphis on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996233.708629
}