{
  "game_id": "0022000463",
  "espn_id": "401267623",
  "date": "Feb 20, 2021",
  "matchup": "MIA @ LAL",
  "headline": "Heat hold off depleted Lakers 96-94 in NBA Finals rematch",
  "body": "LOS ANGELES -- — Although the Miami Heat's road trip started slowly, Kendrick Nunn thinks they are picking up steam because of a team chemistry that is growing at every stop.\n\n\r\n                    The Heat even kept it together to pull out a win over the defending NBA champions despite a fourth quarter that nearly went wrong.\n\n\r\n                    Nunn scored 27 points, Jimmy Butler had 24 points and eight rebounds, and Miami held off the Los Angeles Lakers 96-94 Saturday night in an NBA Finals rematch.\n\n\r\n                    Bam Adebayo had 16 points and 10 rebounds for the Heat in the teams’ first meeting since the Lakers won their 17th championship with a six-game victory over Miami in the Florida bubble four months ago. The Heat scored only 15 points in the fourth quarter, but they held the Lakers to 17 and hung on when Alex Caruso missed a long jumper at the buzzer.\n\n\r\n                    “You can tell that the chemistry is building,” said Nunn, who hit five 3-pointers. “We’ve been together for a week and a half, and it just gives us more of a feel for each other. We’re moving in the right direction now. We dropped a couple early, but we’re starting to give ourselves the best chance at the end of the game.”\n\n\r\n                    The victory was Miami's second straight following a three-game skid during this seven-game road trip. The defending Eastern Conference champions (13-17) have been under .500 since Jan. 12, but their confidence is growing.\n\n\r\n                    “We’re seeing progress the last few weeks,” coach Erik Spoelstra said. “I think our defensive mental toughness was better in this game to get some stops when we weren’t able to knock down some shots in the fourth quarter.”\n\n\r\n                    LeBron James had 19 points, nine assists and nine rebounds as the champs lost their second straight game without starters Anthony Davis and Dennis Schröder.\n\n\r\n                    James stole the Heat's inbounds pass with 8.4 seconds left to create one last chance for the Lakers, but the 17-time All-Star passed out of a double team to Caruso, who capped his scoreless 20-minute night by missing.\n\n\r\n                    “We're figuring out how to play without one of our creators in Dennis and one of our stars in AD,” Caruso said. “That's going to take a little time, and obviously we don't have practice time.”\n\n\r\n                    Davis missed his third straight game after aggravating his strained right calf last weekend, and Schröder missed his second straight under the NBA’s health and safety protocols.\n\n\r\n                    Kyle Kuzma scored 23 points while hitting four 3-pointers, and Montrezl Harrell had 18 points and 10 rebounds for the Lakers.\n\n\r\n                    The injury absences don't account for the Lakers' shooting woes over the last 10 games, including a 39% performance against Miami. LA missed five of its last six shots, including Wesley Matthews' rushed, off-balance 3-pointer with 15 seconds left.\n\n\r\n                    “We're going to continue to work on our habits and be great for each other,” James said. “We all put in the work, so it’s not that. The law of averages will even itself out. We had lapses last season, and we had them during the playoffs. We know they’ll even them out over the course of the year.”\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Avery Bradley, a starter for the Lakers last season who missed their playoff run after opting out of the NBA restart, missed this game for Miami with a calf strain. ... Goran Dragić missed his eighth straight game with a sprained left ankle.\n\n\r\n                    Lakers: Schröder will miss at least two more games in quarantine, coach Frank Vogel said. The Lakers hope he'll return Friday against Portland.\n\n\r\n                    HERRO HURT\n\n\r\n                    Tyler Herro left after playing less than 14 minutes due to a hip pointer. He will be re-evaluated Sunday, Spoelstra said.\n\n\r\n                    “We’re used to it,” Spoelstra said of the Heat's latest injury. “Every game there’s going to be something. This is developing a level of toughness in our group.\"\n\n\r\n                    Max Strus missed eight 3-pointers in Herro’s place.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: At Thunder on Monday.\n\n\r\n                    Lakers: Host Wizards on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996795.29635
}