{
  "game_id": "0021400532",
  "espn_id": "400578824",
  "date": "Jan 07, 2015",
  "matchup": "OKC @ SAC",
  "headline": "Kings snap 12-game skid vs. Thunder with 104-83 victory",
  "body": "SACRAMENTO, Calif. --  The challenge of matching up with Oklahoma City's high-powered offense led by Kevin Durant and Russell Westbrook brought out the best of the struggling Sacramento Kings.\n\nRudy Gay scored 28 points and Darren Collison added 24 to help the Kings snap a 12-game losing streak to Oklahoma City with a 104-83 victory over the Thunder on Wednesday night.\n\nThe Kings allowed season lows in points and shooting percentage (32.6 percent) in their fourth win in 11 games under new coach Tyrone Corbin.\n\n\"I thought tonight was the first night in a long time where we really committed on the defensive end,\" Collison said. \"I don't know if it was the stage of the game playing a team like OKC, but I thought our urgency was really high tonight.\"\n\nDeMarcus Cousins had 23 points and 15 rebounds, and the Kings rolled to their first win against Oklahoma City since Feb. 12, 2012.\n\nDurant scored 24 points for the Thunder, who shot just 32.6 percent and lost both games of a brief Northern California road trip.\n\nThis marked the first time all season that Oklahoma City lost back-to-back games with Durant and Westbrook in the lineup. The Thunder had won nine of 11 with their two stars healthy before the losses to Golden State and Sacramento.\n\n\"We just have to move on,\" Durant said. \"We don't come in here to pop champagne bottles when we win. So we can't panic because we lost.\"\n\nWestbrook was completely outplayed by his former UCLA teammate Collison. Westbrook shot just 3 for 19 and had seven turnovers, while Collison made a career high five 3-pointers.\n\nThe Kings broke out to a big lead and coasted to the victory in the opener of a six-game homestand. Back-to-back 3-pointers by Collison early in the third quarter put Sacramento up by 17 and Ben McLemore's putback in the closing seconds made it 78-57 heading to the fourth.\n\n\"This feels like a good win,\" Cousins said. \"We've had other wins but with those wins, you could feel like it wasn't a good win or a good way to win.\"\n\nTwo nights after shooting 31 percent in a loss at Golden State, the Thunder were still searching for their shooting stroke. Oklahoma City missed 14 straight shots in the first quarter to fall behind 25-7 on a jumper by Cousins.\n\nWestbrook missed six of seven shots, scoring on an emphatic dunk, and Durant missed four of five as the Thunder started the game 2 for 21.\n\n\"We found the good shots but couldn't hit them tonight,\" Durant said. \"When you get down 25-7 that's when you start to rush and turn the ball over. So we have to go back to the drawing board and get our next one.\"\n\nA 3-pointer by Perry Jones with just under a minute left ended the drought. Serge Ibaka added a fast-break bucket and a 3-pointer to fuel a 9-0 run, but the Thunder still trailed 28-16 after one when Collison hit a 3-pointer at the buzzer.\n\nThe Kings maintained a comfortable lead throughout the second quarter. Durant's late 3-pointer made it 53-43 at the half.\n\nTIP-INS\n\nThunder: Oklahoma City scored seven points in the first 11 minutes of the game and then nine in the final minute of the first quarter. ... Dion Waiters, acquired on Monday from Cleveland, made his Oklahoma City debut. He finished with four points on 1-for-9 shooting.\n\nKings: Cousins got his fourth technical of the season late in the first quarter arguing a no-call. He had 16 last season. ... Cousins took 13 foul shots in the first half as Oklahoma City big men Ibaka, Steven Adams, Kendrick Perkins and Nick Collison all had three fouls.\n\nWRETCHED ROAD TRIP\n\nThe Thunder had their worst two shooting nights of the season on this road trip, shooting just 32 percent for the two games. Westbrook struggled particularly, making just 8 of 40 shots.\n\nUP NEXT\n\nThunder: Host Utah on Friday.\n\nKings: Host Denver on Friday.",
  "source": "espn_api",
  "crawled_at": 1764991905.166768
}