{
  "game_id": "0022000701",
  "espn_id": "401307490",
  "date": "Mar 27, 2021",
  "matchup": "LAC vs. PHI",
  "headline": "Leonard leads Clippers past 76ers in Rivers' first game back",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 28 points, Terance Mann added a season-high 23 and the Los Angeles Clippers defeated the Philadelphia 76ers 122-112 on Saturday night in their first game against former coach Doc Rivers.\n\n\r\n                    The Clippers won their fifth straight by playing the same type of basketball they did during seven seasons under Rivers — getting points in transition and strong games from Leonard and Paul George, who had 24 points.\n\n\r\n                    “We fell behind early, but kept our composure. We figured it out and kept playing. Our mindset was right,” Los Angeles coach Tyronn Lue said. “Offensively we did a lot of great things. We attacked the paint and made the extra pass.”\n\n\r\n                    Leonard missed Thursday's game at San Antonio due to a sore right foot, but didn't show any ill effects. The star forward had 19 points in the first half, including 12 in the second quarter.\n\n\r\n                    Rivers, who was given a 90-second video tribute by the Clippers during the first timeout in the first quarter, said he wasn't surprised how his former team took control and started to pull away in the second half.\n\n\r\n                    “They kept on the attack and moved the ball,” said Rivers, who took the Philadelphia job less than a week after being fired by the Clippers. “You can see they all trust each other with the ball. Kawhi and Paul played well. If they continue to do all that, they are going to be hard to stop.”\n\n\r\n                    Tobias Harris scored 29 points for the Sixers, who had their six-game road winning streak snapped. Danny Green added 17 and Shake Milton 16. \n\n\r\n                    Los Angeles led by five at halftime, but took command with seven straight points to open the third quarter. The Clippers were up 97-84 at the end of the period and led by 19 in the fourth.\n\n\r\n                    Philadelphia got off to a hot start and jumped out to a 21-11 lead with less than five minutes remaining in the first quarter before Los Angeles got on track. The Clippers went on an 18-9 run and trailed by one at the end of the period.\n\n\r\n                    There were seven ties and five lead changes in the second quarter before Los Angeles closed the period on an 8-3 spurt to take a 65-60 lead at halftime.\n\n\r\n                    MANN'S GAME\n\n\r\n                    Mann made his first eight shots from the field and was 10 of 12 for the game. He had 11 points during the second quarter, which tied a career high. He is averaging 15.4 points over the past five games.\n\n\r\n                    The third-year swingman has been taking advantage of the added minutes to show how much his game has improved. He is seeing additional playing time with Patrick Beverley injured, Lou Williams traded to Atlanta and Rajon Rondo still getting up to speed after being acquired on Thursday. \n\n\r\n                    “Everyone has been on the same page and asking me to be more aggressive,” Mann said. “Over time you begin to see things different, stuff slows down and you develop.”\n\n\r\n                    Lue said Mann's confidence is “through the roof,\" but didn't want to address if his minutes would decrease once Beverley gets healthy and Rondo is up to speed.\n\n\r\n                    “Right now I like where we are at and we are in a good rhythm. We will have to see and keep playing with the rotations when they get back,” Lue said.\n\n\r\n                    HOWARD TOSSED ... AGAIN\n\n\r\n                    Dwight Howard was ejected for the second straight game when he picked up two technical fouls with 10:35 remaining in the fourth quarter. The 76ers center was called for two separate technicals in the first quarter of Thursday's game against the Lakers.\n\n\r\n                    Howard finished with nine points and 11 rebounds. The only good that happened at Staples Center for him over the three days was he picked up his championship ring after playing for the Lakers last season.\n\n\r\n                    Official Tony Brothers said in a pool report that Howard received the second technical from Jason Goldenberg because Howard said something derogatory about Brothers, who called the first technical.\n\n\r\n                    Brothers said the first technical came when Howard kept yelling and pointing at an official on a possession after he was called for an offensive foul.\n\n\r\n                    The Sixers were assessed four technicals during the game, which perturbed Rivers more than Howard's ejection. \n\n\r\n                    “A lot of guys were frustrated,” Rivers said.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Ben Simmons had 15 points before fouling out in the fourth quarter. ... Green has scored in double figures in six straight games for the first time since December 2014 with San Antonio. \n\n\r\n                    Clippers: Marcus Morris Sr., who finished with 13 points, was charged with a flagrant foul in the third quarter after throwing down Howard while both players were vying in the paint. ... Leonard got his 1,000th steal in the first quarter. He is one of 21 active players to reach the milestone.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Play at Denver on Tuesday. The Nuggets won the first meeting 115-103 on Jan. 9.\n\n\r\n                    Clippers: Host Milwaukee on Monday. The Bucks have won four straight in the series, including a 105-100 victory on Feb. 28.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997678.762926
}