{"game_id": "170322025", "title": "Synthetic Recap", "body": "**Payton’s Historic Triple-Double Powers Sonics Past Kings**\n\nSEATTLE – On this night in 1997, the Seattle SuperSonics did not merely defeat the Sacramento Kings; they witnessed a piece of franchise history authored by their floor general, Gary Payton.\n\nIn a commanding 113-99 victory, Payton delivered a performance for the ages, recording a staggering triple-double with **40 points, 11 rebounds, and 12 assists**. The Glove was not just good; he was untouchable, orchestrating the entire contest from tip-off to final buzzer and etching his name into the Sonics' record books.\n\nFrom the opening quarter, it was clear Payton was in a different gear. He attacked the rim with ferocity, hit pull-up jumpers with cold efficiency, and, true to his nature, locked down the perimeter defensively. The Kings had no answer. Every time Sacramento threatened to close the gap, Payton had a response—a driving layup, a precision pass to a cutting teammate, or a clutch three-pointer that silenced any notion of a comeback.\n\nHis supporting cast fed off his energy. Detlef Schrempf provided a steady 19 points, while Vin Baker controlled the glass with 13 rebounds. But this was unequivocally Payton’s showcase. He wasn't just filling the stat sheet; he was dominating the very soul of the game, combining scoring explosions with playmaking brilliance in a seamless flow.\n\nFor the Kings, Mitch Richmond fought valiantly for his 26 points, but his effort was a solo act against a symphony conducted by Payton. The Sonics’ star outscored, outpassed, and outhustled the entire opposition.\n\nWhen the final horn sounded, the scoreboard told the story of a team victory, but the stat sheet immortalized an individual masterpiece. Gary Payton’s 40-point triple-double was more than a line of numbers; it was a legendary performance that defined a night of Sonics basketball, a virtuoso display of will and skill that Seattle will long remember.", "source": "AI_Reconstruction"}