{
  "game_id": "0021900371",
  "espn_id": "401161013",
  "date": "Dec 13, 2019",
  "matchup": "HOU @ ORL",
  "headline": "Sizzling James Harden hits 10 3s, scores 54 as Rockets rout Magic",
  "body": "ORLANDO, Fla. -- James Harden found his 3-point shooting touch -- again.\nHarden scored 54 points -- matching the team record of 10 3-pointers he set in Houston's previous game -- in the Rockets' 130-107 victory over the Orlando Magic on Friday night.\n\"I just want to win,\" Harden said simply. \"Whatever it takes.\"\nHarden scored 50 or more for the fifth time this season and the fourth time in his past seven games. The rest of the NBA has combined for only five such games this season.\nHarden was 10-of-15 from long range and 19-of-31 overall from the field. He also had seven assists, five rebounds and two steals in 36 minutes, receiving a loud ovation from the Orlando crowd when he headed to the bench in the final minutes.\n\"I feel like we lost against just him tonight,\" Magic guard Evan Fournier said. \"He's the MVP for a reason. We talked about in pregame that he'll take shots, and we'll just live with the results. He did not miss tonight, period.\"\nHarden set the Houston record for 3-pointers with 10 in 18 attempts Wednesday night in a 55-point game in a victory at Cleveland.\n\"When he's shooting over the top like that, I don't know what you can do,\" Orlando coach Steve Clifford said.\nRussell Westbrook added 23 points for Houston. The Rockets were 22-of-39 from 3-point range, setting a record for the most 3-pointers by any Magic opponent in franchise history.\n\"We just shot the ball extremely well,\" Rockets coach Mike D'Antoni said. \"When James is like that, it's hard for anybody to really beat us -- no matter what kind of defense you're going to throw, we've got guys.\"\nThe Rockets pulled away in the second quarter, with Harden scoring 18 points, including Houston's last 11 for a 59-49 lead.\nFournier led Orlando with 27 points. Aaron Gordon added 21. The Magic have lost three straight after winning four in a row.\nTIP-INS:\nRockets: Beat the Magic for the 12th time in the past 15 meetings. ... Hold four of the top five spots for most made 3-pointers by a team this season. ... D'Antoni said he assumes his team will play Saturday without Westbrook, who sat out the second game of both of Houston's previous back-to-backs this season.\nMagic: Orlando was without C Nikola Vucevic for the 11th consecutive game because of a right ankle injury. ... G Markelle Fultz returned after missing Wednesday's game against the Los Angeles Lakers with a stomach virus. ... The Magic held their annual charity golf tournament Thursday to benefit the Orlando Magic Youth Foundation. More than $200,000 was raised.\nUP NEXT:\nRockets: Host Detroit on Saturday night.\nMagic: At New Orleans on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764996644.7661881
}