{
  "game_id": "0021801187",
  "espn_id": "401071860",
  "date": "Apr 05, 2019",
  "matchup": "MEM @ DAL",
  "headline": "Wright trumps Dirk dunk to lift Grizzlies past Mavs 122-112",
  "body": "DALLAS --  Dirk Nowitzki set a screen for a pick-and-roll a few seconds into what could be the second-to-last home game for the longtime star of the Dallas Mavericks.\n\nOnce the pass arrived as the 40-year-old strolled down a wide-open lane, Nowitzki figured the moment for his first dunk in his record 21st season with the same franchise had arrived.\n\nAnd after that, the outcome of a meaningless late-season game mattered even less.\n\nDelon Wright set career highs with 26 points and 14 assists in his first triple-double after Nowitzki's two-handed slam opened the scoring, and the Memphis Grizzlies beat the Mavericks 122-112 on Friday night.\n\n\"I thought, `It's now or never,\" Nowitzki said of the moment after grabbing the pass from seldom-used guard Courtney Lee, starting against his former team because rookie sensation Luka Doncic was nursing a sore thigh.\n\n\"I put all the energy I could in my right leg and squeezed it over the rim. Definitely a highlight of my season.\"\n\nWhile almost exactly half of the smooth-shooting 7-footer's baskets this season are his signature 3-pointers, Nowitzki now can say he has at least one dunk in each season if he decides one more than Kobe Bryant's previous record of 20 seasons with the Lakers is enough.\n\nNowitzki hung on the rim for emphasis, staring at nobody in particular in the crowd.\n\n\"I was so happy with myself, I didn't know if I should stay up there and slap the glass,\" he said. \"Then I went back, so I didn't really see what the bench was doing.\"\n\nRest assured, teammates went bonkers. Among those celebrating in street clothes -- putting his hands to his head with his mouth open -- was young Euro star Kristaps Porzingis, who grew up watching Nowitzki and has said he'd love to play with the big German next season.\n\nThe Mavericks acquired Porzingis in a blockbuster deal with the Knicks, but chose not to play the 7-3 Latvian as he continues to recover from a torn knee ligament sustained with the Knicks last season.\n\nWhile Nowitzki is steadfastly mum on the issue of a 22nd season, saying he wants to see how he feels after the finale at San Antonio on Wednesday, owner Mark Cuban is making no secret about big plans for the final home game of the season Tuesday against Phoenix.\n\nRoad games have had the feel of a farewell tour, and Dallas County commissioners recently declared April the \"month of Dirk\" while commemorating the 14-time All-Star passing Wilt Chamberlain for sixth on the career scoring list.\n\nNowitzki left to a standing ovation in the fourth quarter, finishing with 12 points and seven defensive rebounds. He needs one defensive rebound to become the fifth NBA player with 10,000 for his career.\n\n\"It's been a fun ride the last couple of months, emotional at times,\" Nowitzki said. \"At times a little overwhelmed with it but trying to make the best out of it, enjoy, soak it all up.\"\n\nWright secured his triple-double with his 10th rebound in the final minute.\n\n\"I think I had one in high school. Yeah, it's been a while,\" said the fourth-year guard, who previously scored 25 twice, mostly recently against Portland on March 5. \"I haven't gotten the minutes in the NBA I feel like to get it, so now that I'm finally playing a lot, it's easier for me to get it.\"\n\nTIP-INS\n\nGrizzlies: Chandler Parsons, who spent two seasons in Dallas and still gets booed by Mavericks fans after signing with the Grizzlies as a free agent three years ago, scored 11 points. ... C Tyler Zeller scored 10 points after signing for the rest of the season earlier in the day. ... A 25-4 Memphis run covering the first and second quarters turned a 30-21 deficit into a 45-35 lead.\n\nMavericks: Lee led Dallas with season highs of 21 points and seven assists, and Justin Jackson added 19. ... Nowitzki led the Mavericks with his seven rebounds, and Lee had a team-high seven assists. ... C Salah Mejri had 12 points, five rebounds, a career-high five assists and three blocks, matching his season high, in 19 minutes.\n\nMISSING MAVS, AND GRIZZ\n\nDoncic's first-year backcourt mate, Jalen Brunson, also sat for Dallas along with center Dwight Powell. Mike Conley, Memphis' leading scorer, missed his third straight game with left ankle soreness.\n\nBIRTHDAY CELEBRATION\n\nJustin Holiday scored 20 points on his 30th birthday as Memphis won again after blowing out the Mavericks by 30 on their home court in early March. The Grizzlies will go for a four-game season sweep Sunday at home. The teams came in with matching 31-47 records.\n\nUP NEXT\n\nThe teams play again Sunday in Memphis.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995332.819632
}