{
  "game_id": "0022401024",
  "espn_id": "401705590",
  "date": "Mar 22, 2025",
  "matchup": "BKN @ IND",
  "headline": "Pascal Siakam's late scoring flurry helps Pacers fend off hard-charging Nets 108-103",
  "body": "INDIANAPOLIS -- — Pascal Siakam scored eight of his 26 points over the final 3 1/2 minutes Saturday and Myles Turner made five 3-pointers and finished with 22 points to help the Indiana Pacers hold off the charging Brooklyn Nets 108-103.\n\n\r\n              Indiana swept its two home games against Brooklyn this week. The Pacers have won four straight and six of seven.\n\n\r\n              Turner also had eight rebounds and three blocks after his sister left the court on a stretcher during pregame warmups. All-Star guard Tyrese Haliburton returned from an injured back that kept him out of Indiana's previous three games and recorded his 10th straight double-double with 16 points and 12 assists to go with eight rebounds.\n\n\r\n              Trendon Watford scored a season-high 26 points to lead the Nets, who have lost three straight and 13 of 15. Cam Johnson added 20 points, nine rebounds and five assists.\n\n\r\n              The Pacers closed the third quarter on an 11-0 run to take a 90-70 lead, but allowed Brooklyn to open the fourth quarter on a 13-0 run. Then after giving up a dunk, the Nets scored eight straight to get within 92-91 with 4:30 to play.\n\n\r\n              But Siakam's late scoring flurry helped seal the win.\n\n\r\n              Takeaways\r\n              Nets: It has been a tough season for Brooklyn and losing twice at Indiana only added to the woes as the Nets continued their late season fade.\n\n\r\n              Pacers: Indiana entered with a one-game lead over Milwaukee for the No. 4 seed and three games behind New York for the No. 3. They're trying to earn their first home-court series since 2013-14 — aside from the 2019-20 playoffs that were played in Florida.\n\n\r\n              Key moment\r\n              Brooklyn made only three baskets over the final 4 1/2 minutes after closing to 92-91.\n\n\r\n              Key stats\r\n              Indiana had 32 assists on 40 baskets and a 21-8 advantage in fast-break points.\n\n\r\n              Up next\r\n              The Nets open a three-game homestand Monday against Dallas. Indiana hosts Minnesota on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997964.204725
}