{
  "game_id": "0022400424",
  "espn_id": "401704990",
  "date": "Dec 27, 2024",
  "matchup": "CLE @ DEN",
  "headline": "Mitchell scores 33, Cavs beat Nuggets 149-135 for 6th straight win",
  "body": "DENVER -- — Donovan Mitchell scored 33 points, Evan Mobley had 26 points and the streaking Cleveland Cavaliers beat the Denver Nuggets 149-135 on Friday night for their sixth straight win.\n\n\r\n              Cleveland set a season high in points and improved to 10-1 since dropping two in a row to Atlanta last month.\n\n\r\n              Nikola Jokic had 27 points, 14 rebounds and 13 assists for his league-leading 12th triple-double of the season, and Jamal Murray also had 27 with 10 assists for Denver, which has dropped two in a row.\n\n\r\n              Michael Porter Jr. scored 13 of the Nuggets’ first 25 points to help keep pace with the Cavaliers but only scored five the rest of the way.\n\n\r\n              Cleveland led by as many as 19 to improve its NBA-best record to 27-4.\n\n\r\n              Takeaways\r\n              Cavaliers: Passed the first test in what is the start of their toughest road trip of the season. All five starters made more than half of their field goal attempts and all but Dean Wade scored 20 or more points.\n\n\r\n              Nuggets: Their porous defense was hurt by the absence of Aaron Gordon, who is out with a right calf strain. They allowed season highs in points and points in the first half (80).\n\n\r\n              Key moment\r\n              With Denver leading 53-50 early in the second quarter, Darius Garland sparked a 16-0 run with six of his 25 points that allowed the Cavaliers to take control of the game. Their lead never dipped below double digits the rest of the way.\n\n\r\n              Key stat\r\n              Mitchell was 6 of 12 from 3-point range.\n\n\r\n              Up next\r\n              The Cavaliers continue their four-game trip out west at Golden State on Monday night, while the Nuggets host Detroit on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998319.881214
}