{
  "game_id": "0022200283",
  "espn_id": "401468438",
  "date": "Nov 25, 2022",
  "matchup": "DET @ PHX",
  "headline": "Ayton, Booker lead Suns to 108-102 win over Pistons",
  "body": "PHOENIX -- — Cameron Payne drove into the lane with a minute remaining in the game and tossed a short jumper toward the rim. Detroit's Marvin Bagley III immediately swatted the shot back into Payne's face.\n\n\r\n              Undeterred, Phoenix's point guard grabbed the loose ball and went back up with his shot. This time, he connected, helping the Suns hang on for a 108-102 victory over the Detroit Pistons on Friday night.\n\n\r\n              “It's all good, he got a block,” Payne said. “Next play.”\n\n\r\n              Deandre Ayton scored a season-high 28 points and had 12 rebounds, Devin Booker added 21 points and the Suns stayed on top of the Western Conference with their third straight win. \n\n\r\n              Payne's shot that was blocked and then the putback was a microcosm of the Suns' night. They weren't at the top of their game offensively — shooting just 7 of 29 (24.1%) from 3-point range — but used grit and persistence to improve to 10-1 on their home court this season.\n\n\r\n              “Although we didn’t make the shots we wanted, the defensive intensity was still there,” Ayton said. “That is what really put us in position to win the game.”\n\n\r\n              The Suns led 84-79 going into the fourth quarter. They pushed it to 94-85 by midway through the fourth, but the feisty Pistons scored the next eight points.\n\n\r\n              Ayton's putback slam on Booker's missed layup gave the Suns a 102-97 advantage with 1:34 left. Ayton shot 11 of 13 from the field and 6 of 7 on free throws. \n\n\r\n              “He did a real good job on screens tonight and it opened him up for baskets,\" Payne said about Ayton. “Sometimes, that's how it goes. You sacrifice your body and then you're the one who gets the reward.\"\n\n\r\n              Payne added 16 points and 10 assists.\n\n\r\n              Bojan Bogdanovic had 19 points for Detroit, and Killian Hayes added 17. \n\n\r\n              “I think we just had a couple of mishaps late in the game,” said Pistons guard Hamidou Diallo, who scored 10 points off the bench. “A couple of missed assignments and couple of missed reads and it cost us down the stretch.”\n\n\r\n              The Pistons came into the game with the worst record in the Eastern Conference, but had won two straight games at Denver at Utah.\n\n\r\n              Detroit played well again Friday, taking a 54-53 halftime lead. Bogdanovic led the Pistons with 15 points in the first half while Booker had 13 for the Suns. Phoenix shot just 3 of 17 (16.7%) from 3-point range before the break.\n\n\r\n              BOGDANOVIC HURT\n\n\r\n              Bogdanovic fell to the floor with about 25 seconds in the game, clutching at his right knee after Phoenix's Torrey Craig stepped on his foot.\n\n\r\n              Pistons coach Dwane Casey was furious that a foul wasn't called, continuing to argue with officials even as the game ended. When Bogdanovic was down on the floor, Suns forward Mikal Bridges grabbed the loose ball and made a jumper to push Phoenix's lead back to six points.\n\n\r\n              “The player stepped on his foot, titled his knee,” Casey said. “They are looking at it now. Big play, big play. Someone has got to see that play in that situation. The man tears up his knee and loses the ball in a close game.”\n\n\r\n              Bogdanovic said the injury wasn't as bad as he initially feared.\n\n\r\n              “He stepped on my ankle, then the knee went inside, but it's not bad,” Bogdanovic said. “I thought it was worse. I will see how it feels tomorrow.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: G Jaden Ivey (right knee soreness), G Cory Joseph (non-COVID illness) and G/F Saddiq Bey (right ankle sprain) were inactive. ... Detroit's bench had a 38-26 advantage in scoring. ... The Pistons lost their fourth straight game to the Suns. The series between the teams is 71-71.\n\n\r\n              Suns: G Chris Paul (sore right heel) missed his seventh straight game. ... G Landry Shamet (concussion) hopes to return soon, possibly as early as Saturday's game against the Jazz. ... Made just 1 of their first 15 3-point attempts. ... Bridges missed his first nine shots before making a 3-pointer early in the third quarter. ... Hosted their 37th consecutive sellout crowd.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Cleveland on Sunday night.\n\n\r\n              Suns: Host Utah on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994386.4254541
}