{
  "game_id": "0022300761",
  "espn_id": "401585389",
  "date": "Feb 12, 2024",
  "matchup": "CHA vs. IND",
  "headline": "Bridges and Charlotte's newcomers lead Hornets past Pacers for 2nd straight win, 111-102",
  "body": "CHARLOTTE, N.C. -- — Miles Bridges had 20 points, 10 rebounds and seven assists and the Charlotte Hornets beat the Indiana Pacers 111-102 on Monday night to improve to 2-0 since the arrival of five new players via trade.\n\n\r\n              Newcomers Grant Williams, Seth Curry, Tre Mann and Vasilije Micic added an offensive spark for the Hornets, who finished with 27 assists. Williams led the team with 21 points and Curry scored 18 off the bench. Mann got the start and finished with 11 points, nine rebounds and seven assists.\n\n\r\n              Micic added a calming influence on offense and helped spark Charlotte's solid ball movement.\n\n\r\n              “We’re more experienced and we’re much deeper, which, to be honest, is a big thing,\" Hornets coach Steve Clifford said.\n\n\r\n              The addition of Williams has allowed the Hornets to play five out, which has opened driving lanes for Bridges, Mann and Micic.\n\n\r\n              The Hornets were plus-14 with Williams on the court, who played 31 minutes.\n\n\r\n              “Miles made a great drive in the fourth quarter and a lot of that is just because Grant’s at the five,” Clifford said. \"You’ve got so much more room on the floor. Miles made a great play, but if you have a traditional center in there, he’s probably not going to be able to get all the way to the basket.”\n\n\r\n              Myles Turner had 22 points and Aaron Nesmith scored 21 for the Pacers (30-25). Tyrese Haliburton chipped in 13 points and 12 rebounds while playing 34 minutes in the loss — his most action since returning from a hamstring injury.\n\n\r\n              The Indiana locker room was eerily quiet after the game, the sign of a team that knew it allowed one to get away against one of the league's worst. Charlotte is 12-41.\n\n\r\n              “At some point as a group, we need to grow up,” Haliburton said. “We have to mature as a group and we have to win these games. We have one more game before the All-Star break and we have to approach it the right way.”\n\n\r\n              Pacers coach Rick Carlisle wasn't pleased with his team's approach or the rebounding margin — 46-32 in favor of Charlotte.\n\n\r\n              “We talked a lot about their trades, how they played two nights ago,\" Carlisle said in reference to Chicago's 115-106 win over Memphis. “They’re clearly a team that’s energized, and we needed to match that, and we didn’t.”\n\n\r\n              Certainly not in the fourth quarter.\n\n\r\n              Charlotte held the NBA's highest-scoring team to just 22 points over the final 12 minutes to secure back-to-back wins for only the second time this season.\n\n\r\n              The Hornets, who have been plagued by injuries this season, have had fresh legs post-trade.\n\n\r\n              Williams has provided a huge boost off the bench and a physical presence, while Mann and Micic have used their quickness off the dribble to create opportunities for their teammates.\n\n\r\n              Mann is finally getting a chance to play after spending much of his time on the bench in Oklahoma City watching and learning from more experienced players.\n\n\r\n              “There is a lot less pressure knowing I can play through mistakes,” Mann said.\n\n\r\n              The Hornets took an 81-80 lead into the fourth behind Curry, who swung the momentum when he knocked down a 3 and scored on a drive through traffic late in the third quarter.\n\n\r\n              Charlotte kept attacking in the fourth and Brandon Miller's pull-up foul-line jumper gave the Hornets a 103-95 lead with 2:47 remaining. Bridges added a hammer dunk over Turner on Charlotte's next possession, bringing the crowd to its feet.\n\n\r\n              Williams had four free throws in the final minute to help put the game away.\n\n\r\n              Charlotte shot 53.7% from the field and its bench outscored the Pacers 44-18.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Visit Toronto on Wednesday night.\n\n\r\n              Hornets: Close out a three-game homestand Wednesday night against the Hawks.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995962.1675782
}