{
  "game_id": "0022300503",
  "espn_id": "401585131",
  "date": "Jan 07, 2024",
  "matchup": "MEM @ PHX",
  "headline": "Grizzlies rally with big-4th quarter to beat Suns 121-115 with Morant sidelined",
  "body": "PHOENIX -- — Jaren Jackson Jr. had 28 points and 10 rebounds and the Memphis Grizzlies, playing without Ja Morant, overcame an 11-point deficit in the fourth quarter to beat the Phoenix Suns 121-115 on Sunday night.\n\n\r\n              Marcus Smart added 25 points and Desmond Bane had 23, including a go-ahead 3-pointer with 1:30 to play. Vince Williams Jr. scored a career-high 19 points off the bench.\n\n\r\n              Morant was sidelined because of soreness in his right shoulder. Grizzlies coach Taylor Jenkins said before the game that Morant apparently hurt the shoulder Friday night late in a victory over the Lakers in Los Angeles.\n\n\r\n              Morant was a game-time decision but had a sling on his shoulder on Sunday. Jenkins said the team will continue to evaluate his injury.\n\n\r\n              Still, the Grizzlies are 7-4 since Morant's return from a 25-game suspension. Phoenix led 87-76 entering the final quarter, but Memphis started the period on a 14-1 run and outscored the Suns 35-18 in the final 12 minutes.\n\n\r\n              “This group, we've been fighting all season long, but it's taken a turn right now and they're seeing the results for it,” Jenkins said. “It's just two games playing really well, we know we've got a long way to go.”\n\n\r\n              “We started dictating more, did a much better job, keeping it simple,” Jenkins said about the fourth-quarter surge.\n\n\r\n              Jackson Jr. credited defense for the turnaround. \n\n\r\n              “We made them run a little bit, work a little harder,” he said. “It was back and forth at all times. I never really felt like it was in our favor until the buzzer.\"\n\n\r\n              Kevin Durant returned for Phoenix after missing three games because of soreness in his right hamstring. He had 23 points and 10 rebounds.\n\n\r\n              Devin Booker led the Suns with 24 points. Jusuf Nurkic had 18 points and 19 rebounds, Grayson Allen scored 16 points and Bradley Beal added 12.\n\n\r\n              “Only results matter,” Durant said. “Context really doesn't matter. Whatever it is, we know what it takes and expectations from the outside don't mean (anything), but we understand with the talent we have, people expect so much and will be disappointed when we take losses like this.”\n\n\r\n              The Suns were without guard Eric Gordon (right knee soreness) and backup center Bol Bol (right ankle sprain). Suns coach Frank Vogel said before the game that both are day-to-day.\n\n\r\n              Phoenix finished its homestand 4-2.\n\n\r\n              Morant missed the first 25 games of Memphis’ season, serving a suspension for conduct detrimental to the league. The two-time All-Star was suspended for eight games last season for displaying handguns on social media and drew a longer penalty for doing it again during the offseason.\n\n\r\n              The Grizzlies began the season 6-19, and are 7-4 since Morant’s return.\n\n\r\n              NEXT\n\n\r\n              Grizzlies: At Dallas on Tuesday night.\n\n\r\n              Suns: At Los Angeles Clippers on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996022.6417532
}