{
  "game_id": "0021900002",
  "espn_id": "401160624",
  "date": "Oct 22, 2019",
  "matchup": "LAL @ LAC",
  "headline": "Leonard leads Clippers over LeBron and Lakers 112-102",
  "body": "LOS ANGELES --  Kawhi Leonard hit seven straight shots in one stretch, creating a run for the Clippers that his new teammates quickly joined.\n\n\"It's a great sign of leadership,\" coach Doc Rivers said. \"He talks with his game.\"\n\nLeonard began a new career chapter Tuesday night, scoring 30 points to go with a strong bench effort in a 112-102 victory over LeBron James and the Lakers in the teams' season opener.\n\nLeonard chose the Clippers because he wanted to come home and his family was on hand.\n\n\"All those emotions went through me again,\" he said.\n\nLou Williams added 21 points and Montrezl Harrell had 17 off the bench when the Clippers began their 50th season overall and 36th in Los Angeles as the once unlikely but now favorites to win the franchise's first NBA championship.\n\n\"It's one of 82 (games),\" Rivers said. \"Next question.\"\n\nLeonard won his second NBA title last season in Toronto.\n\nThe Lakers showed off their new 1-2 punch of James and Anthony Davis. Davis scored 25 points, making 9 of 14 free throws, and James had 18.\n\n\"For us, we're both aggressive,\" Davis said. \"Sometimes we kind of miss each other. I missed him a couple times and he missed me, so just trying to figure it out.\"\n\nDanny Green outscored them both with 28 points, including seven 3-pointers, in the highest-scoring debut by a Laker in franchise history.\n\nLeonard got it done without his personal recruit Paul George, sidelined indefinitely while rehabbing from a pair of offseason shoulder surgeries.\n\n\"It's just the first game of the season, so it's going to take the season and mistakes and success to get us on the same page,\" Leonard said.\n\nWearing a black tuxedo jacket and bow tie, George received a mixed reaction when introduced in the playoff-like atmosphere at Staples Center, where the Clippers were the home team for the first of four meetings in the arena the teams share.\n\n\"Their fans were very loud early and I thought our fans took over from that point on,\" Rivers said. \"It's great for the city.\"\n\nThe Clippers' reserves outscored the Lakers' bench, 60-19. Last season, Williams and Harrell were the NBA's highest-scoring reserve duo, and they picked up where they left off.\n\n\"This bench is going to be better this year than even last year,\" Rivers said.\n\nIt came down to the fourth quarter, and the Clippers dominated.\n\nTied 85-all, they opened with a 19-7 run to go up 104-92. Five different players scored and Leonard assisted on Maurice Harkless' 3-pointer.\n\nJames had three of the Lakers' six turnovers in the fourth, when Harkless and Leonard each blocked shots by Dwight Howard.\n\n\"That was just very careless and they capitalized off of it,\" James said.\n\nWith 4  1/2 minutes left, Lakers fans chanted \"Let's go, Lakers! Let's go, Lakers!\" while others hit the exits.\n\n\"The NBA's back and everyone's trying to have the narrative of it's a rivalry game and it's a huge test,\" James said, \"but I think both teams are not where they want to be. We have a lot of room to improve.\"\n\nThe Lakers erased a 14-point deficit in the third, led by Danny Green's 18 points. He capped a 15-0 run with his fifth 3-pointer before JaMychal Green's 3-pointer pulled the Clippers into an 85-all tie heading into the fourth.\n\nThe Clippers outscored the Lakers 40-29 in the second quarter, buoyed by 16 points from Leonard. He made seven straight shots on a variety of moves -- pullups, fadeaways, a cutting dunk.\n\nThe Lakers raced to a 13-2 lead, their largest of the game. James scored over Leonard and he later heard \"MVP! MVP!\" chants while sinking his first free throws of the season.\n\nThe Lakers shot 53% from the floor in the first quarter, while the Clippers missed shots and had a basket by Williams taken away when the Lakers challenged a foul call on Howard.\n\nThe rivalry was on early with a male fan shouting \"Go Lakers!\" during the national anthem, drawing big cheers while Clipper fans booed.\n\n\"It was everything I expected,\" Davis said. \"Very anticipated game and it was fun.\"\n\nTIP-INS\n\nLakers: They fell to 43-29 all-time in season openers. ... G Rajon Rondo (sore right calf) sat out.\n\nClippers: They improved to 25-25 in openers all-time, but still trail the Lakers 3-2 when the teams meet in a season opener. ... G Rodney McGruder (right ankle sprain) missed the game.\n\nWARNING FANS\n\nAs part of the NBA's crackdown on fan behavior this season, cards carrying a message from league security were on seats located courtside and the first couple rows back. They reminded that every fan is required to comply with the league's fan code of conduct and anyone who acts inappropriately may be subject to ejection and-or revocation of their tickets. The public address announcer reminded fans before both halves about minding their manners.\n\nLEONARD'S GREETING\n\nLeonard took to the mic to welcome Clippers fans to the game. He had to raise his usually low voice to be heard over the din, a mix of cheers from Clippers fans and boos from Lakers fans. \"It's going to be a great season,\" Leonard said. \"We're going to play hard every night. Let's get it going.\"\n\nSTARRY NIGHT\n\nFamous faces came out, including Kate Hudson, Angela Bassett, Jeff Garlin, and athletes Lisa Leslie and Diana Taurasi of the WNBA, Joc Pederson of the Dodgers and soccer player Alex Morgan. Halsey performed outdoors at LA Live before the game and Ty Dolla $ign rapped at halftime.\n\nUP NEXT\n\nLakers: Return to Staples Center as the home team Friday against Utah. The Lakers are 25-12 all-time against the Jazz at home.\n\nClippers: Travel to Golden State on Thursday to open the Chase Center in San Francisco in another blockbuster matchup.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996741.139253
}