{
  "game_id": "0022100651",
  "espn_id": "401360470",
  "date": "Jan 16, 2022",
  "matchup": "SAC vs. HOU",
  "headline": "Gordon's late basket helps Rockets hold off Kings 118-112",
  "body": "SACRAMENTO, Calif. -- — Christian Wood had 23 points and 14 rebounds, Eric Gordon made a clutch bucket with 12.5 seconds remaining and the Houston Rockets held off the Sacramento Kings 118-112 on Sunday night.\n\n\r\n              Kevin Porter Jr. added 23 points and seven assists for the Rockets. Garrison Mathews scored 17, while Eric Gordon and Jalen Green had 15 points apiece.\n\n\r\n              “We were ready to play tonight,” Rockets coach Stephen Silas said. “We’re not a playoff team yet but when we are this is what it’s going to look like. We’re trying to learn as many lessons as we can. I was proud of them for that.”\n\n\r\n              Buddy Hield scored 27 points for Sacramento, 10 of which came in the fourth quarter. Terence Davis had 17 points, and De’Aaron Fox added 14 points before getting ejected in the fourth after getting called for a Flagrant 2.\n\n\r\n              The Rockets, who lost to the Kings 126-114 on Friday, trailed going into the fourth but took control with an 18-5 run. Mathews had eight points during the run, including a four-point play, moments after he crashed to the court following the hard foul by Fox.\n\n\r\n              After Sacramento got within 114-112 with 47.8 seconds remaining, Green grabbed an offensive rebound and fed it low to Gordon who scored. Porter added two free throws.\n\n\r\n              “Everybody played big,” Wood said. “It’s good to see everybody click on the same page. We can build off of this.”\n\n\r\n              Houston held a 47-37 rebounding advantage. Both teams scored 50 points in the paint.\n\n\r\n              “We didn’t keep them out of the paint and they kept enough of a lead that it puts a lot of pressure on you to score,” Kings interim coach Alvin Gentry said. “We created some really good shots. It’s just a matter of us knocking them down.”\n\n\r\n              The Rockets jumped out to a fast start and led 13-0 and 21-5 before the Kings got going.\n\n\r\n              After Barnes’ 3-pointer cut Houston’s lead to one, Chimezie Metu sank a corner 3 that gave the Kings their first lead. Fox later connected on a short jumper and Barnes made a free throw after Gordon’s technical to put Sacramento ahead 60-55.\n\n\r\n              The Kings fell behind in the third but closed the quarter on a 13-4 run.\n\n\r\n              WOOD’S FAST START\n\n\r\n              For the second game in a row, Wood had a dominant first quarter, scoring 10 points and grabbing seven rebounds. The difference this time was that the Rockets’ big man was able to stay on the court. On Friday, Wood scored 15 points in the first 7½ minutes but picked up his third foul moments later and spent the rest of the half on the bench. \n\n\r\n              HE DID THAT\n\n\r\n              Davis ripped the ball out of Green’s hands while the Houston rookie was driving for a layup, drove the length of the court and was fouled while scoring on a one-handed dunk. The Rockets challenged the call but lost, and Davis completed the three-point play.\n\n\r\n              TIP-INS\n\n\r\n              Rockets: Wood had two steals and two blocks. … Jae’Sean Tate and Gordon received a technical fouls in the first half.\n\n\r\n              Kings: Sacramento missed seven of its first nine shots. … Tyrese Haliburton has entered the NBA’s health and safety protocol. … Marvin Bagley III, coming off his best game of the season, was held out with right shoulder soreness. … Richaun Holmes returned to the lineup after missing eight games while in the health and safety protocol. … Damian Jones, also back from the health and safety protocol, was called for a technical foul in the second quarter.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Face the Jazz in Utah on Wednesday.\n\n\r\n              Kings: Host the Pistons on Wednesday.\n\n\r\n              ----",
  "source": "espn_api",
  "crawled_at": 1764993900.137353
}