{
  "game_id": "0021800051",
  "espn_id": "401070732",
  "date": "Oct 23, 2018",
  "matchup": "SAC @ DEN",
  "headline": "Jokic's double-double leads Nuggets over Kings, 126-112",
  "body": "DENVER --  Michael Malone wasn't excited about his Denver Nuggets' defense Tuesday night, but he acknowledged he was nitpicking a little.\n\nThe coach had to find something to work on after another impressive win by his team.\n\n\"Our defense wasn't great tonight,\" Malone said after the Nuggets beat the Sacramento Kings 126-112 on Tuesday night. \"Not the defense we hoped for but we're not going to hold everyone under 100.\"\n\nJamal Murray scored 14 of his 19 points in the third quarter and Nikola Jokic had 14 points and 12 rebounds to lead the Nuggets, who have won their first four games for the first time since starting 5-0 in 2009-10.\n\nThe Nuggets swept their three-game homestand, including a win over Golden State on Sunday.\n\n\"We're feeling good, we're playing well,\" center Mason Plumlee said. \"It's a long season but we're going to ride the momentum while we've got it.\"\n\nThe Nuggets remained unbeaten despite allowing a team to break the century mark in points for the first time this season. The Nuggets held opponents to an NBA-best 95.7 points in the first three games but simply outscored Sacramento, which entered Tuesday second in the NBA in scoring at 125.7 points a game.\n\nGary Harris scored 18 points and Paul Millsap added 15 for Denver.\n\n\"They are a tough team to play, they're physical and they take care of their home court,\" Kings coach Dave Joerger said. \"They have found a nice rhythm.\"\n\nDenver's early defense helped build a 13-point halftime lead that grew to as much as 26 in the third quarter. Jokic, who was named the NBA Western Conference player of the week on Monday, had 11 points and 10 rebounds at halftime. He hit a 3-pointer to start the third quarter and then Murray took over.\n\nThe third-year guard was shooting just 30.8 percent but was 4 of 6 from the field and hit two 3-pointers in the third quarter.\n\n\"I wanted to come out aggressive but the fouls kind of held me back for the first half,\" Murray said. \"I wanted to make sure I got my confidence up.\"\n\nMarvin Bagley III led Sacramento with 20 points and Justin Jackson scored 17. The Kings scored 15 points in the final 2:35.\n\n\"If we start out like we did tonight, slow, we lose,\" Bagley said. \"That's what happens every time we start out start slow. We have to start out fast and keep going the rest of the game.\"\n\nTIP-INS\n\nKings: Sacramento's previous low was 117 points in its season opener against Utah. ... The Kings are in the midst of playing seven of nine games on the road. ... Sacramento was 52.3 percent from the field, just below its season average of 52.8 percent.\n\nNuggets: Former Denver Broncos head coach Mike Shanahan was in attendance. ... The Nuggets were 13 of 15 from the free-throw line after missing 18 against Golden State on Sunday. ... Eight players scored in double figures.\n\nBARTON UPDATE\n\nForward Will Barton underwent successful surgery to repair core and hip muscle injuries, the team announced Tuesday morning.\n\n\"Hopefully we'll get some good news,\" Malone said.\n\nBarton was injured in the win over Phoenix on Saturday and will be out until December at the earliest. The team said he will be reevaluated in five weeks.\n\nL.A. STORY\n\nThe Nuggets will play their fourth game in Los Angeles in less than a month when they face the Lakers on Thursday night. Denver played the Clippers and the Lakers once each at Staples Center in the preseason, and then opened the regular season at the Clippers on Oct. 17.\n\n\"I'm looking for places in L.A.,\" Harris said. \"Looking forward to going back out there and getting a win.\"\n\nUP NEXT\n\nKings: Host Memphis on Wednesday night.\n\nNuggets: Travel to Los Angeles to face the Lakers.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994234.072408
}