{
  "game_id": "0021500363",
  "espn_id": "400828250",
  "date": "Dec 14, 2015",
  "matchup": "PHX @ DAL",
  "headline": "Parsons' big 2nd half helps Mavs top Chandler, Suns 104-94",
  "body": "DALLAS -- Chandler Parsons looks for benchmarks in his slow recovery from offseason knee surgery.\nThe Dallas forward found another one against Phoenix on Monday night.\nParsons scored 15 of his 17 points in the second half, Raymond Felton followed his second career triple-double with 17 points and the Mavericks beat former teammate Tyson Chandler and the Suns 104-94.\n\nUsually struggling to find a rhythm and now coming off the bench because of restrictions on his playing time, Parsons played a season-high 28 minutes and had eight points during a 20-4 run to finish the third quarter. Dallas made 13 of its last 14 shots in the quarter to take a 77-58 lead.\nAfter the Suns pulled within 10, Parsons had a four-point play and another 3 to help Dallas push the lead back to 15.\n\"It's all about confidence right now,\" Parsons said. \"I am going to be rusty. I'm going to miss some shots and go through some slumps. I just got to stick with it.\"\nDeron Williams led Dallas with 18 points, including a 3-pointer to help hold off another Phoenix push.\nEric Bledsoe led the Suns with 23 points and seven assists.\nThe Mavericks snapped a three-game home losing streak while beating Chandler's new team for the second time following a win at Phoenix on opening night.\nChandler left in free agency for the second time since helping Dallas win its only championship in 2011. He had six points and three rebounds coming off the bench for the second straight night after missing eight games with a right hamstring strain.\nThe 7-foot-1 center entered in the first quarter to a nice ovation from fans that have forgiven him twice for going elsewhere. That's partly because the Mavericks decided both times to pursue other options.\n\"It will always be special as long as I'm in the league, and even when I'm not in the league it will always be special to come to a game here,\" Chandler said. \"It's always been so much love here. The love is right back.\"\nParsons has had a hard time getting in the flow with his minutes limitations and made just 5 of 18 from the field his previous two games. But he was 5 of 10 from the floor and made all five free throws against Phoenix, finishing three points shy of his season high of 20 against Philadelphia.\n\"He's going to outlast this situation,\" coach Rick Carlisle said. \"There's a big rock. He's just got to keep chipping away at that rock. It takes an amazing amount of persistence and wherewithal to get through something like that.\"\nThe Suns fell to 0-9 when held under 100 points despite a late push that included seven straight points from T.J. Warren to get within 96-90 with 2:30 remaining. Warren finished with 10 points.\nPhoenix had a chance to get closer, but Jon Leuer, who had 15 points and 13 rebounds, couldn't handle an alley-oop pass on a fast break. Williams' final 3-pointer pushed Dallas' lead back to 101-92 with 1:01 left.\nFELTON FEELING IT\nFelton had 10 points, 11 assists and 11 rebounds two nights earlier in a home loss to Washington. In this one, he was 3 of 7 from 3-point range and tied Dirk Nowitzki for the team lead with four assists. He's been in double figures five straight games and is averaging 12.6 points, 7.2 rebounds and 6.2 assists in that span.\nSHUTTING DOWN THE KNIGHT\nPhoenix's Brandon Knight went scoreless in the second half after leading everyone with 12 points before halftime. He was coming off a 25-point game in a win over Minnesota that followed a one-point outing on 0-for-12 shooting in a loss to Portland. He attempted just one shot in the second half.\nTIP-INS\nSuns: Chandler came off the bench Sunday against Minnesota. It was the first time he hasn't started since the end of the 2009-10 season with Charlotte. ... Leuer had his third double-double of the season.\nMavericks: Devin Harris tied a career high with six steals. He scored 12 points. ... Nowitzki had 14 points and seven rebounds, and Zaza Pachulia had 12 rebounds and three steals. ... Wesley Matthews finished with 13 points, making 3 of 9 from long range.\nUP NEXT\nSuns: At Golden State on Wednesday night.\nMavericks: At Indiana on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994867.585091
}