{
  "game_id": "0021500547",
  "espn_id": "400828434",
  "date": "Jan 08, 2016",
  "matchup": "PHX vs. MIA",
  "headline": "Wade scores 27, Heat win as Dragic, Green return to Phoenix",
  "body": "PHOENIX --  Gerald Green scoffed at the notion that Friday night's game against his former team was an emotional return for him.\n\nTwo stare downs of Suns majority owner Robert Sarver seemed to indicate otherwise.\n\nGreen hit 7 of 11 shots and scored 21 points, helping his Miami Heat down the Phoenix Suns 103-95.\n\n\"I'm just happy that we started off the road trip with a win. It's all fun and games,\" said Green, who was then asked if he was disappointed not to be re-signed by the Suns in the offseason.\n\n\"Yeah, I was disappointed. But thank God for Miami,\" Green said. \"Us as an organization, we've got bigger fish to fry then worry about me getting a win because I played here last year. That's petty.\"\n\nDwyane Wade scored 27 points in the Heat's 11th straight victory over the Suns.\n\nFormer Suns guard Goran Dragic added 22 points. He, like Green, returned to Phoenix for the first time as opposing players since last season.\n\n\"You always want to play good against your ex-team,\" Dragic said.\n\nHeat coach Erik Spoelstra said his team wanted to win for the former Suns players.\n\n\"Those are nice moments in the NBA when it's genuine and sincere,\" Spoelstra said.\n\nA 3-pointer by Green with a glare toward Sarver with 4:35 to play gave Miami the lead for good, and Chris Bosh's 3 with 1:57 left put the game out of reach at 98-91.\n\nGreen's night also included a third-quarter dunk, after which he ran past Sarver, who applauded him.\n\nBrandon Knight scored 26 points in the Suns' 10th loss in 11 games.\n\nBack-to-back layups by backup point guard Archie Goodwin gave the Suns an 83-30 lead with 8:01 to play, but the Suns couldn't hold it.\n\nRookie Devin Booker ignited the Suns' rally from a 13-point halftime deficit. He scored 11 straight points to give the Suns a 65-59 lead, the final two on a driving layup that brought the crowd to its feet. But the Heat responded with the next 11 points to reclaim the lead.\n\n\"We were just moving the ball, shots started falling,\" Booker said. \"We had a smaller lineup out there but they ended up making runs, too.\"\n\nMiami led 77-73 after three quarters.\n\nMiami made 17 of 18 free throws in the first half compared to only 3 of 6 for the Suns, and the Heat made 15 more free throws for the game.\n\nThe Heat led 53-40 at the half on two free throws by Green.\n\n\"A team like that, you can't have a lot of mistakes. You can't give them easy buckets,\" Suns coach Jeff Hornacek said.\n\nSuns forward PJ Tucker started and played with a right quad contusion he sustained in the team's previous game. He rode a stationary bike to stay loose when not playing and finished with 11 rebounds.\n\nTIP-INS\n\nHEAT: Dragic got a cheer from the crowd when introduced in the starting lineup. Green's wasn't as loud when he entered as a sub in the first quarter. Amare Stoudemire, who in eight seasons with Phoenix (2002-2010) averaged 21.4 points and 8.9 rebounds, got the loudest cheer from the fans when he checked into the game in the first quarter. . Rap duo Macklemore and Ryan Lewis attended the game.\n\nSUNS: Two days after making his first start of the season, Suns G Ronnie Price sat out with a sprained toe on his right foot. Booker started in his place. . The Suns signed G Lorenzo Brown to a 10-day contract earlier Friday. Brown spent time with Minnesota last season and Philadelphia in 2013-14. He'd been playing with Grand Rapids in the D-League.\n\nHEAT HAD INTEREST IN BOOKER\n\nThe Heat showed interest in Booker leading up to the most recent NBA draft, with Spoelstra praising the rookie's ability to move without the ball and catch and shoot. \"He has an IQ and a feel for the game off the ball,\" Spoelstra said. \"In today's AAU you typically don't see that.\"\n\nUP NEXT\n\nHeat: at Utah Saturday night.\n\nSuns: At Indiana Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994854.838387
}