{
  "game_id": "0021400105",
  "espn_id": "400578397",
  "date": "Nov 11, 2014",
  "matchup": "MIL vs. OKC",
  "headline": "Mayo, Knight help Bucks hold off Thunder, 85-78",
  "body": "MILWAUKEE --  The Milwaukee Bucks' deep and productive reserves led the team to another win.\n\nAfter a slow start, Bucks coach Jason Kidd turned to his reserves. O.J. Mayo and Giannis Antetokounmpo provided some scoring and Zaza Pachulia played inspired basketball at both ends of the court to help Milwaukee reverse course.\n\nMayo finished with 19 points, Angetokounmpo had 14 and starter Brandon Knight scored 16 as the Bucks held off a late Oklahoma City rally to beat the Thunder 85-78 on Tuesday night\n\n\"We had no energy at the start. Somebody had to come in and do something,\" said Pachulia, who had six points, six rebounds and three assists in the first half as the Bucks took a 41-38 lead.\n\nMilwaukee's reserves, who came in averaging a league-best 45.5 points per game, outscored their Oklahoma City counterparts 53-22.\n\n\"We talk about energy and effort and trust and we've relied on our second group,\" Kidd said. \"Our first group is still kind of feeling their way around playing with each other.\"\n\nThe second team players are \"ready whenever coach calls our names,\" Mayo said. ??\"We want to build this thing off energy and effort,\" he said. \"You have to go out there and get after it.\"\n\nKnight scored the first seven points of the third quarter, helping the Bucks take a 69-64 lead heading to the fourth. Milwaukee extend the lead to as much as 11 in the fourth before Oklahoma City pulled within four on two free throws by Ibaka with 31 seconds left. However, the Thunder got no closer.\n\nMilwaukee won consecutive games for the first time since March 2013 and snapped a four-game home losing streak against the Thunder.\n\nReggie Jackson had a career high 29 points, nine above his season average, for Oklahoma City. Serge Ibaka added 14 as the Thunder fell to 0-5 on the road.\n\n\"We were having uncharacteristic turnovers and stopped being strong with the ball,\" Jackson said.\n\nOklahoma City held a 22-15 lead after the first quarter, holding Milwaukee to 35 percent shooting.\n\n\"We've got to squash people,\" said Anthony Morrow, who saw his first action of the year after being sidelined by a knee injury. \"Every time we relax, teams come hit us in the mouth.\"\n\nTIP-INS\n\nThunder: Decimated by injuries, Oklahoma City finally dressed 10 players for a game with Morrow, who scored 10 points, making his season debut after recovering from a sprained MCL.  \"It's nice to have an extra body,\" coach Scott Brooks said. The team's top players, Kevin Durant (right foot fracture) and Russell Westbrook (fractured finger) remain sidelined for extended periods. Four other players also sat out, including Perry Jones, Grant Jerrett, Andre Roberson and Mitch McGary. \"We've just plugged along and tried to focus on what we can control,\" Brooks said.\n\nBucks: The Bucks announced shortly before tip-off that Khris Middleton had a sore right knee and would be in uniform but unlikely be available to play. He didn't see action. ... Kidd has been pleased with the defensive effort of veteran forward Ersan Ilyasova, who was moved into the starting lineup after coming off the bench for the first three games this season. \"I like the way he's competing defensively,\" Kidd said. Ilyasova has struggled on offense, however, and entered the game shooting just 23 percent from 3-point range.\n\nBY THE NUMBERS\n\nThe Bucks outscored the Thunder 50-28 in the paint. \"We have bigs that can contest shots,\" Brooks said. \"We just have to be solid on the defensive end and we need to challenge ourselves to make them take a tough shot.\" Milwaukee held Oklahoma City to 16 points in the second quarter and 14 in the fourth.  \"I thought our defense gave us a chance to win,\" Kidd said.\n\nIN THE CROWD\n\nGreen Bay Packers quarterback Aaron Rodgers sat courtside with his girlfriend, actress Olivia Munn. Rodgers' teammates Randall Cobb and A.J. Hawk also were in attendance.\n\nUP NEXT\n\nThunder: At Boston on Wednesday.\n\nBucks: At Orlando on Friday.",
  "source": "espn_api",
  "crawled_at": 1764991844.476154
}