{
  "game_id": "0022000216",
  "espn_id": "401267376",
  "date": "Jan 20, 2021",
  "matchup": "BKN @ CLE",
  "headline": "Irving returns, but new-look Nets beaten by Cavs in 2 OTs",
  "body": "CLEVELAND -- — Kyrie Irving needed some time. The new-look Nets will require some as well.\n\n\r\n                    Irving returned from his personal “pause” and scored 37 points in his first game with Kevin Durant and James Harden but Brooklyn's “Big 3” couldn't keep up with Cleveland's Collin Sexton, who scored 42 and led the Cavaliers to a 147-135 double-overtime win on Wednesday night.\n\n\r\n                    Sexton made four 3-pointers — most of them over Irving — and scored 15 points in the second OT. He dropped two 3s and fed Taurean Prince for another in a dizzying, 55-second span as Cleveland put it away.\n\n\r\n                    “He played out of his mind,” said Cavs forward Cedi Osman, who scored 25. “It was amazing.”\n\n\r\n                    While it was tough to lose, Irving was impressed by Sexton, who looked a lot like Irving on one of his scoring tears.\n\n\r\n                    '\"Two overtimes for my first game back?\" said Irving, who played a career-high 48 minutes in his first game since Jan. 5. ”You gotta love NBA ball, though. I was smiling when Collin Sexton was making those shots.\"\n\n\r\n                    Durant scored 38 points and Harden added 21 as Brooklyn's trio of superstars combined for 96 points in their first game together. But it wasn't enough to outlast Sexton, who missed Cleveland's last five games with a sprained ankle.\n\n\r\n                    The Cavs threw some exotic defenses at the Nets, who only got Irving back at practice on Tuesday and haven't had time to work on much.\n\n\r\n                    “Look, this is the first night,\" Brooklyn coach Steve Nash said. \"We seemed a little lost at times. We were a little flat and disjointed at times.”\n\n\r\n                    As Sexton knocked down one big shot after another in the second OT, players on Cleveland's bench tackled each other in delight. Prince, acquired in the four-team deal that brought Harden to Brooklyn, scored 17 in his Cavs debut and Larry Nance Jr. had 15.\n\n\r\n                    Sexton will forever be linked to Irving. He was selected by Cleveland with the draft pick the Cavs got from Boston in the trade for Irving in 2017. \n\n\r\n                    Like Irving, Sexton wears No. 2, and like Irving, he makes big shots.\n\n\r\n                    “I definitely accepted the challenge,” Sexton said. “I knew it wasn't going to be easy — because it's Kyrie.”\n\n\r\n                    Irving had missed Brooklyn’s last seven games, leaving on Jan. 7 to address some issues he didn’t specify while speaking with reporters Tuesday. Irving only said he needed space to work through some issues to find balance in his life.\n\n\r\n                    While he was away, the Nets rocked the league by pulling off the blockbuster deal for Harden, whose arrival has made Brooklyn the favorite to unseat Milwaukee in the Eastern Conference and a legit NBA title threat — maybe.\n\n\r\n                    Before the game, Nash admitted being “curious” about how his trio of superstars would align on the floor.\n\n\r\n                    “But I’m not in a hurry,” he said, stressing it may take time for Durant, Irving and Harden to figure things out.\n\n\r\n                    The Nets are indeed a work in progress. There were moments of sloppiness, miscommunication and even confusion as Brooklyn’s players tried to find some cohesion in just Harden’s third game.\n\n\r\n                    “We'll have good nights, great nights,” Irving said. “I'm excited for what's to come.”\n\n\r\n                    The Nets overcame a 13-point deficit in the fourth quarter and tied it at 113-all on Irving's putback with 1:10 left. In the first OT, after Durant's free throws put the Nets up 127-124, Sexton hit a 3-pointer from up top over Irving with 1.2 seconds left. Durant's last chance, a contested 3-pointer at the horn, was short.\n\n\r\n                    The Cavs weren't intimidated by Brooklyn's firepower or flash.\n\n\r\n                    In the second quarter, Sexton ran back on defense and cleanly flicked the ball away from Durant as he was going in on a breakaway dunk.\n\n\r\n                    Irving's return to the Nets was also just his second game in Cleveland since he was traded by the Cavs after the 2017 season. Strangely, Irving had missed each of his team's previous visits to Ohio since his debut with the Boston Celtics four years ago.\n\n\r\n                    It was Irving's jumper late in Game 7 that helped the Cavs win the 2016 title, and the team saluted him with a video tribute in the first quarter. Many of the 2,000 fans in Rocket Mortgage FieldHouse stood and saluted Irving, who touched his chest and waved in appreciation.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Harden added 12 assists and 10 rebounds. A prolific scorer and volume shooter, Harden didn't attempt a shot in the first quarter. ... Brooklyn made its first 10 shots, but let the Cavs scored 17 straight bridging the first and second quarters.\n\n\r\n                    Cavaliers: G Darius Garland remains sidelined with a sprained right shoulder. He could be back Friday. ... G/F Dylan Windler will return Friday after being sidelined since opening night, when he broke his left hand.\n\n\r\n                    SUPPORT TEAM \n\n\r\n                    While the Nets were initially caught off guard by Irving’s leave, the team is committed to helping him.\n\n\r\n                    Nash believes its his responsibility as Irving’s coach, and Brooklyn’s charge as his team, to do whatever it can to aid Irving “in all manners.”\n\n\r\n                    “It’s more important than basketball,” Nash said. “We can be a layer of protection for him.”\n\n\r\n                    UP NEXT\n\n\r\n                    The Nets are hanging around Cleveland for a couple days. They'll play the Cavs again on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997517.2447941
}