{
  "game_id": "0022000380",
  "espn_id": "401267540",
  "date": "Feb 09, 2021",
  "matchup": "ORL @ POR",
  "headline": "Lillard has 36 and Portland downs Orlando 106-97",
  "body": "PORTLAND, Ore. -- — Damian Lillard scored 36 points and the Portland Trail Blazers extended their winning streak over the Orlando Magic to eight games with a 106-97 victory on Tuesday night. \n\n\r\n                    Carmelo Anthony added a season-high 23 points, including five 3-pointers, and moved past Oscar Robertson into 12th place on the NBA’s career scoring list. \n\n\r\n                    “That’s a big honor right there,\" Anthony said. \"I try to play it cool. Sometimes I try to sit back and reflect on these moments, take these moments in. I’m enjoying this. I’m glad I can keep climbing up the charts. But the Big O, that’s big.” \n\n\r\n                    Nikola Vucevic had 27 points and 15 rebounds for the short-handed Magic, who have lost six of their last seven games. Rookie Cole Anthony started but did not return for the second half because of a shoulder injury. \n\n\r\n                    Carmelo Anthony hit a 3-pointer that gave the Blazers a 93-79 lead early in the fourth quarter and Portland didn't let the Magic get within single digits until the final seconds. \n\n\r\n                    “I don't know how long he's going to play. He could play a few more years, I don't know. But he was a professional force last year, he's been really good for us this year,\" Blazers coach Terry Stotts said of the 10-time All-Star. \"There's some highs and lows, but he has earned the respect of our organization, of his teammates, his coaches.” \n\n\r\n                    Evan Fournier, a late scratch on Saturday with back spasms when Orlando fell 118-92 at home to the Bulls, was unavailable again against Portland. The Magic were also without Michael Carter-Williams, who has a sprained foot, and Aaron Gordon because of a sprained left ankle. \n\n\r\n                    But the Magic got some good news with the return of Al-Farouq Aminu, who played for the first time this season after rehabbing his right knee, although he was limited to just five minutes in the opening half. Aminu played for four years in Portland before signing with Orlando as a free agent in 2019. \n\n\r\n                    “It's been the story of our season,” Vucevic said. “Guys keep getting injured for some reason. It's been unfortunate and it's tough.” \n\n\r\n                    Portland led by as many as 16 points in the opening quarter. Gary Trent Jr.'s 3-pointer put the Blazers up 45-28 midway through the second. \n\n\r\n                    Orlando's 10-3 run to close out the half cut the margin to 50-43. Anthony appeared to hurt his right shoulder late in the second quarter and did not return. Frank Mason started the second half. \n\n\r\n                    The Magic pulled to 70-63 on Terrence Ross' floater. The Blazers answered with an 8-0 run to pull away and led 84-73 going into the final period. \n\n\r\n                    TIP INS\n\n\r\n                    Magic: The game kicked off a four-game road trip for the Magic. ... The last Orlando win in Portland was in January 2017. ... The team said Anthony had a right shoulder strain. Additional details weren't available. Anthony was averaging 11.3 points, 4.5 rebounds and 3.9 assists going into the game. \n\n\r\n                    Trail Blazers: Portland was without Nassir Little because of a left knee sprain. ... Portland swept both games against the Magic last season. ... The Blazers were at home after a six-game road trip, which they finished 3-3. ... Trent led all players with 15 first-half points. ... It was Lillard’s 13th game with 30-plus points this season. \n\n\r\n                    MOVING UP\n\n\r\n                    Anthony is now 32 points from Hakeem Olajuwon in 11th. He said after he was out of the game for a year that he's tried to enjoy the milestones as they come, but it's a busy season. \n\n\r\n                    “I'll try to go home and have a glass a wine and reflect over it, but tomorrow we'll be back at it with practice, so I only have a couple of hours to kind of take in this moment,” he said.\n\n\r\n                    NO BREAK \n\n\r\n                    Vucevic played the entire second half. \n\n\r\n                    “The game was right there and I thought if I kept playing it would give us a chance to get closer and maybe turn the game around,” he said. “I didn't want to come out and maybe have the game get away if they went on a run or something.” \n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Visit Golden State on Thursday. \n\n\r\n                    Trail Blazers: Host the Philadelphia 76ers on Thursday, the same time that the forecast calls for snow in the Portland area.",
  "source": "espn_api",
  "crawled_at": 1764997796.5885792
}