{
  "game_id": "0022300182",
  "espn_id": "401584810",
  "date": "Nov 12, 2023",
  "matchup": "HOU vs. DEN",
  "headline": "Fred VanVleet leads Rockets to sixth straight victory with 107-104 win over Nuggets",
  "body": "HOUSTON -- — Fred VanVleet scored 26 points and Alperen Sengun added 23 to lead the Houston Rockets to a 107-104 win over the Denver Nuggets on Sunday night.\n\n\r\n              Houston’s six-game winning streak is the longest since January 2021.\n\n\r\n              Nikola Jokic had his fourth triple-double of the season, racking up 36 points, 21 rebounds and 11 assists in the loss.\n\n\r\n              Jokic hit a 3 with 19.1 seconds remaining to cut Houston’s lead to 103-102. He had a full-court shot at the buzzer to tie it but fell short.\n\n\r\n              The Nuggets entered the game 8-1, their best start since the 2018-19 season. Houston improved to 6-3 after starting the season 0-3.\n\n\r\n              “We’re getting better,” VanVleet said. “We can feel the trend trending upward, we’re trying to get more things done that the coaches are asking us to do, and we’re executing at a higher and higher level each time out.”\n\n\r\n              Rockets veteran Jeff Green hit a big 3 with 1:49 left in the fourth, putting Houston up 103-94. Green appeared in all 20 playoff games during Denver’s championship run last season. Green scored 15 points off the bench Sunday.\n\n\r\n              “He obviously made big shots and was attacking the basket,” Rockets coach Ime Udoka said. “But also, all week, he had a ton of advice and experience, and he was out there being the quarterback on defense, calling out their sets and what they were getting into. He had that familiarity with the team and obviously that was helpful, but it was great to see him come through down the stretch, finish the game and make some big shots. I’m happy for him.”\n\n\r\n              Denver entered the fourth quarter with a 76-74 lead thanks to a 20-foot jumper from Collin Gillespie with 2 seconds left in the third.\n\n\r\n              Sengun added eight rebounds and five assists, while shooting 9 of 18 from the field. \n\n\r\n              “I think it’s a good thing that they’re playing more through him,” Jokic said of Sengun. “I think it’s going to benefit their whole organization. He’s a guy who is not selfish, he wants to play for the team, he wants to pass, and the whole team is going to move when the ball is in his hands. He played really good today.” \n\n\r\n              Behind Jokic, Michael Porter Jr. scored 25 points, Aaron Gordon had 16 and Reggie Jackson added 14.\n\n\r\n              “The greatest challenge that we have is we’re trying to compete for a championship but also develop four young players off the bench,” Nuggets coach Mike Malone said. “That is insanely hard because young players are going to have nights like tonight, and you have to continue to support them and help them in any way that you can, and that’s what we’re going to do. We know these guys are capable.” \n\n\r\n              Houston has won two in a row against Denver following a 10-game losing streak.\n\n\r\n              “It gives us another feather in our cap,” Udoka said. “It gives us experience with late-game execution and getting the shots we want and defending. I’m happy with how we finished. They did hit some tough shots, but that’s expected from a championship-caliber team.”\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host the Los Angeles Clippers as part of the NBA In-Season Tournament play on Tuesday night.\n\n\r\n              Rockets: Open up a three-game California road trip with the Clippers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995640.6236339
}