{
  "game_id": "0022200540",
  "espn_id": "401468695",
  "date": "Dec 31, 2022",
  "matchup": "CHI vs. CLE",
  "headline": "Cavs hold off Bulls 103-102 to end three-game skid",
  "body": "CHICAGO -- — Caris LeVert scored 23 points, Kevin Love added 20 points and nine rebounds and the Cleveland Cavaliers ended a three-game skid with a 103-102 victory over the Chicago Bulls on Saturday night.\n\n\r\n              DeMar DeRozan had 21 points and Ayo Dosunmu added 19 for Chicago, which had won two straight.\n\n\r\n              “We did everything we could to lose that game, but we just have to survive and advance,” said Love, who made five 3-pointers. “It felt like March Madness tonight.\n\n\r\n              “Really ugly game, but again, we have to win ugly sometimes and we’re thankful we did that.”\n\n\r\n              Cleveland led 84-77 after three quarters and never trailed in the second half but didn’t shake the Bulls until the final minute. The Cavs led 103-96 after LeVert’s jumper with 2 minutes left, but Chicago made four free throws to close in.\n\n\r\n              DeRozan made it a one-point game after a driving layup with 29 seconds to play and Chicago had a shot at a winning basket after forcing a shot-clock violation with 4.8 to go. Cleveland, the NBA’s stingiest scoring defense, forced DeRozan into an off-balance shot as time expired.\n\n\r\n              “I think the whole world knew (who was going to take the last shot),” said LeVert, who was in DeRozan’s face with Donovan Mitchell as the final shot left his hand. “He makes those shots all the time.”\n\n\r\n              Chicago managed just one field goal in the final five minutes.\n\n\r\n              “We got a defensive stop late to give ourselves a chance, but certainly the first 47 (minutes) was like a grind for us,” Bulls coach Billy Donovan said. “But I think our guys battled through it and tried the best they could.”\n\n\r\n              Coach J.B. Bickerstaff trusted his defense on a night Cleveland turned the ball over 20 times.\n\n\r\n              “We know we can get stops,” he said.\n\n\r\n              The Cavaliers also got 15 points from Mitchell in the opener of a home-and-home series. The teams meet again Monday in Cleveland.\n\n\r\n              Chicago’s Zach LaVine had 15 points on 6-for-16 shooting, a night after scoring a season-best 43 in a win over Detroit.\n\n\r\n              Nikola Vucevic added 11 points and 14 rebounds.\n\n\r\n              NOT AGAIN!\n\n\r\n              DeRozan made a 28-foot jumper at the buzzer exactly a year ago to lift the Bulls past Indiana 108-106. LeVert, a member of the Pacers then, hoped it wasn’t going to happen again when he got in front of the All-Star in the final seconds.\n\n\r\n              “Same day, it was New Year’s Eve,” LeVert said. “Same type of shot; it was crazy. \n\n\r\n              “Obviously he missed it tonight.”\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: All-Star guard Darius Garland missed the game after he sprained his thumb in Thursday’s loss at Indiana. F Evan Mobley (ankle) also was a scratch. … The Cavaliers had dropped four of their previous five road games.\n\n\r\n              Bulls: Donovan sees less reason to closely monitor LaVine in the second of back-to-back games. The Bulls were cautious with his minutes in those situations after offseason knee surgery, but the coach said the All-Star merits more time as long as there are no medical barriers. “He’s definitely gotten better over time. As long as he’s feeling good, he wants to play.”",
  "source": "espn_api",
  "crawled_at": 1764994497.410357
}