{
  "game_id": "0022000289",
  "espn_id": "401267449",
  "date": "Jan 29, 2021",
  "matchup": "LAC @ ORL",
  "headline": "Leonard, George stellar in returns as Clippers thump Magic",
  "body": "ORLANDO, Fla. -- — Curious how sharp Kawhi Leonard and Paul George would be in their first games back following five-day layoffs, the Los Angeles Clippers didn’t have to wait long for answers Friday night.\n\n\r\n                    The superstar forwards combined for 35 first-quarter points and both delivered thunderous dunks over Orlando players later in the first half in the Clippers’ 116-90 victory over the Magic.\n\n\r\n                    George had 26 points, nine rebounds and five assists, and Leonard added 24 points after they missed two games because of NBA contact tracing protocols.\n\n\r\n                    George attacked the rim and soared high over center Nikola Vucevic for a dynamic dunk in the first quarter. Leonard beat Aaron Gordon off the dribble in the second period and jammed to bring his teammates on the nearby bench to their feet in the second quarter.\n\n\r\n                     Clearly, both superstars were back for a Clippers team that beat Orlando for a 14th consecutive time — a winning streak that dates to Nov. 6, 2013.\n\n\r\n                    “Both … it was a tie. We both a great one,” George said when asked which dunk was better between him and Leonard. “I’m just going at the rim with force, using my athleticism until my athleticism is gone. I’ve still got a little left in the tank.”\n\n\r\n                    Leonard and George both played 28 minutes and were rested early in the fourth quarter after the lead ballooned to as much as 27 points. Leonard made 8 of 15 shots, had a buzzer-beating 3-pointer at the end of the first half and passed to Reggie Jackson for another buzzer-beater at the end of the third quarter. George made 10 of 19 shots and 3 of 9 3-pointers.\n\n\r\n                    The Clippers were a plus-27 with George on the floor and a plus-23 with Leonard.\n\n\r\n                    “I was super relieved that we were both healthy, first and foremost,” George said. “We had been playing so well that it was unfortunate that we had to take the hiatus, but safety is first.”\n\n\r\n                    Serge Ibaka added 13 points and nine rebounds for a Clippers team that is 13-2 this season when leading at halftime.\n\n\r\n                    Orlando scored the first 11 points of the second half to get within three, but the Clippers outscored the Magic 28-11 the rest of the third period to take a 90-71 edge into the final period.\n\n\r\n                    “On a night where guys were a little tired, just having their presence was huge and that was big for us,” Clippers coach Ty Lue said of the firepower provided by George and Leonard following Orlando’s brief third-period run. “They were just making plays for everybody else and making the game easy.”\n\n\r\n                    Once 6-2, Orlando lost for a 10th time in the past 12 games. The Magic’s frustrations showed in the third period when Vucevic and coach Steve Clifford were hit with technical fouls just seconds apart for arguing with referee Aaron Smith over a non-call.\n\n\r\n                    Terrence Ross led the Magic with 24 points off the bench. Vucevic, Orlando’s most consistent player all season, finished with just 10 after hitting only four of 13 shots. Orlando shot 36 percent from the floor.\n\n\r\n                    “(The Clippers) are terrific and they played well,” Clifford aid. “Their superstars are two of the, whatever, 8-to-10 best players in the league and they played like it. That makes it hard.” \n\n\r\n                    TIP INS\n\n\r\n                    Clippers: The start was moved to 8 p.m. by the NBA to allow for more time for players’ COVID-19 tests to be finalized and evaluated. The NBA has already had to postpone 22 games thus far — 21 of them coming since Jan. 10. ... Patrick Beverley missed his third straight game with a sore knee.\n\n\r\n                    Magic: Vucevic has potentially put himself in position to be an All-Star again by greatly improving his 3-point shooting. After making just seven 3s in his first five NBA seasons, Vucevic has steadily made more 3-pointers each of the past five years. He came into Friday having hit 52 of 117 3s — easily the most among NBA centers. ... Michael Carter-Williams, who hoped to play Friday, re-injured his sprained left foot in practice Thursday.\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: At New York on Sunday.\n\n\r\n                    Magic: Vs. Toronto in Tampa on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764997696.335917
}