{
  "game_id": "0021600555",
  "espn_id": "400899976",
  "date": "Jan 07, 2017",
  "matchup": "OKC vs. DEN",
  "headline": "Westbrook's 17th triple-double lifts Thunder past Nuggets",
  "body": "OKLAHOMA CITY --  Russell Westbrook was scary enough already.\n\nNow, the league's scoring leader is hitting 3-pointers as well as he does everything else.\n\nWestbrook had 32 points, 17 rebounds and 11 assists for his 17th triple-double of the season and the Oklahoma City Thunder beat the Denver Nuggets 121-106 on Saturday night.\n\nWestbrook made 7 of 12 3-pointers after hitting a career-high eight 3s on Thursday at Houston. He made four 3-pointers in the fourth quarter to turn the game into a rout.\n\n\"Obviously, Russ started hitting pull-up 3s from 30 feet, and there's not a lot you can do with that,\" Denver coach Michael Malone said.\n\nWestbrook, who entered the game as a 33 percent 3-point shooter for the season, said there's no magic in his 15-for-27 shooting behind the arc the past two games.\n\n\"Just try to stay on balance and concentrate on making the shot,\" he said.\n\nWestbrook matched his season high in rebounds in the 54th triple-double of his career. The Thunder improved to 32-3 the past two seasons when Westbrook gets a triple-double.\n\nSteven Adams scored 16 points and Victor Oladipo added 15 for Oklahoma City, which snapped a three-game losing streak.\n\nWilson Chandler scored 24 points and Will Barton added 21 for the Nuggets. Danilo Gallinari, Denver's leading scorer for the season, finished with 15 points on 5-for-18 shooting.\n\nIt was Denver's fifth consecutive loss, and the Nuggets allowed at least 120 points in all of them.\n\n\"It's still a work in progress, still got to get better at it,\" Barton said of the defensive play. \"We're taking steps.\"\n\nThe game was tied at 60 at halftime. Westbrook had 12 points, eight rebounds and five assists at the break, while Chandler had 19 points for the Nuggets.\n\nWestbrook reached double figures in rebounds early in the third quarter. He sat down for a rest late in the period with nine assists and the Thunder leading 85-73.\n\nWestbrook re-entered the game with 8:35 remaining and the Thunder leading 97-89. He claimed the triple-double less than a minute after he returned, then later put the game away with a pair of 3-pointers 32 seconds apart that put Oklahoma City up by 18.\n\n\"Some of those shots he hit were tough, tough shots, and we had no answer for them,\" Malone said.\n\n---\n\nTIP-INS\n\nNuggets: Shot just 33.3 percent in the first quarter. ... G Jameer Nelson was issued a technical foul in the fourth quarter. ... G Emmanuel Mudiay went scoreless and missed all nine of his shots.\n\nThunder: G Cameron Payne made his season debut after recovering from a broken right foot in the preseason, entering the game with 2:05 left in the first quarter. He made his first shot, a 3-pointer early in the second quarter. He finished with eight points in 13 minutes. \"It's good for our team,\" Westbrook said. ... F Domantas Sabonis scored all nine of his points in the first quarter.\n\nSTAT LINES\n\nWestbrook has attempted at least 10 3-pointers in each of his past four games after having previously done so just twice all season.\n\nQUOTABLE\n\nPayne, on his return: \"It felt good. I got comfortable real quick, found my rhythm. But it was because of the fans. They made me feel comfortable. My teammates cheered me on and gave me a lot of confidence before the game, during the game, and I had fun.\"\n\nDO YOUR DANCE\n\nWestbrook and Payne did their pregame dance routine for the first time this season.\n\n\"It was cool,\" Payne said. \"Like I said last year, it's just to get you to relax and get ready for the game. It helped for sure.\"\n\nUP NEXT\n\nThe Nuggets will play the Indiana Pacers in London on Thursday.\n\nThe Thunder play at the Chicago Bulls on Monday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995292.302272
}