{
  "game_id": "0022400107",
  "espn_id": "401704673",
  "date": "Oct 28, 2024",
  "matchup": "TOR vs. DEN",
  "headline": "Nikola Jokic scores 40, Nuggets rally from 15 down to beat Raptors for first win of season",
  "body": "TORONTO -- — Nikola Jokic scored seven of his 40 points in overtime, and the Denver Nuggets overcame a 15-point deficit to beat the Toronto Raptors 127-125 on Monday night.\n\n\r\n              Canadian star Jamal Murray sent the game to overtime by making a reverse layup for the Nuggets with less than a second remaining in regulation.\n\n\r\n              Jokic also grabbed 10 rebounds. Aaron Gordon had 16 points and 11 boards for Denver.\n\n\r\n              Toronto’s RJ Barrett missed a 3 in the final seconds of OT, and Ochai Agbaji and Jakob Poeltl were unable to tip in Barrett’s miss.\n\n\r\n              Murray and Christian Braun each scored 17 as the Nuggets won for the first time in three games this season.\n\n\r\n              Raptors forward Scottie Barnes had 21 points, 12 rebounds and nine assists, but he was knocked out of the game in the final minute of the fourth quarter after he was elbowed in the right eye.\n\n\r\n              Barrett scored 20 points in his season debut after missing the first three games because of a sprained right shoulder. Poeltl had 16 points and a career-high 19 rebounds.\n\n\r\n              Takeaways\r\n              Nuggets: Gordon finished with eight assists and Murray had seven.\n\n\r\n              Raptors: Barnes went down and stumbled to the bench in pain after he was elbowed with 24 seconds remaining in the fourth. After being treated briefly, Barnes was helped to the locker room.\n\n\r\n              Key moment\r\n              Barnes took exception to a hard foul from Russell Westbrook as he drove to the basket early in the fourth. Barnes and Westbrook traded words before Barnes and Gordon had to be separated after shoving each other. Westbrook was called for a flagrant foul, while Barnes and Gordon got offsetting technicals.\n\n\r\n              Key stat\r\n              Jokic played a game-high 44 minutes.\n\n\r\n              Up next\r\n              The Nuggets visit Brooklyn on Tuesday night, and Toronto is at Charlotte on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997008.75058
}