{
  "game_id": "0021500132",
  "espn_id": "400828019",
  "date": "Nov 13, 2015",
  "matchup": "CHI vs. CHA",
  "headline": "Butler, Bulls beat Hornets 102-97",
  "body": "CHICAGO -- With a new coach and a new starting five, Pau Gasol and the Bulls are still trying to find their identity.\nThey made it work on Friday night. Jimmy Butler had 27 points, Gasol added 19 points and 13 rebounds and Chicago beat the Charlotte Hornets 102-97.\nThe Bulls rebounded from an embarrassing 25-point loss to the Hornets on Nov. 3, but questions still remain about offensive consistency.\n\"We're a team with a lot of talent,\" Gasol said. \"When we play well and play hard and play together, we are tough to beat. We try to play up tempo, try to play with pace, good offensively but I'm not sure there is identity per se.\"\nNicolas Batum scored 12 of his 28 points in the third quarter and was 5 of 6 from 3-point range for Charlotte. Kemba Walker had 16 points, nine rebounds and seven assists.\n\nBatum also finished with eight rebounds.\n\"He can pass. He can shoot. He can rebound. A competitor and he has a really high IQ,\" Hornets coach Steve Clifford said.\nCharlotte trailed for most of the fourth quarter, but Jeremy Lamb scored eight straight points to pull the Hornets within 88-87 with 5:54 left.\nBut Butler hit a jumper and made a pair of free throws and Derrick Rose had a driving layup to get the lead up to 94-87 with 4:32 left.\nLamb missed a 3-pointer with 27 seconds left that would have tied it at 100. Butler then iced it with a 22-footer to put the Bulls up 102-97.\nTrailing 75-73, the Bulls opened the fourth quarter by outscoring the Hornets 11-2. Tony Snell made a 3 and Taj Gibson scored on a jumper to give the Bulls an 84-77 lead.\nTHOUGHTS WITH PARIS\nChicago's Joakim Noah and Batum were playing with heavy hearts following the terror attacks in Paris. Noah's dad is French former tennis player Yannick Noah, who won the French Open in 1983. Joakim lived in Paris from 1988 to 1998. He finished with 18 rebounds.\nBatum, from Lisieux, France, played for the French National team in the 2012 Olympics.\nA moment of silence was observed before the National Anthem.\nClifford spoke with Batum about the events before the game.\n\"I talked to him before and he was obviously concerned,\" Clifford said.\nNoah and Batum checked on their families before the game and reported everyone was safe. Batum was watching the Germany-France soccer friendly on TV when the attacks took place.\nTIP-INS: The Hornets played without Cody Zeller, who sprained his left ankle in a win Wednesday over the Knicks. Zeller tried to give it a go, but felt soreness in his ankle during pregame warm-ups. Zeller converted a go-ahead layup with .6 seconds left in the win on Wednesday. ... Noah played after missing a win Monday over Philadelphia with left knee soreness. ... Frank Kaminsky played his first professional game in Chicago. Kaminsky was raised in the western suburbs and played high school basketball at Benet High School in Lisle, Ill. He finished with five points. ... The Hornets were 15 of 33 from 3-point range. ... The Bulls were 11-of-17 shooting in the fourth quarter.\nUP NEXT: Charlotte plays host to Portland on Monday night. The Bulls play Indiana on Monday night before beginning a four-game road trip.",
  "source": "espn_api",
  "crawled_at": 1764993975.9628868
}