{
  "game_id": "0021800220",
  "espn_id": "401070901",
  "date": "Nov 16, 2018",
  "matchup": "SAC @ MEM",
  "headline": "Jackson, Gasol lead Grizzlies past Kings 112-104",
  "body": "MEMPHIS, Tenn. --  On a night that veteran Marc Gasol became Memphis' career rebound leader, it was the Grizzlies' youngster who showed off his offensive skills.\n\nRookie Jaren Jackson Jr. scored a season-high 27 points, Gasol added 19 points and 15 rebounds and the Grizzlies defeated the Sacramento Kings 112-104 on Friday night.\n\n\"It means I've been here a long time,\" Gasol said laughingly deflecting talk of the rebounding record. \"If you play long enough and you're lucky enough, you're probably going to get some of those.\"\n\nJackson was the one who got the Grizzlies going early, as they built a 13-point lead. The 19-year-old from Michigan State was getting to the rim and converting as if the game plan was to use Jackson against the Kings front line.\n\nBut it was more circumstantial than an opening strategy.\n\n\"Once we saw (a) mismatch and that he was feeling good about it and he was finishing strong to the basket, we got him going,\" Gasol said.\n\nJackson added: \"That just comes from running the floor and making yourself open. It depends on how the game is going and how we feel it out. We don't really set our minds on anything.\"\n\nMike Conley added 19 points and six assists, while Garrett Temple finished with 14 points -- missing only one of his six shots -- as Memphis won its second straight. Gasol has 5,613 career rebounds, passing the franchise record of 5,612 by former Grizzlies standout Zach Randolph.\n\nDe'Aaron Fox led the Kings with 23 points and 10 assists, while backcourt mate Buddy Hield scored 16 points. Bogdan Bogdanovic and Iman Shumpert added 12 points for Sacramento.\n\n\"I think he just keeps taking steps forward,\" Kings coach Dave Joerger said of Fox. \"I think he will be hard on himself about having six turnovers. But I think he continues to improve.\"\n\nMemphis built the lead to 14 points in the third quarter, and held an 11-point advantage near the midway point of the final period. A pair of 3-pointers by Troy Williams around a basket by Fox tightened things up.\n\nThe Kings pulled within 107-104 with 1:55 left on a jumper by Fox, bringing the Memphis fans to their feet, as Joerger encouraged his team for another stop.\n\nBut Gasol converted a three-point play with 1:41 left. Two more free throws from Gasol with 34.9 seconds left provided the final margin.\n\nThe game was a conflict in tempo. Memphis tends to slow things down, while the Kings have been successful lately with a faster pace. In the second half, Sacramento outscored Memphis, but not enough to overcome a 62-51 Memphis lead at halftime.\n\n\"I think we got to it too late,\" Joerger said of increasing the pace. \"You have to try and speed teams like this up, and it's difficult to play from behind.\"\n\nFox added: \"They play so slow, and they get what they want. They get it where they want.\"\n\nTIP-INS\n\nKings: Randolph was at the game, but in street clothes. Randolph, who has been inactive for every Sacramento game this season, played for the Grizzlies eight seasons and still owns a house in Memphis. ... Hield and Fox were a combined 14 of 29 from the field, but Fox converted only one of his five shots from beyond the arc. ... Fox also committed six of Sacramento's 21 turnovers in the game.\n\nGrizzlies: Conley, an 83 percent free-throw shooter, missed four of his first eight from the line in the third quarter. ... Jackson's previous season high was 24 points against Atlanta on Oct. 19. He converted 11 of 16 shots.\n\nA FAMILY REUNION\n\nThere are usually plenty of connections between teams in an NBA game, but the ties between the Kings and Grizzlies is a bit more. Beyond Randolph's All-Star career with Memphis, Joerger was with the franchise nine years, the last three as head coach. Joerger readily admits he enjoys his return to the city. \"I love coming back here,\" he said, noting not only did his family grow up in Memphis, but he did also in regards to his career. He later added: \"I speak well of the Grizzlies. To my guys, the older guys, they're so classy.\"\n\nGASOL RECORD\n\nWhen Gasol grabbed his 15th rebound with little more than a minute left in the game, Randolph, in a suit rather than uniform, watched from the Kings bench as his former teammate surpassed his mark in the Grizzlies' record book. \"It had a little more motivation,\" Gasol said of breaking the record in front of Randolph. \"I wish he was on the floor, but I'm just happy he was watching.\"\n\nUP NEXT\n\nKings: Travel to Houston on Saturday\n\nGrizzlies: Face the Timberwolves in Minnesota on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994221.556261
}