{
  "game_id": "0021801192",
  "espn_id": "401071865",
  "date": "Apr 05, 2019",
  "matchup": "LAL @ LAC",
  "headline": "Lakers surprise playoff-bound Clippers 122-117",
  "body": "LOS ANGELES --  The Los Angeles Clippers are hanging onto sixth in the West playoff race for now despite two straight losses.\n\nTwo days after getting pounded by Houston in a potential playoff preview, the Clippers blew a 12-point, second-half lead and lost to the Lakers 122-117 on Friday night.\n\n\"Just don't think we're playing hard enough,\" said Lou Williams, who had 18 points. \"Ever since we clinched, we kind of took our foot off the gas a little bit. It's happened, that's the reality, and we just got to get out of it.\"\n\nIt won't be easy, though.\n\nThe Clippers travel to Golden State on Sunday when the Warriors could clinch the West's top seed with a win. Los Angeles hosts Utah -- currently fifth -- on Wednesday to end the regular season. A couple more losses and the Clippers could slip to the eighth and final spot.\n\n\"It matters,\" coach Doc Rivers said of seeding positions. \"I don't think anyone wants to go play Golden State.\"\n\nThe Lakers have no such worries.\n\nThey aren't going anywhere in LeBron James' first season in Los Angeles. But they didn't mind playing spoiler to the Clippers, who've dominated the series in recent years.\n\nAnd the win was the 36th of the season for the Lakers, exceeding last year's total of 35.\n\n\"We were having a blast,\" said JaVale McGee, who had 18 points and 10 rebounds. \"A lot of guys had a lot of energy because it's the battle of LA and whenever we play the Clippers, especially when it's a Clippers home game, it's kind of weird for us.\"\n\nTwo-way player Alex Caruso scored 32 points playing 38 minutes -- both career highs -- while auditioning for a future job and Kentavious Caldwell-Pope added 25 points to lead the Lakers.\n\n\"I've been doing this in G League for the last year and a half and I've had my coaches down there just tell me to play confident, play the way I do,\" Caruso said. \"I'm finally just finding that groove and I'm confident and I'm comfortable. It's taken me three years to get to this point out of college.\"\n\nRajon Rondo scored 11 of his 15 points in the fourth quarter when he was the most veteran player on the floor for the Lakers, whose biggest names, including James, have already been shut down for the season. He had 12 assist.\n\nWith summer vacation beckoning next week, the Lakers stunned the Clippers with eight 3-pointers in the fourth, including on four straight possessions. Rondo and Caruso made three each.\n\n\"I said it in our coaches' meeting this morning,\" Rivers said, \"You know who I really like on the Lakers is Caruso.\"\n\nThe Clippers got to 118-115 on Danilo Gallinari's 3-pointer. But Caruso kissed a layup off the glass as the crowd roared for him. He crashed the lane for a layup on the Lakers' previous possession, too.\n\nShai Gilgeous-Alexander's basket again drew the Clippers within three, but Caldwell-Pope made a pair of free throws. Gilgeous-Alexander turned the ball over in the closing seconds to seal the loss.\n\nThe Lakers erased all of a 12-point deficit in the third, repeatedly getting defensive stops to trail by two going into the fourth.\n\nGallinari led the Clippers with 27 points and Gilgeous-Alexander added 20 points.\n\nThe Clippers blew a 12-point lead in the third. Mike Muscala and Caruso hit back-to-back 3-pointers and Jemerrio Jones' basket tied it at 84-all for the Lakers.\n\nTIP-INS\n\nLakers: They split the season series, 2-2. ... F Kyle Kuzma (left foot peroneal tendinitis) missed his fourth straight game. ... G Reggie Bullock (neck stiffness) sat.\n\nClippers: G Patrick Beverley (right hip pointer) rested for the second game in a row. ... F JaMychal Green wasn't with the team while awaiting the birth of a child.\n\nJUMPING JONES\n\nJones had five points and 10 rebounds playing 25 minutes and guarding Williams. The Lakers signed him on March 31 and he's appeared in four games.\n\n\"I'm searching the bench for guys who will get out there and play, and he does that every time he steps on the court,\" Walton said.\n\nUP NEXT\n\nLakers: Host Utah on Sunday in their next-to-last game.\n\nClippers: Visit West-leading Golden State on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994308.871746
}