{
  "game_id": "0022200739",
  "espn_id": "401468894",
  "date": "Jan 27, 2023",
  "matchup": "CLE @ OKC",
  "headline": "Gilgeous-Alexander has 35, leads Thunder past Cavs 112-100",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 35 points, his fourth consecutive game with at least 30, and the Oklahoma City Thunder beat the Cleveland Cavaliers 112-100 on Friday night.\n\n\r\n              Gilgeous-Alexander made 12 of 21 shots and added eight assists and five rebounds. Jalen Williams added 17 points and made all three of his 3-point attempts.\n\n\r\n              “Much better than the first time we played them,” Oklahoma City coach Mark Daigneault said of a 110-102 loss in December.\n\n\r\n              \"I thought the guys played with great force. The physicality tonight, you’re not beating a team like that the way that we did unless you’re physical. And I thought we were physical on both ends.”\n\n\r\n              Darius Garland had 31 points and 13 assists for Cleveland, which played again without All-Star Donovan Mitchell because of a groin injury.\n\n\r\n              The Thunder won for the sixth time in eight games as they contend for a Western Conference play-in berth, while the Cavaliers finished their three-game road swing at 30-21.\n\n\r\n              “They just made more plays than we did,” said Cleveland coach J.B. Bickerstaff. “I give them credit, that’s who they are. They’re a team that plays the entire 48, no matter what’s happening. As a basketball fan, it’s fun to watch.”\n\n\r\n              Oklahoma City jumped out to an early lead before Cleveland’s imposing frontcourt of Evan Mobley and Jarrett Allen slowed Oklahoma City’s attack.\n\n\r\n              Cleveland led 54-47 at halftime, despite shooting an abysmal 3 of 16 from 3-point range.\n\n\r\n              The Thunder erased the deficit to enter the fourth quarter tied at 78 and outscored Cleveland 34-22 in the final 12 minutes to run away with the win.\n\n\r\n              Josh Giddey had 15 points for the Thunder, which included a crafty reverse layup to put the Thunder ahead 83-81 with nine minutes remaining. Oklahoma City never lost its lead.\n\n\r\n              “Defensively, we were locked in and executed what we wanted to,” Giddey said. “We spoke prior to the game, we knew they were the best defense in the league. They’ve got a lot of length in the frontcourt. We knew getting stuff at the rim wasn’t going to be easy, so guys made the right plays. … We did a lot of really good things down the stretch there and that’s a really good team. So, I think the way we closed that game out shows we’re trending in the right direction.”\n\n\r\n              The Thunder shot 52.6% from the floor, while Cleveland finished at 44.3% and made just 8 of 29 attempts from 3. Oklahoma City outrebounded Cleveland 46-37.\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Aaron Wiggins scored 10 points and grabbed seven boards. The Thunder are now 8-0 when Wiggins starts. … Starting guard Lu Dort, who’s averaging 14.1 points and 4.2 rebounds this season, missed Friday’s game with a hamstring injury. … Daigneault drew his third technical foul of the season following Cleveland’s early 10-0 run, which erased the Thunder’s early 12-4 advantage.\n\n\r\n              Cavaliers: The Cavaliers were also without Kevin Love (back). ... Ricky Rubio took Friday night off after playing 17 minutes in a 113-95 win over the Rockets on Thursday. … Mobley surpassed 1,000 career rebounds in just his second NBA season.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Clippers on Sunday night.\n\n\r\n              Thunder: Host Warriors on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764995238.5033312
}