{
  "game_id": "0022000633",
  "espn_id": "401307420",
  "date": "Mar 19, 2021",
  "matchup": "BKN @ ORL",
  "headline": "Gordon's 38 points lift Magic past Nets, 121-113",
  "body": "ORLANDO, Fla. -- — The Orlando Magic shook off a tough loss on the road by coming home with their best shooting performance of the season to end a nine-game losing streak.\n\n\r\n                    Aaron Gordon scored a season-best 38 points, Evan Fournier added 31 and the Magic held off a furious fourth-quarter rally to beat the Brooklyn Nets 121-113 on Friday night.\n\n\r\n                    The Magic lost 94-93 a night earlier to the Knicks in New York. With a chance to win in the closing seconds, Fournier botched a pick-and-roll and angrily ripped his jersey apart. \n\n\r\n                    On Friday, Fournier and the Magic did little wrong while shooting 51.2% and making a season-best 21 3-pointers.\n\n\r\n                    “It was great because we showed a lot of character after a very tough loss,” said Fournier, who shot 10 of 13 and was 6 of 8 on 3s. “We fought really hard against probably the best team in the East and got the ‘W.’”\n\n\r\n                    The Magic overcame Kyrie Irving’s season-best 43 points to stop Brooklyn’s winning streak at six games. The Nets also had their franchise-record, eight-game road winning halted.\n\n\r\n                    “This is what if feels like to lose,” said Irving, whose Nets lost for the first time since Feb. 27 and for just the second time in 16 games. “We don’t want too many more feelings like this, so learn from it and move forward.”\n\n\r\n                    Orlando led 103-84 at the end of the third quarter, but the Nets opened the fourth with a 16-1 run. However, Brooklyn would get no closer than 104-100 after Gordon and Fournier revived the Magic offense. Gordon tipped in an airball to gave Orlando a 114-105 lead and his 3-pointer seconds later sealed the victory. \n\n\r\n                    “We made a bunch of shots and as (Brooklyn assistant coach) Mike D’Antoni used to say, `When you have energy you shoot the ball better,’” said Steve Clifford, whose Magic won for the first time since Feb. 21.\n\n\r\n                    Two nights after rallying from 16 points down in a win in Indiana, the Nets were trying to pull off their second-largest comeback in a victory. However, the Nets couldn’t overcome an off night by superstar guard James Harden and some sluggish play outside of Irving’s 19 of 31 shooting.\n\n\r\n                    Irving scored at least 40 points for a third time this season, but he had just seven in the fourth. Harden snapped a streak of 14 straight games with at least 20 points when he finished with 19. He made only 4 of 16 shots and 2 of 9 3s.\n\n\r\n                    Gordon was 14 of 20 and 7 of 8 on 3s to easily surpass his previous season high of 24 points. Nikola Vucevic added 22 points, 14 rebounds and eight assists.\n\n\r\n                    “That was a great all-around game for our team and we showed what we can be offensively and defensively,” Gordon said. “It shows good resilience.”\n\n\r\n                    Up two at the half, the Magic extended their lead to 103-84 by making 14 of 21 shots and 6-of-9 3s in the third period. Gordon made all five of his third-quarter shots and had 33 points by the start of the fourth.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Oddly, Brooklyn has been dominant in mid-week games (21-3), but it is just mediocre in games played on Friday, Saturday and Sunday (7-11). … Harden picked up three fouls in his first 11 minutes on the court.\n\n\r\n                    Magic: Terrence Ross, one of the NBA’s most potent scoring reserves, missed his fifth game because of a sore right knee. Orlando won for the first time when Ross doesn’t play. … Chasson Randle finished with 13 points and four 3s.\n\n\r\n                    GRIFFIN GETTING CLOSER\n\n\r\n                    While teammate Jeff Green implied that he could see Blake Griffin making his Nets’ debut in the coming days, coach Steve Nash wouldn’t commit to a timetable for the forward who signed with the franchise on March 8. Nash was highly complimentary of the work that Griffin has done to sharpen his game after being out of action since Feb. 12 when he was a member of the Detroit Pistons.\n\n\r\n                    “He looks good, he’s improving and he’s working hard off the floor, as well,” Nash said.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Host Washington on Sunday night.\n\n\r\n                    Magic: At Boston on Sunday afternoon.",
  "source": "espn_api",
  "crawled_at": 1764997490.723364
}