{
  "game_id": "0021500977",
  "espn_id": "400828864",
  "date": "Mar 12, 2016",
  "matchup": "TOR vs. MIA",
  "headline": "DeRozan scores 38 as Raptors beat Heat 112-104 in OT",
  "body": "TORONTO --  DeMar DeRozan matched his season high in points and his team won, though he wasn't entirely happy with the night.\n\n\"No, I'm more upset I missed three free throws,\" he said of his 7-for-10 performance in overtime. \"It irks me but it was a fun game tonight. We fought hard for the win and it was a great game.\"\n\nDeRozan had 38 points, 10 rebounds and seven assists as the Toronto Raptors beat the Miami Heat 112-104 on Saturday night.\n\nJonas Valanciunas added 20 points and 10 rebounds, while Kyle Lowry chipped in with 16 points for the Raptors, who secured the season series against the Heat for the second straight season, as well as a potential playoff tiebreaker should they finish with the same record.\n\nDeRozan matched his scoring total from eight days earlier against the Portland Trail Blazers.\n\n\"He played fantastic, did what he's supposed to do tonight and that's what an All-Star does,\" Lowry of his backcourt mate. \"He laid it down and he's been playing that way the whole season.\"\n\nJoe Johnson had 28 points while Luol Deng added 20 for the Heat, who have lost five of their last six games against Toronto.\n\nDeng tied it at 97 on a 3-pointer from the corner with 3.1 seconds remaining in regulation, and DeRozan's jumper before the buzzer went in and out.\n\nIn overtime, the teams traded scores until five straight trips to the free throw line, four for DeRozan and one for Bismack Biyombo, allowed the Raptors to score seven unanswered points to take a 109-101 lead with 42 seconds to play.\n\nJohnson's 3-pointer closed the gap to six points, but a pair of free throws from Cory Joseph allowed Toronto to close out the game. Miami was just 3 for 15 in overtime.\n\n\"It's tough,\" said Johnson, who lost for just the second time in eight games with Miami. \"We put ourselves in position to win that ballgame, Luol hitting the big 3 at the end of regulation to put us into overtime. We felt we had a breath of fresh air, we just couldn't come up with the big plays down the stretch.\"\n\nWhile Toronto coach Dwane Casey recognized the role that DeRozan had played in securing the Raptors' 15th victory in their last 16 home games, he chose to focus on his All-Star guard's play at the other end of the court.\n\n\"That was one of the best defensive performances he's had. Even though Joe scored 28, I thought he worked for every bit of them. DeMar carried us . He gave us one of his most solid performances since I've been here, so hats off to him.\"\n\nBIG IMPACT\n\nValanciunas recorded his team-leading 18th double-double, and has now scored in double figures in a career-high 17 consecutive games.\n\nDEPRESSURIZED HEAT\n\nJohnson thinks the Heat's balance will keep opponents guessing.\n\n\"I think we're an unpredictable team as far as who is going to score the basketball,\" he said. \"We're not predictable in who is going to have a big night. We have a lot of guys that are very versatile that can make plays offensively and defensively so I think it takes the pressure off everybody.\"\n\nTIP-INS\n\nHeat: Dwyane Wade (thigh) sat out Saturday's game. Coach Erik Spoelstra says his shooting guard just needs some rest after \"laboring\" through almost 31 minutes in Friday night's win in Chicago. The Heat are now 4-2 this season when he doesn't play. . The Heat scored at least 100 points for the seventh straight game. . Spoelstra was wary of the threat posed by Toronto's All-Star backcourt of Lowry and DeRozan. \"The No. 1 thing that's tough about them is keeping them off the free throw line,\" he said. \"Every single team that comes into this building says you've got to keep them off the line and keep them from the easy ones. That's a whole lot easier said than done.\" The pair went a combined 18-for-21.\n\nRaptors: Toronto wore its black-and-gold uniforms inspired by Canadian rapper Drake on Saturday. The Raptors now have a 6-1 record when they wear the alternate uniforms. . With two steals in the game, Lowry surpassed Alvin Williams (135) for the fourth on the team's single-season list. Lowry now has 136 this season. . Coach Dwane Casey said forward DeMarre Carroll, who has missed the last 28 games after undergoing right knee surgery, went for a check-up last week in New York, but insisted there was no timetable with regards to his return.\n\nUP NEXT\n\nHeat: Host Denver on Monday.\n\nRaptors: Host Chicago on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994703.110888
}