{
  "game_id": "0021600822",
  "espn_id": "400900227",
  "date": "Feb 13, 2017",
  "matchup": "MEM @ BKN",
  "headline": "Conley, Gasol help Grizzlies send Nets to 13th straight loss",
  "body": "NEW YORK -- Mike Conley ended the Nets' hopes of a comeback.\nConley scored 32 points, including 11 in the last four minutes, and Marc Gasol had 19 points, nine rebounds and eight assists as the Memphis Grizzlies beat the hapless Brooklyn 112-103 on Monday night.\n\"Take over, and I love that. He (Conley) or Marc Gasol, or both at any time,\" Grizzlies coach David Fizdale said. \"Their light is super green to take the game over.\"\nBrandan Wright added 17 points and Vince Carter had 14 as the Grizzlies won for the fourth time in their last five games.\nBrook Lopez and Spencer Dinwiddie each had 17 points as the Nets lost their 13th straight overall and 15th straight at home to set a new franchise record for futility.\nThe Nets had trimmed the Grizzlies' 16-point lead to 99-92 on Rondae Hollis-Jefferson's dunk with 3:55 left. However, Conley scored Memphis' next nine points and then the final two to clinch the victory.\n\"It was a great win in the sense that these are not easy games to play when you come into a building knowing they lost a few in a row, and it was a trap game in a sense going into the All-Star break,\" Conley said. \"Everybody can be a little unfocused, and for us to come in with the right mindset and do the right things like a veteran team should, to come out with the win was great.\"\nThe Grizzlies closed the first quarter on a 10-0 run and took the lead for good. They scored seven straight in the second quarter and took a 52-42 lead into halftime.\nMemphis pushed it to 70-55 on JaMychal Green's jumper with 5:58 left in the period. The Grizzlies led 79-72 after three and Brooklyn got no closer than five again.\nGreen finished with 10 points.\nSean Kilpatrick added 15 points for Brooklyn and Trevor Booker and Hollis-Jefferson each had 13.\n\"They're an excellent team,\" said Nets coach Kenny Atkinson. \"Conley really gave us some issues. It felt like he got downhill on us and was making plays at the end.\"\nTIP-INS:\nGrizzlies: Starter Tony Allen did not play because of a \"planned recovery day,\" according to the team. James Ennis III started in his place. . Memphis is 16-13 on the road this season, but only 5-7 against Eastern Conference teams. ... The Grizzlies own the third-longest active streak among all NBA teams with six consecutive winning seasons and playoff appearances. Only the Spurs (20 straight) and Hawks (9) have longer streaks.\nNets: Brooklyn has lost to the Grizzlies five straight times. The Nets have not won a game in the series since March 5, 2014, a 103-94 victory in Brooklyn. ... Dinwiddie's 17 points were a season high.\nMEMPHIS MOTIVATION\nBefore the game, Fizdale wanted to make sure his team was ready to play against the worst team in the NBA. \"I talk a lot about empathizing with a team that's struggling,\" he said. \"I try to present scenarios like we're making this a Game 6 on the road that extends our season. I want our guys thinking like that.\"\nBARCLAYS BUMMER\nThe Nets' 15 straight home losses are a new franchise record. The New Jersey Nets lost 14 straight at home during the 2009-10 season. Brooklyn has not won at home since Dec. 26 against the Hornets (120-118).\nGRIZZLIED VETERAN\nCarter, who turned 40 on Jan. 26, is the oldest player in the NBA. Now in his third year with the Grizzlies, Carter was a member of the New Jersey Nets for five seasons (2004-09). He is still third on the franchise's scoring list (8,834 points), right behind Lopez (9,928).\nUP NEXT\nGrizzlies: Memphis hosts New Orleans on Wednesday. The Grizzlies have won both meetings this season, both in overtime.\nNets: Brooklyn hosts Milwaukee on Wednesday. The teams have already met three times this season, with the Bucks winning each one. Milwaukee has won the last seven meetings in the series. The Nets' last victory came on March 20, 2015, a 129-127 triple-overtime affair",
  "source": "espn_api",
  "crawled_at": 1764995584.915691
}