{
  "game_id": "0022301165",
  "espn_id": "401585793",
  "date": "Apr 10, 2024",
  "matchup": "LAC vs. PHX",
  "headline": "Suns rally in 4th to beat Clippers 124-108 to split home-and-home set after blowout loss",
  "body": "LOS ANGELES -- — Devin Booker scored 37 points, Bradley Beal added 26 and the Phoenix Suns rallied in the fourth quarter to beat the Los Angeles Clippers 124-108 on Wednesday night.\n\n\r\n              The victory was payback for the Suns after they were embarrassed in the first quarter the previous night in Phoenix. That’s when the Clippers led 35-4 and went ahead by 37 in the second quarter before the Suns got close only to lose 105-92.\n\n\r\n              “Around this time of the year you’re just trying to win games regardless of the context involved,” said Kevin Durant, who added 24 points and nine rebounds for Phoenix.\n\n\r\n              The result Wednesday locked Golden State and Los Angeles Lakers into the play-in tournament. The Suns are seventh in the West, a half-game behind New Orleans for the sixth and final guaranteed playoff spot.\n\n\r\n              “We’ve been preaching with the play-in that all these games are already playoff games,” Booker said. “It’s going to be high intensity, if you lose it’s going to be the worst loss ever. If you win, good win.”\n\n\r\n              The Suns ran off 13 in a row to go up 114-106, part of a game-ending 23-2 outburst. The Clippers went completely cold, watching shots bounce off the rim or spin and go out.\n\n\r\n              “I liked how organized we were in the fourth quarter and the commitment to get stops,” Suns coach Frank Vogel said. “We knew if we just stayed together and stayed with it we would prevail.”\n\n\r\n              Bones Hyland scored a career-high 37 points, making six 3-pointers, to go with nine assists for the Clippers, who had won four in a row and seven of eight. Brandon Boston Jr. added 23 points off the bench in a game that featured 22 lead changes and 10 ties.\n\n\r\n              “I like what we did in the fourth quarter in not letting him touch the ball as much,” Durant said about Hyland. “He’s a quick player, man, you got to give him credit. Hopefully, Bones gets an opportunity in this league to showcase how good of a player he is every night.\"\n\n\r\n              The Clippers, who already won the Pacific Division for the first time in 10 years, could have secured the fourth seed in the West with a win. They know their first-round playoff opponent will be Dallas, which beat Miami earlier Wednesday to set up the matchup.\n\n\r\n              “Down the stretch the game got away and we couldn't make a shot,” Clippers coach Tyronn Lue said. “I think the guys got tired.”\n\n\r\n              The Clippers started their second unit while Kawhi Leonard (knee), Paul George (knee), James Harden (foot) and Ivica Zubac (ankle) along with reserve Russell Westbrook (hand) had the night off. Leonard missed his sixth straight game.\n\n\r\n              The teams each scored 37 points in the third, with Amir Coffey scoring five in a row to send the Clippers into the fourth leading 93-92. Hyland hit back-to-back 3s, the second one off his own steal, early in the third.\n\n\r\n              Hyland scored 24 points in the first half, making 10 of 12 field goals and all four of his 3-pointers, to put the Clippers ahead 56-55 at the break.\n\n\r\n              The Suns outscored the Clippers 23-9 to open the second and take a 15-point lead. But Hyland had nine points in a 20-4 run, hitting a 3-pointer at the buzzer, to close the half.\n\n\r\n              Jusuf Nurkic returned for the Suns after sitting out Tuesday because of a right ankle sprain. He had three points, 19 rebounds and 10 assists to help Phoenix win for the first time in four games with the Clippers this season.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Sacramento on Friday night. \n\n\r\n              Clippers: Host Utah on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996529.558542
}