{
  "game_id": "401810212",
  "espn_id": "401810212",
  "date": "Dec 07, 2025",
  "matchup": "NY vs ORL",
  "headline": "New York plays Orlando, seeks 6th straight home win",
  "body": "Orlando Magic (14-9, fourth in the Eastern Conference) vs. New York Knicks (15-7, second in the Eastern Conference)\n\n\r\n              New York; Sunday, 12 p.m. EST\n\n\r\n              BOTTOM LINE: New York will try to keep its five-game home win streak alive when the Knicks face Orlando.\n\n\r\n              The Knicks are 11-7 against conference opponents. New York is second in the Eastern Conference at limiting opponent scoring, giving up only 113.0 points while holding opponents to 46.4% shooting.\n\n\r\n              The Magic are 11-7 against Eastern Conference opponents. Orlando ranks third in the NBA scoring 54.7 points per game in the paint led by Franz Wagner averaging 12.2.\n\n\r\n              The Knicks average 15.6 made 3-pointers per game this season, 3.9 more made shots on average than the 11.7 per game the Magic allow. The Magic are shooting 47.3% from the field, 0.9% higher than the 46.4% the Knicks' opponents have shot this season.\n\n\r\n              The teams meet for the third time this season. The Magic won 133-121 in the last matchup on Nov. 22.\n\n\r\n              TOP PERFORMERS: Karl-Anthony Towns is averaging 22.5 points, 11.9 rebounds and 3.4 assists for the Knicks. Miles McBride is averaging 7.0 made 3-pointers over the last 10 games.\n\n\r\n              Wagner is averaging 23.4 points, 6.2 rebounds and 3.8 assists for the Magic. Jalen Suggs is averaging 4.0 made 3-pointers over the last 10 games.\n\n\r\n              LAST 10 GAMES: Knicks: 7-3, averaging 120.5 points, 44.5 rebounds, 27.1 assists, 8.0 steals and 4.6 blocks per game while shooting 49.7% from the field. Their opponents have averaged 110.2 points per game.\n\n\r\n              Magic: 7-3, averaging 122.4 points, 43.9 rebounds, 27.0 assists, 9.8 steals and 5.0 blocks per game while shooting 47.4% from the field. Their opponents have averaged 114.1 points.\n\n\r\n              INJURIES: Knicks: Landry Shamet: out (shoulder).\n\n\r\n              Magic: Moritz Wagner: out (knee).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042770.2050052
}