{
  "game_id": "0022300340",
  "espn_id": "401584968",
  "date": "Dec 16, 2023",
  "matchup": "DEN vs. OKC",
  "headline": "Gilgeous-Alexander makes winning jumper with a second left as Thunder edge Nuggets 118-117",
  "body": "DENVER -- — Shai Gilgeous-Alexander hit a turnaround jumper with a second left, and the Oklahoma City Thunder rallied to beat the Denver Nuggets 118-117 on Saturday night.\n\n\r\n              Jalen Williams scored 24 points and rookie Chet Holmgren had 17 points, 11 rebounds and a career-best nine blocks for the Thunder. His previous high in blocks was seven, which came against Cleveland in his second NBA game.\n\n\r\n              “If I didn’t let Jamal Murray dunk on me in the first quarter I would have gotten the 10,” Holmgren said.\n\n\r\n              Nikola Jokic had 24 points and 12 assists and Michael Porter Jr. scored 20 points, but it wasn’t enough for the Nuggets, who played without guard Kentavious Caldwell-Pope (concussion protocol).\n\n\r\n              Denver had its three-game winning streak snapped and lost for just the second time in 12 home games, both of which have come in the last three games at Ball Arena.\n\n\r\n              “I’m disappointed,” coach Michael Malone said. “That’s a game we should have won. If we take care of the ball and we get a few stops, we win that game.”\n\n\r\n              The Nuggets led 111-103 with 3:33 left but a 9-2 run, capped by an alley-oop dunk by Holmgren, made it a one-point game with 1:38 remaining.\n\n\r\n              Porter hit a 20-footer, Gilgeous-Alexander made two free throws and Murray’s step-back jumper gave Denver a 117-114 lead with 43 seconds left.\n\n\r\n              Williams made a driving layup, Jokic missed a 3-pointer, Gilgeous-Alexander grabbed the rebound with 8 seconds left and then capped the rally with his turnaround jumper over Peyton Watson. The Nuggets’ entry pass was tipped to seal the win.\n\n\r\n              “I tried not to race the ball up the floor too fast, tried to take a little time off the clock and shoot at the last second,” Gilgeous-Alexander said of the last play. “I just tried to get to something that I shot many times, something I was comfortable shooting.”\n\n\r\n              Denver won the first meeting by 33 points in Oklahoma City on Oct. 29. Gilgeous-Alexander, who had 43 points in a loss at Sacramento on Thursday night, scored a season-low seven points in that game and was held to seven in the first half Saturday night. He scored 11 points in the fourth quarter.\n\n\r\n              Murray finished with 15 points and Christian Braun had 14 for the Nuggets.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host the Memphis Grizzlies on Monday night.\n\n\r\n              Nuggets: Host the Dallas Mavericks on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764996811.742553
}