{
  "game_id": "0021600400",
  "espn_id": "400899842",
  "date": "Dec 17, 2016",
  "matchup": "DET vs. IND",
  "headline": "George, Pacers beat Pistons 105-90",
  "body": "AUBURN HILLS, Mich. --  The Indiana Pacers hope a renewed emphasis on defense will help turn their season around.\n\nPaul George scored 26 points and Indiana held Detroit to 38 percent shooting in a 105-90 win over the Pistons on Saturday.\n\n\"We've got to be a consistent and well-coached defensive team,\" said George, who also had seven rebounds and two steals. \"It's the consistency that we have to match every night.\"\n\nJeff Teague had 19 points, nine rebounds and eight assists for the Pacers, who snapped a two-game losing streak and beat the Pistons for the third straight time. Glenn Robinson III added 12 points and 12 rebounds, and Thaddeus Young also scored 12 points on 6-for-8 shooting.\n\nIndiana had six players score in double figures and shot 48 percent from the field. But it was near the bottom of the NBA in scoring defense coming into the day, so it was its work on that side of the court that was so encouraging for George and company.\n\n\"Offensively, we'll make shots,\" George said. \"But defensively, that's got to be us.\"\n\nKentavious Caldwell-Pope had 20 points for Detroit, and Reggie Jackson finished with 19 points and 10 assists. Tobias Harris added 13 points, and Andre Drummond grabbed 15 rebounds.\n\nThe Pistons have lost three of their last four games, dropping into last place in the Central Division in the Eastern Conference.\n\n\"We're not in a good place right now,\" Pistons coach Stan Van Gundy said. \"We have to get it back together.\"\n\nDetroit jumped out to an early nine-point lead, but George hit a 3-pointer to help Indiana to a 27-26 lead after one.\n\nThe Pacers kept up the pressure in the second quarter and led 55-44 at the break. George and Teague each scored 14 in the first half.\n\nIndiana opened a 64-45 lead on Teague's jumper in the third. Detroit cut the deficit to 11 late in the period, but George's 3-pointer gave Indiana an 83-69 advantage heading to the fourth.\n\n\"We always want to be aggressive attacking the basket,\" Pacers coach Nate McMillan said. \"If your attack forces them to commit to the ball, then you move the ball, it's a simple basketball game.\"\n\nTIP-INS\n\nPacers: Rodney Stuckey (sore left hamstring) and Monte Ellis (right groin strain) did not play. ... Indiana improved to 7-2 in its last nine games at the Palace. ... The Pacers entered Saturday allowing their opponents to average 106.4 points per game.\n\nPistons: Detroit allowed an opponent to score more than 100 points at the Palace for the first time this season, snapping a 12-game streak. It was the Pistons' longest such stretch to begin a season since 2003-04. \"We've been a pretty good defensive team throughout the season,\" Jackson said. \"We just haven't been good as of late.\" ... Detroit is 8-5 at home after starting the season 5-0.\n\nCONNECTIONS\n\nRobinson III played college ball at Michigan from 2012-14. ... Stuckey was a first-round draft pick of the Pistons in 2007 and played with Detroit through 2014. ... Pistons assistant coach Tim Hardaway played with Indiana in 2002-03.\n\nUP NEXT\n\nPacers: At home Monday vs. Washington.\n\nPistons: At Chicago on Monday.",
  "source": "espn_api",
  "crawled_at": 1764996068.728069
}