{
  "game_id": "0021600341",
  "espn_id": "400899783",
  "date": "Dec 09, 2016",
  "matchup": "OKC vs. HOU",
  "headline": "Rockets overcome Westbrook's 7th straight triple-double",
  "body": "OKLAHOMA CITY --  Patrick Beverley savored getting the best of his rival, Russell Westbrook.\n\nDespite a seventh straight triple-double for Westbrook, Beverley and the Houston Rockets beat the Oklahoma City Thunder 102-99 on Friday night.\n\nBeverley's history with Westbrook goes back to the 2013 playoffs, when Beverley went after the ball while Westbrook called a timeout. Beverley crashed into Westbrook's knee, and the star guard missed the rest of the postseason with a knee injury.\n\nAs usual, the Oklahoma City crowd greeted Beverley with boos during pregame introductions Friday.\n\nWestbrook finished with 27 points, 10 rebounds and 10 assists, but Beverley helped harass him into shooting just 8 for 25.\n\n\"I won't say what I want to say, but yeah, we tried to show bodies and force him into a crowd and make it tough for him,\" Beverley said.\n\nWestbrook gave Beverley no credit.\n\n\"I missed a lot of easy shots, man. Honestly, brother,\" Westbrook said.\n\nWith the Thunder down one in the closing seconds, Westbrook had a chance to give Oklahoma City the lead. Beverley was guarding Westbrook with five fouls, but he settled for a 3-pointer and missed.\n\n\"He's a really, really, really, really, really, really, really, really, really good player,\" Beverley said. \"We were fortunate to come up with a stop.\"\n\nAfter Westbrook's missed 3, Houston's Trevor Ariza got the rebound, was fouled and made both free throws with 5.8 seconds left. Oklahoma City's Anthony Morrow then missed a 3 that would have tied the game.\n\nJames Harden had 21 points, 12 assists and nine rebounds to help the Rockets win their fifth straight. Houston withstood Harden's 6-for-23 shooting effort.\n\nWestbrook owns the longest triple-double streak since Michael Jordan had seven straight in 1989. The NBA record is nine in a row by Philadelphia's Wilt Chamberlain in March 1968.\n\nIt was Westbrook's 12th triple-double this season and the 49th of his career. He is the NBA's active leader in the category and ranks sixth all-time.\n\nThe Thunder had won the previous six games during Westbrook's triple-double binge.\n\nThe Rockets led by as many as 13 points in the third quarter and took an 86-77 lead into the fourth.\n\nWestbrook rested to start the fourth, then re-entered with 8:37 remaining while Clint Capela was at the free throw line. The Thunder trailed by 12 when Westbrook rebounded Capela's miss, and he gave his team a chance.\n\nWith Houston leading 94-90, Westbrook stole the ball and Ryan Anderson was called for a clear path foul, giving Westbrook two free throws and the Thunder the ball. Westbrook made the free throws, but he missed a fadeaway on the extra possession, and Harden scored on the other end. Oklahoma City got as close as a point, but never took the lead.\n\n\"Ball just didn't go in,\" Thunder forward Andre Roberson said. \"Ball just didn't go our way. You have to live with it and go onto the next.\"\n\nTIP-INS\n\nRockets: Shot 9 for 28 in the first quarter, yet led 25-23. ... Made 11 of 42 3-pointers. ... Made just 19 of 30 free throws. ... Starting backcourt of Beverley and Harden combined to shoot 7 of 31.\n\nThunder: Committed seven turnovers in the first quarter that led to 10 Rockets points. ... Thunder coach Billy Donovan was called for a technical foul in the second quarter after a no-call against Beverley. ... Steven Adams' 17 points in the first half were a career high for a half. He finished with a career-best 24.\n\nQUOTABLE\n\nBeverley, on Westbrook: \"The man is a walking triple-double. He's not frustrated about that. He's probably frustrated about the loss, of course, but he has been playing well.\"\n\nSTAT LINES\n\nWestbrook got a triple-double, yet his averages dropped slightly in each category. His averages are now 30.9 points, 10.8 rebounds and 11.3 assists. His assist average fell from 11.31 to 11.26.\n\nUP NEXT\n\nThe Rockets host the Dallas Mavericks on Saturday.\n\nThe Thunder host the Boston Celtics on Sunday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995313.0701828
}