{
  "game_id": "401810203",
  "espn_id": "401810203",
  "date": "Dec 05, 2025",
  "matchup": "MIL vs PHI",
  "headline": "Big night from bench players helps 76ers beat Bucks 116-101",
  "body": "MILWAUKEE -- — Quentin Grimes scored 22 points to lead a productive performance from Philadelphia's bench as the 76ers beat the Milwaukee Bucks 116-101 on Friday night.\n\n\r\n              Paul George added 20 points and Jabari Walker had a season-high 18 off the bench as the 76ers won for a second straight night after beating the Golden State Warriors 99-98 on Thursday.\n\n\r\n              Philadelphia's reserves scored 61 points to make up for the fact Milwaukee limited Tyrese Maxey to a season-low 12 points.\n\n\r\n              Neither team had its former league MVP on the floor.\n\n\r\n              Milwaukee’s Giannis Antetokounmpo was out after straining his right calf in the first few minutes of a 113-109 victory over Detroit on Wednesday. With the 76ers playing for a second straight night, Philadelphia rested Joel Embiid.\n\n\r\n              Bucks coach Doc Rivers said before Friday’s game that he anticipates Antetokounmpo will miss about four weeks.\n\n\r\n              Milwaukee’s AJ Green left with a bruised shoulder in the second quarter.\n\n\r\n              Bobby Portis scored 22 points, Kevin Porter Jr. 20 and Myles Turner 19 for the Bucks.\n\n\r\n              It was tied until the 76ers began a 15-2 run that started about seven minutes into the game and put Philadelphia ahead 28-15. Jared McCain sank a pair of 3-pointers during that spurt.\n\n\r\n              Philadelphia stayed ahead the rest of the way and led by as many as 26 in the second quarter.\n\n\r\n              Milwaukee got the margin down to single digits for the first time since the first quarter when Portis hit a corner 3-pointer to cut Philadelphia’s lead to 103-94 with 4:16 left.\n\n\r\n              After Ryan Rollins got a steal on Philadelphia’s ensuing possession, the ball went back to Portis, who drove to the basket but couldn’t finish. Maxey made a basket with 3:45 remaining, and the 76ers maintained a double-figure edge the rest of the way.\n\n\r\n              Up next\r\n              76ers: Host the Los Angeles Lakers on Sunday night.\n\n\r\n              Bucks: At Detroit on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042762.7344608
}