{
  "game_id": "0021600079",
  "espn_id": "400899529",
  "date": "Nov 05, 2016",
  "matchup": "OKC vs. MIN",
  "headline": "Westbrook scores 28, leads Thunder past Timberwolves, 112-92",
  "body": "OKLAHOMA CITY --  The Thunder showed no lingering effects from their emotional loss at Golden State.\n\nRussell Westbrook scored 28 points to help Oklahoma City beat the Minnesota Timberwolves 112-92 on Saturday night.\n\nEnes Kanter had 20 points and 10 rebounds, Steven Adams scored 14 points and Victor Oladipo added 12 for the Thunder in their first game since being blown out by Golden State and former teammate Kevin Durant on Thursday.\n\n\"We'll take something from that game to help us learn going forward,\" Thunder coach Billy Donovan said. \"And it was all about us tonight. It was all about what we need to do, how we needed to play defensively, how we needed to play offensively.\"\n\nWestbrook also had eight assists and six rebounds. The Thunder improved to 5-1 on the season, matching their best six-game start since moving to Oklahoma City for the 2008-09 season.\n\nThe Thunder shot 52 percent from the field and held the Timberwolves to 39 percent shooting.\n\n\"You have to make plays,\" Minnesota coach Tom Thibodeau said. \"You have to move the ball side to side, and when we did that, we got good looks at the basket.\"\n\nKarl-Anthony Towns scored 33 points for the Timberwolves after scoring 32 Thursday night against Denver. He scored 25 points in the first half, but Westbrook countered with 18 to help the Thunder take a 59-53 lead into the break.\n\n\"Towns, he really played exceptionally well in the first half, and he made a lot of shots,\" Donovan said. \"He did it in a lot of different ways. He made 3s, he had post moves, he had face-ups. He had everything. He's a terrific offensive player.\"\n\nNo Minnesota player other than Towns reached double figures until the fourth quarter.\n\nThe Timberwolves hung close for the early part of the third before the Thunder took over.\n\nAn 11-0 run, sparked by a 3-pointer by Westbrook, then a steal and dunk by Westbrook, made it 79-61 and led to a Minnesota timeout. Jerami Grant's two-handed dunk put Oklahoma City up 83-62, and the Thunder led 90-72 at the end of the third quarter.\n\nThe Thunder held the Timberwolves to 30 percent shooting in the third quarter.\n\n\"We just turned it up a notch,\" Oladipo said. \"Now, we have to do that for four quarters. When we play like that defensively, we give ourselves a great chance to win.\"\n\nThe long runs by opponents have been a recurring issue for the Timberwolves.\n\n\"It's a problem,\" Thibodeau said. \"The only thing we can do is take a look at the film, try to get some work in, try to make the corrections.\"\n\n---\n\nTIP-INS\n\nTimberwolves: Towns scored 13 points on 6-for-9 shooting in the first quarter, while his teammates shot 5 for 15 and scored 12. ... Rookie point guard Kris Dunn, who started in place of the injured Ricky Rubio, finished with seven points, four rebounds and three assists in 29 minutes. Rubio is out indefinitely with a sprained right elbow.\n\nThunder: Shot 63.6 percent in the first quarter to lead 32-25.  ... Westbrook had six assists in the first quarter. ... Westbrook was called for a technical foul early in the third quarter.\n\nSHUTDOWN DEFENSE\n\nMinnesota's top two scorers got nowhere. Andrew Wiggins, who entered the game averaging 24 points, scored seven points on 3-for-13 shooting. Zach LaVine, who was averaging 21.3 points, finished with just four on 1-for-6 shooting. Andre Roberson and Oladipo were largely responsible for defending them.\n\nLONG DISTANCE\n\nTony Juarez of Oklahoma City won $20,000 from Mid-First Bank when he made a halfcourt shot during a timeout in the third quarter. According to the Thunder, it was the 10th time someone made the shot since the team moved to Oklahoma City in 2008, and the first since Dec. 13, 2015.\n\nThe 22-year-old Juarez told a Thunder spokesman he would use the money for school. He called his mother in El Paso right after stepping off the court.\n\nUP NEXT\n\nThe Timberwolves play at the Brooklyn Nets on Tuesday night.\n\nThe Thunder host the Miami Heat on Monday night.\n\n---\n\nFollow Cliff Brunt on Twitter (at)CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995338.5753942
}