{
  "game_id": "0022300760",
  "espn_id": "401585388",
  "date": "Feb 11, 2024",
  "matchup": "SAC @ OKC",
  "headline": "Shai Gilgeous-Alexander's 38 points lead Thunder past Kings 127-113",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had 38 points, Jalen Williams scored 32 and the Oklahoma City Thunder beat the Sacramento Kings 127-113 on Sunday.\n\n\r\n              Gilgeous-Alexander made 15 of 26 shots and had seven assists and Williams made 13 of 20 shots and had nine assists and eight rebounds for the Thunder. Oklahoma City beat the Kings for the first time in three meetings this season.\n\n\r\n              “SGA (Gilgeous-Alexander) played like an MVP candidate,” Kings coach Mike Brown said. “We threw the kitchen sink at him and he still scored 38. And then Jalen Williams was really, really big. And I say he’s big because he had 32 but he was extremely efficient throughout the course of the night.”\n\n\r\n              Lu Dort had 17 points and nine rebounds and Chet Holmgren added 14 points for the Thunder, who scored 30 points off 18 Kings turnovers.\n\n\r\n              Oklahoma City bounced back from a 146-111 loss at Dallas on Saturday.\n\n\r\n              “I thought we were just a lot more edgy today than we were yesterday,\" Thunder coach Mark Daigneault said. \"And I thought the guys, it’s not about responding to one game, but it certainly is about us recognizing where our standards are and getting the car back on the road when we’re not up to par. And I thought the guys did a great job of that today.”\n\n\r\n              Domantas Sabonis had 21 points, 14 assists and 11 rebounds for the Kings, his second consecutive triple-double and his fourth in six games this month. It was his 17th triple-double of the season and 49th of his career.\n\n\r\n              Malik Monk led the Kings with 26 points.\n\n\r\n              De'Aaron Fox, who was averaging nearly 27 points per game, was held to 15 points on 6-for-17 shooting for the Kings.\n\n\r\n              “I thought Lu did a good job on him, in the first half, especially,\" Daigneault said. \"We got him, really under control there. He has gotten loose against us. He’s shot the ball incredibly well this season. … He’s given us trouble obviously in the past, but I thought we did a good job on him today — Lu, and then everybody else in the help.”\n\n\r\n              Gilgeous-Alexander, the league's No. 2 scorer with 31 points per game heading into the day, scored 15 points in the first quarter on 6-for-8 shooting. Gilgeous-Alexander and Williams each scored 19 points to help the Thunder take a 67-57 lead at halftime.\n\n\r\n              The Thunder controlled the third. A 3-pointer by Dort, then a dunk by Williams pushed Oklahoma City's lead to 84-66. Gilgeous-Alexander's hard dribble left Harrison Barnes going the wrong way, then Gilgeous-Alexander stepped toward the baseline and hit a short jumper to make it 88-66. It was the final basket of a 16-0 run. The Thunder led 100-83 heading into the fourth.\n\n\r\n              The Kings cut their deficit to eight in the fourth, but the Thunder maintained control. A 3-pointer by Gilgeous-Alexander with just under four minutes remaining put the Thunder up 121-108.\n\n\r\n              “We came out really good today,” Gilgeous-Alexander said. “I think it set the tone for the rest of the night. We were playing to our identity from the jump.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: Visit Phoenix on Tuesday night.\n\n\r\n              Thunder: Visit Orlando on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996786.917193
}