{
  "game_id": "0022000799",
  "espn_id": "401307592",
  "date": "Apr 09, 2021",
  "matchup": "LAC vs. HOU",
  "headline": "Leonard scores 31 as Clippers extend winning streak to 4",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 31 points, Reggie Jackson added 26 and the Los Angeles Clippers used a dominating second quarter Friday night to defeat the Houston Rockets 126-109 and extend their winning streak to four games.\n\n\r\n                    The short handed Clippers, who were missing All-Star Paul George, trailed by 10 at the end of the first quarter and found themselves down 40-26 with 9:57 remaining in the second before outscoring the Rockets 41-6 the remainder of the period.\n\n\r\n                    Leonard scored 11 and Jackson connected on three of his career-tying six 3-pointers during the quarter to give Los Angeles a 67-46 advantage at the break. The Clippers were 15 of 21 from the field during the quarter while the Rockets missed 14 of 15 after making their first two shots.\n\n\r\n                    “To hold a team in the NBA to 10 points, that’s a good quarter,” Clippers coach Tyronn Lue said. “I'm proud of our guys. We could have had a letdown (after a win over Phoenix on Thursday). We got off to a slow start, but we are finding ways to win when we have guys out.”\n\n\r\n                    The Clippers said the 31-point quarter differential is tied for the second-largest in team history and the largest since they outscored the Lakers by 31 in the second quarter of a March 2014 game.\n\n\r\n                    “We wanted to move the ball, share it,\" Leonard said. \"There’s going to be more focus on me, so I got to make sure I start that as a leader of the team and just sharing it early. And then just take it from there.”\n\n\r\n                    According to Sportradar, which has quarter point differentials since 1996, it is the most the Rockets have been outscored in the second quarter and the second-most in any quarter. they were outscored by 32 (46-14) in the first quarter against Miami last season.\n\n\r\n                    The Rockets worked their way back throughout the second half. They pulled within 11 at the end of the third quarter and had their deficit cut down to five (104-99) on Sterling Brown's 3-pointer but could not draw closer as the Clippers responded with a 16-2 run, which included eight points by Leonard.\n\n\r\n                    Christian Wood led Houston with 23 points and Jae’Sean Tate scored 18.\n\n\r\n                    Rockets coach Stephen Silas was happy with the way his team responded in the second half after one of their worst 10-minute stretches of the season.\n\n\r\n                    “If we gotten down and had a quarter like that earlier in the season, we would not have fought back,” he said. “We need to learn that when teams pick up the pressure like the Clippers did defensively, we can’t become passive. We have to meet force with force.”\n\n\r\n                    MORE INJURIES\n\n\r\n                    The Clippers announced before the game that guard Patrick Beverley broke his left hand in Thursday's win over Phoenix and will be out for at least four weeks after undergoing surgery. \n\n\r\n                    George, who has had two straight 30-point games, sat out the second game of a back-to-back set as he has been dealing with a lingering toe injury. Rajon Rondo has seen his minutes limited as he comes back from an adductor injury. Center Serge Ibaka (back) missed his 14th straight. \n\n\r\n                    TIP INS\n\n\r\n                    Rockets: Kevin Porter had 14 points and a career-high 12 assists for his second double-double. ... Kelly Olynyk (13 points, 11 rebounds) has scored in double-figures in each of his eight games with Houston. ... Eric Gordon (right groin strain) did some shooting drills before the game, but Silas did not have a timetable on his return.\n\n\r\n                    Clippers: LA is 9-1 when playing on the second night of a back-to-back. ... Nicolas Batum's 17 points were the most he has had in a game since scoring 16 against Boston on Feb. 5. ... Terance Mann, who scored 16 points, tied a career high with nine assists. ... Jackson tied his career high for 3-pointers made in a half with five. ... The 10 points allowed in the second were the fewest in a quarter since last season when LA gave up 10 in the final 12 minutes against Toronto.\n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: Continue their road trip at Golden State on Saturday.\n\n\r\n                    Clippers: Conclude their nine-game homestand against Detroit on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997671.948103
}