{
  "game_id": "0021600401",
  "espn_id": "400899843",
  "date": "Dec 17, 2016",
  "matchup": "CHA @ ATL",
  "headline": "Williams, Belinelli give Hornets edge over Hawks",
  "body": "ATLANTA --  Cody Zeller couldn't bear the thought of another road loss.\n\n\"We needed this one to finish the road trip,\" he said. \"It's been a tough, long road trip for us, but I think it says a lot about our team that we came in here and competed and won a close game.\"\n\nMarvin Williams and Marco Belinelli each scored 19 points, and the Charlotte Hornets snapped a four-game skid with a 107-99 victory over the Atlanta Hawks on Saturday night.\n\nKemba Walker had 18 points and 10 assists for Charlotte, which grabbed control with a big second quarter. Zeller finished with 16 points and 11 rebounds.\n\nTim Hardaway Jr. had 21 points for Atlanta, and Paul Millsap scored 14 of his 20 points in the third quarter. Dwight Howard grabbed a season-high 23 rebounds, three shy of his career best.\n\nThe Hawks have lost five of six at home and 12 of 16 overall, a freefall since starting the season 9-2 and tying for the Eastern Conference lead.\n\n\"It's frustrating,\" Atlanta coach Mike Budenholzer said. \"We're all competitive. We want to win.\"\n\nMillsap's 15-foot jumper gave the Hawks a 95-94 lead with 3:51 remaining, but Belinelli answered with a layup, and the Hornets never trailed again. Williams ended the last trace of a threat, hitting a 3-pointer with 27.8 seconds left to make it a five-point game. Walker set him up with a perfect bounce pass.\n\n\"The whole game plan was to try to contain Kemba,\" Millsap said. \"Those other guys got free. Give them credit. They ran their offense and they hit some tough shots.\"\n\nCharlotte ended its five-game road trip, all against Eastern opponents, with a much-needed win. The Hornets started the first quarter 4 of 16, but went on a 30-10 run to take a 12-point lead as the Hawks went cold in the second.\n\nAtlanta went on a 13-1 run to pull within four midway through the third, and Hardaway hit a pair of free throws with 7:41 remaining to make it 87-86 for Atlanta's first lead since the final minute of the first.\n\nHoward and Zeller then had a minor scrape that resulted in technical fouls on both players, and the Hawks lost momentum.\n\nTIP-INS\n\nHornets: Walker returned after having an excused absence for a personal matter and missing Friday's loss to the Celtics. He has scored in double figures in each of his 27 games. ... The Hornets had lost five straight and 10 of 11 at Philips Arena.\n\nHawks: Hardaway started his fifth straight game for Kent Bazemore, who recently missed two games with a knee injury. Bazemore had 17 points, five rebounds and four assists in 30 minutes in his longest time on the court since returning two games ago.\n\nSAGER TRIBUTE\n\nThe Hawks had a moment of silence before the game for Turner Sports personality Craig Sager, a longtime Atlanta resident who died of leukemia Thursday in his adopted hometown. Sager, an NBA sideline reporter known for his outrageous sport coats and ties, was honored with \"Amazing Grace\" on bagpipes and players standing on the court with the house lights down.\n\nUP NEXT\n\nHornets: Host the Los Angeles Lakers on Tuesday.\n\nHawks: Visit Oklahoma City on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995519.694304
}