{
  "game_id": "0022300590",
  "espn_id": "401585218",
  "date": "Jan 19, 2024",
  "matchup": "POR vs. IND",
  "headline": "Grant scores 37 points and Trail Blazers down Pacers 118-115 to spoil Siakam's debut",
  "body": "PORTLAND, Ore. -- — Jerami Grant scored 37 points and the Portland Trail Blazers spoiled Pascal Siakam's debut with the Indiana Pacers with a 118-115 victory Friday night. \n\n\r\n              Malcolm Brogdon added a season-high 30 points for the Blazers, who led by as many as 13 points in getting their second win in a row.\n\n\r\n              Siakam scored 21 points while starting for the Pacers after being traded from Toronto earlier this week. Myles Turner had 29 points and 12 rebounds for Indiana, which held off Sacramento 126-121 on Thursday night.\n\n\r\n              Tyrese Haliburton returned to the Pacers after missing five games with a hamstring injury he sustained on Jan. 8 against the Celtics. He finished with 21 points and 17 assists. \n\n\r\n              “We had so many people contribute,” Blazers coach Chauncey Billups said. “It’s a difficult team to play against. It really is. Their pace, and their pace in the halfcourt is as deadly as anybody's, their shot making is very dangerous. I would say our game plan discipline stood out for me.” \n\n\r\n              Haliburton had a basket and free throw to pull the Pacers within 95-91 in the final quarter. \n\n\r\n              Turner's 3-pointer made it 106-101 with 3:36 left, but Grant answered with a layup on the other end. Indiana stayed within single digits until Jabari Walker's free throws gave Portland a 116-105 lead. \n\n\r\n              Turner hit another 3 that closed the Pacers within 116-113 with 16.1 seconds to go. After Grant made a free throw for Portland, Haliburton missed a 3-pointer that all but sealed Portland's win. \n\n\r\n              “It was a fun game at the end of the day,” said Portland center Deandre Ayton, who finished with 12 points after returning from injury. “We were competing and we played for each other tonight and we did everything the coaches asked of us.”\n\n\r\n              Siakam was acquired by Indiana on Wednesday night in a trade with Toronto for three first-round draft picks. The two-time All-Star, part of Toronto's 2019 NBA title team, was still getting adjusted to his new team but should add punch to the already high-scoring Pacers playing alongside Haliburton.\n\n\r\n              “He's a guy that we've coveted for a long time,” Pacers coach Rick Carlisle said. \n\n\r\n              The Pacers went 3-2 without Haliburton, who was averaging 23.6 points a game for Indiana. Going into the game, Indiana led the league with an average of 125.6 points, while Portland was ranked last with 107.2. \n\n\r\n              The Blazers were without Anfernee Simons, who has been flighting an illness. Simons was questionable on Wednesday night but hit the game-winner in a 105-103 victory over Brooklyn that snapped a four-game losing streak. \n\n\r\n              Ayton was supposed to play Wednesday after an 11-game absence due to right knee tendinitis but icy winter weather in Portland kept him stuck at home. \n\n\r\n              “I just couldn't get out, period,” Ayton said. “Ain't no boat, ain't no helicopter, nothing. I just had to take the L.” \n\n\r\n              Portland led 34-31 heading into the second quarter. Ayton's tip shot stretched the lead to 50-43 and the Blazers pushed it to 64-53 at the break. \n\n\r\n              Grant led all scorers with 20 points in the half and the Blazers dominated points in the paint with 40 compared to Indiana's 12. \n\n\r\n              Aaron Nesmith's 3-pointer for the Pacers cut the gap to 68-63. Indiana got within 75-73 on Haliburton's layup before tying the game on Turner's free throws. \n\n\r\n              “Grant just got going and we just didn’t do a good enough job with him. We probably should have double-teamed him earlier. Malcolm had a good game,\" Carlisle said about the Blazers. “They’re a physical team, they play hard and play well at home. So they earned the win.”\n\n\r\n              Portland rookie Scoot Henderson appeared to be hit in the face in the first half and did not return. The Blazers said he had a nasal contusion. \n\n\r\n              UP NEXT\n\n\r\n              Pacers: Visit the Phoenix Suns on Sunday for the final game of a six-game road trip. \n\n\r\n              Trail Blazers: Visit the Los Angeles Lakers on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996577.3569121
}