{
  "game_id": "0022000945",
  "espn_id": "401307748",
  "date": "Apr 29, 2021",
  "matchup": "MIL @ HOU",
  "headline": "Porter scores 50, Rockets stun Bucks after Giannis exits",
  "body": "HOUSTON -- — Kevin Porter Jr. scored a career-high 50 points, and the NBA-worst Houston Rockets beat the Milwaukee Bucks 143-136 on Thursday night after Giannis Antetokounmpo left less than a minute into the game with a sprained ankle.\n\n\r\n                    Houston snapped a five-game losing streak on the back of a dazzling performance from Porter, who scored 32 points in the second half and 17 in the fourth quarter. The 20-year-old's previous career best was 30 points as a rookie with Cleveland last season.\n\n\r\n                    “After I saw the third 3 go down, I knew it was going to be a special night,” Porter said. “It was all up to me. I just stayed aggressive, and it was a good night.”\n\n\r\n                    Antetokounmpo played just 46 seconds. On a driving layup, he appeared to step on the foot of Kelly Olynyk, rolling what was already an injured ankle. He limped to the locker room and spent a few minutes there before returning to the bench, where he sat for the rest of the game.\n\n\r\n                    Antetokounmpo entered the game listed as probable with a right ankle sprain.\n\n\r\n                    Bucks coach Mike Budenholzer said the new injury was a sprain and that the team is hopeful it’s not serious. Budenholzer said the team would see how the ankle responds to treatment and go from there.\n\n\r\n                    Houston trailed by as many as 17 points in the first half but surged in the second half on hot shooting from 3-point range. Houston made 25 of 46 3-pointers, good for a season-high 54.3%.\n\n\r\n                    Porter also had 11 assists. Christian Wood had 31 points and nine rebounds, and Kelly Olynyk added 24 points and 13 rebounds.\n\n\r\n                    Porter said it was his first 50-point game since he was in fourth grade. He went 9 of 15 from 3-point range.\n\n\r\n                    “For him to be successful, he’s going to have to be someone who can make those shots,” Rockets coach Stephen Silas said. “Just seeing the hard work that he puts in was great.”\n\n\r\n                    Milwaukee’s Khris Middleton had 33 points and eight assists, and Jrue Holiday had 29 points and 10 assists. Bryn Forbes scored a career-high 30 points off the bench, including 18 in the first half.\n\n\r\n                    “At the end of the day, it’s us five guys on the court,” Holiday said. “Once you step on that court, you all need to be on the same page. Tonight, in the fourth quarter, yeah, we tried to step up and play defense a lot harder, but you have to do that the whole game.”\n\n\r\n                    Milwaukee led 73-65 at halftime after Houston closed out the half on a 20-4 run.\n\n\r\n                    The Rockets opened the third quarter with a 9-0 run to take their first lead. They entered the fourth quarter ahead 104-98.\n\n\r\n                    “I think our execution can be a lot better, but they played at a high level and made shots at a really high level,” Budenholzer said. “There’s a point where you have to give credit to them, and they were very good offensively tonight.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Along with Antetokounmpo, Donte DiVincenzo (sore left Achilles tendon) was also listed in the pregame report as probable. DiVincenzo played 21 minutes, scoring three points. ... Milwaukee’s reserves outscored Houston’s 55-20.\n\n\r\n                    Rockets: Avery Bradley (sore right leg) and Danuel House Jr. (sore right ankle) joined Houston’s long list of injuries, which is now up to eight players. D.J. Augustin (left ankle sprain) said Wednesday he hopes to return in the coming days.\n\n\r\n                    PORTER’S RESILIENCE\n\n\r\n                    Silas said he was most impressed by Porter’s ability to bounce back from an off night on Tuesday, when he went 2 for 12 for 10 points. Silas said the first thing Porter said in the locker room after that loss was, “I’ve got to play better. And I will.”\n\n\r\n                    “I was just so proud of him,” Silas said. “We haven’t had very many moments that have been super positive. I was so proud of that kid tonight.”\n\n\r\n                    MILWAUKEE’S PATH FORWARD\n\n\r\n                    Budenholzer said his team has a few areas where it needs to improve in the final few weeks of the regular season before the playoffs begin. Milwaukee currently holds the third seed in the East. \n\n\r\n                    “I don’t think it’s one specific area,” Budenholzer said. “Defensively, we need to get better. We just need to get better. I’m not happy with how we played tonight, but it’s a good group, and they’ll respond appropriately.”\n\n\r\n                    HONORING TUCKER\n\n\r\n                    The Rockets played a video tribute to P.J. Tucker in the first quarter, showing highlights of his time in Houston. Tucker spent 3 1/2 seasons with the Rockets before he was traded to Milwaukee in March in exchange for D.J. Wilson, D.J. Augustin and draft considerations. \n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Visit Chicago on Friday night.\n\n\r\n                    Rockets: Host Golden State on Saturday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997374.389514
}