{
  "game_id": "0021800678",
  "espn_id": "401071354",
  "date": "Jan 19, 2019",
  "matchup": "PHI vs. OKC",
  "headline": "George lifts Thunder past 76ers 117-115",
  "body": "PHILADELPHIA --  Russell Westbrook and Joel Embiid tangled once again.\n\nThen Paul George stole the show.\n\nGeorge converted a four-point play with 5.1 seconds left, sending Westbrook and the Oklahoma City Thunder to a 117-115 victory over Embiid and the Philadelphia 76ers on Saturday.\n\nGeorge's clutch shot capped a wild finish that included another memorable moment in the rivalry between Westbrook and Embiid. Westbrook absorbed a hard foul from Embiid on a break with 1:46 left, landing out of bounds under the basket.\n\nWestbrook then got up and rushed toward Embiid before he was restrained by his teammates.\n\n\"I don't think he just landed on me,\" Westbrook said. \"He had a little extra to it, you know what I'm saying? But it's ok.\"\n\nEmbiid had a different opinion of the play.\n\n\"I think I was going for the block and I think he lost the ball, but I was already in the air,\" Embiid said. \"I don't know what, why he was mad. I have no idea. But he's always in his feelings, so I have no idea.\"\n\nWestbrook and Embiid have had a couple chilly exchanges over the past couple years. Asked if he was \"cool\" with Embiid, Westbrook used an expletive before saying \"No.\"\n\nWestbrook fouled out with 14.9 seconds remaining after he got Embiid while shooting a 3-pointer. Embiid made all three foul shots, tying it at 113, and Jimmy Butler's driving layup put Philadelphia in front with 6.9 seconds to go.\n\nBut George drained a 3 while being fouled by Butler and made the foul shot.\n\n\"That's PG,\" Westbrook said. \"You don't get too excited anymore about those I mean they happen so many times. PG's doing what PG does and we just got to see it and get a win.\"\n\nPhiladelphia had one last chance, but Butler missed a 3-point attempt in the final seconds.\n\nThe 76ers have lost 19 in a row to the Thunder. That streak that was on Embiid's mind when he decided to play after he was a game-time decision because of back tightness.\n\n\"The Sixers haven't won against them in like 10, 11 years,\" Embiid said. \"That's just ridiculous.\"\n\nGeorge finished with 31 points, six rebounds, five assists and three steals. Westbrook had 21 points, 10 rebounds and six assists for Oklahoma City, and reserve Dennis Schroder also scored 21 points.\n\nThe Thunder had dropped five of six, including a 138-128 overtime loss against the Los Angeles Lakers on Thursday night.\n\nEmbiid had 31 points, eight rebounds and six assists. JJ Redick scored 22 points for Philadelphia, and Ben Simmons finished with 20 points, 15 rebounds and nine assists.\n\nOklahoma City led by as many as 16 points in the first quarter, but Philadelphia rallied in the second and trailed 59-56 at the break.\n\nBOUNCE BACK GAME\n\nThe Thunder were glad to leave Philadelphia with the win.\n\n\"We lost the last two games, so it was pretty tough,\" center Steven Adams said. \"It was just good. It's obviously good to get a win under our belt, just against this team, obviously they had a lot of really good sets.\"\n\nBIG PICTURE\n\nThunder: George went 4 for 9 from 3-point range. He also went 11 for 11 at the free-throw line. ... Adams had 16 points and nine rebounds. Terrance Ferguson added 11 points. ... Oklahoma City had 20 assists and 10 turnovers, compared to 28 assists and 17 turnovers for Philadelphia.\n\nSixers: Embiid has 20 games with at least 30 points. The last Sixer to accomplish that feat in the first 45 games of the season was Allen Iverson. ... Redick has scored in double-digits in 54 consecutive games. ... Injured guard Markelle Fultz (thoracic outlet syndrome) watched the game from the Sixers bench. There is no timetable for his return.\n\nUP NEXT\n\nThunder: Visit the New York Knicks on Monday.\n\nSixers: Host the Houston Rockets on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994027.010082
}