{
  "game_id": "0021600203",
  "espn_id": "400899653",
  "date": "Nov 21, 2016",
  "matchup": "HOU @ DET",
  "headline": "Harden scores 28 for Rockets in 99-96 win over Pistons",
  "body": "AUBURN HILLS, Mich. --  James Harden has made a living at the free throw line in recent years. This time, his touch was off when it mattered most.\n\nHarden, who entered the game shooting 82 percent from the line, missed five free throws in the final 3 minutes against the Detroit Pistons. Fortunately for the Houston Rockets, they were able to hold on in a 99-96 victory Monday night.\n\nHarden finished with 28 points, 11 assists and eight rebounds. He went 14 of 19 at the foul line, but only 4 of 9 in the fourth quarter.\n\n\"I had to laugh it off. It's funny,\" Harden said. \"But we all have games like this. I can't let it happen. I have to take my time, go up there concentrating on the free throw.\"\n\nClint Capela added 15 points and 12 rebounds for the Rockets, who won their third straight game.\n\n\"We did not play well all night. I didn't think we were sharp, but we found a way to win,\" coach Mike D'Antoni said. \"It's just a good win for everyone.\"\n\nKentavious Caldwell-Pope scored 26 points and Andre Drummond had 13 points and 16 rebounds for Detroit, which has lost four in a row.\n\nWith the Rockets clinging to a one-point lead and less than 10 seconds left, Harden made a free throw and missed the second, leaving Houston up 98-96.\n\nDrummond rebounded the miss and was immediately fouled by Capela with 4.6 seconds to go. Drummond missed both free throws and the Pistons fouled Harden, who again made one of two, giving Detroit a chance.\n\n\"I've got to make free throws -- that's all,\" Harden said. \"Make free throws, win the game. It's pretty simple.\"\n\nCaldwell-Pope missed a halfcourt heave at the buzzer, handing Detroit its second straight close loss at home.\n\n\"We're going to have to toughen up to be able to accomplish what we want to accomplish,\" coach Stan Van Gundy said.\n\nDetroit led by 12 in the first quarter and took a 29-18 lead early in the second on Jon Leuer's dunk. The Rockets, however, chipped away and tied it 43-all on Capela's alley-oop dunk from Harden with 4:11 left in the period.\n\nThe Pistons regained a two-point edge, but Harden scored the final seven points of the first half to put Houston ahead 51-46.\n\nHouston stretched its lead to 11 in the third quarter and settled for a 79-75 advantage heading into the final period.\n\nThe Pistons used an 8-0 run early in the fourth quarter to open an 85-82 lead. The teams went back and forth the rest of the way, and neither led by more than four points.\n\nDetroit, trailing 96-95 with 55 seconds left, had a chance to take the lead, but Ish Smith missed a layup. Harden made one free throw to leave Houston ahead 97-95 with 15.4 seconds left, and Caldwell-Pope answered with a free throw to get Detroit within one.\n\nTIP-INS\n\nRockets: Nene was assessed a Flagrant 1 foul in the third quarter after tripping Detroit's Aron Baynes. The play was originally called a common foul, but after review it was changed to the Flagrant 1.\n\nDetroit: Marcus Morris nailed a 33-foot 3-pointer over Harden's outstretched hand to beat the third-quarter buzzer and cut Houston's lead to 79-75. The play was reviewed and replays showed the ball left Morris' hands just in time.\n\nNO HOME COOKING\n\nAfter starting the season 5-0 at home, the Pistons lost their second straight at the Palace. They lost Saturday to Boston 94-92 on Al Horford's last-second shot. Detroit is just 1-7 on the road.\n\n\"It's tough, especially coming off (the Boston loss),\" said Morris, who finished with 13 points. \"We've got to find a way to play harder or just get rebounds.\"\n\nOFF TARGET\n\nThe Rockets were held under 100 points after surpassing the century mark in their previous seven games. Houston shot 44.9 percent from the field, including 32.3 percent from beyond the 3-point arc.\n\n\"We just have to continue to get better and continue to do good things down the stretch and win,\" Harden said. \"That's all that matters.\"\n\nUP NEXT\n\nRockets: At home Wednesday against Toronto.\n\nPistons: At home Wednesday against Miami.",
  "source": "espn_api",
  "crawled_at": 1764995791.3213172
}