{
  "game_id": "0021500041",
  "espn_id": "400827928",
  "date": "Nov 01, 2015",
  "matchup": "HOU @ MIA",
  "headline": "Heat rally from 21-point second-half deficit as Rockets fall to 0-3",
  "body": "MIAMI -- Udonis Haslem didn't play a single second for the Miami Heat on Sunday night.\nInstead, he dominated halftime.\nHaslem's fiery speech -- replete with some profanity from the tri-captain and a couple bottles getting angrily spiked into the red locker room carpeting for emphasis -- led to a Miami turnaround, the Heat outscoring Houston by 41 points in the final 23 minutes and rolling past the Houston Rockets 109-89.\n\"Absolutely awesome,\" Heat coach Erik Spoelstra said about the speech. \"That's what leaders do. By the time I got in there, he was already halfway through it and there wasn't much that was needed to be said after that.\"\n\nMiami was down 65-44 early in the second half. The Heat outscored Houston 65-24 the rest of the way.\n\"At times, I can be kind of harsh,\" Haslem said. \"But it's harsh reality ... and it just comes out the way it comes out.\"\nSaid Heat guard Dwyane Wade: \"It was all bleep, bleep, bleep.\"\nHassan Whiteside had 25 points and 15 rebounds, Wade scored 20 points and Luol Deng scored 14 for Miami -- which enjoyed its biggest comeback win since a 27-point rally at Cleveland late in the 2012-13 championship season. Tyler Johnson scored 11, Chris Bosh had all 10 of his in the fourth and Justise Winslow added 10 for the Heat.\nMarcus Thornton scored 21 points for Houston, and James Harden had 16 on 2-for-15 shooting -- 0-for-10 from 3-point range. The Rockets have dropped each of their first three games by exactly 20 points each.\n\"You can't have a stagnant offense and not get stops,\" Harden said. \"That's a sign of disaster, which happened in the second half.\"\nDwight Howard sat out to rest on the first night of a back-to-back. He's expected to play when the Rockets host Oklahoma City on Monday night.\n\"We have not played well all preseason. We have not played well in the first three games,\" Rockets coach Kevin McHale said. \"No one feels sorry for us. We just have got to go out and find our rhythm and keep on playing.\"\n---\nTIP-INS\nRockets: The last time the Rockets were 0-3 was in the 2010-11 season. They started 6-0, 12-3 and 19-5 last season. ... Terrence Jones (right eyelid laceration) and Donatas Motiejunas (back pain) were Houston's inactives. ... Miami caught a break with Howard out; he has 30 double-doubles in 38 career games against the Heat.\nHeat: Whiteside was 5-for-5 in the first quarter, the second time he's done that in his career. ... Miami shot 12-for-20 from 3-point range in its home opener Wednesday, then went 0-for-10 in the first half from long range Sunday. ... Bosh blocked his 900th career shot, but didn't score until the fourth quarter. ... Former Heat (and Rockets) player Shane Battier was part of the sellout crowd.\nHARDEN IN MIAMI\nThere is something about Miami that doesn't bring out the best in Harden.\nHe struggled in two NCAA tournament games at AmericanAirlines Arena, endured plenty of rough moments in three NBA Finals games there with Oklahoma City in 2012, and the regular season hasn't always been kind to him in Miami, either.\nHarden is now 44-for-117 in Miami as a pro, and 20-for-65 from 3-point land. His two NCAA games were even worse, with him shooting 3-for-18, 1-for-8 from 3-point range and scoring 19 points in two games.\nHAPPY DAY\nSunday was a day for a pair of Heat milestones.\nIt was the 14th anniversary of the day Chris Andersen -- who was inactive Sunday -- became the first-ever selection in what was then the National Basketball Development League draft, going to the Fayetteville Patriots. Andersen was called up to the NBA for the first time three weeks later.\nAnd Spoelstra celebrated his 45th birthday.\n\"I have nothing to complain about in my life,\" Spoelstra said.\nUP NEXT\nRockets: Host Oklahoma City on Monday night.\nHeat: Host Atlanta on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994678.374336
}