{
  "game_id": "0021500627",
  "espn_id": "400828514",
  "date": "Jan 19, 2016",
  "matchup": "OKC @ DEN",
  "headline": "Durant, Westbrook lead Thunder over Nuggets 110-104",
  "body": "DENVER --  While Oklahoma City struggled from beyond the arc Tuesday night, it did enough on the boards to outlast the Denver Nuggets.\n\nKevin Durant and Russell Westbrook each had double-doubles and the Thunder overcame a cold-shooting night to beat Denver 110-104.\n\nDurant finished with 30 points and 12 rebounds to lead the Thunder, who won their fifth in a row despite hitting just 21 percent from 3-point range.\n\n\"We got great shots tonight,\" Durant said. \"Cameron (Payne) missed four wide-open 3s, Dion (Waiters) missed two or three, I missed a couple, so we got great looks tonight. We can live with those.\"\n\nWestbrook scored 27 points and added 12 assists but fell five rebounds shy of another triple-double. He had two straight coming in and five on the season.\n\nThe Thunder have won 20 of 24 and are the only team in the Northwest Division with a winning record. They are 12 games in front of Utah.\n\nIt was a former Jazz player that came up big for the Thunder. Enes Kanter had 25 points and eight rebounds, four offensive, to pick up some of the burden from Durant and Westbrook.\n\n\"You know that KD and Westbrook are more than likely going to have good games. They're superstars,\" Denver forward Will Barton said. \"But we can't let the other guys do what they did tonight.\"\n\nDanilo Gallinari scored 27 points but only seven after halftime for the Nuggets. Kenneth Faried had 17 points and 15 rebounds for the Nuggets.\n\nThe Nuggets led by as many as 12 in the first half, but Durant and Westbrook were too much in the second half and down the stretch. After Denver cut a 10-point deficit in half with 3:57 left, Westbrook hit a free throw, Durant drained a long 3-pointer and Westbrook dunked to make it 104-95.\n\nDenver cut it to four in the final minute and had a chance to make it a one-possession game, but Westbrook stole a pass in the lane and Kanter hit two free throws with 29.7 seconds left.\n\nKanter's 25 points were a season high.\n\n\"Enes did a really good job tonight,\" Thunder coach Billy Donovan said. \"He was really active on the glass, he got a lot of offensive rebounds, he kept possessions alive, he scored, he did a lot of really good things.\n\nCONTRACT TALKS\n\nThe Nuggets announced before the game they had signed general manager Tim Connelly and assistant general manager Arturas Karnisovas to multi-year contract extensions.\n\nBoth executives joined the team in 2013 after the Nuggets had a disappointing first-round exit following a franchise record 57-win season.\n\nConnelly, who also serves as the executive vice president of basketball operations, called himself a \"scout with a GM title\" and said his \"goal was not to be a GM, my goal was to be a paid scout.\"\n\nTIP-INS\n\nThunder: Durant was named the Western Conference player of the week Monday after averaging 26 points, 8.3 rebounds and 4.3 assists in four games. ... Kanter was 10 of 14 from the field. He and Steven Adams (5 for 7) were the only Thunder players to shoot better than 50 percent. ... Payne was 0 for 9 from the field and 0 for 6 from 3-point range.\n\nNuggets: G Jameer Nelson was out for the second straight game with a sprained left wrist. ... C Jusuf Nurkic dressed but did not play. He had missed the previous two games with a left knee injury.\n\nUP NEXT\n\nThunder: Host Charlotte on Wednesday night.\n\nNuggets: Host Memphis on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994168.033431
}