{
  "game_id": "0022000943",
  "espn_id": "401307746",
  "date": "Apr 29, 2021",
  "matchup": "DET vs. DAL",
  "headline": "Hardaway scores 42, Mavericks beat Pistons 115-105",
  "body": "DETROIT -- — Tim Hardaway Jr. scored a career-high 42 points, helping the Dallas Mavericks overcome the absence of Luka Doncic in a 115-105 victory over the Detroit Pistons on Thursday night.\n\n\r\n                    Trey Burke added 15 points for Dallas, which moved a game ahead of Portland for the No. 6 spot in the Western Conference. Doncic missed the game because of a left elbow issue, and the Pistons were without their leading scorer as well in Jerami Grant.\n\n\r\n                    The game was tight until the final minute. Hardaway scored 17 points in a row during a fourth-quarter stretch, capping that run with a 3-pointer with 1:05 remaining that put the Mavericks up 109-105. During that stretch, Detroit also fouled Hardaway twice while he was shooting a 3, and he made all his free throws.\n\n\r\n                    “We really just rode him to the win. It was a very difficult game,” Dallas coach Rick Carlisle said. “Detroit’s a hard-playing team. They kept getting to the rim.”\n\n\r\n                    Isaiah Stewart and Frank Jackson scored 20 points apiece for the Pistons.\n\n\r\n                    Dallas has won five of six, although in addition to Doncic's absence, Kristaps Porzingis left with knee soreness after scoring 11 points.\n\n\r\n                    “I think most importantly, those guys know that health is the No. 1 priority,\" Hardaway said. \"Just being able to have that next-man-up mentality and going out there and performing, is what you get paid to do.”\n\n\r\n                    Hardaway's previous career high was 39 points, set in 2018. He and Burke looked plenty comfortable in Detroit, not far from where they played college basketball at Michigan. Hardaway's 23 field goal attempts were a season high.\n\n\r\n                    Hardaway has missed only one game this season.\n\n\r\n                    “He’s been our iron man all year,” Carlisle said. “I keep talking to him about getting him a game off at some point. Tonight wasn’t going to be the night, because he was back home in Michigan.”\n\n\r\n                    Jalen Brunson scored 13 points for the Mavericks.\n\n\r\n                    Saddiq Bey scored 18 points for the Pistons, and Sekou Doumbouya added 14. \n\n\r\n                    Rookie Killian Hayes had 11 assists.\n\n\r\n                    “He's not a finished product still,” Pistons coach Dwane Casey said. “One thing he's got to continue to do is understand that you've got to be in great NBA condition, and the stamina level for a 19-year-old is not the same as an older player in the league, who knows the speed of the game and the endurance you have to have.”\n\n\r\n                    Dallas went 22 of 23 on free throws.\n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Hardaway did fall three points shy of matching his father's career high. Tim Hardaway scored 45 points in a 1997 game.\n\n\r\n                    Pistons: Detroit was without Grant (right knee), Mason Plumlee (rest) and Wayne Ellington (calf). ... The Pistons lost despite shooting 51% from the field. They turned the ball over 18 times.\n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: Host Washington on Saturday night. Dallas beat the Wizards 109-87 on April 3.\n\n\r\n                    Pistons: Visit Charlotte on Saturday night. The Hornets beat Detroit 105-102 on March 11.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997901.498825
}