{
  "game_id": "0022300531",
  "espn_id": "401585159",
  "date": "Jan 11, 2024",
  "matchup": "LAL vs. PHX",
  "headline": "Bradley Beal scores 37, Devin Booker adds 31 as Suns roll to a 127-109 victory over Lakers",
  "body": "LOS ANGELES -- — Frank Vogel and Kevin Durant had some goals before the Phoenix Suns faced the Los Angeles Lakers.\n\n\r\n              Vogel has been imploring his club to shoot more 3-pointers. Durant told Devin Booker to be more aggressive and not worry about getting the ball to him.\n\n\r\n              For at least one night, all of Phoenix's goals were met.\n\n\r\n              Bradley Beal had a season-high 37 points, including eight 3-pointers, Booker added 31 and the Suns routed the Lakers 127-109 on Thursday.\n\n\r\n              “I thought the whole game was a positive step in the direction of how we want to play offensively,” said Vogel, who got his first victory over his former team. Vogel coached the Lakers for three seasons, including 2020 when they won the NBA title in the Walt Disney World bubble.\n\n\r\n              Beal, who played in only six of the first 30 games due to back and ankle injuries, was 8 of 10 from beyond the arc. He scored 20 points in the third quarter and the Suns’ largest lead was 32 early in the fourth. He was one off tying the Suns’ single-game record for 3-pointers shared by six players.\n\n\r\n              “It’s something that I’ve been trying to kick myself to do the last five years of my career, to shoot eight-to-10 3-pointers a game,” said Beal, who made at least eight 3-pointers for the third time in his 12-year career. “I worked with my training group back in town and got it back feeling right. Tonight I was confident in it and once it was in my hands just making it flow.”\n\n\r\n              Booker was the aggressor early en route to his 10th 30-point game this season. He had 16 points in the first quarter as the Suns had an 11-point advantage.\n\n\r\n              “I was doing what my teammates asked of me. Having a mate like (Durant) out there to give you that much confidence and let you rock out is huge,” Booker said.\n\n\r\n              Durant added 18 points for the Suns, who broke a five-game losing streak to the Lakers. They also bounced back after a 27-point loss to the Clippers on Tuesday.\n\n\r\n              “As much as everybody can be aggressive without having to focus on trying to getting me or our best scorers the ball, be aggressive and just make the right play,\" Durant said. \"The ball is going to find us. Sometimes it is good to reiterate that to your teammates so they can go out there and have a free mind.” \n\n\r\n              D’Angelo Russell had 19 points off the bench as the Lakers fell to 5-11 since winning the NBA In-Season Tournament last month. The Lakers had won two in a row but fell back below .500 at 19-20. \n\n\r\n              Los Angeles had seven players score in double figures but committed 17 turnovers that led to 28 Phoenix points. \n\n\r\n              “We had a bunch of turnovers in the first half and they made their shots. I thought we were there at different times and forced them into tough situations but they capitalized,” coach Darvin Ham said. \n\n\r\n              LeBron James had 10 points on 3-of-11 shooting along with nine assists and five rebounds. Anthony Davis and Austin Reaves scored 13 points apiece. All three players did not see action during the fourth quarter as the Lakers trailed by 27 after three.\n\n\r\n              Cam Reddish was in the starting lineup but did not play in the second half due to knee soreness.\n\n\r\n              “I thought they were very aware of what we wanted to do, plus having their Big 3 helped as well,” James said.\n\n\r\n              A jumper by Booker gave the Suns a 32-15 advantage with two minutes remaining in the first quarter before the Lakers made a late spurt to get within 36-25 at the end of the period.\n\n\r\n              Los Angeles kept whittling away at the start of the second quarter. Jerod Vanderbilt's 3-pointer cut it to 40-34, but that would be the closest the Lakers would get the rest of the way as Phoenix countered with seven straight points as part of a 10-2 run.\n\n\r\n              Josh Okogie finished off the spurt with a driving dunk while being fouled by Jaxson Hayes. Okogie finished the three-point play with a free throw to make it 50-36 with 7:44 remaining in the first half. \n\n\r\n              UP NEXT\n\n\r\n              Suns: At Portland on Sunday.\n\n\r\n              Lakers: Travel to Utah on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995521.580145
}