{
  "game_id": "0021500150",
  "espn_id": "400828037",
  "date": "Nov 15, 2015",
  "matchup": "TOR @ SAC",
  "headline": "Cousins has 36 to lead Kings past Raptors, 107-101",
  "body": "SACRAMENTO, Calif. --  DeMarcus Cousins stared at the stat sheet Sunday in the Kings' locker room, perusing another night's work where his offensive output was fabulous.\n\nCousins scored 10 of his 36 points in the fourth quarter and grabbed 10 rebounds to help the Kings win their third straight game, beating the Toronto Raptors 107-101.\n\nCousins has averaged 36.3 points in the past three games. The All-Star center had a memorable first half, making three 3-pointers and scoring 23 points. He made 12 of 22 shots overall, added three assists and three blocks, and also was a key factor down the stretch defensively when Sacramento scored the game's final 11 points.\n\n\"He (Cousins) was crazy tonight, just amazing,\" teammate Marco Belinelli said. \"He has been playing great lately. I'm really happy for him.\"\n\nThere was no one happy in the Raptors locker room after squandering an eight-point lead in the final four-plus minutes when they were outscored 16-2. The Raptors missed their final seven attempts after making numerous perimeter shots in the third quarter and halfway through the fourth.\n\n\"We had miscommunications and didn't execute down the stretch. But they got aggressive and made some timely reaches on defense,\" said Kyle Lowry, who made six 3-pointers and had 22 points and seven assists. \"They got to the ball and got their hands in the right positions. Obviously, they did something correct.\"\n\nAfter missing the previous game with a stomach virus, Rudy Gay had 26 points and Omri Casspi added 14 for Sacramento, which won despite committing 20 turnovers that led to 20 points. Rajon Rondo had seven points, 14 assists and seven rebounds, but also had seven turnovers.\n\nDeMar ReRozan scored 24 points for the Raptors. DeMarre Carroll made four 3s and had 17 points and reserve Kyle Cory Joseph also scored 17.\n\nThe Raptors, who entered the game shooting 33 percent on 3s, made 15 of 31 against the Kings' lax perimeter defense.\n\nTrailing most of the fourth, the Kings went ahead for good when Ben McLemore drove to the basket and scored on a twisting layup for a 102-101 lead. Cousins followed with a basket from close range and Gay made three free throws in the final 17 seconds to preserve the victory.\n\n\"You make 15 threes and allow them to shoot 51 percent; you're not going to win very many games that way,\" Raptors coach Dwane Casey said. \"Until tonight, we have been (paying) good attention to detail on defensively and for whatever reason tonight we didn't. It's on us.\"\n\nThe Raptors converted 7 of 9 3-pointers in the third quarter, including three each by Lowry and Carroll, in outscoring the Kings 31-26 to take an 82-79 lead going into the fourth.\n\nCOUSINS CONSOLES GRIEVING FAMILY\n\nCousins will pay for the funeral of Grant High football player Jaulon Clavo, who was shot and killed in a Sacramento drive-by shooting prior to his team's playoff game Friday evening. Cousins provided complimentary courtside seats Sunday for Clavo's mother and sister.\n\n\"I am a parent myself and I can't imagine losing one of my kids,\" Cousins said. \"I do have relationships with people in that area and also other areas in Sacramento. So it just touched home to me. It wasn't really about me. It's about the family and it's about the kid.\"\n\nNO PASSING FANCY\n\nRondo's 14 assists was his fifth straight game double-figure game. It's the longest Kings franchise streak since Reggie Theus had seven straight games of 10 or more assists in the 1985-86 season, the team's first in Sacramento.\n\nTIP INS\n\nRaptors: Lowry has at least one steal in every game this season and ranked third in the league entering Sunday's game. ... Patrick Patterson is the only one still in Toronto from a seven-player deal with the Kings in December 2013 that brought Gay to Sacramento. The Raptors are 97-59 since the trade.\n\nKings: Rondo had four of the Kings' eight turnovers in the first quarter and had six by halftime. ... Valuable reserve point guard Darren Collison (hamstring strain) missed his fifth straight game. ... Rookie Willie Cauley-Stein started the game and received a blow to the head in the first quarter. Although not showing signs of a concussion, he didn't play again as a precautionary measure.\n\nUP NEXT\n\nRaptors: At Golden State on Tuesday.\n\nKings: At Atlanta on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994766.098881
}