{
  "game_id": "0022200181",
  "espn_id": "401468336",
  "date": "Nov 11, 2022",
  "matchup": "MEM vs. MIN",
  "headline": "Morant has 28 to power Grizzlies past Timberwolves, 114-103",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 28 points, 10 rebounds and eight assists to lead the Memphis Grizzlies to a 114-103 victory over the Minnesota Timberwolves on Friday night.\n\n\r\n              Desmond Bane finished with 24 points and five assists for Memphis, while Dillon Brooks scored 21. Brandon Clarke added 15 points, making all six of his shots as the Grizzlies won their fifth in the last six.\n\n\r\n              Memphis coach Taylor Jenkins said his team’s play was indicative of how they approached the game all day. He told them before the game that they paid attention to details, and just needed to say “locked in” for another 48 minutes.\n\n\r\n              “Obviously a competitive game,” Jenkins said. “Competitive first half. Walked in at halftime showing clips. We had more dialogue about what we needed to do better.\n\n\r\n              “We gave up 63 in the first (half) and 40 in the second.”\n\n\r\n              Anthony Edwards led the Timberwolves with 28 points, making 10 of 16 shots, including 3 of 4 from outside the arc. Jaden McDaniels had 15 points, while Rudy Gobert also had 15 points, making all five of his shots. Karl-Anthony Towns finished with 13 points and 10 rebounds.\n\n\r\n              But Minnesota coach Chris Finch noted that the Grizzlies had 15 offensive rebounds, leading to 32 second-chance points.\n\n\r\n              “The story of the game was their offensive rebounds,” Finch said. “They crushed us on the glass. A lot of things we talked about trying to do, we did.”\n\n\r\n              The game was the first between the two teams since last postseason’s spirited first-round playoff series won by the Grizzlies in six games.\n\n\r\n              The Timberwolves have added Gobert to the frontline with Towns. The duo and Minnesota have struggled lately, losing six of seven.\n\n\r\n              “I thought we had way more of a consistent effort than we have had,” Finch said, “especially if the game was kind of going against us.”\n\n\r\n              Memphis was able to build the lead to double digits in the first half.\n\n\r\n              The Grizzlies benefitted from 56% shooting in the first half but struggled from beyond the arc. Minnesota developed early foul problems on its front line. Towns drew four fouls and had three before halftime.\n\n\r\n              Bane scored 13 in the fourth quarter as Memphis solidified its lead.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Reserve C Naz Reid was out with an illness. … Minnesota is 0-5 when scoring less than 110. … Edwards recorded his seventh game with 20 or more points this season. … The Timberwolves are 0-8 when trailing after three quarters. … The last Minnesota win in Memphis was March 23, 2019. \n\n\r\n              Grizzlies: Started the game 0 for 7 from 3. … Bane now has multiple 3-pointers in 29 straight games, the best active streak in the league. … Steven Adams passed Dan Roundfield for 50th in career rebounds. … Memphis has won the last six home games in the series and tied the all-time series at 51-51.\n\n\r\n              ANDERSON RETURNS\n\n\r\n              The game was the return for Kyle Anderson who signed with Minnesota during the offseason after four years with the Grizzlies. He was given a warm ovation when he entered the game in the first half. “For him to come and be in another jersey was kind of weird,” Morant said, adding: “After the game, when we were in our little huddle, he actually came in the huddle and told us he was proud of us. He loves us, and to keep working. I feel like nothing changed but the jersey.”\n\n\r\n              UP NEXT \n\n\r\n              Timberwolves: Continue a four-game road trip in Cleveland on Sunday against the Cavaliers.\n\n\r\n              Grizzlies: Visit Washington on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994234.4670231
}