{
  "game_id": "0022300554",
  "espn_id": "401585182",
  "date": "Jan 14, 2024",
  "matchup": "POR vs. PHX",
  "headline": "Devin Booker scores 34 points, Suns hold off Trail Blazers 127-116",
  "body": "PORTLAND, Ore. -- — Devin Booker had 34 points and the Phoenix Suns held off the Portland Trail Blazers 127-116 on Sunday night for their second straight victory.\n\n\r\n              Bradley Beal added 23 points, Kevin Durant had 21 and Grayson Allen 20. The Suns, whose biggest lead was 17 points, let Portland narrow the gap to four points midway through the final quarter. \n\n\r\n              Rookie Scoot Henderson had a career-high 33 points and nine assists for the short-handed Trail Blazers. They have lost four straight and eight of 10. The skid includes a 139-77 loss at Oklahoma City that tied for the fifth-worst setback in NBA history.\n\n\r\n              Henderson had a fast-break layup and Rayan Rupert added a 3-pointer to pull Portland to 111-107 with 6:33 left, but the Suns answered with a 10-2 run and the Trail Blazers couldn't get any closer. \n\n\r\n              “We just got sloppy with the basketball,” Suns coach Frank Vogel said. “When you have a lead in the fourth the other team is going to turn up the pressure, and we’ve got to handle it better than we did tonight.” \n\n\r\n              Beal agreed. \n\n\r\n              “I think the biggest thing is just staying aggressive,” Beal said. “Too passive, too lax, too comfortable — just be aggressive man, keep putting our foot on the gas. Close out games a lot better than we have.”\n\n\r\n              Booker was 14 of 22 from the field — with five of the misses coming on 1-of-6 3-point shooting — and made all five of his free throws. He also had seven assists and six rebounds and no turnovers.\n\n\r\n              Portland had just eight available players. The Blazers announced before the game that Jerami Grant and Matisse Thybulle would not play because of illness. \n\n\r\n              They joined an already sizable list of unavailable players, among them Deandre Ayton (knee) Ibou Badji (hip) Malcolm Brogdon (adductor soreness) and Shaedon Sharpe (adductor soreness). \n\n\r\n              Portland coach Chauncey Billups said Ayton, who played for the Suns before coming to the Blazers in the offseason, is close to a return. He has missed 11 games. \n\n\r\n              “We were incredibly undermanned, obviously, in the game, but I told the guys, `Play fast, play fun, share the ball and help each other on defense. Just play free.′ And they did that and it was just fun,” Blazers coach Chauncey Billups said. \"It was fun watching them, it was fun coaching. So many guys played well. \n\n\r\n              The Suns were without Bol Bol, who was sore after practice Saturday and will be reevaluated Monday. \n\n\r\n              Phoenix was coming off a 127-109 road victory over the Lakers on Thursday night.\n\n\r\n              Despite the absences, Portland led by 33-26 in the first quarter after Rupert's 3-pointer. It was close until the Suns began to pull away midway through the second quarter, when Allen's running 3-pointer put Phoenix up 57-49. \n\n\r\n              The Suns went into the half ahead 71-62, led by Allen and Booker with 15 points apiece. \n\n\r\n              Allen's 3-pointer gave Phoenix a 100-85 lead in the third quarter and Booker scored 15 of his points during the period. \n\n\r\n              Anfernee Simons' 3-pointer closed the gap for Portland to 106-95 early in the final period. The Blazers got within single digits when Rupert's 3-pointer made it 109-102 with 8:29 left. \n\n\r\n              Jusuf Nurkic, who was traded from the Blazers to the Suns last summer, finished with 14 points and 13 rebounds. \n\n\r\n              It was the fourth and final meeting between the two teams this season. The Suns won three. \n\n\r\n              The crowd for the game was spotty due to wintery weather in Portland that shut down the city's light rail system. \n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Sacramento on Tuesday night. \n\n\r\n              Trail Blazers: Host Brooklyn on Wednesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996579.1414459
}