{
  "game_id": "401810044",
  "espn_id": "401810044",
  "date": "Nov 08, 2025",
  "matchup": "DEN vs IND",
  "headline": "Nikola Jokic has 6th triple-double in 9 games as Nuggets beat Pacers 117-100",
  "body": "DENVER -- — Nikola Jokic had 32 points, 14 rebounds and 14 assists for his sixth triple-double in nine games this season, and the short-handed Denver Nuggets beat the Indiana Pacers 117-100 on Saturday night to sweep a four-game homestand.\n\n\r\n              Denver played without regulars Jamal Murray (left calf tightness) and Aaron Gordon (left hamstring) on the second game of a back-to-back. Jalen Pickett and Peyton Watson, who had a season-high 16 points, started instead.\n\n\r\n              Gordon, who missed 31 games last year with injuries, is averaging a career-best 20.1 points.\n\n\r\n              “If he feels something that can turn into something worse, there is a little bit of apprehension,” Denver coach David Adelman said before the game. “Aaron’s a guy we have to protect ... because there’s just not that many human beings that are that big and jump that high and explode like that.”\n\n\r\n              Indiana, which has been without multiple players at the start of the season, lost for the eighth time in nine games. The Pacers got Andrew Nembhard back from a left shoulder strain that cost him the last seven games.\n\n\r\n              Aaron Nesmith scored 25 points for Indiana and Nembhard added 22. Monte Morris, signed Friday, had one point in 15 minutes.\n\n\r\n              Jokic, who had a season-high eight turnovers, secured the triple-double on a pass to Cam Johnson with 7:49 left in the third quarter.\n\n\r\n              The Pacers rallied within 64-61 early in the third, aided by Gordon’s technical foul while sitting on the bench in street clothes.\n\n\r\n              The Nuggets led by 13 after three quarters and went up 109-88 on Jokic’s deep 3-pointer midway through the fourth.\n\n\r\n              Up next\r\n              Pacers: At Golden State on Sunday night.\n\n\r\n              Nuggets: At Sacramento on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042587.85333
}