{
  "game_id": "0022301229",
  "espn_id": "401607494",
  "date": "Dec 07, 2023",
  "matchup": "MIL vs. IND",
  "headline": "Pacers beat Bucks 128-119 to advance to face Lakers in NBA In-Season Tournament final",
  "body": "LAS VEGAS -- — Tyrese Haliburton hit his third 3-pointer with less than a minute left, pounded his chest, and looked down at his wrist to let everyone know one thing: “It’s our time!”\n\n\r\n              Haliburton had 27 points and 15 assists and the Indiana Pacers beat the Milwaukee Bucks 128-119 on Thursday night to advance to the championship game in the NBA’s inaugural In-Season Tournament.\n\n\r\n              The Pacers will face the Los Angeles Lakers for the title Saturday night. The Lakers routed New Orleans 133-89 in the second semifinal.\n\n\r\n              “We’re playing the right way and we’re shocking the world right now, we’re going to continue to do that,” Haliburton said. \"And as long as we play the right way, we know we’re going to be in every basketball game.”\n\n\r\n              Myles Turner added 26 points for Indiana. Obi Toppin had 14 on 6-of-8 shooting, Isaiah Jackson chipped in 11 and Bruce Brown had 10.\n\n\r\n              Indiana is averaging a whopping 132.6 points during the tournament. Overall, they are averaging 128.3 this season — 131.7 over the last 14 games.\n\n\r\n              Giannis Antetokounmpo had 37 points and 10 rebounds for Milwaukee. Damian Lillard added 24 points, Khris Middleton had 20 and Brook Lopez 18.\n\n\r\n              Most important, however, was Indiana’s reserves outscoring Milwaukee’s backups 43-13. Indiana’s bench was a combined plus-62, while Milwaukee’s reserves were minus-46.\n\n\r\n              “Yeah, our bench really was the difference in today’s game,” Indiana coach Rick Carlisle said. “If you look at the plus-minus, it’s pretty obvious that those guys played a major role.”\n\n\r\n              It was most evident in the second quarter, when Bennedict Mathurtin and T.J. McConnell came into the game with the Pacers trailing by two, and sparked a 16-7 run that gave Indiana 43-36 lead while setting the tone for the starters as they eased back into the lineup.\n\n\r\n              “I know a lot of people don’t watch us play all the time, but we truly have one of the best benches in the NBA, if not the best bench in the NBA,” Haliburton said. “We’re a really deep team with a lot of different guys who can contribute. I’m sure we’ve got a lot of guys that people aren’t really familiar with, but they’ll be familiar all too soon, for sure.”\n\n\r\n              Down three after three quarters, the Pacers opened the fourth with a 14-8 run to take a 105-102 lead. Turner, Brown and Haliburton accounted for 17 points during a game-ending 21-13 run.\n\n\r\n              After scoring a season-high 146 points and making 23 of 38 3-pointers in a quarterfinal victory over New York, the Bucks were 12 of 33 on 3s and 43 of 96 overall from the field.\n\n\r\n              “We’ve got to close it out in the fourth quarter, which is something we’ve done very well, we just couldn’t pull it off tonight,” Milwaukee coach Adrian Griffin said. “It’s not the outcome that we wanted but we made it to Vegas and we got to experience this. And I think it’s going to do wonders for our team. You always learn in wins and you learn in losses.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Tournament title game Saturday night in Las Vegas against the Lakers.\n\n\r\n              Bucks: Host Chicago on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996148.484148
}