{
  "game_id": "0022400013",
  "espn_id": "401703382",
  "date": "Nov 15, 2024",
  "matchup": "CHI @ CLE",
  "headline": "Donovan Mitchell scores 37, Cavaliers stay perfect and improve to 14-0 with 144-126 win over Bulls",
  "body": "CLEVELAND -- — Donovan Mitchell scored a season-high 37 points, Darius Garland had 29 and the Cleveland Cavaliers continued one of the best starts in league history, improving to 14-0 with a 144-126 win over the Chicago Bulls on Friday night in an NBA Cup game.\n\n\r\n              The Cavs are the sixth team to go 14-0 and first since the Golden State Warriors opened 24-0 in 2015-16.\n\n\r\n              Cleveland's 14-game winning streak is the longest in the club's 55-year existence. The Cavs won 13 in a row three times when LeBron James played for them.\n\n\r\n              Jarrett Allen added 24 points and Caris LeVert had 22 for the Cavs, who have been perfect under first-year coach Kenny Atkinson.\n\n\r\n              Coby White scored 29 and Nikola Vucevic had 25 for the Bulls, who were still within four points on Ayo Dosunmu's dunk with 2:55 left. However, LeVert and Mitchell dropped 3-pointers as the Cavs blitzed the Bulls 21-7 the rest of the way.\n\n\r\n              The Cavs played without starting forward Evan Mobley, who has been battling an illness the past few days.\n\n\r\n              Takeaways\r\n              Bulls: The league's fastest-paced team by most offensive metrics had too many rushed shots and poor possessions to pull off the win. \n\n\r\n              Cavaliers: At home. On the road. Short-handed. It doesn't matter. They're playing with energy and a connectivity that's only building their confidence and trust in Atkinson, who inherited a great situation and is only making it better.\n\n\r\n              Key moment\r\n              Sensing the need to take over, Mitchell opened the fourth quarter with a 3-pointer and scored Cleveland's first nine points of the period. He had 18 in the last 12 minutes.\n\n\r\n              Key stat\r\n              Cleveland set a franchise record for points in a quarter with 49 in the first.\n\n\r\n              Up next\r\n              Cleveland hosts Houston on Sunday, the same day the Cavs welcome the Hornets.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997106.747099
}