{
  "game_id": "0022200707",
  "espn_id": "401468862",
  "date": "Jan 23, 2023",
  "matchup": "ORL vs. BOS",
  "headline": "Banchero, Isaac, Magic end Celtics' 9-game win streak 113-98",
  "body": "ORLANDO, Fla. -- — Paolo Banchero scored 23 points, Jonathan Isaac played in an NBA game for the first time in 2 1/2 years and the Orlando Magic broke the Boston Celtics' nine-game winning streak Monday night with a 113-98 victory.\n\n\r\n              Jayson Tatum and Jaylen Brown scored 26 points apiece for the Celtics, who managed just three points after Tatum's 3-pointer cut Orlando's lead to 97-95 with 6:20 remaining.\n\n\r\n              “We guarded in that second half,” said Cole Anthony, who came off the Magic bench with 18 points, five rebounds, four assists and two steals. “Under 100 points for a a team that’s got two guys (Tatum and Brown) averaging 60 points? That’s a heck of a job by our team.”\n\n\r\n              Wendell Carter Jr. had 21 points and 11 rebounds for the Magic, who beat the Celtics for the third straight time after losing 10 straight to Boston. \n\n\r\n              “We had 18 turnovers,” said Tatum. who had three of them. “They have long, active guys, and you’ve got to take care of the basketball.”\n\n\r\n              The Celtics, whose 35-13 record is still the best in the NBA, had not lost since Jan. 3 at Oklahoma City.\n\n\r\n               “I think it says more about Orlando and how they played tonight,” said Boston interim coach Joe Mazzulla. “They were physical, they had an edge about them and I thought they played really well.”\n\n\r\n              Isaac missed 211 games since tearing his ACL in the NBA's restart at Walt Disney World on Aug. 2, 2020. He finished with 10 points, three rebounds and two steals, playing about 9 1/2 minutes.\n\n\r\n              “Much love to the Magic for sticking with me,” Isaac said. “And the Magic fans were excited, so I was just trying to bottle all that up in one moment. It was surreal.”\n\n\r\n              Banchero made 3 of 5 3-pointers and had five rebounds.\n\n\r\n               “Obviously he’s probably the Rookie of the Year and he’s getting better every month,” Tatum said.\n\n\r\n              After Mo Wagner's 3-pointer put the Magic up 43-29 in the second quarter, they went 5:21 before scoring another field goal. Tatum scored the last six points on a 12-0 run that lifted the Celtics to their first lead of the game, 45-44 with 4:10 left in the first half.\n\n\r\n              Orlando led 55-54 at halftime, then opened up a 13-point lead with the help of 3-pointers by Isaac and Gary Harris during a 15-3 run midway through the third quarter.\n\n\r\n              “I know they came out and hit some really tough shots early on, but we stayed he course from there,\" said Magic coach Jamahl Mosley. “Then obviously we wanted to make sure it was a defensive effort down the stretch.”\n\n\r\n              TIP-INS\n\n\r\n              Celtics: G Marcus Smart (right ankle) and F/C Robert Williams III (hyperextended left knee) did not play after getting injured Saturday night at Toronto. ... G Malcolm Brogdon missed the game for personal reasons. ... Tatum went to the Boston locker room with 6:47 left in the third quarter with a “cramping on the side of my stomach,” but re-entered the game with 2:04 left in the period.\n\n\r\n              Magic: Franz Wagner had 15 points, seven rebounds and a game-leading plus-17 plus/minus ratio. . . . The Magic shot 51.2 overall and 11 for 27 (40.7%) from 3-point range . . . Fultz's slam dunk with 7:49 left in the third quarter was the first field goal by a Magic starting guard. \n\n\r\n              UP NEXT\n\n\r\n              Celtics: At Miami on Tuesday night.\n\n\r\n              Magic: Host Indiana on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994626.3400378
}