{
  "game_id": "0021800376",
  "espn_id": "401071057",
  "date": "Dec 07, 2018",
  "matchup": "PHX vs. MIA",
  "headline": "Adebayo's career-high 22 points helps Heat beat Suns 115-98",
  "body": "PHOENIX --  The depleted Phoenix Suns gave the Heat a little resistance before normalcy was restored, and Miami became the latest team to win in the desert.\n\nBam Adebayo scored a career-high 22 points, 20 in the first half, and the Heat opened a six-game trip by handing the Suns their eighth straight loss, 115-98, on Friday night.\n\nJustise Winslow added 20 points, including all four of his 3-point tries, and Rodney McGruder scored 14 points for Miami. Goran Dragic, back after missing eight games with a sore right knee, had 11 points and 10 assists.\n\n\"It feels good,\" Dragic said. \"I was a little winded but I feel great. I'm satisfied.\"\n\nThe Suns again were without their top two scorers. Devin Booker missed his third straight with left hamstring strain, and T.J. Warren his fifth straight with right ankle soreness.\n\nTroy Daniels made 6-of-10 3-pointers for a season-high 18 points for Phoenix. Deandre Ayton had 16 points and 11 rebounds for Phoenix. Rookie De'Anthony Melton, in his first career start, scored all 12 of his points in the third quarter for the Suns, who, at 4-22, have the NBA's worst record.\n\n\"After the first quarter, that wasn't the tone we wanted to set for the game,\" Heat coach Erik Spoelstra said. \"From there we followed up with a 14-point defensive quarter in the second quarter and some good things in the second half on both sides of the floor.\"\n\nAfter scoring fewer than 10 points in the first quarter of each of their previous two games, the Suns shot out to a 36-34 lead after one period against Miami.\n\nBut coach Igor Kokoskov had a hard time calling it an improved offensive performance, considering his team's 21 turnovers (resulting in 29 Miami points).\n\n\"It cost us the game,\" he said.\n\nStill, Kokoskov said, \"the energy was much, much better than last night\" in a blowout loss in Portland.\n\nDaniels' third 3-pointer of the half gave Phoenix its last lead, 45-43, with 4:53 left in the second quarter. Miami scored the next 11 points in what became a 17-2 run. McGruder's 3-pointer capped the outburst and put the Heat up 60-47. Mikal Bridges' steal and 3-pointer at the buzzer cut the Miami lead to 60-50 at the half.\n\nRichardson and McGruder sank 3s in an 8-0 spurt that put the Heat ahead 80-62, and they led 89-73 entering the fourth quarter.\n\nPhoenix briefly cut it to 91-79 before an 8-1 surge made it 99-80 with eight minutes left. The Heat led by as many as 22 points after that.\n\nADEBAYO TIME\n\nAdebayo, who also grabbed 10 rebounds, got extra playing time with the absence of Hassan Whiteside.\n\n\"I feel like I do that every night. I provide energy if he's in or he's out,\" Adebayo said. \"I just had to take care of business. There was just a lot of energy.\"\n\nSpoelstra said of Adebayo, \"He was all over the place.\"\n\nTIP-INS\n\nHeat: Miami was without Wayne Ellington due to a death in the family and is expected back on Monday. Whiteside remained in Miami for the birth of his first child. ...  Adebayo's previous career high was 19 points at Cleveland on Nov. 28, 2017. ... It was Miami's first road game against a Western Conference team this season. ... The Heat have won 19 of their last 21 against Phoenix. ... Dwyane Wade stuck around and talked to cheering fans, and traded jerseys with Jamal Crawford, after his last game in Phoenix. Wade is retiring after this season and this was the first of his last visits to NBA cities.\n\nSuns: In the previous two contests, Phoenix was the first NBA team in the shot-clock era to score fewer than 10 points in the first quarter of consecutive games. ... Daniels hit double figures for the third straight game. ... Phoenix signed G Juwan Evans to a two-way contract. Evans and another G-League player, George King, were active for the Suns Friday.\n\nUP NEXT\n\nHeat: At Los Angeles Clippers on Saturday.\n\nSuns: Host Los Angeles Clippers on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995093.4043572
}