{
  "game_id": "401809795",
  "espn_id": "401809795",
  "date": "Nov 21, 2025",
  "matchup": "PHX vs MIN",
  "headline": "Gillespie hits go-ahead jumper with 6.4 seconds left, Suns rally to stun Timberwolves 114-113",
  "body": "PHOENIX -- — Collin Gillespie made a go-ahead jumper with 6.4 seconds left and the Phoenix Suns stunned the Minnesota Timberwolves 114-113 on Friday night with a final-minute rally.\n\n\r\n              Minnesota appeared to have a comfortable 113-105 lead with 1:09 left, but Phoenix rallied to cut it to 113-112 on Jordan Goodwin’s layup with 21.4 seconds remaining.\n\n\r\n              Minnesota's Anthony Edwards — who had 41 points — missed two free throws with 12.7 seconds to go, giving the Suns a chance at the win.\n\n\r\n              Gillespie obliged, driving into the lane and hitting a contested 10-foot jumper for the lead and the last of his 20 points.\n\n\r\n              Minnesota scrambled for the final shot, but Julius Randle's 3-pointer at the buzzer was off the mark.\n\n\r\n              The Timberwolves erased a 15-point halftime deficit less than five minutes into the third quarter after Edwards made a driving layup for a 69-68 advantage. Edwards — a three-time All-Star — had 19 points in the third on 7-of-9 shooting and Minnesota led 82-81 entering the fourth.\n\n\r\n              It was a tough night for Suns star Devin Booker, who finished with just 16 points on 4-of-18 shooting and nine turnovers before fouling out. Turnovers have been a problem for the four-time All-Star — he came into the game with a league-high 57.\n\n\r\n              Booker fouled out with more than three minutes remaining and earned a technical foul on his way off the floor. The Suns had 27 turnovers.\n\n\r\n              Dillon Brooks led the Suns with 22 points before fouling out. Williams added 19.\n\n\r\n              The Suns led by 18 points in the first half before settling for a 62-49 halftime advantage. Gillespie led the Suns with 16 points after making four 3-pointers. Edwards had 16 for the Wolves before the break.\n\n\r\n              The Suns improved to 2-0 in the NBA Cup, while the Timberwolves fell to 2-1.\n\n\r\n              Up next\r\n              Timberwolves: At Sacramento on Monday night.\n\n\r\n              Suns: Host San Antonio on Sunday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042670.2095628
}