{
  "game_id": "0021900105",
  "espn_id": "401160747",
  "date": "Nov 06, 2019",
  "matchup": "CHI @ ATL",
  "headline": "Bulls race to big lead in opening minutes, rout Hawks 113-93",
  "body": "ATLANTA --  For the second night in a row, the Chicago Bulls took a big lead into the fourth quarter.\n\nThis time, they didn't let up.\n\nTomas Satoransky scored a career-high 27 points and the Bulls won for just the third time in nine games with easily their most impressive performance of the young season, routing the Atlanta Hawks 113-93 on Wednesday.\n\n\"We were all frustrated by the way the last game went,\" said Satoransky, who went 10 of 13 from the field, including 4 of 5 from 3-point range.\n\nThe Bulls built a big lead against LeBron James and the Lakers the night before, only to get outscored 38-19 in the fourth quarter of a 118-112 loss.\n\nTaking out their frustration on the Hawks, this one was total domination.\n\nSatoransky had not scored more than nine points this season. He really went off on the Hawks, beating his previous career best of 25 while also dishing out eight assists.\n\nZach LaVine even got a chance to put on his version of Showtime, blocking De'Andre Hunter's 3-pointer to set up a 360-degree dunk at the other end.\n\n\"We put it together tonight,\" Coby White said. \"Both halves.\"\n\nAtlanta made a season-low six of 30 attempts from 3-point range, turned it over 24 times and trailed by double digits over the final 41:29.\n\n\"Our guys were not ready,\" Hawks coach Lloyd Pierce said bluntly. \"We just didn't care.\"\n\nThe Bulls took control with a 28-6 run in the opening quarter. Otto Porter Jr. led with way with 10 points, including a couple of 3-pointers. Satoransky chipped in with seven points, Kris Dunn added five and Lauri Markkanen knocked down a 3 to push Chicago to a 30-12 lead.\n\nPorter went down before halftime with a bruised left foot and did not return.\n\nHe wasn't needed.\n\nThe Bulls were up 56-41 at the break, closing the half with a couple of quick passes around the perimeter to set up Satoransky's 3 from the corner as the buzzer sounded. It was the lowest-scoring first half of the season for the Hawks.\n\nChicago stretched the margin as high as 28 points.\n\n\"We played 40 really good minutes last night and that's not enough,\" Bulls coach Jim Boylen said. \"They were hurting from the way the game ended last night.\"\n\nStarting his second straight game in place of John Collins, Jabari Parker led the Hawks with 18 points. Collins is serving a 25-game suspension after violating the NBA's doping policy.\n\nBut Pierce wasn't in the mood to praise anyone.\n\n\"The only positive from this game: It's over,\" the Atlanta coach said. \"We don't have to worry about it anymore.\"\n\nYOUNG STRUGGLES\n\nIt was a miserable night for Atlanta's Trae Young, on the heels of a dazzling 29-point, 13-assist performance in a victory over San Antonio the previous night.\n\nThe point guard managed just nine points and three assists, missing all eight attempts beyond the arc.\n\n\"Coming off a big win, you've got to be mentally focused. You've got to approach every game like it's your last,\" Young said. \"We didn't do that.\"\n\nPierce said the Bulls were determined to stop Young after he scored 49 points against them in a game last season.\n\n\"They're not going to forget that,\" Pierce said. \"That's the way they're going to play Trae every game the rest of his career.\"\n\nTIP-INS\n\nBulls: Connected on 13 of 33 from 3-point range. ... Markkanen added 17 points, Porter finished with 13 in just 11 minutes, and three other players reached double figures. ... Boylen said he won't have an update on Porter's condition until the team gets back to Chicago.\n\nHawks: Vince Carter, 42, had a season-high 14 points. ... Kevin Huerter, with 12, was the only other Atlanta player in double figures. ... Young wasn't the only player who struggled. Hunter and fellow rookie Cam Reddish combined to go 2 of 15 from the field. \"Cam is trying to beat people with his moves,\" Pierce said. \"You've got to beat people with your readiness.\"\n\nUP NEXT\n\nBulls: Return home to face the Houston Rockets on Saturday.\n\nHawks: Host the Sacramento Kings in the last of three home games in four days before beginning a West Coast trip.\n\n---\n\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 . His work can be found at https://apnews.com\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996368.838007
}