{
  "game_id": "0022000916",
  "espn_id": "401307719",
  "date": "Apr 26, 2021",
  "matchup": "ATL @ DET",
  "headline": "Dunn returns, but Hawks fall 100-86 to Pistons",
  "body": "DETROIT -- — Jerami Grant and Frank Jackson scored 18 points apiece to lift the Detroit Pistons to a 100-86 victory over the Atlanta Hawks on Monday night.\n\n\r\n                    The Hawks shot just 39% from the field and 4 of 27 from 3-point range. It was their lowest-scoring game of the season.\n\n\r\n                    “They started with pressure and continued with that pressure for 48 minutes,” Atlanta coach Nate McMillan said. \"I don’t think it was our players’ letdown. ... I thought Detroit just played aggressive, physical basketball on the defensive end of the floor.”\n\n\r\n                    There was one bright note for Atlanta: Kris Dunn made his first appearance of the season following right ankle surgery. Dunn, who signed with the Hawks in the offseason, went scoreless in 13:11.\n\n\r\n                    “A lot of emotions — I was nervous, anxious, excited,” said Dunn, who has also dealt with knee issues. “It felt good to be back out there.”\n\n\r\n                    Atlanta still wasn’t close to full strength, with Trae Young (left ankle), De’Andre Hunter (right knee), Cam Reddish (right Achilles), Tony Snell (right ankle) and Lou Williams (illness) all out. Then, with 3:17 remaining in the game, Brandon Goodwin went down under the basket and was taken out in a wheelchair.\n\n\r\n                    “It has been that type of year, where you’re just holding your breath every time someone hits the floor,” said McMillan, who also said Kevin Huerter had a stinger.\n\n\r\n                    Bogdan Bogdanovic led Atlanta with 17 points. Huerter added 15 and John Collins contributed 14. Clint Capela had 12 points and 15 rebounds\n\n\r\n                    Cory Joseph scored 15 points and Hamidou Diallo added 14 for the Pistons, who took a 14-point lead in the second quarter and never really relinquished control. The Hawks trailed by seven after three but could not get closer in the fourth.\n\n\r\n                    Detroit's starters didn't play at all in the fourth.\n\n\r\n                    “I feel like the good thing about this team, from top to bottom we can all play and we can all finish games,” Diallo said.\n\n\r\n                    Atlanta is 20-8 since the beginning of March, but the Hawks managed only 19 points in the final period against Detroit's tough defense.\n\n\r\n                    “It starts with the perimeter,” Pistons coach Dwane Casey said. “That way you don’t put as much pressure on the big guys at the rim.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Bogdanovic has scored at least 10 points in 16 straight games, tying a career-long streak. ... Capela has at least 10 rebounds in 14 consecutive games played, the longest active streak in the NBA.\n\n\r\n                    Pistons: Detroit was without Josh Jackson (illness), Rodney McGruder (right elbow) and Dennis Smith Jr. (left knee).\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Visit Philadelphia on Wednesday night for the first of two straight games against the 76ers.\n\n\r\n                    Pistons: Host Dallas on Thursday night. The Mavericks beat Detroit 127-117 last Wednesday.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997623.071868
}