{
  "game_id": "0022200583",
  "espn_id": "401468738",
  "date": "Jan 06, 2023",
  "matchup": "CHA @ MIL",
  "headline": "Rozier, record 1st quarter lead Hornets past Bucks 138-109",
  "body": "MILWAUKEE -- — Terry Rozier scored a season-high 39 points and the Charlotte Hornets matched an NBA record with 51 in the first quarter of a 138-109 rout of the Milwaukee Bucks on Friday night.\n\n\r\n              Charlotte’s 51-point outburst tied the NBA mark for a first quarter set by Golden State against Denver in 2019. It also was a franchise record for most points in any period.\n\n\r\n              “We made a bunch of shots early. We played really four good quarters,” Hornets coach Steve Clifford said. “The starters were terrific, they set a tone. The guys that came off the bench played well, too. It was the most sustained good solid play we’ve had so far this year.”\n\n\r\n              Milwaukee star Giannis Antetokounmpo, who entered third in the league in scoring at 32.7 points per game, had a season-low nine in 22 minutes. He shot 2 of 7 from the field and 5 for 11 at the foul line. Antetokounmpo’s previous low this season was 16 points on two occasions.\n\n\r\n              Bobby Portis had 19 points and 12 rebounds in his sixth consecutive double-double for the Bucks, who have lost six of nine.\n\n\r\n              “We haven’t matched what it takes to be competitive in an NBA game on multiple occasions now,” coach Mike Budenholzer said. “And, it’s concerning.”\n\n\r\n              LaMelo Ball added 24 points and P.J. Washington had 23 for the Hornets, whose 10-29 record entering the game was tied for worst in the NBA.\n\n\r\n              “Those guys are a great team, one of the better teams in the league,” Washington said. “We knew we had to keep the pressure up and we knew we had to keep doing what we were doing and attacking. Credit to everybody. Everybody came ready to play, everybody was locked in.”\n\n\r\n              Charlotte had a 35-1 advantage in points off turnovers, forcing 17 while committing just five. The Hornets also had a 24-11 edge in second-chance points.\n\n\r\n              “They found ways to score the basketball off of the extra possessions that we gave them that we can’t afford to give,” Milwaukee’s Pat Connaughton said. \n\n\r\n              Charlotte led 51-28 after the first quarter and pushed the lead to 84-60 at halftime, hitting 14 of 30 3-pointers. The 84 points were the second-most in any half in franchise history, trailing only 87 by the Hornets in the second half last season during a 156-128 win at Indiana.\n\n\r\n              Rozier had 25 points in the first half on 10-of-17 shooting, including 5 of 11 from deep. Ball was 6 of 9 on 3-pointers en route to 19 points before the break.\n\n\r\n              Charlotte led 112-87 entering the fourth quarter.\n\n\r\n              The Hornets, whose biggest lead of the first quarter was 45-17, hit 20 of 29 shots in the opening period for 69%, including 7 of 14 beyond the arc.\n\n\r\n              “We didn’t play great defense. They got a lot of offensive rebounds, they shot very well, they played well in transition,” said Bucks center Brook Lopez. “It was a number of things, it wasn’t just any one thing.”\n\n\r\n              TIP-INS\n\n\r\n              Hornets: F Gordon Hayward (left hamstring soreness) missed his second consecutive game. ... Charlotte opened a four-game trip and plays eight of its next 10 on the road.\n\n\r\n              Bucks: G George Hill, listed at 6-foot-4 and 190 pounds, said he has gained back six of the 10 pounds he lost in five days with a recent non-COVID-19 illness that forced him to miss the last four games. “We’ve had a few jokes about how could George lose 10 pounds?” Budenholzer said. Hill entered the game in the fourth quarter. … F Khris Middleton, out since Dec. 15 with right knee soreness, was again inactive but has been on the court the last couple of days, Budenholzer said. Middleton is expected to make the upcoming four-game road trip, but Budenholzer would not say if he’s expected to play.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At Indiana on Sunday.\n\n\r\n              Bucks: At the New York Knicks on Monday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994268.9230778
}