{
  "game_id": "0022400788",
  "espn_id": "401705354",
  "date": "Feb 20, 2025",
  "matchup": "MEM @ IND",
  "headline": "Pacers overcome slow start with 50-point 2nd quarter and pull away from Grizzlies 127-113",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton scored 22 points and Myles Turner had 17 points, 10 rebounds and a season-high seven blocks to help the Indiana Pacers pull away from the Memphis Grizzlies 127-113 on Thursday night.\n\n\r\n              Indiana missed its first seven shots and first eight 3-pointers in its first game since the All-Star break and still managed to score a season-high 78 points in the first half. Seven Pacers scored in double digits and Haliburton had nine assists.\n\n\r\n              Desmond Bane led the Grizzlies with 23 points and seven assists. Jaren Jackson Jr. had 18 points and seven rebounds, while Ja Morant had 12 points for Memphis. Former Purdue star Zach Edey, the two-time NCAA Player of the Year, had five points and 11 rebounds in his first NBA game in Indiana.\n\n\r\n              Memphis took a 20-7 lead midway through the first quarter, but the Pacers charged back fast in the second, taking their first lead at 48-46 before Turner scored the first 12 points in a 23-4 run that staked Indiana to a 78-50 halftime lead.\n\n\r\n              The Grizzlies closed to 91-87 in the third quarter, but Indiana scored seven straight and was never seriously challenged again.\n\n\r\n              Takeaways\r\n              Grizzlies: Memphis confounded the Pacers early with two very different playing styles — one with Edey on the floor, the other without. But the defensive breakdowns were too much to overcome.\n\n\r\n              Pacers: The Pacers knocked off the rust, eventually settled down, found open shooters and put on a memorable scoring performance.\n\n\r\n              Key moment\r\n              Turner's 3 with 5:42 left in the first half started a six-basket stretch in which the Pacers made four 3s and had two three-point plays.\n\n\r\n              Key stat\r\n              Indiana made 12 of its final 19 3s in the first half, leading to a 50-point second quarter.\n\n\r\n              Up next\r\n              The Grizzlies head to Orlando on Friday. while Indiana hosts the Los Angeles Clippers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997600.547153
}