{
  "game_id": "0022300499",
  "espn_id": "401585127",
  "date": "Jan 07, 2024",
  "matchup": "ORL vs. ATL",
  "headline": "Banchero, Houstan lead Magic past Hawks, 117-110 in overtime",
  "body": "ORLANDO, Fla. -- — Paolo Banchero scored eight of his 35 points in overtime, Caleb Houstan added a career-high 25 points and the Orlando Magic beat the Atlanta Hawks 117-110 on Sunday night.\n\n\r\n              Magic coach Jamahl Mosley called Banchero “a winner” and Houstan “a machine,” and they were just enough for Orlando to turn back Atlanta rallies in each half.\n\n\r\n              The 21-year-old Banchero scored Orlando's first six points in overtime and also had 10 rebounds.\n\n\r\n              “He’s a winner. He’s going to find a way to help the team win,” Mosley said about Banchero, who has averaged 32.3 points in Orlando's last six games. “This young man is growing more each game.”\n\n\r\n              Houstan was 7 of 14 from 3-point range in his first start of the season and only the fifth of his career. \n\n\r\n              “We talk about the next man up. I’m just tryin to stay read when my name is called,” he said.\n\n\r\n              Trae Young had 31 points and nine assists for Atlanta. Dejounte Murray added 24 points and Bogdan Bogdanovic had 18 points.\n\n\r\n              Saddiq Bey’s dunk with 18.8 seconds left in the fourth tied it for the Hawks, and Houston missed a 3-pointer at the buzzer to send it to overtime.\n\n\r\n              The Hawks erased sizeable Orlando leads in each half, and might have won except for missing 12 free throws and taking a 25-6 beating on second-chance points. \n\n\r\n              “Players are going to make shots, but when they miss we’ve got to clean up the glass,” Hawks coach Quin Snyder said. “We had a rough start, but we really competed and put ourselves in position to win the game. But you can’t give them multiple opportunities.”\n\n\r\n              Banchero, Goga Bitadze (14) and Cole Anthony (9) led Orlando to a 57-50 advantage on the boards.\n\n\r\n              Orlando's Markelle Fultz, who missed 27 games because of a knee injury, played for the first time since Nov. 9 in a game against the Hawks in Mexico City. He had four assists in 10 scoreless minutes.\n\n\r\n              “We’re more worried about the long haul here,” said Fultz, who missed all four of his free throws. “We got a win so I couldn’t be happier.”\n\n\r\n              Atlanta lost Garrison Mathews to an apparent ankle injury in the first quarter.\n\n\r\n              Two replay reversals helped the Magic late in the game. A blocking call on Bitadze was changed to a non-foul with 4:59 left when officials determined that the Magic center had “exhibited all legal principles of verticality.\" \n\n\r\n              And a charging call on Banchero in overtime was changed to a block on Clint Capela, who was ruled to have moved into Banchero's path too late.\n\n\r\n               UP NEXT\n\n\r\n              Hawks: Host Philadelphia on Wednesday night.\n\n\r\n              Magic: Host Minnesota on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995714.482481
}