{
  "game_id": "0022200151",
  "espn_id": "401468306",
  "date": "Nov 07, 2022",
  "matchup": "TOR @ CHI",
  "headline": "Zach LaVine's 30 points pace Bulls past Raptors 111-97",
  "body": "CHICAGO -- — Zach LaVine scored a season-high 30 points and the Chicago Bulls coasted to a 111-97 victory over the Toronto Raptors on Monday night.\n\n\r\n              LaVine, who didn't play in Sunday's nine-point loss at Toronto because of injury management on his knee, scored the Bulls' first nine points of the fourth quarter before committing his fifth foul with 7:26 left.\n\n\r\n              But the Bulls held a 15-point lead and were able to cruise the rest of the way.\n\n\r\n              “When (LaVine) takes those catch-and-shoot opportunities, as many as he can get, it's great for us,” Bulls coach Billy Donovan said.\n\n\r\n              Bulls center Nikola Vucevic recorded his fourth consecutive double-double with 15 points and 13 rebounds.\n\n\r\n              Guard Fred VanVleet led the Raptors with 27 points. \n\n\r\n              For the second time in two nights, the Raptors double-teamed Bulls leading scorer DeMar DeRozan, who took only three shots in the first half and scored his first points on a three-point play with 2:43 left in the second quarter. DeRozan finished with nine points, equaling his season low.\n\n\r\n              “You got to give credit to DeMar for passing it around, taking on the double-team, and I think we did a better job of keeping him to the middle of the floor to where he could read (the defense) easier,\" LaVine said.\n\n\r\n              But the Bulls relied effectively on their depth to shake off a slow start in which they committed five turnovers in the first five minutes.\n\n\r\n              Reserves Goran Dragic and Javonte Green scored 15 of the Bulls' 30 first-quarter points that enabled them to overcome a nine-point deficit. That compensated for the brief loss of LaVine, who committed two fouls slightly more than four minutes into the game.\n\n\r\n              “Those first three or four minutes, we needed to change something up,” Donovan said.\n\n\r\n              Raptors swingman Scottie Barnes missed his first six shots but responded with a thundering dunk, and Gary Trent Jr. followed with a three-pointer that cut the Raptors' deficit to 56-53 with less than a minute left in the second quarter.\n\n\r\n              “We just didn't have quite enough juice,” Raptors coach Nick Nurse said.\n\n\r\n              BACK TO BASICS\n\n\r\n              The Bulls will play one game in their next five days, and Donovan plans to maximize their practice time that had been reduced to morning shooting sessions or rest following back-to-back games. “I think what we need more than anything else is, even for some of our younger guys that are playing like this, is a lot of attacking closeouts, reading the defense, how to drive it, how to space it and relocate.,” Donovan said. “We need to work on more of those concepts.”\n\n\r\n              ACADEMICALLY SPEAKING\n\n\r\n              Nurse returned to Chicago for the first time since earning his Ph.D in Sports Leadership from Concordia University in nearby River Forest last May. “I put that so far in my rear view mirror now that it's done,” joked Nurse, who did revisit that moment Monday with one of his professors.\n\n\r\n              TIP-INS\n\n\r\n              Raptors: C Khem Birch (right knee) underwent an MRI, and Nurse said doctors are determining how the soreness can be managed in a quick manner for him to return. Birch missed his third consecutive game.\n\n\r\n              Bulls: C Andre Drummond (left shoulder) was ruled out prior to tipoff.. Doctors were concerned with his range of motion. ... G Coby White (left quad) has experienced reduced swelling, but he has been relegated to light basketball work and is not close to returning, Donovan said. ... G Ayo Dosunmu made a pregame plea for fans to participate Tuesday on Election Day.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Houston Wednesday night.\n\n\r\n              Bulls: Host New Orleans Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994099.444152
}