{
  "game_id": "0022200894",
  "espn_id": "401469049",
  "date": "Feb 23, 2023",
  "matchup": "SAC vs. POR",
  "headline": "Fox, Sabonis help Kings rout short-handed Blazers 133-116",
  "body": "SACRAMENTO, Calif. -- — De’Aaron Fox scored 31 points, Domantas Sabonis had his seventh triple-double of the season and the Sacramento Kings beat the short-handed Portland Trail Blazers 133-116 on Thursday night.\n\n\r\n              “We started off slow tonight and it gave Portland a lot of confidence,” Kings coach Mike Brown said. “Big test for us tomorrow night. Our bench did a nice job coming in and getting stops.”\n\n\r\n              Sabonis had 18 points, 18 rebounds and 10 assists to help the Kings improve to 33-25. Terence Davis scored 20 points off the bench and Harrison Barnes added 15. Sacramento trailed by 16 points in the first half.\n\n\r\n              “I wasn’t worried,” Sabonis said about the slow start. \"Once we got our wind under us, I knew that we would be alright.”\n\n\r\n              Nassir Little scored 26 points for Portland. Cam Reddish added 24 and Trendon Watford had 15. Portland has lost three of its last four to drop to 28-31.\n\n\r\n              “I thought we played hard,” Trail Blazers coach Chauncey Billups said. “I thought we played well. … I was happy to see Nassir get hot. He did a good job of picking the right spots to shoot.”\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: Damian Lillard (rest), Jermani Grant (rest), Jusuf Nurkic (calf strain), Anfernee Simons (ankle sprain) and Justice Winslow (ankle sprain) were all ruled out before the game.\n\n\r\n              Kings: F KZ Okpala was ruled out with knee soreness. … G Malik Monk returned to the lineup after exiting the Mavericks game with a leg injury prior to the NBA All-Star game break. … Sabonis has 15 or more rebounds in 13 games this season.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Host Houston on Sunday night.\n\n\r\n              Kings: At Los Angeles Clippers on Friday night.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995293.379803
}