{
  "game_id": "0022000535",
  "espn_id": "401267695",
  "date": "Mar 01, 2021",
  "matchup": "CHA @ POR",
  "headline": "Carmelo Anthony has 29 and Blazers down Hornets 123-111",
  "body": "PORTLAND, Ore. -- — After Portland's Carmelo Anthony scored 29 points against Charlotte, he exchanged jerseys with Hornets rookie LaMelo Ball, who had 30. \n\n\r\n                    It was a bit of mutual Melo admiration. \n\n\r\n                    Anthony had six of Portland's franchise-record 24 3-pointers and the Trail Blazers snapped a four-game losing streak with a 123-111 victory on Monday night. \n\n\r\n                    “I try to embrace the next generation of guys and the young players,” Anthony said of the jersey exchange. \"It was fun playing against (Ball) tonight. I've been watching him since he was in high school. Just being across from him tonight, getting a chance to really see his game up close in person, getting to see him and what kind of person he is, so it was only right that we did that tonight.\" \n\n\r\n                    At one point Ball hit a 3-pointer and did Anthony's signature 3-to-the-dome gesture. \n\n\r\n                    “He can do it. He can only do it one time, but he can do it,” Anthony laughed. “I blessed him, let him know that he can carry it on.”\n\n\r\n                    Ball said: “Pretty much it's just all love and respect both ways.”\n\n\r\n                    Damian Lillard had 21 points and 10 assists and Robert Covington contributed a season-high 21 points and 10 rebounds for the Blazers, who got off to a sluggish start but led by as many as 19 points in the final quarter. Lillard also had six 3s. \n\n\r\n                    The Hornets have not won in Portland since March 2008. The Blazers are 25-6 against Charlotte in Portland. \n\n\r\n                    Portland had fallen into sixth place in the Western Conference, a half-game back of San Antonio. But the Blazers were hoping a quick three-game homestand before the All-Star break puts them back on track\n\n\r\n                    The Hornets had just nine players available for the game, with top scorer Gordon Hayward (hand contusion) and Cody Zeller (hip contusion) both unavailable. Devonte Graham missed his sixth straight game with left knee soreness. \n\n\r\n                    “That's all we have, this is our roster. These are the active bodies and we will continue to fight with what's available,” Hornets coach James Borrego said. “That's all we can do.”\n\n\r\n                    Charlotte, playing the second of a back-to-back, was coming off a 127-126 victory at Sacramento the night before. P.J. Washington scored a career-high 42 points. \n\n\r\n                    The Hornets jumped out to a 26-17 lead in the opening quarter, led by Ball with eight points, and pushed the lead to as many as 11. \n\n\r\n                    Portland chipped away, pulling into a 40-all tie on Anthony's dunk. He followed that with a basket and a free throw that put the Blazers in front. \n\n\r\n                    The two sides wrestled for the lead the rest of the opening half, going into the break knotted at 59. Covington led all scorers with 16 points and seven rebounds.\n\n\r\n                    Gary Trent Jr.'s 3-pointer put the Blazers in front 68-61 early in the second half. Portland stretched it to 92-81 on Lillard's 3 pointer and the Blazers cruised the rest of the way. \n\n\r\n                    Anthony had 17 points in the fourth quarter. \n\n\r\n                    “I like the way Melo stuck with it. He got off to a slow start in the first half, but he ended up making a lot of plays in the first half and obviously his shooting in the second half really got us over the hump,” Blazers coach Terry Stotts said. “I always like it, no matter who it is, but when Melo gets on a roll it's fun to watch.” \n\n\r\n                    Lillard went into the game averaging 29.8 points and eight rebounds. He ranks third in the league for scoring, behind Washington's Bradley Beal and Philadelphia's Joel Embiid. \n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Charlotte's losing streak in Portland is now at 13 games. ... It was the fifth game of a six-game road trip for the Hornets. \n\n\r\n                    Trail Blazers: Portland was coming off a six-game road trip, wrapping it up with a 2-4 record. ... The Blazers have swept the season series with the Hornets for the past three seasons. \n\n\r\n                    ROOKIE'S ROLL\n\n\r\n                    Ball had his fifth straight game with 20-plus points. \n\n\r\n                    “He makes plays. he gets in passing lanes. He gets his hands on balls, he anticipates at a high level,” Borrego said. \n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Visit the Minnesota Timberwolves on Wednesday before the All-Star break. \n\n\r\n                    Trail Blazers: Play the Golden State Warriors in the first of a back-to-back on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764997020.869798
}