{
  "game_id": "0021400676",
  "espn_id": "400578968",
  "date": "Jan 27, 2015",
  "matchup": "DET vs. CLE",
  "headline": "Irving, James boost Cavs past Pistons for 7th win in row",
  "body": "AUBURN HILLS, Mich. -- LeBron James came leaping in to try to stop Jodie Meeks as the Detroit guard drove to the basket during the final seconds of the third quarter.\nAfter colliding with Meeks, James put his hands out to break his fall before sliding across the floor on his stomach.\n\"I was scared, because I broke my wrist on a fall like that in high school,\" James said. \"I was either going to land on my face or break the fall with my hands, but when I hit, both my arms went numb. I'm OK now -- it was just something like a stinger -- but I wasn't sure at first.\"\nJames barely missed any game time after that anxious moment, and he finished with 32 points to help the Cleveland Cavaliers to their seventh straight victory Tuesday night, 103-95 over the Pistons. Kyrie Irving matched his season high with 38 points.\n\nThe Cavs never trailed in the second half, but when James hit the deck and didn't immediately get up, that was plenty to be concerned about.\n\"That is obviously a time of worry, which is the understatement of the year,\" Cleveland coach David Blatt said. \"In a situation like that, you are just hoping he is OK.\"\nJames quickly came back in the game, and his two-handed breakaway dunk early in the fourth put Cleveland up 80-68.\nGreg Monroe had 17 points and 12 rebounds for the Pistons, who pulled within eight and had the ball late in the fourth quarter, but Kentavious Caldwell-Pope was unable to connect from 3-point range. James drew a foul at the other end and made both free throws to make it 88-78 with 2:56 to play.\nCaldwell-Pope was fouled by James while shooting a 3-pointer with 2:00 remaining, and that trio of free throws made it 90-83. The Pistons got the ball back, but Andre Drummond missed a layup, and Irving connected from beyond the arc.\nThe Cavs avenged a 23-point home loss to Detroit late last month. That game was part of a seven-game winning streak for the Pistons, but now Detroit is struggling to overcome the loss of Brandon Jennings, who ruptured his left Achilles tendon over the weekend and will miss the rest of the season.\nIRVING'S BIG NIGHT\nDetroit led 19-17 after a first quarter, in which the teams combined to shoot 1-for-16 from outside the paint. Cleveland shrugged off that rough start and reached 100 points for the eighth straight game.\nIrving was 6-of-10 from 3-point range. The rest of the Cavs went 3-of-24.\n\"That's the luxury of playing with a great player like LeBron. When he's on the floor, you know there are going to be things opened up for the rest of you,\" Irving said. \"Tonight, we had a lot of open shots, and we got enough of them to go down.\"\nUNDERMANNED\nD.J. Augustin, Detroit's starting point guard now in Jennings' absence, had 19 points and nine assists, but the Pistons have lost three in a row. That skid began with the game at Milwaukee in which Jennings got hurt, but coach Stan Van Gundy says the team needs to move forward without him.\n\"We've got good enough players to win,\" Van Gundy said. \"We had good enough players in there tonight to win. We just needed to do a couple of things better, and we're not going to come in here after every loss now and talk about Brandon's effect on it -- at least I'm not.\"\nCleveland outscored Detroit 50-48 in the paint. Drummond had 12 points and 17 rebounds but shot just 6-of-17.\nTIP-INS\nCavaliers: Cleveland had won its previous four games by double digits before Tuesday. ... The Cavs are without big man Anderson Varejao, who like Jennings ruptured his left Achilles tendon.\nPistons: Detroit had 18 turnovers while Cleveland committed only nine.\nUP NEXT\nCavaliers: Host Portland on Wednesday night.\nPistons: Play at Philadelphia on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764993774.132212
}