{
  "game_id": "0022001050",
  "espn_id": "401307860",
  "date": "May 13, 2021",
  "matchup": "MIA vs. PHI",
  "headline": "Heat stay No. 5 in the East, roll past 76ers 106-94",
  "body": "MIAMI -- — Jimmy Butler likes Miami's chances against anybody in a seven-game playoff series.\n\n\r\n                    The Heat showed why Thursday night.\n\n\r\n                    And they showed a little fight, too.\n\n\r\n                    Butler scored 21 points, Bam Adebayo had 18 points and 12 rebounds and the Heat held onto the No. 5 spot in the Eastern Conference, beating the Philadelphia 76ers 106-94 on Thursday night.\n\n\r\n                    “Nobody intimidates us,\" Butler said.\n\n\r\n                    Tyler Herro scored 18 points, Goran Dragic had 15 and Kendrick Nunn added 13. Miami captain Udonis Haslem got his first minutes of the season in the first half, scoring four points and getting ejected with two technical fouls in just under three minutes after going nose-to-nose with Dwight Howard.\n\n\r\n                    “That's my favorite moment of the season so far,\" Heat coach Erik Spoelstra said. “Just excessive passion, competitiveness and anger. Just love it. And that's why we roll with UD. Everybody in that locker room just has great respect and love for him.\"\n\n\r\n                    Tobias Harris scored 21 points, Shake Milton added 12 and Danny Green had 11 for Philadelphia, which could have wrapped up the East’s No. 1 seed with a win. MVP candidate Joel Embiid, who was dealing with the flu earlier in the week, managed only six points on 3-for-9 shooting.\n\n\r\n                    “I just didn't think we were ready to play the game tonight,\" 76ers coach Doc Rivers said. “You could see it early. Everything hurt us; their man hurt us, their zone hurt us, our defense hurt us. ... They got everything they wanted, moved faster, ran harder. South Beach is very tough.\"\n\n\r\n                    Philadelphia (47-23) goes home for its final two games of the season, both against Orlando, one Friday and one Sunday. Win either of those, and no matter what Brooklyn or Milwaukee do the rest of the way the 76ers will be the No. 1 seed in the East for the first time since 2001.\n\n\r\n                    “Obviously, when you have an opportunity to clinch No. 1, it's an added feel of ‘we've got to do it, we've got to do it' and sometimes you lose sight of what really needs to get done,\" Harris said. “For us, it's just to lock in, play the game ... and get that off our back.\"\n\n\r\n                    Miami is 39-31, a half-game behind No. 4 Atlanta (40-31) and tied with No. 6 New York. The Hawks hold a tiebreaker over the Heat; the Heat hold a tiebreaker over the Knicks, who kept pace with a win over San Antonio.\n\n\r\n                    This one was never close. Miami led 38-22 in the first quarter, the last of those points coming on Haslem’s first basket of the season. He was ejected early in the second after exchanging words with Howard — not long after he tried to play peacemaker when Embiid and Miami’s Trevor Ariza got into a back-and-forth.\n\n\r\n                    “A great memory,\" Haslem said.\n\n\r\n                    Ariza got rolled up on by a tumbling Embiid and hurt his ankle, briefly leaving the game. Ariza took exception to the play but was able to eventually return; they talked it out in a calmer fashion at halftime.\n\n\r\n                    Miami led by 22 in the first half, didn’t let the lead fall below 17 in the third and stretched the margin to 26 early in the fourth.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Philadelphia was outrebounded 47-30. ... This was only the third game all season in which Philadelphia trailed by 20 or more in the first half. The 76ers trailed Denver by 24 in the first half on March 30, and Milwaukee by 20 on April 22. ... Matisse Thybulle (swelling in left hand) missed his second consecutive game.\n\n\r\n                    Heat: Nunn left in the second half with left calf soreness but will travel with the Heat on Friday. ... Miami finished the regular season 21-15 at home, only the 22nd-best home mark in the team’s 33 seasons. ... If Duncan Robinson plays in Miami’s final two games, he’ll be the first Heat player to appear in every regular-season game in back-to-back seasons. He has appeared in 145 straight, spanning three seasons.\n\n\r\n                    OLADIPO SURGERY\n\n\r\n                    Miami’s Victor Oladipo had surgery on his right quadriceps tendon in New York on Thursday.\n\n\r\n                    The Heat haven’t released a timetable for his recovery, but Oladipo — who’ll be a free agent this offseason and initially injured the tendon in 2019 — may need at least six months before he can play again. He appeared in only four games for Miami, who acquired him in a trade-deadline deal with Houston on March 25.\n\n\r\n                    “He was looking at every single possible avenue to be able to continue the season without surgery,” Spoelstra said. “But for his career, it made the absolute most sense to take care of this now. You feel for him. He’s where he wanted to be. He could see a great role and how he could really help us on this run. But it’s not meant to be for this season.”\n\n\r\n                    ROAD WARRIORS\n\n\r\n                    Even with the loss, Philadelphia’s road record in this regular season — 20-16 — was notable.\n\n\r\n                    It’s the best road mark by a 76ers team in the last 18 years. The 2002-03 76ers were 23-18 outside of Philadelphia.\n\n\r\n                    BUTLER’S 3-POINTERS\n\n\r\n                    Butler was 4 for 4 from 3-point range, the second-best such game of his career; he was 5 for 5 from beyond the arc for Chicago at Brooklyn on April 8, 2017.\n\n\r\n                    His shooting percentage on 3s for the season rose from .214 to .245.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Host Orlando on Friday.\n\n\r\n                    Heat: Visit Milwaukee on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996745.567486
}