{
  "game_id": "0021600679",
  "espn_id": "400900100",
  "date": "Jan 24, 2017",
  "matchup": "PHX vs. MIN",
  "headline": "Wiggins' basket at buzzer gives Wolves win over Suns",
  "body": "PHOENIX --  Buzzer-beating victories for the Timberwolves are almost as rare as a balmy Minnesota day in January.\n\nSo Tuesday night's was one to be savored.\n\nAndrew Wiggins sank an 18-foot pull-up jumper as the game ended to give the Timberwolves a 112-111 victory over the Phoenix Suns.\n\n\"I wasn't going to let no one stop me,\" Wiggins said.\n\nIt was the first buzzer-beating win for the Timberwolves since Luke Ridnour made a floater to beat Utah on Feb. 22, 2012.\n\nTuesday night's play had other options.\n\n\"But my mind was made up once I got the ball. I was going to shoot it,\" Wiggins said. \"I got to my spot. I knew the pull-up would be there. `'\n\nHe wanted a chance at redemption after missing one of two free throws with 12.1 seconds to go. It still put Minnesota ahead by a point but cleared the way for two free throws by P.J. Tucker that put Phoenix on top 111-110 with 6.3 seconds left. That was just enough time for Wiggins to lose his footing, regain it, then toss in the winner.\n\n\"It almost seemed like whoever had the ball last would win,\" Suns coach Earl Watson said. \"So that was a long six seconds, but he stumbled, picked it up, made it. That's amazing athleticism and concentration. Usually, if you can knock a guy off his rhythm, the shot never falls in.\"\n\nMinnesota coach Tom Thibodeau said Wiggins fought through the contact on the play.\n\n\"He got through that and got the shot off,\" Thibodeau said. \"He got to his spot, which is part of the design of that play, to get to his spot. He had the concentration and the mental toughness to take all the stuff that happened on that play and make the shot. It was a great play by him.\"\n\nDevin Booker overcame a slow start to make 5 of 6 shots in the fourth quarter, three of them 3-pointers, for 26 points for the Suns.\n\nTyson Chandler had a season-high 22 points and grabbed 17 rebounds for Phoenix. Eric Bledsoe added 18 points, including a three-point play that tied it at 109 with 1:05 remaining.\n\nKarl Anthony-Towns scored 18 and Gorgui Deng and Shabazz Muhammad 16 apiece for the Timberwolves, who have won three in a row of six of their last eight.\n\nPhoenix led by as many as 11 points in the first half and Minnesota by 14 in the second.\n\nWiggins' spinning drive to the hoop with 32 seconds left in the third quarter gave the Timberwolves an 87-79 lead going into the fourth.\n\nBut the Suns outscored Minnesota 14-5 to start the final quarter, taking a 93-92 lead on Booker's running jumper with seven minutes left.\n\nWiggins' turnaround 14-footer put Minnesota back on top 94-93 with 6:46 remaining. The Timberwolves never led by more than four points after that and there were four ties before Wiggins missed a free throw for the only time in eight attempts all night. But he made the second to put Minnesota ahead 110-109.\n\nDespite the outcome, the Suns like the direction they are heading.\n\n\"We're taking steps forward,\" Booker said, \"but we still have a long way to go.\"\n\nTIP-INS\n\nTimberwolves: Minnesota swept the season series with Phoenix 3-0 and has won four in a row against the Suns, something the Timberwolves haven't done since 2004. ... The Timberwolves' only other three-game win streak this season came from Jan. 9-13.\n\nSuns: Booker has scored at least 20 points in 10 consecutive games, the longest such streak by the Suns since Amare Stoudemire did it on Nov. 30-Dec. 25, 2008. .... Phoenix has won two in a row three times this season but never has made it three straight. .... The Suns last won three in a row in November 2015.\n\nUP NEXT\n\nTimberwolves: Minnesota returns to Minneapolis to face Indiana on Thursday night in the opener of a three-game home stand.\n\nSuns: Phoenix goes back on the road to face Denver.",
  "source": "espn_api",
  "crawled_at": 1764995967.068799
}