{
  "game_id": "0021600519",
  "espn_id": "400899418",
  "date": "Jan 02, 2017",
  "matchup": "PHX @ LAC",
  "headline": "Clippers beat Suns 109-98, end 6-game skid to start new year",
  "body": "LOS ANGELES --  Not quite the lockdown defensive team they were to start the season, the Los Angeles Clippers managed to rediscover some of their old selves in time to stop a six-game skid.\n\nJ.J. Redick scored 22 points and the Clippers beat the Phoenix Suns 109-98 on Monday night.\n\n\"We played with some urgency. We wanted to win so bad,\" said DeAndre Jordan, who had 20 rebounds. \"Our focus on defense was better.\"\n\nJamal Crawford added 18 points for the Clippers, who remain without Blake Griffin and Chris Paul. Griffin has missed nine games while recovering from right knee surgery, while Paul has missed six with a sore left hamstring.\n\n\"When you lose your top two guys you have to lean on each other,\" Crawford said.\n\nLos Angeles improved to 3-9 without Griffin and Paul in the lineup since Paul was acquired before the 2011-12 season.\n\n\"We just needed a win,\" coach Doc Rivers said. \"That's the test. Without CP and Blake, try to find different ways to score.\"\n\nT.J. Warren led the Suns with 24 points and former Clipper Eric Bledsoe added 22.\n\nPhoenix got within six with a minute left in the game on five straight points by Bledsoe. But the Suns failed to score again, and Devin Booker was called for an unsportsmanlike technical foul after hanging on the rim.\n\n\"Defensively we didn't have the presence that we had in the last three games,\" Suns coach Earl Watson said. \"You can't expect to win on the road against anyone without a defensive presence.\"\n\nThe Clippers pulled away in the third quarter, using a 14-0 run to produce their largest lead of 89-70. Luc Mbah a Moute got things going with a 3-pointer and Jordan ended the spurt with his second dunk while the Suns missed all seven of their shots. Phoenix was 7 for 27 in the quarter.\n\nMbah a Moute finished with 13 points.\n\nCrawford bounced back after going scoreless in 30 minutes in a 114-88 loss to the Thunder on Saturday night.\n\n\"I was a little disappointed in myself the last few games,\" Crawford said. \"I want to be in attack mode a lot more.\"\n\nThe Suns have lost four of five.\n\nTIP-INS\n\nSuns: They have lost seven straight in the series in Los Angeles and 10 of the last 11 at Staples Center. ... The Suns had allowed just 91 points in each of their last two games for the first time since March 2015.\n\nClippers: Redick was called for a flagrant-1 foul to start the third quarter after catching Booker in the face with his elbow on a play that was reviewed. ... The losing streak was the longest of coach Doc Rivers' four-year tenure. ... Rivers said Paul is getting better but the team is going to take its time with him. ... G Raymond Felton made his fourth start of the season. He scored 16 points.\n\nBIG QUARTER\n\nThe Clippers scored 37 points in the second quarter, their highest scoring period in the game.\n\n\"That's outrageous,\" Suns center Tyson Chandler said.\n\nUP NEXT\n\nSuns: Host Miami on Tuesday night in the second game of a back-to-back, their seventh such set of the season. The Heat have won 12 straight games in the series.\n\nClippers: Host Memphis on Wednesday night. The teams have split their first two meetings.",
  "source": "espn_api",
  "crawled_at": 1764995979.879321
}