{
  "game_id": "0022200611",
  "espn_id": "401468766",
  "date": "Jan 10, 2023",
  "matchup": "MIA vs. OKC",
  "headline": "Butler, Heat set NBA free throw record, beat OKC 112-111",
  "body": "MIAMI -- — Jimmy Butler took the last free throw of the night, then bent his knees a bit and almost seemed unsure what would happen as the ball made its way to the rim.\n\n\r\n              Turns out, it was perfect — and so was Miami on Tuesday night.\n\n\r\n              The Heat set an NBA record by making all 40 of their free throws, the last of those coming on Butler's three-point play with 12.9 seconds left, and rallied in the final moments to beat the Oklahoma City Thunder 112-111.\n\n\r\n              Miami topped the 39-for-39 effort by Utah against Portland on Dec. 7, 1982.\n\n\r\n              “It's just a normal Tuesday night for the Miami Heat,\" Heat coach Erik Spoelstra said. “I think this is when we feel most alive, when everything just happens and when all of our competitive juices get out there. That's the team we all can relate to. That's the team I like.\"\n\n\r\n              Here's just some of what happened Tuesday — the Heat played without six injured players, including four starters; backup Heat center Dewayne Dedmon was ejected after arguing with his own team and smacking a massage gun onto the court during play from the sideline; Miami had a six-point possession in the fourth quarter; and Josh Giddey had a triple-double for the Thunder.\n\n\r\n              Oh, and the record from the line.\n\n\r\n              “Credit them, first of all, for that,\" Thunder coach Mark Daigneault said. “That's impressive.\"\n\n\r\n              Butler scored 35 points and was 23 for 23 from the line, tying the second-most makes without a miss in NBA history. James Harden made 24 without a miss for Houston on Dec. 3, 2019, and Dirk Nowitzki made 24 without a miss for Dallas in a playoff game against the Thunder on May 17, 2011. Dominique Wilkins also went 23 for 23 in a game in 1992.\n\n\r\n              “We won,\" Butler said. “Complete team effort. I'm proud of my guys.\"\n\n\r\n              Max Strus scored 22 points and Victor Oladipo had 19 for Miami. The Heat were without four regular starters — Tyler Herro, Bam Adebayo, Kyle Lowry and Caleb Martin — because of injuries.\n\n\r\n              Shai Gilgeous-Alexander scored 26 points for the Thunder. Giddey finished with 18 points, 15 rebounds and 10 assists, getting the triple-double on an assist setting up Aaron Wiggins’ dunk for a 111-106 lead with 1:28 left.\n\n\r\n              Miami scored the final six points.\n\n\r\n              “Whatever it takes to win,\" Butler said.\n\n\r\n              Miami led 89-88 going into the fourth, and with Butler on the bench — he had played the entire third quarter — the Thunder took advantage. They scored the first six points of the final period, taking their first lead of larger than three points when Tre Mann connected on a jumper with 9:20 left for a 94-89 lead.\n\n\r\n              But a six-point possession gave Miami the lead back. Oladipo made a steal and Thunder center Eugene Omoruyi was called for a clear-path foul. Oladipo made both free throws, and on the continued Miami possession, Gabe Vincent made a 3-pointer while getting fouled by Mann. Vincent made the free throw, and just like that, a 96-91 deficit was a 97-96 lead.\n\n\r\n              “We always talk about finding a way to win. ... This is a good start to that,\" Butler said.\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Oklahoma City reached the midway point of this season at 18-23. Even without the injured No. 2 pick Chet Holmgren, it's progress — the Thunder were 15-21 at the midpoint of the 72-game season two years ago, and 14-27 midway through last season. ... Gilgeous-Alexander had 15 of his points in the final 6:26 of the second quarter, after having only two points previously.\n\n\r\n              Heat: Udonis Haslem was the only available Heat player who didn’t get into the game. ... Orlando Robinson started at center for Adebayo, making him the 13th player to start for Miami this season and the 202nd to start a game in team history.\n\n\r\n              MANY LINEUPS\n\n\r\n              Oklahoma City used its 20th starting lineup of the season in 41 games. Miami used its 18th in 42 games.\n\n\r\n              “I think there’s a hidden benefit to kind of some instability in your rotations and in your lineups,” Daigneault said. “It forces your own team to become very adaptive and to really not make excuses ... and I think it becomes hard to adjust to.”\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Philadelphia on Thursday night.\n\n\r\n              Heat: Host Milwaukee on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993962.887887
}