{
  "game_id": "0022301066",
  "espn_id": "401585694",
  "date": "Mar 29, 2024",
  "matchup": "CHI @ BKN",
  "headline": "Nets tie NBA record with 18 3-pointers in a half, beat Bulls 125-108",
  "body": "NEW YORK -- — Dennis Schroder and Mikal Bridges each made seven 3-pointers, and the Brooklyn Nets tied an NBA record by making 18 3s in the second half of their 125-108 victory over the Chicago Bulls on Friday night.\n\n\r\n              Cam Thomas scored 28 points and Schroder added 27 for the Nets, who made 25 3s overall and finished 18 of 24 (75%) in the second half, when they outscored the Bulls 78-56. Bridges had 25 points.\n\n\r\n              Bridges credited the historic 3-point shooting to an elevated focus on defense.\n\n\r\n              “I think all of them shots came from confidence, from getting stops,” he said. “We were just playing good defense. I think that’s what it was. And then when you make shots and get stops, it’s going to spread out a little bit.\n\n\r\n              Nic Claxton finished with 11 points and 13 rebounds for the Nets, who have won their last three games after losing six straight.\n\n\r\n              Brooklyn shot 47% from the field and nearly 57% behind the arc.\n\n\r\n              Bridges, Schroder and Thomas (five 3-pointers) became the second trio of Nets to make at least five 3-pointers in the same game. Jeff Green, Tyler Johnson and Landry Shamet also did it against Charlotte on April 1, 2021.\n\n\r\n              Brooklyn interim coach Kevin Ollie wasn’t too sure if the Nets could keep up the shooting with the Los Angeles Lakers and LeBron James visiting Sunday.\n\n\r\n              “Well, I don’t know if 25 3s is sustainable, but I’m (going) to pray, I’m going to church before the game on Sunday and I’ll pray about that,” Ollie said. “But I don’t know if that’s sustainable, but the process is sustainable and getting those shots is sustainable.”\n\n\r\n              DeMar DeRozan had 31 points and Coby White scored 18 for the Bulls, who have lost four of their last five games.\n\n\r\n              Chicago holds a half-game lead over Atlanta for the ninth spot in the NBA Play-In Tournament and is four games behind eighth-place Philadelphia. The No. 9 seed would host its first game, but DeRozan said the Bulls have other concerns.\n\n\r\n              “We just talk about (playing) hard for 48 minutes,” DeRozan said. “More so than anything, competing a full game and not put ourselves in a hole to make things difficult for us. From my standpoint, I always stress that we got to be playing the right way (for) 48 minutes and playing together.”\n\n\r\n              Brooklyn led by as many as 12 points in the first half and then trailed by seven 16 seconds into the second half after Nikola Vucevic found DeRozan for an 18-foot pull-up jumper.\n\n\r\n              The Nets outscored the Bulls 28-24 during the final 8:20 of the period and hit 7 of their 9 3-pointers during that span to take an 86-85 lead heading into the fourth quarter.\n\n\r\n              Chicago trailed by three points with 7:02 to go, but Schroder and Bridges combined for three 3-pointers during a 12-5 run that extended the lead 112-102 with 4 1/2 minutes to play.\n\n\r\n              The Nets ended the first quarter with a 27-21 advantage despite just shooting 34.6% from the field (9 for 26), but connected on 46.2% (6 for 13) of their 3-pointers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995861.0505311
}