{
  "game_id": "0021500058",
  "espn_id": "400827945",
  "date": "Nov 03, 2015",
  "matchup": "MEM @ SAC",
  "headline": "Randolph has 20, leads Memphis to 103-89 victory over Kings",
  "body": "SACRAMENTO, Calif. --  An embarrassing loss proved a tremendous motivator for the Memphis Grizzlies, who looked like a totally different team one night after getting crushed by the Golden State Warriors.\n\nZach Randolph had 20 points and 11 rebounds, and the Grizzlies bounced back from a 50-point loss to the Warriors with a 103-89 victory over the Sacramento Kings on Tuesday night.\n\nIt was back to basics for the Grizzlies, who have carved out great success in the past by sticking to what they do best: play tough defense and rebound. They did both against the Kings.\n\n\"We came out and played with more energy tonight,\" said reserve forward JaMychal Green, who had 12 points and 12 rebounds. \"Our defense creates offense. When we get out in transition we are hard to stop.\"\n\nThe Grizzlies were definitely difficult to stop down low. They outscored Sacramento 50-32 in the paint and had a 50-35 rebounding edge.\n\n\"We tried to play at our (fast) pace, but it was a game where they wanted to slow it down and get the ball to Zach Randolph because they knew were going to play small,\" Kings guard Darren Collison said.\n\nThe Grizzlies were anxious to rebound after a franchise-worst loss where they were outscored 72-27 by the Warriors in the middle two quarters and set a franchise low for shooting (27.1 percent).\n\nMike Conley had 14 points and six assists for Memphis, and Courtney Lee also scored 14 points. Marc Gasol developed a neck spasm and didn't play in the second half. He finished with eight points and two rebounds in 17 minutes. His status is day to day.\n\n\"Games like that can definitely happen (early in the season,)\" Conley said. \"We have our sights set on playing in June, but we have to do a better job of being consistent like we have always been in the past.\"\n\nRudy Gay had 19 points and Collison added 18 for the Kings, who played without All-Star center DeMarcus Cousins because of a strained right Achilles.\n\nThe Kings' perennial scoring and rebounding leader is expected to also miss Wednesday's game in Phoenix.\n\nSacramento, which averaged 115 points in its first three games, shot 39 percent and converted 24 of 40 free throws.\n\n\"We were much more consistent on defense. Guys were active, taking up for one another,\" Conley said. \"The biggest thing was the second and third effort to make stops.\"\n\nThe Kings were 6-17 last season without Cousins. They lacked any offensive consistency without him Tuesday and the Grizzlies scored frequently inside with Cousins' presence definitely missed.\n\nAhead by 16 points entering the fourth quarter, the Grizzlies kept the pressure on the cold-shooting Kings and never let the lead slip below 13 points.\n\nLeading by 10 points at the half, Randolph made consecutive baskets to open the third quarter and finished with eight points in the period, helping Memphis assume an 83-67 lead heading into the fourth.\n\nSECOND-QUARTER DROUGHT\n\nAfter shooting nearly 59 percent and leading 29-25 after one quarter, the Kings could do little right in the second, when Memphis took over the game. The Kings shot 2 of 15, their fewest field goals in a quarter since March 27, 2009, when they also had two baskets against Utah. The Grizzlies had a 25-11 edge in the second and never trailed again.\n\nTIP-INS\n\nGrizzlies: This was the second contest in a five-game road trip for Memphis that concludes Monday against the Clippers. ... The Memphis starters were a combined 11 of 46 against Golden State, but had 11 field goals in the first quarter against the Kings.\n\nKings: Sacramento opens the season with nine of its first 11 games at home. Eight of those games are against teams that made the playoffs a season ago. ... The Kings' lowest point total in three previous games was 104 in an opening-night loss to the Clippers.\n\nUP NEXT\n\nGrizzlies: At Portland on Thursday night.\n\nKings: At Phoenix on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994486.002424
}