{
  "game_id": "0021800559",
  "espn_id": "401071235",
  "date": "Jan 02, 2019",
  "matchup": "CHI vs. ORL",
  "headline": "Vucevic leads Magic to 112-84 rout of Bulls",
  "body": "CHICAGO --  Nikola Vucevic and the Orlando Magic had no trouble finding motivation Wednesday night.\n\nA loss in Chicago less than two weeks ago and a blowout defeat only two days ago was all the incentive they needed.\n\nVucevic had 22 points and 12 rebounds before sitting out the fourth quarter, Aaron Gordon added 18 points and a career-high nine assists, and the Magic led the entire way in a 112-84 rout of the Chicago Bulls.\n\nTerrence Ross scored 15 off the bench and Evan Fournier had 13 points and seven assists for Orlando, which has won three of four. The Magic shot 58 percent from the field and had 31 assists on 44 field goals.\n\nOrlando coach Steve Clifford sensed a special performance was coming at the morning shootaround.\n\n\"When we walked out, I told a couple of the coaches, `I don't know if we're going to win, but we're going to play well,\" Clifford said. \"We were very focused in the shootaround and you could tell we were going to have great energy.\"\n\nZach LaVine had 16 points while Lauri Markkanen and Kris Dunn added 14 apiece for Chicago, which has dropped two straight after winning three of four.\n\n\"I can't imagine what it looked like on TV -- it felt even worse in the game,\" LaVine said. \"I can't figure that out. We have to try to figure that out on our own.\"\n\nIt was the third game between the teams since Dec. 13. The Magic have won two, including 97-91 in Mexico City.\n\nChicago held Orlando to 80 points in a 10-point win Dec. 21 when the teams met at the United Center. It was the Magic's second-lowest point total of the season, but it was apparent early on things would be different this time.\n\nOrlando charged out to a 32-16 advantage after the first quarter and took a 62-45 halftime lead. Gordon and Ross led the way with 12 first-half points apiece on 11-for-15 combined shooting. Vucevic added 11 points on 5-of-7 shooting.\n\nThe Magic were 25 for 39 (64 percent) from the floor in the first half, including 7 of 12 on 3-pointers.\n\nThings didn't get any better for Chicago. The Magic started the third quarter with 11 straight points to stretch the margin to 73-45.\n\nOrlando's advantage was 90-62 entering the fourth period behind Vucevic's 11 points in the third.\n\nThe closest Chicago got in the fourth was 94-71. It was a far cry from its 125-100 loss Monday at Charlotte.\n\n\"The guys were disappointed with the way we played in Charlotte,\" Clifford said. \"That's the best all-around game we've played in a while. The ball movement was good, and I thought, for the most part, our defense was really good.\"\n\nTIP-INS\n\nMagic: G D.J. Augustin (sprained right ankle) returned after missing the previous game. He had 10 points in 25 minutes. ... Timofey Mozgov (sore right knee) and Jonathon Simmons (sprained left ankle) didn't play.\n\nBulls: F Bobby Portis (sprained right ankle) missed his sixth straight game but is close to returning. \"We're hoping he responds well to today's workout and has a contact practice (Thursday),\" coach Jim Boylen said. \"We'll see how that goes.\"\n\nSTUFFING THE STAT SHEET\n\nHad the game been closer, Gordon, who had seven rebounds, might have been able to get his first career triple-double. Instead, he sat out the final four minutes. \"That's cool,\" he said. \"I'm not going to chase stats.\"\n\nROOKIE WALL?\n\nChicago rookie Wendell Carter Jr. was scoreless (0 for 5) with one rebound in 13 minutes. \"I didn't come out with the correct edge for myself,\" Carter said. \"I've just got to bring out a better edge every time we play.\"\n\nCOAST TO COAST\n\nThis was the second of a six-game, 10-day road trip in which Orlando will play in all four time zones in the continental United States.\n\n\"The next four games are going to be really hard,\" Fournier said. \"Tonight was really great for us and hopefully it gives us confidence.\"\n\nUP NEXT\n\nMagic: At the Minnesota Timberwolves on Friday night.\n\nBulls: Host the Indiana Pacers on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994823.067085
}