{
  "game_id": "0021600763",
  "espn_id": "400900168",
  "date": "Feb 04, 2017",
  "matchup": "MEM @ MIN",
  "headline": "Green sparks short-handed Grizzlies over Timberwolves 107-99",
  "body": "MINNEAPOLIS --  The excuses were right there for the Memphis Grizzlies. End of a 10-day trip, second night of back-to-back, three key players getting the night off.\n\nThey were having none of it, the latest chapter of toughness in a franchise history rich with it.\n\nJaMychal Green scored a career-high 29 points and the short-handed Grizzlies grinded out a 107-99 victory over the Minnesota Timberwolves on Saturday night.\n\nMike Conley added 20 points and eight assists for the Grizzlies, who rested Marc Gasol, Tony Allen and Chandler Parsons on the second night of a back-to-back. The Grizzlies scored 21 points off of 13 turnovers by Minnesota and only turned it over 10 times.\n\n\"We all had kind of excuses to make up to lose a game, but guys didn't use that,\" Conley said. \"We said, `We're playing for something.\"\n\nKarl-Anthony Towns had 27 points and 16 rebounds for the Timberwolves, who have lost three straight after showing some signs of life. The Wolves led by 18 points in the first half, but were outworked the rest of the way on a day they lost Zach LaVine for the remainder of the season with a knee injury.\n\n\"We got too comfortable with the lead,\" Towns said. \"We felt like we were just cruising to the victory line and we stumbled along the way.\"\n\nThe Grizzlies may have been resting three key players, but they still had Conley. The clutch point guard directed traffic, got his lesser-celebrated teammates involved early and then made his move late. His three-point play with 4:23 to go put Memphis up 88-82. And Green gobbled up two misses down the stretch for putbacks to power Memphis to the win.\n\nThe Wolves started the day with some devastating news when LaVine's MRI revealed a torn ACL. A sullen locker room pregame showed the concern for a very popular teammate, but Minnesota built an 18-point lead early in the second quarter on the strength of superior ball movement.\n\nThe flow ground to a halt for much of the next two quarters, and Vince Carter hit back-to-back 3-pointers for an 11-point lead midway through the third.\n\nAndrew Wiggins scored 23 points, but shot just 9 of 22 for Minnesota.\n\n\"It was a tough day. But we still have to be ready to play,\" coach Tom Thibodeau said. \"We all felt the disappointment in (LaVine's injury), but no one is going to feel sorry for us. We have to be ready to roll.\"\n\nTIP-INS\n\nGrizzlies: Zach Randolph had nine points and 10 rebounds in 30 minutes, but fouled out midway through the fourth. ... Green hit all 12 of his free throws and Memphis shot 39 in the game.\n\nTimberwolves: PG Kris Dunn did not play for the second straight game because of an injured right hand, but the Timberwolves said he was available to play if he was needed. ... Seldom-used PF Adreian Payne was out for the second straight game because of an illness. ... Gorgui Dieng had 13 rebounds.\n\nMEMPHIS RESTS\n\nIt was the second time this season Memphis has rested key players on a trip to Minnesota. Gasol and Conley did not play in November and the Grizzlies lost by 36.\n\nMemphis coach David Fizdale was asked about fans that pay to see the best players, only to be disappointed.\n\n\"That's above my pay grade there,\" Fizdale said. \"That's something the NBA is going to have to deal with and face and figure out. Whether it's shortening the schedule or something like that. That's way out of my realm. I'm just more about what helps our team and what wins games for us and what gives us the best chance to play longer. That's what a lot of teams are doing right now.\"\n\nGREEN SHINES\n\nGreen's previous career high of 21 came against New Orleans and former No. 1 pick Anthony Davis. On Saturday night, he battled Towns, the No. 1 overall pick two years ago.\n\n\"I live for them,\" Green said of those matchups. \"I always want to guard the best player. Tonight I had the opportunity to make him guard me.\"\n\nUP NEXT\n\nGrizzlies: heads home to host San Antonio on Monday.\n\nTimberwolves: plays the second of a six-game homestand on Monday against Miami, which has won 10 straight games.",
  "source": "espn_api",
  "crawled_at": 1764995589.7243562
}