{
  "game_id": "0022200059",
  "espn_id": "401468214",
  "date": "Oct 26, 2022",
  "matchup": "TOR vs. PHI",
  "headline": "Siakam scores 20 as Raptors beat slumping 76ers 119-109",
  "body": "TORONTO -- — Pascal Siakam scored 20 points and matched his career-high with 13 assists, Gary Trent Jr. scored a season-high 27 points and the Toronto Raptors beat Philadelphia 119-109 on Wednesday night.\n\n\r\n              Joel Embiid and Tyrese Maxey each scored 31 points and James Harden had 18 for Philadelphia, which lost for the fourth time in five games. The 76ers won at Indiana on Monday, their first victory following an 0-3 start.\n\n\r\n              “We’ve got to stick together, believe we’re going to be fine but we don’t have a lot of time,” Embiid said. “We can’t waste time. It hurts to lose, it’s painful, so we’ve just got to figure it out.”\n\n\r\n              Philadelphia opponents are averaging 111 points per game.\n\n\r\n              “We’ve got to get on the same page,” Maxey said of the defense. “We’re all still trying to figure it out. We’ve got three to four new rotation guys, so it’s hard. Once we figure it out, it’s going to be great.”\n\n\r\n              Sixers coach Doc Rivers echoed Maxey’s disappointment in Philadelphia’s defensive effort so far.\n\n\r\n              “We just aren’t doing what we need to do,” Rivers said.\n\n\r\n              Siakam shot 4 for 8 from long distance as Trent was 5 for 10 as the Raptors made a season-high 16 3-pointers. Toronto shot 16 for 37 from beyond the arc.\n\n\r\n              The Raptors shot 46 for 84, their best field goal percentage of the season. Toronto’s 32 assists were a season-high.\n\n\r\n              “Offensively we were really good tonight in a lot of areas,” Raptors coach Nick Nurse said. “We got transition buckets and we really moved the ball.”\n\n\r\n              Fred VanVleet scored 10 of his 15 points in the fourth quarter and O.G. Anunoby added 15 for the Raptors.\n\n\r\n              Scottie Barnes returned to the lineup with 16 points as Toronto won its second straight. Barnes left Saturday’s loss at Miami because of a sore right ankle and did not play in Monday’s road win over the Heat.\n\n\r\n              The 76ers beat the Raptors in six games to win their first-round playoff series last spring.\n\n\r\n              “We knocked them out in the playoffs, right?” Rivers said. “There was no doubt they were going to come out with more, and we didn’t meet it. That’s disappointing.”\n\n\r\n              The teams meet in Toronto again Friday night.\n\n\r\n              Siakam shot 4 for 4 from 3-point range in the first and scored 15 points as Toronto led 35-27 after one.\n\n\r\n              “We got off to such a slow start, and their key guys got going,” Rivers said. “We just gifted guys shots early.”\n\n\r\n              Maxey scored 12 points in the second but the Raptors led 83-53 at the half. Toronto took an 89-79 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              76ers: Philadelphia is 0-2 on the road. … Harden led the Sixers with nine assists, while Tobias Harris had a team-high eight rebounds. … The 76ers lost three of four regular season meetings with Toronto last season.\n\n\r\n              Raptors: Siakam also had 13 rebounds against Minnesota on March 30, 2022. … Siakam had five rebounds. … Toronto didn’t commit a turnover in the first half. They finished with nine. … F Otto Porter Jr., (left hamstring) has yet to play this season.\n\n\r\n              CAMEROON FOR 3\n\n\r\n              Embiid, Siakam and Raptors rookie Christian Koloko all shared the floor in the first quarter, the first time three players from Cameroon have played together in an NBA game.\n\n\r\n              “Amazing,” Siakam said. “It was great.”\n\n\r\n              Embiid was also pleased to be part of the historic moment.\n\n\r\n              “That’s what I’m here for,” he said.\n\n\r\n              UJIRI FINED\n\n\r\n              Raptors president Masai Ujiri was fined $35,000 for approaching the scorer’s table and directing inappropriate remarks toward a game official during Saturday’s 112-109 loss at Miami, the NBA announced Wednesday.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Visit Toronto on Friday night.\n\n\r\n              Raptors: Host Philadelphia on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994108.27339
}