{
  "game_id": "0022401210",
  "espn_id": "401736804",
  "date": "Dec 13, 2024",
  "matchup": "LAL @ MIN",
  "headline": "Timberwolves beat Lakers without LeBron James 97-87 with another defensive showing",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 23 points and the Minnesota Timberwolves beat the Los Angeles Lakers 97-87 on Friday night.\n\n\r\n              Julius Randle added 21 points and Jaden McDaniels scored 18 for Minnesota, which won for the fifth time in six games. Rudy Gobert had a game-high 13 rebounds to go with 12 points.\n\n\r\n              The Timberwolves are 14-2 against the Lakers at home since the 2015-16 season, including four straight wins.\n\n\r\n              Anthony Davis led Los Angeles with 23 points and 11 rebounds, but the Lakers lost for the eighth time in 11 games. Austin Reaves scored 18 points in his first game back after missing five games with a left pelvic contusion, and Max Christie added 15.\n\n\r\n              Los Angeles had 21 turnovers.\n\n\r\n              LeBron James missed his second straight game for the Lakers with left foot soreness and was also was away from the team this week due to “personal reasons.” Coach JJ Redick said pregame he has no sense of when James will return.\n\n\r\n              Takeaways\r\n              Lakers: In its past 11 games, Los Angeles is averaging 103.3 points, while allowing its opponents to score an average of 113.7 points.\n\n\r\n              Timberwolves: Defense had been Minnesota’s forte during its recent success. Los Angeles shot just 38.4%, the third time in four games a Timberwolves foe failed to reach 40%. In Minnesota’s past five wins, no opponent has topped 92 points.\n\n\r\n              Key moment\r\n              Mike Conley missed a 3-pointer for Minnesota and Rui Hachimura got the rebound for Los Angeles. However, he had the ball stolen by Randle who quickly fed McDaniels for a layup and an 89-82 lead with 2:03 left.\n\n\r\n              Key stat\r\n              Averaging 37.5% from deep, Minnesota was just 9 for 32 (28.1%) from 3. The Lakers were 10 of 35 (28.6%) on long-range shooting.\n\n\r\n              Up next \r\n              The Lakers are home against the Grizzlies and the Timberwolves head to the Spurs on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997198.7528682
}