{
  "game_id": "0021900344",
  "espn_id": "401160986",
  "date": "Dec 09, 2019",
  "matchup": "CLE @ BOS",
  "headline": "Walker scores 22, Celts beat Cavs 110-88 in Hayward's return",
  "body": "BOSTON --  Gordon Hayward got back in the lineup and helped the Boston Celtics build a big lead. Kemba Walker made sure it didn’t completely disappear.\n\nWalker led Boston’s balanced scoring with 22 points, Hayward had 14 points in his return from a broken hand and the Celtics remained unbeaten at home with a 110-88 victory over the sinking Cleveland Cavaliers on Monday night.\n\nJaylen Brown had 20 points and seven rebounds, Jayson Tatum added 19 points with 11 boards, and Daniel Theis scored 10 for Boston, which improved to 10-0 at TD Garden.\n\n“It was good to have him back,” Tatum said of Hayward. “I was excited, everybody was excited, and he was excited.”\n\nJordan Clarkson led Cleveland with 19 points, and Tristan Thompson had 17 points with 11 rebounds. The Cavaliers have lost seven straight games and 13 of 14.\n\nHayward returned exactly a month after breaking his left hand when he collided with San Antonio’s LaMarcus Aldridge as the Spurs’ big man was setting a screen. Hayward played 26 minutes, finishing with five rebounds and four assists.\n\nHe spent the fourth quarter on the bench while his teammates let the Cavs cut into a huge deficit. Cleveland trailed 94-81 before Walker hit a trio of 3-pointers in a 1:22 span to put it away.\n\n“I just told the team afterwards, I said: ‘If you want to be special, then model (yourself) after Kemba,’’’ Boston coach Brad Stevens said. “Because Kemba sits over there and thinks his night’s done, gets put back in the game, drills three 3s, and ends it.”\n\nHayward was expected to miss about six weeks. But he said this weekend the bone is healed and -- thanks to a plate with screws -- might even be stronger than it was before.\n\n“It got hit,\" he told the team's flagship network, NBC Boston, during a postgame interview. \"It didn’t even move, hardly.”\n\nThe Celtics, who never trailed, led by 13 at halftime and broke it open by outscoring the Cavaliers 26-10 over the opening 7:53 of the second half. Tatum had eight points and Hayward six in a spree that gave Boston a 79-50 edge.\n\n“We didn’t give in. I think we got down by 30, and then all of a sudden we’re down by 13,” Cavaliers coach John Beilein said. “That’s a huge positive that we didn’t stop at that point.”\n\nCleveland scored 14 straight points spanning the end of the third quarter and early fourth. The Cavaliers sliced the margin to 85-73 on John Henson’s layup with just over nine minutes to play, but Tatum nailed a 3 to spark a 7-0 spurt that pushed the Celtics ahead comfortably.\n\n“That’s how we need to play,” Cleveland forward Kevin Love said. “The problem is putting it together for a quarter, two quarters, three quarters, 48 minutes.”\n\nTIP-INS\n\nCavaliers: Love played his second straight game after being sidelined with an illness. He scored only seven points. … Collin Sexton came in averaging 20.6 points per game in his career against Boston, but went 1 for 8 in the first half. He finished with eight points.\n\nCeltics: G Marcus Smart missed the game with an eye infection and center Robert Williams was sidelined with left hip soreness. … The Celtics won Nov. 5 at Cleveland in the first meeting between the teams this season.\n\nQUICK START\n\nBoston hit seven of its initial 10 shots, opening its first double-digit lead (17-6) on Hayward’s fast-break layup -- his first basket of the game -- nearly halfway into the opening quarter. They led 29-18 after one.\n\nSEATS FOR SOLDIERS\n\nThe Celtics and their season-ticket holders combined to give out more than 1,000 seats to the United Service Organizations.\n\nMISSING FREEBIES\n\nThompson missed five of his first six free throw attempts and went 1 for 7 from the line. He shot 8 of 11 from the floor.\n\nMOMENT OF SILENCE\n\nThe Celtics held a moment of silence before the national anthem for former Boston College baseball player Pete Frates, who died earlier in the day after a battle with Lou Gehrig’s disease. He was 34.\n\nFrates helped inspire the ALS ice bucket challenge that has raised more than $200 million worldwide.\n\nUP NEXT\n\nCavaliers: Host the Houston Rockets on Wednesday.\n\nCeltics: At the Indiana Pacers on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996322.028547
}