{
  "game_id": "0022201176",
  "espn_id": "401469331",
  "date": "Apr 04, 2023",
  "matchup": "TOR @ CHA",
  "headline": "Siakam scores 22, leads Raptors over Hornets 120-100",
  "body": "CHARLOTTE, N.C. -- — Pascal Siakam scored 22 points and the Toronto Raptors rallied from four 9-point first quarter deficits to roll past the Charlotte Hornets 120-100 on Tuesday night.\n\n\r\n              Toronto has won five of its last six games, improving to 40-39 and solidifying their position for the NBA play-in tournament.\n\n\r\n              The Raptors scored 19 straight points during a stretch late in the third quarter and into the fourth quarter after Charlotte had gotten within 80-75 with 3:49 left in the third quarter.\n\n\r\n              Siakam also had 14 rebounds and was joined in double digits by Chris Boucher (21 points), Will Barton (20), O.G. Anunoby (17), Fred VanVleet (16), Precious Achiuwa (12) and Jakob Poeltl (10).\n\n\r\n              The Hornets were led by Bryce McGowens’ career-high 20 points. Nick Richards added 18 points and 11 rebounds and Svi Mykhailiuk had 17 points, JT Thor 13 and Theo Maledon 13.\n\n\r\n              The Hornets (26-54) are without eight players due to injury: LaMelo Ball (right ankle surgery), Gordon Hayward (left thumb sprain), Kelly Oubre Jr. (left shoulder sprain), Terry Rozier (right foot injury), Dennis Smith Jr. (right toe sprain), P.J. Washington (right foot sprain) and Mark Williams (left ankle sprain).\n\n\r\n              Toronto’s 36-20 second quarter was sparked by reserves Boucher and Barton, who combined for nine 3-pointers.\n\n\r\n              “We weren’t that sluggish,” Toronto coach Nick Nurse said of the early Charlotte leads. “They were just really fast and we weren’t as fast as they were. I just kept saying, ‘They’re really moving’ so we had to pick it up a half-notch. We switched to zone and got a bunch of stops in a row and obviously got the ... 3-ball going. Fifteen out of 33 is a really good night on 3-pointers.”\n\n\r\n              Boucher said Barton, who converted six of his nine 3-pointers, really helped the Raptors spread the floor in its victory.\n\n\r\n              “We need that off the bench,” Boucher said of Barton’s production. “The more guys we have that can do things will help. They got Will here for a reason. They know what he can do and today was just a peek at what he can do.”\n\n\r\n              Charlotte coach Steve Clifford said Toronto’s defense that created 22 points off 18 turnovers was a huge difference-maker.\n\n\r\n              “Ball pressure and passing lane pressure led to live-ball turnovers,” Clifford said. “It was 22-10 in points off turnovers.”\n\n\r\n              BOUCHER’S BIG WEEK\n\n\r\n              Boucher’s big effort came one day after he announced a scholarship program to help his community and young people growing up like he did.\n\n\r\n              According to Monday’s Toronto Star, Boucher grew up in abject poverty, was once homeless, dropped out of school and washed dishes at restaurants.\n\n\r\n              Now a key to the Raptors’ second unit who has a three-year, $35 million contract, the Star says he is using “an undisclosed amount of money disbursed through his SlimmDuck Foundation” to launch a scholarship program that will offer financial support to five students of Caribbean descent. For each of the next five years, a scholarship will be offered to a student with financial struggles who wants to pursue a university degree.\n\n\r\n              “It’s something I wanted to do for a long time,” Boucher said after Tuesday’s game. “It was just finding the opportunity. I want to help the people that struggle when they move to Canada.”\n\n\r\n              TIP-INS\n\n\r\n              Raptors: Barton is one of the more veteran players on the Raptors’ roster with 11 years of NBA experience, which includes 29 postseason games with nine starts. But he’s played in 12 games with Toronto since being signed as free agent on Feb. 28 and he had missed the previous three games with a left ankle sprain. “I guess we’re going to have to figure that out in the next four games that we have left,” Toronto coach Nick Nurse said of Barton’s role.\n\n\r\n              Hornets: Clifford started his 26th different starting lineup Tuesday. It’s the third-most lineups in franchise, behind the 2005-06 and 2006-07 Charlotte Bobcats, which used 28 different starters.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Boston on Wednesday.\n\n\r\n              Hornets: Host Houston on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994007.336941
}