{
  "game_id": "401810135",
  "espn_id": "401810135",
  "date": "Nov 23, 2025",
  "matchup": "OKC vs POR",
  "headline": "Gilgeous-Alexander scores 37 points, Thunder rout Blazers to avenge only loss",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 37 points in three quarters and the Oklahoma City Thunder beat the Portland Trail Blazers 122-95 on Sunday night to avenge their only loss of the season.\n\n\r\n              Gilgeous-Alexander made 13 of 18 attempts from the field and all nine of his free throws.\n\n\r\n              Ajay Mitchell scored 20 points on 8-for-8 shooting as the defending champion Thunder won their ninth straight after a 121-119 loss at Portland on Nov. 5. They improved to an NBA-best 17-1 and are 85-15 since the start of last season.\n\n\r\n              The Thunder continue to roll, despite injuries. They still are waiting on 2025 All-Star Jalen Williams to return from wrist surgery, and key reserve Aaron Wiggins missed the game with a left thigh strain. Still, Oklahoma City’s average scoring margin during its winning streak is 22.3 points, with a 13-point difference being the closest result.\n\n\r\n              Jerami Grant led Portland with 21 points. Deni Avdija, who led the Trail Blazers with 26 points the first time the teams met, finished with 11 points on 4-for-16 shooting in the rematch.\n\n\r\n              Portland guards Shaedon Sharpe and Jrue Holiday both were out with right calf strains. Sharpe is the team's second-leading scorer and Holiday is one of the team's best perimeter defenders.\n\n\r\n              Gilgeous-Alexander scored 17 points in the first quarter to set the tone and help the Thunder take a 39-18 lead.\n\n\r\n              In the second quarter, Oklahoma City's Mitchell drove to the hoop before Portland's Rayan Rupert hit him in the head while going for the block. The Thunder ran down to protect Mitchell and Oklahoma City's Isaiah Hartenstein was called for a technical for escalating the situation. Mitchell made the second of two free throws on the shooting foul, then made a floater to put the Thunder ahead 49-25. \n\n\r\n              Gilgeous-Alexander's layup in the closing seconds of the first half pushed his total to 28 points and gave the Thunder a 67-46 lead at the break. The game was never close in the second half.\n\n\r\n              The teams will meet again next Sunday in Portland.\n\n\r\n              Up next\r\n              Trail Blazers: At Milwaukee on Monday night.\n\n\r\n              Thunder: Host Minnesota on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042683.719268
}