{
  "game_id": "0022400608",
  "espn_id": "401705174",
  "date": "Jan 21, 2025",
  "matchup": "TOR vs. ORL",
  "headline": "Barnes has 17 points and 11 rebounds, Raptors erase 21-point deficit to beat slumping Magic 109-93",
  "body": "TORONTO -- — Scottie Barnes had 17 points and 11 rebounds, RJ Barrett scored 19 points and the Toronto Raptors overcame a 21-point deficit to beat the struggling Orlando Magic 109-93 on Wednesday night.\n\n\r\n              Gradey Dick scored 17 points and Bruce Brown had 15 as Toronto snapped a four-game losing streak against Orlando.\n\n\r\n              The Raptors won for the first time this season when trailing at halftime. Toronto came in 0-23 in such games.\n\n\r\n              Dick had 10 points in the third, including two dunks, as the Raptors outscored Orlando 40-20 to turn a five-point halftime deficit into a 15-point advantage.\n\n\r\n              Paolo Banchero had 26 points and 12 rebounds for Orlando, which couldn’t hold on after taking leads of 10-0 and 32-11 in the opening period. The Magic have lost four straight.\n\n\r\n              The last time the Raptors trailed by at least 21 points in the first quarter and rallied to win was a 93-85 home victory over Dallas on Jan. 22, 2014.\n\n\r\n              Kentavious Caldwell-Pope scored 20 points, Anthony Black had 17, and Wendell Carter Jr. fouled out with 10 points and 10 rebounds as the Magic lost for the sixth time in seven.\n\n\r\n              Orlando’s Cole Anthony sat because of an illness, and Jonathan Isaac played four-plus minutes before exiting because of illness.\n\n\r\n              Takeaways\r\n              Magic: Jalen Suggs (lower back) missed his ninth straight game. Suggs hasn’t played since leaving the court in a wheelchair during a Jan. 3 win at Toronto.\n\n\r\n              Raptors: Immanuel Quickley (left hip) sat for a fourth straight game. Ochai Agbaji (right hand) was also unavailable.\n\n\r\n              Key moment\r\n              Toronto took its first lead, 60-59, on Davion Mitchell’s layup with 6:52 left in the third. The Raptors led 85-70 after three.\n\n\r\n              Key stat\r\n              Orlando made its first five 3-point attempts but shot 4 for 26 from distance the rest of the way.\n\n\r\n              Up next\r\n              Both teams play Thursday, when Orlando hosts Utah and Toronto visits Atlanta.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996961.415883
}