{
  "game_id": "0021601114",
  "espn_id": "400900509",
  "date": "Mar 29, 2017",
  "matchup": "CHA @ TOR",
  "headline": "Belinelli helps Hornets beat Raptors 110-106",
  "body": "TORONTO --  Kemba Walker founding his shooting stroke in the nick of time for the Charlotte Hornets.\n\nWalker scored 11 of his 19 points in the final 5:03, leading the Hornets past the Toronto Raptors 110-106 on Wednesday night.\n\nThe All-Star guard was 3 for 18 from the field through three quarters. But he stepped up in the fourth, helping Charlotte (34-41) stop Toronto's six-game win streak.\n\n\"We just stuck with the game, really,\" Walker said. \"We made big plays, especially defensively, down the stretch.\n\n\"Shots weren't falling consistently all night but made the necessary plays to win the game.\"\n\nWalker hit two big 3-pointers in the final 2 minutes, including one that gave the Hornets a 104-101 lead with 37.5 seconds left. He also had four rebounds and two assists.\n\nMarco Belinelli scored 21 points for Charlotte, which has won five of seven. Marvin Williams had 18 points and 12 rebounds.\n\nDeMar DeRozan scored 28 points for Toronto (45-30), and Jonas Valanciunas had 14 points and 15 rebounds. The loss prevented the Raptors from clinching home-court advantage for the first round of the playoffs.\n\nToronto was outscored 44-32 in the final period.\n\n\"They were hot as fire in the fourth quarter,\" Raptors coach Dwane Casey said. \"We went from one of our best defensive quarters, 16 points in the third, to 44 in the fourth and that was the difference in the game.\"\n\nThe Hornets went 8 for 10 from 3-point range in the fourth quarter. They finished the night 16 for 32 from beyond the arc.\n\n\"We got a couple of stops when we needed it but at the end of the day, in the biggest possessions, we got some open 3s and knocked them in,\" Charlotte coach Steve Clifford said.\n\nToronto held Charlotte to 23 percent shooting in the third and carried a 74-66 lead into the final period. Valanciunas had eight points in the third.\n\nNicolas Batum had 15 points for the Hornets. Frank Kaminsky scored 12 of his 13 points in the first half, helping Charlotte to a 50-47 lead at the break.\n\nCory Joseph scored 18 points for Toronto, which shot 11 for 31 from 3-point range. Serge Ibaka had 15 points.\n\n\"The game is not over until it's over and we can't be satisfied with having a big third quarter,\" DeRozan said. \"You have to give them credit, they hit big shots late in the game.\"\n\nQUOTABLE\n\n\"He could miss 30 million shots in a row and he's going to shoot the next one like he's been making all of them. He's a scorer.\" -- Toronto's P. J. Tucker on Walker.\n\nTIP-INS\n\nHornets: Walker, whose 219 3s are the second-most in franchise history, was 3 for 10 from beyond the arc. ... Charlotte improved to 12-12 when it scores 110 points.\n\nRaptors: F DeMarre Carroll, starting after missing the two previous games with a sore lower back, had three points, three rebounds and an assist in 19 minutes. ... Joseph scored in double figures for the 13th time in 19 starts. ... Valanciunas recorded his team-leading 27th double-double of the season.\n\nUP NEXT\n\nHornets: Return home to face the Denver Nuggets on Friday. The Hornets beat the Nuggets 112-102 in Denver on March 4.\n\nRaptors: Continue a four-game homestand on Friday, hosting the Indiana Pacers. The Raptors beat the Pacers 116-91 on March 19.",
  "source": "espn_api",
  "crawled_at": 1764995465.0937002
}