{
  "game_id": "0021500682",
  "espn_id": "400828569",
  "date": "Jan 26, 2016",
  "matchup": "POR vs. SAC",
  "headline": "McCollum helps Trail Blazers beat Kings 112-97",
  "body": "PORTLAND, Ore. -- Sacramento forward DeMarcus Cousins, unstoppable in the Kings' past two games, found his match Tuesday night in the Portland Trail Blazers' defense.\nCousins, coming off games of 56 and 48 points, missed 17 of his 21 shots and scored 17 points against Portland interior defense in the Blazers' 112-95 win.\nC.J. McCollum scored 18 points, Damian Lillard had 15 points and 13 assists as Portland had seven players score in double figures.\nCousins was coming off a franchise-high 56-point performance Monday night against Charlotte, but never got untracked against a Portland defense led by Meyers Leonard and Mason Plumlee.\nCousins missed nine of his first 10 shots and went 1-of-7 during the second half before leaving midway through the fourth quarter with Portland having the game in hand. Cousins also struggled at the free throw line, making 9 of 17.\n\"He's a very good player, able to score in many ways, but I thought for the most part we did a good job on him,\" Leonard said. \"We were really locked in on what we needed to do tonight and it was just a great team effort.\"\nThough Cousins played 46 minutes before fouling out against Charlotte, Sacramento coach George Karl was hesitant to use fatigue as a reason for Cousins' sub-par outing.\n\"As a coach I don't like that excuse. As a human being, it's probably a justifiable excuse,\" Karl said. \"He's been so good I'm not going to complain. He's been our horse and we've ridden him to a lot of good things.\"\nPortland's offensive balance also played a big role in the Blazers' win. Seven players scored between 11 and 18 points. Portland reserves Gerald Henderson, Allen Crabbe and Ed Davis were among those in double figures.\n\"Their bench hurt us more and that's a sign of a good team. When you overshoot your emphasis on their No. 1 and 2 strengths, it usually opens up other opportunities. They had some guys jump in and take advantage of that,\" Karl said.\nRajon Rondo had 15 points and 11 assists for the Kings, who lost in double overtime on Monday night.\nPortland (21-26) moved into a virtual tie with Sacramento (20-25) for eighth in the Western Conference. The Blazers have won six of their past eight.\nPortland led 58-52 at halftime after leading for most of the first half.\nThe Trail Blazers maintained a narrow margin for much of the third quarter, but momentum eventually moved in their favor after Cousins missed two free throws, then committed an offensive foul. Portland immediately scored seven consecutive points for its largest lead of the game at 81-67.\nPortland led 88-74 after three and continued to pour it on early in the fourth quarter. Crabbe and Henderson hit 3-pointers as the Blazers increased their lead to 100-79 with eight minutes remaining.\nTIP-INS\nKings: Sacramento forward Rudy Gay, who sustained a left eye injury in Monday's double overtime loss to Charlotte, didn't play against Portland. Karl says he's hopeful Gay can return sometime during the Kings' upcoming two-game road trip beginning Thursday. ... The Kings are 2-10 in the second game of back-to-back situations. ... Rondo had 11 assists, his 13th consecutive game with at least 10 assists.\nBlazers: Of Portland's first 10 baskets, Lillard had seven assists. ... With the announcement of full All-Star game rosters coming Thursday, Karl said Lillard is worthy of a West team berth, with a caveat. \"He's an All-star talent but I don't think there are enough spots for all the All-Star talents in the West,\" Karl said. ... McCollum, who studied journalism while at Lehigh, is launching a program called \"CJ's Press Pass,\" where he'll mentor journalism students at a Portland high school. ... Lillard recorded his 10th double-double of the season, a career high.\nMIDSEASON RECHARGE\nPortland has been able to refresh itself following an East coast road trip because of a seven-game home stand with plenty of rest in between games. Since returning from the road trip on Jan. 18, the Blazers play seven games over 17 days, with two-day breaks in between four of the games. \"Everybody's been able to catch their breath. ... unusual in January that we've had this many days off,\" Stotts said.\nUNCOMPARABLE COUSINS\nStotts was asked if he could think of a player who compared to Cousins. He pondered the question, and was at a loss. \"Maybe Charles Barkley in his early days, but (Cousins) is bigger and stronger,\" Stotts said. Cousins had a combined 104 points and 25 rebounds in the two games prior to Tuesday. \"These are two special games, games we'll remember for a long, long time,\" Karl said.\nUP NEXT\nKings: Thursday at New Orleans\nBlazers: Friday at home against Charlotte",
  "source": "espn_api",
  "crawled_at": 1764994513.095576
}