{
  "game_id": "0022200311",
  "espn_id": "401468466",
  "date": "Nov 29, 2022",
  "matchup": "LAC @ POR",
  "headline": "Powell scores 32 as Clippers rally past Blazers 118-112",
  "body": "PORTLAND, Ore. -- — Norman Powell scored 22 of his 32 points in the fourth quarter, and the Los Angeles Clippers beat Anfernee Simons and the Portland Trail Blazers 118-112 on Tuesday night.\n\n\r\n              Reggie Jackson had 24 points and 12 assists, helping the Clippers to their second straight win. Ivica Zubac added 12 points and 13 rebounds.\n\n\r\n              Los Angeles trailed 95-82 after three quarters, but outscored Portland 36-17 in the final period. Powell, a reserve, was 7 for 9 from the field in the fourth.\n\n\r\n              “When you get traded from somewhere you want to play well against them, I thought he was a little too excited in the first half,” Clippers coach Ty Lue said of Powell. “We’re always going to stay with our guys and he had 24 points in the second half, really attacking the basket, getting to the paint, getting to the free-throw line. He’s been playing great for about the last 3-4 weeks.”\n\n\r\n              Portland wasted a terrific performance by Simons, who made nine 3-pointers and scored 37 points. Jerami Grant had 32 points. Justise Winslow collected 10 points and 13 rebounds, and Jusuf Nurkic finished with 13 points and 10 boards.\n\n\r\n              “They started going on their run and we just couldn’t get stops,” Simons said of the loss. “The momentum flipped and they played with a lot of energy.\n\n\r\n              Simons’ 3 lifted the Trail Blazers to a 91-73 lead with 3:13 left in the third. But they collapsed down the stretch.\n\n\r\n              A layup by Powell, who along with Robert Covington was traded by Portland to the Clippers, cut the Blazers’ lead to 98-93. \n\n\r\n              A technical free throw from Powell tied it at 98 with 7:30 to go.\n\n\r\n              Grant was called for his sixth foul on a drive with 3:52 left. On the next Clippers possession, Powell connected from the corner to tie it at 108. \n\n\r\n              Nicolas Batum’s 3-pointer and Marcus Morris’ jumper helped Los Angeles to a 113-110 lead with 1:59 left. Powell also had another big basket with 1:23 remaining.\n\n\r\n              Batum only had 3 points but guarded Simons much of the fourth quarter.\n\n\r\n              “He really changed the game for us,” Lue said of Batum.\n\n\r\n              JACKSON TAKES FALL, RETURNS\n\n\r\n              Jackson took a scary fall late in the second quarter. Jackson’s head hit the court and he was unable to get up until a timeout was called. \n\n\r\n              Jackson returned to the game to start the second half.\n\n\r\n              LILLARD IMPROVING, RETURN UNCLEAR\n\n\r\n              Blazers guard Damian Lillard has been out with a calf strain since Nov. 19. He has recently started working back on the court, but his return is unclear. \n\n\r\n              “I think he’s feeling better,” Blazers coach Chauncey Billups said. “He’s starting to get on the court a little bit.”\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Visit L.A. Lakers on Wednesday night. \n\n\r\n              Clippers: Visit Utah Jazz on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994989.068434
}