{
  "game_id": "401810177",
  "espn_id": "401810177",
  "date": "Dec 02, 2025",
  "matchup": "SA vs MEM",
  "headline": "Harrison Barnes scores 31 points as the San Antonio Spurs beat the Memphis Grizzlies 126-119",
  "body": "SAN ANTONIO -- — Harrison Barnes scored 31 points, De’Aaron Fox had 29 and the San Antonio Spurs beat the Memphis Grizzlies 126-119 on Tuesday night.\n\n\r\n              Dylan Harper added 15 points as San Antonio improved to 6-2 since losing Victor Wembanyama to a strained left calf on Nov. 15.\n\n\r\n              Zach Edey had 19 points and 15 rebounds for Memphis, which had won three straight and five of six without star point guard Ja Morant.\n\n\r\n              After shooting 1 for 4 on 3-pointers in a 125-112 loss at Minnesota on Sunday, Barnes made his first three 3s to set up a season high. Barnes finished 7 for 12 on 3-pointers and 10 for 20 from the field.\n\n\r\n              Fox had 11 points in the fourth quarter as San Antonio rallied from a seven-point deficit in improving to 9-2 at home.\n\n\r\n              Memphis outscored San Antonio 58-42 in the paint with Wembanyama watching from the bench in a brown hoodie.\n\n\r\n              Edey controlled the paint with the league’s leading shot blocker out, shooting 8 for 12 from the field and grabbing 11 defensive rebounds. The 7-foot-3, 299-pound center got tangled up with Jeremy Sochan in the first half, drawing a loose ball foul for pulling Sochan’s arm as they fell to the court. Edey drew a common foul that was reviewed after elbowing Luke Kornet in the face with 9:36 remaining in the game.\n\n\r\n              Cam Spencer added a season-high 21 points for Memphis, and Jaylen Wells had 20. Jaren Jackson Jr. was limited to seven points and six rebounds.\n\n\r\n              Up next\r\n              Grizzlies: Host Los Angeles Clippers on Friday.\n\n\r\n              Spurs: At Orlando on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042738.891055
}