{
  "game_id": "0021800392",
  "espn_id": "401071073",
  "date": "Dec 10, 2018",
  "matchup": "PHI vs. DET",
  "headline": "Embiid powers Sixers past slumping Pistons, 116-102",
  "body": "PHILADELPHIA --  Joel Embiid hasn't been feeling like himself for a while and felt sick a day earlier.\n\nNothing like playing the Pistons to help him snap out of it.\n\nEmbiid scored 24 points in his return to the lineup after a one-game absence, Ben Simmons and Furkan Korkmaz added 18 points apiece, and the Philadelphia 76ers beat Detroit for the second time in four days, winning 116-102 on Monday night.\n\nEmbiid was given the night off to rest at Detroit on Friday after the 7-foot-2 star grew frustrated with his role following three straight sub-20-point performances. Embiid, though, has had little trouble against the Pistons, now averaging 32 points in three contests this season.\n\n\"I love everybody, love my teammates, love the coaching staff -- I think everyone that knows me knows that,\" said Embiid, wearing a \"Process\" sweatshirt to the postgame press conference. \"Me being frustrated is because I hold myself to a really high standard.\"\n\nJimmy Butler, who had 38 points to lead Philadelphia to a 117-111 victory in Detroit on Friday, exited in the first half with a strained groin and did not return.\n\nEmbiid helped make up for that major absence, improving as the game went on after saying he felt \"rusty\" early in the contest. Sixers coach Brett Brown even said he thought his prized big man may miss a second straight game because he wasn't feeling well -- ailments Embiid later revealed to be a \"migraine and diarrhea.\"\n\n\"You can see how important he is to us, especially when Jimmy goes out,\" Brown said. \"Some of the plays he made late and his spirit was just exceptional tonight. . He started playing with more of a bounce, more tenaciousness as the game unfolded.\"\n\nLuke Kennard finished with a career-high 28 points on 5-for-8 3-point shooting and Andre Drummond had 21 points and 17 rebounds for the slumping Pistons (13-12), who have dropped five straight after five consecutive wins.\n\nDetroit was missing Blake Griffin, 10th in the NBA in scoring. Griffin, who had 50, 38 and 31 points against the Sixers this season, was rested after Detroit hosted New Orleans the previous night.\n\n\"(Kennard's) 3-point shooting was very positive, and we're trying to get every bit of positive we can out of this stretch,\" Pistons coach Dwane Casey said. \"This has been the stretch from hell. But it's going to make us a better team, closer together, tougher hopefully.\"\n\nHighlighted by a couple of Simmons' dunks, the Sixers scored 38 points in opening quarter and led by as many as 15 in the first half. The Pistons pulled within five early in the fourth quarter before an emphatic dunk by Embiid and Simmons' three-point play helped Philly pull away for its 10th win in the last 12 games.\n\n\"I just don't think they were ready for me,\" Simmons said. \"Every game in front of the Pistons, I felt like certain matchups I can take over, get to the rim and do my thing.\"\n\nTIP-INS\n\nPistons: Besides Griffin, Stanley Johnson (knee), Reggie Bullock (ankle) and Ish Smith (groin) were also out. ... Unless they meet in the playoffs, Detroit is done with Philadelphia this season. They've already met four times over the first two months of the season, with the Sixers winning three. ... Glenn Robinson III left with a sprained ankle. He'll have an MRI on Tuesday.\n\n76ers: Simmons scored his 400th point of the season during an 11-point first quarter, becoming the first player in the NBA with at least 400 points, 200 rebounds and 200 assists. ... The Sixers have scored at least 100 points in 17 straight games, their longest streak since 1990. . At 14-1, the Sixers are off to their best start at home since the 1966-67 season.\n\nBIG-TIME BENCH\n\nThe Pistons got 54 points from their bench, with four reserves hitting for double figures and combining for 11 3-pointers.\n\nT.J. McConnell had 14 points and six assists but no one off the bench was as good as Korkmaz, who was named the team's player of the game after a career-high scoring output.\n\n\"He's not intimidated by NBA basketball,\" Brown said. \"He's not intimidated by the moment.\"\n\nNO HOOPLA\n\nEmbiid and Drummond have been embroiled in a trash-talking rivalry over the past two seasons but Casey was proud his big man stayed away from it Monday.\n\n\"He didn't get caught up in all the hoopla,\" the Pistons coach said. \"He played his game. That's something that's part of his growth process.\"\n\nUP NEXT\n\nPistons: At Charlotte on Wednesday night.\n\n76ers: Host Brooklyn on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994050.1942139
}