{
  "game_id": "0021500361",
  "espn_id": "400828248",
  "date": "Dec 14, 2015",
  "matchup": "CHI vs. PHI",
  "headline": "Bulls use 2nd half surge for 115-96 rout of lowly 76ers",
  "body": "CHICAGO -- Trailing to a team with just one win this season, the Chicago Bulls used the halftime break to identify the reason -- their defense.\nJimmy Butler had 23 points and the Bulls rallied from a five-point deficit for a 115-96 rout of the lowly Philadelphia 76ers on Monday night.\n\"That was the main focus in the second half -- just to guard,\" Butler said.\n\"You can't look at their record and think they're not a good team, because they are. But if we focus on the way we have to play on both ends, we can win games.\"\nNikola Mirotic had 17 points and Tony Snell scored 15 of 16 points in the second half. Joakim Noah had 15 rebounds and eight assists as the Bulls won their third straight.\n\nAfter trailing 56-51 at the intermission, the Bulls had a 64-40 advantage in the second half.\nThe 76ers drop to 1-25 and remain winless through 15 road games. Rookie Jahlil Okafor had 22 points in his first game as a professional in his hometown.\n\"It was fun,\" Okafor said. \"Just pretty fun having all my family here.\"\nOkafor had eight points on 4-of-4 shooting in the second quarter and had 16 points in 16 first-half minutes. Philadelphia scored 37 points in the second on 16-of-25 (64 percent) shooting.\n\"In the second quarter, we did not put any pressure on them,\" Bulls coach Fred Hoiberg said. \"They went anywhere they wanted on the floor and they were comfortable. We were not helping. It was a very poor defensive quarter for us.\"\nChicago, though, quickly dashed hopes for an upset early in the third quarter. The Bulls dialed up the intensity and made Philadelphia look like a one-win team.\nAfter committing just two turnovers in the first half, the Sixers had six in the first 6:34 of the third quarter. By then, the Bulls had claimed a 69-62 advantage and things only got worse for Philadelphia.\nChicago had an 85-68 lead entering the fourth -- thanks to a 34-12 edge in the third -- and Mirotic had a 3-pointer to open the scoring in the final quarter to make it a 20-point game.\n\"It's reflective of when you get to real NBA basketball and closing out a game,\" Sixers coach Brent Brown said. \"We had had a good second period and you knew they were going to come out of the locker room like they did.\n\"The young guys need to learn how to get through that. It's a 48-minute game.\"\nSnell led the Bulls with 12 points on 4-of-5 shooting in the third. Okafor was limited to two points.\nBesides seven turnovers in the quarter, the Sixers were just 5 for 21 (23.8 percent) from the field.\nTIPS IN\n76ers: C Nerlens Noel missed the game with a corneal abrasion of the left eye suffered on Sunday at Toronto. \"It's not as significant as we guessed,\" coach Brent Brown said. \"We don't expect him to play in Atlanta. We'll learn more about that. Evidently you learn more after 24 hours and it hasn't been that yet.\"\nBulls: Derrick Rose played despite feeling ill and had six points in 26 minutes. Hoiberg said he considered having Rose sit out the second half, but the former MVP played roughly 9 minutes.\nSTRONG SUPPORT\nBrown used Okafor's homecoming to offer a passionate defense of his prized rookie after video of a street fight surfaced recently:\n\"All you have to do is look at him and interact with him and you see there's goodness in him. The situation that happened was unfortunate, he was ashamed, he was embarrassed. I feel like that's a distance memory.\n\"In a twisted way, I hope we look back at that experience -- all of us -- and it toughens him up and teaches him a real life lesson. We are with him and I'm personally with him. I'm very fond of him.\"\nLOST CAUSE\nOkafor was asked if all the losing is tough. \"I'm living my dream,\" he said. \"It's been a lot of fun. It's my rookie campaign and I'm working on improving. Coach always talks about having good days and good days adding up.\"\nUP NEXT\n76ers: Visit the Atlanta Hawks on Wednesday night.\nBulls: Host the Memphis Grizzlies on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764993956.712613
}