{
  "game_id": "0022401223",
  "espn_id": "401736817",
  "date": "Dec 16, 2024",
  "matchup": "TOR vs. CHI",
  "headline": "Vucevic scores 24 points as Bulls hold off Raptors 122-121 for 4th win in 6 games",
  "body": "TORONTO -- — Nikola Vucevic scored 24 points, Coby White added 19 and the Chicago Bulls held on to beat the Toronto Raptors 122-121 on Monday night for their fourth win in six games.\n\n\r\n              Talen Horton-Tucker scored 15 points and Ayo Dosunmu had 12 as seven Bulls players reached double figures.\n\n\r\n              Chicago's Lonzo Ball missed six of his first seven 3-point attempts before making a key shot from long distance late in the fourth.\n\n\r\n              Bulls guard Josh Giddey had to be helped off the court midway through the third quarter after rolling his right ankle while trying to defend a shot. He did not return. Giddey finished with 11 points, nine rebounds and eight assists in 24 minutes.\n\n\r\n              RJ Barrett scored 32 points and Gradey Dick had 27 as Toronto almost erased a 16-point deficit in the fourth quarter, but the short-handed Raptors lost their fifth straight. \n\n\r\n              Toronto’s Jamal Shead banked in a 3-pointer at the final buzzer but it wasn’t enough.\n\n\r\n              Chris Boucher had 11 points and 10 rebounds, and Ochai Agbaji added 15 points for Toronto.\n\n\r\n              Takeaways\r\n              Bulls: Vucevic returned after missing Sunday’s win over Charlotte because of an illness, but two-time All-Star guard Zach LaVine sat out because of back spasms.\n\n\r\n              Raptors: Toronto played its second straight game without All-Star forward Scottie Barnes, who sprained his right ankle on Dec. 9. The Raptors took another hit when center Jakob Poeltl exited in the third because of a strained left groin. \n\n\r\n              Key moment\r\n              Chicago led 102-86 early in the fourth but Toronto cut the deficit to 112-111 on Barrett’s hook shot with 2:28 left. White made a layup and Ball hit a 3 to keep the Bulls in front.\n\n\r\n              Key stat\r\n              Toronto fell to 0-14 this season when trailing at halftime. Chicago led 53-50 after two quarters.\n\n\r\n              Up next\r\n              Both teams play again Thursday, when Chicago visits Boston and Toronto hosts Brooklyn.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996981.725756
}