{
  "game_id": "0021600312",
  "espn_id": "400899754",
  "date": "Dec 05, 2016",
  "matchup": "CHA @ DAL",
  "headline": "Walker leads balanced effort as Hornets beat Mavs 109-101",
  "body": "DALLAS --  Yet another Dallas injury opened the door for a Charlotte Hornets rally.\n\nKemba Walker scored 19 points, Nicolas Batum had 14 points and 15 rebounds, and the Hornets came back from an 11-point, third-quarter deficit to beat the Mavericks 109-101 on Monday night.\n\nAlready down three regulars to injury, Dallas lost center Andrew Bogut late in the first quarter to a right knee injury. While the Mavericks didn't think the injury was serious, the Hornets took advantage to dominate the boards, outrebounding the Mavericks 55-35 and scoring 54 points in the paint.\n\n\"That's a big difference,\" Hornets coach Steve Clifford said of Bogut's absence. \"He's always been a terrific basket protector. If you take him out, those other guys are good, but it's a different level of rim protection.\"\n\nMarco Belinelli scored 12 of his 16 points in the second half, including the team's first two 3-pointers after the Hornets missed their first 14 from long range. Six Hornets scored in double figures.\n\nJeremy Lamb added 10 of his 14 points in the fourth quarter, including a 3 with 13.9 seconds remaining to hold off a late Dallas run.\n\nHarrison Barnes scored 29 points for the Mavericks and Deron Williams had his first double-double of the season with 15 points and 13 assists.\n\n\"It seems like we get someone back and somebody else goes down,\" said Williams, who had missed eight games of his own due to a calf strain. It's been tough. We'd really like to have Dirk (Nowitzki) out there, and J.J. (Barea). You can't control certain things so we've just got to keep on trucking.\"\n\nAfter a 15-4 Mavericks run early in the third quarter temporarily opened up a back-and-forth game, the Hornets answered with a 10-1 spurt and the game stayed close into the final minutes.\n\nMavericks coach Rick Carlisle was assessed a technical foul arguing a call and Batum converted the free throw for a 98-91 lead with 4:26 to play, capping a 15-5 Hornets run.\n\nAfter the Hornets opened the lead to 104-95 with 2:01 to play, Dallas scored the next six points and had a chance to get closer, but Cody Zeller blocked Williams' shot in the lane with 34 seconds to play and Lamb followed with his 3.\n\n\"It's a tough environment, but we stuck together today,\" Lamb said. \"We got down 10, but we kept fighting, and we were able to pull out a win.\"\n\nSIGH OF RELIEF\n\nBogut limped off the court with 45 seconds left in the first quarter after a collision with Charlotte's Roy Hibbert, grabbing his right knee immediately. He was quickly ruled out for the rest of the game.\n\nBut Carlisle said initial reports were positive and that the knee was only hyperextended.\n\n\"The X-ray was clean from the information that I got,\" Carlisle said. \"We'll probably have more information in a day or so. At this point, it appears we dodged a bullet.\"\n\nBogut was not available for comment after the game.\n\nLONG ODDS\n\nAfter 16 seasons in a row of finishing .500 or better and making the playoffs in 15 of those seasons, the Mavericks are just 4-16.\n\nThe last team to make the playoffs after such a poor start was the 2004-05 Bulls, who started 5-15 and finished 47-35 before losing in the first round of the playoffs to Washington.\n\nTIP-INS\n\nHornets: The game had 18 lead changes and was tied 17 times. . The Hornets made 24 of 26 free throws in beating the Mavs for the second time in five days. . Charlotte has lost six of eight aside from its two wins over Dallas.\n\nMavericks: Nowitzki missed his fifth straight game and 15th overall with right Achilles soreness. Barea missed his 10th game in a row with a left calf strain. Seth Curry missed his third game in a row with a right knee sprain. ... Devin Harris scored seven points in the first quarter -- more than he had scored in three games combined since returning from a big toe injury.\n\nUP NEXT\n\nHornets: Home against Detroit on Wednesday. The Pistons beat the Hornets in Charlotte 112-89 on Nov. 29.\n\nMavericks: Home against Sacramento on Wednesday, the third of a four-game homestand and the first of two visits the Kings make to Dallas in 11 days.",
  "source": "espn_api",
  "crawled_at": 1764995530.691405
}