{
  "game_id": "0021600669",
  "espn_id": "400900090",
  "date": "Jan 23, 2017",
  "matchup": "DET vs. SAC",
  "headline": "Kings snap 5-game skid with 109-104 win over Pistons",
  "body": "AUBURN HILLS, Mich. --  With Rudy Gay out for the season, the Sacramento Kings are in for quite a challenge on this eight-game road trip.\n\n\"Everybody has to step their game up,\" backup guard Ty Lawson said. \"Everybody has been working hard, and now that Rudy went down, we can show what they've been working on.\"\n\nLawson scored 19 points and helped turn the game around with a second-quarter flurry, and the Kings snapped a five-game losing streak with a 109-104 victory over the Detroit Pistons on Monday night. DeMarcus Cousins had 22 points and 14 rebounds, but Pistons coach Stan Van Gundy credited the Sacramento backcourt.\n\n\"(Cousins is) a great player. He didn't have a great night,\" Van Gundy said. \"I thought their guards really hurt us even more than he did.\"\n\nLawson scored nine points in the second, and the Kings outscored the Pistons 37-24 in the quarter to take a 65-62 lead into halftime. A 3-pointer by Lawson put Sacramento up 101-90 in the fourth, and the Kings held on from there to stop Detroit's three-game winning streak.\n\nAndre Drummond had 14 points and 12 rebounds for the Pistons.\n\nThe Kings lost Gay on Wednesday to a ruptured left Achilles tendon. Then they set off on this eight-game trip. Detroit was game No. 3.\n\nSacramento has won only two of its last 10 games, and both victories were against the Pistons .\n\n\"Stan probably doesn't like me too much,\" Sacramento coach Dave Joerger said. \"It's a crazy deal how it works. I like their team a lot and think he does a great job.\"\n\nDetroit jumped out to an early 11-point lead and led 38-28 after one quarter, but the Pistons were outplayed after that. Lawson scored seven points in a span of 38 seconds early in the second.\n\n\"I'm getting the ball, pushing it and seeing what happens,\" Lawson said. \"It's just being aggressive, trying to get to the basket. I hit my first couple shots, everybody started collapsing, and then we started finding open shots from 3.\"\n\nDetroit began the second quarter with a lineup of five backups -- Tobias Harris, Aron Baynes, Ish Smith, Stanley Johnson and Reggie Bullock. That group was outscored 16-6 in the first 3:06.\n\nMARQUEE MATCHUP\n\nCousins got the best of Drummond in a matchup of two of the game's top big men. Both had double-doubles. Drummond leads the NBA with 209 double-doubles since he entered the league in 2012-13. Cousins is second in that span with 206.\n\n\"He is a do-it-all guy,\" Drummond said. \"He moves the ball around. He is able to shoot it from the 3 and he is great attacking the basket as well.\"\n\nTIP-INS\n\nKings: Sacramento had 17 second-chance points. The Pistons came in allowing only 9.4 per game. ... Sacramento's bench outscored Detroit's 52-30.\n\nPistons: Detroit G Kentavious Caldwell-Pope returned after missing four games with a left rotator cuff injury. He scored 14 points but went only 4 of 14 from the field. ... F Jon Leuer scored 15 points on 6-of-6 shooting in the first quarter. He didn't score again.\n\nBETTER OFF DRIVING?\n\nSacramento's previous game was Saturday at Chicago, but what figured to be a simple trip to the Detroit area Sunday turned into a bit of a mess. A team spokesman said the Kings' flight was delayed and they were on the plane for about seven hours.\n\nUP NEXT\n\nKings: Visit the Cleveland Cavaliers on Wednesday night.\n\nPistons: Visit the Miami Heat on Saturday night after a four-day layoff.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764996055.9739032
}