{
  "game_id": "0021601012",
  "espn_id": "400900407",
  "date": "Mar 15, 2017",
  "matchup": "PHX vs. SAC",
  "headline": "Labissiere scores career-high 32, Kings beat Suns 107-101",
  "body": "PHOENIX -- Skal Labissiere has had a string of strong performances as his opportunities have grown in the wake of the DeMarcus Cousins trade.\nNothing, though, like his breakout night in Phoenix on Wednesday.\nThe Sacramento rookie scored 21 of his career-high 32 points in the fourth quarter, lifting the Sacramento Kings to a 107-101 victory over the Suns.\nThe 6-foot-11 Haitian, who spent much of the season with the Reno Bighorns of the Developmental League, scored the first 16 Sacramento points of the final quarter.\n\"I wasn't surprised at all,\" Labissiere said. \"I'm being more aggressive, just thinking about the next play, going after every single board and getting back on defense and helping my teammates. It's all about effort and the rest will come. They really trusted me out there.\"\nT.J. Warren scored 24, Devin Booker 19 and Marquese Chriss 17 for the Suns, who rested Eric Bledsoe for the night in what coach Earl Watson called \"a management decision.\"\n\"I don't think any coaching staff would hold Bled out,\" Watson said.\nThe 28th overall pick in the draft out of Kentucky, Labissiere played only 52 minutes for the Kings before the All-Star break but has seen his playing opportunities grow since the Cousins trade.\nRookie Tyler Ulis, a teammate of Labissiere at Kentucky, started in place of Bledsoe and had a career-high 13 assists.\nThe Kings drafted Labissiere with the pick that was part of a trade with Phoenix that allowed the Suns to move up to the No. 8 spot and select Chriss.\n\"Skal took over. Skal played well,\" Watson said. \"He's a unique player. He has length, he gets a spot, he elevates, he jumps so quick and so high. His touch is right on point, and that 3 he shot was just a confidence shot. ... He and Marquese can battle for the next 10, 15 years.\"\nLabissiere made six of seven shots in the fourth quarter, including his only 3-point attempt of the game.\n\"He is a talented guy and we got it to him in spots where he could be effective,\" Sacramento coach Dave Joerger said. \"Once you get a couple of easy ones, you feel a lot better about your game.\"\nPhoenix led most of the first two quarters, but Sacramento finished the half with a 12-2 run to go up 48-47 at the break. Kosta Koufos scored six of his 10 first-half points during the late run.\nAfter a tight third quarter, Sacramento took the lead for good at 95-93 on Willie Cauley-Stein's rebound basket with 3:08 to play. It was the start of an 11-3 run that put the Kings up 103-96 after Ty Lawson made one of two free throws with 43.2 seconds to play.\nCauley-Stein and Arron Afflalo scored 14 apiece for the Kings.\nThe Suns' Derrick Jones Jr., runner-up in the NBA slam dunk contest, made a soaring block of Tyreke Evans' layup with 8:40 left in the second quarter and came down hard on his backside. He was helped from the court and did not return to the game due to a right hip contusion.\nTIP INS\nKings: Sacramento has won two in a row after an eight-game losing streak. ... Darren Collison sat out the game as a scheduled rest day. ... Sacramento has won its last three games in Phoenix.\nSuns: Booker is one of three players to average 21 points per game before his 21st birthday. The other two are LeBron James and Kevin Durant. ... Brandon Knight was unavailable due to back spasms, but hadn't played in the last 10 games anyway as the team went with Ulis as Bledsoe's backup. ... Leandro Barbosa did not play in the second half due to illness.\nUP NEXT\nKings: at Oklahoma City on Saturday afternoon.\nSuns: host Orlando on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995951.1122382
}