{
  "game_id": "401810117",
  "espn_id": "401810117",
  "date": "Nov 19, 2025",
  "matchup": "DAL vs NY",
  "headline": "Brunson's 28 points, Shamet's late heroics push Knicks past Mavericks 113-111",
  "body": "DALLAS -- — Jalen Brunson had a game-high 28 points in his return from a two-game absence, Landry Shamet scored a pair of 3-pointers in the final 1:02 and drew a crucial charging foul in the final second, and the Knicks beat the Dallas Mavericks 113-111 on Wednesday night.\n\n\r\n              Karl-Anthony Towns had 18 points and 14 rebounds while Josh Hart had 16 points and 10 rebounds off the bench for the Knicks, who won for the first time in five road games.\n\n\r\n              Brunson, who had a grade 1 ankle sprain, hit a free throw with 3.8 seconds left for a two-point lead. Dallas’ P.J. Washington inbounded to Brandon Williams at midcourt, Williams drove to the basket and scored with 0.7 seconds left but was called for charging into Shamet.\n\n\r\n              D’Angelo Russell and Naji Marshall scored 23 points each off the bench for the Mavericks, who have lost five of their last six games.\n\n\r\n              Brunson’s free throw ended a string of five straight Knicks misses from the line in the final 22 seconds. They shot 19 for 35 (54.3%) on free throws overall.\n\n\r\n              The Knicks were 12 for 42 from 3-point range after hitting 3 of 22 during the first half.\n\n\r\n              The Mavericks, who were last in the NBA averaging 10.5 3-pointers per game, hit 13 through the first three quarters but were 3 for 11 in the fourth.\n\n\r\n              Dallas tied a season high with 64 points from its bench to New York’s 39, but Mavericks starters scored only 47 points.\n\n\r\n              The Mavericks’ Cooper Flagg, the top pick in this year’s draft, missed his first NBA game on Wednesday night with an illness.\n\n\r\n              Up Next\r\n              Knicks: At Orlando on Saturday.\n\n\r\n              Mavericks: Host New Orleans on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042658.781642
}