{
  "game_id": "401810124",
  "espn_id": "401810124",
  "date": "Nov 22, 2025",
  "matchup": "ORL vs NY",
  "headline": "Franz Wagner leads hot-shooting Magic over Knicks, 133-121",
  "body": "ORLANDO, Fla. -- — Franz Wagner had 37 points, Desmond Bane scored 27, and the Orlando Magic beat the New York Knicks 133-121 on Saturday night for their sixth win in their past seven games.\n\n\r\n              Wagner scored seven of his season-high 37 points during a 13-0 fourth quarter run that helped the Magic pull away to their second win in 11 days over the Knicks. Bane and Jalen Suggs, with 26 points, also had seasons scoring highs.\n\n\r\n              Bane's 3-pointer late in the third quarter broke a 93-93 tie and put Orlando in front for good.\n\n\r\n              Anthony Black came off the bench with 11 points, four assists, and three steals for Orlando.\n\n\r\n              Jalen Brunson had 33 points and 11 assists for the Knicks. Karl-Anthony Towns had 24 points and eight rebounds and Mikal Bridges had 18 points.\n\n\r\n              Josh Hart had 12 points before fouling out with 2:34 remaining. With 7:02 left and the game slipping away from New York, Hart lost the ball in the backcourt and was called for his fifth personal foul and a technical for grabbing Suggs while attempting to recover the ball.\n\n\r\n              Wagner scored eight points on a 14-0 run that erased an early 10-point Knicks lead. He had 30 points less than three minutes into the second half.\n\n\r\n              Orlando shot 55.3% overall and New York shot 54.4% for the game.\n\n\r\n              Knicks guard Landry Shamet left the game with an apparent shoulder injury after a collision with Magic center Wendell Carter Jr. with 9:17 left in the first quarter.\n\n\r\n              Magic forward Paolo Banchero sat out a fifth straight game with a groin strain.\n\n\r\n              New York's OG Anunoby missed a second game with a strained hamstring.\n\n\r\n              Magic coach Jamahl Mosley did not come out for the second half. The team said Mosley fell ill.\n\n\r\n              Up next\r\n              Knicks: Play at Brooklyn on Monday night.\n\n\r\n              Magic: Play at Boston on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042675.198285
}