{
  "game_id": "0022401108",
  "espn_id": "401705674",
  "date": "Apr 02, 2025",
  "matchup": "OKC vs. DET",
  "headline": "Gilgeous-Alexander scores 33 as Thunder top Pistons 119-103 for 11th straight win",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 33 points, and the Oklahoma City Thunder beat the short-handed Detroit Pistons 119-103 on Wednesday night for their 11th straight win. \n\n\r\n              Jalen Williams scored 23 points and Chet Holmgren added 22 points, 11 rebounds and five blocks for the Thunder. \n\n\r\n              Oklahoma City has a three-game lead over the Cleveland Cavaliers with six games remaining in the race for the league’s best record and homecourt advantage throughout the playoffs.\n\n\r\n              Tim Hardaway Jr. led the Pistons with 23 points to pick up the slack for All-Star guard Cade Cunningham, who was out with a bruised left calf. The Pistons also were missing three players because of their altercation with the Minnesota Timberwolves on Sunday. Forward Ron Holland II and guard Marcus Sasser served their suspensions Wednesday and forward/center Isaiah Stewart served the first game of his two-game suspension against Oklahoma City.\n\n\r\n              Commissioner Adam Silver was in attendance, and the Thunder gave him the same kind of show they’ve delivered all season. Lu Dort's tip-in at the halftime buzzer gave the Thunder a 65-59 lead at the break.\n\n\r\n              The Thunder opened the second half on a 10-0 run to take a 75-59 lead.\n\n\r\n              Detroit cut the deficit to four points in the fourth quarter before the Thunder closed strong. \n\n\r\n              Takeaways\r\n              Pistons: Detroit picked the wrong day to be less than full strength. Oklahoma City is one of the league's deepest teams, and it showed in the closing minutes.\n\n\r\n              Thunder: Oklahoma City finished with a 29-1 record against Eastern Conference opponents this season. The 96.7% winning percentage is the best in league history against an opposing conference. The only loss against the East was at Cleveland on Jan. 8. \n\n\r\n              Key mome\r\n              nt\r\n              Dort's 3-pointer rattled out and popped up before dropping in to give the Thunder a 112-103 lead with about three minutes to play. \n\n\r\n              Key stat\r\n              Detroit committed 18 turnovers to Oklahoma City's 10.\n\n\r\n              Up next\r\n              The Pistons visit the Toronto Raptors on Friday. The Thunder visit the Houston Rockets on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997495.940653
}