{
  "game_id": "0022401055",
  "espn_id": "401705621",
  "date": "Mar 26, 2025",
  "matchup": "IND vs. LAL",
  "headline": "LeBron James beats buzzer with tip to lift Lakers past Pacers and keep record streak alive",
  "body": "INDIANAPOLIS -- — LeBron James had a buzzer-beating tip-in to cap a 10-point fourth quarter, Luka Doncic scored 34 points and the Los Angeles Lakers beat the Indiana Pacers 120-119 on Wednesday night.\n\n\r\n              James extended his NBA-record streak of 10 or more points to 1,283 games — barely. He was 0 for 6 with three points through the first three quarters. He finished with 13 points, 13 rebounds and seven assists.\n\n\r\n              Doncic also had seven rebounds, seven assists and made six 3-pointers. Austin Reaves added 24 points as the Lakers snapped a three-game losing streak to move into a tie with Memphis for the fourth seed in the Western Conference.\n\n\r\n              Bennedict Mathurin had 23 points to lead Indiana. Tyrese Haliburton had a season-high 18 assists and 16 points, the last of which gave Indiana a 119-118 lead with 42.2 seconds left. Indiana had streaks of five straight wins overall and eight straight at home snapped.\n\n\r\n              The Lakers led the entire second and third quarters and were still up 118-112 with 1:44 to go. But Haliburton's three-point play capped a 7-0 run that gave Indiana the lead. Both teams then had empty possessions and Doncic missed a midrange floater in the waning seconds, setting up James for the winner.\n\n\r\n              Takeaways\r\n              Lakers: Los Angeles desperately needed something to go right after losing seven of its previous 10. And despite seeing James go 4 of 12, the Lakers — and James — still found a way to finish the job.\n\n\r\n              Pacers: Indiana fought back from an 18-0 first half run that threatened to turn this one into a blowout. But its this kind of resilience that could propel them to a strong postseason run.\n\n\r\n              Key moment\r\n              James beat the Pacers to rim for the winner, then was careful to just touch it and pull his hand away.\n\n\r\n              Key stat\r\n              While James was 0 for 5 from the field in the first half, the Lakers shot 52.4% and made made 10 3s, two more than Indiana.\n\n\r\n              Up next\r\n              Los Angeles makes its next stop on a four-game trip Thursday night at Chicago. Indiana visits Washington on Thursday in its final back-to-back this season. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998123.957454
}