{
  "game_id": "0022400391",
  "espn_id": "401704957",
  "date": "Dec 23, 2024",
  "matchup": "CHA vs. HOU",
  "headline": "Jabari Smith Jr. scores 21 as Rockets run away from Hornets 114-101 for third straight victory",
  "body": "CHARLOTTE, N.C. -- — Jabari Smith Jr. had 21 points and 11 rebounds, Fred VanVleet added 20 points and the Houston Rockets beat the Charlotte Hornets 114-101 on Monday night for their third straight win.\n\n\r\n              Amen Thompson had 19 points and 11 rebounds, and Cam Whitmore chipped in with 17 points off the bench for the Rockets. They led by 34 in the second half after getting a strong effort from their young corps of players.\n\n\r\n              Miles Bridges scored 24 points and LaMelo Ball added 23 for the Hornets, who’ve lost 13 of 14.\n\n\r\n              The Rockets stifled the Hornets early on, holding Charlotte to 15 points in the first quarter and 1 for 11 from beyond the arc. The Rockets extended their lead to 62-31 at halftime as VanVleet buried a 3-pointer just before the buzzer. As the Hornets walked to the locker room at halftime they were greeted with a cascade of boos from the home crowd.\n\n\r\n              Takeaways\r\n              Rockets: Houston dominated on the glass in the decisive first half, outrebounding the Hornets 25-14. On one trip down the floor, the Rockets were able to get up three 3-pointers after corralling two offensive rebounds. ... Aaron Holliday was ejected for arguing with officials after playing just three minutes.\n\n\r\n              Hornets: Charlotte shot 2 of 20 from beyond the arc in the first half. Part of that was Houston's defense, but mostly it was the Hornets simply failing to knock down open looks. \n\n\r\n              Key moment\r\n              Thompson had the play of the game early in the fourth quarter when he drove the length of the floor, sidestepped Bridges in the lane and threw down a two-handed dunk.\n\n\r\n              Key stat\r\n              The Rockets outrebounded the Hornets 59-44.\n\n\r\n              Up next\r\n              Both teams are on the road Thursday night, with the Rockets visiting New Orleans and the Hornets at Washington.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997454.58556
}