{
  "game_id": "0022400887",
  "espn_id": "401705453",
  "date": "Mar 04, 2025",
  "matchup": "MIN vs. PHI",
  "headline": "Reid scores 23 as Wolves pull away in fourth to beat 76ers 126-112",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 18 points, Naz Reid added 23 and the Minnesota Timberwolves pulled away in the fourth quarter to beat the short-handed Philadelphia 76ers 126-112 on Tuesday.\n\n\r\n              Julius Randle had 16 points for Minnesota in his second game back after missing 13 games with a groin strain. Nickeil Alexander-Walker added 20 points off the bench. The Timberwolves used a 25-9 run at the start of the fourth to take control.\n\n\r\n              Paul George returned after missing one game with groin soreness, but Philadelphia was without guard Tyrese Maxey (lower back strain) and played its third game since announcing Joel Embiid will miss the rest of the season for left knee injury management. George finished with just seven points on 3-of-11 shooting.\n\n\r\n              Quentin Grimes led the 76ers with 30 points, and Kelly Oubre Jr. added 24 for Philadelphia, which has lost 13 of 15 and was playing the second game of a back-to-back after losing 119-102 at home to Portland a night earlier.\n\n\r\n              Takeaways\r\n              76ers: Grimes has thrived for Philadelphia since being acquired from Dallas. He had a career-high 44 points two games previously and a career-best nine assists against Portland. He scored 20 points in a half for the second time in three games.\n\n\r\n              Timberwolves: Not a pretty effort against a ravaged team, but Minnesota just needs wins. It started the day tied with the Los Angeles Clippers and Sacramento for seventh in the West.\n\n\r\n              Key moment\r\n              Mike Conley might have provided a spark for Minnesota when his buzzer-beating, half-court shot was good at the end of the third. Walker then started the fourth with a 3 as part of the Wolves' run.\n\n\r\n              Key stat\r\n              Minnesota had 19 turnovers, leading to 21 points for Philadelphia. However, the Wolves had no turnovers in the fourth until 48 seconds remained.\n\n\r\n              Up next\r\n              76ers: at Boston on Thursday.\n\n\r\n              Timberwolves: at Charlotte on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764998081.982765
}