{
  "game_id": "401810075",
  "espn_id": "401810075",
  "date": "Nov 12, 2025",
  "matchup": "SA vs GS",
  "headline": "Curry's 46 points leads Warriors to 125-120 victory over Spurs despite Wembanyama's triple-double",
  "body": "SAN ANTONIO -- — Stephen Curry scored 46 points and the Golden State Warriors beat the San Antonio Spurs 125-120 on Wednesday night, overcoming triple-doubles by Victor Wembanyama and Stephon Castle.\n\n\r\n              Jimmy Butler had 28 points and eight assists for Golden State, which had lost three of four. Moses Moody added 19 points.\n\n\r\n              Wembanyama had 31 points, 14 rebounds and 10 assists for his fourth career triple-double. He had 38 points and 12 rebounds in a 121-117 victory at Chicago on Monday night.\n\n\r\n              Wembanyama and Castle became the first Spurs teammates to record triple-doubles in the same game. Castle finished with 23 points, 10 rebounds and 10 assists.\n\n\r\n              San Antonio suffered its first home loss this season. The Spurs had won three in a row overall.\n\n\r\n              Curry scored 29 points in the second half as the Warriors outscored the Spurs 76-64 in the final two quarters.\n\n\r\n              His fourth 3-pointer gave Golden State a 74-73 lead with five minutes left in the third quarter, its first lead since the opening minutes of the first.\n\n\r\n              Curry had 22 points in the third quarter, going 5 for 9 on 3-pointers and making all nine of his free-throw attempts.\n\n\r\n              Golden State finished 32 for 36 on free throws while San Antonio was 14 for 16.\n\n\r\n              The Spurs had three alley-oop dunks in building a 16-point lead in the second quarter, and the 7-foot-4 Wembanyama didn’t throw any down, although he did assist on one to Castle. Luke Kornet had the other two dunks on assists from Castle and Devin Vassell.\n\n\r\n              Wembanyama blocked Draymond Green’s 25-foot, 3-point attempt early in the opening quarter, leaping from the free-throw line to get to the ball. The block extended Wembanyama’s streak to 96 straight games with at least one block.\n\n\r\n              Golden State improved to 1-1 on a six-game trip. San Antonio has four games remaining on its homestand.\n\n\r\n              Up next\r\n              The teams meet again on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042613.821183
}