{
  "game_id": "401809803",
  "espn_id": "401809803",
  "date": "Nov 26, 2025",
  "matchup": "CHA vs NY",
  "headline": "Brunson scores 33 as Knicks rout Hornets 129-101 to improve to 3-1 in NBA Cup group play",
  "body": "CHARLOTTE, N.C. -- — Jalen Brunson scored 33 points, Karl-Anthony Towns had 19 points and 10 rebounds and the New York Knicks handed the Charlotte Hornets their seventh straight loss 129-101 on Wednesday night.\n\n\r\n              Josh Hart added 22 points for the Knicks, who made 13 of 26 shots from 3-point range to improve to 3-1 in NBA Cup group play.\n\n\r\n              Brandon Miller had 18 points in his second game back from a shoulder injury for the Hornets, who’ve lost 10 straight Cup games over the past three seasons and were eliminated from this year’s competition.\n\n\r\n              The Knicks played like a team eager to advance in the NBA Cup midseason tournament and improve their point differential, which was at minus-2 entering the night.\n\n\r\n              New York coach Mike Brown didn't take out his starters until 2:17 remained in the game and his team up by 24.\n\n\r\n              The Knicks left no doubt about this one.\n\n\r\n              They bolted to a 25-point halftime lead behind a balanced offensive attack as all five starters scored in double digits before halftime. New York shot 64% from the field and made 6 of 10 shots from beyond the arc before the break.\n\n\r\n              Of the Knicks' 72 first-half points, 68 came from their starters including 19 from Hart.\n\n\r\n              Charlotte's LaMelo Ball struggled to keep up with Brunson, who sent him to the bench in the third quarter with his fourth foul.\n\n\r\n              Ball, the only player in Hornets history to ever sign a max contract that pays him $260 million, later was assessed a technical foul for arguing with officials and he finished with just 11 points on 4-of-14 shooting.\n\n\r\n              Meanwhile Brunson was greeted with repeated chants of “MVP! MVP!” from the crowd at Charlotte's Spectrum Center. \n\n\r\n              Up next\r\n              Both teams play another NBA Cup group stage game on Friday night with New York hosting the Bucks and Charlotte hosting the Bulls.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042697.9717078
}