{
  "game_id": "0022000588",
  "espn_id": "401307371",
  "date": "Mar 13, 2021",
  "matchup": "TOR @ CHA",
  "headline": "LaMelo Ball leads Hornets past short-handed Raptors 114-104",
  "body": "CHARLOTTE, N.C. -- — LaMelo Ball had 23 points and nine rebounds, and Charlotte defeated the short-handed Toronto Raptors 114-104 Saturday night in the Hornets' first game with the general public allowed to attend.\n\n\r\n                    Devonte Graham and Terry Rozier each added 17 points for the Hornets, who seemed to feed off having fans — about 3,000 of them — in attendance for the first time in more than a year due to the coronavirus pandemic.\n\n\r\n                    Charlotte jumped out to a 25-4 lead and set a franchise record with 11 3-pointers in the first quarter in building a 44-24 lead. \n\n\r\n                    “There's no question our guys felt that energy before the game,” Hornets coach James Borrego said. “It felt like NBA basketball was back tonight. Our players felt it and they played off it. It’s a credit to the energy our fans brought.”\n\n\r\n                    Ball, who finished 6 of 9 from 3-point range and continued to bolster his NBA rookie of the year resume, said he got excited during pregame warmups seeing and hearing fans.\n\n\r\n                    “It was amazing,\" Ball said. \"Every game with fans is way more fun. The intensity just rises up.”\n\n\r\n                    Kyle Lowry finished with 19 points and eight assists to lead the Raptors, who lost their fourth straight game without Pascal Siakam, Fred Van Vleet, Patrick McCaw, OG Anunoby and Malachi Flynn due to health and safety protocols. Coach Nick Nurse said he believes all five players will miss Sunday's game against the Chicago Bulls as well.\n\n\r\n                    Ball, Rozier and Graham each had three 3s in the opening quarter and combined for 15 in the game. \n\n\r\n                    “They got pretty much everything they wanted (in the first quarter) and it seemed like they weren't missing a 3,” Raptors forward DeAndre' Bembry said.\n\n\r\n                    Ball made one notable highlight reel 3-pointer when he caught a look-ahead pass from P.J. Washington in the corner, did a 360-degree turn to avoid a defender and still knocked down the shot.\n\n\r\n                    “That is just how he plays,” Graham said of Ball. “It doesn’t surprise me.”\n\n\r\n                    Malik Monk added 16 points for the Hornets (19-18), who moved above .500 for the first time since Jan. 11. This is the latest into the season the Hornets have had a winning record since the 2016-17 season.\n\n\r\n                    Charlotte led by 25 entering the fourth quarter and the only question at that point was if they would set a franchise record for 3-pointers. But the Hornets, who played their reserves most of the fourth quarter, made just one 3 in the fourth quarter and finished the game 21 of 49 from beyond the arc.\n\n\r\n                    TIP INS\n\n\r\n                    Raptors: Chris Boucher needed three stitches in his lip after taking a shot during the second half. ... Were outrebounded 51-46.\n\n\r\n                    Hornets: Rozier left the game late in the third quarter with a lower left leg contusion. With the Hornets comfortably ahead, he did not return. ... Were 16 of 30 from 3-point range in the first half. ... Committed a season-high 28 turnovers and 30 assists.\n\n\r\n                    GRAHAM OFF THE BENCH\n\n\r\n                    This was Graham's best game since returning from a knee injury.\n\n\r\n                    “He looked much more comfortable out there and his shot looked much more in rhythm,” Hornets coach James Borrego said. “It’s great to have him back. It’s great for our spirit.\n\n\r\n                    Borrego said he has no worries that Graham — who has been replaced by Ball in the starting lineup — will play well in a reserve role.\n\n\r\n                    “He’s not fighting it, he’s embracing it,” Borrego said. “He feels comfortable in that role. I have no worries that he can handle this role.”\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Visit Bulls on Sunday for the second night of a road back-to-back.\n\n\r\n                    Hornets: Close out a three-game homestand Monday night against the Kings.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996852.774536
}