{
  "game_id": "0022200450",
  "espn_id": "401468605",
  "date": "Dec 18, 2022",
  "matchup": "CHA @ DEN",
  "headline": "Nuggets' Jokic has career-high 27 rebounds in triple-double",
  "body": "DENVER -- — Nikola Jokic had 40 points and a career-high 27 rebounds in yet another triple-double to help the Denver Nuggets beat the Charlotte Hornets 119-115 on Sunday night.\n\n\r\n              Jokic also had 10 assists for his fifth triple-double of the season and 81st overall. He had 20 rebounds in the first half.\n\n\r\n              Wilt Chamberlain is the only other player with at least 40 points, 27 rebounds and 10 assists in an NBA game. He did it four times, the last when he had 53 points, 32 rebounds and 14 assists for Philadelphia on March 18, 1968.\n\n\r\n              Jokic sealed the victory with two free throws with 13 seconds left. Nuggets coach Michael Malone said he didn’t realize the numbers Jokic was putting up during the course of the game, particularly the amount of rebounds. “I didn’t know it was a 40-27-10 nightm but I knew he was having another Nikola Jokic stellar performance, efficient,” Malone said. “And it’s not just about Nikola. It’s about his ability to make every one of his teammates better. Yeah, Nikola is a generational talent.”\n\n\r\n              Jokic’s rebounds supercharged the other aspects of his game, helping the Nuggets get defensive stops and igniting Denver’s transition game with quick outlet passes to teammates off the rebounds. But many of the rebounds also came from just happening to be in the right place at the right time, Jokic said.\n\n\r\n              “To be honest, I think it’s because of our defense and I was just in the right spot to rebound the ball,” Jokic said. “It’s not that I was grabbing for them or whatever, chasing for them. It just happened, you know? I wish it could be every night, to be honest.”\n\n\r\n              Kentavious Caldwell-Pope added 20 points and Aaron Gordon had 19 as the Nuggets sent the Hornets to their eighth consecutive loss.\n\n\r\n              LaMelo Ball had 31 points for Charlotte. Kelly Oubre Jr. added 16 points and Gordon Hayward had 15.\n\n\r\n              Up by three at the half, Denver stretched its lead to 94-80 going into the fourth quarter, fueled by Jokic’s 11-point third period.\n\n\r\n              Charlotte fought back, though, getting to 107-104 on Ball's fadeaway jumper with 3:29 remaining. The Nuggets regained a cushion when Gordon went in for a reverse layup off a feed from Jokic before Jokic put in a hook shot on the Nuggets’ ensuing possession for a 111-104 lead with 1:57 remaining.\n\n\r\n              Jokic completed the triple-double with a pass setting up Bruce Brown’s 3-pointer that gave Denver an eight-point advantage with 1:20 left.\n\n\r\n              But again Charlotte got back within two on a dunk by Washington before Jokic hit a pair of free throws and Charlotte could not get a shot off in the final moments after turning the ball over.\n\n\r\n              SMALL CLUB\n\n\r\n              Others have come close, but not matched the 40-27-10 stat line. Elgin Baylor had 52 points, 25 rebounds and 10 assists on Dec. 13, 1961. DeMarcus Cousins had 44 points, 23 rebounds and 10 assists on Jan. 22, 2018. Kareem Abdul-Jabbar had a 44-point, 20-rebound, 11-assist game on Feb. 26, 1972, and Oscar Robinson finished with 42 points, 21 rebounds and 10 assists in a game on Jan. 9, 1965.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: F Michael Porter missed a 12th straight game with a left heel strain but has made steady progress in his rehabilitation and is nearing a return, coach Michael Malone said. “He’s been doing more and more with the training staff,” Malone said. “Maybe there’s a chance in the next week to 10 days we can try to get him back and work him back into that rotation. We miss Michael Porter. He’s a big part of what we’re trying to do here.” \n\n\r\n              UP NEXT\n\n\r\n              Hornets: Continue six-game trip Monday night at Sacramento.\n\n\r\n              Nuggets: Host Memphis on Tuesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994279.719923
}