{
  "game_id": "0021701054",
  "espn_id": "400975800",
  "date": "Mar 19, 2018",
  "matchup": "MIA vs. DEN",
  "headline": "Stats system crashes in Miami as Heat top Nuggets in 2 OTs",
  "body": "MIAMI -- They broke the stat system. That's how good Miami and Denver were -- even modern technology couldn't keep up with the Heat and Nuggets.\nFor 48 minutes, they went back and forth.\nAnd one overtime wouldn't decide it, either.\nFinally, after three hours, the Heat said enough. James Johnson scored a career-high 31 points, Kelly Olynyk added 30 off the bench and Miami set a franchise single-game scoring record by beating the Nuggets 149-141 in double overtime on Monday night.\n\"There didn't deserve to be a loser,\" Heat coach Erik Spoelstra said. \"Guys probably really enjoyed playing in a game like this.\"\nHis guys did, anyway. Olynyk became the second reserve in Heat history to score 30. Wayne Ellington had 23 points, and the Heat made 20 3-pointers -- second most in franchise history.\nAll that comes with a serious disclaimer. There was no official box score after the game, because the system crashed in the first overtime period and crews were scrambling to determine official numbers long after the final buzzer.\nWhile NBA stat system outages are not all that uncommon, this one seemed more severe than usual, as no official box score had showed up more than two hours after the end of the game.\nWhat mattered most was the score -- one that moved Miami (38-33) into seventh in the Eastern Conference and left the Nuggets two games back of the last Western Conference spot.\n\"They just executed,\" Nuggets forward Paul Millsap said. \"They got some, I think, fluke plays and a little luck and they're at home, you know. Momentum shifted a little bit.\"\nMiami's point total was also an NBA season high. Houston and Oklahoma City each scored 148 in games earlier this season.\nNikola Jokic had 34 points and 14 rebounds for Denver (38-33), while Wilson Chandler added 26 for the Nuggets. Jamal Murray scored 23, and Will Barton finished with 22 for Denver.\n\"There's no stats. The stat machine blew up, I guess,\" Nuggets coach Michael Malone said. \"But the only stat I cared about tonight is that I'm proud of the way we competed, I'm proud of the way we executed, I'm proud of the fact that we gave ourselves a chance.\"\nNeither team was at full strength. For Miami, Dwyane Wade (left hamstring strain) missed his fourth consecutive game, and Hassan Whiteside (left hip pain) sat out his fifth straight contest. Denver was without leading scorer Gary Harris, sidelined again by a strained right knee that could keep him out several more days.\nDenver led 16-5 after 3½ minutes, and that was the only double-digit lead by either side for about the next three hours. It was airtight until the very final moments, almost to an absurd degree.\nAfter one quarter, Denver led by one.\nHalftime, Miami led by one.\nAfter three, Miami still by one.\nAfter regulation, tied.\nAfter one overtime, still tied.\n\"That's as playoffs as it comes,\" Olynyk said.\nBack and forth they went all night, two teams that played a one-point game at Denver back in November -- that one not being decided until Dion Waiters' missed jumper as time expired sealed the Nuggets' win. This one had even more fireworks, with the Heat missing shots at the end of regulation and the first overtime before finding a way in the second OT.\nOlynyk and Johnson had all 13 Miami points in the first overtime.\n\"We didn't exactly want it to be like this,\" said Ellington, who rattled home a 3-pointer to start the second OT and put Miami ahead for good. \"But these are the types of games that show your character.\"\nTIP-INS\nNuggets: Including the franchise's ABA days, all 28 previous Nuggets teams to finish .500 or better made the playoffs. That streak seems in jeopardy now. ... Denver fell to 19-5 in games in which it scores at least 115 points. The Nuggets are now 17-30 when allowing more than 105.\nHeat: It was the highest-scoring first four quarters of an overtime game in Heat history. The previous before-OT high was 115 at Golden State on Dec. 1, 2008. ... The previous scoring record was 141 points, done twice. ... A pregame moment of silence was held for the six victims of last week's bridge collapse near Florida International University.\nNEVER FORGET\nThe Heat continue paying tributes to the 17 victims of the shooting last month at Marjory Stoneman Douglas High in Parkland, Florida. Spoelstra and several players spent their day off Sunday at the Parkland Rec League Basketball Championship, honoring the lives of victims Joaquin Oliver, Luke Hoyer and Alex Schacter by announcing scholarships in their names -- as well as a $500,000 donation.\nROAD TRIP\nThis seven-game trip for the Nuggets is their longest since a seven-gamer in the 2011-12 season. As if a late-season two-week trip wasn't tough enough, Denver's remaining schedule is brutal; after visiting Chicago on Wednesday, the Nuggets will have 10 games left -- all against teams currently in the playoff mix.\nUP NEXT\nNuggets: Visit Chicago on Wednesday.\nHeat: Host New York on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764993523.732748
}