{
  "game_id": "0022300088",
  "espn_id": "401584716",
  "date": "Oct 28, 2023",
  "matchup": "DET vs. CHI",
  "headline": "LaVine's 51 points not enough for Bulls in 118-102 loss to Pistons",
  "body": "DETROIT -- — Jalen Duren had 23 points and 15 rebounds as the Detroit Pistons overcame a career-high 51 points from Zach LaVine to beat the Chicago Bulls 118-102 on Saturday night.\n\n\r\n              “I'm feeling really comfortable in my second season, but that's not because of me,” said Duren, who doesn't turn 20 until Nov. 18. “My teammates and coaches have helped me make the game a lot easier.”\n\n\r\n              LaVine's effort was the first 50-point game of the NBA season and made him the first Bulls player with 50 points and no assists since Michael Jordan did it against the Miami Heat on Nov. 6, 1996.\n\n\r\n              “It’s our third year here together, and we know how this business is,” LaVine said. “We all love each other. DeMar (DeRozan) is one of my best friends, and we talk all the time, but we have to figure out how to make this work.”\n\n\r\n              LaVine had been a game-time decision with back spasms.\n\n\r\n              “You know me,” he said. “I'm going to play.”\n\n\r\n              Cade Cunningham added 25 points and 10 assists for the Pistons, who ended a 15-game losing streak to the Bulls, while Alec Burks added 18 off the bench. \n\n\r\n              “I think Cade and I are just kind of a match,” Duren said. “He's got a high IQ and I've got a high IQ and we know the type of players we are. When he's got the ball in his hands, good things are going to happen. So I'm trying to get the ball to him.”\n\n\r\n              Rookie Ausar Thompson had nine points, 12 rebounds and five assists in Detroit's home opener. He also helped hold LaVine to two points in the final eight minutes.\n\n\r\n              “It's hard to explain all the ways he makes winning plays on the floor,” Pistons coach Monty Williams said. “He had a track-down steal on LaVine that most players can't do, and he's blocking jump shots by guys that most defenders can't even close out. He's doing that and he's just getting started.” \n\n\r\n              DeRozan scored 20 for the Bulls, but Nikola Vucevic with 12 was the only other Bull to reach double figures.\n\n\r\n              LaVine, who shot 19 of 32, scored 20 points in the third quarter, giving him 39 in the game, but Jaden Ivey's 3-pointer at the buzzer gave the Pistons an 84-77 lead.\n\n\r\n              Cunningham started the fourth with a three-point play and Burks followed with a 3-pointer to make it a 13-point game. LaVine scored 10 points to help the Bulls get within 95-89 with 8:33 to play. \n\n\r\n              LaVine, though, didn't get enough offensive help and the Bulls couldn't put together enough stops. Two free throws by Cunningham made it 109-97 with 2:30 to play, and the Pistons held on for the victory.\n\n\r\n              The Pistons shot 60.5% from the floor while building a 57-45 lead. LaVine had 19 points in the first quarter, but didn't score in the second. Detroit had a 25-12 edge in bench points, with Burks and Marvin Bagley III getting nine each.\n\n\r\n              Duren's double-double was the 22nd of his career, breaking a tie with LeBron James for the third most by a teenager in NBA/ABA history. Moses Malone had 50 and Dwight Howard finished with 46.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Visit the Indiana Pacers on Monday.\n\n\r\n              Pistons: Visit the Oklahoma City Thunder on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995802.290169
}