{
  "game_id": "0022000732",
  "espn_id": "401307523",
  "date": "Apr 01, 2021",
  "matchup": "CHA @ BKN",
  "headline": "Nets get strong debut from Aldridge, rout Hornets 111-89",
  "body": "NEW YORK -- — LaMarcus Aldridge made his Nets debut and found playing in the post to be a breeze on a team so potent from the perimeter. \n\n\r\n                    “It was easy for me, so I had fun tonight for sure,” Aldridge said.\n\n\r\n                    Easy for the whole team, actually.\n\n\r\n                    Jeff Green outscored Charlotte by himself in Brooklyn's overpowering first quarter before finishing with 21 points, and the Nets got a strong first outing from Aldridge in a 111-89 rout of the Hornets on Thursday night.\n\n\r\n                    Aldridge started at center and had 11 points, nine rebounds and six assists, looking like a good fit for a Nets team that won for the 20th time in its last 23 games. They signed him last month after he reached a buyout agreement with San Antonio.\n\n\r\n                    With All-Stars Kevin Durant and James Harden sitting out with hamstring injuries, the Nets led 32-11 after one quarter behind 12 points from Green. A night earlier, they had to climb out of a 24-6 hole against Houston.\n\n\r\n                    “Tonight we did just what we expected to do coming out of the gate,” Green said. “We got stops and defense turned into offense and that’s how we were able to get rolling.”\n\n\r\n                    The Nets made 20 3-pointers and put six players in double figures in their season-best seventh straight home win.\n\n\r\n                    Landry Shamet scored 17 points in his return from a five-game absence with a sprained right ankle and Kyrie Irving had 15 points, 11 rebounds and eight assists.\n\n\r\n                    Gordon Hayward and Devonte Graham each scored 13 points for Charlotte. Terry Rozier had 12.\n\n\r\n                    A game televised nationally on TNT was already watered down by the absences of some of its biggest stars, with Harden and Durant sidelined in Brooklyn and Hornets rookie LaMelo Ball lost to a broken right wrist.\n\n\r\n                    Those who still watched didn't have reason to do so for long, \n\n\r\n                    Charlotte missed 19 of its 23 shots in the first quarter. The Nets then began featuring Aldridge, who had seven points and assisted on the other basket in a 10-2 spurt that pushed the lead to 47-18 in the second quarter. \n\n\r\n                    Brooklyn led by 32 in the third quarter, when Charlotte had another miserable period with only 17 points.\n\n\r\n                    “I mean, we just could not find any offensive rhythm,” Hornets coach James Borrego said. “It was a rough night on that end of the floor.”\n\n\r\n                    Harden left the Nets' victory over Houston on Wednesday with right hamstring tightness. Coach Steve Nash said Harden was day to day and should return within the next few games, but Durant's absence will last at least into next week. He's been out since mid-February with a strained left hamstring.\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Malik Monk returned after a two-game absence with a sore right foot but had to be helped off the floor in the fourth quarter with what Borrego said was a sprained right ankle. He scored 11 points.\n\n\r\n                    Nets: Brooklyn rested Blake Griffin on the second night of the back-to-back. ... With Aldridge starting, DeAndre Jordan, the Nets' starting center in 36 of their first 48 games, didn't play.\n\n\r\n                    DURANT UPDATE\n\n\r\n                    Durant spoke before the game and said he isn't in much pain and is looking forward to rejoining his teammates soon. He also apologized for profane language he used in private messages to Michael Rapaport that the actor shared on Twitter this week.\n\n\r\n                    MEN OF THE MONTH\n\n\r\n                    Harden was voted Eastern Conference player of the month for March after also winning the award in February. He is the first player to win player of the month honors in both of his first two full months with a new team since the award’s inception in 1979-80.\n\n\r\n                    Ball won the Eastern Conference rookie of the month despite playing in just eight games. It was the third consecutive monthly win for the guard.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Visit Indiana on Friday.\n\n\r\n                    Nets: Visit Chicago on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997357.792864
}