{
  "game_id": "0021600607",
  "espn_id": "400900028",
  "date": "Jan 15, 2017",
  "matchup": "MIL @ ATL",
  "headline": "Bazemore, Dunleavy pick up offense, Hawks beat Bucks",
  "body": "ATLANTA --  Now with his third team in two seasons, Mike Dunleavy thinks he's found a good fit with the Atlanta Hawks.\n\nThe 36-year-old Dunleavy was disappointed to get traded last week from Cleveland, the best team in the Eastern Conference, but Atlanta could offer him a bigger role.\n\n\"At this point in my career, the biggest thing is to win, and that hasn't changed from the last team I was on to this team,\" he said. \"I'm just glad we're in a good spot, No. 4 in the East with a chance to get home court in the playoffs.\"\n\nKent Bazemore scored 24 points, Dunleavy added 20 and the Hawks beat the Milwaukee Bucks 111-98 on Sunday.\n\nMilwaukee's Giannis Antetokounmpo had 33 points and was a tough matchup in the paint. He has scored at least 30 points in eight games in a breakout season, but had bigger concerns after the game.\n\n\"We cannot let Dunleavy come off the bench and have 20,\" Antetokounmpo said. \"We didn't defend the 3-point line well. That's basically it.\"\n\nAtlanta has won eight of nine. The Bucks have dropped three of five. They fell 2 1/2 games behind the fourth-place Hawks in the Eastern Conference.\n\nDunleavy had his first 20-point performance since a first-round playoff game for Chicago on April 30, 2015. Acquired in a deal that sent Hawks fan favorite Kyle Korver to Cleveland, Dunleavy debuted for Atlanta in Friday's two-point home loss to Boston.\n\n\"You share the ball, a lot of equal opportunity,\" Dunleavy said. \"You can play off a lot of stuff. If you can cut, you can pass, you can screen, you shoot, it's a great system to be in.\"\n\nMilwaukee led 20-9 with 6 minutes left in the first quarter. Atlanta went up 50-40 with 6 minutes left in the second.\n\nThe Bucks tied it at 60 when Antetokounmpo tipped in his own miss early in the third, but they never led in the second half. Coach Jason Kidd called a timeout with Milwaukee down by eight with 2:18 left in the game, only to watch his team have a turnover, a foul and three missed jumpers as Atlanta went up 111-96 on Bazemore's 3 in the final minute.\n\nHONORING DR. KING\n\nTo begin their Forever MLK celebration day, the Hawks had Howard, an Atlanta native, speak briefly to the crowd before tipoff. \"Love conquers hate,\" Howard said in acknowledgment of Martin Luther King Jr.'s birthday on Monday. The Hawks had several video tributes to King, the slain civil rights icon who made Atlanta his home, all afternoon. A local choir performed at halftime.\n\nRISING STAR\n\nAntetokounmpo's strong start to the season has impressed Hawks coach Mike Budenholzer. The 6-foot-11, 222-pound forward is the only current NBA player averaging at least 20 points, nine rebounds, five assists, two blocks and 1.5 steals -- all career highs in his four-year career. \"It seems like he's worthy of all the praise he's getting, all the attention he's getting,\" Budenholzer said before adding with a smile, \"I wish he was back in Greece playing.\"\n\nVETERAN VOICE\n\nReserve guard Jason Terry, in his first season with Milwaukee and 18th overall, wants his young teammates to do a better job of following instructions from Kidd, who played 19 seasons and was a 10-time All-Star.\n\n\"At some point we're going to have to understand that what he's telling us is going to come to fruition,\" Terry said. \"Are we going to be ready to execute the game plan? We did not do that tonight, as you see from the results.\"\n\nTIP-INS\n\nBucks: Jabari Parker finished with 10 rebounds, nine assists and eight points. ... Malcolm Brogdon has scored at least 10 points in nine straight games. The rookie guard, an Atlanta native who starred at Virginia, had eight straight with at least five assists, but dished out none against the Hawks. ... The Bucks hit six 3-pointers. Atlanta hit 13. ... Gave up 32 points on 17 turnovers.\n\nHawks: Reserve F Mike Muscala hurt his left ankle in the first quarter and spent the rest of the game with trainers in the locker room. ... Muscala's injury gave 23 minutes to Dunleavy, who had 12 points and three rebounds in his first 12 minutes. ...  Atlanta improved to 18-4 when leading after the third.\n\nUP NEXT\n\nBucks: Host Philadelphia on Monday.\n\nHawks: At New York on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995187.350546
}