{
  "game_id": "0021801072",
  "espn_id": "401071745",
  "date": "Mar 20, 2019",
  "matchup": "TOR @ OKC",
  "headline": "Siakam has 33 and 13 as Raptors hold off Thunder in OT",
  "body": "OKLAHOMA CITY --  Forced to play overtime after blowing a 20-point second-half lead, the Toronto Raptors found their groove again in the extra period.\n\nPascal Siakam had 33 points and 13 rebounds, Fred VanVleet added 23 points and six assists and the Raptors won the first of two games in three days against Oklahoma City, outscoring the Thunder 13-4 in OT to pull out a 123-114 win Wednesday night.\n\nAtlantic Division-leading Toronto snapped a four-game losing streak against Oklahoma City despite the absence of starting guard Kyle Lowry, who sat out with a sprained right ankle sustained Monday in a win over the New York Knicks.\n\nThe Raptors did so with balanced scoring, good ball movement -- four players had six assists -- and strong shooting, making 51.7 percent overall and 38.9 percent from 3-point range (14 of 36). Kawhi Leonard added 22 points and 10 rebounds, while Danny Green scored 17.\n\n\"A lot of times when you blow a lead and go to overtime, the momentum goes to the team that gets it to overtime and you come out flat,\" Toronto coach Nick Nurse said. \"But we didn't. We came out and really played, really played, especially at the defensive end, which is a great sign.\"\n\nIn his return from a one-game suspension for accumulating too many technical fouls, Russell Westbrook had 42 points, 11 rebounds and six assists for Oklahoma City, which has lost four straight games and 10 of 14. The Thunder entered sixth in the Western Conference but just a half-game out of eighth place.\n\n\"I knew it was close,\" Oklahoma City's Paul George said. \"If we win (we know) where we're at and if we lose we know where we're at going into the game. We control our destiny.\"\n\nToronto led 78-58 in the third quarter but the Thunder steadily chipped away and pulled to 110-108 on a 3-pointer by George with 39.9 seconds left in regulation. He fouled out with 19.9 seconds to go while scrambling for a rebound after a missed shot by VanVleet, but another miss by VanVleet led to a driving layup by Westbrook with 4.8 seconds left to tie it.\n\nIn overtime, the Thunder missed their first seven shots, allowing Toronto to pull away again. A driving layup by VanVleet with 58.4 seconds left and a three-point play by Leonard with 35.5 seconds left gave the Raptors a 119-110 lead.\n\n\"As we get closer to the end (of the season) here, where it's less about foundational principles and more about getting locked in and playoff-type defensive packages and coverages, tonight you saw that a little bit,\" VanVleet said. \"Things are getting a little more detailed and guys are revving it up a little bit more.\"\n\nGeorge scored 19 points for Oklahoma City, which made 13 of 43 3-point attempts (30.2 percent) and 15 of 29 free throws (51.7 percent).\n\n\"We've just got to get off to a better start,\" George said. \"That's it. A better start. We close out well. We just put ourselves behind a lot of times. Just a better start.\"\n\nNICK AT NIGHT\n\nThe Thunder retired Nick Collison's No. 4 jersey in a pregame ceremony, the first time the franchise has so honored a player since its move to Oklahoma City in 2008. The Seattle SuperSonics drafted Collison out of Kansas in 2003 and he spent his entire 15-year career with the club.\n\nCollison averaged only 5.9 points and 5.2 rebounds per game for Seattle/Oklahoma City, but played a key role in developing the franchise's Oklahoma City culture and became known as \"Mr. Thunder.\"\n\nMayor David Holt declared Wednesday to be \"Nick Collison Day\" in Oklahoma City.\n\n\"I could never have expected something like this,\" Collison said. \"But it's really a special night for me and my family. It's been a long run. To be able to have the career I had here and then have a celebration like that, I feel very fortunate. That kind of goes without saying, but it's amazing for me. It's a good feeling coming back. I don't know how to feel for something like this. It's like nothing can prepare you for it.\"\n\nAmong his former Thunder teammates who attended the ceremony were Kevin Durant of Golden State and Serge Ibaka of the Raptors. Neither was mentioned in Collison's pregame speech, but Westbrook was.\n\n\"I used to play with Nick,\" Ibaka said. \"He was one of the guys who really helped me in my first year in the league, when I was 19. Playing tonight, the same day they're going to retire his jersey, it's really special.\"\n\nTIP-INS\n\nRaptors: Nurse didn't seem too concerned about Lowry's injury: \"He's just sore. Nothing serious. They've checked it every way it can be checked.\" VanVleet started in Lowry's place. ... Siakam's double-double was his 16th of the season. . Toronto's 21 wins against Western Conference foes this season are a franchise record.\n\nThunder: Consecutive games against an opponent aren't new to the Thunder. OKC played at Dallas on Dec. 30 and hosted the Mavericks on Dec. 31. ... Backup C Nerlens Noel returned after missing one game with a bruised left quad.\n\nUP NEXT\n\nRaptors: Host the Thunder on Friday.\n\nThunder: Visit the Raptors on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994249.3031511
}