{
  "game_id": "0021800302",
  "espn_id": "401070983",
  "date": "Nov 27, 2018",
  "matchup": "MIA vs. ATL",
  "headline": "Hawks hold on, top Heat 115-113 to snap 7-game road slide",
  "body": "MIAMI --  Josh Richardson took the last pass from Dwyane Wade, then wound up taking a wide-open 3-pointer that would have been a game-winner.\n\nLike everything else this season for Miami, the last shot didn't go according to plan.\n\nRichardson's shot bounced off the front of the rim with less than 2 seconds remaining, time ran out on the Heat and the Atlanta Hawks -- who wasted every bit of a 19-point, second-half lead -- escaped from Miami with a 115-113 win on Tuesday night.\n\n\"Just kind of went our way,\" Hawks coach Lloyd Pierce said after his team snapped a seven-game road slide. \"But we'll take it.\"\n\nTaurean Prince scored 18 points, Trae Young finished with 17 points and 10 assists, and John Collins added 16 points for the Hawks. Atlanta is 2-0 against Miami this season, and 3-16 against everyone else.\n\nRichardson led Miami with 22 points. Wade scored 18 and Wayne Ellington added 15 for the Heat, who have lost six straight at home. It's only the 10th time in the 31 years of Heat basketball that Miami has lost so many consecutive games at home.\n\n\"Right now, we're between the hammer and the anvil,\" Heat coach Erik Spoelstra said. \"This is the NBA. If you expect it just to be easy, you've been led down the wrong road. This is not what we would like but this is when you start to develop some character.\"\n\nBam Adebayo scored 12 for Miami, which got 11 apiece from Justise Winslow and Hassan Whiteside.\n\nAtlanta led by 19 early in the second half and was still up by 13 with 8:50 left, before Miami went on a 14-0 run to grab the lead -- a spurt where Richardson scored seven of those points, including a follow shot with 5:04 left to cap the flurry. Atlanta answered with a 7-0 run, and Miami then scored five straight to get back within one.\n\nPrince made the second of two free throws with 14 seconds left, giving Atlanta a 115-113 lead. Miami took its final timeout, set up a play with no fewer than four options -- Atlanta took away the first three -- and Wade passed up what would have been a contested jumper to send the ball to Richardson for the wide-open look.\n\n\"I think it ended the right way,\" Young said.\n\nMiami scored a season-high 38 points in the first quarter, and followed that with a 14-point clunkfest in the second as the Hawks took control.\n\nAtlanta outscored Miami by 19 points in the second quarter. A 3-pointer by Kent Bazemore beat the halftime buzzer and Atlanta went into the break with its biggest halftime lead of the season, 68-52.\n\nThat quarter was far more damning than Richardson's miss at the end.\n\n\"We had one of those lulls ... and it cost us the game,\" Richardson said.\n\nTIP-INS\n\nHawks: Vince Carter, who went through shootaround in the morning and warmed up pregame -- with a 360-degree dunk as part of that warmup -- didn't play. He's been held out of the last two Hawks games. ... Young connected on a 33-footer in the third quarter, which has sort of become his thing. He's got 10 makes from 30 feet or deeper already this season.\n\nHeat: For the first time in team history, Miami allowed 100 points through three quarters in back-to-back games. The Heat trailed Toronto 101-89 after three on Sunday, and were down 100-86 going into the fourth against the Hawks. ... Whiteside was 1 for 7 from the foul line, and the Heat had 20 turnovers turned into 26 Atlanta points.\n\nINJURY WATCH\n\nMiami was again without All-Star point guard Goran Dragic (right knee) and guard Tyler Johnson (right hamstring). Atlanta was missing guard Tyler Dorsey (left ankle), though he could rejoin the club in Charlotte on Wednesday. Kevin Huerter started for Atlanta for the fourth time this season, after dealing with an aching back throughout the day.\n\nWADE TRIBUTE\n\nTuesday was the 11th anniversary of a dark day in Miami sports history, the slaying of University of Miami and Washington Redskins star Sean Taylor. Wade paid tribute to Taylor on his game sneakers, scrawling \"RIP Sean Taylor\" on them.\n\nUP NEXT\n\nHawks: Visit Charlotte on Wednesday.\n\nHeat: Host New Orleans on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995260.731518
}