{
  "game_id": "0021800835",
  "espn_id": "401071508",
  "date": "Feb 10, 2019",
  "matchup": "PHI vs. LAL",
  "headline": "Embiid leads Sixers past LeBron-led Lakers, 143-120",
  "body": "PHILADELPHIA -- Magic Johnson and LeBron James have captured eight NBA titles between them. With Johnson in the stands and James on the court, the Philadelphia 76ers showed off their own championship potential.\nJoel Embiid had 37 points and 14 rebounds, Tobias Harris scored 22 points in his second game with Philadelphia, and the new-look 76ers beat James and the Los Angeles Lakers 143-120 on Sunday.\nJJ Redick added 21 points for the Sixers, who have won two straight after acquiring Harris and four others at Thursday's trade deadline. Jimmy Butler finished with 15 points in front of a packed Philly crowd that brought a playoff-like feel to the nationally televised game.\n\"The East better watch out,\" said Johnson, the Lakers president who made the trip to Philly for the game. \"This is a stacked team.\"\nKyle Kuzma led the Lakers with 39 points while James had 18 points, 10 rebounds and nine assists.\nJames was facing Philadelphia for the first time since the Sixers made a big push to sign the superstar as a free agent last summer. He and Kuzma both missed the last matchup with Philly on Jan. 29, which the Sixers won 121-105.\n\"I thought they were going to be very good anyway before they made any moves, before the season even started,\" James said. \"And they've made a bunch of moves to improve their club.\"\nFresh off a buzzer-beating win at Boston, the Lakers shot nearly 60 percent and scored 40 points in the first quarter. But fueled by Redick's four-point play, the Sixers closed the first half on a 19-6 run to take a 76-67 lead into halftime.\nEmbiid, who was questionable to play because of gastroenteritis, led the charge with 25 points in the first half after lighting up the Lakers for 28 in the teams' first matchup.\n\"I must not be a big LA fan,\" said Embiid, who had his league-leading 23rd game with at least 30 points and 10 rebounds. \"It's fun. I've been more consistent against both LA teams.\"\nPhiladelphia's lead ballooned to 109-94 at the end of the third quarter after T.J. McConnell's 3-pointer in the closing seconds. The Sixers ran away with the game from there while gleeful fans chanted \"Kobe's better\" at James.\n\"We had too many breakdowns,\" James said. \"Way too many breakdowns.\"\nTIP-INS\nLakers: Johnson said before the game that he didn't believe the New Orleans Pelicans engaged in good-faith negotiations at the trade deadline during the Lakers' pursuit of Anthony Davis. Johnson added that the LA players who were on the trade block are professionals who are capable of moving forward. \"This is how this league works,\" he said. \"They know it. I know it.\" ... Mike Muscala, one of two players the Lakers acquired at the deadline, had eight points in 13 minutes against the team he spent the first half of the season with before being dealt. ... Coach Luke Walton said Josh Hart was available after dealing with knee tendinitis, but the former Villanova star did not get into the game.\n76ers: Eagles quarterback Carson Wentz, film director M. Night Shyamalan, New England Patriots owner Bob Kraft and Los Angeles Angels outfielder Mike Trout were in attendance. So was new Philadelphia Union midfielder and Mexican national team star Marco Fabian, who swapped jerseys with fellow Philly newcomer Harris after the game. ... The Sixers scored at least 33 points in each quarter -- the first time the team has done so since 1986. ... Philly finished with 33 assists and seven turnovers.\nSIMMONS BELIEVES IN MAGIC\nJohnson revealed that Simmons has reached out to the Lakers about working out with him this summer to learn more about playing the \"position as a big guard.\" Pending league approval, Johnson noted he'd be happy to accommodate such a wish.\n\"I love his game,\" Johnson said. \"I love his vision.\"\nSaid Simmons: \"Trying to learn from somebody like that would be huge.\"\nSIMMONS FOR 3?!?\nPerhaps the most surprising part of the game came one minute into the second half when Simmons attempted just his third 3-pointer of the season -- and the first that wasn't an end-of-clock heave.\n\"I wasn't shocked by it,\" Redick said, before Embiid turned to him and replied, \"You sure?\"\nThe shot rimmed out as much of the crowd gasped. Simmons has never made a 3 in his two seasons in the NBA, but believes he'll have more opportunities to expand his game with Harris joining a star-studded starting lineup alongside him, Redick, Butler and Embiid.\n\"With this new five I think it's going to be exciting in terms of what we can do,\" Simmons said. \"I'm just trying to take what they give me.\"\nUP NEXT\nLakers: Complete their six-game trip at the Atlanta Hawks on Tuesday night.\n76ers: Host the Boston Celtics on Tuesday night.\n---\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994017.2025049
}