{
  "game_id": "0021900729",
  "espn_id": "401161371",
  "date": "Feb 01, 2020",
  "matchup": "MIA @ ORL",
  "headline": "Butler, Herro lead Heat past Magic, 102-89",
  "body": "ORLANDO, Fla. --  Miami got 24 points from Jimmy Butler and a big boost from rookie Tyler Herro on Saturday night. But it was a big game from center Meyers Leonard that put the Heat over the top in a 102-89 victory over the Orlando Magic.\n\n\"Tonight it just happened to be a night where the ball was finding my energy on both ends of the floor, I guess,\" said Leonard, who had 18 points and 14 rebounds before going to the bench with five fouls with 5:49 left in the game.\n\nHerro came off the bench with six 3-pointers and 23 points. Herro and Leonard combined for 10-of-19 shooting from 3-point range to help the Heat beat Orlando for the second time this week and stretch their lead in the Southeast Division to 12 1/2 games.\n\n\"Everyone in the locker room wants Meyers to be more aggressive,\" said Miami coach Erik Spoelstra. \"He really worked on it the last couple of days in practice, letting it fly, almost past his comfort zone. I'm talking about shooting it every time he touched it.\"\n\nThe 7-foot Leonard took 14 shots in 29 minutes.\n\n\"When he's making shots, you've got to step out to him,\" Butler said. \"Then he can put the ball on the floor and go around you and that gets everybody else involved. We've got so many guys who can do different things. You've got to pick your poison. Any given night it's going to be somebody.\"\n\nAaron Gordon scored 24 for the Magic, who lost their fifth straight. Nikola Vucevic added 21 points and nine rebounds.\n\nThe Magic shot 39.8%. It was the fourth straight game in which they shot 40 percent or worse.\n\n\"Watching the last four games, we're getting good shots,\" said coach Steve Clifford. \"The big part of it is you've got to step up and make shots. To win and be good, what is more important than shot making?\"\n\nMiami led 57-49 at halftime despite a big first half by Gordon, who was 4 of 6 on 3s and scored 16 points.\n\nHerro, bumped out of the starting lineup by the return of fellow rookie Kendrick Nunn, hit three 3-pointers and scored 12 points in the first half.\n\nBack-to-back 3-pointers by Leonard stretched Miami's lead to double digits early in the second half, and the Heat led 73-60 when Butler converted a three-point play late in the third quarter.\n\nAfter the Magic closed the gap to six early in the fourth, Herro hit two more 3-pointers for an 86-74 lead, and the Magic never threatened again.\n\nTIP-INS\n\nHeat: Nunn was back in the starting lineup after missing three games with an Achilles tendon injury. ... F Bam Adebayo, who had 20 points in Monday's victory over the Magic, scored four points Saturday but had 14 rebounds. ... F Justise Winslow missed an 11th straight game with a lower back bruise. ... The Heat lead the all-time intrastate series 67-55.\n\nMagic: The Magic were coming off a four-day break. ... G D.J. Augustin missed a ninth game with a left knee bone irritation.\n\nPULLING EVEN ON THE ROAD\n\nThe Heat are 12-12 on the road this season and 31-31 all-time in Orlando.\n\n\"We're trying to get to another level on the road, playing more consistently,\" Spoelstra said. \"We want to get a little confidence and feel good about how we can win games when we're not in our arena.\"\n\nUP NEXT\n\nHeat: Play at home against Philadelphia on Monday night.\n\nMagic: Play at Charlotte on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995502.257407
}