{
  "game_id": "0022400574",
  "espn_id": "401705140",
  "date": "Jan 16, 2025",
  "matchup": "OKC vs. CLE",
  "headline": "Gilgeous-Alexander scores 40 as Thunder roll past Cavaliers 134-114 in matchup of NBA leaders",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had 40 points and eight assists in three quarters, and the Oklahoma City Thunder rolled past the Cleveland Cavaliers 134-114 on Thursday night in a matchup of teams with the best records in the NBA.\n\n\r\n              The Western Conference-leading Thunder and the East-leading Cavaliers now have matching 34-6 records. The Cavaliers won the first meeting 129-122 on Jan. 8. In the rematch, the Thunder handed the Cavaliers their worst loss of the season.\n\n\r\n              Lu Dort scored a season-high 22 points and Jalen Williams added 19 for Oklahoma City, which won its fourth straight.\n\n\r\n              Darius Garland had 20 points and nine assists for Cleveland, and Jarrett Allen added 13 points. Donovan Mitchell, Cleveland’s top scorer, was held to eight points on 3-for-15 shooting.\n\n\r\n              The Cavaliers led 12-10 before Oklahoma City took over. The Thunder closed the first quarter on a 22-2 run to take a 32-14 lead. Gilgeous-Alexander scored 15 points in the opening period. \n\n\r\n              Gilgeous-Alexander scored 11 points in a three-minute stretch late in the first half to help the Thunder take a 75-49 lead at the break. \n\n\r\n              The Thunder matched a season high for points in a quarter with 44 in the third to take a 119-81 lead.\n\n\r\n              Takeaways\r\n              Cavaliers: The Cavaliers, one of the best defensive teams in the league, had no answers in this one. Oklahoma City shot 60.3% in the first three quarters.\n\n\r\n              Thunder: Oklahoma City continued to find ways to win with key players out. Center Isaiah Hartenstein, the team's leading rebounder, missed the game with a strained his left calf. The Thunder held their own on the boards and dominated nearly everything else.\n\n\r\n              Key moment\r\n              Oklahoma City went on a 30-2 run from the first quarter into the early part of the second that opened up the game. \n\n\r\n              Key stat\r\n              Oklahoma City committed just six turnovers to Cleveland's 21.\n\n\r\n              Up Next\r\n              The Thunder visit Dallas on Friday. The Cavaliers are at Minnesota on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997509.454407
}