{
  "game_id": "0022201156",
  "espn_id": "401469311",
  "date": "Mar 31, 2023",
  "matchup": "MEM vs. LAC",
  "headline": "Bane, Kennard help Grizzlies rally to beat Clippers 108-94",
  "body": "MEMPHIS, Tenn. -- — Desmond Bane scored 22 points and Luke Kennard had 17 as the Memphis Grizzlies overcame a 20-point first-half deficit and beat the Los Angeles Clippers 108-94 on Friday night.\n\n\r\n              Kennard keyed a second-quarter rally with four 3-pointers and finished the game with five against his former team. Kennard was traded to Memphis on Feb. 9 as part of a three-team deal.\n\n\r\n              The Grizzlies eventually built a 22-point lead early in the fourth quarter following Bane's steal under the Clippers’ basket and a driving layup. \n\n\r\n              Memphis coach Taylor Jenkins said the key to the team’s comeback was the ability to make a 7-0 run during the final minutes of the opening quarter.\n\n\r\n              “We got a little spark there,” Jenkins said. “I just started telling the guys we’re starting to feel the pace (better) and the physicality and urgency that we need ... if we hadn’t had that spark at the end of the first quarter to cut it to 13, it may have been a difference outcome.”\n\n\r\n              Norman Powell scored 16 points to lead the Clippers, Ivica Zubac had 15 points and 15 rebounds, and Eric Gordon finished with 13 points.\n\n\r\n              “We knew they were going to make a run, we just didn’t know it was going to be that fast,” Clippers coach Tyronn Lue said. “We put ourselves in good position (to win), we just didn’t do a good job finishing the game, taking care of the basketball, taking good shots and getting defensive stops.”\n\n\r\n              Memphis and Los Angeles were playing for the second time in three days in Memphis. The Clippers won 141-132 on Wednesday to snap the Grizzlies’ 12-game home win streak. Russell Westbrook had 36 points in the Clippers' victory but was held to just four points and a game-high 11 assists in this one.\n\n\r\n              In Wednesday’s loss, the Grizzlies played without starters Jaren Jackson Jr. and Bane, along with key reserves Tyus Jones and John Konchar. All were out with various ailments.\n\n\r\n              Kawhi Leonard missed Wednesday’s game for the Clippers and returned Friday to play 18 minutes. He scored 12 points.\n\n\r\n              After taking their first lead midway through the second quarter on Jones’ floater to go up 40-38, the Grizzlies never trailed again.\n\n\r\n              The Grizzles started slowly and fell behind 34-14 late in the first quarter. Memphis was hampered by eight first-quarter turnovers.\n\n\r\n              However, the Grizzlies recovered behind Kennard's 3-point shooting in the second quarter during a 24-4 run to tie the score at 38-all. Memphis eventually built a 52-45 lead late in the quarter and led 55-51 at the half.\n\n\r\n              “We just chipped away a little at a time with the group that came in (during) the second quarter,” Kennard said. “We really locked in, played really good defense, started moving the ball really well and got out in transition, which was a big key for us.” Kennard had 14 first-half points for the Grizzlies, who followed a sloppy first quarter by committing only one turnover in the second. \n\n\r\n              Ja Morant struggled in the first half and had only 3 points at the break. He finished with 10 points in 26 minutes.\n\n\r\n              “Our bench came in and stepped up big-time for us,” Morant said. “It was something we needed after a loss (to the Clippers on Wednesday “We have all the confidence in the world (Kennard) can knock down his shots. He could shoot (with the Clippers) and he can shoot now. But now he’s on our side.”\n\n\r\n              TIP-INS\n\n\r\n              Clippers: The Clippers were held to fewer than 100 points for only the third time in their past 38 games. ... Since Jan. 6, the Clippers are sixth in the NBA in offensive rating (118.6) and first in 3-point percentage (39.8). \n\n\r\n              Grizzlies: Kenneth Lofton Jr. was named NBA G-League Rookie of the Year on Friday. He averaged 20.2 points, 10.5 rebounds and 3.9 assists in 17 appearances for Memphis. ... Jackson broke his single-season franchise record of 177 blocks Friday with a third-quarter block of Norman Powell. Jackson entered the game averaging 3.05 blocks per game, which leads the NBA. \n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host New Orleans on Saturday.\n\n\r\n              Grizzlies: Host Chicago on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994163.356768
}