{
  "game_id": "0021600175",
  "espn_id": "400899625",
  "date": "Nov 18, 2016",
  "matchup": "DET @ CLE",
  "headline": "Irving, James lead Cavaliers over Pistons 104-81",
  "body": "CLEVELAND --  Kyrie Irving had a big game. LeBron James returned to the court. And the Cleveland Cavaliers put it all together Friday night.\n\nIrving scored 25 points and James, returning to the lineup after sitting out a game, added 21 to help the Cavaliers rolled past the Detroit Pistons 104-81.\n\n\"Offensively and defensively it was the best we've played all year, as far as close to 48 minutes,\" said James, who rested Wednesday night in a loss at Indiana.\n\nJames, made 9 of 14 shots and played only 28 minutes. Irving was 11 of 15 from the field with 11 assists --  one short of his career high -- in 29 minutes.\n\nFollowing a slow start that saw Cleveland coach Tyronn Lue call a timeout less than 2 minutes into the game after the Pistons hit a pair of wide-open 3-pointers.\n\nLue only smiled when asked for specifics about what he told the players, but he was clearly unhappy.\n\n\"He didn't like our effort to start the game,\" James said. \"We got the message and we were able to change it around.\"\n\n\"He didn't need to tell us much,\" Irving said. \"We all understood.\"\n\nCleveland led by 11 at the end of the first quarter, took a 56-39 lead into halftime and continued to dominate. The Cavaliers built the lead to 33 points in the fourth quarter, allowing Lue to rest his starters for the entire final period. The defending NBA champions don't play again until Wednesday night.\n\nJ.R. Smith, who returned after missing three games with a sprained right ankle, hit three 3-pointers and moved past the Mavericks' Dirk Nowitzki into 15th place on the NBA's career list for 3s.\n\nDetroit coach Stan Van Gundy, who was unhappy with his team's defense and rebounding in Wednesday's loss to New York, benched his starters for the fourth quarter.\n\n\"There is no takeaway from tonight, we got crushed,\" Van Gundy said. \"We were just awful.\"\n\nCleveland was 11 of 25 on 3-pointers and has reached double figures in all 12 games, an NBA record to start the season.\n\nKevin Love scored 12 points and had 14 rebounds, and Tristan Thompson also had 14 rebounds.\n\nLue's early timeout paid off when Smith hit three 3-pointers, and James and Tristan Thompson scored on dunks.\n\nJon Leuer led Detroit with 15 points. The Pistons' starting five of Tobias Harris, Marcus Morris, Andre Drummond, Kentavious Caldwell-Pope and Ish Smith combined for only 37 points.\n\n\"Their guys all played really, really hard,\" Van Gundy said. \"We need to find people that play that hard.\"\n\nTIP-INS\n\nPistons: Harris was hit with a technical foul in the second quarter. ... Van Gundy plans on sticking with a nine-man rotation until his team is at full strength. G Reggie Jackson is still rehabbing from surgery on his left knee and hasn't played this season.\n\nCavaliers: James had three assists and is four away from passing Guy Rodgers for 17th on the career list. .... Cleveland blocked eight shots, including four by Thompson. .... G Mike Dunleavy, who didn't play against Indiana, entered the game in the second quarter. He scored five points.\n\nTAKE A BREAK\n\nThe Cavaliers won't practice the next two days, which will provide a much-welcome rest.\n\n\"I can't remember when I had it like this in a season,\" James said. \"We're going to take full advantage of it.\"\n\n\"It's very important for our team,\" Lue said. \"Guys should feel refreshed and healthy.\"\n\nUP NEXT\n\nPistons: Host Celtics on Saturday night. Detroit is 5-0 at The Palace of Auburn Hills this season.\n\nCavaliers: Host Trail Blazers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764996081.733616
}