{
  "game_id": "0022400206",
  "espn_id": "401704772",
  "date": "Nov 10, 2024",
  "matchup": "MIN vs. MIA",
  "headline": "Heat edge Timberwolves 95-94 on Nikola Jovic's layup-and-1 with 7.8 seconds left",
  "body": "MINNEAPOLIS -- — Nikola Jovic made the tying layup and go-ahead foul shot with 7.8 seconds left to send the Miami Heat past the Minnesota Timberwolves 95-94 and stop their three-game losing streak on Sunday night.\n\n\r\n              Jovic, who had 15 points and seven rebounds in his first game off the bench this season, drove to the rim with four-time NBA Defensive Player of the Year Rudy Gobert subbed out. Jovic went to the line to give the Heat their first lead since 63-61.\n\n\r\n              Mike Conley's 3-point attempt at the buzzer was short and finished another harried possession by the Timberwolves, whose three-game winning streak ended. Jaden McDaniels gave them the lead with a putback of Conley's miss with nine seconds left. \n\n\r\n              Tyler Herro had 26 points for the Heat, who played without star Jimmy Butler. \n\n\r\n              Anthony Edwards scored 22 points on 8-for-24 shooting for the Wolves, who trailed by 12 points after a 3-for-15 start from 3-point range. They closed the gap to 52-51 at the break with their only solid stretch on offense.\n\n\r\n              Takeaways\r\n              Heat: Overcoming 23 turnovers with 14 steals and nine blocks, all season highs, the Heat made Minnesota's offense just as much of a mess as theirs. Jaime Jaquez Jr. (illness) returned from a three-game absence.\n\n\r\n              Timberwolves: Twenty turnovers and rough shooting was stemmed a bit by a season-best 16 offensive rebounds, six by Gobert.\n\n\r\n              Key moment\r\n              Naz Reid, who went 4 for 7 from deep, hit a 3-pointer late in the third quarter to put the Timberwolves up 64-63 for their first lead since 10-9. That came midway through a 15-0 run.\n\n\r\n              Key stat\r\n              Herro set a career best with his 39th consecutive game, including the playoffs, with double-digit points. The streak started on Jan. 8.\n\n\r\n              Up next\r\n              Miami plays at Detroit on Tuesday. Minnesota plays at Portland on Tuesday and stays there for a second game on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998110.250091
}