{
  "game_id": "0021301079",
  "espn_id": "400489952",
  "date": "Mar 28, 2014",
  "matchup": "DET vs. MIA",
  "headline": "LeBron James' triple-double helps Heat blow out Pistons",
  "body": "AUBURN HILLS, Mich. -- LeBron James took a look at the stat sheet after three quarters and liked what he saw.\nThere was a lot to like.\nJames had 17 points, 12 assists and 10 rebounds to help the Miami Heat build a big lead, and then rested in the fourth quarter of a 110-78 victory against the Detroit Pistons on Friday night.\nIt was James' first triple-double of the season and No. 37 for his career.\n\"That thing has been pretty elusive, hasn't it?\" James asked. \"I'm just glad it came in a win. That is the important thing about getting those. It is only special if you win the game.\"\nJames had a triple-double without needing a point, assist or rebound in the final quarter for the fourth time in his career. His last triple-double through three quarters was Jan. 27, 2009, for Cleveland against Sacramento, according to STATS.\n\"Nothing LeBron James does should surprise us,\" Pistons coach John Loyer said. \"He's the best player in the game, or pretty close to it. He orchestrates for everybody.\"\nThe banged-up Heat had little trouble with the Pistons even though they were without Dwyane Wade, Mario Chalmers, Ray Allen and Greg Oden.\n\"At this point, there's somebody out every night,\" James lamented.\nThe Heat had plenty of players make up for the losses.\nUdonis Haslem scored 12 of his 17 points in the first quarter, when James already had seven assists. Chris Bosh scored 15, Chris Andersen had 13 points, Norris Cole scored 12 and James Jones added 10 for Miami.\n\"This was one of those games where we had to have different guys step up,\" Miami coach Erik Spoelstra said. \"You can't make excuses about lineups and injuries in this league. We've got to win games with the guys you can put on the floor every night.\"\nGreg Monroe and Will Bynum each had 12 points and Kyle Singler scored 11 for the Pistons, who honored their 1989 championship team at halftime. Detroit's Andre Drummond had 12 points and eight rebounds while Josh Smith was held to nine points on 4-of-14 shooting.\nThe Bad Boys didn't seem to inspire the current players, whose lack of effort was \"mind-boggling\" to Loyer.\n\"We didn't lay it on the line,\" Loyer said.\nDetroit was competitive for about a quarter.\nThe Heat led 28-23 after the opening period before outscoring the Pistons by 10 in the second quarter and by 17 in the third.\n\"They punched us in the mouth and we never got back up,\" Loyer said. \"We didn't have any energy in the second half.\n\"They play hard no matter who they play or no matter who they have playing in the game.\"\nBoth teams scored 18 in the final quarter, but that was when James was on the bench and so relaxed that he smiled for pictures taken by fans during a timeout.\nWade said he couldn't play because his right hamstring was bothering him, adding that he's day to day. Wade has played in 51 of 71 games this season, sitting out many by design because the two-time defending NBA champions want to rest his sore knees to make sure he's ready for the playoffs.\nChalmers injured his right quadriceps in Wednesday night's loss to Eastern Conference-leading Indiana. Chalmers said he's day to day. Allen missed his second straight game because of the flu, and Spoelstra said he kept Oden out to rest his back.\nGame notes\nJames said before the game he was wowed by slugger Miguel Cabrera getting a $292 million 10-year contract from the Detroit Tigers, saying he wished the NBA didn't have a salary cap. James has six-year contract worth roughly $110 million. ... Pistons president of basketball operations and Hall of Fame player Joe Dumars declined to be interviewed before the game and did not address the crowd when the Bad Boys were honored at halftime. Dumars' job seems to be in jeopardy with the franchise likely to miss the playoffs for a fifth straight year. Hall of Famer Isiah Thomas spoke for his teammates during the short ceremony and thanked the fans during his brief remarks. \"There were a lot of obstacles that we had to overcome through the years, and we couldn't have done it without your love and support,\" Thomas said.",
  "source": "espn_api",
  "crawled_at": 1764993280.0382981
}