{
  "game_id": "0021600201",
  "espn_id": "400899651",
  "date": "Nov 21, 2016",
  "matchup": "CHA vs. MEM",
  "headline": "Conley, Grizzlies top Hornets 105-90 for 5th straight win",
  "body": "CHARLOTTE, N.C. --  On the first day of workouts, new Memphis Grizzlies coach David Fizdale approached point guard Mike Conley and told him he wanted him to be more aggressive scoring the ball this season.\n\nThat's all Conley needed to hear.\n\nThe 10-year NBA veteran continued his high level of play Monday night, scoring 31 points as the Memphis Grizzlies got off to a fast start and defeated the Charlotte Hornets 105-90 for their fifth straight win.\n\nConley came in averaging a career-high 18.3 points per game. He had five 3-pointers and shot 11 of 21 from the field, including a long 3 with 4 minutes left that thwarted Charlotte's fourth-quarter rally and sent the crowd streaming toward the exits.\n\n\"He wanted me to be much more aggressive,\" Conley said of Fizdale. \"I believe I'm one of the better point guards in the league and he does, too. He's given me the opportunity to go out there and show it.\"\n\nMarc Gasol was dominant in the first half and finished with 13 points, nine assists and eight rebounds.\n\nThe Grizzlies controlled the tempo from the start, jumping out to a 16-4 lead. They pushed their advantage to 24 at halftime, shooting 58 percent from the field, including 10 of 16 from 3-point range.\n\n\"It started with our defense,\" Fizdale said. \"Our guys are really taking pride in trying to build a championship defense. We all know the saying. They're really digging in and really taking it to heart that we have to get stops. We also said our defense will travel. And it traveled tonight and it led to being unselfish on the offensive end.\"\n\nThe Hornets simply had no early answer for Gasol, who controlled the game with his shooting and passing.\n\nGasol had 13 points on 5-of-8 shooting in the first half along with seven assists and six rebounds. He repeatedly got Roy Hibbert off his feet with pump fakes near the top of the key, drove the lane and either scored or set up teammates with easy shots.\n\n\"We didn't have the readiness we need to play against a good team and they jumped on us,\" Hornets coach Steve Clifford said. \"Frankly that is two games in a row that we didn't play like the same team that got to 8-3. That's part of learning and evolving into the team I think we can be. It's a long season and everyone is going to have nights like this.\"\n\nTIP-INS\n\nGrizzlies: Tony Allen was listed as questionable with a groin injury, but looked just fine and finished with 12 points on 5-of-9 shooting.\n\nHornets: Cody Zeller missed his second straight game with a shoulder injury. Zeller is day to day but is still having trouble lifting his arm. ... Hornets owner Michael Jordan, who will receive the Presidential Medal of Honor on Tuesday, sat courtside.\n\nFRANK THE TANK HURT\n\nFrank Kaminsky turned in perhaps his best game as a pro for Charlotte, tying a career high with 23 points on 9-of-11 shooting. But his night ended badly when he left with less than 3 minutes to play with a sprained left ankle. Clifford said he wasn't sure the extent of the injury.\n\nSTREAK IS OVER\n\nKemba Walker had 17 points for the Hornets, snapping a string of 11 straight games with 20 or more.\n\nNEW ORLEANS HANGOVER\n\nCharlotte's Nic Batum and Marvin Williams were a combined 2 of 13 from the field, and the Hornets missed 11 of 31 free throws in losing their second straight game. Batum suggested the Hornets were still dwelling on coughing up a double-digit lead in the fourth quarter and losing to New Orleans last weekend.\n\n\"We had no energy,\" Batum said. \"We didn't get into this game. It might be a hangover from New Orleans because it was a tough one for us. I think we thought about that game too much tonight.\"\n\nGRITTY GRIZZLIES\n\nFizdale wasn't thrilled with his team's defense in the second half -- and he let the players know it.\n\n\"We got casual,\" Fizdale said. \"We got cool. I said, `Guys, we're from Memphis. There's nothing cool about us. We're gritty.' We couldn't lose that edge. They knew exactly what I meant and we got our bearings back.\"\n\nUP NEXT\n\nGrizzlies: They look to make it six straight wins when they visit the 76ers in Philadelphia on Wednesday night.\n\nHornets: Things aren't going to get any easier for the Hornets, who host the San Antonio Spurs on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995539.5217228
}