{
  "game_id": "0022400865",
  "espn_id": "401705431",
  "date": "Mar 01, 2025",
  "matchup": "DAL vs. MIL",
  "headline": "Antetokounmpo and Lillard lead Bucks to 132-117 victory over short-handed Mavericks",
  "body": "DALLAS -- — Giannis Antetokounmpo had 29 points, nine rebounds and nine assists, Damian Lillard scored 28 and the Milwaukee Bucks beat the Dallas Mavericks 132-117 on Saturday night.\n\n\r\n              Gary Trent Jr. added 20 points as the Bucks won for the sixth time in seven games, surging into fourth place in the Eastern Conference.\n\n\r\n              Kyrie Irving scored 31 points for the short-handed Mavericks, who are trying to stay afloat in the West playoff race until Anthony Davis returns from a groin injury, possibly by mid-March. The star forward got hurt in his Dallas debut after the seismic trade that sent Luka Doncic to the Los Angeles Lakers.\n\n\r\n              Irving made all 11 of his free throws, but was just 2 of 9 from 3-point range as the Mavs shot 28% (11 of 40) from beyond the arc. \n\n\r\n              Takeaways\r\n              Bucks: Milwaukee improved to 21-1 when scoring at least 120 points, which they did for the third time in the past four games. \n\n\r\n              Mavericks: Moses Brown had 18 points and nine rebounds on the final day of the 7-foot-2 center's 10-day contract. That was after Brown had 20 points and 11 rebounds in a victory over Charlotte. The Mavericks badly need his size with Davis, Dereck Lively II and Daniel Gafford sidelined by injuries, but they can't sign him to another 10-day deal because of salary cap restrictions.\n\n\r\n              Key moment\r\n              Lillard and Antetokounmpo combined to score Milwaukee's final 13 points before the break, turning a one-point deficit into an eight-point edge. Lillard made the first bucket of the second half, which started with a 10-2 Milwaukee run for an 81-65 lead.\n\n\r\n              Key stat\r\n              Antetokounmpo, who entered shooting 58% on free throws, was 11 of 13 from the line.\n\n\r\n              Up next\r\n              Milwaukee is at Atlanta on Tuesday, while Dallas is home against Sacramento on Monday. The Bucks and Mavs meet again in Milwaukee on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997152.268573
}