{
  "game_id": "0022001021",
  "espn_id": "401307829",
  "date": "May 09, 2021",
  "matchup": "CLE vs. DAL",
  "headline": "Doncic ejected in Mavericks' 124-97 victory over Cavaliers",
  "body": "CLEVELAND -- — Luka Doncic’s below-the-belt swipe to Collin Sexton earned him an ejection. It didn’t slow down the Dallas Mavericks.\n\n\r\n                    Tim Hardaway Jr. scored 25 points and Josh Richardson had 20, allowing playoff-bound Dallas to overcome the loss of Doncic early in the third quarter and roll to a 124-97 victory over the Cleveland Cavaliers on Sunday night.\n\n\r\n                    Doncic received a flagrant-two foul — an automatic ejection — just 1:55 into the second half for hitting Sexton with “an aggressive strike to the groin area,” according to lead official David Guthrie. It occurred while jostling for position under the Cleveland basket.\n\n\r\n                    “I knew I hit him, but I didn’t know where until I saw the replay,” Doncic said. “It wasn’t nothing on purpose. That stuff happens a lot in the game. It was just two guys fighting for a rebound, I guess.”\n\n\r\n                    Sexton, who initiated the original contact, said there were no hard feelings because it was “just a basketball play at the end of the day.”\n\n\r\n                    “Whenever somebody hand-checks, you usually punch down (like Doncic did), so it was all good,” Sexton said. “It was just a box-out play.”\n\n\r\n                    Dallas extended its lead to a game over Portland in the battle for fifth place in the Western Conference. The Lakers entered the night two games behind the Mavericks in seventh, which would make them the top seed in the play-in tournament.\n\n\r\n                    Doncic finished with 15 points in 22 minutes and Jalen Brunson added 13 points and seven assists for Dallas, which never trailed in its fourth win in a row. Dwight Powell had 12 points, nine rebounds, four assists and four blocked shots.\n\n\r\n                    “I’m not really going to comment on Luka’s ejection because I didn’t see it closely enough,” Mavericks coach Rick Carlisle said. “It’s unfortunate, but it sparked our guys.”\n\n\r\n                    Doncic has 15 technical fouls this season, one shy of a mandatory one-game suspension from the NBA.\n\n\r\n                    Sexton scored 24 points for the Cavaliers, who lost their 10th straight game — matching their longest skid of the season — and have not won since April 21 against Chicago. Kevin Love added eight points and 11 rebounds, and Mfiondu Kabengele had 14 points.\n\n\r\n                    After Doncic was ejected 1:55 into the second half, Sexton made the two accompanying free throws to pull Cleveland within 68-59. Dallas answered with a 30-13 run that featured 13 points by Hardaway.\n\n\r\n                    “Everybody was very professional about it,” Richardson said. “We huddled up and said we had to get these boys out of here because we felt like we were the better team.”\n\n\r\n                    Brunson buried a 3-pointer early in the fourth quarter to give Dallas its largest lead at 103-73. The Southwest Division champion Mavericks are 7-1 since April 27.\n\n\r\n                    Fan favorite Anderson Varejao was Cleveland’s first player off the bench and had five points and eight rebounds in 16 minutes. The Cavaliers, who have dropped five in a row at Rocket Mortgage FieldHouse, lost to Dallas for the second time in three days.\n\n\r\n                    “They saw their best player go out of the game and rallied around him,” Cleveland coach J.B. Bickerstaff said. “That’s what winning basketball teams do when they’re down.”\n\n\r\n                    STRETCH RUN\n\n\r\n                    The Mavericks face two playoff contenders in their final four games, taking on Memphis and New Orleans. Dallas wraps up the regular season with also-rans Toronto and Minnesota. “Guys are aware of the standings, so I don’t need to talk about it,” Carlisle said. “Given the way this season has gone, I’m more concerned with, ‘Where are we? What time is it? And where do you want to be in 10 minutes?’”\n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Doncic had his 1,500th career assist, two days after scoring his 5,000th point in the NBA. … F Kristaps Porzingis (right knee soreness) missed his sixth straight game and F Maxi Kleber (right Achilles soreness) sat out his fourth in a row. … Rookie G Tyrell Terry (personal reasons) has not appeared in a game since Jan. 29. … Dallas has used 27 lineups in its first 68 games, starting 15 different players.\n\n\r\n                    Cavaliers: G Darius Garland (left ankle sprain), who was hurt on April 30 against Washington, worked out on the court before the game. … F Cedi Osman (right ankle soreness), C Isaiah Hartenstein (possible concussion), F Lamar Stevens (concussion), F Taurean Prince (left ankle surgery), F Larry Nance Jr. (right thumb fracture), G Matthew Dellavedova (neck strain) and F Dylan Windler (left knee surgery) were unavailable.\n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: At Memphis on Tuesday night.\n\n\r\n                    Cavaliers: Host Indiana on Monday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997862.6918972
}