{"game_id": "180112026", "title": "Synthetic Recap", "body": "SALT LAKE CITY — On a night when basketball artistry superseded competition, the Utah Jazz provided the stage, but Donovan Mitchell authored a masterpiece that will echo through the annals of NBA history.\n\nIn a stunning 106-99 victory over the Cleveland Cavaliers, Mitchell didn’t just play; he performed, erupting for a career-high 71 points to power his team to an unforgettable win.\n\nFrom the opening tip, Mitchell was a man possessed, attacking the rim with ferocity and raining down jumpers from all angles. The Cavaliers had no answer for the All-Star guard, who was relentless in his pursuit of scoring history. Every defensive scheme thrown his way was met with a counter, a pull-up three, a acrobatic finish through contact, or a trip to the free-throw line, where he was a pristine 20-of-25.\n\nHis 71-point outburst not only shattered the franchise record but also etched his name alongside the game’s greatest individual performances, becoming just the seventh player in league history to cross the 70-point threshold. It was a one-man offensive clinic that left the Delta Center crowd in a state of perpetual awe.\n\nWhile Mitchell’s historic night rightfully commanded the spotlight, Rudy Gobert provided a crucial, bruising counterpoint inside, hauling in 18 rebounds to control the glass.\n\nFaced with a monumental individual effort, the Cavaliers fought valiantly but were simply overmatched by a force of nature. Darius Garland’s smooth 21-point, 6-assist night and Jarrett Allen’s 16-point, 10-rebound double-double were rendered footnotes in the face of Mitchell’s historic rampage.\n\nIn the end, the final score was almost incidental. This was not merely a game; it was a coronation. Donovan Mitchell didn't just beat the Cleveland Cavaliers; he transcended the sport, delivering a performance for the ages that will be recounted whenever legendary scoring nights are discussed.", "source": "AI_Reconstruction"}