{
  "game_id": "0022200183",
  "espn_id": "401468338",
  "date": "Nov 11, 2022",
  "matchup": "LAL vs. SAC",
  "headline": "Fox scores 32, Kings deal Lakers 5th straight loss 120-114",
  "body": "LOS ANGELES -- — One of De’Aaron Fox's goals coming into the season was to make sure he avoided a slow start.\n\n\r\n              The Sacramento guard has definitely accomplished that and is helping the Sacramento Kings find their groove.\n\n\r\n              Fox scored 32 points and had a season-high 12 assists as the Kings rallied in the fourth quarter Friday night for a 120-114 victory over the floundering Los Angeles Lakers.\n\n\r\n              “He can flat out go. I’m glad everybody is starting to see a little bit of it while we’re waiting games,” Kings coach Mike Brown said.\n\n\r\n              It was Fox’s seventh 25-point game of the season in his 10th appearance. He is just the fifth player in franchise history with seven-plus 25-point games in the first 10 games of a season, and the first since the franchise moved to Sacramento in 1985. The last Kings player to accomplish this was Tiny Archibald (nine) in 1972-73.\n\n\r\n              “I wanted to start the season on a high note. In the past I didn't play well until December or January,” said Fox, who also had seven rebounds. “Everything I’m doing right now is just trying to help put my team in the best position to win.”\n\n\r\n              Anthony Davis had 24 points and 14 rebounds while Russell Westbrook scored 21 points with 11 assists for the Lakers, who were without LeBron James after he suffered a groin injury in Wednesday night’s loss to the Clippers.\n\n\r\n              The Lakers (2-10) have dropped five straight for the second time this season and have matched the 1957-58 and 2015-16 squads for the worst start in team history.\n\n\r\n              The loss also tied the Lakers with Houston for the NBA’s worst record.\n\n\r\n              “As a staff we have to continue to grind it out and work and find the combinations to make it work,” coach Darvin Ham said. “We had the game down there to the end. We had some bad fouls and turnovers. At the end of the day we have to be on the same page and compete.”\n\n\r\n              Fox had 10 points and his four assists led to nine points in the fourth quarter as the Kings used an 8-0 run at the end of the game to win for the fifth time in their last seven games.\n\n\r\n              The Lakers had a 114-112 lead with 2:13 remaining after Westbrook hit a 3-pointer, before the Kings went on their run. Harrison Barnes tied it with two free throws and Fox put the Kings on top for good on a jumper with 1:06 remaining.\n\n\r\n              “He’s been clutch finishing games. We ran the same play, like five times,” said Domantas Sabonis, who had 21 points and 10 rebounds. “My job was to get him open, get him the ball and he did the rest.”\n\n\r\n              Kevin Huerter added 16 points for the Kings, who have won four of their last five trips to the Lakers' home court.\n\n\r\n              JAMES UPDATE\n\n\r\n              James is officially day-to-day after an MRI exam on Thursday revealed no tear to the groin. He is likely to miss Sunday's game against Brooklyn but could be available when the Lakers host Detroit on Nov. 18.\n\n\r\n              James has missed 85 regular-season games in his four-plus seasons with the Lakers.\n\n\r\n              TIP-INS\n\n\r\n              Kings: Barnes added 13 ponts while Terence Davis added 12 off the bench. ... Sabonis has seven double-doubles this season. ... Huerter was assessed a technical foul during the second quarter. \n\n\r\n              Lakers: Los Angeles led by 13 with 2:02 remaining in the second quarter, but were unable to make it stand. .... Lonnie Walker IV and Austin Reaves scored 19 apiece. ... Westbrook (second quarter) and Patrick Beverley (third quarter) received technical fouls.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host the Golden State Warriors Sunday.\n\n\r\n              Lakers: Host the Brooklyn Nets Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994151.411309
}