{
  "game_id": "0022000234",
  "espn_id": "401267394",
  "date": "Jan 22, 2021",
  "matchup": "TOR vs. MIA",
  "headline": "Powell, Raptors regroup after blowing lead, beat Heat 101-81",
  "body": "TAMPA , Fla. -- — Norman Powell scored 23 points, OG Anunoby added 21 and the Toronto Raptors recovered in the second half after blowing a 21-point lead to beat the Miami Heat 101-81 on Friday night.\n\n\r\n                    Pascal Siakam had 15 points, 14 rebounds and five assists for the Raptors, who never trailed on their way to avenging a 111-102 loss to the Heat on Wednesday night.\n\n\r\n                    “This was pretty much night and day,” Toronto coach Nick Nurse said of his team's defensive effort. “We were definitely flying around on D. It's a good two-game scenario in that we learned a lesson. In the NBA, if you come out and you don't play, you're going to get beat.”\n\n\r\n                    Kendrick Nunn led the Heat (6-8) with 20 points, but the injury-riddled defending Eastern Conference champions made just seven of 31 3-point shots (22.7%) in losing for the fourth time in six games. Bam Adebayo had 14 points and eight rebounds.\n\n\r\n                    The Raptors (6-9) led 34-13 when Powell's layup completed an 18-2 run with 2:52 left in the first quarter. They were 8 of 11 on 3-point shots in the period.\n\n\r\n                    “I thought we did a good job of not getting stagnant. We kept moving, cutting, and we were able to make plays off that movement,” Powell said. \n\n\r\n                    Powell, starting in place of the injured Kyle Lowry, scored 19 points in the first half, and the Raptors survived another dose of Miami's confusing zone defense.\n\n\r\n                    “We would have had a really good offensive night, too, without all those turnovers,” said Nurse.\n\n\r\n                    Toronto shot 46% overall with 22 turnovers.\n\n\r\n                    Goran Dragic had two layups and a baseline jumper and Gabe Vincent added three layups in a 19-5 Miami run that opened the second half and tied it at 61.\n\n\r\n                    But Powell answered with a layup, launching a 12-0 Toronto run, and the Heat never recovered.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Played again without F Jimmy Butler and G Avery Bradley (coronavirus protocol), G Tyler Herro (neck spams) and C Meyers Leonard (left shoulder strain). \n\n\r\n                    Raptors: Lowry did not play because of a toe infection. He tried to play through the injury Wednesday night and is hopeful of playing Sunday, Nurse said. ... Siakam played with a sore groin after a bad fall on Wednesday night. ... Powell averages 17.8 points and is shooting 55% in his four starts this season.\n\n\r\n                    RAPTORS ALMOST CENTERLESS\n\n\r\n                    Tuesday’s release of Alex Len left the Raptors with two centers. Chris Boucher is listed as a forward/center and starting center Aron Baynes, listed as a center-forward, played only 15.6 minutes per game before logging 23 minutes Friday night. “We didn’t see a need for a third center with Chris emerging,” said Nurse. “We’ve got a (roster) spot here and we’ll try to upgrade it with a biggerish-type player.”\n\n\r\n                    HEAT GOING THROUGH TOUGH STRETCH\n\n\r\n                    Miami coach Erik Spoelstra is trying to make the most of the many injury hits taken by his roster in the first 14 games of the season. Spoelstra stressed the minutes gained by younger players who would otherwise be watching. “We put this roster together based on (a next-man-up) identity,” Spoelstra said. “Because of all the missing parts this season ... this is good for all of our guys.”\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Saturday night's game at Brooklyn will be Miami's third road game in four days. \n\n\r\n                    Raptors: Play at Indiana Sunday afternoon in the first game of a two-day series. The game has been moved up to a 1 p.m. tipoff.",
  "source": "espn_api",
  "crawled_at": 1764996887.709834
}