{
  "game_id": "0022300327",
  "espn_id": "401584955",
  "date": "Dec 15, 2023",
  "matchup": "PHI vs. DET",
  "headline": "Joel Embiid scores 35 as the 76ers deal Pistons a franchise-record 22nd straight loss",
  "body": "PHILADELPHIA -- — Joel Embiid scored 35 points and Tyrese Maxey added 19 as the Philadelphia 76ers dealt the Detroit Pistons their franchise-record 22nd straight loss 124-92 on Friday night in the second game of a home-and-home series.\n\n\r\n              The Pistons, who lost to Philly 129-111 on Wednesday night in Detroit, eclipsed the franchise mark set at the end of the 1979-80 season and start of 1980-81. The Detroit streak is the sixth-longest single-season skid in NBA history.\n\n\r\n              Only the 2010-11 Cleveland Cavaliers and the 2013-14 Philadelphia 76ers (both lost 26 straight), along with the 1995-96 Vancouver Grizzlies, the 1997-98 Denver Nuggets and the 2011-12 Charlotte Bobcats (all lost 23 in a row) have lost more games in a row in a season. Philadelphia holds the overall mark of 28, set at the end of 2014-15 and start of 2015-16.\n\n\r\n              “It’s deflating,” Pistons coach Monty Williams said. “It is what it is. It’s a lot of repetitive games.”\n\n\r\n              Embiid, who scored 41 points on Wednesday, added 13 rebounds for his ninth straight double-double as the Sixers won their fifth straight game. Embiid has averaged 36.3 points and 12.1 points in those nine games, and broke Wilt Chamberlain’s franchise record for most consecutive games with at least 30 points and 10 rebounds.\n\n\r\n              Embiid is also the first NBA player with at least 675 points and 200 rebounds in the first 20 games of a season since Chamberlain did it in 1964-65.\n\n\r\n              “It’s great to be in that class,” Embiid said. “I just want to dominate every single night.”\n\n\r\n              The reigning league MVP, Embiid also added four blocks on the defensive end, but it’s his offensive game that continues to impress his teammates, even more than he did a season ago.\n\n\r\n              “He is getting better, which is scary,” Maxey said. “He made a layup today that I like to do where he made a Euro step and laid it high off the glass. He’s 7-foot-2 and he runs the floor at the same speed I do. It’s scary.”\n\n\r\n              James Wiseman led the Pistons with 20 points. Bojan Bogdanovic had 17 as Detroit fell to 2-23 overall.\n\n\r\n              Former Piston Tobias Harris added 13 points for Philadelphia, and Marcus Morris Sr. was perfect on five 3-point shots for 15 points off the bench. The 76ers outrebounded Detroit 54-42.\n\n\r\n              The 76ers more than doubled Detroit in the second quarter, outscoring the Pistons 35-17 and building a 61-39 halftime lead. Philly stretched the lead to 32 points after three quarters. That allowed Philadelphia coach Nick Nurse to rest Embiid for the fourth quarter and the rest of the regulars for the final 10 minutes.\n\n\r\n              The Pistons turned the ball over 21 times, the second-highest total of the season. Philadelphia coach Nick Nurse felt that the team made adjustments following Wednesday’s game in Detroit that forced many of those turnovers.\n\n\r\n              “You got to give our guys credit,” Nurse said. “They played hard and they made improvements defensively on the stuff we saw from the last game that we tried to work on the last couple days. Whoever hit the floor was out there trying to do the stuff we worked on and it paid off.”\n\n\r\n              There was plenty of tension between the teams, stemming from Wednesday’s game when Pistons forward Isaiah Stewart was ejected for a Flagrant-2 foul on 76ers guard Patrick Beverley.\n\n\r\n              During warm-ups, Beverley approached Stewart and the two started jawing before members of both teams’ security intervened.\n\n\r\n              Beverley continued a spirited conversation with Pistons assistant coach Jarrett Jack before eventually walking away. The conflict did not carry over to the game, although Stewart and Embiid were each assessed a technical foul for chirping with each other while Embiid was shooting free throws near the end of the first half.\n\n\r\n              “There’s competitive basketball, there’s emotional basketball and then there’s irrational,” Williams said. “Sometimes we let it get past emotional and get irrational and it has nothing to do with the game.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Travel to Milwaukee on Saturday.\n\n\r\n              76ers: Visit Charlotte on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996429.2855191
}