{
  "game_id": "0021800573",
  "espn_id": "401071249",
  "date": "Jan 04, 2019",
  "matchup": "PHX vs. LAC",
  "headline": "Clippers beat up on Suns again, win 121-111",
  "body": "PHOENIX --  Marcin Gortat figures he is the beneficiary of coach Doc Rivers' New Year's resolution.\n\nGortat had not played in the fourth quarter in the first 36 games of the season until the calendar turned, and he responded with his first double-double of the season when the Clippers extended their dominance of the Phoenix Suns with a 121-111 victory Friday night.\n\n\"You never know with Doc,\" Gortat said after getting 18 points and 13 rebounds in 25 minutes.\n\n\"You just have to be ready. You earn your minutes. Obviously if you play well, you might earn a few more minutes. That's all I'm trying to do, help the team to win.\"\n\nDanilo Gallinari and Lou Williams scored 21 points apiece and four other Clippers finished in double figures as they won their third straight against the Suns this season and their 11th straight in the series.\n\nPatrick Beverley scored 16 points for the Clippers, who led by 29 points in the second quarter. Beverley made four 3-pointers, Williams had three and Tobias Harris added two with his 16 points. Montrezl Harrell scored 15.\n\n\"I loved how we started the game,\" Rivers said. \"The way we can score, if we defend, it's hard for anyone to beat us.\"\n\nDevin Booker scored 23 points and T.J. Warren had 20 for the Suns, who lost their fifth straight.\n\nThe Suns, down by 30 with 4 1/2 minutes remaining in the third quarter, used 22-5 run fueled by seven points from Jamal Crawford and six by Josh Jackson to close to 91-78 entering the fourth quarter.\n\nMikal Bridges' slam on the first possession of the period brought the Suns within 11, but Williams made two 3-pointers and a three-point play as the Clippers again pulled away.\n\n\"We understand (Phoenix) is a young team,\" Williams said. \"They are putting pieces together, trying to figure out their identity. So we just come in and play hard.\"\n\nThe Clippers shot 51 percent from the field and held a 43-25 rebounding edge. Los Angeles outrebounded the Suns by 42 in the three meetings this season.\n\n\"We don't have stupid great rebounders on this team,\" Gortat said. \"Everybody has to rebound. We have to box out, hit somebody.\n\n\"Make sure we are the guys who are hitting first. Then go get the ball. We have to make them miss and get the ball. Not every game is going to look that way, but today it worked perfectly.\n\nReserves Richaun Holmes and Crawford had 16 points apiece for the Suns.\n\nSuns center Deandre Ayton had four points, tying a season low set in the first game against the Clippers on Nov. 28. He had three field goal attempts, five rebounds, three assists and four turnovers.\n\n\"You know (coach) Larry Brown used to say, `You need the touches, you go get it,\" Suns coach Igor Kokoskov said.\n\n\"(Three) touches? It's on all of us.\"\n\nThe Suns fell behind early, a problem in their last several starts. Harris and Williams made two 3-pointers apiece in the first quarter, when the Clippers shot 71.4 percent and finished on a 23-6 run for a 38-19 edge.\n\nThe Clippers led 63-34 on Gallinari's first 3-pointer with 4 minutes left in the half. It was 68-44 at halftime.\n\nPhoenix trailed Philadelphia by 22 points after 16 minutes of its 132-127 loss on Wednesday and was down by 17 at halftime of a 132-109 loss to Golden State on New Year's Eve.\n\nTIP-INS\n\nClippers: The Clippers play six of their next seven games at home, only away for an over-night trip to Denver on Jan. 10. ... Boban Marjanovic, one of three Clippers to have a double-double against the Suns on Nov. 28, did not play.\n\nSuns: Ayton had double-doubles in nine of his previous 11 games, and he had nine rebounds in the other game in that stretch. ... The Suns are 5-16 at home. Only New York (4-12) has fewer home victories. ... Booker has seven 35-point games, tied for third in the league behind James Harden (15) and Stephen Curry (eight).\n\nBIG BENCH\n\nThe Clippers' reserves had 61 points. They entered the game averaging a league-high 52.4 Williams and Harrell have not started a game this season, and Beverley flip-flopped with Avery Bradley on Nov. 20.\n\nAll average at least 25 minutes a game, and Williams (18.2) and Harrell (15.7) are the Clippers' third- and fourth-leading scorers.\n\n\"`Trez' could start, we know that. Lou could start,\" Rivers said. \"The fact that they are OK coming off the bench is the first key. I do think it takes a special mindset for a guy to want to do that and then guys who accept to do that. We have that.\"\n\nUP NEXT\n\nClippers: Host Orlando on Sunday.\n\nSuns: Host Charlotte on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995075.684526
}