{
  "game_id": "401809976",
  "espn_id": "401809976",
  "date": "Oct 27, 2025",
  "matchup": "GS vs MEM",
  "headline": "Kuminga, Moody and Podziemski lead balanced Warriors' attack in 131-118 win against Grizzlies",
  "body": "SAN FRANCISCO -- — Jonathan Kuminga had 25 points, 10 rebounds and four assists, Brandin Podziemski added 23 points and six assists, and the Golden State Warriors ran away from the Memphis Grizzlies in the third quarter for a 131-118 win Monday night.\n\n\r\n              Jimmy Butler and Moses Moody scored 20 points apiece while Stephen Curry added 16 in Golden State's balanced attack. \n\n\r\n              Draymond Green dished out 10 assists before fouling out with 7:32 left. He received a flagrant 1 foul with 3:48 remaining in the third quarter for a hard grab of Santi Aldama from behind after the Memphis forward's steal and as he was driving to the basket. Aldama missed both free throws and Green galloped around with glee.\n\n\r\n              Aldama wound up with 14 points, six rebounds and four assists.\n\n\r\n              Ja Morant had 23 points and nine assists for Memphis but missed all six of his 3-point tries. Jock Landale had 17 points and six rebounds.\n\n\r\n              Moody hit consecutive 3-pointers as the Warriors extended their lead to 88-75 in the third quarter and Curry connected two possessions later. Moody scored 12 points during a 36-point third.\n\n\r\n              Coach Steve Kerr had challenged his team to take better care of the ball but the Warriors had 10 first-half turnovers leading to 12 Memphis points and 15 in all.\n\n\r\n              Golden State rookie Will Richard faced the Memphis team that drafted him in the second round before the Warriors acquired his rights.\n\n\r\n              New Warriors big man Al Horford sat out the first game of the back-to-back to manage his left toe injury — a decision Kerr made in order to have him available against the tall Clippers team Tuesday.\n\n\r\n              The Grizzlies have lost seven straight games on the Warriors' home floor since their 104-101 overtime victory on Oct. 28, 2021.\n\n\r\n              \r\n              Up next\r\n              Grizzlies: At Phoenix on Wednesday night.\n\n\r\n              Warriors: Host the Clippers on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042516.018789
}