{
  "game_id": "0021601020",
  "espn_id": "400900415",
  "date": "Mar 17, 2017",
  "matchup": "DAL @ PHI",
  "headline": "76ers rout Mavericks in Noel's return to Philadelphia",
  "body": "PHILADELPHIA -- After being traded to Philadelphia by Dallas, Justin Anderson couldn't wait for the opportunity to prove his worth to his former team.\nAnderson tied his career high with 19 points and Robert Covington scored 12 of his 18 points in Philadelphia's dominant third quarter, helping the 76ers rout the Mavericks 116-74 on Friday night.\nRichaun Holmes added 17 points for the 76ers, who snapped an eight-game losing streak to Dallas while spoiling Nerlens Noel's return to Philadelphia.\n\"Talking to (Covington) before the game, I was like, `I want to get this one,\" Anderson said.\nAnderson was the first sub off coach Brett Brown's bench.\n\"Purposefully, I brought him off the bench first to get him in the game and get him going quickly, and he responded well,\" Brown said.\nNoel had nine points and five rebounds in his first game against his former team since being traded for Anderson, Andrew Bogut and a draft pick. Dwight Powell led the Mavericks with 14 points.\n\"We just came out a little flat,\" Noel said. \"Both groups, bench and starters, probably should have definitely brought more energy, especially on the defensive end.\"\nPhiladelphia got its largest margin of victory of the season while handing Dallas its worst defeat, topping the Mavericks' 128-90 setback at Cleveland on Nov. 25.\n\"This is by far the worst of the year in terms of energy, effort and togetherness,\" Mavs coach Rick Carlisle said. \"They outplayed us in every way possible. We just didn't show up. We've all got to look in the mirror. I'm not going to write it off as one of those nights. This kind of performance is inexcusable.\"\nThe loss also hurt the playoff chances of the Mavericks, who began the day 3 1/2 games behind Denver for the final spot in the Western Conference.\nPhiladelphia has no such postseason hopes, particularly since top rookie Joel Embiid was lost for the season.\nThe 76ers had hoped to build around Noel when they acquired him on draft day in 2013 after he was picked No. 6 by New Orleans. Noel experienced mostly losing during his 2 1/2 seasons in Philadelphia as part of former general manager Sam Hinkie's rebuilding plan, dubbed \"The Process.\"\nIt must have felt like old times for Noel in the third quarter when Philadelphia outscored the Mavericks 36-16 to enter the fourth ahead 87-56.\nTIP-INS\nMavericks: G Wesley Matthews returned to the lineup after sitting out Wednesday's win over Washington with a right calf strain. He had three points in 24 minutes. ... The Mavericks took the only other meeting of the season between the teams, 113-95 on Feb. 1 in Dallas.\n76ers: Rapper Biz Markie performed at halftime. ... Philadelphia improved to 16-19 at home. ... The 76ers' previous largest margin of victory was a 97-79 win at Detroit on Dec. 11.\nNOEL'S NIGHT\nNoel entered to strong applause with 6:45 left in the first quarter. Prior to his entry, the team showed a video tribute to him on the scoreboard.\nNoel thanked Philadelphia's fans on Thursday night by offering free cheesesteaks at a popular Philadelphia restaurant to anyone attending. Later on Thursday, Noel hung out with former teammate Holmes.\nBIG WIN\nThe 76ers' 42-point win was the most since a 43-point home win over Milwaukee on Jan. 30, 2008. The franchise's largest margin ever was prior to its move to Philadelphia when host Syracuse defeated New York 162-100 on Dec. 25, 1960.\nUP NEXT\nMavericks: Cap four-game trip at Brooklyn on Sunday.\n76ers: Host Boston on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764996106.7685592
}