{
  "game_id": "0021600559",
  "espn_id": "400933467",
  "date": "Jan 08, 2017",
  "matchup": "DET @ POR",
  "headline": "Pistons outlast Trail Blazers 125-124 in double-overtime",
  "body": "PORTLAND, Ore. -- The Detroit Pistons didn't need a 3-pointer, and they didn't call for one. However, coach Stan Van Gundy sure was glad Kentavious Caldwell-Pope took it.\nCaldwell-Pope hit a 3 with 9.4 seconds left and the Pistons outlasted the Portland Trail Blazers 125-124 in double-overtime Sunday night in a game postponed a day because of a winter storm.\n\"I'm damn glad it was a 3, to be quite honest\" Van Gundy said. \"I wasn't looking forward to another overtime.\"\nReggie Jackson led Detroit with 31 points, Andre Drummond had 28 points and 14 rebounds, and Caldwell-Pope finished with 26 points. The Pistons have won two straight for the first time since Dec. 2.\nDrummond logged a game-high 52 minutes while Caldwell-Pope and Jackson each played over 47 minutes.\n\"I feel like I played three hours,\" Jackson said.\nCJ McCollum had 35 points for Portland in the game with 14 lead changes and 11 ties. He has scored 20 points or more in seven straight games and is averaging 33.8 points in the last five. McCollum hit 3-pointers to force both overtimes, but was unable to make one last magic moment.\nHe had 21 of his 35 in the 4th quarter and the overtime periods, but missed a midrange jumper over Drummond in the second overtime, giving the Pistons a hard-earned victory.\n\"He'd been getting to that spot and usually when he gets to that spot, it's cash,\" Damian Lillard said about the final shot by McCollum.\n\"I get a pull-up with a big backing up on his heels and I miss it a little short, it's frustrating, but it's part of the game\" McCollum said. \"Nine out of 10 times I'd take that shot.\"\nAllen Crabbe added a career-high 30 points, and Lillard had 20 in his second game back from an ankle injury.\nMcCollum's 3-pointer with 8.3 seconds left tied it and 106, setting up overtime.\nPortland led by three in the first overtime, but the Pistons countered with a 6-0 run. McCollum answered once more, hitting a 3-pointer with 16.7 seconds left to force a second extra period.\nThe Pistons overcame a seven-point deficit in the fourth quarter to take a four-point lead, after back-to-back baskets from Marcus Morris with 2:31 left.\nCrabbe brought Portland closer with 48.1 seconds left to cut the Detroit lead to 104-103.\nJackson came right back with a step-back jumper to put Detroit up 106-103 with 24 seconds left, only to be answered by McCollum.\nTIP-INS\nPistons: Due to the postponement, the Pistons decided to kill time Saturday night at Rock Bottom Brewery in downtown Portland. \"Guys were playing pool. Most of them were over there,\" coach Stan Van Gundy said. \"There was a lot of other staff there too. I wanted to go over there and not be as anti-social as I usually am.\" ... Backup center Aron Baynes made his return to the floor after missing two games with a left ankle sprain. However, the Pistons did not get out of the game unscathed. Starting power forward Jon Leuer left Sunday's game after just six minutes with a sore right knee.\nTrail Blazers: Coach Terry Stotts said he likes the progress he's seen from Lillard in his return from a left ankle injury that kept him out two weeks. \"For not playing for two weeks and not really having a practice per se, I thought it was pretty good,\" Stotts said. Lillard says he's not quite back to normal, in terms of conditioning. \"I know there is going to come a game when I'm going to feel normal as far as my wind and my strength,\" he said.\nUP NEXT\nPistons: At Sacramento on Tuesday night.\nTrail Blazers: At Los Angeles Lakers on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764996060.037547
}