{
  "game_id": "401810211",
  "espn_id": "401810211",
  "date": "Dec 06, 2025",
  "matchup": "DAL vs HOU",
  "headline": "Dallas faces conference foe Houston",
  "body": "Houston Rockets (15-5, second in the Western Conference) vs. Dallas Mavericks (8-16, 12th in the Western Conference)\n\n\r\n              Dallas; Saturday, 8:30 p.m. EST\n\n\r\n               Rockets -10.5; over/under is 221.5\n\n\r\n              BOTTOM LINE: Dallas plays Houston in a matchup of Western Conference teams.\n\n\r\n              The Mavericks have gone 4-11 against Western Conference opponents. Dallas allows 116.4 points and has been outscored by 5.0 points per game.\n\n\r\n              The Rockets have gone 8-4 against Western Conference opponents. Houston is the league leader with 16.1 offensive rebounds per game led by Steven Adams averaging 4.8.\n\n\r\n              The Mavericks score 111.4 points per game, 1.7 more points than the 109.7 the Rockets give up. The Rockets average 5.1 more points per game (121.5) than the Mavericks give up (116.4).\n\n\r\n              The two teams play for the second time this season. The Rockets defeated the Mavericks 110-102 in their last meeting on Nov. 4. Amen Thompson led the Rockets with 27 points, and P.J. Washington led the Mavericks with 29 points.\n\n\r\n              TOP PERFORMERS: Cooper Flagg is shooting 47.5% and averaging 17.2 points for the Mavericks. Jaden Hardy is averaging 5.0 made 3-pointers over the last 10 games.\n\n\r\n              Thompson is averaging 17.9 points, 7.1 rebounds and 5.1 assists for the Rockets. Kevin Durant is averaging 28.0 points over the last 10 games.\n\n\r\n              LAST 10 GAMES: Mavericks: 4-6, averaging 111.6 points, 43.5 rebounds, 25.1 assists, 6.9 steals and 5.2 blocks per game while shooting 45.4% from the field. Their opponents have averaged 115.6 points per game.\n\n\r\n              Rockets: 8-2, averaging 119.0 points, 49.3 rebounds, 24.5 assists, 9.6 steals and 5.4 blocks per game while shooting 47.6% from the field. Their opponents have averaged 106.4 points.\n\n\r\n              INJURIES: Mavericks: Dereck Lively II: out (foot), P.J. Washington: day to day (ankle), Kyrie Irving: out (knee), Dante Exum: out for season (knee), Daniel Gafford: day to day (ankle).\n\n\r\n              Rockets: Fred VanVleet: out for season (acl), Dorian Finney-Smith: out (ankle), Tari Eason: out (oblique), Alperen Sengun: day to day (illness).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042769.1280751
}