{
  "game_id": "0022300269",
  "espn_id": "401584897",
  "date": "Nov 30, 2023",
  "matchup": "CHI vs. MIL",
  "headline": "Vucevic and White lead the way as Bulls beat Bucks 120-113 in OT",
  "body": "CHICAGO -- — Alex Caruso took the handoff from Nikola Vucevic at the top of the key and dribbled twice to his right before launching a fadeaway 3-pointer over Brook Lopez at the end of regulation.\n\n\r\n              The ball swished through the net to force overtime and help propel the short-handed Chicago Bulls over the Milwaukee Bucks 120-113 on Thursday night.\n\n\r\n              “I don't think it's that difficult because I shoot that a lot in the summer, playing open gym and then playing in August, September when we come back with the guys,” Caruso said. “I just don't get the opportunity to shoot a lot because usually I'm the guy taking the ball out.”\n\n\r\n              Vucevic scored a season-high 29 points, and Coby White added 23. Chicago pulled off a surprise with Zach LaVine (sore right foot) and DeMar DeRozan (sprained left ankle) sidelined by injuries.\n\n\r\n              “It is only one win,” Vucevic said. “But it's big for us at this point the way the season's been going, the way we haven't played really good basketball.”\n\n\r\n              The Bulls won for just the sixth time in 20 games. But they beat one of the NBA's best teams after losing five in a row.\n\n\r\n              The Bulls trailed 110-109 in overtime when Vucevic cut for a dunk with 2:28 remaining, sparking an eight-point run. Patrick Williams finished the decisive spurt when he dunked with 31 seconds remaining, and Chicago hung on from there.\n\n\r\n              Giannis Antetokounmpo led Milwaukee with 26 points and 14 rebounds. Lopez scored 20, and Malik Beasley added 19 points. Damian Lillard scored 18, but the Bucks came up short after winning eight of nine.\n\n\r\n              Chicago led by 12 early in the fourth quarter after a 16-2 run. The Bucks pulled within two, only to find themselves trailing 103-96 with 1:26 remaining after White nailed a step-back 3, whipping the crowd into a frenzy.\n\n\r\n              But just when it looked as if the struggling Bulls might close it out, the Bucks answered.\n\n\r\n              Antetokounmpo cut for a dunk. Beasley and Lopez made back-to-back 3-pointers to put Milwaukee on top 104-103 with 21 seconds remaining.\n\n\r\n              Antetokounmpo blocked Williams’ driving dunk with six seconds left and made two free throws. But Caruso sent the game to overtime with his buzzer-beater over the 7-foot-1 Lopez.\n\n\r\n              Vucevic also had 10 rebounds, and White nailed four 3-pointers. The Bulls committed 21 turnovers, but had a season-high 32 assists, with a flow on offense that's mostly been missing this season.\n\n\r\n              “We knew with Zach and DeMar out, there were gonna be obviously a handful of shots and minutes to go around,” Caruso said. “We tried to just talk to each other about not trying to do it all on our own. We knew that if we got them in the rotations and we touched the paint, we were gonna have open shots.”\n\n\r\n              The game was tied at 80 after White buried a floater for Chicago at the third-quarter buzzer. The Bulls then scored the first 10 points of the fourth, with Torrey Craig’s 15-footer making it 90-80.\n\n\r\n              Antetokounmpo drove for a finger roll. But White’s driving layup and two free throws by Andre Drummond made it 94-82 with 7:43 remaining.\n\n\r\n              Milwaukee's Andre Jackson Jr. exited with back tightness, and Pat Connaughton sat out because of a sprained right ankle. He left in the second quarter of a win over Miami on Tuesday.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Atlanta on Saturday.\n\n\r\n              Bulls: Host New Orleans on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995913.3714519
}