{
  "game_id": "0022400244",
  "espn_id": "401704810",
  "date": "Nov 18, 2024",
  "matchup": "CHI @ DET",
  "headline": "Zach LaVine's 16 fourth-quarter points lead Bulls past Pistons 122-112",
  "body": "DETROIT -- — Zach LaVine scored 16 of his 25 points in the fourth quarter and the Chicago Bulls pulled away for a 122-112 win against the Detroit Pistons on Monday night.\n\n\r\n              The game was tied at 95 with 8:46 left, but LaVine had nine points in a 13-2 run that put the Bulls up by 11 with 5:45 to go. He hit six 3-pointers in the quarter after a slow start.\n\n\r\n              Nikola Vucevic led the Bulls with 29 points and 12 rebounds while Coby White scored 25.\n\n\r\n              Cade Cunningham had 26 points and 10 assists for the Pistons and Malik Beasley added 21.\n\n\r\n              Takeaways\r\n              Bulls: LaVine has traditionally given the Pistons a hard time, averaging 21.7 points in 28 career games, including a 51-point game last season. They held him to seven points on 3-for-11 shooting, including 1 for 6 on 3-pointers, in the first three quarters. He came back into the game with 8:46 left and hit five of his first six shots, all 3-pointers.\n\n\r\n              Pistons: Detroit kept the game close for the first 40 minutes, but lost too many Bulls shooters on the perimeter. Chicago shot 23-46 (50%) on 3-pointers, including 7-15 (47%) in the fourth quarter.\n\n\r\n              Key moment\r\n              Detroit was trailing 80-75 in the third when they got distracted by not getting a call on defense. Before they regained focus, Josh Giddey tipped in a missed shot, LaVine threw down an uncontested dunk and Vucevic hit a 3-pointer to make it 87-75.\n\n\r\n              Key stat\r\n              The Pistons had 16 offensive rebounds to Chicago's 10 and only committed nine turnovers, but they only hit 34% of their 3-pointers while the Bulls were making half of theirs.\n\n\r\n              Up next\r\n              The Bulls play Wednesday in Milwaukee. The Pistons visit Charlotte on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997103.842423
}