{
  "game_id": "0021900347",
  "espn_id": "401160989",
  "date": "Dec 09, 2019",
  "matchup": "MIL vs. ORL",
  "headline": "Bucks top Magic for 15th straight win; Antetokounmpo gets 32",
  "body": "MILWAUKEE --  After outscoring opponents by an average of 34 points in their previous four games, the Milwaukee Bucks found out right away things would be tougher Monday when their first two shots were blocked.\n\nThat slowed the Bucks down, but they still can't be stopped.\n\nGiannis Antetokounmpo had 32 points and 15 rebounds to lead Milwaukee to its 15th straight victory, 110-101 over the Orlando Magic.\n\n\"Sometimes, it's good to have close games. You learn from that. You get used to being in close games and not always winning by 20 or 30,\" said Antetokounmpo, the reigning MVP. \"We got the win, we grinded it out and played defense, but I think the two days in between made us a little bit rusty.\"\n\nThe Bucks were off Saturday and Sunday.\n\nThey outrebounded Orlando 54-44, angering Magic coach Steve Clifford.\n\n\"You can't come on the road and get smacked on the glass like that. There's got to be some physicality,\" he said.\n\n\"Too man hustle points, second-chance points,\" added Aaron Gordon, who had 13 rebounds and 10 points.\n\nKhris Middleton scored 20 points for Milwaukee and Dante DiVincenzo added 12 points off the bench.\n\nEvan Fournier had 26 points for the Magic, who had won four straight. Terrence Ross scored 23.\n\nRoss hit a 3-pointer and was fouled by Eric Bledsoe with 50 seconds left to cut the Bucks' lead to 107-101, but he missed the free throw. Then Middleton put away the game by responding with a 3-pointer.\n\nAt 21-3, Milwaukee is tied with the Los Angeles Lakers for the NBA's best record.\n\nThe Bucks' first two shots were rejected by Magic forward Jonathan Isaac, the league's leading shot blocker. In all, Isaac recorded four blocks against four different players before the game was 8  1/2 minutes old. He finished with five blocks.\n\nDespite the rough start, the Bucks surged to a 31-18 lead after a 14-0 run late in the first quarter, with forward Ersan Ilyasova sinking two 3-pointers. They led 52-40 at halftime.\n\nOrlando shot just 29.5% from the field, including 14.3% from behind the 3-point line, in the first half.\n\n\"I think our defense, even though I didn't love the way we played tonight, our first-half defense kind of carried us through,\" Bucks coach Mike Budenholzer said.\n\nThe Magic, fueled by six 3-pointers in the third quarter, including three by Ross, drew within five points just before the end of the period.\n\nBut they couldn't get any closer.\n\nTIP-INS\n\nMagic: C Mo Bamba was helped to the locker room in the second quarter with a left knee contusion, but returned. . Played without C Nikola Vucevic (right lateral ankle sprain) for the ninth straight game. ... Just as the Magic reached .500 for the first time this season, they faced a brutal trio of games. After the Bucks (1st place, Eastern Conference), they have home games against the Lakers (1st place, Western Conference) and Houston (4th place, West).\n\nBucks: Entered Monday leading the league in points (121) and rebounds (51.8) per game. . Guard George Hill entered Monday leading the league in 3-point field-goal percentage (.516).... In attendance: California high school football coach Rob Mendez, who was born without arms and legs, accompanied by Packers linebacker Blake Martinez.\n\nGYM CLOSED\n\nThe Bucks' being off Saturday and Sunday was a rare occurrence. \"It was well placed for us. But, if we don't play well tonight, we think it's a terrible idea,\" Budenholzer joked before Monday's game. \"I think we had good enforcement on a lockout day yesterday,\" he said of players staying away from the practice facility.\n\nKNEED-ING ROSS\n\nRoss shot 25 for 51 (49%) during the Magic's winning streak. \"I think, one, he's healthy,\" Clifford said. \"I think that the little knee injury that he had, it didn't prevent him from playing, but he wasn't explosive.\"\n\nUP NEXT\n\nMagic: Host the Lakers on Wednesday.\n\nBucks: Host the Pelicans on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764996160.608765
}