{
  "game_id": "0021900796",
  "espn_id": "401161438",
  "date": "Feb 10, 2020",
  "matchup": "TOR vs. MIN",
  "headline": "Anunoby has 25, Raptors beat Wolves for 15th straight win",
  "body": "TORONTO --  Toronto Raptors star Pascal Siakam keeps telling teammate OG Anunoby to improve his offense output by thinking less on the court.\n\nAnunoby must not have thought much during Monday's game against Minnesota.\n\nAnunoby scored a career-high 25 points and matched his career best with 12 rebounds, Kyle Lowry had 27 points and 11 assists, and the Raptors extended their franchise-record winning streak to 15 by beating the Timberwolves 137-126.\n\n\"Most of the time you can kind of see that he's thinking too much and he's not just playing freely,\" Siakam said of Anunoby. \"Every time he just goes out and plays -- once you're open shoot it, you're not open drive it -- he always has a good game.\n\n\"You've got to keep it simple, and he did tonight.\"\n\nAnunoby connected on 10 of 13 attempts, going 3 of 4 from 3-point range, and picked up his fifth double-double of the season.\n\nToronto is 4-0 when Anunoby scores 20 or more.\n\n\"I thought his decisions were really, really good tonight,\" Raptors coach Nick Nurse said.\n\nSiakam scored 14 of his 34 points in the fourth quarter, Rondae Hollis-Jefferson had a season-high 21 and Fred VanVleet added 16 as the Raptors won their 16th straight home meeting with Minnesota.\n\nLowry returned after missing Saturday's win over Brooklyn because of whiplash, but center Serge Ibaka sat because of flu-like symptoms. Hollis-Jefferson started for Ibaka.\n\nD'Angelo Russell scored 22 points in his Minnesota debut and Karl-Anthony Towns had 23 points and 10 rebounds, but the Timberwolves couldn't build on Saturday's surprise victory over the Clippers that snapped a 13-game losing streak.\n\nRussell, who didn't play Saturday because of a right quad contusion, said he had enjoyed his first game playing alongside his pal Towns and the rest of the new-look Timberwolves.\n\n\"It was great,\" Russell said. \"Super excited about this group.\"\n\nJarrett Culver, Malik Beasley and Juancho Hernangomez scored 15 apiece for the Timberwolves, who have lost five straight against Toronto.\n\nMinnesota had a season-worst 23 turnovers, leading to 34 points for the Raptors.\n\n\"Your turnovers are as good as 2s and 3s for them, the way they push the ball and the way they can score in the open court,\" Timberwolves coach Ryan Saunders said.\n\nToronto wasn't much better at taking care of the ball. The Raptors committed 20 turnovers, four shy of their season-worst total. The Timberwolves scored 26 points off Toronto miscues.\n\nMinnesota trailed 106-94 through three quarters but former Raptor James Johnson made two 3-pointers as the Timberwolves opened the fourth with a 12-2 run, cutting it to 108-106 with 9:07 left.\n\nThat was as close as Minnesota would get. Chris Boucher and Siakam scored to push Toronto's lead back to six points, and VanVleet and Patrick McCaw hit 3-pointers on either side of Towns' free throw to make it 120-109 with 5:28 remaining.\n\nToronto connected on eight straight field goals to begin the game before Hollis-Jefferson missed a hook shot with 8:03 to play in the opening quarter. Lowry scored 14 points in the first and Siakam shot 4 for 4 and scored 10 points as the Raptors led 40-36.\n\nMinnesota took its first lead of the game on a layup by Hernangomez with 6:24 left in the second quarter. The Timberwolves led 75-74 at halftime.\n\nAnunoby scored 16 points in the third on 6-of-7 shooting, but the basket of the quarter came in the final seconds when VanVleet threw a no-look, overhead pass to Hollis-Jefferson for a fast-break dunk. Toronto outscored Minnesota 32-19 in the third to take a 106-94 lead to the fourth.\n\nTIP-INS\n\nTimberwolves: Towns had a team-high seven assists. ... Minnesota shot 5 for 15 in the third quarter. . The Timberwolves outscored the Raptors 42-14 in bench points. . Minnesota has lost seven straight on the road.\n\nRaptors: This was the first 20-point, 10-rebound game of Anunoby's career. . Toronto had seven turnovers in the first quarter, as many as it made in all of Saturday's win over Brooklyn. . The Raptors are 15-0 this season when they shoot 50 percent or better from the floor.\n\nBORDER BLUES\n\nMinnesota has not won north of the border since Jan. 21, 2004.\n\nSTARTING STRONG\n\nToronto starters combined for a team-record 123 points.\n\nRARE FEAT\n\nThe Raptors had four players score 20 or more points in the same game for the ninth time in team history.\n\nUP NEXT\n\nTimberwolves: Host Charlotte on Wednesday.\n\nRaptors: Visit Brooklyn on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995594.313163
}