{
  "game_id": "0021500665",
  "espn_id": "400828552",
  "date": "Jan 24, 2016",
  "matchup": "HOU vs. DAL",
  "headline": "Harden's triple-double leads Rockets over Mavericks 115-104",
  "body": "HOUSTON -- Trevor Ariza has rediscovered his long-range shooting, and that is really good news for James Harden and the Houston Rockets.\nAriza scored a season-high 29 points, Harden had 23 points, 15 rebounds and 10 assists, and the Rockets rallied for a 115-104 win over the Dallas Mavericks on Sunday.\nAriza made a season-high six 3-pointers after making five on Friday following a three-game stretch when he made just four combined. The always low-key Ariza downplayed his big game.\n\"I was just getting a lot of open looks,\" he said. \"I had a bigger guy on me and I had the option of going by him when I shoot the ball, and I just felt good shooting.\"\n\nHarden isn't surprised to see what Ariza has done the past two games.\n\"He finally found a rhythm,\" Harden said. \"We knew it was going to come.\"\nThe Rockets trailed by one entering the fourth quarter, but they used 14-4 run, highlighted by consecutive 3-pointers by Ariza, Jason Terry and Josh Smith, to take a 98-89 lead with about nine minutes left.\nChandler Parsons made a layup for the Mavericks before Houston scored five straight points to push the lead to 103-91. Terry started that stretch with a 3-pointer and Smith juked Dirk Nowitzki to get open for a hook shot, and the Mavericks didn't threaten again.\n\"We just can't let them knock down shots and shots and shots and let them get good looks after good looks,\" Dallas guard Wesley Matthews said. \"We got away from our game plan and things just didn't work out for us.\"\nParsons had a season-high 31 points for the Mavericks, who dropped their second straight game.\nSmith, who was acquired in a trade with the Clippers on Friday, scored a season-high 16 in his second game back with the Rockets.\n\"When they brought (Smith) back in here, a veteran player, someone who understands the flow of the game ... he's just been huge for us,\" Ariza said.\nHouston led by 13 midway through the fourth quarter when the Rockets scored four points in a row, including a two-handed dunk by Ariza, to make it 112-95 with about four minutes remaining.\nHarden collected his second triple-double of the season and eighth of his career when he dished to Clint Capela for an alley-oop dunk with 1:26 remaining, putting the Rockets up 115-102.\nAriza made his first six shots, including four 3-pointers, to finish the first quarter with 16 points. He cooled off in the second quarter and the Mavericks outscored Houston 29-14 to take a 58-50 halftime lead.\nTIP-INS\nMavericks: C Zaza Pachulia missed the game with a right leg injury. ... Nowitzki scored 19 points. ... Matthews finished with 15 points.\nRockets: F/C Donatas Motiejunas missed his 12th straight game with back soreness. ... G Patrick Beverley returned after missing two games with a sprained left ankle. ... Corey Brewer had 13 points and four steals. ... Ty Lawson finished with 10 points.\nHOWARD'S HEALTH\nHouston played without Dwight Howard, who missed his second straight game with a sprained left ankle. He was injured in the first minute of Houston's game on Wednesday and interim coach J.B. Bickerstaff isn't sure when he'll return.\n\"You don't want to put a timetable on it, but obviously you want him to be healthy so we'll take our time with him,\" Bickerstaff said. \"Every day he gets better. Every day he's doing more and more. So we'll just wait and see. He's heading in the right direction. He hasn't had any setbacks.\"\nRED-HOT PARSONS\nParsons is finally returning to form after starting the season slow following hybrid microfracture surgery on his right knee in May. He scored 30 and 26 points in the Mavericks' previous two games before his 31-point performance on Sunday.\nQUOTABLE\nSmith on his return to Houston after having a tough time with the Clippers: \"It's definitely a comfortable feeling being able to get back. And seeing the appreciation from the fans and my teammates definitely instills confidence that this is where I belong.\"\nUP NEXT\nMavericks: Visit Los Angeles Lakers on Tuesday.\nRockets: Visit New Orleans on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994627.156001
}