{
  "game_id": "0021900125",
  "espn_id": "401160767",
  "date": "Nov 08, 2019",
  "matchup": "BKN @ POR",
  "headline": "Blazers lose to Nets despite Damian Lillard's career-best 60 points",
  "body": "PORTLAND, Ore. -- Damian Lillard's career- and franchise-high scoring game wasn't enough for the Portland Trail Blazers to get their first home victory of the season.\nLillard scored a career-high 60 points for Portland in the Trail Blazers' 119-115 loss to the Brooklyn Nets on Friday night.\nSpencer Dinwiddie scored 34 points and Kyrie Irving had 33 for Brooklyn to help send Portland to its fourth consecutive loss.\n\"He got 60, but luckily for us he would've needed 65,\" Dinwiddie said of Lillard after the game.\nLillard set a franchise record with the highest-scoring game of the season in the NBA. He was 19-of-33 from the field, 7-of-16 from 3-point range and made all 15 of his free throws.\n\"We tried zone, box-and-one, we tried blitz, we threw the kitchen sink at him,\" Nets coach Kenny Atkinson said of Lillard. \"He just kept making incredible shots.\"\nEarlier Friday night, Warriors guard D'Angelo Russell had 52 points in Golden State's 125-119 overtime loss to the Minnesota Timberwolves.\nIt marked just the second time in NBA history that there were multiple 50-point scorers on the same day and both lost, according to ESPN Stats & Information research. The other came April 9, 1978, when David Thompson of the Nuggets had 73 and George Gervin of the Spurs had 63, both in losing causes.\n\"It's fine,\" Lillard said about his 60 points coming in a loss. \"It's whatever. Anytime you set records it's obviously good. I guess it's not as fun losing.\"\nIrving, the NBA's second-leading scorer coming in to the game, did his part in the guard matchup for the Nets. He had nine fourth-quarter points and hit a shot to put the Nets up 117-112 with 17.8 seconds left.\n\"The game could have gone either way as well as [Lillard] was playing,\" Irving said. \"Anytime someone has a big performance like that, it can go either way when he can really take over the game like he did.\"\nIrving said he was also proud of Dinwiddie's performance.\n\"I'm just trying to stay on him to stay aggressive to be the kind of player he wants to be,\" Irving said of his backcourt mate. \"Tonight was a fresh start for him going into this road trip.\"\nCJ McCollum struggled for most of the night for Portland, missing 14 of his first 16 shots and finishing with only eight points on 4-of-19 shooting. The normally efficient McCollum has struggled to start the season from the field, shooting 38% overall and just 32% from the 3-point line.\n\"Obviously you'd like to make shots and I haven't,\" McCollum said. \"I'm not playing the way I want to play offensively, that's quite obvious.\" \"\nWhile the win was big for the Nets as they begin their first long road trip, the loss was Portland's fourth straight as the Blazers fell to 0-3 at home this season. Lillard has been disappointed with the way last season's Western Conference finalists have finished games so far.\n\"I think we in position to win games and we in position in the third quarter, in the fourth quarter you've got to be present mentally and physically,\" Lillard said. \"You have to do a little bit more than the other team to win games. I think we compete. I think we're together. I think we try to do the right things but that little bit of wanting it more than the other team. And wanting it more doesn't mean playing harder, it means being able to be sharper on one more possession.\"\nStarting small forward Rodney Hood left the game in the first quarter and did not return due to back spasms. That meant first-round pick Nassir Little made his NBA debut. Little got a block and a basket during his first NBA shift, helping Portland cut what had been a 10-point lead down to five. He finished with eight points and three rebounds.\n\"He had a lot of energy,\" Blazers coach Terry Stotts said of Little's performance. \"I thought he had some momentum plays. I liked his athleticism, his dunks he got the crowd into the game, got our bench into it.\"\nTIP-INS\nNets: The stellar play of Irving hasn't been the only bright spot through a 4-4 start. The Nets came into Friday ranked first in the NBA in offensive rebound percentage, which came as an encouraging development to Atkinson.\n\"I saw that and I was a little surprised,\" Atkinson said. \"We'll see if we can sustain it. But I'm glad because we've also been pretty good at transition defense. If we were 30th in transition defense, I'd be worried. The fact we are balancing those two is a good sign. \"\nThe Nets faced an added challenge Friday as they were without backup center DeAndre Jordan. With no real replacement for him on the roster, the Nets will have to platoon at that spot.\n\"By committee, we can go big, we can go small,\" Atkinson said. \"We'll see a little bit of both.\"\nTrail Blazers: Adding injury to insult, the Blazers lost another big man when Skal Labissiere suffered a sprained right ankle in the fourth quarter.\nAfter losing forward-center Zach Collins for the next few months due to shoulder surgery last week, an injury to Labissiere is the last thing the Blazers need as centers Jusuf Nurkic (leg) and Pau Gasol (foot) are still out indefinitely recovering from their own injuries.\nStotts did not have an update on Labissiere or Hood after the game.\nUP NEXT\nNets: At Phoenix on Sunday night.\nTrail Blazers: Host Atlanta on Sunday night.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764996442.795514
}