{
  "game_id": "0021800491",
  "espn_id": "401071172",
  "date": "Dec 23, 2018",
  "matchup": "MIA @ ORL",
  "headline": "Heat beat Magic 115-91, Spoelstra gets 500th coaching win",
  "body": "ORLANDO, Fla. --  It was a 500 kind of night for the Miami Heat, who got their record back to .500 and delivered coach Erik Spoelstra his 500th coaching victory.\n\nTyler Johnson scored 20 of his 25 points in the third quarter as Miami defeated the Orlando Magic 115-91 and ran its winning streak to five games.\n\nJustise Winslow added 22 points and Josh Richardson finished with 15 points and 10 rebounds for Miami, which beat Orlando for the first time in three tries this season and improved to 16-16.\n\nDwayne Wade, playing his 24th and likely final game in Orlando, had 10 points and four assists in 24 minutes.\n\n\"I definitely think having four wins in a row, this was the best team for us to play because they've had our number this year,\" Wade said. \"It made us focus on what we need to do to not lose to them three times in a row.\"\n\nJohnson made just his fourth start of the season and hit five 3-pointers in the third quarter, finishing off one with a four-point play.\n\n\"Usually for me, if I hit one or two, it's going up again,\" said Johnson, whose season-high scoring output came without playing in the fourth quarter.\n\n\"When guys have been able to get going during this little run that we've had, we go back to him. I think that puts a little confidence in players because they know once they get going, the ball will find them. And it opens up everything else for the offense.\"\n\nSpoelstra, Miami's coach since the 2008-09 season, has a career coaching record of 500-336 and has won two NBA titles. The milestone win, he said, humbled him.\n\n\"But it doesn't even register as real to me right now, and that's why I'm so grateful for the opportunity,\" Spoelstra said. \"There's been a lot of low points and a lot of incredible moments, but you don't get to survive those low points if you don't have the belief of the people above you.\"\n\nEvan Fournier scored 17 points for the Magic, who lost their third straight.\n\n\"Obviously we've lost our way here a little bit, which actually happens a lot during an NBA season,\" said coach Steve Clifford. \"(The Heat) are rolling, they played great, they shot the ball well.\"\n\nThe Heat came into the game with the NBA's worst field goal percentage (.429), but shot 43 for 84 (.506).\n\nRichardson hit a 3-pointer and converted a three-point play that gave Miami a 37-18 lead early in the second quarter. The Heat were in control until going 4:35 without a field goal.\n\nJonathan Isaac's two free throws with 3:29 left in the first half punctuated a 16-2 run that cut Orlando's deficit to five points.\n\nThe Heat led 53-44 at halftime, and Johnson's shooting helped them build that advantage to 26 points in the third quarter.\n\nOrlando cut it to eight in the fourth quarter, but four straight free throws by Richardson opened an 11-0 run by Miami that put the game away.\n\nOH THAT 500!\n\nAsked before the game about the possibility of reaching 500, Spoelsta assumed the question was about his team's record, which was 15-16 at the time. When informed he was one win away from his 500th career victory, the 48-year-old Spoelstra replied: \"I'm getting old, I guess.\"\n\nTIP-INS\n\nHeat: F Rodney McGruder, the only player to have started Miami's first 31 games, was a last-minute scratch due to a stomach ailment. Tyler Johnson took his spot in the starting lineup. ... Miami held a sixth straight opponent under 100 points. ... The Heat lead the Florida series 65-53.\n\nMagic: F Jonathon Simmons played 20 minutes after missing Friday's game at Chicago with a sprained right ankle. ... The Magic are 2-6 since winning in Miami on Dec. 4.\n\nUP NEXT\n\nHeat: At home against Toronto on Wednesday night.\n\nMagic: At home against Phoenix on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995251.373924
}