{
  "game_id": "0022200465",
  "espn_id": "401468620",
  "date": "Dec 20, 2022",
  "matchup": "MEM @ DEN",
  "headline": "Jokic's latest triple-double leads Nuggets past Grizzlies",
  "body": "DENVER -- — Nikola Jokic had 13 points, 13 rebounds and 13 assists for his second straight triple-double to lead the Denver Nuggets over the Memphis Grizzlies 105-91 on Tuesday night in a matchup between the top two teams in the Western Conference.\n\n\r\n              Jokic followed up his 40-point, 27-rebound, 10-assist performance Sunday night with his sixth triple-double of the season and 82nd of his career. He joined Wilt Chamberlain as the only players to put up those stats in a single game. Chamberlain did it four times.\n\n\r\n              Aaron Gordon had 24 points and Bruce Brown scored 16 for Denver. Rookie Christian Braun scored 13 points in the first start of his career.\n\n\r\n              “It doesn’t change much. You just got to be ready for the plays out of the huddle, but it didn’t change anything,” Braun said. “Same mindset, I have come in to the same exact thing. So it’s pretty easy.”\n\n\r\n              Braun’s defensive assignment was Ja Morant, who led Memphis with 35 points and 10 assists.\n\n\r\n              “I thought I was doing a good job on Ja and I looked up in the third quarter and he had 30,” Braun said.\n\n\r\n              The Grizzlies, now tied with the Nuggets in the standings, have lost two in a row following a seven-game winning streak.\n\n\r\n              “You’re playing for first place in the Western Conference -- meaningless in the middle of December — but that’s what we’re playing for tonight,” Denver coach Michael Malone said. “That team is a top five in offensive and defense, so we’re going to have to bring our A game tonight. And I felt that Bruce, Christian, (Kentavious Caldwell-Pope), Aaron and Nikola did that.”\n\n\r\n              Denver, which never trailed, shot 59% and built a 21-point lead in the first quarter. Jeff Green’s running dunk over Ziaire Williams made it 37-14 and prompted a Memphis timeout 22 seconds into the second.\n\n\r\n              “Insane. His new nickname is Vino,” Gordon said of the 36-year-old Green. “Ages like fine wine.”\n\n\r\n              Memphis got within nine in the third period, but the Nuggets went back ahead by 20 and led by 13 entering the fourth. The Grizzlies made it 92-84 midway through the fourth but Denver used a 13-3 run to put it away.\n\n\r\n              “Two games in a row we don’t come out in the first quarter and we pay the price for it,” Memphis coach Taylor Jenkins said. “We were getting some good shots early, we just need to convert those and give ourselves a better start to the game.”\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: F Desmond Bane missed his 17th straight game with a sprained big toe on his right foot. ... Jaren Jackson Jr. had three blocks in his first nine minutes and finished with five, three shy of his career best set Dec. 12 against Atlanta.\n\n\r\n              Nuggets: Malone said Michael Porter Jr. is increasing his workload while rehabbing a heel injury and could return Friday against Portland or Sunday against Phoenix. ... Jamal Murray (sore left knee) was inactive. ... Hall of Fame QB Peyton Manning and former wide receiver Emmanuel Sanders sat courtside. Both played on the Denver Broncos’ Super Bowl 50 title team.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At the Phoenix Suns on Friday night.\n\n\r\n              Nuggets: Host the Portland Trail Blazers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994213.789273
}