{
  "game_id": "0021900669",
  "espn_id": "401161311",
  "date": "Jan 24, 2020",
  "matchup": "CHA vs. MIL",
  "headline": "Giannis Antetokounmpo has 30 points, 12 boards as Bucks roll in Paris",
  "body": "PARIS -- Giannis Antetokounmpo had 30 points and 16 rebounds and the NBA-leading Milwaukee Bucks beat the Charlotte Hornets 116-103 on Friday night in the first NBA regular-season game in France.\nMilwaukee improved to 40-6 with its eighth consecutive victory. The Bucks have the best 46-game start in franchise history. They were 39-7 in 1970-71, when they went on to win the NBA championship.\n\"The focus and the purpose of this team has been very good,\" Bucks coach Mike Budenholzer said. \"We feel like there's a lot of work to be done, a lot of things to improve.\"\nEric Bledsoe added 20 points and five assists for the Bucks, who looked rusty in the first two quarters.\n\"I only practiced once before the game. It's kind of hard to get into a rhythm. We weren't moving the ball as much,\" said Antetokounmpo, who had his fourth triple-double of the season on Monday against the Chicago Bulls. \"Hopefully, we can learn from the game. Close to the third quarter, the bench came back in and did a great job. In the fourth quarter we were able to close out the game.\"\nMalik Monk led Charlotte with 31 points.\n\"I thought Malik was fantastic, made plays for us. He's an incredible athlete,\" Hornets coach James Borrego said. \"The challenge now is to do it on a night-to-night basis.\"\nThe Hornets have lost eight in a row -- the team's longest streak since it dropped 10 straight during the 2014-15 season.\nMilwaukee rallied to tie it at 78 going into the fourth quarter. Pat Connaughton put the Bucks in front with a dunk in the fourth. Then Antetokounmpo got going, drawing a foul as he slalomed through the defense.\n\"Our guys competed hard, put us in a position to win the game against the best team in the NBA,\" Borrego said. \"The start of the fourth starts with a turnover, and that set the tone for the rest of the quarter. It spiraled from there.\"\nBudenholzer, meanwhile, improved to 100-28 in regular-season games with the Bucks.\nThere was a reason why this victory was such a grind for long periods.\n\"I thought Charlotte was great tonight,\" Budenholzer said. \"Their defense was great.\"\nThere was, naturally, a French feel to the night.\nFormer San Antonio Spurs star Tony Parker was given a huge ovation by the crowd before the game. So was Ronny Turiaf, an NBA champion with the Miami Heat in 2012.\nNicolas Batum, who scored five points for the Hornets, raised his hand to the crowd chanting his name at the end.\nParis Saint-Germain soccer stars Neymar and Kylian Mbappe -- the world's two most expensive players -- were cheering on the Bucks all night.\nFor Antetokounmpo, who is a big fan of PSG and was a guest at the Parc des Princes stadium this week, it was a strange feeling.\n\"It's insane. The crazy part is that we're really big fans of them and they're big fans of the team. You never expect them to know who we are and what we do, and be fans of the Bucks,\" he said. \"But it was amazing they came to the game. They came to the locker room afterwards, we exchanged jerseys, took pictures with them.\"\nTIP-INS\nBucks: This was Milwaukee's second time playing a regular-season game outside of North America. The Bucks beat New York in London on Jan. 15, 2015. ... Antetokounmpo, who will captain one of the teams at the All-Star Game on Feb. 16 in Chicago because he was the leading Eastern Conference vote-getter, is set to become the first player in Bucks history to start four consecutive All-Star Games.\nHornets: When the NBA picked the Hornets to play in the game back on March 28, Charlotte had longtime French star Parker and All-Star guard Kemba Walker on the roster. That was before Parker retired and Walker signed with Boston in free agency.\nUP NEXT\nBucks: Host Washington on Tuesday night.\nHornets: Host New York on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764996065.313471
}