{
  "game_id": "0021600709",
  "espn_id": "400900130",
  "date": "Jan 28, 2017",
  "matchup": "PHX vs. DEN",
  "headline": "Bledsoe scores 41 but Nuggets beat Suns again, 123-112",
  "body": "PHOENIX --  The Denver Nuggets set up residence at the free throw line in the third quarter Saturday night and made the most of their time there.\n\nThe Nuggets sank 18 of 19 free throws in the period to pull away and beat the Phoenix Suns for the second time in three nights, 123-112.\n\n\"Tonight we lived at the line,\" Denver coach Mike Malone said, \"which allowed us to set our defense up, which allowed us to control the tempo and slow them down.\"\n\nDanilo Gallinari scored 32 points and Kenneth Faried had 21 points and 13 rebounds for the Nuggets, winners of three straight and seven of their last nine.\n\nEric Bledsoe scored a career-high 41 for the Suns. Devin Booker added 23.\n\nDenver won despite the absence of center Nikola Jokic, who left with a left hip flexor strain late in Thursday night's 127-120 victory.\n\nThe Nuggets were in the penalty situation with 8:19 still to play in the third quarter.\n\n\"We went to the bonus really early,\" Gallinari said, \"so we had to take advantage of that and give ourselves a chance to get to the free throw line.\"\n\nThey certainly did.\n\nBledsoe didn't have much to say about the Nuggets' foul-line parade.\n\n\"Ask the refs,\" he said.\n\nThe Suns, not surprisingly, were in foul trouble in the quarter. Starting forwards T.J. Warren and Marquese Chriss had five apiece and Booker four. Denver finished the game 37 of 42 at the line.\n\n\"They do a great job just attacking the rim, attacking the paint, putting themselves in bonus situations,\" Suns coach Earl Watson said. \"Same thing happened in the second (quarter) in the game in Denver. The last few games versus them, they shot 70 free throws.\"\n\nPhoenix went to the line more than a few times, too. The Suns were 24 of 32, led by Bledsoe's 14 of 15.\n\nJameer Nelson added 17 points for the Nuggets and Gary Harris 15.\n\nDenver outscored the Suns 36-22 in the third quarter and was up 95-76 when Wilson Chandler scored inside with 1:02 to play. The Suns scored the final seven points of the period to cut Denver's lead to 95-83 entering the fourth.\n\nBut Phoenix never got closer than seven in the final 12 minutes.\n\n\"We played defense,\" Faried said. \"We got back into it, got to the free throw line, we got back in transition. They were getting a lot of open shots and we isolated them and tried to make them take tough shots.\"\n\nEarly, the Suns were off and running.\n\nThey used a 19-3 first-quarter run to go up 29-13 on Brandon Knight's 10-foot floater. The first quarter ended with Phoenix up 33-21 and the Nuggets shooting 33 percent (7 for 21).\n\nBut Denver got it going in the second, outscoring the Suns 15-5 to tie it at 44 when Gallinari converted a three-point play with five minutes left in the half. Denver never quite caught the Suns the rest of the half. Bledsoe's two free throws with 7.6 seconds to play put Phoenix up 61-59 lead at the break.\n\nTIP-INS\n\nNuggets: Jokic is Denver's second-leading scorer at 15.5 points per game and had posted 17 double-doubles in the last 25 games. ..The Nuggets have beaten the Suns six straight times and swept the season series 4-0. ... Denver's only first-half lead was 10-8.\n\nSuns: Bledsoe's previous career high was 40 set in Toronto on Jan. 22. ... Booker scored at least 20 for the 12th straight game, the first player to do so in his first or second season since Blake Griffin did it 14 in a row in 2010-11. ... Phoenix was without rookie Dragan Bender for the third straight game with right ankle soreness.\n\nNOT HIS KNIGHT\n\nKnight struggled through a 1-for-8 shooting night and his team's point differential was a staggering minus-32 when he was on the floor.\n\nUP NEXT\n\nNuggets: Denver is at the Los Angeles Lakers on Tuesday night.\n\nSuns: Phoenix is home against Memphis on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764995963.264897
}