{
  "game_id": "0022301120",
  "espn_id": "401585748",
  "date": "Apr 05, 2024",
  "matchup": "MIA @ HOU",
  "headline": "Butler scores 22 to lead the Heat to a 119-104 victory over the Rockets",
  "body": "HOUSTON -- — Jimmy Butler scored 22 points, and Bam Adebayo had 18 points and 12 rebounds to help the Miami Heat to a 119-104 victory over the Houston Rockets on Friday night.\n\n\r\n              The Heat, who are in seventh place in the Eastern Conference, won for the fourth time in five games and extended their winning streak against Houston to eight. \n\n\r\n              “As we've said all year long, we're always in control of our own destiny,” Butler said. “And so now that's the case more than ever. So it’s good to start by getting on the road and winning. Wins are so very hard to come by no matter who you’re playing against.”\n\n\r\n              The Rockets opened the fourth quarter with an 8-2 run, capped by two 3-pointers by Jalen Green, to cut the lead to 94-91 with about 10 minutes to go.\n\n\r\n              The Heat got 3-pointers from Caleb Martin, Tyler Herro and Jaime Jaquez Jr. in a 20-5 run after that to make it 114-96 with just more than four minutes remaining. \n\n\r\n              Green and Houston coach Ime Udoka received technical fouls during that stretch for yelling at the officials. Jeff Green made a 3-pointer for Houston with about eight minutes left, but the Rockets didn’t score again until a layup by Jock Landale four minutes later. \n\n\r\n              Herro had 17 points, six assists and five rebounds in his return after missing 20 games with knee and foot injuries. He didn’t start but played 25 minutes minutes after coach Erik Spoelstra said he’d be on a minutes restriction.\n\n\r\n              “It’s just great to have him back,” Spoelstra said. “As head coach I didn’t forget what he brings to the table. The skill level, the creativity, the speed... those are all things that we need.”\n\n\r\n              He added that he didn't intend to play Herro as much as he did.\n\n\r\n              “I’ll probably get a stern talking to from the training staff,” Spoelstra said. “The big thing will be how he feels tomorrow.”\n\n\r\n              Jalen Green had 21 points and Dillon Brooks added 18 for the Rockets, who lost their fourth straight game after winning the previous 11.\n\n\r\n              “We just didn't have the pop, the juice, kind of the swag and the bounce that you need to compete at a high level,” Houston's Fred VanVleet said. “We didn't have it.”\n\n\r\n              The Heat were up by five at halftime and used a 7-2 run, with the last four points from Butler, to extend their lead to 77-66 midway through the third.\n\n\r\n              Five straight points by the Rockets, with a 3 by VanVleet, cut the lead to seven later in the third, but Miami scored the next six points to push the lead to 89-76.\n\n\r\n              The Heat led 93-83 entering the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Visit Indiana Sunday.\n\n\r\n              Rockets: Visit Dallas Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995324.753957
}