{
  "game_id": "0022200815",
  "espn_id": "401468970",
  "date": "Feb 06, 2023",
  "matchup": "MIL @ POR",
  "headline": "Bucks beat Trail Blazers 127-108 for 8th straight win",
  "body": "PORTLAND, Ore. -- — Brook Lopez scored 27 points and the Milwaukee Bucks stretched their winning streak to eight games with a 127-108 victory over the Portland Trail Blazers on Monday night. \n\n\r\n              Giannis Antetokounmpo had 24 points and 13 rebounds as the Bucks led the whole way, pushing their advantage to 26 in the second half. \n\n\r\n              Lopez, who pulled down nine rebounds, topped all scorers with 17 points at halftime and Milwaukee led 58-48. He hit a 3-pointer with 10:41 left in the third quarter that gave him 15,000 career points.\n\n\r\n              “I have a long way to still go, a long time to still play. I’m just enjoying it and I want to keep getting better, keep being an effective player out there, being the best player I could be,\" said Lopez, who is in his 14th season. “I’m lucky that there are people that are out there trying to help me, trying to make me better and put me in that position.”\n\n\r\n              Damian Lillard led the Blazers with 28 points. Antetokounmpo and Lillard were selected the NBA's players of the week earlier in the day. \n\n\r\n              Lillard averaged 38.3 points and 6.8 assists last week for his second straight POTW honor, while Antetokounmpo averaged 41 points and 17.3 rebounds. \n\n\r\n              Antetokounmpo started despite right knee soreness. The two-time league MVP had a triple-double with 35 points, 15 rebounds and 11 assists on Saturday to lead the Bucks to a 123-115 victory over Miami. \n\n\r\n              Portland was coming off a 129-121 loss at Chicago on Saturday that snapped a three-game winning streak \n\n\r\n              With center Jusuf Nurkic unavailable because of a left calf strain, the Blazers struggled against the bigger Bucks. \n\n\r\n              Milwaukee led by as many as 15 in the first half, but Lillard drained a 3 from about two feet inside the half-court line that brought gasps and then cheers from the home crowd. \n\n\r\n              The Bucks finished the third period on a 22-8 run to lead 95-71. \n\n\r\n              Portland made just nine of 36 attempts from 3-point range. \n\n\r\n              “They made some adjustments to their defense this year, to be honest with you,\" Trail Blazers coach Chauncey Billups said. \"They used to give up like the most 3s in the league because of that drop coverage. Not this year. I've got to give them a ton of credit. (Bucks coach Mike Budenholzer) has done a really good job. They’re still a really dominant defense but they’re not giving up as many 3s, so you’ve got to work even harder to get those looks.”\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Also won the first of their two meetings with the Blazers this season, 119-111 in Milwaukee. ... It was the opener of a three-game road trip. ... The Bucks' longest winning streak this season is nine games. \n\n\r\n              Trail Blazers: Had only one offensive rebound. ... GM Joe Cronin was among the team representatives at a roundtable with WNBA Commissioner Cathy Engelbert to pitch Portland as a possible WNBA expansion city. Oregon women's coach Kelly Graves and Oregon State coach Scott Rueck were also on hand.\n\n\r\n              SLIGHT ADJUSTMENTS\n\n\r\n              Because of weather-related flight delays that forced the postponement of the Washington Wizards' game at Detroit on Feb. 1, a few adjustments were made to the NBA schedule that impact the Bucks and Blazers. \n\n\r\n              Milwaukee's game at Washington originally set for March 6 was moved to March 5, and Portland's game at Detroit will be played March 6 instead of March 7.\n\n\r\n              The Wizards' makeup game at Detroit is set for March 7. \n\n\r\n              UP NEXT\n\n\r\n              Bucks: Visit the Los Angeles Lakers on Thursday night. \n\n\r\n              Trail Blazers: Host the Golden State Warriors on Wednesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994567.0705001
}