{
  "game_id": "0022400401",
  "espn_id": "401704967",
  "date": "Dec 23, 2024",
  "matchup": "POR @ DAL",
  "headline": "Luka Doncic returns to the lineup and scores 27 as the Mavericks beat the Trail Blazers 132-108",
  "body": "DALLAS -- — Luka Doncic returned from a two-game absence to score 27 points, Daniel Gafford added 23 off the bench and Kyrie Irving finished with 20 as the Dallas Mavericks beat the Portland Trail Blazers 132-108 on Monday night.\n\n\r\n              Doncic shot 10 of 19 overall and 1 for 7 on 3-pointers after missing Dallas’ two previous games with a left heel contusion. He had seven rebounds and seven assists.\n\n\r\n              The Mavericks have won 14 of their last 17 games following their only losing streak of the season, a four-game skid from Nov. 8-14.\n\n\r\n              Deni Avdija scored 19 off the bench to lead the Trail Blazers, who have lost eight of their last nine games. Deandre Ayton scored 16 points, including 10 in the second quarter.\n\n\r\n              The Mavericks opened the second period with a 21-9 run and outscored the Blazers 74-45 in the middle periods. They led by as many as 32 in the fourth quarter.\n\n\r\n              Takeaways\r\n              Trail Blazers: Jerami Grant is averaging 15.5 points, but followed a five-point effort in a 114-94 loss at San Antonio on Saturday with three points in 20 minutes.\n\n\r\n              Mavericks: After matching a season high with eight double-figure scorers in their 113-97 win over the Los Angeles Clippers on Saturday, Dallas had five in double figures by halftime. P.J. Washington’s 12 points in the first half came by hitting all four field goal attempts, two 3-pointers.\n\n\r\n              Key moment\r\n              Klay Thompson rebounded Shaedon Sharpe’s 3-point miss with 17 seconds left in the half, came downcourt and sank a 3-pointer with 8.3 left. That gave Dallas a 62-51 lead, its largest of the half.\n\n\r\n              Key stat\r\n              Thompson needed five 3-pointers to match Reggie Miller for fifth place in all-time 3s, but was 3 for 8.\n\n\r\n              Up next\r\n              The Mavericks host the Minnesota Timberwolves on Christmas. The Trail Blazers start a three-game homestand on Thursday against Utah.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998185.902446
}