{
  "game_id": "0022401064",
  "espn_id": "401705630",
  "date": "Mar 27, 2025",
  "matchup": "OKC vs. MEM",
  "headline": "Gilgeous-Alexander scores 37 as NBA-leading Thunder beat Grizzlies for team-record 61st victory",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 37 points and Oklahoma City defeated the Memphis Grizzlies 125-104 on Thursday night as the Thunder won their eighth straight and team-record 61st game of the season.\n\n\r\n              All-Star guard Jalen Williams scored 20 points in his return for the Thunder after missing seven games with a hip injury. Isaiah Hartenstein added 18 points and 11 rebounds for Oklahoma City (61-12), which remained two games ahead of Cleveland for the league’s best record with nine games to play. The Thunder have clinched the best record in the Western Conference.\n\n\r\n              Jaren Jackson Jr. scored 27 points and Scotty Pippen Jr. added 17 points, 10 rebounds, seven assists and five steals for the Grizzlies. Memphis guard Ja Morant sat out for the sixth straight game with a strained hamstring. \n\n\r\n              Oklahoma City led 63-59 at halftime, then opened the second half on an 8-0 run that forced a Memphis timeout. The Thunder scored one more bucket before the Grizzlies finally got on the board in the third quarter.\n\n\r\n              The Grizzlies clawed back late in the period, and the Thunder lead was 91-89 heading into the fourth.\n\n\r\n              Oklahoma City dominated the fourth. A 3-pointer by Cason Wallace put the Thunder up 112-99, then Hartenstein made a pair of free throws to close out a 15-0 run. \n\n\r\n              Takeaways\r\n              Grizzlies: Memphis could have used a scorer like Morant late, when the offense stagnated. The Grizzlies made 5 of 19 field goals in the fourth.\n\n\r\n              Thunder: Key reserves Alex Caruso (low back soreness) and Jaylin Williams (left hip stiffness) left the game. But the Thunder had more than enough depth.\n\n\r\n              Key mo\r\n              ment\r\n              Oklahoma City's Lu Dort hit a 3-pointer to break a 99-all tie in the fourth. On the next Thunder possession, Hartenstein dunked for a 104-99 lead with just over six minutes remaining.\n\n\r\n              Key stat\r\n              The Thunder made 13 of 23 field goals in the fourth.\n\n\r\n              Up next\r\n              The Grizzlies host the Lakers on Saturday. The Thunder host the Pacers on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997496.977018
}