{
  "game_id": "0022301033",
  "espn_id": "401585661",
  "date": "Mar 25, 2024",
  "matchup": "CHA @ CLE",
  "headline": "Evan Mobley scores 17 as Cavaliers respond after Morris elbow, ejection and handle Hornets 115-92",
  "body": "CLEVELAND -- — Marcus Morris Sr. threw a high, intentional elbow that flattened one of the Hornets.\n\n\r\n              It awakened the Cavaliers.\n\n\r\n              Evan Mobley and Jarrett Allen each scored 17 points, and Cleveland bounced back from an embarrassing loss at Miami 24 hours earlier by beating Charlotte 115-92 on Monday night.\n\n\r\n              Mobley also had a career-high eight assists and seven rebounds in 25 minutes in his second game back after he was sidelined by a sprained ankle. Allen grabbed 13 boards.\n\n\r\n              The Cavs started slowly but took off after Morris, who has earned a tough-guy reputation during 13 seasons in the NBA, got ejected for drilling Charlotte center Nick Richards in the jaw midway through the second quarter.\n\n\r\n              As Richards came into the lane, Morris delivered a head-high blow that wound up swinging the game.\n\n\r\n              While it may have lacked malice, the arm swing had meaning.\n\n\r\n              “I just wanted to be physical,” Morris said. “Like I told the player (Richards), I wasn’t trying to hurt him. I’m just trying to set the tone, man. You’re rolling down the paint, catching lobs and we’re trying to stop that type of (stuff).”\n\n\r\n              Morris, who signed a 10-day contract with the Cavs on March 18, said he was sending a message to his new teammates and the rest of the league.\n\n\r\n              “There's been a lot of grueling games and I was just wanted to toughen us up,” Morris said. “Step in front of it like, listen this is what's going to be expected moving forward, not just for today. Set the precedent going into the playoffs. We're not about to have anybody coming in here and doing what they want to do.\n\n\r\n              “I wanted to play the game, I didn't want to get thrown out, but I definitely wanted to put a little lick on him. I was happy the way we responded.\"\n\n\r\n              The Cavs were blown out by 37 on Sunday by the Heat, who were up 45 at one point. The loss seemed to be rock bottom for a tired Cleveland team dealing with injuries and sliding backwards in the Eastern Conference standings.\n\n\r\n              But a matchup against the struggling Hornets was just what the Cavs needed to stop a three-game losing streak.\n\n\r\n              Georges Niang made five 3-pointers and scored 17 for Cleveland, which had lost six of eight and came in just four games clear of a play-in spot after being among the East's top teams for months.\n\n\r\n              Brandon Miller scored 24 points and Miles Bridges had 13 for Charlotte. The 17-win Hornets have dropped five straight and 12 of 14. Charlotte's schedule hasn't helped with 13 of 17 games on the road since the All-Star break.\n\n\r\n              “I’ve been in the league for 20 years and I’ve never seen a stretch like this,\" Hornets coach Steve Clifford said. \"We need to get home, get refreshed and try to finish on a high note.”\n\n\r\n              Mobley scored 11 points in the third quarter to help the Cavs maintain the double-digit lead they built late in the second. Charlotte was still within 12 early in the fourth when Sam Merrill made back-to-back 3s to give Cleveland some breathing room.\n\n\r\n              For one of the few times in recent weeks, the Cavs played with a joy that has been missing. Cleveland finished with 41 assists on 46 made field goals.\n\n\r\n              Morris could hear from the league for his Flagrant-2 foul, but felt the Cavs needed it.\n\n\r\n              “I never really want to get ejected from a game,” he said. \"I still want to help my team, but I’m just happy we responded really well. Going forward, man, like I told the team, each of these games got to be treated like the playoffs.\n\n\r\n              \"So if I got to lay somebody out every game, and we’re going to respond like that, then so be it.”\n\n\r\n              The Cavaliers remain without All-Star guard Donovan Mitchell, who has been out with a broken nose and bruised left knee.\n\n\r\n              Mitchell has played in just five of 19 games since the break, and the Cavs have only had their starting lineup on the floor for 44 minutes since mid-February due to injuries.\n\n\r\n              Cleveland guard Max Strus (knee) missed his 12th straight game with an injury of unknown extent, and Dean Wade (knee) sat out his fourth in a row.\n\n\r\n              NEXT UP\n\n\r\n              The teams will meet again on Wednesday in Charlotte, and a third time in Cleveland's home finale on April 14.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995939.871681
}