{
  "game_id": "0022300389",
  "espn_id": "401585017",
  "date": "Dec 23, 2023",
  "matchup": "LAC vs. BOS",
  "headline": "Jayson Tatum, Jaylen Brown lead Celtics to a 145-108 rout of the Clippers",
  "body": "LOS ANGELES -- — Jayson Tatum scored 30 points, Jaylen Brown added 24 and the Boston Celtics kicked off their Christmas weekend in Southern California with a 145-108 victory over the Los Angeles Clippers on Saturday.\n\n\r\n              Jrue Holiday had 20 points and seven assists as the Celtics shot 25 of 53 from 3-point range (47.2%) to win for the seventh time in eight games and for the 10th time in 12 games.\n\n\r\n              “I think when we get out into the open court, we're a pretty tough team with the type of firepower and the offensive ability we have on this team,” said Holiday, an Los Angeles-area native who will be home at Christmas for the first time in his NBA career. “We have shooters, we have guys who can penetrate and make plays. Once we make stops and get the rebound, we're pushing as quickly as possible and it's to our benefit.”\n\n\r\n              Boston shot 52.1% overall in the same arena where it will play a Christmas Day rivalry showdown against the Los Angeles Lakers.\n\n\r\n              Despite the impressive showing against a budding power in the Western Conference in the Clippers, Celtics head coach Joe Mazzulla downplayed the victory.\n\n\r\n              “I do not consider it a statement win,” Mazzulla said. “I consider it a win (and) an opportunity where we played well and continue to figure out where we didn't play well. We left a lot on the table as far as our execution and the things we want to accomplish.”\n\n\r\n              Paul George scored 21 points and James Harden added 14 points and 10 assists as the Clippers were without Kawhi Leonard for a second consecutive game due to a left hip contusion. Los Angeles has lost both games following a nine-game win streak.\n\n\r\n              Ivica Zubac had 16 points and 10 rebounds for the Clippers, who were playing the first of four straight home games.\n\n\r\n              “We were tested a lot,” Clippers head coach Tyronn Lue said when asked about his defense. “They lead the league in 3-point attempts and all of their guys can shoot them. Coming into the game, we discussed it. Even when you think they're not going to shoot it, they're going to shoot it.”\n\n\r\n              The Celtics held a 28-21 lead after one quarter, while setting the tone for the game with 18 attempts from 3-point range and making six. Boston’s shooting picked up in the second quarter. The Celtics went 9 of 15 (60%) from long distance while taking a 68-51 lead into the break.\n\n\r\n              Tatum avoided an injury scare in the second quarter and finished off a four-point play in the process when he made a 3-pointer with 4:19 remaining in the first half before rolling his left ankle when he stepped on the foot of Kobe Brown. He made the ensuing free throw for a 59-40 lead.\n\n\r\n              Boston increased its lead to 92-62 with 5:01 remaining in the third quarter on a pair of free throws from Tatum and cruised from there.\n\n\r\n              Turning defense into offensive opportunities has allowed the Celtics to score just shy of 300 points over the last two games, without the benefit of overtime. If not a statement game, is this the best the Celtics have played of late?\n\n\r\n              “I think so, but not because of the points but because of the execution,” Mazzulla said. “I do like the fact that we're developing a fast-paced identity and not turning it over. I think at times in the past, we've played fast but turned it over so we're finding a good balance of pace and execution.”\n\n\r\n              Neemias Queta had 14 points and 12 rebounds for the Celtics, who outrebounded the Clippers 60-39. Boston’s Derrick White scored 18 points after averaging 29 points over the previous two games.\n\n\r\n              Without Leonard as the focal point at both ends of the floor, the Clippers shot 46.1% from the floor and went 11 of 34 (32.4%) from 3-point range. Daniel Theis scored 15 points for Los Angeles, while Brandon Boston Jt. had 13 and Russell Westbrook 12.\n\n\r\n              “Hopefully we're back healthy and see what the takeaways were from the last two games and go from there,” George said of the Clippers moving forward after consecutive defeats. “We're in a great spot. We were winning up until the two losses. ... It doesn't derail us from where we're headed and where we're trying to get to.”\n\n\r\n              The Celtics were without Kristaps Porzingis (left ankle sprain) for the third time in five games.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At the Los Angeles Lakers on Monday.\n\n\r\n              Clippers: Host the Charlotte Hornets on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996556.2016041
}