{
  "game_id": "0022300310",
  "espn_id": "401584938",
  "date": "Dec 13, 2023",
  "matchup": "PHI @ DET",
  "headline": "Joel Embiid scores 41 points, 76ers hand Pistons 21st straight loss",
  "body": "DETROIT -- — Joel Embiid scored 30 of his 41 points in the first half and the Philadelphia 76ers handed the Detroit Pistons their 21st straight loss, 129-111 on Wednesday night to open a home-and-home series.\n\n\r\n              Embiid also had 11 rebounds. He's averaging 40.8 points and 12.3 rebounds in his last four games.\n\n\r\n              “He's been in that vibe on game days, non-game days and everything lately,” 76erss coach Nick Nurse said. “He's scoring in a lot of different ways, which is good. He's giving (defenses) some variety and unpredictability.”\n\n\r\n              Detroit matched the longest streak in franchise history, set at the end of the 1979-80 season and start of 1980-81. It is the sixth-longest single-season losing streak in the NBA.\n\n\r\n              “I don't want anyone to be happy in this situation,” Pistons coach Monty Williams. “I want to see an ornery locker room that's tired — not just of losing, but tired of missing shots and tired of giving up 39-point quarters.”\n\n\r\n              Only the 2010-11 Cleveland Cavaliers and the 2013-14 76ers (both lost 26 straight), along with the 1995-96 Vancouver Grizzlies, the 1997-98 Denver Nuggets and the 2011-12 Charlotte Bobcats (all lost 23 in a row) have lost more games in a row in a season. Philadelphia holds the overall mark of 28, set at the end of 2014-15 and start of 2015-16.\n\n\r\n              Detroit dropped to 2-22, with the teams set to meet again Friday night in Philadelphia. Bojan Bogdanovic led the Pistons with 33 points, and Cade Cunningham had 21.\n\n\r\n              Former Piston Tobias Harris added 21 points for Philadelphia and Kelly Oubre Jr. had 17. The 76ers outrebounded Detroit 52-35.\n\n\r\n              “I like (Kelly's) shooting and his confidence,” Nurse said. “He made a couple threes that were pretty heavily guarded. That comes in handy sometimes when you are searching a little bit for offense.”\n\n\r\n              The 76ers led 70-56 at the half and pushed the margin to 18 in the first four minutes of the third. Detroit, playing a small-ball lineup with starting center Jalen Duren injured, struggled to keep Philadelphia off the boards.\n\n\r\n              “Rebounding has been a point of emphasis for 24 games — even back into the preseason,” Williams said. “We have to be able to be a team that can finish a play.”\n\n\r\n              Detroit missed all seven 3-pointers in the quarter and had starting power forward Isaiah Stewart ejected for a flagrant-2 foul on Patrick Beverley. The 76ers led 104-80 at period's end and by 30 with Embiid on the bench in the fourth.\n\n\r\n              “We tried our best,” said Pistons center James Wiseman, who fouled out in 16 minutes against Embiid. “I took on the challenge and tried to contain him. We didn't back down from him.”\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996430.651443
}