{
  "game_id": "0022200100",
  "espn_id": "401468255",
  "date": "Oct 31, 2022",
  "matchup": "MIL vs. DET",
  "headline": "Holiday delivers as Bucks nip Pistons 110-108, stay unbeaten",
  "body": "MILWAUKEE -- — Jrue Holiday made sure the young and pesky Detroit Pistons wouldn't take down an NBA heavyweight for a second straight night.\n\n\r\n              Holiday delivered one of the step-back jumpers that make his teammates marvel as he connected on a tiebreaking 3-pointer with 45.3 seconds left in the Milwaukee Bucks' 110-108 victory over the Pistons on Monday night. Holiday finished with 25 points, 10 assists and seven rebounds.\n\n\r\n              “He's just a magician with it, man, the type of step-backs he does,” said Milwaukee's Bobby Portis, who had 15 points and 12 rebounds.\n\n\r\n              Giannis Antetokounmpo scored 31 points and Brook Lopez had 24 to help the Bucks (6-0) remained the NBA’s lone undefeated team. Cade Cunningham scored 27 points and Bojan Bogdanovic added 23 for the Pistons.\n\n\r\n              One night after beating the defending champion Golden State Warriors to snap a five-game skid, the young Pistons (2-6) nearly pulled off an equally surprising victory. \n\n\r\n              Detroit’s starting lineup included only one player (the 33-year-old Bogdanovic) who is older than 23. Three of the Pistons’ starters were 21 or younger. All five of the Bucks’ starters were at least 27, including the 34-year-old Lopez and 32-year-old Holiday.\n\n\r\n              “A lot of talented guys there learning how to play, but they've been learning quickly and getting a lot better,” Lopez said. “They're definitely better than their record.”\n\n\r\n              Although they never led, the Pistons rallied from a 16-point deficit to tie the score at 105-all when Cunningham found Isaiah Stewart under the basket with 57.6 seconds left. Holiday answered by sinking a 26-footer on Milwaukee’s next possession while being guarded by Pistons rookie Jaden Ivey.\n\n\r\n              “Great players make great plays,” Pistons coach Dwane Casey said. “Holiday made a great shot.”\n\n\r\n              After Cunningham missed a shot that would have cut the Bucks’ lead to 108-107 with about 35 seconds left, Detroit got one more chance when Bogdanovic stole the ball from a driving Antetokounmpo with less than 15 seconds left.\n\n\r\n              The Pistons didn't call a timeout and instead worked the ball to an open Cunningham, whose 3-point attempt with about five seconds left bounced off the side of the rim. \n\n\r\n              “I don’t know if I could have drawn up a better play for Cade to be open as much as he was open,” Casey said. “And the shot before that, he was wide open in his sweet spot. You’ve got to live with that.”\n\n\r\n              Lopez hit two free throws with 1.5 seconds remaining to seal the victory before Bogdanovic made a 3-pointer at the buzzer to complete the scoring.\n\n\r\n              Detroit was missing rookie center Jalen Duren, who sprained his left ankle Sunday in a 128-114 victory over the Warriors that snapped a five-game skid. Duren, the 13th overall pick in the 2022 draft, has averaged 7.4 points and 6.7 rebounds. \n\n\r\n              Ivey scored 19, Hamidou Diallo 13, Stewart 11 and Saddiq Bey 10 for the Pistons. \n\n\r\n               TIP-INS\n\n\r\n              Pistons: Bogdanović’s contract extension was officially announced Monday. Although the team didn’t disclose terms, Bogdanovic has agreed on a two-year, $39.1 million contract. Casey said it's important for any young team to also have some veterans on the roster. “He fits in,\" the coach said before the game. \"He’s patient. He’s sharing his knowledge with the players, things that he’s seen over his career.”\n\n\r\n              Bucks: Grayson Allen exited with a bruised left knee in the third quarter. ... The Bucks missed their first 14 3-point attempts of the second half and finished 11 of 40 from beyond the arc. ... Antetokounmpo was named the Eastern Conference player of the week on Monday. The two-time MVP averaged 35.7 points, 15 rebounds, 6 assists and 1.7 blocks in the Bucks' three games last week. \n\n\r\n              UP NEXT\n\n\r\n              This was the first of two consecutive matchups between these two teams. Wednesday’s rematch will end a season-high, six-game homestand for the Bucks.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994606.9831722
}