{
  "game_id": "0021900486",
  "espn_id": "401161128",
  "date": "Dec 29, 2019",
  "matchup": "TOR vs. OKC",
  "headline": "Gilgeous-Alexander, Paul lead Thunder past Raptors",
  "body": "TORONTO --  Shai Gilgeous-Alexander came home to Canada and matched his career high by banking in the winning basket.\n\nGilgeous-Alexander scored 32 points, Chris Paul had 25 points, 11 rebounds and eight assists and the Oklahoma City Thunder beat the Toronto Raptors 98-97 on Sunday night for their sixth win in seven games.\n\n\"It feels good but all of it, honestly, wouldn't have meant anything if we didn't win,\" Gilgeous-Alexander said. \"That was the best feeling, knowing that we came out of here with a win.\"\n\nNerlens Noel added 13 points and Darius Bazley had 11 to help the Thunder win their fifth straight in Toronto. Oklahoma City has won 11 of 15 overall.\n\n\"With a team like us that's fighting night in and night out to stay above .500, it's a great feeling,\" Paul said. \"They're the defending champs, they know how to win close games, and we pulled this one out.\"\n\nKyle Lowry and Fred VanVleet each scored 20 points and Serge Ibaka had 12 points and 14 rebounds for the Raptors. Toronto lost for the third time in four games.\n\nPatrick McCaw scored 13 points and Terence Davis had 11 for Toronto.\n\nGilgeous-Alexander made the go-ahead basket on a jump shot with 36 seconds left in the fourth quarter, then grabbed the rebound on a missed 3-pointer by VanVleet.\n\n\"He's been excited to come back,\" Paul said about his third-year teammate. \"Everybody here in Canada, know you all got a real one.\"\n\nBorn in Toronto and raised in nearby Hamilton, Gilgeous-Alexander has scored 32 points three times in his past five games.\n\n\"This one might be the best one so far,\" he said.\n\nLowry said he was impressed with Gilgeous-Alexander, who has scored 20 or more in six straight games.\n\n\"He played like he was home tonight,\" Lowry said. \"Honestly, he's been playing unbelievable. His confidence, his patience, his pace has been great.\"\n\nThunder coach Billy Donovan said he's seen Gilgeous-Alexander mature as an offensive threat during his recent run.\n\n\"He's finding his areas where he can score,\" Donovan said. \"He's figuring out, inside of our offense, when there's good times to really go attack and be aggressive.\"\n\nGilgeous-Alexander's winning basket was the sixth straight scoring play to change the lead in a tight final quarter. The lead changed 20 times in the game, including nine times in the fourth, and the teams were tied on 10 occasions.\n\nTIP-INS\n\nThunder: G Dennis Schroder (right ankle) was inactive. It's the first game Schroder has missed this season. . F Danilo Gallinari (left ankle) sat for the fourth straight game.\n\nRaptors: Starters Pascal Siakam (groin), Marc Gasol (hamstring) and Norman Powell (shoulder) all sat for the sixth straight game. The Raptors are 3-3 without them. ... Toronto was also without G Matt Thomas (left middle finger) and C Dewan Hernandez (right ankle). . The Raptors shot 12 for 12 at the free throw line, led by six from Lowry.\n\nO CANADA!\n\nGilgeous-Alexander set a record for points by a Canadian player against Toronto. Rick Fox and Andrew Wiggins had each scored 31 against the Raptors.\n\nPaul joked that becoming a record-holder might swell Gilgeous-Alexander's head.\n\n\"Oh man, we ain't going to hear the end of that,\" Paul said.\n\nSERIOUSLY SLOPPY\n\nThe teams combined to make 34 turnovers, 17 apiece. Toronto scored 13 points off turnovers, while the Thunder scored 21.\n\nUP NEXT\n\nThunder: Host Dallas on Tuesday night.\n\nRaptors: Host Cleveland on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and\n\nhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995619.610089
}