{
  "game_id": "401809986",
  "espn_id": "401809986",
  "date": "Oct 29, 2025",
  "matchup": "TOR vs HOU",
  "headline": "Kevin Durant scores 31 as Rockets thump struggling Raptors 139-121 for 2nd straight win",
  "body": "TORONTO -- — Kevin Durant scored 31 points, Jabari Smith Jr. added a season-high 25 and the Houston Rockets thumped the struggling Toronto Raptors 139-121 on Wednesday night.\n\n\r\n              Alperen Sengun had 18 points, nine assists and eight rebounds as the Rockets won their second straight after starting the season with back-to-back losses.\n\n\r\n              Amen Thompson scored 18 points and Tari Eason added 14 points for the Rockets. Steven Adams scored 12 points and led Houston with 12 rebounds.\n\n\r\n              Houston outrebounded Toronto 53-22. Seven Rockets players had five or more rebounds. \n\n\r\n              Durant finished 11 of 19 from the field and 4 of 8 from 3-point range.\n\n\r\n              Scottie Barnes scored 31 points and Brandon Ingram matched his season high with 29 for Toronto, which lost its fourth straight after winning its season opener at Atlanta. All four defeats have been by 10 points or more.\n\n\r\n              With Jakob Poeltl (sore lower back) out of the lineup, Raptors rookie Collin Murray-Boyles scored 13 in his first career start.\n\n\r\n              Immanuel Quickley had 15 points for Toronto, and RJ Barrett and Sandro Mamukelashvili each scored 10.\n\n\r\n              The Raptors made a season-best 21 of 40 from long range. Eight of Toronto’s baskets in the second quarter were 3s.\n\n\r\n              The Rockets took the lead for good by closing the first half on an 11-0 run and then opened the third quarter with a 14-4 run. Houston led 84-67 with 8:12 left in the third, its biggest advantage.\n\n\r\n              The Rockets were up 106-91 after three and maintained a double-digit edge for all but 19 seconds of the fourth.\n\n\r\n              Toronto’s past three losses have all been against Texas teams. The Raptors lost at Dallas last Saturday and were beaten at San Antonio on Sunday.\n\n\r\n              Up next\r\n              Rockets: At Boston on Saturday.\n\n\r\n              Raptors: At Cleveland on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042521.8995001
}