{
  "game_id": "0021500470",
  "espn_id": "400828357",
  "date": "Dec 29, 2015",
  "matchup": "HOU vs. ATL",
  "headline": "Horford leads Hawks to 121-115 win over the Rockets",
  "body": "HOUSTON -- With their star 3-point sharpshooter stuck in an 0-for-18 slump, the other four Atlanta Hawks starters carried the load on Tuesday night.\nIn the 121-115 road win over the Houston Rockets, Atlanta overcame both a 19-point deficit and the detrimental shooting woes of Kyle Korver.\nAl Horford had 30 points and 14 rebounds, Kent Bazemore had 26 points and Paul Millsap and Jeff Teague both added 22 as the Hawks won for the seventh time in eight games. Korver had just two points, making both free throw attempts.\nKorver's slump continued for Atlanta. After going 0-for-8 from the 3-point line on Monday night in Indiana, he missed all 10 against Houston. Korver is 2 for 26 in his last four games, one of the worst shooting stretches of his career. After leading the league in 3-point percentage last season at 49.2 percent, Korver is having his worst shooting season in nearly six years, shooting under 39 percent.\n\nDespite Korver's off shooting, he found other ways to contribute.\n\"Kyle was instrumental in letting us know to stay strong, keep playing and not get discouraged, and I honestly think that's what put us over the top,\" Horford said. \"He's going to do other things to help us. I'll give him 10 more 3s, and I'll live with every one of them because he's our best option.\"\nKorver was unavailable for comment after the game.\nAtlanta took a lead late in the fourth quarter and employed the hack-a strategy, intentionally fouling Dwight Howard and Clint Capela repeatedly. The strategy was largely successful until Howard made a free throw to take the lead with just over two minutes remaining.\nAtlanta then scored the final nine points of the game to steal the road victory.\nHoward led Houston with 30 points and 16 rebounds, while James Harden had 26 points, 10 rebounds and eight assists.\n\"We're all frustrated,\" Rockets coach J.B. Bickerstaff said. \"We're not getting the results we would like. There wasn't a lack of effort. It wasn't a lack of trying. Guys did the right things. We just didn't make the plays when we needed to make the plays.\"\nPlaying in their third back-to-back in less than three weeks, the weary Hawks allowed a season-high 41 first-quarter points. Houston led 71-56 at halftime, but Atlanta's defense buckled down in the third quarter, cutting the lead to seven to enter the fourth.\nHouston scored a season-high 71 points in the first half, thanks in large part to a 73 percent clip from beyond the arc.\n\"We couldn't guard them, we couldn't keep them in front of us, they were very, very good, and they got everything they wanted,\" Hawks coach Mike Budenholzer said. \"In the second half, I think we played better defensively, kept them in front of us better and had a lot of guys step up on the offensive end.\"\nTIP-INS\nHawks: C Tiago Splitter missed his second straight game with a mild right calf strain but is expected to return Sunday when the Hawks visit the Knicks. ... Paul Millsap had a season-high five blocked shots. ... Atlanta had 10 steals and forced 19 turnovers.\nRockets: Houston was without PF Terrence Jones, who was sidelined with an illness after being a game-time decision. ... The Rockets have now lost four straight against Atlanta. ... Houston put an emphasis on its post-up game and played two centers for much of the game but was outscored 50-46 in the paint.\nFINGER WAG\nNBA Hall of Famer Dikembe Mutombo was in attendance and sat courtside to watch two of his former teams. Mutombo, who was inducted into the Basketball Hall of Fame in September, played five seasons with both Atlanta and Houston across his 18-year career.\nTAVARES SPIKE\nThe Hawks bench enjoyed a hearty laugh late in the second quarter when 7-foot-3-inch rookie center Walter Tavares was fighting for a rebound with Dwight Howard and slapped the missed shot volleyball-style more than 30 feet into the second row seats. Tavares was taken out of the game for Al Horford and he couldn't help but grin about the embarrassing play with his teammates on the bench.\n\"He made a few plays, rebounded and made a couple of plays he'll learn from, and he'll be better the next time he plays so it was great to see him get in a game,\" Budenholzer said.\nUP NEXT\nHawks: At New York on Sunday.\nRockets: Host Golden State on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994641.046551
}