{
  "game_id": "0022000015",
  "espn_id": "401267175",
  "date": "Dec 23, 2020",
  "matchup": "CHI vs. ATL",
  "headline": "Young scores 37 as Hawks pound Bulls 124-104 in opener",
  "body": "CHICAGO -- — Trae Young was tough to stop in his first two NBA seasons. Surrounded by more talent than ever before, he could become a nightmare for the league in his third year. \n\n\r\n                    Young scored 37 points and the revamped Atlanta Hawks pounded Chicago 124-104 on Wednesday night, spoiling Billy Donovan's debut as Bulls coach.\n\n\r\n                    “Just being able to go out there and put on a show in the first game was really good,” Young said. “Not every night obviously is going to be like this, but it's really good to have an opening game like this.”\n\n\r\n                    Atlanta shot 54% (43 for 80) from the field and had seven players score in double figures. Cam Reddish had 15 points and John Collins finished with 14.\n\n\r\n                    “All of our guys played well. All of our guys played together,” coach Lloyd Pierce said.\n\n\r\n                    Looking for their first playoff berth since 2017, the Hawks signed Bogdan Bogdanovic, Danilo Gallinari, Rajon Rondo and Kris Dunn during free agency. Rondo and Dunn were held out on opening night, but Bogdanovic had 15 points and seven rebounds, and Gallinari scored 13.\n\n\r\n                    While the newcomers could give Atlanta a big lift, the dynamic Young remains the engine that drives the Hawks. He seemingly scored at will against the Bulls, going 10 for 12 from the field, 5 for 6 from 3-point range and 12 for 14 at the line. He also had seven assists and six rebounds in just 26 minutes.\n\n\r\n                    “The way we spaced, it opened up a lot of driving lanes and gaps to the rim for either shots at the rim or if they helped, we had shooters open,” Young said.\n\n\r\n                    Chicago cleaned out its front office and fired coach Jim Boylen after it went 22-43 last year during its third consecutive losing season. Donovan was hired in September, and it looks as if he has quite the job ahead of him.\n\n\r\n                    Zach LaVine scored 22 points and Lauri Markkanen had 21 points and seven rebounds in a solid start to an important season for the 23-year-old forward. But the Bulls struggled defensively and were careless with the ball at times, finishing with 17 turnovers.\n\n\r\n                    “We did not help each other well enough defensively,” Donovan said.\n\n\r\n                    Patrick Williams, the No. 4 overall pick in this year's draft, had 16 points for Chicago in his NBA debut. The 19-year-old Williams became the youngest player in Bulls history to start their first game of the season.\n\n\r\n                    Young led the way as Atlanta grabbed control in the first half. He found Collins for an alley-oop jam that made it 66-46 with 4:49 left. He had 27 points on 7-for-9 shooting at the break, helping the Hawks to an 83-59 halftime lead.\n\n\r\n                    “We just didn't come to play as a team,” Bulls center Wendell Carter Jr. said. \n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Dunn (right knee) missed the game against his former team. Dunn played for the Bulls for the past three seasons before signing a $10 million, two-year contract with the Hawks in free agency. “He's just at a point where he's trying to get right,” Pierce said. “He's been doing some non-contact activity.” ... C Clint Capela (left Achilles soreness) and Rondo (health and safety protocols) also were held out. Asked if it could be a lingering issue with Capela, Pierce said: “No, I just thought he was sore.”\n\n\r\n                    Bulls: F Thaddeus Young missed the opener because of an infection in his lower left leg. ... Donovan didn't reveal his starters until right before his first game. He went with Williams, Markkanen, LaVine, Carter, and Coby White, but he said staying flexible is important this year because of COVID-19 protocols. “I think we've got to do a good job, players and coaches, of making sure we're all staying ready,\" he said. \n\n\r\n                    ROOKIES\n\n\r\n                    While Williams started in his NBA debut, Atlanta rookie Onyeka Okongwu was sidelined by a foot injury. Okongwu, a 6-foot-9 center from Southern California who was selected by the Hawks with the No. 6 pick in the draft, will be re-evaluated on Monday, the day of Atlanta’s home opener against Detroit.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Visit Memphis on Saturday. They dropped both of their games against the Grizzlies last season.\n\n\r\n                    Bulls: Look to stop a nine-game losing streak against Indiana when they host the Pacers on Saturday night.\n\n\r\n                    ------\n\n\r\n                    Jay Cohen can be reached at https://twitter.com/jcohenap\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997611.427497
}