{
  "game_id": "0022400813",
  "espn_id": "401705379",
  "date": "Feb 23, 2025",
  "matchup": "LAC @ IND",
  "headline": "Haliburton's 16th double-double leads Pacers past Clippers 129-111",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton had 29 points and 12 assists for his 16th double-double of the season, Aaron Nesmith scored a season-high 19, and the Indiana Pacers defeated the Los Angeles Clippers 129-111 on Sunday.\n\n\r\n              Haliburton scored 17 points in the third quarter, when the Pacers (32-23) took a 101-83 lead. The All-Star point guard shot 9 of 14 overall with four 3-pointers.\n\n\r\n              The Pacers, who are an NBA-best 16-5 in 2025, had seven players score in double digits. Indiana center Myles Turner returned from a three-game injury absence with 17 first-half points.\n\n\r\n              The short-handed Clippers (31-25) were without leading scorer Norman Powell (left knee soreness) and No. 3 scorer Kawhi Leonard (left foot soreness). Powell averages 24.2 points per game, and Leonard 16.9.\n\n\r\n              That meant veteran All-Star guard James Harden looked to take more shots — he went 9 of 17 with six 3s to finish with 31 points and 11 assists. Ivica Zubac added 22 points.\n\n\r\n              Takeaways\r\n              Clippers: Leonard has played in just 16 games this season, but Powell's absence proved problematic. The lack of scoring options became increasingly evident as Los Angeles steadily fell behind.\n\n\r\n              Pacers: It's an ideal time to make a run, with two more home games this week and Indiana riding a three-game winning streak. And it helps to have Turner back after he missed three games with a cervical strain.\n\n\r\n              Key moment\r\n              Haliburton buried 3-pointers on three consecutive third-quarter possessions as the Pacers opened a 90-69 lead.\n\n\r\n              Key stat\r\n              Indiana made 13 of 20 shots to outscore Los Angeles 35-28 in the third quarter. The Pacers finished 46-of-84 shooting (54.8%).\n\n\r\n              Up next\r\n              The Clippers visit Detroit on Monday. The Pacers host Denver on Monday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997945.1698308
}