{
  "game_id": "0021701120",
  "espn_id": "400975866",
  "date": "Mar 28, 2018",
  "matchup": "ATL @ MIN",
  "headline": "Karl-Anthony Towns' franchise-record 56 leads Wolves over Hawks",
  "body": "MINNEAPOLIS -- Karl-Anthony Towns stood up and stared at a printout of the box score of Minnesota's game against the Atlanta Hawks.\nThere was a lot for Towns to admire.\nTowns scored a franchise-record 56 points and added 15 rebounds for his league-leading 63rd double-double, and the Timberwolves beat the Hawks 126-114 on Wednesday night.\n\"I just realized the ball kept coming to me more and more often,\" Towns said. \"I guess that was a sign to shoot the ball. Everyone just kept telling me, 'You need six more, you need eight more, for 50.' I wasn't really thinking about that. I was just trying to find a way to win.\"\nTowns was 6-of-8 from 3-point range and added four assists for Minnesota, which recovered after a disappointing loss Monday to the lowly Memphis Grizzlies and trailing last-place Atlanta throughout the first quarter.\nTowns shot 19-of-32 from the field and 12-of-15 from the free throw line. He had 30 points and 11 rebounds in the second half.\n\"You just start passing, sitting back and just watching,\" teammate Andrew Wiggins said. \"Just watching the show.\"\nWiggins added 17 points and Jeff Teague had 11 points and eight assists for the Timberwolves, who avoided a third straight loss by shooting 53.3 percent, including 13-of-30 from behind the arc. Minnesota (43-33) pulled ahead of Utah into seventh place in the West after the Jazz lost at home to Boston.\nMike Muscala had a career-high 24 points off the bench for Atlanta, which stayed within striking distance of the Wolves by hitting 13-of-27 from 3. Dewayne Dedmon had 13 points and 12 rebounds for the Hawks. Atlanta has lost 10 of its past 11 games.\n\"We went on a good little run there,\" Muscala said. \"I thought we moved it well in transition and got some good looks from 3 and everything, and guards did a good job penetrating, finding open shooters and finishing at the rim. But yeah, obviously huge game for KAT, and they also hit some really timely 3s, too.\"\nThe Wolves stretched the lead to 16 in the second half, but the Hawks started to chip away in the fourth. Isaiah Taylor had nine points and Atlanta went on a 14-4 run to close within 110-104 on a 3 by Muscala.\nTowns missed five shots during the run, but he went back to work and finished with his first 50-point game and the fourth in team history.\n\"I think the biggest thing that stands out is the way he shot the 3-ball,\" Atlanta coach Mike Budenholzer said. \"To go 6-for-8, his size, is just impressive. Then he gets fouled on a 3-point shot, that's 21 points right there just outside the 3-point line for a guy that's 6-10, 6-11, 7-feet, whatever he is.\"\nTIP-INS\nHawks: Starting SG Damion Lee left the game with a dislocated pinkie finger on his right hand, according to the team's Twitter account, but later returned. ... PG Dennis Schroder missed his second straight game with a left ankle sprain. ... Atlanta now has 835 3s this season, adding to its franchise record. The Hawks started the day 10th in the league in 3s per game.\nTimberwolves: PG Derrick Rose missed his fourth straight game with a sprained right ankle. C Cole Aldrich missed his second straight game with an illness. ... All-Star Jimmy Butler took shots in practice and has been trying to work his way back from meniscus surgery on his right knee. Coach Tom Thibodeau said Butler still hasn't been cleared for contact and there is no timetable for his return. ... Tre Jones was named Mr. Basketball as the top prep player in Minnesota in an announcement during the third period. Jones, the brother of Wolves G Tyus Jones, is set to play at Duke next year, following in Tyus' footsteps. ... Minnesota has allowed its opponents to hit 53 3s over the past four games and at least 12 a game in five of the last six games.\nA BIT UNLIKELY\nWhile Towns entered the game averaging 20.7 points this season and 21.4 per game for his career, the big night was a bit of an aberration. The All-Star center set a career high with the 32 field-goal attempts, four more than any previous game.\nTowns entered the game third on the Wolves in shots per game this season behind Butler and Wiggins. Towns was averaging 13.9 shots per game.\n\"I'm not used to shooting that many shots,\" Towns said.\nMUSCALA'S CAREER NIGHT\nMuscala had his big night back in Minneapolis, where he grew up in the nearby suburb of St. Louis Park. He was 8-of-10 from the floor, including 4-of-6 from 3. He also had to defend Towns for part of the night.\n\"It's a little bittersweet,\" Muscala said. \"Obviously lost and couldn't get more stops on Karl-Anthony Towns, but it was still a fun game, I feel like. Give the fans some good things to watch, and it was cool to have family and friends in the stands.\"\nUP NEXT\nHawks: Host Philadelphia on Friday.\nTimberwolves: At Dallas on Friday.",
  "source": "espn_api",
  "crawled_at": 1764993734.760867
}