{
  "game_id": "0022000577",
  "espn_id": "401307360",
  "date": "Mar 11, 2021",
  "matchup": "PHX @ POR",
  "headline": "Devin Booker scores 35 points, Suns beat Blazers 127-121",
  "body": "Devin Booker returned from the knee injury that kept him out of the All-Star Game to score 35 points and the Phoenix Suns beat the Portland Trail Blazers 127-121 on Thursday night for their fifth straight victory.\n\n\r\n                    Chris Paul added 19 points for Phoenix, and Mikal Bridges scored 16 of his 18 points in the first half. Second in the NBA behind the Utah Jazz, the Suns have won 17 of their last 20 games. \n\n\r\n                    It was Booker’s 100th career game with 30 or more points. Paul, who didn’t think Booker would play Thursday night, called it “smooth.”\n\n\r\n                    Phoenix outscored the Blazers 37-27 in the final period.\n\n\r\n                    “I think we had some good energy going into the fourth quarter,” Booker said. “We were really animated in the huddle right before the fourth quarter. I was saying ‘This is winning time, time to lock in.’ That’s what we did.”\n\n\r\n                    Damian Lillard had 30 points for Portland, and Enes Kanter added 16 points and 11 rebounds. They had won three in a row. \n\n\r\n                    The Suns trailed by 11 points in the third quarter, but pulled to 96-95 early in the fourth on Abdel Nader's 3-pointer. Cameron Payne followed up with a 3 of his own to put Phoenix in front. \n\n\r\n                    Paul's 3 stretched the Suns' lead to 104-99 with 7:44 left. Booker added another with five minutes to go that made it 114-104 and Portland couldn't catch up. \n\n\r\n                    Booker did not play in the All-Star Game on Sunday night because of a sprained left knee, which he injured in the Suns' 120-98 victory at home over Golden State.\n\n\r\n                    “He comes out focused on the task at hand,” Payne said. “It’s amazing to watch — even as a teammate — to see him get going.”\n\n\r\n                    Booker was fouled late in the fourth quarter against the Blazers and came up limping after falling to the floor, but he remained in the game. Suns coach Monty Williams said that Booker “seemed OK,” following the game. \n\n\r\n                    “That's part of the game,” Booker said afterward. “That's what comes with it.” \n\n\r\n                    Portland led by as many as 13 points in the opening half but the teams went to the break tied at 60. \n\n\r\n                    Williams said he was impressed with his team's steadiness throughout the game. \n\n\r\n                    “I thought we grew tonight in our emotional stamina, especially on the road against a good team,” Williams said. \n\n\r\n                    It was the second of three games between the teams this season. The Suns won the first, 132-100 in Phoenix last month. \n\n\r\n                    “We played them better this time than last time, which was encouraging,” Blazers coach Terry Stotts said. “We'll see what happens next time.”\n\n\r\n                    The teams played in Portland on March 10 of last year, the last game for both teams before the league was suspended by coronavirus concerns. The Blazers won 127-117. \n\n\r\n                    TIP INS\n\n\r\n                    Suns: Stotts praised Paul in his pregame chat with reporters, saying he has shown this year and last year in Oklahoma City what a great player he is. ... The Suns had seven players in double figures. \n\n\r\n                    Trail Blazers: The Blazers wore their gray and black Nike “earned” jerseys for the first time. The “earned” jerseys went to teams who made the 2020 playoffs. ... Kanter leads the Blazers with 21 double-doubles this season. \n\n\r\n                    BOOKER'S 30+\n\n\r\n                    The NBA said Booker, at 24 years and 132 days, is the eighth youngest player in history to reach 100 games with 30 or more points. The only younger players were LeBron James — who was day shy of his 22nd birthday when he reached the milestone — along with Kevin Durant, Bob McAdoo, Carmelo Anthony, Oscar Robertson, Shaquille O’Neal and Michael Jordan. \n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Host Indiana on Saturday night.\n\n\r\n                    Trail Blazers: At Minnesota on Saturday and Sunday night. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997747.4182851
}