{
  "game_id": "0022001055",
  "espn_id": "401307868",
  "date": "May 14, 2021",
  "matchup": "ORL @ PHI",
  "headline": "Curry, Embiid help 76ers top Magic, clinch top seed in East",
  "body": "PHILADELPHIA -- — Joel Embiid and the 76ers are happy to have earned home-court advantage for the playoffs — but they are a long way from their goal.\n\n\r\n                    Seth Curry scored 20 points, Embiid had 13 points and 11 rebounds and Philadelphia clinched the top seed in the Eastern Conference with a 122-97 victory over the Orlando Magic on Friday night.\n\n\r\n                    Ben Simmons added 13 points and nine assists to help the 76ers improve to 48-23. Philadelphia could’ve clinched earlier this week, but lost at Indiana on Tuesday and at Miami on Thursday. Embiid didn’t play against the Pacers due to illness and logged just 25 minutes against the Heat while still looking sluggish.\n\n\r\n                    But he was more engaged in the second quarter against the undermanned Magic, helping Philadelphia outscore Orlando 39-19 in the period to take firm control. Embiid showed the edge that has made him arguably Philadelphia’s most-loved athlete when he picked up a technical for a confrontation with Shane Bacon with 3:16 left in the period.\n\n\r\n                    “I’m happy about what we accomplished, but we have a long way to go,” Embiid said. “Now’s the time to lock in and go get the whole thing.”\n\n\r\n                    Philadelphia fans reigned down “M-V-P!” “M-V-P!” chants on Embiid in the first half. And those cheers will get even louder in the postseason, as the city announced this week that the 76ers’ home arena can have 50 percent capacity when the playoffs begin. That will mean about 10,000 fans can be in attendance, or about double the current allowance.\n\n\r\n                    The 76ers improved to 28-7 at home.\n\n\r\n                    “Home-court advantage helps a lot,” Embiid said. “We’ve been dominant at home; we barely lose here. It means a lot to have the No. 1 seed.”\n\n\r\n                    Embiid, Simmons and the rest of Philadelphia’s starters relaxed on the bench in the fourth quarter with the 76ers up big.\n\n\r\n                    “I told our guys to enjoy the second,” coach Doc Rivers said. “It’s not what we want, but it’s part of what you can get on your way to what you want.”\n\n\r\n                    Ignas Brazdeikis scored 21 points for the Magic. They have lost six straight.\n\n\r\n                    “They’re great, they’re an elite team, championship level, ton of talent,” Magic coach Steve Clifford said. “That game was important to them. The second quarter when they really turned up the defense, it was a struggle.”\n\n\r\n                    The 76ers last took the top seed in 2001 when Allen Iverson won the MVP, Larry Brown the Coach of the Year and Aaron McKie the Sixth Man award. That team reached the NBA finals before losing to Kobe Bryant, Shaquille O’Neal and the Lakers in five games.\n\n\r\n                    Philadelphia has made the playoffs 10 times since, but hasn’t gotten close to the finals. The club started from scratch under former GM Sam Hinkie, famously rebuilding beginning in 2013-14. The 76ers won just 47 games over the first three seasons of The Process before using high draft picks on Simmons and Embiid helped turn things around.\n\n\r\n                    They will enter the playoffs for the fourth straight season, but the hope of a Process-produced championship has remained elusive. Philadelphia hasn’t even reached the conference finals during the recent stretch, and last year’s first-round playoff exit cost former coach Brett Brown his job.\n\n\r\n                    Now, Rivers and GM Daryl Morey, Hinkie’s ex-boss in Houston, will try to help bring Philadelphia its first championship since 1983. The 76ers will begin that quest on May 22 and have home-court advantage as long as they stay alive in the East. They’ll start with a series against the No. 8 seed, which will come by way of a play-in tourney between the No. 9 and 10 seeds.\n\n\r\n                    “We did it as a group, felt like everybody contributed,” Embiid said. “Great coaching staff, great front office, the group we’ve had this year has been exceptional. As good as we were in the regular season, I think we’re going to be even better in the playoffs.”\n\n\r\n                    SHOT-CLOCK MALFUNCTION\n\n\r\n                    The shot clock didn’t work at the start of the second half. The public-address announcer called out when there were 15 seconds and then 10 seconds remaining before counting down the last five seconds.\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Mo Bamba returned after missing the last two games due to illness. … Fell to 10-25 on the road. … Were without Michael Carter-Williams (sprained left ankle), James Ennis III (sore right calf), Markelle Fultz (torn ACL left knee), Jonathan Isaac (left knee rehab), Chuma Okeke (sprained left ankle), Otto Porter Jr. (left foot pain) and Terrence Ross (back spasms).\n\n\r\n                    76ers: Matisse Thybulle (swelling left hand) missed his third straight contest. … Backup center Dwight Howard served a one-game suspension for picking up his 16th technical of the season on Thursday against the Heat.\n\n\r\n                    UP NEXT\n\n\r\n                    The teams wrap up the regular season in a rematch on Sunday night in Philadelphia.",
  "source": "espn_api",
  "crawled_at": 1764997567.18424
}