{
  "game_id": "0022000992",
  "espn_id": "401307795",
  "date": "May 05, 2021",
  "matchup": "ATL vs. PHX",
  "headline": "Capela, Hawks pull away late to take 135-103 win over Suns",
  "body": "ATLANTA -- — The Atlanta Hawks are looking playoff ready, even when facing the team with the NBA's best record.\n\n\r\n                    Clint Capela scored 18 points to lead seven scorers in double figures and the Hawks pulled away late to overcome Devin Booker's 30 points and rout the Phoenix Suns 135-103 on Wednesday night.\n\n\r\n                    “We definitely needed to bring the energy and intensity for 48 minutes playing against the best team in the league,” said Danilo Gallinari, who had 16 points. “It was a great challenge and I thought we did a great job.”\n\n\r\n                    The Suns saw their five-game winning streak end as they fell a game behind the West rival Utah Jazz, who beat San Antonio, in the race for the NBA's best record. Phoenix faded badly in the fourth quarter of the back-to-back following Tuesday night's 134-118 overtime win at Cleveland.\n\n\r\n                    Atlanta outscored Phoenix 38-15 in the final period. The Suns' first field goal of the period was a 3-pointer by Langston Galloway with 2:33 remaining.\n\n\r\n                    Hawks coach Nate McMillan said the Suns are “the best team in the NBA” but he knew energy would be a factor late in the game. He wanted his players to extend possessions to make the Suns work on defense, and the strategy produced results.\n\n\r\n                    Atlanta led 97-88 before scoring the first 14 points of the fourth period. Rookie Onyeka Okongwu had the first three baskets of the period and scored 14 points. \n\n\r\n                    Atlanta stretched its lead to 23 points, 111-88, before the Suns finally managed their first points of the quarter on Cameron Payne's two free throws.\n\n\r\n                    By that time, Suns coach Monty Williams had all his starters on the bench.\n\n\r\n                    The Suns arrived in Atlanta at 2 a.m. Wednesday and players had COVID tests before their noon team meeting. \n\n\r\n                    “I mean, it’s not a recipe for a lot of energy, I can tell you that,” Williams said. “Our guys still showed resiliency. They wanted to play, even when I took the starters out at the end of the game.”\n\n\r\n                    The back-to-back schedule left little time for rest, but Booker wasn't looking for excuses.\n\n\r\n                    “This is the most important stretch for us to be playing high level basketball,” Booker said. “You have to put the excuses aside.”\n\n\r\n                    Atlanta began the night fifth in the Eastern Conference. In their third consecutive win, the Hawks played like a team gaining momentum at the right point of the season.\n\n\r\n                    “They’re deep,” Williams said. “They look like a playoff team and they look like they’re getting in playoff shape. I don’t think many teams want to play them, especially when they get in the first round.”\n\n\r\n                    Mikal Bridges, who had 18 points, was the Suns' only other scorer in double figures.\n\n\r\n                    Trae Young had 16 points and 12 assists. Bogdan Bogdanovic also had 16 points.\n\n\r\n                    The Suns showed no early signs of fatigue. Phoenix made 14 of 22 shots from the field (68.2%) in the high-scoring opening period. Even with the strong shooting, the Suns trailed 42-38 because the Hawks had the same shooting percentage while making 7 of 10 3s.\n\n\r\n                    Each team's scoring pace cooled off in the second period. Atlanta took a 67-65 lead into halftime after making only one 3-pointer, by Bogdanovic, in the second period.\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: The team's return home from a three-game road trip could provide an update on F Jae Crowder (sprained right ankle), who missed his eighth consecutive game. “We hope to get him back soon,” Williams said.\n\n\r\n                    Hawks: F De'Andre Hunter missed his 47th game with right knee soreness but could be moving closer to playing. McMillan said Hunter had no physical problems on Wednesday after participating in three-on-three practice on Tuesday. McMillan said an upcoming four-day break will provide more practice opportunity for Hunter, who was averaging 16 points before the injury and was emerging as a key starter.\n\n\r\n                    HOME COOKING\n\n\r\n                    The Suns lead the NBA with 22 road wins but the Hawks continued their recent strong play at home. The Hawks earned their seventh consecutive home win and have won 15 of its last 17 in Atlanta. The Suns suffered their seventh consecutive loss in Atlanta. Atlanta’s last home loss to the Suns came on March 24, 2014.\n\n\r\n                    PRAISE FOR CAPELA\n\n\r\n                    Before the game, Williams praised Capela, saying the Hawks center “has been one of the best players in the league. Doesn’t get a lot of recognition in that category but he’s as important to this team as any player in the league is to their team.\"\n\n\r\n                    Capela backed up the compliment with 10 rebounds for his 45th double-double in 59 games. \n\n\r\n                    DIALING LONG DISTANCE\n\n\r\n                    Bogdanovic and Gallinari each made seven 3s in Monday’s 123-114 home win over Portland. It marked the first time a pair of Atlanta players each made at least seven 3s in a game. That set a difficult mark to match against the Suns. The Hawks made 13 of 26 3s, including four by Bogdanovic.\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Return home to play the New York Knicks on Friday night.\n\n\r\n                    Hawks: Complete a back-to-back at Indiana on Thursday night before closing the regular season with four consecutive home games.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997617.879445
}