{
  "game_id": "0022100835",
  "espn_id": "401360654",
  "date": "Feb 10, 2022",
  "matchup": "LAC @ DAL",
  "headline": "Doncic scores 28 in 1st, 51 total, Mavs top Clippers 112-105",
  "body": "DALLAS -- — Luka Doncic says he will miss Kristaps Porzingis after the Dallas Mavericks traded the player who never quite measured up as the European sidekick to the team's young superstar.\n\n\r\n              Never mind what the game showed just a few hours after the deal at the trading deadline.\n\n\r\n              Doncic scored 28 of his career-high 51 points in the first quarter, and the Mavericks beat the Los Angeles Clippers 112-105 on Thursday night.\n\n\r\n              The 22-year-old's 3-point frenzy, part of the highest-scoring quarter in the NBA this season, came soon after the franchise decided to end at two-plus seasons a pairing that never delivered the way the club hoped after the blockbuster with the New York Knicks in 2019.\n\n\r\n              “We were building something great, although obviously it didn't work out,” Doncic said. “I wish him the best.”\n\n\r\n              Despite Doncic hitting seven of his first nine 3s in the highest-scoring quarter of his career, regular season or playoffs, the Clippers were as close as two points in the fourth quarter. But that just set up Doncic for his first 50-point game. \n\n\r\n              LA stayed in the game with more balanced scoring, led by Marcus Morris Sr. with 21 points. Norman Powell had 19 and Reggie Jackson 18 in the first of consecutive meetings in Dallas. The rematch is Saturday. \n\n\r\n              “Well, tonight was just Luka,” Clippers coach Tyronn Lue said. “That little step-back 3, I’ll live with that. That’s his shot, but if he misses a couple or few of those, then the game is different. But he made them, and that’s why he’s a great player.”\n\n\r\n              The Dallas lead was five when Doncic returned for the final time with 8 minutes remaining, and the Mavericks built back their cushion after a flagrant foul call they didn't like against Maxi Kleber gave the Clippers a chance to tie.\n\n\r\n              Amir Coffey made both free throws to get LA within three, but a steal by Doncic led to Jalen Brunson's alley-oop pass to Dorian Finney-Smith for a layup. After an airball 3 from Nicolas Batum, Doncic assisted on Reggie Bullock's 3-pointer for a 102-94 lead.\n\n\r\n              Finney-Smith scored 12 points, and Brunson and Bullock had 11 apiece.\n\n\r\n              Doncic finished 17 of 26 from the field and 7 of 14 from 3, with the only hint of a struggle coming on free throws. He would have had a 30-point first quarter if he hadn't missed three of four from the line, but got hot there too and made 10 of 14 from the stripe. \n\n\r\n              Because of all the scoring, Doncic's career-best streak of seven games with at least 10 assists ended. The three-time All-Star had six assists and nine rebounds.\n\n\r\n              After Doncic's seventh 3 of the first quarter went in, many in the crowd rose and stayed on their feet when Dallas went to the defensive end. Then fans cheered loudly when play stopped and a smiling Doncic walked toward the bench.\n\n\r\n              “It was a really fun thing to watch,” coach Jason Kidd said. “Didn’t have to do much. Just tried to stay out of the way. It was incredible.”\n\n\r\n              Fans chanted “MVP! MVP!” as Doncic waited for the free throw that put him at 50 for the first time. He made the second for a 110-103 lead with 40 seconds remaining.\n\n\r\n              Early in the first quarter, the Clippers let center Ivica Zubac stay on Doncic on switches repeatedly, with Doncic hitting several 3s over the 7-footer and beating him on a drive twice. One bucket was a floater in the lane over Zubac.\n\n\r\n              LA started running two defenders at Doncic as soon he crossed midcourt, and a possible assist on a 30-foot pass to Marquese Chriss was thwarted when Chriss couldn’t convert on a contested layup.\n\n\r\n              “I just felt great the first quarter obviously,” Doncic said. “Everything was going in. When you feel like that, you just don't want it to stop.”\n\n\r\n              TIP-INS\n\n\r\n              Clippers: LA had won three straight in Dallas after sweeping its road games in a first-round playoff series last season, the first in NBA history where the road team won the first six games. The Clippers advanced with a Game 7 win at home. ... LA also allowed the previous highest-scoring quarter this season. Golden State star Stephen Curry had 25 in the first quarter of the Warriors’ 115-113 win on Oct. 21. Curry was 5 of 9 on 3-pointers.\n\n\r\n              Mavericks: Seven of Doncic’s 11 highest-scoring games — all at least 42 points — have come against the Clippers, most of those in first-round playoff series won by LA the past two seasons. ... A three-game streak of all five starters scoring in double figures ended. It was the first time the Mavs had such a run since 2005, according to the Elias Sports Bureau.\n\n\r\n              CLIPPERS NEWCOMERS\n\n\r\n              LA is waiting for Rodney Hood and Semi Ojeleye to arrive from Sacramento after sending Serge Ibaka to Milwaukee in a four-team trade. It was the third game for Powell since coming over from Portland. \n\n\r\n              “Can’t really call stuff to run because they really haven’t been here long enough,” Lue said. “But we’ll get that done. I liked what I saw defensively going small, being able to scramble and fire and rotate.”\n\n\r\n              UP NEXT\n\n\r\n              Both of the previous two-game sets, one last season in Dallas and the other earlier this season in LA, were splits, so the Mavericks will try to be the first to sweep Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993587.587391
}