{
  "game_id": "401809968",
  "espn_id": "401809968",
  "date": "Oct 26, 2025",
  "matchup": "SAC vs LAL",
  "headline": "Reaves has career night as Lakers beat Kings without Luka, 127-120",
  "body": "SACRAMENTO, Calif. -- — Austin Reaves scored a career-high 51 points including four clutch free throws in the final 32 seconds, and the Los Angeles Lakers beat the Sacramento Kings 127-120 without Luka Doncic on Sunday.\n\n\r\n              Reaves made 12 of 22 from the field and sank six 3-pointers including the 500th of his career. Reaves also had nine assists and 11 rebounds. \n\n\r\n              Reaves is just the fourth player in the last 40 years with at least 50 points, 11 rebounds and nine assists in a game, joining Doncic, Russell Westbrook (twice) and James Harden (twice). The last time a Lakers player had 50-plus points, 11-plus rebounds and nine-plus assists was Feb. 13, 1963, when Elgin Baylor had 50 points, 15 rebounds and 11 assists against the Boston Celtics. \n\n\r\n              DeAndre Ayton had 22 points and 15 rebounds for the Lakers. Rui Hachimura scored 18 points.\n\n\r\n              Doncic was ruled out before the game due to a sprained finger on his left hand and a bruised lower left leg. He’s expected to be reevaluated in about a week, according to the Lakers.\n\n\r\n              That’s another blow for Los Angeles, which isn’t expected to have LeBron James (sciatica) back until mid-November.\n\n\r\n              Against the Kings it hardly mattered the way Reaves played.\n\n\r\n              Reaves scored 15 points in the fourth quarter after the Kings took a four-point lead, including a clutch jumper that gave the Lakers a 122-116 lead with 1:48 remaining.\n\n\r\n              Zach LaVine scored 32 points to lead six players in double figures for the Kings. \n\n\r\n              DeMar DeRozan scored 21 points, Domantas Sabonis had 10 points and 14 rebounds, while Dennis Schroder added 18 points and 12 assists.\n\n\r\n              Even without their top two scoring options, the Lakers got going early and took a 10-point lead in the first quarter.\n\n\r\n              Hachimura had 10 points in the first nine minutes of the game while Ayton and Marcus Smart each scored seven points as Los Angeles led 31-21.\n\n\r\n              The Kings made seven 3s in the second quarter – three from Westbrook – to tie the game at halftime.\n\n\r\n              Up next\r\n              Lakers: Face the Trail Blazers in Portland on Monday.\n\n\r\n              Kings: Play the Thunder in Oklahoma City on Tuesday,\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042508.7490299
}