{
  "game_id": "0022400176",
  "espn_id": "401704742",
  "date": "Nov 06, 2024",
  "matchup": "CHI @ DAL",
  "headline": "Luka Doncic's 27 points, 13 assists lead Dallas Mavericks past Chicago Bulls 119-99",
  "body": "DALLAS -- — Luka Doncic had 27 points and 13 assists, Kyrie Irving scored 17 points and Daniel Gafford also scored 17 playing a season-high 24 minutes as the Dallas Mavericks beat the Chicago Bulls 119-99 on Wednesday night.\n\n\r\n              The defending Western Conference champions scored the first 13 points of the second half and led by as many as 30 while improving to 2-2 on a five-game homestand.\n\n\r\n              Nikola Vucevic had 14 points and 10 rebounds while sitting out the fourth quarter to lead the Bulls, who have lost three straight games. Rookie Matas Buzelis, who had five total points this season going into play, had 13 points and nine rebounds.\n\n\r\n              Dallas played without starting forward P.J. Washington because of a right knee sprain and without Dereck Lively II, who averages the most center minutes as Gafford’s backup, because of a right shoulder sprain.\n\n\r\n              The Bulls played their second consecutive game without leading scorer Zach LaVine, who has a right adductor strain.\n\n\r\n              Takeaways\r\n              Bulls: On a night when Dallas lacked two of its regular big men, the Bulls were on pace for their most 3-point shots this season at halftime with 27 – but shooting 18.5%. They finished 12 of 42 for 28.6%.\n\n\r\n              Mavericks: They held their own inside, outscoring the Bulls 60-48 in the paint and standing even on second-chance points 12-12.\n\n\r\n              Key moment\r\n              Doncic, Klay Thompson and Irving hit consecutive 3-pointers during a 17-0 run in the first period that gave Dallas a 22-9 lead.\n\n\r\n              Key stat\r\n              Dallas led in points off turnovers 28-13.\n\n\r\n              Up next \r\n              The Bulls will complete a back-to-back at home against the Minnesota Timberwolves on Thursday. The Mavericks will host the Phoenix Suns on Friday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997113.907198
}