{
  "game_id": "0021501183",
  "espn_id": "400829070",
  "date": "Apr 08, 2016",
  "matchup": "TOR vs. IND",
  "headline": "Raptors keep Pacers waiting for playoffs with 111-98 win",
  "body": "TORONTO --  One win from clinching a playoff berth, the Indiana Pacers should have been boosted by the news that Toronto Raptors coach Dwane Casey had decided to rest All-Stars DeMar DeRozan and Kyle Lowry, along with starting forward Luis Scola.\n\nInstead the Toronto reserves came up big, with Norman Powell scoring a season-high 27 points and fellow rookie Delon Wright adding 19 as the Raptors kept Indiana waiting with a 111-98 victory Friday night.\n\nCorey Joseph added 18 points and tied a career high with nine assists.\n\n\"This team played hard,\" Indiana's Paul George said. \"They came out and played harder than us. There is nothing else to say; they just played harder.\"\n\nThe result leaves the Pacers needing one more win or a Chicago loss to qualify for the postseason. They will clinch if the Bulls lose to Cleveland on Saturday night, or by beating Brooklyn on Sunday.\n\nIndiana coach Frank Vogel was less than impressed with his team's play on a night where his team sent Powell to the free-throw line 19 times, from where he converted 14. The 19 free throws are a rookie single-game record by a Raptor.\n\n\"We didn't play well enough; we weren't sharp in any area,\" he said. \"I don't think we respected the guys that were out there and we didn't bring a high enough level. ... We wouldn't beat anyone tonight.\"\n\nMonta Ellis top scored with 17 points for Indiana, while Solomon Hill added 16.\n\nPowell was understandably delighted with his breakthrough game, particularly given the result with many of the team's top stars on the sidelines in the second game of a back-to-back following Thursday night's loss in Atlanta. Powell, who played a career high 41:12, surpassed his previous best of 18 points, set against the Oklahoma City last month.\n\n\"We really moved the ball, played together, focused on defense and it just shows how deep we are when guys like Kyle and DeMar and Scola can take a game off and we have a big team win like that,\" he said. \"It just shows how good and talented we are when we all play together and lock in.\"\n\nThe Raptors set a franchise record for home wins with 31. They set the previous mark in 2006-07.\n\nEntering the second half up 50-46, the Raptors went on an 11-5 run to start the third to lead by 10 with 8:28 left in the third quarter. From there blew the lead to as much as 19 in the fourth, where they led by double figures for the entire 12 minutes as they coasted across the finish line.\n\nCasey was particularly pleased with the intensity that some of the younger players brought to the game.\n\n\"They came out and played,\" he said. \"That's one thing you don't have to worry about and that's effort and intensity. I thought our young guys came out and played with a lot of effort and intensity.\"\n\nROOKIE RIVALRY\n\nDespite playing on rival teams during their time playing in the Pac-12, Powell and Wright have developed a solid connection with the Raptors. \"We're really close because of the Pac-12 rivalry that we had being the two best players on the team and battling it out when UCLA and Utah went up against each other,\" Powell said. \"We've become really close in our rookie seasons and we help each other out when we see something in the game and I'm happy to see both of us succeed.\"\n\nEASING BACK IN\n\nAfter playing his first game since Jan. 3 on Thursday in Atlanta, DeMarre Carroll sat out Friday as Casey looks to ease him back into action following right knee surgery. \"We just want to go cautiously bringing him back when he's been out that long,\" Casey said.\n\nTIP-INS\n\nPacers: Despite leading the NBA in defensive 3-point field-goal percentage (33.1 percent) entering the game, the Pacers allowed the Raptors to convert at a 45.5 percent rate from beyond the arc. ... With the Raptors the Eastern Conference's second seed and the Pacers in seventh place before the game, Friday's game could have been viewed as a possible playoff matchup. But coach Frank Vogel wasn't buying in. \"It's probably a little too early for that,\" he said. \"We're not in the playoffs yet. Toronto can think that because they almost have the two seed locked up. We need to get into the playoffs, and it doesn't really matter who we're playing.\n\nRaptors: The win marked the fourth consecutive season that the Toronto has either won or tied the season series with Indiana. ... The Raptors are 42-5 when the opponent scores less than 100 points. ... The Raptors are 8-0 when playing at home on a Friday night this season, and 49-26 when playing on that day since the 2012-13 season. ... Bismack Biyombo's streak of games with a blocked shot ended at 17. He played just 9:34.\n\nUP NEXT\n\nPacers: Host Brooklyn on Sunday.\n\nRaptors: Visit New York on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994687.861998
}