{
  "game_id": "0021900520",
  "espn_id": "401161162",
  "date": "Jan 03, 2020",
  "matchup": "HOU vs. PHI",
  "headline": "Harden nets 44 in triple-double, Rockets beat 76ers 118-108",
  "body": "HOUSTON --  Houston Rockets coach Mike D’Antoni is convinced James Harden operates on a different level than most players, especially after his latest dazzling performance.\n\nHarden had 44 points, 11 rebounds and 11 assists to lead the Rockets to a 118-108 win over the Philadelphia 76ers on Friday night.\n\n“He just understands the game, sees it and knows where he wants them,” D’Antoni said. “They stay out, he throws a lob. They come in, he throws that. He’s got that little runner, his 3s are all over the place. I mean, he’s really good. He’s one of the best ever.”\n\nOn a “Flashback Friday” night in which the Rockets wore their retro ketchup-and-mustard uniforms from their back-to-back NBA title days in the mid-90s, Harden sported a retro look of his own, with a white headband and cornrows.\n\nWith Philadelphia threatening late, Harden knocked down a deep step-back 3-pointer over Josh Richardson with 1:17 left in the game that put Houston up 10. On the next possession, he found Clint Capela with an alley-oop for a thunderous dunk.\n\nHarden’s triple-double was his first of the season and 43rd of his career, tying Fat Level for eighth-most in NBA history.\n\nCapela was a point shy of his career high in scoring, finishing with a season-best 30 points and 14 rebounds.\n\n“You never feel comfortable,” 76ers coach Brett Brown said. “He dribbles two feet over half-court and you still don’t feel like you’re close enough. Then, you try to get close and he’s strong enough and good enough to go by you, and then, Capela gets behind your head for the lobs. The package is lethal. They’re hard to beat.”\n\nThe 76ers have lost four straight, their longest skid since dropping five in a row in Dec. 2017.\n\nBen Simmons led Philadelphia with 29 points, 13 rebounds, 11 assists and four blocks, which matched a career-high. It was his 25th career triple-double and third this season. Tobias Harris scored 24 points.\n\n“We can never let the highs get too high or the lows get too low,” Simmons said. “We’ve got to get better.”\n\nAfter missing Philadelphia’s 115-97 loss with a sore left knee on Tuesday, Joel Embiid added 20 points and 12 rebounds.\n\n“If it’s not taking a toll on anybody, I care about winning, and it’s taking a toll on me,” Embiid said. “All I care about is winning. ... We’ve got to find a way. We’ve got to keep fighting.”\n\nBrown insisted that he is confident that his team will move on from the rough patch.\n\n“You just keep moving,” Brown said. “You’ve got to identify obvious things that you need to work on. We had a rough time shooting tonight. Keep the boys in the boat and good days will add up.”\n\nThe Rockets improved to 13-4 at home this season and have won their last four games at the Toyota Center.\n\nThe 76ers led 27-20 after the first quarter, dominating the paint and keeping Houston’s shooters in check. With less than five seconds remaining in the quarter, Harden was fouled by Trey Burke in the process of making a deep 3-pointer, but the shot was called off, infuriating Rockets coach Mike D’Antoni, who argued with officials during the break.\n\nEarly in the second quarter, Russell Westbrook received a technical foul for arguing a foul call against him after tangling with Embiid for a rebound.\n\nHouston’s shooting improved after the first quarter, and the Rockets led 60-53 at halftime.\n\nWestbrook had a rough stretch in the third quarter during which he missed an open, two-handed dunk in transition and immediately followed the play with a missed layup. Westbrook finished the game shooting 9 of 22 from the field with 20 points, seven rebounds and four assists.\n\nHouston led 96-84 entering the fourth quarter.\n\nThe Rockets have a lengthy four-day break before visiting Atlanta on Wednesday night, the start of a stretch in which they will play five games in seven days.\n\nTIP-INS\n\n76ers: Trey Burke received a technical foul late in the second quarter for arguing a foul call he was charged with while guarding Eric Gordon. ... SF James Ennis III missed the game with a stomach illness.\n\nRockets: In his third game back from a nearly seven-week absence with a knee injury, SG Eric Gordon scored 12 points on 3-of-13 shooting, including 2 of 10 from 3, in 30 minutes off the bench. ... Houston went 12 of 32 from 3-point range (37.5%).\n\nUP NEXT\n\n76ers: Host Oklahoma City on Monday night.\n\nRockets: Visit Atlanta on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996637.8718479
}