{
  "game_id": "0022200408",
  "espn_id": "401468563",
  "date": "Dec 12, 2022",
  "matchup": "LAC vs. BOS",
  "headline": "Leonard, George lead Clippers over NBA-best Celtics, 113-93",
  "body": "LOS ANGELES -- — Kawhi Leonard came to the bench with a message for his Los Angeles Clippers teammates.\n\n\r\n              “Told the guys, ‘Let’s get out and run, let's play faster,'” coach Tyronn Lue said.\n\n\r\n              Behind 26 points from Paul George and Leonard's season highs of 25 points and nine rebounds, the Clippers routed the NBA-leading Boston Celtics 113-93 on Monday night.\n\n\r\n              “When your two best players come back, that's a lot of energy,” Lue said.\n\n\r\n              The Clippers' defense held the Celtics under 100 points for the first time this season.\n\n\r\n              “We did a great job pretty much across the whole board,” George said.\n\n\r\n              Leonard also had six assists in his best all-around game of a young season that has been interrupted at times while he eases his way back from ACL surgery that cost him all of last season.\n\n\r\n              “Only my ninth game,” Leonard said. “You can't rush it. Yeah, just got to keep moving.”\n\n\r\n              George has been hurt, too, although unlike Leonard, he's no longer under a minutes restriction.\n\n\r\n              “We’re still trying to figure out how we’re going to play on the court with one another,” George said. “It’s just good if both of us are playing aggressive.”\n\n\r\n              Jaylen Brown scored 21 points to lead the Celtics, who dropped two in a row for only the second time this season. They had won eight of 10, including a loss at Golden State on Saturday. Jayson Tatum added 20 points — well below his 30-point average — and 11 rebounds, and Malcolm Brogdon had 18 points off the bench.\n\n\r\n              “We made a conscious effort to make sure Tatum and Brown played in a crowd all night,” Lue said.\n\n\r\n              Having the Celtics and their 21-7 record in town drew one of the Clippers' biggest crowds of the season and created a playoff-like atmosphere. Boston fans showed out in the same colored gear as Marcus Smart's green-hued hair.\n\n\r\n              But the Clippers made most of the noise.\n\n\r\n              Coming off a 2-2 East Coast trip, Los Angeles used a few big runs and solid defense to control the first half and take a 56-47 lead at the break.\n\n\r\n              Leonard and George came out shooting to start the third. They each hit a 3-pointer while combining for 13 straight points that extended the lead to 69-55. Luke Kennard came off the bench and keyed a 7-0 run late, hitting a 3 before John Wall's jumper put the Clippers ahead 88-72 going into the fourth.\n\n\r\n              George and Leonard combined for seven straight points in the fourth and Kennard kept hitting, too, pushing the Clippers' lead to 104-80. \n\n\r\n              “How he played was huge, just seeing him get his rhythm back,” Lue said of Leonard. “The last couple games just playing with more pace. He's been feeling good.” \n\n\r\n              The biggest roar came when Smart missed a pair of free throws, ensuring fans free chicken sandwiches. Smart finished with three points and five fouls.\n\n\r\n              George and Leonard were part of the Clippers' 17-8 spurt in the second. Los Angeles ran off 11 points in a row as part of a 20-3 burst in the first. \n\n\r\n              TIP-INS\n\n\r\n              Celtics: Al Horford (personal reasons) is expected to rejoin the team when it returns home this weekend. ... Former Clipper Blake Griffin started in Horford's place. He picked up a technical foul in the second quarter for grabbing the net. \n\n\r\n              Clippers: Norman Powell (left groin strain) is progressing well in individual workouts, but there's no timetable for his return. ... Ivica Zubac was a game-time decision to start after experiencing right groin soreness in Saturday's game. He had four points, three rebounds and five fouls in 17 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At the Los Angeles Lakers on Tuesday in the second game of a back-to-back on Boston's second-longest road trip of the season.\n\n\r\n              Clippers: Host the Minnesota Timberwolves on Wednesday in the second of five straight home games.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994984.2133088
}