{
  "game_id": "0022200033",
  "espn_id": "401468188",
  "date": "Oct 22, 2022",
  "matchup": "MIL vs. HOU",
  "headline": "Antetokounmpo scores 44 points, Bucks rout Rockets 125-105",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 44 points and became Milwaukee’s career free throws leader as the Bucks rolled to a 125-105 victory over the Houston Rockets on Saturday night.\n\n\r\n              Antetokounmpo went 8 of 13 from the foul line to increase his total to 3,508 free throws out of 4,891 attempts (71.7%). Sidney Moncrief made 3,505 free throws with the Bucks from 1979-89.\n\n\r\n              “It's a part of my game that I've always tried to get better, always tried to improve,” Antetokounmpo said. “Just being up there ... it's a great feeling.”\n\n\r\n              The two-time MVP played less than 28 minutes but still had 12 rebounds. Antetokounmpo shot 17 of 21 from the floor, including 2 of 3 from 3-point range.\n\n\r\n              Antetokounmpo left for good with 8:08 remaining and the Bucks ahead 107-85.\n\n\r\n              “You run out of words to describe a player like that,” Bucks center Brook Lopez said. “I can't imagine you guys actually have to write. I don't know how you guys just don't send the same article over and over with the same adjectives and everything like that because you need some new ways to just describe how his game grows. It's tough. \n\n\r\n              \"He's obviously the head of the snake, the engine to everything we do. He just comes out with such great mentality and focus that it trickles down. It gives us all energy.”\n\n\r\n              This game began a six-game homestand for the Bucks, who won their season opener 90-88 at Philadelphia on Thursday night.\n\n\r\n              The Rockets were playing one night after a 129-122 home loss to Memphis. Eric Gordon, who scored 17 points against the Grizzlies, didn’t play Saturday due to what the team described as maintenance of an injured right groin.\n\n\r\n              Houston also was missing Bruno Fernando, who had left the Grizzlies game with a sore left knee.\n\n\r\n              Rockets coach Stephen Silas said they were simply resting Gordon rather than having the 33-year-old guard play on back-to-back nights. Silas said he wasn’t sure how long Fernando might be out.\n\n\r\n              Jalen Green led the Rockets with 22 points. Kevin Porter Jr. had 18, Kenyon Martin Jr. 14, Jabari Smith Jr. 13 and Tari Eason 11.\n\n\r\n              The Bucks scored the game’s first 13 points and never trailed. The Rockets never got the margin below 12 points in the second half.\n\n\r\n              “The start of the game was the game, the hammer that they hit us with right from the start,\" Silas said.\n\n\r\n              Jrue Holiday, who shot 2 of 15 and had just six points in the Bucks' victory over the 76ers, exceeded that scoring output in the first two minutes of Saturday’s game and finished with 19 points plus 10 assists.\n\n\r\n              “It was vintage Jrue to start the game on both ends of the court,” Bucks coach Mike Budenholzer said.\n\n\r\n              Bobby Portis had 13 and Grayson Allen added 11 as the Bucks shot 56.5% from the floor and 51.6% (16 of 31) from 3-point range.\n\n\r\n              TIP-INS\n\n\r\n              Rockets: Silas said the Rockets might not have a set starting lineup for much of the season. “We’re going to be pretty fluid as far as who we’re playing against, who’s playing well for our group and who’s available,” Silas said before the game.\n\n\r\n              Bucks: Budenholzer didn’t have the walking boot that he was wearing in Philadelphia. Budenholzer has been recuperating after having replacement surgery on his right ankle during the offseason. ... Rookie first-round pick MarJon Beauchamp made his NBA debut, entering the game with just over two minutes left. Beauchamp, the 24th overall pick in the draft, hadn't played against the 76ers. ... Lopez had five of the Bucks' 10 blocks.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host Utah on Monday night.\n\n\r\n              Bucks: Host Brooklyn on Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994611.332955
}