{
  "game_id": "0021801070",
  "espn_id": "401071743",
  "date": "Mar 20, 2019",
  "matchup": "MEM vs. HOU",
  "headline": "Harden drops second 50-point game vs. Grizzlies",
  "body": "MEMPHIS, Tenn. -- James Harden did everything he could to bring the Houston Rockets back from a big deficit in the fourth quarter. He got them to overtime, but his 57 points weren't enough.\nAll because of a last-second free throw.\nMike Conley scored 35 points and Jonas Valanciunas had a career-best 33, including the game-winning free throw with less than a second left as the Memphis Grizzlies outlasted the Rockets 126-125 on Wednesday night.\n\"We put ourselves in a hole and tried to pick it up, but it was too late,'' Harden said. \"We were down [17], so I had to do something.''\nHarden led a 17-2 Houston rally in the fourth -- scoring 15 points during that stretch -- to pull the Rockets to 106-104. He hit three free throws with 4 seconds remaining to send the game to overtime tied at 115.\nHarden scored all 10 points for Houston in overtime, and the teams were still tied at 125 when Clint Capela fouled Valanciunas with 0.1 seconds left. Valanciunas, who also had 15 rebounds, made the first of two free throws. The clock ran out after he missed the second foul shot.\nHarden had previously scored 57 against the Grizzlies on Jan. 14. He's the third player to record multiple 50-point games against one opponent in a season over the past 30 seasons, joining Kobe Bryant and Michael Jordan.\nIt was also his seventh 50-point game of the season, and he became the second player in NBA history to record a 50-point game in five straight months, joining Wilt Chamberlain.\nChris Paul had 18 points and seven assists for Houston, which had won three straight. Capela added 14 points and 10 rebounds. The loss was only Houston's second in the last 14 games.\n\"It was one of those games. Every once in a while it crops up,'' Rockets coach Mike D'Antoni said. \"You've got to go on. It's too bad, but we just kind of threw that away.''\nMemphis dominated the game through 3½ quarters until the Harden-led comeback. Conley made all six of his shots, including a quartet of 3-pointers, in the first quarter. Valanciunas made all nine of his shots in the first half.\nBut despite the double-digit lead into the fourth, the Grizzlies had to weather Harden's 28 points after the third quarter.\n\"It got crazy there for a little bit,'' Conley said. \"That was a fun game. It's the kind of game you want to be a part of -- big plays, big opportunities for everybody. The way it ended was wild. \"I'm just happy we got away with a win.''\nTIP-INS\nRockets: Harden's 57 points were just short of his career-best 61 against the Knicks on Jan. 23. ... Eric Gordon (rest) was given the night off, and Kenneth Faried sat out with left knee soreness. ... Harden's streak of five straight double-doubles ended. ... Houston made 21 3-pointers, the most by a Memphis opponent this season and second-most in Grizzlies franchise history (23 by the Pistons on April 8, 2018).\nGrizzlies: Heisman Trophy-winning quarterback Johnny Manziel, signed recently by the Memphis Express of the Alliance of American Football, attended the game. ... Conley has scored at least 20 points in six straight games, matching the longest such streak of his career. ... Memphis recorded no blocks for the first time this season.\nBAD START\nHouston had little answer for the Grizzlies early as Memphis built the lead to 19, making 74 percent of its shots in the first quarter, including going 7-of-11 from outside the arc. \"We weren't doing anything,'' Harden said. \"Defensively they were getting what they wanted. Offensively we weren't being aggressive. The fourth quarter and overtime we played well.''\nBOARD WORK\nMemphis outrebounded the Rockets 50-39, and that included a 14-11 edge on the offensive glass -- the key one coming by Valanciunas that led to the game-winning foul shot. \"They had been kicking our butt all night,'' D'Antoni said, adding: \"We didn't play with a lot of force for a long time.''\nSPOILERS\nThe win was Memphis' fourth in the last six games -- three of the four against teams in the Western Conference playoff race. The fourth was over Orlando, which is just outside the postseason picture in the East. \"It's not like, 'Oh, they're a playoff team, we want to play better,''' Grizzlies guard Delon Wright said. \"We're just trying to win every game. It just so happens that we're beating the playoff teams.\"\nUP NEXT\nRockets: Host the San Antonio Spurs on Friday.\nGrizzlies: At the Orlando Magic on Friday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764994896.760401
}