{
  "game_id": "0021800207",
  "espn_id": "401070888",
  "date": "Nov 14, 2018",
  "matchup": "MIL vs. MEM",
  "headline": "Gasol, Grizzlies hold off Bucks late for 116-113 win",
  "body": "MILWAUKEE --  In a game of runs between teams with contrasting styles, Memphis made the last, defining push.\n\nMarc Gasol scored 29 points, Mike Conley added 26 and the grind-it-out Grizzlies held off the up-tempo Bucks 116-113 on Wednesday night, handing Milwaukee its first home loss of the season.\n\nIt's a nice way for Memphis to start a busy stretch of four games in six nights.\n\n\"The words `grit' and `grind' mean something to our guys,\" Grizzlies coach J.B. Bickerstaff said. \"To do what we did here speaks to that.\"\n\nAfter losing a 15-point lead in the third quarter, Memphis surged ahead again late and held on with key baskets from Conley.\n\nWith the shot clock winding down, Conley hit a turnaround jumper in the middle of the lane for a 113-109 lead with 26 seconds left.\n\nConley also hit two foul shots with 9.9 seconds left for a four-point lead, though Shelvin Mack went 1 of 2 at the line with 2.1 seconds left to give the Bucks one last chance trailing by three.\n\nThe Bucks inbounded the ball to their best 3-point shooter, Khris Middleton. He missed near the top of the arc with two defenders in his face as time expired.\n\n\"Stops. Stops. Stops. Finding a way to stop them,\" Gasol said in describing Memphis' final run.\n\nGiannis Antetokounmpo scored 31 points, and Middleton added 25 for the Bucks. They squandered an eight-point lead with 9:08 left.\n\nOne of the NBA's most prolific 3-point shooting teams, Milwaukee couldn't overcome a cold-shooting night from the arc. They shot 50.6 percent overall but just 25.7 percent from 3-point territory (9 of 35).\n\nThe Bucks came out sluggish coming off of a four-stop, Western Conference road trip, having also trailed by 11 in the first half.\n\n\"I felt like we could play with more energy, we could be better executing,\" Bucks coach Mike Budenholzer said.\n\nIT'S PAT\n\nMack added 15 points, including three 3s in a third quarter in which Memphis led by as much as 15.\n\nThe Bucks got back in it with a 19-2 run spearheaded by defense and energetic guard Pat Connaughton, who had 16 points on 6-of-9 shooting and added six rebounds.\n\nConnaughton opened the fourth quarter with a dunk , and Eric Bledsoe followed with a steal and dunk on the break to tie the game at 84 apiece.\n\nIt looked like the Bucks were off to the races again, playing their kind of pace. Memphis mustered enough defense late to hold off another charge.\n\n\"One thing we can do is defend when shots aren't falling,\" Connaughton said.\n\nTIP-INS\n\nGrizzlies: The win snapped a 16-game road losing streak against Eastern Conference foes. ... Down five players because of injuries, Memphis still enjoyed a pace in the first half that catered to its grind-it-out style. Gasol had 11 points to pace the Grizzlies' to a 48-45 halftime lead. It helped, too, that the Bucks were just 4 of 23 (17 percent) from the arc in the first half. Bickerstaff said the injuries haven't prevented the team from playing the kind of kind of slow-down, defensive style that he is trying to instill.\n\n\"The thought is can you make people uncomfortable and make them fight a fight they aren't accustomed to,\" Bickerstaff said.\n\nBucks: Rookie G Donte DiVincenzo left the game with left knee soreness. He played six minutes in the first half, scoring three points. ... The Bucks wasted an opportunity to go 11-3, which would have matched their best start since 1980-81. ... Budenholzer was ejected in the fourth quarter after picking up his second technical foul.\n\nThe ejection occurred after it appeared the Budenholzer was arguing about a call in which Malcolm Brogdon stepped out of bounds. The guard might have been pushed out of bounds by a defender. Asked if he was surprised that he got ejected, Budenholzer said \"It's a good question.\"\n\nUP NEXT\n\nGrizzlies: Return home Friday night to face the Sacramento Kings\n\nBucks: Host the Chicago Bulls on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994524.352479
}