{
  "game_id": "401810128",
  "espn_id": "401810128",
  "date": "Nov 22, 2025",
  "matchup": "DAL vs MEM",
  "headline": "Aldama and Spencer lead Grizzlies past Mavericks 102-96",
  "body": "DALLAS -- — Santi Aldama scored 20 points, including a left-handed driving shot that began a tiebreaking 6-0 run for Memphis in the final minute, and Cam Spencer added 15 of his 17 points off the bench in the second half as the Grizzlies beat the Dallas Mavericks 102-96 on Saturday night.\n\n\r\n              Zach Edey had 12 points and a season-high 15 rebounds for his first double-double in four games since returning from offseason ankle surgery for the Grizzlies (6-11), who have won consecutive games for the first time this season.\n\n\r\n              Klay Thompson scored a season-high 22 off the bench and matched a season best with six 3-pointers for the Mavericks (5-13), who split a home back-to-back and have yet to win consecutive games this season.\n\n\r\n              After Memphis’ Cedric Coward followed Aldama’s basket with a free throw with 27.6 seconds left, Thompson’s straightaway 3-pointer from 29 feet banged off the rim seconds later and was rebounded by Memphis’ Vince Williams Jr. Thompson and Williams had words early in the fourth quarter, resulting in technical fouls on both.\n\n\r\n              Dallas rookie Cooper Flagg, the No. 1 pick in this year’s NBA draft, had 12 points and seven rebounds in 33 minutes after scoring a season-high 29 in Friday’s 118-113 win over New Orleans.\n\n\r\n              The Mavericks led 46-43 at halftime, the Grizzlies’ lowest-scoring first half this season. When Memphis beat Dallas 118-104 on Nov. 7, the Grizzlies scored 74 points in the first half.\n\n\r\n              Both teams lost big men to injury. Memphis’ Jock Landale left in the first quarter with a neck injury. Dallas’ P.J. Washington went to the locker room with about five minutes left because of an apparent back injury.\n\n\r\n              Memphis’ Jaren Jackson Jr. missed his second straight game with a sprained right ankle.\n\n\r\n              Up next\r\n              Grizzlies: Host the Denver Nuggets on Monday.\n\n\r\n              Mavericks: Visit the Miami Heat on Monday in the first of four consecutive road games.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042678.3390012
}