{
  "game_id": "0022300770",
  "espn_id": "401585398",
  "date": "Feb 12, 2024",
  "matchup": "MIN @ LAC",
  "headline": "Towns, Edwards help Timberwolves rally in second half for 121-100 victory over Clippers",
  "body": "LOS ANGELES -- — Karl-Anthony Towns scored 24 points, Anthony Edwards added 23 and the Minnesota Timberwolves pulled away in the second half for a 121-100 victory over the Los Angeles Clippers on Monday night in a matchup of two of the top teams in the Western Conference.\n\n\r\n              Rudy Gobert had a double-double with 17 points and 10 rebounds as the Timberwolves (37-16) remained atop the Western Conference with their third win in the last four games.\n\n\r\n              It is the 10th time the Timberwolves have won this season when trailing at halftime, which is second in the NBA. \n\n\r\n              “I didn’t think we brought enough force or physicality to the game in the first half. I thought we played good basketball but there was a bunch of plays where they just were way more physical than we were,” Timberwolves coach Chris Finch said. “All credit to the guys. They recognize that and set the tone at the start of the second half.”\n\n\r\n              The Timberwolves trailed 53-49 at halftime, but seized control in the third quarter, outscoring the Clippers 40-19.\n\n\r\n              “We’re doing a good job of being focused. We listen to coach and do a good job in the third quarter of adjusting after seeing it and not committing the same sentence,” Towns said.\n\n\r\n              Minnesota started the second half with eight straight points, but it wasn't until midway through the third quarter that it was able to pull away.\n\n\r\n              Minnesota trailed 64-62 midway through the quarter before it went on a 27-8 run to close the third.\n\n\r\n              The Timberwolves had a 12-2 spurt to close the quarter as Towns scored eight straight points and Edwards had a reverse layup to give them an 89-72 advantage going into the fourth quarter.\n\n\r\n              Minnesota was 12 of 19 from the field in the quarter. Edwards and Towns were both 6 of 6 at the line as the Timberwolves made all 13 of their foul shots in the period.\n\n\r\n              Meanwhile, the Clippers were 7 of 20 from the field and committed five turnovers that resulted in six Minnesota points.\n\n\r\n              “We were playing very good in the first half. We were just missing the little extra effort and giving them rebounds. Once we cleaned that up, we had great defensive possessions and were able to run on them,” Gobert said.\n\n\r\n              The Timberwolves’ largest lead was 24 points during the fourth quarter.\n\n\r\n              Paul George and Kawhi Leonard led the Clippers with 18 points apiece and James Harden added 17.\n\n\r\n              George became the Clippers' career 3-point leader with 7:23 remaining in the third quarter, hitting his 739th to surpass Eric Piatkowski.\n\n\r\n              “They played better than we did. Outcoached us, outplayed us and everything,” Clippers coach Tyronn Lue said. “I thought just the physicality and attention to detail, they were better.”\n\n\r\n              Los Angeles, which is 27-7 since the start of December, is in third place in the Western Conference with a 35-17 record.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Portland for two straight games beginning Tuesday.\n\n\r\n              Clippers: At Golden State on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996467.537452
}