{
  "game_id": "0022000593",
  "espn_id": "401307377",
  "date": "Mar 14, 2021",
  "matchup": "MEM @ OKC",
  "headline": "Gilgeous-Alexander scores 30 as Thunder top Grizzlies",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 30 points and Aleksej Pokusevski had a career-high 23, helping the Oklahoma City Thunder beat the Memphis Grizzlies 128-122 on Sunday.\n\n\r\n                    Kenrich Williams added 17 points on 7-for-8 shooting for the Thunder, who trailed by as many as 12. Moses Brown had 13 points, and Ty Jerome finished with 12.\n\n\r\n                    Gilgeous-Alexander, who missed Saturday’s 119-97 loss to the Knicks with a left quad contusion, went 8 for 17 from the field. The Thunder had seven players score in double figures and shot a season-high 57.5% from the floor, including 16 of 31 from 3-point range.\n\n\r\n                    “I thought we showed really good resilience there,” Thunder coach Mark Daigneault said. “The first thing we weathered was right out of halftime, (the Grizzlies’ lead) went to 12 and got a little dicey. We just played through it, got a couple of stops. Turned the game a little bit and got it back under control.”\n\n\r\n                    Ja Morant had 22 points and seven assists for Memphis, which lost for the third time in four games. Dillon Brooks scored 19 points, and Jonas Valančiūnas had 16 points and 14 rebounds.\n\n\r\n                    The Grizzlies opened a 102-90 lead on Justise Winslow’s driving layup early in the fourth quarter. But the Thunder responded with a 14-2 run. Williams tied it at 104 with a cutting layup with 8:38 left.\n\n\r\n                    Pokusevski’s 25-footer put Oklahoma City in front at 109-108 with 6:10 left. Darius Miller added another 3 to push the Thunder ahead by four on their next possession.\n\n\r\n                    The Grizzlies never recovered, allowing 38 fourth-quarter points.\n\n\r\n                    “We give them a lot of credit, I thought the Thunder played great today,” Grizzlies coach Taylor Jenkins said. “We couldn’t get in a rhythm, I felt, offensively. We put them on the free-throw line too much. ... They got hot, you gotta give them credit.”\n\n\r\n                    AHEAD OF HIS TIME\n\n\r\n                    The 19-year-old Pokusevski, who made five 3-pointers, became the second-youngest player in NBA history to make five-or-more 3s in a single game. He trails LeBron James, who achieved the mark in 2003.\n\n\r\n                    The 7-foot Pokusevski also grabbed 10 rebounds in his third game since he was called up from his G-League assignment with the Oklahoma City Blue.\n\n\r\n                    “Now he knows what a game like tonight feels like, which gives him confidence,\" Daigneault said. \n\n\r\n                    “So, the next time he takes a step back, which he will, it’s part of development and it’s a part of competition, he’ll know that he can turn a corner. I think when you repeat that process and you keep getting those experiences, that’s where consistency and confidence come from.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Lu Dort (toe), Theo Maledon (ankle) and Al Horford (rest) were unavailable. … Brown and Jerome each made their first career NBA start. … The Thunder are 4-5 in games on the second day of a back-to-back. … The Thunder outrebounded the Grizzlies 46-32.\n\n\r\n                    Grizzlies: Jaren Jackson Jr. (left knee meniscus surgery recovery) remained out. … The Grizzlies fell to 1-1 against the Thunder. The teams will play again on March 24. … The Grizzlies scored 35 points via turnovers to the Thunders’ 11. ... Kyle Anderson had 13 points on 6-for-7 shooting.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Visit the Chicago Bulls on Tuesday.\n\n\r\n                    Grizzlies: Visit the Phoenix Suns on Monday.",
  "source": "espn_api",
  "crawled_at": 1764996954.4272032
}