{
  "game_id": "0021900338",
  "espn_id": "401160980",
  "date": "Dec 08, 2019",
  "matchup": "TOR @ PHI",
  "headline": "Harris scores 26, Thybulle 20 as 76ers beat Raptors 110-104",
  "body": "PHILADELPHIA --  This victory over the Toronto Raptors didn’t feel as good as it should have to the Philadelphia 76ers because of their shaky finish.\n\nTobias Harris scored 26 points and rookie Matisse Thybulle had a career-high 20 points, including a pair of free throws with 23 seconds left, to lead Philadelphia 76ers to their 12th straight home victory, 110-104 over the Raptors on Sunday night.\n\nBen Simmons had 16 points, 11 rebounds and nine assists a day after scoring a career-high 34 points while hitting his second career 3-pointer as the Sixers remained unbeaten at home this season.\n\nPhiladelphia led by 20 points with 6½ minutes left and seemed on the way to an easy victory before seven turnovers down the stretch, including turnovers by Joel Embiid on three consecutive possessions, had coach Brett Brown feeling lukewarm about the win.\n\n“Where do we begin?” Brown responded when asked about the finish. “The way it ended left a little bit of a sour taste.”\n\nThybulle finally iced the game with a pair of free throws with 26.3 seconds left that made it 107-100.\n\nKyle Lowry, playing in his second game after missing 11 in a row due to a broken left thumb, scored 26 points, and OG Anunoby had 19 points and 10 rebounds for Toronto. The defending champion Raptors have lost three in a row.\n\n“Our rhythm wasn’t great and we didn’t shoot it great,” Toronto coach Nick Nurse said.\n\nEmbiid returned from a one-game absence due to a hip injury, finishing with 10 points and eight rebounds. Embiid was benched with 2:08 remaining after committing the three turnovers but did return to the floor. He had seven of Philadelphia’s 17 turnovers.\n\n“He had some rough decisions, but he’s one of the main reasons we won,” Brown said. “Something we will learn and grow from.”\n\nToronto got close late, but the Raptors had dug too big of a hole in the third quarter.\n\nPhiladelphia held Toronto to 36% shooting in the first half while taking a 57-42 lead at the break. The 76ers continued to clamp down on the Raptors offense after halftime and got a big lift from the bench during a decisive third-quarter run that saw their lead grow to as many as 20 points, 73-53, on Al Horford’s hook with 4:23 remaining in the period.\n\nIt was 63-53 Philadelphia when Lowry made the first of two free throws with 5:51 left. Then, Thybulle sandwiched a pair of 3-pointers around a James Ennis III layup before Horford’s shot that capped a 10-0 run over 1:28. Simmons put the exclamation point on the quarter with a driving, one-handed slam over Gasol.\n\nSTREAKING SIXERS\n\nPhiladelphia is nine games shy of tying the club record for home wins to start a season. The franchise has won 21 straight home games to start a campaign three times, twice in Syracuse (1949-50 and 1952-53 seasons) and once after moving to Philadelphia (1966-67).\n\nIMPROVED EMBIID\n\nIt wasn’t Embiid’s best performance, but it was much better than the last time the teams met.\n\nEmbiid had the worst game of his career in a 101-96 loss at Toronto on Nov. 25. He was scoreless in 32 minutes, went 0 for 11 from the field, including 0 for 4 from 3-point range, and missed all three free-throw attempts. In the five games that followed and entering Sunday, Embiid averaged 26.8 points and 15.2 rebounds while going to the free-throw line 64 times, making 56.\n\nTIP-INS\n\nRaptors: Fred VanVleet (right knee contusion) was injured in the first half and didn’t return. He had two points in 12 minutes and missed his only 3-point attempt, ending his streak of at least one 3 in every game this season. Now, only Houston’s James Harden and Brooklyn’s Taurean Prince have a 3 in every game this season. … Terrence Davis II was issued a Flagrant 1 foul with 34.4 seconds left in the first quarter while contesting Mike Scott’s 3-pointer.\n\n76ers: Josh Richardson (right hamstring strain) missed his sixth straight game. … The teams will meet twice more, Jan. 22 at Toronto, and March 18 in Philadelphia. … Philadelphia Flyers goalie Carter Hart rang the ceremonial Liberty Bell prior to the game and sat courtside with teammate Scott Laughton.\n\nUP NEXT\n\nRaptors: At Chicago on Monday.\n\n76ers: Host Denver on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995638.085715
}