{
  "game_id": "401809937",
  "espn_id": "401809937",
  "date": "Oct 22, 2025",
  "matchup": "CHI vs DET",
  "headline": "Vucevic, Buzelis, Giddey lead way, Bulls beat Pistons 115-111 after blowing big lead",
  "body": "CHICAGO -- — Nikola Vucevic had 28 points and 14 rebounds, Matas Buzelis scored 21 points and the Chicago Bulls regrouped after blowing a 23-point lead to beat the Detroit Pistons 115-111 in their opener Wednesday night.\n\n\r\n              Josh Giddey added 19 points and 11 assists, and the Bulls went from leading by 23 in the second quarter to knotted near the end of the game.\n\n\r\n              Detroit’s Ron Holland II tied it at 105 when he made a 3 with just under three minutes remaining. Vucevic hit an 8-footer that Detroit’s Cade Cunningham answered with a fadeaway jumper.\n\n\r\n              Buzelis threw down an alley-oop dunk before Cunningham drove for a layup that tied it 109. Vucevic then made a hook to put Chicago back on top with 1:31 remaining.\n\n\r\n              Giddey had a chance to make it a four-point when he got fouled with 34 seconds remaining. But after making the first free throw, he missed the second.\n\n\r\n              Detroit got the rebound, and Cunningham drove for a layup to pull the Pistons within one. He then was charged with a foul trying to poke the ball from Giddey after a successful challenge by Chicago.\n\n\r\n              Giddey hit both free throws to make it 114-111 with 14 seconds remaining. Cunningham and Tobias Harris missed 3s, and Giddey made 1 of 2 free throws with three seconds left to seal it.\n\n\r\n              Cunningham scored 23 points. Isaiah Stewart added 20 points and 10 rebounds, and Holland had 19 points.\n\n\r\n              Jalen Duren finished with 15 points after picking up two fouls in the game’s opening minutes, and the Pistons opened a promising season on a sour note. Detroit has its sights set higher after going from 14 wins to 44 last year in one of the greatest turnarounds in NBA history. The Pistons lost to New York in the first round of the playoffs.\n\n\r\n              It didn’t help Detroit that Jaden Ivey is recovering from surgery on his right knee. But Chicago was also down a star, with Coby White expected to miss at least the first six games due to a strained right calf.\n\n\r\n              Up next\r\n              \r\n              Pistons: At Houston on Friday night.\n\n\r\n              Bulls: At Orlando on Saturday night. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042479.462623
}