{
  "game_id": "0021900535",
  "espn_id": "401161177",
  "date": "Jan 05, 2020",
  "matchup": "MIA vs. POR",
  "headline": "Dragic leads Heat by Blazers in Whiteside's return, 122-111",
  "body": "MIAMI --  James Johnson scored on his first possession in more than a month. Dragic either scored or got somebody else points pretty much every time the ball was in his hands.\n\nAs often is the case for Miami, bench guys came up big.\n\nDragic had 29 points and 13 assists, Bam Adebayo added 20 points on 9-for-10 shooting and the Heat -- without Jimmy Butler -- never trailed in a 122-111 victory over the Portland Trail Blazers on Sunday night.\n\n\"It doesn't matter for us who's playing or not,\" Dragic said. \"We don't use excuses.\"\n\nDragic tied a career best with seven 3-pointers. Derrick Jones Jr. scored 19 points for the Heat, who got 14 from Kendrick Nunn and 12 in 22 minutes from little-used Johnson -- who was called upon largely because Miami was without Butler.\n\nIt was Johnson's first minutes since Nov. 27.\n\n\"I've been in every situation that this league can offer, honestly,\" Johnson said. \"I know for sure it can be worse.\"\n\nTyler Herro scored 11 points for Miami, as did Meyers Leonard in his first game against his former team.\n\nDamian Lillard led Portland with 34 points and 12 assists. Former Heat center Hassan Whiteside, booed almost every time he touched the ball, finished with 21 points and 18 rebounds for Portland.\n\n\"It felt weird at first,\" Whiteside said of playing against his former club. \"But a lot of them guys I haven't played with. There were a few guys out there that I actually knew.\"\n\nBoth teams were missing starters unexpectedly. Miami was without Butler, ruled out because of back soreness. Portland played without the services of CJ McCollum for the first time this season; he was out with an upper-respiratory infection.\n\n\"Any time one of your best players is not on the floor you're going to be less of a team,\" Lillard said. \"We're professionals and that's when you turn to the next guy. ... It's tough not having him but they didn't have their best player.\n\nAnfernee Simons scored 19 points off the bench for Portland, which cut a 24-point deficit to nine in the third quarter but no closer.\n\n\"Whatever word you want to use, we didn't compete hard enough in the first half,\" Portland coach Terry Stotts said. \"They had us on our heels from the outset.\"\n\nThe Heat improved their NBA-best home record to 17-1 -- that's only two wins shy of their home total for 41 games last season -- and are 10-0 after losses.\n\nHeat coach Erik Spoelstra said he still roots for Whiteside, who spent five years with Miami and got traded this summer as part of the series of moves that allowed the Heat to land Butler.\n\n\"We invested a lot into him and he invested a lot into us,\" Spoelstra said. \"For whatever reason -- it just happens in this business -- it was just time to turn the page on that team and it's not anyone's fault.\"\n\nTIP-INS\n\nTrail Blazers: Portland, perhaps surprisingly, had won 12 of its last 15 games without McCollum over the last three-plus seasons. ... Carmelo Anthony played a game in Miami for the 21st time -- and just his second appearance there since Dec. 6, 2016. ... Portland fell to 2-18 when trailing after three quarters, 0-13 when trailing by more than seven points.\n\nHeat: Justise Winslow (bone bruise in back) missed his 15th consecutive game, though is apparently on the cusp of returning. ... Johnson played for the first time since Nov. 27 and for just the second time at home all season. ... Dion Waiters was available but still hasn't played this season. ... It was \"Kids Day\" and Spoelstra held his oldest son Santiago on-court for the national anthem.\n\nTENANT VS. LANDLORD\n\nLeonard opened the game guarding Whiteside, in the very rare -- and possibly unprecedented -- instance of a tenant guarding his landlord. Leonard and his wife are renting Whiteside's Miami house this season. \"You want a guy at your house who's going to take care of it,\" Whiteside said of Leonard, who, coincidentally, also occupies Whiteside's former locker.\n\nYEAGER HONORED\n\nAs part of Miami's \"Home Strong\" program, retired Air Force brigadier general Chuck Yeager -- the first person to fly faster than the speed of sound -- was honored before the game. The 96-year-old Yeager visited with Heat President Pat Riley at halftime. Since the inception of the Home Strong program, the Heat have honored over 750 military personnel and their families on center court prior to the national anthem.\n\nUP NEXT\n\nTrail Blazers: Visit Toronto on Tuesday, the fourth game on their five-game road swing.\n\nHeat: Visit Indiana on Wednesday to start a three-game trip, also to Brooklyn and New York.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996618.34205
}