{
  "game_id": "0021500824",
  "espn_id": "400828711",
  "date": "Feb 21, 2016",
  "matchup": "OKC vs. CLE",
  "headline": "Love scores 29, leads Cavaliers past Thunder 115-92",
  "body": "OKLAHOMA CITY -- The Cleveland Cavaliers are starting to get comfortable in marquee games under new coach Tyronn Lue.\nKevin Love scored 29 points to help the streaking Cavaliers roll past the Oklahoma City Thunder 115-92 on Sunday.\nOn Jan. 30, the Cavaliers beat the San Antonio Spurs, who have the NBA's second-best record. Now, they have beaten the Thunder, who entered the game with the league's fourth-best mark. Lue believes there's something to the idea that the Cavaliers play up to their competition.\n\n\"I would like to say that,\" he said. \"I hope so. When we play teams that are great teams, we always seem to rise for the challenge.\"\nThe Cavaliers romped to their fifth straight win, even though point guard Kyrie Irving sat out after the first quarter because of flu-like symptoms.\n\"He couldn't even walk through today, and then he said he was going to try to play the game, start the game and see how he feels,\" Lue said.\nCleveland had even more problems. Iman Shumpert missed the game with a sprained left shoulder, and fellow guard Mo Williams sat out with a sore left knee.\n\"It just shows our team is willing to step up when guys go down,\" Lue said. \"Same situation last year. When guys went down, we were able to make it to the Finals. These guys step up. They play hard, they play for each other. If they continue to do that, they'll be fine.\"\nLove shot 9 of 18 from the field and 11 for 12 at the free throw line to match his second-best scoring performance of the season.\nLeBron James had 25 points, 11 assists and seven rebounds, and Tristan Thompson had 14 points and 14 rebounds for Cleveland.\nThe Cavaliers outrebounded Oklahoma City, one of the league's best teams on the boards, 49-39.\n\"We have to bring the fight, no matter who we're playing,\" James said. \"It just makes us focus when we're more physical. We're more in tune.\"\nKevin Durant scored 26 points and Russell Westbrook had 20 points, 11 assists and nine rebounds for Oklahoma City, which lost its second straight at home coming out of the All-Star break. It was the Thunder's most lopsided defeat of the season.\n\"We aren't going to go home and think it's the end of the world,\" Durant said. \"We lost a game against a good team. We've got to regroup and figure out what we need to do better and move on.\"\nJames had 18 points in the first half to help Cleveland take a 62-53 lead at the break. The Thunder cut into the deficit early in the third quarter, but J.R. Smith's 3-pointer with just under 7 minutes left in the period put the Cavaliers ahead 75-62. Another 3 by Smith made it 80-64.\nCleveland expanded its lead to 95-73 by the end of the quarter and was not threatened again.\nSTAT LINES\nOklahoma City shot 35.6 percent from the field in the second half and just 2 of 13 on 3-pointers after the break.\nQUOTABLE\nThunder coach Billy Donovan: \"I think the more adversity our team faces, I think the better, because I think that is the only true way to really come together, rise above it.\"\nSTAR POWER\nNorman North (Oklahoma) point guard Trae Young visited James in the Cleveland locker room. The 6-foot-1 junior is considered one of the top high school basketball prospects in the nation.\nTIP-INS\nCavaliers: Big man Channing Frye, acquired last week in a trade with Orlando, still wasn't active. A team spokesman said before the game the team was simply being diligent, and there was \"nothing alarming\" going on. ... Cavaliers owner Dan Gilbert tweeted his thanks to Anderson Varejao for his play during his 12 years in Cleveland. Varejao was traded as part of the deal that brought Frye to the Cavaliers.\nThunder: G Andre Roberson was active and dressed after missing the previous nine games with a right knee sprain. He did not play. ... Randy Foye, acquired in a trade with Denver last week, made his Thunder debut. ... C Steven Adams scored nine points in the first quarter, matching the second-highest total of his career for a quarter. He did not score the rest of the game.\nUP NEXT\nThe Cavaliers host the Detroit Pistons on Monday.\nThe Thunder play at the Dallas Mavericks on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994152.283218
}