{
  "game_id": "0021900822",
  "espn_id": "401161464",
  "date": "Feb 20, 2020",
  "matchup": "BKN @ PHI",
  "headline": "Embiid has 39, powers 76ers past Nets in overtime, 112-104",
  "body": "PHILADELPHIA --  A few weeks before the All-Star break, Joel Embiid said he wasn’t having much fun on the basketball floor this season.\n\nEmbiid was back to his old self Thursday night, flapping his arms to the crowd, smiling from ear to ear and taking over a game at critical moments.\n\nEmbiid had 39 points and 16 rebounds, Alec Burks and Shake Milton added big baskets in overtime and the Philadelphia 76ers extended their dominance at home with a 112-104 victory over the Brooklyn Nets.\n\n“Having fun means a lot of things,” Embiid said. “This year, I haven’t been smiling as much as previous years. That doesn’t mean I’m not having fun or that everything is not going well. It’s about playing basketball the right way. I feel like the first part of the season, I was trying to make sure that everyone was comfortable. But if we’re going to go somewhere, I’ve got to be one of the guys and that starts on defense and playing hard, doing the little things.”\n\nPlaying without All-Star point guard Ben Simmons because of lower back tightness, Philadelphia improved its record at the Wells Fargo Center to 26-2. The 76ers are 9-19 on the road.\n\nTobias Harris added 22 points and 12 boards for the 76ers. Burks had 19 points, including a pair of layups in overtime that gave Philadelphia the lead for good.\n\nCaris LeVert scored 25 points and Spencer Dinwiddie had 22 for Brooklyn, which announced before the game that Kyrie Irving would have season-ending surgery on his right shoulder.\n\n“Obviously, Embiid is one of, if not the best center of the league,” Dinwiddie said. “He does his job on both ends of the floor. And tonight, he did his job and got his team a win.”\n\nIt was a night of extended runs that started with Philadelphia breaking out of the gate to a 22-6 lead, only for the Nets to follow with a 44-8 stretch that helped them to a 52-42 halftime lead. It could have been worse for the Sixers if not for a 12-2 closing run.\n\n“The run we had at the end of the first half to get it back to 10 was big,” Embiid said. “We were able to get some momentum in those moments.\"\n\nEmbiid started to assert more of a presence early in the second half, controlling the game from the paint and helping the Sixers get within 78-77.\n\n“When you go to the All-Star Game and other All-Stars come to you when its crunch time at the end of the game, there’s no greater boost than that,” 76ers coach Brett Brown said. “And his defense, his energy and his passion were contagious tonight for the other four players.”\n\nDinwiddie hit a fadeaway jumper with 30 seconds left in regulation to give Brooklyn a 103-101 lead, then fouled Embiid at the other end with 16 seconds to play. Embiid hit both foul shots to even the score and Brooklyn played for the last shot, but Wilson Chandler’s layup at the rim after a pass from Dinwiddie was knocked away by Embiid just as the horn sounded to send the game to overtime.\n\nAfter Dinwiddie hit one of two free throws to give Brooklyn a 104-103 lead, the 76ers went on a 9-0 run with Burks hitting two running layups and Milton converting a pass from Harris in the lane into an easy basket.\n\nTIP-INS\n\nSixers: Simmons played in Sunday night’s All-Star Game in a reserve role for LeBron James’ squad. Simmons is officially listed as day-to-day. In his place, Raul Neto started at the point guard spot. It is the third game this season that Simmons has missed. He injured the AC joint in his shoulder in November and missed two games.\n\nNets: With the loss of Irving, the Nets will have to make a run to the playoffs with a starting lineup of Joe Harris, Taurean Prince, Jarrett Allen, LeVert and Dinwiddie. “I think our players have done a great job with that,” Nets coach Kenny Atkinson said before the game. “I don’t think they feel anything like that at all. They look at is as a challenge and an opportunity to do something special. I’ve been so pleased with the spirit and attitude. The spirit is really good in there and I think these guys want to surprise some people.”\n\nWORKING ON HORFORD\n\nAl Horford’s adjustment to life coming off the Philadelphia bench was rocky on Thursday night. Horford’s initial entrance came just as Brooklyn started its 44-8 run, where the 76ers forward appeared flat-footed against Brooklyn’s smaller lineup.\n\nHorford,in the first year of a four-year, $110 million contract, scored six points, grabbed three rebounds and the 76ers were outscored by 26 points in his 18 1/2 minutes.\n\nUP NEXT\n\nSixers: Head to Milwaukee for a game on Saturday night.\n\nNets: At Charlotte on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996706.242901
}