{
  "game_id": "0021901296",
  "espn_id": "401224771",
  "date": "Aug 10, 2020",
  "matchup": "LAL vs. DEN",
  "headline": "Kuzma's 3-pointer lifts Lakers to 124-121 win over Nuggets",
  "body": "LAKE BUENA VISTA, Fla. --  Kyle Kuzma hit a 3-pointer with .4 seconds left and the Los Angeles Lakers beat the Denver Nuggets 124-121 Monday night to snap a three-game losing streak.\n\nLeBron James threw an inbounds pass to Anthony Davis, who flipped it to Kuzma on the right wing for the game-winner as the clock ran down.\n\nThe Lakers, outplayed down the stretch by Denver's bench, got 29 points and 12 assists from James, who hit two 3-pointers in the fourth quarter. Anthony Davis had 27 points and Kuzma 25.\n\nP.J. Dozier had a chance to put the Nuggets up by one with 4.4 seconds left but missed the second of two free throws. Kuzma rebounded and the Lakers called timeout to set up the winning play.\n\n\"I got an open look. It's a play we ran in practice a few times prior to the restart,\" Kuzma said. \"Coach had faith in me, called my number and it paid off. It just shows that my teammates and my coaches, they trust in me, the trust they have in me, every time we ran that play in practice I've kind of hit that shot. Obviously the play 9 out of 10 times is going to LeBron, but they called my number. It's all about trust.\"\n\nDozier had been fouled by Kuzma while driving the lane after a miss by James.\n\nJames had given the Lakers a 121-119 lead by converting a 3-point play with 45.7 seconds to go. Monte Morris made one of two free throws for the Nuggets.\n\nThe Lakers had clinched the No. 1 seed in the Western Conference before their losing streak started. They are 3-4 in the bubble with one game to go.\n\n\"I think the biggest thing is for us to build habits, winning championship habits, especially since we locked up first place,\" Kuzma said. \"There's a little bit of time you can chill and relax. We don't really have that margin for error. Like most teams, we have new parts and are trying to fit new guys in and I think the biggest thing, is try to build camaraderie with the new group.\"\n\nDozier scored 18 and Michael Porter Jr. had 15 for the Nuggets, who are currently the No. 3 seed in the West.\n\n\"I couldn't be more proud of our group,\" Denver coach Michael Malone said. \"They played extremely hard against the No. 1 seed in the Western Conference. It was the fourth time we played them and every game has been a battle down to the wire. For us to sit out starters the whole fourth quarter and to have the guys on the bench out there giving them all they could handle, it was a heartbreaker. It's always tough, but just so proud. I could not ask for a greater effort, greater focus, energy, whatever you want to call it.\"\n\nThe Lakers took an 87-80 lead late in the third quarter after two buckets by Kuzma and two free throws by Davis. But the Nuggets went on an 8-1 run to finish the quarter in an 88-88 tie. Mason Plumlee made a jumper and Bol Bol and Morris each made a 3-pointer\n\nDavis grabbed the rebound of Kuzma's miss for a slam dunk at the halftime buzzer that gave the Lakers a 64-59 halftime lead. Davis also made a similar play off miss by Kuzma in the last minute of the first quarter.\n\nTIP-INS\n\nNuggets: Clinched the Northwest Division after the Oklahoma City Thunder lost to the Phoenix Suns earlier Monday. ... Dozier converted a four-point play early in the second quarter.\n\nLakers: Dion Waiters had 12 points in 12 minutes off the bench in the first half. ... Davis had big plays on both ends during a sequence in the first quarter, when he stole the ball and then took a pass from James for a layup.\n\nUP NEXT\n\nNuggets: Play the Los Angeles Clippers on Wednesday in their penultimate seeding game.\n\nLakers: Play the Sacramento Kings on Thursday in their final bubble game.",
  "source": "espn_api",
  "crawled_at": 1764995961.767811
}