{
  "game_id": "0021500170",
  "espn_id": "400828057",
  "date": "Nov 18, 2015",
  "matchup": "HOU vs. POR",
  "headline": "James Harden lifts Rockets to OT win after Kevin McHale firing",
  "body": "HOUSTON -- James Harden knew something had to change, and he didn't mean the coach.\nHours after the unexpected firing of Kevin McHale, Harden shrugged off his slow start following his MVP runner-up season to score 45 points, including all nine for Houston in overtime of a 108-103 victory over the Portland Trail Blazers on Wednesday night.\n\"Making shots or missing shots, I've got to get my game where it needs to be to get this team where it wants to go,\" Harden said. \"Picking my energy up -- tonight was the beginning of it.\"\nCorey Brewer made an off-balance 3-pointer to force overtime, and Harden took over from there, finishing with 11 assists, eight rebounds and five steals as the Rockets capped off an emotional day at the Toyota Center.\nIt nearly ended with a fifth straight loss before Brewer made his shot with 0.9 seconds remaining to tie it at 99.\n\"When somebody makes a shot like that, it can wake up everybody,\" Brewer said. \"If that shot changes the season around, I'm happy to make it, but now it's time to start winning.\"\nThe Rockets played much of the game with sloppy mistakes and dreadful shooting. Interim coach J.B. Bickerstaff, son of longtime NBA coach Bernie Bickerstaff, served in his first game as head coach.\n\"The way it happened is the way it needed to happen,\" Bickerstaff said of the dramatic win. \"Our guys were down, but for us to show perseverance, show fight, show the grit, toughness and togetherness speaks volumes.\"\nThe Blazers dropped their seventh straight, their worst losing streak since closing 2012-13 on a 13-game skid.\n\"In the NBA, strange things can happen,\" Portland coach Terry Stotts said. \"We weren't able to close it out, and Corey Brewer hits a one-legged runner from the logo, and that's the way it goes.\"\nDamian Lillard led Portland with 23 points, C.J. McCollum had 19 and Al-Farouq Aminu added 16.\nHouston snapped its longest skid since the 2012-13 season in its first game without McHale.\n\"We're going to miss him being around,\" Dwight Howard said. \"But we've got to still fight for him and try to win this championship. Things started out a little rocky, but we're going to turn this thing around.\"\nHoward hauled in 19 rebounds, Trevor Ariza had 18 points and Brewer scored 16 off the bench.\nRockets owner Leslie Alexander watched from the first row at midcourt as his seemingly uninspired team entered halftime in a 46-35 hole. The struggles continued, and the Rockets ended the third with a 15-point deficit after Marcus Thornton's jump shot wedged awkwardly between the rim and the backboard.\nRockets 38-year-old point guard Jason Terry got his first start of the season, replacing struggling guard Ty Lawson, who was acquired from Denver in the offseason. Lawson finished the game with two points on 1-of-8 shooting.\nTIP-INS\nBlazers: PF Meyers Leonard missed his fifth consecutive game with a shoulder injury but participated in pregame workouts. ... Allen Crabbe scored 15 points off the bench. ... The Blazers have lost four straight games that were within one possession in the final three minutes.\nRockets: Houston scored just 13 points in the second quarter, a season low. ... Houston was without PG Patrick Beverley (ankle) for a third straight game. ... First-round pick Sam Dekker will have back surgery Friday and is expected to miss three months.\nCY YOUNG IN THE HOUSE\nHouston Astros ace Dallas Keuchel, who won the American League Cy Young Award on Wednesday evening, was in attendance. When his presence was announced and displayed on the video board, he drew one of the loudest ovations of the night.\nBEEN THERE BEFORE\nStotts spoke highly of McHale before the game and empathized with the pain of being fired midseason. \"Coaches don't need any reminders (of how hard the job is),\" Stotts said. \"We're pretty much in tune with that aspect of it.\" Stotts was fired in the middle of his second season with Milwaukee in 2007 and said he watched the following game as a spectator.\nHARDEN'S LINE\nWith 45 points, 11 assists, eight rebounds and five steals, Harden became the first player in NBA history to post those numbers in a single game since steals became an official stat in 1973-74, according to the Elias Sports Bureau. It was Harden's third 40-point game of the season and 13th since the start of 2014-15, the most in the league.\nLEARNING EXPERIENCE\nPortland shooting guard Gerald Henderson, on Brewer's shot: \"That's the NBA, man. I was telling some of the younger guys, you're going to see some stuff that you have never seen before. He hit a crazy shot. I wouldn't bank on him hitting that shot one time out of 20.\"\nUP NEXT\nBlazers: Hosts the Clippers on Friday.\nRockets: Visits Memphis on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994665.044825
}