{
  "game_id": "0022300763",
  "espn_id": "401585391",
  "date": "Feb 12, 2024",
  "matchup": "ATL vs. CHI",
  "headline": "Ayo Dosunmu scores 29, Bulls post season high in points to beat Hawks 136-126",
  "body": "ATLANTA -- — Ayo Dosunmu had a career-high 29 points and added seven assists to help the Chicago Bulls post a season-high score and beat the Atlanta Hawks 136-126 on Monday night.\n\n\r\n              DeMar DeRozan also had 29 points and Nikola Vucevic finished with 24 points and 11 rebounds. Coby White added 20 points and seven assists.\n\n\r\n              Bogdan Bogdanovic and De’Andre Hunter led the Hawks off the bench. Bogdanovic had 28 points and Hunter scored 23. Trae Young had 19 points, but was 2 of 10 from 3-point range.\n\n\r\n              “We didn’t want to make it a shootout, but we wanted to play fast,” Dosunmu said. “Even when we scored, they get it out fast. We wanted to go blow-for-blow with them. We wanted to do our best and guard on defense, but the way the game was going, both teams were scoring and then we got some big meaningful stops down the stretch.”\n\n\r\n              The win kept Chicago two games in front of the Hawks for the No. 9 seed in the East. The Bulls have won both games against Atlanta this season.\n\n\r\n              Dosunmu was 12 of 18 from the floor and 5 of 7 from 3. He continually created havoc for the Atlanta defense with drives to the basket that created opportunities for himself and his teammates.\n\n\r\n              “We didn’t start the game great, but Ayo’s pace and tempo in that second quarter really got us back in the game. He was downhill,” said Bulls coach Billy Donovan. “Whether it was him knocking down some 3s or getting to the rim, he did a lot of good things tonight.”\n\n\r\n              The Hawks had won six of their last eight, but they allowed the Bulls to shoot 55.4% from the floor and 46.4% from 3 to slow their momentum as the All-Star break approaches. The Bulls had been averaging 111.5 points per game entering the contest.\n\n\r\n              “We had a lot of late switches,” Hawks coach Quin Snyder said. “We all have to be better guarding the ball.”\n\n\r\n              The Bulls trailed most of the first half, but closed the second quarter on a 12-2 run to take a 60-59 lead. Dosunmu had eight points during the run as Chicago scored on five straight possessions.\n\n\r\n              The Hawks were missing starting center Clint Capela, who will not return until after the All-Star break with a left adductor strain.\n\n\r\n              Torrey Craig started in place of Alex Caruso, who hurt his foot in Orlando in the Bulls' previous game.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Finish a four-game road trip at Cleveland on Wednesday night.\n\n\r\n              Hawks: Visit Charlotte on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996280.497149
}