{
  "game_id": "401810218",
  "espn_id": "401810218",
  "date": "Dec 07, 2025",
  "matchup": "UTAH vs OKC",
  "headline": "Thunder take on the Jazz, look for 15th straight victory",
  "body": "Oklahoma City Thunder (22-1, first in the Western Conference) vs. Utah Jazz (8-14, 11th in the Western Conference)\n\n\r\n              Salt Lake City; Sunday, 8 p.m. EST\n\n\r\n              BOTTOM LINE: Oklahoma City aims to keep its 14-game win streak intact when the Thunder take on Utah.\n\n\r\n              The Jazz are 4-10 against Western Conference opponents. Utah averages 29.7 assists per game to lead the Western Conference, paced by Keyonte George with 6.9.\n\n\r\n              The Thunder are 18-1 against Western Conference opponents. Oklahoma City ranks sixth in the Western Conference with 26.3 assists per game led by Shai Gilgeous-Alexander averaging 6.4.\n\n\r\n              The 118.4 points per game the Jazz average are 11.3 more points than the Thunder allow (107.1). The Thunder average 13.6 made 3-pointers per game this season, 1.5 fewer made shots on average than the 15.1 per game the Jazz give up.\n\n\r\n              The two teams match up for the second time this season. The Thunder defeated the Jazz 144-112 in their last meeting on Nov. 22. Gilgeous-Alexander led the Thunder with 31 points, and George led the Jazz with 20 points.\n\n\r\n              TOP PERFORMERS: Lauri Markkanen is scoring 27.6 points per game with 6.5 rebounds and 2.0 assists for the Jazz. George is averaging 18.0 points and 0.0 rebounds while shooting 41.7% over the last 10 games.\n\n\r\n              Gilgeous-Alexander is averaging 32.8 points and 6.4 assists for the Thunder. Chet Holmgren is averaging 15.0 points over the last 10 games.\n\n\r\n              LAST 10 GAMES: Jazz: 4-6, averaging 120.8 points, 42.5 rebounds, 30.2 assists, 8.8 steals and 3.4 blocks per game while shooting 46.7% from the field. Their opponents have averaged 130.2 points per game.\n\n\r\n              Thunder: 10-0, averaging 122.9 points, 41.7 rebounds, 27.3 assists, 9.1 steals and 5.7 blocks per game while shooting 51.9% from the field. Their opponents have averaged 107.3 points.\n\n\r\n              INJURIES: Jazz: Georges Niang: out (foot), Walker Kessler: out for season (shoulder).\n\n\r\n              Thunder: Nikola Topic: out (groin), Alex Caruso: day to day (quad), Isaiah Joe: day to day (knee), Isaiah Hartenstein: out (ankle), Thomas Sorber: out for season (knee), Luguentz Dort: day to day (adductor).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042773.8711271
}