{
  "game_id": "0022200027",
  "espn_id": "401468182",
  "date": "Oct 21, 2022",
  "matchup": "PHX @ POR",
  "headline": "Lillard has 41 points Trail Blazers beat Suns 113-111 in OT",
  "body": "PORTLAND, Ore. -- — Damian Lillard scored 41 points and the Portland Trail Blazers beat the Phoenix Suns 113-111 in overtime Friday night for their second straight victory to open the season.\n\n\r\n              Anfernee Simons made a hook shot with 7.2 seconds left in overtime and finished with 16 points. Jusuf Nurkic had 20 points and 17 rebounds. \n\n\r\n              Devin Booker led Phoenix with 33 points. His layup gave Phoenix a 109-106 lead early in the extra period. \n\n\r\n              Lillard's free throws with 33.9 seconds left tied it at 111. Booker missed a short jumper before Simons' hook put Portland in front. Nurkic fouled Deandre Ayton on the other end, but Ayton missed the first, then missed the second on purpose for a failed try at a tying basket.\n\n\r\n              “I told him: `I trust you, put your big-boy pants on. You got the big contract, you got the game, you put the work in,'\" Lillard said about trusting backcourt partner Simons in the end. \n\n\r\n              Booker said Ayton's second miss was right where it needed to be for a second chance at tying the game. “It’s the NBA,” he said. “Those guys are trying to win, too, and they’re professionals so there’s going to be nights like that.”\n\n\r\n              The Suns led by 12 points in the first half, but Portland crept back to tie it at 79 early in the fourth quarter off Nassir Little's pullup jumper and it was close the rest of the way. \n\n\r\n              Chris Paul's driving layup gave the Suns a 101-100 lead with 59.9 seconds to go in regulation. After Nurkic made free throws for Portland, Mikal Bridges made the second of two free throws to tie it at 102 with 37.1 seconds left. Lillard missed an off-balance jumper to send the game to overtime. \n\n\r\n              “The way we look now, we have the depth to come back from any deficit,” Nurkic said. “But ideally, we don't want to come to that point.” \n\n\r\n              The Suns were coming off a 107-105 victory over Dallas on Wednesday in their season opener. The Suns won 64 games last season but fell to the Mavericks in the Western Conference semifinals. \n\n\r\n              Portland won its opener 115-108 on Wednesday night at Sacramento. \n\n\r\n              MEMORIES\n\n\r\n              Suns coach Monty Williams is always nostalgic when he comes to Portland, where he got his start as an assistant under former Blazers coach Nate McMillan from 2005-10. \n\n\r\n              He recalled Friday how one season McMillan tore his Achilles and he was thrust into the head coach's role for a time. \n\n\r\n              “I'll never forget, I was walking the sidelines because Nate would want me to communicate with the players. I turned to ask him for a call and he just like barked at me, `You make the call!'\" Williams said. “It was like, ‘I put you up there for a reason so stop being you and be me for a second and make the call.’\" \n\n\r\n              TIP INS\n\n\r\n              Suns: Williams said he's taking it slow with Landry Shamet, who has started the season sidelined with a left hip strain. “The last thing I want to do is put more pressure on a guy to get back on the floor. I just wait for our team to let me know when a guy is ready.”\n\n\r\n              Trail Blazers: Lillard led all scorers with 28 points, including four 3-pointers, in the first half alone. Lillard played just 29 games last season before he had surgery to correct a nagging abdominal injury.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Los Angeles Clippers on Sunday night. \n\n\r\n              Trail Blazers: At Los Angeles Lakers on Sunday. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995099.900149
}