{
  "game_id": "0022300569",
  "espn_id": "401585197",
  "date": "Jan 17, 2024",
  "matchup": "MIN @ DET",
  "headline": "Edwards has 27 points and eight assists to lead Timberwolves to 124-117 win over Pistons",
  "body": "DETROIT -- — Anthony Edwards had 27 points and eight assists to lead the Minnesota Timberwolves to a 124-117 win against the Detroit Pistons on Wednesday night.\n\n\r\n              “I wasn't a huge fan of our performance tonight, but we did enough to get the win, and that's what matters,” Timberwolves coach Chris Finch said. “It really wasn't the standard we would hope for, though.”\n\n\r\n              The Pistons, who beat the Wizards on Monday, are 2-35 after winning two of their first three games, including a 28-game losing streak that matched the NBA record.\n\n\r\n              “Like I said at the beginning of the season, we're going to have to improve month by month,” Pistons coach Monty Williams said. “Our record doesn't reflect it, but we're growing.”\n\n\r\n              Karl-Anthony Towns scored 27 points for Minnesota, which has won three straight. Jaden McDaniels had 23 points and Rudy Gobert added 19 points and 16 assists.\n\n\r\n              “We had a slow start today and we weren't happy with the way we played in the first half,” Gobert said. “We did a good job of picking things up throughout the game — we gave up (40) points in the first quarter and they finished with 117, so we were better.”\n\n\r\n              Jaden Ivey matched his career high with 32 points for the Pistons, who were starting a six-game homestand without Cade Cunningham (knee). Bojan Bogdanovic had 20 points and Jalen Duren added 16 points and 11 rebounds.\n\n\r\n              Minnesota hit three of its first four 3-pointers in the second half, building an 81-69 lead, and the Pistons needed nine points from Ivey to trail 98-90 at the end of the third quarter.\n\n\r\n              The Timberwolves quickly moved the margin to 17, but Ivey's 3-pointer pulled Detroit to 115-109 with 3:56 to play. \n\n\r\n              McDaniels and Towns, though, hit back-to-back 3-pointers to seal the win.\n\n\r\n              “I thought we fought hard all game,” Ivey said. “They just hit some big shots at the end and we had some breakdowns.”\n\n\r\n              Gobert had 17 points and eight rebounds as the Timberwolves took a 70-62 halftime lead. Both teams shot over 50% from the floor, thanks to some uninspired defense.\n\n\r\n              “I really didn't like our seriousness in the first half,” Finch said. “The first quarter was 40-39. I mean, that's ridiculous. You're just trading baskets, and when that happens, everyone starts to think it is going to be too easy.”\n\n\r\n              Mike Muscala had three rebounds, two assists and two blocks in his Pistons debut. He and Danilo Gallinari (DNP-CD) were acquired from the Wizards on Monday for Marvin Bagley III, Isaiah Livers and two draft picks.\n\n\r\n              “I thought he was huge,” Williams said. “Young teams around the league surround their young guys with savvy players who can still play. There are things we think he can do to help our ball club.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host the Memphis Grizzlies on Thursday night.\n\n\r\n              Pistons: Host the Milwaukee Bucks on Saturday and Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996472.0695171
}