{
  "game_id": "0022401090",
  "espn_id": "401705656",
  "date": "Mar 31, 2025",
  "matchup": "IND vs. SAC",
  "headline": "Pacers come from 16 points down in the second half to beat the Kings 111-109",
  "body": "INDIANAPOLIS -- — Aaron Nesmith scored 17 of his 24 points in the second half, Obi Toppin added 19 and the Indiana Pacers rallied from a 16-point deficit in the second half to beat the Sacramento Kings 111-109 on Monday night.\n\n\r\n              Tyrese Haliburton had 18 points and 11 assists against his former team for the Pacers. Jarace Walker scored 15 points. \n\n\r\n              DeMar DeRozan led the Kings with 31 points and eight assists. Former Pacers center Domantas Sabonis had 25 points and 16 rebounds.\n\n\r\n              Zach LaVine finished with 20 points for Sacramento, which led 76-60 midway through the third quarter. \n\n\r\n              Takeaways\r\n              Kings\n\n\r\n              Sacramento will remain in 10th place in the Western Conference, the final spot in the play-in tournament, but was in good shape for a victory that would have helped in the quest to move up to No. 9, which would mean a home game. \n\n\r\n              Pacers\n\n\r\n              Indiana bounced back from a loss at Oklahoma City to win for the seventh time in nine games and now gets a little break in the schedule, with home games against lottery teams against Charlotte and Utah up next.\n\n\r\n              Key moment\r\n              Haliburton made the go-ahead 3-pointer for a 100-98 lead with 1:17 to play, then Pascal Siakam hit one to make it a five-point advantage with 36 seconds remaining.\n\n\r\n              Key stat\r\n              Haliburton was 4 for 5 in the final period for 11 points.\n\n\r\n              Up next\r\n              The Pacers host Charlotte on Wednesday. Sacramento is at Washington on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997480.973042
}