{
  "game_id": "0021601137",
  "espn_id": "400899368",
  "date": "Apr 01, 2017",
  "matchup": "LAL @ LAC",
  "headline": "Clippers beat Lakers 115-104 for Doc Rivers' 800th victory",
  "body": "LOS ANGELES --  Comfortable leads have been shrinking lately for the Los Angeles Clippers.\n\nIt happened again Saturday against the lowly Lakers.\n\nOnly after the Clippers inserted all of their starters in the fourth quarter did they finish off a 115-104 victory, the 800th of Doc Rivers' coaching career.\n\nRivers sees the problem, yet professes no concern with the playoffs looming.\n\n\"I like this team and I'm going to keep saying that,\" he said. \"I think we have proven, especially in the big games, when we're healthy, we play very well.\"\n\nBlake Griffin scored 36 points, Chris Paul added 29 and J.J. Redick had 19 for the Clippers, who moved within a game of the idle Jazz for the No. 4 playoff seed in the West. The Clippers have won three in a row and seven of nine.\n\n\"Our key is going to be in the last six minutes of the game,\" Rivers said. \"We're going to have to execute offensively. We're going to have to be a team that when we need a stop, we can get a stop. There's times that we can do that and then there's times I'm not sure we can.\"\n\nThe Clippers have had little trouble stopping the Lakers, taking three of four in the season series. They've won 18 of 20 from their Staples Center co-tenant since the start of the 2012-13 season.\n\n\"The last few years have been the worst in the Lakers' history and that's not OK,\" rookie coach Luke Walton said before the game.\n\nRookie David Nwaba scored 19 points and Brandon Ingram had 10 of his 18 points in the fourth quarter for the Lakers. They have lost 18 of 20 since the All-Star break. D'Angelo Russell, the team's leading scorer at 15.7 points, had two points on 1-of-9 shooting while missing six 3-point attempts.\n\n\"They definitely came out with energy. They were hot and our defense wasn't clicking,\" Russell said. \"I tried to stay effective despite my shots not falling.\"\n\nThe Clippers' bench allowed the Lakers to hang around in the fourth when they trailed by 21 at the start. Tarik Black's dunk cut the Lakers' deficit to eight with 2:52 to play.\n\nBut Griffin and Paul combined to score the Clippers' final seven points. The duo notched its third straight game with at least 26 points apiece.\n\n\"It's not about the second unit, it is about us as a team figuring it out,\" Paul said. \"We still have time, not much time, but we have time to figure it out and we have to do it.\"\n\nThe Clippers dominated the third, turning a five-point lead into a 21-point advantage. They opened on a 24-9 run, including 10 by Paul that extended their lead to 79-59. Griffin and Redick added back-to-back 3-pointers and Paul scored four in a row to send the Clippers into the fourth leading 93-72.\n\nPaul had 12 assists and made all 10 of his free throws, and DeAndre Jordan grabbed 12 rebounds. Griffin made a career-high four 3-pointers.\n\nThe Clippers opened the game by scoring 17 straight points, making 7 of 9 field goals. The Lakers missed their first nine shots before going on an 18-2 run to close within one.\n\nTIP-INS\n\nLakers: They have used 23 different starting lineups this season with no player starting every game. ... G Jordan Clarkson is the only player to appear in every game. ... Ingram returned after missing three games with right patellar tendinitis. \"I thought I was going to feel it after the game, but it still felt good,\" he said. ... C Ivica Zubac is out for the rest of the season with a high right ankle sprain.\n\nClippers: Backup G Austin Rivers is likely out for the rest of the regular season with a strained left hamstring.\n\nGRIFFIN'S 10K\n\nGriffin scored the game's first basket on a jumper, giving him 10,000 points in his career. He is the second player in franchise history to reach that mark. Randy Smith scored 10,467 of his club-record 12,735 points when the team was known as the Buffalo Braves.\n\nDOC'S MILESTONE\n\nRivers became the 15th coach in NBA history with 800 victories. Only Gregg Popovich of San Antonio (1,146) has more among active coaches.\n\n\"What I've learned most as a coach is persistence and patience,\" Rivers said before the game. \"Patience with the players and myself. As a young coach you have a tendency to overreact to everything and change everything. I've learned not to sweat everything.\"\n\nUP NEXT\n\nLakers: Host Memphis on Sunday in their next-to-last back-to-back of the season. The Lakers play four of their final six at home.\n\nClippers: Host Dallas on Wednesday after a three-day break.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764995356.382432
}