{
  "game_id": "0021801078",
  "espn_id": "401071751",
  "date": "Mar 21, 2019",
  "matchup": "SAC vs. DAL",
  "headline": "Kings bounce back after tough loss to beat Mavs 116-100",
  "body": "SACRAMENTO, Calif. --  Marvin Bagley III didn't think it was a big deal when he missed Sacramento's first game against Dallas and Luka Doncic three months ago because of a sore left knee.\n\nBagley had the same feeling after the two rookie stars finally crossed paths on an NBA court, too.\n\nBagley III had 22 points and 12 rebounds while outplaying Doncic, and the Kings beat the Mavericks 116-100 on Thursday night.\n\n\"It was fun,\" Bagley said. \"Everybody knows what he can do. He's a great player. He's been doing a lot of good things for his team but tonight we just had to lock in together and come out and play hard.\"\n\nBagley was taken by Sacramento with the second overall pick in this season's draft. Doncic, who many Kings fans had openly lobbied for, went to Dallas with the third selection.\n\nClearly each team is happy with what the player it has.\n\nDoncic is the front-runner for Rookie of the Year while Bagley has steadily improved while coming off the bench most of the season. The double-double was Bagley's 14th this season.\n\n\"I watch Marvin a lot,\" Doncic said. \"He's a special talent. He has a lot of potential. He's going to make it and go far.\"\n\nBuddy Hield scored 11 of his 29 points in the fourth quarter, and De'Aaron Fox added 15 points and nine assists for Sacramento. Willie Cauley-Stein had 10 points and a career-high 18 rebounds.\n\nFormer Kings forward Justin Jackson scored 19 points in his first start with Dallas. Dwight Powell added 14 points.\n\nTwo nights after blowing a 28-point, second-half lead in a 123-121 loss to Brooklyn, Sacramento built another big advantage against Dallas and held on in the fourth behind Bagley.\n\nThe Kings rookie made a three-point play on a spinning layup to open the final period. Bagley later dunked off a short miss by Yogi Ferrell then made a pair of 3-pointers to stretch Sacramento's led to 116-97.\n\n\"Marvin did a nice job in the post,\" Kings coach Dave Joerger said. \"Our bigs in general, especially in the second half, really did a good job in the pick-and-roll.\"\n\nDoncic had an uneven game with 13 points on 4-of-19 shooting. He added 10 rebounds.\n\nDallas has lost 15 of 17.\n\n\"Everyone is loading up on (Doncic) and this is nothing new,\" Mavericks coach Rick Carlisle said. \"There will be some nights where his jumper is just a little short. It just comes with the territory.\"\n\nBoth teams were sluggish for most of the first half until Barnes dunked to cap a fast break for Sacramento after Fox made a tremendous play to save the ball from going out of bounds. Fox then stole the ball near the Mavs' 3-point line and drove in for another dunk.\n\nThe Kings led by 15 midway through the third but the Mavericks ended the period with three consecutive 3-pointers and pulled within 84-76.\n\nTIP-INS\n\nMavericks: Dirk Nowitzki received a standing ovation from the Golden1 Center crowd when he checked in to the game in the first quarter. Nowitzki scored three points in 12 minutes.\n\nKings: Harry Giles bruised his left thigh in the first half and did not return. Giles was scoreless in eight minutes. The injury doesn't appear to be serious. ... Cauley-Stein picked up a technical foul for hanging on the rim after dunking following a 360-degree spin move in the lane.\n\nSLY FOX\n\nFox matched his career high of four blocks and was one assist shy of a double-double. \"I thought De'Aaron set the tone offensively in pushing the basketball,\" Joerger said. \"He was decisive of when he wanted to go and when he wanted to set somebody else up.\"\n\nCLOSING IN ON A RECORD\n\nHield made seven 3-pointers and needs three more to break the franchise record of 240 set by Peja Stojakovic in 2003-04. Stojakovic is currently the Kings assistant general manager.\n\n\"He's always on me how to get better, how to get my shot off quicker, how to use my pump-fake,\" Hield said. \"A lot of my success comes from him, talking to him and trying to test him and pick his brain.\"\n\nUP NEXT\n\nMavericks: Play at Golden State on Saturday.\n\nKings: Host Phoenix on Saturday.\n\n--\n\nMore AP NBA:https://apnews.com/tag/NBAandhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994167.569561
}