{
  "game_id": "0022000975",
  "espn_id": "401307778",
  "date": "May 03, 2021",
  "matchup": "ORL @ DET",
  "headline": "Magic top Pistons 119-112 behind Bamba's big night",
  "body": "DETROIT -- — Mo Bamba had 22 points and 15 rebounds — both career highs — and the Orlando Magic beat the Detroit Pistons 119-112 on Monday night.\n\n\r\n                    Saddiq Bey led Detroit with 26 points in a game that had little at stake — with the possible exception of lottery positioning. The Pistons (19-46) have the second-worst record in the NBA. Orlando (21-44) is now even with Oklahoma City for the fourth-worst mark. Idle Minnesota (20-45) is in between.\n\n\r\n                    The list of injuries and absences was lengthy on this night. Detroit was without Wayne Ellington (calf), Jerami Grant (right knee), Cory Joseph (left ankle), Rodney McGruder (right elbow), Jahlil Okafor, Mason Plumlee (rest) and Dennis Smith Jr. (left knee Soreness). The Magic were missing Devin Cannady (right ankle), Michael Carter-Williams (left ankle), James Ennis III (right calf), Markelle Fultz (left knee), Jonathan Isaac (left knee), Chuma Okeke (left ankle), Otto Porter Jr. (left foot) and Terrence Ross (back).\n\n\r\n                    “We want to win,” Bamba said. “We don’t necessarily want to take any excuses that we’re down a man or anything. At the end of the day, we’re a young, hungry team that wants to win.”\n\n\r\n                    The Magic were also without coach Steve Clifford, who missed a sixth straight game. The team did announce before the game that Clifford has cleared the league's health and safety protocols for COVID-19 and will return to the bench Wednesday night against Boston.\n\n\r\n                    Clifford tested positive for the virus last month while in between two vaccination shots.\n\n\r\n                    “The players have responded and continued to do the things that we’ve talked about all year,” said Ty Corbin, who has filled in as acting coach. \"I’ve had nothing but great support.”\n\n\r\n                    The Magic led 51-48 at halftime and then shot 13 of 18 from the field in the third. Orlando led 88-78 heading into the fourth.\n\n\r\n                    “I guess young guys think that you don’t have to come out and compete every night,” Pistons coach Dwane Casey said. \"We’re not talented enough across the board to not come out and play hard.”\n\n\r\n                    Detroit was within three late, but Iggy Brazdeikis made a 3-pointer from the right corner to make it 112-106.\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Chasson Randle scored 18 points, R.J. Hampton added 16 and Brazdeikis contributed 14.\n\n\r\n                    Pistons: Frank Jackson scored 19 points and Hamidou Diallo had 16. Tyler Cook scored 13 on 6-of-6 shooting.\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Host Boston on Wednesday night. Orlando is 0-2 against the Celtics this season.\n\n\r\n                    Pistons: Host Charlotte on Tuesday night. Detroit is 0-2 against the Hornets this season.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997569.867785
}