{
  "game_id": "0021300267",
  "espn_id": "400489140",
  "date": "Dec 03, 2013",
  "matchup": "OKC @ SAC",
  "headline": "Kevin Durant, OKC hold off late challenge from Kings, Isaiah Thomas",
  "body": "SACRAMENTO, Calif. -- The Oklahoma City Thunder took the fourth quarter off and almost paid for it against the Sacramento Kings.\nKevin Durant had 27 points and 11 rebounds, and the Thunder withstood a furious fourth-quarter rally to earn their eighth straight win, a 97-95 victory over slumping Sacramento on Tuesday night.\nThe Thunder were outscored 30-19 in the fourth quarter but hung on to improve to 4-3 on the road this season.\n\"We can't ever take a win for granted,\" said Durant, who missed three of four shots and scored three points in the fourth quarter. \"It's hard to win in this league. We won the game; that's all that matters.\"\nAlthough the Thunder played inspired defense in limiting the Kings to a combined 34 points in the middle two quarters, they had no answer for Kings reserve guard Isaiah Thomas in the fourth period.\nThe Thunder built a 17-point lead early in the fourth but had to hold off the Kings and Thomas, who scored 21 of his 24 points in the final period and missed a jumper with 1 second left that would have sent the game to overtime.\n\"I felt like I was passive in the first half and I wasn't really doing anything on offense,\" said Thomas, who made 8 of 14 shots in the fourth, including a pair of 3s. \"When I got in at the end of the third and fourth, I wanted to try to make a difference. I was in attack mode, and my teammates kept feeding me.\"\nThomas made a 20-foot jumper with 37 seconds left, getting the Kings within 97-95. After Durant misfired on a 3, the Kings got the rebound and set up the final shot for Thomas, but it hit the front rim and Durant secured the rebound.\n\"There are no nights off in the West,\" Thunder coach Scott Brooks said. \"The West is so good, and there are so many good teams and tough places to play.\"\nOne of those teams and places is Portland, where the Thunder play Wednesday night.\n\"We have to play better tomorrow night,\" Brooks said. \"We're playing one of the hottest teams in the game right now. They have a great home crowd and have a great atmosphere. But our team has always been up for challenges, and definitely tomorrow night will be a tough challenge for us.\"\nThe Kings played without starting center DeMarcus Cousins in dropping their fifth straight. He sprained his right ankle against Golden State on Sunday and watched Tuesday's game in street clothes.\nCousins, the Kings' leading scorer (21.7 points per game) and rebounder (10.1 per game), is day to day. The Kings next play Friday at home against the Lakers.\nRussell Westbrook had 15 points, eight rebounds and seven assists, but also committed seven turnovers for the Thunder, who have defeated the Kings in seven straight and 13 of 14. Jeremy Lamb scored 14 points, Reggie Jackson had 13, and Serge Ibaka had 13 points and nine rebounds for Oklahoma City.\nRookie Ben McLemore scored 14 points for Sacramento, Derrick Williams added 13, Greivis Vasquez had 12, and Jason Thompson had 10 points and 10 rebounds.\nThe Kings have made a habit of getting behind by double digits and making impressive fourth-quarter rallies.\n\"DeMarcus doesn't play tonight, (we're) playing against a team that's 12-3 and odds have them one of the favorites to get to the Finals out of the West,\" Kings coach Michael Malone said. \"And we play them tooth and nail, giving ourselves a chance to win. At some point we're going to pull these games out.\"\nThe game was the start of a difficult stretch of road games for Oklahoma City. The Thunder play three games in four nights, then go home to face Indiana on Sunday. That's followed by two more road games next week at Atlanta and Memphis.\nThe Thunder have been flawless this season at home, winning all nine games and tying Indiana for the best home record. Oklahoma City just concluded a six-game homestand with a convincing victory Sunday against Minnesota.\nGame notes\nThe Thunder assigned rookie guard/forward Andre Roberson to the Tulsa 66ers of the NBA D-League on Tuesday. He appeared in six games (one start) this season, averaging 1.7 rebounds in 6.5 minutes per game. ... The Kings shot 58 percent in the first quarter, 33 percent in the second and 26 percent in the third. ... The Kings had eight turnovers after committing a season-high 24 on Sunday against Golden State.",
  "source": "espn_api",
  "crawled_at": 1764992906.1683998
}