{
  "game_id": "0021900608",
  "espn_id": "401161250",
  "date": "Jan 15, 2020",
  "matchup": "IND @ MIN",
  "headline": "Sabonis scores 29 as Pacers top Timberwolves 104-99",
  "body": "MINNEAPOLIS --  The bags of ice on his legs after the game were a reminder that Pacers big man Domantas Sabonis has been playing through left knee soreness as the season nears the midway point.\n\nWatching his performance Wednesday night against Minnesota, it might have been easy to forget that Sabonis is ailing at all.\n\nSabonis matched a season high with 29 points and added 13 rebounds and six assists to lead Indiana over the Timberwolves 104-99 on Wednesday night.\n\n\"He did a good job of attacking, and we did a good job of getting him the ball,\" Pacers coach Nate McMillan said.\n\nMalcolm Brogdon added 21 points in his second game back from injury and Doug McDermott scored 14 off the bench for the Pacers, who have won three straight games.\n\nJarrett Culver led Minnesota with 17 points and Gorgui Dieng had 15 points and 11 boards. The Timberwolves have lost three in a row.\n\nSabonis looked poised for a big night offensively after scoring 25 points in the first half. Minnesota let Sabonis get open down low too often, a big reason for Indiana's 30 points in the paint before halftime.\n\n\"I was just trying to be aggressive,\" Sabonis said. \"T.J. (McConnell), Malcolm, everybody was doing a great job of finding me. I got some easy offensive rebounds.\"\n\nSabonis was quiet in the second half, though, making just one basket in each of the final two quarters. The fourth-year big man didn't score in the second half until less than a minute remained in the third.\n\nBrogdon picked up the scoring burden for much of the half. He had 16 of his 21 points after halftime, including 10 in the fourth quarter.\n\n\"We didn't have the same intensity as we did in the first half,\" said Timberwolves forward Robert Covington. \"They kind of switched roles a little bit. They came out with the energy we were supposed to come out with.\"\n\nMinnesota big man Karl-Anthony Towns missed his 15th straight game with a left knee sprain. A combination of several players matched up on Sabonis struggled early to keep him in check in Towns' absence.\n\n\"Everybody's got strengths and weaknesses,\" Dieng said. \"Nights like that, you've got to put your best defender on him.\"\n\nMinnesota led by nine in the first half after a basket by Andrew Wiggins. The Timberwolves took a 59-54 lead into halftime but saw that lead momentarily disappear in the third before holding a one-point lead after three.\n\nCulver trimmed Indiana's lead on consecutive possessions late in the fourth, but the Pacers had an answer each time. After a basket by Culver made it a three-point game, Brogdon hit his first 3-pointer of the game to push the lead to six.\n\nWiggins was held scoreless in the second half on 0-of-5 shooting for Minnesota after 10 first-half points.\n\nThe teams play each other again in two days. Both coaches likened the situation to preparing for a playoff series.\n\nIt's the second time this season the Timberwolves have faced the same team in consecutive games. They also did so in November when they played at Utah before hosting the Jazz two days later.\n\nTIP-INS\n\nPacers: It was the fifth time in his career Sabonis had 25 or more points and 10 or more rebounds in a game. . McDermott scored 10 of his 14 points in the final quarter.\n\nTimberwolves: Minnesota's bench outscored Indiana's reserves 39-26, led by 15 points from Keita Bates-Diop. . Covington led Minnesota with 11 first-half points but didn't make a basket in the second half until a 3-pointer with 2:24 remaining in the fourth quarter. . Dieng's double-double was his sixth of the season.\n\nSUCCESSFUL CHALLENGE\n\nMcMillan successfully challenged an offensive foul called against Sabonis with 7:51 to play in the second quarter. After a replay review, the foul on Sabonis was overturned.\n\nIt would have been Sabonis' third of the game. Instead, he finished the half with just two fouls and scored four more points in the quarter after the call was overturned.\n\n\"I thought that was big. I'm glad we won that,\" McMillan said. \"He was playing so well. We needed to try to keep him out on the floor.\"\n\nUP NEXT\n\nPacers: Host Minnesota on Friday night.\n\nTimberwolves: Visit Indiana on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995849.802221
}