{
  "game_id": "0021900673",
  "espn_id": "401161315",
  "date": "Jan 24, 2020",
  "matchup": "MIA vs. LAC",
  "headline": "Leonard's 1st triple-double lifts Clippers over Heat 122-117",
  "body": "MIAMI --  Kawhi Leonard has two NBA championships, two NBA Finals MVP awards, four All-Star selections and a string of other accolades.\n\nAnd now, one triple-double.\n\nUnbelievable as it sounds -- and really, the Miami Heat could not believe it -- Leonard got a triple-double for the first time Friday night. He scored 26 of his 33 points after halftime, finished with 10 rebounds and 10 assists, and carried the Los Angeles Clippers past the Heat 122-117.\n\n\"What do you mean, first triple-double? Of his career? Wow,\" Heat coach Erik Spoelstra said. \"That is a surprise. He's as complete a player (as there is) in this league.\"\n\nLeonard actually got the triple-double twice. He had it in the third quarter, briefly: What was originally his 10th rebound was taken away after the stat crew gave one play a closer review. He then got it for real on a rebound with 3:55 remaining.\n\nClippers coach Doc Rivers was given the game ball in the locker room afterward, then dribbled it once before flipping it to Leonard as a keepsake. Leonard raised it over his head, then smiled as teammates applauded.\n\n\"It's because of y'all,\" Leonard told teammates. \"Y'all made shots. So that's all a triple-double is.\"\n\nAnd even with his big night, the Clippers -- who dug their way out of a 15-point early hole and finished the third quarter on a 15-0 run to take control -- had to hang on in the final moments.\n\nMiami was down by 18 with 8:34 left, then went on a 24-9 run and got within three on a 3-pointer by Dion Waiters with 34 seconds remaining. But they got no closer, and Leonard sealed it by going 4 for 4 from the foul line in the final moments.\n\nRivers lauded Leonard for patiently waiting out Miami's trapping schemes.\n\n\"It's like he was a boxer,\" Rivers said. \"He just kind of took his time until he could throw punches.\"\n\nLandry Shamet scored 22 points for the Clippers. Lou Williams had 16 points, Montrezl Harrell added 15 and JaMychal Green 14.\n\nJimmy Butler led Miami with 20 points. Butler left midway through the fourth after appearing to turn his right ankle for the second time in the game, capping a night when he also got inadvertently popped in the eye during the first half.\n\nKelly Olynyk and Tyler Herro scored 19 points each, Bam Adebayo had 18 and Duncan Robinson added 16 for Miami. The Heat fell to 20-2 at home -- 0-2 against teams from Los Angeles. Their only other home loss was to the Lakers.\n\n\"We've built a place where it's hard to win here and if you're going to win here you've got to do some extravagant things,\" Adebayo said. \"And they've got a player over there that actually did that tonight.\"\n\nLeonard flirted with a triple-double on two other occasions this season, missing it by two rebounds on Oct. 26 at Phoenix and by one assist on Nov. 11 against Toronto.\n\n\"I thought he already had one,\" Rivers said.\n\nThe Clippers were without Paul George (left hamstring) for the eighth consecutive game and Patrick Beverley (right groin) for the second straight game, though Beverley tried lobbying his way into the lineup.\n\nMiami was without two point guards -- Kendrick Nunn missed the game with left Achilles soreness and Goran Dragic was out with a sore left calf, something that flared up after he got kicked in Wednesday night's overtime win against Washington.\n\nSo, down to 10 available players, Miami had no choice: Waiters played for the first time this season.\n\nWaiters, who had been suspended three times for various issues since October and embarrassed himself and the organization when he ingested at least one cannabis-infused edible and needed medical attention when the team charter plane wrapped up a Phoenix-to-Los Angeles flight in November, played 18 minutes and scored 14 points.\n\n\"We need everybody and inevitably during a long NBA season you need everybody to contribute,\" Spoelstra said. \"It's not always necessarily going to be on your terms.\"\n\nTIP-INS\n\nClippers: Leonard now has a career-best streak of seven 30-point games. World B. Free and Bob McAdoo have the Clippers' record with 11 such consecutive games. ... Patrick Patterson scored 12 for the Clippers.\n\nHeat: Adebayo has played in 131 consecutive games, one shy of Grant Long for the fifth-longest streak in franchise history and three away from matching Issac Austin's fourth-best such streak. ... Robinson has made multiple 3-pointers in 15 consecutive games, breaking his own team record.\n\nLINEUP ROULETTE\n\nThe Clippers used their 21st lineup of the season, seven more than they used in the entire 2018-19 regular season. Miami used its sixth different lineup, with Nunn out for the first time.\n\nMCGRUDER RETURNS\n\nIt was the first time Clippers guard Rodney McGruder played against the Heat, the team with whom he spent his first three NBA seasons. He was waived by the Heat late last season in a luxury-tax-related move, and picked up by the Clippers -- who signed him to a three-year deal this past summer. \"He'll have a lifetime recommendation from us. He earned it,\" Spoelstra said.\n\nUP NEXT\n\nClippers: Visit Orlando on Sunday.\n\nHeat: Host Orlando on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995507.6234088
}