{
  "game_id": "0021700303",
  "espn_id": "400975054",
  "date": "Nov 29, 2017",
  "matchup": "PHX @ DET",
  "headline": "Reggie Jackson scores 23 points, Pistons rout Suns 131-107",
  "body": "DETROIT --  Detroit coach Stan Van Gundy was worried that his team might suffer a letdown after going to Boston and beating the first-place Celtics.\n\nIt didn't take the Pistons long to end his worries.\n\nThe Pistons led by as many as 33 points in the first half and went on to win their third straight game, beating the Phoenix Suns 131-107.\n\nDetroit beat the Celtics 118-108 on Monday night.\n\n\"I thought it was very impressive to come out and play the way we did tonight after a huge win on Monday,\" Van Gundy said. \"We were really on it from the start defensively, and we were moving the ball and playing with energy on offense.\"\n\nTobias Harris and Avery Bradley each scored 20 points, and Andre Drummond had 13 points and matched a career best with seven assists in Detroit's highest-scoring game of the season. The Pistons improved to 14-6 overall, 8-2 at home in their first season at Little Caesars Arena, and 7-1 against the Western Conference.\n\n\"It was easy to get fired up for our last two games, but we had to find a way to bring energy to ourselves tonight,\" Jackson said. \"We locked in and stayed with the game plan and our fans were amazing. We were more mature in our approach.\"\n\nDevin Booker led the Suns with 22 points, and rookie Josh Jackson had a career-high 20.\n\n\"I definitely feel like I'm progressing,\" Josh Jackson said. \"It's a learning curve, and that takes times, but our team has nothing but time.\"\n\nPhoenix has lost four out of five and is 1-2 on a six-game trip.\n\nThe Suns were coming off a 104-99 victory in Chicago on Tuesday night, while Detroit had Tuesday off after the win in Boston.\n\n\"We weren't as sharp as we needed to be against that team,\" Phoenix coach Jay Triano said. \"They had a day to prepare and we didn't, and they went right past us and made every play they wanted to make.\"\n\nHarris scored 14 points and the Pistons had a season-best 36 points in the first quarter. Detroit shot 62.5 percent in the period to build a 17-point lead.\n\nPhoenix continued to struggle in the second, falling behind by 32 points. Detroit led 69-41 at halftime, outshooting the Suns 63 percent to 44.7 percent. Harris had 16 points in the half, and Reggie Jackson added 15.\n\n\"We have a lot of guys who are making winning plays right now,\" Pistons rookie Luke Kennard said. \"Reggie is playing great basketball, and when he does that, we can be a really good team.\"\n\nThe Pistons led by as many as 36 in the second half.\n\n\"We didn't guard anyone in the second half, which you don't like to see, but they really never cut into the lead until the last few minutes,\" Van Gundy said. \"We were still playing well offensively until the end.\"\n\nTIP INS\n\nSuns: Josh Jackson spent his first two years of high school at Consortium (now Voyageur) Prep, located four miles from Little Caesars Arena. . One night after using 7-footers Tyson Chandler and Dragan Bender as his starting center and power forward in Chicago, Suns coach Jay Triano changed things against the Pistons. Marquese Chriss and former Piston Greg Monroe started, while Chandler didn't play.\n\nPistons: Drummond hit all three free-throw attempts against Phoenix, and is shooting 63 percent from the line this season. Drummond entered the season as the worst free-throw shooter in NBA history, having made 38.1 percent of his attempts over five seasons.\n\nUP NEXT\n\nSuns: At Boston on Saturday.\n\nPistons: At Washington on Friday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993915.335925
}