{
  "game_id": "0021900922",
  "espn_id": "401161564",
  "date": "Mar 04, 2020",
  "matchup": "CHI @ MIN",
  "headline": "Beasley scores 24 as Timberwolves beat Bulls 115-108",
  "body": "MINNEAPOLIS --  Malik Beasley scored 24 points and D’Angelo Russell added 19 for the Minnesota Timberwolves in a 115-108 victory against the Chicago Bulls on Wednesday night.\n\nNaz Reid had his second straight double-double for Minnesota with 16 points and 11 rebounds, helping the Timberwolves to their second consecutive win. It's the first time they’ve won both games of a back-to-back this season, following Tuesday’s 139-134 victory in New Orleans.\n\n“It feels good,” Reid said. “We’re tired of losing. Plain and simple. We’re a team that could win. We go out there and put it all together, things like this will happen.”\n\nPlaying without leading scorer Zach LaVine, Chicago welcomed back Lauri Markkanen but couldn’t follow up Monday’s win against Dallas. Coby White led the Bulls with 26 points off the bench.\n\n“I don't care who's coming back. I don't care who's been out, who's working on a minutes restriction,” coach Jim Boylen said. “I didn't think we were tough enough tonight, and I didn't like it.\"\n\nChicago built a 13-point lead in the first half before Minnesota’s offense got on track in the second half. The Wolves hit five of their first six 3-pointers after halftime to take a 72-64 lead.\n\n“I thought we answered the call in terms of upping our energy and not having a kind of feel-out process like we had to begin the game,” Minnesota coach Ryan Saunders said. “We challenged our guys in the third quarter, and credit to them. They were aggressive. They moved the basketball. I thought we got great shots to start the half and forced them to call timeout.”\n\nThe Wolves’ season has developed into a continual experiment after the team traded for Beasley, Russell, Juancho Hernangomez and James Johnson at the deadline, and lost Karl-Anthony Towns to a left wrist injury.\n\nThe offense has been the building block, with Minnesota showing flashes.\n\nThe Wolves entered the day averaging 121.6 points per game since the trades, the third-highest total in the NBA during that span. They are 4-7 in that stretch, with wins against the Los Angeles Clippers and at Miami.\n\n“Whenever you pick up wins, you feel better about yourself,” Saunders said. “It’s validation in a lot of ways that you’re doing the right thing. We don’t want to harp on any one win, but that Miami win was big for this group.”\n\nMinnesota had lost 18 of 19 games before beating the Heat.\n\nGETTING HEALTHIER\n\nMarkkanen returned after missing 15 games with a right pelvis stress reaction. He last played Jan. 22 against Minnesota. Boylen said Markkanen would be limited to 18-20 minutes. He ended up with 13 points in 21 minutes.\n\n\"I felt pretty good,” Markkanen said. “Of course, your body's not been running out there in six weeks, it's not normal. It wasn't bad. Especially the first half, I felt really good.”\n\nWendell Carter Jr. played his third game back from injury and had six points and nine rebounds in 25 minutes. Otto Porter, who missed 51 games with a left foot fracture, played his second game back and was 1-of-8 shooting in 18 minutes. Boylen had said Carter and Porter were still on a minutes restriction as well.\n\nWHITE’S DEVELOPMENT\n\nOne positive aspect for Chicago has been the development of White, the seventh overall pick in the 2019 draft. White has scored in double figures in eight straight games and is averaging 28 points over his last six.\n\nTIP-INS\n\nBulls: LaVine missed his second straight game with a strained left quadriceps. LaVine, who leads Chicago with 25.5 points per game, had played in every game this season before the injury. … Luke Kornet missed his sixth straight game with a left foot fracture, while Chandler Hutchinson missed his seventh straight game with an AC sprain in his right shoulder. … The Bulls are one of four teams to not make a single transaction since the start of the regular season.\n\nTimberwolves: Minnesota had played eight sets of back-to-back games this season before finally winning both ends this week. … The win marked the first time since Jan. 2-5 that the Wolves won two games in a row. … Reid became the 16th Minnesota rookie to record multiple double-doubles.\n\nUP NEXT\n\nBulls: Return home against Indiana on Friday.\n\nTimberwolves: Host Orlando on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996344.556021
}