{
  "game_id": "0022200829",
  "espn_id": "401468984",
  "date": "Feb 08, 2023",
  "matchup": "LAC vs. DAL",
  "headline": "Irving scores 24 in Dallas debut, leads Mavs over Clippers",
  "body": "LOS ANGELES -- — Kyrie Irving came out charging in his Dallas debut, keying a big run to open the game and sparking his new teammates in front of a cheering Luka Doncic on the bench.\n\n\r\n              Irving scored 24 points and the Mavericks never trailed in beating the Los Angeles Clippers 110-104 on Wednesday night.\n\n\r\n              “It felt good to get this debut out of the way,” Irving said. “It's just been a long 96 hours, barely any sleep sometimes. It's the first time I ever got traded in the middle of the season, so it was new for me, but I'm excited that I'm here.”\n\n\r\n              With Doncic still sidelined by injury, Irving meshed well with his young teammates just three days after the eight-time All-Star was traded from the Brooklyn Nets. He was part of a 13-0 spurt early in the game, scoring eight points on a jumper and back-to-back 3-pointers.\n\n\r\n              “The most important thing that we stressed as a team was just don't force the ball to me. We just want to play natural basketball,” Irving said. “You don't always have to come to me. You can play off me, I can play off the ball, I can cut.”\n\n\r\n              Irving had four rebounds and five assists in 37 minutes of what amounted to a dress rehearsal before Doncic returns to give the Mavs a powerhouse backcourt. Irving was greeted with cheers and a boy holding a sign welcoming him to the team when he was introduced as part of the starting lineup.\n\n\r\n              “I'm sure when number 77 gets back it'll be even more enjoyable to see and play out there,” Irving said.\n\n\r\n              Early in the fourth, Irving fouled Paul George. A Clippers fan yelled to him, “I love you, but that was a flagrant.” Irving laughed and shook his head no.\n\n\r\n              Former Clipper Reggie Bullock scored 15 of his 18 points in the first quarter against his old team. All five Dallas starters reached double figures.\n\n\r\n              Norman Powell scored 24 points and Terance Mann added 21 for the Clippers, whose two-game winning streak ended. George added 20 points. Kawhi Leonard, who had two points in the first half, finished with 18.\n\n\r\n              Coming off a 4-2 road trip, the Clippers trailed by 19 in the first quarter.\n\n\r\n              “Ky just had that bounce and that mentality that I’m going to show what I can do and make my presence felt right away,” George said. “You felt it the second they got into their first possession, just his motor.”\n\n\r\n              The Mavs scored 41 points in the opening quarter while shooting 60% from the floor. They outscored the Clippers 21-9 to start the game, propelled by Irving's offense.\n\n\r\n              “He makes things look easy,” Mavs coach Jason Kidd said. “The comfort level he feels with us, you could see it in the game. He is at peace with his basketball game.”\n\n\r\n              The Clippers made a run at the lead in the third. Leonard ignited a 20-10 spurt by scoring 11 in a row to pull them to 79-78. Josh Green's basket kept the Mavs ahead 81-78 going into the fourth.\n\n\r\n              The Mavs quickly stretched their lead to 10 points in the fourth. The Clippers got within five four times but the Mavs held them off.\n\n\r\n              The Clippers cut their deficit to 60-52 at halftime after outscoring Dallas 27-19 in the second period.\n\n\r\n              Leonard had two points and George had 10 in the first half when they combined to shoot 5 of 14.\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Doncic missed his third straight game because of a right heel contusion. He joined the team in Los Angeles and it’s under discussion whether he will play Friday or Saturday when the Mavs are at Sacramento for a back-to-back. ... They made 17 3-pointers, including six by Bullock.\n\n\r\n              Clippers: John Wall (abdominal soreness) remains out. ... Former team co-owner Shelly Sterling, who sold the franchise to Steve Ballmer after her then-husband Donald Sterling was banned by the NBA, sat courtside next to Jalen Rose. \n\n\r\n              KEEPING MINUTES DOWN\n\n\r\n              Leonard and George played fewer minutes by design and coach Tyronn Lue plans to keep it that way until after the All-Star break.\n\n\r\n              “Making sure they feel good, making sure they are healthy,” Lue said. “That's kind of what went into the decision.”\n\n\r\n              UP NEXT \n\n\r\n              Mavericks: Visit the Sacramento Kings on Friday in the fourth of five road games.\n\n\r\n              Clippers: Host the Milwaukee Bucks on Friday.\n\n\r\n               ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994964.986938
}