{
  "game_id": "0021700760",
  "espn_id": "400975506",
  "date": "Jan 31, 2018",
  "matchup": "PHX vs. DAL",
  "headline": "Canaan hurt but Suns stop skid with 102-88 win over Mavs",
  "body": "PHOENIX --  The end of the Phoenix Suns' five-game losing streak came with a sobering sidebar, a gruesome injury to backup point guard Isaiah Canaan.\n\nRookie forward Josh Jackson matched his career best with 21 points and T.J. Warren added 20 as the Suns handed the Dallas Mavericks their fifth loss in a row, 102-88 on Wednesday night.\n\nBut anyone who saw Canaan break his left ankle probably wished they hadn't.\n\nDriving to the basket in the final seconds of the first quarter, Canaan was fouled by Wesley Matthews and landed awkwardly. His left foot twisted almost 180 degrees in the wrong direction.\n\nAs trainers rushed to Canaan, the crowd groaned and some of his shocked teammates covered their eyes or looked away. Phoenix guard Devin Booker pulled his jersey over his face.\n\nTeam doctor Tom Carter rotated the foot and ankle back into their proper positions and said afterward that Canaan never uttered a word of pain. He was loaded onto a stretcher and wheeled off the court.\n\n\"It's hard for fans and everyone sitting right there, and teammates especially, a guy they battle with every day. It's their friend on and off the court,\" Suns interim coach Jay Triano said. \"I used the timeout to let us say a quick prayer and get us refocused again to keep playing.\"\n\nMarquese Chriss had 15 points and 12 rebounds for the Suns, who beat Dallas for the fourth time in a row dating to last season.\n\nAfter missing Monday night's game in Memphis with bruised ribs, Booker was back at point guard for Phoenix. He played 32 minutes and scored 15 points.\n\n\"I think we were just playing with high energy,\" Booker said. \"A lot of our points were in transition. Josh and T.J. ran the lanes and it started at the defensive end.\"\n\nDennis Smith Jr. scored 17, Harrison Barnes 15 and Dirk Nowitzki 14 for the Mavericks, who shot just 36 percent.\n\nBooker opened the game with a 3-pointer and Phoenix never relinquished the lead.\n\nDanuel House made two 3s and Canaan and Jared Dudley one apiece in a 12-2 run that put the Suns up 35-14 with 23 seconds left in the first quarter. Phoenix led 36-17 after one.\n\n\"Bad first quarter put us in a huge hole,\" Dallas coach Rick Carlisle said. \"The rest of the game was somewhat manageable but the first quarter, down by 19 points, is just too big a hole on the road.\"\n\nThe Mavericks cut it to single digits twice in the second quarter and were down 57-46 at halftime. Phoenix dominated the third period, leading 81-58 after a 3 by Troy Daniels with 2:20 left.\n\nThe Mavericks cut it to 91-84 on Smith's 3-pointer with 3:17 to go, but Booker responded with a three-point play to put Phoenix up 94-84. Dallas never got it to single digits again.\n\nTHINKING OF ISAIAH\n\nCanaan, in his fifth NBA season, was signed Dec. 13 after being waived by Houston in October. He was scheduled to have surgery on Thursday, Triano said.\n\n\"A guy who comes in here and battles every day,\" Booker said, \"earned a spot on an NBA team after being in and out of the league. Tough break for him. Prayer out to him and his family.\"\n\nTIP-INS\n\nMavericks: Matthews shot 2 of 17. ... Nowitzki played 27 minutes and is 32 shy of becoming the sixth player in NBA history to play 50,000 minutes in the regular season. ... Nowitzki's 1,462 career points in 70 regular-season games against Phoenix are fifth-most by any player against the Suns in their history.\n\nSuns: The 88 points scored by Dallas matched a season low for a Phoenix opponent. ... The four-game winning streak over Dallas is the Suns' longest against the Mavs since winning nine in a row from 1997-99. ... Chriss missed the previous game with a sprained ankle. ... The Suns set the NBA record on Monday in Memphis with a 3-pointer in their 1,109th consecutive game and made it 1,110 on Wednesday. Dallas previously held the record of 1,108.\n\nUP NEXT\n\nMavericks: At the Sacramento Kings on Saturday night.\n\nSuns: Host the Utah Jazz on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993899.2700942
}