{
  "game_id": "0021701190",
  "espn_id": "400975936",
  "date": "Apr 06, 2018",
  "matchup": "MIN @ LAL",
  "headline": "Butler returns as Wolves beat Lakers 113-96",
  "body": "LOS ANGELES --  Jimmy Butler needed about two quarters to look like his old self.\n\nOnce he did, the Minnesota Timberwolves looked good again, too.\n\nButler scored 18 points in his return from right knee surgery, Jeff Teague had 25 points and eight assists, and the Timberwolves beat the Los Angeles Lakers 113-96 on Friday night.\n\n\"It feels like Jimmy's that one piece that helps everybody be where their supposed to be at,\" Wolves forward Taj Gibson said. \"I felt defensively it helps us a lot. But it's good to get back to the old ways.\"\n\nButler played 22  1/2 minutes and was 7 for 10 from the field in his first game since getting hurt against Houston on Feb. 23. He had surgery two days later for a cartilage injury and missed 17 games.\n\nHe made a difficult turnaround jumper to start the second half. He finished an acrobatic layup after receiving a lob pass from Teague. He even reached into his bag of defensive tricks with a steal that led to a breakaway dunk.\n\n\"He looked good,\" Andrew Wiggins said. \"He got to his spots, he scored when he wanted to score. He was just playing his game out there.\"\n\nMinnesota moved into sole possession of eighth place in the Western Conference.\n\nGibson also scored 18 points and grabbed 10 rebounds, while Karl-Anthony Towns had 14 points and 11 rebounds for the Timberwolves, who were on the second night of a back-to-back. They lost to the Denver Nuggets on Thursday.\n\nJulius Randle scored 20 points and added 10 rebounds for the Lakers, who have lost nine of 13. Josh Hart tallied 20 points and 11 rebounds off the bench, and Brook Lopez had 18 points and six rebounds.\n\nMinnesota started the third quarter with a 16-6 run and took a 67-64 lead on a basket Butler. Teague, Wiggins and Towns all made 3-pointers to give the Timberwolves an eight-point lead with 3:25 remaining in the period.\n\nTowns capped an 11-2 run with a put-back layup to give Minnesota a 78-68 advantage with 2:12 remaining in the third. Josh Hart made a 3-pointer at the third-quarter buzzer and the Lakers trailed 80-73.\n\nLos Angeles went on a 9-0 run after trailing 36-32 in the second quarter. An 11-0 run four minutes later gave the Lakers a 52-40 lead with 3:08 remaining in the first half.\n\nGibson's basket cut Minnesota's deficit to 56-50. The Timberwolves trailed 58-51 at halftime. Despite shooting only 29 percent from the field, the Lakers outscored the Timberwolves 32-21 in the second quarter.\n\nLopez scored the first 15 points for the Lakers, outscoring Minnesota by himself over the first six minutes of the game. The rest of the team, however, scored only 11 points the rest of the quarter.\n\nTIP-INS\n\nTimberwolves: Outscored the Lakers 62-44 in the paint. . All five starters scored in double figures.\n\nLakers: Channing Frye was assessed a flagrant 1 foul in the opening minutes of the second quarter. . Kuzma left the game in the third quarter with a mild left ankle sprain and did not return. . Luke Walton was assessed a technical foul in the fourth quarter.\n\nTURNOVER TROUBLE\n\nThe Lakers committed 21 turnovers, which the Timberwolves turned into 30 points. Minnesota, on the other hand, had only five turnovers.\n\n\"They got 100 shots up tonight, we got 79 because of turnovers and offensive rebounds,\" Lakers coach Luke Walton said. \"We talked about it after the game. It's something that we're going to have to continue to work on. We want to consistently be a good team. We have to get our turnover numbers down.\"\n\nHart said Los Angeles and some lackadaisical passes, which contributed to the high turnover numbers.\n\n\"We're young, but we've got to realize that each and every possession matters,\" Hart said.\n\nTALE OF TWO HALVES\n\nThe Timberwolves broke the game open to start the second half and never looked back. They outscored the Lakers 62-38 and built a 21-point lead.\n\n\"First half, we just let them run free,\" Wiggins said. \"Second half, I feel like we got into them more, we were the aggressor and we got out there on the boards also.\"\n\nA LOTTA LOPEZ\n\nLopez scored the first 15 points for the Lakers. He outscored the Timberwolves by himself, 15-14, through the first six minutes of the game.\n\n\"That's how I need to be most nights,\" Lopez said. \"I just need to be better for more games.\"\n\nWalton said he liked the way Lopez started the game.\n\n\"I knew that they would come out and try to knock us out, coming off that loss they had last night,\" Walton said. \"I thought Brook did a really nice job kind of going blow-by-blow with them on the offensive side.\"\n\nUP NEXT\n\nTimberwolves: Host the Memphis Grizzlies on Monday.\n\nLakers: Host the Utah Jazz on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764992614.316462
}