{
  "game_id": "0021900645",
  "espn_id": "401161287",
  "date": "Jan 20, 2020",
  "matchup": "OKC @ HOU",
  "headline": "Paul, Thunder rally for 112-107 win over struggling Rockets",
  "body": "HOUSTON --  After scoring 27 points in the first half against his former team, Chris Paul was on the bench during a big Oklahoma City run in the fourth quarter when a Thunder fan began yelling at coach Billy Donovan to put the veteran guard back in the game.\n\nPaul turned to the man and gave him a look that indicated the group on the floor was doing just fine before asking him: \"Do you not see the score?\"\n\nPaul scored 28 points and Danilo Gallinari added 25 as the Thunder rallied from a 15-point fourth-quarter deficit to beat cold-shooting James Harden and the Houston Rockets 112-107 on Monday.\n\nWhile Paul exulted in what he said might be his team's best win of the season, Harden delayed his postgame shower for some extra work on his shooting after the Rockets lost their season-worst fourth straight.\n\nHarden spent about 25 minutes on the court before returning to the locker room, and it was hard to argue he didn't need the practice. The former MVP scored 29 points but went 1 of 17 from 3-point range in an astonishingly inefficient performance.\n\n\"Just trying to get back to the basics,\" he said. \"I think when you're struggling you just try to get back to the fundamentals and the basics of your shot and form, form shooting and things like that. Staying with your shot. And just all repetition.\"\n\nFormer Thunder player Russell Westbrook had 32 points, 12 assists and 11 rebounds for Houston.\n\nGallinari and Dennis Schroder, who scored 17 of his 23 points after halftime, carried the Thunder after the break.\n\n\"It was fun to see how guys stayed together, stayed the course and fought back,\" Paul said.\n\nHouston coach Mike D'Antoni was asked what went wrong.\n\n\"Couldn't make a shot, didn't make foul shots,\" he said. \"Right now we're at a period where if something is going to go bad, it's bad and when it rains, it pours. And it's pouring.\"\n\nOklahoma City used a 6-0 run, highlighted by a dunk from Shai Gilgeous-Alexander after he stole the ball from Harden, to put the Thunder up 108-105 with about a minute left.\n\nHarden made a layup for Houston to cut the lead to one, but Schroder made a jump shot with 28 seconds remaining to make it 110-107. Russell Westbrook missed a 3-pointer on the other end and Gilgeous-Alexander added two free throws to secure the victory.\n\n\"Dennis and Gallinari offensively, made some really really big shots to get us back in the game,\" Donovan said. \"And then we got some timely stops and some good rebounds. So it really was an amazing job by those guys.\"\n\nHouston had a 15-point lead before the Thunder scored 13 straight points to get within 100-98 with 4 1/2 minutes to go. Gallinari led the way for Oklahoma City in that stretch, making two 3-pointers and adding three free throws after being fouled on a 3-point attempt.\n\nHarden made one of two free throws after that but Gallinari struck again seconds later with another 3 that tied it at 101-all. Gilgeous-Alexander then made one of two free throws to give the Thunder their first lead since the first quarter.\n\nWestbrook made Houston's first field goal in more than four minutes with a layup with just more than three minutes left. He then added another layup after a steal seconds later to give the Rockets a 105-102 lead with about two minutes to go.\n\nThe Thunder trailed by 16 points after three quarters, but a 9-2 run, with five points from Schroder, got them within 91-82 with about 9 1/2 minutes left.\n\nHouston trailed by as many as 10 in the first half but led by seven at halftime and used a 9-3 run to open the third quarter and push it to 73-60. P.J. Tucker had a 3-pointer in that stretch and Westbrook added four points.\n\nHouston scored the last four points in a third quarter where Oklahoma City scored just 14 points to make it 87-71 entering the fourth.\n\nTIP-INS\n\nThunder: Steven Adams sprained his left ankle on a hard foul by Capela early in the first quarter. He missed both free throws after the foul and didn't play after that. Capela was given a flagrant-1. ... Paul received a technical for arguing about a foul call early in the fourth quarter.\n\nRockets: G Austin Rivers missed a second straight game with a right thumb injury. He said he is feeling better and expects to return on Wednesday. ... Westbrook has scored 30 points or more in five straight games.\n\nWESTBROOK'S TRIPLE-DOUBLES\n\nWith his performance on Monday, Westbrook joined LeBron James as the only players to have a triple-double against all 30 current NBA teams. Monday was Westbrook's eighth of the season, 146th of his career and the 42nd time he's had a triple-double in a 30-point game.\n\nUP NEXT\n\nThunder: Visit Orlando on Wednesday night.\n\nRockets: Host Denver on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996219.490401
}