{
  "game_id": "0021900768",
  "espn_id": "401161410",
  "date": "Feb 06, 2020",
  "matchup": "LAL vs. HOU",
  "headline": "Covington has clutch debut, Rockets outlast Lakers 121-111",
  "body": "LOS ANGELES --  Nobody taller than 6-foot-6 was in Houston's starting lineup, and a heavily bearded guard lost the opening tip. Nobody bigger than 6-foot-7 Robert Covington played for the Rockets in a game between division leaders at Staples Center.\n\nBecause Russell Westbrook went wild and Covington came up big late in his debut, the Rockets' first experiment in extremely small ball was a large success -- and the hulking Los Angeles Lakers came up short.\n\nWestbrook scored 41 points and Covington hit two clutch late 3-pointers while getting 14 points and eight rebounds, leading Houston to a 121-111 win over Los Angeles on Thursday night.\n\nJames Harden managed just 14 points, but Westbrook picked up the scoring slack before Covington had several big moments down the stretch. The final surge sent the Rockets to a major road win in their first attempt at playing without a center in coach Mike D'Antoni's latest brainstorm.\n\n\"Every time you try something different, these guys have got to believe in it,\" D'Antoni said. \"And this helps a lot, because if you come in here and get spanked and they're all little, it's like, `Oh, maybe we can't do this.' So they're fired up to keep trying. It's just one game, but the confidence is good.\"\n\nAnthony Davis and the Lakers capitalized inside on the Rockets' diminutive defenders, but Houston still rallied from a late four-point deficit and ended the game on a 19-5 surge highlighted by two of Covington's four 3-pointers. The veteran was acquired from Minnesota on Wednesday in a four-team trade, and he tried to adjust quickly to being the tallest player on the floor for his new squad.\n\n\"Means a lot, just being able to come in and make a major impact,\" Covington said. \"It just shows that my coaches and my teammates believe in me.\"\n\nDavis had 32 points and 13 rebounds, and LeBron James had 18 points, 15 assists and nine rebounds in a meeting of first-place teams with sharply contrasting approaches. The Lakers didn't blame the loss on the Rockets' unusual lineup, but instead on their lack of execution in several key stretches.\n\n\"You've just got to communicate,\" James said. \"James is getting a lot of eyes on him, but Russ was doing what he is definitely capable of doing. He was wonderful tonight.\"\n\nHarden took just 10 shots in his follow-up to back-to-back 40-point games, but Westbrook returned from a one-game absence with a sprained thumb and had a huge performance in the Rockets' fourth straight win.\n\nAlthough Davis, Dwight Howard and JaVale McGee had a relatively easy time getting shots down low and grabbing rebounds in traffic, the Rockets' small lineup created the offensive spacing and ball movement desired above all else by D'Antoni.\n\n\"They hit some tough shots down the stretch, and we made some costly turnovers at the end,\" Davis said.\n\nThe Lakers got plenty of simple baskets down low, but the Rockets went 15 for 29 on 3-pointers in the first three quarters to keep it close.\n\nCovington came up with a key block of Davis' shot with about 3:30 to play after Houston reclaimed the lead, and he hit a clutch 3-pointer from the corner with 2:42 to play.\n\nTIP-INS\n\nRockets: They avenged a 124-115 loss to the Lakers in Houston last month. Davis sat out of that game with an injury. ... Bruno Caboclo wasn't available a few hours after Houston acquired the Brazilian shooter from Memphis in a trade for Jordan Bell.\n\nLakers: Davis went to the locker room shortly before halftime. He sprained his right index finger, but returned to start the second half with a wrap on his hand. ... LA didn't make a trade near the deadline for the first time since 2016. ... James got fans on their feet with a double-pump, two-handed reverse dunk when he got out alone on a break in the third quarter.\n\nCOLLISON'S VIEW\n\nThe Lakers stood pat at the trade deadline, preferring to stick with the roster that has spent nearly five months building the chemistry necessary to post the Western Conference's best record.\n\nThey might not be done adding to the roster, however: Darren Collison watched the game next to Lakers owner Jeanie Buss in the second half. The Rancho Cucamonga native and UCLA product is reportedly weighing an NBA return after retiring from his 10-year career in June.\n\n\"I'm never one to talk fantasy basketball,\" James said when asked about Collison's potential fit in LA. \"We'll see what happens.\"\n\nRUSS MILESTONE\n\nWestbrook scored his 20,000th career point during the game in his hometown. He joined James and Oscar Robertson as the only players in NBA history with 20,000 points, 7,000 assists, 6,000 rebounds.\n\n\"That's a blessing,\" Westbrook said. \"I'm thankful for being healthy. Thankful for having so many great teammates.\"\n\nLET'S GET SMALL\n\nHouston gave up big man Clint Capela to acquire Covington, leaving the club with an uncommonly small roster even by the Rockets' standards. They still have 7-footers Tyson Chandler and Isaiah Hartenstein on the roster, but neither got playing time at Staples Center while D'Antoni used only nine players.\n\nDanuel House Jr., who is listed at 6-foot-6, was the Rockets' starter. P.J. Tucker, who is 6-foot-5, occupied the nominal center spot and attempted to guard the Lakers' big men, but immediately got into foul trouble.\n\nThe Lakers adapted their own lineups, with Howard and McGee playing only a combined 20 minutes.\n\nUP NEXT\n\nRockets: Visit the Phoenix Suns on Friday night.\n\nLakers: Visit the Golden State Warriors on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995979.29229
}