{
  "game_id": "0022200665",
  "espn_id": "401468820",
  "date": "Jan 17, 2023",
  "matchup": "TOR @ MIL",
  "headline": "Holiday scores season-high 37, Bucks beat Raptors 130-122",
  "body": "MILWAUKEE -- — Jrue Holiday scored a season-high 37 points and the Milwaukee Bucks beat the Toronto Raptors 130-122 on Tuesday night.\n\n\r\n              The Bucks, playing without Giannis Antetokounmpo for the fourth consecutive game, shot 19 for 39 (49%) from 3-point range.\n\n\r\n              Grayson Allen added 25 points, hitting four of five 3-pointers. \n\n\r\n              Fred Van Vleet led Toronto with 39 points, tying his season high. Gary Trent Jr. added 28 points and Pascal Siakam had 23.\n\n\r\n              Play got chippy and action was halted at 6:40 of the fourth quarter with Milwaukee leading 113-110 after an altercation near the Bucks' basket between Trent and Milwaukee's Brook Lopez. After a lengthy review by officials, Lopez was whistled for two technical fouls and ejected. Technicals were also called on Toronto’s O.G. Anunoby and Toronto assistant coach Jamaal Magloire on the play. No foul shots were awarded.\n\n\r\n              Bill Kennedy, the crew chief for the three referees, told a pool reporter that Lopez was given one technical for removing Trent's headband and one for pushing Anunoby. Anunoby received a technical for pushing Lopez and Magloire for pushing Milwaukee's Bobby Portis, Kennedy said.\n\n\r\n              “I can't expect the refs to get it right,\" Lopez said of his first career ejection. \"If they're not going to get it right during the game, why are they going to get it right when they replay it, or any other calls. It's what it is.” \n\n\r\n              Lopez scored 15 of his 19 points in the third quarter before being ejected.\n\n\r\n              The Bucks enter a three-day break having gone 2-2 without Antetokounmpo. The two-time MVP and league’s fourth-leading scorer has left knee soreness. Khris Middleton missed his 17th straight game with right knee soreness.\n\n\r\n              After a tight first three quarters, Milwaukee never gave up the lead in the fourth, getting nine points from Holiday.\n\n\r\n              “I know when Giannis and Khris are out, I have to be aggressive at some point, touch the paint as much as I can, try to get as many 3s as I can for other players and myself,” Holiday said. \n\n\r\n              Holiday also had seven assists, six rebounds and two assists. It was the second straight game that Holiday posted a season-high in points. He had 35 on Monday in the Bucks' win over Indiana. \n\n\r\n              “Obviously we're a little bit down, a little bit undermanned and he's just stepped up in a big way,\" Bucks coach Mike Budenholzer said. “It's two games in a row, just vintage Jrue Holiday. He just seems like he's got a bounce, he's got a pop. The way he's shooting the ball and when gets to the rim and to the paint and gives us that presence, too. He's doing everything.\"\n\n\r\n              The Bucks led by 10 points after the first quarter and the Raptors led by seven at halftime. The Bucks seized the lead in the third period and carried an eight-point advantage into the final quarter.\n\n\r\n              TIP-INS\n\n\r\n              Raptors: Scottie Barnes had scored 20 or more points in four of his five previous games. Barnes “has just decided to play more aggressive and that’s good,“ Nurse said. “We’re finding that he can bring it and be aggressive, we can play through him a little bit, let him kind of play pass-first and if that isn’t there let him be aggressive after that, and play through the low post a little bit, as well.” Barnes scored 14 points and had 13 rebounds Tuesday.\n\n\r\n              Bucks: Budenholzer said he expects Antetokounmpo “to be ready to go soon, but we’ve just got to take it day by day with him. He’s doing a lot of work in the weight room, he’s doing some work on the court, he’s doing some of his warmups.” \n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Minnesota on Thursday.\n\n\r\n              Bucks: At Cleveland on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994053.6767628
}