{
  "game_id": "0022000030",
  "espn_id": "401267190",
  "date": "Dec 26, 2020",
  "matchup": "SAC vs. PHX",
  "headline": "Fox and Kings hold off Suns 106-103",
  "body": "SACRAMENTO, Calif. -- — De’Aaron Fox had 24 points and seven assists, Richaun Holmes and Buddy Hield combined for five free throws in the final two minutes and the Sacramento Kings held off the Phoenix Suns 106-103 on Saturday night.\n\n\r\n                    Marvin Bagley III added 13 points and 11 rebounds, Harrison Barnes had 11 points and 11 rebounds, and Hield finished with 14 points for Sacramento.\n\n\r\n                    Devin Booker scored 26 points for Phoenix. Chris Paul had 22 points and 12 assists.\n\n\r\n                    “We found a way to grind out a win,” Kings coach Luke Walton said. “There’s lots of games throughout an NBA season that are going to require that type of mentality. Give our guys a lot of credit for the effort they played with.”\n\n\r\n                    Three nights after beating Denver on a last-second tip-in by Hield in overtime, the Kings had to sweat out another close one.\n\n\r\n                    Sacramento led 99-97 before Holmes scored on a three-point play with 1:43 remaining. Paul responded with a short jumper and free throw before Holmes made a pair from the stripe.\n\n\r\n                    After Booker missed a jumper with 4.7 seconds left, Hield made two free throws. Paul then made a 3-pointer at the buzzer.\n\n\r\n                    “I don’t know if relieved is the right word.” Barnes said. “We were just trying to maintain the edge that we had in that second half of that Denver game that really allowed us to kind of get over the hump and get that win. We were going to try to bring that into this game.”\n\n\r\n                    The loss ended the Suns’ nine-game winning streak dating to last season when Phoenix won its final eight games in the NBA bubble.\n\n\r\n                    Suns coach Monty Williams was troubled by his team’s perimeter shooting and noted that Phoenix has to regroup quickly with another game in Sacramento on Sunday.\n\n\r\n                    “It’s going to be a matter of will,” Williams said. “Both of us know each other. We have the fresh memory of tonight’s game. Coming out tomorrow, it’s going to be which team imposes its will on the other. We have to rise to the challenge.”\n\n\r\n                    The Kings got off to an 11-0 start and led most of the first half. Barnes sparked the fast start with a low bucket, a steal and a dunk.\n\n\r\n                    The Suns closed within 58-54 at halftime after Paul’s 3-pointer at the buzzer was waved off. The play was reviewed and overturned. \n\n\r\n                    TWO DOWN, 70 TO GO\n\n\r\n                    Sacramento is off to a 2-0 start for the first time since beating Cleveland and Philadelphia to open the 2003-04 season under then-coach Rick Adelman. The Kings last made the playoffs in 2005-06, the longest active drought in the NBA.\n\n\r\n                    “It’s nice but it’s mainly nice because it continues to support the journey we’re on and support the work that’s being put in by our players,” Walton said. “We’ll take it.’’\n\n\r\n                    MISFIRING SUNS\n\n\r\n                    Phoenix shot 41.8% from the floor and was especially cold beyond the arc, going 11 of 44 on 3-pointers. Sacramento wasn’t much better at 5 for 23. “We have enough shooters to really knock those in at a higher clip,” said Jae Crowder, who had three 3s. “Looking at (the Kings) they made five 3s and beat us pretty good.”\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Booker had 11 points in the third quarter … Phoenix missed 16 of its first 3-point attempts. ... Phoenix last won 10 straight in 2010.\n\n\r\n                    Kings: Bagley has had a double-double in each of Sacramento’s first two games this season. The second overall pick in 2018, Bagley had only three during an injury-plagued season a year ago. \n\n\r\n                    UP NEXT\n\n\r\n                    The Suns and Kings continue their back-to-back Sunday night and tip off an hour earlier at Golden 1 Center. It’s the last time the teams will meet this season after splitting four games a year ago.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997206.5590441
}