{
  "game_id": "0022200098",
  "espn_id": "401468253",
  "date": "Oct 31, 2022",
  "matchup": "IND @ BKN",
  "headline": "Durant's 36 lifts slumping Nets to second win of the season",
  "body": "NEW YORK -- — Kevin Durant scored 36 points to lift the Brooklyn Nets to a much-needed 116-109 win over the Indiana Pacers on Monday night.\n\n\r\n              Durant authored some personal and franchise history in Brooklyn’s second win of the season (2-5). With two first quarter free throws, Durant passed Vince Carter for 19th on the NBA’s All-Time scoring list. He now has 25,754. And he has scored at least 25 points in each of the first seven games of the season, the most in franchise history.\n\n\r\n              “You definitely can't take him for granted,” Nic Claxton said about Durant. “Seeing him work his way back from the Achilles injury, went to rehab and how serious he took every single step. And now these past few years he's doing his thing. Definitely you don't take that for granted. It's a pleasure to watch.”\n\n\r\n              Kyrie Irving added 28. Claxton had 19 points and nine rebounds.\n\n\r\n              “It was very important for us to get a response,” Brooklyn coach Steve Nash said. “The win is nice but I care much more about the process. And I thought our process was great.”\n\n\r\n              Despite a 30-point performance from Chris Duarte, Indiana dropped to 3-5. Buddy Hield chipped in with 22. Bennedict Mathurin contributed 16, and Tyrese Haliburton had 11.\n\n\r\n              “We were flat at the beginning (and) they came out with a lot of force. Didn’t match it early and the hole cost us,” said Rick Carlisle. “...Their level of desperation was really there, I thought.” \n\n\r\n              The Nets won a highly entertaining back-and-forth game in the fourth quarter. Entering the final 12 minutes, Brooklyn had a 92-85 lead. But Indiana used a 15-8 spurt over the first 6½ minutes to draw even at 100-all.\n\n\r\n              “A lead is never safe with them,” Nash said.\n\n\r\n              On their next two possessions, the Nets responded. First Claxton’s two-handed follow dunk of an Irving missed 3 put Brooklyn up by two, and 28 seconds later Durant drilled a pullup jumper to stretch the lead to 104-100.\n\n\r\n              A few moments later the lead was seven following two made Durant free throws and a Claxton free throw. Indiana closed to 112-109 on a Mathurin floater with 1:43 left.\n\n\r\n              “Guys are able to make plays,” Nets forward Joe Harris said of the Pacers. “They're young players but they're really talented, especially offensively.” \n\n\r\n              But an Irving floater extended the lead to five, and two Durant free throws sealed the win.\n\n\r\n              “They’ve got two guys who are just breathtaking playmakers and shotmakers in Irving and (Durant),” Carlisle said. “Those guys are (going to) hit some of those shots.”\n\n\r\n              TIP-INS:\n\n\r\n              Pacers: Entering their eighth game of the season, Indiana was second in the league in scoring, averaging 118.9 points per game. During his pregame availability, Carlisle pointed to Haliburton’s play as a reason for the Pacers’ early success. “As other players watch Tyrese,” Carlisle said, “they (say), ‘Wow, this guy plays fast.’ He moves it quickly. He’s got an amazing skill set.” \n\n\r\n              Nets: About two hours before tipoff, the Nets announced guard Ben Simmons would miss the game with a “sore left knee.” Simmons, who missed all of the 2021-22 season with a back injury which would require microdiscectomy surgery on May 5, had played in Brooklyn’s first six games and averaged 6.2 points, 6.5 rebounds, 7.2 assists, 1.2 steals, and 0.7 blocks.\n\n\r\n              UP NEXT:\n\n\r\n              Pacers: Hosts Miami Friday.\n\n\r\n              Nets: Hosts Chicago Tuesday.\n\n\r\n              ——\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994341.798317
}