{
  "game_id": "0022200751",
  "espn_id": "401468906",
  "date": "Jan 28, 2023",
  "matchup": "TOR @ POR",
  "headline": "Achiuwa leads Raptors to 123-105 win over Trail Blazers",
  "body": "PORTLAND, Ore. -- — Precious Achiuwa scored 27 points and grabbed 13 rebounds in place of the injured OG Anunoby to lead the Toronto Raptors to a 123-105 victory over the Portland Trail Blazers on Saturday night. \n\n\r\n              Pascal Siakam scored 24 points and Gary Trent Jr. added 19 against his former team for the Raptors, who led by as many as 23 and never trailed. Scottie Barnes had 18 points, 10 rebounds and seven assists. \n\n\r\n              The Raptors were without Anunoby after he injured his left wrist Friday against Golden State. Coach Nick Nurse said X-rays were negative, but the team was still awaiting results of an MRI taken Saturday. Achiuwa stepped up in Anunoby's absence. \n\n\r\n              “He was in the right place at the right time a lot tonight and that’s a good sign that he’s making himself available,” Nurse said. “He made really good reads and (teammates) found him and he made a couple of plays on his own. \n\n\r\n              \"I was happy that he was available because teams will step up to Pascal when he’s driving.” \n\n\r\n              Damian Lillard scored 30 points and Jerami Grant 28 for Portland, which had 12 turnovers that led to 22 points for Toronto. The Trail Blazers were also outrebounded 45-27. \n\n\r\n              Lillard’s 3-pointer cut the Raptors' lead to 94-90 with 8:41 left, but that was the closest the Blazers would get. \n\n\r\n              “They came out and imposed their will against us,” Blazers coach Chauncey Billups said. \n\n\r\n              The Raptors answered with baskets on their next three possessions to make it 100-90 and forcing a timeout by the Blazers with 7:24 left. Blazers coach Chauncey Billups was called for a technical foul during the timeout and Fred VanVleet extended the lead to 101-90. \n\n\r\n              A 3-pointer by Siakam made it 108-90 to send Portland fans to the exits. \n\n\r\n              “You’re on the road in a tough environment and they really banded together tonight really well,” Nurse said. \n\n\r\n              Nurse was also proud of the job Toronto did on Lillard, who was averaging over 38 points in his last 10 games entering Saturday. \n\n\r\n              “It was a pretty hard working 30,\" Nurse said. \n\n\r\n              Toronto jumped out to a 37-14 lead after the first quarter, shooting 69% from the field while the Trail Blazers shot just 27%.\n\n\r\n              “I think the bad starts have become a trend,” Lillard said of the Blazers, who fell to 2/3 on their six-game homestand. “They came out with more energy than we did and more urgency than we did and they jumped out on us. \n\n\r\n              'It was an uphill battle from that point on.” \n\n\r\n              The Blazers made a few runs in the first half, getting within 12 at 51-39 after a 3-pointer by Nassir Little. It wasn’t long before the Raptors extended their lead again. Achiuwa had two three-point plays to help the Raptors take a 63-44 lead into the break. \n\n\r\n              Grant hit a 3-pointer to open the second half and Portland cut into the deficit to make it 68-56. \n\n\r\n              Behind Grant’s scoring and better defense, the Blazers cut the Raptors' lead to 88-83 heading into the fourth quarter. In addition to Grant’s 14 points in the third quarter, Anfernee Simons scored on consecutive possessions to end the quarter, including a buzzer-beating layup. \n\n\r\n              “Any time you dig yourself a hole in this league, on the one hand, you can always get back into the game because teams play so fast and the game is so long,” Lillard said. “On the other hand, you’re wearing yourself out trying to get yourself back into the game because you have to be close to perfect.” \n\n\r\n              TIP INS \n\n\r\n              Portland C Jusuf Nurkic (calf) and F Josh Hart (hamstring) both missed Saturday night’s game. Without two regular starters, the Blazers inserted C Drew Eubanks and Little into the starting lineup. \n\n\r\n              IN THE CROWD \n\n\r\n              Actor Will Ferrell was sitting courtside. After being introduced to the crowd, most of the arena stood to welcome him. \n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Phoenix on Monday night. \n\n\r\n              Trail Blazers: Host Atlanta on Monday night. \n\n\r\n              —",
  "source": "espn_api",
  "crawled_at": 1764994047.6201391
}