{
  "game_id": "0022000070",
  "espn_id": "401267230",
  "date": "Jan 01, 2021",
  "matchup": "DET vs. BOS",
  "headline": "Grant's 24 points lead Pistons past Celtics for 1st win",
  "body": "DETROIT -- — Jeremi Grant scored 24 points and Derrick Rose added 17 as the Detroit Pistons won for the first time this season, beating the Boston Celtics 96-93 on Friday night.\n\n\r\n                    Rookie Saddiq Bey added 17 points and seven rebounds for the Pistons, who had lost four straight to start the season. Blake Griffin (concussion protocol) did not play, but Mason Plumlee filled in with 17 rebounds and eight points.\n\n\r\n                    “I've been a fan of Saddiq's since he was at Villanova, so I knew we had an asset when we drafted him,” Rose said. “Teams are giving him open looks and he's a shooter. When I'm on the floor with him, I'm always watching to see when I can get him the ball.”\n\n\r\n                    Jayson Tatum had 28 points for the Celtics. Jaylen Brown scored 25, but missed a tying 3-pointer in the final seconds. Boston didn't score in the final 4:15, missing its final 10 shots.\n\n\r\n                    “I thought we had a lot of open looks down the stretch, but we couldn't get anything to go down,” Celtics coach Brad Stevens said. “But that's also a very long, hard-working, well-coached team. They aren't going to be easy to score on.”\n\n\r\n                    The Pistons led by as many as 21 points in the first half and had a 55-40 advantage going into the third quarter, but the Celtics' defense got them back into the game. Boston had nine points off turnovers in the quarter to cut the deficit to 79-73.\n\n\r\n                    “I don't know what happened at the start of the game,” Stevens said. “We just weren't running.”\n\n\r\n                    Bey, though, scored 12 points in the quarter to keep the Pistons ahead.\n\n\r\n                    “We don't know what we've got from Saddiq, because he's not a finished product, but he had another big game for us,” Pistons coach Dwane Casey said.\n\n\r\n                    Brown scored the first seven points of the fourth to give Boston its first lead, and Tatum's 3-pointer made it 93-88 with 4:15 to play. The Celtics missed their next seven shots and Rose's layup put the Pistons ahead 94-93 with 1:20 left.\n\n\r\n                    “I was so proud of our guys because they finished that game with so much defensive energy,” Casey said. “You aren't going to shut down guys like Tatum and Brown every night, but we can make it hard for them every time.”\n\n\r\n                    Bey's free throw made it 95-93 with 25.5 seconds left, and Marcus Smart missed a tying shot with 5.6 seconds remaining.\n\n\r\n                    Plumlee missed the first of two free throws, giving the Celtics a last chance to tie the game, but Brown missed from the right wing.\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Boston missed 11 of its first 13 shots from the floor to fall behind 23-5 with 3:46 left in the first quarter, but outscored the Pistons 35-32 for the rest of the first half. ... Robert Williams III left the game in the fourth quarter after banging legs with Rose.\n\n\r\n                    Pistons: Grant had 18 points in the first half, including a highlight-reel dunk over Daniel Theis. ... Killian Hayes started at point guard despite a sore ankle. He had six assists and did not score in 23 minutes.\n\n\r\n                    ROOKIE'S IMPACT\n\n\r\n                    Pistons rookie Isaiah Stewart had three offensive rebounds in 18 minutes against Boston, giving him 12 in his first three games.\n\n\r\n                    “It's amazing what he has been able to do without playing big minutes,” Plumlee said. “He's always working to get to the glass, which is huge for us.”\n\n\r\n                    UP NEXT\n\n\r\n                    The teams will face each other again on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997923.971185
}