{
  "game_id": "0022000985",
  "espn_id": "401307788",
  "date": "May 04, 2021",
  "matchup": "MIL vs. BKN",
  "headline": "Bucks rally in 4th to beat Nets 124-118, clinch playoff spot",
  "body": "MILWAUKEE -- — Milwaukee's late-season schedule has given the Bucks plenty of opportunities to measure themselves against the two teams they’re chasing in the Eastern Conference standings.\n\n\r\n                    The results have been encouraging.\n\n\r\n                    Giannis Antetokounmpo scored 36 points and the Bucks used a fourth-quarter rally to beat the Brooklyn Nets for the second time in three days, winning 124-118 on Tuesday night. This mini-sweep comes less than two weeks after the Bucks won two straight games from East-leading Philadelphia. \n\n\r\n                    “I'm happy we were able to put on a show for our fans and able to build good habits in those games, but that's all,” said Antetokounmpo, who also had 12 rebounds. “They don't mean nothing. Nobody's going to remember these games when we're in the playoffs.” \n\n\r\n                    Brooklyn (43-23) lost its third straight to fall 1½ games behind Philadelphia (44-21) .  Milwaukee (41-24) clinched a fifth straight playoff appearance, but is third in the East, three behind Philadelphia and 1½ behind Brooklyn.\n\n\r\n                    The Bucks are chasing their first NBA title since 1971. They posted the NBA's best regular-season record in 2018-19 and 2019-20, but lost in the Eastern Conference finals two seasons ago and in the second round last year.\n\n\r\n                    That's why they're not making too much about their regular-season success against the teams ahead of them.\n\n\r\n                    After all, the Nets didn't have James Harden for either of their two losses in Milwaukee. Philadelphia didn’t have All-Stars Joel Embiid and Ben Simmons playing together in any of its matchups with Milwaukee.\n\n\r\n                    If nothing else, these last two weeks have given the Bucks a confidence boost.\n\n\r\n                    “It's important to be playing well going down the stretch here,\" Bucks coach Mike Budenholzer said. \n\n\r\n                    Milwaukee blew a 10-point lead in the second half and trailed 103-97 with 10 minutes left, but it responded with an 18-1 run.\n\n\r\n                    Brooklyn cut the margin to four with 1:02 left, but Antetokounmpo sank a pair of free throws and Jrue Holiday made a steal in the final minute to seal the victory. Holiday had 23 points, 10 assists and eight rebounds.\n\n\r\n                    “They got a nice groove going in the fourth, made shots, made plays,” said Brooklyn's Kevin Durant, who had 32 points, nine rebounds and six assists. “You've got to give them credit.”\n\n\r\n                    Kyrie Irving scored 38 points for the Nets, who got outrebounded 55-39.\n\n\r\n                    Milwaukee's Donte DiVincenzo had a career-high 15 rebounds to go along with 10 points. Khris Middleton had 23 points and seven rebounds.\n\n\r\n                    “They were overall more physical than us on both ends of the floor,” Nets coach Steve Nash said.\n\n\r\n                    The Bucks' fourth-quarter comeback followed their 117-114 Sunday afternoon victory over the Nets, also in Milwaukee.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Spencer Dinwiddie, who suffered a partial tear of his right anterior cruciate ligament in late December, posted a video of his rehab work on Instagram while adding the note, “I think it’s been 17 weeks. What’s the fastest anybody ever returned to Bball? Lol.” Asked about the post, Nash said it wasn’t realistic to believe Dinwiddie could return in time to contribute in the playoffs, though he didn't completely rule it out and said “stranger things have happened.”\n\n\r\n                    Bucks: Jim Paschke, who has called over 2,000 Bucks games as the team's play-by-play television broadcaster over the last 35 seasons, announced he will retire  at the end of the season. Paschke's overall broadcasting career has lasted 48 years. ... Backup point guard Jeff Teague missed the game due to an abdominal strain. \n\n\r\n                    UP NEXT\n\n\r\n                    Nets: At Dallas on Thursday to continue a five-game trip. The Nets lost to the Mavericks 115-98 in Brooklyn on Feb. 27\n\n\r\n                    Bucks: Host Washington on Wednesday as they attempt to sweep the regular-season series. The Bucks won at Washington 125-119  on March 13 and 133-122 on March 15, with Antetokounmpo recording a triple-double in both games.\n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997371.186944
}