{
  "game_id": "0021700903",
  "espn_id": "400975649",
  "date": "Feb 26, 2018",
  "matchup": "OKC vs. ORL",
  "headline": "George's 26 lead Thunder past Magic 112-105",
  "body": "OKLAHOMA CITY --  Orlando Magic coach Frank Vogel knows perhaps better than anyone how far Thunder forward Paul George has come in the NBA.\n\nVogel was a first-year coach with the Indiana Pacers who had just taken over at midseason when he took a chance on George his rookie year and made him a starter. He helped George become one of the league's most decorated stars during a six-year partnership.\n\nGeorge showed he has continued to blossom since they parted ways, scoring 26 points to help the Thunder beat the Magic 112-105 on Monday night.\n\nGeorge, who scored just five points on 1-for-14 shooting in a blowout loss to Golden State on Saturday, bounced back and made 9 of 20 shots against the Magic.\n\n\"I mean, it is what it is,\" George said. \"I'll find that groove. I'll find that shooting stroke. The main thing is to just continue to be aggressive and continue to approach each game like I did the first half and take it to another level. Shots will fall. As long as I can keep that mindset to stay in attack mode, shots will fall eventually.\"\n\nSteven Adams scored 16 points and Russell Westbrook had eight points, 12 rebounds and 11 assists for the Thunder.\n\nEvan Fournier and Jonathon Simmons each scored 19 points and Aaron Gordon added 18 for Orlando, which lost its sixth straight.\n\n\"Our guys competed,\" Vogel said. \"Their second unit just came in and did really well. They moved the basketball really well and created open looks. They just outplayed us.\"\n\nOklahoma City held Orlando to 43 points on 37 percent shooting in the second half.\n\nThe Magic led 62-61 at halftime after shooting 56 percent and making 8 of 14 3-pointers before the break. Westbrook, George and Carmelo Anthony shot a combined 9 for 25 in the first half, but Adams kept the Thunder in the game with 15 points.\n\nThe Thunder opened the second half with a 6-0 run. After the teams played evenly through much of the quarter, Oklahoma City closed with a 9-0 run to lead 84-75 heading into the fourth.\n\nA dunk by Gordon cut Oklahoma City's lead to 105-101, but George hit a 3-pointer with about a minute remaining to make it a seven-point lead.\n\nOklahoma City's reserves outscored Orlando's 48-24. Raymond Felton scored 13 points, Alex Abrines scored 12, Patrick Patterson added 11 and Jerami Grant scored 10.\n\n\"That's the way we have to perform the rest of the year and throughout the postseason,\" Felton said.\n\nTIP-INS\n\nMagic: Former Thunder G D.J. Augustin started for Orlando. ... The Magic shot 70 percent in the first quarter and made 6 of 8 3-pointers. ... Nikola Vucevic scored 15 points.\n\nThunder: Abrines got a monster stuff on a drive by Mario Hezonja in the second quarter. It was the shooting guard's sixth block of the season. ... The Thunder held the Magic to 15 points in the third quarter. ... Westbrook finished with five fouls. He averages just over two fouls per game. ... Westbrook fell one basket short of what would have been his 19th triple-double of the season and the 98th of his career. ... Oklahoma City out-rebounded Orlando 50-35.\n\nQUOTABLE\n\nVogel, when asked before the game how George has evolved defensively: \"He never led the league in steals for me.\"\n\nSTAT LINES\n\nWestbrook scored in single digits for just the second time this season. He scored six points in the second game of the season against Utah.\n\nUP NEXT\n\nThe Magic host the Toronto Raptors on Wednesday.\n\nThe Thunder visit the Dallas Mavericks on Wednesday.\n\n---\n\nFollow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993091.0779781
}