{
  "game_id": "0022401021",
  "espn_id": "401705587",
  "date": "Mar 21, 2025",
  "matchup": "CLE @ PHX",
  "headline": "Durant scores 42 points, Suns hand Cavaliers 4th straight loss 123-112",
  "body": "PHOENIX -- — Kevin Durant scored 42 points and the Phoenix Suns defeated the suddenly struggling Cleveland Cavaliers 123-112 on Friday night.\n\n\r\n              It was the Suns’ third straight win and kept them in a tie with Dallas for the final play-in spot in the West at 34-37.\n\n\r\n              Devin Booker scored 17 points and Tyus Jones scored 16. Royce O'Neale had 15 points on five 3-pointers for Phoenix. \n\n\r\n              Cleveland, which saw its 16-game winning streak snapped by Orlando on Sunday, has now lost a season-high four in a row to fall two games behind Oklahoma City for the NBA’s best record. Their 56-14 mark still leads the East comfortably.\n\n\r\n              Darius Garland scored 18 points for Cleveland. Evan Mobley had 16 points and 12 rebounds and former Sun Ty Jerome also scored 16 for the Cavs. All-Star Donovan Mitchell scored just seven points.\n\n\r\n              The Suns were without Bradley Beal (hamstring) and their top two centers, Nick Richards (calf) and Mason Plumlee (quad). Third-stringer Oso Ighodaro played a game-high 44 minutes and had a team-high 13 rebounds.\n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland looked out of sync most of the night and continued to struggle on their five-game West Coast swing after losses at the Clippers and Kings.\n\n\r\n              Suns: A critical win in a mostly disappointing season for Phoenix as they try to qualify for the play-in round in the West. The Suns have 11 games remaining and all but one are against teams currently in playoff position.\n\n\r\n              Key moment\r\n              O’Neale hit consecutive 3-pointers early in the second quarter to put the Suns ahead 47-38 and they maintained the lead from then on. They led 62-51 at the half.\n\n\r\n              Key stat\r\n              Mitchell missed his first seven shots from the field and was 2 of 18 for the game, missing all eight tries from 3-point range.\n\n\r\n              Up next\r\n              Cavaliers at Utah on Sunday; Suns host Milwaukee on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998307.059063
}