{
  "game_id": "0022300173",
  "espn_id": "401584801",
  "date": "Nov 11, 2023",
  "matchup": "ORL vs. MIL",
  "headline": "Paolo Banchero and Wagner brothers power Magic to a 112-97 win over Bucks",
  "body": "ORLANDO, Fla. -- — Paolo Banchero had 26 points and 12 rebounds, Orlando's Wagner brothers combined for 43 points and the Magic dealt the Milwaukee Bucks their second straight loss, 112-97 on Saturday night.\n\n\r\n              Milwaukee's Giannis Antetokounmpo had 35 points, 10 rebounds and seven assists, two nights after a 54-point effort in Thursday's loss at Indiana.\n\n\r\n              The Bucks played a second game without Damian Lillard, who has a sore left calf.\n\n\r\n              Franz Wagner scored 24 for the Magic and Mo Wagner came off the bench with 19 points and four rebounds. Jalen Suggs added 20 points.\n\n\r\n              The loss broke Milwaukee's 14-game win streak against the Magic and marked the Bucks' first loss in Orlando since March 14, 2018.\n\n\r\n              The Magic's 35 free-throw attempts left Antetokounmpo frustrated with his team's defense.\n\n\r\n              “Sometimes you have to put your body on the line, take that hit, to make it easier for our defense. The last two games we haven’t done it,” he said. \"Right now, I feel like we’re just being stagnant. We’re going back on defense and not showing a lot of help. We’re not protecting one another as much as we should and sometimes when we turn the ball over, we sit and kind of complain.\n\n\r\n              “We’ve got to get out of that mentality and stop feeling sorry for ourselves.”\n\n\r\n              The Magic led by double digits after a 9-0 run midway through the second quarter.\n\n\r\n              The Bucks fell behind 65-49 after a first half in which they had nine turnovers and missed nine free throws.\n\n\r\n              The Magic took that 16-point lead into the fourth quarter, but the Bucks made their first six shots in the period, including 3-pointers by Khris Middleton and Bobby Portis, and quickly reduced Orlando's margin to 11.\n\n\r\n              But Banchero answered with a long jumper, Jonathan Isaac hit a 3-pointer and the Bucks never threatened again.\n\n\r\n              “They made their run to cut it to 11. We just came to the huddle and I told everybody to just stay poised, stay aggressive, and just finish the game out,” Banchero said. “That's what we did. I definitely felt like we deserved to win that game.”\n\n\r\n              The win left the Magic at 5-4 after they started last season 5-20, and according to coach Jamahl Mosley, beating the Bucks was a breakthrough.\n\n\r\n              “It's so important for our fans that they witness what our guys are doing right now, tonight,” Mosley said. “They played with a level of toughness, they sat down and guarded. They took on all challenges.”\n\n\r\n              The often-injured Isaac finished the game and scored 10 points, with five rebounds and a block in 17 minutes.\n\n\r\n              Magic guard Markelle Fultz, who played 29 minutes in Thursday night's loss to Atlanta after missing three games with a swollen left knee, was a late scratch.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Chicago Bulls on Monday.\n\n\r\n              Magic: At Brooklyn Nets on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995746.7891
}