{
  "game_id": "0021800685",
  "espn_id": "401071361",
  "date": "Jan 19, 2019",
  "matchup": "MIA @ CHI",
  "headline": "Wade helps Heat beat Bulls 117-103",
  "body": "CHICAGO --  Dwyane Wade had a simple mission for his final game in his hometown.\n\nWin.\n\nWade had 14 points, 10 rebounds and seven assists, helping the Miami Heat beat the skidding Chicago Bulls 117-103 on Saturday night.\n\n\"I wasn't coming off that floor until we got that win,\" he said. \"That's how I wanted to end my last game here. I didn't want to go out and score 30 or anything like that. It doesn't matter as much as getting a win.\"\n\nWade, who turned 37 on Thursday, plans to retire at the end of his 16th NBA season. He got a warm reception in his return, hearing several loud ovations throughout the night.\n\n\"It was just joyous just to see and hear so much great appreciation for what I've been able to do in the game of basketball,\" he said.\n\nJosh Richardson had 26 points for Miami, and Dion Waiters finished with 21. The Heat had dropped two in a row.\n\nChicago lost its 10th straight game. Zach LaVine scored 22 points for the Bulls, and Bobby Portis had 21. Lauri Markkanen finished with 20 points and nine rebounds.\n\n\"I thought we were in control of the game until maybe the last three minutes of the second quarter,\" Bulls coach Jim Boylen said. \"I don't think we managed the end of the quarters very well.\"\n\nWade played for the Bulls during the 2016-17 season, and the team honored him with a video tribute during the first timeout in the first quarter. The sellout crowd gave Wade a standing ovation and he responded by waving to the fans.\n\nWade got another loud ovation when he entered the game. He shot an air ball on his first attempt, but then nailed a 3-pointer on his second shot. He had nine first-half points, but the Heat trailed 57-55 at the break.\n\nRichardson had 11 points on 4-for-6 shooting and Wade added five in the third quarter as Miami took an 83-76 lead into the fourth.\n\nWith Miami leading 91-86 early in the final quarter, the Heat went on a 14-2 run to put the game away.\n\n\"In the second half, they came with that spirit, more aggressiveness,\" Chicago's Kris Dunn said. \"They punched us in the mouth and we didn't respond.\"\n\nAll that remained was one last send-off for Wade. He heard more loud cheers when he exited with two minutes to play.\n\n\"That was cool,\" Heat coach Erik Spoelstra said. \"You hope in these situations it can all work out perfect where your team can play well, where the game can be in control for the coach's sake and you can give him a chance for the ovation he deserves.\"\n\nTIP-INS\n\nHeat: Wade entered with 997 career points against Chicago. He now has scored 1,000 points against eight NBA teams.\n\nBulls: Rookie C Wendell Carter Jr. is going to have surgery on his left thumb, but no date has been set for the procedure. He is expected to be sidelined for eight to 12 weeks. \"He's meeting with his family and his representation and our medical staff,\" Boylen said.\n\nCHICAGO G.O.A.T.\n\nWade was asked if he was the greatest Chicago-area basketball player of all-time.\n\n\"I have no idea,\" he said. \"When people have asked me who I think the best player who was born and raised in Chicago, I always go with Isiah Thomas.\"\n\nThomas averaged 19.2 points and 9.3 assists in 13 NBA seasons. He also won two NBA championships with the Detroit Pistons.\n\nThomas tweeted during the game he thought Wade was the best player to come out of Chicago.\n\n\"I will be second to him any day!\" Thomas posted.\n\nWade entered Saturday's game with career averages of 22.2 points, 5.4 assists and 4.7 rebounds. He has three NBA titles.\n\nMJ MEETING\n\nWade was supposed to miss the Heat's first game in Chicago during his rookie season with a wrist injury.\n\n\"I ran into Michael Jordan the night before the game and he said, `I'm looking forward to seeing you play,\" Wade recalled. \"I said, `Well, I guess I'm playing.\"\n\nHe played 36 minutes in that first appearance, finishing with 10 points and eight assists.\n\nUP NEXT\n\nHeat: At Boston Celtics on Monday night to conclude a four-game road trip.\n\nBulls: At Cleveland Cavaliers on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995242.789804
}