{
  "game_id": "0022400344",
  "espn_id": "401704910",
  "date": "Dec 07, 2024",
  "matchup": "TOR vs. DAL",
  "headline": "Doncic's 2nd straight triple-double and the 79th of his career helps Mavs beat Raptors 125-118",
  "body": "TORONTO -- — Luka Doncic had 30 points, 13 rebounds and 11 assists for his second straight triple-double, Kyrie Irving scored 29 points and the Dallas Mavericks extended their winning streak to seven games with a 125-118 win over the Toronto Raptors on Saturday night.\n\n\r\n              Doncic's second triple-double of the season was the 79th of his career, moving him past Wilt Chamberlain and James Harden and into sole possession of seventh on the all-time list.\n\n\r\n              Klay Thompson scored 20 points as the Mavericks extended the NBA’s longest active winning streak.\n\n\r\n              Doncic had 15 points, eight assists and six rebounds by halftime. He banked in a 35-foot 3-pointer at the second-quarter buzzer to give Dallas a 70-54 lead at the break.\n\n\r\n              Doncic threw a no-look, over-the-head assist to Irving for a 3-pointer in the first. He reached his triple-double on a defensive rebound with 1:58 left in the third.\n\n\r\n              Doncic had 21 points, 10 assists and 10 rebounds in Thursday’s win at Washington.\n\n\r\n              Scottie Barnes had 19 points and a career-high 14 assists for Toronto. Gradey Dick scored 27 points and Jakob Poeltl had 20.\n\n\r\n              Takeaways\r\n              Mavericks: Irving scored 14 of Dallas’ final 17 points in the first.\n\n\r\n              Raptors: Poeltl returned after missing Thursday’s loss to the Thunder because of illness. Kelly Olynyk played 14 minutes after missing the first 23 games because of a sprained back. Olynyk scored 13 points.\n\n\r\n              Key moment\r\n              Toronto trailed by 24 before cutting the gap to five points, 120-115, on Dick’s 3 with 1:35 left in the fourth. But reviews of a goaltending call and a defensive foul went against the Raptors.\n\n\r\n              Key stat\r\n              Doncic and Irving combined for 12 of Dallas’ 17 3-pointers. Doncic made 6 of 13, and Irving made 6 of 9.\n\n\r\n              Up next\r\n              Toronto hosts New York on Monday, while Dallas visits Western Conference-leading Oklahoma City in an NBA Cup game on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997614.0917718
}