{
  "game_id": "0022200519",
  "espn_id": "401468674",
  "date": "Dec 28, 2022",
  "matchup": "MIL @ CHI",
  "headline": "DeRozan scores 42 points, Bulls beat Bucks 119-113 in OT",
  "body": "CHICAGO -- — DeMar DeRozan compared the Chicago Bulls' success this season against the Eastern Conference's best teams to being chased by a dog.\n\n\r\n              They know they they have to keep going and can't slow down. \n\n\r\n              DeRozan scored 42 points and the Bulls rallied to beat Giannis Antetokounmpo and the Milwaukee Bucks 119-113 in overtime Wednesday night.\n\n\r\n              The Bulls trailed by 15 early in the fourth quarter and were down 11 with less three minutes to go in regulation, only to pull even in the closing seconds. DeRozan had a steal and passed to Ayo Dosunmu for the tying dunk, then scored 10 in overtime. Nikola Vucevic hit a 3 in the extra period and the Bulls beat one of the NBA’s best teams after losing to one of the worst — Houston — two nights earlier.\n\n\r\n              “You run faster if a dog starts chasing you, right?” DeRozan said. “It’s kind of like that type of feeling, if that makes sense.”\n\n\r\n              Chicago is a combined 5-1 against the top three teams in the East — Boston, Brooklyn and Milwaukee. The Bulls are also 2-0 against Miami, which reached the conference finals last season.\n\n\r\n              “I guess the best bring out the best out of you,” DeRozan said. “We got to go out there and play like that every single night.”\n\n\r\n              Antetokounmpo matched a season high with 45 points and set one with 20 rebounds. He also committed two turnovers in the closing seconds of regulation, and the Bucks extended their season-high losing streak to four.\n\n\r\n              BULLS RALLY\n\n\r\n              DeRozan made it a two-point game near the end of regulation with a cutting layup, then stole Antetokounmpo’s inbounds pass intended for Allen and fed Dosunmu for a dunk that tied it at 106 with 7.8 seconds remaining. Antetokounmpo got called for traveling with about a second left.\n\n\r\n              “I read it perfect, got the steal, seen Ayo leaking out and hit him for the dunk,” DeRozan said.\n\n\r\n              Antetokounmpo sensed DeRozan knew the play. But he didn't think the game came down to that.\n\n\r\n              “It's not just one play,” he said. “It's a collection of plays. Make some shots. ... There were some in-and-out 3s. Tough.”\n\n\r\n              BULLS PREVAIL\n\n\r\n              The Bucks were up by four in OT when DeRozan scored on a finger roll and Vucevic nailed a 3 from up top to put Chicago ahead 111-110 with 1:28 left.\n\n\r\n              DeRozan made two free throws before Milwaukee’s Bobby Portis hit a 3 to tie it at 113 with 41 seconds remaining. DeRozan then hit a 12-footer and — after Antetokounmpo missed a fadeaway shot — made four free throws in the final 13.9 seconds.\n\n\r\n              Zach LaVine scored 24 points for Chicago. Vucevic added 15 points and 14 rebounds, and the Bulls improved to 2-0 against the Bucks this season after losing 18 of the previous 20 to them counting the playoffs.\n\n\r\n              Portis had 20 points and 11 rebounds for Milwaukee. Jrue Holiday missed the game because of a non-COVID illness and Khris Middleton remained sidelined because of a sore right knee.\n\n\r\n              HEATING UP\n\n\r\n              Things got heated midway through the quarter, when Chicago's Patrick Williams bumped Grayson Allen into DeRozan. The Bulls star fell to the floor, popped up and had some heated words for Allen, who's not exactly a popular figure in Chicago. Bulls guard Alex Caruso missed seven weeks with a broken wrist following a hard foul by Allen during a game in Milwaukee last January.\n\n\r\n              Williams got called for a foul on the play. Allen made two free throws as the crowd showered him with boos.\n\n\r\n              “It's his track record,” DeRozan said. “If it was Boban (Houston's Boban Marjanovic), I wouldn't have done anything. I didn't know if it was on purpose or what happened.”\n\n\r\n              DeRozan and Portis got technicals with 5:47 remaining in the quarter after Portis made a free throw.\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Coach Mike Budenholzer said he found out Tuesday that Holiday was ill. “We were going to see how he felt this morning, and he didn't get better this morning,” he said. ... Middleton sat out his sixth straight game; he also missed the first 20 of the season.\n\n\r\n              Bulls: G Coby White (left leg) exited in the first half. ... Caruso (right shoulder) missed his third game in a row. Coach Billy Donovan said he's able to shoot, dribble and pass. But the Bulls are being cautious with him. “The biggest part of the sprain right now is him getting hit again could really set him back,” Donovan said. ... F Derrick Jones Jr. (sprained left ankle) missed his fourth consecutive game.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Minnesota on Friday night.\n\n\r\n              Bulls: Host Detroit on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994580.259238
}