{
  "game_id": "0021400554",
  "espn_id": "400578846",
  "date": "Jan 10, 2015",
  "matchup": "CHI vs. MIL",
  "headline": "Pau Gasol's career-high 46 points to go with 18 rebounds power Bulls",
  "body": "CHICAGO -- The Chicago Bulls went right inside to Pau Gasol on their first possession, and just kept feeding the big man. There was no reason to go anywhere else.\nGasol had a career-high 46 points to go along with 18 rebounds, and the Bulls bounced back from two ugly losses with a 95-87 victory over the Milwaukee Bucks on Saturday.\n\"He wasn't going to let us lose tonight,\" coach Tom Thibodeau said.\n\nGasol was 17 for 30 from the field and 12 for 13 at the line in his 20th double-double of the season. He became the first player to record at least 46 points and 18 rebounds for Chicago since Michael Jordan had 69 points and 18 rebounds in a 117-113 overtime victory at Cleveland on March 28, 1990, according to STATS.\n\"You start making your first couple of shots, your teammates start looking for you, and I was able to find good spots and get in rhythm,\" the 34-year-old Gasol said. \"I give a lot of credit to my teammates. They made a lot of plays for me and looked for me a lot of times.\"\nKirk Hinrich added 16 points for Chicago, and Jimmy Butler had nine points, a career-best 10 assists and eight rebounds in the opener of a three-game homestand.\nThe Bulls were coming off a pair of bad losses to Utah and Washington, when they shot a combined 36 percent from the field. They weren't much better against Milwaukee, finishing at 40 percent (35 for 88), but Gasol's big performance was enough to hold off the Bucks.\n\"He was very comfortable right from the first shot of the game,\" Milwaukee coach Jason Kidd said. \"He was very comfortable and you could see that. We have to do a better job at making him feel uncomfortable.\"\nBrandon Knight scored 20 points for Milwaukee, which had won its last five road games. Jared Dudley had 15 points, and fellow reserve O.J. Mayo finished with 12.\nMilwaukee trailed for the entire first half, but moved in front with a 12-2 run to begin the third quarter. Knight had two jumpers in the surge.\nThe Bulls responded with a 10-0 run of their own for a 60-51 lead with 4:43 to go. Butler capped the surge with two free throws after he drew a foul on Khris Middleton while shooting a 3 as the shot clock expired.\n\nGasol then helped the Bulls close it out in the final period. He had a driving layup that made it 87-75 with 4:01 remaining. He finished with four straight free throws, surpassing his previous career best of 44 points for Memphis against Seattle on March 28, 2006.\n\"We kept trying, but we never could get stops when we wanted to,\" Knight said. \"They were able to keep the lead in a comfortable position for them.\"\nThe Bulls played without starters Derrick Rose and Mike Dunleavy. Rose, who missed much of the last 2½ seasons due to a series of injuries, was sidelined by left knee soreness, and Dunleavy missed his fifth straight game with a right ankle injury.\nDunleavy had an MRI and was scheduled to see team physician Dr. Brian Cole on Saturday night. Rose also was expected to meet with Cole, and the point guard also could be headed for an MRI depending on the result of the examination. Thibodeau said after the game that he had no update on either player.\nMISSING\nMilwaukee's visit to the United Center was supposed to be Jabari Parker's first NBA game in his hometown, but the rookie forward is out for the season after tearing the anterior cruciate ligament in his left knee last month.\nSTARTING ASSIGNMENT\nBulls guard Tony Snell had two points, six rebounds and two assists in his first start of the season. He made 12 starts during his rookie year last season.\n\"I thought Tony gave us really good minutes defensively,\" Thibodeau said.\nTIP-INS\nBucks: F Ersan Ilyasova (concussion) missed his 10th straight game, but Kidd said he will make the trip to London for Thursday's game against the Knicks. \"The plan is for him to play there,\" Kidd said. \"We'll see.\" ... Knight tweaked his right ankle while guarding Butler with 10:46 left in the third, but stayed in the game. ... F Kenyon Martin left his second game with Milwaukee with a chest contusion.\nBulls: Gasol had 28 points on 11-for-18 shooting at halftime. ... The Bulls improved to 10-2 in their last 12 home games.\nUP NEXT\nBucks: Play the New York Knicks in London on Thursday.\nBulls: Host Orlando on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764991688.469486
}