{
  "game_id": "0021500244",
  "espn_id": "400828131",
  "date": "Nov 28, 2015",
  "matchup": "LAL @ POR",
  "headline": "Blazers hand Lakers 5th straight loss with 108-96 win",
  "body": "PORTLAND, Ore. -- Damian Lillard says part of his job is recognizing when a teammate is hot. C.J. McCollum certainly was against the Lakers.\nMcCollum had 28 points to complement Lillard's 29 and the Portland Trail Blazers handed Los Angeles its fifth straight loss with a 108-96 victory on Saturday night.\n\"I think we all understand that CJ is a guy that can run off a bunch of points at a time,\" Lillard said. \"At the start of the game, we saw him hit that first one and so I tried to just keep calling plays and in transition keep finding him.\"\n\nMcCollum scored Portland's first nine points and led all players with 19 points in the first half.\nThe Blazers have won three of their last four games after a six-game losing streak, and they've got seven straight victories against the Lakers, including a 107-93 win in Los Angeles last Sunday.\nKobe Bryant scored 21 points in the Lakers' seventh straight road loss. Jordan Clarkson added 19.\nAfterward, McCollum and Bryant shared some words, with both men smiling. McCollum said later that Bryant had inspired him as a kid.\n\"I told him I just appreciated what he's done for the game,\" McCollum said.\nThe Blazers led by as many as 17 points in the first half but the Lakers closed within five in the third quarter.\nMcCollum's jumper put Portland up 90-78 early in the fourth and the Blazers kept the Lakers from making up much ground down the stretch. His 3-pointer with 2:27 left gave the Blazers a 104-93 lead.\nThe Blazers welcomed back Meyers Leonard, who missed seven games with a dislocated left shoulder. The 7-foot-1 forward was averaging 12.3 points and 5.8 rebounds in the four games before his injury.\nLeonard came off the bench and finished with seven points and six rebounds in 22 minutes.\nThe Lakers were playing the first of a back-to-back. They host the Pacers on Sunday before embarking on an eight-game road trip.\nBryant, playing in possibly his last season, was averaging 15.2 points going into the game, shooting just 31.1 percent from the field and 19.5 percent from 3-point range. He was 7 of 20 from the field Saturday and 1 of 5 on 3-point attempts.\nCoach Byron Scott suggested in recent days that he may tinker with his starting lineup. He stayed with his regulars against the Blazers, and Los Angeles fell behind 27-14 in the opening quarter after Lillard hit a 3-pointer.\nLeonard hit a 3-pointer to put the Blazers up 49-34, but the Lakers closed the gap with a 7-0 run capped by Julius Randle's mid-range jumper and free throw that made it 49-42.\nBryant crashed to the floor after a layup with about 2 minutes to go in the first half and appeared to clutch his back when he got up, but he stayed in the game following a timeout.\nHe played 34 minutes, and both he and Scott said they'd wait to see how he felt before making a decision against the Pacers on Sunday.\n\"It's tough,\" Bryant said. \"After almost 20 years it's tough. The legs aren't what they used to be. But I just continue to fight through and take the opportunities when they are there.\"\nThe Blazers led 60-46 at the break following McCollum's 3-pointer. McCollum led all players with 19 points.\nLos Angeles narrowed the margin again, pulling within 70-65 midway through the third quarter after D'Angelo Russell's free throws. Lillard's 3-pointer and a free throw stretched the lead back to 80-70.\nTIP-INS\nLakers: Los Angeles was playing without guard Lou Williams because of personal reasons. He is likely to miss Sunday's game, too, Scott said before the game. ... The Lakers are 0-8 against the Western Conference.\nTrail Blazers: Lillard had scored at least 30 points in four of his previous six games against the Lakers. ... Lillard has 13 games with 20 or more points and five or more assists. ... Former \"Saturday Night Live\" cast member Tim Meadows was in the crowd.\nHIGH PRAISE\nBryant took time to praise Lillard and McCollum: \"Dame is one of the best players in the league. He's a fantastic player and McCollum is growing at an extremely rapid pace. This seems like a breakout year for him.\"\nSTREAK LIVES\nWith his 21 points on Saturday, Bryant has scored 20 or more in each of his last 23 games in Portland.\nUP NEXT\nLakers: Host Indiana on Sunday.\nTrail Blazers: Visit the Clippers on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994309.681024
}