{
  "game_id": "0022201157",
  "espn_id": "401469312",
  "date": "Mar 31, 2023",
  "matchup": "MIN vs. LAL",
  "headline": "Lakers overtake Timberwolves in standings with 123-111 win",
  "body": "MINNEAPOLIS -- — Anthony Davis scored 17 of his 38 points in the fourth quarter and had 17 rebounds to lift the Los Angeles Lakers past Minnesota 123-111 and leapfrog the Timberwolves on Friday night in the crowded Western Conference playoff race.\n\n\r\n              “You’ve got to have that one pivotal force that’s leading the charge, and in our case with this particular team here in the moment it’s AD,\" Lakers coach Darvin Ham said. “When he comes out and he’s aggressive and we’re feeding him and he’s not settling and he’s putting pressure on the paint, putting pressure on the rim, we find ourselves having a lot of success.”\n\n\r\n              LeBron James added 18 points and 10 rebounds and D'Angelo Russell had 12 points and 10 assists against his former team as the Lakers (39-38) won for the fifth time in six games to move into seventh place. They're even with New Orleans, owning the head-to-head tiebreaker over the Pelicans.\n\n\r\n              “We’ve made some huge climbs, but we’re not finished,” said Davis, who had 38 points Wednesday in tthe win at Chicago. \"We’re hungry to not only make the playoffs but make some noise.\"\n\n\r\n              The Lakers improved to 9-4 since losing at home to the Wolves on March 3. \n\n\r\n              “We jumped on AD’s back, and he brought us home,” James said.\n\n\r\n              Mike Conley had 25 points on 7-for-11 shooting with seven assists before fouling out, and Karl-Anthony Towns scored 23 points for the Timberwolves (39-39), who tumbled into ninth place. They entered the evening one game behind Golden State and the cut to avoid the play-in tournament, with the Warriors tipping off later at home against San Antonio.\n\n\r\n              Davis scored 12 straight points for the Lakers over a 3:52 span late in the fourth quarter to seal the steely comeback from a deficit that hit 13 points shortly after halftime. He made five baskets in a row with Wolves center Rudy Gobert on the bench, dominating on the glass, in the post and at the rim.\n\n\r\n              “He’s playing at a super high level right now,” Wolves coach Chris Finch said.\n\n\r\n              The Lakers took charge earlier with a 24-2 spurt over a 6:49 stretch of the third quarter with their defense on lockdown mode. Conley's turn to rest on the bench during that run was ill-timed. Davis rolled his left ankle around the start of the Lakers surge, a breath-holding sequence that only seemed to energize the visitors.\n\n\r\n              “We started to turn the ball over, and the ball started to stick much more,” Gobert said. “We kind of lost our flow offensively, and it really affected our defense.”\n\n\r\n              The Wolves, whose bench was shortened without center Naz Reid and his broken wrist, went 2 for 14 from 3-point range in the third quarter and were outscored 35-18 in a discouraging stretch for a fired-up crowd that included local sports superstars Justin Jefferson and Kirill Kaprizov in floor seats. \n\n\r\n              FEELING BETTER\n\n\r\n              James has been rebuilding his stamina from the month-long absence to a torn tendon in his right foot, and the second time with this new starting lineup with Davis, Russell, Austin Reaves and Jarred Vanderbilt produced a second win to start this five-game road trip.\n\n\r\n              “I’ll be in the lineup on Sunday, so that’s the best response I can have,” James said.\n\n\r\n              Davis, for his part, said he finished the game on adrenaline and would be fine to play on Sunday, too.\n\n\r\n              WHISTLE STOP\n\n\r\n              Gobert ($25,000) and Finch ($15,000) were fined by the NBA for criticizing the officiating Wednesday after their loss at Phoenix when the Suns had 27 free-throw attempts and the Wolves had 12. This time, they went to the line 19 times — making 16 — and the Lakers had 30 tries.\n\n\r\n              TIP-INS\n\n\r\n              Lakers: Vanderbilt had 12 points. ... Another former Wolves player, Malik Beasley, had three first-quarter 3-pointers.\n\n\r\n              Timberwolves: Anthony Edwards had 11 points on just 4-for-16 shooting. ... Gobert had 14 points and 11 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Houston on Sunday night.\n\n\r\n              Timberwolves: Host Portland on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995008.508672
}