{
  "game_id": "401810205",
  "espn_id": "401810205",
  "date": "Dec 06, 2025",
  "matchup": "BKN vs NO",
  "headline": "New Orleans faces Brooklyn on 5-game road skid",
  "body": "New Orleans Pelicans (3-20, 15th in the Western Conference) vs. Brooklyn Nets (5-17, 13th in the Eastern Conference)\n\n\r\n              New York; Saturday, 5 p.m. EST\n\n\r\n              BOTTOM LINE: New Orleans visits Brooklyn looking to stop its five-game road skid.\n\n\r\n              The Nets are 1-10 on their home court. Brooklyn has a 1-12 record against teams over .500.\n\n\r\n              The Pelicans have gone 1-9 away from home. New Orleans leads the Western Conference with 54.6 points per game in the paint led by Zion Williamson averaging 14.6.\n\n\r\n              The Nets average 109.0 points per game, 14.4 fewer points than the 123.4 the Pelicans give up. The Pelicans' 45.3% shooting percentage from the field this season is 4.4 percentage points lower than the Nets have given up to their opponents (49.7%).\n\n\r\n              TOP PERFORMERS: Michael Porter Jr. is averaging 25.3 points, 7.5 rebounds and 3.2 assists for the Nets. Noah Clowney is averaging 29 points and three blocks over the last 10 games.\n\n\r\n              Trey Murphy III is averaging 20.4 points, 6.6 rebounds, 3.5 assists and 1.7 steals for the Pelicans. Jose Alvarado is averaging 3.0 made 3-pointers over the last 10 games.\n\n\r\n              LAST 10 GAMES: Nets: 4-6, averaging 109.1 points, 40.9 rebounds, 25.9 assists, 6.8 steals and 5.1 blocks per game while shooting 45.2% from the field. Their opponents have averaged 111.6 points per game.\n\n\r\n              Pelicans: 1-9, averaging 118.6 points, 43.9 rebounds, 24.8 assists, 9.3 steals and 4.0 blocks per game while shooting 47.1% from the field. Their opponents have averaged 125.8 points.\n\n\r\n              INJURIES: Nets: Haywood Highsmith: out (knee), Michael Porter Jr.: day to day (rest), Drake Powell: day to day (knee), Cam Thomas: out (hamstring).\n\n\r\n              Pelicans: Herbert Jones: out (calf), Yves Missi: day to day (foot), Dejounte Murray: out (leg), Zion Williamson: out (abductor), Jordan Poole: day to day (quad).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042764.4721541
}