{
  "game_id": "0022201189",
  "espn_id": "401469344",
  "date": "Apr 05, 2023",
  "matchup": "BKN @ DET",
  "headline": "Nets beat Pistons 123-108, close in on playoff berth",
  "body": "DETROIT -- — Mikal Bridges scored 26 points and the Brooklyn Nets moved to the verge of a playoff spot by beating the Detroit Pistons 123-108 on Wednesday night.\n\n\r\n              “We just had to stay locked in down the stretch,\" Bridges said. “We knew they made a big run against Miami last night, so we were expecting them to make it tough on us, too.”\n\n\r\n              Former Pistons guard Spencer Dinwiddie shot 1 for 10 from the floor but matched his career high with 16 assists for the Nets (44-36), who won for the fourth time in five games. They need one more victory or loss by Miami (42-37) to clinch the No. 6 seed in the Eastern Conference.\n\n\r\n              Joe Harris had 18 points on six 3-pointers, all in Brooklyn’s 47-point first quarter. \n\n\r\n              “The ball was really moving. Spencer did a great job of facilitating,” he said. “We're playing unselfishly and making the second pass to turn good shots into great ones.”\n\n\r\n              R.J. Hampton had a career-high 27 points for Detroit, which has lost 22 of its last 23 games. Jaden Ivey had 23 points and 10 assists.\n\n\r\n              The Pistons trailed by as many as 19 points, but Hampton had 18 points in the third quarter to help them pull within 96-90.\n\n\r\n              “We took a punch in the third, but I thought we really responded,” Nets coach Jacque Vaughn said. “We had every guy doing whatever they could to try to contribute to a win.”\n\n\r\n              However, Brooklyn was able to take advantage of Detroit's biggest weakness, getting enough offensive rebounds to prevent the Pistons from putting together a fourth-quarter run.\n\n\r\n              “It came down to the little things again tonight -- that's what always seems to be the issue for us,” Hampton said. “We need to take the step up from playing 42 good minutes to playing 48 good minutes. That's when we will win some games.”\n\n\r\n              Brooklyn had its biggest quarter of the season in the first, but Harris missed an open 3-pointer at the buzzer that would have made it 50 points. Dinwiddie's 10 assists in the period were the most in the NBA this season.\n\n\r\n              “We just had everything going and Spencer was finding everybody,” Bridges said. “They kept overhelping and we were able to get a lot of good looks.”\n\n\r\n              The Nets couldn't keep up that pace in the second quarter, but the Pistons were only within 74-57 at the half because of six missed Brooklyn free throws. The Nets had a 35-13 edge in bench scoring in the half and had four players in double figures.\n\n\r\n              After starting 10 of 16, Brooklyn missed 13 of its next 14 3-point attempts, allowing Detroit to stay within 81-69 midway through the third quarter. Hampton led Detroit's rally with four 3-pointers, including a 30-footer to make it 91-87 with 59 seconds left in the third quarter.\n\n\r\n              TIP-INS\n\n\r\n              Nets: The 47-point quarter was the fourth-biggest in franchise history. The Nets had a 51-point fourth quarter against the Boston Celtics on March 3, 2020, and had 48-point quarters against the Pistons (1980) and Orlando (2022). ... The Nets are the last team to lose a home game to the Pistons, losing 130-122 on Jan. 26. \n\n\r\n              Pistons: Detroit finished the season with a 9-32 record at Little Caesars Arena, the only NBA team to win fewer than 10 games at home. Charlotte and San Antonio are next with 13 wins. ... The Pistons were down to six healthy players when Ivey limped off late in the third, but he returned from the locker room for the fourth. \n\n\r\n              WAITING FOR NEXT WEEK\n\n\r\n              Pistons coach Dwane Casey met with owner Tom Gores after the game, but he said they agreed to wait until after the season ends to make any decisions about next year. Casey is 121-261 (.317) in five seasons with the Pistons, including 80-220 (.267) in the last four years.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host the Orlando Magic on Friday before finishing the regular season with a home game against the Philadelphia 76ers on Sunday.\n\n\r\n              Pistons: Finish the season with divisional road games against the Indiana Pacers (Friday) and Chicago Bulls (Sunday). The Pistons are 1-13 against the Central Division this season.",
  "source": "espn_api",
  "crawled_at": 1764994844.179251
}