{
  "game_id": "0022300888",
  "espn_id": "401585516",
  "date": "Mar 05, 2024",
  "matchup": "MIA vs. DET",
  "headline": "Jimmy Butler takes over late, Heat hold off Pistons 118-110 for 11th win in 14 games",
  "body": "MIAMI -- — Jimmy Butler took over late, and it was exactly what the Miami Heat needed.\n\n\r\n              Butler scored 15 of his 26 points in the fourth quarter, Bam Adebayo and Duncan Robinson each scored 18 and the Heat topped the Detroit Pistons 118-110 on Tuesday night.\n\n\r\n              Terry Rozier scored 17 points, Caleb Martin scored 15 and Jaime Jaquez Jr. scored 11 for the Heat, who are 11-3 in their last 14 games. Miami (35-26) moved into sixth in the Eastern Conference, a half-game behind No. 4 Orlando (36-26) and No. 5 New York (36-26), plus a tiebreaker ahead of No. 7 Philadelphia (35-26).\n\n\r\n              “These next 21 games, there's probably going to be a lot of these,” Heat coach Erik Spoelstra said. “It's just the way it's going right now. Everybody's fighting for playoff positioning.”\n\n\r\n              The biggest shot came with 22 seconds left, when Butler hit his first and only 3-pointer of the night to seal the game. Butler now has at least one steal and one 3 in 14 consecutive games, the longest such streak of his career and one game behind Rafer Alston (2004) for the longest in Heat history.\n\n\r\n              Butler is shooting 51% from the field, a career-best-by-far 46% from 3-point range and 86% from the line.\n\n\r\n              “We just do whatever's necessary right now,” Spoelstra said.\n\n\r\n              Cade Cunningham scored 23 points for Detroit, which fell back into a tie with Washington for the NBA’s worst record at 9-52. Simone Fontecchio scored 22 for the Pistons, Jaden Ivey had 16, Jalen Duren scored 14 and Isaiah Stewart added 13.\n\n\r\n              Miami was again without Tyler Herro (foot) and Kevin Love (heel), and Josh Richardson (shoulder) will have season-ending surgery on Wednesday. Some help is on the way; the Heat agreed to terms Tuesday with veteran guard Patty Mills, with that deal likely to be finalized Wednesday.\n\n\r\n              Detroit plays nine of its next 10 games at home, including each of the next six — a stretch capped by back-to-back games against the Heat on March 15 and 17.\n\n\r\n              “We feel like we’re much better than we were earlier in the year. That’s just with continuity,” Pistons coach Monty Williams said. “We feel like the guys we have, as they learn the league and learn how to defend ... that’s part of the maturation and process of developing young players.”\n\n\r\n              The teams hadn't met since opening night of the season, a 103-102 Miami win in which Cunningham had a straightaway 3-pointer bounce off the rim at the buzzer. And this one was almost just as much of a nail-biter for Miami.\n\n\r\n              It was 61-60 Miami at the half. The Heat led by 10 after the first quarter, but Detroit controlled much of the second quarter and the Pistons led by as many as four in the third — before Miami peeled off 15 consecutive points.\n\n\r\n              That spurt took only 2 1/2 minutes. Rozier made a pair of 3-pointers during the run, including the one that capped the burst and put Miami up 80-69 midway through the third.\n\n\r\n              Detroit was undeterred, getting within one possession — three points or less — seven times the rest of the way. But the Pistons never got the lead back; Robinson hit a 3-pointer, Miami's first of the fourth quarter in 10 tries, with 2:05 left for a 111-105 lead, and then Butler sealed it with five straight points in the final minute.\n\n\r\n              “We're trending in the right direction,\" Martin said.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Brooklyn on Thursday night.\n\n\r\n              Heat: Visit Dallas on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995341.314218
}