{
  "game_id": "0021801177",
  "espn_id": "401071850",
  "date": "Apr 04, 2019",
  "matchup": "MIL @ PHI",
  "headline": "Bucks clinch top seed in the East with win over 76ers",
  "body": "PHILADELPHIA --  Giannis Antetokounmpo helped Milwaukee lock up the No. 1 seed in the Eastern Conference and the NBA playoffs with another MVP-worthy performance.\n\nAntetokounmpo outdueled fellow MVP candidate Joel Embiid, finishing with 45 points and 13 rebounds and leading Milwaukee to a 128-122 victory over the Philadelphia 76ers on Thursday night as the Bucks clinched the top spot in the conference and the top overall top seed in the upcoming playoffs.\n\n\"I was just trying to make plays and try to find the opportunity to attack,\" Antetokounmpo said.\n\nAntetokounmpo reached 25 or more points and 10-plus rebounds in a game for the 42nd time this season.\n\n\"He's been doing it all for us this whole season,\" Bucks All-Star Khris Middleton said.\n\nMiddleton added 22 points and George Hill had 20 for the Bucks, who locked up home-court advantage with three regular-season games remaining.\n\n\"It's been a really special year,\" Bucks coach Mike Budenholzer said. \"I'm very proud of the team.\"\n\nEmbiid returned from a three-game absence and had 34 points, 13 rebounds, 13 assists and three blocks. He tipped his cap to Antetokounmpo.\n\n\"He's a helluva player,\" Embiid said. \"You know every time you go against him it's a challenge. He's really good.\"\n\nJJ Redick scored 29 points and Mike Scott, starting for injured Jimmy Butler, had 22 points for the 76ers, who are two games in front of Boston in the race for the No. 3 seed in the East with three games left.\n\n\"We struggled guarding them, didn't we?\" 76ers coach Brett Brown said. \"We gotta do better.\"\n\nThe 76ers led by seven points in the fourth quarter when Embiid's 3-pointer with 8:14 left made it 102-95. But the Bucks, behind the offense and defense of Antetokounmpo, whittled away at the deficit. The Bucks tied the game at 119 on a layup by Hill with 1:24 left.\n\nAfter Redick missed a 3, Hill scored again from close range off an assist from Antetokounmpo to give Milwaukee a 121-119 lead with 1:02 left. Antetokounmpo blocked Embiid's attempt on Philadelphia's ensuing possession and then assisted Sterling Brown's layup that gave the Bucks a 123-119 lead with 40.1 seconds left. That was enough to carry Milwaukee to the win.\n\nERIC'S EJECTION\n\nThe Bucks lost Eric Bledsoe to an ejection when tempers flared 2 1/2 minutes into the contest. After Antetokounmpo hit a 3, Bledsoe pushed Embiid in the back. The 76ers' big man tossed the ball back at Bledsoe, and Bledsoe retaliated by firing the ball at Embiid's chest. Embiid and Scott made a beeline for Bledsoe, but were restrained by officials.\n\nScott and Embiid were issued technical fouls and Bledsoe, the Bucks' third-leading scorer, was assessed a pair of technicals, resulting in his disqualification.\n\n\"It's unfortunate,\" Budenholzer said. \"Neither team wants to have somebody missing. Hopefully, we'll be smarter and better for it. Maybe it's better that it happens now.\"\n\nBUTLER'S BACK\n\nPhiladelphia played without Butler, who missed for the second time in three games due to back tightness.\n\nTIP-INS\n\nMilwaukee: Middleton was back in the lineup after missing the last two contests with left groin soreness, and Ersan Ilyasova returned after missing Monday's 131-121 win at Brooklyn due to a back injury. Ilyasova had three points in 19 minutes.\n\nPhiladelphia: Phillies outfielder Bryce Harper rang the ceremonial Liberty Bell in the pregame and sat in a suite alongside teammate Rhys Hoskins and Eagles quarterback Carson Wentz. . Hall of Famer Allen Iverson sat courtside and embraced Harper in the arena's back hallway. . James Ennis III sat after re-aggravating a right quad injury in Wednesday's 130-122 loss at Atlanta. He is expected to miss two weeks.\n\nUP NEXT\n\nBucks: Host Brooklyn on Saturday.\n\n76ers: At Chicago on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994449.495434
}