{
  "game_id": "0021500660",
  "espn_id": "400828547",
  "date": "Jan 23, 2016",
  "matchup": "PHX vs. ATL",
  "headline": "Goodwin hits 3 with 0.1 seconds left, Suns beat Hawks 98-95",
  "body": "PHOENIX --  Archie Goodwin wanted the ball, even if it wasn't supposed to be his.\n\nGoodwin nixed Phoenix's designed play and hit a 3-pointer from atop the arc with 0.1 seconds left to help the Suns beat the Atlanta Hawks 98-95 on Saturday night and end a six-game losing streak.\n\n\"The play was originally drawn up for Alex (Len) to come off and shoot the 3, but I wasn't going to let him do it. I was going to shoot it all the time,\" Goodwin said. \"I was looking at the play like, `Yeah right, I am shooting this.\"\n\nGoodwin led the Suns with 24 points, and Phoenix won for the second time in 17 games.\n\nTyson Chandler tied a Suns record with 27 rebounds, including 17 in the first half, and also had 13 points and a season-high five assists. The Hawks' Kent Bazemore said Chandler was \"a man among boys out there.\"\n\n\"I'm going to continue to hit the glass and try to help my teammates and give them other opportunities,\" Chandler said. \"As many good looks we are able to get the better.\"\n\nBazemore led the Hawks with 21 points and Al Horford had nine points and 16 rebounds.\n\nBazemore hit a tying 3-pointer with 47.4 seconds left, but Chandler's tip-in with 24.6 seconds remaining gave the Suns a 95-93 lead. Bazemore tied it again 3 seconds later and was fouled but missed a potential go-ahead free throw, setting up Goodwin's 3 over the outstretched arm of Thabo Sefolosha.\n\n\"It was a contested shot so you just have to tip your hat and congratulate him on making that shot,\" Sefolosha said. \"We wanted to win this one. We played pretty hard, now it's just a matter of playing smarter.\"\n\nLen had 16 points and 12 rebounds for Phoenix, while P.J. Tucker scored 16 points and Devin Booker had 15.\n\nThe Suns led by 15 points in the third quarter before the Hawks cut the lead to five, but Phoenix took a 72-60 lead on Tucker's baseline 3 with 57 seconds left.\n\nThe Hawks went on a 10-0 run over the first 2 minutes of the fourth quarter, and Kyle Korver hit back-to-back 3s to tie the score at 74. But Goodwin's flying dunk down the lane energized the Suns and the crowd, giving Phoenix a 79-77 lead with 7:08 left.\n\n\"It's valuable experience for these guys to be in a game like that and win,\" Suns coach Jeff Hornacek said.\n\nThe Suns led throughout the entire second quarter despite eight points from the Hawks' Dennis Schroder, who finished with 19. Atlanta trailed 41-39 with 5:19 left but went scoreless the rest of the period.\n\n\"We aren't making enough plays from the start of the game to the end of the game and understanding what's important,\" Hawks coach Mike Budenholzer said. \"We constantly have to dig ourselves out and come back.\"\n\nBOARD CRASHER\n\nChandler's 27 rebounds equaled the record total for Paul Silas in 1971, and his 13 offensive boards are a franchise record. Chandler had 20 rebounds in his last game against San Antonio and became the first Suns player with consecutive 20-rebound games. He's also the first to grab 14 or more rebounds in three straight games since Amare Stoudemire from Feb. 25-28, 2007. His 23rd rebound came off a fourth-quarter Hawks miss, on which Chandler ripped the ball from teammate Booker and barked at him as Booker backed off and smiled.\n\nTIP-INS\n\nHAWKS: F Paul Millsap missed the game for personal reasons but is expected to rejoin the team in time for its game Monday night at Denver. Millsap's absence meant that Horford is the only Hawk to appear in all of the team's 45 games this season. ... Budenholzer said he hopes former Cavaliers coach David Blatt, recently fired, gets another opportunity in the NBA. \"It's just hard in our league to see somebody that's had that much success, that's done that well, is that well respected,\" Budenholzer said. \"He deserves another opportunity. He's a great coach.\"\n\nSUNS: Only two of the five injured players from earlier in the week were available to play for Phoenix: Tucker started and Mirza Teletovic played 15 minutes. ... G Brandon Knight (left abductor strain), F Jon Leuer (back spasms) and F Markieff Morris (right shoulder strain) did not play. ... The Suns have used 13 different starting lineups and 10 players have combined to miss 54 games this season. ... Former Suns guard and Sacramento mayor Kevin Johnson sat courtside and got a standing ovation when introduced to the crowd.\n\nUP NEXT\n\nHawks: At Denver Monday night.\n\nSuns: At Philadelphia Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994846.165946
}