{
  "game_id": "0021800979",
  "espn_id": "401071652",
  "date": "Mar 08, 2019",
  "matchup": "CLE @ MIA",
  "headline": "Heat stay hot, pull away late to beat Cavaliers 126-110",
  "body": "MIAMI --  Rodney McGruder was having a quiet night.\n\nAnd in a span of 22 seconds, everything changed.\n\nJosh Richardson scored 20 points to lead a club record-tying eight Miami players in double figures, McGruder had a seven-point possession in the fourth quarter to help put the game away, and the Heat beat the Cleveland Cavaliers 126-110 on Friday night.\n\n\"How can you not have fun right now, in a playoff hunt, in a playoff race?\" Heat coach Erik Spoelstra said. \"To be in a playoff race, every game has context and pressure and meaning to it, that's a lot of fun. I want our guys to have fun with this.\"\n\nFun was had. Miami beat Cleveland at home for the 16th consecutive time, a Heat record against any opponent. Bam Adebayo scored 17 points and Justise Winslow finished with 16 points, nine rebounds and nine assists for the Heat -- who got 15 points from Kelly Olynyk, 13 from McGruder, 12 from Dwyane Wade, and 11 apiece from Goran Dragic and Hassan Whiteside.\n\n\"It's been a lot of fun. It has been,\" McGruder said. \"You can see it on everyone's faces out there on the court. We're just enjoying everyone's success.\"\n\nHis seven-point, 22-second play sealed the outcome.\n\nHe made a 3-pointer from the left corner while getting flagrantly fouled by Kevin Love. McGruder made the ensuing free throw, Miami retained the ball because of the flagrant, and McGruder then made a 3 from the right corner. A nine-point game became a 16-point game in an instant, and Miami soon finished off its fourth straight win to remain No. 8 in the East.\n\n\"Strength in numbers,\" Wade said. \"At this time of the year, the numbers really don't matter. It's about us having team success.\"\n\nCollin Sexton led Cleveland with 27 points. Jordan Clarkson scored 21, Love had 19 and Brandon Knight finished with 15 for the Cavaliers, who were officially eliminated from playoff contention.\n\n\"They got in their run at the right time,\" Clarkson said. \"But I felt we were in the game for the most part. Just a lot of mistakes in the fourth.\"\n\nThe Cavs made 19 3s, three of them coming from Sexton, who broke Kyrie Irving's club rookie for 3s by a rookie. But the Cavs lost Larry Nance Jr. to a chest injury in the third quarter, and he did not return. He was scoreless in 17 minutes.\n\nCavs coach Larry Drew said his team won't play out the season like nothing matters.\n\n\"That's not an option and our guys understand that,\" Drew said. \"Every time we step out on the floor, we're going to have some good days and bad days, we understand that. But we will continue to look like a basketball team.\"\n\nIt was Miami's third game in five days -- and like the first two, it was tied at halftime.\n\nNeither team ever led by more than five points in the opening 24 minutes, which featured 22 lead changes and 13 ties. Cleveland outscored Miami 29-28 in the first quarter, the Heat outscored the Cavaliers 29-28 in the second, and that adds up to a 57-57 knotting at intermission.\n\nBut in the third, the Heat got separation. Miami shot 68 percent in the quarter and went into the fourth up 94-83.\n\nTIP-INS\n\nCavaliers: Love said he hasn't decided if he will be part of USA Basketball's quest to win the Basketball World Cup in China this summer. He'll give it more serious thought after the season. \"USA Basketball has been very good to me in my career,\" Love said. ... Matthew Dellavedova (concussion protocol) missed the game. He took a hard hit late in the game at Brooklyn on Wednesday.\n\nHeat: A video tribute to former Heat forward Chris \"Birdman\" Andersen played in the third quarter. Andersen was at the game. ... Olynyk has made at least one 3-pointer in 11 consecutive games, a new career high.... Friday marked the first game this season where the Heat had no players ruled out with injuries.\n\nSTAYING HOME\n\nThe game kicked off a season-high, five-game homestand for Miami, which has matchups left with Toronto, Detroit, Milwaukee and Charlotte -- all either playoff-bound or playoff-contending in the East -- before hitting the road again. Once this homestand ends, Miami will have only four home games left before the end of the regular season.\n\nCOMING HOME\n\nKnight, who grew up in nearby Fort Lauderdale, played at Miami for the ninth time in his NBA career. Each of his last four appearances have come with him wearing four different uniforms -- Milwaukee, then Phoenix, then Houston and now Cleveland. He's also played at Miami with Detroit.\n\nUP NEXT\n\nCavaliers: Host Toronto on Monday.\n\nHeat: Host Toronto on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994743.127054
}