{
  "game_id": "0021700107",
  "espn_id": "400974858",
  "date": "Nov 01, 2017",
  "matchup": "ATL @ PHI",
  "headline": "Simmons, Embiid dominate in 76ers' 119-109 win over Hawks",
  "body": "PHILADELPHIA --  Joel Embiid was bleeped on TV when Ben Simmons slapped him on the chest during another victorious postgame interview.\n\nThe red band version of Simmons' highlight reel looked at times almost obscene to Atlanta: He switched from his left to right hand mid-air to score a bucket. Simmons let the ball roll high of his right fingertips for another uncontested score.\n\nAnd the exclamation point, a thunderous slam in the final minute that had fans standing and chanting \"Trust the Process!\"\n\nSimmons had 19 points, 13 rebounds and nine assists, and Embiid had 21 points and 12 rebounds to lead the Philadelphia 76ers to their third straight win, 119-109 over the Atlanta Hawks on Wednesday night.\n\n\"Yeah, I've gotta dunk more,\" Simmons said. \"I don't know. I just get out there and I'm like, uhh, these guys are pretty big. Once I start dunking it ...\"\n\nHis thought trailed off but the Hawks -- and the rest of the NBA -- got the message. Simmons is the real deal.\n\nSimmons, the No. 1 overall pick in the 2016 draft, has lived up to his top billing in his rookie year. Simmons has scored in double figures in every game and flirted with his second triple-double.\n\nSimmons keeps saying he can play better -- but the 21-year-old guard has already joined Oscar Robertson as the only players in NBA history with 100 points, 50 rebounds and 40 assists in his first six games.\n\nJust how much more is he capable of the rest of the way?\n\n\"There's a lot more. Way more,\" he said. \"I think in a few years, it's going to be fun.\"\n\nRobert Covington scored 22 points to help the Sixers (4-4) reach .500 for the first time in four years. The Sixers' rebuild more commonly known as \"The Process,\" isn't a success yet. But it's November and they don't have a losing record.\n\nThe Sixers were fired up coming off wins on the road at Dallas and Houston and hit their first six 3s of the game. They led 25-8 and had everything going right in their first win at home this season.\n\nIn coach Brett Brown's five seasons, the Sixers had not been at .500 since they were 5-5 on Nov. 15, 2013. They started that season 3-0 and lost the opener -- and many more after that -- in each successive season.\n\nDennis Schroder scored 25 points and Taurean Prince had 17 for the woeful Hawks.\n\n\"We've got to find a way to eliminate the slow start,\" coach Mike Budenholzer said.\n\nTIP-INS\n\nHawks: G Malcolm Delaney left with a sprained right ankle. He scored eight points. ... The Hawks opened the fourth 0 for 11 with four turnovers.\n\n76ers: Dario Saric was in the starting lineup for the third straight game and JJ Redick started after he missed the last two games with tightness in his back. ... The Sixers had 12 assists on 14 baskets in the first quarter.\n\nOKAFOR OUT\n\nJahlil Okafor, the No. 3 pick of the 2015 draft, wants out after the Sixers declined to pick up his fourth-year contract option for next season. Buried on the bench, Okafor said he didn't want the Sixers to pick up his option and is ready for a fresh start. His request to team president Bryan Colangelo that the Sixers buy out the final year of the contract was declined.\n\n\"I'm just in a position to where, how can I get on the court,\" he said. \"That's not happening here and I want to play. Bryan knows that, I've talked with him about it. And now it's tough because my option didn't get picked up. Teams are not really looking to give up anything when somebody can walk out the door at the end of the season.\"\n\nOkafor was selected by former team president Sam Hinkie as a sort of insurance policy in case Embiid could never recover from injuries that cost him the first two seasons of his career. With Embiid sidelined, Okafor led the Sixers in scoring as a rookie with 17.5 points. But injuries limited to him to 50 games last year and he was dropped from the rotation this season. Okafor is healthy and has played just one game this season.\n\nThe 21-year-old Okafor, out of Duke, is frustrated but said he will remain professional about the situation.\n\n\"This is my life. This is my career. I'm not getting the opportunity here, which is fine,\" he said. \"The team looks great. I'm not a part of that. I want the team to do great things, but at the same time, I want to play.\"\n\nOkafor would have been owed $6.3 million in 2018-19. Okafor has avoided trouble since his rookie season was marred by a series of incidents that included a two-game suspension for his role in a Boston street fight.\n\nOkafor hoped a contract buyout would let him latch on with a team and play this season.\n\n\"Bryan didn't think that would be a good idea because he said he'd be giving me away to a team for free,\" he said. \"But that's pretty much where we stand right now.\"\n\nBrown said Okafor wasn't in the rotation for defensive reasons and out of deference to veteran backup Amir Johnson.\n\nUP NEXT\n\nHawks: Host Houston on Friday.\n\n76ers: Host Indiana on Friday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993785.932116
}