{
  "game_id": "0022300433",
  "espn_id": "401585061",
  "date": "Dec 29, 2023",
  "matchup": "MIL @ CLE",
  "headline": "Giannis Antetokounmpo scores 34, leads Bucks to a 119-111 win over the Cavaliers",
  "body": "CLEVELAND -- — Giannis Antetokounmpo had 34 points and 16 rebounds, Damian Lillard scored 24 of his 31 points in the second half, and the Milwaukee Bucks beat the Cleveland Cavaliers 119-111 on Friday night.\n\n\r\n              Antetokounmpo and Lillard each scored 14 points in the pivotal third quarter when Milwaukee outscored Cleveland 40-21 to erase a 15-point deficit and take the lead for good. The Bucks have the third-best record in the NBA at 24-8.\n\n\r\n              “When you put the basketball in the hands of your two best players, you’re going to get good results,” Antetokounmpo said. “If you want to double-team Dame, then I’m going to be open to make a play or get the ball to my teammates.”\n\n\r\n              Donovan Mitchell had 34 points, six rebounds and nine assists for Cleveland after missing four games with an illness. Jarrett Allen scored a career-high 30 points on 15-of-17 shooting and had 12 rebounds and six assists.\n\n\r\n              Malik Beasley scored 15 points on five 3-pointers and Khris Middleton had 13 points and a season-high 11 assists for Milwaukee. Brook Lopez added nine points, 10 rebounds and six blocked shots.\n\n\r\n              “I thought we were able to break them down inside-out tonight,” said Lillard, who was 11 of 11 from the foul line, all in the second half. “Our team is growing and we’re establishing ourselves. I think it shows in this type of a game.”\n\n\r\n              Cleveland fell to 5-2 since learning that power forward Evan Mobley (left knee surgery) and point guard Darius Garland (jaw fracture) will be sidelined until February. Undrafted rookie Craig Porter Jr. scored 14 points, playing nine minutes in the fourth quarter. \n\n\r\n              The Cavaliers shot a season low 14% from 3-point range, missing 37 of 43 attempts. Caris LeVert and Georges Niang each went 0 of 6.\n\n\r\n              “It was a big point of emphasis to protect the 3-point line because they’ve been playing some really good ball,” Milwaukee coach Adrian Griffin said.\n\n\r\n              The Bucks, who went 3-1 on a four-game trip, will play just one home game during an eight-game run that ends Jan. 6 in Houston. Key offseason acquisition Lillard is averaging 26.3 points over the last six contests.\n\n\r\n              “Dame is also a guy who can singlehandedly take over a game,” Cavaliers coach J.B. Bickerstaff said. “You can’t stop Giannis and him, so you have to figure out how to balance your defense. It's a challenge.”\n\n\r\n              Allen made his first nine shots and scored 18 points in the opening half, helping Cleveland take a 59-53 lead into the break. Antetokounmpo had 14 points, six rebounds and five assists in 19 minutes.\n\n\r\n              “Man, he’s tough to guard,” Antetokounmpo said of Allen. “His stats have improved so much. When a big guy like that is making jump shots and shooting those hooks over you, there is nothing you can do really to stop him.”\n\n\r\n              Cleveland Browns owners Jimmy and Dee Haslam are co-owners of the Bucks.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Indiana on Monday night.\n\n\r\n              Cavaliers: Visit Toronto on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996141.2380219
}