{
  "game_id": "0022300804",
  "espn_id": "401585432",
  "date": "Feb 23, 2024",
  "matchup": "TOR @ ATL",
  "headline": "Immanuel Quickley hits 6 3-pointers, scores 24 points in Raptors' 123-121 victory over Hawks",
  "body": "ATLANTA -- — Immanuel Quickley hit six 3-pointers and scored 24 points to help the Toronto Raptors win for the second straight game since the All-Star break, 123-121 over the Atlanta Hawks on Friday night.\n\n\r\n              Scottie Barnes added 20 points and 10 assists for Toronto. Jacob Poeltl had 12 points, 13 rebounds and six assists.\n\n\r\n              Dejounte Murray led Atlanta with 24 points. De'Andre Hunter added 22 points.\n\n\r\n              With the Hawks down 121-118 with 18 seconds left, Murray stepped out of bounds on a dribble hand-off from Bogdan Bogdanovic, and the Raptors sealed it with Bruce Brown's breakaway dunk with 11 seconds to play.\n\n\r\n              “It is just two games, but what I really like about this group is they are together,” Raptors coach Darko Rajakovic said. “They are really enjoying being with each other and competing with each other.”\n\n\r\n              Hawks All-Star Trae Young, who averaged 34.3 points in the three previous games against the Raptors this season, was held to 11 points on 4-for-13 shooting. He had seven assists.\n\n\r\n              “Overall, we did a really good job on Trae Young, not allowing him to score and to get to his positions,” Rajakovic said.\n\n\r\n              The Hawks stayed in the game by enjoying a 54-47 rebound advantage and a 24-8 free throw advantage, but the Raptors hit three more three-pointers and shot 49% from the floor vs. 43% for the Hawks.\n\n\r\n              Hawks coach Quin Snyder was ejected with 4:25 remaining in the second quarter for storming on the court after Young appeared to injure his right thigh fighting through a screen set by Poeltl. Young hopped on one leg and went to the ground for a minute, but was able to stay in the game. In addition to Snyder's double-technical, Young and Hunter also received first-half technical fouls.\n\n\r\n              “I was worried about Trae's knee,” Snyder said. “I probably deserved the technical. ... My reaction was an emotional one.”\n\n\r\n              The Hawks got off to a frigid start in their first game since the All-Star break, missing 13 straight shots after taking a 2-0 lead. The Raptors led 15-2 before Murray ended the drought with a layup. The Hawks shot 30% from the floor in the first period — going 1 for 9 from 3-point range and also missing five free throws.\n\n\r\n              Raptors guard R.J. Barrett sat out the second night of back-to-back games for the Raptors as he recovers from a left knee injury.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Indiana on Monday night.\n\n\r\n              Hawks: Host Orlando on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996192.8762581
}