{
  "game_id": "0021900320",
  "espn_id": "401160962",
  "date": "Dec 06, 2019",
  "matchup": "CHA vs. BKN",
  "headline": "Harris, Jordan lead Nets past Hornets, 111-104",
  "body": "CHARLOTTE, N.C. --  Seven months ago, Brooklyn Nets sharpshooter Joe Harris won the NBA All-Star Weekend 3-point contest at the Spectrum Center.\n\nOn Friday night, Harris was at it again by scoring 22 points and hitting six 3-pointers as the Nets continued their recent strong play in road games with a 111-104 victory over the Charlotte Hornets.\n\nThe Nets (12-10) won for the fifth time in their last six road games, all while playing without injured point guard Kyrie Irving.\n\nDeAndre Jordan had 16 points and 13 rebounds, Taurean Prince also scored 16 points, while Jarrett Allen had 14 points and 10 rebounds. Spencer Dinwiddie finished with 12 assists.\n\n\"Yeah, you know it's a little bit different set up than the 3-point contest but tonight the ball was moving early. A lot of guys were knocking down shots and shooting is kind of one of the things where it's contagious,\" said Harris, whose team hit 15 of 38 3-pointers overall. \"You know, once guys start seeing it go down, everybody else starts to feel that and we had a lot of confidence early shooting from 3.\"\n\nCharlotte controlled much of the opening half, twice building seven-point leads before taking a 57-55 lead into the break.\n\nIn the third quarter, the Nets built a 75-66 lead with 4:41 left. Brooklyn took its first double-figure lead at 95-84 after Theo Pinson's three-point play with 7:36 to play before leading by as many as 14 points.\n\nBrooklyn coach Kenny Atkinson liked his team's offensive efficiency but felt his team's defense at the start of the fourth quarter led by his backups sealed the victory.\n\n\"Just that second unit I thought was fantastic,\" said Atkinson, whose team limited Charlotte to 20 fourth-quarter points. It \"started with Shump (Iman Shumpert) and then David Nwaba, I thought it was really good and then DeAndre Jordan was incredible tonight. They really picked it up and got our energy going. It really turned the game. Again, I thought that Shump was key there.\"\n\nNow winners of seven of their last nine overall, Atkinson thought that recent strong play helped the Nets' overcome a sluggish first half.\n\n\"Their chemistry is really good right now,\" Atkinson said of his team. \"They are talking about coverages, and encouraging each other. Even in the first half when it didn't go so well they were together. Sometimes coaches will get negative. (But) they are pushing each other and their chemistry is great right now.\"\n\nDevonte' Graham' scored 29 points for the Hornets. Graham, Charlotte's leading scorer at 18.7 points per game, bruised his left shoulder a minute into Friday's game but returned to action in the second quarter and eventually made 8 of 19 shots, going 6 of 11 on 3-pointers. Terry Rozier III added 24 points, Cody Zeller 17 and P.J. Washington 14 for Charlotte.\n\n\"It was bothering me a little bit at first,\" Graham said of his injured shoulder. \"But I just had to stop thinking about it and just go out and hoop.\"\n\nCharlotte coach James Borrego was disappointed in his team's 19 turnovers that led to 32 Nets' points. The Hornets had committed 13 or less turnovers in five of its last six games.\n\nThe \"poor fourth quarter start,\" Borrego said. \"That did us in. (We) couldn't score and then we were turning it over. We were handing them points off our offense. So it was a combination. We went dry, turned it over and ... lots of the fourth quarter was not great. Then the biggest line was 19 turnovers for 32 points.\"\n\nTIP-INS:\n\nNets: Irving missed his 11th straight game witb a right shoulder impingement. Brooklyn coach Kenny Atkinson said before the game there was no injury status update for Irving.\n\nHornets: Entering Friday's games, Charlotte's guard duo of Rozier and Graham had made a combined 144 3-pointers. That ranked them tied for second in the NBA behind Houston's duo of James Harden and Ben McLemore (148).\n\nFANS OF FIZDALE\n\nBoth Borrego and Atkinson were surprised and disappointed to hear about David Fizdale being fired as New York Knicks coach earlier Friday.\n\nBorrego has long roots with Fizdale, with whom he worked on his first coaching job in 2001 at the University of San Diego when both were assistant coaches.\n\n\"It's a tough day,\" Borrego said. \"Fiz is a friend and someone I have great respect for. It's just a tough day.\"\n\nSaid Atkinson: \"It doesn't make you feel good as a colleague and a friend. I know it's part of the business but he's a good coach.\"\n\nUP NEXT\n\nNets: Host Denver on Sunday.\n\nHornets: Host Atlanta on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764996091.022979
}