{
  "game_id": "401810033",
  "espn_id": "401810033",
  "date": "Nov 05, 2025",
  "matchup": "DEN vs MIA",
  "headline": "Nikola Jokic's triple-double leads Nuggets to 122-112 win over Heat",
  "body": "DENVER -- — Nikola Jokic had 33 points, 16 assists and 15 rebounds for his fifth triple-double of the season and the Denver Nuggets continued their mastery of Miami with a 122-112 win over the Heat on Wednesday night. \n\n\r\n              It was Denver's 11th straight regular-season win over the Heat.\n\n\r\n              Jokic was 12 of 18 from the floor. He finished his triple-double by grabbing an offensive rebound with 6:36 remaining in the third quarter.\n\n\r\n              Aaron Gordon added 24 points for the Nuggets, who improved to 4-0 at home this season. \n\n\r\n              The Nuggets led by 17 points in the fourth quarter before the Heat cut the deficit to eight with 43 seconds left. Jamal Murray sealed it with a pair of free throws.\n\n\r\n              Miami hasn't won a game in the Mile High City during the regular season since Nov. 30, 2016. They did beat the Nuggets in Game 2 of the 2023 NBA Finals. Denver won the series in five games for its only title.\n\n\r\n              Norman Powell had 23 points for Miami, which finished a four-game trip with a 1/3 mark. Bam Adebayo didn't play after the first quarter due to a left foot injury. The Heat will know more about his status Thursday. Miami was outrebounded by a 61-38 margin.\n\n\r\n              Powell started the game with a 3-pointer, marking the first time the Nuggets have trailed at home all season. They led wire-to-wire in their opening three games at Ball Arena.\n\n\r\n              Heat coach Erik Spoelstra said before the game that going against his Nuggets counterpart David Adelman was a “surreal” experience given his close relationship with the Adelman family. Spoelstra considers David Adelman’s father, Rick, a role model. \n\n\r\n              Up next\r\n              Heat: Start a four-game homestand Friday against Charlotte.\n\n\r\n              Nuggets: Host Golden State on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042569.119673
}