{
  "game_id": "0022400716",
  "espn_id": "401705282",
  "date": "Feb 04, 2025",
  "matchup": "IND @ POR",
  "headline": "Simons scores 22 and Portland downs Indiana 112-89 for 5th straight win",
  "body": "PORTLAND, Ore. -- — Anfernee Simons had 22 points and the Portland Trail Blazers won their fifth straight game with a 112-89 victory over the Indiana Pacers on Tuesday night. \n\n\r\n              Jerami Grant added 20 points for the Blazers, who have won nine of their last 10.\n\n\r\n              Andrew Nembhard scored 17 points for the Pacers in the loss, which snapped a four-game winning streak. \n\n\r\n              T.J. McConnell's basket got the Pacers within 80-74 in the fourth quarter but Scoot Henderson hit a 3-pointer from distance that gave the Blazers an 89-76 lead with 6:10 left. \n\n\r\n              The Pacers have won 12 of 15 since the start of the year and rank among the top five in the league for offense and defense over that span. \n\n\r\n              Myles Turner played for the Pacers after missing Monday's win at the Jazz with a right peroneal strain. He finished with nine points. \n\n\r\n              Portland led 27-18 after the first quarter. The Pacers closed the gap, getting within 38-34 late in the first half, but Portland led 45-38 at the break. \n\n\r\n              Turner hit a 3-pointer that got Indiana within 53-49. Portland withstood the challenge and went ahead 60-52 after Shaedon Sharpe's emphatic dunk. \n\n\r\n              There was a dustup between Nembhard and Deandre Ayton with 4:27 left in the third quarter that resulted in offsetting technical fouls. \n\n\r\n              Takeaways\r\n              Pacers: Andrew Nembhard was named the Eastern Conference Defensive Player of the Month. ... Pascal Siakam reached 4,000 career rebounds during the game. \n\n\r\n              Trail Blazers: Portland was playing the second of a back-to-back after beating the Phoenix Suns 121-119.\n\n\r\n              Key Moment\r\n              Turner had a a chance to tie the game in the third quarter but missed the first of a pair of free throws, and Robert Williams III dunked on the other end for Portland. \n\n\r\n              Key Stat\r\n              Henderson and Sharpe each had 17 points off the bench. \n\n\r\n              Up Next\r\n              Pacers: Visit the Clippers on Thursday.\n\n\r\n              Blazers: Host Sacramento on Thursday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998133.891404
}