{
  "game_id": "0022400420",
  "espn_id": "401704986",
  "date": "Dec 27, 2024",
  "matchup": "IND @ BOS",
  "headline": "Jaylen Brown scores season-high 44 points, Celtics cruise past Pacers 142-105",
  "body": "BOSTON -- — Jaylen Brown scored a season-high 44 points, including six 3-pointers, and the Boston Celtics snapped a two-game skid with a 142-105 rout over the Indiana Pacers on Friday night.\n\n\r\n              Jayson Tatum added 22 points and 13 rebounds for Boston, which connected on 23 3s and never trailed. Brown also had four steals to join Larry Bird (five times) and Antoine Walker as the only Celtics with at least 44 points and four steals in a game.\n\n\r\n              Payton Pritchard finished with 18 points, 10 assists and eight rebounds.\n\n\r\n              The Pacers have lost two straight since posting a season-best five-game win streak. \n\n\r\n              Tyrese Haliburton had 19 points and nine assists, Bennedict Mathurin finished with 18 points and Pascal Siakam added 14 points and nine rebounds.\n\n\r\n              Takeaways\r\n              Pacers: It wasn’t surprising that Indiana struggled to find its footing with Obi Toppin sitting with a sprained left ankle and Andrew Nembhard also out managing tendinitis in his left knee.\n\n\r\n              Celtics: Avoided their first three-game losing streak of the season with a dominant effort on both ends of the floor. Boston had nine steals and limited Indiana to 28% from beyond the arc. The Celtics did it without starters Kristaps Porzingis (sprained left ankle) and Jrue Holiday, who missed his second straight game with a shoulder injury. \n\n\r\n              Key moment\r\n              Al Horford connected on back-to-back 3-pointers to punctuate a 13-0 run by the Celtics late in the second quarter that gave them a 67-35 lead. Boston increased its cushion to as many as 38 in the fourth quarter.\n\n\r\n              Key stat\r\n              This was Brown’s 11th career game with 40 or more points.\n\n\r\n              Up next\r\n              Boston and Indiana meet again on Sunday in their final matchup of the season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998147.284964
}