{
  "game_id": "0021500670",
  "espn_id": "400828557",
  "date": "Jan 25, 2016",
  "matchup": "MEM vs. ORL",
  "headline": "Green scores season-high 30 as Grizzlies beat Magic 108-102",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies tightened up on defense in overtime to finally dispatch the pesky Orlando Magic.\n\nOffensively, Memphis relied on Jeff Green's season-high 30 points, but it was defense that provided the final emphasis for a 108-102 win over the Magic on Monday night.\n\n\"We got stops,\" Green said.\n\n\"Defensively, I thought we did a better job of helping,\" said Memphis center Marc Gasol. \"Not just one time, but two, three times and finishing possessions.\"\n\nTwo free throws by Mike Conley with 15.9 seconds left in the extra frame provided the final margin. Memphis could have put the game away earlier, but converted only four of its first eight free throws in the extra session.\n\nDefensively, the Grizzlies caused one Magic turnover, blocked three shots and held Orlando to 1 of 10 shooting in the extra period.\n\n\"It's tough when we caused this,\" Magic coach Scott Skiles said. \"We did this to ourselves ... by not being sharp when we needed.\"\n\nZach Randolph finished with 18 points and 13 rebounds for Memphis. Gasol had 17 points, Courtney Lee added 16 and Conley had 12 points and nine assists.\n\nTobias Harris, Nikola Vucevic and Evan Fournier had 16 apiece for the Magic, who lost their sixth straight and 10th in 11.\n\nA late 9-0 run by Orlando in regulation took the Magic lead to 100-96, but Green scored on a dunk, then stole the ball on the next Orlando possession and converted an 11-footer with 1.3 seconds left for a 100-all tie at the end of regulation.\n\n\"Most games I want that shot,\" Conley said. \"I want to be able to make a play. The play tonight was to get the ball to Jeff.\"\n\nIn overtime, Conley scored the first three points, but an inside basket by Fournier cut the lead to 103-102. It would be the Magic's only points in overtime.\n\n\"We had it -- up four with 17 seconds left -- it should be done,\" Fournier said. \"But mistakes, not matching up, we blew that up.\"\n\nElfrid Payton had 14 for the Magic and Aaron Gordon finished with 10. Payton and Vucevic had five turnovers each, part of the Magic committing 19 miscues to 10 for Memphis.\n\n\"There were a lot of things that cost us the game,\" Harris said, referring to mental mistakes in the closing seconds. \"It's things like that that add up.\"\n\nTIP-INS:\n\nMagic: Gordon started his second game of the season at forward. ... Orlando's 65 first-half points, matched the most by a Memphis opponent this season for the first half. . Orlando has lost nine straight to the Grizzlies.\n\nGrizzlies: Gasol (left knee contusion) and Allen (sore left knee/hamstring), who were listed as probable in pregame, both played. ... The Grizzlies 64 first-half points matched their most points for a half this season. ... Randolph recorded his 11th double-double of the season. .Green's 30 points came in a reserve role. Only four other players in Grizzlies history have scored 30 coming off the bench.\n\nOVERTIME, NOT A GOOD TIME: Orlando is now 1-5 in overtime games this season, and Monday's loss marked the second straight game the Magic has lost in overtime. They dropped an overtime game to Charlotte 120-116 Friday. \"It's very disappointing for us,\" Harris said. \"Two games we felt we had the game in our hands and let it slip away.\"\n\nGOING GREEN: Green was 11 of 18 from the field. His previous high for scoring this season was 26 against Miami in December. \"At one point on the stat sheet, he had played 17-plus minutes and had 23 points,\" Skiles said. \"We just couldn't (find) anybody to match up with him.\"\n\nUP NEXT\n\nMagic: visit Milwaukee on Tuesday.\n\nGrizzlies: host Milwaukee on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994444.25849
}