{
  "game_id": "0022400897",
  "espn_id": "401705463",
  "date": "Mar 05, 2025",
  "matchup": "DAL @ MIL",
  "headline": "Antetokounmpo joins 20,000-point club as Bucks roll past short-handed Mavericks 137-107",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 32 points to bring his career total over 20,000, Damian Lillard added 34 points and Kevin Porter Jr. had a triple-double as the surging Milwaukee Bucks trounced the short-handed Dallas Mavericks 137-107 on Wednesday night.\n\n\r\n              The 30-year-old Antetokounmpo has scored 20,010 career points, becoming the 52nd player to reach 20,000. The only players to get to the 20,000-point mark at a younger age were LeBron James, Kevin Durant, Kobe Bryant, Wilt Chamberlain and Michael Jordan.\n\n\r\n              Antetokounmpo, who played less than 25 minutes, also had 15 rebounds as the Bucks won for the eighth time in their last nine games.\n\n\r\n              Porter had 10 points and 11 rebounds while playing 26 minutes off the bench, and he matched a career high with 14 assists. His previous triple-doubles came in March 2022 and March 2023 with the Houston Rockets.\n\n\r\n              Klay Thompson scored 28 for the Mavericks, who had only eight available players in their first game since Kyrie Irving tore the anterior cruciate ligament in his left knee on Monday. \n\n\r\n              Takeaways\r\n              Mavericks: Dallas simply didn't have enough players suited up to have much of a chance in this one.\n\n\r\n              Bucks: Milwaukee was playing for a second straight night after winning 127-101 at Atlanta on Tuesday, but the one-sided nature of this win enabled Antetokounmpo and Lillard to get some needed rest. Both sat out the entire fourth quarter. Milwaukee has gone 7-1 since Bobby Portis began serving a 25-game suspension. Before this suspension, the Bucks had been 2-5 in games Portis had missed. \n\n\r\n              Key moment\r\n              Dallas led 19-18 just over seven minutes into the game before the Bucks went on an 18-3 run. Lillard scored eight points during that stretch and capped the spurt by hitting a jumper with 1:13 left in the opening period.\n\n\r\n              Key stat\r\n              The Bucks posted their highest point total and most lopsided victory of the season.\n\n\r\n              Up next\r\n              The Mavericks host the Memphis Grizzlies on Friday. The Bucks host the Orlando Magic on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997149.3688939
}