{
  "game_id": "0021500606",
  "espn_id": "400828493",
  "date": "Jan 16, 2016",
  "matchup": "POR @ PHI",
  "headline": "Okafor help 76ers rout Trail Blazers 114-89",
  "body": "PHILADELPHIA --  On Thursday night, the Philadelphia 76ers let a 24-point lead slip away in an especially difficult overtime loss to the Chicago Bulls.\n\nTwo days later, they made sure that wouldn't happen again.\n\nJahlil Okafor had 25 points and 10 rebounds and the 76ers snapped a four-game losing streak with a 114-89 victory over the Portland Trail Blazers on Saturday night.\n\nRichaun Holmes added 17 points, and Ish Smith and Robert Covington scored 16 apiece for the Sixers. They improved to 5-37 with their most lopsided win of the season, erasing many of the lingering bad feelings that come from blowing a game they thought they had in the bag.\n\n\"We felt like we throw one away the other night,\" 76ers coach Brett Brown said. \"We think that we're playing good basketball lately and I think the games confirm that.\"\n\nDamian Lillard and Meyers Leonard each scored 14 points for the Blazers, C.J. McCollum had 13, and Mason Plumlee 12. The dropped to 18-25 with their first loss in four games.\n\nPortland, in the midst of a three-game East Coast swing, looked flat from the opening tip.\n\nLillard and McCollum, the NBA's highest-scoring guard combo, shot 10 for 36 while combining to score nearly 20 points below their season average.\n\n\"We never got into any rhythm to the game,\" Blazers coach Terry Stotts said. \"Philly maintained their pressure -- full court, half court -- and the shots we did get we didn't make.\"\n\nOkafor torched the Blazers for 10 points in the first four minutes and 17 in the first quarter -- as many as the entire Portland team. With a mixture of post moves and jumpers, the rookie center only missed one of his nine shot attempts in the opening quarter to help Philly take a 29-17 lead.\n\nLed by Okafor's 12-for-16 night, the Sixers shot 55.3 percent from the field. In his first start since Jan. 2, Isaiah Canaan added 14 points for Philly.\n\n\"A few days ago when we played the Bulls, I think we learned our lesson -- that the game wouldn't be over,\" Okafor said. \"We were able to go out there, compete and get stops, and continue to run our offense. ... It was a really fun game to be a part of.\"\n\nTIP-INS\n\nTrail Blazers: Portland lost to Philadelphia for the first time in four matchups. ... The Blazers shot just 2 for 14 from 3-point range in the first half and 5 for 29 for the game. ... Portland was denied its first four-game win streak since last March.\n\n76ers: Starters Nik Stauskas (shoulder) and Jeramie Grant (calft) missed the game. Brown said he hopes both will be back for Philly's next game. ...  Elton Brand was inactive. He's yet to make his season debut after the Sixers signed him on Jan. 4. ... The Sixers trotted out their 22nd different starting lineup in 42 games this season. ... T.J. McConnell had seven assists in 15 minutes off the bench. ... The Sixers matched a team season-high with the 114 points.\n\nNO SURPRISES\n\nDespite Portland coming into the game on a three-game winning streak and vying for the eighth and final playoff spot in the West, Stotts claimed he wasn't surprised that his team got hammered by one with only five wins.\n\n\"Nothing surprises me in this league,\" Stotts said. \"We're not even a .500 team, so losing on the road, that's not a surprise. I was disappointed in how we played. I was disappointed we weren't able to build on the momentum that we have. But we've got to learn and understand that any team can beat you on any night.\"\n\nUP NEXT\n\nTrail Blazers: At Washington on Monday.\n\n76ers: At New York on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994516.3465931
}