{
  "game_id": "0022000448",
  "espn_id": "401307841",
  "date": "May 11, 2021",
  "matchup": "CHA vs. DEN",
  "headline": "Jokic, Nuggets hold off Hornets 117-112 to snap 2-game slide",
  "body": "CHARLOTTE, N.C. -- — The Denver Nuggets will have home-court advantage for at least one playoff series. \n\n\r\n                    The Charlotte Hornets have a chance to play their way into the postseason.\n\n\r\n                    Michael Porter Jr. and Nikola Jokic each scored 30 points, and the Nuggets held off the Hornets 117-112 on Tuesday night to snap a two-game slide and clinch no worse than fourth place in the Western Conference.\n\n\r\n                    The win allows the Nuggets the option to rest players for the final three regular-season road games, but Porter has mixed feelings on that.\n\n\r\n                    “Well, you want to stay in rhythm, too,” Porter said. “And we have like a week off after the season to rest so I don't see a big need for it. It's up to (the team). If they want to avoid some crazy injury before the playoffs, then that's cool. But I don't feel a need body-wise.” \n\n\r\n                    Despite the loss, the Hornets clinched a spot in the play-in tournament by virtue of the Chicago Bulls’ loss to the Brooklyn Nets. That failed to ease the sting of a tough loss, according to Graham.\n\n\r\n                    “We have to figure out ways to close games,” Graham said. “... We don’t want to put our destiny in nobody else’s hands. We want to control our future. So I don’t like to think like that.”\n\n\r\n                    Jokic had 11 rebounds and six assists. Porter knocked down six 3-pointers as the Nuggets withstood a furious late rally led by Devonte Graham, who scored 19 of his 31 points in the fourth quarter, including five 3-pointers.\n\n\r\n                    Jokic did most of his damage at the foul line, where he made 16 of 17 shots.\n\n\r\n                    Terry Rozier, who had 43 points in Sunday's loss to the New Orleans Pelicans, added 21 points for the Hornets.\n\n\r\n                    The Nuggets jumped all over the Hornets early, building a 33-13 lead behind Nokic and Porter, who combined for 24 points in the game's first nine minutes. But the Hornets would battle back to cut the lead to three at halftime with a lift off the bench from Graham, who returned after missing the last four games with knee soreness.\n\n\r\n                    Denver stretched its lead to 12 in the fourth quarter before Graham cut the lead to 107-106 with less than 2 minutes to play with a long 3. But Denver got a layup from JaMychal Green and a 3-pointer from Facundo Campazzo to pull away.\n\n\r\n                    “That’s the exciting thing about this team -- we have a lot of young stars and the future is bright,” Nuggets coach Michael Malone said.\n\n\r\n                    Graham finished 7 of 14 from 3-point range, making a couple of fadeaways from long distance.\n\n\r\n                    “Well, he looked fresh; he looked like Devonte,\" Hornets coach James Borrego said. “So, we’re going to need that moving forward. I thought he gave us an extreme lift. We probably wouldn’t have been in position without him.”\n\n\r\n                    Borrego said the Hornets will likely play more three-guard lineups until Miles Bridges is able to return from being in the league's health and safety protocols.\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Aaron Gordon had 17 points. ... Were outrebounded by the smaller Hornets 49-38. \n\n\r\n                    Hornets: Gordon Hayward (right foot sprain) and Cody Martin (left ankle sprain) remained out. .. P.J. Washington had another quiet double-double with 13 points and 11 rebounds.\n\n\r\n                    BORREGO BOUNCED\n\n\r\n                    Borrego was ejected for the first time in his NBA coaching career after disputing a call. It happened when LaMelo Ball's pass hit teammate Jalen McDaniels in the face and then sailed out of bounds. Officials initially ruled the ball went off a Nuggets player, but then quickly changed the call.\n\n\r\n                    Borrego walked on the court and said something to the official and was assessed two technical fouls and then tossed from the game.\n\n\r\n                    “I’m not going to get into it,\" Borrego said. \"I think everybody knows I’m not getting into that right now. We’re all competitors, we’re all trying to win a game. We’re all battling our tail off right now.”\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: At Timberwolves on Thursday night.\n\n\r\n                    Hornets: Host final regular-season game Thursday night against the Clippers.",
  "source": "espn_api",
  "crawled_at": 1764997001.7443562
}