{
  "game_id": "0022000867",
  "espn_id": "401307664",
  "date": "Apr 18, 2021",
  "matchup": "LAC vs. MIN",
  "headline": "Leonard returns, Clippers rout Timberwolves 124-105",
  "body": "LOS ANGELES -- — Paul George led five starters in double figures with 23 points and the Los Angeles Clippers routed the Minnesota Timberwolves 124-105 on Sunday night for their eighth win in nine games.\n\n\r\n                    Kawhi Leonard had 15 points, 11 rebounds and eight assists in his return from a four-game absence because of a sore right foot. Fans attending a Clippers game at Staples Center for the first time in over a year saw their team hit a season-high 21 3-pointers.\n\n\r\n                    Anthony Edwards scored 23 points to lead the Wolves, who dropped their sixth in a row on the road. Karl-Anthony Towns added 16 points on 5-of-15 shooting. He missed five of six 3s.\n\n\r\n                    “Came in cool, acting like we were supposed to get two in a row. Wasn’t the right way to approach the game,” Towns said. “We don’t have that many wins, so there’s no reason to have that kind of cockiness.”\n\n\r\n                    The Clippers pulled away in the second quarter, scoring 43 points and hitting 10 3-pointers. \n\n\r\n                    “When everybody is touching it and everybody is getting shots and we’re attacking the basket, we’re a tough team to beat,” Los Angeles coach Tyronn Lue said. “Since the All-Star break, I really like where we’re at.”\n\n\r\n                    The Clippers stretched a three-point lead to 23 on Marcus Morris' 3 before Leonard's second 3 of the game sent them into halftime leading 72-53. Morris finished with 19 points.\n\n\r\n                    “Marcus was hot,” teammate Reggie Jackson said. “When he gets going like that I think the basket opens up for everybody.”\n\n\r\n                    Los Angeles followed with 32 points in the third when its lead expanded to 38 points — largest of the game — on a pair of free throws by Terance Mann. The Clippers held the Wolves to 16 points in the quarter, when Towns picked up his fourth foul after scoring his lone basket.\n\n\r\n                    “I've got to start off by asking myself where could I have done better?” Towns said. “Just use my experience and talent for a better way for this team. I'm not even going into the part about looking at teammates. I always want to start with the man in the mirror first.”\n\n\r\n                    The Wolves won the fourth quarter, outscoring the Clippers' reserves, 36-20, but it never made a dent. Minnesota had seven 3s to LA's two.\n\n\r\n                    “I don’t think we should go into any game with the mindset of outscoring anybody,” Towns said. “We got to have the mindset of making it difficult.” \n\n\r\n                    The Clippers' 21st 3-pointer was made by Malik Fitts, who scored his first NBA basket since signing a 10-day contract.\n\n\r\n                    “I love it when new blood comes in and gets some buckets,” Jackson said. “We were happy to see him make his first 3.”\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Towns surpassed 9,000 points in his 394th career game. ... Fell to 5-24 on the road. \n\n\r\n                    Clippers: Had at least 20 3s for the third time this season and seventh in franchise history. ... Tied their season high for 3s in a half with 14 in the first. ... Topped 100 points for the ninth straight game. ... Swept the regular-season series, winning by 23, 7 and 19 points. \n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: Visit Sacramento on Tuesday in the first of a back-to-back with the Kings.\n\n\r\n                    Clippers: Visit Portland on Tuesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997724.292434
}