{
  "game_id": "0021900154",
  "espn_id": "401160796",
  "date": "Nov 13, 2019",
  "matchup": "MEM @ CHA",
  "headline": "Ja Morant lifts Grizzlies past Hornets with late layup",
  "body": "CHARLOTTE, N.C. --  Ja Morant’s winning layup left the rookie flexing and shouting at the crowd and sent father Tee racing down the sideline while pumping his knees high in the air, filled with excitement over his son’s big moment.\n\nYep, Morant’s homecoming game went about as well as he could have hoped.\n\nWith his parents sitting courtside and nearly 100 friends in the stands, Morant scored on a driving left-handed layup with 0.7 seconds left to give the Memphis Grizzlies 119-117 victory over the Charlotte Hornets on Wednesday night. The South Carolina native had his first double-double with 23 points and 11 assists to help the Grizzlies win consecutive games for the first time this season.\n\n“It definitely felt good,” Morant said. “Coach called the play, they switched and I just attacked.”\n\nMorant got a chuckle at his father’s reaction, but wasn’t surprised.\n\n“That just shows how much he loves the game and how excited he was,” Morant said. “I looked and he was already at half court. I was like, ‘Bro, your seat is down on the baseline.’ But that’s just him. He’s always hype.”\n\nThe Hornets battled back from 10 down in the fourth quarter to tie it on a 3-pointer by Devonte Graham from the top of the key with 22.7 seconds left. But after a timeout, Morant got a screen near the top of the key and drove left against Cody Martin and somehow got the layup to fall between three Hornets, including 7-foot center Cody Zeller.\n\n“I was just trying to contest it,” Zeller said. “He made a tough shot.”\n\nMorant wouldn’t repeat what he said to the crowd.\n\n“I’d rather not say,” he said with a smile.\n\nGrizzlies coach Taylor Jenkins said the goal was to have Morant make a play coming out of the timeout.\n\n“Try to put Ja in a position where he could attack one-on-one to score, maybe play make for someone else and then have Brandon Clarke go crash the offensive boards,” Jenkins said.\n\nJonas Valanciunas was one of the beneficiaries of Morant’s passes, finishing with 18 points and 13 rebounds. Marko Guduric had 17 points.\n\nTerry Rozier tied a career high with 33 points on seven 3-points for the Hornets, who have lost four straight games. Graham, who entered the game leading the team in points and assists, had 19 points in his first start of the season.\n\nThe Hornets led by 12 in the third quarter before the Grizzlies went on a 22-5 run led by Morant.\n\nTIP INS\n\nGrizzlies: Grayson Allen, who starred at Duke a couple of hours away, did not play because of left ankle soreness.\n\nHornets: Were outrebounded 45-35. ... Dwayne Bacon sat out with knee soreness. ... The Hornets have trailed by double digits in every game this season.\n\nMORANT VS. CONLEY\n\nMorant will face Mike Conley on Friday night, the player the Grizzlies traded away to make room for him. The rookie said the matchup is not personal.\n\n‘I’m looking forward to playing the Utah Jazz,” Conley said. “It’s a team game. I’m not singling nobody out. I’m just going to go out and do whatever I can with my teammates and come out with a win.”\n\nDON’T LET UP\n\nRozier said his goal is to cut down on his turnovers. He and Graham combined for 10 of Charlotte’s 22 turnovers.\n\n“We need to really worry about my turnovers and get better on the defensive end and control that,” Rozier said. “Ill be fine, me and coach communicate just about every day so we are going to get on the same page and we’re growing together and that’s what it’s about.”\n\nUP NEXT\n\nGrizzlies: Host Utah on Friday night.\n\nHornets: Host Detroit on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995759.311441
}