{
  "game_id": "0021700629",
  "espn_id": "400975375",
  "date": "Jan 13, 2018",
  "matchup": "OKC @ CHA",
  "headline": "Westbrook leads Thunder past Hornets, 101-91",
  "body": "CHARLOTTE, N.C. --  Russell Westbrook didn't think the Oklahoma City Thunder were aggressive enough in the last meeting with the Charlotte Hornets.\n\nThe NBA's reigning MVP made sure that didn't happen again Saturday.\n\n\"We hit first,\" Westbrook said.\n\nWestbrook had 25 points, 10 rebounds and seven assists, and the Thunder beat the Hornets 101-91 to snap a three-game losing streak.\n\nPaul George added 17 points, Steven Adams had 14 points and 11 rebounds, and the Thunder avenged a 116-103 loss to the Hornets earlier this season in Oklahoma City.\n\nThe Thunder trailed by three entering the fourth quarter, but their bench helped open a double-digit lead as Charlotte shot 5 of 21 from the field over the final 12 minutes. The Thunder attempted 97 shots as they dominated the offensive glass with 20 second-chance points.\n\nOklahoma City's length on defense bothered the Hornets all night, particularly late in the game.\n\nCharlotte scored just 32 points in the second half.\n\n\"We used our size and athleticism, to put pressure on them,\" Westbrook said.\n\nHornets All-Star point guard Kemba Walker had several shots blocked on drives to the basket and finished 5 of 17 from the field. He still led the Hornets with 19 points, while Dwight Howard added 11 points and 17 rebounds.\n\nCharlotte hoped to gain some momentum and get back in the fight in the Eastern Conference after having won three of its previous four games, but couldn't overcome its poor fourth quarter. The Hornets were outscored 28-15.\n\nIt was a needed win for the Thunder in their fifth game on the road in the last six. Oklahoma City will play four of its next five at home.\n\nWestbrook finished just 10 of 27 from the field but controlled the tempo of the game late and didn't allow the Hornets to get back into it once they fell behind by double digits.\n\nHornets associate head coach Stephen Silas said he felt that his team ran out of gas in the fourth quarter after playing a late game Friday night and then two hours earlier than normal on Saturday.\n\n\"We started the quarter pretty good but after the second group went in they seemed tired,\" Silas said. \"Our first group seemed tired, too. A back-to-back with a quick turnaround was a tough one.\"\n\nTIP-INS\n\nThunder: Jerami Grant finished with nine points on 3-of-3 shooting from the field. ... Carmelo Anthony struggled from the field, shooting 3 of 14 and finishing with seven points and 10 rebounds. ... Bench outscored Charlotte 35-27.\n\nHornets: Howard had three blocks and now has 1,971 for his career. He's the active leader in the category and in 19th place on the NBA's career list. ... Howard has 23 double-doubles this season. .. Were outscored 44-34 in the paint.\n\nFELTON'S CONTRIBUTION\n\nThe Thunder got a big lift from backup point guard Raymond Felton in the fourth quarter. He used the pick-and-roll effectively to get to the basket and create shots for others.\n\n\"He knows how to play pick-and-rolls, so he was able to go deep into the paint,\" said Hornets forward Marvin Williams. \"He was able to kick it out and make big shots for them. It took us a little while to kind of figure out what to do with him and once we did they kind of went away from it.\"\n\nFelton, who played at North Carolina, was thrilled to get a win.\n\n\"We were tired of dropping these L's and wanted to get a win tonight,\" Felton said. \"I especially wanted to get one here, back home. It was one of those things where we were just being aggressive, playing together. We got aggressive on defense, so it worked out for us.\"\n\nPLAYING BETTER\n\nDespite the loss, Hornets guard Nic Batum feels the team is starting to play better, particularly on defense.\n\n\"If we stick together as a team, like I have been preaching the last couple of weeks, we can be a good team,\" Batum said.\n\nBut the Hornets are 16-25 and might be starting to run out of time to make a playoff run.\n\nUP NEXT\n\nThunder: Host Sacramento on Monday night.\n\nHornets: Visit Detroit on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993109.9925818
}