{
  "game_id": "0022400599",
  "espn_id": "401705165",
  "date": "Jan 20, 2025",
  "matchup": "CHA vs. DAL",
  "headline": "Ball, Bridges each score 23 to lead Hornets over Mavs 110-105 for 3rd straight win",
  "body": "CHARLOTTE, N.C. -- — LaMelo Ball and Miles Bridges each scored 23 points and the Charlotte Hornets held on to beat the Dallas Mavericks 110-105 on Monday to extend their winning streak to a season-high three games.\n\n\r\n              Nick Smith Jr. added 19 points and Mark Williams overcame foul trouble to finish with 13 points and 13 rebounds for Charlotte (11-28).\n\n\r\n              Kyrie Irving had 33 points and Daniel Gafford added a career-high 31 points and 15 rebounds for the Mavericks (23-20), who’ve lost four of their last five games.\n\n\r\n              The Mavericks trailed entering the fourth quarter but Irving — who had 26 points after halftime — began the take over, knocking down two quick 3s while adding another three points on free throws after luring Josh Green into fouling him on a 3-point attempt.\n\n\r\n              But the Hornets would battle back to take the lead for good on Smith’s corner 3 with 4:16 left.\n\n\r\n              Ball, who had 20 points on five 3s in the first half, had a chance to put the game away with 13 seconds left but missed the tail end of a one-and-one. Klay Thompson tried to send the game into overtime, but missed a 3 from the right wing. Green added two free throws to seal the Charlotte win.\n\n\r\n              Takeaways\r\n              Mavericks: Still adjusting to life without Luka Doncic, who hasn’t played since Christmas due to a left calf strain, Dallas' depth has been tested. They had just 14 points off the bench.\n\n\r\n              Hornets: Williams picked up his fourth foul with 7:35 left in the second quarter, forcing the Hornets to lean heavily on Moussa Diabate.\n\n\r\n              Key moment\r\n              Trailing by two with 26 seconds left, Irving drove the lane and had an open Naji Marshall in the corner but a bad pass resulted in a turnover.\n\n\r\n              Key stat\r\n              The Hornets scored 23 points off 13 Dallas turnovers.\n\n\r\n              Up next\r\n              Both teams are in action Wednesday night with the Mavs hosting Minnesota and the Hornets visiting Memphis.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997446.458393
}