{
  "game_id": "0022201196",
  "espn_id": "401469351",
  "date": "Apr 05, 2023",
  "matchup": "LAC vs. LAL",
  "headline": "Powell and Leonard lead Clippers over Lakers, 125-118",
  "body": "LOS ANGELES -- — The battle of Los Angeles was no contest. The quest for the highest possible playoff seed is another story for the Clippers and Lakers.\n\n\r\n              Norman Powell scored 27 points, Kawhi Leonard added 25 in a game-high 43 minutes and the Clippers improved their playoff seeding chances with a 125-118 win over LeBron James and the Lakers on Wednesday night.\n\n\r\n              The Clippers’ 11th straight victory over their Crypto.com Arena hallmates pulled them into a tie with idle Golden State for fifth in the West at 42-38. The Clippers and Lakers came into their final meeting of the season tied in the standings at 41-38.\n\n\r\n              The Clippers can help themselves with wins in their last two regular-season games.\n\n\r\n              “I'm not a fan of the play-in tournament,” coach Tyronn Lue said. “We're still not out of the clear yet.”\n\n\r\n              The Lakers had already clinched at least a play-in spot, but are trying to finish in the top six and earn one of the guaranteed postseason berths. The Clippers own the head-to-head tiebreaker over the Lakers.\n\n\r\n              “Whatever we end up, that's where we end up,” James said. “For us, it's always about health. Over the last couple years, that's been our Achilles' heel.”\n\n\r\n              James had 33 points — 30 in the second half — eight rebounds, seven assists and six turnovers for the Lakers, who were closing out a back-to-back. Anthony Davis had 17 points and 11 rebounds for the Lakers, who had won four in a row and seven of eight.\n\n\r\n              The Clippers came in fresh, having had three days off. The Lakers, by comparison, eked out an overtime win at Utah on Tuesday night that required James and Davis to play even more minutes on the front end of the back-to-back. \n\n\r\n              “It was one of those scheduling conflicts,\" James said. \"It definitely got the best of us tonight.”\n\n\r\n              Playing without injured Paul George, the Clippers got 17 points and 13 rebounds from Ivica Zubac. Facing the Lakers for the first time since their divorce in February, Russell Westbrook added 14 points.\n\n\r\n              Bones Hyland hit three 3-pointers and Terance Mann added another early in the fourth to extend the Clippers' lead to 106-90. Powell sent a perfectly timed alley-oop pass over Davis and Leonard slammed it down for a 112-92 lead.\n\n\r\n              James and Davis combined for nine points on 4-of-12 shooting in the half.\n\n\r\n              “I let them know Bron was going to come out guns blazing,” Lue said of his halftime speech.\n\n\r\n              James and Davis took over in the third during the Lakers' lone dominant stretch of the game. They combined to score 17 of their team's first 19 points during a run that cut the deficit from 21 points to eight. Davis scored over Mason Plumlee to draw the Lakers within seven.\n\n\r\n              But Powell ran off 10 in a row and Plumlee dunked to send the Clippers into the fourth leading 93-82. Leonard was limited to a 3-pointer in the third.\n\n\r\n              Coming in off three days' rest, the Clippers opened the game with a 23-11 run in which a clearly motivated Westbrook scored eight points and assisted on their first two baskets.\n\n\r\n              “We came out with energy early,” Leonard said. “We kept our foot on the pedal.”\n\n\r\n              The Lakers answered with a 15-2 spurt to take their lone lead of the game, 26-25, while getting points from five different players.\n\n\r\n              The Clippers outscored the Lakers 34-21 in the second quarter to lead 71-52 at halftime. One of James' no-look passes ended up in Mann's hands and he fired to Powell, who hit a 3-pointer. Another James turnover resulted in a dunk by Mann. \n\n\r\n              TIP-INS\n\n\r\n              Lakers: Lost the season series, 4-0. They were beaten by six, 13, 18 and seven points. ... Mo Bamba (ankle sprain) has been out for a month. \n\n\r\n              Clippers: Leonard reached 4,000 career rebounds in the third. ... They outscored the Lakers 20-8 in fast-break points in the first half, the most such points since November 2021 against Minnesota. ... Marcus Morris (low back spasms) sat out.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host Phoenix on Friday. They're 1-2 vs. the Suns this season.\n\n\r\n              Clippers: Host Portland on Saturday. The Blazers have already been eliminated from postseason contention.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994947.325962
}