{
  "game_id": "0022300491",
  "espn_id": "401585119",
  "date": "Jan 05, 2024",
  "matchup": "LAL vs. MEM",
  "headline": "Frustrated LeBron sounds off on Lakers' struggles after 10th loss in 13 games, 127-113 to Memphis",
  "body": "LOS ANGELES -- — LeBron James didn't sugarcoat his increasingly sour feelings after the Los Angeles Lakers spiraled to their 10th loss in 13 games Friday night, falling 127-113 to the Memphis Grizzlies.\n\n\r\n              “We just suck right now,” a visibly perturbed James said after he scored 32 points in the Lakers' fourth consecutive loss.\n\n\r\n              Anthony Davis had 31 points in Los Angeles’ latest discouraging defeat since winning the inaugural NBA In-Season Tournament. The Lakers — who gave up a season-high 23 3-pointers to a Memphis team that’s last in the NBA in 3-point shooting percentage — have beaten only San Antonio, Oklahoma City and Charlotte since raising the trophy in Las Vegas four weeks ago.\n\n\r\n              Before the game, coach Darvin Ham said he felt confident in his job security because of his discussions with owner Jeanie Buss and general manager Rob Pelinka. After the Lakers’ latest dismal effort, Ham praised his team’s areas of improvement while expressing a curious frustration with the public reception of their recent struggles.\n\n\r\n              “This is the NBA, man,” Ham said. “This is a marathon. You have to look at the totality of the picture. I’m tired of people living and dying with every single game we play. It’s ludicrous, actually. It’s like, ‘Come on, man. This is a marathon.’ We hit a tough stretch. It’s the same team. We played some high-level games a little while ago, and we’ve just got to get back to that. We’ve got to keep the fight, though. We cannot lose our fight.”\n\n\r\n              James doesn't share his coach's optimism: He reacted negatively to a suggestion that the Lakers’ solid play in the tournament final was an indication that this team can be a championship contender.\n\n\r\n              “That was just two games, though,” James said. “That was a small sample. Everybody is getting so cracked up about Vegas, keep bringing up Vegas. It was two games. We took care of that business … but that was really just two games.”\n\n\r\n              Austin Reaves had 19 points and a career-high 12 assists, but the Lakers dropped to 0-2 to begin a 12-game stretch with just one game outside of Los Angeles. The Lakers acknowledge they're feeling the strain of their losing streak.\n\n\r\n              “Wearing this uniform, you get a lot of flack, and guys are watching you under a microscope as a team,” Davis said. \"You have a couple of bad games, lose a couple in a row, you can't lose your confidence. Can't be on social media, listening to whatever people are saying. We've got to stay together in this locker room and find our way out of it. There's no help coming. There's no cavalry. We've got to do it with the guys we've got and remain together.”\n\n\r\n              Jaren Jackson Jr. hit five 3-pointers and scored 31 points and Marcus Smart added 29 points with a season-high eight 3-pointers for the Grizzlies, who earned just their second win in six games.\n\n\r\n              Desmond Bane had 24 points and 13 assists while Ja Morant scored 21 points for Memphis, whose starting lineup combined for 21 of those 3-pointers. Smart had missed 16 consecutive 3-point attempts over the past five games in a low-percentage shooting season before he hit the first of his 8 3-pointers against the Lakers.\n\n\r\n              Ziaire Williams added 10 of his 15 points in the fourth quarter while the Grizzlies pulled away from the Lakers with a game-ending, 24-10 run.\n\n\r\n              \"We got some pretty good looks,\" James said. “They turned us over. I had two critical turnovers, missed four free throws. But we had our chances.”\n\n\r\n              Los Angeles had won six consecutive home games over the Grizzlies in the past 12 months, including three straight in the Lakers' first-round playoff upset of the second-seeded Grizz last spring.\n\n\r\n              “It was good, because obviously we haven't won here in a while,” Morant said. “It's the team that knocked us out of the playoffs. Obviously, we're not where we want to be right now during the season, so this was a big-time win for us. We can carry the momentum from this game.”\n\n\r\n              The Lakers played without two regulars and frequent starters: D’Angelo Russell missed his third straight game with a bruised tailbone, and Rui Hachimura missed his second in a row with a strained left calf.\n\n\r\n              During the third quarter, Memphis coach Taylor Jenkins got a technical foul for stepping onto the court during play to argue about a no-call during a loose ball scramble between James and Jackson.\n\n\r\n              Jenkins impeded Taurean Prince leading the Lakers' fast break the other way and then fought aggressively to get past his assistants as they held him back from the officials, but Jenkins somehow wasn't ejected. Jenkins said he apologized to Ham for interrupting play.\n\n\r\n              “You can't do that, so I take full responsibility there,” Jenkins said. “I saw a tussle there. Jaren is clamping LeBron. Obviously (the officials) didn't see that, and then I saw something that crossed the line. Maybe look at it after the fact, but I saw maybe some intent that I had to stand up for my guy. Glad to see our guys rally. Obviously got the crowd into it. ... I was just proud of the way they fought all the way through after a tough first 12 minutes.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At Phoenix on Sunday.\n\n\r\n              Lakers: Host Clippers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995525.242118
}