{
  "game_id": "0021900358",
  "espn_id": "401161000",
  "date": "Dec 11, 2019",
  "matchup": "LAL @ ORL",
  "headline": "James leads Lakers past Magic 96-87",
  "body": "ORLANDO, Fla. --  LeBron James has made a career out of carrying his team through tough stretches, and in his 17th season, he hasn’t lost a step.\n\nJames had 25 points, 11 rebounds and 10 assists for his sixth triple-double this season, helping the Los Angeles Lakers to a 96-87 win over the Orlando Magic on Wednesday night.\n\nAnthony Davis had 16 points and 12 rebounds and Kentavious Caldwell-Pope added 15 for the Lakers, who have won 13 of 14.\n\nBut it was James who was the deciding factor, accounting for every point in a 10-0 run that broke a 71-71 tie early in the fourth quarter.\n\nOrlando had rallied from 24 points down to tie it at 71-all on a 3-pointer from Michael Carter-Williams with 10:48 left in the game.\n\nJames pulled the plug on the Magic comeback. He assisted on the Lakers’ next three possessions, hitting a cutting Avery Bradley in the lane for a layup, Alex Caruso for a corner 3 and Jared Dudley for another wide open 3-pointer.\n\n“He is the best in the world for a reason,” Caruso said. “Him just getting to the paint draws so many bodies the we’re open on the backside. He creates a lot of attention so it’s up to us to play off that and we did a good job tonight.”.\n\nJames finished the run with a defensive rebound and a bullish drive through the Magic defense for a layup and 81-71 lead with 7:47 left in the game.\n\nThe Magic never got closer than five after that.\n\n“LeBron was great, especially down the stretch,” Lakers coach Frank Vogel said. “He quarterbacks the action for us, keeping the lead at a healthy distance and making plays on the defensive end.”\n\nJonathan Isaac led Orlando with 19 points, all in the second half. Evan Fournier had 18 and Aaron Gordon finished with 14 points and 14 rebounds. Mo Bamba had 13 points.\n\nOrlando had to dig itself out of a 26-9 deficit after the first quarter. The Magic shot just 19% (4 of 21) in the quarter and gifted the Lakers five turnovers to go with the poor shooting.\n\n“That first quarter is us not understanding who you’re playing against or what our team has to do to play well,” Magic coach Steve Clifford said. “It took us 10, 11 minutes to get locked into what we had to do, and then we played fine.”\n\nThe Magic hit three straight 3-pointers, two by Fournier, to start the second half and eventually cut what had been a 24-point deficit to 57-55 on a dunk by Khem Birch with 7:27 left in the third period. Los Angeles never gave up the lead, but had trouble getting into any flow against an aggressive Orlando defense.\n\nSMARTER COACH NOW\n\nFrank Vogel returned to Orlando for the first time since being fired by the Magic in 2018. Vogel won just 32.9% (54-110) of his games in two seasons in Orlando. He is winning 87.5% of the time his first year in Los Angeles. Of course, he didn’t have LeBron James and Anthony Davis on his Magic roster. “All coaches are smarter with great players,” Vogel said.\n\nTIP INS\n\nLakers: Jared Dudley was ejected from the game with 7:06 for fighting. … Los Angeles missed its first six 3-point attempts of the game, then six of their next eight before halftime. … The Lakes committed 11 turnovers in the first half.\n\nMagic: Wes Iwandu was ejected from the game with 7:06 to play for fighting. … Starting PG Markelle Fultz sat out the game with stomach flu. … Three Magic starters got shut out and Aaron Gordon scored just one point in that period.\n\nUP NEXT\n\nLakers: Play at Miami on Friday.\n\nMagic: Host Houston on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996016.97888
}