{
  "game_id": "0022401008",
  "espn_id": "401705574",
  "date": "Mar 19, 2025",
  "matchup": "MEM @ POR",
  "headline": "Trail Blazers beat Grizzlies 115-99 behind big game from Avdija",
  "body": "PORTLAND, Ore. -- — Deni Avdija had 31 points, 16 rebounds and eight assists to lead the Portland Trail Blazers to a 115-99 victory over the Memphis Grizzlies on Wednesday night. \n\n\r\n              Anfernee Simons added 22 points for the Blazers, who led by 21 in the third quarter and never trailed.\n\n\r\n              Desmond Bane led the Grizzlies with 20 points.\n\n\r\n              Portland (31-39) won its third straight to move within two games of 10th place in the Western Conference and the final spot in the play-in tournament. Dallas and Phoenix are tied for 10th at 33-37. \n\n\r\n              Memphis is a game behind the Denver Nuggets for fourth place in the West and home-court advantage in the first round of the playoffs.\n\n\r\n              After trailing by 21 in the third period, the Grizzlies shaved Portland's lead to 96-89 heading into the fourth.\n\n\r\n              A 3-pointer by Avdija, who had 26 points before halftime, gave Portland its biggest lead of the first half at 66-50. The Grizzlies clawed back a little to make it 71-58 at the break.\n\n\r\n              Portland opened the second half on an 11-3 run to push its lead to 82-61.\n\n\r\n              The Blazers built a 25-10 lead early in the first quarter.\n\n\r\n              NCAA rematch\r\n              Nearly a year after squaring off in the NCAA championship game, Memphis center Zach Edey and Portland big man Donovan Clingan clashed again Wednesday night. Both rookies started.\n\n\r\n              Edey was in foul trouble most of the night and only played 10 minutes. Clingan had seven points, 11 rebounds and three blocks in 26 minutes.\n\n\r\n              Key moment\r\n              With the Grizzlies trying to make a comeback in the fourth quarter, star forward Jaren Jackson Jr. was called for an offensive foul and picked up a technical for arguing with the officials. After that sequence, the Grizzlies never got closer than 10 points.\n\n\r\n              Key stat\r\n              The Blazers outrebounded the Grizzlies 65-40.\n\n\r\n              Up next\r\n              Memphis plays at the Los Angeles Clippers on Thursday night and Portland hosts Denver.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997593.303705
}