{
  "game_id": "0022400867",
  "espn_id": "401705433",
  "date": "Mar 02, 2025",
  "matchup": "POR @ CLE",
  "headline": "Hunter scores 32 points and Cavs hold off Blazers 133-129 in OT for 10th straight win, 50th overall",
  "body": "CLEVELAND -- — De'Andre Hunter scored 32 points and made a go-ahead 3-pointer with 30 seconds left in overtime as the Cleveland Cavaliers rallied for a 133-129 win over the Portland Trail Blazers on Sunday to extend their winning streak to 10 and become the first NBA team with 50 victories this season.\n\n\r\n              The Cavs were down 18 in the third quarter before fighting back to win for the 14th time in 15 games. They did it without All-Star guard Donovan Mitchell, who got some planned rest.\n\n\r\n              Ty Jerome added 25 points and Evan Mobley 20 for Cleveland, which was coming off an emotional win on Friday at Boston during which it erased a 22-point deficit.\n\n\r\n              Portland's Deni Avdija had 30 points, 12 rebounds and 10 assists for his first career triple-double. Anfernee Simons added 27 points.\n\n\r\n              After Simons' 3-pointer with 44 seconds to go in OT put the Blazers ahead 129-128, Hunter, who was acquired by Cleveland at the trade deadline, drained his biggest shot since joining the Cavs.\n\n\r\n              Avdija missed a 3-pointer with 6 seconds left and Hunter made two free throws as the Cavs improved 28-4 at home.\n\n\r\n              Takeaways\r\n              Blazers: They gave the NBA's top team all it could handle before fading down the stretch. Still, it was a positive performance.\n\n\r\n              Cavaliers: With a demanding schedule in March — 16 games, 29 days — coach Kenny Atkinson said the team will be strategic about making sure players get rest as the playoffs approach.\n\n\r\n              Key moment\r\n              With Portland up two in OT, Cavs guard Darius Garland, who was just 4 of 16 from the field, hustled back to deflect a long pass that could have been an easy layup.\n\n\r\n              Key stat\r\n              Cleveland has three double-digit winning streaks this season. The Cavs opened 15-0 and won 12 in a row from Dec. 13 to Jan. 9.\n\n\r\n              Up next\r\n              The Blazers are in Philadelphia on Monday. The Cavaliers play in Chicago on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998166.988738
}