{
  "game_id": "0021500277",
  "espn_id": "400828164",
  "date": "Dec 03, 2015",
  "matchup": "OKC @ MIA",
  "headline": "Heat prevail on Dwyane Wade FTs after 38 lead changes in battle with OKC",
  "body": "MIAMI -- Dwyane Wade was exhausted. Erik Spoelstra was nauseated. Goran Dragic was already sore when the game ended.\nAnd the Miami Heat weren't complaining in the least, not after winning the most back-and-forth game so far in this NBA season.\nWade scored 28 points, including two free throws with 1.5 seconds left that put Miami ahead to stay, and the Heat defeated the Oklahoma City Thunder 97-95 on Thursday night in a wild, back-and-forth game that featured 38 lead changes and 11 ties.\n\"Like a playoff atmosphere,\" Wade said. \"For our young team, that hasn't been in many of these kind of games, it was great.\"\n\nChris Bosh scored 16 points, and Dragic added 14 for Miami, which survived when Russell Westbrook's 3-point try from the right wing bounced off the backboard as time expired.\n\"Back and forth and back and forth,\" Bosh said. \"These are the games you want to play in.\"\nWestbrook and Kevin Durant each scored 25 for Oklahoma City, which misfired on a pair of 3s in the final 10 seconds. First, Durant missed and Bosh grabbed the rebound, calling time with 7.7 seconds remaining. That set up the possession where Wade drove, drew a foul on Serge Ibaka and put Miami ahead for good.\n\"I shoot 47 percent from 3, and I got a wide-open look,\" Durant said. \"I just missed it.\"\nWestbrook then missed the finale, leaving him scoreless in the game's final 16 minutes.\n\"We got some shots that we usually make,\" Westbrook said. \"We just missed them.\"\nNo other NBA game entering Thursday had more than 25 lead changes this season, and in Wade's 13-season career with the Heat, no Miami game ever had more than 31.\nIt was theater, all the way to the end.\n\"My stomach's in knots,\" Spoelstra, the Heat coach, said. \"These guys love it. They love it. This is what you play for.\"\nDurant's 3-pointer with 1:32 left was the 37th lead change of the night and put Oklahoma City up 95-93. About a minute later, on a play in which he said he lost his footing four times, Wade tied it on a short jumper, the 11th time the sides were knotted on the evening.\n\"I was just trying to make a play,\" Wade said.\nNeither team ever led by more than six points, and that was for a combined 35 seconds. Back and forth, and back and forth, and then more back and forth they went all night, with all but seven of the game's 48 minutes being played while neither team led by more than three points.\n\"Everybody lives for these moments,\" Dragic said.\nTIP-INS\nThunder: Oklahoma City had two days off before and after this game, its most relaxed stretch so far this season. ... Thunder coach Billy Donovan had coached at American Airlines Arena in his college days with the Florida Gators, going 4-0 in Orange Bowl Classics there in the early 2000s, with Heat F Udonis Haslem helping get one of those wins. ... Westbrook has reached 25 points in 11 of 19 games this season.\nHeat: Josh McRoberts had a season-high 12 points. ... The Heat were 7-for-15 from the foul line in the first half, 7-for-9 in the second. ... Miami rookie Justise Winslow spent much of his time guarding Durant, adding him to a list of defensive assignments that includes, among others, LeBron James, Carmelo Anthony, Paul George and James Harden in his first two professional months.\nODD FIRST\nThe first quarter was loaded with oddities for the Thunder. Durant picked up two fouls in the first 4:30, the first time that has happened in a regular-season game since March 29, 2009, or in any game since May 13, 2011. Westbrook scored 15 points, the most anyone has scored against Miami in any quarter all season. And the Thunder went a full quarter without trying a 3-pointer, the first time that's happened this season.\nHOME DOZEN\nThe Heat are the first team in the East to already have 12 home games complete. In the West, the Los Angeles Clippers (13) and Houston (12) also are that far into their home schedules.\nUP NEXT\nThunder: Host Sacramento on Sunday.\nHeat: Host Cleveland on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994202.235898
}