{
  "game_id": "0021801153",
  "espn_id": "401071826",
  "date": "Apr 01, 2019",
  "matchup": "MIA @ BOS",
  "headline": "Celtics spoil Wade's final Garden visit, beat Heat 110-105",
  "body": "BOSTON --  The Celtics showed Dwyane Wade plenty of appreciation in his final regular-season visit to TD Garden.\n\nThey also made sure his memories of that visit included a loss.\n\nKyrie Irving had 25 points, including a pair of key late free throws, and Boston held off the Miami Heat 110-105 on Monday night.\n\nAl Horford added 19 points, 11 rebounds and 10 assists for the Celtics (46-32), who are trying to beat out the Indiana Pacers for the No. 4 seed in the Eastern Conference standings.\n\n\"We'll see when we get there,\" Irving said of how the Celtics are trending with the playoffs two weeks away. \"I'm pretty sure I think we know who we're going to play, but we'll see how it pans out.\"\n\nGoran Dragic led the Heat with 30 points. Bam Adebayo added 19 points and 14 rebounds. Wade finished with 17 points and seven assists.\n\nMiami (38-39) maintained its half-game lead over Orlando for the final playoff spot in the East after the Magic's 121-109 loss to Toronto.\n\nTwo nights after Wade received a warm welcome in Madison Square Garden and picked up a victory in his final game against the New York Knicks, Boston gave him a similar greeting at TD Garden on Monday.\n\nBefore the game, Celtics president of basketball operations Danny Ainge presented Wade with a plaque in commemoration of his career accomplishments.\n\nLater, he received a loud ovation from Boston fans when he subbed into the game in the first quarter.\n\n\"We've had so many battles in the playoffs, but appreciate the respect they've shown me as a player to give me the plaque and send me away with a piece of the history of the Celtics,\" Wade said. That was so cool, and I didn't expect it at all.\"\n\nIt was one of the few highlights for either Wade or Miami in the first half.\n\nThe Celtics jumped out to 30-8 lead after the Heat started just 3 for 14 from the field, including 0 for 7 from the 3-point line.\n\nBoston led by as many as 23 points in the second quarter before its lead shrunk to three with 6:44 left in the fourth after the Heat went back to a zone that had been effective at times in the first half.\n\nThe Celtics continued to have some issues with it but were able to knock down a pair of 3-pointers to help push their lead back up to 101-92.\n\nThe Heat took advantage of some Boston turnovers and got a jumper from Wade that cut it to 103-100 with 2 minutes left.\n\nDion Waiters missed a 3-pointer for Miami that would have tied the game and Irving converted on a three-point play on the other end.\n\nFollowing a tip-in by Wade, Irving found nothing but air on a fading 3-point attempt, giving it back to Miami. But the Heat's ensuing possession ended with Kelly Olynyk's turnover.\n\nIrving then was fouled and calmly sank a pair of free throws.\n\n\"We just could not get it over the hump to close out game,\" Heat coach Erik Spoelstra said.\n\nTIP-INS\n\nHeat: Had 15 turnovers. . Shot just 27% from the 3-point line (10 of 37).\n\nCeltics: It was Horford's second career triple-double and first as a Celtic. His first was Jan. 13, 2015, with Atlanta.\n\nPAYING RESPECT\n\nWade used his shoes to write a special remembrance in honor of rapper Nipsey Hussle , who was shot and killed in Los Angeles on Sunday.\n\n\"Nipsey Hussle. Rest in Heaven,\" the message read.\n\nThe 33-year-old Hussle, whose real name was Ermias Asghedom, was an Eritrean-American father of two who was engaged to actress Lauren London. He was lauded for his philanthropic work in the Los Angeles area.\n\nHussle's friends across the music industry and other stars, including Rihanna and Snoop Dogg, took to social media to express their condolences as well. Many used the opportunity to point out his role in uplifting African Americans through his community initiatives.\n\n\"It's just hard,\" Irving said. \"Knowing what Nipsey stood for, what he was trying to promote in the community around the world.\"\n\nINJURY UPDATE\n\nMiami's Derrick Jones Jr. left the game in the first quarter with a right knee injury after a collision with Irving in the first half. Spoelstra said he would have a MRI in Miami.\n\nUP NEXT\n\nHeat: Host Celtics on Wednesday\n\nCeltics: Visit Heat on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995218.496072
}