{
  "game_id": "0021900720",
  "espn_id": "401161362",
  "date": "Jan 31, 2020",
  "matchup": "TOR @ DET",
  "headline": "Raptors' streak at 10 after 105-92 win over Pistons",
  "body": "DETROIT --  The honors and accolades keep rolling in for coach Nick Nurse and the Toronto Raptors.\n\nPascal Siakam scored 30 points and Serge Ibaka added 21 to lift the Raptors to their 10th straight victory, 105-92 over the Detroit Pistons on Friday night. With the win, Toronto clinched a trip to the All-Star Game for Nurse and his staff, who will coach Team Giannis.\n\n\"We get to be the beneficiaries, I think, of kind of an organizational award,\" said Nurse, who led the Raptors to the NBA title last year in his first season as coach. \"It's certainly a tremendous honor for us, but there's a lot that goes into it, and it should be a really enjoyable experience for our guys.\"\n\nSiakam was voted an All-Star starter, and Toronto guard Kyle Lowry was chosen as a reserve.\n\nThe Raptors (35-14) are assured the best record in the Eastern Conference among teams with an eligible All-Star coach through this Sunday's deadline. Milwaukee has the top mark in the East but Mike Budenholzer is ineligible because he coached in the All-Star Game last year.\n\nSiakam made his first five shots from the field and scored 13 points in the first quarter, when the Raptors quickly built their lead into double digits. They were mostly in control after that, handing the Pistons their fifth loss in a row.\n\nFred VanVleet scored 16 points with nine assists and eight rebounds. Any chance at a triple-double went by the wayside after he was pulled with 5:01 remaining and the Raptors up 19.\n\n\"He was hatin' on me,\" VanVleet joked about Nurse. \"We got him in the All-Star (Game), he couldn't even leave me in.\"\n\nToronto is one win shy of its franchise record for consecutive victories.\n\nThe Pistons are without Blake Griffin (left knee surgery), and Luke Kennard (bilateral knee tendinitis) also missed the game. Andre Drummond had 20 points and 20 rebounds for Detroit, but much of that came when the Pistons were well behind.\n\nToronto led by 16 in the first half. It was 78-69 after three quarters, and then the Raptors went on an 18-5 run to start the fourth -- to the delight of their many fans who attended the game just a few minutes from the U.S.-Canada border.\n\n\"The only way to silence that is to win,\" said Detroit coach Dwane Casey, who was Toronto's coach before Nurse took over. \"That team has been built. It took a while to build it and it didn't happen overnight. We have to have a plan to get our team in that position, and that is what we are doing now -- there is a plan.\"\n\nDrummond was scoreless in the first half but finished with his 41st game of at least 20 points and 20 rebounds. That's four shy of Bob Lanier's franchise record, but it's not clear if Drummond has time to reach that mark. He's been the subject of trade speculation.\n\nDetroit guard Derrick Rose made a late layup to finish with 21 points, his 14th straight game with at least 20.\n\nSELECTED\n\nDetroit's Svi Mykhailiuk was picked to play in the Rising Stars game Feb. 14 during All-Star weekend in Chicago. The 6-foot-8 Mykhailiuk, in his second season as a pro, has shown some promise for the Pistons. He scored 13 points Friday.\n\nRaptors rookie Terence Davis II expressed some dismay on social media at not being selected.\n\n\"This isn't my first time not being selected for something but I guess it's easy going undrafted to playing quality mins on a championship team huh,\" Davis said on Twitter.\n\nTIP-INS\n\nRaptors: Marc Gasol (left hamstring tightness), Rondae Hollis-Jefferson (right ankle sprain) and Malcolm Miller (neck strain) missed the game. ... Toronto won 11 games in a row from Feb. 26 to March 16, 2018, and in January 2016.\n\nPistons: Detroit was outscored 66-28 in the paint.\n\nUP NEXT\n\nRaptors: Host Chicago on Sunday.\n\nPistons: Host Denver on Sunday.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995603.336941
}