{
  "game_id": "0022300956",
  "espn_id": "401585584",
  "date": "Mar 14, 2024",
  "matchup": "CHI vs. LAC",
  "headline": "Paul George nails 6 3s, scores 28, Kawhi Leonard adds 27 points as Clippers beat Bulls 126-111",
  "body": "CHICAGO -- — Whether he was burying his shots or moving the ball, Paul George seemed to make all the right decisions. The Clippers will sure take more of that.\n\n\r\n              George made six 3-pointers and scored 28 points, Kawhi Leonard added 27 and Los Angeles beat the Chicago Bulls 126-111 on Thursday night.\n\n\r\n              Los Angeles regrouped after a 20-point lead late in the third quarter dwindled to eight in the fourth and stopped a two-game skid, beating Chicago for the second time in six days. Both teams were missing key players with the Clippers’ James Harden (strained left shoulder) and the Bulls’ Coby White (sore right hip) sidelined. But with George and Leonard leading the way, the Clippers had enough to come away with the win.\n\n\r\n              “We talk about the last 20 games, putting the ball back in PG's hands so he can get used to it so when we get to the playoffs we know exactly what we want to do,” coach Tyronn Lue said. “Now, he's just getting accustomed to running more pick-and-rolls and keeping the ball in his hands.”\n\n\r\n              George made 11 of 12 from the field and was one shy of a season high in making 6 of 7 3's. The Clippers were 20 of 40 from beyond the arc. \n\n\r\n              George also had seven assists and just one turnover, with the Bulls double teaming him and Leonard.\n\n\r\n              “It was just staying under control, playing through our teammates and I think just taking what they gave us,” he said. “I didn't think we were out of the norm, we weren't out of character, we kind of just played our style, slowed the game down for ourselves and took the shots that were available.”\n\n\r\n              Leonard, who exited Tuesday’s loss to Minnesota because of back spasms, made 12 of 17 shots. He said he thought he got elbowed in the game against the Bulls and irritated it the next day in the loss to Milwaukee.\n\n\r\n              Norman Powell scored 18 points. Bones Hyland added 17 points and a career-high 11 assists while matching a personal best with four steals for the Clippers, who are fourth in the Western Conference.\n\n\r\n              DeMar DeRozan led Chicago with 21 points after scoring a season-high 46 in Wednesday’s overtime win at Indiana. The Bulls have lost three of four.\n\n\r\n              Nikola Vucevic scored 19 for Chicago. Alex Caruso made five 3s and finished with 17 points after scoring a season-high 23 the previous night, and Andre Drummond scored 15.\n\n\r\n              The Clippers led 90-70 after Terance Mann's fast-break layup with about 4:30 left in the third quarter. But the Bulls weren't finished.\n\n\r\n              DeRozan cut it to 98-90 early in the fourth with a finger-roll and 3-pointer. It was a nine-point game midway through the quarter when Hyland made a 3 and Ivica Zubac tipped in a missed 3 by Leonard, and the Clippers remained in control from there.\n\n\r\n              The Bulls, were breathing a little easier after imaging showed White was not seriously injured, coach Billy Donovan said. He is day to day after Pascal Siakam blocked his layup and landed on him near the end of regulation at Indiana on Wednesday.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Visit New Orleans on Friday.\n\n\r\n              Bulls: Host Washington on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995868.457036
}