{
  "game_id": "0021600188",
  "espn_id": "400899638",
  "date": "Nov 19, 2016",
  "matchup": "DET vs. BOS",
  "headline": "Celtics win in Detroit on Horford's follow in final seconds",
  "body": "AUBURN HILLS. Mich. --  Al Horford got the winning basket, though it was Marcus Smart who made the biggest play.\n\nWith the game tied at 92, Jae Crowder missed a go-ahead 3-pointer, but Smart came from the corner to tip the ball back at the basket. His shot didn't go in, but it gave Horford time to set himself for the follow shot with 1.3 seconds left that gave the Boston Celtics a 94-92 victory over the Detroit Pistons.\n\n\"The credit goes to Marcus, because that was a championship-level play,\" Horford said. \"He crashed the glass hard.\"\n\nSaid Pistons coach Stan Van Gundy: \"We just stood there and watched. They missed and no one moved or blocked out.\"\n\nIsaiah Thomas had 24 points and eight assists for Boston, while Horford added 18 points and 11 rebounds.\n\n\"We didn't call a timeout in the last four minutes, because I just wanted to let them play,\" Boston coach Brad Stevens said. \"Our guys were making the right reads and the right plays.\"\n\nMarcus Morris led Detroit with 24 points and Andre Drummond had 20 points and 17 rebounds. The Pistons became the last NBA team to lose at home.\n\nThe teams traded the lead for most of the fourth quarter, and Kentavious Caldwell Pope's 3-pointer -- his first basket of the game -- gave the Pistons an 87-86 lead with 1:54 left. The teams traded dunks, and Thomas hit a layup over Drummond with 1:10 to play to make it 90-89.\n\nCaldwell-Pope missed an open 3, making him 1 for 7 on the night, and Drummond fouled Thomas on another drive. He made both free throws with 30.5 seconds left to give the Celtics a three-point lead, but Tobias Harris hit a tying 3-pointer.\n\n\"We were in position to come out of here with a victory, but we let them get off two extra shots,\" Harris said. \"Nobody, including myself, turned around to keep someone off the glass.\"\n\nBoston, realizing that Drummond was on the bench, didn't call a timeout and it ended up being the difference in the game.\n\n\"I'm kicking myself right now, because if we have Andre on the floor, we get that rebound and we're in overtime,\" Van Gundy said. \"We had Aron on the floor to run the play that led to our 3-pointer, but when they didn't call a timeout, we couldn't get Andre back out there.\"\n\nThe Celtics were 6 of 10 on 3-pointers in the first quarter, including Thomas' buzzer-beater, to take a 30-23 lead. Boston led 50-47 at halftime.\n\nDetroit got 37 points from its starting frontcourt in the half, but guards Ish Smith and Caldwell-Pope had three points on 1-of-5 shooting. Boston's backcourt of Avery Bradley and Thomas combined for 18 points and nine assists.\n\nThe Pistons used a 10-0 run to take the lead midway through the third quarter, and still had a 73-71 advantage at quarter's end.\n\nTIP-INS\n\nCeltics: Thomas started the second half with a four-point possession. He hit a free throw after the Pistons were called for a defensive three-second violation, then knocked down his second 3-pointer of the game.\n\nPistons: Stanley Johnson, normally one of the Detroit's top bench players, didn't play. Van Gundy said that Johnson will only be used as a backup small forward, and he wasn't needed with Morris and Harris both playing well.\n\nDRUMMOND MILESTONE\n\nDrummond pulled down his 4,000th career rebound in the third quarter. At 23 years and 101 days, he is the second-youngest player to reach the milestone, trailing only Dwight Howard (22 years, 129 days).\n\nCELTICS PLAY SMALL\n\nStevens wanted to keep a smaller lineup on the floor to try to give Drummond and Baynes matchup problems. Smart played 30:36 while starter Amir Johnson only got 20:22. \"We were trying to stretch those guys as much as we could,\" he said. \"It is hard to do that, because of Morris and Harris, but we thought it went well.\"\n\nUP NEXT\n\nCeltics: Travel to Minneapolis to play the Minnesota Timberwolves on Monday.\n\nPistons: Host the Houston Rockets on Monday.",
  "source": "espn_api",
  "crawled_at": 1764996080.2370229
}