{
  "game_id": "0021800070",
  "espn_id": "401070751",
  "date": "Oct 26, 2018",
  "matchup": "HOU vs. LAC",
  "headline": "Harrell has career-high 30 as Clippers rout Rockets 133-113",
  "body": "HOUSTON --  Five games into the season is too early for the Houston Rockets to panic about their bad start.\n\nSo they are keeping their cool -- for now.\n\n\"All in all, we've got to get better in all aspects of it,\" Chris Paul said. \"We've just got to figure it out. Luckily, it's early.\"\n\nMontrezl Harrell scored a career-high 30 points off the bench to help the Los Angeles Clippers rout short-handed Houston 133-113 on Friday night.\n\nIt was the Clippers' second win this season over the Rockets, who played without James Harden due to a hamstring injury and dropped to 1-4.\n\nHarrell, who was drafted by the Rockets in 2015, was one of six Clippers who scored in double figures.\n\n\"He was good last year and what we found in the second half (of last year) what no one knew was that he could score, because he hadn't done it yet in the NBA,\" coach Doc Rivers said. \"That's why practices are so important and every day in practice he's scoring, and we start thinking maybe this guy can score, and he's proven that he can.\"\n\nLou Williams, another former Rocket, had 23 points for Los Angeles off the bench, and Danilo Gallinari scored 16.\n\nLos Angeles scored the first 11 points of the fourth quarter to make it 107-83 and put the game out of reach. Rookie Shai Gilgeous-Alexander, the 11th overall pick in the draft, had seven points in that stretch for the Clippers.\n\nCarmelo Anthony scored a season-high 24 points in his first start for the Rockets, who were also without starter James Ennis.\n\nAnthony, who is in his first season in Houston after one difficult year in Oklahoma City, doesn't know why the Rockets have struggled with consistency this season.\n\n\"I can't really pinpoint it at this point right now,\" he said. \"We're still all trying to just figure it out. I know we keep saying that it's early but there's some things we have to figure out quickly just to try to get this thing rolling.\"\n\nPaul had 12 points and eight assists against his former team in his return after serving a two-game suspension for his role in a fight with Lakers guard Rajon Rondo. But his presence wasn't enough to make up for the absence of Harden, who will miss at least one more game after straining his left hamstring in a loss to Utah on Wednesday night.\n\nHouston didn't score in the fourth quarter until Anthony made the second of two free throws with 8:41 left.\n\nThe Rockets opened the second half with an 11-3 run capped by a 3-pointer from P.J. Tucker, trimming the Clippers' lead to 73-72 with about eight minutes left in the third.\n\nBut Los Angeles ripped off the next eight points, including 3-pointers by Tobias Harris and Avery Bradley, while Houston missed its next eight shots.\n\nIsaiah Hartenstein ended a three-minute Houston scoring drought on a dunk with about five minutes left, starting a 6-0 spurt that got the Rockets within three.\n\nTIP-INS\n\nClippers: Harris got a technical in the second quarter for jawing at Anthony. ... The Clippers made 35 of 38 free-throw attempts. ... Bradley had 14 points.\n\nRockets: Coach Mike D'Antoni received a technical in the first quarter for yelling at the officials after Harrell knocked Carter-Williams to the ground on a foul. ... C Nene is out for the foreseeable future because of a strained right calf. The center hasn't played this season because of the injury and general manager Daryl Morey said Thursday that he'll be out for at least two more weeks before being re-evaluated. ... Ennis will be re-evaluated after Houston's next game to see if he's healthy enough to play on the team's upcoming road trip.\n\nTHEY SAID IT\n\nTucker when asked about this team's defense compared to last season's team: \"It's a different team. It's not the same team. I hate talking about last year anymore because it's gone. It's not the same team so we have to figure it out.\"\n\nNOT SO SWEET HOME\n\nThe Rockets have had a difficult time at home this season, losing all three games by double digits after only losing three games at home by more than 10 points all last season.\n\nIt's only the 14th time in NBA history that a team has dropped its first three games at home by double digits, according to STATS.\n\nUP NEXT\n\nClippers: Host Washington on Sunday night.\n\nRockets: Host Portland on Tuesday night.\n\n---\n\nMore AP NBA: www.apnews.com/tag/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995325.716723
}