{
  "game_id": "0021500597",
  "espn_id": "400828484",
  "date": "Jan 15, 2016",
  "matchup": "CHI vs. DAL",
  "headline": "Mavericks come from behind to beat Bulls 83-77",
  "body": "CHICAGO --  The Dallas Mavericks came to life just as the Chicago Bulls seemed to deflate.\n\nDallas used a 15-2 run in the third quarter to catch up to the Bulls, and clutch 3-point shooting from Deron Williams and Dirk Nowitzki, along with stifling defense, in the fourth quarter carried the Mavericks to an 83-77 victory Friday night.\n\nThe Bulls got out to an early lead on the poor-shooting Mavericks and looked in control. But playing their fourth game in five nights and coming off a tough comeback win in overtime the night before, the Bulls faded down the stretch.\n\n\"Our energy on defense was much better than the first half,\" said Mavericks coach Rick Carlisle. \"We said, `Hey, let's play to exhaustion and see if we can claw back in this thing.\"\n\nThe Bulls may have been the exhausted ones. Jimmy Butler, who scored a career-high 53 points a night earlier in the overtime win in Philadelphia, was held to just four points on 2-for-11 shooting from the field.\n\n\"Sure he was tired,\" Bulls coach Fred Hoiberg said. \"He played a ton of minutes last night in a superhero performance, and yeah, he was tired, no doubt about it. But he's out there gutting it out and trying to battle through it. It was tough after the overtime game.\"\n\nNowitzki scored 21 points and Williams had 18 for the Mavericks. Zaza Pachulia grabbed 10 rebounds for Dallas.\n\nThe Bulls were up 10 at the half, with the Mavericks shooting just 28.2 percent in the first half. But Dallas held the Bulls to just 31 points in the second half.\n\n\"In the second half, we decided to get out there defensively,\" said Williams, who hit two 3-pointers down the stretch. \"We knew they would be tired coming off the game they had ... so we just kind of tried to outlast them.\"\n\nWhile Butler may have been tired, Williams was rested. He didn't play in the Mavs' last game at Oklahoma City.\n\nChicago also missed a key player in the second half after losing forward Joakim Noah, who left in the second quarter and didn't return after separating his shoulder.\n\nNoah was in obvious pain after tangling with the Mavericks' JaVale McGee under the basket. Noah had been playing in his fourth game after returning from a nine-game absence because of an injury to the same shoulder.\n\n\"When you see that happen to someone like Jo, who is the energy guy on this team, it is going to affect us,\" said Hoiberg, though he added that he didn't think it affected the outcome of the game as much as other factors.\n\nDerrick Rose, back in the lineup after missing one game with knee pain, led the Bulls with 18 points. Pau Gasol added 17 points and Taj Gibson had 11 rebounds.\n\nNowitzki hit a 3-pointer with 2:15 to play to put the Mavericks up 79-72 after the teams had traded the lead most of the fourth quarter. Jimmy Butler missed two 3-pointers in the final 12 seconds as the Bulls tried to rally.\n\nTIP-INS\n\nMavericks: Nowitzki played in his 1,303rd career game to move into a tie for 15th place on the NBA's career list with Elvin Hayes. Next on the list is Buck Williams at 1,307. Nowitzki is one of just 17 NBA players to have played in 1,300 or more games.\n\nBulls: Rose returned to the lineup after sitting out Thursday night in a win over Philadelphia. ... Kirk Hinrich left the game with a left quad bruise and didn't return. The Bulls had scored over 100 in their previous 13 games, the team's longest streak of 100-plus point games since the 1991-92 season.\n\nCHICAGO, THEIR KIND OF TOWN\n\nThe Mavericks have won their last three games at the United Center.\n\nRAINMAN\n\nWilliams was 4 for 5 from 3-point range.\n\nUP NEXT\n\nBulls: At Detroit on Monday.\n\nMavericks: Visit San Antonio on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764993929.1373498
}