{
  "game_id": "0021900899",
  "espn_id": "401161541",
  "date": "Mar 01, 2020",
  "matchup": "SAC vs. DET",
  "headline": "Kings come back from 17 down to beat Pistons 106-100",
  "body": "SACRAMENTO, Calif. --  Sacramento's second unit got the Kings going after a sluggish start put them down by 17 points right out of the gate.\n\nDe'Aaron Fox, still bothered by a lingering abdominal injury, provided an equally big lift down the stretch.\n\nFox scored 11 of his 23 points in the fourth quarter and the Kings rallied to beat the Detroit Pistons 106-100 on Sunday for their fifth straight home victory.\n\n\"As a team we came out slow but our bench picked it up and ultimately helped us,\" Fox said. \"We knew when we came back in the game that we had to pick it up as well because they put us in a better spot than we put ourselves in.\"\n\nThe Kings were coming off a four-game road trip and didn't arrive in Sacramento until 3 a.m. Saturday morning. With no practice before Sunday's game, coach Luke Walton wasn't surprised by his team's slow start.\n\nDetroit led 18-1 and 27-6 before the Kings got rolling.\n\n\"That’s not how we want to start a ballgame,\" Walton said. \"On both ends of the court we didn’t have the energy it required. Give a lot of credit to our second unit for coming in and engaging us in that fight finally.\"\n\nBuddy Hield added 19 points, Bogdan Bogdanovic scored 15 and Harrison Barnes had 10 points and eight rebounds for Sacramento. Alex Len added 13 points, eight rebounds and five blocks.\n\nThe Kings have won four of five since the All-Star break.\n\n“Right now as a team we’re moving in the right direction,” Hield said. “We’re playing together, having fun and competing every night.”\n\nChristian Wood had 20 points and 12 rebounds for the Pistons, who lost point guard Derrick Rose to an apparent ankle injury in the first quarter.\n\nDetroit was off to one of its best starts but couldn’t keep up the pace after Rose was hurt. The Pistons fell behind by 10 in the third quarter and were down 102-89 before scoring 10 straight.\n\n“I thought we had it going pretty good while he was in the game,” Pistons coach Dwane Casey said. “And when the entire group went out, I thought that's when (the Kings) started to pick up their aggression and got us back on our heels. We got a little destabilized there. Once you lose that momentum when you get a big lead it's hard to sustain it.”\n\nFox, who was questionable before the game with lower abdominal soreness, ended the run with an 11-foot jumper. Brandon Knight made a free throw for Detroit before Hield made two to help Sacramento hold on.\n\nTIP-INS\n\nPistons: The 16 points scored by the Kings were the fewest that the Pistons have allowed in a first quarter this season.\n\nKings: Sacramento missed 10 of its first 11 shots. … Richaun Holmes (right shoulder) did some 1-on-1 drills before the game and is expected to be cleared to practice this week. …. Harry Giles was hit with a technical after picking up his third foul in 10 minutes.\n\nTURNING POINT\n\nDetroit was in full control until Rose left with 5:51 remaining in the first quarter. Rose scored nine of the Pistons’ first 18 points and had three rebounds with two assists before getting hurt. The Kings outscored the Pistons by 20 after that. “He makes so much happen on the court, his presence on the floor is big time,” Knight said. “So it definitely hurt not having him out there.”\n\nCOMEBACK KINGS?\n\nThis marked the third time this season that the Kings have overcome a 20-point deficit and won – most in the NBA.\n\nUP NEXT\n\nPistons: Play the Thunder in Oklahoma City on Wednesday.\n\nKings: Host the Wizards on Tuesday. Sacramento won in Washington when the two teams played in November.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996385.6151428
}