{
  "game_id": "0021501028",
  "espn_id": "400828915",
  "date": "Mar 19, 2016",
  "matchup": "CHA vs. DEN",
  "headline": "Augustin scores 24, Nuggets defeat Hornets 101-93",
  "body": "CHARLOTTE, N.C. --  D.J. Augustin isn't sure why he seems to play so well against his former team in Charlotte.\n\nHe indicated there's no added incentive.\n\n\"I've done this on other teams, too,\" Augustin said with a smile. \"It's not just Charlotte. I can play, man. It doesn't matter. The NBA is about opportunity. If you get the right opportunity, you can play well.\"\n\nAugustin scored 24 points on 8-of-11 shooting, and the Denver Nuggets snapped a three-game road losing streak, handing the Hornets a costly 101-93 defeat on Saturday night.\n\nAugustin has scored 17 or more points seven times against Charlotte since the organization decided to go with Kemba Walker as its point guard instead of him after the 2012 season.\n\nNuggets coach Michael Malone said Augustin has been playing with incredible poise in recent weeks.\n\n\"Big plays, not afraid of the moment, makes open shots -- makes the right play most times,\" Malone said. \"He's been a great pickup. He's had a big impact in a lot of the wins we've had since we've gotten him.\"\n\nCharlotte had beaten Miami on Thursday night to pull into a tie with the Heat for the fourth-best record in the Eastern Conference.\n\nThe Hornets are hoping for home-court advantage in a playoff series. They are 26-11 at home this season.\n\n\"Every game this time of year is important, especially against a team like Denver that is out the playoff (race),\" said Hornets forward Cody Zeller. \"This is one that we were hoping to win.\"\n\nDarrell Arthur and Gary Harris added 13 points apiece for the Nuggets, while Nikola Jokic had 11 points and 14 rebounds before fouling out midway through the fourth quarter.\n\nNicolas Batum had 24 points, nine assists and eight rebounds for the Hornets, who lost at home for only the third time in the last 15 games. Jeremy Lin had 16 points and Walker added 15 for Charlotte.\n\nThe Nuggets led by as many as 22 points in the third quarter after Harris knocked down a 3-pointer from the wing.\n\nThe Hornets trimmed the lead to 16 to start the fourth quarter before focusing on getting the ball to Al Jefferson in the low post. The veteran center responded with baskets on three straight possessions and came up with a steal that led to a fast-break layup by Walker to cut the Denver lead to nine.\n\nBut Jefferson picked up his fifth foul with 8 minutes left and Augustin hit a pair of 3-pointers to cut the push the lead back to 16.\n\nThe Hornets would trim the lead to six with less than a minute to play, but couldn't get any closer.\n\nWith Denver leading 99-93 with 25 seconds left, Augustin missed a driving layup but Harris ran down the long offensive rebound and was fouled.\n\nHe sank both shots to seal the win.\n\n\"There are only four or five teams in this league who are good enough to show up, not play their A-game and win,\" Hornets coach Steve Clifford said. \"If we're not going to have everybody pretty much engaged and playing well, we don't beat anybody.\"\n\nThe Nuggets took a 57-40 halftime lead behind a combined 27 points off the bench from Will Barton, Jusuf Nurkic and Augustin.\n\nTIP-INS\n\nNuggets: Denver's bench outscored Charlotte's 46-32. ... Jokic had his 14th double-double of the season.\n\nHornets: Cody Zeller had a career-high five blocks.\n\nBODY LANGUAGE\n\nClifford said he talked to his team about bad body language at halftime.\n\n\"Whenever there was a mistake, heads were down,\" Clifford said. \"Again, you're going to play the game you're prepared to play, just like every game. You get up with the right attitude in the morning. You get up with a bad attitude something goes wrong, it screws your whole day off. Playing sports it's the same way. If you have the right approach, the right attitude, you're ready to fight for the win like in Miami the other night.\"\n\nBETTER START\n\nThe Nuggets had surrendered a combined 118 points in the first quarter in their three previous road games.\n\nThey held Charlotte to 22.\n\n\"Our guys answered the call. We came out and held that team to 93 points and 42 (percent) from the field and 28 (percent) from the 3,\" Malone said. \"That's a very good team over there. They're playing some of the best basketball in the NBA. I'm happy for our guys.\"\n\nUP NEXT\n\nNuggets: Visit Cleveland on Monday night.\n\nHornets: Host San Antonio on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994348.028453
}