{
  "game_id": "0021801044",
  "espn_id": "401071718",
  "date": "Mar 17, 2019",
  "matchup": "TOR @ DET",
  "headline": "Pistons beat Raptors 101-107 to complete season sweep.",
  "body": "DETROIT --  For the second straight season, Dwane Casey has swept the season series between the Detroit Pistons and Toronto Raptors.\n\nAfter his Raptors went 4-0 against the Pistons in 2017-18, Casey was fired in Toronto and crossed the border to replace Stan Van Gundy in Detroit.\n\nThe Pistons won two close games against Toronto earlier in the season, one by two points and one in overtime, then finished off the sweep with a 110-107 victory Sunday.\n\n\"This isn't about me. It is about these players,\" Casey said. \"They've played three close games against a great basketball team, and they've made the plays to win all of them.\n\n\"We've beaten the No. 2 team in the East three times, but that doesn't mean anything if we don't play this way in every game for the rest of the season.\"\n\nBlake Griffin scored 25 points, Andre Drummond had 15 points and 17 rebounds and Reggie Jackson added 20 points to help the Pistons win for the 14th time in their last 18 games.\n\n\"Every game counts for us right now, because we are in a playoff race,\" Drummond said. \"That's a team that very, very good and we beat them three straight times, but we can't celebrate right now. We've got a lot more games to go and we need to finish strong.\"\n\nKawhi Leonard had 33 points for Toronto, and Fred VanVleet added 17 points in his first game back after missing 12 with a wrist injury. The Raptors have lost four of seven games.\n\n\"I think there's a lot to be happy about,\" Raptors coach Nick Nurse said. \"Freddy was, obviously, really good, and we can plug him back into our first unit. We just have to find someone to step up on the second unit.\"\n\nDrummond gave Detroit a 102-100 lead with two free throws with 1:25 to play. He then knocked the ball away from Leonard to set up Wayne Ellington's layup that made it 104-100.\n\n\"Marc (Gasol) almost had a steal on the play when it was 100-100, but Drummond makes the two free throws, and then we turn it over on the next possession,\" Nurse said. \"Drummond and Griffin made some big plays at the end.\"\n\nEarlier in Drummond's career, when he was the worst free-throw shooter in league history and played out of control in transition, that sequence would have been unthinkable.\n\n\"There were times earlier this season where Andre would have gotten that loose ball, run over someone and thrown it into the stands,\" Casey said. \"But he's done a lot of growing this season. He's learned to be patient and make the right play, and he's worked on his free throws.\"\n\nLeonard hit two free throws, but Griffin answered with a basket in the paint.\n\nGriffin, though, missed two free throws with two seconds left and a three-point lead. The Pistons fouled Leonard, who missed both shots, with Drummond grabbing the rebound off the intentional second miss.\n\nTIP INS\n\nRaptors: Kyle Lowry missed his second straight game because of a sprained left ankle. . Gasol finished with nine points, 11 rebounds and eight assists, narrowly missing his sixth career triple-double.\n\nPistons: Detroit hadn't swept a season series over the Raptors in 10 years. ... Three years after shooting an NBA-record 35.5 percent from the line, Drummond is shooting 84 percent in the final five minutes of close games.\n\nVANVLEET READY TO GO\n\nNurse said before the game that he wasn't sure how many minutes VanVleet would play in his first game since Feb. 9, but didn't expect it to be many. In the end, VanVleet ended up playing 31 minutes and finished the game on the first unit.\n\n\"It was actually less than I expected,\" VanVleet said. \"I have the reverse approach to trying to work my way back in. I just force myself to go out there and play through it. Being a professional means jumping back in as seamlessly as possible.\"\n\nONE MORE STEP\n\nCasey doesn't believe Drummond has reached his potential as a shooter. While an early-season experiment with using him as a 3-point option didn't pay off -- he made five of 37 attempts -- his coach still thinks it has a future.\n\n\"People laugh when I say this, but there's going to be a point where Andre is hitting 3-pointers,\" Casey said. \"We tried it early in the season, and he wasn't ready, but the way that young man works, it is a skill he's going to develop.\"\n\nUP NEXT\n\nRaptors: Host New York on Monday night.\n\nPistons: At Cleveland on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994250.874401
}