{
  "game_id": "0022200297",
  "espn_id": "401468452",
  "date": "Nov 27, 2022",
  "matchup": "PHI @ ORL",
  "headline": "Milton, Harris lead 76ers' rout of Magic",
  "body": "ORLANDO, Fla. -- — Shake Milton had 29 points and seven assists, and the Philadelphia 76ers routed the Orlando Magic 133-103 on Sunday night.\n\n\r\n              Tobias Harris added 25 points for Philadelphia, which also beat the Magic 107-99 on Friday night. Danuel House Jr. scored 19 points, and fellow reserve Paul Reed had 12 points and 13 rebounds. \n\n\r\n              Paolo Banchero led Orlando with 18 points and Franz Wagner scored 17 for the Magic, who lost their fourth straight.\n\n\r\n              Playing a fourth consecutive game without their top three scorers, the 76ers shot 66% in the first half and led 70-45 when Milton opened the third quarter with a 3-pointer.\n\n\r\n              Coach Doc Rivers was impressed with his team's resilience.\n\n\r\n              “When you lose James Harden, Tyrese Maxey and Joel Embiid and you win three out of four, that tells you a team is connected and can be a really good team,” Rivers said.\n\n\r\n              “All we’ve been doing is keeping the ship running,” House said. “It’s just us playing in the flow of the game. If anything I would say the fans would be more shocked because they haven’t seen that type of lineup and rotation.”\n\n\r\n              Milton and Harris did most of the scoring on a 29-10 burst to open the second quarter for Philadelphia, and the Magic never got closer than 20 from there.\n\n\r\n              “Just having people down gives us an opportunity to step up, and I think everybody on the team is putting that in his thought,” said Milton, who shot 10 for 13. “We set the pace right out of the gate. The ball was really hopping tonight. Everybody got a touch, everybody was able to get in a rhythm.”\n\n\r\n              The 76ers scored 72 points in the paint.\n\n\r\n              “We didn’t play any (defense). That’s the reality of it right there,\" Magic coach Jamahl Mosley said. “It was more effort-based than anything.”\n\n\r\n              TIP-INS\n\n\r\n              76ers: C Embiid missed a fourth game with a mid-foot strain. He might play Monday night. ... G Maxey missed a fifth game due to a fractured foot. ... G Harden has missed seven games with a strained right foot tendon. ... Led by Reed and Montrezl Harrell, the 76ers had a 49-32 rebounding advantage. . . . Milton posted a plus/minus of plus-26 and Reed had a plus-28.\n\n\r\n              Magic: C Mo Bamba left the game with back spasms. ... An illness limited G Terrence Ross to eight minutes. ... G Markelle Fultz, who has yet to play this season due to a fractured toe, had his return delayed until at least Wednesday. ... G Jalen Suggs did not play after injuring his ankle Friday night. ... C Wendell Carter Jr. missed a fourth straight game with a foot injury. ... G Gary Harris got his first start of the season.\n\n\r\n              NO EXCUSES\n\n\r\n              Magic forward Moritz Wagner didn't want to hear about injuries as an explanation for the defensive collapse.\n\n\r\n              “Of course it's frustrating to be short-handed but everybody is,” Wagner said. “Look at the 76ers. They had nine guys today. A few of their main guys were out. That's not an excuse. You've got to keep grinding ... and that's a decision we've got to make. That's not a talent thing. I think it's an energy and effort thing.”\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Atlanta on Monday night.\n\n\r\n              kMagic: Play at Brooklyn on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994545.462475
}