{
  "game_id": "0022200868",
  "espn_id": "401469023",
  "date": "Feb 14, 2023",
  "matchup": "TOR vs. ORL",
  "headline": "Poeltl scores 30, Siakam has 26, Raptors beat Magic 123-113",
  "body": "TORONTO -- — Jakob Poeltl scored 30 points, Pascal Siakam had 26 and the Toronto Raptors beat the Orlando Magic 123-113 on Tuesday night for their fifth win in six games.\n\n\r\n              Scottie Barnes scored 17 points, Fred VanVleet had 10 points and a season-high 15 assists, and Precious Achiuwa had 11 points and 13 rebounds for the Raptors, who shot a season-best 60.2%.\n\n\r\n              Wendell Carter Jr. scored 26 points, Jalen Suggs had 24 off the bench and Markelle Fultz scored 19 points for the Magic.\n\n\r\n              Orlando came in having won three straight road games but couldn’t follow Monday’s win at Chicago with another victory. The Magic are 1-10 in the second game of back-to-backs.\n\n\r\n              A former Raptor who was reacquired from San Antonio last week, Poeltl shot 15 for 17 and added nine rebounds and six blocks.\n\n\r\n              “You see what he did tonight,” Magic coach Jamahl Mosely said. “He was a game changer.”\n\n\r\n              The 30 points were the most Poeltl has scored as a Raptors player. His career high is 31, set with San Antonio last Nov. 15 at Portland.\n\n\r\n              “It’s just about reacting to the defense,” Poeltl said. “They decided to trap Freddie a bunch of times. I’m comfortable catching the ball there at the top of the key and trying to make plays.”\n\n\r\n              Suggs said Poeltl hurt Orlando with his bruising, physical style.\n\n\r\n              “He’s a force in the paint,” Suggs said. “Trying to box him out, you can’t out-jump him. He’s really strong and physical in there. He fits what they want to do. He’s a physical big who’s going to hit you in your mouth and have no remorse about it.”\n\n\r\n              One game after setting a season best by allowing just five points off turnovers, the Raptors made a season-worst 20 miscues against the Magic, leading to 26 points. The Magic weren’t much better, making 19 turnovers that led to 29 points for Toronto.\n\n\r\n              “You can’t turn the basketball over and give up offensive rebounds and give yourself a chance,” Mosley said.\n\n\r\n              The Raptors outrebounded the Magic 40-29 and had a 13-9 edge on the offensive glass.\n\n\r\n              As the All Star break arrives, Orlando has gone 19-15 since a 5-20 start.\n\n\r\n              “I feel like we did a solid job from the beginning of the year to now of kind of changing the script of who the Orlando Magic are,” Carter said.\n\n\r\n              Orlando led 70-65 at halftime but Poeltl scored eight points in the third as Toronto took a 94-89 edge to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Magic: Paolo Banchero scored 13 points. … F Jonathan Isaac (left knee) sat as Orlando played the second game of a back-to-back. … G Cole Anthony (sore right wrist) missed his second straight game.\n\n\r\n              Raptors: Toronto is 13-0 all-time when shooting 60 percent or better. … Coach Nick Nurse returned after missing Sunday’s win over Detroit for personal reasons. … F Thad Young injured his left knee early in the second quarter and did not return. .. G Gary Trent Jr. (sore left calf) missed his second game while F O.G. Anunoby (sprained left wrist) missed his ninth straight. … Toronto had 13 assists on 16 made baskets in the first quarter, including seven assists from VanVleet.\n\n\r\n              MILESTONE MAN\n\n\r\n              Barnes reached 2,000 career points. At 21 years and 197 days, he’s the third-youngest player in Raptors history to reach the milestone, behind Tracy McGrady and Chris Bosh.\n\n\r\n              ROAD WORK AHEAD\n\n\r\n              After hosting the Pelicans in their first game following the All-Star break, Toronto plays seven of eight on the road, a testing stretch that includes games at Cleveland, Denver, and both Los Angeles teams.\n\n\r\n              OUT ON VALENTINE’S DAY\n\n\r\n              Toronto Mayor John Tory attended the game. Tory said last Friday that he would step down as mayor of Canada’s largest city after acknowledging an affair with a former staffer.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host Detroit on Thursday, Feb. 23.\n\n\r\n              Raptors: Host New Orleans on Thursday, Feb. 23.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994035.986469
}