{
  "game_id": "401809956",
  "espn_id": "401809956",
  "date": "Oct 25, 2025",
  "matchup": "ATL vs OKC",
  "headline": "Holmgren scores 31 points, Gilgeous-Alexander has 30 to lead Oklahoma City past the Hawks 117-100",
  "body": "ATLANTA -- — Chet Holmgren scored 31 points, Shai Gilgeous-Alexander had 30 and the reigning NBA champion Oklahoma City Thunder pulled away in the second half for a 117-100 victory over the short-handed Atlanta Hawks on Saturday night.\n\n\r\n              The Thunder improved to 3-0 on the season, getting off to another quick start after winning seven straight at the start a year ago on the way to a title.\n\n\r\n              Gilgeous-Alexander, the league's MVP last season. had another big night coming off a career-best 55-point performance in a 141-135 victory at Indiana on Thursday night. \n\n\r\n              Holmgren was 6 of 8 from beyond the 3-point stripe and grabbed 12 rebounds. Gilgeous-Alexander was nearly perfect on shots inside the arc, making 10 of 11. \n\n\r\n              After going to double-overtime to win its first two games, the Thunder didn't need any extra time to finish off an Atlanta squad that was missing three starters. \n\n\r\n              Kristaps Porzingis (flu-like symptoms) and Zaccharie Risacher (right ankle sprain) each missed their second straight game. They were joined on the bench by Jalen Johnson, who sprained his right ankle in a victory at Orlando the previous night.\n\n\r\n              The game was tight through most of the first half, though Oklahoma City never trailed. The Thunder began to pull away from a 60-55 halftime lead by scoring the first eight points of the third quarter. \n\n\r\n              Gilgeous-Alexander knocked down a pull=up jumper and converted a three-point play before Holmgren connected from long range.\n\n\r\n              Nickeil Alexander-Walker led the Hawks with 17 points. Atlanta has lost its first two home games of the season by a combined 37 points, sandwiched around the road victory over the Magic. \n\n\r\n              Oklahoma City point guard Cason Wallace got a chance to go against his older brother, Keaton, a backup guard for the Hawks. Cason was held to three points, while Keaton Wallace managed five. \n\n\r\n              Up next\r\n              Thunder: Wrap up a three-game road trip when they face the Dallas Mavericks on Monday. \n\n\r\n              Hawks: Travel to Chicago to face the Bulls on Monday in the start of a four-game road trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042499.282454
}