{
  "game_id": "0022200806",
  "espn_id": "401468961",
  "date": "Feb 05, 2023",
  "matchup": "DEN @ MIN",
  "headline": "Timberwolves cruise to 128-98 win against Jokic-less Nuggets",
  "body": "MINNEAPOLIS -- — D’Angelo Russell had 14 of his 18 points in the first quarter and added 10 assists, Anthony Edwards scored 20 and the Minnesota Timberwolves cruised to a 128-98 win Sunday night against the Denver Nuggets, who were missing two-time MVP Nikola Jokic and three other starters on the second night of a back-to-back.\n\n\r\n              Rudy Gobert had 16 points for Minnesota, which never trailed and opened a 20-point advantage in the second quarter on the way to a seventh win in 10 games.\n\n\r\n              “We were very business-like,” Timberwolves coach Chris Finch said. “Took advantage of the opportunity that was there for us. I think we only had like three or four turnovers in the first half. That’s kind of been important to our focus. And I thought we made a lot of really good plays.”\n\n\r\n              Along with Jokic (left hamstring tightness), Denver was without Jamal Murray (left knee injury management), Aaron Gordon (left ankle sprain) and Kentavious Caldwell-Pope (right ankle sprain), who didn’t travel after playing in the Nuggets’ 128-108 win at home against Atlanta the previous night.\n\n\r\n              Michael Porter Jr., the lone regular starter in the lineup, led Denver with 22 points. Christian Braun added 19 points for the Nuggets. Denver shot just 39.5% from the field and committed 14 turnovers in the first half, trailing by 25 at one point.\n\n\r\n              “Without four starters, you have to almost play perfect to give yourself a chance,” Nuggets coach Mike Malone said. “Turnovers fueled their break, 24 fast-break points. Just too many breakdowns on both ends of the floor for us to even have a chance to be competitive tonight.”\n\n\r\n              Without Jokic and Murray, and choosing not to play Bones Hyland, Denver was without a primary ball-handler. Bruce Brown, a reserve swingman, was the de facto point guard. He finished with 16 points and seven assists.\n\n\r\n              The Nuggets finished with a season-high 21 turnovers leading to 32 points for Minnesota.\n\n\r\n              “We’re just playing free and easy but, obviously, a little bit too free and a little bit too easy, at times,” Malone said.\n\n\r\n              Meanwhile, Minnesota did what it needed to do against a short-handed team, controlling play from the beginning.\n\n\r\n              The Timberwolves went on a 25-5 run from the end of the first quarter and start of the second, and never looked back.\n\n\r\n              “In games like these, you kind of play down to the competition,” said Minnesota forward Jaden McDaniels, who had 14 points. “So, just made it seem like all their starters were out there and just playing with aggression.”\n\n\r\n              QUICK TURNAROUND\n\n\r\n              Malone called the timing and travel of the back-to-back to Minnesota “ridiculous” before the game, pointing out there were just 22 hours between tip-offs.\n\n\r\n              “When I told our players that, a veteran like Jeff Green looked at me like I was crazy,” Malone said before the game. “He said, ‘That’s not allowed. That’s not legal.’ And, obviously, it is.”\n\n\r\n              Malone said he “hopes” that all four starters will return for the next game.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Hyland, who is rumored to potentially be on the move prior to Thursday’s trade deadline, didn’t play despite the lack of a primary ball handler. … Jokic had played four games in a row but did miss four games in January. … Braun, Brown, Vlatko Cancar and DeAndre Jordan were the fill-in starters.\n\n\r\n              Timberwolves: Backup point guard Jordan McLaughlin returned after missing 30 games with a left calf strain. … Starting forward Kyle Anderson left the game with a recurrence of back spasms. He didn’t play in the second half after playing less than five minutes in the previous game due to the injury. … Austin Rivers served the first of his three-game suspension for his part in Friday’s fight between Minnesota and the Orlando Magic. ... The Wolves had 72 points in the paint.\n\n\r\n              UP NEXT\n\n\r\n              The two teams play Tuesday in Denver.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994693.1687932
}