{
  "game_id": "0021600402",
  "espn_id": "400899844",
  "date": "Dec 17, 2016",
  "matchup": "LAL @ CLE",
  "headline": "LeBron scores 16 in fourth as Cavs outlast Lakers 119-108",
  "body": "CLEVELAND --  One game off and few days of rest refreshed the Cavaliers' Big 3.\n\nLeBron James scored 16 of his 26 points in the fourth quarter, Kyrie Irving matched a career high with 12 assists, Kevin Love scored 27 with 17 rebounds and Cleveland finally put away Los Angeles in the fourth quarter, beating the young Lakers 119-108 on Saturday night.\n\nThe Cavs were back at full strength after coach Tyronn Lue left James, Love and Irving behind earlier this week for a game in Memphis, a decision that sparked some criticism as fans were denied a chance to see the three stars and Cleveland lost.\n\nIrving, who complained of tired legs before a game last week, looked more like himself in his first game since Dec. 10, finishing with 21 points as the Cavs improved to 19-6.\n\n\"It was just a needed rest for me,\" said Irving, who didn't get a break after Cleveland won the NBA title in June because he played for the U.S. Olympic team. \"For me, it's just about being smart and not running into that wall completely. I'm able to push through anything and my mind commands my body at the same time, it's still about being smart.\"\n\nJames, Irving and Love combined for 74 points, 30 rebounds and 25 assists.\n\nJames, who missed the end of pregame warmups, national anthem and player introductions before running onto the floor just before the opening tip, took over in the fourth and needs just two points to move past Moses Malone (27,409) for eighth place on the career scoring list.\n\nNick Young made eight 3-pointers and scored a season-high 32 for the Lakers, who snapped an eight-game losing streak on Friday in Philadelphia and were a headache for the defending NBA champions all night.\n\nThe Lakers were still within 110-105 when James hit a 3-pointer in transition as the Cavs closed with a 10-3 run.\n\n\"Even though we lost, I liked the way we played and what we did,\" said Julius Randle, who added 16 points. \"They're a championship team, and we were right there with them until the end.\"\n\nJordan Clarkson scored 20 points and Los Angeles rookie Brandon Ingram missed a triple-double by one point and an assist.\n\nChanning Frye and James each hit a 3 to help Cleveland to a 95-86 lead early in the fourth quarter, but the Lakers refused to give in and were right there when James pulled up and knocked down his crucial  3 with 2:32 left.\n\n\"I was just in rhythm in the fourth quarter,\" James said before explaining his reason for taking a risky shot. \"That's the time when a defense is at its relaxed point, bringing the ball up in transition and they really don't think you're going to take that shot. I was in a great groove and I felt good when I let it go and I was able to knock it down.\"\n\nRING TIME\n\nBefore receiving his NBA championship ring, Lakers center Timofey Mozgov, who spent 1 1/2 seasons with Cleveland, was mobbed by the Cavaliers at mid-court.\n\n\"I was really proud to be with this team, it was everything I could ask for,\" said Mozgov, who received a nice ovation from Cleveland fans and visited the Cavs locker room postgame. \"It was a happy memory, and I was excited all night.\"\n\nHOMECOMING\n\nLakers forward Larry Nance Jr., who grew up outside Cleveland, played in his first regular-season game in his home state. His father, longtime Cavaliers forward Larry Nance, had his No. 22 retired by the franchise.\n\n\"It was really cool playing underneath my dad's jersey,\" said Nance Jr., who scored two points in 27 minutes. \"I tried to approach it as a regular game, but anytime you play at home, it means a little more.\"\n\nNance Sr. attended the game.\n\nJ.R.'S SHIRT\n\nJ.R. Smith -- known more for the shirts he hasn't worn -- drew attention for his postgame attire. The Cavs guard wore a black T-shirt that read, \"Cleveland. It's not that bad. Have a beer!\"\n\nTIP-INS\n\nLakers: G D'Angelo Russell was inactive with a sore left knee that has bothered him most of the season. He scored 15 in Friday's win. ... Coach Luke Walton was an assistant with Golden State last season and said he has yet to watch Cleveland's Game 7 win in the NBA Finals. \"You don't get over losing Game 7,\" he said. \"You're happy for the guys here, but it sticks with you for the rest of your life.\"\n\nCavaliers: Cleveland has won five straight over the Lakers. ... The Cavs have won 25 of their last 29 at home against Western Conference teams. ... Lue said he and general manager David Griffin are still discussing roster options after C Chris \"Birdman\" Andersen sustained a season-ending -- and likely career-ending -- knee injury in practice Friday. The Cavs have been looking to add a backup point guard, but may now also be in the market for a big.\n\nUP NEXT\n\nLakers: Continue their six-game trip at Charlotte on Tuesday.\n\nCavaliers: At Milwaukee on Tuesday before hosting the Bucks on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995422.12615
}