{
  "game_id": "0022000137",
  "espn_id": "401267297",
  "date": "Jan 09, 2021",
  "matchup": "MIL vs. CLE",
  "headline": "Bucks beat Cavaliers 100-90 without injured Antetokounmpo",
  "body": "MILWAUKEE -- — Khris Middleton scored 27 points and the Milwaukee Bucks withstood the absence of two-time reigning MVP Giannis Antetokounmpo to beat the Cleveland Cavaliers 100-90 on Saturday night.\n\n\r\n                    Antetokounmpo sat out with back spasms after taking a hard fall one night earlier in a loss to the Utah Jazz.  Middleton, an All-Star each of the last two seasons, continued his habit of putting up big numbers whenever Antetokounmpo is sidelined.\n\n\r\n                    “The ball's probably in his hands a little bit more on a night like tonight,” Bucks coach Mike Budenholzer said. “When a teammate is down, he's a guy that wants to be there to help not just pick up that guy but the whole group. It's certainly been a trend for him. It's just a testament to how good he is.”\n\n\r\n                    Bobby Portis replaced Antetokounmpo in Milwaukee’s starting lineup and scored 17 points as the Bucks (6-4) closed a five-game home stretch in which they went 4-1. After Jrue Holiday made the game’s first basket, Portis scored the Bucks’ next 10 points.\n\n\r\n                    The Bucks overcame a huge performance from Cleveland’s Andre Drummond, who had 26 points and 24 rebounds. Drummond was the first Cavalier to have at least 20 points and 20 rebounds in the same game since Anderson Varejao did it against Boston on Jan. 31, 2012.\n\n\r\n                    “When he's the initiator of the force, there's nobody in the league who can guard him,” Cavaliers coach J.B. Bickerstaff said. “I think we saw that tonight and against Memphis (a 94-90 win on Thursday). When he decides to put his chin down and play with that force, he's unguardable.”\n\n\r\n                    Cleveland (5-5) needed a big night from Drummond because it was missing so many weapons as it completed a six-game road swing.\n\n\r\n                    Collin Sexton, who averages a team-high 25.1 points, missed a second straight game with a sprained left ankle. Other sidelined Cavaliers included Kevin Love (strained right calf), Matthew Dellavedova (concussion), Dante Exum (strained right calf), Darius Garland (sprained right shoulder), Kevin Porter Jr. (personal reasons) and Dylan Windler (fractured left hand).\n\n\r\n                    Damyean Dotson scored 21 and Larry Nance Jr. added 17 for Cleveland. Holiday had 15, D.J. Wilson scored 12 and Donte DiVincenzo added 11 for Milwaukee.\n\n\r\n                    “I can’t say enough about what these guys are doing,” Bickerstaff said. “They’re many men down, and they haven’t used it as an excuse. They just continue to go out and scrap, continue to go out and fight. We came up short tonight, but I’m proud of their effort and the way they fought.”\n\n\r\n                    Cleveland rallied from a 19-point deficit to tie the game late in the second quarter, but Milwaukee closed the first half with a 10-0 run and led the rest of the way despite posting its lowest point total of the season.\n\n\r\n                    “Great teams, they don’t just win a game one way,” Middleton said. “They can win it in many different styles. The key thing is to win those games, no matter what.”\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: Bickerstaff said before the game that Cleveland’s short-handed roster means the Cavs must “make the game as ugly as we possibly can” by winning with defense. The Cavs became the first team to hold Milwaukee below 108 points this season, but they didn't have nearly enough offense to win the game.\n\n\r\n                    Bucks: Wilson had fallen out of the Bucks’ rotation and hadn’t played in their last three games, but he got an opportunity Saturday and capitalized. He shot 5 of 9 from the floor in his 16-minute stint. ... Pat Connaughton returned to action after missing three games with a groin injury. He scored six points in 11 minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Host the Memphis Grizzlies on Monday in their first home game since Dec. 29. \n\n\r\n                    Bucks: Visit the Orlando Magic on Monday in a rematch of a first-round playoff series Milwaukee won in five games last season.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997657.5694249
}