{
  "game_id": "0021200464",
  "espn_id": "400278184",
  "date": "Jan 02, 2013",
  "matchup": "POR @ TOR",
  "headline": "Terrence Ross scores career-high 26 in Raptors' win",
  "body": "TORONTO --  The last time they played Portland, the Toronto Raptors were at their worst. On Wednesday night, they showed just how much they've turned things around.\n\nTerrence Ross scored a career-high 26 points, DeMar DeRozan had 24 and the Raptors snapped an eight-game losing streak against Portland by beating the Trail Blazers 102-79.\n\n\"This team beat us by a lot last time,\" Ross said. \"We had to get our revenge.\"\n\nRoss and the Raptors were bent on reversing what happened in their most recent meeting with the Blazers: an 18-point loss at Portland on Dec. 10, the final game in an 0-5 road trip in which starters Kyle Lowry and Andrea Bargnani left injured, Amir Johnson was ejected for throwing his mouthguard at a referee and the Blazers won despite setting an NBA record for shooting futility, missing all 20 of their 3-point attempts.\n\n\"They hit bottom when they came to Portland,\" Blazers coach Terry Stotts said before the rematch.\n\nThings sure have changed. This was Toronto's eighth win in nine games, a surge that has wiped out talk of coaching changes and locker room discord.\n\n\"That was one of our low points of the season,\" Raptors coach Dwane Casey said of the December blowout in Oregon. \"Two star players getting hurt, everybody kind of looking at each other crossways, the whole organization, everybody talking about firings.\n\n\"That was a crossroads for us,\" Casey continued. \"Our guys looked in the mirror, we all did, and decided 'Hey, we can't continue this way.' We started playing the game the right way, sharing the basketball, putting more focus on the defensive end. \"We're a totally different team today, with our approach, than we were then.\"\n\nEd Davis had 19 points and Johnson 17 in Toronto's first victory over the Trail Blazers since a 116-109 double-overtime win on Jan. 13, 2008.\n\nRoss had a career-best six 3-pointers as the Raptors opened their season-high six-game homestand in style, never trailing and leading by as many as 25.\n\n\"They were a lot more aggressive,\" Portland's Damian Lillard said. \"Guys were in attack mode from start to finish. They played with a lot of confidence. They've been on a streak and you can tell that they're starting to believe.\"\n\nDavis and DeRozan were the only two starters to score for the Raptors. Along with Landry Fields (seven points), Johnson and Ross, no other Toronto player scored until the fourth quarter.\n\nJose Calderon had 13 assists and Kyle Lowry had nine for Toronto.\n\n\"We owed them a little bit,\" Calderon said.\n\nLillard led Portland with 18 points while LaMarcus Aldridge had 14 points and 10 rebounds. Wesley Matthews had 12 points and Nicolas Batum scored 10 for the Trail Blazers, who were coming off a 105-100 victory at New York on Tuesday night.\n\n\"This is a different team,\" Batum said of the Raptors. \"This is not the same team I saw (in December). It's crazy when I watched the video this morning and then watched the game tonight. This is a new team.\"\n\nToronto jumped out to a 10-0 lead and led 24-17 after one thanks to 10 points each from Davis and DeRozan.\n\n\"We didn't play well from the opening tip,\" Stotts said. \"We were on our heels the whole night.\"\n\nRoss hit 3-pointers on three consecutive possessions midway through the second, then made his fourth on a buzzer beating shot to give Toronto a 55-39 lead at the half.\n\n\"People think he's just athletic but he can do a lot of things,\" Calderon said of Ross. \"He's getting more confidence out there and he's doing more things every day.\"\n\nDavis scored nine points in the third and DeRozan had eight as the Raptors took a 78-61 edge into the final quarter.\n\nGame notes Ross's previous career-high was 19, set Nov. 27 at Houston. ... Bargnani remains sidelined with a torn ligament in his right elbow. Casey said Bargnani must undergo another MRI before the team sets a timetable for his return. There is currently no date for that exam. ... Toronto F Linas Kleiza (sore right knee) did not dress. ... Lillard was named rookie of the month for December after leading all rookies in scoring with 18.4 points per game. ... Portland assistant Jay Triano was Toronto's head coach from 2008 to 2011.",
  "source": "espn_api",
  "crawled_at": 1764993486.179841
}