{
  "game_id": "0021600204",
  "espn_id": "400899654",
  "date": "Nov 21, 2016",
  "matchup": "MIL vs. ORL",
  "headline": "Antetokounmpo gets triple-double, Bucks beat Magic 93-89",
  "body": "MILWAUKEE --  Giannis Antetokounmpo's sixth career triple-double put him in elite company.\n\nAntetokounmpo had his first triple-double of the season to lead the Milwaukee Bucks over the Orlando Magic 93-89 on Monday night.\n\n\"It was a good one,\" Antetokounmpo said. \"We got the win, so it feels great. It feels even better.\"\n\nMilwaukee snapped a three-game losing streak as Antetokounmpo finished with 21 points, 10 rebounds, 10 assists, five steals and three blocks -- a line matched only by Michael Jordan and Hakeem Olajuwon.\n\n\"I think we all know he can fill up a stat sheet, but now the next thing is filling up a stat sheet in a way that leads to wins,\" Milwaukee coach Jason Kidd said. \"Understanding that we ask a lot from him and expect a lot, but he's only 21 years old.\"\n\nJabari Parker also had 22 points and made five 3-pointers -- he began the night with a total of 10 -- for the Bucks, who beat Orlando at home for the eighth time in nine tries.\n\nThe Magic were led by Serge Ibaka's 21 points, and Elfrid Payton added 18 but had five of Orlando's 24 turnovers. The team was averaging 13 turnovers per game but had 19 in the first half.\n\n\"We've done a great job with that all year,\" Orlando coach Frank Vogel said. \"We're a good ball-security team, one of the best in the league. This team plays a unique defense where they're going to trap and rotate. They play differently than most teams. And we didn't handle it well.\"\n\nThe score was tied at 85 before Matthew Dellavedova sank a 3-pointer and Antetokounmpo added a dunk for a five-point lead with 2:38 remaining.\n\nShortly after Antetokounmpo blocked a shot by Ibaka, Parker missed a desperate 3-point try as the shot clock was about to expire and was fouled by Ibaka. He made one free throw for a 91-87 lead with 17.9 seconds left.\n\nParker then stole the ball from Ibaka and sailed in for another dunk and a 93-87 lead with 8.7 seconds to go.\n\nOrlando opened the game with a 16-2 run but trailed at halftime 49-44 after Parker's layup at the buzzer. The Magic led by five, however, at the end of the third quarter thanks to a 12-0 run to end the frame.\n\nMilwaukee opened the fourth by scoring 16 of the first 18 points and took its biggest lead, 85-76, on two free throws by Malcolm Brogdon with 7:52 to go. Orlando responded by scoring the next nine points to tie the score at 85 with 4:24 left.\n\nTIP-INS\n\nMagic: Orlando is 0-5 against Central Division opponents and all five games have been on the road. ... The Magic began the night 29th in the NBA in scoring with 92.5 points per game.\n\nBucks: Michael Beasley scored 10 points in the first quarter -- he entered the game averaging 8.0 points per game. ... A Milwaukee fan sank a halfcourt shot in the fourth quarter to win $5,000.\n\nTOUGH FOURTH\n\nOrlando shot 21.7 percent (5 of 23) in the final quarter, and Evan Fournier was the only Magic player with more than two points (he had five).\n\nMINUTES SHRINKING\n\nMilwaukee's Greg Monroe played over eight minutes and finished with two points. In his team's last four games, the second-year Buck played a total of less than 19 minutes -- he did not play against Miami -- and scored eight points.\n\nTIGHT SERIES\n\nEntering the game, the series between Milwaukee and Orlando was tied, 50-50, and each team was 35-15 at home.\n\nUP NEXT\n\nMagic: Orlando begins a three-game homestand Wednesday night against Phoenix.\n\nBucks: Milwaukee hosts Toronto on Friday night and is 1-10 in its last 11 games against the Raptors.",
  "source": "espn_api",
  "crawled_at": 1764995218.163389
}