{
  "game_id": "0021800804",
  "espn_id": "401071477",
  "date": "Feb 06, 2019",
  "matchup": "BKN vs. DEN",
  "headline": "Russell scores 27, Nets hit 19 3s and beat Nuggets 135-130",
  "body": "NEW YORK --  Kenny Atkinson insisted before the game that his Nets didn't need more shooting, even though lately they were only good at missing.\n\nThe Denver Nuggets sure wouldn't argue with him.\n\nD'Angelo Russell had 27 points and 11 assists, and Brooklyn surpassed last season's win total with a 135-130 victory over Denver on Wednesday night.\n\nRussell made six of the Nets' 19 3-pointers, one game after they made only five as a team in their poorest shooting performance of the season.\n\n\"We broke out of our shooting slump. I think that was evident,\" Atkinson said. \"We really shot the heck out of the ball.\"\n\nDeMarre Carroll added 18 points, 10 rebounds and six assists for Brooklyn (29-27), which got two key injured players back and snapped a three-game skid. Joe Harris scored 17 points and Treveon Graham had 16, with four 3-pointers.\n\n\"Obviously any time you have a game like we did the last outing where we struggled to shoot the ball, it feels good once you start seeing them go in,\" Harris said. \"And then shooting is contagious, so once one guy gets it rolling, it seemed like everybody else was able to find a rhythm and get some good confidence.\"\n\nNikola Jokic had 25 points, 14 rebounds and 10 assists in his 10th triple-double of the season for the Nuggets, who have lost two straight games to fall out of a tie for the Western Conference lead.\n\nMason Plumlee scored a season-high 24 points on 10-for-12 shooting against his former team, and Jamal Murray had 19 points and 11 assists after missing six games with a sprained left ankle.\n\nNuggets coach Michael Malone yanked his starters in the third quarter, when the Nets blew open the game.\n\n\"This game is a game of mistakes. You're going to make mistakes, you're going to make shots, things are going to happen,\" he said. \"But when you're out there going through the motions, that is one thing I can't stand to watch and will not stand to watch.\"\n\nBrooklyn had failed to score 100 in its previous two games and had season lows of 32 percent shooting overall and 11.9 percent (5 for 42) from 3-point range in a 113-94 loss to Milwaukee on Monday.\n\nThe Nets made 13 of their first 18 attempts from behind the arc against the Nuggets. Harris, who missed the last game with a sore right hip, hit three 3s, and Allen Crabbe came off the bench to hit his first 3-point attempt after missing 26 games with a sore right knee.\n\nLooking to bounce back from a 129-103 loss at Detroit on Monday, Denver scored the first eight points and raced to a 16-5 lead. But it was down to five by the end of the first quarter, and it was clear by then it was going to have trouble stopping the Nets.\n\n\"We kind of had the lead in the first quarter but I don't know,\" Jokic said. \"Something probably happened in our heads. I don't know. Something happened.\"\n\nBrooklyn was 7 of 9 from behind the arc in a 42-point second quarter, and then opened the third with a 12-4 run to push the lead to 84-64.\n\nTIP-INS\n\nNuggets: Plumlee was 7 for 7 in the first quarter. ... Gary Harris missed his fourth consecutive game with a strained right groin. Paul Millsap missed his second straight with right ankle soreness. ... Malone, a New York native, said his parents would be at the game. His father, Brendan, coached 28 years in the NBA.\n\nNets: Shabazz Napier, 0 for 10 behind the arc on Monday, hit both 3-point attempts and had 10 points and 11 assists in his first career double-double. ... Atkinson said Caris LeVert, nearing a return from a dislocated right foot, practiced again with the Nets' NBA G League affiliate. He will be evaluated Thursday.\n\nPICK A WINNER\n\nMalone will coach Team LeBron in the All-Star Game on Feb. 17. LeBron James will draft his roster for the team on Thursday, and Malone was asked if he will watch when the results are unveiled to see if the captain picked him a good team.\n\n\"I think it's hard not to get good players. I mean, it's the 24 best players in the world -- now 26 because of Dirk (Nowitzki) and Dwyane Wade,\" Malone said. \"So I haven't sent LeBron my suggestions. I just hope that we get Nikola Jokic on our team because we really need to go through that game and that weekend with the future of that team.\"\n\nNETS' PROGRESS\n\nAtkinson said surpassing last year's win total was real progress, and the playoff-contending Nets weren't surprised they could snap out of their slump against one of the league's top teams.\n\n\"I think we all understand what we can do. We know that we can compete with any team and I thought we were changing that perception about us,\" Crabbe said. \"You're playing the Nets tonight, now I think everybody has an idea that we mean business and I think that we just never stop.\"\n\nUP NEXT\n\nNuggets: Visit Philadelphia on Friday.\n\nNets: Host Chicago on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995398.758098
}