{
  "game_id": "0021500625",
  "espn_id": "400828512",
  "date": "Jan 19, 2016",
  "matchup": "MIL @ MIA",
  "headline": "Bucks take advantage of short-handed Heat, top Miami 91-79",
  "body": "MIAMI -- Perhaps Dwyane Wade taught Khris Middleton too well last summer.\nMiddleton scored 22 points, Greg Monroe added 15 points and 10 rebounds and the Milwaukee Bucks clamped down defensively on Wade and short-handed Miami throughout, beating the Heat 91-79 on Tuesday night.\nGiannis Antetokounmpo scored 14 points for Milwaukee, which has now beaten Miami five consecutive times.\n\n\"We were getting stops and getting out and running,\" Bucks interim coach Joe Prunty said. \"The fast-break points weren't necessarily high for either team, but ... the stops were really the catalysts.\"\nHassan Whiteside scored 23 points and grabbed 18 rebounds for Miami, which has dropped two straight and trailed by at least 22 in each of those games. Chris Bosh scored 23 and Luol Deng added 11 for the Heat.\n\"We obviously have to work on our mental toughness right now,\" Bosh said. \"We're kind of weak in that area.\"\nThe Heat were without four injured players, including point guards Goran Dragic and Beno Udrih. The offense struggled mightily without them, as Miami shot a season-low 36.5 percent and failed to score 80 for the second straight game.\n\"We saw the same thing you saw,\" Heat coach Erik Spoelstra said. \"A pretty flat performance.\"\nWade, playing through shoulder pain, finished with only two points on 1-for-6 shooting in 21 minutes. It was only the third time in Wade's 973-game career, including playoffs, that he logged at least 20 minutes and didn't score more than two points.\n\"When don't have your whole team out there it's tough on everyone, game to game, night to night,\" Wade said. \"We've got figure it out and got to weather the storm.\"\nWade and Middleton crossed paths over the summer, introduced by mutual friends who suggested the Milwaukee guard should reach out to the three-time NBA champion for some guidance. Middleton called, Wade agreed, they worked out together with trainer Stan Remy and Wade came away impressed.\n\"Talking to him, and him letting me know how he approaches the game and what he's thinking in certain situations, it's helping me out tremendously,\" Middleton said.\nThe Heat were also without Josh McRoberts and Chris Andersen, both sidelined by knee problems with no returns in sight. Milwaukee was again without O.J. Mayo (left hamstring) and Greivis Vasquez (right ankle), not to mention coach Jason Kidd (hip surgery).\nMiami's last lead was 32-31 midway through the second quarter. Milwaukee closed the half on an 18-7 run, led 49-39 at the break and then outscored Miami 26-18 in the third to pull away.\n\"Our rotations were right,\" Middleton said.\nTIP-INS\nBucks: Middleton played in his 117th consecutive regular-season game, a streak that started in Miami on Nov. 16, 2014. He's the only Milwaukee player to appear in all 44 games so far this season. ... The Bucks came into Tuesday averaging 54 first-half points allowed in road games. They held Miami to 39 in the first two quarters.\nHeat: Glenn Frey's \"The Heat Is On\" has been an anthem at Miami games since the franchise's inception in 1988, and the Heat paid tribute to the singer who died Monday by letting it blare throughout the arena for the entirety of the game's first time-out. \"An iconic song,\" Spoelstra said. ... Miami isn't home again until Jan. 31.\nCOURTSIDE CHAMPIONS\nPlenty of champions were courtside for the game.\nJuan Pierre, who helped the then-Florida Marlins to the 2003 World Series title, was in attendance. So was Miami resident Alex Rodriguez, who got his World Series ring with the New York Yankees in 2009, and undefeated retired boxer Floyd Mayweather.\nSCHEDULE QUIRK\nThe visiting team was right at home, and the home team was barely home at all.\nMilwaukee is in the midst of a four-night stay in South Florida. The Heat were only home for two nights -- less than 48 hours, really -- with Tuesday's game being their lone home outing between six- and five-game trips. They were leaving on a flight to Washington shortly after Tuesday's game, while the Bucks were staying behind for one last night in Miami.\nMilwaukee will practice in Miami on Wednesday, then fly to Houston.\nUP NEXT\nBucks: At Houston on Friday night.\nHeat: At Washington on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994053.114444
}