{
  "game_id": "0022100089",
  "espn_id": "401359913",
  "date": "Oct 31, 2021",
  "matchup": "SAC @ DAL",
  "headline": "Luka Doncic hits long 3, Mavericks holds off Kings 105-99",
  "body": "DALLAS -- — Luka Doncic made a 36-foot 3-pointer to beat the shot clock and blunt a late Sacramento rally and finished with 23 points in the Dallas Mavericks’ 105-99 victory over the Kings on Sunday.\n\n\r\n                    The Kings cut a 12-point deficit to 92-89 with 4:53 to play. With about two seconds left on the 24-second clock, Doncic hit the 3 from the rim of the center-court logo after dribbling the ball off a defender’s foot to move him back behind the midcourt line.\n\n\r\n                    “I’m confident in all my 3s,” said Doncic, who missed his other six attempts from behind the line. “That shot goes in, but then all my normal shots can’t go in. I’ve got to work on those normal shots.”\n\n\r\n                    “That was a big-time shot,” Mavericks coach Jason Kidd said. “I think we all know he has that type of range.”\n\n\r\n                    “I’d take our odds with him shooting a 40-footer, and he made it,” Kings coach Luke Walton said. “So, give him credit. It was actually a good defensive possession for us up to that point.”\n\n\r\n                    Tim Hardaway Jr. added 16 points to help the Mavericks rebound from a 31-point loss in Denver on Friday night. Dallas lost three meetings with Sacramento last season.\n\n\r\n                    “They took care of business every single time they played us last year,” Hardaway said. “We just wanted to do a great job of putting out foot down.”\n\n\r\n                    Richaun Holmes had 22 points and 13 rebounds for Sacramento, and Harrison Barnes added 15 points. The Kings lost for the first time in four road games this season.\n\n\r\n                    Doncic shot 10 for 21 from the floor and had eight rebounds and 10 assists.\n\n\r\n                    The Mavericks were 12 for 37 behind the arc, and the Kings 7 for 36.\n\n\r\n                    Maxi Kleber made his first start of the season for Dallas in place of Kristaps Porzingis, who missed his third straight game with lower back tightness. But Kleber — who had seven points and five rebounds in seven minutes, strained his back late in the first quarter and didn’t return.\n\n\r\n                    RARE FAST START FOR DALLAS\n\n\r\n                    The Mavericks broke to a 22-7 lead and led 31-22 after one period. That was quite a contrast to the team that never led after the opening period in its first five games and was outscored by a collective 31 points in those games.\n\n\r\n                    Walton said his team came out soft. He turned to a four-guard unit with reserve big man Tristan Thompson, who scored eight points in the first quarter and finished with 13 points and five rebounds.\n\n\r\n                    “Tristan with the rest of that second unit came in and at least got us to back to where we’d been playing (in previous games),” Walton said, “which is a physical, fighting, scrapping style of basketball”.\n\n\r\n                    HEY, SMALLS!\n\n\r\n                    With Porzingis out again and Kleber sidelined after the first quarter, Ntilikina, Bullock and Sterling Brown were called upon to bolster Dallas’ inside play.\n\n\r\n                    “All the smalls got excited,” Kidd said. “I understand Sacramento’s not a big team. Everybody’s going to have to participate in helping on our interior, rebounding. We don’t want to play like that all the time but we understand that sometimes injuries happen.”\n\n\r\n                    TIP-INS\n\n\r\n                    The Kings came in averaging 111 points per game, 11th in the NBA, and were held to their season low. … The Mavericks outscored the Kings 13-1 on fast-break points. … Doncic picked up his first technical foul of the season midway through the third quarter, with Tyrese Halliburton hitting the free throw and Barnes following with a dunk that gave Sacramento a 60-59 lead, its only lead of the game. … The Kings sought their first 4-0 road start since moving to Sacramento in 1985.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: At Utah on Tuesday night.\n\n\r\n                    Mavericks: Host Miami on Tuesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764993906.0974789
}