{
  "game_id": "0021401129",
  "espn_id": "400579421",
  "date": "Apr 03, 2015",
  "matchup": "MIL @ BOS",
  "headline": "Ilyasova leads 3rd-quarter surge, Bucks top Celtics 110-101",
  "body": "BOSTON -- The Milwaukee Bucks needed a second-half comeback to avoid their 12th straight road loss. Just 3 minutes into their dominant third quarter they had a lead they never lost.\nErsan Ilyasova led Milwaukee's 18-2 surge in the quarter with 11 points and the Bucks hurt the Boston Celtics' playoff chances with a 110-101 win Friday night.\n\"Our defense, getting stops and then also our pace\" produced the spurt, Bucks coach Jason Kidd said.\n\nMilwaukee's first road win in two months kept them in sixth place in the Eastern Conference with a 2 1/2-game lead over Brooklyn, which beat Toronto. The Bucks' last win away from home was on Feb. 2 when they beat Toronto 82-75.\nThis was their first road win since obtaining Michael Carter-Williams from Philadelphia on Feb. 19.\n\"We knew this was a big one,\" said Carter-Williams, who had eight points and six turnovers but added seven assists, five steals and two blocks. \"I'm glad to be on this team and to have a chance to be in the playoffs.\"\nBoston dropped a half-game behind idle Miami in the competition for the eighth and final playoff spot in the Eastern Conference with six games left.\nO.J. Mayo led Milwaukee with 24 points. Boston was led by Isaiah Thomas with 23 and Avery Bradley and Jonas Jerebko with 17 each.\nTrailing 52-50 at halftime, the Bucks outscored the Celtics 36-23 in the third quarter and took an 86-75 lead. They went ahead for good, 57-56, on a short jumper by Zaza Pachulia with 2 1/2 minutes gone in the period. That started the 18-2 run made it 73-58 with just under 5 minutes left in the quarter.\n\"We just weren't aggressive on the defensive end and we just weren't playing hard enough\" in the third quarter, Bradley said. \"They were really getting whatever they wanted.\"\nThe Celtics pulled to 86-82 by scoring the first seven points of the fourth quarter but came no closer.\nThey hoped to get a boost from the surprising return of forward Jared Sullinger from a stress fracture in his left foot. The Celtics said on Feb. 22 that the injury would sideline him for the season. He entered the game about 4 minutes into the third quarter, missed both his shots and didn't return as part of a gradual effort to improve his stamina.\n\"Just a little late on things, but (I) felt good overall,\" said Sullinger, the team's leading scorer and rebounder.\nMayo scored 20 points in the first half, but the Bucks still trailed by two.\n\"He wasn't just scoring,\" Kidd said, \"but actually finding guys that were open and they were knocking down shots.\"\nGiannis Antetokounmpo tied it with the first basket of the second half. Boston took its last lead at 56-55 on a basket by Brandon Bass.\nThat's when the Bucks pulled away by scoring the next 12 points and 18 of the next 20. Pachulia began the run with his layup, Ilyasova got the next seven points, Pachulia made a free throw and Ilyasova capped the 12-0 spurt with an 18-footer.\nAfter Boston scored the last four points of the third quarter and first seven of the fourth to cut the lead to four, Milwaukee regained control on consecutive layups by Pachulia and Jared Dudley for a 90-82 lead with about 10 minutes remaining. The Bucks led by six to 11 points the rest of the way.\n---\nTIP-INS\nBucks: Kidd said \"everything is going well\" with rookie Jabari Parker's recovery from a season-ending left knee injury sustained on Dec. 15. \"We made sure that we kept him around the team, didn't want to disconnect. He looks extremely well,\" Kidd said. ... Milwaukee hit 23 of 41 shots in the second half.\nCeltics: Before the game Bradley received the Red Auerbach award as the player who best exemplifies the spirit of what it means to be a Celtic on and off the court. The award is named for the team's late president, general manager and coach. Bradley scored Boston's first nine points. \"It's amazing. Just his name being part of it,\" Bradley said.\nPASS THAT BALL\nThe Bucks did a much better job of finding the open man with assists on 31 of their 45 baskets. The Celtics had 19 assists on 39 field goals.\n\"Penetrating, making plays for one another, they did a really good job with that,\" Kidd said of his team's play in the third quarter.\nUP NEXT\nBucks: Host Orlando on Saturday.\nCeltics: At Toronto on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764991747.873229
}