{
  "game_id": "0022400889",
  "espn_id": "401705455",
  "date": "Mar 04, 2025",
  "matchup": "LAC @ PHX",
  "headline": "Durant scores 34, Suns rally from 23-point deficit in 2nd half to beat the Clippers 119-117",
  "body": "PHOENIX -- — Kevin Durant scored 34 points, Devin Booker added 17 and the Phoenix Suns rallied from a 23-point deficit late in the third quarter to beat the Los Angeles Clippers 119-117 on Tuesday night.\n\n\r\n              The Suns trailed by 19 entering the fourth but came all the way back thanks to big buckets from Durant and backup guard Collin Gillespie. Phoenix had a 43-22 advantage in the fourth, reviving its playoff hopes.\n\n\r\n              Gillespie scored 10 points on 4-of-6 shooting, including 2 for 3 from 3-point range, to give the Suns a much-needed spark in the second half. Nick Richards added 16 points on 8-of-10 shooting.\n\n\r\n              The Clippers lost despite Ivica Zubac's 35 points — a career high. He added 10 rebounds and shot 15 of 19 from the field. Kawhi Leonard and James Harden both scored 21.\n\n\r\n              Harden made a 3-pointer with 4:12 left in the third quarter to give the Clippers an 89-66 lead. But then Booker answered with a 3 and the Suns slowly clawed their way back.\n\n\r\n              Phoenix won all four games against the Clippers this season.\n\n\r\n              Takeaways\r\n              Clippers: Zubac was amazing but it's a tough loss for the Clippers, who lost ground in the Western Conference playoff race.\n\n\r\n              Suns: Could this be the moment that turns the season around for the Suns? It's been a frustrating year in the desert but Tuesday's comeback gives hope that the team can climb back into the playoff picture. Gillespie might have earned himself a spot in the rotation after a stellar performance.\n\n\r\n              Key moment\r\n              Gillespie — who has spent a big chunk of this season in the G League — hit a 3-pointer with 36 seconds left to give the Suns a 119-114 lead.\n\n\r\n              Key stat\r\n              Durant and Gillespie combined for 29 points in the fourth quarter.\n\n\r\n              Up next\r\n              Clippers host the Pistons on Wednesday; Suns at Nuggets on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997939.540127
}