{
  "game_id": "0021600074",
  "espn_id": "400899524",
  "date": "Nov 04, 2016",
  "matchup": "MEM vs. LAC",
  "headline": "Paul has 27 points, 11 assists as Clippers beat Grizzlies",
  "body": "MEMPHIS, Tenn. --  The Los Angeles Clippers are concentrating on developing a better defensive identity.\n\nOn Friday night, they made life rather miserable for the Memphis Grizzlies.\n\nThe Clippers caused 19 turnovers -- 17 on steals -- and forced Memphis into 37 percent shooting before holding off a late Grizzlies' push for a 99-88 victory.\n\n\"Our defense is something, right now, that we can hang our hat on,\" said Chris Paul, who had 27 points and 11 assists for the Clippers.\n\n\"The offense, we have to find it,\" said Paul, who also had six steals. \"We'd love to have everything clicking, but I'm just happy that our defense is pretty good.\"\n\nBlake Griffin added 14 points and 10 rebounds. J.J. Redick scored 12 points for Los Angeles while DeAndre Jordan grabbed 21 rebounds.\n\nThe Grizzlies chipped into a Clippers' lead that reached 21 points in the third quarter, scoring nine straight points in the fourth. Memphis eventually pulled within 93-86 with less than a minute left, but got no closer.\n\n\"We just got messy,\" Paul said of the Memphis rally. \"We didn't take care of the ball.\"\n\nMike Conley led Memphis with 30 points and 10 assists, while Marc Gasol added 21 points and nine rebounds. Whether it was the Los Angeles defense or poor execution by Memphis, the Grizzlies never really seemed to keep pace with the Clippers.\n\nThe Grizzlies' only salvation was scoring 31 points in the final quarter, connecting on 10 of 18 shots, Conley hitting two 3-pointers.\n\n\"We need to be where they're at, and we're not,\" said Memphis forward Zach Randolph, who finished with 15 points and nine rebounds. \"We have a lot of work to do. Tonight, they were the better team, and I give them credit.\"\n\nTIP-INS\n\nClippers: Los Angeles started the game connecting on its first six shots. ... Los Angeles converted the 19 Memphis miscues into 30 points. . The Clippers bench, which averages 40 points a game, had 22 through three quarters before ending the game with 36.\n\nGrizzlies: Memphis coach David Fizdale, who was upset with officials through much of the first half, drew his first technical as a head coach with 3:57 left in the second quarter. Rookie official CJ Washington did the honors. ... Gasol, who was only 3 of 18 from the field in Wednesday's win over New Orleans, started 1 of 11 Friday. ... Memphis lost its first home game of the season.\n\nHELPING HAND\n\nPaul became the Clippers' franchise leader in assists early in the second half, passing Randy Smith, who had 3,498 in his Clippers career. Asked about the milestone, Paul initially said: \"It's cool,\" then added of the assists: \"I've got the easy job. All I have to do is pass it to somebody. They're the ones that have to make the shot.\"\n\nHELLO OLD FRIEND\n\nIncluding the postseason, the Grizzlies and Clippers have played 31 times since the start of the 2011-12 season, the most of any Memphis opponent over that span.\n\nBAD BOYS, BAD BOYS\n\nEntering Friday's game, the teams had been assessed 32 technical fouls over the last 20 games. Griffin has six, while Paul has four and Jordan three. Randolph leads the Grizzlies in techs over that span with three. Fizdale was the only one to draw a technical Friday.\n\nUP NEXT\n\nClippers: Travel to San Antonio to face the Spurs in the second game of a road back-to-back.\n\nGrizzlies: Face the Portland Trail Blazers on Sunday in the third game of a four-game home stand",
  "source": "espn_api",
  "crawled_at": 1764995632.3110201
}