{
  "game_id": "0021901310",
  "espn_id": "401224785",
  "date": "Aug 13, 2020",
  "matchup": "SAC @ LAL",
  "headline": "Kings sink 21 3s, roll to win as Lakers rest most starters",
  "body": "LAKE BUENA VISTA, Fla. --  Buddy Hield scored 28 points, including a 3-pointer that capped Sacramento's streak of 11 consecutive baskets made in the third period, and the Kings beat the Los Angeles Lakers 136-122 on Thursday.\n\nBogdan Bogdanovic had 27 points as the Kings won for only the third time in the NBA restart. The Kings made 21 3-pointers as Hield shot 8 of 14. Bogdanovic added five 3s.\n\nThe Lakers had their focus on the playoffs. Most Lakers starters were held out, but LeBron James had 17 points in 15 minutes, all in the first half.\n\nDion Waiters led the Lakers with 19 points. Markieff Morris had 14.\n\nLos Angeles locked up the Western Conference's No. 1 seed three games into the restart. Coach Frank Vogel said he believes the Lakers used the restart to prepare for the playoffs.\n\n\"I always feel like there's more we can accomplish and improve upon, but with the circumstances of the pandemic ... I thought this was an appropriate time to get ready,\" Vogel said.\n\nThe Lakers still don't know who they will face in the first round of the playoffs. The No. 8 seed will be determined in a play-in this weekend.\n\nThe Kings will miss the playoffs for the 14th consecutive year -- the league's longest streak. They haven't made the postseason since losing to San Antonio in the first round of the 2006 playoffs.\n\nThe Kings led 56-52 when James left the game for good late in the first half. Hield added two 3-pointers in the closing minutes of the half to stretch the halftime advantage to 66-56.\n\nSacramento outscored the Lakers 36-16 in the second period and 41-28 in the third. Hield sank a 3 to stretch the Kings' lead to 28 points at 101-73.\n\nMESSAGE TO FANS\n\nCoach Luke Walton said his message to frustrated Kings fans was \"stick with us and stay patient.\"\n\n\"We're working as hard as we can,\" Walton said. \"We believe in ourselves and we believe we're going to get back into the playoffs. We just have to be patient with the group we have.\"\n\nSTILL STREAKING\n\nJames missed two layups in his limited time, but still easily reached double figures in points in his 995th consecutive game. He reached 10 points by sinking two free throws early in the second period and then added a fallaway jumper on the Lakers' next possession.\n\nPARKER SHINES\n\nKings forward Jabari Parker had 19 points and eight rebounds in 30 minutes off the bench. It was a rare opportunity for Parker, who had to recover from the coronavirus, to show his value in extended minutes.\n\nParker said he hopes to remain in Sacramento, but hasn't decided if he will exercise his player option in his contract.\n\n\"I don't plan on moving again,\" said Parker, who was traded to the Kings from the Atlanta Hawks on Feb. 6.\n\nTIP-INS\n\nKings: Nemanja Bjelica had 15 points, 13 assists and eight rebounds. ... Bogdanovic had nine assists. ... Kent Bazemore (sore left calf) missed his third straight game. De'Aaron Fox (left shoulder) and Richaun Holmes (sore right leg) also did not play.\n\nLakers: Rookie Talen Horton-Tucker set a career high with 14 points. ... Anthony Davis (knee), Alex Caruso (neck) and Kentavious Caldwell-Pope (ribs) did not play. Also, Kyle Kuzma was rested.\n\nUP NEXT\n\nKings: Season ends.\n\nLakers: As the No. 1 seed in the West, Lakers will face the winner of the play-in for the No. 8 seed.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996370.136217
}