{
  "game_id": "0022400664",
  "espn_id": "401705230",
  "date": "Jan 29, 2025",
  "matchup": "IND vs. DET",
  "headline": "Siakam scores 37, Haliburton adds 30 points and 8 assists to lead Pacers past Pistons 133-119",
  "body": "INDIANAPOLIS -- — Pascal Siakam scored 37 points, Tyrese Haliburton had 30 points and eight assists, and the Indiana Pacers beat the Detroit Pistons 133-119 on Wednesday night.\n\n\r\n              Siakam and Haliburton combined to hit 25 of 38 shots, including 8 of 16 from 3-point range.\n\n\r\n              Indiana scored 40 first-quarter points on 16-of-20 shooting, including 7 of 10 from 3. The Pacers finished 46 of 81 overall (56.8%), 19 of 38 on 3-pointers.\n\n\r\n              Myles Turner had 24 points for Indiana.\n\n\r\n              Cade Cunningham led the Pistons with 32 points and nine assists. Malik Beasley had 20 points with six 3-pointers.\n\n\r\n              Takeaways\r\n              Pistons: With the win, Detroit improved to 9-6 in January and is assured of its first winning month since March 2019 despite losing point guard Jaden Ivy to a broken leg on Jan. 1. As hot as the Pacers were shooting, the Pistons trimmed a 20-point deficit in the second quarter to single digits for much of the third quarter.\n\n\r\n              Pacers: Indiana started the season 10-15, but since then, the Pacers have looked more like last season’s Eastern Conference finalist by winning 16 of 21, including 10 of 12 in January.\n\n\r\n              Key moment\r\n              The Pistons closed to within 111-105 in the fourth quarter before the Pacers went on a 9-2 run.\n\n\r\n              Key stat\r\n              Talk about a scorching first half, Siakam and Haliburton combined for 43 points on 16-of-20 shooting, including 5 of 8 from 3-point range.\n\n\r\n              Up next\r\n              The Pistons host Dallas on Friday night and the Pacers host Atlanta on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764998135.426425
}