{
  "game_id": "0022301045",
  "espn_id": "401585673",
  "date": "Mar 26, 2024",
  "matchup": "LAL @ MIL",
  "headline": "Reaves' triple-double, tiebreaking 3 helps rally Lakers past Bucks in 2OTs without LeBron James",
  "body": "MILWAUKEE -- — Staring at a double-digit deficit midway through the fourth quarter without LeBron James available, Austin Reaves and the Los Angeles Lakers faced a clear choice.\n\n\r\n              “It was one of those moments that you could either flip the page to tomorrow, get ready for that game or you could go out and compete 110% and give yourself an opportunity or at least try to give yourself an opportunity to get back in the game,” Reaves said.\n\n\r\n              The Lakers chose the latter option and delivered a comeback for the ages.\n\n\r\n              Reaves had his second career triple-double and made a tiebreaking 3-pointer with 38.6 seconds left in the second overtime as the Lakers overcame James' absence and rallied to beat the Milwaukee Bucks 128-124 on Tuesday night.\n\n\r\n              Reaves had 29 points, 14 rebounds and 10 assists in 47 minutes as the Lakers opened a six-game trip by winning their fourth straight despite trailing by 19 points in the fourth quarter and never leading in regulation. Anthony Davis provided 34 points and 23 rebounds while playing 52 minutes despite dealing with a knee problem late in the game.\n\n\r\n              “A 20-point lead in this league now, it’s nothing because of the way the offense is right now in the league, so high-powered that you can wipe away a lead pretty fast,” Davis said.\n\n\r\n              The Lakers won't have much time to celebrate their stunning comeback. They're playing again Wednesday at Memphis.\n\n\r\n              Milwaukee's Giannis Antetokounmpo had 29 points, a season-high 21 rebounds and 11 assists for his ninth triple-double of the season. Damian Lillard scored 27 but shot 9 of 29. Malik Beasley added 21.\n\n\r\n              James had an issue with his left ankle that prevented him from being available as the Lakers opened a six-game trip. James also had missed the Lakers’ 123-122 victory over the Bucks on March 8. \n\n\r\n              The Lakers still found a way to beat Milwaukee again.\n\n\r\n              “We've got to watch this game, learn from this game,” Antetokounmpo said. “Watch why we weren't able to get a stop. Watch why the ball wasn't moving down the stretch. Watch why we lost the game. Watch why there was a lot of 50-50 balls and we weren't able to get them.”\n\n\r\n              D'Angelo Russell had 29 points, 12 assists and seven rebounds for the Lakers. Rui Hachimura added 16 points and 14 rebounds.\n\n\r\n              The exhaustion of both teams was apparent as nobody scored in the first three minutes of the second overtime. The Lakers briefly trailed by two in the second OT, but pulled ahead for good on Reaves’ last-minute 3-pointer.\n\n\r\n              After Antetokounmpo missed two free throws with 24.2 seconds left, Russell hit two free throws to make it 126-121 with 14.7 seconds remaining, Beasley made a 3-pointer to cut the lead to two, but Davis hit two free throws with 1.7 seconds left to seal the victory.\n\n\r\n              The Lakers never led until Spencer Dinwiddie sank a tiebreaking 3-pointer with 2:19 left in the first overtime.\n\n\r\n              From there, the game went back and forth.\n\n\r\n              Lillard's corner 3-pointer put Milwaukee ahead with 13.6 seconds left in the first overtime, but Russell drew a foul and hit both free throws to tie with 3.1 seconds remaining.\n\n\r\n              Davis blocked Lillard on a driving layup attempt to force a second overtime.\n\n\r\n              Milwaukee seemed firmly in control for most of the night.\n\n\r\n              After a Lillard jumper with 8:25 left gave the Bucks a 94-75 advantage — matching their largest lead of the game — the Lakers outscored the Bucks 26-7 the rest of the fourth quarter to force overtime.\n\n\r\n              “Sometimes the ball just bounces different, and if you don't stay disciplined and do the things that go into how we built that lead, those leads can go away quick in this league with the shooting that's in the league, like they did tonight,\" Lillard said. \"That's what happened.”\n\n\r\n              Taurean Prince drew a foul with 43.9 seconds remaining and made both free throws to tie the game. Both teams had a chance to win it at the end of the fourth quarter but couldn’t convert.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Memphis on Wednesday.\n\n\r\n              Bucks: At New Orleans on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995483.252474
}