{
  "game_id": "0021900095",
  "espn_id": "401160737",
  "date": "Nov 04, 2019",
  "matchup": "PHX vs. PHI",
  "headline": "Devin Booker scores 40 as Suns knock off 76ers, last unbeaten team",
  "body": "PHOENIX -- Devin Booker was pouring in buckets from every corner of the court during the second half, and the home crowd loved every minute of it, serenading the Phoenix Suns star with MVP chants as he finished with 40 points in a 114-109 win over the Philadelphia 76ers on Monday night.\nThe 23-year-old guard did a lot of losing during his first four seasons in the desert.\nThat's why these moments -- even though it's very early in year five -- are feeling awfully good.\n\"That's the love I get here. It's been unconditional since Day 1,'' Booker said. \"It's good to feel the energy in there. The fans are getting what they want -- a hard-working team that pushes the issue every night.''\nPhoenix (5-2) continued its run as one of the most surprising teams in the NBA, knocking off the previously undefeated 76ers, who played without star center Joel Embiid because of his two-game suspension for an altercation with Minnesota's Karl-Anthony Towns on Oct. 30.\nRicky Rubio added 21 points and 10 assists for the Suns, who are three games over .500 for the first time in more than four years. Phoenix is on a three-game winning streak and off to its best seven-game start since 2013.\nThe Suns are also now 7-0 against the spread this season. They're the fifth team in the past 30 seasons to cover each of its first seven games of a season and the first to do it since the 2015-16 Orlando Magic.\nBooker now has 6,003 points in his career, becoming the eighth-youngest player in NBA history to reach 6,000. He turned 23 last week and finished Monday's game 15-of-19 from the field, including 3-for-4 from 3-point range, and 7-of-7 on free throws.\n\"I've said it for a while: He's a complete basketball player,'' Phoenix coach Monty Williams said. \"He's competitive, not afraid of the moment. He makes big plays.''\nPhoenix pushed ahead 100-93 midway through the final quarter, but the lead quickly disappeared and Al Horford tied the game when he came flying down the lane for a one-handed, putback slam.\nFrom that point, it was back and forth until the Suns went up in the final few minutes when Booker and Kelly Oubre Jr. made big baskets to put them in front for good.\nThe Sixers (5-1) were led by 32 points from Horford. He tied a career high with five 3-pointers and shot 13-of-20 from the field. Tobias Harris added 24 points and Furkan Korkmaz had 20.\n\"We have to definitely give them credit,'' Harris said. \"They came out and played a heck of a game. They were able to make shots.''\nHorford nailed a 27-foot 3 at the buzzer to put the 76ers ahead 61-55 at halftime. The 13-year veteran shot 6-of-7 from the field in the first half, including 3-of-4 from 3-point range.\n\"For the last couple of games, obviously with Joel being out, I felt like I've had to step up a little more, be more aggressive and look to score,'' Horford said. \"Tonight, the way they were defending me, it gave me a lot of looks, and I took advantage of that.''\nA BIG DIFFERENCE SO FAR\nPhoenix won its fifth game, which is already more than 25 percent of the way to its win total of 19 last season.\nThe Suns haven't made the playoffs in a decade and have been particularly bad over the past four years, with an 87-241 record and no more than 24 wins in any of those seasons.\nTIP-INS\n76ers: G/F Shake Milton didn't play because of a bone bruise and mild sprain in his left knee. ... Ben Simmons had five steals in the first half and finished with seven. ... Embiid is eligible to return when the 76ers visit the Jazz on Wednesday.\nSuns: G Ty Jerome missed his seventh straight game to start his rookie season because of a right ankle sprain. ... The Suns trailed by six at halftime despite shooting 55% from the field. ... Booker scored the Suns' first 11 points of the third quarter and had 16 in the period. ... Aron Baynes finished with 15 points, seven rebounds and six assists. He was 3-of-5 from 3-point range.\nUP NEXT\n76ers: At the Utah Jazz on Wednesday.\nSuns: Host the Miami Heat on Thursday.\nESPN Stats & Information and The Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764996591.2820191
}