{
  "game_id": "0022200772",
  "espn_id": "401468927",
  "date": "Feb 01, 2023",
  "matchup": "BKN @ BOS",
  "headline": "Tatum scores 31, Celtics sizzle in 139-96 rout of Nets",
  "body": "BOSTON -- — Jayson Tatum scored 31 points and had nine rebounds and the Boston Celtics rolled to a 139-96 win over the short-handed Brooklyn Nets on Wednesday night. \n\n\r\n              Jaylen Brown added 26 points as both of Boston’s stars knocked down seven 3-pointers in a game the Celtics never trailed and led by as many as 49 points. Boston dominated on both ends of the floor, shooting 60% through three quarters on the way to its largest victory of the season. \n\n\r\n              “You can tell we were ready to go from the jump,” Tatum said. \n\n\r\n              It marked the eighth time this season Tatum and Brown have each scored at least 25 points in the same game.\n\n\r\n              Robert Williams finished with 16 points and nine rebounds in his return from a sprained ankle. Derrick White added 14 points and 10 rebounds. \n\n\r\n              “They're hungry,” Williams said of Tatum and Brown. “They're still (upset) about last year.”\n\n\r\n              The NBA-leading Celtics have won all three meetings with the Nets this season. \n\n\r\n              Tatum began the night second in the NBA while averaging 37.5 minutes per game. He played just over 29 on Wednesday and was able to sit most of the fourth quarter. Coach Joe Mazzulla said it was nice to get him some rest, but isn't concerned about the load he has carried so far.\n\n\r\n              Tatum credits team trainer Nick Sang and the conversations they had since last season for helping him maintain his body this season.\n\n\r\n              “I feel great,” Tatum said. “My body feels so much better at this time than it did last season.”\n\n\r\n              Kyrie Irving scored 20 points and Cam Thomas added 19 for Brooklyn, which struggled throughout while shooting 41%, including 9 of 39 beyond the arc. The Nets dropped to 4-7 since Kevin Durant sprained his right knee on Jan. 8. \n\n\r\n              “It's clear as day that they want to win the championship, and they're not wasting any time in the regular season,” Irving said. “Tonight I felt like we were just one of those teams in the way, and you know, we just can't be one of those teams in the way. We've got to be one of those teams that stands up to them.” \n\n\r\n              Brooklyn had managed to keep pace with Boston in the standings without Durant and through recent injuries to Ben Simmons (left knee soreness) and T.J. Warren (left shin contusion), who both sat for the third straight game. \n\n\r\n              The Celtics had their entire rotation available except for Marcus Smart, sidelined for the fifth straight game as he recovers from his sprained right ankle. Boston took advantage, racing to a 33-7 advantage as the Nets started just 2 of 14 from the field. \n\n\r\n              Irving missed four of his first five shots as Boston’s crowd booed whenever he touched the basketball, mirroring the treatment he received during his most recent visits to TD Garden. \n\n\r\n              Tatum finished the quarter with 18 points, single-handedly outscoring the Nets as Boston took a 46-16 edge into the second quarter. The 30-point, first-quarter lead marked the first time in franchise history Boston outscored its opponent by 30 in the opening period.\n\n\r\n              The Celtics led 79-45 at halftime. \n\n\r\n              “This was a night where they hit first, they hit hard and it hurt,” Nets coach Jacque Vaughn said.\n\n\r\n              TIP-INS \n\n\r\n              Nets: Shot 6 of 21 (29%) in the first quarter. ... Neither Simmons nor Warren made the trip, but Vaughn said both are progressing and hope to return as soon as Saturday. \n\n\r\n              Celtics: It was Tatum’s 29th game this season with at least 30 points. ... Boston outscored the Nets 22-1 in fastbreak points in the first half. ... Shot 18 of 29 (62%) in the first quarter, including 8 of 11 from 3-point range. ... Former Patriots wide receiver Julian Edelman sat courtside. \n\n\r\n              UP NEXT \n\n\r\n              Nets: Open five-game homestand Saturday against the Washington Wizards. \n\n\r\n              Celtics: Host the Phoenix Suns on Friday. \n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994866.529608
}