{
  "game_id": "0021900163",
  "espn_id": "401160805",
  "date": "Nov 14, 2019",
  "matchup": "MIL vs. CHI",
  "headline": "Giannis drops 30-plus again to lead Bucks past Bulls 124-115",
  "body": "MILWAUKEE --  Giannis Antetokounmpo ensured the Milwaukee Bucks’ dominance over the Chicago Bulls didn’t end Thursday night.\n\nAntetokounmpo had 38 points and 15 rebounds, Eric Bledsoe added a season-high 31 points and eight assists, and the Bucks withstood another historic effort by Chicago rookie Coby White to beat the Bulls 124-115.\n\nThe Bucks have won seven straight against Chicago dating to 2017.\n\nWhite shot 5 of 8 from 3-point range in the first half, becoming the youngest player in NBA history to hit five 3-pointers in consecutive games. The 19-year-old first-round pick hit seven 3-pointers in the fourth quarter of a 120-102 victory over the New York Knicks on Tuesday night -- the most in a quarter ever by a rookie. White finished Thursday with 26 points, including six 3s.\n\n“He was terrific,” Bulls coach Jim Boylen said of White. “I thought a lot of our players played well. That’s a tough team.”\n\nAntetokounmpo had at least 30 points for the seventh game this season for the Bucks, who played without Khris Middleton. The All-Star forward is expected to miss the next three to four weeks with a thigh bruise.\n\nDonte DiVincenzo, who made his first career start in place of Middleton, had four points and five rebounds.\n\n“I think the team realized in order to win tonight, we got to drive the ball into the paint and get some paint points,” Antetokounmpo said.\n\nThe Bucks made just six 3s while Chicago hit 18 from long range. But Milwaukee outscored the Bulls 70-32 inside. That marked a season high in the paint for Milwaukee. Bledsoe was a perfect 12 for 12 inside the arc.\n\n“I was just getting some easy looks, man,” said Bledsoe, who has scored at least 20 points in each of his last five games. “My teammates do a great job of spacing the court. The way they shot the ball leaves gaps for me to drive and it’s up to me to make those shots.”\n\nThe Bucks missed Middleton early, especially on the offensive side of the ball. Milwaukee struggled to create and make shots, shooting an anemic 4 of 18 from 3 in the first half and trailed 66-65 at halftime.\n\nThings switched in the second half when Antetokounmpo threw down a dunk that tied it at 82-82 with 6:37 to play in the third, prompting Boylen to call a timeout. The play ignited the crowd and jumpstarted the Bucks.\n\nWesley Matthews scored 10 of his 15 points from the foul line for Milwaukee. Matthews had just three free-throw attempts coming into the night but had 13 Thursday.\n\n“This offense is kind of predicated on spacing and ball movement, so everybody can be in any spot,” Matthews said. “We already can be kind of interchangeable. We’re definitely going to miss (Middleton’s) production on the offensive end.\n\n“This team is built with a lot of depth and tonight we put up 124. The offense wasn’t the problem. We have to stop people. We’ve got to find ways to do that.”\n\nZach LaVine had 25 points and seven assists before fouling out for Chicago. Wendell Carter Jr. added 14 points and six rebounds. He also fouled out.\n\nTIP-INS\n\nBulls: Chicago had six players score in double figures (White, LaVine, Carter Jr., Lauri Markkanen, 11; Thaddeus Young, 11; and Tomas Satoransky, 10).\n\nBucks: Center Robin Lopez finished with six points and three rebounds. Lopez spent the previous three seasons with the Bulls, averaging 10.5 points, 5.0 rebounds, 1.3 assists and 1.1 blocks in 219 games.\n\n“RoLo is a hyper-competitive dude,” Bulls coach Jim Boylen said. “He likes to win. He likes to win a practice game. He likes to win a 1-on-1 game, a shooting game. I like that competitive spirit that he has.”\n\nUP NEXT\n\nBulls: Host the Nets on Saturday.\n\nBucks: At the Pacers on Saturday.\n\n---\n\nFollow Keith Jenkins on Twitter: https://twitter.com/MrKeithJenkins\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996176.250208
}