{
  "game_id": "0021500734",
  "espn_id": "400828621",
  "date": "Feb 02, 2016",
  "matchup": "LAL vs. MIN",
  "headline": "Kobe scores 38, Lakers beat Wolves 119-115 to end 10-gm skid",
  "body": "LOS ANGELES --  Kobe Bryant has lifted the Los Angeles Lakers onto his shoulders countless times over the past two decades, and he rarely flinches under the weight.\n\nEven during a demoralizing losing streak in his farewell season, the 37-year-old superstar summoned his skills to carry the team one more time.\n\n\"You've seen it for 20 damn years,\" Bryant said with a shrug. \"What do you expect?\"\n\nBryant hit seven 3-pointers while scoring a season-high 38 points, and the Lakers snapped their 10-game skid with a 119-115 victory over the Minnesota Timberwolves on Tuesday night.\n\nWith Bryant scoring 14 of their 18 points in the final 5:02, the Lakers avoided the longest losing streak in the 16-time champion franchise's history despite blowing a 16-point lead in the second half. Los Angeles had lost 10 straight for the first time since 1994, and Bryant's vintage performance made sure the record stayed shared.\n\n\"You lose 10 straight, that's enough (embarrassment) as it is,\" Bryant said. \"You still don't want to be the team that's one away (from the record).\"\n\nBryant hit repeatedly from the perimeter in the Lakers' first win since Jan. 12, evoking memories of the best years for the third-leading scorer in NBA history.\n\nAfter Minnesota took the lead in the waning minutes, Bryant put the Lakers back ahead with dramatic, back-to-back 3s. He also drained a 19-footer with 26 seconds left to put them up 113-110 before making six free throws in the last 16.7 seconds.\n\n\"I appreciate the fact that he's out there competing like he has for 20 years,\" Lakers coach Byron Scott said. \"His body can't do it like he used to, but his mind is still as sharp as a tack. He still has that will, and I marvel at that.\"\n\nAndrew Wiggins scored 30 points and led an impressive second-half surge by the Timberwolves, who have lost five straight and 16 of 18. Gorgui Dieng scored 19 points, and Karl-Anthony Towns had 14 points and nine rebounds.\n\n\"Kobe just started making shots,\" said Minnesota coach Sam Mitchell, a still-frustrated participant in Bryant's 81-point game against Toronto in 2006. \"I hate him. If I don't ever see him again, it won't be too soon. He doesn't score too many points now, so everybody thinks he's done and all that. He's not the same Kobe, and he'll tell you that. But there are nights when he's feeling good.\"\n\nWiggins committed a turnover with 17 seconds left after Bryant's big jumper, and Bryant salted away the game at the line amid countless chants of his name from nostalgic fans.\n\nLou Williams scored 20 points and rookie D'Angelo Russell had 18 for the Lakers.\n\nNO HATE\n\nBryant laughed when told Mitchell said he \"hates\" him. They shared a warm conversation in the hallway postgame.\n\n\"Thank you for the hate,\" Bryant said. \"Truly, I love that.\"\n\nNO KOBE FOR KG\n\nThe Timberwolves played without injured Kevin Martin, Nikola Pekovic and Kevin Garnett, whose sore right knee robbed him of his last chance to suit up against Bryant during their two parallel decades in the NBA. The Lakers met Garnett's Celtics in the 2008 and 2010 NBA Finals.\n\nBAD START\n\nLos Angeles roared to a 16-point lead while scoring a season-high 39 points in the second quarter. The surge was led by Bryant and Russell, who was chosen right behind Towns last summer with the No. 2 pick in the draft.\n\n\"We didn't lose this game at the end of the game,\" said Ricky Rubio, who had 10 points and 15 assists. \"We lost it in the first two quarters. We didn't show up in the first half. In the second half we tried to come back, but we're just not who we want to be.\n\n\"I don't know. It's painful. It's painful to see us losing so many games.\"\n\nTIP-INS\n\nTimberwolves: Before the game, Garnett voiced support for Mitchell, saying he sees progress from the struggling club's youngsters. ... Martin missed his fifth straight game with a right wrist injury.\n\nLakers: Rookie forward Larry Nance Jr. has been shut down until after the All-Star break to give his sore right knee more time to rest. The Lakers have four more games before their eight-day break. ... Los Angeles Rams greats Eric Dickerson and Vince Ferragamo watched the game from a luxury suite.\n\nUP NEXT\n\nTimberwolves: At the Clippers on Wednesday.\n\nLakers: At the Pelicans on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994269.213301
}