{
  "game_id": "0021800800",
  "espn_id": "401071473",
  "date": "Feb 05, 2019",
  "matchup": "PHI vs. TOR",
  "headline": "Lowry has big half amid trade rumors, Raptors hold off 76ers",
  "body": "PHILADELPHIA --  Kyle Lowry doesn't want to play for any team but Toronto.\n\nA detour through his hometown is always welcome, though.\n\nLowry had a big first half amid reports that Toronto has offered him in a trade, Kawhi Leonard finished with 24 points, and the Raptors held off the Philadelphia 76ers 119-107 on Tuesday night in a matchup between two of the Eastern Conference's top teams.\n\nLowry, a Philadelphia native and former Villanova star, had 17 points in the first half and finished with 20. He seemed unfazed by a report from Sports Illustrated that Toronto had offered him to Memphis as part of a trade package for Mike Conley and Marc Gasol.\n\n\"I personally want to be in Toronto,\" Lowry said. \"I've never asked for a trade. My goal is to try to win a championship here, and that's what I want to do.\"\n\nSerge Ibaka also had 20 points to help the Raptors overcome the Joel Embiid-led Sixers. Embiid had 37 points and 13 rebounds for his league-leading 44th double-double, while Ben Simmons scored 20 points and Jimmy Butler had 18.\n\nWith the Sixers trailing by 18 early in the fourth quarter, Embiid ripped off 12 points in a three-minute stretch to slice Toronto's lead to 108-101 with 6:59 left and get the home crowd on its feet for the first time all night. But the Raptors (39-16) never let the Sixers (34-20) get closer than seven.\n\n\"Offensively, defensively, they were just better than us,\" Embiid said. \"But I'm proud of our effort in the second half.\"\n\nAfter erupting for 40 points in the first quarter behind 11-for-11 shooting from the free-throw line, the Raptors built a 21-point advantage midway through the second quarter. Lowry, who missed Toronto's last game due to back soreness, fueled the run with three 3-pointers in a two-minute stretch.\n\n\"He was awesome,\" Raptors coach Nick Nurse said. \"You know, that's Kyle in a super-focused game. He took his 3s, he took his deep ones, he took some drives. Whenever you see him pull that little slam-on-the-brakes, spin-to-the-left fadeaway, you know he's in the game right.\"\n\nLowry added another 3, which bounced all around the rim before dropping in, four minutes before halftime to help Toronto take a 72-55 lead into the break -- the Raptors' best offensive first half of the season.\n\n\"I love playing at home,\" Lowry said. \"My mom's in the building. It's different.\"\n\nTOO MANY MINUTES?\n\nThe Sixers were without two starters as Wilson Chandler (quad) missed his second straight game while JJ Redick was a late scratch due to nausea.\n\nThat led to the team's Big 3 of Embiid (42 minutes), Simmons (44 minutes) and Butler (39 minutes) all playing more than coach Brett Brown would have liked.\n\n\"We got two days off before we played and I just felt like it was our only chance to win,\" Brown said. \"But it is not an ideal volume of minutes that I played them.\"\n\nDEFENSE COMES FIRST\n\nWhile the Raptors had a big offensive performance, they were mostly proud of the work they put in on the defensive end. That includes forcing Simmons into six turnovers.\n\n\"He's a great player, very good at getting to the basket and finding his teammates,\" Leonard said. \"I just tried my best to get in the passing lane and stick to our game plan.\"\n\nTIP-INS\n\nRaptors: Toronto is now 17-11 on the road this season, the third best mark in the league. The Raptors' next two games will also be away from home. ... Toronto won the season series with Philadelphia, 3-1, with the Sixers' only win coming on Dec. 22 when the Raptors were missing Leonard and Ibaka, their top two scorers.\n\n76ers: Tuesday's game marked the start of a four-game homestand after a 2-2 road swing out West. ... Some of the biggest cheers of the night came in the pregame when Sixers great Allen Iverson rang the team's ceremonial bell at midcourt. ... This was Embiid's NBA-leading 22nd game this season with at least 30 points and 10 rebounds.\n\nUP NEXT\n\nRaptors: At the Atlanta Hawks on Thursday night.\n\n76ers: Host the Denver Nuggets on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994020.22529
}