{
  "game_id": "0022000558",
  "espn_id": "401267718",
  "date": "Mar 04, 2021",
  "matchup": "SAC @ POR",
  "headline": "Lillard has 44 and Blazers down Kings 123-119",
  "body": "PORTLAND, Ore. -- — Damian Lillard had 44 points, including 10 straight at a key moment down the stretch, to give the Portland Trail Blazers a 123-119 victory over the Sacramento Kings on Thursday night.\n\n\r\n                    Enes Kanter added 22 points and 21 rebounds for the Blazers, who have won three straight and are 21-14 heading into the All-Star break. It's the Blazers' best start through 35 games since 2015. \n\n\r\n                    Lillard said the difference in the first half was that the team never got down after CJ McCollum and Jusuf Nurkic were injured. \n\n\r\n                    “When CJ and Nurk went down, we just said `Let's not feel sorry for ourselves. Let's show up and let's get the job done. Let's come together, let's lean on each other, count on each other and find a way to get it done.' And we did that,\" Lillard said. \n\n\r\n                    De'Aaron Fox had 32 points, 12 assists and eight rebounds for Sacramento, which had six players score in double figures. \n\n\r\n                    Richaun Holmes dunked to give the Kings a 103-98 lead with 5:41 left, but Lillard answered with a 3-pointer and Kanter's layup tied it at 103. \n\n\r\n                    Sacramento went up 108-103 with 3:49 to go on Harrison Barnes' layup and Buddy Hield's 3. Lillard responded with a pullup jumper, a layup and a pair of 3-pointers in quick succession to put the Blazers ahead 115-108 with just more than a minute left. \n\n\r\n                    Sacramento wasn't quite done, pulling within 119-118 on a 3-pointer with 6.6 seconds left. After Gary Trent Jr. made two free throws for the Blazers, Fox hit one then appeared to miss the second intentionally. After a review over whether the ball hit the rim, Portland got the ball back with 3.7 seconds left and Lillard was fouled to close it out.\n\n\r\n                    Lillard finished with eight 3-pointers. \n\n\r\n                    “On the whole it was a really really difficult game to play because of their style of play, they push the ball, they get to the paint,\" Blazers coach Terry Stotts said. “We had trouble rebounding the ball. In some ways, it was a little bit like our previous game where we just kind of hung around, made some plays at the end.”\n\n\r\n                    Both teams were also playing the second of a back-to-back heading into the All-Star break. \n\n\r\n                    The Kings had won two of their last three games after a nine-game losing streak. Sacramento was still without reigning NBA rookie of the month Tyrese Haliburton, who missed his fourth game with a calf injury.\n\n\r\n                    “We don’t want to take any moral victories. We wanted to win tonight and we didn’t,\" said Harrison Barnes, who finished with 17 points. \" Some calls didn't go our way, some shots didn't go our way.” \n\n\r\n                    Nemanja Bjelica's 3-pointer gave the Kings an early 21-16 lead. Lillard's 3 late in the opening quarter put Portland up 28-27, and the All-Star had 15 points by the end of the period. \n\n\r\n                    “Dame's a great player. He had it going there,” Barnes said. “We tried to throw a bunch of different coverages at him but we couldn’t touch him with the way the whistle was going tonight. Dame is gonna score but you’ve got to limit the rest of the team.”\n\n\r\n                    TIP INS\n\n\r\n                    Kings: Hield was questionable for Sacramento with a right ankle sprain but he started. He had 29 points against the Lakers on Wednesday. \n\n\r\n                    Trail Blazers: The game was delayed for a time in the second quarter when the shot clocks at the Moda Center went out. ... Portland has won five straight against the Kings. \n\n\r\n                    HELP ON THE WAY\n\n\r\n                    The Trail Blazers announced that McCollum, who has been out with a left foot fracture, has been cleared for contact practice. McCollum has been out since Jan. 16 when he injured his foot in a game against Atlanta. \n\n\r\n                    McCollum, who was averaging 26.7 points before he was hurt, will be key to Portland's playoff push. \n\n\r\n                    The Blazers also said Nurkic continues to rehab his right wrist fracture and will be evaluated next week. \n\n\r\n                    UP NEXT\n\n\r\n                    The Kings host the Houston Rockets next Thursday after the All-Star break. \n\n\r\n                    The Blazers host the Phoenix Suns on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997168.443218
}