{
  "game_id": "0021800538",
  "espn_id": "401071214",
  "date": "Dec 30, 2018",
  "matchup": "TOR vs. CHI",
  "headline": "Leonard scores 27 as Raptors beat Bulls 95-89",
  "body": "TORONTO --  A game against the defensive-minded Chicago Bulls wasn't the ideal situation for the Toronto Raptors to get their struggling offense back on track.\n\nIn the end, Toronto did just enough to eke out a win.\n\nKawhi Leonard scored 27 points, Pascal Siakam had 20 points and 12 rebounds and the Raptors beat Chicago 95-89 on Sunday night, their seventh straight victory over the Bulls.\n\nDanny Green and Fred VanVleet each scored 10 points as Toronto bounced back from its largest defeat of the season, a 29-point loss at Orlando on Friday.\n\n\"They definitely mucked up the game and made it ugly and dirty and slow,\" VanVleet said of the Bulls, who have lifted their defensive intensity under new coach Jim Boylen. \"Give them credit for that, but you've got to be able to win in different ways.\"\n\nAfter setting season-lows in made baskets (28) and field goal percentage (.295) at Orlando, the Raptors got off to a rough start against the Bulls. They scored 14 points in the first quarter, matching their fewest in any frame this season.\n\nLeonard scored 12 points in the decisive fourth, going 8 for 8 at the free throw line.\n\n\"It was an uphill fist fight the whole way,\" Toronto coach Nick Nurse said. \"We found a way to get to the basket eventually.\"\n\nLauri Markkanen had 18 points and 10 rebounds and Wendell Carter Jr. had 16 points and 11 rebounds for the Bulls, who didn't score for the first 3:19 of the fourth.\n\n\"I thought we battled,\" Boylen said. \"For about 36-38 minutes we controlled the game, we controlled the tempo. I'm really proud of our guys.\"\n\nChicago's Zach LaVine fouled out with 13 points. It was a poor shooting night for LaVine, who went 3 for 17, including 0 for 3 from 3-point range.\n\n\"I'm still coming off this ankle (injury) so I don't have the same lift but I've got to make them regardless,\" LaVine said. \"Just one of those days. I wish I could go back and make them.\"\n\nKris Dunn scored 14 points, and Justin Holiday and Chandler Hutchison each had 11 as the Bulls fell to 5-8 under Boylen.\n\nRaptors guard Kyle Lowry (sore lower back) sat for the seventh time in eight games. Toronto is 5-3 without the four-time All-Star.\n\nAhead 68-65 to start the fourth, the Raptors got back-to-back 3-pointers from Delon Wright and Siakam and held a 74-65 lead at 10:10.\n\nCarter ended Chicago's drought with a hook shot at 8:41. The Bulls missed 12 of their first 15 shots in the final quarter.\n\nMarkkanen's 3 at 1:21 brought Chicago within 85-82, but Leonard answered with a pair of free throws. After a missed shot by Dunn, Siakam was fouled and made a pair, giving Toronto an 89-82 advantage with 25 seconds to go.\n\nToronto outscored the Bulls 13-2 in fast-break points and scored 21 points off 18 Chicago turnovers, a combination Boylen called \"gut-wrenching.\"\n\n\"We gave them 45 points off things I think we've got to control better,\" he said.\n\nTIP-INS\n\nBulls: Chicago matched a season-low for opponent's points in the first half. ... F Bobby Portis missed his fifth straight game because of a sprained right ankle.\n\nRaptors: Coach Nick Nurse said Lowry is recovering and should be able to return soon. Lowry also missed time with a bruised hip during this stretch of absences. ... VanVleet snapped a streak of 16 consecutive missed shots with a fast break layup in the third. VanVleet missed his final eight attempts in Friday's loss to the Magic. ... Toronto has won three straight at home.\n\nBATTLE OF THE BOARDS\n\nToronto finished with 17 offensive rebounds to Chicago's 10, and held a 10-5 advantage in that category in the second half.\n\n\"Offensive rebounding hurt us,\" Hutchison said. \"That's one thing we keep harping on is we can't beat ourselves in situations like that.\"\n\nMONTH BY MONTH\n\nToronto went 8-7 in December and has not had a losing record in a month since going 8-9 in January 2017.\n\nDOUBLE FIGURES\n\nVanVleet has scored 10 or more points in eight straight games, one shy of his career high.\n\nUP NEXT\n\nBulls: Host Orlando on Wednesday night.\n\nRaptors: Host Utah on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994114.516075
}