{
  "game_id": "0022200235",
  "espn_id": "401468390",
  "date": "Nov 19, 2022",
  "matchup": "TOR @ ATL",
  "headline": "Young hits Griffin for OT buzzer-beater, Hawks top Raptors",
  "body": "ATLANTA -- — Trae Young threw a long pass to hit A.J. Griffin for a wide-open layup at the overtime buzzer and the Atlanta Hawks, after rallying late in regulation, beat the undermanned Toronto Raptors 124-122 on Saturday night.\n\n\r\n              Young had 33 points and 12 assists, De’Andre Hunter added 22 points and Clint Capela had 18 points and 14 rebounds for the Hawks.\n\n\r\n              While Young was taking the inbound pass with 3.8 seconds to go and the score tied at 122-all, Griffin had the awareness to run behind the defense and set up near the basket. It was pure basketball instinct.\n\n\r\n              Young caught a pass, took a dribble and threw the pass from just past half-court. Griffin jumped, hauled in the ball and made the shot before landing.\n\n\r\n              “I was in the right place at the right time,\" Griffin said. “I had a feeling they were going to pressure up. I saw it and broke early. I said, ‘I’ll just sneak up behind them.’ That’s exactly what happened.\"\n\n\r\n              Young hit a pair of free throws with 59 seconds to go in regulation, giving the Hawks their first lead since midway through the third quarter. \n\n\r\n              The Raptors led 108-101 with 2:36 to go in the fourth quarter. The Hawks went on a 10-run in a 90-second span to take a 111-109 lead on Young’s two free throws with 59 seconds to go.\n\n\r\n              Toronto had a great chance to win it at the end of regulation, but Scottie Barnes missed a layup and a putback attempt at the buzzer.\n\n\r\n              Griffin scored eight points of his 17 points in overtime, his second runner making it 118-115. His first runner on Atlanta’s first possession of overtime gave the Hawks a 115-113 lead, and they never trailed again. The teams traded baskets in the extra period before Young’s layup high off the glass with 28.2 seconds remaining made it 120-117.\n\n\r\n              Hunter missed two free throws at the 7-second mark that would’ve iced it for Atlanta. O.G. Anunoby followed by hitting a pair of free throws to set up Griffin’s game-winner.\n\n\r\n              “We just get playing, kept fighting,\" Young said. “It’s a long game. They went on runs. We went on runs, we went on runs. It’s a long game, so you can’t stop at any time of it. We knew we had a chance to get back in the game. We just kept playing.\"\n\n\r\n              Barnes had a season-high 28 points and Anunoby added 27 for the Raptors, who were seeking third straight victory despite several injuries.\n\n\r\n              Toronto dressed only nine players. Key members of the team — Pascal Siakam, Precious Achiuwa, Gary Trent Jr. and Fred VanVleet — have missed a total of 18 games since Nov. 6.\n\n\r\n              “It’s a little hard, but it’s nothing we can’t withstand,” Raptors forward Thaddeus Young said after scoring 19 points with nine rebounds. “We were short-handed, but we still had a chance to win the game. We just have to make sure we execute down the stretch.” \n\n\r\n              The Raptors got 15 points from VanVleet and a season-high 17 points from reserve guard Malachi Flynn before he fouled out.\n\n\r\n              Toronto went on a 22-8 run to go up 42-33 ending on VanVleet’s three-point play early in the second. The Raptors called timeout after a dunk by Collins trimmed the lead to 51-49, but Toronto was up 62-55 at halftime when Barnes’ layup beat the buzzer. \n\n\r\n              Atlanta is 50-51 all-time against the Raptors, 27-24 at home. \n\n\r\n              TIP-INS\n\n\r\n              Raptors: Barnes limped off the floor with 4:21 remaining in regulation with a left foot injury after getting tangled up underneath the basket but soon returned. It appeared he came down on Young’s foot before falling to the court. ... Coach Nick Nurse hopes the next three off days will give the team a chance to heal. Siakam (right adductor strain), Achiuwa (right ankle sprain), Dalano Blanton (left ankle sprain), Chris Boucher (illness), Trent (illness) and Otto Porter Jr. (toe dislocation) didn’t make the trip.\n\n\r\n              Hawks: Dating to March 3, 2022, Atlanta has scored at least 100 points in 37 straight games, the third-longest scoring streak in franchise history and the longest such active streak in the NBA. ... Hunter was 0 for 7 from the field in the first half. ... Bogdan Bogdanovic (right knee) missed his 17th straight game.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Brooklyn on Wednesday.\n\n\r\n              Hawks: At Cleveland on Monday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994455.692488
}