{
  "game_id": "0022000482",
  "espn_id": "401267642",
  "date": "Feb 23, 2021",
  "matchup": "SAC @ BKN",
  "headline": "Nets use balanced scoring to send Kings to 8th straight loss",
  "body": "NEW YORK -- — Bruce Brown scored 13 of his 29 points in the fourth quarter to lead the Brooklyn Nets to a 127-118 win over the Sacramento Kings on Tuesday night.\n\n\r\n                    The Nets had five players score in double figures. James Harden recorded his sixth triple-double with the Nets, finishing with 29 points, 11 rebounds and 14 assists. He ranks second in franchise history, one behind Jason Kidd. \n\n\r\n                    Kyrie Irving added 21 points as Brooklyn extended its winning streak to seven games and improved to 21-12. The Nets swept their regular-season series against Sacramento, which has lost eight in a row.\n\n\r\n                    De’Aaron Fox led the Kings with 27 points.\n\n\r\n                    Despite leading for much of the game, the Nets led by a point (110-109) after Fox hit a 3-pointer midway through the fourth quarter. But, in a little more four minutes, the Nets went on a 14-1 run to put the game away.\n\n\r\n                    “It's all (defense),” lamented Harrison Barnes. “We have to be better at that.”\n\n\r\n                    On a star-laden squad, Brown played the role of closer. Brown, who has filled in for the injured Kevin Durant at power forward, knocked down two 3-pointers from in front of the Kings’ bench and added a jump shot for good measure.\n\n\r\n                    “He competes his butt off every single night,” Harden said of Brown. “He does it all.”\n\n\r\n                    TIP-INS:\n\n\r\n                    Nets: Harden was named as a reserve to the NBA’s All-Star Game. The announcement marks the ninth time in the 31-year old Harden’s 11 seasons that he was selected to be an All-Star.\n\n\r\n                    Entering the game, Harden was averaging 24.9 points and 11.4 assists in the 18 games he has played with the Nets since being acquired in a four-team trade on Jan. 13.\n\n\r\n                    “I don’t want to diminish how great he is because I kind of expected this,” Nets head coach Steve Nash said about Harden during his pregame availability. “It’s even more impressive when he’s on your team.”\n\n\r\n                    Along with the 31-year old Harden, the Nets will be represented at the Mar. 7 game in Atlanta by Irving and Durant. It will be the first time in franchise history that the Nets have three players selected to an All-Star team in a single season.\n\n\r\n                    Kings: Details matter. And the Kings have allowed the details of their game to slip. That, in essence, was Sacramento coach Luke Walton’s assessment of his team prior to the game.\n\n\r\n                    “Our guys want to start winning again,” Walton said. “They tasted it. We’re in a tough stretch.” Prior to the current eight game losing streak, the Kings had won seven of eight. “When we were winning games, we were doing those (detail things) at a pretty high level, and that’s dropped off with the losses. We have to understand, win or lose, we have to keep playing the same type of way. ... Walton’s pregame availability was delayed as the Sacramento coach was caught in traffic. “New York traffic still exists,” he said in a deadpan fashion. “Even in a pandemic.”\n\n\r\n                    ETC.:\n\n\r\n                    The game marked the first time in the truncated season that the Nets played in front of home fans due to the coronavirus pandemic. New York Gov. Andrew Cuomo announced earlier this month that stadiums and arenas could open with limited capacity, and Tuesday night’s Nets and Knicks games were the first events in New York City to have fans in the building. The 324 fans who attended the game at Barclays Center had to provide evidence of a negative COVID-19 test administered three days before the event, and were socially distanced, sitting in the designated seats in the lower bowl. “It was definitely nice,” Nets forward Joe Harris said.\n\n\r\n                    UP NEXT:\n\n\r\n                    Kings: Cross the East River to visit the surprising New York Knicks on Thursday night.\n\n\r\n                    Nets: Hosts Orlando Magic on Thursday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997173.4520671
}