{
  "game_id": "0022401071",
  "espn_id": "401705637",
  "date": "Mar 28, 2025",
  "matchup": "MIN vs. PHX",
  "headline": "Randle and Edwards help Timberwolves complete a 4-game season sweep of Suns 124-109",
  "body": "MINNEAPOLIS -- — Julius Randle scored 25 points, Anthony Edwards finished with 20 after missing the second quarter due to injury and the Minnesota Timberwolves beat the Phoenix Suns 124-109 on Friday night.\n\n\r\n              The Timberwolves completed a four-game season sweep of the Suns. Minnesota has won its last seven against Phoenix, dating to last year’s postseason.\n\n\r\n              Edwards was hit in the face by Phoenix's Kevin Durant with 2:43 to play in the first quarter. Edwards attempted to intercept a pass intended for Durant, whose arm caught Edwards in the nose. Edwards fell to the ground in pain and remained down for a minute before being escorted to the locker room.\n\n\r\n              Durant had a team-best 23 points for Phoenix. Collin Gillespie added a career-high 22 points and nine assists.\n\n\r\n              The Suns have lost two in a row after winning four straight games. The Suns' Bradley Beal missed his sixth straight game due to a left hamstring injury.\n\n\r\n              Takeaways\r\n              Suns: Gillespie’s scoring outburst was a surprise for Phoenix. He had reached double-digit points just twice this season and averaged 4.0 points.\n\n\r\n              Timberwolves: Without Edwards for an extended period, Minnesota managed to keep Phoenix at a distance. The Wolves took a 12-point lead into halftime, thanks to offense from Randle, Naz Reid, and Jaden McDaniels.\n\n\r\n              Key moment\r\n              The incident between Durant and Edwards had Timberwolves fans concerned. Minnesota's star didn't return until after halftime. When he did take the floor again, he received a standing ovation from the home fans.\n\n\r\n              Key stat\r\n              Devin Booker, the Suns’ second-leading scorer, finished with 10 points, matching his season low. He didn't score his first points until 3:33 remained in the third quarter. Booker missed his first eight shots overall and first five from long distance.\n\n\r\n              Up next\r\n              Both teams play Sunday. Phoenix hosts Houston, while Minnesota hosts Detroit.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998075.5719218
}