{
  "game_id": "0022200325",
  "espn_id": "401468480",
  "date": "Dec 01, 2022",
  "matchup": "DET vs. DAL",
  "headline": "Hayes leads Pistons to overtime victory over Mavericks",
  "body": "DETROIT -- — Killian Hayes scored eight of 22 points in overtime as the Detroit Pistons recovered from blowing a late lead to beat the Dallas Mavericks 131-125 on Thursday night.\n\n\r\n              Christian Wood’s dunk tied the game at 125 with 1:35 left in overtime, but Hayes answered with back-to-back 3-pointers to put the Pistons ahead by six with 41.6 left and seal the win.\n\n\r\n              “They were switching me into a one-on-one matchup, so I knew I could get a shot off,” he said. “The first one felt good and the second one felt even better.”\n\n\r\n              Hayes has struggled in the first 2 1/2 years of his career, shooting 36.8%, including 27.6% on 3-pointers, but coach Dwane Casey has always stressed his value doesn't come from his shot.\n\n\r\n              “We need a point guard who can play quarterback on the floor,” Casey said. \"We don't have a lot of one-on-one players, so we need that quarterback to organize the offense and make sure everyone is getting touches.\n\n\r\n              “He's our best playmaker, he's our best point guard and he's our best defender against point guards. That's what we need from him.”\n\n\r\n              Bojan Bogdanovic led the Pistons with 30 points while Marvin Bagley III added 19 points and 13 rebounds.\n\n\r\n              “Bogey had his European basketball pride at stake tonight, playing against Luka (Doncic), and he did what he does,” Casey said. “I'm sure Luka grew up watching Bogey, so they both wanted to have big games tonight.”\n\n\r\n              Doncic had 35 points and 10 assists for Dallas. Tim Hardaway Jr. scored 26 points.\n\n\r\n              “I'm disappointed with the effort we gave on the defensive end,” Mavericks coach Jason Kidd said. “That's something we will talk about tomorrow.”\n\n\r\n              Hayes' jumper gave the Pistons a 111-104 lead with 4:14 to play in regulation and Doncic missed a 3-pointer at the other end. Another Hayes jumper moved Detroit's run to 10-0 and the lead to 113-104.\n\n\r\n              After a Christian Wood dunk, Hayes hit his third straight jumper to keep Detroit up by nine.\n\n\r\n              “He got into a rhythm and the resistance from our defense was not high,” Kidd said. “It was more like a shootaround, but you still have to give Hayes credit.”\n\n\r\n              The lead was still eight with two minutes left and five when Doncic missed a pair of free throws with 1:00 left -- giving the Mavericks 15 misses on the game -- but the Pistons didn't take the chance to ice the game.\n\n\r\n              Hardaway Jr. got the rebound and fed Doncic for a 3-pointer to make it 117-115. Alec Burks missed at the other end and ex-Piston Reggie Bullock's layup tied the game with 22.6 seconds left. Isaiah Stewart missed a 3-pointer and the clock ran out during the scramble for the layup.\n\n\r\n              “We had that lead and let them come back and tie it, but we didn't fold,” Hayes said. “We stayed strong, we played defense and we hit shots. We deserved this one.”\n\n\r\n              Doncic had 20 points in the first half, and the Mavericks got to 60 points despite missing eight of 17 free-throw attempts in the half.\n\n\r\n              HITTING THE BOARDS\n\n\r\n              After the Pistons struggled to rebound the ball on both ends of the floor in Tuesday's 30-point loss to the New York Knicks, Casey challenged Bagley and Stewart to step up their games.\n\n\r\n              “I told them there was no reason to keep starting two bigs if they weren't going to dominate the glass -- I could put Corey Joseph in the lineup,” Casey said. “Tonight they came through and did a really, really great job on the boards.”\n\n\r\n              FREE THROW STRUGGLES\n\n\r\n              The Mavericks shot 53.5% from the floor, but only 48.3% from the free-throw line, missing 15 shots from the line in an overtime loss. Dallas had only shot under .500 on at least 20 attempts once in franchise history, going 10-21 in a loss to the New Jersey Nets on March 14, 1998.\n\n\r\n              “We didn't do the job we were supposed to do on defense, so when you aren't making free throws as a team, it doesn't help,” said Hardaway Jr., who was 2-4 from the line.\"\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Visit the New York Knicks on Saturday.\n\n\r\n              Pistons: Host the Memphis Grizzlies on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994382.040761
}