{
  "game_id": "0022400694",
  "espn_id": "401705260",
  "date": "Feb 01, 2025",
  "matchup": "POR vs. PHX",
  "headline": "Deandre Ayton leads Trail Blazers to 127-108 victory over Suns in opener of 2-game set",
  "body": "PORTLAND, Ore. -- — Deandre Ayton had 24 points on 11-of-12 shooting against his former team and the Portland Trail Blazers opened a two-game set against the Phoenix Suns with a 127-108 victory Saturday night.\n\n\r\n              The teams will meet again Monday night in Portland.\n\n\r\n              Jerami Grant added 20 points for Portland, and Toumani Camara had 18 points.\n\n\r\n              Devin Booker led Phoenix with 37 points, and Kevin Durant had 22. The Suns were on the second night of a back-to-back after beating Golden State 130-105 on Friday.\n\n\r\n              After Portland took a 61-46 halftime lead, Booker was fouled on a 3-pointer on the first play after halftime, sparking a personal run of 15 straight Phoenix points. Durant's 3-pointer — the first non-Booker points in the quarter for Phoenix — made it 74-64, but that was as close as the Suns got in the period.\n\n\r\n              Takeaways\r\n              Suns: Phoenix center Nick Richards has made his presence felt during his first seven games since coming over in a trade from Charlotte. “He gives us a presence inside. A guy that can come and block shots, rebounds and handle the glass,” Suns coach Mike Budenholzer said.\n\n\r\n              Trail Blazers: Second-year forward Toumani Camara was named to the NBA Rising Stars roster as an injury replacement Friday. “I was obviously disappointed that he wasn’t named initially,” Blazers coach Chauncey Billups said.“I just think, especially for coaches, we appreciate guys like him.\"\n\n\r\n              Key moment\r\n              Shaedon Sharpe’s windmill dunk with 4:05 left in the third quarter put the Blazers up by 18, sending the crowd into a frenzy.\n\n\r\n              Key stat\r\n              Portland outscored Phoenix 66-32 in the paint.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998176.1899562
}