{
  "game_id": "0021500308",
  "espn_id": "400828195",
  "date": "Dec 07, 2015",
  "matchup": "LAL @ TOR",
  "headline": "Lowry scores 27, Raptors beat Lakers 102-93 to end slide",
  "body": "TORONTO -- While the sellout crowd left no doubt it came to watch Kobe Bryant say goodbye to Canada, Terrence Ross took full advantage of his first start this season.\nThe former NBA slam dunk champion proved a sparkplug with 22 points, including a team-high nine in the fourth quarter, as the Toronto Raptors put two tough home losses in the rearview mirror and beat the Los Angeles Lakers 102-93 on Monday night.\nKyle Lowry scored 27 points for the Raptors, and Bismack Biyombo had a career-high 15 points with 13 rebounds.\nBut it was Ross' strong, one-handed slam that finally gave Toronto the lead for good with 6:55 to go, and the Raptors quickly went on an 11-0 run to remove any doubt about the final outcome.\n\nRoss started in place of injured forward DeMarre Carroll.\n\"He was great and that is the T we need on a nightly basis,\" teammate DeMar DeRozan said. \"When he does that it makes our job a lot easier.\"\nIn what was almost certainly his last NBA appearance in Toronto, Bryant shot 8 of 16 for 21 points as the Raptors swept the season series from the Lakers for the first time.\nThe crowd of 20,163, the largest ever at Air Canada Centre to watch the five-time NBA champion, certainly showed its appreciation for his 20 years in a Lakers uniform.\n\"Wow! Wow!\" Bryant said afterward. \"It felt absolutely amazing. Sitting on the bench and they started chanting, `We want Kobe!' (I was like), give me 5 minutes.\"\nBryant, who announced his plans to retire after this season, has averaged 27 points in 33 career games against the Raptors. He's scored 891 points against them, fifth all-time among opponents. And he has reached 40 points five times versus Toronto, more than any other player.\nBryant was given a standing ovation when Lakers coach Byron Scott removed him for the final time with 24.6 seconds remaining.\n\"It's a little bit of everything to see him walking away from the game, especially someone I idolized and grew up watching,\" said DeRozan, raised in the Los Angeles area. \"I'm honored to have the opportunity just to compete against him.\n\"When I'm old I can add in stories that I played against Kobe, like a lot of older guys do about Michael Jordan.\"\nAfter managing only five points in Sunday's loss at Detroit, where he was suffering from a stomach flu, Bryant looked much more like his old self -- shooting 50 percent from the floor for the first time this season.\n\"He rebounded the ball, played much better under control, took some great shots,\" Scott said. \"We had some great looks all night long, we just didn't knock them down; I like the pace that we played at much better as well.\"\nScott shuffled his starting lineup before the game, removing rookie guard D'Angelo Russell and second-year forward Julius Randle and replacing them with Lou Williams and Larry Nance Jr. Russell, the second overall pick in this year's draft, and Randle, the seventh choice in 2014, had previously started every game.\nRandle had 15 points and 11 rebounds off the bench.\n\"Those two still have to understand how to play this game and it's a tough game,\" Scott said. \"They're young, and they're a big part of our future, no doubt about that, but I still think at this point of their career you can still learn some things by sitting there watching as well.\n\"It's not so much that they did anything wrong, it was more of a change and get some other fresh blood in there.\"\nINJURY BUG\nToronto announced before the game that Carroll will miss an indefinite period of time with a bruised right knee. \"He's been banged up and nicked up the whole time he's been here and it finally got him,\" coach Dwane Casey said.\nSTREAK SNAPPED\nLowry's run of 24 straight games with at least one steal ended. It was the longest streak by a Raptors player since Alvin Williams had a steal in 32 consecutive games in 2001.\nTIP-INS\nLakers: Los Angeles is five games into its longest road trip in terms of games (eight) and days away from home (13) since a nine-game swing in 2007-08. ... The loss dropped the Lakers to 3-9 against Eastern Conference teams. ... Lou Williams returned to Toronto for the first time since winning the NBA's Sixth Man of the Year award last season with the Raptors.\nRaptors: Toronto carried a lead into the second quarter for the first time in seven games. ... Toronto improved to 11-3 when holding opponents under 100 points. ... After setting a career high with 14 points in Saturday's loss to Golden State, backup center Lucas Nogeira (left ankle) sat out.\nUP NEXT\nLakers: At Minnesota on Wednesday.\nRaptors: Host San Antonio on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994301.2857869
}