{
  "game_id": "0021900240",
  "espn_id": "401160882",
  "date": "Nov 25, 2019",
  "matchup": "CLE vs. BKN",
  "headline": "Dinwiddie's jumper leads Nets over Cavaliers, 108-106",
  "body": "CLEVELAND --  Spencer Dinwiddie keeps coming through in the clutch for the Brooklyn Nets.\n\nDinwiddie's fadeaway jumper with 1.9 seconds remaining gave Brooklyn its fourth straight victory, 108-106 over the Cleveland Cavaliers on Monday night.\n\nDinwiddie scored 23 points on the day he was voted Eastern Conference player of the week.\n\nThe Nets are 5-1 without leading scorer Kyrie Irving, who missed his sixth straight game with a sore shoulder. Dinwiddie is averaging 24.6 points in Irving's absence.\n\n\"Spencer Dinwiddie just put on a clinic on how to keep your team under control and make the right play,\" Cleveland coach John Beilein said.\n\nFollowing a shot clock violation and the score tied 106-all, the Nets called timeout with 6.2 seconds left. Dinwiddie, after taking the inbounds pass from Joe Harris, dribbled around Cedi Osman to the right of the key and hit the tiebreaking shot from 18 feet.\n\nDinwiddie improvised after taking the pass and was hoping center Jarrett Allen would bail him out if he missed.\n\n\"I was trying to get a shot up in the first three seconds, so Jarrett had a chance to tip it in,\" Dinwiddie said. \"Cedi was kind of sliding right, so I took a couple dribbles and put it up.\"\n\nBrooklyn coach Kenny Atkinson gave Dinwiddie credit for the result.\n\n\"It was not a great play (drawn up), but a great individual play by Spencer,\" he said.\n\nCavaliers forward Kevin Love was out for the second straight game because of a sore back.\n\nJarrett Allen had 22 points and a season-high 21 rebounds, going 9 of 10 from the field and adding a key block when he swatted Jordan Clarkson's shot out of bounds with eight seconds left and the game tied.\n\n\"I should have kept in inbounds, but I got a little excited,\" Allen said. \"I knew I had to be a little bit careful and not foul.\"\n\nCleveland erased a 106-97 deficit with just over 2 minutes left and cut the lead to one on Clarkson's 3-pointer. Collin Sexton tied the game with a free throw, but missed the second shot with 21 seconds to play.\n\n\"It felt good,\" Sexton said. \"It went in and out. I've just got to make it the next time. I know I should have made it.\"\n\nCleveland maintained possession, but Allen blocked Clarkson's shot and the Cavaliers followed with their shot clock violation.\n\nClarkson scored 23 points while Larry Nance Jr. had 20 points and 13 rebounds for Cleveland, which has lost seven of eight.\n\nBrooklyn didn't shoot a free throw in the first half but was 9 of 11 at the line in the third quarter. The Nets didn't get to the line in the fourth.\n\nTIP-INS\n\nNets: Allen made two free throws with 8:19 remaining in the third quarter. ... G Iman Shumpert, signed by Brooklyn two weeks ago, was also a member of the Cavaliers' championship team. He hit a 3-pointer and played 18 minutes.\n\nCavaliers: Love, who was sidelined Saturday, had been listed as questionable and the team announced he wasn't playing after he went through pregame warmups. ... Nance started in Love's place for the second straight game.\n\nNOT IN TOWN\n\nIrving, a star on the Cavaliers' championship team in 2016, has played in Cleveland one time since being traded to Boston prior to the 2017-18 season, coming in that season's opener. He missed both of the Celtics' appearances last season.\n\nIrving will also miss Wednesday's game in Boston, the Nets' first trip there this season. He was injured in a 119-114 loss at Utah on Nov. 12 and played through the injury two nights later in Denver.\n\nDOMINATING IN THE MIDDLE\n\nAllen recorded the second 20-point/20-rebound game of his career.\n\n\"Jarrett Allen is playing fantastic,\" Atkinson said. \"He's one of the best rim protectors in the league and came up with another big play.\"\n\nUP NEXT\n\nNets: Visit Boston on Wednesday in the opener of a home-and-home series.\n\nCavaliers: Host Orlando on Wednesday in the third game of a six-game homestand.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996327.601035
}