{
  "game_id": "0021800870",
  "espn_id": "401071543",
  "date": "Feb 21, 2019",
  "matchup": "MIL vs. BOS",
  "headline": "Antetokounmpo scores 30 points, Bucks beat Celtics 98-97",
  "body": "MILWAUKEE --  Giannis Antetokounmpo and the Milwaukee Bucks shook off any All-Star break hangover in a hurry.\n\nAntetokounmpo scored 12 of his 30 points in the fourth quarter, Khris Middleton hit a 3-pointer in the closing seconds and the NBA-leading Bucks held off the Boston Celtics 98-97 on Thursday night.\n\nOn the second-to-last position, Marcus Smart forced a jump ball with Antetokounmpo. Antetokounmpo tipped the jump to Brook Lopez, who deflected it toward the basket, but missed as the shot clock expired.\n\nThe referees huddled during the timeout and put 3.5 seconds on the clock for the Celtics.\n\nCrew chief Mike Callahan explained the call to a pool reporter after the game.\n\n\"With 0.2 seconds, the 24-second clock didn't start until Lopez possessed the ball,\" Callahan said. \"When he possesses the ball, you cannot have a legal shot attempt with 0.2 on the shot clock.\"\n\nCallahan explained that \"a legal tip play can occur with 0.1 or 0.2 of a second.\"\n\nSmart inbounded the ball over the towering Lopez and dropped a pass into Kyrie Irving's hands at the top of the key. With Eric Bledsoe draped all over him, Irving drove the lane, seemed to stumble and missed an awkward shot as time expired. The Bucks won the season series 2-1, their first over the Celtics since 2014-15.\n\nThe Celtics drew up a final play that put the ball in Irving's hands.\n\n\"Kyrie with the ball. That's what we wanted,\" Al Horford said. \"Get the ball in Kyrie's hands. Let him create. I felt like we put ourselves in a good position there.\"\n\nIrving took a philosophical approach.\n\n\"It happens,\" he said. \"Just part of the break and coming off and playing the first game, getting the cold ones out.\"\n\nFor Antetokounmpo and Irving, who had 10 of his 22 points in the fourth, it was a rematch since squaring off Sunday at the All-Star Game. Antetokounmpo captained Team Giannis, while Irving started for Team LeBron.\n\nIrving, who has battled a variety of injuries this season, used the All-Star Game to get ready for his return to action. He had missed the two previous games with a strained right knee and 11 overall.\n\nAntetokounmpo added 13 rebounds, Middleton had 15 points and a season-high 13 rebounds, and Malcolm Brogdon had 15 points for the Bucks. They have won 15 of the last 17 games, including nine of the last 10, to improve to 44-14 and a season-high 30 games over .500.\n\nHorford added 21 points and a season-high 17 rebounds for Boston, and Jayson Tatum had 17 points and 10 rebounds.\n\nTIP-INS\n\nCeltics: F Gordon Hayward did not play after spraining his right ankle during a workout on Tuesday. ... F/C Aron Baynes (left foot contusion) is sitting out the three-game trip.\n\nBucks: Mirotic made his Bucks' debut at forward with three minutes left in the first quarter. He scored 8 points and grabbed three rebounds in almost 14 minutes of action. He missed his first four games with a calf injury. ... G Donte DiVincenzo (bilateral heel bursitis) did not play.\n\nQUOTABLES\n\n\"That 3 by Middleton at the top of the key really hurt us,\" Horford said about the basket from 27 feet that snapped a 95-all tie.\n\n\"I knew it was going in,\" Antetokounmpo said about Middleton's 3. \"I've seen that play a million times happen in practice, in games. He is just so calm in those situations.\"\n\n\"That's a tough one,\" Celtics coach Brad Stevens said about not fouling Giannis on the Bucks' last possession. \"We rolled with that. It ended up as good as it could've ended up.\"\n\nWAYNE EMBRY HONORED\n\nWayne Embry, former Bucks general manager and player, was honored for his accomplishments and impact on the NBA. The State of Wisconsin and the City of Milwaukee declared that Thursday was Wayne Embry Day in a pregame ceremony.  The Bucks also played a video tribute to Embry during the second quarter and introduced him to a standing ovation.\n\nEmbry became the NBA's first black general manager when the Bucks tabbed him to run the organization from 1972-79. He was NBA Executive of the Year in 1992 and 1998, serving as general manager and later president of the Cleveland Cavaliers. Embry, a five-time NBA All-Star, capped his 11-year playing career with the Bucks in their inaugural 1968-69 season. He won an NBA championship in 1968 with the Celtics.\n\nUP NEXT:\n\nCeltics: At Chicago on Saturday night.\n\nBucks: Host Minnesota on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994469.855426
}