{"game_id": "161115100", "title": "Synthetic Recap", "body": "SALT LAKE CITY — On a night when the Delta Center faithful witnessed history, individual brilliance trumped a collective effort. Despite a heroic, record-breaking performance from Vancouver’s Blue Edwards, the Utah Jazz secured a hard-fought 104-96 victory over the Grizzlies in 1997.\n\nThe story of this game, however, belongs to one man and one man alone: Blue Edwards.\n\nThe veteran forward waged a one-man war against the Western Conference powerhouse, delivering a performance for the ages. Edwards was simply unguardable, pouring in a colossal **48 points** on a scintillating 18-of-27 shooting from the field. He attacked the rim with ferocity and punished the Jazz from mid-range, single-handedly keeping the visiting Grizzlies within striking distance throughout the contest. His 48-point outburst was a franchise-record scoring barrage that etched his name into the Vancouver record books.\n\nYet, even a historic night from Edwards was not enough to overcome the disciplined machine that was the Utah Jazz. Karl Malone, the Mailman, delivered 26 points of his own, while Jeff Hornacek’s all-around game of 17 points and 8 assists provided crucial support. Most importantly, John Stockton orchestrated the offense with typical precision, dishing out 14 assists to keep the Jazz offense humming.\n\nEvery time Vancouver threatened, Utah had a poised answer. The Jazz defense, while unable to stop Edwards, clamped down on his supporting cast, and their offensive execution down the stretch proved the difference.\n\nIn the end, the final score showed a Utah victory. But the lasting memory was of a legendary individual effort. Blue Edwards authored a night of pure, unadulterated offensive genius, a spectacular 48-point masterpiece that, despite ending in a loss, will forever be remembered as one of the most remarkable performances in the brief, but passionate, history of the Vancouver Grizzlies.", "source": "AI_Reconstruction"}