{
  "game_id": "0022300796",
  "espn_id": "401585424",
  "date": "Feb 22, 2024",
  "matchup": "PHX @ DAL",
  "headline": "Doncic scores 41 points, pairs with Irving to help Mavs beat Suns 123-113 for 7th straight victory",
  "body": "DALLAS -- — The longest winning streak of the season for the Dallas Mavericks coincides with a tie for the longest stretch of games together for the star pairing of Luka Doncic and Kyrie Irving.\n\n\r\n              Doncic scored 41 points, Irving had 29 and the Mavericks beat the Phoenix Suns 123-113 on Thursday night, extending their winning streak to seven in both teams' return from the All-Star break.\n\n\r\n              Dallas pulled even with Phoenix in the standings at 33-23 and took the head-to-head tiebreaker with a 2-1 record in a pairing of teams battling for a guaranteed spot in the playoffs.\n\n\r\n              Doncic had 11 assists and nine rebounds matched against fellow All-Stars Devin Booker, who scored 35 points, and Kevin Durant, who had 23 on an ordinary shooting night for the 14-time All-Star. The Suns had won five of six before the break. \n\n\r\n              The Dallas surge started when Irving returned from a sprained thumb. The Mavs have been without Doncic or Irving, or both, in 27 games because of injuries. Their seventh straight together matched the previous long stretch this season, from the first month.\n\n\r\n              “I think it answers the questions that those two co-exist quite well,” coach Jason Kidd said. “I think it just shows again, our health, our energy, everything’s in a positive way right now. I think the guys are having fun. You can see that energy on the floor.”\n\n\r\n              Dallas kept its hot streak going through the break in the first visit from new majority owner Miriam Adelson. The widow of casino mogul Sheldon Adelson was sitting courtside. \n\n\r\n              The deal between her company, Las Vegas Sands Corp., and Mark Cuban was approved by the NBA in December. Cuban is now the alternate governor. \n\n\r\n              Irving, who missed the first two meetings, scored 13 points in the first quarter and restored a double-digit lead early in the fourth with a nifty behind-the-back dribble and spin move for a layup.\n\n\r\n              A smiling Doncic greeted Irving when the Suns called a timeout after Irving's layup, and the star pairing provided the finishing blow when Irving passed after rising for a jumper and Doncic hit a 3-pointer for a 128-113 lead. Both came out of the game at the next whistle.\n\n\r\n              The Suns were without guard Bradley Beal, who is dealing with left hamstring tightness. He scored 20 points in a 132-109 Phoenix victory in Dallas a month ago, when Booker scored 22 of his 46 points in a decisive third quarter as the Suns rallied from 16 points down.\n\n\r\n              This time, it was Irving who sparked a Dallas rally.\n\n\r\n              “You just have to know that, especially after he makes one, that the next one is coming up,” Booker said. “He’s a great player and hard to guard. We definitely could have limited some of those transition looks.”\n\n\r\n              The Mavs scored the first 16 points of the second half to finish a 33-9 run that started after the Suns took their biggest lead at 54-43 midway through the second quarter.\n\n\r\n              “We didn’t start the third quarter with enough attentiveness,” Phoenix coach Frank Vogel said. “We did get a little too stagnant offensively. We had some breakdowns with what we were supposed to do. That led to some tough possessions.”\n\n\r\n              Tim Hardaway Jr. and P.J. Washington scored 12 points apiece for Dallas. Eric Gordon had 16 for Phoenix.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Houston on Friday night.\n\n\r\n              Mavericks: At Indiana on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996648.559907
}