{
  "game_id": "0022400104",
  "espn_id": "401704670",
  "date": "Oct 28, 2024",
  "matchup": "MIL @ BOS",
  "headline": "Jaylen Brown scores 30 points, Payton Pritchard makes 8 3s as Celtics beat Bucks 119-108",
  "body": "BOSTON -- — Jaylen Brown scored 30 points, Payton Pritchard came off the bench and hit eight 3-pointers en route to 28 points, and the Boston Celtics beat the Milwaukee Bucks 119-108 on Monday night.\n\n\r\n              Reigning Eastern Conference Player of the Week Jayson Tatum added 15 points and eight rebounds for Boston (4-0). Derrick White had 13 points and eight assists.\n\n\r\n              Damian Lillard led the Bucks with 33 points, seven rebounds and seven assists, and Giannis Antetokounmpo had 30 points, 10 boards and six assists. Milwaukee has lost three straight after winning its opener.\n\n\r\n              It was close until late in the third quarter, when Pritchard hit a 3-pointer with 0.4 seconds left, putting Boston ahead 90-82.\n\n\r\n              The Celtics scored the next seven points for a 15-point lead. Pritchard hit another 3-pointer during the spree.\n\n\r\n              Takeaways\r\n              Bucks: Coming off a 13-point loss at Brooklyn on Sunday, they showed some toughness late into the third quarter before Boston’s offense took over.\n\n\r\n              Celtics: They keep taking a lot of 3-pointers and making them. The Celtics, who tied the NBA record with 29 3s in their season-opening win over the Knicks, were 18 of 47 from beyond the arc on Monday.\n\n\r\n              Key moment\r\n              The Bucks led 80-79 before the Celtics went on an 18-2 run that spanned the final two minutes of the third quarter and the opening 1:37 of the fourth.\n\n\r\n              Key stat\r\n              Pritchard was 8 of 12 on 3-pointers and fell one short of his career high of nine, set on April 9, 2023.\n\n\r\n              Up next\r\n              The Bucks are at Memphis on Thursday to close their three-game trip, and the Celtics visit Indiana Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997862.108427
}