{
  "game_id": "0021800496",
  "espn_id": "401071177",
  "date": "Dec 23, 2018",
  "matchup": "MEM @ LAL",
  "headline": "Grizzlies end 5-game skid by beating Lakers 107-99",
  "body": "LOS ANGELES --  Jaren Jackson Jr. scored 27 points and the Memphis Grizzlies ended a five-game losing streak with a 107-99 victory over the Los Angeles Lakers on Sunday night.\n\nMarc Gasol had 17 points, nine rebounds and eight assists and Mike Conley added 17 points and eight assists for the Grizzlies, who had lost four straight road games.\n\nLeBron James had 22 points, 14 rebounds and seven assists and Brandon Ingram scored 20 for the Lakers, who had won six in a row at home.\n\nIvica Zubac added 19 points and Kyle Kuzma had 11. Kentavious Caldwell-Pope scored 10 off the bench as Los Angeles lost for the third time in four games overall.\n\nThe Grizzlies used a 10-3 run late in the fourth quarter to pull away, with Gasol making a layup through contact for a 93-91 lead with 3:42 to play. Conley then made consecutive 3-pointers and Garrett Temple hit a 3.\n\nJames made a layup to cut the Lakers' deficit to 104-99 with 38.5 seconds remaining, but Jackson drained a 3 at the other end.\n\nJames had 11 points in the third quarter and Caldwell-Pope hit a 3 with less than a second left to put the Lakers ahead 75-72 going into the fourth.\n\nTIP-INS\n\nGrizzlies: There is no timetable for F Chandler Parsons to return, coach J.B. Bickerstaff said. Parsons has missed 30 games because of soreness in his right knee. \"He's doing all the things, all the 5-on-5 and stuff, and we've just got to find the right opportunity to get him on the floor,\" Bickerstaff said. ... F Omri Casspi (illness) and F Joakim Noah (heel) each missed his third straight game.\n\nLakers: Zubac had 16 points on 8-of-10 shooting in the first half. ... C Tyson Chandler did not play because of back spasms. ... C JaVale McGee missed his fourth straight game. Los Angeles coach Luke Walton said McGee had recovered from flu-like symptoms but would need more time to get his stamina back to the point where he could play.\n\nUP NEXT\n\nGrizzlies: Host Cleveland on Wednesday.\n\nLakers: At Golden State on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994135.713481
}