{
  "game_id": "0022300797",
  "espn_id": "401585425",
  "date": "Feb 22, 2024",
  "matchup": "CHI vs. BOS",
  "headline": "White and Tatum team to help Celtics beat Bulls 129-112 for season-high 7th straight win",
  "body": "CHICAGO -- — The Boston Celtics enjoyed their break and were ready to get back to work. The NBA leaders got the job done in another convincing win.\n\n\r\n              Derrick White scored 28 points, Jayson Tatum added 25 and the Celtics won their season-high seventh straight game, beating the Chicago Bulls 129-112 on Thursday night.\n\n\r\n              White and Tatum each made five of Boston’s 23 3-pointers. Jaylen Brown scored 21 points, and the Celtics came away with another convincing victory after pounding Brooklyn by 50 prior to the All-Star break.\n\n\r\n              Boston went from leading by 16 to trailing by three at halftime before regaining control in the third. The Celtics outscored the Bulls 37-21 in the quarter.\n\n\r\n              “I thought the break was nice,” White said. “I think we were all just ready to get back to it. Just a big opportunity for us to be playing our best basketball going down the stretch. The break was nice. We just got to pick up where we were and try to keep getting better each day.”\n\n\r\n              Nikola Vucevic led Chicago with 22 points and 14 rebounds. Coby White scored 20 and DeMar DeRozan added 19 points on another rough night for the Bulls against the Celtics.\n\n\r\n              A blowout loss at Boston in late November left Chicago staggering with a 5-14 record. The Bulls steadied themselves somewhat, winning 21 of the next 36 despite losing Zach LaVine (foot) for the remainder of the season.\n\n\r\n              By the time this one was over, some fans were chanting for the Celtics. Boston backup Luke Kornet was dunking and, as he put it, “spaz” dabbing to celebrate.\n\n\r\n              “When the moment comes — there's a saying that I'm trying to get to and I can't find it. Sorry,\" he said. \n\n\r\n              The Celtics adjusted the way they defended the pick-and-roll after Chicago shot 70% in the second quarter and wasted little time taking control in the second half.\n\n\r\n              They scored 10 straight to start the third. Jrue Holiday and White each hit 3s, and Kristaps Porzingis capped the run with a 15-footer to boost Boston's lead to 69-62.\n\n\r\n              Back-to-back 3-pointers by Tatum and Sam Hauser made it 86-72 with just under four minutes left in the third. Hauser exited moments later after taking an inadvertent elbow to the face from Kornet.\n\n\r\n              “I think I got kinda pushed into him,” Kornet said. “I felt bad because the second it happened, I was like that was not good. ... I felt like he was going be knocked out, so I'm glad he's all right. His eye's a little swollen, but for the most part, he's alright.”\n\n\r\n              Vucevic scored 20 points and Dosunmu added 12 to help Chicago grab a 62-59 halftime lead after trailing by 16 in the first quarter.\n\n\r\n              The Bulls, who scored 39 points in the second, took their first lead since the opening minutes on two free throws by Vucevic to make it 57-56 with 1:58 left in the half. Dosunmu put them back on top when he made a 3 from the wing after a save by Alex Caruso in the closing seconds, and Chicago headed to the locker room up by three after Brown missed a 3 for Boston.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At New York on Saturday night.\n\n\r\n              Bulls: At New Orleans on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995880.832612
}