{
  "game_id": "0021600462",
  "espn_id": "400899904",
  "date": "Dec 26, 2016",
  "matchup": "MEM @ ORL",
  "headline": "Gordon scores 30 points, Magic beat Grizzlies 112-102",
  "body": "ORLANDO, Fla. --  The Orlando Magic have played without leading scorer Evan Fournier the last two games and cruised to double-digit victories both times.\n\nThe Magic rolled past the Memphis Grizzlies 112-102 on Monday night with all five starters scoring in double figures, led by Aaron Gordon's 30 points that included 4-for-4 shooting from behind the 3-point line.\n\n\"The ball was moving, and my teammates did a great job of finding me,\" said Gordon, who hit 11 of 15 shots. \"They realized I had a hot hand and kept coming to me. I was just being present, just playing the game of basketball.\"\n\nSerge Ibaka added 16 points and Bismack Biyombo had 10 points and 12 rebounds. Elfrid Payton contributed 16 points and seven assists off the bench.\n\nBackup center Nikola Vucevic had 13 points and nine rebounds for the Magic, who routed the Los Angeles Lakers 109-90 in their previous game.\n\n\"When a top guy goes down in the NBA, everyone else gets an opportunity,\" Orlando coach Frank Vogel said. \"Other guys get a chance to show what they can do and rise up. It's not uncommon for that to happen, but I don't think that is something that is sustainable for us.\"\n\nNevertheless, the Magic had an easy night against a Memphis team that entered best in the NBA in field goal percentage defense (42.7 percent) and second-best in points allowed (97.3 per game).\n\nOrlando shot 50.8 percent from the field, including 13 of 26 from 3-point range.\n\n\"I thought we did move the ball well, but we made some guarded shots, too,\" Vogel said. \"Guys were stepping up and making plays.\"\n\nMemphis got 17 points from Mike Conley. Troy Daniels had 16 and Zach Randolph 13, but the Grizzlies were down early and never recovered.\n\nOrlando built a 25-point halftime lead and traded baskets with Memphis most of the final 24 minutes. The Grizzlies got to 109-94 with 3:15 left before Gordon hit a deep 3-pointer.\n\n\"We were dead tonight for whatever reason,\" Memphis coach David Fizdale said. \"We had nothing in the tank. We haven't shown that we can put together a true, consistent effort with the guys that really are going to play minutes for us.\"\n\nThree unlikely players -- Jodie Meeks, Payton and Biyombo -- sparked the first-half fireworks for the Magic, combining for 28 points on 10-of-12 shooting.\n\nGordon took over in the second half, scoring 15 points in the third period to keep the lead at 25. When Memphis pulled within 15 with just more than three minutes left, he responded with a deep 3-pointer.\n\n\"Aaron Gordon torched us tonight,\" Fizdale said. \"We had no answer for that kid. He had way more life to his body. All of them did.\"\n\nMAGIC TOUCH\n\nBiyombo likes what Orlando has shown lately at both ends of the floor. \"The last few games, our defense has been key,\" he said. \"Overall we share the ball and play for each other. If we play like that every night, we're a dangerous team.\"\n\nTIP-INS\n\nGrizzlies: Vince Carter, the oldest player in the NBA, played his 1,300th regular-season game. ... Chandler Parsons, who grew up in Orlando, didn't score in 12 minutes of action during the first half. Parsons, who hasn't played more than 23 minutes in a game this season, didn't dress for the second half.\n\nMagic: Fournier missed his second game with a bruised heel. ... Ibaka is averaging 20.6 points and 10 rebounds in his last three games. ... Meeks was just 6 for 28 from the floor in his previous five games.\n\nUP NEXT\n\nGrizzlies: Tuesday night at Boston, a team Memphis lost to 112-109 in overtime a week ago. \"I'm glad we play right away after getting our butts kicked,\" Fizdale said. \"We don't deserve a day off after that. It's time to get right back to work. If you're not up for that game, you're in the wrong business.\"\n\nMagic: Orlando completes a three-game homestand against Charlotte on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995609.4908988
}