{
  "game_id": "0021801096",
  "espn_id": "401071769",
  "date": "Mar 24, 2019",
  "matchup": "MIL vs. CLE",
  "headline": "Hobbled Antetokounmpo lifts Bucks past Cavs 127-105",
  "body": "MILWAUKEE --  Giannis Antetokounmpo seems to have recovered quickly from a recent ankle sprain.\n\nAntetokounmpo showed few signs he was bothered by the ailing right ankle, getting 26 points and 10 rebounds to lift to Milwaukee Bucks over the Cleveland Cavaliers 127-105 on Sunday.\n\nAfter experiencing no problems in the pregame workout, Antetokounmpo played in his second straight game after sitting out two because of his ankle. He made 11 of 16 shots and had seven assists and four blocks in 32 minutes.\n\n\"I'm going to keep having my mindset, play through the pain, push forward and do whatever it takes for my team to win,\" Antetokounmpo said. \"And, when it's something really, really bad, I know they're going to do a great job of pulling me out from the team and telling me to rest.\"\n\nKhris Middleton and George Hill added 17 points apiece for the Bucks. Hill was acquired from the Cavaliers in a three-team trade in early December.\n\nWith starting guard Malcom Brogdon out indefinitely with a foot injury, Hill is hoping to contribute more offensively.\n\n\"Definitely. Not only driving and shooting, just being aggressive,\" said Hill, who missed nine games into the early part of march with a groin strain. \"You know, we are losing 15 points a game there. Guys have to step up and find those points somewhere, and the good teams do.\"\n\nHill made 7 of 8 shots for his best offensive output with the Bucks, who shot 55 percent.\n\nKevin Love had 20 points, Jordan Clarkson 19 and Collin Sexton 18 for Cleveland.\n\n\"I think it all starts with Giannis,\" Love said. \"He makes it so tough on the defense. You try to collapse and they have the personnel to light you up. The have shooters all around. They're a tough team to guard.\"\n\nMilwaukee improved to an NBA-best 55-19. The Raptors were 51-22 entering Sunday's game at home against Charlotte.\n\nThe Bucks never trailed, jumping out to a 15-6 lead. Milwaukee led 68-55 at the half, but the Cavaliers pulled within 82-73 on David Nwaba's one-hander from the lane.\n\nHill's jumper from just inside the arc in the closing seconds put Milwaukee up 90-77 entering the fourth quarter.\n\nMilwaukee lost at Cleveland on Wednesday, 107-102, without Antetokounmpo, when the Bucks used only eight players due to other injuries.\n\n\"The Bucks came out and got hot early,\" Cleveland coach Larry Drew said. \"I think they made their first five 3s. They made shots early and we didn't. We got ourselves behind and tried to dig out of the hole. We put together a couple of good runs but on the road, we just didn't play well enough to come away with anything else.\"\n\nTIP-INS\n\nCavaliers: Coach Larry Drew was head coach of the Bucks for one season, 2013-14, when Antetokounmpo was a 19-year-old rookie. Drew called Antetokounmpo one of the top five players in the game. \"I always thought that he could get to that point, because you could see he was a hard worker and he really wanted it,\" Drew said. \"But him getting there as fast as he has, no I didn't anticipate that.\"\n\nBucks: Coach Mike Budenholzer said Antetokounmpo's health was more important than playoff positioning. \"We are dealing with his ankle, and as we have said, if we can have the first seed, that'd be great, but it's not the priority.\"\n\nBUCKS WAIVE DUVAL\n\nMilwaukee requested waivers on guard Trevon Duval on Sunday. Duval, a two-way player who spent most of the season in the NBA G League, was an undrafted free agent from Duke. He appeared in three games with the Bucks, averaging 1.7 points and 1.9 minutes. Duval appeared in 39 games for the Wisconsin Herd of the G League, averaging 12.5 points and 3.6 assists.\n\nJOHNSON'S JERSEY RETIRED\n\nMarques Johnson became the ninth Bucks player to have his jersey retired. Johnson, who played 11 seasons in the NBA, played for the Bucks from 1977-84. The Bucks drafted Johnson with the third overall pick in 1977 out of UCLA. He averaged 20.1 points over his NBA career. Johnson now is a TV analyst for the Bucks.\n\nUP NEXT\n\nCleveland hosts Boston on Tuesday.\n\nThe Bucks host Houston on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994456.070603
}