{
  "game_id": "0021900373",
  "espn_id": "401161015",
  "date": "Dec 13, 2019",
  "matchup": "IND @ ATL",
  "headline": "Brogdon, Sabonis spark Pacers' win over Hawks",
  "body": "ATLANTA --  Malcolm Brogdon wasn't about to let Trae Young score at will, not after the Indiana Pacers almost lost to the Hawks and their star point guard two weeks ago.\n\n\"He's a great shooter, a great player,\" Brogdon said. \"He has the ball in hands the whole game, so you have to be alert the whole time you're out there.\"\n\nBrogdon had 19 points and 12 assists, Domantas Sabonis had 12 points and 14 rebounds, and the Pacers beat Atlanta 110-100 on Friday night.\n\nT.J. Warren scored 18 points as all five Indiana starters finished in double figures. Sabonis, who began the game second in the NBA in double-doubles, has reached the marks in 11 straight games and 21 overall.\n\nThe Pacers improved to 5-2 this month and 17-9 overall. They are eight games over .500 for the first time this season.\n\nYoung had 23 points, but missed 21 of 30 shots from the field, as Atlanta lost for the 14th time in 16 games. DeAndre Hunter scored 21 and Jabari Parker 20 for the Hawks.\n\nYoung finished with 49 points in Indiana's one-point overtime win over Atlanta on Nov. 29, but this time Brogdon helped limit Young in the first half and teamed with reserve point guard Aaron Holiday to stymie him in the second.\n\n\"It's a good parallel, me and Aaron,\" Brogdon said. \"I'm a big guard. I can provide the length and bother him with my size. He's a smaller guard who get into him and stay in front of him. He can really harass him.\"\n\nAtlanta, which dropped to 6-20, began the game ranked last in 3-point accuracy and missed its first 14 attempts beyond the arc. The Hawks finished 6 for 28 on treys with Young missing 10 of 13.\n\n\"For me, trying to be one of the closers, I have to be better,\" Young said. \"I was getting wide-open looks and missing. I felt like I let my team down tonight.\"\n\nBrogdon drove the lane and converted with his right hand against Young to make it 108-100 with 1:09 remaining and hit a pair of free throws to end the scoring with 27.9 seconds left. He was the catalyst on offense.\n\nIndiana was coming off a 122-117 home win two nights ago over Boston, its best performance of the season as it beat an opponent that was 17-5 and had won four in a row.\n\nHoliday's layup put the Pacers back up by double-digits with 6:55 remaining, but Young answered with a 3 before Hunter's two free throws made it a five-point game. Sabonis, though, followed with a tip-in and then scored close to the rim with a left-hander to make it 101-94 with 4:56 remaining.\n\nThe Pacers' lead swelled to 18 early in the third, but the Hawks quickly pulled within nine on Parker's fast-break dunk. Cam Reddish's 3 from the left corner trimmed the lead to 81-76 late in the period before Holiday hit a straightaway 3 and T.J. McConnell's 12-footer gave the Pacers an eight-point advantage.\n\nAllen Crabbe's 3 from the left wing pulled Atlanta within three entering the fourth.\n\nTurner's three-point play put the Pacers up by 17 late in the first half. Indiana let the Hawks score 35 in the third quarter but limited them to 17 in the fourth.\n\n\"We want to play draw-and-kick and if they're not stopping us, get to the rim or get to the free throw line,\" Indiana coach Nate McMillan said.\n\nSERIES\n\nIndiana has won seven straight against the Hawks and 11 of the last 12. The Pacers won 105-104 in overtime at home two weeks ago, rallying from an 11-point halftime deficit and Young's 49 points.\n\nTIP-INS\n\nPacers: G Doug McDermott scored 16 points in 29 minutes off the bench. ... G Jeremy Lamb, a starter, had 11 points and has finished in double figures in all but one game this season. ... Indiana was outrebounded, 50-46, for the sixth straight game. ... Indiana is 12-7 against Eastern Conference opponents.\n\nHawks: G Kevin Huerter, in his fifth game back since missing 11 games with a left rotator cuff strain, was on a 30-minute limit. He started and scored five points. ... Atlanta is 3-13 against the East and 4-15 against opponents with a winning record.\n\nUP NEXT\n\nPacers: Host Charlotte on Sunday, the Los Angeles Lakers on Tuesday and Sacramento on Dec. 20.\n\nHawks: Host the Lakers on Sunday, at the New York Knicks on Tuesday and host Utah on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995864.839537
}