{
  "game_id": "0021800855",
  "espn_id": "401071528",
  "date": "Feb 13, 2019",
  "matchup": "DET @ BOS",
  "headline": "Celtics rally in 2nd half to end Pistons' win streak 118-110",
  "body": "BOSTON --  The Boston Celtics haven't played as well as they've expected at times this season.\n\nThey're hoping the games they've put together over the last six weeks are a sign of better things to come after the All-Star break.\n\nJayson Tatum scored 19 points and Gordon Hayward finished with 18 to help the Celtics hold off the Detroit Pistons 118-110 on Wednesday night.\n\nHayward added eight assists and five rebounds in his first start since Dec. 21. Al Horford finished with 17 points, 14 rebounds and eight assists. Jaylen Brown had 17 points and seven rebounds.\n\nThe Celtics have won seven out of their last nine. The loss ended the Pistons' four-game win streak.\n\nCoach Brad Stevens said he liked the way his team gutted things out coming off a close win over the 76ers on Tuesday.\n\n\"This was a good two days for this group,\" Stevens said. \"I thought it showed a lot of good character and hopefully we can enjoy the rest.\"\n\nAfter trailing by 11 in the first half, Boston outscored Detroit 34-20 in the third quarter and led by as many as 28 in the fourth.\n\nCeltics All-Star Kyrie Irving sat for the second straight game with a strained right knee, and Terry Rozier was also sidelined with an illness.\n\nStevens adjusted to their absences by starting Smart and Tatum in the backcourt and rounded out his lineup with Hayward, Horford and Marcus Morris.\n\nIt was another strong showing for Hayward, who now has scored 15 or more points in four of his last five games. He had only 10 such games in his first 48 games this season. Over his last five outings Hayward has averaged 17 points on 61 percent shooting (9 of 18 on 3-pointers), 5.2 rebounds and 4.8 assists.\n\n\"It was good the way we ended going into the break,\" Hayward said. \"It definitely builds some momentum.\"\n\nBlake Griffin led Detroit with 32 points and eight rebounds. Andre Drummond added 21 points and 17 rebounds.\n\nDespite the loss, Drummond said he is also encouraged.\n\n\"This past week, week and a half, I think we played really, really good basketball,\" he said. \"We set a goal to go 5-2 and we succeeded with that. ... Got a week off, take a break, come back and it's off to the races from there.\"\n\nTIP-INS\n\nPistons: Were just 5 of 19 from the field (26 percent) and 2 for 9 (22 percent) from 3-point range in third quarter.\n\nCeltics: Improved to 9-2 this season without Irving. .  Rookie Robert Williams (illness) also sat along with Aron Baynes (left foot contusion). . Smart's 3-pointer early in the third quarter ended his 0-for-20 slump from beyond the arc.\n\n`GREAT ACTOR'\n\nHorford and Griffin made contact going for a loose ball near the sideline late in the fourth quarter. Following a video review by officials, Horford was called for a flagrant foul. Asked about the play after the game, Horford rolled his eyes and smiled.\n\n\"Blake is a great actor,\" Horford said. \"I was going for the ball, and he sold it well. So, yeah, I don't think that was a flagrant foul.\"\n\nRUN TIME\n\nThe Celtics were energized early, jumping out to an 8-0 lead. But Detroit negated it, responding with a 24-5 run to nudge back in front as Boston relied heavily on jump shots and went through a nearly five-minute scoring drought.\n\nThe Celtics settled down, ending the opening period on a 15-5 run. Boston controlled the pace in the second quarter and led 57-52 at the half.\n\nIRVING UPDATE\n\nStevens said Irving's status is officially \"day-to-day,\" but that he could theoretically be cleared to play if the Celtics had a game scheduled for Friday or Saturday. As far as Irving's availability for the All-Star Game, Stevens said he should only suit up if his knee is completely healthy.\n\n\"If there's any issues at all and he's not 110 percent, I would not play,\" Stevens said.\n\nUP NEXT\n\nThe Pistons play Feb. 22 at Atlanta.\n\nThe Celtics return to action Feb. 21, beginning a three-game trip at Milwaukee.\n\n--\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994675.893978
}