{
  "game_id": "0022300288",
  "espn_id": "401584916",
  "date": "Dec 02, 2023",
  "matchup": "MEM @ PHX",
  "headline": "Booker returns with 34 points, Suns top Grizzlies 116-109",
  "body": "PHOENIX -- — Devin Booker returned after missing a game with a sprained right ankle and had 34 points, 10 rebounds and seven assists to lead the Phoenix Suns to a 116-109 victory over the Memphis Grizzlies on Saturday night.\n\n\r\n              Booker, who sat out Friday’s loss to Denver, hit a 3-pointer to start the fourth quarter and put the Suns up by 15, their biggest lead of the game to that point. He was also 13 for 13 from the free throw line.\n\n\r\n              Suns coach Frank Vogel said before the game that Booker was a game-time decision. The star guard ended up playing a game-high 37 minutes.\n\n\r\n              “He wanted to play yesterday,” Vogel said. “He played a great game. He is the leader of our offense in terms of organizing us. It's always tricky when he is out of the game, getting our guys in the right spot.”\n\n\r\n              Booker said his ankle, which forced him to miss action earlier in the season, caused problems again after the long flight from Toronto to Phoenix following a loss to the Raptors on Wednesday.\n\n\r\n              “When we landed after (the previous time) I could barely walk, but this one just kept getting better as time went by,” Booker said. \n\n\r\n              The Suns had a 35-22 advantage in made free throws. Grizzlies starters Jaren Jackson Jr., Desmond Bane, Jaylen Nowell and Bismack Biyombo all spent time on the bench with foul trouble.\n\n\r\n              “We tried to use our aggressiveness against them,” Booker said.\n\n\r\n              Kevin Durant had 27 points, though he missed his first free throw of the game to end his single-season team record streak at 67.\n\n\r\n              Phoenix’s Jusuf Nurkic, who had a season-high 31 on Friday, had 14 points and nine rebounds before fouling out with 5:34 to play.\n\n\r\n              Jackson led the Grizzlies with a season-high 37 points on 13-of-20 shooting. \n\n\r\n              “He’s being aggressive, making the right reads, understanding where his teammates are on the floor and where the double-teams are coming from. Really impressed with him,” Grizzlies coach Taylor Jenkins said.\n\n\r\n              Jackson did it against tough defense inside, particularly from Nurkic.\n\n\r\n              “He’s strong as an ox,” Jackson said. “It’s always a battle.”\n\n\r\n              “It was all angles, figuring out how to score today. Just driving — that’s all I had going for me.”\n\n\r\n              Bane scored 27 points — 20 in the fourth quarter — and Vince Williams Jr. scored 12 before fouling out. \n\n\r\n              The Grizzlies trailed by as many as 16 points before closing within six, but Durant and Yuta Watanabe made foul shots to close out the game.\n\n\r\n              Memphis had won its previous two games, beating Dallas on the road on Friday. Phoenix lost its previous two after winning seven straight.\n\n\r\n              Neither team led by more than five points until the Suns opened up a 69-57 lead midway through the third quarter.\n\n\r\n              The Suns were without Eric Gordon, sidelined with a right knee contusion sustained in Friday’s game. Memphis played without Derrick Rose (left ankle sprain) and Ziaire Williams (illness).\n\n\r\n              NEXT\n\n\r\n              Memphis: At Detroit Wednesday.\n\n\r\n              Phoenix: At Los Angeles Lakers Tuesday in the In-Season Tournament quarterfinals.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996037.833638
}