{
  "game_id": "0022201088",
  "espn_id": "401469243",
  "date": "Mar 22, 2023",
  "matchup": "MEM vs. HOU",
  "headline": "Morant back, Grizzlies top Rockets, clinch 1st in Southwest",
  "body": "MEMPHIS, Tenn. -- — Ja Morant finished with 17 points and five assists in his return to action after a league-imposed suspension and Jaren Jackson Jr. had season-high 37 points and 10 rebounds as the Memphis Grizzlies defeated the Houston Rockets 130-125 on Wednesday night and clinched first place in the Southwest Division.\n\n\r\n              Desmond Bane finished with 20 points and Tyus Jones 14 for Memphis, and each added seven assists as the Grizzlies claimed their second consecutive division title.\n\n\r\n              Morant, who did not start, was back in action after missing nine games — eight because of an NBA suspension. The NBA assessed the suspension after a live stream from a Denver-area strip club earlier this month showed Morant briefly waving a firearm. Morant underwent counseling at a Florida facility for stress relief during the suspension.\n\n\r\n              The two-time All-Star guard, who entered the game after a timeout with 3:05 left in the first quarter in place of starter Tyus Jones, ended up playing 24 minutes and shot 6 for 13 overall and 5 for 6 from the line. He also had four rebounds.\n\n\r\n              Morant said after he woke up from is pregame nap, he did some meditation and played with his young daughter “to ease the nerves. The emotions I was feeling from coming back. It was a lot. But it kind of helped me.”\n\n\r\n              “Once I got out there on the court and seen the fans reaction to me being back, it definitely helped me a lot,\" said Morant, who shot 3 for 7 and had eight points in 10 minutes of action in the first half. \"Made me feel good inside.”\n\n\r\n              Jackson has scored at least 25 points in five straight games.\n\n\r\n              “He's being aggressive and realizing how big he is and using that size to his advantage,” reserve Santi Aldama said of Jackson's play. “You can see, once he gets in the post, they can't stop him.”\n\n\r\n              For Jackson's part, it is a matter of playing to his strengths and whatever the opponent's defense allows.\n\n\r\n              “Trying to abuse mismatches,\" Jackson said as an explanation of his play. “Just taking it upon myself to be dominant and not take any plays off.”\n\n\r\n              Jalen Green finished with 32 points to lead the Rockets, while Kenyon Martin Jr. scored a career-high 31. Kevin Porter had his second career triple-double and first of the season with 14 points, 10 rebounds and 10 assists. Alperen Sengun scored 25 for Houston.\n\n\r\n              The Southwest Division title was a point of pride, but not the goal for the Grizzlies.\n\n\r\n              “Back-to-back is something special. There are a lot of goals you want to accomplish in a single season,” Memphis coach Taylor Jenkins said. “We have so much more work to do. Our guys would be the first to say, ’congrats', but we’ve got a lot more loftier goals.”\n\n\r\n              The game was a tight affair, particularly in the third quarter when the Rockets connected on nine of their first 10 shots, including all five from 3-point range. That gave Houston a brief lead until Memphis went on a 12-4 run.\n\n\r\n              Still, the game was within one possession with the three minutes remaining. Memphis stretched the advantage to seven in the final minute to preserve its fourth straight win and seventh in the last eight games.\n\n\r\n              “It's completing plays throughout the game,” Rockets coach Stephen Silas said. “The lobs we have in transition that we are throwing out of bounds. The little things that are just careless mistakes. Those things bit you in the fourth quarter.”\n\n\r\n              TIP-INS\n\n\r\n              Rockets: F Jae'Sean Tate missed his second consecutive game, this time listed with left knee soreness. ... Shot 51% in the first half as Sengun, Matin and Green were a combined 18 of 28. \n\n\r\n              Grizzlies: Dillon Brooks was suspended for Wednesday’s game after picking up his 18th technical foul in Monday's win over Dallas. ... Have won 10 straight at home. Memphis' last loss at FedExForum was Feb. 5 to the Toronto Raptors. \n\n\r\n              UP NEXT\n\n\r\n              The teams play the second game of their two-game series in Memphis on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994524.615445
}