{
  "game_id": "0021900838",
  "espn_id": "401161480",
  "date": "Feb 22, 2020",
  "matchup": "MIA vs. CLE",
  "headline": "Heat rout Cavs 124-105 as Wade is honored at halftime",
  "body": "MIAMI --  The Miami Heat played so well early they didn't need a halftime meeting, which was exactly the plan.\n\nIn a worthy warmup for Dwyane Wade's jersey retirement ceremony, the Heat broke a 23-year-old franchise record for points in the first half en route to a 124-105 victory over the Cleveland Cavaliers on Saturday.\n\nMiami shot 77% in the first half and then turned the stage over to Wade, whose No. 3 jersey was hoisted to the rafters.\n\n\"I just wanted to make sure we played well enough in the first half we didn't need to necessarily meet,\" coach Erik Spoelstra said, \"because I wanted to enjoy halftime, and I wanted our players to be out there and see it.\"\n\nThe ceremony was part of a three-day celebration of Wade's career that included three NBA titles with Miami.\n\nThe Heat believe they're building another championship contender, and they looked the part against the hapless Cavaliers.\n\n\"It felt great to win and just get in front of this Heat culture and fans,\" forward-center Bam Adebayo said. \"It's a beautiful thing we've created. We want to keep that going.\"\n\nMiami made its first nine shots and led 38-32 after one quarter. Then Wade made a grand entrance to take his seat in the first row across from the home team bench, and the Heat really stepped on the gas.\n\nThey went 15 for 17 in the second period, outscoring the Cavs 44-20 for an 82-52 lead at the half.\n\nWade's impression of the first half?\n\n\"I didn't watch it,\" he said.\n\nAfter taking his seat, he spent much of the time chatting with other spectators, and departed before halftime to prepare for the ceremony.\n\nHe missed seeing the Heat break the franchise record of 75 points in the first half in November 1997 against the Los Angeles Clippers, a mark that predated Wade's 16-year NBA career.\n\nRookie Kendrick Nunn led seven scorers in double figures for Miami with 24 points, and he had eight assists. Adebayo had 15 points and nine assists.\n\nMiami shot a season-best 57% and made 19 3-pointers. The game was so lopsided that Wade's close friend, Udonis Haslem, played for only the third time this season during garbage time.\n\n\"They just wore us down,\" Cavs coach J.B. Bickerstaff said. \"The way they were creating shots -- and they were open shots, too -- we made some mistakes on some switches and we allowed some guys to get free.\"\n\nCedi Osman led Cleveland with 19 points. The Heat earned their eighth consecutive victory against the Cavs, including three this season, and have beaten Cleveland 18 times in a row in Miami.\n\nNOT PLAYING\n\nGuard-forward Jimmy Butler, the Heat's leading scorer, was sidelined for personal reasons. Guard Tyler Herro and forward-center Meyers Leonard missed their seventh game in a row with ankle injuries.\n\nCavaliers forward-center Kevin Love sat out for the second time in the past three games because of a sore right Achilles' tendon.\n\nTIP-INS\n\nHeat: Playing shorthanded lately because of injuries, they had lost five of their past six games. They improved to 23-3 at home.\n\n\"This place is surreal,\" Nunn said. \"We have the best fans in the league.\"\n\nCavaliers: They fell to 15-41, worst in the Eastern Conference, and 1-1 under Bickerstaff.\n\nUP NEXT\n\nThe teams meet again for the final time in the regular season Monday at Cleveland.\n\n\"We're going to take a lot of good lessons from this game,\" Osman said.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996615.686486
}