{
  "game_id": "0022000876",
  "espn_id": "401307674",
  "date": "Apr 20, 2021",
  "matchup": "ORL @ ATL",
  "headline": "Young scores 25, Williams 22, Hawks defeat Magic 112-96",
  "body": "ATLANTA -- — Trae Young scored 25 points, Lou Williams added 22 in his best game since returning to Atlanta and the surging Hawks pulled away in the final period for a 112-96 victory over the Orlando Magic on Tuesday night.\n\n\r\n                    The Hawks began the day clinging to the fourth spot in the Eastern Conference, which would mean home-court advantage in the first round of the playoffs.\n\n\r\n                    Atlanta won for the fifth time in six games to move a step closer to locking up its first postseason berth since 2017.\n\n\r\n                    Young pointed out that the Hawks keep winning even though five players are still out with injuries — an issue that has plagued the team all season.\n\n\r\n                    “It’s crazy to think about,” he said. “A lot of guys are playing well and doing a lot of really good things, and we still ain’t got everybody back. ... It’s a great feeling, but I also want to get everybody back and see what we can all do together.”\n\n\r\n                    The Hawks took command in the second quarter, outscoring the rebuilding Magic 28-13 over the final 7 minutes to build a 65-48 lead at halftime.\n\n\r\n                    Clint Capela scored 12 of his 14 points during the run, Young added seven and Bogdan Bogdanovic knocked down a pair of 3-pointers.\n\n\r\n                    Capela also had 19 rebounds.\n\n\r\n                    Orlando got as close as six in the third quarter before Atlanta iced the victory in the final period.\n\n\r\n                    \r\n                      Williams was stunned by the trade-deadline deal that brought him to Atlanta from the Los Angeles Clippers. He even considered retirement, despite coming back to a team he once played for and the city where he grew up. \n\n\r\n                    After sitting out four games to ponder his options, Williams finally joined the Hawks to provide some scoring punch off the bench. His performance against the Magic was what injury-plagued Atlanta had in mind.\n\n\r\n                    “I came in being aggressive,” Williams said. “I had a conversation with Coach Nate (McMillan) this week. I was facilitating a little too much to his liking. He wanted me to be a little more aggressive at the offensive end, be myself.”\n\n\r\n                    Wendell Carter Jr. and Cole Anthony had 17 points apiece for Orlando, which has lost nine of 10. \n\n\r\n                    The Magic struggled to keep Young and Williams off the line. Those two combined to hit 17 of 19 free throws.\n\n\r\n                    “Every one of those is a mistake,” coach Steve Clifford said. “Those were things that we covered this morning, but obviously we did a poor job of it.”\n\n\r\n                    SLUGGISH THIRD\n\n\r\n                    The Hawks got off to a miserable start in the third quarter, but the Magic couldn’t take advantage.\n\n\r\n                    Atlanta missed its first seven shots and turned the ball over twice before Young, after a timeout, hit a floating jumper with nearly 4 1/2 minutes gone in the period.\n\n\r\n                    “It was a passive start to the third,” McMillan said “We had open looks we were passing up. We were over-passing.”\n\n\r\n                    TRAE’S EYEWEAR\n\n\r\n                    Young wore goggles as a precautionary measure after taking an inadvertent elbow to the eye from teammate Onyeka Okongwu in Sunday’s victory over Indiana.\n\n\r\n                    While he had some swelling and soreness from the blow, Young’s vision was not affected.\n\n\r\n                    “I just wanted to make sure I didn’t get hit again,” he said. “That would hurt pretty bad for sure.”\n\n\r\n                    Young didn’t have much time to get used to his new eyewear, which arrived shortly before tipoff.\n\n\r\n                    “I had to go on the fly,\" he said. \"It felt good once I got into a rhythm with them.”\n\n\r\n                    DOMINATING THE BOARDS\n\n\r\n                    Led by Capela and John Collins, who had 15 rebounds, the Hawks finished with a commanding 65-40 edge on the glass.\n\n\r\n                    “It's always a key for us to win games is to control the boards,” McMillan said.\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Dropped to 3-11 since trading longtime franchise stalwarts Nikola Vucevic, Evan Fournier and Aaron Gordon at the deadline. ... No one reached double figures in rebounds. Carter led the way with nine. ... Orlando had just six offensive rebounds, compared to 18 for the Hawks. \n\n\r\n                    Hawks: F Danilo Gallinari missed his fifth straight game with a sore right foot. ... Atlanta improved to 18-6 since McMillan took over as interim coach after the firing of Lloyd Pierce. ... Collins also had 11 points as all five starters scored in double figures. \n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Return home to take on the New Orleans Pelicans on Thursday.\n\n\r\n                    Hawks: Travel to New York on Wednesday to face the Knicks.\n\n\r\n                    ------\n\n\r\n                    Follow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 His work can be found at https://apnews.com/search/paulnewberry\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997573.861644
}