{
  "game_id": "0021601222",
  "espn_id": "400900600",
  "date": "Apr 12, 2017",
  "matchup": "CHI vs. BKN",
  "headline": "Bulls clinch playoff spot with 112-73 rout over Nets",
  "body": "CHICAGO --  Jimmy Butler is ready for the challenge of the postseason.\n\nButler scored 25 points, and the Chicago Bulls beat the depleted Brooklyn Nets 112-73 in the regular-season finale to earn an Eastern Conference playoff spot on Wednesday.\n\nPaul Zipser added a career-high 21 points off the bench as Chicago took advantage of a short-handed Brooklyn lineup to secure its first playoff appearance under coach Fred Hoiberg.\n\nThe Bulls, the No. 8 seed, will open the playoffs Sunday night against No. 1 seed Boston Celtics.\n\n\"Looks can be very deceiving. We're all right. We're not worried about who we're playing, we have to focus in on ourselves and play the best Bulls basketball that we can,\" Butler said.\n\n\"Obviously, Boston is a very good team. No. 1 seed on the road, we'll take it, we're in there. It's all about us playing the best basketball at the right time.\"\n\nWithout a dominant regular-season team in the East, Dwyane Wade is holding out hope.\n\n\"Everybody had a challenging season. That's what happens when you play in a talented league. Every team, especially in the Eastern Conference, has had its ups and downs, has had a challenging year.\n\n\"At the end of the day, our goal was to get to the playoffs and we were able to accomplish that. I'm happy with that, with this team right now,\" Wade said.\n\nOn Tuesday, the Nets, who have the worst record in the league, said Trevor Booker, Jeremy Lin and Brook Lopez would be out due to rest, while Quincy Acy (ankle), Joe Harris (shoulder) and Sean Kilpatrick (hamstring) because of injuries.\n\nOn Saturday, the Nets defeated the Bulls in Brooklyn 107-106 behind Lopez's 13 points and Lin's 12 points.\n\nThe decision was controversial, especially with Miami, who needed the Bulls to lose in order to have a chance at the playoffs.\n\n\"I'm going to be honest as a competitor, I understand it, I understand the point of view that some of you have, some of the press has and maybe other teams, I do understand it,\" Brooklyn coach Kenny Atkinson said before the game.\n\n\"But again, we have to look at it from the Brooklyn Nets franchise and what is best for us and that's how we're looking into it in a vacuum. That's my responsibility as coach.\"\n\nArchie Goodwin scored 20 points for the Nets and KJ McDaniels finished with 15.\n\nThe Nets were 3-for-33 from 3-point range.\n\n\"It surprised me how poorly we shot. I thought we got a lot of open looks. We definitely need to shoot better. We have to improve as it was clear tonight. Our perimeter shooting is not where it needs to be,\" Atkinson said.\n\nLeading 14-11, Zipser sparked the Bulls with eight straight points as they coasted the rest of the way. The Bulls led by as many as 39 and never trailed. Zipser was 5-for-7 from 3-point range.\n\nRajon Rondo was back in the Chicago starting lineup after missing the past three games with a sprained right wrist. He had 10 points, six rebounds and five assists in 19 minutes and Wade finished with seven points in 22 minutes in his third game back from an elbow injury.\n\nBACK TO BOSTON\n\nRondo downplayed his return to Boston. \"I'm with the Bulls now. I want to go out there and win,\" said Rondo, who played 8 1/2 seasons in Boston with one NBA championship.\n\nTAKING ADVANTAGE OF AN OPPORTUNITY\n\nGoodwin didn't waste the extra minutes. \"I just look at it as another opportunity for us to get better for next year. I think next year we're going to make a lot of strides, especially going into the summer. We're going to work really hard and get better,\" Goodwin said.\n\nTIP-INS\n\nNets: Lin was unsure if Miami should be upset with the Nets' decision to rest key players. \"I don't know. It's interesting. I think everyone plays 82 games and each one is just as valuable. Not to say they don't have a right to be upset, but I can definitely understand that, but we just played Chicago and beat them last week, I think that had to help them.\n\n\"I don't know, I think you can look at it from so many different angles. I can understand why the fans would be a little bit upset, but if you look across the league every team that has an opportunity to do it and is doing it.\"\n\nBulls: Hoiberg will continue to monitor Wade's minutes. \"There's a chance (they increase). It's all going to depend on how he's feeling out there. I thought his timing was better in the last game, I thought he was moving pretty well.\n\n\"I thought he had some good bursts to the basket. It's going to take time obviously, with as much as he missed, same as Rajon. So the big thing is to continue to get them comfortable.\" ... The Bulls (41-41) had their ninth straight season without a losing record.\n\nUP NEXT\n\nNets: Season over.\n\nBulls: Face No. 1 seed Celtics in Game 1 on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764995000.0464158
}