{
  "game_id": "0022300929",
  "espn_id": "401585557",
  "date": "Mar 10, 2024",
  "matchup": "HOU @ SAC",
  "headline": "Rockets beat Kings 112-104 but lose leading scorer Alperen Sengun to injury",
  "body": "SACRAMENTO, Calif. -- — Fred VanVleet scored 22 points, Jalen Green added 19 and Houston beat the Sacramento Kings 112-104 on Sunday after the Rockets lost leading-scorer Alperen Sengun to a right knee and ankle injury.\n\n\r\n              Sengun landed awkwardly while challenging a shot by the Kings' Domantas Sabonis with under a minute to play in the fourth. Sengun appeared to be in immediate distress and he left the court in a wheelchair after several minutes on the baseline, with his hands covering his face. \n\n\r\n              Rockets coach Ime Udoka said after the game that Sengun was getting an X-ray and he would “know more shortly.” ESPN reported that Sengun will undergo and MRI on both his right knee and ankle on Monday.\n\n\r\n              “It doesn’t diminish the win in general,” Udoka said. “I think it was one of our best road wins. He had a huge part in that.” \n\n\r\n              The 21-year-old Sengun, who had 14 points prior to the injury, is averaging a career-high 21.2 points per game in his third season. \n\n\r\n              “Injuries are part of the game,” VanVleet said. “We all understand that when we signed up, but it’s always tough to see your teammates go down, especially the young ones who haven’t really been through it before.”\n\n\r\n              Seven players finished in double figures for the Rockets, who have won four of five as they look to make a push toward a spot in the play-in tournament. Houston is now 4 1/2 games back of the 10th seed in the Western Conference. \n\n\r\n              Sabonis led the Kings with 25 points and 15 rebounds. \n\n\r\n              Sacramento cut a 17-point lead down to five late in the fourth quarter, but Houston held off a late push, with Green hitting a three to push the lead to eight with under a minute to play. Green had missed all five of his 3-point attempts prior to taking taht shot.\n\n\r\n              “I knew I was taking that one, because I missed (a prior attempt),” Green said. “I wanted that one bad.”\n\n\r\n              The Rockets grabbed control in the third quarter, going on a 13-0 run and taking advantage of five straight turnovers by the Kings to take a 86-73 lead into the fourth. Sengun had eight points in the quarter, and the Kings held the Rockets to just 14 points and four field goals.\n\n\r\n              De'Aaron Fox had 18 points, but the Kings star was held to 7 of 21 shooting.\n\n\r\n              “If we make shots, it probably looks like a different game,” Fox said. “I got a lot of opportunities that I usually make and they just didn’t go in.”\n\n\r\n              Houston swept the Kings this season, also beating Sacramento in consecutive home games in November. The Rockets had dropped four of the last five to the Kings on the road. They have now won three straight on the road, a season-high.\n\n\r\n              Sacramento dropped to seventh in the West, entering the game tied with Phoenix for the last spot to avoid the play-in tournament. Sabonis said the Rockets were more physical than the Kings. \n\n\r\n              “That’s what we’re going to see in the playoffs,” Sabonis said. “It’s obviously a good thing to play against a team like that, but we’ve got to learn how to play against those kinds of teams and not just give into it.”\n\n\r\n              The Rockets trailed by 13 points in the first half, but finished on a 13-5 run to cut the deficit to 59-54 at halftime, with VanVleet making back-to-back 3-pointers. \n\n\r\n              UP NEXT\n\n\r\n              Rockets: At San Antonio on Tuesday night. \n\n\r\n              Kings: Host Milwaukee on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995579.435165
}