{
  "game_id": "0021600275",
  "espn_id": "400899725",
  "date": "Nov 30, 2016",
  "matchup": "POR vs. IND",
  "headline": "Lillard scores 28 as Trail Blazers beat Pacers 131-109",
  "body": "PORTLAND, Ore. --  Two days of focused practice with an emphasis on defense served the Trail Blazers well.\n\nPortland applied what it worked on, beating former coach Nate McMillan and the Indiana Pacers 131-109 Wednesday night behind Damian Lillard's 28 points, 10 assists and four steals.\n\n\"It was a really good defensive game. I think everything we addressed in practice the last two days, the effort, the mindset, how locked in we were the last two days, I think it translated to the court,\" Lillard said.\n\nMaurice Harkless added 23 points for the Blazers, who led by as many as 28 in their fifth consecutive victory over the Pacers.\n\nThe Trail Blazers had lost six of their last eight games as they've struggled to find consistency on defense. Portland was coming off a 130-114 loss at home to the Houston Rockets on Sunday.\n\nJeff Teague led Indiana with 25 points, while Myles Turner had 19 points and 10 rebounds. It was the first of a five-game road swing for the Pacers, who had won two straight.\n\nPortland was still missing forward Al-Farouq Aminu, out for more than two weeks with a calf injury. But there are signs he could return soon, possibly even by Sunday against Miami.\n\nThe Pacers were without All-Star Paul George for the third consecutive game and seventh overall due to a sore left ankle.\n\nPortland took a 22-13 lead after Meyers Leonard's 3-pointer. Mason Plumlee's alley-oop dunk from CJ McCollum put Portland up 39-27 and Evan Turner, who has been looking more comfortable with the Blazers in the last half-dozen games, made a 3-pointer to push the lead to 46-29.\n\nLillard, who had just four points in the first quarter, got rolling in the final 7 minutes of the second with 14 and the Blazers led 73-58 at halftime. Portland shot 63 percent in the first half.\n\nIn the third quarter it was McCollum's turn. After managing just four points in the first half, McCollum had 15 in the third period and the Blazers went up 109-83 heading into the fourth. He finished with 19 points.\n\n\"I don't want to go overboard on this game. I think after two days of practice it was good to come out and shoot like that in the first quarter,\" Blazers coach Terry Stotts said. \"It's not a sigh of relief right now -- we still have work to do.\"\n\nIt was the first Portland appearance for McMillan since he became head coach of the Pacers. McMillan was promoted in the offseason after the Pacers dismissed Frank Vogel.\n\nMcMillan coached the Blazers from 2005-12. The latter part of his tenure was marked by the devastating injuries to top draft pick Greg Oden and later to star guard Brandon Roy.\n\nMcMillan said before the game that he remembers Portland fondly as a \"great basketball town.\" He said his latest stint as a head coach really can't be compared to the previous one because with the Blazers he was in a rebuilding mode, while with the Pacers he's got a more mature and seasoned squad.\n\n\"It's going to be about winning and doing things the right way,\" McMillan said about his new head coaching gig. \"I'm looking forward to the opportunity.\"\n\nIn the end, he came away impressed by the Blazers.\n\n\"They were getting to the paint, they were throwing lobs, they were kicking out and knocking down 3s, so we never really controlled the ball -- and with a team like that it's going to be a long night,\" McMillan said.\n\nTIP-INS\n\nPacers: McMillan was greeted with warm applause by fans at the Moda Center. He joked that his nickname was no longer \"Sarge\" as it was in Portland.\n\nTrail Blazers: Harkless has scored 15 or more points in three straight games for the first time with the Blazers. ... Portland set season highs with 131 points and 73 in the first half.\n\nOREGON TIES\n\nPacers guards Aaron Brooks and Joe Young both played college ball at Oregon. Young said he enjoys coming back to the Pacific Northwest.\n\n\"Coming back to Oregon is one of the most fun things I get to do,\" he said. \"Just to come back and see my fans and the people that support me. I love Oregon.\"\n\nMO-MENTUM\n\nHarkless' 23 points matched his best total with the Blazers. He has scored at least 20 three times this season after hitting the mark just once last season. Harkless has been in double figures in eight consecutive games, his longest streak with Portland.\n\nUP NEXT\n\nThe Pacers visit the Los Angeles Clippers on Sunday.\n\nThe Trail Blazers host the Miami Heat on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995666.693603
}