{
  "game_id": "0021900755",
  "espn_id": "401161397",
  "date": "Feb 05, 2020",
  "matchup": "DET vs. PHX",
  "headline": "Drummond's big game lifts Pistons over Suns 116-108",
  "body": "DETROIT --  Andre Drummond wasn't about to predict where he'd be playing in a couple days.\n\n\"Your guess is as good as mine,\" he said. \"I don't know what's going to happen. I'm going to go to sleep tonight and wake up and find out what happens.\"\n\nDrummond had 31 points and 19 rebounds, and the Detroit Pistons handed the Phoenix Suns their fourth straight loss, 116-108 on Wednesday night.\n\nThere's been trade speculation about Drummond, and this was Detroit's last game before Thursday's trade deadline. He had 20 points and 11 rebounds by halftime and finished just two points shy of his career high.\n\nHe was asked afterward if the possibility of this being his last game with the Pistons had crossed his mind.\n\n\"I've been hearing that for the past four years,\" he said. \"It don't faze me.\"\n\nReggie Jackson added 25 points for Detroit and Christian Wood had 21. Kelly Oubre Jr. led the Suns with 30.\n\nThe Pistons led 101-94 in the fourth quarter after a 3-pointer by Wood, but the Suns scored the next six points to close within one. Detroit answered with a 9-2 run capped by Jackson's 3-pointer.\n\nIt was the 402nd double-double for Drummond, putting him in a tie with Bill Laimbeer for third on the team's career list.\n\nDeandre Ayton scored 26 points for the Suns and Devin Booker added 22. Ricky Rubio had no points and 10 assists at halftime, but he had only one assist and four points the rest of the way.\n\n\"We have to continue to grow and mature in order to stay solid, to stay focused for 48 minutes,\" Oubre said. \"I think that's the best teams who can follow the game plan, do what they do consistently for 48 minutes.\"\n\nDetroit led 64-61 after two quarters.\n\nDEPTH\n\nDetroit's bench outscored Phoenix's 39-13, with Wood leading the way. Langston Galloway contributed 15 points for the Pistons.\n\nCoach Dwane Casey, however, was not happy with rookies Jordan Bone and Louis King, who combined for three points in minimal playing time.\n\n\"Bone, Sekou (Doumbouya) and King. Both, I didn't think they played hard enough. I wanted to play them longer, but when you go in, you've got to go in chewing nails, and I didn't see that,\" Casey said. \"I told them, next stop will be (G League) Grand Rapids if they're not going to come in. Because this is an opportunity for them, but it's not going to be given to them.\"\n\nDoumbouya, also a rookie, started and scored five points in 15:58. King made a 3-pointer in the third quarter, then was immediately called for a technical foul, apparently for taunting.\n\nSHARP SHOOTING\n\nBoth teams shot over 40% from 3-point range. Detroit was 12 of 28 and Phoenix was 12 of 26.\n\n\"Just couldn't get enough of them,\" Suns coach Monty Williams said. \"I didn't think that we responded well to them blitzing (Booker) tonight. I think the simple play is there.\"\n\nTIP-INS\n\nSuns: Phoenix was without Dario Saric (left ankle), Tyler Johnson (right knee), Ty Jerome (left calf), Aron Baynes (left hip) and Cameron Johnson (right quad). ... Ayton had 12 rebounds, four assists and four blocks. He surpassed 100 blocked shots for his career.\n\nPistons: Detroit has been without Blake Griffin because of left knee surgery. The Pistons were also missing Derrick Rose (left hip), Luke Kennard (knee), Markieff Morris (illness) and Svi Mykhailiuk (right hip). ... Seven of Drummond's 19 rebounds were at the offensive end. Detroit had 17 second-chance points to Phoenix's eight.\n\nUP NEXT\n\nSuns: Host the Houston Rockets on Friday night.\n\nPistons: Visit the Oklahoma City Thunder on Friday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996265.3651252
}