{
  "game_id": "0021801063",
  "espn_id": "401071736",
  "date": "Mar 19, 2019",
  "matchup": "SAC vs. BKN",
  "headline": "Nets, down 25 in 4th, storm back to shock Kings",
  "body": "SACRAMENTO, Calif. -- Brooklyn coach Kenny Atkinson tried just about everything to kick the Nets into gear: There were quick timeouts; angry, animated discussions with his players; and even switching from man to zone defense.\nWhen nothing else worked, D'Angelo Russell and a handful of Brooklyn reserves took over and carried the Nets to an improbable win on their longest road trip of the season.\nRussell scored 27 of his career-high 44 points in the fourth quarter, Rondae Hollis-Jefferson made a layup with eight-tenths of a second remaining and the Nets rallied from 28 points down in the second half to beat the Sacramento Kings 123-121 on Tuesday night and snap a four-game losing streak.\nThe Nets, who trailed by 25 after three quarters, became just the fourth team in the shot-clock era (since 1954-55) to overcome a 25-point fourth-quarter deficit, according to ESPN Stats & Information research. Teams trailing by 25 or more points entering the fourth quarter were 3-3,028 in the shot-clock era entering Tuesday.\n\"We were at our wit's end; it was kind of desperation,\" Atkinson said. \"It was a little bit like, 'Let's conserve our main guys and kind of play it out.' I wasn't expecting an amazing comeback, I just have to be honest. And then slowly but surely, we started cutting the lead.\"\nBrooklyn was sluggish and out of sync for three quarters before Russell sparked the Nets' biggest comeback of the season.\nAfter scoring 17 points in the first half and going without a point in the third quarter, Russell shot 10-of-15 in the fourth quarter, repeatedly burning Sacramento's defense with quick drives to the basket. He scored 16 straight points during one stretch, while getting plenty of help from his teammates.\n\"I give a lot of credit to our bigs,\" Russell said. \"They set screens and got me open, got me downhill. Once you get downhill, any player that can get downhill and see the floor like that and see the rim wide-open, the sky's the limit.\"\nRussell's 27 points are the most in a fourth quarter in the NBA this season. He also had four 3-pointers in the fourth quarter, breaking Allen Crabbe's single-season franchise record of 201 3-pointers, set last season. Russell has 202.\n\"Once you get in that groove, it's hard to get you out of it,\" Russell said. \"No matter what defense a team throws at you, you're going to find a way to get it done. That's kind of what it was.\"\nHollis-Jefferson had 14 points off the bench, none more important than his winning layup after Sacramento's Marvin Bagley III stepped out of bounds with 5.5 seconds left.\nHollis-Jefferson took the inbound pass from Joe Harris and looked for Russell, who was being double-teamed. With the clock winding down, Hollis-Jefferson drove from near the 3-point arc and went around a Kings defender near the hoop to score.\nJarrett Allen added 13 points and seven rebounds for Brooklyn. Spencer Dinwiddie scored 10 points.\nBefore Tuesday's win, the Nets had been 0-178 over the past 20 seasons when trailing by at least 25 points at any point in a game, according to ESPN Stats & Information data.\nIt was a much-needed boost for Brooklyn, which had lost the first three games of a seven-game trip. The Nets also were struggling to hold on to seventh place in the Eastern Conference before Russell led the comeback.\nDe'Aaron Fox scored 27 points for Sacramento. Bagley had 29 points on 12-of-15 shooting for the Kings (35-35). And Nemanja Bjelica added 14 points and 10 rebounds, while Harrison Barnes scored 17.\nTwo days after beating the woeful Chicago Bulls 129-102, Sacramento was well on its way to a lopsided win over a contending team in the East, before things slipped away.\n\"We relaxed and were very casual,\" Kings coach Dave Joerger said. \"Didn't run back on defense, turned the ball over a ton and took a lot of jump shots because we thought it was going to be easy.\"\nThe Kings led by 28 points and shot 51.6 percent from the floor.\nTIP-INS\nNets: Allen picked up a technical foul in the first quarter. Crabbe missed his third consecutive game with a sore right knee.\nKings: Buddy Hield went 0-of-8 beyond the arc, and he remains nine 3s shy of the franchise single-season record of 240, set by current Sacramento assistant general manager Peja Stojakovic in 2003-04.\nWASTED TIMEOUT\nAtkinson was so frustrated with the Nets that he called a timeout 20 seconds into the second quarter, moments after Bogdan Bogdanovic made a 3-pointer that put the Kings ahead 41-25. Atkinson was quite animated during the break as he spoke to his players, before getting up and walking away. It worked briefly -- until the Kings scored 20 straight to open the third quarter.\n\"The coaching was terrible,\" Atkinson said. \"The zone was terrible. I used up my timeouts. They never responded. We put a group of players out there that have a great bond and a great spirit and were working their tails off behind closed doors. It was 100 percent on them. That's player ownership.\"\nUP NEXT\nNets: Play the Lakers in Los Angeles on Friday.\nKings: Host the Dallas Mavericks on Thursday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764994169.435717
}