{
  "game_id": "0021600831",
  "espn_id": "400900236",
  "date": "Feb 14, 2017",
  "matchup": "CHI vs. TOR",
  "headline": "Bulls beat Raptors for 11th straight time, 105-94",
  "body": "CHICAGO -- Doug McDermott and Jimmy Butler can't explain the Chicago Bulls' recent mastery over the Toronto Raptors. They only hope it continues.\nMcDermott scored 20 points, Butler had 19 points and 12 assists in his return to the lineup, and the Bulls beat the Raptors for the 1th straight time, 105-94 on Tuesday night.\nIn his last four games against Toronto, McDermott averaged 24.0 points on 62 percent in the field.\n\"We just have their number,\" said McDermott, who has averaged 24.0 points on 62-percent shooting in his last four games against Toronto. \"It's a good matchup for us. I don't know. It's hard to say. Hopefully, we can keep it rolling against them.\"\nTaj Gibson had 14 points and Rajon Rondo added 12 for Chicago, which led by as many as 23 points and never trailed in the final three quarters to snap a three-game skid.\nToronto's last victory in the series was Dec. 31, 2013, in Chicago.\n\"Um, I think the only way to win is have more points than them at the end of the game,\" said Butler, who scored 15 points on free throws.\nKyle Lowry scored 22 points to lead the Raptors, who lost their third straight and 11th in the last 15 to fall one-half game behind idle Atlanta for the No. 4 seed in the Eastern Conference.\n\"Right now, we're a way below .500 team,\" Lowry said. \"We're playing really bad basketball. It's crazy right now. We went from this to that.\"\nThe Raptors' DeMar DeRozan was limited to 18 points -- 10 below his season average. He was whistled for his second technical foul with 25 seconds left and ejected from the game.\nThe loss came hours after the Raptors acquired forward Serge Ibaka from the Orlando Magic. The need for his physical toughness was apparent from the start.\nChicago attacked the rim with success and threw down five dunks in the second quarter alone.\n\"One guy's not (going to change everything),\" Raptors coach Dwane Casey said. \"We're excited about Ibaka coming in, but we've got other things we've got to get fixed up before he comes in -- our defense, (for) one.\"\nAt the 1:44 mark of the second period, Butler converted two free throws to give Chicago a 56-35 lead, its largest of the first half.\nGibson had all of his scoring in the first half as the Bulls shot 51 percent from the field while taking a 58-39 lead.\nChicago scored the final six points of the first quarter to take a 24-18 lead.\n\"The biggest thing I was happy about was our energy out of the gate,\" Bulls coach Fred Holberg said. \"We got off to a really good start, especially defensively.\"\nTIP-INS\nBulls: Chicago was without F Nikola Mirotic (back spasms), G Dwyane Wade (bruised right wrist) and F Paul Zipser (left ankle tendonitis). ... Butler (bruised right heel) was back after missing four of the last five games. \"It feels good,\" he said. That's all there is to say. There wasn't that much pain at all. Now it's all about getting in rhythm.\"\nRaptors: Toronto's reserves outscored 54-34 by their Chicago counterparts. G Norman Powell led the way with 13 points. ... C Jonas Valanciunias scored 12 points and nine rebounds in 21:30. He also picked up a technical foul in the first quarter.\nURGE FOR SERGE\nToronto coach Dwane Casey wasted no time to review film of Ibaka, who was acquired from Orlando in exchange for F-G Terrence Ross and a 2017 first-round pick.\n\"Any time you can add a talent who has got playoff experience, (NBA) Finals experience, and a defender and two-way player like Ibaka has got to give us a boost,\" said Casey, who wasn't certain whether the veteran would join the team before the All-Star break.\nIn particular, Ibaka represents an upgrade at the defensive end. The Raptors ranked 15th in blocked shots and 16th in opponents' field goal percentage at the start of the day.\nIn Ross' absence, G Norm Powell is in line to play an expanded role.\nONE STEP FOWARD, ONE STEP BACK\nBulls F Bobby Portis scored six points on the heels of a 16-point, six-rebound effort versus the Timberwolves on in Minneapolis on Sunday.\n\"Bobby has got an opportunity with Niko out of the lineup right now, and we're confident he will take advantage of that,\" Holberg said.\nUP NEXT\nRaptors: Host Charlotte on Wednesday night in the final game before the All-Star break.\nBulls: Host Boston on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764995040.233108
}