{
  "game_id": "0021600545",
  "espn_id": "400899966",
  "date": "Jan 06, 2017",
  "matchup": "ORL vs. HOU",
  "headline": "Rockets extend streak to 7 with 100-93 win over Magic",
  "body": "ORLANDO, Fla. --  The Houston Rockets are edging toward elite status in the Western Conference, and learning that the climb comes with challenges.\n\nFacing a struggling Orlando Magic team on Friday, the Rockets found themselves in a too-close-to-call contest for the second straight night before coming away with a 100-93 win for their seventh straight victory.\n\nHouston escaped against Oklahoma City with a two-point win at home Thursday night after leading by 18 in the second half.\n\nThis time, the Rockets trailed by eight at halftime before taking off in the third quarter to regain the lead in a game that was tight throughout.\n\n\"A win is a win. It's tough to win in this league, so we are going to take every win that we can,\" said Houston forward Ryan Anderson, who scored all 19 of his points in the second half.\n\n\"We don't want to play the first half like we did tonight. We played a real bad first half, for us, especially. We corrected things and came together a lot better in the second half and we played better defense overall and made shots,\" he added.\n\nAfter Magic forward Aaron Gordon tied the game for the ninth time with a three-point play with 3:52 to go, the Rockets (29-9) stepped up their defense and their scorers got going from the 3-point line in the final three minutes. Anderson hit two of his five 3s during that span and Eric Gordon knocked down a 3 to help Houston outscore Orlando 12-5 down the stretch.\n\nBut the Rockets realize with a tough road game coming up Sunday against Toronto that they have to figure out a way to play a complete 48 minutes.\n\n\"We need to be ready to go from the start and play with a chip on our shoulders because we are getting everybody's best now because we are one of the best teams out there,\" said Eric Gordon, who had 17 points off the bench. \"We just have to play with more urgency.\"\n\nThe Magic, who have lost four of five, seemed to play with that urgency in the first half as they played solid defense against James Harden, Anderson and Eric Gordon. But things changed drastically in the second half.\n\nPatrick Beverley, Trevor Ariza, Anderson and Gordon all knocked down big 3-point shots to help the Rockets quickly reclaim the lead. Houston attempted 49 3-pointers and made 15. They attempted just 37 two-point shots.\n\nOrlando (16-22) kept it close but couldn't come up with consistent scoring to pad its slim leads.\n\n\"It's a really unique style and it works for them,\" Magic coach Frank Vogel said about Houston. \"I thought we did a pretty good job handling it most of the night, but Ryan Anderson got loose too much in the third quarter and that's where the game was lost.\"\n\nFLOPPING MATTER\n\nThe offseason additions of power forward Serge Ibaka and center Bismack Biyombo have given Orlando an inside presence this season, But entering Friday night, the Magic ranked 24th in points in the paint (40.3) and 23rd in defending the paint (41.1).\n\nVogel had an interesting take on what his interior players, including Nikola Vucevic, need to do to improve the numbers.\n\n\"I can't believe I'm saying this to the media but I feel like our guys don't do a good enough job flopping,\" he said. \"I don't like when guys flop but it seems like that's the avenue to get to the free throw line. We don't sell contact very well; we just go try to score the ball.\"\n\nTIP-INS\n\nRockets: Nene was not in the starting lineup but did play. Montrezl Harrell started at center. ... The Rockets are the only NBA team that is undefeated this season in the second of back-to-back games. They are 9-0 after Friday night's win. ... Harden had an off night, missing all eight of his 3-point attempts and committing six turnovers. He finished with 14 points and 10 assists.\n\nMagic: Evan Fournier returned to his starting spot after coming off the bench Wednesday. Before that, he missed five games with a heel injury. ... Orlando is 7-13 at home this season and has dropped three straight at Amway Center.\n\nUP NEXT\n\nRockets: Continue their road trip in Toronto on Sunday.\n\nMagic: Orlando begins an 11-day, six-game West Coast trip against the Los Angeles Lakers on Sunday. The Magic return home on Jan. 20.",
  "source": "espn_api",
  "crawled_at": 1764995852.5793438
}