{
  "game_id": "0021701206",
  "espn_id": "400975952",
  "date": "Apr 09, 2018",
  "matchup": "OKC @ MIA",
  "headline": "Thunder clinch: Oklahoma City runs past Miami 115-93",
  "body": "MIAMI --  For the Oklahoma City Thunder, clinching night was reminiscent of their season.\n\nReally bad start.\n\nReally good finish.\n\nPaul George scored 27 points, Russell Westbrook got his 25th triple-double of the season and the Thunder ran wild in the fourth quarter on the way to wrapping up a Western Conference playoff berth with a 115-93 win over the Miami Heat on Monday night.\n\n\"Half the league gets a chance to play in the postseason,\" Thunder coach Billy Donovan said. \"You don't want to take things for granted. They should feel good about creating an opportunity to play after the regular season's over, but the thing I said to them after the game was we want to continue to play well, we want to continue to build, we want to continue to get better.\"\n\nThat's what Oklahoma City did all season. They started 8-12, are 39-22 since and got road wins over Houston and Miami in a three-day span to clinch the berth.\n\n\"We're headed in the right direction,\" said George, who walked off a winner in Miami for the third time in 21 appearances. \"This is what we wanted. We wanted to come out of this road trip 2-0 and we did that.\"\n\nWestbrook finished with 23 points, 18 rebounds and 13 assists for the Thunder, who missed their first 10 shots and were down by 18 in the opening minutes before outscoring the Heat 39-12 in the fourth.\n\nIt was the third-worst scoring margin for any quarter in Heat history, and the worst ever in a game at Miami.\n\nThe Heat were called for 10 fouls in the fourth against three for the Thunder, and Oklahoma City shot 15 free throws in the final quarter -- one more than Miami shot in the entire game.\n\n\"We had a lot of good things going, and then I think it was a combination of them marching to the free-throw line and us not executing on the other end,\" Heat coach Erik Spoelstra said.\n\nJerami Grant scored 17 points and Carmelo Anthony added 11 for Oklahoma City, which made 14 3-pointers. Anthony will be playing in postseason games for the first time since 2013, after four consecutive futile seasons with the Knicks.\n\n\"Feels good to be back in the postseason and the mindset of not looking forward to another vacation,\" Anthony said.\n\nJosh Richardson scored 18 points and Hassan Whiteside added 16 for the Heat, who fell one spot to No. 7 in the East for now. Miami's playoff seed won't be decided until the season finales Wednesday.\n\nJustise Winslow and Tyler Johnson each scored 12 for Miami, and James Johnson added 11.\n\n\"We haven't done things the easy way,\" Heat guard Wayne Ellington said. \"I guess we like the challenge.\"\n\nTIP-INS\n\nThunder: Westbrook needs 16 rebounds in the Thunder finale Wednesday to average a triple-double for the second straight season. He's also the second player with 2,000 points and 800 assists in back-to-back years. The other is Oscar Robertson, who did it five times. ... Alex Abrines was held out of the second half with concussion symptoms.\n\nHeat: Miami outscored Oklahoma City 58-32 in the paint. ... The Heat shot 5 for 22 from 3-point range. ... James Johnson got poked in the eye and Richardson banged a knee late, but both suggested after the game that they'll be fine.\n\nQUOTABLE\n\n\"We know we can beat anybody when we're playing our best,\" Westbrook said postgame.\n\nWADE HONORED\n\nHeat guard Dwyane Wade was presented with the NBA Cares Community Assist Award for March, recognizing his response to the massacre at Marjory Stoneman Douglas High School in Parkland, Florida. Wade and his wife Gabrielle Union donated $200,000 toward getting students to the \"March for Our Lives\" event in Washington last month. \"I came back to this city at a time when I was needed, when my voice was needed,\" Wade said.\n\nTITLE WINNERS\n\nDuke coach Mike Krzyzewski sat midcourt with Heat CEO Nick Arison, his former manager with the Blue Devils. Coach K was one of three accomplished college coaches at the game; Rick Pitino was also there, near Donovan -- who played guard on Providence's 1987 Final Four team (coached by Pitino), and a two-time NCAA title winner at Florida before going to Oklahoma City.\n\nUP NEXT\n\nThunder: Host Memphis on Wednesday.\n\nHeat: Host Toronto on Wednesday.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993067.547391
}