{
  "game_id": "0022000670",
  "espn_id": "401307458",
  "date": "Mar 24, 2021",
  "matchup": "PHX @ ORL",
  "headline": "Evan Fournier hits winner, Magic beat Suns 112-111",
  "body": "ORLANDO, Fla. -- — If Orlando's victory Wednesday night turns out to be Evan Fournier’s last game for the Magic with the NBA’s trade deadline approaching, the guard will depart with yet another memorable moment.\n\n\r\n                    Fournier scored the last of his 21 points on a difficult driving layup over Phoenix center Deandre Ayton with 6.4 seconds left and the Magic beat the Suns 112-111.\n\n\r\n                    Fournier, an unrestricted free agent at season’s end who has been the subject of recent trade talks, admitted he would be heartbroken if he’s dealt away from the franchise he has spent the past seven seasons playing for.\n\n\r\n                    “I left my home (in France) where I lived with my parents when I was 13 and since then I never stayed in one place for more than two years, so the fact that I’ve been here for seven years says a lot,” said Fournier, who hit four 3-pointers and scored at least 20 points for the 12th time this season. “I had a son here, I got married and it means more than a lot. … If it’s the end, it’s the end, but I obviously love the franchise.”\n\n\r\n                    Suns star Devin Booker made two free throws with 19.4 seconds left to give Phoenix a one-point lead, but he failed to answer Fournier's winner when he missed a reverse layup attempt just before the final horn. The loss ended Phoenix’s road winning streak at seven, its longest since 2006-07. Phoenix is 14-6 on the road, tied for the second-most road victories in the NBA.\n\n\r\n                    “We started off the right way, but we never got over that hump,” said Booker, whose Suns lost on the road for the first time since Feb. 3. “We pushed the lead to 10 to 12 a couple of times and messed around with the game. They stuck around and finished it the right way.”\n\n\r\n                    Nikola Vucevic had 27 points and 14 rebounds for Orlando, and rookie Chuma Okeke made all six of his shots — four from 3-point range — en route to a career-best 17 points.\n\n\r\n                    “It lets me know that I’m capable of doing these things, capable of hitting these shots and making these plays,” Okeke said.\n\n\r\n                    Orlando trailed by 13 in the early going and by five in the fourth period before rallying behind Vucevic’s 32nd 20-point performance. Vucevic’s fadeaway jumper put Orlando up 107-102 with 2:58 to play and his free throw with 27.4 seconds remaining broke a tie at 109.\n\n\r\n                    Booker finished with 25 points, seven rebounds and seven assists, and Chris Paul scored eight of his 23 points in the fourth quarter.\n\n\r\n                    Jae Crowder had 17 points and four 3-pointers — the final one tying the game at 109 with 38.1 seconds to play. Ayton had 21 points and nine rebounds for Phoenix, who fell to 22-6 when leading after three periods.\n\n\r\n                    “Everybody is upset because we lost and that’s a good thing,” Suns coach Monty Williams said.\n\n\r\n                    There were five lead changes and five ties in the fourth period alone. The Magic ultimately won for a second time in the past 13 when Fournier rubbed off a Vucevic pick and finished over Ayton as the guard fell to the floor.\n\n\r\n                    “Over the years we’ve played a ton of two-man game, so we have a great understanding of each other’s game,” Vucevic said about the action that led up to Fournier’s winner. “Tonight, they switched (defensively), he went at Ayton and made a tough shot. It was a big-time shot.”\n\n\r\n                    TIP INS\n\n\r\n                    Suns: Wednesday was the four-year anniversary of Booker’s franchise-record 70-point game against Boston in 2017 and the 31-year anniversary of Tom Chambers scoring 60 points for the Suns in 1990. … Phoenix’s bench was outscored 37-20.\n\n\r\n                    Magic: Coach Steve Clifford thought Terrence Ross (sore right knee) might return, but he was out again. Orlando is 2-7 without Ross this season. … Cole Anthony, who has been out since Feb. 11 with a rib fracture, has resumed on-court basketball drills, but he has yet to be cleared for contact. … Orlando is 5-25 when trailing after three periods.\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Vs. Toronto in Tampa on Friday night.\n\n\r\n                    Magic: Host Portland on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764997743.609139
}