{
  "game_id": "0022200677",
  "espn_id": "401468832",
  "date": "Jan 18, 2023",
  "matchup": "LAL vs. SAC",
  "headline": "Kings beat Lakers 116-111 for 5th straight victory",
  "body": "LOS ANGELES -- — Sacramento coach Mike Brown has been lauding his team's depth all season. On Wednesday night the Kings showed it with one of their top players sidelined.\n\n\r\n              Despite Domantas Sabonis being out with an illness, the Kings extended their winning streak to five with a 116-111 victory behind 32 points from De’Aaron Fox.\n\n\r\n              “It was a good win by our guys. We've been saying all year we feel like we are a deep team,\" Brown said. “Having that next man up mentality has been huge for us.\n\n\r\n              \"Domantas is a huge part of our offense. And to have Fox step up the way he did was fantastic. When we were down, he got us back in it and when it was close, he got us some separation.\"\n\n\r\n              All five starters scored in double figures for Sacramento, including Richaun Harris, who started in place of Sabonis and had a season-high 16 points and 11 rebounds.\n\n\r\n              “Domantas isn't a guy you can replace as one person,” Harris said. “We wanted to step up as committee and I wanted to control the glass as much as I could.”\n\n\r\n              Harrison Barnes added 20 points and Kevin Huerter had 18 to help the Kings (25-18) move into third place in the Western Conference.\n\n\r\n              It is also the first time since the 2004-05 season that the Kings have had at least two five-game winning streaks in a season. It had a seven-game run in November.\n\n\r\n              LeBron James led Los Angeles with 32 points and Russell Westbrook added 19. The Lakers have dropped four of five with their last three losses coming by a total of 10 points.\n\n\r\n              “We’re definitely a ballclub that has zero room for error. We have to continue to play how we played the last couple of games and trying to play mistake-free basketball,” James said.\n\n\r\n              )The game was tied at 108 with 1:10 remaining before the Kings scored four straight points to get some breathing room. Barnes made a layup while being fouled by Westbrook and then hit the free throw with 50 seconds remaining.\n\n\r\n              Kendrick Nunn's 3-pointer got the Lakers to 112-111 with seven seconds left, but Holmes made a pair of free throws to push it back up to three.\n\n\r\n              “Late in the game our fouling, not being disciplined, showing our hands all the way throughout the possession was pretty tough as well,\" Lakers coach Darvin Ham said. \"We got up against the clock, a too much indecisiveness in terms of shooting it, passing it or driving.” \n\n\r\n              Keegan Murray's dunk gave the Kings a 88-74 lead with 2:33 remaining in the third quarter before the Lakers rallied. Los Angeles made a 25-10 run over the next six minutes to take the lead.\n\n\r\n              The Lakers made four 3-pointers during the run, including two straight by Westbrook.\n\n\r\n              TIP-INS\n\n\r\n              Kings: Murray tied a season high with 10 rebounds. ... Guard Matthew Dellavedova also missed the game due to a stomach issue. ... Fox has at least 20 points in a half eight times this season, including twice in the first half.\n\n\r\n              Lakers: James had seven of his nine assists in the fourth quarter. ... Nunn had 14 points off the bench, including four 3-pointers. ... Westbrook was called for a technical early in the second quarter after being called for traveling. ... Los Angeles had a 14-point lead late in the first quarter but trailed 61-60 at halftime. .. Wenyen Gabriel (10 points) has scored in double figures in four straight games.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Oklahoma City on Friday night.\n\n\r\n              Lakers: Host Memphis on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994128.3831308
}