{
  "game_id": "0022200020",
  "espn_id": "401468175",
  "date": "Oct 21, 2022",
  "matchup": "ORL @ ATL",
  "headline": "Young, Collins power Hawks past Magic 108-98",
  "body": "ATLANTA -- — Trae Young overcame a scoreless first half to finish with 25 points and 13 assists, John Collins added 23 points and 13 rebounds, and the Atlanta Hawks beat the Orlando Magic 108-98 on Friday night.\n\n\r\n              Dejounte Murray added 20 points and nine assists for Atlanta, which improved to 2-0 on the young season.\n\n\r\n              “We really struggled to get in a rhythm offensively, and I thought our turnovers kept them in the game and basically playing their tempo.,” Hawks coach Nate McMillan said. “Our defense stayed with it and our defense showed up in the fourth quarter holding them to 17 points. Enough to allow our offense to be able to put some points on the board. We struggled for three quarters to find a rhythm.\"\n\n\r\n              Cole Anthony, who missed Orlando’s season-opening loss at Detroit with an illness two nights ago, scored 17 of his 25 points in the first half and rookie Paolo Banchero, the No. 1 overall draft pick, had 20 points and 12 rebounds as the Magic dropped to 0-2.\n\n\r\n              “I just think they got hot and we got cold,\" Banchero said. “It’s pretty simple. They were making shots. Trae Young got hot. I think we did a good job in the first half, but he’s a great player, so you saw what happened.\"\n\n\r\n              The Hawks started to pull away in the fourth when Justin Holiday hit a 3-pointer and Clint Capela scored inside to make it 95-88 with 5:46 remaining. An alley-oop pass from Young to Collins for the dunk brought a roar from the crowd at State Farm Arena, putting Atlanta up 97-90.\n\n\r\n              Young iced it when he hit a 3 from the right corner as the shot clock was expiring and he was falling out of bounds, and followed on next possession with a straightaway 3 that gave the Hawks their biggest lead at 105-92 with 2:40 remaining.\n\n\r\n              “I focused on bending my knees and looking at the rim and taking my time,\" Young said of his overall shooting performance. “I thought I was rushing it a little bit because I was rushing my shot with all their length. I really didn’t have enough time to take my time. I just slowed down.\"\n\n\r\n              A 3 by Collins from the left side made it 108-94 in the final minute.\n\n\r\n              Leading 81-80 entering the fourth quarter, the Magic got a 3 from Anthony that looked as if it would set the tone for the final period, but Holiday and Collins hit consecutive 3s and Murray hit a layup that put the Hawks up 90-86.\n\n\r\n              “I think our energy kind of faded as we got to that fourth quarter,” Anthony said. “They started picking us apart, taking advantage of that and that's when they were able to get so many open looks. We as a team have to stay locked in.\"\n\n\r\n              Young fed De’Andre Hunter for a fast-break slam dunk that made it 70-66 at the 6:21 mark of the third, and the Magic called timeout. Still, the Hawks couldn’t pull away as Orlando kept matching them with Terrence Ross hitting a 12-footer from the left baseline to put the Magic up 75-74.\n\n\r\n              Young was 0 for 7 from the field with eight assists in the first half. He opened the third quarter with a turnover, but Collins came through with a steal and layup that pulled Atlanta within one. Young finally hit a 3 to force a 57-all tie, and Murray followed on the next possession with a 3 that gave the Hawks a one-point lead, their first since it was 11-10.\n\n\r\n              The Magic took the game’s first double-digit lead on two free throws by Mo Bamba at the 11:28 mark of the second. \n\n\r\n              Young and Murray were a combined 0 for 7 from the field with five turnovers as the Hawks trailed 27-19 at the end of the first quarter. Young had five assists. \n\n\r\n              The Magic led 54-50 at halftime. Orlando shot 48 percent from the field. The Hawks shot 22% on 18 attempts from the arc. \n\n\r\n              TIP-INS\n\n\r\n              Magic: G Jalen Suggs hurt his right ankle midway through the third, limped to the locker room and didn’t return. He finished with three points and was 1 of 5 from the field in 16 minutes. ... Committed 17 turnovers for the second straight game, leading to 24 points for the Hawks. ... Orlando has dropped seven of eight meetings with the Hawks and fell to 22-42 all-time at Atlanta. ... F Jonathan Isaac (knee), G Gary Harris (knee), G Markelle Fultz (toe), C Moritz Wagner (foot) missed their second straight game with injuries. \n\n\r\n              Hawks: Atlanta outscored Orlando 26-8 in fast-break points. ... G Bogdan Bogdanovic was sidelined for the second straight game with a knee injury.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host Boston in their home opener on Saturday.\n\n\r\n              Hawks: Host Charlotte on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994667.16685
}