{
  "game_id": "0022400883",
  "espn_id": "401705449",
  "date": "Mar 04, 2025",
  "matchup": "ORL vs. TOR",
  "headline": "Raptors rookie Ja’Kobe Walter hits 3 with 0.5 seconds left for 114-113 win over slumping Magic",
  "body": "ORLANDO, Fla. -- — Ja’Kobe Walter swished a contested 3-pointer with 0.5 seconds remaining and the Toronto Raptors edged the Orlando Magic 114-113 on Tuesday night after blowing a 12-point lead in the fourth quarter.\n\n\r\n              Paolo Banchero rallied the Magic, scoring 22 of his 41 points in the final period on 8-for-8 shooting. He made two free throws with 5 seconds left to give Orlando a 113-111 lead.\n\n\r\n              Banchero, who finished with eight rebounds, eight assists and four steals, also scored 41 in a loss to Golden State last Thursday. \n\n\r\n              RJ Barrett had 21 points, nine assists and eight rebounds for Toronto. Scottie Barnes added 17 points and 13 boards. Jakob Poeltl also scored 17, and Immanuel Quickley had 15.\n\n\r\n              Franz Wagner finished with 28 points for Orlando.\n\n\r\n              Raptors starting guard Gradey Dick sat out after getting shaken up in a collision Sunday night. Dick, who averages 14.4 points per game, is expected to miss at least two weeks with a hyperextended and bruised right knee.\n\n\r\n              Takeaways\r\n              Raptors: Walter, a rookie from Baylor, had 17 points as the Raptors (20-42) improved to 7-23 on the road. They won 104-102 at Orlando on Sunday night\n\n\r\n              Magic: Have dropped four straight and five of six — all at home. Orlando, clinging to eighth place in the Eastern Conference, fell 1 1/2 games behind Miami for the Southeast Division lead.\n\n\r\n              Key moment\r\n              Following a timeout by the Raptors, they inbounded in the frontcourt to Walter, who took two dribbles toward the middle of the floor and created just enough space to nail his winning 3 over Tristan da Silva.\n\n\r\n              Key stat\r\n              Toronto overcame 20 turnovers by outrebounding Orlando 48-35 and making eight more free throws.\n\n\r\n              Up next\r\n              Raptors: Host the Utah Jazz on Friday night in the opener of a four-game homestand.\n\n\r\n              Magic: Host the Chicago Bulls on Thursday night before embarking on a five-game trip.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997529.433037
}