{
  "game_id": "0022200425",
  "espn_id": "401468580",
  "date": "Dec 15, 2022",
  "matchup": "MEM vs. MIL",
  "headline": "Morant has triple-double as Grizzlies trounce Bucks 142-101",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 25 points, 10 rebounds and 10 assists, and the Memphis Grizzlies pounded the Milwaukee Bucks 142-101 on Thursday night.\n\n\r\n              Dillon Brooks added 18 points and Tyus Jones had 16 as eight Grizzlies scored in double figures. Memphis led from start to finish in its seventh straight win.\n\n\r\n              Memphis' win, coupled with New Orleans' overtime loss to Utah on Thursday night, moved the Grizzlies into first place in the Western Conference.\n\n\r\n              “When teams face us, they’ve got to be ready to come out and play,” Morant said, adding: “We’ve got multiple guys who can go out and score the ball. If you scout us, you’ve got to name everybody on the list.”\n\n\r\n              The Grizzlies opened a 50-point lead in the fourth quarter for the NBA’s largest advantage this season. Milwaukee was held to 38 points in the paint, while Memphis had 86.\n\n\r\n              “I don’t think it is anything earth-shattering,” Memphis coach Taylor Jenkins said of the defensive effort. He added that the Grizzlies were disciplined and showed multiple players against Bucks star Giannis Antetokounmpo.\n\n\r\n              “I thought we did a really good job just taking them out of the paint.”\n\n\r\n              Antetokounmpo and Bobby Portis led the Bucks with 19 points apiece before Milwaukee coach Mike Budenholzer emptied the bench late in the third quarter.\n\n\r\n              “We were just beaten soundly in every way, shape and form, and we have to own that,” Budenholzer said.\n\n\r\n              The game featured two of the top teams in their respective conferences. Milwaukee began the night a game behind East-leading Boston, while Memphis was tied for first with the Pelicans in the Western Conference.\n\n\r\n              But the Bucks struggled from the start of the game. Memphis led 70-41 at halftime. It was the most points given up in a half by Milwaukee this season.\n\n\r\n              “They were just playing well. Knocking down shots,” Antetokounmpo said. “They were running. Their pace was really fast. They were just playing good basketball.\"\n\n\r\n              TIP-INS \n\n\r\n              Bucks: G Jrue Holiday missed his second game with a non-COVID-19 illness. Serge Ibaka also was a late scratch for the same reason. ... F Khris Middleton was 1 of 12 in the game, including 1 of 8 from 3-point range. ... Milwaukee’s biggest loss in franchise history was by 48 two times, the last time in the 1994-95 season against Orlando.\n\n\r\n              Grizzlies: Jenkins is tied with Dave Joerger for second place on the franchise career wins list with 147. Lionel Hollins has the most wins as Memphis coach with 214. ... F/C Brandon Clarke made all six of his shots in the game and has connected on 55 of 77 shots over his past 11 games. ... Rookie David Roddy scored a season-best 15 points.\n\n\r\n              BLOCK PARTY\n\n\r\n              The game featured two of the league’s best shot blockers. Milwaukee’s Brook Lopez leads the league with an average of 2.9 blocks a game and 75 overall. Meanwhile, Jaren Jackson Jr. of Memphis entered with a 3.64 average despite playing only 11 games. Neither had a block in the game, and Milwaukee only had one block — by Thanasis Antetokounmpo.\n\n\r\n              Instead, it was Memphis center Steven Adams who had a season-high five blocks.\n\n\r\n              LAST WORD\n\n\r\n              “We feel like we’re about to get on that stride like we had last year and won 10 straight. As you can see, we’re flowing and playing pretty good right now,” Morant said.\n\n\r\n              UP NEXT \n\n\r\n              Bucks: Face the Utah Jazz on Sunday.\n\n\r\n              Grizzlies: Travel to Oklahoma City to face the Thunder on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994216.569702
}