{
  "game_id": "0021601058",
  "espn_id": "400900453",
  "date": "Mar 21, 2017",
  "matchup": "LAL vs. LAC",
  "headline": "Paul leads Clippers in blowout, watches end with young son",
  "body": "LOS ANGELES -- Chris Paul and the Clippers have taken firm hold of supremacy in their Los Angeles rivalry with the Lakers.\nThey're victory Tuesday night was so dominant, Paul even got to slide in some unexpected family time at the end.\nPaul scored 27 points before watching the completion of a blowout with his young son on the bench, and the Clippers beat the Lakers 133-109 for yet another win in the battle of Los Angeles.\nThe Clippers have won 17 of the last 19 meetings with the Lakers. They led by 30 at the half in this one, and eight different Clippers scored in double-figures, including J.J. Redick with 24. The Clippers shot 45.5 percent on their 3s (15 of 33).\nThey ran, they defended and led by as many as 37 points. For the second consecutive game, none of their starters played in the fourth quarter.\n\"I just like how we're playing with pace right now,\" Clippers coach Doc Rivers said. \"More importantly, I like the way we defended in the first half.\"\nThe Clippers led 13-2 to start the game and then blew it open in the second quarter, outscoring the Lakers by 21 to take a 70-40 lead at the half.\n\"Their team chemistry is off the charts,\" Lakers guard D'Angelo Russell said. \"They play really well together.\"\nThe Lakers, who have won one of their last 15 games, scored a lot of empty points late, led by Brandon Ingram's 21, Julius Randle's 19 and Russell's 18.\nThe Clippers spread the offense around, with Austin Rivers adding 18 points, Jamal Crawford 15, Blake Griffin and DeAndre Jordan 12 each, and Marreese Speights and Brandon Bass adding 10 apiece.\nTheir defense led to stops, which led to fast breaks.\n\"When we get stops like that, we're dangerous,\" Paul said.\nWith the victory the Clippers pulled within a half-game of the Utah Jazz for fourth in the Western Conference and homecourt advantage in the playoffs.\nTIPS-INS\nClippers: Griffin has added an unexpected weapon to his offensive arsenal -- the 3-pointer. Griffin was shooting just 20.8 percent on his 3-pointers in his first 31 games and 27.1 for his career. In his last 19 games, he's hit on 39.2 percent of his 3s. He had one 3 on Tuesday.\nLakers: Ingram has not exactly had a spectacular rookie season, but the No. 2 overall pick in last year's draft has shown promise of late. He's started the past 17 games and has been particularly strong in the last eight, averaging 14.5 points and shooting 54.5 percent.\nPLAYOFF FOCUS\nThe Clippers' push to overcome the Jazz for fourth in the West could get an assist from the schedule. Of their 10 remaining games, seven opponents have losing records and seven games are at home.\nSTARTERS BENCHED\nLakers coach Luke Walton was none too pleased with his team's second-quarter effort. He sent out a lineup made up entirely of reserves to start the second half.\n\"The most important (message) was that playing without a certain amount of effort isn't acceptable or tolerated,\" Walton said.\nDEFENSE, STUPID\nThe Clippers led 33-24 at the end of the first quarter, but then outscored the Lakers 37-16 in the second period. Rivers credited a defense that held the Lakers to 29.2 percent shooting in the quarter.\n\"Everybody has an identity and ours is length and athleticism,\" Doc Rivers said. \"The only way we can use that is by getting stops, and when this team gets multiple stops in a row, then we become athletic.\"\nUP NEXT\nClippers: Travel to Dallas to meet the Mavericks on Thursday for the third time this season. The teams split their first two meetings. Forward Harrison Barnes has averaged 23 points in the two games.\nLakers: Play host to the Timberwolves on Friday. Minnesota won the first meeting by 26 when Andrew Wiggins exploded for a career-high 47 points.",
  "source": "espn_api",
  "crawled_at": 1764995364.010416
}