{
  "game_id": "0022300015",
  "espn_id": "401584103",
  "date": "Nov 10, 2023",
  "matchup": "PHX vs. LAL",
  "headline": "LeBron James scores 32 points, Lakers rally to beat Suns 122-119 to snap 3-game skid",
  "body": "PHOENIX -- — LeBron James looked liked an aging veteran for a few seconds Friday night, limping around the baseline and grabbing at his lower left leg after getting fouled during the first quarter.\n\n\r\n              The moment was fleeting.\n\n\r\n              James scored 32 points, D'Angelo Russell had 19 and the Los Angeles Lakers snapped a three-game losing streak, beating the Phoenix Suns 122-119 in the NBA In-Season Tournament opener for both teams.\n\n\r\n              “It was good to just finally get over the hump at this early stage of the season,\" James said. “We've been playing from behind in a lot of our games and haven't been able to take the lead. That was a good feeling.”\n\n\r\n              The 38-year-old had another vintage performance, defying age in his 21st season, shooting 11 of 17 from the field, including 3 of 4 on 3s. He added 11 rebounds and six assists in 36 minutes.\n\n\r\n              Kevin Durant led the Suns with 38 points and Bradley Beal added 24, including 20 in the first half. Devin Booker missed his fourth straight game because of a strained right calf.\n\n\r\n              Austin Reaves made a layup with 9:25 remaining — part of a 14-0 run — to give the Lakers their first lead of the second half at 97-96. Reaves added a couple mid-range jumpers in the fourth to help Los Angeles stay ahead.\n\n\r\n              Cam Reddish had 17 points, including a corner 3 on a pass from James that put the Lakers up 118-113 with 1:10 remaining. Los Angeles grabbed three offensive rebounds on the position before Reddish made the shot.\n\n\r\n              Lakers coach Darvin Ham made a starting lineup change, starting Reddish and having Reaves come off the bench. Both of them had good games and Reaves was still a vital part of the rotation, playing 35 minutes and closing the game.\n\n\r\n              “It was a good team win,” Ham said. \"A lot of what we saw in the second half, that has to be our identity.\n\n\r\n              James came up limping after getting fouled in the first quarter, grabbing at his lower left leg. The 19-time All-Star said he took a knee to the shin and got some medical treatment on the bench before returning for the start of the second quarter.\n\n\r\n              He looked fine the rest of the evening, helping orchestrate the comeback. Los Angeles shot 9 of 17 (53%) from 3-point range in the second half.\n\n\r\n              Durant scored 15 points in the third quarter as the Suns nursed a single-digit lead. Reddish hit a 3 at the buzzer to cut the Phoenix advantage to 96-89 heading to the fourth.\n\n\r\n              “They kind of controlled the game from there,” Durant said. “The momentum switched in their favor when they started knocking down threes.\"\n\n\r\n              L.A.'s Anthony Davis returned after missing one game with a hip injury and had 18 points, 11 rebounds and four assists.\n\n\r\n              Beal — who was making his home debut with the Suns — made a layup in traffic at the halftime buzzer to give the Suns a 63-55 lead after they led by as many as 14. James had 19 points in the half.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host Portland on Sunday night.\n\n\r\n              Suns: Host Oklahoma City on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996671.7080698
}