{
  "game_id": "0022300454",
  "espn_id": "401585082",
  "date": "Jan 01, 2024",
  "matchup": "MIL vs. IND",
  "headline": "Haliburton gets help from Indiana's reserves as Pacers win 122-113, end Bucks' home win streak",
  "body": "MILWAUKEE -- — Tyrese Haliburton says the best thing about the Indiana Pacers is their depth.\n\n\r\n              That certainly was the case Monday night as Indiana's reserves sparked the Pacers to a 122-113 victory over Milwaukee that provided a happy homecoming for Haliburton and stopped the Bucks' 15-game Fiserv Forum win streak.\n\n\r\n              Haliburton had 26 points, 11 assists and nine rebounds to help Indiana overcome Giannis Antetokounmpo's triple-double. The Pacers outscored the Bucks 70-16 in bench points.\n\n\r\n              “We've got a lot of guys who can contribute,” said Haliburton, who grew up about 90 miles north of Milwaukee in Oshkosh, Wisconsin. “That's the best part about our team. Some nights, the starting lineup's got it going. Nights like tonight, where we come out slow, our bench has to come in and kind of wake the game up.”\n\n\r\n              Bennedict Mathurin added 25 points and a career-high 13 rebounds for Indiana, and Isaiah Jackson had 18 points and nine rebounds. T.J. McConnell, another reserve, had 16 points and nine assists.\n\n\r\n              They helped the Pacers win on a night when they shot just 5 of 35 from 3-point range.\n\n\r\n              “I think we kind of hang our hat on getting a lot of 3's up,” McConnell said. “When we make a lot of them, we're pretty tough to beat. But when we don't make them, it's typically hard for us to win. I tip our cap to this group. We just found a way and adjusted to our cold-shooting night and got it done.”\n\n\r\n              Antetokounmpo had 30 points, 18 rebounds and 11 assists for his 38th career triple-double, and third this season. The two-time MVP is averaging 46.3 points, 13.5 rebounds and 4.8 assists in four meetings with Indiana this season, but the Bucks are 1/3 in those games. \n\n\r\n              They'll face off again Wednesday in Indiana.\n\n\r\n              “We've got to figure it out,” Antetokounmpo said. “You just never know. You might see them in the playoffs. We're definitely going to see them again in two days. At the end of the day, this makes us better. It makes us better. We've got to go watch the tapes, figure out what they do well against us and try to stop it. And if we cannot stop it, we'll probably lose again.”\n\n\r\n              Brook Lopez and Khris Middleton each scored 21 points for the Bucks. Damian Lillard had 13 points while shooting 3 of 16 overall and 1 of 9 from 3-point range.\n\n\r\n              The Pacers trailed by 15 in the third quarter before rallying to take a 90-89 lead with 10:12 left on a Jackson basket that capped a 19-5 run. The game went back and forth from there before McConnell scored six points during an 8-0 spurt that gave Indiana a 109-101 edge with 3:59 remaining.\n\n\r\n              After Middleton hit a 3-pointer to end the run, Haliburton responded with two straight jumpers to make it 113-104. The Bucks scored five straight to cut the lead to 113-109, but Haliburton drove into the lane for a three-point play with 1:20 left.\n\n\r\n              That enabled Indiana to keep the upper hand in this series, though Haliburton isn't ready to label it a rivalry.\n\n\r\n              “That's a team that's competed for a championship for multiple years,” Haliburton said. “We're on the up-and-up, but we haven't been there yet. A lot of respect for them as a group. I don't think I can really call it a rivalry yet. But we're going to compete no matter who it's against, and we play these guys a lot during the year. We're ready when we see them.”\n\n\r\n              After the Pacers won their first two meetings with the Bucks — including an In-Season Tournament semifinal triumph — Antetokounmpo set a franchise single-game record by scoring 64 points in a 140-125 win over Indiana on Dec. 13.\n\n\r\n              The teams had a skirmish in a hallway leading to the Pacers’ locker room after that Dec. 13 game in a dispute over the game ball. \n\n\r\n              “This is a game that everybody was prepared for and everybody was ready for,” Haliburton said. “I think again their words were we weren't ready for them physically (after the last matchup). I think we were ready today.”\n\n\r\n              Indiana was missing Bruce Brown for a fifth straight game because of a bone bruise in his right knee, and Andrew Nembhard played just eight minutes before leaving with a sore back. The Bucks were without MarJon Beauchamp due to a non-COVID-19 illness.\n\n\r\n              UP NEXT\n\n\r\n              The Bucks and Pacers meet again Wednesday at Indiana.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996139.962844
}