{
  "game_id": "0022200266",
  "espn_id": "401468421",
  "date": "Nov 23, 2022",
  "matchup": "TOR vs. BKN",
  "headline": "Irving scores 29, Nets beat depleted Raptors 112-98",
  "body": "TORONTO -- — Kyrie Irving scored 19 of his 29 points in the third quarter, Nic Claxton had 14 points and 12 rebounds and the Brooklyn Nets beat the short-handed Toronto Raptors 112-98 on Wednesday night.\n\n\r\n              Toronto held Kevin Durant to 12 points but still lost to the Nets for the fifth time in seven meetings after winning 21 of the previous 25.\n\n\r\n              Durant scored his 26,074th career point in the third quarter, passing Kevin Garnett (26,071) for 18th place on the NBA’s all-time list.\n\n\r\n              Royce O’Neale made a career-high five 3-pointers and scored 15 points, and Ben Simmons had 14 for the Nets, who bounced back after losing Tuesday at depleted Philadelphia, which was missing Joel Embiid and James Harden.\n\n\r\n              “We’re in the business of winning,” Irving said. “We’ll take this one, especially after last night’s loss, and the whole internet going up in an uproar in terms of how embarrassed we should be, which is true. We just wanted to make sure we paid attention to detail tonight. We came out and responded.”\n\n\r\n              Brooklyn has won three of four, including two of three since Irving returned from a suspension for tweeting a link to an antisemitic film.\n\n\r\n              The Nets shot 17 for 38 from 3-point range, a season high for made 3-pointers. The Raptors finished 7 for 29 from distance, matching their fewest made 3-pointers of the season.\n\n\r\n              Gary Trent Jr. scored 19 points and Chris Boucher had 12 points and a season-high 16 rebounds for the Raptors. O.G. Anunoby scored 15 points and Thad Young had 12.\n\n\r\n              Toronto had 10 healthy players, with regulars Scottie Barnes (left knee) and Fred VanVleet (non-COVID illness) joining All-Star Pascal Siakam (strained right adductor) on the sidelines.\n\n\r\n              “We feel like we could have played better,” Anunoby said. “We don’t make the injuries an excuse.”\n\n\r\n              Irving scored 26 points in the second half, the highest-scoring half by a Nets player this season. He attempted just three shots in the first half, making one.\n\n\r\n              “It doesn’t take too much,” Nets coach Jacque Vaughn said of Irving. “He’s gifted, talented, and can score on any court. He got a couple to go his way and once that happens, off you go.”\n\n\r\n              With the Nets ahead 52-51 at halftime, Irving connected on his first seven field-goal attempts in the third.\n\n\r\n              “That’s what we want him to do,” Simmons said. “Just be himself, have that confidence to come out and take those shots and be who he is. He’s an incredible player, incredible teammate.”\n\n\r\n              Brooklyn took a 91-76 lead into the fourth.\n\n\r\n              Irving had two higher-scoring halves last season. He scored 41 in the first half at Orlando on March 15, finishing with 60 points. That came one week after Irving scored 30 in the second half at Charlotte, finishing with 50 against the Hornets.\n\n\r\n              TIP-INS\n\n\r\n              Nets: Brooklyn recorded an assist on 12 of its 15 field goals in the first quarter. The Nets finished with 32 assists, one shy of their season high. ... G Seth Curry (left ankle) missed his second straight game. ... F Yuta Watanabe (right hamstring) was not available.\n\n\r\n              Raptors: Toronto was also without F Otto Porter Jr. (dislocated toe, left foot), G Dalano Banton (left ankle), F Precious Achiuwa (right ankle), F Justin Champagnie (back) and G-F Ron Harper Jr. (G-League). ... Siakam missed his ninth game but could return next week. … VanVleet also missed games because of a non-COVID illness on Nov. 12 and 14. ... Juancho Hernangomzez had 10 points and 10 rebounds. ... Toronto’s 52 rebounds matched a season high.\n\n\r\n              CUDDLY COAT\n\n\r\n              Rapper Drake arrived at his courtside seat wearing a hooded white winter jacket with two teddy bears attached to the front.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Indiana on Friday night.\n\n\r\n              Raptors: Host Dallas on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994092.61271
}