{
  "game_id": "0022200770",
  "espn_id": "401468925",
  "date": "Feb 01, 2023",
  "matchup": "ORL @ PHI",
  "headline": "Embiid, Harden double-doubles lift 76ers past Magic 105-94",
  "body": "PHILADELPHIA -- — James Harden refused to stump for an all All-Star bid. After another standout game in a Philadelphia 76ers win in which he fell one rebound shy of a triple-double, Harden can let his statistics sell his candidacy.\n\n\r\n              Joel Embiid had 28 points and 11 rebounds, Harden added 26 points and 10 assists and the 76ers beat the Orlando Magic 105-94 on Wednesday night.\n\n\r\n              The NBA will reveal, on Thursday, the 14 players — seven from the Eastern Conference, seven more from the Western Conference — who got picked to be reserves for the All-Star Game. The reserves are selected by coaches voting for players in their conference. Embiid figures to be among those selected. Harden might be left out because of a crowded group of stars in the East.\n\n\r\n              “If my name is called, great,” Harden said. “If not, bigger and better goals for the season.”\n\n\r\n              The Sixers split the home-and-home set this week with Orlando. The Magic stormed back from a 21-point, first-quarter deficit to beat the 76ers 119-109 on Monday night. That loss ended the 76ers’ seven-game winning streak.\n\n\r\n              But, despite uneven moments against a young, rising Magic team, the Sixers steadied themselves late and improved to 20-8 at home.\n\n\r\n              “I didn't think we played great,” coach Doc Rivers said. “But we played good enough to win. We'll take that.”\n\n\r\n              Embiid, the NBA scoring leader, made all 10 of his free throws and was 9-of-17 shooting overall to help keep the Sixers within striking distance of the top seed in the Eastern Conference. \n\n\r\n              Harden, a 10-time All-Star, hit six of Philadelphia's 14 3-pointers and grabbed nine rebounds. \n\n\r\n              “I'm not going to sit here and make a case,” Harden said. “The numbers show it.”\n\n\r\n              Markelle Fultz led the Magic with 18 points. The Magic have been the most improved team in the league since a nine-game losing streak left them at 5-20 in early December. They are 15-12 since then, which included a six-game winning streak.\n\n\r\n              “I really think it’s a belief system,” coach Jamahl Mosley said. “Having them know that on any given night anything can happen. If you play hard, you give yourself a chance.\"\n\n\r\n              The Sixers used a 17-0 run in the first quarter to take a 56-53 lead into halftime. The Sixers' play with Embiid out again highlighted Philadelphia’s need to try and acquire a reliable backup option for the big man. The Sixers were a plus-12 when Embiid played in the half, while Montrezl Harrell (minus-6) and Paul Reed (minus-3) struggled in limited action. With the trade deadline ahead next week, 76ers President Daryl Morey will surely try and beef up the bench.\n\n\r\n              But don’t expect a seismic deal like the one at last season’s deadline, when the Sixers acquired Harden.\n\n\r\n              Rivers declined to talk about potential moves. But the third-year Sixers coach knows he has his best team yet in Philadelphia -- one that should contend for a championship.\n\n\r\n              “This team, I think is better, better equipped for the playoffs,” Rivers said. “I think we have toughness. We’re not as young. I think we have less holes. Every team has holes.” \n\n\r\n              TIP-INS\n\n\r\n              Magic: Made 6 of 38 3-pointers. \n\n\r\n              “We couldn't throw it in the ocean,” Mosley said.\n\n\r\n              76ers: De’Anthony Melton and Tyrese Maxey shot a combined 1 for 11 from the floor through three quarters. Maxey broke through for a 3 midway through the fourth for a 93-83 lead. ... Harden had his 14th game this season with at least 20 points and 10 assists.\n\n\r\n              DOC AND BRADY\n\n\r\n              Rivers was still the Boston Celtics coach the first time he was invited to be a guest speaker at a New England Patriots practice. Rivers had a casual friendship at the time with now-retired Tom Brady. They golfed together and Brady gave a few pep talks to the Celtics. Rivers recalled the first time he spoke at a Patriots practice, Brady walked in with a notebook, pen and sat dead center, front row.\n\n\r\n              “Then Randy Moss walked in,” Rivers said, laughing. “He grabbed Randy. He had an empty seat which he wouldn’t let anyone else sit in and he grabbed Moss and said, right here. It was amazing how much he was writing while I was talking. I wanted to see what he was writing. Like, this guy is nuts. I don’t know what he was writing. But it was really impressive the leadership he showed in that meeting. I thought it was really cool.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: Play Friday night at Minnesota.\n\n\r\n              76ers: At San Antonio on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994622.2660859
}