{
  "game_id": "0021701045",
  "espn_id": "400975791",
  "date": "Mar 17, 2018",
  "matchup": "POR vs. DET",
  "headline": "Portland wins 12th straight with 100-87 victory over Detroit",
  "body": "PORTLAND, Ore. --  Damian Lillard says Portland's current streak is more about the Blazers than their opponents.\n\nLillard had 24 points, eight assists and seven rebounds, and the Blazers beat the Detroit Pistons 100-87 on Saturday night for their 12th straight victory.\n\n\"During this entire run a lot of the things we've done have been about us,\" Lillard said. \"Us communicating, being on the string defensively, locking into the scouting report and knowing what hurt us the last time we played these teams, and also trusting each other on offense, and making other teams have to work to stop us instead of being easy to guard.\"\n\nCJ McCollum added 16 points for the Blazers, who have the longest current winning streak in the league. It's the longest streak for the franchise since it won 13 in a row in December 2007.\n\nPortland (43-26) also earned its season-best ninth straight home win -- a timely streak as it tries to hold on to third place in the Western Conference standings.\n\nWhile the Blazers are soaring, the Pistons are struggling.\n\nAndre Drummond had 18 points and 22 rebounds in Detroit's 12th consecutive road loss. Blake Griffin had 15 points.\n\nThe Pistons (30-39) have dropped eight of 10 overall, and currently sit in ninth place in the East.\n\nCoach Stan Van Gundy was fuming after the game about the officiating.\n\n\"They held and grabbed on every play and they got away with fouls all over the place. We got absolutely screwed all night,\" Van Gundy said. \"Luke (Kennard) makes a back cut to the basket on an out-of-bounds play, gets knocked down, they end up with two points on the other end. Blake has two straight drives in the fourth that he gets hammered on. He gets screwed twice.\"\n\nWhile Van Gundy said he didn't want to take anything away from the Blazers, he said the officiating made their defense look good. He called the game embarrassing for the league.\n\n\"I've been here for four years and many more years before that and I've never come in after a game, never, never come in after a game and talked like this. That was embarrassing,\" he said.\n\nThe Pistons trailed by as many as 19 points in the third quarter, but they closed to 84-74 on Stanley Johnson's dunk with 8:18 left. Evan Turner responded with a jumper for the Blazers.\n\nAfter Kennard was whistled for a technical foul, Lillard made a foul shot and McCollum converted a layup to make it 89-74 with 6:19 remaining.\n\nKennard was a game-time decision with a tight hamstring, but he finished with 12 points.\n\nBlazers center Jusuf Nurkic got two quick fouls within the first four minutes of the game, so he was replaced by Meyers Leonard. Portland went up 20-9 early.\n\nThe Blazers led 60-45 at the break. Lillard led all scorers with 12 points.\n\nAfter extending the lead in the third quarter, Lillard went to the bench to start the fourth and it looked as if he might be done for the night. But he returned when Detroit got within 10 points.\n\n\"We're grown men,\" Johnson said. \"We grab and hold just like they grab and hold. At the end of the day it is what it is. You can't go back and change stuff. You can't do nothing about it. If that's the way they want to officiate the game, we gotta deal with it and try to maneuver the best we can.\"\n\nTIP-INS\n\nPistons: It was the third of a six-game road trip. ... Forward/Center Eric Moreland played at Oregon State. ... Reggie Jackson, who has missed 35 games with a right ankle sprain, participated in a 3-on-3 optional practice earlier this week.\n\nTrail Blazers: Terry Stotts tied Nate McMillan for third-most victories as a Blazers coach. Stotts is 266-213. ... The Blazers had lost five straight to the Pistons. ... All five of Portland's starters scored in double figures.\n\nUP NEXT\n\nPistons: Visit the Sacramento Kings on Monday.\n\nTrail Blazers: Visit the Los Angeles Clippers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764993391.665932
}