{
  "game_id": "0022401063",
  "espn_id": "401705629",
  "date": "Mar 27, 2025",
  "matchup": "CHI vs. LAL",
  "headline": "Josh Giddey's halfcourt heave at the buzzer gives Bulls 119-117 win over the Lakers",
  "body": "CHICAGO -- - Josh Giddey made a halfcourt heave at the buzzer to cap perhaps the wildest finish in the NBA this season, giving the Chicago Bulls a 119-117 victory over the Los Angeles Lakers on Thursday night.\nPatrick Williams and Coby White hit back-to-back 3-pointers in the closing seconds for the Bulls, who trailed by five points with 12.6 seconds remaining.\nGiddey finished with 25 points, 14 rebounds and 11 assists. White scored 26 points and Kevin Huerter added 21 as the Bulls won for the ninth time in 11 games. And this one was easily their wildest in recent memory.\nThe Lakers looked like they had the game at hand leading 115-110 after Austin Reaves made two free throws with 13 seconds remaining. The Bulls weren't finished, though.\nWilliams nailed a 3 for Chicago with 10 seconds remaining. Giddey stole a pass from James and White hit a 3 with 6 seconds to go, putting the Bulls on top 116-115.\nReaves then drove for a layup to give Los Angeles a 117-116 lead with 3 seconds to go. But the Bulls still found a way to pull this one out, mobbing Giddey after he buried the winner.\nReaves led Los Angeles with 30 points. Luka Doncic had 25 points, 10 rebounds and seven assists. Jaxson Hayes scored 19, and James finished with 17 points and 12 assists.\nTakeaways Lakers: A night after winning at the buzzer in Indiana on James' tip-in, the Lakers lost for the eighth time in 12 games.\nBulls: For a team that appeared to be out of it not too long ago, the Bulls are showing some fight.\nKey moment The Lakers led by 13 midway through the fourth quarter before the wild finish.\nKey stat White and Huerter each were 5 of 10 on 3-pointers, while Giddey was 4 for 9.\nUp next The Lakers wrap up a four-game trip Saturday at Memphis. The Bulls host Dallas that night.\n------\nAP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997029.0572531
}