{
  "game_id": "0022401132",
  "espn_id": "401705698",
  "date": "Apr 05, 2025",
  "matchup": "DAL @ LAC",
  "headline": "Zubac's perfect shooting night, Leonard and Harden lead Clippers to 135-104 blowout of Mavericks",
  "body": "INGLEWOOD, Calif. -- — Ivica Zubac was 11 for 11 from the floor for 25 points, Kawhi Leonard and James Harden scored 29 each and the Los Angeles Clippers blew out the Dallas Mavericks 135-104 on Saturday night.\n\n\r\n              Zubac also had 10 rebounds and is the first player in NBA history to have 25 points and 10 rebounds without any turnovers or misses. His perfect shooting night is a franchise record for most makes without a miss in a single game.\n\n\r\n              The Clippers have won four in a row and six of their last seven games.\n\n\r\n              Anthony Davis had 27 points and Kai Jones added 18 on 9-for-9 shooting to lead the Mavericks.\n\n\r\n              Davis grabbed his left knee in the first half and his stomach multiple times in the second though he continued to play. Davis missed time with an abdominal injury after being acquired in a trade with the Los Angeles Lakers.\n\n\r\n              Takeaways\r\n              Mavericks: The way Dallas is playing, it may not get a chance to defend last season’s Western Conference crown. They’ve lost three of four and were blown out twice in two days by the Clippers. \n\n\r\n              Clippers: Los Angeles knows it cannot afford any more losses if it wants a top six seed. And the Clippers are playing like everything’s at stake. \n\n\r\n              Key moment\r\n              Klay Thompson's 3-pointer with 7:36 to play in the third quarter pulled the Mavs to within 75-65, but the Clippers went on a 17-6 run to make it 92-71 on Zubac's dunk with 3:05 left in the quarter. They extended the lead to 105-82 after three and weren't challenged again.\n\n\r\n              Key stat\r\n              Leonard, Harden and Zubac were a combined 33 of 49 from the field through the first three quarters, scoring nearly as many points (81) as the Mavericks (82).\n\n\r\n              Zubac surpassed Bob McAdoo for sole possession of fifth place on the Clippers’ career rebounds list.\n\n\r\n              Up next\r\n              The Mavericks return home to take on the Los Angeles Lakers on Wednesday night. The Clippers play host to the San Antonio Spurs on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997128.16238
}