{
  "game_id": "0021500443",
  "espn_id": "400828330",
  "date": "Dec 26, 2015",
  "matchup": "CHA vs. MEM",
  "headline": "Walker scores 22 as Hornets rally to beat Grizzlies",
  "body": "CHARLOTTE, N.C. --  Kemba Walker saved his best for last Saturday night, and gave the Charlotte Hornets a much-needed win.\n\nWalker scored 22 points, including 11 in a decisive fourth quarter, and the Hornets held off the Memphis Grizzlies 98-92 to snap a three-game skid.\n\nNicholas Batum had 20 points and 11 rebounds, P.J. Hairston added 14 points, Jeremy Lin 13 and Frank Kaminsky 10 for the Hornets, who rallied from a five-point deficit in the final period.\n\nMike Conley scored 19 points, Marc Gasol had 18 and Zach Randolph added a double-double with 18 points and 12 rebounds for the Grizzlies, who had won three straight before Saturday's loss.\n\n\"We needed this one pretty bad,\" said Walker, who also had eight assists. \"We just wanted to get back on track. We came out with great intensity, but we had a little bit of a bad stretch in the third and fourth (quarters). But we made some big plays.\"\n\nNone moreso than Walker, who came up with the big baskets down the stretch after Memphis had gone up 83-78 on Randolph's layup with 7:43 remaining in the fourth quarter.\n\nBut Charlotte fought back, taking the lead for good at 89-88 on Walker's layup with 1:55 left, the 15th lead change of the game. He followed that up with a 3-pointer with 40 seconds remaining to put the Hornets up 92-88. Charlotte closed out the game by going 6 of 6 on free throws over the final 23 seconds.\n\n\"We've had a bad stretch the last five or six games, so this win was huge for us tonight,\" said Batum, who also had eight assists.\n\n\"For 3 1/2 quarters, I tried to do it,\" Batum said. \"But they were so focused on me the last eight minutes, I went to Kemba and said `Now you've got to take over.' It was his time to take over the game, and he did it perfectly.\"\n\nNeither team could decisively take command over the first three quarters, with five lead changes and five ties in the first half -- the last at 53 at the break -- and five more lead changes and two ties in the third quarter. The teams were even at 74 entering the fourth quarter.\n\n\"It wasn't a completely beautiful game to watch, but a very competitive game,\" Grizzlies coach Dave Joerger said.\n\nBatum had 12 points and six assists, and Hairston added 11 points as the Hornets would pull ahead by as many as 10 points in the half. But the Grizzlies fought back each time.\n\nCharlotte took its biggest lead of the first half, 40-30, on Batum's 3-pointer with 9:26 remaining in the second quarter. But Gasol scored 14 points during a 23-13 run to close out the quarter, with Randolph's free throw with 24.5 seconds left tying the score at 53.\n\n\"The first half, we were really totally lucky to be in that have at halftime,\" Hornets coach Steve Clifford said. \"Obviously, Kemba made some huge plays and our defense was really good in the fourth quarter.\"\n\nTIP-INS\n\nGrizzlies: Made just 11 of 21 free throws (52.4 percent). ... Memphis committed 14 turnovers, leading to 23 Charlotte points.\n\nHornets: Tied their season high with 20 turnovers, leading to 24 Memphis points. ... Also had a season-high 30 fast-break points.\n\nBACK IN THE LINEUP\n\nHornets center Al Jefferson was back in the lineup after serving a five-game suspension for violating the NBA's drug policy. He finished with two points on 1-of-8 shooting and four rebounds in 17 minutes, and fouled out with 8:10 remaining in the fourth quarter.\n\nNO HOMETOWN HELP\n\nTwo of the officials working Saturday night's Grizzlies-Hornets game -- David Guthrie and Haywoode Workman -- live in Charlotte. However, the hometown refs didn't help the Hornets -- they got whistled for 16 fouls in the first half (seven coming in the final 2 1/2 minutes) and 24 for the game. Memphis was only hit with 10 fouls in the first half, but also had 24 by the end of the game.\n\nUP NEXT\n\nGrizzlies: host the Los Angeles Lakers on Sunday afternoon.\n\nHornets: host the Lakers on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994389.2411578
}