{
  "game_id": "0022400646",
  "espn_id": "401705212",
  "date": "Jan 25, 2025",
  "matchup": "MIL @ LAC",
  "headline": "Harden scores 40 points to lead Clippers over Bucks 127-117, snapping Milwaukee's 5-game win streak",
  "body": "INGLEWOOD, Calif. -- — James Harden scored 40 points and the Los Angeles Clippers overcame Giannis Antetokounmpo and Damian Lillard to beat the Milwaukee Bucks 127-117 on Saturday night.\n\n\r\n              Norman Powell added 33 points and Kawhi Leonard had 18 in three quarters to help the Clippers end the Bucks’ five-game winning streak.\n\n\r\n              Antetokounmpo had 36 points, making 12 of 15 free throws, and 13 rebounds. Lillard added 29 points, going 16 of 17 from the foul line, 10 rebounds and 10 assists for his second triple-double in two days. \n\n\r\n              Harden had 12 points in the first half when the Clippers trailed by 11. He took over in the third with 17 points, scoring 15 in a row to end the period with Los Angeles ahead 94-93.\n\n\r\n              The Bucks were in catch-up mode most of the fourth after leading by three early. \n\n\r\n              Powell's dunk launched a 14-0 spurt that Harden capped with a 3-pointer for a 112-100 lead.\n\n\r\n              Takeaways\r\n              Bucks: They fell to 8-11 on the road while being held under their 126-point average. Lillard had his first triple-double with the Bucks against Miami on Thursday. His latest was the fifth of his career. \n\n\r\n              Clippers: They ended a four-game skid to the Bucks.\n\n\r\n              Key moment\r\n              Harden singlehandedly outscored the Bucks 15-9 to end the third.\n\n\r\n              Key stat\r\n              The Clippers made all 28 of their free throws in a game that was tied 17 times.\n\n\r\n              Up next \r\n              The Bucks visit Utah on Monday night. The Clippers are at Phoenix on Monday night to open a four-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997835.2689338
}