{
  "game_id": "0022000403",
  "espn_id": "401267563",
  "date": "Feb 12, 2021",
  "matchup": "MEM @ LAL",
  "headline": "Davis propels Lakers past Grizz 115-105 for 7th straight win",
  "body": "LOS ANGELES -- — Anthony Davis scored 35 points and LeBron James had 28 points, nine rebounds and eight assists in the Los Angeles Lakers' seventh consecutive victory, 115-105 over the Memphis Grizzlies on Friday night.\n\n\r\n                    Kyle Kuzma had 20 points and 10 rebounds for the defending NBA champions, while Davis finished two points shy of his season high in his return from a two-game absence with an Achilles injury.\n\n\r\n                    Montrezl Harrell scored 14 points for Los Angeles, which extended its longest win streak in a year even after falling behind by 20 points in the first quarter. The Lakers also fell behind by 20 two nights ago before rallying to beat Oklahoma City, making them the third NBA team in the past two decades to win back-to-back games after falling behind by 20 in each contest.\n\n\r\n                    “There's a little frustration,\" Kuzma said. \"We should never be down 20 points at any point in time with the personnel that we have on our team. ... But we’ve been through the fire, and we know how to walk people down. We've been having to walk people down a little too much lately.”\n\n\r\n                    The Lakers took their first lead late in the third quarter while James scored 13 points in the period. They took control early in the fourth and wrapped up a perfect five-game homestand — even managing to avoid tying an NBA record by playing a fourth consecutive overtime game.\n\n\r\n                    Grayson Allen scored 23 points and Ja Morant had 22 points and 10 assists in the Grizzlies' fifth loss in six games. Memphis had just nine players in uniform.\n\n\r\n                    “We definitely miss the guys that are out right now,” said Allen, who hit six 3-pointers. “We know they add a lot to our team, but I feel like the nine guys we had available for tonight did a great job of fighting. I don’t think there was any letdown or any factor of fatigue.”\n\n\r\n                    Jonas Valanciunas had 22 points and eight rebounds for the Grizzlies, who hit 12 3-pointers after making a franchise-record 23 against Charlotte two nights earlier.\n\n\r\n                    “Very proud of our effort tonight,” Memphis coach Taylor Jenkins said. “They turned it on in the third quarter. I thought we tried, but for the most part, really proud.”\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Desmond Bane missed his first game of the season for personal reasons after scoring a career-high 18 points Wednesday. Bane wrote on Twitter earlier this week that his great-grandmother had died. ... De’Anthony Melton missed his third straight game with shoulder soreness.\n\n\r\n                    Lakers: Alex Caruso had two points and six assists in his return from a two-game absence with a hand injury. ... Harrell left the court early in the fourth quarter after a collision with Kuzma, but returned to the bench. He was cleared to play, coach Frank Vogel said.\n\n\r\n                    ROUGH START\n\n\r\n                    Memphis opened with a 22-2 run, embarrassing the champions in the first six minutes. The Lakers finished their homestand with four consecutive terrible starts, yet they didn't lose.\n\n\r\n                    Asked to gauge his level of concern with the Lakers' slow starts, Vogel said he's “not there yet.”\n\n\r\n                    “We don’t want to lose any of these games,” Vogel said. “The big picture is to build habits that are going to win for us in the playoffs.”\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: At Kings on Sunday.\n\n\r\n                    Lakers: At Nuggets on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996969.570716
}