{
  "game_id": "0021800069",
  "espn_id": "401070750",
  "date": "Oct 26, 2018",
  "matchup": "DAL @ TOR",
  "headline": "Lowry has 20 as Raptors win 6th straight, beat Mavs 116-107",
  "body": "TORONTO --  With a strong start and a big finish, Kyle Lowry and the Toronto Raptors added to their perfect start.\n\nLowry had 20 points and 12 assists, Kawhi Leonard scored 21 points and Toronto set a franchise record with its sixth straight win to start the season, beating the Dallas Mavericks 116-107 on Friday night.\n\nJonas Valanciunas scored 17 points, Danny Green had 15 and Serge Ibaka finished with 11 as the Raptors eclipsed the 5-0 start they recorded in 2015-16.\n\nDeAndre Jordan had 18 points and 15 rebounds for the Mavericks, who trailed by 17 points in the first quarter. Luka Doncic scored 22 points, and Wesley Matthews had 21.\n\nJordan struggled to find a family friendly way to describe Dallas' poor showing in the first.\n\n\"Our defense to start the game has been ... what's a G-rated word? Terrible,\" he said.\n\nDallas clawed back and trailed by three heading into the fourth, but Toronto opened the quarter with a 9-2 run. Dallas shot 7 for 24 in the fourth.\n\n\"We just didn't compete at the same level they did down the stretch,\" Mavs forward Harrison Barnes said. \"That's what the big difference was.\"\n\nLowry, who didn't turn the ball over, recorded 10 or more assists for a career-best fourth straight game. He's the first Raptors player to accomplish the feat since Jose Calderon had five in a row in March 2012.\n\n\"He's really good,\" Raptors coach Nick Nurse said. \"Each year that goes by, he starts being able to pick out things and see it more clearly.\"\n\nNurse replaced Dwane Casey last summer. He is staying focused during Toronto's solid start.\n\n\"I'm not getting too far down the road,\" Nurse said.\n\nDallas, which let a 26-point lead slip away in Wednesday's loss at Atlanta, dropped its second straight after winning two in a row.\n\n\"We did a lot of good things tonight but we obviously have some things to clean up,\" coach Rick Carlisle said.\n\nGreen scored 12 points in the first as the Raptors raced out to an 18-2 lead. Toronto led 39-26 after its highest-scoring quarter of the season so far.\n\nMatthews scored nine points in the second and Doncic had eight as Dallas cut the deficit to five late in the quarter. Leonard scored nine points for the Raptors and Lowry had eight to help Toronto to a 69-60 lead at halftime.\n\nBARNES BACK\n\nBarnes made his season debut after missing the first four games because of a strained right hamstring. He shot 5 for 17 and scored 14 points.\n\n\"He gives us a dimension that we desperately need so it's great to have him back out there,\" Carlisle said.\n\nALL IN THE FAMILY\n\nJordan arrived for the game dressed in a replica of the No. 58 jersey his brother Avery Jordan wears as an offensive lineman for the Hamilton Tiger Cats of the Canadian Football League. Hamilton is about 40 miles west of Toronto. Jordan said he watches his brother's games on television but has been unable to attend one in person.\n\nTIP-INS\n\nMavericks: Jordan led Dallas with five assists. ... Dallas missed nine of its first 10 field-goal attempts, and then made eight of the next 12. ... Mavs rookie Jalen Brunson is the son of former Raptors guard and nine-year NBA veteran Rick Brunson.\n\nRaptors: G Fred VanVleet (sprained left big toe) missed his second straight game. ... G Delon Wright (left thigh) sat for the fifth time in six games. ... F OG Anunoby (personal reason) was inactive. ... Toronto has allowed at least 100 points in all six games this season. ... Leonard led Toronto with nine rebounds. ... Blue Jays pitcher Marcus Stroman and New York Mets outfielder Jose Bautista, a former Jays slugger, sat courtside.\n\nUP NEXT\n\nMavericks: Host Utah on Sunday night.\n\nRaptors: At Milwaukee on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995474.727872
}