{
  "game_id": "0022300955",
  "espn_id": "401585583",
  "date": "Mar 14, 2024",
  "matchup": "PHX @ BOS",
  "headline": "Brown, Tatum combine for 63 points as Celtics overwhelm Suns for 2nd time in a week, 127-112",
  "body": "BOSTON -- — Celtics coach Joe Mazzulla has a team rule that everybody contests shots, even after the whistle. Players, coaches -- everybody. \n\n\r\n              So when Mazzulla sprinted to prevent Phoenix's Royce O'Neale from dropping in a practice basket heading into a timeout, it didn't shock Jayson Tatum. \n\n\r\n              “Just Joe being Joe,” the All-Star said. \n\n\r\n              It's a mentality that continues to permeate throughout the Celtics as NBA's top team keeps racking up wins — and now a playoff spot.\n\n\r\n              Jaylen Brown scored 37 points, Tatum added 26 and Boston powered past the Phoenix Suns 127-112 on Thursday night, becoming the first team to clinch a spot in the postseason.\n\n\r\n              Al Horford finished with 24 points, including six of Boston’s season high-tying 25 3-pointers to help the Celtics down the Suns for the second time in a week. Boston improved to an NBA-best 52-14 on the season and 10-2 in the second game of back--to-backs. \n\n\r\n              Brown said his performance was a microcosm of how he's tried to attack everything this season — with an eye on not repeating the same mistakes that have contributed to his team coming up short of their championship goal. \n\n\r\n              That has included a season-long focus on improving his ability as a playmaker. \n\n\r\n              \"Just attacked my weaknesses,\" Brown said. “I feel like some of the things you said about me last year you can't say about me this year.”\n\n\r\n              In their two wins over the Suns, the Celtics combined for 40 3-pointers. \n\n\r\n              “They're the best in the league at it,” Suns coach Frank Vogel said. “It's tough to guard. You talk about all the ways you try to limit it. We did the best we can with it. But we didn't do enough tonight.”\n\n\r\n              Devin Booker led the Suns with 23 points. Bradley Beal finished with 22 points and seven assists. Kevin Durant and Grayson Allen both added 20 points. \n\n\r\n              Boston won despite playing without Kristaps Porzingis, who missed his fourth straight game with a strained right hamstring. He remains day to day.\n\n\r\n              Last week, the Celtics overpowered a Suns team playing without Booker (ankle) during a double-digit win in Phoenix, despite a 45-point night by Durant. \n\n\r\n              Durant came out hot again in Thursday’s rematch. But Booker started slowly before finishing 9 of 20 from the field. Meanwhile, the All-Star duo of Tatum and Brown combined for 43 of the Celtics’ 65 first-half points. \n\n\r\n              Tatum was in attack mode for most of the opening 24 minutes, leading a Celtics flurry just before halftime by scoring seven of his team’s final 10 points. That included back-to-back 3s over Durant that sent roars throughout the home crowd. He also was one of the primary defenders on Durant, limiting him to only five points over the final three quarters.\n\n\r\n              Tatum and Durant dueled early, trading baskets in the opening period, with each showing off multiple ways to break down the opposing defense. Durant had 15 first-quarter points, connecting on 7 of 8 shots. Tatum poured in 13 points, going 6 for 9 from the field. \n\n\r\n              It all helped offset Phoenix’s 27-13 rebounding edge in the first half. \n\n\r\n              UP NEXT\n\n\r\n              Suns: At Hornets on Friday. \n\n\r\n              Celtics: At Wizards on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996640.3439062
}