{
  "game_id": "0022200966",
  "espn_id": "401469121",
  "date": "Mar 05, 2023",
  "matchup": "ORL vs. POR",
  "headline": "Lillard scores 41, Blazers hold off Magic 122-119",
  "body": "ORLANDO, Fla. -- — Damian Lillard scored eight of his 41 points from the foul line in the final three minutes Sunday night to the lead the Portland Trail Blazers to a 122-119 win over the Orlando Magic.\n\n\r\n              Jerami Grant added 20 points, six rebounds and seven assists for the Blazers, and broke a tie with a 3-pointer for the game's final field goal with 35 seconds left.\n\n\r\n              “We had to have this one,” said Lillard, who also had a game-leading nine rebounds to help the Blazers break a three-game losing streak. “We’ve got 19 games left now. Everybody else is playing with a sense of urgency because they know the race is tight. Lose one and you can drop three spots. Win a couple and you can really make up some ground.”\n\n\r\n              The Blazers are one game behind Utah and New Orleans for a spot in the Western Conference play-in tournament.\n\n\r\n              Paolo Banchero led Orlando with 26 points. Franz Wagner added 24, and Markelle Fultz finished with 15 points, eight assists and four steals.\n\n\r\n              Two 3-pointers by Lillard and one by Shaedon Sharpe filled a run late in the third quarter that broke an 83-all tie and left Portland with a nine-point lead, the largest of the game.\n\n\r\n              The Magic did not catch up until Fultz drove for a layup to tie it at 113 with 58 seconds left.\n\n\r\n              Nassir Little answered with a 3-pointer, and the rest of the game was all free throws. \n\n\r\n              “The ball was swung to (Little) and he hit the biggest shot of the game,” Lillard said. “It showed a lot of growth on his part.”\n\n\r\n              “We know everybody’s going to do the best they can to take Dame away, and everybody else has to be aggressive,” said Portland coach Chauncey Billups. “That was a big-time shot.”\n\n\r\n              Portland led 58-56 after a first half in which Banchero made all seven of his shots and scored 16 points.\n\n\r\n              Lillard scored 14 points in the first half and missed all six of his 3-point attempts. The second half was a different ball game, especially for Lillard.\n\n\r\n              “He shot 20 free throws tonight. It just kind of makes it hard to guard him. You just want to put your hands behind your back,” said Magic guard Jalen Suggs, who had 15 points and three steals. “When he shoots 20 free throws by himself, it's kind of hard to stop him from having a huge night.”\n\n\r\n              TIP-INS\n\n\r\n              Blazers: Lillard (17 for 20) missed more than one free throw for the first time since Jan. 25. In the 16-game interim he shot 168 for 176 (95.5%). ... G Anfernee Simons missed a second game with a sprained right ankle. ... C Jusuf Nurkic missed a 13th game with a strained left calf. . . . Grant and Lillard had 4-point plays.\n\n\r\n              Magic: C Wendell Carter Jr. (left hip pain) and G Gary Harris (hip) did not play. ... The Magic played for the first time at home since losing F Jonathan Isaac to season-ending surgery on a torn adductor muscle. Isaac played 124 minutes in 11 games after missing 2 1/2 seasons due to knee injuries.\n\n\r\n              BIG REVERSAL FOR BLAZERS\n\n\r\n              The game hinged on a replay reversal.\n\n\r\n              With 2:07 remaining and the Blazers up by one, Lillard tried to slide through two Magic defenders and was called for a charge. But Billups challenged the call, and a review determined that Suggs had not “established position” outside the arc before the contact. Lillard then made two free throws.\n\n\r\n              “It was a big moment in the game,” Billups said. “A big play.”\n\n\r\n              UP NEXT\n\n\r\n              Blazers: Play at Detroit on Monday night.\n\n\r\n              Magic: Play at home against Milwaukee on Tuesday night. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994319.470948
}