{
  "game_id": "0021800488",
  "espn_id": "401071169",
  "date": "Dec 23, 2018",
  "matchup": "CHA @ BOS",
  "headline": "Irving scores 25, Celtics beat Hornets 119-103 to end skid",
  "body": "BOSTON --  A little internal venting seemed to get the Boston Celtics back on track.\n\nKyrie Irving scored 25 points, Jayson Tatum had 17 and the Celtics ended a three-game skid with a 119-103 win over the Charlotte Hornets on Sunday night.\n\nBoston was coming off a 120-107 loss at home to Milwaukee on Friday, which prompted a closed-door meeting in the locker room. The Celtics came out Sunday looking much more like the team that had won eight straight before the skid.\n\n\"The team meeting was good,\" said Marcus Morris, who had 12 points and eight rebounds for the Celtics. \"We talked about a few things. Guys understood where other guys were coming from. We just opened up to each other, and I think it was beneficial.\"\n\nIn addition to clearing the air, the Celtics had Al Horford back in the lineup after he missed seven games with a sore left knee. Horford finished with 10 points and six rebounds.\n\nIrving said Horford's return certainly helped on the court and in the locker room with another veteran voice helping smooth over the recent tensions.\n\n\"We have so much depth,\" Irving said. \"Getting past those things, just egocentric things, this is a chance of a lifetime for us. In order to achieve what we want to, we have to be closer as a team.\"\n\nThe Celtics responded Sunday by scoring the first nine points and never trailed. Boston shot 50 percent and outrebounded the Hornets 47-37.\n\n\"They just wanted it more. They came out hungrier,\" said Kemba Walker, who led Charlotte with 21 points. \"They came out on a mission, and they accomplished it.\"\n\nAfter a tight first quarter, the Celtics blew it open in the second, starting with eight straight points during a 14-1 run. Boston made 23 of 44 shots in the second quarter and took a 68-47 lead into halftime.\n\nThe third quarter was more of the same, with Boston opening on a 12-4 run and taking an 80-53 lead when Irving drove for a layup while drawing a foul with 6:57 left in the period.\n\nThe reserves took over in the fourth quarter and all but one Boston player finished with at least three points. Brad Wanamaker was the only member of the Celtics without a point, missing his only two shots in 7:10 of the fourth quarter.\n\nSTARTING LINES\n\nAfter pacing the Hornets through a tight first quarter with 14 points, Walker scored only seven the rest of the way. Jeremy Lamb was the only other starter for Charlotte to score in double figures with 14 points -- tying the combined total for the Hornets' three other starters.\n\nBoston's starters outscored Charlotte's 70-49.\n\n\"I think in our overall mentality just wasn't there tonight,\" Charlotte coach James Borrego said. \"They were just the more aggressive team. They just looked like the more hungry team tonight.\"\n\nBIG AL\n\nHorford said his knee felt good after playing 19 minutes Sunday, making all four of his shots and adding five assists. Coach Brad Stevens said Horford's minutes were capped at 20, which was not an issue as he and the rest of Boston's starters rested the entire fourth quarter.\n\n\"I'm just happy that I was able to go out there and play with a lot of energy. It's just good to be back. Sitting on the sidelines is tough, not being able to be on the court and help the guys,\" said Horford, who made his 900th career block in the third quarter.\n\nTIP-INS\n\nHornets: Walker scored 18 of Charlotte's 47 points in the first half. ... Malik Monk had 13 points -- all in the fourth quarter. ... Willy Hernangomez added 19 points and 10 rebounds off the bench.\n\nCeltics: Irving led all scorers with 23 points at halftime, making 8 of 10 shots, including four 3-pointers. ... Morris scored 10 points in the second quarter. ... Irving had five assists. ... Daniel Theis finished with 10 points.\n\nUP NEXT\n\nHornets: Visit Brooklyn on Wednesday night.\n\nCeltics: Host Philadelphia on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994402.294442
}