{
  "game_id": "0021400320",
  "espn_id": "400578612",
  "date": "Dec 10, 2014",
  "matchup": "CHI vs. BKN",
  "headline": "Bulls pull away from Nets for 105-80 victory",
  "body": "CHICAGO -- The Chicago Bulls used a rare lull in the schedule to focus on their defense, and it paid off in the second half against Brooklyn.\nDerrick Rose scored 23 points, and the Bulls pulled away from the Nets for a 105-80 victory on Wednesday night. Chicago held Brooklyn to 29 points on 26.2 percent shooting (11 for 42) in the final two periods.\n\"They came out with a lot of energy. They got us back on our heels,\" Bulls coach Tom Thibodeau said. \"I liked the way we responded in the second half.\"\nChicago had six players, including all five starters, score in double figures in its first game since Saturday night's 112-102 loss to Golden State. Jimmy Butler had 18 points, Pau Gasol added 16 points and 16 rebounds, and Mike Dunleavy scored 14 points. Taj Gibson finished with 11 points and 10 boards.\n\"The third quarter, we really got into it,\" said Gibson, who also matched a career high with six blocked shots. \"We tried to be a dominant team on rebounding, tried to just finish strong.\"\nDeron Williams led Brooklyn with 17 points, but the Nets dropped their third straight. Kevin Garnett scored 13 points, and Alan Anderson had 12.\n\"They turned up their defense and they put on a block party,\" Brooklyn coach Lionel Hollins said.\nGarnett left in the fourth quarter because of a left foot injury. The team said X-rays were negative, and Garnett said he was all right.\nChicago grabbed control with a 17-3 run in the third quarter.\nRose made a 3-pointer, and Gibson had a big dunk before Gasol capped the surge with four straight points, including two foul shots that made it 70-58 with 3:32 to go.\nIt just got worse for injury-riddled Brooklyn in the final period, with Chicago scoring 15 straight points to increase its advantage to 101-73 with 3:17 to go. Butler finished the run with a jumper.\n\"It's a work in progress,\" Garnett said. \"We've got to continue to work. It doesn't help that guys are out of the lineup so we've all got to continue to come in here, continue to work, and try to get better.\"\nThe 25-point margin was the biggest win of the season for Chicago, which also beat Brooklyn 102-84 on Nov. 30. The Bulls had allowed at least 100 points in four of their previous six games, but Rose said the work in practice on Monday and Tuesday helped them turn it around.\n\"We did a lot of defensive drills,\" Rose said. \"I think he (Thibodeau) was just trying to make us be aggressive while we were out there instead of just holding back and letting them walk wherever they want to go, run wherever they want to go.\"\n---\nMISSING\nThe Nets played without forward Mirza Teletovic, who was sidelined by a right hip pointer. Joe Johnson (flu) and Brook Lopez (lower back strain) missed their second straight game, and Andrei Kirilenko was held out because of personal reasons, according to the team.\nJoakim Noah, the reigning NBA Defensive Player of the Year, and rookie Doug McDermott missed the game for Chicago. Noah has a sprained right ankle, and McDermott has been hampered by a sore right knee.\nREBOUNDING\nThe Bulls outrebounded the Nets 57-44. The 57 rebounds were a season high for Chicago.\nTIP-INS\nNets: Brooklyn dropped to 4-6 on the road. It has lost 10 of its last 12 games at the United Center, counting the postseason. ... Garnett had two steals to give him 1,801 for his career. He is the 16th NBA player with at least 1,800.\nBulls: Gasol has recorded a double-double in each of his last seven games. He leads the team with 13 this season. ... Chicago has scored at least 100 points in seven straight games for its longest streak since an eight-game run from March 26-April 11, 2009. ... The Bulls improved to 3-5 at home.\nUP NEXT\nNets: Host Philadelphia on Friday.\nBulls: Host Portland on Friday.\n---\nJay Cohen can be reached at http://www.twitter.com/jcohenap",
  "source": "espn_api",
  "crawled_at": 1764991711.569094
}