{
  "game_id": "0022401171",
  "espn_id": "401705737",
  "date": "Apr 11, 2025",
  "matchup": "MIL @ DET",
  "headline": "Antetokounmpo's 11th triple-double lifts Bucks to 125-119 win over Pistons to secure No. 5 seed",
  "body": "DETROIT -- — Giannis Antetokounmpo had 32 points, 15 assists and 11 rebounds to lead the Milwaukee Bucks in a 125-119 win over the Detroit Pistons on Friday night, securing the No. 5 seed in the Eastern Conference playoffs.\n\n\r\n              Milwaukee will face the fourth-seeded Indiana Pacers in the first round, a year after losing to them in the opening round.\n\n\r\n              Cade Cunningham scored 36 points on 15-of-21 shooting for the Pistons, who will be seeded sixth in their first postseason appearance since 2019.\n\n\r\n              Detroit will match up with the third-seeded New York Knicks, shooting to at least win one playoff game for the first time since 2008.\n\n\r\n              Antetokounmpo has a career-high 11 triple-doubles this season, surpassing his total from last year by one.\n\n\r\n              Milwaukee's Bobby Portis Jr. had 17 points and 10 rebounds, Kevin Porter Jr. scored 16, Brook Lopez had 15 points and seven rebounds and Kyle Kuzma added 10 points.\n\n\r\n              Malik Beasley scored 21 points, Jalen Duren had 11 points and 16 rebounds, Tobias Harris scored 17, Dennis Schroder had 12 points and Ausar Thompson chipped in with 11 points.\n\n\r\n              Takeaways\r\n              Bucks: Antetokounmpo had a calf injury that kept him out of the 2024 playoffs, leading to the team's second straight first-round exit, and the team is thankful he's healthy. The two-time MVP has played in 67 of 81 games and coach Doc Rivers praised what the 6-foot-11, 254-pound forward has done to take care of his body.\n\n\r\n              Pistons: After winning an NBA-low 14 games last season, Detroit has had a turnaround with 30 more wins that trails just five teams in NBA history. The other teams, led by the 2008 Boston Celtics, won at least 20 games before bouncing back the following year.\n\n\r\n              Key mo\r\n              ment\r\n              A.J. Green made a 3-pointer with 1:51 left, giving the Bucks a nine-point lead to help them pull away.\n\n\r\n              Up next\r\n              The Bucks and Pistons close the regular season Sunday in Milwaukee.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/nba\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764997810.991953
}