{
  "game_id": "0022300944",
  "espn_id": "401585572",
  "date": "Mar 12, 2024",
  "matchup": "MIN @ LAC",
  "headline": "Anthony Edwards leads big comeback, Kawhi Leonard injured in Timberwolves' 118-100 win over Clippers",
  "body": "LOS ANGELES -- — Anthony Edwards scored 37 points, Nickeil Alexander-Walker added a season-high 28 and the Minnesota Timberwolves roared back from an early 22-point deficit for a 118-100 victory over the Los Angeles Clippers on Tuesday night.\n\n\r\n              Kawhi Leonard left the game with back spasms between the first two quarters, the Clippers said. He played the entire first quarter, but he was seen leaving the Clippers' downtown arena during the second quarter.\n\n\r\n              Mike Conley scored 23 points for the Timberwolves, who avoided their first three-game losing streak of the season with a huge rally following Leonard’s departure. After trailing 57-35 midway through the second quarter in the same building where the Wolves lost to the Lakers two days earlier, Minnesota seized control in the second half and finished the team’s largest comeback since November 2012.\n\n\r\n              “It was no secret this was probably the biggest game of the season for us so far,” said Conley, who hit five 3-pointers. “Having lost a couple in a row in the way that we lost them, and who we're playing, the Clippers. They're right with us in seeding, and so it meant a lot, and for us to steal this one today ... hopefully sets us up for bigger and better things.”\n\n\r\n              Rudy Gobert had eight points and 11 rebounds before leaving the game late with a rib injury. Coach Chris Finch wasn't sure of the injury's severity, but he praised Gobert for raising his defensive effort after the Wolves fell far behind, eventually keying their comeback.\n\n\r\n              “This team believes in itself,” Finch said. “When you play defense the way we’re able to play defense. The ball was really moving at times, too. Got out in transition. We really haven’t really seen us in transition like that. Those were the things we had to do to turn that game around. But this team believes in each other, no matter who we put on the floor. They root hard for each other. It’s good for us to get a win like this, because we’ve been struggling a little bit in the last couple of games to find some consistent energy, and tonight we definitely had it.”\n\n\r\n              Alexander-Walker hit five 3-pointers during his highest-scoring performance in a Minnesota uniform while the Timberwolves improved to 2-2 on their six-game road trip.\n\n\r\n              Paul George scored 22 points and James Harden had 12 for the Clippers, who have lost two straight games for only the second time since Christmas. George and Leonard returned after they skipped the Clippers’ home loss to Milwaukee in the club's second home tipoff in 22 hours last Sunday, although Leonard didn’t last long.\n\n\r\n              “They played tougher than we did, for sure, no doubt,” Clippers coach Tyronn Lue said. “We can talk about schemes and things, but when things don’t go right, we’ve got to get tougher.”\n\n\r\n              Lue also said Leonard has been dealing with back woes “for a couple of days. ... Wasn't sure if he was going to go this morning. Tried to get on the court and play today, and it just didn't loosen up on him.”\n\n\r\n              Although Karl-Anthony Towns is out with the knee injury that's likely to sideline him until the playoffs, Gobert returned from a one-game absence with a right hamstring injury. Gobert then apparently injured his ribs or sternum at some point in the second half, heading to the locker room in obvious pain.\n\n\r\n              Kyle Anderson had 10 points and seven assists in his return to the Wolves' starting lineup after an absence with right shoulder pain, but guard Monte Morris missed his third straight game with a strained left hamstring.\n\n\r\n              Minnesota committed six turnovers while falling behind by 15 points in the first quarter, and Los Angeles' lead ballooned to 57-35 midway through the second before the Wolves made a 20-2 run shortly before halftime. The Wolves took their first lead early in the third quarter, and the Clippers managed just 15 points with nine turnovers in the period.\n\n\r\n              Towns underwent surgery on the torn meniscus in his left knee, and the Timberwolves won't evaluate him for another four weeks. He seems likely to miss the rest of the regular season, but Finch said Towns' absence for much of last season with a calf injury prepared Minnesota for his current absence.\n\n\r\n              “Everybody goes through a tough stretch at some point (because of injuries),” Finch said. “We're getting it now.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Utah on Saturday.\n\n\r\n              Clippers: At Chicago on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764996456.496005
}