{
  "game_id": "0021500474",
  "espn_id": "400828361",
  "date": "Dec 30, 2015",
  "matchup": "CHA vs. LAC",
  "headline": "Redick scores 26 as Clippers hold off Hornets 122-117",
  "body": "CHARLOTTE, N.C. --  The Los Angeles Clippers are doing quite well without Blake Griffin.\n\nJ.J. Redick scored 26 points, Austin Rivers added a season-best 22, and the Clippers held off the Charlotte Hornets 122-117 on Wednesday night.\n\nChris Paul had 19 points and 11 assists for Los Angeles, which had a season-high scoring game in its fourth consecutive victory. DeAndre Jordan finished with 13 points and 13 rebounds.\n\nDown 92-86 entering the fourth quarter, Charlotte managed to cut the Clippers' lead to 94-93 on Jeremy Lamb's three-point play with 10:09 remaining. But Los Angeles responded with a 14-4 run.\n\n\"We got off to a great start again, like the other night,\" Clippers coach Doc Rivers said, referring to their 108-91 victory at Washington on Monday.\n\n\"I thought our bench was phenomenal tonight. They were good in the first half, but in the second half to come in when they had cut the lead and then stretch it was huge for us.\"\n\nAll four wins in this streak have come on the road, and three of them without Griffin, who is out indefinitely with a torn tendon in his left quadriceps muscle. Griffin, a five-time All-Star, leads the Clippers with 23.2 points per game, and is second on the team with his 8.7 rebounding average.\n\n\"It's by committee,\" Paul said. \"When you're missing somebody as big as Blake is for us, we're just trying to make do and stay afloat until he gets back.\n\n\"(But) Austin was amazing tonight. You could sort of see it on his face in the locker room. Our second unit's energy gave us a chance to rest a lot in the fourth quarter.\"\n\nKemba Walker scored 29 points for the Hornets, who played without Al Jefferson due to a knee injury that will sideline the 6-foot-10 center for at least six weeks.\n\nThe Hornets announced during the game that Jefferson will have arthroscopic surgery Thursday to repair a tear in the lateral meniscus of his right knee. He is averaging 12.5 points and 6.1 rebounds in 19 games this season.\n\nFrank Kaminsky had 20 points for Charlotte, which had won two straight. Lamb and Nicolas Batum added 19 apiece, and Cody Zeller scored 12.\n\nLos Angeles led from the start, opening with a 13-3 run over a four-minute span. But the Hornets closed to 53-52 on a Walker layup with 4:08 remaining.\n\nThe Clippers then finished the half on a 12-4 run, capped by Paul Pierce's 3-pointer at the buzzer.\n\n\"We started the game with no defensive mentality -- we couldn't guard them,\" Hornets coach Steve Clifford said during a brief postgame press conference, during which he took no questions. \"Really, the tone was set.\n\n\"They were really good offensively, obviously. But to me, if our expectations of ourselves are going to be that low, that we're not going to meet the challenge of having a chance to play against a Paul, a Redick, a Jordan like that, then we're never going to be the team that we need to be.\"\n\nTIP-INS\n\nClippers: Pierce finished with 13 points and Jamal Crawford had 11. . Los Angeles shot 52.1 percent (37 for 71) from the field. It also made a season-best 15 3-pointers in 30 attempts.\n\nHornets: In addition to Jefferson, Charlotte also played without center Spencer Hawes (back spasms), and guard Jeremy Lin (ankle). Batum (toe) was a game-time decision.\n\nLANCE'S HOMECOMING\n\nClippers guard Lance Stephenson went scoreless in three minutes in his first appearance at Time Warner Cable Arena since his offseason trade from the Hornets for Hawes and Matt Barnes (since traded to the Grizzlies).\n\nUP NEXT\n\nClippers: Visit New Orleans on Thursday night.\n\nHornets: Visit Toronto on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994387.615465
}