{
  "game_id": "0021500256",
  "espn_id": "400828143",
  "date": "Nov 30, 2015",
  "matchup": "OKC @ ATL",
  "headline": "Millsap, Teague lead Hawks to 106-100 win over Thunder",
  "body": "ATLANTA --  Russell Westbrook let out an emphatic scream at the top of the key, surely believing his fourth-quarter outburst would carry the Oklahoma City Thunder to another victory.\n\nNot so fast.\n\nJeff Teague brought the Atlanta Hawks back, just when it looked as though they had let one slip away.\n\nTeague scored 25 points and made all the big shots down the stretch, sending the Hawks to a 106-100 victory that snapped Oklahoma City's four-game winning streak Monday night.\n\n\"We know he's capable of getting really hot,\" Teague said of Westbrook. \"We just tried to do our best to make it tough for him, make him try to make tough 2s, and at the other end just try to be aggressive.\"\n\nWestbrook scored 34 points, half of them in the final quarter. He scored off a drive with 2:49 remaining to give the Thunder their first lead since the opening basket, and then knocked down a jumper to put Oklahoma City up by four.\n\nTeague took control from there. The point guard darted into the lane for a basket that thwarted the Thunder's run, Paul Millsap hit a pair of free throws to tie it, and Teague scored on another dash to the rim to put Atlanta ahead for good, 98-96, with 1:09 left.\n\nThe Hawks made a big stop on Westbrook, as well. A timeout allowed Kent Bazemore to get on the court to guard the Thunder star, and the move paid off when he was forced into an errant pass that was stolen by Thabo Sefolosha.\n\nIn addition to the crucial turnover, Oklahoma City made just one of its last five shots.\n\n\"We just put ourselves in a bad position,\" Westbrook said.\n\nMillsap led the Hawks with 26 points and grabbed 11 rebounds. Al Horford added 21 points, 13 rebounds and closed out the game with a dunk.\n\n\"We're learning ... that when a team is making a run, not to get rattled,\" Millsap said. \"I felt like we kept our composure really well. (Westbrook) got hot, and when a guy like that gets hot, he's tough to stop. But we stayed cool, finally got some stops and scored the basketball when we needed to.\"\n\nKevin Durant, selected Western Conference player of the week after coming back from a left hamstring injury, had 25 points. Still, the Thunder lost for the first time since he rejoined the lineup.\n\n\"I could've been a lot better,\" Durant said.\n\nIndeed, it was Westbrook who carried Oklahoma City. He also grabbed 11 rebounds and dished out seven assists.\n\nSEFOLOSHA'S VALUE\n\nAt first glance, Sefolosha didn't have a very good game. He missed all five of his shots and was the only Atlanta starter who failed to score.\n\nHis teammates knew better.\n\nSefolosha, a former Oklahoma City player, spent most of the game guarding Durant, grabbed eight rebounds, dished out six assists, and came up with four steals.\n\n\"He didn't score,\" Millsap said, \"but he did everything else.\"\n\nTIP-INS\n\nThunder: Andre Roberson picked up a technical from the bench for griping about a non-call in the second quarter. After Anthony Morrow missed a 3-pointer from the corner, and didn't get a whistle on apparent contact, Roberson barked out something from the bench. Referee Leroy Richardson whipped around and hit the player with a technical. ... When Durant checked back into the game in the fourth quarter, Atlanta coach Mike Budenholzer was barking at the officials. \"What's up, Bud?\" Durant shouted with a sly grin. The stern-looking Budenholzer broke into a big smile. ... Serge Ibaka had 17 points. ... Ibaka and Durant both had four blocks.\n\nHawks: Sefolosha started for the fifth time in the last six games at small forward, leaving former starter Bazemore in a bench role. Bazemore has started only one of three games since coming back from an ankle injury, but both were on the court for the defensive stand in the closing seconds. ... Bazemore had seven points. ... The Hawks outrebounded the Thunder 51-48.\n\nUP NEXT\n\nThunder: Travel to Miami on Thursday to face the Heat.\n\nHawks: Host the Toronto Raptors on Wednesday.\n\n---\n\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 . His work can be found at http://bigstory.ap.org/content/paul-newberry .",
  "source": "espn_api",
  "crawled_at": 1764994203.79985
}