{
  "game_id": "0022200314",
  "espn_id": "401468469",
  "date": "Nov 30, 2022",
  "matchup": "MIA @ BOS",
  "headline": "Royal night: Tatum scores 49, Celtics hold off Heat 134-121",
  "body": "BOSTON -- — Camera phones throughout Boston's TD Garden were fixed on the seats adjacent the Celtics' bench as the Prince and Princess of Wales sat courtside in the city's hallowed arena on Wednesday. \n\n\r\n              Yet it was the Celtics' reigning basketball prince who ultimately owned the night.\n\n\r\n              Jayson Tatum had eight 3-pointers and scored a season-high 49 points, and the Celtics held off the hot-shooting Miami Heat for a 134-121 victory.\n\n\r\n              It was the All-Star’s third 40-point game this season as he continues to pace the league’s top-rated offense and make an early case for MVP consideration in his sixth NBA season. \n\n\r\n              “Just kind of being in the right spot,\" Tatum said. \"I seen a couple go down early. Just kind of shooting in rhythm.”\n\n\r\n              Boston, which shot 55% (46 for 83) has won five straight and 14 of its last 15. \n\n\r\n              Tatum scored the Celtics’ first six points and had 41 points after three quarters, using his entire offensive repertoire, scoring from the outside and slashing to the basket. He finished 15 of 25 from the field, 8 of 12 from 3-point range and 11 of 12 from the line. He also grabbed 11 rebounds.\n\n\r\n              During pregame warmups Tatum said teammate Grant Williams predicted he would score 50 points. Tatum isn't stressing over coming up a point short. \n\n\r\n              “I've scored 50 a couple times,” Tatum said. “I'll do it again one day.” \n\n\r\n              Jaylen Brown had 26 points following a one-game absence due to neck stiffness. Malcolm Brogdon added 21 points, connecting on five of Boston’s 22 3-pointers in the game. \n\n\r\n              Max Strus finished with 23 points and five 3-pointers for the Heat. Bam Adebayo also added 23 points before being ejected in the closing seconds following a pair of technical fouls. Tyler Herro chipped in 22 points and nine assists,\n\n\r\n              Miami, which shot 52% (47 for 90) overall, was 18 of 40 from beyond the arc. \n\n\r\n              It turned out not to be nearly enough. \n\n\r\n              The teams meet again in Boston on Friday. \n\n\r\n              Heat coach Erik Spoelstra said Miami was hurt most by how Boston was able to get points in transition and gain extra possessions by scrambling to loose balls. \n\n\r\n              “That's the bar. Now we have to figure out how to overcome that to get a win,” Spoelstra said. “Once they started knocking down a few, then everybody got involved in that.”\n\n\r\n              The Heat were again without star Jimmy Butler, sidelined for a seventh straight game with a sore right knee. \n\n\r\n              After falling into an early hole and trailing 68-60 at the half, Miami kept pace thanks, in part, to five 3-pointers and 19 points in the third quarter from Strus. \n\n\r\n              Boston took a 102-96 lead into the fourth, but Miami didn’t let up and closed within 118-115 on a layup by Highsmith with just over five minutes to play. \n\n\r\n              The Celtics got some breathing room with a 13-6 run, capped by Tatum’s eighth 3 of the game that made it 131-121. \n\n\r\n              CLOSE TO DEBUT\n\n\r\n              Celtics big man Robert Williams in getting close to making his season debut. Williams is working his way back into playing shape and could be available to play “soon,” interim coach Joe Mazzulla said before the game. \n\n\r\n              Williams has yet to play this season after undergoing surgery in late September on the left knee that caused him to miss time during Boston’s NBA Finals run last season.\n\n\r\n              TIP-INS\n\n\r\n              Heat: C Dewayne Dedmon sat with plantar fasciitis in his left foot. … Udonis Haslem saw action for just the third time this season. The 42-year-old logged nine-plus minutes going 0 for 2 from the field with one rebound. \n\n\r\n              Celtics: Have won 10 straight at home. ... It was Tatum’s 14th career regular-season game with at least 40 points. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995197.439125
}