{
  "game_id": "0022200812",
  "espn_id": "401468967",
  "date": "Feb 06, 2023",
  "matchup": "SAC @ HOU",
  "headline": "Murray hits eight 3-pointers as Kings beat Rockets 140-120",
  "body": "HOUSTON -- — Keegan Murray had a career-high 30 points and set a franchise rookie record with eight 3-pointers to help the Sacramento Kings snap a two-game skid with a 140-120 win over the Houston Rockets on Monday night. \n\n\r\n              The fourth overall pick in last year’s NBA draft, Murray shot 8 for 12 from beyond the arc on a night when the Kings made 21 3-pointers. The previous team mark for 3s by a rookie was set by Ricky Berry with seven in 1989.\n\n\r\n              Murray went 1 for 16 on 3-pointers over his past three games. \n\n\r\n              “Nothing changed there except the ball going in,” Murray said. “I just found a rhythm and when you see the ball going in early, it helps a lot.”\n\n\r\n              Sacramento coach Mike Brown was pleased to see Murray break out of what he called a “mini-slump.\" \n\n\r\n              “We just think he’s that good of a shooter and he’s capable,” Brown said. “Now, I’m not saying he’s going to go 8 for 12 every night, but we’ve seen Keegan shooting the ball at a high high level this year and so it’s not surprising when it happens.” \n\n\r\n              Malik Monk added 20 points off the bench and Domantas Sabonis had 17 points, seven rebounds and 10 assists in the first of consecutive games between the teams. \n\n\r\n              De’Aaron Fox had 16 points and eight assists for Sacramento after missing two games for the birth of his son, named Reign. \n\n\r\n              “It’s huge to have somebody like that out and it’s good to have him back,” Monk said. \n\n\r\n              Jalen Green had 27 points for the Rockets, who dropped their third straight. \n\n\r\n              An angry Stephen Silas lamented his team's defensive play.\n\n\r\n              “They’re not giving the effort on the defensive end,” the Houston coach said. “They’re not getting after it like they’re supposed to.” \n\n\r\n              The Kings led by 12 with about eight minutes remaining before using a 10-2 run to push it to 117-97 midway through the fourth quarter. Monk started that stretch with two free throws and ended it with back-to-back 3s. \n\n\r\n              Eric Gordon made a basket for Houston after that, but Monk hit another 3 to make it 120-99. \n\n\r\n              The Kings were up by 12 after a layup by Kevin Huerter with 8 1/2 minutes left in the third quarter. Houston then used a 14-7 run to get within 81-76 midway through the period. \n\n\r\n              Gordon hit two 3-pointers in that span and Jabari Smith Jr. had a 3 and a dunk to help the Rockets close the gap. \n\n\r\n              But Murray made consecutive 3-pointers to start a 9-4 run, capped by a third 3 from him, to push the lead to 90-80 with 3 1/2 minutes left in the third. \n\n\r\n              A layup by Green got Houston within six with less than a minute left in the third but the Kings scored the last five points of the quarter, with a 3 from Monk, to take a 99-88 lead into the fourth. \n\n\r\n              TIP-INS\n\n\r\n              Kings: Kevin Huerter had 16 points. Trey Lyles added 14 off the bench. ... Sacramento shot 58.4% from the field. \n\n\r\n              Rockets: Kevin Porter Jr. missed his 13th consecutive game with a left big toe injury. Silas said Porter is struggling with the injury and it's unclear when he’ll return. … Kenyon Martin Jr. had 18 points and eight rebounds. Gordon scored 16. ... Alperen Sengun had 15 points, seven rebounds and seven assists. \n\n\r\n              THINKING OF HOME\n\n\r\n              Sengun, who is from Turkey, said it was tough to concentrate on the game after a 7.8 magnitude earthquake killed more than 4,000 people in Turkey and Syria on Monday. \n\n\r\n              He said his family lives far from where the earthquake hit and they were OK, but he worried about many others in the country. \n\n\r\n              “Of course I was thinking about all of my country today all day,” Sengun said. “But I know I have a job over here.” \n\n\r\n              UP NEXT\n\n\r\n              The teams meet again Wednesday night in Houston. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995299.005942
}