{
  "game_id": "0022300586",
  "espn_id": "401585214",
  "date": "Jan 19, 2024",
  "matchup": "DEN @ BOS",
  "headline": "Murray and Jokic help Nuggets hand Celtics their first loss at home this season, 102-100",
  "body": "BOSTON -- — The Denver Nuggets felt they let a winnable game slip away in the closing minutes during a narrow loss at Philadelphia earlier this week.\n\n\r\n              They found themselves in a similar situation late against one of the NBA's top teams and made sure not to let it happen again. \n\n\r\n              Jamal Murray scored 35 points, Nikola Jokic finished with 34 and Denver held on to hand the Boston Celtics their first home loss of the season, 102-100 on Friday night.\n\n\r\n              “Both teams were countering each other,” Murray said. “Both throwing haymakers and we were able to have the final punch.”\n\n\r\n              Jokic added 12 rebounds and nine assists to help the defending NBA champions end the Celtics' streak at 20 home victories. It was the first of two regular-season meetings between teams with sights on representing their respective conferences in the NBA Finals. They play again in Denver on March 7.\n\n\r\n              Jayson Tatum had a chance to tie it in the closing seconds, but he missed a one-legged fadeaway off the rim that was contested by Kentavious Caldwell-Pope. He finished with 22 points and eight rebounds. Derrick White had 24 points and Kristaps Porzingis added 21. \n\n\r\n              “I think I kind of rushed it, and that's on me,” Tatum said. “I had more time than I gave myself.”\n\n\r\n              Jokic, the two-time NBA MVP, feasted on a Celtics defense that opted not to double-team him for most of the game. He was efficient, connecting on 14 of 22 field attempts. It also didn’t stop him from finding his teammates, as he had nine of his assists in the first three quarters. Murray also played solid, going 15 of 22 from the field.\n\n\r\n              Nuggets coach Michael Malone said it was a needed effort against a Boston defense that entered ranked third in the league in defensive efficiency. \n\n\r\n              “They played for themselves and they played for other people,” Malone said. “It was high-level basketball from two All-Star players.”\n\n\r\n              It was even more impressive by Jokic, who was playing in the aftermath of the sudden death of Warriors assistant coach Dejan Milosevic on Wednesday. Milosevic coached Jokic in Serbia.\n\n\r\n              Murray said Jokic's response on the court while absorbing the emotions of Milosevic's passing have been “amazing.”\n\n\r\n              “The last couple of days, just been supporting him, comforting him, giving him a hug,” Nuggets coach Michael Malone said. “Nikola went out there and he honored Dejan's memory and his legacy, by playing at the level he played at. Not easy to do with a heavy heart. But Nikola is a special person.\"\n\n\r\n              The game was played with high energy throughout, featuring 13 lead changes and eight ties.\n\n\r\n              Denver erased a six-point halftime deficit with a 12-4 run to open the third quarter. Boston responded with a 9-0 run to retake the lead and carried an 82-81 lead into the fourth.\n\n\r\n              Murray hit five of his first six shots in the final period to put the Nuggets in front 95-91. Boston pushed back with a 7-0 run, capped by Brown’s driving layup.\n\n\r\n              Jokic scored coming out of a timeout. Following two empty Boston possessions, he put the Nuggets ahead again with a short hook in the lane. \n\n\r\n              Jokic missed an awkward stepback 3, but Michael Porter Jr. was there to put it back in. Tatum then got free for a driving dunk to cut Denver’s lead to 101-100.\n\n\r\n              A shot-clock violation gave the ball back to Boston with just over a minute to play. \n\n\r\n              White misfired on a 3 and Porzingis was called for a foul on the rebound, but Aaron Gordon missed his corner 3-point attempt on the other end. Tatum rebounded, drove the length of the floor and got up a layup that rolled off the rim.\n\n\r\n              Gordon was fouled and hit his first free throw. A double lane violation was called on his missed second attempt, resulting in a jump ball with 17.1 seconds left. \n\n\r\n              Boston won the tip and got it to Tatum, who was trapped. But he was able to call a timeout with 13.4 seconds remaining. \n\n\r\n              The Celtics nearly lost the ball when play resumed before taking another timeout with 4.9 left to set up their final shot. \n\n\r\n              Boston took a 61-55 edge into the half after a fast-paced opening 24 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Visit the Washington Wizards on Sunday.\n\n\r\n              Celtics: Open a three-game road trip Sunday at Houston.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996757.922882
}