{
  "game_id": "401810041",
  "espn_id": "401810041",
  "date": "Nov 08, 2025",
  "matchup": "CLE vs CHI",
  "headline": "Mitchell makes go-ahead basket with 34 seconds left as Cavaliers rally to beat Bulls 128-122",
  "body": "CLEVELAND -- — Donovan Mitchell scored eight straight points in 65 seconds, including the go-ahead basket with 34 seconds remaining, and the Cleveland Cavaliers closed on a 12-0 run to beat the Chicago Bulls 128-122 on Saturday night.\n\n\r\n              Chicago built a 122-116 lead on two free throws by Tre Jones with 1:47 left before Mitchell caught fire, pouring in three successive buckets — including a three-point play. Mitchell scored 26 of his 29 points in the second half as the Cavaliers rallied from 19 down.\n\n\r\n              De’Andre Hunter had a season-high 29 points and Evan Mobley posted 24 points and eight rebounds for Cleveland, which has won four straight. Mitchell also had six rebounds and six assists.\n\n\r\n              Isaac Okoro scored 19 points and Jalen Smith had 18 points and 11 rebounds in 19 minutes off the bench for the Bulls. Jones added 17 points and Josh Giddey provided 15 points, nine rebounds and six assists.\n\n\r\n              Chicago has lost three of four since opening the season with five consecutive wins.\n\n\r\n              Giddey's slam pushed the Bulls' advantage to 72-53 late in the second quarter after they trailed by nine in the opening period. Mitchell missed nine of his 10 shots in the first half.\n\n\r\n              The Bulls had seized command with a 25-5 run, fueled by eight points from Smith. They started 7 of 9 beyond the arc and made their first 13 free throws.\n\n\r\n              Cleveland played without point guard Darius Garland, who returned from offseason surgery on his left big toe Nov. 5 but is being held out of playing on back-to-back nights.\n\n\r\n              The start of the second half was delayed six minutes while the rim in front of the visiting bench was checked to make sure it was level.\n\n\r\n              Up next\r\n              Bulls: Host the San Antonio Spurs on Monday.\n\n\r\n              Cavaliers: Visit the Miami Heat for two consecutive games, beginning Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042585.359126
}