{
  "game_id": "0022301012",
  "espn_id": "401585640",
  "date": "Mar 22, 2024",
  "matchup": "TOR vs. OKC",
  "headline": "Gilgeous-Alexander scores 23 as Thunder win 4th straight, hand Raptors 9th consecutive loss",
  "body": "TORONTO -- — Shai Gilgeous-Alexander scored 23 points in his only regular-season trip to his homeland, Chet Holmgren had 18 points and 10 rebounds, and the Oklahoma City Thunder pulled away late to beat the short-handed Toronto Raptors 123-103 on Friday night.\n\n\r\n              “We did enough to win,” Gilgeous-Alexander said. “We weren’t the best version of ourselves tonight. We’re going to look in the mirror and try to figure out how we can do that more often.”\n\n\r\n              Jalen Williams scored 20 points and Kenrich Williams and Cason Wallace each had 12 as the Western Conference-leading Thunder won their fourth straight and extended Toronto’s season-worst losing streak to nine.\n\n\r\n              Canada native Gilgeous-Alexander led the Thunder with eight assists and also had seven rebounds. Josh Giddey and Lu Dort scored 10 points apiece as Oklahoma City improved to 21-13 on the road.\n\n\r\n              The NBA’s second-leading scorer behind Dallas' Luka Doncic, Gilgeous-Alexander said he enjoys playing close to his home of Hamilton, Ontario, about 40 miles (64 kilometers) from Toronto.\n\n\r\n              “It’s always fun,” he said. “I grew up coming to games here, watching Chris Bosh and a bunch of NBA legends play in this building. It’s always a surreal moment, and to have my friends and family in the crowd is even more special.”\n\n\r\n              The Raptors were led by rookie Gradey Dick with 21 points, one shy of his career-best, and Kelly Olynyk with 16.\n\n\r\n              Before the game, Toronto guard Gary Trent Jr. was ruled out because of a sore lower back. That left the Raptors without seven players, including all five regular starters.\n\n\r\n              Toronto’s list of absentees also included guard Immanuel Quickley (personal reasons), All-Star forward Scottie Barnes (left hand), center Jakob Poeltl (left pinkie), forward RJ Barrett (personal), forward Chris Boucher (right knee) and guard DJ Carton (right ankle).\n\n\r\n              Still, Holmgren said the Thunder knew better than to overlook Toronto’s makeshift lineup.\n\n\r\n              “It’s an NBA game with NBA players,” Holmgren said. “They’re out there for a reason. They have all the motivation in the world to go out there and do what they do. We knew they were going to bring it tonight, so we had to do the same.”\n\n\r\n              Center Jontay Porter returned for the Raptors after leaving Wednesday’s loss to Sacramento because of an illness.\n\n\r\n              The Raptors made a season-worst 27 turnovers. Oklahoma City scored 37 points off those miscues, the most Toronto has allowed in any game this season. \n\n\r\n              “It’s really hard to play when you constantly are having a disadvantage in transition,” Raptors coach Darko Rajakovic said.\n\n\r\n              The Thunder finished with 17 steals, the third-most by any NBA team this season.\n\n\r\n              Dick scored 13 points in the first, his highest total in a single quarter, as Toronto led 35-28 after one. \n\n\r\n              Oklahoma City opened the second with a 15-2 run, taking a 45-37 lead on Giddey’s 3-pointer with 9:08 left in the half. \n\n\r\n              “The group to start the second quarter really amped the game up physically,” Thunder coach Mark Daigneault said. “On the defensive end, we strung together a lot of stops at the beginning of that period to get ourselves a lead, get ourselves out on the break.”\n\n\r\n              The Thunder were up 63-56 at halftime and took an 89-78 lead to the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Visit the Milwaukee Bucks on Sunday night.\n\n\r\n              Raptors: Visit the Washington Wizards on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996188.843471
}