{
  "game_id": "0021800384",
  "espn_id": "401071065",
  "date": "Dec 08, 2018",
  "matchup": "MEM vs. LAL",
  "headline": "LeBron, Kuzma lead Lakers to easy win over Grizzlies",
  "body": "MEMPHIS, Tenn. --  LeBron James and the Los Angeles Lakers weren't about to let fatigue get the better of them on the second night of a back-to-back.\n\nThe Lakers recovered from a loss Friday night in San Antonio to dominate Memphis, defeating the Grizzlies 111-88 on Saturday, led by 20 points each from James and Kyle Kuzma. James added nine assists and eight rebounds, while Kuzma had nine rebounds, six assists and a couple of blocks.\n\n\"At the end of the day, we're professionals. We come out, our job is to bring energy regardless of playing back-to-backs or 40 minutes or whatever,\" said Kuzma, who was among four Lakers starters who played at least 36 minutes in the 133-120 loss to the Spurs.\n\n\"You forget about (the loss) and move on,\" James said, adding, \"You can't let that harp on us, even though we played three great quarters (against San Antonio). You have to get ready, and that's what we did.\"\n\nKentavious Caldwell-Pope and Josh Hart added 16 points apiece, while JaVale McGee finished with 10 points and 10 rebounds.\n\nWayne Selden led Memphis with 17 points. Mike Conley added 12 points while struggling from the field, shooting 4 of 12 on the night, as Memphis shot 41 percent overall.\n\nMemphis was coming off a win over the Pelicans in New Orleans on Friday.\n\n\"We just didn't have it,\" Memphis coach J.B. Bickerstaff said. \"Early on, we got a little demoralized because we got some open looks, especially in that first quarter. ... From that point forward, we just couldn't dig out of that hole.\"\n\nBy halftime, the Lakers led 63-40 and were holding Memphis to 43 percent shooting and 26 percent from beyond the arc. Los Angeles' dominance was particularly evident on the boards where it had a 36-11 advantage. Not only did the Lakers have more offensive rebounds (14) than Memphis' total, Tyson Chandler was one shy of matching the Grizzlies with 10 of his own in the half.\n\nLos Angeles expanded the lead to 29 in the third quarter. By the midway point of the fourth, Bickerstaff emptied the bench.\n\nLike the Lakers, Memphis players said they simply have to forget about the lopsided loss.\n\n\"We've got to bounce back,\" reserve forward JaMychal Green said. \"We can't play like this ever again this season. We had enough of those games last season\" when Memphis finished 22-60.\n\nTIP-INS\n\nLakers: F Brandon Ingram missed his second game with a sprained left ankle. ... Tyson Chandler finished with 14 rebounds. ... The Lakers out-rebounded Memphis 57-36. The Lakers' 19 offensive rebounds were a season high for a Memphis opponent. That led to 20 second-chance points.\n\nGrizzlies: Marc Gasol and Jaren Jackson Jr. finished with 11 points each. ... The 88 points was just over Memphis' season low of 83 on opening night against Indiana. ... D.J. Stephens, a two-way player, scored his first points of the season on a dunk in the fourth quarter. ... Selden's 17 points marked the first time he has led the team in scoring this season.\n\nTIME ADJUSTMENT\n\nBecause the Lakers' starters played extended minutes against San Antonio and the team arrived in Memphis in the middle of the night, coach Luke Walton said before the game he was considering a variety of rotations to conserve his team's energy. In the end, James played almost 32 minutes, Kuzma played 34 and Hart played just less than 36 minutes.\n\nUP NEXT\n\nLakers: Host the Miami Heat on Monday.\n\nGrizzlies: Face the Nuggets in Denver on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994938.638447
}