{
  "game_id": "0021801216",
  "espn_id": "401071889",
  "date": "Apr 09, 2019",
  "matchup": "PHX @ DAL",
  "headline": "Nowitzki stars in likely home finale, Mavs top Suns 120-109",
  "body": "DALLAS --  Dirk Nowitzki scored a season-high 30 points and then announced his retirement in the 40-year-old's final home game, a 120-109 victory for the Dallas Mavericks over the Phoenix Suns on Tuesday night.\n\nNowitzki told the crowd, \"As you might expect, this is my last home game.\" That was after speeches from Larry Bird and others he idolized growing up in Germany.\n\nThe 14-time All-Star took the first eight Dallas shots and scored his team's first 10 points in the first three minutes. He passed his previous season high of 21 on a 3-pointer early in the third quarter.\n\nDallas' season finale, and the career-ender for Nowitzki, is Wednesday night in San Antonio. Coach Rick Carlisle said the plan is to play Nowitzki, who spent a record 21 seasons with the same franchise. Kobe Bryant, who retired three years ago, played 20 seasons with the Lakers.\n\nJamal Crawford scored 51 points, one off his career high, in the season finale for the Suns (19-63). Phoenix had by far the worst record in the Western Conference in its fourth straight season with at least 58 losses.\n\n\"I've always said whenever somebody scores a lot of points like that, it's never just that player,\" said Crawford, who had his fourth 50-point game and first since Dec. 20, 2008 at Charlotte. \"I'm sorry we didn't get the win, but obviously it was Dirk's night tonight, so you don't feel all the way bad.\"\n\nPhoenix trailed by 30 at halftime (68-38) but got within four in the fourth quarter before back-to-back 3-pointers from Luka Doncic and Justin Jackson pushed the lead back to 10.\n\nNowitzki kept shooting on his busiest night of the season, finishing with highs of 31 shots (making 11) and 33 minutes. He was 5 of 14 from 3-point range with eight rebounds. His final basket at home was his signature one-legged fadeaway from just above the free throw line in the final two minutes.\n\nThe highest-scoring foreign-born player in NBA history also tied his season high in assists with three, capped by passing out of a jump shot with the crowd anticipating another bucket and getting Jackson an easy layup.\n\nA sellout crowd followed owner Mark Cuban's order of filling the arena early, and cheered from the first possible moment for the player who guided the Mavericks to their only championship eight years ago.\n\nFans stood during warmups, recording him in the layup line on their phones. The 7-footer obliged with a dunk. Then he had another dunk in the game -- his second of the season -- in the second half.\n\nThe wide smile as he ran down the floor was quite a contrast to the break between the first and second quarters. Nowitzki fought back tears near midcourt with the game about to restart after a tribute video detailing one of his holiday visits to a children's hospital.\n\nDoncic, the rookie sensation and the heir apparent to Nowitzki, had his eighth triple-double with 21 points, 16 rebounds and 11 assists. The 20-year-old is one triple-double shy of Jason Kidd's franchise record from 1995-96.\n\nTIP-INS\n\nSuns: Crawford was 13 of 16 in the second half and 18 of 30 for the game, including 7 of 13 from 3-point range. ... Dragan Bender had 12 points and 11 rebounds. ... Josh Jackson scored 17.\n\nMavericks: Devin Harris, who has played more than half his 14 seasons with Nowitzki, scored 14 points. ... Dorian Finney-Smith scored 15. ... Nowitzki had his first game with at least 30 points since scoring 40 in overtime against Portland on March 20, 2016.\n\nUP NEXT\n\nSuns: Await the NBA draft lottery.\n\nMavericks: At San Antonio on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995113.339946
}