{
  "game_id": "0021601101",
  "espn_id": "400900496",
  "date": "Mar 27, 2017",
  "matchup": "MEM @ SAC",
  "headline": "Collison leads Kings to 91-90 win over slumping Grizzlies",
  "body": "SACRAMENTO, Calif. -- This was no feel-good road trip for the Memphis Grizzlies, who had another loss to contemplate on a long flight home.\nDarren Collison scored 23 points and made two crucial free throws in the closing seconds to help the Sacramento Kings hand the slumping Grizzlies their fourth consecutive defeat, 91-90 on Monday night.\nA veteran team hoping to play well down the stretch in preparation for the playoffs, the Grizzlies are struggling instead. They sit seventh in the Western Conference, 2 1/2 games behind sixth-place Oklahoma City, which roared back late to defeat Dallas on Monday.\nThe Grizzlies have lost nine of 13 overall and have eight games left in the regular season.\n\"We're frustrated, obviously. Each game (on the road trip) has been different. We've had good and bad games, even in the losses,\" Mike Conley said. \"Tonight we felt like we should have won. We really needed it.\"\nThe Grizzlies played without leading rebounder and second-leading scorer Marc Gasol, who missed his second consecutive game with a strained left foot. He's missed just five games this season after playing only 52 a year ago due to a broken right foot.\nThe victory was the second straight for the Kings, both over playoff-bound teams. Sacramento rallied from an 18-point deficit in the final five minutes to defeat the Los Angeles Clippers on Sunday.\n\"This was a game they needed. I know it's tough without Marc, but this was maybe our last stand for the year as far as you're not going to see all our veterans play together for the rest of the season,\" said Kings coach Dave Joerger, who spent the previous three seasons as Memphis' head coach. \"We just tried to wear them down and try to be the young, energetic team. We got two wins against two really good playoff teams.\"\nConley had 22 points and nine assists for the Grizzlies. Zach Randolph added 17 points and 15 rebounds, and Brandon Wright scored 11.\nRandolph hit two free throws with 32.9 seconds left, giving the Grizzlies a 90-89 lead. But then Collison made both free throws to put the Kings up by one with 5.7 seconds left. Randolph missed an open 3-pointer with a second left that would have won it for Memphis.\n\"The look was good. It was just a little too hard,\" Randolph said.\nBuddy Hield had 14 points for the Kings, and Willie Cauley-Stein contributed 12 points and nine rebounds. Kosta Koufos fouled out late in the game and had 11 points.\nThe Kings are 5-12 since trading DeMarcus Cousins at the All-Star break.\n\"It's always good when you win and the spirits are high in here. Losing gets old,\" Cauley-Stein said. \"So even for the old guys, the veterans, to get that win is special. We're really locked in on defense and we're starting to trust each other. It's starting to show and it's only going to get better.\"\nThe Grizzlies went cold in the third quarter, missing 17 of 24 shots and getting outscored 23-19. They trailed 74-68 entering the fourth.\nCAN MEMPHIS TURN IT AROUND?\nMemphis has a favorable schedule in its final eight games. The Grizzlies have six home games, including the final four to conclude the regular season. Five of the games are against teams with losing records. But coach Dave Fizdale is frustrated, just like his players.\n\"The whole trip was a real disaster mentally for us,\" he said. \"It's really frustrating for me right now as a coach because it's not anything effort-wise. The last three games I thought we really competed our tail off.\"\nTIP-INS\nGrizzlies: A veteran of 18 seasons, Vince Carter got a rare start. He had seven points in 28 minutes. ... Filling in for Gasol, Randolph made his fifth start of the season.\nKings: The organization issued a statement regarding rumors earlier in the day about hiring Sam Hinkie as general manager. \"It's not true. Somebody is trying to create something. Everything is fine here,\" Kings owner Vivek Ranadive said during halftime.\" ... Arron Afflalo was not with the team for personal reasons. Tyreke Evans was given a rest and didn't play.\nUP NEXT\nGrizzlies: Host the Indiana Pacers on Wednesday, a team fighting for a playoff spot in the Eastern Conference.\nKings: Another challenging home game Wednesday against playoff-bound Utah.",
  "source": "espn_api",
  "crawled_at": 1764995564.452356
}