{
  "game_id": "0022200856",
  "espn_id": "401469011",
  "date": "Feb 12, 2023",
  "matchup": "TOR vs. DET",
  "headline": "VanVleet tops 30 for 9th time, Raptors beat Pistons 119-118",
  "body": "TORONTO -- — Fred VanVleet scored 35 points, topping 30 for a career-best ninth time this season, and Pascal Siakam added 28 points as the Toronto Raptors beat the Detroit Pistons 119-118 Sunday for their fourth win in five games.\n\n\r\n              Scottie Barnes scored 20 points and Precious Achiuwa had 11 points and 11 rebounds as Toronto won its second straight win over Detroit after losing the previous six meetings.\n\n\r\n              VanVleet and the Raptors bounced back after blowing a 12-point lead in the final five minutes of Friday’s home loss to Utah.\n\n\r\n              “That hurt,” VanVleet. “Everyone was frustrated for sure, but the game goes on. We’ve got to stay focussed on the games in front of us and pile them up as best as we can.”\n\n\r\n              Toronto is 20-7 all-time when VanVleet scores 30 or more points. Siakam has scored 25 or more in three straight games.\n\n\r\n              “It’s certainly a treat to have two guys out there who you can coach the team through,” said Toronto assistant coach Adrian Griffin, who led the Raptors Sunday with head coach Nick Nurse away for personal reasons.\n\n\r\n              Detroit’s Dwane Casey worked with both Siakam and VanVleet when he was head coach in Toronto.\n\n\r\n              “They were the difference in the game,” Casey said of Toronto’s duo. “They carried the team, they did a great job.”\n\n\r\n              Bojan Bogdanovic scored 33 points, Alec Burks had 21, and Hamidou Diallo and Jaden Ivey each had 18 for the Pistons. Detroit failed once again to win consecutive games for the second time this season.\n\n\r\n              Detroit beat San Antonio in double overtime Friday in a matchup of two of the NBA’s worst teams. The Pistons haven’t won back-to-back games since victories at Denver and Utah on Nov. 22 and 23, following all 10 wins since with defeats.\n\n\r\n              Ivey’s 3-pointer with 10.1 seconds left in the fourth quarter cut it to 116-113 before VanVleet answered with a pair of free throws.\n\n\r\n              Bogdanovic hit two free throws, but Achiuwa made one of two at the line to put Toronto up by four points with 4.4 seconds left. Ivey’s 3 at the buzzer wasn’t enough for Detroit.\n\n\r\n              Pistons center Jalen Duren injured his right ankle in the second quarter, but returned to start the second half. The rookie teenager scored a career-high 30 points Friday. The 19-year-old Duren finished with six points in 21 minutes.\n\n\r\n              “He turned it pretty good,” Casey said. “Just trying to go up and down the floor and when they were attacking the rim, he just couldn’t pivot and move. Hopefully it’s not something that’s long lasting.”\n\n\r\n              Toronto scored 14 points off 18 Detroit turnovers. The Raptors allowed a season-low five points off their eight turnovers.\n\n\r\n              “We’ve just got to be smarter with the ball, stronger with the ball,” Casey said. “A lot of our turnovers were self-inflicted, throwing it to nobody, throwing it to air.”\n\n\r\n              Raptors center Jakob Poeltl started for the first time in two games since rejoining the team that drafted him. He took the spot of guard Gary Trent Jr., who sat because of a sore left calf.\n\n\r\n              Toronto held a 53-52 edge at halftime and took an 85-77 lead to the fourth.\n\n\r\n              HAYES STRUGGLES AGAIN\n\n\r\n              Detroit’s Killian Hayes shot 1 for 10 and scored two points. He shot 1 for 11 Friday.\n\n\r\n              “He’s pressing a little bit,” Casey said. “I told him ‘Relax, have fun, play basketball.’ He’s overthinking things with his shooting.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Stewart scored 16 points.. … Outscored Toronto 43-19 in bench points. … Detroit is 7-22 on the road, the worst mark in the Eastern Conference.\n\n\r\n              Raptors: VanVleet had eight 30-point games in 2021-22. He has five such games since Jan. 1. … Poeltl fouled out in the fourth. He finished with six points and five rebounds in 25 minutes. … F O.G. Anunoby (sprained left wrist) missed his eighth straight game…. Toronto signed G/F Joe Wieskamp to a multi-year contract Saturday.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Visit Boston on Wednesday.\n\n\r\n              Raptors: Host Orlando on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994037.395156
}