{
  "game_id": "0022300394",
  "espn_id": "401585022",
  "date": "Dec 23, 2023",
  "matchup": "DET @ BKN",
  "headline": "Pistons match NBA single-season record with 26th straight loss, fall 126-115 to the Nets",
  "body": "NEW YORK -- — Pistons players sat in stunned silence, staring blankly ahead in their locker room after yet another loss.\n\n\r\n              The worst stretch of basketball in their lives now ranks as one of the worst in NBA history.\n\n\r\n              Detroit matched the league record for the longest losing streak in a single season, falling 126-115 to the Brooklyn Nets on Saturday night for its 26th straight loss. \n\n\r\n              “None of us went through this, ever,\" center Isaiah Stewart said. “This is the hardest thing probably all of us went through, especially being in the pros.” \n\n\r\n              The Pistons joined the 2010-11 Cleveland Cavaliers and 2013-14 Philadelphia 76ers, dropping to 2-27 in their first season under Monty Williams. They were in the game in the second half before the Nets put them away with a 15-0 run to open a 21-point lead and ensure that Detroit would remain winless since Oct. 28.\n\n\r\n              The teams will meet again Tuesday night in Detroit, with the Pistons nearing the overall longest skid in league history. The 76ers lost 28 consecutive games from late in the 2014-15 season through early 2015-16.\n\n\r\n              “Everybody wants to win, everybody hates losing, so it’s hard,” guard Cade Cunningham said. “We’ve got to be realistic as well. Can’t just keep saying the same things over and over, like we’ll get the next one. There has to be like a plan of action, so we’re just trying to figure that out.”\n\n\r\n              Mikal Bridges had 29 points, seven assists and six rebounds for the Nets, who put seven players in double figures and snapped their five-game losing streak. Cam Thomas scored 20 points.\n\n\r\n              The Nets shot 52% from the field, showing plenty of energy in their second night of back-to-back games after losing to the NBA champion Denver Nuggets on Friday. They got some easy baskets thanks to the Pistons, whose 14 turnovers led to 22 points. \n\n\r\n              Williams said he didn't feel like their bad play was leading to bad luck for the Pistons.\n\n\r\n              “We had a lot of tough breaks this year, but I try not to look at life that way. It just happens,\" he said. “When you turn it over 14 times you don’t expect 22 points, but it happens. Those live turnovers, they’re basketball death for possessions and we’ve had a lot of those this year.”\n\n\r\n              The Pistons were within two midway through the third quarter before a quick seven straight points by the Nets pushed the lead back to nine. It was still just 88-82 with under three minutes remaining, but Royce O'Neale made a 3-pointer and Day'Ron Sharpe followed with consecutive baskets to trigger a 10-0 finish to the period that made it 98-82.\n\n\r\n              Thomas scored the first five of the fourth quarter to make it 103-82, giving the Nets their largest lead. \n\n\r\n              Jaden Ivey scored 23 points for the Pistons, who started 2-1 in their first season under Williams before their free fall toward infamy. Cunningham finished with 22 points after being limited to just 11 minutes in the first half after picking up three fouls. \n\n\r\n              Williams, the NBA Coach of the Year in Phoenix in 2021-22, said he was the one to blame before the game. But the bigger problem might be a roster whose average age is slightly under 25 years old, making the Pistons one of the youngest teams in the league. \n\n\r\n              They foul too much (most in the league with 22.8 per game) and turn it over too often (29th, with 16.6 per game) and just haven't been able to overcome the combination of errors. \n\n\r\n              Nets forward Cam Johnson, who along with Bridges played for Williams in Phoenix, believes his former coach can build a contender with his new team.\n\n\r\n              “I told them, some of the young guys on the team after the game, that sometimes you got to lose before you can win, sometimes you got to fall before you crawl, walk before you can run,” Johnson said. \n\n\r\n              Detroit started with a couple nice possessions in jumping to a 6-0 lead but then got careless, turning it over six times in the first quarter. The Nets cashed those in for 11 points, which was the margin when the quarter ended with Brooklyn ahead 32-21.\n\n\r\n              The Pistons played better in the second quarter but could only cut two points off the deficit, trailing 65-56 at the break.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995778.960503
}