{
  "game_id": "0022400100",
  "espn_id": "401704666",
  "date": "Oct 27, 2024",
  "matchup": "OKC vs. ATL",
  "headline": "Gilgeous-Alexander's 35 points help Thunder pull away for 128-104 win over Hawks",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had 35 points, 11 rebounds and nine assists, and the Oklahoma City Thunder beat the Atlanta Hawks 128-104 on Sunday night in a matchup of teams that had won their first two games.\n\n\r\n              Gilgeous-Alexander fell just short of what would have been his third career triple-double.\n\n\r\n              Chet Holmgren had 25 points, nine rebounds and six blocks and Jalen Williams added 20 points and nine rebounds for the Thunder. \n\n\r\n              Oklahoma City outscored Atlanta 39-18 in the fourth quarter. The Thunder made 14 of 23 field goals in the final period while Atlanta made 6 of 20.\n\n\r\n              Trae Young had 24 points and eight assists for the Hawks. He only attempted 14 shots while being harassed by Oklahoma City’s guards. He had at least 30 points and 10 assists in each of his first two games.\n\n\r\n              Zaccharie Risacher, the French forward who was the No. 1 overall pick in the 2024 draft, had 13 points and six rebounds in 27 minutes for Atlanta\n\n\r\n              Takeaw\r\n              ays\r\n              Hawks: Young's teammates couldn't get going either. Atlanta's No. 2 scorer behind Young was Garrison Mathews with 14 points.\n\n\r\n              Thunder: Oklahoma City never lost confidence. The Thunder trailed 58-50 with 55 seconds left in the first half before scoring the final seven points of the second quarter, including a putback by Williams at the buzzer to trim the deficit to 58-57 at the break. \n\n\r\n              Key moment\r\n              Atlanta led 92-91 in the fourth quarter before Oklahoma City went on a 13-0 run, including six points from Gilgeous-Alexander. The Thunder held the Hawks scoreless for more than three minutes during that stretch to take control for good.\n\n\r\n              Key stat\r\n              Oklahoma City was 28 for 49 inside the 3-point line. Once the Thunder established themselves attacking the basket, they started knocking down 3s.\n\n\r\n              Up next\r\n              The Hawks host Washington on Monday and the Thunder host San Antonio on Wednesday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997693.977294
}