{
  "game_id": "0022000438",
  "espn_id": "401267598",
  "date": "Feb 17, 2021",
  "matchup": "ATL @ BOS",
  "headline": "Young scores 40, Hawks end skid, slip by Celtics 122-114",
  "body": "BOSTON -- — Hawks associate head coach Nate McMillan described his team as being “emotionally drunk” at times in close games this season. \n\n\r\n                    They followed the lead of their best player to earn a much-needed victory. \n\n\r\n                    Trae Young had 40 points and eight assists, and Atlanta snapped a four-game losing streak with a 122-114 victory over the Boston Celtics on Wednesday night. \n\n\r\n                    Clint Capela finished with 24 points and 13 rebounds to help the Hawks earn their first victory over Boston since April 8, 2018, ending a seven-game losing streak. John Collins added 20 points and six rebounds. \n\n\r\n                    “I just think I kind of found a rhythm throughout the whole game and just playing aggressive,\" Young said. \"When you have that aggressive mentality, open shots — you just kind of find them on your own.” \n\n\r\n                    The Hawks, who shot a season-high 57% from the field, took a 90-81 lead into the fourth quarter. Boston rallied to cut it to 94-91, but Atlanta responded with an 8-2 run get it back up to 102-93 with 6:33 left. \n\n\r\n                    The Celtics tried to employ an intentional foul strategy on Capela. But he was able to connect on three of his next seven free throw attempts, followed by Young's 3-pointer to make it 108-95. \n\n\r\n                    Boston made one final push, getting within 118-113 with 13 seconds left after Jayson Tatum was fouled on a 3-point attempt and made all three free throws. But Collins connected on four free throws the rest of the way to close it out. \n\n\r\n                    Hawks coach Lloyd Pierce missed the game to be with his wife, who was awaiting the birth of their second child in Atlanta. McMillan served as head coach in Pierce’s absence and announced after the game that the baby was born, though he said he hadn’t been informed of the gender. \n\n\r\n                    McMillan said he thinks Pierce would be pleased with how Young, who scored 16 points in the final 12 minutes, kept the team together as the Celtics tried to rally late. \n\n\r\n                    “(Young) has to show that growth of managing a game whether we’re up or down in the fourth quarter,\" McMillan said. \"I thought he did a good job of when we didn’t have anything, getting us organized down the stretch.” \n\n\r\n                    Tatum had 35 points for Celtics, who have lost five out of seven. Jaylen Brown added 22 points. \n\n\r\n                    “It’s tough going up and down,” Brown said. \"But I still think there’s a lot to learn, and we have learned a lot.”\n\n\r\n                    With Kemba Walker not playing in back-to-back games right now following a preseason procedure on his left knee, Javonte Green took his place in the starting lineup. \n\n\r\n                    But it was Tatum who took on the primary role of guarding Young at the outset. \n\n\r\n                    While it gave Young with a bigger defender to contend with, it didn’t stop him from facilitating action when Atlanta had the ball. The results were the same when others, including Green and Payton Pritchard switched onto him. \n\n\r\n                    Young ended the first half with 15 points and four assists, pacing an offense that shot 60% (24 of 40) from the field and scored 40 points in the paint to take a 62-56 lead into halftime. \n\n\r\n                    Boston wasn’t crisp at all offensively, turning it over 10 times. \n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Played without Bogdan Bogdanovic (right knee), Rajon Rondo (back). D’Andre Hunter (right knee surgery rehab) and Kris Dunn (right ankle surgery rehab). \n\n\r\n                    Celtics: Finished with 15 turnovers. … Walker (load management), Marcus Smart (left calf tear), Daniel Theis (sprained right index finger) and Romeo Langford (right wrist surgery rehab) all sat. \n\n\r\n                    ELITE COMPANY\n\n\r\n                    Young became the fifth player 22 years or younger in NBA history to record at least 15 career 40-point games, joining Rick Barry, LeBron James, Kevin Durant and Shaquille O’Neal. \n\n\r\n                    UP NEXT\n\n\r\n                    The teams will matchup again on Friday night. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997837.155524
}