{
  "game_id": "0022400387",
  "espn_id": "401704953",
  "date": "Dec 21, 2024",
  "matchup": "PHX vs. DET",
  "headline": "Cunningham has 28 points, 13 assists to lead the Pistons past the Suns 133-125",
  "body": "PHOENIX -- — Cade Cunningham scored 28 points and had 13 assists, Jalen Duren added 17 points and 11 rebounds and the Detroit Pistons beat the Phoenix Suns 133-125 on Saturday night.\n\n\r\n              The Pistons dominated the majority of the game and didn't trail after the first few minutes. The Suns cut their deficit to 122-119 with 2:26 left on a pair of free throws by Kevin Durant, but Malik Beasley responded with a corner 3 to thwart the comeback attempt.\n\n\r\n              Durant scored a season-high 43 points on 14-of-26 shooting and made all 11 of his free throws. Bradley Beal added 26, but the Suns couldn’t overcome 19 turnovers.\n\n\r\n              Seven Detroit players scored in double figures. Jaden Ivey had 20, Beasley added 18 and Tim Hardaway Jr. scored 16.\n\n\r\n              Detroit jumped out to a 41-26 lead by the end of the first quarter, scoring 16 points off of seven Phoenix turnovers. The Suns cut the margin to 64-59 by halftime.\n\n\r\n              The Suns played their first game of the season without four-time All-Star guard Devin Booker, who is out with left groin soreness.\n\n\r\n              Takeaways\r\n              Pistons: Detroit's aggressive defense caused the Suns problems all night. The rising Pistons have won three of their past five games.\n\n\r\n              Suns: They've lost 12 of their last 18 games after starting the season 8-1. Turnovers were the main culprit on Saturday. Booker's absence was certainly a factor, but there's no real excuse for being that sloppy.\n\n\r\n              Key moment\r\n              The Suns had a little hope in the final minute, but Cunningham hit a 3-pointer with 33.8 seconds left that pushed the Pistons' lead to seven.\n\n\r\n              Key stat\r\n              The Suns shot nearly 62% from the field over the first three quarters but still trailed 103-94, mostly because of turnovers and shoddy defense.\n\n\r\n              Up next\r\n              The Pistons are at the Los Angeles Lakers and the Suns are at the Denver Nuggets on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998238.901366
}