{
  "game_id": "0021801046",
  "espn_id": "401071719",
  "date": "Mar 17, 2019",
  "matchup": "ATL @ ORL",
  "headline": "Vucevic leads Magic over Hawks 101-91",
  "body": "ORLANDO, Fla. --  It might have been a little easier for the Orlando Magic on Sunday night if they could have made their shots.\n\nStill, they got by with a big start from Nikola Vucevic to take an early lead and, despite shooting just 38.8 percent, held on for a 101-91 win over the Atlanta Hawks.\n\n\"It's important, late in the season, if your defense can win games for you. That's what happened tonight,\" Vucevic said. \"You're going to have games not shooting well, but you find other ways to win. You can do it with defense.\"\n\nVucevic scored 17 of his 27 points in the first eight minutes of the game and added 20 rebounds. Aaron Gordon had 22 points and eight rebounds for the Magic, who remained a game behind Miami in the chase for the final Eastern Conference playoff spot.\n\nWes Iwundu helped Orlando with a career-high 14 points, seven rebounds and two big blocks.\n\nTrae Young led the Hawks with 20 points. Dewayne Dedmon had 10 points and 14 rebounds.\n\nThe Magic shot only 9 of 37 (24.3 percent) from 3-point range and the Hawks were even worse, going 8 for 35 (22.9 percent).\n\n\"We obviously didn't shoot the ball well, but we had good intensity. Our defense was very good tonight, and at this time of year that's critical,\" Magic coach Steve Clifford said. \"The free-throw game was so important tonight. If you look at numbers, that was the biggest stat in the game, the free-throw differential.\"\n\nThe Magic made 26 of 33 free throws to Atlanta's 7 of 10.\n\nVucevic scored Orlando's first 13 points and sparked an early nine-point Magic lead. When the Hawks called timeout with 6:51 left in the first quarter, Vucevic had made six of eight shots while the other nine starters in the game were 2 of 16 from the field.\n\nThe Hawks never overcame the early nine-point deficit, but were down by only five points with two minutes left when Terrence Ross came up with a steal and fed D.J. Augustin for a short jumper.\n\n\"I think that's the reason our record (24-47) is the way it is; it could easily be flipped,\" Young said. \"We dig ourselves in holes and at the end of the game we're still in the game. We find a way to crawl back, but it takes so much energy out of us, we don't (have) enough to finish it out.\"\n\nAfter averaging 123.1 points in their first 12 games after the All-Star break, the Hawks compiled their lowest scoring output since a 106-91 loss to the New York Knicks on Feb. 14.\n\nCARTER-WILLIAMS' MAGIC DEBUT\n\nThe Magic signed former lottery pick Michael Carter-Williams to a 10-day contract Friday and wasted no time getting him into a game. He scored five points, all from the foul line, in 16 minutes. \"I'm going to use him. That's why he was brought here,\" Clifford said. \"He's not going to play a lot of minutes, but he's in good enough shape.\" It is the sixth NBA stop for Carter-Williams, the 11th pick in the 2014 draft.\n\nTIP-INS\n\nHawks: F John Collins, coming off five straight games of 20-plus points and 10-plus rebounds, went to the bench with three fouls early in the second quarter and fouled out with 2:21 left in the game. ... The Hawks missed their first 11 3-point attempts.\n\nMagic: The Magic entered the game shooting 18.84 free throws per games, the fewest in the NBA. ... F Jonathan Isaac went scoreless in 26 minutes. ... The Magic are 3-0 against the Hawks this season and 57-58 all-time.\n\nUP NEXT\n\nHawks: Host Houston on Tuesday night.\n\nMagic: Host New Orleans on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995342.992204
}