{
  "game_id": "401810022",
  "espn_id": "401810022",
  "date": "Nov 04, 2025",
  "matchup": "CHI vs PHI",
  "headline": "Giddey has triple-double, Vucevic hits late 3 as Bulls rally from 24 down to beat Sixers 113-111",
  "body": "CHICAGO -- — Josh Giddey had a triple-double with 29 points, 15 rebounds and 12 assists, Nikola Vucevic made a 3-pointer with 3.2 seconds remaining and the Chicago Bulls came back from a 24-point deficit to beat the Philadelphia 76ers 113-111 on Tuesday night.\n\n\r\n              Philadelphia's Quentin Grimes missed a 3-pointer at the buzzer that would have won it.\n\n\r\n              Giddey is the first Bulls player to have back-to-back triple-doubles since Michael Jordan in 1989. He drove to the basket before hitting Vucevic with a pass for the corner 3 on the game's decisive possession.\n\n\r\n              Vucevic finished with 19 points and 10 rebounds. Isaac Okoro added 16. The Bulls held the Sixers to just 16 points in the fourth quarter.\n\n\r\n              The Sixers scored 45 points in the first to take an 18-point lead and stayed in front for the majority of the game. Tyrese Maxey scored 12 points on 4 of 6 shooting from 3-point range during the early offensive outburst.\n\n\r\n              The Bulls trailed by as many as 24 points late in the second quarter, but rallied to cut the deficit to 95-84 by the start of the fourth. Chicago continued chipping away, pulling within 111-110 on Giddey's basket with 1:19 left.\n\n\r\n              The two teams have been some of the best in the NBA during the season's opening weeks. Chicago improved to 6-1 while Philadelphia fell to 5-2. \n\n\r\n              Maxey led the 76ers with 39 points on 14 of 26 shooting, including 6 of 10 from 3-point range. Joel Embiid scored 20 and Kelly Oubre Jr. added 18. Rookie VJ Edgecombe had 12 points and 11 rebounds.\n\n\r\n              The popular halftime performer Red Panda made her NBA return at the game. The Chinese American — whose real name is Rong Niu — broke her wrist during a performance on July 1 and missed roughly four months.\n\n\r\n              Up next\r\n              76ers: At Cleveland on Wednesday.\n\n\r\n              Bulls: At Milwaukee on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042560.640496
}