{
  "game_id": "0021900575",
  "espn_id": "401161217",
  "date": "Jan 10, 2020",
  "matchup": "MIL @ SAC",
  "headline": "Bucks cruise past Kings on slow night from Antetokounmpo",
  "body": "SACRAMENTO, Calif. --  With Giannis Antetokounmpo’s sore back acting up again, the Milwaukee Bucks got plenty of help picking up the scoring slack.\n\nThat’s nothing new. The NBA’s best team is 9-2 when someone other than Antetokounmpo leads them in scoring, and the Bucks did it again to keep rolling on the road.\n\nKhris Middleton had 27 points and 11 rebounds, Eric Bledsoe scored 24 and Milwaukee beat the Sacramento Kings 127-106 on Friday despite an off night for Antetokounmpo.\n\n\"To have his back when he’s not playing well -- he has our back all the time,\" Bledsoe said. \"Damn near all 30-something games. Just to have his back this one time says a lot about this team.\"\n\nMilwaukee improved to an NBA-best 34-6 and extended the best start in franchise history.\n\nAntetokounmpo, who has been dealing with a cranky back for several weeks, was held to a season-low 13 points and 10 rebounds. The reigning MVP took only nine shots and picked up three of his four fouls in the first half.\n\nIt was the 11th time this season – and seventh in the past 11 games – that Antetokounmpo did not lead the Bucks in scoring.\n\nDonte DiVincenzo had a season-high 18 points and Sterling Brown added 11 points and 12 rebounds for Milwaukee, which is 16-4 on the road.\n\n“Those two guys (Bledsoe and Middleton) were phenomenal, and then some of the bench, Donte and some of those guys,” Bucks coach Mike Budenholzer said. “I think Giannis has a ton of faith, a ton of confidence in his teammates, but it’s good for those guys to come through on a night like tonight.”\n\nDe’Aaron Fox had 19 points, 10 assists and nine rebounds for Sacramento. Harrison Barnes scored 19 before limping off the court and into the locker room late in the fourth quarter.\n\n“I was proud of the guys fighting and taking the lead in the third quarter, but we are not going to beat a team that good when they shoot 30 free throws to our 10, we turn the ball over 16 times, and we go 10 for 35 from the 3,” Kings coach Luke Walton said. “To beat a team like the Bucks we have to be hot and disciplined for longer stretches.”\n\nMilwaukee trailed midway through the third, then took control with a 20-3 run over 3:32 while Antetokounmpo rested on the bench. Middleton had seven points and Brown and DiVincenzo both hit 3-pointers to help the Bucks go up 80-66.\n\nMilwaukee led by 18 early despite a slow start by Antetokounmpo. He took just four shots in the first half and was called for his third foul with 19 seconds remaining before halftime.\n\nAntetokounmpo also found himself in the middle of the lane when Sacramento’s Trevor Ariza sprinted in for a two-handed dunk that cut the Bucks' lead to 49-43.\n\nTIP-INS\n\nBucks: Antetokounmpo’s double-double was his 33rd of the season. ... Bledsoe made his first six shots. … Milwaukee has won seven straight against Sacramento.\n\nKings: Marvin Bagley III (left foot soreness) is on track to play Monday against Orlando. Bagley has missed eight games since getting hurt Dec. 26 against Minnesota. Richaun Holmes (right shoulder) and Bogdan Bogdanovic (ankle) also sat out. … Fox was whistled for a technical foul in the second quarter after being called for a charge. Fox protested and angrily bounced the ball on the court before being hit with the technical.\n\nBLEDSOE’S START\n\nBledsoe scored 11 points in the first quarter but probably wouldn’t have had that many had Budenholzer pulled him out as he intended. “We actually had a sub for him at the table for two or three of those minutes and he just kept getting to the basket, getting steals, making things happen,” the coach said. “When you’re on the road you want to establish something early and he was great.”\n\nUP NEXT\n\nBucks: Play the Trail Blazers in Portland on Saturday night. The Bucks led the entire game when the teams met earlier this season in Milwaukee.\n\nKings: Host the Magic on Monday. Sacramento has won its last five games against Orlando.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996147.689125
}