{
  "game_id": "0022301068",
  "espn_id": "401585696",
  "date": "Mar 29, 2024",
  "matchup": "MIA vs. POR",
  "headline": "Heat rout Trail Blazers 142-82 for largest margin of victory in team history",
  "body": "MIAMI -- — Bam Adebayo had 21 points, 11 rebounds and nine assists and the Miami Heat had the largest margin of victory in team history, routing the Portland Trail Blazers 142-82 on Friday night.\n\n\r\n              The Heat remained seventh in the East and extended the Trail Blazers’ losing skid to nine.\n\n\r\n              Thomas Bryant had a season-high 26 points, Terry Rozier added 22 and Haywood Highsmith finished with 20, the second time in club history that four players had 20 or more. The Heat were never threatened after a 21-4 run put them ahead 50-29 in the second quarter.\n\n\r\n              “To win big like this feels good for the group,” Rozier said. “We have to build off tonight.\"\n\n\r\n              The Heat broke the team margin record of 43 against the Los Angeles Clippers on Dec. 29, 1994, and also set a club record with 41 assists. They made 21 of 39 3-pointers, with Highsmith making 5 of 6 and Rozier 6 of 10. Adebayo also made two 3-pointers.\n\n\r\n              “This is a very complete game all around,” Highsmith said. “We were all dialed in and locked in.”\n\n\r\n              Miami set a team record for assists in any half with 24 in the first led 74-40 lead at the break. The Heart had 23 assists in a half in three previous games.\n\n\r\n              “There was professionalism from our part and energy and intentionality,” Heat coach Erik Spelstra said. “That’s really what we’re aiming for right now. It doesn’t guarantee you get the results that you want but you stack those minutes and possessions, quarters, games, you start to build those habits and it becomes more who you are.”\n\n\r\n              The lopsided margin allowed Spoelstra to rest Adebayo and star forward Jimmy Butler most of the second half. Butler returned after missing the 113-92 home loss to Golden State Tuesday because of an illness and finished with eight points.\n\n\r\n              The loss was the third largest in Trail Blazers’ history, topped by a 62-point rout against Oklahoma City on Jan. 11 and a 124-59 loss to Indiana on Feb. 27, 1998.\n\n\r\n              “Obviously, it was a very rough game for us,” Portland coach Chauncey Billups said. “It was unfortunate because I thought the first four or five minutes we played really clean. It didn’t last long. It happened pretty quick. Their defense –they got physical – and we couldn’t get to the paint. We started to settle and turn it over.”\n\n\r\n              Scoot Henderson scored 20 points for the Trail Blazers. Deandre Ayton returned after a four-game absence because of left elbow tendonitis and finished with 18 points. But Jerami Grant (right hamstring strain) and Anfernee Simmons (left knee tendinitis) remain sidelined.\n\n\r\n              The injury buildup forced Portland to start five rookies in the previous three games.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Orlando on Monday night.\n\n\r\n              Heat: At Washington on Sunday night.\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995329.550027
}