{
  "game_id": "0022400853",
  "espn_id": "401705419",
  "date": "Feb 28, 2025",
  "matchup": "BKN vs. POR",
  "headline": "Sharpe scores 25 and Trail Blazers win 4th straight, 121-102 over Nets",
  "body": "NEW YORK -- — Shaedon Sharpe scored 25 points, Dalano Banton had 14 of his 23 points in the fourth quarter, and the Portland Trail Blazers cruised to a 121-102 victory over the Brooklyn Nets on Friday night.\n\n\r\n              Toumani Camara had 19 points, Anfernee Simons chipped in 14, and Donovan Clingan finished with 12 for the Trail Blazers, who extended their winning streak to four games.\n\n\r\n              Cam Thomas scored 16 points in 21 minutes in his return to the Brooklyn lineup after missing 24 games due to a left hamstring strain.\n\n\r\n              Nic Claxton and Killian Hayes each had 16 points for the Nets, who have lost their last three games.\n\n\r\n              Portland led by 21 points in the early minutes of the third quarter before the Nets cut the lead to nine heading into the final period.\n\n\r\n              Thomas fed Claxton for an alley-oop dunk to make it 96-84 with 10:20 to play in the fourth quarter before the Trail Blazers put the game out of reach with a 13-4 run capped by seven straight points from Banton.\n\n\r\n              Takeaways\r\n              Trail Blazers: Seven players scored in double figures. Scoot Henderson had 12 points off the bench. Jabari Walker did not make the cut — he finished with five.\n\n\r\n              Nets: Brooklyn coach Jordi Fernandez kept mum about the amount of minutes that Thomas would play in his first game back since Jan. 2 at Milwaukee. “Excited to push him to whatever his body is now ready for,” Fernandez said.\n\n\r\n              Key Moment\r\n              Portland — playing its third game of a seven-game road trip — led 33-25 at the end of the first quarter and never looked back thanks to Sharpe, who scored 14 points on 6-for-6 shooting.\n\n\r\n              Key Stat\r\n              Portland lost the rebound battle, 45-36, but had 32 assists to Brooklyn’s 20.\n\n\r\n              Up Next\r\n              Brooklyn visits Detroit on Saturday night while Portland continues its road trip at Cleveland on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997973.738473
}