{
  "game_id": "0022100533",
  "espn_id": "401360352",
  "date": "Dec 31, 2021",
  "matchup": "ATL @ CLE",
  "headline": "Young scores 35, Hawks rally to beat Cavaliers 121-118",
  "body": "CLEVELAND -- — Trae Young scored 35 points, Clint Capela had 18 points and a season-high 23 rebounds, and the Atlanta Hawks rallied from a 16-point deficit for a 121-118 win over the Cleveland Cavaliers on Friday night.\n\n\r\n              Young made a pair of free throws with 7.6 seconds left after Cleveland had pulled within 119-118 on a Brandon Goodwin layup. Kevin Pangos’ potential tying 3-pointer at the buzzer was off the mark. \n\n\r\n              Atlanta snapped a three-game losing streak despite having 12 players in the NBA’s health and safety protocols, including power forward John Collins and sharp-shooters Bogdan Bogdanovic and Kevin Huerter. The Hawks also lost Cam Reddish in the first quarter with a sprained right ankle.\n\n\r\n              “There are only a couple of us from our full roster on this team, but we’re really trying to find ways to win,” Young said. “It was a great way to end the year. We had a lot of success in 2021 and we expect to have even more success in 2022.”\n\n\r\n              Kevin Love scored a season-high 35 points and grabbed 11 rebounds for Cleveland, and Jarrett Allen had 21 points and eight rebounds. The Cavaliers dropped their third straight game and had their longest home winning streak of the season end at five.\n\n\r\n              “We were complacent because we had a lead, but you have to understand they’ve got winners over there who just went to the Eastern Conference finals,” Cleveland coach J.B. Bickerstaff said. “We let our guard down and it came back to bite us.”\n\n\r\n              Young, who also dished out 11 assists, drained a 3-pointer with 1:53 remaining to give Atlanta its largest advantage at 119-111. Skylar Mays added 19 points and Lou Williams had 14 points off the bench for the Hawks, who are 1-1 on a six-game trip that ends Jan. 9 against the Los Angeles Clippers.\n\n\r\n              “Clint and Trae set the tone yesterday in practice and they did it again tonight,” Atlanta coach Nate McMillan said. “It was a challenge to them to show that we’re better than what we’ve been playing like.”\n\n\r\n              Cleveland led 60-44 late in the second quarter, buoyed by Allen coming out of COVID protocols after missing four games. Rookie Evan Mobley had 16 points, eight rebounds and five assists, and Goodwin had 13 points in his Cavaliers debut.\n\n\r\n              The Hawks roared back in the third, outscoring Cleveland 40-22 behind 12 points and seven assists from Young, and eight points and nine rebounds from Capela. Young put them ahead for good at 87-86 with a 3-pointer.\n\n\r\n              “These games are just grind games, so we knew we had to stay the course,” Capela said. “We had to expose their weaknesses by finding our guys, like Trae, for open shots.”\n\n\r\n              Cleveland went 8 of 14 from the foul line in the fourth, when Young and Williams combined to go 8 of 8 for Atlanta.\n\n\r\n              The Hawks committed a franchise-record low two turnovers, becoming the sixth team in NBA history to do so in a game. The league record is one by Denver against Portland on Feb. 23, 2021.\n\n\r\n              G League official Clare Aubry became the 14th woman to referee an NBA game, and was one of three officials to make their debut Friday as a result of widespread illnesses among full-time staffers.\n\n\r\n              HELP ON THE WAY\n\n\r\n              The Cavaliers have agreed to acquire four-time All-Star guard Rajon Rondo from the Lakers in exchange for Denzel Valentine, a person familiar with the negotiations told The Associated Press. Rondo averaged 3.1 points and 3.7 assists in 18 games with Los Angeles, but is currently in COVID-19 protocols.\n\n\r\n              Cavs guard Ricky Rubio suffered a torn left ACL at New Orleans on Tuesday, leaving Cleveland in need of a veteran playmaker. Guard Collin Sexton also is out for the season after tearing cartilage in his left knee on Nov. 7 at New York.\n\n\r\n              “Rondo has a championship pedigree from Boston, so having him around will be huge,” Love said. “A lot of us are still on an emotional hangover from losing Ricky.”\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Young leads the NBA with 17 point/assist double-doubles and 12 games of at least 25 points and 10 assists this season. ... McMillan has 704 career victories, three shy of tying John MacLeod for 18th place all-time. … Atlanta was scheduled to host Cleveland on Dec. 19, but the game was postponed because of the Hawks’ ongoing COVID-19 outbreak. … Atlanta has 26 players under contract.\n\n\r\n              Cavaliers: Goodwin signed a 10-day contract via a hardship exception and was the first player off the bench. He had six assists in 25 minutes. … F Justin Anderson and C Luke Kornet were not resigned after their 10-day contracts expired, while F Tre Scott was released from his pact with one day remaining. … Cleveland has played 234 games against the Hawks, its most against any opponent.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Visit Portland on Monday night.\n\n\r\n              Cavaliers: Host Indiana on Sunday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993803.143924
}