{
  "game_id": "0021500211",
  "espn_id": "400828098",
  "date": "Nov 24, 2015",
  "matchup": "MEM vs. DAL",
  "headline": "Balanced Grizzlies send Mavs to second straight loss",
  "body": "MEMPHIS, Tenn. -- The Memphis Grizzlies are undefeated in the six games Jeff Green has scored at least 10 points. On Tuesday night, Green had a lot of company in the double-digit category.\nMike Conley scored 21 points, Green added 19 and seven Memphis players finished in double figures in a 110-96 victory over the Dallas Mavericks.\n\"We have so many weapons. We have to utilize them any way we can,\" Green said. \"Sharing the ball and getting everybody involved is how you get it done.\"\n\nMarc Gasol had 15 points and 10 rebounds for Memphis, which won its fifth in the last six games. Matt Barnes and Mario Chalmers added 14 points apiece, and JaMychal Green contributed 13.\n\"The balance is there right now,\" Conley said. \"The ball's moving. It's touching a lot of guys' hands. Guys are making the easy play, not the highlight reel play.\"\nRaymond Felton and J.J. Barea each scored 16 points and tried to pull the Mavericks back into the game in the fourth quarter. Dirk Nowitzki finished with 14 points and Zaza Pachulia had 13, both also grabbing 10 rebounds.\nWesley Matthews had 11 points and Deron Williams finished with 10 as Dallas lost its second straight.\nMemphis capitalized on 19 Dallas turnovers and limited the Mavericks to 39 percent shooting. Nowitzki was just 5 of 15.\n\"We did a poor job of ball protection in the first half,\" Mavericks coach Rick Carlisle said. \"Twelve turnovers for a bunch of points. We did better in the second half, but we dug ourselves too big of a hole.\"\nThe Mavericks trailed by 25 after JaMychal Green connected on a 3-pointer to open the fourth quarter. But Barea worked to keep Dallas in the game, scoring six straight points.\nThat kick-started a 19-4 rally by the Mavericks, pulling Dallas within 10 points on a couple of occasions just past the midway point of the fourth. Felton, meanwhile, was en route to 14 points in the fourth, connecting on all four of his 3-pointers.\nThat still wasn't enough to cut the lead under 10.\nMemphis has played much better in recent weeks after a 3-6 start.\n\"We knew it would take some time,\" Jeff Green said. \"We've got a lot of new pieces from the offseason and from the trade (for Chalmers). We knew it would take some time to gel.\"\nTIP-INS:\nMavericks: Dallas entered the game averaging 13.4 turnovers a game. It had eight in the first quarter en route to 12 by halftime. ...The Mavericks' 36 points in the first half were a season low. ... Nowitzki, who leads the league in 3-point percentage at 53.3 percent, was 2 of 5 from outside the arc.\nGrizzlies: Memphis F Zach Randolph missed his third straight game with a sore right knee. Barnes started his first game of the season in Randolph's spot. ... Vince Carter entered the game in the first quarter, moving him past Steve Nash for 31st on the league's games played list with 1,218. ... Chalmers, who entered the game tied for third in the league shooting free throws at 93.8 percent, was 6 of 10 from the line.\nTURNING POINT\nMemphis already had a double-digit lead at halftime, but the Grizzlies opened the second half with a 10-2 run for a 56-38 lead. Memphis eventually would take the advantage to 82-60 by the end of the fourth. Dallas never got the deficit under 10 after halftime.\nHACKING TA: When the Memphis lead dwindled to 11 with under 5 minutes left, the Mavericks started fouling Tony Allen, a 50 percent free throw shooter. Allen made six of the eight free throws during the strategy, helping Memphis maintain its double-digit lead. \"I needed them to do it so I could get my percentage up,\" Allen said, adding: \"They can keep doing it. That 50 percent I was shooting is pretty deceiving. It was funny.\"\nUP NEXT\nMavericks: Visit San Antonio on Wednesday\nGrizzlies: Visit Houston on Wednesday",
  "source": "espn_api",
  "crawled_at": 1764994472.951382
}