{
  "game_id": "0022201001",
  "espn_id": "401469156",
  "date": "Mar 10, 2023",
  "matchup": "BKN @ MIN",
  "headline": "Bridges scores 34 points, Nets outlast Timberwolves in OT",
  "body": "MINNEAPOLIS -- — Mikal Bridges scored 34 points, fellow Brooklyn newcomer Spencer Dinwiddie came up with a final stop and the Nets outlasted the Minnesota Timberwolves 124-123 in overtime Friday night.\n\n\r\n              Dinwiddie blocked Mike Conley's 3-point attempt as time expired to give the Nets their fourth victory in five outings.\n\n\r\n              Bridges frequently quieted a raucous Target Center crowd, making 4 of 8 3-pointers and 13 of 24 overall shots. Acquired from Phoenix last month in the deal that sent Kevin Durant to the Suns, Bridges has scored 30 or more points in four of his past five games.\n\n\r\n              “I don’t think anybody knew that Mikal was was this amazing offensively, just being completely real,” Dinwiddie said. “It’s our job to make sure that he can get to his spots and get his shots and continue to shoot, stack up these thirties as much as he possibly can.”\n\n\r\n              Dinwiddie, acquired from Dallas in the Kyrie Irving trade, had 29 points and 11 assists. Cam Johnson — also part of the trade with Phoenix — recovered from taking a hit to the face to finish with 15 points and eight rebounds, and Royce O'Neale came off the bench and added 12 points and 15 rebounds.\n\n\r\n              “I think our biggest thing is just trying to win,” Bridges said. “If I score four or five, I'm not tripping. I just want to go out there and win.\"\n\n\r\n              The outcome spoiled 26 points from Minnesota big man Rudy Gobert — his most in a Wolves uniform since being acquired in the offseason. Anthony Edwards led Minnesota with 32 points, but missed several key shots down the stretch.\n\n\r\n              The Wolves shot close to 60% in the first half. Brooklyn adjusted, switching more frequently on pick-and-rolls to cause more disruption.\n\n\r\n              Minnesota finished 49% from the floor and made just 9 of 30 3-point attempts.\n\n\r\n              “We really wanted to spread the floor, and if they wanted to post Rudy up for the remainder of the game, we would find a solution for that,\" Nets coach Jacque Vaughn said. \"But we wanted space for our guys to score.”\n\n\r\n              Minnesota's Naz Reid sent it to overtime with a 3-pointer from the top of the key as regulation expired.\n\n\r\n              The Timberwolves have lost four in a row at home.\n\n\r\n              “Everybody had a moment,\" said Conley, who had 11 points, seven assists, six rebounds and two steals. \"We really felt like we played hard enough to win. We just had a couple plays where we had lapses.”\n\n\r\n              SLOWLY BUT SURELY?\n\n\r\n              Timberwolves star Karl-Anthony Towns missed his 47th straight game with a severely strained calf. He took a small but measurable step forward this week by taking part in some on-court drills with the team’s player development staff. Coach Chris Finch said Towns would likely need several more days of such action before he’s cleared for an actual practice with his teammates.\n\n\r\n              “He can feel like he’s got the bit in his teeth right now. He probably wants to do a little bit more than he’s actually allowed. That’s good,” Finch said.\n\n\r\n              RACING TOWARD THE PLAYOFFS\n\n\r\n              Brooklyn entered the night in sixth place in the Eastern Conference, 2 1/2 games ahead of Miami, which is currently in the first play-in spot. Minnesota finds itself in a similar battle to avoid the first play-in spot in the West, having entered Friday in a three-way tie with Golden State and Dallas for sixth.\n\n\r\n              TIP-INS\n\n\r\n              Nets: G Ben Simmons has missed nine games with left knee and back soreness. ... After taking a hit to the face and bleeding on the court, Johnson left for treatment briefly during the third period.\n\n\r\n              Timberwolves: G Jaylen Nowell missed his sixth straight game with a left knee injury Friday. ... G Austin Rivers sat out with back spasms.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Denver on Sunday.\n\n\r\n              Timberwolves: At Atlanta on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994854.71402
}