{
  "game_id": "0021300152",
  "espn_id": "400489025",
  "date": "Nov 18, 2013",
  "matchup": "OKC vs. DEN",
  "headline": "Kevin Durant scores 38 as Thunder down Nuggets",
  "body": "OKLAHOMA CITY -- Oklahoma City coach Scott Brooks knows his team can play from behind. He just doesn't want the Thunder to make a habit of it.\n\"We're very prideful. We're going to keep fighting to the last possession,\" Brooks said after watching his team pull out a come-from-behind 115-113 win at home against Denver. \"That's always been a trademark but we can't just turn it on the second half. We have to correct that. It's my job to find combinations where guys are going to play with more defensive force.\"\nKevin Durant scored 38 points, Russell Westbrook had 30 points and 12 rebounds and the Thunder were forced to rally late to win their second straight game.\n\"It's tough. We can't continue to do that and put pressure on ourselves. We've got to start the game better. Most of that is my fault,\" Westbrook said.\nOklahoma City's All-Star point guard struggled early hitting just one of his first seven shots and just four of 12 in the first half.\nBut Westbrook also had seven assists and 11 fourth-quarter points to help Oklahoma City erase a 14-point deficit in the second half. Reggie Jackson added 14 points.\nWith the score tied at 105, Serge Ibaka pulled down an offensive rebound and found Durant for a 3-pointer that put Oklahoma City (7-3) ahead to stay. Jeremy Lamb and Derek Fisher each hit a pair of free throws in the final 14 seconds to help the Thunder hold on.\n\"I think Fish was a huge part of that,\" Brooks said. \"You've got to love guys that play with everything they have. I can't say enough about his effort. His effort turned that game around.\"\nTy Lawson led Denver (4-6) with 29 points and eight assists. J.J. Hickson had 18 points and 19 rebounds.\nThe Nuggets led the entire game except for the first 18 seconds of the first quarter and the final 1:26 of the fourth.\nFirst-year Denver Coach Brian Shaw said his team's outside shooting had been a sore spot coming into the game, but the Nuggets connected on four of their first seven 3-point attempts. Denver shot 59 percent from the field while grabbing a 39-28 lead after the first quarter.\nOklahoma City then began the second quarter with a 10-2 run, but reserve Nate Robinson gave the Nuggets a lift with eight points that helped them to a 13-point lead.\nAfter hitting just one shot in the first quarter, Westbrook scored eight points in the second. Westbrook's 25-footer with a second remaining in the half cut Denver's lead to three.\nDenver increased its lead to 14 in the third quarter but watched it evaporate as Oklahoma City rallied for its second straight win.\n\"Bottom line, you play a team of this caliber on their home court and you pretty much control the entire game it comes down to small details and we didn't do well enough in those areas,\" Shaw said. \"That's the part that's the shame.\"\nDenver missed 18 free throws and gave up 19 offensive rebounds to the Thunder.\nOklahoma City has traditionally struggled with the Nuggets, winning one of four meetings last season and 7 of 12 overall in the young series.\nThe Nuggets had five players score in double figures, but went 25 for 43 from the free-throw line. Evan Fournier had 12 points, Randy Foye scored 11 and Robinson finished with 10.\nThe Thunder were 26 for 32 from the line and outrebounded Denver 53-45.\n\"The comforting thing is we have guys that can come off the bench and play good minutes and have a good role for us,\" Brooks said. \"That's my job to figure out our best lineups at the end of the game and we found the defensive team that was willing to compete every possession.\"\nGame notes\nOklahoma City was 13 for 27 from 3-point range. Westbrook and Durant each made three 3s. ... The Thunder outscored the Nuggets 32-21 in the fourth. Oklahoma City returned from a 1-2 road trip to start a six-game home stretch that continues with the Clippers on Thursday . Nuggets point guard Andre Miller entered Monday's game seven assists shy of passing Rod Strickland for ninth place on the NBA's career list. The 15-year veteran is already one of eight players in league history with at least 15,000 assists and 7,500 assists. He had two assists. . Denver's Wilson Chandler had eight points in his first start since coming back from a hamstring strain.",
  "source": "espn_api",
  "crawled_at": 1764992913.534374
}