{
  "game_id": "0021800019",
  "espn_id": "401070219",
  "date": "Oct 19, 2018",
  "matchup": "TOR vs. BOS",
  "headline": "Kawhi Leonard scores 31 points, Raptors beat Celtics 113-101",
  "body": "TORONTO --  Kawhi Leonard isn't quite back up to speed after missing most of last season.\n\nThat's just fine with the Toronto Raptors. They are plenty happy with the way Leonard is playing right now.\n\nLeonard had 31 points and 10 rebounds, Serge Ibaka added 21 points and the Raptors beat the Boston Celtics 113-101 on Friday night in an early matchup of Eastern Conference contenders.\n\nLeonard, who was limited to nine games last season with San Antonio mostly because of a quadriceps injury, posted his second straight double-double and played 36 minutes, one fewer than he had Wednesday night a season-opening win over Cleveland.\n\n\"I'm not looking to get back to where I was before,\" Leonard said. \"I'm worried about the now and the player I'm trying to become now and tomorrow.\"\n\nLeonard made 10 of 25 attempts, including 2 of 5 from 3-point range, and went 9 for 9 at the free throw line.\n\n\"No matter who Kawhi was against, Kawhi was doing well,\" Celtics coach Brad Stevens said.\n\nLeonard scored 15 of his points in an explosive third quarter, making 5 of 7 from the floor and 5 of 5 at the free throw line.\n\n\"Tonight he played extremely hard,\" Kyle Lowry said. \"He really was aggressive. That's the kind of thing we're gonna need for the whole season.\"\n\nLowry scored 15 points, Danny Green had 14, and Fred VanVleet 11 to help the Raptors win for the 11th time in 12 home meetings with the Celtics, including the past seven in a row.\n\n\"That's a good home win right there,\" Raptors coach Nick Nurse said.\n\nKyrie Irving scored 21 points for Boston, and Al Horford had 14 points, 10 rebounds and nine assists.\n\n\"Tonight was a great test for us,\" Irving said. \"We just came up short.\"\n\nJayson Tatum scored 16 points and Jaylen Brown had 13 for the Celtics.\n\n\"I thought they played a lot better than us in the second half,\" Stevens said.\" We had our moments offensively but all the rebounds they got, especially late, really hurt us.\"\n\nBoston's Gordon Hayward scored 14 points in 24 minutes, connecting on six of 13 field goal attempts.\n\n\"I felt like I found a little bit of rhythm there in the second half,\" Hayward said. \"It was a good start for me. Each game will be progress.\"\n\nStill, it wasn't all good for Hayward, who suffered a gruesome left ankle injury five minutes into last year's season opener and didn't return.\n\n\"There's times where it still feels like I'm not playing like myself, I'm thinking too much out there,\" Hayward said. \"I felt like I was doing that in the first half a little bit.\"\n\nBrown made a 3-pointer to give the Celtics an 87-86 lead with 9:03 remaining. VanVleet answered with a reverse layup, the first basket in a 6-0 spurt that gave Toronto the lead for good.\n\n\"They executed much better than we did,\" Horford said. \"We didn't take care of the ball as well as we could have down the stretch.\"\n\nGreen and Lowry each made 3-pointers around an offensive foul by Tatum with just over two minutes remaining, giving the Raptors a 107-99 edge. Green went 4 for 7 from long range, while Lowry made 3 of 5.\n\nMR. OCTOBER\n\nSerenaded by `MVP' chants from the sellout crowd of 19,800, Leonard said he appreciated the sentiment, if not the timing.\n\n\"It's a little too early,\" he said. \"I appreciate the support. I know they're excited about us winning the game tonight.\"\n\nGIVING PAUSE\n\nIrving wrapped up his postgame scrum by apologizing to reporters for saying `um' so often in his replies.\n\nTIP INS\n\nCeltics: Horford took and made the only free throw by a Boston starter through the first three quarters. The Celtics finished 7 for 10 at the line while the Raptors were 14 for 19. ... Irving shot 10 for 20 from the field. ... Tatum had nine rebounds\n\nRaptors: G Delon Wright (left thigh) missed his second straight game. ... F OG Anunoby started the game wearing protective goggles but took them off after the first. Anunoby left Wednesday's win over Cleveland because of a right orbital contusion. ... Toronto made one change to its starting lineup, with Ibaka replacing Jonas Valanciunas. ... VanVleet led the Raptors with seven assists.\n\nUP NEXT\n\nCeltics: At New York on Saturday night.\n\nRaptors: At Washington on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994302.5721622
}