{
  "game_id": "0022000706",
  "espn_id": "401307495",
  "date": "Mar 28, 2021",
  "matchup": "LAL vs. ORL",
  "headline": "Lakers hold off Magic 96-93, win again without LeBron, Davis",
  "body": "LOS ANGELES -- — Dennis Schröder scored 24 points, Kyle Kuzma added 21 and the Los Angeles Lakers rallied in the fourth quarter to defeat the Orlando Magic 96-93 Sunday night.\n\n\r\n                    Montrezl Harrell added 18 points and 11 rebounds for Los Angeles, which has won two in a row without LeBron James and Anthony Davis. However, the Lakers had a tough time trying to shake the Eastern Conference's second-worst team. \n\n\r\n                    Orlando's Otto Porter Jr. had a clean look at a 3-pointer to send it to overtime, but the shot hit the rim.\n\n\r\n                    “It wasn’t pretty, but we played well. This is a tough shooting night, but our defense carried us through,” Lakers coach Frank Vogel said.\n\n\r\n                    Los Angeles improved to 2/3 without James and Davis. They are fourth in the Western Conference at 30-17 and are 2 1/2 games in front of Denver and Portland. They are also two games behind second-place Phoenix and a game in back of the third-place LA Clippers.\n\n\r\n                    “We’re not playing for holding on. We're paid to do the same job, which is win games,” Harrell said. “We're going to try to continue to keep rolling until they get back.”\n\n\r\n                    Kuzma, who also had 11 rebounds for his 12th double-double of the season, said the Lakers got plenty of open looks, but were not unable to convert until late. Los Angeles made only 41.6% of its shots from the field for its sixth-worst shooting game of the season.\n\n\r\n                    “We probably got the most open looks that we've had all season, especially on 3-pointers,” he said.\n\n\r\n                    Orlando had a 82-77 lead with 7:19 remaining after R.J. Hampton drilled a 3-pointer. The Lakers trailed 84-80 midway through the fourth quarter before going on a 12-1 run to seize control as Schröder and Kuzma each had five points.\n\n\r\n                    Los Angeles had a seven-point lead with under three minutes remaining, but the Magic got within three going to the final possession. \n\n\r\n                    Dwayne Bacon led the Magic with 26 points and Chuma Okeke scored 14. Orlando (15-31) has dropped 13 of 15.\n\n\r\n                    Even though he has plenty of moving pieces after five players were moved at the trade deadline, Orlando coach Steve Clifford was frustrated with his team's failures to execute down the stretch.\n\n\r\n                    “We fouled unnecessarily, played undisciplined defense and missed blockouts,” he said. “We played hard and didn’t play smart. The game was there to be won. Nobody knocked it out of the park.”\n\n\r\n                    There were nine lead changes and three ties during the first 13 minutes before the Lakers went on a 17-3 run to go up 39-26 with under three minutes remaining in the second quarter. The Magic rallied to get it down to a five-point deficit at halftime (44-39) as Bacon had seven points down the stretch.\n\n\r\n                    Markieff Morris' 3-pointer gave the Lakers a 61-53 lead before Orlando scored eight straight to tie it at 61 with 2:12 remaining in the third quarter. There were three more ties in the quarter as it was 69-all going into the final 12 minutes.\n\n\r\n                    MAGIC DEBUTS\n\n\r\n                    Wendell Carter Jr., Hampton, and Porter played their first games for Orlando after being acquired in trades Thursday after the Magic traded five players — including their top three scorers — in three separate deals.\n\n\r\n                    All three ended up coming off the bench. Hampton had 10 points in 17 minutes, while Carter scored eight points in 20 minutes. Porter had five points in 25 minutes, including a long 3-pointer at the end of the third quarter to tie it at 69.\n\n\r\n                    “They're getting acclimated and did some good things. We'll be able to play better as we go, but if we do basic things we win the game,” Clifford said. “We're not going to make stuff up. That is what bad franchises do, especially at the end of the year.”\n\n\r\n                    TIP INS\n\n\r\n                    Magic: G Michael Carter-Williams suffered a right knee contusion during the second quarter and did not return. He was scoreless in 13 minutes. ... G Terrence Ross missed his seventh straight game due to a sore right knee. ... Orlando is 1-19 when it is held under 100 points.\n\n\r\n                    Lakers: Announced before the game they signed C Andre Drummond. ... Three players tallied double-doubles for the second time this season: Kuzma, Harrell and Morris (12 points, 11 rebounds).\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Remain in Southern California to face the LA Clippers on Tuesday.\n\n\r\n                    Lakers: Host the Milwaukee Bucks on Wednesday. The Lakers won the first meeting 113-106 on Jan. 21. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997295.5129879
}