{
  "game_id": "0021900889",
  "espn_id": "401161531",
  "date": "Feb 29, 2020",
  "matchup": "MIA vs. BKN",
  "headline": "Nunn scores 21 points, Heat hold off Nets 116-113",
  "body": "MIAMI --  A disappointing month for the Miami Heat ended with positive results.\n\nGoran Dragic scored 19 points and knocked down a key shot late that helped the Miami Heat hold on for a 116-113 victory over the Brooklyn Nets on Saturday night.\n\n\"Tonight was a little bit shaky but we are happy with the win, especially with how we defended on the last possession,\" Dragic said.\n\nKendrick Nunn scored 21 points and Bam Adebayo had 16 points and 12 rebounds for the Heat, who won consecutive games for the first time since Feb. 1-3.\n\n\"I'm encouraged by the two games. They're not perfect games, but competition isn't,\" Heat coach Erik Spoelstra said. \"It's not supposed to be, but the way we responded to the adversity was a good sign.\"\n\nThe Heat finished 6-7 in February, which included losses to two of the league's worst teams in Minnesota and Cleveland to begin the week.\n\nMiami led by 14 points with 8:31 left in the game and it was trimmed to one with 11 seconds left.\n\n\"If we win, I have no problem going through these growing pains, it's as simple as that,\" Adebayo said. \"Winning cures anything -- it cures everything I'd say.\"\n\nSpencer Dinwiddie scored 25 points but threw away a pass in the closing seconds for the Nets, who have lost four straight and dropped to 2-6 in the second game of a back-to-back.\n\nDinwiddie's layup with 1:20 left pulled the Nets within 112-110 -- the closest they had been since the second quarter.\n\n\"Much better,\" Nets coach Kenny Atkinson said. \"Down 14 with eight minutes to go, we play like that with that type of competitive spirit, we kind of got our identity back a little.\"\n\nBrooklyn had a chance to go ahead on its next possession, but Taurean Prince missed a 3 and Dragic knocked down a jumper from the free throw line for a 114-110 lead with 13 seconds left.\n\n\"It was a mismatch and Spo was yelling, `Light him up, light him up,\" Dragic said. \"That's kind of my shot over the years, to penetrate, step back, and it was open.\"\n\nJoe Harris countered with a 3 with 11 seconds remaining to cut it to 114-113 before Jimmy Butler split a pair of free throws to push the lead to 115-113.\n\nDinwiddie's one-handed pass went sailing out of bounds on the next possession, ending the Nets' comeback hopes.\n\n\"I was going to throw it to Wilson (Chandler),\" Dinwiddie said. \"Technically, right read, errant pass on my part. I have to take full responsibility for that.\"\n\nBrooklyn's Caris LeVert, who was questionable coming into the game with a right hand contusion, scored 15 points and capped a productive month, averaging 21.2 points in February.\n\nMiami, which was also playing on consecutive days, led 57-49 at halftime after Dragic hit a running 3-pointer at the buzzer.\n\nThe Heat opened up an 11-point lead early in the third quarter after Nunn hit a 3 at the top of the key for a 62-51 advantage. The 3-pointer also gave Nunn the Heat rookie record for most 3s in a season. He finished with three 3-pointers in the game, giving him 116 on the season, and passing Mario Chalmers's mark of 114 set in 2008-09.\n\n\"His scoring has meant a lot to us,\" Spoelstra said. \"He's fearless, he can get his own shot, he has the 3-point range, but he can also get to the rim.\"\n\nMiami's Derrick Jones Jr. slammed home a one-handed dunk cutting through the lane and receiving a pass from Dragic to bring the crowd to its feet and moments later drilled a 3 from the wing for an 80-69 lead, prompting Atkinson to call timeout.\n\nTIP-INS\n\nNets: Brooklyn was over .500 in November (9-6) but has not had a winning record in any month since. ... Saturday started a stretch where the Nets are playing nine times in a 14-game stretch against likely playoff clubs. ... The Nets have not won on a leap year date since 1992. They lost Feb. 29 games in 1996, 2004 and 2016.\n\nHeat: Saturday's game was the first home Feb. 29 game in Heat history. They played road games on the leap year in 1992, 2000, 2004 and 2008. ... Miami had a losing record in February for the third straight season. ... Miami's sixth field-goal attempt Saturday night was the team's 5,000th of the season. Every other team reached 5,000 shots before Saturday, and the Heat are taking the fewest field-goal attempts per game in the league so far this season.\n\nHEAT SNAP ASSIST STREAK\n\nThe Heat recorded 27 assists as a team, snapping a streak of four straight games of posting at least 30 in a game. The franchise record was five straight set in 1990.\n\nUP NEXT\n\nNets: Visit Boston on Tuesday.\n\nHeat: Host Milwaukee on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995489.0226529
}