{
  "game_id": "0021500335",
  "espn_id": "400828222",
  "date": "Dec 11, 2015",
  "matchup": "DET @ PHI",
  "headline": "Pistons roll past woeful 76ers 107-95",
  "body": "PHILADELPHIA --  Marcus Morris turned his body into an ink-stained tribute to his home city.\n\nHe has a red Philadelphia Phillies \"P\" logo and the Ben Franklin Fridge tattooed on his chest. Down his right arm, the \"215\" for Philly's area code.\n\nHe stands back-to-back in one scene against his twin brother Markieff with the city skyline as a backdrop.\n\n\"It's my city,\" Morris said.\n\nAgainst the 76ers, Morris' homecoming was one for his fans to remember.\n\nAndre Drummond had 18 points and 16 rebounds and Morris scored 21 points to help the Detroit Pistons beat the Philadelphia 76ers 107-95 on Friday night.\n\nMorris, who played at Prep Charter, torched his hometown team in the third quarter. He hit a pair of 3-pointers during a 26-8 run that put the Pistons ahead by 29 points and let them rest most of their starters in the fourth.\n\nHe had 70 friends and family members at the game.\n\n\"It's fun for them to see me successful as a grown man in the league,\" he said.\n\nThe Pistons opened the game on an 11-0 run, built a 24-point lead in the first half and led 89-66 after three quarters.\n\nIt was a typical game for the abysmal Sixers. San Antonio beat Philadelphia by 51 points on Monday.\n\nYet, coach Brett Brown believes better days are ahead and signed a multi-year contract extension that was announced before the game.\n\nBrown dropped to 38-150 in 2 1/2 seasons with the Sixers. They are 1-23 this season.\n\n\"They've been down, so they know what that is,\" Detroit coach Stan Van Gundy said.\n\nReggie Jackson also scored 21 points for the Pistons.\n\nJahlil Okafor scored 22 points for the Sixers and Robert Covington had 18.\n\n\"Okafor, probably coming out of college, is the most skilled big guy offensively since Tim Duncan,\" Van Gundy said.\n\nHours after Brown's extension was made official, the Pistons wasted no time snuffing out the good feelings inside the Wells Fargo Center. Jackson hit a 3-pointer to spark the 11-0 spurt and quickly turned the home crowd's attention to the \"Star Wars\" theme night festivities.\n\nMuch like the adventures of Luke Skywalker and friends, the Sixers were last contenders a long time ago.\n\nThe 26-year-old Morris was just a kid when Allen Iverson led the Sixers to the 2001 NBA Finals. He can't believe the team he rooted so hard for growing up has become among the worst in all professional sports.\n\n\"I do care,\" he said. \"It seems like they don't care. I don't want to talk bad about them. But they traded Jrue Holiday, great player. (Andre) Iguodala, great player. Jodie Meeks, great player. Hopefully they've got a path, some type of path.\"\n\nThat path has Brown leading the way.\n\n\"He's been the foundation of us,\" forward Nerlens Noel said. \"He keeps us together and he definitely deserved it. Brett's done so much for us. I think he's a great coach and he's only going to make us better and better.\"\n\nThe Sixers committed a whopping 10 turnovers in the first quarter that led to 19 points for the Pistons. They finished with 21.\n\nDrummond had his league-leading 21st double-double of the season and also had four of Detroit's nine blocked shots.\n\nTIP-INS\n\nPistons: They improved to 5-8 on the road. Detroit had lost 8 of 9 on the road. ... After getting outrebounded two straight games, the Pistons held a 48-44 edge on the boards.\n\n76ers: Guard Kendall Marshall made his season debut after recovering from a torn ACL in his right knee suffered last season with Milwaukee. ... Guard Tony Wroten, eased back into the lineup after missing 20 games with a right knee injury, was held out.\n\nBROWN'S DEAL\n\nBrown not only loves the franchise's future, he's hooked on the city.\n\n\"I love the city of Philadelphia. It's real,\" he said. \"It's difficult, at times, going through what we all go through. I like raising my family here. I like my son, my little 11-year-old son, being on the streets of Philadelphia playing playground basketball, my kids going through the Lower Merion school district.\"\n\nUP NEXT\n\nPistons: Host Indiana on Saturday.\n\n76ers: Play Sunday at Toronto.",
  "source": "espn_api",
  "crawled_at": 1764994946.080619
}