{
  "game_id": "0021900884",
  "espn_id": "401161526",
  "date": "Feb 28, 2020",
  "matchup": "PHX vs. DET",
  "headline": "Pistons snap 7-game skid by beating Suns 113-111",
  "body": "PHOENIX --  It's been a lost season for the Detroit Pistons, who struggled through the first half of the schedule, dealt star center Andre Drummond at the trade deadline and have spent the past few weeks stuck in a losing streak that reached seven games.\n\nThrough it all, veteran guard Derrick Rose keeps playing with passion.\n\nThe 31-year-old and the Pistons were finally rewarded for that perseverance on Friday night when Rose equaled a season high with 31 points in a 113-111 win over the Phoenix Suns.\n\n\"That's how the gods in this game work,\" Rose said. \"If you play hard the gods will reward you. Tonight, we were rewarded with a win.\"\n\nRose made 15 of 24 shots from the field, Christian Wood and Brandon Knight both added 19 points and the Pistons won for the first time since Feb. 5, when they beat Phoenix 116-108 in Detroit. They got the best of the Suns once again and picked up a road victory for the first time since Jan. 18.\n\n\"I feel good for our guys,\" coach Dwane Casey said. \"They've been working their behind off. We've basically been having training camp the last few weeks with all the young guys coming in. The development has showed a lot of good things in a lot of different places.\"\n\nThe rebuilding Pistons leaned on the veteran combination of Rose and Knight in the fourth quarter to stop their skid. Rose, the NBA MVP in 2011 before injuries derailed his career, made two clutch baskets in the final minute to keep the Pistons ahead, driving into the lane and hitting tough, contested jumpers. Knight scored 11 points in the fourth quarter and finished with five 3-pointers.\n\nThe Pistons led 109-98 with 2:37 remaining but the Suns responded with nine straight points to make things interesting.\n\nDetroit had the ball with a 113-111 lead and just 1.9 seconds left, but the Pistons threw a bad inbounds pass and the Suns grabbed the ball before calling a quick timeout. Devin Booker had a chance to win it for the Suns, but couldn't get a shot off before time expired.\n\nIt was another frustrating loss for the Suns, who are running out of time to get back into contention for a Western Conference playoff spot. Booker led Phoenix with 26 points while Deandre Ayton added 20 points on 10-of-12 shooting and 10 rebounds.\n\nBooker thought he got fouled on the final possession, but felt the Suns shouldn't have been in a position to need a big comeback. The Suns are 2/3 since the All-Star break and fell to 24-36 for the season.\n\n\"They hit tough shots down the stretch but I think if we played with the same effort that we played in the last five minutes that it wouldn't have been that close of a game,\" Booker said.\n\nPhoenix had a 53-52 lead at halftime. Ayton led the Suns with 14 points on 7-of-7 shooting in the first half. Rose had 12 points and Svi Mykhailiuk scored 11 before the break.\n\nTIP-INS\n\nPistons: G Bruce Brown didn't play for a second straight game because of left knee soreness. ... Detroit improved to 20-41.\n\nSuns: Kelly Oubre Jr. missed his second straight game with a right knee injury, and coach Monty Williams is unsure when Oubre will return. He is the team's third-leading scorer, averaging 18.7 points per game. ... Rookie forward Cameron Johnson hit the floor hard in the first quarter and had to leave the game for X-rays, but returned in the second quarter. ... The Suns lost despite shooting 60% from the field. ... Ricky Rubio had 16 points and 13 assists.\n\nUP NEXT\n\nThe Pistons wrap up their four-game road trip at Sacramento on Sunday.\n\nThe Suns host the Warriors on Saturday.\n\n---\n\nFollow David Brandt on Twitter: www.twitter.com/davidbrandtAP\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996542.9968152
}