{
  "game_id": "0021200228",
  "espn_id": "400277948",
  "date": "Nov 30, 2012",
  "matchup": "MEM vs. DET",
  "headline": "Rudy Gay scores 18 to pace Grizzlies past Pistons",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies closed out their longest homestand of the season with a convincing defensive performance and a double-digit win.\n\nRudy Gay had 18 points, Marc Gasol and Mike Conley\n added 17 each, and the Grizzlies won their fourth straight with a 90-78 victory over the Detroit Pistons on Friday night.\n\nMemphis closed out the five-game home stretch with a 4-1 record, the only loss coming against Denver 97-92 in the opening game.\n\n\"We played a lot of good teams in this homestand, and in the last few weeks,\" Conley said. \"For us to get this win, is huge for what we stand for, and that's just one game at a time and being ready for each individual opponent.\"\n\nDarrell Arthur added 11 points for Memphis, while Jerryd Bayless scored 10 points. Gasol grabbed 11 rebounds.\n\nGreg Monroe led the Pistons with 17 points and nine rebounds, and Tayshaun Prince finished with 15. Brandon Knight added 10 for Detroit, which lost its third straight and fell to 1-9 on the road.\n\nWhile the Pistons outrebounded the Grizzlies 46-39, Detroit had trouble controlling the ball, committing 22 turnovers to 12 for Memphis.\n\n\"They are a good defensive team, but I think a lot of our problems came from turnovers,\" said Knight who had six turnovers. \"Unforced turnovers and unforced errors. We gave them a lot of easy baskets.\"\n\nMonroe had even more problems than Knight, committing seven turnovers.\n\n\"We definitely had a chance to win the game if we didn't turn the ball over as many times as we did,\" said the Pistons center, who was 7 of 15 from the field.\n\nMemphis played without guard Tony Allen, who has a right groin sprain.\n\nThe Grizzlies built the lead in the second quarter and didn't relinquish the advantage the rest of the way.\n\nMemphis carried a 53-45 lead into the break after a poor shooting start. Knight had all 10 of his points for the Pistons, while Gasol led Memphis with 15.\n\nWhile both teams shot about 44 percent for the half, the Pistons committed 13 turnovers compared to five for Memphis.\n\nDetroit coach Lawrence Frank said before the game that it was mandatory that his team take care of the basketball.\n\n\"You just can't give this team extra possessions,\" Frank said. \"Memphis obviously is a very, very good team. But how many of (the turnovers) were forced, and how many were unforced?\"\n\nMemphis started 5 of 21 from the field, but eventually got untracked building the lead to double digits.\n\nThe Pistons had a 12-4 run opening the third to pull back even.\n\nBut Conley converted a 3-point play, and connected from outside the arc to help Memphis carry a 76-66 lead into the final period.\n\nMemphis maintained at least an eight-point advantage through the fourth quarter, although both teams struggled down the stretch. The two teams were a combined 9 of 35 in the final period, and Memphis outscored Detroit 14-12.\n\n\"Nobody could make a shot in the fourth quarter,\" Memphis coach Lionel Hollins said. \"I'm happy we were ahead and our defense was still strong.\"\n\nThe Grizzlies head to San Antonio on Saturday to face the Spurs, who are well-rested even though it cost the team $250,000 for sending Tim Duncan, Tony Parker, Manu Ginobili and Danny Green home before the finale of a six-game road trip in Miami on Thursday night.\n\nGame notes The Grizzlies have won six straight in the series. ... Randolph entered the game with 12 double-doubles in Memphis' first 13 games. He finished with eight points and five rebounds. ... The Pistons 22 turnovers matched a season high for a Memphis opponent.",
  "source": "espn_api",
  "crawled_at": 1764993614.486836
}