{
  "game_id": "0022200495",
  "espn_id": "401468650",
  "date": "Dec 25, 2022",
  "matchup": "MIL @ BOS",
  "headline": "Tatum has 41, Celtics push back on Giannis, Bucks 139-118",
  "body": "BOSTON -- — Jaylen Brown knocked down his shots in the fourth quarter. And then he knocked down Bucks star Giannis Antetokounmpo.\n\n\r\n              Brown scored 13 of his 29 points in the fourth, and Jayson Tatum scored 41 for Boston on Sunday to help the Celtics beat Milwaukee 139-118 in a matchup of the top two teams in the NBA.\n\n\r\n              Tatum scored 20 in the third quarter, when the Celtics turned a one-point lead into a 100-86 edge. Brown took over in the fourth, contributing on defense with a pick that sent Antetokounmpo to the floor before he bounced back up and shoved Brown in the back.\n\n\r\n              “I thought I was playing pretty physical defense, nothing dirty. It seemed like it was a clean play,\" Brown said. “Maybe he was a little but frustrated. He got up and threw an elbow at me, for whatever reason.”\n\n\r\n              After some jawing back and forth, Antetokounmpo was given a technical foul and went to the bench. The teams played the last 3:41 without further incident. \n\n\r\n              “There’s a difference between trying to be a tough guy and letting your opponent know that I’m not backing down, I’m not afraid of any challenge or any matchup whatsoever,” Brown said. “In that moment I was just letting him know that.\"\n\n\r\n              Antetokounmpo, who fell hard on his hand on Friday night but was cleared to start, scored 27 points with nine rebounds. Asked about his team's ability to limit the damage done by Antetokounmpo, Celtics coach Joe Mazzulla said, “Limiting's crazy. He had 27.”\n\n\r\n              “He’s a great player,” he said, “and you've got to be disciplined against him.” \n\n\r\n              Jrue Holiday scored 23 for Milwaukee, which lost a third straight game for the first time this season. The Celtics have also struggled lately, losing five of six before winning back-to-back games. \n\n\r\n              Still, Boston (24-10) has the best record in the league, followed by Milwaukee (22-11).\n\n\r\n              “Obviously, we lost to them last year in the playoffs and we've had battles with them since I’ve gotten to Milwaukee,” said Bucks forward Pat Connaughton. “So they’re two teams that are very familiar with each other.”\n\n\r\n              “But it’s also December 25th. The NBA season is a long season, and we will be a much better basketball team by the end of this year than we are right now,” he said. “And I’m sure they will be, too.”\n\n\r\n              The Celtics led by 10 in the first quarter and 11 in the second, when Antetokounmpo fired back-to-back bricks from 3-point range and in the middle got dunked on by Jayson Tatum. \n\n\r\n              Their lead was down to one point, 62-61, before Bobby Portis fouled Brown on a desperation 3-pointer at the halftime buzzer. Brown missed all three free throws; he missed another in the third quarter before hitting the second and finished 2 for 6 from the line.\n\n\r\n              Boston pulled away in the third, opening up a double-digit lead that Milwaukee only briefly chipped into. \n\n\r\n              The teams met in the second round of last year’s Eastern Conference playoffs, and the Celtics won in seven games en route to the NBA Finals. It’s their first meeting since then. Last Christmas in Milwaukee, the Bucks beat Boston 117-113. \n\n\r\n              TIP-INS\n\n\r\n              Antetokounmpo hurt his hand after a foul against the Nets on Friday night. X-rays were negative. ... Connaughton, a native of nearby Arlington, Massachusetts, made his first start of the season and scored 15. … The Celtics made five of their first six 3-point attempts. … Khris Middleton sat out his fifth straight game with a knee injury. He also missed the first 20 games of the season. … Sam Hauser banked in a long 3-pointer at the first-quarter buzzer off an inbounds pass with 1.7 seconds left. … Derrick White hit a 3-pointer in the third quarter. He had missed 15 straight over six games. \n\n\r\n              UP NEXT\n\n\r\n              Bucks: Visit Bulls on Wednesday night. \n\n\r\n              Celtics: Host Rockets on Tuesday night. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994581.642943
}