{
  "game_id": "401809938",
  "espn_id": "401809938",
  "date": "Oct 22, 2025",
  "matchup": "MEM vs NO",
  "headline": "Morant scores 35 points, Memphis uses a third-quarter rally to beat New Orleans 128-122",
  "body": "MEMPHIS, Tenn. -- — Ja Morant scored 35 points, including a key basket with 32.9 seconds to play, and the Memphis Grizzlies beat the New Orleans Pelicans 128-122 on Wednesday night in the season opener for both teams.\n\n\r\n              Morant's basket gave the Grizzlies a 122-118 lead. Olivier-Maxence Prosper, Kentavious Caldwell-Pope and Morant hit free throws in the closing seconds to seal the victory.\n\n\r\n              Jaren Jackson finished with 18 points and six blocks. Caldwell-Pope finished with 15 points. Rookie Cedric Coward hit all five of his shots from the field for 14 points. Coward was perfect from the free-throw line going 4 for 4. It was the first time a rookie with at least 10 points had a perfect night shooting in his debut since Thabo Sefolosha in 2006.\n\n\r\n              Zion Williamson led the Pelicans with 27 points, nine rebounds, five steals and five assists. Herbert Jones, Jordan Poole and rookie Jeremiah Fears, the seventh pick in last summer's draft, finished with 17 points each.\n\n\r\n              A 27-6 Memphis rally in the third quarter erased New Orleans' lead. That was part of a 41-22 period for a 97-89 Memphis lead entering the fourth.\n\n\r\n              The game featured the top two picks in the 2019 NBA draft — Williamson, picked first, followed by Morant for the Grizzlies at No. 2. \n\n\r\n              New Orleans is trying to turn around a 21-61 season where it finished 14th in the Western Conference. Meanwhile, Memphis was coming off a first-round elimination in the postseason by eventual NBA champion Oklahoma City.\n\n\r\n              Memphis, already short on players because of injuries, dealt with foul trouble in the first half, which helped the Pelicans build a 67-56 lead at the break.\n\n\r\n              Memphis took over the game in the third quarter with a major run that erased the a quick start by New Orleans.\n\n\r\n              Up next\r\n              Pelicans: Host the Spurs in the home opener on Friday night.\n\n\r\n              Grizzlies: Host the Heat on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042480.300402
}