{
  "game_id": "0021800397",
  "espn_id": "401071078",
  "date": "Dec 10, 2018",
  "matchup": "DAL vs. ORL",
  "headline": "Barnes, Brunson lead Mavericks past Magic 101-76",
  "body": "DALLAS --  The Dallas Mavericks were again talking about a great performance by a rookie.\n\nThis time it wasn't Luka Doncic.\n\nJalen Brunson started at point guard for the second consecutive game and scored a career-high 17 points as the Mavericks beat the Orlando Magic 101-76 on Monday night.\n\nBrunson, who led Villanova to two national championships in the past three years and was a Mavs second-round pick, replaced the injured Dennis Smith Jr. (right wrist sprain) and scored in double figures for the third straight game. And he did it Monday with Mavericks Hall of Fame point guard Jason Kidd in the house.\n\n\"Being able to perform like that in front of him is definitely special,\" Brunson said. \"But no matter who is in the crowd and who is watching, I just try and play the same way every time.\"\n\nBrunson scored the first basket of the game, and Dallas never trailed against the Magic, who were playing without two rotation players.\n\nHarrison Barnes led the Mavericks with 19 points, and Dwight Powell scored 16. Doncic had season highs with 11 rebounds and nine assists to offset a 2-for-11 shooting performance, finishing with seven points.\n\nJonathon Simmons scored a season-high 18 for the Magic and Aaron Gordon had 10. Orlando played without Evan Fournier, who missed the game for personal reasons, and Mo Bamba, who was suspended by coach Steve Clifford for a violation of team rules.\n\n\"Yeah, it's a bad on my part,\" Bamba said after the game. \"I need to be better. Just got to be on time.\"\n\nDallas never trailed in winning its 10th straight at home for the first time since the 2007-08 season. The Mavericks led by as many as 28 in the fourth quarter.\n\nBrunson was 5 for 5 from the field in the first half and scored 11 points, as did Barnes, who had the Mavericks' final eight to give Dallas a 52-40 lead at halftime.\n\nBrunson then extended it to 61-44 with a 3 from the right corner with 9:05 left in the third quarter. The lead grew to 22 by the end of the period.\n\n\"He's more seasoned than you expect out of a guy in their first year,\" Mavericks guard Wesley Matthews said. \"He's stepped into the opportunity well.\"\n\nTIP-INS\n\nMagic: Clifford did not detail the reasons for Fournier's absence, but said, \"It's totally excused.\" Jonathan Isaac started in Fournier's spot. Clifford didn't know whether Fournier would miss more games. He also said Bamba's suspension was for this game only.\n\nMavericks: Matthews hit two 3s, tying Steve Nash for sixth in Mavericks history with 569. Of the five above them, four were in the building Monday: Dirk Nowitzki (first), team executive Michael Finley (third), Kidd (fourth) and team broadcaster Derek Harper (fifth). Jason Terry is second.\n\nVUCEVIC STRUGGLES\n\nOrlando's Nikola Vucevic played 26 minutes despite turning his ankle during a loss Friday against Indiana. He had 16 rebounds but scored just eight -- his first game below double digits this season.\n\n\"I didn't think he played with nearly the energy level frankly that he has been most of the year,\" Clifford said.\n\nIT'S BEEN A WHILE\n\nFor perspective on how long it has been since Dallas won 10 games in a row at home, consider that the 2007-08 season was the last one the Mavericks were coached by someone other than Rick Carlisle, who took over for Avery Johnson after that season.\n\nThe Mavericks' final loss of that regular season came against the Seattle SuperSonics, led by then-rookie Kevin Durant. The SuperSonics moved to Oklahoma City after that season.\n\nUP NEXT\n\nMagic: Travel to Mexico City to play Chicago on Thursday and Utah on Saturday. Both are Magic home games.\n\nMavericks: Host Atlanta on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995465.847442
}