{
  "game_id": "0021900926",
  "espn_id": "401161568",
  "date": "Mar 05, 2020",
  "matchup": "CHA vs. DEN",
  "headline": "Jamal Murray hits late jumper to lift Nuggets past Hornets",
  "body": "CHARLOTTE, N.C. --  Denver Nuggets guard Jamal Murray took to Twitter after a 16-point loss to Golden State on Tuesday night, vowing to be better.\n\n\"Put that game on me...,\" Murray tweeted. \"I gotta be better on both ends. Nuggets fans, we'll be alright!!\"\n\nAnd they were.\n\nMurray lived up to his promise in his return to the court Thursday night, hitting a running, 13-footer off one foot from the baseline with 5.1 seconds to help Denver overcame an eight-point fourth quarter deficit and beat the Charlotte Hornets 114-112.\n\n\"My energy was different and I was more aggressive,\" Murray said. \"I was talking more, playing defense harder and doing all of the little things.\"\n\nMurray finished with 18 points and six assists, and Nikola Jokic added 14 points, 11 rebounds and eight assists for Denver.\n\nThe Nuggets remained in third place in the Western Conference, a game behind the Los Angeles Clippers.\n\n\"I never want any one player taking the blame because the reality is this: when we win, we win as a team, and we lose, we lose as a team,\" Nuggets coach Mike Malone said of Murray's tweet. \"Did Jamal play great against Golden State? No, he didn't. But he wasn't the only one. It's a noble act by Jamal Murray but more importantly I think it's great when a guy says, you know what, I didn't play my best so I am going to come out and have a better game the next game. I am going to hold myself to a higher standard.\"\n\nDevonte Graham had 24 points and seven assists for the Hornets. P.J, Washington added 20 points and Terry Rozier had 19. Rozier's 3-pointer at the buzzer rimmed out.\n\n\"Perfect shot I wanted to shoot,\" Rozier said. \"Last game I tried to be unselfish. This game just missed, hit back rim. I'd take those shots any day.\"\n\nJokic became frustrated at times with the officiating, picking up his third foul late in the first half, his fourth just five minutes into the third quarter and fifth with 2:38 left in the game.\n\nHe argued with officials after a non-call under the Hornets' basket, then wouldn't allow Charlotte to inbound the ball, attempting to intercept the ball when an official flipped it to Graham because he wasn't done discussing the call.\n\nA short while later, Jokic was whistled for his fourth foul after pushing off against Cody Zeller and headed to the bench shaking his head.\n\nThe Hornets rallied to take a 94-86 lead with eight minutes left in regulation with Jokic watching from the bench. But the Nuggets battled back to tie it with five minutes left. On the tying basket, Will Barton threw an inbounds pass to himself off the back of Charlotte's Cody Martin and dunked it, then grinned as he ran back down the floor to play defense.\n\nTIP INS\n\nNuggets: Barton scored 16 points and Monte Morris added 15. ... Made only 8 of 26 3-point attempts.\n\nHornets: A female fan who was sitting courtside took a forearm to the head from the 7-foot Zeller, who was hustling the save a ball from going out of bounds. The game was stopped briefly while she was attended to by medical personal. She left the game shortly after the collision and did not return to her seat.\n\nGRAHAM'S RETURN\n\nGraham looked good in his first game back since sitting out with left ankle soreness, finishing 8 of 15 from the field with three 3s.\n\n\"He gives us a real jolt,\" Hornets coach James Borrego said. \"He's a fantastic player, it's great to have him back on the court. I thought he played extremely well.\"\n\nUP NEXT\n\nNuggets: At Cleveland on Saturday night.\n\nHornets: Wrap up a four-game homestand against Houston on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996047.60922
}