{
  "game_id": "0022200065",
  "espn_id": "401468220",
  "date": "Oct 26, 2022",
  "matchup": "MIA @ POR",
  "headline": "Heat snap Blazers four-game winning streak with 119-98 win",
  "body": "PORTLAND, Ore. -- — Bam Adebayo scored 18 points and the Miami Heat snapped Portland's four-game winning streak with a 119-98 victory on Wednesday night.\n\n\r\n              Damian Lillard had 22 points for Portland when he came up limping with just over five minutes to go in the third quarter and headed straight for the locker room. He did not return and the Blazers later announced he had a right calf strain.\n\n\r\n              Lillard, a six-time All-Star, said he felt tightness in his calf before the game. While he is not likely to play Friday when the Blazers host the Rockets, he does not expect to miss any more games. \n\n\r\n              “I mean honestly, if this was a playoff game I would have played,” Lillard said.\n\n\r\n              Kyle Lowry and Jimmy Butler each had 17 points for the Heat, who led by as many as 26 points. Six Miami players were in double figures. \n\n\r\n              “Before the game we were locked in,” Butler said. “That's how we win, that’s the winning formula. It feels good.”\n\n\r\n              Rookie Shaedon Sharpe had 15 points and eight rebounds for Portland, which had won each of its first four games to open the season for the first time since 1999. The Blazers were the last remaining undefeated team in the Western Conference. \n\n\r\n              It was a close first half. Jerami Grant hit a 3-pointer to give the Blazers a 44-36 lead, but Tyler Herro answered with a 3 for Miami. \n\n\r\n              Herro made a running jumper then added a free throw to put Miami in front 52-51, and the Heat went on to lead 61-56 at the half. Herro finished with 14 points. \n\n\r\n              The Heat went up 81-70 on Butler's dunk midway through the third quarter. Without Lillard, the Blazers struggled offensively the rest of the way. \n\n\r\n              “The turnovers at that time really killed us, and then they got out on the break and started getting a whole bunch of transition threes, and they opened up the lead at that point,” Blazers guard Anfernee Simons. “So I think it was just a little bit of us being careless with the basketball.”\n\n\r\n              Miami made a season-high 15 3-pointers in the game. \n\n\r\n              “We put it together on both ends,” Miami coach Erik Spoelstra said. “We’ve been doing some better things. In the last two games you’ve seen our energy level go up.”\n\n\r\n              Portland was coming off a 135-110 victory over the Denver Nuggets on Monday night. Anfernee Simons had 22 points, including six 3-pointers, in the third quarter to pull away, and Portland held Nikola Jokic to nine points. \n\n\r\n              TIP INS\n\n\r\n              Heat: Caleb Martin and Nikola Jovic returned after a one-game suspension by the league for their roles in a scuffle with the Raptors on Saturday night. ... It was the first of a three-game Western road trip for the Heat. The Heat were without Omer Yurtseven (ankle) and Victor Oladipo (knee), both of whom haven’t played this season. \n\n\r\n              Trail Blazers: Justise Winslow was available for the Blazers after sitting out of Monday’s game against the Nuggets with a sore ankle. ... Simons finished with 14 points. \n\n\r\n              UP NEXT \n\n\r\n              Heat: Miami visits Golden State on Thursday. \n\n\r\n              Trail Blazers: Portland hosts Houston on Friday. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993996.018622
}