{
  "game_id": "0021401027",
  "espn_id": "400579319",
  "date": "Mar 20, 2015",
  "matchup": "MEM @ DAL",
  "headline": "Randolph leads Grizzlies past Mavericks 112-101",
  "body": "DALLAS --  After scoring just 44 points in the first half, a 39-point third quarter was just what the Memphis Grizzlies needed to get back on the winning track.\n\nZach Randolph scored 21 points, Marc Gasol had 15 points and 10 rebounds, and the Grizzlies pulled away in the third quarter to defeat the Dallas Mavericks 112-101 on Friday night.\n\n\"We just needed to change our mindset a little bit,\" said Mike Conley, who returned to Memphis' starting lineup after missing four games with a sprained right ankle. \"Go out and play aggressive. Play with reckless abandon on defense. Play hard through the mistakes.\"\n\nA 20-4 run that extended seven minutes into the early stages of the third period propelled the Grizzlies.\n\nConley had 14 points and three assists while playing nearly 26 minutes. Grizzlies coach Dave Joerger cited his presence in the turnaround from Tuesday's 105-95 loss at Detroit.\n\n\"He is a leader for us and came out and set the tone,\" Joerger said.\n\nThe victory ended a three-game road skid for the Grizzlies, their longest of the season. Zach Randolph led Memphis with 21 points, and Marc Gasol had 15 points and 10 rebounds. Memphis shot 64.7 percent in the second half, its most accurate half of the season.\n\nDallas had a three-game winning streak halted and finished a season-high five-game homestand 3-2. The Mavericks were led by Dirk Nowitzki and Devin Harris with 16 points each.\n\n\"It doesn't get much uglier than that,\" Dallas' Chandler Parsons said. \"We played too slow. We played their game tonight and didn't play our style.\"\n\nDallas led 35-34 with 4:08 to play in the first half when the Grizzlies began their run, which extended almost three minutes into the third period.\n\nWith Memphis leading 67-48 with 5:25 to play in the third quarter, Amare Stoudemire disputed an offensive foul with referee Scott Foster and was assessed two technical fouls, resulting in his ejection. Dallas coach Rick Carlisle also received a technical from Foster during that stoppage of play.\n\n\"I've never received two techs that quick in my career,\" Stoudemire said.\n\nThe Mavericks cut a 24-point deficit to nine with 3:48 left in the fourth quarter. Memphis' Jeff Green, coming off the bench for the first time since Jan. 21, then hit a 3-pointer when Parsons left him to double-team another player.\n\n\"It's just a mistake, but it's a bad mistake,\" Carlisle said. \"And the timing is really bad.\"\n\nAdded Parsons: \"That was a big play. That was absolutely my fault.\"\n\nMonta Ellis, the Mavericks' leading scorer at 19.2 points per game, didn't make a field-goal attempt until the fourth quarter and was limited to 12 points, 10 in the final period.\n\nNowitzki and Gasol each fouled out.\n\nTony Allen made his first start since Jan. 21, in place of Green. Allen had 13 points and seven rebounds, while Green had 15 points.\n\nWith the Grizzlies hitting three 3-pointers in the first period's final 1:12, Memphis took a 25-18 lead. Gasol played only 10:56 during the first half, picking up two fouls in the opening 5:20 and a third midway through the second period.\n\nCarlisle bemoaned Memphis' hot shooting to close the opening quarter.\n\n\"We went from being two or three down to seven down,\" he said. \"That's a horrible way to start that part of the game off and finish the first quarter.\"\n\nMemphis led 44-37 at halftime, with 25 points coming from reserves. Dallas shot only 27.3 percent in the second quarter, and 34.3 percent for the half.\n\nCUBAN ON COWBOYS\n\nMavericks owner Mark Cuban on the Dallas Cowboys' recent signing of defensive end Greg Hardy, who's facing a league suspension for violating the NFL's domestic conduct policy. \"If the Cowboys are putting together a whole support team, more power to them.\"\n\nTIP-INS\n\nGrizzlies: Beno Udrih shot 5 of 8 off the bench and scored 12 points. ... Memphis broke 100 points for the first time in six games.\n\nMavericks: Dallas is 10-2 in games in which neither team scored 50 points in the first half. ... Stoudemire, with the early exit, played 7:06 off the bench and contributed four points and four rebounds.\n\nUP NEXT\n\nGrizzlies: finish a back-to-back at home against Portland on Saturday.\n\nMavericks: at Phoenix on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764992128.674091
}