{
  "game_id": "0021600164",
  "espn_id": "400899614",
  "date": "Nov 16, 2016",
  "matchup": "OKC vs. HOU",
  "headline": "Westbrook scores 30 as Thunder top Rockets 105-103",
  "body": "OKLAHOMA CITY -- As Russell Westbrook took off, he saw Clint Capela as a mere obstacle to victory rather than an athletic 6-foot-10 shot blocker.\nIn the blink of an eye, Westbrook uncorked a vicious left-handed hammer dunk over Capela in the closing seconds to help the Oklahoma City Thunder beat the Houston Rockets 105-103 on Wednesday night.\nOklahoma City led by three when the 6-3 Westbrook threw it down with 5.5 seconds left to put the Thunder up five.\nWestbrook said Capela's reputation -- he had already blocked three shots on the night and ranks among the league's leaders -- didn't deter him.\n\"It don't matter, man,\" Westbrook said. \"Game on the line. If you get blocked, or you make a dunk -- it's one or the other. Fortunately, it went in and it closed the game for us.\"\nOklahoma City center Steven Adams, who isn't easily impressed, cracked a smile when asked about Westbrook's jam.\n\"Just happy it's not me,\" he said. \"That's pretty much like the only thing is `Thank goodness he's on my team.' That was crazy. Honestly, he did a good job, Capela. Nice little bit of defense, honestly. Verticality, avoided the foul, and obviously, he's (Westbrook) just a really athletic dude. Just caught him.\"\nWestbrook finished with 30 points, nine assists and seven rebounds. Victor Oladipo added season highs of 29 points and 10 rebounds for the Thunder, who snapped a four-game losing streak.\nJames Harden, the league's assist leader and No. 4 scorer heading into the night, finished with 13 points, 13 assists and seven rebounds. He made just 4 of 16 shots while being harassed by Andre Roberson.\n\"Dre did an amazing job, like he's been doing all season,\" Westbrook said. \"James is a tough player, obviously, and he (Roberson) did a great job of making him shoot over his length. He needs to get credit for what he's been doing defensively all year.\"\nCapela added 13 points and 14 rebounds for the Rockets, who went scoreless for more than six minutes in the fourth quarter to help the Thunder position themselves for the win.\n\"We didn't play well,\" Harden said. \"We didn't shoot the ball well, and we still had an opportunity to win.\"\nOklahoma City led 65-63 at halftime as Westbrook had 20 points and Oladipo 17. The shot 61 percent before the break. The Rockets' offense worked, despite just five points from Harden on 1-for-6 shooting.\nThe Rockets started strong after the break, and a 14-5 binge put Houston up 77-70 and led to an Oklahoma City timeout. The Rockets stretched their lead to 11, but the Thunder pulled to 90-85 by the end of the period.\nOladipo's 3-pointer with just under three minutes to play tied the score at 100, then Roberson's alley-oop dunk on a lob from Westbrook finally put the Thunder ahead.\nWestbrook made a free throw to extend Oklahoma City's lead to three with 28 seconds remaining. Houston missed an opportunity when Harden and Trevor Ariza failed to connect while Ariza was open in the corner. That set up Westbrook's game-clinching dunk.\n\"I still wasn't able to make a couple of passes,\" Harden said. \"Normal game, just didn't make shots, especially down the stretch when we needed to. That was it.\"\nTIP-INS\nRockets: G Patrick Beverley, one of Oklahoma City fans' most hated players, was out with a left knee irritation. He hasn't played this season. ... Eric Gordon shot 5 for 20 from the field and scored 13 points.\nThunder: It was the second straight home game in which the Thunder faced a core member of its team that reached the 2012 NBA Finals. Serge Ibaka scored 31 points and made the game-winner for Orlando on Sunday. ... The Thunder shot 75 percent in the first quarter to lead 38-32. ... Oklahoma City made 13 of 14 free throws.\nSTAT LINES\nOklahoma City's starting guards, Westbrook and Oladipo, combined to make 21 of 38 shots. Houston's starting guards, Harden and Gordon, shot a combined 9 for 36.\nSTAR POWER\nOklahoma wide receiver Dede Westbrook, who is starting to gain traction as a Heisman candidate, attended the game. He has 68 catches this season for 1,254 yards and 14 touchdowns in 10 games. The eighth-ranked Sooners will play at No. 10 West Virginia on Saturday.\nUP NEXT\nRockets: Host Portland on Thursday night.\nThunder: Host Brooklyn on Friday night.\n---\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP",
  "source": "espn_api",
  "crawled_at": 1764995328.547009
}