{
  "game_id": "0021800454",
  "espn_id": "401071135",
  "date": "Dec 18, 2018",
  "matchup": "DAL @ DEN",
  "headline": "Nuggets win 7th straight at home by beating Mavs 126-118",
  "body": "DENVER --  Nuggets 7-footer Nikola Jokic stared at the stat sheet lying on the ground near his salmon-colored shoes.\n\nHe pretty much liked everything he saw -- and it was easy to see why.\n\nJokic had 32 points and 16 rebounds, Jamal Murray dished out a career-high 15 assists and Denver extended its home winning streak to seven games by beating the Dallas Mavericks 126-118 on Tuesday night.\n\nAt 21-9, the Nuggets matched the 1976-77 squad for the best start through 30 games in the franchise's NBA history. They also remained atop the Western Conference by percentage points over Golden State.\n\nThis is certainly rarefied air for the Nuggets: The last time before this season they had played more than 25 games and were alone in first place in the conference was March 1977.\n\n\"It's a good thing. But we need to stay hungry,\" Jokic said. \"We can get better.\"\n\nNuggets coach Michael Malone really isn't all that surprised by his team's fast start. Missing the postseason by a game last season fueled this squad.\n\n\"They bought in a long time ago, man,\" Malone said. \"There's a lot of fun in that locker room right now. Winning is great. Hopefully we can sustain this.\"\n\nMurray contributed 22 points for the injury-depleted Nuggets, including 10 in the fourth quarter. That came on the heels of scoring 15 in the fourth quarter of a win over Toronto on Sunday.\n\n\"When he wakes up like that, there's nobody who can stop him,\" Jokic said.\n\nLuka Doncic had a big game for Dallas with 23 points and a career-best 12 assists, while Harrison Barnes scored 30. The Mavericks hit 15 3-pointers against the NBA's top long-range defense.\n\nIt wasn't enough.\n\n\"Our defense obviously could have been tighter,\" Mavericks coach Rick Carlisle said. \"Some of it was great shot-making by them, and some of it was untimely mistakes by us. We've got to build on the positives and pick up the defense and rebounding.\"\n\nThe Nuggets held each opponent under 100 points in their last six wins at the Pepsi Center. But this one turned into a track meet -- a throwback to days of old for Denver.\n\nStill, it was a defensive play that helped save the night for the Nuggets.\n\nSparked by a 14-0 run at the end of the third, the Nuggets took a 105-95 lead into the final quarter. Dallas trimmed it to four before Monte Morris hit a 3-pointer to give Denver some separation.\n\nMurray then blocked a shot and hit a jumper on the other end to seal the win.\n\nThe Nuggets remain without starters Will Barton, Gary Harris and Paul Millsap due to injuries. Juancho Hernangomez started despite being questionable with a strained abdomen. He finished with 12 points, one of seven Denver players to score in double figures.\n\nTIP-INS\n\nMavericks: G Dennis Smith Jr. sat out with a sprained right wrist. ... Carlisle and Wesley Matthews received technical fouls for arguing calls. ... G J.J. Barea returned from a sprained ankle and had 10 points. ... F DeAndre Jordan fouled out with 6:29 remaining. He had 11 points and 12 rebounds.\n\nNuggets: Murray picked up a technical in the first quarter for hanging on the rim and Malone another in the third when he argued a call on Jokic. ... The Nuggets outscored the Mavs 64-44 in the paint.\n\nMVP CHATTER\n\nJokic has taken his game to an MVP level. Just ask his coach.\n\n\"Nikola is showing everybody in the NBA ... he's a Most Valuable Player candidate,\" Malone said. \"Not just from a stats standpoint -- he does it every single night and in so many different ways. That's why he's a special player.\"\n\nJokic just shrugged it off.\n\n\"That's an individual thing,\" he said. \"If it happens, it happens.\"\n\nDONCIC EFFECT\n\nThe most impressive thing about Doncic through the early portion of the season? That's easy for Carlisle.\n\n\"Probably how consistently he makes half-court shots during shootaround,\" the coach cracked.\n\nUP NEXT\n\nMavericks: Second of a four-game trip will be Thursday at the Los Angeles Clippers.\n\nNuggets: Two straight on the road, beginning Saturday in Los Angeles against the Clippers.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995463.49734
}