{
  "game_id": "0022000307",
  "espn_id": "401267467",
  "date": "Jan 31, 2021",
  "matchup": "PHI @ IND",
  "headline": "76ers find finishing touch to rally past Pacers, 119-110",
  "body": "INDIANAPOLIS -- — Doc Rivers threw a changeup at the Indiana Pacers on Sunday night.\n\n\r\n                    It turned out to be the perfect call.\n\n\r\n                    With his team trailing by 16 early in the fourth quarter, the Philadelphia 76ers coach switched to a zone defense — throwing off the Pacers and fueling an incredible closing run that ended with the Sixers rallying for a 119-110 victory.\n\n\r\n                    “We were calling it our John Chaney matchup zone and it was great,” Rivers said, referring to the trailblazing Temple coach who died Friday. “What it did was stop their movement. You miss a couple 3s early in a zone in the NBA and it becomes tough all of a sudden.\"\n\n\r\n                    Indiana never figured it out or recovered — even with All-Star center Joel Embiid sitting out for Philadelphia because of a sore back.\n\n\r\n                    Instead, the 76ers outscored the Pacers 31-6 over the final eight minutes to earn their sixth win in seven games.\n\n\r\n                    Tobias Harris led Philadelphia with 27 points and eight rebounds. Furkan Korkmaz added 17 points, including the two biggest baskets of the game — a 17-footer with 2:30 to play that finally gave the 76ers the lead and a 19-footer on the ensuing possession to make it 109-106.\n\n\r\n                    But Harris thought this one was all about Philadelphia's surprise defense.\n\n\r\n                    “Probably five minutes and I’m not kidding,” Harris said when asked how much time the 76ers had spent talking about zone defense this season. “It was in preparation for another team. But it got us talking out there and defensively and that’s something we always say on defense. We’ve got to communicate more.”\n\n\r\n                    For the Pacers, it was a crushing blow.\n\n\r\n                    Malcolm Brogdon scored 25 points and Domantas Sabonis had 21 in a game they dominated for almost 3 1/2 quarters. Indiana seemed to be cruising when Aaron Holiday’s basket with 8:16 to play made it 104-88.\n\n\r\n                    But the Pacers only netted one more basket — and the 76ers took control.\n\n\r\n                    “It’s really about not getting stops. That’s the most frustrating thing,” Brogdon said. “I just think we didn’t get stops.”\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Ben Simmons had 21 points, seven assists, six rebounds and four steals. ... Dwight Howard had 11 points and 15 rebounds off the bench. ... Philadelphia was 8 of 26 on 3-pointers. ... Assistant coaches Dan Burke and Popeye Jones returned to Bankers Life Fieldhouse for the first time since Indiana's offseason coaching change. Burke and Jones worked on the staff of former coach Nate McMillan for several seasons.\n\n\r\n                    Pacers: Jeremy Lamb scored 12 points — his fifth straight game in double figures since returning from a torn anterior cruciate ligament in his left knee. ... Holiday scored a season-high 17 points and T.J. McConnell had nine points and eight assists against his former team. ... Sabonis had eight rebounds, only his second game this season without a double-double. ... The Pacers were 10 of 28 on 3s. They had won three straight in the series.\n\n\r\n                    LATE SCRATCH\n\n\r\n                    Embiid missed his fifth game of the season after landing hard on his back in Wednesday's victory over the Lakers. The 76ers star played through the injury and had 37 points and 11 rebounds in Friday's win over Minnesota. Rivers said Embiid was still sore from the hard landing.\n\n\r\n                    HONORED\n\n\r\n                    Indiana held a moment of silence before the game in honor of NBA reporter Sekou Smith, who died Wednesday from COVID-19. He was 48. Smith covered the Pacers from 2001-05 before moving on to NBA TV and NBA.com. Team officials also placed a framed photo at one of the few spots in the revamped press area.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Complete a three-game road trip Wednesday at Charlotte.\n\n\r\n                    Pacers: Look to extend a two-game winning streak against Memphis when the Grizzlies visit Tuesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997099.70431
}