{
  "game_id": "0022300653",
  "espn_id": "401585281",
  "date": "Jan 28, 2024",
  "matchup": "TOR @ ATL",
  "headline": "Saddiq Bey's last-second dunk gives Hawks 126-125 win over Raptors",
  "body": "ATLANTA -- — Saddiq Bey dunked in Trae Young's miss with 1.1 seconds left to lift the Atlanta Hawks to a 126-125 win over the Toronto Raptors on Sunday night.\n\n\r\n              It was the fifth straight loss was for the short-handed Raptors.\n\n\r\n              “We talked about it in the huddle,” Young said. “Just try to go create and go downhill, but we needed to crash because they were going to contest my shot. We were going to have a shot at a rebound and it worked out perfectly for us.”\n\n\r\n              The Raptors had taken a one-point lead when a turnover in the backcourt led to a dunk by Scottie Barnes with seven seconds remaining.\n\n\r\n              “When I turned it over, I knew I was going to get a chance to help my team,” Young said. “I felt bad. I was dumb for making a mistake at the end. I should have called timeout when I didn’t have anywhere to go. It is nobody’s fault but mine.”\n\n\r\n              Bey finished with a season-high 26 points and he also grabbed 13 rebounds. Young had 30 points and 12 assists as the Hawks overcame a night where they shot just 6 for 27 (22%) from 3.\n\n\r\n              Clint Capela finished with 19 points and 14 rebounds for Atlanta and Jalen Johnson had 17 points and 12 rebounds. \n\n\r\n              “I thought we were connected tonight,” said Hawks coach Quin Snyder, who saw his team break a four-game losing streak. “It is not going to happen every night, but that doesn’t mean we can’t strive for it for 48 minutes. That is our goal, to have that type of determination and perseverance when things don’t go our way.”\n\n\r\n              The Raptors were without three double-digit scorers in RJ Barrett (knee swelling , 19.2 ppg), Immanuel Quickley (quadriceps contusion, 15.5 ppg) and Jakob Poeltl (ankle sprain, 10.6 ppg).\n\n\r\n              The absence of the 7-foot-1 Poeltl was particularly felt early, as the Hawks had five dunks in the first quarter and attacked the lane regularly. Atlanta finished with a 76-52 advantage in points in the paint and outrebounded the Raptors 51-46.\n\n\r\n              Jordan Nwora had 24 points, nine rebounds and six assists off the bench for the Raptors in his third game since being acquired in a trade with the Pacers. He only scored three points in his first two games with the Raptors. \n\n\r\n              “When this situation arises (with three starters out), it is an opportunity for another player,” Raptors coach Darko Rajakovic said. “I look at it that way. We will try our best to compete in every game.”\n\n\r\n              Scottie Barnes had 24 points and eight assists for Toronto and Gary Trent Jr. added 16.\n\n\r\n              Hawks guard Dejounte Murray was ruled out with hamstring soreness shortly before tipoff. The former All-Star is averaging a career-high 21.2 points per game. He had started all 45 games prior to Sunday.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Visit the Bulls on Tuesday for the second of a six-game road trip.\n\n\r\n              Hawks: Host the Lakers on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995413.081302
}