{
  "game_id": "0022000555",
  "espn_id": "401267715",
  "date": "Mar 04, 2021",
  "matchup": "MEM vs. MIL",
  "headline": "Holiday' hits baseline jumper to lift Bucks past Grizzlies",
  "body": "MEMPHIS, Tenn. -- — With seconds remaining, no timeouts and down a point, the Milwaukee Bucks knew they had to push the pace.\n\n\r\n                    Jrue Holiday took care of the rest.\n\n\r\n                    Holiday’s 11-foot baseline jumper with two seconds remaining gave the Bucks a 112-111 victory over the Memphis Grizzlies on Thursday night in a game where the teams exchanged leads five times in the final minute.\n\n\r\n                    “I was the first one down the court, so … it was pretty much me and (Grizzlies forward) Dillon Brooks,” Holiday said. “I just took the opportunity. I thought I made a nice play and knocked down the shot.”\n\n\r\n                    Memphis rookie Desmond Bane had a final chance for the Grizzlies, but his 3-pointer hit the front of the rim, giving the Bucks their sixth victory in seven games.\n\n\r\n                    Giannis Antetokounmpo led the Bucks with 26 points, 11 rebounds and eight assists, and Khris Middleton added 22 points and 10 rebounds. Holiday and Pat Connaughton finished with 15 points each, both connecting on key baskets in the final minute.\n\n\r\n                    Ja Morant led Memphis with 35 points, 28 of them in the second half. Brooks finished with 23 points, and Jonas Valanciunas had 13 points and 12 rebounds.\n\n\r\n                    “I thought our guys were phenomenal. Offensive execution, defensive execution,” Memphis coach Taylor Jenkins said. “A couple of plays didn’t go for us, but I thought it was a great experience.” \n\n\r\n                    A 3-pointer from Connaughton – the only one of the second half for Milwaukee -- gave the Bucks a 108-107 lead with 39 seconds. With 25.1 seconds left, Brooks was given a layup for Memphis after Antetokounmpo was called for goal tending, giving Memphis a 109-108 lead with 25.1 second remaining. \n\n\r\n                    Middleton’s two free throws gave the lead back to Milwaukee, but Morant answered on a drive with 7.3 seconds left, setting the stage for Holiday’s winner from the left baseline 5 seconds later.\n\n\r\n                    “He went into attack, got to a great spot and a great look. Huge shot,” Bucks coach Mike Budenholzer said about Holiday’s shot. “I think he’s a big-time player. \n\n\r\n                    A pestering Milwaukee defense caused shooting problems for Memphis in the first quarter as the Grizzlies stayed below 25% from the floor. A 15-point Bucks lead in the quarter, extended to 18 in the second as Milwaukee continued shooting at a better-than-50% clip.\n\n\r\n                    Meanwhile, Valanciunas and Morant, Memphis’ leading scorers were a combined 1 of 13 to start the game.\n\n\r\n                    Memphis was able to pick up the shooting pace enough to bring it to single-digit deficit before the Bucks carried a 61-51 lead at the break.\n\n\r\n                    Still, despite the shooting woes, Memphis made a third-quarter run to pull even at 84 heading into the fourth quarter. Morant got untracked to score 16 in the period.\n\n\r\n                    “I feel like we’ve got a lot of guys that’s capable of doing a lot on the floor,” Morant said. “I thought we showed our hustle, our dog, our fight.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Final contest of a seven-game stretch against the Western Conference. Milwaukee finishes 6-1 in the run. … With a dunk near the 4-minute mark of the first quarter, Antetokounmpo passed Sidney Moncrief (11,594) for third place on Milwaukee’s career scoring list.\n\n\r\n                    Grizzlies: The one-point margin ended a stretch of 18 straight games where Memphis games were decided by at least nine points. That matched the longest in NBA history. …Grayson Allen missed his third game under concussion protocol. … Morant started the game 0 for 8, missing his first six shots from beyond the arc.\n\n\r\n                    WITH THE FIRST PICK….\n\n\r\n                    After the game, Antetokounmpo was surprised to learn he was the first pick by LeBron James in the draft for the All-Star game. “Do I get a hat? Do I get something?” he asked. “Do I have to wear the suit now?”\n\n\r\n                    Then he added: “It’s a compliment.”\n\n\r\n                    NICKNAME FOR MORANT\n\n\r\n                    Antetokounmpo said if Morant doesn’t have a nickname yet, he’s got one for the second-year guard. “He’s the Matrix. Have you ever watched the movie “Matrix”? That’s him. He was falling down on that that last layup. He’s tough.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: At New York on Thursday, March 11\n\n\r\n                    Grizzlies: Host Washington on Wednesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996957.775311
}