{
  "game_id": "0022300043",
  "espn_id": "401584131",
  "date": "Nov 24, 2023",
  "matchup": "ORL vs. BOS",
  "headline": "Moritz Wagner scores 27 to lead Magic over Celtics 113-96 for 6th straight win",
  "body": "ORLANDO, Fla. -- — Moritz Wagner scored 27 points and the Orlando Magic beat the Boston Celtics 113-96 on Friday for their sixth straight win, throwing the Eastern Conference's Group C up for grabs in the NBA's inaugural In-Season Tournament.\n\n\r\n              Paolo Banchero had 23 points and seven rebounds for Orlando, which finished group play at 3-1 after losing its first tournament game by 20 points at Brooklyn on Nov. 14.\n\n\r\n              “I think the Brooklyn game, it was kind of frustrating because it was like we didn't realize it was a tournament game and we felt like we just handed them the game,” Banchero said. “These last three we’ve completely flipped it and took it a lot more seriously.”\n\n\r\n              With Boston and Brooklyn scheduled to complete pool play on Tuesday night, the Magic can qualify for the knockout rounds (final eight) either as the Group C winner or as a wild card, depending on game results and point differentials. Orlando finished with a plus-22 differential. The Nets are currently at plus-8 and the Celtics are at 0.\n\n\r\n              Jayson Tatum led Boston with 26 points. Jaylen Brown added 18, but made just 2 of 16 shots after scoring 12 points in the first 10 minutes. The Celtics, who came into the game with an NBA-best 12-3 record, made only 7 of 29 3-point shots and were outrebounded 48-31.\n\n\r\n              “You're definitely frustrated when you're not making shots, but at the end of the day it goes back to two things: transition (defense) and the offensive rebounds,\" Boson coach Joe Mazzulla said.\n\n\r\n              Moritz Wagner, the older and bigger brother of Magic starter Franz Wagner, scored 10 straight Magic points while they were pulling away to a double-digit lead in the fourth quarter.\n\n\r\n              “It’s a game, it’s not controllable. Sometimes it comes to you and then you just take advantage of it,” said Moritz Wagner, whose season-high point total came in 24 minutes. “There’s something really enjoyable about that process. You can get lost in that and just play, and it’s going to come back around.”\n\n\r\n              Jalen Suggs hit two of the Magic’s four 3-pointers on a 17-0 run after Boston had taken a 62-50 lead early in the third quarter. The Celtics missed all eight shots during the game-changing run and went scoreless for 4:42.\n\n\r\n              Boston center Kristaps Porzingis left the game in the third quarter with tightness in his left calf after scoring nine points and taking down four rebounds. The Celtics also played without Jrue Holiday, who missed his first game of the season with a sprained right ankle. \n\n\r\n              “Obviously we’re a much better team when everybody’s healthy. But throughout the course of the season there’s going to be nights where you know certain guys are out,” Tatum said. “We can’t use that as an excuse for why we didn’t win the game. We’ve still got to figure out a way to get the job done.”\n\n\r\n              Moritz Wagner and Cole Anthony (16 points, six assists) led the Magic bench to 57 points, one fewer than the bench had accumulated in Wednesday night's win over Denver.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Atlanta on Sunday night.\n\n\r\n              Magic: Host Charlotte on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995737.949025
}