{
  "game_id": "0022201021",
  "espn_id": "401469176",
  "date": "Mar 13, 2023",
  "matchup": "ATL vs. MIN",
  "headline": "Edwards scores 32, Timberwolves beat Hawks 136-115",
  "body": "ATLANTA -- — Anthony Edwards scored 32 points in his hometown, Kyle Anderson had his third career triple-double and the Minnesota Timberwolves cruised to a 136-115 victory over the Atlanta Hawks on Monday night.\n\n\r\n              “It’s the first time I’ve beaten Atlanta, and it’s in Atlanta, so I’m super happy,” Edwards said. “I’m at a loss for words.”\n\n\r\n              Trae Young finished with 41 points for the Hawks, who dropped to 3-5 under new coach Quin Snyder and have lost four of six. Atlanta went 4 for 22 beyond the arc and handed out 17 assists compared to 39 for Minnesota.\n\n\r\n              Edwards, a former No. 1 overall draft pick who starred at Georgia and grew up in Atlanta, dazzled with several dunks, one of which put the Timberwolves up 91-67 midway through the third quarter. The lead soon swelled to a game-high 28 on a layup by Mike Conley, who finished with 21 points.\n\n\r\n              Anderson scored 12 of his 14 points in the third and had 12 assists and 10 rebounds for Minnesota, which snapped a two-game skid. Jaden McDaniels scored 19 points.\n\n\r\n              Edwards praised Anderson's awareness.\n\n\r\n              “Every time that they made a run, he’d do something,” Edwards said. “He just knows the game. He makes it look so easy. Basketball, he knows the ins and outs.”\n\n\r\n              Atlanta went on a 19-7 run to trim the lead to 13 with 7 minutes to go, but Edwards hit an alley-oop layup to push the lead back to 17 at the 6:19 mark, and the Hawks never closed within single digits.\n\n\r\n              Edwards had a pair of 3s late in the fourth quarter to close out his third straight 30-point game.\n\n\r\n              “They kept making runs,” he said. “In the third quarter they made a run at the end and the beginning of the fourth they made a run, so I knew I was going to have to check back in.” \n\n\r\n              This matchup of teams that entered at 34-34 was all but decided early as the Timberwolves went on a 19-4 run to take a 31-17 lead in the first on Edwards’ layup at the 3:33 mark. Due in part to six Atlanta turnovers, Minnesota had a 13-0 advantage in fast-break points that early in the game. The Hawks gave up 40 points in the first quarter and trailed 51-31 on Jordan McLaughlin’s 3 early in the second.\n\n\r\n              “We started the game out wrong,” Young said. “I think that just set the tone. I’ve got to do better to start the game.”\n\n\r\n              The Timberwolves led 76-52 at halftime after the Hawks let the shot clock expire on their last offensive possession and Edwards hit two of three free throws with 1 second to go. \n\n\r\n              Edwards said he had \"no idea\" how many family members and friends came to watch him play. He was grateful to put on a good show and come out with a win.\n\n\r\n              “It’s dope. I play for the Minnesota Timberwolves and to come back to Atlanta and they still cheer for me,” the All-Star guard said. “I mean I was getting booed at the free throw line, but other than that it was dope to be around a lot of my family.\"\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Rudy Gobert was a game-time decision with a left ankle sprain. He entered averaging 16.7 points on 66.1% shooting, 11.2 rebounds and 1.2 blocks since the All-Star break. He finished with 14 points, eight rebounds and three blocks. ... Reserve C Naz Reid missed the game with left calf soreness. ... Reserve G Austin Rivers was sidelined with back spasms.\n\n\r\n              Hawks: Dropped to 2-7 when giving up at least 70 points in the first half. ... Reserve C Onyeka Okongwu had 16 points and 14 rebounds. ... Young was coming off his 10th game this season with at least 30 points and 10 assists, most in the Eastern Conference. He finished with seven assists. ... Atlanta fell to 24-9 vs. Minnesota at home. The Hawks had won five straight over the T-Wolves.\n\n\r\n              ON THE MEND\n\n\r\n              Timberwolves C Karl-Anthony Towns, out since Nov. 28 with a right calf strain, wore a practice uniform and took some shots at the end of the morning shootaround but there is still no timetable for his return, coach Chris Finch said. Finch said Towns has been facing a defender in drills but has yet to participate in full team activities.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host Boston on Wednesday.\n\n\r\n              Hawks: Host Golden State on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994812.343352
}