{
  "game_id": "0022200177",
  "espn_id": "401468332",
  "date": "Nov 11, 2022",
  "matchup": "ORL vs. PHX",
  "headline": "Carter, Ross lead Magic to 114-97 win over Suns",
  "body": "ORLANDO, Fla. -- — Wendell Carter Jr. had 20 points and 10 rebounds, and the Orlando Magic beat the Phoenix Suns 114-97 on Friday night.\n\n\r\n              Terrence Ross scored 12 of his 14 points in the fourth quarter as Orlando earned a second straight win for the first time this season.\n\n\r\n              “We’ve been locked in and dialed in,” Ross said. “Even with all the injuries we’ve had, we’ve been playing together. It's a next-man-up mentality.”\n\n\r\n              Franz Wagner had 17 points, Jalen Suggs scored 16 and Bol Bol collected a career-high 15 rebounds.\n\n\r\n              Cameron Payne scored 22 points for the Suns, who played a second straight game without injured guard Chris Paul. Devin Booker had 17 points on 6-of-19 shooting.\n\n\r\n              Phoenix shot 40% overall and made just 13 of 42 3-point shots.\n\n\r\n              “You can’t win an NBA game if you can’t put the ball the basket. We just had a tough time scoring the ball,” Suns coach Monty Williams said.\n\n\r\n              Playing again without high-scoring rookie Paolo Banchero, the Magic led by as many as 21 points in the second half.\n\n\r\n              Ross went 4 for 5 from the field in the fourth. He said the Magic's strategy of driving the ball inside to Carter and Wagner is starting to pay off.\n\n\r\n              “It puts a lot of pressure on teams,” Ross said. \"We’re trying to put the ball in the paint and make everybody collapse, and I think it’s been beating teams down. That style of play is tough to guard.\n\n\r\n              \"We don’t have to go out there and make home run plays, or make crazy shots that get us back. We just need to establish the way we play, play with purpose, and stay on course. That’s what’s helping us. Once we start playing that way, these wins will start to snowball.\"\n\n\r\n              The Suns made only four of their first 19 3-point shots and fell behind by 11 points before Booker and Payne shot them back into the game late in the first half. But they never led in the second half.\n\n\r\n              “Wagner kept getting into the paint, making everybody converge defensively,” Payne said. “Wendell played well. They have a lot of length out there, man. It was a tough game.”\n\n\r\n              Chuma Okeke, Caleb Houstan and Mo Bamba made 3-pointers in a span of 71 seconds late in the third quarter to push Orlando’s lead up to 14.\n\n\r\n              TIP-INS\n\n\r\n              Suns: Paul was sidelined by a sore right heel. ... G Landry Shamet did not play. He is going through concussion protocol.\n\n\r\n              Magic: Banchero missed a second straight game with a sprained ankle. . . . The Magic are shooting 53.1% over the last five games. . . . Orlando’s last two-game win streak was March 20 and 22 against Oklahoma City and Golden State. The Magic did not win three in a row last season.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Miami on Monday night.\n\n\r\n              Magic: Home against Charlotte on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994789.1362078
}