{
  "game_id": "0021900304",
  "espn_id": "401160946",
  "date": "Dec 03, 2019",
  "matchup": "LAL @ DEN",
  "headline": "James, Davis each score 25, Lakers beat Nuggets 105-96",
  "body": "DENVER --  LeBron James has been compared to Michael Jordan for his entire career, though on Tuesday night it was Anthony Davis who emulated the Hall of Famer.\n\nDavis, ailing from flu-like symptoms, took an IV at halftime and then scored 13 of his 25 points in the third quarter to lead the Los Angeles Lakers to a 105-96 victory over the Denver Nuggets.\n\nJames also had 25 points, nine assists and a crucial dunk off a miss late in the fourth quarter to clinch a matchup of the top two teams in the Western Conference.\n\nJordan's legend grew when he played through the flu in Game 5 of the 1997 NBA Finals, leading the Chicago Bulls to the win and eventually their fifth title in seven years. Tuesday's game was just the 20th of the season for the Lakers but Davis' effort still impressed his coach.\n\n\"For him to play through illness and have that kind of performance was something special,\" coach Frank Vogel said.\n\nDavis missed the morning film session and his status for the game was questionable until before tip. He showed no effects of the illness, scoring most of the Lakers 24 points in the third quarter. He also had 10 rebounds and helped to hold Nuggets center Nikola Jokic to 13 points.\n\nHe played nearly 37 minutes after trying to recover for most of the day.\n\n\"Sleep. That's really it. Sleep and a couple of medicine things here and there,\" he said of the treatment he took. \"The IV at halftime was trying a way to keep going.\"\n\nJamal Murray scored 22 points and Paul Millsap had 21 points and eight rebounds. Jokic added eight assists but wasn't the only one struggling on offense. Denver shot 40.7% and failed to reach 100 points for the second straight game.\n\n\"We got the looks we wanted but just didn't hit some shots,\" Murray said.\n\nBoth teams were coming off losses that ended long winning streaks, but it was Los Angeles that bounced back behind James and Davis and a 56-35 advantage in rebounding. The Nuggets nearly came back in the final minutes.\n\nThe Lakers led by 10 midway through the fourth before Denver rallied to get within a point with 2:23 left. But the Nuggets didn't score again. The Lakers hit three free throws and James slammed home Davis' missed layup with 1:15 remaining.\n\n\"They're one of the top teams to come back from double-digit deficits in the second half,\" James said. \"We knew they were going to make a run. A very good team at home and we just kept our composure.\"\n\nDenver has lost two in a row for the second time this season and fell to 8-3 at home.\n\n\"They are a better team than us right now,\" Millsap said. \"We didn't bring our best game but we were still in the game. If we could have knocked those shots down it would have been a totally different ballgame.\"\n\nTIP-INS\n\nLakers: Vogel was chosen as Western Conference coach of the month for games played in October and November. The Lakers 17-2 record tied for the best 19-game start in franchise history. ... The Lakers had two goaltending calls in the first quarter.\n\nNuggets: Jokic had more turnovers (five) than made baskets (four). ... Denver Broncos linebacker and Super Bowl 50 MVP Von Miller as well as former Broncos and Indianapolis quarterback Peyton Manning were in attendance.\n\nMUTUAL ADMIRATION SOCIETY\n\nNuggets coach Michael Malone was an assistant in Cleveland during James' first stint with the Cavaliers and praised the star's sustained excellence.\n\n\"What he's doing at his age, I mean, who is surprised?\" Malone said before the game. \"...LeBron is incredible and that's why he'll go down as one of he best players to ever play the game.\"\n\nVogel was also complimentary of Jokic.\n\n\"There's no one like the Joker I think that's every played the game,\" he said.\n\nSICK BAY\n\nDavis wasn't the only Lakers player dealing with a bug ahead of the matchup of the top teams in the conference.\n\n\"We have several guys with flu-like symptoms and we had them drink a lot of fluid,\" Vogel said.\n\nUP NEXT\n\nLakers: At Utah on Wednesday night.\n\nNuggets: Begin a four-game road trip in New York on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996022.5527968
}