{
  "game_id": "0022300008",
  "espn_id": "401584096",
  "date": "Nov 10, 2023",
  "matchup": "DET vs. PHI",
  "headline": "Joel Embiid has 33 points and 16 rebounds, 76ers beat Pistons 114-106 for 7th straight win",
  "body": "DETROIT -- — Joel Embiid had 33 points and 16 rebounds and the Philadelphia 76ers won their seventh straight game and handed Detroit its seventh loss in a row, beating the Pistons 114-106 on Friday night in an NBA In-Season Tournament opener.\n\n\r\n              Tyrese Maxey had 29 points, 10 assists and zero turnovers for the 76ers, undefeated since an opening loss at Milwaukee. Former Piston Tobias Harris had 24 points, and the starters scored 104 of the 76ers' points.\n\n\r\n              “We can't be a one-man team or a two-man team -- we need to get production from Tobias, (De'Anthony) Melton and Kelly (Oubre, Jr.),” 76erss coach Nick Nurse said. “We know there are times when teams are going to have to put two guys on Joel or two guys on Tyrese, and we've got to be able to take advantage of those situations.”\n\n\r\n              Killian Hayes led the Pistons with 23 points and Cade Cunningham added 21 for the short-handed Pistons, who lost Jalen Duren to an ankle injury.\n\n\r\n              “Anytime a guy can't finish the game, it is a concern,” Pistons coach Monty Williams said. “But we can't use injuries as an excuse.” \n\n\r\n              Detroit allowed 41 free-throw attempts, including 19 for Embiid.\n\n\r\n              “Joel is tough enough to guard — when he's waving his arms around and hitting people, that's not a shot,” Williams said. “That's not what beat us, though. We just made too many big mistakes.”\n\n\r\n              The 76ers got a brief injury scare in the third quarter when Cunningham lost his footing on the gray court and slid into Embiid's legs as he was taking a jumper. Embiid got up slowly and limped off, but was able to return after a timeout.\n\n\r\n              Patrick Beverly missed the second half with neck soreness. Nurse wasn't sure if he would miss any time.\n\n\r\n              Detroit led 71-68 late in the third, but the 76ers finished the period on a 15-6 run to go ahead 83-77. Philadelphia outscored the Pistons 35-21 in the quarter, thanks to 16 points from Embiid.\n\n\r\n              “I thought they played the same defense in the second as they did in the third, but they were a little more physical,” Williams said. “We backed off a little — we were trying to run our stuff from halfcourt and that got us into a lot of late-clock situations.”\n\n\r\n              Philadelphia scored the first five points of the fourth, moving the lead to 11, and were up by 17 down the stretch.\n\n\r\n              The Pistons led 33-21 at the end of the first quarter and by as many as 16 in the second.\n\n\r\n              “I thought we were about a half-step slow at the start of the game and they were about two steps fast,” Nurse said. “They were kicking our backsides in every phase of the game, but we hung in there and played a lot better in the second half.”\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Indiana on Monday night.\n\n\r\n              Pistons: At Chicago on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995793.501636
}