{
  "game_id": "0021900970",
  "espn_id": "401161612",
  "date": "Mar 11, 2020",
  "matchup": "CHA @ MIA",
  "headline": "Hornets top Heat 109-98, as NBA shutdown looms",
  "body": "MIAMI --  Charlotte coach James Borrego thought it would be a rallying cry of sorts for the Hornets to not let the Miami Heat clinch a playoff spot on their watch.\n\nHe was apparently right.\n\nAnd by night's end, that hardly seemed to matter.\n\nDevonte' Graham scored 30 points, Caleb Martin scored 19 and the Hornets shook off an early 20-point deficit to beat the Heat 109-98 on Wednesday night -- keeping Miami's magic number for clinching a postseason berth at one.\n\nThat is, if there even is a postseason. The NBA suspended the season indefinitely after Wednesday's games after a Utah Jazz player had a presumptive positive test for the coronavirus, or COVID-19. The player is Rudy Gobert, according to a person who spoke to The Associated Press on condition of anonymity because neither the league nor the team had confirmed it publicly.\n\nP.J. Washington scored 17 and Miles Bridges scored 16 for the Hornets, who have won five of their last seven road games in a stretch that came immediately after they dropped eight consecutive games played away from Charlotte. The Hornets were down 40-20 late in the first quarter, then scored 39 of the game's next 50 points.\n\n\"We've been here before,\" Borrego said. \"We didn't panic. After the first quarter, we made a few adjustments. We started to play more aggressively. Just a fantastic win.\"\n\nKendrick Nunn scored 24 for the Heat, who played without Jimmy Butler because of a toe injury.\n\nMiami made 15 of its first 16 shots and looked poised to run away with things -- but that start was followed immediately by the Heat missing 17 of their next 22 shots. It wound up becoming the second time the Heat lost a game this season after leading by at least 20 points; the other was a 22-point loss at Cleveland last month.\n\nDerrick Jones Jr. had 23 points, Bam Adebayo had 21 points and 10 rebounds and Duncan Robinson scored 12 for the Heat.\n\nBut amid the reality that the game is shutting down until further notice, the talk afterward had very little to do with the game.\n\n\"We just have to sit back and observe and monitor the situation,\" Heat coach Erik Spoelstra said.\n\nTIP-INS\n\nHornets: Charlotte is 23-42. ... The Hornets were 17 for 34 from 3-point range. ... Charlotte was without Terry Rozier, who missed the game with an illness.\n\nHeat: Miami is 41-24. ... Robinson was 3 for 13, all from 3-point range. ... The Heat got to the foul line only six times in the game, compared with 22 for Charlotte.\n\nSILENCE\n\nThere was no announcement in the arena about the looming NBA suspension of play, but in a departure from the norm the Heat also did not announce anything about the next home game. It would have been Friday against New York.\n\nUNLUCKY 13\n\nThis was the 13th time this season that Miami lost a game in which it led by at least 10 points at some point.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996042.809112
}