{
  "game_id": "0021400055",
  "espn_id": "400578347",
  "date": "Nov 04, 2014",
  "matchup": "POR vs. CLE",
  "headline": "Damian Lillard scores 27 as Blazers stifle LeBron James, Cavs",
  "body": "PORTLAND, Ore. -- Trail Blazers coach Terry Stotts took it upon himself to address Damian Lillard's night.\n\"You don't have to ask what's wrong with Damian anymore,\" Stotts said. \"Actually, you don't ever have to ask.\"\nThat question was better asked about LeBron James and the Cleveland Cavaliers on Tuesday night.\nLillard had a breakthrough with 27 points and Portland regained last season's form with a 101-82 victory.\n\nThe Blazers, who snapped a brief two-game losing streak, held James to just 11 points.\nLillard had been nursing an abdominal strain but he started nonetheless and collected 15 points by halftime -- after averaging just 13.7 points on 11-for-41 shooting in the first three games. The All-Star averaged 20.7 points last season.\n\"It's the same game that I have been playing,\" Lillard explained. \"The only difference was the shots went in.\"\nThe Cavaliers, playing the first of a three-game Western Conference road swing, hadn't played since a 114-108 overtime victory at Chicago on Friday. They started fast but were doomed by poor-shooting nights by James (4 of 12) and Kyrie Irving (3 of 17).\n\"We have to understand what it takes to win. It's going to be a long process. There's been a lot of losing basketball around here for a few years,\" James said.\nWesley Matthews finished with 21 points for Portland.\n\"It felt really good to get back into the swing of things,\" Matthews said, \"and back to us.\"\nKevin Love, who grew up in Oregon and played at Lake Oswego High School south of Portland, had his third straight double-double for Cleveland (1-2) with 22 points and 10 rebounds. Love and LaMarcus Aldridge -- who finished with 16 points -- battled much of the way.\nThe Cavaliers made their first 10 shots and James hit consecutive 3-pointers to put Cleveland up 27-20 early. The Blazers answered with a 9-0 run.\nLillard hit a 3-pointer and a pair of free throws and Portland led 55-50 at the break. He opened the second half with a dunk.\nPortland stretched the lead to 67-54 on Aldridge's layup and led 76-69 going into the fourth. The Blazers led by as many as 19 points in the final period.\nJames urged patience.\n\"It's like building a car from scratch. I've done that before,\" he said. \"I hated the process, it got on my nerves. I sent it back to get repainted 100 times. But once it was completely finished I was excited about it.\"\nLillard finished with five 3-pointers on 10 attempts and was a perfect 10 of 10 from the free throw line. That tied his career mark for most free throws in a game without a miss.\n\"I knew that eventually the ball would go in,\" he said. \"I just had to stick with it.\"\nTIP-INS\nCavaliers: Coach David Blatt, who had a long coaching career overseas before he arrived in Cleveland, recalled how Blazers coach Terry Stotts once visited him in Istanbul to watch him work. Stotts was between jobs and studying different teams and coaches. \"It was mutually beneficial,\" Blatt said. ... Love has scored 20-plus points in his last seven games in Portland.\nTrail Blazers: F Joel Freeland was ruled out of his second straight game because of a left foot injury. ... The Blazers held a moment of silence before the game for former team president Herman Sarkowski, who stepped in with a last-minute investment that helped secure Portland's bid for the team in 1970. Sarkowski died Sunday in Seattle at age 89. ... Aldridge has a 13-3 advantage in games against Love.\nDEFENDING JAMES: While Aldridge and Love matched up, several players were assigned to James, including Matthews and Nicolas Batum. \"He's arguably the best player in the game and he'll go down as one of the greatest to ever play, so you just try to make everything difficult and tough for him,\" Matthews said.\nEARNEST ASSESSMENT: \"I just don't think we brought it tonight to be honest,\" Blatt said. \"I don't think we brought intensity. I don't think we brought a kind of mindset to defend, and that caught up with us.\"\nUP NEXT\nCavaliers: Visit Utah on Wednesday.\nTrail Blazers: Host Dallas on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764992116.9695082
}