{
  "game_id": "0022000817",
  "espn_id": "401320524",
  "date": "Apr 13, 2021",
  "matchup": "BKN @ MIN",
  "headline": "Durant, Nets beat Timberwolves 127-97 in rescheduled game",
  "body": "MINNEAPOLIS -- — The show in Minnesota went on, the day after raw emotion from a fatal police shooting of a local Black man was too strong to play. \n\n\r\n                    Kevin Durant and the Brooklyn Nets made quick work of the Timberwolves, even if focus was harder to come by than usual.\n\n\r\n                    Durant scored 31 points on 11-for-15 shooting in his most productive performance in 2 1/2 months, as the Brooklyn Nets blew out the Minnesota Timberwolves 127-97 on Tuesday afternoon.\n\n\r\n                    “I felt like my wind and legs are getting up under me, each and every minute I’m playing,” said Durant, who missed 23 games with a strained hamstring until returning last week.\n\n\r\n                    The game was rescheduled from the previous night, out of sensitivity to the community following the traffic-stop death of 20-year-old Daunte Wright. Players from both teams wore black warmup shirts that read, \"With liberty and justice for all,” with the last two words in all-caps for extra emphasis, and a moment of silence was held before tip-off.\n\n\r\n                    “All we can do is be here for each other physically, emotionally try to comprehend what guys are going through,” Timberwolves guard D’Angelo Russell said, adding: “I encourage everybody to go out there and do what you can physically do to make things better, not just speak about it.”\n\n\r\n                    Anthony Edwards had 27 points and eight rebounds for the Timberwolves, who played without Karl-Anthony Towns on the one-year anniversary of his mother's death from COVID-19 complications. Towns chose to sit out and spend the time with his family.\n\n\r\n                    Joe Harris pitched in 23 points for the Nets, who had 31 assists on 46 made baskets. Missing James Harden (strained hamstring), Kyrie Irving (personal reasons) and LaMarcus Aldridge (non-COVID-19 illness), the Nets were in command from the jump and ahead by 23 points before the midpoint of the second quarter. They built their lead as big as 45 points early in the fourth quarter.\n\n\r\n                    With Harden, Irving and Aldridge all out, Nash put Chris Chiozza and Nicolas Claxton in the starting lineup for the first time, the 17th and 18th different players to appear in the first five for the Nets in just 54 games this season. They have used 32 different combinations.\n\n\r\n                    “I’m really proud of the guys. We’ve had a lot thrown at us this year,” coach Steve Nash said.\n\n\r\n                    Durant played 27 minutes and had his highest points total since Jan. 31.\n\n\r\n                    “We're trying to find that balance, and at least he had a good game and got some minutes on his legs,” Nash said.\n\n\r\n                    NEXT TEST\n\n\r\n                    The Nets would prefer not to play Durant in back-to-back games, so the postponement will force them to make a decision on his status for Wednesday against Eastern Conference co-leader Philadelphia. Pursuing the No. 1 seed for the playoffs might not be as important as keeping their star forward fresh.\n\n\r\n                    “I want to play just to get back in the swing of things, more so than pinpointing that matchup. We want to get everybody healthy and acclimated to what we’re doing out there, and I think that’s just as important rather than circling the calendar,” Durant said.\n\n\r\n                    Harden won't be ready to play the Sixers. Nash had no update on Irving's status.\n\n\r\n                    JUST A GAME\n\n\r\n                    Several Timberwolves players have been outspoken on issues of racial justice over the past year, with the death of George Floyd literally hitting close to home — about three miles from Target Center. The trial of Derek Chauvin, the Minneapolis police officer whose knee was pressed on Floyd's neck for more than nine minutes, has been taking place about eight blocks from the arena.\n\n\r\n                    “I can’t imagine what it’s like to be African American, to be an African American parent,” Nash said. “It’s unacceptable, and it’s devastating to put yourself in their shoes.\"\n\n\r\n                    Said Timberwolves guard Josh Okogie: “When nothing changes and the same thing happens, that’s I think for me the most difficult part.”\n\n\r\n                    HEAVY HEARTS\n\n\r\n                    The Timberwolves have also carried the burden of the loss of one of their biggest fans, Jackie Cruz-Towns, the mother of their star center who died at age 58 last year. She fought COVID-19 for more than a month.\n\n\r\n                    EMPTY ARENA, AGAIN\n\n\r\n                    With the day-of rescheduling and the afternoon tipoff, the game was played with the gates closed. The Timberwolves have had only two home games in front of fans, with a 3,000-person capacity allowance that started on April 5 as part of the state’s relaxation of some COVID-19 restrictions.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Chiozza hurt his right hand in the first half and did not return. He had four points and five assists in 14 minutes. ... DeAndre Jordan, who was a healthy scratch the past five games, had 13 points and seven rebounds.\n\n\r\n                    Timberwolves: Russell scored 15 points in 20 minutes against his former team. ... Naz Reid started for the 14th time this season in place of Towns. He had two points in 16 minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Visit Philadelphia on Wednesday. They split the first two games against the Sixers.\n\n\r\n                    Timberwolves: Host Milwaukee on Wednesday and finish the homestand on Friday against Miami.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997480.179709
}