{
  "game_id": "0021600585",
  "espn_id": "400900006",
  "date": "Jan 11, 2017",
  "matchup": "POR vs. CLE",
  "headline": "McCollum has 27 and the Blazers beat the Cavaliers 102-86",
  "body": "PORTLAND, Ore. -- That 24-hour travel odyssey hardly took a toll on the Portland Trail Blazers.\nC.J. McCollum scored 27 points and the Trail Blazers shook off any fatigue caused by weather-related delays to beat the defending NBA champion Cleveland Cavaliers 102-86 on Wednesday night.\nAllen Crabbe added 24 points off the bench for the Blazers, who have won four straight home games against the Cavs.\nPortland, playing the second of back-to-back games, led by as many as 24. A major snowstorm in the city Tuesday night sent the team from Los Angeles to Seattle and then finally to Portland.\n\"When we got up this morning and we were leaving Seattle, and we got on the plane and then the bus, there was just good energy around the team,\" star guard Damian Lillard said. \"We were laughing and we were joking and I think we were just tired so we were goofy and whatever. But before the game we huddled up and I said, `We're not tired. It's just mental, and this is a game that we've got to go out and get.\"\nLeBron James had 20 points and 11 rebounds for Cleveland (28-10).\nMcCollum, who scored 21 in the second half, hit a 3-pointer that put Portland up 85-69 with just under nine minutes left, then gestured for the crowd to stand as the Cavaliers called a timeout.\nMcCollum has had seven straight games with 25 points or more.\nA snowstorm that dumped as much as 14 inches on parts of Portland caused travel problems for both teams late Tuesday.\nThe Cavaliers, who lost to the Utah Jazz 100-92 on Tuesday night, were delayed getting to Portland but finally arrived about 3 a.m. Wednesday.\nThe Trail Blazers beat the Lakers in Los Angeles 108-87 on Tuesday night. The team's flight was sent to Seattle, and players spent the night there. They flew into Portland by midday Wednesday and stayed in a hotel to rest until game time.\nThe Cavaliers got a scare with 1:21 left in the first quarter when Kevin Love collided slightly with Al-Farouq Aminu and fell to the ground, clutching his left knee. Love walked off the court under his own power and returned a short time later.\nThe Cavs finished with just 14 assists -- compared to 16 turnovers. They shot 34 percent.\n\"You're not going to have assists if you're not making shots. If you shoot 34 percent, how many assists can you really get?\" coach Tyronn Lue said. \"We need to do a better job of making shots but also a better job around the basket and in the paint. When we get in the paint, instead of taking tough shots we need to kick it out for open shots. We have to read and play the game the right way.\"\nPortland led 49-41 at halftime, with Crabbe's 18 points leading all scorers.\nThe storm, which started Tuesday evening, had dumped the most snow recorded in the city since 2008 by midnight, according to the National Weather Service. When Wednesday's total is included, it might be the city's biggest snowfall of the 21st century.\nGov. Kate Brown and Portland Mayor Ted Wheeler both issued a state of emergency.\nThe Blazers encouraged fans to use their best judgment when deciding whether to attend the game, and the crowd to see the defending NBA champions was surprisingly large.\nTIP-INS\nCavaliers: Lue was asked before the game how he felt James has been getting calls this season. \"Next Question,\" Lue said. ... With his second assist of the game, James passed Tim Hardaway for 15th on NBA's career list with 7,095.\nTrail Blazers: When the Blazers played the Cavaliers on Nov. 23, Love finished with 40 points after scoring 34 in the first quarter. Before this matchup, Portland coach Terry Stotts half-joked: \"If we hold Kevin under 20 in the first quarter, that'll be a good start.\" Love had eight points in the first.\nMILESTONE\nIt was Stotts' 200th victory with Portland. He became the fourth coach in team history to reach the mark.\n\"I'm very proud of it,\" Stotts said. \"A lot of players and coaches went into it. If you had told me in 2012 that I'd have 200 wins, I don't know if I'd have believed you.\"\nKORVER'S ACCLIMATION\nKyle Korver made his Cavs debut against Utah, playing 17 minutes and scoring two points. Against the Blazers, he had two points in 25 minutes and was 1 for 5 from the field.\n\"We're going to try to do some things that he's good at, ways to cut and get him open,\" Lue said. \"But we have to find the right combination of guys on the floor with him. It's going to be some work for me to try to figure out, but right now, just play the game.\"\nUP NEXT\nCavaliers: Visit the Sacramento Kings on Friday night for the fifth stop on their six-game road trip.\nTrail Blazers: Host the Orlando Magic on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995659.577963
}