{
  "game_id": "401809783",
  "espn_id": "401809783",
  "date": "Nov 14, 2025",
  "matchup": "DET vs PHI",
  "headline": "Short-handed Pistons win ninth straight game, beating 76ers 114-105",
  "body": "DETROIT -- — Javonte Green scored 21 points and Daniss Jenkins added 19 as the short-handed Detroit Pistons won their ninth straight game, beating the Philadelphia 76ers 114-105 in an NBA Cup game on Friday night.\n\n\r\n              The Pistons are on their longest winning streak since a 10-game run in 2008 despite playing the last two games without several key players. Cade Cunningham (hip), Tobias Harris (ankle), Ausar Thompson (ankle) and Jalen Duren (ankle) were among the players on the sidelines against Philadelphia. \n\n\r\n              Duncan Robinson scored 15 and Isaiah Stewart and Caris LeVert each had 14.\n\n\r\n              Tyrese Maxey had 31 to lead the Sixers, who played without Joel Embiid (knee).\n\n\r\n              Detroit trailed by five until Jenkins hit a halfcourt 3-pointer at the third-quarter buzzer. The Pistons then started the fourth period with a 10-2 run to go up by six.\n\n\r\n              Maxey scored six points in the fourth, but none of his teammates could get going and the Pistons took a 114-103 lead on LeVert's dunk with 1:44 to play. \n\n\r\n              The Pistons led 63-54 at the half, thanks to 15 points from Green and 13 from Robinson. VJ Edgecombe led the Sixers with 13 points, but Maxey only had 12 on 4-for-13 shooting.\n\n\r\n              Philadelphia scored the first 14 points of the third quarter, holding the Pistons to 0-for-5 shooting with five turnovers in the first four minutes of the period. It could have been worse for Detroit, but Andre Drummond was called for double dribble on an uncontested fast break.\n\n\r\n              The 76ers led by as many as 12 points in the quarter, but the Pistons rallied to cut the margin to 90-88 on Jenkins' 55-foot 3-pointer at the buzzer.\n\n\r\n              Up next\r\n              Sixers: Host the Los Angeles Clippers on Monday night.\n\n\r\n              Pistons: Host the Indiana Pacers on Monday night.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042623.011227
}