{
  "game_id": "401810034",
  "espn_id": "401810034",
  "date": "Nov 05, 2025",
  "matchup": "LAL vs SA",
  "headline": "Doncic scores 35, and the Lakers survive a frantic final second for a 118-116 win over the Spurs",
  "body": "LOS ANGELES -- — Luka Doncic had 35 points, 13 assists, nine rebounds and five steals, and the Los Angeles Lakers rallied in the fourth quarter before surviving a frantic final second for their fifth consecutive victory, 118-116 over the San Antonio Spurs on Wednesday night.\n\n\r\n              The Lakers finished the game on a 21-10 run, but the Spurs got one last chance when Marcus Smart committed an inbound violation after Kelly Olynyk’s putback layup with 1.2 seconds left.\n\n\r\n              Julian Champagnie then drew a foul from Jake LaRavia while trying to tip in the Spurs' inbound pass, but Champagnie missed his first free throw, and nobody could tip in the second miss at the buzzer.\n\n\r\n              Deandre Ayton had 22 points and 10 rebounds for the Lakers, who extended their impressive start to the season with a furious rally from a nine-point deficit midway through the fourth quarter. Doncic scored eight points in the fourth, including a clutch go-ahead 3-pointer with 2:31 to play.\n\n\r\n              Victor Wembanyama had 19 points and eight rebounds before fouling out with 1:39 to play for the Spurs, who have lost two straight after a 5-0 start. Stephon Castle and Jeremy Sochan had 16 points apiece.\n\n\r\n              Doncic overcame a 9-for-27 shooting night with another handful of stellar plays as the Lakers won a foul-plagued game between two undermanned teams. Harrison Barnes and Sochan also fouled out in the fourth quarter.\n\n\r\n              Los Angeles trailed 106-97 with just over seven minutes to play, but got back in it by holding San Antonio without a field goal for nearly 4 1/2 minutes.\n\n\r\n              Doncic's fourth 3-pointer put the Lakers up 113-112, and Wembanyama fouled out on a charge drawn by Rui Hachimura two possessions later.\n\n\r\n              Austin Reaves missed his second straight game with a hamstring injury, but Doncic returned after his absence from the Lakers' surprising win at Portland on Monday.\n\n\r\n              Up next\r\n              Spurs: Host Houston on Friday.\n\n\r\n              Lakers: At Atlanta on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NHL",
  "source": "espn_direct_latest",
  "crawled_at": 1765042569.849848
}