{
  "game_id": "0022400259",
  "espn_id": "401704825",
  "date": "Nov 20, 2024",
  "matchup": "ORL @ LAC",
  "headline": "Harden's 24 points lead Clippers over Magic 104-93, extending LA's home winning streak to 6",
  "body": "INGLEWOOD, Calif. -- — James Harden scored 24 points and the Los Angeles Clippers won their sixth game in a row at their new arena, beating the Orlando Magic 104-93 on Wednesday night.\n\n\r\n              Harden shot just 5 of 14 from the field, but he made 11 of 12 free throws to go with seven rebounds and five assists. Amir Coffey scored 18 points and Ivica Zubac added 17 on 8-of-11 shooting and 12 rebounds.\n\n\r\n              The Magic had their six-game winning streak snapped after holding every opponent under 100 points during that span. \n\n\r\n              Anthony Black had 17 points and eight assists off the bench to lead five Magic players in double figures. Jalen Suggs added 16 points.\n\n\r\n              Takeaways\r\n              Magic: They are 7-0 at home, but just 2-7 on the road.\n\n\r\n              Clippers: Already without Kawhi Leonard, they showed they could win without leading scorer Norman Powell, whose hamstring injury will also keep him out of Friday’s home game against Sacramento. Before tipoff, he visited The Wall section comprised of the loudest Clippers fans, who received Powell’s bobblehead as a giveaway.\n\n\r\n              Key moment\r\n              After leading by three at halftime, the Clippers dominated the third quarter, outscoring the Magic 30-21. They took control during a 14-2 spurt and later ran off seven points in a row. The Magic answered with nine straight before the Clippers scored to end the period.\n\n\r\n              Key stat\r\n              The Clippers outscored the Magic 17-2 in second-chance points, which nullified their 25 turnovers.\n\n\r\n              Up next\r\n              The Magic visit the Los Angeles Lakers on Thursday in the second game of a back-to-back. The Clippers host Sacramento on Friday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997574.784596
}