{
  "game_id": "0021600138",
  "espn_id": "400899588",
  "date": "Nov 12, 2016",
  "matchup": "DET @ DEN",
  "headline": "Pistons beat Nuggets 106-95 for first road win of season",
  "body": "DENVER --  A quick start and timely baskets down the stretch ended Detroit's early season woes on the road.\n\nTobias Harris scored 19 points, Marcus Morris had 17 and the Pistons beat the Denver Nuggets 106-95 on Saturday night for their first win of the season away from home.\n\n\"Without a doubt, everyone in this locker room was really focused out there to get this `W' today and we came out and accomplished it,\" Harris said. \"It's not the road trip we wanted, but we learned a lot from this road trip.\"\n\nDetroit, unbeaten in four home games, had lost five straight on the road before fashioning the wire-to-wire win in Denver, the final stop on a four-game road trip.\n\n\"That's why this was huge because we have to know how to win on the road,\" guard Ish Smith said. \"It's a new year, and we're 5-5 and feel good about it.\"\n\nAndre Drummond and Kentavious Caldwell-Pope added 14 points apiece for the Pistons, who also snapped a seven-game losing streak in Denver a week after beating the Nuggets in their first meeting in Detroit.\n\nEmmanuel Mudiay scored 19 points for Denver, which was done in by another slow start after being outscored 36-21 in the first quarter. The Pistons never trailed in the contest and also benefited from 16 Denver turnovers leading to 17 points.\n\n\"It is the same old story,\" Nuggets coach Michael Malone said. \"We outscored them 74-70 in quarters two, three and four. But when you spot them a 15-point lead in the first quarter. And we threw the ball over. Our turnovers are an epidemic.\"\n\nDanilo Gallinari added 18 points for the Nuggets, who remained winless in three games at home this season.\n\nGallinari's mid-range jumper pulled Denver to 97-93 with 3:02 left but Drummond came right back to sink a hook shot for Detroit. Harris' jumper with 1:07 left stretched Detroit's lead to eight points.\n\nDenver fell behind by as many as 17 points early on but used an 18-6 run late in the second quarter to get back in the game, pulling to 57-49 at halftime.\n\nTIP-INS\n\nPistons: Drummond added 12 rebounds to complete his seventh double-double of the season. ... Caldwell-Pope has scored in double figures in six of his last seven games. ... Detroit also never trailed in its first win this season against Denver.\n\nNuggets: F Darrell Arthur (left knee soreness) and F Will Barton (left ankle sprain) remain sidelined. Arthur and Barton have each missed the past six games. ... F Wilson Chandler was back in action after missing the previous two games with a sore left hamstring. ... Gallinari has scored 10 or more points in each of the first nine games.\n\nSECOND THOUGHTS\n\nMalone conceded an experimental switch to power forward from his natural position of center has not been working out well for second-year pro Nikola Jokic. The Nuggets coach said he plans to give Jokic more time at the 5 spot going forward. \"He had an unbelievable rookie year playing the 5,\" Malone said. \"I told him I feel like I've done him a disservice almost, exploring playing big. There are some good things with that, but I took a kid who had a great year last year, changed his position on him and it hasn't been easy for him. So my hope is to try to get him more minutes at 5. He will play some 4 at times but we need to get Nikola back.\"\n\nUP NEXT\n\nPistons: Return home from a four-game road trip to play Oklahoma City on Monday night.\n\nNuggets: Travel to Portland to play the Trail Blazers on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764996084.23381
}