{
  "game_id": "0021500902",
  "espn_id": "400828789",
  "date": "Mar 02, 2016",
  "matchup": "MEM vs. SAC",
  "headline": "Conley scores 24, leads Grizzlies past Kings 104-98",
  "body": "MEMPHIS, Tenn. --  With the Sacramento Kings chipping away at Memphis' lead, the Grizzlies' Mike Conley decided it was time to kick his offense in gear.\n\nConley scored 10 of his 24 points in the fourth quarter as Memphis avoided squandering a big first-half lead, defeating the Kings 104-98 on Wednesday night.\n\n\"The game got a little tight in the fourth, and I decided just to look for my offense a little more,\" said Conley, who also had five assists and shot 9 of 12, including converting all three attempts from 3-point range.\n\nConley's burst allowed the Grizzlies to win their second straight and sixth in the last eight. Zach Randolph finished with 19 points and eight rebounds for Memphis, while JaMychal Green and Mario Chalmers scored 15 apiece -- a career best for Green.\n\n\"That was a good game for us,\" Memphis coach Dave Joerger said. \"It was kind of a crazy game.\"\n\nThat sentiment came from Memphis building a 21-point advantage in the first half en route to a 59-43 halftime lead -- and then seeing the Kings steadily cut into the margin before eventually overtaking the Grizzlies in the fourth.\n\nMarco Belinelli had 16 points, including 11 in the fourth, to help the Kings eventually erase the deficit. His 3-pointer with 9:32 remaining tied the game at 85. Sacramento took the lead about a minute later on a dunk by DeMarcus Cousins, who would lead the Kings with 18 points and 16 rebounds.\n\nThe teams then exchanged leads and were tied at 91 with just under 5 minutes left when Memphis went on a 7-0 run to take a lead the Grizzlies would not relinquish.\n\n\"We kind of put ourselves in a hole and spent a lot of energy (erasing the lead),\" Cousins said. \"We've got to find a way to -- if we're going to be in a close game -- let it be a close game throughout and then we make that late push, instead of our late push being us getting back in the game.\"\n\nDarren Collison added 17 points, Omri Casspi scored 12 points and Quincy Acy had 11 for the Kings. Rajon Rondo had 17 assists.\n\n\"We just have to be aware and show urgency from the beginning of the game,\" Cousins said, \"and not when somebody lights a flame under our (butts).\"\n\nTIP-INS\n\nKings: Rudy Gay, Sacramento's second-leading scorer averaging 18 points, missed his second consecutive game with a sprained right shoulder. Gay started his career with Memphis, playing six-plus seasons for the Grizzlies. ... Cousins recorded his 35th double-double of the season. ... Rondo's assists were three short of his season-high 20, which is also the best in the league this season.\n\nGrizzlies: Memphis signed C/F Ryan Hollins earlier in the day. Hollins previously was with the team this season on a pair of 10-day contracts. ... G Tony Allen missed his sixth straight game with a sore left knee. ... Rookie Jarell Martin, playing in his fifth game of the season, grabbed eight rebounds. ... Memphis has won 12 straight home games in the series, with the last Kings win at FedExForum coming on Feb. 20, 2009.\n\nTHEY CALL HIM MR. THIBS\n\nFormer Chicago Bulls coach Tom Thibodeau is spending time with Karl and the Kings. Karl wants Thibodeau to help him see things defensively, and Thibodeau may get tips offensively from the Kings. \"You always kind of like to see somebody else's eyes on your product,\" Karl said. \"You kind of get tainted by the anger and the frustration and the losing. You don't always see the good.\"\n\nLITTLE DIFFERENT; LITTLE BIT THE SAME\n\nMemphis is a different team with recent trades and injuries, including the loss of center Marc Gasol with a broken foot. But Karl said there are some things that haven't changed. \"My issue, being in Memphis, is you don't win here unless you are a little dirty, a little gritty and a little physical,\" he said.\n\nUP NEXT\n\nKings: At Dallas on Thursday.\n\nGrizzlies: Host Utah on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994427.135278
}