{
  "game_id": "0021800592",
  "espn_id": "401071268",
  "date": "Jan 07, 2019",
  "matchup": "BKN @ BOS",
  "headline": "Irving scores 17 in return as Celtics top sloppy Nets 116-95",
  "body": "BOSTON --  The Boston Celtics shared the ball extremely well. The sloppy Brooklyn Nets helped them out a lot, too.\n\nKyrie Irving returned after missing two games with an eye injury and scored 17 points to lead eight players in double figures as Boston beat the Nets 116-95 on Monday night.\n\nJayson Tatum added 16 points, and Al Horford, Gordon Hayward, Marcus Morris and Marcus Smart each scored 12 for the Celtics, who won their third straight game.\n\nThe Celtics had 37 assists on 47 baskets. It was their fourth straight game with 30 or more assists.\n\n\"It's just moving the ball, moving the bodies, trying to create opportunities for one another,\" Irving said. \"It's good.\"\n\nHorford said coach Brad Stevens emphasized passing before the game.\n\n\"Coach challenged us before the game to be great in that regard and try to really move the ball,\" he said. \"We did that tonight.\"\n\nRodions Kurucs led Brooklyn with 24 points. Spencer Dinwiddie had 15 and Kenneth Faried scored 13 with 12 rebounds. The Nets lost for just the fourth time in their last 16 games.\n\nIrving was out after scratching both corneas in a collision Dec. 31 at San Antonio.\n\nPlaying on consecutive days, the Nets came out sloppy in the opening quarter, committing 11 turnovers -- about half coming on wild passes that sailed out of bounds. They ended up with a season-high 25.\n\n\"That was kind of the old Nets,\" coach Kenny Atkinson said. \"That was a big problem of ours last year and the beginning of this year.\"\n\nTrailing by 11 at halftime, Brooklyn sliced it to 59-54 early in the third quarter before the Celtics used a 17-9 spurt to pull ahead by 17 late in the period.\n\nBoston led 86-74 entering the final quarter and the Nets never threatened.\n\n\"They're a very cohesive group,\" Dinwiddie said. \"Obviously, they're one of the better teams in the Eastern Conference and they force a lot of turnovers. That obviously got them out in transition, got them easy buckets.\"\n\nIn the first half, Boston led by double digits at the end of the first quarter and opened a 47-27 advantage on Tatum's layup midway into the second en route to a 56-45 edge at halftime.\n\nTIP-INS\n\nNets: Hit their first four shots -- all 3-point attempts -- but missed 25 of their next 30 overall. ... Former Boston College forward Jared Dudley and Connecticut guard Shabazz Napier both received a nice ovation when they were introduced.\n\nCeltics: Morris also returned after missing the previous game with a stiff neck. ... Boston swept all four games between the teams last season.\n\nPREGAME PRAISE\n\nStevens spoke highly about the Nets before the game.\n\n\"I'd be surprised if this team's not in the playoffs. They're awfully good,\" he said of Brooklyn, which entered the day holding the Eastern Conference's seventh seed.\n\n\"I just love the way they play,\" Stevens added. \"They play hard and they play together. Everybody knows what they're supposed to do, and they do it every night.\"\n\nI'M NOT IN YET\n\nFaried got off the bench, getting ready to check in, when Jarrett Allen fired a pass from on the court that bounced off Faried as he was heading to the scorer's table. Faried walked on the floor smiling when he got into the game.\n\nUP NEXT\n\nNets: Host the Atlanta Hawks on Wednesday.\n\nCeltics: Close a four-game homestand against the Indiana Pacers on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995415.836523
}