{
  "game_id": "0021500089",
  "espn_id": "400827976",
  "date": "Nov 07, 2015",
  "matchup": "MIL vs. BKN",
  "headline": "Monroe, Bucks hand Nets 7th straight loss to start season",
  "body": "MILWAUKEE -- Greg Monroe knows what the difference was between the first three games with his new team and the last four.\nMonroe had 20 points and eight rebounds Saturday night, leading the Milwaukee Bucks to a 94-86 victory over the winless Brooklyn Nets.\nHe shot 8 of 16 from the floor and contributed his only two assists down the stretch for the Bucks, who handed the Nets their seventh straight loss to start the season.\n\"There's a lot of new pieces, including myself, obviously,\" Monroe said. \"We just had to work out some things. I definitely think everybody's on the same page now. Everybody understands what they have to do on both sides of the floor. I think that's why the tide has kind of changed.\"\nJerryd Bayless had 19 points on 7-of-13 shooting and 10 assists -- one shy of his career high. Khris Middleton chipped in with 14 points and nine rebounds.\nMilwaukee (4-3) has won four in a row after starting 0-3 for the first time since 1976-77.\nBrooklyn (0-7) was led by Brook Lopez with 20 points. But he did not play the final quarter because of a sore right foot. Team officials were unsure how the injury happened. X-rays were negative. Lopez was not in the locker room afterward.\nThaddeus Young finished with 18 points and 13 rebounds for the Nets, who also lost to the Bucks 103-96 on Monday in New York.\n\"We need every healthy body that we can get right now,\" Young said of Lopez. \"We're very fortunate that he didn't hurt himself worse than he did. Good thing his X-rays were negative. We'll try to get him back on the court as soon as possible.\"\nA late 9-3 run by Milwaukee left little doubt to the outcome.\nMonroe was in the lane with 3:51 left when he got his first assist of the game with a pass to Johnny O'Bryant for a dunk along the left baseline for an 85-72 lead.\nMonroe made two free throws and then he sent another pass from the paint to Bayless for a 3-pointer that gave the Bucks a 90-75 lead. A layup by Bayless gave Milwaukee its biggest lead at 92-75, with 1:52 to go.\n\"I'm just trying to find my teammates,\" Monroe said. \"Whenever I have the ball in the post, I'm always looking for them first. I just locate the defenders and see if any of those guys are moving or cutting, if they're open on the weak side like Jerryd was. Then if not, I try to be aggressive.\"\nThe last time Brooklyn led was with 6:01 left in the third, when Lopez made a layup for a 55-53 lead.\nTIP-INS\nNets: This was the first time the team held an opponent to fewer than 100 points. ... Brooklyn allowed a season-low 18 points in the first quarter for the second time in as many games.\nBucks: This was Milwaukee's fifth game in the last seven days ... Michael Carter-Williams missed his third straight game with a strained left ankle and O.J. Mayo has yet to play because of a right hamstring strain.\nSLIPPERY WHEN WET\nThe ball was knocked out of bounds late in the third quarter, knocking several beers off of a waitress' serving tray. The Bucks' mascot rushed to the scene to help with a large rag and a bottle of cleaning solution.\nTRADING TECHNICALS\nBayless received a technical foul for taunting Bogdanovic after he blocked his shot midway through the third quarter. Eight seconds later, Bogdanovic was given a technical for arguing an offensive foul called on him.\nUP NEXT\nNets: Brooklyn visits Houston on Wednesday.\nBucks: Milwaukee hosts Boston on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994107.2988281
}