{
  "game_id": "0021500006",
  "espn_id": "400827893",
  "date": "Oct 28, 2015",
  "matchup": "CHI @ BKN",
  "headline": "Bulls beat Nets 115-100 for 2-0 start",
  "body": "NEW YORK -- So much has changed for Derrick Rose and the Chicago Bulls. Some defensive schemes are different, and so is the playing rotation.\nThey can count on their upgraded offense until they figure out the rest.\nJimmy Butler scored 24 points, Nikola Mirotic had 18 and the Bulls won for the second time in two nights to open the season, beating the Brooklyn Nets 115-100 on Wednesday night.\nPau Gasol added 16 points and Rose 15 for the Bulls, who followed their season-opening victory over Cleveland by shooting 54 percent and leading by as many as 19. They built a big early lead, blew most of it with a defenseless second quarter and quickly pulled away again in the third.\n\nThe transition from Tom Thibodeau to new coach Fred Hoiberg appears seamless, though Rose insists it isn't.\n\"It's only two games, we always have room to improve,\" he said. \"Do I love the way that we played these two games? Of course. We had some ups and downs, but we've still got to get better.\"\nBrook Lopez had 26 points and Andrea Bargnani had 17. The Nets opened their 40th season in the NBA by falling into a quick 7-0 hole and trailing the rest of the way. They missed all nine 3-point attempts.\nAsked how he felt about what he saw, Nets coach Lionel Hollins said: \"I don't feel good about anything. We lost.\"\n\"As a coach, I understand that we did do some good things. As I told the team, we have to extend those good things to a longer period of time,\" he added. \"Cut down on our mistakes in giving them easy things and make them have to earn everything.\"\nThe Nets had won their first home game in all three seasons since moving from New Jersey to Brooklyn. They were hoping to get this game, one of their few at Barclays Center during a rough opening stretch. They play seven of their first 10 on the road, including a back-to-back this weekend at San Antonio and Memphis.\nHoiberg said before the game it can be difficult to move past emotional games such as the 97-95 home victory over the Cavaliers, but the Bulls jumped to a 28-12 lead in Brooklyn.\n\"It's a sign of our focus, I think, a sign of what we're trying to accomplish this year,\" Gasol said.\nThe Nets then made 16 of 23 shots and scored 36 points in the second, their highest-scoring quarter ever in an opener, to cut it to 58-55 at halftime.\nBut Chicago opened it up again late in the third, getting a basket by Rose with 3:17 left to beat the shot clock after the Nets cut it to six. Butler added a couple of baskets to keep a safe lead from there.\nTIP-INS\nBulls: Joakim Noah, limited to 17 minutes in the opener by knee pain, played and moved past Hall of Famer Scottie Pippen into third place on the Bulls' career list in blocked shots. He remains behind Hall of Famers Artis Gilmore and Michael Jordan.\nNets: After buying out and waiving Deron Williams in the offseason and with Jarrett Jack out with a sore left hamstring, the Nets started Shane Larkin at point guard. He had six points and a career high-tying eight assists. ... The Nets held a tribute to Darryl Dawkins, their former center who died this summer, between the first and second quarters with members of his family on the court.\nCARING FOR THE COMMUNITY\nSome Nets players warmed up in NYPD shirts, and Hollins wore an NYPD hat during his pregame press conference. Earlier Wednesday, a funeral was held for New York Police Department Officer Randolph Holder, who was killed Oct. 20 while responding to a report of shots fired and a bicycle stolen at gunpoint in Manhattan's East Harlem neighborhood.\n\"As people that have a platform, it's always important to be social, civic-minded,\" Hollins said. \"We don't have to make big political statements, you just support the people who serve us, protect us.\"\nUP NEXT\nBulls: Visit Detroit on Friday.\nNets: Visit San Antonio on Friday.",
  "source": "espn_api",
  "crawled_at": 1764993987.729228
}