{
  "game_id": "0021801168",
  "espn_id": "401071841",
  "date": "Apr 03, 2019",
  "matchup": "PHI @ ATL",
  "headline": "Young, Collins help Hawks beat Sixers again",
  "body": "ATLANTA --  J.J. Redick is glad the Philadelphia 76ers won't have to face the Atlanta Hawks in the playoffs.\n\n\"They have a great offense, there's a lot of movement, they space the floor well,\" Redick said. \"Trae Young and John Collins -- their two-man action presents a lot of problems -- and Trae's just playing at another level in terms of making reads right now.\"\n\nYoung had 33 points and 12 assists, Collins added 25 points, and Atlanta beat Philadelphia 130-122 on Wednesday night, handing the playoff-bound Sixers their second straight loss.\n\nWith four games left in the regular season, the Sixers still need one victory and a loss by Boston to secure the No. 3 seed in the Eastern Conference. They have dropped four of six, a stretch that began with a last-second setback at Atlanta 10 days ago.\n\nPhiladelphia ended the regular season 1/3 against a rebuilding Hawks club that's lost 50 games and was coming off another setback at San Antonio a night earlier.\n\nComing off a lackluster loss at Dallas two nights ago, the Sixers were without star center Joel Embiid for the third straight game. Forward Jimmy Butler returned from a one-game absence with back tightness and finished with 16 points.\n\nPhiladelphia, which missed 16 of 38 free throws, got 30 points from J.J. Redick and 21 from Tobias Harris. After 27 lead changes and 13 ties in the first three quarters, the Sixers never led in the fourth.\n\n\"It says how much we miss Joel,\" Butler said. \"He's a big part in what we do. When you're missing a guy like that on both ends of the floor, it's tough. I don't think we handled it well. There's always going to be some adversity, certainly when he's not there, but I feel like we've just got to do better as a whole.\"\n\nYoung, who scored 32 points and hit the game-winning shot on Butler 10 days ago, was at it again, his 10th assist coming on Collins' reverse dunk that put the Hawks up 85-84. Young missed a long 3 but grabbed his own rebound and dribbled quickly for a left-handed layup that made it 119-106 with 5:35 remaining.\n\nCollins blocked Tobias Harris' dunk attempt a few seconds later and followed a few possessions later with a dunk that made it 121-111.\n\n\"For some reason, we play well against playoff teams,\" Collins said. \"We get up to play.\"\n\nDeAndre' Bembry scored 17 points and Kevin Huerter added 15 for the Atlanta.\n\nTIP-INS\n\nSixers: Redick, 34, set the Philly record for most 3s in a season, surpassing Kyle Korver's mark of 226 set in 2004-05. ... James Ennis III left the game with a right quad contusion and didn't return. ... Simmons lost a tooth during the game. ... Butler was inadvertently hit in the face by Young. ...  Embiid missed his third straight game and will have his knee re-evaluated Thursday. Coach Brett Brown didn't have an immediate timetable before the game for Embiid's return. Milwaukee brings the NBA's best record to the Wells Fargo Center on Thursday. ... Wednesday marked the first time in 16 games that the Sixers didn't hit 70 percent of their foul shots. ... Two Sixers icons, Julius Irving and Allen Iverson, watched the game from the stands.\n\nHawks: Taurean Prince returned to the starting lineup despite being listed as questionable and missing the last three games with foot soreness. ... Young had his 17th game, tied for third-most in the NBA, with at least 20 points and 10 assists. Russell Westbrook has 24 and James Harden 23.\n\nSPECIAL NIGHT OFF\n\nHawks G Vince Carter was given the day off after playing 28 minutes at San Antonio and spent the game as an analyst on Atlanta's TV broadcast. The 42-yeaer-old Carter said before the game that he's leaning toward coming back next season for what would be his 22nd in the NBA and wants to return for a second season with Atlanta. He has averaged 7.5 points in his first season with the Hawks and added he's \"1,000 percent certain\" he will become a broadcaster after retiring.\n\nUP NEXT\n\nSixers: Host Milwaukee on Thursday.\n\nHawks: At Orlando on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764993985.3009338
}