{
  "game_id": "0021600706",
  "espn_id": "400900127",
  "date": "Jan 28, 2017",
  "matchup": "MIL vs. BOS",
  "headline": "Isaiah Thomas scores 37 points, Celtics beat Bucks in OT",
  "body": "MILWAUKEE -- Jae Crowder's mind went quiet in overtime in Boston's fourth game in five nights.\n\"No pressure,\" he said.\nCrowder scored four of his 20 points on free throws in the final 28 seconds of overtime and Isaiah Thomas had 37 points to help the Celtics beat the Milwaukee Bucks 112-108 on Saturday night.\n\"It's always special when I come here and we get a win,\" said Crowder, who played at Marquette. \"I see a lot of familiar faces around the building, including the ushers, stuff like that. It's always a great feeling to come back.\"\nBoston won its third straight after squandering a 16-point second half lead and a 42-point first quarter, its best of the season.\n\"I thought we played pretty darn well, to be honest, and then defensively and in the overtime I thought we were excellent,\" Celtics coach Brad Stevens said.\nGiannis Antetokounmpo led Milwaukee with 21 points, and Greg Monroe had 14 points and 13 rebounds. The Bucks have lost three in a row and eight of nine.\nBoston built a six-point lead in overtime, but Tony Snell hit consecutive 3s to tie it at 108. Crowder made two free throws on the ensuing possession with 28 seconds to go and two more to seal it with 10 seconds left after Antetokounmpo missed a contested shot in the lane.\n\"We're taking a step forward toward the right direction,\" Antetokounmpo said. \"We got back into the game, but we weren't mature enough to close it out.\"\nRALLY FALLS SHORT\nThe Bucks trailed 69-53 early in the third quarter, taking the lead briefly with just under 5 minutes to play on a three-point play by Monroe, who scored 10 of his 14 in the final quarter.\n\"I was just trying to be aggressive,\" Monroe said. \"Just trying to make the right play.\"\nThomas hit a 3 and the Bucks couldn't tie it again until Monroe hit the first of two free throws with 37 seconds to play that tied it at 102.\nTIED UP THOMAS\nThomas' 3 with 4:33 left was his final points of the night. The Bucks switched up defenses on him, doubling him off screens and forcing him to give up the ball.\n\"They were face guarding, denying, double-teaming -- they were doing it all,\" Thomas said.\nWhen he tried to make plays, he pressed, including missing an off-balance 3-pointer that would've won the game in the closing seconds of regulation.\nCrowder said it was an important lesson for the Celtics for the future.\n\"The playoffs, it's not going to be easy, we can't depend on him to do everything in the playoffs on the offensive end,\" Crowder said. \"That's what good teams find a way to do, they find a way to score and a way to get a win without their offensive threat.\"\nMAKER'S MARK\nFirst-round draft pick Thon Maker received his second career start in place of center Miles Plumlee. He provided a jolt during Milwaukee's rally in the third quarter, scoring four points and blocking a shot by Thomas that energized the crowd.\n\"I thought he changed the game in the second half,\" Bucks coach Jason Kidd said. \"His effort was great, and we'll see how it goes when we get to Utah.\"\nTIP-INS\nCeltics: Thomas has scored 20 or more in 31 straight games and 30 or more 16 times this season. ... C Al Horford (sore groin) did not travel with the team. ... G Avery Bradley (sore right Achilles' tendon) missed his sixth straight game. ... Gerald Green's 3-pointer at the end of the first quarter gave Boston a 42-27 lead. It was the most points for Boston in any quarter this season.\nBucks: Parker had a tough night, going 2 for 13 from the field and finishing with four points. ... It was the first game between these two teams. They'll play twice more this season in Boston on March 29 and April 12.\nUP NEXT\nCeltics: Host Detroit on Monday night to begin a four-game homestand.\nBucks: Visit Utah on Wednesday night to start a three-game Western Conference trip.",
  "source": "espn_api",
  "crawled_at": 1764995174.6077619
}