{
  "game_id": "0022300677",
  "espn_id": "401585305",
  "date": "Jan 31, 2024",
  "matchup": "BKN vs. PHX",
  "headline": "Kevin Durant scores 33 points in Brooklyn return, leads Suns to 136-120 victory over the Nets",
  "body": "NEW YORK -- — Kevin Durant was cheered before the game, then booed when it started. \n\n\r\n              His return to Brooklyn was on track be a noisy one, until he and the Phoenix Suns took the crowd out of the game with some relentless offense.\n\n\r\n              “I love to shut the crowd up. Even though I love these people here, I love to shut them up,\" Durant said after scoring 33 points to lead the Suns to a 136-120 victory Wednesday night.\n\n\r\n              Durant added eight assists in his first game in Brooklyn since being traded to Phoenix nearly a year ago. He got a mixed reception early before leaving Nets fans little to cheer with 11 points in the third quarter, when the Suns outscored the Nets 42-26 after leading by three at halftime.\n\n\r\n              “He put the team first, went out and competed, played team-first basketball, had eight assists and several other plays where made the extra pass and allowed his teammates to play through his double-teams and played a team-first type of game and ended up with 33 and eight,” Suns coach Frank Vogel said. “Hell of a performance.” \n\n\r\n              Durant’s return earned the game a national-TV slot but it wasn’t much of a contest in the second half. The Suns, with Durant, Devin Booker and Bradley Beal, are trying to build a title contender, while the Nets — who not long ago had their own Big 3 with Durant, Kyrie Irving and James Harden — are 19-28 and outside playoff position. \n\n\r\n              Jusuf Nurkic added 28 points and 11 rebounds for the Suns, overwhelming an undersized Nets team as the Suns won for the ninth time in 11 games. They improved to 3-2 on a trip that has stops remaining in Atlanta and Washington, Beal's former home. \n\n\r\n              “It’s tough. With a team like that you know they’re going to shoot well, just those three guys at a high level, so we had to pick our battles tonight,” Nets coach Jacque Vaughn said. \n\n\r\n              Booker finished with 22 points and Eric Gordon had 17. The Suns shot 62% from the field and 50% from 3-point range.\n\n\r\n              Cam Thomas scored 25 points for the Nets, who had won two straight games. Mikal Bridges, who came to the Nets in the Durant trade, had 21 and Lonnie Walker IV added 19.\n\n\r\n              The Nets played a tribute video for Durant — who had wrote on social media that he didn't want one — before he was announced first among the Suns starters. He received cheers then, though was booed when he touched the ball in the early minutes.\n\n\r\n              “That wasn’t going to stop me from just doing my job, regardless of how I was honored,” Durant said of the video, calling the Nets a classy organization for the way they treat former players.\n\n\r\n              The swing of emotions was fitting, as Durant had said earlier this week that fans didn't know how to feel about him. He brought hope of a first NBA championship to the Nets when he and Irving signed together in 2019, but left without ever getting close. Brooklyn won just one playoff series during that time in 2021, but Durant was disappointed with the way the Nets played while he was hurt the following season and asked for a trade in the summer of 2022.\n\n\r\n              The Nets held onto him then, but moved him to Phoenix before last year's trade deadline after Durant renewed his request after Irving had been moved to Dallas. \n\n\r\n              The Nets were without Ben Simmons, who was sidelined with a bruised left knee just one game after returning from a 38-game absence with a pinched nerve in his lower back. Simmons came down awkwardly after blocking a shot in the fourth quarter Monday and Vaughn said the No. 1 pick in the 2016 draft's knee was swollen, though an MRI exam showed no structural damage.\n\n\r\n              The Suns broke it open in the third quarter with a 10-0 run that pushed an eight-point lead to 99-81. Durant had the first five points, and after Nurkic dunked, Durant scored while being fouled by Thomas, who is listed as 7 inches shorter. Durant stared for a few moments across the baseline toward the crowd, then held his fingers close together to indicate that Thomas was too small.\n\n\r\n              The entire Nets team was too small. With Dorian Finney-Smith and Day'Ron Sharpe also sidelined, there was no ability to match up inside and Phoenix outrebounded Brooklyn 42-27.\n\n\r\n              Phoenix played without starting forward Grayson Allen, who sprained his right ankle Monday in a victory in Miami. \n\n\r\n              UP NEXT\n\n\r\n              Suns: At Atlanta on Friday night.\n\n\r\n              Nets: At Philadelphia on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996341.321553
}