{
  "game_id": "0022300459",
  "espn_id": "401585087",
  "date": "Jan 02, 2024",
  "matchup": "CHI @ PHI",
  "headline": "Joel Embiid returns with seventh career triple-double in 76ers' rout of Chicago Bulls",
  "body": "PHILADELPHIA -- — Joel Embiid declined at first to wear a “ Big Energy ” chain before he reluctantly agreed to slip on the gaudy necklace and flexed his muscles for a quick photo at his locker.\n\n\r\n              “The Process” was back — and so were the 76ers.\n\n\r\n              Embiid had 31 points, 15 rebounds and 10 assists in his return from a sprained right ankle, Tyrese Maxey scored 21 points and Philadelphia beat the Chicago Bulls 110-97 on Tuesday night.\n\n\r\n              “He was moving great. I think his conditioning was less than that,” coach Nick Nurse said. “But that's OK. I think that game was good for him to kind of recondition himself.”\n\n\r\n              Embiid missed all four games on the 76ers’ holiday road trip, and they went 2-2. One of those games was in Chicago just three nights earlier, a 105-92 loss in which the Sixers never led in the second half.\n\n\r\n              Embiid is the reigning NBA MVP for a reason. With the big man back, the Sixers turned this into an early blowout against a Bulls team that had played well recently without injured guard Zach LaVine. LaVine can return to the lineup as early as Friday. Even the two-time All-Star wouldn’t have helped much in this one as the Bulls fell to 10-6 this season without him.\n\n\r\n              The 76ers raced to a 43-18 lead after one quarter, with the Bulls missing all 10 3-pointers.\n\n\r\n              DeMar DeRozan led the Bulls with 16 points. Andre Drummond had 11 points, 17 rebounds and muffed a dunk to the delight of the home crowd when he was stuffed by the front of the rim. Forward Patrick Williams left with an injured right ankle.\n\n\r\n              It was that kind of night in Philly, where the 76ers continued a recent trend of comfortable wins. They handed LeBron James the largest margin of defeat in his pro career in a 44-point win in November. There was a 45-point win over Washington and a 32-point victory over Detroit.\n\n\r\n              So many NBA games are ones of back-and-forth runs. The Sixers have been stout at home at building double-digit leads and never letting up -- especially against bad teams or an undermanned one like the Bulls (Nikola Vucevic sat out) -- and rolling to easy wins.\n\n\r\n              The routs also give Embiid, who reached his seventh career triple-double in the third quarter, a chance to rest. Embiid, who said he couldn't really test the ankle the previous couple of days, sat out the fourth quarter. Embiid extended his franchise records with 15 straight 30-point games and 14 straight games of 30 points and 10 rebounds.\n\n\r\n              “I want to play as many games as possible,” Embiid said. “It's unfortunate I missed the past four games but I can't control it. If I'm healthy, my goal was to try and play 82 games. Every single game. Sometimes, it's not just possible. Sometimes, stuff happens.”\n\n\r\n              The Sixers made 12 of their first 16 shots and started 7 of 9 on 3-point range. The early outburst gave them a 25-point lead, their largest at the end of the first quarter since they led Milwaukee by 28 points on April 11, 2018.\n\n\r\n              Embiid had 22 points at the half and Kelly Oubre Jr. scored 16. The 73-42 lead marked the 12th time in franchise history the Sixers led by 31-plus points at halftime.\n\n\r\n              Oubre rattled off a list of reasons and statistics why the 76ers had an easier time with the Bulls than they did last week before he settled on the biggest one: “ ... and JoJo being back, of course.”\n\n\r\n              Of course.\n\n\r\n              Embiid jumped, spun, cut, and never looked bothered by the ankle. He even secured his triple-double on a no-look pass. Even with the games missed, Embiid still leads the league in scoring with 35 points per game.\n\n\r\n              The Bulls learned the hard way, the 76ers are a force with Embiid.\n\n\r\n              “I think it's two different teams,” Bulls coach Billy Donovan said. “You've not going to play him 1-on-1. You've going to play him with five people at all times.”\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Visit New York on Wednesday.\n\n\r\n              76ers: Host the Knicks on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995900.521405
}