{
  "game_id": "0022301158",
  "espn_id": "401585786",
  "date": "Apr 10, 2024",
  "matchup": "CLE vs. MEM",
  "headline": "Donovan Mitchell scores 29 points, Cavaliers beat Grizzlies 110-98 to close in on playoff berth",
  "body": "CLEVELAND -- — Donovan Mitchell scored 29 points, Jarrett Allen had 16 points and 10 rebounds, and the Cleveland Cavaliers beat the Memphis Grizzlies 110-98 on Wednesday night to move within a victory of wrapping up a playoff spot.\n\n\r\n              All-Star shooting guard Mitchell, who has been bothered by left knee soreness for two months, also had eight assists in just his 10th game since Feb. 15. The Cavaliers have lost 11 of their last 17, but sit fourth in the Eastern Conference.\n\n\r\n              “It was time to get going and I felt really good tonight,” said Mitchell, who also broke his nose in mid-March. “The biggest cure for my knee is rest, but we don’t have time for that, so we have to find ways to adapt. I wanted to set the tone here.”\n\n\r\n              Cleveland would lock up a top-six finish and its second straight playoff appearance with a victory Friday over Indiana or a win Sunday over Charlotte. It also clinches if Philadelphia loses one of its two remaining games.\n\n\r\n              “It’s a great opportunity to control our destiny with all of these games at home,” Cavaliers coach J.B. Bickerstaff said. “If we take care of what’s in front of us, we’ll be fine.”\n\n\r\n              Darius Garland had 16 points and nine assists, and Evan Mobley added 12 points, 12 rebounds and four blocked shots for Cleveland. The Cavaliers blew a 26-point lead in the second half of their previous game, a 120-118 loss at the Los Angeles Clippers.\n\n\r\n              “We really need all three of these games, but we’ll take it one at a time,” Garland said. “This group loves each other, so no matter what happens, this group has each other’s backs. That's the easiest part.\"\n\n\r\n              Jake LaRavia scored a career-high 32 and made eight 3-pointers, and rookie GG Jackson II had 22 points for injury-plagued Memphis, which has used an NBA-record 33 players this season. Scotty Pippen Jr. added 18 points and six assists.\n\n\r\n              The Grizzlies’ top four scorers — Ja Morant, Desmond Bane, Marcus Smart and Jaren Jackson Jr. — were among their 12 players who are out with injuries. They dressed an NBA-minimum eight.\n\n\r\n              “It was one of those nights where anything I was throwing up was going in,” LaRavia said. “I’m playing with confidence in my abilities and I’m just trying to take advantage of my opportunities.”\n\n\r\n              Cleveland didn’t pull in front for good until midway through the third quarter at 62-59, when Mitchell fed Allen for a three-point play. Allen had 12 points and made all five of his field goal attempts in the period.\n\n\r\n              The Grizzlies held a 51-48 advantage at halftime, fueled by 21 points from LaRavia on a perfect 6-of-6 3-point shooting.\n\n\r\n              “Having a woe-is-me attitude isn’t going to help, but that hasn’t been a problem for us,” Memphis coach Taylor Jenkins said. “Our attitude has been fantastic all year.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host the Los Angeles Lakers on Friday night.\n\n\r\n              Cavaliers: Host Indiana on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996718.4061508
}