{
  "game_id": "0021500539",
  "espn_id": "400828426",
  "date": "Jan 07, 2016",
  "matchup": "LAL @ SAC",
  "headline": "Kings blow 27-point lead, still win in Kobe's Sacramento finale",
  "body": "SACRAMENTO, Calif. -- Kobe Bryant received a hug and a gift from former teammate Vlade Divac. The Los Angeles Lakers star left Sacramento without his prime objective: a victory.\nDeMarcus Cousins had 29 points, 10 rebounds and seven assists, and the Kings blew all of a 27-point lead in the second half before beating the Lakers 118-115 on Thursday night in Bryant's last Sacramento appearance.\nDivac and Bryant, 37, have a long, intertwined history. Now the Kings' general manager, Divac was traded by the Lakers in 1996 to the Charlotte Hornets, who gave Los Angeles the draft rights to the 17-year-old Bryant, who is playing in his 20th and final season as a Laker.\n\"He gave me a Charlotte Hornets jersey. No. 8. It's awesome,\" said Bryant, who was later teammates with Divac. \"He has a great sense of humor and is a real practical joker. It goes well with my sarcasm.\"\n\nAlthough the Kings were ahead 25-4 five minutes into the game, they needed a late rally and a go-ahead basket from Rajon Rondo to spoil the night for Bryant, who thrilled the partisan crowd with 28 points.\nBryant made 10 of 18 shots and was 6-for-8 on free throws. But he was on the bench for the night by the time the Lakers made a huge comeback to take the lead down the stretch.\n\"Kobe was amazing; I tip my hat to him. He had a great game and gave the crowd what they wanted,\" said Ben McLemore, who guarded Bryant for much of the game. \"Defending him in his final game in Sacramento was an honor. It's something I will remember forever.\"\nWhat the Kings might want to forget is a fourth quarter in which they squandered a 16-point lead and were outscored 29-16.\n\"In the second half, we got outfought and outhustled,\" Kings coach George Karl said. \"I think we mentally shut down. Maybe we celebrate too much when we are playing really well.\"\nRookie D'Angelo Russell scored 11 of his 27 points in the fourth quarter before having to leave with an ankle injury for the Lakers, who have dropped five straight games to the Kings.\nLou Williams added 20 points for the Lakers, and Jordan Clarkson had 12 of his 15 in the fourth quarter.\nRudy Gay scored 18 points and Quincy Acy had a season-high 18 for the Kings. McLemore had 16 points, and Kosta Koufos added 14. Rondo had nine points and 12 assists.\nJudging by the large number of fans wearing his jersey and the roar that greeted him during a long pregame introduction, it was clear that many in the sellout crowd of 17,386 were on hand for one reason: to honor Bryant's 33rd and final game at Sleep Train Arena.\nBryant, who missed the previous three games with a sore right shoulder, scored seven points in the first quarter and added 11 in the second on a couple of vintage baskets in traffic, plus an alley-oop dunk.\n\"(The fans) showed a sign of respect, even though we have been enemies for so many years,\" Bryant said. \"This has always been a special place, not just for me, but for the city itself. It's sad to see this place go (for a new arena next year).\"\nBryant, who scored his 33,000th point on a jumper in the second quarter, never left the bench after playing nearly 31 minutes through three quarters. Instead, he watched his youthful teammates nearly pull off a major comeback.\n\"He was real close to minutes I wanted him to play. But we continue to ask how this guy continues to perform the way he does with a week off or a slight injury,\" Lakers coach Byron Scott said. \"He goes out there and hasn't missed a beat. It's just remarkable sometimes to watch.\"\nRondo made a floater in the lane with 21.7 seconds left, giving the Kings a 116-115 lead. Clarkson lost the ball on a dribble drive and fouled Cousins, who made two free throws for a three-point lead with 6.8 seconds left.\nWilliams missed a potential tying 3-pointer in the closing seconds, and Acy secured the rebound.\nTIP-INS\nLakers: Bryant's first game in Sacramento was Dec. 10, 1996, his rookie season. ... Former Kings forward Metta World Peace was not in uniform but was at the game. ... The Lakers had six steals in the fourth quarter, when the Kings committed seven of their 15 turnovers.\nKings: Actor Jamie Foxx sat courtside next to Kings owner Vivek Ranadive. ... Sacramento shot 55 percent. ... Omri Casspi missed his third straight game with back problems, and rookie Willie Cauley-Stein (finger laceration) missed his second straight.\nUP NEXT\nLakers: Host Oklahoma City on Friday.\nKings: Host Golden State on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994285.127435
}