{
  "game_id": "0022001000",
  "espn_id": "401307805",
  "date": "May 06, 2021",
  "matchup": "IND vs. ATL",
  "headline": "LeVert's late burst helps Pacers beat Hawks 133-126",
  "body": "INDIANAPOLIS -- — Caris LeVert showed up motivated for work, determined to shake free from a recent funk that included one of Indiana's ugliest losses just 24 hours earlier.\n\n\r\n                    LeVert scored 31 points, including nine in the final 2:17, and the Pacers defeated the Atlanta Hawks 133-126 on Thursday night.\n\n\r\n                    “I just wanted to bounce back,” LeVert said, referring to the Pacers scoring only 93 points against the NBA's worst defense in an 11-point home loss to Sacramento on Wednesday. “That's what this league is all about. I wanted to be at my best.”\n\n\r\n                    LeVert twice hit jumpers with his team ahead by only one point late. The Hawks missed a pair of 3-pointers that could have tied the game before the Pacers pulled away.\n\n\r\n                    “In crunch time, I love those moments,\" LeVert said. “It's just a part of me.” \n\n\r\n                    LeVert also had 12 assists for his first double-double since being acquired by the Pacers in January. All-Star forward Domantas Sabonis scored 30 points on 12-of-14 shooting with nine assists.\n\n\r\n                    “We hit some big shots when we needed 'em,” Indiana coach Nate Bjorkgren said. “Caris hit a couple big shots when we needed ’em.”\n\n\r\n                    The Pacers had dropped four of five, the latest loss considered by reserve guard T.J. McConnell as “unacceptable” and “easily” the worst of the season. He arrived Thursday fired up, too.\n\n\r\n                    “Caris got us some big buckets and we got some big stops,” said McConnell, who scored 13 of his 19 points in the second quarter. “We really locked in on both ends and finished down the stretch.\"\n\n\r\n                    Trae Young led the Hawks with 30 points and 10 assists. Bogdan Bogdanovic scored 28 and John Collins 25.\n\n\r\n                    “It's definitely frustrating any time you lose,” Young said.\n\n\r\n                    Hawks coach Nate McMillan lamented his team being outscored 70-58 inside and trailing by as many as 18 in the third quarter.\n\n\r\n                    “They were living in our paint all night long,” McMillan said. “We didn't get stops the first three quarters.”\n\n\r\n                    The Hawks, the Southeast Division leaders who had won three in a row, looked like the struggling team from the outset as the Pacers led 36-26 after the first quarter and 72-58 at halftime.\n\n\r\n                    “They outplayed us,” McMillan said. “They were the aggressors. They came out and disrupted us. They were better at establishing a tempo. They played their game.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: McMillan, whose four-year run with the Pacers ended in a one-and-done playoff exit last postseason, is 23-11 since being named Atlanta's head coach. ... Have lost seven consecutive games at Indianapolis, the last win coming in 2016.\n\n\r\n                    Pacers: Assistant coach Greg Foster was suspended for the game and center Goga Bitadze fined after a shouting match on the bench during the third quarter of Wednesday's home loss to the Kings. Bitadze swore at Foster as he ran past the bench.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Host the Washington Wizards on Monday night.\n\n\r\n                    Pacers: Host the Wizards on Saturday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997119.5462809
}