{
  "game_id": "0021601122",
  "espn_id": "400900517",
  "date": "Mar 30, 2017",
  "matchup": "CHI vs. CLE",
  "headline": "Bulls top Cavs 99-93, James moves to 7th on NBA scoring list",
  "body": "CHICAGO --  LeBron James and the Cleveland Cavaliers just might be at their lowest point since the King came home three years ago. Either way, they'll have to do better than this if they're going to be crowned again.\n\nNikola Mirotic tied season highs with 28 points and six 3-pointers, Jimmy Butler scored 25, and the Chicago Bulls beat the Cavaliers 99-93 Thursday on a night when James moved into seventh place on the NBA's career scoring list.\n\nJames passed Shaquille O'Neal, finishing with 26 points. That gave him 28,599 for his career -- three more than O'Neal. But the big night by the four-time MVP couldn't prevent the Cavaliers from matching a season high with their third straight loss.\n\nThat dropped the defending champions a half-game behind Boston for the Eastern Conference lead and left them with a 6-10 record in March.\n\n\"Just in a bad spot right now,\" said James, who had 10 rebounds and eight assists. \"I'm not disappointed with the effort. Just in a bad spot. We need to figure it out.\"\n\nFor Mirotic, it was his second straight game with 28 points and six 3s. He also had 10 rebounds, finishing a strong March.\n\n\"I feel it's my time now. It's never too late,\" he said. \"It's a very important moment for the team.\"\n\nRajon Rondo added 15 assists, Robin Lopez had 10 points and 11 rebounds, and the ninth-place Bulls moved within a game of Miami and Indiana in the Eastern Conference standings.\n\nThey also finished 4-0 against Cleveland to complete their first sweep of the Cavaliers since they took all three games during the 2011-12 season.\n\nKyrie Irving scored 20 for the Cavaliers, while Tristan Thompson added 15 points and nine rebounds. But the Bulls dominated Cleveland 37-21 in the third quarter to wipe out a nine-point halftime lead and hung on down the stretch.\n\n\"We won't be perfect in one day,\" Irving said. \"But it's no time to hold your head, I'll tell you that. ... We're gonna be just fine. It's ugly right now. It's real, real ugly.\"\n\nJames entered needing 23 points to tie O'Neal and matched him when he scored on a layup with 7:29 left in the game. He took sole possession of seventh place when he hit one of three free throws to make it 90-83 with 4:28 remaining.\n\nBut it was not an easy night for the Cavaliers.\n\nKevin Love fouled out with eight points and 10 rebounds when he got whistled on a basket by Butler moments after James tied O'Neal.\n\nRondo was able to get into the paint, particularly in the third quarter. That didn't hurt Butler or Mirotic, who was connecting all game.\n\n\"I definitely want to get back into the playoffs, and these young guys haven't experienced it,\" Rondo said. \"I'm trying to push every day to find a way to get in. We can't worry about other teams winning and losing. We need to go out every night and win these next seven to put ourselves in a position to get in.\"\n\nSURGING\n\nMirotic became the first Bulls player to hit six or more 3-pointers in back-to-back games. He is averaging 24.8 points over his past four games and has 20 3s in that span.\n\nTIP-INS\n\nCavaliers: G Iman Shumpert had four points and an assist in 22 minutes after missing two games because of a sore right knee. ... F Kyle Korver missed his second consecutive game because of a sore left foot. He has not been practicing and is expected to sit out Friday's game against Philadelphia before being re-evaluated. ... F Richard Jefferson sat out because of tendinitis in his left knee.\n\nBulls: F Cristiano Felicio was available but did not play after missing the previous three games because of a bruised lower back.\n\nUP NEXT\n\nCavaliers: Host Philadelphia on Friday to start a three-game homestand.\n\nBulls: Host Atlanta on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995010.2909179
}