{
  "game_id": "0021800231",
  "espn_id": "401070912",
  "date": "Nov 17, 2018",
  "matchup": "SAC @ HOU",
  "headline": "Harden nets 34, Rockets win 4th straight 132-112 over Kings",
  "body": "HOUSTON --  Houston's offense continues to improve, and the Rockets keep on winning.\n\nJames Harden had 34 points and eight assists, and the Rockets used a big first-half run on the way to their fourth straight victory, a 132-112 win over the Sacramento Kings on Saturday night.\n\nHarden, who shot 10 of 17 from the field, had 15 points in the third quarter. Chris Paul added 24 points and nine assists, including 18 points in the first half, as the Rockets built a 71-59 halftime lead.\n\n\"Yeah, tonight we did a really good job,\" Harden said. \"Other than our turnovers, I think the pace, guard, offense, defensively how active we were. It's pretty much a complete game.\"\n\nClint Capella finished with 23 points and 16 rebounds for Houston, which shot 57 percent from the floor, including 20 of 47 from 3-point range.\n\nHouston coach Mike D'Antoni said the Rockets were able to find the open shooters, and that was orchestrated by Harden and Paul.\n\n\"That's Clint being such a presence in the middle that he opens the outside up, and he was open for himself,\" D'Antoni said. \"So it was a good balance.\"\n\nAfter starting the season 1-5, Houston has won seven of its last nine games to move above .500 for the first time.\n\n\"We're making shots, playing the right pace, and it's our defensive end though,\" Paul said. \"We gave up over 100 tonight, but for the most part, the defense was good.\"\n\nBuddy Hield shot 10 for 17 and finished with 23 points and seven rebounds to lead the Kings, who have lost three of their last four games.\n\n\"This is a tough team to play on the back end of a back-to-back, and they were rested, they were focused, they were locked in and they do it well, they do it really well,\" Sacramento coach Dave Joerger said. \"We tried to give them different looks. We're not at a college or graduate level experience wise in playing pick-and-rolls the way these guys are a scientist at it.\"\n\nDe'Aaron Fox added 19 points, and Marvin Bagley had 16 points off the bench for Sacramento, which shot 45 percent from the field.\n\n\"Sometimes we just didn't make shots, although we scored 112 points and should've been able to give ourselves a chance to win,\" Fox said. \"We just have to be able to get stops out there.\"\n\nHouston used a 20-5 run at the end of the first quarter and start of the second to open a 45-32 lead. Eric Gordon hit consecutive 3-pointers with 10 minutes left in the second and Paul had 12 in the run. Houston's lead grew to 57-41 on a Gary Clark 3-pointer with 5  1/2 left in the first half that capped a 9-0 run.\n\nThe Rockets pushed the lead to 98-74 with four minutes left in the third when Harden scored 10 straight points. The Kings got no closer than 15 points the rest of the way.\n\nTIP-INS\n\nKings: Bogdan Bogdanovic had 14 points, and Justin Jackson had 10 points off the bench. ... Sacramento shot 11 of 35 from behind the arc. ... Sacramento had 64 points in the paint.\n\nRockets: The 132 points was a season-high for Houston. ... Gerald Green had 17 points, and Gordon had 11 points off the bench. ... Houston finished 20 of 24 from the free throw line.\n\nBLOCK PARTY\n\nHouston tied a season-high with 10 blocks against the Kings, led by five from Clint Capela. Houston only had 10 or more blocks in a game once last season.\n\nUP NEXT\n\nKings: Host Oklahoma City on Monday night.\n\nRockets: Host Detroit on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994219.638216
}