{
  "game_id": "0022400361",
  "espn_id": "401704927",
  "date": "Dec 19, 2024",
  "matchup": "ORL vs. OKC",
  "headline": "Thunder hold off Orlando's comeback bid, beat the Magic 105-99 behind Gilgeous-Alexander, Williams",
  "body": "ORLANDO, Fla. -- — Shai Gilgeous-Alexander scored 35 points and Jalen Williams scored six straight points in a run in the fourth quarter that helped turned back an Orlando comeback bid as the Oklahoma City Thunder beat the Magic 105-99 on Thursday night.\n\n\r\n              Isaiah Hartenstein had 12 points and 12 rebounds for the Thunder. Williams, Aaron Wiggins and Alex Caruso each finished with 11 points.\n\n\r\n              Anthony Black scored the first nine points in the fourth quarter and matched his career high with 23 points for the Magic.\n\n\r\n              Goga Bitadze added 15 points and 10 rebounds, and Wendell Carter had 10 points and 13 rebounds for Orlando, which lost its third straight and for the fourth time in five games.\n\n\r\n              Takeaways\r\n              Thunder: In their first game following a loss to Milwaukee in the NBA Cup final on Tuesday night, Oklahoma City opened the second quarter with an 18-4 run and held the lead the rest of the way. The Thunder weathered a scoreless stretch of 5 minutes, 51 seconds early in the second half. \n\n\r\n              Magic: Playing without the scoring power of injured forwards Paolo Banchero and Franz Wagner, who missed their 24th and fourth straight games, respectively, the Magic continued to search for offense against the best defensive team in the NBA. Orlando committed 20 turnovers.\n\n\r\n              Key Moment\r\n              With Gilgeous-Alexander on the bench and Oklahoma City leading by three early in the fourth quarter, Williams scored six straight points, including a spinning layup and a driving dunk, opening a decisive 14-3 run.\n\n\r\n              Key stats\r\n              The Thunder entered the game leading the NBA defensively in points per game (103.5), points per 100 possessions (103.7), field-goal percentage (.424), 3-point percentage (.331), free-throw percentage (.737), turnovers (19.08) and steals (12.16). Most of those numbers improved.\n\n\r\n              Up next\r\n              The Thunder play their third road game in four nights at Miami on Friday. The Magic host Miami on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997561.6730392
}