{
  "game_id": "0022300067",
  "espn_id": "401584695",
  "date": "Oct 25, 2023",
  "matchup": "BKN vs. CLE",
  "headline": "Donovan Mitchell scores 27 points as Cavaliers top Nets 114-113 in season opener",
  "body": "NEW YORK -- — Donovan Mitchell scored 10 of his 27 points in the fourth quarter, and Cleveland beat the Brooklyn Nets 114-113 on Wednesday night for the Cavaliers' first road win in a season opener since 2000.\n\n\r\n              Cleveland had six players score in double figures. Max Strus, who started in place of injured center Jarrett Allen, had 27 points and 12 rebounds. Isaac Okoro scored 18 points, and Darius Garland finished with 15. \n\n\r\n              “The thing about our team is that we're really resilient,” Mitchell said. “When the games are close ... you have to be locked in defensively. For me, when it's time, just kind of picking my spots and kind of getting to where I wanted to.”\n\n\r\n              Cam Thomas scored 36 for Brooklyn, setting a league record for most points for a reserve in a season opener. Mikal Bridges scored 11 of his 20 in the fourth quarter. Cam Johnson had 12 points, and Ben Simmons finished with four points, 10 rebounds and nine assists.\n\n\r\n              “I feel like we played well,\" Thomas said. “We got off to a slow start (at) the beginning so we had to fight back for three quarters (and) it's a tough thing to do against a good team like Cleveland.”\n\n\r\n              Brooklyn was built to be a defense-oriented team, but it struggled defensively in the preseason and it carried over to the home opener. Cleveland shot 46.8% from the field, including a 17-for-43 performance from 3-point range.\n\n\r\n              “We just have so (many) talented guys on this roster,\" Strus said. “It's going to be anybody's night any given game. Up and down the roster ... anybody can step up and play for us.”\n\n\r\n              The Cavaliers led 90-87 after three quarters, but the Nets opened the fourth with a 14-5 run. Dennis Smith Jr. converted a layup to make it 101-95 with 8:07 left.\n\n\r\n              Bridges made two foul shots to make it 111-105 with 1:24 remaining. Mitchell responded with a 21-foot jumper, and Strus made two free throws. Then Mitchell’s breakaway dunk tied the game.\n\n\r\n              Brooklyn went ahead 113-111 on two Bridges free throws with 19 seconds remaining. But Mitchell’s 3 gave Cleveland a one-point lead. \n\n\r\n              “Tonight was a good win,” Mitchell said. \"But there are things we — myself — could have done better to ultimately, not rely on that last shot.” \n\n\r\n              Thomas missed a 3 for the Nets in the final seconds.\n\n\r\n              “The play was for Mikal,” Brooklyn coach Jacques Vaughn said of the last play. “Caris (LeVert) did a great job of fighting over (the screen), making (the shot) tough. Cam was supposed to (get) it to Mikal. I couldn't call a timeout. I'm across halfcourt trying to, though.\"\n\n\r\n              The Cavaliers played short-handed. Allen was sidelined by a bone bruise in his left ankle, and reserve forward Dean Wade missed the game because of an illness.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Oklahoma City on Friday night.\n\n\r\n              Nets: Visit Dallas on Friday night for their first game since they traded Kyrie Irving to the Mavericks in a blockbuster deal in February.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996369.116757
}