{
  "game_id": "0021900209",
  "espn_id": "401160851",
  "date": "Nov 20, 2019",
  "matchup": "DET @ CHI",
  "headline": "Markkanen scores 24, Bulls beat Pistons 109-89",
  "body": "CHICAGO --  After struggling with his shot for weeks, Lauri Markkanen said busting out of a slump Wednesday night was as simple as seeing the ball go through the basket.\n\n\"The shot's been feeling good the whole time,\" he said. \"That's why it was frustrating to see it come out. It feels good to see a couple go in.\"\n\nMarkkanen scored 24 points on 7-for-14 shooting, Wendell Carter Jr. had 12 points and 15 rebounds, and the Chicago Bulls beat the Detroit Pistons 109-89.\n\nIt was Markkanen's first 20-point game since scoring 35 points on opening night. Tomas Satoransky and Shaquille Harrison each had 15 points as the Bulls snapped a three-game losing streak.\n\n\"I thought he was aggressive, I thought he ran the floor, I thought he got two real good ones at the rim early where he ran the floor,\" Chicago coach Jim Boylen said of Markkanen. \"I thought his effort was really good, and I thought he locked in defensively.\"\n\nDerrick Rose had 18 points and Blake Griffin -- in just his third game of the season -- added 16 as the Pistons dropped their fifth straight.\n\n\"Defensively, it was a lack of effort tonight,\" Pistons forward Langston Galloway said. \"It was embarrassing, it really is embarrassing. We have to fight our way out of this. We're in a deep hole right now. We really have to step it up.\"\n\nThe Bulls won the first meeting between the teams 112-106 on Nov. 1, also at the United Center.\n\nDetroit's Andre Drummond finished with six points and 14 rebounds before fouling out with six minutes to go. Drummond had 25 points and 24 rebounds against the Bulls three weeks ago.\n\nMarkkanen, who entered the game shooting just 36.2% from the field, had 15 first-half points on 5-for-8 shooting (including 2 for 2 on 3-pointers) as Chicago took a 59-55 halftime lead.\n\nThat included an incredible six points on one possession late in the second quarter. Markkanen hit a 3-pointer while being fouled by Drummond, who was assessed a flagrant foul after review. Markkanen hit the free throw to complete the four-point play and then scored on a driving layup after the Bulls inbounded the ball.\n\nThat stretch snapped a tie at 51 and gave the Bulls a 57-51 lead with 1:55 left.\n\nChicago took an 84-71 lead after three quarters and then stretched it to 89-71 on five quick points by Thaddeus Young. The Bulls coasted from there. Markkanen hit a 3 with about 5 1/2 minutes to play for a 99-77 lead, Chicago's biggest of the game.\n\nTIP-INS\n\nPistons: G Reggie Jackson (lumbar stress reaction) missed his 12th straight game. F Tony Snell (left hip strain) and G Khyri Thomas (right foot stress reaction) also sat out.\n\nBulls: F Otto Porter (left foot) will be sidelined an additional two-plus weeks after a follow-up MRI taken on Tuesday revealed a bone bruise that wasn't discovered in the initial MRI two weeks ago. Porter will be re-evaluated in two weeks . F Chandler Hutchison, who had been starting in Porter's absence, sat out with inflammation in both shins ... G Coby White played despite spraining an ankle in pregame warmups and scored 12 points.\n\nDENG HONORED\n\nLuol Deng, who signed a one-day contract with the Bulls last month before retiring, was honored during the game. The 6-foot-9 forward played the first 10 of his 15 NBA seasons with the Bulls after being selected with the seventh pick of the 2004 draft.\n\n\"It's what makes sense,\" Deng said. \"Chicago means a lot to me. When you look back, coming here as a young kid, a young man, 19 ... there's a lot of history here and I wanted it to end the right way.\"\n\nA video tribute was played during a timeout in the second quarter and several of Deng's former Bulls teammates -- including Joakim Noah and Ben Gordon -- attended the game. Deng said he picked this game because he wanted Rose to be present as well.\n\nSTEPPING UP\n\nHarrison had played a total of 12 minutes before Wednesday, but was inserted into the starting lineup with Porter and Hutchison sidelined. Besides the 15 points (on 7-for-12 shooting), Harrison had 11 rebounds and five assists in 26 minutes.\n\n\"He stayed ready,\" Boylen said. \"It's really a credit to him. He's a winning dude.\"\n\nUP NEXT\n\nPistons: Host the Atlanta Hawks on Friday night following a winless three-game road trip.\n\nBulls: Host the Miami Heat on Friday night to conclude a four-game homestand.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996301.767333
}