{
  "game_id": "0022400071",
  "espn_id": "401704637",
  "date": "Oct 23, 2024",
  "matchup": "LAC vs. PHX",
  "headline": "Durant, Beal lead Suns to 116-113 OT victory over Clippers, spoiling LA's Intuit Dome opener",
  "body": "INGLEWOOD, Calif. -- — Kevin Durant scored 25 points, Bradley Beal added 24 and the Phoenix Suns beat the Clippers 116-113 in overtime Wednesday night, spoiling Los Angeles' Intuit Dome debut in the opener for both teams.\n\n\r\n              James Harden had 29 points and 12 rebounds for the Clippers. He had a chance to send it to double overtime, but missed the second of two free throws with 4.8 seconds remaining.\n\n\r\n              Jusuf Nurkic gave the Suns a three-point advantage with a pair of free throws. The Clippers had one last chance to send it to another extra session, but Grayson Allen forced a turnover near midcourt after the inbounds pass.\n\n\r\n              Ivica Zubac had 21 points for the Clippers, but fouled out with 2:15 remaining in overtime.\n\n\r\n              Takeaways\r\n              Suns: Mike Budenholzer picked up the victory in his first game as Phoenix's coach and improved to 12-9 in his career against the Clippers. \n\n\r\n              Clippers: Norman Powell will go down as the player who made the first basket at Intuit Dome with his jumper 17 second into the game. ... LA had a 62-42 advantage in points in the paint and outrebounded the Suns by nine (51-42), but Zubac's foul trouble in overtime played a huge role.\n\n\r\n              Key moment\r\n              The Clippers had a 99-90 lead before the Suns scored 11 straight points to go back on top. Devin Booker had four points during Phoenix's rally, but fouled out with 1:27 remaining. Harden scored four straight points to give LA a 103-101 advantage, but Durant tied it with a 15-footer with 21.2 seconds remaining.\n\n\r\n              Key stat\r\n              The Suns were 1 of 4 from the field in overtime, but made all 10 of their foul shots. Nurkic and Beal were 4 of 4 and Durant made a pair.\n\n\r\n              Up next\r\n              The Suns remain in Southern California to face the Lakers on Friday night, while the Clippers are at Denver on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998064.370538
}