{
  "game_id": "401810002",
  "espn_id": "401810002",
  "date": "Nov 01, 2025",
  "matchup": "DET vs DAL",
  "headline": "Jalen Duren's 33 points lead Pistons to victory over Mavericks in Mexico City",
  "body": "MEXICO CITY -- — Jalen Duren had a career high 33 points and also pulled down 10 rebounds, Cade Cunningham added 21 points with 18 assists and the Detroit Pistons pulled away in the fourth quarter to beat the Dallas Mavericks 122-110 in Mexico City on Saturday night.\n\n\r\n              Duncan Robinson added 18 points and Ausar Thompson had 15 for the Pistons, who won their second game in a row.\n\n\r\n              “I just wanted to get the win, coach had a great game plan and my teammates found me and the rest is history,” said Duren.\n\n\r\n              Cunningham's 18 assists were a career high.\n\n\r\n              “It is cool, super cool, the coaching staff put me in great position, and my teammates helped me, to do it our here was cool,” said Cunningham. “The win is important, we are continuing to grow and it is important to represent the Pistons organization, we wanted to make sure to handle our business.”\n\n\r\n              D’Angelo Russell came off the bench to score 31 points while first overall pick Cooper Flagg scored a season high 16 points on 3-for-14 shooting for the Mavericks.\n\n\r\n              The Mavericks led 93-87 after three quarters but were outscored 35-17 in the fourth.\n\n\r\n              Dallas played without forward Anthony Davis, who is expected to miss two games with left leg injury sustained on Wednesday against Indiana.\n\n\r\n              “They dominated us in the paint, give them credit, they were good in the fourth quarter,” said Mavericks coach Jason Kidd. “It is hard to win in this league, it is not an excuse, you have to play with the guys that you have.”\n\n\r\n              It was the 15th regular-season game played in Mexico City, and it was the fourth for the Mavericks, more than any other franchise. The Phoenix Suns and the Orlando Magic have played in Mexico City three times each.\n\n\r\n              Up next\r\n              Pistons: At Memphis on Monday night.\n\n\r\n              Mavericks: At Houston on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042542.93789
}