{
  "game_id": "0021600352",
  "espn_id": "400899794",
  "date": "Dec 10, 2016",
  "matchup": "HOU vs. DAL",
  "headline": "Harden leads Rockets over Mavs 109-87 for 6th straight win",
  "body": "HOUSTON --  The Houston Rockets still had a double-digit lead, but had gotten a little careless and had three turnovers in a row in the third quarter on Saturday night against the Dallas Mavericks when coach Mike D'Antoni had seen enough.\n\n\"Coach went off a little bit,\" Trevor Ariza said. \"I think that was the turning point for us to get our head in the game and for us to start playing the way we normally play.\"\n\nSoon after that, Ariza -- who finished with 17 points -- made three straight 3-pointers to pad the lead and the Rockets beat the Mavericks 109-87 for their sixth straight win.\n\n\"They turned it on when they needed to and then as a coach you kind of feel silly sometimes ... (but) you just try to caution them because things happen and they're a good 3-point shooting team, they get hot,\" D'Antoni said.\n\nJames Harden had 18 points, 16 assists and nine rebounds and Eric Gordon added 18 points to give Houston its first six-game winning streak since Oct. 28-Nov. 6, 2014.\n\nGordon's 3-pointer extended Houston's lead to 16 in the fourth quarter before Harrison Barnes hit a basket on the other end. Montrezl Harrell then made an off-balance layup as he was fouled and crashed to the court. He made the free throw to leave Houston up 92-75.\n\nWesley Matthews made a 3 with about six minutes left to get the Mavericks within 12. But Patrick Beverley, who scored all of his 15 points in the fourth quarter, hit 3s on the next two possessions to push Houston's lead to 100-82.\n\nMatthews scored 26 points to lead the Mavericks and Barnes finished with 20.\n\n\"When you get off to a bad start on the road, it just makes it harder,\" Dallas coach Rick Carlisle said. \"We hung in and kept it within 10 or 11 a lot of the game, but it was hard getting over the hump.\"\n\nA layup by Seth Curry cut Houston's lead to nine points midway through the third quarter. That's when Ariza got hot, making 3-pointers on three straight possessions to power a 9-4 run that pushed Houston's lead to 75-61.\n\n\"It was a drag, it was dull and we couldn't find energy,\" Harden said. \"But Trevor made some big shots, kind of got us going and pushed the lead up going to the fourth quarter.\"\n\nGordon and Sam Dekker added 3-pointers after that to leave the Rockets up 86-69 entering the fourth quarter.\n\nAriza made four 3s to move past Shane Battier for fourth on Houston's all-time 3-pointer list with 579.\n\nHarden's 16 assists were his most since he had 17 in Houston's season opener.\n\nTIP-INS\n\nMavericks: Matthews received a technical for arguing a call in the third quarter. ... Curry had seven points in 26 minutes in his second game back after missing four games with a sprained right knee. ... Deron Williams had nine points and six assists.\n\nRockets: Harrell made his first career 3-pointer in the first quarter. It was the second attempt of his career and his first this season. ... Houston had 60 points at halftime. It was the 13th time they've scored at least 60 by halftime and the sixth time in nine games. ... Gordon made six 3s and has made at least three in each of his past nine games. ... The Rockets made 19 3-pointers to extend their NBA record of consecutive games with at least 10 3s to 23 games.\n\nREJECTED\n\nDallas forward Justin Anderson had an embarrassing moment near the end of the fourth quarter when he attempted a two-handed dunk but it bounced off the rim and he fell to the court on his back. The crowd snickered and booed as he got up and shook his head. A moment later the miscue was played on the jumbotron and the boos started again.\n\nTHEY SAID IT\n\nCarlisle on why Devin Harris played just over four minutes on Saturday: \"He's not injured or anything like that. I just determined that it was best to not play him anymore. He just didn't look right to me. He seemed tired and I didn't like his first stint. So I pulled the plug.\"\n\nUP NEXT\n\nMavericks: Host Denver on Monday.\n\nRockets: Host Brooklyn on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995778.9704828
}