{
  "game_id": "0021601175",
  "espn_id": "400900553",
  "date": "Apr 06, 2017",
  "matchup": "MIL @ IND",
  "headline": "Paul George scores 23 points, Pacers beat Bucks 104-89",
  "body": "INDIANAPOLIS --  With the bottom half of the Eastern Conference playoff picture tightening up on a nightly basis, Paul George and the Indiana Pacers got a much-needed home win Thursday night to keep their postseason hopes alive.\n\nGeorge had 23 points and 10 rebounds to help the Pacers beat the Milwaukee Bucks 104-89. The loss was Milwaukee's third straight after winning seven of its previous eight.\n\nJust three games remain for the Pacers (39-40). And their team leader said he thinks the team is playing at the highest level all season. But the timing certainly could be better.\n\n\"I think that sense of urgency we've been talking about -- I think it's finally starting to hit home,\" George said. \"The frustrating part about it is, not taking care of the games we should have way earlier (in the season) and knowing playing at this level we're playing at is the team we should have been. It's tough. Here we are fighting for a spot when this all could have been avoided.\"\n\nPoint guard Jeff Teague scored 15 points and had seven assists for the Pacers, Thaddeus Young had 12 points, and Lance Stephenson nine in his third game back with Indiana.\n\nGiannis Antetokounmpo led Milwaukee with a game-high 25 points, seven rebounds and six assists. He scored 16 points in the first half to help the Bucks keep pace, but Indiana kept him in check in the second half and pulled away. Mirza Teletovic added 15 points off the bench for the Bucks.\n\nThe Pacers had several key runs that thwarted Milwaukee's attempts to gain an edge.\n\nWith the game tied at 38 in the second quarter, Indiana used a 10-0 run to create its first cushion on its way to a 56-50 halftime lead. A 13-0 run in the third quarter allowed the Pacers to pull away from the Bucks after they'd pulled within 63-61 on an Antetokounmpo 3-point play.\n\nThe Pacers needed just 19 points in the fourth quarter to seal the win thanks to its defense that held the Bucks to 16 in the final period.\n\nIndiana's second straight win, coupled with Milwaukee's third straight loss, creates a logjam in the bottom half of the Eastern Conference standings with less than a week to go.\n\nJust 1 1/2 games separates fifth-place Atlanta from the ninth-place Heat (38-40), who had the night off. Seventh-place Chicago (39-40) defeated Philadelphia on Thursday. The Bulls hold the tiebreaker over the Pacers (39-40), who moved up a spot to eighth with Miami off. The Heat also hold the tiebreaker over Indiana, should there be a tie after the regular season finale Wednesday.\n\nBucks coach Jason Kidd acknowledged how important Thursday's game was for both teams.\n\n\"In March and April, everyone is trying to win,\" Kidd said. \"Teams that aren't even in the playoffs are trying to win, too. You can't take anybody lightly and you can't exhale.\"\n\nAlthough the Pacers remain in playoff contention -- the moved up one spot to eighth with Miami off Thursday -- their fate may not be completely in their control. Chicago and Miami both hold the season tiebreaker over the Pacers.\n\nGeorge said the Pacers are paying close attention to the Chicago Bulls and Miami Heat as the race for the Eastern Conference Playoffs winds down.\n\n\"We've got to be mindful of what (Miami and Chicago) are doing. We don't really control our destiny, to an extent,\" George said. \"We've got to, again, rely on a little help with those (teams) losing games. Only thing we can do is give ourselves a fighting chance.\"\n\nSecond-year center Myles Turner said the Pacers can take advantage of that fighting chance -- if they get it.\n\n\"I get the sense that we're coming together at the right time,\" Turner said. \"I just think we've been inconsistent all year and ... if we can get into the playoffs we'll take off.\"\n\nTIP-INS\n\nBucks: Milwaukee had won the previous three matchups against Indiana. ... The Bucks fell to 18-21 on the road.\n\nPacers: The Pacers went 1/3 this season against the Bucks. ... Indiana improved to 28-12 at home, the fourth-best home record in the Eastern Conference.\n\nUP NEXT\n\nBucks: At Philadelphia on Saturday.\n\nPacers: At Orlando on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995124.329112
}