{
  "game_id": "0021800797",
  "espn_id": "401071470",
  "date": "Feb 05, 2019",
  "matchup": "CLE vs. BOS",
  "headline": "Tatum scores 25, Irving-less Celtics down Cavaliers 103-96",
  "body": "CLEVELAND --  Gordon Hayward finally got some closure at Quicken Loans Arena.\n\nHe walked off the floor.\n\nMaking his first visit to Cleveland since suffering a horrific broken left ankle in his debut for Boston in 2017, Hayward scored 18 points as the Celtics beat the Cavaliers 103-96 on Tuesday night for their fifth straight victory despite missing All-Star guard Kyrie Irving.\n\nA strained left hip prevented Irving from facing his former team, but Jayson Tatum helped make up for his absence with 25 points. Marcus Smart had 17 and Jaylen Brown finished with 13.\n\nHayward came off the bench and made 9 of 14 shots and added six rebounds and five assists in 30 minutes. The 28-year-old admitted being nervous about coming back to where his leg grotesquely snapped as he jumped to catch a lob pass in his first game after signing as a free agent with the Celtics.\n\nHis season was over in just five minutes, and Hayward was taken off the floor on a stretcher.\n\n\"I told my wife I was a little anxious about it for sure sitting in my hotel room last night,\" Hayward said. \"Just thinking about how everything changed and where I was sitting a year ago from now.  Just happy to try to find some perspective, I guess. Just happy that I was out there.\"\n\nRookie Collin Sexton scored 27 -- but none in the fourth quarter -- for the Cavs, who dropped to 3-20 since Dec. 19. Alec Burks, who has been linked to recent trade talks, added 21 for Cleveland. Larry Nance Jr. had 11 points and 12 rebounds.\n\nThe struggling Cavs were still within 94-91 when Smart hit a pull-up jumper, and after a miss by Sexton, dropped a 3-pointer. Burks had a monster dunk and 3 to make it 101-96, but Tatum blocked a shot by Ante Zizic underneath and Tatum closed it out by making a pair of free throws with 1:35 remaining.\n\nWithout Irving and starting forward Marcus Morris (sore right knee), the Celtics needed someone to pick up the scoring slack and make plays down the stretch, and Tatum came through at both ends.\n\n\"We're super confident with this lineup,\" Tatum said. \"We're young, but we were very battle tested last year together in the playoffs.\"\n\nCeltics coach Brad Stevens was sure the Cavs would give his team all it could handle.\n\n\"Everybody just looks at records and makes assumptions that things are easy and they're not,\" Stevens said. \"It's hard to win. That team over there is playing hard. We were lucky to be where we were at halftime. You knew at the start of the third quarter it was going to be back and forth the rest of the way. \"\n\nTIP-INS\n\nCeltics: Irving has missed three of Boston's four visits since the Cavs traded him. ... Stevens said reserve center Aron Baynes (bruised foot) will be out through the All-Star break. He said Morris' injury is not a \"long-term\" thing and it's possible he'll play Thursday. ... F Daniel Theis was called for a rare, punching-the-ball violation while going after an offensive rebound in the fourth quarter.\n\nCavaliers: F Cedi Osman missed his first game since rolling his right ankle on Saturday against Dallas. Osman averages 12.6 points. ... Gs Nik Stauskas and Wade Baldwin have joined the Cavs but are not ready to play. They were acquired on Monday from Portland in the trade for F Rodney Hood.\n\nIRVING UPDATE\n\nStevens said Irving, who is averaging a team-high 23.8 points per game, may return on Thursday when Boston hosts LeBron James and the Los Angeles Lakers, hours after the NBA's trade deadline.\n\n\"I would hope he would be able to go, but I don't know for sure,\" Stevens said. \"We'll know more tomorrow.\"\n\nRACING ROOKIE\n\nSexton came out in attack mode, scoring 18 points in the first half on 8-of-13 shooting. He cooled down after halftime and missed all five shots in the fourth quarter.\n\nStill, it was a strong performance to build upon.\n\n\"The last game I missed like six layups that I usually make, so that was one thing I've continued to work on this week,\" he said. \"Teams have been daring me to shoot and I got to knock it down for my teammates.\"\n\nTRADE TALK\n\nBurks has already been traded once this season -- Cleveland got him from Utah in the Kyle Korver deal -- and he's not concerned about chatter that he'll be dealt again.\n\n\"I don't believe in rumors until something happens,\" he said. \"If nothing happens then I'm not going nowhere. If something happens it happens. I enjoy my time here and hopefully it keeps going.\"\n\nPERFECT FORM\n\nTatum went 12 of 12 from the free-throw line and Boston didn't miss any of its 14 attempts.\n\n\"I was just looking to be aggressive and attack the rim from the beginning,\" Tatum said. \"It's the easiest way to get points, getting to the line.\"\n\nUP NEXT\n\nCeltics: Host the Los Angeles Lakers on Thursday.\n\nCavaliers: At Washington on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994759.3148968
}