{
  "game_id": "0021800738",
  "espn_id": "401071410",
  "date": "Jan 27, 2019",
  "matchup": "MIL @ OKC",
  "headline": "George scores 36, leads Thunder past Bucks",
  "body": "OKLAHOMA CITY --  Paul George delivered once again for Oklahoma City.\n\nEven Giannis Antetokounmpo was impressed\n\nGeorge had 36 points and 13 rebounds, and the Thunder beat Antetokounmpo and the Milwaukee Bucks 118-112 on Sunday for their fifth straight victory.\n\nGeorge, an All-Star starter, scored seven points in the final 1:15 to help the Thunder hold off the team with the NBA's best record. As he stood at the free-throw line late in the game, the M-V-P chants that had been reserved for Russell Westbrook in recent years rained down on George.\n\n\"He was doing everything,\" said Antetokounmpo, another All-Star starter. \"Making 3s, mid-range, dunking, floaters. It was a little of everything. He was playing amazing. Down the stretch, you know where the ball's going to go. It's going to go to Paul George, and he closed the game out for them and he played the right way.\"\n\nWestbrook had 13 points, 13 rebounds and 11 assists for his 16th triple-double of the season and No. 120 for his career. Jerami Grant scored 16 points and Terrance Ferguson added 15 for the Thunder.\n\nAntetokounmpo had 27 points and 18 rebounds for Milwaukee, and Khris Middleton added 22 points.\n\nEric Bledsoe hit a 3-pointer with just over a minute left to cut Oklahoma City's lead to three, but George drained a 3-pointer in Malcolm Brogdon's face at the end of the shot clock to push the margin back up to six.\n\n\"I've got a smaller guy on me,\" George said. \"Just shoot over the top. Just took advantage of that.\"\n\nGeorge scored 21 points in the first half to help the Thunder take a 56-42 lead. Antetokounmpo missed all six of his shots before the break and scored just three points.\n\n\"Giannis had some good looks he normally makes, he didn't make, but then I think individually they were good on him,\" Bucks coach Mike Budenholzer said. \"Jerami Grant and then a few other guys take the challenge individually. A lot of help. Guys are swarming him, so credit to them.\"\n\nSteven Adams, Oklahoma City's lumbering 7-foot center, got the crowd amped up with a surprise early in the third quarter. He got a steal, dribbled three quarters of the way down the court and converted a layup to give the Thunder a 64-52 lead.\n\nThe Thunder led 82-66 before the Bucks hit three straight 3-pointers, including two from Middleton. Oklahoma City held on to lead 89-79 at the end of the third quarter.\n\nTIP-INS\n\nBucks: Brook Lopez made all four of his shots in the first quarter, all 3-pointers. He finished with 19 points. ... Antetokounmpo had 10 rebounds in the first half.\n\nThunder: Westbrook made just 5 of 20 shots. ... Grant had five blocks. ... Made just 14 of 25 free throws.\n\nNOEL STEPS UP\n\nAdams left in the first quarter with a right ankle sprain, but he returned in the second quarter. Nerlens Noel stepped in and played just over 17 minutes, finishing with six points, six rebounds and two blocks.\n\n\"Coach trusted me with extended minutes when Steve was down,\" he said. \"I wanted to do my best job of changing the game. Regardless of what side of the ball it's on, I just want to do what I do as a player.\"\n\nUP NEXT\n\nThe Bucks play at the Detroit Pistons on Tuesday.\n\nThe Thunder are at the Orlando Magic on Tuesday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994481.130284
}