{
  "game_id": "0022400927",
  "espn_id": "401705493",
  "date": "Mar 09, 2025",
  "matchup": "SAC @ LAC",
  "headline": "Leonard's hook shot at buzzer in OT gives Clippers 111-110 win over Kings",
  "body": "INGLEWOOD, Calif. -- — Kawhi Leonard’s hook shot at the buzzer lifted the Los Angeles Clippers over the Sacramento Kings 111-110 in overtime on Sunday night to tighten their grip on eighth place in the West.\n\n\r\n              Leonard dribbled to the top of the key with 21.6 seconds remaining and let the clock tick down before making his winning move through defenders in the lane. The ball bounced on the rim before going in. He finished with 17 points.\n\n\r\n              James Harden had 29 points, nine rebounds and 11 assists for the Clippers, who won their third in a row. Ivica Zubac had 22 points and 14 rebounds.\n\n\r\n              DeMar DeRozan had 31 points and 10 assists and Zach LaVine added 30 points for the ninth-place Kings. They fell to 0-3 against the Clippers this season. Jonas Valanciunas had 17 rebounds.\n\n\r\n              Harden hit a jumper in the lane to tie the game 97-97 with 11.9 seconds remaining in regulation. LaVine missed a jumper from the right side as time expired to force the five-minute extra session.\n\n\r\n              The Kings blew a seven-point lead with 1:40 remaining in regulation.\n\n\r\n              DeRozan and LaVine combined to score all 13 of the Kings' points in OT. \n\n\r\n              Takeaways\r\n              Kings: They continue to scrap despite the ongoing absences of Domantas Sabonis and Malik Monk. \n\n\r\n              Clippers: Coach Tyronn Lue went home before the game because of back pain and was replaced by assistant Brian Shaw. \n\n\r\n              Key moment\r\n              The Clippers outscored the Kings 14-13 in overtime. They got back-to-back baskets by Derrick Jones Jr., including a go-ahead 3-pointer after DeRozan tied the score at 104.\n\n\r\n              Key stat\r\n              LaVine had been shooting 62% from 3-point range in his previous six games. He missed all of his six attempts in regulation before hitting a 3 in overtime. As a team the Kings were 9 of 34. The Clippers weren't much better, going 10 of 31.\n\n\r\n              Up next\r\n              Kings host the New York Knicks on Monday, and Clippers visit New Orleans on Tuesday to open a three-game Eastern trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997319.098591
}