{
  "game_id": "0022000532",
  "espn_id": "401267692",
  "date": "Mar 01, 2021",
  "matchup": "CLE @ HOU",
  "headline": "Cavs get 101-90 win to hand Houston 12th straight loss",
  "body": "HOUSTON -- — Collin Sexton scored 39 points and the Cleveland Cavaliers handed the hapless Houston Rockets their 12th straight loss with a 101-90 victory on Monday night. \n\n\r\n                    The Cavaliers have won a season-high four straight after losing their previous 10 games. \n\n\r\n                    “It gives our guys belief that they can,\" coach J.B. Bickerstaff said. “Our guys put in a lot of work (and) because of their continued belief in one another... that puts us in a position to get the wins we’ve gotten the past few games.\" \n\n\r\n                    Cleveland had a 10-point lead in the fourth quarter before John Wall scored all of Houston’s points in a 6-2 run that cut the deficit to 95-89 with 3 minutes left.\n\n\r\n                    The Cavaliers scored the next four points with the help of a steal by Darius Garland to push the lead back to 10 a minute later. \n\n\r\n                    “We’re hot right now. So we just have to keep playing like we did the last four games,\" said Cedi Osman, who had 11 points after missing the last game with back spasms.\n\n\r\n                    It’s Houston’s longest losing streak since dropping 15 in a row in 2001 and the first time the Rockets have lost five straight at home since March 2006. Wall's performance was the only thing that kept the Rockets in this one. He had 23 points by halftime finished with a season-high 32. \n\n\r\n                    Houston led by one early in the fourth quarter after a 3-pointer by Ben McLemore when the Cavaliers used a 13-0 spurt to take a 90-78 lead midway through the period. Osman had two 3-pointers in that stretch and Sexton added five points.\n\n\r\n                    Bickerstaff was impressed with Sexton's performance.\n\n\r\n                    “I saw a determination,\" Bickerstaff said. “He was not going to let us lose.\" \n\n\r\n                    Sexton has scored 22 points or more in nine straight games.\n\n\r\n                    “I knew I had to be better for my teammates,\" Sexton said. “And now I’m starting to just play and not overthink the game.\" \n\n\r\n                    The game was tied at 63-all after a 3-pointer by P.J. Tucker with about 5 minutes left in the third quarter. The Cavaliers used an 8-2 run after that, with the first five points from Dean Wade, to make it 71-65. \n\n\r\n                    Osman made a 3 for Cleveland after two free throws from Tucker before Mason Jones finished the quarter with a three-point play to cut Houston’s deficit to 74-70 entering the fourth. \n\n\r\n                    Though they couldn't pull it out late, the Rockets played better than they did in a 49-point loss to Memphis. They made just 4 of 45 3-point attempts on Sunday night in a game where they shot a franchise-low 27.7% overall. \n\n\r\n                    On Monday they’d made four 3s by early in the second quarter and finished 10 of 31 from long range. \n\n\r\n                    “I believe in this group's competitiveness and their fight, especially coming off the loss we had last night,\" Houston coach Stephen Silas said. “I’m disappointed in the loss obviously and I’m disappointed the streak has continued, but I’m proud of these men who gave it everything they had and they just didn’t have enough tonight.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: Garland had 14 points and seven assists. Bickerstaff said after the game that he was being evaluated for a groin injury. ... Osman added 11 points off the bench. \n\n\r\n                    Rockets: Eric Gordon sat out with a sore left knee. ... Danuel House left in the second quarter with a bruised right knee and didn’t return. ... Wall had five assists after finishing without an assist on Sunday for the first time in his career. \n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Host Indiana on Wednesday night.\n\n\r\n                    Rockets: James Harden will face his former team for the first time since a January trade on Wednesday night when the Rockets host Brooklyn. \n\n\r\n                    ----------",
  "source": "espn_api",
  "crawled_at": 1764997880.042974
}