{
  "game_id": "0022300752",
  "espn_id": "401585380",
  "date": "Feb 10, 2024",
  "matchup": "ORL vs. CHI",
  "headline": "Wagner scores 36 as Magic beat Bulls 114-108 in overtime",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 36 points, Cole Anthony had 14 points and 11 rebounds off the bench, and the Orlando Magic turned back the Chicago Bulls 114-108 in overtime Saturday night.\n\n\r\n              In his second straight 30-point game, Wagner scored off an offensive rebound for the first basket in OT after the Bulls staged a late comeback. They tied it on DeMar DeRozan's three-point play with 45.9 seconds left in regulation, but the Magic held the lead throughout overtime.\n\n\r\n              Paolo Banchero had 19 points, eight assists and seven rebounds for Orlando, which beat the Bulls for the third time this season. The Magic also got major defensive and rebounding contributions from Anthony, Jonathan Isaac and little-used Goga Bitadze.\n\n\r\n              “These guys that had not played some minutes came in and stepped up huge,” coach Jamahl Mosley said.\n\n\r\n              DeRozan led Chicago with 28 points. Nikola Vucevic added 26 points and 17 rebounds, and Ayo Dosunmu scored 19 for the Bulls despite playing much of the game with five fouls.\n\n\r\n              Fouls were a big problem for the Bulls, who had to adjust their rotation after Andre Drummond was whistled for four in the first half.\n\n\r\n              “I think foul trouble really exhausted our team, quite honestly,” coach Billy Donovan said. “I thought we were really tired coming down the stretch. I don’t want to use that as an excuse, but I just felt like we were gassed.”\n\n\r\n              DeRozan, Vucevic and Coby White all played more than 43 minutes.\n\n\r\n              “Pretty sure everybody is tired,” DeRozan said. “It's that point in the season where everybody is waiting for a break. We have to leave it all out there.”\n\n\r\n              White finished with 14 points and seven assists, shooting 5 for 21 after four straight 20-plus scoring games in which he shot 50% or better.\n\n\r\n              Dosunmu and DeRozan closed the first half with 3-pointers to trim an early 10-point Magic lead to 52-50 at the break.\n\n\r\n              The Bulls hit their first five shots of the second half to complete a 15-0 run and move ahead 59-52. They stretched their lead to 11 late in the third quarter on a dunk by Dalen Terry.\n\n\r\n              DeRozan threatened to take over the game before the Magic put Isaac on him to alter his shots late in the third quarter.\n\n\r\n              “We’ve got a defensive belt we started giving out after games, but it’s just going to stay in his locker,” Anthony said of the 6-foot-11 Isaac. “I told Jonathan, `You’re the best defender I’ve ever seen in my life.”\n\n\r\n              Playing a season-high 25 minutes, Isaac finished with 12 rebounds, seven points and three blocks.\n\n\r\n              A trio of 3-pointers by Wagner helped Orlando regain the lead in the fourth, but DeRozan's three-point play with 45.9 seconds left tied it at 101. Both teams missed shots in the final 20 seconds of regulation.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Visit the Atlanta Hawks on Monday.\n\n\r\n              Magic: Host the Oklahoma City Thunder on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995697.57365
}