{
  "game_id": "0021800071",
  "espn_id": "401070752",
  "date": "Oct 26, 2018",
  "matchup": "MIN vs. MIL",
  "headline": "Middleton leads balanced effort as Bucks beat Wolves 125-95",
  "body": "MINNEAPOLIS --  First-year coach Mike Budenholzer brought his heavy reliance on 3-pointers to the Milwaukee Bucks this season, transforming a team not known for its prowess from beyond the arc.\n\nThe approach has taken hold and Milwaukee has tied the best start in franchise history.\n\nGiannis Antetokounmpo had 15 points and 12 rebounds in just 23 minutes, Ersan Ilyasova added 16 points off the bench and the Bucks beat the Minnesota Timberwolves 125-95 on Friday night.\n\nKhris Middleton scored 16 points and hit four 3-pointers for Milwaukee, which is 5-0 for the second time in franchise history. The 1971-72 Bucks led by Hall of Famers Kareem Abdul-Jabbar and Oscar Robertson started 7-0.\n\nFive players scored in double figures for Milwaukee, which made a season-high 19 3-pointers.\n\n\"It's been a complete turnaround,\" Bucks guard Malcolm Brogdon said. \"Big part, credit to Bud. Not only do we have a great system that we play to advantage every night, our strengths, but he takes care of our bodies. We don't feel run down. We feel healthy, everybody's able to play.\"\n\nMilwaukee entered the game with the ninth-best offensive rating in the NBA to go with the fourth-best defensive rating.\n\nThe Bucks also entered shooting 40.8 3-pointers per game, up from last season's total of 24.7 per game. They had connected on 15.3 3s per game this season, the third-highest total in the league. Milwaukee hit just 8.8 per game last season.\n\n\"Tonight's exactly how we want to play,\" Antetokounmpo said. \"I think we did a great job moving the ball, playing hard. And especially, I think they scored like 16 points in the first quarter? We were playing hard defensively, and we were moving the ball offensively.\"\n\nKarl-Anthony Towns finished with 16 points for a listless Minnesota squad dealing with the distraction of star Jimmy Butler's trade request. Butler started despite being questionable with an illness and had a season-low four points on 2-of-11 shooting.\n\n\"I think I was a lot like everybody else,\" Butler said, downplaying the illness. \"We let our offense dictate what our defense was going to bring. Me, speaking for myself, I can never let that happen. My entire career has been my defense dictates my offense. Bad one; it's behind me right now this second. Hopefully, it is for everybody else.\"\n\nThe specter of the trade request has lingered around the Wolves, but Butler had turned boos to cheers in leading Minnesota to wins in the first two home games.\n\nThe boos were back on Friday as Milwaukee buried Minnesota from the 3-point line.\n\nThe Wolves started 0 for 11 from the field and were scoreless until Butler scored with 7:19 left in the first quarter. Minnesota missed its first nine 3s and went 10 of 43 for the game.\n\n\"It was a combination of us missing our shots, and went down the other end and played low-energy defense,\" coach Tom Thibodeau said. \"You're required to do more than one thing and I thought our communication wasn't very good.\"\n\nThe Bucks were also cold early, going just 1 of 8 from 3-point range. But Milwaukee finished the half hitting nine of its next 15 3s to build a 25-point halftime lead. Antetokounmpo scored only five points in the first half but Middleton and Brodgon each had 13.\n\n\"It's coaching,\" Brogdon said. \"He treats Giannis the same way he treats the last guy on the bench. We have immense respect for him, everybody's bought into the system and we enjoy playing for him.\"\n\nTIP-INS\n\nBucks: G Matthew Dellavedova returned after missing one game with an illness. ... Antetokounmpo had his fifth double-double of the season but his lowest scoring output to this point. He added six assists. ... Milwaukee shot 46 3s, which tied a season high.\n\nTimberwolves: F Andrew Wiggins missed his second straight game with a bruised right quadriceps. ... With rookie Josh Okogie starting for Wiggins, it was the fourth different starting lineup for Minnesota this season. The Wolves used six different starting combinations last season, the fewest of any team in the league. ... Minnesota got 56 points from its bench, led by Derrick Rose with 14. ... New Minnesota Twins manager Rocco Baldelli threw out T-shirts to the crowd.\n\nPRESIDENTIAL APPROVAL\n\nFormer President Barack Obama was in Wisconsin on Friday and told a crowd in attendance at a rally that Antetokounmpo is \"balling.\"\n\nWord got back to the Bucks before the game.\n\n\"It's amazing, a guy like Barack Obama mentioning my name and know what I'm doing,\" Antetokounmpo said. \"It's a great thing.\"\n\nNO DRAMA, JUST BUSINESS\n\nButler downplayed any part of the off-court rumors affecting the team right now and said there is no drama.\n\n\"I don't consider anything drama,\" Butler said. \"I consider it business. It's part of it. I think everybody still wants to win, man. We had an off night. But if we win, everything's OK, everything's fine. You wouldn't be asking me the same question.\"\n\nUP NEXT\n\nBucks: Host the Orlando Magic on Saturday.\n\nTimberwolves: Host the Los Angeles Lakers on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994078.818244
}