{
  "game_id": "0021300720",
  "espn_id": "400489593",
  "date": "Feb 03, 2014",
  "matchup": "CHI @ SAC",
  "headline": "Kings end skid, top Bulls behind DeMarcus Cousins' double-double",
  "body": "SACRAMENTO, Calif. -- Although his ankle was still sore, Sacramento Kings center DeMarcus Cousins decided he had spent enough time rehabbing the injury.\nCousins had 25 points and 16 rebounds to help Sacramento snap a seven-game losing streak by defeating the Chicago Bulls 99-70 on Monday night.\nCousins, the Kings' leading scorer and rebounder, missed the previous six games with a sprained ankle. He came out aggressive, getting 11 points and seven rebounds in the first quarter when the Kings led 24-12 and never trailed the remainder of the game.\n\n\"To be honest, I shouldn't have been playing tonight,\" Cousins said. \"But I'm not the kind of guy to let a nagging injury hold me back. So once I got to the point where I could play through the pain, go through the pain and stiffness in my ankle, I was ready to go.\"\nCousins made 8 of 15 shots and hit 9 of 15 free throws. He also added four assists and a blocked shot in nearly 34 minutes.\nThe emotional Cousins is known for his physical style of play and it was needed against the Bulls, who are one of the NBA's best defensive teams thanks in part to their hustling style of play.\nBut it was the Kings who had more energy. They outrebounded Chicago 53-30 and contested shots all game. The Bulls shot 28.2 percent, the lowest percentage by an opponent in the Sacramento era, which dates to the 1985-86 season.\n\"The fact that we won against them, a team that's so physical and defensive-minded, says a lot about how we played tonight,\" Rudy Gay said. \"We didn't let them rattle us and for the most part we kept our cool.\"\nThat wasn't the case for Chicago All-Star center Joakim Noah. He had four points and four rebounds before being ejected in the third quarter when he picked up two technical fouls in less than three minutes. The second technical came after Noah was called for a foul against Cousins at the 7:40 mark.\n\"I shouldn't have acted that way. I apologize and I'm sorry to all three referees out there,\" said Noah, who gestured at the referees and yelled obscenities as he was escorted off the court. \"They are out there trying to do their jobs and I should have never said the things that I said. Hopefully, they will accept my apology and we can move on from this.\"\nJimmy Butler had 17 points for the frustrated Bulls, who have lost two straight and three of four. Tony Snell and Taj Gibson each had 11 points. Chicago was outscored 28-13 in the fourth quarter and its point total was the lowest by a Kings opponent all season.\nThe Bulls were 11-5 record since a Dec. 31 loss to New Orleans. They lost back-to-back games for the first time since mid-December.\n\"We played poorly. I am not going to put it on the officials,\" Chicago coach Tom Thibodeau said. \"The one thing about this league is that things can change quickly and they have. Just as quickly as can go from good to bad and it can go bad to good. But we have to change this and work our way out of this.\"\nChicago was playing for the third time on its six-game road trip that ends Feb. 9 against Lakers.\nIsaiah Thomas had 19 points for the Kings, who stretched the lead to 20 points four minutes into the fourth quarter. Gay had 14 points and Jimmer Fredette had all of his 11 in the fourth quarter.\nFredette made all five shots and finished with four assists and two steals.\n\"Coach wanted a spark and you've just got to stay mentally prepared, mentally ready,\" Fredette said. \"I was able to get a couple of assists to Cuz at first. Then the shot was falling so I just stayed aggressive.\"\nBulls forward Carlos Boozer, who said earlier Monday that he was displeased that Thibodeau often gave more fourth-quarter minutes to Gibson, had eight points and nine rebounds in 35 minutes, including seven in the fourth quarter.\nCousins was dominant in the low block, scoring 12 points in the third quarter when Sacramento built its lead to 71-57. The physical play continued in the quarter, where three technicals were called and every foul seemed to be followed by complaints.\n\"Missing 10 days I wasn't sure what to expect from DeMarcus,\" Kings coach Michael Malone said. \"He had 25 and 17. It was great to have him back. He makes us a very different team.\"\nGame notes\nQuincy Acy made a 3 to end the first quarter, his first 3-pointer in 27 games with the Kings. Acy, who came to the Kings in a trade this season with Toronto, had two 3s with the Raptors. ... Cousins got called for his 12th technical of the season in the third quarter. ... The Bulls made 22 of 34 free throws (64.7 percent).",
  "source": "espn_api",
  "crawled_at": 1764992658.717273
}