{
  "game_id": "0022400590",
  "espn_id": "401705156",
  "date": "Jan 18, 2025",
  "matchup": "MIN vs. CLE",
  "headline": "NBA-leading Cavaliers seize control in the 2nd half and beat Timberwolves 124-117",
  "body": "MINNEAPOLIS -- — Donovan Mitchell scored 36 points, Darius Garland added 29 and the NBA-leading Cleveland Cavaliers took control in the second half and beat the Minnesota Timberwolves for a 124-117 on Saturday night.\n\n\r\n              With the teams tied at halftime, Cleveland (35-6) outscored Minnesota by 10 in the third quarter and opened the fourth with a 10-0 run to seize control.\n\n\r\n              Anthony Edwards scored 28 points and Julius Randle finished with 20 points, 14 rebounds and nine assists for Minnesota.\n\n\r\n              Cleveland was without forward Evan Mobley, who sat with right calf soreness, and Isaac Okoro, sidelined with a right AC joint sprain. Both played in Thursday’s loss to Oklahoma City.\n\n\r\n              Minnesota was also missing a key player as guard Donte DiVincenzo sat for the second straight game with a left great toe sprain.\n\n\r\n              Edwards became the third-youngest player in NBA history to score 8,000 points. Only LeBron James and Kevin Durant reached 8,000 points at a younger age than Edwards.\n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland responded well after its biggest loss of the year, a 20-point rout by the Thunder on Thursday. The Cavs' win prevented what would have been just their second two-game losing streak of the season.\n\n\r\n              Timberwolves: Minnesota seemed to run out of gas after halftime on the second night of a back-to-back after beating the Knicks on Friday in New York. The Wolves are 2-4 this season in the second game of back-to-backs.\n\n\r\n              Key moment\r\n              Ty Jerome scored six straight points to end the third quarter, including a three-point play with 4.1 seconds remaining in the quarter, to give Cavaliers a 10-point lead. Minnesota couldn't recover from that double-digit deficit as the momentum swung in Cleveland's direction.\n\n\r\n              Key stat\r\n              Cleveland had 15-point efforts from bench players Ty Jerome and Georges Niang.\n\n\r\n              Up next\r\n              Both teams play Monday. The Cavaliers host Phoenix, while the Timberwolves play at Memphis.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998091.3145201
}