{
  "game_id": "0022000150",
  "espn_id": "401267310",
  "date": "Jan 11, 2021",
  "matchup": "MEM @ CLE",
  "headline": "Brooks scores 21 points, Grizzlies beat Cavaliers 101-91",
  "body": "CLEVELAND -- — Dillon Brooks had 21 points and seven rebounds, and the Memphis Grizzlies recovered after blowing a 16-point lead to beat the Cleveland Cavaliers 101-91 on Monday night.\n\n\r\n                    Brandon Clarke scored 15 points and Tyus Jones had 13 points, seven assists and three steals for the Grizzlies, who won their second straight and improved to 3-1 on the road. Kyle Anderson added eight points, six rebounds and nine assists.\n\n\r\n                    “The togetherness of this group impresses me and these guys embrace the challenge of being on the road,” Memphis coach Taylor Jenkins said. “You have to create your own energy when you’re not at home and they’ve been able to do that.”\n\n\r\n                    Memphis led 73-57 late in the third quarter, but Cleveland responded with a 27-8 run capped by Damyean Dotson’s basket with 6:43 left in the fourth to go ahead by three.\n\n\r\n                    A 3-pointer by De’Anthony Melton put the Grizzlies back in front for good at 89-86. Brooks closed out the victory by drawing the sixth foul on Cavaliers center Andre Drummond and making two free throws in the final minute.\n\n\r\n                    “It felt amazing to figure it out and to execute plays with the right pace at the end,” said Brooks, who had 12 points, five boards and two blocked shots in the second half. “It’s great to win. We just have to keep it going.”\n\n\r\n                    Drummond had 19 points and 14 rebounds for his 11th straight double-double to start the season, extending his team record. Dotson had 14 points and six assists, and Cedi Osman scored 14 points.\n\n\r\n                    Point guard Collin Sexton was expected to start but was a late scratch for Cleveland with a sprained left ankle. The third-year pro, who is averaging a team-high 25.1 points, missed his third game in a row. Cavs coach J.B. Bickerstaff said he was informed Sexton couldn't go right before the national anthem.\n\n\r\n                    Cleveland returned to Rocket Mortgage FieldHouse after its longest road trip of the season, covering six games and 10 days. The Cavaliers beat the Grizzlies 94-90 four days earlier.\n\n\r\n                    The Grizzlies took their largest lead at 73-57 on an uncontested layup by rookie Desmond Bane. Their 26-11 run to open the second half was highlighted by an alley-oop from Jones to Clarke.\n\n\r\n                    “When you turn the ball over 21 times, it's damn near impossible,” Bickerstaff said. “We hit some bumps tonight.”\n\n\r\n                    Cleveland failed to reach 100 points for the eighth straight game and is 2-6 during that span.\n\n\r\n                    The Ohio Department of Health permitted 1,944 fans inside the arena, which is 10% of capacity. Cleveland had been limited to 300 spectators due to COVID-19 restrictions.\n\n\r\n                    NEXT MAN UP\n\n\r\n                    Dotson made his third consecutive start filling in for Sexton. They were his first three NBA starts at point guard. \n\n\r\n                    “I give a lot of credit to Dot for helping us a ton,” Bickerstaff said. “It’s not easy for a shooting guard to move to the point. Instead of just worrying about yourself, you have to worry about 14 other guys.”\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: G Ja Morant (left ankle sprain) missed his seventh straight game after being injured on Dec. 28 at Brooklyn. The reigning Rookie of the Year is expected to return in late January. ... F Jaren Jackson Jr. (left knee surgery) and F Justise Winslow (left hip displacement) have not appeared in a game this season.\n\n\r\n                    Cavaliers: G Yogi Ferrell was signed to a 10-day contract after the NBA granted a hardship exception. He scored nine points in 17 minutes. ... Cleveland has seven rotation players sidelined, including five-time All-Star F Kevin Love (right calf strain), G Darius Garland (right shoulder sprain) and G Kevin Porter Jr. (personal).\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Visit Minnesota on Wednesday. The teams will also play Friday at Target Center.\n\n\r\n                    Cavaliers: Host Utah on Tuesday. Cleveland wraps up a stretch of five games in seven days.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996982.800952
}