{
  "game_id": "0022300046",
  "espn_id": "401584134",
  "date": "Nov 24, 2023",
  "matchup": "TOR vs. CHI",
  "headline": "Anunoby scores 26 points, Raptors eliminate Bulls from tourney with 121-108 win",
  "body": "TORONTO -- — O.G. Anunoby matched his season high with 26 points, Pascal Siakam had 18 and the Toronto Raptors beat Chicago 121-108 on Friday night in the NBA’s In-Season Tournament, eliminating the Bulls from contention.\n\n\r\n              The Raptors, eliminated when Orlando beat Boston earlier Friday, improved to 1-2 in the tournament. \n\n\r\n              Chicago fell to 0-3 in the tournament. The Bulls have lost three straight and six of seven.\n\n\r\n              “I can’t fake it, I’m frustrated,” Bulls guard DeMar DeRozan said. “Beyond frustrated, and I feel like it’s rightfully so, as a competitor.”\n\n\r\n              Dennis Schroder added 17 points in Toronto’s balanced attack. Gary Trent Jr. had 16 points, Jakob Poeltl chipped in 15 points and 10 rebounds and Scottie Barnes had 13 points and 10 rebounds.\n\n\r\n              Toronto is 4-0 this season when Anunoby scores 20 or more.\n\n\r\n              Zach LaVine scored 36 points for Chicago, making 16 of 23 attempts. He returned after sitting out Wednesday night against Oklahoma City because of a sore right foot.\n\n\r\n              Chicago’s Alex Caruso left in the third quarter and did not return.\n\n\r\n              “Somebody stepped on his foot, he said he didn’t feel great,” Bulls coach Billy Donovan said. “I didn’t ask him if he could go back in.”\n\n\r\n              DeRozan had 19 points for the Bulls against his former team. He was ejected with 1.4 seconds remaining after picking up his second technical foul. \n\n\r\n              DeRozan was upset that Siakam attempted a shot with the 24-second clock turned off in the final seconds of the game.\n\n\r\n              Raptors coach Darko Rajakovic later explained that he didn’t know his team was already eliminated from the tournament, and didn’t need to worry about scoring late to improve their point differential. A frustrated DeRozan had little time for that explanation.\n\n\r\n              “I don’t care about no In-Season Tournament points, none of that,” DeRozan said. “Just the respect for the game. If the roles were flip-flopped and I had the ball, hold it.”\n\n\r\n              Siakam matched a season high with eight assists and Toronto finished with 32, extending its team-record streak of games with 25 or more assists to 12.\n\n\r\n              “That’s the model that we’re going after,” Rajakovic said. “Everybody eats and everybody is playing together.”\n\n\r\n              Siakam’s buzzer-beating shot at the end of the third gave the Raptors a 93-77 lead heading to the fourth.\n\n\r\n              “We had no rim protection, nobody meeting anybody at the line,” Donovan said. “There was not enough physicality at the basket.”\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Brooklyn on Sunday night.\n\n\r\n              Raptors: At Cleveland on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995450.9899719
}