{
  "game_id": "0021600061",
  "espn_id": "400899511",
  "date": "Nov 02, 2016",
  "matchup": "CHI @ BOS",
  "headline": "Thomas, Johnson help lead Celtics past Bulls, 107-100",
  "body": "BOSTON --  The Boston Celtics played without new addition Al Horford for the first time this season on Wednesday night.\n\nThanks to Isaiah Thomas and Amir Johnson, they didn't miss a beat.\n\nThomas had 23 points and 10 assists, Johnson finished 23 points -- including a career-high four 3-pointers -- and the Boston Celtics handed the Chicago Bulls their first loss of the season, 107-100.\n\nBoston avenged its lone setback of the season despite being without Horford, who was placed in the concussion protocol Tuesday after exhibiting concussive symptoms during practice.\n\nJohnson was active from all over the court, scoring 16 points in the third quarter. The Bulls managed just 18 points in the period, their lowest scoring quarter of the season.\n\n\"I just made the first one and my confidence got a little higher,\" Johnson said of his 3-point performance. \"When I knocked down the fourth one, I don't even think I even saw the basket.\"\n\nThe Bulls cut into what had been a 16-point Boston lead in the fourth quarter and tied it at 100 on two free throws by Nikola Mirotic. But Boston regained the lead 101-100, then went up five on a driving layup by Thomas and a basket by Marcus Smart.\n\nJimmy Butler led Chicago with 23 points and nine rebounds.\n\nBefore Wednesday Johnson had never made more than two 3-pointers in a game and had never attempted more than four. He entered the night 0 for 1 on the season.\n\nBoston led by as many as 14 points in the first half, but took only a two-point lead into halftime.\n\nAfter a slow start, Jae Crowder scored eight straight points during a 21-4 Boston run. The Bulls stayed in it via a few mini spurts, including an 8-0 run by Butler.\n\nBut Crowder will join Horford on the injured list after he left in the second quarter with a left ankle sprain. Coach Brad Stevens said he doesn't expect Crowder back \"any time soon.\"\n\n\"It's a great opportunity for everybody else,\" Stevens said. \"We're early in the season, so everybody gets a chance to step up and make plays and compete. And we'll see. We'll try to figure it out.\"\n\nTIP-INS\n\nBulls: G Michael Carter-Williams (left knee bruise, left wrist sprain) and Doug McDermott both sat out. Coach Fred Hoiberg said McDermott felt good, but that he hadn't gone 24 hours without experiencing symptoms yet.\n\nCeltics: Tyler Zeller started in place of Horford. ... Stevens said Horford would also sit out Boston's game Thursday against the Cavaliers. A teammate inadvertently swiped Horford in the face with the ball during practice on Monday, but Horford didn't show any initial symptoms. But he experienced some nausea in practice on Tuesday and was pulled.\n\nQUOTABLE\n\n\"We fought our way back in the second quarter to get back in it. (Johnson) had a hell of a third quarter. I like the fight in this team. We gave ourselves a chance to win.\" -- Dwyane Wade on the Bulls' second-half effort.\n\nNUMBERS GAME\n\nThe Bulls outrebounded the Celtics 49-39 but they had 19 turnovers that led to 18 Boston points.\n\nBIG QUARTER\n\nThe Celtics' 36 points in the first quarter were the most in a period for Boston this season. Its previous high was 33.\n\nWELCOME BACK MR. ROSE\n\nHoiberg said he thinks former Bulls guard Derrick Rose to get a good reception when he returns to the United Center later this week. \"I think he should be received well,\" Hoiberg said. \"Derrick did a lot of good things for the city and for the franchise. I think he'll be received very well.\"\n\nUP NEXT\n\nBulls: They host the Knicks on Friday night in Rose's first game back in Chicago since being traded to New York this offseason.\n\nCeltics: They head to Cleveland on Thursday for their first matchup of the season against the defending champions.\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764995114.020268
}