{
  "game_id": "0022300979",
  "espn_id": "401585607",
  "date": "Mar 17, 2024",
  "matchup": "ORL vs. TOR",
  "headline": "Banchero scores 29 as Magic beat skidding Raptors 111-96",
  "body": "ORLANDO, Fla. -- — Paolo Banchero scored 29 points and the Orlando Magic pulled away from Toronto for a 111-96 victory on Sunday night, handing the Raptors their seventh straight loss.\n\n\r\n              Franz Wagner had 22 points, nine rebounds and five assists for Orlando, and his brother, Moritz, scored 14 points in the opener of an eight-game homestand. The Magic improved to 8-2 in their last 10 games.\n\n\r\n              “Every game is not going to be high-flying,” Magic coach Jamahl Mosley said. “Our guys are finding ways to win and that’s important in this league. Even when the games aren’t pretty you find ways to win.”\n\n\r\n              Jordan Nwora led the injury-ravaged Raptors with 18 points. Gary Trent Jr. scored 15 points, and Immanuel Quickley and Bruce Brown each had 12.\n\n\r\n              Nwora scored 12 straight Toronto points in the third quarter after Orlando opened a 17-point lead.\n\n\r\n              “At the start of the third quarter they went on a run,” Raptors coach Darko Rajakovic said. “We missed some layups and turned the ball over. They were able to get out and score in transition.”\n\n\r\n              The Raptors, who lead the NBA in fast-break points after scoring 37 in a loss to the Magic on Friday night, were held to just 16. They went 8 for 31 from 3-point range and committed 18 turnovers.\n\n\r\n              Caleb Houstan made a 3-pointer right before the halftime buzzer, lifting the Magic to a 52-47 lead at the break.\n\n\r\n              The Raptors then went without a field goal in the first 3:33 of the second half.\n\n\r\n              “I think defensively we’re really good,\" Franz Wagner said. \"We have a lot of guys that take a lot of pride in that side of the floor, and we have really smart players, too. That’s always a good combination.”\n\n\r\n              Nwora went 7 for 9 from the field. He also grabbed seven rebounds in 25 minutes.\n\n\r\n              “Opportunities are something you have to seize when the moments come,” he said. “Obviously it would be a lot better if they came in some wins, but that's part of the NBA that you have to learn.”\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Sacramento on Wednesday.\n\n\r\n              Magic: Host Charlotte on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995684.759991
}