{
  "game_id": "0021900667",
  "espn_id": "401161309",
  "date": "Jan 23, 2020",
  "matchup": "LAL @ BKN",
  "headline": "LeBron has triple-double, Lakers pull away to beat Nets",
  "body": "NEW YORK --  LeBron James is on his way to Philadelphia, set to pass Kobe Bryant on the NBA's career scoring list in the former Lakers star's hometown.\n\nIt'll be another milestone achievement, but scoring has never been the most important thing to James. He prefers winning, and it looks like he'll do plenty more of that with these Lakers.\n\nJames had 27 points, 12 rebounds and 10 assists in his 10th triple-double of the season and Los Angeles made a season-high 19 3-pointers to pull away and beat the Brooklyn Nets 128-113 on Thursday night.\n\nJames closed within 17 points of Bryant for No. 3 with a flurry in the fourth quarter. He can pass Bryant on Saturday at Philadelphia, where the five-time champion was born.\n\n\"Any time I am linked with the greats or I am able to do something in my career where I'm mentioned with the greats is a pretty cool thing,\" James said. \"But as far as looking at the scoring, I don't know. That doesn't mean much to me.\n\n\"Just the overall point of my game is what means more to me: being an all-around player, being able to be successful on the floor and being able to contribute to the franchises that I played for, the three franchises I played for so far in my career.\"\n\nJames has 33,626 points. Bryant finished with 33,643.\n\nA back-and-forth game for nearly three quarters turned into a rout after the Lakers broke the Nets' spirits with four straight 3-pointers spanning the third and fourth quarters, extending a one-point lead to 107-94, and Los Angeles coasted from there.\n\nAnthony Davis had 16 points and 11 rebounds, and Dwight Howard finished with 14 points and 12 boards in his first start of the season.\n\nKyrie Irving scored 20 points after missing a game with right hamstring tightness, but the Nets lost their fifth straight. Brooklyn has won just two of its last 14 games.\n\nThe Nets were without backup centers DeAndre Jordan and Nicolas Claxton, leaving them without many options behind starter Jarrett Allen. But they struggled just as badly guarding the perimeter. Los Angeles was 19 of 38 behind the arc, with Nets coach Kenny Atkinson saying his players were so worried about James that they left guys open outside.\n\n\"He started making shots and guys are just, they don't want to see him score again and they help too much,\" Atkinson said. \"I would say there's 10, 12 plays where we helped too much and you make one false step with a great passing team like them, they make you pay.\"\n\nThe Lakers led 38-35 after one, before both teams made seven 3-pointers in the second. Howard went 4 for 4 for eight points in the period, helping the Lakers take a 75-70 lead to halftime.\n\nDanny Green made three 3s in the first four minutes of the third, pushing the lead to 88-75, but the Nets had it down to 95-94 after a 3-pointer by Irving with 49 seconds remaining. But then Davis and Rajon Rondo hit 3s before Jared Dudley, who played in Brooklyn last season, hit one from near the Nets' bench to beat the buzzer and make it 104-94.\n\nKentavious Caldwell-Pope made it four straight 3s to open the fourth, extending the lead back to 13. James then scored eight in the period before taking a seat for good.\n\nTIP-INS\n\nLakers: Howard started with JaVale McGee ill. ... James, Howard and Davis met with former President Bill Clinton after the game. He was seated courtside for the second straight Nets game. ... Lakers coach Frank Vogel has a pair of former Nets head coaches on his staff in Jason Kidd and Lionel Hollins.\n\nNets: Taurean Prince scored 18 points and Caris LeVert had 16. ... Brooklyn made 21 3s. ... The Nets were trying for their third straight victory over the Lakers.\n\nALL-STAR SELECTIONS\n\nJames and Davis were voted as starters for the NBA All-Star Game. James, who will captain a team as the leading vote-getter among fans, will make his record 16th straight start next month in Chicago. And Vogel and his staff will coach Team LeBron, after the Lakers (36-9, .800) clinched at least a tie for the best record in the Western Conference through games played on Feb. 2.\n\n\"Well, our coaching staff has done a phenomenal job. You know, they really have. They've hit home runs and grand slams every game with their game plan and helping me manage this group,\" Vogel said. \"Couldn't be happier for those guys.\n\nBut Irving missed out a spot when he was passed by Kemba Walker. Irving was second among fans but finished sixth in the player and media rankings.\n\nBLOCKING LEBRON\n\nA photo of Allen blocking a hard-charging James at the rim in a game last season hangs on a wall in a Barclays Center hallway. Atkinson said Allen showed with that play and many others that he had the defensive toughness that critics thought he lacked coming out of college.\n\n\"There are guys who would run into the hallway when LeBron goes up for a dunk. He stands there and will protect the rim and his teammates love that about him, his coaches love that about him,\" Atkinson said.\n\nUP NEXT\n\nLakers: At Philadelphia on Saturday.\n\nNets: At New York on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995986.8300061
}