{
  "game_id": "0022400192",
  "espn_id": "401704758",
  "date": "Nov 08, 2024",
  "matchup": "HOU @ OKC",
  "headline": "Gilgeous-Alexander and Holmgren each score 29 points, Thunder rout Rockets 126-107",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander and Chet Holmgren each scored 29 points to help the Oklahoma City Thunder rout the Houston Rockets 126-107 on Friday night.\n\n\r\n              Oklahoma City opened a six-game homestand with a victory after losing at Denver on Wednesday night for its first defeat of the season. \n\n\r\n              Gilgeous-Alexander made 10 of his first 11 field goals and didn't take a 3-pointer until his 13th shot. It went in to give the Thunder a 96-73 lead in the third quarter.\n\n\r\n              Holmgren made 8 of 14 field goals, including 4 of 6 3-pointers, for the Thunder (8-1). Oklahoma City pulled away from a game that was tied 31-all at the end of the first quarter.\n\n\r\n              The Thunder had been inconsistent on offense so far this season, but they figured things out in this game. They shot 51.1% from the field and made 20 of 23 free throws. \n\n\r\n              Dillon Brooks scored 17 points for the Rockets (5-4), who shot just 43.3% from the field.\n\n\r\n              Takeaways\r\n              Rockets: The Thunder showed why they lead the league in defensive rating when they shut down Houston's top two scorers, Jalen Green and Alperen Sengun. Green scored 14 points on 5-for-14 shooting and Sengun had 11 points on 3-for-12 shooting.\n\n\r\n              Thunder: Oklahoma City's depth and versatility were too much for the Rockets. Holmgren, in particular, was a problem on both ends. The 7-footer had three blocks and constantly affected Houston's shots near the rim.\n\n\r\n              Key moment\r\n              The game was tied at 31 early in the second quarter when Oklahoma City's Aaron Wiggins hit a 3-pointer. The Thunder dominated from there, outscoring the Rockets 41-20 the rest of the period to take a 75-51 lead at halftime. It was a season-high point total for a half. \n\n\r\n              Key stat\r\n              The Thunder shot 61.9% from the field and 52.9% from 3-point range in the first half. \n\n\r\n              Up next\r\n              The Rockets visit Detroit on Sunday. The Thunder host Golden State on Sunday night.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997415.5411289
}