{
  "game_id": "0021700356",
  "espn_id": "400975107",
  "date": "Dec 06, 2017",
  "matchup": "DAL @ BOS",
  "headline": "Irving, short-handed Celtics earn 97-90 win over Mavericks",
  "body": "BOSTON --  The Boston Celtics are no strangers to adjusting on the fly this season.\n\nThey recovered from Gordon Hayward's injury on opening night and the early absence of Marcus Morris to reel of 16 straight victories following an 0-2 start.\n\nThat ability to bounce back was on display again to help them remain perfect against the Western Conference.\n\nKyrie Irving had 23 points and five assists, and Jayson Tatum added 17 points and 10 rebounds and the short-handed Celtics slipped past the Dallas Mavericks 97-90 on Wednesday night\n\nBoston's Al Horford finished with 17 points, eight rebounds and eight assists.\n\n\"In the NBA you can have afternoons like today, where all of a sudden, you're down to 11 guys, and the next man up has got to be ready,\" Celtics coach Brad Stevens said.\n\nBoston has won four straight and six of their last seven. The Celtics are 8-0 against the West.\n\nThe Celtics played without Jaylen Brown and Morris. Brown sat with an inflamed right eye, while Morris was out due to left knee soreness.\n\nIt forced Stevens to rely heavily on his reserves. They came through in the fourth, leading a 10-0 run to put Boston back in front 80-73.\n\nDallas fought back to tie it up at 85. But the Celtics ran off eight straight points to push their lead to 93-85 with 2 minutes to play.\n\n\"Just covering for one another. We're a team. We're pros for a reason,\" said Terry Rozier, who led all Celtics reserves with 12 points. \"You put all that hard work in and you have to be ready.\"\n\nHarrison Barnes led the Mavericks with 19 points and seven rebounds. Dirk Nowitzki added 16 points and six rebounds.\n\nBoston's bench outscored their Dallas counterparts 36-23 for the game.\n\n\"They have a good team, they keep coming,\" Nowitzki said. \"I wasn't really good tonight. I didn't close the game the way I wanted to.\"\n\nDallas had just three turnovers in the opening 24 minutes and led 57-47 at the half.\n\nThe Celtics fought through periods of sloppiness offensively, committing seven turnovers in the first two quarters. They were also outscored 20-12 in the paint.\n\nThough it's early, Horford said it feels good to be 22-4 after all they've been through.\n\n\"I'm very happy,\" he said. \"Going into the season you never have any expectations. This is good. We want to keep building on it.\"\n\nStevens is also cautiously optimistic.\n\n\"I feel good about where we're headed,\" he said. \"We've got a long way to go.\"\n\nTIP-INS\n\nMavericks: Were outrebounded 53-45. ... Were outscored 34-32 in the paint.\n\nCeltics: Stevens said both Brown and Morris are expected to be with team when it departs for three-game trip on Thursday.\n\nQUOTABLE\n\n\"Our first half was really good. Their second half was better, and that's the game.\" -- Dallas coach Rick Carlisle.\n\nWILD THIRD\n\nThe Mavericks took a 59-47 lead earlier in the third quarter. But the Celtics erased the deficit with a 15-2 run. It was part of a fast-moving quarter that saw the lead change hands eight times.\n\nBarnes had 12 points in period for Dallas. Horford paced Boston with 10 points.\n\nNOEL SURGERY\n\nCarlisle announced before the game that forward Nerlens Noel will have surgery later this week in Cleveland for a torn ligament in his left thumb.\n\n\"He'll be out for several weeks,\" Carlisle said. \"I don't know for how long.\"\n\nNoel has appeared in 18 games this season, but hasn't played since Nov. 22.\n\nDIRK'S LONGEVITY\n\nNowitzki hasn't said whether this will be his final NBA season at age 39. He's already tied Kobe Bryant for the most seasons spent with one franchise at 20. Another season would give him the outright record, but Carlisle said he believes it is still an open question.\n\n\"I believe it's going to depend on how he's feeling. I don't know any NBA player that wouldn't want to continue playing into oblivion,\" Carlisle said.\n\nUP NEXT\n\nMavericks: At Milwaukee on Friday.\n\nCeltics: Begin three-game trip Friday at San Antonio.\n\n---\n\nMore NBA basketball: https://www.apnews.com/tag/NBAbasketball\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764993964.343822
}