{
  "game_id": "0021500891",
  "espn_id": "400828778",
  "date": "Mar 01, 2016",
  "matchup": "CHA vs. PHX",
  "headline": "Hornets cruise past lowly Suns 126-92",
  "body": "CHARLOTTE, N.C. -- Coming off a solid February, the Charlotte Hornets are looking to improve their playoff positioning in March.\nSo far, so good for Kemba Walker and company.\nWalker had 26 points and nine assists, and the Hornets routed the Phoenix Suns 126-92 on Tuesday night.\n\nAl Jefferson added 19 points and seven rebounds for Charlotte, which has won nine of 12. Nicolas Batum and reserve Jeremy Lamb scored 15 points apiece.\nThe Hornets (31-28) improved to 20-9 at home, the third-best record in the Eastern Conference behind Cleveland and Toronto. With nine of the next 11 games at home, they have a good opportunity to improve on their current No. 6 spot in the Eastern Conference race.\n\"We know how important these games are,\" Walker said. \"We want to take care of things at home. We've improved a lot on the road, and that's helped us. But we've been playing great at home throughout the season, so we know how important it is.\n\"Hopefully we can back up some more wins here, and give ourselves some room.\"\nThe Suns (15-45) had five players score in double figures in their 16th consecutive road loss. Alex Len had 18 points and 12 rebounds, and Mirza Teletovic scored 17 points.\n\"This game, we just got beat,\" interim coach Earl Watson said. \"A lot of it is immaturity, not in a bad way, but just in a realistic way.\n\"We have a lot of young guys. Our young guys got quality shots, they got good shots, they got touches, (but) they weren't able to execute. That's going to happen.\"\nCharlotte led by 26 points at halftime and opened its biggest lead at 115-72 on Troy Daniels' 3-pointer with 7:56 left in the fourth quarter.\n\"We've been doing real well at home, and we've got a lot of road games coming up,\" Jefferson said. \"What we can't do is go out and get too comfortable. We said this game would mean nothing if we go to Philly and lay an egg. Every game is very important, especially going down the stretch this late in the season.\"\nPhoenix's only lead came in the opening 90 seconds, when a Len hook shot and P.J. Tucker layup put the Suns up 4-0.\nBut the Hornets responded with a 21-2 run, capped by Walker's 3-pointer with 4:32 left. They held Phoenix without a field goal for nearly 6 1/2 minutes while opening their first double-digit lead.\nBatum's layup with 47 seconds remaining in the first half put the Hornets up 68-41.\n\"We had good energy, and played with good purpose,\" Hornets coach Steve Clifford said. \"We've done a lot better job on the road the last month, so we've given ourselves a chance here (at the playoffs).\n\"But this is a big stretch for us. When you have nine of the next (11) at home, you've got to take advantage of that. They understand that, and we're playing better. We're much more balanced in the way we're playing.\"\nTIP-INS\nSuns: Devin Booker scored 13 points, and reserve John Jenkins had 11. ... Phoenix dropped to 4-24 on the road and moved within one of tying the team's 42-year-old record for consecutive road losses. Their last road win was a 103-101 victory at Chicago on Dec. 7.\nHornets: C Spencer Hawes was inactive for the sixth straight game with a sore lower back, and Clifford said it may be another week before he resumes practicing. ... Charlotte signed G Jorge Gutierrez of Mexico to a second 10-day contract.\n3s LACKING FOR SUNS\nAfter connecting for a season-best 19 3-pointers on 33 attempts in a 111-102 victory over the Hornets on Jan. 6, the Suns went 6 for 27 from long range on Tuesday. Meanwhile, Charlotte made 13 of 27.\nPANTHERS IN THE HOUSE\nTwo members of the NFL's Carolina Panthers -- coach Ron Rivera and linebacker Luke Kuechly -- were seated courtside by the Hornets' bench.\nUP NEXT\nSuns: Visit the Miami Heat on Thursday night.\nHornets: Visit the Philadelphia 76ers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994363.9615202
}