{
  "game_id": "0022200021",
  "espn_id": "401468176",
  "date": "Oct 21, 2022",
  "matchup": "TOR @ BKN",
  "headline": "Durant breaks late tie with 3, Nets top Raptors 109-105",
  "body": "NEW YORK -- — Kevin Durant broke a tie with a 3-pointer with 56 seconds left and had 27 points to help the Brooklyn Nets beat the Toronto Raptors 109-105 on Friday night.\n\n\r\n              Durant’s 3 gave Brooklyn a 105-102 lead.\n\n\r\n              “It’s a game of runs. I like how we stayed with it, the resiliency that we showed,” Durant said. “We were up double-digits and we let them come back twice. It was an up and down game, but we just kept fighting.”\n\n\r\n              Kyrie Irving led the Nets with 30 points.\n\n\r\n              Pascal Siakam led the Raptors with 37 points, 13 rebounds and 11 assists. Fred VanVleet added 18 points and Scottie Barnes had 17.\n\n\r\n              “The type of player I am, when I play at a higher level my team has a better chance to win,” Siakam said. “I think anytime I play better by team is in a higher position to win. But when you lose, you have to flush it out and get on to the next one.”\n\n\r\n              VanVleet’s jumper with 38 seconds left brought the Raptors within one. But Royce O’Neale’s 3-pointer with 15 seconds left wrapped up the victory.\n\n\r\n              The Nets trailed 79-69 late in the third quarter, but Patty Mills’ 3-pointer capped a 9-0 run as Brooklyn pulled to 79-78 after three quarters. The streak continued into the final quarter, with Brooklyn scoring the first eight points to go ahead 86-79.\n\n\r\n              Irving was whistled for his fifth foul with 7:08 left, but Brooklyn challenged the call and it was reversed to an offensive foul on Scottie Barnes. Irving then hit a 3 and Nic Claxton followed with a driving layup to give the Nets their biggest lead of the game, 100-88.\n\n\r\n              “I think things could’ve gone a different way if I picked up my fifth foul,” Irving said. “It was a big play, a big turning point. We got to set up our offense for the next possession and after that I thought we had control of the game.”\n\n\r\n              However, O.G. Anunoby’s 3-pointer with 1:46 remaining capped a 12-0 Toronto run and tied it.\n\n\r\n              TIP-INS: \n\n\r\n              Raptors: VanVleet needs just one 3-pointers to tie Morris Peterson (801) for second on the Raptors’ career list. Kyle Lowry has the franchise record at 1,518. \n\n\r\n              Nets: The Nets’ 130-108 loss to New Orleans on Wednesday was their ninth opening defeat in the last 10 years. … Brooklyn has not started a season 0-2 since 2015-16.\n\n\r\n              HARRIS RETURNS\n\n\r\n              New Jersey's Joe Harris returned to the court for the first time since suffering a left ankle injury against Oklahoma City last Nov. 14. He entered the game with six minutes left in the first quarter. Harris’ first shot was an air ball at 3:51, but he then connected on a 3-pointer at 2:39. “I wanted to try and play the first game, but just wasn’t quite where I was supposed to be performing. I needed just a little bit more time.” \n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Miami on Saturday night.\n\n\r\n              Nets: At Memphis on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994456.881675
}