{
  "game_id": "0021800653",
  "espn_id": "401071329",
  "date": "Jan 15, 2019",
  "matchup": "OKC @ ATL",
  "headline": "Young wins point guard battle, Hawks top Thunder 142-126",
  "body": "ATLANTA --  Just when it seemed Dennis Schroder would enjoy a triumphant return to Atlanta, his successor as the Hawks' starting point guard had a winning answer.\n\nTrae Young had 24 points and 11 assists to win the showdown of current and past Atlanta point guards, leading the Hawks over the Oklahoma City Thunder 142-126 on Tuesday night.\n\n\"Tonight the shots just kept falling,\" said Young, who had four 3-pointers. \"When you see the ball go in like we did tonight, I think it just keeps rolling.\"\n\nSchroder scored 21 points, including 14 in the third quarter. He had the Thunder's final 11 points of the period, the last six on free throws, for a 100-97 lead.\n\nYoung answered with 13 points in the final period as the Hawks enjoyed their second 45-point quarter of the game. The Hawks outscored Oklahoma City 45-30 in the second period and 45-26 in the closing period.\n\nThe win was especially sweet for Young, the former star for his home-state Oklahoma Sooners.\n\n\"It feels good,\" Young said. \"... To get a win against one of the top teams in the league is pretty special for us.\"\n\nThe Thunder are third in the West but have lost three of four. The Hawks have won eight of their last 15 but still rank ahead of only three teams in the Eastern Conference.\n\nPaul George said the Thunder were \"a little flat.\"\n\n\"These are the games that we have to be ready for, one of those games that we were supposed to roll and that didn't happen tonight,\" George said. \"When you play a team like the Hawks, you have to match their energy and we didn't do that tonight.\"\n\nRussell Westbrook led Oklahoma City with 31 points and 11 assists. George had 24 points and Jerami Grant added 21.\n\nThat wasn't enough scoring to match the Hawks, who made 18 of 37 3-pointers. Atlanta set a season scoring high.\n\nOklahoma City coach Billy Donovan said his team didn't play winning defense.\n\n\"What did we score tonight, 126 points?\" Donovan asked. \"That should be good enough for us to win.\"\n\nJohn Collins made 12 of 14 shots from the field and led Atlanta with 26 points. Alex Len had 24 points and 11 rebounds. The Hawks were 18 of 37 on 3-pointers.\n\nYoung opened the final period with a tying 3-pointer. He added a three-point play and another basket as the Hawks regained momentum. A jam by Omari Spellman pushed Atlanta's lead to 117-107, and another dunk by Spellman pushed the advantage to 121-109.\n\nA steal and reverse jam by DeAndre Bembry iced the win.\n\nTIP-INS\n\nThunder: F Nerlens Noel (concussion protocol) \"is doing a little more each day,\" Donovan said before the game. ... G Alex Abrines (personal reasons) missed his eighth straight game.\n\nHawks: G Jeremy Lin (flu-like symptoms) was not with the team. F Taurean Prince was limited in his second game back while recovering from similar symptoms. ... G Kent Bazemore (right ankle sprain) and F Dewayne Dedmon (left ankle sprain) did not play. Dedmon may return Saturday against Boston.\n\nMORE BLUE TO COME\n\nThe Hawks wore new powder blue uniforms with red trim and numbers for the first time. It won't be the last.\n\n\"I told our equipment guy, Zac (Walsh) that we have to play in those uniforms for the rest of the month,\" said Hawks coach Lloyd Pierce.\n\nThe uniforms were introduced as part of the Hawks' 50-year celebration in Atlanta.\n\nHOMECOMING\n\nSchroder was happy to be traded to a contender but said his time with the Hawks \"was special.\"\n\nThe Hawks had a \"welcome back\" video tribute for Schroder during a first-quarter timeout. Schroder raised his arm to acknowledge the fans. \"I appreciated it a lot,\" he said.\n\nUP NEXT\n\nThunder: Host Lakers on Thursday.\n\nHawks: Host Celtics on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994584.947563
}