{
  "game_id": "0022200664",
  "espn_id": "401468819",
  "date": "Jan 16, 2023",
  "matchup": "LAL vs. HOU",
  "headline": "LeBron drops 48, Lakers beat Rockets 140-132 to snap skid",
  "body": "LOS ANGELES -- — LeBron James had a season-high 48 points, nine assists and eight rebounds in his third 40-point performance since turning 38 less than three weeks ago, and the Los Angeles Lakers snapped a three-game skid with a 140-132 victory over the Houston Rockets on Monday night.\n\n\r\n              Russell Westbrook scored 24 for the Lakers, who never pulled away in another poor defensive game, but also set a franchise record by committing just two turnovers.\n\n\r\n              James' brilliance in the 100th 40-point outing of his career — including the postseason — was just enough to hold off Houston. He scored 20 points in the fourth quarter, going 9 for 9 at the free throw line.\n\n\r\n              James scored his 38,000th career point Sunday night in a one-point loss to Philadelphia, and he showed no ill effects while playing in back-to-back games despite the sore left ankle that has dogged him for weeks.\n\n\r\n              “I was extremely exhausted today,” James said. “I could have very easily took tonight off, but ... our ballclub couldn’t use me taking a night off, I didn’t feel like. I wanted to sit on that loss with Philly last night. I wanted to get that out of my taste buds and see if we could win a ballgame tonight. It was a complete team effort, and I just tried to make plays.”\n\n\r\n              After carrying the depleted Lakers for long stretches punctuated by fierce dunks and five 3-pointers, James hit a 17-foot jumper and four free throws in the final minute.\n\n\r\n              “That ranks right at the top,” said Rockets coach Stephen Silas, an assistant on James’ first two teams in Cleveland. “I’ve seen him have some really good (performances), and that was in the top five for sure.”\n\n\r\n              James scored 40 points for the 72nd time in the regular season during his 20-year career. Only Michael Jordan has more 40-point games in NBA history after turning 35 — Jordan had 12, and James has eight.\n\n\r\n              \"I think it's historic, man, on a lot of different levels,\" Lakers coach Darvin Ham said. “For him to be at this point in his career and still able to produce at the level in which he's producing, I think all of us being able to witness it, be a part of it, it shows his competitive spirit, his no-quit mentality. ... Whenever he's out there, he's just been competing. It's amazing to see.\"\n\n\r\n              Kendrick Nunn had 15 points for the Lakers, who have won six of nine overall despite a thin roster.\n\n\r\n              Alperen Sengun scored a career-high 33 points and Jalen Green added 23 in the Rockets’ 11th consecutive loss. Sengun, the 20-year-old Turkish center, went 14 of 17 from the field and added 15 rebounds and six assists.\n\n\r\n              Houston has lost 16 of 17 over the past five weeks, dropping into last in the overall NBA standings at 10-34.\n\n\r\n              James sparked the home crowd with two ferocious dunks in the final minute of the first half, both punctuated by a profane scream to his fans. He kept up the onslaught right after halftime with back-to-back 3-pointers.\n\n\r\n              TIP-INS\n\n\r\n              Rockets: USC product Kevin Porter Jr. missed his third straight game with a bruised left foot, but Silas is optimistic Porter will play this week. ... Houston rookie Jabari Smith Jr. scored 14 points. His father was a member of the Kings when James played his first NBA game in Sacramento nearly 20 years ago. Smith Sr. attended the game and had a warm conversation with James.\n\n\r\n              Lakers: Wenyen Gabriel had 14 points and nine rebounds before fouling out with 2:41 to play. ... Anthony Davis missed his 16th consecutive game.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host Charlotte on Wednesday.\n\n\r\n              Lakers: Host Sacramento on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994129.825133
}