{
  "game_id": "0022200955",
  "espn_id": "401469110",
  "date": "Mar 03, 2023",
  "matchup": "MIN @ LAL",
  "headline": "Gobert leads Timberwolves past Lakers despite Davis' 38",
  "body": "LOS ANGELES -- — Rudy Gobert had 22 points and 14 rebounds, Anthony Edwards scored 19 points and the Minnesota Timberwolves completed a two-game Los Angeles sweep with a 110-102 victory over the short-handed Lakers on Friday night.\n\n\r\n              Naz Reid scored 15 for the Wolves, who moved back above .500 and rebounded from an 0-3 stretch with impressive back-to-back wins over the Clippers and Lakers, whose fourth-quarter rally fell just short. Minnesota also blew most of a big late lead three days ago against the Clippers, but their tenacity is promising to coach Chris Finch.\n\n\r\n              “The last couple of games, it's been big for us,” Finch said. “We've found a way. It's a perfect time to find that resiliency.”\n\n\r\n              Anthony Davis scored 38 points and Malik Beasley had 15 for the Lakers, who lost for only the second time in six games. Los Angeles couldn’t keep up without injured LeBron James and D’Angelo Russell, who wasn’t able to suit up against the team that traded him Feb. 9 after parts of four seasons in Minnesota.\n\n\r\n              The Lakers trailed by 14 early in the fourth quarter, but made it close with a 16-6 run down the stretch. Minnesota’s lead dwindled to three points before Davis lost his shoe during a defensive possession, leading to Mike Conley hitting an open 3-pointer with 1:13 to play. The Wolves closed it out authoritatively from there.\n\n\r\n              “There was a time when it looked like we were playing in mud,” Lakers coach Darvin Ham said. “(The Wolves) are fighting for their lives as well and trying to get to the postseason. They had that urgency, and we didn't.”\n\n\r\n              James missed his third straight game with a right foot injury, and the NBA's career scoring leader won't even be re-evaluated until late this month, when only a handful of games remain in the Lakers' season. His absence threatens to negate the recent push by Los Angeles, which surged out of the trade deadline with its revamped roster.\n\n\r\n              The Lakers' playoff fate could be determined before James returns: This loss to eighth-place Minnesota began a vital stretch of Los Angeles' season with 10 of 12 games at home. Los Angeles is 5-3 since its flurry of activity at the deadline.\n\n\r\n              “I feel like we're playing pretty good basketball,” Davis said. “When our team is whole, we've shown what we can do. It's just tough, knowing how good we are.”\n\n\r\n              Eight Timberwolves scored at least eight points, leading Gobert to praise their reserves in a balanced offensive attack. Gobert got rolling himself on both ends of the court when he switched into a defensive matchup with Davis in the second quarter.\n\n\r\n              “The last two games, the bench has been huge, coming into the game with that energy and the mindset,” Gobert said. “You can tell we're on a mission right now.”\n\n\r\n              Davis still had a prolific offensive game, but with Gobert hounding him on defense, he also committed a season high-tying six turnovers, giving him 11 in his last two games.\n\n\r\n              Dennis Schröder had 12 assists and no turnovers while playing on an injured ankle for the Lakers, who struggled to run an offense when their German point guard wasn't on the floor.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Jaylen Nowell missed his third straight game with a left knee injury. ... Conley finished with 14 points.\n\n\r\n              Lakers: Russell missed his fourth straight game since spraining his right ankle last week, but he is scrimmaging in practice, Ham said. Russell could return Sunday. ... Russell, Jarred Vanderbilt and Beasley will return to Target Center with the Lakers on March 31. ... They wore their Minneapolis Lakers throwback uniforms.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Sacramento on Saturday.\n\n\r\n              Lakers: Host Golden State on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995019.115239
}