{
  "game_id": "0022300030",
  "espn_id": "401584118",
  "date": "Nov 17, 2023",
  "matchup": "DET @ CLE",
  "headline": "Darius Garland scores 28 points for the Cavaliers in a 108-100 win over Pistons in tournament play",
  "body": "CLEVELAND -- — Darius Garland had a season-high 28 points and Evan Mobley and Max Strus scored 18 apiece as the Cleveland Cavaliers beat Detroit 108-100 in an NBA In-Season Tournament game on Friday night, handing the Pistons their 10th consecutive loss.\n\n\r\n              Mobley also had 11 rebounds and five assists, and undrafted rookie Craig Porter scored a career-best 12 points in 16 minutes for Cleveland, which returned home after a 2-2 West Coast trip. Jarrett Allen had 10 points and five blocked shots.\n\n\r\n              “We were back in front of the best fans in the league and we got our first win in the tournament, so that’s really big for us,” Garland said. “Craig is still getting his feet wet, but he’s really good and he’s going to keep getting better.”\n\n\r\n              Cavaliers shooting guard Donovan Mitchell, who is averaging 29.2 points, was inactive because of a right hamstring strain. Garland missed the final game of the road trip with a neck strain and appeared in just his seventh game of the season.\n\n\r\n              “We know how important Darius is to us,” Cleveland coach J.B. Bickerstaff said. “He is the leader of this team, the ball is in his hands, and he has the keys. We need Darius to keep growing and keep leading this team.”\n\n\r\n              Cade Cunningham had 20 points and eight assists, and Kevin Knox II had 11 points and 10 rebounds for Detroit. The Pistons have the worst record in the league at 2-11, last winning on Oct. 28 against Chicago.\n\n\r\n              The Cavaliers improved to 1-1 in East Group A, while Detroit is 0-3. The Pistons, who committed 13 turnovers in the first half, have lost six in a row at Rocket Mortgage FieldHouse and six straight overall to Cleveland.\n\n\r\n              “When you’re on the road, you have to be able to take care of the ball,” Detroit coach Monty Williams said. “And that’s on me to create a better mindset. The turnovers in the first half put us in a hole.”\n\n\r\n              Pistons rookie Ausar Thompson had nine points and 10 rebounds, and Jaden Ivey and Isaiah Stewart each scored 11 points. Stewart grabbed 10 boards as their starting frontcourt combined for 30 rebounds.\n\n\r\n              “We know we’re right there,” Stewart said. “Our defense was solid all night, but we had that stretch of turnovers that lost us the game. If we just clean that up, we’ll be fine — and we all know that.”\n\n\r\n              Strus scored 13 in the first quarter and ignited the sellout crowd in the second with a thunderous slam over Thompson. Cleveland made 17 of its first 23 shots and built a 16-point lead before carrying a 59-45 advantage into the half.\n\n\r\n              “Max has infectious energy because of how hard he plays the game,” Bickerstaff said. “He has a way of making momentum-shifting plays, whether it’s a big three or a big finish at the rim.”\n\n\r\n              Detroit didn’t commit a turnover in the third and pulled within 75-71, but Garland buried a 3-pointer to quell the threat.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Visit Toronto on Sunday afternoon.\n\n\r\n              Cavaliers: Host NBA champion Denver on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995788.790529
}