{
  "game_id": "0021500888",
  "espn_id": "400828775",
  "date": "Feb 29, 2016",
  "matchup": "MEM @ DEN",
  "headline": "Randolph has 22 points in Grizzlies' 103-96 win over Denver",
  "body": "DENVER -- In a tight game, Zach Randolph helped make the difference with a couple of emphatic finishes at the rim.\nRandolph scored 22 points, including successive layups during a key fourth quarter sequence, and the Memphis Grizzlies beat the Denver Nuggets 103-96 on Monday night.\n\"Zach is a big-time playmaker, both as a scorer and an assist man,\" teammate Mike Conley said. \"He's really unselfish. We lean on him and tonight was a big game for him and we needed him.\"\nGrizzlies coach David Joerger said it was Conley who helped put Randolph in position for the scores.\n\"Mike Conley waved me off and called a great play,\" Joerger said. \"We got some movement and there's Zach at the front of the rim. Zach steps into space and gets us a couple of real big buckets.\"\n\nMatt Barnes added 16 points and Mario Chalmers 15 for the Grizzlies, and Memphis won its fifth in a row against the Nuggets, including three meetings this season.\nKenneth Faried had 16 points and 11 rebounds to lead the Nuggets, who had 20 turnovers leading to 30 points for Memphis in losing for the fifth time in six games.\n\"We made some careless turnovers and it's hard to beat a team when they shoot 36 free throws and we give up 30 points on turnovers,\" said Gary Harris, who scored 15 points. \"We've just got to clean up those areas.\"\nNewly signed JaKarr Sampson started in place of injured forward Danilo Gallinari, the Nuggets' leading scorer who is sidelined indefinitely after severely spraining his right ankle Friday night at Dallas. Sampson finished with seven points.\nThe Nuggets took a 71-all tie into the fourth quarter when Will Barton connected on a running hook shot in the final seconds of the third.\nBoth teams kept trading baskets through most of the fourth. No more than three points separated the teams until Randolph made consecutive layups to put Memphis up 94-89 with 4:01 remaining.\nConley offset a layup by Faried with one of his own and Randolph swished a hook shot following a Denver turnover to stretch Memphis' lead to seven points with 44 seconds remaining. Chris Andersen and Chalmers each converted a pair of free throws in the final moments to help fend off the Nuggets.\n\"It's a happy locker room,\" Joerger said. \"We got 2-1 on the three-game road trip. We played with the focus that was lacking in Phoenix (when the Grizzlies lost 111-106 Saturday.)\"\nThe Grizzlies took a 48-47 halftime lead on Lance Stephenson's driving layup with 1 second left in the second quarter.\nDenver kept it close despite committing 11 first-half turnovers leading to 15 Memphis points.\nThe Nuggets finished with 20 turnovers leading to 30 Grizzlies points.\nTIP-INS\nGrizzlies: Both Andersen and JaMychal Green are getting time at center in place of injured Marc Gasol, who is out for the rest of the season with a broken right foot. ... Randolph needs 44 points to supplant Tiny Archibald (16,481 points) for 94th on the NBA's career scoring list.\nNuggets: Gallinari was averaging 34.7 minutes and a career-high 19.5 points per game when he suffered the ankle injury. ... Faried has double-doubles in three straight games and 16 on the season.\nUP NEXT\nGrizzlies: Host the Sacramento Kings on Wednesday night.\nNuggets: Host the Los Angeles Lakers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994428.611952
}