{
  "game_id": "0021600424",
  "espn_id": "400899866",
  "date": "Dec 20, 2016",
  "matchup": "MEM vs. BOS",
  "headline": "Thomas scores career-high 44, Celtics beat Grizzlies in OT",
  "body": "MEMPHIS, Tenn. --  After an anemic first half for the Boston Celtics, guard Isaiah Thomas knew things had to change.\n\nThomas took it upon himself to push the Celtics past a 17-point second-half deficit and into overtime for a 112-109 victory over the Memphis Grizzlies on Tuesday night.\n\nThomas scored a career-high 44 points, including 36 after halftime. He also matched his career best for 3-pointers, going 7 of 10 from outside the arc.\n\n\"I just told myself to be a little more aggressive and look for my shot a little more,\" Thomas said, later adding: \"I wasn't trying to get 40, but I knew I needed to be more aggressive.\"\n\nAfter the Grizzlies took a 106-105 lead on a rebound basket by Tony Allen with 1:10 left in the extra period, Boston scored the next five points.\n\nAl Horford had 17 points and 14 rebounds for the Celtics, who won their third straight. Avery Bradley added 16 points.\n\nMemphis coasted to a 45-31 lead in the first half. Then the Grizzlies looked as though they were coasting through the second half -- and not in a good way.\n\n\"Basically, we stayed in the locker room at halftime,\" coach David Fizdale said.\n\nMarc Gasol and Troy Daniels led Memphis with 24 points apiece. Mike Conley had 19 points and eight assists for the Grizzlies, who lost their third in a row -- all at home.\n\nBoth teams had last-second opportunities to win in regulation. Gasol's turnaround 8-footer with 2 seconds left in regulation bounced off the rim. With less than a second left, Horford failed to convert an inbounds pass at the rim, sending the game to overtime at 97-all.\n\n\"Coach (Brad Stevens) told us at halftime, `Just stay with it. Stay composed,\" Horford said. \"We had an awful first half, and he just said, `If you guys stay with it, I guarantee you that you'll get hot, you'll get to scoring.'\n\n\"We believed, and we kept playing.\"\n\nTIP-INS\n\nCeltics: Thomas has led the Celtics in scoring the last three games. He scored 37 points two times previously this season. His previous career best was 38 on three occasions. ... Boston missed all six of its 3-pointers in the first quarter and eight total before Gerald Green converted the ninth attempt in the second quarter. ... The 31 points in the first half were a Boston low for a half this season. .. Bradley has reached double figures in all 28 Celtics games this season. ... Boston played its first overtime game of the season.\n\nGrizzlies: Gasol, who missed all nine of his 3-pointers over the last two games, converted his first two attempts against Boston. ... Memphis, which shot 30 percent in Sunday's loss to the Jazz, made only one of its first 11 shots. ... By the middle of the second quarter, Memphis already had 10 offensive rebounds, the 10th straight game in which the Grizzlies reached that mark. ... Memphis won its previous four overtime games this season. ... F Zach Randolph was ejected with 2:43 left in overtime after being called for a Flagrant 2 foul against Kelly Olynyk.\n\nYOUNG AND OLD\n\nStevens, at 40, is one of the youngest coaches in the NBA. Meanwhile, on the other sideline, Vince Carter, at 39-plus the oldest active player in the league, came off the bench to play for the Grizzlies. Carter is about 3 months younger than Stevens.\n\nMOTIVATING ISAIAH\n\nThomas said he got some motivation from assistant coach Jerome Allen at halftime. \"He said, `We need 40 out of you to win,\" Thomas said, adding that Allen told the guard he wasn't built to score 40 points. \"We were joking around, but I was like, `I got you.' He was just playing with my head a little bit.\"\n\nUP NEXT\n\nCeltics: Have a chance to sweep the three-game road trip Thursday against the Indiana Pacers.\n\nGrizzlies: Memphis got out of town quickly en route to Detroit to play the Pistons on Wednesday night. The Grizzlies are 7-0 this season on the second night of back-to-backs.",
  "source": "espn_api",
  "crawled_at": 1764995614.44031
}