{
  "game_id": "0022000927",
  "espn_id": "401307730",
  "date": "Apr 27, 2021",
  "matchup": "OKC @ BOS",
  "headline": "Thunder snap 14-game skid with 119-115 win over Celtics",
  "body": "BOSTON -- — The Oklahoma City Thunder were on the verge of making some unpleasant history. Lu Dort made it his mission not to let that happen.\n\n\r\n                    Dort scored 24 points, Darius Bazley added 21 points and 10 rebounds, and the Thunder snapped a 14-game skid with a 119-115 win over the Boston Celtics on Tuesday night. \n\n\r\n                    Isaiah Roby and Ty Jerome each finished with 15 points for the Thunder, who won their first game since March 31 against Toronto.\n\n\r\n                    A 15th straight loss would have set a franchise record for Oklahoma City.\n\n\r\n                    “I saw it today and I told Shai (Gilgeous-Alexander), ‘Shai, we’re winning today,’\" Dort said. \"That was my mindset just before the game — to do everything to win. The fact that we did it as a team was great.”\n\n\r\n                    The Thunder's recent swoon coincides with a foot injury that sidelined leading scorer Gilgeous-Alexander more than a month ago — they have won just two games since.\n\n\r\n                    Oklahoma City committed 27 turnovers against Boston but went 13 of 30 from 3-point range and 28 of 36 from the free-throw line to beat back a late charge.\n\n\r\n                    “It was a character test,\" Thunder coach Mark Daigneault said. \"It was an opportunity to show who we are through the adversity. I came away impressed.” \n\n\r\n                    Jaylen Brown scored 39 points for the Celtics, who have lost four of five as they fight to maintain their position in the tight Eastern Conference playoff race. Payton Pritchard added a career-high 28 points.\n\n\r\n                    The Celtics made the Thunder work in the closing minutes.\n\n\r\n                    Oklahoma City had its 11-point lead erased in the third quarter before taking a 106-95 edge on a layup by Bazley with 2:25 left in the game.\n\n\r\n                    It was 110-100 before the Celtics reeled off seven straight points. Boston applied pressure, but Bazley got in the lane for a dunk.\n\n\r\n                    Boston cut it to 112-109 on a pair of free throws by Pritchard with 30.8 seconds remaining. The Celtics then fouled Theo Maledon, who hit two free throws.\n\n\r\n                    Brown was fouled on a layup attempt and hit both free throws. Oklahoma City then beat Boston’s full-court press and Roby dunked to close it out.\n\n\r\n                    The Celtics played without All-Star forward Jayson Tatum (left ankle impingement), point guard Kemba Walker (strained left oblique) and big man Robert Williams (left knee soreness).\n\n\r\n                    Coach Brad Stevens said he’s hopeful both Tatum and Williams will be able to return Wednesday when Boston hosts Charlotte. Walker will miss that game and maybe more — yet another hiccup for a team Stevens said has little room for error with 10 games left in the regular season.\n\n\r\n                    “We've got to play with more of a sense of urgency,” Brown said. “Tonight I feel like we didn't have the sense of urgency that we needed across the board. A team that has some young, talented players came ready to play. And we got beat.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Scored 18 points off 14 Celtics turnovers. … Had 15 turnovers in the first half. ... Shot 44% (18 of 41) in the opening 24 minutes but went 14 of 17 from the free throw line to take a 55-49 lead into halftime.\n\n\r\n                    Celtics: Shot 39% (19 of 49) in the first half. ... Fournier started 0 for 3 before he connected on a jumper in the second quarter. It was his first field goal in three games since returning from the league's health and safety protocols last week. Before that, he had missed 13 straight field-goal attempts.\n\n\r\n                    SPECIAL WIN\n\n\r\n                    Daigneault grew up in Leominster, Massachusetts, and had several family members in attendance.\n\n\r\n                    He came back onto the arena floor afterward and spoke with them for several minutes as they stood in the stands. \n\n\r\n                    “There’s no place I’d rather be working right now than to get a win in the Boston Garden,” Daigneault said.\n\n\r\n                    HONORING CLARKE\n\n\r\n                    The Celtics observed a pregame moment of silence for Boston native and former University of Kentucky player Terrence Clarke.\n\n\r\n                    Clarke died in a car crash in Los Angeles last week, a month after declaring for the NBA draft. \n\n\r\n                    Several Celtics, including Brown and Tatum, were mentors to Clarke and he was their guest at multiple games last season.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Host New Orleans on Thursday.\n\n\r\n                    Celtics: Host Charlotte on Wednesday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997066.277627
}