{
  "game_id": "0022200526",
  "espn_id": "401468681",
  "date": "Dec 29, 2022",
  "matchup": "TOR vs. MEM",
  "headline": "Morant has career-high 17 assists, Grizzlies rout Raptors",
  "body": "TORONTO -- — Ja Morant had a career-high 17 assists and scored 19 points and the Memphis Grizzlies won for the first time in three games, beating the struggling Toronto Raptors 119-106 on Thursday night.\n\n\r\n              Dillon Brooks scored 25 points, Desmond Bane had 16 before fouling out and Steven Adams had 14 points and 17 rebounds. Memphis recorded a season-high 37 assists and won its third straight north of the border after losing its previous seven trips to Canada.\n\n\r\n              “It’s super impressive,” Grizzlies coach Taylor Jenkins said about Morant’s 17 assists. “Tons of credit to Ja. It just sets a tone for us. His unselfishness, we talk about that all the time.”\n\n\r\n              Pascal Siakam had 25 points and 10 rebounds for Toronto before fouling out, extending his career-best streak with 25 or more to six. Gary Trent Jr. scored 20 points and O.G. Anunoby had 16 as Toronto’s home losing streak reached five. The Raptors have lost eight of 10 overall.\n\n\r\n              “That’s pretty unacceptable with the effort we gave,” Raptors coach Nick Nurse said. “We’ve got to get focused and connected and get serious about playing harder.”\n\n\r\n              The Grizzlies came in having lost four of five, but beat Toronto by outscoring the Raptors 70-50 on points in the paint.\n\n\r\n              “If we’re clicking like this, a lot of teams can’t beat us,” Brooks said.\n\n\r\n              Morant shot 9 for 19 and had a pair of eye-popping dunks in his first career game in Toronto. He missed last season’s road game against the Raptors because of a sprained left knee, while the two previous meetings were played outside Canada because of the COVID-19 pandemic.\n\n\r\n              Cheered in the pre-game introductions, Morant drew gasps and cheers from the crowd with his only basket of the second quarter, using a pump fake to evade Anunoby at the 3-point line before exploding to the rim for a two-handed slam.\n\n\r\n              “I think they’ve been watching what’s all over the internet of him flying around, dunking on guys, putting on a show,” Brooks said of the welcome Morant received from Toronto fans. “They were ready to watch and he didn’t disappoint.”\n\n\r\n              Morant reached his assist mark by racking up seven in the third quarter.\n\n\r\n              “He’s able to get three, four guys on him and find us for 3s, find us for dump offs,” Brooks said. “He’s a one-in-a-generation talent.”\n\n\r\n              Siakam and Nurse got technical fouls after Siakam shoved Brooks following a defensive foul by Brooks late in the fourth.\n\n\r\n              Raptors guard Fred VanVleet was not available because of continued soreness in his lower back, the same injury that knocked him out a home loss to the Clippers on Tuesday night.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Adams had eight rebounds in the first quarter. … Brooks was born and raised in nearby Mississauga. … Morant reached his previous high of 14 assists four times, most recently Nov. 27 at New York.\n\n\r\n              Raptors: Anunoby, Siakam, Barnes, Juancho Hernangomez and rookie Christian Koloko started, Toronto’s 18th different lineup in 35 games. … Shot 6 for 20 in the second quarter. ... Following the game, Toronto waived F Justin Champagnie.\n\n\r\n              SHARE MORE, WIN MORE\n\n\r\n              Memphis is 13-1 this season when recording more assists than its opponent.\n\n\r\n              BAD START, BETTER FINISH\n\n\r\n              Toronto’s Scottie Barnes missed his first seven shot attempts and didn’t score in the first half but made seven of his final 11 attempts. He finished with 14 points and 10 rebounds.\n\n\r\n              “Just got to be more aggressive from the start,” Nurse said.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host New Orleans on Saturday night.\n\n\r\n              Raptors: Host Phoenix on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994070.732758
}