{
  "game_id": "0021900117",
  "espn_id": "401160759",
  "date": "Nov 08, 2019",
  "matchup": "MEM @ ORL",
  "headline": "Nikola Vucevic scores 23 points, Magic beat Grizzlies 118-86",
  "body": "ORLANDO, Fla. --  Big nights by big men Nikola Vucevic and Jonathan Isaac carried the Orlando Magic to their first runaway victory of the season.\n\nVucevic dominated at the offensive end with 23 points, 16 rebounds and six assists. Isaac had 22 points and eight rebounds, but it was his four blocks and game-long presence around the rim that turned the game in Orlando's favor, as the Magic beat the Memphis Grizzlies 118-86.\n\nThe Magic outscored the Grizzlies 34-8 in the fourth quarter, limiting the visitors to 3-for-23 shooting (13%) and forcing four turnovers. Isaac was the dominating player at the defensive end.\n\n\"He was terrific,\" Magic coach Steve Clifford said. \"He's so active with his hands, blocking shots. You can see his confidence growing every time he steps on the floor.\"\n\nThe Grizzlies led the NBA in points in the paint. Orlando controlled that stat Friday.\n\n\"We only scored 34 points in the paint and that's a credit to him and their entire team,\" Memphis Coach Taylor Jenkins said. \"His defense, his length, his activity, he was really strong at both ends of the floor.\"\n\nEvan Fournier scored 19 points and Aaron Gordon added 17 for the Magic, who stopped a four-game losing streak. Orlando, which struggled again with its 3-point shooting again (7 of 28), made up for it by outscoring Memphis 62-34 in the paint.\n\nMemphis, which had 137 points in its last game, the second-highest total in franchise history, was held under 100 for the second time this season. Jonas Valanciunas led the Grizzlies with 15 points and nine rebounds. Jaren Jackson had 14 points and Brandon Clarke 13 for the Grizzlies, who lost for the fourth time in five games.\n\n\"You can look at the stat sheet and go `OK, 34-8 in the fourth quarter,' \" Jenkins said, \"but we weren't good in the first, second or third either to even give us a chance. We were playing catch-up the whole game.\"\n\nOrlando started the fourth period on a 13-0 run to get some separation from Memphis. Michael Carter-Williams started the fourth-quarter run with a 3-pointer. D.J. Augustin contributed another and Vucevic finished the spurt with a three-point play to make it 97-78 with 7:49 left.\n\nMemphis missed its first nine shots of the fourth quarter and turned the ball over three times. Isaac was in the middle of much of that misery, using his length and quickness to bottle up passing lanes for the Grizzlies' guards and force shooters to rush their stroke.\n\n\"His defense has been amazing,\" Vucevic said of his teammate. \"I told him in preseason that he could be a candidate for defensive player of the year if he keeps playing like that. I really believe that. He's taking a lot of pride in trying to stop his guy and helping others as well.\"\n\nThe Magic, who made only one of 12 3-pointers in the first half, got four in the third quarter and jumped out to their biggest lead of the game, 79-66, on a dunk by Gordon with 2:23 left in the period.\n\nMemphis cut the deficit to 84-78 by the end of the period, but the Grizzlies night-long struggles against the Magic interior defense continued. The Grizzlies' guards got caught in the air too many times and either forced shots or turned the ball over.\n\nTIP INS\n\nGrizzlies: Memphis hit just five of 19 shots (26.3%) in the first quarter. ... The Grizzlies lead the NBA in points in the paint (57.7 per game), but had only 34.\n\nMagic:  F Terrence Ross missed his second straight game with a sore knee. . Orlando hit just one of 12 3-pointers in the first half. ... The Magic are last in the NBA in scoring at 95.1 points a game, and went over 100 points for just the second time this season. ... Jonathan Isaac has at least one blocked shot in every game this season. He had four against Memphis.\n\nUP NEXT:\n\nMemphis: Hosts Dallas in the second game of its first back-to-back this season.\n\nOrlando: Host Indiana Pacers on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995763.174158
}