{
  "game_id": "0022400642",
  "espn_id": "401705208",
  "date": "Jan 25, 2025",
  "matchup": "CHI vs. PHI",
  "headline": "Tyrese Maxey has 31 points and 9 assists in the 76ers' 109-97 victory over the Bulls",
  "body": "CHICAGO -- — Tyrese Maxey had 31 points and nine assists, Kelly Oubre Jr. added 22 points and 12 rebounds and the Philadelphia 76ers beat the Chicago Bulls 109-97 on Saturday night for their second straight victory.\n\n\r\n              The injury-depleted Sixers ended a seven-game losing streak Friday night at East-leading Cleveland. Philadelphia pulled out this one after forward Paul George left in the second quarter with a left finger injury after scoring nine points.\n\n\r\n              Zach LaVine scored 25 points for Chicago and Nikola Vucevic had 22 points and 12 rebounds. The Bulls have lost seven of eight.\n\n\r\n              The 76ers outscored the Bulls 29-14 in the third quarter to put away a tight game with 14 lead changes. Both teams are jostling for a final play-in spot in the Eastern Conference.\n\n\r\n              Philadelphia star Joel Embiid missed his 11th straight game because of a left knee injury.\n\n\r\n              Takeaways\r\n              76ers: Philadelphia got a small boost with the return of guard Kyle Lowry, who had missed 10 games. Nurse said he expected injured forwards Caleb Martin and KJ Martin to resume practicing this week.\n\n\r\n              Bulls: Rallied several times to keep it close, but fell short.\n\n\r\n              Key moment\r\n              LaVine was driving in on a layup in an attempt to tie it at 93 all late in the fourth, but Oubre swatted the ball cleanly out of his hands with 4:19 left. The Sixers then finished the game with a 16-6 run.\n\n\r\n              Key stat\r\n              Chicago committed 19 turnovers, leading to 25 Philadelphia points. \n\n\r\n              Up next\r\n              The 76ers host the Los Angeles Lakers on Tuesday night to open a six-game homestand. The Bulls host Denver on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997065.342229
}