{
  "game_id": "0022300100",
  "espn_id": "401584728",
  "date": "Oct 29, 2023",
  "matchup": "SAC vs. LAL",
  "headline": "Monk delivers in OT as Kings beat Lakers 132-127 on 20th anniversary of James' NBA debut",
  "body": "SACRAMENTO, Calif. -- — Malik Monk scored 11 of his 22 points in overtime and fed Kevin Huerter for a key 3-pointer with 32 seconds left, and the Sacramento Kings spoiled the 20th anniversary of LeBron James’ NBA debut in the same city with a 132-127 win over the Los Angeles Lakers on Sunday night.\n\n\r\n              De’Aaron Fox had 37 points and eight assists for the Kings, scoring eight points in the final six minutes of regulation after returning from an ankle injury earlier in the fourth quarter. Domantas Sabonis added 12 points and 15 rebounds before fouling out.\n\n\r\n              “That was a gritty win by our team,” Kings coach Mike Brown said. “We’re making steps in the right direction. We had a lot of great performances from a lot of people. Malik was big for us, especially in overtime.”\n\n\r\n              James, the No. 1 overall pick in 2003 by the Cleveland Cavaliers, finished with 27 points, 15 rebounds and eight assists in 39 minutes. He had 25 points, nine assists and six rebounds on Oct. 29, 2003, in a loss to the Kings in their former arena. \n\n\r\n              James’ first basket in that game was a jumper that cut an early Kings lead to 7-6. On Sunday, James’ first basket was a 3-pointer that cut the Kings’ lead to 7-6.\n\n\r\n              “It’s pretty cool when you look at it,” James said. “It’s when I started my career, and being at Arco Arena at the time, lots of memories. It’s special and I’m still doing it.”\n\n\r\n              Derek Richardson, who was one of the three referees for James’ debut game, was part of the three-ref crew on Sunday night as well.\n\n\r\n              Anthony Davis added 30 points and 16 rebounds for the Lakers (1-2), who trailed by 15 before closing the fourth quarter on a 9-2 run to force overtime.\n\n\r\n              Monk, who missed nine of his first 13 shots, was perfect on all four attempts he took in overtime. He made two 3-pointers, assisted on Huerter’s 3-pointer that gave the Kings a 130-125 lead, then sealed the win with a pair of free throws with 15 seconds remaining.\n\n\r\n              If Fox misses any time because of his injury, Monk would be the likely fill-in.\n\n\r\n              “He’s a really good offensive player for us,” Brown said. “He knows, I know, everybody in Sacramento knows he can play at a high level on that end of the floor. What he’s got to do is lock in defensively. When he does that he can be a really high level two-way player that can start at times.”\n\n\r\n              The Lakers, who have lost four of the last five games between the two teams, never found a consistent rhythm to their offense despite six players in double figures. They shot 39.5% in the first half and committed 12 turnovers.\n\n\r\n              “I love competitive mistakes but at the end of the day we ought to be able to execute, get stops, and hold teams to one possession,” Lakers coach Darvin Ham said. \n\n\r\n              Fox, who had 39 points in a season-opening loss to the Warriors on Friday, was 14 of 24 but was still walking with a limp before departing in overtime. Fox rolled his ankle in the fourth quarter and was helped off the court and into the Kings locker room. He returned after missing only 44 seconds of game time and immediately gave Sacramento a lift with his third 3-pointer.\n\n\r\n              Huerter had 12 points after going into the game in an 0-for-9 shooting slump.\n\n\r\n              “I shot with him this morning and I knew he’d do something tonight, and he did that,” said teammate Keegan Murray, who had 17 points, eight rebounds and five assists. “As a team we all had faith in him.”\n\n\r\n              The Kings limited Los Angeles to 37.5% shooting (9 of 24) and scored 41 points in the first quarter.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Return to Los Angeles to host the Magic on Monday.\n\n\r\n              Kings: Travel 60 minutes south to play the Warriors on Wednesday. Golden State beat Sacramento 122-114 last Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https:.//apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996807.8602371
}