{
  "game_id": "0022400226",
  "espn_id": "401704792",
  "date": "Nov 13, 2024",
  "matchup": "POR vs. MIN",
  "headline": "Sharpe and Clingan power the Trail Blazers to a 106-98 victory over the Timberwolves",
  "body": "PORTLAND, Ore. -- — Shaedon Sharpe scored 33 points, Donovan Clingan narrowly missed a triple-double with 17 points, 13 rebounds and eight blocks on Wednesday, and the Portland Trail Blazers beat the Minnesota Timberwolves for the second straight night 106-98. \n\n\r\n              Anthony Edwards scored 24 points as Minnesota squandered an early lead and dropped its third straight game.\n\n\r\n              The teams entered the fourth quarter tied before Portland took control behind the defense of Clingan, who had four blocks in the period as Minnesota missed 10 of its first 11 shots to start the final frame.\n\n\r\n              Portland extended its lead to double digits for the first time on free throws by Sharpe to make it 89-78. \n\n\r\n              Takeaways\r\n              Wolves: Minnesota played without starting point guard Mike Conley. Conley played in the first two back-to-backs of the season, but resting him Wednesday is part of a bigger plan for the 37-year old point guard. “We’re not a rest team generally ... But we had the mindset this season to be a little more proactive with Mike,\" Wolves coach Chris Finch said. \n\n\r\n              Trail Blazers: The Blazers were without starting point guard Anfernee Simons, who left Tuesday’s game with shortness of breath. “He just didn’t feel very well today,” head coach Chauncey Billups said. Billups said he expected further tests and that Simons doesn't seem worried. Portland was also without Robert Williams, who is being held out of back-to-backs.\n\n\r\n              Key moment\r\n              Shaedon Sharpe’s put-back slam dunk with 5:26 left in the game put Portland up 91-83, sending the home crowd into a frenzy.\n\n\r\n              Key stat\r\n              Minnesota shot 7 for 39 (18%) from the 3-point line. The Wolves entered Wednesday ranked fourth in the NBA in 3-point percentage.\n\n\r\n              Up next\r\n              The Timberwolves are at Sacramento on Friday, while the Trail Blazers are off until a Sunday game against Atlanta.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998195.791478
}