{
  "game_id": "0022400196",
  "espn_id": "401704762",
  "date": "Nov 08, 2024",
  "matchup": "LAC @ SAC",
  "headline": "Norman Powell has 31 points and 12 rebounds as the Clippers hold off the Kings 107-98",
  "body": "SACRAMENTO, Calif. -- — Norman Powell posted his first career double-double with 31 points and 12 rebounds, and the Los Angeles Clippers beat the Sacramento Kings 107-98 on Friday night for their third straight win.\n\n\r\n              James Harden added 22 points for the Clippers, who led nearly the entire way. They took a 78-73 lead into the fourth quarter and began the period with a 16-5 run. \n\n\r\n              Kevin Porter Jr. scored nine points in the fourth and Los Angeles withstood a late push by the Kings, who cut the deficit to four with under three minutes left. \n\n\r\n              De’Aaron Fox led the Kings with 31 points. Domantas Sabonis added 23 points and 12 rebounds.\n\n\r\n              Harden had 15 points in the first quarter and Powell scored 11 in the second to help the Clippers build a 51-45 halftime lead.\n\n\r\n              Takeaways\r\n              Clippers: Los Angeles, looking to hold down the fort until star Kawhi Leonard returns from right knee inflammation, is above .500 for the first time this season after a 2-4 start. Powell and Harden are both averaging more than 20 points per game.\n\n\r\n              Kings: Sacramento was 3 of 26 from 3-point range and made just one 3 in the second half. The Kings are in the bottom five in the NBA in 3-point shooting, entering the game at a 32.5% clip.\n\n\r\n              Key moment\r\n              The Kings cut a 16-point fourth-quarter deficit to four with under three minutes to play, but Powell and Amir Coffey hit consecutive 3-pointers to push the lead back to double digits.\n\n\r\n              Key stat\r\n              Powell has blossomed early this season, scoring 20 points or more for the eighth straight game and finally notching a double-double in his 10th season. He has taken advantage of more playing time with Leonard injured and Russell Westbrook and Paul George no longer on the team.\n\n\r\n              Up next\r\n              Clippers: Host the Toronto Raptors on Saturday.\n\n\r\n              Kings: At the Phoenix Suns on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998056.768839
}