{
  "game_id": "0022400841",
  "espn_id": "401705407",
  "date": "Feb 26, 2025",
  "matchup": "MIA vs. ATL",
  "headline": "Herro, Robinson each score 24, and the Heat hit 23 3s on the way to 131-109 win over Hawks",
  "body": "MIAMI -- — Tyler Herro scored 24 points and added 10 assists, Duncan Robinson scored 24 points off the bench and the Miami Heat shot a season-best 59% in a 131-109 win over the Atlanta Hawks on Wednesday night.\n\n\r\n              Davion Mitchell made all five of his 3-point tries and scored 20 for the Heat, who got 20 points and nine rebounds from Bam Adebayo.\n\n\r\n              Miami made 23 3-pointers, one shy of the franchise record. The Heat had 39 assists on 45 field goals.\n\n\r\n              Dyson Daniels scored 18 points and Trae Young and Caris LeVert each had 17 for the Hawks — who gave up 65 points in the first half, then 66 more in the second half.\n\n\r\n              Takeaways\r\n              Hawks: Atlanta fell to 6-22 this season when giving up at least 120 points. That might be the magic defensive number for the Hawks, who are 21-10 when allowing 119 or fewer points this season.\n\n\r\n              Heat: The game was the start of a stretch in which Miami will play nine home games in a 10-game span, and 14 home games in a 17-game stretch. Entering Wednesday, the Heat had played once at home in four weeks — nine out of 10 on the road sandwiched around the All-Star break.\n\n\r\n              Key moment\r\n              Miami went on a 23-6 run to close the third quarter, turning a three-point deficit into a 107-93 lead going into the final 12 minutes.\n\n\r\n              Key stat\r\n              Miami had 107 points through three quarters, tying the franchise record done on two previous occasions. The others: Feb. 6, 1991, at New Jersey and at home on March 29, 2024, against Portland. There were 200 points scored through three quarters, the fourth-most in a Heat game.\n\n\r\n              Up next\r\n              Atlanta plays host to Western Conference-leading Oklahoma City on Friday. Miami plays host to Indiana on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998269.218147
}