{
  "game_id": "0021501156",
  "espn_id": "400829043",
  "date": "Apr 05, 2016",
  "matchup": "TOR vs. CHA",
  "headline": "DeRozan scores 26 as Raptors beat Hornets 96-90",
  "body": "TORONTO --  Before facing the Raptors, Hornets coach Steve Clifford said he wanted his players to \"have a readiness to start the playoffs.\"\n\nThey certainly weren't ready to take on Toronto.\n\nDeMar DeRozan scored 26 points, Kyle Lowry had 12 of his 21 in the fourth quarter and the Raptors beat Charlotte 96-90 on Tuesday night, handing the Hornets back-to-back losses for the first time in more than two months.\n\nCharlotte trailed by 10 points after one and fell behind by as many as 19 before a furious fourth-quarter rally came up short.\n\n\"You can't get off to the start we did,\" Clifford said. \"When you dig yourself that big a hole against a team as good as this, it's just hard.\"\n\nCharlotte, which lost at Cleveland on Sunday, had not lost consecutive games since defeats at Utah and Portland on Jan. 27 and 29. The Hornets had won 22 of 29 since.\n\nThe Hornets also trailed by 10 after the first quarter against the Eastern Conference-leading Cavaliers.\n\n\"The other night against Cleveland and tonight we just started out really flat,\" guard Kemba Walker said. \"We're not the type of team that can do that. We have to play well from the start.\"\n\nWalker missed 12 of his 16 field goal attempts and finished with 11 points, eight of them in the final quarter.\n\n\"I really put it on myself,\" Walker said of the back-to-back defeats. \"When we're really good, I'm the one that's setting the tempo. I haven't been doing that for my team lately.\"\n\nJonas Valanciunas had 12 points and 12 rebounds, and Corey Joseph added 11 points, including two key free throws in the closing seconds, as Toronto won for the third time in four games.\n\n\"We found a way,\" Raptors coach Dwane Casey said. \"We made some crucial plays.\"\n\nJeremy Lin matched a season best with four 3-pointers and scored 21 points for Charlotte, while Marvin Williams had 15.\n\n\"I just didn't feel we came out with the same juice we needed to and created a big hole for ourselves,\" Lin said.\n\nAll-Star guards DeRozan and Lowry returned to the starting lineup after sitting out Saturday's loss at San Antonio.\n\nCharlotte's Al Jefferson (right knee) returned after missing Sunday's game. He came off the bench and finished with five points and matched a season high with 11 rebounds.\n\nToronto led 75-59 to begin the fourth but Charlotte used a 7-0 spurt to cut the gap to nine.\n\nJoseph stopped the run with a driving hook shoot and Lowry added floater in the lane to restore Toronto's double-digit cushion, making it 79-66 with 7:01 remaining.\n\nA 3 by Williams brought Charlotte within six with just over a minute left, but DeRozan answered with a basket.\n\nWalker scored twice while getting fouled in the final minute, but Joseph kept Toronto's lead safe by making a pair of free throws with 6.1 seconds left.\n\nFINE AT THE LINE\n\nToronto improved to 15-4 when DeRozan makes at least 10 free throws. He went 11 for 12 from the line against the Hornets.\n\nHOME IS WHERE THE WINS ARE\n\nToronto equalled a team record with its 30th home victory of the season, matching the mark set in 2006-07. The Raptors have two games left to break the mark. They host Indiana on Friday and Philadelphia on April 12.\n\nLATE NIGHT FOR LOWRY\n\nFormer Villanova star Lowry attended Monday night's NCAA championship game victory over North Carolina, then caught a red-eye flight back to Toronto, arriving at approximately 4:30 a.m. Lowry gave his postgame interview wearing a T-shirt and hat marking Villanova's second championship.\n\nROCKY ROAD\n\nThree of the Hornets' final five games are away from home, where they've already played six of the past seven. They're 4-3 during that stretch but just 16-22 on the road this season.\n\nTIP-INS\n\nHornets: Lin started in place of Nicolas Batum (left knee). Batum left Sunday's game after spraining his knee in the first quarter. ... Charlotte was held below 100 points for the first time in seven games.\n\nRaptors: Valanciunas recorded his team-leading 21st double-double. The Raptors are 16-5 in those games. ... Toronto has won three straight home meetings with the Hornets. ... Rapper Drake, the team's global ambassador, watched from his seats near center court. Former Blue Jays second baseman and baseball Hall of Famer Roberto Alomar also attended the game\n\nUP NEXT\n\nHornets: At New York on Wednesday.\n\nRaptors: At Atlanta on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994691.224779
}