{
  "game_id": "0021500776",
  "espn_id": "400828663",
  "date": "Feb 08, 2016",
  "matchup": "LAL @ IND",
  "headline": "George's big finish leads Pacers past Lakers 89-87",
  "body": "INDIANAPOLIS -- Kobe Bryant gave Indiana Pacers fans one last thrill Monday night.\nPaul George made sure there was no Hollywood finish for one of the game's biggest stars.\nAfter Bryant made three straight 3-pointers to give the Los Angeles Lakers a three-point lead with 2:30 left to play, George answered with six straight points to help the Pacers rally for an 89-87 victory.\n\"To finish the game off with the layup and the drive, him guarding, this one was an epic finish and a special finish,\" George said after scoring 21 points and grabbing eight rebounds. \"Just happy we won this.\"\nEven George said it felt like the Pacers were playing on the road.\n\nThe sold out crowd roared on every basket Bryant made and serenaded him with chants of \"Ko-be, Ko-be\" after he gave the Lakers an 82-79 lead with 2:30 left to play. They chanted it again after he was pulled from the game with 10.8 seconds left and the Lakers' fate sealed. Bryant responded by tapping his heart and waving to the crowd on a rugged night.\nHe scored 19 points but was just 6 of 25 from the field and 4 of 14 on 3-point attempts and couldn't pull the struggling Lakers (11-43) out of their tailspin. Los Angeles has lost 12 of 14.\n\"These fans were always very tough. It's as close to a college basketball atmosphere as you can get,\" Bryant said. \"They've always been pretty tough on me here. And tonight at the end, to get a `Thank you' chant from them, it was pretty special.\"\nBut George and his teammates had no stomach for sentimentality -- or the cascading boos they heard from their hometown fans.\nSo after blowing a 17-point third-quarter lead, George delivered the finishing touch.\nHe drew a foul on Jordan Clarkson and made all three free throws to get the Pacers within 84-83 with 1:11 to play. After Bryant missed a 21-footer, George blew past him for a layup, drawing another foul that gave the Pacers an 86-84 lead.\nWhen Bryant missed another 3 with 25.9 seconds left, Monta Ellis made two free throws and when Bryant missed his final shot, a 3 with 17.9 seconds left, it was over.\nGeorge scored only seven second-half points, all in the final 71 seconds. Myles Turner added 14 points and 13 rebounds to help the Pacers (28-24) win for the fifth time in seven games.\n\"I thought we was in L.A., that this was a road game,\" George said. \"He performed late, that's really what all the fans came to see, him to make shots like that. And for a second, man, it stunned me. The crowd going crazy. Getting booed at the free throw line, that's probably the biggest thing I remember from tonight, being booed.\"\nTOUGH NIGHT\nBryant was not the only one who struggled with shooting Monday. The Lakers shot a season-low 31.2 percent from the field and were 8 of 35 on 3-point attempts. Indiana, meanwhile, shot 39.7 percent and was 4 of 27 on 3s. George was 6 of 18 overall and 2 of 10 from beyond the arc.\nFOND FAREWELL\nBryant has fond memories of playing the Pacers. The 45 points he scored in January 2006 is still the series record, and his late tip-in in Game 4 of the 2000 NBA Finals, at Indiana, swung the series as Bryant won his first championship. \"This is where it all started,\" Bryant said, reminiscing about staying at a hotel two hours away. When he was reminded two hours away would put him in Illinois, Bryant responded: \"Well, I may be exaggerating a little bit. But it seemed like a long ways out.\"\nFRIENDLY ADVICE\nBryant said he and George have spoken several times about what George needs to do to become a team leader. Bryant's advice: Keep the focus on basketball. \"That's who he (Bryant) has been,\" Pacers coach Frank Vogel said. \"His work ethic and focus is what has made him who he is. It's good advice for Paul.\"\nTIP-INS\nLakers: Are 5-25 on road this season including 1-8 in their last nine. ... Two-time All-Star Roy Hibbert missed his first game of the season with a sprained left ankle -- in his first trip back to Indiana since being traded by the Pacers last summer. ... Julius Randle had 15 points and matched his career high with 19 rebounds.\nPacers: Pulled off first sweep of Lakers since 2013-14 and only their third ever. ... Pacers center Ian Mahinmi sustained a cut above his eye on the first possession of the game, went to the locker room and had eight stitches before returning to the game at the start of the second quarter with a large bandage over the stitches. He finished with 11 points and five rebounds.\nUP NEXT\nLakers visit Cleveland on Wednesday.\nIndiana hosts Charlotte on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994265.134138
}