{
  "game_id": "0022200368",
  "espn_id": "401468523",
  "date": "Dec 07, 2022",
  "matchup": "MEM vs. OKC",
  "headline": "Morant's triple-double leads Grizzlies past Thunder 123-102",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 26 points, 13 rebounds and 11 assists, and the Memphis Grizzlies used a second-half flurry to beat the Oklahoma City Thunder 123-102 on Wednesday night.\n\n\r\n              Morant’s triple-double was his second this season and the seventh of his career, and his 13 rebounds tied a career high. Dillon Brooks added 24 points and Brandon Clarke finished with 17 points and eight rebounds as the Grizzlies won their season-best fourth straight.\n\n\r\n              Morant surpassed Marc Gasol for the most triple-doubles in franchise history.\n\n\r\n              “It’s an honor, big time,” Morant said. “There’s a lot of great players (who have) been in this organization. ... It’s crazy. It’s something you’ve got to earn, but I feel like my teammates are right up there with me.\n\n\r\n              “It’s my name, but without those guys, it wouldn’t be possible.”\n\n\r\n              Morant said he enjoys assists as well as scoring, noting it gets everybody involved. Memphis coach Taylor Jenkins echoed that sentiment.\n\n\r\n              “When he is just unlocking everything from a playmaking and scoring standpoint, he’s pretty unguardable,” Jenkins said. “That only impacts our being the best offense we can be.”\n\n\r\n              Shai Gilgeous-Alexander led the Thunder with 26 points but was 4 of 14 from the field and 1 of 4 from outside the arc. Tre Mann scored 12 points and Eugene Omoruyi had 11 for Oklahoma City, which saw its three-game winning streak end.\n\n\r\n              “I thought Morant controlled the game,” Thunder coach Mark Daigneault said.\n\n\r\n              Memphis pulled ahead in the second half, outscoring the Thunder 66-50, including 29-15 in the fourth quarter.\n\n\r\n              “We had a chance to win it,” said Thunder guard Josh Giddey, who finished with 10 points and 10 rebounds. \"We just let it kind of get out too far going into the fourth.”\n\n\r\n              Oklahoma City struggled from the field in the first half but converted enough free throws and 3-pointers to stay close. Memphis, meanwhile, started 1 of 10 from outside the arc.\n\n\r\n              That led to Memphis holding a 57-52 lead at the break. But Oklahoma City managed to hang around at the start of the third despite Brooks hitting his first three 3-point attempts.\n\n\r\n              “They deserved to win. They certainly outplayed us,” Daigneault said.\n\n\r\n              TIP-INS\n\n\r\n              Thunder: F Lu Dort was scratched with a left knee contusion. Dort had been the only Oklahoma City player to start every game this season. ... Gilgeous-Alexander had a streak of seven straight games of at least 30 points come to an end. ... Oklahoma City fell to 1-7 when scoring fewer than 110 points.\n\n\r\n              Grizzlies: F Ziaire Williams returned after missing the first 24 games of the season with right patellar tendinitis, scoring four points in 19 minutes. ... Memphis scored 62 points in the paint, its ninth straight game with at least 50.\n\n\r\n              JACKSON’S DEFENSE\n\n\r\n              Memphis forward Jaren Jackson Jr. never got into the flow of the offense, scoring 12 points, but he blocked five shots, tying his season high. Giddey called Jackson “an unbelievable shot-blocker. I thought I had some open layups, and he was punching it to half court.”\n\n\r\n              BANE UPDATE\n\n\r\n              After the game, Memphis announced that guard Desmond Bane could return to action in three to four weeks. Bane has missed 11 games with a big toe sprain.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Continue a five-game trip at Cleveland on Saturday.\n\n\r\n              Grizzlies: Host Detroit on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994220.853717
}