{
  "game_id": "0022201118",
  "espn_id": "401469273",
  "date": "Mar 26, 2023",
  "matchup": "ORL vs. BKN",
  "headline": "Magic overcome 44 points by Bridges, beat Nets 119-106",
  "body": "ORLANDO, Fla. -- - Cole Anthony had 21 points to lead eight Orlando scorers in double figures, and the Magic overcame Mikal Bridges' 44 points for a 119-106 win over the Brooklyn Nets on Sunday night.\nFranz Wagner added 19 points and 10 rebounds, Wendell Carter Jr. had 18 points and six rebounds and Jalen Suggs returned from an injury with 16 points to help the Magic win their third straight.\nIn a game pitting a sixth-place team trying to stay out of a play-in situation (the Nets) and another trying to get in, the Brooklyn ran out of steam in the second half. The game was played only 22 hours after their Saturday night rout of the Heat in Miami.\n\"First quarter, we were able to hang around a little bit. We were OK,\" Brooklyn coach Jacque Vaughn said. \"But to sustain it over the course of the night, to play the way we wanted to play, to defend the way we wanted to play ... we just didn't have it tonight. It's part of the NBA. We'll have another back to back and we'll have to deal with it better than we did this time, for sure.\"\nBridges made 6 of 9 3-point shots (the rest of the Nets shot 2 for 26) and came up one point short of his career high of 45 points.\n\"I really don't care (about the career-high),\" said Bridges, who sat out the final 3:49 with the Nets down by double digits. \"I was trying to win. I didn't care at that point.\"\nSuggs said the Magic was willing to give up mid-range jumpers to Bridges, as long as they were contested.\n\"That's a shot that we're living with, and he hit 'em all night,\" Suggs said. \"But I think even though he was hot, the water was pretty much turned off with everybody else. I've never seen one person beat an entire NBA team. Yeah, he did his thing, but we got the job done defensively.\"\nCam Thomas added 18 points for the Nets, who lost for the sixth time in seven games.\nBridges had 19 of Brooklyn's 25 points in the first quarter, but Carter scored seven points on an 18-5 spurt midway through the second period that put Orlando ahead to stay.\nAnthony and Mo Wagner led another third-quarter run that pushed the Magic's lead to 88-71, and the Nets never threatened after that.\n\"Tonight we did it by committee. That's the message that we continue to sell,\" Magic coach Jamahl Mosley said. \"Eight guys in double figures, 30 assists. Our ability to do it together is the most important thing for this group.\"\nPaolo Banchero finished with 11 points, nine rebounds and four assists for the Magic.\nTIP-INS\nNets: After the third quarter Bridges, with 34 points, was the only Nets scorer in double figures; the Magic had seven. . . . C Nic Claxton had nine rebounds and four blocks. . . . F Royce O'Neal (knee) and G Edmond Sumner (hip) did not play, and G Seth Curry missed a second straight game due to personal reasons.\nMagic: Anthony has scored 14 or more points and grabbed a minimum of five rebounds in eight straight games, all off the bench. ... The three-game win streak is the Magic's longest since they won six in a row Dec. 7-18.\nRETURN OF SUGGS\nSuggs played 23 1/2 minutes after missing four games following a concussion he sustained in a game at Phoenix on March 16. He has missed 29 games this season after missing 37 his rookie year.\n\"I was so eager to get back on the court,\" said the former Gonzaga star who was drafted fifth overall in 2021. \"I think I've missed my fair share of time now.\"\nUP NEXT\nNets: Host Houston on Wednesday.\nMagic: Play at Memphis on Tuesday.\n------\nAP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994310.894617
}