{
  "game_id": "0021800505",
  "espn_id": "401071181",
  "date": "Dec 26, 2018",
  "matchup": "CHA @ BKN",
  "headline": "Nets beat Hornets 134-132 in 2OTs on Harris'  late layup",
  "body": "NEW YORK --  Kemba Walker had the Nets down and almost out, and they turned to a gimmick defense to force the ball out of his hands.\n\nSomebody else on the Charlotte Hornets was going to have to make the winning play, and Malik Monk tried.\n\nIt turned into the winning play for the Nets.\n\nJoe Harris gathered the ball near midcourt after Monk lost his dribble and drove in for the tiebreaking layup with 3.4 seconds left in the second overtime, giving Brooklyn a 134-132 victory on Wednesday night.\n\nHarris finished with season-high 27 points, while Spencer Dinwiddie had 37 points and 11 assists off the bench for the Nets, who won for the ninth time in 10 games.\n\n\"Just a total team win,\" Nets coach Kenny Atkinson said. \"Sure Spencer, Spencer hit some amazing shots, but there were a lot of big plays from the whole group and that's kind of how we're built, that's how we're going to keep going forward.\"\n\nThe teams offset some big shots with mind-boggling miscues over the final stretches of regulation and the overtimes, and Monk made the biggest when he lost his dribble while the Hornets were trying to get a shot.\n\nHe got another crack at it after Harris' basket when a clock malfunction necessitated time being put back on the clock, but he was well off on a last attempt.\n\n\"We should've been able to close the game out. Made a bunch of mistakes at the beginning to even get to the second overtime,\" Monk said.\n\nRondae Hollis-Jefferson finished with 16 points and 15 rebounds, and rookie Rodions Kurucs had 13 points and 12 boards. And they all contributed on a defense that wasn't part of the game plan.\n\n\"It's something we didn't really talk about but it was effective for us and froze them a little bit and allowed us to get just enough stops to be able to win,\" Dinwiddie said.\n\nWalker scored 35 points and engineered a personal 12-2 run that had the Hornets ahead by eight with just over 3 minutes remaining in regulation. But the Nets turned to a zone defense and whatever else they could do to force the ball out of his hands as much as possible late in the game.\n\n\"I don't know of anyone else in this league that's being guarded the way they guarded me. It was like a box-in-1. I haven't seen that since I was in college,\" Walker said. \"It was pretty crazy but I guess that's what teams are going to do, so I've just got to keep trusting in my teammates to make plays.\"\n\nJeremy Lamb added 31 points in the opener of a home-and-home series.\n\nDinwiddie opened the second OT with a four-point play and the Nets went up by six after a basket by Harris. Monk made a 3-pointer and Walker converted a three-point play to tie it, and it went to the final seconds tied after baskets by Dinwiddie and Marvin Williams.\n\nAfter Walker's fourth-quarter flurry, Harris tied it first at 107 and then 110 with 3-pointers. Williams made a 3 before the Nets tied it again when Lamb fouled Dinwiddie on a 3-pointer with 6.5 seconds to play.\n\nWalker was fouled while dribbling and made one, but then he fouled DeMarre Carroll more than 70 feet from the basket as he rushed up the floor. Carroll made the first and missed the second, but the Hornets were called for a lane violation, giving him another attempt. He missed that as well and the game went to OT, where neither team led by more than two.\n\nTIP-INS\n\nHornets: Walker had his 10th 30-point game of the season. ... Lamb was 5 for 5 for 12 points in the first quarter, helping Charlotte to a 29-22 lead.\n\nNets: Dinwiddie had his third 30-point game off the bench this season, matching the franchise record set by Clifford T. Robinson in 1980-81. ... The Nets improved to 9-4 in December.\n\nMONK'S MOMENT\n\nMonk had temporarily fallen out of the rotation, not playing in the last two games as coach James Borrego sought to tighten up the team's defense. He said he simply lost the ball with his chance to win his return to game action.\n\n\"Probably too happy I was in that situation, but I've got to move forward and be ready for Friday,\" he said.\n\nDECEMBER TO REMEMBER\n\nThe Nets' nine wins equals their best December since also winning nine in 2014. They won only eight games combined in October and November.\n\nUP NEXT\n\nThe teams meet in Charlotte on Friday.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994400.37681
}