{
  "game_id": "0022300127",
  "espn_id": "401584755",
  "date": "Nov 01, 2023",
  "matchup": "LAL vs. LAC",
  "headline": "Lakers hold off Clippers 130-125 in OT to snap an 11-game losing streak in the Los Angeles rivalry",
  "body": "LOS ANGELES -- — LeBron James had 35 points and 11 rebounds, Austin Reaves scored seven of his 15 points in overtime and the Los Angeles Lakers snapped an 11-game losing streak against the Los Angeles Clippers with a 130-125 victory Wednesday night.\n\n\r\n              D'Angelo Russell scored 27 points and Anthony Davis had 27 points and 10 rebounds for the short-handed Lakers, who beat their local rivals for the first time since July 2020 in the Florida bubble. The 17-time NBA champion Lakers hadn’t beaten the Clippers on the Lakers' home court at their shared arena since Christmas 2016, also losing 11 in a row.\n\n\r\n              “That was known,” Reaves said about the skids. “But at the same time, for me, and I (think) I speak for everybody, you want to win every game.”\n\n\r\n              With James Harden watching in street clothes on the Clippers' bench, Kawhi Leonard scored 38 points in their second loss of the young season. Paul George scored 20 of his 35 points in the fourth quarter, including eight points in the final minute, before fouling out 30 seconds into overtime.\n\n\r\n              “We played hard,” Clippers coach Tyronn Lue said. “We just didn’t play smart at times. (Poor) shot selection, and (we needed to) keep our turnovers down a little bit. I can’t fault the effort.”\n\n\r\n              Although the Lakers used just eight players due to five significant injury absences, they rallied from an early 19-point deficit before blowing an eight-point lead in the final 90 seconds of regulation.\n\n\r\n              George, who had six 3-pointers, hit three free throws with 17 seconds left to tie it. Russell had an open shot at the buzzer, but missed.\n\n\r\n              The Lakers took a five-point lead in overtime when Reaves stole the ball from Leonard, drove the court and flung an alley-oop to James for a one-handed slam with 2:12 left.\n\n\r\n              Leonard answered with a three-point play and his fifth 3-pointer, but Reaves hit two free throws with 48 seconds left and Russell Westbrook missed a tying 3-point attempt before Christian Wood threw down a vicious putback dunk for the Lakers with nine seconds to play.\n\n\r\n              Westbrook scored 24 points against his former team.\n\n\r\n              James added 12 rebounds and seven assists in the 38-year-old’s latest standout game of his 21st NBA season. His Lakers have won two straight since losing in overtime at Sacramento on Sunday night.\n\n\r\n              “It’s just been a process this year of us figuring each other out as a group,” Lakers coach Darvin Ham said.\"\n\n\r\n              P.J. Tucker played 21 scoreless minutes in his debut with the Clippers, who officially acquired him and Harden earlier in the day in a multi-player trade with Philadelphia. Harden will ramp up to playing shape during the next four days before the Clippers' next game, but the team is already confident about the 2018 MVP and Los Angeles native's ability to mesh with its three incumbent Southern California-born superstars.\n\n\r\n              “It’s going to take a lot of sacrifice, whether it’s shots, whether it’s minutes,” Lue said. \"They’re willing to do that.”\n\n\r\n              The Lakers' bench was already thin with the injury absences of Jarred Vanderbilt, Rui Hachimura, Gabe Vincent and rookie Jalen Hood-Schifino even before starting forward Taurean Prince developed knee soreness in warmups. Hachimura entered the NBA's concussion protocol after missing Monday's game with an eye injury.\n\n\r\n              Leonard scored a career-high 18 points in the first quarter, hitting seven of his eight shots with four 3-pointers. The Lakers chipped away for the next two quarters and finally reclaimed the lead late in the third.\n\n\r\n              “They dialed in, made sure they got to me, was in the gaps,” Leonard said. “They’re not going to just let somebody keep shooting the ball.”\n\n\r\n              George picked up his fifth foul early in the fourth quarter, but still turned in a spectacular stretch effort.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At New York on Monday.\n\n\r\n              Lakers: At Orlando on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995555.599117
}