{
  "game_id": "0022100846",
  "espn_id": "401360665",
  "date": "Feb 12, 2022",
  "matchup": "CHA vs. MEM",
  "headline": "Grizzlies hold off late rally by Hornets to win 5th straight",
  "body": "CHARLOTTE, N.C. -- — Ja Morant scored 26 points, Desmond Bane added 25 points and four steals, and the Memphis Grizzlies held off the Charlotte Hornets 125-118 on Saturday night for their fifth straight win.\n\n\r\n              Jaren Jackson Jr. had 18 points and 10 rebounds, while Steven Adams added 15 points and 11 boards for the Grizzlies (40-18), who have won eight of their last nine games while scoring at least 120 points in their last five.\n\n\r\n              Terry Rozier had 35 points and 10 rebounds for the Hornets, who trailed by 35 before cutting the lead to four late in the fourth quarter. LaMelo Ball finished with 25 points and newly acquired Montrezl Harrell had 20 for the slumping Hornets, which have lost seven of their last eight games.\n\n\r\n              “I was really proud of the guys. They stayed poised, they stayed calm and they stayed together throughout\" the comeback, said Grizzlies coach Taylor Jenkins. “... You knew (the Hornets) were going to go on a run and you just have to withstand it.\"\n\n\r\n              Charlotte (29-29) had hoped to generate some momentum after beating the Detroit Pistons on Friday night to snap a six-game losing streak.\n\n\r\n              But the Hornets came out flat, missing 15 of 16 shots to start the game as the Grizzlies raced to a 23-4 lead. Memphis extended the lead to 35 late in the second quarter, dominating the Hornets in the paint 72-50. Charlotte is 1-10 on the second night of back-to-backs.\n\n\r\n              The Grizzlies led by more than 20 for most of the game, but the Hornets began to creep back in the game behind Rozier, Harrell and Ball after Adams fouled out with 7:27 remaining.\n\n\r\n              Morant, who came into the game averaging 32.5 points in the Grizzlies’ previous 11 games, scored on back-to-back possessions by dicing through the lane and scoring on layups to push the Memphis lead to 14.\n\n\r\n              But the Hornets kept battling, cutting the lead to four with 2:05 to go after a dunk from seldom-used rookie JT Thor, who provided a spark off the bench.\n\n\r\n              With the crowd roaring, Tyus Jones hit a runner and Bane scored on a runout layup after Ball missed a 3-point attempt and subsequently fell down, pushing the Memphis lead to eight and essentially securing the win.\n\n\r\n              “We are staying together and keeping our composure,” Bane said. “We've been in a lot of close games this year and I feel like that is the difference between our team this year and last year. We have been able to win those close games down the stretch.”\n\n\r\n              Bane said Grizzlies aren't focused on getting to the All-Star break, but rather stacking up wins.\n\n\r\n              \"We're on a mission and we are trying to do special things,\" Bane said.\n\n\r\n              The Hornets were six games above .500 a few weeks ago, but they have struggled with their shooting of late, particularly at home where they have lost six straight. Charlotte missed its first 11 3-point attempts.\n\n\r\n              “I don’t know if it is a road-home thing or whatever. We just have to play better, that is the bottom line,\" Hornets coach James Borrego said. \"We have a number of home games the rest of the way and we have to play better and get off to better starts. That is the goal here and we can protect our home court like we did early in the season and we will get back to that.” \n\n\r\n              MORANT'S SCARE\n\n\r\n              Morant briefly left the game in the third quarter when he appeared to roll his ankle. He left the court to get looked at by trainers in the locker room, but returned to the bench a short while later and played most of the fourth quarter.\n\n\r\n              The All-Star starter was not made available to the media after the game, instead spending time after to catch up with the dozens of family and friends from South Carolina who came to see him play.\n\n\r\n              “It’s a homecoming,\" Jenkins said. \"I know any time we come and play here this is a special game for him, for his family, for so many people in his story that have meant so much to him in his life. That have supported him, that have rooted for him. This is home country around here and so many people come in to support. I know it means a lot to him.”\n\n\r\n              FOUL HEAVY\n\n\r\n              The game included 55 fouls with Adams, Jackson and Charlotte’s Mason Plumlee all fouling out.\n\n\r\n              TIP INS\n\n\r\n              Grizzlies: Memphis never trailed in the game. ... Dillon Brooks (ankle sprain), Killian Tillie (back soreness) and Xavier Tillman (right thigh soreness) did not play.\n\n\r\n              Hornets: Gordon Hayward (ankle sprain), Cody Martin (Achilles soreness) and Jalen McDaniels (ankle sprain) all remained out. ... Harrell received a warm ovation from the crowd in his first home game with his new team.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At New Orleans on Tuesday night.\n\n\r\n              Hornets: At Minnesota on Tuesday night.\n\n\r\n               ------",
  "source": "espn_api",
  "crawled_at": 1764992873.35632
}