{
  "game_id": "0021800646",
  "espn_id": "401071322",
  "date": "Jan 14, 2019",
  "matchup": "MEM @ HOU",
  "headline": "Harden's 57 points lead Rockets over Grizzlies 112-94",
  "body": "HOUSTON --  After scoring a season-high 57 points in Houston's win over the Memphis Grizzlies on Monday night, James Harden was asked how he was able to put Sunday's loss to Orlando, when he went 1 for 17 from 3-point range, behind him so quickly.\n\n\"I went 1 for 17? That's a lot of 3s missed,\" he deadpanned. \"Oh wow!\"\n\nThen the reigning MVP, who scored 38 points against the Magic despite that terrible statistic, got serious when asked if it's easy to forget about such a night.\n\n\"Yeah, because if I make six of them it's on,\" he said. \"It's a 60-point game. So Orlando got lucky last night.\"\n\nHarden extended his streak of 30-point games to 17 by halftime, pouring in a franchise-record 36 points in the first half to send Houston on its way to a 112-94 victory. It's the longest such streak since Wilt Chamberlain had 20 straight games of at least 30 points in 1964.\n\nIt's the franchise-record 14th time Harden has scored 40 this season and the eighth time in his last 11 games. It's the third time he's topped 50 points this season and the 12th time in his career. He surpassed his previous season best of 54 against Washington and fell just shy of the career-high and club-record 60 points he scored last January against Orlando.\n\nHouston teammate Austin Rivers, who joined the Rockets just three weeks ago, marveled at Harden's ability to not let Sunday's struggles spill over into Monday's performance.\n\n\"He comes off a game where he was 1 for 17 and everybody's saying whatever and it just doesn't even faze him. He just comes in tonight like he was 17 for 17,\" Rivers said. \"That's just the mindset that the great ones have. I'm telling you right now, if another player went 1 for 17 they would have come in tonight a little ... messed up. James comes in and that's just why he is who he is and it's impressive.\"\n\nAfter his huge first half, the Grizzlies double-teamed Harden on most every possession in the first few minutes of the third quarter and he didn't score again until there were about five minutes left in the period. That basket was the start of an 11-0 run capped by a 3-pointer from Harden that pushed the Rockets' lead to 76-60 with about 3 1/2 minutes remaining in the third.\n\nA 3-pointer by JaMychal Green got the Grizzlies within 12 later in the third before Harden scored five quick points to make it 87-70.\n\nGarrett Temple and Mike Conley scored 14 each for the Grizzlies, who lost for the eighth time in nine games.\n\nMemphis coach J.B. Bickerstaff, who worked for the Rockets from 2011-16, said his team tried to keep the ball out of Harden's hands, but Houston does such a good job of putting him in different spots on the floor that it's difficult to do effectively.\n\n\"There's so much space, so you have to give them credit and give him credit just for the talent he is and the impact he has on the game,\" Bickerstaff said.\n\nHarden's latest big game came on a night when the Rockets were without three starters, as center Clint Capela joined Chris Paul and Eric Gordon on the injured list after he hurt his right thumb Sunday night. It's possible Capela could miss significant time, but coach Mike D'Antoni said the team won't know how long he'll be out until he gets a second opinion later this week.\n\nHarden made his first two 3s on Monday night to quickly outdo his 3-point shooting from Sunday and finished 6 of 15. It's the 13th time in the last 14 games that he's drained at least five 3s after his NBA-record streak of 12 straight ended with his cold shooting performance against the Magic.\n\nHarden made 15 of 17 free throws and had nine rebounds, two assists and two steals.\n\nHe crashed to the court making a 3 as he was fouled by Green to give him 52 points with just under five minutes remaining. Harden completed the four-point play to make it 103-85.\n\nHarden went to the bench to a standing ovation with 3:35 left and Houston ahead 107-85.\n\nTIP-INS\n\nGrizzlies: Kyle Anderson missed the game after spraining his left ankle Saturday. ... Jaren Jackson Jr. had 12 points.\n\nRockets: Paul missed his 12th game in a row with a strained left hamstring. ... Gordon missed his eighth straight game with a bruised right knee. ... Danuel House had 15 points and Rivers scored 11. ... Nene started in place of Capela.\n\nTHEY SAID IT\n\nHarden on if having the most consecutive 30-point games since Chamberlain means anything to him: \"No. The win was important.\"\n\nMR. 600\n\nThe win was the 600th of D'Antoni's career. The 67-year-old coach had 14 wins in one season in Denver, 253 in five years in Phoenix, 121 in four seasons with the Knicks, 67 in two years with the Lakers and got his 145th victory with Houston in his third season.\n\n\"I appreciate these guys and everybody before them,\" D'Antoni said. \"But it just means you've coached some good guys, and you're able to avoid getting fired too many times.\"\n\nUP NEXT\n\nGrizzlies: Host the Milwaukee Bucks on Wednesday night.\n\nRockets: Host the Brooklyn Nets on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994924.28163
}