{
  "game_id": "401809952",
  "espn_id": "401809952",
  "date": "Oct 24, 2025",
  "matchup": "POR vs GS",
  "headline": "Avdija scores 26 points as Trail Blazers beat Warriors 139-119 in Splitter's debut as interim coach",
  "body": "PORTLAND, Ore. -- — Deni Avdija had 26 points and six assists, and the Portland Trail Blazers beat the Golden State Warriors 139-119 on Friday night in Tiago Splitter’s first game as interim head coach.\n\n\r\n              Splitter is stepping in after coach Chauncey Billups was arrested by the FBI early Thursday and arraigned in federal court later that day.\n\n\r\n              Splitter told reporters before the game he wanted to keep his team focused on basketball.\n\n\r\n              Jerami Grant scored 22 points, Toumani Camara had 19, and Shaedon Sharpe added 17. Donovan Clingan had 14 points, Kris Murray scored 13, Jrue Holiday added 12 points and 11 assists, and Matisse Thybulle had 10 points.\n\n\r\n              Stephen Curry scored 35 points for the Warriors, Jonathan Kuminga had 16 points, Jimmy Butler 14 and Draymond Green 12.\n\n\r\n              Both teams shot well from the 3-point line with Portland making 47% (16 for 34) and Golden State 42% (16 for 38). However, the Trail Blazers outscored the Warriors 66-30 in the paint.\n\n\r\n              The Warriors started the game on a 12-4 run but Portland rallied to it at 17. A personal 8-0 run by Curry put the Warriors up 25-17. Portland rallied to tie the score at 28 by the end of the first quarter.\n\n\r\n              Portland continued their strong play in the second. Avdija scored 20 points in the first half while Grant pitched in 17. Portland outscored Golden State 41-28 in the second quarter to take a 13-point lead into halftime.\n\n\r\n              With 7:50 left in the third quarter, Curry converted a four-point play to cut Portland's lead to 81-72 but the Warriors held on and led by as many as 25.\n\n\r\n              Golden State pulled Curry from the game with 9:35 left and trailing 115-97.\n\n\r\n              Up next\r\n              Golden State hosts Memphis on Monday night. \n\n\r\n              Portland visits the Los Angeles Clippers on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042496.219481
}