{
  "game_id": "0022000993",
  "espn_id": "401307796",
  "date": "May 05, 2021",
  "matchup": "IND vs. SAC",
  "headline": "Bagley's fast start helps Kings race past Pacers 104-93",
  "body": "INDIANAPOLIS -- — Marvin Bagley III kept Sacramento's slim playoff hopes alive Wednesday night with a breakthrough performance — scoring a season-high 31 points and grabbing 12 rebounds to lead the the Kings past the Indiana Pacers 104-93.\n\n\r\n                    It has been a long time coming for the No. 2 overall draft pick in 2018, but Bagley started fast, finished strong and appears to be finding his groove, finally.\n\n\r\n                    “This is two of the last three games where he’s put up big-time performances,” coach Luke Walton said. “I was happy for him, happy for his teammates. But that’s part of the fun of the sport. He was really good tonight.”\n\n\r\n                    Bagley had some help, too. Delon Wright added 23 points as Sacramento won its fourth straight — all on the road — and swept the two-game series with the Pacers for the first time in five years. The Kings started the day 3 1/2 games behind San Antonio in the chase for the West's final play-in spot.\n\n\r\n                    Indiana was led by Domantas Sabonis, who fell just short of his eighth triple-double this season with 17 points, 13 rebounds and eight assists. The Pacers were trying to become the first team since Phoenix in 2009 to top the 140-point mark in three consecutive games.\n\n\r\n                    But after missing 85 games over the past two seasons, Bagley finally delivered with 24 points, eight rebounds and going 12 of 17 from the field in the first half as Sacramento pulled out to a 56-47 lead.\n\n\r\n                    “I think he just got to his spots early,\" Pacers coach Nate Bjorkgren said. “It was his physicality around the rim and he got to the spots he wanted to. We've got to do a better job of preventing that.\" \n\n\r\n                    Bagley's teammates took care of the rest.\n\n\r\n                    Buddy Hield and Richaun Holmes spurred an early second-half scoring flurry that put the Kinds in complete control midway through the third quarter with a 76-56 lead.\n\n\r\n                    Indiana never recovered.\n\n\r\n                    “He’s such a dynamic athlete, we want him out there flying and rolling and getting out in transition,\" Walton said, referring to Bagley. “Just getting him out there like that tonight, I thought was great.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Wright also had seven rebounds, six assists and six steals. ... Hield finished with 16 points, nine rebounds and eight assists. He also made four 3-pointers, giving him 260 this season. ... Holmes added 12 points. ... Terence Davis II had 10 points and six rebounds off the bench. ... Sacramento has won six of its last eight.\n\n\r\n                    Pacers: Caris LeVert scored 14 points and T.J. McConnell had 11 points, seven assists and three steals. ... Indiana committed 21 turnovers. ... The Pacers are 11-20 at home this season and had allowed 109 or more points in 17 of their previous 18 games. ... Indiana already has broken the franchise's single-season record for 3-pointers and made nine more Wednesday to give it 788. ... The Pacers are 0-8 when scoring fewer than 100 points.\n\n\r\n                    BJORKGREN RESPONDS\n\n\r\n                    One day after ESPN reported coach Nate Bjorkgren faces an uncertain future with Indiana, the new coach blamed himself for any communication problems with players and those in the organization. \n\n\r\n                    “You know I don’t make excuses for things,\" he told reporters before the game. “I’m a young coach. I’m learning, I’m growing and I’m trying to be better. This is on me. I’m the head coach and fingers should be pointed at me. I love coaching this team and the relationships with these coaches and players, I've just got to keep getting better.\"\n\n\r\n                    MISSING OUT\n\n\r\n                    Both teams played severely short-handed. Sacramento won despite being without De’Aron Fox (health and safety protocols), Tyrese Haliburton (left knee), Robert Woodard II (lower back), Harrison Barnes (left shoulder) or Chimezie Metu (lower back). Indiana was missing Myles Turner and T.J. Warren, who have foot injuries, Jeremy Lamb and Edmond Sumner with left knee injuries, Malcolm Brogdon with a sore right hamstring and JaKarr Sampson, who has a concussion.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Host San Antonio on Thursday, following a four-game road trip.\n\n\r\n                    Pacers: Will try to win its seventh straight home game against Atlanta on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997120.8310988
}