{
  "game_id": "0022100294",
  "espn_id": "401360118",
  "date": "Nov 27, 2021",
  "matchup": "BKN vs. PHX",
  "headline": "Suns extend win streak to 16 with 113-107 victory over Nets",
  "body": "NEW YORK -- — A chance to match franchise history and take a spot atop the NBA is waiting for the Phoenix Suns.\n\n\r\n                    They have loftier aspirations than those, but want them anyway.\n\n\r\n                    “Obviously, everybody knows the ultimate goal is to win a championship,” Chris Paul said. “But if you don’t enjoy the small victories throughout the regular season, then what the hell are you doing?”\n\n\r\n                    Devin Booker scored 30 points, Paul had 22 and the Suns extended their winning streak to 16 games with a 113-107 victory over the Brooklyn Nets on Saturday night.\n\n\r\n                    Phoenix impressively overwhelmed the Eastern Conference leaders early, never trailing and leading by as much as 22 while moving within a victory of matching the longest winning streak in franchise history.\n\n\r\n                    The Suns will try to do that Tuesday night at home against the Golden State Warriors (17-2) in a matchup of the top two teams in the NBA. \n\n\r\n                    “I’m looking forward to it, man,” Booker said. “Obviously not a make it or break-it game, not a playoff game, but we know it’s going to be high-energy, two best records in the NBA. It’s going to a high-intensity, fun game.” \n\n\r\n                    Phoenix improved to 17-3, its best record through 20 games since having the same mark in 2004-05. The Western Conference champions haven't lost in a month since Sacramento dropped them to 1-3. \n\n\r\n                    Paul added eight rebounds and five assists, becoming the first player in NBA history to reach 20,000 points, 10,000 assists and 5,000 rebounds. \n\n\r\n                    Mikal Bridges had 13 points and a career-high seven steals for the Suns. They won 17 straight games during the 2006-07 season, and also won 15 in a row earlier that season. \n\n\r\n                    Kevin Durant had 39 points, nine rebounds and seven assists for the Nets. They had their four-game winning streak snapped. \n\n\r\n                    “For us, handing the ball off in the first half the way we did, you’re not going to beat a good team like that,” Durant said.\n\n\r\n                    James Harden carved out a sloppy triple-double in the Nets' first game since Thanksgiving, with 14 assists, 13 rebounds and 12 points. But he shot 4 for 15 from the field, missing all six 3-pointers and committed seven turnovers. He was booed when he lost a ball out of bounds off his foot in the second half. \n\n\r\n                    Playing for the second straight night to end a four-game road trip, Booker was in double figures before Durant even scored and Phoenix shot out to a 21-8 lead. The Suns led comfortably until the middle of the second quarter, when Paul’s 3-pointer made it 51-31.\n\n\r\n                    The Nets suddenly broke through with a 15-0 run, cutting it to 51-46 on DeAndre Bembry's steal and layup. Paul settled the Suns with the next five points, beating the halftime buzzer to make it 56-46.\n\n\r\n                    Booker took only one shot in a scoreless second quarter but came back with 10 points in the third. He went to the bench with a fourth foul but Paul and Cameron Payne hit consecutive 3s late in the period to push the lead back to 20 and it was 90-72 after three.\n\n\r\n                    The Nets put together a late push that allowed them to make the final score respectable on a night they had 20 turnovers, leading to 20 points. \n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Booker had his third straight game with 30 or more points. ... Phoenix is 9-1 on the road. ... JaVale McGee had 10 points and 10 rebounds. \n\n\r\n                    Nets: Bembry had 18 points and nine rebounds. LaMarcus Aldridge also scored 18 points. .... The Nets had won the last three meetings. They were the only team to sweep Phoenix last season.\n\n\r\n                    SUNS' SURGE\n\n\r\n                    Nets coach Steve Nash played for the Suns during the 2006-07 season and said there are a few things that go into a month-long winning streak.\n\n\r\n                    “I think, one, you have to be a really good team. Like, you can’t just get hot for 15 games,” Nash said. “You’ve got to be a really high-quality team, great balance, a team that has an identity and clarity on the floor. And this team’s got great balance and depth and options, and is very well-coached.” \n\n\r\n                    LOVE-HATE RELATIONSHIP\n\n\r\n                    Suns coach Monty Williams worked with and against Nets guard Patty Mills when he was in the Western Conference and said whether he liked the Australian's energy depended on which side he was on. \n\n\r\n                    “Like, if you’re on the other side, you want to break his neck. But if you’re with him, you’re like, ‘Man, I love that guy,’” Williams said. “When I used to compete against the Spurs and he was down there waving that towel, I just wanted to go, like, tackle him.” \n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Host Golden State on Tuesday night.\n\n\r\n                    Nets: Host New York on Tuesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764993353.47938
}