{
  "game_id": "0021800282",
  "espn_id": "401070963",
  "date": "Nov 24, 2018",
  "matchup": "OKC vs. DEN",
  "headline": "Murray leads Nuggets past Thunder, 105-98",
  "body": "OKLAHOMA CITY --  The Denver Nuggets overcame significant odds to pull out a win over the Oklahoma City Thunder on Saturday.\n\nTheir second-leading scorer, Gary Harris, was out with a sore left ankle. It was their third game in four nights and the Thunder entered the game tied for the best record in the Western Conference.\n\nDespite all that, Jamal Murray had 22 points, eight rebounds and eight assists to lead the Nuggets to a 105-98 win.\n\nDenver coach Michael Malone was proud of his team.\n\n\"I said, `We don't make excuses, we find ways,' and I thought our guys did that,\" he said. \"Heck of a win.\"\n\nRussell Westbrook had 16 points, 12 assists and 10 rebounds for his second triple-double of the season and the 106th of his career. But he shot just 6 of 23 and missed all six of his shots in the fourth quarter.\n\nMalone said Torrey Craig defended Westbrook well.\n\n\"I thought Torrey did a heck of a job of keeping Westbrook in front of him for most of the night,\" Malone said. \"No one can guard him by themselves, and we gave necessary help when appropriate. Guys were just locked in.\"\n\nPaul George had 24 points and 11 rebounds, and Dennis Schroder added 18 points for the Thunder.\n\nDenver held Oklahoma City to 35.9 percent shooting.\n\nNikola Jokic and Trey Lyles each scored 16 points and Juancho Hernangomez added 15 for the Nuggets.\n\nDenver's largest lead was 25 points in the second quarter. The Nuggets shot 50 percent in the first half to lead 63-42 at the break.\n\n\"I thought their physicality and their presence at the basket certainly overwhelmed us a little bit,\" Thunder coach Billy Donovan said. \"When I say overwhelmed us, they were the aggressor. They were making an impact.\"\n\nOklahoma City missed 18 of its first 20 3-point shots, but the Thunder got it going late in the third quarter and trimmed the deficit to 79-66 by the end of the period.\n\nGeorge hit a 3 to cut the deficit to 80-71 early in the fourth, and Denver called a timeout. A 3-pointer by Oklahoma City's Jerami Grant trimmed Denver's lead to 96-90 with just over three minutes to play. A key follow shot by Craig put Denver up 101-94 with just over a minute remaining.\n\n\"We didn't panic,\" Lyles said. \"We didn't get loose with the ball tonight. We took care of it. We knew where we were supposed to be on the floor offensively and defensively. Guys knocked down shots.\"\n\nDonovan said his team used the right approach to get back into the game.\n\n\"You've also got to understand that you've got to keep hitting singles,\" Donovan said. \"I thought for a while there midway through that third quarter we were just kind of hitting singles and chipping our way, chipping our way, and we got it down to five, and we had our chances and our opportunities.\"\n\nTIP-INS\n\nNuggets: F Paul Millsap went down with a leg injury in the first quarter and limped off the court, but he returned. ... Lyles went 6 for 6 from the field and 2 for 2 from the free-throw line.\n\nThunder: G Timothe Luwawu-Cabarrot got his first start of the season. ... G Hamidou Diallo sat out after spraining his left ankle Friday against Charlotte. ... G Alex Abrines was called for a technical in the second quarter. George got one in the fourth.\n\nQUOTABLE\n\nMalone on Denver's defensive effort: \"They know that when we defend at this level, we can not only beat anybody, but we can win anywhere,\" Malone said.\n\nSTAT LINES\n\nWestbrook made 1 of 12 3-pointers. The Thunder are 1-4 when Westbrook takes five or more 3-pointers and 6-0 when he takes four or fewer.\n\nUP NEXT\n\nNuggets: Host the Los Angeles Lakers on Tuesday.\n\nThunder: Host the Cleveland Cavaliers on Wednesday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994622.1845078
}