{
  "game_id": "0021800447",
  "espn_id": "401071128",
  "date": "Dec 17, 2018",
  "matchup": "OKC vs. CHI",
  "headline": "George, Westbrook lead Thunder past Bulls 121-96",
  "body": "OKLAHOMA CITY --  Paul George's performance late in the first half was all the Oklahoma City Thunder needed against Chicago Bulls.\n\nGeorge scored 16 of his game-high 24 points in the final five minutes of the first half and the Thunder rolled to a 121-96 victory over the Bulls on Monday night in a chippy game in which both teams were assessed technical fouls following a second-quarter fracas.\n\n\"I did my work early,\" George said.\n\nGeorge's scoring outburst came in the final 4:47 of the second quarter as Oklahoma City outscored the Bulls 23-7 and built a 64-44 lead by the break. Outside of that nearly five-minute stretch, he shot 2 of 13 from the floor and scored just one point in the second half.\n\n\"I thought he was unbelievable tonight and he had an incredible first half,\" Thunder coach Billy Donovan said of George.\n\nThe Bulls changed their defensive strategy against George after halftime, leading to fewer opportunities.\n\nDonovan said he was as impressed with George's performance outside of his big scoring stretch as he was with the stint to end the half.\n\n\"Here he goes crazy on that run in the first half . they elect to trap him in the second half. What does he do? He just facilitates. He gets other guys involved,\" Donovan said. \"It speaks to his greatness. He could have had a bigger scoring night, but I thought his playmaking, his facilitating and reading the game was really positive for us.\"\n\nRussell Westbrook had 13 points, 16 rebounds and 11 steals for his 111th career triple-double. Steven Adams added 19 points and Dennis Schroder scored 18 for the Thunder.\n\nLauri Markkanen and Bobby Portis had 16 points apiece to lead Chicago. Markkanen adding 15 rebounds.\n\nWestbrook secured the triple-double by threading a pass in the lane to a driving Hamidou Diallo, who finished with a reverse layup as he was knocked to the court and fouled with just over six minutes remaining.\n\n\"Russell's been great,\" Donovan said. \"It speaks to his greatness as a player that he can see what the team needs and from there, facilitate, so to speak. He's generating shots for Paul (George), he's generating shots for Steven (Adams). When he and Dennis (Schroder) are out there, they're both creating.\"\n\nThe Thunder sped into the lead with a 21-3 run that erased a 15-10 deficit. But the Bulls quickly reeled off a 19-8 run of their own and closed the gap to two points.\n\nFrom there, the Thunder took control, building a comfortable lead thanks to George's 6-for-6 shooting to close to the half.\n\nThe game was halted for several minutes with 4:27 left in the second quarter after a melee broke out near the Thunder bench when Chicago's Cameron Payne fouled Terrance Ferguson and, nearly simultaneously, Westbrook and Kris Dunn exchanged pushes.\n\nThe confrontation ended when Bulls coach Jim Boylen pulled Thunder forward Jerami Grant out of the scuffle by his neck.\n\n\"I don't know what really happened to be honest,\" Dunn said. \"Things just got out of hand.\"\n\nWhen it was all said and done -- after a several-minute delay for review -- Westbrook, Grant, Dunn and Chicago's Robin Lopez were assessed technical fouls.\n\nLopez wound up in the front row between the bench and the scorer's table as several people restrained him.\n\n\"I was just trying to stand up for (Dunn),\" he said. \"I saw somebody fly in out of the corner of my eye from the other side of the floor. I was just trying to stand up for my point guard right there.\n\n\"I felt kind of like I got twisted or flipped a little bit. Somehow, I ended up on that bench there. And then, I don't know. After that, something happened.\"\n\nLopez was ejected less than three minutes later after he picked up another technical foul.\n\nBoylen downplayed the scuffle after the game -- except as it pertained to the fight he saw from his team.\n\n\"That's all we've been talking about is fighting for each other and we talk about being a pack of wolves,\" Boylen said. \"I thought we had some of that. I liked the look in our guys' eyes when that happened. It bonded them a little bit.\"\n\nBut Boylen said his interactions with Grant weren't serious, saying that he was just trying to break up the altercation.\n\n\"It's really not that big a deal,\" Boylen said. \"Those things used to happen all the time, now they happen and it's a major deal.\n\n\"It's not that big a deal. Everybody moved on.\"\n\nGrant said he wasn't concerned about the opposing coach pulling him out of the fray.\n\n\"He's trying to protect his team,\" Grant said.\n\nTIP-INS\n\nBulls: Lauri Markkanen had 16 points and 15 rebounds, his first career 15/15 game. ... Jabari Parker, who didn't play in Saturday's win over San Antonio after falling out of the rotation, missed the game with a stomach illness. . The Bulls turned the ball over 11 times in the first half. . Robin Lopez's ejection with two third-quarter technicals was the ninth of his career and the first of this season.\n\nThunder: Paul George's second quarter gave him double-figure scoring in one quarter for the eighth time in seven games. . The Thunder shot 4 of 6 from behind the 3-point arc in the second quarter and outscored Chicago 33-22. . Russell Westbrook and George are Nos. 1 and 2 in the league in steals per game. Westbrook had five Monday, while George added three.\n\nTHUNDER PICK UP DONOVAN'S OPTION\n\nBefore the game, the Thunder exercised its fifth-year option on the contract of head coach Billy Donovan.\n\nDonovan is in his fourth season with Oklahoma City, going 169-106, with playoff appearances in his first three seasons.\n\n\"I'm grateful, appreciative and thankful for Mr. (Clay) Bennett and Sam (Presti),\" Donovan said before the game, referencing the Thunder's chairman and general manager. \"I get a chance to coach a great group of guys. I've had incredible support from Sam and the people inside the organization.\"\n\nUP NEXT\n\nBulls: Home against Brooklyn on Wednesday.\n\nThunder: At Sacramento on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994606.1525471
}