{
  "game_id": "401809821",
  "espn_id": "401809821",
  "date": "Nov 28, 2025",
  "matchup": "LAC vs MEM",
  "headline": "Grizzlies eliminated from NBA Cup despite riding strong second half to 112-107 win over Clippers",
  "body": "INGLEWOOD, Calif. -- — Jaren Jackson Jr. scored 16 of his 24 points in the second half and the Memphis Grizzlies rallied for a 112-107 win over the Los Angeles Clippers in the last game of NBA Cup play for both teams on Friday night.\n\n\r\n              The Grizzlies, who outscored the Clippers by eight in the fourth quarter to get their fourth win in five games, went 3-1 in West Group B failed to secure a wild card into the knockout round because the Phoenix Suns had a better point differential.\n\n\r\n              Vincent Williams Jr. scored 16 points and Santi Aldama added 13 off the bench for the Grizzlies, who have a three-game road winning streak after dropping their previous five away from home. Zach Edey had 21 rebounds and five points.\n\n\r\n              Kawhi Leonard scored 39 points in 29 minutes for the Clippers, who have lost six straight at home, with their last victory at Intuit Dome coming on Oct. 31. James Harden had 23 points.\n\n\r\n              Memphis struggled to get its offense going in the first half, relying on long-distance shooting from Kentavious Caldwell-Pope to provide some pop. They found a groove in the third quarter, rallying from a 16-point deficit to get within 81-78 to close the period, and it carried through as Cedric Coward gave the Grizzlies their first lead early in the fourth.\n\n\r\n              The Clippers started off strong by making hit three 3-pointers to open the game and going 6 of 9 from long range in the first quarter, but they finished 12 of 38 (31.6%).\n\n\r\n              Clippers point guard Chris Paul received a video tribute in his first home game since announcing he would retire at the end of the season. Paul finished with five points and two rebounds in 15 minutes.\n\n\r\n              Up next\r\n              Grizzlies: At Sacramento on Sunday.\n\n\r\n              Clippers: Host Dallas on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042713.4284449
}