{
  "game_id": "0022000490",
  "espn_id": "401267650",
  "date": "Feb 24, 2021",
  "matchup": "ATL vs. BOS",
  "headline": "Gallinari hits Atlanta-record 10 3s, Hawks rout Celtics",
  "body": "ATLANTA -- — Danilo Gallinari set a Hawks franchise record with 10 3-pointers in a 38-point spree that carried Atlanta to a 127-112 rout of the Boston Celtics on Wednesday night.\n\n\r\n                    \r\n                      Gallinari broke the mark of nine 3-pointers by Steve Smith in a 1997 game against Seattle. The Hawks also eclipsed the overall team record by going 23 of 42.\n\n\r\n                    \r\n                      Trae Young played like an All-Star, adding 33 points as the Hawks built a 27-point lead in the first half and were never threatened by the lackluster Celtics, who have lost three in a row.\n\n\r\n                    Gallinari, one of the biggest free agents signed by the Hawks in an offseason spending spree, equaled the best scoring half of his career with 24 points over the first two quarters. He finished 10 of 12 from 3-point range and 13 of 16 overall.\n\n\r\n                    “It's always great to make history,\" he said. “I'm very happy for that. Of course, when you set these kind of records and win the game, it feels way better.”\n\n\r\n                    \r\n                      Gallinari knocked down jumpers from just about anywhere on the court — most notably swishing a 3 from at the edge of the special MLK Day half-court logo that was used on a night honoring historically black colleges and universities. \n\n\r\n                    “The dude was on fire,\" teammate John Collins said. “He could not miss. The entire team loves it when when they see a guy on fire like that. We're going to keep giving it to him until he burns out.”\n\n\r\n                    The Hawks led 72-49 at halftime and maintained a comfortable margin the rest of the way.\n\n\r\n                    Gallinari turned in his best performance since joining the Hawks. His previous high was 20 points against Indiana on Feb. 13.\n\n\r\n                    It was much-needed rebound for Young and the Hawks, who lost 112-111 at Cleveland the previous night on a last-second shot — just hours after Atlanta’s star guard learned he had been passed over for a spot in the March 7 All-Star Game to be held on his home court.\n\n\r\n                    Young, an All-Star starter in 2020, ripped through the Celtics for 25 points in the first half. He is averaging 27.2 points a game, the most by any player passed over for the midseason showcase.\n\n\r\n                    Jaylen Brown led the Celtics with 17 points but missed all six of his attempts from 3-point range.\n\n\r\n                    Jayson Tatum was held to 13 points on 4-of-20 shooting. He made just 1 of 8 from long range.\n\n\r\n                    “It got away from us early,” Tatum said. “They played well and made a bunch of shots. But we didn’t come with it today.\"\n\n\r\n                    NICE PASS\n\n\r\n                    The Hawks were having so much fun that Young doled out an assist to himself.\n\n\r\n                    \r\n                      On an inbounds pass from the baseline, Young threw the ball off the back of Boston's Grant Williams, caught the deflection and went in for an uncontested layup.\n\n\r\n                    SLUMPING CELTICS\n\n\r\n                    Boston has lost eight of its last 11 games to drop two games below .500 (15-17) for the first time this season.\n\n\r\n                    Coming off two tough defeats — an overtime setback at New Orleans and a three-point loss at Dallas — the Celtics totally fell apart against the Hawks.\n\n\r\n                    With four games left until the All-Star break, Tatum said the team feels a sense of urgency.\n\n\r\n                    “These are four very important games,\" he said. \"We've got to dig deep and figure it out.”\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: G Kemba Walker didn't dress in the second game of a back-to-back to help manage his comeback from a left knee injury. ... Boston briefly showed signs of life when the Hawks missed their first six shots of the third quarter. The Celtics closed to 73-56, but the Hawks snuffed out the rally with back-to-back 3s by Tony Snell and Collins.\n\n\r\n                    Hawks: Collins, who played only 13 minutes against the Cavaliers before leaving with a possible concussion, was cleared to play after undergoing an evaluation shortly before tipoff. He had 14 points and 11 rebounds in 25 minutes. ... F Cam Reddish missed his second straight game with a sore right Achilles. ... In addition to breaking out the special court for HBCU Night, the Hawks also wore their black uniforms with “MLK” across the front of the jersey. \n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Return home Friday night to host the Indiana Pacers.\n\n\r\n                    Hawks: Travel to Oklahoma City on Friday night to face the Thunder.\n\n\r\n                    ------\n\n\r\n                    Follow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 His work can be found at https://apnews.com/search/paulnewberry\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997831.415122
}