{
  "game_id": "0021500391",
  "espn_id": "400828278",
  "date": "Dec 18, 2015",
  "matchup": "CHI vs. DET",
  "headline": "Pistons prevail in 4OT as Jimmy Butler's desperation 3 fails to fall",
  "body": "CHICAGO -- Andre Drummond didn't have to say much to describe this four-overtime marathon. He could have stopped after the first word.\n\"Wow,\" he said. \"I don't have any words for that one.\"\nWow pretty much sums it up.\nDrummond had 33 points and 21 rebounds, Reggie Jackson added 31 points and 13 assists, and the Pistons outlasted the Chicago Bulls 147-144 on Friday night.\n\nThe Pistons scored the first seven points of the fourth OT and hung on after things got real tense in the final seconds.\nJimmy Butler, who scored a career-high 43 points, made an off-balance 3-pointer to cut it to 145-144 with 4.7 seconds left.\nThe Bulls immediately fouled Jackson, who made both free throws to make it a three-point game.\nButler then missed a 3 as time expired, bringing a wild game to a finish.\nDerrick Rose scored a season-best 34 on a career-high 34 field goal attempts for Chicago. Pau Gasol added 30 points, 15 rebounds and five blocks, but the Bulls couldn't pull this one out after tying a season high with four straight wins.\n\"We're expected to win,\" Butler said. \"Four overtimes, no overtimes. We didn't do that. Didn't protect our home floor.\"\nIn a back-and-forth game that saw both teams miss chances to win, the Pistons finally went ahead for good with that surge to start the fourth OT.\nDrummond started it with a follow dunk. Jackson then drove for a layup and converted a three-point play after getting fouled on a floater to make it 134-127 with 3:37 left, and the Pistons maintained the lead the rest of the way.\n\"You fight hard, you put everything you have on the court, and to lose like this in four overtimes at home, it's a heartbreaker,\" Gasol said. \"It happens.\"\nThis was the 13th game in league history to go to at least four overtimes.\nChicago's only other four-OT game was a win at Portland on March 16, 1984. There was no record of the Pistons playing a four-overtime game in Detroit's media guide.\nWas it fun?\n\"Maybe for you guys,\" Pistons coach Stan Van Gundy said. \"I think for Fred (Bulls coach Fred Hoiberg) and I it was excruciating. But maybe for you guys it was fun. It was an epic game.\"\nFun, excruciating and epic all seem appropriate here.\nDrummond -- who had five fouls in regulation but didn't pick up his sixth until the fourth OT -- laughed when asked how tired he was.\n\"I'm more happy than tired right now, but I'm sure when I get on the plane, you probably won't hear a word out of me,\" he said.\nMISSED CHANCES\nThe game went to overtime after Rose missed a pull-up jumper over Jackson. And it went to a second OT after Jackson's floater from the elbow with Rose all over him hit the rim.\nThe Bulls appeared to be in good shape in the second OT when Butler nailed a fadeaway jumper to make it 123-120 with just less than a minute remaining. But Kentavious Caldwell-Pope buried a 3 in front of the Chicago bench to tie it with 36 seconds left.\nButler had a drive along the right side blocked by Morris and missed after grabbing the loose ball. Jackson then missed a shot for Detroit, sending it to a third OT.\nThe game went to a fourth OT tied at 127-all after Gasol missed a corner 3 and Jackson missed a 21-footer after racing the other way.\nTIP-INS\nPistons: Drummond has grabbed at least 20 rebounds in five of his past seven games against Chicago. ... Van Gundy said F Aron Baynes sat out because of back spasms.\nBulls: Hoiberg is \"optimistic\" F Mike Dunleavy Jr. will play this season. He also understands skepticism that the veteran sharpshooter will suit up. \"It's fair to question that, talk about it,\" Hoiberg said. Dunleavy is away from the team working with a specialist as he recovers from a back injury. He was expected to be out eight to 10 weeks after having surgery in late September.\nUP NEXT\nPistons: Visit Miami on Tuesday.\nBulls: Visit New York on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764993952.45269
}