{
  "game_id": "0021601062",
  "espn_id": "400900457",
  "date": "Mar 22, 2017",
  "matchup": "OKC vs. PHI",
  "headline": "Westbrook posts 35th triple-double; Thunder roll past 76ers",
  "body": "OKLAHOMA CITY -- Add another first for Russell Westbrook -- a triple-double without missing a shot.\nWestbrook recorded his 35th triple-double of the season with 18 points, 11 rebounds and 14 assists and the Oklahoma City Thunder cruised to a 122-97 win over the Philadelphia 76ers on Wednesday night.\nHe did so while making all six of his field-goal attempts and all six of his free throws. According to the Elias Sports Bureau, no NBA player previously has had a triple-double without missing a shot attempt or free throw.\n\"It's amazing, especially for a point guard, because he's shooting threes, twos, inside, outside,\" said Oklahoma City center Enes Kanter of his teammate's perfect shooting. \"For a point guard, he's doing an unbelievable job, playing his game, having fun.\"\nWestbrook's perfect shooting night could partially be attributed to a conscious decision to not shoot a 3-pointer in a game for the first time since March 14, 2016. He said he wasn't aware during the game that he hadn't missed a shot.\n\"I was just trying to play, trying to take my time,\" Westbrook said. \"I've been watching some film, trying to pick my spots better. I found ways to continue to get my teammates involved throughout the game and it just happened that way.\nThe Thunder have won 16 straight games against Philadelphia, a run that stretches to the 2008-09 season, the franchise's first in Oklahoma City. That dominance was perhaps most evident in the final rebounding numbers on Wednesday: Oklahoma City 54, Philadelphia 25.\n\"It's a fantastic example for our young guys on the physicality of playoff-type teams,\" Philadelphia coach Brett Brown said. \"That side of it to me stood out more than it has in a long time. ... You look at the discrepancy on the boards, the rebounding differential, and it felt that.\n\"It's a reminder. If you want to play late in April, if you want to play in May, maybe June one day, that's the physicality that the playoffs bring.\"\nNik Stauskas led the 76ers with 20 points, reaching the 20-point mark in consecutive games for the first time in his career.\nAfter 11 lead changes in the opening minutes, the Thunder seized control with a 14-3 run near the end of the first quarter that put them ahead 29-22. Oklahoma City pushed its lead to 14 at one point before settling for a 63-50 halftime lead.\nPhiladelphia scored to start the third quarter, then the Thunder scored the next 15 points to build a 26-point lead and the triple-double watch intensified. Westbrook's 10th assist came when Taj Gibson rattled in a 15-foot jumper at the 9:10 mark and the 10th rebound came with 7:08 left in the quarter.\nIt was the 13th time this season, and the 27th time in his career, Westbrook clinched a triple-double in the third quarter. He left the game with 2:39 left in the quarter and didn't return.\nWestbrook has recorded five triple-doubles against Philadelphia, his highest total against any NBA team. He needs six triple-doubles in Oklahoma City's final 11 games to tie Oscar Robertson's single-season record, set during the 1961-62 season.\nKanter posted his 17th double-double of the season for the Thunder with 24 points and 11 rebounds. Victor Oladipo (18 points) and Doug McDermott (13 points) also reached double figures for the Thunder.\nTIP-INS:\n76ers: Jahlil Okafor, who missed Monday's game at Orlando with right knee soreness, started against the Thunder and played 17 minutes, scoring six points. ... Dario Saric scored 12 points, extending his double-figure scoring streak to 21 games, the longest by a rookie this season. ... Stauskas matched his season high with five 3-pointers, going 5-of-5 from behind the arc in the first half.\nThunder: With its 41st win of the season, Oklahoma City is assured of a .500 or better record for the eighth straight season. Only two other teams, the Houston Rockets and San Antonio Spurs, have as long a streak. ... Westbrook has 72 triple-doubles and needs six more to tie Wilt Chamberlain for fourth on the NBA all-time list.\nSURGERY FOR EMBIID\nThe 76ers said before the game that rookie center Joel Embiid will undergo surgery on a torn meniscus in his left knee. Team spokesman Mike Preston said the 7-footer, who has been plagued with injuries during his professional career, will have the surgery \"in the coming days.\"\nBrown said \"there has been tremendous due diligence ... and research\" about the decision concerning surgery and that Embiid \"took an active role\" in making the decision. Brown wouldn't say if he thought Embiid would return by the start of next season: \"That's stuff we will talk more about and learn more about.\"\nEmbiid missed his first two NBA seasons with a foot injury. He played in 31 games this season, averaging 20.2 points and 7.8 rebounds per game but hasn't played since Jan. 27, when he scored 32 points in a loss to the Houston Rockets.\nQUOTABLE:\nPhiladelphia guard T.J. McConnell on guarding Westbrook: \"It's not a one-person job. It's an entire team.\"\nUP NEXT:\n76ers: Will continue a five-game road swing at Chicago on Friday.\nThunder: Will have a three-day break before a road back-to-back at Houston on Sunday and Dallas on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995252.57136
}