{
  "game_id": "0022401219",
  "espn_id": "401736813",
  "date": "Dec 15, 2024",
  "matchup": "POR @ PHX",
  "headline": "Suns send Trail Blazers to 6th straight loss with 116-109 victory",
  "body": "PHOENIX -- — Devin Booker scored 28 points and the Phoenix Suns beat Portland 116-109 on Sunday night to extend the Trail Blazers' losing streak to six games.\n\n\r\n              Kevin Durant added 20 points, Tyus Jones had 19, and Royce O’Neale — starting for the injured Bradley Beal — scored 13 points. Jusuf Nurkic had 10 points and 14 rebounds.\n\n\r\n              Anfernee Simons scored 20 points to lead the Trail Blazers. Jerami Grant and reserve Deni Avdija scored 17 apiece.\n\n\r\n              A game after the Suns made 22 3-pointers in a victory at Utah, they hit 15 on Sunday. Booker and Grayson Allen each made four to lead Phoenix.\n\n\r\n              Former Suns No. 1 pick Deandre Ayton didn't make the trip for the Trail Blazers due to illness. Rookie Donovan Clingan started in his place and finished with 10 points and nine rebounds.\n\n\r\n              The Suns never trailed in the first half, but the Trail Blazers began the third quarter with an 11-0 run to take a 62-57 lead. Simons’ 3-pointer gave Portland its first lead at 60-57 early in the third quarter and Shaedon Sharpe’s steal and dunk completed an 11-0 run\n\n\r\n              Takeaways\r\n              Trail Blazers: Robert Williams III returned from a concussion and scored eight points, going 4 for 4 from the field. Blazers coach Chauncey Billups said Williams will be on limited minutes for the time being.\n\n\r\n              Suns: With Beal sidelined due to right knee swelling, coach Mike Budenholzer used 12 players, with 11 scoring. Allen led the bench player with 12 points.\n\n\r\n              Key moment\r\n              After Portland took a five-point lead, Booker scored 12 points in the third quarter and the Suns regained the lead, staying ahead the rest of the way.\n\n\r\n              Key stat\r\n              The Suns (14-11) are 13-2 when Durant plays and 1-9 when he doesn’t.\n\n\r\n              Up next\r\n              Both teams are back in action Thursday night. The Trail Blazers are at Denver, and the Suns host Indiana.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998188.6980119
}