{
  "game_id": "0021800115",
  "espn_id": "401070796",
  "date": "Nov 01, 2018",
  "matchup": "MIL @ BOS",
  "headline": "Irving scores 28, Celtics beat Bucks 117-113",
  "body": "BOSTON --  The Boston Celtics went outside and stayed there while knocking off the last of the NBA's unbeatens with a barrage of 3-pointers.\n\nThe Celtics set a franchise record for 3-pointers with 24 in a 117-113 win over the Bucks on Thursday night, handing Milwaukee its first loss of the season.\n\n\"We got a lot of open looks. We were taking what they were giving us,\" said Gordon Hayward, who hit three 3-pointers while scoring a season-high 18. \"Those are big shots for us. We have to be able to hit those.\"\n\nKyrie Irving led Boston with 28 points, including six 3-pointers as the Celtics shattered the club record of 19 and came up one short of the NBA record.\n\nAl Horford also scored 18, hitting four from beyond-the-arc, and Marcus Morris made five 3-pointers to finish with 17 points.\n\n\"It was probably a little more than we wanted to shoot, but those were the shots that were there,\" said Horford, who also led the Celtics with eight assists. \"We definitely want to be better, but we did a good job. I just felt like we moved the ball well. That was encouraging to see.\"\n\nGiannis Antetokounmpo returned to the lineup after missing one game while in the NBA's concussion protocol and led Milwaukee with 33 points and 11 rebounds.\n\nAntetokounmpo helped lead the Bucks to a 62-22 advantage in points-in-the-paint, but it wasn't quite enough for Milwaukee to overcome Boston's outside shooting.\n\n\"We were all shooting really well,\" Morris said. \"We were just knocking them down and our guys got hot.\"\n\nMilwaukee, the last unbeaten team left in the NBA after beating Toronto on Monday night, came up just short after a furious rally in the fourth quarter.\n\nDown 15 entering the final period, the Bucks opened on a 12-0 run and were within a point in the final minute, but the Celtics held on for their fourth straight win.\n\n\"We still think we are one of the best teams,\" Antetokounmpo said. \"Tonight we didn't have an `A' or `B' game. Probably a `C' game, but we were still close to winning the game in Boston.\"\n\nKhris Middleton and Malcom Brogdon scored 16 apiece and Eric Bledsoe had 13 points and seven assists for the Bucks.\n\nThe Celtics, whose previous record for 3-pointers was 19, came one short of tying the NBA record of 25, set by the Cleveland Cavaliers in a win over the Atlanta Hawks on March 4.\n\nBoston didn't score in the fourth until Jayson Tatum hit a 3-pointer with 9:13 left in the game. Milwaukee continued to push and pulled within 113-112 when Bledsoe made 1 of 2 from the foul line with 13 seconds.\n\nThat was as close as the Bucks would get as the Celtics sealed it from the foul line.\n\nIrving hit back-to-back 3-pointers late in the second quarter and Boston led 55-53 at halftime. He opened the second half with three straight from beyond-the-arc and the Celtics appeared to be cruising with a 93-78 lead entering the fourth quarter.\n\n\"We can get better. We can play better, but credit to Boston tonight,\" Bucks coach Mike Budenholzer said.\n\nCOMING ALONG\n\nHayward's previous season-high was 15. Thursday was actually his highest-scoring game as a member of the Celtics, missing last season after a gruesome ankle injury in the opening game.\n\nHayward had a scare in the first half when he came down hard on the left ankle, but was able to finish.\n\n\"I think I got off to a good start and that was important for me. It felt good being able to be out there at the end of the game, too,\" Hayward said. \"It's an ongoing process. Last game wasn't that great. Tonight was a little bit better.\"\n\nALL HAIL!\n\nThere was an extended time out midway through the first quarter, when Red Sox manager Alex Cora carried the World Series championship trophy onto the court, followed by his players.\n\nFans roared when Cora led the team out of the tunnel and got louder each time a player hoisted the trophy high for the fans to continue a celebration that started Sunday with a series-clinching victory over the Los Angeles Dodgers.\n\nTo punctuate the visit, fans broke out in a round of their favorite derogatory chant about the rival New York Yankees.\n\nTIP INS\n\nBucks: Antetokounmpo returned to practice Wednesday and was cleared to play Thursday. He was injured Saturday by a blow to the head during in a game against Orlando. Antetokounmpo said it was his first concussion.\n\nCeltics: Boston's previous franchise record for 3-pointers was 19, done twice, most recently Jan. 16 in a win over New Orleans. . G Jaylen Brown was out with a sore right foot. . Semi Ojeleye, who played all of 24 minutes and scored two points through the first seven games, started for Brown and scored 10 points.\n\nUP NEXT\n\nBucks: Host the Sacramento Kings on Sunday afternoon.\n\nCeltics: Visit Indiana on Saturday night in the first of five straight on the road.",
  "source": "espn_api",
  "crawled_at": 1764994531.627794
}