{
  "game_id": "0022000056",
  "espn_id": "401267216",
  "date": "Dec 30, 2020",
  "matchup": "MEM @ BOS",
  "headline": "Brown scores career-high 42, Celtics beat Memphis 126-107",
  "body": "BOSTON -- — Jaylen Brown had a career-high 42 points before sitting out the fourth quarter on Wednesday night, when the Boston Celtics coasted to their 10th straight victory over the Memphis Grizzlies, 126-107. \n\n\r\n                    “He’s just really improved. Worked hard to improve,” Celtics coach Brad Stevens said of the fourth-year forward, who has also been one of the leaders of the team's social justice efforts. \"Got a lot on his plate. He wants to have a lot on his plate, and that’s good.”\n\n\r\n                    Jayson Tatum scored 16 points and Marcus Smart had 14 before they, too, sat out the fourth quarter of the blowout. Robert Williams III had 10 rebounds for Boston, which hasn't lost to Memphis since 2016.\n\n\r\n                    Brown matched his career best of 34 points with three minutes left in the third. His seven 3-pointers made (on 10 attempts) tied a career high.\n\n\r\n                    “Since I’ve been here I’ve seen Jaylen grow every year,” forward Daniel Theis said. “He got a hot hand, hit five or six shots in a row, so we kept looking for him.”\n\n\r\n                    Hours after announcing they will be without leading scorer and reigning Rookie of the Year Ja Morant for three to five weeks because of a sprained ankle, the Grizzlies lost guard Grayson Allen in the first half to an ankle sprain. \n\n\r\n                    Jonas Valančiūnas had 20 points and 11 rebounds for Memphis, and Gorgui Dieng scored 17 points.\n\n\r\n                    \"When we’re down players, especially when we’re down Ja, everybody has to bring their A-game or it’s not going to be good for us,\" Dieng said. “Hopefully we can hold it down until those guys get back.”\n\n\r\n                    Memphis opened a 4-0 lead before giving up the next 12 points of the game. The Celtics led 31-19 after one quarter and had a 17-0 run in the second — two 3-pointers from Tatum and three 3s and a putback layup from Brown — to open a 57-30 lead. \n\n\r\n                    The Grizzlies didn't get within 20 until there were less than two minutes left, and the benches had been emptied. TIP-INS\n\n\r\n                    Grizzlies: Memphis is coming off of a 116-111 overtime victory over Brooklyn. ... The Grizzlies last won in Boston in 2013. ... Kyle Anderson, who had 48 points in the previous two games, scored nine and was 0 for 4 from 3-point range.\n\n\r\n                    Celtics: Tatum was listed as questionable with a left thumb sprain on the injury report that came out Wednesday afternoon, but later he was upgraded to available. He started the game and scored 16 points in 23 minutes. ... Brown was 10 for 15 in the first half, including 7 of 10 from 3-point range. ... Tacko Fall saw his first action of the season, playing the last six minutes and hitting a pair of free throws.\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Visit Charlotte on Friday night. \n\n\r\n                    Celtics: Visit Detroit on Friday night. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996992.353825
}