{
  "game_id": "0022200965",
  "espn_id": "401469120",
  "date": "Mar 05, 2023",
  "matchup": "BKN vs. CHA",
  "headline": "Bridges' perfect 1st quarter sends Nets past Hornets, 102-86",
  "body": "NEW YORK -- — Mikal Bridges went 9 for 9 in a 19-point first quarter, finishing with 33 to lead the Brooklyn Nets to a 102-86 victory over the Charlotte Hornets on Sunday night. Two nights after coming from 28 down to beat Boston in the biggest comeback in the NBA this season, the Nets led by as much as 37 after Bridges’ fast start in the highest-scoring quarter of his career. “My teammates just kind of (found) me,” said Bridges, who for the first time in this career has had consecutive 30-point games. “As I kept making shots, they just kept looking for me, Coach drawing up plays.” He didn’t attempt a shot in the second quarter but did make a pair of free throws. His first miss of the night, a 3-pointer from the right wing, came in the opening seconds of the third quarter.\n\n\r\n              Spencer Dinwiddie added 24 points for the Nets, who have won two straight. Cam Johnson chipped in 11 points and 10 rebounds, while Joe Harris had 12 points. “Just a character test for us,” said Brooklyn coach Jacque Vaughn. “As easily as a game where we come off a big win against Boston, you come home, are you going to be relaxed, are you going to be detailed into doing responsibility and taking care of our jobs tonight. Give our guys credit, we were locked in from the beginning, our approach was great, our attention to detail was great, and we definitely got rewarded by playing well.”\n\n\r\n              Kelly Oubre Jr. had 17 points and Mark Williams added 10 points and 14 rebounds for the Hornets, who have lost three consecutive games. “For the most part, these guys have handled an incredible amount of bad luck and adversity all year,” Hornets coach Steve Clifford said. “We played really hard. Our effort and energy have been the best things that we’ve done. Tonight was not the case.” Charlotte trailed by as many as 37 in the third quarter before going on a 22-2 run which spanned the final three minutes of the period and the first two of the final quarter.\n\n\r\n              Svi Mykhailiuk’s 3-pointer off a pass from Dennis Smith Jr. cut the Nets’ lead 86-71 with 10:13 to play in the fourth. “You’ve got to get more stops and get more possessions,” Oubre said. “Doing the dirty work, limit the offensive team to just one shot.” \n\n\r\n              Bridges helped the Nets pull away in the first quarter with 4:47 remaining after Gordon Hayward connected on a pair of shots.\n\n\r\n              Dinwiddie found Bridges for a jumper that keyed a 10-0 run, which he capped with a 13-foot shot to make it 28-17. Terry Rozier’s layup ended the scoring drought for the Hornets, but the Nets closed out the quarter with an 8-2 spurt highlighted by Bridges’ 12-foot jumper that extended the lead 36-21 before time expired.\n\n\r\n              Brooklyn then limited the Hornets to 6-for-19 shooting from the field in the second quarter, outscoring them 34-20 in the period to take a 70-41 lead at halftime. The Nets shot 25 for 48 in the first half, including 10 for 26 beyond long distance. \n\n\r\n              TIP-INS\n\n\r\n              Hornets: F P.J. Washington returned to the lineup after missing the previous four games due to a right foot sprain. He had eight points and eight rebounds. … Charlotte has lost nine of its last 10 games on the road. … Smith had 16 points.\n\n\r\n              Nets: Bridges has four 30-point games in nine games as a Net. He had only two in 365 games with Phoenix. … Brooklyn allowed a season-low 41 first half points.\n\n\r\n              SIMMONS UPDATE\n\n\r\n               Ben Simmons, who has been dealing with soreness in his knee, recently had an MRI that showed inflammation in his back, Vaughn said.\n\n\r\n              “So, we’ll see what that looks like, you know, kind of day by day, but that’s what we’re managing, along with trying to strengthen that knee,” he said.\n\n\r\n               UP NEXT Hornets: Will remain in New York and play the Knicks on Tuesday night. Nets: Visit the Houston Rockets on Tuesday night for the start of a five-game road trip.",
  "source": "espn_api",
  "crawled_at": 1764994858.641333
}