{
  "game_id": "0022201046",
  "espn_id": "401469201",
  "date": "Mar 16, 2023",
  "matchup": "ORL @ PHX",
  "headline": "Suns hold off Magic 116-113, snap 3-game losing streak",
  "body": "PHOENIX -- — Josh Okogie made a go-ahead 3-pointer midway through the fourth quarter and blocked Paolo Banchero's 3 in the final seconds as the Phoenix Suns held off the Orlando Magic 116-113 on Thursday night to snap a three-game losing streak.\n\n\r\n              Devin Booker led Phoenix with 19 points. Cameron Payne scored 18 points, Deandre Ayton and Chris Paul each had 16 and Okogie finished with 15. The Suns made all 17 of their free throws.\n\n\r\n              Kevin Durant missed his fourth straight game because of a sprained left ankle sustained in warmups before a game his anticipated home debut against Oklahoma City. He has played just three games with Phoenix since coming over from Brooklyn in a trade in February.\n\n\r\n              Markelle Fultz scored 25 points for Orlando, Banchero added 18 and Cole Anthony 17. Franz Wagner had 16 points and 10 rebounds, and Wendell Carter Jr. also scored 16 points.\n\n\r\n              Orlando trailed by 12 points in the second half before pulling even at 101 on Wagner's 3-pointer with just under six minutes to go.\n\n\r\n              After a Phoenix timeout, Okogie's 3-pointer restored the Suns' lead. The Magic closed to 114-113 on a pair of free throws by Fultz with 8.8 seconds to play.\n\n\r\n              Terrence Ross made two free throws for the Suns with 6.1 seconds left for the game's final points.\n\n\r\n              On the final shot, Magic coach Jamahl Mosley said he was expecting Phoenix to foul before Orlando could attempt a tying 3-point shot.\n\n\r\n              “Usually they’re going to foul,\" Mosley said. \"As soon as Franz caught it (outside the arc), they put two on him. Franz made the right play, pushed it over to Paolo and he almost had the good look. But (Okogie) made a heck of a play.”\n\n\r\n              Okogie said the Suns were planning to foul. \n\n\r\n              “I kind of read it and didn't think it was a good situation to foul him,” he said. “I anticipated the shot. Thank god I didn't foul him.”\n\n\r\n              Added Suns coach Monty Williams: “I'm just glad we were able to make enough plays to pull out a win. (Okogie) making plays like he has all year long when he has been able to play. We are thinking foul but they swung it quickly. To be able to make a play like that at the end is huge for us.”\n\n\r\n              Orlando outrebounded Phoenix 47-35 and had a major advantage in fast-break points (26-2).\n\n\r\n              “We stayed composed, tried to keep pushing the pace and get the shots that we wanted,\" Fultz said. \"We made it a close game, but we had turnovers (19 for 17 Suns points) and I had a few silly fouls. There were multiple plays that added up to us losing the game.”\n\n\r\n              Fultz had nine assists and seven rebounds to go with his25 points.\n\n\r\n              TRAINER’S ROOM\n\n\r\n              Magic: Gary Harris (right hip flexor tendon) was in the starting lineup in what Mosley said was a “game time decision.” He played 26 minutes and scored six points.\n\n\r\n              Suns: Durant took some shots in practice Thursday. “He hasn’t done anything outside of that, it’s just part of his progression,\" Williams said. “We’ll see how he responds to standard shooting.” The original plan was to re-evaluate Durant's condition at the end of March, and Williams didn't indicate it would be any sooner than that.\n\n\r\n              RAVE REVIEWS\n\n\r\n              Banchero has been everything that was advertised in his rookie season. The 6-foot-10 Orlando forward, the NBA’s No. 1 overall pick from Duke, is averaging 20 points.\n\n\r\n              “Most young players with his skill set can score. Not many of them get to the free-throw line consistently,” Williams said before the game. “He’s got the size to take a hit when he gets to the paint.”\n\n\r\n              Banchero has been the NBA’s Rookie of the Month in December, January and February.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Los Angeles Clippers on Saturday.\n\n\r\n              Suns: At Oklahoma City on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994316.193773
}