{
  "game_id": "0022300119",
  "espn_id": "401584747",
  "date": "Nov 01, 2023",
  "matchup": "MIA vs. BKN",
  "headline": "Nets rally in 2nd half, top Heat 109-105 to add to Miami's miserable 1-4 start",
  "body": "MIAMI -- — Armoni Brooks had practice on Tuesday, on Long Island, for Brooklyn's G League team. He was told to get on a flight to Miami a couple hours after that workout essentially because of roster depletion.\n\n\r\n              Good call.\n\n\r\n              Brooks scored 17 points off the bench in 16 minutes, Mikal Bridges led Brooklyn with 21 points and the Nets erased a 15-point second-half deficit to beat the Miami Heat 109-105 on Wednesday night.\n\n\r\n              “That's the best part of basketball, showing up with who you have and staying together as a team and pulling out a victory on the road against a really good team,” Nets coach Jacque Vaughn said. \n\n\r\n              The Nets outscored Miami 55-25 when Brooks was on the floor, 36-16 in his two second-half stints. He was 6 of 7 from the floor, 5 of 6 from 3-point range.\n\n\r\n              “Landed about 7 o'clock last night, went to shootaround and prepped ourselves to get ready to play,” Brooks said.\n\n\r\n              It was his first NBA game since April 2022, and it was Trendon Watford's Nets debut. He had 11 points and was a plus-19 in 14 minutes. Lonnie Walker IV added 17 for the Nets, Dorian Finney-Smith scored all 15 of his points in the second half for Brooklyn, and Cam Thomas scored 13.\n\n\r\n              Tyler Herro scored 30 points for Miami, which has dropped four straight to fall to 1-4 — its worst five-game start since opening 0-5 in the 2007-08 season.\n\n\r\n              “We can’t feel sorry for ourselves at this point of the year,” Herro said. \"It’s still early, obviously. But at some point, this has to matter to us. We can’t keep losing games and think it’s OK.”\n\n\r\n              Bam Adebayo scored 21 points and grabbed 14 rebounds for Miami, and Jimmy Butler scored 20 points for the Heat.\n\n\r\n              “We don't want to dig this hole too deep,” said Adebayo, now the Heat captain. “That's the concern.”\n\n\r\n              Brooklyn’s bench outscored Miami’s 50-26.\n\n\r\n              Miami nearly blew a 19-point lead in the season-opener against Detroit, winning that game by one and escaping when Cade Cunningham missed a 3-pointer as time expired.\n\n\r\n              Against Boston on Friday, an early 13-point lead wasn’t close to enough in what became a 119-111 loss. And then against the Nets, Miami saw the 15-point second-half lead vanish relatively fast.\n\n\r\n              \"We certainly have to sustain,\" Heat coach Erik Spoelstra said. “We have to find a way to sustain it more consistently, and better, and that's what we're focused on. ... We just have to be better at sustaining our game.”\n\n\r\n              Miami led by 16 in the first half and was up 75-60 with 4:30 left in the third quarter. The Nets outscored Miami 38-17 over the next 12 minutes.\n\n\r\n              The Heat fell to 6-3 when playing on Spoelstra’s birthday during his tenure as head coach. Miami had won its last five birthday games — the last loss coming at Brooklyn in 2013.\n\n\r\n              Miami used its fourth starting lineup in as many games, this time with Adebayo back in after missing Monday’s loss at Milwaukee and with Kevin Love sidelined by a bruised left shoulder. Rookie Jaime Jaquez Jr. took Love’s spot in the lineup.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Visit Chicago on Friday in an In-Season Tournament game.\n\n\r\n              Heat: Host Washington on Friday in an In-Season Tournament game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995397.495755
}