{
  "game_id": "0021800379",
  "espn_id": "401071060",
  "date": "Dec 08, 2018",
  "matchup": "SAC @ IND",
  "headline": "Young scores 20 points, Pacers beat Kings 107-97",
  "body": "INDIANAPOLIS --  The Indiana Pacers are showing their frontcourt is a force to be reckoned with, even without injured All-Star guard Victor Oladipo.\n\nStarting forwards Thaddeus Young and Bojan Bogdanovic combined for 38 points Saturday night in a 107-97 victory over the Sacramento Kings, while centers Myles Turner and Domantis Sabonis fortified the interior of Indiana's rising defense.\n\nOladipo missed his 10th straight game. Nonetheless, the Pacers, up to fourth in the Eastern Conference standings at 16-10, are proving they are so much more than just Oladipo.\n\n\"We have a lot of weapons on this team,\" Turner said, \"and now everybody is playing with confidence.\"\n\nYoung had a season-high 20 points and nine rebounds, and Bogdanovic added 18 points. Bogdanovic has averaged 19 points over the past two weeks with Oladipo recovering from issues with his right knee.\n\nRanked third in the league on defense, Indiana has also made up for Oladipo's absence by frequently flustering the opposition.\n\nSacramento, a top-10 offense shooting 48 percent from the field this season, was held to 42 percent. Buddy Hield scored 20 points and De'Aaron Fox added 18 points and six assists. Nothing came easy as the Kings' three-game win streak ended.\n\n\"One of the lower-scoring games we've had all season,\" Fox said. \"They defended us well, so it was just their defense. They got to us, and we weren't able to make shots. Most of our losses have been high-scoring, where we were still able to put the ball in the basket.\"\n\nWith each squad playing the second of a back-to-back, the game lacked the dizzying pace of the teams' meeting of a week ago which Sacramento won 111-110.\n\nThis game was just as competitive, however. At least until Indiana, up 73-70 after three quarters, went on a 16-2 run midway through the fourth. Sacramento went scoreless on seven of eight possessions during that stretch, and the Pacers moved ahead 100-85 with 4:14 to go.\n\nHield connected on three 3-pointers in the first quarter. The rest of the Kings' offense in the period came from inside the lane (16 points) or on free throws (six) as they carried a 31-24 lead into the second quarter.\n\nAfter that, Turner and Sabonis stepped up. Turner finished with nine points, 13 rebounds and four blocked shots. Sabonis had 14 points and six rebounds, as well as a crowd-pleasing block that helped the Pacers recover from a 12-point second-quarter hole.\n\nWith the game tied in the waning seconds of the half, Young rebounded a Sacramento miss and flipped a transition pass to Darren Collison, who pulled up for a wide-open, buzzer-beating jumper that provided Indiana a 54-52 halftime edge.\n\n\"Myles is doing a good job over the last five or six games just protecting the paint,\" Collison said. \"It's easier said than done, but when you have a big man like that blocking shots, it changes the whole game.\"\n\nSabonis also helped change it. After missing Friday's 112-90 win at Orlando due to illness, Sabonis sparked the Pacers in a three-possession sequence. The 6-foot-10 Sabonis unleashed a rim-rocking, one-handed dunk, blocked a point-blank attempt by Willie Cauley-Stein and then pump-faked his way to a nifty basket over Cauley-Stein, causing the Kings to call time out with their lead trimmed to 38-30.\n\nTurner and Sabonis left quite an impression on Sacramento's prized 6-11 rookie Marvin Bagley III. He fouled out for the first time.\n\n\"They are great players,\" Bagley said. \"They have a lot of talent, athleticism, and they work together. That's a great team we ran into.\"\n\nTIP-INS\n\nKings: Starting small forward Iman Shumpert, averaging 9.4 points in 25 minutes per game, sat out for rest. . Fox, the Kings' second-leading scorer, didn't score until 3:28 remained in the first half.\n\nPacers: The win marked Indiana's third straight home victory over Sacramento and fifth in the last six meetings overall. . The Pacers committed 17 turnovers, but outrebounded the Kings 52-43.\n\nUP NEXT:\n\nKings: Conclude a four-game road trip Monday night against Chicago.\n\nPacers: Continue a three-game homestand Monday night against Washington.\n\n---\n\nFor more AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994209.54645
}