{
  "game_id": "0021400762",
  "espn_id": "400579054",
  "date": "Feb 07, 2015",
  "matchup": "POR @ DAL",
  "headline": "Dirk Nowitzki forces OT, leads Mavs to win over Trail Blazers",
  "body": "DALLAS -- Dirk Nowitzki gave Dallas a shot at a rare win over a Western Conference playoff contender by capping a late rally with a 3-pointer that forced overtime.\nChandler Parsons took over from there.\nNowitzki's 25 points included a high-arching 3-pointer that wiped out the last of an 11-point deficit in the final 2 minutes, Parsons scored 10 of his 20 in the extra period and the Mavericks beat the Portland Trail Blazers 111-101 Saturday night.\nInstead of losing for the 12th time in 14 games against teams currently in the West playoff picture, the Mavericks (35-18) pulled percentage points behind Portland (34-17) for fourth place.\n\"This was huge because we had not beat a very good team that's been at full strength all year long,\" said Parsons, perhaps forgetting a recent win at Southwest Division-leading Memphis because the Mavericks were blown out at home by the Grizzlies a week later. \"So to be the team that we want to be, we need to have wins like this.\"\nDamian Lillard ended a shooting slump to finish with 26 points and LaMarcus Aldridge had 25, but the Blazers were outscored 22-2 in a stretch that included the fourth quarter and overtime to drop their seventh straight road game.\n\"Tonight was tough, to lose like that. But we've just got to bounce back tomorrow,\" said Aldridge, referring to the second game of a back-to-back in Houston. \"We outplayed them for all but two minutes. And those two minutes were the most important two minutes.\"\nThe Mavericks gave themselves a chance with 3-pointers from Devin Harris and Parsons just 12 seconds apart to pull within five with 1:43 to go in regulation. Harris then knocked the ball away from Lillard, took a pass from Monta Ellis and hit a layup.\nAfter Lillard missed a long 3, Harris rebounded a missed 3-pointer from Ellis to set up Nowitzki's tying shot to a huge roar from what was left of a crowd that started filtering out not long after Wesley Matthews opened the fourth quarter with a 3-pointer that put Portland up by 16.\n\"They hung in there and basically pitched a shutout in the last two minutes to get to overtime and then we got some momentum,\" Dallas coach Rick Carlisle said. \"That was a hard game, and that's a heavyweight team in the West.\"\nThe Mavericks scored the first nine points of overtime, starting with two free throws by Parsons after he was fouled getting an offensive rebound, one of nine overall. He pumped his fist after a fadeway jumper that put Dallas ahead by 10.\n\"I just tried to create mismatches and stay confident,\" said Parsons, who hit all three shots in overtime after going 4 of 13 in regulation. \"I had missed a lot of bunnies and some open shots early in the game.\"\nFADING BLAZERS\nPortland missed the first two shots and first three free throws of overtime before finally scoring with 2:08 left on the second of two free throws by Aldridge, who was called for traveling on the Blazers' first possession of the extra period. That was one of a season high-tying 22 turnovers, and Portland went 7 minutes without a field goal bridging the fourth quarter and overtime.\nNO RONDO\nThe Mavericks salvaged the first of three straight at home going into the All-Star game knowing guard Rajon Rondo won't be back before the break.\nJ.J. Barea struggled for the first time in four games filling the starting role after Rondo broke the orbital bone of his left eye and his nose a week earlier in Orlando. Barea missed his first six shots and finished 2 of 11 from the field for seven points with four turnovers, but did have seven assists.\nTIP-INS\nBlazers: Lillard hit his first four 3-pointers after going 2 of 30 from long range the previous four games. ... Aldridge had a game-high 14 rebounds for his 26th double-double of the season. ... Nicolas Batum was 0 of 8 from the field but had 10 rebounds.\nMavericks: Tyson Chandler had his 23rd double-double with 11 points and 13 rebounds. ... Ellis had 20 points, six assists and four steals. ... Nowitzki showed some first-quarter hustle, twice diving into the stands after loose balls. He saved the second one to Barea beyond the 3-point line, and Parsons scored on a drive.\nUP NEXT\nBlazers: at Houston on Sunday.\nMavericks: home against the Clippers on Monday.",
  "source": "espn_api",
  "crawled_at": 1764992064.4738162
}