{
  "game_id": "0022200914",
  "espn_id": "401469069",
  "date": "Feb 26, 2023",
  "matchup": "TOR @ CLE",
  "headline": "Mitchell scores 35 points, Cavaliers rout Raptors 118-93",
  "body": "CLEVELAND -- — Donovan Mitchell scored 35 points and Jarrett Allen had 23 points and 11 rebounds, sending the Cleveland Cavaliers to a 118-93 victory over the Toronto Raptors on Sunday night.\n\n\r\n              Mitchell made eight 3-pointers — one shy of his career high — and had six rebounds and four assists in 31 minutes as the Cavaliers snapped their three-game losing streak and remained fourth in the Eastern Conference.\n\n\r\n              Darius Garland added 18 points and 11 assists, and Evan Mobley had 18 points and nine rebounds for Cleveland, which built a 110-80 lead in the fourth quarter and improved to 26-7 at home this season.\n\n\r\n              “We hadn’t played our best basketball the last three games, so we just came out and were aggressive,” said Mitchell, who scored 13 points in both the second and third quarters. “Darius got us going scoring-wise and the rest of us took over from there.”\n\n\r\n              Pascal Siakam paced Toronto with 25 points and grabbed eight rebounds, and Jakob Poeltl had 13 points and nine boards. Starting point guard Fred VanVleet missed his third straight game for personal reasons.\n\n\r\n              The Cavaliers avoided a four-game season sweep by the Raptors.\n\n\r\n              “This was a big game for us and Donovan is a guy who shines brightest when we need him the most,” Cleveland coach J.B. Bickerstaff said. “Most important, he’s a part of the team and I can’t say enough about that.”\n\n\r\n              The Raptors had won a season-high four in a row and are 7-2 since Feb. 3, moving into ninth in the East. They failed to reach .500 for the first time since Dec. 9 with the 25-point loss, shooting 38.7% from the field.\n\n\r\n              “What makes Donovan difficult to guard is he uses combination moves offensively,” Raptors coach Nick Nurse said. “A lot of times, he moves in three different directions in one move over and over. Not a lot of guys can do that.”\n\n\r\n              Mitchell and Garland combined to make their first seven 3-point attempts and Allen made his first seven shots, staking Cleveland to a 64-52 halftime advantage. Mobley grabbed seven rebounds in the second quarter.\n\n\r\n              Veteran swingman Danny Green, who signed with the Cavaliers earlier this month, converted a four-point play in the fourth. It was his first appearance in a home game for Cleveland.\n\n\r\n              Toronto is in the midst of an eight-game stretch that only includes one at home. The span began with a 95-91 victory at Detroit on Saturday afternoon.\n\n\r\n              DOUBLE WHAMMY\n\n\r\n              Bickerstaff challenged an offensive foul by Mitchell in the third quarter. Not only did the officials uphold Mitchell’s push-off under the basket against Poeltl, they upgraded it to a flagrant-1 foul for being an unnatural basketball play. \n\n\r\n              “It’s a judgement call on their part, but I don’t know how you shoot a layup without putting your leg up,” Bickerstaff said. “I thought Donovan went to shoot a layup.” \n\n\r\n              Mitchell also disagreed with the decision, saying, “I felt like I didn’t foul him.”\n\n\r\n              TIP-INS\n\n\r\n              Raptors: G Scottie Barnes has overcome a rough start to his second season. The reigning Rookie of the Year is averaging 17 points, 7.3 rebounds and 5.1 assists since the beginning of January. “Scottie is back to playing with super joy and enthusiasm, just like he did in his rookie season,” Nurse said. ... Nurse and Barnes were both called for technical fouls in the first eight minutes.\n\n\r\n              Cavaliers: G Dylan Windler, a first-round draft pick in 2019, is averaging 5.3 points through three games on a G League assignment with the Cleveland Charge. He missed the first four months with a sprained right ankle and has not logged a minute in the NBA since April 10, 2022. ... The Cavaliers have one open roster spot following the release of five-time All-Star F Kevin Love.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host the Chicago Bulls on Tuesday night.\n\n\r\n              Cavaliers: Visit the Boston Celtics on Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994031.422382
}