{
  "game_id": "0022200278",
  "espn_id": "401468433",
  "date": "Nov 25, 2022",
  "matchup": "ATL @ HOU",
  "headline": "Green has 30 points, Rockets rally to beat Hawks 128-122",
  "body": "HOUSTON -- — Jalen Green scored 30 points, Kenyon Martin Jr. and rookie Jabari Smith Jr. added 21 each and the Houston Rockets overcame a 15-point second half deficit to beat the Atlanta Hawks 128-122 on Friday night. \n\n\r\n              “There is a maturity that comes with every experience that we have,” coach Stephen Silas said. “But to go through everything that we went through in this game and get down and fight back shows not only maturity, but also shows character.”\n\n\r\n              The Rockets (4-14) got a rare win in this tough season despite huge nights from Trae Young and Dejounte Murray. Young had a season-high 44 and Murray set career highs with 39 points and eight 3-pointers in a game where big man Clint Capela didn’t play. \n\n\r\n              Green made four quick points to put the Rockets up 118-117 with about two minutes to go. Garrison Mathews grabbed a steal after that and made two free throws after he was fouled on the other end. \n\n\r\n              Young made 1 of 2 free throws for Atlanta before Smith made it 122-118 on a put-back layup with just over a minute remaining. \n\n\r\n              Green fouled out just after that and Young made 1 of 2 free throws again. An off-balance layup by Mathews pushed Houston’s lead to 124-119.\n\n\r\n              Smith talked about the key to finishing this game.\n\n\r\n              “Just togetherness,” he said. “We didn't have that energy and that same pop we had to start the game, so we were just trying to find that. Playing angry and just trying to come back.”\n\n\r\n              Daishen Nix made a free throw with about 30 seconds left to add to Houston’s lead and Mathews added two free throws to make it 127-119 with 13.3 seconds to go. \n\n\r\n              “Defensively we never established that we could stop this team and when we did force them to miss they beat us to the glass with 22 offensive boards,” Atlanta coach Nate McMillan said. “No defense at all in this game, 122 points is enough points to win a game.” \n\n\r\n              The Rockets scored the first eight points of the fourth quarter, with 3s by Smith and Mathews, to get to 104-102 with about 10 minutes to go. \n\n\r\n              Murray gave Atlanta its first points of the quarter with two free throws to start a 6-2 run that made it 110-104. \n\n\r\n              Houston then used an 8-2 spurt, capped by a 3 from Green, to tie it at 112-all with about five minutes to go. \n\n\r\n              Murray hit a 3-pointer seconds later to give Atlanta the lead and put his finger to his lips to hush the crowd as he ran down the court. \n\n\r\n              The Hawks led by 3 at halftime and scored the first nine points of the third, with a 3 from Murray, to make it 81-69 with about 8 1/2 minutes left in the quarter.\n\n\r\n              Green made three free throws before Atlanta went on a 9-2 run, with two 3s from Murray, to push it to 90-74 with about seven minutes left in the third. \n\n\r\n              The teams got into a scuffle after that with Murray and Smith pushing each other and jawing. Young and Green then ran over and began pushing each other and arguing while Murray and Smith were separated. All four players were given technical fouls after a review. \n\n\r\n              The Rockets trailed by 11 later in the third when Silas got a technical foul for yelling at the referees when he thought Martin was fouled. \n\n\r\n              Two free throws by Young made it 104-92 late in the third but Porter made a basket near the buzzer to get Houston within 10 entering the fourth. \n\n\r\n              TIP-INS\n\n\r\n              Hawks: Capela missed the game with dental pain. … Bogdan Bogdanovic sat out as part of recovery from a right knee injury. … Jarrett Culver was out with a bruised hip. … Atlanta made 15 of 39 3-pointers. \n\n\r\n              Rockets: Eric Gordon missed the game with a groin injury. … Jae’Sean Tate was out for an 11th straight game with a sore right ankle. ... Mathews had 20 points off the bench. \n\n\r\n              REBOUNDING WOES \n\n\r\n              Houston had 22 offensive rebounds to just six by the Hawks. Young said there's no excuse for such a disparity.\n\n\r\n              “I know we didn't have Clint tonight for our rebounds,” Young said. “But we still should have been able to rebound and do a better job that way. That really hurt us.”\n\n\r\n              UP NEXT \n\n\r\n              Hawks: Host Miami on Sunday. \n\n\r\n              Rockets: Host Oklahoma City on Saturday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995225.27918
}