{
  "game_id": "0021501160",
  "espn_id": "400829047",
  "date": "Apr 05, 2016",
  "matchup": "OKC @ DEN",
  "headline": "Westbrook's 17th triple-double leads Thunder over Nuggets",
  "body": "DENVER -- Russell Westbrook turned his first-half frustration into a milestone night.\nWestbrook had 13 points, 14 rebounds and 12 assists to become the first player with 17 triple-doubles in a season in 27 years, and the Oklahoma City Thunder routed the Denver Nuggets 124-102 on Tuesday night.\nWestbrook has the highest total since Magic Johnson had 17 for the Los Angeles Lakers in 1988-89. Westbrook, who had seven in March while winning Western Conference player of the month honors, has 35 in his career, which is second behind LeBron James for most among active players.\n\n\"It's a great honor,\" Westbrook said. \"Whenever you're mentioned in the same sentence as Magic, it's always great. That's something you never take for granted.\"\nKevin Durant had 26 points and eight assists for Oklahoma City. The Thunder are locked into the No. 3 seed in the West with four games left.\nOklahoma City got there by outscoring Denver 75-47 in the second and third quarters. Westbrook led the way with seven points and 10 rebounds in the first half but his five turnovers bothered him.\n\"I was throwing the ball away too much,\" he said. \"I made a conscious effort in the second half to not turn the ball over.\"\nGary Harris led the Nuggets with 17 points and rookie Emmanuel Mudiay had 15. Denver has lost three in row and six straight to Oklahoma City.\nThe Thunder used a 23-2 run in the second quarter to take control. Durant scored 10 points in the period and the Nuggets missed seven of eight shots during the stretch.\nDenver got within 12 early in the third quarter before another Thunder run put it away. Westbrook had six points and six assists over the next eight minutes to get his triple-double and help put Oklahoma City ahead 92-67.\n\"It's a scary team,\" Nuggets coach Michael Malone said. \"They have one of the highest-octane offenses in the NBA, and we saw that tonight. We had flashes where we looked like we could compete with them. Then it shows how far we are away.\"\nWestbrook didn't have a turnover in the 9 1/2 minutes he played in the third quarter. He didn't play in the fourth.\n\"He's one of those rare guys that can dominate a game without taking a shot,\" Thunder coach Billy Donovan said. \"He distributed, he rebounded, he pushed the tempo. He created a lot of scoring opportunities for our team.\"\nDion Waiters hit two late 3-pointers as the Thunder pushed the lead to 107-77 heading into the fourth. The Thunder led by as much as 33.\nEnes Kanter finished with 18 points and 11 rebounds, and Waiters and Serge Ibaka had 18 points apiece.\nTIP-INS\nThunder: Seven of Westbrook's triple-doubles have come by the end of the third quarter. ... Oklahoma City swept the season series for the first time since 1997-98, when the franchise was in Seattle. ... The Thunder were 8 for 12 from 3-point range in the first half and shot 55.8 percent overall before intermission. ... Oklahoma City tied a season high with 68 points in the first half.\nNuggets: D.J. Augustin hit a 67-foot shot at the end of the first quarter. ... F Darrell Arthur missed his second straight game with sore knees. ... Denver Mayor Michael Hancock was sitting courtside. ... Justin Bieber, who played the Pepsi Center on Monday night, was sitting in one of the suites.\nNO REST\nDonovan said he doesn't want to mess with his team's rhythm by resting players in the last week of the season. He said he would sit players who are hurt.\n\"Sometimes when you rest players you take away that rhythm and flow but you eliminate the risk of injury,\" Donovan said. \"What we are going to do is after every game we will evaluate where each individual player is at.\"\nUP NEXT\nThunder: At Portland on Wednesday night.\nNuggets: Host Spurs on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994121.165824
}