{
  "game_id": "0021900957",
  "espn_id": "401161599",
  "date": "Mar 09, 2020",
  "matchup": "CHA @ ATL",
  "headline": "Young has 31 as Hawks outlast Hornets 143-138 in double-OT",
  "body": "ATLANTA --  De'Andre Hunter broke a tie by sinking three free throws with 13.3 seconds remaining in the second overtime, and the Atlanta Hawks beat the Charlotte Hornets 143-138 on Monday night following a controversial finish to the first extra period.\n\nTrae Young had 31 points and 16 assists for Atlanta, and Hunter finished with 13 points and 11 rebounds.\n\n\"I wanted to give the fans a little extra,\" Young said, adding he felt he owed the fans more in the extra periods after making only one of two free throws at the end of regulation.\n\nTerry Rozier led the Hornets with a career-high 40 points.\n\nAfter Hunter's clutch trip to the line, Rozier missed a 3-pointer. Two free throws by Cam Reddish, who had 22 points, iced the win.\n\nYoung's pass set up a jam by Reddish for a 138-135 lead. Rozier answered with a tying 3-pointer.\n\nTwo reviews by the officials at the end of the first overtime produced different results. Following the first review, officials said Rozier was fouled by Atlanta's Treveon Graham with 0.8 seconds remaining.\n\nBefore Rozier had a chance to attempt two free throws with the score tied, Atlanta's Lloyd Pierce registered a coach's challenge. This time, the officials ruled Rozier was not fouled.\n\n\"Very unfortunate. I'm very disappointed with the way the game ended,\" Hornets coach James Borrego said.\n\n\"Every big call went in their direction. Every big call.\"\n\nAdded Rozier: \"It doesn't really matter what I think. I've got to watch what I say a little bit. Obviously I don't agree with it. I thought I was going to shoot two free throws.\"\n\nYoung missed a last-gasp jumper for Atlanta to force the second overtime.\n\nJohn Collins had 28 points and 11 rebounds for the Hawks. He made 12 of 13 shots from the field.\n\n\"I just feel like experience is coming in a little extra for me,\" Collins said. \"It's my third year.\"\n\nYoung made only one of two free throws with 1.8 seconds remaining in regulation to force the overtime.\n\nDevonte' Graham scored 27 points and made two free throws that gave Charlotte a 122-121 lead with 5.5 seconds remaining in regulation.\n\nRozier's 3-pointer with 1:13 remaining in regulation gave Charlotte its first lead of the second half.\n\nCaleb Martin scored a career-high 23 points for Charlotte before fouling out in the second overtime.\n\nAtlanta led 66-63 at halftime despite Martin's 11 second-period points.\n\nDevonte' Graham limped off the court with soreness in his left ankle with 4:52 remaining in the third quarter. He returned early in the final period.\n\nTIP-INS\n\nHornets: Cody Zeller was the starter and Bismack Biyombo was the backup in a newly announced center rotation that Borrego says is the plan \"for a few games.\" Willy Hernangomez is left out of the rotation for now. Borrego says Hernangomez must be ready for each game but soon will take his turn in the rotation for a few games until a winning combination is found. ... F Dwayne Bacon was recalled from G-League Greensboro.\n\nHawks: Young had his long-range shot working, including a second-quarter 3-pointer from the bottom edge of the Hawks' center-court logo. He made 6 of 13 3s. ... Even mascot Harry the Hawk joined in the fun, making a behind-the-back half-court shot during a timeout. ... G Jeff Teague (flu-like symptoms) was available. Young missed a game last week with similar symptoms before returning for Saturday's loss at Memphis.\n\nONE DIVISION WIN\n\nCharlotte, coming off a 108-99 win over Houston on Saturday night, fell to 1-7 against Southeast Division opponents. No other team in the league has played so few games against division opponents. Atlanta is 6-7 in the Southeast Division.\n\nROZIER'S NIGHT\n\nThe Hornets tried to take advantage of Rozier's career-best performance.\n\n\"The plays we were drawing up, they were for Terry,\" Borrego said.\n\nRozier couldn't celebrate his first 40-point game.\n\n\"It was kind of draining that we didn't come out on top,\" Rozier said.\n\nUP NEXT\n\nHornets: Visit Miami on Wednesday night\n\nHawks: Host Knicks on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996044.51007
}