{
  "game_id": "0022100645",
  "espn_id": "401360464",
  "date": "Jan 15, 2022",
  "matchup": "MIA vs. PHI",
  "headline": "Embiid scores 32, leads 76ers to 109-98 win in Miami",
  "body": "MIAMI -- — Joel Embiid scored 25 of his 32 points in the second half and the Philadelphia 76ers beat the Miami Heat 109-98 on Saturday night.\n\n\r\n              Listed as questionable to play because of right elbow soreness, Embiid helped the 76ers outscore Miami 66-48 in the final two periods.\n\n\r\n              “There’s no way I could have played worse than I did in the first half,” Embiid said of his 3-for-11 shooting. “I feel that I was probably the worst player in the NBA in that first half. All I needed to do was be aggressive.”\n\n\r\n              Tobias Harris added 22 points on 9-of-13 shooting. Seth Curry finished with 21 points for the 76ers, who have won nine of 10.\n\n\r\n              “Obviously, we got down early but we used our defense to climb back in the game,” Harris said. “And we just stayed composed throughout the second half.”\n\n\r\n              Philadelphia didn’t relinquish the lead after Harris’ layup in the second minute of the fourth quarter for a 77-75 advantage.\n\n\r\n              “There are a lot of games in the regular season that you’re really happy about,” 76ers coach Doc Rivers said. “It feels bigger than one game. That’s all it is at the end of the day. Just coming here and winning a game when they’re playing great, it’s a great time for us.”\n\n\r\n              Omer Yurtseven scored a career-high 22 points and had 11 rebounds for Miami. The rookie center extended his string of double-figure rebound games to 14.\n\n\r\n              The 76ers erased a 12-point deficit early in the third period with a 26-12 run to close the quarter. Curry’s 3-pointer to end it put Philadelphia ahead 75-73 for its first lead since the first period.\n\n\r\n              Miami’s Jimmy Butler, who averages a team-leading 23.2 points, finished with eight points on 1-of-11 shooting. In addition to Butler’s shooting woes, teammates Kyle Lowry shot 2 for 11 and Duncan Robinson 1 for 9.\n\n\r\n              “It’s part of the game,” Butler said. \"You’re not going to make shots every night. But I don’t think myself or anybody else missing shots is going to break us in any way. I think if we guard a little bit better, lock in on that side of the floor, we’ll always give ourselves a chance to win.”\n\n\r\n              It was the first time in Heat history that they had three players, with at least nine shot attempts apiece, shoot that badly in the same game.\n\n\r\n              “Maybe we should have invited Shaq to a different game,” Heat coach Erik Spoelstra said.\n\n\r\n              The Heat had Shaquille O’Neal — the center on their 2006 title team — at the game as a guest, welcoming him back to a building where his number 32 hangs among the retired jerseys.\n\n\r\n              They could have used him against Embiid, who has now scored at least 28 points in his last 11 road appearances.\n\n\r\n              “He showed pretty much his full skill-set tonight,” Spoelstra said. “His ability to face up ... he showed a lot of skill, particularly in that fourth quarter.”\n\n\r\n              But Spoelstra also raved about Yurtseven, who has exceeded all expectations in the absence of center Bam Adebayo. The Heat may get Adebayo back as soon as Monday; he’s missed the last six weeks while recovering from thumb surgery.\n\n\r\n              TIP-INS\n\n\r\n              76ers: G Matisse Thybulle (right shoulder soreness) will undergo an MRI, Rivers said. Thybulle was the victim of two Flagrant 1 fouls against Boston Friday. ... G Danny Green (hip soreness) sat out his second consecutive game. ... Philadelphia improved to 16-8 on the road.\n\n\r\n              Heat: Butler missed a free throw in the fourth quarter, ending a string of 42 consecutive makes. ... The loss ended a seven-game home winning streak. ... Miami’s 15-game January schedule features 11 opponents who qualified for the postseason in 2021. \n\n\r\n              ADDITIONAL BACK-TO-BACK SETS FOR THE HEAT\n\n\r\n              The Heat completed their second back-to-back home games Saturday and with the second half of their schedule featuring 25 games at FTX Arena, the club will have three additional sets of consecutive days. The five back-to-back home sets are second-most in franchise history.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Conclude a two-game road trip Monday at Washington.\n\n\r\n              Heat: Host Toronto on Monday.",
  "source": "espn_api",
  "crawled_at": 1764992659.032497
}