{
  "game_id": "0021801104",
  "espn_id": "401071777",
  "date": "Mar 25, 2019",
  "matchup": "OKC @ MEM",
  "headline": "Caboclo's career-high 24 points lead Grizzlies past Thunder",
  "body": "MEMPHIS, Tenn. --  Memphis is becoming a tough place to visit for contenders in the Western Conference playoff race.\n\nThe Grizzlies continued to play spoiler for those jockeying for postseason position, this time beating the Oklahoma City Thunder 115-103 on Monday night.\n\nThe win was the fifth at home in March for Memphis, four of them coming against playoff teams in the West. The other was against Orlando, which is fighting for the final playoff spot in the East.\n\n\"This is a team that's beaten Houston in here, they've beaten Utah in here and they've beaten Portland in here. And now they've beat us in here,\" Thunder coach Billy Donovan said, adding: \"They deserve the game. They outperformed us, outplayed us, out-coached us, out-everything-ed us for 48 minutes.\"\n\nBruno Caboclo scored a career-high 24 points, Tyler Dorsey added 21 and Memphis ended a two-game slide. Jonas Valanciunas added 18 points and 14 rebounds as all five Grizzlies starter reached double figures.\n\n\"I feel like our motto was -- once we were out of the playoffs -- it was kind of like, `Let's mess up other teams' seasons by giving them a loss\" said Delon Wright, who had 18 points and a career-high 13 assists.\n\nPaul George led the Thunder with 30 points and 12 rebounds, while Dennis Schroder added 25 points on 9-of-14 shooting. Russell Westbrook finished with 16 points and seven assists, but was just 6 of 20 from the field and missed five of his six 3-point attempts.\n\n\"They played great, but that's our fault,\" Schroder said.\n\nOklahoma City lost for the fifth time in six games and Donovan is looking for consistency -- consistency he hoped would have continued after the Thunder defeated Toronto on the road Friday before a couple days off ahead of the game in Memphis.\n\n\"I don't think there can be any excuses having two days in between the Toronto game,\" Donovan said, while taking blame for not having his team ready. \"I think it started right from the beginning.\"\n\nOklahoma City was down 16-2 after Memphis hit its first seven shots. Oklahoma City would cut the lead to 54-48 at halftime, but Memphis went on another rally to open the second half, this time 17-7, stretching the advantage to 18 points midway through the third.\n\nAt that point, Westbrook was 2 of 13.\n\nHe would start taking over the Thunder offense, getting to the basket and making his next four shots. That cut into the Memphis lead before the Grizzlies held an 86-78 advantage heading into the fourth.\n\nBut Westbrook couldn't continue the pace, missing all three shots in the fourth. Memphis pushed the lead to 103-90 after Dorsey connected on a 3-pointer with 4:42 left. The Thunder never got closer than seven down the stretch as Memphis sent another playoff contender home disappointed.\n\n\"We're not going to let them come in easy and play just for stats,\" Valanciunas said. \"We're a hard team. We're trying to establish that mentality, and we're not going to let it get easy.\"\n\nTIP-INS\n\nThunder: This was the second game of a two-game road trip, the last multiple-game stint away from home for Oklahoma City this season. ...The loss ended a nine-game winning streak for Oklahoma City over Memphis. ... C Steven Adams was limited to two points, making only one of his seven shots. ... George recorded his 23rd double-double. It was his 30th game with at least 30 points.\n\nGrizzlies: Starting PG Mike Conley (left thigh soreness) and reserve C Joakim Noah (right knee soreness) sat out. . Had not defeated the Thunder since Dec. 29, 2016. ... Caboclo's previous career high was 16 points on Feb. 7 at Oklahoma City. .Valanciunas recorded his fourth straight double-double. ... Memphis won its first game this season with Conley sitting out (now 1-5).\n\nBOARD WORK\n\nMemphis outrebounded Oklahoma City 57-41. The Thunder entered the game averaging 48.1 rebounds, second-best in the league, while Memphis is next-to-last with a 41.3 rebounding average. The 57 rebounds also matched a season high for the Grizzlies. Memphis had 57 on Feb. 25 against the Lakers. Caboclo's 11 rebounds tied his career high.\n\nPLAYOFF PICTURE\n\nThe Thunder entered the game in the sixth playoff spot in the West; they left tied with the idle San Antonio Spurs for the final seed. Because of the Thunder's loss and Utah defeating Phoenix 125-92, the Jazz moved into sixth place.\n\nUP NEXT\n\nThunder: Host the Indiana Pacers on Wednesday.\n\nGrizzlies: Host the Golden State Warriors on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994550.741174
}