{
  "game_id": "0022000563",
  "espn_id": "401297409",
  "date": "Feb 19, 2021",
  "matchup": "CLE vs. DEN",
  "headline": "Murray's 50 points power Nuggets past crumbling Cavaliers",
  "body": "CLEVELAND -- — Not himself of late, Jamal Murray got a lecture from Nuggets coach Michael Malone about being more aggressive and not passing up open shots.\n\n\r\n                    He listened — and launched.\n\n\r\n                    Murray scored a career-high 50 points and became the first player in NBA history to get that many without trying a free throw as Denver adjusted to a schedule change by handing the Cleveland Cavaliers their ninth straight loss, 120-103 on Friday night.\n\n\r\n                    Following the game, Murray was unaware that he had done something unique.\n\n\r\n                    “I was just making my shots,” he said nonchalantly between sips of a postgame smoothie. “It's kind of cool to make history. It's a cool stat.”\n\n\r\n                    Murray was cooler than cool. While All-Star starter Nikola Jokic added a triple-double on his birthday, it was Murray's night.\n\n\r\n                    The smooth guard made 21 of 25 shots, including 8 of 10 3-pointers and scored 30 in the second half. He added six rebounds and two steals during 38 electrifying minutes.\n\n\r\n                    “To do it as efficiently as he did it is really remarkable,” said Malone. “That's an incredible stat line.”\n\n\r\n                    With the Cavs still hanging around in the fourth, Murray made three 3-pointers in a 65-second span to push Denver's lead to 21. He celebrated his third straight long-range make — an off-balance number from 33 feet — to open the fourth by pounding his chest and screaming toward fans in Rocket Mortgage FieldHouse.\n\n\r\n                    “That's what we live for as players,” Murray said, “that atmosphere.”\n\n\r\n                    Murray scored Denver’s first 13 in the last quarter, and then passed his previous career best of 46 points by draining another 3 — on Jokic’s 10th assist — with 4 minutes left. Murray capped his incredible performance with a resounding dunk before being replaced with 2:23 left.\n\n\r\n                    Collin Sexton scored 23 and Jarrett Allen 20 for Cleveland, which had a couple days to prepare for the Nuggets but still couldn’t stop them.\n\n\r\n                    Not the way Murray was shooting.\n\n\r\n                    The Cavs tried several different defenders on Murray, who was hardly bothered.\n\n\r\n                    “It never matters,” he said.\n\n\r\n                    After a strong start, the Cavs have fallen near the bottom of the Eastern Conference standings.\n\n\r\n                    “With the exception of Murray, we took some steps in the right direction,” Cavs coach J.B. Bickerstaff said.\n\n\r\n                    Michael Porter Jr. added 22 points for the Nuggets. Jokic celebrated turning 26 with 16 points and 12 rebounds in getting his seventh triple-double this season.\n\n\r\n                    A stopover in Cleveland was not originally part of Denver's travel itinerary for a four-game trip. However, when the league postponed three San Antonio games — including one against the Cavs on Wednesday — earlier this week because of virus cases on the Spurs, the Nuggets were re-routed.\n\n\r\n                    They made their first 12 shots, opened a 22-point lead in the second half and then let Murray close out the Cavs.\n\n\r\n                    The Nuggets thrashed the Cavaliers on Feb. 10, beating them by 38 points and prompting Bickerstaff to criticize his players for being “embarrassed.” He expected a better effort in the rematch between the teams.\n\n\r\n                    “I hope our guys respond,” he said 90 minutes before tip.\n\n\r\n                    Cleveland played better, but didn't have enough firepower to stay with the Nuggets.\n\n\r\n                    Or Murray.\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: F JaMychal Green injured his left shoulder running through a pick in the first minute. ... Green was starting for Paul Millsap, who sat out his third game in a row with a sprained left knee. ... Jokic is the Nuggets' first All-Star starter since Carmelo Anthony in 2011 and the third Denver player since 1976-77 to be selected to three consecutive games, joining Alex English and David Thompson. Jokic learned of his All-Star nod while the team was having dinner Thursday night. Coach Michael Malone was moved by the “genuine excitement” everyone felt for Jokic, who is posting career highs across the board. \n\n\r\n                    Cavaliers: F Taurean Prince missed his second straight game with a sprained left ankle. ... F Kevin Love (strained calf) took part in practices the past few days and is nearing a return after missing most of the season. He's been out since Dec. 27. ... Cleveland's starters did not record a rebound in the first quarter.\n\n\r\n                    MORE MURRAY\n\n\r\n                    Murray’s 84% shooting is the second-highest percentage for a player scoring 50 points. Only Wilt Chamberlain’s 87% in 1967 was better.\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Continue what became a five-game trip Sunday at Charlotte.\n\n\r\n                    Cavaliers: Host Oklahoma City on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997885.684442
}