{
  "game_id": "0021800041",
  "espn_id": "401070722",
  "date": "Oct 22, 2018",
  "matchup": "TOR vs. CHA",
  "headline": "Leonard scores 22 points as Raptors rout Hornets 127-106",
  "body": "TORONTO --  A tough Toronto Raptors defense took the sting out of Charlotte's 3-point shooting.\n\nKawhi Leonard scored 22 points, Kyle Lowry had 16 points and a season-high 14 assists, and Toronto never trailed in a 127-106 victory over the Hornets on Monday night, the Raptors' fourth straight win to open the season.\n\n\"It was a high-scoring, free-shooting team coming in here,\" Raptors coach Nick Nurse said. \"We asked them to get out and contest and disrupt some of their rhythm stuff and we did a pretty good job of that.\"\n\nJonas Valanciunas scored 17 points, Danny Green had 16, and Serge Ibaka added 15 as the Raptors won their fifth straight over the Hornets. The Raptors have won nine of the past 11 meetings.\n\n\"We just were not sharp enough or physical enough defensively,\" Hornets coach James Borrego said.\n\nToronto is the first NBA team to reach four wins. Denver (3-0) can match the Raptors when it hosts Sacramento on Tuesday.\n\nThe Hornets entered having made an NBA-best 49 3-pointers through their first three games, but struggled from long range against the Raptors. Charlotte finished 9 for 28 from beyond the arc.\n\n\"You've got to give those guys a lot of credit, they played great defense,\" Hornets guard Kemba Walker. \"But at the same time, I thought we got some pretty good looks. They just didn't drop.\"\n\nCharlotte went 0 for 5 from 3-point range in the opening quarter, the first time in any quarter this season they've failed to make at least one basket from long range.\n\n\"We had some good looks early that didn't go,\" Borrego said. \"Had those dropped early, we might have had a different outcome in the first half at least.\"\n\nThe Raptors, meanwhile, made a season-best 15 3-pointers. Toronto's 39 attempts was the most in a game, so far.\n\nLeonard returned after sitting out Saturday night's road win over Washington, the second game of a back-to-back. The two-time NBA Defensive Player of the Year was limited to nine games last season because of a quadriceps injury.\n\n\"He's still not back to where he was, but there are glimpses,\" said guard Danny Green, Leonard's former teammate with San Antonio.\n\nLeonard was not available to speak to reporters following the game because he was working out.\n\nWalker scored 26 points and Jeremy Lamb had 16 as the Hornets suffered their first road loss of the season. Charlotte won at Orlando on Friday and beat Miami on Saturday.\n\n\"I thought we could have been better, but that's a great team,\" Walker said. \"They played well together.\"\n\nNicolas Batum scored 13 points, Willy Hernangomez had 11 and Malik Monk added 10 for the Hornets.\n\nBefore the game, Walker was named Eastern Conference Player of the Week after averaging NBA-bests of 35.3 points and 6.3 3-pointers. Walker's 19 3-pointers through the first three games set an NBA record.\n\n\"It's a credit to his work ethic, who he is as a person, a competitive spirit he has,\" Borrego said. \"We're in a good place with Kemba Walker.\"\n\nHELPING HAND\n\nToronto recorded a season-high 36 assists on 50 made baskets, three shy of the franchisee-high. The Raptors had 24 assists in Friday's win over Boston.\n\nALL ABOARD\n\nAll 13 Raptors players recorded at least one made basket, and 12 of the 13 had at least one assist. Malachi Richardson was the only Toronto player without one.\n\nDOUBLED UP\n\nThe Raptors led by double digits for the entire second half.\n\nTIP INS\n\nHornets: Walker won Player of the Week for the sixth time, breaking the franchise record he had shared with Gerald Wallace. ... Walker had five rebounds and five assists. ... Assistant coach Jay Triano is a former Raptors head coach and the head coach of the Canadian men's basketball team.\n\nRaptors: G Delon Wright (left thigh) missed his fourth straight game, but is expected to return Wednesday. ... Toronto outscored Charlotte 31-5 in fast break points. ... Valanciunas led Toronto with 10 rebounds. ... Leonard failed to get a double-double for the first time in three games.\n\nUP NEXT\n\nHornets: At Chicago on Wednesday night.\n\nRaptors: Host Minnesota on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994300.112013
}