{
  "game_id": "0021900040",
  "espn_id": "401160682",
  "date": "Oct 27, 2019",
  "matchup": "LAL vs. CHA",
  "headline": "AD, Dwight lead Lakers' rally to beat Hornets 120-101",
  "body": "LOS ANGELES --  The Lakers acquired two veteran NBA big men in the offseason, and they both got wild cheers for their outstanding performances Sunday night in a runaway win over Charlotte.\n\nThat's no surprise in the case of Anthony Davis, who gave Lakers fans their best look yet at his world-class talent.\n\nIn the case of Dwight Howard, it's a minor miracle how quickly he has landed in Los Angeles' good graces again.\n\nDavis had 29 points and 14 rebounds, and Howard added 16 points, 10 boards and four blocked shots in a 120-101 victory over the Hornets.\n\nLeBron James had 20 points, 12 assists and six rebounds for the Lakers, who took control of their second straight victory with an 18-2 rally starting late in the third quarter. But he was most excited afterward about their strong defensive performance and the potential for growth encapsulated in Davis and Howard.\n\n\"That's the luxury of our depth,\" James said.\n\nDavis showed off the breadth of his skills during a 25-point first half, scoring 16 points in the first quarter while dominating on both ends. After a sometimes-tentative start to his Lakers career, he was aggressive from the start against Charlotte's young frontcourt.\n\n\"I shot the ball poorly the first two games, and I was just trying to get into a rhythm,\" Davis said. \"When I get easy looks, it kind of gets me going.\"\n\nWhen Davis took a step back after halftime, James and Howard took charge. That's what the Lakers' depth allows them to do in difficult matchups, even with these partnerships and connections still new in the third game of the season.\n\nWhile James orchestrated the offense, Howard put in an impressive all-around performance that drew multiple ovations from the same fan base that booed him relentlessly for the past six years after he left the Lakers in free agency. Now back as a reserve center, Howard has already turned the tide with his dunks, defense and overall effort in the team's first two home games.\n\nWhen Howard blocked a shot into the crowd and did a Mutombo finger-wag while flashing his famous smile, Lakers fans jumped from their seats to cheer.\n\n\"I wasn't thinking about anything but doing whatever I can to help the team win, keep the crowd energized,\" Howard said. \"Great things happen when you do that. I'm just going to keep doing whatever it takes and enjoy every moment on the court.\"\n\nMiles Bridges scored 23 points, while Cody Zeller and Terry Rozier added 19 apiece for the Hornets in the opener of a four-game road trip. Charlotte's 1-for-12 shooting on 3-pointers in the third quarter allowed the Lakers to break it open.\n\n\"We were trying to get out in front of the situation, but they're a championship-level team,\" Bridges said. \"It was a close game. They've got veterans. They did what they did, and we showed our youth a little bit.\"\n\nBridges scored 15 points in the first half, but Los Angeles held the Hornets to 39 points after halftime.\n\n\"I thought we competed tonight,\" Charlotte coach James Borrego said. \"I thought we were great. ... (Bridges) really stood out to me tonight (with) his maturity, the way he's grown, the presence he has, the way he attacked them. He took on that challenge of guarding LeBron, and I thought he was great tonight.\"\n\nAD'S OPENER\n\nDavis was dominant from the start, racking up his 16 points in the first quarter on 6-of-8 shooting. He hit three 3-pointers and grabbed six rebounds during his huge first half.\n\nHe even persevered after Zeller and Davis accidentally elbowed each other in the face while fighting for a rebound with 2:10 to play. Zeller got a loose ball foul after a long video review, but he was in the Hornets' locker room getting help for a cut.\n\nQUIET START\n\nJames didn't score his first points until he hit two free throws 1:40 before halftime, and he got his first field goal with a layup on LA's next possession.\n\nJames was mostly a facilitator until the fourth quarter, when he scored his 10th point on a layup with 9:57 left. James hasn't been held under 10 points in a regular-season game since Jan. 5, 2007, although it also happened twice in the playoffs in the nearly 13 years since.\n\nTIP-INS\n\nHornets: Devonte Graham converted a four-point play in the second quarter. He finished with nine points after scoring 23 and 24 in the Hornets' first two games. ... Nicolas Batum missed his second straight game with a broken finger on his left hand. The big man got hurt in Charlotte's season opener.\n\nLakers: Kentavious Caldwell-Pope finished with 10 points after he ended his 0-for-11 start to the season from the field with three straight baskets in the second quarter. ... The backup point guards both played well. Quinn Cook had 12 points and eight assists, and Alex Caruso added five points and two assists.\n\nUP NEXT\n\nHornets: Stay in town to face the Los Angeles Clippers on Monday night.\n\nLakers: Host the Memphis Grizzlies on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996041.22744
}