{
  "game_id": "0022200187",
  "espn_id": "401468342",
  "date": "Nov 12, 2022",
  "matchup": "TOR @ IND",
  "headline": "Pacers use big fourth quarter to beat Raptors 118-104",
  "body": "INDIANAPOLIS -- — Buddy Hield scored 22 points, Myles Turner had 19 points and 10 rebounds, and the Indiana Pacers used a dominant fourth quarter to beat the Toronto Raptors 118-104 on Saturday night.\n\n\r\n              Tyrese Haliburton shook off a 3-for-14 shooting night with 15 assists for the Pacers, who outscored the Raptors 36-14 in the final 12 minutes. \n\n\r\n              “The game changed when our fight changed,” Indiana coach Rick Carlisle said. “Every distraction you can imagine, we were coming up with some reason to complain about something in the first half. It was ugly. It’s not the culture we are building. The second half looked like us. It’s a win that feels good.”\n\n\r\n              Jalen Smith finished with 16 points and rookie Bennedict Mathurin had 15 for Indiana.\n\n\r\n              “I thought we got enough stops that we could run,” Haliburton said. “Law of averages, they’ll fall. We just stayed with it and played with better aggression in the second half.”\n\n\r\n              O.G. Anunoby scored 26 points for the short-handed Raptors, who led 90-82 after three quarters before the Pacers blew by them as Toronto matched its lowest-scoring quarter of the season.\n\n\r\n              Missing the injured Pascal Siakam and the ill Fred VanVleet, Toronto shot 6 for 21 in the final period, missing eight of nine 3-point attempts. \n\n\r\n              The surprising Pacers made 19 3-pointers to get back to .500. \n\n\r\n              “You’re never going to win a game when you get beat 19-7 at the 3-point line,” Raptors coach Nick Nurse said. “A lot of those things happened in transition. A lot of them happened in the second half. We weren’t getting back enough in transition.”\n\n\r\n              After Toronto went ahead by 15 in the first minute of the third quarter, the Pacers reeled off a 20-6 run to get back in it. The Raptors eventually drew a third foul on Turner, forcing him to sit the final four minutes, and carried an eight-point lead into the final period.\n\n\r\n              Hield made all three shots in the fourth, including both 3-point attempts. Haliburton made one with his feet just in front of the Pacers’ logo at midcourt to give Indiana a 107-101 lead with 3:17 to go. \n\n\r\n              “We had a really bad fourth quarter,” Nurse said. “Just everything went their way, and nothing went our way.”\n\n\r\n              Haliburton ended up with eight points and six rebounds for Indiana, which shot 50% from the field to overcome 21 turnovers.\n\n\r\n              Toronto shot 39%.\n\n\r\n              TIP-INS\n\n\r\n              Raptors: Siakam, a third-team All-NBA selection last season when he averaged 22.8 points, 8.5 rebounds and 5.3 assists, missed his fifth straight contest due to a strained right adductor muscle. VanVleet, averaging 18.4 points and 6.8 assists, had an illness unrelated to COVID-19. … Chris Boucher had 19 points and seven boards.\n\n\r\n              Pacers: The 39 points Toronto scored in the second quarter were the most the Pacers had allowed in any quarter this year. ... Indiana finished with a 61-49 edge in rebounding. ... Four bench players had at least eight points.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Conclude their three-game road trip Monday against Detroit.\n\n\r\n              Pacers: At Charlotte on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994095.164454
}