{
  "game_id": "0022400340",
  "espn_id": "401704906",
  "date": "Dec 07, 2024",
  "matchup": "CLE @ CHA",
  "headline": "Mobley scores career-high 41 points as Cavaliers beat Hornets 116-102",
  "body": "CHARLOTTE, N.C. -- — Evan Mobley scored a career-high 41 points, Donovan Mitchell added 18 points, eight rebounds and eight assists, and the Cleveland Cavaliers extended their strong start with a 116-102 victory over the injury-riddled Charlotte Hornets on Saturday.\n\n\r\n              Mobley scored 23 points as the Cavaliers built a 40-18 lead after the first quarter en route to their 21st victory in 24 games. The forward then had seven points in a late 12-2 surge as Cleveland held on.\n\n\r\n              Brandon Miller scored 24 points for Charlotte, which got as close as 104-100 with 5:05 left to play in its eighth straight loss. \n\n\r\n              Takeaways \r\n              Cavaliers: The Cavaliers won their fourth straight game since a two-game losing streak in late November and continued their franchise’s best start since the 2008-09 season.\n\n\r\n              Hornets: The Hornets suited up nine players from their 15-player active roster. Probable starters LaMelo Ball (left calf strain), Miles Bridges (right knee bruise) and Nick Richards (right ankle sprain) were out. Reserve Grant Williams (torn knee ligament) told reporters before the game he would be having reconstructive knee surgery on Wednesday in Chicago with a recovery time of eight to 12 months.\n\n\r\n              Key moment\r\n              The Cavs scored on five straight possessions as part of the 12-2 surge that pushed their lead back up to 116-102 after the Hornets had closed within four. with 1:46 left. \n\n\r\n              Key stat\r\n              The Cavaliers have scored triple figures in all 24 games this season and lead the NBA in scoring average at 121.8 points per game. Their lowest total this season was 101 in a 117-101 loss at Atlanta on Nov. 29.\n\n\r\n              Up next\r\n              The Cavaliers visit Miami on Sunday and the Hornets visit Indiana on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998321.490776
}