{
  "game_id": "0022201056",
  "espn_id": "401469211",
  "date": "Mar 18, 2023",
  "matchup": "ORL @ LAC",
  "headline": "Fultz, Magic rally in 4th quarter, outlast Clippers 113-108",
  "body": "LOS ANGELES -- — Markelle Fultz scored 12 of his 28 points in the fourth quarter, Wendell Carter Jr. had 27 points and 12 rebounds, and the Orlando Magic snapped their two-game skid with a 113-108 victory over the Los Angeles Clippers on Saturday.\n\n\r\n              Franz Wagner scored 20 points and hit a gutsy 3-pointer with 40 seconds to play for the Magic, who had lost five of six before securing one of their most impressive road wins of the season. Orlando scored 39 points in the final period, including 18 in the final 3:52.\n\n\r\n              Orlando coach Jahmal Mosley said the offensive performance “ranks up there” among the Magic's best.\n\n\r\n              “But to be honest with you, I'm happier that we finally sat down and guarded in the fourth quarter,” Mosley added. “Our guys did a great job of finally putting it all together down the stretch.”\n\n\r\n              Fultz had another impressive game in his late-season surge, going 10 for 17 and grabbing six rebounds. He got all 12 of his fourth-quarter points in the final 4:36.\n\n\r\n              “It was huge, especially because we've had moments like this in the past where we didn't close out,” Fultz said. “To put together a whole game and weather their runs and continue to push it was big tonight. It just shows what we're capable of when we stay locked in the whole game.”\n\n\r\n              Paul George scored 30 points for the Clippers, whose four-game winning streak ended on the last contest of a five-game homestand.\n\n\r\n              Kawhi Leonard skipped the game to rest his right knee, sitting out for the 29th time in the Clippers’ 71 games. Los Angeles missed a chance to move within a half-game of Phoenix in fourth place in the Western Conference standings.\n\n\r\n              Ivica Zubac had 16 points and 16 rebounds for LA on his 26th birthday, grabbing his 3,000th career rebound in the first half. Head coach Tyronn Lue didn't feel well after the game, and associate head coach Dan Craig filled in for him at the news conference.\n\n\r\n              Orlando took the lead midway through the fourth quarter with an 11-2 run and eventually went up 104-99 with 1:49 left on Carter's difficult layup. Carter then dramatically blocked a layup attempt by Russell Westbrook, leading to a layup by Fultz.\n\n\r\n              “What you’re seeing from me is a guy that doesn’t take anything for granted,” said Fultz, who is healthy after struggling with numerous major injuries in the first five seasons of his NBA career. “I feel like I have a high ceiling. I have so much room to grow.”\n\n\r\n              George hit a 3-pointer with 1:03 left to trim Orlando's lead to 106-104, but Wagner answered with his own 3. Fultz made a tough layup in traffic to maintain Orlando's lead, and George finally missed a late 3-point attempt to seal it.\n\n\r\n              Westbrook played the entire fourth quarter in Leonard's absence, but scored just three points — making his only field goal with 10:45 to play — and committed two turnovers. Westbrook said the loss is “on me.”\n\n\r\n              “He’s going to get through it,” George said. “(Westbrook) knows that we trust him and got his back. ... I know the value he brings to the team. He plays hard, and that’s a guy that I want to roll with and compete with.”\n\n\r\n              Leonard averaged 31.5 points per game during the Clips' four-game winning streak, but the franchise is sticking to its plan not to play its star in back-to-back games. Sixth man Norman Powell also missed his sixth straight game for LA with a shoulder injury.\n\n\r\n              TIP-INS\n\n\r\n              Magic: Jalen Suggs sat out with a possible concussion. Mosley said Suggs got elbowed in the head in the first quarter Thursday in Phoenix, and he felt apparent symptoms after the game. ... Rookie Paolo Banchero had 12 points on 4-for-11 shooting.\n\n\r\n              Clippers: Powell has been out since March 2 and still hasn't returned to practice. ... Westbrook had 14 points and nine assists with six turnovers. George also had six turnovers, while the rest of LA's roster combined had three.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Lakers on Sunday.\n\n\r\n              Clippers: At Portland on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994314.5906692
}