{
  "game_id": "0021800152",
  "espn_id": "401070833",
  "date": "Nov 06, 2018",
  "matchup": "MIL @ POR",
  "headline": "McCollum scores 40 as Trail Blazers beat Bucks 118-103",
  "body": "PORTLAND, Ore. --  In search of his jump shot, CJ McCollum watched every single 3-pointer he took last season looking for what he lost.\n\nFortunately for the Portland Trail Blazers, he found it.\n\nMcCollum scored 40 points and Portland beat Milwaukee 118-103 on Tuesday night to hand the Bucks their second loss in 10 games this season.\n\n\"Whether I play well or not, I know how much time I spend preparing,\" McCollum said. \"The only thing I saw was I had a lot of in-and-outs and I was shooting with a dead wrist. That was the only thing I noticed. I wasn't locking my wrist out, so I just tried to lock my wrist out.\"\n\nThe result was a dazzling performance against one of the NBA's best teams early this season.\n\n\"A lot of credit to CJ. He had a heck of a night,\" Bucks coach Mike Budenholzer said. \"Any time we made a bit of a run or felt like the momentum might be changing, McCollum hit a big shot.\"\n\nMcCollum, who entered shooting well below his career averages, went 17 for 26 from the field and added six assists.\n\n\"It was tough,\" Milwaukee big man Brook Lopez said. \"He made some huge plays and some tough shots that definitely were contested.\"\n\nEvan Turner had 16 points and 11 rebounds off the bench for the Blazers (8-3).\n\nGiannis Antetokounmpo led the Bucks with 23 points and nine rebounds. Lopez shot 6 for 10 from 3-point range and finished with 22 points.\n\nIn the third quarter, McCollum put on a show. He scored 19 points and made Bucks rookie guard Donte DiVincenzo fall down on a crossover move before hitting a basket, sending the crowd into a frenzy.\n\n\"Welcome to the league,\" Blazers center Jusuf Nurkic said. \"It can be hard some nights. Put some ice and you'll be fine.\"\n\nPortland led by 14 after three.\n\nPlay began at a fast pace that carried on throughout in a meeting between two of the top five offenses in the NBA. With only 16 foul shots combined, the game took less than two hours.\n\nPortland outscored the Bucks 33-31 in the first quarter as both teams shot better than 50 percent from the floor and the 3-point line.\n\nTIP-INS\n\nBucks: Now with Budenholzer in charge, Milwaukee is playing a much different style this season. After being a bottom-five team in 3-point attempts last season, the Bucks came in second in the NBA in 3-point tries with 41 per game. That included their 117-113 loss at Boston in which they put up 55 shots from beyond the arc. \"Yeah, it's a lot,\" Budenholzer said. \"The game is always evolving with teams, coaches and players trying to figure out what gives them the best chance. The skill of players now today is special, so trying to push that envelope.\"\n\nTrail Blazers: One of the biggest changes for the Trail Blazers this season has been utilizing Turner as the primary ball-handler on their second unit. The results have led to one of the best bench units in the NBA so far, ranking ninth in scoring. \"The second unit comes in, their ball movement, their execution -- they're playing with each other,\" Budenholzer said. \"They take advantage if the defense overcommits or over-rotates. They're playing really well together. Evan Turner is kind of a great setup guy with that group. It's interesting to see how they've changed a little bit and how it's working for them.\"\n\nUP NEXT\n\nBucks: At the Golden State Warriors on Thursday.\n\nTrail Blazers: Host the Los Angeles Clippers on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994530.256858
}