{
  "game_id": "0022000431",
  "espn_id": "401267591",
  "date": "Feb 16, 2021",
  "matchup": "LAL @ MIN",
  "headline": "James, Lakers, minus Davis, fend off Timberwolves 112-104",
  "body": "MINNEAPOLIS -- — The Los Angeles Lakers strengthened their rotation during the abbreviated offseason, realizing that defending their NBA title amid the ongoing pandemic would require ample depth.\n\n\r\n                    The absence of Anthony Davis will give their enhanced roster an extended test.\n\n\r\n                    LeBron James had 30 points, 13 rebounds and seven assists and Dennis Schröder scored 24 points, helping the Lakers beat the Minnesota Timberwolves 112-104 on Tuesday night.\n\n\r\n                    “We’re not expecting one person to try to pick up A.D.’s productivity. Nobody’s going to be able to do that. He just brings too much to the table. But we all can do more,” James said.\n\n\r\n                    Montrezl Harrell pitched in 17 points for the Lakers, who stopped a seven-game losing streak at Minnesota with their first win at Target Center since March 25, 2015. The energy and production provided by the four new players on the 2020-21 squad — Schröder and Marc Gasol with the starters and Harrell and Wes Matthews off the bench — was palpable.\n\n\r\n                    “We’re going to attack this stretch of games and be confident in what we have on this roster, embrace the challenge of playing without A.D. Every guy has got to step up,” coach Frank Vogel said.\n\n\r\n                    Minnesota rookie Anthony Edwards had a career-high 28 points. The Lakers otherwise played sound defense in the first of what will be several games without Davis, the seven-time All-Star who was shelved with an injury to his Achilles tendon. He aggravated it in a loss at Denver on Sunday that ended the Lakers' seven-game winning streak.\n\n\r\n                    The Lakers were far from sharp — James had four of his five turnovers in the first quarter — but efficient enough on offense to emerge victorious over the team with the worst record in the league.\n\n\r\n                    “You’ve got to do nearly everything right to come out with a victory against them,” Timberwolves coach Ryan Saunders said.\n\n\r\n                    Ricky Rubio and Jordan McLaughlin each scored 13 points for the Timberwolves, sharing time at point guard in the continued absence of D’Angelo Russell, who will miss the next four to six weeks after surgery on his left knee.\n\n\r\n                    Karl-Anthony Towns scored a quiet 15 points for the Timberwolves, who were outscored 17-5 to start the fourth quarter after a spirited effort over the first three periods. Towns didn’t even get a shot in the fourth, with Edwards taking over.\n\n\r\n                    “I know Ant had it going, but I’m the point guard out there and I’ve got to know who to get the ball to,” Rubio said.\n\n\r\n                    Harrell's defense on Towns had something to do with that, too, despite giving up four inches.\n\n\r\n                    “I don’t really believe in that smaller stuff, because at the end of the day if you believed in that, man, then the elephant would be the king of the jungle,” Harrell said.\n\n\r\n                    FINISHING STRONG\n\n\r\n                    Edwards, the first overall pick in the draft, hit his fourth and fifth 3-pointers of the game to cut the lead to 105-100 with 3:28 to go. Edwards was called for a charging foul on James, knocking the four-time league MVP over and negating a runner in the lane with 2:57 left, and the Timberwolves never got any closer.\n\n\r\n                    “He’s playing at a great level, and we’re trying to build confidence in him and let him know that we believe in him,” Towns said.\n\n\r\n                    NO GO\n\n\r\n                    The Lakers won the first meeting in Los Angeles by 36 points on Dec. 27, when Towns was out with a dislocated wrist. The absence of Davis from this one meant yet another missed matchup of two of the NBA's best big men — and first overall draft picks out of Kentucky, three years apart. The Lakers' visit to Minnesota last season was wiped out by the pandemic.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Davis is unlikely to return before the All-Star break, Vogel said. The cautious approach means Davis, whose official diagnosis is a right calf strain, would miss at least eight more games. ... Gasol played a season-high 30 minutes.\n\n\r\n                    Timberwolves: Jarrett Culver, who missed his 12th consecutive game with a sprained left ankle, has been upgraded to on-court activity. The team said he could return to action late next week. ... Malik Beasley had 11 points on 4-for-15 shooting after averaging 25 points over his last four games.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Return to Los Angeles to face Brooklyn on Thursday.\n\n\r\n                    Timberwolves: Host Indiana on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997310.312482
}