{
  "game_id": "0021900761",
  "espn_id": "401161403",
  "date": "Feb 05, 2020",
  "matchup": "MEM @ DAL",
  "headline": "Morant leads short-handed Grizzlies past Mavericks, 121-107",
  "body": "DALLAS --  The Memphis Grizzlies are making big strides on the court and significant moves off it.\n\nJa Morant scored 21 points, Jaren Jackson Jr. and Tyus Jones added 19 apiece, and the short-handed Grizzlies beat the Dallas Mavericks 121-107 on Wednesday night to move over .500 for the first time this season.\n\nDillon Brooks had 18 points for Memphis, which took advantage of Luka Doncic's absence for Dallas despite playing without forwards Jae Crowder and Solomon Hill. They left the team before the game due to pending trades that also included Andre Iguodala, who elected not to play for the Grizzlies after being acquired from Golden State last offseason.\n\nJustise Winslow is headed to Memphis from the Miami Heat in a deal for Iguodala, according to reports.\n\nBrooks said he was glad that situation has been resolved. A few days ago, he said he welcomed the chance to play against Iguodala.\n\n\"Now we have a player that we're getting that actually wants to play with us and thinks we're good,\" Brooks said.\n\nAfter their win, the Grizzlies announced that Brooks signed a multi-year contract extension. ESPN.com reported it was for $35 million over three years.\n\nThe third-year swingman is averaging a career-best 16.1 points, 3.4 rebounds and 2.1 assists in 28.4 minutes through 51 games. He is the only Memphis player to play and start in every game this season.\n\nMorant said he didn't care that the Iguodala drama with the Grizzlies has apparently ended.\n\n\"That's in the past. It's over with,\" he said. \"We're going to play with the players that's on the floor.\"\n\nThe surging Grizzlies (26-25) won for the 13th time in 16 games. Looking for their first playoff berth since 2017, they lead Portland by three games for the final postseason spot in the Western Conference.\n\n\"They believe in each other. They believe in their teammates,\" first-year Grizzlies coach Taylor Jenkins said. \"I know that's kind of cliche to say, whatever, but it's the fact.\"\n\nKristaps Porzingis had 32 points and 12 rebounds for the Mavericks in his third straight 30-point game. Porzingis left briefly with 4:06 remaining in the third quarter with a bloody nose after being elbowed by Josh Jackson while going for a rebound.\n\n\"It's broken, but it's OK,\" Porzingis said. \"I really didn't have a headache or anything.\"\n\nPorzingis exited after Memphis broke a 71-all tie and rattled off 10 straight points. The Grizzlies' run increased to 21-3 for a 92-74 lead with 1:22 left in the period, and they led by as many as 25 in the fourth quarter.\n\nThe Mavericks (31-20) were trying to reach 13 games over .500 for the first time this season.\n\n\"Ugly game for us,\" coach Rick Carlisle said.\n\nThe Mavericks played their fourth straight game since Doncic, the second-year guard voted an All-Star starter, sprained his right ankle in practice last Thursday. They are 2-2 in those games and 4-5 this season minus Doncic, including the Dec. 14 game vs. Miami in which he left two minutes in with a sprained ankle.\n\nTIP-INS\n\nGrizzlies: Jones' 19 points were a career high. ... Jenkins, who grew up in Dallas, met with family before and after the game and with student journalists from his high school, St. Mark's School of Texas. ... The Grizzlies have won three straight road games over Dallas for the first time.\n\nMavericks: Seth Curry missed his second straight game with left knee tightness, and J.J. Barea sat out after leaving Dallas' previous game Monday night in the second quarter with a sprained left ankle.\n\nTHE INSIDE STORY\n\nThe Grizzlies went into play averaging an NBA-high 56.4 points in the paint, 49.9% of their scoring. They scored 60 in the paint Wednesday, for 49.6%. It was the 21st time this season they've scored at least 60 points in the paint.\n\nTHE OUTSIDE STORY\n\nThe Mavericks' strength has been just the opposite, with a league-high 39% of their scoring coming from behind the 3-point arc. On Wednesday, they scored 47.7% of their points on 17 3-pointers, led by Porzingis' five (one short of his career high).\n\nUP NEXT\n\nThe Grizzlies play the middle game of a three-stop road trip at Philadelphia on Friday.\n\nThe Mavericks visit Washington on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995701.2516139
}