{
  "game_id": "0022300568",
  "espn_id": "401585196",
  "date": "Jan 16, 2024",
  "matchup": "LAC vs. OKC",
  "headline": "George scores season-high 38 points to lead Clippers over Thunder 128-117 for 9th win in 11 games",
  "body": "LOS ANGELES -- — Paul George scored 18 of his season-high 38 points in the fourth quarter and the Los Angeles Clippers beat the Oklahoma City Thunder 128-117 on Tuesday night for their ninth win in 11 games.\n\n\r\n              Kawhi Leonard and James Harden added 16 points apiece to complete a big day for the franchise. Earlier, Commissioner Adam Silver announced the 2026 All-Star Game will be held at the Clippers’ under-construction arena in Inglewood, where they begin play next season.\n\n\r\n              Jalen Williams scored 25 points and Lu Dort and Shai Gilgeous-Alexander each added 19 points for the Thunder, the West's No. 2 team that has dropped two in a row after winning nine of 12 coming into Los Angeles.\n\n\r\n              “We gave ourselves every chance to win that game and they outplayed us in the final 3 1/2 minutes,” Thunder coach Mark Daigneault said. “That's how you learn about ourselves. It's exciting to know that we're drawing teams' best punches out of them.”\n\n\r\n              After trailing by 13 points in the third, the Thunder stormed back to lead 115-114 on a 3-pointer by Williams. \n\n\r\n              That's when George took over.\n\n\r\n              He scored 11 of the Clippers' final 14 points for an empathetic end to what started out as a back-and-forth game early in the fourth. He hit two 3-pointers and ended the surge with a steal and one-handed dunk.\n\n\r\n              “Once I see the ball going in, I feel confident and ultra-aggressive,” George said. “Throughout my career, it takes a couple (shots) to kind of ease into the game.\" \n\n\r\n              George hit six 3-pointers, grabbed seven rebounds and had five assists to go with three steals and no turnovers.\n\n\r\n              “Him taking over that fourth and just putting his will on the game gets us over that hump,” Leonard said. “He made shots and he made defensive plays as well.”\n\n\r\n              The Thunder closed to 79-77 in the third on a 9-0 run that began and ended with 3-pointers by Isaiah Joe.\n\n\r\n              The Clippers answered with a 20-12 run capped by consecutive 3-pointers by Daniel Theis and Norman Powell to lead 99-89 going into fourth.\n\n\r\n              “We responded well,” Clippers coach Tyronn Lue said. “To hold onto the lead and make our own run says a lot about our team.”\n\n\r\n              Clippers center Ivica Zubac missed his second straight game with a right calf strain and will be re-evaluated in a month. Mason Plumlee had 14 points in his first start of the season in Zubac’s place.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Utah Jazz on Thursday.\n\n\r\n              Clippers: Host the Brooklyn Nets on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996551.787211
}