{
  "game_id": "0022401121",
  "espn_id": "401705687",
  "date": "Apr 04, 2025",
  "matchup": "TOR vs. DET",
  "headline": "Pistons wrap up their first playoff spot since 2018-19 with 117-105 victory over the Raptors",
  "body": "TORONTO -- — Tim Hardaway Jr. scored 23 points, Jalen Duren had 21 points and 18 rebounds and the Detroit Pistons beat the Toronto Raptors 117-105 on Friday night to wrap up their first playoff berth since 2018-19.\n\n\r\n              Malik Beasley scored 21 points for the Pistons, and Dennis Schroeder added 16.\n\n\r\n              Detroit won a franchise-worst 14 games last season, enduring an NBA-record 28-game losing streak in the process. \n\n\r\n              All-Star guard Cade Cunningham remained sidelined because of a bruised left calf, missing his sixth straight game. The Pistons also were without Tobias Harris (right heel).\n\n\r\n              Ja’Kobe Walter scored 22 points for Toronto. Immanuel Quickley and Jamal Shead each had 14 as the Raptors lost their third straight.\n\n\r\n              Toronto’s Scottie Barnes (right hand) was not available on the second night of a back-to-back, while RJ Barrett and Ochai Agbaji both sat for rest. \n\n\r\n              The Raptors lost their 50th game, the eighth time in 30 seasons they’ve lost at least 50. Toronto has lost 50 or more in back-to-back years for the first time since its first three NBA seasons, from 1995-96 to 1997-98.\n\n\r\n              Takeaways\r\n              Pistons: Isaiah Stewart served the second game of a two-game suspension for his role in a March 30 altercation at Minnesota. Ron Holland II and Marcus Sasser returned after serving their one-game penalties in Wednesday’s loss at Oklahoma City.\n\n\r\n              Raptors: Coach Darko Rajakovic said Brandon Ingram (left ankle) is improving but isn’t likely to return this season. Rajakovic also said Gradey Dick (bone bruise, right knee) will not play in Toronto’s final four games. The second-year guard has been out since March 2.\n\n\r\n              Key moment\r\n              Toronto used a 9-0 spurt to cut the deficit to four, 95-91, with 8:13 left in the fourth quarter. Ausar Thompson scored twice as the Pistons answered by scoring eight of the next 10 points.\n\n\r\n              Key stat\r\n              The Pistons have won six consecutive meetings with the Raptors. \n\n\r\n              Up next\r\n              Detroit hosts Memphis on Saturday. Toronto visits Brooklyn on Sunday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998328.356083
}