{
  "game_id": "0021700191",
  "espn_id": "400974942",
  "date": "Nov 12, 2017",
  "matchup": "DAL @ OKC",
  "headline": "George, Westbrook lead Thunder past Mavericks, 112-99",
  "body": "OKLAHOMA CITY --  With Oklahoma City down a superstar and a second starter, the Thunder's other two superstars pushed aside the Dallas Mavericks.\n\nPaul George scored 37 points, Russell Westbrook added 27 points and the Thunder overcame the absence of Carmelo Anthony and Steven Adams to beat the Mavericks 112-99 on Sunday night. George was 7 of 12 from 3-point range.\n\nAnthony was ruled out about an hour before tipoff because of a sore lower back, and Adams, Oklahoma City's starting center, sat out a second straight game with a right calf contusion.\n\nWithout Anthony, George and Westbrook carried the offensive load, fueling a 26-10 run in the third quarter that broke open what had been a tight game. Oklahoma City improved to 6-7, winning its second straight after four consecutive losses.\n\n\"I thought defensively, it was our best game from start to finish,\" Thunder coach Billy Donovan said. \"I thought we played a complete game defensively. Offensively, I thought we turned it over too much in the first half . but in the second half, offensively and defensively, we played really, really well. ... To come out and play the way they did, being down two starters, I thought they did a great job, all the way through, from top to bottom.\"\n\nHarrison Barnes had 22 points and 13 rebounds, and Yogi Ferrell had 18 points for the Mavericks. They have dropped nine of their last 10 games to fall to 2-12. Dallas is in a particularly tough portion of its schedule, having lost both ends of a back-to-back against Cleveland and Oklahoma City, and with games against San Antonio and Minnesota looming.\n\nOklahoma City led 44-42 after a subpar offensive first half for both teams. Westbrook and George combined to go 5 of 18 from the field in the half, but combined to score 32 of the Thunder's 39 points in the decisive third quarter.\n\nWith the game tied 48-48 in the third quarter, Westbrook scored on a drive, and then George blew by Dirk NowitzkI for a dunk that led to a Dallas timeout. That started the Thunder's big run, which included three 3-pointers by Westbrook and another by George. Westbrook's final 3-pointer during that stretch put Oklahoma City up 74-58 with 3:35 left in the quarter.\n\nGeorge's 3-pointer with 11:25 left in the game pushed the Thunder's advantage to 88-67. He deflected much of the praise for the win to the Thunder's younger players.\n\n\"We've got to be ready for anything,\" George said. \"When Steven went down, Dakari (Johnson) stepped up. Melo went down and it was a huge contribution from a bunch of guys. Josh (Huestis) stepped up, Jerami (Grant) stepped up. We've got to be that team. We're fortunate to have two other guys who can take the (scoring) load, but it's even better when we've got young guys who can step up and help the team.\"\n\nA 9-2 run, capped by Ferrell's 3-pointer, pulled Dallas within 97-84 with 5:56 left but the Mavericks came no closer. Dallas coach Rick Carlisle said the Mavericks have to improve how they play in the third quarter.\n\n\"We've got to fix it,\" he said. \"It's got to become a mentality. We have to just do better in all areas. We're suffering with turnovers, missed shots -- that's just going to happen in the NBA. You can't bellyache about missed shots, but your defense has to be consistent. You have to execute and take care of the ball. You have to be able to stop the other team. Tonight, giving up 39 in the third, that was the game.\"\n\nTIP-INS:\n\nMavericks: Devin Harris missed the game because of bruised ribs he suffered in a loss Saturday to Cleveland. ... The Mavericks went 11 of 37 from 3-point range and have had at least nine 3-pointers in all 14 of their games. ...Official Sean Corbin issued technical fouls to both Dirk Nowitzki (in the second quarter) and Carlisle (between the third and fourth quarters).\n\nThunder: On his 29th birthday, Westbrook chose to wear a pair of neon orange Air Jordan shoes during the first half before switching to a pair of black-and-blue Air Jordans for the second half. ... The Thunder made a season-high 15 3-pointers, in 32 attempts. ... Jerami Grant was given his first start of the season in place of Anthony. ... Rookie Dakari Johnson started at center for the second straight game in place of Adams and matched up against NBA legend Nowitzki in the post to begin the game.\n\nHOT-HEADED NOWITZKI\n\nNowitzki appeared to accidentally hit Grant in the face as Grant went up for a dunk midway through the second quarter. At first, officials ruled it a common foul, but the Thunder asked for a review and the play then was ruled as a flagrant foul.\n\nNowitzki wasn't amused and uttered some choice words at Corbin, who slapped the 20-year veteran with a technical foul. Carlisle stepped in between Corbin and Nowitzki and guided his player back to the Mavericks' bench.\n\nUP NEXT:\n\nMavericks: Host San Antonio on Tuesday night to start a four-game homestand.\n\nThunder: Host Chicago on Wednesday night to wrap up a three-game homestand.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993971.231479
}