{
  "game_id": "0022300668",
  "espn_id": "401585296",
  "date": "Jan 29, 2024",
  "matchup": "PHI @ POR",
  "headline": "Grant has 27 and Blazers beat the 76ers 130-104 as Embiid nurses sore left knee",
  "body": "PORTLAND, Ore. -- — Jerami Grant scored 27 points and the Portland Trail Blazers took advantage of reigning NBA MVP Joel Embiid's absence to beat the Philadelphia 76ers 130-104 on Monday night. \n\n\r\n              Malcolm Brogdon added 24 points and nine assists for the Blazers, who had lost four of their previous five games. Rookie Scoot Henderson had 22 points. \n\n\r\n              “I think every time we step out there we're getting better and better,” said Jabari Walker, who led all players with 12 rebounds. “It's exciting to see.”\n\n\r\n              Kelly Oubre Jr. had 25 points for the 76ers, who lost their third straight as Embiid watched from the bench with a sore left knee. Philadelphia was also without Tyrese Maxey. \n\n\r\n              Matisse Thybulle's 3-pointer put Portland up 98-78 as Philadelphia struggled without Embiid, who was out for a second consecutive game. At one point the Blazers went on a 19-4 run and led by 31 points in the final quarter. \n\n\r\n              It was Portland's largest margin of victory this season — and it came on the second night of a back-to-back. Portland fell to the Bulls 104-96 on Sunday. \n\n\r\n              “I just think our guys are starting to get some synergy with each other,” Blazers coach Chauncey Billups said. “They're starting to get to know each other and it's fun to watch. We just keep talking about moving it, moving it, moving it. I don't know who's shot it's going to be.”\n\n\r\n              Embiid, who is averaging 36 points and 11.4 rebounds a game, also sat out of the 76ers’ game against Denver on Saturday. He appeared to injure the knee last Thursday against Indiana. \n\n\r\n              It was Embiid’s 12th missed game this season. He can only miss five more to remain eligible for the league’s awards, including MVP, which he won last year. \n\n\r\n              Maxey missed a second straight game because of a sprained left ankle. \n\n\r\n              “Had a good start to the game, first quarter defensively was excellent. Pretty much through the second quarter too until about four minutes to go. They went on a big run, a lot of stuff at the rim and dunks and things like that. We just never really got back to guarding the ball,” 76ers coach Nick Nurse said. \n\n\r\n              Tobias Harris, who missed the last two games with the flu, closed the first quarter with a 16-foot-jumper to give Philadelphia a 28-20 lead. \n\n\r\n              Grant's layup pulled the Blazers to 36-35 but Portland couldn't pull in front until Deandre Ayton's dunk late in the first half made it 54-53. \n\n\r\n              The Blazers led 58-55 at the break and Grant led all scorers with 20 points. \n\n\r\n              Portland pushed the lead to 73-63 on Jabari Walker's layup. Brogdon put the Blazers up 80-63 with a layup midway through the third quarter.\n\n\r\n              “It was too easy for them coming out in the third quarter,” Harris said. “That hurt us. That gave them a lot of momentum, and that was when the game slipped away.\"\n\n\r\n              Patrick Beverley finished with 14 points for the Sixers, who pulled their starters midway through the final quarter. Only three Philadelphia players reached double figures. \n\n\r\n              UP NEXT\n\n\r\n              Sixers: Visit the Golden State Warriors on Tuesday night. \n\n\r\n              Trail Blazers: Host the Milwaukee Bucks and former teammate Damian Lillard, who was traded in the offseason. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996420.767429
}