{
  "game_id": "0022400772",
  "espn_id": "401705338",
  "date": "Feb 12, 2025",
  "matchup": "BKN vs. PHI",
  "headline": "Russell scores 22 points as Nets beat 76ers 100-96",
  "body": "NEW YORK -- — D’Angelo Russell had 22 points, five rebounds and four assists, and the Brooklyn Nets beat the Philadelphia 76ers 100-96 on Wednesday night in the teams' last game before the All-Star break.\n\n\r\n              Nic Claxton had 13 points, 11 rebounds and five blocks, and Cam Johnson added 16 points and six rebounds. Trendon Watford scored 18 points off the bench for Brooklyn, which won its third straight.\n\n\r\n              Quentin Grimes had 30 points and eight rebounds, and Kelly Oubre Jr. also scored 30 for Philadelphia, which lost its fifth straight and seventh in its last eight. The 76ers were playing without stars Joel Embiid (left knee) and Tyrese Maxey (right ankle sprain). \n\n\r\n              Takeaways\r\n              76ers: Philadelphia, 25th in scoring (109.4 points per game), again struggled offensively by shooting 43.2% from the field and 24% (8 for 33) on 3-pointers. Forward Paul George had two points, which tied his season low and was well below his season scoring average (16.6).\n\n\r\n              Nets: Brooklyn closed its roller-coaster first half on the upswing by getting its sixth win in seven games, keyed by Russell’s ultra-efficient performance. He made his first five shots, scored 14 first-quarter points and finished 9 for 15 from the field.\n\n\r\n              Key moment\r\n              After trailing by 11 in the second quarter, the 76ers closed the half with a 7-0 run that bulged to 16-4 and put them ahead 58-57 early in the third. Brooklyn quickly answered with a 12-2 run, keyed by Watford’s six points, and outscored Philadelphia 19-8 over the final 7:34 and did not trail again. \n\n\r\n              Key stat\r\n              The Nets have allowed fewer than 100 points in each of their past six wins.\n\n\r\n              Up next\r\n              The 76ers host Boston on Feb. 20, and Nets host Cleveland.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997978.143201
}