{
  "game_id": "0022300935",
  "espn_id": "401585563",
  "date": "Mar 11, 2024",
  "matchup": "CHI vs. DAL",
  "headline": "Doncic scores 27 but 30-point triple-double streak ends as Mavericks dominate Bulls 127-92",
  "body": "CHICAGO -- — Luka Doncic came through with yet another triple-double. About the only thing he didn't do was keep his record streak going.\n\n\r\n              Doncic had 27 points, recording another triple-double but doing so without scoring 30 for the first time in seven games, and the Dallas Mavericks rolled over the Chicago Bulls 127-92 on Monday night.\n\n\r\n              Doncic finished with 14 assists and 12 rebounds, but exited the blowout midway through the fourth quarter to end his NBA-record streak of 30-point triple-doubles at six. \n\n\r\n              “It's about winning to him,” coach Jason Kidd said. “Numbers, I don't know if they really mean anything to him today. But when he does retire, he'll look back to see the game that he was playing was at a different level than anybody else.”\n\n\r\n              Former Bulls center Daniel Gafford made all nine field goals, extending his run of consecutive made shots to 28 — seven shy of the NBA record. Wilt Chamberlain made 35 in a row for the Philadelphia 76ers from Feb. 17 to Feb. 28, 1967.\n\n\r\n              “My philosophy for sure is just being consistent, having a mindset of just going to finish everything no matter if there's somebody in front of you or if there isn't somebody in front of you,” Gafford said. “At the end of the day, either dunking it or putting it in the rim.”\n\n\r\n              Doncic set the tone as Dallas outscored Chicago by 28 in the first quarter. The Mavericks gave up a season low in points while handing the Bulls their most lopsided loss.\n\n\r\n              Dereck Lively II scored 22, and Gafford finished with 20 points. The two were a combined 20 of 21, making them the first pair to score 20 or more points apiece while combining to shoot 95% or better since New York's Nate Robinson and Wilson Chandler at Memphis on Nov. 12, 2008. \n\n\r\n              The Mavericks were about 55% from the field with Doncic and the big men dissecting them on the pick-and-roll, and won their third straight after losing three in a row.\n\n\r\n              “We gave up a lot of rolls to the basket and offensive rebounds,” Bulls coach Billy Donovan said. “We've got to be more pulled in than we were. ... We kind of were too worried with getting back out to that 3-point line instead of saying, hey, we're gonna take away the roll.\"\n\n\r\n              Onuralp Bitim led Chicago with 17 points. DeMar DeRozan and Nikola Vucevic each scored 13, and the Bulls gave up 60 points in the paint in losing their second in a row.\n\n\r\n              The Mavericks set season lows for points allowed in a first quarter and opening half in racing out to a 62-42 lead. They outscored Chicago 44-16 in the opening period.\n\n\r\n              Doncic just missed a triple-double in the first half with 15 points, nine assists and eight rebounds. He scored 15 to go with six assists and six rebounds in the first quarter.\n\n\r\n              Dallas outscored Chicago 19-2 over the final 3:45 of the period, starting with Lively's dunk. Doncic scored eight and nailed two 3-pointers in that stretch, including a step-back shot from beyond the arc in the final minute of the quarter.\n\n\r\n              After Coby White's 3 rimmed out for Chicago, Josh Green nailed one for Dallas as time expired to make it a 28-point game.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host Golden State on Wednesday.\n\n\r\n              Bulls: Visit Indiana on Wednesday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995871.245224
}