{
  "game_id": "0022400825",
  "espn_id": "401705391",
  "date": "Feb 24, 2025",
  "matchup": "MIA @ ATL",
  "headline": "Hawks allow their fewest points in nearly 4 years, shut down Heat 98-86",
  "body": "ATLANTA -- — Trae Young had 11 points and 14 assists, and the Atlanta Hawks snapped a three-game losing streak with a 98-86 victory over the Miami Heat on Monday night.\n\n\r\n              Onyeka Okongwu had 17 points and eight rebounds, while Terrance Mann and Caris LaVert both added 15 points off the bench. NBA steals leader Dyson Daniel had seven steals, one off a season high.\n\n\r\n              The Hawks allowed their fewest points since a 100-82 victory over Cleveland on March 14, 2021, and moved past Miami into eighth place in the Eastern Conference.\n\n\r\n              Andrew Wiggins had 23 points for Miami, which lost for the sixth time in seven games and missed 13 of its first 14 3-point attempts. \n\n\r\n              All-Star Tyler Herro, who had scored 40 points in two of his previous three games, was held to 11 points on 4-for-19 shooting.\n\n\r\n              Takeaways\r\n              Heat: Coach Erik Spoelstra continues to tinker with the Heat rotation and hasn't been able to find a winning formula. Miami is 2-6 since trading Jimmy Butler to the Warriors on Feb. 5.\n\n\r\n              Hawks: Quin Snyder said before the game his team has been playing well but not getting the results they are looking for. Against the Heat, they broke through with a much-needed win against a potential future play-in opponent.\n\n\r\n              Key moment\r\n              With 3:25 remaining and the Hawks leading by six, Atlanta successfully challenged a foul on Young that wiped out two Miami free throws. Mann hit a 3-pointer on the ensuing possession to push the lead to 93-84.\n\n\r\n              Key stat\r\n              One night after allowing the Pistons to shoot a season-high 59.1% from the field, the Hawks held the Heat to a season-low 32.1%.\n\n\r\n              Up next\r\n              The Hawks and Heat will meet again on Wednesday, this time in Miami, for the third of four meetings between the teams this season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998270.5558221
}