{
  "game_id": "0022300341",
  "espn_id": "401584969",
  "date": "Dec 16, 2023",
  "matchup": "POR vs. DAL",
  "headline": "Luka Doncic has triple-double in Mavericks' 131-120 victory over Trail Blazers",
  "body": "PORTLAND, Ore. -- — Luka Doncic had a triple-double with 40 points, 12 rebounds and 10 assists to help the Dallas Mavericks beat the Portland Trail Blazers 131-120 on Saturday night.\n\n\r\n              Doncic scored 30 points in the first half and wrapped up the triple-double in the third quarter. He has five triple-doubles this season and 61 in his career.\n\n\r\n              “It’s everybody, it’s not just me. All my teammates helped me get to that.” Doncic said. “In the first half I just went for it because they didn’t double me. And in the second half they doubled me, so we just played out of that.”\n\n\r\n              Tim Hardaway Jr. added 25 points for Dallas, and Dante Exum and Derrick Jones Jr. each had 18.\n\n\r\n              “It’s amazing,” Doncic said of his supporting cast. “I can take some rest, too. It’s 4-on-3 basketball, the court is wide open, so we score a lot of points. We had so many open shots. When they double me, I like it.”\n\n\r\n              Anfernee Simons had 31 points, eight rebounds and six assists for Portland. Jerami Grant scored 27 points in his first game back after missing the previous four games because of a concussion.\n\n\r\n              “It felt good to be back out there, but I wish we would have got the win,” Grant said. “We let Luka have a lot of easy ones and then we had to make an adjustment.”\n\n\r\n              After a slow first quarter that saw the Mavericks lose starter center Dereck Lively to a left ankle injury, Dallas outscored Portland 38-24 in the second.\n\n\r\n              “We have a lot of character in that locker room, a lot of trust,” Mavericks coach Jason Kidd said. “When you have a leader like that, it’s easy to follow.”\n\n\r\n              Doncic scored 22 points in the first period, with the Trail Blazers taking a 39-36 lead into the second. Doncic was called for a technical foul for shooting the ball long after the buzzer, but the officials then rescinded the technical.\n\n\r\n              Dallas led 74-63 at halftime.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: At Denver on Monday night.\n\n\r\n              Trail Blazers: Host Golden State on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996590.5596979
}