{
  "game_id": "0022301211",
  "espn_id": "401616465",
  "date": "Dec 06, 2023",
  "matchup": "CHI vs. CHA",
  "headline": "DeMar DeRozan scores 29 points, Bulls beat short-handed Hornets 111-100",
  "body": "CHICAGO -- — DeMar DeRozan scored 29 points and the Chicago Bulls beat the short-handed Charlotte Hornets 111-100 on Wednesday for their third straight victory following a five-game skid.\n\n\r\n              Nikola Vucevic had 20 and 11 rebounds for the Bulls and Coby White added 19 points.\n\n\r\n              Gordon Hayward scored 27 points for Charlotte, and Terry Rozier had 25. The Hornets have lost two straight and four of five.\n\n\r\n              “In the third quarter, we came out ready to play,” White said. “Right now we’re playing a lot faster and making quicker decisions.”\n\n\r\n              Chicago took control in the first six minutes of the second half by holding the Hornets to just a pair of field goals. White capped a 19-4 run with a 3-pointer that gave the Bulls a 67-48 lead midway through the third. Charlotte never got closer than eight points the rest of the night.\n\n\r\n              “We struggled to shoot the ball in the first three quarters,” said Hornets coach Steve Clifford, whose team was 2 for 18 from behind the arc in the first half and went 2 for 12 from the field during the Bulls’ decisive third-quarter run.\n\n\r\n              Hornets guard LaMelo Ball (right ankle sprain) missed his fourth straight game and the team scratched starting center Mark Williams (back contusion) from the lineup hours before tipoff. Charlotte used just three players off the bench.\n\n\r\n              Chicago guard Zach LaVine missed his third straight game because of an injured right foot. The team said in a statement after the game that he’ll need an additional three to four weeks rest.\n\n\r\n              “Zach’s got to take care of himself,” DeRozan said. “We’ve just got to stay locked in and be prepared for when guys get all the way healthy. We’ve got to keep building.”\n\n\r\n              The Bulls pushed the lead into double-digits for the first time with a 16-3 run midway through the second quarter. Charlotte closed the half on a 15-3 spurt to trail 48-44 at intermission.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host Toronto on Friday night.\n\n\r\n              Bulls: At San Antonio on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995910.807688
}