{
  "game_id": "0022000381",
  "espn_id": "401267541",
  "date": "Feb 09, 2021",
  "matchup": "SAC vs. PHI",
  "headline": "Embiid helps 76ers pull away late for 119-111 win over Kings",
  "body": "SACRAMENTO, Calif. -- — Joel Embiid had 25 points, 17 rebounds and helped the Philadelphia 76ers turn up the defensive intensity in the fourth quarter to beat the Sacramento Kings 119-111 on Tuesday night.\n\n\r\n                    Tobias Harris and Seth Curry each added 22 points as the Sixers used a 10-0 run to take control of the game in the fourth and win for the sixth time in seven games.\n\n\r\n                    “I loved the defense first,\" coach Doc Rivers said. “This is a very good offensive team. Holding them to 20 points in the third and fourth quarter is great. I loved our execution. It's important at the end of the game our guys understand who we want to play through and the ball moves from there.”\n\n\r\n                    The Kings took a 99-97 lead on a layup by Harrison Barnes with 7:26 to go and then didn’t score again for nearly three minutes, missing seven straight shots and committing a turnover.\n\n\r\n                    “We just started playing better defense honestly,” Rivers said. “A lot of it too is we kept them out of the paint. That’s what created a lot of (their) 3s.” \n\n\r\n                    Shake Milton tied the game with a layup and then Harris and Milton hit 3-pointers to put Philadelphia up six points. Embiid’s two free throws made it 107-99 and the Sixers held on from there to snap Sacramento’s four-game winning streak.\n\n\r\n                    De’Aaron Fox led the Kings with 34 points and 10 assists. Buddy Hield added 21 points and Marvin Bagley III had 17.\n\n\r\n                    The Kings shot just 3 for 22 from 3-point range in the second half after making 11 from long range in the first two quarters. Coach Luke Walton said he believed there might have been some fatigue with his team playing for the third time in four days.\n\n\r\n                    “We just missed,” Walton said. “We missed shots we’ve been making lately. Maybe we wouldn’t have won either way but we would have had a better chance if some of those open looks had gone in.” \n\n\r\n                    The Sixers built a 14-point lead early in the second quarter before the Kings responded and went up 66-61 on successive 3-points from Fox, Hield and Tyrese Haliburton in the span of less than a minute. \n\n\r\n                    Sacramento led 71-66 at the break and the game stayed close from there until the end.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Embiid went back to the locker room briefly in the third quarter after getting a cut on his knee before returning. ... The Sixers were called for a delay of game technical with 1:01 remaining after getting a warning earlier in the game.\n\n\r\n                    Kings: The Kings were outrebounded 59-39. ... Walton said G DaQuan Jeffries is close to returning from an ankle sprain that has sidelined him all season.\n\n\r\n                    FAST STARTING FOX\n\n\r\n                    Fox had 15 points and five assists in the first quarter, the second time this season he has hit those marks in a single period having had 16 points and five assists in the third quarter against New Orleans on Jan. 17. The only players to do that even once this season are Dallas’ Luka Doncic and Phoenix’s Chris Paul. \n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Visit Portland on Thursday night.\n\n\r\n                    Kings: Host Orlando on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997180.0408661
}