{
  "game_id": "0022300417",
  "espn_id": "401585045",
  "date": "Dec 27, 2023",
  "matchup": "MIL @ BKN",
  "headline": "Antetokounmpo, Middleton help Bucks pull away from short-handed Nets for 144-122 win",
  "body": "NEW YORK -- — Giannis Antetokounmpo listed off the names he knew, the ones he was preparing to guard on the Brooklyn Nets.\n\n\r\n              If those guys were out there, it wasn't for long. \n\n\r\n              Eventually, Antetokounmpo and his Milwaukee teammates figured things out against opponents they had to learn about on the fly.\n\n\r\n              Antetokounmpo had 32 points, 10 rebounds and eight assists, Khris Middleton added 27 points and 10 assists, and the Bucks pulled away for a 144-122 victory Wednesday night over a Brooklyn team that treated it like a preseason game.\n\n\r\n              The Nets rested three starters and barely played two others on the night after a victory at Detroit that extended the Pistons’ losing streak to 27, an NBA single-season record. \n\n\r\n              “They competed hard,” Antetokounmpo said. “I don’t know most of them but definitely I’ll learn them after today because they made it extremely, extremely tough for us.”\n\n\r\n              The Nets' rotation featuring a number of rookies and players on two-way contracts put up a good fight for three quarters before the Bucks put them away.\n\n\r\n              Afterward, coach Jacque Vaughn passionately denied treating the game like one played in mid-October.\n\n\r\n              “I have too much respect for the dudes that suit up and put their body on the line and the competition level to even mention the word exhibition,” he said. “Any guy could have ended their career tonight by one play and so I treat it as such. It is an honor, it is, I don’t know, a sense of gratitude that you do this for a living and you never, ever underestimate that. If you do, you’ll pay for it.” \n\n\r\n              Cameron Payne and Malik Beasley each made five 3-pointers for the Bucks, who improved to 10-2 in December. They bounced back from one of those losses, a defeat to the Knicks on Christmas, to finish with two wins in their three-game holiday stay in New York.\n\n\r\n              Payne scored 18 points off the bench and Beasley finished with 17. Bobby Portis had 14 and the Bucks finished 23 of 51 (45%) behind the arc.\n\n\r\n              Rookie Jalen Wilson had 21 points and 10 rebounds for the Nets. Trendon Watford scored 17 points and Dennis Smith Jr. and rookie Noah Clowney each had 14. \n\n\r\n              The Nets rested Spencer Dinwiddie, Nic Claxton and Cam Johnson, along with key reserve Dorian Finney-Smith, who played the whole fourth quarter Tuesday. \n\n\r\n              With the Nets returning from a five-game trip to the West a week before Christmas, finishing their second set of back-to-back games since and facing another four-game trip later this week, Vaughn cited the heavy workload for the decision to rest the players, saying he would be putting them “in harm's way” if they didn't get a break.\n\n\r\n              Mikal Bridges started to preserve his consecutive games streak that is now at 423 but didn't play after the first quarter. Nor did Cam Thomas, Brooklyn's leading scorer who had 45 points against Milwaukee last month.\n\n\r\n              Still, Milwaukee led by only one before a 9-2 spurt in the final 1:25 of the third quarter to make it 100-92. Another flurry early in the fourth extended it to 13 and the Bucks would eventually extend it beyond 20.\n\n\r\n              “They knew they were kind of undermanned but I think Jacque’s doing a phenomenal job there,” Bucks coach Adrian Griffin said. “But we took care of business and again, games like this, you’ve just got to find a way to win and get ready for Cleveland.” \n\n\r\n              The Bucks outscored the Nets 44-30 in the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Visit Cleveland on Friday.\n\n\r\n              Nets: Visit Washington on Friday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996142.78622
}