{
  "game_id": "0022400796",
  "espn_id": "401705362",
  "date": "Feb 20, 2025",
  "matchup": "POR vs. LAL",
  "headline": "LeBron James scores 40 points to lead Lakers past Trail Blazers 110-102",
  "body": "PORTLAND, Ore. -- — LeBron James scored 40 points, including eight straight in a fourth-quarter surge, and Austin Reaves had 32 as the Los Angeles Lakers beat the Portland Trail Blazers 110-102 on Thursday night. \n\n\r\n              The Lakers were without guard Luka Doncic, who missed the game as he continues to recover from a strained calf.\n\n\r\n              Deni Avdija led Portland with 28 points.\n\n\r\n              After Portland tied it at 81 in the fourth quarter, Reaves gave the Lakers the lead again with a scoop shot. James then kicked things into a higher gear.\n\n\r\n              After an empty possession for Portland, James made a 3-pointer to give the Lakers an 86-81 lead. He hit another 3 moments later to make it 89-81. James then made a fadeaway jumper to cap a run of eight straight points — part of a 10-3 Lakers stretch that forced the Blazers to call a timeout. \n\n\r\n              After Portland’s timeout, James hit another jumper to make it 95-86. Reaves made three free throws to push the lead back to double-digits at 99-89.\n\n\r\n              Takeaways\r\n              Lakers: Coach JJ Redick praised James for his approach in building a partnership with Doncic. “I think he’s been fantastic since we got Luka and just in terms of his engagement and his ability to connect with (Doncic),\" Redick said. \"He’s going to sacrifice as much as anybody. He’s on the train, full go and he’s been that way for several months.”\n\n\r\n              Blazers: While rookie center Donovan Clingan is averaging 16 minutes per game, the Blazers think he’s ready for more following the injury to starter Deandre Ayton. Clingan finished with six points and six rebounds.\n\n\r\n              Key moments\r\n              James had a two-handed slam with 7:25 left in the second quarter to give the Lakers a 40-22 lead, their biggest of the game. He then helped Los Angeles pull away with his scorung surge in the fourth.\n\n\r\n              Key stat\r\n              The Blazers were 14 of 21 (67%) from the foul line, while the Lakers were 23 of 25 (92%).\n\n\r\n              Up next\r\n              The Lakers visit the Denver Nuggets on Saturday night. The Blazers host the Charlotte Hornets on Saturday night. \n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998168.371346
}