{
  "game_id": "0022300937",
  "espn_id": "401585565",
  "date": "Mar 11, 2024",
  "matchup": "TOR @ DEN",
  "headline": "Jokic has 21st triple-double to rally Nuggets past depleted Raptors, 125-119",
  "body": "DENVER -- — Jamal Murray scored 12 of his 26 points in the fourth quarter, and the Denver Nuggets rallied from 21 points down in the third quarter to beat the depleted Toronto Raptors 125-119 on Monday night.\n\n\r\n              Murray added 12 assists to go along with Nikola Jokic’s 21st triple-double of the season. Jokic finished with 35 points, 17 rebounds and 12 assists to help Denver improve to 9-1 since the All-Star break.\n\n\r\n              Jokic, who has 126 career triple-doubles, also had a season-high six steals, four in the third quarter when the Nuggets outscored Toronto 42-30.\n\n\r\n              “He just does a really good job of anticipating and playing the angles,” Murray said. “It’s less about being in the spot, he’s playing the angle and the line of the pass. Shout out to Jok.”\n\n\r\n              The Raptors played without Scottie Barnes (left hand fracture ), Chris Boucher (knee), Gary Trent Jr. (groin strain) and Immanuel Quickley (hip flexor) in addition to Jakob Poeltl being sidelined after having surgery on his left pinkie.\n\n\r\n              That gave younger, less-used players a chance for meaningful minutes, including Jontay Porter, Michael Porter Jr.’s younger brother. It is the first time the siblings played in the same NBA game.\n\n\r\n              “I was really happy for Jontay,” Porter Jr. said. “Not only him being out there but also the way he played. It was a special moment being out there together.”\n\n\r\n              Jontay Porter scored a career-high 14 points, Kelly Olynyk scored 24 and Bruce Brown, who helped the Nuggets win the NBA title last season, had 13 points and 10 rebounds for Toronto\n\n\r\n              The Raptors raced to a 22-point lead late in the second quarter and 68-51 at halftime. Denver rallied in the final minutes of the third to cut a 21-point deficit to 98-93.\n\n\r\n              “An NBA game, you’re up 20 or down 20 the game is never over,” Toronto coach Darko Rajakovic said. “I know when they come out after halftime they were going to be more aggressive, and how to handle those moments is a learning opportunity for us.”\n\n\r\n              The Nuggets trailed 107-104 with 7:59 left but scored eight straight points to take the lead for good. RJ Barrett, who had 26 points and nine assists for Toronto, cut it to 121-119 but Michael Porter Jr.’s corner 3-pointer with 1:02 left sealed it.\n\n\r\n              “We knew our energy was a lot better than it was in the first half and that would get us back into the game,” Murray said. “I don’t know when we took the lead, I kind of zoned out. We did a good job of not playing the score, just playing hard.”\n\n\r\n              The Raptors scored just 21 points in the fourth and missed all four of their 3-point attempts.\n\n\r\n              “You can’t trade baskets when you’re down 20, so something’s got to improve,” Denver coach Michael Malone said. “We finally got defense back into the game.”\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Detroit on Wednesday night.\n\n\r\n              Nuggets: At Miami on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995807.769872
}