{
  "game_id": "0021600378",
  "espn_id": "400899820",
  "date": "Dec 14, 2016",
  "matchup": "LAL @ BKN",
  "headline": "Nets send Lakers to 8th straight loss, 107-97",
  "body": "NEW YORK --  When Larry Nance Jr. kept climbing until he had all but jumped over Brook Lopez for an electrifying dunk late in the third quarter, the Lakers looked ready to overcome any obstacles standing in their way.\n\nThen the Brooklyn Nets made sure that was about the final highlight for Los Angeles.\n\nBojan Bogdanovic scored 23 points, Sean Kilpatrick had 22 and the Nets sent the Lakers to their eighth straight loss with a 107-97 victory Wednesday night.\n\nNance's dunk came near the end of the Lakers' 33-point third period, but they managed just seven baskets in the fourth -- none over the final 6-plus minutes.\n\n\"Our offense kind of hit a wall,\" Nance said.\n\nLopez added 20 points for the Nets, who played without Jeremy Lin again but avoided a third consecutive defeat. Trevor Booker grabbed a season-high 18 rebounds and helped key Brooklyn's rare fourth-quarter defensive stand.\n\n\"I think if we're going to take a step that's where we need to take a step, is defensively,\" coach Kenny Atkinson said. \"I was very pleased.\"\n\nLou Williams scored 16 points for the Lakers, who have fallen from a .500 team early in Luke Walton's first season as coach to one that is 10-18. They shot 38.5 percent from the field and were dismal as well from 3-point range (22 percent) and the free throw line (61.8).\n\n\"As a group, as a team, we've got a lot to learn about winning and how hard it is,\" Walton said. \"It's frustrating, but it's where we are at. Like I told our guys, we're going to find a way out. When that is? Time will tell.\"\n\nThe Lakers led by one midway through the fourth before consecutive follow shots by Luis Scola and Lopez put Brooklyn on top for good, and Lopez had back-to-back baskets later during an 11-2 run that gave the Nets a 102-94 advantage with 4:47 to play.\n\nLos Angeles kept misfiring and the Nets eventually increased the lead to double digits near the end.\n\nNick Young scored 14 points but shot 5 of 15 for the Lakers, who had won the last three meetings. He dislocated his finger but said he was OK.\n\n\"It wasn't no real Kobe moment,\" he said. \"You know, it wasn't that (badly) dislocated. It will be all right.\"\n\nTIP-INS\n\nLakers: Young and D'Angelo Russell both played their third game since an injury absence. Walton said a minutes restriction remained in place for Russell, who missed 12 games with a sore left knee, but no longer for Young, who was sidelined six games with a strained right calf. ... The Lakers lost for just the fourth time in the last 20 meetings.\n\nNets: Bogdanovic had his sixth 20-point game of the season but first at home. ... The Lakers' 13 second-quarter points were the fewest the Nets have allowed in any period this season.\n\nLIN'S LOSS\n\nLin had just returned from a 17-game absence with a strained left hamstring to play in the Nets' loss at Houston on Monday. Atkinson said the point guard's back tightened up Wednesday morning and Lin was ruled out shortly before the game.\n\nWALTON'S WORDS\n\nWalton was fined $15,000 by the NBA for verbally abusing a game official and not leaving the court in a timely manner after an ejection for arguing what he thought should have been a foul in a loss to Sacramento. But apparently, he won't change his fighting ways when he deems it necessary. \"Our guys aren't getting treated right, then I'm going to stand up for them,\" Walton said.\n\nUP NEXT\n\nLakers: Visit Philadelphia on Friday for the third stop on their seven-game trip.\n\nNets: Visit Orlando on Friday. The Magic have won the last four meetings.",
  "source": "espn_api",
  "crawled_at": 1764995425.128119
}