{
  "game_id": "401810141",
  "espn_id": "401810141",
  "date": "Nov 24, 2025",
  "matchup": "MIA vs DAL",
  "headline": "Tyler Herro scores 24 in season debut as Heat edge Mavericks 106-102",
  "body": "MIAMI -- — Tyler Herro scored 24 points in his season debut after recovering from ankle surgery, Kel’el Ware had 20 points and 18 rebounds, and the Miami Heat held off the Dallas Mavericks 106-102 on Monday night.\n\n\r\n              Bam Adebayo had 17 points for Miami, which was held nearly 20 points below its season average but improved to 8-1 at home.\n\n\r\n              P.J. Washington scored 27 points for Dallas, which got 15 from Max Christie, 13 from Klay Thompson and 12 apiece from Cooper Flagg and Brandon Williams.\n\n\r\n              Dallas trailed by 13 before making things interesting down the stretch.\n\n\r\n              Flagg made a pair of free throws with 1:04 left, tying the game at 102-102. The Mavs got a stop on their next possession, but Adebayo stole the inbound pass and Herro scored with 41.2 seconds left to put Miami back on top.\n\n\r\n              Miami — playing its third game in four nights — was without leading scorer Norman Powell (groin), Andrew Wiggins (hip) and Nikola Jovic (hip).\n\n\r\n              Mavericks center Anthony Davis missed his 14th consecutive game with a strained left calf, though he had been upgraded to doubtful earlier Monday, indicating there was a tiny chance of him playing. Dallas doesn't play again until Friday — against Davis' former team, the Los Angeles Lakers.\n\n\r\n              “I think he continues to get better. He’s working to get back,” Mavericks coach Jason Kidd said. “We anticipate him at practice this week. I think any time with a calf strain you have to be cautious. But he’s worked extremely hard and the next step is practice Wednesday, so we’ll see what happens.”\n\n\r\n              Up next\r\n              Mavericks: Visit the Los Angeles Lakers in an NBA Cup game Friday.\n\n\r\n              Heat: Host Milwaukee in an NBA Cup game Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042688.4438798
}