{
  "game_id": "0021501059",
  "espn_id": "400828946",
  "date": "Mar 23, 2016",
  "matchup": "MIL @ CLE",
  "headline": "LeBron, Love lead drama-less Cavaliers past Bucks 113-104",
  "body": "CLEVELAND -- The only drama was guessing when Kyrie Irving would cut into his birthday cake.\nAfter a few strange days, the Cavs got back to business.\nLeBron James scored 26 points, Kevin Love returned to the lineup to add 24 and Irving celebrated turning 24 by flirting with a triple-double as the Cavaliers downed the Milwaukee Bucks 113-104 on Wednesday night.\n\"It's great basketball,\" James said of Cleveland's solid all-around performance. \"Everyone's in a great rhythm. The ball is moving, everyone's in a great rhythm right now and it's just good ball.\"\nIrving finished with 16 points, eight rebounds and eight assists, and Tristan Thompson added 13 points and 10 rebounds for Cleveland, which maintained its grip on the top seed in the Eastern Conference.\nThe Cavs didn't put the Bucks away until the final minute, when J.R. Smith's 3-pointer with 20 seconds left put Cleveland ahead 111-102.\nGiannis Antetokounmpo scored 24 points, and Jerryd Bayless had 15 for Milwaukee. The Bucks lost for the fourth time in five games.\nIt was a relatively uneventful night for the Cavs following three weird days.\nOn Monday, James unfollowed the Cavaliers' account on Twitter, leading to speculation he was at odds with the organization. James acknowledged he had merely slipped into playoff mode -- when he shuns social media -- a little earlier than usual, but that didn't stop Cleveland fans from worrying.\nThen, on Wednesday, James was quoted in a Bleacher Report story saying he would take a pay cut to play in the future with good friends Carmelo Anthony, Chris Paul and Dwyane Wade.\nJames said the foursome has talked about it before, but the four-time MVP isn't sure it will ever happen.\n\"I don't know how realistic it could be,\" he said. \"It would definitely be cool if it happened. I mean, if you got an opportunity to work with three of your best friends, no matter what. It's not even about sports, it's about being around guys that you don't even have to say nothing, you automatically know. We just have that type of history, so, can it happen? I don't know if it can even happen but it would be cool.\"\nDespite the recent distractions, the Cavs shared the ball on offense and buckled down on the defense end when needed. The Bucks, though, wouldn't go away and were within 104-98 after a 3-pointer by Bayless.\nThompson then battled for two offensive rebounds and made a basket to give Cleveland an eight-point lead. Then, after Bayless scored on a layup, Smith made his third 3-pointer.\n\"We got down 10, but the guys who came in kept fighting,\" Bucks coach Jason Kidd said. \"We got it to six, but that big 3 in the corner by J.R. kind of sealed the game. That's what he does.\"\nLove, who missed Cleveland's previous game with a chest cold, looked better than he has in weeks.\nOften hesitant to shoot, he knocked down consecutive 3-pointers as he and James combined to score Cleveland's first 17 in the third. Love made all eight of his shots inside the 3-point line and went 4 of 10 behind the arc.\nHAPPY BIRTHDAY\nThe Cavs had a wine-and-gold colored cake, topped with a basketball, for Irving in the locker room. James has been impressed by his teammate's growth over the past year.\n\"He's going to continue to get better and better,\" James said. \"He's in a situation where he's playing winning basketball and everything that he does is for the team. He's a young guy who is continuing to learn.\"\nFRONT ROW\nLSU's Ben Simmons, the projected No. 1 overall pick in this year's draft, sat in a courtside seat next to his new agent, Rich Paul. Simmons announced earlier in the day that he signed with Klutch Sports Group to represent him. Klutch, headed by Paul, also represents James.\nTIP-INS\nBucks: Kidd praised Cavs coach Tyronn Lue, who took over when David Blatt was fired earlier this season. Kidd and Lue were teammates in Dallas. \"I'm happy for him,\" Kidd said. \"He's going to do a great job. He was a competitor on the floor. You look at his size, he competed. When you look at what he walked into, I think he's going to come out very well.\" ... Antetokounmpo added six rebounds and six assists. He has four triple-doubles in his 16 games.\nCavaliers: James hasn't watched any NCAA Tournament games, but he did see a replay of Texas A&M's astounding comeback against Northern Iowa. \"If I was on Northern Iowa, I would quit,\" he said. \"You're up 8 (points) with 20-plus seconds, you up 5 with 10 seconds, I would quit.\". ... Cleveland has consecutive 50-win seasons for the first time since the Cavs won more than 60 in 2008-09 (66) and 2009-10 (61).\nUP NEXT\nBucks: At Atlanta on Friday night.\nCavaliers: At Brooklyn on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994006.9695098
}