{
  "game_id": "0021800671",
  "espn_id": "401071347",
  "date": "Jan 18, 2019",
  "matchup": "MEM @ BOS",
  "headline": "Irving scores 38 points, Celtics beat Grizzlies 122-116",
  "body": "BOSTON --  Kyrie Irving's 20-point third quarter wasn't quite enough for the Boston Celtics to put away the Memphis Grizzlies.\n\nThe star guard scored eight more in the fourth, finishing with 38 points and 11 assists while leading the Celtics to a 122-116 victory Friday night.\n\n\"He was able to pick his spots and make plays,\" Boston coach Brad Stevens said. \"I thought it was a patient, really good, smart attack by him.\"\n\nMarcus Smart had 20 points and Al Horford finished with 18 for the Celtics, who have won two straight behind Irving since a three-game skid.\n\n\"You're playing a team that has a ton of offensive firepower. They have one of the best shot-makers in the game and it's difficult to get stops when he's in his rhythm,\" Memphis coach J.B. Bickerstaff said. \"I thought our guys defended him well but he just made shots, and give him credit for that.\"\n\nMemphis has lost four in a row and 10 of 11 overall.\n\nBoston beat the Grizzlies for the seventh consecutive time but had to hang on down the stretch. Memphis trailed only 111-108 with 3:13 left, but the Celtics responded with a 10-2 run. A few late 3-pointers by the Grizzlies came too late.\n\n\"They're physical. They make you work and they are always in the right spots at the right time. It took a whole group effort tonight,\" Smart said.\n\nMike Conley led the Grizzlies with 26 points. Jaren Jackson Jr. scored 23, and Marc Gasol had 11 rebounds and 12 assists.\n\nBoston led 96-91 after three, but the pesky Grizzlies would not go away. Conley's three-point play with 4:53 remaining pulled Memphis to 106-104. Irving finally sealed it when he hit a 3 with 1:22 left to put the Celtics up 118-110.\n\n\"We couldn't get a stop the last four minutes of the game. You don't get stops, it's going to be really hard to win. It comes down to that,\" Gasol said.\n\nJaylen Brown had 12 points and Terry Rozier scored 10 for Boston.\n\nRozier hit a 3 to start an 11-0 run that put the Celtics up 35-24 after the first quarter. Then he made another from beyond the arc while drawing a foul and converted the four-point play.\n\nThe Grizzlies rallied late in the period, tying it 52-all on a layup by JaMychal Green and taking a 62-58 halftime lead on Conley's layup just before the buzzer.\n\nKYRIE IS KEY\n\nIrving, who had 27 points and 18 assists Wednesday night in a win over Toronto, also added seven rebounds as the Celtics outrebounded the Grizzlies 52-39.\n\n\"It means a lot. It's big for us,\" Smart said of Irving's all-around performance the last two games. \"You're going to get open shots just because he draws so much attention. That helps our team.\"\n\nMEMPHIS BLUES\n\nThe Grizzlies have lost six straight on the road, but did enjoy a solid shooting night.\n\nMemphis was 41 for 92 from the field and made 16 of 35 3-pointers, including a team-best 4 for 9 by Conley from beyond the arc.\n\nThe Grizzlies also had 33 assists -- four more than the Celtics -- and turned the ball over just twice in the second half.\n\n\"This is what we're capable of,\" Bickerstaff said. \"If we make 16 3s every night, I don't know if that will happen, but just the way that we moved the ball, created for one another, we need to build on it for sure.\"\n\nTIP-INS\n\nGrizzlies: Justin Holiday had 14 points, his highest-scoring game since arriving in a trade with Chicago on Jan. 3. ... Shelvin Mack scored 15 points. Green and Omri Casspi had 12 apiece. ... Shot 59 percent (13 for 22) in the second quarter while outscoring Boston 38-23. ... Had five turnovers in the first quarter.\n\nCeltics: Aron Baynes had 12 rebounds in his second game back since missing a month with a broken bone in his left hand. ... Turned the ball over seven times in the second period. ... Irving was called for a technical with 3:27 left in the third quarter after getting tangled up in front of the Memphis bench with Mack, who also got a technical.\n\nUP NEXT\n\nGrizzlies: At the Toronto Raptors on Saturday night.\n\nCeltics: Visit the Atlanta Hawks on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994922.9654899
}