{
  "game_id": "0021501014",
  "espn_id": "400828901",
  "date": "Mar 17, 2016",
  "matchup": "CHA @ MIA",
  "headline": "Hornets top Heat 109-106, rallying from 15-point deficit",
  "body": "MIAMI -- Golden State and San Antonio have the NBA's two best records since the All-Star break, which certainly is no surprise since the Warriors and Spurs have been well atop the league all season.\nNo. 3 on that list?\nThe Charlotte Hornets, who just keep on winning.\n\nAl Jefferson and Kemba Walker each scored 21 points, and the Hornets overcame a 15-point second-quarter deficit to beat the Miami Heat 109-106 on Thursday night and further clog an already jampacked Eastern Conference playoff chase.\n\"Day by day, try to get better, good shootaround, have a good practice, film session,\" said Charlotte coach Steve Clifford, whose team endured a seven-game slide earlier this season. \"That's the way you have to do it. I believe we have the right kind of guys. They're serious minded and I think our approach is good right now.\"\nThe Hornets have won 15 of their last 18 games, and there's barely no separation between four teams in the race for the No. 3 spot in the East. Atlanta (40-29) won Tuesday to move a half-game ahead of No. 4 Boston, No. 5 Miami and No. 6 Charlotte -- who are all 39-29, yet the Celtics and Heat currently hold tiebreaker edges.\n\"It's fun now,\" Walker said. \"It's a race. It's a battle.\"\nMiami had a shot to force overtime, but Dwyane Wade's open 3-pointer was short and time expired. Luol Deng scored 22 points for the Heat, while Josh Richardson scored 18 and Hassan Whiteside added 17 for Miami, which has now dropped 10 games this season in which it held a lead of 10 points or more.\n\"There's not much margin for error for either team,\" Heat coach Erik Spoelstra said. \"It's competition at its finest and you not only have to compete at a high level, you have to play well and make plays under duress, under the context of game, time, score, all of that. And you have to credit Charlotte. Any time it seemed like we had some momentum ... they came back.\"\nNic Batum scored 19 for Charlotte, which trailed 45-30 in the second quarter, then took the lead by halftime and held it for most of the second half. Courtney Lee had 13 and Marvin Williams scored 12 for the Hornets.\n\"This is a good team and they've been playing very well,\" Wade said. \"This is kind of Eastern Conference playoff basketball. You know there's going to be highs and lows throughout the game.\"\nGoran Dragic finished with 16 and Joe Johnson added 13 for Miami.\nWalker had 13 points in less than 5 minutes to fuel what became a 24-7 burst by the Hornets to close the half, including a 3-pointer that sent them into the locker room with a 54-52 lead.\nCharlotte's lead was 82-73 going into the fourth, before Miami tried to rally.\nRichardson -- who is averaging 15.8 points in his last five games on 66 percent shooting, including 15-for-21 from 3-point range -- made a 3 to get the Heat within 91-90 midway through the fourth, but Charlotte never lost the lead.\n\"It was intense,\" Clifford said.\nTIP-INS\nHornets: Charlotte lost starting C Cody Zeller at halftime with left knee soreness. Jefferson started the second half in his place. ... The Hornets are now 11-3 with Lee as a starter.\nHeat: Miami reached 100 points for the ninth consecutive game. ... Wade scored 11 points, getting him within 13 of 20,000 for his career. ... A trio of former Miami Hurricane football standouts -- Stephen Morris, Jon Feliciano and Ryan Williams -- sat near the Heat bench.\nBOSH'S TWINS\nChris Bosh, who was on the Heat bench Monday for the first time since a blood clot forced him away from the court in February, was not Thursday -- for a good reason. Bosh and his wife Adrienne welcomed twin sons on Tuesday, Lennox Noel and Phoenix Avery.\nDOWN THE STRETCH\nOf the Hornets' last 14 games, as few as four could be against teams that actually make the playoffs. The Hornets have four games left against Brooklyn and Philadelphia, the two worst teams in the Eastern Conference.\nUP NEXT\nHornets: Host Denver on Saturday.\nHeat: Host Cleveland on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994349.629885
}