{
  "game_id": "0021300775",
  "espn_id": "400489648",
  "date": "Feb 11, 2014",
  "matchup": "OKC @ POR",
  "headline": "Kevin Durant has double-double as Thunder win nail-biter",
  "body": "PORTLAND, Ore. -- Kevin Durant said the mutual admiration between the Thunder and the Trail Blazers only goes so far.\n\"We respect this team and they respect us, but we don't like them and they don't like us,\" Durant said after Oklahoma City's hard-fought 98-95 victory over Portland on Tuesday night. \"Point blank.\"\nDurant had 36 points and 10 rebounds as the Thunder evened the series against the Blazers 2-2 in their final regular-season meeting this year.\n\nJeremy Lamb had 19 points, including a key 3-pointer with 1:38 left for the Western Conference-leading Thunder, who have won 14 of their last 16 games.\nNicolas Batum had 18 points for slumping Portland, which has lost five of seven but still ranks third in the conference behind San Antonio. Robin Lopez finished with 17 points and 14 rebounds for his 19th double-double of the season.\nLaMarcus Aldridge, who missed a mid-range jumper in the final seconds that could have salvaged the win for Portland, was asked what he thought of Durant's comment.\n\"We're not trying to make friends out there,\" he said. \"We're trying to win games.\"\nPortland led by as many as 13 points in the first half and held a 55-45 advantage at the break, but the Thunder kept chipping away and the teams went into the fourth quarter tied at 80.\nDerek Fisher hit a 3-pointer and Lamb made a layup to put the Thunder up 85-84. Portland reclaimed the lead on rookie CJ McCollum's running shot, but Durant re-tied it at 91 with a long hook.\nThe teams wrestled for the lead until Lamb's 3-pointer gave the Thunder a 96-95 advantage. Damian Lillard missed a 3-pointer for Portland with 45.9 seconds left.\nPortland got the ball with 12.3 seconds left after officials reviewed an out-of-bounds call, but Aldridge's mid-range jumper with 2 seconds left was off and Reggie Jackson hit free throws for the final margin.\n\n\"We fought hard,\" Durant said. \"We're a resilient team. We've kept our heads up through adversity and tough times. I'm proud of our team.\"\nPortland won two of the first three meetings between the two teams, but the Thunder won the last 105-97 in Oklahoma City last month. Durant paced the Thunder with 42 points in that one.\nAldridge was a game-time decision because of soreness, but he started and finished with 12 points and 12 rebounds. The Blazers are the only team that has started the same five players in all of their games this season.\nAldridge was disappointed with the loss -- and especially his final missed shot.\n\"I couldn't throw a rock in a lake tonight,\" Aldridge said.\nPortland jumped out to a quick 18-6 lead, but the Blazers were hurt late in the opening quarter when reserve forward Joel Freeland's right knee buckled underneath him and he had to be helped off the court. A postgame MRI revealed a sprained MCL, and Freeland is expected to miss four to eight weeks.\nThe Thunder closed to 25-21 on Lamb's 12-foot jumper early in the second quarter. Portland held them off, but Lamb's dunk narrowed it to 34-32 and the Thunder finally pulled ahead 41-39 on Lamb's 3-pointer.\nThe Blazers answered with a 16-4 run to take a 55-45 lead into halftime.\nThe Thunder again threatened when Kendrick Perkins' jumper got them within 66-63. Serge Ibaka's jumper with 2:18 left in the third finally gave Oklahoma City a 76-75 lead, their first of the second half.\nJackson led the rally with 13 points after going 0-for-6 in the first half. The teams went into the fourth quarter tied at 80.\n\"It was a physical game, but I like the fact that we kept competing and didn't let anything bother us,\" Thunder coach Scott Brooks said. \"We just competed, possession by possession. And that's what good teams do.\"\nThe Blazers were coming off a 2-2 road trip, including 117-110 victory over the Minnesota Timberwolves on Saturday. Following the loss to the Thunder, they were headed to Los Angeles for a game against the Clippers on Wednesday night before the All-Star break.\nThe Thunder were coming off a 112-100 victory over the New York Knicks, with Durant's 41 points leading the way.\nNOTES: Portland was without guard Mo Williams, who had just returned from attending to a family matter. It was hoped that Williams could travel with the team to face the Clippers on Wednesday night. ... Aldridge and Lillard were presented with their All-Star jerseys before the game. ... Thunder guard Thabo Sefolosha appeared to injure his right hand in the first half, but he returned to start the second half with his hand taped. ... The Thunder had three technical in the game, and the Blazers had one.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764992857.75465
}