{
  "game_id": "0021301216",
  "espn_id": "400490089",
  "date": "Apr 16, 2014",
  "matchup": "MEM vs. DAL",
  "headline": "Grizzlies edge Mavericks in OT to take West's No. 7 seed",
  "body": "MEMPHIS, Tenn. -- The Memphis Grizzlies had every reason to ease up in the regular season finale after pushing hard the past three months to reach the postseason.\nInstead, they kept grinding and grabbed the No. 7 seed in the Western Conference.\nMike Conley hit two free throws with 1.1 seconds left in overtime, and the Memphis Grizzlies moved up from the eighth seed by edging the Dallas Mavericks 106-105 on Wednesday night.\n\"We've been holding on very tight for a long time ...\" Memphis coach Dave Joerger said. \"Getting 50 wins is something you want on your resume as a player, and people remember those. Those are special seasons. It's a standard, a golden standard I think.\"\n\nMemphis became the seventh team in the West with 50 wins this season with the victory. The Grizzlies, who set a franchise record with a 14th straight home win in a single season, will open the postseason Saturday night at Oklahoma City. They beat the Thunder in the semifinals last year with Russell Westbrook out.\n\"Playing Grizzlies' basketball going into the postseason was key, and we wanted to try to keep that momentum going,\" Grizzlies guard Tony Allen said.\nMonta Ellis missed a 17-footer before Conley drew the foul driving to the basket. Dallas had one last shot, but Ellis missed from the top of the key.\n\"It felt good, but it didn't go down,\" Ellis said. \"I think we did a great job. We competed. It went down to the wire, and they won.\"\nConley was face guarding his player when he noticed Ellis got his shot off before the buzzer.\n\"I was like, 'How'd he get that open?' \" Conley said. \"When I saw it hit the rim, I was like 'Thank you, God.' That would have been a tough one to lose.\"\nAvoiding No. 1 seed San Antonio in the first round was the only thing on the line, and Memphis has lost 14 of its last 16 against the Spurs with the Mavericks losing nine straight.\n\nDallas coach Rick Carlisle said the Mavericks will be fine with starting in San Antonio on Sunday giving Dirk Nowitzki and Ellis time to rest. Nowitzki banged his right knee late in the first half and played the second half with a sleeve protecting his leg.\n\"Tonight is a good indication of the fight we have in us, and we're going to take that fight to San Antonio,\" Carlisle said.\nNowitzki called this game a tough loss, but he also is positive about facing the Spurs.\n\"Eventually we will win one,\" Nowitzki said. \"Why would it not be Game 1 or Game 2? We are going to go out there and let it rip in Game 1.\"\nEllis scored 14 of his 18 points after halftime, including seven in overtime. But Conley had five in the extra period, including the clinching free throws. He was 5 of 7 at the line, though the Grizzlies were 15 of 25 for the game.\n\nZach Randolph led Memphis with 27 points and 14 rebounds, and Marc Gasol had 19 points, shooting 9 of 13. He also had nine rebounds and nine assists. Conley finished with 22, and Allen had 13. Courtney Lee added 11 despite shooting 3 of 10 from the floor.\nNowitzki led the Mavericks with 30 points. Devin Harris and Brandan Wright each had 10. Harris also had 10 assists.\nThe Grizzlies missed their chance to put away the win in regulation.\nMemphis was up 93-90 and had just gotten the ball back when Conley crashed into Harris for a charge, giving the ball back to Dallas with 20.3 seconds left in regulation. Ellis then hit a 3-pointer from 26 feet out on the right wing with 13 seconds left over Lee tying it up at 93, and the Grizzlies couldn't score to avoid overtime.\nIn overtime, the Mavericks last led 105-102 on a 3-pointer from Nowitzki with 46 seconds remaining. Dallas didn't score again. Allen had a putback with 38 seconds to go, then Conley sealed the win.\nThe Mavericks already took the season series winning the first three games by double digits. They were the last team to beat the Grizzlies in Memphis on Feb. 5, and owner Mark Cuban was at the end of the bench cheering them on.\nGame notes\nMike Miller played all 82 games for the Grizzlies for only the second time in his career his rookie season with Orlando in 2000-01. He became only the 23rd player in NBA history to play a full season in his 14th season or later. ... Memphis won its fifth straight. ... Dallas snapped a six-game road winning streak.",
  "source": "espn_api",
  "crawled_at": 1764993036.606862
}