{
  "game_id": "0021600608",
  "espn_id": "400900029",
  "date": "Jan 15, 2017",
  "matchup": "DAL vs. MIN",
  "headline": "Matthews leads Mavericks to 98-87 win over T-Wolves",
  "body": "DALLAS --  Playing against a much younger team that beat them six days ago, the Dallas Mavericks turned to their depth and veteran savvy.\n\nWesley Matthews had 19 points and Dirk Nowitzki added 17 as the Mavericks spread out the scoring and beat the Minnesota Timberwolves 98-87 on Sunday.\n\nDallas dressed four players with 10 or more years in the NBA -- Minnesota has none -- and all of them reached double figures.\n\nJ.J. Barea had 15 points Deron Williams had 13 points and 10 assists for the Mavs.\n\n\"That's how we've got to play,\" Matthews said. \"That brand of basketball is fun. Everybody has energy, and we're moving the ball well. They're team shots as opposed to one-person shots.\"\n\nGorgui Dieng scored 21 points and Andrew Wiggins had 19 for the Timberwolves, who had won three in a row. Minnesota's last four-game winning streak was in December 2012.\n\nKarl-Anthony Towns had 18 points and nine rebounds, but the Mavericks largely held him in check after he had 34 points and 11 boards in the Wolves' 101-92 home win over Dallas on Monday.\n\n\"We didn't do anything that we usually do to win the game,\" Towns said. \"That's why our winning streak is over.\"\n\nDallas broke open a two-point game by closing the third quarter on an 11-4 run, then Barea scored his team's first nine points of the fourth quarter. His bank shot in the lane with 8:01 to go extended the lead to 88-76.\n\n\"We're in a good place right now,\" Barea said. \"We know we still have a lot of work to do, but we've got a good feeling in this locker room right now.\"\n\nSeth Curry then scored the next five points with a 3 and a fast-break layup to give Dallas its largest lead of the game.\n\nSTART IT UP\n\nThe Mavericks moved up the gametime to 1 p.m. to accommodate the Dallas Cowboys' late-afternoon kickoff at home against Green Bay in the NFL playoffs.\n\nTIP-INS\n\nTimberwolves: Zach LaVine had missed the past two games with a hip bruise, but warmed up before the game and coach Tom Thibodeau declared him ready to go. He scored 11 points.\n\nMavericks: Announced the signing of guard Pierre Jackson to a 10-day contract. Jackson played for the Mavericks from Dec. 27 to Jan. 6, averaging three points, before being waived. ... Dallas also recalled forward Nicolas Brussino from the Texas Legends of the NBA Development League, where he was averaging 16 points and eight rebounds.\n\nVINTAGE DIRK\n\nNowitzki's 17-point effort included a second-quarter stretch in which he scored seven Dallas points in a row. He scored on a leaner in the lane, then on a long pull-up jumper.\n\nThen, as the trailer on the fast break, he hit a long 3 that gave the Mavericks their largest lead of the first half, 44-29, sending the crowd into a frenzy and forcing a Timberwolves timeout.\n\n\"If I get some daylight, I feel like I have a decent rhythm right now,\" Nowitzki said. \"We had a little run going and sometimes you want to use the momentum. I let it ride and somehow it rode in.\"\n\nNowitzki's 28 minutes played gave him 47,621 in his career, passing Reggie Miller for ninth place all-time.\n\nPEER RECOGNITION\n\nAs head of the National Basketball Coaches Association (NBCA), Mavericks coach Rick Carlisle talked about the association's announcement of the Michael H. Goldberg NBCA Coach of the Year Award. The award will be the only one chosen by an NBA coach's peers and will be announced at the end of the regular season. Goldberg was the first executive director of the NBCA.\n\n\"Michael Goldberg is a beloved figure in the coaching world,\" Carlisle said. \"We felt it was time to honor the work that he's done. This is a unique award because it's going to be voted on by peers only. It will have a little extra meaning for coaches. It's really time for something like this to happen.\"\n\nUP NEXT\n\nTimberwolves: Stay in Texas with a visit to San Antonio on Tuesday.\n\nMavericks: Visit Chicago on Tuesday for the first of a two-game road trip.",
  "source": "espn_api",
  "crawled_at": 1764996130.8226209
}