{
  "game_id": "0021900207",
  "espn_id": "401160849",
  "date": "Nov 20, 2019",
  "matchup": "TOR vs. ORL",
  "headline": "Fred VanVleet scores 24 points, Raptors beat Magic 113-97",
  "body": "TORONTO --  The Orlando Magic hit Toronto on a three-game winning streak. They limped out of town with two key starters hobbled by injuries.\n\nFred VanVleet scored 24 points, Pascal Siakam had 18 points and 11 rebounds and the defending champion Raptors beat the Magic 113-97 on Wednesday night.\n\nOrlando lost center Nikola Vucevic and forward Aaron Gordon to right ankle injuries in the second quarter. Vucevic used two crutches to leave the locker room afterward, while Gordon had one.\n\n“It hurts not being able to play, not being able to help my team win,” Gordon said.\n\nGordon checked out with 8:27 left in the first half, seconds after ending up on the floor while trying to block Anunoby.\n\n“It was basically a full jump,” Gordon said. “I came down and landed on the back of someone’s leg and rolled over. That’s why I knew it was hurt a little bit more, because I had jumped all the way up.”\n\nVucevic came in as the reigning Eastern Conference Player of the Week after after averaging 21.7 points, 14.0 rebounds, 4.0 assists, and 1.33 blocks during Orlando’s winning streak. He went down along his own baseline with 5:29 left in the second after injuring his ankle while trying to defend Norman Powell’s drive to the basket.\n\n“It was really painful,” Vucevic said. “It was hard for me to put any pressure on. We’ll see. I’m supposed to get an MRI (Thursday) and then I’ll know more after that. It’s pretty painful right now.”\n\nVucevic had to be helped to the locker room, unable to put weight on his right leg. He said X-rays came back negative.\n\nOrlando has second-year centre Mo Bamba and third-year big man Khem Birch ready to fill in, but coach Steve Clifford said there’s no doubt his team will miss Vucevic.\n\n“When you lose your best player, it’s hard to say you have more than enough,” Clifford said.\n\nStill, Clifford refused to hang his head about Orlando's injury situation.\n\n“You get up in the morning, you say ‘Who do we have,’ and then you figure out the best way to have a good day with that group,” he said. “That’s all you can do in this league.”\n\nRaptors rookie Terence Davis scored a career-high 19 points, Chris Boucher had 14 points and 11 rebounds, and Norman Powell scored 15 points. Toronto improved to 6-0 at home and won for the eighth time in 10 meetings with the Magic.\n\nForward Jonathan Isaac started for Orlando after missing the previous two games because of a sprained right ankle. Isaac played 33 minutes, scored 16 points and matched his career high with 13 rebounds.\n\n“It was good to have him out there,” Clifford said “Obviously he adds so much to our team. I thought he played well, did a good job.”\n\nEvan Fournier scored 21 points, Terrence Ross had 14 and Markelle Fultz added 12 for the Magic. Orlando is 0-5 on the road.\n\nVanVleet scored 20 or more for the fifth time this season. He had five 20-point efforts in 64 games last season.\n\n“It’s definitely impressive what he’s been able to do,” Siakam said about VanVleet. “He’s just playing at a very high level right now.”\n\nTIP-INS\n\nMagic: G Michael Carter-Williams said an MRI showed no structural damage to his injured left hip. Carter-Williams left in the second quarter of Sunday’s home win over Washington. There is no timetable for his return. ... Orlando scored 32 points in the first quarter but just 36 in the second and third combined. ... Birch scored a season-high 12 points. His career-high is 13.\n\nRaptors: Coach Nick Nurse said F Serge Ibaka (right ankle) could return for Saturday’s game at Atlanta. There’s no return date yet for G Kyle Lowry (left thumb). Both Ibaka and Lowry have missed the past six games. ... Boucher matched his season high with 11 rebounds.\n\nON THE GLASS(ES)\n\nToronto’s OG Anunoby left Monday’s win over Charlotte after he was hit in the right eye for the second time in eight days. Anunoby wore protective glasses to begin the game, but removed them midway through the first. He did not attempt a shot while wearing the glasses.\n\nNOT SO FAST\n\nFor the first time this season, Toronto was outscored on fast break points. Orlando scored 16 fast break points while the Raptors had five, the first time this season they’ve scored fewer than 11.\n\nHOME AND ROAD\n\nToronto (6-0), Miami (6-0), Boston (5-0) and Philadelphia (5-0) have yet to lose at home. Besides Orlando (0-5), Oklahoma City (0-6) is the NBA’s only other team without a road victory.\n\nUP NEXT\n\nMagic: At Indiana on Saturday.\n\nRaptors: At Atlanta on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995648.2507882
}