{
  "game_id": "0021900265",
  "espn_id": "401160907",
  "date": "Nov 27, 2019",
  "matchup": "OKC @ POR",
  "headline": "Lillard, Anthony lead Blazers over Thunder, 136-119",
  "body": "PORTLAND, Ore. --  Carmelo Anthony is feeling more at home with the Portland Trail Blazers, especially now that he’s seen the appreciation of the hometown fans.\n\nWith the crowd chanting his name, Anthony finished with 19 points in his Moda Center home debut Wednesday night and the Blazers beat the Oklahoma City Thunder 136-119.\n\nDamian Lillard had 27 points and Hassan Whiteside added 21 points and 16 rebounds for the Blazers, who led by as many as 35 points in their return home after an extended 2-4 road trip.\n\nAnthony’s dunk early in the fourth quarter gave Portland a 111-79 lead and put the crowd on its feet. When he was subbed out for the last time a couple of minutes later, fans chanted “Melo! Melo!”\n\nThe reception isn’t the only thing making Anthony feel at home. He seems to be more comfortable with his new team, too.\n\n“I think guys are just starting to feel a little bit more relaxed and at ease,” Anthony said. “When I first got here last week, and met those guys in New Orleans, I think it was the hype of the excitement of me coming to the team, guys not really knowing how this was going play out, how this was going to fit in, how I was going to fit in.”\n\nThe Blazers signed Anthony in hopes he could help the team overcome a slow start after going to the Western Conference finals last season. The deal was official Nov. 19, in the midst of Portland’s six-game road trip.\n\nThe 10-time All-Star played in four games before the team returned to Portland, averaging 16 points and nearly 30 minutes per game. He led the Blazers with 25 points in a 117-94 victory at Chicago on Monday night that snapped a four-game losing streak.\n\nBefore signing with the Blazers, Anthony hadn’t played since a 10-game stint with the Houston Rockets ended a little more than a year ago.\n\n“Honestly, I didn’t know what to expect,” Anthony said. “I wanted to come in, just play basketball and find my joy again, and the excitement of playing basketball, what it should be. I’ve found that early on so far. I’ve found that happiness, that joy, in the way the guys were able to open this up to me with open arms and bring me in here as one of their own.”\n\nAbdel Nader had 23 points off the bench for Oklahoma City, and Chris Paul finished with 16 points.\n\n“Melo's tough. Especially on that mid post where he’s built a career,” Paul said. “He’s one of the best to ever play right there so I love defending him. That's my brother right there. We went to dinner last night. I always want to see him do well, except against us.”\n\nThe Thunder were coming off their first road win of the season, a 100-97 victory over Golden State on Monday night that snapped a three-game losing streak.\n\nPortland raced to a 40-17 lead and it wasn’t close the rest of the way. The Blazers made their first six attempts from the perimeter and finished with 14 3s. Lillard led the team with five 3-pointers.\n\nThe Blazers led 63-50 at the half. It ended on a contentious note when it appeared that Steven Adams hooked Lillard by the neck but wasn’t called for the foul. Lillard complained to the ref, but Anthony spirited him away and toward the tunnel.\n\nWhiteside had 19 points and 12 rebounds at the break.\n\nThere was more of the same in the third quarter, with the Blazers maintaining a double-digit lead. Portland went into the fourth quarter up 104-77.\n\nTIP INS\n\nThunder: Shai Gilgeous-Alexander announced on Twitter that he has committed to play for team Canada in its bid to get to the Tokyo Olympics next year. ... Guard Hamidou Diallo missed his second game with a hyperextension sprain in his right elbow. He is expected to be out from four to six weeks.\n\nTrail Blazers: Gary Trent Jr. was held out of the game because of a hamstring injury. ... The Blazers’ 42 first-quarter points were a season high. ... Rodney Hood made all four shots he took from the field in the first half, including three 3-pointers. ... All of Portland’s starters finished in double figures.\n\nHOME COOKIN’\n\nThe Blazers will play nine of their next 12 games at home, which the team was embracing after playing 13 of the first 18 on the road.\n\n“We just didn’t play good enough to win a lot of those games. But knowing that we’re coming home and that we’re playing better, I think it’s on everybody’s mind like, `OK, it’s a great opportunity for us to kind of get ourselves back into it taking care of our home floor.’” Lillard said. “Even though we haven’t been great at home, at some point it has to turn because our work has continued, we’ve been positive, and we continue to believe in ourselves, so I think we’re starting to turn that corner.”\n\nUP NEXT\n\nThunder: Hosts New Orleans on Friday night.\n\nTrail Blazers: Hosts Chicago on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996246.437458
}