{
  "game_id": "0022000768",
  "espn_id": "401307556",
  "date": "Apr 05, 2021",
  "matchup": "PHX @ HOU",
  "headline": "Booker scores 36 as Suns beat Rockets for 6th straight win",
  "body": "HOUSTON -- — Devin Booker scored 18 of his 36 points in the fourth quarter, and the Phoenix Suns beat the Houston Rockets 133-130 on Monday night for their sixth straight win.\n\n\r\n                    Deandre Ayton matched a season high with 27 points as Phoenix won for the ninth time in 10 games overall. Mikal Bridges had 20 points, and Chris Paul finished with 19 points and 11 assists.\n\n\r\n                    “I was just taking what the defense gave me,” Booker said. “I got a couple of quick easy 3s and was just trying to win the game. That’s a hard-fighting team over there. A couple of times, we had the opportunity to put them away, but they didn’t go anywhere. We wanted to get this one bad.”\n\n\r\n                    Phoenix led 101-92 after three quarters, but Houston opened the fourth with a 9-0 run. Houston trailed by nine again with a minute left, but Jae’Sean Tate and Kelly Olynyk made back-to-back 3-pointers for the Rockets.\n\n\r\n                    Christian Wood made two free throws to cut the Suns' lead to one with 3.5 seconds remaining. Booker hit two free throws, and Houston’s inbounds pass was deflected to end the game.\n\n\r\n                    “It wasn’t as pretty as you would like it to be, but at the end of the day, we beat a team that’s playing a lot better on the road, and it’s a big win for us,” Suns coach Monty Williams said. \n\n\r\n                    Phoenix has now won three straight against Houston following a 13-game skid in the series.\n\n\r\n                    Ayton added 11 rebounds for his 25th double-double of the season. \n\n\r\n                    “He just dominated in the paint,” Williams said. “That’s the way that he can play. We were trying to go to him tonight. I thought he had a pretty dominant night, scoring the ball. I thought his poise was at a high level when he got the ball in the post.”\n\n\r\n                    Wood scored 23 points and Olynyk finished with 21. Kevin Porter Jr. had 20 points in the Rockets' fifth consecutive loss.\n\n\r\n                    “They made a bunch of tough shots, but we felt like we were getting great shots on the offensive end,” Olynyk said. “Guys really stepped up and made plays on both ends of the floor to give us new life. We just couldn’t quite close it out in the end.”\n\n\r\n                    Rockets point guard John Wall missed a fourth straight game with a left knee injury.\n\n\r\n                    Phoenix led 70-60 at halftime, hitting 12 of 23 3-pointers in the first half. The Suns finished 18 of 37 from 3 in the game. \n\n\r\n                    500 CLUB\n\n\r\n                    Paul became just the fifth player in NBA history to record 10 or more assists in 500 games. He joined John Stockton (863), Magic Johnson (586), Jason Kidd (569) and Steve Nash (509).\n\n\r\n                    “He’s one of the best set-up guys I’ve ever seen,” Williams said. “He understands how to get guys the ball, a lot like those other guys who are mentioned. It says a lot about him, the way he studies the game and his durability.” \n\n\r\n                    EARNED IT\n\n\r\n                    The Rockets debuted their “Earned Edition” jerseys, the option of a fifth uniform designated for NBA teams which made the playoffs the previous season.\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Frank Kaminsky III was out because of the league’s health and safety protocols. ... Abdel Nader was out with right knee soreness. ... Cameron Johnson scored 12 points in 21 minutes off the bench. \n\n\r\n                    Rockets: SG DaQuan Jeffries was claimed off waivers from Sacramento. Jeffries appeared in 18 games for Sacramento this season, averaging 3.5 points in 12.9 minutes. ... Armoni Brooks was sidelined for health and safety protocols. ... Danuel House Jr. is expected to miss at least a week with a right ankle sprain. \n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Host Utah on Wednesday night.\n\n\r\n                    Rockets: Host Dallas on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764997741.015958
}