{
  "game_id": "0022000082",
  "espn_id": "401267242",
  "date": "Jan 02, 2021",
  "matchup": "CHA @ PHI",
  "headline": "Harris, Embiid lead 76ers past Charlotte 127-112",
  "body": "PHILADELPHIA -- — Tobias Harris punctuated a drive with a dynamic dunk that should have made a packed arena quake.\n\n\r\n                    He had to settle for leaving the Hornets shaken.\n\n\r\n                    Joel Embiid had 19 points and 14 rebounds and Harris scored 24 points to lead the Philadelphia 76ers to a 127-112 win over the Charlotte Hornets on Saturday night.\n\n\r\n                    Ben Simmons had 15 points, 12 rebounds and 11 assists to help the Sixers beat the Hornets for the 12th straight time. Philadelphia has not lost to Charlotte since Nov. 2, 2016. \n\n\r\n                    “When we're shooting the ball like that, we're dangerous,” coach Doc Rivers said. “We can every night. We have great shooters.”\n\n\r\n                    Terry Rozier scored 35 points for the Hornets.\n\n\r\n                    The Sixers are rolling in Rivers’ first season on the bench and followed a 24-point win over Orlando with another victory where they led by double digits for most of the game.\n\n\r\n                    Maligned in Philly for a paycheck not commensurate with his production, Harris has become the catch-and-shoot 3-point ace the Sixers needed to give them another scoring threat alongside All-Stars Embiid and Simmons. Yet it was Harris' full-court drive-and-dunk down the lane that posterized — or perhaps GIF’d in the modern era — Bismack Biyombo and left the Hornets reeling.\n\n\r\n                    “He’s made a huge leap from the past year to now,” Simmons said.\n\n\r\n                    The Sixers got a little something from everyone, including 21 points from Seth Curry and 13 from Danny Green, two offseason pickups the Sixers hoped would address outside shooting woes.\n\n\r\n                    “The key is, we're shooting well because we're getting open shots,” Green said.\n\n\r\n                    Harris blossomed when he played for the Clippers (43% on 3s) under Rivers before he was traded to Philadelphia in 2019. Harris stumbled from long-range in his 1 1/2 seasons with the 76ers only to find the reunion with his old coach the spark he needed to find his stroke. He hit all 3 attempts in the first half and the Sixers hit 12 of 22 overall before halftime to lead 73-58.\n\n\r\n                     “They’re making my job easier when they do that,” Simmons said.\n\n\r\n                    The Sixers hit a lull in the third. Green’s lazy entry pass was picked off by Rozier and Rivers threw up his hands in exasperation. Rozier hit Gordon Hayward for the bucket that cut it to 94-83 and the Sixers called timeout. \n\n\r\n                    No worries in Philly. \n\n\r\n                    Simmons scored consecutive buckets late in the fourth, the second on an alley-oop from Curry that had the Sixers drummers — aka the Sixers Stixers — going wild. Hey, someone had to with fans still banned from the Wells Fargo Center.\n\n\r\n                    TIP-INS:\n\n\r\n                    HORNETS: Coach James Borrego said it was too early in the season to consider shaking up the starting lineup. “If there’s changes to be made, we’re going to make them,” he said. That meant another game off the bench for the No. 3 overall pick, LaMelo Ball. Ball scored 13 points had four steals and continued to show flashes as the best Hornet on the court.\n\n\r\n                    76ERS: F Mike Scott sat out with an injured left knee suffered Thursday in Orlando. \n\n\r\n                    SLUMPING GRAHAM\n\n\r\n                    The Hornets lost 108-93 to the Memphis Grizzlies on Friday night and got little production from Devonte’ Graham in both games. He missed nine of 10 shots and scored five points against the Sixers. \n\n\r\n                    He is 2-for-20 from the floor the last two nights. \n\n\r\n                    “I've just go to help him,” Borrego said. “It's on me to try to help Devonte. That's on me. He's going to do his part. He's going to put his work in. I've got to find him ways to get him better looks, open looks.\"\n\n\r\n                    BANGED UP\n\n\r\n                    Borrego said forward PJ Washington played limited minutes in the second half because of a thumb issue.\n\n\r\n                    HE SAID IT\n\n\r\n                    Much like predecessor Brett Brown, Rivers downplays Simmons’ struggles from 3-point range. Simmons hit his first 3 of the season -- and third ever in 222 games — Thursday against Orlando. “We didn’t have a parade or anything, I can tell you that,” Rivers said.\n\n\r\n                    UP NEXT\n\n\r\n                    The Hornets can sample o ne of the five NBA-approved Philadelphia restaurants when they stick around the city for the rematch on Monday. Borrego is a fan of the new format necessitated by the pandemic. “It’s like a miniseries. It’s like a playoff-type setting,” he said. Rivers said he has long the championed the format but joked he’d reserve his final opinion until Tuesday. He's off to a good start.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997050.986378
}