{
  "game_id": "0021601213",
  "espn_id": "400900591",
  "date": "Apr 11, 2017",
  "matchup": "OKC @ MIN",
  "headline": "Oladipo lifts Russ-less Thunder over Wolves, 100-98",
  "body": "MINNEAPOLIS -- With Russell Westbrook sitting out for the first time this season, Oklahoma City coach Billy Donovan said he just wanted to see his young role players play well without the center of the Thunder universe on the floor.\nVictor Oladipo, Domantas Sabonis and the rest of the Russ-less Thunder did him one better.\nOladipo scored 20 points and hit a jumper with 6.3 seconds to play to lift the Thunder to a 100-98 victory over the Minnesota Timberwolves on Tuesday night.\n\"Because he was out tonight I was just trying to take a little bit of that role, that leadership role and lead by example and lead with my mouth as well,\" Oladipo said. \"It was good. It was a good experience for everybody, including myself.\"\nOladipo also had nine rebounds and six assists, and the Thunder outrebounded Minnesota 54-35. Starters Taj Gibson and Andre Roberson also sat out as the Thunder prepare for a first-round series against Houston. Sabonis added 19 points and nine rebounds.\nKarl-Anthony Towns had 26 points and 12 rebounds, while Andrew Wiggins overcame a 1-for-11 start to finish with 18 points for the Minnesota. But the Timberwolves again struggled to get stops down the stretch and Wiggins missed a 3-pointer at the buzzer as they lost their fifth straight game.\n\"Whatever your circumstances are, you've got to be ready to go,\" Wolves coach Tom Thibodeau said. \"That's the way it is. So we had a long road trip, we come home and we've got to be ready.\"\nAfter consulting with Donovan and the team's medical staff, Westbrook made the decision to rest for the first time this season. He was one of just six players in the league to have started every game. But after a break-neck year in which he broke Oscar Robertson's record for most triple-doubles in a season and helped the Thunder turn the page after Kevin Durant left for Golden State, the most relentless player in the league finally took a night off.\nFellow starters Gibson and Roberson also took the night off, but the rest of the team took it to the Wolves in the first half. A 19-2 run in the first quarter helped OKC build a 22-point lead.\nAfter unveiling a new logo at halftime, Minnesota outscored Oklahoma City 29-15 in the third quarter to jump back in front.\n\"We had the lead,\" Thibodeau said. \"All we had to do was get stops.\"\nOladipo's 3-pointer with 2:40 to go gave the Thunder a 97-93 lead, but Minnesota responded with five straight points, including Gorgui Dieng's corner jumper to go up 98-97 with 44 seconds to play. But Oladipo responded with his 21-footer, and Westbrook was the first one off the bench to greet him as the Thunder celebrated a confidence-building win.\n\"Never mind the outcome, but can we do the things that we know what we're going to need to do once the playoffs do start?\" Donovan said. \"Because if we can't do them now, we can't expect them to do it in the playoffs.\"\nTIP-INS\nThunder: Donovan said he would have further discussion with Westbrook before deciding if he will play in the regular-season finale at home on Wednesday against Denver. ... The Thunder also were playing without Doug McDermott (left knee soreness). ... Norris Cole had 12 points off the bench.\nTimberwolves: Towns surpassed Kevin Love in the first quarter to set a franchise record for points in a season. ... The Wolves announced a crowd of 19,356, the first sellout of a home finale since 1998. ... Dieng had 19 points and eight rebounds.\nABRINES RETURNS\nThunder sharpshooter Alex Abrines missed the previous three games with a sprained left knee, but was sharp in his return on Tuesday night. He hit his first two 3s and finished with six points in 16 minutes.\nAbrines said it was important for him to get a couple of games under his belt before the playoffs start.\n\"I need some rhythm,\" he said before the game.\nUP NEXT\nThunder: Oklahoma City heads back home for one final regular-season game against Denver on Wednesday night.\nTimberwolves: Minnesota flies to Houston to finish its season on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995238.7063522
}