{
  "game_id": "0021700591",
  "espn_id": "400975337",
  "date": "Jan 08, 2018",
  "matchup": "MIL @ IND",
  "headline": "Pacers change directions by rolling past Bucks 109-96",
  "body": "INDIANAPOLIS -- Indiana Pacers coach Nate McMillan challenged his team to play more aggressive defense.\nOn Monday night, the Pacers showed just how good they could be.\nIndiana seized control early by forcing 13 turnovers in the first 17 minutes, built a 29-point lead and never allowed the Milwaukee Bucks to make a serious run over the final 42 minutes of a 109-96 victory.\n\"I thought we came out defensively and challenged every catch,\" McMillan said. \"We had better pressure defensively.\"\nLast week, the Pacers couldn't do much right in a 21-point loss at Milwaukee.\nThis time, they played with passion and intensity and it changed everything.\nIndiana dominated most of the game, forcing continual miscues and bad shots while the offense took advantage by making 18 of its first 25 attempts.\nMilwaukee never recovered from the early flurry.\nDomantas Sabonis finished with 17 points and 10 rebounds to lead the Pacers. Victor Oladipo, Myles Turner and Thaddeus Young each had 15 points on a night when seven Pacers players scored at least 10.\nIndiana has won two straight since a five-game losing streak.\nKhris Middleton led Milwaukee with 19 points and Giannis Antetokounmpo had 17 -- not nearly enough against an intense defense on a mission.\n\"Indiana is a team that pressures and tries to make us uncomfortable, force us into bad decisions and they did,\" Malcolm Brogdon said after scoring 12 points for the Bucks. \"We let it affect us with turnovers.\"\nIndiana broke it open by scoring 20 straight points in the first quarter to turn a 15-14 game into a blowout. The Pacers finished the period on a 22-2 spurt to make it 37-16.\nThe Pacers extended the lead to 48-21 midway through the second quarter before the Bucks finally fought back with a 9-1 run to cut the deficit to 19. Indiana immediately answered with seven straight points and led 64-38 at halftime.\nMilwaukee couldn't get any closer than 16 until the final two minutes.\n\"We just turned it up, helping the helper, going out there and have each other's back,\" Oladipo said. \"We definitely looked united and that was huge for us.\"\nTIP-INS\nBucks: Tied their season low for first-quarter points and started 7 of 25 from the field. ... Antetokounmpo also had seven rebounds and three assists. ... John Henson scored 12 points and grabbed six rebounds. ... Milwaukee cut the deficit to nine with 59.2 seconds left and finished the game shooting 46.6 percent. The Bucks have made at least 45 percent of their shots in 17 straight games, the longest streak in the NBA this season.\nPacers: Had 30 assists on 44 baskets. ... Indiana matched its season high for first-quarter points. ... Oladipo had five rebounds and three steals. ... Turner had six rebounds and four blocks, his 15th game this season with three or more blocks. ... Sabonis' career-best streak of two straight 20-point games ended. ... Young had eight rebounds.\nREMEMBERING WOODEN\nAs part of their Hickory Night celebration, the Pacers honored one of the greatest basketball stars in the state's illustrious history -- the late John Wooden.\nHe was a three-time all-state player at Martinsville High School, a three-time All-American at Purdue and was the head coach at Indiana State before taking the UCLA job. It was there, in Los Angeles, where he earned the nickname the \"Wizard of Westwood\" and won a record 10 national championships.\nWooden died in 2010 at age 99. But his great granddaughter, Cori Andersen, spoke to the crowd, and former player Marques Johnson, now one of the Bucks' announcers, was also in attendance. Johnson played on Wooden's last championship team before playing for the Bucks.\n\"I'm definitely a California girl but he was Hoosier all the way,\" Andersen said.\nDOUBLE SCARE\nThe two players acquired in the Paul George trade with Oklahoma City both gave the Pacers a little scare in the second half.\nOladipo stayed on the ground briefly with 7:02 left in the third quarter after drawing a foul and appearing to land awkwardly and hard on the floor. But after a timeout he made two free throws and continued to play.\n\"I'm good. I'm feathery,\" Oladipo said.\nSabonis left with 2:51 to go, clutching his left wrist after a collision on a charge. He did not return. Sabonis said he thought he'd be OK.\nUP NEXT\nBucks: Hope to win their fourth straight home game Wednesday against Orlando.\nPacers: Will host Miami on Wednesday, looking for their 11th straight regular-season home win in the series.",
  "source": "espn_api",
  "crawled_at": 1764993021.3654668
}