{
  "game_id": "0021801165",
  "espn_id": "401071838",
  "date": "Apr 03, 2019",
  "matchup": "DET vs. IND",
  "headline": "Pacers handle Griffin-less Pistons 108-89",
  "body": "DETROIT --  Blake Griffin made it through almost the whole season without a significant injury.\n\nNow, as the Detroit Pistons try to hold on to a playoff spot, their star's health is a concern again.\n\nGriffin missed a third straight game Wednesday, and the Pistons were routed 108-89 by the Indiana Pacers. Detroit says Griffin has been dealing with a sore left knee. He's missed just six games this season, but it's not clear when he'll be available again. Coach Dwane Casey hopes to have him back for the team's next game Friday.\n\n\"He's worked the past couple days,\" Casey said. \"Just not quite right.\"\n\nThe out-of-town scoreboard had mostly good news for the Pistons. Brooklyn and Miami both lost, so Detroit remained alone in sixth place in the Eastern Conference. But the Nets and the Orlando Magic are just a half-game behind, and the Heat -- who dropped to ninth -- are only a game back of the Pistons.\n\nThaddeus Young scored 21 points for the Pacers, who snapped a 10-game losing streak on the road and won for just the third time in their last 10 games overall. Bojan Bogdanovic and Myles Turner scored 17 points apiece, and Domantas Sabonis added 15 points and 13 rebounds.\n\nIndiana closed the third quarter with nine straight points, and Doug McDermott's 3-pointer gave the Pacers a 78-62 lead.\n\n\"We talked about trying to be road tough tonight,\" Indiana coach Nate McMillan said. \"We wanted to come out and play well, and I thought the guys did from start to finish. Offensively, we didn't shoot the ball particularly well, but (our) defense was able to help hold the lead.\"\n\nAndre Drummond had 28 points and 19 rebounds for the Pistons, and Wayne Ellington scored 24 points.\n\nThe Pistons turned the ball over seven times in the first quarter and trailed 18-15 after one. Indiana was up 44-36 at halftime. There was a highlight for Detroit in the third, when Turner fell to the ground trying to stay with Reggie Jackson on the perimeter, and Jackson made a 3-pointer to cut the lead to six. But it was a tough evening for the Pistons overall.\n\nGriffin has averaged 24.7 points, 7.7 rebounds and 5.5 assists in 72 games -- the most he's played since he appeared in 80 in 2013-14 with the Los Angeles Clippers.\n\n\"Whenever you're missing your main guy, it's kind of hard playing on the fly and figuring it out, but we have to adjust and we have to do it quickly,\" Jackson said.\n\nHOME COURT?\n\nThe Pacers are safely in the playoffs, but they're still tied after Wednesday with Boston for fourth place in the East. So home court in the first round is at stake for both those teams down the stretch.\n\n\"Every win counts. Every game, we have to play like it's our last possession or our last game,\" Young said. \"We have to get as many wins as possible to keep up with that four spot. We just need to continue the course and continue to play and just take it from there.\"\n\nRECORD\n\nDrummond tied his own team record with his 66th double-double of the season. He also had that many in 2015-16. Isiah Thomas had 65 in 1984-85.\n\nTIP-INS\n\nPacers: Indiana is 22-21 in Victor Oladipo's absence. He is out for the season after a January knee injury. ... Darren Collison (groin) and Wesley Matthews (hamstring) also missed the game. ... Cory Joseph had six points and 12 assists.\n\nPistons: Detroit has lost five of seven. ... The Pistons went 11 of 41 from 3-point range. ... Detroit finished with 20 turnovers.\n\nUP NEXT\n\nPacers: Host Boston on Friday night.\n\nPistons: At Oklahoma City on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nThis version has been corrected to show that Detroit had seven turnovers in the first quarter, following a change in the official stats.",
  "source": "espn_api",
  "crawled_at": 1764994644.745677
}