{
  "game_id": "401809808",
  "espn_id": "401809808",
  "date": "Nov 26, 2025",
  "matchup": "GS vs HOU",
  "headline": "Reed Sheppard scores career-high 31 points as Rockets rally in 2nd half to beat Warriors 104-100",
  "body": "SAN FRANCISCO -- — Reed Sheppard scored a career-high 31 points to go with nine rebounds and five assists, and the Houston Rockets rallied from 12 points down at halftime to beat the Warriors 104-100 on Wednesday night in a rematch from the first round of last season's playoffs when Golden State won Game 7 as the seventh seed.\n\n\r\n              Jimmy Butler had 21 points, five rebounds and five assists, Stephen Curry scored 14 points, and rookie Will Richard 18 for the Warriors.\n\n\r\n              Moses Moody, who reached 2,000 career points, hit a 3-pointer with six seconds left to pull Golden State within two. Then Moody fouled Sheppard, who converted both free throws to seal it.\n\n\r\n              Alperen Sengun added 16 points, six rebounds and six assists for Houston, which scored 22 points off Golden State's 16 turnovers to win for the seventh time in eight games.\n\n\r\n              Curry and Amen Thompson went down hard under the basket with 3:24 left and the game tied at 91 after Thompson's hard drive to the hoop, which initially was whistled an offensive foul. Houston challenged and the call was overturned to a block by Curry.\n\n\r\n              Draymond Green returned after sitting out Monday's win against Utah with a sprained right foot and contributed 12 points, eight rebounds and eight assists for the Warriors.\n\n\r\n              Houston shot just 39.6% in the first half and trailed 59-47 at the break.\n\n\r\n              Sheppard's consecutive baskets in the closing moments of the third, as Houston pulled within 76-74 heading into the fourth, then began with a 5-0 burst.\n\n\r\n              The Rockets were missing Steven Adams because of a right ankle injury and former Warriors star Kevin Durant because of a personal matter. Coach Ime Udoka hopes Durant will be back next game.\n\n\r\n              Golden State center Al Horford missed his second straight game with sciatica in his right leg, while forward Jonathan Kumina scrimmaged with the G League Warriors when they practiced earlier in the day as he works back from tendinitis in both knees. \n\n\r\n              Up next\r\n              Rockets: Play back-to-back games at Utah beginning Sunday.\n\n\r\n              Warriors: Host New Orleans on Saturday in Kevon Looney's return to face Golden State.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042702.5118148
}