{
  "game_id": "0022000745",
  "espn_id": "401307536",
  "date": "Apr 02, 2021",
  "matchup": "MIL @ POR",
  "headline": "Antetokounmpo has 47, Bucks beat Blazers 127-109",
  "body": "Giannis Antetokounmpo had 47 points and 12 rebounds, and the Milwaukee Bucks snapped the Portland Trail Blazers' four-game winning streak with a 127-109 victory Friday night.\n\n\r\n                    Jrue Holiday added 22 points and 10 assists for the Bucks, who led by 24 points during the third quarter. \n\n\r\n                    “At the end of the day I just tried to be aggressive,” Antetokounmpo said. “Tonight was one of those nights I was able to be good in the paint.”\n\n\r\n                    The game featured two of the league's best scorers: Damian Lillard was averaging 29.8 points, second in the NBA, while Antetokounmpo entered fifth with 28.3. \n\n\r\n                    Lillard finished with 32 points for the Blazers, who have dropped six straight against the Bucks. \n\n\r\n                    Antetokounmpo’s 47 points matched his season high but fell short of his career high of 52. He was 18 of 21 (85.7%) from the field and made all of his shots in the paint.\n\n\r\n                    “He was really good. He got some great finishes, he’s making kind of the elbow jumpers, the free-throw line jumpers. So this is a really special game for him,” Bucks coach Mike Budenholzer said. \n\n\r\n                    Lillard said Antetolounmpo is tough to stop.\n\n\r\n                    “He’s just more naturally gifted than anyone else,” Lillard said. \n\n\r\n                    Jeff Teague, signed by the Bucks on Wednesday after he was waived by the Orlando Magic, made his debut and played 10 minutes. Bobby Portis, who missed the previous four games because of health and safety protocols, also returned for Milwaukee. \n\n\r\n                    An early 11-0 run helped the Bucks jump to a 19-7 lead. Milwaukee led by 14 points during the opening half, but the Blazers closed the gap to 60-53 before heading into the break. \n\n\r\n                    Antetokounmpo led all scorers at the half with 24 points, while Lillard had 18 for the Blazers. \n\n\r\n                    Lillard's 3-pointer got Portland within 60-58 early in the fourth quarter, but the Bucks wouldn't let the Blazers get any closer. Holiday's basket extended Milwaukee's lead to 86-70, and the Bucks capped the quarter with an 11-1 run. \n\n\r\n                    The Blazers bench went 0 for 16 from the field through the first three quarters. Anfernee Simons hit a 3-pointer early in the fourth to end the drought. \n\n\r\n                    “He put us in positions that are difficult to double team, and at the same time you don't want to give up 3-pointers, so it's kind of pick your poison,” Blazers coach Terry Stotts said about Antetokounmpo. \n\n\r\n                    Milwaukee was coming off a 112-97 victory at the Lakers on Wednesday, which snapped a three-game losing streak. \n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: It was the third of a six-game road trip and first of a back-to-back. ... Antetokounmpo has 32 double-doubles in 44 games this season. ... Portis said after the game he did not contract COVID-19, his absence was due to contact tracing. \n\n\r\n                    Trail Blazers: It was the second and last meeting between the teams. The Bucks won the first 134-106 on Feb. 1. ... The Blazers, averaging 16.3 3-pointers per game, had 11 in the opening half and finished with 21. \n\n\r\n                    ALWAYS MORE GIANNIS\n\n\r\n                    The NBA said Antetokounmpo was just the third NBA player to score 45-plus points on 85% or better shooting. The only other two to do it were Wilt Chamberlain (December 1967) and Mike Woodson (February 1983). He's also the second player to go 18 for 18 on two-point attempts in a game, joining Chamberlain, also in '67.\n\n\r\n                    DEFENDING THE THREE\n\n\r\n                    Despite those 21 3s, Budenholzer thought the Bucks defended the perimeter enough to keep the Blazers from catching up. \n\n\r\n                    “I thought we made them work, especially Lillard and McCollum, they’re so good. We put a lot of emphasis on those two guys like the whole league does,” he said.\n\n\r\n                    UP NEXT\n\n\r\n                    The Bucks visit Sacramento on Saturday. \n\n\r\n                    The Trail Blazers host the Oklahoma City Thunder on Saturday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997383.190388
}