{
  "game_id": "0022300870",
  "espn_id": "401585498",
  "date": "Mar 02, 2024",
  "matchup": "HOU @ PHX",
  "headline": "Green, VanVleet lead Rockets past Suns, 118-109. Phoenix star Booker injures ankle",
  "body": "PHOENIX -- — Jalen Green scored 34 points, Fred VanVleet added 24 and the Houston Rockets beat the Phoenix Suns 118-109 on Saturday night to split a two-game series.\n\n\r\n              “This is who we want to be every night,” said Green, who hit six 3-pointers.\n\n\r\n              Phoenix All-Star Devin Booker left late in the game because of a sprained right ankle when he stepped on teammate Royce O'Neale's foot, while fellow Suns guard Bradley Beal was ejected in his return to the lineup after missing five games with a hamstring injury.\n\n\r\n              Suns coach Frank Vogel said Booker's X-rays were negative.\n\n\r\n              Beal missed more time after his ejection in the third quarter. He and Green got in a brief scuffle before they were separated. Beal was assessed two quick technicals and ejected while Green also got a technical.\n\n\r\n              Kevin Durant led the Suns with 30 points. Booker had 24 and O’Neale 20. Beal finished with seven points on 3-of-6 shooting.\n\n\r\n              “We fought, we battled back,” Vogel said. “We junked the game up like team's do to us sometimes. But it wasn't enough.”\n\n\r\n              Green shot 12 of 23 from the field, including 6 of 12 on 3-pointers. Alperen Sengun added 21 points and 10 rebounds.\n\n\r\n              The Rockets led for most of the game, but the Suns cut it to 99-98 midway through the fourth quarter on Josh Okogie's layup. VanVleet responded with a 3-pointer to turn back the rally. \n\n\r\n              “It was good to see that fight, the physicality, I think we had that from the start,” Rockets coach Ime Udoka said. “It was obviously night and day from last game, when we got off to a poor start. Tonight, we kind of jumped out on them.”\n\n\r\n              The Suns beat the Rockets 110-105 on Thursday and that game featured some chippiness, too, with Booker and Houston's Cam Whitmore getting into a minor altercation that ended with technical fouls for both players.\n\n\r\n              “It’s a good lesson,” Vogel said. “These little baseball series within the 82 game season. You beat a team one game, they're going to have the psychological advantage and come back hungrier.\"\n\n\r\n              The Rockets jumped out to a 38-19 lead after one quarter and led 54-44 at halftime. Green scored 17 points in the first half while VanVleet and Sengun — who was ejected Thursday after arguing with officials — added 13 before the break.\n\n\r\n              “Got to give Houston credit — they came out with a lot of urgency and they were able to cruise to a win,” Durant said.\n\n\r\n              The Suns had 11 turnovers in the first half and shot just 38.6% from the field. It was a rough night for the Suns on the injury front. Starting center Jusuf Nurkic left also left the game with a neck sprain while O'Neale also sprained his ankle in the collision with Booker.\n\n\r\n              Former Phoenix great Amare Stoudemire was inducted into the Suns' Ring of Honor at halftime. He played eight seasons with the Suns from 2002-10 and made five All-Star teams.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host San Antonio on Tuesday night.\n\n\r\n              Suns: Host Oklahoma City on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995585.006402
}