{
  "game_id": "0022100244",
  "espn_id": "401360068",
  "date": "Nov 20, 2021",
  "matchup": "MIL vs. ORL",
  "headline": "Antetokounmpo has 32 points and 20 rebounds, Bucks top Magic",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 32 points and 20 rebounds and the Milwaukee Bucks held off the Orlando Magic 117-108 on Saturday night to open a two-game set.\n\n\r\n                    The teams will meet again Monday night in Milwaukee. \n\n\r\n                    Bobby Portis had a season-high 24 points along with 15 rebounds to help the Bucks win their third straight and improve to 9-8. They're above .500 for the first time since they were 3-2 on Oct. 27.\n\n\r\n                    “We’re getting better. We’re competing,\" Antetokounmpo said.\n\n\r\n                    R.J. Hampton had 19 points off the bench for the Magic. Jalen Suggs added 14, and Chuma Okeke and Mychal Mulder had 13 apiece. Orlando lost for the fifth time in six games to fall to an East-worst 4-13.\n\n\r\n                    Orlando played without leading scorer Cole Anthony, who sat out after spraining his right ankle on the final play Friday night game against the Nets in Brooklyn. The second-year player is averaging 19.6 points.\n\n\r\n                    Milwaukee had an 18-2 run in the first quarter to set the tone.\n\n\r\n                    “We made it hard on ourselves right out of the gate,” Mulder said.\n\n\r\n                    The Bucks appeared to pull away for good early in the third when Antetokounmpo and Portis connected on back-to-back 3s. Antetokounmpo followed with a twisting layup, Portis made another 3, and Khris Middleton hit a jumper from the wing to give Milwaukee a 25-point edge. The Bucks would lead by as many as 29 in the quarter and held a 96-71 margin heading to the fourth before the Magic rallied.\n\n\r\n                    “That group of theirs that finished the game got kind of hot and they stayed hot and they played well,\" Bucks coach Mike Budenholzer said. “We could definitely play better but it happens. I’m not going to try to overreact or make too much out of it.”\n\n\r\n                    The Bucks had to hold off a late rally for the second consecutive game after watching a 20-point lead against Oklahoma City dwindle a night earlier.\n\n\r\n                    “I think our team just kind of gets relaxed and thinks the game is over,\" Portis said. \"At lot of these teams play hard until the last second. We’ve got to do a better job of cleaning up the turnovers and taking quality shots down the stretch.”\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Veteran guard Gary Harris started in place of Anthony.\n\n\r\n                    Bucks: F Semi Ojeleye sat out with right calf soreness. … F Rodney Hood, who has been dealing with a sore right hamstring soreness, was cleared to play right before game time.\n\n\r\n                    PUZZLING PROBLEM\n\n\r\n                    Putting together a roster for a team beset by injuries throughout the early part of the season has been a challenge, Budenholzer said. “It’s part of coaching. It’s part of being in sports. Some years you have good runs and you are very fortunate and other years you have to deal with some stuff. But trying to put together who’s going to be subbing in and out is like my little daily sudoku or crossword puzzle.”\n\n\r\n                    LONGING FOR LOPEZ\n\n\r\n                    Center Brook Lopez, a key member of the Bucks’ championship team last season, has only played in one of Milwaukee’s first 17 games, the season-opener against Brooklyn, due to back soreness. His extended absence is partly to blame for the Bucks slow start. “We miss him, big time,” Budenholzer said. “Both ends of the court. His ability to spread the court and make threes. His ability to get offensive rebounds, post up and score in the paint. The defensive stuff is a lot more subtle. He protects the rim. He communicates. He covers for his teammates. We see how important he is to us.”\n\n\r\n                    COMING HOME\n\n\r\n                    Mosley, the Magic’s 43-year-old first-year head coach, was born in Milwaukee and spent much of his childhood in the city. A group of about 20 of Mosley’s family and friends attended the game. “Just being able to see my family and some of my closest friends and going back to my old neighborhood,” Mosley said when asked what he’s enjoyed about his returning to Milwaukee for the first time as a head coach.",
  "source": "espn_api",
  "crawled_at": 1764993255.130613
}