{
  "game_id": "0022400096",
  "espn_id": "401704662",
  "date": "Oct 26, 2024",
  "matchup": "LAL vs. SAC",
  "headline": "LeBron James records triple-double, Davis scores 31 in Lakers' 131-127 win over Kings",
  "body": "LOS ANGELES -- — LeBron James had a triple-double with 32 points, 14 rebounds and 10 assists, and Anthony Davis added 31 points and nine rebounds to lead the Los Angeles Lakers to a 131-127 victory over the Sacramento Kings on Saturday. \n\n\r\n              The Lakers are undefeated at 3-0 under new coach JJ Redick, and Davis has scored at least 31 points in each game this season. \n\n\r\n              Los Angeles was up by as many as 15 points in the first half but the Kings cut the lead to 64-60 by halftime and had built a 7-point lead in the third quarter. James helped the Lakers come roaring back with 16 points in the fourth quarter. \n\n\r\n              Davis had a big 3-pointer with 37 seconds left in the game to give the Lakers a 128-123 lead after the Kings had cut it to two. \n\n\r\n              Domantas Sabonis also had a triple-double in the loss. He scored 29 points on 10 of 14 shots and added 12 rebounds and 10 assists. \n\n\r\n              Takeaways\r\n              Lakers: Redick has found success early as an NBA coach. He has Los Angeles off to a 3-0 start.\n\n\r\n              Kings: All five Kings starters scored in double figures.\n\n\r\n              Key moment \r\n              James made a long 3-pointer in the fourth quarter, which capped an 8-0 James run to give the Lakers a 101-94 lead in the fourth quarter. He started his own run with a pull-up jump shot.\n\n\r\n              Key stat \r\n              22: That’s know many years James has played in the NBA, and he’s still able to record a triple-double.\n\n\r\n              Up next \r\n              The Kings host the Trail Blazers on Monday, and the Lakers visit the Suns on Monday in the first game of a five-game trip.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997220.26767
}