{
  "game_id": "0022300330",
  "espn_id": "401584958",
  "date": "Dec 15, 2023",
  "matchup": "TOR vs. ATL",
  "headline": "Young scores 38 points, Hawks beat Raptors 125-104 to end five-game losing streak",
  "body": "TORONTO -- — Trae Young had 38 points and 11 assists, Bogdan Bogdanovic scored 20 points and the Atlanta Hawks snapped a season-long five-game losing streak with a 125-104 victory over the Toronto Raptors on Friday night.\n\n\r\n              “We’re learning, we’re growing,” Young said. “We’re not satisfied with how we’ve been playing.”\n\n\r\n              Clint Capela scored 10 of his season-high 18 points in the first quarter and finished with 15 rebounds. \n\n\r\n              “I really think that it was important for us to set the tone early,” Capela said. “I felt that we did that.”\n\n\r\n              Dejounte Murray scored 17 points as the Hawks bounced back from Wednesday’s 135-128 loss in Toronto, when the Raptors halted a four-game losing streak.\n\n\r\n              Toronto’s 104 points were the fewest by an Atlanta opponent this season.\n\n\r\n              “Defensively I thought we played one of our best games tonight,” Hawks coach Quin Snyder said. “Our guys were really focussed on the game plan and the things they need to do to help each other. When you play that way defensively, that’s when you get your best efforts.”\n\n\r\n              Onyeka Okongwu had 14 points and 11 rebounds for Atlanta, while Saddiq Bey had 10 points and 10 rebounds. Four Hawks players posted double-doubles in the same game for the fourth time in the past 20 years.\n\n\r\n              Atlanta had 55 rebounds to Toronto’s 32, and finished with a 16-3 edge in offensive boards. That led to the Hawks outscoring the Raptors 24-3 in second-chance points.\n\n\r\n              “It’s something we mentioned this morning that we’ve got to take advantage of the offensive boards we do get,” Snyder said. \n\n\r\n              Young shot 15 for 29 and scored 29 of his points in the second half.\n\n\r\n              “We did not do a good job of containing him,” Raptors coach Darko Rajakovic said. “Our communication was not great tonight and when you don’t have communication, it’s hard to execute any kind of coverage or any kind of defense.”\n\n\r\n              Murray had nine assists and seven rebounds. Bogdanovic has scored 20 or more in a career-best five straight.\n\n\r\n              “Bogi is still hot and we need him to stay that way,” Young said.\n\n\r\n              Toronto shot 18 for 34 from 3-point range in Wednesday’s victory but couldn’t match that Friday, finishing 10 for 31 from long range. In comparison, Young went 7 for 15 by himself.\n\n\r\n              Scottie Barnes scored 23 points for the Raptors, and Pascal Siakam and Jakob Poeltl each had 15. Toronto hasn’t won consecutive games since wins at Indiana and home to Chicago on Nov. 23 and 24, and is 2-7 since.\n\n\r\n              Toronto finished 14 for 25 at the line.\n\n\r\n              Bogdanovic shot 3 for 7 from 3-point range and has connected on at least two 3-pointers in a franchise-record 19 straight games. His run of 35 games with at least one made shot from distance is the fifth-longest in Hawks history, and the fourth-longest active streak in the NBA.\n\n\r\n              The Hawks led 59-49 at the half, and Young scored 16 points in the third quarter as Atlanta took an 87-78 lead to the fourth.\n\n\r\n              Atlanta forward De’Andre Hunter (right knee) missed his third straight game while fellow forward Jalen Johnson (fractured left wrist) missed his ninth straight.\n\n\r\n              Siakam made his 402nd career start for the Raptors, passing Vince Carter (401) for fifth on Toronto’s all-time list.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Visit Cleveland on Saturday night.\n\n\r\n              Raptors: Host Charlotte on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995440.210729
}