{
  "game_id": "0022400870",
  "espn_id": "401705436",
  "date": "Mar 02, 2025",
  "matchup": "ORL vs. TOR",
  "headline": "Quickley's big second half helps Raptors hold off Magic 104-102",
  "body": "ORLANDO, Fla. -- — Immanuel Quickley scored 17 of his 24 points in the second half and the Toronto Raptors held on to beat the Orlando Magic 104-102 on Sunday night.\n\n\r\n              Franz Wagner missed a driving layup for Orlando in the final second, enabling the Raptors to win after going without a score in the final 2:52. A backcourt turnover had given the ball back to the Magic with 4.7 seconds left.\n\n\r\n              RJ Barrett added 22 points for Toronto and Jakob Poeltl had 16 points and 11 rebounds.\n\n\r\n              Wagner led Orlando with 25 points. Paolo Banchero added 23, three on a three-point play that trimmed the Raptors' lead to 104-100.\n\n\r\n              Raptors guard Gradey Dick left after being struck in the face by the back of Cole Anthony's head during a fall late in the first half.\n\n\r\n              Takeaways\r\n              Raptors: Quickley, who also had four assists, came up one point short of his season high. With his burst at the end of the third quarter, he helped the Raptors avoid a fourth straight loss.\n\n\r\n              Magic: After acknowledging that Jalen Suggs will need knee surgery, the Magic lost for the fourth time in five games, all at home. Suggs has missed 25 of the last 26 games. The Magic are 7-18 in those 25 games. \n\n\r\n              Key moment\r\n              Quickley hit a 3-pointer, completed a three-point play, assisted on a layup by Jonathan Mogbo and had another three-point play in the final 74 seconds of the third quarter, completing a 12-1 run that gave the Raptors an 81-72 lead.\n\n\r\n              Key stat\r\n              Led by Jamal Snead's 12 points, the Raptors had a 30-21 edge in bench scoring. \n\n\r\n              Up next\r\n              The teams play again at Orlando on Tuesday night.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997531.047625
}