{
  "game_id": "0022300455",
  "espn_id": "401585083",
  "date": "Jan 01, 2024",
  "matchup": "CHA @ DEN",
  "headline": "Murray scores 25 points, Porter adds 22 as Nuggets beat Hornets 111-93",
  "body": "DENVER -- — Jamal Murray scored 25 points and Michael Porter Jr. added 22 as the Denver Nuggets beat short-handed Charlotte 111-93 on Monday night, sending the Hornets to their 11th straight loss.\n\n\r\n              Nikola Jokic had 13 points, 11 rebounds and six assists for the Nuggets. Two of Charlotte's losses during its streak have come against the Nuggets in the last 1 1/2 weeks.\n\n\r\n              “Guys were locked in and defense was leading to offense,” Nuggets coach Michael Malone said. “We took care of it in the second half, and that’s Denver Nuggets basketball.”\n\n\r\n              Miles Bridges led Charlotte with 26 points, and Nick Richards and Brandon Miller each scored 15 for the Hornets, who also lost their eighth straight on the road.\n\n\r\n              Aaron Gordon, who suffered cuts to his hand and face when he was bitten by a dog on Christmas Day, had 10 points in his return for Denver. He rejoined the team in time for practice on Sunday after missing two games. He played with a small protective bandage on his right hand and his facial cuts were barely visible. “It's always good having him out there, just his energy on the glass, or catching lobs, playing defense, whatever it is,\" Murray said. “Obviously, he was just trying to get his legs back tonight because he's been out for a while. But just him being around was good. He was embraced by the whole team.” The Hornets, meanwhile, had to contend with the absence of another of their leading scorers, with Terry Rozier missing the game due to illness. The team was already without LaMelo Ball (right ankle sprain) and Gordon Hayward (left calf strain). In Rozier's place, the Hornets started Ish Smith, who was with the Nuggets last season when Denver won its first NBA title. He received his championship ring from his former Denver teammates in a brief pregame ceremony. “To see everybody come to center court, kind of enjoy it with me, that was kind of fun, because we did it together,” said Smith, who scored 10 points against his former team. Bridges hit a mid-range jumper in the waning seconds of the second quarter, pulling the Hornets into a 49-all tie at halftime.\n\n\r\n              The Nuggets pulled away after the break, outscoring the Hornets 40-17 in the third quarter, including a 20-2 run to start the second half capped by a 3-pointer from Murray that put Denver up 69-51 midway through the period. It was the seventh time this season that Denver scored 40 or more points in a quarter.\n\n\r\n              The Nuggets defeated the Hornets in similar fashion on Dec. 23 in Charlotte, when they outscored the Hornets 30-9 in the third quarter en route to a 102-85 win.\n\n\r\n              “That third quarter was a bugaboo for us,” Smith said. “But we've got to keep learning, keep growing. I hate that we've got to learn and grow through losses, but we're going to be good. We're going to push through some things. We're going to press through some things because that's what good teams do.” Denver took an 89-66 lead into the fourth quarter and began substituting freely. Charlotte made little headway against the deficit the rest of the way.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At Sacramento on Tuesday night to continue a six-game trip.\n\n\r\n              Nuggets: At Golden State on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995977.554789
}