{
  "game_id": "0021800696",
  "espn_id": "401071372",
  "date": "Jan 21, 2019",
  "matchup": "SAC @ BKN",
  "headline": "Russell has 31, Nets run past Kings for 123-94 win",
  "body": "NEW YORK --  When D'Angelo Russell finished punishing the Kings with his offense in the third quarter, the Nets shut them down with their defense.\n\nAdd it up, and it made for one lopsided second half.\n\nRussell had 31 points and eight assists, and the surging Nets won their fourth straight game by running away from Sacramento in the second half Monday for a 123-94 victory.\n\nBrooklyn outscored Sacramento 68-34 after halftime, including 30-9 in the fourth quarter.\n\n\"I think we just wore them down, just kept wearing and tearing,\" Nets forward DeMarre Carroll said. \"Our depth -- you could see a lot of guys getting in on the action. A lot of guys stepped up. I think our depth really wore them down. They finally broke in the third and fourth quarters.\"\n\nRussell, announced as the Eastern Conference player of the week shortly before the game, made seven 3-pointers. He hit all four 3-point attempts and was 5 for 6 overall in the third quarter, fueling a 22-4 spurt that launched the Nets into the lead for good.\n\nStill, the Kings were down eight after three and poised to get the first basket of the fourth when Yogi Ferrell came up with a steal. But Russell hustled back and forced him to miss the layup and follow shot, and the Nets then scored five straight points to push it back into double digits.\n\nIt was never close again.\n\n\"We wanted to make it a focal point of our defense to get back and make plays,\" Russell said.\n\nJoe Harris added 19 points and rookie Rodions Kurucs had 16 for the Nets, who won for the 17th time in 22 games.\n\nReserve guard Bogdan Bogdanovic had 22 points and 11 assists for the Kings, but starters Buddy Hield and De'Aaron Fox both had quiet games.\n\nHield, whose 3-pointer in the final second of the game beat Detroit on Saturday, shot 4 for 10 for 11 points. Fox finished 4 for 14 and had nine points and six assists.\n\n\"Everybody got brain dead,\" Hield said.\n\n\"We didn't execute. One dribble, pass. One dribble, shot. Come down, one dribble, shot. No ball movement, no continuity.\"\n\nThe Nets and Kings are two of the most improved teams in the NBA this season, both chasing playoff spots. The Nets (25-23) won only 28 games last season -- they didn't win their 25th until March 31 -- and entered play sixth in the Eastern Conference.\n\nThe Kings (24-23) were 27-55 last season and now sit just outside the playoff picture as they seek their first berth since 2006, the longest current drought in the league.\n\nThey played a back-and-forth game for a half before it was just about all Nets from there.\n\nBrooklyn led 29-23 after one, but the Kings opened the second with a 15-4 burst to sprint into the lead and took a 60-55 advantage into the locker room.\n\nThe Nets came right back with a 38-point third, highlighted by the big run that Russell capped with a 3-pointer to make it 77-66 midway through the period. He made three 3s in the spurt, then another late in the period when the Kings had recovered and cut it back down to five.\n\nTIP-INS\n\nKings: Sacramento is 1-2 on its six-game trip. ... Justin Jackson scored 14 points.  ... Iman Shumpert was 1 for 10 from the floor.\n\nNets: Russell averaged 28 points and 7.0 assists last week, shooting 53 percent both overall and from 3-point range. He tied his career high with 40 points in leading the Nets' comeback from 21 down to a victory over Orlando on Friday. ... The 34-point differential was the Nets' third-biggest ever in a second half.\n\nBETTER IN BROOKLYN\n\nThe Nets have won a season-best six straight at home. They are 10-1 in their last 11 games at Barclays Center.\n\n\"I feel the momentum building with the fans,\" coach Kenny Atkinson said. \"I hear it. I hear the rhetoric in the stands.\"\n\nGETTING THE BEST OF THE WEST\n\nBrooklyn has won six straight against West teams after a 2-11 start against the other conference. It's the Nets' longest winning streak against the West within one season since taking eight in a row in 2005-06.\n\nUP NEXT\n\nKings: Visit Toronto on Tuesday.\n\nNets: Host Orlando on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994192.1395001
}