{
  "game_id": "0022000834",
  "espn_id": "401307629",
  "date": "Apr 14, 2021",
  "matchup": "MIL @ MIN",
  "headline": "Middleton leads Bucks in 130-105 breeze by Timberwolves",
  "body": "MINNEAPOLIS -- — Khris Middleton had 27 points, eight rebounds and seven assists in three quarters, as the Milwaukee Bucks breezed to a 130-105 victory over the Minnesota Timberwolves on Wednesday.\n\n\r\n                    Brook Lopez added 18 points and eight rebounds, Jrue Holiday pitched in 15 points and three steals, and the Bucks built a lead as big as 30 points early in the fourth quarter on the way to their second consecutive blowout. After losing six of nine games, the Bucks beat Orlando 124-87 on Sunday.\n\n\r\n                    “It was a great effort all around, from everybody who stepped on the court,” Middleton said. “Just trying to play the right way, compete, defend.”\n\n\r\n                    The Bucks played without the two-time reigning NBA Most Valuable Player award winner, Giannis Antetokoumpo, because of left knee soreness for the sixth straight game. They're 3-3 without him in this stretch.\n\n\r\n                    Milwaukee, which is in control of the No. 3 seed for the playoffs, entered the evening with a three-game deficit behind Brooklyn and Philadelphia. The conference co-leaders were set to play on Wednesday night.\n\n\r\n                    Anthony Edwards scored 24 points on 5-for-11 shooting from 3-point range for the Timberwolves, who have lost 11 of their past 15 games.\n\n\r\n                    The Bucks scored 45 points in the third quarter, their second-highest period of the season that allowed coach Mike Budenholzer to rest Middleton, Holiday and Lopez for the final period with a back-to-back game looming against Atlanta.\n\n\r\n                    Middleton, who had shooting performances of 4 for 16 and 6 for 27 on a road trip earlier this month, again showed his ability to shrug off a mini-slump. He's 17 for 28 over the past two games.\n\n\r\n                    “He has that confidence, and that’s why he’s the player he is,” Lopez said.\n\n\r\n                    Middleton had 13 points in the third quarter alone.\n\n\r\n                    “I loved that he kept finding ways to get opportunities,” Budenholzer said, adding: “The off nights are the blips. Those are the outliers.”\n\n\r\n                    WOEFUL WOLVES\n\n\r\n                    The Timberwolves were also missing their best player, Karl-Anthony Towns, for the second consecutive game. His absence was for personal reasons, surrounding the one-year anniversary of the death of his mother due to COVID-19.\n\n\r\n                    After trailing Brooklyn by as many as 45 points in a 127-97 loss on Tuesday to a Nets team missing stars James Harden and Kyrie Irving, the Timberwolves were just as overmatched against another Eastern Conference power with Towns out of the lineup.\n\n\r\n                    “Yesterday was flat. Today was soft. Not a lot of resistance to anything that we did,” coach Chris Finch said. “Our competitive spirit, again, has gone back down.”\n\n\r\n                    The normally ebullient Edwards was especially glum in his postgame video interview.\n\n\r\n                    Asked why the team has lost so lopsidedly this week, Edwards said, “Not caring about winning. That’s it. That’s the biggest thing.”\n\n\r\n                    CLOSE TO HOME\n\n\r\n                    The game was played with the seats empty with the tip-off time moved up 3 1/2 hours as a safety precaution, given ongoing tension in the Twin Cities area following the fatal police shooting of Daunte Wright, a 20-year-old Black man.\n\n\r\n                    Players from both teams again donned black warmup shirts reading, “With liberty and justice for all,” with the last two words underlined and in all caps for emphasis, and Timberwolves coaches wore them on the bench too.\n\n\r\n                    With the killing of George Floyd in Minneapolis and the shooting of Jacob Blake in Wisconsin last summer, these teams have led the calls for racial justice as much as any in the league.\n\n\r\n                    “That’s nothing, being able to change and get ready for whatever time tip-off was going to be,” Lopez said. “The real resilience is those people out in the streets dealing with injustices like this.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: P.J. Tucker played for the first time in 11 games because of a strained left calf. He was scoreless in 10 minutes on a playing time restriction. ... The season high quarter score for the Bucks is 48 points in the first period on March 22 against Indiana.\n\n\r\n                    Timberwolves: Edwards notched his 25th game with 20-plus points, the most among NBA rookies. The franchise record is held by Christian Laettner, with 33 such games in the 1992-93 season. ... Naz Reid, starting again for Towns, had nine points and a season-high 15 rebounds in 30 minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Visit the Hawks on Thursday, their first of two trips to Atlanta in an 11-day span.\n\n\r\n                    Timberwolves: Host former teammate Jimmy Butler and the Miami Heat on Friday. Towns and Josh Okogie are the only players remaining who overlapped with Butler.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997651.6829948
}