{
  "game_id": "0021700505",
  "espn_id": "400975251",
  "date": "Dec 26, 2017",
  "matchup": "SAC @ LAC",
  "headline": "Harrell, Williams key Clippers bench in 122-95 rout of Kings",
  "body": "LOS ANGELES --  The Los Angeles Clippers don't care where their points come from right now. Down three starters, as they have been for most of the season, they will take them from anybody available.\n\nThere were all types of sources Tuesday night in their 122-95 rout of the Sacramento Kings.\n\nReserve Montrezl Harrell scored 22 points. Lou Williams added 21 more from the bench.\n\nDeAndre Jordan added 13 points and 15 rebounds. And Jamil Wilson, a 27-year-old rookie who has played in Puerto Rico, Italy and the G League, started and scored a career-high 17 points.\n\n\"At the end of the day, it's still basketball,\" Wilson said. \"The ball is still orange, the goal's still 10 feet. You try to use that to bring everything down to Earth. I've been playing the game my whole life.\"\n\nThe Kings stayed with the Clippers early. It was a 30-all game at the end of the first period, but Los Angeles went on a 37-14 run to close the half and was never threatened again.\n\nThe Clippers bench outscored their Kings counterparts, 72-43.\n\n\"They got to penetrate the lane and spread out the 3, get to the line, and they just really controlled the game offensively,\" said Sacramento center Willie Cauley-Stein. \"They got to do whatever they wanted.\"\n\nThe Clippers also got a career-high 10 assists from guard Milos Teodosic.\n\n\"He is just a spectacular passer,\" said Clippers coach Doc Rivers.\n\nTIP-INS\n\nKings: After losing nine consecutive road games early in the season, Sacramento entered Tuesday's game having won five of their last nine away from home. Said coach Dave Joerger: \"We settled in on a rotation. Guys are getting used to the league a little bit. They'd been scouted for the first time and have to be able to make those adjustments. And guys are continuing to improve on a daily basis.\"\n\nClippers: Rivers said F Blake Griffin could return Friday against the Lakers. When Griffin sprained his medial collateral ligament in his left knee on Nov. 27, the team said he could be out eight weeks. Rivers on his early return: \"I just know his work ethic has to have something to do with it. He gets a lot of heat for getting injured, but no one gives him credit for getting healthy. He works his butt off like no one I've ever seen.\" ... F Wesley Johnson (foot) could also return Friday.\n\nMAKING THEM COUNT\n\nThe Clippers have won three of their last four, but are currently three games out of a playoff berth.\n\n\"We have to really show up and play,\" said guard Austin Rivers. \"We're undermanned, still have guys out. Regardless, we have to compete.\n\n\"I don't care who we play, we need to win. We can't just show up to play. That's how you drop games. We can't afford to drop games. We don't want to be playing catch-up the whole season.\"\n\nUNCERTAIN FUTURES\n\nDespite their success, the immediate prospects of Harrell and Wilson are somewhat precarious with Griffin and Johnson expected back from injury soon.\n\nWilson said he can only concern himself with the present.\n\n\"It's always good to play well individually,\" he said. \"But on a night like this when everyone plays well collectively, we're a hard team to beat, even though we still have guys out.\"\n\nDEFENSIVE FAILINGS\n\nThe Kings are in the middle of the pack in points allowed in the NBA, but feel like something is still missing from their defense.\n\n\"We have to figure out a way to make a stand and play the right way defensively,\" said Sacramento guard Garrett Temple. \"We have a couple of young guys in there, but that's no excuse.\"\n\nUP NEXT\n\nKings: Host Cleveland on Wednesday.\n\nClippers: Will be the visiting team Friday against the Lakers. Have won the last five against their Staples Center co-tenants.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993272.9193401
}