{
  "game_id": "0021500932",
  "espn_id": "400828819",
  "date": "Mar 06, 2016",
  "matchup": "MEM vs. PHX",
  "headline": "Booker, Len lead Suns past Grizzlies, 109-100",
  "body": "MEMPHIS, Tenn. --  The Phoenix Suns haven't beaten many teams lately, though they sure seem to have the Memphis Grizzlies' number.\n\nDevin Booker had 27 points and nine assists, Alex Len added 19 points and 16 rebounds, and the Suns defeated Memphis 109-100 on Sunday.\n\nThe win was the second straight for Phoenix, but only the third in the last 18. Two of those victories were against Memphis.\n\n\"I think we're turning over a new leaf as a team,\" Booker said. \"Overall, we've been playing better.  We beat Orlando (102-84 on the road Friday). I think things are starting to click.\"\n\nMirza Teletovic added 18 points for the Suns, while Tyson Chandler finished with 16 points and 10 rebounds.\n\nMike Conley led Memphis with 22 points, while Matt Barnes and JaMychal Green each had 17 points. Mario Chalmers scored 14 and Lance Stephenson finished with 13.\n\n\"We're taking steps forward in the right direction,\" Suns interim coach Earl Watson said. \"We understand that. What I think we emphasize more than anything is, we don't get discouraged by losses, and we don't fall in love with wins.\"\n\nPhoenix took control at the opening of the third. Memphis made only one of its first 12 shots, resulting in a 20-4 rally for the Suns. The Phoenix lead would eventually swell to 13 in the quarter.\n\nPhoenix maintained its double-digit advantage through most of the fourth behind a trio of early 3-pointers. At one point, Teletovic had seven straight Suns points to maintain a 13-point margin.\n\nMemphis made a dent in the Phoenix lead, but could get no closer than 104-98 with just less than 3 minutes remaining.\n\n\"I didn't have a good game making shots, and we've got to get better,\" said Memphis forward Zach Randolph, who was limited to six points on 3 of 10 from the field. \"We've been playing good, but (it) was just one of those nights.\"\n\nAfter a first half that seemed to have little flow, Memphis carried a 59-53 lead into the break behind 17 points from Conley and 13 from Barnes.\n\nThe push at the start of the third quarter gave the Suns the momentum.\n\n\"We're showing we're not giving up,\" Booker said. \"We're not in the playoffs. A lot of people think this is the time for us to fold and get ready for the summer. But it's not. We're doing it for next year already.\"\n\nTIP-INS:\n\nSuns: Watson played three seasons in Memphis and was a member of the 2003-04 Grizzlies squad that won 50 games and qualified for the playoffs, both franchise firsts. ... Teletovic has made multiple 3-pointers off the bench in 10 straight games. ... Len has reached double figures in a career-best eight straight games.\n\nGrizzlies: Starting C Chris Andersen injured his left shoulder in the second quarter and did not return. He's the latest Memphis frontline player to be injured. Starting C Marc Gasol is out for the season with a broken foot and F Brandan Wright reinjured his right knee. ... Stephenson got a technical in the first quarter when he got in Booker's face after Booker fouled the Memphis guard. ... Green's 17 points were a career high.\n\nNOT BACKING DOWN\n\nBesides Stephenson's technical, Booker also drew one in the fourth. The rookie guard says he expects players to test him. \"I'm 19, playing in a league full of grown men. I have to have that chip on my shoulder,\" he said. \"Going into the game, I can't be the kid that's soft that they take advantage of right away. . No one's going to go after Tyson (Chandler). He's been in the league 15 years.\"\n\nTRANSFORMATION OF BIRDMAN\n\nAndersen, previously known as Birdman, has recreated himself as \"Grizzilla,\" after arriving in Memphis at the trade deadline. The Grizzlies show him on the lineups that way. He is listed at 14 feet tall and 300 pounds wide, but still plays out of Blinn Junior College.\n\nUP NEXT\n\nSuns: Host New York on Wednesday.\n\nGrizzlies: Visit Cleveland on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994424.555854
}