{
  "game_id": "0021601182",
  "espn_id": "400900560",
  "date": "Apr 07, 2017",
  "matchup": "DET @ HOU",
  "headline": "Johnson hits late 3-pointer, Pistons beat Rockets 114-109",
  "body": "HOUSTON --  The Detroit Pistons gave some of their young and seldom-used players a chance to play Friday night, and it helped them beat the Houston Rockets.\n\nBoban Marjanovic, Detroit's 7-foot-3 backup center, led the Pistons with a career-high 27 points with 12 rebounds off the bench and Stanley Johnson hit a tiebreaking 3-pointer with 32.4 seconds left before adding two free throws to lift the Pistons to the 114-109 victory Friday night.\n\n\"It was great and we had a bunch of guys out there that really wanted to play,\" coach Stan Van Gundy said. \"They weren't bogged down by the way the season has gone. They had great enthusiasm to play. I don't care when it is in the year or what the situation is that's a big part of this is just having a great enthusiasm to play and those guys just did.\"\n\nThe Rockets led by two after a dunk by Montrezl Harrell before Ish Smith made a basket to tie it. James Harden missed a 3-pointer on the other end, and Johnson's 3-pointer made it 110-107.\n\nHarden missed another 3-point attempt, and Johnson added the free throws to make it 112-107.  Harrell added a layup after that but Tobias Harris tacked on two more free throws with eight seconds left.\n\nHarden finished one rebound shy of a triple-double with 33 points, 12 assists and nine rebounds. He said players getting rest was no excuse for what happened on Friday night.\n\n\"Whoever is in the game has to know what they're doing on both ends of the floor,\" he said. \"And just go out there and try to execute.\"\n\nThe Pistons used a 12-1 spurt, capped by four points from Marjanovic, to cut the lead to 94-93 midway through the fourth quarter. Houston missed seven straight shots in span before Eric Gordon ended the drought with a 3-pointer to make it 97-93.\n\nA 3-pointer by Johnson tied it with about three minutes left before Harden made a pair of 3-pointers sandwiched around a layup by rookie Henry Ellenson to give Houston a 105-101 lead.\n\nEllenson finished with 15 points and 11 rebounds in his first career start.\n\nCoach Mike D'Antoni rested starting center Clint Capela and said he'll rest other players in the last three regular-season games after Houston clinched the third spot in the Western Conference on Wednesday.\n\nHowever, Harden and Patrick Beverley won't be among those who will sit out because they refused when he asked them.\n\nReggie Bullock made back to back 3-pointers early in the fourth quarter to get the Pistons within 6. But Houston made the next six points to extend its lead to 93-81.\n\nSmith got the Pistons within 1 point with a jump shot with about nine minutes left in the third quarter before Houston used a 10-3 run, with two 3-pointers from Harden, to make it 69-61 midway through the period.\n\nThe Pistons scored seven straight points, with five from Harris, to cut the lead to 76-73 with about two minutes left in the quarter.\n\nBut Houston outscored the Pistons 9-2 the rest of the quarter to lead 87-75 entering the fourth. Lou Williams scored the seven points in that span and Harden capped the run with a reverse layup.\n\nHouston led by as many as 11 in the first half and was up 54-52 at halftime.\n\nTIP-INS\n\nPistons: Michael Gbinije missed the game with a respiratory infection. ...  Smith finished with 20 points. ... The Pistons had just six turnovers. ... Andre Drummond had 15 points and 11 rebounds.\n\nRockets: Harden made seven 3-pointers for his 35th game this season with at least four 3-pointers. ... Beverley had six points and a career-high 13 rebounds.\n\nTHEY SAID IT\n\nMarjanovic on his career-best performance: \"I'm more happy because we won this against a very, very good team. We just played hard like you're supposed to do.\"\n\nANDERSON'S RETURN\n\nRyan Anderson returned after missing the last six games with a sprained right ankle. He had nine points, three rebounds and a block. D'Antoni said before the game that he'd limit him to 20 minutes in his first game back, but played him for just 13 minutes, where were all in the first half.\n\nUP NEXT\n\nPistons: Visit Memphis on Sunday.\n\nRockets: Visit Sacramento on Sunday.\n\n---\n\nMore AP NBA: apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764996020.088622
}