{
  "game_id": "0022200257",
  "espn_id": "401468412",
  "date": "Nov 22, 2022",
  "matchup": "MEM vs. SAC",
  "headline": "Fox scores 32 as Kings beat Grizzlies for 7th straight win",
  "body": "MEMPHIS, Tenn. -- — De’Aaron Fox had 32 points and eight rebounds, Harrison Barnes added 26 points and the Sacramento Kings won their seventh straight, 113-109 over the Memphis Grizzlies on Tuesday night.\n\n\r\n              Kevin Huerter scored 18 points, hitting 6 of 10 from the field, including 4 of 7 from 3-point range. Malik Monk finished with 14 points as the Kings managed to hold on after leading by 14 midway through the fourth quarter. Fox also had six of Sacramento's 27 assists on 39 made baskets.\n\n\r\n              Ja Morant, returning after missing a game with a sprained left ankle, led Memphis with 34 points, six assists and seven rebounds. Jaren Jackson Jr. added 22 points and five blocks, and Dillon Brooks finished with 14 points as the Grizzlies lost their fourth of five.\n\n\r\n              Memphis forced turnovers with tough defense to make the game close late. Morant’s three-point play with 5.3 seconds left cut the Kings’ advantage to 109-108, but two free throws by Monk and Morant missing two of three free throws with 1.7 seconds left preserved the Kings’ victory.\n\n\r\n              “I missed. Game over,” Morant said of the final free throws.\n\n\r\n              “It got really close,” Jackson said. “I thought we did a good job at the end playing good defense. ... We were just playing really good defense. We had it.”\n\n\r\n              Kings coach Mike Brown said Barnes’ veteran leadership was key to Sacramento holding the lead.\n\n\r\n              “He really settled us down down the stretch,” Brown said. “Obviously, we were haywire out there. Going crazy, and Harrison just made some big plays down the stretch.”\n\n\r\n              Memphis' skid has come at a time when injuries have kept key players out of action.\n\n\r\n              Desmond Bane continued to be sidelined because of a sprained right big toe. Morant started after hurting his ankle Friday against Oklahoma City.\n\n\r\n              The game was close in the first half until the Kings built an eight-point lead with a second-quarter burst. Sacramento led 64-59 at the break.\n\n\r\n              Fox, named Western Conference player of the week on Monday, got rolling in the third, scoring 13 points as the Kings extended the lead to 88-76 entering the fourth.\n\n\r\n              They were thrilled to keep their winning streak intact.\n\n\r\n              “It feels good,” said reserve Chimeze Metu, who finished with 10 points, making 5 of 7 shots. “Obviously, we don’t want it to end. We just need to keep it going.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: Fox recorded his 450th career steal in the second quarter. ... The seven-game winning streak is Sacramento’s longest since 2005. ... Fox has five games with at least 30 points. ... Sacramento saw its string of six straight games scoring at least 120 points snapped.\n\n\r\n              Grizzlies: Are now 6-2 at home. ... Memphis had won seven straight in the series, including on Oct. 27 at Sacramento. ... C Steven Adams had 16 rebounds. ... Morant had 20 points in the fourth quarter.\n\n\r\n              CLOSE OUT\n\n\r\n              The Kings have closed out several of their games during the streak with big runs — 18-5 against Detroit, 12-4 to defeat Brooklyn and 12-2 in a win over Golden State.\n\n\r\n              This time, Sacramento had to hang on late, but Brown was happy about his team's energy level.\n\n\r\n              “Guys start to feel the need to play with a sense of urgency defensively,” Brown said. “So defensively, you can see the intensity at the end of the game compared to the flow of most of the game. It’s not even close.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Atlanta on Wednesday.\n\n\r\n              Grizzlies: Host New Orleans on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994228.4400792
}