{
  "game_id": "0021400831",
  "espn_id": "400579123",
  "date": "Feb 23, 2015",
  "matchup": "CHI vs. MIL",
  "headline": "Bulls hit boards to beat Bucks 87-71",
  "body": "CHICAGO --  The shooting was terrible, all night long. The difference was the Chicago Bulls went to the glass, over and over again.\n\nTony Snell scored 20 points, Nikola Mirotic had 16 points and a career-high 14 rebounds, and the surging Bulls pounded the Milwaukee Bucks on the boards on their way to an 87-71 victory Monday.\n\nPau Gasol added 15 points and 10 rebounds as the Bulls enjoyed a whopping 62-41 advantage on the glass. Joakim Noah had eight points and 16 rebounds on his bobblehead night, and Jimmy Butler finished with 11 points and nine boards.\n\n\"Good work on the glass,\" Gasol said. \"I mean, they played small most of the time, so that kind of facilitates things on the rebounding end. But good activity, good effort on our part.\"\n\nMilwaukee shot 34 percent (30 for 89) from the field in its second straight loss after a stretch of nine wins in 10 games. Ersan Ilyasova had 15 points and 11 rebounds in his first start since Jan. 27 at Miami.\n\nChicago played without key reserves Taj Gibson and Kirk Hinrich, who were away from the team due to illness. Snell and Mirotic both provided a big boost off the bench.\n\nThe Bulls grabbed control in the first half and led by double digits for most of the final three quarters. Butler had an impressive rebound dunk off a miss by Aaron Brooks, and Mirotic made two foul shots to make it 75-56 with 6:29 left.\n\nChicago won for the sixth time in its last seven games despite an awful performance by point guard Derrick Rose, who had eight points on 1-for-13 shooting. Rose is averaging 10.7 points on 23.5 percent shooting in three games since the All-Star break.\n\n\"I actually liked the way he played tonight, even though he didn't shoot well,\" coach Tom Thibodeau said. \"I thought he was very aggressive defensively at the start of the game. I thought he got us going up the court quickly, and those are things you want to see.\"\n\nRose's off night helped send the Bulls to 35.5 percent shooting, and he had three of Chicago's 18 turnovers.\n\nThe Bucks have dropped two of three since they shipped leading scorer Brandon Knight to Phoenix in a three-team trade on Thursday. Milwaukee got Michael Carter-Williams from Philadelphia in the deadline deal, but the point guard has been sidelined by a right foot strain.\n\n\"We're waiting to get Michael Carter-Williams healthy and on the floor, but it is going to take us some time to get the offense clicking,\" coach Jason Kidd said. \"We had some good looks that just didn't go down for us.\"\n\nCarter-Williams said after the game that he expects to play Wednesday against the 76ers. In the meantime, Jerryd Bayless had eight points, eight rebounds and five assists in his third consecutive start at the point, but the Bucks looked like a team in transition while playing without Knight and Carter-Williams.\n\n\"We didn't make shots,\" Bayless said. \"They did what they always do to everybody. We just didn't capitalize. We got good looks but we just didn't knock them down tonight.\"\n\n---\n\nSNELL'S SURGE\n\nSnell was 7 for 11 from the field, including a 4-for-6 performance from 3-point range. The 6-foot-7 guard is averaging 11.5 points in his last 14 games after struggling earlier in the season.\n\n\"I was just trying to rush things,\" Snell said. \"As time goes on, I get more in-game experience, I'm just relaxing more and just trying to play the game.\"\n\nTIP-INS\n\nBucks: Kidd said the Bucks try to schedule Jabari Parker's treatment and rehab around practice and shootarounds so the former Chicago prep star can stay around the team. Parker is out for the season after injuring his left knee on Dec. 15. \"He looks great,\" Kidd said. \"All the texts and the emails that we got on his rehab (indicates) that it is going really well.\" ... The Bucks dropped to 15-14 on the road. The last time they finished with a winning road record was a 21-20 mark for the 2000-01 season.\n\nBulls: Chicago improved to 3-0 against Milwaukee this season and has won six straight against the Bucks dating to last season. ... Gasol was frequently double-teamed in his first game against Milwaukee since he scored a career-high 46 points in Chicago's 95-87 victory on Jan. 10.\n\nUP NEXT\n\nBucks: Host Philadelphia on Wednesday night.\n\nBulls: Host Charlotte on Wednesday night.\n\n---\n\nJay Cohen can be reached at http://www.twitter.com/jcohenap",
  "source": "espn_api",
  "crawled_at": 1764991661.702667
}