{
  "game_id": "0022400631",
  "espn_id": "401705197",
  "date": "Jan 24, 2025",
  "matchup": "PHI vs. CLE",
  "headline": "Short-handed 76ers beat Cavaliers 132-129 to end 7-game losing streak",
  "body": "PHILADELPHIA -- — Paul George scored 30 points, Tyrese Maxey had 29 and the short-handed Philadelphia 76ers beat the Cleveland Cavaliers 132-129 on Friday night to end a seven-game losing streak.\n\n\r\n              Cleveland lost its second straight to drop into a tie for the NBA lead with Oklahoma City at 36-8. Philadelphia is 16-27.\n\n\r\n              Donovan Mitchell scored 37 points for Cleveland, and Ty Jerome had a career-high 33, making all eight of his 3-point tries.\n\n\r\n              Philadelphia star center Joel Embiid missed his 10th straight game because of a left knee injury. He also was ruled out by coach Nick Nurse at Chicago on Saturday night.\n\n\r\n              Jerome’s second straight 3-pointer put Cleveland up 116-110 with 6:17 remaining, but the 76ers ran off 13 consecutive points to go up seven. The Cavaliers had the ball with a chance to tie it, but Jerome turned it over on an inbounds play.\n\n\r\n              Kelly Oubre Jr. added 22 points for the 76ers. Darius Garland had 26 for Cleveland.\n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland showed it can be beaten by a hot-shooting team from the perimeter.\n\n\r\n              76ers: Though it hasn’t happened much this season, Philadelphia proved it can win against the league’s top teams without Embiid. \n\n\r\n              Key moment\r\n              Eric Gordon hit a go-ahead 3-pointer for Philadelphia that made it 117-116, and capped a 13-0 run over 2:58 with another 3 with 3:19 to play to make it 123-116.\n\n\r\n              Key stat\r\n              \r\n              The teams combined for 46 3-pointers.\n\n\r\n              Up next\r\n              Both teams are back in action Saturday night. Cleveland hosts the Rockets in a rematch of the Cavs' 109-108 loss at Houston on Wednesday night. Philadelphia is at Chicago.\n\n\r\n              ------\n\n\r\n              AP College Basketball: https://apnews.com/hub/college-basketball",
  "source": "espn_api",
  "crawled_at": 1764998217.475908
}