{
  "game_id": "0022200035",
  "espn_id": "401468190",
  "date": "Oct 22, 2022",
  "matchup": "DEN vs. OKC",
  "headline": "Jokic, Murray lead tired Nuggets past Thunder 122-117",
  "body": "DENVER -- — On the night the Denver Nuggets celebrated Nikola Jokic's second straight MVP trophy and their superstar tied Wilt Chamberlain for sixth all-time with his 78th triple-double, it was Jamal Murray who got the strongest hugs from his coach and biggest ovations from the crowd.\n\n\r\n              “It's been a minute since I got to feel that,” Murray said after scoring 16 points in Denver's 122-117 win over the Oklahoma City Thunder in his first home game in more than 18 months. \n\n\r\n              Murray, who missed last season with a torn left ACL he sustained in San Francisco in April 2020, sank a pair of free throws with 9.7 seconds left to put the Nuggets ahead by four and Jokic capped the scoring by sinking one of two foul shots with 2.5 seconds remaining when Murray came out an embrace from coach Michael Malone and the sellout crowd of 19,983.\n\n\r\n              Jokic had 19 points, 16 rebounds and 13 assists for the Nuggets, whose flight following their big win at Golden State barely beat the sunrise Saturday.\n\n\r\n              “I give our team a ton of credit because this game came down to mental toughness,\" Malone said. “Getting in at 4 in the morning. Three games in four nights. No excuses, no explanations. Do your job.”\n\n\r\n              That, they did. \n\n\r\n              Michael Porter Jr. added 22 points and Kentavious Caldwell-Pope chipped in 21 points. Rookie Christian Braun had a trio of 3s as Denver shot 20-of-38 from long range.\n\n\r\n              Shai Gilgeous-Alexander led the Thunder with 28 points and Josh Giddey had 19 points and 12 boards.\n\n\r\n              “Credit Denver,” Thunder coach Mark Daigneault said. “I thought they made big shots tonight, 52% from 3. They made us pay for every mistake with their shooting, which is what good teams do.”\n\n\r\n              Just like the Timberwolves on Wednesday night, the Nuggets couldn't shake the Thunder until the closing seconds.\n\n\r\n              “I'm proud of the guys, the way we fought against an experienced team like Denver and kept it right to the wire,\" Giddey said.\n\n\r\n              Murray, who tore his left ACL on April 12, 2021, sat out Denver's big win at Golden State on Friday night in San Francisco because the Nuggets don't want him playing back-to-back nights early on. After a choppy return in Denver's season-opening loss at Utah on Wednesday night, Murray started to look like his old self by the third quarter Saturday night.\n\n\r\n              “Once he found his rhythm, we started seeing flashes of old Jamal,” Malone said, “the fadeaways, the step-backs, creating separation and tough shots, the two-man game between he and Nikola. And that is so much fun to watch.”\n\n\r\n              Jokic, who cautioned Murray against coming back late last year if he wasn't mentally and physically ready, is enjoying his sidekick's return, too.\n\n\r\n              “He's trying to get back in a rhythm,” Jokic said. “But today he looked really good to me.”\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Oklahoma City plays five of its next six games at home. ... The Thunder was without rookie G Jalen Williams, the 12th overall pick in the draft, who underwent surgery after fracturing his right orbital bone in the opener at Minnesota. \n\n\r\n              Nuggets: The Broncos' low-key celebration of Jokic's second straight MVP award consisted of a short video during the first timeout. Jokic was ejected from a playoff game when the Nuggets celebrated his first MVP trophy in 2021. He was already back in Serbia when he won his second Maurice Podoloff Trophy last summer.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Returns to Oklahoma City for home opener against the Minnesota Timberwolves on Sunday night.\n\n\r\n              Nuggets: Get a brief reprieve after playing three games in four nights. Their next game is Monday night at Portland.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994742.76736
}