{
  "game_id": "0021500484",
  "espn_id": "400828371",
  "date": "Dec 31, 2015",
  "matchup": "MIL @ IND",
  "headline": "Middleton scores 33 as Bucks beat Pacers 120-116",
  "body": "INDIANAPOLIS --  Khris Middleton and the Milwaukee Bucks held on. Barely.\n\nMiddleton scored 33 points, and the Bucks beat the weary Indiana Pacers 120-116 on Thursday night.\n\nGreg Monroe added 23 points for Milwaukee, which shot 58 percent (45 for 77) from the field. Jabari Parker, Giannis Antetokounmpo and reserve Jerryd Bayless had 14 points apiece.\n\nThe Bucks grabbed a 111-95 lead on Michael Carter-Williams' jumper with 4:41 left, but the Pacers scored 19 of the next 25 points to close to 117-114 on Paul George's two foul shots with 1:16 remaining. Solomon Hill's dunk trimmed the Bucks' lead to two with 7.7 seconds left, but Middleton hit two free throws to help Milwaukee stop a three-game losing streak.\n\n\"We survived,\" Bucks interim coach Joe Prunty said. \"Down the stretch, we have to keep our composure and make our free throws. At the end of the day we were able to get a win.\"\n\nGeorge led the Pacers with 31 points. George Hill added 15 points and six rebounds.\n\nIndiana was coming off a 102-100 overtime loss at Chicago on Wednesday night.\n\n\"We wanted to play with pace, high energy and get stops,\" Middleton said. \"We knew they were coming into a back-to-back and played in overtime. We're a better team when we're pushing the ball and getting easy baskets. They changed the game. They got back in it and had a chance to win the game. We have to do a better job of being ready for that type of pressure.\"\n\nThe difference was superb shooting for Milwaukee, and Indiana's 20 turnovers led to 35 points for the Bucks.\n\nThe night didn't start well for the Pacers and the Bucks made the most of their slow start. Milwaukee shot 59 percent in the first half and led by as many as 13 points on its way to a 59-52 lead at the break.\n\n\"We were a little out of sync offensively,\" Pacers coach Frank Vogel said. \"I'm proud of the guys for fighting and staying in it, but we've got to play the first three quarters.\"\n\nThe Pacers found a little bit of momentum at the start of the third quarter, attacking the basket instead of settling for pull-up jumpers, and the result was an 11-2 run that put Indiana ahead 63-61.\n\nBut Milwaukee bounced right back, outscoring Indiana 28-14 to close out the third quarter.\n\n\"We were able to maintain through the last punch they threw,\" Monroe said. \"We need any win we can get right now. We know we need to come out and clean some things up from this game.\"\n\nTIP-INS\n\nBucks: All five starters scored in double figures, combining for 95 of Milwaukee's 120 points.\n\nPacers: George scored more than 18 points for the first time since Indiana lost to Memphis on Dec. 19.\n\nGETTING OVER THE HUMP\n\nMilwaukee got its first win of the season over an opponent that shot 50 percent or better from the field. Indiana shot 50 percent (41 for 82). The Bucks were 0-8 coming into the day when an opponent made at least half of its shots. They also improved to 3-17 when an opponent scores 100 points or more and 5-15 against teams with winning records.\n\nDEEP THREATS\n\nMiddleton and Bayless are among the best in the league from 3-point range so far this season. Middleton was 4 for 6 from beyond the arc against Indiana, and Bayless was 2 for 4.\n\nMISSING MAN IN MIDDLE\n\nIan Mahinmi, Indiana's starting center, was injured in Wednesday's 102-100 overtime loss to Chicago and did not dress due to a sore left knee. Lavoy Allen started Thursday in place of Mahinmi and finished with 14 points and four rebounds.\n\nUP NEXT\n\nBucks: At Minnesota on Saturday\n\nPacers: Host Detroit on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994064.7621288
}