{
  "game_id": "0022200855",
  "espn_id": "401469010",
  "date": "Feb 12, 2023",
  "matchup": "MEM @ BOS",
  "headline": "White's 23 points helps Celtics past Grizzlies 119-109",
  "body": "BOSTON -- — Derrick White scored 23 points to help a shorthanded Boston team hold off Ja Morant and the Memphis Grizzlies 119-109 on Sunday. \n\n\r\n              Sam Hauser added 20 points, tying his career-high with six 3-pointers, Al Horford had 16 points and Payton Pritchard added 12 for Boston, which won its fourth straight. Celtics star Jayson Tatum didn't have his sharpest game, finishing with 16 points but making 3 of 16 shots and missing 7 of 8 on 3-point attempts.\n\n\r\n              “That’s the beauty of this team,” said White, who also had 10 assists. “We’re just so deep. We’ve got a lot of guys that can do a little bit of everything.”\n\n\r\n              Morant led the Grizzlies with 25 points, seven assists and six rebounds, while Desmond Bane scored 18 and Jaren Jackson Jr. had 15 points and seven rebounds. \n\n\r\n              Boston was without starting point guard Marcus Smart, who missed his 10th straight with a bone bruise in his right ankle, as well as forward Jaylen Brown (facial fracture he suffered from an inadvertent elbow by Tatum) and reserve guard Malcolm Brogdon (sore Achilles).\n\n\r\n              Boston moved to 1 1/2 games ahead of the idle Bucks for the Eastern Conference's best record ahead of their matchup in Milwaukee on Tuesday.\n\n\r\n              The Celtics were clinging to a one-point lead early in the final quarter before White scored six points — with a conventional three-point play and 3-pointer from the right wing — during a 16-7 spurt that moved them ahead 104-94 with just over four minutes to play. \n\n\r\n              “We have some of our top dogs out now and it's just an opportunity for guys to showcase what they can do,” Hauser said. “Try to fill that void of the guys that were out. They bring a lot to the table. We try to do our best to do whatever we can to help the team win.”\n\n\r\n              Horford nailed three 3-pointers in the final five minutes.\n\n\r\n              Trailing by 13 at halftime, the Grizzlies used a 13-point third quarter by Morant that featured one-handed driving baskets, flips in the lane and twisting shots to wipe out the deficit, taking the lead briefly late in the third, \n\n\r\n              Morant said last month that he wasn’t worried about facing any team in the West in the playoffs. He brought it up again Sunday. \n\n\r\n              “The confidence I had when I said that is the confidence that got us to the point where we’re at now — being one of the top teams in this league,” he said. \n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Center Steven Adams missed his 10th consecutive game with a knee injury. … Morant missed his first three free-throw attempts. … They held a two-point lead after one quarter despite hitting only 2 of 9 3s while Boston was 6 of 13. They finished just 12-for-34 from beyond the arc.\n\n\r\n              Celtics: Pritchard hit his first three shots from the floor — all 3s. “It's big, especially as a role player,” Pritchard said of his start. “When hit your first one it definitely, anybody that says it doesn't is lying to you, it definitely gives you confidence.”\n\n\r\n              OFF WHEN AWAY \n\n\r\n              The Grizzlies’ road struggles continued, dropping them to 11-17 away from home.\n\n\r\n              “How do you correct that?” coach Taylor Jenkins said before the game. “It’s got to be a mentality, for sure, obviously you trust all the work you’re putting in. … Guys have to be even more confident together on the road. We know what our standard is and that’s what it’s about and we don’t live up to that standard on the road.” \n\n\r\n              NICE MOMENT\n\n\r\n              Jeannine Russell, wife of late Celtics legend Bill Russell, was seated courtside. She got a standing ovation when the PA announcer welcomed her as she was shown on the videoboard.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host the Utah Jazz on Wednesday, starting a stretch of three of four at home.\n\n\r\n              Celtics: At the Bucks on Tuesday in a matchup of the league’s top two teams.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994184.7985868
}