{
  "game_id": "0022000319",
  "espn_id": "401267479",
  "date": "Feb 01, 2021",
  "matchup": "PHX @ DAL",
  "headline": "Booker hits winning 3 in return as Suns edge Mav 109-108",
  "body": "DALLAS -- — Phoenix Suns coach Monty Williams gladly confessed that he junked his plan to carefully monitor Devin Booker’s minutes down the stretch with his All-Star guard playing for the first time since Jan. 22.\n\n\r\n                    Booker hit a 3-pointer with 1.5 seconds left in his return and the Suns rallied past the Dallas Mavericks for the second straight game, winning 109-108 on Monday night. \n\n\r\n                    Booker finished with 24 points, 20 in the second half, and 31 minutes. He went into the game ranked 12th in the NBA averaging 35.7 minutes per game before being sidelined with a left hamstring strain.\n\n\r\n                    “I imagine if I’d have taken Book out, that would have been the first time you’d seen a player knock a coach out on the sidelines,” Williams said.\n\n\r\n                    The Suns trailed by 11 with 4:48 to play in the third quarter before winning their third straight, including a 111-105 victory at Dallas on Saturday when they trailed by 15 late in the third quarter.\n\n\r\n                    The Mavericks dropped their sixth in a row, their ninth loss in their last 11 games and their fourth straight defeat at home. Luka Doncic missed a 27-foot shot at the buzzer.\n\n\r\n                    Booker took a pass on the winning basket from Chris Paul, who finished with a season-high 34 points to go with nine rebounds and nine assists. Deandre Ayton had 10 points and 17 rebounds for his seventh double-double in his past eight games.\n\n\r\n                    Doncic led the Mavericks with 25 points following a slow start in which he scored only two points in the first quarter on free throws. Josh Richardson scored a season-high 24 points and Kristaps Porzingis added 19, 14 in the second half, after sitting out Saturday’s game.\n\n\r\n                    Dallas coach Rick Carlisle said his team was aware it had a foul to give on the Suns’ winning possession.\n\n\r\n                    “We didn’t take it. That falls on me,” Carlisle said. “There’s not going to be any finger-pointing.”\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Ayton scored only two points in the second half. … Phoenix has won six straight against Dallas going back to last season in the Orlando bubble.\n\n\r\n                    Mavericks: The return of Maxi Kleber after missing 11 games in the health and safety protocols gave Dallas a full roster without any injury designations for the first time since Dec. 4, 2019, a span of 425 days. … Porzingis and Kleber started together for the first time this season in the Mavericks’ 12th starting lineup.\n\n\r\n                    MANAGING PORZINGIS’ MINUTES\n\n\r\n                    Carlisle said he’s getting closer to routinely playing Porzingis in back-to-back games. Porzingis has played back-to-backs only once in three opportunities since being activated three weeks ago coming off October knee surgery.\n\n\r\n                    “Let me be clear, he wants to play in all of these games,” Carlisle said. “It really bothers him.”\n\n\r\n                    Dallas’ next back-to-back will be this Wednesday and Thursday, at Atlanta and home against Golden State. The next one after that will be Feb. 22-23, home games against Memphis and Boston.\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: End a three-game road trip at New Orleans on Wednesday. Three of the Suns’ past five games against the Pelicans have gone to overtime.\n\n\r\n                    Mavericks: Visit Atlanta on Wednesday. It will pit Doncic against Hawks guard Trae Young after their rights were traded for each other in the 2018 draft. They split two meetings as rookies and haven’t faced each other since.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997758.1328871
}