{
  "game_id": "0021800987",
  "espn_id": "401071660",
  "date": "Mar 09, 2019",
  "matchup": "ATL vs. BKN",
  "headline": "Nets hold off Hawks 114-112 for 3rd straight win",
  "body": "ATLANTA --  Spencer Dinwiddie didn't care that the Brooklyn Nets gave an ugly performance. They still escaped Atlanta with a victory.\n\n\"Honestly, we just got enough stops, just barely enough stops,\" Dinwiddie said. \"We gave up a lot and we missed a lot of free throws that made it harder on ourselves than it really needed to be.\"\n\nDinwiddie scored 23 points, Jarrett Allen added 20 points and 12 rebounds and Brooklyn held off the Atlanta Hawks 114-112 on Saturday night for their third straight win.\n\nThe Nets moved one percentage point out of sixth place in the Eastern Conference despite missing a staggering 21 free throws to give the Hawks a chance at the end. After Joe Harris hit one of two foul shots with 16.3 seconds remaining, Trae Young couldn't get a shot off against a defensive trap, so he dribbled down the clock and passed to 42-year-old Vince Carter, who missed a 3-point attempt at the buzzer.\n\nJohn Collins finished with 33 points and a career-high 20 rebounds for Atlanta, and Young had a triple-double, the first by a rookie in Atlanta history, with 23 points, 11 assists and 10 rebounds.\n\nYoung and Collins combined to score 27 points in the fourth and keep Atlanta close. Young hit a pair of free throws with 5:11 left, giving Atlanta its first lead since the first quarter, but Brooklyn never trailed again after D'Angelo Russell's 3 made it 111-109 with 1:41 remaining.\n\n\"We were going basket for basket at one point and we needed to get a stop or two to get a big lead,\" Young said. \"We just weren't able to do it.\"\n\nThe Nets improved to 17-5 since Dec. 7 in games in which the margin has been five points or fewer in the final five minutes.\n\nAtlanta, still in rebuilding mode under first-year coach Lloyd Pierce, has lost three straight.\n\nBrooklyn took its first lead at 13-12 on Russell's straightaway 3, and its second when Dinwiddie's bank shot made it 22-21. With the score tied at 41-all in the second, the Nets closed the quarter on a 15-6 run.\n\nThey aggressively went to the rim in the first half, resulting in 23 free throws, but Brooklyn missed eight times from the foul line to set the tone for an even worse second half.\n\n\"We had a ton of open looks in the first half and couldn't convert them, and in the second half it was more of the free throws,\" Nets coach Kenny Atkinson said. \"Something happened there. I'm not sure what.\"\n\nTIP-INS\n\nNets: G Shabazz Napier missed the game for personal reasons. Since scoring 22 points against Washington on Feb. 27, Napier sat on the bench for two games and averaged six minutes and one point in two other games. ... F Treveon Graham was sidelined a third straight game with back soreness. Atkinson said it was too early to tell when Graham will return, but doesn't expect his absence to be much longer. ... Dinwiddie surpassed Armen Gilliam in 1993-94 with the most single-season points in a reserve role.\n\nHawks: Collins is the first Hawks player with a 30-point, 20-rebound game since Kevin Willis did so April 13, 1993. ... Young's triple-double is the first by a Hawk since Al Horford on Jan. 13, 2015. ... Atlanta began the game averaging 123.1 points since the All-Star break, best in the NBA, and was first in 3-pointers. ... Dewayne Dedmon missed the game with a right knee contusion.\n\nUP NEXT\n\nNets: Host Detroit on Monday before playing their next seven on the road.\n\nHawks: Host New Orleans on Sunday and Memphis on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995347.1766589
}