{
  "game_id": "0021500783",
  "espn_id": "400828670",
  "date": "Feb 08, 2016",
  "matchup": "OKC @ PHX",
  "headline": "Durant, Thunder pull away to beat Suns 122-106",
  "body": "PHOENIX --  Once Oklahoma City star Kevin Durant found his shot, it was all over for slumping Phoenix.\n\nThe man the Suns' P.J. Tucker called \"the best scorer on the planet probably\" scored 25 of his 32 points in the second half, and the Thunder pulled away in the final four minutes to hand the Suns their eighth consecutive loss, 122-106 on Monday.\n\nDurant was just 5 for 15 from the field before he made his last six shots, four of them 3-pointers.\n\n\"Sometimes it only takes one shot for me, sometimes it doesn't even take a shot,\" Durant said. \"I'm just always in a mode where I feel confident every shot I put up.\"\n\nThe Suns, losers of 23 of their last 25 games, were in it most of the way and led by as many as six late in the third quarter. But Durant sank two 3s in a 16-4 Oklahoma City run to finish the game.\n\n\"We kind of settled in the last six minutes of the fourth quarter,\" Thunder coach Billy Donovan said, \"and Kevin obviously was the catalyst to that.\"\n\nRussell Westbrook had 29 points for the Thunder, who were coming off a 116-108 loss at Golden State on Saturday night.\n\nPhoenix forward Markieff Morris pointed to the damage done by the rest of Oklahoma City.\n\n\"They're a great team, they have two superstars,\" Morris said, \"and when you play a team like that you've got to try to limit their role players. Their role players got off and it's tough to beat a team like that when everybody puts points on the box.\"\n\nMorris scored 23 points for Phoenix, and Archie Goodwin had 20. Mirza Teletovic added 17 points, including 14 in the second quarter when the Suns scored on their first 15 possessions but still couldn't take the lead.\n\nThey finally did in the third quarter.\n\nTeletovic's fourth 3-pointer started a 7-0 spurt that put Phoenix up 81-75 on Devin Booker's bank shot with 2:38 left in the third quarter. Booker's behind-the-back pass to Tucker for a fast-break layup put the Suns ahead 89-85 with 1:19 left in the quarter.\n\nThe Thunder went ahead for good with a 17-1 run at the end of the third quarter and beginning of the fourth, taking a 99-88 lead with 8:48 to play.\n\nThe Suns managed one more spurt. Goodwin's two free throws cut the Thunder lead to 106-102 with 4:18 to play.\n\nThen Durant and Westbrook closed it out. Durant had two 3s in the final run, one from 28 feet and the last from 26 feet to make it 120-106 with 1:30 to go.\n\nTHAT SECOND QUARTER\n\nPhoenix trailed 28-19 at the end of one, and then reserves Teletovic and Alex Len powered the Suns' rally. Phoenix finally caught up when Tucker hit Tyson Chandler for a layup to make it 54-54 with 1:25 left in the half.\n\n\"I think you see our team, we're growing, we're getting better,\" Phoenix interim coach Earl Watson said. \"We're not discouraged. We won't be discouraged.\"\n\nTIP-INS\n\nThunder: The Thunder made 15 of 33 3s to the Suns' 1 for 11. ... Oklahoma City didn't shoot a free throw until Westbrook went to the line with 2:32 left in the first half. ... Durant hasn't scored fewer than 20 points since Nov. 10 at Washington, a span of 38 games.\n\nSuns: Tucker played the entire game before fouling out with 2:02 to play. ... Booker was 1-for-8 shooting, scored six points and fouled out with 7:10 to play. ... Phoenix signed guard Jordan McRae to another 10-day contract.\n\nUP NEXT\n\nThunder: Host New Orleans on Thursday night.\n\nSuns: Host Golden State on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994156.340487
}