{
  "game_id": "0021600005",
  "espn_id": "400899379",
  "date": "Oct 26, 2016",
  "matchup": "DAL @ IND",
  "headline": "Turner's opening act leads Pacers past Mavs, 130-121 in OT",
  "body": "INDIANAPOLIS --  Myles Turner walked onto center stage Wednesday night -- and looked as comfortable in his starring role.\n\nThe Indiana Pacers second-year center scored 30 points, tied his career high with 16 rebounds, blocked four shots and made a 3-pointer in overtime that started the decisive 8-0 run in his first opening night start.\n\nIf Turner keeps this up, the Pacers could be celebrating a lot more than just a 130-121 season-opening victory over the Dallas Mavericks.\n\n\"I was talking to some of my friends about and they were saying `Take it easy on Dallas tonight,\" Turner said. \"It was cool to go out like that against my hometown team. After the final buzzer sounded, everything hit me. It was just like, `Wow, I just did that.\"\n\nBefore the game, new coach Nate McMillan told reporters he expected NBA teams to defend Turner differently this season and said his budding 20-year-old star would have to adapt. He looked just fine against the Mavs.\n\nIn a game that was supposed to be all about the Pacers' revamped roster and new up-tempo style, Turner stole the show by making 13 of 19 shots, coming up with big play after big play and overshadowing All-Stars Paul George and Dirk Nowitzki.\n\nGeorge added 25 points, including another 3 with 55 seconds left to seal Indiana's fifth season-opening win in six years.\n\n\"I loved the fight our guys showed in that overtime,\" McMillan said.\n\nDeron Williams led Dallas with 25 points. J.J. Barea and Nowitzki each had 22 as the Mavs lost their fifth in a row in the series.\n\nDallas only led twice all night but managed to force overtime when Harrison Barnes' open 3 tied the score at 115 with 2.3 seconds left.\n\nTurner could have won it in regulation with a long buzzer-beating 3, but the shot bounced off the back of the rim.\n\n\"He did a little bit of everything to hurt us,\" Dallas coach Rick Carlisle said of Turner. \"It was not just one thing he did. He was active and he got the ball in the basket.\"\n\nTIP-INS\n\nMavericks: Barnes and Andrew Bogut, the two former Golden State Warriors, finished with 19 points and six points, respectively, in their Dallas debuts. ... Nowitzki didn't make his first basket until almost two minutes into the second quarter. ... Barea played despite being listed as questionable with a sprained left elbow. ... Team owner Mark Cuban attended the game.\n\nPacers: All five Indiana starters scored in double figures, including Jeff Teague, who had 20 points and eight assists in his first game with his hometown team. ... Indiana had 10 assists in the first quarter and finished with 30. ... The Pacers also had a 52-49 rebounding advantage despite going with their new, up-tempo style. ... The Oak Ridge Boys sang the national anthem.\n\n1, 2, 3, REPEAT\n\nDallas finished the game 18 of 48 from 3-point range, one short of its own franchise and NBA single-game record set in March 1996 against the New Jersey Nets. Six different players attempted at least six 3s for the Mavs. Indiana, in contrast, was 10 of 19 on 3s and no player attempted more than five.\n\nWELCOME BACK, COACH\n\nMcMillan was just as anxious as his new players to get started. McMillan had been the head coach previously in Seattle and Portland, but spent the previous three seasons as Frank Vogel's top assistant in Indiana.  \"I was surprised he was away from that position as long as he was,\" Carlisle said. \"He's a great coach, and I know him well, personally, too. He'll do a great job.\"\n\nUP NEXT\n\nMavericks: Dallas hosts a longtime rival in Houston on Friday night. It is the second of three meetings between the Texas teams during a 12-day span in October. They already played once in the preseason.\n\nPacers: Forward Thaddeus Young returns to his previous home when the Pacers visit Brooklyn on Friday night. Indiana won three of the four meetings with the Nets last season and is 4-3 all-time at the Barclays Center.",
  "source": "espn_api",
  "crawled_at": 1764996162.737306
}