{
  "game_id": "0021500732",
  "espn_id": "400828619",
  "date": "Feb 02, 2016",
  "matchup": "TOR @ PHX",
  "headline": "Lowry, Raptors hold off Suns, spoil Watson's coaching debut",
  "body": "PHOENIX -- The Toronto Raptors expected a spirited effort from the Phoenix Suns. That happens when a team changes coaches.\nHowever, the Raptors had enough to hold on for a 104-97 victory Tuesday night, spoiling the debut of Suns interim coach Earl Watson.\nKyle Lowry scored 26 points, including five 3-pointers, and DeMar DeRozan added 22 for the Raptors, whose franchise-record 11-game winning streak ended Monday in Denver,\n\"We knew they would come out and play extremely hard and try to do their thing\" Lowry said. \"We kind of weathered the storm, paced ourselves though the whole game and found a way to win the game.\"\n\nThe Raptors led the entire second half but had to hold on at the finish.\n\"The energy was there,\" Watson said. \"It's not really physical with our team, it's more mental and mental toughness is a fragile, unique path that you have to take.\"\nMarkieff Morris had 30 points and 11 rebounds, both season highs, for the Suns, who fired coach Jeff Hornacek on Monday and promoted the 36-year-old Watson to the interim job.\nMorris has had a difficult season, his playing time diminished after he said in the offseason he wanted traded after the Suns dealt his twin brother Marcus to Detroit.\nBut Watson considers Morris a major part of the team.\n\"I had a feeling if I gave him positive encouragement and let him know that no matter what, we love him no matter what happened beyond basketball,\" Watson said, \"and give him an opportunity to play and let him know he is going to play, he is going to get big minutes.\"\nMorris praised Hornacek.\n\"Jeff was my guy,\" Morris said. \"Me and him were was here for three years together and he was a great coach. I really liked him a whole lot. It is just how the league goes. we are definitely going to miss him but coach told me before the game I was going to get my shots and I just got hot.\"\nPhoenix rookie Devin Booker added 27 points, matching his career best with six 3s. Archie Goodwin had 18 points and a career-best 12 assists for the Suns, who have lost five in a row and 20 of their last 22.\nTerrence Ross scored 16 and Jonas Valanciunas 14 for Toronto in the Raptors' second stop on a six-game road trip.\nMorris scored 14 in the first quarter and Goodwin banked in a 35-footer at the buzzer to give Phoenix a 32-28 lead after one. It didn't last long.\nRoss scored five and Bismack Biyombo four in a 15-1 run that put the Raptors up 46-35 with 4:23 left in the half, and they never trailed again. The Suns scored the next eight to cut the lead to 46-43 but two late baskets by DeRozan gave Toronto a 52-45 lead at the break.\nPhoenix almost caught the Raptors with an 8-0 spurt in the third quarter, Mirza Teletovic's 3-pointer cutting Toronto's lead to 71-70 with 2:50 left in the period. But the Raptors outscored the Suns 7-1 the rest of the quarter.\nPhoenix made it interesting late when Booker's driving layup cut Toronto's lead to 99-94 with 1:59 to play but DeRozan sank his only 3-pointer of the night with 51.9 seconds to play and the Raptors held on from there.\n\"They came out with a lot of enthusiasm, juice, energy, which we felt usually happens and comes after a coaching change,\" Toronto coach Dwane Casey said. \"They played as well as they played for a while but we kept at it. We grinded it. (There were) some of the mental mistakes down the stretch we have to clean up. `'\nTIP-INS\nRaptors: Toronto improved to 7-8 in the second of back-to-back games. ... James Johnson sat out the game after spraining his left ankle Monday night in Denver. ... On Tuesday, Lowry and DeRozan were named Eastern Conference co-players of the month for January. ... Lowry made four of his first five 3-point tries.\nSuns: Goodwin's previous career best in assists was six. ... Newly hired assistant coach Bob Hill was on the bench. ... T.J. Warren is out for the season with a broken right foot. ... Phoenix opened a seven-game home stand. ... At 36, Watson is the youngest coach in the NBA, three months younger than Houston interim coach J.B. Bickerstaff.\nUP NEXT\nRaptors: At Portland on Thursday.\nSuns: Host Houston on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994722.1903749
}