{
  "game_id": "0021400151",
  "espn_id": "400578443",
  "date": "Nov 17, 2014",
  "matchup": "MEM vs. HOU",
  "headline": "Top teams' showdown fizzles as Memphis blows out Houston",
  "body": "MEMPHIS, Tenn. -- For a night, the Houston Rockets' new defensive mindset was blown up completely, leading to a blowout by the Memphis Grizzlies.\nThe Grizzlies dominated a showdown between the teams with the NBA's best records, running away from the Rockets in a 119-93 victory on Monday night.\n\"They just beat the hell out of us,\" Rockets coach Kevin McHale said.\nWhile the Rockets struggled, Memphis put together its best all-around performance of the season.\n\"This team could easily come in and beat us by 30, and we came in and stayed focused,\" said point guard Mike Conley, who led the Grizzlies with 19 points and six assists. \"I thought it was a good statement to the rest of the league that we're one of the teams to be reckoned with.\"\nWhatever showdown was expected from the two 9-1 teams and among the best defensive squads in the league never materialized as Memphis took a 16-point lead in the first quarter and extended it in each of the remaining periods, until it reached 36 points in the fourth.\nMemphis coach Dave Joerger said it was nice \"to come out and throw the first punch.\"\n\"We played with force and quick attacks in the paint,\" he said.\nSeven players finished in double figures for Memphis, which won its fourth straight overall. Courtney Lee finished with 15 points, while Zach Randolph added 14. Quincy Pondexter, Beno Udrih and Jon Leuer had 13 points each.\nTrevor Ariza led the Rockets with 16 points, while Dwight Howard had 15 points and nine rebounds. Patrick Beverly managed 10 points. James Harden had six points, going 1 of 8 from the field.\nThe Rockets, who entered the game allowing a league-low 89 points a game, had given up that many by the end of the third quarter.\nHouston, which was coming off a 69-65 win Sunday night at Oklahoma City, was a step off all night. Through three quarters, Harden, having to deal with Tony Allen, was misfiring and appeared frustrated. Turnovers plagued the Rockets from the start and the shooting hovered around 40 percent as Memphis took the lead to as many as 31 in the third quarter.\nMcHale considered it pointless after three with Memphis leading 97-66 and sat his key players for the fourth.\n\"When we made mistakes, they capitalized on them,\" Ariza said. \"Take no credit away from them. They just straight beat us. That's the truth.\"\n------\nTIP-INS:\nRockets: The Rockets have two former University of Memphis post players -- rookie Tarik Black and Joey Dorsey. Black, who left Memphis for one year at Kansas, was booed when he entered in the first quarter. Dorsey received a nice ovation when he came in ...The loss was the Rockets first on the road this season after winning their first six.\nGrizzlies: Memphis' 10-1 record marked its franchise-best start to a season. Memphis also extended its regular season home winning streak to 20 straight -- the last loss coming in February to Dallas.. .The 26-point winning margin was the largest of the season for Memphis. The previous best was 12 over New Orleans on Nov. 3.\nCONLEY BANGED UP -- Conley left the game in the third with a sore left shoulder, and didn't return, although the Grizzlies lead at time also contributed to the end of his night. \"I got a hit underneath the rim laying it up in the third quarter. It's just a little sore. It should be all right,\" Conley said as he headed to the training room for treatment.\nUNAPPEALING APPEAL: The Grizzlies are confident the NBA will uphold Memphis' 111-110 victory over the Sacramento Kings from last Thursday. The Kings appealed the result, saying Lee did not get the winning shot off in time. Memphis coach Dave Joerger said the replay system worked at \"every level,\" and the officiating crew made the right call.\nHE SAID IT: \"The good thing about this, it is only one loss. Now we will take it out on the Lakers, but we won't forget this one.\" -- Rockets guard Jason Terry.\nUP NEXT:\nRockets: Host Lakers on Wednesday night.\nGrizzlies: Visit Toronto on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764992193.369119
}