{
  "game_id": "0021800450",
  "espn_id": "401071131",
  "date": "Dec 17, 2018",
  "matchup": "POR @ LAC",
  "headline": "Lillard scores 39, leads Trail Blazers over Clippers 131-127",
  "body": "LOS ANGELES --  The Trail Blazers cruised to a 15-point lead in the first quarter and were up by 18 early in the fourth. Then things got wild.\n\nThey withstood a late rally by the Clippers to win 131-127 on Monday night after Damian Lillard scored 22 of his 39 points in a dominant third period.\n\nIt was Portland's first win on the road since Nov. 20 after dropping six in a row.\n\n\"We've had a rough stretch lately and we've let a few games slip away, so it was really important that we win, especially on the road,\" Lillard said.\n\nThe fourth quarter featured 36 free throws. Portland got outscored 39-31.\n\nThe Clippers chipped away and pulled to 125-123 after Tobias Harris hit three of four free throws. CJ McCollum's jumper kept Portland ahead 127-123.\n\nDanilo Gallinari, who finished with 22 points, missed a 3-pointer, but after a scramble got the ball back and made the same shot to leave the Clippers trailing 127-126. McCollum got fouled and made both to keep the Trail Blazers ahead by three.\n\nThe Clippers were forced to foul Lillard, who hit both free throws to seal the win.\n\nShai Gilgeous-Alexander's 3-pointer in the final seconds missed.\n\n\"Our fourth quarter was terrible but we made big shots down the stretch,\" said McCollum, who had 27 points.\n\nLillard hit five of his six 3-pointers in the third when the Blazers outscored the Clippers 42-28. Portland was 10 of 20 from 3-point range in the game.\n\nHarris matched Lillard with a career-high 39 points and rookie Gilgeous-Alexander added a career-best 24 for the Clippers, who have lost four in a row for the first time this season.\n\n\"We've got to start with the defensive end and picking up our physicality,\" Harris said. \"We've got to be a little more locked in.\"\n\nLos Angeles trailed by 15 in the first quarter but erased the deficit in the second when the Clippers took their first lead, only to fall behind by 15 again in the third.\n\nLillard's fifth 3 left the Clippers down 95-80. Portland made seven 3s in the period and stretched its lead to 18 points early in the fourth.\n\n\"He's coming out making 3s off screen-and-rolls, tough shots,\" Harris said.\n\nThe Trail Blazers set the tone in the opening quarter when they began the game on a 33-18 run while shooting 80 percent from the floor.\n\n\"These head-to-head Western Conference games are all so important, especially since we are so close in the standings,\" Portland coach Terry Stotts said.\n\nTIP-INS\n\nTrail Blazers: Stotts recorded his 289th victory and is two from tying Rick Adelman for second on the team's all-time coaching wins list. ... The Blazers have won five of their last six against the Clippers.\n\nClippers: Montrezl Harrell committed a flagrant-2 foul in the fourth and was ejected. ... Los Angeles fell to 7-2 against West opponents at home. ... Tyronn Lue, fired as Cavaliers coach in October, was a visitor. He was a Clippers assistant in 2013-14. ... G Lou Williams (sore left hamstring) and F Luc Mbah a Moute (sore left knee) could return within the next week. Williams has missed four straight games, while Mbah a Moute has been out for 26 in a row.\n\nCLOSE, BUT ...\n\nThe Clippers shot better than 50 percent for the second straight game and lost. They also hit 51 percent at Oklahoma City before losing by six points. \"We're still scoring but it's still hard without Lou,\" coach Doc Rivers said. \"We miss his playmaking.\"\n\nNO CALL\n\nGallinari appeared to get fouled on a 3-point attempt with the Clippers down three but the referees didn't call anything. Lillard got around Patrick Beverley's pesky defense for a layup on the next play to extend Portland's lead to 125-120.\n\n\"I saw a foul. I think the whole arena saw a foul,\" Rivers said. \"I don't know how you don't see that. I tried to ask but he wouldn't talk to me.\"\n\nFAMILIAR TERRITORY\n\nMonday ended a two-month stretch in which the Clippers never played two consecutive games in the same arena. Their 17 road games are tied for the NBA's third-most this season. \"After tonight, we can get our energy back and start practicing,\" Rivers said. \"We haven't practiced much at all.\"\n\nUP NEXT\n\nTrail Blazers: Host Memphis on Wednesday.\n\nClippers: Host Dallas on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995184.2242188
}