{
  "game_id": "0022200429",
  "espn_id": "401468584",
  "date": "Dec 16, 2022",
  "matchup": "DET vs. SAC",
  "headline": "Sabonis, Fox lead Kings to 122-113 victory over Pistons",
  "body": "DETROIT -- — Domantas Sabonis had 23 points and 13 rebounds and the Sacramento Kings used a dominant performance from their starters to beat the Detroit Pistons 122-113 on Friday night.\n\n\r\n              “That was a beautiful game of basketball, especially to finish a long road trip,” Kings coach Mike Brown said. “I've coached a lot of great players, but if (Sabonis) isn't the hardest-working one of them all, he's in the top three. You know what you are going to get every night from that man.”\n\n\r\n              Sacramento's starting five outscored Detroit's 99-66, including a 28-8 run to start the second half.\n\n\r\n              “We didn't come out with focus or any defensive oomph,” Pistons coach Dwane Casey said. “We were standing straight up and getting mixed up on our matchups. We can't come out with that kind of disposition. We're developing, but we can't be developing bad habits.”\n\n\r\n              De'Aaron Fox had 24 points and nine assists for the Kings, and Keegan Murray added 20 points. Sacramento had seven players in double figures, including all five starters.\n\n\r\n              “With De'Aaron, it isn't just what he does on the court, but everything he says on the bench, in the locker room and in the huddles,” Smith said. “His leadership is growing in leaps and bounds on a daily basis — he's so far ahead of where he was when I got here, and the guys gravitate to everything he says.”\n\n\r\n              Bojan Bogdanovic led Detroit with 22 points and rookie Jalen Duren added 15 points and 14 rebounds. Saddiq Bey scored 14 points and Marvin Bagley III had 13.\n\n\r\n              “(Duren) is doing a man's job out there,” Casey said about his 19-year-old center. “He has a gift for rebounding and protecting the rim. He couldn't ask any more of him.”\n\n\r\n              Detroit closed to 106-100 midway through the fourth, but Harrison Barnes hit a 3-pointer, stripped Bogdanovic and made a layup to put the Kings up 111-100 with 5:46 left.\n\n\r\n              The Pistons never threatened again.\n\n\r\n              Detroit led 63-55 at halftime, but the Kings started the third quarter with 28 points in just under six minutes.\n\n\r\n              “Coach reminded us at halftime that we had 24 minutes left of this trip, and 3-3 was going to feel a lot better than 2-4,” Kevin Huerter said. “We got stops in the third quarter and we got out into transition. That's what turned everything around.”\n\n\r\n              TIP INS\n\n\r\n              Kings: Sacramento's starters outscored Detroit's 35-8 in the third quarter. All five starters had at least 13 points.\n\n\r\n              Pistons: The team announced Friday that Cade Cunningham had surgery to stabilize the stress fracture in his left shin. Cunningham will miss the rest of the season but is expected to be ready for training camp next fall. \n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Charlotte on Monday night\n\n\r\n              Pistons: Host Brooklyn on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994377.384971
}