{
  "game_id": "0022200952",
  "espn_id": "401469107",
  "date": "Mar 03, 2023",
  "matchup": "MEM @ DEN",
  "headline": "Jokic's triple-double lifts Nuggets over Grizzlies 113-97",
  "body": "DENVER -- — Nikola Jokic had 18 points, 18 rebounds and 10 assists for his 25th triple-double this season to lead the Denver Nuggets over the Memphis Grizzlies 113-97 Friday night in a showdown of the top two teams in the Western Conference.\n\n\r\n              Denver won the season series 2-1 and holds a six-game lead — five in the loss column — over Memphis for the top seed in the Western Conference. Sacramento is seven games back.\n\n\r\n              Michael Porter Jr. scored 26 points and Jamal Murray scored half of his 22 points in the fourth quarter for the Nuggets, who are 25-0 this season when Jokic has a triple-double.\n\n\r\n              “Since the All-Star break, it feels like every night’s a playoff-type game,” Denver coach Michael Malone said. “We’ve played Memphis twice, Cleveland, the Clippers, and our guys showed up.”\n\n\r\n              Ja Morant had 27 points and 10 assists for the Grizzlies despite wearing a face mask due to a nasal fracture suffered at Houston on Wednesday night. Desmond Bane had 19 points, Jaren Jackson Jr. scored 15 and Xavier Tillman Sr. had 11 points and 10 rebounds.\n\n\r\n              “We did a lot of great things for three quarters and then just kind of fell apart,” Memphis coach Taylor Jenkins said.\n\n\r\n              The game was tied at 80 after three quarters, but the Nuggets outscored the Grizzlies 33-17 in the fourth. Murray had two layups, made a pair of free throws and fed Kentavious Caldwell-Pope for a corner 3-pointer to give the Nuggets a 96-86 lead.\n\n\r\n              Murray’s 3-pointer and Porter’s four-point play — which secured Jokic’s 101st career triple-double — made it 105-86.\n\n\r\n              “Anybody can make a shot, but we’re getting stops, we were getting out and running, the team was flowing. Everyone was being unselfish,” Murray said of the fourth quarter.\n\n\r\n              Memphis shot just 7 of 20 in the final 12 minutes.\n\n\r\n              “In the fourth, we got some good shots and they just weren’t falling, and they started hitting more shots,” Luke Kennard said.\n\n\r\n              Denver missed its first 11 shots from 3-point range and didn’t get its first make until late in the second quarter.\n\n\r\n              MAN BEHIND THE MASK\n\n\r\n              Morant won’t have this particular mask for long. The guard will have one fitted to his face by the time the team arrives in Los Angeles for Sunday’s game.\n\n\r\n              “This one will be a temporary one that is kind of a standard operating one,” Jenkins said. “Luckily we’ll get one that fits him a little bit more, to the mold of his face and gives him a little more comfort out there.”\n\n\r\n              TAKE A SEAT\n\n\r\n              Memphis forward Dillon Brooks was hit with his 16th technical foul of the season with 5:45 left in the game. Brooks earned a $5,000 fine and a one-game suspension.\n\n\r\n              CLARKE INJURED\n\n\r\n              Grizzlies forward Brandon Clarke left in the final seconds of the first quarter with a lower left leg injury. Clarke missed a free throw and started limping as he went up the court and fell at half-court. He was helped to the locker room without putting weight on his left leg.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Have held Denver to 42 and 50 points in the first half of their last two games. ... C Steven Adams missed his 16th straight game with a right knee sprain.\n\n\r\n              Nuggets: C Thomas Bryant was helped to the bench after suffering an injury under Memphis’ basket in the third quarter. Malone said after the game Bryant could have returned if needed.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At the Clippers on Sunday night.\n\n\r\n              Nuggets: Host the Toronto Raptors on Monday night.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994178.048405
}