{
  "game_id": "401809801",
  "espn_id": "401809801",
  "date": "Nov 25, 2025",
  "matchup": "LAL vs LAC",
  "headline": "Luka, LeBron lead Lakers past Clippers 135-118 for 5th straight win, clinching their NBA Cup group",
  "body": "LOS ANGELES -- — Luka Doncic had 43 points, 13 assists and nine rebounds, and LeBron James added 25 points in the Los Angeles Lakers' fifth consecutive victory, 135-118 over the Los Angeles Clippers on Tuesday night.\n\n\r\n              Doncic matched his season high with 32 points in the first half on the way to his 51st career 40-point game. He fell just short of his 10th career 40-point triple-double, but the Lakers clinched their group with their third straight win in NBA Cup play.\n\n\r\n              Austin Reaves had 31 points and nine rebounds for the Lakers, who have won 11 of 13 overall.\n\n\r\n              The 40-year-old James also looked more like his old self in the third game of his unprecedented 23rd NBA season, scoring 16 points in the second half while the Lakers steadily pulled away.\n\n\r\n              James Harden continued his scoring surge with 29 points and nine assists for the Clippers, who have lost 11 of 13. Kawhi Leonard scored 19 in his second game back from a 10-game injury absence.\n\n\r\n              The crosstown rivals' first meeting of the season got chippy when Clippers guard Kris Dunn was ejected with 3:33 to play after knocking Doncic to the ground with a hit to his back. Doncic confronted Dunn, who shoved the ball into Doncic's chest before Lakers center Jaxson Hayes shoved Dunn in the back. Dunn then swatted at Hayes, who also got a technical foul.\n\n\r\n              Doncic opened with his highest-scoring quarter of the season, making his first five 3-point attempts — after missing 17 of 22 in his previous two games — and scoring 20 points in the first eight minutes alone. He also directed a stream of trash talk and staredowns at the Clippers' bench, continuing a semi-friendly feud with LA's second team that predates his move to the Lakers.\n\n\r\n              Up next\r\n              Clippers: Host Memphis on Friday.\n\n\r\n              Lakers: Host Dallas on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042695.811109
}