{
  "game_id": "401810058",
  "espn_id": "401810058",
  "date": "Nov 10, 2025",
  "matchup": "DAL vs MIL",
  "headline": "Antetokounmpo scores 15 of his 30 points in fourth quarter and Bucks edge Mavericks 116-114",
  "body": "DALLAS -- — Giannis Antetokounmpo scored 15 of his 30 points in the fourth quarter and Ryan Rollins put Milwaukee ahead for good with a driving layup with 17.9 seconds left as the Bucks rallied from a 13-point deficit early in the period to beat the Dallas Mavericks 116-114 on Monday night.\n\n\r\n              Kyle Kuzma added a season-high 26 points off the bench for the Bucks, closing with a dunk with 14 seconds left after stealing a Dallas inbound pass when intended recipient Cooper Flagg slipped just beyond the 3-point line.\n\n\r\n              The Mavericks had a chance to tie, down 116-113, when P.J. Washington Jr. was fouled on a desperation 3-pointer by Antetokounmpo with 1.2 seconds left. After Washington missed his second free throw, his intentional miss on the third shot was by tipped by Dallas’ Moussa Cisse but grabbed by Milwaukee’s Bobby Portis Jr.\n\n\r\n              Flagg, last summer’s No. 1 draft pick, led the Mavericks with a season-high 26 points. Brandon Williams added 19 in his first start of the season.\n\n\r\n              After Washington’s missed free throw bounced off the front rim, much of the Dallas crowd broke into its final version of the “Fire Nico” chant directed at general manager Nico Harrison.\n\n\r\n              Antetokounmpo went into play leading the NBA averaging 33.8 points and 19.2 2-point shots per game. He took only four in the first half, all in the second period. He finished with 18 total field-goal attempts, hitting one of two 3-pointers.\n\n\r\n              Dallas’ Anthony Davis missed his sixth consecutive game with a strained left calf. Mavericks coach Jason Kidd said Davis is making progress. The Mavericks also played their eighth straight game without Dereck Lively II, sidelined with a right knee sprain.\n\n\r\n              Up Next\r\n              Bucks: At Charlotte on Wednesday night in the first of consecutive games against the Hornets.\n\n\r\n              Mavericks: Host Phoenix on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042599.880107
}