{
  "game_id": "0022401144",
  "espn_id": "401705710",
  "date": "Apr 07, 2025",
  "matchup": "SAC @ DET",
  "headline": "LaVine and DeRozan combine for 80 points in Kings 127-117 win over the Pistons",
  "body": "DETROIT -- — Zach LaVine scored 43 points, including 17 in the fourth quarter, and DeMar DeRozan added 37 as the Sacramento Kings rallied for a 127-117 victory over the Detroit Pistons on Monday to strengthen their bid for a first-round home game in the play-in tournament.\n\n\r\n              Domantas Sabonis had 19 points, 15 rebounds and 10 assists for the Kings, who have won three straight and have a one-game lead over Dallas for ninth in the Western Conference. \n\n\r\n              Cade Cunningham scored 35 points and Tim Hardaway Jr. added 19 for Detroit, which has lost four of its last five games.\n\n\r\n              The Pistons started out the second quarter with a 29-10 run to take a 66-48 lead. DeRozan scored eight of the Kings next 14 points to close the deficit to 72-62 at halftime.\n\n\r\n              Sacramento took its first lead of the second half, 97-94, when LaVine made a 3-pointer with less than a second left in the third quarter.\n\n\r\n              The Kings never relinquished the lead and the closest Detroit could get was 106-105 on Cunningham's three-point play with 9:16 left in the game.\n\n\r\n              Takeaways\r\n              Kings: Guard Malik Monk left the game with 1:48 left in the first quarter with a left calf injury. Sacramento was already playing without Keegan Murray (back) and Jake LaRavia (thumb).\n\n\r\n              Pistons: Detroit's defense allowed Sacramento to make 51.6% of its shots, including 40.7% on 3-pointers.\n\n\r\n              Key moment\r\n              LaVine hit three straight 3-pointers in the first 1:46 of the fourth to put Sacramento ahead 106-104. He made 5 of 6 3-pointers in the quarter.\n\n\r\n              Key stat\r\n              The Pistons entered needing four made 3-pointers to break their franchise record of 993 from the 2018-19 season — and they finished 13 of 39 against the Kings.\n\n\r\n              Up next\r\n              The Kings start a three-game homestand on Wednesday against Denver. The Pistons will host New York on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997302.9582632
}