{
  "game_id": "0022200549",
  "espn_id": "401468704",
  "date": "Jan 01, 2023",
  "matchup": "DEN vs. BOS",
  "headline": "Jokic has triple-double, Nuggets top Celtics after rim delay",
  "body": "DENVER -- — Nikola Jokic had 30 points, 12 rebounds and 12 assists, and the hot-shooting Denver Nuggets beat the Boston Celtics 123-111 on Sunday night in a matchup of NBA conference leaders that was delayed about 35 minutes because a powerful dunk bent one of the rims. \n\n\r\n              Jokic hit 10 of 13 shots from the field and all eight free throws in his second straight triple-double and ninth of the season. Bruce Brown added 21 points for the Nuggets, who shot 57% from the floor and made 17 of 30 3-pointers.\n\n\r\n              “He's my MVP. He should be the league's MVP three times in a row,\" Brown said of Jokic. “He's doing everything for us. Without Jok, I don't know where we'd be.” \n\n\r\n              Denver won for the 10th time in 12 games, snapped a six-game skid against Boston and opened a one-game lead in the Western Conference. \n\n\r\n              The Nuggets led by as many as 18 and waited out a long delay with 6:43 left as a crew struggled to re-level the rim after a dunk by Boston's Robert Williams III. \n\n\r\n              “I didn’t know I did it until my teammates started blaming me,” Williams said. “I’ve never done that before.”\n\n\r\n              It took six workers, two ladders, a level, phone calls and eventually a crew member taking the rim off the backboard before it was fixed. \n\n\r\n              “There was no communication. They spent all that time trying to fix it but when we came back it still looked like it wasn’t even level, in my opinion. So we just wasted all that time,” Celtics guard Jaylen Brown said.\n\n\r\n              “That has an effect on the game. That’s how injuries and stuff happen. Luckily that didn’t (happen), but that wasn’t good. That whole process was handled poorly, in my opinion, and that had an effect as well. But luckily nobody got hurt.”\n\n\r\n              Players were allowed a brief warmup before play resumed, and then the Nuggets pulled away. \n\n\r\n              “Man, that was crazy,” Denver guard Bones Hyland said of the delay. \"I've never been in a game with that before. We just tried to stay loose and finish the game out.\" \n\n\r\n              Jaylen Brown scored 30 points and Jayson Tatum shook off a slow start to add 25 for Boston, which shot just 9 of 33 from 3-point range in the opener of a four-game trip. The loss snapped a four-game winning streak for the Celtics, whose lead in the East was sliced to 1 1/2 games. \n\n\r\n              Bruce Brown started in place of Jamal Murray (sore knee) and went 4 of 6 on 3s. It was a familiar theme for the Nuggets, who entered as the NBA's top 3-point shooting team. They are 34 of 58 from long distance over the past two games.\n\n\r\n              This one was billed as a matchup of top NBA MVP contenders Jokic and Tatum. And the crowd took notice. \n\n\r\n              A large number of Celtics fans started chanting “MVP! MVP!\" when Tatum went to the foul line late in the second quarter. Nuggets fans loudly returned the favor moments later with their own MVP chant for Jokic when he went to the line. \n\n\r\n              In the end, Jokic showed it'll be tough to wrestle the trophy from him. \n\n\r\n              MAZZULLA RETURNS\n\n\r\n              Celtics interim coach Joe Mazzulla was back after a two-game absence due to corneal abrasions in both eyes after he got hurt in a pickup game Tuesday. Assistant coach Damon Stoudamire led Boston to two wins. \n\n\r\n              “Our staff really stepped up,” Mazzulla said. \n\n\r\n              JOKIC THREE-PEAT? \n\n\r\n              Celtics great Larry Bird from 1984-86 was the last player to win three straight NBA MVP awards. Nuggets coach Michael Malone grew irritated before the game with the suggestion Jokic can't do the same. \n\n\r\n              “If people's reasons for not giving him the MVP is because he's won two in a row, that's lazy,” Malone said. \n\n\r\n              TIP-INS\n\n\r\n              Celtics: Jaylen Brown and Hyland drew technical fouls after a brief scuffle early in the fourth quarter. ... Jaylen Brown hit his first four shots and had 12 points in the first 4:06.\n\n\r\n              Nuggets: Aaron Gordon, who had a monster overtime dunk to seal a Christmas night win over Phoenix, brought the crowd to its feet with a reverse alley-oop jam on a feed from Jokic near the end of the first half. Gordon had 18 points. \n\n\r\n              UP NEXT\n\n\r\n              Celtics: At Oklahoma City on Tuesday night. \n\n\r\n              Nuggets: At Minnesota on Monday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994712.000905
}