{
  "game_id": "0021500522",
  "espn_id": "400828409",
  "date": "Jan 05, 2016",
  "matchup": "CHI vs. MIL",
  "headline": "Butler scores 32 points to lead Bulls over Bucks 117-106",
  "body": "CHICAGO -- After making a statement off the court, Jimmy Butler has taken his game to a new level.\nButler had 32 points and a season-high 10 assists to lead the streaking Chicago Bulls to a 117-106 victory over the Milwaukee Bucks on Tuesday night.\nPau Gasol scored 26 points with 11 rebounds, and Taj Gibson added 11 points and 14 boards as the Bulls led the entire way in their season-best fifth straight win.\n\nButler was critical of coach Fred Hoiberg after a blowout loss to the Knicks on Dec. 19, saying, \"we probably have to be coached a lot harder at times.\"\nSince then, the Bulls have picked up their game by scoring 100 or more points in eight straight games.\n\"It wasn't what I said, or what anybody else said, it's what we said together as a team in that locker room. Everybody knows, and that's, we have a really good team on paper, and out there on the court, but if we don't play for one another, if we don't stick together, we're not a real good team,\" Butler said.\nDerrick Rose returned to the Bulls after missing three games with a sore right hamstring. He showed no effects of the injury and took the ball to the basket all night, finishing with 16 points.\n\"I thought Derrick was good. He was a little rusty out of the gate. Once he started attacking the basket, I really liked the way he was playing,\" Hoiberg said.\nButler was coming off a record-breaking performance Sunday, when he scored 40 of his 42 points in the second half of a 115-113 victory at Toronto to surpass Michael Jordan's team mark for points in a half. This time, Butler had 20 points in the first half on 8-of-11 shooting.\nKhris Middleton scored 26 for Milwaukee, and Michael Carter-Williams had 20 points and 12 assists.\nCarter-Williams was disappointed with his team's effort to start the game.\n\"No excuses, but we came off a back-to-back. We came out lazy and at 10-0, we woke up a little bit. But we can't start off 10-0,\" he said.\nMilwaukee got to 90-89 on Giannis Antetokounmpo's basket with a minute left in the third quarter, but the Bulls answered with an 8-0 run. Antetokounmpo finished with 18 points and seven rebounds.\nChicago shot 61 percent in the first half and led 67-61. Gasol scored 13 points and Gibson added nine. Middleton led the Bucks with 18 on 7-of-12 shooting.\n\"I don't think we're different people than we were three, four weeks ago. I see a progression, I see a development which I like,\" Gasol said. \"Again, can we keep it this way for the entire, for every single game from here on out? We're bringing the energy, we're bringing the focus that is required in this league, then we have a chance because we have plenty of talent, as we all know.\"\nHOMECOMING\nJabari Parker played his first professional game for the Bucks in his hometown. Parker, a 2013 graduate of Simeon High School on Chicago's south side, missed most of the 2014-15 season after ACL surgery on his left knee. He finished with 11 points and seven rebounds. \"It was a good experience. It was cool, good that I got a chance to experience it for the first time. I had a lot of family here. Coaches (from Simeon) couldn't make it out -- they had practice today,\" Parker said.\nJIMMY THE PLAYMAKER\nDespite his recent scoring outburst, Butler is still finding ways to get his teammates going. \"He is making the right decisions out there and playing the right way. He is getting his teammates involved, making plays and giving great efforts defensively,\" Hoiberg said.\nTIP-INS\nBucks: Milwaukee again played without guard Jerryd Bayless because of a left ankle injury. Bayless was back in the lineup Monday against San Antonio after missing 11 games in December with the same injury. \"It just is what it is,\" interim coach Joe Prunty said. \"Obviously, it is frustrating. You want to be at full strength, but that's part of the NBA. You look at last night's game -- San Antonio's without (Tony) Parker. Chicago's been without Rose. That's just part of the NBA. The next man has to be ready to step up.\"\nBulls: Chicago faced Milwaukee for the first time since beating the Bucks 120-66 in the Game 6 clincher of their opening-round playoff series last year. It was the worst postseason loss in Bucks history.\nUP NEXT\nMilwaukee hosts Dallas on Friday.\nChicago hosts Boston on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764993937.9777799
}