{
  "game_id": "0022301192",
  "espn_id": "401585820",
  "date": "Apr 14, 2024",
  "matchup": "BKN @ PHI",
  "headline": "Joel Embiid sits out as 76ers zip past Nets 107-86. Philly will face Miami in the play-in tournament",
  "body": "PHILADELPHIA -- — After eight straight wins to end the regular season, the 76ers are set for their first play-in tournament.\n\n\r\n              Joel Embiid expects to be along for the ride.\n\n\r\n              Embiid sat out Philadelphia's 107-86 victory over the Brooklyn Nets on Sunday as a precaution, two days after he tweaked his surgically repaired left knee. Tyrese Maxey scored 26 points and Tobias Harris had 21 points to lead the Sixers.\n\n\r\n              Last season's NBA MVP, Embiid wasn't needed in the rout, but he'll be in the lineup when the 76ers host Miami on Wednesday night in the NBA play-in tournament. The winner secures the No. 7 seed in the Eastern Conference and gets a playoff series against the second-seeded New York Knicks.\n\n\r\n              The loser will host either Atlanta or Chicago on Friday to determine the No. 8 seed and who will face No. 1 seed Boston in the first round.\n\n\r\n              “We've got a good mindset, I think, and we'll just take that into Wednesday,” Sixers coach Nick Nurse said.\n\n\r\n              Nurse said Embiid, the two-time NBA scoring champion, would be ready for the Heat.\n\n\r\n              Even with seeding that could have reached as high as fifth in the Eastern Conference at stake, the Sixers rested Embiid only as a precaution, the team said. Embiid's tweaked knee on Friday was the latest injury setback in a career riddled with them.\n\n\r\n              Embiid finished the season averaging 34.7 points and 11 rebounds in just 39 games. He had the statistical oddity of scoring more points than minutes played, finishing with 1,353 points in 1,309 minutes.\n\n\r\n              The 76ers clearly need a healthy — or healthy enough — Embiid in the postseason to give them any shot at winning a round or more in the East. The Sixers finished 31-8 with Embiid this season and 16-27 without him.\n\n\r\n              “I think that we did battle some adversity,” Nurse said. “I think the main thing that I would say I’m happy with, I’m pleased with, is that our competitive drive, our spirit, I think has risen the last few months. We’re competing at a level where I think we should all expect our guys to compete at.”\n\n\r\n              All the Eastern Conference games had the same afternoon tipoff time, leaving the playoff picture settled at around the same time. Nurse said ahead of the game he would try to avoid scoreboard watching and “try to keep the focus on the game and the basketball.”\n\n\r\n              Easier said than actually accomplished — Nurse acknowledged that he did indeed sneak peeks at the scoreboard.\n\n\r\n              He had good reason to scoreboard watch. The 76ers could have reached the sixth seed and a spot in the playoffs had Milwaukee defeated Orlando. Instead, the Magic topped the Bucks and former 76ers coach Doc Rivers 113-88.\n\n\r\n              As NBC Sports Philadelphia interviewed Buddy Hield, who had 19 points, seven rebounds and five assists, the snarky caption read, “Thanks For Nothing, Doc Rivers & Bucks.”\n\n\r\n              With Allen Iverson and Julius Erving in the house, the Sixers shook off a shaky start — they trailed through one quarter — to easily handle the lowly Nets. Even Nets interim coach Kevin Ollie appreciated how good the Sixers could be with Embiid in the lineup.\n\n\r\n              “It’s going to be fun watching them in the playoffs,” he said. “Hopefully, Embiid gets back to 100%.”\n\n\r\n              Of course, full health has been a hallmark of Embiid’s career. He missed the first two seasons of his career after he was the No. 3 pick in the 2014 draft and he has never played more than 68 games in a season.\n\n\r\n              Embiid said earlier this month that again sitting out from his recent knee injury “ took a toll mentally.”\n\n\r\n              “Being depressed. It was not a good one,” Embiid said. “Still not where I’m supposed to be, especially mentally.”\n\n\r\n              Iverson was still playing for the Sixers the last time the franchise advanced out of the second round of the playoffs, back in 2001. The Heat started in the play-in tournament last season and wound up in the NBA Finals.\n\n\r\n              “Our main goal was to be stepping in the right direction come playoff time,” Maxey said. “I think we're doing that.”\n\n\r\n              NET GAINS\n\n\r\n              Cam Thomas scored 18 points and Noah Clowney had 16 points. The Nets are in the process of finding another coach for next season. Ollie said he had interviewed with Nets general manager Sean Marks.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996318.307679
}