{
  "game_id": "0022200958",
  "espn_id": "401469113",
  "date": "Mar 04, 2023",
  "matchup": "MIA vs. ATL",
  "headline": "Adebayo scores 30, Young has season-low 8 as Heat beat Hawks",
  "body": "MIAMI -- — Bam Adebayo scored 30 points and the Miami Heat held Trae Young to a season-low eight points in a 117-109 victory over the Atlanta Hawks on Saturday night.\n\n\r\n              Tyler Herro added 20 points, while Jimmy Butler and Caleb Martin finished with 15 apiece for the Heat, who extended their lead over the Hawks to 1 ½ games for seventh in the Eastern Conference.\n\n\r\n              Young was 2 for 13 from the field. It was Young’s 17th game under double figures in his career.\n\n\r\n              Miami won for only the second time in the last eight and recovered from a two-point loss against the New York Knicks on Friday on Julius Randle’s 3-pointer with 1.7 seconds left.\n\n\r\n              “I think the very best thing for us coming off a game like that is play the next night,” Heat coach Erik Spoelstra said.\n\n\r\n              The Hawks are 1-2 under new coach Quin Snyder, who took over Tuesday.\n\n\r\n              Down 21 midway through the third quarter, Atlanta rallied and got to 108-103 on De’Andre Hunter’s jumper with 4:39 remaining. But Miami responded with seven unanswered, capped by Martin’s dunk with 2:44 left.\n\n\r\n              “We didn’t get as many good shots late and that’s something that we haven’t had in that situation the time I have been here, which hasn’t been very long,” Snyder said. “It’s something we will improve on.”\n\n\r\n              Adebayo shot 10 for 12 from the field and the free throw line and had 10 rebounds. He also finished with five assists.\n\n\r\n              “Obviously, you’ve seen the many different ways to score or get somebody open,” Adebayo said. “And obviously, me and Coach having that trust between each other that I can be aggressive and take shots.”\n\n\r\n              Saddiq Bey scored 22 points, Hunter had 17 and Clint Capella finished with 16 for the Hawks.\n\n\r\n              Acquired from Detroit Feb. 9, Bey had his highest-scoring output since joining the Hawks. Bey shot 7 of 12 from the field and 4 of 8 on 3-pointers.\n\n\r\n              “I’m just feeling the game, feeling the opportunities to be aggressive,” Bey said. “I just try to bring a spark to the team, sometimes an energy when I get in.”\n\n\r\n              After allowing 71 first-half points in consecutive home losses against Philadelphia and New York, the Heat maintained a double-digit lead the final 7 1/2 minutes of the second period and led 66-49 at halftime.\n\n\r\n              “I thought the first half really set the tone for the game and then we had some ups and downs in that second half,” Spoelstra said. “But I also think that’s important for our team – to manage all the different emotions.\n\n\r\n              TIP-INS Hawks: A night following his career-high 41 points against Portland, Dejounte Murray finished with 10 on 3-of-14 shooting. ... Atlanta has scored 100 or more points in 39 straight games.\n\n\r\n              Heat: Adebayo has scored in double figures in the 60 games he’s played this season, extending a streak that began in the final 16 games last season. ... Cody Zeller scored all of his 13 points in the first half. ... PG Kyle Lowry (left knee soreness) missed his 12th consecutive game.\n\n\r\n              OLD ACQUAINTANCES The encounters between Snyder and the Heat’s Erik Spoelstra were renewed Saturday. But long before Snyder and Spoelstra became successful NBA coaches they competed as teenagers in AAU tournaments in the Pacific Northwest. Snyder grew up in Washington and Spoelstra’s formative years were spent in Oregon.\n\n\r\n              FREE THROW EFFICIENCY\n\n\r\n              Both teams capitalized on their free throw opportunities. The Hawks were 26 of 30 from the line while the Heat finished 20 of 23.\n\n\r\n              UP NEXT The Hawks and Heat will complete their two-game set Monday in Miami.",
  "source": "espn_api",
  "crawled_at": 1764993930.9380329
}