{
  "game_id": "0022200896",
  "espn_id": "401469051",
  "date": "Feb 24, 2023",
  "matchup": "ATL vs. CLE",
  "headline": "Hawks pull away in 1st half, rout Cavaliers 136-119",
  "body": "ATLANTA -- — The Atlanta Hawks returned from the All-Star break — and a coaching change — refreshed and motivated.\n\n\r\n              The Cleveland Cavaliers, playing on the second night of a back-to-back, couldn't match Atlanta's energy and drive.\n\n\r\n              Trae Young scored 34 points and the Hawks beat the Cavaliers 136-119 on Friday night in their first game under interim coach Joe Prunty.\n\n\r\n              Dejounte Murray had 15 of his 25 points in Atlanta’s high-scoring second period.\n\n\r\n              Darius Garland led the Cavaliers, who suffered their third straight loss, with 33 points. Donovan Mitchell had 19.\n\n\r\n              The Hawks played their first game since coach Nate McMillan was fired on Tuesday. The team had three practices, including a shootaround session on Friday morning, under Prunty, who had been McMillan's lead assistant.\n\n\r\n              “Each night is a new experience, understanding a team that is fresh and newly motivated,” said Cleveland coach J.B. Bickerstaff, who said that created a challenge for his players “being prepared to match that, and I don't think we matched that enough. ... We didn't put up much resistance, especially in the first half.\"\n\n\r\n              The Cavaliers lost to Denver 115-109 on Thursday night.\n\n\r\n              General manager Landry Fields said Wednesday that former Utah coach Quin Snyder is a candidate to replace McMillan. Snyder could be hired to take over the team this season.\n\n\r\n              Atlanta held its big lead of 32 points for the last time at 103-71 late in the third quarter before Cleveland pulled to within 13 points at 108-95 in the final period. Atlanta then reclaimed its momentum.\n\n\r\n              Murray missed his first five shots before making his next seven in the second period. The Hawks’ 49 points in the period were their most in any quarter this season. They led 81-57 at halftime, setting another season-high mark for points in an opening half.\n\n\r\n              “I think we were pushing the ball and playing fast and getting some 3s and getting some stops, too,” Young said. “It was a big effort tonight on the defensive end, for sure.”\n\n\r\n              Prunty said he worried his players would be rusty after the break and said “I was really impressed with our guys and how we started the game.”\n\n\r\n              BEY IMPRESSES\n\n\r\n              Saddiq Bey, acquired by Atlanta from Detroit on Feb. 9 as part of a three-team trade with Golden State, had 19 points while starting at power forward as a fill-in. John Collins (concussion protocol) did not play. The 6-foot-8 Bey, listed as a guard-forward, is thought to be best suited to play small forward but showed his versatility while filling in for Collins at power forward.\n\n\r\n              ROAD WOES\n\n\r\n              The Cavaliers, fourth in the Eastern Conference at 38-25, have good motivation to earn home-court advantage in the postseason. They fell to only 13-18 in road games to offset their 25-7 mark at home.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: F Cedi Osman (lower back contusion) had 10 points in 17 minutes and G Ricky Rubio (knee management) logged 12 minutes, scoring 2 points after not playing in Thursday night's game. ... The Cavaliers also are being careful with F Danny Green, 35, in his ongoing recovery from left knee surgery. Green signed with the Cavaliers on Feb. 15 after being bought out by Houston and had three points in 11 minutes. Speaking of Green's role in the postseason, coach J.B. Bickerstaff said before the game the goal is “to make sure he's ready when we need him most.\"\n\n\r\n              Hawks: G Bogdan Bogdanovic passed 5,000 career points while sinking back-to-back 3s early in the second period. It was part of a string of four consecutive Atlanta baskets by Bogdanovic, who had 10 points. .... Onyeka Okongwu recorded a double-double with 13 points and 11 rebounds. ... Collins suffered the head injury in a collision with New York Knicks F Julius Randle on Feb. 15 in Atlanta's last game before the All-Star break. \n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Toronto on Sunday.\n\n\r\n              Hawks: Host Brooklyn on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994819.328146
}