{
  "game_id": "0022101124",
  "espn_id": "401360943",
  "date": "Mar 28, 2022",
  "matchup": "IND vs. ATL",
  "headline": "Bogdanovic scores 29, Hawks beat Pacers 132-123",
  "body": "INDIANAPOLIS -- — Bogdan Bogdanovic scored 29 points to lead the Atlanta Hawks past the Indiana Pacers 132-123 on Monday night.\n\n\r\n              Clint Capela and Kevin Huerter each contributed 22 points and Capela added 15 rebounds for the Hawks, who are 10th in the Eastern Conference. Trae Young had 14 points and a season-high 16 assists.\n\n\r\n              “They tried to take me out of it,\" Young said. \"I just got to get it to my teammates and let them make plays.”\n\n\r\n              Bogdanovic was a beneficiary.\n\n\r\n              “I always appreciate Trae,” he said. “We need other teams to keep trapping him, so I can get wide-open shots. I know he’s going to keep finding me.”\n\n\r\n              Hawks coach Nate McMillan said Young forced the Pacers to stop trapping him.\n\n\r\n              “Trae did a good job of being patient and getting the ball to his teammates,” he said. “Our guys were knocking down. Trae didn’t force the issue.\"\n\n\r\n              Buddy Hield scored 26 points for the Pacers, who have lost four consecutive games and are out of playoff contention. Tyrese Haliburton scored 25 points with 13 assists. Keifer Sykes added 16 points for Indiana, hitting 4 of 6 3-pointers.\n\n\r\n              Atlanta shot 54.7% overall while Indiana made 52.3%. The Hawks had 40-28 rebounding edge and committed 13 turnovers, one less than the Pacers. The Pacers narrowed the deficit to 94-88 with 3:11 left in the third quarter, but the Hawks led 102-90 when the quarter ended.\n\n\r\n              Indiana closed the gap to 121-112, but the Hawks prevented it from getting too close.\n\n\r\n              The Pacers had only eight players available. Oshae Brissett warmed up but was ruled out before the game with a sore back.\n\n\r\n              “Yeah, we're down bodies, but this is basketball and it's an opportunity for somebody to step up and make plays and get more minutes,\" Hield said. “Who doesn't like playing more minutes?”\n\n\r\n              Atlanta led by as many as 18 points in the first half and was ahead 74-63 at halftime.\n\n\r\n              Indiana coach Rick Carlisle said a poor first quarter was the story of the game.\n\n\r\n              “The rest of the game we played much better,” Carlisle said. We have to get a better start. We did a trapping and rolled the dice on them. They made some open shots. We have to do better (defensively), but I'm not going to make excuses. We're in a tough spot with personnel, but we have to do our best and we didn't do our best tonight.\"\n\n\r\n              TIP-INS\n\n\r\n              Hawks: De’Andre Hunter sat out with right knee soreness. Danilo Gallinari was out a with right elbow contusion. ... Atlanta improved to 38-37 and have won seven of its last 10 games. The Hawks had been 0-for-5 in their previous five attempts to get above .500.\n\n\r\n              Pacers: Carlisle returned after missing the past two games for personal reasons. ... Myles Turner, who has been sidelined since Jan. 14 with a stress reaction in his left foot, will not play in the remaining six games. Carlisle said Turner is close to getting being ready to play but said it is not worth bringing him back for the final two games, which are on back-to-back nights. ... Duane Washington Jr. sat out with a right hip bruise. ... Justin Anderson was signed to a second 10-day contract Monday.\n\n\r\n              BIG LIFT\n\n\r\n              Jalen Johnson, a rookie from Duke, scored 12 points off the bench in extended minutes.\n\n\r\n              “Jalen is playing hard and rebounding,\" Young said. \"It’s a tough situation not knowing if you are going to play. He did a good job of being ready. He’s a smart player and can dribble a little bit. He can do a lot of things for us.”\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Oklahoma City on Wednesday.\n\n\r\n              Pacers: Host Denver on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993006.410746
}