{
  "game_id": "0021800975",
  "espn_id": "401071648",
  "date": "Mar 07, 2019",
  "matchup": "MIL vs. IND",
  "headline": "Antetokounmpo, Middleton pace Bucks past Pacers 117-98",
  "body": "MILWAUKEE --  Giannis Antetokounmpo channeled his frustration over a technical foul in the best way possible.\n\nAntetokounmpo scored 29 points and Khris Middleton added 27 to help the Milwaukee Bucks bounce back from their first consecutive losses of the season with a 117-98 victory over the Indiana Pacers on Thursday night.\n\nMilwaukee, which improved to an NBA-best 49-16, was coming off back-to-back losses to Utah and Phoenix after opening a five-game road trip with three victories.\n\nThe Bucks ran off 13 consecutive points after Antetokounmpo was assessed a technical midway through the third quarter, one possession after he was knocked down attempting a shot, with no foul called. The Pacers missed the technical free throw and the Bucks responded with a 13-0 run. Antetokounmpo started the spurt with a dunk and finished it with another to put Milwaukee up 80-64 with 2:56 left in the period.\n\n\"Sometimes, things are not working out the way you wanted and you just get frustrated,\" Antetokounmpo said. \"Sometimes you take it out on the ref, sometimes you take it out on yourself. Today, obviously I took it out on the ref and got a tech. Definitely deserved it.\n\n\"But, I think my team did a great job just picking it up, playing with energy, rebounding the ball and responding that way.\"\n\nThe Bucks padded their lead with a 12-0 spurt early in the fourth quarter. Kyle O'Quinn opened the final period with a floater from the lane to bring the Pacers within 10 at 84-74. Ersan Ilyasova hit a 3-pointer to trigger the run, capped by Antetokounmpo's drive to make it 96-74 with 8:21 left.\n\nMyles Turner had 22 points and Bojan Bogdanovic 17 for the Pacers.\n\nBogdanovic hit a pair of 3-pointers to pull Indiana within three points at 67-64 before the technical on Antetokounmpo. Indiana's Thaddeus Young thought that was the turning point.\n\n\"The next play down, he imposed his will,\" Young said. \"He got a foul on me, got a dunk, and another dunk after that. I think that was the change in the game.\"\n\nBucks coach Mike Budenholzer said the entire team fed off the technical foul.\n\n\"It felt like the whole arena, his teammates, I think everybody was probably somewhat frustrated, but I think that frustration got channeled into a great energy,\" Budenholzer said. \"His teammates, and then Giannis, I thought made a couple big plays coming off the technical.\"\n\nThe Bucks opened their largest lead of the first half at 47-33 on two free throws by Antetokounmpo, but the Pacers went on a 17-7 run to close within 54-50 at the break.\n\n\"Too much Antetokounmpo, too much Middleton,\" Pacers coach Nate McMillan said. \"When they have the attack at the basket and are knocking down 3s, they're going to be tough to guard. They were pretty much knocking shots down from the perimeter and getting shots at the rim tonight. We missed some shots. We had some open looks that you need to knock down and we didn't early.\"\n\nTIP-INS\n\nPacers: Indy's two-game road trip to Milwaukee and Philadelphia has important implications in the standings. The Pacers entered the game in third place in the Eastern Conference at 42-23, one game ahead of the Sixers.\n\nBucks: Rookie guard Donte DiVincenzo, sidelined for almost two months with a heel injury, was available for Thursday night's game against the Pacers. DiVincenzo, who was averaging 4.8 points and 15.6 minutes, is not likely to be back in the rotation immediately. DiVincenzo played slightly more than six minutes in the first half, then scored five points in the closing minutes.\n\nMcMILLAN LIKES BUCKS MOVES\n\nVeteran center Pau Gasol, signed by the Bucks on Monday after a contract buyout by the Spurs, made his home debut, grabbing five rebounds in almost 11 minutes. Milwaukee already had added forward Nikola Mirotic in a three-team trade in early February. \"I think they've done a nice job of adding to their roster,\" McMillan said. \"I think it's a message to the rest of the league that they're going for it.\"\n\nUP NEXT\n\nIndiana is at Philadelphia on Sunday.\n\nThe Bucks host Charlotte on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994462.6760561
}