{
  "game_id": "0022200718",
  "espn_id": "401468873",
  "date": "Jan 24, 2023",
  "matchup": "PHX vs. CHA",
  "headline": "Suns win 4th straight, roll past Hornets 128-97",
  "body": "PHOENIX -- — Cam Johnson didn't need much time on the floor to do some damage.\n\n\r\n              Johnson scored 24 points in just 18 minutes, Dario Saric added 19 off the bench and the Phoenix Suns won their fourth straight game by beating the Charlotte Hornets 128-97 on Tuesday night.\n\n\r\n              The four-game winning streak has helped the Suns make a huge jump in the jumbled Western Conference race — all the way from 12th to sixth. Before the recent winning streak, they had lost 12 of 14.\n\n\r\n              “It's the NBA — you weather storms. It's life — you weather storms,\" Johnson said. \"Things don't always go your way. We've found that out the past couple years. That doesn't mean you tuck tail, run, sell the farm, hide away forever.\n\n\r\n              “We have a lot of confidence in our group. Top to bottom.”\n\n\r\n              The Suns built a 30-point lead midway through the second quarter, though Charlotte cut it to 58-50 early in the third. Phoenix rebuilt its lead to 98-77 by the fourth before cruising to the comfortable victory.\n\n\r\n              Johnson was hot from the outset, scoring 16 points in seven minutes in the first quarter by making all six of his shots, including four 3-pointers. The forward was playing in his third game since returning from a knee injury that kept him out more than two months. He's knocked the rust off quickly, shooting 9 of 11 from the field against the Hornets, including 6 of 7 from 3-point range.\n\n\r\n              “To see that ball come off his hands as easy as it did tonight was pretty cool,” Suns coach Monty Williams said. “When he's making shots like that, it opens it up for everyone else.”\n\n\r\n              Suns guard Chris Paul added 14 points and 11 assists. Mikal Bridges scored 18 points and Jock Landale had 15. Bismack Biyombo blocked five shots.\n\n\r\n              Charlotte couldn't overcome its brutal start. The Hornets shot just 6 of 23 (26.1%) in the first quarter. Terry Rozier scored 19 points, but shot just 7 of 21 from the field. Mason Plumlee added 17 points while Jalen McDaniels had 15 points and 10 rebounds.\n\n\r\n              “They shot the ball well,” Hornets coach Steve Clifford said. “We did not.” \n\n\r\n              The Suns jumped out to 36-15 lead after one quarter, shooting 60% from the field. Phoenix pushed that advantage to 50-20 with seven minutes remaining in the half but the Hornets responded with a 27-8 run to cut it to 58-47 at halftime.\n\n\r\n              “I loved our defensive intensity to start the game,” Williams said. \n\n\r\n              It was the second straight game that the Suns struggled to hold a big lead, though both games ended in a win. They had a 29-point advantage over Memphis in the third quarter Sunday before hanging on for a 112-110 win.\n\n\r\n              TIP-INS\n\n\r\n              Hornets: G LaMelo Ball (left ankle, right wrist soreness) missed his third straight game. G Gordon Hayward (hamstring strain), G Cody Martin (hamstring soreness) and G/F Kelly Oubre Jr. (left hand surgery) were also out.\n\n\r\n              Suns: C Deandre Ayton (non-COVID illness) missed his third straight game. G Devin Booker (groin), G Cameron Payne (foot sprain) and G Landry Shamet (foot soreness) were also out. ... The team's four-game winning streak is its longest since a six-game stretch in November. ... Hosted a 51st straight sellout crowd. ... Had a 55-39 rebounding advantage.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host Chicago on Thursday night.\n\n\r\n              Suns: Host Dallas on Thursday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995109.872776
}