{
  "game_id": "0021700252",
  "espn_id": "400975003",
  "date": "Nov 21, 2017",
  "matchup": "LAL vs. CHI",
  "headline": "Lakers rally from 19-point deficit to beat Bulls 103-94",
  "body": "LOS ANGELES --  The Los Angeles Lakers' first half resembled many miserable stretches of the past four seasons. Although the Chicago Bulls have plenty of their own problems, they outworked, outshot and outsmarted the Lakers while taking a 14-point lead.\n\nCoach Luke Walton reminded his young team that 14 points aren't much in the NBA, and the Lakers proceeded to stage a rally that suggested the future might not be so miserable after all.\n\nKyle Kuzma had 22 points, Kentavious Caldwell-Pope scored 11 of his 21 in the fourth quarter and the Lakers roared back from a 19-point deficit in the second half for a 103-94 victory over the Bulls on Tuesday night.\n\nBrandon Ingram had 17 points, five rebounds and five assists as the Lakers won consecutive games for the second time this season, doing so in a thrilling fashion that had their still-faithful fans standing, cheering and recalling the 16-time champion franchise's better years.\n\n\"Anytime you go out there and compete, and you look to your right and your left and everybody is competing as hard as you are, that's a great feeling,\" said rookie Lonzo Ball, who had eight points, 13 rebounds and four assists.\n\nLos Angeles is off to an 8-10 start and sitting in eighth place in the Western Conference -- small achievements, but important steps for a young team just starting to believe it can compete.\n\nThe Lakers weren't competitive in the first half while committing 13 turnovers, and they trailed 61-42 early in the second half. But they put together a 38-19 run spurred by an energetic third quarter from reserves Jordan Clarkson, Josh Hart and Julius Randle, who finished with 10 points and 10 rebounds.\n\nCaldwell-Pope's layup with 3:08 to play gave the Lakers their first lead since the first quarter, and the veteran added back-to-back 3-pointers. The Lakers finished strong for their first win over the Bulls at Staples Center in three tries.\n\n\"I was shocked we were only down 14 at the half, to be honest,\" Walton said. \"It was a learning opportunity for the guys to be down 20 and realize you don't need hero shots. You just need to tighten down on what we are doing, and you can get back in the game.\"\n\nDenzel Valentine scored 17 points and Antonio Blakeney added 15 -- all in the first half -- for the Bulls, who dropped to 3-12 with their seventh loss in eight games.\n\n\"They grabbed the momentum and ran with it,\" said Kris Dunn, who had 12 points and six assists in his second start of the season for Chicago. \"Caldwell-Pope, he hit some big shots. They were more aggressive than we were and started getting to the free throw line.\"\n\nTIP-INS\n\nBulls: Fred Hoiberg promoted Dunn to the starting lineup in place of Jerian Grant, and the coach expects it to be a long-term move. Dunn has been a steady force off Chicago's bench, and Hoiberg expects Grant to take a similar role with the reserves going forward. ... David Nwaba missed the game with a sprained ankle. The LA native became a steady bench contributor for the Lakers last season, but Chicago snatched him off waivers in July while the Lakers shuffled their roster.\n\nLakers: Los Angeles visits Chicago on Jan. 26. ... F Larry Nance Jr. could be back with the team as early as next week. He had surgery on his broken left hand only three weeks ago, but has healed quicker than expected.\n\nTWINS\n\nBrook Lopez had four points on 2-for-10 shooting and nine rebounds for the Lakers against his twin brother, Robin, who had 14 points and three rebounds for the Bulls. The twins grew up in North Hollywood rooting for the Lakers, who acquired Brook Lopez in a trade with Brooklyn last summer.\n\n\"I don't want to sound selfish, but it was personally fun for me,\" Robin Lopez said. \"I don't know how much fun he had.\"\n\nBALL'S GAME\n\nAfter posting his second career triple-double Sunday against Denver, Ball missed seven of his first eight shots against Chicago, but provided strong playmaking down the stretch. The point guard also has 29 rebounds in LA's last two games.\n\nSTRETCH FADE\n\nThe Bulls went 13 for 45 (28.9 percent) from the field in the second half, including 4 of 22 on 3-pointers. They committed seven turnovers and only forced one. \"We look at the first half, and we had a really good defensive effort against a high-scoring team,\" Hoiberg said. \"But you have to sustain it for 48 minutes.\"\n\nUP NEXT\n\nBulls: At the Utah Jazz on Wednesday night.\n\nLakers: At the Sacramento Kings on Wednesday night.\n\n---\n\nMore AP NBA: www.apnews.com/tags/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993200.939604
}