{
  "game_id": "0021501172",
  "espn_id": "400829059",
  "date": "Apr 06, 2016",
  "matchup": "LAL vs. LAC",
  "headline": "Clippers beat Lakers 91-81 in Kobe's next-to-last home game",
  "body": "LOS ANGELES -- The Los Angeles Clippers took turns guarding Kobe Bryant, everybody wanting one last shot at the legend. When the buzzer finally sounded, they gathered for one last chance to shake their longtime rival's hand.\nAlthough the Clippers were happy to witness Kobe's penultimate game in Los Angeles, they weren't about to let him leave it with a win.\nDeAndre Jordan and J.J. Redick scored 15 points apiece in the Clippers' 91-81 victory Wednesday night, sending the Lakers to their franchise-record 62nd loss of the season.\nChris Paul could only watch in admiration when Bryant kept competing to the end of a meaningless blowout.\n\n\"Everybody doesn't do that,\" Paul said. \"Only certain people would understand the grind and the meaning of that 20th season coming to an end. He could have just let (the Clippers) dribble the clock out, but that's just how much he loves to compete.\"\nBryant scored 17 points for the Lakers, who have a three-game road trip before the third-leading scorer in league history wraps up his 20-year career next Wednesday at home against the Utah Jazz. He enjoyed a last chance to face Paul, even picking up the point guard's son when they met after the game.\n\"Chris and I have been close for a long time,\" Bryant said of his former USA Basketball teammate. \"It's more a friendship than anything else. Blake (Griffin), he just said thank you for years of inspiration.\"\nBryant returned to the game with 4:50 remaining, but didn't score. He checked out again in the final seconds to a standing ovation and chants of his name.\n\"I can feel it, and it's pretty damn awesome,\" Bryant said.\nGriffin and Paul had 13 points apiece before the starters sat out the fourth quarter for the Clippers, who swept the season series with back-to-back wins over the Lakers on consecutive nights. They've won 11 straight over their cross-hallway rivals.\nThe Clippers are locked into the No. 4 seed in the Western Conference playoffs with four games left despite winning seven of their last eight. They finished off their three-year dominance of the Lakers with a comfortable win despite resting Austin Rivers, Jamal Crawford and Wesley Johnson.\nJordan Clarkson scored 13 points and Julius Randle had a career-high 20 rebounds for the Lakers, who have lost three straight and seven of eight.\nAt least the Lakers' loss left them four games behind Phoenix (20-58) with four games to play for the second-best chance of winning the NBA draft lottery, trailing only Philadelphia. If the Lakers' pick doesn't land in the top three, they will lose it to the 76ers under the terms of a long-ago trade.\nBryant managed only six points Tuesday night in his final road game at Staples, but he was closer to vintage form in the home rematch between the hallway rivals. Bryant took the Lakers' first three shots and swiftly piled up 10 early points, with the crowd buzzing each time he touched the ball.\n\"I'm not a nostalgic person, but there was a moment there where I thought to myself, `Wow, this is pretty significant,\" Redick said. \"I'm sure one day I'll tell my grandkids about all the great players I got to play against, and Kobe will be at the top of the list.\"\nAfter getting routed one night earlier, the Lakers kept it close in the rematch until the Clippers finished the first half with a 14-2 run, capped by Redick's second 3-pointer in the closing moments.\n3-ANGELO\nD'Angelo Russell scored nine of his 13 points in the fourth quarter. He also set a Lakers record with his 124th 3-pointer of his rookie season, surpassing Nick Van Exel's first-year total. The 20-year-old Russell already was the youngest player in NBA history to make at least 120 3-pointers in a season.\nTIP-INS\nClippers: Paul Pierce had nine points in his return from a four-game absence with right leg injuries. ... Rivers and Johnson have minor injuries, while Crawford was simply resting. ... Jeff Green fell hard after a knee-to-knee hit from Tarik Black late in the third quarter. The backup forward didn't return.\nLakers: Clarkson played despite a bruised leg. ... Randle grabbed 13 of the Lakers' 23 total rebounds in the first half.\nUP NEXT\nClippers: At Jazz on Friday.\nLakers: At Pelicans on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994234.535734
}