{
  "game_id": "0021900778",
  "espn_id": "401161420",
  "date": "Feb 08, 2020",
  "matchup": "CHA vs. DAL",
  "headline": "Curry returns home, scores 26 as Mavs rout Hornets 116-100",
  "body": "CHARLOTTE, N.C. --  Seth Curry has watched his older brother Stephen have some memorable homecoming games at the Spectrum Center in Charlotte.\n\nHe figured he needed one of his own.\n\nA motivated Curry was impressive Saturday night in his hometown, making his first 10 shots from the field -- six of them 3-pointers -- and finishing with 26 points off the bench to lead the Dallas Mavericks to a 116-100 victory over the Hornets.\n\n\"It felt really good,\" Curry said. \"I have watched Steph come in a couple of times and get hot and put on some great shows. I'm sure he's going to send me a text or say something funny.\"\n\nCurry's big game came with his mother Sonya in the stands and his father Dell broadcasting the game for the Hornets.\n\nDell Curry said he had a smile on his face much of the game.\n\n\"I am super excited for him,\" Dell Curry said after the game. \"... It makes it easier when your son plays well. So that was a lot of fun.\"\n\nBecause of injuries, this is only the second time the younger Curry has played in Charlotte during his NBA career. He participated here last year in the NBA All-Star 3-point contest against Steph and others, but didn't make it past the first round.\n\n\"I wanted to come here and play in front of family and friends,\" Curry said. \"Playing in your home city, it's different. You want to come in and put on a good show and have fun and that's what happened.\"\n\nMavericks coach Rick Carlisle called Curry's effort amazing.\n\n\"I mean, at halftime he was 7 for 7 with 18 points,\" Carlisle said. \"Some guys, when they come home special things happen. He was cooking. It was something to see.\"\n\nWillie Cauley-Stein added 15 points and 10 rebounds for the Mavericks, who played without Luka Doncic and Kristaps Porzingis. Doncic missed his sixth straight game with a right ankle sprain, while Porzingis rested a sore left knee and is expected back on Monday night.\n\nDevonte Graham had 16 points and 10 assists for the struggling Hornets, who have lost 13 of their last 14 games.\n\nThis one was never close.\n\nThe Mavericks jumped out to a 31-10 lead in the first quarter behind 12 points from Curry and led by as many as 31 in the second half.\n\n\"We could sit up here and speculate all day long but the reality is that we just had a bad first quarter -- 31-10, scored 10 points in a quarter,\" Hornets coach James Borrego said. \"That's going to be a tough grind to get back in that game. It was a disappointing start. I can't explain it. Obviously we've had a lot of things transpire here over the last few days. It is what it is but we have to be better. We own it, we have to take responsibility for it and get better.\"\n\nTIP INS\n\nMavericks: Tim Hardaway Jr. had 14 points. ... Bench outscored Charlotte's bench 54-27. ... Outrebounded the Hornets 46-39.\n\nHornets: Malik Monk had two high-flying dunks for the Hornets. ... New Panthers head coach Matt Rhule and offensive coordinator Joe Brady sat courtside. ... A fan from South Carolina named Lawrence Thomas made a halfcourt shot at the end of the third quarter to win $10,000, drawing applause and smiles from both teams.\n\nDONCIC'S RETURN\n\nCarlise said after the game that Doncic is doing well in his recovery from a sprained ankle, and said he may return to action before the All-Star break.\n\n\"That's the hope, it's not definite but we're hopeful,\" Carlisle said.\n\nROSTER MOVES\n\nThe Hornets waived former No. 2 pick Michael Kidd-Gilchrist and 15-year NBA veteran Marvin Williams earlier in the day, which came as tough news to some of the current players.\n\n\"We just have to stay together,\" Graham said. \"Keep coming, keep fighting. You know in this league you never know. Guys get traded, guys leave and you got to be the next man up. Everybody collectively has to step their game up, whether it's leadership on the court, communication, all of that. Everybody has to do a bit more.\"\n\nBOUNCE-BACK WIN\n\nThe Mavericks were still stinging from a last-second loss to the Washington Wizards on Friday night on a layup by Bradley Beal with 0.2 seconds left -- and they seemed to take their frustration out on the Hornets.\n\n\"You've got a little bit of extra motivation after blowing one last night the way we did,\" Curry said. \"We made adjustments, watched the film today of the mistakes we made, made adjustments on both ends of the floor. That's the good thing about the league. You have a game like that, you have one the next night and we were able to come out and flush it.\"\n\nUP NEXT\n\nMavericks: Host Jazz on Monday night.\n\nHornets: Visit the Pistons on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996057.7806091
}