{
  "game_id": "0021800477",
  "espn_id": "401071158",
  "date": "Dec 21, 2018",
  "matchup": "SAC vs. MEM",
  "headline": "Hield scores 28 points to push Kings past Grizzlies 102-99",
  "body": "SACRAMENTO, Calif. --  Buddy Hield watched Mike Conley put on an impressive shooting display for three quarters. Then he spoiled Conley's big night with his own hot streak.\n\nHield made four of his six 3-pointers over the final 8 1/2 minutes and scored 16 points in the fourth quarter to help the Sacramento Kings rally for a 102-99 victory over the Memphis Grizzlies on Friday.\n\nHield finished with 28 points. De'Aaron Fox had 14 points, eight assists and made two key free throws down the stretch for Sacramento.\n\n\"We had a lot of grit and a lot of fight,\" Hield said. \"Guys wanted it. We played together and we just had fun. We made some shots and we got some stops.\"\n\nThe Kings trailed 82-75 with 9 minutes left when Hield started to heat up. He scored 11 consecutive points for Sacramento, including three straight 3s, to cut the gap to 90-86.\n\nMarc Gasol made two free throws to give Memphis a 97-93 lead with 2:20 left, but Sacramento responded with nine straight points. Hield sparked the decisive run with a 3-pointer and made two foul shots to make it 102-97 with 3.9 seconds remaining.\n\n\"He's a scorer and at some point in every game a scorer's going to get on a roll,\" Fox said of Hield. \"It's bound to happen. There's a lot of guys in the league that can really do that, and he's the guy on our team that really does that well.\"\n\nBogdan Bogdanovic had 14 points for the Kings, who had dropped three of four. Willie Cauley-Stein added 12 points and 13 rebounds.\n\nThe end of the game was delayed briefly after Hield was called for goaltending on a Shelvin Mack layup. Officials reviewed the play and put .5 seconds back on the clock, but Gasol had already retreated to the locker room and had to be called back out to finish the game.\n\n\"At the end of the game we made too many mistakes defensively,\" Gasol said. \"They took that momentum and finished the game on their terms.\"\n\nConley had 23 points and seven rebounds for Memphis, which has lost five straight and seven of eight. Conley also tied his career high with seven 3-pointers, two shy of the Grizzlies' single-game record.\n\nTemple scored 17 points against his former team while Gasol and Jaren Jackson had 12 points apiece.\n\nMemphis has been held under 100 points in eight consecutive games and 10 of 11.\n\n\"The entire second half we made mistake after mistake after mistake,\" coach J.B. Bickerstaff said. \"We didn't deserve to win this game. It's time for all of us to be fed up with what's going on, hold ourselves accountable.\"\n\nIman Shumpert scored 11 consecutive points in the second quarter to help the Kings trim a 19-point deficit to 53-40 at halftime. Shumpert had missed the previous three games for a variety of reasons, including a right hip contusion.\n\nTIP-INS\n\nGrizzlies: Memphis made 16 3-pointers, one shy of the franchise record. ... Joakim Noah did not play for a second straight game due to right heel soreness.\n\nKings: The 40 points were Sacramento's season low for a half. ... Nemanja Bjelica picked up a technical foul in the second quarter and a Flagrant 1 foul in the third. ... Marvin Bagley III continues to be sidelined by a left knee bone bruise. The second overall pick has not played since getting hurt early against Golden State on Dec. 14. Bagley is scheduled to be re-evaluated next week. ... Bogdanovic was back in the lineup after sitting out Wednesday with a sore right foot.\n\nOVER 1,000\n\nConley added to his franchise record for career 3-pointers and now has 1,003.\n\nCOMEBACK KIDS\n\nThe Kings have won four games this season when trailing entering the fourth quarter.\n\n\"That's a Memphis team that needed to get this one, they knew it, they were locked in,\" Sacramento coach Dave Joerger said. \"I don't know but maybe we stole one.\"\n\nUP NEXT\n\nGrizzlies: Play at the Los Angeles Lakers on Sunday.\n\nKings: Host New Orleans on Sunday. The Pelicans scored 149 points against Sacramento when the teams played in October.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994880.880556
}