{
  "game_id": "401809811",
  "espn_id": "401809811",
  "date": "Nov 28, 2025",
  "matchup": "ATL vs CLE",
  "headline": "Jalen Johnson's triple-double leads Hawks to 130-123 victory over Cavaliers in NBA Cup game",
  "body": "ATLANTA -- — Jalen Johnson had 29 points, 12 rebounds and 12 assists to lead the Atlanta Hawks to a 130-123 win over the Cleveland Cavaliers in an NBA Cup game on Friday night.\n\n\r\n              Atlanta eliminated Cleveland from the in-season tournament, meaning neither team advances to the quarterfinal round.\n\n\r\n              Nickeil Alexander-Walker added 28 points, including a clutch late 3-pointer, helping Atlanta go on an 7-0 run in less than 30 seconds to create separation. \n\n\r\n              Donovan Mitchell led Cleveland with 42 points. It was Mitchell's sixth game out of the last eight scoring at least 30 points and the second-highest point total of the season. \n\n\r\n              Atlanta's Zaccharie Riscaher hit a go-ahead 3-pointer with 1:09 remaining to break a 123-all tie, and Alexander-Walker hit a pull-up 3-pointer with 47.7 seconds left after Mitchell misfired on a potential game-tying shot.\n\n\r\n              Atlanta held Cleveland scoreless over the final 2:03. The Cavaliers had led by four points with 2:25 to play. \n\n\r\n              Both teams went on extended runs in the first half. The Hawks used a 21-4 spurt in the first quarter and led by as many as 13. The Cavaliers used a 14-0 run in the second quarter to erase their deficit.\n\n\r\n              The teams have split their first two regular-season games, with each side winning at home. The teams will meet two more times in April, during the final week of the regular season. \n\n\r\n              Up next\r\n              Cavaliers: Will host the Boston Celtics on Sunday.\n\n\r\n              Hawks: Will face the 76ers in Philadelphia on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042705.660629
}