{
  "game_id": "0022300989",
  "espn_id": "401585617",
  "date": "Mar 18, 2024",
  "matchup": "MEM @ SAC",
  "headline": "Sabonis records 50th straight double-double, Monk leads the way in OT as Kings beat Grizzlies",
  "body": "SACRAMENTO, Calif. -- — Malik Monk scored 12 of his 28 points in overtime, Domantas Sabonis had his 50th straight double-double and the Sacramento Kings beat the Memphis Grizzlies 121-111 on Monday night.\n\n\r\n              “Having a guy like Malik close the way he did was a lot of fun to watch,” Sacramento coach Mike Brown said. “We just put the ball in his hands and put them in pick-and-roll, and he was able to create a little bit of separation and get to his medium game, and he was really on point with it tonight.”\n\n\r\n              Monk added six rebounds and six assists as the Kings improved to 5-1 in overtime.\n\n\r\n              “I feel like I was relaxing a little bit in the fourth quarter,\" he said. \"I was just able to turn that around in overtime and we got the win.”\n\n\r\n              Sabonis finished with 25 points and 18 rebounds, and De’Aaron Fox had 23 points, 10 assists and seven rebounds for Sacramento.\n\n\r\n              GG Jackson scored the first basket of overtime to put Memphis in front before Monk scored eight in a row and assisted on a dunk by Sabonis as part of a 12-0 run that helped the Kings outscore the Grizzlies 16-6 in the extra period.\n\n\r\n              “It’s always great when you have multiple guys who can take over a game,” Fox said. “With (Monk) having it going like that, you know that he’s also still going to make the right play.”\n\n\r\n              Jaren Jackson Jr. led the Grizzlies with 25 points on 8-of-27 shooting. Desmond Bane added 24 points, and GG Jackson had 22.\n\n\r\n              “Very proud of how our guys competed,” Memphis coach Taylor Jenkins said. “Give the Kings credit, they made big-time plays: Fox at the end of the fourth, Monk taking over in overtime. That was a high-level basketball game. Our guys should be extremely proud.”\n\n\r\n              The Kings played most of the game without starting guard Kevin Huerter, who exited with a left shoulder injury just 1:51 into the first quarter.\n\n\r\n              Huerter was attempting a layup when Bane made contact with his left arm, sending him to the ground. Bane was called for a common foul.\n\n\r\n              Huerter briefly remained on the floor before heading to the locker room while cradling his arm. \n\n\r\n              Brown did not have an update on Huerter after the game.\n\n\r\n              Memphis closed the first quarter on an 8-0 run to take a 32-28 lead. Sacramento dominated the second, outscoring the Grizzlies 29-15 to go up 57-47 at halftime.\n\n\r\n              The Kings extended the lead to 63-52 early in the third before Memphis scored 10 straight points to get within one.\n\n\r\n              Fox made three straight 3-pointers in the final 1:39 of the third to extend Sacramento’s lead to 84-76. \n\n\r\n              The Grizzlies rallied in the fourth, using a 10-1 run to tie the game at 97 with 4:47 remaining.\n\n\r\n              Memphis' Marcus Smart, inactive due to a right ring finger injury, picked up two technical fouls on the bench late in overtime and was ejected.\n\n\r\n              Grizzlies guard Luke Kennard missed the game due to personal reasons.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At Golden State on Wednesday night.\n\n\r\n              Kings: At Toronto on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995994.429992
}