{
  "game_id": "0021900385",
  "espn_id": "401161027",
  "date": "Dec 14, 2019",
  "matchup": "MIL vs. CLE",
  "headline": "Antetokounmpo, Middleton lead Bucks to 18th straight win",
  "body": "MILWAUKEE --  Giannis Antetokounmpo displayed his remarkable skills early and often as the Milwaukee Bucks continued their quest to break a franchise record that has stood for nearly half a century.\n\nThe reigning MVP sank a 3-pointer for his first points of the game, then followed with a spinning layup, a wide-open dunk and a step-through slam for nine quick points to give Milwaukee an early lead.\n\nAnd when the Cleveland Cavaliers made it close in the second quarter, Antetokounmpo streaked down the court, received a feed from Donte DiVincenzo and threw down a one-handed dunk as the Bucks began to pull away.\n\nAntetokounmpo and the Bucks went on to beat Cleveland 125-108 Saturday night, their 18th consecutive win.\n\n\"You can try to game plan for Giannis and you can try to game plan for a team like that, but they're very long, they can shoot the ball and they can play inside out,\" Cavaliers forward Kevin Love said. \"They are on a major winning streak right now and they're playing some of the best, if not the best, basketball in the NBA.\"\n\nThe Bucks have won 22 of their last 23 and improved to 24-3, one-half game ahead of the idle Los Angeles Lakers for the best record in the league. The Bucks have not lost since Nov. 8 at Utah.\n\nThe streak is the second longest in franchise history. The Bucks won 20 consecutive games in the 1970-71 season on the way to winning their lone NBA championship.\n\n\"When we run and our pace is really fast, everyone gets easy ones, and everyone gets open shots,\" Antetokounmpo said. \"It just makes the game fun. And when the game is fun, I think everyone defends, also.\"\n\nKevin Porter Jr. had 15 points and Jordan Clarkson scored 13 for the Cavaliers, who grabbed a brief lead in the second quarter on a jumper by Clarkson but were then outscored 34-14 to close the period.\n\nThe Bucks' lead grew to as many as 28 points in the third quarter, and they cruised the rest of the way for their 13th straight win at home.\n\n\"They're explosive in offensive transition,\" Cleveland coach John Beilein said. \"We have to do a better job there collectively. That lead can explode on you in a minute.\"\n\nCleveland, which had ended an eight-game losing streak with an overtime win over San Antonio on Thursday night, committed 18 turnovers that the Bucks converted into 21 points.\n\n\"Our turnovers are killing us right now,\" Beilein said.\n\nLove had 12 points and 10 rebounds for Cleveland.\n\nAntetokounmpo, who missed his first game of the season Wednesday night against New Orleans, played just 24 minutes, while Middleton, who had 26 points on Friday night, played 23.\n\nTIP-INS\n\nCavaliers: Dylan Windler is being re-evaluated for a stress reaction in his left leg. The team's first-round pick this year has yet to play for Cleveland. \"He really could give us a spark right now,\" Beilein said. \"I really feel bad for him. We'll let him go dormant for a couple weeks, see if it's nothing.\" ... Ten players scored in the first half, but none reached double figures. Thompson and Darius Garland each had eight. ... John Henson, who hadn't made a 3-pointer this season, connected on back-to-back shots from deep in the fourth quarter.\n\nBucks: Eric Bledsoe has been diagnosed with a right fibula avulsion fracture and is expected to be sidelined for about two weeks, the team announced after the game. Bledsoe limped off the court in the third quarter of Friday's game at Memphis. Donte DiVincenzo, who started in Bledsoe's place, had 15 points. ... Ten players saw action in the first quarter. ... Coach Mike Budenholzer challenged a blocking foul call on Ersan Ilyasova with 18.2 seconds left in the third and Milwaukee leading by 25. The call stood. ... Robin Lopez had a season-high 16 points. ... A member of the Rim Rockers, a team of daredevils who perform at Bucks home games, was injured during a halftime show. The man crawled off the court before being immobilized and was carried away on a stretcher by emergency medical personnel.\n\nFINDING MOTIVATION\n\nBudenholzer said players have found their own motivation during the lengthy win streak.\n\n\"I'm not a big motivator,\" he said. I think (general manager) Jon (Horst) and the front office, we try to find guys that are competitive and self-motivated because I'm probably terrible at (motivating). We need guys that just bring it every night on their own.\"\n\nBACK-TO-BACK SUCCESS\n\nThe Bucks improved to 4-0 this season in the second of back-to-back games.\n\n\"Obviously, we are off to a pretty good decent start, so there's a lot of positives that are happening regardless of what the day is,\" Budenholzer said.\n\nUP NEXT\n\nCavaliers: Visit Toronto on Monday for the teams' first meeting this season.\n\nBucks: Host the Dallas Mavericks on Monday. Milwaukee has won three in a row in the series.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996159.18864
}