{
  "game_id": "0021501016",
  "espn_id": "400828903",
  "date": "Mar 17, 2016",
  "matchup": "CHI vs. BKN",
  "headline": "McDermott, Butler lead Bulls past Nets 118-102",
  "body": "CHICAGO --  Doug McDermott is getting comfortable in his second NBA season -- and coming on just when the Chicago Bulls need him.\n\nMcDermott scored 25 points and Jimmy Butler added 22 to help the Bulls beat the Brooklyn Nets 118-102 on Thursday night.\n\nIt's the third straight 20-plus point game for McDermott, and Chicago moved a half-game in front of idle Detroit into eighth place and the final playoff spot in the Eastern Conference. Bobby Portis added 12 points and 14 rebounds.\n\nMcDermott, the 11th overall pick in the 2014 NBA draft, is pumping in some timely points for an injury-ravaged Bulls team that's struggling to make the postseason.\n\n\"His confidence is at a very high level right now,\" coach Fred Hoiberg said. \"He's finding good shots and taking them.\n\n\"His overall movement is helping us. He's running off the screen. Sometimes taking a very difficult shot, but he is making them.\"\n\nThe 24-year-old McDermott said he's getting into a rhythm as Hoiberg puts him in key situations.\n\n\"Just the belief that the coaches and the guys on the team have in me,\" McDermott said. \"I got it going early, which always helps, so I just have to build off that.\"\n\nThe Bulls raced to a 24-point lead in the second quarter, then held on and finally finished off the lowly Nets, who outscored Chicago 37-24 in the third and closed within four points early in the fourth.\n\nChicago got a season-high 60 points from its reserves, including McDermott's output that included five 3-pointers.\n\nBojan Bogdanovic led the Nets comeback with 26 points, one game after scoring a career-high 44 points in Brooklyn's 131-114 victory over league-worst Philadelphia on Tuesday night.\n\nThaddeus Young added 16 points and pulled down 16 rebounds.\n\nThe Bulls had little trouble scoring and controlling play in the first half against the Nets. Chicago outshot Brooklyn 49 to 33 percent from the field to roll up a 55-37 lead at the half.\n\nBrooklyn clawed back in the third to cut it to 79-74. Bogdanovic's 3-pointer with 2:18 left in the quarter sliced Chicago's lead five points.\n\nThen Brooklyn closed to four on Chris McCullough's 3-point shot 2:58 into the fourth.\n\n\"That's all effort,\" Brooklyn interim coach Tony Brown said. \"Our intensity level picked up\"\n\nBut the Bulls used a late run, including key 3 pointers from McDermott and Derrick Rose, to put it away.\n\nChicago had used an 11-0 run in the final 3:26 of the first quarter to take a 24-14 lead. McDermott had the hot hand in the stretch, scoring seven of his points.\n\nChicago kept rolling in the second. Taj Gibson, a game-time decision as a starter, looked happy and healthy with his wide-open hanging dunk that made it 47-23 with 4:24 to go for Chicago's biggest lead of the night.\n\nGASOL IMPROVING\n\nChicago C/F Pau Gasol missed his third game with right knee inflammation, but Hoiberg said Gasol \"is feeling significantly better\" and is expected to take stationary shots on Friday. Hoiberg ruled out Gasol for Saturday's game against Utah but said he would be re-evaluated for the Bulls' following contest, Monday when they host Sacramento.\n\nINJURY BUGGED\n\nThe Bulls have been ravaged by injuries. So Hoiberg's response when asked about Gasol's exact condition: \"I can't remember what it's called, I've got so many of them.\"\n\nHOMECOMING\n\nBrown is from Chicago and guided the Nets from the bench for the first time in his hometown after being named on Jan. 10. Brown grew up watching the Bulls, played 10 games for them 1985-86, and had a contingent of friends and family at the game.\n\n\"Obviously it's full circle for me,\" Brown said. \"It's just the culmination of my career so far.\"\n\nTIP-INS\n\nNets: Brooklyn signed C Henry Sims to a 10-day contract on Thursday. Brown called Sims a \"quality big guy,\" but planned to get him practice time before inserting him in game. The 6-foot-10 Sims played 73 games last season for Philadelphia.\n\nBulls: Gibson started on Thursday after being a game-time decision but said after the game he had intended to play all along. He played only 8 minutes in a 117-96 loss at Washington on Wednesday after aggravating his right hamstring, but was on the court for 27 minutes against the Nets. ... E'Twaun Moore suffered a left hamstring injury and played only 2 minutes.\n\nUP NEXT\n\nNets: Play the Pistons at Detroit on Saturday.\n\nBulls: Host the Utah Jazz on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764993909.590327
}