{
  "game_id": "0022000641",
  "espn_id": "401307428",
  "date": "Mar 20, 2021",
  "matchup": "PHI vs. SAC",
  "headline": "Harris leads short-handed 76ers past Kings 129-105",
  "body": "PHILADELPHIA -- — Tobias Harris knows the Philadelphia 76ers are an elite NBA team with Ben Simmons and Joel Embiid in the lineup. Harris wanted to show they’re pretty good without the pair of All-Stars, as well.\n\n\r\n                    Harris scored 23 of his 29 points in the first half and fell just short of a triple-double to lead the short-handed 76ers over the Sacramento Kings 129-105 on Saturday night.\n\n\r\n                    “He really set the tone tonight with his attitude and then obviously his play,” Philadelphia coach Doc Rivers said. “His total play was phenomenal.”\n\n\r\n                    The Eastern Conference-leading 76ers (29-13) played without starters Embiid, Simmons and Seth Curry.\n\n\r\n                    Harris said winning without their stars is a mentality.\n\n\r\n                    “Are we willing to fall into the distraction of, ‘Hey, we don’t have two of our top dogs?’ Or are we willing to embrace it?” Harris said. “I take that stuff personal when people believe we can’t win without those guys because I know how much talent we have as a group. And I know how well we play together as a team as a whole. We have a culture and a system here that works. When we trust it and do what is asked of us, we’re a hell of a team.”\n\n\r\n                    Shake Milton had 28 points and Danny Green scored 18 for Philadelphia. Harris added 11 rebounds and eight assists.\n\n\r\n                    In addition to regular starters Green and Harris, the Sixers went with Tony Bradley, Matisse Thybulle and Milton to open the game.\n\n\r\n                    “With all those guys out, what we did was execute well,” Rivers said.\n\n\r\n                    Philadelphia jumped out fast, using 16-of-26 shooting — including an impressive 6 for 8 from 3-point range — in the first quarter to take a 42-21 lead.\n\n\r\n                    Sacramento never got close after that.\n\n\r\n                    The offense kept coming for the Sixers in the second, and they were up 73-52 at halftime.\n\n\r\n                    Philadelphia took its biggest lead on Dwight Howard’s tip-in with 6.1 seconds left in the third period that made it 106-80.\n\n\r\n                    The 76ers finished shooting 56% (48 of 86) from the field, including 48% (11 of 23) from 3-point range.\n\n\r\n                    “It’s obviously good to play that type of basketball and get a victory,” Harris said. “Just a testament to guys making shots, us playing in a flow and getting into a rhythm.”\n\n\r\n                    Buddy Hield scored 25 points and De’Aaron Fox added 16 for Sacramento, which dropped to 2/3 on a six-game road trip that concludes Monday at Cleveland. The Kings (17-25) entered 2½ games behind Memphis for the No. 10 seed and a berth in the NBA’s Play-In Tournament.\n\n\r\n                    “Very disappointing game,” coach Luke Walton said. “We didn’t start with the appropriate energy that is required to compete.”\n\n\r\n                    Walton, however, wasn't going to spend too much time or energy overanalyzing the defeat.\n\n\r\n                    “I'll chalk this up to just not having it. For whatever reasons, we didn’t have it tonight,” he said. “We were not sharp. It’s not an excuse. But we’re going to move past this, get some rest tonight and be better in Cleveland.”\n\n\r\n                    MISSING PIECES\n\n\r\n                    Embiid has missed four straight games with a bruised left knee and is expected to be re-evaluated late this week. Simmons experienced knee soreness at the morning shootaround and was a surprise late scratch. Curry injured his left ankle in Wednesday’s 109-105 loss to Milwaukee.\n\n\r\n                    Curry isn’t expected to play in Sunday’s game at the Knicks, and Rivers wasn’t able to provide an update on Simmons' status after the game.\n\n\r\n                    GO GO GADGET\n\n\r\n                    Thybulle, a defensive stalwart, had a stellar recovery block with 40 seconds left in the first half.\n\n\r\n                    “He’s like Inspector Gadget with those long arms, and his recovery time is unbelievable,” Rivers said. “He keeps making plays like that every night, and it’s absolutely wonderful to watch.”\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Former 76ers C Richaun Holmes finished with 10 points and four rebounds. He had double-doubles in five of his previous six games and has 15 for the season. … Sacramento fell to 8-13 on the road.\n\n\r\n                    76ers: Philadelphia improved to 19-4 at home. … Howard had 10 points and 13 rebounds while continuing to energize the home crowd.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: At the Cleveland Cavaliers on Monday.\n\n\r\n                    76ers: At the New York Knicks on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997086.2374809
}