{
  "game_id": "0021600083",
  "espn_id": "400899533",
  "date": "Nov 05, 2016",
  "matchup": "CHI @ IND",
  "headline": "Persistent Pacers take advantage of weary Bulls, 111-94",
  "body": "INDIANAPOLIS --  After spending two days dissecting the problems from their last loss, the Indiana Pacers found some solutions Saturday.\n\nAnd they didn't even need their best player, Paul George, to bail them out.\n\nInstead, Indiana made a season-high 12 3-pointers, forced 18 turnovers and pulled away from the struggling Chicago Bulls for a resounding 111-94 victory, after George was banished to the locker room for the final 13 1/2 minutes after inadvertently kicking the ball into the stands.\n\n\"This is what we feel we can do out on the floor,\" Pacers coach Nate McMillan said. \"Again, it's going to be a process and it's going to take time for us to continue to build. But this is the type of game we want to build off of.\"\n\nThere was a reason this one looked easy.\n\nAfter seeing their problems exposed on tape, the embarrassed Pacers (3-3) found motivation in proving everyone wrong this time -- especially against a team playing back-to-back games for the first time this season.\n\nThe Pacers took full advantage of the opportunity.\n\nC.J. Miles scored 20 points off the bench, making four 3s. Myles Turner finished with 16 points and four blocks, and George still had 13 points and seven rebounds.\n\nThat was more than enough against the Bulls (3-3), who have lost three straight.\n\nJimmy Butler and Doug McDermott each scored 16 points, while Rajon Rondo had nine points and five assists. But Rondo (four) and Butler (six) combined for nearly as many turnovers as the Pacers had as a team (12).\n\n\"Right out of the gate, you could see it was going to be tough,\" Bulls coach Fred Hoiberg said. \"We've got to find a way to bounce back and do the things to be successful.\"\n\nThe game was only tied once, at 2-2, and Indiana soon took control.\n\nEJECTED\n\nGeorge appeared to be upset when there was a no-call on one of his shots and then he was called for a foul on the Bulls' ensuing possession. He was assessed a technical foul and immediately ejected. He said he apologized to the fan the ball hit. \"I just meant to kick the ball against the stanchion,\" George said. \"My soccer skills aren't as good as I thought. I'm glad my teammates were able to pick up this win and me not be at fault for a loss.\"\n\nTHREE FOR THE SHOW\n\nAfter George's departure, with 1:42 left in the third, the Pacers had two 3s out of their next four baskets. Indiana, which took 26 attempts, had made 10 3-pointers three other times this season.\n\nTIP-INS\n\nBulls: Had an eight-game streak with 100 or more points snapped. ... One night after Wade made five 3-pointers, his highest single-game total since April 2009, he was 1 of 9 from the field and 0 for 2 on 3s. ... Guard R.J. Hunter returned to his hometown for the first time with Chicago.\n\nPacers: Extended the lead to 26 in the second half, their largest lead of the season. The previous best was 16 points against the Los Angeles Lakers on Nov. 1. ... The Pacers scored 62 points in a half for the second time this season and topped the 100-point mark for the fifth time in six games.\n\nUP NEXT\n\nBulls: Will try to snap their two-game losing streak against Orlando when the series resumes Monday in Chicago.\n\nPacers: Will chase their first road win of the season Monday night at Charlotte. The Hornets have won three of the last four in the series including a sweep last season.",
  "source": "espn_api",
  "crawled_at": 1764995111.145256
}