{
  "game_id": "0022300480",
  "espn_id": "401585108",
  "date": "Jan 05, 2024",
  "matchup": "IND vs. ATL",
  "headline": "Haliburton has 18 of Indiana's team-record 50 assists, Pacers rout Hawks 150-116 for 6th win a row",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton had 18 of Indiana’s franchise-record 50 assists and the Pacers routed the Atlanta Hawks 150-116 on Friday night for their sixth straight victory.\n\n\r\n              Haliburton, the NBA assists leader at 12.8 per game, also had 10 points and eight rebounds in just over 25 minutes. Myles Turner led Indiana with 27 points, Bennedict Mathurin had 18, Bruce Brown 17 and Aaron Nesmith 15.\n\n\r\n              “The assist number is tremendous and obviously an NBA and ABA franchise record is really strong and speaks to the unselfishness of the team,” Pacers coach Rick Carlisle said. “That’s something to celebrate. But in this league celebration times are short. So we’ll have to get in our beds tonight and rest up for Boston (Saturday). It’s really the greatest test in basketball now.”\n\n\r\n              The NBA’s highest-scoring team, Indiana reached 150 points against the Hawks for the second time this season after setting a league season high in a 157-152 victory in Atlanta on Nov. 21.\n\n\r\n              “I liked the way we played,” Carlisle said. “We brought an element of physicality that need to be there and we managed to avoid fouls and that helped our defense.”\n\n\r\n              Dejounte Murray led the Hawks with 30 points. Trae Young missed his first seven shots and finished with 13 points on 4-of-18 shooting. He was 1 of 11 from 3-point range.\n\n\r\n              The Pacers shot 71% in the first half and led 78-54 at the break. Indiana shot 64% overall while Atlanta was at 43%. Indiana was 19 of 39 from 3-point range\n\n\r\n              Haliburton said he has developed a great partnership with Turner, who made 10 of 14 shots.\n\n\r\n              “I feel like we have one of the best pick-and-roll duos in the league, something we can keep growing on,” Haliburton said.\n\n\r\n              Turner said the team has great fun together on the court.\n\n\r\n              “There’s a different energy around this group,” Turner said. “We’ve created an environment here that makes it easy to have a night like this.”\n\n\r\n              The Hawks definitely weren’t having much fun.\n\n\r\n              “Sometimes there are games where you didn’t play well and we didn’t,” Hawks coach Quin Snyder said. “I don’t know we did anything at the level we need to win against these guys on the road. They’re obviously playing well and made it hard on us. We didn’t have it tonight.”\n\n\r\n              Snyder said the Hawks allowed the Pacers to get too many easy baskets.\n\n\r\n              “We need to run back and have the urgency you need against these guys in transition, that started early,” Snyder said.\n\n\r\n              The Pacers were without Andrew Nembhard for the second straight game because of soreness in his back.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Orlando on Sunday night.\n\n\r\n              Pacers: Host Boston on Saturday and Monday nights.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996199.430968
}