{
  "game_id": "0022400686",
  "espn_id": "401705252",
  "date": "Feb 01, 2025",
  "matchup": "ATL @ IND",
  "headline": "Pascal Siakam hits late 3-pointer as the Pacers hang on to beat the Hawks, 132-127",
  "body": "INDIANAPOLIS -- — Pascal Siakam made a key 3-pointer late in the fourth quarter and finished with 20 points, nine rebounds and five assists to help the Indiana Pacers beat the reeling Atlanta Hawks 132-127 on Saturday night.\n\n\r\n              Andrew Nembhard had 19 points for the Pacers, who have won three straight. Obi Toppin added 18 points and nine rebounds, and Tyrese Haliburton had 17 points and nine assists.\n\n\r\n              Trae Young scored 26 of his 34 points in the second half, leading the Hawks back from an early 18-point deficit to retake the lead midway through the third quarter. He also had 17 assists. Dyson Daniels finished with 23 points as Atlanta lost its eighth in a row.\n\n\r\n              Indiana looked as if it would run away early, but the Hawks steadily climbed back and retook the lead midway through the third. The teams traded leads throughout the fourth quarter, but Indiana seized control when Siakam's 3 with 3:20 to go spurred an 11-3 run.\n\n\r\n              Takeaways\r\n              Hawks: Yes, the Hawks have struggled lately, But with Young leading the way, Atlanta fought back and showed some real toughness against the surging Pacers.\n\n\r\n              Pacers: Indiana started fast, making seven 3s in the first quarter but only made five over the final three quarters. They still need to develop a stronger knockout punch, the one they'll need if they hope to reach their preferred postseason destination.\n\n\r\n              Key moment\r\n              Siakam's 3 broke a 119-119 tie and when Aaron Nesmith followed Siakam's shot with another 3, the Pacers led 125-119. No, it didn't seal it. But it did give Indiana enough breathing room with 2:52 left.\n\n\r\n              Key stat\r\n              Indiana only had 11 turnovers and wound up with a 15-5 advantage in points off turnovers.\n\n\r\n              Up next\r\n              Both teams are back in action Monday night. Atlanta closes out a three-game trip at Detroit, and Indiana begin a four-game trip at Utah.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997924.061602
}