{
  "game_id": "0022300741",
  "espn_id": "401585369",
  "date": "Feb 08, 2024",
  "matchup": "POR vs. DET",
  "headline": "Pistons win consecutive games for first time since October, beating Trail Blazers 128-122 in OT",
  "body": "PORTLAND, Ore. -- — Jalen Duren had 27 points and 21 rebounds and the Detroit Pistons won consecutive games for the first time since October, overcoming Jerami Grant’s career-high 49 points to beat Portland 128-122 in overtime Thursday night.\n\n\r\n              Jaden Ivey added 26 points and Cade Cunningham had 23 to help the NBA-worst Pistons improve to 8-43. They beat Sacramento 133-120 on Wednesday night, then rallied from 23 points down to top Portland.\n\n\r\n              “A game like this, after everything we’ve been through, losing so many guys, on a back-to-back, to go into overtime and win, that’s pretty cool for a group that’s learning the steps that it takes to win games,” Pistons coach Monty Williams said.\n\n\r\n              Both teams were significantly short-handed.\n\n\r\n              Detroit made several trades Thursday at the deadline, shipping out rotation players Alec Burks and Bojan Bogdanovic and waiving Joe Harris and Killian Hayes to complete the deals. None of the players they traded for completed their physicals in time to join the team.\n\n\r\n              “A lot of emotions,” Duren said. “Lost a lot of our brothers, a lot of great guys that were a part of this program. But that’s no excuse. It’s the business. Everyone knows how it goes.”\n\n\r\n              Detroit’s other consecutive victories came in a back-to-back at Charlotte and home against Chicago in the second and third games of the season. The Pistons followed that by losing 28 in a row to tie the NBA record.\n\n\r\n              Portland was without two starters, guard Malcolm Brogdon and center Deandre Ayton (both out with illness) and backup point guard Scoot Henderson (foot) and center Duop Reath (knee). Simons sprained his ankle sprain in the second half and did not return.\n\n\r\n              Anfernee Simons added 29 points for Trail Blazers.\n\n\r\n              After the Blazers built a big lead, Detroit came back in the fourth quarter and tied it in the final 15 seconds. Portland didn’t score on the final possession, which sent the game to overtime. Detroit pulled away in the extra period.\n\n\r\n              “There was a lot of people in the game at that point that are usually not in the game,” Trail Blazers coach Chauncey Billups said. “But it’s good experience for those guys and good teachable things.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: At Los Angeles Clippers on Saturday.\n\n\r\n              Trail Blazers: Host New Orleans on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996571.865217
}