{
  "game_id": "0022400236",
  "espn_id": "401704802",
  "date": "Nov 17, 2024",
  "matchup": "CHA @ CLE",
  "headline": "Darius Garland scores 25, Cavaliers become 4th team to start 15-0 with 128-114 win over Hornets",
  "body": "CLEVELAND -- — Darius Garland scored 25 points, Ty Jerome matched his career-high with 24 in place of Donovan Mitchell and the Cleveland Cavaliers stayed unbeaten with a 128-114 win over the Charlotte Hornets on Sunday night.\n\n\r\n              The Cavs are the fourth team to start 15-0, joining the Golden State Warriors (2016), Houston Rockets (1994) and Washington Capitols (1949). The Warriors set the league record by winning their first 24 games on the way to a 73-9 season.\n\n\r\n              Evan Mobley had 23 points and 11 rebounds and Jarrett Allen had 21 and 15 rebounds for Cleveland, which will play at defending champion Boston on Tuesday.\n\n\r\n              Although they wanted to keep their winning streak alive, the Cavs felt getting Mitchell rest was more important. It's a long season with bigger games ahead, and first-year coach Kenny Atkinson, who has yet to lose with Cleveland, said sticking to the plan with Mitchell was a priority.\n\n\r\n              LaMelo Ball had 31 points and 12 assists, and Miles Bridges scored 19 for the Hornets.\n\n\r\n              Earlier, Ball was fined $100,000 by the NBA for making “an offensive and derogatory comment” during an interview following Saturday's win at Milwaukee.\n\n\r\n              Takeaways\r\n              Hornets: Showed some fight in the second night of a back-to-back, but couldn't get stops down the stretch.\n\n\r\n              Cavaliers: Barely missed a beat without Mitchell, who was coming off a season-high 37-point performance. One of the many plusses during the winning streak is that it's allowing Atkinson to further develop his bench.\n\n\r\n              Key moment\r\n              With Charlotte still hanging around, Garland kicked it out to Jerome for a 3-pointer — and his 12th assist — from the corner with 2:45 left.\n\n\r\n              Key stats\r\n              Cleveland shot 67% (26 of 39) in the first half. ... Jerome tied a career-best with eight assists.\n\n\r\n              Up next\r\n              Charlotte visits Brooklyn on Tuesday in an NBA Cup game, the same day the Cavaliers play at the Celtics.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997462.892844
}