{
  "game_id": "0021600103",
  "espn_id": "400899553",
  "date": "Nov 08, 2016",
  "matchup": "PHX @ POR",
  "headline": "Lillard has 38 and Blazers hold off Suns 124-121",
  "body": "PORTLAND, Ore. --  The scoreboard may say victory, but Damian Lillard sees work to do.\n\nLillard scored 38 points, making key free throws in the waning seconds, and the Portland Trail Blazers held off the Phoenix Suns for a 124-121 victory on Tuesday night.\n\nAfter leading by 18 points early, it shouldn't have been so close at the end, Lillard said.\n\n\"We talk about just being able to play the way we want to play for longer spans of time,\" he said. \"We'll play really well for seven minutes, and then in four minutes we'll give up a 15-2 run and give up everything we just worked for. We got to continue to work on that. The good thing is, we're able to find a way to win games while we work on it.\"\n\nCJ McCollum added 33 points for the Blazers, who have won three straight.\n\nLillard hit a 3-pointer with 6:45 left that put Portland in front 101-95. Eric Bledsoe made a free throw to pull Phoenix within 115-114 with just under a minute left, but he missed the second attempt that would have tied it and Lillard scored a layup on the other end.\n\nBledsoe hit two free throws to again get within a point, but Lillard was fouled with 13.3 seconds left and made both to put Portland up 119-116.\n\nDevin Booker made a 3-pointer that pulled the Suns within 122-121 but Lillard again hit two free throws with 3.7 seconds left and Booker missed from some 25 feet has time ran out.\n\nBledsoe finished with 31 points and Booker had 23.\n\n\"It's not tough for us to come back, we come back a lot,\" Suns coach Earl Watson said. \"That's what we do. Our team is really close and we have a lot of belief.\"\n\nThe Suns, who opened the season with four straight losses before winning two of their last three, were without Tyson Chandler because of personal reasons. Chandler has been in double-digit rebounds in three of the last four games.\n\nWatson started rookie Marquese Chriss, who was making his first career start. Chriss, who finished with seven points, was a first-round draft pick (eighth overall) out of Washington by the Sacramento Kings, acquired by the Suns in a draft-day trade.\n\nPortland was hurt when they lost starting forward Al-Farouq Aminu to a left calf strain early and he did not return. Aminu is averaging seven points and 7.9 rebounds this season.\n\nAminu said after the game that he was unlikely to play on Wednesday when the Blazers visit the Clippers.\n\nMcCollum hit his first six shots, including three 3-pointers, and the Blazers jumped out to a 27-12 lead. McCollum matched his career high with 37 points in Portland's 100-94 victory at Memphis on Sunday.\n\nBooker had 39 points in the Suns' 119-108 loss at the Lakers on Sunday, after scoring 38 in a 112-111 overtime victory over New Orleans on Friday, becoming the youngest player in NBA history to have back-to-back games with at least 38 points.\n\nTIP-INS\n\nSuns: The Suns beat the Blazers 118-115 in overtime last week in Phoenix. The teams play four games this season.\n\nTrail Blazers: Portland made 12 of its first 13 field goal attempts. ... It was the second time in his career that McCollum has had back-to-back games with 30 or more points.\n\nMENTOR AND FRIEND: Watson played his final NBA season with Portland and grew close to Lillard. The summer before last, when the Blazers lost four starters and Lillard was the last remaining starter on the roster, Watson said the two talked and he told Lillard he needed to be a leader on and off the court. Lillard responded by organizing a team bonding trip to San Diego and the young Blazers went on to go 44-38 and advance to the second round of the playoffs.\n\n\"That is when you saw this young group become something else,\" Watson said.\n\nFAST START: Lillard has scored 262 points so far this season, the most through the first eight games of a season in franchise history. It is also the most by an NBA player since Kobe Bryant had 264 through the first eight in 2009-10.\n\nUP NEXT\n\nSuns: Host the Detroit Pistons on Thursday night.\n\nTrail Blazers: Visit the Los Angeles Clippers on Wednesday night. The Clippers beat the Blazers in Portland 114-106 on Oct. 27.",
  "source": "espn_api",
  "crawled_at": 1764996012.336939
}