{
  "game_id": "0022400008",
  "espn_id": "401703377",
  "date": "Nov 12, 2024",
  "matchup": "MIN @ POR",
  "headline": "Williams and Grant help Trail Blazers beat Timberwolves 122-108",
  "body": "PORTLAND, Ore. -- — Robert Williams and Jerami Grant each scored 19 points to lead the Portland Trail Blazers to a 122-108 win over the Minnesota Timberwolves on Tuesday night.\n\n\r\n              Williams, who recently returned from a knee injury, also had nine rebounds and three assists.\n\n\r\n              Naz Reid led Minnesota with 28 points in the loss while star guard Anthony Edwards pitched in 26 points.\n\n\r\n              The Blazers, who entered the game as the second-worst 3-point shooting team in the NBA, shot a blistering 18 for 32 (56%) from behind the 3-point line. \n\n\r\n              The Blazers jumped out to a 28-17 lead after the first quarter, capped off by a Dalano Banton 3-pointer at the buzzer. Banton entered the game after Portland lost Anfernee Simons for the game due to a chest injury and his backup, Scoot Henderson, picked up three fouls in the first quarter.\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota came into Tuesday’s cup game after blowing an 88-80 lead in the last five minutes to the Miami Heat on Sunday. Their coach Chris Finch blamed himself for the loss. “I take responsibility for that entire game, that was a complete meltdown in a lot of ways. I didn’t have enough answers for the zone,” Finch said. “It wasn’t a late-game thing as much as I thought the zone really stifled us.”\n\n\r\n              Blazers: Donovan Clingan got the first start of his NBA career on Tuesday night in place of Deandre Ayton, who missed the game with a sprained finger. He started the game with a block against Rudy Gobert on the opening play of the game and snagged a steal a few possessions later.\n\n\r\n              Key moment\r\n              Portland had two end of quarter buzzer-beating 3-pointers, one from Banton to end the first quarter and another from Deni Avdija to end the third quarter.\n\n\r\n              Key stat\r\n              The Blazers dominated the bench points in Tuesday night’s game, outsourcing Minnesota 64-39.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998108.7042701
}