{
  "game_id": "0021600788",
  "espn_id": "400900193",
  "date": "Feb 08, 2017",
  "matchup": "MEM vs. PHX",
  "headline": "Conley, Gasol lead Grizzlies past poor-shooting Suns",
  "body": "MEMPHIS, Tenn. --  Troy Daniels hit some big 3-pointers for the Memphis Grizzlies in a blowout win, and he ended the game with some fireworks, too.\n\nMike Conley scored 23 points, Marc Gasol added 19 and the Grizzlies took advantage of the Phoenix Suns' poor shooting in a 110-91 victory on Wednesday night.\n\nMemphis held Phoenix to 33 percent shooting and won its third straight and sixth in its last seven. Six Grizzlies reached double figures, including Daniels with 14 points and JaMychal Green with 11 points and 10 rebounds.\n\n\"Very happy with our effort defensively. They're a very good, young offensive team,\" Conley said of the Suns, adding: \"We were proud to have the kind of effort and attention to detail.\"\n\nDevin Booker led the Suns with 20 points and Eric Bledsoe and Brandon Knight each finished with 16 as Phoenix lost its eighth in the last nine.\n\nWith 1:10 left, Booker fouled Daniels as he made a 3-pointer, and the pair exchanged words. It escalated into a court-wide skirmish, and six players received technical fouls and three players were ejected, including Daniels.\n\n\"You talk trash sometimes,\" Booker said of his words with Booker. \"I don't know why he'd be talking trash with me. He's been on five teams in three years, and he has the nerve to talk trash to me?\"\n\nSuns coach Earl Watson appreciated the emotional display from his team in a tough loss.\n\n\"That shows they believe in each other,\" he said. \"And they believe in a purpose.\"\n\nBefore the fracas, the game was rather methodical for Memphis. By the early stages of the first half, the Grizzlies built a big lead that eventually reached 22 and never seemed in danger.\n\nBledsoe and Booker misfired, and Phoenix was mired at about 30 percent shooting near the midway point of the third quarter. The Suns' two starting guards finished the night a combined 9 of 28, including one of seven shots from outside the arc.\n\n\"We were just missing looks we normally make,\" Bledsoe said. \"We weren't playing with energy, especially our starters.\"\n\nOnly poor ball-handling by the Grizzlies prevented Memphis from building the lead until consecutive 3-pointers from Daniels stretched the advantage to 71-53 in the latter stages of the third, eventually leading to a 79-65 lead at the end of the frame.\n\nTIP-INS\n\nSuns: Phoenix leads the NBA in free-throw attempts with an average of 26 a game and was 28 of 34 from the line. ... Watson played three seasons with the Grizzlies from 2002-2005. ... Tyler Ulis and Marquese Chriss were the two Suns ejected during the fourth-quarter scuffle.\n\nGrizzlies: Memphis was without veterans Vince Carter (scheduled day of rest) and F Zach Randolph, who was out with left foot soreness. ... Memphis has recorded at least 10 3-pointers in 27 games, including 18 of last 26 games. ... Memphis matched its season high for turnovers with 22.\n\nBENDER SURGERY\n\nSuns rookie Dragan Bender had surgery Wednesday for a right ankle bone spur. The 19-year-old from Croatia was the fourth overall pick in last year's draft.\n\n\"It's tough. It's unfortunate,\" Watson said. \"But at the same time, he's 19. We don't want to rush him back. We want him to get healthy and come back and have a long career.\"\n\nAs for whether the injury is season-ending, Watson replied: \"Hopefully, he gets back before the season's over, but if it's not time, it's not time.\"\n\nNOT REALLY A FIGHT\n\nAsked about the late-game activity, Memphis coach David Fizdale said: \"These guys aren't fighting. There was a whole lot of huffing and puffing and pushing and shoving.\"\n\nLAST WORD\n\nUP NEXT\n\nSuns: Return home to face Chicago on Friday night.\n\nGrizzlies: Wrap up a three-game homestand on Friday night against Golden State.",
  "source": "espn_api",
  "crawled_at": 1764995587.283131
}