{
  "game_id": "0022200103",
  "espn_id": "401468258",
  "date": "Nov 01, 2022",
  "matchup": "CHI @ BKN",
  "headline": "LaVine has 20 in 4th, Bulls beat Nets in 1st game after Nash",
  "body": "NEW YORK -- — Zach LaVine scored 20 of his 29 points in the fourth quarter, leading the Chicago Bulls to a 108-99 victory over Brooklyn on Tuesday night in the Nets’ first game after a coaching change.\n\n\r\n              The Nets announced Steve Nash was out earlier in the day, then fell to 2-6 with Jacque Vaughn leading them.\n\n\r\n              Kevin Durant had 32 points and nine rebounds for the Nets, but Kyrie Irving managed only four points on 2-for-12 shooting. He missed all six 3-point attempts.\n\n\r\n              Vaughn stopped short of equating Irving’s struggles to the criticism he’s been dealing with since posting a link to a film with antisemitic content on his Twitter account last week.\n\n\r\n              “The message I told the guys after, no excuses,” Vaughn said. “Whether it’s back-to-backs, no excuses. Whether the change in scenery today, no excuses. This is what we do for a living. We signed up for it.”\n\n\r\n              Durant found out on television that Nash was removed after waking up from an afternoon nap. He said he was not approached by upper management about the decision.\n\n\r\n              “It was a roller coaster last few years, but the core of the basketball is something we all love to do,” Durant said. “Regardless of who is the coach, regardless the circumstances, you still got to come to work, and I enjoyed coming to work with Steve.”\n\n\r\n              DeMar DeRozan added 20 points and Ayo Dosunmu had 17 for the Bulls, who outscored the Nets 31-19 in the final quarter. Goran Dragic, who played last season with the Nets, chipped in 15 off the bench as the Bulls snapped a two-game losing streak.\n\n\r\n              Royce O’Neale matched his career high with 20 points and Nic Claxton had 10 points and 10 rebounds for the Nets, who played without Ben Simmons for a second straight night because of a sore left knee.\n\n\r\n              LaVine had nine points on 4-for-11 shooting from the field before he outscored the Nets in the final 12 minutes of the game, going 6 for 10 from the field.\n\n\r\n              “The thing that I thought was good for him is that he is finding his rhythm,” Bulls coach Billy Donovan said. “The one thing I give him a lot of credit for tonight, he made really quick, decisive decisions. It was catch and shoot. He didn’t hesitate, when they were there, he took them.”\n\n\r\n              The Bulls trailed 80-77 at the start of the fourth quarter before the All-Star guard heated up. The Nets still led 88-84 before Dosunmu sparked a 7-0 run with a 3-pointer opposite the Bulls bench to take a 91-88 lead.\n\n\r\n              Irving answered with a layup but LaVine responded with three straight baskets, including a 3-pointer that made it 99-90 with 5:37 left in regulation and put the game out of reach.\n\n\r\n              “We are all aggressive and sometimes you catch a rhythm,” said LaVine, who is managing his left knee after undergoing offseason surgery. “That’s all I am looking to do. It’s my fifth game back and catch a rhythm. I am feeling better each game.”\n\n\r\n              Durant scored 20 points on 4 for 6 from the field and hit 10 free throws to pace Brooklyn to a 58-52 lead at halftime.\n\n\r\n              The Nets struggled early and fell behind Chicago 15-7 midway through the first quarter. But Durant sparked a 20-10 run with 14 points of his own, including seven straight to put the Nets ahead 27-25 at the end of the period.\n\n\r\n              FAMILIAR POSITION\n\n\r\n              Vaughn formed part of former coach Kenny Atkinson’s staff in Brooklyn and replaced him as interim head coach on March 7, 2020. He coached the Nets to a 7-3 record before they were swept by the Toronto Raptors in the first round of the playoffs in the Walt Disney World bubble.\n\n\r\n              He was an assistant under Gregg Popovich with the San Antonio Spurs from 2010-12 and then got his first lead coaching position with the Orlando Magic in 2012. Under Vaughn, the Magic missed the playoffs the first two years before he was fired 52 games into his third and final season.\n\n\r\n              TIP-INS:\n\n\r\n              Bulls: Andre Drummond (shoulder contusion) did not play.\n\n\r\n              Nets: G Seth Curry (left ankle – injury management) did not play.\n\n\r\n              UP NEXT:\n\n\r\n              Bulls: Host the Charlotte Hornets on Wednesday night.\n\n\r\n              Nets: Visit the Washington Wizards on Friday night for the start of a three-game road trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994517.0456991
}