{
  "game_id": "401809246",
  "espn_id": "401809246",
  "date": "Oct 27, 2025",
  "matchup": "MIN vs DEN",
  "headline": "Murray scores 43 points, Jokic has triple-double as Nuggets beat Timberwolves 127-114",
  "body": "MINNEAPOLIS -- — Jamal Murray scored 23 of his 43 points in the third quarter and Nikola Jokic had a triple-double as the Denver Nuggets beat the short-handed Minnesota Timberwolves 127-114 on Monday night.\n\n\r\n              The Timberwolves played without star guard Anthony Edwards, who will miss at least a week with a strained right hamstring after he was injured in Sunday’s game against Indiana. Reserve guard Jaylen Clark also missed the game with left calf tightness.\n\n\r\n              Jokic finished with 25 points, 19 rebounds and 10 assists for his third triple-double in three games this season. He now has 167 career triple-doubles, third on the NBA's all-time list.\n\n\r\n              Murray made 16 of 29 shots and hit five 3-pointers for the Nuggets, who outscored the Timberwolves 45-29 in the third quarter to overcome an eight-point halftime deficit.\n\n\r\n              Tim Hardaway Jr. scored 20 points and Peyton Watson added 12 for Denver.\n\n\r\n              Jaden McDaniels led Minnesota with 25 points, while Julius Randle scored 24 and Naz Reid had 18.\n\n\r\n              Minnesota led 65-57 at halftime, but Murray opened the third quarter with five quick points on a jumper and a 3-pointer. His third 3 of the quarter put Denver on top 79-78. Hardaway hit a pair of 3s late in the quarter to stretch Denver's lead to 102-94 after three quarters.\n\n\r\n              The Timberwolves cut the lead to 104-101 but Watson answered with eight points in a 10-0 run including back-to-back corner 3s to restore the Nuggets' cushion.\n\n\r\n              The Nuggets lost all four of their regular-season games against Minnesota last year, but they clearly benefited from the absence of Edwards, who averaged 31.5 points per game against Denver last season.\n\n\r\n              Up next\r\n              Denver hosts New Orleans and the Timberwolves host the Lakers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042515.298949
}