{
  "game_id": "0021600629",
  "espn_id": "400900050",
  "date": "Jan 18, 2017",
  "matchup": "CHA vs. POR",
  "headline": "Walker, Hibbert lead Hornets past Blazers 107-85",
  "body": "CHARLOTTE, N.C. --  Kemba Walker is focused on Charlotte's record. He isn't very interested in the All-Star game right now.\n\nWalker scored 23 points, and the Hornets stopped a five-game slide with a 107-85 victory over the Portland Trail Blazers on Wednesday night.\n\n\"We haven't been doing a great job of winning consistently (so) the All-Star game is the last thing I'm going to think about right now,\" Walker said.\n\nWhile Walker is brushing off talk about next month's game in New Orleans, he is making a strong case for a spot on the Eastern Conference team. He is averaging 23 points and shooting 41.3 percent from 3-point range this season.\n\nWalker went 4 for 8 from behind the arc against Portland and 8 for 14 from the field overall. But he said he doesn't think he has done enough this year to make the All-Star game for the first time, citing the team's 21-21 record.\n\n\"Not really, if you ask me,\" Walker said. \"Especially because of where my team is. But like I said, I really don't care honestly.\"\n\nCoach Steve Clifford said Walker is playing at an All-Star level, but doesn't know if he will be selected.\n\n\"It's not a question of whether or not he's playing like an All-Star -- he's an All-Star-caliber guard, no question about it,\" Clifford said. \"The factors will be looking at the other point guards in the East. The East is loaded. Point guard is the best position in our league right now and also, a lot of other guys are playing on teams with better records than ours.  It's about winning.\"\n\nThe Hornets snapped an eight-game streak of allowing at least 100 points.\n\nCharlotte led 79-72 after three quarters but blew the game open in the fourth behind eight quick points from Frank Kaminsky. The reserve had all 11 of his points in the final quarter, including three 3-pointers.\n\nWalker had a big first half, hitting 6 of 9 shots and three 3-pointers to help the Hornets build a 54-46 lead.\n\nTIP-INS\n\nTrail Blazers: Made all 11 free throws, but shot 8 of 31 from beyond the 3-point arc.\n\nHornets: Bench outscored Portland's reserves 44-22.\n\nHIBBERT'S BIG NIGHT\n\nCharlotte center Roy Hibbert played what Clifford called the best game of his season.\n\nThe 7-foot-2 Hibbert, who came in averaging 5.2 points per game, had a season-high 16 points on 7-of-8 shooting and provided two of the game's biggest highlights.\n\nHe brought the crowd to its feet on a drop-step drive through the lane and an unexpected one-handed dunk over Meyers Leonard. A few minutes later, Hibbert threw a backdoor alley-oop pass intended for Kaminsky that inadvertently went in. Hibbert didn't even crack a smile as he jogged back down court.\n\n\"That was a helluva pass, shot -- I don't know what it was,\" Walker said with a laugh. \"I'm just glad it went in.\"\n\nHibbert, who has battled through knee issues this season, said he wasn't trying to score, but glad it went in.\n\n\"That was a bad pass and a bad shot, that's all I can say,\" Hibbert said.\n\nLOSING WAYS\n\nDamian Lillard scored 21 points and C.J. McCollum had 18 for Portland, which has lost three straight and 16 of 22 since Dec. 5.\n\n\"As a group we have to let last year go,\" Portland center Mason Plumlee said. \"If it was the first 10 games of the season we could talk about building on last year. This is a new team, this is a new group and we aren't playing how we did last year so it's a new season, new challenges. We have to make the most of this group and this team, and the situation we are in.\"\n\nTURNOVERS\n\nCharlotte turned 16 Portland turnovers into 21 points.\n\n\"We had some turnovers and they took advantage of every little thing,\" Lillard said. \"It seemed like they were getting what they wanted. They played a comfortable game and we didn't make them very uncomfortable.\"\n\nUP NEXT\n\nTrail Blazers: Travel to face the improving Philadelphia 76ers on Friday night.\n\nHornets: Back home on Friday night to host another high-scoring team in the Toronto Raptors.",
  "source": "espn_api",
  "crawled_at": 1764995506.6026042
}