{
  "game_id": "401810072",
  "espn_id": "401810072",
  "date": "Nov 12, 2025",
  "matchup": "MIA vs CLE",
  "headline": "Short-handed Cavs rally to beat Heat 130-116 behind Jarrett Allen's double-double",
  "body": "MIAMI -- — Jarrett Allen had 30 points and 10 rebounds, and the short-handed Cleveland Cavaliers stopped Miami's four-game win streak with a 130-116 victory over the Heat on Wednesday night.\n\n\r\n              De’Andre Hunter scored 21 points for the Cavaliers, who lost 140-138 in overtime at Miami on Monday. Lonzo Ball had 15 points and eight assists, and reserve Craig Porter Jr. finished with 19 points, nine assists and four blocks.\n\n\r\n              Cleveland improved to 15-7 when coming off a regular-season loss since coach Kenny Atkinson took over before last season.\n\n\r\n              Cavaliers guard Tyrese Proctor finished with 12 points on 4-for-15 shooting.\n\n\r\n              The Cavs scored 29 points off 21 Miami turnovers and turned a 14-point deficit in the third quarter into a 99-98 lead — their first of the game — with 10:03 left. Cleveland never trailed from there, outscoring the Heat 31-18 over the final 10 minutes.\n\n\r\n              Norman Powell scored 27 points for Miami, which dropped 1-7 in its last eight games against Cleveland. Davion Mitchell added 16 points.\n\n\r\n              Miami's Andrew Wiggins had 17 points, nine rebounds and six assists, but he also had five turnovers. Kel’el Ware added with 15 points and 13 rebounds. \n\n\r\n              Cleveland played without a trio of All-Stars; guard Darius Garland, who aggravated his surgically repaired left toe on Monday, guard Donovan Mitchell (rest) and forward Evan Mobley (rest). Miami was without Bam Adebayo (toe) and Tyler Herro (heel).\n\n\r\n              Miami led by as many as 12 in the second before Cleveland finished the quarter on a 15-4 run to pull within three at the half.\n\n\r\n              Up next\r\n              Cavaliers: Host Toronto on Thursday.\n\n\r\n              Heat: Visit New York on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042611.104865
}