{
  "game_id": "0022000864",
  "espn_id": "401307661",
  "date": "Apr 18, 2021",
  "matchup": "ORL vs. HOU",
  "headline": "Rockets rally past Magic 114-110, snap 5-game losing streak",
  "body": "ORLANDO, Fla. -- — Christian Wood scored 25 points, Kelly Olynyk added 24 and the Houston Rockets used a strong offensive showing in the third quarter to rally past the Orlando Magic 114-110 on Sunday night.\n\n\r\n                    Kevin Porter Jr. scored 22 and made four 3-pointers points before fouling out midway through the fourth quarter as the Rockets snapped a five-game losing streak and a five-game road skid. Armoni Brooks chipped in 16 points and another five 3-pointers for a Houston squad that shot 51.2% from the floor and hit 16 3-pointers.\n\n\r\n                    “We did a better job of executing, especially in the second half when we locked in,” said Wood, who added 10 rebounds for his 17th double-double of the season. “I told coach I wanted to close the game out, and my team trusted me to close the game. I feel like I did a great job of executing.”\n\n\r\n                    Down as many as 12 points late in the first half, Houston used an 18-2 burst in the third quarter to flip the game. Flat offensively in the early going, Houston made 55% of its shots and hit five 3-pointers in the third quarter to outscore Orlando 32-18 in the period.\n\n\r\n                    “I’m super proud of my team. We played eight guys, we only had one point guard, we had guys out of position and we hung in there,” Houston coach Stephen Silas said. “The third quarter was great. We finished the second quarter and then we carried that momentum into the third.”\n\n\r\n                    The Rockets took their biggest lead of the game 93-79 early in the fourth. From there, the Magic rallied to within 108-105 with a minute to play. However, Gary Harris lost the ball out of bounds on a hard drive to the rim, and Wood sealed the game with a floater in the lane. \n\n\r\n                    Cole Anthony hit a 3-pointer with 28 seconds to play, but Orlando couldn’t get any closer than two points down the stretch. Dwayne Bacon scored 22 points for Orlando, his fourth 20-point performance of the season. Anthony had 16 points and nine assists, while Harris added 16.\n\n\r\n                    “We played really solid for three quarters and gave ourselves a chance to win, and that’s even with that lackluster third quarter,” Anthony said. “It’s a game that we could have won and should have won.”\n\n\r\n                    The Rockets had a 43-36 rebounding edge and 14 second-chance points.\n\n\r\n                    “Avery Bradley was out there playing the point and (Jae-Sean Tate) was playing the point and Kelly Olynyk bringing the ball up,” Silas said. “Christian Wood did whatever we needed, whether it was the big blocked shot or a score at the end.” \n\n\r\n                    Orlando lost for the eighth time in 11 games. The Magic dropped their sixth straight game at home and haven’t won at the Amway Center since March 24.\n\n\r\n                    SEATS FOR SOLDIERS\n\n\r\n                    As part of their “Seats for Soldiers\" program, the Magic and L3Harris provided game tickets for 450 active and retired military personnel and their families. Participating military units in the ceremonies were the 6th Marines Corps District, Tampa; Army – Orlando; NTAG Jacksonville, Navy; MacDill Air Force Base; Cape Canaveral & Cutter Skipjack of the Coast Guard.\n\n\r\n                    As part of the on-court ceremonies, Magic players honored fallen soldiers by holding their jerseys with each soldier's name listed prior to the anthem. Each player then signed the jerseys so that they could be presented to families of the fallen soldiers.\n\n\r\n                    TIP INS\n\n\r\n                    Rockets: Houston coach Stephen Silas said standout point guard John Wall was held out on Sunday simply because of the back-to-back set of games. He said Wall will be back in the lineup on Monday in Miami. … Veteran guard Eric Gordon, who hasn’t played since March 11 because of a groin strain, did full-court conditioning work prior to tipoff.\n\n\r\n                    Magic: Orlando tied its franchise record by starting its 28th different lineup on Sunday. That equaled the 28 lineups used in the 1991-92 and 2012-13 seasons. … Point guard Cole Anthony celebrated his 20th birthday on Sunday. He entered the day tied for sixth in scoring, third in assists and ninth in rebounds among NBA rookies.\n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: At Miami on Monday night.\n\n\r\n                    Magic: At Atlanta on Tuesday night. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997575.458328
}