{
  "game_id": "0021400459",
  "espn_id": "400578751",
  "date": "Dec 29, 2014",
  "matchup": "MIL @ CHA",
  "headline": "Knight helps lead Bucks over Hornets 104-94 in OT",
  "body": "CHARLOTTE, N.C. --  After twice blowing leads in losses to the Charlotte Hornets earlier this season, Brandon Knight did his part to make sure it didn't happen again.\n\nKnight scored 18 points, including a layup to force overtime, and the Milwaukee Bucks pulled away in the extra period to beat the Hornets 104-94 on Monday.\n\nJared Dudley scored 17 points, Giannis Antetokounm had 16, Zaza Pachulia had 15, O.J. Mayo had 13 and John Henson added 11 for the Bucks (16-16), who snapped a seven-game losing streak to the Hornets dating back to the 2011-2012 season.\n\nIncluded in that streak were two close games this season -- a 108-106 overtime loss Oct. 29, and a 108-101 loss on Dec. 23 -- where Milwaukee held the lead, only to allow the Hornets (10-22) to come back.\n\n\"We just have to do better once we get up a lead like that,\" Knight said. \"Us players have to do a better job on the court, just being better in those situations. Not just playing to stay up 20, but playing to continue to win and make the right plays.\"\n\nMonday's game nearly became a repeat -- behind Kemba Walker's 28 points, Gerald Henderson's 19, Michael Kidd-Gilchrist's 10 -Charlotte fought back from a 21-point deficit in the first half.\n\nWalker's layup with 54.5 seconds remaining in the fourth quarter gave the Hornets an 83-81 lead, but Knight followed up his own blocked shot for a layup with 16 seconds left to tie the score and force overtime.\n\n\"We had a big lead offensively, but defensively we started to slip a little bit,\" Bucks coach Jason Kidd said. \"We got some great looks that just did not play out, but our guys just kept their composure.\"\n\nMilwaukee then pulled ahead for good on Henson's three-point play with 3:51 left in overtime, and the Bucks would lead by as many as 13 points in the extra period.\n\nCharlotte looked to be on its way to an easy victory over the Bucks early in the game, going up 14-6 on Henderson's 3-pointer with 7:29 remaining in the first quarter.\n\nBut the Hornets went cold, missing 16 straight shots. That allowed Milwaukee to close out the quarter with a 19-4 run, and take a 25-18 lead.\n\nCharlotte hit another cold spell, going 1 of 9 over the first six minutes of the second quarter, which allowed the Bucks to take their first double-digit lead. Milwaukee took its biggest lead, 43-22, on Knight's steal-and-layup with 3:19 remaining.\n\n\"We were missing shots, got our heads down and got a little frustrated out there,\" Walker said. \"We need to be more consistent in our play. One game we play well, the next we don't. That can't happen. We can't get away from the things we do well.\"\n\n---\n\nTIP-INS\n\nBucks: Won at Charlotte's Time Warner Cable Arena for the first time since March 23, 2012, losing four straight games before Monday's victory. . It was also the second time this season that Milwaukee won back-to-back road games, and the first since road wins over the Minnesota Timberwolves and Detroit Pistons on Nov. 26-28.\n\nHornets: Suffered their third straight loss, and second straight at home. . Overcame their poor first-half shooting to finish at 36.7 percent (33 of 90) from the field. But they were only 7 of 25 on 3-pointers. . They also had a season-high 13 steals.\n\nSTAT LINE\n\nThe Hornets shot just 20 percent (5 of 25) from the field in the first quarter, and 26.2 percent (11 of 42) for the half, while Milwaukee overcame a slow start to shoot 46.3 percent (19 of 41) and take a 49-32 halftime lead.\n\nSHORT-HANDED\n\nBoth teams dressed just 11 players each for Monday's game. The Hornets sat guards Lance Stephenson (pelvic sprain) and Jannero Pargo (sore back), and had assigned forwards Jeffery Taylor and Noah Vonleh to the NBA's D-League on Sunday. The Bucks were down four players, all for injuries -- forwards Jabari Parker (knee), Ersan Ilyasova (concussion) and Damien Inglis (knee), and center Larry Sanders (illness).\n\nUP NEXT\n\nMilwaukee plays at Cleveland on Wednesday.\n\nCharlotte travels to Houston on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764991807.357565
}