{
  "game_id": "0022400095",
  "espn_id": "401704661",
  "date": "Oct 26, 2024",
  "matchup": "PHX vs. DAL",
  "headline": "Kevin Durant scores 31, leading the Suns past the Mavericks 114-102",
  "body": "PHOENIX -- — Kevin Durant scored 31 points, Jusuf Nurkic added 18 points and 14 rebounds and the Phoenix Suns beat the Dallas Mavericks 114-102 on Saturday night.\n\n\r\n              The Suns never trailed after the first quarter, though the Mavericks kept the deficit in the single digits for much of the night. Luka Doncic scored 40 points and grabbed 10 rebounds while Kyrie Irving added 22 points.\n\n\r\n              The Suns led 91-80 heading into the fourth quarter and extended the lead to 105-90 six minutes later. Devin Booker added 21 points while rookie Ryan Dunn scored 13 in his first career start. Tyus Jones added seven assists.\n\n\r\n              The Suns led by as many as 13 in the first half but settled for a 63-55 lead at the break.\n\n\r\n              Takeaways\r\n              Mavericks: Doncic started hot with 23 points in the first half but cooled off after halftime. He shot 12 of 25 from the field, including 5 of 13 from 3-point range. Klay Thompson had 19 points, making five 3-pointers.\n\n\r\n              Suns: Phoenix bounced back after blowing a 22-point lead against the Lakers on Friday night. Guards Bradley Beal (elbow) and Grayson Allen (personal) didn't play. Dunn played well in his first career start and looks like he could have been a steal with the No. 28 pick. \n\n\r\n              Key moment\r\n              Dunn and Durant made back-to-back 3-pointers with about seven minutes left, extending the Suns' lead to 102-90. On the next possession, Durant made a layup while being fouled, converting the free throw to push the advantage to 105-90. The 9-0 run turned a tight game into a fairly comfortable win.\n\n\r\n              Key stat\r\n              The Mavericks shot 39.8% from the field and the bench scored just nine points.\n\n\r\n              Up next\r\n              The Suns play the Lakers for the second time in four days, hosting them on Monday night. The Mavs return home to host the Jazz on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998337.501591
}