{
  "game_id": "0021800004",
  "espn_id": "401070694",
  "date": "Oct 17, 2018",
  "matchup": "DET vs. BKN",
  "headline": "Casey wins debut with Pistons, 103-100 over Nets",
  "body": "DETROIT --  It took the Detroit Pistons over three minutes to score in their first game under new coach Dwane Casey. Then at the end, they committed two straight shot-clock violations while trying to close out the victory.\n\nAfter all that, the Pistons won anyway.\n\n\"We'll take it,\" Casey said. \"In this league, you've got to celebrate the wins. I've said it all along. We've got to have fun. We can't have the gloom-and-doom situations. There's going to be adversity in the NBA.\"\n\nAndre Drummond had 24 points and 20 rebounds, and Detroit won its opener under Casey, 103-100 over the Brooklyn Nets on Wednesday night. Blake Griffin added 26 points for the Pistons, who were without two potential starters but still managed to hold off Brooklyn.\n\nCaris LeVert equaled a career high with 27 points for the Nets, and he drove to the basket in the final seconds with Brooklyn down one. LeVert lost the ball, and it went out of bounds to Detroit.\n\n\"There were too many bodies in the lane, and I should have backed it out and got us a better look,\" LeVert said. \"I needed to slow down, but I gave them a chance to knock the ball away.\"\n\nReggie Jackson made two free throws for the Pistons with 6.2 seconds remaining, and Joe Harris missed a 3-pointer from near the top of the key at the other end.\n\nThe Pistons hired Casey this offseason after moving on from Stan Van Gundy, and his debut began inauspiciously. The Nets scored the game's first eight points, and Brooklyn's Jarrett Allen made an impressive defensive play early when he blocked Griffin's dunk attempt. The Nets led by as many as 12 points in the first quarter, but it was tied at 51 at halftime.\n\n\"That first quarter was scary,\" Drummond said. \"You know, had first-game jitters. ... We were a little all over the place in the beginning.\"\n\nDetroit opened a 13-point lead in the third quarter, but then it was Brooklyn's turn to rally. The Pistons led 101-96 when Spencer Dinwiddie went to the line for the Nets. Dinwiddie made a free throw but missed the second. Brooklyn came up with the rebound, and Harris made a 3-pointer to cut the deficit to one.\n\nThe Pistons then committed a shot clock violation, but Allen missed at the other end. After another shot clock violation, LeVert tried his drive toward the basket but came up empty.\n\nThe Pistons were without Stanley Johnson (toe) and Reggie Bullock (illness). Brooklyn was not at full strength, either. Rondae Hollis-Jefferson was out because of a left adductor injury.\n\nThe Nets lost their sixth straight season opener.\n\nTRIBUTE\n\nThe Pistons honored Aretha Franklin before the game by playing a recording of her singing the national anthem. Former Pistons star Isiah Thomas spoke briefly, asking for a moment of silence for Franklin, who died in August. After the moment of silence, and with no additional announcement, a recording of Franklin singing the anthem at the 2004 NBA Finals began playing while pictures scrolled on the scoreboard screen.\n\nA microphone was left unattended at midcourt while the anthem played.\n\nTOUGH STRETCH\n\nDetroit went on a 20-4 run in the third quarter and led 73-60 after a 3-pointer by Jackson.\n\n\"I thought the third quarter, that's where we kind of lost it,\" Nets coach Kenny Atkinson said. \"We turned the ball over a bunch, they got out and ran, and that's where they got their separation.\"\n\nTIP-INS\n\nNets: Brooklyn was also without DeMarre Carroll (right ankle), Allen Crabbe (left ankle), Shabazz Napier (right hamstring) and Alan Williams (left ankle). ... Dinwiddie had 23 points.\n\nPistons: Jackson scored 19 points. ... Drummond made a 3-pointer , the sixth of his career.\n\nUP NEXT\n\nNets: Host New York on Friday night.\n\nPistons: At Chicago on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994726.054393
}