{
  "game_id": "0022100072",
  "espn_id": "401359896",
  "date": "Oct 29, 2021",
  "matchup": "IND @ BKN",
  "headline": "Aldridge reaches 20,000 points, Nets beat Pacers 105-98",
  "body": "NEW YORK -- — LaMarcus Aldridge scored 17 of his 21 points in the second half, reaching 20,000 for his career, to lead the Brooklyn Nets to a 105-98 victory over the Indiana Pacers on Friday night. \n\n\r\n                    James Harden broke out of an early season slump with 29 points and Kevin Durant added 22 as the Nets evened their record at 3-3.\n\n\r\n                    “Solid win,” Durant said, later adding the Nets “did a good job of fighting back.”\n\n\r\n                    Aldridge became the 48th player in league history and the seventh active player to score 20,000 points.\n\n\r\n                    “He has scorer's instincts,” Durant said. “(It's a) huge accomplishment. ...(A) huge milestone.”\n\n\r\n                    Indiana dropped to 1-5 overall and 0-4 on the road despite 28 points from Torrey Craig. Chris Duarte added 19, Domantas Sabonis contributed 16 and Jeremy Lamb chipped in with 12.\n\n\r\n                    “We've just got to stay in the fight,\" Pacers coach Rick Carlisle said. “We have plenty to win games right now. We're just going to have to be very much on point. The margins are very slim and we're (going) to have to stick together and play together.\" \n\n\r\n                    The Nets started slowly against a Pacers team that was playing without Isaiah Jackson (hyperextended right knee) and former Net Caris LeVert (stress fracture in his lower back) and trailed by 16 after Craig knocked down an 11-foot jumper with 9:17 left in the second quarter. But Brooklyn finished the quarter with a 28-9 run to lead 58-55 at halftime. Harden scored 13 points in that stretch.\n\n\r\n                    By the end of the third quarter, the advantage was stretched to 85-74, with Durant playing with a key role. Even though he only scored four points in the third, he grabbed six rebounds and handed out four assists, as well as seemingly being everywhere on the court. The beneficiary was Aldridge, who scored eight points on mostly mid-range jumpers.\n\n\r\n                    “I was trying to make some stuff happen,” Durant said.\n\n\r\n                    And yet, the Nets found themselves unable to pull away from the depleted Pacers, who drew even at 90-all after Sabonis made a free throw with 5:15 left the fourth. That was as close as Indiana would get, as Brooklyn’s triumvirate of stars would either score on assist on the Nets’ final 15 points.\n\n\r\n                    “All you can ask is for us to give ourselves a chance to win,” Craig said. “I think we did that tonight. I think we competed for most of the game.” \n\n\r\n                    TIP-INS:\n\n\r\n                    Pacers: The question posed to Carlisle in his pregame media availability was simple and straightforward: How do you defend Durant? His answer: “Any time he touches (the ball) over half court he’s a threat to score,” Carlisle said. “And so limiting touches is on everybody’s high numbers wish list. (But it’s) very difficult to do because he’s 7 feet tall and you just throw it up there. He’s got amazing ball skills. So (we) want to make it as difficult as possible for him to get to his spots, (and make it difficult for) him to get tin rhythm all the time and things like that. Very difficult job.” \n\n\r\n                    Nets: The Nets were among the preseason favorites to win the NBA championship but coach Steve Nash says his team is a work in progress. “It’s a process for us,” Nash said. “We lose Kyrie (Irving), and as guys are trying to work their way into shape and 10 new guys, it’s different. There’s a period of learning to play together and learning our best path towards scoring the ball effectively and efficiently is a process. It’s going to take us some time. So it’s not comparable to the prior look in many ways. We have to work at it and figure out how we can learn to play together in a really efficient and cohesive way.”\n\n\r\n                    UP NEXT:\n\n\r\n                    Pacers: Host Toronto Saturday night.\n\n\r\n                    Nets: Continue six-game homestead by hosting Detroit on Sunday.\n\n\r\n                    ------\n\n\r\n                    MORE AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993057.705395
}