{
  "game_id": "0022000498",
  "espn_id": "401267658",
  "date": "Feb 25, 2021",
  "matchup": "PHI vs. DAL",
  "headline": "All-Stars Embiid, Simmons lead 76ers past Dallas 111-97",
  "body": "PHILADELPHIA -- — Ben Simmons clapped for his teammates and laughed with Joel Embiid as the 76ers' reserves put the finishing touches on a rout.\n\n\r\n                    The All-Stars had long done their part to keep Philly rolling atop the East.\n\n\r\n                    Embiid had 23 points and nine rebounds, Simmons scored 15 points and the Philadelphia 76ers beat the Dallas Mavericks 111-97 on Thursday night.\n\n\r\n                    “Ben set the tone. Joel was phenomenal,” coach Doc Rivers said.\n\n\r\n                    Simmons and Embiid wrecked the Mavericks in the second quarter, and with each steal, dunk and drive showed why they were again selected as All-Stars and have led the Sixers to the best record (22-11) in the Eastern Conference.\n\n\r\n                    Luka Doncic scored 19 points for the Mavericks. The Mavericks committed 22 turnovers and shot 41% from the floor.\n\n\r\n                    The Sixers could soon have fans inside the Wells Fargo Center and the select few who get to watch will get a live look at perhaps the most dominant duo in the East outside of Brooklyn.\n\n\r\n                    Simmons and Embiid made 8 of 12 shots in the second quarter and combined for 22 points to help the Sixers turn this one into a rout. Simmons backed down Doncic, put a spin move on the big man and hit a pretty one-handed reverse under the bucket and drew a foul. He sank it for a 12-point lead. Simmons later sneaked behind Willie Cauley-Stein and stole the ball, threw a bounce pass just past midcourt and hit a streaking Embiid for a thunderous two-handed dunk.\n\n\r\n                    Simmons continued to make his case as a defensive player of the year and cut off the pick-and roll that limited Doncic to 3-of-9 shooting in the first half.\n\n\r\n                    “I was just being me. Doing what I do,” Simmons said. “I like taking those challenges. Just tell me who to guard.”\n\n\r\n                    Doncic, who averaged 28.9 points and has carried the Mavericks, brushed off Simmons' often-smothering defense.\n\n\r\n                    “I don’t really pay attention to who’s on me. I’m just trying to play my game,” Doncic said. \"Sometimes I’m going to play better, sometimes worse.\n\n\r\n                    Embiid did all of his damage in the second quarter — he missed 15 of 20 shots overall from the floor — but made 11 of 12 free throws.\n\n\r\n                    “At certain times, they both had their way,\" Mavericks coach Rick Carlisle said. “We just weren’t consistent enough. There were times we contained Simmons well and other times we let him go right by us. We did some good things against Embiid early. We had him a little bit off balance and then he got into more of a groove in the second quarter.”\n\n\r\n                    Rivers coached against Simmons and Embiid during his stint with the Los Angeles Clippers and has enjoyed having them on his side. Embiid has worked his way into MVP contention and is having a career year, coming into the game averaging 29.8 points.\n\n\r\n                    “It’s funny, you know he’s big, but you don’t realize how big he is and then his post game is so much more efficient than I remember it,” Rivers said. “We were bothered by his post game, but I never knew it was that efficient.”\n\n\r\n                    Simmons has about perfected what he does best, playing elite defense, scoring around the rim and hitting an improved crop of shooters for open looks (and yes, he still won’t shoot the 3).\n\n\r\n                    “It’s very few guys that can play at the speed that he plays at downhill and transition, and then make bullet passes on target,” Rivers said. “I haven’t seen that, Jason Kidd actually comes to mind a little bit, but there’s very few players have been able to do both.” \n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Kristaps Porzingis, involved in heavy trade rumors, missed his third straight game with back tightness. ... Made only 13 of 34 3-pointers.\n\n\r\n                    76ers: Tobias Harris, who averaged 20.7 points, went to the locker room in the third quarter with a bruised right knee and did not return. There was no postgame update on the severity of his injury. ... Seth Curry scored 15 points after he sat out Tuesday’s win against Toronto with a sore ankle.\n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: Play Saturday in Brooklyn.\n\n\r\n                    76ers: Host Cleveland on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997094.994835
}