{
  "game_id": "0022300004",
  "espn_id": "401584092",
  "date": "Nov 03, 2023",
  "matchup": "CHI vs. BKN",
  "headline": "Finney-Smith scores 21 points, Mikal Bridges adds 20 in Nets' 109-107 victory over Bulls",
  "body": "CHICAGO -- — Whether the new In-Season Tournament gives early regular-season games like this a little extra meaning, Brooklyn's Dorian Finney-Smith was sure of a few things.\n\n\r\n              He'll take the win, and the bright red court was “cute.”\n\n\r\n              Finney-Smith scored 21 points, Mikal Bridges added 20 and Brooklyn beat the Chicago Bulls 109-107 on Friday night in their tournament opener.\n\n\r\n              Cam Thomas added 17 points, and the Nets came away with the victory when Zach LaVine’s long jumper for the Bulls at the buzzer hit the rim.\n\n\r\n              “We're not one of those teams that can wait around and try to pick it up later in the year,\" Finney-Smith said. “We need every win we can get. ... The court was cute. It was nice. We won so I felt like it was good. If we would have lost, it would have been because of the court.”\n\n\r\n              Finney-Smith nailed five 3-pointers. Bridges and Thomas made three each from beyond the arc, and the Nets won their third in a row after opening 0-2.\n\n\r\n              DeMar DeRozan and Zach LaVine each scored 24 points for Chicago. Coby White added 18 points, and Nikola Vucevic had 13 points and 13 rebounds.\n\n\r\n              “I thought for the most part the execution was pretty good coming down the stretch,” coach Billy Donovan said. “We just didn't get stops down the stretch at all. They scored more baskets than we did, and we had a couple of empty possessions. But overall, it wasn't bad.”\n\n\r\n              The court was painted red as part of the league's effort to attract channel surfers' attention in this tournament. The way this one unfolded was probably enough to keep viewers tuned in.\n\n\r\n              In a game where neither team led by more than 10, the Nets were up 108-104 with 1:13 remaining after Bridges dunked. \n\n\r\n              LaVine answered with a floater, and Brooklyn committed a shot-clock violation with 38 seconds remaining.\n\n\r\n              LaVine missed a pull-up jumper. The Bulls got the rebound and, after a timeout, LaVine missed a wild driving layup.\n\n\r\n              Bridges got fouled with 12 seconds remaining and hit the first free throw to make it 109-106. But he missed the second.\n\n\r\n              The Bulls got the rebound and called time to advance the ball to midcourt. LaVine got fouled with 4.9 seconds left and made the first free throw before missing the second. He then came away with the ball following a scramble, but his long jumper hit the rim as time expired.\n\n\r\n              Spencer Dinwiddie had 10 points and nine assists for Brooklyn after missing a game because of a sprained left ankle. Ben Simmons added six assists and 10 rebounds, and the Nets completed a 3-1 trip.\n\n\r\n              “I don't think we kind of realize how big of a road trip that was — to go 3-1, win three straight and stay together, especially on the road,” Bridges said. “We're not like a dynasty team that's been together for all these years. You can't take any win for granted.”\n\n\r\n              Chicago guard Ayo Dosunmu missed the game because of an upper respiratory illness. Donovan said he would not travel to Denver for Saturday's game.\n\n\r\n              Nets center Nic Claxton missed his third in a row because of a sprained left ankle and likely won't play at Boston on Saturday.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Boston on Nov. 10 in next In-Season Tournament game. At Boston on Saturday night in regular game.\n\n\r\n              Bulls: Host Orlando on Nov. 17 in next In-Season Tournament game. At Denver on Saturday night in regular game. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995922.1117702
}