{
  "game_id": "0021400957",
  "espn_id": "400579249",
  "date": "Mar 11, 2015",
  "matchup": "OKC vs. LAC",
  "headline": "Chris Paul has 33, outplays Russ Westbrook, as Clips down Thunder",
  "body": "OKLAHOMA CITY -- The superstar point guard trying to lead a team without its high-scoring forward had his way Wednesday night.\nOnly this time, it wasn't Russell Westbrook. It was Chris Paul.\nPaul had 33 points and nine assists, J.J. Redick added 25 points and the Los Angeles Clippers beat Oklahoma City 120-108, ending the Thunder's seven-game home winning streak.\nDeAndre Jordan had 18 points and 17 rebounds for the Clippers, who are fighting for a top-four seed in the Western Conference playoffs. Oklahoma City is battling to merely make the field and fell a half-game behind the New Orleans Pelicans in the race for the final playoff spot.\n\nBoth teams are playing for extended stretches without their standout forwards: Kevin Durant for the Thunder, Blake Griffin for the Clippers. In their absence, Paul fared better than his All-Star counterpart.\nWestbrook, who had recorded triple-doubles in five of Oklahoma City's previous six games, finished with 24 points, nine rebounds, seven assists and a career-high 10 turnovers.\n\"He's human, I guess, so he struggled a little bit, which was great,\" Los Angeles coach Doc Rivers said.\nThen he praised Paul.\n\"He's competitive, so you want to play well in the matchup. You want to always win your matchup. But I think he wants to win the game,\" Rivers said.\n\"Everyone else talks about all that other stuff. I think CP came into the game thinking, `Let's beat Oklahoma' and I think that's why he played well.\"\nAnthony Morrow came off the bench to score 26 points for the Thunder, who could get Durant back from a foot injury in a week or two, coach Scott Brooks said before the game.\nLos Angeles went 15 of 30 from behind the arc and controlled the game throughout. Paul went 5 of 8 from 3-point range while Matt Barnes scored 22 points on 6-of-7 shooting on 3s.\n\"All over the floor defensively, we struggled tonight,\" Brooks said. \"They played a great basketball game. Chris Paul, I thought he had the game under control. . They had their way. The ball was playing with a lot of freedom tonight.\"\nThe Clippers jumped to a 28-11 lead, but Morrow led a comeback with five first-half 3-pointers. Oklahoma City tied it at 47 midway through the second quarter, but Paul hit a pair of 3-pointers in the next two minutes as Los Angeles re-established control.\nThe Clippers pushed their lead to 86-66 with 6:53 left in the third quarter on a 3-pointer by Paul. The advantage eventually peaked at 22 points. Oklahoma City came no closer than 13 points the rest of the way.\nTIP-INS\nClippers: Going for a loose ball in the closing seconds of the first half, Paul dived into Kevin Durant's brother, Tony Durant, who was sitting in a courtside seat. Tony Durant shook his right leg as if he were in pain, but was able to walk around at halftime ... Jordan went 5 of 6 from the foul line in the first half after entering the game shooting 40.1 percent for the season. He finished the game 12 of 22 ... Paul's 20 first-half points were a season high.\nThunder: For a time in the second quarter, the Thunder experimented with a two-center lineup, playing Kanter and Steven Adams together for the first time to bolster their interior defense. Kanter remained as the starter at the position and scored 18 points ... Morrow went 6 of 9 from 3-point range, setting a season high for made 3s ... After taking a hard foul from Barnes midway through the first quarter, Westbrook threw down the protective mask he's worn over his face since undergoing surgery for a fractured cheek bone.\nSTAR UPDATES\nBrooks said Durant was re-evaluated Wednesday and that while the 2014 NBA MVP \"is progressing\" and \"had another good workout day today,\" he isn't ready to return to the lineup. Durant has missed 37 games with an assortment of foot and ankle injuries and hasn't played since Feb. 19. He had surgery Feb. 22 to replace a screw that was causing discomfort in the right foot that he broke during the preseason.\nRivers hinted that Griffin is \"very close\" to returning but wouldn't be more specific than that. Griffin last played on Feb. 6, after which he underwent surgery to remove a staph infection from his elbow. He did not travel with the Clippers to Oklahoma City, which is his hometown.\nUP NEXT\nClippers: Visit Dallas on Friday.\nThunder: Host Minnesota on Friday.",
  "source": "espn_api",
  "crawled_at": 1764991882.77573
}