{
  "game_id": "0022400737",
  "espn_id": "401705303",
  "date": "Feb 07, 2025",
  "matchup": "BKN vs. MIA",
  "headline": "Heat held to 9 points in fourth quarter of first game since trading Butler and lose 102-86 to Nets",
  "body": "NEW YORK -- — Cam Johnson scored 18 points, D'Angelo Russell had 17 and the Brooklyn Nets limited Miami to nine points in the fourth quarter of its first game since trading Jimmy Butler, beating the Heat 102-86 on Friday night.\n\n\r\n              Miami shot 2 for 21 (9.5%) in the fourth quarter and was outscored 31-9 after leading by six through three quarters. \n\n\r\n              The Heat didn't have Andrew Wiggins, Kyle Anderson or Davion Mitchell, the three players they acquired in what became a five-team deal when they sent Butler to the Golden State Warriors. Terry Rozier scored 20 points off the bench for the Heat and Bam Adebayo added 18.\n\n\r\n              Nic Claxton had 12 points, 10 rebounds and four blocks for Brooklyn.\n\n\r\n              Ben Simmons wasn't with the Nets as the No. 1 pick in the 2016 draft and the organization work on a contract buyout.\n\n\r\n              Takeaways\r\n              Heat: Butler was a longtime closer for the Heat before they suspended him multiple times this season. Someone may inherit that role, but nobody was up to the task Friday. All-Star Tyler Herro shot 6 for 22.\n\n\r\n              Nets: Brooklyn has won four of five, continuing to fight hard with a star-less roster. \n\n\r\n              Key moment\r\n              Jaime Jaquez Jr. scored on Miami's first shot of the fourth quarter to make it 79-71 14 seconds into the period. The Heat wouldn't make another basket until Rozier's 3-pointer with 7:02 to play and were shut out from the field from there. \n\n\r\n              Key stat\r\n              The Nets outrebounded the Heat 57-39.\n\n\r\n              Up next\r\n              The Heat host Boston on Monday in their only home game in a nine-game span. The Nets host Charlotte on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997979.478315
}