{
  "game_id": "0022301188",
  "espn_id": "401585816",
  "date": "Apr 14, 2024",
  "matchup": "ATL @ IND",
  "headline": "Myles Turner scores 31, Pacers avoid play-in tournament with 157-115 rout of Hawks",
  "body": "INDIANAPOLIS -- — Myles Turner had 31 points and Pascal Siakam scored 28 as the Indiana Pacers beat the Atlanta Hawks 157-115 on Sunday and avoided falling into the play-in tournament.\n\n\r\n              Indiana, in the playoffs for the first time since 2020, secured the No. 6 seed in the Eastern Conference and faces third-seeded Milwaukee in a best-of-seven first-round series.\n\n\r\n              “I’m proud of this group,” said Turner, who added 12 rebounds and four blocked shots. “It wasn’t easy. It wasn’t pretty, but we got to where we needed to go. It’s been a long four years.”\n\n\r\n              Dejounte Murray scored 32 points for the Hawks, who finished the regular season 10th in the East at 36-46 and visit the ninth-placed Chicago Bulls on Wednesday to open the play-in tournament.\n\n\r\n              “The way (the Pacers) play is hard to simulate,” Atlanta coach Quin Snyder said. “You’re disappointed when you end the season like this, but the season isn’t over. You move forward immediately because we play Chicago on Wednesday.”\n\n\r\n              The Pacers went 4-1 against the Bucks in the regular season, including a 128-119 win over Giannis Antetokounmpo and company in Las Vegas on Dec. 7 at the semifinals of the In-Season Tournament.\n\n\r\n              “This organization is not an organization just happy to be in the playoffs,” Indiana coach Rick Carlisle said. “That’s not what this is about. This is not small-market, lowered expectations. We can’t have that.”\n\n\r\n              Pacers All-Star Tyrese Haliburton, who grew up in Wisconsin north of Milwaukee, will be playing in the postseason for the first time.\n\n\r\n              “I’m just really excited,” said Haliburton, who had 12 points and 13 assists on Sunday. “We all grow up watching the playoffs. It’ll be fun. (Milwaukee) is a really good team. We’ve had some battles this year. It’s home for me. Kind of storybook to be playing at the crib my first playoff series.”\n\n\r\n              The Pacers enter with momentum from a dominant regular-season finale. They shot 65% and made 19 of 36 3-pointers. The 157 points matched the Pacers’ highest-scoring game since they joined the NBA in 1976. The record was set earlier this season in their 157-152 win in the In-Season Tournament on Nov. 21.\n\n\r\n              Mouhamed Gueye added 19 points and Bogdan Bogdanovic 18 for the Hawks, who trailed 125-93 at the end of the third quarter and never threatened in the fourth.\n\n\r\n              All-Star Tyrese Haliburton, in the playoffs for the first time in his career, finished with 12 points and 13 assists.\n\n\r\n              The Pacers last advanced into the playoffs in 2020. They finished 11th in the East a year ago, five games out of the final play-in spot. They missed the 2022 playoffs and lost to Washington in the 2021 play-in tournament.\n\n\r\n              Indiana went into intermission leading 86-72. That tied the Pacers’ highest-scoring half. They also scored 86 points in a first half on Nov. 6 against San Antonio and on Jan. 15, 1990, against Golden State.\n\n\r\n              Turner helped the Pacers set the tone from the start. They raced out to an 8-0 lead, with six points from Turner, and held the Hawks scoreless on their first five possessions.\n\n\r\n              Atlanta held out starting center Clint Capela for rest. Three other rotation players who average a combined 39.9 points, Jalen Johnson (sprained ankle), Saddiq Bey (torn knee ligament) and Onyeka Okongwu (sprained toe), sat out due to injury.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Visit the ninth-placed Chicago Bulls on Wednesday in the play-in tournament.\n\n\r\n              Pacers: Open the playoffs as either the No. 5 or 6 seed.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996256.468699
}