{
  "game_id": "0021800718",
  "espn_id": "401071391",
  "date": "Jan 24, 2019",
  "matchup": "PHX vs. POR",
  "headline": "Lillard leads Trail Blazers to 120-106 win over Suns",
  "body": "PHOENIX --  It took a while, but the Portland Trail Blazers finally did what they were supposed to do with the depleted Phoenix Suns.\n\nDamian Lillard scored 24 points, CJ McCollum and Jake Layman added 20 apiece and the Trail Blazers pulled away in the second half to hand the Suns their sixth straight loss, 120-106 on Thursday night.\n\nThe Trail Blazers beat Phoenix for the ninth straight time. Portland has won four of five and eight of 11 overall.\n\n\"First half was frustrating,\" Blazers coach Terry Stotts said. \"We missed a lot of shots at the rim early on. We gave up too many transition points in the first quarter. We played much better in the second half, obviously.\"\n\nSeth Curry had 17 points and Jusuf Nurkic 16 for Portland.\n\nDevin Booker scored 27 for the Suns but only nine after the first quarter. Kelly Oubre Jr. added 18 on 6-of-18 shooting. Dragan Bender, forced into the starting center role due to injuries, had 17.\n\nThe Suns were without rookie center Deandre Ayton (sprained left ankle) and backup Richaun Holmes (right foot sprain) for the third straight game. T.J. Warren also sat out with a sore right ankle, and Suns starting point guard De'Anthony Melton left in the third quarter with a sprained right ankle.\n\nWhat was left of the Suns stayed with the Blazers through the first half and much of the second.\n\nBooker shot 6 of 9, including 2 of 4 on 3-pointers, in his 18-point first quarter and the Suns led 31-30 after one. With McCollum on the bench with three fouls, Phoenix stretched the lead to 47-41 on Josh Jackson's coast-to-coast drive with 5:52 left in the half.\n\nPortland, though, responded with a 12-1 run to go up 54-48 on Lillard's two free throws with 1:17 remaining. Booker sank four free throws, his only points of the second quarter, and the Trail Blazers led 56-52 at the break.\n\nElie Okobo made a pair of 3s in a 14-1 spurt that cut the Blazers' lead to 73-72 with 4:21 left in the third quarter, but Portland finished the period on a 15-4 run.\n\nLayman scored twice and Lillard sank three free throws -- one on a technical against Jackson -- as the Blazers scored the last seven points of the quarter to take an 88-76 lead entering the fourth.\n\n\"Offense got a little stagnant, stopped moving the ball as much and they just got hot,\" Jackson said.\n\nThe Blazers opened the final quarter with a 12-4 surge and Phoenix never challenged again.\n\n\"I think we missed a lot of shots in the paint in the first half,\" Lillard said. \"We were getting good shots but missing those shots. We turned the ball over. ... I think in the second half we were much sharper, making them throw the ball away. We executed better offensively and that's part of being a good team.\"\n\nLILLARD VS. BOOKER\n\nSuns coach Igor Kokoskov praised the overall play of Lillard.\n\n\"He's a very, very good player,\" Kokoskov said. \"So he doesn't have to score 60 points to impact the game.\"\n\nHe was asked if someday Booker's game will be as good.\n\n\"I would say in about seven years he's going to be an even better player than Damian,\" Kokoskov said. \"No disrespect to Damian, I love his game. It's a process.\"\n\nLillard is 27 years old and a six-year NBA veteran. Booker is 22 in his fourth season.\n\nTIP-INS\n\nTrail Blazers: Lillard has 1,311 points this season, the most by any Portland player through 50 games. Kiki Vandeweghe scored 1,294 points in the first 50 games of the 1986-87 season. ... Lillard played despite a bruised right hand. ... Portland last lost to Phoenix on Nov. 2, 2016. ... Nurkic was 1-of-8 shooting in the first half.\n\nSuns: Holmes said he thought he'd be able to play Wednesday night at Denver. ... The Phoenix City Council voted Tuesday in favor of a $235 million renovation of Talking Stick Resort Arena. ... The Blazers outscored the Suns 34-9 in the first quarter of their first meeting this season. ... Phoenix has lost 13 of its last 16 against Portland. ... Oubre has scored in double figures a career-best nine straight games.\n\nUP NEXT\n\nTrail Blazers: Host the Atlanta Hawks on Saturday night.\n\nSuns: At the Denver Nuggets on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995121.174217
}