{
  "game_id": "0021500774",
  "espn_id": "400828661",
  "date": "Feb 08, 2016",
  "matchup": "CHA vs. CHI",
  "headline": "Walker scores 30 as Hornets beat Bulls, 108-91",
  "body": "CHARLOTTE, N.C. -- The Charlotte Hornets are finally close to being 100 percent healthy again, and are working their way back into the Eastern Conference playoff picture.\nKemba Walker scored 30 points as the Hornets led from the start and bet the Chicago Bulls 108-91 on Monday night.\nCharlotte (25-25) reached the .500 mark for the first time since it was 17-17 on Jan. 4 in the midst of losing seven straight and nine out of 10.\nThe Hornets' latest win was their second straight and fourth in the past five games, and left them just a half-game behind eighth-place Detroit in the Eastern Conference standings.\n\"To be back at .500 a game before the All-Star break, that shows where we are,\" said Charlotte guard Nicolas Batum, who had 19 points and 13 rebounds. \"We've had a lot of injuries and stuff like that . but guys kept fighting and never gave up. We've been through a lot, but we're still almost there.\"\n\nMichael Kidd-Gilchrist added 20 points and Spencer Hawes scored 13 for Charlotte, which led by as many as 25 points in handing the Bulls their third straight loss.\nPau Gasol finished with 22 points and 10 rebounds for Chicago, which was missing three of its leading scorers to injuries: Derrick Rose, Jimmy Butler and Nikola Mirotic.\n\"We have to put this trip behind us,\" Bulls coach Fred Hoiberg said. \"It was a long, grinding trip -- four games in six days in four different time zones. It took a toll on our guys.\"\nThe Hornets led by as many as 22 points in the first half en route to a 57-42 lead, and pulled ahead 78-53 with 3:42 left in the third quarter on two free throws by Kidd-Gilchrist.\nChicago managed to cut Charlotte's lead to 90-78 on McDermott's 3-pointer with 6:53 left in the fourth quarter. But the Hornets responded with an 8-2 run, and led by at least 13 points the rest of the game.\nChicago shot just 35 percent (16 of 46) over the first two quarters, allowing Charlotte to build a double-digit lead early. The Hornets hit seven of their first nine shots to go up 17-6 on Batum's 3-pointer with 7:07 left.\n\"We wanted to get off to a fast start -- as fast as possible,\" said Walker, who also had eight assists and seven rebounds. \"We didn't necessarily build a huge lead, but play with energy and intensity from the start of the game.\"\nCharlotte extended its lead to 38-20 by the end of the period, and pull ahead by 22 points twice in the second quarter -- the last at 46-24 on two free throws by Hawes with 7:04 remaining.\nChicago pulled to 50-36 on Kirk Hinrich's 3 with 3:55 left. The Bulls then closed out the half down 15 thanks to Gasol's buzzer-beating 3-pointer.\n\"They were a little short-handed, and our play was spotty,\" Charlotte coach Steve Clifford said. \"But our starters played really well to start the game and the third quarter, and then to finish it.\"\nTIP-INS\nBulls: Doug McDermott had 14 points, E'Twaun Moore 12 and Taj Gibson 11. ... Chicago forced Charlotte into 13 turnovers, but only managed six points off them. . While outscoring the Hornets 36-28 in the paint, the Bulls were outrebounded 56-41.\nHornets: Batum nearly had a triple-double for the second straight game, finishing with eight assists. ... Hawes finished in double figures off the bench for the second straight game.\nINJURY REPORT\nThe Bulls dressed just 11 players for Monday's game, with Rose a late scratch because of soreness. Butler missed his third straight game with a left knee strain, and Mirotic his seventh straight after undergoing surgery to remove his appendix on Jan. 25. Chicago is also missing Joakim Noah, out for the season after undergoing surgery on a separated shoulder.\nThe only Hornets player out of the lineup was C Al Jefferson, who is back doing non-contact and conditioning drills after undergoing arthroscopic surgery on his right knee.\nBY THE NUMBERS\nThe Hornets shot 44 percent from the field (35 of 80), while the Bulls managed just 39 percent (35 of 90).\nThe difference Monday came on 3-pointers, where Charlotte made 14 of 36 to Chicago's 10 of 25. Also, the Hornets went 24 of 31 from the line, to 11 of 14 for the Bulls.\nUP NEXT\nBulls: Host the Hawks on Wednesday night.\nHornets: Visit the Pacers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994373.078609
}