{
  "game_id": "0021500031",
  "espn_id": "400827918",
  "date": "Oct 30, 2015",
  "matchup": "LAL @ SAC",
  "headline": "Rondo, Cousins lead Kings to 132-114 win over Lakers",
  "body": "SACRAMENTO, Calif. -- Critics have been doubting that Rajon Rondo can ever become an elite player again. The veteran point guard, now with the Sacramento Kings, proved Friday night he still has some game.\nRondo had 21 points and eight assists and DeMarcus Cousins had 21 points and 11 rebounds as the Kings beat the Los Angeles Lakers 132-114.\nRunning frequently behind the leadership of Rondo and benefiting from Lakers turnovers, the Kings had a 24-point lead at halftime and continued to pad it in the third quarter in evening their record at 1-1.\n\"That was the Rondo of old,\" teammate Omri Casspi said.\nNo one would disagree, at least not this game.\nRondo was attacking the basket, scoring in traffic and frequently setting up his teammates. He was clearly the catalyst in helping ignite the Kings early. He made 9 of 13 from the field, including a 3-pointer, in nearly 24 minutes.\n\"I wanted to come out aggressive, a lot more than I did last game,\" Rondo said. \"This was a collective effort. It wasn't one individual.\"\nRudy Gay scored 19 points for the Kings, who never trailed after the game's opening minutes. Making his first start, rookie Willie Cauley-Stein had a strong opening quarter and finished with 17 points, nine rebounds and three blocks.\nThe power forward and Cousins helped the Kings dominate down low all game and they finished with 80 points in the paint.\nDarren Collison was a key player off the bench for Sacramento, scoring 14 points while Casspi, another reserve, had 12 points and nine rebounds.\n\"I played super loose and had my mind free,\" Cauley-Stein said. \"We shared the ball and had a lot of fun out there.\"\nIt wasn't much fun for the Lakers.\nThey played a sloppy first quarter and were clearly outhustled by the Kings, who were motivated by their second sellout crowd.\nJordan Clarkson scored 22 points and Nick Young had 17 for the Lakers, who have started the season with consecutive losses. Making his first start at point guard, rookie D'Angelo Russell had 13 points.\n\"I told my team they had to be ready when the game starts, but they weren't ready,\" Lakers coach Byron Scott. \"I wish I did have an answer for what happened. If I did I would solve it.\"\nKobe Bryant had 13 points in 22 minutes. After a slow start, he finished 5 of 13 from the field, but was 1 of 8 from 3-point range.\nBryant, who shot 8 of 24 in the Lakers' opening-game loss to Minnesota, missed four straight 3-pointers in the opening quarter and only played 7 minutes. His first basket was a 3 in the second quarter, but at that point the Lakers were trailing 55-37.\n\"We gave up 80 points in the paint. That's a lot to give up,\" Bryant said. \"But they got a lot of penetration and on the ones they didn't convert, they got offensive rebounds and converted those.\"\nAfter going scoreless in the second quarter, Rondo ignited the Kings again in the third. A free agent pickup from Dallas, Rondo scored nine points in the third quarter when the Kings led by a high of 31 points.\nThe Kings came out fast in the opening quarter, dominating in every facet in taking a 40-24 lead into the second quarter. The start was led by Rondo, who fearlessly drove to the basket successfully on four occasions and finished with 10 points and five assists.\nPROBLEMS FROM LONG RANGE\nThe Lakers have taken a lot of 3-point attempts in the first two games. The problem is they aren't making many. After going 9 of 35 in the opener, the Lakers hit 11 of 34 against the Kings.\nFOR STARTERS\nThe Kings' starting five clearly outplayed the Lakers, outscoring them 85-61. The Los Angeles starters committed nine of the team's 19 turnovers. Sacramento's starters shot 31 of 56 from the field.\nTIP-INS\nLakers: Bryant missed the morning shootaround due to a sore throat. He passed former teammate Shaquille O'Neal, moving into third place all-time in field goals made. Bryant has 11,333. ... The Lakers' 19 turnovers led to 30 points.\nKings: Sacramento was wearing its throwback, powder blue jerseys that were first worn when the team came here for the 1985-86 season. The jerseys will be worn every Friday home game in the regular season. ... The Kings had 19 of their 33 fast-break points in the opening half.\nUP NEXT\nLakers: Host Dallas on Sunday.\nKings: Visit the Clippers on Saturday",
  "source": "espn_api",
  "crawled_at": 1764994330.440751
}