{
  "game_id": "0022000879",
  "espn_id": "401307677",
  "date": "Apr 20, 2021",
  "matchup": "LAC @ POR",
  "headline": "Paul George has 33, Clippers down the Blazers 113-112",
  "body": "PORTLAND, Ore. -- — Paul George had 33 points, including two free throws with 4.8 seconds left that gave the Los Angeles Clippers a 113-112 victory over the Portland Trail Blazers on Tuesday night. \n\n\r\n                    George also had 11 rebounds for Los Angeles, playing without Kawhi Leonard. It was the sixth time in the last seven games that George had had 32 or more points. \n\n\r\n                    “He's been carrying us,” Clippers coach Ty Lue said. “He's really stepped up by making his teammates better but also scoring the basketball. He's just doing everything. It was a complete game tonight and we needed every bit of it.”\n\n\r\n                    CJ McCollum had 28 points but missed a pullup jumper at the final buzzer for Portland, which didn't have Damian Lillard for the game. Norman Powell added 23 points. \n\n\r\n                    The Clippers were up 86-82 heading into the final quarter, but Carmelo Anthony's 3-pointer and jumper gave the Blazers a 93-90 lead. Powell's layup extended it to 101-96 midway through the period. \n\n\r\n                    Reggie Jackson's 3-pointer pulled the Clippers within 102-99 with 4:29 left, but McCollum answered with a 3 for Portland. Anthony padded the lead with a jumper. \n\n\r\n                    After George made free throws, Ivica Zubac's layup narrowed it to 109-107. McCollum again answered with a 3, but George's basket got Los Angeles within a point with 33 seconds left. \n\n\r\n                    McCollum missed a corner 3 and with 4.8 seconds to go George made a pair of free throws to give the Clippers the lead. McCollum missed a jumper on what he felt was a good look. \n\n\r\n                    “I thought we competed,\" McCollum said. \"I thought we did enough to win tonight, it just didn't go down.” \n\n\r\n                    Lillard, ranked third in the league with 28.7 points per game, missed his third straight game with a hamstring injury. Portland was also missing center Jusuf Nurkic, who was held out for knee pain management for the first game of a back-to-back. Enes Kanter started in Nurkic's place. \n\n\r\n                    On the Clippers' side, Leonard was out with right foot soreness. He missed four games last week — three because of the foot — but returned Sunday against the Timberwolves and had 15 points and 11 rebounds in 22 minutes. The Clippers won, 124-105. \n\n\r\n                    Lue said it was best to hold Leonard out now as “more of a precautionary thing” for the final stretch of the season, and he will be re-evaluated next week. Leonard leads the Clippers with 25.7 points per game. \n\n\r\n                    McCollum's left-handed floater gave the Blazers a 31-30 edge after a back-and-fourth first quarter. Powell's 3-pointer extended the lead to 58-48 with just over 2 minutes left in the first half, but the Clippers closed the gap to 60-56 at the break. \n\n\r\n                    Terance Mann's dunk pulled the Clippers within 71-70 before George's jumper put them in front 75-74. \n\n\r\n                    The loss added to Portland's woes against teams with winning records in the West. \n\n\r\n                    “I liked the way we played tonight,” Blazers coach Terry Stotts said. “I liked the way we played in some of these other games. We came up short, but I thought tonight we competed really well against a really good team. We had some opportunities in the last minute that we weren't able to capitalize on.” \n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: LA handily won the two prior meetings against the Blazers this season, 128-105 and 133-116. ... During a break between quarters the Blazers showed highlights from Nic Batum's triple-double against the Clippers on the video scoreboard. Batum played for Portland from 2008-15. \n\n\r\n                    Trail Blazers. McCollum shifted to point guard, with Powell also in the backcourt. Derrick Jones Jr. started at small forward. ... It was the first of a four-game homestand for the Blazers. ... Portland was coming off a 109-101 loss at Charlotte on Sunday. ... Powell led all players with 17 points in the half. ... Stotts said he didn't have an update on Lillard following the game. \n\n\r\n                    ADJUSTING\n\n\r\n                    DeMarcus Cousins, signed by the Clippers last week to a 10-day contract, finished with 11 points and six rebounds. \n\n\r\n                    “It’s been a process. Coming into a whole new system, it’s a lot to take in on the fly. It’s been fun,” Cousins said. “The team has really guided me in the right direction so it’s been a smooth transition so far.”\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Host Memphis on Wednesday night. \n\n\r\n                    Trail Blazers: Host the Nuggets on Wednesday night. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997666.32514
}