{
  "game_id": "0022000447",
  "espn_id": "401267607",
  "date": "Feb 18, 2021",
  "matchup": "MIA @ SAC",
  "headline": "Butler's 3rd straight triple-double paces Heat past Kings",
  "body": "SACRAMENTO, Calif. -- — Jimmy Butler had 13 points, 13 assists and 10 rebounds for his third consecutive triple-double, and the Miami Heat beat the Sacramento Kings 118-110 to end a three-game losing streak on Thursday night.\n\n\r\n                    Bam Adebayo also had a triple-double with 16 points, 10 assists and 12 rebounds to help Miami to its first win in Sacramento in nearly five years. Tyler Herro scored 27 points and Kelly Olynyk added a season-high 22 points and seven rebounds.\n\n\r\n                    Butler and Adebayo are the first players in NBA history to have triple-doubles in the same game multiple times, according to the Elias Sports Bureau. They also did it against Atlanta on Dec. 10, 2019.\n\n\r\n                    “They have to shoulder big-time responsibilities for us. That’s not only on court but from a leadership standpoint,” Heat coach Erik Spoelstra said. “That’s what they signed up for. That’s what they earn their paychecks for. The way our offense is designed, they play-make quite a bit and get other guys involved.”\n\n\r\n                    The NBA hadn’t had a triple-double by two players on the same team in the same game since Ja Morant and Jonas Valanciunas did it together for Memphis on Aug. 13, 2020.\n\n\r\n                    “We were just out there playing,” Adebayo said. “We’re trying to get a win. A win matters more than the numbers did. I’m glad we did the triple-double thing again, but I’m really appreciative of the W.”\n\n\r\n                    Olynyk was in awe of what his teammates did.\n\n\r\n                    “It’s uncanny to have a player that go get a player triple-double any night of the season,” Olynyk said. “To have two on the same night, I’m not sure if every team has that luxury. We need that. We’re welcoming that and riding their coattails.”\n\n\r\n                    Already the only player in franchise history with triple-doubles in consecutive games after doing it against the Clippers and Warriors, Butler made it three in a row with season-highs in assists and rebounds against the Kings.\n\n\r\n                    One day after blowing a 15-point halftime lead and losing to the Warriors in overtime, the Heat built another early lead and this time held on against the short-handed and sloppy Kings.\n\n\r\n                    Miami led by 23 points in the third before Sacramento made four consecutive 3s and closed the quarter on a 19-9 run to pull within 89-79.\n\n\r\n                    The Heat pulled away early in the fourth after Herro made a 3-pointer and three-point play on consecutive possessions.\n\n\r\n                    “You want to see if your team can grow and respond to different things and do better,” Spoelstra said. “I think there were certainly some things that we handled better tonight in the second half. There was probably a 4-5 minute stretch where we didn’t get back in transition with the level of detail and sense of urgency we had in the first half, but for the most part it was adequate.”\n\n\r\n                    Marvin Bagley III had 19 points and 10 rebounds for Sacramento. De’Aaron Fox added 11 points and 10 assists.\n\n\r\n                    The Kings have lost five straight following a season-best four-game win streak.\n\n\r\n                    “We have to get back to how we were playing,” Kings coach Luke Walton said. “We really miss some of our guys but we have to be tougher, we have to pay attention to detail. We have to know these types of things going into games.” \n\n\r\n                    Miami got a big lift in the first half from Herro, who had 14 points in the first quarters after making seven of his first nine shots. Andre Iguodala added a steal in the backcourt and dunk to put the Heat up 57-43.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Miami’s last win in Sacramento was on April 1, 2016. … Duncan Robinson made the first shot in the first, second and fourth quarters. \n\n\r\n                    Kings: Starters Harrison Barnes (left foot strain) and Richaun Holmes (right knee soreness) did not play. . Glenn Robinson III had nine rebounds in the first half, his most in any full game since Nov. 6, 2019. Robinson didn’t get another rebound.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Play the Lakers in Los Angeles in a rematch of the 2019-20 NBA Finals on Saturday night.\n\n\r\n                    Kings: Visit the Bulls on Saturday night. Sacramento has won its last three games at the United Center.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764996796.933163
}