{
  "game_id": "401810150",
  "espn_id": "401810150",
  "date": "Nov 29, 2025",
  "matchup": "IND vs CHI",
  "headline": "Siakam's last-second jumper lifts Pacers over Bulls, 103-101",
  "body": "INDIANAPOLIS -- — Pascal Siakam sank a 14-foot jumper with a second left to give the Indiana Pacers a 103-101 victory over the Chicago Bulls on Saturday night.\n\n\r\n              Siakam led the Pacers with 24 points and nine rebounds, while Bennedict Mathurin scored 19. Isaiah Jackson had 14 points and 11 rebounds off the bench.\n\n\r\n              Josh Giddey finished with 17 points and 11 rebounds for the Bulls. Tre Jones also scored 17, and Nikola Vucevic added 16 points and eight boards.\n\n\r\n              Chicago started the final quarter with a 15-2 spurt to take a 95-88 lead with just under 5 1/2 minutes left.\n\n\r\n              Trailing 97-90, the Pacers went on an 8-0 run to grab the lead when T.J. McConnell hit a pull-up jumper with 2:19 remaining.\n\n\r\n              After the Bulls briefly regained the lead at 99-98 on two free throws by Vucevic, the Pacers were helped when a goaltending call on Jay Huff was overturned. After a basket by Siakam, Andrew Nembhard hit one of two free throws to give Indiana a 101-99 advantage with 10.7 seconds left. Jones scored on a drive to tie it 101-all with 7.5 seconds to go when the Pacers were called for goaltending. \n\n\r\n              Indiana shot 49% in the first half and took a 61-54 halftime lead. After the Bulls scored the first seven points of the third quarter to tie it, the Pacers regained an 86-80 lead heading into the fourth. \n\n\r\n              Huff scored Indiana's first 14 points, hitting all five shots, to give the Pacers a 14-9 lead. He didn’t score again, but finished with eight rebounds and four blocks. \n\n\r\n              Nembhard, who had 14 points, returned after missing Friday night’s game against Washington with a bruised right quadriceps.\n\n\r\n              The Bulls were without Coby White, averaging 24.2 points in five games this season, because of a right calf strain. Chicago coach Billy Donovan said this was the last time White will have management limitations in a back-to-back situation.\n\n\r\n              Up next\r\n              Bulls: Play at Orlando on Monday night.\n\n\r\n              Pacers: Host the Cleveland Cavaliers on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042715.991265
}