{
  "game_id": "0022200453",
  "espn_id": "401468608",
  "date": "Dec 19, 2022",
  "matchup": "TOR @ PHI",
  "headline": "Harris, Embiid carry 76ers past Raptors 104-101 in overtime",
  "body": "PHILADELPHIA -- — Tobias Harris hit a 3-pointer in overtime that put Philadelphia ahead to stay, and Joel Embiid had 28 points, 11 rebounds and four assists as the 76ers extended their winning streak to a season-best five games with a 104-101 win over the struggling Toronto Raptors on Monday night.\n\n\r\n              “He’s a star in his role,” Embiid said of Harris’ performance. ”That’s what he’s been doing all season, knocking down big shots.”\n\n\r\n              Harris put the Sixers ahead with 2:12 left in OT and finished with 21 points, making five of his seven 3-point attempts.\n\n\r\n              “He dedicated this summer to being a spot-up shooter, making shots, and he’s doing that,” Sixers head coach Doc Rivers said of Harris’ evolution. “You can see he’s worked on improving the quickness of his release.”\n\n\r\n              Harris then came down and made another 3-pointer on the next possession. The referees originally called a shooting foul on Scottie Barnes, which would have sent Harris to the line for a chance to complete the 4-point play, but after a review the referees determined that PJ Tucker committed an illegal screen before Harris’ shot. \n\n\r\n              “I still don’t understand the call. That will have to be explained to me,” Rivers said of the sequence.\n\n\r\n              “I wasn’t gonna complain, but that was probably the most ridiculous game I’ve ever been a part of. That’s all I’ll say about that game,” Embiid said, indirectly referencing the play. “I’m just glad we got the win. But the way the game was, it was ridiculous.”\n\n\r\n              James Harden added 14 points for Philadelphia, which has won the first five games of a seven-game homestand, the Sixers’ longest of the season. The 76ers close out the stretch against the Pistons on Wednesday and Clippers on Friday.\n\n\r\n              The 76ers won despite a stellar performance from Toronto All-Star forward Pascal Siakam, whose 38-point performance was the highest point total allowed by 76ers this season. Siakam, whose driving layup with 5.1 seconds left in regulation sent the game to overtime, added 15 rebounds, six assists and strong defense down the stretch in a losing effort.\n\n\r\n              The Raptors used a 19-1 run, which stretched from late in the third quarter and into the start of the fourth, to erase Philadelphia’s lead, which reached as many as 14 points early in the third. Siakam fueled Toronto’s comeback, scoring 10 of Toronto’s 19 points during the run.\n\n\r\n              “We got the win. Even when it’s ugly, it still counts. We were up a lot the whole night, they made that run at the end of the third and the beginning of the fourth, but we reacted,” Embiid said. \n\n\r\n              It is the sixth consecutive loss for the struggling Raptors, who fell to 13-18. Toronto shot just 42% from the field and 11 for 40 from 3-point range.\n\n\r\n              Besides Siakam’s 38 points, no Toronto player scored more than 13. Fred VanVleet (nine points) shot just 3 for 15 from the field, and 2 for 11 from 3-point range.\n\n\r\n              “I like the way we hung in early .. but we hung in there and hung around and found a little bit of a stretch where we made a few,” Toronto coach Nick Nurse said. “I thought we were creating some really good shots. Probably not quite rewarded, percentage wire, for the quality of shots we did create.”\n\n\r\n              TIP-INS\n\n\r\n              76ers: Philadelphia was playing without Furkan Korkmaz, who missed his second straight game with a non-COVID related illness, and without Tyrese Maxey, who is rehabilitating a fracture in his left foot that has caused him to miss the last 14 games.\n\n\r\n              Raptors: Toronto was without Precious Achiuwa, who has not played since Nov. 9th after tearing a ligament in his right ankle. The Raptors were also without Gary Trent Jr., who missed his third straight game because of a sore left quad. ... Toronto’s losing streak was just the third losing streak of five or more games during Nick Nurse’s five seasons with the Raptors. Both of the previous losing streaks came during the 2020-21 season, which saw the Raptors finish with a 27-45 record.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host the Pistons on Wednesday.\n\n\r\n              Raptors: Will play the Knicks in New York on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994074.510129
}