{
  "game_id": "0021900398",
  "espn_id": "401161040",
  "date": "Dec 16, 2019",
  "matchup": "MIL vs. DAL",
  "headline": "Bucks’ 18-game winning streak ends with 120-116 loss to Mavs",
  "body": "MILWAUKEE --  The Bucks have little time to reflect on the end of their 18-game winning streak.\n\nMilwaukee's impressive run was halted Monday night when Seth Curry and Kristaps Porzingis each scored 26 points to help the Dallas Mavericks hang on for a 120-116 victory even without star guard Luka Doncic.\n\nMilwaukee, which dropped to 24-4 with its first loss since a 103-100 setback Nov. 8 at Utah, next hosts LeBron James and the Los Angeles Lakers (24-3) on Thursday in a matchup of conference leaders.\n\n\"It's going to be a test for us,\" said Giannis Antetokounmpo, who led the Bucks with 48 points and 14 rebounds. \"The Lakers are one of the best teams in the league. We've got to play good basketball. We've got to move the ball. Obviously as a team, we don't want to lose two in a row.\"\n\nThe winning streak was the Bucks' longest since a franchise-record 20 consecutive victories by the 1970-71 championship team that featured Kareem Abdul-Jabbar, then known as Lew Alcindor, and Oscar Robertson.\n\nDallas led comfortably for most of the fourth quarter until the final half-minute. Tim Hardaway Jr. hit the second of two free throws to make it 119-114 with 7.6 seconds left. Antetokounmpo scored on a layup and was fouled, but missed the free throw. Sterling Brown grabbed the offensive rebound, but his putback was blocked by Porzingis.\n\n\"I'm proud of the way the guys fought to the very last second tonight,\" Bucks coach Mike Budenholzer said. \"To find a way to be close in the fourth quarter and have an offensive rebound and give ourselves a chance, I think it's just a sign of the competitive nature of this group.\"\n\nDoncic sat out with a sprained right ankle, while the Bucks were missing injured point guard Eric Bledsoe.\n\nMilwaukee trailed 86-76 entering the fourth quarter and pulled to 99-92 before Porzingis hit back-to-back 3-pointers from long range. The Bucks got no closer until the final 23 seconds.\n\nDallas was 16 of 41 from 3-point range, including four 3s each by Curry and Porzingis. The Bucks went 11 of 41 from beyond the arc.\n\n\"I hit those two deep 3s but even then, Giannis was right there in front of me,\" Porzingis said. \"They know we are a pretty good shooting team. But we have so many weapons and anybody on any given night can score 20-plus points. That's the dangerous thing about us. Tonight, Seth played great. It's kind of hard to play against a team that has so many options.\"\n\nKyle Korver added a season-high 17 points for Milwaukee, including five 3-pointers.\n\nMilwaukee trailed 69-67 when Antetokounmpo went to the bench with 6:32 left in the third quarter, having scored all 11 of the Bucks' points in the period. Dallas led 75-69 when Antetokounmpo returned after a two-minute breather, and the Mavericks pushed the margin to 80-69.\n\nDallas was 7 of 13 beyond the arc in the first quarter en route to a 36-22 lead entering the second period.\n\n\"I've been in this league a long time and an 18-game winning streak is a spectacular demonstration of how good a team is,\" Mavericks coach Rick Carlisle said. \"But you're not going to win every game to finish the season. We just felt that if we came out and really concentrated on ourselves, with a pretty simple game plan, we give ourselves a chance.\"\n\nTIP-INS\n\nMavericks: Doncic, who sprained his ankle Saturday against Miami, is improving. \"He is responding well to treatment. He's off crutches and out of a boot,\" Carlisle said. \"He's progressing well. He will not play on Wednesday. If there's any update, it will be Wednesday night.\" The 20-year-old Doncic, third in the NBA in scoring at 29.3 points per game, did not travel with the team to Milwaukee.\n\nBucks: Bledsoe sustained a right fibula avulsion fracture in Friday's 127-114 win at Memphis. He is expected to miss about two weeks.\n\nUP NEXT\n\nMavericks: Host the Boston Celtics on Wednesday.\n\nBucks: Host the Los Angeles Lakers on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996157.6356869
}