{
  "game_id": "0021900905",
  "espn_id": "401161547",
  "date": "Mar 02, 2020",
  "matchup": "MEM @ ATL",
  "headline": "Dieng leads 9 scorers in double figures, Memphis routs Hawks",
  "body": "ATLANTA --  Gorgui Dieng had 17 points and 10 rebounds, leading nine Memphis scorers in double figures, and the Grizzlies pulled away in the second half for a 127-88 win over the cold-shooting Atlanta Hawks on Monday night.\n\nMemphis, trying to protect its No. 8 spot in the Western Conference playoff field, has won two straight following five consecutive losses.\n\nThe Grizzlies missed their first 11 shots from the field against Atlanta but recovered to lead 24-23 at the end of the opening period. They led 52-49 at halftime and pulled away in the third period.\n\n\"We've got to come out from the jump, even if we aren't making shots,\" Memphis coach Taylor Jenkins said. \"They got out of the slump there. And then we just kind of found a groove.\"\n\nJenkins said poor defense contributed to the slow scoring start.\n\n\"I felt their urgency on the defensive end wasn't really there,\" Jenkins said.\n\nJonas Valanciunas had 15 points and 15 rebounds for the Grizzlies. Josh Jackson had 15 points and Ja Morant scored 13.\n\nAtlanta suffered its third loss in its last 11 home games. The Hawks were denied their first three-game winning streak of the season. They shot a season-low 32.3% from the field, making 32 of 99 shots.\n\nHawks coach Lloyd Pierce opened his postgame news conference by saying, \"I've got nothing to say.\"\n\nAsked if there were any teachable moments in the loss, Pierce said, \"I don't know what to teach. You can't teach effort.\"\n\nPierce then left the interview room.\n\nTrae Young led Atlanta with 19 points on 5-of-17 shooting.\n\nMorant was coming off one of his most impressive games. He had 27 points and 14 assists, matching his season high, in the Grizzlies' 105-88 win over the Los Angeles Lakers  on Saturday.\n\nMorant said he enjoyed facing Young for the first time in a matchup of young stars at point guard.\n\n\"I study his game,\" Morant said. \"After every game I text him. I just signed a jersey for him. Said, `Next generation.\"\n\nThe Hawks had a long scoring drought early in the second quarter when Memphis used a 14-0 run to lead 39-27.\n\nYoung made 3 of 11 shots from the field in the first half. He was good on each of his nine free throws, including six in the final 3 minutes before the break.\n\nMemphis took advantage of an even longer scoring run -- 15 consecutive points -- to stretch the lead to 75-56 in the third period. De'Anthony Melton, who had 11 points, had a 3-pointer and a three-point play during the run.\n\nPierce rested his starters much of the final period. The Grizzlies also stretched their bench and still lengthened the lead.\n\nTIP-INS\n\nGrizzlies: Memphis signed F Anthony Tolliver, 34, to a 10-day contract about two hours before the game. Tolliver made four of five 3-pointers and had 12 points. The team waived C Jordan Bell. Jenkins said Tolliver is an \"ultimate pro\" who can help the team with his 3-point shooting. Tolliver, who also has had stints with Portland and Sacramento this season, was needed due to injuries to F Jaren Jackson Jr. (left knee), G Grayson Allen (left hip) and F Brandon Clarke (right quad). ... Tyus Jones had 15 points and nine rebounds.\n\nHawks: Bruno Fernando replaced F Cam Reddish (lower back pain) in the starting lineup. Reddish tested the back, which he hurt in Saturday's win over Portland, in pregame warm-ups. ... Kevin Huerter had 13 points. John Collins and Jeff Teague had 12 apiece.\n\nUP NEXT\n\nThe Grizzlies continue their three-game trip when they play at Brooklyn on Wednesday night.\n\nHawks will play away games on back-to-back nights starting with Friday night's game at Washington. They play at Memphis on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995685.6407208
}