{
  "game_id": "0021500757",
  "espn_id": "400828644",
  "date": "Feb 05, 2016",
  "matchup": "CHI @ DEN",
  "headline": "Nuggets rally for win after Bulls lose Butler to injury",
  "body": "DENVER --  Chicago lost All-Star Jimmy Butler, and then the game. An impressive rally by Danilo Gallinari and the Denver Nuggets pushed aside the Bulls.\n\nGallinari scored 33 points Friday night, and Denver stormed to a 115-110 victory after Butler left in the second quarter with a sprained left knee.\n\nEmmanuel Mudiay scored 22 points and Will Barton had 18 for the Nuggets, who outscored the Bulls 42-21 in the fourth quarter. It was their ninth straight victory over Chicago in Denver, but the concern from the Bulls was for Butler, who was seen leaving the arena after the game on crutches.\n\n\"I talked to our trainers, the knee seems intact, the ligaments seem stable,\" coach Fred Hoiberg said. \"He'll get an MRI (Saturday morning) and we should know more after that. He's sore. We've got to be prepared to play without Jimmy for a time but we don't want to jump to conclusions.\"\n\nButler was fouled near the basket by Joffrey Lauvergne and fell awkwardly to the floor with 1:06 remaining in the first half. He was tended to by medical personnel before getting to his feet and gingerly making his way to the free-throw line, where he made one of the two foul shots.\n\nButler was then helped to a rolling chair and wheeled into the locker room for further examination.\n\n\"We did some really, really good things to get that lead,\" Hoiberg said. \"The guys went out in the third quarter without knowing what the prognosis on Jimmy was and battled, got us that lead. We're in complete attack mode, got the momentum and then gave it right back.\"\n\nDerrick Rose led the Bulls with 30 points. Butler finished with 19 points, and Taj Gibson had 18.\n\n\"It hurt,\" Rose said of Butler's loss. \"But it's on to the next. We couldn't stop them when we got the lead and they were able to come back.\"\n\nButler rested for the first time this season when he missed Wednesday's 107-102 win at Sacramento with left knee tendinitis. He suffered the injury on Monday at Utah when he banged his knee in an on-court collision.\n\nChicago led by two at halftime, and then outscored the Nuggets 32-18 in the third.\n\nDenver closed to 98-95 with 5:58 left when Nikola Jokic connected on a pair of 3-pointers around a 3-pointer by Chicago's Doug McDermott.\n\nGallinari's baseline jumper with 51.2 seconds remaining gave Denver a 109-108 lead.\n\nRose badly missed a contested jumper over Kenneth Faried and Mudiay then made the first of two free throws before Faried rebounded his missed shot from the line to give the Nuggets a four-point edge with 20 seconds left, and that was enough to hold off the Bulls.\n\nGallinari said it took the Nuggets' best fourth quarter of the season to complete the comeback.\n\n\"That's maybe the most positive thing about this team and the best thing about this team: We never give up,\" Gallinari said. \"We've been down in a lot of games, especially in the first half but we always battle back.\"\n\nSCORING CONFUSION\n\nThe game was briefly delayed in the opening minutes of the fourth quarter when the computer tracking the score failed to include a basket for Chicago. The computer was updated once officials validated the basket by going over the play by play.\n\n\"They fixed it and we moved on,\" crew chief Scott Foster said. \"The confusion came when Chicago lost two points, but the incident was solved by cross referencing the book and the play-by-play.\"\n\nTIP-INS\n\nBulls: F Nikola Mirotic (appendicitis) and C Joakim Noah (left shoulder) did not travel with the team. ... C Pau Gasol sat out with a left hand sprain.\n\nNuggets: G Jameer Nelson missed a third consecutive game because of a lingering left wrist injury. ... Jokic fouled out with 1:41 left to play.\n\nUP NEXT\n\nBulls: Visit Minnesota on Saturday night.\n\nNuggets: Visit the New York Knicks on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764993915.1676102
}