{
  "game_id": "0021800348",
  "espn_id": "401071029",
  "date": "Dec 03, 2018",
  "matchup": "HOU @ MIN",
  "headline": "Towns, Wolves use big second half to beat Rockets 103-91",
  "body": "MINNEAPOLIS --  Karl-Anthony Towns and the Timberwolves got together in the locker room at halftime to address what needed to be fixed -- all their defensive lapses that led to a big second quarter by the Rockets.\n\nMinnesota clamped down after that, and Houston had hardly any offense at all.\n\nA stingy defensive effort by Minnesota helped erase a 14-point halftime deficit, and the Timberwolves beat the Rockets 103-91 on Monday night. Minnesota shut things down after the break, holding the Rockets to 29 points in the second half.\n\n\"We came in here and we made it clear we've got to change things and we've got to be the team that wants it more,\" Towns said of the halftime discussion. \"I think everyone in the building saw that we came out with an edge to us and a fire to us to get back in the game.\"\n\nTowns led Minnesota with 24 points and 11 rebounds, and Andrew Wiggins had 16 points. The Rockets led by as many as 19 in the first half before Minnesota stormed back to take the lead for good in the third quarter.\n\nJames Harden finished with 29 points, and Clint Capela added 24 for the Rockets. Houston went cold after halftime, scoring just nine points in the fourth quarter.\n\n\"In the second half, we just laid an egg,\" Rockets guard Eric Gordon said. \"They had everything going. You could tell by their confidence. They just played better defensively.\"\n\nFollowing the example set Robert Covington, Minnesota stepped up its defensive intensity in the third quarter while shooting 7 of 10 from 3-point range. Houston shot just 38.1 percent in the third quarter and connected on 2 of 11 from deep.\n\nCovington, acquired by Minnesota last month in a trade that sent Jimmy Butler to Philadelphia, has helped jumpstart the Wolves' defense since his arrival. Since the All-Defensive First Team selection made his Timberwolves debut, Minnesota has held opponents to 100 points or fewer in seven of 10 games.\n\n\"It just shows how good we can be defensively,\" said Covington, who had two blocks, two steals and 13 points. \"Everyone that stepped on the court was really engaged in the second half defensively, and that's what allowed us to hold them to that.\"\n\nHarden scored 14 of Houston's 38 points in the second quarter as the Rockets pushed their lead to 14 at the half.\n\nMinnesota had three technical fouls in the first half. Towns received a technical after he thought he was fouled, and Covington got one late in the second quarter. Jeff Teague was hit with a technical foul on a play in which he was fouled.\n\nAfter Houston scored 38 points in the second quarter, Minnesota answered with a 38-point quarter of its own. The Timberwolves tied it at 76 after back-to-back 3-pointers by Teague to cap a 15-3 run. Wiggins also hit a 3-pointer and had a block at the other end during the stretch.\n\nMinnesota took its first lead since 14-11 when Dario Saric hit a 3-pointer that made it 79-77.\n\nThe Wolves grew their lead in the fourth quarter on a three-point play by Saric and a 3-pointer from the top of the key by Covington that made it 94-82.\n\nHarden hit a shot in the fourth that ended a 42-14 Timberwolves' run over 14 1/2 minutes. The nine points in the fourth quarter was the fewest for the Rockets in any quarter this season.\n\n\"For whatever reason, the second half we played without any kind of spirit or energy,\" Rockets coach Mike D'Antoni said. \"Things were going great in the first half, and then at the end of the first half we let them come back.\"\n\nMonday marked the first time Minnesota and Houston faced off since last year's playoffs. The Rockets beat the Timberwolves in five games, including a game that saw Houston score 50 points in a quarter at Target Center.\n\nTIP-INS\n\nRockets: Harden topped the 20-point mark for the 18th time this season. ... Houston shot just 3 for 22 from 3-point range in the second half after hitting on 8 of 17 shots from deep in the first half. ... Chris Paul scored a season-low five points.\n\nTimberwolves: The 38-point third quarter was the highest-scoring quarter in a second half all season for Minnesota. ... Derrick Rose was held scoreless for the first time all season. He entered Monday's game averaging 19.3 points per game. ... Saric was 3 for 4 from deep. He was 4 for 19 from 3-point range in his previous six games. . Monday's game drew 13,824 fans, lowering Minnesota's season average attendance to 14,531. Only Brooklyn averages fewer fans this year.\n\nUP NEXT\n\nRockets: Visit Utah on Thursday night.\n\nTimberwolves: Host Charlotte on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995310.702948
}