{
  "game_id": "0021501166",
  "espn_id": "400829053",
  "date": "Apr 06, 2016",
  "matchup": "DET @ ORL",
  "headline": "Pistons use strong second half to get past Magic 108-104",
  "body": "ORLANDO, Fla. --  It could have been easy for Detroit Pistons coach Stan Van Gundy to praise his team Wednesday night.\n\nAfter all, the Pistons not only rallied in the fourth quarter against a hot Orlando team, but their 108-104 win at the Amway Center moved them one win away from clinching one of the last two spots in the Eastern Conference playoff race.\n\nBut recent experience has taught Van Gundy to temper his superlatives. The Pistons, despite being in a close playoff race down the stretch, have alternated wins and losses the last six games, most recently following up an impressive 94-90 road win over Chicago with a deflating 107-89 loss at Miami on Tuesday night.\n\nDetroit is currently in eighth place in the Eastern Conference standings but could easily fall out of the final playoff spot if it does not come up with one win during its final three regular-season game.\n\n\"You know what, after the Chicago game, I heaped a lot of praise on our guys and then we exhaled and didn't even show up to play so I'll just say good win,\" said Van Gundy, whose team last put together consecutive wins during a five-game winning streak from March 18-25. \"I'm not going to go through a lot of praising people today.\"\n\nBut without question several of the Pistons players came up big, especially in the fourth quarter when they used a 12-2 run to rally against a Magic team that had put together three straight blowout wins at home coming into Wednesday night.\n\nReggie Jackson, Tobias Harris and Kentavious Caldwell-Pope all hit key baskets during a nearly three-minute stretch late in the fourth quarter to erase the Magic's lead for good. Pope's 3-pointer with 3:42 remaining in the game put the Pistons ahead 97-96 and then Jackson's two free throws and driving layup put the finishing touches on the run.\n\nThe Magic (33-45), which had won four their last five going into Wednesday night, continued to fight until the end but never reclaimed the lead.\n\nThe Pistons (42-37) face Washington, Miami and then Cleveland to close out the season, which made Wednesday a virtual must-win for the Pistons.\n\n\"It was a great win,\" said Harris, who returned to Orlando for the first time since being traded away in February. \"Any win right now is a great win for us.\n\n\"It wasn't the prettiest, but we kept fighting and kept fighting like we always do, especially coming off a back to back.\"\n\nJackson led five Pistons players in double figures with 24 points, while Pope added another 18.\n\n\"They won four out of five and we knew they were going to try to punch us in the mouth,\" Jackson said, \"especially on their home court where they have played above average on the season.\"\n\nIn a game where neither team was able to get much breathing room, the Pistons' defense became the deciding factor down the stretch. They forced Orlando into bad shots and turnovers during critical junctures. The Magic had averaged over 119 points per game in their previous five games, but they were held far under that Wednesday night.\n\nEvan Fournier finished with a team-high 19 points after struggling during much of the first half. Victor Oladipo scored 16 points on 5-of-13 shooting, while Elfrid Payton added 17 points and Nikola Vucevic scored 15 points off the bench.\n\nThe Magic have struggled with close games down the stretch this season and Wednesday night those issues returned.\n\n\"Yes, it's frustrating, but we didn't play bad at all tonight,\" Fournier said. \"Detroit is a team that is fighting for a playoff spot. They are playing good ball.\n\n\"It's disappointing, but at this point it's more about what we have to learn.\"\n\nTIP-INS\n\nDetroit: SF Tobias Harris returned to Orlando on Wednesday night for the first time since being traded in February. The Magic sent Harris to Detroit in exchange for F Ersan Illyasova and PG Brandon Jennings. ... The Pistons had 13 fast-break points, compared to 11 by the Magic.\n\nOrlando: The Magic entered Wednesday night's game averaging 119.2 points per outing in their last five games. They had also won four of their last five games and three straight at home. ... C Nikola Vucevic continues to come off the bench since returning to the floor last week after a groin injury kept him out for an extended time. Coach Scott Skiles says Vucevic is still a starter, but right now both he and the team are playing well with him coming off the bench.\n\nUP NEXT\n\nPistons: host the Washington Wizards on Friday.\n\nMagic: host the Miami Heat on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994891.777289
}