{
  "game_id": "0022200411",
  "espn_id": "401468566",
  "date": "Dec 13, 2022",
  "matchup": "PHX @ HOU",
  "headline": "Green scores 26, Rockets beat slumping Suns in Silas' return",
  "body": "HOUSTON -- — Jalen Green had 26 points and Kevin Porter Jr. added 18 as the Houston Rockets never trailed in a 111-97 win over the slumping Phoenix Suns on Tuesday night.\n\n\r\n              The Rockets led by as many as 23 and held a comfortable lead for most of the night in the return of coach Stephen Silas, who was back after missing the previous game following the death of his father, longtime NBA player and coach Paul Silas.\n\n\r\n              “It was definitely great to be back,” Silas said. “I love these guys. I love this team. I kind of didn’t want the game to end because now it’s like real life starts up again.” \n\n\r\n              It was the second straight victory for the Rockets, who beat Milwaukee on Sunday night.\n\n\r\n              Silas was asked if returning to work made things easier for him. \n\n\r\n              “I don't know if it makes it easier or not, but my dad was a coach and he would tell me to coach,\" Silas said. “Get your butt out there and coach. So that's what I did.”\n\n\r\n              Already playing without Devin Booker, the Suns, who dropped their fifth straight, didn’t have Deandre Ayton and Cameron Payne in the second half after both were injured before halftime. Ayton injured his left ankle and Payne sustained a right foot injury.\n\n\r\n              Mikal Bridges led the Suns with 18 points but shot a horrific 4 of 24 from the field and 2 of 10 from 3-point range. He made all eight free-throw attempts. \n\n\r\n              “Mikal was 4 for 24,” coach Monty Williams said. “That’s going to be a tough recipe when you don’t have Book and all the other guys that are out.”\n\n\r\n              Chris Paul had 16 points on 5-of-17 shooting, including 2 of 10 on 3s.\n\n\r\n              Paul said he isn't worried about things snowballing for the Suns.\n\n\r\n              “Not really,” he said. “As long as the locker room stays positive and understands that it’s a long season. We went on ... an 18-game winning streak (last season) and lost in the second round. You know what I mean? In this league you can’t get too high or too low.”\n\n\r\n              The Rockets scored the game’s first seven points and led 54-35 after a first half where the Suns made just 11 of 50 shots, including 4 of 24 3-pointers.\n\n\r\n              A 7-2 run by the Suns got them within 11 with about 7 1/2 minutes left in the game. Houston scored the next five points, capped by an off-balance tip-in for a three-point play by Garrison Mathews, to stretch the lead to 98-82.\n\n\r\n              Phoenix entered the game ranked fifth in the league in 3-point shooting at 38.3% but made just 13 of 51 (25.5%) on Tuesday night.\n\n\r\n              TIP-INS\n\n\r\n              Suns: Booker missed a second straight game with tightness in his left hamstring. ... Torrey Craig had 12 rebounds. ... Paul had seven assists. \n\n\r\n              Rockets: Alperen Sengun had 10 points and 16 rebounds. ... Jabari Smith Jr. received a flagrant-1 foul after a collision with Bridges in the third quarter. He had 14 points and eight rebounds. ... Tari Eason had 10 points and seven rebounds off the bench.\n\n\r\n              REMEMBERING DAD\n\n\r\n              Silas was emotional when speaking about his father before the game. He said he’s been moved by the outpouring of support he’s received since Paul Silas' death Sunday at 79.\n\n\r\n              “I’m very proud to be my dad’s son,” Silas said. “I’m very proud that people see him in me. And I want that to continue. Whenever it is my time comes, I want people to say the same things that they said about him over the last couple of days about (me). And hopefully they’ll do that.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: Visit the Los Angeles Clippers on Thursday night.\n\n\r\n              Rockets: Host Miami on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995085.670513
}