{
  "game_id": "0022401221",
  "espn_id": "401736816",
  "date": "Dec 16, 2024",
  "matchup": "MIA @ DET",
  "headline": "Hardaway's hot shooting in OT helps Pistons nip Heat 125-124",
  "body": "DETROIT -- — Tim Hardaway Jr. hit three 3-pointers in overtime to help the Detroit Pistons end the Miami Heat’s four-game winning streak with a 125-124 victory on Monday night.\n\n\r\n              Cade Cunningham had 20 points, a career-high 18 assists and 11 rebounds for the Pistons, his sixth triple-double of the season. Jimmy Butler had 35 points, 19 rebounds and 10 assists for Miami.\n\n\r\n              Malik Beasley led the Pistons with 28 points and went 7 of 13 on 3-pointers.\n\n\r\n              Miami trailed by 19 points in the second half, but finished regulation on an 18-2 run before scoring the first eight points of overtime.\n\n\r\n              Hardaway’s first two 3s pulled Detroit within 122-120 with 1:35 left in OT. After Tyler Herro missed an off-balance jumper, Hardaway hit another 3 to put the Pistons ahead 123-122.\n\n\r\n              Butler and Cunningham traded baskets before Herro missed again with 19 seconds to play. A turnover gave Miami one more chance, but Herro missed a 3 at the buzzer.\n\n\r\n              The Pistons, who had lost four of five, shot 50% (20 of 40) from 3-point range.\n\n\r\n              Takeaways\r\n              Heat: Herro went 4 of 17 from long range, extending his streak to 58 games with at least one 3 — the second-longest run in franchise history. Duncan Robinson holds the record with a 69-game streak.\n\n\r\n              Pistons: Detroit played without Jaden Ivey (knee) and Tobias Harris (thumb), then lost Isaiah Stewart in the first half to a hyperextended left knee. That meant playing time for Paul Reed.\n\n\r\n              Key moment\r\n              The Pistons outscored Miami 11-2 in the first four minutes of the second half.\n\n\r\n              Key stat\r\n              Butler became the third player in NBA history to finish with at least 35 points, 19 rebounds, 10 assists and four steals in a game. The others were DeMarcus Cousins in 2018 and George McInnis in 1976.\n\n\r\n              Up next\r\n              Heat: Host Oklahoma City on Friday.\n\n\r\n              Pistons: Host Utah on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996917.0759318
}