{
  "game_id": "0022200008",
  "espn_id": "401468023",
  "date": "Oct 19, 2022",
  "matchup": "TOR vs. CLE",
  "headline": "Raptors overcome Mitchell's 31 points, beat Cavs 108-105",
  "body": "TORONTO -- — Pascal Siakam had 23 points and 11 rebounds before fouling out, O.G. Anunoby scored 10 of his 18 points in the fourth quarter and the Toronto Raptors beat the Cleveland Cavaliers 108-105 Wednesday night.\n\n\r\n              Gary Trent Jr. scored 19 points, and Scottie Barnes and Fred Van Vleet each had 15 as Toronto outscored Cleveland 32-21 in the final period.\n\n\r\n              Donovan Mitchell scored 31 points in his Cleveland debut, Jarrett Allen had 13 points and 10 rebounds, and Evan Mobley added 14 points for the Cavaliers, who held an eight-point lead through three quarters but failed to close it out.\n\n\r\n              Mitchell shot 12 for 21 and scored 18 in the second half.\n\n\r\n              “He’s an elite basketball player,” Cavaliers coach J.B. Bickerstaff said. “There’s not many guys in this league that are better than Donovan and capable of doing the things that he can do.”\n\n\r\n              Cedi Osman scored 17 points and Mitchell had nine assists for the Cavaliers, who are hoping to take a step forward this season after acquiring Mitchell from Utah over the summer. Cleveland reached the play-in tournament last spring, but was eliminated after losing in Brooklyn and at home to Atlanta.\n\n\r\n              Cleveland All-Star guard Darius Garland injured his left eye in a collision with Trent late in the second quarter and didn’t return.\n\n\r\n              “His head was clear and all those things but he was cut and bleeding pretty bad from the inside of his eyelid,” Bickerstaff said. “You miss an all-star. You talk about being able to stagger his and Donovan’s minutes so that one of those guys is always on the floor. We know through history what Darius is capable of and how he can carry an offense as well.”\n\n\r\n              Garland shot 2 for 8 and scored four points in 13 minutes.\n\n\r\n              “To see DG go down there, it’s tough,” Mitchell said. “I’m proud of the way this group responded.”\n\n\r\n              Toronto shot 8 for 22 from 3–point range through the first three quarters, but made 5 of 8 from long distance in the fourth.\n\n\r\n              “We played both ends like we needed to in the fourth quarter,” Raptors coach Nick Nurse said.\n\n\r\n              Toronto had 12 offensive rebounds to Cleveland’s six. The Cavaliers made 16 turnovers, leading to 25 points for the Raptors.\n\n\r\n              “We didn’t do a bunch of things that we can control,” Mitchell said.\n\n\r\n              The Cavaliers led 97-92 with 4:55 left in the fourth before Barnes scored and Anunoby made a pair of free throws that cut the deficit to one.\n\n\r\n              After Allen turned the ball over, Anunoby fed Barnes for a driving dunk that put Toronto up 98-97 with 3:31 left.\n\n\r\n              “That one time we let our guard down, they hit us with a hook in the fourth,” Mitchell said. “It’s hard to recover from that.”\n\n\r\n              Cleveland led 57-51 at the half. Mitchell scored 10 points in the third as the Cavs took an 84-76 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Caris LeVert had 10 points and seven assists. … Osman took Garland’s place to begin the second half. … Cleveland shot 14 for 22 in the second quarter and 9 for 18 in the third. … F Mamadi Diakite (not with team), G Ricky Rubio (left knee) and G-F Dylan Windler (right ankle) were not available.\n\n\r\n              Raptors: Barnes had a team-high seven assists. … Toronto has eight international players, leading the league for the second consecutive season. Dallas, Indiana and Sacramento have seven. … C Khem Birch (left knee), F Chris Boucher (left hamstring) and F Otto Porter Jr. (left hamstring) were not available.\n\n\r\n              IN THE FOLD\n\n\r\n              Toronto exercised the third-year team option on Barnes and the fourth-year team options on F Precious Achiuwa and G Malachi Flynn. All three are signed through 2023-24.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit Chicago on Saturday night.\n\n\r\n              Raptors: Visit Brooklyn on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994458.3550138
}