{
  "game_id": "0022301055",
  "espn_id": "401585683",
  "date": "Mar 27, 2024",
  "matchup": "LAL @ MEM",
  "headline": "LeBron James has triple-double to help Lakers beat Grizzlies, 136-124",
  "body": "MEMPHIS, Tenn. -- — LeBron James had a triple-double with 23 points, 14 rebounds and 12 assists, Rui Hachimura scored 32 points as the Los Angeles Lakers built a big lead in the third quarter and beat the Memphis Grizzlies 136-124 on Wednesday night.\n\n\r\n              Coming off a 128-124 double-overtime victory in Milwaukee without James on Tuesday night, the Lakers won their fifth straight to pull within 2 1/2 games of idle Dallas for the sixth spot in the Western Conference, a spot that would avoid a play-in game.\n\n\r\n              Anthony Davis sat out against Memphis after having 34 points and 23 rebounds in a career-high 52 minutes against Milwaukee. He hyperextended his left knee late against the Bucks. James said Hachimura's scoring — including 7 of 8 3-pointers — along with grabbing 10 rebounds was a key with Davis sitting out.\n\n\r\n              “Rui's ability to shoot and spread the floor was big time for us,” James said. “He just stayed locked in all night.”\n\n\r\n              D'Angelo Russell added 23 points for Los Angeles, and Taurean Prince had 15.\n\n\r\n              Desmond Bane led Memphis with 26 points and a career-high 16 assists. Jake LaRavia scored 14 of his 25 points in the fourth quarter, and Jaren Jackson added 17. The Grizzlies have lost six of seven.\n\n\r\n              Despite the extended game a night earlier, the Lakers seemed fine with their shooting legs in the first half, and led 69-61 at the break. Lakers coach Darvin Ham almost predicted the pace of the game, saying it was key for Los Angeles to get their legs in the first half after the Milwaukee win and let the second half play out.\n\n\r\n              “We started getting a groove into the game,” Ham said. “We knew coming off the (Bucks) game, this was not going to be a walk in the park.”\n\n\r\n              Los Angeles converted eight of its first 10 long-range shots in the third to stretch the advantage to 27. Memphis closed the third on a 21-4 run to pull to 102-92 entering the fourth.\n\n\r\n              The Lakers would maintain the double-digit lead through the bulk of the fourth.\n\n\r\n              “Priority was the paint,” Memphis coach Taylor Jenkins said of Hachimura's shooting. “Obviously, he was the beneficiary of some great ball movement. We adjusted late, but probably a little late on my part.”\n\n\r\n              The Grizzlies, limping to the finish after a season filled with injuries, got an emotional boost with the return of Brandon Clarke. The 6-foot-8 forward had not played since March 5, 2023 healing from a left Achilles injury. He finished with six points in almost 21 minutes.\n\n\r\n              As soon as Clarke got off the bench to enter the game in the first quarter, the Memphis fans began applauding his anticipated appearance. The recognition continued until a standing ovation when he was announced entering the game.\n\n\r\n              “I'm glad to get that first game over with,” Clarke said, acknowledging he still has work on his stamina. “I've been thinking about it for a very long time. I wish we could have won, but it was fun to play.”\n\n\r\n              The Lakers play down the stretch of the season is reminiscent of their run to make the playoffs last season. They finished the season 9-2 and made the play-in game where they defeated Minnesota before dispatching the Grizzlies in six games.\n\n\r\n              “Our laundry list has been simplified,” Ham said. “We know that nothing else matters if we don't take care of our own business. You feel the playoff smell in the air. The playoffs and the postseason are rapidly approaching.”\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Indiana on Friday night.\n\n\r\n              Grizzlies: At Orlando on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995481.860349
}