{
  "game_id": "0021500833",
  "espn_id": "400828720",
  "date": "Feb 22, 2016",
  "matchup": "DET @ CLE",
  "headline": "Jackson's 23 points pace Pistons to 96-88 win over Cavaliers",
  "body": "CLEVELAND -- The Pistons canceled a trade and then stopped LeBron James and the Cavaliers.\nReggie Jackson scored 23 points, Kentavious Caldwell-Pope added 19 and Detroit withstood Cleveland's late comeback for a 96-88 win Monday night to snap a five-game losing streak.\nOne day after allowing New Orleans center Anthony Davis to score 59 points with 20 rebounds, the Pistons beat the Eastern Conference's top team for the second time this season and earned their first win since Feb. 4.\n\"It had been a long time since we got a win -- coming up on three weeks -- so we definitely needed it,\" coach Stan Van Gundy said. \"You've seen it all year: We're capable of beating anybody and we're capable of losing to anybody. The guys felt good about themselves tonight, and I think everyone played well defensively the whole game.\"\nAndre Drummond added 15 rebounds for the Pistons, who let an 18-point lead in the fourth quarter dwindle to six before putting away the Cavs and ending their five-game winning streak.\nKyrie Irving scored 30 and Kevin Love 24 for Cleveland, which had an off night after looking so impressive in a win at Oklahoma City on Sunday. James scored just 12 points -- 13 below his average -- and went 5 of 18 from the floor, missing all four 3-point tries and committing six turnovers.\n\"I probably should have had about 12 of them,\" said James, who acknowledged lacking energy on the back end of a back-to-back.\nFollowing the game, Irving revealed he played only 9 minutes Sunday against the Thunder after being bitten by bed bugs in his Oklahoma City hotel.\n\"I was freaked out,\" he said.\nTobias Harris, acquired from Orlando in a trade last week, scored 14 in his first start for the Pistons, who before the game rescinded their three-team trade last week with Houston and Philadelphia because not all the players involved were cleared medically.\nThen, the Pistons went out and rejected the Cavs.\n\"It feels great to get the win,\" Harris said. \"The best thing was the effort, the energy level we showed against one of the very best teams. We didn't get discouraged when they made some tough shots. We just kept telling each other, `Let's keep our pace, let's keep running.' We just kept playing our pace.\"\nDetroit opened the fourth quarter with a 13-2 run to take an 18-point lead on Caldwell-Pope's short jumper with 6:31 remaining.\nAfter going through the motions most of the night, the Cavs finally awakened and reeled off 10 straight points to get to 88-82. But Jackson responded by dropping a floater in the lane, and Caldwell-Pope made the game's biggest play, stripping a driving James and then taking the ball the length of the floor for a layup, a bucket that brought Pistons radio commentator Rick Mahorn -- one of Detroit's original Bad Boys -- out of his seat.\nJackson credited the Pistons with digging deep to get the win.\n\"We're desperate, man,\" he said. \"We've got to be hungry for every last win after dropping the last five. We've been trying to find a way to battle and be resilient, and I couldn't be more proud of the guys for stepping up with us so short-handed.\"\nLEBRON'S REST\nCavs coach Tyronn Lue said he considered resting James on the second game of a back-to-back.\n\"I should have,\" he said.\nJames has only missed one game this season, and Lue plans to sit his superstar if and when the Cavs lock up the conference title.\nTURNOVER CITY\nThe Cavs were their own worst enemies in the first half, committing 12 turnovers that the Pistons converted into 16 points, enabling Detroit to open a 56-49 halftime lead. Cleveland finished with 18 turnovers.\nROOKIE INJURY\nDetroit's Stanley Johnson strained his right shoulder in the second half. Van Gundy said the forward will be re-evaluated on Tuesday. Reggie Bullock will take Johnson's spot in the rotation.\nTIP-INS\nPistons: F Anthony Tolliver (right knee) was diagnosed with a Grade 1 sprain and will miss two to four weeks. He was hurt Sunday against New Orleans. . Van Gundy said there are no immediate plans to fill the team's one open roster spot. . Detroit came in holding ninth place in the Eastern Conference, 2 1/2 games behind Chicago for the final playoff spot.\nCavaliers: F Channing Frye scored two points in 9 minutes of his debut for Cleveland. ... G Iman Shumpert missed his second straight game with a sprained left shoulder. It's the same one he injured last season, when he missed six weeks. ... G Mo Williams plans to have his sore left knee examined by renowned orthopedist Dr. James Andrews in Florida on Tuesday. Williams has been bothered by the knee for two months. He hasn't played since Feb. 10, when he missed all four shots in a win over the Lakers.\nUP NEXT\nPistons: Host Philadelphia on Wednesday.\nCavaliers: Host Charlotte on Wednesday.\n---\nThis story has been corrected to show that Irving played 9 minutes Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994910.943268
}