{
  "game_id": "0021800216",
  "espn_id": "401070897",
  "date": "Nov 16, 2018",
  "matchup": "TOR @ BOS",
  "headline": "Kyrie scores 43, Celtics beat Raptors 123-116 in OT",
  "body": "BOSTON --  Kyrie Irving had 11 straight Boston points down the stretch and scored 17 in all in the last 8:06 of the fourth quarter.\n\nThen in overtime, he really turned it on.\n\nThe Celtics guard made or assisted on every basket in the extra period, finishing with 11 assists and a season-high 43 points on Friday night to lead Boston to a 123-116 victory over the Toronto Raptors.\n\n\"Man, he made some shots tonight where you're just like, `Wow,\" forward Gordon Hayward said. \"You catch yourself being a fan. When he gets into that mode, the whole arena knew where we were going, and so did the Raptors. They just couldn't stop him.\"\n\nIt was the first time Irving has scored at least 40 points with 10 or more assists in a game. He was the first player do it in the NBA this year, and the first Celtics player since Antoine Walker in 2001.\n\n\"Kyrie did a great job in the fourth quarter knocking down shots,\" said Kawhi Leonard, who scored 31 points and had a season-high 15 rebounds for Toronto. \"We fought hard tonight, they played a better game and we've just got to keep playing better.\"\n\nJayson Tatum had 21 points and seven rebounds for the Celtics, who evened the season series at one game apiece against the only team to finish above them in the Eastern Conference last season. The home team has won nine straight matchups.\n\nSerge Ibaka scored 21 and Pascal Siakam had 16 points and nine rebounds for the Raptors, who have lost three straight since opening the season with 12 victories in their first 13 games. Toronto never led in overtime.\n\n\"It was just a veteran game out there, just great competition for a Friday night in the NBA,\" Irving said. \"You've got to appreciate that, two great teams going at it. And I'm pretty sure we'll see them down the road.\"\n\nHEY, HEY!\n\nHayward scored 15 points and had five rebounds and five assists in a team-high 39 minutes -- by far his biggest workload since the injury that knocked him out in the first quarter of the first game last season.\n\n\"I was wondering if they were going to take me out of the game,\" he said. \"Happy that he left me in. It felt good to play that many minutes. It's been such a long time. It was a good confidence-builder.\"\n\nHayward hit a pair of free throws to open the overtime, Ibaka answered with a jumper and from there it was all Celtics. Hayward scored on a pass from Irving, then Irving rescued Tatum from a near-turnover and drove for the layup to give Boston a 113-109 lead.\n\nThe Raptors never got closer than three points after that.\n\n\"Not too often during the regular season we get to have games like this,\" Irving said. \"A great test for your team on both ends of the basketball floor, a great player in that other locker room, the competition and the level of play raises and you've just got to appreciate that.\"\n\nEND OF REGULATION\n\nToronto led by eight early in the fourth quarter and still had a 107-103 lead with 90 seconds left. But Tatum dunked to cut the deficit to two points and Siakam was called for pushing while going for a rebound, sending Hayward to the line for the game-tying free throws.\n\nLeonard had a chance to win it at the end of regulation, but his long jumper went off the rim.\n\n\"The main thing is we're going to hold it until the very last shot so that nothing bad happens and they can't get a rebound and call a timeout,\" Raptors coach Nick Nurse said. \"It's just man on man and you hope your guy can make the basket and we have a lot of faith in him that he can.\"\n\nDUCK\n\nLate in the third quarter, Kyle Lowry got Tatum in the air with a fake and then tried to duck under him as the Celtics forward came over the top. But Tatum wound up kicking him in the head as he came back down.\n\nLowry went to the floor but remained in the game and made both free throws to give Toronto a 78-68 lead their first double-digit advantage of the game.\n\nTIP-INS\n\nIrving surpassed the 10,000 point and the 2,500 assist milestones. ... After going 1-4 on a road trip, the Celtics have won two in a row at home. ... Toronto's OG Anunoby left the game in the third quarter with a sprained right wrist. ... The Raptors already beat Boston 113-101 on Oct. 19. The teams, which have won 11 of the last 12 Atlantic Division championships, will play twice more.\n\nUP NEXT\n\nRaptors: Visit the Chicago Bulls on Saturday night.\n\nCeltics: Host the Utah Jazz on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994289.948309
}