{
  "game_id": "0022301105",
  "espn_id": "401585733",
  "date": "Apr 03, 2024",
  "matchup": "OKC @ BOS",
  "headline": "Porzingis scores 27, Celtics earn home-court advantage in playoffs with 135-100 win over Thunder",
  "body": "BOSTON -- — Oklahoma City coach Mark Daigneault likened the Celtics' performance this season to that of a Ferrari.\n\n\r\n              Boston's latest victory over the Thunder earned it yet another luxury with the playoffs fast approaching.\n\n\r\n              Kristaps Porzingis had 27 points, 12 rebounds and five blocks, helping the Celtics power past the Thunder 135-100 on Wednesday night to secure the best record in the NBA and home-court advantage throughout the playoffs. \n\n\r\n              Jayson Tatum finished with 24 points and Jaylen Brown added 23 points and seven rebounds for Boston, which won its 11th consecutive home game and improved to 60-16 on the season.\n\n\r\n              \"We deserve it. I think it's possibly going to matter if we follow through with the vision we have for ourselves,\" Porzingis said.\n\n\r\n              Brown likes the progression the team has been making as the regular season winds down. \n\n\r\n              “We're not skipping any steps,\" Brown said. \"Sixty wins. I think we're on track. When the playoffs start, it's back to square one.”\n\n\r\n              Boston coach Joe Mazzulla said the milestone is another achievement his team won't take for granted. But he also said it isn't something he wants them to dwell on. \n\n\r\n              “It's very hard to do. We may never be in this position again,\" Mazzulla said. \"We talked about it as a team. We talked about it before the game, to try to treat this game as the clincher. To kind of put that on ourselves to be able to do that. I think it was important for us to simulate that. ... We should enjoy it tonight, and when wake up tomorrow — nobody cares.”\n\n\r\n              Brown was questionable heading into the game with a sprained left hand. He said he got it examined after Boston's win at Charlotte on Monday and described it as a sprained ligament. \n\n\r\n              “I think it’s fine. It’s something I’m not concerned with moving forward,” he said. \"But it bothered me a little bit tonight.”\n\n\r\n              The Celtics trailed for only 62 seconds in the game.\n\n\r\n              Boston led by as many as 16 in the first half before Oklahoma City cut it to six points in the third quarter. Leading by 10 after three, the Celtics opened the fourth with a 12-4 run to stretch their lead to 105-87. \n\n\r\n              Josh Giddey led Oklahoma City with 17 points. Luguentz Dort added 15 points. The Thunder finished with 14 turnovers and were just 5 of 24 from beyond the arc. \n\n\r\n              OKC played without All-Star and leading scorer Shai Gilgeous-Alexander, who sat for the fourth time in five games with a bruised right quadriceps. Jalen Williams missed his second straight with a sprained left ankle. \n\n\r\n              Daigneault said prior to the game that the biggest challenge Porzingis has presented this season with the Celtics is his ability to be both a rim protector and floor spacer on a roster full of shooters. \n\n\r\n              The 7-footer did both in the first half, getting 17 points, nine rebounds and three blocks in 15 minutes. \n\n\r\n              Porzingis also punctuated one of the Celtics’ best offensive sequences. Payton Pritchard dribbled into the paint, was stopped under the basket and threw the ball out to Sam Hauser in the corner. Hauser quickly swung it to Brown as he crossed half court. Brown then drove and flipped a no-look, behind-the-head pass to Porzingis on the wing for his third 3 of the game.\n\n\r\n              The basket gave Boston a 50-34 lead, its largest of the half. The Celtics took a 61-47 advantage into halftime. It marked the 50th time this season they’ve scored 60 or more points in the opening half, tying the franchise record that was set last season. \n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Indiana on Friday.\n\n\r\n              Celtics: Host Sacramento on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996701.296118
}