{
  "game_id": "0021800141",
  "espn_id": "401070822",
  "date": "Nov 05, 2018",
  "matchup": "HOU @ IND",
  "headline": "Harden's late 3 helps Houston rocket past Pacers 98-94",
  "body": "INDIANAPOLIS --  James Harden produced his typical scoring flurry Monday night. His teammates delivered the knockout blow with a staunch second-half defensive effort.\n\nOn a night the league's reigning MVP made a tiebreaking 3-pointer with 36.1 seconds left and closed it out by making four straight free throws, Harden was thrilled to see the Houston Rockets rediscover their winning combination in a 98-94 victory at Indiana.\n\n\"We're doing a really good job of getting stops and making it hard for teams to score,\" he said. \"I'm not worried about our offense. We're a really good offensive team. We're going to make shots. We need a pretty good defensive effort (each night).\"\n\nThe message seems to have sunk in.\n\nWhile Harden did his usual work with 28 points, six assists and five 3-pointers, the improving defense and a healthier roster has helped last season's Western Conference runner-ups punch their way out of an early-season corner.\n\nSince starting 1-5, Houston has won three straight -- all on the road, the last two without the benefit of hitting 100 points. And more help appears to be on the way.\n\nOfficially, the Rockets say they are finalizing the details on a deal to bring back defensive guru Jeff Bzdelik. Unofficially, it looks all but done.\n\n\"Just really happy he's coming back,\" coach Mike D'Antoni said before the game. \"It's great. We can pick up where we left off.\"\n\nWhat Bzdelik will find is a team ready and willing to fight hard as it did again Monday.\n\nAfter trailing for most of the second and third quarters, they finally rallied behind Harden in the fourth quarter and closed it out by shutting down the Pacers.\n\nVictor Oladipo finished with 28 points and made two 3s in the final minute to trim the deficit to 94-93 with 24.7 seconds to go, but the Rockets didn't give up another basket as the Pacers' three-game winning streak ended.\n\n\"We still gave ourselves a chance to win, we just came up short,\" Oladipo said. \"The beauty of it is there is another game on Wednesday.\"\n\nThe Rockets have won three straight in the series though this one required everything they could muster.\n\nWhen P.J. Tucker and Carmelo Anthony knocked down back-to-back 3s midway through the fourth quarter, the Rockets were finally tied at 81.\n\nChris Paul broke the tie with a layup and Harden added a free throw when Pacers coach Nate McMillan was called for a technical foul.\n\nIndiana spent the rest of the 's 3-pointer rattled in with 7:28 left and Carmelo Anthony followed Tucker's basket with another 3, the Rockets tied it at 81. Chris Paul broke the tie with a layup and Harden made a free throw after Pacers coach Nate McMillan drew a technical foul with 4:38 to go.\n\nOladipo tied the score at 90 with the first of his two threes in the final minute, but Harden broke the tie with the last of his 3s, Paul made 1 of 2 free throw to make it 94-90 and Harden closed it out at the free-throw line.\n\n\"It was just a good, spirited win,\" D'Antoni said. \"Those are the ones, until we iron some stuff out, we have to (win), and we haven't been doing that.\"\n\nTIP-INS\n\nRockets: Clint Capela had 18 points and 10 rebounds for his sixth consecutive double-double, a career best. ... Paul took only three shots in a scoreless first half and wound up with nine points and 13 assists. ...... The Rockets were 15 of 47 on 3s and improved to 4-0 this season when outrebounding opponents.\n\nPacers: Lost for the second time at home this season. ...Domantas Sabonis had 17 points and eight rebounds off the bench. ... Oladipo has scored at least 20 in 10 consecutive games. ... Bojan Bogdanovic and Tyreke Evans scored 11 points. Thaddeus Young finished with eight points and 11 rebounds.\n\nIN SYNC\n\nMcMillan is still working to get his offense get in sync.\n\nHe would like to see better ball movement and a quicker tempo, both facets that could have helped against the Rockets. But he wasn't trying to take a cue from their usually high-scoring opponent.\n\n\"We don't want to just get into a run-and-gun game and make it a shootout,\" McMillan said. \"If we have something early (in the possession), we'll take it. If not we want to make them defend it.\"\n\nUP NEXT\n\nRockets: Visit Oklahoma City on Thursday, the fourth stop on a season-long five-game road trip.\n\nPacers: Will try to extend their home winning streak against Philadelphia to nine Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995322.629111
}