{
  "game_id": "0021800008",
  "espn_id": "401070698",
  "date": "Oct 17, 2018",
  "matchup": "TOR vs. CLE",
  "headline": "Newcomer Kawhi Leonard scores 24 as Raptors beat Cavaliers",
  "body": "TORONTO -- Kawhi Leonard helped the Toronto Raptors extend their success in season-opening games.\nLeonard had 24 points and 12 rebounds in his Toronto debut, Kyle Lowry scored 27 points and the Raptors beat the Cleveland Cavaliers 116-104 on Wednesday night, extending their streak of opening-night victories to six.\n\"I felt good,\" Leonard said. \"I'm happy we came out and got a win. I came out of the game healthy, so it's a win-win for me.\"\nAcquired from the Spurs in a July blockbuster that sent four-time All-Star DeMar DeRozan to San Antonio, Leonard was introduced to a thunderous ovation, the final Raptors starter to have his name announced to the capacity crowd of 19,915.\n\"It was great,\" Leonard said. \"They gave me some more energy.\"\nLeonard played 37 minutes in his first competitive game since January with the Spurs. The two-time NBA Defensive Player of the Year was limited to nine games last season because of a quadriceps injury.\n\"It's fun to watch [him], it's fun to play with [him],\" said guard Danny Green, who was traded to Toronto along with Leonard. \"I'm happy for him, that he's playing again.\"\nFred VanVleet scored 14 points, Pascal Siakam had 13 and Green 11 as the Raptors gave Nick Nurse a victory in his first game as head coach.\n\"It's pretty cool,\" Nurse said. \"It's good to get it done. It was a little bit nerve-wracking there toward the end.\"\nLowry led Toronto with eight assists and shot 5-for-6 from 3-point range.\n\"Kyle was awesome tonight,\" Nurse said.\nToronto is the first team since Miami from 2011 through 2016 to win six straight season openers.\nKevin Love scored 21 points and Cedi Osman had 17 points and 10 rebounds for the Cavaliers.\n\"From the jump, our execution wasn't there,\" Love said.\nCleveland knocked Toronto out of the playoffs in each of the past three seasons, but faces a struggle this season now that former star LeBron James is with the Los Angeles Lakers.\nJordan Clarkson and George Hill each scored 15 points and Rodney Hood had 12 for the Cavaliers, who trailed by as many as 20.\nCleveland had won 15 of the previous 17 meetings between the teams, including 10 straight postseason games.\n\"We didn't play well but they had something to do with that,\" Cavaliers coach Tyronn Lue said of Toronto. \"This is going to be a top team in the East, a top 1- or 2-seed.\"\nLeonard missed his first three shot attempts but made three of his next four to score a team-high six points in the opening quarter. Lowry and Siakam each scored five in the first as Toronto led 28-25 after one.\nLeonard added six more points in the second quarter and Lowry had five as Toronto made five of 10 from 3-point range to open a 60-47 lead at halftime.\nLowry and Leonard each scored nine points in the third, with Lowry making three from long range, as Toronto took a 90-75 lead into the fourth.\nQUOTABLE\nA Raptors assistant the past five seasons, Nurse cracked a joke when asked before the game about his journey to becoming a head coach.\n\"For five years, I had a thousand people telling me I was going to be a head coach in the NBA, and when I got the job those same thousand people were shocked,\" Nurse said.\nROUGH STARTS\nCleveland is 15-34 all time in its first game of the season, including 6-19 on the road.\nTIP-INS\nCavaliers: F Larry Nance Jr. (right ankle) and G JR Smith (right elbow) were inactive. ... Love shot 5-for-18 from the field and went 10-for-14 at the free throw line. ... Tristan Thompson led Cleveland with 13 rebounds.\nRaptors: Leonard shot 9-for-22. ... G Delon Wright (left thigh) was inactive. . ... F OG Anunoby did not return after being hit in the face early in the fourth. The Raptors said Anunoby suffered a right orbital contusion. ... Siakam got the opening night start ahead of Serge Ibaka, but Nurse has said he intends to vary his starting lineup on a regular basis. ... Ibaka missed his first eight field goal attempts before connecting on a 3 in the fourth. ... Jonas Valanciunas matched a career high with three assists. ... Green stood at center court and thanked fans for their support in a brief pregame address.\nUP NEXT\nCavaliers: Visit Minnesota on Friday night.\nRaptors: Host Boston on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994304.274142
}