{
  "game_id": "0021500138",
  "espn_id": "400828025",
  "date": "Nov 14, 2015",
  "matchup": "DET @ LAC",
  "headline": "Clippers rally for 101-96 win over Pistons",
  "body": "LOS ANGELES --  Every so often, Jamal Crawford gets to remind everyone that he can still be a prolific scorer.\n\nThe 35-year-old veteran had a season-high 37 points, making all 10 of his free throws, and the Los Angeles Clippers beat the Detroit Pistons 101-96 Saturday to end a two-game skid.\n\nInstead of his usual role coming off the bench, Crawford was inserted into the starting lineup because J.J. Redick was sidelined. He made the most of it, providing the Clippers with some offensive firepower after they stumbled out of the gate.\n\n\"We just needed to win,\" Crawford said. \"I never really lose confidence in myself.\"\n\nNeither do the Clippers, who added several new players to their bench over the summer.\n\n\"I really commend him for being as old as he is and ready to play at all times,\" kidded DeAndre Jordan. \"He really gives guys fits.\"\n\nBlake Griffin scored 34 points, including a crucial jumper with 17 seconds left on a pass from Crawford. Jordan finished with 10 points and 16 rebounds for the Clippers, who were without injured Chris Paul.\n\nGriffin and Crawford have developed a well-honed chemistry in their years together.\n\n\"At any moment he can catch a spark and just go,\" Griffin said.\n\nErsan Ilyasova scored 20 points, Andre Drummond had 18 points and 19 rebounds, and Reggie Jackson added 20 points in Detroit's third straight loss. The Pistons have dropped nine in a row to the Clippers.\n\n\"I felt like we had control and just didn't finish it,\" Jackson said. \"They just found a way to get hot. Jamal Crawford is one of the best scorers in the league. He found a way to get the ball in the basket and was 10 for 10 on free throws. We've got to find a way as a team to get stops.\"\n\nWith the Clippers leading 95-94, Paul Pierce missed and Griffin scrambled for the rebound. As he was falling out of bounds on the baseline, he threw the ball off Ilyasova to retain possession. Griffin then hit a 20-footer to extend the lead to 97-94.\n\nJackson made a pair of free throws that cut the Clippers' lead to one with eight seconds left. Detroit was forced to foul Crawford, who made both for a 99-96 lead.\n\n\"He played great, but I should have been able to come up with something that would have made it a little tougher,\" Detroit coach Stan Van Gundy said. \"You knew when those guys were out that it was going to be Crawford and Blake Griffin. We've seen it for years in this league.\"\n\nDetroit's Kentavious Caldwell-Pope missed a potential tying 3-pointer with four seconds to go. Crawford got fouled and went back to the line where he made both to seal the win.\n\nThe Clippers trailed by 17 in their first day game of the season before taking an 81-80 lead into the fourth. Los Angeles didn't lead by more than four points for much of the period when it was tied twice.\n\nThe Pistons opened the third on a 12-8 run to extend their lead to 72-59.\n\nCrawford and Griffin took over from there, leading the Clippers on a 22-8 spurt that gave them their first lead, 81-80, since early in the game. Crawford had 12 points, Griffin added seven and Pierce had a 3-pointer. Detroit was held without a field goal over the final 6  1/2 minutes of the third.\n\nDetroit started the second quarter with a 16-2 run, including seven by Stanley Johnson, who dunked off his own steal and followed with a 3-pointer, for a 44-27 lead.\n\nTIP-INS\n\nPistons: Their last win against the Clippers was on Nov. 12, 2010. ... They have lost four of six.\n\nClippers: Paul sat out his third game because of a sore right groin. ... Redick, who hurt his back at Dallas on Wednesday, missed his second straight game. ... Pierce made his first start as a Clipper, while Crawford made his first start of the season.\n\nBREAK TIME\n\nThe Clippers have four days off before hosting Golden State on Thursday. It's their longest break after playing 10 games in the season's first 2  1/2 weeks. Until now, they've never had more than two days off between games, which leaves little time to practice or heal injuries.\n\n\"We've got a lot of work to do,\" coach Doc Rivers said. \"We have to be better than that.\"\n\nROOKIE ADJUSTMENTS\n\nDetroit's Stanley Johnson has come off the bench in all of his first nine NBA games. The rookie out of Arizona had nine points and four rebounds in 20 minutes, impressing Clippers coach Doc Rivers who predicted a big future for the 19-year-old forward.\n\n\"It's probably a little harder for him than he thought it was going to be,\" Van Gundy said. \"He's had nights where he's played real well and he's had other nights where he hasn't played well at all. He's certainly getting an opportunity, so we'll see where it goes.\"\n\nUP NEXT\n\nPistons: At Lakers on Sunday.\n\nClippers: Host NBA champion Golden State on Thursday. They lost to the Warriors 112-108 in a road game on Nov. 4.",
  "source": "espn_api",
  "crawled_at": 1764994954.640512
}