{
  "game_id": "0021300093",
  "espn_id": "400488966",
  "date": "Nov 09, 2013",
  "matchup": "POR @ SAC",
  "headline": "Aldridge, Matthews lead Trail Blazers past Kings",
  "body": "SACRAMENTO, Calif. --  Even with standout point guard Damian Lillard experiencing a rare off game, the Portland Trail Blazers still had enough offense to beat the Sacramento Kings.\n\nLaMarcus Aldridge had 22 points and 14 rebounds, Wesley Matthews scored 21 points, and the Blazers beat the Kings 96-85 on Saturday night for their fourth win in five games.\n\nLillard, last year's rookie of the year, had four points on 1-of-15 shooting. He did contribute six rebounds and six assists.\n\n\"It will happen occasionally, it was one of those nights when the shots didn't go in,\" said Lillard, who scored 22 points in Friday's win at home against the Kings. \"We have a deeper team this year and guys can pick up the slack. That's what makes us a better team.\"\n\nPortland's offense flowed well enough that it seemed at times that Lillard's scoring wasn't even missed. The Blazers continued their early-season trend of shooting well from long distance, making 9 of 20 attempts from 3-point range and only had 12 turnovers.\n\nOne of those players making shots was Matthews, who led the Blazers in the third quarter. Matthews made three 3s and had 19 of his 21 points in the second half.\n\n\"Wes is playing at a high energy, particularly on offense,\" Portland coach Terry Stotts said. \"He's shooting the ball well and picking up where he left off last year before he got hurt.\"\n\nRobin Lopez had 12 points and 14 rebounds and Nicolas Batum also scored 12 points to help the Blazers sweep the home-and-home series with the Kings. Portland beat the Kings at home, 104-91 on Friday night.\n\nIt's been a troubling start to the season for the Kings, who have lost five straight since beating Denver in the season-opener.  The statistic that stood out in the latest loss was getting outrebounded by the Blazers 52-33.\n\n\"It's not about back-to-backs. In this league you can't be too inconsistent; you need to be a pro for 48 minutes,\" King guard Greivis Vasquez said. \"You've got to hate losing, You can't accept losing.\"\n\nDeMarcus Cousins had 15 of his 33 points in the fourth quarter and also grabbed 12 rebounds to lead the Kings. Cousins had 35 points in Friday night's game in Portland.\n\nBen McLemore scored 13 points and Isaiah Thomas had 12 points for the Kings, who had only 54 points through three quarters before outscoring Portland 31-27 in the fourth.\n\nKings rookie head coach Michael Malone has bemoaned the team's lack of defensive effort this season and pointed to rebounding as a key element in yet another loss.\n\nMalone said after the game that lineup changes could take place for Wednesday's game against Brooklyn.\n\n\"I'm embarrassed. Every night it's the same thing,\" Malone said. \"We finally get a night where we defend at a decent level, but we can't rebound. We got outworked on the glass. I think we've got a lot of guys who just care about themselves on this team. Changes will be made before we play on Wednesday.\n\nPortland had a 22-point lead early in the fourth quarter. However, Sacramento rallied as a three-point play by Cousins and a fast-break layup by Jimmer Fredette cut the deficit to 85-77 with 4:29 remaining.\n\nBatum ended a string of bad possessions by the Blazers, hitting a 3-pointer with 1:36 left to push the lead to 92-82.\n\nFollowing a quiet first half, it was Matthews doing the delivering in the third quarter. He made two 3s and scored 12 points in helping the Portland outscore Sacramento 24-16 and take a 69-54 lead into the fourth.\n\n\"Everybody talks about LaMarcus and Lillard, but Wesley Matthews is the guy who has been playing very well for them,\" Malone said. \"He shoots phenomenal from the field and the 3-point line.\"\n\nThe Kings missed numerous shots in the third when they shot 8 for 23 and were outscored 17-8 in the final five-plus minutes of the period.\n\nAldridge made an assortment of medium-range jumpers and had 16 points and 11 rebounds in the first half for the Blazers, who led 45-38.\n\n\"With a back to back I knew I would be tired down the stretch, so I wanted to come out aggressive early and I got rolling a bit,\" Aldridge said.\n\nCousins picked up two early fouls and went to the bench with 6:27 left in the first quarter. He played only 10 first-half minutes.\n\nGame notes Kings reserve guard Fredette entered the game late in the first quarter and again in the fourth. He had four points in 19 minutes while playing in only his second game this season. His only other playing time was three minutes in reserve role against Golden State. ... Thomas Robinson, the Kings' top draft pick in 2012, is now a second-year reserve forward for the Blazers and is playing for his third NBA team. He had five points in 12 minutes. . Kings starting forward John Salmons played 24 minutes, took two shots and was scoreless. . Both Mo Williams and Dorelll Wright played well off the Portland bench and scored eight points each.",
  "source": "espn_api",
  "crawled_at": 1764993027.370833
}