{
  "game_id": "0021901236",
  "espn_id": "401224691",
  "date": "Jul 31, 2020",
  "matchup": "MIL vs. BOS",
  "headline": "Antetokounmpo, Bucks return with 119-112 win over Celtics",
  "body": "LAKE BUENA VISTA, Fla. --  Giannis Antetokounmpo appeared on his way out of the game. Moments later, he was instead on his way to the foul line.\n\nA replay overturned what would have been the NBA's MVP sixth foul with 1:28 left and he made the most of his second chance, helping the Milwaukee Bucks beat the Boston Celtics 119-112 on Friday night.\n\nAntetokounmpo had 36 points, 15 rebounds and seven assists in the Bucks' first game in the restart. Milwaukee improved the NBA's best record to 54-12 and moved within a victory of clinching the top seed in the Eastern Conference for the second straight year.\n\nIt appeared the Bucks would have to do it without the Greek Freak when Marcus Smart slid in front of a driving Antetokounmpo as he scored in the lane. A charge was called but eventually overturned, with Smart saying the official explanation from referees was that he was too late.\n\n\"Quite frankly, I think we know all what that was all about. Giannis' sixth foul and they didn't want to get him out,\" Smart said. \"Let's just call that spade a spade and that's just what it is.\"\n\nThe Bucks disagreed.\n\n\"I felt like he was moving on the last play but either way if it was a charge, if it was not a charge, I'm happy that we got the win and I'll learn from the play,\" Antetokounmpo said.\n\nAntetokounmpo made the free throw to make it 110-107. Khris Middleton then knocked down a 3-pointer for a six-point advantage.\n\nMiddleton added 18 points for the Bucks, who played without Eric Bledsoe and Pat Connaughton while they work on their conditioning after testing positive for the coronavirus. Marvin Williams sat out with a strained left groin.\n\nSmart scored 23 points for the Celtics and Jaylen Brown had 22, but star forward Jayson Tatum had a nightmarish restart. He had five points on 2-for-18 shooting -- though he actually only made one basket.\n\nKemba Walker scored 16 points but played just 19 minutes as the Celtics look to keep the All-Star guard healthy after he's been battling a sore knee.\n\nMilwaukee had lost its final three games before the season was suspended in March but came back looking like the team that otherwise overpowered opponents all season. The Bucks broke to a 17-2 lead and should have been pitching a shutout. The lone Boston basket came when Antetokounmpo and Wesley Matthews tipped in Walker's missed 3-pointer. Tatum was given credit for the basket as the closest Celtics player.\n\n\"I thought we had a great mindset coming out in the first five minutes,\" Bucks center Brook Lopez said.\n\nTIP-INS\n\nCeltics: Gordon Hayward scored 17 points and Daniel Theis had 13 points and 12 rebounds. ... Boston fell to 3-8, counting playoffs, against the Bucks the last two seasons. Milwaukee eliminated the Celtics in five games in last year's East semifinals.\n\nBucks: Lopez had six blocked shots. ... Coach Mike Budenholzer said he believed Williams' injury wasn't serious and hoped the forward could be available soon. He thinks Williams was hurt during the second scrimmage and felt sore the next morning.\n\nAWARD WINNERS\n\nThe game featured all the the monthly award winners in the Eastern Conference this season. Antetokounmpo won for October/November, December and January before Tatum earned the first of his career in February.\n\nUP NEXT\n\nCeltics: Play Portland on Sunday.\n\nBucks: Play Houston on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996125.391211
}