{
  "game_id": "0022000720",
  "espn_id": "401307509",
  "date": "Mar 30, 2021",
  "matchup": "ORL @ LAC",
  "headline": "Magic rally in fourth, snap Clippers' six-game win streak",
  "body": "LOS ANGELES -- — Chuma Okeke scored 18 points and the Orlando Magic rallied in the fourth quarter to snap Los Angeles' six-game winning streak Tuesday night, defeating the Clippers 103-96.\n\n\r\n                    The Magic didn't have the lead until late in the fourth quarter and went on a 17-3 run to close the game and get their first road win since Feb. 12, ending a seven-game skid. Kawhi Leonard made a pair of free throws to give the Clippers a 93-86 lead with 2:36 remaining before the Magic scored 11 straight points to take the lead. \n\n\r\n                    Terrence Ross tied it at 93 with 1:46 remaining on two free throws, and Wendell Carter Jr. put the Magic in front with 1:10 remaining with a tip-in after James Ennis III missed a layup, making it 95-94.\n\n\r\n                    “This league is all about wins. We took a great step forward in the right direction,” Carter said. “It definitely is a confidence booster going up against one of the best teams in the Western Conference and getting a win on the road.”\n\n\r\n                    While the Clippers are one of the league's top teams, the Magic are a squad in transition. They traded five players — including their top three scorers — in three separate deals during last Thursday's trade deadline.\n\n\r\n                    Coach Steve Clifford hasn't had much time to get some of the players acquired up to speed, but two had good games against the Clippers. Otto Porter Jr. scored 13 points, including eight in the final quarter, and Carter had 11 points.\n\n\r\n                    “We have been a little bit limited in this stretch due to being on the road, but continue to add things, even if it is teaching them in a ballroom,” Clifford said. “This is the style we are going to have to play. We have to defend and be smart.”\n\n\r\n                    Besides holding the Clippers to 32.7% shooting in the second half (16 of 49), the Magic outscored LA by 18 in the paint in the third and fourth quarters (36-18) as well as having a 15-2 advantage in fast-break points.\n\n\r\n                    Orlando made 22 of its 25 free throws for the game, including 11 of 13 in the fourth quarter.\n\n\r\n                    Leonard scored 28 points for the Clippers. Luke Kennard added 17 points and Ivica Zubac tallied his 10th double-double of the season with 14 points and 13 rebounds.\n\n\r\n                    After a 24-point win over Milwaukee on Monday night, and with Denver up next on Thursday, coach Tyronn Lue thought that his team was winded in the final 12 minutes.\n\n\r\n                    “I thought we struggled from the beginning, honestly. But when you’re down guys and you’re on a back-to-back, I think it’s just tough, trying to keep guys minutes down as much as we could.,\" he said. \"We missed a lot of shots and they got out in transition in the second half.” \n\n\r\n                    The Clippers scored the game’s first 10 points — including a pair of 3-pointers by Kennard — and extended their lead to 16 points with under four minutes remaining in the second quarter.\n\n\r\n                    LA led 51-37 at halftime on the strength of shooting 52.5% in the first half (21 of 40), but struggled in the third quarter, going 2 of 13 from beyond the arc as Orlando got within 73-70 at the end of the quarter.\n\n\r\n                    The Clippers were 16 of 49 from the floor in the second half, including 6 of 22 on 3-pointers.\n\n\r\n                    “I felt like we got some good shots, got some good looks in that second half that just didn’t fall,\" Leonard said. \"But obviously, just being more aggressive, attacking us when we’re missing shots, getting out in transition. They kept fighting. They didn’t quit.”\n\n\r\n                    TIP INS\n\n\r\n                    Magic: Ross played in his first game after missing the last seven due to a sore right knee and scored 15 points in 26 minutes. ... The 66 points by Orlando in the second half is tied for second most it has had in the third and fourth quarters this season. It had 67 against Washington on Dec. 26.\n\n\r\n                    Clippers: Nicolas Batum tied a season high with 10 rebounds. ... Paul George missed his second straight game because of right foot soreness. He has been out for 13 games this season. ... Marcus Morris Sr. (right calf contusion) did not play after scoring 25 points in Monday's win over Milwaukee. ... Rajon Rondo (right adductor soreness) has yet to play since being acquired from Atlanta last week, but Lue said Rondo and Patrick Beverley have been doing some on-court work.\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Travel to the New Orleans on Thursday. Orlando swept the season series last season.\n\n\r\n                    Clippers: Host Denver on Thursday. LA won this season's first meeting 121-108 on Christmas Day.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997583.081462
}