{
  "game_id": "0021500458",
  "espn_id": "400828345",
  "date": "Dec 28, 2015",
  "matchup": "LAL @ CHA",
  "headline": "Walker's 38 points lift Hornets past Lakers, 108-98",
  "body": "CHARLOTTE, N.C. -- On a night when Charlotte Hornets owner Michael Jordan paid tribute to Kobe Bryant, it was Kemba Walker who stole the spotlight.\nWalker scored 18 of his 38 points in the fourth quarter, and the Hornets defeated the Los Angeles Lakers 108-98 Monday night in Bryant's final game in Charlotte against the team that drafted him -- and promptly traded him -- nearly 20 years ago.\nCody Zeller had 16 points and eight rebounds, and Nicolas Batum added 15 points and 11 assists for the Hornets, who have won two straight.\n\"I just wanted to win. It was great to play against Kobe one last time in this arena, but it was also great to beat him,\" Walker said. \"I didn't want to be on the other end of him getting that W.\"\n\nBryant, who received a taped message from Jordan before the game, finished with 20 points on 5-of-20 shooting.\nJordan didn't attend the game, but congratulated Bryant on an \"unbelievable career\" during a message that was played on the arena's scoreboard before tip-off. Jordan went on to cite Bryant's \"competitive drive\" the first time the two played against each other in 1996 and called it \"invigorating.\"\n\"You have been a big help to the game of basketball,\" Jordan said. \"You helped the NBA. You helped promote and I'm pretty sure you have fans all over the world. I am a big fan. I still love watching you play and I am very happy for you and what you have accomplished in the game.\"\nThe Hornets drafted Bryant out of high school with the 13th overall pick in 1996, but traded him to the Lakers in a deal that brought Vlade Divac to Charlotte.\n\"It was awesome,\" Bryant said of Jordan's message. \"We talk pretty often. But it was interesting to see my teammates before the game. Julius Randle was like, `That's amazing. That's Michael Jordan.\"\nBryant, set to retire after the season, said he spoke to Jordan personally before the game. He said Jordan was on vacation.\n\"He enjoys his vacation time,\" Bryant said. \"I told him I was a little jealous. And he said, `You'll be here soon.\"\nBryant was just 3 of 12 from 3-point range and couldn't rally the Lakers late.\nHe managed to pull Los Angeles to 102-95 with a 3-pointer with 1:02 left -- his first field goal of the second half -- but Walker answered with a long 3 from the left wing.\nBryant left the game a few seconds later with the sold-out crowd chanting \"Kobe! Kobe!\"\nLakers coach Byron Scott said he's never seen crowds chant for an opposing player the way they have this year for Bryant.\n\"The fans are showing him a lot of love -- and rightfully so,\" Scott said. \"He's put in 20 hard years and he's given everything he's got every single night. I think it's a beautiful thing.\"\nTIP-INS\nLakers: Were outrebounded 46-41. ... Have lost four straight.\nHornets: Now 13-1 when scoring 100 points. ... Shot just 6 of 25 on 3-point attempts. ... Outscored the Lakers 54-44 in the paint. ... Marvin Williams had 11 rebounds.\nKEEPING HIM IN\nHornets coach Steve Clifford kept Walker in the game to start the fourth quarter and didn't take him out, a strategy that paid dividends.\n\"We were up four and he said, `I'm good,\" Clifford said. \"We can't keep doing that with him and Nic (Batum), but at this part of the season where you want to get a cushion, especially with your January (schedule), you leave him in there and let him go.\"\nIt was Walker's fourth 30-point game this season.\nSTEPPING UP\nZeller has put in solid back-to-back games for the Hornets while starting at center in place of Al Jefferson, who is still working back into shape after an injury and a five-game suspension.\n\"He creates so much offense for his teammates with his screening and his ball movement,\" Clifford said of Zeller.\nTHERE TO SEE KOBE\nCarolina Panthers linebacker Luke Kuechly was on hand to watch Bryant's final game in Charlotte, along with teammates Devin Funchess and Roman Harper, who sported a Bryant jersey.\nUP NEXT\nLakers: At the Boston Celtics on Wednesday night.\nHornets: Host the Los Angeles Clippers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994291.6676538
}