{
  "game_id": "0021800221",
  "espn_id": "401070902",
  "date": "Nov 16, 2018",
  "matchup": "POR @ MIN",
  "headline": "Wolves beat Blazers for 3rd straight win since Butler trade",
  "body": "MINNEAPOLIS --  Kevin Garnett showed up courtside, and that wasn't the only surprise in Minnesota on Friday night.\n\nIn their first week without erstwhile defensive stalwart Jimmy Butler, the new-look Timberwolves locked down one of the Western Conference's top teams.\n\nAndrew Wiggins scored 23 points, Derrick Rose had 17 and the Wolves won their third straight game since trading Butler by beating the Portland Trail Blazers 112-96 on Friday night.\n\nWearing a new purple-and-black alternate jersey on a Prince-themed night, Garnett got the crowd going when the video board showed him sitting below the basket. Then the home team kept them cheering with a defensive effort that would've made the Wolves icon -- a ferocious defender in his prime -- proud.\n\n\"It was great to see him,\" Karl-Anthony Towns said. \"It was a long conversation with me and him to get him to come. So I'm happy he came and we played really well as a team.\n\n\"All he wants to do is see Minnesota succeed, so I'm just happy we gave him something to cheer about.\"\n\nThe Wolves entered the game allowed opposing teams to score an average of 116.2 points per game. They held the Blazers -- who were averaging 115.9 per game -- to their season low.\n\nTowns and Robert Covington each had 14 points for the Wolves, who are 7-1 at home and 3-0 since trading the disgruntled Butler to Philadelphia on Monday.\n\nRose cautioned against reading too much into the success.\n\n\"We're still trying to figure things out,\" he said. \"It's always great to go 3-0, and we're just trying to keep it going, taking it one game at a time.\"\n\nThe Timberwolves' lineup had a balanced night, with all five starters scoring in double figures.\n\nIt was a stark difference from the last time the teams met nearly two weeks ago, when the Blazers held Minnesota to 81 points -- the lowest point total in the NBA this season. The Wolves were without Butler, Jeff Teague and Rose for that game.\n\n\"I just think they have a new feel, a new lease on life in a sense,\" Evan Turner said. \"Anytime you get a trade and things like that, they feel good. They played well.\"\n\nLOSING ON THE TRAIL\n\nThe Blazers have their first losing streak of the season -- not the start they wanted for their six-game trip.\n\nCJ McCollum had 18 points and Damian Lillard added 16 for Portland, which never led. The Blazers got within six in the third quarter before Minnesota closed the period on a 21-11 run by attacking the basket. The Blazers committed 18 turnovers, leading to 22 Wolves points.\n\n\"The ball is in my hands a lot and the team counts on me to take care of the ball and make sure that we get quality possessions. I didn't do a great job of that,\" said Lillard, who had five turnovers.\n\nTHE COLOR PURPLE\n\nThe Wolves debuted their \"city edition\" uniforms that pay homage to hometown music legend Prince, who filmed his iconic nightclub scenes of the 1984 movie Purple Rain across the street from where Target Center was later built. Prince music played all night.\n\n\"I know our players are really excited about the uniforms and the night. It's a great way to honor Prince,\" coach Tom Thibodeau said.\n\nTIP-INS\n\nTrail Blazers: Lillard had five assists to pass Damon Stoudamire (3,018) for third on the team's career list. He has 3,020 for his career. ... G Seth Curry sat out with a bruised right knee from the first quarter of Wednesday night's loss to the Lakers. Curry said Thursday his goal was to return during the team's current six-game road trip.\n\nTimberwolves: Taj Gibson had a season-high five assists, and Teague had a game-high eight. . F Anthony Tolliver didn't play for the second straight game. He told local media Friday that Thibodeau didn't talk to him about not playing in Wednesday night's win against New Orleans. Thibodeau, known for playing with a short bench, defended the decision to not play the usually reliable veteran. \"If you try to play too many then everyone plays poorly. So you try to make a decision, you gather information and it usually works out. You're going to need everyone over the course of the year.\"\n\nUP NEXT\n\nTrail Blazers: Visit Washington on Sunday.\n\nTimberwolves: Host Memphis on Sunday.\n\n---\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995198.3358898
}