{
  "game_id": "0021500316",
  "espn_id": "400828203",
  "date": "Dec 08, 2015",
  "matchup": "OKC @ MEM",
  "headline": "Durant scores 32 as Thunder beat Grizzlies 125-88",
  "body": "MEMPHIS, Tenn. -- Oklahoma City's efficient offense made it a fun night for the Thunder. And a miserable game for the Memphis Grizzlies.\nKevin Durant had 32 points, 10 rebounds and six assists, leading the Thunder to a 125-88 rout of the Grizzlies on Tuesday.\n\"When we play together like that, we make the game easier,\" Durant said. \"We were just playing smooth basketball. It was beautiful to watch. It was a fun game to play.\"\nRussell Westbrook added 13 points and 16 assists as the Thunder built the lead to 35 through three quarters and coasted to their second straight win.\nSerge Ibaka scored 17 for Oklahoma City, and D.J. Augustin had 13. Dion Waiters finished with 12 points.\n\"I think it's the worst loss we've had against them, especially at home,\" said Memphis forward Zach Randolph, who had nine points and 10 rebounds.\nMario Chalmers led Memphis with 19 points, and JaMychal Green and Marc Gasol had 11 apiece. It was the most points given up by Memphis this season.\nThe Thunder lead was large enough that the starters, including Westbrook and Durant, sat out the fourth quarter.\n\"I can't say enough about what Russell did,\" Thunder coach Billy Donovan said. \"In my opinion, he's one of the rare guys in this league that can dominate a game without scoring.\"\nDurant was 11 of 14 from the field and 6 for 6 at the line. He also went 4 for 5 from beyond the arc, leading a 13-for-26 performance from 3-point range for Oklahoma City.\n\"When you look at the numbers, it's pretty simple,\" Memphis coach Dave Joerger said. \"You know one team made shots and the other team struggled to make shots. Our defensive intensity wasn't where it (should have been).\"\nThe Thunder went small while closing the first half on a 13-4 run for a 59-47 lead at the break. Durant was 6 of 8 from the field for 19 points, and Westbrook had a dozen assists in the half.\nOklahoma City opened a 69-51 lead less than four minutes into the third, causing Memphis to call timeout.\nWith 3 minutes still remaining in the third, Westbrook had already matched his season high with 16 assists, helping Oklahoma City increase its advantage to 98-63 entering the fourth. The Thunder outscored the Grizzlies 39-16 in the third.\n\"We played poised,\" Durant said. \"We played under control and a team that usually packs the paint on us, we spread them out, and we were able to make the extra pass. We played tough basketball.\"\nTIP-INS\nThunder: Rookie reserve G Cameron Payne, who is from Memphis, had his high school jersey from Lausanne Collegiate School retired Monday night in a ceremony attended by several of his Thunder teammates. ...In the third quarter, Durant passed Pete Maravich for 105th on the NBA's career scoring list.\nGrizzlies: Memphis did not commit a foul in the second quarter, while Oklahoma City was outscoring the Grizzlies 31-22. ... Memphis entered the game having won four straight at home in the series. ... G Mike Conley was held scoreless, missing all seven of his shots. He did have six assists. ... Gasol said he sprained his left ankle twice in the game.\nRUSSELL'S ASSISTS\nWestbrook finished one shy of his career high of 17 assists accomplished three previous times, the last coming in March against the Heat.\n\"I just read the game,\" Westbrook said. \"The game tells you to pass, that's what you do. You've just got to read the game and play the right way.\"\nBIG LOSSES\nWhen the Grizzlies lose, they routinely don't leave any doubt. Of Memphis' 10 losses this season, eight have been by double digits, including 50 to Golden State, 30 to Cleveland, 20 to San Antonio and Tuesday night's 37-point defeat.\nUP NEXT\nThunder: Host the Atlanta Hawks on Thursday.\nGrizzlies: Visit the Detroit Pistons on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994198.911956
}