{
  "game_id": "0021801195",
  "espn_id": "401071868",
  "date": "Apr 07, 2019",
  "matchup": "TOR vs. MIA",
  "headline": "Heat, needing win, blame ref's inbounds whistle",
  "body": "TORONTO -- Another frustrating finish left the Miami Heat's playoff hopes hanging by a thread.\nAn untimely whistle by an official led to a disjointed final sequence in regulation, and the Heat wound up losing 117-109 in overtime to the Toronto Raptors on Sunday.\nMiami had the ball in the frontcourt with the score tied at 103 and 10 seconds left in the fourth quarter. Official Eric Lewis blew the whistle, and the Heat players started running into position, but Dion Waiters hadn't yet been given the ball for the inbounds pass.\nConfused, the Heat ended up with a broken play at the buzzer. James Johnson missed a jump shot, and Bam Adebayo grabbed the rebound and made a layup, but it came right after the buzzer and didn't count.\nHeat coach Erik Spoelstra said the explanation he received from the officials for the early whistle included \"nothing that was coherent or makes sense.\"\n\"You blow the whistle when you hand the ball to somebody when they're out of bounds, not before,\" Spoelstra said. \"That got us moving, into motion, before that. Then it was just sideways from there.\n\"It's very disappointing that that play was allowed to continue,\" he said. \"From our vantage point, that was a botched play. You just set it again. That happens a million times during the course of an NBA season.\"\nWade, who was supposed to receive the inbounds pass, didn't touch the ball on Miami's final possession in the fourth quarter.\n\"All I know is by the time [I] turned to get it backcourt, Dion still had the ball,\" Wade said. \"It definitely took us out of what we wanted to do.\"\nMiami lost its season-high fourth in a row.\nThe Heat could have guaranteed a postseason berth by winning their final three games. They host Philadelphia on Tuesday and close the regular season at Brooklyn the following day.\n\"We'll need some help,\" Spoelstra said. \"The only thing we control is what we do. We've got to dust this one off, get back to Miami and win the next game.\"\nMiami was in position to be eliminated later Sunday if Orlando defeated Boston, Brooklyn beat Indiana and Detroit beat Charlotte.\n\"Right now, I'm devastated by this loss,\" Wade said.\nWade scored 21 points, and Johnson had 18.\nToronto's Danny Green opened the extra session with a 3, then added a layup to put the Raptors up by five, the biggest margin for either team since the start of the fourth quarter.\nPascal Siakam had 23 points and 10 rebounds, and Kawhi Leonard scored 22 points for Toronto. Norman Powell matched his season high with 23 points, and Green scored seven of his 21 in overtime as the Raptors won their fourth straight over the Heat.\nPowell, who shot 7-for-7, said he enjoyed the intensity of the matchup as Toronto prepares for the playoffs.\n\"These guys are giving us their best performances,\" he said, \"so it takes our game to the next level.\"\nThe crowd of 19,800 rose for a brief ovation when Wade checked in for the first time at 6:18 of the first. The 16-year veteran intends to retire at the end of the season.\nWade scored five points in the opening quarter, and Miami led 26-25 after one. The Heat were up 57-50 at halftime. They took a 79-78 lead into the fourth.\nTIP-INS\nHeat: Adebayo led the Heat with 13 rebounds. ... Miami missed eight of 10 shot attempts in overtime. ... The Heat signed F Yante Maten to a full contract. He had been on a two-way contract.\nRaptors: The Raptors didn't get any points from bench players in the first quarter. ... They finished 32-9 at home. ... Toronto scored at least 110 points for the eighth straight game, matching a franchise record. The Raptors also did it in February 2018.\nTOO EARLY\nSpoelstra also expressed displeasure at the noon tipoff time.\n\"These 12 o'clock tips, they're not easy for anybody,\" he said. \"Get some sleep. Get some rest. These things matter.\"\nLAST (HOME) DANCE\nWade will be celebrated before his final home game Tuesday night, but he said he doesn't know what the team has in store for his farewell.\n\"I know all my family is going to be there,\" he said. \"I'm just looking forward to it, you know, close the chapter.\"\nSHARING IT AROUND\nToronto is the only NBA team with a different player leading in points (Leonard), rebounds (Serge Ibaka), assists (Kyle Lowry) and minutes (Siakam).\nSHIRT OFF MY BACK\nWade swapped jerseys with Leonard following the game.\nUP NEXT\nHeat: Host Philadelphia on Tuesday.\nRaptors: At Minnesota on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994239.04616
}