{
  "game_id": "0022000003",
  "espn_id": "401266804",
  "date": "Dec 23, 2020",
  "matchup": "MIL @ BOS",
  "headline": "Tatum hits big 3 to help Celtics beat Giannis, Bucks 122-121",
  "body": "BOSTON -- — Giannis Antetokounmpo couldn't stop Jayson Tatum from knocking down a “tough, tough, tough” shot. Then the reigning MVP and defensive player of the year missed one of the easiest.\n\n\r\n                    Tatum banked in a fallaway, go-ahead 3-pointer in the final second, and Antetokounmpo missed a potential tying free throw with 0.4 seconds left, allowing the Boston Celtics to escape with a 122-121 victory over the Milwaukee Bucks on Wednesday night in the teams' season opener.\n\n\r\n                    “Ever since I was a kid, I always wanted to be in that position,” said Tatum, who scored 30 points. “If it goes down or not, that’s what I work so hard for. You just want to be in that moment.”\n\n\r\n                    Jaylen Brown scored 33 points for Boston, which entered the fourth quarter leading by 17 points. The Celtics trailed 120-119 when Tatum dribbled the clock down from 8.9 seconds before lofting a high-arcing 3 over Antetokounmpo  that kissed the glass on its way down.\n\n\r\n                    “I think aside from the ball going in the basket, I’m not sure we could have defended Tatum much better than we did,\" Bucks coach Mike Budenholzer said. \"I thought Giannis did a great job individually, great contest. Credit to Tatum, he banked in a 3 at the end of the clock.”\n\n\r\n                    Antetokounmpo called it a “tough, tough, tough 3.” Tatum said the glass wasn't really part of the plan. \n\n\r\n                    “Once I let it go I knew it was going to hit the backboard,” he said. “But I didn’t necessarily try.”\n\n\r\n                    The ensuing inbounds pass was thrown at the rim and Antetokounmpo tried to tip it in, but he was fouled. He made the first foul shot, but bounced the second off the front of the rim.\n\n\r\n                    “Obviously, there’s a bit of a weight on your shoulder because you know if you miss, that’s it for your team,\" said Antetokounmpo, who scored 18 of his 35 points in the fourth quarter. “I’m a winner. I want to do whatever it takes for my team to win. But you learn from every situation that basketball puts you in.”\n\n\r\n                    Khris Middleton had 27 points and 14 rebounds and big offseason acquisition Jrue Holiday scored 25 points for Milwaukee. The Bucks had the best record in the NBA in each of the past two seasons but didn’t make it out of the Eastern Conference finals. \n\n\r\n                    Milwaukee led by nine points, 48-39, midway through the second quarter before Boston rolled off 10 straight points and 19 of the next 23. Boston led 101-84 after three, but Antetokounmpo outscored the Celtics 10-2 over a two-minute span midway through the fourth to cut a 10-point Celtics lead to 109-107.\n\n\r\n                    “We took a good hit and kept ticking,\" Celtics coach Brad Stevens said. \n\n\r\n                    TOMMY POINT\n\n\r\n                    The Celtics observed a moment of silence for Tommy Heinsohn before the game and played a tribute video at the first break for the player, coach and broadcaster who was with the team for more than 60 years and all 17 of its NBA titles. \n\n\r\n                    Heinsohn, who died last month at the age of 86, won eight championships in nine years as a Celtics player from 1956-65. He won three more titles as a coach and was the fourth person inducted in the basketball Hall of Fame as both a player and a coach. \n\n\r\n                    The Celtics lowered eight of their championship banners courtside, picking the ones they deemed to have special meaning to Heinsohn. \n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: During the game, the Bucks exercised their fourth-year team option on guard Donte DiVincenzo for the 2021-22 season. DiVincenzo had 15 points and five assists.\n\n\r\n                    Celtics: Newcomers Jeff Teague scored 19 points in 25 minutes, and Tristan Thompson had 12 points and eight rebounds. \n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Host Golden State on Friday.\n\n\r\n                    Celtics: Host the Brooklyn Nets on Christmas at 5 p.m. It will be Kyrie Irving’s first regular-season game in Boston since leaving the Celtics.",
  "source": "espn_api",
  "crawled_at": 1764997425.9331882
}