{
  "game_id": "0022300555",
  "espn_id": "401585183",
  "date": "Jan 15, 2024",
  "matchup": "HOU @ PHI",
  "headline": "Joel Embiid scores 41 points in return from knee injury. He leads 76ers past Rockets 124-115",
  "body": "PHILADELPHIA -- — Joel Embiid returned from his latest injury to score 41 points and grab 10 rebounds and lead the Philadelphia 76ers to a 124-115 victory over the Houston Rockets on Monday.\n\n\r\n              Embiid had his 16th straight 30-10 game. Tyrese Maxey added 27 points for the Sixers.\n\n\r\n              “I think we got some rhythm, we got some confidence and we didn't have to go too deep into the minutes,” coach Nick Nurse said.\n\n\r\n              Alperen Sengun led the Rockets with 19 points. Dillon Brooks scored 18.\n\n\r\n              The 29-year-old Embiid missed the last three games with left knee inflammation, and the 76ers went 1-2. He had played just two games this month after he missed all four games on the 76ers’ holiday road trip. The Sixers are 3-7 this season without Embiid, the reigning NBA MVP and the two-time defending league scoring champion — who entered Monday’s matinee leading the NBA in scoring at 34.6 points.\n\n\r\n              Embiid’s health is of course crucial to a Philadelphia team hopeful of a deep postseason run.\n\n\r\n              His absences, though, have placed his candidacy for another MVP trophy on the rocks.\n\n\r\n              The new collective bargaining agreement requires players, in most instances, to play in 65 regular-season games to be eligible for awards such as MVP or the All-NBA teams. Embiid, who is playing in his 8th NBA season, has met that threshold only twice — when he played a career-best 68 games in 2021-22, and 66 games last season.\n\n\r\n              He can miss only eight more games out of the final 44 before he is no longer eligible for MVP.\n\n\r\n              “We look at the long run and what's coming up next,” Embiid said. “Hopefully it doesn't swell up again.”\n\n\r\n              When healthy — or, healthy enough — Embiid makes the game look easy and makes the Sixers look like contenders. If his knee still ached on Monday, it didn’t show in a 13-point first quarter. Embiid sure looked fine when he dropped another 13 in the second quarter.\n\n\r\n              Maxey and Tobias Harris hit consecutive 3s in the second quarter for a 42-23 lead, and when Embiid hit one just before halftime, he helped the Sixers take a 66-47 lead into the break.\n\n\r\n              The Rockets missed 10 of 15 3s in the first half and trailed by as many as 28 points.\n\n\r\n              “In general, I don't love our starters' performance, for the most part,” Rockets coach Ime Udoka said. “We got it going a little bit late, but you want to come out with that intensity from the start.”\n\n\r\n              Embiid has scored at least 30 points in 17 straight games. He grabbed his 10th rebound in the fourth quarter and checked out for good with the Sixers up 114-94.\n\n\r\n              Embiid made 12 of 21 shots and 16 of 17 free throws.\n\n\r\n              “He's been a high-level free-throw shooter forever,” Udoka said.\n\n\r\n              UP NEXT\n\n\r\n              Rockets play Wednesday at New York.\n\n\r\n              Sixers go back-to-back with a Tuesday home game against Denver.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995612.055541
}