{
  "game_id": "0021900333",
  "espn_id": "401160975",
  "date": "Dec 07, 2019",
  "matchup": "PHX @ HOU",
  "headline": "Harden has big 4th quarter, Rockets beat Suns 115-109",
  "body": "HOUSTON --  On a night where James Harden's shots weren't falling for three quarters, the Houston Rockets got big performances from those in supporting roles until the star stepped up late to close out the victory.\n\nHarden scored 18 of his 34 points in the fourth quarter and Ben McLemore added 27 points to help the Rockets outlast the Phoenix Suns 115-109 on Saturday night.\n\nHarden had a tough shooting night through three quarters and was 5 of 19 overall and 1 of 10 on 3s with 16 points before getting going in the fourth. The game was tied with about 7 minutes left, and he scored all of Houston's points in a 13-6 run that made it 102-95.\n\n“That's how deep we are,” Harden said. “We have a really good team and guys that can make plays and knock down shots. More importantly we were focused on our defense.”\n\nRussell Westbrook had 24 points, 14 rebounds and 11 assists for his third straight triple-double and sixth this season. Harden finished 8 of 27, 3 of 17 on 3s and made 15 of 18 free throws.\n\nDevin Booker led the Suns with 35 points after scoring a season-high 44 in an overtime victory at New Orleans on Thursday night.\n\nPhoenix coach Monty Williams was proud of his team for staying in it until the very end.\n\n“We have a mentality that we just don't give in,” Williams said. “We're playing young guys that are learning how to play against physical NBA men and that's part of developing.”\n\nThe Suns cut the lead to five twice in the last 90 seconds, but both times Westbrook made a layup to extend the advantage. And the second time he was fouled on the shot and made the free throw to make it 114-106.\n\nThe Suns scored seven straight points, capped by a dunk from Kelly Oubre, to tie it at 85 with about 9 minutes left. After a timeout, Harden scored Houston's first points in about three minutes on a layup to put Houston back on top.\n\nIt was tied again before Harden scored five points to give the Rockets a 94-89 lead. He stole the ball from Ty Jerome after that and was fouled by Booker on a drive, with Harden aggressively continuing forward and pushing Booker off the court. Harden later shoved Booker, and they both received technical fouls to the bewilderment of the Suns.\n\nHarden made both free throws to make it seven points in a row and was fouled again after he stole the ball from Mikal Bridges. Harden made one of those free throws to make it 97-89.\n\n“He finds a way to win the game,” Houston coach Mike D'Antoni said. “A lot of guys contributed. A lot of guys played well.”\n\nTIP-INS\n\nSuns: Oubre had 19 points. ... Dario Saric added 13 points and 12 rebounds. ... Bridges had 14 points. ... The Suns made 11 of 35 3s.\n\nRockets: C Tyson Chandler missed the game with flu-like symptoms. ... D'Antoni received a technical for yelling at the officials in the fourth quarter. ... It's McLemore's second straight game with 20 points after he scored a season-high 28 against Toronto on Thursday night. ... Houston made 11 of 40 3s.\n\nTHEY SAID IT\n\nWestbrook on adjusting to his new teammates in his first year in Houston: “Slowly but surely,” he said. “It's always going to be a steady dose of what I see and how I can (impact) the game and help us win games and that's all I care about.”\n\nUP NEXT\n\nSuns: Host Minnesota on Monday night.\n\nRockets: Host Sacramento on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764996579.101567
}