{
  "game_id": "0022400488",
  "espn_id": "401705054",
  "date": "Jan 05, 2025",
  "matchup": "CHA @ CLE",
  "headline": "Darius Garland scores 25 points, NBA-leading Cavaliers beat Hornets 115-105 for 10th straight win",
  "body": "CLEVELAND -- — Darius Garland scored 25 points, Jarrett Allen had 19 points and 11 rebounds, and the NBA-leading Cleveland Cavaliers beat the Charlotte Hornets 115-105 on Sunday night to extend their winning streak to 10.\n\n\r\n              Donovan Mitchell had 17 of his 19 points in the second half and Evan Mobley added 17 for Cleveland, which won for the 18th time in 19 home games and is 31-4 overall. All 10 victories in the Cavaliers’ streak have been by double digits, a franchise record.\n\n\r\n              LaMelo Ball and Brandon Miller paced Charlotte with 24 points apiece, while Nick Smith Jr. had 18 off the bench. The Hornets dropped their 10th in a row and are 1-18 since Nov. 23.\n\n\r\n              Cleveland has not lost since Dec. 8 at Miami. Its lone home defeat was Nov. 27 against Atlanta.\n\n\r\n              Takeaways\r\n              Hornets: Ball and Miller each missed the previous three games with left ankle injuries, but came back strong and combined for 28 of Charlotte’s 48 points in the first half. Ball is averaging 30.1 points and Miller is at 21.4.\n\n\r\n              Cavaliers: Starting small forward Isaac Okoro, who has been sidelined since Dec. 20 with a right shoulder sprain, was cleared to practice with no restrictions. Okoro had been taking part in limited contact workouts against assistant coaches.\n\n\r\n              Key moment\r\n              Cleveland began the second quarter with a 24-6 run, fueled by its two big men, to build a commanding 53-29 lead. Mobley scored seven points and Allen had five points and four rebounds in the surge.\n\n\r\n              Key stat\r\n              Only four teams in NBA history have posted a better record through 35 games than the Cavaliers: Golden State (33-2) in 2015-16, Philadelphia (32-3) in 1966-67, the Los Angeles Lakers (32-3) in 1971-72 and Chicago (32-3) in 1995-96.\n\n\r\n              Up next\r\n              The Hornets return home to play Phoenix on Tuesday. The Cavaliers host Western Conference leader Oklahoma City on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997452.9264781
}