{
  "game_id": "0022300422",
  "espn_id": "401585050",
  "date": "Dec 28, 2023",
  "matchup": "CHI vs. IND",
  "headline": "Tyrese Haliburton has 20 assists in Pacers' 120-104 victory over Bulls",
  "body": "CHICAGO -- — NBA assists leader Tyrese Haliburton had a career-high 20 without a turnover and scored 21 points to help the Indiana Pacers hold off the Chicago Bulls 120-104 on Thursday night.\n\n\r\n              “You don’t get 20 assists without guys making a lot of shots,” Haliburton said after the Pacers shot 50.6% from the field. “I’ve done a terrible job of taking care of the ball lately, so it’s good to see zero turnovers again.”\n\n\r\n              Questionable to play before the game because of a sore lower back, became the fifth player in NBA history to have 20 or more assists without a turnover, following Kevin Porter (1978), John Lucas (1983), Rickey Green (1984) and Chris Paul (2016).\n\n\r\n              “This morning he had to step out of shootaround, his back was tight,” Pacers coach Rick Carlisle said. “I was surprised that he played based on how he was presenting this morning, but we have the best medical staff in the league.”\n\n\r\n              Myles Turner led Indiana with 24 points, and Buddy Hield added 19 points. The high-scoring Pacers were 19 of 42 from 3-point range en route to their second straight victory.\n\n\r\n              Haliburton made three late 3-pointers to quell a furious Bulls rally, which had seen them take a 93-90 lead with eight minutes remaining after trailing by as much as 25.\n\n\r\n              “People look at me to be a closer for this team,” said Haliburton, who upped his season assists average to 12.4. “Guys trust me, guys give me the ball in the right spot.”\n\n\r\n              Haliburton assisted on a Hield 3-pointer that extended the Pacers lead to 19 early in the third quarter, and jubilantly mimed a timeout signal to the Chicago bench in celebration, but the Bulls had a 14-1 run and cut it to 85-77 entering the fourth.\n\n\r\n              Patrick Williams led Chicago with 22 points, and DeMar DeRozan had 21. The injury-riddled Bulls have lost two of their last three amid a six-game homestand.\n\n\r\n              “You never want to put yourself in a position to have to fight back from a deficit,” Williams said. “We did a good job obviously working our way back into the game, but it’s tough to expend all that energy to get back.”\n\n\r\n              Coby White has picked up much of the offensive slack while All-Star guard Zach Lavine has missed the last 14 games because of inflammation in his right foot, but scuffled to a 5-for-19 shooting night while scoring 16 points.\n\n\r\n              “Everything does start with our defense,” Turner said. “That was probably our best defensive game. We held them to 104 points, a season-low. Overall, we’re growing as a group.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host New York on Saturday night.\n\n\r\n              Bulls: Host Philadelphia on Saturday night.\n\n\r\n              ------\n\n\r\n              NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995903.394007
}