{
  "game_id": "0022200947",
  "espn_id": "401469102",
  "date": "Mar 03, 2023",
  "matchup": "ATL vs. POR",
  "headline": "Murray's 39 help Hawks beat Blazers for Snyder's first win",
  "body": "ATLANTA -- — Dejounte Murray's career high in scoring helped give Quin Snyder his first win with the Atlanta Hawks.\n\n\r\n              Murray predicted more wins are coming for the Hawks with their new coach.\n\n\r\n              Murray scored 41 points to help Atlanta overcome Damian Lillard's 33 points and give the Hawks a 129-111 victory over the slumping Portland Trail Blazers on Friday night.\n\n\r\n              “He's great, he's here to win,\" Murray said of Snyder. “He's here to win the right way. ... We're here to win together.”\n\n\r\n              Murray scored 15 points in the second quarter. He made 17 of 22 shots from the field for the game and all five of his 3-point attempts.\n\n\r\n              Trae Young took over with 15 in the third quarter and finished with 23 points and 11 assists, but Murray claimed the spotlight.\n\n\r\n              “He's the king of the mid-range jumper right now,” Young said of Murray.\n\n\r\n              Snyder, the former Utah coach, agreed to a five-year deal as Atlanta's coach on Feb. 26, five days after the firing of Nate McMillan. The Hawks lost to Washington 119-116 on Tuesday night in Snyder's debut.\n\n\r\n              The Hawks scored the game’s first five points and never trailed.\n\n\r\n              “It was a good effort, a good team effort,” Snyder said. “We've got a ways to go, but it's a good step.”\n\n\r\n              Murray described Snyder as a “high IQ guy” who “makes his voice heard at the right time.”\n\n\r\n              Added Murray: “I feel like he will get it going in the right direction.”\n\n\r\n              The Hawks hope Snyder can guide the Hawks (32-31) from eighth place in the Eastern Conference to a top-six spot and playoff berth.\n\n\r\n              Cam Reddish had 25 points and Jerami Grant 14 for the Trail Blazers (29-34), who lost their third straight and fifth in six games. \n\n\r\n              “We're not playing great,” Blazers coach Chauncey Billups said. “Every team has these lapses during the season and that's exactly where we're at.”\n\n\r\n              They leaned heavily on Murray's scoring in the first half. Murray had 15 second-quarter points, giving him 23 at halftime as Atlanta's answer to Lillard's lead role for the Blazers.\n\n\r\n              Murray topped his previous high of 40 points scored in a 129-125 loss at Portland on Jan. 30.\n\n\r\n              “I was hooping, having fun,” Murray said.\n\n\r\n              OKONGWU FOR RARE 3\n\n\r\n              Snyder mentioned forward-center Onyeka Okongwu had been making a good percentage of his 3-pointers in practice. It was a surprise, considering Okongwu made his first career 3 against Phoenix on Feb. 1.\n\n\r\n              Okongwu made good on Snyder's observation by sinking another 3, the second of his career, early in the second period.\n\n\r\n              “He shot it with a lot of confidence,” Snyder said. “He didn't hesitate at all.”\n\n\r\n              SECOND-CHANCE POINTS\n\n\r\n              Billups said the difference was Atlanta's 24-9 advantage in second-chance points. Atlanta claimed a 43-34 advantage in rebounds.\n\n\r\n              “I don't care how good you are, it's tough to absorb 24 second-chance points,” Billups said.\n\n\r\n              TIP INS\n\n\r\n              Trail Blazers: Reddish, who began his career in Atlanta, made four 3-pointers while starting at shooting guard as Anfernee Simons (right ankle sprain) was held out. Simons was injured in Wednesday's loss to New Orleans. ... C Jusuf Nurkic (left calf strain) missed his 12th consecutive game.\n\n\r\n              Hawks: Young started after being listed as probable with a sore right groin. Young appeared to tweak his left ankle early in the game. He appeared to favor the ankle after Matisse Thybulle landed on his foot, but Young remained in the game. ... Clint Capela had 11 points and 12 rebounds. De'Andre Hunter added 17 points.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Continue their six-game road trip at Orlando on Sunday.\n\n\r\n              Hawks: Open a four-game road trip at Miami on Saturday night. Atlanta plays the Heat again on Monday before back-to-back games at Washington on Wednesday and Friday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994815.506913
}