{
  "game_id": "0022400177",
  "espn_id": "401704743",
  "date": "Nov 06, 2024",
  "matchup": "OKC @ DEN",
  "headline": "Watson seals 124-122 win for Nuggets with blocked shot in final second, handing Thunder 1st loss",
  "body": "DENVER -- — Russell Westbrook scored 29 points, Peyton Watson blocked a shot in the closing seconds after missing a pair of free throws at the other end and the injury-riddled Denver Nuggets rallied to beat Oklahoma City 124-122 on Wednesday night to hand the Thunder their first loss of the season. \n\n\r\n              Nikola Jokic finished with 23 points, 20 rebounds and 16 assists as the Nuggets rebounded from a 16-point deficit in the third quarter. Christian Braun added 24. \n\n\r\n              Michael Porter Jr. came up big after a slow start, scoring 21 of his 24 points in the second half. The short-handed Nuggets were without power forward Aaron Gordon (strained calf) and point guard Jamal Murray (concussion protocol).\n\n\r\n              Watson had a chance to seal the game at the line with 16 seconds left but missed both free throws. He made up for it by swatting the shot of a driving Shai Gilgeous-Alexander just before the buzzer sounded.\n\n\r\n              Jalen Williams led the Thunder with 29 points, 10 rebounds and nine assists while Gilgeous-Alexander had 28 points.\n\n\r\n              Takeaways\r\n              Thunder: So defensively sound, the Thunder allowed 69 points in the second half. They entered the contest giving up a league-low 95.9 points a game.\n\n\r\n              Nuggets: At times, Denver struggled to keep its cool. In addition to coach Michael Malone, Westbrook was given a technical. They kept their cool down the stretch.\n\n\r\n              Key moment\r\n              Down 108-106, the Nuggets went on a 17-7 run to take control of the game. The youngsters, Julian Strawther and Watson, played pivotal roles in that stretch.\n\n\r\n              Key stat\r\n              For the seventh time in eight games, the Nuggets were outscored in the first quarter (32-30). \n\n\r\n              Up next\r\n              The Nuggets host the Miami Heat on Friday and the Thunder kick off a six-game homestand on the same night against Houston Rockets.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997688.925401
}