{
  "game_id": "0021901249",
  "espn_id": "401224724",
  "date": "Aug 02, 2020",
  "matchup": "PHX vs. DAL",
  "headline": "Suns make it 2 straight in restart by topping Mavs 117-115",
  "body": "LAKE BUENA VISTA, Fla. --  Devin Booker scored 30 points and the Phoenix Suns erased a double-digit deficit while their All-Star guard was on the bench with foul trouble, rallying for a 117-115 victory over the Dallas Mavericks on Sunday night.\n\nThe Suns have won both games in the restart after coming in with the worst record among Western Conference teams in the bubble. They're still long shots for the playoffs, while the Mavericks clinched their first postseason berth since 2016 by virtue of Memphis' loss to San Antonio earlier in the day.\n\n\"This kind of game is going to help us grow, especially a young team like we are,\" said Phoenix guard Ricky Rubio, who had 20 points, nine rebounds and seven assists. \"You can't practice that. Coming here will help it. Now that we're here, chances are super low. But we have a chance. That's why we're here.\"\n\nLuka Doncic had 40 points, 11 assists and eight rebounds for the Mavericks, whose hopes of moving up from the seventh seed are fading with an 0-2 start in the eight-game seeding round.\n\nBooked fouled out with 1:26 remaining, and the Mavericks pulled within two on a layup from Doncic. The Phoenix lead was still two in the final seconds when Kristaps Porzingis, who scored 30, barely grazed the front of the rim on a 3.\n\nDallas got another chance when a possession call was overturned on review with 3.3 seconds to go, but Tim Hardaway Jr.'s 3 was off the mark, leaving the Mavericks 1 of 18 from long range in the second half.\n\n\"Like I just told them, this is what I wanted to experience in this bubble was something like this where we just had our backs against the wall and across the board we got efforts from everybody,\" Phoenix coach Monty Williams said. \"I was just wanting them to experience something like that so we can grow as a team.\"\n\nBooker had just committed his fifth foul moments after Deandre Ayton did the same earlier in the third quarter when Seth Curry's layup put Dallas ahead 81-70. But Jevon Carter and Cameron Johnson, who had 19 points and 12 rebounds, hit consecutive 3-pointers to spark the comeback by Phoenix, which outscored Dallas 36-19 in the third.\n\n\"Our problems in the third quarter started at the beginning,\" Mavericks coach Rick Carlisle said. \"We had three or four very bad possessions to start, and they were uncharacteristically poor when you compare them to how we were playing in the first half. That got things going the wrong way.\"\n\nTIP-INS\n\nMavericks: Curry, who scored 16 points, set a career record for 3-pointers in a season. He went 3 of 6 from long range and has 139 3s this season. His previous high was 137 in his other season with Dallas, 2016-17. ... Dallas missed its first 14 tries from 3 in the second half, finishing 6 of 31 for the game.\n\nSuns: Frank Kaminsky scored six of his eight points during a 14-1 run that started not long after the fifth fouls for Booker and Ayton. Phoenix turned an 81-70 deficit into an 84-82 lead with the spurt. ... Dario Saric helped Phoenix stay in front after the rally, scoring seven of his 13 points in the fourth quarter.\n\nLOSE, BUT YOU'RE STILL IN\n\nThe Mavericks were all but in the playoffs before the seeding games started. Now they're in thanks to current No. 8 seed Memphis' matching 0-2 record in the bubble. Barring a strong six-game finish and struggles for any of four teams ahead of them, the Mavericks are all but locked in to the seventh seed.\n\n\"These kind of games, we have to use them as fuel for us to just keep working and keep getting better,\" Porzingis said. \"Another tough loss for us, but this is part of the process and we're going to get through this and get better and we won't let these things happen again.\"\n\nUP NEXT\n\nMavericks: Play Sacramento on Tuesday.\n\nSuns: Play LA Clippers on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996540.676867
}