{
  "game_id": "0022300282",
  "espn_id": "401584910",
  "date": "Dec 02, 2023",
  "matchup": "ORL @ BKN",
  "headline": "Bridges scores 42 points, 26 in first quarter, as Nets snap Magic's nine-game winning streak",
  "body": "NEW YORK -- — Mikal Bridges scored 42 points, including 26 in the first quarter, and the Brooklyn Nets snapped the Orlando Magic’s nine-game winning streak with a 129-101 victory Saturday night.\n\n\r\n              The Magic were hoping for the first 10-game winning streak in franchise history but had little hope after Bridges outscored them by himself as the Nets ran out to a 43-22 lead after 12 minutes.\n\n\r\n              Bridges wanted to set the tone following a home loss to Charlotte on Thursday in which Brooklyn allowed 73 first-half points, including a Hornets franchise-record 42 in the second quarter.\n\n\r\n              \"I was ready to play. Just didn’t like that loss against Charlotte … Just wanted to win the game,” he said.\n\n\r\n              It was the Magic’s first loss since Nov. 14, when the Nets beat them 124-104 in their previous trip to Barclays Center.\n\n\r\n              Bridges shot 12 for 20 from the field and 15 for 18 from the free throw line, falling three points shy of his career high. Brooklyn coach Jacque Vaughn sensed Bridges was ready for a good performance due the frustration they both harbored from the Hornets loss.\n\n\r\n              “I have always talked about one of the things that make him special is his will to win,\" Vaughn said, “and at the end of the day it takes a lot to get yourself ready to play and do the things necessary to win.”\n\n\r\n              Spencer Dinwiddie added 22 points, Cam Thomas had 20 and Dennis Smith Jr. finished with 10 points and 11 rebounds for the Nets, who have won four of their last five games.\n\n\r\n              Franz Wagner and Cole Anthony each scored 20 points, while Paolo Banchero had 19 points and 10 rebounds for the Magic.\n\n\r\n              “I think you can’t overlook it,” Banchero said of the winning streak ending. “I think it’s something to be proud of as a team and everyone in the locker room is. But we also understand that we have a chance to bounce back and we go on another streak.”\n\n\r\n              Brooklyn led by as many as 25 points in the first half, but the Magic trimmed the lead to single digits in the third quarter on a layup by Moritz Wagner that made it 89-80 with 2:37 left.\n\n\r\n              Dinwiddie answered by outscoring the Magic 9-5 to extend the Nets’ lead to 98-85 heading into the final quarter.\n\n\r\n              Bridges put Brooklyn back up by 20 with a three-point play that made it 114-94 with 4:24 left. He missed his next shot, a 3-pointer that would have tied his career high of 45 points, which he equaled in a loss at Atlanta on Nov. 22.\n\n\r\n              “Everybody wants to see him do his thing. Everybody wanted him to get 50 tonight,” Smith said.\n\n\r\n              Bridges had 34 points in the first half to help Brooklyn take a 73-51 lead at the break. The Nets shot 50% from the field and 8 for 18 beyond the 3-point line.\n\n\r\n              He was 8 for 11 in the first quarter. Bridges’ 26 points were the most in the opening period of an NBA game since the 2021-22 season, when Dallas’ Luka Doncic had 28 against the Los Angeles Clippers.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Visit the Cleveland Cavaliers on Wednesday.\n\n\r\n              Nets: Visit the Atlanta Hawks on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995734.345376
}