{
  "game_id": "0022000041",
  "espn_id": "401267201",
  "date": "Dec 28, 2020",
  "matchup": "ATL vs. DET",
  "headline": "Young, Bogdanovic pace Hawks' 128-120 win over Pistons",
  "body": "ATLANTA -- — Trae Young scored 29 points, Bogdan Bogdanovic added 17 and the Atlanta Hawks beat the Detroit Pistons 128-120 in their home opener Monday night.\n\n\r\n                    John Collins finished with 15 points for the Hawks, who are 3-0 for the first time since 2016-17 and hit 20 3-pointers while shooting 47.6% beyond the arc. Young’s 3 from the right wing put Atlanta up 122-112 with 1:47 remaining before Jerami Grant’s 3 trimmed the lead to five with 1:05 left. Collins hit two free throws and Young sealed it with four free throws in the final minute.\n\n\r\n                    “Being 3-0 is great for us and for me it’s all about taking it one game at a time,\" Young said. “We're going up to Brooklyn to play a really good team and we need to bring the same energy and effort. I’m super excited about this team. Just need to get everyone healthy and it’ll be fun.\"\n\n\r\n                    The Pistons dropped to 0-3. They were without star forward Blake Griffin and reserve guard Derrick Rose, who were given the night off to rest. Coach Dwane Casey started Josh Jackson, who scored 27 points in Griffin’s spot. Grant had 27 points, and Delon Wright chipped in 18 off the bench.\n\n\r\n                    “He’s shooting the ball well,\" Casey said of Jackson. “The ball seems to find him in certain situations. I love the way he's been a bright surprise for us. He’s that diamond in the rough you have to find everyone once and a while.\"\n\n\r\n                    Wright made two free throws to pull the Pistons within five at the 3:15 mark of the third, but the Hawks went on a 29-16 run that culminated with Cam Reddish’s alley-oop dunk, Bogdanovic’s runner and Rajon Rondo’s jumper, making it 115-91 with 7:43 remaining.\n\n\r\n                    Detroit made another move, pulling within 115-106 on two free throws by Grant at the 4:16 mark, but Collins answered with an alley-oop dunk and Young hit two foul shots to put Atlanta up 119-108 with 2:43 to go. \n\n\r\n                    The Hawks made 16 of their first 25 shots before the Pistons went on a 13-2 run to pull within two in the second quarter, but Atlanta got hot again. Young scored on an acrobatic runner off the glass and converted the three-point play to make it 46-41 at the 7:04 mark of the second. Bogdanovic followed with a 3 from the right wing, De’Andre Hunter hit a 3 from the left wing, Young knocked down three free throws and Bruno Fernando hit a putback to make it 62-49.\n\n\r\n                    The Hawks took their first double-digit lead on Solomon Hill’s 3 at the 3:29 mark of the first. \n\n\r\n                    “We definitely can score,\" Hill said. “I think our offensive efficiency needs to be cleaned up. Our execution has to be a little bit crisper and we need to give more space to let Trae work.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Casey doesn’t plan on giving Griffin and Rose abundant rest this season, but with three games in four days and playing the front end of a back-to-back, they were given the night off. Griffin, who has a tender knee, played 44 minutes in Saturday’s loss to Cleveland. Rose played 33. ... Jahlil Okafor didn’t play because of a sore right ankle sustained against Cleveland. ... Sekou Doumbouya has a sore right foot.\n\n\r\n                    Hawks: Atlanta was short-handed, too, with Danilo Gallinari unable to play because of a left foot contusion. Kris Dunn (right knee cartilage pain), Onyeka Okongwu (left foot inflammation, sesamoid bone, left foot) and Tony Snell (right foot inflammation) also missed the game. ... Rondo made his Atlanta debut, scoring 12 points. ... Clint Capela made his debut, too, finishing with seven points and nine rebounds. ... The Hawks announced after the game that Okongwu and Snell have been cleared to progress to live contact workouts. \n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Host Golden State on Tuesday.\n\n\r\n                    Hawks: At Brooklyn on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997647.4853408
}