{
  "game_id": "0021900641",
  "espn_id": "401161283",
  "date": "Jan 20, 2020",
  "matchup": "BKN vs. PHI",
  "headline": "Simmons scores 34 in triple-double, carries 76ers past Nets",
  "body": "NEW YORK --  Ben Simmons was chosen Monday as the Eastern Conference player of the week for the way he performed last week.\n\nThen he got a sensational start on winning the next week's award, too.\n\nSimmons tied a career high with 34 points and added 12 rebounds and 12 assists, carrying the Philadelphia 76ers to a 117-111 victory over the Brooklyn Nets.\n\n\"I mean, Ben Simmons was ridiculously dominant tonight,\" 76ers coach Brett Brown said.\n\nA point guard by skill but at 6-foot-10 a big man in size, Simmons played all over the floor for a 76ers team missing All-Star center Joel Embiid. The Nets tried guarding him with big men but that didn't work -- though nothing may have the way he played.\n\n\"I just came in with that mindset to win,\" Simmons said. \"I know it's going to be tough every time we play teams like this.\"\n\nSimmons shot 12 for 14 from the field in his career-best fifth straight game with 20 or more points, finishing with his fourth triple-double of the season. The NBA leader in steals had five of them.\n\n\"Just his determination,\" Brown said when asked what impressed him most about Simmons' performance. \"Like, there was a determination, there was a spirit, there was a committed performance offensively and defensively that he just wasn't going to let the team lose.\"\n\nAl Horford added 19 points for the 76ers, who won their fourth consecutive game. Tobias Harris and Josh Richardson each scored 15.\n\nSpencer Dinwiddie scored 22 points for the Nets, who played without Kyrie Irving because of hamstring tightness and lost their fourth straight. Caris LeVert had 16 points and rookie Nicolas Claxton added a career-best 15, but the Nets hurt themselves with 10 turnovers in the fourth quarter.\n\n\"Towards the end, we couldn't hold onto the ball. It wasn't anybody in particular, literally everybody was turning it over,\" center Jarrett Allen said.\n\nThe Nets led 91-82 on Claxton's follow dunk with 1:41 left in the third, but the Sixers scored the final eight points of the period. Simmons got the last six, including two free throws after he was flagrantly fouled by Claxton, who fell hard onto the court.\n\nSimmons scored again to open the fourth and give Philadelphia a 92-91 lead, which grew to 97-91 when Raul Neto capped its 15-0 run with a 3-pointer.\n\nPhiladelphia extended the lead to 105-96 on a basket by Simmons before the Nets scored eight straight while the 76ers went scoreless for nearly five minutes. Horford finally ended that drought when Simmons found him for a 3-pointer and a 108-104 edge with 1:22 to play, and Furkan Korkmaz hit another 3 to put them up five with 23 seconds remaining.\n\nThe Nets committed 22 turnovers and shot 64.7% on free throws while losing for the 11th time in 13 games.\n\n\"I think they ended up having 13 more shots than us, which is not going to work against a really good team,\" Nets coach Kenny Atkinson said.\n\nClaxton is a second-round pick getting extended minutes after backup center DeAndre Jordan suffered a finger injury. Claxton scored 14 points Saturday in a loss to Milwaukee, then went 5 for 5 for 13 points in nine first-half minutes Monday as Brooklyn took a 68-64 lead.\n\nTIP-INS\n\n76ers: Simmons averaged 21.3 points, 9.5 rebounds and 7.3 assists last week. The 76ers went 3-1. The Sixers learned of his weekly award during the game. \"I would have given him that just for the second half of this game,\" Brown said. ... Brown said there was no update on Embiid's recovery from surgery on a torn ligament in his left hand.\n\nNets: The Nets got starters Joe Harris and Garrett Temple back from injuries. Harris scored 12 points. ... Allen had 13 points and 13 rebounds, while Taurean Prince had 12 points and 12 boards.\n\nAWARD-WINNING SIXERS\n\nRichardson won the Eastern Conference award the week before Simmons. That was the first time two different 76ers won the award in back-to-back weeks since Aaron McKie and Iverson did it in 2000-01. Iverson won it consecutively in the 2002-03 season.\n\nIRVING UPDATE\n\nIrving was feeling soreness Sunday and then was checked again Monday before Brooklyn decided he wouldn't play. Atkinson said the Nets were choosing to be cautious with Irving because they didn't want to risk losing him for the long term. The All-Star point guard missed 26 games with a right shoulder injury before returning on Jan. 12 against Atlanta.\n\nUP NEXT\n\n76ers: Visit Toronto on Wednesday.\n\nNets: Host the Los Angeles Lakers on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996432.3487701
}