{
  "game_id": "0021800945",
  "espn_id": "401071618",
  "date": "Mar 03, 2019",
  "matchup": "HOU @ BOS",
  "headline": "Harden scores 42 points, Rockets hold off Celtics 115-104",
  "body": "BOSTON --  James Harden and the Houston Rockets are at their best when they are knocking down 3-pointers, getting points in the paint and racking up points to the foul line.\n\nThey did all three against the Boston Celtics and it added up to a mostly easy outing against a team that is continuing to struggle.\n\nHarden had 42 points before fouling out late in the fourth quarter and Houston held on to beat Boston 115-104 on Sunday for its fifth straight victory.\n\nHarden made six 3-pointers and scored 40 or more points for the 24th time this season. Houston entered the day in fifth place in the Western Conference standings, a game behind of fourth-place Oklahoma City.\n\nEric Gordon added 32 points and had eight 3-pointers.\n\n\"We're finally healthy, so yeah. It feels good,\" Harden said. \"We winning, guys know their roles, we're executing defensively, we're helping each other out, we're talking. That's all it's about.\"\n\nBoston has lost five of six since returning from the All-Star break. Kyrie Irving led the Celtics with 24 points, nine rebounds and six assists. Al Horford finished with 19 points.\n\nBoston did a decent job trying to contain Harden, limiting him to 14-of-31 shooting from the field and nine free throw attempts.\n\nBut the Celtics were inefficient when they had the ball, shooting 48 percent (37 of 77) for the game and 29 percent (8 of 28) from beyond the arc.\n\nThe Celtics started the fourth quarter with a 17-6 run to cut what had been a 28-point deficit to 106-96 with 6:08 to play.\n\nTerry Rozier got fouled on a 3-pointer at the five-minute mark, but missed all three free throws.\n\nIt was 109-100 when Nene's rebound gave Houston a second opportunity after a Gordon miss. It wound up in Harden's hands and he stepped back and swished his final 3 of the game to push the lead back up to 12.\n\nBut leading 112-104 Harden fouled out when he was called for an offensive foul with 1:44 left.\n\nThe Celtics came up empty on their next trip down the floor and they were forced to foul after failing to corral Austin Rivers' miss from deep.\n\nBoston earned its first victory since the All-Star break on Friday night against Washington. But on Sunday the Celtics fell back into many of the same bad habits that had caused them to lose four straight prior to that win over the Wizards.\n\nHorford said he couldn't point to just one thing as the main culprit of their issues right now.\n\n\"We've had some good moments. But right now, unfortunately, we're going through a really bad stretch,\" Horford said. \"This is when our group needs to make sure that we stay together.\"\n\nThings don't get any easier for Boston, which plays its next four on the road. Its trip out West begins with a matchup against Golden State and ends with games against the Lakers and Clippers.\n\nTIP-INS\n\nRockets: Harden and Gordon combined to score 74 points on 51 percent shooting. ... Iman Shumpert missed his second straight game with a sore right calf\n\nCeltics: Shot 1 for 13 from 3-point line in the first half.\n\nFAST START\n\nHouston was the more aggressive team on both ends from the outset and led 65-43 at the half. Harden (23 points) and Gordon (20 points) matched the Celtics' output by themselves in the opening 24 minutes.\n\nThe Celtics were often careless in the half court on offense. They turned it over five times in the five minutes of the game, leading to 10 Rockets' points.\n\nBoston's giveaways were exacerbated by its slowness getting back in transition.\n\nOther times the Celtics failed to help out teammates when they were beaten off the dribble, allowing the Rockets -- and particularly Harden -- to get uncontested layups. Houston scored 16 of its first 31 points in the paint.\n\nBoston hoped to get some defensive help with Aron Baynes returning to action after missing this last 11 games with a left foot contusion. But Harden repeatedly forced the Celtics to switch Baynes onto him on defense. Harden easily drove past the big man for layups on three occasions.\n\nWhen Boston did have the ball, they often settled for jumpers or tried to attack Houston one-on-one.\n\nWith the Celtics trailing 53-36 late in the first half Marcus Morris airballed a desperation 3-pointer as the shot clock wound down, prompting a chorus of boos from the home crowd.\n\nUP NEXT\n\nRockets: At Toronto on Tuesday night.\n\nCeltics: At Golden State on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764995293.426599
}