{
  "game_id": "0022000169",
  "espn_id": "401267329",
  "date": "Jan 13, 2021",
  "matchup": "MEM @ MIN",
  "headline": "Valanciunas leads Grizzlies to 118-107 win over Timberwolves",
  "body": "MINNEAPOLIS -- — Jonas Valanciunas had 24 points and 16 rebounds, Grayson Allen scored a season-high 20 off the bench and the Memphis Grizzlies came back to beat the Minnesota Timberwolves 118-107 on Wednesday night.\n\n\r\n                    Brandon Clarke added 19 points for Memphis, which outscored Minnesota 38-17 in the fourth quarter to win its third straight game. \n\n\r\n                    Playing without Ja Morant for the eighth game in a row, the Grizzlies had a 50-21 advantage in points off the bench. De’Anthony Melton scored 15 and rookie Xavier Tillman chipped in with 12.\n\n\r\n                    “Our guys just kept fighting through, fighting through and when a window opened for us to attack, we took advantage of it,” Memphis coach Taylor Jenkins said.\n\n\r\n                    Malik Beasley had 28 points for Minnesota. D’Angelo Russell added 25 and Karl-Anthony Towns finished with 25 points and 14 rebounds.\n\n\r\n                    The teams continue a two-game series Friday in Minnesota.\n\n\r\n                    “Got to be more physical,” Timberwolves coach Ryan Saunders said. “That’s a physical group over there. Got to be more physical, plain and simple. Take pride in guarding the ball. Take pride in protecting the rim.”\n\n\r\n                    The two youngest clubs in the NBA to start this season, according to the Elias Sports Bureau, are still trying to find their way through injury and ineffectiveness. Morant has been limited to three games because of a left ankle sprain, while Justice Winslow and Jaren Jackson Jr. haven’t played this season.\n\n\r\n                    “It’s always been next man up,” Allen said. “We just have a bunch of hoopers on this team. It makes it easy to just get different groups in there and just play. We’ve got a bunch of guys playing the right way, it makes it easy.”\n\n\r\n                    Towns has missed seven games after dislocating his left wrist. The Wolves were winless without their big man in the middle before beating San Antonio on Sunday with Towns sitting out the second game of a back-to-back.\n\n\r\n                    With Towns on the bench to start the fourth, Memphis went on a 14-0 run to take a 94-92 lead. Allen hit a pair of 3-pointers during the spurt as the Grizzlies’ bench again took advantage.\n\n\r\n                    The Wolves went to their starters to stem the tide, but couldn’t handle Valanciunas down low, while the Grizzlies upped their defensive pressure. \n\n\r\n                    “In the fourth, we didn’t play defense,” Towns said.\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: After scoring 20-plus points in two straight games, Dillon Brooks was limited to nine on 4-of-15 shooting. … Valanciunas set season highs in points and rebounds. He had eight offensive boards. ... G John Konchar was questionable with a left ankle sprain but was active.\n\n\r\n                    Timberwolves: In his second game back from a hamstring injury, Josh Okogie returned to the starting lineup, with Jarrett Culver coming off the bench. It marked the seventh different starting lineup in 11 games for Minnesota this season. … F Jake Layman missed the game for personal reasons. … The Wolves had 13 turnovers to seven for Memphis.\n\n\r\n                    PLAYING THE PAINT\n\n\r\n                    Led by Valanciunas, the Grizzlies scored 80 points in the paint.\n\n\r\n                    “One thing we talk about is getting downhill, getting a piece of the paint in a variety of ways and with a variety of different players,” Jenkins said. “We’ve got a lot of guys that can really finish in the paint. That’s our M.O. and we know if we can do that, that eventually opens up more looks from the outside that we shoot with confidence.”\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996981.190849
}