{
  "game_id": "0022000383",
  "espn_id": "401267543",
  "date": "Feb 10, 2021",
  "matchup": "IND @ BKN",
  "headline": "Kyrie Irving has 35 points, Nets use defense to rout Pacers",
  "body": "NEW YORK -- — Steve Nash just wanted to see his Brooklyn Nets compete harder and tougher.\n\n\r\n                    “They gave us everything we asked for,” Nash said. \n\n\r\n                    And way more than the Indiana Pacers could handle.\n\n\r\n                    Kyrie Irving had 35 points and eight assists and the Nets were defensively dominant in the first half in shutting down the Pacers 104-94 on Wednesday night to snap a three-game losing streak.\n\n\r\n                    A night after an embarrassing effort in Detroit, when the Nets yielded 38 points in the first quarter, the Pacers didn't reach that total until 8:46 remained in the third.\n\n\r\n                    By then, the Nets had built a 32-point halftime lead, their largest since moving to Brooklyn in 2012, and with a 62-30 bulge allowed just two more points than their best total since moving from New Jersey. \n\n\r\n                    “We haven’t played defense like that pretty much the entire season, so it was definitely good to see us taking a step in the right direction,” swingman Joe Harris said.\n\n\r\n                    Irving was 17 for 17 from the throw line, career highs in both categories, and Brooklyn led by as many as 36 points. \n\n\r\n                    James Harden added 19 points and 11 rebounds for the Nets, who expect to get Kevin Durant back from his three-game absence for coronavirus health and safety protocol reasons when they open a five-game trip to the West on Saturday at Golden State, his former team.\n\n\r\n                    Domantas Sabonis had 18 points and nine rebounds for the Pacers, who dropped their season-high fourth in a row. They were coming off their worst offensive performance of the season, with season lows of 95 points and 39.8% Sunday against Utah. \n\n\r\n                    That was nothing compared to this mess.\n\n\r\n                    The Pacers missed 10 of their first 12 shots and had six points in the first seven minutes. Things didn't get much better, as they went 4 for 21 (19%) in the second quarter.\n\n\r\n                    “I thought we were getting frustrated on both ends, which was affecting the other,” Pacers coach Nate Bjorkgren said. “Offensively, just the movement kind of came to a standstill, kind of looking around a little bit instead of really being the aggressor.” \n\n\r\n                    After limiting the Pacers to 18 points in the first quarter, the Nets had their best period of the season in the second when they gave up just 12. \n\n\r\n                    Indiana got within 14 late in the third quarter, but Brooklyn got the final six points to take an 82-62 lead to the fourth. \n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Indiana had won six in a row in Brooklyn. The Pacers' last loss at Barclays Center had been Oct. 28, 2016, and they fell to 10-5 in the arena. ... Malcolm Brogdan had 15 points, six assists and five rebounds.\n\n\r\n                    Nets: Harris scored 17 points. ... DeAndre Jordan finished with 12 points and 13 rebounds.\n\n\r\n                    CROWDS COMING\n\n\r\n                    When the Nets return from their upcoming trip to the West, some fans will be at Barclays Center to welcome them. The Nets announced they had been approved to reopen at 10% capacity starting with their Feb. 23 game against Sacramento, in accordance with guidelines announced Wednesday by Gov. Andrew Cuomo. Requirements include all fans to have a negative test for the coronavirus within 72 hours of the game, along with mandatory temperature checks and wearing of masks.\n\n\r\n                    “Obviously 10 percent isn’t a packed house, but I think it is a little boost and I think it can help at least players enjoy the experience a little more and make the season a little less monotonous,” Nash said. \n\n\r\n                    LEVERT LOOKS ON\n\n\r\n                    Caris LeVert is traveling with the Pacers and was sitting on the bench to watch a video tribute the Nets played after the first quarter. LeVert, who went to Indiana as part of the Harden trade last month, is recovering from surgery to treat a cancerous growth on his left kidney that was discovered during his post-trade physical. Bjorkgren said the guard has been working out and looks good.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Visit Detroit on Thursday night.\n\n\r\n                    Nets: Visit Golden State on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764997151.116808
}