{
  "game_id": "401810134",
  "espn_id": "401810134",
  "date": "Nov 23, 2025",
  "matchup": "TOR vs BKN",
  "headline": "Raptors beat Nets 119-109 for 7th straight win, 11th in 12 games",
  "body": "TORONTO -- — Scottie Barnes scored 17 points, Ja’Kobe Walter added a season-high 16 and the Toronto Raptors won for the 11th time in 12 games, beating the Brooklyn Nets 119-109 on Sunday night. \n\n\r\n              Brandon Ingram had 14 points and Immanuel Quickley scored eight of his 13 in the fourth quarter to help Toronto extend its winning streak to seven.\n\n\r\n              Toronto’s RJ Barrett scored 16 points before leaving midway through the third because of a sprained right knee. Barrett landed awkwardly after his steal led to a fast break dunk.\n\n\r\n              Brooklyn’s Tyrese Martin scored a season-high 26 points. Michael Porter Jr. had 25 and Noah Clowney added 22.\n\n\r\n              Nic Claxton had 10 points and 11 rebounds for the Nets. Claxton had his first career triple-double in Friday night in a win at Boston.\n\n\r\n              Toronto’s Sandro Mamukelashvili scored 12 points in his first start of the season, Gradey Dick also scored 12 points and Jamal Shead had 11.\n\n\r\n              Porter’s layup with 4:24 left in the fourth tied it at 104, but Quickley made two 3-pointers as Toronto replied with a 10-0 run over the next 2 1/2 minutes.\n\n\r\n              Ingram reached 10,000 career points with a 3 in the second, his only basket of the period. Toronto led 65-58 at the intermission.\n\n\r\n              Mamukelashvili started for center Jakob Poeltl, who sat because of a sore lower back. Rookie Collin Murray-Boyles returned after missing two games because of a sore right knee.\n\n\r\n              Up next\r\n              Nets: Host New York on Monday night.\n\n\r\n              Raptors: Host Cleveland on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042682.964206
}