{
  "game_id": "0021800705",
  "espn_id": "401071378",
  "date": "Jan 22, 2019",
  "matchup": "PHX vs. MIN",
  "headline": "Towns, Timberwolves rout short-handed Suns 118-91",
  "body": "PHOENIX --  Two days earlier, the short-handed Phoenix Suns gave Minnesota everything it could handle in a two-point road loss to the Timberwolves.\n\nOn Tuesday night, it was no contest. A Minnesota blowout in the desert.\n\nKarl-Anthony Towns had 25 points, 18 rebounds and seven assists, rookie Josh Okogie scored a career-best 21 and the Timberwolves rolled 118-91.\n\n\"It's a great thing to have a rookie like Josh play as well as he did,\" Towns said. \"He came in and played with a lot of energy and gave us a spark and you can't ask any more from him. He's doing a great job all year.\"\n\nMinnesota needed Derrick Rose's driving bank shot at the buzzer to beat Phoenix 116-114 in Minneapolis on Sunday.\n\nIn both games, Phoenix was without centers Deandre Ayton (left ankle sprain) and Richaun Holmes (right foot sprain).\n\nTo make matters worse for the Suns, T.J. Warren didn't play in the second half due to a sore right ankle.\n\nAnd there's Devin Booker, who scored 14 for Phoenix before he and Minnesota's Gorgui Deng were ejected with 5:24 left in the third quarter. Phoenix already trailed by 20 by then.\n\nJosh Jackson had a season-high 27 points and 10 rebounds for Phoenix, which lost its fifth straight. Kelly Oubre Jr. added 13 and Dragan Bender, who started at center, had 13 points and 10 boards.\n\nAndrew Wiggins scored 17 and Jared Bayless 14 for Minnesota.\n\nIt was a far cry from the tight game the teams played two days earlier.\n\nThe Suns never led and were down by as many as 30 in the second half.\n\n\"I think that was the first time since I was moved into this role that I was able to sit down towards the end (of the game) a little more,\" said Minnesota interim coach Ryan Saunders, who took over when Tom Thibodeau was fired just over two weeks ago.\n\nPhoenix trailed only 44-42 after Bender's 3-pointer midway through the second quarter but the Timberwolves outscored the Suns 20-7 the final 6:33 of the half to lead 64-49 at the break. Towns had 20 points and 11 rebounds in the first quarters.\n\nMinnesota stretched it to 80-60 on Bayless' fourth 3 of the night with 6:52 left in the third quarter.\n\n\"I felt we were just too late to the game,\" Jackson said. \"They were into a rhythm.\"\n\nUGLY MOOD\n\nThe Timberwolves led 82-62 with 5:24 left in the third quarter when Booker and Dieng got into a brief altercation, with Booker getting knocked down and responding with a hand to Dieng's face. After a video review, both were ejected. Since Booker is averaging 24.5 points per game and Dieng 5.4, Minnesota got the obvious advantage of that one.\n\nA security guard accompanied the irate Booker off the court and into the locker room, holding the Suns star player by the jersey to keep him from heading down the hall toward the visitors' locker room.\n\n\"He talked to me, I talked to him back,\" Dieng said. \"I think he tried to hit me. Everybody could see I didn't throw a punch. In this league a lot of guys think they are tough and they are not.\"\n\nBooker left without talking to reporters.\n\nTIP INS\n\nTimberwolves: Jeff Teague missed the game with left foot soreness. ... Tyus Jones missed his third straight game with a sprained left ankle. ... Timberwolves have another pair of consecutive games against the same opponent next week, against Utah on Friday and Sunday. ... Minnesota has won six of nine games. ... Timberwolves won the season series 2-1.\n\nSuns: Phoenix has had four stretches of at least five losses in a row this season. ... Booker drew a technical foul from the bench in the second quarter. ... Oubre snapped a string of seven straight games of at least 14 points, longest such stretch of his career. .... Booker is averaging 24 points and a career-high seven assists. James Harden and LeBron James are the only others to have done that so far this season.\n\nUP NEXT\n\nTimberwolves: At the Los Angeles Lakers on Thursday night.\n\nSuns: Host Portland Trail Blazers on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995122.6632059
}