{
  "game_id": "0022301224",
  "espn_id": "401616478",
  "date": "Dec 08, 2023",
  "matchup": "HOU @ DEN",
  "headline": "Green scores 26 as Rockets beat Nuggets 114-106 for 1st road win",
  "body": "DENVER -- — Jalen Green scored 26 points, Fred VanVleet had 25 and the Houston Rockets withstood a furious Denver rally to beat the Nuggets 114-106 on Friday night for their first road win of the season.\n\n\r\n              Houston dropped its first eight games on the road before handing Denver its first loss at home in 10 games. The Nuggets have dropped three in a row while NBA Finals MVP Nikola Jokic continues to struggle with his shot. He finished with 23 points and 16 rebounds but was 9 for 26 from the field and is 18 of 58 over the last two games.\n\n\r\n              “I took shots I always take,” Jokic said. “I didn’t shoot any crazy shots, the ball just didn’t want to go in.”\n\n\r\n              Alperen Sengun had 17 points and 10 rebounds and Dillon Brooks scored 16 for the Rockets, who nearly squandered a 25-point lead in the fourth quarter. They missed their last 11 shots from the field over the final 8:26 and went more than six minutes without scoring after leading 103-78.\n\n\r\n              Denver ran off 18 straight points to get within 103-96 late but Houston scored its final 11 points from the foul line to hold on.\n\n\r\n              “It goes a long way,” Brooks said of ending the road frustration. “It gives us confidence and reassurance that we can win on the road, and figure out how to win on the road with everything going haywire in the fourth quarter.”\n\n\r\n              Jamal Murray scored 21 points and Michael Porter Jr. had 20 for the Nuggets.\n\n\r\n              “We were trying to not get embarrassed,” Jokic said of the fourth-quarter rally. “We had our backs to the wall and we just wanted to fight. Maybe we need to have that from the beginning.\n\n\r\n              “Hopefully it can help us just to learn from it and get better from it.”\n\n\r\n              Jokic was 9 of 32 from the field in Wednesday night’s loss at the Los Angeles Clippers and missed his first five shots Friday night. He finally got one to go, a driving layup with 5:12 left in the second quarter, and then missed his next four attempts to finish the half 1 for 10.\n\n\r\n              The 21-year-old Sengun was happy with his defense on the two-time MVP.\n\n\r\n              “Normally he makes all of those hard shots,” Sengun said. “It wasn’t his day but I did a great job, I think.”\n\n\r\n              Jokic found moderate success in the third quarter when he made four shots but the Rockets, led by Green’s 10 points, pulled away. VanVleet, who missed the team’s loss in Denver on Nov. 29, and Jae’Sean Tate hit 3-pointers to close out the period and give Houston a 92-74 lead.\n\n\r\n              Rockets veteran Jeff Green received his 2023 championship ring before the game, more than a week after he was supposed to be honored as part of the Nuggets’ title team. Denver showed a minute-long video of Green’s highlights from his two seasons with the Nuggets.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Will host San Antonio on Monday night.\n\n\r\n              Nuggets: Play at Atlanta on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995626.91137
}