{
  "game_id": "0021900763",
  "espn_id": "401161405",
  "date": "Feb 05, 2020",
  "matchup": "MIA @ LAC",
  "headline": "Clippers ride big 4th quarter to beat Heat 128-111",
  "body": "LOS ANGELES --  Once the Los Angeles Clippers figured out Miami's zone defense, their 3-point barrage was on.\n\nPaul George and Landry Shamet each scored 23 points to lead eight Clippers in double figures, and Los Angeles beat the Heat 128-111 on Wednesday night for its third consecutive victory.\n\n\"We were moving the ball against the zone, getting the right shots. We just weren't making shots,\" said Shamet, who was 1 of 7 in the first half. \"It all started to come together in the second half.\"\n\nThe Clippers made a franchise-record 24 3-pointers, their most since hitting 20 against Houston on Jan. 18, 2016.\n\n\"It was a deluge, avalanche in that second half of 3s and we just couldn't get a handle on it,\" Heat coach Erik Spoelstra said. \"It was one of the better 3-point shooting displays I've been on the other end of. Probably the biggest one.\"\n\nJimmy Butler didn't play in the fourth quarter for Miami after straining his right shoulder. He'll have an MRI on Thursday.\n\n\"Just hope it ain't nothing major,\" he said. \"I want to be out there again on the wood with my guys.\"\n\nShamet's points were a season high and his most with the Clippers. He scored 14 off the bench in the fourth, pouring in 10 straight for Los Angeles.\n\n\"For whatever reason, out of all the firepower we have on the floor, they allow him to take the majority of the shots and he's made them pay both games,\" said teammate Lou Williams, who had 14 points.\n\nKawhi Leonard added 14 points, nine assists and seven rebounds for the Clippers, who trailed by 12 in the first half before taking control over the final two periods.\n\nShamet wasn't the only Los Angeles shooter to get hot in the fourth. JaMychal Green hit three 3-pointers, the last one extending the lead to 107-92.\n\n\"After the initial shock of the zone, we held them very well. We spaced the floor and we got great shots,\" Clippers coach Doc Rivers said. \"At halftime they said, `Maybe we should drive more.' I said, `You're wide open, shoot them.\"\n\nDerrick Jones Jr. paced six Heat players in double figures with a career-high 25 points and nine rebounds. Bam Adebayo added 22 points and 11 boards. The two of them combined to score all but six of Miami's 31 points in the fourth.\n\nJones opened the fourth with a huge one-handed dunk, and Adebayo followed later with a jam of his own.\n\nThe Heat closed within six just before Shamet scored the next 10 points for the Clippers. After that, George added a 3-pointer of his own to go with Shamet's long-range barrage.\n\n\"When they needed to keep us at bay they made two or three in a row, it seemed like at every sequence, to keep the distance,\" Spoelstra said.\n\nMiami tied the game for the last time on a basket by Kendrick Nunn early in the third. From there, the Clippers outscored the Heat 26-15, getting six 3s in a spurt that gave them a 92-80 lead going into the fourth. George scored eight straight points as part of the run.\n\nGeorge had 10 of the Clippers' season-high 35 assists in his fourth game since missing nine with a left hamstring strain.\n\nThe Heat opened a 12-point lead in the second quarter, bolstered by three 3-pointers from Gabe Vincent and eight points from Butler after he had just two in the first period. He finished with 11.\n\nThe Clippers trailed 58-55 at halftime.\n\nTIP-INS\n\nHeat: Meyers Leonard was out of the starting lineup for the first time this season because of a left ankle sprain. ... Miami fell to 12-13 on the road and 3-7 against the West away from home.\n\nClippers: Patrick Beverley left with a sore right groin and didn't return. He had five points and five rebounds in 22 minutes. ... Los Angeles won the season series, including a 122-117 victory in Miami on Jan. 24. ... The Clippers had eight players in double figures for the 13th time in franchise history and first since last February at Boston.\n\nUP NEXT\n\nHeat: At the Sacramento Kings on Friday, the second stop on a five-game trip leading into the All-Star break.\n\nClippers: At the Minnesota Timberwolves on Saturday to start a four-game trip.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995498.713567
}