{
  "game_id": "0022301077",
  "espn_id": "401585705",
  "date": "Mar 31, 2024",
  "matchup": "CLE @ DEN",
  "headline": "Jokic has 26 points, 18 rebounds and 16 assists to lead Nuggets over Cavs, 130-101",
  "body": "DENVER -- — Nikola Jokic had 26 points, 18 rebounds and 16 assists for his 22nd triple-double of the season, and the Denver Nuggets beat the Cleveland Cavaliers 130-101 on Sunday to clinch a playoff berth.\n\n\r\n              Jokic got his 128th career triple-double despite dealing with a sore right wrist that nearly kept him out of Friday’s loss to Minnesota.\n\n\r\n              Denver guard Jamal Murray missed his fifth straight game due to knee and ankle injuries but has progressed, coach Michael Malone said before the game. He has missed 21 games with various injuries.\n\n\r\n              Kentavious Caldwell-Pope added a season-high 22 points, going 6 of 9 shooting from 3-point range, as Denver snapped a two-game home losing streak. Reggie Jackson had 19 points starting in place of the injured Murray and Michael Porter Jr. also scored 19 points for the Nuggets (52-23), who entered play a half-game behind Minnesota and Oklahoma City for the top spot in the Western Conference.\n\n\r\n              They have reached the postseason in six straight seasons.\n\n\r\n              Evan Mobley scored 23 points and Jarrett Allen had 19 for Cleveland, which has dropped eight of 12. The Cavaliers (45-30) began the day a half-game ahead of New York for fourth in the East.\n\n\r\n              Donovan Mitchell, playing in his second game since missing six with a broken nose, made his first two shots of the game but went 1 of 10 the rest of the way to finish with 13 points for Cleveland.\n\n\r\n              “He wants to play and he wants to be out there with his teammates,” Cavaliers coach J.B. Bickerstaff said. “He wants to compete, to try and help us be in the best position moving forward, but if you take time off it's going to take some time to find your rhythm again.”\n\n\r\n              Cleveland forward Dean Wade (knee) didn’t make the five-game road trip that started Sunday.\n\n\r\n              “When you go through a stretch where four of your top eight players are out, it’s hard to be at your best,” Bickerstaff said.\n\n\r\n              Jokic notched the triple-double with a lob pass to Aaron Gordon to give the Nuggets an 85-66 lead with 5:04 left in the third and later hit Jackson with a behind-the-back pass for a layup.\n\n\r\n              “He’s one of the most gifted scorers in this league and he doesn’t want to score,” Jackson said of Jokic. “He wants to pass the ball and play the right way, which makes him extremely hard to guard.”\n\n\r\n              He nearly had a triple-double in the first half with 14 points, nine rebounds and eight assists, but it was Christian Braun who sparked a run to give Denver a halftime lead.\n\n\r\n              Braun stole an inbounds pass and hit a layup, drained a corner 3-pointer off a tip-assist from Jokic and made a driving layup that put the Nuggets ahead 58-50.\n\n\r\n              “If you play the right way, you always got a chance to get a shot,” Jackson said. “He’s a supernova; he’s the brightest star. Honestly, he’s the sun. Everything revolves around him.”\n\n\r\n              Denver outscored the Cavaliers 36-21 in the third quarter.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Play at the Utah Jazz on Tuesday night.\n\n\r\n              Nuggets: Host the San Antonio Spurs on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996722.598042
}