{
  "game_id": "0022001048",
  "espn_id": "401307858",
  "date": "May 13, 2021",
  "matchup": "IND vs. MIL",
  "headline": "Antetokounmpo, Bucks roll past short-handed Pacers, 142-133",
  "body": "INDIANAPOLIS -- — Giannis Antetokounmpo had so many powerful dunks on Thursday night, he tried to be mindful about not expending energy in celebrating too much.\n\n\r\n                    At the end of a demanding NBA regular season, the two-time MVP concedes there's fatigue, even after he dominated with 40 points, 15 rebounds and six assists to lead the Milwaukee Bucks to a 142-133 victory over the Indiana Pacers.\n\n\r\n                    “I just feel so much adrenaline, and I've got to let it out,” Antetokounmpo said about his array of dunks. \"(But) I'm trying to save as much energy as I can.”\n\n\r\n                    He threw down six uncontested dunks against a Pacers squad missing four starters and then saw All-Star forward Domantas Sabonis exit with a quad injury in the third quarter. That freed up room for Antetokounmpo to make 14 of 18 shots from the field. And he continually got fouled, which led to hitting 11 of 16 free throws.\n\n\r\n                    The Bucks opened the third quarter on a 10-0 run. \n\n\r\n                    “I thought that start was the key to the game,” Bucks coach Mike Budenholzer said.\n\n\r\n                    Antetokounmpo had 11 points in the quarter, after which the visitors had a 13-point cushion. Coupled with center Brook Lopez scoring 21 inside, the Bucks had a 78-50 edge in points in the paint.\n\n\r\n                    “He was trying to make a statement,” Bucks point guard Jrue Holiday said about Antetokounmpo. “I love the energy.”\n\n\r\n                    The Bucks moved within a game of the Brooklyn Nets for the Eastern Conference’s No. 2 playoff seed.\n\n\r\n                    Khris Middleton added 22 points and Holiday finished with 20 points and 14 assists.\n\n\r\n                    The Pacers dressed just 10 players, then lost Sabonis after he took a knee to the quad. He had 10 points, 14 assists and six rebounds, and wanted to keep playing. But the team played it safe.\n\n\r\n                    “It was a precautionary thing,” Pacers coach Nate Bjorkgren said.\n\n\r\n                    Indiana kept pace for a half with 3-pointers. Justin Holiday, Jrue's older brother, hit six in the first quarter as the home team took a 39-38 lead into the break. He didn't hit one in the second quarter, but the Pacers had 13 3s by halftime and trailed just 69-66.\n\n\r\n                    “He had a good game, but I don't think they had enough firepower,” Jrue Holiday said of Justin. “Even though they had more 3s, we had a lot more of everything else.”\n\n\r\n                    Justin Holiday led the Pacers with 26 points. T.J. McConnell added 23, and Doug McDermott and Oshae Brissett each had 19.\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Made 23 of 31 free throws while the Pacers converted 12 of 15. Milwaukee was whistled for just 10 fouls to the Pacers' 22.\n\n\r\n                    Pacers: McConnell, who started for the injured Malcolm Brogdon, suffered a sprained left thumb and missed about the last four minutes of the second quarter. He had his left hand wrapped to start the second half. ... Clinched a play-in berth Tuesday and are a half-game ahead of Washington for the ninth seed.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Host Miami on Saturday night.\n\n\r\n                    Pacers: Host Los Angeles Lakers on Saturday.\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997114.57277
}