{
  "game_id": "0022401023",
  "espn_id": "401705589",
  "date": "Mar 21, 2025",
  "matchup": "MEM @ LAC",
  "headline": "James Harden, Kawhi Leonard lead Clippers over Grizzlies 128-120 for fifth straight win",
  "body": "INGLEWOOD, Calif. -- — James Harden scored 30 points, Kawhi Leonard added 23 points and 10 rebounds, and the Los Angeles Clippers used a big second half to beat the Memphis Grizzlies 128-108 on Friday night for their fifth straight win.\n\n\r\n              Ivica Zubac had 17 points and 10 rebounds and Bogdan Bogdanovic added 16 points for Los Angeles. The Clippers scored 68 points in the second half to turn a six-point halftime deficit into a 20-point victory.\n\n\r\n              Jaren Jackson Jr. scored 23 points to lead the Grizzlies, who lost their third straight. Santi Aldama added 16 points and Scotty Pippen Jr. and Luke Kennard each had 15 points.\n\n\r\n              The Clippers were without head coach Tyronn Lue (back pain) for the fifth time in seven games. They improved for 4-1 under assistant coach Brian Shaw.\n\n\r\n              Takeaways \r\n              Grizzlies: Memphis continues to struggle without Ja Morant, who missed his fourth straight game with a left hamstring injury. The Grizzlies fell to 15-13 without Morant this season, compared to 28-15 with him.\n\n\r\n              Clippers: Los Angeles is peaking at the right time. The Clippers have won eight of their last nine games to surge up the Western Conference standings and sit just one game back of Golden State to avoid the play-in tournament.\n\n\r\n              Key moment \r\n              Trailing 66-60 at halftime, the Clippers opened the second half on a 19-5 run to take the lead for good. Leonard, Zubac and Bogdanovic and Norman Powell all made multiple field goals during the spurt as Memphis struggled to defend the Clippers’ balanced attack.\n\n\r\n              Key stat \r\n              The Clippers improved to 3-0 against the Grizzlies this season and have won six straight against them.\n\n\r\n              Up next \r\n              Grizzlies visit Utah on Tuesday while Clippers host Oklahoma City on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997592.092133
}