{
  "game_id": "0022301226",
  "espn_id": "401616480",
  "date": "Dec 08, 2023",
  "matchup": "POR vs. DAL",
  "headline": "Kyrie Irving injures foot, Mavericks beat Trail Blazers 125-112 behind Doncic",
  "body": "PORTLAND, Ore. -- — Luka Doncic had 32 points and 10 assists as the Dallas Mavericks beat the short-handed Portland Trail Blazers 125-112 on Friday night after Kyrie Irving injured his right foot.\n\n\r\n              With just under four minutes left in the second quarter, Irving was fouled under the basket by Portland center Duop Reath. The star guard fell to the floor, where teammate Dwight Powell inadvertently stepped on his foot, causing Irving to stay down for several minutes.\n\n\r\n              Irving remained in the game to shoot two free throws before Tim Hardaway Jr. committed a foul to get him out. Irving was taken to the locker room to be examined by the Mavericks’ training staff and then ruled out for the rest of the game.\n\n\r\n              Dallas coach Jason Kidd said the team will know more on Saturday about the extent of Irving’s injury.\n\n\r\n              Dante Exum had 23 points for the Mavericks (13-8), and Hardaway scored 20 off the bench. Doncic grabbed six rebounds.\n\n\r\n              “He was big,” Kidd said about Exum’s performance. “To have to start and play both ends, I thought he did a great job defensively. We lost (Irving), and Dante did a really good job.\"\n\n\r\n              Anfernee Simons had 30 points, eight assists and five rebounds in his second game back from right thumb surgery for a Blazers team missing three starters. Malcolm Brogdon and Deandre Ayton were both out with right knee soreness, and Jerami Grant was sidelined for the second consecutive game as he remains in the NBA’s concussion protocol.\n\n\r\n              Shaedon Sharpe added 24 points, nine rebounds and five assists for Portland (6-15). Toumani Camara had 14 points and nine rebounds. \n\n\r\n              “I thought we responded well,” Blazers coach Chauncey Billups said. “They had some really good shot-making, but we stayed in there and made it a game. We just could never really get control.”\n\n\r\n              Dallas led the entire way, and by as much as 19 in the first half. Portland made several pushes, even cutting Dallas’ lead to one in the second half, but was never able to break through.\n\n\r\n              “We took their best punch when they cut the lead,” Hardaway said. “We weathered the storm. It was a team effort.\"\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Face the Grizzlies in Memphis on Monday.\n\n\r\n              Trail Blazers: Play the Clippers in Los Angeles on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996594.504799
}