{
  "game_id": "0021800021",
  "espn_id": "401070706",
  "date": "Oct 19, 2018",
  "matchup": "MIN vs. CLE",
  "headline": "Butler leads T-wolves with 33 points in 131-123 win vs. Cavs",
  "body": "MINNEAPOLIS --  Jimmy Butler's trade request last month instantly turned him from fan favorite to scorned superstar in Minnesota.\n\nWith some hustle steals and highlight-reel baskets, he quickly had the crowd at the home opener on his side.\n\nButler brushed off some early jeers, scoring 33 points in 36 minutes to lead the Timberwolves past the Cleveland Cavaliers 131-123 on Friday night.\n\n\"I knew as soon as I made an effort play, it was going to turn into cheers,\" Butler said. \"I like it, though. Like I told you, `It's OK to boo me. I'm still going to play hard. I'm still going to try to my best to help win games. Boos, cheers, silence, I've got a job to do.\"\n\nAndrew Wiggins pitched in with 22 points and Anthony Tolliver hit three 3-pointers off the bench to bolster a vintage all-around effort by the four-time All-Star Butler, who has told the team he won't re-sign when his contract expires next summer. Hence the boos, which began when he was introduced during the pregame pageantry.\n\n\"That's the NBA. He loves it,\" coach Tom Thibodeau said. \"The important thing is to get the win. With fans, there's going to be an appreciation for a guy who puts forth that type of effort.\"\n\nButler made 10 of 12 field goals and 12 of 12 free throws, with seven rebounds, four steals and three assists to help the Timberwolves (1-1) hold off a late charge by Kevin Love and the LeBron James-less Cavaliers.\n\n\"As long as he plays well, the tide will change,\" said Taj Gibson, who had 13 points and eight rebounds.\n\nLove had 25 points, 19 rebounds and seven assists against his former team, but the Cavaliers (0-2) have a lot of work to do to become a contender again after James bolted for the Los Angeles Lakers. They allowed the Wolves a franchise record for points in a home opener.\n\n\"It's going to be a growth year for us. There's going to be a lot of lessons for us,\" Love said. \"If we can just put consistent basketball together, there's going to be a number of teams that we're going to be able to beat and we're going to give the best teams a good run for their money.\"\n\nWith a layup by Collin Sexton at the 4:02 mark, the Cavs were within 121-117, their closest since trailing 36-34 early in the second quarter. Cedi Osman's 3-pointer kept the Cavs within 125-120, but he missed his next one after Jeff Teague failed to convert a layup on the other end.\n\nBUTLER DID IT\n\nWhen the news of Butler's trade request broke exactly one month ago, the likelihood of him awkwardly suiting up in the home opener for the team he's seeking to leave was, well, extremely low. Yet here he was, taking the court at Target Center in the home blues with the white trim.\n\nThe boos came during the first five possessions by the Wolves each time Butler touched the ball, until he stole a pass by Love in the backcourt and fed Gibson for a dunk. The crowd immediately roared, as if the fans forgot who they were upset with because the play happened so fast.\n\nThe four-time All-Star had plenty more highlight-reel dunks and steals from there. Soon enough, some \"MVP! MVP! MVP!\" chants even broke out. The Wolves enjoyed a 52-23 run over a 13-minute stretch until late in the second quarter, taking a 20-point lead on a three-point play by Wiggins launched when Karl-Anthony Towns blocked a layup attempt by Osman on the other end to start a fast break.\n\n\"As long as you know that my mind and my heart is in the right place and that I do everything to win and I'd do anything for my guys, I'm cool,\" Butler said.\n\nALL FOR LOVE\n\nOsman had 22 points, Jordan Clarkson added 19 points off the bench and Tristan Thompson totaled 14 points and 10 rebounds for the Cavs, who trailed 83-62 early in the third quarter. Love brought them to life with a 3-pointer that sparked a 24-10 spurt. He had 13 points in the run.\n\n\"He made some shots, really commanded the ball in the post, made some good passes,\" coach Tyronn Lue said. \"That's the Kevin we're used to.\"\n\nTIP-INS:\n\nCavaliers: Larry Nance Jr. has yet to play this season because of a sprained right ankle, though Lue said he's hoping to have the center back soon. \"It's a big loss,\" Lue said. \"With the team we have, we need everybody.\" ... J.R. Smith played four minutes after missing the opener with a sore left elbow.\n\nTimberwolves: Wiggins, who was taken with the first overall pick in the 2014 draft by the Cavs only to be traded to the Wolves two months later in the deal for Love, has averaged 27.2 points in nine career games against Cleveland. ... Towns has only 20 points on 6-for-16 shooting in two games.\n\nUP NEXT\n\nCavaliers: Play the Atlanta Hawks on Sunday night in their home opener.\n\nTimberwolves: Travel to Dallas on Saturday night. They won all four games against the Mavericks last season.\n\n---\n\nMore AP NBA coverage: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994083.617422
}