{
  "game_id": "0021900310",
  "espn_id": "401160952",
  "date": "Dec 04, 2019",
  "matchup": "MIA @ BOS",
  "headline": "Brown scores 31 points in Celtics’ 112-93 victory over Heat",
  "body": "BOSTON --  Jaylen Brown banked in a 3-pointer and blew a kiss to a former teammate.\n\nHe wanted to remind old friend Kelly Olynyk that he can shoot from the outside.\n\nBrown scored a season-high 31 points, Kemba Walker had 28 and the Boston Celtics beat the Miami Heat 112-93 on Wednesday night.\n\n\"That was for Kelly. I don't know if he was over there,\" Brown said of his kiss. \"That's my guy. That was all love right there. I was showing some love. He said I was going to miss, so I sent some love over to him.\"\n\nBrown said he's shown others \"some love\" after key shots.\n\n\"People say I'm a non-shooter when I make it, I guess that's my gift over to them,\" he said, smiling.\n\nJayson Tatum added 19 points to help Boston improve to 8-0 at home. Brown connected on a season-high five 3-pointers, and Walker had seven assists and four rebounds with six shots made from beyond the arc.\n\nJimmy Butler led the Heat with a season-high 37 points and had six rebounds and four assists. Olynyk, who played his final of four seasons in Boston with Brown, added 12 points, and Duncan Robinson and Justise Winslow each had 10. Miami had won three in a row.\n\n\"We didn't play together on either end -- defense, offense,\" Butler said. \"That's not how we've been winning games. That's one that we really wanted to win. I felt like we could have proved to ourselves how we're a good basketball team. I feel like we took a step back. Back to the drawing board.\"\n\nHeat coach Erik Spoelstra left the team in the morning, flying home to be with wife Nikki for the birth of their second son. Assistant coach Dan Craig ran the team.\n\n\"Obviously, it was a big adjustment. You're going from that assistant chair to the head coach chair,\" Craig said. \"I'm just trying to juggle all that dynamics of what the head coach has to deal with before the game, in game, after game.\"\n\nBrown hit two 3-pointers and Semi Ojeleye had one -- all coming from the left corner directly in front of the Heat bench just over a minute apart -- during a 9-1 spurt that pushed Boston's lead to 80-67 late in the third quarter. The Celtics led by 13 after three quarters.\n\nBoston then scored the first seven points of the fourth, making it 89-69 on Carsen Edwards' 3 from the right wing.\n\nBrown later banked in his 3 from the top of the key, making it 102-79 with 5:16 to play.\n\nTIP-INS\n\nHeat: Craig spent his high school years living about 40 minutes away from TD Garden in Chelmsford and rooting for the Celtics. \"It worked out kind of funny,\" he said before the game. \"I'm back home and I'm going to coach this game. It's pretty exciting.\" Craig also ran the team in March of 2018 when Spoelstra was away for the birth of his first son. The Heat also lost that game.\n\nCeltics: Guard Marcus Smart missed the game due to illness. Coach Brad Stevens said he would have been \"doubtful\" with a sore oblique, but \"the illness knocked him out\" of playing.\n\nBEATING THEIR STRENGTH\n\nThe Heat entered ranked second in the league defending the 3 at 31.2%, but Boston hit 16 of 41, connecting at a 39% mark.\n\n\"Our guys did a really good job of driving, kicking, moving the ball and finding the next guy,\" Celtics coach Brad Stevens said. \"It all works together.\"\n\nLEAD ERASED\n\nThe Heat led by 11 points midway into the second quarter before the Celtics closed the half by scoring 26 of the final 33 points. Walker had nine of the points and Tatum eight in the spree over the final 7:09, including two shots from beyond the arc.\n\nUP NEXT\n\nHeat: Host Washington on Friday night.\n\nCeltics: Host Denver on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995539.9994721
}