{
  "game_id": "0021900441",
  "espn_id": "401161083",
  "date": "Dec 22, 2019",
  "matchup": "IND @ MIL",
  "headline": "Bucks beat Pacers 117-89, spoil Brogdon's return",
  "body": "MILWAUKEE --  Giannis Antetokounmpo and the Milwaukee Bucks gave Malcolm Brogdon a warm welcome.\n\nThen they went about their usual business.\n\nAntetokounmpo had 18 points, 19 rebounds and nine assists, and the Bucks spoiled Brogdon's return to Milwaukee with a 117-89 win over the Indiana Pacers on Sunday night.\n\n\"Happy for him,\" Antetokounmpo said of Brogdon. \"We had a chance to talk a little bit before the game. Just keep getting better, man. He's going to help his team.\"\n\nWesley Matthews scored 19 points for NBA-leading Milwaukee, which has won three in a row since a 120-116 loss to Dallas stopped an 18-game win streak.\n\nBrogdon was drafted by Milwaukee and spent his first three seasons with the Bucks before he was acquired by Indiana in a sign-and-trade deal over the summer. He was welcomed back with cheers and a tribute video, and finished with 10 points on 5-of-19 shooting and 10 assists.\n\n\"It was great to be back in Fiserv (Forum),\" Brogdon said. \"These fans have been amazing to me. They were amazing to me tonight. They've been amazing to be the past three years. Just incredibly thankful for them.\"\n\nThe 6-foot-5 Brogdon was voted NBA Rookie of the Year in 2017. He became the eighth member of the league's 50-40-90 club last season (shooting at least 50% from the field, 40% from 3-point range and 90% from the free-throw line).\n\n\"I would have loved (to continue) to play for this team if they had wanted me, if they had valued me the way the Pacers valued me,\" Brogdon said before the game.\n\nBrogdon scored his first points on a layup with 10:28 to play in the second quarter, giving the Pacers a 26-24 lead. Donte DiVincenzo made a layup to give Milwaukee a 56-55 advantage with 53 seconds left in the first half, and the Bucks never trailed again.\n\nMilwaukee outscored Indiana 58-34 in the second half and had a 48-34 advantage in points in the paint.\n\n\"They do a really good job of collapsing on you in the paint so it's hard to get some of those floaters and mid-range shots up,\" Pacers forward Doug McDermott said. \"So it was a little bit of an adjustment. You gotta hits 3s if you want to beat these guys and we didn't hit enough.\"\n\nDomantas Sabonis had 19 points and 18 rebounds for Indiana, and McDermott finished with 15 points.\n\nThe Pacers shot 12 for 40 from 3-point range. The Bucks made 15 3-pointers, including five straight in the fourth.\n\n\"I felt we were able to make plays,\" Antetokounmpo said. \"Once you see one going in and somebody making a play for the guy next to him, it makes the game a lot easier and gives everybody momentum.\"\n\nBrook Lopez and George Hill each had 17 points for the Bucks. Hill is averaging 16 points off the bench over the last three games.\n\n\"I think in the first half, without him, we probably would have been in a hole,\" Milwaukee coach Mike Budenholzer said of Hill. \"He carried us in the half. He's been doing it every night.\"\n\nTIP-INS\n\nPacers: Indiana has lost four straight against the Bucks dating to last season. The Pacers are 0-2 against Milwaukee this season, losing 102-83 at home on Nov. 16.\n\nBucks: Milwaukee played its fifth game (4-1) without guard Eric Bledsoe, who fractured his right leg against the Memphis Grizzles on Dec. 13. Bledsoe is expected to miss about two weeks.\n\nUP NEXT\n\nPacers: Host the Raptors on Monday.\n\nBucks: At the 76ers on Wednesday.\n\n---\n\nFollow Keith Jenkins on Twitter: https://twitter.com/MrKeithJenkins\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995859.734108
}