{
  "game_id": "0021600685",
  "espn_id": "400900106",
  "date": "Jan 25, 2017",
  "matchup": "MEM vs. TOR",
  "headline": "Gasol scores a career-high 42 to lead Grizzlies past Raptors",
  "body": "MEMPHIS, Tenn. -- Marc Gasol scored a career-best 42 points, and the Memphis Grizzlies needed every last one of them.\nGasol's night was capped by the deciding two free throws with 36 seconds left, as the Grizzlies sent Toronto to its fifth straight loss with a 101-99 victory over the Raptors on Wednesday night.\nGasol's final free throws ended a 12-0 run by the Raptors that tied the game at 99. Kyle Lowry's fadeaway 28-footer from the left wing bounced off the rim as time expired, saving Memphis from wasting Gasol's effort.\n\"The ball went in early, and the rim got a little bigger,\" the 7-foot-1 center from Spain said. \"And I just kept shooting.\"\nThe performance started with Gasol collecting Memphis' first 16 points. Then, he closed out the scoring with the deciding free throws.\n\"I think we all saw it right from the beginning -- he had a goal in mind that he was not going to go down watching,\" Memphis coach David Fizdale said.\nZach Randolph finished with 16 points for Memphis, while Tony Allen had 15 points and 11 rebounds. Gasol converted 14 of 25 shots, including going 5 of 10 from 3-point range.\n\"It's so much fun to watch and be a part of,\" said guard Mike Conley, who had 11 points. \"Tonight was something special. It got to the point where everybody was just trying to get him the ball.\"\nLowry led the Raptors with 29 points, including 14 in the fourth quarter, to lead Toronto's final charge, erasing a 12-point Memphis lead. Norman Powell had 21 points and Cory Joseph finished with 15 points.\n\"I love our competitive spirit down the stretch,\" Raptors coach Dwane Casey said, adding: \"We've got to do it earlier in the game. We've got to come out and put our foot down.\"\nWith the Memphis lead at 12 -- matching its largest of the game -- the Raptors rallied behind Lowry, scoring 12 straight. He had 10 of those points, including a 4-point play.\nThe Toronto rally tied the game at 99 with 1:31 remaining. But Gasol's final free throws meant the difference.\n\"We locked in during the fourth quarter, but I think we have to come out with that sense of urgency from the rip,\" Lowry said.\nTIP-INS\nRaptors: The Raptors suffered their first five-game losing streak since Feb. 21-28, 2015. .Starting G DeMar DeRozan missed his second game with a sprained right ankle suffered in fourth quarter Sunday against the Suns. . C Jonas Valanciunas had 12 rebounds. He has at least 10 rebounds in eight of the last nine games.\nGrizzlies: Forwards Chandler Parsons and JaMychal Green sat out with knee injuries. That meant the Grizzlies dressed only nine players. ... Gasol recorded his 20th game this season with multiple 3-pointers, and his fourth game with at least 30 points.\nQUICK STARTS\nBoth teams got out quickly with accurate shooting. Gasol made his first six shots, including three from outside the arc. By the final minutes of the first quarter, Memphis had made 11 of 14 to start the game, and Toronto was 11 of 16.\nVINCE THE ELDER\nVince Carter, the oldest active player in the NBA, turns 40 Thursday. Carter, who spent his first six years in the NBA in Toronto, also has had stops with the Nets in New Jersey, Orlando, Phoenix and Dallas before arriving with the Grizzlies in 2014. The crowd sang Happy Birthday to Carter in the break between the first and second quarters, leading to a smile and a wave from the reserve forward.\nUP NEXT\nRaptors: Toronto returns home Friday to face the Milwaukee Bucks in the first of a three-game homestand.\nGrizzlies: Start the six-game road trip Friday in Portland against the Trail Blazers. The 10-day journey is the longest for the Grizzlies since they were gone for six games between March 24 and April 1, 2007.",
  "source": "espn_api",
  "crawled_at": 1764995596.635691
}