{
  "game_id": "0022300523",
  "espn_id": "401585151",
  "date": "Jan 10, 2024",
  "matchup": "CHI vs. HOU",
  "headline": "Coby White scores 30 points as the Chicago Bulls beat the Houston Rockets 124-119 in overtime",
  "body": "CHICAGO -- — Coby White scored 30 points and Zach LaVine made a big 3-pointer with 1:46 left in overtime, helping the Chicago Bulls top the Houston Rockets 124-119 on Wednesday night.\n\n\r\n              “Big-time players make big-time plays,” White said of LaVine’s performance late in the game. “He was aggressive. That’s what we want him to do.”\n\n\r\n              LaVine finished with 25 points, 13 rebounds, seven assists and three steals in Chicago’s third consecutive win. DeMar DeRozan scored 19 points on 5-for-19 shooting, and Nikola Vucevic had 18 points and 15 rebounds.\n\n\r\n              LaVine and Vucevic were back in the starting lineup and without minute restrictions for their third game back after being sidelined by injuries.\n\n\r\n              “They didn’t go in early, but I thought the way he was playing in terms of decisiveness was really good,” coach Billy Donovan said of LaVine. “In overtime he really kept his head in the game and made some big plays for us, even picked up a couple loose basketballs and a couple of rebounds. He’s had a lot of amazing games throughout his career. I don’t know if I can sit here and say that was the best one I’ve seen. But certainly if you look at the all-around game he played on both ends of the floor, you could put that up there.”\n\n\r\n              Despite being held scoreless in the first half, Alperen Sengun had 25 points for the Rockets. Fred VanVleet had 20 points and 10 assists, and Jabari Smith Jr. finished with 18 points and 15 rebounds.\n\n\r\n              “He played one half of basketball, basically,” coach Ime Udoka said of Sengun. “He decided to show up at halftime and exerted himself the way he normally does. You saw the player that he is.”\n\n\r\n              Houston rallied from a 16-point deficit in the fourth quarter. But it dropped to 0-2 on a six-game trip.\n\n\r\n              After an Ayo Dosunmu corner 3 put the Bulls up 101-85 with just over nine minutes remaining, Houston outscored Chicago 27-11 through the end of regulation. After a driving Sengun layup tied it at 112 with 23.2 seconds left, DeRozan and Smith traded missed jumpers in the final seconds of the fourth quarter.\n\n\r\n              The Rockets led 119-114 with 2:50 left in overtime, but LaVine responded with six straight points for the Bulls. LaVine’s 3 put Chicago ahead to stay, and White made another 3 to make it 123-119 with 1:04 remaining.\n\n\r\n              “We were a little stuck,” LaVine said. “I think it was a turning point where either you’re going to make something or the game is going to go south. I tried to just create something.”\n\n\r\n              Under Udoka, the Rockets have held opponents to the lowest 3-point shooting percentage in the NBA this season. But the Bulls shot a blistering 8 for 11 from beyond the arc in the second quarter, when White scored 11 to help his team to a 62-54 lead at the break.\n\n\r\n              White finished with six 3s as the Bulls went 19 for 47 from beyond the arc. The Rockets have yet to win a game this season in which they allowed 15 made 3-pointers or more.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Continue a six-game road trip in Detroit on Friday.\n\n\r\n              Bulls: Host the Warriors on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995897.6658392
}