{
  "game_id": "0021900749",
  "espn_id": "401161391",
  "date": "Feb 03, 2020",
  "matchup": "SAC vs. MIN",
  "headline": "Fox scores 31, Kings send Timberwolves to 12th straight loss",
  "body": "SACRAMENTO, Calif. --  Bogdan Bogdanovic feels a lot more comfortable in Sacramento's starting lineup than he did coming off the bench.\n\nKings coach Luke Walton is certainly happy with the results, although he would prefer Bogdanovic get a little more greedy with his shooting.\n\nBogdanovic scored 23 points and made five free throws in the final 69 seconds, De'Aaron Fox had 31 points and the Kings held off a late run by Minnesota to win 113-109 Monday night, handing the Timberwolves their 12th consecutive loss.\n\nIt's the second time in six games as a starter that Bogdanovic has scored 23 points. This time he did it on 5-of-7 shooting from the field that he complemented by going 9 for 11 on free throws.\n\n\"One thing I tell him is if you're 5 for 7 with 23 points, you should have shot more,\" Walton said. \"That is very efficient of him. But he's such a good shooter that anytime he comes off and the guy's not on him, I want him shooting the ball.\"\n\nBogdanovic spent the first three months of the season coming off the bench before Walton decided to make a change by swapping Bogdanovic into the starting lineup in place of Buddy Hield.\n\nSo far it's worked well for both players.\n\n\"He's maybe better as a scorer, I'm better as a playmaker,\" Bogdanovic said. \"Maybe for our team it's better right now but we still have to figure out how to win on the next level, to have more consistent wins.\"\n\nHield scored 16 points and Harrison Barnes had 14 points and seven assists for Sacramento.\n\nKarl-Anthony Towns had 22 points, 10 rebounds and six assists to lead six Minnesota players in double figures. Shabazz Napier added 17 points and seven assists.\n\n\"We're scratching and clawing, and it's tough,\" Timberwolves coach Ryan Saunders said. \"It's not always positive. We're not in this for marginal victories, we're in this to improve.\"\n\nIt was the third game between the teams this season and the first to end in regulation. Minnesota won in double overtime in December to end an 11-game skid, then Sacramento came back from 17 down with 2:49 remaining in regulation to win last Monday.\n\nThis one nearly needed extra time, too.\n\nRobert Covington's 3-pointer with 4.7 seconds left pulled Minnesota to 112-109. After the Kings turned it over on a five-second violation, Andrew Wiggins rushed a 3 that hit off the back of the rim.\n\nThe Timberwolves haven't won since Jan. 9.\n\nThe Kings jumped out to a 15-2 lead, went up 60-40 following Fox's breakaway layup in the second quarter and led 65-50 at halftime.\n\nFox provided another spark in the third quarter when he went around Napier and cut past Towns for a one-handed dunk that made it 87-66.\n\nTIP-INS\n\nTimberwolves: Towns' double-double was the 257th of his career, moving him past Kevin Love into second place on the franchise list. Kevin Garnett holds the Timberwolves record with 606. . Allen Crabbe (knee) was held out for a third consecutive game.\n\nKings: Fox shot 10 of 16 while topping 30 points for the fourth time this season.\n\nTRADE TALKS\n\nWith Thursday's deadline approaching, several players are keeping a close eye on trade talk. Bogdanovic, a restricted free agent at season's end, has come up as a player Sacramento might be willing to part with. \"You just have to be ready to play no matter what happens. You never know,\" Bogdanovic said. \"It's not in your control.\"\n\nUP NEXT\n\nTimberwolves: Play the Hawks in Minnesota on Wednesday. Minnesota has won three of the last four games against Atlanta at Target Center.\n\nKings: Host the Heat on Friday. Sacramento swept the two-game series last season but Miami won their first matchup this season.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996394.8037739
}