{
  "game_id": "0022401076",
  "espn_id": "401705642",
  "date": "Mar 29, 2025",
  "matchup": "PHI vs. MIA",
  "headline": "Herro scores 30 points to lead Heat to 4th straight win with 118-95 victory over eliminated 76ers",
  "body": "PHILADELPHIA -- — Tyler Herro scored 30 points to lead the Miami Heat to a 118-95 victory over the short-handed Philadelphia 76ers on Saturday night.\n\n\r\n              Alec Burks added 20 points for the Heat, who hold the final spot in the Eastern Conference for the play-in tournament. Miami has won four in a row following a 10-game losing streak. Herro made five of the Heat’s 20 3-pointers.\n\n\r\n              Jared Butler had 19 points to lead Philadelphia, which was eliminated from playoff contention following its seventh straight defeat. \n\n\r\n              It has been a disappointing season for the 76ers, who have been ravaged by injury. Joel Embiid and Paul George are out for the season. Many others, including Tyrese Maxey, didn’t play against the Heat as the 76ers eye the best odds for the highest draft pick.\n\n\r\n              The Heat also were without several key players, including Andrew Wiggins (right hamstring) and Duncan Robinson (back), who didn’t make the trip. \n\n\r\n              Takeaways\r\n              Heat: Miami has steadied itself after the long skid and need to get healthy soon. Coach Erik Spoelstra said Wiggins and Robinson are making progress and didn’t rule them out from rejoining the team for the final two contests of the current three-game road trip.\n\n\r\n              76ers: Philadelphia continues to look at players who could be part of future plans. Quentin Grimes continued to provide scoring, netting 15 points, and coach Nick Nurse would like to put him in positions to show his ability to run the team from the point guard position in the final eight games. \n\n\r\n              Key moment\r\n              The Heat outscored Philadelphia 34-22 in the third quarter to take a commanding 96-75 lead into the fourth.\n\n\r\n              Key stat\r\n              Philadelphia has 24 losses in its last 28 games since Jan. 31. \n\n\r\n              Up next\r\n              Heat: At Washington on Monday.\n\n\r\n              76ers: Host Toronto on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998203.660085
}