{
  "game_id": "0022200168",
  "espn_id": "401468323",
  "date": "Nov 09, 2022",
  "matchup": "MIL @ OKC",
  "headline": "Carter scores career-high 36, Bucks beat Thunder in 2 OTs",
  "body": "OKLAHOMA CITY -- — Jevon Carter had career highs of 36 points and 12 assists, and the short-handed Milwaukee Bucks beat the Oklahoma City Thunder 136-132 in two overtimes on Wednesday night.\n\n\r\n              The Bucks were missing their top two scorers. Giannis Antetokounmpo sat out with a sore left knee and Jrue Holiday was out with a sprained right ankle. Carter filled the scoring void by making 15 of 27 field goals, including 5 of 10 3-pointers. \n\n\r\n              Carter entered the game averaging 5.3 points and hadn’t scored more than 18 in a game this season. Still, his teammates encouraged him to go make things happen.\n\n\r\n              “They put a lot of trust in me,\" he said. \"They told me to go out there and be me and be free.”\n\n\r\n              Milwaukee coach Mike Budenholzer said the performance was special.\n\n\r\n              “He’s a guy that loves to play basketball, loves to compete,\" Budenholzer said. \"He’s got a ton of confidence. It’s great to see him take advantage of this opportunity, every opportunity. He’s one of those guys, I think, when you give him a look, give him a crack, he’s going to come busting through it.”\n\n\r\n              Brook Lopez added 24 points, 13 rebounds and five blocks for the Bucks, who were coming off their first loss of the season after winning their first nine games.\n\n\r\n              Shai Gilgeous-Alexander scored 39 points, Tre Mann had 21 and Josh Giddey added 18 points, 15 rebounds and six assists for the Thunder, who lost their fourth straight. \n\n\r\n              “Thought both teams were exhausted by the second overtime,\" Thunder coach Mark Daigneault said. \"Guys were out there for long stretches of time. Our guys battled. That’s just one of those games that both teams battled, somebody wins, somebody loses.”\n\n\r\n              The Thunder led by six late in the third quarter before George Hill hit a 3-pointer at the buzzer to trim Oklahoma City's edge to 87-84.\n\n\r\n              Milwaukee led 112-100 with just under five minutes remaining before the Thunder rallied. Lu Dort made an open layup off an inbounds pass under the hoop to tie the game at 119. Carter missed a fadeaway at the buzzer to force overtime.\n\n\r\n              Gilgeous-Alexander’s step-back 3-pointer with 0.6 seconds left in the first overtime gave the Thunder a 126-125 lead.\n\n\r\n              “Just crazy,” Mann said. “I knew he was going to make it. I didn’t know it was going to be a three, but I knew he was going to make it.”\n\n\r\n              Dort fouled Lopez on an inbounds lob with 0.2 seconds remaining. Lopez missed the first free throw and made the second to force a second OT.\n\n\r\n              In the second overtime, Milwaukee held the Thunder to 2-for-9 shooting.\n\n\r\n              “We had a lot of guys step up and play a big role in the win tonight,” Bucks forward Bobby Portis said. “A lot of guys stepped up, got defensive stops, made a lot of baskets. Ultimately, it was a great team win.”\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Former Thunder player Serge Ibaka scored four points. ... Lopez had four blocks in the first half. ... G Grayson Allen had 18 points and six assists.\n\n\r\n              Thunder: Allen landed hard on Gilgeous-Alexander’s knee in the first quarter, but neither player was hurt. ... F Aleksej Pokusevski had 17 points and 10 rebounds. ... Dort had four steals. \n\n\r\n              SECOND HALF STAR\n\n\r\n              Bucks rookie MarJon Beauchamp scored all 19 of his points after halftime.\n\n\r\n              The guard made 7 of 11 field goals, including 5 of 7 3-pointers, after the break.\n\n\r\n              “His second half, we really needed that,\" Budenholzer said. “We needed somebody else to kind of step and help us and put the ball in the basket. ... It was impressive.”\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Visit the San Antonio Spurs on Friday.\n\n\r\n              Thunder: Host the Toronto Raptors on Friday.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995156.843532
}