{
  "game_id": "0021800149",
  "espn_id": "401070830",
  "date": "Nov 06, 2018",
  "matchup": "CHA vs. ATL",
  "headline": "Walker scores 29, leads Hornets to 113-102 win over Hawks",
  "body": "CHARLOTTE, N.C. --  A fourth-quarter surge helped Charlotte complete a successful homestand. Still, coach James Borrego and All-Star guard Kemba Walker know the Hornets need to play better if they want to improve on their 6-5 start.\n\nWalker had 29 points and seven assists as Charlotte beat the Atlanta Hawks 113-102 on Tuesday night. Marvin Williams added 20 points for the Hornets, who finished a 3-1 homestand.\n\n\"I give Atlanta a lot of credit,\" Borrego said. \"They really guarded us tonight. They're very active with their shifts. We were real stagnant and we didn't have a great rhythm offensively until the fourth quarter.\"\n\nThat's when Walker and Williams spurred a 19-4 spurt that allowed the Hornets to pull away from the Hawks (3-7).\n\n\"A win is a win,\" Walker said. \"We were a little sloppy early on. But we adjusted and made plays down the stretch and came out with a win.\"\n\nWalker was critical of his five turnovers on a night when Charlotte committed 21 overall.\n\n\"They're pretty good defensively,\" Walker said. \"They're active and they disrupted us early. We have to do a better job of adjusting, especially me.\"\n\nWalker and Williams scored 12 points apiece in the second half as Charlotte erased a 54-51 halftime deficit. Walker has scored 25 or more seven times in 11 games.\n\nJeremy Lamb and Malik Monk each had 13 points for the Hornets. Nic Batum scored 10.\n\nPlaying against his former team, Jeremy Lin had 19 points off the bench to pace the Hawks, who led by seven late in the first half.\n\nAtlanta started 2018 first-round draft picks Trae Young, Kevin Huerter and Omari Spellman for the first time and pushed Charlotte before losing for the eighth time in the last nine meetings.\n\nYoung finished with 18 points and 10 assists. Kent Bazemore added 16 points.\n\nEven after falling behind 81-77 entering the fourth quarter, the Hawks forged an 84-83 advantage with 10:04 to play before the Hornets took over down the stretch. Charlotte eventually led by as many as 15.\n\n\"Coming out of halftime, we just couldn't buy a basket,\" Atlanta coach Lloyd Pierce said. \"We had a couple of opportunities where I thought we could have got a bigger lead and extended. We had that opportunity. We just never created any separation. I thought that was the difference in the game.\"\n\nNeither team led by more than seven until the fourth quarter.\n\nEven though he scored 18 points, Young was disappointed with his shooting.\n\n\"I can't go 0 for 7 from the 3-point line and expect to call that playing well,\" said Young, the No. 5 pick in the draft out of Oklahoma. \"My teammates did a great job of playing hard and making plays. But we just couldn't hit enough shots in the second half.\"\n\nTIP-INS\n\nHawks: Pierce considers Walker one of the NBA's top players. \"I'm a huge fan of Kemba. I've known Kemba for a long time. You're seeing a confident and elite scorer,\" Pierce said. He first met Walker at Nike Elite camps years ago, and in August 2017 was a part of the NBA Africa trip with the Hornets' two-time All-Star guard.\n\nHornets: Michael Kidd-Gilchrist dislocated his right pinkie in the first half but returned to play in the second. ... Borrego thinks the 20-year-old Young can thrive as a pro. \"He fits today's NBA for sure. The minute he crosses halfcourt, he's a threat. He's a guy that can play-make, get to the rim, pass, finish, shoot the ball. The Hawks have a very good point guard for years to come,\" Borrego said.\n\nUP NEXT\n\nHawks: Host the New York Knicks on Wednesday night.\n\nHornets: At the Philadelphia 76ers on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994433.637325
}