{
  "game_id": "0022200324",
  "espn_id": "401468479",
  "date": "Nov 30, 2022",
  "matchup": "LAL vs. POR",
  "headline": "LeBron gets 31 in Lakers' 128-109 rout of Dame-less Blazers",
  "body": "LOS ANGELES -- — LeBron James had 31 points, eight assists and seven rebounds, Austin Reaves added a season-high 22 points and the Los Angeles Lakers rebounded from a heartbreaking loss with a 128-109 victory over the Portland Trail Blazers on Wednesday night.\n\n\r\n              Anthony Davis had 27 points and 12 rebounds in the Lakers' sixth victory in eight games. Los Angeles shook off a gut-wrenching loss to Indiana in which it blew a late 17-point lead by taking an 18-point lead early in the fourth against Portland and holding on comfortably to beat a team with a winning record for the first time since Nov. 2.\n\n\r\n              Davis was the key, scoring 14 points in the fourth quarter after managing just three against the Pacers in the fourth.\n\n\r\n              “I think he was just himself in the fourth quarter,” James said of Davis. “(Tuesday) was a tough day for us, coming off that loss, but we had a lot of conversations about how we could be better, especially in the fourth quarter, and AD is a big part of that. ... He’s too big-time for our team not to have the ball in his hands.”\n\n\r\n              James hit six 3-pointers while going 12 for 18 from the field in an outstanding performance, while Russell Westbrook hit buzzer-beating 3-pointers to end the second and third quarters.\n\n\r\n              “One thing about Bron, he holds himself accountable,” Lakers coach Darvin Ham said. “He's trending individually in the right direction, and that's key. It's imperative.”\n\n\r\n              Damian Lillard missed his sixth straight game with a calf strain for the Blazers, who have lost seven of eight. Jerami Grant scored 27 points, Anfernee Simons had 22 and Justise Winslow added a season-high 21.\n\n\r\n              “It's a tall order to come in here on a back-to-back, off a very deflating loss,” Portland coach Chauncey Billups said. “This is a challenge. But the guys fought, and they played hard. They just ran out of gas.”\n\n\r\n              The Lakers played without starters Lonnie Walker and Troy Brown Jr., who were both ruled out shortly before game time with sore left feet.\n\n\r\n              Grant followed up his 32-point performance in Portland against the Clippers one night earlier with a 17-point first half against the Lakers, but James hit his first seven shots and Westbrook hit a 3-pointer at the halftime buzzer to put Los Angeles up 66-62.\n\n\r\n              Westbrook hit another buzzer-beating 3-pointer from near the half-court line to end the third quarter, giving Los Angeles a 97-82 lead. After blowing a big lead Monday, Davis and James never allowed this margin to dip into single digits against Portland.\n\n\r\n              “We're just in a really tough stretch right now,” Billups said. “You've got to have energy and legs to be a good defensive team, and we've taken a step back in that.\"\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: F Josh Hart and F Nassir Little both missed their first games of the season. Hart, who began his career with the Lakers, has a sprained left ankle, with coach Chauncey Billups saying Hart “got it pretty good. He's such a warrior, but I knew this morning (that he wouldn't play)\". ... Little has a right hip strain. He will have further imaging done Thursday. ... Trendon Watford had 10 points and 10 rebounds in his first start of the season.\n\n\r\n              Lakers: Patrick Beverley scored five points in 22 minutes in his return to the starting lineup after serving a three-game suspension for hitting Phoenix's Deandre Ayton from behind during a stoppage in play. ... Brown hurt himself during a light workout Wednesday morning. ... Walker's absence was a surprise, since he wasn't on the injury list.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Utah on Saturday.\n\n\r\n              Lakers: At Milwaukee on Friday to open a six-game road trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994147.9317539
}