{
  "game_id": "0021400334",
  "espn_id": "400578626",
  "date": "Dec 12, 2014",
  "matchup": "MEM vs. CHA",
  "headline": "Mike Conley leads Grizzlies past Hornets in double overtime",
  "body": "MEMPHIS, Tenn. -- The Memphis Grizzlies are off to a franchise-record, 18-4 start because they've learned how to win games like Friday night.\nMike Conley scored six of his 19 points in the second overtime, and the Memphis Grizzlies beat the Charlotte Hornets 113-107.\nZach Randolph had 20 points and Marc Gasol also scored 19 for the Grizzlies, who got a tying 3-pointer from Vince Carter with 4.5 seconds left in the first overtime.\n\"We found a way to win it,\" Gasol said. \"At the end of the day that's what matters. In the long run we should not have many games like that, (but) it's a team that plays kind of the way that we play: slow-down basketball.\"\nThe Grizzlies won for the sixth time in the past seven games against the Hornets, who got 28 points from Kemba Walker and 25 from Gary Neal.\nGerald Henderson tipped in a missed shot at the buzzer to end regulation.\n\"We played hard, but they're a really good team,\" Walker said. \"It's a team that you've got to be ready to play. They've been playing well all year so you've got to bring your best.\"\nThe Grizzlies trailed most of the second half but rallied in the final 5 minutes of the fourth quarter, shortly after Gasol re-entered the game. He and Randolph scored the Grizzlies' final 13 points in regulation, including Gasol's driving dunk with 11.9 seconds that gave Memphis a 92-90 lead.\n\"The guys came back in with five minutes to go and we pushed it out,\" said Grizzlies coach Dave Joerger. \"We made some mistakes there at the end in different areas, but (we) deserved to win. We knew this was going to be a tough team for us to play.\"\nWalker attempted a 3-pointer with 2.2 seconds to go and Henderson tipped it in after the Hornets kept the first miss alive.\nIn the overtime, the Grizzlies took an early four-point lead, but the Hornets recovered and led 102-99 after two free throws by Michael Kidd-Gilchrist with 23 seconds remaining. Memphis forced a second overtime when Carter, who entered on the final Grizzlies possession, connected on a 3-pointer from the corner.\n\"I've been in this game a long time,\" Carter said. \"I live for moments like that.\"\nIn the second overtime, the Grizzlies never trailed after scoring the first five points.\nMemphis led 47-45 at the half, but couldn't pull away in the third quarter. The Hornets took their first lead early in the third quarter on a 3-pointer by Walker and held the advantage for most of the period.\nNeal, who scored six straight points to end the third quarter, opened the fourth by hitting his first two shots to give the Hornets a 76-69 lead, their largest of the game.\nCharlotte never led in the first half, but trimmed the Memphis advantage to 47-45 Al Jefferson's hook in the closing seconds before halftime. Walker, limited to 1-of-11 shooting in the first game between the teams, had 15 points at half on 6-of-10 shooting.\nTIP-INS\nHornets: Rookie P.J. Hairston, who did not play in Wednesday's home game against the Boston Celtics, did not play Friday. Hairston was benched for missing a Tuesday practice without an acceptable excuse. ... The Hornets fell to 1-9 on the road. ... Charlotte allows the fewest offensive rebounds per game (8.3) and held the Grizzlies to seven.\nGrizzlies: Memphis owns the best regular-season record in the NBA during the 2014 calendar year. They are 55-19. ... The Grizzlies are 15-1 when outshooting their opponent. Memphis shot 45.9 percent to Charlotte's 41.8 percent. . . . The Grizzlies' bench failed to produce a double-digit scorer for the first time in 21 games.\nSTAT LINES\nThe Hornets' Kemba Walker, limited to 1-of-11 shooting in a 71-69 loss to the Grizzlies on Nov. 1 in Charlotte, was 11 of 21. ... Gasol, averaging eight rebounds, had only three rebounds in 36 minutes.\nCLUTCH CARTER\nJoerger on Carter's clutch 3-pointer that forced the second overtime: \"That's what he gets paid to do. He's never afraid of the moment. He's amazing and just rises to the big moments.\"\nUP NEXT\nHornets: Host Brooklyn on Saturday.\nGrizzlies: Visit Philadelphia on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764992178.653195
}