{
  "game_id": "0021500810",
  "espn_id": "400828697",
  "date": "Feb 19, 2016",
  "matchup": "MEM vs. MIN",
  "headline": "Conley has 25 points to lead Grizzlies past T'wolves 109-104",
  "body": "MEMPHIS, Tenn. --  The makeshift Memphis Grizzlies cobbled together enough components to get off to a successful post All-Star break start.\n\nDealing with new players and adjusting to only its second game without injured center and leading scorer Marc Gasol, Memphis relied on its defense down the stretch to defeat the Minnesota Timberwolves 109-104 on Friday night.\n\n\"It was a lot of fun,\" said Mike Conley, who led the Grizzlies with 25 points and seven assists. \"We could have come out there and this could have been a completely different game for us.\n\n\"Instead, we just went out there and played.\"\n\nIn addition to being without Gasol, who broke his right foot before the All-Star break, the Grizzlies were adjusting to new players, Chris Andersen and P.J. Hairston, who came over before Thursday's trade deadline. A third acquisition -- Lance Stephenson from the Clippers -- was inactive.\n\nConley said there were times when they could only run a couple of different plays offensively. Instead, Memphis relied on its defense in the fourth, holding Minnesota to only 2 of 17 from the field. Despite not having a field goal in the final 6:51, Minnesota was able to keep it interesting, by converting all 15 of its free throws down the stretch.\n\n\"I think we recognize that on a nightly basis, this is how it's going to be,\" Memphis coach Dave Joerger said. \"It's going to be kick, scratch, bite, claw.\"\n\nZach Randolph added 17 points and eight rebounds, while Vince Carter had a season-high 15 points, including a 73-foot heave as the third quarter closed that swished through, cutting the Minnesota lead to 81-76 entering the fourth.\n\nZach LaVine led the Timberwolves with 22 points, including converting 4 of 6 shots from outside the arc.\n\n\"We were a little careless with the ball and the outlet passes,\" LaVine said. \".We were making some dumb passes. You know, just not the right ones.\"\n\nAndrew Wiggins added 20 points for Minnesota, while Gorgui Dieng had 14 points and 12 rebounds. Karl-Anthony Towns finished with 11 points and 15 rebounds for the Timberwolves.\n\nMinnesota was stymied by 22 turnovers, leading to 27 Memphis points.\n\n\"They had their hands in the passing lanes, but you have to fake high and throw low sometimes, and vice versa,\" Minnesota interim coach Sam Mitchell said.\n\nMinnesota took a 91-90 lead after a pair of free throws from Wiggins with 5:53 left, the start of the final string of foul shots for the Timberwolves.\n\nRandolph then scored inside, starting a run of eight straight Memphis points to give the Grizzlies a 98-91 lead with 3:42 left, enough of a buffer for the win.\n\n\"As long as we give 100 percent, it's going to be a team win every game,\" Randolph said. \"We are going to need everybody to win. Everybody has to step up.\"\n\nTIP-INS:\n\nTimberwolves: F Kevin Garnett missed his 10th consecutive game with right knee soreness. He injured the knee in the Jan. 23 game between the teams. ... Kevin Martin, who missed the nine games before the All-Star break with sore right wrist, returned to action. ... LaVine started his eighth game of the season, with veteran Tayshaun Prince, a starter in 42 games, moving to the bench.\n\nGrizzlies: JaMychal Green, who started with Matt Barnes at forward, had a nine points and 11 rebounds. ... Minnesota had 11 3-pointers, the 27th time this season a Memphis opponent has reached double-digits in shots made outside the arc. ... Memphis G Tony Allen left the game late in the first half with a sore left knee and didn't return.\n\nNEW NICKNAME?\n\nThe trades brought in a colorful set of characters to Memphis with the tattooed Anderson and Stephenson, known for, among other things, blowing in LeBron James' ear. But the Grizzlies seem to have embraced the reputation. \"This team that we have now, we call ourselves the Goon Squad,\" Conley said. \"We play hard, play together, rely on each other and have fun.\"\n\nCARTER'S HEAVE:\n\nInitially, Carter's shot at the end of the third was shown as 64 feet, but was adjusted to 73 feet after a postgame review. \"It was perfect. It looked like he knew what he was doing. We call that the game-changer,\" Conley said.\n\nUP NEXT\n\nTimberwolves: Host New York Knicks on Saturday.\n\nGrizzlies: Travel to Toronto on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994433.755759
}