{
  "game_id": "0022000119",
  "espn_id": "401267279",
  "date": "Jan 07, 2021",
  "matchup": "MEM vs. CLE",
  "headline": "Drummond's double-double leads Cavs past Grizzlies 94-90",
  "body": "MEMPHIS, Tenn. -- — Andre Drummond had 22 points and 15 rebounds, Larry Nance Jr. added 18 points on 7-for-7 shooting from the field and the Cleveland Cavaliers defeated the Memphis Grizzlies 94-90 on Thursday night. \n\n\r\n                    Cedi Osman scored 16 points as Cleveland snapped a two-game skid. JaVale McGee added 13 points.\n\n\r\n                    Jonas Valanciunas led Memphis with 17 points and 10 rebounds, while Brandon Clarke had 14 points. Dillon Brooks scored 11 but was 4 of 13 from the field.\n\n\r\n                    “Pretty bad game for us,” Valanciunas said. “We’ve just got to bounce back. Play better offense. Play better defense. A little more effort in the game. All of us, me included.”\n\n\r\n                    A key sequence came with 34 seconds left. On a breakaway by Memphis guard Tyus Jones, Isaac Okoro was called for a foul on Jones’ layup attempt, which the rookie from Auburn blocked. Cleveland challenged, the foul was overturned and the Cavaliers won the ensuing tip. \n\n\r\n                    That led to a dunk from Okoro with 10.6 seconds left for a 93-90 lead.\n\n\r\n                    “What Isaac understands is there are a multitude of ways you can impact winning throughout the game, and especially in the clutch,” Cavaliers coach J.B. Bickerstaff said. “That chase-down block, if it wasn’t the middle of January, we’d be talking about that block for a long, long time. It was phenomenal.”\n\n\r\n                    The Cavaliers were minus leading scorer Collin Sexton, who sat out with a left ankle sprain. That left Cleveland trying to pick up Sexton’s missing 25.1 points a game.\n\n\r\n                    In the aftermath of Wednesday’s chaos at the U.S. Capitol, and to protest racial and social injustice, the teams paused at the opening tip, went to the sideline, locked arms and took a knee. They were joined by coaches, staff and reserves covering the entire sideline from end line to end line. The three officials knelt at midcourt behind the line of players.\n\n\r\n                    “I’m just so proud to be a part of this league. Our league is at the forefront of all … positive change in my mind,” Nance said. “All things equality. All things social justice. I couldn’t be more proud of the players, the teams, the league we’re in.”\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: With a steal in the third quarter, Nance reached 400 for his career. He leads the NBA with 2.38 steals per game. ... G Damyean Dotson started his second game of the season. … Played their first game against a Western Conference opponent. ... Drummond has a double-double in all nine games this season.\n\n\r\n                    Grizzlies: Have not won a home game this season. Their only two wins came on the road at Brooklyn and Charlotte. … Had 14 steals, a season high.\n\n\r\n                    SOCIAL STANCE\n\n\r\n                    Both coaches addressed Wednesday’s events in Washington and other questions regarding social justice in the country. “The last nine or 10 months has given us all a priority check, I think,” Bickerstaff said. “Through the civil unrest. Through COVID itself. We have to be able to sit back and prioritize what is important, and there are larger issues at hand that we deal with on a day-to-day basis. … How we interact with each other as a society and as a larger community is more important.”\n\n\r\n                    Memphis coach Taylor Jenkins noted the first three words of the U.S. Constitution are “We the people,” and said those are strong words to remember as the country reflects on recent events. “It starts with each individual. ‘We the people’ have the power to make change … knowing that better days need to be ahead of us. And they will be ahead of us if we all take that long, hard look at what part can I play in making a difference in positive change?”\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Play at Milwaukee on Saturday.\n\n\r\n                    Grizzlies: End a four-game homestand against the Brooklyn Nets on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996985.8723578
}