{
  "game_id": "0022200865",
  "espn_id": "401469020",
  "date": "Feb 13, 2023",
  "matchup": "MIN @ DAL",
  "headline": "Irving's 26-point 4th not enough as Mavs fall to T-wolves",
  "body": "DALLAS -- — Kyrie Irving was trying to get Luka Doncic a shot. The All-Star guard for the Dallas Mavericks was trying to do the same for his new teammate making his home debut. \n\n\r\n              Neither one of them got a shot off in the closing seconds, and the Mavs' big comeback attempt came up short against the Minnesota Timberwolves.\n\n\r\n              “Man. I’m still trying to emotionally recover ... still so raw,” Irving said. “Oh, man. I would have liked to at least get a shot up.”\n\n\r\n              Irving had the highest-scoring fourth quarter of his career, scoring 26 of his 36 points in the final 12 minutes Monday night. But he made a bad pass after stepping inside the 3-point line on the final possession after Minnesota had thrown off the timing between him and Doncic by knocking the inbound pass into the backcourt. The Timberwolves nearly blew a 26-point lead but held on to win 124-121.\n\n\r\n              After Doncic tracked down the tipped inbound pass, he passed to Irving before crossing midcourt. Irving pump-faked a 3 and passed back to Doncic, who almost immediately gave it back to him on a bounce pass before the final turnover.\n\n\r\n              “Great stop. Guys wanted to play it out. Trust the defense in that moment,” Timberwolves coach Chris Finch said. “Did a really good job of kind of disrupting their play, pressuring and denying the catch. Forced it out. It became a broken play.”\n\n\r\n              Doncic, who finished with 33 points, said it was a great defensive play at the end for the visitors. \n\n\r\n              “We didn’t get a clear shot, we just passed (to) each other, but I think it was a great defense,\" Doncic said. \"I was trying to get him a shot, he was trying to give me a shot, At the end, nobody got a shot, but he was going off.”\n\n\r\n              It was the second game Irving and Doncic played together. The Mavs have lost both, falling in overtime at Sacramento on Saturday night. Irving, acquired a week ago from the Brooklyn Nets, had played two road games for Dallas before that — both victories.\n\n\r\n              “I really wanted this win,” Irving said. \n\n\r\n              First-time All-Star guard Anthony Edwards scored 32 points and Rudy Gobert had 21 points and 14 rebounds for the Timberwolves, who had their biggest lead at 89-63 on a long step-back jumper by Edwards midway through the third quarter.\n\n\r\n              Dallas had that deficit down to 107-97 with about nine minutes left after a 25-foot shot by Irving, who on their previous possession tipped in Josh Green’s miss of a reverse layup.\n\n\r\n              Irving, who made 11 of 12 shots in the fourth quarter, had a 3 in the final half-minute, soon after a turnover by Doncic.\n\n\r\n              There was a stretch a couple of minutes before that when Irving made a bounce pass to Theo Pinson, who missed the layup — but the newly acquired eight-time All-Star was there for the rebound and putback. Doncic added a 3-pointer right after that. \n\n\r\n              “I’ve got to get a shot up, if anything, or allow Luca to have some space to get a shot and not turn the ball over in that situation,” Irving said of the closing seconds. “So it’s on me, just be smart in those situations. But if you look at the overall game, you know, I’m just grateful we were even in that position.\"\n\n\r\n              Christian Wood added 24 points for the Mavericks. He had 18 of those in the second quarter, including 13 in a row at one point\n\n\r\n              Gobert was 9 of 9 from the field, and Jaden McDaniels was 7 of 8 while scoring 19 points.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Since a six-game losing streak to end 2022, Minnesota has had consecutive losses only once. The T-wolves are 15-8 in that stretch.\n\n\r\n              Mavericks: Tim Hardaway Jr. was out with right hamstring tightness after playing only 15 minutes before halftime at Sacramento. The Mavericks are still without Maxi Kleber, who has missed 31 games since December.\n\n\r\n              COURTSIDE VIEW\n\n\r\n              Wu Yibing, who Sunday at the Dallas Open became the first Chinese player to win an ATP Tour title, attended the game. The 23-year-old Wu overcame 44 aces, four match points and a third-set tiebreaker to beat John Isner in the final. Wu sat in the second row courtside, behind MLB commentator and former player Alex Rodriguez.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host Washington on Thursday night.\n\n\r\n              Mavericks: At Denver on Wednesday night, then play six consecutive home games after this weekend’s All-Star break.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995022.675282
}