{
  "game_id": "0021700921",
  "espn_id": "400975667",
  "date": "Feb 28, 2018",
  "matchup": "HOU @ LAC",
  "headline": "Rockets start fast, beat Clippers 105-92 for 14th straight",
  "body": "LOS ANGELES --  The Houston Rockets really didn't need an exclamation point to their dominating first quarter Wednesday night. James Harden provided one anyway.\n\nThe Rockets had already blown past the Clippers when Harden juked Wesley Johnson so badly, the defender stumbled and fell flat to the floor. Harden looked down at him for a long moment before calmly drilling a 3-pointer to give Houston a 31-7 lead.\n\nHouston's 14th consecutive victory was in hand early and the Rockets went on to win 105-92.\n\nHarden scored 17 of his 25 points in the first quarter, but claimed he wasn't trying to stare down the floored Johnson.\n\n\"I was just trying to figure out what he was doing,\" Harden said. \"I didn't know.\n\n\"I was looking at him and he was looking at me,\" Harden said. \"I was thinking, `What are you doing?' I was going to shoot it, but I was waiting to figure out what was going on. I was confused. And then I shot it.\"\n\nThe Clippers had played the previous night in Denver, while the Rockets had the day off.\n\n\"I'm thinking, `This is not a good matchup,\" Clippers coach Doc Rivers said.\n\n\"You could see it early. We were just dead. That's the slowest game that we've played in eight weeks. I tried every lineup but it just wasn't there. You could see it on their faces, but there was nothing you could do about it.\"\n\nThe Clippers rallied from 19 points down to beat Denver the previous night, but could not overcome their dismal start, never getting closer than eight points.\n\nNot against a confident Houston team that is absolutely rolling. The Rockets (48-13) matched their longest winning streak of the season and remained a half-game ahead of Golden State for the NBA's best record.\n\n\"We just feel like we can win every game right now,\" said Rockets coach Mike D'Antoni.\n\nClint Capela and Eric Gordon each scored 22 points for the Rockets, who made 13 3-pointers. Capela added 14 rebounds.\n\nTobias Harris led the Clippers with 24 points, with Montrezl Harrell added 22. Lou Williams and Milos Teodosic each scored 13.\n\nThe Clippers missed 16 of their first 19 shots, had 11 turnovers and trailed by as many as 27 points in the first quarter. Los Angeles shot 22.7 percent (5 of 22) for the period and trailed 34-12 at the end of the quarter.\n\n\"Offensively, we can score,\" Harden said. \"That's not the problem. Defensively when we're able to communicate and move our bodies and help each other out, we're at another level.\"\n\nTIP-INS\n\nRockets: Gordon returned after missing four games, one to a sore knee and the last three due to an illness. ... D'Antoni, on any spillover of hard feelings from the chippy Jan. 15 meeting with the Clippers, when several Rockets tried to enter the Clippers' locker room from a back corridor that resulted in two-game suspensions for Trevor Ariza and Gerald Green: \"That doesn't play any part in it. They're all grown men. They know better.\"\n\nClippers: Rivers made light of the previous meeting, saying: \"We've kind of barricaded all the secret passageways. ... We're going to build a wall. And I'm not paying for it, Houston is going to pay for it.\" ... F Danilo Gallinari missed his third consecutive game with a bruised right hand. ... G C.J. Williams was recalled from the G League. He last played with the Clippers on Jan.  10. Tyrone Wallace went back down.\n\nTHEY'RE LAUGHING NOW\n\nThe door in Houston's locker room that led to the back corridor used by several Rockets to enter the Clippers room after their previous meeting was covered with yellow tape Wednesday.\n\nThe tape read: \"Do Not Enter. CAUTION.\"\n\nUP NEXT\n\nRockets: Return home on Saturday to play Boston.\n\nClippers: Remain at home to meet New York on Friday.\n\n---\n\nMore AP NBA: www.apnews.com/tags/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993600.6985621
}