{
  "game_id": "0021800541",
  "espn_id": "401071217",
  "date": "Dec 30, 2018",
  "matchup": "SAC @ LAL",
  "headline": "Lakers rally in 4th quarter, defeat Kings 121-112",
  "body": "LOS ANGELES --  The Los Angeles Lakers gave LeBron James a big present for his 34th birthday on Sunday -- they proved they could win a game without him.\n\nThe Lakers trailed the Sacramento Kings by seven with 4:30 remaining in the fourth quarter before outscoring them 18-4 the rest of the way en route to a 121-114 victory. It is the first time in three games that the Lakers have won since James was sidelined with a groin injury.\n\nJames arrived at Staples Center a couple minutes after the game tipped off and got a rousing ovation. He left immediately after the game, and there is no timetable on when he will return to the court.\n\n\"When we feel comfortable on the basketball court it gives us a better chance to win,\" said Brandon Ingram, who scored 21 points, including nine in the fourth. \"We just continue to show growth in tight situations we are in.\"\n\nThe Kings led 110-103 with 4:30 remaining when the Lakers scored 12 straight points over a three minute span to take control. Ingram, who had seven points during the run, tied it at 110 with a pullup jumper and then hit a 3-pointer with 2:13 remaining to give Los Angeles a 113-110 lead.\n\nA steal and layup by Iman Shumpert brought the Kings within three, but Caldwell-Pope made a driving layup to make it a two-possession game.\n\nLakers coach Luke Walton said it was Ingram's most complete game of the season. The third-year forward also had a season-high nine assists and seven rebounds.\n\n\"He seemed to have a joy about him playing tonight that, when he has it, it is a lot of fun to watch,\" Walton said.\n\nKentavious Caldwell-Pope led the Lakers (21-16) with a season-high 26 points, and Josh Hart added 22.\n\nCaldwell-Pope had 17 points during the second half, including going 4 of 9 on 3-pointers.\n\n\"Coach wants me to shoot more and that's what I did tonight. It felt good to get a rhythm,\" Caldwell-Pope said.\n\nDe'Aaron Fox led Sacramento (19-17) with 26 points, while Buddy Hield and Bogdan Bogdanovic scored 21 apiece.\n\n\"This is one we should have closed out and we didn't,\" Hield said. \"We had our minds on going into 2019 with 20 wins but we have more work to do. We can't just be happy with where we are at right now.\"\n\nSacramento led by four at halftime and was up 85-74 with 5:35 remaining in the third quarter before the Lakers scored 12 straight points to take the lead. Caldwell-Pope keyed the run with nine points, including a pair of 3-pointers.\n\nThe Lakers' lead lasted only 15 seconds, however, as Hield hit a 3-pointer and the Kings outscored Los Angeles 11-6 over the remainder of the quarter.\n\nSacramento shot 53.8 percent from the field during the first three quarters and was 12 of 24 on 3-pointers. However in the final 12 minutes it was 8 of 24 from the field and just 1 of 10 from long distance.\n\nBOUNCING BACK\n\nIt was the second time in four nights that the Kings and Lakers played. Sacramento won 117-116 on Dec. 27 on a 3-pointer by Bogdanovic at the buzzer. That was the first game James had missed since injuring his groin during the Dec. 25 game at Golden State. The Lakers were 0-2 in James' absence.\n\nTIP-INS\n\nKings: Willie Cauley-Stein had 11 points and 12 rebounds. ... Fox also had seven assists, marking the 29th game he has had five or more, which is the fifth-most in the league.\n\nLakers: Kyle Kuzma added 18 points and Lonzo Ball 13. ... JaVale McGee scored eight points in his first game since Dec. 15. The 11-year center had missed seven games due to a respiratory infection. ... Hart's 17 first-half points is a career high, surpassing the 16 he had in the first 24 minutes against Memphis on Dec. 8.\n\nUP NEXT\n\nKings: Host Portland on Tuesday.\n\nLakers: Host Oklahoma City on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994876.080827
}