{
  "game_id": "0022400912",
  "espn_id": "401705478",
  "date": "Mar 08, 2025",
  "matchup": "CHA vs. BKN",
  "headline": "Hornets close with a 12-0 run to beat the Nets 105-102 and snap a nine-game losing streak",
  "body": "CHARLOTTE, N.C. -- — Miles Bridges scored 26 points and the Charlotte Hornets used a finishing 12-0 run to beat the Brooklyn Nets 105-102 on Saturday night and snap a nine-game losing streak.\n\n\r\n              Bridges added 12 rebounds, five assists and a huge blocked shot in the closing seconds for the Hornets, who trailed 102-93 with under 3 1/2 minutes remaining. Nick Smith Jr. scored 19 points while shooting 6 for 17 (3 for 9 from 3-point range) and 4 of 4 from the free-throw line.\n\n\r\n              D’Angelo Russell had 28 points, seven assists and six rebounds for the Nets, who lost their seventh straight. Ziaire Williams added 19 points.\n\n\r\n              Bridges scored 13 points in the first half and the Hornets went into halftime trailing 58-43. The Nets led 82-76 heading to the fourth. Smith led the Hornets with 17 points in the second half as their team outscored the Nets by 18 points over the final two quarters.\n\n\r\n              Takeaways\r\n              Nets: After their late collapse, the Nets' losing streak could last a while. Their next two games are against the Lakers and Cavaliers, with a matchup against Boston next Saturday.\n\n\r\n              Hornets: Charlotte won for the first time since its surprising victory over the Lakers in Los Angeles on Feb. 19. \n\n\r\n              Key moment\r\n              Cam Thomas got into the lane for a short jumper that could have put the Nets back into the lead with 4.7 seconds left but Bridges blocked the shot. \n\n\r\n              Key stat\r\n              Russell scored 15 points in the fourth quarter but the rest of the Nets combined for just two baskets and five points.\n\n\r\n              Up next\r\n              The Nets host the Lakers on Monday. The Hornets start a four-game road trip in Miami the same night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997700.740396
}