{
  "game_id": "0022400388",
  "espn_id": "401704954",
  "date": "Dec 22, 2024",
  "matchup": "TOR vs. HOU",
  "headline": "Brooks scores 27 points as Rockets beat Raptors 114-110 for first win in Toronto since 2019",
  "body": "TORONTO -- — Dillon Brooks scored 27 points, Jalen Green had 22 and the Houston Rockets won in Toronto for the first time in more than five years by beating the struggling Raptors 114-110 on Sunday night.\n\n\r\n              Alperen Sengun had 17 points and 10 rebounds for the Rockets, who hadn’t won in Toronto since Dec. 5, 2019. Current Rockets guard Fred VanVleet scored 20 points for the reigning NBA-champion Raptors in that game.\n\n\r\n              Ja’Kobe Walter fouled out with a career-high 27 points and Chris Boucher and Ochai Agbaji each added 15 as Toronto’s losing streak reached seven. The Raptors have lost six straight at home.\n\n\r\n              Walter scored Toronto’s first 14 points of the game, a run that ended when Gradey Dick made a free throw with 7:06 remaining in the opening period.\n\n\r\n              Jamal Shead had 11 points and a career-high 10 assists for the Raptors.\n\n\r\n              Toronto’s RJ Barrett missed his second straight game because of an illness.\n\n\r\n              Takeaways\r\n              Rockets: VanVleet was injured when the Rockets lost at Toronto last season. In his first appearance as a visitor, he had eight rebounds and five assists but didn’t score until the final minute of the game. VanVleet shot 1 for 10, missing all five of his 3-point attempts.\n\n\r\n              Raptors: Scottie Barnes had 10 rebounds but scored only six points. He shot 2 for 15 and went 0 for 8 from distance, missing his first eight field goal attempts.\n\n\r\n              Key moment\r\n              Sengun fed Cam Whitmore for a one-handed alley-oop dunk that gave Houston a 99-91 lead, its biggest of the game at that point, with 6:58 left in the fourth quarter.\n\n\r\n              Key stat\r\n              Houston allowed 23 points on 14 turnovers in the first half. It cleaned things up after the break, but its 21 turnovers were a season-worst.\n\n\r\n              Up next\r\n              Both teams play on the road Monday, with Houston in Charlotte and Toronto visiting New York.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996978.6734369
}