{
  "game_id": "0022401102",
  "espn_id": "401705668",
  "date": "Apr 01, 2025",
  "matchup": "MIN @ DEN",
  "headline": "Alexander-Walker hits 2 free throws, Wolves weather 61-point night by Jokic in 140-139 win in 2 OTs",
  "body": "DENVER -- — Nickeil Alexander-Walker hit two of three free throws with 0.1 seconds remaining and the Minnesota Timberwolves overcame a career-best 61-point performance from Nikola Jokic to outlast the Denver Nuggets 140-139 in double overtime on Tuesday night.\n\n\r\n              The final play concluded a wild sequence as Russell Westbrook stole the ball on one end in the closing seconds, missed a layup and then fouled Alexander-Walker in the corner. The Timberwolves guard made two and missed the third one on purpose.\n\n\r\n              Anthony Edwards led Minnesota with 34 points.\n\n\r\n              Jokic's 61 points were the most by a player in the NBA this season. He also had 10 rebounds and 10 assists for the third 60-point triple double in NBA history. He played 52 minutes, 38 seconds and didn't leave the floor after halftime.\n\n\r\n              Jokic hit two free throws with 13.9 seconds remaining to tie it at 112 in regulation. He knocked in a floater with 7.3 seconds left to knot it up at 125 in the first overtime.\n\n\r\n              The game had a playoff intensity and featured 21 lead changes. The Timberwolves have now won six straight over the Nuggets, including playoffs.\n\n\r\n              The Timberwolves were without Naz Reid and Donte DiVincenzo, who were suspended one game by the league for their roles in an on-court altercation against the Detroit Pistons on Sunday.\n\n\r\n              Denver didn't have Jamal Murray (hamstring) or Michael Porter Jr. (personal reasons).\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota's bench outscored the Nuggets' reserves 40-14.\n\n\r\n              Nuggets: Jokic finished 18 of 29 from the floor, including six 3-pointers. \n\n\r\n              Key moment\r\n              A crazy play near the end of the second overtime when Jokic was fouled by Jaden McDaniels in a jump ball situation. Jokic made one free throw to give the Nuggets a 139-138 lead.\n\n\r\n              Key stat\r\n              The Nuggets drop to 18-3 at home when tied or leading after the first quarter. They led by 16 in the opening quarter. \n\n\r\n              Up next\r\n              The Nuggets host San Antonio on Wednesday, while the Timberwolves play at Brooklyn on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998072.355367
}