{
  "game_id": "0021600118",
  "espn_id": "400899568",
  "date": "Nov 10, 2016",
  "matchup": "CHI @ MIA",
  "headline": "Wade a winner again in Miami, Bulls top Heat 98-95",
  "body": "MIAMI --  For 13 years, Dwyane Wade made plenty of what the Miami Heat call \"winning plays.\"\n\nHe made another one Thursday.\n\nAnd the Heat didn't enjoy this one.\n\nWade turned a debated foul call into two big free throws with 13.7 seconds remaining, helping the Chicago Bulls hang on for a 98-95 win and ensuring that his return to the arena he called home for 13 seasons would be a winning one.\n\nIt was Wade's first time facing the Heat as an opponent, and afterward he seemed more than a little relieved that this was over.\n\n\"I can only imagine what he was going through today,\" Bulls coach Fred Hoiberg said. \"A lot of emotions coming back here.\"\n\nChicago was up 94-92 when Wade got the call that went against Miami's Justise Winslow, a foul along the sideline on an inbounds pass where it appeared that the 12-time All-Star may have embellished a bit for effect.\n\nIf he did, it worked.\n\n\"If it was last year, he got pushed out of bounds,\" a smiling Heat coach Erik Spoelstra said. \"This year? He's selling it.\"\n\nJimmy Butler scored 20 points and Rajon Rondo finished with 16 points and12 rebounds for the Bulls. Robin Lopez had 16 for Chicago, and Wade scored 13 on 5-for-17 shooting.\n\n\"I thought I'd shoot better, since I've been knowing these rims for a while,\" Wade said.\n\nBut he made the two big free throws when it counted most, and acknowledged afterward that he might have gotten a break.\n\n\"I got the vet call,\" Wade said.\n\nSaid Winslow: \"I didn't agree with the call. I think that was because of the stage, because of him being back here. I don't think if he was at another venue, another regular game, they would have made that call.\"\n\nRobin Lopez had 16 points for Chicago, which prevailed in a game that had 14 ties and 19 lead changes. Doug McDermott scored 13 for the Bulls, and Nikola Mirotic added 10.\n\nHassan Whiteside led Miami with 20 points and 20 rebounds. Dion Waiters and Josh Richardson each scored 16 for the Heat, who lost point guard Goran Dragic to a sprained left ankle in the third quarter.\n\nWinslow scored 15 and Tyler Johnson added 14 for Miami.\n\nRichardson tied the game with a 3-pointer with 6:13 remaining, but the Bulls scored the next six points and led the rest of the way. After the game, Wade went over and greeted the wife of Heat managing general partner Micky Arison, then general manager Andy Elisburg before leaving the floor and blowing a kiss to the fans who remained.\n\n\"That was the most emotional part of the night for me,\" Wade said.\n\nTIP-INS\n\nBulls: Wade spent the last couple of minutes of halftime greeting Heat staff -- with a big hug for Spoelstra. ... Wade has made a career on his pump fake, which he taught to some Heat players, and Johnson burned him with it in the second half. \"It's good that he takes notes,\" Wade said.\n\nHeat: It was the third career 20-20 game for Whiteside. The only player to have more in a Heat uniform is Rony Seikaly, with 12. ... Winslow entered the game in a 10-for-43 slump over his last three games, then shot 6 for 12 on Thursday. ... Dragic left in a walking boot, but X-rays were negative.\n\nGOOD JOB\n\nRondo isn't always the friendliest sort with opponents, but when he got a layup blocked by Whiteside with 5:20 left he offered the Heat center a congratulatory hand-slap.\n\nNO SHOWDOWN\n\nThere was one thing Wade wanted that he didn't get Thursday: He wanted to be on the floor with Udonis Haslem, his teammate on all three Miami championship teams. \"Let me get 1-on-1 with UD, that's what I've been waiting on. That right there would make my night,\" Wade said. Spoelstra said he was disappointed that he didn't make it happen.\n\nUP NEXT\n\nBulls: Host Washington on Saturday. It's the lone home game in a stretch where Chicago plays eight of nine on the road.\n\nHeat: Host Utah on Saturday. The teams split two meetings last season.\n\n---\n\nThis story has been corrected to show Rajon Rondo had 12 rebounds, not 12 assists.",
  "source": "espn_api",
  "crawled_at": 1764995104.562072
}