{
  "game_id": "0022000416",
  "espn_id": "401267576",
  "date": "Feb 14, 2021",
  "matchup": "LAL @ DEN",
  "headline": "Jokic powers Nuggets by Lakers, Davis re-aggravates Achilles",
  "body": "DENVER -- — The sight of Anthony Davis limping off the court was hard for the Los Angeles Lakers to shake. \n\n\r\n                    They never really recovered. \n\n\r\n                    Nikola Jokic recorded his sixth triple-double of the season and the Denver Nuggets beat the Lakers 122-105 on Sunday night in a game in which Davis re-aggravated his sore right Achilles. \n\n\r\n                    Once he exited late in the first half, the Nuggets turned a close game into a runaway.\n\n\r\n                    Now, the only thought for the Lakers is the result of Davis' MRI on Monday for what the team called a strain. \n\n\r\n                    “I don’t want to mess around with this type of injury,” Davis said. “Just trying to figure out the best steps.” \n\n\r\n                    The spotlight was on the showdown between Jokic and LeBron James, who are both among the favorites in the NBA MVP race. Jokic finished with 23 points, 16 rebounds and 10 assists. James had 22 points, 10 rebounds and nine assists, but the Lakers' seven-game win streak ended.\n\n\r\n                    For his big game, Jokic credited a new mindset.\n\n\r\n                    “If I’m open, shoot it,” Jokic said. “If I see someone is coming, just pass the ball. Don’t overthink anything.”\n\n\r\n                    Los Angeles never got back on track after Davis limped to the locker room. He was banged up when he tried to drive around Jokic with 2:39 left before halftime. \n\n\r\n                    Davis hobbled to the free-throw line, made both and then was subbed out. He finished with 15 points and four rebounds in 14 minutes.\n\n\r\n                    Entering the game, Davis was questionable with what was described as right Achilles tendinosis. He missed two contests due to the ailment before returning in a win over Memphis on Friday.\n\n\r\n                    James now has some advice for Davis: Take all the time he needs. Don't rush back.\n\n\r\n                    “Just want him to be healthy and get back to full strength,” James said. “All I care is about his health.\"\n\n\r\n                    Jamal Murray scored 25 points for Denver in its third straight win. Zeke Nnaji had 16 points, and fellow reserve Facundo Campazzo finished with 15.\n\n\r\n                    “In this business, you never know when your number is going to be called,” Nuggets coach Michael Malone said. “You better be ready when it's called. That's what I'm proud of most.” \n\n\r\n                    This was meeting No. 2 of the season between the teams that advanced to the Western Conference finals last season. In the first contest on Feb. 4, the Lakers trailed by 12 points in the third quarter before going on a big run to take control. They outscored the Nuggets 68-35 in the second half for a a 114-93 win.\n\n\r\n                    Only this time, the third quarter wasn't an issue. Denver outscored the Lakers 30-24 in the third to open a comfortable lead and stretched it to as many as 21 in the fourth.\n\n\r\n                    And while the Lakers were able to rally from 20-point deficits in their last two wins, they couldn't storm back in this one.\n\n\r\n                    “It’s definitely deflating anytime you lose a big player — a big guy on your team,” James said. “We have a lot of things that's built in around A.D. and a lot of other players. When he goes down, you have to switch up. That hurt us.”\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: F Kyle Kuzma scored 19 points and grabbed eight rebounds. \n\n\r\n                    Nuggets: Gary Harris (left adductor strain), Will Barton III (personal reasons) and P.J. Dozier (strained right hamstring) were out. ... F Paul Millsap didn't play in the second half due to a sprained left knee. He had 10 points. \n\n\r\n                    LONG-RANGE SLUMP \n\n\r\n                    Lakers guard Kentavious Caldwell-Pope has been in a slump since hitting 7 of 10 from 3-point range on Jan. 21 at Milwaukee. He is 9 of 36 from deep since that game, including 1 of 4 Sunday.\n\n\r\n                    “He’s just not getting as many clean looks,” Lakers coach Frank Vogel said. “It’s not anything I’m worried about.”\n\n\r\n                    HOW ABOUT THAT PASS\n\n\r\n                    Campazzo had a no-look pass in the first quarter that whirled past the head of Kuzma and straight to Nnaji, who drained the 3-pointer.\n\n\r\n                    EVEN BETTER? \n\n\r\n                    For as good as the NBA champion Lakers were last season, Malone believes their additions of Montrezl Harrell, Dennis Schröder and Marc Gasol takes them to an even higher plateau.\n\n\r\n                    “In my opinion, and no disrespect to any players that are not back ... I think they’re even better this year with the talent they’ve brought in,” Malone said.\n\n\r\n                    UP NEXT \n\n\r\n                    Lakers: At Minnesota on Tuesday. Beat the Timberwolves 127-91 on Dec. 27.\n\n\r\n                    Nuggets: Begin a four-game trip Tuesday in Boston.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997311.899847
}