{
  "game_id": "0022300492",
  "espn_id": "401585120",
  "date": "Jan 05, 2024",
  "matchup": "TOR @ SAC",
  "headline": "Domantas Sabonis records another triple-double as Kings hold off Raptors 135-130",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had 24 points, 15 rebounds and 11 assists for his second consecutive triple-double, and the Sacramento Kings held off the Toronto Raptors 135-130 on Friday night.\n\n\r\n              De’Aaron Fox also scored 24 for the Kings, who have won four of five. Keegan Murray had 18 points and 12 rebounds, and Harrison Barnes scored 16.\n\n\r\n              Sabonis has eight triple-doubles this season and three in his last four games. The star center notched the latest one with an alley-oop pass to Malik Monk early in the fourth quarter.\n\n\r\n              “It seems like it’s a common theme after every game, he's getting a triple-double. Which is unique, especially for his position,” Kings coach Mike Brown said. \n\n\r\n              Sabonis fouled out with just more than a minute to go and the Kings up by three, but Sacramento hung on with Chris Duarte subbing in. \n\n\r\n              “He does everything for us,” Fox said of Sabonis. “He's the hub of our offense and even better for us defensively as well. We ask him to do so much for us: rebound, score the ball, play-make, screen. That takes a lot out of a person, but he’s been well-equipped for it and he’s dominated at it.”\n\n\r\n              The Raptors, with a 40-point third quarter, cut their deficit to 10 to start the fourth and made it a two-point game with under three minutes to play on a 3-pointer by Immanuel Quickley.\n\n\r\n              But with Toronto down by three, Quickley missed a 3 with 11 seconds remaining and then a longer one with two seconds to go. Murray grabbed the rebound and sank two free throws to seal it.\n\n\r\n              Quickley and Scottie Barnes paced the Raptors with 20 points apiece. Dennis Schroder and Pascal Siakam both scored 18.\n\n\r\n              Raptors coach Darko Rajaković credited his team for its “physicality and grit.\"\n\n\r\n              “When you’re down 20, you have a decision to make, if you’re going to quit or are you going to continue fighting?” Rajaković said. “Our group stayed together and they continued fighting. We found a way to get back in the game.”\n\n\r\n              All five starters on both teams finished in double figures. Sacramento outscored Toronto 42-15 from beyond the arc.\n\n\r\n              Sacramento ended the first half on a 9-0 run to take a 20-point lead into halftime. Murray made back-to-back 3s, then Monk and Barnes hit consecutive 3s. Fox’s layup plus the foul put the Kings up 77-57 at the end of the first half.\n\n\r\n              Sabonis scored 12 points in the first quarter to spark the Kings early. \n\n\r\n              Brown said the Kings can play better, especially after a second half in which they gave up 77 points and let the Raptors back into the game.\n\n\r\n              “We've shown we can score,” Brown said. “There’s been some times when the ball is not going into the hole, and that’s when your defense really has to step up. And if you can rely on that to a certain degree, then the sky’s the limit.”\n\n\r\n              Toronto had won two straight since trading OG Anunoby to New York for Quickley and RJ Barrett, its first two-game win streak since November. The Raptors are on a six-game West Coast trip, and trade rumors continue to swirl with Siakam reportedly also on the market.\n\n\r\n              “Players and coaches, we wake up every morning, we have a task. We have a shootaround, we have a practice, we have a game to play,\" Rajaković said. \"Obviously, it’s never easy to hear that kind of stuff. As much as you can, block the outside noise.\"\n\n\r\n              Toronto was without Gary Trent Jr., who bruised his left quadriceps against Memphis on Wednesday.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Visit the Golden State Warriors on Sunday.\n\n\r\n              Kings: Host the New Orleans Pelicans on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995428.056118
}