{
  "game_id": "0021500414",
  "espn_id": "400828301",
  "date": "Dec 21, 2015",
  "matchup": "CHI vs. BKN",
  "headline": "Lopez, Young lead Nets to 105-102 victory over Bulls",
  "body": "CHICAGO -- Roughly 24 hours after one of their worst performances, the Brooklyn Nets produced one of their best on Monday night.\nBrook Lopez had 21 points and 12 rebounds, Thaddeus Young added 16 points and 13 rebounds and the Nets beat the Chicago Bulls 105-102 to end a five-game losing streak.\n\"We came in focused, we were energetic and our bench did a great job of coming in keeping the energy high and responding to runs,\" Lopez said. \"We were all there for each other. We were pulling for each other.\"\nIt was quite a contrast from Sunday when the Nets suffered a 100-85 home loss to Minnesota.\n\n\"We just did everything better,\" Brooklyn coach Lionel Hollins said. \"I thought we came out from the start with a lot of fight and purpose.\"\nJimmy Butler had 24 points, Pau Gasol added 20 points and the Bulls lost their third straight.\nButler said before the game that he didn't regret his critical comments of first-year coach Fred Hoiberg two days earlier following a loss in New York. He was 11 for 20 from the field in this one.\nHoiberg was surprised his team didn't respond with a better effort.\n\"It's very disappointing,\" he said. \"This is a tough loss. You have to win your home games. We've dropped a couple in a row now. It's a bad, bad loss.\"\nBrooklyn led by as many as 12 points before taking an 85-78 advantage into the fourth.\nChicago opened the final quarter with four quick points to pull within 85-82, but the Nets responded with a 9-2 spurt to make it a double-digit advantage once again.\nThe Bulls rallied again and Gasol hit a pair of free throws with 20.9 seconds left to make it 101-99.\nWith the shot clock off at that point, the Bulls had to foul and Jarrett Jack sank both free throws for a 103-99 edge with 10.6 seconds to go. Lopez then blocked Butler's shot attempt, grabbed the loose ball and was fouled with 4.8 seconds remaining. He iced the game with a pair of free throws. Butler hit a meaningless 3-pointer with a tenth of a second left.\n\"Butler made some tough shots, obviously, but for the most part we stuck together and clamped down defensively, limiting them to one shot,\" Lopez said. \"That gives you a lot of confidence when you're coming down the other end in control of the game.\"\nTIP INS\nNets: G Joe Johnson was 10 for 38 in his last four games, including 2 for 10 Sunday against the Timberwolves. He went 5-for-15 shooting in this one. \"He's just not finishing some of the shots he normally finishes,\" coach Lionel Hollins said. \"That happens.\"\nBulls: Hoiberg changed the starting lineup on Monday. Nikola Mirotic started at small forward in place of Tony Snell. \"Just to change the roles a little bit and get a little more size in there,\" Hoiberg said. The main reason, though, more likely was to create playing time for rookie Bobby Portis. With Mirotic starting, Portis played the backup minutes at power forward, while Snell, who has started 21 games, was out of the rotation.\nNOAH INJURED\nChicago center Joakim Noah left the game late in the third quarter with what the team called a left shoulder sprain. \"The X-ray turned out to be negative, so that was positive,\" Noah said. \"We'll see how I feel (Tuesday).\"\nNoah was defending on a play when Brooklyn's Andrea Bargnani, after jumping, came down hard on Noah's left arm, bending it back awkwardly.\nNoah, who was called for a foul on the play, ran around the court in obvious pain with his left shoulder slumped over for a moment before heading off the court and into the tunnel leading to the Chicago locker room.\n\"Something popped out and then went back in,\" he said. \"It's pretty painful.\"\nNoah, who had his arm in a sling, will have an MRI on Tuesday.\nUP NEXT\nNets: Host the Dallas Mavericks on Wednesday night.\nBulls: Visit the Oklahoma Thunder on Christmas Day.",
  "source": "espn_api",
  "crawled_at": 1764993949.707218
}