{
  "game_id": "0022300075",
  "espn_id": "401584703",
  "date": "Oct 26, 2023",
  "matchup": "MIL vs. PHI",
  "headline": "Lillard scores 39 points in his Bucks debut to help Milwaukee edge the Philadelphia 76ers 118-117",
  "body": "MILWAUKEE -- — Damian Lillard acknowledged this season opener felt a little different from the others as he adjusted to switching teams for the first time.\n\n\r\n              But the results he delivered were familiar to anyone who watched the seven-time All-NBA guard during his 11 years in Portland.\n\n\r\n              Lillard scored 39 points and the Milwaukee Bucks regrouped after blowing a 19-point lead to beat the Philadelphia 76ers 118-117 on Thursday night. Lillard had the highest point total for a player making his Bucks debut, surpassing the 34 that Terry Cummings scored in 1984.\n\n\r\n              “It was definitely different,” Lillard said. \"I think I've been in an environment where I come in the arena and know everybody that works in the arena. When I get on the court, I look around and I even recognize the fans that have been there year after year after year. It's just a super, super familiar environment that I'd been in.\n\n\r\n              “And when I come here, it kind of feels like a road game right now. It's like I'm looking around like I'm the new guy, even though I've been in this league a long time. ... I came in here to be a part of winning, and I think I've started to settle in just by how I've been embraced and what the team is saying to me behind closed doors.”\n\n\r\n              Giannis Antetokounmpo added 23 points and 13 rebounds while shooting 10 of 22 from the floor to become the franchise’s career leader in baskets. Antetokounmpo has 5,905 career field goals, while Kareem Abdul-Jabbar made 5,902 baskets with the Bucks from 1969-75.\n\n\r\n              Tyrese Maxey scored 31, Kelly Oubre Jr. had 27 and Joel Embiid 24 for the 76ers.\n\n\r\n              Lillard had requested a trade in the offseason and landed in Milwaukee, which gave up two-time All-Star Jrue Holiday, Grayson Allen and plenty of draft capital to land him.\n\n\r\n              Lillard continually came up big down the stretch and scored Milwaukee's final 11 points.\n\n\r\n              “He had the hot hand,\" Antetokounmpo said. \"You’ve just got to keep on feeding him. What works, you've got to keep going to what works.”\n\n\r\n              Lillard put the Bucks ahead for good 105-104 by sinking a 3-pointer with 3:41 remaining. Antetokounmpo got an offensive rebound on his own miss and found Lillard open behind the arc.\n\n\r\n              His basket started an 11-0 run that gave Milwaukee a nine-point lead with 2:45 remaining. The 76ers scored seven straight points to get the margin down to two, but Lillard answered by sinking another 3-pointer with 1:13 left.\n\n\r\n              After Tobias Harris made a 3-pointer to make it a two-point game again, Lillard drove to the basket, drew a foul and sank two game-clinching free throws with 11.5 seconds left. Lillard made all 17 of his free-throw attempts.\n\n\r\n              “You just got a sense during the game, he wasn't going to let us lose,” Bucks coach Adrian Griffin said.\n\n\r\n              This game marked the head coaching debut for Griffin, who was facing his former boss. Griffin spent the last five seasons as an assistant coach on a Toronto Raptors staff headed by Nick Nurse, who now coaches the 76ers. \n\n\r\n              After trailing 57-38 late in the second quarter, the 76ers clawed their way back and pulled ahead by going on a 14-0 run early in the fourth quarter. But they couldn't slow down Lillard the rest of the way.\n\n\r\n              “I do like the way we adjusted to some things and played a lot better (after falling behind early),” Nurse said. “We had every opportunity to win that game.”\n\n\r\n              The 76ers were playing without seven-time All-NBA guard James Harden. The 2018 MVP, hoping to be traded, arrived late to training camp and said before the season that his fractured relationship with team president Daryl Morey couldn’t be repaired.\n\n\r\n              Harden arrived at the 76ers’ complex in Camden, New Jersey, on Wednesday but was told not to accompany the team to Milwaukee. Nurse said Wednesday that Harden is back in the “ramp-up phase” after being away from the team for 10 days.\n\n\r\n              UP NEXT\n\n\r\n              76ers: At Toronto on Saturday as Nurse faces his former team.\n\n\r\n              Bucks: Host the Atlanta Hawks on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996164.9056451
}