{
  "game_id": "0021700705",
  "espn_id": "400975451",
  "date": "Jan 24, 2018",
  "matchup": "TOR @ ATL",
  "headline": "Valanciunas posts double-double, Raptors crush Hawks 108-93",
  "body": "ATLANTA --  On a night starter Jonas Valanciunas earned credit for setting a high-energy tone in a runaway win, Toronto coach Dwane Casey still criticized a lackadaisical final few minutes from his backups.\n\nThe explanation from Casey was simple: \"We're building for something bigger.\"\n\nValanciunas had 16 points and 13 rebounds, and the rested Raptors used strong 3-point shooting to beat the Atlanta Hawks 108-93 on Wednesday night.\n\nPlaying in their first game since Saturday's loss at Minnesota, Toronto made 14 3-pointers, including eight in the first half. The Raptors improved to 25-6 when making at least 10 3s this season.\n\nToronto's big lead was 32 points, but Atlanta's reserves, led by rookie John Collins' 13 points and career-high 16 rebounds, had the stronger finish to the game.\n\n\"It was a letdown at the end,\" Casey said. \"I was disappointed at the way that last group went in. It's a game of habits and that's what I just told the young guys. ... You create bad habits and it shows up in weird places.\"\n\nCasey wants his players to win home-court advantage throughout the conference playoffs. The Raptors entered the game 1  1/2 games behind Boston in the race for the No. 1 seed in the East.\n\nFred VanVleet added 19 points off the bench and All-Star starter DeMar DeRozan had 14 as Toronto moved to 3-0 against Atlanta this season. The Raptors won the first two games of the season series by an average of 23.5 points.\n\n\"It feels like this year they've played really, really well against us,\" Hawks coach Mike Budenholzer said. \"I think you have to give them credit whey we have not played well.\"\n\nDennis Schroder led Atlanta with 20 points. Kent Bazemore had 13 points.\n\nThe Raptors had good reason to feel comfortable. They arrived in Atlanta on Sunday and in a rarity had time to focus on fundamentals in two practices.\n\n\"We tried to focus on getting back to the basics,\" said Jakob Poeltl, who had six points. \"... I think it showed tonight.\"\n\nToronto had 12 blocks and 10 steals.\n\nBefore the game, Casey wasn't sure what to expect following the unusually long rest.\n\n\"It's an unknown,\" Casey said. \"Hopefully it's good, the break is good, but sometimes rust is something else, too, when you get out of game rhythm.\"\n\nThe Raptors showed no rust. They were never threatened after stretching their lead to 17-6 with an 11-0 run, capped by Serge Ibaka's 3-pointer, in the first quarter.\n\nTIP-INS\n\nRaptors: Valanciunas reached double-double status with his rebound and jam midway through the third period. ... VanVleet finished three points shy of his career high of 22 points against Cleveland on Jan. 11. ... The Raptors coasted despite their two All-Stars, DeRozan and Kyle Lowry, combining to make only 7 of 22 shots. Lowry had nine points while making 3 of 10 shots.\n\nHawks: F DeAndre Bembry is expected to miss another one to three weeks after an MRI revealed a left adductor strain. He suffered the groin strain on Jan. 5 ... Schroder matched his career high with eight rebounds.\n\nNO HARM\n\nFollowing a video review, officials ruled no flagrant foul after Schroder had contact with Lowry in the third quarter, knocking Lowry to the floor.\n\nROOKIE HONOR\n\nCollins will represent the U.S. team in the Rising Stars game as part of All-Star weekend on Feb. 9 in Los Angeles. Collins is averaging 10.6 points and 6.9 rebounds and has made 59 percent of his shots from the field.\n\nCollins called the honor \"truly a blessing. This is something I've been working for all year. ... It will be fun.\"\n\nFREE SANDWICH\n\nThe biggest cheer of the night from the home fans came in the final minute. The Hawks offered every fan a free Chick-fil-A sandwich if a visiting player missed two straight free throws. With 34.9 seconds remaining, cheers began when Lucas Nogueira hit the rim on his first free throw. He drew iron again on his second miss, earning an unexpected ovation.\n\nUP NEXT\n\nRaptors: Host Utah on Friday night.\n\nHawks: Visit Charlotte on Friday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992867.203824
}