{
  "game_id": "0021900592",
  "espn_id": "401161234",
  "date": "Jan 13, 2020",
  "matchup": "IND vs. PHI",
  "headline": "Warren's big night, late block help Pacers rally past 76ers",
  "body": "INDIANAPOLIS --  When the Indiana Pacers were struggling offensively Monday, T.J. Warren bailed them out.\n\nHe did it defensively, too.\n\nWarren blocked a potential go-ahead 3-pointer with 29 seconds left, and the Pacers scored the final seven points for a 101-95 victory over the Philadelphia 76ers.\n\n\"Defensively, I've been more confident on that end,\" Warren said. \"I just made the big play when I could and the result was a win.\"\n\nIndiana has now beaten the 76ers twice in 14 days and holds the No. 5 spot in the Eastern Conference standings, a half-game ahead of Philadelphia.\n\nAnd yet in a game Malcolm Brogdon finished with 21 points, seven rebounds and nine assists, and Myles Turner and Domantas Sabonis both produced double-doubles, it was Warren's energy, ability to get to the rim and a critical defensive play that proved the difference.\n\n\"I think we just locked in on the defensive end,\" Turner said. \"I think that was really the story of the night.\"\n\nIt wasn't anything like Indiana's 115-97 rout on New Year's Eve.\n\nThis time, just about everyone on both teams struggled through three dreadful quarters.\n\nWarren and Ben Simmons were the exceptions.\n\nWhile Simmons finished the first half 9 of 11 from the field and staked the 76ers to a 49-40 halftime lead, Warren made just enough shots to keep the Pacers close.\n\nIt looked like that might change when the 76ers ran out to a 63-52 lead midway through the third quarter.\n\nBut Turner led the Pacers back with a 15-4 spurt to tie the score.\n\nJosh Richardson started to swing the game with a 17-point, fourth-quarter flurry that included two free throws to give the 76ers a 92-89 lead with 3:36 left. Instead, his 3 to make it 95-94 with 2:02 to go accounted for the only Philadelphia points the rest of the game.\n\nTurner made two free throws with 1:14 to go to give Indiana the lead, Warren kept it intact by blocking Tobias Harris' 3 and the Pacers closed it out at the free throw line.\n\nSimmons had 24 points and 14 rebounds, while Richardson finished with 23 points as Philadelphia fell to 1-2 since losing Joel Embiid with an injured finger on his left hand.\n\n\"We just have to make more open looks,\" Harris said. \"I think, all around, we haven't shot it well from 3 so we've got to stick with it. At the same time, we've make more of the shots we're getting.\"\n\nTIP-INS\n\n76ers: Simmons recorded his 21st double-double of the season. ... Harris had 15 points and 10 rebounds, his sixth double-double. ... Al Horford had 10 points and eight rebounds. ... Philadelphia fell to 1-2 in the season series. ... Richardson is 21 of 23 on free throws in his last four games. ... The 76ers had a 50-32 scoring advantage in the paint.\n\nPacers: Turner and Justin Holiday each had 14 points. Turner also had 10 rebounds. ... Warren had his fourth 20-point game of the season. ... Brogdon returned after missing eight of the previous nine games with a sore lower back and strep throat. ... Sabonis returned after missing one game with a sore left knee. Sabonis had 10 points and 16 rebounds. ... Brogdon and Sabonis were a combined 8 of 27 from the field.\n\nBIG DIFFERENCE\n\nThere's no question the 76ers are a different team without Embiid.\n\nSo coach Brett Brown is willing to take the challenge head on. Last week, he tried All-Star point guard Simmons in the post. On Monday, he canceled the pregame shootaround so they could contemplate more thoroughly what they needed to do to beat the Pacers on the road.\n\n\"We're still figuring some stuff out, like what's life like without Joel,\" Brown said. \"We miss him terribly but when we do absorb him back into the mix, I hope we have some momentum built up.\"\n\nQUOTABLE\n\n76ers: \"I think we had great energy to start then we started fouling too much,\" Simmons said. \"Too many guys were getting open, hot guys who were knocking down shots.\"\n\nPacers: \"There was definitely rust,\" Brogdon said. \"But I've got really patient teammates that continue to feed me, continue to trust me even though I'm not shooting a good percentage.\"\n\nUP NEXT\n\n76ers: Host Brooklyn on Wednesday in the first of two straight home games.\n\nPacers: Make their annual trip to Minnesota on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995851.707347
}