{
  "game_id": "0021601051",
  "espn_id": "400900446",
  "date": "Mar 21, 2017",
  "matchup": "CHI @ TOR",
  "headline": "Raptors snap 11-game losing streak against Bulls with 122-120 win",
  "body": "TORONTO --  The Toronto Raptors fought and scrapped their way to their first victory over the Chicago Bulls in years.\n\nDeMar DeRozan led the way.\n\nDeRozan had 42 points, and the Raptors snapped an 11-game losing streak against the Bulls by rallying for a wild 122-120 overtime win on Tuesday night.\n\n\"You don't want to have something lingering like that and go a couple of seasons where you can't beat a team,\" DeRozan said. \"When you're a competitor, just to have that in the back of your mind, it sucks.\"\n\nDeRozan set a franchise record with 38 shot attempts, making 17, and also finished with eight assists. Cory Joseph had 19 points for the Raptors, and Serge Ibaka scored 16 before he was ejected for his role in a memorable fight with Robin Lopez during the third quarter.\n\nJimmy Butler had 37 points, 10 rebounds and six assists for the Bulls, and Rajon Rondo scored a season-high 24. It was Chicago's first loss to Toronto since Dec. 31, 2013.\n\nFollowing a Butler 3-pointer with 3:58 remaining in the third quarter, giving Chicago a 16-point lead, Lopez swatted the ball out of the hand of Ibaka. The two squared up in the middle of a crowd and Lopez swung and missed Ibaka, who returned in kind, barely connecting with the head of the center.\n\nLopez and Ibaka were ejected following a long review period. Chicago forward Nikola Mirotic and Raptors assistant coach Jamaal Magloire received offsetting technical fouls after getting into a shoving match following the melee.\n\nWith Lopez throwing the first punch, Ibaka said he was simply trying to defend himself.\n\n\"I'm not just going to be out there and watch a man like him punch me and walk away,\" he said after his fourth career ejection.\n\nLopez was ejected for the sixth time in his career. He said he expects to be suspended for the fight.\n\n\"I think it was a really physical game, physical game for everybody,\" he said. \"Just kind of hit the flashpoint.\"\n\nThe Bulls opened a 109-94 lead on Paul Zipser's 3-pointer with 6:39 left in the fourth. But the Raptors responded with a 15-0 run, tying the game on Joseph's layup with 1:50 remaining.\n\n\"They were the aggressors on both sides of the floor, getting layups on one end and stops on the other,\" Butler said. \"Hell, that's how we were playing for the majority of the game. Whenever you're playing like that, the game turns quickly.\"\n\nToronto grabbed the lead for the first time on a turnaround jumper from DeRozan with 1:23 to play in overtime.\n\nDenzel Valentine missed a 3-point attempt on Chicago's next possession and Patrick Patterson had a tip-in layup to make it 119-115 Toronto with 44.7 seconds remaining.\n\nThe Raptors lead the NBA with 18 comeback victories after trailing by 10-or-more points.\n\nTIP-INS\n\nBulls: A pregame moment of silence was observed in honor of former Bulls general manager Jerry Krause. The team confirmed his death on Tuesday. ... In their 11-game winning streak over the Raptors, Chicago used 10 different starting lineups, before using an 11th different one on Tuesday. ... The Bulls' 11-game winning streak was their longest against the Raptors since a 15-game streak from Dec. 18, 2002-Dec. 29, 2006.\n\nRaptors: It was DeRozan's fifth 40-plus-point game of the season. He also matched his career high with his 54th 20-point game, set during the 2015-16 season. ... The Raptors improved to 5-0 when wearing their throwback Toronto Huskies blue uniforms.\n\nHEAVYWEIGHT MATCHUP\n\nRaptors coach Dwane Casey explained why there aren't many fights in the NBA these days.\n\n\"Not anymore, it's too expensive,\" he said. \"Believe me, Serge Ibaka doesn't have a malicious bone in his body, he's a competitor, so is Lopez. I don't think either one of them will go down as Rocky or anything like that.\"\n\nUP NEXT\n\nBulls: Host Detroit on Wednesday, needing a win to earn a season split of their four-game series.\n\nRaptors: Visit Miami on Thursday for the third of four meetings between the teams this season.",
  "source": "espn_api",
  "crawled_at": 1764995016.38302
}