{
  "game_id": "0022400001",
  "espn_id": "401703370",
  "date": "Nov 12, 2024",
  "matchup": "ATL @ BOS",
  "headline": "Dyson Daniels scores career-high 28 points, Jalen Johnson has triple-double as Hawks beat Celtics",
  "body": "BOSTON -- — Onyeka Okongwu tipped in a missed shot with 6.1 seconds left, and Jaylen Brown missed a jumper at the buzzer on Tuesday night as the Atlanta Hawks overcame a 15-point, second-half deficit to beat the Boston Celtics 117-116 in their NBA Cup opener.\n\n\r\n              Dyson Daniels scored a career-high 28 points, and Jalen Johnson had 18 points, 13 rebounds and 10 assists. Atlanta snapped a two-game losing streak despite playing without star Trae Young.\n\n\r\n              Brown scored a season-high 37 points and Derrick White added 31 for Boston as it opened the in-season tournament on a green floor with a special parquet design. The defending NBA champions had a two-game winning streak snapped and lost for just the third time this season. \n\n\r\n              Takeaways\r\n              The Hawks played better with Young out of the lineup with tendinitis in his right Achilles than they did on Nov. 4, when he shot 1 for 10 from the field in Boston's 123-93 victory. \n\n\r\n              Key moment\r\n              Tatum's 3-point attempt from the left corner with 24 seconds left and Boston leading 116-115 rimmed out. Daniels missed a floater, but Okongwu tipped it in to give the Hawks their first lead since the final seconds of the first quarter. \n\n\r\n              The teams traded turnovers on inbounds passes before White found Brown, who pulled up from 13 feet and shot off the rim.\n\n\r\n              Key stat\r\n              Tatum now has 12,208 points, passing Hall of Famer Tommy Heinsohn (12,194) for 12th on the Celtics' career scoring list.\n\n\r\n              Up next\r\n              The Hawks host the Washington Wizards on Friday in another NBA Cup game. The Celtics visit the Brooklyn Nets on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998300.986998
}