{
  "game_id": "0022400917",
  "espn_id": "401705483",
  "date": "Mar 08, 2025",
  "matchup": "ORL @ MIL",
  "headline": "Magic end 5-game skid with a 111-109 victory over the Bucks",
  "body": "MILWAUKEE -- — Paolo Banchero scored 29 points, Cole Anthony added 22 and the Orlando Magic beat Milwaukee 111-109 on Saturday to end a five-game skid and snap the Bucks’ four-game winning streak.\n\n\r\n              Orlando took the lead for good just over three minutes into the game and led 95-80 with less than nine minutes left before the Bucks rallied.\n\n\r\n              The Magic were clinging to a 111-109 lead when Milwaukee’s Taurean Prince stole the ball from Anthony, a backcourt turnover that led to the Bucks inbounding the ball from in front of Orlando’s bench with 6.6 seconds remaining. AJ Green passed the ball to Damian Lillard, who missed a 3-point attempt at the buzzer while being guarded by Franz Wagner and Banchero.\n\n\r\n              Giannis Antetokounmpo had 37 points and 11 rebounds for the Bucks, who lost for just the second time in their last 10 games. Lillard added 26 points.\n\n\r\n              Takeaways\r\n              Magic: The narrow victory was a refreshing change for Orlando, which had lost its last three games by a combined five points. After going 1-6 in a stretch of seven straight home games, Orlando won to open a five-game road swing.\n\n\r\n              Bucks: A victory Saturday would have been helpful for the Bucks because their schedule is about to get much tougher. Milwaukee's next eight games are all against teams with winning records.\n\n\r\n              Key moment\r\n              Milwaukee trailed 109-106 when Lillard drove to the basket and had his shot blocked by Orlando’s Kentavious Caldwell-Pope as the ball went out of bounds with 34.8 seconds left. Officials initially granted possession to Milwaukee, but Magic coach Jamahl Mosley challenged the call. A replay review determined the ball went out of bounds off Lillard, and Anthony found Caldwell-Pope for a dunk that made it 111-106 with 25.9 seconds remaining.\n\n\r\n              Key stat\r\n              Orlando had a 26-14 edge in bench points, led by Anthony Black's 11.\n\n\r\n              Up next\r\n              The Bucks host Cleveland on Sunday. The Magic are at Houston on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997528.182734
}