{
  "game_id": "0022200230",
  "espn_id": "401468385",
  "date": "Nov 18, 2022",
  "matchup": "DEN @ DAL",
  "headline": "Doncic gets 50th triple-double, Mavs top shorthanded Nuggets",
  "body": "DALLAS -- — Luka Doncic lobbied Jason Kidd to stay in the game at the start of the fourth quarter with Dallas well on its way to a blowout in the first of consecutive meetings with shorthanded Denver.\n\n\r\n              Neither the Mavericks' superstar nor his coach was aware Doncic needed one rebound to get to 50 career triple-doubles one game faster than Magic Johnson. Kidd obliged for other reasons.\n\n\r\n              After the milestone was reached in a 127-99 victory over the Nuggets on Friday night, a member of the Dallas public relations staff told Doncic what he had done.\n\n\r\n              “I told him that was great,” said Doncic, typically understated and never really one to pay much attention to such numbers in the first place.\n\n\r\n              Nuggets coach Michael Malone is just hoping for a little help against the three-time All-Star in the rematch Sunday night.\n\n\r\n              The Nuggets were without two-time MVP Nikola Jokic and two more starters in Jamal Murray and Aaron Gordon.\n\n\r\n              Murray joined Jokic, who missed a second straight game, in health and safety protocols. Gordon was out for a second game with a non-COVID-19 illness.\n\n\r\n              All three weren’t on the trip for the first of two games in Dallas. Malone said Gordon was the only one who might be available Sunday.\n\n\r\n              “I’m going to go home and pray the rosary tonight that we can get some help,” Malone said.\n\n\r\n              Christian Wood had 28 points and eight rebounds for the Mavericks, and Spencer Dinwiddie scored 15.\n\n\r\n              Kentavious Caldwell-Pope and Bruce Brown scored 18 points apiece for the Nuggets, who had little chance without their stars as Doncic rolled up 12 rebounds and 11 assists. \n\n\r\n              The NBA’s scoring leader went 11 of 22 from the field with his usual array of creative buckets in and around the lane and was 9 of 11 on free throws.\n\n\r\n              Even though rest was already an issue, with Doncic coming off a missed game and Dallas losing to lowly Houston without him, Kidd let Doncic start the fourth after playing all of the third.\n\n\r\n              The coach said he's considering some rotation options to try to ease the load on his 23-year-old star, and would like one of those to be rest in the third with starting the fourth.\n\n\r\n              They're still working on the part about rest in the third.\n\n\r\n              Doncic's 10th rebound came 65 seconds into the fourth quarter of his 278th game. Johnson had been the second-fastest to 50 triple-doubles at 279 games.\n\n\r\n              Oscar Robertson, who needed 111 games, and Doncic are the only 23-year-olds with 50 triple-doubles. Robertson was 221 days younger than the Dallas superstar.\n\n\r\n              “I don't look at the stat sheet, so I don't know if he has a triple-double or if he has 35 points,” Kidd said. “We've been playing him to start the fourth, so this is something we could be looking at going forward.” \n\n\r\n              Dinwiddie's 3-pointer started a 29-14 run to finish a 44-point second quarter, the biggest of any period this season for Dallas. An 18-point halftime lead never got below 12 after the break.\n\n\r\n              “That second quarter is when it all unfolded,” Malone said. “The first quarter was a pretty good quarter for us being as undermanned as we are. That was all the separation they needed.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Vlatko Cancar hit a running, pull-up 3 at the first-quarter buzzer to cut the Dallas lead to 29-27. He finished with eight points. ... Bones Hyland scored 17 points.\n\n\r\n              Mavericks: Dallas led 73-55 at halftime, tying its season high for points in either half. ... The double-digit margin was just the second in 15 games this season for Dallas. The other was a 41-point rout of Memphis. \n\n\r\n              UP NEXT\n\n\r\n              This is the second time the Nuggets have played the same team in consecutive games this season. They swept San Antonio earlier this month, winning in Denver, then in Texas two nights later. Dallas did it six times last season, getting swept once and splitting the other five.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994732.4115698
}