{
  "game_id": "0022400027",
  "espn_id": "401703396",
  "date": "Nov 22, 2024",
  "matchup": "BKN @ PHI",
  "headline": "McCain and Maxey help the 76ers rally to beat the Nets 113-98 and snap 5-game losing streak",
  "body": "PHILADELPHIA -- — Jared McCain scored 30 points and Tyrese Maxey added 26 as the Philadelphia 76ers snapped a five-game losing streak with a 113-98 win over the Brooklyn Nets in an NBA Cup game Friday night.\n\n\r\n              Playing without Joel Embiid (left knee swelling) and Paul George (left knee bone bruise), Philadelphia's young backcourt took over in the fourth quarter with an extended scoring burst that helped the Sixers rally from a nine-point deficit.\n\n\r\n              Both Embiid and George are expected to miss Sunday's game against the Los Angeles Clippers before being re-evaluated early next week.\n\n\r\n              Kelly Oubre Jr. added 11 points and nine rebounds for the Sixers (3-12, 1-2 NBA Cup), who won just their third game of the season and for the first time in regulation. Philadelphia's other wins came against Indiana (Oct. 27) and Charlotte (Nov. 10).\n\n\r\n              Brooklyn was led by Cameron Johnson, who scored 37 points. Keon Johnson added 18 points for the Nets (6-10, 1-2 NBA Cup), who have lost four of their last five games.\n\n\r\n              Takeaways\r\n              Nets: Brooklyn’s 19 turnovers led to 13 more shots by Philadelphia and 28 points.\n\n\r\n              76ers: With Embiid and George out, the growth of McCain — the club’s first-round pick out of Duke — has been one of the few bright spots. \n\n\r\n              Key moment\r\n              Maxey and McCain combined to score 19 straight points for the Sixers midway through the fourth quarter, turning a one-point deficit into a 12-point lead.\n\n\r\n              Key stat\r\n              McCain has scored 20 or more points in seven straight games.\n\n\r\n              Up next\r\n              Both teams are back in action Sunday night. The Nets are at Sacramento, while the Sixers host the LA Clippers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997999.149327
}