{
  "game_id": "0021601076",
  "espn_id": "400900471",
  "date": "Mar 24, 2017",
  "matchup": "PHX @ BOS",
  "headline": "Booker scores 70 in Boston, but Celtics outlast Suns 130-120",
  "body": "BOSTON --  Devin Booker is only 20 and already has a place alongside Wilt Chamberlain, Kobe Bryant and just a few others in NBA history.\n\nBooker scored 70 points , becoming the sixth different player to reach that total, but the Boston Celtics outlasted the Phoenix Suns 130-120 on Friday night.\n\nDavid Thompson, David Robinson and Elgin Baylor are the NBA's only other 70-point scorers. Baylor also held the previous record against the Celtics with 64 points in Minneapolis for the Lakers on Nov. 8, 1959.\n\n\"This doesn't happen very often especially against a really good defensive team like the Boston Celtics,\" Booker said. \"It's a zone. It's kind of hard to explain. I've been in those zones before, but never to this extent.\"\n\nIsaiah Thomas scored 34 points for Boston, which won its third straight and avenged its buzzer-beater loss in Phoenix earlier this month.\n\nThe rematch was dominated early by the Celtics, as they hit eight 3-pointers during a 37-point second quarter to grow their lead as high as 26 points.\n\nBooker then scored 51 after halftime , including 28 in the final period as his teammates fed him almost every time down the floor.\n\nCoach Earl Watson even used a pair of timeouts in the closing minutes to get him extra touches. As Booker's point total climbed, he even began to get cheers from some Boston fans. The entire display -- in particular Phoenix's attempts to prolong the game -- tweaked some Celtics players.\n\n\"It was weird what they were doing,\" Thomas said. \"I've never seen anything like that. It is what it is. ... But I mean it was obvious what they were trying to do. They were trying to get him the most points possible. Hats off to him. He played a hell of a game.\"\n\nWhatever the perception of others, Watson made no apologies.\n\n\"I'm not coming into any arena just happy to be there, trying to be liked. I don't care about being liked. I really don't care to be honest with you,\" he said. \"We're trying to build something with this young group. If people don't like us while we build it, so what? Do something about it.\"\n\nChamberlain had six 70-point games and his 62 points on Jan. 14, 1962, had been the most in a regular-season game in Boston.\n\nPhoenix has already been eliminated from playoff contention, and had only eight available players because of injuries. Younger than some lineups in the NCAA Tournament, the Suns have lost seven straight and nine of their last 10, and they were out of this one early before Booker's explosive performance made it interesting.\n\nHis previous career best was 39, which he reached three times before Friday. He had 19 points at halftime, then scored 23 in the third quarter to get the Suns back within range.\n\nTIP-INS\n\nSuns: The Suns' previous scoring record was held by Tom Chambers. He had 60 points March 24, 1990. ... Booker was 10 for 10 from the free throw line in the third quarter. ... T.J. Warren sat out with left foot contusion. ... Were outscored 37-27 in the second quarter.\n\nCeltics: Avery Bradley stayed overnight at the hospital Friday to get fluids and rest for what coach Brad Stevens said was a stomach bug that's been going around the locker room. Rookie Jaylen Brown made his 18th start of the season in Bradley's place. ...Thomas extended his club record to 47 straight games with a 3-pointer. ... It was Thomas' 121 straight game in double figures, the most by a Celtics player since Antoine Walker had 126 from 2000 to 2002.\n\nROAD RESPECT\n\nBooker said he'll always remember the cheers he got from Boston's fans down the stretch.\n\n\"That meant a lot, especially here in Boston. I know how rowdy they can be on opponents sometimes. I respect that. That's how it should be,\" he said. \"It's a night I'm going to remember the rest of my life.\"\n\nROOM TO IMPROVE\n\nCeltics coach Brad Stevens said that one thing Booker's scoring run in the third and fourth quarter showed was that his team has a lot of room to improve before the playoffs.\n\n\"We don't play with enough sustained level of play and that' pretty consistent for us,\" he said.  \"I'm surprised at where we are record-wise, because we've got to play at a higher level for 48 minutes. We just don't do it.\"\n\nUP NEXT\n\nSuns: Continue their six-game road trip at Charlotte Sunday.\n\nCeltics: Host the Miami Heat on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995946.1159942
}