{
  "game_id": "0021900912",
  "espn_id": "401161554",
  "date": "Mar 03, 2020",
  "matchup": "OKC vs. LAC",
  "headline": "Leonard scores 25, leads Clippers past Thunder 109-94",
  "body": "OKLAHOMA CITY --  Kawhi Leonard scored 25 points to help the Los Angeles Clippers beat the Oklahoma City Thunder 109-94 on Tuesday night.\n\nThe Clippers held Oklahoma City to 42% shooting as coach Doc Rivers moved into sole possession of 12th place in NBA history with 936 wins.\n\n\"We played defense the whole game,\" Rivers said. \"They made a couple of runs, but that's what they do. But we kept responding. We responded with big baskets and lots of stops. I thought our defense today was extraordinary.\"\n\nMontrezl Harrell and former Thunder player Paul George each added 16 points for the Clippers, who won their fifth straight.\n\nGeorge received a warm reception from Oklahoma City's fans. He spent two seasons with the Thunder and was third in the MVP balloting last season before the team traded him last summer.\n\n\"I had a short stint here, but the way they embraced me and took me in the second I stepped foot here from day one -- it was a huge impact,\" George said. \"That's the reason I still want to do community work here. I still want to be established as a Sooner here, as an Oklahoman.\"\n\nDennis Schroder scored 24 points and former Clippers Shai Gilgeous-Alexander and Danilo Gallinari each scored 15 for the Thunder, who lost their second straight. The 15-point margin matched Oklahoma City's worst home loss of the season.\n\n\"I thought we had moments in time in the game where we got stagnant on offense,\" Thunder coach Billy Donovan said. \"I think some of that had to do with their length and their size and their athleticism.\"\n\nOklahoma lost 133-86 to Milwaukee on Friday night.\n\n\"I think these last two games, playing against Milwaukee and playing against the Clippers, obviously two elite teams -- I'm hopeful that we can keep getting better because in these kinds of games, things get exposed that you have to work on and have to really address and look at,\" Donovan said.\n\nThe Clippers finished the second quarter strong and led 59-47 at halftime. Leonard led Los Angeles with 16 points on 7-of-11 shooting while Schroder scored 13 points in the first half for the Thunder.\n\nThe Clippers continued to roll and led 89-70 after the third period. George scored eight points in the third quarter after a quiet first half.\n\nLos Angeles held a comfortable lead throughout the fourth quarter.\n\nTIP-INS\n\nClippers: George had a kid-friendly fishing dock dedicated on Monday at South Lakes Park in Oklahoma City. George is an avid fisherman. ... Shot 63.6% in the first quarter to lead 38-27. ... F/C Harrell limped off the court in the third quarter with a left leg injury. He later re-entered the game. ... Former Thunder G Reggie Jackson scored seven points on 3-for-8 shooting. He was booed during pregame introductions.\n\nThunder: Paul was called for a technical foul in the first quarter. ... Made just 4 of 9 free throws in the first half and 17 of 26 in the game. ... Failed to score 100 points for the second straight game. It is only the second time this season Oklahoma City has gone back-to back games without reaching the century mark. The other time was the first two games of the season.\n\nSTAT LINES\n\nIt was a rough long-range shooting day for both teams. The Clippers went 11 for 36 from 3-point range while the Thunder shot 9 of 28.\n\nSTILL MAD\n\nImmediately after George was introduced in the starting lineup, Patrick Beverley was introduced. Thunder fans booed the gritty defensive stopper as usual. They still remember the 2013 playoffs when Beverley, then with the Houston Rockets, ran into Russell Westbrook after Westbrook called a timeout, causing a knee injury that ended Westbrook's season.\n\nUP NEXT\n\nClippers: Visit the Houston Rockets on Thursday.\n\nThunder: Visit the Detroit Pistons on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996198.065911
}