{
  "game_id": "0022200869",
  "espn_id": "401469024",
  "date": "Feb 14, 2023",
  "matchup": "MIL vs. BOS",
  "headline": "Bucks edge Celtics 131-125 in OT for 11th straight win",
  "body": "MILWAUKEE -- — Jrue Holiday demonstrated just why he’s heading to the All-Star Game for the first time in a decade.\n\n\r\n              Holiday matched a career high with 40 points and made a go-ahead 3-pointer with 25.2 seconds left in overtime as the Milwaukee Bucks edged the short-handed Boston Celtics 131-125 on Tuesday for their 11th consecutive victory. \n\n\r\n              The 32-year-old Holiday shot 8 of 12 from beyond the arc — including one from behind midcourt that beat the third-quarter buzzer — to set a career high for 3-pointers.\n\n\r\n              “I don't really, I guess, care for how I'm playing as long as we're winning,” said Holiday, who also had seven assists. “For me, as long as we get the win, I'm OK. The only stat I look at is turnovers. That's kind of how I determine if I had a good or bad game. Tonight, what did I have, five turnovers? To me, that hurts my soul.\"\n\n\r\n              Holiday will join Bucks teammate Giannis Antetokounmpo at Sunday's All-Star Game at Salt Lake City. It's the first time Holiday has been selected since he was playing for Philadelphia in 2013, which marks the longest gap between All-Star appearances in league history.\n\n\r\n              “I've said since the season started that he's an All-Star,” Antetokounmpo said. \n\n\r\n              Antetokounmpo added 36 points, 13 rebounds and nine assists as the Bucks (40-17) moved within a half-game of the Celtics (41-17) in the Eastern Conference standings.\n\n\r\n              Boston was playing without both its All-Stars – Jayson Tatum (non-COVID illness) and Jaylen Brown (facial fracture) – as well as Marcus Smart (sprained right ankle) and Al Horford (swelling in right knee).\n\n\r\n              The Celtics still nearly earned their fifth straight win.\n\n\r\n              “We expected to win that game,” said Malcolm Brogdon, who scored 26 points. \"We went into that game like we were going to win, like we were supposed to win. We believe we are the best team on the floor every single night.”\n\n\r\n              Boston's Sam Hauser, a Wisconsin native who had 40 friends and family members in the stands, made a game-tying 3-pointer with three seconds left in regulation to force overtime. Boston's Derrick White then scored the first five points of overtime.\n\n\r\n              The Celtics still had a five-point lead with two minutes left, but the Bucks scored the final seven points of the game. The game-ending spurt started with Holiday's go-ahead 3-pointer.\n\n\r\n              “On both ends of the court, he was phenomenal,” Bucks coach Mike Budenholzer said. “I think his ability to create some turnovers and create pressure helped flip it. We went down and he made a few big-time plays that just are very Jrue-like. Special performance by him.”\n\n\r\n              Grant Williams lost the ball on Boston's next possession, Grayson Allen got the steal and a clear-path foul was called on the Celtics with 3.2 seconds left.\n\n\r\n              Antetokounmpo made the ensuing two free throws and capped the scoring with a dunk at the buzzer.\n\n\r\n              SCARY MOMENT\n\n\r\n              Antetokounmpo landed awkwardly after an unsuccessful drive to the basket late in the fourth quarter and lay on the floor for a while before walking slowly back to the bench, but he never actually left the game.\n\n\r\n              “They gave me a quick update just saying that they think he just banged knees with somebody,” Budenholzer said. “We'll check him in the morning, but I'd say the initial kind of report was positive.”\n\n\r\n              TIP-INS\n\n\r\n              Celtics: White, the reigning Eastern Conference player of the week, led Boston with 27 points. ... Boston lost despite having a 27-10 edge in points off turnovers. ... Mike Muscala got his first career technical foul for saying something to the Bucks bench after dunking in the third quarter.\n\n\r\n              Bucks: Antetokounmpo's nine assists increased his career total to 3,271. He's one behind Paul Pressey for the career franchise lead. ... Holiday's other 40-point game came for the Bucks against New Orleans on Dec. 17, 2021. ... Antetokounmpo and Holiday won’t be the only Bucks representatives at the All-Star Game this weekend. Johnny Watson, the Bucks’ executive producer for arena and event presentation, will direct and produce in-game entertainment at the All-Star Game for an eighth time. Bucks disc jockey DJ Shawna and in-game host Melanie Ricks will handle those same roles at the All-Star Game.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Detroit Pistons on Wednesday. \n\n\r\n              Bucks: At Chicago on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994564.074852
}