{
  "game_id": "0022300449",
  "espn_id": "401585077",
  "date": "Dec 31, 2023",
  "matchup": "MEM vs. SAC",
  "headline": "Malik Monk, Domantas Sabonis lead the Kings to a 123-92 victory over the Grizzlies",
  "body": "MEMPHIS, Tenn. -- — Malik Monk scored 27 points, Domantas Sabonis added 13 points, 21 rebounds and 12 assists and the Sacramento Kings routed the Memphis Grizzlies 123-92 on Sunday night.\n\n\r\n              De'Aaron Fox scored 24 for the Kings, who won their second straight. Sabonis recorded his sixth triple-double of the season. His 21 rebounds were four short of his career high.\n\n\r\n              “It was a team effort,” Sabonis said of his rebounding, which contributed to a 59-34 Kings advantage on the boards. “I feel we did a good job of contesting their shots. ... Today was my night.”\n\n\r\n              Sacramento shot 50% overall and 52% from beyond the arc before both teams went to the reserves to close out the game. Monk was 10 of 13 from the field and missed just one of his five 3-point shots.\n\n\r\n              Jaren Jackson led Memphis with 18 points. Desmond Bane, Ja Morant and Luke Kennard finished with 17 points apiece as the Grizzlies lost their third in a row.\n\n\r\n              The Kings defense kept the Grizzlies from getting to the rim. Memphis, which has relied on Morant getting to the basket, was limited to 32 points in the paint. The Grizzlies finished shooting 37% from the field and 12 for 40 from outside the arc.\n\n\r\n              Sacramento coach Mike Brown noted that not only did his team hold Memphis to poor shooting, but outrebounded their opponent and kept the Grizzlies out of transition baskets.\n\n\r\n              “I tell you what, it's probably the best defensive performance that we've had since I've been here, from start to finish,” Brown said. “It was really, really fun to watch.”\n\n\r\n              For the first time, Memphis had most of its roster available against the Kings, except for frontline players Steven Adams and Brandon Clarke, who are dealing with long-term recoveries.\n\n\r\n              Kennard was one of those returning after missing 20 games with a left knee bruise. But defensively, the Kings pushed Bane and Morant out of the offensive flow, keeping them out of the paint. The Grizzlies' two guards were a combined 10-for-26 shooting. \n\n\r\n              “They had a good game plan. They double-teamed our guys,” Memphis coach Taylor Jenkins said. “... It's hard to win when you shoot (37%). We missed tons of shots in the paint. Missed open 3s. Just one of those nights.”\n\n\r\n              The Kings opened the second half on a 15-3 run that stretched the lead to 85-61 as Memphis missed its first eight shots in the quarter. Sacramento outscored Memphis 31-21 in the third period for a 101-79 lead.\n\n\r\n              Memphis lacks chemistry as players return to the lineup. Jenkins is working on different lineups and combinations. \n\n\r\n              “We're working some guys back in who have been out with sickness and stuff,” Bane said. “We get our legs back under us, and we'll be fine.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: Open a four-game homestand against the Charlotte Hornets on Tuesday.\n\n\r\n              Grizzlies: Continue a three-game homestand, hosting the San Antonio Spurs on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996024.713202
}