{
  "game_id": "0022300678",
  "espn_id": "401585306",
  "date": "Jan 31, 2024",
  "matchup": "MIA vs. SAC",
  "headline": "Butler scores 31 points to help Heat beat Kings 115-106 and snap 7-game skid",
  "body": "MIAMI -- — Jimmy Butler scored 31 points and the Miami Heat snapped a seven-game skid with a 115-106 victory over the Sacramento Kings on Wednesday night.\n\n\r\n              Butler shot 10 of 14 from the field and had seven rebounds for the Heat, who ended their longest losing streak since dropping 15 straight during the 2007-08 season. \n\n\r\n              Josh Richardson was 6 of 10 from 3-point range and finished with a season-high 24 points. Bam Adebayo added 16 points and 11 rebounds. Tyler Herro was Miami’s fourth double-figure scorer with 14 points.\n\n\r\n              “Just remember that we are very fortunate to have a job that we get to hoop, that we get to play before so many great fans,” Butler said of how the Heat approached the skid-ending performance. “We lost control of that for a little bit, the sight that this isn’t as difficult. It could be a lot worse.”\n\n\r\n              The Heat finished with a season-high 38 assists in their 1,500th regular-season victory.\n\n\r\n              “The group poured a lot into the last 24 hours,” Miami coach Erik Spoelstra said. “Poured into this process, poured into each other, poured into the solutions. I commend the group because in this day and age and in pro sports, it is tough to do that.”\n\n\r\n              Terry Rozier shot 1 of 8 from the field, but had 10 assists in his fifth game since Miami acquired him in a trade with Charlotte.\n\n\r\n              Sacramento’s Domantas Sabonis had 19 points, 17 rebounds and 13 assists for his 13th triple-double of the season. It was also Sabonis’ 29th consecutive game with at least a double-double, putting him two behind Oscar Robertson’s franchise record set in 1961.\n\n\r\n              Keegan Murray scored 33 points, Kevin Huerter had 14 and De’Aaron added 13 for the Kings, who have not won in Miami since October 2018.\n\n\r\n              “Bottom line – give the Heat a lot of credit,” Sacramento coach Mike Brown said. “I thought they outworked us tonight. They were just relentless pursuing the 50-50 balls and that tells a lot about what happened throughout the course of the game.”\n\n\r\n              The game was finished with two officials after referee Brandon Adair didn’t work the second half because of an injury.\n\n\r\n              Consecutive 3-pointers from Herro and Butler midway through the third period put the Heat ahead for good at 73-70. Richardson’s fifth 3-pointer with 4:28 remaining in the fourth quarter increased the lead to 106-93.\n\n\r\n              Murray shot 7 of 11 on 3-pointers, but the Kings finished 12 of 40 from long range.\n\n\r\n              “We’re getting open looks and sometimes they just don’t go down,” Murray said. “It’s human nature sometimes.”\n\n\r\n              Down 18 midway through the second quarter, Sacramento closed the first half on a 24-10 spurt and got within four at 59-55 at the break. Sabonis scored seven consecutive points and Murray made two 3-pointers during the surge.\n\n\r\n              Richardson had 11 points, including three 3-pointers, that keyed the Heat’s 49-31 lead to start the second period.\n\n\r\n              Miami forward Duncan Robinson is in concussion protocol and didn’t play. Robinson fell ill early during Monday’s loss against Phoenix and didn’t return.\n\n\r\n              Robinson’s absence provided Richardson with extended minutes off the bench.\n\n\r\n              “In warmups, my shots felt really good but once I got going in the game it felt like let it fly,” Richardson said.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Visit Indiana on Friday.\n\n\r\n              Heat: Visit Washington on Friday.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995353.471714
}