{
  "game_id": "0022200719",
  "espn_id": "401468874",
  "date": "Jan 24, 2023",
  "matchup": "LAL vs. LAC",
  "headline": "LeBron scores 46 points with 9 3s, but Clippers rout Lakers",
  "body": "LOS ANGELES -- — LeBron James hit a career-high nine 3-pointers while scoring 46 points, but the Los Angeles Clippers hit 19 3-pointers of their own on the way to a comfortable 133-115 victory over the Los Angeles Lakers on Tuesday night.\n\n\r\n              James scored at least 40 points against the Clippers for the first time in his 20-year career, giving him a 40-point game against all 30 teams in the NBA. James hit his record ninth 3-pointer with 6:45 to play, setting a career high from distance in his 1,404th game.\n\n\r\n              “I was able to make a few shots tonight and try to help us stay in the game,” James said. “But the Clippers, they are really good. Exceptionally good when they’re shooting the 3-ball, and tonight they did that.”\n\n\r\n              Indeed, James' brilliance wasn't nearly enough: The Lakers never caught up after falling behind by 23 points, and James spent the final minutes on the bench after the Clippers pulled away for their 10th consecutive victory over their arena co-tenants in downtown Los Angeles since former Lakers guard Tyronn Lue became the Clippers' coach.\n\n\r\n              James also ramped up his chase of Kareem Abdul-Jabbar’s career scoring record with his 101st 40-point game, including the postseason. He trails Abdul-Jabbar (38,387 points) by just 177 points, putting him in position to potentially break the record at the end of the Lakers’ upcoming five-game road swing instead of back home in Los Angeles.\n\n\r\n              “I've got to this place by not even thinking about it,” James said. “Just being in the moment, trying to play the game the right way. Even tonight, as well as I shot the ball, I was still trying to distribute to my guys, to make sure they felt some type of rhythm. That's just always how I've played the game.”\n\n\r\n              Paul George had 27 points and nine rebounds, and Kawhi Leonard added 25 points in the Clippers' third straight win overall. The Clippers never trailed largely because they hit a season-high 15 3-pointers in the first half while scoring a season-high 77 points in the first half.\n\n\r\n              “(James) had a great shooting game, but we weathered the storm,” Lue said. “When they cut (the lead) to 10 and LeBron is on fire like that ... we just tried to take everyone else out and make him go one-on-one.”\n\n\r\n              Norman Powell had 22 points and Reggie Jackson added 19 for the Clippers.\n\n\r\n              “We were forcing them into really tough shots, and they were just making them,” Lakers coach Darvin Ham said. “Against a great team like that, you've got to play damn near perfect to overcome that deficit.”\n\n\r\n              Russell Westbrook scored 17 points and Thomas Bryant added 15 for the Lakers, who could get Anthony Davis back Wednesday from his 20-game absence with a right foot injury.\n\n\r\n              “The possibilities are limitless,” Ham said with a grin.\n\n\r\n              HACHIMURA ARRIVES\n\n\r\n              Rui Hachimura sat on the Lakers' bench in street clothes one day after they acquired him from Washington in a trade for Kendrick Nunn. The Japanese big man will in uniform Wednesday, Ham said.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Marcus Morris left the game with bruised ribs. Lue had no postgame update. ... John Wall missed his sixth straight game with an abdominal injury. ... Luke Kennard missed his ninth straight game with a calf injury.\n\n\r\n              Lakers: Guards Lonnie Walker and Austin Reaves also are both close to returns from injury, Ham said. Reaves hasn't played since Jan. 4, and Walker has been out since Dec. 28. ... Westbrook scored his 24,000th point in the first quarter, becoming the 28th player in NBA history to hit the mark.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host San Antonio on Thursday night.\n\n\r\n              Lakers: Host San Antonio on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994124.2774642
}