{
  "game_id": "0022300552",
  "espn_id": "401585180",
  "date": "Jan 14, 2024",
  "matchup": "MIL vs. SAC",
  "headline": "Bucks stun Kings on Lillard's buzzer-beating 3-pointer in overtime",
  "body": "MILWAUKEE -- — Damian Lillard swished a 3-pointer at the buzzer in overtime to give the Milwaukee Bucks a stunning 143-142 win over the Sacramento Kings on Sunday night. \n\n\r\n              The Kings led by four late in overtime, but Brook Lopez made a 3-pointer from the corner to pull the Bucks to 141-140 with 11.5 seconds remaining. De'Aaron Fox made one of two free throws. Lillard then inbounded the ball to Lopez, who passed it back to Lillard, who then dribbled across half court and sank a shot from about 30 feet that gave the Bucks their 15th consecutive win over the Kings as the Fiserv Forum crowd erupted and teammates mobbed him. \n\n\r\n              Lillard said the play called for him to inbound the ball to Giannis Antetokounmpo, not Lopez.\n\n\r\n              “Two guys ran to Giannis and as soon as I looked up Brook was already running toward me and I knew that was what the play was going to get to eventually,” Lillard said. \n\n\r\n              After crossing half court, Lillard said he glanced at the clock before making a move to set up his game-winner, which marked the 2,500th 3-pointer of his career. Lillard is in his first year with the Bucks after 11 years with Portland.\n\n\r\n              “I just changed direction and got into space where I could get a good look at the rim. It was a pretty comfortable shot,\" he said. “These are the kinds of game that you don’t want to let them slip. It’s a quality win against a good team.”\n\n\r\n              Lillard led the Bucks with 29 points. Antetokounmpo had a triple-double with 27 points, 10 rebounds and 10 assists, Malik Beasley scored 23 points and Bobby Portis added 22. \n\n\r\n              The Bucks improved to 19-3 at home.\n\n\r\n              Fox finished with 32 points to lead the Kings, and Domantas Sabonis had his 10th triple-double of the season with 21 points, 15 assists and 13 rebounds. Sabonis trails only Nikola Jokic of the Denver Nuggets, who has 12. \n\n\r\n              Milwaukee built a 12-point early in the fourth quarter but Sacramento fought back late to force overtime.\n\n\r\n              “It was like we had the game and they stole it from us and we took it back at the end,” Bucks coach Adrian Griffin said. \"When they went up six (in overtime) it would have been easy for us to throw in the towel, but those guys are resilient. Probably one of our best wins of the season.”\n\n\r\n              Kings coach Mike Brown stormed onto the court with 9:27 left in the fourth and began screaming at referee Intae Hwang and was immediately ejected while having to be restrained by Sacramento players. Malik Monk wrapped his arms around Brown and directed him off the court.\n\n\r\n              Brown brought out a laptop in his post-game media session to highlight multiple calls that he found frustrating, as well as a disparity in free throws. \n\n\r\n              “The referees are human, and they’re going to make mistakes, but you just hope that there’s some sort of consistency and there’s some sort of communication between the refs,” Brown said. “The refs tonight, they were great, they communicated with me all night. But in terms of consistency, you guys saw it right here. In my opinion, the consistency wasn’t here tonight.\" \n\n\r\n              Griffin said Brown's ejection fueled the Kings.\n\n\r\n              “It was a good tactic because his team rallied,\" Griffin said. \"But I think our team was more resilient tonight.”\n\n\r\n              Antetokounmpo showed up on a late-afternoon injury report as being questionable with a right shoulder contusion but took the court for the 29th consecutive game. The two-time MVP has missed just one game this season, on Nov. 15 against Toronto.\n\n\r\n              The Bucks were without Khris Middleton, who rested his surgically repaired right-knee as the Bucks played their third game in four days.\n\n\r\n              Kevin Heurter, who sat out Sacramento’s 112-93 loss on Friday night to the Philadelphia 76ers with a right ankle sprain, returned to the lineup and finished with 26 points.\n\n\r\n              The Bucks made 63% of their first-half shots, including 8 of 14 from 3-point range, but held a slim 68-66 margin as the Kings took 53 shots compared with 35 for Milwaukee.\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Phoenix on Tuesday night.\n\n\r\n              Bucks: At Cleveland on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996132.521755
}