{
  "game_id": "0022000542",
  "espn_id": "401267702",
  "date": "Mar 02, 2021",
  "matchup": "LAL vs. PHX",
  "headline": "Suns overcome Booker's ejection, hold off Lakers 114-104",
  "body": "LOS ANGELES -- — Dario Šarić scored 10 of his 21 points in the fourth quarter, Mikal Bridges added 19 and the Phoenix Suns overcame Devin Booker's ejection for a 114-104 victory over the Los Angeles Lakers on Tuesday night.\n\n\r\n                    Booker scored 17 points before getting ejected for arguing with 7:10 left in the third quarter, but the Suns (23-11) still took charge down the stretch and cruised to their 15th victory in 18 games. Phoenix also moved past the defending NBA champions (24-12) into second place in the Western Conference by winning percentage after completing an unbeaten three-game road trip.\n\n\r\n                    “You gain confidence when a guy like Book doesn’t play or gets tossed, and you’re able to pull a game out on the road at the end of a trip,” Phoenix coach Monty Williams said. “That’s a recipe for mailing it in ... but that was a big-time character win. We got better. I think we played good tonight, but we probably got more confidence that we can pull a game out without Devin or Chris (Paul) saving the day.”\n\n\r\n                    Booker was whistled for two technical fouls in remarkably rapid succession, resulting in the All-Star’s second ejection in just over five weeks.\n\n\r\n                    “We weren’t nervous,” Bridges said of Booker's sudden departure. “We knew we had to go out there and do what we do. We had to lock in for the rest of the game and do it for our teammates. ... Our best player goes out, and we just kept staying the course and fighting all the way to the end. I feel it was a great road trip.”\n\n\r\n                    LeBron James scored 38 points for Los Angeles, which has lost five of seven with mounting injury problems. Dennis Schröder added 17 points, but the Lakers couldn't keep up without regulars Anthony Davis, Kyle Kuzma and Marc Gasol.\n\n\r\n                    Kuzma was a late scratch with a bruised right heel, while Gasol missed his first game under the NBA's health and safety protocols. The Lakers dropped to 3-6 since Davis was injured during a loss to Denver on Valentine's Day.\n\n\r\n                    “We play so well the last two games, we get back into a rhythm, and then we find out today that two of our big guns were out,” James said. “It’s definitely deflating, especially when you were playing poorly and then you get in a good rhythm.”\n\n\r\n                    Moments before Booker’s ejection, James and Lakers coach Frank Vogel got simultaneous technicals for arguing a no-call on Paul.\n\n\r\n                    “I’m happy with how we’re competing,” Vogel said. “Our guys are giving great effort and great hustle and great fight. You understand there’s a big picture here, and guys are keeping the big-picture mindset.”\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Snapped their five-game skid against the Lakers at Staples Center since November 2017. ... Booker replaced Davis among the NBA's All-Star selections last week. ... Šarić was questionable before the game with a right ankle sprain.\n\n\r\n                    Lakers: Talen Horton-Tucker had 16 points, one off his career high. ... Alex Caruso had seven points and six rebounds before leaving late with neck spasms. ... Damian Jones played just seven minutes against his former team.\n\n\r\n                    LEBRON IN THE LANE\n\n\r\n                    James, who led the NBA in assists last season, repeatedly scored in the paint against Phoenix while taking an uncharacteristic off-ball role on many possessions. His highest-scoring performance since Jan. 25 still wasn’t enough for the Lakers, who are struggling to generate offense with Davis sidelined by a calf injury.\n\n\r\n                    James got no help from two struggling swingmen: Kentavious Caldwell-Pope had four points in 31 minutes, and Wesley Matthews went scoreless in 23 minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Host the Golden State Warriors on Thursday.\n\n\r\n                    Lakers: At the Sacramento Kings on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997303.4162638
}