{
  "game_id": "0022301089",
  "espn_id": "401585717",
  "date": "Apr 01, 2024",
  "matchup": "BKN @ IND",
  "headline": "Tyrese Haliburton helps Pacers surge past Nets 133-111",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton scored 27 points and had 13 assists to lead the Indiana Pacers to a 133-111 rout of the Brooklyn Nets on Monday night.\n\n\r\n              Despite being ejected for a flagrant foul midway through the third quarter, Pacers forward Jalen Smith had 17 points and 10 rebounds.\n\n\r\n              The Nets’ Dennis Schroder was called for a technical foul for flailing on the follow-through and hitting Smith’s face. Then Smith was called for a flagrant foul and ejected when he retaliated by pushing Schroder. The two had to be separated.\n\n\r\n              Pascal Siakam added 15 points and Obi Toppin had 14 for the Indiana. \n\n\r\n              Cam Thomas scored 22 points, Trendon Watford 21 and Mikal Bridges 19 for the Nets.\n\n\r\n              The Pacers shot 52% for the game.\n\n\r\n              “We did a lot of good things offensively,” Pacers coach Rick Carlisle said. “When we’re playing like that, fast and random, we’re tough to play against.”\n\n\r\n              Indiana dominated from the start, leading 43-27 after the first quarter and 75-47 at halftime. The Pacers led by as many as 29 in the first half.\n\n\r\n              “We did a good job pushing the pace,” Haliburton said of the team’s fast start. “We were getting stops and running. That ultimately let to shots going in. We were playing the right way.\"\n\n\r\n              The Pacers shot 58% in the first half while holding the Nets to 38%. Indiana led by as many as 36 points in the third quarter.\n\n\r\n              Indiana center Myles Turner dislocated his right index finger on a dunk attempt when he was fouled by Watford. The Pacers called a timeout with less than a minute left in second quarter, so he could shoot free throws, hitting the second of two attempts. Turner did not return in the second half, finishing with nine points and five blocked shots in 14 minutes.\n\n\r\n              Carlisle said X-rays revealed there was no fracture, but he doesn't know Turner's status for Wednesday night.\n\n\r\n              Nets coach Kevin Ollie said his team should be better prepared.\n\n\r\n              “It’s letting (the Pacers) getting to the rim and creating paint touches and then kicking it out and then we’re scrambling and trying to get back,” Ollie said. “Give credit to them, they played their style of play. They are relentless at it. We need to understand that and can't be surprised by the pace on Wednesday. They are going to try to do the same thing and I know our guys are going to be ready and give a better mental and physical battle.”\n\n\r\n              Ollie said hopefully his team can get to the free-throw line and slow the Pacers down.\n\n\r\n              “We just have to have more guys getting to the rim and finishing down there,” Ollie said. “We've got to get back in transition. We have to have more sense of urgency of getting back on defense and then getting them to play in the half court.”\n\n\r\n              Carlisle said it will be a good test on Wednesday because emotions were high in the blowout.\n\n\r\n              Carlisle passed former Boston Celtics coach Red Auerbach for 12th on the NBA's all-time coaching victories list with 939. Carlisle was drafted by the Celtics in 1984 when Auerbach was a team executive.\n\n\r\n              The Nets played without Dennis Smith Jr., sidelined with with right hip soreness, and Cameron Johnson, out with injury maintenance on left big toe sprain.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: at Brooklyn on Wednesday.\n\n\r\n              Nets: open four-game homestand with the Pacers on Wednesday.\n\n\r\n              ----\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996323.694748
}