{
  "game_id": "0022200095",
  "espn_id": "401468250",
  "date": "Oct 30, 2022",
  "matchup": "DEN @ LAL",
  "headline": "James, Davis help Lakers win for first time this season",
  "body": "LOS ANGELES -- — LeBron James scored 26 points and Anthony Davis added 23 to help the Los Angeles Lakers to their first win of the season with a 121-110 victory over the Denver Nuggets on Sunday night.\n\n\r\n              Russell Westbrook had 18 points for the Lakers (1-5), who had lost their first five games of the season under first-year head coach Darvin Ham. Los Angeles was the last winless team in the NBA.\n\n\r\n              Ham celebrated in the locker room with his team and received a celebratory dousing of water.\n\n\r\n              “We needed to prove something to ourselves,” Ham said. “Not to the world, not the media. We had to prove it to ourselves. I feel great about how we responded throughout the game.”\n\n\r\n              Westbrook, who came off the bench again and has been accepting of that role, drove the lane and scored on a layup to extend the Lakers lead to 117-106 in the final minutes as the Lakers closed out the win.\n\n\r\n              In the third quarter, he raised his arms to get fans on their feet and he obliged. \n\n\r\n              “Like I’ve mentioned since Day One, whatever is needed from me to help the team win, that’s what I’ll do,” Westbrook said. \n\n\r\n              Nikola Jockic scored 23 points and Jamal Murray added a season-high 21 for the Nuggets (4-3), who had four of their last five and two straight games before Sunday’s loss.\n\n\r\n              Austin Reaves made a 3-pointer from the top of the arc and Lonnie Walker IV drove the baseline for a dunk to give the Lakers a 113-100 advantage. That 13-point lead was their largest of the season.\n\n\r\n              The Lakers made 13 3-pointers on 13-for-30 shooting after struggling with long-range shots this season in their previous five games. The Nuggets made 15 3-pointers.\n\n\r\n              Davis was aggressive early after missing one game with lower back tightness and was questionable Sunday but played. He tweaked his back in the game against Denver on Wednesday when the Nuggets beat the Lakers 110-99 in Denver.\n\n\r\n              Davis, who called Sunday’s game a must-win, said he’ll have to manage the pain. \n\n\r\n              “It’s day by day,” Davis said. “One day, I feel great. The next day (it’s hard). Just try to manage it and keep getting treatment.” \n\n\r\n              The Lakers led 55-51 at halftime. They trailed by as many as 10 points in the first quarter but overcame that deficit by halftime.\n\n\r\n              “They were playing with desperation and I felt like we had them and let it slip away,” Nuggets forward Aaron Gordon said. \n\n\r\n              JOYFUL RUSS\n\n\r\n              Charles Barkley recently said that the Lakers are “taking Russell Westbrook’s joy out of basketball. When asked about the joy factor, Westbrook said: “One thing I’ll never let happen is people outside of my family and people that support me, take my joy. I always have fun and embrace this game and embrace the gift I’ve been given. Losing is not as much fun. I love seeing my teammates flourish, honestly. I get joy by seeing others do great.” \n\n\r\n              UP IN THE RAFTERS\n\n\r\n              Hall of Famer George Mikan had his jersey retired. His family was there to celebrate the honor and watch No. 99 be unveiled. He’s the 11th player to have his jersey retired, along with Kareem Abdul-Jabbar, Elgin Baylor, Kobe Bryant, Wilt Chamberlain, Gail Goodrich, Magic Johnson, Shaquille O’Neal, Jerry West, Jamaal Wilkes and James Worthy. Worthy was there Sunday and spoke about Mikan.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: G Bones Hyland missed the game with a left hip strain … G Kentavious Caldwell-Pope (sprained ankle) returned Sunday and had nine points … C DeAndre Jordan ran out of bounds on one play, leaned over a fan to stop his momentum and ate some of his popcorn.\n\n\r\n              Lakers: Pau Gasol, who won two championships with the Lakers, attended the Mikan Jersey unveiling and game on Sunday. His jersey will be retired by the Lakers in March\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Have three days off before Thursday’s game at Oklahoma City.\n\n\r\n              Lakers: Hosts the New Orleans Pelicans on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994738.7870889
}