{
  "game_id": "0022400904",
  "espn_id": "401705470",
  "date": "Mar 07, 2025",
  "matchup": "CHA vs. CLE",
  "headline": "NBA-leading Cavaliers win 13th straight game, rallying to edge Hornets 118-117",
  "body": "CHARLOTTE, N.C. -- — Donovan Mitchell scored 24 points and the NBA-leading Cleveland Cavaliers rallied for their 13th straight victory, 118-117 over the Charlotte Hornets on Friday night.\n\n\r\n              Darius Garland added 20 points to help the Cavaliers improve to 53-10. Evan Mobley scored 19 points, De’Andre Hunter had 15, Jarrett Allen 14 and Sam Merrill 12.\n\n\r\n              Miles Bridges scored 46 points for Charlotte. His shot from halfcourt at the buzzer was off the mark. The Hornets have lost nine straight to fall to 14-48.\n\n\r\n              Cleveland led 67-54 early in the second half and was up 87-83 after three quarters. Charlotte rallied with a 21-8 run for a 104-95 lead with 5:41 to play.\n\n\r\n              The Cavaliers responded by outscoring the Hornets 25-15 to end the game. Hunter’s contested follow shot with 43 seconds left gave Cleveland the lead for good at 112-110.\n\n\r\n               Jusuf Nurkic added 12 points and 15 rebounds for Charlotte\n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland has had three winning streaks of 12 or more games this season, the first time that has happened since the 2006-07 Dallas Mavericks.\n\n\r\n              Hornets: Charlotte is 9-24 at home.\n\n\r\n              Key moment \r\n              \r\n              After Cleveland took the lead for good at 112-110, Hunter’s defensive pressure forced Bridges into a fumble on his drive into the lane with 21.6 seconds left.\n\n\r\n              Key stat\r\n              Cleveland was 43 of 51 on free throws. And Donovan Mitchell, who accounted for six of the eight misses, converted nine straight before missing his last two (with 4.8 seconds left) to finish 12 of 18 overall.\n\n\r\n              Up next\r\n              The Cavaliers are at Milwaukee on Sunday. The Hornets host Brooklyn on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997435.878224
}