{
  "game_id": "0022000361",
  "espn_id": "401267521",
  "date": "Feb 06, 2021",
  "matchup": "LAL vs. DET",
  "headline": "LeBron takes charge in 2nd OT, Lakers edge Pistons 135-129",
  "body": "LOS ANGELES -- — LeBron James scored eight of his 33 points in the second overtime, Anthony Davis added 30 points and the Los Angeles Lakers narrowly avenged a loss in Detroit last month with a 135-129 victory over the undermanned Pistons on Saturday night.\n\n\r\n                    Dennis Schröder had 22 points and eight assists in the defending NBA champions’ fourth consecutive victory since that 107-92 loss to the Pistons nine days ago.\n\n\r\n                    The Lakers committed a season-high 23 turnovers, blew a 17-point lead and wasted several chances to win in regulation. Only James' brilliance in the second overtime prevented Los Angeles from being swept by the 5-18 Pistons, who were playing without Derrick Rose and Blake Griffin on the second night of a back-to-back set to close out an eight-day West Coast trip.\n\n\r\n                    “Give them credit,” Lakers coach Frank Vogel said. “They kept playing hard, and they got hot from behind the arc. We didn’t do things well enough, and they were able to get back in the game.”\n\n\r\n                    Moments after James hit the go-ahead layup in double OT, he made a tough step-back 3-pointer with 1:17 left and added another step-back 27-footer with 34 seconds to play.\n\n\r\n                    “I was just ready to go,” James said. “I’m 36 years old, and ... my heart is not sustainable for two overtimes at this point in my career. I’ve got a bottle of wine at home ready to be opened, and I delayed it for two overtime periods.”\n\n\r\n                    Jerami Grant scored 32 points and Josh Jackson added 25 of his 28 after halftime for the Pistons, who had another improbably strong showing against the NBA's elite. Delon Wright scored 22 points in Detroit's fourth consecutive loss since beating LA.\n\n\r\n                    “We can definitely build off it,” Wright said. “If we take the champions to double overtime, that means we can compete with anybody in this league on any given night.”\n\n\r\n                    Jackson led the Pistons' rally while the Lakers went scoreless in the final 4:06 of regulation. He tied it on a driving layup with 3.1 seconds left, and James missed a driving layup at the buzzer.\n\n\r\n                    The Lakers missed nine consecutive shots during a nearly six-minute scoreless slump stretching into the first overtime. But Alex Caruso scored five quick points to get Los Angeles back in it, and Davis made a tying dunk with 18.1 seconds left before Grant missed a floater at the buzzer.\n\n\r\n                    Rose was inactive for what coach Dwane Casey called personal reasons amid widespread trade rumors linking the former MVP with the Knicks and Clippers.\n\n\r\n                    Griffin also sat out to rest on the second night of a back-to-back, but the remaining Pistons still hit 16 3-pointers and shredded the NBA’s best defensive team in their highest-scoring performance of the season.\n\n\r\n                    “I was proud of the way the guys played,” Casey said. “There’s so many learning situations for young players and our guys to play against a great team like the Lakers. We have no margin for error, but the effort, the togetherness, the mental toughness is what we’re trying to build.”\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Detroit has beaten the 76ers, Celtics, Heat, Suns and Lakers. ... Former Lakers guard Svi Mykhailiuk hit three 3-pointers while playing a career-high 39 minutes.\n\n\r\n                    Lakers: Vogel got a technical foul in the second quarter for arguing about a blocking call on Marc Gasol. After the Lakers requested a video review, the call was reversed. ... Kentavious Caldwell-Pope scored four points in 42 minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Host the Brooklyn Nets on Tuesday.\n\n\r\n                    Lakers: Host the Oklahoma City Thunder on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997312.905438
}