{
  "game_id": "0022400031",
  "espn_id": "401703400",
  "date": "Nov 22, 2024",
  "matchup": "HOU vs. POR",
  "headline": "Dillon Brooks scores a season-high 28 to lead the Rockets past the Trail Blazers 116-88",
  "body": "HOUSTON -- — Dillon Brooks scored a season-high 28 points and led the Houston Rockets to a 116-88 win over the Portland Trail Blazers in an NBA Cup game on Friday night.\n\n\r\n              Brooks matched a career-high with six 3-pointers on eight attempts, and the Rockets made 15 of 39 (38.5%) from beyond the arc.\n\n\r\n              Tari Eason scored 22 points off the bench, Jalen Green had 17 and Alperen Sengun added 14 as the Rockets won for the seventh time in eight games. Six of those wins were by double figures. Houston is 2-0 in NBA Cup play\n\n\r\n              For Portland, Deni Avdija and Shaedon Sharpe scores 13 points apiece and Toumani Camara had 11.\n\n\r\n              Portland has lost two straight games to open a four-game trip. They previously won three straight at home. The Trail Blazers are 1-1 in the in-season tournament.\n\n\r\n              Takeaways\r\n              Trail Blazers: Portland was missing two of its five leading scorers in Scoot Henderson, out for the first time with a left quad contusion, and Deandre Ayton, who remained sidelined with a deep contusion in his right index finger.\n\n\r\n              Rockets: Houston, at 12-5, has outscored opponents by 163 points through 17 games, the highest total through the first 17 games of a season in franchise history. The previous record of 131 was held by the defending champion 1996-97 Rockets, who started the season 15-2.\n\n\r\n              Key moment\r\n              The Rockets were trailing early when Eason checked in and provided a spark, scoring 12 points in an energetic 13 minutes in the first half. Eason finished with a game-best plus-minus of +33 points. \n\n\r\n              Key stat\r\n              Houston outscored Portland 23-7 in fast-break points and generated 28 points off Portland’s 21 turnovers.\n\n\r\n              Up next\r\n              The Trail Blazers and the Rockets will meet again Saturday night in Houston for the second half of a back-to-back.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997406.824712
}