{
  "game_id": "0022400486",
  "espn_id": "401705052",
  "date": "Jan 04, 2025",
  "matchup": "ATL @ LAC",
  "headline": "Powell scores 20, Leonard has 12 points in return as Clippers cruise to 131-105 victory over Hawks",
  "body": "INGLEWOOD, Calif. -- — Norman Powell scored 20 points, Kawhi Leonard added 12 in his first game of the season and the Los Angeles Clippers rolled to a 131-105 victory over the Atlanta Hawks on Saturday night.\n\n\r\n              Leonard, who missed the Clippers’ first 34 games with what the team described as right knee injury recovery, played 19 minutes. He was 4 of 11 from the floor, including three 3-pointers, along with three rebounds and one assist.\n\n\r\n              Ivica Zubac had 18 points and 18 rebounds as the Clippers snapped a two-game losing streak. Amir Coffey had 17 points.\n\n\r\n              Trae Young led Atlanta with 20 points and 14 assists. De’Andre Hunter had 18 points for the Hawks who have dropped their last three after winning four straight.\n\n\r\n              The Clippers had a 36-35 advantage early in the second quarter before breaking it open with a 27-4 run, with Coffey scoring nine of his 15 points in the period.\n\n\r\n              Takeaways\r\n              Hawks: Guard Jalen Johnson did not play due to right shoulder soreness. Guard Bogdan Bogdanovic also did not play due to injury management. \n\n\r\n              Clippers: Terance Mann also returned to the lineup and scored 12 points in 16 minutes. Mann missed 10 games due to a broken middle finger on his left hand.\n\n\r\n              Key moment\r\n              Leonard hit a 3-pointer on his first shot from the left wing with 9:57 remaining in the first quarter to tie it at 5-all. Leonard was guarded by Hawks rookie Zaccharie Risacher, but got the shot off.\n\n\r\n              Key stat\r\n              James Harden's 13 assists in the first half were the most by a Clippers player before halftime going back to 1996-97, according to Sportradar. He has had 14 assists in the first half twice in his 15-year career. Harden finished with 10 points and 15 assists.\n\n\r\n              Up next\r\n              The Hawks are at Utah on Tuesday night while the Clippers are at Minnesota on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997927.767225
}