{
  "game_id": "0022400265",
  "espn_id": "401704831",
  "date": "Nov 23, 2024",
  "matchup": "ORL vs. DET",
  "headline": "Magic beat Pistons 111-100 behind Franz Wagner's 30 points",
  "body": "ORLANDO, Fla. -- — Franz Wagner had 30 points, nine rebounds and eight assists, and the Orlando Magic beat the Detroit Pistons 111-100 Saturday night for their eighth win in nine games.\n\n\r\n              Wagner, who has scored 30 or more points in five of his last seven games, sat out the fourth quarter while the Magic’s bench stretched Orlando's lead to 22 with 7:19 remaining.\n\n\r\n              Mo Wagner had 18 points and seven rebounds off the Magic bench, and Jonathan Isaac added five points, 12 rebounds and three blocks.\n\n\r\n              Jaden Ivey led the Pistons with 19 points and seven rebounds. Malik Beasley, starting in place of the injured Cade Cunningham, added 18 points.\n\n\r\n              Takeaways\r\n              Pistons: Cunningham, Detroit’s leading scorer and the NBA’s fourth leading assist maker, missed his first game of the season with a hip injury. The Pistons could not compensate, giving up 29 points off 17 turnovers.\n\n\r\n              Magic: Playing without Paolo Banchero and Wendell Carter Jr. and losing Jalen Suggs to a sore left hamstring in the first half, the Magic remained unbeaten at home (8-0).\n\n\r\n              Key moment\r\n              After Beasley’s 3-pointer pulled the Pistons even at 56 at the outset of the second half, Kentavious Caldwell-Pope answered with a 3 and the Magic went off on a 20-9 run that included nine straight Magic points from Franz Wagner.\n\n\r\n              Key stat\r\n              Franz Wagner has averaged 27.7 points in the 11 games since losing Banchero to a torn oblique.\n\n\r\n              Up next\r\n              The Pistons play Toronto in Detroit on Monday, the same day the Magic play at Charlotte.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997573.388473
}