{
  "game_id": "0021501089",
  "espn_id": "400828976",
  "date": "Mar 26, 2016",
  "matchup": "MIL vs. CHA",
  "headline": "Batum scores 25 as Hornets rout Bucks 115-91",
  "body": "MILWAUKEE --  Nicolas Batum's first-half scoring outburst allowed the Charlotte Hornets to quickly pull away from the Milwaukee Bucks on Saturday night.\n\nIt was his defense on Giannis Antetokounmpo, though, that grabbed his coach's attention in a 115-91 victory Saturday night.\n\n\"I thought (Batum) really set the tone,\" Charlotte coach Steve Clifford said. \"Not with his shooting as much, but picking up full court and keeping pressure on Giannis as much as he could.\"\n\nCharlotte's game plan, Batum said, called for physical defense against Milwaukee's tall, athletic lineup.\n\n\"They are very tall. Giannis is a tough matchup. He's very talented,\" Batum said. \"We tried to pressure him full court and deny him as a distributor.\"\n\nThe plan worked.\n\nAntetokounmpo, Milwaukee's second-leading scorer, managed just eight points and two assists in 26 minutes of action as Charlotte routed Milwaukee 115-91.\n\nBut Batum's hot shooting over the first two quarters no doubt played a major part in the Hornets' victory.\n\nBatum's 23 first-half points, the most in a half in his eight-year career, sparked Charlotte to a 55-38 lead after two quarters. The Bucks pulled within five early in the second before a 13-2 Charlotte run, which included 10 points from Batum.\n\n\"I'm feeling pretty comfortable the last couple of games. This is what I've been working on a lot this year,\" Batum said. \"I missed the first two (shots) in the second half, so I decided to pass the ball.\"\n\nAntetokounmpo insisted he wasn't bothered by Batum's defensive pressure. It was Batum's first-half shooting that put the Bucks in a hole, he said.\n\n\"He made tough shots,\" Antetokounmpo. \"We were right there with him.\"\n\nMilwaukee coach Jason Kidd offered a different opinion.\n\n\"I don't think we made it hard on him,\" Kidd said.\n\nAlthough Batum passed up shots in the second half, his teammates didn't let up, connecting on seven of 12 3-pointers in the third quarter on the way to building a 29-point lead. Charlotte connected on 16 of 29 3-pointers against Milwaukee in this one, a 55 percent clip.\n\nMarvin Williams added 21 points and Kemba Walker had 18 for the Hornets, who won three of four games in the season series.\n\nJohn Henson had 19 points and Jabari Parker 15 for the Bucks, who have lost five straight and six of seven. Milwaukee made just four of 16 (25 percent) from 3-point range.\n\nThe Hornets jumped out to a 29-17 lead after one quarter, holding the Bucks to 36 percent shooting. Khris Middleton had 11 points in the quarter for Milwaukee.\n\nREVERSAL OF FORTUNE\n\nA night after allowing 72 first-half points in a loss at Detroit, Charlotte held Milwaukee to 38 points over the first two quarters. Milwaukee shot 36 percent for the half and made only two of 10 3-point shots. \"After last night, which was disappointing for everybody, tonight we were a very serious-minded, professional team playing very confident on the road,\" Clifford said. \"It was impressive to watch.\"\n\nTIP-INS\n\nHornets: After playing nine of 12 games at home, Charlotte played its third consecutive road game and is in the midst of a stretch of playing nine of 11 away from the Time Warner Cable Arena. ... Frank Kaminsky, who played on the Wisconsin team that faced Duke in last year's NCAA championship game, received a loud ovation when he entered in the first quarter. ...Williams, who has been dealing with an ankle injury, played 33 minutes.\n\nBucks: Milwaukee opted to not re-sign Jared Cunningham, whose 10-day contract expired after Friday's game. ... Rookie Rashad Vaughn was recalled from the Canton Charge of the NBA Development League. Vaughn appeared in four games with Canton and averaged 8.0 points, 3.3 rebounds and 2.3 assists in 21 minutes per game. He struggled considerably with his shooting, going 14 of 46 (30.4 percent) and 1 of 16 from 3-point range (6.3 percent). ... Greivis Vasquez continues to practice with the team, but hasn't yet been cleared by the medical staff to play in a game. \"They are going to continue to watch him in practice,\" Kidd said.\n\nUP NEXT\n\nHornets: At Philadelphia on Tuesday night.\n\nBucks: Host Phoenix on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994003.356025
}