{
  "game_id": "0022000165",
  "espn_id": "401267325",
  "date": "Jan 13, 2021",
  "matchup": "MIL @ DET",
  "headline": "Antetokounmpo's triple-double lifts Bucks over Pistons",
  "body": "DETROIT -- — Giannis Antetokounmpo had 22 points, 10 rebounds and 10 assists, and the Milwaukee Bucks easily beat the Detroit Pistons for the third time this month, 110-101 on Wednesday night.\n\n\r\n                    The Bucks built a commanding early lead with a barrage of 3-pointers. Brook Lopez connected three times from beyond the arc in the first quarter, when the Bucks were 7 of 11 from long distance. Detroit was just 4 of 20 overall in the period and trailed 27-13 after one.\n\n\r\n                    That pattern continued through much of the second quarter. At one point, Milwaukee led 52-29 and had more 3-pointers (11) than Detroit had field goals (9).\n\n\r\n                    “We’ve just tried to keep building on shooting and making it a priority,\" Bucks coach Mike Budenholzer said. \"It takes good passing, good ball movement, and then guys have to knock down shots.”\n\n\r\n                    The Pistons cut the deficit to 11 at halftime but never seemed like a serious threat to overtake Milwaukee. Jerami Grant led Detroit with 22 points and Svi Mykhailiuk added 18.\n\n\r\n                    “As a young team, we just made enough mistakes at the right time to put yourself in a hole,\" Detroit coach Dwane Casey said.\n\n\r\n                    It was the 20th career triple-double for Antetokounmpo. Jrue Holiday added 21 points for the Bucks in another solid performance after arriving in an offseason trade.\n\n\r\n                    “I knew he was really good, but every day I play with him, I realize how good a person he is, good a teammate he is, and how much better he is than what I thought,\" Antetokounmpo said.\n\n\r\n                    Milwaukee beat Detroit 125-115 on Jan. 4 and 130-115 two days later.\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Milwaukee has won three straight and six of seven. ... The Bucks finished 19 of 43 from 3-point range. ... Lopez didn't score after those early 3s. He had nine points and 11 rebounds.\n\n\r\n                    Pistons: Detroit fell to 2-9, but its margins of defeat have remained reasonably respectable. That 15-point loss to Milwaukee was the most lopsided of the season for the Pistons. ... Detroit had a 20-7 advantage in second-chance points.\n\n\r\n                    STRUGGLES\n\n\r\n                    Detroit shot a solid 40% from 3-point range, but the Pistons were just 22 of 57 inside the arc.\n\n\r\n                    “We shot way too many midrange shots tonight,\" Casey said. \"That’s what that team wants you to do.”\n\n\r\n                    MAJOR THREAT\n\n\r\n                    Antetokounmpo said after the game he wasn't on social media, so a reporter had to relay the NBA's big news of the day — a pending trade sending James Harden to Brooklyn.\n\n\r\n                    “It’s an amazing move for Brooklyn,\" Antetokounmpo said. \"Obviously, they got better — way better.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Host the Dallas Mavericks on Friday night.\n\n\r\n                    Pistons: Detroit's game against Washington on Friday night was called off because of contact tracing issues with the Wizards. The Pistons are scheduled to play at Miami on Saturday night.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997414.491816
}