{
  "game_id": "0022300818",
  "espn_id": "401585446",
  "date": "Feb 25, 2024",
  "matchup": "LAL @ PHX",
  "headline": "Grayson Allen leads balanced effort for Suns, who pull away late for 123-113 win over Lakers",
  "body": "PHOENIX -- — It's no surprise that the Phoenix Suns were led by a Big Three on Sunday.\n\n\r\n              The twist is that those three players were Grayson Allen, Royce O'Neale and Jusuf Nurkic.\n\n\r\n              Allen scored 24 points, Kevin Durant added 22 and the Suns pulled away late in the fourth quarter to beat the Los Angeles Lakers 123-113.\n\n\r\n              Allen and O’Neale hit crucial 3-pointers on back-to-back possessions to put the Suns up 116-104 with three minutes left. Nurkic added one of the best all-around games of his career with 18 points, 22 rebounds and seven assists.\n\n\r\n              “Those three guys were the stars of the game tonight,” Suns coach Frank Vogel said. \n\n\r\n              The Suns have built their roster around the so-called Big Three of Durant, Devin Booker and Bradley Beal — a group that's made a combined 21 All-Star teams. As expected, they've done a lot of the heavy lifting this season, but the emergence of role players such as Allen, O'Neale and Nurkic has made the Suns a much deeper team.\n\n\r\n              Allen said he's learned to pick his scoring spots when playing with the Suns' stars. Sunday was one of them.\n\n\r\n              “It's a little bit of a feel, but a lot of it is that I understand our team goes where (Booker, Durant and Beal) go,” Allen said. “They're going to lead us on both ends of the floor. So offensively, whatever shot-making I'm doing has to help the offense as a whole.”\n\n\r\n              Said Durant: “He's been making the right plays all season.”\n\n\r\n              The Lakers trailed by 20 points late in the first quarter, but slowly cut the deficit to 92-90 by late in the third. Phoenix responded with the next six points and didn't trail in the fourth, snapping a two-game skid.\n\n\r\n              LeBron James led the Lakers with 28 points on 12-of-19 shooting and also had 12 assists. Anthony Davis had 22 points and 14 rebounds.\n\n\r\n              Four Phoenix starters scored at least 20 points and the Suns had a 51-34 rebounding advantage. Booker scored 21 and O'Neale added 20 on 6-of-10 shooting on 3s. Bol Bol had 11 points in 24 minutes off the bench.\n\n\r\n              The Suns took a 38-18 lead late in the first quarter before settling for a 45-28 advantage going into the second. The 45 points were the most Phoenix has scored in a quarter this season. The Lakers cut into that advantage in the second but still trailed 72-63 at the break.\n\n\r\n              “Super slow start for us, offensively and defensively,” James said. “We give up 45 points in a quarter and it's an uphill battle. From that point on, we played some really good basketball, but their role players did a good job shooting the ball.”\n\n\r\n              D'Angelo Russell led Los Angeles with 18 points in the first half while Booker had 13 for the Suns.\n\n\r\n              Beal missed his fourth straight game because of a tight left hamstring. He's played just 30 of the team's 58 games this season because of various injuries. Key backup Eric Gordon was also out with left groin soreness.\n\n\r\n              Phoenix and Los Angeles are in a similar position roughly two-thirds of the way through the regular season. Both teams have star-laden rosters, but are struggling to avoid the play-in tournament in the Western Conference. \n\n\r\n              The Suns entered the game as the West’s No. 8 seed while the Lakers were No. 9. The top six teams in each conference avoid the play-in tournament and advance to the first best-of-seven round.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At the Clippers on Wednesday.\n\n\r\n              Suns: Host the Rockets on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995500.225066
}