{
  "game_id": "0021601078",
  "espn_id": "400900473",
  "date": "Mar 24, 2017",
  "matchup": "MIL vs. ATL",
  "headline": "Streaking Bucks beat Hawks 100-97, tie for 5th in East",
  "body": "MILWAUKEE --  Giannis Antetokounmpo isn't waiting for the playoffs to play with postseason intensity.\n\nThe young All-Star threw down a windmill dunk, drew defensive attention to open up lanes for teammates and contorted his athletic, 6-foot-11 frame along the sideline to save a late possession for the Milwaukee Bucks.\n\nAntetokounmpo picked up his second straight double-double with 34 points and 13 rebounds, and rookie Malcolm Brogdon had 14 points and seven assists in a 100-97 win over the Atlanta Hawks on Friday night.\n\nThe Bucks, who have won 11 of 13 games, moved into a tie with Atlanta for fifth place in the Eastern Conference, though the Hawks still hold the tiebreaker. Atlanta has lost six straight.\n\n\"It was a playoff-type game. Everybody is fighting for pole position,\" Bucks coach Jason Kidd said.\n\nAtlanta had one last chance to tie before Ersan Ilyasova missed a contested 3 from the right wing with 0.2 seconds left with fans at the Bradley Center screaming \"Fear the Deer!\"\n\nBucks fans are hoping their team can return to the playoffs after missing the postseason last year.\n\n\"Understanding the intensity, I thought the guys handled it well. I thought the energy and effort was great from the guys,\" Kidd said.\n\nDennis Schroder had 28 points for the Hawks, who were desperate to snap an extended losing skid. Dwight Howard had 20 points and 12 rebounds.\n\nAtlanta went on a 13-2 run over the last 5 minutes of the second quarter to pull to 45-43 at halftime.\n\nThe teams traded leads 17 times and stayed within a bucket or two of each other most of the rest of the way in a second half that had the tense atmosphere of a playoff game.\n\nBut the Hawks couldn't make buckets in the closing seconds.\n\n\"Bonehead plays to end the game, during the game,\" guard Tim Hardaway Jr. said. \"But we'll be fine. As long as we're competing for the full 48, one or two plays here and there, we'll pull some of these wins out.\"\n\nFINAL FUTILITY\n\nDwight Howard, a 52 percent shooter at the foul line, went 1 of 2 with 10.2 seconds left and his team trailing by two. Milwaukee's Khris Middleton hit two foul shots at the other end for the three-point lead that set up Atlanta's failed final sequence.\n\nBrogdon connected with Greg Monroe on two crucial layups in the final 40 seconds.\n\nWith another close loss, coach Mike Budenholzer said he thought his team is still making progress.\n\n\"Whether it's a defensive rebound or a better decision, those plays add up to winning and we've just got to make a few more of those winning plays,\" he said.\n\nBIG SAVE\n\nAntetokounmpo came up with a loose ball that was headed out of bounds to save a possession with about 53 seconds left and the score tied at 94. Thirteen seconds later, Brogdon found a cutting Monroe for a layup.\n\n\"I was thinking `This is unbelievable.' Then I saw him run to the sideline as it was going out of bounds and I thought `I had to get open. I've got to make this happen,\" Brogdon said.\n\nBIG BACKCOURT\n\nSchroder and Hardaway Jr. gave the Bucks fits in the second half. Schroder had 15 alone in the third quarter, and finished 11 of 25 from the field to go with seven rebounds and seven assists.\n\nTIP INS\n\nHawks:  F Paul Millsap, the team's leading scorer (18.1 points) remained out with a right knee injury, while G Kent Bazemore (11.0 points) also sat again with left knee tightness.\n\nBucks: Antetokounmpo had 17 points, eight rebounds, three assists and three blocks in playing the entire first quarter, shooting 6 of 10 from the field. The All Star provided the energy that coach Jason Kidd was seeking early in the game with the team returning from a six-game road trip. ...Middleton (15.4 points) missed his first eight shots of the night before hitting a 15-foot jumper with 7:57 left in the game.\n\nUP NEXT\n\nHawks: Host the NBA-worst Brooklyn Nets on Sunday.\n\nBucks: Host the Bulls in another game that could be important in the Eastern Conference playoff race.\n\n---\n\nMore NBA Basketball:\n\nhttps://apnews.com/tag/NBAbasketball\n\n---\n\nFollow Genaro Armas at: https://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764995134.2095628
}