{
  "game_id": "0021900130",
  "espn_id": "401160772",
  "date": "Nov 09, 2019",
  "matchup": "MEM vs. DAL",
  "headline": "Doncic scores 24 points as Mavs defeat Grizzlies 138-122",
  "body": "MEMPHIS, Tenn. --  Luka Doncic missed his fifth triple-double of the season primarily because Dallas didn't need him in the fourth quarter.\n\nDoncic had 24 points, 14 rebounds and eight assists to lead the Mavericks to a 138-122 victory over Memphis on Saturday night.\n\nDoncic recorded his stats in three quarters as Mavericks coach Rick Carlisle sat the second-year guard while Dallas maintained a double-digit lead in the final period. Kristaps Porzingis already had taken the night off recovering from a left knee injury.\n\n\"It was a really good effort from start to finish,\" Carlisle said. \"Had a real even contribution from top to bottom. The second unit, obviously came in and was very strong.\"\n\nDoncic was part of eight Mavericks reaching double figures as Dallas had its highest scoring output of the season. Tim Hardaway Jr. added 20 points for Dallas, Justin Jackson had 17 points and Seth Curry scored 16, all in the first half.\n\nJaren Jackson Jr. led Memphis with 23 points on 10-for-17 shooting from the field, including a pair of 3-pointers. Jae Crowder added 18 points for the Grizzlies, which lost their second straight.\n\nMemphis played without leading scorer and rookie Ja Morant, who took the night off for rest. Additionally, rookie forward Brandon Clarke did not play due to injury maintenance on a sore back.\n\nFor the Grizzlies, the offense is there, but the defense is not. The Mavericks' 138 points was the most surrendered by Memphis this season. Over the last three games, opponents have averaged just more than 125 points a game.\n\n\"The numbers are off the chart,\" Memphis center Jonas Valanciunas said. \"We've got to do a better job on defense.\"\n\nBefore Doncic took the rest of the night off, he helped Dallas pull away in the third quarter, scoring 14 points to give the Mavericks a 104-91 lead entering the fourth.\n\nMemphis coach Taylor Jenkins noted his team's defensive struggles, including the Mavericks connecting on 18 3-pointers.\n\n\"That makes it tough,\" Jenkins said. \"But back-to-back nights, as we try to solidify this defensive identity about anchoring down, protecting the paint and (no) second-chance points, it's a struggle.\"\n\nTIP-INS\n\nMavericks: Boban Marjanovic started his first game of the season. ... The stop in Memphis was the first of a three-game, six-day road trip that will carry Dallas 3,535 miles. ... Hardaway converted a 4-point play in the second quarter. He has reached double figures in seven straight games, all in a reserve role. ... Doncic failed to reach 25 points for only the second time this season. The only other game when he didn't score at least 25 was Oct. 29 when he had 12 at Denver.\n\nGrizzlies: Tyus Jones, starting in place of Morant, had eight assists to go with 14 points. .First back-to-back of 12 this season after loss in Orlando on Friday. ... G Grayson Allen missed his fourth straight game with left ankle soreness. ... Rookie Marko Guduric scored 14 points, the first time he has reached double figures in the young season.\n\nMAVERICK ROTATIONS\n\nCarlisle shuffled players through the night, no one playing 30 minutes, and the reserves provided 67 points.\n\n\"We've got a lot of guys that can contribute on any given night,\" Justin Jackson said. \"I think it showed (Saturday), for sure. .Whether you are starting, you're not playing, or you are just playing a little bit, you have to go out and make your minutes count.\"\n\nGRIZZLIES TEAM TURN OVER\n\nMemphis is clearly going through a rebuilding phase with a lot of new players as part of the roster shuffling. An example of it -- the last time Dallas and Memphis played was April 7 near the end of last season. Bruno Cabocolo, who had a career-high 17 rebounds that night, is the only player on the current Memphis roster who played in the April game.\n\nUP NEXT\n\nMavericks: At Boston on Monday night.\n\nGrizzlies: At San Antonio on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995761.623863
}