{
  "game_id": "0021801074",
  "espn_id": "401071747",
  "date": "Mar 21, 2019",
  "matchup": "CHA vs. MIN",
  "headline": "Walker, Bridges lead Hornets past Timberwolves, 113-106",
  "body": "CHARLOTTE, N.C. --  Miles Bridges had plenty of reasons to party.\n\nHe turned 21 years old, his college team, Michigan State, won its first-round game in the NCAA Tournament and he recorded his first career NBA double-double.\n\nSo what was the rookie going to do to celebrate?\n\n\"Go to bed,\" Bridges said with a smile.\n\nKemba Walker scored 31 points, Bridges had 11 points and 12 rebounds and the Charlotte Hornets handed the Minnesota Timberwolves their fifth straight loss, 113-106 on Thursday night.\n\n\"I think I need to celebrate my birthday every game. I was just trying to get the rebounds and stay aggressive,\" Bridges said. \"That's what got me going today.\"\n\nJeremy Lamb added 13 points and 10 rebounds for the Hornets, who won for only the fifth time in the last 16 games.\n\nHornets coach James Borrego turned to his youth after entering the night 3  1/2 games behind the eighth-place Miami Heat in the Eastern Conference and with the team's playoff hopes fading fast.\n\nSecond-year player Dwayne Bacon got the start over Nic Batum, who earns $24 million per season. Bridges continued to start while rookie Devonte Graham and second-year pro Malik Monk also saw extended action, as did young center Willy Hernangomez.\n\nYouth was served as Charlotte outscored Minnesota 17-6 on fast-break points.\n\n\"We are trying to win games,\" Borrego said. \"This isn't throw in the towel, we're out of the playoffs. There isn't any of that going on right now. Number one, we're going after every single win. But I wanted to take a look at some different combinations and some different bodies out there.\"\n\nBorrego said nothing is set in stone moving forward when it comes to his rotation.\n\nKarl-Anthony Towns led Minnesota with 21 points and 16 rebounds.\n\nTowns came in averaging 30.1 points, 12.0 rebounds and 3.6 assists this month after averaging 30.9 points, 13.8 rebounds and 4.1 assists in February. But the Hornets were determined not to let him beat them, swarming with the 7-foot, two-time All-Star center with multiple players almost every time he got the ball in the second half.\n\nHe finished 7 of 17 from the field and had six assists and four turnovers.\n\n\"They were throwing three guys at me on the pass, so I was just trying to make plays, just being aggressive at the end,\" Towns said. \"They're guarding me different. They're guarding me with a lot of respect, so I've got to go out there and make plays.\"\n\nSaid Minnesota coach Ryan Saunders: \"That is something that we expect from the level that Karl has played at and we expect that. We are going to continue to get better as a team. We will learn from that in terms of getting help in areas and also making plays out of there, too.\"\n\nCharlotte built its first double-digit lead at 96-86 midway through the fourth quarter when Walker went coast-to-coast and scored on a Eurostep layup between two defenders. The Timberwolves never mounted a serious challenge after that point.\n\nTIP-INS\n\nTimberwolves: Towns passed Kevin Love (6,989 points) to move into fourth place on the franchise's career scoring list.\n\nHornets: Michael Kidd-Gilchrist sat out with a concussion. He is out indefinitely. ... Bench outscored Minnesota 46-26.\n\nMONK CONTRIBUTES\n\nMonk was finally a factor again for the Hornets, scoring 14 points on 4-of-7 shooting from beyond the 3-point arc. This season has been a struggle for shooting guard from Kentucky who has seen his playing time reduced because of his defense.\n\n\"My first shot went in, so I knew it was going to be a pretty good night,\" Monk said. \"Coach has been telling me to be ready. You never know when your name is going to be called. The whole team has been telling me that. I've just been coming in late at night and getting shots up, coming in early getting shots up and it worked tonight.\"\n\nWIGGINS ON THE DRIVE\n\nAndrew Wiggins finished with 20 points on 8-of-15 shooting and fared well driving to the hole.\n\n\"I feel like I started the game aggressive trying to get downhill,\" Wiggins said. \"I feel like that helped me in the long run.\"\n\nUP NEXT\n\nTimberwolves: Visit Grizzlies on Saturday night.\n\nHornets: Host Celtics on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994347.506315
}