{
  "game_id": "0021500319",
  "espn_id": "400828206",
  "date": "Dec 09, 2015",
  "matchup": "CHI @ BOS",
  "headline": "Thomas carries Boston to 105-100 win over Chicago",
  "body": "BOSTON -- The Boston Celtics didn't get caught up in the hype surrounding their next game.\nThey focused on the Chicago Bulls.\nIsaiah Thomas scored nine of his 20 points in the final three minutes to lead the Celtics to a 105-100 victory over the Bulls on Wednesday night.\nBoston hosts undefeated Golden State next on Friday.\n\"Everybody in the league is talking about Golden State,\" Celtics forward Jared Sullinger said. \"A lot of times you get a Tweet: `Hey Sully, good luck on Friday.' I was like: `We play on Wednesday.' In this league if you overlook anybody, you're going to come up short. I'm not talking about a four, five-point loss. I'm talking about 25-point loss if you look ahead.\"\n\nBut now they can.\n\"It's OK to look at it now,\" Boston coach Brad Stevens said. \"I thought they did a good job of looking at the task at hand.\"\nKelly Olynyk scored 15 points. Jae Crowder and Evan Turner each had 13, and David Lee 12 for the Celtics, who had eight players in double figures and won for the fourth time in five games.\nJimmy Butler led Chicago with a season-high 36 points, and Pau Gasol had his fifth straight double-double with 16 points and 15 rebounds. Derrick Rose added 12 points for the Bulls, who lost their third straight.\n\"After two tough losses, I thought we played hard,\" Bulls coach Fred Hoiberg said. \"I thought our effort gave us an opportunity. We held them to 41 percent shooting; that gives you a chance to win on the road. Now it's sticking together. We have three in a row here that we've lost, and we've got to find a way to band together.\"\nThe Bulls' veterans are wondering what's happened.\n\"This is our first time really going through it,\" Rose said. \"The nucleus of this team, we've been together for a long time. We're just trying to figure things out.\"\nTrailing by eight points with 3 1/2 minutes to go, the Bulls sliced it to 91-88 on Nikola Mirotic's fast-break layup.\nBut Thomas scored the next five points, the final three coming on a three-point play after he was fouled on a spinning drive down the lane with 2:23 to play.\nButler's two free throws with 32 seconds left sliced the deficit to four points, but Thomas hit four free throws and Turner one to seal it.\nSparked by six points from Lee, the Celtics opened the final quarter with a 12-2 run to pull to their largest lead of the game, 87-77 with just under 7 minutes to play. Lee capped the spree with a dunk.\nThe Bulls missed eight of their first nine shots in the fourth.\nThe teams were tied three times and the lead traded hands four in the third quarter before Thomas' 3-pointer with 3.7 seconds left sent the clubs into the fourth tied at 75-all.\nThe Bulls closed the final 68 seconds of the opening half with a 6-0 run to take a 54-51 edge into intermission.\nTIP-INS\nBulls: Hoiberg said his team was still bothered by the last two games, especially after giving up 42 fourth-quarter points in a loss to Phoenix on Monday. \"It hurt the players and the coaches,\" he said.\nCeltics: G Marcus Smart missed his 10th straight with lower left leg injury. G R.J. Hunter was out with a hip flexor. ... The Celtics wore warmups with `Loscy' written on the front. Former player Jim Loscutoff died on Dec. 1. He was 85.\nQUOTE OF THE NIGHT\nSullinger had a simple way to look at Golden State.\n\"They're in the same league as us,\" he said. \"They get paid on the first and 15th just like us.\"\nANOTHER DOUBLE-DOUBLE\nIt was Gasol's 11th this season.\nSPREADING IT AROUND\nStevens said the eight in double figures is just how his club needs to play.\n\"I just think that's who we have to be,\" he said.\nUP NEXT:\nBulls: Host Los Angeles Clippers on Thursday.\nCeltics: Host Golden State on Friday.",
  "source": "espn_api",
  "crawled_at": 1764993960.940994
}