{
  "game_id": "0021901313",
  "espn_id": "401224788",
  "date": "Aug 13, 2020",
  "matchup": "PHX vs. DAL",
  "headline": "Suns top Mavs to keep playoff hopes alive, go 8-0 in bubble",
  "body": "LAKE BUENA VISTA, Fla. --  The Phoenix Suns did all they could in the bubble. It still wasn't enough.\n\nDevin Booker scored 27 points and Phoenix beat the Dallas Mavericks 128-102 on Thursday to finish as the only team to win all eight games seeding games. That kept the Suns alive for a few hours, but they ended up on the outside looking in when Portland beat Brooklyn by a point.\n\nDario Saric scored 16 points and Cameron Payne and Cameron Johnson each added 15 for the Suns.\n\n\"I'm just really grateful for the effort and the growth of this team,\" Suns coach Monty Williams said.\n\nThe Suns needed either Memphis or Portland to lose to get into the play-in series for the No. 8 seed in the West. Memphis won its game against Milwaukee in the same time slot as Phoenix,\n\n\"I'd be lying to you if I said I wasn't looking,\" he said. \"I'm not ashamed to tell you we've all been thinking about it. I just told them to focus on the game and here I am -- I probably looked at it right after I said it to them.\"\n\nBooker has been a breakout star in the bubble. The guard has averaged 30.5 points while shooting 50%t from the field. He was more concerned about team goals after the game.\n\n\"We had one objective -- to get better -- and we did that,\" Booker said. \"I think we approached this with the right mindset from the beginning, from practices, from training camp in Phoenix, from the first two weeks we got down here, everybody was locked in on all cylinders.\"\n\nDallas was already locked into a playoff matchup with the Los Angeles Clippers, so the starters played limited minutes. Luka Doncic, who had averaged 32 points, 11 rebounds and 11.3 assists in the bubble, finished with 18 points in just over 13 minutes. Boban Marjanovic, Dallas' 7-foot-4 reserve center, had 18 points and a career-high 20 rebounds.\n\nThe Mavericks had hoped to perform better heading into the playoffs.\n\n\"Today was disappointing,\" Mavericks guard J.J. Barea said. \"We didn't show up. Our goal was to make it to the playoffs. So we're here now and we've got to get ready for it.\"\n\nPhoenix shot 66% in the first half to take a 76-57 lead. Booker scored 23 points on 9-for-13 shooting before the break. Their biggest lead was 28 points.\n\nTIP-INS\n\nMavericks: F/C Kristaps Porzingis sat out with a left heel injury. ... Marjanovic got his fifth start of the season. ... Seth Curry had missed three of the previous five games with right leg soreness. He finished with eight points in just over 20 minutes of action.\n\nSuns: Beat the Mavericks 117-115 in the bubble on August 2. ... Shot at least 50 percent in each of the first three quarters. ... Committed just six turnovers. ... Ricky Rubio had 12 assists. ... Mikal Bridges scored 14 points.\n\nSUNS DNA\n\nThe Suns averaged 122 points in the eight games.\n\n\"You saw our DNA on display,\" Williams said. \"That's who we are, from the first day of practice in training camp we've been playing that way. And we understood all along for us to win that's the way we'd have to play. I'm proud of the guys that have played that hard for us all season long.\"\n\nQUOTABLE\n\nSuns G Jevon Carter on losses earlier in the season costing the Suns a chance to control their playoff chances: \"There's no point. We lost games. Whatever happened back then there's no point talking about it now. We can't change the past.\"\n\nUP NEXT\n\nMavericks: Play the Los Angeles Clippers next week in the playoffs.\n\nSuns: Either season over or will be in a play-in game against Memphis on Saturday. ---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996532.8187551
}