{
  "game_id": "0022200668",
  "espn_id": "401468823",
  "date": "Jan 17, 2023",
  "matchup": "LAC vs. PHI",
  "headline": "Embiid scores 41, 76ers dominate Clippers in 120-110 victory",
  "body": "LOS ANGELES -- — Joel Embiid set the tone with 26 points in the first half. Philadelphia's bench came up big in the late going.\n\n\r\n              Embiid finished with 41 points and the 76ers recovered after blowing a 14-point, first-half lead to beat the Los Angeles Clippers 120-110 on Tuesday night for their third straight win.\n\n\r\n              “I was just trying to start off strong because what I’ve come to find out is that my energy kind of drives the whole team,” Embiid said. “If I’m at least being aggressive offensively and defensively, my teammates are going to pick up no matter if I make shots or not.”\n\n\r\n              Embiid had nine rebounds and made 15 of 18 free throws before leaving the game with 2:53 remaining. Philadelphia fans chanted “MVP! MVP!” as he raised both arms to encourage the cheers.\n\n\r\n              Embiid had his fifth straight game with at least 30 points.\n\n\r\n              “It wouldn’t be happening without my teammates,” he said. “James (Harden) is doing a good job of making it easy for me. Guys knocking down shots opens up a lot for me to go out and dominate.”\n\n\r\n              Tyrese Maxey added 22 points off the bench. Tobias Harris had 20 points as the 76ers closed out a Los Angeles sweep, having edged the Lakers by one point two nights earlier.\n\n\r\n              After getting outscored 37-27 in the third, the Sixers dominated the fourth. They outscored the Clippers 30-21 in a reversal of the third when LA rallied from 11 points down.\n\n\r\n              “I told the bench, ‘It’s very important we build this lead back,' and that's what we did,” Maxey said. “Everybody is buying into their roles.” \n\n\r\n              Maxey carried the 76ers early with Embiid resting. He hit three consecutive 3-pointers and had a pair of free throws to extend the 76ers' lead to 101-93. \n\n\r\n              “I liked how we closed the game,” Embiid said. “Tyrese took over to start the fourth. By the time we had to come in, we just had to finish the job.”\n\n\r\n              The Sixers ran off 11 in a row, including four by Embiid and a 3-pointer by Georges Niang, that extended their lead to 115-98. \n\n\r\n              “That stretch was huge,” Harris said.\n\n\r\n              Kawhi Leonard scored 27 points to lead the Clippers. Paul George had 13 points and eight rebounds in his return after missing five in a row because of right hamstring soreness. They've lost eight of 10. \n\n\r\n              Leonard and George combined to score 12 of the Clippers' first 19 points to open the third. Marcus Morris' jumper tied the game at 71-all while the Clippers' defense got stops.\n\n\r\n              The Clippers took their first lead of the game, 79-78, on Ivica Zubac's hook over Embiid. On their next possession, Terance Mann scored over Embiid. \n\n\r\n              Leonard scored four in a row before the 76ers led 90-89 on a pair of free throws by Maxey going into the fourth.\n\n\r\n              With Embiid and James Harden on the bench, the Sixers ran off seven straight points to open the second and lead 41-27.\n\n\r\n              The Clippers rallied to get within five, but Embiid scored 15 points over the final 7:13, capped by a 3-pointer, to keep the Sixers ahead 65-52 at halftime. \n\n\r\n              TIP-INS\n\n\r\n              76ers: Embiid notched his NBA-leading sixth straight game with at least 30 points. He had 35 points and 11 rebounds against the Lakers on Sunday. ... Harden's streak of six straight games with double figures in points and assists ended. He finished with six points and nine assists. ... Improved to 23-1 when leading after three quarters, second-best record in the league. ... Shot 59% in first half (23 of 39). \n\n\r\n              Clippers: John Wall (abdominal soreness) is out indefinitely and Luke Kennard (right calf soreness) sat out his sixth straight game.\n\n\r\n              UP NEXT\n\n\r\n              76ers: At Portland on Thursday.\n\n\r\n              Clippers: At Utah on Wednesday to open a four-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994971.49135
}