{
  "game_id": "0021201025",
  "espn_id": "400278745",
  "date": "Mar 22, 2013",
  "matchup": "POR @ ATL",
  "headline": "Wesley Matthews scores 28 points as Trail Blazers rally past Hawks",
  "body": "ATLANTA --  The Portland Trail Blazers credit improved defense for back-to-back road wins that have kept their playoff hopes alive.\n\nThe Atlanta Hawks say they must revive their defense to have any hopes of home-court advantage in the first round of the playoffs.\n\nWesley Matthews scored 28 points to lead three Blazers with at least 20 points and Portland beat the Hawks 104-93 on Friday night for their second road win in as many nights.\n\nDamian Lillard scored 22 points and LaMarcus Aldridge had 20 points and 13 rebounds, giving him at least 20 points in seven straight games. Aldridge scored 28 points in the Blazers' 99-89 win at Chicago on Thursday night.\n\n\"We've been playing a lot better defense in the last two games,\" Lillard said.\n\nThe Hawks and Bulls are fifth and sixth, respectively, in the Eastern Conference standings. Atlanta trails fourth-place Brooklyn by 2 1/2 games in the race for home-court advantage in the first round.\n\n\"That was a quality road win against a very good playoff team,\" Blazers coach Terry Stotts said. \"I was very pleased with our defense, particularly in the second half. With back-to-back wins like this on the road against Chicago and Atlanta, I'm very proud of my team.\"\n\nThe Blazers are 10th in the Western Conference, three games behind the eighth-place Lakers.\n\n\"We're going to keep on fighting until we're mathematically eliminated,\" Matthews said.\n\nThe Hawks led by 11 points in the third quarter before Matthews rallied the Trail Blazers.\n\n\"This team never quits playing, whether during a game or during the course of a season,\" Stotts said.\n\nThe Hawks completed a disappointing 1-2 homestand. Josh Smith led Atlanta with 24 points and 10 rebounds. Jeff Teague scored 21 points and Al Horford added 15 points with 11 rebounds.\n\nThe Blazers made 10-of-18 3-pointers, including 5 of 8 by Matthews and 4 of 5 by Lillard. Nine of the 3-pointers came in the second half.\n\nHawks coach Larry Drew said that was proof his defense wasn't doing the job.\n\n\"That's breakdown. That's major, major breakdown,\" he said. \"We've got to get back to that blue-collar mentality with our defense. We've got to get back to an almost training camp-like attitude.\"\n\nHorford said the Hawks must regroup in their final 13 regular-season games.\n\n\"We just had too many defensive breakdowns,\" Horford said. \"I told the guys we just have to figure out who we are and where we are at this point of the year.\n\n\"By this point of the year, I think we should know. Now we have these games that are remaining to put it together.\"\n\nDrew said the Hawks have \"turned into a team which is trying to outscore people\" instead of making defensive stops.\n\n\"It is not who we are, not who we said we would be at the very beginning of our season,\" Drew said. \"I thought our defense let us down. We did not do a good job. We had too many breakdowns across the board.\"\n\nJ.J. Hickson also posted a double-double for Portland with 15 points and 10 rebounds.\n\nPortland led 52-51 early in the third quarter before Smith's basket on a pass from Horford started a 15-3 run for the Hawks. Smith had two jams -- each set up by Teague -- in the run, which left the Hawks leading 66-55.\n\nStotts called two timeouts during Atlanta's run. The Blazers began their comeback following the second timeout with 5:26 remaining in the third period.\n\nThe Blazers' only points during Atlanta's run came on a 3-pointer by Matthews. The third-year guard from Marquette added a jumper and two more 3s in a stretch of 11 straight points for Portland, cutting the Hawks' lead to 76-73 at the end of the third period.\n\nPortland went up 82-78 with a 9-0 run early in the final period. The Hawks came no closer than two points the rest of the way.\n\nA steal and basket by Teague cut the Blazers' lead to 90-88. Portland responded with eight unanswered points, including a 3-pointer by Lillard, to stretch its lead to 98-88.\n\nKyle Korver's 3-pointer midway through the third quarter gave him at least one 3 in 62 consecutive games, tied with Peja Stojakovic (2008) for the fifth-longest streak in NBA history. It was his only 3-pointer of the game.\n\nGame notes Stotts was Atlanta's coach from 2002-04. ... The Blazers ended a streak of four straight losses in Atlanta. Portland's last win in Atlanta was on Jan. 21, 2008. ... Horford posted his 40th double-double. ... Hickson and Aldridge recorded their 38th and 34th double-doubles, respectively. ... Portland had a 48-41 advantage in rebounds.",
  "source": "espn_api",
  "crawled_at": 1764993433.094892
}