{
  "game_id": "0021600215",
  "espn_id": "400899665",
  "date": "Nov 23, 2016",
  "matchup": "POR @ CLE",
  "headline": "Love scores 40, including 34 in 1st, James has triple-double",
  "body": "CLEVELAND -- Kevin Love didn't think anything unusual was going on Wednesday night. The scoreboard told a different story.\nLove scored 40 points, including an NBA-record 34 in the first quarter, and the Cleveland Cavaliers beat the Portland Trail Blazers 137-125.\nLove fell three points shy of the league record for points in any quarter, set by Golden State's Klay Thompson, who scored 37 in the third on Jan. 23, 2015.\nAs his point total grew on every possession and the Quicken Loans Arena crowd was on its feet each time shot the ball, Love just went about his business.\n\"I'm not trying to be nonchalant about it, but sometimes when you're in it you don't necessarily feel it,\" he said. \"There was nothing out of the ordinary as far as our play-calling and our flow of the game. I just felt like guys were finding me.\"\nLeBron James recorded his 44th career triple-double with 31 points, 10 rebounds and 13 assists, but thought Love owned the night.\n\"Obviously we had a huge hot hand,\" James said. \"That was lightning. We just kept giving him the ball and he kept knocking them down.\"\nCleveland also set a franchise record with 20 3-pointers and showed no signs of being rusty in its first game since Friday.\nLove, who set a team record for points in a period, made 11 of 14 field goal attempts, including 8 of 10 on 3-pointers in the first quarter. He made his first six shots with five 3-pointers.\nLove didn't realize he was closing in on Thompson's milestone.\n\"I didn't know that was the record,\" he said. \"I wasn't really aware of it.\"\nDamian Lillard scored 40 points for Portland, including 25 in the second half.\n\"LeBron James coming downhill is a handful by himself, then you have K-Love on the opposite side -- and somehow, he got lost -- and he ended up getting a wide-open shot,\" Lillard said. \"You can't have that.\"\nJames had his second triple-double this season. He also passed Guy Rodgers for 17th place on the career assist list.\nCleveland, which made its first nine 3-pointers, led 46-31 after one quarter and scored 81 points in the first half, two short of the franchise record.\nLove was 1 for 6 and scored six points the rest of the game, all in the third quarter. He made 12 of 20 shots, including 8 of 12 3-pointers.\n\"To get 34 points on this team, it says a lot,\" said Cleveland coach Tyronn Lue. \"The thing I liked the most was when he got going, our guys really looked for him.\"\nLove recorded his first 40-point game since April 14, 2014, with Minnesota. He scored a career-high 51 points while playing for the Timberwolves on March 23, 2012.\nSTAR-STUDDED CROWD\nIndians manager Terry Francona, voted the American League Manager of the Year last week, and Hall of Fame running back Jim Brown were in attendance. Entertainer Wayne Newton was also at the game and congratulated Love as he came off the court.\nTIP-INS\nTrail Blazers: Portland finished 1-4 on a five-game road trip. ... F Al-Farouq Aminu (left calf strain) missed his ninth straight game. Coach Terry Stotts said there is no update on his status. .... Stotts has 190 victories with Portland, tying him with Mike Dunleavy for fourth place in team history.\nCavaliers: Love's highest-scoring game with Cleveland was 34, which came on Nov. 23, 2015, against Orlando. ...Cleveland's record for points in a half is 83, set on Jan. 15, 1993. ... Tristan Thompson and Portland's Maurice Harkless received double technical fouls after getting tied up under the basket in the second quarter.\nUP NEXT\nTrail Blazers: Host New Orleans on Friday, beginning a four-game, nine-day homestand. Portland is 4-3 at Moda Center this season.\nCavaliers: Host Dallas on Friday. Love averaged 19.0 points and 14.5 rebounds in two games against the Mavericks last season.",
  "source": "espn_api",
  "crawled_at": 1764995669.704384
}