{
  "game_id": "0021800815",
  "espn_id": "401071488",
  "date": "Feb 07, 2019",
  "matchup": "OKC vs. MEM",
  "headline": "Westbrook's triple-double leads Thunder past Grizzlies",
  "body": "OKLAHOMA CITY --  The Thunder got a familiar performance from Russell Westbrook while the Memphis Grizzlies struggled to get used to playing without Marc Gasol.\n\nWestbrook had his eighth straight triple-double, and Oklahoma City rolled past the trade-depleted Grizzlies 117-95 on Thursday night.\n\nWestbrook finished with 15 points, 15 assists and 13 rebounds. He now has the longest triple-double streak of his career and is one short of Wilt Chamberlain's NBA record of nine straight set in 1968.\n\nMeanwhile, the Grizzlies were reeling from the news that Gasol was traded to the Toronto Raptors for three players. The Grizzlies also announced Thursday that they sent JaMychal Green and Garrett Temple to the Los Angeles Clippers for Avery Bradley, and Shelvin Mack to Atlanta for Tyler Dorsey.\n\nThe loss of Gasol hit the hardest. He had played his entire 11-year career with the Grizzlies.\n\n\"You kind of try to prepare yourself as best you can, knowing that there's a possibility that Marc might not be with us come the trade deadline,\" Memphis point guard Mike Conley said. \"You think you've kind of figured it out and you're ready for it, but when it happens, it's a completely different locker room. It's a completely different feel. You get out there to play and you're bringing the guys in the huddle and there's no Marc.\"\n\nPaul George scored 27 points and Jerami Grant added 20 for Oklahoma City, which has won nine of 10.\n\nJaren Jackson Jr. scored 27 points, Bruno Caboclo had 16 and Conley added 15 points and seven assists for Memphis.\n\nThere were only 10 players in uniform for the Grizzlies, and eight played. Even with that, Memphis led 53-51 at halftime before the Thunder found their groove.\n\nOklahoma City center Steven Adams stole the ball and drove nearly the length of the floor for a layup to put the Thunder ahead 57-55. Adams was scoreless in the first half, but he had nine points in the third quarter to help Oklahoma City take an 83-72 lead. The Thunder scored the first 11 points of the fourth quarter to put the game out of reach.\n\n\"I think we just got a hold of their personnel,\" George said. \"Outside of Conley and Jackson, it's not many guys who can make plays.\"\n\nMemphis coach J.B. Bickerstaff said the Grizzlies tried to pull themselves together and make the best of their situation.\n\n\"I think we ran out of gas a little bit,\" he said. \"Give them (the Thunder) credit. Don't take anything away from what they did. But they ramped it up. They understood coming into the game the situation that we were under. Our guys competed. They gave it what they had. At the end of the day, they were just too much for us tonight.\"\n\nTIP-INS\n\nGrizzlies: Fell behind 7-0 to start the game. ... C Ivan Rabb started for the second time this season. He had 15 points and nine rebounds. ... Bickerstaff was called for a technical in the second quarter.\n\nThunder: George and Westbrook will play together on Team Giannis at the All-Star Game. Westbrook was traded from Team LeBron for Philadelphia's Ben Simmons. ... G Alex Abrines missed the game for personal reasons. ... Westbrook has 21 triple-doubles this season and 125 in his career. ... Donte Grantham, a rookie forward from Clemson, got his first action with the Thunder. He missed one shot in 1:34.\n\nSTAT LINES\n\nGeorge failed to score at least 30 points after doing it for five straight games. He still shot 6 for 13 from 3-point range and made all seven of his free-throw attempts.\n\nHE SAID IT\n\nThunder guard Terrance Ferguson on continuing to shoot 3-pointers after a rough first half: \"Russ (Westbrook) told me he was going to beat me up if I stopped shooting, so I had to keep shooting.\"\n\nUP NEXT\n\nGrizzlies: Host the New Orleans Pelicans on Saturday.\n\nThunder: Visit the Houston Rockets on Saturday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nhttps://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994573.726113
}