{
  "game_id": "0022400689",
  "espn_id": "401705255",
  "date": "Feb 01, 2025",
  "matchup": "HOU vs. BKN",
  "headline": "Nets win consecutive games for 1st time since November with 110-98 victory over Rockets",
  "body": "HOUSTON -- — Ziaire Williams had 21 points, D’Angelo Russell added 18 and the Brooklyn Nets won consecutive games for the first time since November with a 110-98 victory over the short-handed Houston Rockets on Saturday night.\n\n\r\n              The Nets, who beat Charlotte on Wednesday night, won two games in a row for the first time since a three-game winning streak from Nov. 24-27.\n\n\r\n              The Rockets were playing without Alperen Sengun, who missed a second straight game with a bruised calf, and lost Fred VanVleet to an ankle injury in the second quarter.\n\n\r\n              Brooklyn led by double digits for most of the night and used a big run early in the third quarter to push its advantage to 18 and cruise to the win.\n\n\r\n              Jalen Green had 29 to lead the Rockets, who lost a second straight after winning their previous four games.\n\n\r\n              Takeaways \r\n              Nets: Brooklyn used a balanced scoring attack to get the win with all five starters scoring at least 13 points.\n\n\r\n              Rockets: Houston’s offense struggled without Sengun and VanVleet, who are second and third on the team by averaging 19.1 and 14.9 points a game. VanVleet had three points before leaving with the injury.\n\n\r\n              Key moment\r\n              The Nets were up by nine early in the third quarter before using a 11-2 run, with 3-pointers from Williams and Keon Johnson, to make it 66-48 with 7 1/2 minutes left in the quarter.\n\n\r\n              Key stat\r\n              Houston’s Amen Thompson and Dillon Brooks combined to make just 11 of 30 shots. \n\n\r\n              Up next\r\n              Houston begins a four-game road trip against the New York Knicks on Monday night before playing the Nets again Tuesday night in Brooklyn's next game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997372.912413
}