{
  "game_id": "0021800179",
  "espn_id": "401070860",
  "date": "Nov 10, 2018",
  "matchup": "MEM vs. PHI",
  "headline": "Conley scored 32 points sending Grizzles past 76ers in OT",
  "body": "MEMPHIS, Tenn. --  Mike Conley and the Memphis Grizzlies added a bad ending to an emotional day for the Philadelphia 76ers.\n\nConley scored a season-high 32 points as the Grizzlies claimed a 112-106 overtime victory over the Sixers, who were short-handed and emotionally spent Saturday night after news broke earlier in the day that the team will trade starters Robert Covington and Dario Saric along with reserve Jerryd Bayless to Minnesota for All-Star Jimmy Butler.\n\n\"It's kind of that feeling in your stomach of just like, I mean, you can't really explain it. I was in disbelief,\" said guard T.J. McConnell who had 16 points and seven assists.\n\nMcConnell's eight points in the fourth quarter helped Philadelphia hold a lead before the Sixers went to overtime for the second night in a row.\n\nDespite the Sixers being short-handed with none of the potentially traded players dressed for the game, it took a strong effort by Conley after halftime for Memphis to remain undefeated at home through five games at FedExForum.\n\nConley, who entered the game shooting 32 percent from the field in the last five games, converted 12 of 24 shots in the game. That included scoring 13 points in the third quarter, making 6 of 8 shots to help Memphis erase a Philadelphia lead that earlier had reached 16 points.\n\n\"I'm not going to lie,\" Conley said, \"These whole last couple of weeks have been like just barely missing, barely not making shots, and missing shots I would normally make and feeling good while doing it.\"\n\nMarc Gasol scored 18 points and 12 rebounds, while Garrett Temple finished with 17 points, including a 3-pointer -- after an offensive rebound by Gasol -- with 39 seconds left in regulation to send the game into overtime tied at 102. That was the fourth tie to go with six lead changes in the fourth.\n\nIn overtime, Memphis built a couple of early four-point advantages before Conley took it to the final six-point margin on two free throws with 7.6 second remaining.\n\n\"He's been working his tail off,\" Memphis coach J.B. Bickerstaff said. \"He understands how vital he is to us, the load that he has to bear. He's been getting in extra work.\"\n\nJ.J. Redick led the Sixers with 20 points, while Ben Simmons finished with 18 points and 14 rebounds. Joel Embiid had 14 points and 16 rebounds for Philadelphia, but was 4 of 15 from the field.\n\nThe game marked the second time in two nights Philadelphia went to overtime. The Sixers defeated the Charlotte Hornets 133-132 in overtime at home Friday night.\n\nAsked about the fatigue factor, Sixers coach Brett Brown said: \"I didn't feel it. You think it would, you know with overtime (against Charlotte), flight, overtime (Saturday) and so on. But I didn't feel it.\"\n\nAs for whether emotions of the changing teammates contributed, Redick said: \"I thought we played hard. Us playing back-to-back. Overtime games are tough. I thought we handled ourselves well in that regard.\n\n\". As Jerryd Bayless says: The game is the game.\"\n\nTIP-INS\n\nSixers: The Sixers dressed only nine because of the players involved in the trade were not available. ... Redick has reached double figures in 23 straight games. ... Redick connected on the first six shots in the game. The Sixers are undefeated at home, but 1-6 on the road. . Philadelphia made only one of their 15 shots from outside the arc after halftime.\n\nGrizzlies: Unveiled their gray \"City Edition\" uniforms with blue trim and gold numbers. ... F Dillon Brooks left the game limping with an injured left knee in the early stages of the second quarter. He did not return. ... Gasol passed 11,000 career points in the first half. ... Bickerstaff drew a technical late in the first half for complaints about officiating regarding Gasol.\n\nOUTTA HERE\n\nTwo courtside fans were ejected in the first half at the direction of Redick. \"Not going to repeat that one,\" the Sixers guard said when asked about the exchange. \"(The fan) said something -- actually twice. It's just not something you should say with women and children around. It was highly inappropriate.\"\n\nUP NEXT\n\nSixers: Travel to Miami to face the Heat on Monday\n\nGrizzlies: Entertain the Utah Jazz on Monday\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994137.115724
}