{
  "game_id": "0021800426",
  "espn_id": "401071107",
  "date": "Dec 14, 2018",
  "matchup": "OKC @ DEN",
  "headline": "Westbrook, Murray tussle as Nuggets beat Thunder 109-98",
  "body": "DENVER --  For all his offensive contributions and rebounding, Nikola Jokic's most important role in the end was peacemaker.\n\nJokic scored 24 points, Jamal Murray had 19 and the Denver Nuggets beat the Oklahoma City Thunder 109-98 on Friday night after Murray and Russell Westbrook had a heated exchange.\n\nWestbrook and Murray pushed each other and argued after lining up next to each other for a jump ball in the final seconds. Jokic tried to get between them, and Westbrook threatened to beat up Jokic while being restrained. No blows were exchanged, but the final moments played out amid heightened tensions.\n\nAsked what Westbrook said to him, Jokic said he didn't remember and dismissed the dustup as \"nothing.\"\n\n\"He's a competitive guy,\" Jokic said. \"He didn't want to lose. All is good. I just wanted to separate them.\"\n\nWestbrook said there was a reason behind his initial shove of Murray.\n\n\"He was in my way,\" Westbrook explained.\n\nMurray said he hadn't done anything to provoke the incident.\n\n\"He tried to move me out of the way,\" Murray said. \"He shoved me first. It is what it is. I didn't do anything.\"\n\nJokic also had 15 rebounds and nine assists, just shy of a third triple-double this season. Nick Young, signed as a free agent Monday, scored six points in his Nuggets debut, including a key 3-pointer in the fourth quarter.\n\nPaul George had 32 points to lead the Thunder, who lost their fourth in a row to the Nuggets.\n\n\"From an identity standpoint and how we want to play, we want to play downhill,\" Thunder coach Billy Donovan said. \"I think when we got around the basket, they have a lot of physicality. They have Jokic and (Mason) Plumlee, but we had some opportunities to finish plays. Jerami Grant got into the teeth of the defense, but couldn't finish. Steven Adams had a great offensive game and had opportunities to score as did Russell Westbrook. We had a lot of guys in there, but we just weren't able to finish.\"\n\nAdams scored 26 points, while Grant and Westbrook finished with 13 apiece. Westbrook and Adams also had 14 rebounds each.\n\nTrailing by 10 late in the third quarter, Oklahoma City got a layup and a 3-pointer from George in the final minute to pull to 82-76.\n\nWith a 9-2 burst capped by another layup from George, the Thunder trimmed it to 99-96 with 3:20 remaining. The Nuggets scored 10 of the last 12 points down the stretch, four of them on a jumper and a pair of free throws by Murray.\n\nThe teams were gathered for a jump ball with 35.7 seconds left when Westbrook, apparently upset over Murray's positioning around the circle, began pushing him. As Murray pushed back, teammates and officials quickly rushed in to separate the two, who exchanged words before the skirmish ended.\n\nMurray said the lesson he's taking from the game's finish is the resiliency the Nuggets have shown despite missing key players because of injuries.\n\n\"We're taking every game seriously,\" Murray said. \"We're playing with a lot of confidence and everybody is a threat. It's not just me or Joker or Gary (Harris). Everybody on the court is taking shots and setting each other up. We go out there and we win games. We have fun doing it. We all stand up for each other. We all look out for each other. And the more we win games, we know we can beat anybody.\"\n\nThe Nuggets took a 60-52 lead at halftime, boosted by Torrey Craig's perimeter shooting as he made three of his first four attempts from 3-point range.\n\nAdams scored 17 points in the first half, helping to keep the Thunder within striking distance.\n\nTIP-INS\n\nThunder: Andre Roberson remains sidelined by a left patellar tendon injury that has kept him out all season.\n\nNuggets: F Paul Millsap missed his third game since breaking his right big toe. ... Harris sat out his fifth straight game because of a right hip injury. ... Plumlee fouled out with just over six minutes left.\n\nUP NEXT\n\nThunder: Complete a back-to-back set at home Saturday night against the Los Angeles Clippers.\n\nNuggets: Continue a four-game homestand Sunday night against Toronto.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994609.624131
}