{
  "game_id": "0022400312",
  "espn_id": "401704878",
  "date": "Dec 01, 2024",
  "matchup": "POR vs. DAL",
  "headline": "Doncic has 36 points and 13 assists in return, Mavericks down the Trail Blazers 137-131",
  "body": "PORTLAND, Ore. -- — Luka Doncic returned from a wrist injury and had 36 points in the Dallas Mavericks' 137-131 victory over the Portland Trail Blazers on Sunday night. \n\n\r\n              Doncic, who missed five games, also had 13 assists in the Mavericks' fourth straight win. \n\n\r\n              The Mavs were missing Kyrie Irving, who had 30 points in a 106-94 win Saturday over the Utah Jazz, because of a sore shoulder. The Mavs were also without Klay Thompson (left foot), Dereck Lively II (right knee) and Naji Marshall (illness). \n\n\r\n              Anfernee Simons had 27 points, including 24 in the third quarter, for the Blazers. \n\n\r\n              Dallas led by 112-101 after Spencer Dinwiddie’s 3-pointer in the fourth quarter, but the Blazers came back to tie it at 127 on Deni Avdija’s three-point play with 1:54 left.\n\n\r\n              P.J. Washington answered with a 3-pointer from the baseline for Dallas, and the Blazers couldn't catch up.\n\n\r\n              Portland led by as many as 10 points in the opening quarter, but the Mavs closed the gap for a 61-58 lead at the half. Quentin Grimes' dunk gave Dallas a 79-67 lead in the third, and the Mavs held a 100-97 advantage going into the final period. \n\n\r\n              Takeaways\r\n              Mavericks: Center Daniel Gafford was inadvertently hit in the face in the first quarter and was treated on the floor before heading to the locker room, but he returned. \n\n\r\n              Trail Blazers: Portland's Scoot Henderson was unavailable for the third straight game with a left quad contusion.\n\n\r\n              Key Moment\r\n              Doncic closed the first half with a pair of 3-pointers and a 17-foot jumper to give the Mavericks the halftime lead. \n\n\r\n              Key Stat\r\n              Simons had 24 of his 27 points in the third quarter, four points shy of the team record for points in a quarter. \n\n\r\n              Up Next\r\n              The Mavericks host the Memphis Grizzlies on Tuesday, while the Trail Blazers visit the Los Angeles Clippers the same night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998190.185384
}