{
  "game_id": "401810079",
  "espn_id": "401810079",
  "date": "Nov 12, 2025",
  "matchup": "LAC vs DEN",
  "headline": "Nikola Jokic scores 55 points to match NBA season high, Nuggets beat Clippers for 6th straight win",
  "body": "INGLEWOOD, Calif. -- — Nikola Jokic had 55 points, tying the highest-scoring performance in the NBA this season, and 12 rebounds and the Denver Nuggets beat the short-handed Los Angeles Clippers 130-116 on Wednesday night for their sixth straight victory.\n\n\r\n              Oklahoma City star Shai Gilgeous-Alexander had 55 in a double-overtime game at Indiana on Oct. 23.\n\n\r\n              Jokic scored 25 of Denver's 39 points in the first quarter. He had eight in the second before coming back with 19 in the third. He sat out most of the fourth before scoring three points to complete his night going 18 of 23 from the field. He missed adding to his league-leading six triple-doubles with six assists. The Serbian big man was 5 of 6 on 3-pointers and made 14 of 16 free throws.\n\n\r\n              James Harden scored 23 points — making all 10 of his free throws — and had eight rebounds and five assists to lead the spiraling Clippers, who took a major blow earlier in the day when they found out that Bradley Beal will miss the rest of the season with a fractured hip. They're currently without Kawhi Leonard, who has a sprained ankle and foot.\n\n\r\n              Jordan Miller added a career-high 22 points off the bench and Ivica Zubac had 18 points as Los Angeles lost its sixth in a row to fall to 3-8.\n\n\r\n              The Clippers kept it close in the first half despite Jokic's prolific scoring. After being down 10 in the opening quarter, they led by 10 and were ahead 68-63 at halftime.\n\n\r\n              Jokic took over in the third, twice putting together personal runs of six straight points. The Nuggets led 106-90 going into the fourth.\n\n\r\n              Up next\r\n              Nuggets: At Minnesota on Saturday night.\n\n\r\n              Clippers: At Dallas in an NBA Cup game on Friday night to open a seven-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042617.2964401
}