{
  "game_id": "0021400767",
  "espn_id": "400579059",
  "date": "Feb 08, 2015",
  "matchup": "MEM vs. ATL",
  "headline": "Grizzlies use late surge to break tie, put East-leading Hawks away",
  "body": "MEMPHIS, Tenn. -- The Memphis Grizzlies wouldn't let Atlanta make it two in a row against the best from the West.\nMike Conley had 21 points and six assists, Marc Gasol finished with 16 points and 10 rebounds and the Grizzlies beat the Hawks 94-88 on Sunday.\nTwo nights after beating Western Conference-leading Golden State, the Hawks were tied at 86 with No. 2 Memphis after Mike Scott's 3-pointer with 3:24 left, before the Grizzlies scored the next eight points to put away the game.\n\"We did what we do,\" Conley said. \"We keep it close as long as we can and try to outwork you at the end. We were able to get a couple of possessions to go our way.\"\nThe game was quite a change from the up-tempo pace of the Hawks' 124-116 win Friday night over the Warriors. This time, things were slow, methodical and physical.\nFor three quarters, the Hawks seemed to adjust to the slower style, but eventually, Memphis benefitted from a game suited to its pace.\n\"We're a physical team, and we beat you up for four quarters and hopefully it wears you down,\" Conley said. \"But [Atlanta] has played against every style you can play against and they've beat everybody.\"\nZach Randolph had 11 points and 15 rebounds, while Kosta Koufos finished with 10 points and seven rebounds as Memphis outrebounded the Hawks 55-37.\nOne of those rebounds provided the tiebreaking basket, with Tony Allen tipping in Randolph's miss to make it 88-86 with 2:28 remaining.\n\"Our execution has probably got to be better,\" Atlanta coach Mike Budenholzer said. \"We've got to cut harder. We've got to screen harder and all those things.\"\nJeff Teague led the Hawks with 22 points, shooting 9-of-13, while Kent Bazemore added 14 points. Dennis Schroder and Scott finished with 11 apiece off the Atlanta bench and DeMarre Carroll scored 10.\nThe Hawks converted 12 of 30 from 3-point range, with Scott and Schroder combining to go 5-for-7.\nBut other Atlanta shooters were off target. Kyle Korver was able to go 2-for-5, but Carroll, Paul Millsap and Pero Antic were a combined 2-of-12.\n\"Those nights happen,\" Korver said of the Hawks shooting 41 percent for the game. \"We wish it wouldn't have happened against a good team.\"\nMemphis made only three 3-pointers, but all came in the fourth quarter, including a pair by Conley.\nThe Hawks converted four 3-pointers in the third period, building the lead to seven points, their biggest of the night. Memphis closed the quarter on a 15-3 run capped by Koufos' dunk as the horn sounded for a 69-66 lead. Schroder's 3-pointer was the only Atlanta basket to slow the Memphis momentum.\nMemphis extended the advantage by outscoring Atlanta 25-22 in the fourth.\n\"I thought we wore them down a little bit,\" Memphis coach Dave Joerger said. \"Both teams were exhausted.\"\n---\nTIP-INS:\nHawks: Atlanta is 14-4 against the West. Both teams have set a franchise record for wins before the All-Star break. ... The Hawks defeated Memphis 96-86 on Jan. 7 in Atlanta by converting 13 of 35 from 3-point range.\nGrizzlies: The game was a sellout, the 10th of the season for Memphis. Randolph recorded his 30th double-double of the season. ... The Grizzlies are 9-1 against the Eastern Conference at home.\nBAD NIGHT FOR BIG HAWKS\nAl Horford and Millsap managed only six and four points, respectively, going a combined 4-of-21 from the field. It was a season low for Millsap and matched the worst scoring night for Horford. \"I don't think this season that we both had a game where we both couldn't hit anything,\" said Horford, who had 12 rebounds.\nTEAGUE TWEAK\nTeague limped off the floor with a left ankle injury in the fourth quarter but returned a short time later. \"He moved pretty well the last 2 or 3 minutes. I'm sure we'll ice it up and see how he's feeling,\" Budenholzer said.\nUP NEXT:\nHawks: Visit Minnesota on Monday.\nGrizzlies: Host Brooklyn on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764992146.316833
}