{
  "game_id": "0021301200",
  "espn_id": "400490073",
  "date": "Apr 13, 2014",
  "matchup": "OKC @ IND",
  "headline": "Pacers top Thunder, move win away from clinching East's top seed",
  "body": "INDIANAPOLIS -- The Pacers were back to being themselves Sunday.\nThey made shots. They defended hard for 48 minutes. Lance Stephenson regained his swagger and, yes, the reeling Pacers even looked like a playoff-ready team.\nDavid West made three free throws in the final 15 seconds and Stephenson produced his league-leading fifth triple-double to give Indiana a 102-97 win over Oklahoma City, putting the Pacers on the cusp of clinching the No. 1 seed in the Eastern Conference.\n\n\"We're going to treat it (the season finale) like a playoff game. We have to get that No. 1 spot,\" Stephenson said. \"That's what we wanted from the beginning of the season so we have to take it, not get it, we have to take it.\"\nAll they need is a win Wednesday night at Orlando or one more Miami loss. The Heat visit Washington on Monday and host Philadelphia on Wednesday.\nIt's been a wild second-half ride for Indiana (55-26), which held the top spot in the East from opening night in October until the last week of March. When the Pacers beat the Heat on March 26, they had a three-game lead and a seemingly firm grasp on home-court advantage.\nAs the losses mounted, though, Miami charged back and finally took the top spot on March 31. But rather than pulling away, the two-time defending champs gave the lead right back.\nMiami retook a one-half game by beating the Pacers at home Friday, then fell into a tie with Indiana after losing Saturday night in Atlanta.\nThe Pacers went into Sunday's game with six losses in eight games and the knowledge that all they had to do was win their last two -- because they have a better conference record than the Heat.\n\nSo just like that, Indiana flipped the switch and got back to looking the a championship contender.\nSix players reached double figures including West, who had 21, and Stephenson, who had 17 points, 11 assists and 10 rebounds. He broke Detlef Schrempf's franchise record for most triple doubles in a season (four in 1992-93).\n\"He's a big part of our personality, a big part of our edge, a fan favorite with good reason and he's one of the head coach's favorites,\" Pacers coach Frank Vogel said after getting a low-five from Stephenson after a late 3-pointer.\nPaul George finished with 20 points and 12 rebounds and C.J. Watson scored a season high 20 points. The Pacers didn't even need much from Roy Hibbert, who had six rebounds, no points and was 0 for 9 from the field.\nThe Thunder (58-22) shot 42.9 percent from the field, were 7 of 28 on 3-pointers and were outrebounded 46-32.\nNBA scoring leader Kevin Durant had 38 points and Russell Westbrook had 21 as they rallied Oklahoma City from a 10-point deficit over the final seven minutes.\nThe Thunder, who were trying to lock up the No. 2 seed in the West, have no doubt Indiana can play with the best in the NBA.\n\"What's surprising to me is the people who are down on them,\" Oklahoma City coach Scott Brooks said. \"In an 82-game season, you're going to have some tough times. Unfortunately for them, they're having it late in the season. But all it takes is a game or two to get back on.\"\nWhat changed for the Pacers, aside from returning to their home court?\nThey were gritty and selfless, the starters who sat out Wednesday at Milwaukee looked well-rested and the bench that produced a big win over the Bucks looked more confident. While there were still signs of lingering problems, such as 21 turnovers.\nIndiana stayed in control and closed it out late.\nAfter George's 12-foot runner gave the Pacers an 87-77 lead with 6:59 to go, the Thunder charged back, tying the score at 89 when Westbrook hit a 3 with 2:46 to go.\n\"We put ourselves in good position, we just couldn't finish,\" Durant said.\nThe Pacers wouldn't allow it.\nGeorge broke the tie with a 3 and 2:09 to play, West followed that with two straight mid-range jumpers and Stephenson knocked down a 3 with 34.2 seconds left to give make it 97-91.\n\"We're just trying to put together good basketball at this point and hopefully carry it into the playoffs,\" West said.\nGame notes\nGeorge welcomed a 15-year-old Cincinnati boy as part of the Make-A-Wish foundation. Roei, a Pacers fans, has been waiting 10 months for a liver/small bowel transplant. ... Indiana finished 35-6 at home and is assured of having the league's best home record. ... Nick Collison received eight stitches to close a cut above his nose and backup guard Reggie Jackson injured his neck after running into Ian Mahinmi's pick in the fourth quarter.",
  "source": "espn_api",
  "crawled_at": 1764992823.052943
}