{
  "game_id": "0021601138",
  "espn_id": "400899390",
  "date": "Apr 01, 2017",
  "matchup": "CHI vs. ATL",
  "headline": "Butler scores 33, Bulls beat Hawks 106-104",
  "body": "CHICAGO --  Jimmy Butler saw confidence and swagger, a team embracing the moment. No one welcomed it more with open arms than he did.\n\nButler scored 33 points and hit two free throws with 2.1 seconds left to lift the Chicago Bulls to a 106-104 victory over the Atlanta Hawks on Saturday.\n\n\"I see guys doing what they're supposed to be doing -- playing hard, shooting the ball when they're open, not trying to do too much,\" Butler said. \"That's what we need.\"\n\nButler scored the Bulls' final nine points. His free throws gave them a two-point lead and capped a 15-4 run.\n\nTim Hardaway Jr. then missed a 3-pointer for Atlanta as time expired, giving the Bulls their third straight win.\n\nChicago also moved into seventh place in the Eastern Conference. The Bulls are tied with Miami and Indiana at 37-39 but own tiebreakers over the Heat and Pacers. Sixth-place Atlanta (39-37) -- which had won two straight after dropping seven in a row -- trails Milwaukee by a game.\n\nRajon Rondo had a season-high 25 points and added 11 rebounds. Denzel Valentine scored 13 points, hitting two 3-pointers down the stretch to help the Bulls stop a seven-game losing streak to Atlanta.\n\nThe win comes on the heels of a victory over LeBron James and the defending champion Cleveland Cavaliers.\n\n\"We had a great win a couple of days ago, but it means nothing if we came out and laid an egg tonight,\" Rondo said. \"Also, these guys have beaten us seven straight times.\"\n\nDennis Schroder led the Hawks with 29 points. Hardaway scored 20, and Dwight Howard finished with 13 points and 12 rebounds.\n\n\"They responded well and you have to give them credit,\" Schroder said. \"We've got to execute better in crunch time and just do a better job, screening, rolling to the basket and taking care of the ball.\"\n\nTIP-INS\n\nHawks: All-Star F Paul Millsap missed his eighth consecutive game because of a left knee ailment. Coach Mike Budenholzer said Millsap is \"making positive progress,\" though the Hawks are being \"aggressively cautious\" with him. If Millsap misses Sunday's game at Brooklyn, he will have three more days before the Hawks host Boston on Thursday. ... F Mike Dunleavy Jr. played 12 minutes but did not score after missing a game because of a sore right ankle, while F Thabo Sefolosha (strained right groin) sat out his fourth in a row. G Malcolm Delaney sat out with back spasms.\n\nBulls: Butler was 10 of 10 at the foul line. ... The Bulls hit 12 3-pointers, their sixth straight game with at least 10.\n\nFINAL PUSH\n\nThe Bulls trailed by 10 in the fourth quarter and were down 100-91 with less than five minutes to go.\n\nValentine hit a pair of 3-pointers to start the game-ending run, and Butler took over from there. He tied it at 102-all when he connected from long range with 1:59 left.\n\nSchroder pulled up for the go-ahead jumper after Butler's baseline shot hit the front of the rim to give the Hawks a 104-102 lead with 35 seconds left. Butler immediately answered with a driving layup to tie it again.\n\nAfter a timeout, Schroder lost his dribble out of bounds with 25 seconds left. Butler then got fouled by Kent Bazemore as he attempted a jumper with 2.1 seconds remaining and hit both free throws as the crowd chanted \"MVP! MVP!\"\n\nHardaway's 3 after a timeout then hit the back of the rim as time expired.\n\n\"I should have pump-faked,\" Hardaway said. \"Two seconds left, I think that's an easy pump-fake, one-dribble shot. I think I had time. But it felt great coming off my hands. It felt great. It was in line. It just was a little bit long.\"\n\nUP NEXT\n\nHawks: Visit Brooklyn on Sunday.\n\nBulls: Visit New Orleans on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995008.592866
}