{
  "game_id": "401810146",
  "espn_id": "401810146",
  "date": "Nov 24, 2025",
  "matchup": "GS vs UTAH",
  "headline": "Stephen Curry scores 31 points as Warriors run away from Jazz 134-117",
  "body": "SAN FRANCISCO -- — Stephen Curry made six 3-pointers and scored 31 points, Jimmy Butler had 18 points, seven assists and six rebounds and the Golden State Warriors beat the Utah Jazz 134-117 on Monday night.\n\n\r\n              Curry shot 12 for 24 on the way to his fifth 30-point game in the last six. Moses Moody had 15 points and six rebounds, while Gary Payton II contributed nine points, career-best eight assists and six rebounds in a rare start. \n\n\r\n              Keyonte George finished with 28 points on 10-of-17 shooting, seven assists and six rebounds to lead Utah, which has lost four straight and five of six after dropping the first game of a back-to-back at home Sunday to the Lakers.\n\n\r\n              Coming off their first home loss of the season Friday against Portland, the Warriors shot 49.5%, committed only 10 turnovers, scored 14 points off the 17 they forced and finished with 52 points by the bench — 20 by Buddy Hield.\n\n\r\n              Golden State debuted new “The Town” edition jerseys and a matching floor to honor the franchise's long history in Oakland before moving across the bay into Chase Center for the 2019-20 season.\n\n\r\n              The Warriors have won 10 straight at home against the Jazz, whose last road victory at Golden State was 129-96 on Jan. 22, 2020. Utah dropped to 0-5 on the road against the Western Conference.\n\n\r\n              Draymond Green was sidelined by a sprained right foot that showed no significant injury on an MRI exam, the third game he has missed this month for illness and injury. Coach Steve Kerr hoped to have his defensive star back Wednesday night, while forward Jonathan Kuminga is still out because of his troublesome knees.\n\n\r\n              Golden State fell behind 11-0 out of the gate missing its initial six shots as the Jazz hit four of six before Butler's three-point play at the 8:42 mark. The Warriors then went on a 17-3 run to take control and led 67-55 at halftime following a 41-point second quarter.\n\n\r\n              Up next\r\n              Jazz: Host Sacramento on Friday night.\n\n\r\n              Warriors: Host Houston on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042691.941835
}