{
  "game_id": "0022100910",
  "espn_id": "401360729",
  "date": "Feb 26, 2022",
  "matchup": "MIL vs. BKN",
  "headline": "Irving has season-high 38, Nets rally to beat Bucks 126-123",
  "body": "MILWAUKEE -- — Kyrie Irving enjoyed this trip to Fiserv Forum much better than his last visit.\n\n\r\n              Irving scored a season-high 38 points and Bruce Brown sank a go-ahead 3-pointer with 1:38 left in the Nets' 126-123 victory over the slumping Milwaukee Bucks on Saturday night. \n\n\r\n              This marked Irving's first game in Milwaukee since spraining his right ankle in Game 4 of last season's Eastern Conference semifinals, an injury that helped the Bucks rally from a 2-0 deficit to win that series in seven games.\n\n\r\n              “It was definitely emotional for me to prepare for this game just because of (that),” Irving said. “I haven't been back in the building since then. I try my best not to wear my emotions on my face or on my shoulders, but sometimes they can get the best of me. It definitely felt like there was a weight lifted just being back here, being healthy, getting the win, knowing that there's a possibility we could see them down the line again.”\n\n\r\n              Irving was playing just his 15th game of the season. He still can’t play in home games because he hasn’t met New York City’s vaccine requirement.\n\n\r\n              But he’s been outstanding the times he has taken the floor. He has scored at least 27 points in each of his last four appearances.\n\n\r\n              His performance Saturday helped Brooklyn snap a two-game skid and win for just the third time in 16 games. The Bucks have lost four of their last five.\n\n\r\n              “We got together as a group after the All-Star break,” Irving said. “We put some goals on the board, just a daily reminder of what we're gearing up for, just the things that we can control and just focusing on those things.”\n\n\r\n              The Nets, who are eighth in the Eastern Conference standings, need Irving at his best as they continue to play without Kevin Durant and the newly acquired Ben Simmons.\n\n\r\n              Durant hasn’t played since Jan. 15 due to a sprained medial collateral ligament in his left knee. Simmons, who came to Brooklyn in a Feb. 10 trade that sent James Harden to the Philadelphia 76ers, still hasn’t made his 2021-22 debut.\n\n\r\n              Nets coach Steve Nash said after Saturday's game that Durant probably won't play in either of Brooklyn's next two games. Nash said before the game that Simmons is dealing with back soreness  while preparing for his return to action.\n\n\r\n              The Nets were good enough to win without those two Saturday, thanks largely to Irving.\n\n\r\n              “When you watch Kyrie, it feels like he's in the video games,” new Nets guard Goran Dragic said. “It's just crazy how he moves and how he's making those tough shots.”\n\n\r\n              Bobby Portis had 30 points and 12 rebounds and made a career-high eight 3-pointers for the Bucks. Antetokounmpo had 29 points, 14 rebounds and six assists. Khris Middleton added 25 points.\n\n\r\n              The Bucks had a couple of opportunities to come back in the closing seconds.\n\n\r\n              Brooklyn led 119-116 when Grayson Allen was fouled by Irving while attempting a 3-pointer with 14.6 seconds left, giving the Bucks a chance to tie the game.\n\n\r\n              Allen, who entered the day shooting 85.7% from the line, made his first attempt but missed his second before sinking the third to make it 119-118.\n\n\r\n              The Bucks had one last chance with 2.1 seconds and no timeouts remaining. Wesley Matthews threw a long inbounds pass to Antetokounmpo, who had a clean look at a game-tying 3-point attempt that bounced off the rim.\n\n\r\n              The Bucks went just 25 of 38 on free throw attempts and committed 15 turnovers. The Bucks were outscored 27-9 in points off turnovers.\n\n\r\n              “We've just got to find a way to be better,” Middleton said. “Simple as that.”\n\n\r\n              POSSIBLE CHANGE TO MANDATE?\n\n\r\n              Irving says he appreciates NBA Commissioner Adam Silver’s suggestion that New York City Mayor Eric Adams should look into the city's COVID-related mandate, which requires athletes playing for the city’s teams to be vaccinated to play in public venues.\n\n\r\n              But the seven-time All-Star is uncertain whether any change might be on the way.\n\n\r\n              “Just remaining patient and just seeing where things end up in this next week or so or next two weeks,” Irving said. “I’m not too sure. I know as much as you do.”\n\n\r\n              Silver suggested the mandate was unfair because it didn't apply to out-of-town athletes playing at New York. Adams agreed that there were problems with the rule but said he is hesitant to make a change.\n\n\r\n              “Great to have a relationship with (Silver),\" Irving said. “I know his job is not easy standing in the fire sometimes on behalf of our league. My respect level went to a whole new one for him. I’m just grateful that he did that. He really took one for the team.”\n\n\r\n              TIP-INS\n\n\r\n              Nets: Dragic made his Nets debut Saturday after signing with them on Tuesday. Dragic hadn’t played a game for anyone since Nov. 13 with the Toronto Raptors. Dragic scored six points in 14 minutes.\n\n\r\n              Bucks: George Hill missed a 10th straight game with neck soreness. “We’re going to give him a little bit more time, I think probably a week minimum,” Bucks coach Mike Budenholzer said before the game. “We’ll see how he’s feeling after that and go from there.” … Former Nets DeAndre' Bembry and Jevon Carter made their Bucks debuts on Saturday. Neither player scored. ... Jrue Holiday scored 19 points but had seven turnovers and shot just 4 of 8 on free-throw attempts.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host the Toronto Raptors on Monday. The Nets have won both of their previous meetings with the Raptors this season.\n\n\r\n              Bucks: Host Charlotte on Monday. The Bucks have gone 1-2 against the Hornets this season. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993220.9946392
}