{
  "game_id": "0021800432",
  "espn_id": "401071113",
  "date": "Dec 15, 2018",
  "matchup": "MEM vs. HOU",
  "headline": "Harden has 2nd straight triple-double, Rockets top Grizzlies",
  "body": "MEMPHIS, Tenn. --  James Harden may be getting on a roll, notching his second straight triple-double to help the Houston Rockets grab their third consecutive win.\n\nHarden had 32 points, 12 rebounds and 10 assists, and the Rockets weathered a fourth-quarter burst to beat the Grizzlies 105-97 on Saturday night.\n\nHarden, who had 50 points in a triple-double in the Rockets' victory over the Lakers on Thursday, recorded his 10th assist on a pass to Clint Capela with 21.3 seconds left as the Grizzlies tried to trap defensively in hopes of whittling the Houston lead in the final minute.\n\nAsked if he would have gotten the assist without the Memphis defensive pressure, Harden replied with a sly grin through his thick, black beard : \"That's a good question. You never know, right?\"\n\nCapela's basket gave him 26 points to go with 10 rebounds. Gerald Green scored 17 points.\n\nMike Conley led Memphis with 22 points, while Marc Gasol added 17 points and nine rebounds. JaMychal Green had 13 points.\n\nThe Rockets made 13 3-pointers, near their average, compared to only five for the Grizzlies.\n\n\"We've got to do a better job of getting there,\" Memphis coach J.B. Bickerstaff said of his team's 3-point defense. \"We've got schemes in place to protect us from those, and we were just late in our rotations.\"\n\nThe Rockets appeared to be coasting in the fourth, holding a 15-point lead with about 7 minutes remaining, but Memphis clicked off a 14-5 run to cut it to 97-91. But the Grizzlies got no closer.\n\nThe run was fueled by rookie Jevon Carter making his first appearance of the season. He finished with 11 points with a couple of steals and a blocked shot. His defense sparked the Grizzlies' rally that at least made the ending interesting.\n\n\"It was just good to be out there,\" Carter said of his debut, when he guarded Harden and Chris Paul. \"It was fun. I'm a competitor. I want to play against the best and at this level, that's just what it's going to be night-in and night-out.\"\n\nA trio of 3-pointers by Gerald Green reversed the momentum gained when Memphis scored 11 straight points to open the third period. Green collected 12 points in the third, helping Houston maintain a 79-65 lead in the fourth.\n\n\"Gerald Green came in and gave us a boost,\" Rockets coach Mike D'Antoni said. \"It was something that he was missing in the first half, like he was out of wind.\"\n\nTIP-INS\n\nRockets: G Eric Gordon, who was listed as questionable because of left knee soreness, scored four points. . Capela reached at least 20 points for the ninth time this season. ... Harden has 38 triple-doubles for his career. It was his first against the Grizzlies. ... Paul finished with 10 points and 10 assists.\n\nGrizzlies: F Kyle Anderson did not play due to a left ankle sprain suffered in the fourth quarter of Friday's loss to Miami. Anderson's absence ended a streak of 25 straight games where Memphis used the same starting lineup: Anderson, Gasol, Conley, Garrett Temple and rookie Jaren Jackson Jr. Shelvin Mack started in Anderson's place.\n\nFIRST IMPRESSIONS\n\nCarter's debut drew nice reviews from Harden, particularly regarding the rookie's defense. \"He's very active. . He plays his butt off,\" Harden said. \"He is everywhere on the floor. He did an unbelievable job of pressing me and Chris up the floor, creating some defense to offense.\"\n\nNON-TRADE TALK\n\nFriday night's three-team trade that never happened still was buzzing before the game. The Grizzlies' MarShon Brooks and Wayne Selden were believed to be headed to Phoenix after the trade talks surfaced Friday night.\n\nInstead, confusion over whether the Grizzlies were including MarShon or Dillon Brooks killed the Memphis part of the deal, leading to a lot of talk on Saturday. Memphis coach J.B. Bickerstaff said he apologized to the players. MarShon Brooks still expressed his confusion over the circumstances. His mother learned of the trade near the end of Friday's night's game with Miami, even trying to tell him of the report from her seat in the stands.\n\n\"It's a little awkward, you know. I'm a human,\" Brooks said. \"I've got feelings. I'm not just numb to the situation.\n\n\"I don't know how it happened. I guess (the general managers) were in a group text or something.\"\n\nUP NEXT\n\nRockets: Host Utah on Monday.\n\nGrizzlies: Open a four-game road trip on Monday at Golden State.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994930.8791392
}