{
  "game_id": "0021300107",
  "espn_id": "400488980",
  "date": "Nov 12, 2013",
  "matchup": "MIL @ MIA",
  "headline": "LeBron James' 33 power Heat in rout of Bucks",
  "body": "MIAMI -- The defensive effort was closer to Miami Heat standards.\nLeBron James made it difficult to notice anything but offense.\n\nJames scored 33 points on 13 for 21 shooting -- with an array of post-up moves getting him going early, then a barrage of 3-pointers fueling a big third-quarter push -- and the Heat encountered little trouble on the way to a 118-95 win over the Milwaukee Bucks on Tuesday night.\nJames scored 17 points in the third quarter, his best 12-minute stretch of the season so far and an indicator that a balky back that slowed him in the season's first couple weeks is improving.\n\"It's getting better,\" James said. \"It feels a lot better. Still a little sore ... getting a lot of work put on it so I can get to 100 percent. But it's getting better every day and that's a good thing.\"\nMichael Beasley scored 19 points and Mario Chalmers finished with 15 points and seven assists for the Heat, whose biggest victory margin before Tuesday was a 12-point triumph over Chicago on opening night. Chris Bosh scored 10 for Miami (5-3).\nMiami played without Udonis Haslem (back) and Ray Allen (ill). Shane Battier started in Haslem's place.\n\"It wasn't perfect,\" said Heat coach Erik Spoelstra, whose team was coming off a final-second loss to Boston on Saturday. \"There were still some areas we definitely need to improve on, in terms of the details and discipline. But at least the effort, the effort, the activity was better, the disposition right from the beginning and it carried through once we got into the rotation. Guys were much more focused and bringing that competitive spirit.\"\n\nJohn Henson and Gary Neal each scored 18 points and Giannis Antetokounmpo scored 11 for Milwaukee -- all three of them putting up those points off the Bucks' bench. Caron Butler was the only double-digit-scoring starter for the Bucks (2-4), finishing with 10.\n\"They shot almost 60 percent today so there's no way we can win a game like that,\" Henson said. \"We just have to get better.\"\nThe Heat have scored at least 100 points in each of their eight games so far, extending the team's franchise-record for such a start, but what carried much more significance in the collective eyes of the two-time defending NBA champions were the defensive numbers.\nMilwaukee shot only 35 percent in the first three quarters, before scoring 33 points against an array of what largely was Heat second- and third-teamers in the final 12 minutes.\n\"It's been a long 48 hours in this building, but at least we were able to respond with a better game,\" Spoelstra said. \"And I think our guys felt better looking each other in the eye in the locker room tonight.\"\nJames gave the Heat a shot of adrenalin late in the half, when he and Chalmers teamed up for yet another entry on Miami's alley-oop highlight reel. Dwyane Wade grabbed a deflected ball and got it to Chalmers, who drove down the lane against Milwaukee's Khris Middleton -- then simply lofted the ball straight up, knowing James was trailing the play.\n\nThe result was predictable. James soared past Middleton for the dunk, the Heat took a 56-45 lead into the half, and the league's four-time MVP then took over in the third quarter.\n\"Best player in the world,\" the Bucks' O.J. Mayo said.\nJames 17, Bucks 17 -- that was the score in the third quarter, after the Heat star made 6 of 9 shots in the period, including four 3-pointers. He also drove for one particularly emphatic slam, and the 84-62 lead that Miami carried into the fourth ensured he would get the rest of the night off after logging only 30 minutes.\n\"There were moments were I was very disappointed particularly when people were driving to the basket and we're moving out of their way,\" Bucks coach Larry Drew said. \"I will not tolerate that. That will not be accepted, I don't care who it is. If they're going to the basket, we've got to challenge, we've got to foul then and make them earn it from the free-throw line. We can't be moving out of people's way.\"\nGame notes\nBoxing champion Floyd Mayweather was courtside, and the Brazilian national soccer team was also in attendance. ... Beasley's fourth point was the 5,000th of his NBA career. ... Drew, on how his team is going to be short-handed without Ersan Ilyasova, Luke Ridnour and Larry Sanders: \"There will be some guys who will probably play out of position, but this is what being short-handed is all about.\"",
  "source": "espn_api",
  "crawled_at": 1764992813.246468
}