{
  "game_id": "0021300429",
  "espn_id": "400489302",
  "date": "Dec 27, 2013",
  "matchup": "MIL @ BKN",
  "headline": "Nets rebound from holiday rout, snap four-game skid",
  "body": "NEW YORK -- Jason Kidd tried his 13th lineup this season, and the Brooklyn Nets took advantage of a visit from the NBA's worst team to snap a four-game losing streak.\nBackup point guard Shaun Livingston, who had scored just 14 points in his previous four games, was moved into the starting lineup and led the way with 20 points, Mirza Teletovic scored a career-high 19 off the bench, and Brooklyn rebounded from an embarrassing Christmas Day showing with a 104-93 victory over the Milwaukee Bucks on Friday night.\nHaving Livingston on the floor gave Brooklyn an additional ball handler besides starting point guard Deron Williams. Kidd's move worked from the start, as the Nets had seven assists on 12 field goals in the first quarter.\n\n\"I thought it got us off to a good start. The ball was moving. We were getting great looks,\" said Kidd, who called out his team after a pair of 17-point losses this week. \"We'll see how it goes tomorrow, but I thought those two played extremely well together.\"\nThe Nets had won three straight early this month before spiraling to five losses in their previous six games.\nBrooklyn got the win ahead of a difficult road trip.\nAfter the game, the Nets left for Indiana for a game Saturday night against a team that has beaten them twice this season, including 106-83 on Monday night, leading Kidd to criticize his team. After the loss, the first-year coach said his team looked like it \"was very close to just accepting losing.\"\nThe Nets followed up that performance with a loss against the Chicago Bulls on Christmas Day before a national television audience. Brooklyn's trip will span six days with games at San Antonio on New Year's Eve and at Oklahoma City two days later.\n\"This is about tough as it's going to get as far a three-game road trip,\" said Paul Pierce, who added 13 points for the Nets. \"You got the top three teams in the league.\"\nBrooklyn hit 12 3-pointers, with Teletovic making five and Jason Terry four, and Milwaukee coach Larry Drew didn't like the way his team defended the 3-point line.\n\"We had a couple of breakdowns defensively. We went under the screens on the 3-point shooters, and that was not the game plan,\" Drew said. \"Seemed like every time we tried to make a run or get some stops, we would have a breakdown defensively and Brooklyn would get up a 3.\"\nRookie Giannis Antetokounmpo had 16 points and 10 rebounds for Milwaukee, and Khris Middleton added 15 points and eight boards.\nMilwaukee is off to a 6-23 start mainly due to injuries to key players. Larry Sanders, who had surgery on this right thumb after he tore ligaments in a nightclub fight, played for the first time since early November, scoring 10 points in 22 minutes off the bench. Ersan Ilyasova also returned after missing the previous three games with a sore right ankle and started for the Bucks, finishing with six points and seven rebounds.\n\"I just wanted to go out there and run. You see when you are hurt that you take things for granted sometimes, and I just want to be around my teammates and just play ball,\" Sanders said.\nThe Nets led by as many 23 points in the fourth quarter but the Bucks went on a 24-10 run to get within 97-88 with 3:03 left to play. But after Milwaukee called a timeout, Teletovic hit his third 3-pointer of the quarter to put the Nets ahead 100-88 with 2:03 left, and Brooklyn closed it out from the free throw line.\nKidd used a smaller unit in the team's third game without All-Star center Brook Lopez, who is out for the season with a fractured right foot.\nLivingston started at the 2 guard, and Pierce played power forward and made his second start in his past nine games at forward. Kevin Garnett started at center, and Teletovic, who had started in place of Lopez in the previous three games, went back to his customary reserve role. Alan Anderson also went to the bench.\nGarnett said the team has stuck together during the adverse times.\n\"Well, a real sign of someone and their character is when they're down and how much fight that person has, if not that the team has. That's the first thing I look at when you go through some tough stuff,\" Garnett said.\n\"Look for the finger-pointers and the complainers. We haven't done none of that.\"\nGame notes\nBrooklyn has beaten the Bucks four straight times since sweeping their four-game set in 2007-08. ... Garnett (10 points), Terry (12) and Pierce scored in double figures for the first time this season. They did so 33 times last season with the Boston Celtics. ... Brooklyn has held the opposition to 30.2 percent shooting behind the arc. The Bucks hit 9 of 32 3-point attempts.",
  "source": "espn_api",
  "crawled_at": 1764992783.6628811
}