{
  "game_id": "0021700083",
  "espn_id": "400974834",
  "date": "Oct 28, 2017",
  "matchup": "POR vs. PHX",
  "headline": "Lillard, McCollum help Blazers beat Suns 114-107",
  "body": "PORTLAND, Ore. --  The Portland Trail Blazers didn't expect to see the same Phoenix team they beat by a record score in the season opener.\n\nThey were right.\n\nDamian Lillard scored 25 points, C.J. McCollum had 23 and the Trail Blazers outlasted persistent Phoenix 114-107 on Saturday night.\n\nLillard hit a 10-foot runner with 29 seconds left to give the Blazers (4-2) a four-point lead in a game where they never led by double digits. Jusuf Nurkic had 17 points and nine rebounds, and Pat Connaughton scored 13 points off the bench for Portland.\n\nThe game looked nothing like the matchup in Phoenix on Oct. 18, when the Blazers won 124-76, the largest margin for a season opener in NBA history.\n\nSince then, Phoenix has gone through a coaching change that seems to have given the Suns a spark. Earl Watson was fired following an 0-3 start, replaced on an interim basis by assistant coach Jay Triano. Phoenix came into Portland on a two-game winning streak, and threatened to make it three.\n\n\"It was a tough win. I was really impressed with Phoenix. They really turned their season around in a short amount of time. It's sure a different team than the one we played a week and a half ago,\" Portland coach Terry Stotts said.\n\nDevin Booker hit 11 of 19 shots and scored a season-high 34 points for Phoenix (2-4). T.J. Warren and Alex Len had 12 points apiece for the Suns.\n\n\"I thought we played the right way,\" said Triano, a Portland assistant under Stotts for four years. \"I didn't think we finished our shots down the stretch, but we put ourselves in a position, on the road, to win a game. I give our guys a lot of credit.\"\n\nThe Blazers led 98-91 early in the fourth quarter, but couldn't pull away. Phoenix pulled within a possession on three occasions, and had a chance to tie with less than a minute to play when Marquese Chriss missed a 20-foot jumper. Lillard pounced, split the Phoenix defense and hit a floating runner to put Portland ahead 110-106.\n\n\"We're just not playing well offensively. The ball is moving, we're getting good looks, and when those good looks don't fall, we just try to make things happen. That's when we have the turnovers and the low percentage of shots,\" Lillard said.\n\nPortland led 61-57 at halftime after making eight 3-pointers and shooting 48 percent. Connaughton hit his first four shots off the bench, including three 3-pointers, as the Blazers opened a 36-30 lead early in the second quarter.\n\nLillard and Nurkic, a combined 3 of 15 during the first half, scored 16 of Portland's first 18 points of the second half. Still, the Blazers couldn't shake Phoenix. Booker scored 10 points to keep the Suns within 92-89 heading into the fourth quarter.\n\nTIP-INS\n\nSuns: Rookie guard Mike James graduated from Northeast Portland's Grant High School in 2008. ... This is the fourth time Phoenix has played Portland in October, including twice during preseason. ... Booker has reached double-figure scoring in his past six games against Portland. During this stretch, Booker is averaging 23.7 points per game.\n\nBlazers: Forward Meyers Leonard is out four to six weeks (right lateral ankle sprain). The injury occurred during a practice earlier in the week. ... Lillard reached the 9,000-point milestone during the third quarter. With 402 career games, Lillard is the fastest Blazer to score 9,000 points. ... The Blazers have won five consecutive games over Phoenix, their longest winning streak over the Suns since claiming seven straight wins from November 1987-November 1988. ... Portland outrebounded the Suns 53-46, the fifth time in six games it has won the rebounding battle.\n\nLILLARD STILL SEARCHING\n\nLillard continues to struggle with his shot this season, after making just 7 of 21 against Phoenix. Through six games, Lillard is shooting 37.9 percent (33 of 87), and 30 percent (17 of 56) over his last three games. The distance doesn't seem to matter, as Lillard is shooting 37.5 percent (12 of 32) from 3-point range.\n\n\"I'm bouncing into my shots. I had a couple of shots tonight where I was like, `How did that not go in?' When I had good rhythm into it, I had good legs go into it. It just didn't go into the basket,\" Lillard said.\n\nUP NEXT\n\nSuns: Visit Brooklyn on Tuesday.\n\nBlazers: Host Toronto on Monday.",
  "source": "espn_api",
  "crawled_at": 1764993453.0765162
}