{
  "game_id": "0022300759",
  "espn_id": "401585387",
  "date": "Feb 11, 2024",
  "matchup": "MIA vs. BOS",
  "headline": "Tatum has 26 points and Celtics withstand late rally to beat Heat 110-106",
  "body": "MIAMI -- — Jayson Tatum had 26 points, 10 rebounds and nine assists and the Boston Celtics withstood a late rally to beat the Miami Heat 110-106 on Sunday.\n\n\r\n              Kristaps Porzingis had 25 points, Jaylen Brown had 20 points and Jrue Holiday scored 15 for Boston, which hit 16 of 39 3-point attempts.\n\n\r\n              “Today was fun, we have a lot of history with this team. Last time we came here we smacked them, so we knew it would be a closer game,” Tatum said of Boston’s 33-point win in Miami Jan. 25. “They came to play and we enjoy being part of games like that. Everybody’s being competitive.”\n\n\r\n              The Celtics have won all three matchups with the Heat this season and have won six of the last seven games against them. The loss came in Game 7 of the Eastern Conference finals last season, when Boston forced the deciding game after losing the first three.\n\n\r\n              “Late-game execution, you’ve got to set the table,” Celtics coach Joe Mazzulla said. “I think our guys did that.”\n\n\r\n              Tyler Herro had 22 of his 24 points in the second half, Bam Adebayo scored 22 and Duncan Robinson and Caleb Martin finished with 15 points each for the Heat — who were short-handed to start the game and even more so by the end.\n\n\r\n              The Heat were without leading scorer Jimmy Butler, who was granted a leave of absence because of the death of a family member.\n\n\r\n              Miami lost Terry Rozier and Josh Richardson to injuries. Rozier, who finished with 13 points, landed awkwardly on his right leg after driving to the basket midway through the third quarter, clearly favoring his knee. Both players will have MRI exams on Monday, coach Erik Spoelstra said.\n\n\r\n              “It’s tough to see guys like that go down,” Robinson said. “And then Jimmy dealing with what he’s dealing with is unfortunate, to put it lightly.”\n\n\r\n              Richardson exited in the second quarter because of a right shoulder injury. He slumped to the floor in pain after his unsuccessful attempt to strip Tatum of the ball.\n\n\r\n              “I felt my shoulder pop out on the floor and then it popped back in laying on the ground, so thank goodness for that,” Richardson said. “I’ll know more tomorrow.”\n\n\r\n              Robinson also favored his left shoulder after Brown pushed him off into the stands when both tangled for position early in the fourth quarter. Brown and Robinson exchanged words and Brown was assessed a flagrant 1 foul while Robinson got called for a personal foul.\n\n\r\n              “I just thought it was a dirty play, to be honest with you. ... Just thought it was dangerous, unnecessary and excessive,” Robinson said.\n\n\r\n              Brown considered it two teams playing hard.\n\n\r\n              “There was no issue from me. I think he knew exactly what he was trying to do, trying to get tangled up,” Brown said. \"(The official) called the foul but he was still trying to hang on.”\n\n\r\n              Miami rallied from a 15-point deficit in the third quarter and cut it to 106-104 on Herro’s 3-pointer with 1:49 remaining. But Porzingis and Tatum each converted two free throws to secure the win.\n\n\r\n              “I thought our group showed a tremendous amount of grit in that second half,” Spoelstra said. “There were a lot of things that weren’t necessarily going our way, including the injuries. To really fight and claw back and get this game on the ropes, it’s a credit to how hard guys were playing.”\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Visit Brooklyn on Tuesday night.\n\n\r\n              Heat: Begin a six-game road stretch at Milwaukee on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996692.41577
}