{
  "game_id": "0022400325",
  "espn_id": "401704891",
  "date": "Dec 05, 2024",
  "matchup": "CLE vs. DEN",
  "headline": "Donovan Mitchell scores 28 as Cavaliers improve to 13-1 at home by beating Jokic and Nuggets 126-114",
  "body": "CLEVELAND -- — Donovan Mitchell scored 28 points, Darius Garland added 24 and the Cleveland Cavaliers improved to 13-1 at home with a 126-114 victory Thursday night over the Denver Nuggets, who wasted a triple-double by Nikola Jokic.\n\n\r\n              The Cavs made a season-high 22 3-pointers and extended their streak of making at least 10 3s to a club record 28 games dating to last season.\n\n\r\n              Cleveland outscored Denver 66-18 from behind the arc.\n\n\r\n              Jokic had 27 points, 20 rebounds and 11 assists, giving him his 139th career triple-double — one more than Hall of Famer Magic Johnson. Jokic only trails Oscar Robertson (181) and teammate Russell Westbrook (200) on the career list.\n\n\r\n              Caris LeVert added 21 points off the bench, Evan Mobley scored 20 and Jarrett Allen had 15 rebounds for Cleveland, which improved to 5-0 against Western Conference teams.\n\n\r\n              Michael Porter Jr. scored 24 and Jamal Murray 19 for the Nuggets.\n\n\r\n              Takeaways\r\n              Nuggets: Didn't do nearly enough on the defensive perimeter to slow down the Cavs, who had nine 3-pointers in the first quarter while opening a 12-point lead.\n\n\r\n              Cavaliers: Displayed their offensive versatility with a strong deep shooting game and inside muscle to offset the fabulous Jokic.\n\n\r\n              Key moment\r\n              The Nuggets were still within nine in the final three minutes before Mitchell and LeVert drained consecutive back-breaking 3s. ... Also, a fan won $10,000 for making a halfcourt shot between the third and fourth quarters.\n\n\r\n              Key stat\r\n              Now in his 10th season, Jokic is averaging a career-high 37.6 minutes per game. Coach Michael Malone acknowledged the challenge in trying to win games while also resting the three-time league MVP. “We've all got to make sure we don't run him into the ground,” Malone said.\n\n\r\n              Up Next\r\n              The Nuggets visit the two-win Wizards on Saturday. The Cavaliers have back-to-back weekend games against Charlotte and Miami. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998322.775486
}