{
  "game_id": "0021700085",
  "espn_id": "400974836",
  "date": "Oct 29, 2017",
  "matchup": "MIL @ ATL",
  "headline": "Antetokounmpo scores 33 as Bucks breeze past Hawks",
  "body": "ATLANTA --  Giannis Antetokounmpo was wary of a mid-afternoon tip-off, concerned about a sluggish start for the Milwaukee Bucks.\n\n\"Usually in games like this, early game, you come out a little bit lazy, and we've done that in the past,\" he said. \"I wanted to set a good tone.\"\n\nTook care of that practically by himself.\n\nAntetokounmpo scored 33 points, Khris Middleton had 27 and the Bucks cruised to a 117-106 victory over the outmanned Atlanta Hawks on Sunday.\n\nAntetokounmpo also had 11 rebounds and five assists. He went 14 for 21 from the field, scoring from all over the floor while helping Milwaukee to its third win in its last four games.\n\nHe began the game with 175 points, 53 rebounds and 28 assists, the best start by a player in NBA history through his first five games.\n\n\"We came out, and Giannis was really aggressive,\" Bucks guard Malcolm Brogdon said. \"He got us off to a good start offensively and on the defensive end. We followed his lead.\"\n\nDennis Schroder finished with 21 points and Taurean Prince had 17 for Atlanta, which has lost six straight. The Hawks have no inside experience or size this season after letting Paul Millsap and Al Horford leave as free agents and trading Dwight Howard to Charlotte.\n\nAtlanta was outrebounded by 12, never led and trailed by as much as 23 in the second and third.\n\n\"They came out with energy. We didn't match it in the first five minutes,\" Schroder said. \"In the second half we didn't a better job defending Antetokounmpo, but we've got to play for 48 minutes and be better.\"\n\nAntetokounmpo, the NBA's scoring leader with a 34.7 average, had 13 of Milwaukee's first 20 points. Coach Jason Kidd rested him until midway through the second quarter, when his hard dunk made it 59-41.\n\nThe Bucks hit nine 3-pointers in the first half, including four by Rashad Vaughn on six attempts. They finished with season highs in points and 3s (13).\n\nMilwaukee had such command of the game that Kidd didn't call a timeout until the Hawks trimmed the lead to 11 at the 7:42 mark of the fourth. John Henson hit a hook shot on Milwaukee's next possession to make it 98-85.\n\nThe Bucks dominated on both ends of the floor.\n\n\"Their defense is pretty insane,\" Schroder said. \"After the pick-and-roll, you try and pass it to the roller. It's tough to get it to him.\"\n\nTIP-INS\n\nBucks: Kidd said C-F Greg Monroe is expected to miss at least two weeks with a left calf strain. Monroe was injured in Friday's 96-89 home loss to Boston. Kidd liked how Vaughn handled the extra minutes in Monroe's spot, finishing with 12 points and three rebounds in 21 minutes. Vaughn sat on the bench the previous three games. \"It just shows you how mature he has been in his work ethic,\" Kidd said. \"He's ready to go. He answered the call today.\"\n\nHawks: Mike Muscala started in place of F Ersan Ilyasova, who has missed three of the last four games with a left knee strain. Coach Mike Budenholzer wouldn't speculate how long the team expects him to be out. Muscala had 10 points and two rebounds in 29 minutes.\n\nUP NEXT\n\nBucks: Host Oklahoma City on Tuesday.\n\nHawks: Visit Philadelphia on Wednesday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993058.266855
}