{
  "game_id": "0021500534",
  "espn_id": "400828421",
  "date": "Jan 06, 2016",
  "matchup": "OKC vs. MEM",
  "headline": "Kevin Durant scores 26 in Thunder rout after one-game absence",
  "body": "OKLAHOMA CITY -- Kevin Durant started slow, then took charge in his return.\nOklahoma City's star forward had 26 points and a season-high 17 rebounds after missing the previous game with a sprained right big toe, and the Thunder beat the Memphis Grizzlies 112-94 on Wednesday night.\nDurant, who began the day as the NBA's No. 3 scorer, shot 2-for-10 from the field in the first half, but broke loose for 17 points in the second half on 7-for-8 shooting.\n\"I missed some good shots in the first half,\" he said. \"I came back in the second half and I told myself every shot has to be -- just -- I have to focus on every shot now because I missed so many early on. It could have been a 2-for-17 night for me, so I tried to turn it into something good in the second half.\"\n\nHe played 33 minutes and appeared to have no problems with mobility.\n\"Our training staff did a great job the last few days,\" he said. \"I'm just happy to be back playing.\"\nRussell Westbrook added 20 points, seven rebounds and seven assists for the Thunder, who bounced back from Monday's loss to Sacramento without Durant.\nGrizzlies point guard Mike Conley sat out with a sore left Achilles. Memphis coach Dave Joerger said before the game he didn't know how long Conley, the team's No. 2 scorer, would be out.\nCourtney Lee, who started at point guard in Conley's place, suffered a hip injury and only played three minutes in the second half.\n\"I was proud of our guys,\" Joerger said. \"We played hard and we kept competing.\"\nMario Chalmers led the Grizzlies with 23 points, and had season highs of nine assists and eight rebounds. Matt Barnes scored 13 points and Zach Randolph added 12 for Memphis, which shot just 39 percent. Marc Gasol, the team's leading scorer for the season, finished with eight points on 2-for-11 shooting.\nThe Thunder led 56-36 at halftime, the fewest points they have allowed in a first half this season. Oklahoma City held Memphis to 29.8 percent shooting before the break. Westbrook had 16 points, six assists and five rebounds in the first two quarters.\nDurant scored 13 points on 5-for-5 shooting in the third to keep the Thunder in control. Memphis cut Oklahoma City's lead to 15 before Durant hit a 3-pointer and scored on a putback to push the advantage back to 20.\nDurant's rebound total was one short of his career high.\n\"Our bigs did a good job of boxing out, and it makes it a little easier for guys like me, Russell, the wing players to go get rebounds when the bigs do all the work,\" Durant said. \"I just try to get down there as much as I can and grab all those long rebounds and get out and get some easy points.\"\nSHAKEN UP\nSeveral earthquakes could be felt throughout Oklahoma during game. The two strongest, centered in the northwest part of the state, could be felt in the upper levels of the arena within a minute of each other late in the third quarter.\nQUOTABLE\nGasol on the Grizzlies' offensive struggles: \"It's hard to sometimes figure out what we try to accomplish offensively, what our goal is in every set. We're not very disciplined. I don't know why, but I know it ended up with me. I've got to be more assertive. I've got to be a playmaker.\nSTAT LINES\nMemphis' bench outscored the starters 55-39. The starters shot a combined 14-for-45 from the field, while the reserves made 21 of 45.\nTIP-INS\nGrizzlies: Barnes played his second game since a two-game suspension for his part in a physical altercation with Knicks coach Derek Fisher. ... Vince Carter, 38, threw down a dunk in the final minute and drew a nice cheer from the crowd.\nThunder: Wore their sunset orange alternate jerseys. ... Bench shot a combined 8 for 10 from the field in the first half.\nUP NEXT\nThe Grizzlies host the Nuggets on Friday.\nThe Thunder visit the Lakers on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994179.301048
}