{
  "game_id": "0022200121",
  "espn_id": "401468276",
  "date": "Nov 04, 2022",
  "matchup": "MIA @ IND",
  "headline": "Indiana Pacers hold on to beat Miami Heat 101-99",
  "body": "INDIANAPOLIS -- — Buddy Hield scored 25 points, Bennedict Mathurin had 23 points and Tyrese Haliburton scored 22 to lead the Indiana Pacers to a 101-99 victory over the Miami Heat on Friday night.\n\n\r\n              Haliburton added nine assists and nine rebounds, just missing a triple double.\n\n\r\n              Tyler Herro had a chance to with the game for the Heat with 1.3 seconds left, but his 3-pointer missed the mark. He led the heat with 29 points.\n\n\r\n              Bam Adebayo scored 18 points and Max Strus added 17 points for the Heat. Miami played its second-consecutive game without leading scorer Jimmy Butler, who was out with hip tightness.\n\n\r\n              Pacers coach Rick Carlisle praised rookie Andrew Nembhard’s defense on Herro's potential game-winning shot.\n\n\r\n              “When you put a rookie on Tyler Herro on the last play of the game with the idea the ball is going to go to him and he makes that kind of defensive stand, makes him hit a falling-away difficult 3-point shot, that’s strong,” Carlisle said.\n\n\r\n              The Heat tied the game at 94-all on a 3-pointer by Gabe Vincent with 5:35 remaining. Hield’s 3-pointer put the Pacers ahead 97-94 with 3:22 left.\n\n\r\n              Leading 100-97, Pacers center Myles Turner was called for defensive goaltending with 10 seconds left, but the call was overturned. Turner finished with 16 points, seven rebounds and three blocked shots for the Pacers.\n\n\r\n              Indiana shot 46.3% overall while Miami was held to 38.3%.\n\n\r\n              “We made some slight defensive adjustments,” Carlisle said. “But really it was all about chasing the shooters around.”\n\n\r\n              The Pacers, who trailed 29-28 after the first quarter, shot 52% in the second quarter en route to a 62-50 halftime lead. Hield scored 13 points in the second quarter, hitting all five shots. Indiana held Miami to 30% in the second quarter.\n\n\r\n              Miami coach Erik Spoelstra said the team played better defensively in the second half.\n\n\r\n              “We’re getting better,” he said. “We were down 10 and we were able to grind it into a possession game. We just weren’t able to get it done.”\n\n\r\n              Pacers guard Chris Duarte needed help getting off the floor with 7:12 left in the first quarter after rolling his ankle on Kyle Lowry’s foot. Duarte did not return with the left ankle sprain.\n\n\r\n              TIP-INS\n\n\r\n              Heat: Nikola Jovic hurt his nose during one-on-one work Thursday. Coach Erik Spoelstra said the rookie didn’t make the trip because there was concern about flying with the nasal contusion. ... Adebayo was listed as questionable with a knee injury but was able to play.\n\n\r\n              Pacers: Aaron Nesmith missed his third consecutive game with a right foot injury. … Hield has scored 20 points or more in four of the last five games.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Portland on Monday.\n\n\r\n              Pacers: Host New Orleans in second of four-game home stand on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995198.871701
}