{
  "game_id": "401810050",
  "espn_id": "401810050",
  "date": "Nov 09, 2025",
  "matchup": "PHI vs DET",
  "headline": "Cunningham scores 26 points to lead Pistons past 76ers 111-108 for 6th straight win",
  "body": "PHILADELPHIA -- — Cade Cunningham made two clutch baskets down the stretch and finished with 26 points, Jalen Duren had 21 points and 16 rebounds and the Eastern Conference-leading Detroit Pistons extended their winning streak to six games with a 111-108 victory over the Philadelphia 76ers on Sunday night.\n\n\r\n              Tyrese Maxey scored 33 points for Philadelphia, which played without Joel Embiid. Andre Drummond, starting for Embiid, had 17 points and 12 rebounds for the 76ers.\n\n\r\n              The teams play again on Friday in Detroit. \n\n\r\n              Embiid did not play in the second game of a back-to-back after scoring 29 points in Philadelphia’s 130-120 win over Toronto on Saturday night. Embiid has played in six of 10 games as he continues to recover from offseason left knee surgery. He is averaging 19.7 points and 5.5 rebounds in 23.3 minutes.\n\n\r\n              Detroit led by as many as five points in the fourth quarter but trailed 101-100 with 4:54 remaining after a Maxey 3-pointer. \n\n\r\n              Cunningham capped a 9-3 Detroit run with a dunk over Drummond and then converted the free throw after being fouled to give the Pistons a 109-104 lead with 1:51 left. \n\n\r\n              After four straight points from Maxey pulled the 76ers within a point, Cunningham drained a fadeaway jumper from just in front of the free-throw line with 16.9 seconds to play to put Detroit ahead by three. After a 76ers timeout, Maxey managed to get off a last-second 3-pointer that rimmed out.\n\n\r\n              Maxey, who got “M-V-P! M-V-P!” chants from the 76ers crowd late in the fourth quarter, is averaging 33.2 points.\n\n\r\n              Up next\r\n              Pistons: Host Washington on Monday night.\n\n\r\n              76ers: Host Boston on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042592.8057249
}