{
  "game_id": "0022200061",
  "espn_id": "401468216",
  "date": "Oct 26, 2022",
  "matchup": "CHI vs. IND",
  "headline": "LaVine's 28 points enable Bulls to hold off Pacers, 124-109",
  "body": "CHICAGO -- — Zach LaVine scored 28 points, including a key 3-pointer early in the fourth quarter that sparked the Bulls to a 124-109 victory over the Indiana Pacers on Wednesday night.\n\n\r\n              The Bulls led by as many as 24 points in the second half before Pacers guard Buddy Hield hit three 3-pointers that cut the deficit to 95-91 late in the third quarter. \n\n\r\n              But Indiana forward Terry Taylor was assessed with a clear path foul, allowing LaVine to sink two free throws and the Bulls to retain possession. Andre Drummond converted a dunk, and Javonte Green earned a steal near midcourt and finished with a dunk to enable the Bulls to regain a double-digit lead.\n\n\r\n              “Offensively, we're going to be fine,” LaVine said. “We're going to find our way because we have so many top offensive players. Even if it's not going well, one of us will be able to get charged up.”\n\n\r\n              DeMar DeRozan, attempting to become the 50th player in NBA history to reach the 20,000 mark, moved to within seven of the milestone with a 17-point performance. DeRozan entered the game with a 26.8 scoring average, missed his first field goal attempt nearly eight minutes into the first quarter and didn't score until converting two free throws in the second.\n\n\r\n              “It wasn't one of those things where I woke up in the morning and said I had to do it,” DeRozan said.\n\n\r\n              The Bulls scored a season-high 38 points in the first quarter. Green's dunk with six minutes left in the quarter gave the Bulls a 23-13 lead that they gradually expanded and sustained until late in the third quarter.\n\n\r\n              “Our big challenge is to start games the right way,” Indiana coach Rick Carlisle said.\n\n\r\n              Pacers center Myles Turner made his season debut with less than two minutes left in the first quarter and immediately blocked a shot by LaVine. Rick Carlisle, mindful that Turner was returning from an ankle injury, monitored his minutes.\n\n\r\n              But there was little resistance inside as the Bulls scored 30 of their 76 first-half points in the paint. They distributed 19 of their season-high 34 assists in the first two quarters.\n\n\r\n              Reserve guard Goran Dragic, who chipped in with 13 points and five assists, provided a spark with a lob pass that Drummond finished with a dunk less than two minutes into the second quarter.\n\n\r\n              DeRozan will get his next chance to reach a milestone Friday at San Antonio, where he played for three seasons before joining the Bulls in 2021.\n\n\r\n              “The way the fans embraced me, it was unbelievable,” DeRozan said of his time with the Spurs. \n\n\r\n              Hield sank seven 3-pointers and finished with a team-high 24 points.\n\n\r\n              TIP-INS\n\n\r\n              Pacers: C Daniel Theis (right knee soreness) returned to the court recently and has been on a “gradual ramp-up,” said Carlisle, adding he'll be available at some point soon. Theis felt discomfort while training for his native Germany for the European championships, Carlisle said. \n\n\r\n              Bulls: Wednesday was the four-week mark since G Lonzo Ball (left knee) underwent surgery, but there was no. update provided. “I think the biggest thing is through the surgery the incision healing and continue to progress,” coach Billy Donovan said. “I just don't know how far along he is in that process.” \n\n\r\n              UP NEXT\n\n\r\n              Pacers: Visit Washington on Friday \n\n\r\n              Bulls: Visit San Antonio on Friday",
  "source": "espn_api",
  "crawled_at": 1764994520.677053
}