{
  "game_id": "0022400218",
  "espn_id": "401704784",
  "date": "Nov 13, 2024",
  "matchup": "BKN vs. BOS",
  "headline": "Tatum scores 36 points, the Celtics pour it on in 2nd half to beat the Nets 139-114",
  "body": "NEW YORK -- — Jayson Tatum had 36 points, 10 assists and eight rebounds, Jaylen Brown added 24 points and 12 rebounds and the Boston Celtics beat the Brooklyn Nets 139-114 on Wednesday night.\n\n\r\n              Payton Pritchard had 23 points, eight assists and six rebounds for the Celtics, who quickly and emphatically bounced back with their highest points total of the season after a surprising 117-116 home loss to Atlanta on Tuesday night.\n\n\r\n              Boston fell into a 13-point hole in the first quarter of this one before the NBA champions snapped themselves back into top form and turned the game into a rout with a 74-point second half.\n\n\r\n              Ziaire Williams scored a season-high 23 points for the Nets. \n\n\r\n              Takeaways\r\n              Celtics: The home loss to an Atlanta team that played without star guard Trae Young was puzzling. But when the Celtics play like they did in the third quarter, when they rang up 38 points and were 7 for 11 behind the arc, nights like those will be rare. \n\n\r\n              Nets: The Nets should like what they're seeing from Williams, who made his second straight start with Ben Simmons (left calf tightness) and Dorian Finney-Smith (sprained left ankle) sidelined. They added the No. 10 pick in the 2021 draft after he spent his first three seasons in Memphis. \n\n\r\n              Key moment\r\n              Derrick White, who scored a season-high 31 points Tuesday, was in foul trouble and scoreless in the first half Wednesday. He finally got on the board with a 3-pointer early in the third quarter, quickly sparking the Celtics to a 13-2 spurt that pushed a four-point lead to 85-70.\n\n\r\n              Key stat\r\n              The Celtics have won 12 of the last 13 meetings overall against the Nets and seven straight in Brooklyn, where they haven't lost since the 2020-21 season.\n\n\r\n              Up next\r\n              The Celtics are off until hosting Toronto on Saturday night. The Nets head across town to visit the Knicks on Friday and Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998000.5614378
}