{
  "game_id": "0022400962",
  "espn_id": "401705528",
  "date": "Mar 14, 2025",
  "matchup": "MEM vs. CLE",
  "headline": "Mobley helps Cavs win franchise-record 16th straight, beat Grizzlies 133-124",
  "body": "MEMPHIS, Tenn. -- — Evan Mobley had 22 points and 11 rebounds, Darius Garland added 20 points and nine assists and the Cleveland Cavaliers recorded a franchise-record 16th straight victory with a 133-124 win over the Memphis Grizzlies on Friday night.\n\n\r\n              De'Andre Hunter scored 18 points, while Jarrett Allen had 16. The win eclipsed Cleveland's previous standard for consecutive wins with 15 to open this season. \n\n\r\n              Ja Morant led Memphis with a season-high 44 points to go with eight rebounds and seven assists. Jaren Jackson Jr. and Brandon Clarke finished with 13 points each.\n\n\r\n              Jackson returned to the lineup against Cleveland after missing the previous five games with a left ankle sprain. Meanwhile, the Cavaliers played their second game without Donovan Mitchell due to left groin soreness.\n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland has a solid hold on the top spot in the Eastern Conference. It also was Cleveland’s 26th road win, tying for the second-best in Cavaliers single-season history with the 2009-10 team.\n\n\r\n              Grizzlies: Memphis struggled shooting most of the night, and only a rally with the reserves made the margin respectable.\n\n\r\n              Key moment\r\n              Cleveland opened the second quarter on a 23-9 rally capped by a Morant turnover that led to a breakaway by Javonte Green. Green missed the shot when he was fouled by Jackson — a foul ruled a Flagrant 1. The ensuing free throws took the Cleveland lead to 56-39.\n\n\r\n              Key stat\r\n              Cleveland shot 53% in the first half, including 12 of 29 from outside the arc. Memphis managed only 4 of 17 from 3-point range in the first two quarters, leaving the Cavaliers with a 75-58 lead at the half.\n\n\r\n              Up next\r\n              Cleveland plays the Magic at home on Sunday. The Grizzlies play host to the Heat on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997596.049514
}