{
  "game_id": "0021700129",
  "espn_id": "400974880",
  "date": "Nov 03, 2017",
  "matchup": "OKC vs. BOS",
  "headline": "Irving's big 2nd half leads Celtics past Thunder 101-94",
  "body": "OKLAHOMA CITY --  Once Kyrie Irving got it going, not even Oklahoma City's star-studded roster could withstand the surge.\n\nIrving scored 22 of his 25 points in the second half and the Boston Celtics rallied from 18 down to beat the Thunder 101-94 on Friday night for their seventh straight victory.\n\n\"We battled,\" Irving said. \"We took away some things they were feeling comfortable with in the first half, picked up our pace and our defensive pressure and things started going our way, and then we just kept battling to the end.\"\n\nAl Horford scored 17 of his 20 points after halftime and Jaylen Brown added 10 points and 12 rebounds for the Celtics. Boston has allowed 94 or fewer points in every game during its winning streak.\n\nPaul George had 25 points and 10 rebounds, and Russell Westbrook added 19 points and 11 assists for the Thunder. Carmelo Anthony had 10 points and 14 rebounds but shot just 3 of 17.\n\n\"The first half, we played extremely well defensively,\" Anthony said. \"The Celtics kept fighting. They stuck with it. I think we took our foot off the gas a little bit. We didn't put a full game together tonight. It showed that it was just a tale of two halves. One great half and one not-so-great half.\"\n\nIn a play that seemingly summarized the first half, Irving drove hard to the hoop in the closing seconds of the second quarter and went for a layup before Andre Roberson emphatically swatted it to the ground as time expired with the Thunder leading 55-37. Irving was 1 of 9 from the field before the break.\n\n\"It was ugly,\" Irving said. \"It was an ugly first half. We don't want to get in the habit of that, getting down by 18, understanding that against a good team like that, it could turn into 30 in a matter of an instant.\"\n\nBoston chipped away at Oklahoma City's lead throughout the third quarter and cut it to a point. Irving had nine points in the period to help the Celtics shave their deficit to 71-67.\n\n\"I think tonight in that third quarter coming out we had some breakdowns defensively, which led to them getting momentum on their side,\" Anthony said. \"We just couldn't get the momentum back once they got it. That was just kind of a mental lapse we had coming out of halftime.\"\n\nA 3-pointer by Semi Ojeleye with just under six minutes to play tied it at 79, and a 3-pointer by Horford put the Celtics ahead 82-79.\n\nIrving made a 3 and was fouled by Westbrook. Irving missed the free throw, but came up with the rebound and made a layup to put the Celtics up 87-81 with 4:13 to play.\n\n\"Just getting off the screen and being aggressive,\" he said. \"Thankful that it (the 3-pointer) went in. Missed my free throw but getting the rebound, I knew Russ had five fouls, so just trying to attack him on that layup kind of gave us the separation we needed to feel comfortable.\"\n\nTIP-INS\n\nCeltics: Irving went scoreless with no assists in the first quarter. His first points of the game came with about two minutes left in the first half. ... Boston shot just 30 percent in the first quarter.\n\nThunder: Westbrook was called for a Flagrant 1 foul in the first quarter against Brown. ... George scored 10 points in the first period. ... Oklahoma City was outscored 30-16 in the third.\n\nSTAT LINE\n\nAnthony shot 1 for 12 in the second half. He entered as the Thunder's leading scorer at 22.9 points per game.\n\n\"Those nights happen,\" Anthony said. \"It makes it even worse when you lose a game.\"\n\nQUOTABLE\n\nIrving: \"I really didn't make any adjustments. The first four shots I took, they were pretty good looks. Just getting used to the switching. They were loading up on the weak side when me and Al were coming off our pick-and-rolls. It just took a matter of time for us just to settle in.\"\n\nUP NEXT\n\nCeltics: At the surprising Orlando Magic on Sunday. The teams entered Friday tied for the best record in the Eastern Conference.\n\nThunder: At the Portland Trail Blazers on Sunday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball .",
  "source": "espn_api",
  "crawled_at": 1764993142.680555
}