{
  "game_id": "0022400131",
  "espn_id": "401704697",
  "date": "Oct 31, 2024",
  "matchup": "LAC vs. PHX",
  "headline": "Booker and Durant lead Suns to 125-1119 comeback win over Clippers",
  "body": "INGLEWOOD, Calif. -- — Devin Booker scored 40 points, Kevin Durant added 18, and the Phoenix Suns rallied from a 21-point deficit to beat the Los Angeles Clippers 125-119 on Thursday night.\n\n\r\n              Booker made a corner 3-pointer to put Phoenix ahead 108-105 with 5:15 remaining as the Suns scored 73 points in the second half to take their second win in eight days at the Clippers’ new arena.\n\n\r\n              Booker and Durant got going in the third to get the Suns back in it, combining for 20 points. Royce O'Neale, who finished with 21 points, and Ryan Dunn, who had 16, also had some timely long-distance shots after the break. \n\n\r\n              James Harden had 25 points, 10 rebounds and 13 assists, but Los Angeles faltered again one night after giving away a late lead in a one-point loss at Portland.\n\n\r\n              Takeaways\r\n              Suns: Bradley Beal did not play because of an elbow injury, but Phoenix was able to overcome the absence of its third star with a dominant second half.\n\n\r\n              Clippers: After being good at limiting turnovers and moving the ball around in the first half, Los Angeles got stagnant and sloppy to give away a winnable game.\n\n\r\n              Key moment\r\n              Harden fumbled away the ball in the paint, allowing Durant to find Booker for the go-ahead bucket. It was one of eight Clippers turnovers in the second half. \n\n\r\n              Key stat\r\n              After being outscored 11-0 in the first quarter, the Suns had a 21-5 edge in fast-break points the rest of the way. \n\n\r\n              Up next\r\n              The Suns host Portland on Saturday, and the Clippers host Oklahoma City.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998059.408948
}