{
  "game_id": "0022300799",
  "espn_id": "401585427",
  "date": "Feb 22, 2024",
  "matchup": "LAC @ OKC",
  "headline": "Shai Gilgeous-Alexander scores 31 points, Thunder beat Clippers 129-107",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 31 points and the Oklahoma City Thunder beat the Los Angeles Clippers 129-107 on Thursday night in a matchup of Western Conference contenders.\n\n\r\n              Lu Dort added 19 points, Jalen Williams had 18 and Chet Holmgren 17 for Oklahoma City. The Thunder shot 55.6% from the field, made 17 3-pointers and blocked 12 shots.\n\n\r\n              “We came out with a great edge,” Oklahoma City coach Mark Daigneault said. “Certainly slipped up a couple of times during the game but course-corrected very well and played a pretty complete 48 (minutes).”\n\n\r\n              The Thunder won the season series with Los Angeles and improved to 38-17 to move within a game of Western Conference-leading Minnesota.\n\n\r\n              Gordon Hayward played 14 minutes in his first game with the Thunder since being acquired in a trade with Charlotte. He missed both of his shots and had four rebounds.\n\n\r\n              Kawhi Leonard scored 20 points and Nolan Powell added 19 points for Los Angeles, which converted just 12 of 32 shots from beyond the arc. The third-place Clippers fell to 36-18.\n\n\r\n              “We had a lot of possessions and plays where we got in (the paint) and we didn’t make the right play, so they were able to get blocked shots and turnovers,” Los Angeles coach Tyronn Lue said. “For the most part, I thought we did a good job. I thought we executed the game plan offensively. Defensively, we could have been a lot better.”\n\n\r\n              Both teams were playing for the first time since the All-Star break. The game featured the return to Oklahoma City of former Thunders players Paul George, James Harden and Russell Westbrook.\n\n\r\n              Gilgeous-Alexander, the NBA’s second-leading scorer, had 19 points on 7-for-10 shooting to help the Thunder take a 61-59 lead at halftime. Powell had 14 off the bench to keep the Clippers close.\n\n\r\n              Oklahoma City took control early in the second half behind nine points from Isaiah Joe, who started the third quarter in place of Josh Giddey. Joe’s third dunk of the quarter put the Thunder up 81-74 with 5:59 left.\n\n\r\n              “I thought we were extremely connected, we were communicating well,” said Holmgren, who had seven rebounds and three blocked shots. “On top of that we had a lot of effort, there were a lot of effort plays, especially close to the rim.”\n\n\r\n              Giddey 3-pointer gave the Thunder a 91-79 advantage and the lead grew to 96-79 on a jumper by Gilgeous-Alexander with 35.2 seconds left in the quarter.\n\n\r\n              The Clippers cut it to 111-99 on Powell’s jumper with 6:08 left in the fourth quarter, but Oklahoma City outscored Los Angeles 18-8 the rest of the way.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Memphis on Friday night. \n\n\r\n              Thunder: Host Washington on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996543.85437
}