{
  "game_id": "0022200215",
  "espn_id": "401468370",
  "date": "Nov 16, 2022",
  "matchup": "MIA @ TOR",
  "headline": "Anunoby has season-high 32 points, Raptors beat Heat 112-104",
  "body": "TORONTO -- — O.G. Anunoby scored a season-high 32 points and matched his season high with 10 rebounds and the Toronto Raptors used a 21-0 run in the third quarter to beat Miami 112-104 on Wednesday night, ending the Heat’s winning streak at three.\n\n\r\n              Fred VanVleet returned from illness to score 23 points to help Toronto extend its home winning streak to four. The Raptors are 6-1 at home this season.\n\n\r\n              Anunoby shot 13 for 18, matching his career high for field goals.\n\n\r\n              “He wanted the ball, he controlled it, he made moves, he made pass-outs, all the stuff you have to do when you are the go-to guy,” Raptors coach Nick Nurse said.\n\n\r\n              Toronto’s Scottie Barnes added 19 points, Chris Boucher had 15 and Thad Young 12.\n\n\r\n              Miami’s Max Strus scored 20 points and Kyle Lowry had 19 against his former team. Gabe Vincent scored 16 points, Caleb Martin had 14, and Jimmy Butler and Nikola Jovic each had 11.\n\n\r\n              Toronto outrebounded Miami 42-23, including a 16-4 edge on the offensive glass, and outscored the Heat 26-5 in second-chance points.\n\n\r\n              “That’s really the game,” Lowry said. “We played hard. We just missed some shots and offensive rebounds killed us.”\n\n\r\n              Miami made nine turnovers in the third quarter. They finished with 23, leading to 29 points for Toronto.\n\n\r\n              “That’s their identity, that’s what they do,” Heat coach Erik Spoelstra said. “If you want to get a win in this building, you have to overcome that.”\n\n\r\n              Butler shot 4 for 8, matching his fewest field goal attempts of the season.\n\n\r\n              Butler missed a layup that would have tied it at 100 with 4:14 left, and Barnes scored at the other end to put Toronto up by four.\n\n\r\n              Boucher’s dunk with 2:03 left in the fourth quarter put the Raptors up 107-102, and he added a 3-pointer on Toronto’s next possession.\n\n\r\n              Miami’s Bam Adebayo sat for the first time this season because of a bruised left knee. Spoelstra said Adebayo is day-to-day.\n\n\r\n              The Heat also were without guard Victor Oladipo (left knee), guard Tyler Herro (left ankle), forward Udonis Haslem (personal), and center Omer Yurtseven (left ankle).\n\n\r\n              VanVleet returned after missing the past two games with a non-COVID illness, and said he’s still not fully recovered.\n\n\r\n              “It took all of about three minutes before I realized I wasn’t a hundred percent yet,” VanVleet said.\n\n\r\n              Toronto guard Gary Trent Jr. sat for the second straight game because of a sore right hip and forward Otto Porter Jr. was sidelined because of a dislocated toe on his left foot.\n\n\r\n              The Raptors remained without forwards Pascal Siakam (strained right adductor) and Precious Achiuwa (right ankle).\n\n\r\n              Toronto-born guard Dalano Banton made his first career home start for the Raptors but left in the third because of a sprained left ankle.\n\n\r\n              LOVE-HATE RELATIONSHIP\n\n\r\n              Lowry said he has mixed feelings about facing off against VanVleet, his friend and former teammate.\n\n\r\n              “I hate playing against him but I love playing against him at the same time,” Lowry said.\n\n\r\n              TIP-INS\n\n\r\n              Heat: Butler attempted two field goals in the first half. … Spoelstra said Oladipo is not expected to play on this four-game road trip, which continues in Washington Friday.\n\n\r\n              Raptors: VanVleet missed his first six field goal attempts but went 7 for 15 the rest of the way. … Anunoby’s career high is 36 points, set at New York on Nov. 1, 2021.\n\n\r\n              UP NEXT\n\n\r\n              Heat: At Washington on Friday night.\n\n\r\n              Raptors: At Atlanta on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993985.011672
}