{
  "game_id": "0021500907",
  "espn_id": "400828794",
  "date": "Mar 02, 2016",
  "matchup": "OKC @ LAC",
  "headline": "Clippers end win with 26-5 run as Thunder squander 22-point lead",
  "body": "LOS ANGELES -- Wednesday night ended with the Oklahoma City Thunder players and coaching staff shaking their heads.\nThe Thunder squandered a 22-point lead in a 103-98 loss to the Clippers. Los Angeles ended the game with a 26-5 run after trailing by 16 with 7:30 left. Oklahoma City had only one field goal during that stretch, a 17-foot jumper by Kevin Durant.\n\"I'm not taking anything away from L.A.,\" Thunder coach Billy Donovan said. \"Obviously, they had to make the plays to get back in it. But did we beat ourselves, or did they beat us? The biggest decision that we have to make collectively, from an accountability standpoint, is that there's got to be a whole level of sacrifice by everybody.\"\n\nChris Paul had 21 points and 13 assists for Los Angeles, and DeAndre Jordan had 20 points and 18 rebounds. It was the largest comeback victory of the season for the Clippers, who reached the 40-win mark for the fifth year in a row and ninth time since the club relocated from San Diego to Los Angeles in 1984.\n\"Our intensity was key,\" Paul said. \"The defense picked up in the second half. I was out to start the fourth quarter, and Jamal Crawford looked at me and said: 'We are going to get us back in this thing by the time you guys (the starters) get back in.' I don't know if he's a fortune teller, but he did it.\"\nDurant scored 30 points, and Russell Westbrook had 24 points and 12 assists for Oklahoma City. The game marked the first of three meetings this month between the teams with the third- and fourth-best records in the Western Conference.\n\"We just let up and got comfortable with the lead,\" Westbrook said. \"As you can see, you can't let up against good teams, especially on the road.\"\nThe day began for the Thunder with the stunning news that part-owner Aubrey McClendon had died. McClendon, 56, was killed when his sport utility vehicle slammed into a concrete bridge embankment in Oklahoma City shortly after 9 a.m. local time.\nThe crash occurred one day after he was indicted by a federal grand jury for allegedly conspiring to rig bids to buy oil and natural gas leases in northwest Oklahoma while he was still CEO of Chesapeake Energy Corp.\nIn a statement released Tuesday after the indictment, McClendon denied violating antitrust laws and said he would \"fight to prove my innocence and to clear my name.\"\n\"It's just a tough and terrible day,\" Donovan said before the game. \"He was a very generous guy, and I'm just really saddened by what happened today.\"\nIt was the second deadly crash connected to the Thunder organization in three weeks. On Feb. 10, Ingrid Williams, the 44-year-old wife of assistant coach Monty Williams, was killed in a head-on collision just outside Oklahoma City when an oncoming car crossed the center line and struck her SUV.\n\"I think the organization has got a lot of character inside of it and a lot of really good people inside of it,\" Donovan said. \"And when you're around people like that, I think everybody can lift everybody else up.\"\nClippers forward Jeff Green started in place of Luc Mbah a Moute and played 17 scoreless minutes. Mbah a Moute has a laceration on his lower left eyelid that required stitches.\nReserve guard Austin Rivers played for the first since Feb. 3 and had six points in 19 minutes after missing 10 games with a broken left hand.\nJ.J. Redick made four of his first six shots for the Clippers before leaving with 4:21 left in the first quarter because of a bruised lower back. By the time he returned with 7:48 remaining in the half, their seven-point deficit had increased to 44-28.\nStill, the Clippers came back.\n\"They were disciplined, and we weren't,\" Durant said. \"I need to lead by example. I need to play with a passion, and hopefully it rubs off.\"\nTIP-INS\nThunder: Durant had 11 points in the first quarter, including a four-point play when he was fouled by Green at the top of the arc.\nClippers: TV play-by-play announcer Ralph Lawler will be honored with a star on the Hollywood Walk of Fame on Thursday. He is in his 37th season at the microphone, the third-longest tenure of any current NBA team broadcaster. ... Coach Doc Rivers didn't have a timeline on Mbah a Moute's return but said he would miss at least a couple of games. \"It's a terrible spot,\" Rivers said. \"He had to get stitches in the worst spot you can possibly get them. The lucky part is it wasn't a scratched retina or cornea or anything like that. I know he said he saw two of me today when we were talking. And I wouldn't want to see two of me.\"\nQUOTABLE\n\"I think the best thing for this team is adversity. It needs adversity,\" Donovan said.\nUP NEXT\nThunder: At Golden State on Thursday.\nClippers: Host Atlanta on Saturday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764994145.532043
}