{
  "game_id": "0021600703",
  "espn_id": "400900124",
  "date": "Jan 27, 2017",
  "matchup": "MEM @ POR",
  "headline": "Lillard's big 4th quarter leads Blazers past Grizzlies",
  "body": "PORTLAND, Ore. --  Damian Lillard wasn't saying whether he had extra individual motivation down the stretch against the Memphis Grizzlies.\n\nBut there was no doubt the Portland guard, passed over for the All-Star Game, was determined.\n\nLillard scored 33 points, including 13 straight late in the fourth quarter, and the Trail Blazers held off the Grizzlies 112-109 on Friday night.\n\n\"Obviously, Dame carried us,\" Blazers coach Terry Stotts said. \"It was good to see him have a stretch like that. He hasn't had one of those in a while.\"\n\nAllen Crabbe added 23 points off the bench for the Blazers, who have won three straight for the first time since early December. Mason Plumlee had his fourth double-double in a row with 13 points and 10 rebounds.\n\nMarc Gasol, coming off a career-high 42 points Wednesday in a victory over Toronto, scored 32 for the Grizzlies. Zach Randolph added 17 points and 13 rebounds.\n\nPortland led by 18 in the first half, but the Grizzlies closed the gap in the third quarter and the teams traded the lead in the fourth.\n\nLillard gave Portland a 97-96 lead with a step-back jumper with 5:40 left, then added a 3-pointer to extend it. Randolph answered with a layup for the Grizzlies, but Lillard hit another 3 to push it to 103-98.\n\nAfter Mike Conley made a 3-pointer for the Grizzlies, Lillard added his third straight 3 to give Portland a 106-103 edge with 3:45 to go.\n\n\"We tried to trap him,\" Memphis coach David Fizdale said. \"We had our best defender on him. But he made some right in Tony Allen's face. You couldn't guard it any better. ... He was nailing the ones he needed to make.\"\n\nConley made a pair of free throws with 1:31 remaining to get the Grizzlies to 110-109 before CJ McCollum's floater provided the final margin. McCollum finished with 18 points.\n\nLillard had just eight points in the second and third quarters. He finished the fourth with 15.\n\n\"You've got to have a short-term memory. Whenever the game's on the line, whatever has happened leading up to that point, you've got to be able to forget about it,\" he said.\n\nAsked afterward if he had any extra motivation Friday night because he was left off the Western Conference All-Star team, Lillard shook his head: \"No comment,\" he said.\n\nIn a TV interview coming off the court, Lillard said the snub did drive him.\n\n\"Anytime something like happens, you've got to find the right place to put it,\" he said.\n\nPortland was without Ed Davis for the third straight game because of a left wrist injury. Maurice Harkless missed his second game with a calf injury.\n\nThe Grizzlies had starters JaMychal Green and Chandler Parsons back in the lineup after both missed a 101-99 victory at home over Toronto. Both had left knee issues.\n\nMemphis was without rookie Deyonta Davis because of personal reasons.\n\nThere was a scary moment when Lillard slipped on the floor, but he continued playing and returned to start the second half.\n\nTrailing 62-56 at the break, the Grizzlies closed to 64-60 on Conley's 3-pointer. Memphis narrowed it again to 76-74 on Gasol's jumper, but Crabbe answered with consecutive 3-pointers for the Blazers.\n\nVince Carter made the second of two free throws to finally give Memphis the lead at 86-85 early in the fourth quarter.\n\nCrabbe matched his career high with his sixth 3-pointer to put Portland up 90-88 with 10 minutes left. The Blazers held onto the lead until Randolph's layup put Memphis back in front 94-93.\n\nConley finished with 17 points and 10 assists.\n\nTIP-INS\n\nGrizzlies: It was the opener of a six-game road trip for Memphis. The 10-day journey is the longest for the Grizzlies since they were gone for six games between March 24 and April 1, 2007. ... Carter turned 40 on Thursday.\n\nTrail Blazers: Stotts suggested before the game that perhaps the Blazers' record, at seven games under .500, had something to do with why Lillard and McCollum were snubbed for the All-Star Game.  \"Disappointment,\" Stotts said. \"I think both are playing at an All-Star level.\"\n\nGASOL HONORED\n\nAfter his 42-point performance against the Raptors, Gasol learned he had made the West reserves for the All-Star Game. Fizdale said the center was deserving of the honor.\n\n\"We're lucky to have a big guy like that and an All-Star like that,\" the coach said. \"He's really starting to take a stronghold on becoming a superstar and really attacking it and embracing it. It's fun to watch.\"\n\nUP NEXT\n\nGrizzlies: Visit the Utah Jazz on Saturday night.\n\nTrail Blazers: Host the Golden State Warriors on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764995595.5188951
}