{
  "game_id": "401810087",
  "espn_id": "401810087",
  "date": "Nov 15, 2025",
  "matchup": "MIN vs DEN",
  "headline": "Jokic's triple-double leads Nuggets past Timberwolves for seventh straight win",
  "body": "MINNEAPOLIS -- — Nikola Jokic had 27 points, 12 rebounds and 11 assists and three other players had 23 points to lead the Denver Nuggets to their seventh straight victory on Saturday night, 123-112 over the Minnesota Timberwolves.\n\n\r\n              Tim Hardaway Jr., Aaron Gordon and Jamal Murray had 23 points apiece, while Gordon also had 10 rebounds and Murray dished out 12 assists.\n\n\r\n              Julius Randle and Anthony Edwards scored 26 points each to lead the Timberwolves, whose four-game winning streak was snapped.\n\n\r\n              Minnesota led 60-55 at halftime, but the Nuggets outscored the Timberwolves in the third and fourth quarters to pull away.\n\n\r\n              A glitch in the NBA’s courtside statistics system froze the stat-keeping program late in the third quarter at Target Center. After the game, a Timberwolves employee told The Associated Press the system crashed when statisticians tried to input a double-foul called with 2:08 remaining in the third quarter.\n\n\r\n              The final statistics were made available several hours after the conclusion of the game.\n\n\r\n              The Nuggets were missing both of their starting forwards, Christian Braun (left ankle sprain) and Cam Johnson (right biceps strain), who were both injured during Denver's win over the Los Angeles Clippers on Wednesday. Braun is expected to be sidelined at least six weeks.\n\n\r\n              The Northwest Division rivals have met in the playoffs twice in the last three years. The Timberwolves swept the regular-season series last year, but Denver has won both meetings this season. The teams last played in Minneapolis in October. Edwards and Jaylen Clark were out with injuries, and the Nuggets overcame an eight-point halftime deficit with a 45-point third quarter en route to a 127-114 win.\n\n\r\n              Up next\r\n              Nuggets: Host Chicago on Monday.\n\n\r\n              Timberwolves: Host Dallas on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042632.49194
}