{
  "game_id": "0021800153",
  "espn_id": "401070834",
  "date": "Nov 07, 2018",
  "matchup": "OKC @ CLE",
  "headline": "Schroder scores 28 in place of Westbrook in 95-86 win,",
  "body": "CLEVELAND --  Oklahoma City's big fourth-quarter lead was gone and Russell Westbrook was unavailable.\n\nThe Thunder didn't panic and regrouped in the closing minutes to defeat the Cleveland Cavaliers 95-86 on Wednesday night.\n\n\"Thank God we were able to make a few more shots and get some late stops,\" Oklahoma City coach Billy Donovan said. \"I give our guys credit. We persevered and stayed with it. To get a win on the road is a good thing.\"\n\nDennis Schroder scored a season-high 28 points in replacing the injured Westbrook, who sprained his left ankle Monday. Oklahoma City won its sixth straight game without the two-time MVP after starting the season 0-4.\n\nSchroder, starting in Westbrook's place, was 11 for 19 from the field. Paul George scored 18 points and Jermai Grant had 12.\n\n\"We understand the NBA,\" George said. \"Runs are a part of the game. Every game is not going to be perfect.\"\n\nCleveland (1-10) rallied from an 11-point deficit early in the fourth  to go ahead. Oklahoma City led 78-67 before the Cavaliers went on a 13-0 run. J.R. Smith and Kyle Korver each hit two 3-pointers and the Cavaliers led 80-78 with 7:02 remaining.\n\nAlex Abrines' 3-point shot from the corner with 4:31 left broke an 84-84 tie and put Oklahoma City on top for good.\n\nCleveland added two more players to its ever-growing injury list. Rookie point guard Collin Sexton made his first career start after George Hill was a late scratch because of a sore right shoulder.\n\nSexton, taken with the eighth pick in the draft, scored a team-high 15 points in a career-high 42 minutes. He was told about 30 minutes before tipoff that he would be starting.\n\n\"I was ready, no surprise,\" he said. \"I didn't have any butterflies. You always have to be prepared that your chance is going to come.\"\n\nCedi Osman started in forward Kevin Love's spot, but left with back spasms in the first quarter and didn't return. Love had surgery on his left foot and is expected to be out for several weeks.\n\nSmith scored 13 points and Rodney Hood and Jordan Clarkson each had 11 for Cleveland.\n\nOklahoma City scored 17 straight points over a period of 4:36 in the second and third quarters to take a 56-40 lead.\n\nThe Thunder scored the last nine points of a lackluster first half to take a 48-40 lead. George made a basket and a free throw before ending the second quarter with a 29-foot 3-pointer as the buzzer.\n\nSchroder had a three-point play and a jumper and Grant hit a 3-pointer to help build the 16-point lead.\n\nWestbrook traveled with the team, but no timetable has been given for his return and he's unlikely to play Thursday against Houston. He's averaging 24.1 points, 8.9 assists and 8.3 rebounds in seven games.\n\nNICE FILL-IN\n\nSchroder didn't have an assist, but committed only two turnovers in 34 minutes.\n\n\"They overplayed me, so I tried to put pressure on the rim and score big-time,\" he said. \"They played smart and they switched every time, so me and Paul had to be aggressive at the rim.\"\n\nINJURY UPDATES\n\nCavaliers coach Larry Drew didn't learn of Osman's injury until the second-year player left the game. Hill hurt his shoulder late in Monday's loss in Orlando and couldn't get loose enough to play.\n\n\"They took Cedi in the back and came back and said he was done for the night,\" Drew said. \"I don't know the extent of the injury, we'll have to wait and see how he is. George was hurting this morning. He tried to participate in shoot-around. He didn't look good, he didn't look good at all. We elected to just sit him out tonight.\"\n\nHill had his best game of the season Monday with 22 points.\n\nTIP-INS\n\nThunder: Donovan was hit with a technical as the first quarter ended. George complained about not getting a foul called when he drove to the basket earlier in the period and gave the officials a disgusted wave. ... The winning streak is the second-longest active streak in the NBA, trailing only Golden State (eight).\n\nCavaliers: Drew juggled his starting lineup after power forward Sam Dekker sprained his left ankle Monday. Osman moved to Dekker's spot and Smith started at small forward, but that alignment didn't last long. Osman played only six minutes because of the injury. Center Ante Zizic had 10 points and nine rebounds in 17 minutes.\n\nUP NEXT\n\nThunder: Host Houston on Thursday.\n\nCavaliers: Visit Chicago on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994632.3728662
}