{
  "game_id": "0021500611",
  "espn_id": "400828498",
  "date": "Jan 17, 2016",
  "matchup": "OKC vs. MIA",
  "headline": "Russell Westbrook notches 24th career triple-double in Thunder's win over Heat",
  "body": "OKLAHOMA CITY -- Russell Westbrook got another triple-double, and as usual, the Thunder won.\nWestbrook had his second consecutive triple-double to help the Oklahoma City Thunder beat the Miami Heat 99-74 on Sunday. The explosive point guard finished with 13 points, 15 assists and 10 rebounds. It was his fifth triple-double of the season and the 24th of his career. The Thunder are 20-4 in Westbrook's career and 5-0 this season when he records a triple-double.\n\"It just means that it's great that we're having good wins,\" Westbrook said. \"We're playing together as a team, moving in the right direction on both sides of the floor.\"\n\nThunder forward Kevin Durant said it's a difference-maker when Westbrook rebounds at that level.\n\"We know he can get his points and assists, but when he rebounds with us like that, it makes it easier for everybody,\" Durant said. \"When he rebounds like that, we're a different team.\"\nDurant had 24 points and 10 rebounds, Serge Ibaka scored 19 points, and Dion Waiters added 18 for the Thunder, who became the third team to reach 30 wins this season.\nDwyane Wade, who sat out Friday against Denver with shoulder soreness, led the Heat with 22 points on his 34th birthday. Hassan Whiteside added 14 points, 11 rebounds and four blocks for the Heat.\nIt was the fewest points scored by the Heat this season and the fewest allowed by the Thunder.\n\"They did a good job defensively, not allowing us to have everything we wanted,\" Wade said. \"They changed up their schemes a little bit. They're a very long, athletic team. They're not easy to score on when they're locked in.\"\nOklahoma City led 44-42 at halftime behind 15 points and nine rebounds from Durant. Wade scored 18 points in the first half, the most he has scored in the first half of a game this season.\nOklahoma City led 49-48 in the second half before going on an 8-0 run that included three baskets by Andre Roberson. After Miami scored, Durant, Ibaka and Westbrook hit consecutive 3-pointers to make it 66-50, and the Thunder remained in control from there.\n\"We got stops, coach called some good plays, and we made three 3s in a row to bust it open,\" Durant said. \"That's like a backbreaker.\"\nHeat coach Erik Spoelstra was disappointed in the way his team came out of the break.\n\"The first six or seven minutes of that third quarter were clearly not at the level that was needed to grind out and make it a possession game going down the stretch,\" he said.\nSTAT LINES\nDuring their four-game win streak, the Thunder have allowed 88 points per game on 41 percent shooting overall and 29 percent shooting from 3-point range.\nMASH UNIT\nChris Andersen (sore left knee), Josh McRoberts (bruised right knee), Jarnell Stokes (illness), Goran Dragic (strained left calf) and Beno Udrih (neck) all sat out for Miami.\nSTAR POWER\nChris Bosh, Miami's leading scorer this season, finished with 12 points on 5-for-16 shooting.\nQUOTABLE\nSaid Wade of the Heat going 2-4 on their Western Conference road trip, with losses to Golden State and the Los Angeles Clippers: \"We knew this road trip was going to be tough. We played three of the top four Western Conference teams. I'm not worried about it. The biggest thing is hopefully we can get guys back on the floor.\"\nTIP-INS\nThunder: Enes Kanter went 0-for-5 from the field in the first half and had three of his shots blocked. ... The Thunder shot just 36 percent in the first half. ... Oklahoma City limited the Heat to three offensive rebounds before halftime and seven overall.\nHeat: Tyler Johnson started at point guard. It was the second-year player's fourth career start. He finished with 16 points. ... Miami's reserves were outscored 31-8 by their Heat counterparts. ... Thunder coach Billy Donovan coached Miami's Udonis Haslem at the University of Florida.\nUP NEXT\nThe Heat host the Bucks on Tuesday.\nThe Thunder play at the Nuggets on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994169.99728
}