{
  "game_id": "0022400190",
  "espn_id": "401704756",
  "date": "Nov 08, 2024",
  "matchup": "PHX @ DAL",
  "headline": "Jusuf Nurkic makes free throw with 0.8 seconds left to lift Suns past Mavs, 114-113",
  "body": "DALLAS -- — Jusuf Nurkic made the second of two free throws with 0.8 seconds left after getting fouled on an offensive rebound, lifting the Phoenix Suns to a 114-113 victory over the Dallas Mavericks on Friday night.\n\n\r\n              Kevin Durant scored 26 points, and Nurkic had 15 points and 10 rebounds as the Suns improved to 8-1 for the first time since 2009-10. Two of the victories have been over defending Western Conference champion Dallas. \n\n\r\n              Nurkic had put the Suns ahead with 31 seconds remaining with a dunk on a putback from a miss Durant. Daniel Gafford got Dallas even at 113 on an alley-oop dunk from Luka Doncic, who had 30 points, seven assists and seven rebounds.\n\n\r\n              Royce O'Neale missed a runner in the lane in the final seconds, but Nurkic grabbed the rebound and was bumped by several Dallas defenders on a missed shot as the buzzer sounded. Gafford fouled out on the play.\n\n\r\n              Doncic was short on a desperation 3-pointer at the buzzer.\n\n\r\n              O'Neale scored 18 points for Phoenix, and Devin Booker had 13 points and 12 assists.\n\n\r\n              Kyrie Irving scored 29 points, and Naji Marshall had 18 for Dallas.\n\n\r\n              Takeaways\r\n              Suns: O'Neale was a big boost off the bench, with Phoenix reserves outscoring the Dallas bench 28-9 after a 23-9 edge in the first meeting.\n\n\r\n              Mavericks: Gafford's foul trouble came with frontcourt partner Dereck Lively II out because of a sprained shoulder. Dwight Powell was forced to play a season-high 25 minutes and had five fouls.\n\n\r\n              Key moment\r\n              Nurkic's decisive rebound came after the only miss from O’Neale, who was 7 of 8. \n\n\r\n              Key stat\r\n              Phoenix didn't have a huge edge in offensive rebounds at 11-8, but six of them came in the fourth quarter. Nurkic had all three of his in the fourth.\n\n\r\n              Up next\r\n              The Suns are home against Sacramento on Sunday. The Mavericks are at Denver on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998246.494925
}