{
  "game_id": "0022000468",
  "espn_id": "401267628",
  "date": "Feb 21, 2021",
  "matchup": "TOR vs. PHI",
  "headline": "Raptors turn back 76ers 110-103 for 4th straight win",
  "body": "TAMPA, Fla. -- — Pascal Siakam and Fred VanVleet each had 23 points and the Toronto Raptors beat the Philadelphia 76ers 110-103 for their fourth straight victory Sunday night.\n\n\r\n                    Chris Boucher scored all 17 of his points for the Raptors in the final 14 minutes, hitting five 3-pointers over six minutes in a 19-10 stretch that pulled the Raptors ahead for good.\n\n\r\n                    “They got me open and I shot with confidence. Then when I made them I felt good about taking the next one,\" said Boucher, who also had a big fourth-quarter block of Philadelphia center Joel Embiid.\n\n\r\n                    Coming off a 50-point outburst against Chicago on Friday night, Embiid had 25 points and 17 rebounds for the 76ers, who lost their fourth consecutive road game. But he made only six of 20 shots from the field, and the Sixers went 5 for 21 in the fourth quarter.\n\n\r\n                    Toronto coach Nick Nurse gave much of the credit for the defense on Embiid to Aron Baynes.\n\n\r\n                    “We kind of had to have him in there. When we didn't, it wasn't pretty,” Nurse said of his 6-foot-10, 260-pound center. “I thought he put his body on him just enough. He got called for some, but that's OK.”\n\n\r\n                    Ben Simmons paced Philadelphia (20-11) with 28 points and nine rebounds.\n\n\r\n                    The 76ers led 55-52 after an 18-point first half by Simmons, who had missed two games with a stomach virus after scoring 42 points in a loss at Utah.\n\n\r\n                    Philadelphia shot 39% for the game.\n\n\r\n                    “I thought a lot of our guys had great looks tonight,” coach Doc Rivers said. “The problem was they weren't going in, and then it started mounting up.” \n\n\r\n                    The Raptors had erased an early 14-point deficit by hitting five 3-pointers — four by Van Vleet — in a span of 2 1/2 minutes. \n\n\r\n                    Boucher's big shooting spurt late in the game was less expected.\n\n\r\n                    \"We started behind before both those barrages and obviously it was important in getting back in the game,” Nurse said.\n\n\r\n                    VanVleet and Boucher hit five 3s each and the Raptors shot 14 for 34 from behind the arc.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: G Shake Milton played 29 minutes after missing five games with a left ankle injury. ... Embiid went 12 for 14 at the foul line in his 14th straight game shooting nine or more free throws.\n\n\r\n                    Raptors: G Kyle Lowry missed his second game with a sprained left thumb. The Raptors are 6-0 without him this season.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Play the Raptors again Tuesday night in Tampa before four straight home games.\n\n\r\n                    Raptors: Play the 76ers in a rematch before a trip to Miami on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996861.662747
}