{
  "game_id": "0022200083",
  "espn_id": "401468238",
  "date": "Oct 29, 2022",
  "matchup": "IND @ BKN",
  "headline": "Mathurin helps Pacers top Nets 125-116",
  "body": "NEW YORK -- — Rookie Bennedict Mathurin scored a career-high 32 points, Tyrese Haliburton added 26 and the Indiana Pacers beat the Brooklyn Nets 125-116 on Saturday night.\n\n\r\n              Mathurin, who had 27 points at Detroit on Oct. 22, made a career-best six of Indiana’s franchise-record 23 3-pointers\n\n\r\n              Indiana’s previous franchise record for 3s in a regular season game was 21 at home against Milwaukee on May 13, 2021.\n\n\r\n              “Every time I step on the court, confidence is always going to be the same (whether) my shots are going in or not going in,” Mathurin said. “Today I felt I could have had a bigger impact coming off the bench and I was having a little juice, bringing a little juice to the game.”\n\n\r\n              Isaiah Jackson had a double-double with 18 points and 10 rebounds and Buddy Hield chipped in 17 for the Pacers.\n\n\r\n              Indiana, winners of two straight, improved to 3-4.\n\n\r\n              “What these guys did in Washington last night, national tv game against a team that was 3-1, and then tonight against a team like Brooklyn that is loaded with superstars, we’re starting to understand how hard we have to play all the time,” Pacers coach Rick Carlisle said.\n\n\r\n              Kyrie Irving scored 35 points on 13 for 22 shooting from the field for the struggling Nets, who fell to 1-5. Brooklyn’s defense has allowed 124.5 points per game during its current four-game skid.\n\n\r\n              “We’re in constant communication all the time, if it’s a scheduled meeting or not,” Durant said. “I think we all talk about what we need to do as a team every day. So, regardless if it’s after a loss or it’s looked at as a meeting, but we (are) always in constant dialogue about what we need to do as a group.”\n\n\r\n              Irving has come under fire after he appeared to show support to an antisemitic film two days ago. He said before the game that he believes in all religions. Brooklyn trailed 92-90 to start the four quarter before for Pacers went on a 13-5 run to take a 105-95 advantage with 8:34 left on Jackson's layup.\n\n\r\n              Kevin Durant then scored four straight points to cut the deficit 108-101 but reserve guard Chris Duarte’s 3-pointer started a 6-0 run that extended the lead 114-101 with 5:39 left.\n\n\r\n              Mathurin helped Indiana out to a 63-62 halftime lead with 22 points. He shot 5 for 8 from the field, including 4 for 5 from long distance.\n\n\r\n              HOT STOVE\n\n\r\n              San Diego Padres All-Star right fielder Juan Soto took advantage of his visit to New York and attended the game. \n\n\r\n              HIT THE ROAD\n\n\r\n              Indiana has gone 2-2 during its five-game road trip. It’s their second longest stretch away from the Gainbridge Fieldhouse this season. The Pacers will play seven straight road games, all against Western Conference teams starting with a visit to Los Angeles to play the Clippers on Nov. 27. They finish it up with a Dec. 7 meeting at the Minnesota Timberwolves.\n\n\r\n              TIP INS:\n\n\r\n              Pacers: Mathurin previous career-high in 3-pointers made was five at Detroit on Oct. 22. \n\n\r\n              Nets: G Seth Curry made his season debut after recovering from arthroscopic left ankle surgery in May. He went scoreless in 18 minutes, missing five shots – all 3-pointers. \n\n\r\n              UP NEXT:\n\n\r\n              Pacers: Remain in New York to play Brooklyn.\n\n\r\n              Nets: Host Indiana on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994343.190141
}