{
  "game_id": "0022400009",
  "espn_id": "401703378",
  "date": "Nov 15, 2024",
  "matchup": "MIA @ IND",
  "headline": "Adebayo scores 30 to propel Heat past Pacers 124-111",
  "body": "INDIANAPOLIS -- — Bam Adebayo scored 30 points and had 11 rebounds and the Miami Heat beat the Indiana Pacers 124-111 on Friday night in NBA Cup play.\n\n\r\n              Adebayo scored 17 points in the final quarter as the Heat pulled away to even their NBA Cup record at 1-1. Tyler Herro scored 20 points, Kevin Love 15 and Haywood Highsmith 14 in the first of two straight games between the teams. They meet again Sunday in Indianapolis.\n\n\r\n              Obi Toppin led the Pacers with 21 points off the bench. Tyrese Haliburton had 18 points and eight assists. The game was Indiana's NBA Cup opener after reaching the final last year.\n\n\r\n              Takeaways\r\n              Heat: Needed a bounce back after an embarrassing overtime loss on Tuesday in which coach Erik Spoelstra called for a timeout that Miami didn’t have, resulting in a technical foul that gave the Pistons the winning free throw.\n\n\r\n              Pacers: Spotty defense has been a continual issue as lapses allowed open 3-point looks and uncontested baskets at the rim. The Pacers can score with any team, but at the moment, it remains to be seen if they can lock opponents down.\n\n\r\n              Key moment\r\n              Love scored the Heat's first 13 points of the second half as the visitors built a 13-point lead that reached as high as 22 in the third quarter. The 16th-year veteran had scored just nine points in his other two games this season.\n\n\r\n              Key stat\r\n              The Heat had a 10-point advantage in foul shots, making 19 of 23 to the Pacers' 9 of 11.\n\n\r\n              Up next\r\n              The Heat visit the Pacers on Sunday.\n\n\r\n              ----\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998292.614474
}