{
  "game_id": "0021800996",
  "espn_id": "401071669",
  "date": "Mar 10, 2019",
  "matchup": "MEM vs. ORL",
  "headline": "Conley leads the way as Grizzlies rally to beat Magic 105-97",
  "body": "MEMPHIS, Tenn. --  Mike Conley started hitting shots down the stretch, Orlando consistently misfired and the Memphis Grizzlies put a dent in the Magic's scramble for the final playoff spot in the Eastern Conference.\n\nConley scored 14 of his 26 points in the fourth quarter and the Grizzlies crafted a late rally to beat the Magic 105-97 on Sunday.\n\nAvery Bradley added 21 for Memphis in its third straight victory, the first time the Grizzlies put together a streak of three wins since mid-November.\n\nMemphis, which made over a large chunk of its roster at the trade deadline, has won four of the last five and is 5-4 since the All-Star break.\n\n\"We're still figuring it out, and it's not always pretty,\" Conley said. \"It's a work in progress.\"\n\nWhile Memphis is on a roll, the Magic are struggling at the wrong time. Orlando has lost three of four, again failing to work its way into the East's final playoff spot. And whether because of the Magic's recent play, or frustration over fouls and the game getting away at the end, Orlando coach Steve Clifford took his leave in the closing seconds.\n\nIn the final minute and the game out of reach, Clifford voiced his displeasure with the officiating, drawing two technicals. Clifford had to be restrained as he left the court as he continued going after official Rodney Mott.\n\nThat came after Magic guard Evan Fournier was ejected with two quick technicals in the third quarter.\n\n\"I shouldn't get fined for this, but in 19 years, I've seen a lot of things,\" Clifford said in disputing Fournier's ejection, saying the guard didn't swear and didn't try to show up the officials. \"Those were uncalled for, unwarranted, and they changed the whole game.\"\n\nNikola Vucevic led the Magic with 26 points and 10 rebounds, and Terrence Ross added 15 points.\n\nThe real swing came near the eight-minute mark of the fourth. Vucevic scored from 10 feet for an 84-81 Magic lead. But Orlando would only convert one more shot from the field, a 3-pointer by D.J. Augustin, the rest of the way.\n\nThat was about the time Conley started making his fourth-quarter push, a common denominator in the Grizzlies' recent wins. Conley scored 12 points in the final 4:27. The latter part of Conley's scoring run and the late technicals against Clifford contributed to Memphis scoring the game's final 12 points.\n\n\"We missed some shots. We had some turnovers. Obviously, we kind of struggled offensively at the end,\" Vucevic said, later adding: \"It's tough if you don't score for such a long time, especially in a game like this.\"\n\nTIP-INS\n\nMagic: Endured a tough-shooting first quarter, connecting on four of their 21 shots and ending the quarter at 24 percent. Aaron Gordon missed all five of his shots and Vucevic was 4 of 12 in the first. ... Orlando finished the game shooting 36 percent. ... Vucevic has scored at least 20 points 38 times. ... While Orlando made only one field goal down the stretch, the Magic made all six of their free throws in the closing minutes.\n\nGrizzlies: Coach J.B. Bickerstaff celebrated his 40th birthday on Sunday. ... CJ Miles reached 8,000 career points with a 3-pointer in the first quarter. ... Bradley's five highest-scoring games of the season have come since he joined the Grizzlies at the trade deadline. ... Are 15-7 when holding opponents under 100. . Have averaged 108.3 points in the nine games since the All-Star break. They averaged 100.6 points before the break.\n\nSTANDINGS WATCH\n\nThe loss left Orlando a game behind the Miami Heat for the eighth playoff spot in the East. But the Magic squandered an opportunity to move up as the Heat lost to Toronto earlier Sunday.\n\nNO STANDINGS WATCH\n\nMemphis stopped worrying about the playoffs long ago. But despite the record, the Grizzlies are playing their best basketball since the start of the season. \"We have all the reason in the world to lay down and not be into the games right now,\" Conley said. \"(But) you can see the energy, and I'm proud of the way that every one of the guys has been ready and locked in regardless of our situation.\"\n\nUP NEXT\n\nMagic: Visit Washington on Wednesday.\n\nGrizzlies: Visit Atlanta on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994900.751936
}