{
  "game_id": "0022301018",
  "espn_id": "401585646",
  "date": "Mar 22, 2024",
  "matchup": "LAL vs. PHI",
  "headline": "Anthony Davis, LeBron James lead 4th-quarter charge as the Lakers hold off Philadelphia 101-94",
  "body": "LOS ANGELES -- — Anthony Davis had 23 points and 19 rebounds, and D’Angelo Russell set the Lakers record for 3-pointers in a single season during Los Angeles' 101-94 victory over the Philadelphia 76ers on Friday night.\n\n\r\n              LeBron James had 20 points, eight rebounds and six assists as the Lakers snapped a seven-game losing streak in their matchups with the Sixers. Los Angeles hadn't beaten Philadelphia since March 3, 2020.\n\n\r\n              James scored 11 points and Davis added nine in the fourth quarter, using their size and resilience to overcome a gritty effort by Philadelphia. Neither team led by double digits all night, and the Lakers committed 21 turnovers during their lowest scoring performance since Jan. 3.\n\n\r\n              “Ugly, but we got the job done,” James said. “We defended (well) in the second half. They only had 18 (points) in the fourth. That's big-time when the offense was struggling like it was. ... We turned the ball over way too much and gave up too easy baskets, but when we got in the half-court, we buckled down and made them take tough shots.”\n\n\r\n              Russell surpassed the 3-pointers record set by Nick Van Exel during the 1994-95 season when he hit his 184th midway through the first quarter. Russell finished with 14 points and four 3-pointers for the Lakers, who hung on for their seventh win in 11 games after having three days off since beating Atlanta on Monday.\n\n\r\n              “It just feels good to be part of one of these type of deals,” Russell said. “This franchise is one of the most prestigious, so to have my name be a part of it, more than grateful. Just continue to shatter it, if I can. Make it really hard for the next person.”\n\n\r\n              Los Angeles looked offensively rusty in its return, with poor shooting and Philly’s typically physical defense combining to make it a long evening. Neither team led by more than seven points until James hit his first 3-pointer of the night with 2:11 to play.\n\n\r\n              “I thought we played unbelievably hard (and) executed the game plan,” Philadelphia coach Nick Nurse said. “I just thought we could not get enough offense to hang in there. ... As long as we play our guts out, I can live with it. I’m having a hard time living with it right now because I thought we played so hard and executed so well.”\n\n\r\n              Tyrese Maxey scored 22 of his 27 points in the second half for the Sixers, who have lost seven of 10 in MVP Joel Embiid's extended absence. Kelly Oubre Jr. scored 19 points and Tobias Harris had 16 points and 13 rebounds in his return from a three-game absence with a sprained right ankle. Philadelphia is now 0-2 on its four-game West Coast road trip.\n\n\r\n              “With Joel being out, it's created opportunities for other guys,” Harris said. “But in the grand scheme of things, we also know that this group has to figure out ways to generate that type of offense. In tonight's game, what hurt us was not getting stops on the other end, because when we were out in transition, that was some of our best offense.”\n\n\r\n              Russell, who was drafted by the Lakers in 2015 and played alongside Kobe Bryant as a rookie, returned to Los Angeles via trade last season. He has been a prolific scorer from the perimeter during his second chapter with the Lakers, and he hit six 3-pointers Monday to tie Van Exel's record.\n\n\r\n              Spencer Dinwiddie had 11 points with three 3-pointers in his highest-scoring performance since joining his hometown Lakers.\n\n\r\n              Los Angeles swingman Taurean Prince missed the game for personal reasons.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host Indiana on Sunday night.\n\n\r\n              76ers: At LA Clippers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995487.4156249
}