{
  "game_id": "0021800080",
  "espn_id": "401070761",
  "date": "Oct 27, 2018",
  "matchup": "MEM vs. PHX",
  "headline": "Gasol, Conley lead Grizzlies to easy win over Suns 117-96",
  "body": "MEMPHIS, Tenn. --  Despite a bit of a youth movement, it's still the Marc Gasol and Mike Conley show for the Memphis Grizzlies -- with a good amount of defense mixed in.\n\nMemphis, held Phoenix to 46 percent shooting, including the Suns connecting on only 9 of 33 shots outside the arc in a 117-96 victory Saturday night.\n\n\"I think defense is what really keys and starts our offense for us,\" said Conley, who finished with 18 points and seven assists. \"Gives us easy opportunities. Gives us a different flow, a different rhythm. .It allows us to play with a little more pace and get guys more opportunities.\"\n\nGasol led the Memphis scoring with 19 points. MarShon Brooks, like Conley, had 18 points, Garrett Temple added 15, and Wayne Selden 14.\n\n\"We want to be a versatile offensive team where you can't key in on one or two guys to shut us down,\" Memphis coach J.B. Bickerstaff said. \"It's good to see a bunch of guys get double-figure points. That means we're sharing the ball well.\"\n\nWith Suns leading scorer Devin Booker out nursing a left hamstring strain, it was up to Deandre Ayton, the first overall pick in last summer's draft, to do his part. He led Phoenix, scoring 24 points -- tops for his young season -- and had eight rebounds.\n\nBut he didn't get a lot of offensive help to replace Booker's missing 28 points a game. Guard Isaiah Canaan was the only other starter reaching double figures, scoring 11 points. Rookie Elie Okobo came off the bench for 12 points, and Jamal Crawford added 11. The Suns have lost four straight.\n\nWhile Memphis took a first-quarter lead, the advantage was built in the second, when the Grizzlies outscored Phoenix 42-25 for a 68-43 halftime lead.\n\n\"We came out lackadaisical with the turnovers and stuff,\" Ayton said. \"They started getting (into) a rhythm early, and they started making a lot of shots in the first half, especially in the second quarter.\"\n\nFrom there, Memphis would extend it to 26 midway through the fourth quarter, leading both coaches to start clearing their benches.\n\n\"We are repeating the same mistakes. Turnovers, obviously.\" Phoenix coach Igor Kokoskov said of the Suns' 19 miscues. \"It was a big part of this game.\n\n\"We have to play better. But not just better. We have to execute better.\"\n\nTIP-INS\n\nSuns: Ayton has scored at least 18 points in four of his five games this season. ... Josh Jackson started in Booker's spot. ...Jackson had six turnovers in the first quarter. ... Ryan Anderson, who has a reputation as a 3-point shooter, entered the game 3 of 15 from outside the arc this season. His percentage didn't get any better, going 1 for 3 from 3-point range.\n\nGrizzlies: Jaren Jackson Jr. drew a technical foul early in the fourth quarter when he jumped up in dispute over being called for a foul. .Jackson scored 6 points, the first time he has not reached double-figures in his rookie season. .F Chandler Parsons sat for the second straight game with right knee soreness.\n\nGASOL A-GO\n\nGasol, who left Wednesday's loss in Sacramento holding his shoulder and neck, played after evaluation showed he basically suffered \"a stinger.\" Memphis coach J.B. Bickerstaff was not surprised the 7-foot-1 center returned to action three days later. \"That's who Marc is,\" Bickerstaff said. \"He's one of the toughest guys I've ever been around. Playing through almost anything.\"\n\nWATANABE DEBUTS\n\nMemphis rookie Yuta Watanabe made his first appearance of the season, becoming only the second Japanese player to play in an NBA regular-season game. Yuta Tabuse, played four games for the Suns in 2004. \"The NBA has been a dream since I was a little kid, and that was a good opportunity,\" said Watanabe, who scored 2 points.\n\nUP NEXT\n\nSuns: At Oklahoma City on Sunday night\n\nGrizzlies: Host Washington on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994144.731565
}