{
  "game_id": "0022400329",
  "espn_id": "401704895",
  "date": "Dec 05, 2024",
  "matchup": "MEM vs. SAC",
  "headline": "Marcus Smart scores 18 points, hits clinching free throws in Grizzlies' 115-110 win over Kings",
  "body": "MEMPHIS, Tenn. -- — Marcus Smart scored 18 points — the last two on clinching free throws with 2.9 seconds left — and the Memphis Grizzlies beat the Sacramento Kings 115-110 on Thursday night.\n\n\r\n              Desmond Bane also had 18 points along with seven assists. Jaren Jackson Jr. and Santi Aldama scored 15 points each, with Aldama grabbing 10 rebounds as Memphis won its seventh straight at home.\n\n\r\n              DeMar DeRozan led the Kings with 26 points. Malik Monk had 23 points, De'Aaron Fox added 18 and Domantas Sabonis had 17 points and 13 rebounds. They have lost seven of nine.\n\n\r\n              There were 20 lead changes and 11 ties. Memphis took its final lead with 4:29 left on a drive by Jake LaRavia. Sacramento would get within two points in the closing minutes, but never overtook Memphis.\n\n\r\n              Takeaways\r\n              Kings: The Kings had a 16-9 edge on offensive rebounds. And while they got strong offensive performances from Monk and DeRozan, the Kings were unable to overtake Memphis in the final minutes.\n\n\r\n              Grizzlies: Memphis was able to overcome 22 turnovers leading to 29 points.\n\n\r\n              Key moment\r\n               Ja Morant's complaints about calls earned him a pair of technical fouls in the fourth quarter, leading to his ejection with 6:45 left and the score tied at 98. Morant was 2 for 13 from the field for the game, including missing all six of his 3-point attempts.\n\n\r\n              Key stat\r\n              The Grizzlies were 13 off 38 from outside the arc to 8 of 35 for the Kings. Memphis is 11-0 when it makes more 3-pointers than its opponent.\n\n\r\n              Up next\r\n              The Kings are at San Antonio on Friday. The Grizzlies are at Boston on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba(backslash)",
  "source": "espn_api",
  "crawled_at": 1764997741.817508
}