{
  "game_id": "0022200657",
  "espn_id": "401468812",
  "date": "Jan 16, 2023",
  "matchup": "MIL vs. IND",
  "headline": "Holiday sparks late rally as Bucks beat Pacers 132-119",
  "body": "MILWAUKEE -- — Jrue Holiday and the Milwaukee Bucks responded to the Indiana Pacers' fast start by delivering a dominant performance down the stretch.\n\n\r\n              Holiday scored a season-high 35 points to go along with 11 assists for his third straight double-double and the Bucks rallied to beat the Pacers 132-119 on Monday. The Pacers had led 76-65 at the break after matching their highest first-half point total of the season.\n\n\r\n              “I think that we slowed them down just enough,\" Holiday said. “They were running that first half, boy. It was like how Golden State tries to do, how Houston used to do. They ran fast. They run fast, they shoot 3s. They were pretty much getting things in the paint and getting 3s at the same time.”\n\n\r\n              Neither team was at full strength.\n\n\r\n              The Bucks played without two-time MVP Giannis Antetokounmpo for a third straight game due to left knee soreness. Indiana was missing leading scorer and NBA assists leader Tyrese Haliburton for a third straight game due to a left elbow sprain and a mild left knee bone bruise.\n\n\r\n              The Pacers still led most of the way, with Myles Turner scoring 30 points after missing three games with back spasms and T.J. McConnell adding a career-high 29 points — including 25 in the first half — plus nine assists.\n\n\r\n              Milwaukee eventually handed Indiana its fourth straight loss by outscoring the Pacers 39-21 in the fourth quarter. Holiday scored 21 of his points after halftime to lead the comeback.\n\n\r\n              “He's just an unreal player on both ends,” McConnell said. “Should be the defensive player of the year for a couple of seasons. And his offensive game, he just plays at his own pace, can score at all three levels. He's just unbelievably good.”\n\n\r\n              Holiday shot 13 of 19 overall and 5 of 8 from 3-point range. The Bucks went 23 of 46 from beyond the arc and had their most 3-pointers this season.\n\n\r\n              Milwaukee's Bobby Portis said after the game that Holiday deserves to play in the All-Star Game. Holiday's lone All-Star appearance came in 2013 with the Philadelphia 76ers.\n\n\r\n              “Just taking the game over and taking it into his own hands, that's what stars do,” said Portis, who had 21 points and 11 rebounds. “They show up on a nightly basis. And I think he shows up every night for us.”\n\n\r\n              After falling behind by as many as 13, the Bucks pulled ahead 101-100 on Grayson Allen’s 3-pointer with 10:04 left in the game, the first time the Pacers had trailed since the opening quarter. Indiana responded with consecutive baskets from Andrew Nembhard and Jalen Smith.\n\n\r\n              The game went back-and-forth from there, as the first 4 1/2 minutes of the fourth quarter featured five lead changes. Jordan Nwora’s 3-pointer with 7:40 left put the Bucks ahead for good at 108-107.\n\n\r\n              Indiana led most of the way thanks to the fast start by McConnell, who entered the day scoring just 6 points per game.\n\n\r\n              During his 25-point first half, McConnell shot 9 of 9 from the floor, including 4 of 4 from 3-point range, and 3 of 3 from the free-throw line while playing 17 minutes.\n\n\r\n              McConnell was asked after the game the last time he had been in such a zone.\n\n\r\n              “Probably high school,” McConnell replied.\n\n\r\n              Brook Lopez had 19 points, Allen 17 and Nwora 14 for the Bucks. Buddy Hield scored 18 and Bennedict Mathurin added 12 for the Pacers.\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Indiana shot 60.9% in the first half but 39.5% in the second half.\n\n\r\n              Bucks: Coach Mike Budenholzer said before the game that a decision hadn’t been reached on whether Antetokounmpo would play Tuesday against the Toronto Raptors. ... George Hill played more than 22 minutes and had nine points and six assists in his first appearance since Jan. 6.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Oklahoma City on Wednesday.\n\n\r\n              Bucks: Host Toronto on Tuesday. In their only previous meeting this season, the Bucks won 104-101 in overtime at Toronto on Jan. 4.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995029.549387
}