{
  "game_id": "0022200105",
  "espn_id": "401468260",
  "date": "Nov 01, 2022",
  "matchup": "ORL @ OKC",
  "headline": "Gilgeous-Alexander's 34 help Thunder push win streak to 4",
  "body": "OKLAHOMA CITY -- — For a few moments, it seemed like the glory days for the Oklahoma City Thunder.\n\n\r\n              “MVP! MVP!” chants rained down for a Thunder player late in a win, like they often did during the Kevin Durant/Russell Westbrook era.\n\n\r\n              This time, the chants were for Shai Gilgeous-Alexander. The new face of the franchise scored 13 of his 34 points in the fourth quarter, and the Thunder rallied from 15 points down in the second half to beat the Orlando Magic 116-108 on Tuesday night for their fourth straight win.\n\n\r\n              Gilgeous-Alexander made all three of his field goals and 7 of 8 free throws in the fourth quarter. Thunder coach Mark Daigneault said Gilgeous-Alexander, the fifth-year guard who averages 31.5 points, could do even more.\n\n\r\n              “Great poise,” Daigneault said. “That’s probably the thing that stands out about that stretch. I still don’t think he’s playing his best basketball for 48 at least, and I don’t think he will (think so) either after tonight. But in the fourth quarter, for sure.\"\n\n\r\n              Overall, Gilgeous-Alexander made 12 of 18 field goals and 10 of 11 free throws.\n\n\r\n              “He was tough,” Magic coach Jamahl Mosley said. “We knew that was how crafty and tricky he can be getting to the paint. Obviously, he hit some tough shots, hit some tough 2s.”\n\n\r\n              Aleksej Pokusevski added 16 points and nine rebounds for the Thunder, who improved to 4-3 and have a winning record for the first time since nine games into the 2020-21 season.\n\n\r\n              Wendell Carter Jr. tied a career high with 30 points and grabbed 12 rebounds, and Franz Wagner added 20 points for Orlando. Paolo Banchero, the No. 1 pick in the 2022 draft, had 15 points and eight rebounds.\n\n\r\n              Orlando led 66-63 at halftime, then scored the first nine points of the third quarter. The Magic extended the lead to 86-71 with just under 5 minutes left in the third quarter. The Thunder chipped away, and Orlando led just 88-85 heading into the fourth.\n\n\r\n              Pokusevski made a 3-pointer to give the Thunder a 105-104 lead with just over 4 minutes to play, and he later made a layup to put Oklahoma City ahead 109-106. Lu Dort hit a 3-pointer with 51 seconds remaining to put the Thunder up six and in control for good.\n\n\r\n              “That group at the end of the third really got us back in the game and just shifted the tone in the game a little bit,” Daigneault said. “And then the group down the stretch did a great job.”\n\n\r\n              The Thunder scored 30 points off 25 Orlando turnovers. \n\n\r\n              “You don’t give yourself an opportunity,” Mosley said. “Those are lost possessions. We’ve got to learn to take care of the basketball in crunch time and understand the possession of the basketball is the most important thing, and we’ve got to do it by committee.”\n\n\r\n              TIP-INS\n\n\r\n              Magic: C Mo Bamba was called for a technical in the second quarter. ... Orlando was issued a technical in the fourth quarter for a second delay of game. ... Outrebounded the Thunder 49-36. ... F Bol Bol had four blocks. He entered the night ranked fourth in the league with 2.4 per game. He also had 13 points and 12 rebounds.\n\n\r\n              Thunder: G Josh Giddey had 10 assists in his return from an ankle injury. ... Rookie G Jalen Williams scored six points in his first career start. ... Gilgeous-Alexander missed a free throw after making his first 34 this season. He blew past the previous Thunder record of 23 consecutive makes to start a season set by Danilo Gallinari in 2019.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host the Golden State Warriors on Thursday.\n\n\r\n              Thunder: Host the Denver Nuggets on Thursday.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994659.909916
}