{
  "game_id": "0022300751",
  "espn_id": "401585379",
  "date": "Feb 10, 2024",
  "matchup": "CHA vs. MEM",
  "headline": "Hornets, with help from 5 newcomers, beat Grizzlies 115-106 to end 10-game losing streak",
  "body": "CHARLOTTE, N.C. -- — Miles Bridges scored 25 points, newcomer Vasilije Micic had career highs with 18 points and nine assists and the new-look Charlotte Hornets snapped a 10-game losing streak with a 115-106 victory over the Memphis Grizzlies on Saturday night.\n\n\r\n              Brandon Miller added 18 points to help the Hornets win at home for the first time since Jan. 19.\n\n\r\n              Micic, a 30-year from Serbia who has played mostly overseas, joined Tre Mann, Grant Williams, Davis Bertans and Seth Curry in the Hornets' rotation for the first time after Charlotte dealt mainstays P.J. Washington to Dallas and Gordon Hayward to Oklahoma City on Thursday.\n\n\r\n              “I didn't expect to play this much honestly,” said Micic, who saw 26 minutes off the bench.\n\n\r\n              Hornets coach Steve Clifford said he was impressed with Micic's awareness on the court.\n\n\r\n              “All the stuff you can't teach,” Clifford said. “He knows where everybody is on the floor. Obviously he is a terrific passer and a good pick and roll player. And he's got size. He's big. Some of those passes maybe other guys can see, but don't have the ability to make the play.”\n\n\r\n              Williams, who played high school ball in Charlotte along with Curry, provided some needed physicality finishing with 15 points and eight rebounds, while Mann had nine points and nine rebounds after getting the start.\n\n\r\n              Jaren Jackson Jr. had 29 points for the Grizzlies. They have lost eight straight and played without seven injured players.\n\n\r\n              With so many new players on the Charlotte roster and little cohesiveness — the team has yet to practice together — that meant some confusion at times with players still unsure where to be on the court.\n\n\r\n              That lack on continuity didn't exactly bode well early on for Bridges, who had back-to-back 40-plus point games earlier in the week. Bridges attempted just four shots in the first half and had six points at the break — and was even outscored by Bertans, who had nine in the first half.\n\n\r\n              But despite not having practiced together, the Hornets found a way with 30 assists.\n\n\r\n              Bridges found his groove in the second half with 19 points.\n\n\r\n              He came up with the big play, too, stealing a pass in the backcourt and finishing with a high-flying, emphatic one-handed jam to give Charlotte a 103-94 lead with about three minutes left.\n\n\r\n              Bridges later added a reverse layup and Williams scored on an easy dunk off a behind-the-head pass from Micic to push the lead to 12 and all but seal the win a few moments later.\n\n\r\n              “The two things you want in this league, one, you want smart, high IQ guys. I think we added a bunch of those,” Clifford said about the five newcomers. “And then also I think there’s very much a veteran presence that they’re going to bring to our locker room.”\n\n\r\n              Memphis also was busy at the trade deadline, dealing Steven Adams, Xavier Tillman Sr. and David Roddy in separate trades. But Memphis' new players still on the roster — wing Lamar Stevens and forward Yuta Watanabe — didn't play.\n\n\r\n              “It’s been fun to watch Yuta’s career with his time in Memphis,\" Grizzlies coach Taylor Jenkins said. “I’m excited to have him come back. He’s a utility player who can play the three and the four, and he’s ultra-competitive, obviously, his shots have gotten a lot better. Lamar is continuing to evaluate that wing crop that we’ve got.” \n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host New Orleans on Monday night.\n\n\r\n              Hornets: Host Indiana on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995963.7126248
}