{
  "game_id": "0022400543",
  "espn_id": "401705109",
  "date": "Jan 12, 2025",
  "matchup": "IND @ CLE",
  "headline": "Pacers end NBA-leading Cavaliers' winning streak at 12 with 108-93 victory",
  "body": "CLEVELAND -- — Andrew Nembhard scored 19 points, Pascal Siakam had 18 points and nine rebounds and the Indiana Pacers ended NBA-leading Cleveland's winning streak at 12 games, beating the Cavaliers 108-93 on Sunday night.\n\n\r\n              The teams will complete the home-and-home set Tuesday night in Indianapolis.\n\n\r\n              Myles Turner added 15 points and 10 rebounds, and Jarace Walker had eight points and 12 rebounds off the bench to help Indiana win its sixth straight. The Pacers held the Cavaliers to a season low in points and outscored them 68-40 in the second half.\n\n\r\n              Cleveland lost for the first time since Dec. 8 at Miami. It is 33-5 overall and 20-2 at Rocket Mortgage FieldHouse.\n\n\r\n              Darius Garland had 20 points and seven assists for the Cavs. Donovan Mitchell scored 19 points and Evan Mobley had 16 points and 12 rebounds.\n\n\r\n              Takeaways\r\n              Pacers: All-Star point guard Tyrese Haliburton, who has appeared in all 40 games and is averaging team highs of 8.9 assists and 35.0 minutes, sat out the second half after experiencing left hamstring tightness. He had two points and five assists.\n\n\r\n              Cavaliers: Indiana coach Rick Carlisle raved about Cleveland’s depth and style under new coach Kenny Atkinson, saying, “They don’t have any weaknesses. I mean, you can’t find any. All of their guys can score and those guys play defense, too.”\n\n\r\n              Key moment\r\n              Immediately after the Cavaliers built their largest lead at 60-45 in the third, Indiana used a 32-7 run to seize a double-digit advantage. Backup power forward Obi Toppin fueled the surge with 10 points in a five-minute span, including a steal-and-slam in the backcourt.\n\n\r\n              Key stat\r\n              The Cavaliers, who are shooting a league-high 40.1% on 3-pointers, made just 11 of 41. They misfired on 15 of their first 16 attempts in the second half and finished with a season-low 26.8%. Mitchell and Garland combined for six of their makes.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998141.373897
}