{
  "game_id": "0022200698",
  "espn_id": "401468853",
  "date": "Jan 21, 2023",
  "matchup": "SAC vs. PHI",
  "headline": "76ers, without Embiid and Harden, edge Kings for 5-0 trip",
  "body": "SACRAMENTO, Calif. -- — Tyrese Maxey scored 15 of his 32 points in the third quarter and the Philadelphia 76ers, playing without Joel Embiid and James Harden, completed a perfect five-game road trip by beating the Sacramento Kings 129-127 on Saturday night.\n\n\r\n              Maxey also had seven assists and six rebounds to help the 76ers overcome a 21-point deficit. \n\n\r\n              Embiid and Harden rested foot injuries but the rest of the 76ers snapped Sacramento’s six-game winning streak. \n\n\r\n              Tobias Harris, Montrezl Harrell and Georges Niang all had 17 points for the Sixers.\n\n\r\n              “That was a resilient win by our guys,” 76ers coach Doc Rivers said. “Everyone who played did something to help us win tonight. It’s a team win.” \n\n\r\n              De’Aaron Fox had 31 points and nine assists for the Kings (26-19). Harrison Barnes had 27 points, going 6 for 9 from 3-point range. Kevin Huerter added 20 points.\n\n\r\n              “They have some good players,” Huerter said. “This is a team that, when healthy, you can put against anyone in the East.”\n\n\r\n              The Kings built a 71-50 margin on a 3-point basket by Huerter with 3:10 left in the second quarter. The 76ers went on a 14-3 run but the Kings held on to lead 74-64 at the half. \n\n\r\n              The 76ers surged back to tie the game at 86 on a three-point play by Harrell with 6:59 left in the third quarter. The Kings regained the lead when Barnes scored the next five points but the 76ers mounted a 16-5 run to end the quarter with a 102-96 lead. \n\n\r\n              Maxey scored 12 of the 76ers’ first 16 points in the third quarter. \n\n\r\n              “I was telling them (76ers) I was gonna come out aggressive in the third,” Maxey said. “I think in the first and third quarter I was letting them (Kings) dictate what shots that I was taking. (In the third), I dictated what we needed. I think I did that for most part of the third quarter.”\n\n\r\n              The 76ers opened a 107-96 lead early in the fourth until the Kings rallied back to cut the lead to one point on two occasions, the last when Keegan Murray made a 3-pointer to make it 127-126 with eight seconds left to play.\n\n\r\n              After Maxey made two free throws on the next play to extend the lead by three points, Matisse Thybulle fouled Barnes on his three-point attempt. Barnes missed the first, made the second, and then intentionally missed the third shot but the 76ers got the rebound to end the game. \n\n\r\n              The 76ers swept the series 2-0, including a 123-103 victory in Philadelphia on Dec. 14. The last time the Kings beat the 76ers was 115-108 on Feb. 2, 2019, in Sacramento.\n\n\r\n              “Give them a lot of credit,” Kings coach Mike Brown said. “They came in here and took this game from us.”\n\n\r\n              EMBIID AND HARDEN SIDELINED:\n\n\r\n              Embiid, the league’s second-leading scorer, sat out with left foot injury recovery, while Harden was sidelined due to right foot tendon strain management. Harrell and Maxey started in place of the two All-Stars.\n\n\r\n              TIP-INS\n\n\r\n              76ers: The 76ers are 18-4 since starting the season 12-12. They have won nine of their first 11 games in January. … Shake Milton had 15 points, seven assists and six rebounds off the bench.\n\n\r\n              Kings: Chimezie Metu went to the locker room in the second quarter with a left leg injury and did not return. ... Domantas Sabonis has recorded 22 straight double-doubles. ... Fox’s four assists early in the first half passed Bob Davies for the eighth spot on the Kings' career list with 2,251. \n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Brooklyn on Wednesday.\n\n\r\n              Kings: Host Memphis on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995302.069783
}