{
  "game_id": "0022400625",
  "espn_id": "401705191",
  "date": "Jan 23, 2025",
  "matchup": "OKC vs. DAL",
  "headline": "Dinwiddie, Washington lead Mavericks past Thunder 121-115",
  "body": "OKLAHOMA CITY -- — Spencer Dinwiddie scored 28 points, and the Dallas Mavericks beat the Oklahoma City Thunder 121-115 on Thursday night.\n\n\r\n              P.J. Washington had 22 points and 19 rebounds and Kyrie Irving added 24 points for the Mavericks, who have been without Luka Doncic for nearly a month because of a left calf strain. Dallas has won three of the four meetings this season against a Thunder team that leads the Western Conference and only has eight losses all season.\n\n\r\n              Jalen Williams led Oklahoma City with 33 points. Shai Gilgeous-Alexander, who was named an All-Star starter earlier in the evening, scored 16 of his 31 points in the fourth quarter for the Thunder. Gilgeous-Alexander scored a career-high 54 points in a win over Utah on Wednesday, but made just 5 of his first 15 shots against Dallas before getting on track.\n\n\r\n              Gilgeous-Alexander did not play last time the teams met, when the Mavericks won 106-98 in Dallas on Jan. 17.\n\n\r\n              The Thunder led 62-60 at halftime, but Dallas took over in the third quarter and led by 13 at one point. Gilgeous-Alexander banked in a shot from the lane at the buzzer to cut Dallas' lead to 91-83 heading into the fourth.\n\n\r\n              Takeaways\r\n              Mavericks: Dallas made it work despite several injuries. Center Dereck Lively was out with a stress fracture in his right ankle and guard Klay Thompson missed the game with a sprained left ankle.\n\n\r\n              Thunder: Oklahoma City, still missing injured center Isaiah Hartenstein, got beat on the boards 52-42. Hartenstein leads the team with 12.2 rebounds per game.\n\n\r\n              Key moment\r\n              Quentin Grimes made a 3-pointer with about 2 minutes remaining to give Dallas a 115-106 lead.\n\n\r\n              Key stat\r\n              Oklahoma City forced 20 turnovers, but only scored 15 points off them.\n\n\r\n              Up next\r\n              The Mavericks host Boston on Saturday. The Thunder visit Portland on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997505.6029031
}