{
  "game_id": "0021800656",
  "espn_id": "401071332",
  "date": "Jan 15, 2019",
  "matchup": "CHI @ LAL",
  "headline": "Ball scores 19 as Lakers deal Bulls eighth straight loss",
  "body": "LOS ANGELES --  Lonzo Ball and the Los Angeles Lakers were angry after the NBA's worst team broke a long losing streak on their home floor. They weren't about to let the league's second-worst team do the same thing on Tuesday night.\n\nBall scored 13 of his 19 points in the second half as the Lakers handed the Chicago Bulls their eighth straight loss with a 107-100 victory.\n\nIt was just the fourth win in 11 games for Los Angeles since LeBron James was sidelined with a groin injury.\n\n\"It was a must-win today, I knew I had to pick up whatever I could,\" said Ball, who also had rebounds and six assists. \"We were missing shots early but we got it together.\"\n\nThe game was close for the first 28 minutes before Los Angeles took control. It was tied at 48 with 9:24 remaining in the third quarter when the Lakers went on a 13-7 run, which included eight straight points at the start. Tyson Chandler scored the first two points before Ball scored 11 straight, including three 3-pointers.\n\n\"He's got a knack for hitting big shots. He's not afraid to knock down a 3 when we needed it,\" Lakers coach Luke Walton said. \"What is great is seeing him more confident in getting to the rim. He can draw contact but still be able to finish.\"\n\nChicago got within 72-68 on a 3-pointer by Wayne Seldon, but the Lakers pulled away again with six straight points to end the third and start the fourth.\n\nLos Angeles' lead grew to 94-76 with 4:26 remaining in the game before Chicago made a late flurry to get within 103-98 in the final minute.\n\nKentavious Caldwell-Pope, who got just his fourth start of the season, scored 17 points while Brandon Ingram and Kyle Kuzma scored 16 apiece.\n\nThe Lakers erased the bitter taste of a 101-95 loss Sunday to the Cleveland Cavaliers, who ended a 12-game skid, and gained some confidence going into a three-game stretch where they face Oklahoma City, Houston and Golden State.\n\n\"We've been losing and wanted to go out on the road with some momentum,\" Ball said.\n\nJabari Parker came off the bench to lead Chicago with 18 points and Lauri Markkanen added 17.\n\n\"We have to play better basketball for more of the game. We played about 28 to 35 minutes of good basketball and had 12 minutes of not good basketball,\" Bulls coach Jim Boylen said. \"We don't have enough firepower to be able to turn it on and take over the game. We have to plow through it and get the lead and hold on to it.\"\n\nBoth teams struggled shooting from the floor in the first quarter, but the Lakers held a 19-18 lead, marking the first time in eight games they led after the first 12 minutes.\n\nLos Angeles held a 44-43 lead at halftime as the first half had 22 lead changes and five ties.\n\nTIP-INS\n\nBulls: Chicago's 8 of 28 from the field in the first quarter was its second-worst opening 12 minutes of the season. It was 8 of 29 in a Dec. 26 loss to Minnesota. ... The Bulls were 7 of 17 on 3-pointers in the second half after going 2 of 14 in the first.\n\nLakers: Kuzma also had 12 rebounds as he recorded his third double-double of the season. ... The Lakers were 2 of 15 on 3-pointers in the first half but 6 of 11 in the second half, which included three from Ball.\n\nLINEUP CHANGE\n\nWalton changed his starting lineup, putting Tyson Chandler at center and Caldwell-Pope at guard while moving JaVale McGee and Josh Hart to the bench.\n\nChandler, who got his third start, scored eight points and had three rebounds in 26 minutes. Walton was also pleased with Caldwell-Pope holding Zach LaVine to 10 points, including 4 of 11 from the field, as well as what McGee and Hart provided off the bench.\n\n\"I'm sure there was some anger but they both engaged. You could tell by Josh's defensive demeanor in the fourth that he was locked in,\" Walton said.\n\nNUMBER OF NOTE\n\nThe Lakers have won all four games since James' injury when Ingram had six assists or more. He had seven against the Bulls.\n\n\"It is a chance for me to get everyone involved and show another part of my game,\" Ingram said. \"With me getting in the lane the defense collapses and a lot of guys are open.\"\n\nUP NEXT\n\nBulls: Conclude their five-game road trip against the Denver Nuggets on Thursday night.\n\nLakers: Travel to Oklahoma City on Thursday night for the second of three meetings against the Thunder.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Joe Reedy at www.twitter.com/joereedy",
  "source": "espn_api",
  "crawled_at": 1764994814.419353
}