{
  "game_id": "0022000349",
  "espn_id": "401267509",
  "date": "Feb 05, 2021",
  "matchup": "PHX vs. DET",
  "headline": "Booker, Paul carry Suns past Pistons 109-92",
  "body": "PHOENIX -- — The Phoenix Suns controlled almost the entire game against the Detroit Pistons until a rough few minutes during the second half made the game a little tighter.\n\n\r\n                    That's when coach Monty Williams went to his two-step approach for getting the Suns back on track.\n\n\r\n                    First step, put All-Star guard Chris Paul back into the game. Second step, put All-Star guard Devin Booker back into the game.\n\n\r\n                    Booker and Paul hit back-to-back 3-pointers midway through the fourth quarter to stop a Pistons' rally and the Suns rolled to a 109-92 win on Friday night. Booker had 23 points while Paul had 20 points and nine assists.\n\n\r\n                    “It was a good effort on both ends,” Booker said. “From beginning to end, we had it around 10 to 15 points most of the game, but we knew they weren’t going to give in.”\n\n\r\n                    Paul continued his high-production run of the past few weeks. The 10-time All-Star — who came to the desert in a trade with Oklahoma City during the offseason — is averaging more than 22 points over the past seven games, and the Suns have won four of them.\n\n\r\n                    “At the end of the day, what I’m most focused on is winning games,” Paul said. “If we’re winning games, I’m cool. But I need to play well for that to happen.”\n\n\r\n                    Frank Kaminsky added 15 points and five rebounds in his first start of the season as the Suns improved to 12-9. Williams said he put the 7-foot Kaminsky in the lineup to give the Suns\n\n\r\n                    Phoenix had a double-digit lead most of the game and had an 87-68 advantage by the end of the third quarter. Detroit pulled within 11 about midway through the fourth, but Booker and Paul hit back-to-back 3-pointers to push the game out of reach.\n\n\r\n                    The Pistons struggled in just about every phase but especially long-range shooting. They were 7 of 36 (19%) on 3-pointers, and the misses kept them from any sort of offensive rhythm.\n\n\r\n                    “We just couldn't hit a 3,” Pistons coach Dwane Casey said. “We had some good looks.”\n\n\r\n                    Jerami Grant led the Pistons with 21 points.\n\n\r\n                    Detroit has lost three straight games and eight of its past 10. The loss dropped the Pistons to 5-17 for the season, which is the worst record in the NBA. One of Detroit's rare wins was against Phoenix earlier this season, but the second matchup didn't go as well.\n\n\r\n                    “We felt like we owed them,” Booker said. \n\n\r\n                    The Suns led 27-24 after one quarter, holding the Pistons to 33% shooting, including 1 of 9 from 3-point range. Phoenix pushed ahead by 17 points by midway through the second quarter before settling for a 57-44 halftime lead.\n\n\r\n                    Cam Johnson led the Suns with 10 points in the first half. The team's bench scored 27 of the 57 points before the break.\n\n\r\n                    ALL-STAR TALK\n\n\r\n                    Paul — who is president of the NBA players' union — said he's had several conversations with fellow players about the league's plans for this year's All-Star game. Some players, including LeBron James, aren't pleased with the idea of making another trip during the coronavirus pandemic, especially with so many regular-season games packed into a tight window.\n\n\r\n                    “Guys are entitled to their feelings,” Paul said. “I think the job for the union is to make sure our players are healthy and safe.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Casey was called for a technical foul in the third quarter after arguing with an official. ... Guard Wayne Ellington didn't play because of a right calf strain.\n\n\r\n                    Suns: Forward Jae Crowder missed his first game this season with a sore foot. ... Crowder was one of three players who missed the game with an injury, including guard Cameron Payne (foot) and forward Dario Saric (ankle).\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Travel to face the Lakers on Saturday.\n\n\r\n                    Suns: Host the Celtics on Sunday. It'll be the first time fans will be allowed at Phoenix Suns Arena this season. The team is offering free tickets for up to 1,500 health care workers.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt on Twitter: www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997756.8617542
}