{
  "game_id": "0022400151",
  "espn_id": "401704717",
  "date": "Nov 03, 2024",
  "matchup": "BKN vs. DET",
  "headline": "Six Pistons score in double figures to lead Detroit past Nets 106-92",
  "body": "NEW YORK -- — Cade Cunningham scored 19 points to lead the Detroit Pistons to a 106-92 win over the Brooklyn Nets Sunday.\n\n\r\n              Cunningham was one of six players in double figures for Detroit. Tobias Harris and Malik Beasley scored 18 points each, Jaden Ivey finished with 15, Tim Hardaway Jr. added 14 and Jalen Duren had 13 for the Pistons.\n\n\r\n              Duren also grabbed 17 rebounds, and Detroit has won two of its last three games.\n\n\r\n              Despite a 26-point performance from Cameron Johnson, the Nets fell to 3-4. Cam Thomas, Brooklyn's leading scorer, scored 17 points and only had six in the fourth quarter after entering the game as the NBA's leader in fourth-quarter scoring.\n\n\r\n              Leading by six points entering the fourth quarter, the Pistons held the Nets to 15 points in the fourth to earn their second win of the season.\n\n\r\n              Takeaways \r\n              Pistons: Shooting the basketball was an issue for the Pistons on Sunday as Detroit went 11 for 36 behind the arc.\n\n\r\n              Nets: The Nets had a similar problem and shot 9 for 31 from 3.\n\n\r\n              Key moment \r\n              Following a relatively strong first half, the Nets were outscored 31-20 and outrebounded 12-7 in the third quarter. \n\n\r\n              Key stat \r\n              Johnson's 22 first-half points were the most by a Nets player in the first half this season. Johnson entered the game third on Brooklyn in scoring. \n\n\r\n              Up next \r\n              The Nets complete their three-game homestand against the Grizzlies on Monday, while the Pistons host LeBron James and the Lakers Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764998006.607917
}