{
  "game_id": "0022300104",
  "espn_id": "401584732",
  "date": "Oct 30, 2023",
  "matchup": "ATL vs. MIN",
  "headline": "Dejounte Murray ties career high with 41 points, rallies Hawks past Timberwolves 127-113",
  "body": "ATLANTA -- — Dejounte Murray matched his career high with 41 points and the Atlanta Hawks bounced back from a 19-point halftime deficit to beat the Minnesota Timberwolves 127-113 on Monday night.\n\n\r\n              Murray took command in the third quarter, getting the Hawks back in the game almost single-handedly. He equaled his 41-point effort against Portland on March 3. \n\n\r\n              Trae Young added 24 points for the Hawks, who followed up a 17-point win at Milwaukee the previous night to get back to .500 on the young season.\n\n\r\n              “If we utilize the talent we have on this team,” Murray said, “we can go a long way.”\n\n\r\n              Anthony Edwards, returning to his hometown, led the Timberwolves with 31 points. But he was held to 11 after halftime, with Murray spending a lot of time in his face.\n\n\r\n              At the offensive end, Murray scored 22 points in the third quarter, wiping out Minnesota’s 79-60 lead at the break. He connected on all eight of his field goal attempts, including a pair of 3-pointers, to send the game to the final quarter tied at 98.\n\n\r\n              “Obviously, DJ had that stretch where he put us on his back,” Hawks coach Quin Snyder said. “He made all kind of plays and I really liked his spirit.\"\n\n\r\n              The Hawks blew it open from there, with the backcourt of Murray and Young delivering a 1-2 punch. \n\n\r\n              Murray cut to the basket for a lay-in, Young hit a floating jumper, Murray scored on another drive to the hoop, and Young finished off the lightning-quick spurt with a 3-pointer. \n\n\r\n              Just like that, the Hawks were up 107-98, forcing Minnesota to call a timeout. \n\n\r\n              It didn't help. Atlanta pulled away down the stretch, turning what looking like a Timberwolves blowout into a Hawks rout. \n\n\r\n              Edwards and the Timberwolves shredded Atlanta in the first half, leading by as many as 21 on 67.4% shooting from the field.\n\n\r\n              About the only thing that went wrong for the Timberwolves was Kyle Anderson missing a lay-up just before the buzzer sounded to end the second period.\n\n\r\n              Edwards scored 20 points over the first two quarters, knocking down four of five 3-pointers and eight of nine overall. He added five assists, three rebounds and one steal without committing any turnovers.\n\n\r\n              While it was a big night offensively for Murray, Snyder was just as impressed with the guard's defensive effort against Edwards.\n\n\r\n              The Timberwolves star was held to 5-of-12 shooting over the final two quarters, largely because of Murray's effort.\n\n\r\n              “That was part of Dejounte's night,\" Snyder said. “The stat sheet says he had 41 points, but defensively, anytime you see guys up on the ball, working, competing, it's inspirational to the guys behind you.” \n\n\r\n              After the blistering first-half performance, Minnesota was held to 13 of 44 shooting (29.5%) the rest of the way.\n\n\r\n              Jalen Johnson got his second straight start for the Hawks after Saddiq Bey started the first two games at strong forward.\n\n\r\n              Johnson had 12 points and five rebounds, while Bey chipped in with 11 points and six rebounds coming off the bench.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Return home to face the NBA champion Denver Nuggets on Wednesday. \n\n\r\n              Hawks: Host the Washington Wizards on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996316.8791318
}