{
  "game_id": "0022300217",
  "espn_id": "401584845",
  "date": "Nov 20, 2023",
  "matchup": "CHA vs. BOS",
  "headline": "Miles Bridges' 3-pointer with 6.6 seconds left in OT helps Hornets beat Celtics; Tatum scores 45",
  "body": "CHARLOTTE, N.C. -- — Miles Bridges made the most of his first NBA start in 586 days.\n\n\r\n              Bridges hit a 3-pointer with 6.6 seconds left in overtime and the Charlotte Hornets snapped a six-game home losing streak with an improbable 121-118 come-from-behind win over the red hot Boston Celtics on Monday night.\n\n\r\n              LaMelo Ball finished with 36 points, nine rebounds and eight assists, and Gordon Hayward added 20 points for the Hornets, who battled back from an 18-point deficit to end Boston's six-game win streak.\n\n\r\n              Jayson Tatum had 45 points, but missed a free throw with 5.2 seconds left that would have tied the game after getting fouled on a 3-point shot. He made the first two before the crucial miss on the third one.\n\n\r\n              “I couldn’t believe he missed that last one, but we got the win and that is all that matters,” Bridges said.\n\n\r\n              Tatum couldn't believe it, either.\n\n\r\n              “Was I surprised? Yeah, I was surprised,” he said “It felt good, just didn't go in.”\n\n\r\n              He was more upset over the Celtics surrendering an 11-point lead with six minutes to play.\n\n\r\n              “We have to regroup,” Tatum said. \"We had six wins in a row and it's easy to get complacent and we paid for it tonight.”\n\n\r\n              After Tatum's miss, the Celtics fouled Hayward, who made two free throws to put Charlotte back up by three points with 0.8 left. Bridges stole the inbounds pass to seal the win.\n\n\r\n              Mark Williams finished with 18 points and 16 rebounds for Charlotte. Coach Steve Clifford called it his best game since joining the Hornets.\n\n\r\n              Clifford said it was an important win for his team, but added “this league is not about a great win. it’s about can we come back and play well Wednesday night?\"\n\n\r\n              Peyton Pritchard had 21 points on five 3s for Boston, which had its six game winning streak snapped.\n\n\r\n              Clifford said the decision to replace P.J. Washington with Bridges in the starting lineup is something that has been in the works for weeks. Charlotte also needed a spark after losing its last four games.\n\n\r\n              Bridges had averaged 18 points is his first two games back after missing all of last season and the first 10 games of this year while serving a 10-game suspension for his role in a domestic violence case.\n\n\r\n              Bridges didn't shoot the ball well, but finished with 14 points and 15 rebounds while playing a team-high 45 minutes.\n\n\r\n              Tatum tied a career-high with 31 points in the first half and Pritchard added four 3s as the Celtics built a 65-54 at the break.\n\n\r\n              But Charlotte trimmed the lead to two with 22 seconds left when Williams put back an offensive rebound.\n\n\r\n              Jrue Holiday was fouled on the ensuing possession and had a chance to make it a two-possession game but missed both free throws with 10.3 seconds left, giving the Hornets a chance to tie or win the game.\n\n\r\n              Ball received the side inbounds pass, drove to the basket and scored to tie it with 7.2 seconds left.\n\n\r\n              Sam Houser had a chance to win it at the end of regulation, but missed at the buzzer.\n\n\r\n              It was another huge performance for Ball, who is averaging 32 points over his last eight games.\n\n\r\n              The former All-Star was big in overtime, scoring on a left-handed layup high off the glass to give Charlotte the lead. With the game tied, Ball found Bridges on the left wing for an open look and the left-hander hit the go-ahead 3 to break the tie.\n\n\r\n              “I'm a little more healthy and I have some games under my belt,\" said Ball, who was limited to 36 games last year due to ankle injuries. “My game has finally got there and I'm feeling better now.” \n\n\r\n              UP NEXT\n\n\r\n              Celtics: Return home to face Milwaukee on Wednesday night.\n\n\r\n              Hornets: The Hornets wrap up a five-game homestand on Wednesday night against Washington.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995661.5657442
}