{
  "game_id": "0022301084",
  "espn_id": "401585712",
  "date": "Mar 31, 2024",
  "matchup": "CHI @ MIN",
  "headline": "DeRozan, Caruso light it up as Bulls knock off Timberwolves 109-101",
  "body": "MINNEAPOLIS -- — DeMar DeRozan had 27 points and eight assists and Alex Caruso added 21 points on a season-high seven 3-pointers as the hot-shooting Chicago Bulls beat the Minnesota Timberwolves 109-101 on Sunday.\n\n\r\n              Nikola Vucevic had 19 points and eight rebounds, Coby White scored 17 and Ayo Dosunmu added 13 for the Bulls, who shot 52.5% from the floor, including 58.6% from 3-point range.\n\n\r\n              Anthony Edwards led the Timberwolves with 22 points and 11 rebounds, but he also had six of Minnesota's 14 turnovers. Rudy Gobert had 19 points and 10 boards, Mike Conley finished with 19 points and seven assists, and Naz Reid had 14 points for the Timberwolves, who were trying to clinch a Western Conference playoff spot.\n\n\r\n              “They certainly were hot, but I think we’ve got to do a better job of a) containing the ball, and b) closing out with a little bit more urgency,” Timberwolves coach Chris Finch said. \"In the first half in particular, I think we got the game plan wrong, so I’ll take responsibility for that. Then we finally adjusted it and started to look a little more like ourselves defensively. \n\n\r\n              “But by that time, they had seen all their shots go in, so that’s a confident team when it happens.”\n\n\r\n              Caruso's impact wasn't limited to shooting. He also had five assists, five rebounds and five steals, and he kept Edwards in check on defense, holding Minnesota's leading scorer to 0 for 5 from beyond the arc.\n\n\r\n              “It’s amazing to have a teammate like that,” DeRozan said. “For him to carry us tonight, what he did on both ends of the floor, it’s just a sign of his greatness and the heart and mindset he had going into the game.”\n\n\r\n              Minnesota trailed by as much as 16 in the third quarter. But the Wolves chipped away, finally taking the lead 98-96 on Gobert's 3-point play with 5:21 remaining. That was part of a 9-0 run that brought the packed Target Center crowd to its feet.\n\n\r\n              But DeRozan answered with a steal and a transition layup, then buried a 3 to put the Bulls back on top. \n\n\r\n              Caruso then hit his seventh 3-pointer and White scored on a fast break as the Bulls took a 106-99 lead with 2:03 to play. \n\n\r\n              “We knew it was going to come,” DeRozan said of Minnesota's second-half surge. “They’re the top of the Western Conference for a reason. ... We couldn’t let that knock us off our rhythm. We stayed with it, we understood what we had to do, we made some big plays once they took the lead and we held it after that.”\n\n\r\n              Caruso was on fire in the first quarter, making all four of his 3-point attempts, while the Bulls hit 65% as a team and took a 33-22 lead after one quarter.\n\n\r\n              Minnesota cut the lead to six early in the second quarter, but a Vucevic hit a set shot, a turnaround jumper and a 3-pointer to cap a 12-2 run that put the Bulls on top 52-36. DeRozan pumped in nine points in the last three minutes of the quarter and Chicago led 64-54 at the break.\n\n\r\n              It was Minnesota’s first home game since owner Glen Taylor ended talk of selling the team, saying on Thursday that Alex Rodriguez and Mark Lore missed a deadline to purchase a majority stake in the franchise.\n\n\r\n              Taylor and his wife, Becky, were in attendance in their usual courtside seats on Sunday, while Rodriguez and Lore did not make an appearance.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Atlanta on Monday.\n\n\r\n              Timberwolves: Host Houston on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995859.738195
}