{
  "game_id": "0022000375",
  "espn_id": "401267535",
  "date": "Feb 09, 2021",
  "matchup": "BKN @ DET",
  "headline": "Grant scores 32, Pistons beat Durant-less Nets 122-111",
  "body": "DETROIT -- — The Brooklyn Nets are dealing with a bit of a challenge while Kevin Durant is sidelined.\n\n\r\n                    It's not going well at the moment.\n\n\r\n                    Jerami Grant equaled a career high with 32 points and the Detroit Pistons took advantage of Durant's absence Tuesday night, beating the Brooklyn Nets 122-111. \n\n\r\n                    It was the third straight loss for the Nets, who are without Durant because of coronavirus protocols. He can't return until later this week.\n\n\r\n                    Coach Steve Nash wasn't pleased with his team's response Tuesday, especially at the start. Brooklyn fell behind the last-place Pistons by 20 points in the second quarter.\n\n\r\n                    “This is professional sports. The other team is talented and capable, and we’re short-handed,\" Nash said. “We’ve got a lot to clean up. Number one thing is just that attitude and that competition level and that connectivity.”\n\n\r\n                    Detroit snapped a four-game losing streak and showed the same type of spirit that was on display in its previous game, a double-overtime loss in Los Angeles against the defending champion Lakers. \n\n\r\n                    “I like our foundation. I like the pieces we have,” Pistons coach Dwane Casey said. “We’re not a finished product. ... We’ve just got to grow and get the pieces together.”\n\n\r\n                    The Nets were without both Durant and Kyrie Irving (right finger sprain) in a loss to Philadelphia on Saturday night. Irving returned against Detroit and scored 27 points.\n\n\r\n                    James Harden added 24 for Brooklyn, but it wasn't enough for the Nets to overcome a poor start. The Pistons shot 66.7% from the field in the first quarter and led by 12 at the end of the period. The lead reached 20 in the second.\n\n\r\n                    “We look very average, and we have the talent that the eye test presents, that we should be dominating,\" Irving said. \"We’re dealing with a lot of the reality that we’re putting this together on the fly.”\n\n\r\n                    Brooklyn rallied to within two in the third, but a 3-pointer by Grant gave the Pistons a 94-86 advantage at the end of that quarter, and Detroit was able to hold on. \n\n\r\n                    Pistons rookie Saddiq Bey scored all of his 15 points in the final period, making all six of his attempts from the field.\n\n\r\n                    Grant also tied his career high with 32 points in the loss to the Lakers.\n\n\r\n                    Durant was removed from the starting lineup Friday, then was cleared to play before he was pulled in the third quarter of a loss to Toronto. He's now missed two full games since then.\n\n\r\n                    It's been a tough stretch for the Nets, but plenty of other teams are also dealing with periods of uncertainty this season.\n\n\r\n                    “That’s the way this year’s going to be,\" Nash said. \"We can’t make excuses.”\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Irving and former Piston Bruce Brown were both called for technical fouls in the third quarter. ... Brooklyn signed F Noah Vonleh on Monday. He played a bit against Detroit but did not score.\n\n\r\n                    Pistons: Grant scored 29 points in the first three quarters.\n\n\r\n                    TAKING ADVANTAGE\n\n\r\n                    Detroit has only six victories on the season, but the last three were against the 76ers, Lakers and Nets — three good teams. They were without key players, however: Philadelphia was missing Joel Embiid, Los Angeles was without Anthony Davis, and Brooklyn didn't have Durant.\n\n\r\n                    NEWCOMER\n\n\r\n                    This was Detroit’s first game since acquiring Dennis Smith Jr. from New York in a deal that sent Derrick Rose to the Knicks. Smith couldn’t play Tuesday because of health and safety protocols. Casey said Smith was still in quarantine, but he was hoping Smith could be part of practice Wednesday.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Host the Indiana Pacers on Wednesday night. Brooklyn went 1-2 against Indiana in 2019-20.\n\n\r\n                    Pistons: Host Indiana on Thursday night. Detroit went 3-1 against Indiana last season.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997505.342604
}