{
  "game_id": "0022400528",
  "espn_id": "401705094",
  "date": "Jan 10, 2025",
  "matchup": "SAC @ BOS",
  "headline": "Domantas Sabonis has 23 points and career-high 28 rebounds as Kings rally to beat Celtics 114-97",
  "body": "BOSTON -- — Domantas Sabonis had 23 points and a career-high 28 rebounds and the Sacramento Kings used a fourth quarter rally to beat the Boston Celtics 114-97 on Friday night. \n\n\r\n              The victory extended Sacramento's season-high win streak to six games. It was Sabonis’ 33rd double-double of the season and 24th game of his career with 20 or more rebounds. Entering Friday, the NBA’s previous high for rebounds in a game this season was 23 by San Antonio's Victor Wembanyama.\n\n\r\n              DeMar DeRozan added 24 points and nine assists, and Malik Monk finished with 22 points and eight assists.\n\n\r\n              Boston has lost two of its last three. \n\n\r\n              Jaylen Brown led the Celtics with 28 points, Kristaps Porzingis added 22 points and 10 rebounds, and Jayson Tatum had 15 points and 12 rebounds.\n\n\r\n              The game was tied at 76 after three quarters. Sacramento then took command, opening the fourth on a 24-9 run to take a 100-85 lead with 6:03 to play.\n\n\r\n              Takeaways\r\n              Kings: Another strong effort by Sacramento, which outscored Boston 48-40 in the paint and held a 56-43 rebounding edge. And they did it without De’Aaron Fox, who missed his third straight game with a bruised glute.\n\n\r\n              Celtics: After a 3-1 road trip that included wins over Minnesota and Denver, Boston dropped to 13-7 at TD Garden this season. \n\n\r\n              Key moment\r\n              With the Kings leading 84-79, Sabonis grabbed his 24th rebound of the game and stepped back for an uncontested 3-pointer as part of Sacramento’s run to open the fourth quarter. It was a microcosm of a night in which the Kings outhustled the Celtics to loose balls. Sacramento outscored Boston 38-21 in the final period.\n\n\r\n              Key stat\r\n              Tatum’s eight turnovers are most by a Celtics player this season.\n\n\r\n              Up next\r\n              Kings visit Chicago on Sunday, and Celtics host New Orleans.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997339.555469
}