{
  "game_id": "0021701037",
  "espn_id": "400975783",
  "date": "Mar 17, 2018",
  "matchup": "BKN vs. DAL",
  "headline": "Nets blow double-digit lead, still beat Mavs 114-106",
  "body": "NEW YORK --  Nets coach Kenny Atkinson tinkered with his starting lineup, hoping to cure his young team's recent defensive lapses.\n\nIt paid off quickly in a St. Patrick's Day matchup between the fifth and sixth worst teams in the NBA.\n\nRondae Hollis-Jefferson scored 23 points in his second straight start at power forward, D'Angelo Russell had 22 points and Brooklyn recovered after blowing a double-digit lead to beat the Dallas Mavericks 114-106 on Saturday night.\n\nThe Nets, who struggled in the second half of their previous three losses, held Dallas to just 17 points in the last quarter, limiting the league's sixth-worst team to just 7 for 20 from the field.\n\n\"Having Jarrett (Allen) and Rondae out there, I thought it was huge. We had some more size,\" Atkinson said. \"I thought Jarrett came over and affected more shots. Rondae, obviously, gives us the rebounds, so I do think that's a part of it.\"\n\nDeMarre Carroll had 19 points and 12 rebounds, and Caris LeVert and Joe Harris each chipped in 11 points for the Nets, who snapped a three-game skid. Hollis-Jefferson added five rebounds.\n\nDallas rookie Dennis Smith Jr. scored 21 points but left with 3:30 remaining in the third quarter, spraining his left ankle after he stepped on Spencer Dinwiddie's left foot. X-rays were negative, though the 20-year-old had his left foot in a walking boot as a precaution.\n\nDwight Powell had 18 points and reserve Yogi Ferrell had 12 points and 12 assists for the Mavericks, who dressed only 10 players.\n\nDallas was also sluggish early after losing in overtime Friday night at Toronto. The Nets took advantage, jumping to an 11-0 lead in the first quarter.\n\nAfter blowing leads of 14 and 13 in its previous two losses, Brooklyn led by 14 Saturday before the Mavericks recovered late in the second quarter, cutting the lead to 59-56 with 9-2 run to end the half.\n\nSmith gave Dallas its first lead in the third quarter with 8:06 remaining, stripping the ball from Russell and dunking to cap an 8-2 run that put the Mavericks ahead 70-68. Dirk Nowitzki later hit a 3 and Smith followed with a pull-up jumper to put the Mavs up 80-70 with 5:36 left before Brooklyn charged back.\n\nThe Nets punched back with Carroll and Hollis-Jefferson combining for 10 straight points, capped by Hollis-Jefferson's jumper with 3:56 left in the third period that evened it at 80 before Smith exited the game.\n\nThe Nets wrestled the game away with their stifling defense in the fourth quarter a night after they gave up 34 points to the 76ers.\n\nSTILL GOING STRONG\n\nNowitzki played in his 1,463rd game, moving past Kevin Garnett into fifth place in the NBA career list. The 39-year-old Nowitzki, who last summer signed on for two more years with the Mavericks, also played Friday night in Toronto and has played in 10 back-to-back sets this season.\n\n\"It just means that I've been around for a long time, been fortunate, some injuries, only missed a few games here and there every season,\" said Nowitzki, who scored 13 points.\n\nTIP-INS\n\nMavericks: Veteran guard J.J. Barea was inactive due to a left rib muscle strain. Forwards Nerlens Noel and Harrison Barnes were held out to rest.\n\nNets: Guard Allen Crabbe (illness) was ruled out. He was replaced in the starting five by reserve Joe Harris. ... Have eclipsed 30 points in the first quarter of their last three games. ... F Dante Cunningham was held out due to a concussion he suffered Friday night in Philadelphia.\n\nUP NEXT\n\nMavericks: Close out their four-game trip at New Orleans on Tuesday.\n\nNets: Host Memphis on Monday.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993809.315593
}