{
  "game_id": "0021800114",
  "espn_id": "401070795",
  "date": "Nov 01, 2018",
  "matchup": "SAC @ ATL",
  "headline": "Fox logs first triple-double as Kings rout Hawks 146-115",
  "body": "ATLANTA --  De'Aaron Fox's teammates made sure he knew he was close to his first career triple-double.\n\nFox reached the milestone in a rout inspired by a similarly lopsided loss in Sacramento's last visit to Atlanta.\n\nFox set career highs with 31 points, 15 assists and 10 rebounds, and the Kings beat the Hawks 146-115 on Thursday night for their fifth straight win.\n\nFox didn't have to look at the scoreboard to know he was approaching the triple-double.\n\n\"They told me,\" Fox said of his teammates. \"It was like, `Go get it.\"\n\nFox's 10th rebound completed the memorable achievement. The second-year guard's previous career highs were 16 points, nine rebounds and 10 assists.\n\nThe Hawks had no answer for Fox's quickness and shooting. He went 3 for 4 from 3-point range.\n\n\"Fox is one of the, if not the, fastest guys in the league,\" Hawks coach Lloyd Pierce said. \"He's got a different motor. He sets the pace for them at all times. When he's hitting 3s, he's hard to stop.\"\n\nFox and the Kings did not forget an ugly 126-80 loss at Atlanta on Nov. 15, 2017, that was the Hawks' most lopsided win in franchise history.\n\n\"This was a game that maybe meant a little more,\" Kings coach Dave Joerger said.\n\nEven so, Joerger said he wasn't expecting to win by 31 points.\n\n\"Nobody saw this coming,\" he said.\n\nLast season's Kings-Hawks game was a matchup of last-place teams. The Kings showed the Hawks the difference one season can make.\n\n\"They went through struggles last year and you see what they're able to do now,\" Hawks rookie point guard Trae Young said. \"Of course, you never want to lose like this.\"\n\nBuddy Hield scored 27 points and Nemanja Bjelica had 19 for the Kings (6-3), whose winning streak includes four straight against Eastern Conference teams, including the last three on the road.\n\nThe Kings averaged 110.8 points over the first four games of the streak. They moved past that number with a full period remaining, carrying a 115-87 lead into the final quarter.\n\nAfter leading by only five points at halftime, the Kings outscored the Hawks 46-23 in the third. Fox had 21 points in the period.\n\nSacramento maintained its up-tempo pressure in the final period. Fox, Hield and other starters didn't leave for good until the final few minutes. The Kings scored at least 31 points in every quarter.\n\nJeremy Lin scored 23 points for the Hawks, who have lost four straight.\n\nTIP-INS\n\nKings: F Iman Shumpert had eight points in his return after he rested during a 107-99 win at Orlando on Tuesday night. ... Sacramento snapped a string of 11 straight losses in Atlanta with its first road win over the Hawks since March 3, 2006. ... Marvin Bagley III had 18 points.\n\nHawks: F Alex Poythress had nine points and eight rebounds after missing two games with a left knee sprain and bone bruise. ... Alex Len had 11 points. ... The Hawks made 60.5 percent of their first-half shots (23 of 38), easily a season-best performance. They finished at 48.3 percent.\n\nSLOW START\n\nYoung recovered from a slow start to post a double-double with 14 points and 10 assists. He had four turnovers with two points in the first period and finished with eight of the Hawks' 22 turnovers.\n\nHUERTER HURT\n\nPierce said there was no word on the severity of the sprained right ankle for guard Kevin Huerter, who left with 4:27 remaining in the first period. The rookie limped off the court after Hield crashed into the back of his leg while diving for a loose ball.\n\nUP NEXT\n\nKings: A four-game road trip ends at Milwaukee on Sunday.\n\nHawks: At home against the Miami Heat on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994229.145447
}