{
  "game_id": "401809950",
  "espn_id": "401809950",
  "date": "Oct 24, 2025",
  "matchup": "DAL vs WSH",
  "headline": "Kyshawn George scores 34 as Wizards turn away Cooper Flagg-fueled rally to beat Mavs",
  "body": "DALLAS -- — Kyshawn George scored a career-high 34 points, and the Washington Wizards turned away a Cooper Flagg-fueled rally for a 117-107 victory over Dallas on Friday night, dropping the Mavericks and their No. 1 overall pick to 0-2.\n\n\r\n              Flagg led a second-half comeback from a 17-point deficit by scoring nine consecutive points in the fourth quarter and finishing with 18.\n\n\r\n              Anthony Davis, in another rough outing to start his first full season since coming to Dallas in the Luka Doncic trade, missed two free throws with a chance to get the Mavs within two points with five minutes remaining.\n\n\r\n              Davis' poor pass to Flagg in the backcourt on the next possession was followed soon after by two more turnovers from Flagg as Dallas finished with 21 turnovers after committing 16 in a 125-92 loss to San Antonio in Flagg's debut. Flagg had five turnovers, and P.J. Washington Jr. had eight to go with 18 points and nine rebounds. \n\n\r\n              Davis led Dallas with 27 points, just as he did against the Spurs, but looked rough around the rim again while finishing 9 of 19 from the floor. He had 13 rebounds.\n\n\r\n              Flagg had the first 3-pointer and first dunk of his career in the first half. Then came a soaring two-handed dunk, a long jumper with a toe on the 3-point line and a 3 during the fourth-quarter surge.\n\n\r\n              George was 11 of 15 from the field and 7 of 9 from long range, punctuated by a corner 3 for a 113-103 lead with two minutes to go. He had 11 rebounds.\n\n\r\n              Rookie Tre Johnson, the former Texas Longhorn and sixth overall pick who played for a Dallas high school, scored 10 of his 17 points in the second quarter. \n\n\r\n              Up next\r\n              Wizards: Home opener against Charlotte on Sunday.\n\n\r\n              Mavericks: Against Toronto on Sunday as five-game homestand continues.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042494.310157
}