{
  "game_id": "0021500856",
  "espn_id": "400828743",
  "date": "Feb 25, 2016",
  "matchup": "MIL @ BOS",
  "headline": "Celtics beat Bucks 112-107 to earn 9th straight win at home",
  "body": "BOSTON -- After the Celtics dropped two of their first three games following the All-Star break, coach Brad Stevens all but reduced his message to one word as his team prepared to open a season-high, five-game homestand: pride.\n\"This is a pride game. We really have to come out and get this first win,\" forward Jae Crowder recalled from Stevens' pregame speech.\nMessage received.\nIsaiah Thomas scored 27 points, including eight in the fourth quarter, and the Celtics recorded their ninth straight home victory, 112-107 over the Milwaukee Bucks on Thursday night.\nCrowder added 20 points and eight rebounds. Avery Bradley finished with 18 points. All five Boston starters were in double figures.\n\nCrowder said he is equally taking a lot of pride in being the \"glue guy\" for a group still learning to harness its youthful energy.\n\"I just want to make that winning play,\" he said. \"Whether it be that rebound, that steal, that shot. I want to do whatever it takes to win and whatever it takes to hold this team together.\"\nThe Celtics led by as many as 18 before Milwaukee trimmed it to single digits.\nBut Boston was able to beat back the threat thanks to some baskets late in the shot clock, and stops on the defensive end.\nJabari Parker led Milwaukee with 22 points and added five assists. Khris Middleton had 21 points and six assists, and Greg Monroe scored 20 points off the bench.\nMilwaukee got the lead down to five on alley-oop pass from Middleton to Parker with just over 6 minutes to play.\nThe Celtics promptly responded with a 10-4 run, which included seven points from Thomas, to push the lead back up to 106-95.\nAnother Milwaukee spurt got it back to 106-100. Then after a folly-filled possession by the Celtics that included players slipping, a diving save and an eventual turnover by Bradley, the lead was reduced to four on a dunk by Middleton.\nBoston's next possession looked just as doomed before Thomas drove and at the last second flipped a pass behind his head to Crowder in the corner, who promptly drilled 3-pointer.\nMilwaukee stayed with its recent lineup adjustment, going with O.J. Mayo and Miles Plumlee in place of Monroe and Michael Carter-Williams for the sixth consecutive game.\n\"The lineup change, we've had confidence, so that's not the problem,\" Bucks coach Jason Kidd said. \"We've got to take care of the ball. We had some turnovers there, also offensive rebounds. Again, we gave up too many of those tonight against a very talented team.\"\nTIP-INS\nBucks: Milwaukee outscored Boston 68-52 in the paint for the game. ... Parker had eight straight Milwaukee points at one point in the fourth quarter.\nCeltics: Thursday was the first double-figure scoring game for Amir Johnson since Jan. 15. He had totaled 10 points and seven rebounds in his previous four games. Kelly Olynyk missed his fourth straight game with a right shoulder sprain.\nFOUL GAME\nCrowder was whistled for his fourth foul within the first two minutes of the third quarter. Stevens initially allowed them to remain on the court, but pulled him few minutes later after Crowder was called for his fifth foul, and then a technical. Milwaukee promptly went on an 8-0 run to close within 10. But Stevens said he doesn't second-guess deciding to leave players on the floor. \"This might sound crazy, but if it was nine years ago when I first got into coaching, I would have taken him out with four and been nervous to put him back in,\" Stevens said. \"If they foul, they foul. We'll figure it out. A lot of times it really hasn't hurt us until today.\"\nGLOWING ENDORSEMENT\nFormer All-Star guard Joe Johnson is on the open market after being waived earlier Wednesday by the Brooklyn Nets. Kidd, who coached Johnson during Kidd's lone season in Brooklyn in 2013-14, said he would be a great addition to any team that might sign him. \"Joe is a true competitor. I wish him the best wherever he ends up,\" Kidd said. \"He's not afraid of having the ball late, so they get a closer. Wherever he ends up, they got a chance to win.\"\nUP NEXT\nBucks: Host Detroit on Saturday.\nCeltics: Host Miami on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994029.77306
}