{
  "game_id": "0022400455",
  "espn_id": "401705021",
  "date": "Jan 01, 2025",
  "matchup": "ORL @ DET",
  "headline": "Jaden Ivey injures leg in 4th quarter in Pistons' victory over the Magic",
  "body": "DETROIT -- — Jaden Ivey sustained what appeared to be a serious leg injury after scoring 22 points in the Detroit Pistons' 105-96 victory over the Orlando Magic on Wednesday night.\n\n\r\n              With 10:07 to play and Detroit leading 84-79, Ivey and Orlando's Cole Anthony were going for the ball when Anthony slipped and fell. His momentum carried him into Ivey's planted leg, and the 22-year-old immediately fell to the floor, grabbing his left shin in obvious agony.\n\n\r\n              After a lengthy delay, Ivey was placed on a stretcher and wheeled off the floor.\n\n\r\n              The Magic had scored the first four points of the quarter, but Tim Hardaway Jr. scored nine points in the next 6:30 to give the Pistons a 99-90 lead.\n\n\r\n              Cade Cunningham added 19 points and nine assists for the Pistons, who have won four of five. Jalen Duren added 18 points and 11 rebounds to help Detroit overcome 24 turnovers.\n\n\r\n              Jalen Suggs had 24 points for Orlando, and Kentavious Caldwell-Pope added 21. The Magic have lost six of nine.\n\n\r\n              Takeaways\r\n              Magic: Orlando has five players who attended college in Michigan, but former Michigan Wolverines Franz (oblique) and Moritz Wagner (knee) are out with long-term injuries. Caleb Houston and Jett Howard also went to Michigan, and Gary Harris attended Michigan State.\n\n\r\n              Pistons: Cunningham (knee) didn't attack the glass as much as he does when completely healthy — he only had two rebounds in the first half — but didn't seem limited while cutting and driving. \n\n\r\n              Key moment\r\n              The Pistons led 73-55 with nine minutes left in the third quarter and appeared to be cruising to an easy victory. However, the Magic went on a 20-7 run to cut it to 80-75. \n\n\r\n              Detroit turned the ball over eight times in eight minutes to help Orlando get back into the game, but scored the final four points of the quarter to take a nine-point lead.\n\n\r\n              Key stat\r\n              Caldwell-Pope had 14 points on 5-for-5 shooting in the first half, hitting three 3-pointers. His teammates were 13 of 39 overall and 0 of 10 from behind the arc.\n\n\r\n              Up next\r\n              Both teams are back in action Friday. Orlando is at Toronto, and Detroit is home against Charlotte.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997553.620255
}