{
  "game_id": "0022201182",
  "espn_id": "401469337",
  "date": "Apr 04, 2023",
  "matchup": "CHI vs. ATL",
  "headline": "Bogdanovic's 26 lead Young-less Hawks past Bulls 123-105",
  "body": "CHICAGO -- — Bogdan Bogdanovic scored 26 points and the Atlanta Hawks overcame the loss of top scorer Trae Young to beat the Chicago Bulls 123-105 on Tuesday night.\n\n\r\n              Young, who leads the Hawks with a 26.2 scoring average, didn't play due to a non-COVID illness. Forward De’Andre Hunter missed his third consecutive game because of a left knee bruise.\n\n\r\n              But Bogdanovic led the way on 9-of-15 shooting from the field, including 5-of-10 on 3-point attempts.\n\n\r\n              “I tried to put him back in a couple times, but he was tired,” Hawks coach Quin Snyder said. “Which tells me he's good. That means he was playing defense. We know he can shoot the ball.”\n\n\r\n              Atlanta (40-39) opened a two-game lead over the Bulls (38-41), who clinched a play-in berth in the Eastern Conference by virtue of Orlando's loss to Cleveland earlier in the evening.\n\n\r\n              After Zach LaVine opened the game with a basket, the Hawks ran off 13 consecutive points, with Bogdanovic scoring 11 during that span as the Hawks never trailed after that.\n\n\r\n              “We didn't guard the ball well, didn't rotate well and didn't rebound well,” LaVine said.\n\n\r\n              The Bulls managed only seven fast-break points, and the Hawks had a 66-48 advantage in points in the paint. Saddiq Bey added 18 points while Dejounte Murray had 17 and Jaylen Johnson 16.\n\n\r\n              LaVine led the Bulls with 26 points, and DeMar DeRozan added 21 and Nikola Vucevic 19.\n\n\r\n              Without Young or Hunter, Atlanta still managed to expose Chicago’s porous defense by shooting 55.8% from the field (47-for-85), including 10-of-28 shooting from 3-point range. \n\n\r\n              “I think the key thing is we responded collectively, and that's what it takes,” Snyder said. “There was no one guy that said, ‘OK, I'm going to be the guy who closes the door on a run. They did it as a group, and they did it defensively, getting stops at various times.”\n\n\r\n              The Bulls’ defensive efforts were challenged after specialist Alex Caruso committed his second foul six minutes into the game. Caruso returned midway through the second quarter but left two minutes later after being charged with his third foul.\n\n\r\n              The Hawks led by as many as 20 points after Bey turned a loose-ball sequence into a reverse layup with 1:11 remaining in the second quarter.\n\n\r\n              “Every one of these games is a must-win game for us,” LaVine said. \"Obviously we didn't do good enough. They wanted it more than us. It's tough to have that type of result at this point in the season.\n\n\r\n              A restless crowd booed the Bulls, who responded with an 8-0 run capped by a LaVine 3-pointer to end the quarter.\n\n\r\n              TIP-INS:\n\n\r\n              Hawks: Young didn't make the trip to Chicago, and Snyder was unsure when he would rejoin the team. ... \n\n\r\n              UP NEXT\n\n\r\n              Hawks: Wednesday vs. Washington.\n\n\r\n              Bulls: Wednesday at Milwaukee.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994461.3394969
}