{
  "game_id": "0021500025",
  "espn_id": "400827912",
  "date": "Oct 30, 2015",
  "matchup": "CHI @ DET",
  "headline": "Pistons improve to 3-0, outlast Bulls 98-94 in OT",
  "body": "AUBURN HILLS, Mich. -- Stan Van Gundy summed up Detroit's promising start to the season with a bit of self-serving humor.\n\"I'm in charge of the defense, and my assistants, I've given them the offense,\" he said. \"They've got to do a better job.\"\nThe Pistons' coach said that with a smile, but there was no question which end of the court was more impressive Friday night for Detroit, which held off the Chicago Bulls 98-94 in overtime. The Pistons held Derrick Rose scoreless for the first three quarters.\n\nDetroit is 3-0 for the first time since winning its first four games in 2008-09. The Pistons have held every opponent to less than 95 points.\nMarcus Morris scored 26 points, and Andre Drummond had 20 points and 20 rebounds for Detroit. The Pistons scored the first seven points of overtime, taking a 90-83 lead on Anthony Tolliver's 3-pointer.\nRose finished with eight points, and Jimmy Butler led the Bulls with 23. Chicago was trying for its first 3-0 start since 1996-97, when the Bulls won their first 12 games.\nReggie Jackson added 22 points, seven assists and seven rebounds for the Pistons. Morris, who was acquired in an offseason deal with Phoenix, scored 15 points in the third quarter.\n\"He's just playing ball. He's playing hard. He really got it going tonight for us,\" Jackson said of Morris. \"We couldn't find the bottom of the basket, but he was hot and we needed him to be hot.\"\nDetroit won despite shooting 6 of 28 from 3-point range and 14 of 28 from the free throw line.\nNeither team gave ground defensively in the last minutes of regulation. The Pistons and Bulls traded shot-clock violations, and when Chicago ended up with a chance to hold for the last shot, Rose's attempt from the perimeter wasn't close.\n\"(Drummond) took away my drive,\" Rose said. \"I should have pump-faked, but like I said it's a learning experience.\"\nMorris opened the scoring in overtime with a jumper and Jackson added a driving layup, putting the Pistons up by four before Tolliver's 3-pointer.\nThe Pistons scored more points in overtime (15) than they did in the second quarter (12). There were 15 lead changes and 18 ties.\nEASING UP\nThe Pistons had to start the season with three games in four days. Now they will play only once in the next six.\n\"We did work them very hard for the month of October. I think we're in very good shape, and then we eased up on them Sunday and Monday, heading into the week,\" Van Gundy said. \"They've had a chance to get their legs back, but the base of conditioning they have has allowed guys to play big minutes and go really, really hard.\"\nEXTRA CHANCES\nThe Pistons finished with 20 offensive rebounds to Chicago's eight, and the Bulls turned the ball over 20 times. Detroit ended up attempting 20 more field goals than the Bulls.\n\"It is going to be tough to win when that happens,\" Chicago coach Fred Hoiberg said. \"We had an opportunity on that last shot in regulation even though we gave the ball up that many times, but we have to get that cleaned up.\"\nTIP-INS\nBulls: Rose had six assists, five turnovers and shot 4 of 13 from the field. ... Nikola Mirotic had 22 points, and Pau Gasol added 16 points and 12 rebounds. Butler had 11 rebounds.\nPistons: Jackson surpassed 1,000 assists for his career. ... Drummond had nine offensive rebounds. He has looked better on free throws this season, but went 4 of 10 on Friday.\nUP NEXT\nBulls: Host Orlando on Sunday night.\nPistons: Host Indiana on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764993985.578079
}