{
  "game_id": "0022200043",
  "espn_id": "401468198",
  "date": "Oct 23, 2022",
  "matchup": "LAC vs. PHX",
  "headline": "Suns beat Clips 112-95, Paul 3rd NBA player with 11K assists",
  "body": "LOS ANGELES -- — Chris Paul was back in a familiar building in a city he still calls home. With his parents, wife, kids and brother looking on, he became the third player in NBA history to reach 11,000 assists.\n\n\r\n              Propelled by Devin Booker's 35 points, the Phoenix Suns beat the Los Angeles Clippers 112-95 on Sunday night.\n\n\r\n              “There’s been a lot of firsts here at the Staples Center,” Paul said before correcting himself. “Well, Crypto arena.”\n\n\r\n              Paul assisted on the Suns’ first basket of the game, a 3-pointer by Booker. Paul followed with an alley-oop pass to Deandre Ayton, who dunked, to give him 11,000 assists.\n\n\r\n              “I honestly didn’t have a clue until I checked out of the game,” he said.\n\n\r\n              Paul joined John Stockton and Jason Kidd as the only players in NBA history with that many assists. Paul also became the first player in the league with 20,000 points and 11,000 assists.\n\n\r\n              “It's amazing,” Suns coach Monty Williams said. “I look at him and I'm like, ‘holy smokes, I get to coach Chris Paul.’”\n\n\r\n              Stockton had 15,806 assists and Kidd, now coach of the Dallas Mavericks, had 12,091. \n\n\r\n              Fittingly, Paul reached the mark against the Clippers, with whom he played for six seasons and is the franchise’s career assists leader. He mentioned former Lob City teammates Blake Griffin, DeAndre Jordan and JJ Reddick for playing roles in his success.\n\n\r\n              Paul credited being a student of the game and his many teammates over his NBA career, now in its 18th season. \n\n\r\n              “I've been fortunate to play for a while now with a lot of great shooters, great players in general,” he said, ticking off such names as David West, Peja Stojakovic and now Booker. “I'm privileged.”\n\n\r\n              Paul finished with seven points, 11 assists and eight rebounds.\n\n\r\n              The Suns didn’t waste any time getting started on the blowout. They raced to an 11-0 lead from the opening tip and led by 20 points at halftime and again in the third.\n\n\r\n              “Book, you could just see his energy,” Paul said. “He got us going and I think we just kept it going.”\n\n\r\n              Marcus Morris scored 22 points, John Wall added 17 and Paul George had 16 in the Clippers’ home opener after winning their first two games on the road. Kawhi Leonard had 11 points and six rebounds in 21 minutes off the bench in his second game of the season.\n\n\r\n              “We got some room to grow,” Leonard said. “I didn't like how some of the times we wasn't in the flow, the offense was very stagnant to me, and we got to get better on the defensive end by rebounding the basketball.”\n\n\r\n              Last season, the Clippers overcame deficits of at least 24 points four times. \n\n\r\n              Not this time. \n\n\r\n              The Clippers got no closer than 10 points on a 3-pointer by George late in the third. Booker and Cameron Payne scored to send the Suns into the fourth leading 86-72.\n\n\r\n              The Clippers were called for offensive fouls on Luke Kennard and Ivica Zubac after getting within 12 early in the final quarter.\n\n\r\n              Cam Johnson, former Clipper Landry Shamet and Booker hit consecutive 3-pointers that stretched the Suns' lead to 99-81, sending the crowd to the exits. \n\n\r\n              TIP-INS\n\n\r\n              Suns: Shamet (left hip strain) and Johnson (right hip contusion) both returned.\n\n\r\n              Clippers: Reggie Jackson remains limited by a groin injury. He was scoreless on 0-for-5 shooting. ... George and Leonard walked to center court to address the fans before the game, with George doing all the talking. He said the team's slogan is Why Not Us. “Let's go get it this year,” George said.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host defending NBA champion Golden State on Tuesday to open a six-game homestand.\n\n\r\n              Clippers: Play at Oklahoma City on Tuesday and Thursday in a two-game trip.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995001.607776
}