{
  "game_id": "0022300995",
  "espn_id": "401585623",
  "date": "Mar 19, 2024",
  "matchup": "MIN vs. DEN",
  "headline": "Jokic's 35 points pace Nuggets in 115-112 win over short-handed Timberwolves after tight finish",
  "body": "MINNEAPOLIS -- — Nikola Jokic had 35 points and 16 rebounds and Michael Porter Jr. scored 13 of his 26 points in the fourth quarter as the Denver Nuggets fended off the undermanned and undersized Minnesota Timberwolves 115-112 on Tuesday night.\n\n\r\n              Jamal Murray added 18 points and 11 assists and Aaron Gordon had 14 points and 11 rebounds for the Nuggets, who blew an 18-point lead in less than 12 minutes before finishing a four-game road trip strong.\n\n\r\n              “You have to put teams away,\" coach Michael Malone said. “That’s something we really have to get better at.”\n\n\r\n              The Nuggets (48-21) moved within percentage points of idle Oklahoma City (47-20) for the Western Conference lead. The Timberwolves (47-22) dropped one game back into third place.\n\n\r\n              Anthony Edwards had 30 points — his fourth straight 30-point game — and eight rebounds and eight assists. The clean look from the wing he created with a crossover dribble for the tie at the buzzer hit the front of the rim, leaving him scoreless in the fourth quarter after the Nuggets cranked up the double teams. The shot was similar, Jokic noted, to the one Edwards missed for the tie at the end of Game 5 in their first-round playoff series last year.\n\n\r\n              Kentavious Caldwell-Pope got knocked down trying to defend Edwards on the final play and was relieved to watch the ball fall short while lying flat on his back.\n\n\r\n              “He ran through me, for sure,” Caldwell-Pope said. “I’m glad he missed it.”\n\n\r\n              Edwards followed a nifty Euro-step layup with a 3-pointer that put the Wolves up 84-82 late in the third quarter and sent the crowd in a frenzy. Neither team had more than a two-possession lead until Jokic drained a 3-pointer to make it 107-99 with 1:45 to go.\n\n\r\n              Mike Conley, who had all of his 13 points in the fourth quarter, swished an off-balance heave from deep with 11.5 seconds left that pulled the Wolves within two points. Jaden McDaniels — who tied his career high with 26 points — made his fourth 3-pointer of the game to cut the lead to one with 4.2 seconds left.\n\n\r\n              But the Nuggets hit all the free throws they needed to down the stretch to seal it.\n\n\r\n              The Timberwolves played at home for the first time in 15 days and without their top three big men, a case of bad timing against the defending champions and Jokic. \n\n\r\n              With Karl-Anthony Towns (knee) out indefinitely and Rudy Gobert (ribs) sidelined for a third straight game, Naz Reid (head) joined them on the inactive list after getting hurt the night before in a win at Utah. Jokic had 40 pounds and three inches on Kyle Anderson, who with Luka Garza drew the bulk of the work defending the two-time NBA MVP.\n\n\r\n              “It’s really hard to play against a team that they’re missing a lot of guys,” Jokic said. “Of course the other guys are playing hard.\"\n\n\r\n              The Nuggets had a 15-point halftime lead by shooting 60% from the floor against the league's top-ranked defense, which was a vastly different in the paint without the long arms of Gobert.\n\n\r\n              “For us to have a showing like we did tonight going against one of the better teams out there, it shows a lot of grit, shows what we’re made of,” Conley said. \n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host New York on Thursday.\n\n\r\n              Timberwolves: Host Cleveland on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996453.544954
}