{
  "game_id": "0022400515",
  "espn_id": "401705081",
  "date": "Jan 08, 2025",
  "matchup": "LAC @ DEN",
  "headline": "Jamal Murray and Russell Westbrook help the Nuggets rout the Clippers, 126-103",
  "body": "DENVER -- — Jamal Murray had 21 points and nine assists, Russell Westbrook added 19 points and eight assists and the Denver Nuggets beat the Los Angeles Clippers 126-103 on Wednesday night in a matchup of short-handed teams.\n\n\r\n              Clippers forward Kawhi Leonard was not available after he flew back to Los Angeles before the game to help his family deal with the wildfires.\n\n\r\n              Nuggets center Nikola Jokic was out for the second straight game due to an illness. Denver is 2/3 without him this season.\n\n\r\n              Norman Powell scored 30 points to finish with a 27.6 average in the Clippers' four games against the Nuggets. James Harden had 16 points and Ivica Zubac added 10.\n\n\r\n              Denver took control with a 20-3 run in the first quarter and led 55-30 late in the second before Los Angeles cut it to 16 at halftime.\n\n\r\n              The Nuggets used another spurt midway through the third quarter to put it away.\n\n\r\n              Takeaways\r\n              Clippers: Powell came into the night hitting 85.2% percent of his free throws but missed 3 of 6 in the third quarter. The team missed 5 of 15 in the period.\n\n\r\n              Nuggets: Coach Michael Malone made a change from Tuesday night by starting DeAndre Jordan in Jokic’s place and bringing Dario Saric off the bench. Jordan finished with a season-high 12 points and tied his season high with nine rebounds.\n\n\r\n              Key moment\r\n              Jordan had a big third quarter. He made two free throws, threw down two alley-oops and tipped in a feed from Westbrook that helped the lead grow from 16 to 27.\n\n\r\n              Key stat\r\n              The Nuggets improved to 8-0 on the second leg of back-to-backs. They are 2-6 in the first game of a set.\n\n\r\n              Up next\r\n              The Clippers return home to play Charlotte on Saturday night. The Nuggets host Brooklyn on Friday night.\n\n\r\n              ------\n\n\r\n              AP NHL: https://www.apnews.com/hub/NHL",
  "source": "espn_api",
  "crawled_at": 1764998037.69506
}