{
  "game_id": "0021900439",
  "espn_id": "401161081",
  "date": "Dec 22, 2019",
  "matchup": "TOR vs. DAL",
  "headline": "Raptors overcome 30-point deficit, beat Dallas 110-107",
  "body": "TORONTO --  Kyle Lowry and the Toronto Raptors used a huge fourth quarter to pull off the NBA’s biggest comeback in a decade.\n\nLowry had 32 points and 10 assists, Chris Boucher scored a career-high 21 points and the Raptors overturned a 30-point deficit to beat the Dallas Mavericks 110-107 on Sunday.\n\nLowry had one fewer point in the fourth (20) than the Mavericks managed as a team (21).\n\n“I’ve never seen anything like it,” coach Nick Nurse said of Lowry’s explosive finish.\n\nIt was the biggest comeback in Raptors history, and the NBA’s first 30-point comeback since Sacramento beat Chicago on Dec. 21, 2009, according to Elias.\n\nPlayers from both sides found the outcome tough to comprehend.\n\n“I’m definitely going to go watch the game again, just to see how exciting this game was and how the fans helped us so much,” Boucher said.\n\nDallas forward Kristaps Porzingis wasn’t interested in a second viewing after making five of 15 shots.\n\n“Tonight was a weird game, honestly,” Porzingis said. “I still can’t process what happened.”\n\nEven Lowry wasn’t sure he wanted another look at the first three quarters.\n\n“I probably won’t enjoy it till later on, fourth quarter,” Lowry joked.\n\nRondae Hollis-Jefferson scored 18 points and Fred VanVleet had 10 as the short-handed Raptors won their fifth straight and improved to 13-3 at home, ending the Mavericks’ seven-game road winning streak.\n\nPorzingis had 19 points and 12 rebounds. Jalen Brunson scored 21 points as Dallas dropped to 2-2 without guard Luka Doncic, who sat for the fourth straight game because of a sprained right ankle.\n\nMavericks coach Rick Carlisle said his team didn’t maintain its aggression after the Raptors started fighting back.\n\n“When you get hit with that kind of force, you’ve got to respond with equal or greater force, and we just didn’t do it soon enough,” Carlisle said.\n\nToronto trailed 83-53 with 2:55 remaining in the third, but used a swarming defense and hot shooting from Lowry to tie the score at 95 with 5 1/2 minutes to go in the fourth.\n\n“They were just taking it to us,” Dallas guard Tim Hardaway Jr. said. “Before you knew it, they cut the lead to 10 and then cut the lead to five.”\n\nHollis-Jefferson made a pair of free throws with 4:31 remaining to put the Raptors up 98-97, their first lead of the second half. Lowry hit a 3 on Toronto’s next possession, making it a four-point game.\n\nA three-point play by Brunson with 1:14 left cut it to 106-105 and Porzingis made a pair from the line with 32 seconds remaining, putting Dallas up one.\n\nLowry fed Boucher for a go-ahead dunk and, after a Dallas timeout, Brunson missed a jumper that would have given the Mavs the lead.\n\nBoucher was fouled as he grabbed the rebound and made both free throws, putting Toronto up by three with 1.6 seconds left. Porzingis launched a game-tying shot from his own side of half before the buzzer but it fell short.\n\nThe Raptors made four of 23 attempts from 3-point range through the first three quarters, then made six of 11 shots from distance in the fourth, four of them from Lowry.\n\nDallas missed 11 straight field goal attempts to begin the game, and didn’t score until Porzingis hit the second of two free throws with 6:43 left in the opening quarter. Dorian Finney-Smith made a 3 with 6:19 left in the first to halt the shooting slump.\n\nThe Mavericks had more turnovers (seven) than made baskets (five) in the first, but Toronto couldn’t take advantage and led 20-17 after one.\n\nDallas used a 16-2 run in the second to lead 51-42 at halftime. The Mavericks led 86-63 through three quarters before matching the biggest blown lead in franchise history.\n\nTIP-INS\n\nMavericks: Dallas G Delon Wright played in Toronto as a visitor for the first time. The Raptors drafted Wright 20th overall in 2015. He played in 172 games with Toronto before being traded to Memphis last season, part of the trade that sent Marc Gasol north of the border. The Raptors honored Wright with a tribute video at the end of the first quarter. … Brunson led Dallas with nine assists. … Six of Dallas’ 12 made baskets in the second were 3-pointers.\n\nRaptors: Lowry had eight rebounds. … C Dewan Hernandez (right ankle) was inactive.\n\nCALL IT A COMEBACK\n\nToronto’s previous biggest comeback was from 25 down at Detroit on Dec. 11, 2010. Jerryd Bayless matched his career high with 31 points as the Raptors beat the Pistons 120-116.\n\nFANTASTIC FOURTH\n\nThe Raptors set a franchise record for points in the fourth quarter with 47. It was Toronto’s biggest single quarter of the season.\n\nLATEST ON LUKA\n\nDoncic worked out and ran sprints on the court before the game, and is expected to take part in Monday’s practice. Asked when Doncic will play again, Carlisle said the four games between Christmas and January are “certainly in play.”\n\nUP NEXT\n\nMavericks: Host San Antonio on Thursday.\n\nRaptors: Visit Indiana on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995627.6148212
}