{
  "game_id": "0021800463",
  "espn_id": "401071144",
  "date": "Dec 19, 2018",
  "matchup": "DET @ MIN",
  "headline": "Griffin, Bullock lead Pistons past Timberwolves in OT",
  "body": "MINNEAPOLIS --  Trailing by 14 to start the fourth quarter, the Detroit Pistons got rolling on 3-pointers. However, their shortest shot of the night might have been the most important.\n\nBlake Griffin scored 34 points and Reggie Bullock added a career-high 33 as the Pistons beat the Minnesota Timberwolves 129-123 in overtime on Wednesday night.\n\nAndre Drummond's tip-in with 0.6 seconds left sent the game into overtime. Then the NBA's leading rebounder hit a rare 3-pointer of his own in overtime to put the Pistons on top for good.\n\n\"I wanted the ball more,\" Drummond said about his putback of Jackson's miss at the end of regulation. \"I went and got it and took my time to finish the play.\"\n\nReggie Jackson added 24 points and Drummond finished with 16 points and 16 rebounds for Detroit.\n\nDerrick Rose led Minnesota with 33 points, while Robert Covington scored 22 and Karl-Anthony Towns and Andrew Wiggins each had 16.\n\n\"Building a lead isn't easy, and we just gave it away,\" a dejected Wiggins said. \"But we had a chance to win with that last rebound. We needed it and didn't get it.\"\n\nTrailing 92-78 to start the fourth, the Pistons were 9 for 13 on 3s in the quarter to claw their way back into the game. Bullock, who set his previous career high of 24 points on Monday night in Milwaukee, hit 7 of 12 from behind the arc on the night, while Griffin went 5 for 10.\n\n\"I think we've done a pretty good job of not being gun-shy,\" said Griffin, whose team started 2 for 12 on 3s but finished 20 for 48. \"I think we're getting a lot of open shots and we're taking them, whether we make them or not. Tonight in the second half, we did and that's the difference.\"\n\nCovington's 3 from the corner put Minnesota on top 118-116 with 7.4 seconds to play in regulation. On the Pistons' last possession, Jackson drove for a layup that rimmed out, but Drummond put the rebound in to force overtime.\n\nMidway through overtime with the shot clock running out on a Pistons possession, Drummond hit a 3 from the corner -- just his fourth in 21 attempts this season -- to give Detroit a 123-122 lead.\n\n\"Corner 3 is something I shoot every day, day in and day out, workouts, before games, workouts after practice,\" Drummond said. \"It's a shot that I take all the time. I shot it with confidence and I knew it was going in.\"\n\nAfter he and Towns traded free throws, Jackson converted a drive to put the Pistons up by three with 1:28 to go in the extra session.\n\nOn Minnesota's next possession, Towns got the ball down low and hit a short shot but he was called for an offensive foul, his sixth foul of the night, and the Pistons were able to hold on for the win.\n\n\"We just had a lot of unfortunate events, and we didn't do what we needed to do,\" said Towns, who was 0 for 7 on 3s. \"That's how it happened.\"\n\nMinnesota fell behind 12-0 and missed its first eight 3-point attempts, but the Wolves finally cashed in when Covington made one from beyond the arc with 6 minutes to play in the second quarter, giving Minnesota a 44-37 lead that grew to 62-53 at halftime.\n\nBut the Timberwolves didn't have an answer for Detroit's hot shooting at the end of the game.\n\n\"The fourth quarter is different and you have to react to what's going on. So that is disappointing,\" Minnesota coach Tom Thibodeau said. \"I think they had 78 after three, and then a 40-point fourth quarter. And then all we had to do was get a stop, and we give up a second shot. That can't happen.\"\n\nGRIFFIN SICK\n\nGriffin was coming off his ninth career triple-double and first of the season on Monday at Milwaukee. But before Wednesday's game he needed IV fluids to overcome a flu bug he'd caught.\n\n\"He gave it everything,\" Pistons coach Dwane Casey said. \"He played a hell of a game to be as sick as he was.\"\n\nDrummond wasn't necessarily convinced of his teammate's illness.\n\n\"He looked fine to me,\" he deadpanned. \"Start having stomach problems more often.\"\n\nTIP-INS\n\nPistons: Detroit tied its season high with 20 3-pointers. ... F Glenn Robinson (sprained left ankle) missed his fourth straight game, while G Ish Smith remains out with a right groin injury he suffered two weeks ago.\n\nTimberwolves: Teague missed his second straight game with left ankle inflammation. ... G Jerryd Bayless dressed for the first time with the Timberwolves. He hasn't played since spraining his left knee in training camp with the 76ers. The Wolves acquired him in the Jimmy Butler trade on Nov. 12.\n\nUP NEXT\n\nPistons: Visit Charlotte on Friday night.\n\nTimberwolves: At San Antonio on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994703.8209448
}