{
  "game_id": "0022200514",
  "espn_id": "401468669",
  "date": "Dec 27, 2022",
  "matchup": "DEN @ SAC",
  "headline": "Nuggets rally to beat Kings 113-106 for 5th straight win",
  "body": "SACRAMENTO, Calif. -- — Michael Porter Jr. scored 30 points, Jamal Murray added 25 and the Denver Nuggets rallied from a 20-point deficit to beat the Sacramento Kings 113-106 on Tuesday night for their fifth straight win.\n\n\r\n              “We got down by 20 points and we didn’t drop our heads,” coach Michael Malone said. “We just stayed with it, kept on chopping away and were able to get the win.”\n\n\r\n              Porter and Murray sparked an 8-0 run in a span of 56 seconds late in the fourth quarter to turn a tie game into another win for the top team in the Western Conference. \n\n\r\n              Porter's 3-pointer broke a 96-all tie with 3:14 to play and Murray followed with a desperation 3 just before the shot clock expired. Murray then added a steal and breakaway layup to make it 104-96 with 2:14 to play and Denver hung on from there.\n\n\r\n              “That’s what you want,” Malone said. “You need your best players to step up.”\n\n\r\n              Nikola Jokic added 20 points, 11 assists and nine rebounds for the Nuggets, who have won eight of their last nine games.\n\n\r\n              De'Aaron Fox scored 26 points and Kevin Huerter added 11 for the Kings, who have lost three of four games to open a six-game homestand. \n\n\r\n              “This was a game, especially the first of a back-to-back, we needed to have more energy than them,” Huerter said. “We came out the right way … and obviously they kind of worked us in the second half.”\n\n\r\n              The Kings built a 20-point lead midway through the second quarter before the Nuggets chipped away thanks to the play of Porter, who scored 19 points in the first half. \n\n\r\n              Sacramento led 56-47 at the break, holding Jokic to two points on two shots.\n\n\r\n              “The most important stretch of this game was how we closed the second quarter,” Malone said. “They had all the momentum, they were feeling good and we allowed that to happen. They didn’t feel us. To have that run of 23-12 to kind of get back in the game, cut it to nine at the half, and then we used our third and fourth quarter to kind of continue that.”\n\n\r\n              But Jokic scored 14 points in the third quarter to cut the deficit to four points headed into the tight final period. \n\n\r\n              “At some point we were tired and made some mistakes,” said acting Kings coach Jordi Fernandez. “That’s human nature.”\n\n\r\n              SHORT-HANDED\n\n\r\n              The Kings were without coach Mike Brown and star center Domantas Sabonis.\n\n\r\n              Brown entered the health and safety protocols after testing positive for COVID-19 and missed the game. Fernandez took his place.\n\n\r\n              Sabonis was sidelined with an avulsion fracture of the ulnar collateral ligament in his right thumb. Sabonis hurt his non-shooting hand in the fourth quarter of Sacramento’s loss to Washington on Friday. He will be re-evaluated Wednesday. \n\n\r\n              Denver forward Aaron Gordon missed the game with a shoulder injury.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: This was the third time in the past six seasons that Jokic was held to two points or fewer in the first half when playing at least 17 minutes. ... G Bruce Brown left the game in the second quarter with a sprained right ankle and didn't return. ... Zeke Nnaji replaced Gordon in the starting lineup for his third start in three seasons in the NBA. He fouled out with no points in 15 minutes. \n\n\r\n              Kings: Alex Len, who had played 25 minutes all season, started in place of Sabonis. ... Former Kings GM Vlade Divac sat courtside next to owner Vivek Ranadive.\n\n\r\n              UP NEXT\n\n\r\n              The teams finish a two-game series with another game in Sacramento on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994713.4943109
}