{
  "game_id": "0022300084",
  "espn_id": "401584712",
  "date": "Oct 27, 2023",
  "matchup": "BKN @ DAL",
  "headline": "Doncic scores 49 and hits a late right-handed 3-point heave as the Mavericks beat the Nets 125-120",
  "body": "DALLAS -- — Luka Doncic scored 49 points and had a tiebreaking 3-pointer with 26.3 seconds remaining on a right-handed heave  that banked in as the Dallas Mavericks beat the Brooklyn Nets 125-120 on Friday night in their home opener.\n\n\r\n              Doncic was standing near the right sideline, about 25 feet from the basket while being tightly guarded by former teammate Dorian Finney-Smith, when he fired off a semi-hook with the shot clock about to expire. He scored the last four field goals for Dallas — all on 3-pointers.\n\n\r\n              “I work on that,” Doncic said with a smile of the circus shot. “I work off the backboard.”\n\n\r\n              Doncic added 10 rebounds and seven assists.\n\n\r\n              “That’s a Luka special,” Mavericks coach Jason Kidd said. “He likes the ball late, and he loves those situations, and he finds a way.”\n\n\r\n              Nets coach Jacque Vaughn said that it is players like Doncic that make the difference with some teams. \n\n\r\n              “What makes teams special at the end of the day is they have dudes who can make tough shots, like Donovan (Mitchell of Cleveland) did against us the first night. Luka did,” Vaughn said. \n\n\r\n              Cam Thomas led the Nets with 30 points in his seventh career NBA start, a game after setting a league record by scoring 36 points off the bench in a season opener.\n\n\r\n              Friday’s game was the first between the teams since the February trade that sent 10-time All-Star Kyrie Irving to Dallas in exchange for Finney-Smith and Spencer Dinwiddie.\n\n\r\n              After the final buzzer, Doncic and Finney-Smith renewed old acquaintances.\n\n\r\n              Finney-Smith said Doncic didn’t call bank on the key shot. Doncic disagreed.\n\n\r\n              “I said it in Slovenian, so he didn’t understand,” Doncic said.\n\n\r\n              “I wanted to call time out,” Kidd said, “but somehow, some way I didn’t.”\n\n\r\n              Doncic and Dinwiddie exchanged laughs at the center circle before the opening tap. Dinwiddie scored 23 points, hitting six 3-pointers in the first three quarters.\n\n\r\n              Two Nets had double-doubles: Royce O’Neale came off the bench to finish with 11 points and 10 rebounds, and Ben Simmons had 10 points and 10 rebounds.\n\n\r\n              The Nets were 21 for 43 from behind the arc after going 9 for 27 in their one-point home loss to the Cavaliers on Wednesday.\n\n\r\n              Tim Hardaway Jr. scored 19 points off the bench for the Mavericks, and Irving finished with 17.\n\n\r\n              Finney-Smith and Dinwiddie were honored with videos.\n\n\r\n              Finney-Smith scored 12 points. He made his first start of the season with center Nic Claxton (ankle sprain) and forward Cam Johnson (left calf contusion) out with injuries.\n\n\r\n              Dinwiddie led Brooklyn at the half with 15 points. Three of his four 3-pointers in the opening periods came in the final three minutes, helping the Nets to a 59-57 lead at the break.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Charlotte on Monday in the second game of a four-game trip.\n\n\r\n              Mavericks: At Memphis on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996614.156121
}