{
  "game_id": "0021400677",
  "espn_id": "400578969",
  "date": "Jan 27, 2015",
  "matchup": "MIL @ MIA",
  "headline": "Balanced Bucks beat Heat for 3rd time this season, 109-102",
  "body": "MIAMI -- Jason Kidd's wins against Miami keep piling up.\nSo do the Heat injuries, with Dwyane Wade now hurting again.\nBrandon Knight had 17 points and six assists and the Milwaukee Bucks put seven players in double figures on the way to beating the Heat 109-102 on Tuesday night.\nKhris Middleton also scored 17 for the Bucks, who got 15 from Jerryd Bayless, 14 from O.J. Mayo, 13 from Giannis Antetokounmpo, 12 from John Henson and 11 from Chris Dudley. And Kidd moved to 7-0 in regular-season games as a coach against Miami.\n\"They believe in one another and they believe they can win,\" Kidd said. \"Even when we were down, guys didn't panic, guys didn't take bad shots, our defense tightened up and we went from there.\"\nWith fighters Floyd Mayweather and Manny Pacquiao watching courtside, Milwaukee beat Miami for the third time in as many meetings this season, moving three games clear of the Heat in the race for No. 6 in the Eastern Conference. The Bucks' bench outscored Miami's 44-13.\nChris Bosh had 26 points for Miami, Mario Chalmers added 21 points and eight assists and Hassan Whiteside had 16 points and 16 rebounds. Miami became the first Milwaukee opponent in 18 games to shoot better than 50 percent, and it still didn't matter.\nThe Heat lost Wade in the third quarter with a strained right hamstring. Wade -- who finished with 12 points in 18 minutes -- has also dealt with left hamstring trouble on two other occasions this season.\n\"It's just so disappointing and difficult not to be at full strength or at least 75 percent,\" Bosh said. \"And we don't have room for injury.\"\nWade leaving was the latest development in the season-long saga of Heat injury news came after Miami made the pregame decision to keep Luol Deng (left calf soreness) and Chris Andersen (elbow and back soreness) out of the starting lineup, with Danny Granger and Whiteside taking their places.\nGranger scored 14 for Miami.\n\"We're not feeling sorry for ourselves,\" said Heat coach Erik Spoelstra. \"Nobody's feeling sorry for us.\"\nMilwaukee led by 10 points in the second quarter, but the Heat -- who have struggled in third quarters all season -- roared out of halftime and went up 78-68 with 3:54 left in the period on a 3-pointer by Norris Cole, the capper of a 13 1/2-minute stretch in which Miami outscored the Bucks 43-23.\nAfter that, all Milwaukee.\nThe Bucks tied the game with an 11-1 run that took less than 2 minutes late in the third, and put it away with a 17-5 run in the fourth that turned a one-point deficit into a 102-91 lead with 3:33 remaining.\n\"Different guys on different nights,\" Dudley said. \"And that's the motto of our team.\"\nTIP-INS\nBucks: The NBA announced earlier Tuesday that Antetokounmpo is heading to the dunk contest at All-Star weekend, along with Minnesota's Zach LaVine, Orlando's Victor Oladipo and Brooklyn's Mason Plumlee. ... Ersan Ilyasova left in the first half with a groin injury, after scoring four points in 10 minutes.\nHeat: With Deng and Andersen out, Miami used its 18th starting lineup in 45 games. ... Miami shot 71 percent in the first quarter and still trailed 30-29 -- the second time since December 2002 that the Heat shot that well in an opening quarter but was still behind. ... Granger became the 75th player in NBA history with 1,000 3-pointers, when he made his first on Tuesday.\nSUPER HEAT\nMiami plays at Boston on Sunday afternoon, then might get to see Patriots fans celebrating a title. The Heat will be staying in Boston to watch the New England-Seattle matchup in the Super Bowl that night and won't fly to Detroit -- the second stop on next week's four-game trip -- until the following day.\nSTARRY KNIGHT\nSpoelstra didn't reveal his All-Star reserves ballot, but strongly suggested that Knight -- a South Florida native and the Bucks' starting point guard -- should be heading to the game next month in New York. \"Brandon Knight is underrated, whether he makes the All-Star team or not,\" Spoelstra said. \"I think everybody views him as an All-Star.\"\nUP NEXT\nBucks: At Orlando on Thursday.\nHeat: Host Dallas on Friday.",
  "source": "espn_api",
  "crawled_at": 1764991790.296724
}