{
  "game_id": "0022400385",
  "espn_id": "401704951",
  "date": "Dec 21, 2024",
  "matchup": "LAC @ DAL",
  "headline": "Quentin Grimes leads bench scoring barrage as Mavericks beat Clippers 113-97 without Luka Doncic",
  "body": "DALLAS -- — Quentin Grimes scored 20 points off the bench, 14 in the fourth quarter, leading eight Mavericks in double figures as Dallas beat the Los Angeles Clippers 113-97 on Saturday night despite missing leading scorer Luka Doncic.\n\n\r\n              Doncic, fifth in the NBA with 28.9 points per game, missed his second consecutive game with a left heel contusion.\n\n\r\n              Klay Thompson scored 16 points, and Kyrie Irving and Spencer Dinwiddie had 15 apiece.\n\n\r\n              Irving, Dallas’ second-leading scorer who averages 23.9 points, missed the previous game with a sore shoulder.\n\n\r\n              During one stretch midway through the final period, Grimes hit consecutive 3-pointers and was then fouled behind the arc on Dallas’ next shot and hit all three free throws.\n\n\r\n              Norman Powell scored 28 points for the Clippers, who split a two-game series at Dallas. James Harden and Kevin Porter Jr. each added 19.\n\n\r\n              The Mavericks outscored the Clippers 31-18 in the second period to lead 54-40 at halftime, outshooting them 47.8% to 22.2%.\n\n\r\n              Takeaways\r\n              Clippers: Ivica Zubac had 13 points and 15 rebounds for his 19th double-double. Harden passed Tim Duncan to move into 16th place in NBA career scoring with 26,503 points.\n\n\r\n              Mavericks: Dereck Lively II had 11 points and 11 rebounds as Dallas improved to 6-2 without Doncic.\n\n\r\n              Key moment\r\n              Irving was 1 of 10 and 0 of 3 on 3-pointers before hitting a second-chance 3 with 1:07 to play in the first half. From that point, he shot 5 of 15 with two 3-pointers.\n\n\r\n              Key stat\r\n              The Mavericks led in bench points 46-24 paced by Grimes, Daniel Gafford with 13 and Naji Marshall with 12.\n\n\r\n              Up next\r\n              The Clippers will finish a three-game road trip against the Memphis Grizzlies on Monday night. The Mavericks will host the Portland Trail Blazers in the third game of a four-game homestand.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998042.227581
}