{
  "game_id": "0021500456",
  "espn_id": "400828343",
  "date": "Dec 27, 2015",
  "matchup": "OKC vs. DEN",
  "headline": "Westbrook rallies Thunder past Nuggets, 122-112",
  "body": "OKLAHOMA CITY -- Enes Kanter is listed at 6-foot-11 but is known as an \"under-the-rim\" player, teammate Kevin Durant says.\nHe sure overpowered the Denver Nuggets on Sunday.\nKanter, Oklahoma City's backup center, scored 11 of his 21 points in a five-minute span that featured two powerful dunks that gave the Thunder the momentum and helped lift them past the Nuggets, 122-112.\n\"I just want to help my team win,\" Kanter said. \"It doesn't matter, off the bench, play one minute or 48. When I'm out there, Coach tells me to bring energy and just go after rebounds and I'm just trying to do that.\"\n\nRussell Westbrook had 30 points, 12 assists and nine rebounds, just missing what would have been his fourth triple-double of the season, as the Thunder rallied from an 11-point, second-half deficit.\nDurant recorded his eighth double-double of the season with 26 points and 10 assists for the Thunder, who have won 10 of their last 12 games but were coming off a Christmas Day loss at home to the Chicago Bulls.\nOklahoma City shot a season-best 57.8 percent from the field. The Thunder trailed as late as the 8:13 mark of the fourth quarter before taking control with an 11-2 run. Kanter's tip-in of a miss by Serge Ibaka put the Thunder ahead for good at 98-97 with 7:50 left.\nKanter then took a pass from Westbrook and dunked over 6-foot-10 Nikola Jokic while being fouled. Kanter hit the ensuing free throw, then two more free throws with 6:38 left. His final dunk came with 4:33 left and made it 109-102. He also grabbed eight rebounds, five offensive.\n\"Kanter was their MVP tonight,\" Nuggets coach Michael Malone said. \"He dominated us. Every time we play this team, he dominates us. We just have to get in the weight room and get a little bit stronger.\"\nKenneth Faried had 25 points and 11 points for the Nuggets, who have lost five of their last six games. Denver has lost six straight trips to Oklahoma City.\n\"We didn't defend at all tonight,\" Malone said. \"Our offense was terrific, but that is a losing proposition if you try to outscore the Thunder on their home court with the firepower they have. . We left our defense in the locker room at halftime.\"\nThe Thunder started slowly for the second straight game and trailed 61-53 at halftime.\nKostas Papanikolaou's 3-pointer to start the second half extended Denver's lead to 11 points, but Westbrook and Durant fueled a 20-9 run that pulled Oklahoma City even at 73-all with 5:07 left in the third quarter.\nRandy Foye gave the Nuggets their last lead at 97-96 with 8:13 left. Will Barton scored 19 points and Joffrey Lauvergne added 18 for Denver.\nTIP-INS:\nNuggets: Malone said Danilo Gallinari and Emmanuel Mudiay, both out with ankle sprains, probably won't return to action until at least Jan. 2 . After the Nuggets' loss in San Antonio on Saturday, Malone met former Denver coach Doug Moe for the first time and offered him an \"open invitation\" to visit the team in Denver. Moe coached the Nuggets from 1980-90 and took them to the Western Conference finals in 1985 . Foye and Jameer Nelson each are only four shy of reaching 1,000 3-pointers for their careers.\nThunder: Durant and Westbrook were the first teammates to each have at least 25 points and 10 assists in a regulation game since Utah's John Stockton (31 points, 11 assists) and Karl Malone (27 points, 10 assists) on Feb. 2, 1996 . The Nuggets were on the second night of a road back-to-back and so will the Thunder's next two opponents: Milwaukee on Tuesday and Phoenix on Thursday . As has become their habit this season for Sunday games, the Thunder wore their alternate orange jerseys.\nKANTER'S BIG DUNK\nKanter's dunk over Jokic had the Thunder abuzz.\n\"That play he made over the big fellow kind of got us going,\" Durant said. \"You never know who is going to make those plays and he made it tonight. . He's a below-the-rim player, but he got up on that one.\"\nThe dunk even surprised Kanter, who quipped, \"I didn't know I had it in me. I was in shock. I turned around and everyone was just cheering.\"\nMalone said Kanter \"manhandled\" the Nuggets.\nUP NEXT:\nNuggets: Host Cleveland on Tuesday.\nThunder: Host Milwaukee on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994185.7560709
}