{
  "game_id": "0022300697",
  "espn_id": "401585325",
  "date": "Feb 02, 2024",
  "matchup": "POR @ DEN",
  "headline": "Jokic posts 15th triple-double of season as Nuggets hold off short-handed Blazers 120-108",
  "body": "DENVER -- — Whenever the Denver Nuggets start to take the floaters and volleyball-like tip passes from Nikola Jokic even a little bit for granted, they remember one thing.\n\n\r\n              “What life was like before Nikola got here,” Denver coach Michael Malone said. “I think people don't do that. (They're like), ‘It’s always been like this.’ No it wasn’t. No it wasn’t. Don’t do that. Don’t lie to yourself.\"\n\n\r\n              Jokic turned in another masterful performance with 27 points, 22 rebounds and 12 assists as the Nuggets held off the short-handed Portland Trail Blazers 120-108 on Friday night.\n\n\r\n              A little break did wonders for Jokic, who appeared to have an extra bounce after sitting out the game at Oklahoma City on Wednesday. The two-time NBA MVP recorded his 15th triple-double of the season.\n\n\r\n              “We have been spoiled and I’m sure some of us do find ourselves maybe taking it for granted,” Malone said. “But just remind yourself that not many guys like Nikola Jokic walk through those doors. Appreciate every opportunity that you have to watch him play.”\n\n\r\n              Jamal Murray nearly had a triple-double, too, finishing with 13 points, 10 assists and nine rebounds. He and Jokic — along with two big 3-pointers from Peyton Watson — were pivotal in the Nuggets fending off the Blazers down the stretch. \n\n\r\n              “He was the X-factor for us, for sure,” Jokic said of Watson.\n\n\r\n              Watson had 10 of his 14 points in the fourth quarter to help the Nuggets improve to 20-4 at home. Aaron Gordon finished with 18 as seven Nuggets players scored in double figures.\n\n\r\n              The Nuggets are 34-16 at the 50-game mark of the season. It's the same record they had at this point last season on their way to the franchise's first NBA title.\n\n\r\n              “I like that we are still playing with the same effort,” Jokic said. “It’s not like we won a championship and now we’re going to go easy. I like that we still want to compete and we still want to be better.”\n\n\r\n              Reserve Scoot Henderson scored 30 points and Anfernee Simons added 29 for a Portland team missing some of its scoring punch, with Jerami Grant a late scratch due to lower back tightness. The Blazers were already without Shaedon Sharpe (lower abdominal strain). \n\n\r\n              “We fought. We didn’t back down. We didn’t show them no easy respect. We came in with a win mindset,” said Henderson, whose team had beaten Philly and Milwaukee at home before their loss to Denver. “Today, effort-wise, we won.\"\n\n\r\n              Denver's first quarter was highlighted by Kentavious Caldwell-Pope's dunk after a long outlet pass from Jokic. It was a rare slam for Caldwell-Pope and helped the Nuggets build an early 15-point lead.\n\n\r\n              Jokic also had a couple of volleyball-like tip passes to Gordon. It's becoming a thing as he simply directs the ball toward his teammate rather than catch it. \n\n\r\n              \"Just trying to pass as fast as possible,” Jokic reasoned.\n\n\r\n              Jokic simply being Jokic.\n\n\r\n              “Every time he's on the floor, he’s trying to make the right play,” said Caldwell-Pope, who had the pinkie on his shooting hand taped after it popped out late in the fourth. “I definitely appreciate what he does.”\n\n\r\n              Same with Blazers coach Chauncey Billups.\n\n\r\n              “Really tough to beat them when he’s having that type of night,” Billups said. “You have to have it really going offensively, a lot of shots going in, to be able to beat them on a night like that, when he’s putting a masterpiece performance on.”\n\n\r\n              UP NEXT\n\n\r\n              The Nuggets and Blazers meet again Sunday at Ball Arena.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996574.535264
}