{
  "game_id": "0021800319",
  "espn_id": "401071000",
  "date": "Nov 30, 2018",
  "matchup": "CLE @ BOS",
  "headline": "Irving scores 29 as Celtics rout Cavs 128-95",
  "body": "BOSTON --  After stumbling through a late November slump, the Boston Celtics scored a season-high for the second game in a row.\n\nKyrie Irving scored 29 points in the first three quarters and was one of seven Boston players in double figures as the Celtics routed the Cleveland Cavaliers 128-95 on Friday night.\n\n\"It makes our jobs a lot easier to go out there and play at a high level when we're all doing it, not just a couple guys here and there. We need everybody,\" Irving said.\n\nMarcus Morris scored 15, Jayson Tatum had 13 points and Aron Baynes finished with 10 points and nine rebounds for the Celtics, who had all five starters score in double figures and broke 100 points before the fourth quarter.\n\nThe Celtics dominated inside, outscoring Cleveland in the paint 54-32, and were strong outside as well, making 17 of 31 3-pointers.\n\nIrving made 11 of 15 shots and was 5-for-7 from 3-point range as the Celtics surpassed their 124 points scored Monday in a win at New Orleans.\n\n\"Nobody's going to play perfect, but I think that our approach was good,\" coach Brad Stevens said. \"They stayed the course They played together. A lot of guys did a lot of good things and kind of built off of what we've talked about.\"\n\nBoston took the game over in the third quarter, making 6 of 8 3-pointers and outscoring Cleveland 39-20 in the period.\n\nMarcus Smart had 12 points and seven assists and Gordon Hayward added 14 points off the bench before the Celtics reserves took over and finished off the short-handed Cavaliers.\n\n\"I thought they really out-toughed us,\" Cleveland coach Larry Drew said. \"We had moments in the first half where I thought we played well, but there were some plays we got out-toughed. That was the most disheartening thing about this game.\"\n\nTristan Thompson had 13 points and 12 rebounds, his fifth double-double in six games for Cleveland, and Jordan Clarkson scored 16. Alec Burks added 15 points in his Cavs' debut and Collin Sexton also scored 15.\n\n\"They came out, made shots, got to the rim -- really did what they wanted to do with no resistance,\" Thompson said. \"At the end of the day, it's on the starters. You've got to be ready to go, me included.\"\n\nThe Celtics closed out the first half on a 15-5 run, taking a 62-52 lead on Morris' 3-pointer at the buzzer.\n\nBoston kept it going from outside in the third quarter, starting with another 3-pointer by Irving. Morris, who made all three free throws after drawing a foul with 9:09 left, added a 3-pointer to put the Celtics up 77-61 and Smart hit a 3 a few minutes later to stretch the margin to 82-62.\n\nIrving and Hayward made back-to-back 3-pointers and Hayward converted a three-point play with 2:27 left in the third to put Boston up 95-70.\n\nTerry Rozier topped it off with one more 3-pointer, just beating the buzzer and putting Boston up 101-72 after three.\n\nSHORT STREAK\n\nThe Celtics had lost four of five, including three straight, before Monday night's win at New Orleans. The two-game winning streak puts the Celtics at 12-10, hardly where an Eastern Conference contender wants to be.\n\n\"It's only been two games,\" Irving said. \"We've just got to continue to put games together.\"\n\nTIP-INS\n\nCavaliers: Went 3-11 in November. . Burks was playing his first game for Cleveland after coming over from Utah in a trade for G Kyle Korver. . Sam Dekker (left ankle sprain), G George Hill (right shoulder sprain) and F David Nwaba (sore right knee) were all out for Cleveland.\n\nCeltics: Rozier finished with 10 points. . F Al Horford got the night off to rest and G Jaylen Brown was out with a lower back bruise.\n\nUP NEXT\n\nCavaliers: Home Saturday night against the Toronto Raptors.\n\nCeltics: Visit Minnesota on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994795.073847
}