{
  "game_id": "0022200221",
  "espn_id": "401468376",
  "date": "Nov 17, 2022",
  "matchup": "BKN @ POR",
  "headline": "O’Neale scores on late tip, Nets top Trail Blazers 109-107",
  "body": "PORTLAND, Ore. -- — Royce O’Neale scored on a tip-in with 0.7 seconds left to complete a triple-double and give the Brooklyn Nets a 109-107 victory over the Portland Trail Blazers on Thursday night.\n\n\r\n              Kevin Durant led the Nets with 35 points, and O’Neale had 11 points, 11 rebounds and 11 assists. Yuta Watanabe added 20 points off the bench and Ben Simmons scored a season-high 15 points before fouling out with 24 seconds left.\n\n\r\n              “He was incredible tonight,” Durant said about Simmons. “I thought he did a good job of commanding the offense, commanding the team on the defensive side of the ball. He was able to control the game and get us back into it.” \n\n\r\n              Said Simmons: “People make it seem like I had a sprained ankle or something. I came back from back surgery, that’s not easy. I’m getting there.” \n\n\r\n              Damian Lillard had 25 points and 11 assists for Portland. The Blazers shot only 38.7% from the field, including 29% in the second half. \n\n\r\n              “We really never got a flow in the fourth quarter,” Blazers coach Chauncey Billups said. “The end of the third quarter really hurt us. We had an 11-point lead with 2:40 to go, they go on a 14-0 run that turned the tide on us. From there we were in scramble mode.” \n\n\r\n              A 3-pointer by Watanabe gave the Nets an 85-82 lead heading into the fourth quarter. Watanabe scored 11 of his points in the third.\n\n\r\n              The Nets won a challenge down 95-93 with 7:31 left. Durant’s basket after the challenge tied it at 95. After a pair of empty Portland possessions, Durant gave the Nets a 97-95 lead.\n\n\r\n              With 3:28 left, the Blazers began intentionally fouling Simmons. The career 59% free-throw shooter went 3 of 4 during the crucial series to preserve a 103-99 lead for Brooklyn.\n\n\r\n              “We had no doubts when he went up there,” Durant said of the team’s confidence in Simmons. \n\n\r\n              “I love those moments. I’m not going to shy away,” Simmons said. “That was their plan, but obviously it didn’t work. But I’m just building. I love those moments.” \n\n\r\n              Durant split a pair of free-throws to make it 106-103. Jusuf Nurkic was fouled by Durant on a layup with 6.5 seconds left and Nurkic converted the 3-point play to tie it at 107.\n\n\r\n              “Regardless of what people say, we’re here to win,” Simmons said. “We’re here to win a championship. It’s going to take everybody to do that. Everybody’s got to stay focused, locked in and stay the course, not get caught up in all the other things going on.” \n\n\r\n              KYRIE NEAR RETURN\n\n\r\n              Star guard Kyrie Irving could return to the lineup for Brooklyn as soon as Sunday night when the Nets host the Memphis Grizzlies, according to coach Jacque Vaughn. Irving has not played since Nov. 1 while serving a team-imposed suspension for refusing to say he had no antisemitic beliefs.\n\n\r\n              Vaughn admitted there are no guarantees when incorporating Irving back into the team, which has gone 4-3 in his absence.\n\n\r\n              “There’s some uncertainty there for sure. And my approach is, the train is going to keep moving. That train is: playing hard, playing together, being a team and that’s going to continue. And that’s going to be up to me to get our group to incorporate everybody.”\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Memphis on Sunday night.\n\n\r\n              Trail Blazers: Host Utah on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994890.626952
}