{
  "game_id": "0021700961",
  "espn_id": "400975707",
  "date": "Mar 06, 2018",
  "matchup": "DAL vs. DEN",
  "headline": "Ferrell, Nowitzki lead Mavericks to 118-107 win over Nuggets",
  "body": "DALLAS --  Dirk Nowitzki drained his first five 3-pointers to put the Dallas Mavericks in position to hand the Denver Nuggets a damaging loss in the tight Western Conference playoff race.\n\nDenver coach Michael Malone figures his players should have known better than to let the 39-year-old in his 20th season do that.\n\n\"No disrespect to Dirk Nowitzki, but the one thing he can still do at a high level is shoot the ball and we give him five 3s,\" Malone said after the Mavericks' 118-107 win Tuesday night. \"It was just a very undisciplined effort and that is what happens when you are undisciplined on the road.\"\n\nYogi Ferrell, a second-year guard whose career in Dallas started on a 10-day contract last season, made his first six 3s while finishing 6 of 7 from long range and 9 of 11 overall for a season-high 24 points. Nowitzki was 5 of 7 from deep and had 17 points.\n\nWilson Chandler scored 21 points for the Nuggets, who couldn't follow up a win at Cleveland with a chance to sweep a three-game road trip. Now they play LeBron James and company on the second night of a back-to-back for the second time in five days.\n\nDallas split the season series with Denver, with both teams winning both home games. The Nuggets are among seven teams battling for the final five playoff spots in the West.\n\n\"My message was very simple: Tonight was unacceptable,\" Malone said. \"It's one thing to miss shots and to make mistakes, but it's another thing to go out there and just kind of go through the motions. And I don't think we can have that right now.\"\n\nRookie Dennis Smith Jr. had 18 points and a career-high 11 assists as the Mavericks won for just the second time in nine games. Dallas shot 56 percent from 3 (15 of 27) while Denver was at 31 percent (11 of 36) after making 19 of 35 in the win over the Cavaliers.\n\nNerlens Noel had a season-high 14 rebounds for Dallas, his only other game in double digits since the opener. He missed 42 games after surgery for a torn ligament in his left thumb.\n\n\"This is a great win for us, especially with a team that is trying to get in the playoffs,\" Ferrell said. \"We lived in the paint, we played together and that's the biggest thing for us.\"\n\nTIP-INS\n\nNuggets: Will Barton had 16 points, eight rebounds and seven assists. ... Seven players scored in double figures. Paul Millsap had 12, Gary Harris scored 11 and there was a trip at 10 points apiece: Mason Plumlee, Trey Lyles and Malik Beasley.\n\nMavericks: G Wesley Matthews missed his second straight game with a left hip injury. ... Doug McDermott and Harrison Barnes had 15 points apiece, and Dwight Powell scored 14.\n\nHARRIS HOMECOMING\n\nDevin Harris played the Mavericks for the first time since a trade deadline deal that sent him to the Nuggets. After waving to the crowd following a video tribute late in the first quarter, Harris entered the game for the first time. He reached 10,000 points for his career in the first half and finished with seven points.\n\nThe 14th-year guard started his career with the Mavericks, who traded for him in the fifth spot in the 2004 draft. The Mavs traded him to the Nets to re-acquire Jason Kidd in 2008, and he was sent to Utah in 2011. Harris spent one year in Atlanta before returning to Dallas in 2013.\n\nCOACH'S DECISION\n\nNikola Jokic, who had 29 points and 18 rebounds in one of the wins over Dallas in Denver, had four points and nine boards. He was 0 of 4 from 3, including a couple of forced shots from behind the arc in the third quarter. He didn't play in the fourth quarter. \"I don't know what to say,\" Jokic said. \"I think that's a normal thing. That's the coach's decision.\"\n\nJERSEY SPONSOR\n\nThe Mavericks became the 21st team with a jersey sponsor when they announced a three-year deal with Dallas-based online marketplace 5miles. The LA Clippers were the 20th team with an announcement earlier in the day on a deal with the online dating site bumble.\n\nUP NEXT\n\nNuggets: Host the Cavaliers on Wednesday after winning 126-117 on Saturday in Cleveland.\n\nMavericks: Three days off before another home game against Memphis on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993941.980476
}