{
  "game_id": "0021600716",
  "espn_id": "400900137",
  "date": "Jan 29, 2017",
  "matchup": "CHI vs. PHI",
  "headline": "Butler, Lopez lead Bulls to 121-108 win over 76ers",
  "body": "CHICAGO --  Jimmy Butler was able to move on once all the Bulls' grievances were aired.\n\nButler scored 28 points and Robin Lopez added a season-high 21 points and had 10 rebounds as Chicago defeated the Philadelphia 76ers 121-108 on Sunday night.\n\nAfter a week of tension, the Bulls bounced back from consecutive home defeats to Atlanta and Miami despite blowing a 20-point lead.\n\n\"It was all good tonight,\" Butler said, \"especially after what was going on.\"\n\nButler and Dwyane Wade returned to the starting lineup after being benched as starters in Friday's blowout loss to the Heat. They were critical of teammates after they blew a late double-digit lead in a loss to the Hawks on Wednesday. Rajon Rondo responded to his teammates' criticism on an Instagram post on Thursday, taking multiple shots at the team leadership. Wade,\n\nButler, and Rondo all were fined by the Bulls.\n\n\"Everybody said what they had to say,\" Butler said. \"Get it off their chest, move on, move forward and win some games.\"\n\nAfter a team meeting, Butler and the Bulls had one of their worst performances of the season against Miami. Butler struggled off the bench, scoring just three points on 1-of-13 shooting. Against the 76ers, Butler was more aggressive, getting to the free throw line and setting up his teammates. He had seven assists and eight rebounds.\n\nThe Bulls' next six games are on the road.\n\n\"It will be a long road trip, lonely,\" Wade said. \"Just like our long road trip at the beginning of the season.\"\n\nErsan Ilyasova scored a season-high 31 points for Philadelphia, and Robert Covington added 21 points and a season-high 12 rebounds. The 76ers have lost 12 straight to the Bulls.\n\nPhiladelphia played without Joel Embiid, who stayed in Philadelphia as he rested with a left knee contusion. Embiid is day-to-day.\n\nThe Bulls closed out the first quarter with a 13-0 run. Rondo made a pass that traveled three-quarters of the court to Nikola Mirotic to put the Bulls up 37-23 at the end of the quarter. They extended their lead to 20 early in the second quarter.\n\nThe 76ers got the lead down to six at one point in the second quarter, and came back from the 20-point deficit in the third. T.J. McConnell had back-to-baskets to tie it at 79.\n\nThe Bulls built the lead back up to 11.\n\n\"Yes, it was tough,\" 76ers forward Nerlens Noel said. \"They were getting to the foul line pretty consistently. That makes it tough to ease back into the game and get stops. I think the main thing is to be able to come back (Monday) better defensively and just continue to execute on the offensive end.\"\n\nButler answered for the Bulls, making a jumper and then, on the defensive side, stealing a pass and finishing with a dunk to give the Bulls a 92-83 lead late in the third quarter.\n\nThe Bulls' bench outscored the 76ers' reserves 49-15.\n\n\"It's the beauty of the NBA: You don't have time to be wallowing in misery and pity,\" Philadelphia coach Brent Brown said. \"We get on a plane, go back home and have Sacramento tomorrow. I bet our bench will be pretty darn good. They certainly will be fresh, and I think they're going to respond.\"\n\nTIP-INS\n\n76ers: Despite the recent success, Brown wouldn't kid himself about where it was in the rebuild process. \"We are a long ways, in my eyes, away from doing what I want to do, what we want to do as an organization,\" Brown said. \"To be one of the elite teams annually in the NBA takes a lot. So that question to me is a very distant type of feeling.\" At 17-29, the 76ers are in position to reach the 20-win mark for the first time in four seasons.\n\nBulls: F Taj Gibson missed the game after taking a cortisone shot to ease pain in his left ankle. ... G Denzel Valentine was back with the Bulls after a one-game stint with D-League affiliate Windy City Bulls. The first-round pick scored 24 points and had eight assists and seven rebounds for the Windy City. In limited minutes, Valentine is averaging 3.3 points per game for the Bulls.\n\nTHE SECOND UNIT\n\nWade took notice to the job Rondo is doing with the way the Bulls' bench has played. \"Rondo is the leader of that unit,\" Wade said. \"He did a good job of quarterbacking those guys. They played with swagger.\"\n\nMORE SCORING, PLEASE\n\nBrown is relying on Ilysaova to become another offensive threat. \"He's somebody we need to score,\" the coach said. \"He's somebody we need to provide that toughness. With our bench being down, we especially needed him tonight to do those types of things, and he did.\"\n\nDNP\n\nC Jahlil Okafor did not play despite suiting up. He has a sore right knee and has played only 31 minutes in the last four games. It was his eighth DNP of the season due to a coaching decision. \"There was some soreness,\" Brown said. \"By and large, he hasn't done much. We haven't had the opportunity to practice because of the dense schedule that we're on. ... We don't just want to force-feed something.\"\n\nUP NEXT\n\n76ers: Return to Philadelphia on Monday to host Sacramento.\n\nBulls: Head to Oklahoma City on Wednesday to begin a six-game road trip. The Bulls don't return home until Feb. 14.",
  "source": "espn_api",
  "crawled_at": 1764995045.494313
}