{
  "game_id": "0022201023",
  "espn_id": "401469178",
  "date": "Mar 13, 2023",
  "matchup": "MEM @ DAL",
  "headline": "Grizzlies beat Mavs again in another meeting sans All-Stars",
  "body": "DALLAS -- — Desmond Bane scored 23 points and the Memphis Grizzlies won a second consecutive game against Dallas with all three All-Stars out, beating the Mavericks 104-88 on Monday night.\n\n\r\n              Luka Doncic and Kyrie Irving were out for Dallas with injuries, and Ja Morant remained away from the Grizzlies because of his issues off the court.\n\n\r\n              Doncic is dealing with a left calf strain that required an MRI, which revealed no significant damage. Irving has right foot soreness. \n\n\r\n              With all three absent just as they were in Memphis' 112-108 victory Saturday to start the home-and-home, rookie David Roddy played a big role for the Grizzlies again.\n\n\r\n              The 23rd overall draft pick scored 19 points on 8-of-11 shooting two nights after getting 17 of his career-high 24 points in the fourth quarter, when Memphis erased an 11-point deficit.\n\n\r\n              There was no need for a late rally in the rematch after the Grizzlies opened the second half with a 12-0 run and outscored Dallas 36-21 in the third quarter, when the Mavs shot 31%.\n\n\r\n              “I challenged the guys at halftime to understand we had just beaten this team two days ago,” Memphis coach Taylor Jenkins said. “They were going to come in with a reinvigorated spirit to try to beat us on their home floor.”\n\n\r\n              Rookie Jaden Hardy scored 28 points for the Mavericks, who dropped under .500 for the first time since December. Josh Green was the only other Dallas player in double figures with 23. \n\n\r\n              The Mavs, who paired Irving with Doncic by giving up two starters and a first-round pick in the blockbuster trade with Brooklyn, are currently in the play-in tournament with 13 games remaining a year after reaching the Western Conference finals.\n\n\r\n              “We’ve got to play with the cards we had tonight, and we played a good half of basketball with a young backcourt that’s learning how to play the NBA game,” Dallas coach Jason Kidd said. “It's just a matter of can we be healthy in time to make a stretch run. And if we’re not, that’s just the season. No one’s dying.”\n\n\r\n              The Grizzlies, comfortably in the top six in the West, won a third consecutive game after losing the first two of Morant's sabbatical.\n\n\r\n              Morant is away from the team after posting a video recently in which the 23-year-old two-time All-Star appeared to be displaying a gun at a Denver-area strip club.\n\n\r\n              “We've had internal dialogue for sure,” Bane said. “We knew roles would be different and guys that maybe didn't have an opportunity before we're going to get one. Guys have been staying ready all year long.”\n\n\r\n              MORE MISSING PIECES\n\n\r\n              Both teams also were missing a key frontcourt player, with Memphis' Steven Adams out with a right knee sprain and Dallas' Christian Wood scratched before the game because of right foot soreness.\n\n\r\n              ROLLING RODDY\n\n\r\n              Roddy, who played three seasons at Colorado State, now has the two highest-scoring games of his career in consecutive outings. He was a 42% shooter before making 18 of 24 from the field in these two games.\n\n\r\n              “He made some big ones in Memphis and maybe we should have run him off, but understanding running him of puts us in a bind,” Kidd said.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Dillon Brooks scored 19 points, and Santi Aldama had 10 points and nine rebounds. ... Memphis ended a three-game road losing streak and won for just the second time in 13 games away from home.\n\n\r\n              Mavericks: Hardy's 16-point first quarter was the highest-scoring opening quarter for a rookie in the NBA this season, surpassing Jeremy Sochan's 15 points for San Antonio in 127-106 loss to Washington in January. ... Tim Hardaway Jr., who had 23 points with Doncic and Irving sidelined in the first meeting, scored just five points on 2-of-10 shooting. \n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At Miami on Wednesday. The Grizzlies have won five the past six games against the Heat.\n\n\r\n              Mavericks: A three-game trip starts Wednesday in San Antonio. The Mavs have six consecutive victories against the Spurs.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994172.9604962
}