{
  "game_id": "0021700288",
  "espn_id": "400975039",
  "date": "Nov 26, 2017",
  "matchup": "MIN vs. PHX",
  "headline": "Towns scores 32 points, Wolves beat Booker-less Suns",
  "body": "MINNEAPOLIS -- Karl-Anthony Towns' scoring actually meant something this time.\nTwo days after his coach characterized his late points as \"meaningless\" in a listless loss to Miami, Towns led a balanced offensive attack for Minnesota with 32 points and 12 rebounds and the Timberwolves beat Phoenix 119-108 on Sunday.\nAlongside Jimmy Butler with 25 points and Andrew Wiggins with 21, Towns kept the Wolves from another bad loss, this one against a Phoenix team missing top scorer Devin Booker.\n\"Whatever the game plan is offensively, I try to go out there and execute as best as possible,\" Towns said. \"Whether it is shoot 30-plus shots, or shoot five shots.\"\nThe Wolves probably prefer the former, as long as he shoots the way he did Sunday. Towns went 12 of 26 from the floor, including two 3-pointers, and hit all six of his free-throw attempts.\nCoach Tom Thibodeau criticized Towns for not moving without the ball on Friday night, when his star big man got rolling too late. On Sunday, he scored 30 points for the third time this season and recorded his league-leading 16th double-double.\n\"I thought Karl had great activity today, so that was good,\" Thibodeau said. \"We need that from him.\"\nThe Suns announced shortly before the game that Booker -- who scored 35 points in Phoenix's home victory over Minnesota on Nov. 11 -- would sit out because of an injured big right toe.\nWith Booker out, the Suns got another big game from their bench, led by Mike James with a career-high 26 points. But Minnesota started the third quarter with a 22-11 run, and Phoenix couldn't find an offensive spark to seriously threaten the rest of the way.\n\"He's one of our best scorers, so it's a big chunk offensively,\" Suns interim coach Jay Triano said about Booker. \"But at the same time we shot 50 percent. I thought our movement was pretty good. We shared the basketball, so I'm not disappointed with how we played at the offensive end without him. We weren't very good defensively.\"\nThe Wolves outscored the Suns 66-50 in the paint, and had 32 second-chance points to Phoenix's 12.\nT.J. Warren -- who also had 35 points in the first meeting with the Timberwolves -- had 18 points for the Suns, and Phoenix started its six-game trip with its third straight loss.\nMinnesota built an early 14-point lead before Phoenix's bench pulled the Suns back into it. James had eight second-quarter points to help spark a 25-15 run that gave the Suns a brief four-point lead before Wiggins got hot with three straight buckets to put the Wolves back in front.\nBOOKER'S STATUS\nTriano said he hoped Booker's status would be day-to-day, but that he still needed to speak with the trainers. \"They said if he sat out today it would give him a chance to rest a couple more days, so I'm hoping that means he gets to play.\" Before the game, Triano said Booker's injury occurred Friday night in a home loss to New Orleans.\nTAJ'S TALLY\nTaj Gibson had 16 points and a season-high 14 rebounds for his seventh double-double of the season. He finished 8 of 12 from the floor, matching a career high for made field goals. While most of the attention on Minnesota's revamped roster has focused on Jimmy Butler, Gibson has emerged as a reliable inside presence. \"He adds a lot to the team, the way he plays,\" Thibodeau said. \"He's got great quickness, he's got great feet, but there's a toughness to him that makes him what we need, too.\"\nTIP-INS\nSuns: Josh Jackson started in Booker's place and finished with five points. ... The Suns' bench scored 61 points. The unit entered the game averaging 45.4 points over its previous five games. ... Phoenix lost for the first time in four games when shooting 50 percent from the floor. ... The Suns went 13 of 26 from 3-point range, one off the team's season high for 3-pointers made.\nTimberwolves: The Wolves improved to 12-8 to equal their best 20-game start since the 2005-06 season. ... Starting point guard Jeff Teague (sore right Achilles) and reserve forward Nemanja Bjelica (sprained left foot) missed their second-consecutive games. Before the game, Thibodeau said both players were \"getting closer, but I'm not sure that they're there yet.\" Bjelica's injury is the same foot that required surgery to repair a fracture last season, and Thibodeau said the team has consulted with the surgeon. \"I think he's good but we just want to make sure.\"\nUP NEXT\nSuns: At Chicago on Tuesday night.\nTimberwolves: Host Washington on Tuesday night.\n---\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992676.517086
}