{
  "game_id": "0022300771",
  "espn_id": "401585399",
  "date": "Feb 13, 2024",
  "matchup": "BKN vs. BOS",
  "headline": "Tatum scores 41 points, Celtics beat Nets 118-110 for 5th straight win",
  "body": "NEW YORK -- — Even though he tied a career high by scoring 31 points before halftime, Jayson Tatum wasn't tempted to chase a huge number.\n\n\r\n              He's had big scoring nights before. He's after an NBA championship, and can only get that with all his teammates. \n\n\r\n              Tatum had 41 points and 14 rebounds, and the Boston Celtics won their fifth straight game by beating the Brooklyn Nets 118-110 on Tuesday night in the opener of a home-and-home series. \n\n\r\n              Tatum had his 25th 40-point game in the regular season, with a career high of 60. But after scoring 16 in the first quarter and 15 more in the second, he took only nine shots in the second half.\n\n\r\n              “We’ve got a really good team where in any given possession we could have two, three advantages and it’s not always just going to be me,” Tatum said. “So just understanding that and knowing that I need my teammates. I need everybody, we all need each other.” \n\n\r\n              Jaylen Brown added 19 points for the Celtics, who improved to 42-12 and will host the Nets on Wednesday in the final game for both teams before the All-Star break.\n\n\r\n              The Celtics led comfortably much of the way while playing without Kristaps Porzingis because of a lower back contusion. Coach Joe Mazzulla said Boston's starting center could play Wednesday.\n\n\r\n              Al Horford replaced Porzingis in the lineup and scored 16 points on 6-for-6 shooting. Derrick White also scored 16 and Jrue Holiday had 14 points and 12 assists as the Celtics won their sixth straight in Brooklyn. \n\n\r\n              Mikal Bridges scored 27 points and Cam Thomas had 26 for the Nets, who lost for the fourth time in five games and don't have much time to figure out what else they can do against Tatum. \n\n\r\n              “These high-level guys, once they get going, we started to trap him a little bit, but they’ve got so much shooting out there,” Nets coach Jacque Vaughn said. “It’ll be interesting to watch it again and see what adjustments we can make.” \n\n\r\n              Backup center Day'Ron Sharpe returned with six points after missing 15 games with a hyperextended left knee and starting forward Cam Johnson (adductor strain) could be back Wednesday for a Nets team that has gotten some healthy bodies back lately.\n\n\r\n              Still not enough of them to beat the Celtics, who won for the ninth time in the last 10 meetings. \n\n\r\n              Tatum made 3-pointers on consecutive possessions late in the first quarter, and when he pulled up behind the arc on the next trip, he made it while being fouled for a four-point play that gave him 16 points in the period.\n\n\r\n              “We rely on him to make those and he’s not afraid to shoot them,” Holiday said. “But tonight, him taking those shots gave us a lot of energy. It definitely gave us a boost to go out there, lock in defensively and then get him the ball back.” \n\n\r\n              But the Nets hung close for a while, trailing just 45-43 with 7 1/2 minutes remaining in the half. Tatum then hit another 3 and the Celtics began to open it up, eventually going ahead 72-52 on Luke Kornet's dunk before Brooklyn scored the final five points of the half. \n\n\r\n              The lead grew to 93-70 on Tatum's dunk with 4:19 remaining in the third quarter but the Nets closed to 99-93 while he was resting in the fourth. Tatum returned and combined with Brown on a 7-0 run that pushed a seven-point lead to 109-95 with 5:38 to play. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996334.956754
}