{
  "game_id": "0022000341",
  "espn_id": "401267501",
  "date": "Feb 04, 2021",
  "matchup": "LAL vs. DEN",
  "headline": "LeBron's triple-double powers Lakers past Nuggets, 114-93",
  "body": "LOS ANGELES -- — LeBron James is not happy about the NBA's decision to hold an All-Star game amid a compressed regular season and a global pandemic.\n\n\r\n                    The Los Angeles Lakers superstar also knows there's no chance his presence won't be required in Atlanta next month — particularly not after his latest spectacular performance in a career that just keeps hitting new heights.\n\n\r\n                    James had 27 points, 10 rebounds and 10 assists, Dennis Schröder added 21 points and the Lakers roared away in the second half for a 114-93 victory over the Denver Nuggets on Thursday night.\n\n\r\n                    James moved into third place on the NBA’s career field goals list while recording his 96th career triple-double and his second of the season, helping the Lakers open a five-game homestand with their 11th win in 14 games. Los Angeles finished on a 46-18 run, thoroughly clamping down on defense and cranking up its transition offense to win this rematch of the Western Conference finals in the bubble.\n\n\r\n                    Although James stacked big numbers on another scoresheet, he was more impressed by his team's effort on the other end against high-powered Denver.\n\n\r\n                    “We hang our hats on our defense,” James said. “We’re the No. 1 defensive team in the league, and we want to continue that.”\n\n\r\n                    Talen Horton-Tucker scored 12 of his 17 points during that inspired second-half effort by the defending NBA champions, who returned from a strong seven-game road trip and improved their surprisingly unimpressive home record to 5-4. Several Lakers said their superb second half was inspired by an aggressive halftime talking-to from coach Frank Vogel.\n\n\r\n                    “When we put our minds to it, this team can do great things,” Vogel said. “We were able to basically double their scoring in the second half, 68-35. We did it against a great opponent. It was a heck of a second half for us.”\n\n\r\n                    The Lakers took control with a 19-0 run spanning the final two quarters propelled by James and Horton-Tucker, who drove impressively into the paint to make four straight shots along with two steals and a block.\n\n\r\n                    Jamal Murray scored 20 points and Monte Morris added 16 for the Nuggets, who struggled down the stretch of just their second loss in eight games.\n\n\r\n                    Nikola Jokic managed just 13 points and 10 rebounds after getting 47 points and 12 boards Sunday in the Nuggets' most recent outing against Utah.\n\n\r\n                    “Offensively, we just didn't move the ball enough,” Murray said. “They just ran us in that second half — layups, dunks.”\n\n\r\n                    Denver took a 12-point lead into halftime with a 29-16 rebounding edge, but the Lakers closed the third quarter with a 15-0 run.\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Gary Harris sat out after straining his left adductor muscle last weekend. ... Denver hadn't played since last weekend because its scheduled game with Detroit on Monday was scrapped.\n\n\r\n                    Lakers: Their 21-point margin of victory was the biggest in franchise history after trailing by double digits at halftime, surpassing a 20-point win at Phoenix on Christmas in 1968. ... Anthony Davis had 13 points and nine rebounds.\n\n\r\n                    VAULTING THE STILT\n\n\r\n                    James made a finger-roll layup midway through the first quarter for his 12,682nd career field goal, pushing him past Wilt Chamberlain for third place in NBA history. Only Kareem Abdul-Jabbar (15,837) and Karl Malone (13,528) ever made more shots. James became the third-leading scorer in NBA history a year ago, trailing only Abdul-Jabbar and Malone.\n\n\r\n                    “The association with a legend like Wilt Chamberlain, that does something for me,” James said. \"I’m someone who grew up reading about the game, studying the game. Wilt obviously was a big staple of that. It's very humbling.\"\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: At Kings on Saturday.\n\n\r\n                    Lakers: Host Pistons on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997314.9561331
}