{
  "game_id": "0022300226",
  "espn_id": "401584854",
  "date": "Nov 22, 2023",
  "matchup": "ORL vs. DEN",
  "headline": "Franz Wagner has big 2nd half as Magic hold off Nikola Jokic, Nuggets for 5th straight win",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 24 of his 27 points in the second half, Paolo Banchero added 23 points, and the Orlando Magic overcame Nikola Jokic's triple-double Wednesday night to record their fifth straight victory, 124-119 over the Denver Nuggets.\n\n\r\n              Jokic finished with 30 points, 13 rebounds and 12 assists for the Nuggets, who fell to 4-4 without injured guard Jamal Murray. The triple-double was the sixth of the season for Jokic and 111th of his career.\n\n\r\n              Michael Porter Jr. scored 25 points for the defending NBA champions, who lost for the third time in four games on their current trip.\n\n\r\n              The Magic took the lead for good on a 3 by Banchero that broke a 115-all tie with 1:49 left. Last season's Rookie of the Year shot 4 of 5 from behind the arc, bringing his season percentage up to 45.4%. He shot 29.8% on 3s last season.\n\n\r\n              “A lot of teams try to stop me from getting to the rim so my whole thing is just making ’em pay,” Banchero said. “I’ve always been a good shooter so it’s just believing in it and taking the right ones, the ones that are in rhythm, the ones that feel good. And when I take 'em I’m shooting with confidence.”\n\n\r\n              The number that stood out for Denver coach Michael Malone was the Magic's 42 points in the fourth quarter.\n\n\r\n              “They’re a good team,” Malone said. “They’ve won five in a row, they’re 10-5, they’ve got the No. 1 defense (in opponents' points per 100 possessions). Their bench scored 58 points tonight. But that’s a game we should have won. We did not make enough plays down the stretch on either end. You can’t allow a good team to score 42 points when the game is hanging in the balance.”\n\n\r\n              Wagner and Banchero combined to score Orlando's first 21 points of the second half, but nine Magic players scored in the final quarter. Goga Bitadze, Jalen Suggs and Wagner clinched the win with six straight free throws in the final 14 seconds.\n\n\r\n              The game was tied at 108-all with 4:25 remaining when Jokic was called for a foul as he swung his arms around to get untangled from Suggs as they were running up the floor.\n\n\r\n              Jumpers by Wagner and Banchero then put Orlando up by four, but Kentavious Caldwell-Pope hit a 3-pointer and Aaron Gordon drove for a layup that put Denver back ahead briefly.\n\n\r\n              Jokic had 15 points in the fourth quarter, all of them from under the basket and the foul line.\n\n\r\n              “We knew it was going to be Jokic down the stretch so our main focus was taking the 3-point line away and making it tough on Jokic,” Banchero said. “Obviously he can get wherever he wants but we wanted to make it challenging. We don’t want to over-help or overreact and then give up a 3-pointer to Porter or Caldwell-Pope.”\n\n\r\n              Jokic, whose first-half ejection at Detroit on Monday marked the first time since March 14 that he had not finished with a double-double, had 13 points, five rebounds and eight assists at halftime.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Visit Houston on Friday.\n\n\r\n              Magic: Host Boston on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995739.5457752
}