{
  "game_id": "0021701093",
  "espn_id": "400975839",
  "date": "Mar 24, 2018",
  "matchup": "DAL vs. CHA",
  "headline": "Dwight Howard has 23 rebounds, Hornets hold off Mavs 102-98",
  "body": "DALLAS --  It was as if Dwight Howard didn't even have a game off.\n\nHoward had 23 rebounds and 18 points to cap an eventful four days and the Charlotte Hornets held off the Dallas Mavericks 102-98 on Saturday night for their third straight victory.\n\nHoward had a career-high 30 rebounds and scored 32 points against Brooklyn on Wednesday night, then served a one-game suspension for his 16th technical foul of the season as Charlotte beat Memphis 140-79 on Thursday night.\n\nThat's 50 points and 53 rebounds in Howard's last two games.\n\n\"I was just trying to get as many rebounds as I can,\" he said. \"Dominate the paint, set some screens for Kemba (Walker) and the rest of the guys to open up everything else in the paint.\"\n\nCharlotte led by as many as 15 points, but Dallas cut it to 87-86 on two of Yogi Ferrell's 11 fourth-quarter points.\n\n\"He's getting better all the time,\" Dallas coach Rick Carlisle said. \"His level of confidence gets higher and higher.\"\n\nThe Mavericks had a chance to win after rebounding a miss by Charlotte's Jeremy Lamb, but Walker stole the ball from Dennis Smith Jr. and Dallas had to foul Marvin Williams with five seconds left. He made both free throws.\n\n\"At that particular time, I had to get on the floor and fight for the basketball,\" Walker said. \"I was able to poke it loose.\"\n\nSmith answered two versions of the same question the same way.\n\n\"I turned it over. I've got to be better in those situations.\" Dallas has lost five games in a row.\n\nWalker scored 24 points, and Smith led the Mavericks with 21.\n\nLamb had 14 points, and Malik Monk scored 11 for the Hornets.\n\nDallas' Harrison Barnes scored 18 points, Ferrell finished with 16, Doug McDermott had 14 and J.J. Barea added 10. Nerlens Noel had 10 points and 12 rebounds.\n\nAfter three quarters, the Hornets had a 79-70 lead before the Mavericks rallied.\n\n\"Dallas, despite their record and where they are, they played hard tonight,\" Howard said.\n\nDallas led 27-22 after the first quarter, but the Hornets came back to tie the score 30-30 on a 3-point shot by Frank Kaminsky. A 17-7 run capped by Malik Monk's 3-pointer gave Charlotte a 47-37 lead. Dallas reduced the margin to six points, 54-48, at halftime.\n\nMonk scored eight points in the second quarter, and Kaminsky had seven as the Hornets' bench helped outscore Dallas 32-21.\n\n\"We had gotten into a rhythm where the second unit was playing really well,\" Charlotte coach Steve Clifford said. \"That was this group here, it was their best stretch so far.\"\n\nTIP-INS\n\nHornets: Howard's double-double was his 45th this season. He leads active players with 711 career double-doubles. ... Lamb, an 86 percent free throw shooter, missed both attempts with 2:29 left in the first half.\n\nMavericks: Smith returned after missing two games because of a sprained left ankle. He said he was fine. ... Harrison Barnes' nine first-half points all came on three 3-pointers in a 2:15 span in the first quarter. Dallas went from trailing 10-9 to a 20-13 lead during that spurt.\n\nOH, SAY\n\nThe pre-game National Anthem wasn't going as quickly as Howard would have liked. For the last few bars, Howard gestured toward the singers and mimicked conducting them at a faster tempo.\n\nCAN YOU THREE?\n\n\"They killed us from the 3-point line, 48 percent and 12 for 25,\" Carlisle said. \"That was the biggest difference in the game to me.\"\n\nWalker was 4 for 8 and Monk was 3 for 5. The Mavericks made 29 percent, 12 for 41. Barnes was 5 for 11 and McDermott 3 for 5, but Dirk Nowitzki missed all five attempts.\n\nUP NEXT\n\nHornets: Host New York on Monday night.\n\nMavericks: At Sacramento on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764993937.620406
}