{
  "game_id": "0022400742",
  "espn_id": "401705308",
  "date": "Feb 08, 2025",
  "matchup": "IND @ LAL",
  "headline": "Austin Reaves scores a career-high 45, and the Lakers shock the Pacers 124-117 without LeBron, Luka",
  "body": "LOS ANGELES -- — Austin Reaves scored a career-high 45 points and the streaking Los Angeles Lakers beat the Indiana Pacers 124-117 on Saturday without LeBron James or Luka Doncic.\n\n\r\n              Rui Hachimura scored 24 points for LA on his 27th birthday. The Lakers have won five straight and 11 of 13.\n\n\r\n              Los Angeles jumped to a 25-point lead in the first half, and Reaves scored 14 points in the fourth quarter while the Lakers held off Indiana, the fourth-place team in the Eastern Conference, even without their two superstars.\n\n\r\n              James sat with left ankle soreness, while Doncic watched his third straight game from the Lakers’ bench as he nears a return from the strained left calf that has sidelined him since Christmas. James and Doncic sat together and talked throughout the game ahead of their expected joint debut Monday against Utah.\n\n\r\n              Pascal Siakam scored 23 points and Tyrese Halliburton had 19 for the Pacers, who erased most of their huge deficit before fading in the fourth quarter. Indiana lost for only the fourth time in 17 games.\n\n\r\n              Reaves nearly didn’t play because of a sore left elbow, but elected to suit up with the Lakers’ two stars sidelined. He scored 14 points in the first quarter and added a flurry of eight points early in the fourth, setting his career high on a steal and a dunk with 7:37 to play amid a standing ovation.\n\n\r\n              Takeaways\r\n              Pacers: An awful first half without Myles Turner, who sat with a head injury.\n\n\r\n              Lakers: In his Lakers debut, journeyman guard Jordan Goodwin played 25 minutes and hit a key 3-pointer with 2:26 to play.\n\n\r\n              Key moment\r\n              The Lakers had a third straight phenomenal first half, making 15 of 21 shots and leading 53-28 midway through the second quarter.\n\n\r\n              Key stat\r\n              Indiana went 31 of 32 from the free-throw line.\n\n\r\n              Up next\r\n              The Pacers host the Knicks on Tuesday. The Lakers host the Jazz on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998132.1689548
}