{
  "game_id": "0022000097",
  "espn_id": "401267257",
  "date": "Jan 04, 2021",
  "matchup": "TOR vs. BOS",
  "headline": "Tatum scores 40 in Celtics' 126-114 win over Raptors",
  "body": "TAMPA, Fla. -- — Jayson Tatum scored 40 points and the Boston Celtics rolled to a 126-114 win over the Toronto Raptors on Monday night.\n\n\r\n                    Playing without three of their top guards, the Celtics shook off a slow start to lead by as many as 26 in the second half. They shot 48.8% overall.\n\n\r\n                    Tatum turned the game around with 21 points in the second quarter. He hit five 3-pointers on the night and converted all 13 free throws, finishing one point short of his career high set against New Orleans last January. \n\n\r\n                    “Disappointed? No,” Tatum shrugged. “I’m going to get there soon enough.”\n\n\r\n                    Rookie guard Payton Pritchard had 23 points and eight assists in 32 minutes for the Celtics (5-3), and Jaylen Brown scored 19. Robert Williams III came off the bench to contribute 11 points and 15 rebounds.\n\n\r\n                    “Tatum was tremendous tonight but we had a lot of good performances, playing on a back-to-back with no excuses,” Boston coach Brad Stevens said. “We had a lot of guys out.”\n\n\r\n                    Playing in front of fans for the first time in 10 months was a refreshing change for Tatum. A maximum-allowed crowd of 3,740 attended the game in 19,000-seat Amalie Arena.\n\n\r\n                    “It felt great,” he said. “I missed playing in front of people. There were a lot of Boston people here. It felt different with people in the stands, but I enjoyed it.”\n\n\r\n                    Fred VanVleet led the Raptors (1-5) with 35 points and eight rebounds.\n\n\r\n                    VanVleet scored 14 in the first quarter and Toronto made seven of its first nine 3s to lead 28-15 through the first eight minutes. But the Raptors missed their next 13 tries from 3-point territory, and by the time VanVleet hit one with 7:24 left in the third quarter, they were down by 15.\n\n\r\n                    Tatum took over late in the first half, scoring 13 points during an 18-2 Boston run. He finished the half with four straight free throws to put the Celtics up 61-46. They stretched the lead to 23 in the third quarter, and when Tatum went to the bench with five fouls with 9:52 left in the game, Boston led 109-83.\n\n\r\n                    The Raptors, who have held double-digit leads in every game this season, shot 40% overall and finished 13 for 37 from behind the arc.\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Injuries to Marcus Smart (sprained right thumb) and Jeff Teague (sprained left ankle) depleted the backcourt. Kemba Walker is still recovering from a knee injury. ... Tremont Waters got his second NBA start at point guard. ... Boston had a 56-37 advantage in rebounds.\n\n\r\n                    Raptors: VanVleet tied C.J. Miles' franchise record of 38 consecutive games with a 3-pointer. ... Raptors coach Nick Nurse said 6-foot-6 Stanley Johnson will get more minutes because Toronto's smallish guards have been getting burned on defense. “I can't keep putting out another small guard,” Nurse said. “Defense is mostly what we need.” ... The Raptors entered as the worst shooting team (41.4%) in the NBA.\n\n\r\n                    NO HOME TEAM TO VISIT\n\n\r\n                    The irony of playing on the road against a team playing 1,300 miles from its real home was not lost on Stevens, who didn’t see an advantage nor a disadvantage to playing in Tampa. “It is pretty interesting that the first time we’re going to play in front of fans is down here in Florida,” he said.\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Conclude a four-game road trip Wednesday night at Miami in their first meeting since Sept. 27, when the Heat eliminated the Celtics in the Eastern Conference finals. \n\n\r\n                    Raptors: Open a four-game Western swing at Phoenix on Wednesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996901.795286
}