{
  "game_id": "0022200547",
  "espn_id": "401468702",
  "date": "Jan 01, 2023",
  "matchup": "MEM vs. SAC",
  "headline": "Morant, Jones lead Grizzlies to 118-108 victory over Kings",
  "body": "MEMPHIS, Tenn. -- — Ja Morant scored 35 points, Tyus Jones added 18 and the Memphis Grizzlies broke open a close game in the fourth quarter to beat the Sacramento Kings 118-108 on Sunday night.\n\n\r\n              Dillon Brooks added 15 for Memphis, while Jaren Jackson Jr. finished with 14 and three blocks as the Grizzlies won their third straight. Morant added eight rebounds and five assists. Jones had eight assists and Steven Adams tied his career-high with 23 rebounds.\n\n\r\n              That total included a career-best 13 offensive rebounds.\n\n\r\n              “That's where he is at, down in the trenches,” Morant said. “I don't think anybody else is going to go down there and battle with him. He's a man among boys.”\n\n\r\n              Adams didn't quite get Morant's references to battling in the trenches. “I don't know what that means, but yeah, in the trenches. In the bloody trenches.”\n\n\r\n              De'Aaron Fox led the Kings with 19 points, while Malik Monk scored 18 providing a spark off the Sacramento bench. Domantas Sabonis matched Monk's 18 points and grabbed 14 rebounds.\n\n\r\n              But Sacramento coach Mike Brown said his team didn't play along the lines they discussed before the game. He wanted the Kings to make simple passes and work for open shots. Instead, he said the game sped up, leading to turnovers and eight blocked shots by Memphis. \n\n\r\n              \"This team is really good at protecting the paint,\" Brown said. “They're long. They're athletic. They do a great job of shrinking the floor, and you have to have patience offensively.”\n\n\r\n              In a closely played first half, Morant led the Grizzlies with 18 points enroute to a 59-58 advantage at the break.\n\n\r\n              The Grizzlies would manage to pull away in the fourth, building the lead to as many as 14 while outscoring the Kings 27-21 in the final frame. As usual, Memphis dominated the paint 64-44.\n\n\r\n              “This team, they struggle at the rim,\" Adams said of the Kings. “They have no rim protection. So that was our main goal — attack the paint, attack the paint. That's our goal in general. We're a big point-in-the-paint team.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: Won their two previous games over Denver and Utah by a one-point margin in each. ... Are now 8-9 on the road. ... Fox started his 340th game with Sacramento, tying him with Reggie Theus for 12th on the all-time franchise list. ... Harrison Barnes grabbed his 4,000th rebound midway through the third quarter. \n\n\r\n              Grizzlies: The game was the first game in Memphis on New Year's Day in franchise history. The Grizzlies have played four on the road on New Year's Day and the only other home game to open the new year was in 1998 when the team was in Vancouver. ... G Desmond Bane sat out the game — the second of a back-to-back — with injury management on a right big toe injury that kept him out 17 games. ... John Konchar started in Bane's spot.\n\n\r\n              PARITY MEANS BALANCE\n\n\r\n              Entering the night, Memphis was in third place in the Western Conference, and Sacramento was fifth, all part of a logjam at the top of the conference standings. Memphis was a game behind West-leading Denver, and Sacramento was 3 1/2 off the Nuggets' pace. Utah, in 10th place, is only six games behind. Kings coach Mike Brown said it was representative of how the league is trending. “That's why the league, in my opinion, is so close,\" he said. \"You look at the standings. This is the closest I've ever seen it in my 31 years.”\n\n\r\n              LAST WORD\n\n\r\n              “We just enjoy getting stops so we don't have to play any more defense.” — Grizzlies center Steven Adams\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Utah on Tuesday.\n\n\r\n              Grizzlies: At Charlotte on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994207.222246
}