{
  "game_id": "0022301135",
  "espn_id": "401585763",
  "date": "Apr 07, 2024",
  "matchup": "CHA vs. OKC",
  "headline": "Josh Giddey has 11th career triple-double, Thunder hold off Hornets 121-118 to snap 3-game skid",
  "body": "CHARLOTTE, N.C. -- — Josh Giddey had 20 points, 13 assists and 13 rebounds for his 11th career triple-double, Isaiah Joe had two key 3-pointers in the final 1:30 and the Oklahoma City Thunder beat the Charlotte Hornets 121-118 on Sunday night to snap a three-game losing streak.\n\n\r\n              Oklahoma City remained third in the Western Conference, a game behind Denver and Minnesota.\n\n\r\n              The Thunder had lost their previous three games — their longest skid of the season — with stars Shai Gilgeous-Alexander and Jalen Williams out with injuries.\n\n\r\n              But Aaron Wiggins stepped up with 26 points and Chet Holmgren had 20 points and 10 rebounds as the Thunder escaped with a win when the cold-shooting Brandon Miller missed a 3-pointer at the buzzer that would have sent it to overtime.\n\n\r\n              Eight of the Thunder's last 10 games have been on the road, and they went 5-5 during that stretch. They'll finish the season with games at home against Sacramento, San Antonio, Milwaukee and Dallas.\n\n\r\n              “We weren't great in a lot of areas, and it was an ugly one,\" Giddey said. \"But at this part of the year you take the wins you get. ... Now hopefully we can close out the regular season the right way.\"\n\n\r\n              Thunder coach Mark Diagneault said playing without Gilgeous-Alexander and Williams could be beneficial for his team heading into the postseason as it has given other players a chance to gain confidence with more playing time.\n\n\r\n              “Hopefully, when we insert Shai and Jalen back in the lineup they will maintain that confidence,” Diagneault said. \n\n\r\n              Grant Williams led the Hornets with 19 points, and Vasa Micic had 17 points and 10 assists. \n\n\r\n              Micic, Tre Mann and Davis Bertans — three players they traded to the Hornets on Feb. 8 for Gordon Hayward — nearly handed the Thunder what would have been a terrible loss, potentially costing them a chance to move up in the standings. \n\n\r\n              Micic made plays all night, Mann had 18 points and six assists and Bertans made four 3s helping the Hornets cut the Thunder's 10-point halftime lead to one entering the fourth quarter.\n\n\r\n              “They were all great tonight,” Giddey said about his former teammates. “We have a really close team and those guys are just as much a part of it as anybody. It was awesome to see them doing so well, but it would have been great if they had done this on another night.”\n\n\r\n              Said Diagneault: “They've flourished with more opportunities\" in Charlotte.\n\n\r\n              Charlotte would take its first lead of the game at 106-105 with five minutes left to play when Micic hit Nick Rick Richards with a wild, rolling pick-and-roll alley-oop for a dunk bringing the home crowd to its feet.\n\n\r\n              It would go back and forth from there before Joe splashed a 3 for a 118-115 Thunder lead with 1:27 left.\n\n\r\n              Micic tieed it on a drive, but Joe hit another 3 from the top of key, this one coming of a pick-and-pop with the Holmgren as the ball handler and Joe the screener.\n\n\r\n              Hornets coach Steve Clifford said that is tough play to defend.\n\n\r\n              “When you have a center handling the ball and a point guard screening for him, most teams don't do that,” Clifford said. “The only other guy who could possibly do it would probably be (Nikola) Jokic. It’s not a coverage that you're used to playing.\"\n\n\r\n              With Charlotte trailing by 3, Miller drove to the hole for a layup instead of shoot a potential tying 3, cutting the lead to one. The Hornets fouled Giddey and he made two free throws on the other end.\n\n\r\n              Miller then missed a leaning 3 at the buzzer.\n\n\r\n              Bridges also missed two 3s in the final minute and he and Miller finished a combined 2 of 15 from behind the arc.\n\n\r\n              UP NEXT:\n\n\r\n              Thunder: Close out season with a four-game homestand beginning Tuesday night against Sacramento.\n\n\r\n              Hornets: Host Dallas on Tuesday night in their final home game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995932.236515
}