{
  "game_id": "0022200642",
  "espn_id": "401468797",
  "date": "Jan 14, 2023",
  "matchup": "CHA vs. BOS",
  "headline": "Tatum, Celtics roll past Hornets for 6th straight victory",
  "body": "CHARLOTTE, N.C. -- — Jayson Tatum scored 17 of his 33 points in a pivotal third quarter, Malcolm Brogdon added 30 points and the Boston Celtics beat the Charlotte Hornets 122-106 on Saturday night to push their winning streak to six.\n\n\r\n              Al Horford had 16 points and Marcus Smart added 13 points and 12 assists for the Celtics, who made 19 3-pointers and erased a 16-point, first-half deficit.\n\n\r\n              LaMelo Ball finished with 31 points, nine assists and seven rebounds for Charlotte. Terry Rozier had 21 points for the Hornets, who've lost seven of eight games.\n\n\r\n              Brogdon's 30 points were six shy of his career high. He was pressed into more playing time coming off the bench when Derrick White left with a neck injury in the first five minutes of the game.\n\n\r\n              “I think it's just this team's depth,\" Brogdon said. \"We have a lot of really good players on this team and it is just a next man up mentality.”\n\n\r\n              Tatum, who had 35 points in a 140-105 rout of the Hornets on Nov. 28, shook off a slow start and an early technical foul and finished 12 of 27 from the field. The crowd at Charlotte's Spectrum Center periodically erupted into chants of “MVP! MVP!” after Tatum wowed with a variety of special plays, including deep 3-pointers, driving dunks and fall-away jumpers.\n\n\r\n              The Hornets shot 57.8% in the first half and led by 16 before the Celtics came storming back late in the second quarter to cut the lead to 66-62 behind 12 3-pointers.\n\n\r\n              “I think we lose that game a month ago,” Celtics coach Joe Mazzulla. “... One of these things we talk about is closing out quarters and starting quarters, so the end of the second quarter was huge for us. I thought we did a great job staying the course.”\n\n\r\n              Boston began to pull away in the third quarter, outscoring the Hornets 33-19 behind Tatum, who was 7 of 12 from the field, including four 3-pointers.\n\n\r\n              Mazzulla said Tatum is learning how teams are guarding him, something that changes from night to night.\n\n\r\n              “He's done a really good of developing an awareness, because it changes night to night and quarter to quarter” Mazzulla said. “So he's done a nice job of building an awareness to what the coverage is and having a solution for that.” \n\n\r\n              The Celtics led by double digits most of the fourth quarter and were never challenged again.\n\n\r\n              The Celtics took advantage of 14 offensive rebounds and 15 second-chance points.\n\n\r\n              “Yeah, they shoot a lot of 3s, so there’s definitely going to be long rebounds, so we’ve got to just get those,” Ball said. \"I feel like they were getting a lot of second chance, third chance, all that type of stuff, so it’s going to be hard to win.” \n\n\r\n              The loss was the fourth straight for the Hornets (11-33), who have the second-worst record in the league, a half-game better the Houston Rockets.\n\n\r\n              “They’re terrific,” Hornets coach Steve Clifford said of the Celtics. \"They’re good enough to win it. They can score in bunches. But there’s a reason they’re top eight in both offense and defense. You can’t have a bad 3 1/2, four minutes. That makes it hard.”\n\n\r\n              WHITE INJURY\n\n\r\n              White started fast with eight points in the first four minutes, before leaving the game with a neck sprain after colliding with Smart. He did not return.\n\n\r\n              Mazzulla said he spoke with White after the game and he was “doing OK,” but said he didn't have a update on if he might miss any time.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Tatum picked up a technical foul in the first quarter for arguing a call.\n\n\r\n              Hornets: Mason Plumlee had 16 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              The teams will play again Monday at the Spectrum Center in a Martin Luther King Jr. Day matinee game.\n\n\r\n              ----\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994266.243445
}