{
  "game_id": "0021900186",
  "espn_id": "401160828",
  "date": "Nov 17, 2019",
  "matchup": "MEM vs. DEN",
  "headline": "Murray scores 39 as Nuggets rout Grizzlies 131-114",
  "body": "MEMPHIS, Tenn. --  Jamal Murray didn’t take long to erase a bad night against Brooklyn.\n\nMurray, who was missed 10 of 11 shots against the Nets last time out, connected on his first four on Sunday en route to a season-high 39 points as the Nuggets dominated the Memphis Grizzlies for a 131-114 victory.\n\n“It was just preparation,” Murray said of the difference. “I mean, I know I didn’t shoot well (against Brooklyn), so I wanted to bounce back. Start out by being aggressive. Miss or make.”\n\nMurray added eight assists with no turnovers on the night, while connecting on 14 of 24 shots, including 7 of 12 from 3-point range. Murray didn’t play in the fourth quarter after Denver held a 108-80 lead after three.\n\n“I had a feeling he was going to come out not only being aggressive, but shooting the ball at a high level,” Nuggets coach Michael Malone said. “He’s too good of a shooter to continue shooting the way he had been recently.”\n\nPaul Millsap had 23 points and Juancho Hernangomez finished with 15. Jerami Grant added 12 points as Denver won for the sixth time in the last seven, scoring a season high in points.\n\nJaren Jackson Jr. led Memphis with 22 points, including a career-high five 3-pointers. Jonas Valanciunas had 16 points and 10 rebounds. Brandon Clarke finished with 19 points, including 10 in the fourth quarter when the game was out of reach.\n\nA promising start offensively for Memphis, led by Valanciunas, eventually turned as the Nuggets’ defense tightened. Ja Morant’s flashy moves in the paint, along with other inside shots by Grizzlies shooters ended up returned by Denver rim protectors.\n\nDenver’s seven blocks, coupled with nine Memphis turnovers in the first half, translated to a 72-49 Nuggets lead at the half. The major damage came in the second quarter with Denver outscoring Memphis 44-17.\n\n“They raised their level to an elite level, and our guys just couldn’t really catch that second gear. It just wasn’t our day,” Grizzlies coach Taylor Jenkins said, later adding: “We tried to claw back here and there, but that second quarter kind of got away from us.”\n\nMurray already had 26 points by halftime, and characteristic of a young Memphis team, the Grizzlies simply didn’t have the experience to counter the Nuggets’ burst. Denver would eventually lead by as many as 33.\n\n“Tonight, they just made shots,” said Morant, who had 13 points and six assists to go with four turnovers.\n\nThe Nuggets had 29 fast-break points to only 10 from Memphis, much of Denver’s a result of a defense that recorded 10 blocked shots and forced 16 Grizzlies turnovers leading to 25 points.\n\n“I think that’s a fun way to play when you can play defense, when you can rebound and get out and run before they set their defense,” Malone said. “When you are running and sharing the ball, it is even that much more fun, so it was great.”\n\nTIP-INS\n\nNuggets: Gave up 100 points for only the second time in the last seven games. … Will Barton, who was listed as probable after having left adductor tightness against the Nets, started but was limited to six points. … Previous high for points this season was 121 against Atlanta on Nov. 12. … Hernangomez was 5 of 6 from the field, including 4 of 5 from 3-point range. …Had 36 assists, a season high.\n\nGrizzlies: Valanciunas has reached double figures in 12 straight games. … Memphis has made at least 10 3-pointers in seven straight games, matching the franchise record set in March of last season. … Entered the game leading the NBA with 55 points in the paint per game. Managed only 40 against the Nuggets.\n\nTEAMMATE TRANSLATION\n\nHernangomez, in his fourth season out of Spain, was praised by Malone for the energy he brings to the Nuggets. Malone said the 6-foot-9 forward is contagious with the energy. “He’s one of the best teammates I’ve ever had,” Murray said. “He’s always the first one to stand by the bench and clap for his teammates and cheer. He’s always talking, even if he can’t talk English.”\n\nUP NEXT\n\nNuggets: Open a four-game homestand against the Houston Rockets on Wednesday.\n\nGrizzlies: Host the Golden State Warriors on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995756.681893
}