{
  "game_id": "0021600291",
  "espn_id": "400899733",
  "date": "Dec 03, 2016",
  "matchup": "MIL vs. BKN",
  "headline": "Bucks win fourth straight with 112-103 victory over Brooklyn",
  "body": "MILWAUKEE --  Bucks coach Jason Kidd wondered if his young team could rebound from a third-quarter lull.\n\nMilwaukee's kids did just that, winning their fourth straight game despite letting a 16-point third-quarter lead slip away.\n\nMatthew Dellavedova scored 12 of his season-high 18 points in the fourth quarter, helping the Bucks hold off the Brooklyn Nets 112-103 on Saturday.\n\n\"I thought it got a little sloppy,\" Kidd said. \"I wanted to see if they were going to figure it out. I wasn't going to call timeout. I wanted to see if they were going to talk themselves through it because that's what good teams do.\"\n\nMilwaukee led 62-46 after a layup by Tony Snell with 8:11 left in the third, but Brooklyn closed the quarter on a 26-13 run to get within 75-72. Consecutive 3-pointers by Joe Harris gave the Nets an 82-81 lead with 10:00 to play.\n\nSean Kilpatrick scored 13 of his 19 points in the third quarter, when he went 8 for 8 from the foul line.\n\n\"It definitely wasn't anything the coach did,\" Nets coach Kenny Atkinson said. \"It was all the players playing well. We didn't change anything and kept with our rotations. The guys came out with focus.\"\n\nWith the game tied at 94, Milwaukee began a 9-1 run to lead 103-95 with 1:43 remaining.\n\n\"We had a chance in the third quarter to break the game wide open, and we didn't take it,\" Dellavedova said. \"They came back and played well. We then did a good job of pulling away.\"\n\nJohn Henson led Milwaukee with 20 points and added seven rebounds, Giannis Antetokounmpo had 16 points and 10 rebounds, Jabari Parker added 15 points, Greg Monroe scored 13 points and Snell chipped in 10 points.\n\n\"They were just finding me,\" Henson said. \"I was open. (Antetokounmpo and Parker) are huge threats coming down the lane and off a pick-and-roll, so it is my job to finish for them and take a little heat off of them.\"\n\nBojan Bogdanovic led Brooklyn with 24 points. Brook Lopez had 13 points but was just 3 for 17 from the field and 0 for 10 in the first half.\n\n\"I just wasn't good enough,\" Lopez said. \"I made a lot of turnovers. I missed a lot of shots that I need to make. I think I let us down on both ends of the floor.\"\n\nTIP-INS\n\nNets: Forward Trevor Booker missed the game due to an illness. Anthony Bennett started in his place and had seven points and a career-high 14 rebounds. ... Lopez grabbed four rebounds to tie Derrick Coleman for second place on the Nets career list with 3,690.\n\nBucks: Milwaukee is 10-0 after leading at halftime and 8-0 when leading after three quarters. ... The Bucks scored 62 points in the paint. ... Antetokounmpo tied his career high with five blocked shots.\n\nFAMILIAR FOES\n\nMilwaukee and Brooklyn were playing for the second time in three days after the Bucks beat the Nets 111-93 on Thursday night.\n\nThe Bucks will face the same team in consecutive games four more times this season, including home-and-homes later this month with the Bulls, Cavaliers and Wizards.\n\nUP NEXT\n\nNets: Brooklyn hosts Washington on Monday night. The Nets went 0-3 against the Wizards last season.\n\nBucks: Milwaukee hosts San Antonio on Monday night. The Bucks have lost eight straight games to the Spurs.",
  "source": "espn_api",
  "crawled_at": 1764995209.850497
}