{
  "game_id": "0021900253",
  "espn_id": "401160895",
  "date": "Nov 27, 2019",
  "matchup": "BKN @ BOS",
  "headline": "Walker scores 39, Celtics beat Nets 121-110",
  "body": "BOSTON --  Kemba Walker scored 39 points in his first game back after leaving the court on a stretcher, with his neck in a brace.\n\nIt was almost enough to make the Boston fans forget about the guy he replaced.\n\nBut not quite.\n\nOn a night the fans seemed more interested in taunting former Celtics point guard Kyrie Irving, Walker returned from a neck injury to score a season high and lead Boston to a 121-110 victory over the Brooklyn Nets on Wednesday night.\n\n\"I've been over it. I could have played last game, honestly,\" Walker said. \"If I'm on the court, I'm on the court. I wasn't thinking about anything (but) wanting to win.\"\n\nWalker left Boston's game against Denver on Friday after a head-to-torso collision with Semi Ojeleye and missed Monday's game against Sacramento. He played 31 minutes on Wednesday, adding six rebounds and four assists. He scored 13 in the third quarter, when the Celtics scored nine in a row to turn a one-point deficit into a 91-83 lead they never relinquished.\n\nCeltics coach Brad Stevens said sometimes head-first collisions can be serious even though they don't look all that bad, and sometimes the ones that look bad turn out to be minor.\n\n\"For him to be playing, and even feeling fresh, five days later is very fortunate,\" Stevens said. \"It's good to see.\"\n\nJaylen Brown added 22 points and 10 rebounds and Jayson Tatum had 16 points and nine boards for the Celtics, who improved to 7-0 at home.\n\nGarrett Temple scored 22 points and Joe Harris had 21 for Brooklyn, which made a season-high 21 of the 56 3-point shots it attempted. Jarrett Allen had 17 points and 14 rebounds, and Spencer Dinwiddie had 16 points and 11 assists.\n\nBut the biggest name for the Nets -- at least as far as the Boston fans were concerned -- was Irving, who has missed the last seven games with a sore shoulder. The crowd came to heckle him, even in his absence.\n\nPosters branding him as a coward decorated the arena entrance. A few fans who showed up wearing his No. 11 Celtics jersey with the words \"Where is?\" written on tape above his name. During the introductions, with Irving nowhere to be seen, the first \"Kyrie Sucks!\" chant broke out; it was repeated about a dozen times throughout the game. (There was also a \"Yankees Suck!\" chant, just because.)\n\n\"I don't give a second thought,\" Nets coach Kenny Atkinson said. \"Just tune it out.\"\n\nAbout an hour after the game ended, Irving posted a long Instagram story calling sports and entertainment \"ignorant and obtrusive.\"\n\n\"It's one big show that means very VERY little in the real world that most people live in,\" the lengthy and rambling post said before concluding with: \"Don't fall for the Game that's played in front of you for Entertainment, it'll never be as serious dealing with LIFE.\"\n\nThe Nets, like the Celtics before them, are doing better without him.\n\nThey came into the night with a 5-1 record since Irving went out with a sore shoulder, climbing above .500 for the first time this season. The Celtics made it to the Eastern Conference finals two years ago when Irving was injured, and lost in the second round last season with him.\n\nTIP-INS\n\nNets: Have not beaten the Celtics in Boston in their last seven tries. They had won three in a row on the road; they have not won four straight road games since 2008.\n\nCeltics: Injured forward Gordon Hayward took the microphone to wish the crowd a happy Thanksgiving before the opening tip.\n\nTURNING POINT\n\nBrooklyn led 83-82 with just over 3 minutes left in the third when the Celtics scored the next nine points before Temple made a 3 to close out the third quarter. Boston led 104-101 in the fourth before scoring 17 of the next 24 points -- nine of them from Walker -- to put away the game.\n\nMAN OF MANY TALENTS\n\nWhen the ball got stuck between the backboard and the shot clock in the final minutes, Celtics guard Marcus Smart grabbed a mop to jar it loose. The fans responded with an \"M-V-P!\" chant.\n\nSmart also pulled off a similar rescue on Monday night.\n\n\"He's one of a kind,\" Stevens deadpanned. \"We knew when that ball was stuck behind the backboard there was only one man to get it done.\"\n\nUP NEXT\n\nThe teams play each other on Friday in Brooklyn.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996435.9073532
}