{
  "game_id": "0021900278",
  "espn_id": "401160920",
  "date": "Nov 29, 2019",
  "matchup": "CHI @ POR",
  "headline": "Carmelo Anthony's double-double, Hassan Whiteside's 10 blocks lift Blazers",
  "body": "PORTLAND, Ore. -- Carmelo Anthony can't recall another a 10-block game like Trail Blazers teammate Hassan Whiteside had against the Bulls.\nAnthony had 23 points and 11 rebounds and the Blazers downed Chicago 107-103 on Friday night for their second victory over the Bulls this week. But Whiteside stole the show with 8 points, 15 rebounds and a franchise-record 10 blocks for Portland.\n\"Never seen that before, and I've played with some great shot-blockers,\" Anthony said. \"Tyson Chandler was a great shot blocker, Marcus Camby was a great shot-blocker. I've never seen a guy with 10 blocks in a game.\"\nBefore Friday night, Anthony had played in two games where a player had 10 blocks; both were accomplished by Camby in the 2007-08 season, according to ESPN Stats & Information research.\nDamian Lillard added 28 points, including 10 in the final quarter, for the Blazers, who have won three straight after four consecutive losses.\nThe Blazers led by as many as 12 points in the third quarter, but the Bulls pulled within 85-84 in the final period. CJ McCollum stalled the rally with a 3-pointer for Portland.\nAnthony's 3 made it 91-84 with 7 minutes, 28 seconds left and he held up three fingers for the cheering Moda Center crowd as the Bulls called a timeout.\nLauri Markkanen's 3 closed the gap for Chicago to 93-92. Lillard answered with his own 3 to again hold off the Bulls. After Zach LaVine's corner 3 with 31.7 seconds left narrowed it to 105-103, Whiteside tipped in Lillard's shot for the win.\n\"I told the guys, I'm insurance now. When they go up for a layup, I'm going to be there. I might not get them all, I know a lot of people want me to get every single one, but I'm going to do my best job to get a lot of them,\" Whiteside said about his blocks.\nLaVine finished with 28 for the slumping Bulls, who have lost seven of their past nine games.\nThis was a frustrating one, very winnable,\" LaVine said. \"We were battling. Dame did what he did in the fourth quarter, turned it up to another level.\"\nThe Blazers have been boosted by the recent signing of Anthony, who scored 25 points in Portland's 117-94 victory over the Bulls in Chicago on Monday.\nThe Blazers acquired the 10-time All-Star to shore up the frontcourt and help the team overcome a slow start after going to the Western Conference finals last season. The deal was official Nov. 19.\nBetween the two games against the Bulls, the Blazers defeated Oklahoma City 136-119 on Wednesday night.\nThe Bulls fell to the injury-plagued Golden State Warriors 104-90 on Wednesday at the new Chase Center to open a three-game road trip.\nTomas Satoransky was a game-time decision for the Bulls with a left toe bruise, but started. Ryan Arcidiacono, who has been slowed by a right elbow strain, also played.\nCoby White's layup put the Bulls up 28-22 near the end of the first quarter but neither team was able to reach a double-digit margin in the first half. Lillard's layup gave Portland a 49-43 lead late in the opening half and the Blazers went into the break ahead 53-47.\nLaVine led all scorers with 18 points at the half, but four of the Blazers starters were in double figures, including Anthony.\nWhiteside had collected seven blocks by early in the third quarter, but he also picked up four personal fouls.\nThe Bulls pulled within 57-56 on Satoransky's 3-pointer, but Lillard came back with a 3 for Portland. The Blazers went up 72-60 midway through the third quarter on McCollum's 3-pointer as they appeared to pull away.\nBut White's 3-pointer narrowed the gap to 79-76 and the Bulls rallied to within three points heading into the fourth quarter.\n\"This loss hurts, this is a painful loss, every loss these guys take hurts,\" Bulls coach Jim Boylen said. \"This was a hard-fought game, give them credit.\"\nTIP INS\nBulls: The Bulls made 14 of 38 3-point attempts. ... Chicago went into the game with 187 steals this season, most in the league. ... It was the second of a three-game West Coast road swing that ends in Sacramento, California, on Sunday. ... The Bulls celebrated Thanksgiving and visited Nike while in Portland.\nTrail Blazers: Anthony's son Kiyan was at the game. ... Whiteside had four blocks in the first quarter alone. ... Portland has won seven straight against the Bulls. ... Anthony moved into 10th place in the NBA for 20-point games with 755.\nCAN THE BULLS BE SAVED? Forward Kris Dunn was asked afterward whether the Bulls' season was still salvageable. \"Absolutely,\" he said. \"If you look at the standings right now, things aren't going the way some teams would like it to go and that's good for us. We're still learning and trying to figure each other out. I think once we get a win and try to build off that, we can create a streak, and hopefully start creeping up the standings.\"\nUP NEXT\nThe Bulls wrap up the road trip at Sacramento on Monday night.\nThe Trail Blazers visit the LA Clippers on Tuesday, the first of a back-to-back set. They'll return home to play the Kings on Wednesday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764996361.073654
}