{
  "game_id": "401809949",
  "espn_id": "401809949",
  "date": "Oct 24, 2025",
  "matchup": "NO vs SA",
  "headline": "Wembanyama has 29 points, 11 rebounds and 9 blocks to lead Spurs past Pelicans, 120-116 in OT",
  "body": "NEW ORLEANS -- — Victor Wembanyama had 29 points, 11 rebounds and nine blocks before fouling out in overtime, and the San Antonio Spurs held on to beat the New Orleans Pelicans 120-116 on Friday night.\n\n\r\n              Devin Vassell, who had 23 points, hit a 3 in overtime. Julian Champagnie followed with another from deep shortly after to give the Spurs a 116-110 lead and the Pelicans could not recover.\n\n\r\n              Zion Williamson had 27 points and 10 rebounds for New Orleans. He made a free throw to tie it at 107 with 12 seconds left in regulation, but missed another for the lead. \n\n\r\n              The game went to overtime after Wembanyama, guarded closely by Williamson, missed a 15-foot fade as time ran out.\n\n\r\n              But Wembanyama dunked to open overtime and added his last block when he swatted away Trey Murphy's floater.\n\n\r\n              Luke Kornet had 14 points and 12 rebounds for the Spurs, grabbing nine of his teammates misses to help San Antonio total 20 offensive rebounds and 26 second-chance points. \n\n\r\n              Stephon Castle scored 16 points for the Spurs, including a 3 with 19.8 seconds left in regulation. \n\n\r\n              Dylan Harper scored seven of his 13 points during a pivotal 14-0, fourth-quarter run that gave San Antonio a 100-94 lead.\n\n\r\n              Murphy finished with 24 points and 10 rebounds for New Orleans, while Jordan Poole added 21 points. Pelicans rookies Derik Queen and Jeremiah Fears added 15 and 13 points. \n\n\r\n              Williamson got the better of Wembanyama on the game's first possession, using an explosive drive down the lane to set up a roundhouse dunk as he was fouled by the French star.\n\n\r\n              But that crowd-pleasing moment was short-lived as Wembanyama blocked consecutive Williamson layup attempts soon after.\n\n\r\n              Willliamson and Wembanyama each scored 12 points in the first half, after which New Orleans led 58-57.\n\n\r\n              Up next\r\n              Spurs: Host Brooklyn on Sunday.\n\n\r\n              Pelicans: Host Boston on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042493.4855921
}