{
  "game_id": "0022300132",
  "espn_id": "401584760",
  "date": "Nov 04, 2023",
  "matchup": "PHX @ PHI",
  "headline": "Joel Embiid, Kelly Oubre Jr. lead 76ers past Phoenix 112-100 for fourth straight win",
  "body": "PHILADELPHIA -- — The 76ers needed a lift from a big man out of Kansas each time the undermanned Suns made a run at the lead.\n\n\r\n              Joel Embiid?\n\n\r\n              Sure, the NBA MVP did his part with another double-double and even got to watch the fourth quarter from the bench.\n\n\r\n              But the former Jayhawk with the big buckets in this one — 17 points at the half — was Kelly Oubre Jr. The early surprise of the season, Oubre has done more than fit in with the Sixers, he found a way to stand out with his third 20-point game already.\n\n\r\n              “He's athletic and can put the ball on the floor and shoot,” Embiid said. “It's that simple.”\n\n\r\n              Embiid had 26 points and 11 rebounds, Oubre scored 25 points and the Philadelphia 76ers beat the Phoenix Suns 112-100 on Saturday for their fourth straight win.\n\n\r\n              With Bradley Beal (back spasms) and Devin Booker (sprained left ankle) sitting out, the Suns faltered in the fourth and lost their third straight game. Kevin Durant kept the Suns within striking range until late with 31 points. He made 12 of 14 free throws.\n\n\r\n              Tyrese Maxey overcame a slow start and had 22 points and 10 assists. Tobias Harris added 18 points and 10 rebounds for the Sixers.\n\n\r\n              The Sixers will go as far as Embiid and Maxey, who turned 23 on Saturday, will take them and neither one could get going in the first half. They combined for just a 7 of 23 effort from the floor. \n\n\r\n              Embiid was also whistled for a flagrant foul when he socked Jusuf Nurkic in the face with an elbow. Maxey bounced one into double coverage that led to a Suns bucket.\n\n\r\n              The 76ers were instead steadied by another solid outing from Harris and Oubre. \n\n\r\n              Harris has both been lost in the shuffle behind former Sixers who dominated the ball and disparaged by fans for not always living up to his $180 million deal. Oubre has been an early steal on a $2.9 million, one-year deal. He dropped 27 points off the bench in the season opener and started his second straight game after PJ Tucker was included in the James Harden trade to the Clippers. \n\n\r\n              “This summer was very stressful for me,” said Oubre, who didn't sign until September. “I had a lot of pent-up energy for this season.”\n\n\r\n              Oubre kept rolling in the third. He hit a 3 for a 63-51 lead and, after Durant scored late that pulled the Suns within five, Oubre stretched the lead on a three-point play. Oh, the other big man out of Kansas came through -- Embiid hit a 3 for an 80-75 lead through three.\n\n\r\n              Embiid and Oubre both played under coach Bill Self for one year at Kansas but were separated by a season. Embiid played 2013-14 and Oubre followed the next year. Oubre didn't necessarily seek Embiid for free-agent advice but followed him again — this time to join Embiid on an Eastern Conference contender.\n\n\r\n              “He's the best big man in the NBA,\" Oubre said. “The business side of it, no. But as far as having the best player on the court at all times, it opens up a lot of shots and good cuts and drives for me. That definitely played a big role in it.”\n\n\r\n              The Suns could have used Beal and Booker down the stretch. Coach Frank Vogel said there was no change in Beal’s status. He has yet to play this season. Booker has played only two games this season, including a 31-point game in a loss Thursday against San Antonio. Vogel said he hoped Booker could play in Detroit.\n\n\r\n              “It's the NBA. We’ve got to get used to it,” Vogel said. “That’s how this league is. There’s going to be guys in and out of the lineup. Everybody has to stay ready and be able to toggle between roles.”\n\n\r\n              UP NEXT\n\n\r\n              The Suns complete the back-to-back with another afternoon game Sunday in Detroit.\n\n\r\n              The 76ers host the Wizards on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996673.907656
}