{
  "game_id": "0021600056",
  "espn_id": "400899506",
  "date": "Nov 02, 2016",
  "matchup": "CHA vs. PHI",
  "headline": "Batum breaks out, leads Hornets past 76ers 109-93",
  "body": "CHARLOTTE, N.C. --  Nicolas Batum is learning that sometimes he needs to be a little more selfish on the court -- for the good of his team.\n\nThe Hornets' $120 million man bounced back from a slow start to the season by scoring 17 of his 20 points in a pivotal third quarter to  help Charlotte overcome a seven-point halftime deficit and defeat the Philadelphia 76ers 109-93 on Wednesday night\n\n\"I've got to play for myself sometimes,\" Batum said. \"In the third quarter, I felt like I came out and stepped up my game.\"\n\nDid he ever.\n\nBatum, who came into game shooting just 27 percent from the field and was limited to three points in the first half, was 6 of 8 in the third quarter with three 3-pointers as the Hornets outscored the 76ers 39-20.  Charlotte opened the second half on a 16-2 run and was never seriously challenged after that.\n\nThe 76ers didn't help themselves with eight turnovers in the third quarter that led to 12 Charlotte points.\n\n\"Nicolas Batum is an elite player and made some very difficult shots,\" 76ers coach Brett Brown said. \"We got jumped coming out of the locker room.\"\n\nBatum said he was too passive in the first half and passed up too many shots.\n\n\"You could tell that he was going to come out and look for his shot more,\" Clifford said. \"You could tell from his body language that he was upset, in a good way, that he knew we had to play better and he was aggressive right from the start.  I didn't say anything to him.\"\n\nKemba Walker led Charlotte (3-1) with 22 points.\n\nFrank Kaminsky provided a huge boost off the bench, finishing with 14 points for his second-straight double-digit game since returning from a sprained foot. Cody Zeller added 13 points in his first game since receiving a $56 million contract extension earlier this week.\n\nTIP-INS\n\n76ers: Jahlil Okafor was on a \"minutes restriction\" due to knee soreness and only played 23 minutes, scoring 12 points. ... Treveon Graham saw his first NBA action for the Hornets but played only one minute. ... Have lost six straight games to the Hornets. ... Committed 19 turnovers that led to 29 points.\n\nHornets: C Roy Hibbert missed his second straight game with right knee soreness. ... Jeremy Lamb (hamstring) was also out for Charlotte. ... The Hornets were 16 of 22 from the field in the third quarter.\n\nILYASOVA TALKS TRADE\n\nErsan Ilyasova, who was acquired in a trade Tuesday with the Oklahoma City Thunder, tied for a team-high 14 points on 5-of-12 shooting in his first game with the 76ers.\n\nWhile the 76ers have struggled in recent years, Ilysova believes there is talent to turn things around.\n\n\"We have to work together as a unit,\" said Ilysova, who joined the team on Tuesday. \"When you look at last year and the year before, those records stick with you. But winning is a habit and as soon as you start winning you feel more confident about yourselves.\"\n\nBrown said he was impressed with Ilysova, saying, \"You can see why we were attracted to him.  I think he's going to be an excellent complement to what we have.\"\n\nRIM PROTECTORS\n\nBrown said the 76ers are missing rim protection with Joel Embiid and Nerlens Noel still out.\n\n\"If you do get beat on the perimeter, there's an extra layer there behind that that has a chance to make a stop, to get a defensive play,\" Brown said. \"We've seen especially with Joel, him at the rim, how significant he can be. We haven't really seen Nerlens this year, but we have good memories from previous years.  Without those two, that's what you miss.\"\n\nHALFTIME ADJUSTMENT\n\nClifford said the Hornets went over the 76ers sets at halftime and talked about his team's one-on-one defense.\n\n\"We just got beat and we gave up a lot of penetration on pick-and-rolls and individual help plays.  In the second half, we did a lot better with that,\" Clifford said.\n\nThe 76ers were limited to 40 points in the second half.\n\nUP NEXT\n\n76ers: Things don't get easier for winless Philadelphia, which plays host to LeBron James and the Cleveland Cavaliers on Saturday night.\n\nHornets: Visit Brooklyn on Thursday night before returning home for a three-game home stand.",
  "source": "espn_api",
  "crawled_at": 1764995551.6632829
}