{
  "game_id": "0021500511",
  "espn_id": "400828398",
  "date": "Jan 04, 2016",
  "matchup": "TOR @ CLE",
  "headline": "Irving scores season-high 25, Cavaliers beat Raptors 122-100",
  "body": "CLEVELAND -- Here's more bad news for opponents of the Cleveland Cavaliers: Kyrie Irving is back.\nPlaying his sixth game since returning from a broken left kneecap, Irving scored a season-high 25 points and Cleveland defeated the Toronto Raptors 122-100 on Monday night.\nThe performance was a big moment for Irving, who faced nearly seven months of rehab after being injured in Game 1 of last season's NBA Finals.\n\"It's about getting better every game,\" said Irving, who returned to the lineup Dec. 20. \"It was so fun to be out there.\"\n\nIrving was 10-of-16 from the field with eight assists and six rebounds. The three-time All-Star scored 14 points in the second half when Cleveland pulled away enough that LeBron James sat out the fourth quarter.\n\"He's much better than an All-Star,\" said James, who had 20 points and seven assists in 31 minutes. \"If he continues to play the way he's been playing, but also progress in his game over the years, he can do something that's very special. I know in my head what he can become and tonight he showed it.\"\nIrving exchanged hugs with James and Cavaliers coach David Blatt on the court after the game.\n\"Honestly, I just told him, `Man, it's good to have you back and looking at full strength,\" Blatt said. \"It felt like he was himself tonight. It just looked like the old Kyrie.\"\nJ.R. Smith scored 24 points on eight 3-pointers, and all five Cleveland starters finished in double figures. Tristan Thompson added 14 points with 11 rebounds, and Kevin Love scored 14 as Cleveland improved to 15-1 at home.\nThe Cavaliers used a 21-9 run late in the third quarter to finally open up some distance on the Raptors, who were led by Kyle Lowry's 23 points.\nSmith's 3-pointer midway through the third broke a 69-all tie.\nTwo dunks and a 3-pointer by James, Irving's layup and Matthew Dellavedova's 3-pointer keyed the spurt for Cleveland, which led 90-78 going into the fourth.\nSmith's eight 3s were a season high, and the Cavaliers hit 17 of 33 for the game.\n\"That won the game for them right there,\" Lowry said. \"They're a real good team and they're the Eastern Conference champs for a reason, so they're the team to beat.\"\nDellavedova added 11 points. Love, who didn't participate in the morning shootaround because he wasn't feeling well, played 33 minutes and grabbed nine rebounds. The final margin was Cleveland's biggest lead.\nDeMar DeRozan scored 19 for Toronto, which played without forward DeMarre Carroll (sore right knee).\nINJURY WOES\nCarroll's knee injury has forced him to play at less than 100 percent and kept him out Monday. \"His right knee is swollen a little bit more than usual,\" coach Dwane Casey said. \"It's a concern, but we've got to look at the long term with him and get him right.\"\nLONG TRIP\nThe Cavaliers begin a six-game road trip Wednesday in Washington. The trip also includes stops in Minnesota, Philadelphia, Dallas, San Antonio and Houston. Cleveland doesn't play at home again until Jan. 18 against Golden State, another rematch of last season's NBA Finals.\n\"We only have one back-to-back,\" James said. \"We'll see what happens. It starts in D.C., a team that beat us really good (in Cleveland on Dec. 1). We remember that.\"\nTIP-INS\nRaptors: Lowry, who has three straight double-doubles, was called for a technical foul late in the game. ... Lowry scored 27 points Nov. 25 when the Raptors defeated the Cavaliers 103-99 in Toronto. ... F Anthony Bennett, selected by Cleveland with the No. 1 pick in the 2013 draft, was inactive and has appeared in only 10 games, averaging 1.9 points.\nCavaliers: Cleveland is 9-1 against the Atlantic Division this season. The only loss came at Toronto. ... The Cavaliers have won four straight since moving Thompson into the starting lineup over Timofey Mozgov. ... Cleveland made all 11 of its free throw attempts in the first half.\nUP NEXT\nRaptors: Visit Brooklyn on Wednesday.\nCavaliers: Visit Washington on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994741.042763
}