{
  "game_id": "0022300618",
  "espn_id": "401585246",
  "date": "Jan 23, 2024",
  "matchup": "LAL @ LAC",
  "headline": "Leonard's 2nd career triple-double leads Clippers over LeBron-less Lakers 127-116",
  "body": "LOS ANGELES -- — Facing a seven-game road trip, the Los Angeles Clippers added to their momentum of late by beating the Lakers for the first time in three meetings this season.\n\n\r\n              Kawhi Leonard had his second career triple-double, James Harden had 23 points and 10 assists and the Clippers won 127-116 on Tuesday night. They've won three in a row and 11 of 13.\n\n\r\n              “Everybody contributed to the win,” Leonard said. “That’s what we got to do, knock down shots when they’re open and tonight we did.”\n\n\r\n              Leonard had 25 points, 11 rebounds and 10 assists, including three key ones in the fourth when the Clippers were clinging to a narrow lead. The team had 33 assists.\n\n\r\n              “They were coming with fire trying to get it out of his hands all night,” Clippers coach Tyronn Lue said of Leonard. \n\n\r\n              D’Angelo Russell led the Lakers with 27 points and 10 assists and Anthony Davis had 26 points and 12 rebounds with LeBron James watching from the bench.\n\n\r\n              “It's a different dynamic with him not being out there,” Leonard said of James. “You saw guys came in and stepped up and made big shots for him.”\n\n\r\n              James is day-to-day with left ankle pain. The Clippers didn't have big man Ivica Zubac, who is out for at least a month with a right calf strain.\n\n\r\n              The fourth straight road loss dropped the Lakers under .500 at 22-23. They led just once, by one point early in the game.\n\n\r\n              “Like I told them just now, a lot of good things we did during this game,” Lakers coach Darvin Ham said.\n\n\r\n              The Lakers twice closed within two points early in the fourth. Leonard found Norman Powell for a corner 3-pointer and Leonard hit Paul George with a pass for a layup. Powell scored again and Leonard made two free throws to cap a 9-0 spurt that extended the Clippers' lead to 119-108. Powell finished with 17 points.\n\n\r\n              George was bothered by a left groin issue late in the game. He had 17 points and four of the Clippers' 14 turnovers. \n\n\r\n              Lakers forward Cam Reddish limped off the floor barely able to put weight on his right leg after going down at mid-court in the fourth.\n\n\r\n              The Lakers alternately attacked the basket or hit 3s in the third. Russell scored their first seven points. He and Austin Reaves made back-to-back 3s that cut the Lakers' deficit to 92-88.\n\n\r\n              “They're a good transition team and we allowed them to play to their strengths,” Leonard said. “We just got to be better at that.”\n\n\r\n              Russell Westbrook sandwiched 3-pointers around a goaltending call on Rui Hachimura before Amir Coffey's 3 sent the Clippers into the fourth leading 106-97. Westbrook finished with 16 points.\n\n\r\n              The Clippers shot 66% from the floor in the first half and pulled away with a 15-9 run to go into halftime leading 77-64. Leonard made all seven of his field goals in the half when both teams scored nearly every trip down the floor.\n\n\r\n              Westbrook was missing his right shoe as he hit a 3-pointer in the first quarter. \n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host the Chicago Bulls on Thursday.\n\n\r\n              Clippers: Visit the Toronto Raptors on Friday to open a seven-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995513.860903
}