{
  "game_id": "0022300513",
  "espn_id": "401585141",
  "date": "Jan 09, 2024",
  "matchup": "ORL vs. MIN",
  "headline": "Towns, Timberwolves roll to 113-92 win over Magic",
  "body": "ORLANDO, Fla. -- — Karl-Anthony Towns scored 23 of his 28 points in the first half and the Minnesota Timberwolves led from start to finish Tuesday night in a 113-92 win over the Orlando Magic.\n\n\r\n              Rudy Gobert had 21 points and 12 rebounds and the Western Conference-leading Timberwolves (26-10) won easily despite getting only six points and three assists from leading scorer Anthony Edwards.\n\n\r\n              Edwards set up Towns for a 3-pointer on Minnesota's first shot. He made it, and the Timberwolves ran off to an 11-0 lead and never let it go.\n\n\r\n              “Tonight I just took what the defense gave me, taking the three when it was open and just shooting it,” said Towns, who made all five of his 3-points shots. “The first shot of the game was me in the corner and (the defense) didn’t decide to come. (Edwards) made a great pass in the corner.”\n\n\r\n              The Timberwolves led 33-16 after a first quarter in which Gobert scored 11 points and the Magic shot 6 for 27 (22% ).\n\n\r\n              “I thought it was our best start of the season,\" Gobert said. “The ball pressure, the focus, the energy, the urgency from the first play of the game was at a high level.”\n\n\r\n              Towns agreed.\n\n\r\n              “Everyone did a great job of building the lead, sustaining the lead and just continuing to find a way to attack,” said Towns, who had six rebounds, five assists and three steals.\n\n\r\n              Moritz Wagner led the Magic (21-16) with 21 points and seven rebounds. Jalen Suggs had 20 points and five rebounds and Paolo Banchero had 18 points on 8 for 22 shooting.\n\n\r\n              The Magic shot only 35% for the game and 28% in the first half.\n\n\r\n              “We kind of lacked energy,” said Wagner. “That's what we do, you know. We're probably not the best shooting team in the league so we've got to create havoc. We've got to be the ones to bring the energy, the juice, and we didn't really do that.”\n\n\r\n              Edwards, who came in averaging 26.8 points per game, was called for his third foul early in the second quarter and played only eight minutes in the first half. He took only seven shots and did not score in double figures for the first time this season.\n\n\r\n              Jaden McDaniels had 15 points and nine rebounds for the Timberwolves, and “did a really, really good job on Banchero,” according to coach Chris Finch.\n\n\r\n              Playing without Franz Wagner and Joe Ingles (sprained ankles), Wendell Carter Jr. (knee) and Gary Harris (calf strain), the Magic had only 10 available players including Markelle Fultz, who played 13 minutes in his second game back from a long absence due to a knee injury.\n\n\r\n              Towns took over the scoring load midway through in the second quarter and helped Minnesota push its lead to 34 points early in the second half.\n\n\r\n              Orlando never got the margin under 17 in the second half.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Visit Boston on Wednesday night.\n\n\r\n              Magic: Visit Miami on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995711.9991791
}