{
  "game_id": "0022300516",
  "espn_id": "401585144",
  "date": "Jan 09, 2024",
  "matchup": "TOR @ LAL",
  "headline": "Toronto coach pounds table, rips officials after Lakers hold off Raptors 132-131 behind Davis' 41",
  "body": "LOS ANGELES -- — Toronto coach Darko Rajakovic went on a furious, table-pounding tirade against the officiating after the Los Angeles Lakers shot 23 free throws in the fourth quarter of a 132-131 win over the Raptors on Tuesday night.\n\n\r\n              Rajakovic, Toronto's first-year Serbian head coach, ripped the game's free throw disparity after Anthony Davis scored 20 of his 41 points in the fourth quarter while going 11 for 11 at the line in the final period. Davis shot 14 of the Lakers' 36 free throws in the game, while the entire Toronto roster shot only 13.\n\n\r\n              “It's outrageous. What happened tonight, this is completely B.S.,\" Rajakovic said. \"This is shame. Shame for the referees. Shame for the league to allow this. Twenty-three free throws for them, and we get two free throws in the fourth quarter? Like, how to play the game? I understand respect for All-Stars and all that, but we have star players on our team as well.\n\n\r\n              “How (is it) possible that Scottie Barnes, who is All-Star-caliber player in this league, he goes every single time to the rim with force and trying to get to the rim without flopping and not trying to get foul calls, he gets two free throws for a whole game?” Rajakovic added, slapping the table repeatedly for emphasis. \"How is that possible? How are you going to explain that to me?”\n\n\r\n              Davis grabbed 11 rebounds and went 13 for 17 while carrying the Lakers down the stretch against the Raptors, who were missing injured starting center Jakob Poeltl. Davis completed his masterful performance by scoring 10 points in the final 1:01, including eight free throws without a miss, and making a key block on Barnes.\n\n\r\n              Rajakovic apparently felt the officials never gave his team a chance.\n\n\r\n              “They had to win tonight? If that’s the case, just let us know, so we don’t show up for the game,” Rajakovic said. “Just give them a win. But that was not fair tonight. And this is not happening first time for us. Scottie Barnes is gonna be (an) All-Star. He’s gonna be the face of this league, and what’s happening over here during whole season … it’s complete crap.”\n\n\r\n              Barnes scored 26 points and Pascal Siakam had 25 for the Raptors, who lost for only the second time in five games since acquiring RJ Barrett and Immanuel Quickley from New York for OG Anunoby. Barrett scored 23 points, and Quickley had 21 with four 3-pointers for the Raptors, who lost to the Lakers on the road for just the second time in their last nine trips.\n\n\r\n              Rajakovic's rant likely will earn him a significant fine from the NBA, but his players appeared to appreciate his verbal combativeness.\n\n\r\n              “It just says that he’s all for us as a family, as a team,” said Thaddeus Young, who scored 10 points as Toronto’s starting center. “We’re always going to stick together. We’re always going to be behind one another as a family, as a team. We're always going to stick together, and he's always been behind us since Day One coming in here. We love Darko to death. We think the world of Coach, and we definitely appreciate him going to bat for us.\"\n\n\r\n              LeBron James had 22 points and 12 assists for the Lakers, who won back-to-back games for the first time in a month. They went 3-10 immediately after winning the inaugural NBA In-Season Tournament in December, but they held off the Clippers on Sunday before outlasting the Raptors to get back to .500 (19-19).\n\n\r\n              “It was all of us,” said Davis, who had none of his frequent late-game struggles to hit key free throws. \"It wasn't just me. Big-time stops. We got rebounds, and they wanted me to get the ball as far as free throws, but the team was just making the right reads and trying to finish.\n\n\r\n              Quickley fouled out when he elbowed Cam Reddish in the face for a flagrant foul with 3:52 to play. Gary Trent Jr. put the Raptors ahead 121-120 on a 3-pointer with 1:08 left, but Davis replied with a quick layup before blocking Barnes’ shot on the other end and adding two free throws moments later.\n\n\r\n              Barrett was called for an offensive foul that wiped out a tying 3-pointer by Barnes with 24.8 seconds to play. Davis and Austin Reaves eventually combined to hit 10 straight free throws in the final 34 seconds as Los Angeles held on despite 3-pointers by Toronto's Dennis Schröder and Siakam in the final four seconds.\n\n\r\n              Toronto played without Poeltl, sidelined indefinitely after spraining his left ankle in a win at Golden State last Sunday. The University of Utah product is averaging 10.6 points and 8.3 rebounds per game while leading the NBA in shooting percentage (68.5).\n\n\r\n              “We knew we had an advantage on the interior tonight, and we just tried to get it to (Davis) early and often and late,” James said.\n\n\r\n              Schröder had 10 points and six assists against the team with which he spent two of the previous three seasons. Schröder accidentally banked in a 3-pointer with four seconds to play, but Davis hit two more free throws before Trent's 3 at the buzzer.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Clippers on Wednesday.\n\n\r\n              Lakers: Host Phoenix on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995424.779899
}