{
  "game_id": "0022000002",
  "espn_id": "401266806",
  "date": "Dec 22, 2020",
  "matchup": "LAL vs. LAC",
  "headline": "George's 33 sends Clippers past Lakers 116-109 on ring night",
  "body": "LOS ANGELES -- - After the Los Angeles Lakers got their championship rings, the Los Angeles Clippers gave a performance that showed this retooled team is determined to contend for its own jewelry several months from now.\nPaul George scored 26 of his 33 points in the second half, Kawhi Leonard added 26 points and the Los Angeles Clippers rallied past the Los Angeles Lakers on the NBA champions' ring ceremony night for a 116-109 victory Tuesday.\nGeorge went 13 of 18 with five 3-pointers in an outstanding first game since agreeing to add four years and $190 million to his contract with the Clippers, who never trailed in the latest meeting of Southern California's two NBA powerhouses. The Clippers beat the Lakers in the season opener for the second straight year while winning coach Tyronn Lue's debut.\nThe Clippers stayed in their locker room while the Lakers received their rings, but they emerged with purpose and determined play - from their two superstars in particular.\n\"Our focus was on us,\" Lue said. \"The Lakers, they deserved that ring. They had a great year, and you can't take nothing away from them. Our focus wasn't really on the Lakers. They were the best team last year, so congratulations to them again, but now we're moving on.\"\nLeBron James scored 22 points and Anthony Davis had 18 for the Lakers just 72 days after they finished off the Miami Heat in the NBA bubble. James said he turned his ankle \"pretty good\" in the second half, leading him to play just 28 minutes.\n\"I'm happy today is over with and we can focus on the season, but it's just a lot to process,\" James said. \"It felt weird having a basketball game today.\"\nThe Lakers returned from the shortest offseason in league history and celebrated  the franchise's 17th title, but they couldn't keep up with George and Leonard down the stretch. Lakers coach Frank Vogel also limited James' playing time and kept Davis to 31 minutes, anticipating the long grind ahead on his veterans after a 10-week offseason.\n\"It's not ideal, but I do feel it's necessary to manage those guys' minutes the right way,\" Vogel said. \"Getting through this stretch healthy is a priority, and evaluating how our new guys fit is a priority when we haven't had a normal amount of time to do that. The five guys on the floor have got to be better than they were tonight.\"\nSerge Ibaka scored 15 points in his debut for the Clippers, who hadn't played since blowing a 3-1 playoff series lead to Denver and ruining a much-anticipated conference final showdown with the waiting Lakers in the bubble. The collapse led to coach Doc Rivers' departure, and Lue moved down the bench to take over a star-studded team with several new additions.\nThe Lakers fell behind by 22 points under the ring hangover in the first quarter, but they erased all but two points of the deficit in the second. The Clippers pulled away late in the third with George scorching a series of one-on-one defenders. He scored 11 more points in the fourth to seal it.\n\"We're not thinking about last year,\" Leonard said. \"It's a different team. I'm just happy that we kept playing basketball the right way. Even if we lost the lead, we turned around and kept playing our basketball. We ran our offense, and that's what we take pride in tonight. Everybody had each other's back and was staying positive.\"\nTIP-INS\nClippers: Nicolas Batum and Ibaka started for their new club. ... Former Lakers Lou Williams and Ivica Zubac scored 11 points apiece.\nLakers: James believes he will be fine to play on Christmas, saying he'll get extensive treatment. He also joked about another solution: \"I'll drink some wine that will flow right to the ankle.\" ... Dennis Schröder and fellow newcomer Marc Gasol were in Vogel's starting lineup. Gasol had no points and five fouls in 12 minutes. ... Wesley Matthews also went scoreless in his Lakers debut.\nDEBUTS\nBatum had three points and six assists in 28 minutes in his Clippers debut, while new $64 million swingman Luke Kennard had four points in 21 minutes off the bench.\nMontrezl Harrell had 17 points and 10 rebounds in a strong debut after moving down the hallway from the Clippers to the Lakers last month. Schröder also was impressive in his Lakers debut, with 14 points, 12 rebounds and eight assists.\n\"Those guys are going to be big-time players for us,\" Vogel said.\nUP NEXT\nClippers: Visit Denver on Friday.\nLakers: Host Dallas on Friday.\n------",
  "source": "espn_api",
  "crawled_at": 1764997340.283839
}