{
  "game_id": "0022400395",
  "espn_id": "401704961",
  "date": "Dec 23, 2024",
  "matchup": "MIN @ ATL",
  "headline": "Mathews and Young lead the Hawks past the Timberwolves 117-104",
  "body": "ATLANTA -- — Garrison Mathews made a career-best seven 3-pointers and scored a season-high 25 points off the bench as the Atlanta Hawks knocked off the Minnesota Timberwolves 117-104 on Monday night.\n\n\r\n              Trae Young had 29 points and seven assists and De'Andre Hunter added 19 points to help the Hawks halt a three-game losing streak. Young was listed as questionable with a bruised heel but showed no ill effects.\n\n\r\n              Naz Reid scored 23 off the bench for the Timberwolves, who have lost three straight. Anthony Edwards had 16 points and six rebounds in his only regular-season appearance in his hometown. He shot 7 for 20 from the floor and committed five turnovers while being guarded by NBA defensive player of the month Dyson Daniels most of the night.\n\n\r\n              Daniels finished with eight steals.\n\n\r\n              Mathews was 5 for 5 from 3-point range with 15 points in the first half and 7 for 8 for the game.\n\n\r\n              The Hawks sprinted out to a 30-11 lead as the Timberwolves shot 4 for 20 with five turnovers, but Minnesota rallied quickly and took a 55-52 halftime lead thanks in part to 11 points off the bench from both Reid and Nickeil Alexander-Walker.\n\n\r\n              Takeaways\r\n              Timberwolves: On a day when Edwards was fined $75,000 for criticizing officials, the Timberwolves came out flat. They rebounded in the first half but faded in the fourth quarter, adding to a frustrating season. Minnesota (14-14) was 22-6 on Christmas Day last season. \n\n\r\n              Hawks: After a blowout loss to the Grizzlies with Young sidelined, the Hawks bounced back and reached .500 on the season heading into Christmas with a strong performance.\n\n\r\n              Key moment\r\n              The Hawks went on an 8-0 run early in the third quarter that turned an 89-87 deficit into a 95-89 lead. Mathews had seven points during the spurt. Atlanta pulled away from there.\n\n\r\n              Key stat\r\n              The Hawks were 18 for 36 from 3-point range.\n\n\r\n              Up next\r\n              The Timberwolves will play on Christmas for the third time in franchise history when they visit the Dallas Mavericks on Wednesday. The Hawks host the Chicago Bulls on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998099.2821188
}