{
  "game_id": "401809797",
  "espn_id": "401809797",
  "date": "Nov 21, 2025",
  "matchup": "UTAH vs OKC",
  "headline": "Gilgeous-Alexander scores 31 points, Thunder use big 3rd quarter to race past Jazz 144-112",
  "body": "SALT LAKE CITY -- — Shai Gilgeous-Alexander scored 31 points, Oklahoma City had a 33-4 run and the defending champion Thunder routed the Utah Jazz 144-112 on Friday night in NBA Cup play to improve to 16-1 and push their winning streak to eight.\n\n\r\n              Gilgeous-Alexander was shooting less than 27% on 3-pointers after seven games but has made half his long-range shots since then and all three attempts from beyond the arc against Utah to go along with 9-of-13 shooting from the field and 10 of 12 from the line.\n\n\r\n              Isaiah Joe scored 16 points and Jaylin Williams made five 3s for a season-high 15 points for Oklahoma City. The Thunder — 2-0 in the NBA Cup — shot 61.4% from the field and a season-best 62.2% on 3s, making 23 of 37.\n\n\r\n              Keyonte George scored 20 points and Lauri Markkanen added 19 for Utah. The Jazz are 5-10 overall and 0-3 in tournament play.\n\n\r\n              The Thunder forced 28 turnovers and turned them into 44 points, disrupting the Jazz sets and visibly frustrating Utah's players.\n\n\r\n              Utah led 84-77 before the Thunder finished the third quarter on the 33-4 run, including 22 points in a row. Oklahoma City is the league’s best third-quarter team and showed it by forcing nine turnovers with suffocating pressure defense while shooting 9 for 13 from 3-point range.\n\n\r\n              Gilgeous-Alexander scored 12 as OKC outscored Utah 43-20 in the period. Incredibly, Utah led by 18 points (39-21) before OKC led by 36 late in the game.\n\n\r\n              The Jazz scored 44 points in the first quarter, more than any team has tallied in any quarter against the Thunder this season, to lead 44-30.\n\n\r\n              The Jazz led the entire first half but the Thunder closed to 68-67 and Coach Mark Daigneault was assessed a technical foul arguing a non-call at the halftime buzzer. \n\n\r\n              Up next\r\n              Thunder: Host Portland on Sunday night.\n\n\r\n              Jazz: Host the Los Angeles Lakers on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042672.165789
}