{
  "game_id": "0021600761",
  "espn_id": "400900166",
  "date": "Feb 04, 2017",
  "matchup": "MIL @ PHX",
  "headline": "Bucks rout Suns to snap 5-game losing streak",
  "body": "PHOENIX -- Milwaukee couldn't stop Devin Booker for seven spectacular minutes. The Phoenix Suns couldn't stop the Bucks all night.\nGiannis Antetokounmpo scored 30 points to lead six Milwaukee players in double figures and the Bucks snapped a five-game losing streak with a 137-112 victory over the Suns on Saturday, their highest-scoring game of the season.\n\"I thought Giannis set the tone for us,\" Milwaukee coach Jason Kidd said. \"That's why he's an All-Star. He understands the moment. He set the tone early and everybody has to follow.\"\nBooker, whose 20-foot bank shot at the buzzer beat the Kings in Sacramento on Friday night, scored 31 points for the Suns, 27 during a blistering final 7:13 of the first half.\nThe Bucks, coming off a Friday night loss at Denver, shredded the Suns' defense, shooting 63 percent while setting season highs for most points in a quarter, half and game. Milwaukee scored 74 points in the paint to the Suns' 42.\n\"This is what we do. We score in the paint,\" Antetokounmpo said. \"We try to go to our strength as much as possible. It feels good going to your strength.\"\nEx-Sun Mirza Teletovic added 19 points and Jabari Parker had 18 for the Bucks in just their second win in the last 12 games. The victory came in the final stop on a five-game road trip.\n\"We were just hungry to get a win,\" Antetokounmpo said. \"We were struggling.\"\nRookie Marquese Chriss scored a career-high 27 points for Phoenix.\nBooker scored 27 of the Suns' final 33 points in the first half, including his team's last 17 to cut what had been a 25-point Milwaukee lead to 74-66 at the break.\nBut the heroics ended there. Booker didn't make another field goal, going 0 for 6 in the second half.\nThe Bucks methodically padded their lead in the third quarter, going up 92-76 on Parker's breakaway dunk with 4:35 left.\nChriss' three-point play sliced the lead to 104-92 with 10:59 to play, but Milwaukee ran off the next eight points to blow open a 112-92 advantage.\nBooker, a 20-year-old second-year guard, was 9-of-11 shooting in the second quarter, including 5 of 5 on 3s.\n\"It's just that zone,\" Booker said. \"If you play basketball long enough, a lot of people get in that zone. It would have been better if it had lasted longer, the whole game, we could have come out with a win, but we didn't.\"\nSuns coach Earl Watson called Booker \"a player who, during that stretch, reminded me of Kobe.\"\nOther than that second-quarter outburst, though, Booker was 0-for-8 shooting.\nBOOK `EM\nBooker's barrage was one point shy of the franchise-record 28 he scored in the fourth quarter of a loss to Dallas in Mexico City.\nAlong the way, he became the youngest player to score at least 20 points in 16 consecutive games. Booker did it at 20 years, 97 days. His 16-game streak is the second-longest by any first- or second-year player in the last 20 seasons. Vince Carter had a 23-game run in 1999-2000.\nTIP INS\nBucks: Milwaukee snapped a seven-game road losing streak. ... The Bucks shot 77 percent (17 for 22) in the first quarter. ... Milwaukee has won four of its last five in Phoenix and three straight overall against the Suns.\nSuns: The 137 points were one shy of the most allowed in a game by Phoenix this season. ... Before Booker's 28- and 27-point quarters this season, the Phoenix franchise record for points in a quarter was 26 by Stephon Marbury. ... The Suns' franchise record for consecutive 20-point games is 21 by Tom Chambers.\nUP NEXT\nBucks: Milwaukee returns home to face Miami on Wednesday night.\nSuns: Phoenix is at New Orleans on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764995171.1286132
}