{
  "game_id": "0022300423",
  "espn_id": "401585051",
  "date": "Dec 28, 2023",
  "matchup": "MIN vs. DAL",
  "headline": "Anthony Edwards scores season-high 44, leads Timberwolves past Doncic-less Mavericks 118-110",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored a season-high 44 points and Rudy Gobert had 20 points and 11 rebounds as the Minnesota Timberwolves held on for a 118-110 win over the Dallas Mavericks on Thursday night.\n\n\r\n              The Mavericks were without Luka Doncic on the second night of back-to-back games. Dallas fell at Cleveland 113-110 on Wednesday.\n\n\r\n              Karl-Anthony Towns added 10 points for Minnesota, which improved to 13-1 at home this season and has not lost back-to-back games all season.\n\n\r\n              The Timberwolves trailed by one point midway through the third period before going on a 15-3 run to gain control and lead the rest of the way.\n\n\r\n              \"We’ve got so many weapons, so many guys that draw a lot of attention,” Gobert said. “If we just execute and make the game easy, we’re hard to guard. When the ball gets a little stagnant, we make it harder on ourselves. Tonight we saw both faces.”\n\n\r\n              Doncic missed his third game of the season with left quadriceps soreness, while Kyrie Irving missed his 11th straight with a right heel contusion. Dallas coach Jason Kidd said Doncic aggravated a quadriceps injury during the Christmas Day win against Phoenix.\n\n\r\n              Without its two leading scorers, Tim Hardaway Jr. scored 32 off the bench and Jaden Hardy added 17 for Dallas. The Mavericks have lost five of seven.\n\n\r\n              “We’re never satisfied with losing, but there are a lot of good things that we can take from this,\" Kidd said. \"I thought the energy and effort, guys competed. The bench was really good tonight.”\n\n\r\n              Minnesota seemed ready to cruise past the short-handed Mavericks, racing to an 18-point advantage in the first quarter, with Edwards scoring 14 of his points and aggressively going at Dallas’ defense.\n\n\r\n              “I put it in my mind before the game, like, I’m probably going to shoot it every time I touch it,\" Edwards said. \"I feel like last game I left bullets in the chamber. So, I ain’t want to do that this game.”\n\n\r\n              Turnovers by the Wolves kept Dallas in contention and Hardaway’s shooting provided a much-needed spark.\n\n\r\n              Minnesota had 22 turnovers, leading to 29 points for the Mavericks.\n\n\r\n              “I thought at the end of the second quarter, in particular, we all were having a pity party for ourselves offensively,\" Timberwolves coach Chris Finch said. \"There’s a lot of ways to be immature. And generally, this team has been very mature. But we gotta grow up offensively. It’s time.”\n\n\r\n              Hardaway finished with 18 of his points in the second half and shot 11 of 19 from the field and 5 of 11 from 3-point range, knocking down several shots with a hand in his face.\n\n\r\n              “Coming off the bench, he’s back into his role,\" Kidd said. \"I thought the group did a really great job of setting screens for him, and I thought he did a really good job of reading the defense, being able to pull up or race the big for a layup.”\n\n\r\n              But Edwards sparked the third-quarter rally with seven of the 15 points during the run. Dallas closed within four points in the fourth quarter, but consecutive 3-pointers by Kyle Anderson helped Minnesota stay in front.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: At Golden State Warriors on Saturday.\n\n\r\n              Timberwolves: Host the Los Angeles Lakers on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764996481.536701
}