{
  "game_id": "0021601052",
  "espn_id": "400900447",
  "date": "Mar 21, 2017",
  "matchup": "DET @ BKN",
  "headline": "Lopez's jumper at buzzer gives Nets 98-96 win over Pistons",
  "body": "NEW YORK --  While his twin brother was throwing punches, Brook Lopez landed a blow that really hurt.\n\nLopez made a jumper as time expired to give the Brooklyn Nets a 98-96 victory over the Detroit Pistons on Tuesday night.\n\nHe had heard even before he ended the game about what happened in Toronto, where Robin Lopez was ejected along with the Raptors' Serge Ibaka for fighting.\n\n\"Well, the Lopez twins were just both doing what we do tonight,\" Lopez said. \"He was doing his dirty job ... and I was playing real basketball.\"\n\nThe Pistons, fighting for a playoff spot, wiped out a double-digit deficit in the fourth quarter to tie it at 96 on Tobias Harris' follow shot with 2.4 seconds left.\n\nLopez then took the inbounds pass moving left, dribbled toward the baseline and made the shot to cap a 29-point night.\n\nHarris had 24 points for the Pistons, who dropped a game back of Miami for the eighth and final playoff spot in the Eastern Conference. Kentavious Caldwell-Pope finished with 19. Andre Drummond had 13 points and 17 rebounds, but he left midway through the fourth quarter after appearing to injure his knee.\n\n\"It's frustrating,\" Harris said. \"We came here and expected to win. We needed this win, and they played like they needed it more than us.\"\n\nAfter allowing 31 points in the first quarter, the Nets limited the Pistons to 34 over the next two, opening a 74-65 lead. Brooklyn got the first basket of the fourth to take its first double-digit lead and led by eight with 4 1/2 minutes remaining before Detroit tied it with a 13-5 spurt.\n\nIsh Smith was the catalyst, scoring 12 of his 16 points in the fourth quarter as struggling starter Reggie Jackson watched from the bench. But the Pistons couldn't complete the comeback and lost for the fourth time in five games.\n\n\"In the locker room, the guys had some stuff to say themselves,\" coach Stan Van Gundy said. \"Somebody said I hope this is a wake-up call and I almost started laughing. I mean we're 71 games in. A wake-up call? Come on, we've been doing this all year.\"\n\nThe Nets, playing without starting point guard Jeremy Lin because of a sprained right ankle, snapped a two-game losing streak.\n\nTIP-INS\n\nPistons: Detroit opened a four-game road trip. ... Jackson finished with seven points on 3-for-9 shooting and two assists.\n\nNets: Spencer Dinwiddie started for Lin and finished with 10 points and eight assists. The Nets improved to 2-16 with him in the starting lineup. ... The Nets improved to 5-7 in March, their best month of the season. Brooklyn (14-56) was 4-9 in November.\n\nSTAN ON SCHEDULING\n\nVan Gundy understands why coaches rest healthy players, though he doesn't believe in it and said he doesn't know whether 82 games is too many.\n\n\"It is a little bit amazing to me that we tout all the time how much better job we do taking care of our players. So years ago it was commercial travel, get up at 4:30 in the morning, get to the airport, play a couple of back-to-back-to-backs during the year. There were no nutrition experts, there were no sleep experts and those guys played 82 games, 40-plus minutes a night every single night,\" he said.\n\n\"Now we have all of these things, so we take care of people better and yet they can do less. So I don't know. I mean we supposedly condition people better, they take better care of their bodies, we make their travel easier, but they can't do as much. I don't know, to me something's missing, but that's just me. I'm probably not smart enough to figure out why that is.\"\n\nHE'S NO. 2\n\nDespite being in trade rumors seemingly every year, Lopez has now played 551 games with the Nets, moving ahead of Mike Gminski into second place on the franchise list. He trails only Buck Williams, as he also does on the Nets' career points list.\n\nUP NEXT\n\nPistons: Visit Chicago on Wednesday, looking to even the all-time series at 127-all.\n\nNets: Host Phoenix on Thursday. The Nets have won the last three meetings.",
  "source": "espn_api",
  "crawled_at": 1764996027.083082
}