{
  "game_id": "0021900703",
  "espn_id": "401161345",
  "date": "Jan 28, 2020",
  "matchup": "TOR vs. ATL",
  "headline": "Lowry leads Raptors past Hawks for eighth straight win",
  "body": "TORONTO --  Kyle Lowry locked up another spot in Raptors franchise history and got a hearty congratulations from the high-flying star who was once the face of basketball in Toronto.\n\nLowry had 12 points and 11 assists while becoming Toronto's career assist leader and the Raptors beat the Atlanta Hawks 130-114 Tuesday night for their season-best eighth straight win.\n\nSerge Ibaka had 24 points and 10 rebounds, Pascal Siakam added 24 points and Fred VanVleet had 19 as the Raptors won their 10th in a row over Atlanta. Toronto never trailed and led by as many as 28, maintaining a double-digit edge throughout the second half.\n\nWith his ninth assist, a long outlet pass to Terence Davis in the fourth, Lowry moved past Jose Calderon (3,770) on Toronto’s career list.\n\nLowry said it was special to reach the milestone with former Raptors star Vince Carter in attendance as a member of the Hawks.\n\n“It was awesome to be able to get it here tonight, in front of the home crowd, in front of Vince,” Lowry sad. “He didn’t start the organization but he kind of put it on the map and continued to make this thing grow. He’s always been a big supporter of mine and the Raptors.”\n\nLowry and Carter, who are friends and golf buddies, embraced near half court after the record was announced late in the game.\n\n“Hes very crafty, he’s very smart,” Carter said of Lowry. “His basketball IQ is up there with some of the best in my opinion.”\n\nCalderon tweeted a congratulatory video to Lowry, who finished with eight rebounds and narrowly missed his second triple-double of the season.\n\n“If somebody had to do it, I’m really happy that it’s you,” Calderon told Lowry. “Enjoy this moment and many more.”\n\nLowry is already Toronto’s franchise leader in 3-point field goals and steals.\n\nJohn Collins had 28 points and 12 rebounds, and Trae Young had 18 points and 13 assists for the Hawks.\n\nCam Reddish also scored 18 points, De’Andre Hunter had 15 and Carter added 10 as Atlanta lost for the fourth time in six games.\n\n“We could have made this game a little bit different with the defensive intensity,” Hawks coach Lloyd Pierce said. “We lacked that, really, because the shots weren’t falling and we let that affect us.”\n\nRaptors center Marc Gasol scored 10 points but was unable to return after leaving early in the third because of a sore left hamstring. Gasol missed 12 games because of a strained left hamstring between Dec. 18 and Jan. 12.\n\nToronto also lost forward OG Anunoby to a sore left shoulder late in the game. Coach Nick Nurse had no update on either of his injured starters following the game.\n\nTIP-INS\n\nHawks: F Bruno Fernando (left calf) was inactive, C Alex Len sat for the second straight game because of a right hip flexor strain, and G DeAndre' Bembry missed his fourth straight game, the past three of which have been because of inflammation in his right hand. ... Toronto honored Carter with a video tribute between the first and second quarters. ... Young shot 1 for 7 from 3-point range.\n\nRaptors: Toronto didn’t turn the ball over in the second and had just two turnovers in the first half. ... F Rondae Hollis-Jefferson (sprained right ankle) was inactive. Hollis-Jefferson left Sunday’s win at San Antonio in the second quarter and did not return. ... F Patrick McCaw (broken nose) missed his third straight game. ... The Raptors outscored the Hawks 61-26 in bench points.\n\nLOST LEGEND\n\nPlaying at home for the first time since Kobe Bryant's death Sunday, the Raptors honored the late star with a pregame video tribute. Fans rose for an impromptu standing ovation and yelled ‘Kobe, Kobe!’ following the video before the scoreboard counted down 24 seconds of silence.\n\n81\n\nWhen the Hawks reached 81 points late in the third, the digits were displayed in purple on the scoreboard in tribute to Bryant, who scored a career-high 81 against Toronto on Jan. 22, 2006.\n\nThe plan was to highlight the numbers 8, 24 and 81, but neither team hit on any of them until the Hawks got to 81 on Young’s layup.\n\nMOVING ON UP\n\nCarter played his 1,522nd game, tying Dirk Nowitzki for third on the NBA’s all-time list. Only Robert Parish (1,611) and Kareem Abdul-Jabbar (1,560) have played in more.\n\nHAPPY NEW YEAR\n\nToronto is 10-3 in January with two games remaining this month, at Cleveland and at Detroit.\n\nUP NEXT\n\nHawks: Host Philadelphia on Thursday night.\n\nRaptors: Visit Cleveland on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995607.0476239
}