{
  "game_id": "401810070",
  "espn_id": "401810070",
  "date": "Nov 12, 2025",
  "matchup": "NY vs ORL",
  "headline": "Magic snap Knicks' five-game win streak, hand them their first home loss with a 124-107 victory",
  "body": "NEW YORK -- — Franz Wagner had 28 points and nine rebounds, Desmond Bane added 22 points and eight assists, and the Orlando Magic handed the New York Knicks their first home loss of the season with a 124-107 victory Wednesday night.\n\n\r\n              Anthony Black scored 17 points on 7-for-11 shooting for the Magic, who won for the fifth time in their past seven games. They overcame the loss of leading scorer Paolo Banchero, who strained his left groin on his 23rd birthday and missed the second half. \n\n\r\n              Jalen Brunson scored 31 points but turned his right ankle on a drive to the basket with under two minutes remaining. Coach Mike Brown had no further update after the game. \n\n\r\n              Karl-Anthony Towns had 15 points and 12 rebounds for his NBA-leading 10th double-double for the Knicks, who were 7-0 at Madison Square Garden and had won five straight overall.\n\n\r\n              The Knicks averaged 130.2 points over their five-game winning streak. But they scored just 42 first-half points, shooting 35% from the field and making just 1 of 10 3-pointers in the second quarter.\n\n\r\n              Orlando (6-6) entered play ranked 14th in the NBA in defense yet resembled the team that finished in the top five in points allowed each of the past two seasons. The Magic held New York, which ranked sixth in the NBA in scoring with 121.8 points per game, to just 30.6% from 3-point range.\n\n\r\n              The Knicks trailed by 21 in the third quarter before cutting the Magic lead to 100-91 on Brunson’s jumper with 6:04 left. But keyed by Jalen Suggs’ crowd-silencing 3-pointer on its subsequent possession, Orlando responded with a 10-4 spurt and didn’t look back.\n\n\r\n              Brunson scored 16 in the first half, but the rest of the Knicks combined for just 26 points. Led by Wagner, who had 17 points in the first half, the Magic outscored the Knicks 32-19 in the second quarter and led by 20 at halftime.\n\n\r\n              Up next\r\n              Magic: Host Brooklyn on Friday\n\n\r\n              Knicks: Host Miami on Friday\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042609.498871
}