{
  "game_id": "0022400124",
  "espn_id": "401704690",
  "date": "Oct 30, 2024",
  "matchup": "MEM vs. BKN",
  "headline": "Dennis Schroder scores 33 points, the Nets beat the turnover-prone Grizzlies 119-106",
  "body": "MEMPHIS, Tenn. -- — Dennis Schroder had 33 points and eight assists, Cam Thomas added 19 points and the Brooklyn Nets beat the Memphis Grizzlies 119-106 on Wednesday night.\n\n\r\n              Ziaire Williams, who started his NBA career with Memphis before an offseason trade, had 17 points.\n\n\r\n              Jaren Jackson Jr. led Memphis with 30 points, connecting on 10 of 12 shots, including all three of his 3-pointers. Ja Morant had 14 points, 11 assists and eight rebounds, but was 5 of 16 from the field and made only one of his six shots from outside the arc.\n\n\r\n              Rookie Zach Edey and Brandon Clarke each finished with 13 points, Clarke making all five of his shots. The Grizzlies had 22 turnovers.\n\n\r\n              Takeaways\r\n              Nets: Schroder made a huge difference, scoring at key moments when Memphis was poised to make a run.\n\n\r\n              Grizzlies: Memphis had a bad time with tunrovers throughout the game, something that has plagued the Grizzlies as they have tried to increase the pace this season.\n\n\r\n              Key moment\r\n              It didn't affect the outcome, but there was a strange play in the second quarter. Morant took off for a breakaway with about 11:40 left in the quarter. As the crowd rose to get the best look at the potential highlight, the high-flying guard went up for a reverse dunk. But the ball bounced off Morant's head and out of the basket as the rim recoiled.\n\n\r\n              Key stat\r\n              Both teams shot at least 50% through most of the game, and Memphis held a 58-46 advantage in points in the paint. But Brooklyn forced 22 turnovers leading to 31 points. Brooklyn forced 15 turnovers in the first half, the most forced by the Nets since 16 on March 31, 2022. \n\n\r\n              Up next\r\n              Brooklyn us at Chicago Bulls on Friday night. Memphis finishes a four-game homestand Thursday night against Milwaukee.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997763.183406
}