{
  "game_id": "0021600875",
  "espn_id": "400900281",
  "date": "Feb 26, 2017",
  "matchup": "MIL vs. PHX",
  "headline": "Antetokounmpo scores 28, Bucks beat Suns 100-96",
  "body": "MILWAUKEE --  The Milwaukee Bucks executed down the stretch and escaped with a victory.\n\nGiannis Antetokounmpo scored 28 points, Tony Snell made a clinching 3-pointer from the corner in the closing seconds and the Bucks held off the Phoenix Suns, 100-96 on Sunday.\n\nMichael Beasley added 17 points and Malcolm Brogdon had 15 as the Bucks swept the two-game season series with the Suns. Greg Monroe finished with 14 points and Snell had 13.\n\nClinging to a one-point lead, the Bucks came out of a timeout with Monroe inbounding the ball to Antetokounmpo. He dribbled the clock down before passing to Brogdon, who whipped the ball to Snell in the corner. Snell hit a 3 with a defender flying at him.\n\n\"It was a great read by Giannis to be patient and to understand what was about to take place,\" Bucks coach Jason Kidd said. \"He read the situation and there was a lot of trust. He made a pass to Malcolm, who could have shot it, but he made the extra pass and Tony ended up with the open shot.\"\n\nWith the Bucks leading by nine and 5:16 left to play, Kidd brought Antetokounmpo to the bench and put in Khris Middleton.\n\n\"With two minutes left, we forgot to get back on defense, and they took advantage of that,\" Kidd said. \"You have to give them credit. It is a good thing for us to learn the game wasn't over.\"\n\nAntetokounmpo came back in with 45.4 seconds remaining.\n\nThe Suns capitalized on Milwaukee's turnovers and missed shots and pulled to 97-96 on a dunk and two layups by Marquese Chriss, but he missed two free throws after being fouled by Snell.\n\nThe Bucks called time out and walked off to scattered boos but regrouped to pull out the victory.\n\n\"The last two minutes of the fourth quarter, we fought back to get into the game,\" Suns coach Earl Watson said. \"Once again, we were a couple of free throws from taking the lead with seconds left.\"\n\nThe Suns lost 128-121 in overtime to the Chicago Bulls on Friday. In that game, Devin Booker was fouled on a three-point play attempt with 1.5 seconds left and made the first two but missed the third to force overtime at 108-108.\n\nTJ Warren led the Suns with 23 points, Alan Williams scored a career-high 17 points and tied his career high with 15 rebounds, Booker added 15 points and Bledsoe had 11.\n\nTIP-INS\n\nSuns: The Suns are 11-9 against the Eastern Conference this season, including sweeps of Toronto and the New York Knicks. ... The Suns outscored the Bucks 48-44 in the paint. ... The Suns shot 54.1 percent from the floor in the first half.\n\nBucks: Milwaukee shot 51.3 percent from the floor. ... G Axel Toupane signed a 10-day contract with Milwaukee on Saturday. He did not dress for the game. He appeared in 28 games with Raptors 905 of the NBA D-League this season.\n\nMIDDLETON OUT AGAINST CLEVELAND\n\nMiddleton won't accompany the team for Monday night's game against Cleveland. He is not playing in back-to-backs. He missed the first 50 games after surgery to repair a ruptured left hamstring on Sept. 29. He has played in six games since his season debut on Feb. 8.\n\nCHIPPY FIRST HALF\n\nFive technicals were called in the first half and the teams had to be separated on two different occasions. Antetokounmpo was given a technical foul for shoving Chriss after the two became tangled underneath the Bucks basket during the first quarter. In the second quarter, Kidd and Bledsoe picked up double-technicals. Then, Booker and Middleton received double-technicals after the two exchanged words following a foul by Booker.\n\nUP NEXT\n\nSuns: Travel to play the Memphis Grizzlies on Tuesday.\n\nBucks: Travel to face the Cleveland Cavaliers on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995159.874979
}