{
  "game_id": "0022400136",
  "espn_id": "401704702",
  "date": "Nov 01, 2024",
  "matchup": "BKN vs. CHI",
  "headline": "Can Thomas scores 32 points in the Nets' 120-112 victory over the Bulls",
  "body": "NEW YORK -- — Cam Thomas scored 10 of his 32 points in the fourth quarter to help the Brooklyn Nets beat the Chicago Bulls 120-112 on Friday night.\n\n\r\n              Thomas scored eight straight points to give the Nets a 118-109 lead with 1:52 left.\n\n\r\n              Cam Johnson added 14 points in Brooklyn's second straight victory. Nic Claxton and Keon Johnson each had 12 points, and Ben Simmons had eight points, 11 assists and eight rebounds.\n\n\r\n              Nikola Vucevic led Chicago with 28 points on 10-of-11 shooting and had 11 rebounds. Zach LaVine and Coby White each added 21 points, with White going 5 of 9 from 3-point range.\n\n\r\n              Takeaways\r\n              \r\n              Bulls: Chicago trailed by 10 in the third quarter with 9:35 minutes remaining before outscoring the Nets 30-17, thanks to 13 points from Vucevic.\n\n\r\n              Nets: Thomas entered the day as the NBA’s leader in fourth-quarter points with an average of 12.2.\n\n\r\n              Key moment\r\n              \r\n              Brooklyn led by a point with 4:03 left when Thomas outscored the Bulls 10-2 to extend the lead 118-109. Thomas hit a pair of free throws and followed LaVine’s layup with a layup of his own to make 112-109. He then hit a 3-pointer on Brooklyn’s following possession off Ayo Dosunmu's miss. Chicago missed its next three shots as Thomas hit a 3 to seal.\n\n\r\n              Key stat\r\n              \r\n              Vucevic flirted with perfections, hitting his first 10 shots from the field. His only miss was a 3-pointer midway through the fourth quarter.\n\n\r\n              Up next\r\n              \r\n              The Nets host Detroit on Sunday, while the Bulls return home to face Utah on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998008.05307
}