{
  "game_id": "0021601163",
  "espn_id": "400900541",
  "date": "Apr 04, 2017",
  "matchup": "DAL @ SAC",
  "headline": "McLemore's big second half lifts Kings past Mavericks, 98-87",
  "body": "SACRAMENTO, Calif. --  With the Kings' bench depleted by injuries and coach Dave Joerger's decision to rest most of his starters, Ben McLemore thought his team might have a tough time finding a good rhythm.\n\nAfter his own slow start, McLemore made it a non-issue for himself and Sacramento.\n\nMcLemore scored 21 of his 22 points in the second half to lead six players in double figures, and the Kings beat the Dallas Mavericks 98-87 on Tuesday night.\n\n\"Playing with eight guys, it's tough,\" said McLemore, who shot 8 of 13. \"Before we went out there Garrett (Temple) made the emphasis that, `Hey, we're all we got. We just have to go out there, play hard, play together and get the results.' Tonight we got the results and we came out with a win.\"\n\nLimited to one free throw in the first half, McLemore scored 11 straight points to end the third quarter, then helped the Kings pull away in the fourth. McLemore made a pair of driving layups as part of a 13-4 run and hit back-to-back 3-pointers in the final two minutes to help Sacramento win the season series between the teams.\n\n\"I just stayed with it, stayed aggressive,\" McLemore said. \"My teammates kept looking for me and I started making shots. I got a real good easy one to the basket when I got a dunk (in the third) and that's when my rhythm started coming along.\"\n\nWillie Cauley-Stein added 12 points and 16 rebounds, while Buddy Hield scored 16 points and Georgios Papagiannis had 13.\n\nNicolas Brussino had a season-high 13 points along with seven rebounds and five assists for Dallas, which played without Dirk Nowitzki. The Mavericks have lost five straight.\n\nThe 38-year-old Nowitzki has been nursing a sore Achilles tendon and sat out with the Mavericks playing the front end of a back-to-back. Dallas coach Rick Carlisle is hopeful Nowitzki will play Wednesday in Los Angeles.\n\n\"He is feeling better,\" Carlisle said. \"Could be most likely a game-time decision. The signs are good at this point.\"\n\nNowitzki wasn't the only one getting the night off.\n\nBoth teams rested many of their starters, giving the game the feel -- and sometimes look -- of the preseason.\n\nSacramento started two backups and three players who weren't even with the team at the beginning of the season. Dallas was also missing regulars Wes Matthews and Seth Curry.\n\nPredictably, it wasn't pretty at times.\n\nThe Kings shot 39 percent in the first quarter while the Mavericks were only slightly worse and went just 2 of 10 beyond the arc to open the game.\n\nDallas broke out of its shooting slump in the third quarter with seven 3-pointers but faded late in the fourth and was held to six points over the final 3:40, when McLemore scored six points and Cauley-Stein had four.\n\n\"I thought our guys played with their whole heart as they have done most of the season,\" Joerger said. \"We're playing really young guys. It's a great experience for them. To play to win, compete . that's what it's about.\"\n\nTIP-INS\n\nMavericks: Curry missed his second straight game because of a left shoulder strain. Matthews was rested.\n\nKings: Aaron Afflalo (lower back strain) and Anthony Tolliver (hip strain) were held out while Collison, Lawson and Kosta Koufos were rested.\n\nBACKCOURT SHUFFLE\n\nWith guards Darren Collison and Ty Lawson sitting out, the Kings went with a starting backcourt of Hield and Langston Galloway. Predictably, Sacramento had problems taking care of the ball. Joerger's club committed 18 turnovers, including 11 in the first half when it made only 13 shots. \"We knew tonight we were going to make some turnovers, not having DC and Ty out there on the floor,\" McLemore said. \"We just had to continue going onto the next play and continue to be aggressive, and that's what we did.\"\n\nUP NEXT\n\nMavericks: Go to Los Angeles to play the Clippers on Wednesday. Dallas has won the last two games between the teams.\n\nKings: Travel south to face the Lakers in Los Angeles on Friday and can take the season series with a win.",
  "source": "espn_api",
  "crawled_at": 1764996095.2059479
}