{
  "game_id": "0022200244",
  "espn_id": "401468399",
  "date": "Nov 20, 2022",
  "matchup": "MIA @ CLE",
  "headline": "Garland scores 25, Osman 20 as Cavaliers blast Heat 113-87",
  "body": "CLEVELAND -- — The smiles, jokes and laughter returned to Cleveland's locker room following Sunday night's win.\n\n\r\n              A blowout brought a needed breather to these young Cavs.\n\n\r\n              Darius Garland scored 25 points, Cedi Osman added 20 and extra energy off the bench and the Cavs played one of their best games in weeks, rolling to a 113-87 win over the banged-up Miami Heat.\n\n\r\n              After ending a five-game losing streak with a double-overtime win Friday, the Cavs didn't have to work nearly as hard while handing Miami its sixth straight road loss. \n\n\r\n              Cleveland used a 21-2 tear in the second quarter to open a 19-point lead, and the Cavs pushed their advantage to 31 in the third. Guilty of blowing leads in the fourth quarter so many times this season, they finished the job with ease.\n\n\r\n              “It happens with every team,” said Donovan Mitchell, who scored just 13 — 18 below his average — in Cleveland's most lopsided home win. “You see the vibe in the locker room, it’s loose, it’s free. It’s understanding how to not tense up during a five-game losing streak. It’s just realizing it’s just 5 on 5 basketball. It’s gonna be all good.”\n\n\r\n              Evan Mobley had 15 points and 10 rebounds for Cleveland, which outscored Miami 67-37 over the second and third quarters.\n\n\r\n              The short-handed Heat fell to 0-3 on a trip that ends in Minnesota on Monday night.\n\n\r\n              “You do have to credit Cleveland. They played well,” Heat coach Erik Spoelstra said. \"It didn’t feel like we had a lot of juice and pop tonight. We’re not making excuses for anything. We just weren’t able to make those extra efforts on either end of the court and they really capitalized on all of that. \n\n\r\n              Bam Adebayo scored 21 to lead Miami after sitting out the previous two games with a bruised left knee. However, he didn’t have much help.\n\n\r\n              Kyle Lowry went just 2 of 10 from the floor, and the Heat's 36-year-old guard was 1 of 7 on 3-pointers with five turnovers two nights after playing 51 minutes in an overtime game against Washington.\n\n\r\n              Miami was also missing some key pieces as star forward Jimmy Butler (knee), starting guard Tyler Herro (ankle) and reserve guard Gabe Vincent (knee) were all out with injuries. Butler was sent back to Miami from the four-game road trip earlier this week to get rest and rehab.\n\n\r\n              “That was a good old-fashioned ass kicking,\" said guard Max Strus. “You just take it and move on. They just ran good plays and did some stuff we hadn't seen yet.”\n\n\r\n              Isaac Okoro added 13 points for the Cave, played without five-time All-Star Kevin Love. He sustained a hairline thumb fracture on Friday.\n\n\r\n              TIP-INS\n\n\r\n              Heat: F Duncan Robinson sprained his ankle on a drive in the fourth quarter. Spoelstra had no further update on his condition. ... Spoelstra said Butler remains “day to day” but that he received a “promising\" update on Miami's top player, who averages 20.9 points, 6.6 rebounds, 6.1 assists, 1.8 steals as one of the league's toughest players. ... Herro missed his seventh straight game, and Vincent was unavailable for his second in a row. Spoelstra said Herro “is not quite ready” and that swelling in Vincent's knee has come down.\n\n\r\n              Cavaliers: F Caris LeVert sat out the second half with a left ankle injury. ... Mitchell came in leading the league in minutes at 39.0 per game, 1.6 more than Toronto's Fred VanFleet. ... Love jammed his thumb while going for a loose ball against the Hornets. Coach J.B. Bickerstaff wouldn't give a timeline on Love's return, but expects him back “sooner rather than later.” ... F Dean Wade missed his fifth straight game with a knee infection. ... Cleveland improved to 6-1 at home, its best start since 2016-17, when the Cavs opened 9-1 on their floor.\n\n\r\n              UP NEXT:\n\n\r\n              Heat: Visit the Minnesota Timberwolves on Monday. \n\n\r\n              Cavaliers: Host the Atlanta Hawks on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995162.372436
}