{
  "game_id": "0022000302",
  "espn_id": "401267462",
  "date": "Jan 30, 2021",
  "matchup": "LAL @ BOS",
  "headline": "Anthony Davis scores 27, Lakers hold off Celtics 96-95",
  "body": "BOSTON -- — The Lakers started off their season-high, seven-game road trip by winning three of four before Anthony Davis was sidelined with an injury. \n\n\r\n                    He returned just in time to help his team avoid a third straight defeat. \n\n\r\n                    Davis had 27 points and 14 rebounds in his return to the lineup and Los Angeles hung on to beat the Boston Celtics 96-95 on Saturday night when Daniel Theis missed a follow shot at the buzzer.\n\n\r\n                    LeBron James finished with 21 points, seven rebounds and seven assists in the first meeting of the season between the longtime rivals. Montrezl Harrell added 16 points for the Lakers, who lost in Detroit on Thursday when Davis rested a bruised right quadriceps. \n\n\r\n                    “For me, personally, it's getting back in attack mode,” Davis said. “Being aggressive. Crashing the offensive glass. Being in the paint. All those types of things. Everything that I did tonight.”\n\n\r\n                    Lakers coach Frank Vogel said the energy was completely different with Davis back on the floor. \n\n\r\n                    “He’s built up. He’s getting into that mode right now. He’s starting to pick it up. The injury set him back a little bit. ... But we want him to be assertive. And when he’s assertive on both sides of the ball, we’re very difficult to beat.\"\n\n\r\n                    Jayson Tatum finished with 30 points and nine rebounds for the Celtics. Jaylen Brown added 28 points. Boston has lost five out of its last seven.\n\n\r\n                    The Celtics played the final 10:28 of the game without Marcus Smart, who was helped off the court with what the team said was a left calf strain following a collision with Harrell underneath the basket. Harrell tipped in a missed layup and stepped on Smart’s foot as he came down.\n\n\r\n                    Smart crumpled to the court. He was helped to his feet but couldn’t put any pressure on his leg as trainers carried him to the locker room. An MRI is planned for Sunday to get an extent of the injury. \n\n\r\n                    The Lakers surged following the injury. James broke an 85-all tie with a 3-pointer with 5:25 to play. \n\n\r\n                    The lead grew as high as 96-89. But a pair of free throws by Kemba Walker, a jumper by Tatum and turnover by James gave the Celtics life with 39 seconds remaining. \n\n\r\n                    Boston got the ball out of a timeout to Tatum, who got a floater to go in to cut the deficit to 96-95 and set up the final exchange. Walker knocked away Davis' jumper and then missed a jumper on the other end. Theis swooped in but couldn't get the follow to fall. \n\n\r\n                    “I like the shot that we got,\" Brown said of Walker's jumper. “We’ll take that 10 out of 10 times.”\n\n\r\n                    Smart’s injury was the latest blow to a Boston lineup that was playing with its projected starting lineup of Smart, Walker, Tatum, Brown and Theis for just the second time this season. Walker missed the first 12 games of the season recovering from a procedure on his left knee and Tatum missed multiple games earlier this month with COVID-19. \n\n\r\n                    The Celtics recovered from an uneven start and outscored the Lakers 29-19 in the third quarter to take a 78-71 lead into the final period. \n\n\r\n                    Boston gave the Lakers plenty of different looks on defense, including sending multiple double-teams at Davis and using a double-big man lineup that featured Theis and Robert Williams III. \n\n\r\n                    Theis played some of his best minutes of the season, contributing on both ends of the floor. It included a put back dunk over Davis in the third quarter.\n\n\r\n                    But the Lakers' reserves outscored their counterparts 35-15. They did it with a shortened group that featured only Harrell, Kyle Kuzma, Talen Horton-Tucker and Alex Caruso. \n\n\r\n                    “I like the energy that they had,\" Vogel said. \"We’ve got a lot of depth, so we’ll continue to use it.” \n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Davis scored 18 points in 16 minutes in the first half. … Played without Kostas Antetokounmpo (right knee tendinitis) and Jared Dudley (sore right calf).\n\n\r\n                    Celtics: Payton Pritchard missed his fourth straight game (sprained right knee). \n\n\r\n                    QUOTABLE\n\n\r\n                    “I think I’ve learned not to doubt the greats of all time. … There aren’t many guys like him that can play this well this late. But there weren’t many like him before.” — Celtics coach Brad Stevens on LeBron James’ level of play in his 18th season.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Conclude road trip at Atlanta on Monday. \n\n\r\n                    Celtics: Open five-game road trip at Golden State on Tuesday.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997319.470711
}