{
  "game_id": "0021601077",
  "espn_id": "400900472",
  "date": "Mar 24, 2017",
  "matchup": "CHI vs. PHI",
  "headline": "Career nights for Saric, Long lift 76ers past Bulls, 117-107",
  "body": "CHICAGO --  With many of his fellow high draftees sidelined, Dario Saric has turned into the leader for whatever is left of the Philadelphia 76ers.\n\nHe even deferred credit on his career night to one of his less-heralded teammates.\n\nWith only 10 players available, Saric scored a career-high 32 points to lead the 76ers to a 117-107 win over the Chicago Bulls, who are fighting for their playoff lives.\n\nSaric added 10 rebounds but deflected praise to rookie teammate Shawn Long, who had 18 points in his ninth career game.\n\n\"The main reason is because of Shawn Long,\" Saric said. \"He came off the bench, he brought the same kind of energy. Usually, he gets four or five fouls, but he was smart.\"\n\nWith Joel Embiid, Ben Simmons and Jahlil Okafor sidelined, veteran point guard Sergio Rodriguez led the 76ers to a 35-18 advantage in the second quarter. Coach Brett Brown kept Rodriguez in the whole quarter and the Spaniard scored nine points and had six assists.\n\n\"You guys should speak and write great things about what he did in the first half,\" Brown said. \"I kept Sergio going because he was playing so well.\"\n\nPhiladelphia turned a 59-46 halftime lead into a 20-point advantage early in the third quarter.\n\nThe lead reached 81-55 on T.J. McConnell's jumper midway through the third as Bulls fans at the United Center grew restless, booing coach Fred Hoiberg and the team.\n\n\"For us to come out and play with that type of effort at this time of year is maddening,\" Hoiberg said. \"We finally showed some fight in the last quarter, but it was way too late.\"\n\nThe Bulls had the lead cut to 102-92 midway through the fourth quarter, but Denzel Valentine missed an open 3-pointer. Saric then knocked down a contested 3-pointer off Valentine's miss to quiet the crowd with 5:55 to play.\n\n\"That was the back-breaker,\" Brown said of Saric, who scored 13 points in the fourth. \"In that fourth period, he sort of willed his way to the basket and found multiple ways to score in big times when the game really felt in the balance.\"\n\nThe Bulls remained even with Detroit for ninth place in the Eastern Conference. The Pistons were blown out by one of the East's worst teams, 115-87 in Orlando. The Bulls and Magic are each 1 1/2 games behind Miami, which is eighth.\n\nJimmy Butler led the Bulls with 36 points, 11 assists and seven rebounds.\n\n\"We do enough talking around here. I think everybody knows where we stand right now: on the outside looking in,\" Butler said. \"Everybody knows where we want to be. Ain't too much to say.\"\n\nRodriguez had 12 points and seven assists for the 76ers, and Gerald Henderson added 14 points.\n\nTIP-INS\n\n76ers: Okafor missed his second game this week with right knee soreness. He played Wednesday in Oklahoma City, but re-aggravated the injury, which kept him out of Monday's game. ... The 76ers snapped a 12-game losing streak against Chicago, including six straight at the United Center. ... Saric extended his double-digit points streak to 22 games, the longest by a rookie this season.\n\nBulls: Robin Lopez returned after a one-game suspension for fighting with Toronto's Serge Ibaka. He started and had one point and one rebound in 18 minutes. ... Cristiano Felicio missed his second straight game with a lower back contusion. Hoiberg said before the game that he could return for Sunday's game at Milwaukee. ... Bobby Portis had 17 points and 11 rebounds, and Nikola Mirotic had 15 points.\n\nSURGERY FOR EMBIID\n\nEmbiid had minor surgery on his left knee Friday to repair a torn meniscus. He should be able to transition to full weight-bearing workouts in about two weeks, according to a statement from Dr. Neal S. ElAttrache, who performed the surgery in Los Angeles.\n\nThe 23-year-old rookie has had a long history with injuries in his short career. It was announced March 1 that he would miss the rest of the season.\n\n\"He deserves some luck,\" Brown said before the game. \"He's been through a lot, and he's a different person than his first injury.\"\n\nAfter missing the first two seasons of his career with right foot injuries, Embiid played in 31 games this season. He was averaging 20.2 points, 7.8 rebounds and 2.5 blocks in 25.4 minutes. His last game was Jan. 27 in Houston.\n\nCHAMPIONSHIP DINNER\n\nOkafor took his high school alma mater's basketball team out for dinner on Thursday. Whitney Young won the Class 4A state title on Saturday. The Chicago native won a state championship in 2014 at Whitney Young.\n\nUP NEXT\n\n76ers: At Indiana on Sunday for the fourth game of a five-game road trip.\n\nBulls: At Milwaukee on Sunday for a meeting between teams fighting for one of the final playoff spots in the Eastern Conference.",
  "source": "espn_api",
  "crawled_at": 1764995013.428014
}