{
  "game_id": "0022201006",
  "espn_id": "401469161",
  "date": "Mar 11, 2023",
  "matchup": "DET vs. IND",
  "headline": "Smith leads Pacers to 121-115 win over short-handed Pistons",
  "body": "DETROIT -- — Jalen Smith scored 11 of his 20 points in the fourth quarter and the Indiana Pacers beat Detroit 121-115 Saturday night, extending the Pistons’ losing streak to 11 games.\n\n\r\n              Isaiah Jackson added 19 points and 11 rebounds for Indiana (31-37), which improved to 5-2 in its last seven games.\n\n\r\n              “I thought our young guys placed exceptionally well,” Pacers coach Rick Carlisle said. “Jalen was great, Isaiah did a great job, especially playing without fouling, and I loved the way (Andrew) Nembhard ran the team.” \n\n\r\n              Isaiah Livers had a career-high 18 points for Detroit (15-53), and Killian Hayes had 17 points and 13 assists.\n\n\r\n              “Killian has to play at that level and with that force for every minute he can,” Pistons coach Dwane Casey said. “That's a hard thing for young players to understand, whether it is on the offensive or defensive end.”\n\n\r\n              The Pistons were missing five of their top six scorers; Hayes was the only one in the lineup. The Pacers played without Tyrese Haliburton, Bennedict Mathurin and Myles Turner, and will again when the teams play again on Monday.\n\n\r\n              “Those three guys are banged up enough that I'm going to keep them out until at least the Milwaukee game,” Carlisle said. “I want to see our young guys validate this performance by going out and doing it again on Monday.”\n\n\r\n              The game was tied at 90 going into the fourth quarter, and the Pacers hit eight of their first 11 shots in the period to take a 114-103 lead.\n\n\r\n              Detroit had its top three post players — Jalen Duren, James Wiseman and Marvin Bagley III — but were taken apart inside in the first half. The Pacers had 11 offensive rebounds to Detroit's nine defensive rebounds, and finished with 38 points in the paint and 15 second-chance points.\n\n\r\n              “They kicked our behind every which way on the glass,” Casey said. “I talked to our bigs and told them if we’re going to play two bigs, we have to dominate the boards or at least play with more effort.”\n\n\r\n              Duren's 14 points and nine rebounds kept the Pistons within 69-57, but his teammates managed only eight rebounds in the half.\n\n\r\n              “When we're playing two bigs, we can't get outrebounded,” Duren said. “We know we have to fight against the Pacers — they are fighting for a play-in spot.”\n\n\r\n              Detroit, outscored Indiana 20-8 in the first four minutes of the second half to tie the game at 77. Hayes finished with nine assists and six points in the third.\n\n\r\n              “The third quarter wasn't what we wanted, but that's part of the development of young players,” Carlisle said. “I'm proud of the way they finished the game.”\n\n\r\n               TIPS IN\n\n\r\n              Pacers: Smith had 11 points and four rebounds in the first five minutes of the fourth quarter before being replaced by Jackson.\n\n\r\n              Pistons: Duren played 14:18 in the first half, but had four of Detroit's eight offensive rebounds and five of their nine defensive rebounds. ... Bagley left the game after aggravating an ankle injury.\n\n\r\n              HOME FOR THE WEEKEND\n\n\r\n              Jackson, a Detroit native, was playing his first NBA game at home.\n\n\r\n              “It is a great feeling to play in front of this crowd, to play in front of my family and to play in front of the people I grew up around,” he said.\n\n\r\n              UP NEXT\n\n\r\n              The Pacers will remain in Detroit to complete a two-game set against the Pistons on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994359.205842
}