{
  "game_id": "0021300870",
  "espn_id": "400489743",
  "date": "Feb 28, 2014",
  "matchup": "CHI @ DAL",
  "headline": "Bulls overtake Mavericks after trailing by 16 points",
  "body": "DALLAS -- Taj Gibson didn't worry when Chicago fell behind Dallas early, and he wasn't concerned when the Mavericks made a late run for the lead.\nThe Bulls had answers both times.\nGibson scored 20 points and grabbed 15 rebounds, Mike Dunleavy hit a go-ahead 3-pointer and Chicago overtook the Mavericks in the fourth quarter of a 100-91 victory Friday night.\n\"We're used to this,\" Gibson said after the Bulls (32-26) won for the eighth time in nine games, moved a season-high six over .500 and answered a 22-point home loss to Dallas in December. \"We get knocked down and we keep coming back.\"\nThe Mavericks led by 16 in the first half and had erased a six-point Chicago edge with a 7-0 run punctuated by Monta Ellis' second steal and breakaway dunk of the night when Dunleavy put the Bulls back in front and started a 10-0 run with a 3-pointer for an 87-85 lead.\nJimmy Butler had 19 points, seven rebounds and a big block during the decisive spurt, and Kirk Hinrich scored 17. Dunleavy finished with 16 points and eight rebounds, shooting 4 of 7 from long range.\nEllis scored 20 to the lead the Mavericks, who were trying to match their season high with a fifth straight win.\nDirk Nowitzki and Vince Carter had 15 apiece, but Carter scored just one point in the second half and was held to 0-of-6 shooting in the fourth quarter, when the Mavericks went 6 for 25 from the field.\n\"Some nights teams miss shots and you have to hang in with grit, guts, defense and rebounding,\" Dallas coach Rick Carlisle said. \"Weird thing about it was we were in front most of the first half and we let them climb back into it with grit, guts and rebounding.\"\nGibson, who had 16 points in the first half, followed Dunleavy's go-ahead 3 with a dunk on an assist from Joakim Noah, who then blocked a shot by Sam Dalembert on the other end right after committing his fifth foul.\nButler scored inside after Ellis fell down, and after two more Dallas possessions ended in misses, Hinrich hit a pull-up jumper for a 93-85 lead.\nButler blocked a layup try by Jose Calderon and made a free throw at the other end to complete the run as the Bulls outscored the Mavericks 27-15 in the fourth.\n\"We got nothing but good looks,\" said Ellis, who was 2 of 6 in the fourth and 7 of 19 for the game. \"We missed a lot of layups, a lot of shots in the middle, at the free throw line. Missed a lot of wide-open ones. Just weren't going down for us.\"\nAfter the Bulls went up 84-78 on back-to-back 3-pointers from D.J. Augustin and Hinrich, the Mavericks went back in front with a 7-0 run started when Nowitzki hit a one-legged fadeaway over Noah after Noah had stolen the ball from him two straight times.\nNoah didn't have a point or rebound in the first half but finished with 10 points and nine boards. The team's assist leader had four more of those as the NBA's lowest-scoring team reached 100 points for the third straight game -- all wins.\n\"We are an offensive juggernaut,\" coach Tom Thibodeau said with a smile. \"I thought we battled back and showed more discipline as the game went along.\"\nThe Bulls took their first lead on a reverse layup by Carlos Boozer with 2:48 left in the third quarter, but didn't score the rest of the period. Shawn Marion quickly answered with a layup, and DeJuan Blair ended a 2 1/2-minute scoreless stretch with a bucket to put Dallas up 76-73 going into the fourth.\nThe Mavericks made five of their first seven from long range and ran out to a 32-17 late in the first quarter, punctuated by a sprinting layup from Wayne Ellington when he was led perfectly on a long pass from Devin Harris.\nThe Bulls got within six in the second quarter before Dallas pushed the lead back to 51-38 on a dunk by Ellis after the 1,000th steal of his career.\nChicago rallied again to get within two on a 13-2 run that included 3-pointers from Dunleavy, Hinrich and Butler.\nGame notes\nThe Mavericks recalled F Jae Crowder, G Shane Larkin and C Bernard James after a one-game stint with their NBA Development League team. Crowder had a triple-double for the Texas Legends in suburban Frisco with 23 points, 18 rebounds and 10 assists. James had 38 points and 10 rebounds. G Ricky Ledo was sent back down to the Legends. ... In addition to the steals milestone, Ellis hit the 500th 3-pointer of his career in the first quarter.",
  "source": "espn_api",
  "crawled_at": 1764992644.966244
}