{
  "game_id": "0021800293",
  "espn_id": "401070974",
  "date": "Nov 25, 2018",
  "matchup": "POR vs. LAC",
  "headline": "Harris, Gallinari help Clippers edge Blazers 104-100",
  "body": "PORTLAND, Ore. --  Few, if any, expected the Los Angeles Clippers to be atop the Western Conference standings 19 games into the season.\n\nOn Sunday night, they even managed to impress themselves with a 104-100 comeback win over the Portland Trail Blazers.\n\n\"Gritty win. This to me may be our best,\" Clippers coach Doc Rivers said. \"We didn't have anything in the first half and we didn't make any adjustments other than we've got to play harder, we've got to play more physical. That's how we have got to play.\"\n\nTobias Harris had 34 points and 11 rebounds to lead the Clippers. Danilo Gallinari made the tiebreaking jumper with 47 seconds left and added 17 points.\n\n\"Just keep fighting,\" Harris said of the Clippers' mentality at halftime. \"We have a group of guys who want to win, who want to prove ourselves that we can close out games and win.\"\n\nDamian Lillard scored 30 points for Portland, which led by 13 at halftime but then had to play the second half without starting center Jusuf Nurkic because of a bruised shoulder.\n\n\"Losing Nurkic hurts them, there's no doubt about it,\" Rivers said. \"He was playing so well for them. We're not mad about that, but it definitely hurt them.\"\n\nWith Portland missing its defensive anchor, the Clippers began the half on a 20-4 run. The Clippers kept the momentum going, outscoring the Blazers 38-16 in the third quarter.\n\n\"The third quarter was very disappointing,\" Blazers coach Terry Stotts said.\n\nWith the game slipping away, Stotts left Lillard in the game to start the fourth quarter, and the star guard's personal 7-0 run in a span of 12 seconds tied it at 100 with 1:53 left.\n\n\"Lillard got those two (3s) at the end that I thought I was gonna die over,\" Rivers said. \"We were trying to trap and we slipped and messed up twice and he makes two. That's just how good he is.\"\n\nBut Gallinari made a short pull-up jumper moments later, Portland missed a couple jumpers on the next possession and Patrick Beverley clinched it with a pair of free throws after a botched rebound by the Blazers.\n\nThe loss ruined Maurice Harkless' first start of the season. He had returned Wednesday from a knee injury that kept him out since Oct. 29.\n\nWILD, WILD WEST\n\nAfter Sunday's games, only 3  1/2 games separated first place from 11th in the West. Both coaches don't think the competition is going anywhere.\n\n\"I don't see that changing much throughout the year,\" Stotts said. \"There's so much parity when you look at teams that weren't even predicted to be that strong. Sacramento is playing good ball. Every night is going to be a challenge in the West. If you start watching the standings now, it's not good.\"\n\nRivers agreed, with one exception.\n\n\"It's not normal because Golden State's not No. 1. That's not normal,\" Rivers said.  \"When you play in the West it feels like you don't have a night when you take a breather. You have to play and compete and we beat each other's brains out and then you have another one the next night. But the good news is everyone accepts that in the West and hopefully that makes us all better.\"\n\nTIP-INS\n\nClippers: Los Angeles improved to 13-6, the best record in the Western Conference. The Clippers have done it with a roster absent of household names, but depth is the reason they are where they are.\n\n\"You have seven or eight guys that can start and they do,\" Rivers said. \"We move it around. But as long as your group is good with that and the changes and we have good group.\"\n\nTrail Blazers: After a strong start to the season, the Blazers sputtered in the last two games of their road trip, losing by a combined 71 points. The defense, which was at one point in the top five in the league, has fallen to 16th in defensive efficiency.\n\n\"We've had three relatively poor defensive games, two of them against very good offensive teams,\" Stotts said before the game. \"I am concerned. It's not a trend I want to continue. Milwaukee was a train wreck.\"\n\nUP NEXT\n\nClippers: Host Phoenix on Wednesday.\n\nTrail Blazers: Host Orlando on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995195.0650811
}