{
  "game_id": "0022300866",
  "espn_id": "401585494",
  "date": "Mar 02, 2024",
  "matchup": "ATL @ BKN",
  "headline": "Bridges scores 38 points, Nets beat Hawks 114-102 for sweep of two-game series",
  "body": "NEW YORK -- — Mikal Bridges scored 38 points and the Brooklyn Nets rolled past the Atlanta Hawks for the second straight game, 114-102 on Saturday.\n\n\r\n              Cam Johnson chipped in 23 points for the Nets, who improved to 3-3 under interim coach Kevin Ollie and pulled within two games of the Hawks for 10th place in the Eastern Conference and the final spot in the play-in tournament.\n\n\r\n              “We’ve got to get as many (wins) as we can now,” Johnson said. “We put our backs against the wall, so it’s on us to dig ourselves out of that hole.”\n\n\r\n              Dennis Schroder had 14 points and eight assists, and Nic Claxton had 12 points and 13 rebounds for Brooklyn, which won for the third time in its past four games. That included a 124-97 victory over the Hawks on Thursday in the opener of the two-game series.\n\n\r\n              “These are two important games; obviously now the rest of these games are super-important, too,” Bridges said. “We know we needed these two big wins, and it just shows the fight and we just got to keep it throughout the rest of the season.” \n\n\r\n              Dejounte Murray had 20 points, 11 assists and six rebounds for the Hawks. Saddiq Bey scored 23 points and Clint Capela had 11 points and 10 rebounds, but Atlanta fell for the fifth time in its past seven games and lost the season series to the Nets for the seventh straight season.\n\n\r\n              “They took their physicality up a notch, and that made it harder for us to break the paint,” Hawks coach Quin Snyder said. ”(Brooklyn) is a team with intense size and athleticism throughout their lineup, and we just have to be better.”\n\n\r\n              Bridges scored at least 30 points in three of the four meetings this season.\n\n\r\n              After trailing nearly the entire first half, Brooklyn took over in the second half with defense. Atlanta made just 13 of 42 field goals, and the Nets limited the Hawks to just 40 second-half points while scoring 13 points off nine turnovers over the final 24 minutes.\n\n\r\n              “When you don’t score, you’re playing defense in transition, and that becomes difficult,” Snyder said. “Obviously they’ve got shooters, too.”\n\n\r\n              The run started in the third quarter, when Brooklyn outscored Atlanta 30-18 and limited the Hawks to 6-of-24 shooting (25%). Bridges scored 12 in the period, and Brooklyn led 90-80 after three.\n\n\r\n              “They did a good job of switching and being physical,” Bey said. “We just have to be better.” \n\n\r\n              After allowing 34 first-quarter points in Brooklyn’s wire-to-wire win Thursday, the Hawks led all but the first 1:14 in the first half Saturday. Led by Bey’s 14 first-half points, Atlanta shot 53.3% from the field and built a 13-point first-quarter advantage.\n\n\r\n              “We knew they were going to come out with some juice today, some energy,” Johnson said. “They threw the first punch, but there was plenty of game, is what we were saying.”\n\n\r\n              Brooklyn shot just 25.9% in the first quarter but stormed back with 39 second-quarter points and eight 3-pointers, tying a franchise record for most made 3s in a quarter without a miss. Bridges had 20 first-half points, helping Brooklyn trail by just two at halftime.\n\n\r\n              “Just an intensity,” Bridges said when asked what changed after the first quarter. “It was a pretty bad first quarter for myself, but we just kept fighting. We looked up and we were playing pretty bad, and we were only down like seven , so we were just like ‘stay the course’ ... and we did.”\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Visit New York on Tuesday.\n\n\r\n              Nets: Host Memphis on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996277.214019
}