{
  "game_id": "0021601061",
  "espn_id": "400900456",
  "date": "Mar 22, 2017",
  "matchup": "CHI vs. DET",
  "headline": "Mirotic scores season-high 28, Bulls beat Pistons 117-95",
  "body": "CHICAGO --  Out of the rotation at times and with his contract set to expire, Nikola Mirotic understands what's at stake for him as the season winds down.\n\nGames like this certainly don't hurt.\n\nMirotic scored a season-high 28 points, and the Chicago Bulls beat the Detroit Pistons 117-95 in a matchup between struggling teams fighting for a playoff spot on Wednesday night.\n\nMirotic shot 12 of 15 and made 4 of 6 3-point attempts to lead Chicago to an easy win after dropping eight of 10. He's set to become a restricted free agent, meaning his future is in question.\n\n\"I just want to prove those guys who trusted me -- the Chicago Bulls,\" he said. \"They ... gave me a chance. I was a first-round pick in 2011. I want to play well here.\"\n\nJimmy Butler added 16 points and 12 assists. Joffrey Lauvergne filled in for suspended center Robin Lopez and outplayed Andre Drummond with 17 points and seven rebounds. Rookie Paul Zipser added a career-high 15 points as the Bulls moved into a ninth-place tie with Detroit in the Eastern Conference.\n\nTobias Harris and Marcus Morris each scored 14 for the Pistons, losers of five of six. Drummond grabbed 17 rebounds but scored just eight points on 4-of-12 shooting.\n\n\"It starts with me,\" Pistons coach Stan Van Gundy said. \"I'm the person in charge. I selected everybody in that locker room. I decide who plays. I put lineups out there, you know. I decide on defensive coverages. I call plays. So it's all on me. I'm not running from that. We've got to try to find a way to get (the players) back.\"\n\nThe Bulls honored late general manager Jerry Krause with a moment of silence before the game. A Chicago native who oversaw a dynasty that produced two championship three-peats in the 1990s, he died at age 77 on Tuesday.\n\nThe Bulls saw a 13-point lead shrink to two with about a minute left in the second quarter. But layups by Lauvergne and Mirotic sent Chicago to the locker room up by six. They also started a 19-2 run that made it 74-55 in the third, essentially putting away this game.\n\n\"We are trying to stay together,\" Mirotic said. \"After a tough loss (at Toronto on Tuesday night), we came here in the mindset to play like a team because there is no more time to blow chances like that. We need to win the rest of our games.\"\n\nTIE GOES TO BULLS\n\nThe Bulls salvaged a four-game split with Detroit and clinched the head-to-head tiebreaker because they will finish with a better division record.\n\nMISSING CENTERS\n\nLopez and the Raptors' Serge Ibaka were both suspended one game without pay by the NBA for fighting. The two threw punches at each other during Tuesday's game at Toronto.\n\nWith backup C Cristiano Felicio (bruised lower back) also out, Lauvergne made his first start since the 2015-16 season with Denver.\n\nTIP-INS\n\nPistons: G Ish Smith had nine points, seven assists and three steals in his first start since Dec. 2 and 22nd of the season. He replaced Reggie Jackson.\n\nBulls: Butler was 6 of 6 from the field and hit all four free throws. ... Lauvergne's 17 points tied a season-high and were the most for him since Chicago acquired him from Oklahoma City at the trade deadline. ... The Bulls set a season high with 36 assists, shot 58.8 percent from the field and made 11 of 23 3-point attempts. ... G Cameron Payne was recalled from the D-League's Windy City Bulls on Wednesday.\n\nUP NEXT\n\nPistons: Visit Orlando on Friday.\n\nBulls: Host Philadelphia on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995014.8563352
}