{
  "game_id": "0021800680",
  "espn_id": "401071356",
  "date": "Jan 19, 2019",
  "matchup": "SAC @ DET",
  "headline": "Hield beats buzzer, lifts Kings to 103-101 win over Pistons",
  "body": "DETROIT --  Buddy Hield beat the buzzer with a winning shot for the first time in his NBA career.\n\nHield made an off-balance, fadeaway 3-pointer just before time expired and scored 35 points in the Sacramento Kings' 103-101 victory over the Detroit Pistons on Saturday night.\n\n\"I'm blessed to say I got one in the NBA at the highest level,\" he said. \"It's a fun. As a kid, you always dream of hitting one of those type of shots. It's something I'll cherish for the rest of my life.\n\nDetroit outscored the Kings in each of the first three quarters and had a 12-point cushion midway through the fourth.\n\nThat wasn't enough.\n\nHield made a 3-pointer with 1:11 left to put Sacramento ahead for the first time since midway through the first quarter.\n\nBlake Griffin, who scored 38 points, scored on the ensuing possession to put the Pistons ahead 101-100. Griffin had a chance to add to the lead on Detroit's next possession, but he passed to Reggie Jackson, who missed a shot to give the Kings another chance.\n\nHield made the most of it.\n\nHe fumbled an inbounds pass, scrambled to regain possession and put up a shot from the left wing that hit nothing but the bottom of the net.\n\n\"We were trapping him because we knew he couldn't make another play with 3.4 seconds,\" Pistons coach Dwane Casey said. \"We had three guys there. You have to be shoulder to shoulder, but he got between two guys, saw some daylight and threw one up there.\"\n\nHield sprinted around the court after making the game-winner, leaped over a camera cord and led a joyous parade to the locker room.\n\n\"The lady almost tripped me. I think she was trying to trip me,\" Hield said. \"She put it up high. Thank God for my track background, I was able to hurdle over the wire.\"\n\nGriffin scored 14 points in the first quarter to help the Pistons establish control they had until Hield led a charge over the last several minutes of the game.\n\nDe'Aaron Fox and Marvin Bagley scored 14 point apiece and Willie Cauley-Stein added 12 points for the Kings.\n\nLuke Kennard scored 19 points for the Pistons. They were without center Andre Drummond due to him being in concussion protocol.\n\nDetroit held Hield scoreless in the third after he had 20 points in the first half, helping the Pistons go into the fourth quarter ahead 82-74.\n\n\"We were kind of running in mud,\" Kings coach Dave Joerger said. \"We hung in there long enough with our defense to make it close at the end and then Buddy got going.\"\n\nSOONER SHOWDOWN\n\nOklahoma's basketball program was well represented in the game with Hield and Griffin.\n\n\"Blake is special,\" Hield said. \"He's one of the guys I look up to.\"\n\nHield said Griffin shared some encouraging words after a workout last summer.\n\n\"He said, `You're going to be something special,\" Hield recalled. \"He said, `You're better than you're showing.\"\n\nSTAND AND WATCH\n\nDetroit's offense often consisted of Griffin dribbling the ball, trying to drive to the basket or backing down his defender while his teammates stood around.\n\n\"He's our go-to guy every night,\" Kennard said. \"He knows we needed that from him. And, he wants that role. But we have to help him out. We've got some of the best shooters in the league on this team. If we start making shots, it is going to change everything about spacing.\"\n\nTIP-INS\n\nKings: With one of the NBA's fastest teams, Sacramento often pushes the ball and scores after opponents make baskets and free throws.\n\n\"We just kept trying to runt them,\" Joerger said. \"Maybe they got tired in the fourth.\"\n\nPistons: G Ish Smith missed the game along with Drummond with a groin injury. Smith aggravated the injury Friday night in his third game back after missing 19 games.\n\nUP NEXT\n\nKings: At Brooklyn on Monday.\n\nPistons: At Washington on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994194.239307
}