{
  "game_id": "0021500026",
  "espn_id": "400827913",
  "date": "Oct 30, 2015",
  "matchup": "CHA @ ATL",
  "headline": "Bazemore's 19 points help Hawks hold off Hornets, 97-94",
  "body": "ATLANTA --  With Kyle Korver resting his surgically repaired ankle, the Atlanta Hawks tried a two-point guard lineup and let Kent Bazemore fill in as the 3-point specialist.\n\nThe new look was just good enough to hold off the Charlotte Hornets.\n\nBazemore led Atlanta with 19 points and the Hawks held off Charlotte's late comeback to beat the Hornets 97-94 on Friday night.\n\nBazemore matched his career high with four 3-pointers.\n\n\"I just let the game come to me, and I was a little more aggressive running the floor and playing with more energy and getting to the open spots for my teammates,\" Bazemore said. \"They did a great job of finding me.\"\n\nPaul Millsap and Al Horford each had 18 points for Atlanta, while point guards Jeff Teague and Dennis Schroder each had 14 points.\n\nTrailing 97-94, the Hornets had one final opportunity following a Hawks turnover on Millsap's inbounds pass which skipped past Horford with 2.8 seconds remaining.\n\n\"Al didn't have his first baseman's mitt on,\" Hawks coach Mike Budenholzer said.\n\nThe Hawks survived when Kemba Walker's last-second 3-point attempt for the Hornets bounced off the rim.\n\n\"He makes those sometimes,\" Hornets coach Steve Clifford said of Walker's shot.\n\nThe Hornets' 20 turnovers led to 26 points for the Hawks.\n\n\"We've got to play with a purpose,\" Clifford said. \"We had too many turnovers. If you have 20 turnovers and give up 21 fast-break points, you're going to lose.\"\n\nNicolas Batum led the Hornets with 14 points and 11 rebounds.\n\nBudenholzer sampled the two-point guard look during the preseason. He said playing without Korver was \"an opportunity to push that further.\"\n\nBazemore filled the 3-point void left by Korver's absence. Bazemore made each of his three 3s in the first half and added another in the fourth quarter.\n\nAtlanta lost a 12-point lead early in the second quarter. The Hornets rallied again after trailing by 14 early in the final period. Atlanta led 90-76 before two free throws by Jeremy Lin sparked an 11-0 run by Charlotte that included two 3-pointers from Williams and another from Lin.\n\nTIP-INS\n\nHornets: G Jeremy Lamb (right ankle sprain) was sharp after missing the season opener. Lamb scored eight quick points, including consecutive 3s, in the second period and finished with 11 points. ... Marvin Williams and Walker each had 13 points. Williams, who began his career with Atlanta, had 12 rebounds. Al Jefferson had 10 points and 11 rebounds.\n\nHawks: F/C Mike Muscala (sprained right ankle) missed his second straight game. ... Budenholzer said Korver's playing time will continue to be monitored, including in back-to-back games, following offseason surgeries on his ankle and elbow. He played 32 minutes against the Knicks. ... F Thabo Sefolosha had four points after missing Thursday night's game to rest his right ankle.\n\nFIRST POINTS\n\nFrank Kaminsky, the Hornets' No. 9 overall pick from Wisconsin, hit a 3-pointer in the second quarter for his first career points. He added another basket on a short floater later in the period to finish with five points.\n\nSTILL NO HARDAWAY\n\nTim Hardaway Jr. was in uniform but did not play. He has yet to make his debut for the Hawks. Rookie Lamar Patterson has moved ahead of Hardaway, acquired from the Knicks, in the playing rotation.\n\nUP NEXT\n\nThe Hawks and Hornets will play again in Charlotte on Sunday. It will be the Hornets' home opener after playing their first two games on the road for only the second time in franchise history and the first time since 2005-06.",
  "source": "espn_api",
  "crawled_at": 1764994420.928542
}