{
  "game_id": "0021800952",
  "espn_id": "401071625",
  "date": "Mar 04, 2019",
  "matchup": "BKN vs. DAL",
  "headline": "Nets crush Mavericks 127-88 to end three-game skid",
  "body": "NEW YORK --  The Nets needed a win, and they got their easiest one ever in Brooklyn.\n\nDeMarre Carroll scored 22 points, Rodions Kurucs had 19 and the Nets easily snapped a three-game losing streak with a 127-88 victory over the Dallas Mavericks on Monday night.\n\nCaris LeVert added 18 points and Spencer Dinwiddie finished with 16 on a night the Nets shook up their starting lineup but were fueled by their reserves. The 39-point margin was their most lopsided victory at home -- and matched their biggest victory overall -- since moving from New Jersey in 2012.\n\n\"This was definitely a game for us to build off of,\" guard D'Angelo Russell said. \"Coming into this one, we knew we had to get it. We know we've got a tough stretch coming up so we need all the confidence we can get.\"\n\nThe Nets were routed by teams below them in the standings in their last three games but led nearly the entire way, with the lead ballooning to 44 points. Brooklyn moved back into a tie for sixth place in the Eastern Conference.\n\nDwight Powell scored 20 points and Luka Doncic had 16 for the Mavericks, who lost for the seventh time in eight games. Dallas did finally get Dirk Nowitzki a couple late baskets after he missed his first nine shots in what could have been his last game in Brooklyn.\n\n\"It was ugly from start to finish,\" Mavericks coach Rick Carlisle said. \"When you lose every quarter in an NBA game, you certainly haven't done what you needed to do, so very disappointing night.\"\n\nWith Treveon Graham out with back soreness, Kurucs started at power forward, and coach Kenny Atkinson also inserted Allen Crabbe for LeVert at shooting guard. LeVert had started the previous seven games after coming off the bench in his first two after a returning from a 42-game absence with a dislocated right foot.\n\n\"I think we wanted to change something up, do something different. Him coming off the bench or starting, he told me this morning, `I really don't care, Coach, as long as I get my minutes,\" Atkinson said of LeVert, who was the team's leading scorer when he got hurt. \"He got his minutes.\"\n\nAtkinson said before the game that Brooklyn's problem in its recent losses to Washington, Charlotte and Miami was poor shooting affecting their effort on defense.\n\nNeither side of the floor was a problem in this one, as the Nets were shooting above 60 percent into the fourth quarter before finishing at 56.5 percent. They limited Dallas to 35.6 percent.\n\nThe Nets led 31-21 after one and quickly pushed the lead to 18 led by Carroll and Dinwiddie. They maintained that 18-point cushion at halftime -- after Doncic threw in a halfcourt shot for the final basket -- for their biggest halftime advantage of the season.\n\nThey extended it to 26 after three, also their biggest margin of the season, and all that was left from there was cheering for Nowitzki to get on the board. Fans screamed his name as soon as the Mavs started bringing the ball up the floor, and booed the Mavericks players who took shots rather than pass to Nowitzki, who still hasn't said if he will retire.\n\nTIP-INS\n\nMavericks: Dallas opened a three-game road trip. It has won five straight and 16 of the last 17 matchups with Washington, its next opponent. ... Nowitzki finished 2 for 13.\n\nNets: Kurucs and Carroll both made five 3-pointers. ... Russell had 13 points and 11 assists.\n\nSUPPORT FOR DIRK\n\nNowitzki said the receptions he has received on the Mavericks' trips to the East have been phenomenal, but he wishes the Mavericks could play better. They lost by 30 at Memphis in their previous game.\n\n\"So I am really appreciative,\" he said. \"I enjoy it, but I enjoy winning a little better.\"\n\nON THE ROAD\n\nKristaps Porzingis has been traveling with the Mavericks, even though he won't play this season while recovering from his torn left ACL. Carlisle said it's doubtful Porzingis takes part in full practices this season, but that he's been doing a lot of things behind the scenes and vocal in huddles during the games. The 7-foot-3 forward hadn't been traveling with the Knicks before they dealt him to the Mavs.\n\n\"The No. 1 thing right now is his health, getting him back 100 percent, which will happen,\" Carlisle said. \"But in the meantime he's picked up his workouts, he's doing more aggressive 1-on-1, controlled banging-type stuff with some of our assistants and making great progress.\"\n\nUP NEXT\n\nMavericks: Visit Washington on Wednesday.\n\nNets: Host Cleveland on Wednesday.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995391.982452
}