{
  "game_id": "0021801175",
  "espn_id": "401071848",
  "date": "Apr 03, 2019",
  "matchup": "POR vs. MEM",
  "headline": "Turner has 2nd triple-double, Blazers beat Grizzlies 116-89",
  "body": "PORTLAND, Ore. --  Evan Turner's second consecutive triple-double was even more rewarding because it came on a night when the Trail Blazers collected their 50th win.\n\nTurner had 13 points, 12 rebounds and 11 assists off the bench in Portland's 116-89 victory over the short-handed Memphis Grizzlies on Wednesday night.\n\nWith the victory, the Blazers improved to 50-28 on the season.\n\n\"Fifty wins is really dope, because I've never actually done that,\" said Turner, the NBA's only player with back-to-back triple-doubles off the bench going back to the 1983-84 season.\n\nDamian Lillard came close to a triple-double, too, with 20 points, 10 assists and seven rebounds, but he sat for the final quarter after the Blazers built a solid lead. Enes Kanter had 21 points and 15 rebounds for his third straight double-double.\n\nThe Blazers continue to jockey for home-court advantage in the playoffs as the season winds to a close. Portland held onto fourth in the standings, two games up on the Utah Jazz in the Western Conference.\n\n\"I told the team 50 wins has always been a benchmark in this league. If you're a 50-win team, I think that really speaks a lot about what you've done in the regular season and the success you've had,\" Blazers coach Terry Stotts said. \"I think we should all be very proud of what we've done so far this year. We've got our work ahead of us, but you need to celebrate moments like this.\"\n\nChandler Parsons had 16 points off the bench to lead the Grizzlies (31-47), who have already been eliminated from playoff contention.\n\nTurner had 13 points, 11 rebounds and 10 assists on Monday for a 132-122 victory over the Timberwolves. It was his first triple-double with the Blazers.\n\nAfter Turner got his ninth assist late in the fourth quarter against the Grizzlies, teammate Jake Layman appeared to shout \"One more!\"  from the bench. He clinched the triple-double a short time later with an assist on Anfernee Simons' 3-pointer with just under two minutes left. He added one more assist before subbing out.\n\nTurner is the first Blazers player with back-to-back triple-doubles since Clyde Drexler in the 1989-90 season.\n\nHe didn't get the game ball afterward, though. \"I should've asked for that ball!\" he mused.\n\nThe Blazers led by as many as 29 points in the second half after trailing by as many as 10 in the first.\n\nThe Grizzlies had just 10 players available for the game, and none of the team's regular starters were available. Both Mike Conley, the team's leading scorer with an average of 21 points, and center Joakim Noah were ruled out, coach J.B. Bickerstaff said before the game.\n\nThe team this weekend signed Dusty Hannahs to a 10-day contract under league's hardship rules to help, given the spate of injuries.\n\n\"In the second half, offensively, the game got away from us because we didn't repeat the same things we we're doing in the first half,\" Bickerstaff said. \"Give Portland credit because they turned their defense up. Some of it is on us for not simplifying the game the way we did in the first half though.\"\n\nPortland is also dealing with injuries. C.J. McCollum remained out with a left knee strain. McCollum worked out before the game and is expected to travel with the team to Denver on Friday, but it's unknown if he'll be back in the regular season.\n\nThe Blazers already lost center Jusuf Nurkic for the season because of a broken leg. Kanter has started five games for Portland in his place.\n\nThe Grizzlies took a 38-28 lead in the first half on Bruno Caboclo's long jumper and the Blazers looked confounded by Memphis' zone defense.\n\n\"I've never seen a team play zone that much in a game since I've been in the league,\" Lillard said.\n\nPortland closed the gap and tied the game at 56 on Seth Curry's 3-pointer, before Lillard lofted a buzzer-beating jumper to go up 62-58 at the half. Lillard led all players with 14 points at the break.\n\nPortland pulled away in the second half, pushing the lead to 82-66 on Kanter's layup.\n\nTIP INS\n\nGrizzlies: Rumors abound that Grizzlies assistant Jerry Stackhouse is in the running for the job as head coach of Vanderbilt. ... Conley was out with left ankle soreness and Noah had right knee soreness, according to the team. \"We're down a lot of bodies right now so we're just trying to go out there and fight and compete the best that we can,\" Tyler Dorset said afterward.\n\nTrail Blazers: The Blazers had split their previous 10 games with Memphis. ... It's the 14th time in franchise history that the Blazers have reached 50 wins. ... Zach Collins finished with a career-high 18 points.\n\nLILLARD'S BIG NIGHT\n\nAlmost overshadowed by Turner's triple-double and the 50 wins, Lillard went over 2,000 overall points for the season in the second half. He's the first Blazer to have 2,000 points and 500 assists in the same season, and the only player besides James Harden to reach both of those plateaus this season.\n\nHe's the only Blazer besides Drexler to reach 2,000 points in two seasons with the team.\n\nUP NEXT\n\nGrizzlies: At Dallas on Friday night.\n\nTrail Blazers: At Denver on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995151.387671
}