{
  "game_id": "0022000863",
  "espn_id": "401307659",
  "date": "Apr 18, 2021",
  "matchup": "BKN @ MIA",
  "headline": "Bam! Adebayo's jumper lifts Heat past Nets, 109-107",
  "body": "MIAMI -- — Bam Adebayo was supposed to call timeout. He had another idea. This was the scenario that he had envisioned in his mind so many times, game tied, crowd on its feet, ball in his hands, final seconds ticking away.\n\n\r\n                    “Your moment,\" Adebayo told himself.\n\n\r\n                    He delivered — when the Miami Heat needed him most.\n\n\r\n                    Adebayo drove left, stopped and watched his 13-foot jumper rattle in as time expired, a shot that allowed the Heat to beat the Brooklyn Nets 109-107 on Sunday to snap a three-game slide.\n\n\r\n                    “He handled it the right way,\" Heat coach Erik Spoelstra said. “He looked over to the bench, and at that point we just made eye contact. My hands were up, and it was like, ‘OK, it just better be the last shot.'\"\n\n\r\n                    It was.\n\n\r\n                    Adebayo had 21 points and 15 rebounds for the Heat, who trailed by six points in the final minutes before finishing the game on a 10-2 run.\n\n\r\n                    Goran Dragic scored 18 points, Kendrick Nunn scored 17 and Trevor Ariza had 15 for Miami.\n\n\r\n                    Landry Shamet had 30 points for Brooklyn, and Kyrie Irving scored 20 for the Nets. Brooklyn played again without James Harden, sidelined with a hamstring issue, and lost Kevin Durant early in the first quarter with a left thigh contusion.\n\n\r\n                    “He's sore, but we don't know how severe it is,\" Brooklyn coach Steve Nash said.\n\n\r\n                    Jimmy Butler — who called the Heat “soft” after their loss Friday in Minnesota — was held out by Miami with a sprained right ankle, his 16th game missed this season.\n\n\r\n                    It was close the entire way, Miami never leading by more than seven, Brooklyn never by more than five until the final minutes. The Heat matched that seven-point edge when Dragic’s layup with 6:50 remaining made it 99-92, but the Nets scored the next 13 points to reclaim the lead.\n\n\r\n                    Bruce Brown had a layup to start the spurt, then got an offensive rebound into the hands of Joe Harris to set up a 3-pointer, and Shamet made back-to-back 3s to put the Nets up by four. Those 11 points came in a span of exactly 2 minutes, and a goaltending call credited another basket to Harris for a 105-99 lead with 4:04 left.\n\n\r\n                    Brooklyn was 0 for 5 from the field the rest of the way.\n\n\r\n                    “They were playing well, hitting a lot of shots, so you've got to give credit, like I always say,\" Irving said. “But there were definitely some preventable plays out there that I feel like just could have been better.\"\n\n\r\n                    Miami controlled the finish, and needed to. A loss would have left Miami 2½ games behind New York in the race for the Eastern Conference’s No. 6 spot that will keep a team out of the play-in tournament. Instead, the Heat remained 1½ back with 15 games remaining.\n\n\r\n                    “A season can turn around real fast,\" Adebayo said.\n\n\r\n                    Durant left 4:03 into the game, after scoring Brooklyn’s first eight points. He was fouled on a drive 1:33 into the contest and missed both free throws — only the second time this season that he went 0 for 2 on a trip to the foul line.\n\n\r\n                    He left not long afterward, and the Nets quickly declared his day over. Durant has missed 33 of Brooklyn’s 57 games.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Brooklyn needs only to go 8-7 the rest of the way to post the best single-season record in franchise history. ... The Nets used their 31st lineup in 57 games. ... Brown entered the arena in University of Miami gear, paying tribute to the place where he spent his two college seasons. ... It was the third 20-point game for Shamet this season.\n\n\r\n                    Heat: Butler missed all three games against Brooklyn this season. The first two, in January, were during his 10-game absence for COVID-19. ... Victor Oladipo (right knee soreness) missed his fifth consecutive game. ... Actor and comedian Chris Rock was among those in attendance, as was Miami Dolphins coach Brian Flores and tennis star Coco Gauff.\n\n\r\n                    DEDMON'S DAY\n\n\r\n                    Miami's Dewayne Dedmon took only one field-goal attempt and had 10 points and 10 rebounds. He was 8 for 8 from the foul line. It was the NBA's first one-shot, 10-or-more-point game since 2012, and only the second such game in Heat history.\n\n\r\n                    ‘WARRIOR’ JOE\n\n\r\n                    Harris is the only Brooklyn player to appear in all 57 Nets games this season, and Nash says he’s been a “warrior” for the club. “He’s been over-reliable,” Nash said. “I’d like him to miss a few years. It’s not healthy for him to play so many games, I don’t think. He plays so hard as well. He is a warrior that just wants to play every night and when I even bring up rest, he’s not into it at all.”\n\n\r\n                    3 FOR ALL\n\n\r\n                    The teams combined for 15 3-pointers in the first quarter, matching the most in any game this season. It happened in four other contests and tied for the fourth-highest first-quarter total in NBA history. The record is 19, set by Dallas and Golden State on Dec. 28, 2019.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Visit New Orleans on Tuesday.\n\n\r\n                    Heat: Host Houston on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997477.511047
}