{
  "game_id": "401809776",
  "espn_id": "401809776",
  "date": "Nov 07, 2025",
  "matchup": "MEM vs DAL",
  "headline": "Ja Morant, Cedric Coward help Grizzlies to big lead and a 118-104 victory over Mavericks",
  "body": "MEMPHIS, Tenn. -- — Ja Morant and rookie Cedric Coward scored 21 points each as the Memphis Grizzlies built a big first-half lead and coasted to a 118-104 victory over the Dallas Mavericks in an NBA Cup game on Friday night.\n\n\r\n              Jaren Jackson added 17 points for Memphis and Santi Aldama finished with 16 points as the Grizzlies snapped a four-game losing streak. Morant had 13 assists, while Coward grabbed nine rebounds.\n\n\r\n              Max Christie led the Mavericks with 18 points, while Naji Marshall added 16 points. P.J. Washington finished with 14 points, 11 of them in the first quarter. Cooper Flagg, the top pick in last summer's draft, had 12 points.\n\n\r\n              Dallas played its fourth game without Anthony Davis, who is nursing a left calf strain.\n\n\r\n              Both teams entered the night on losing streaks — Dallas dropping its previous three. But Dallas had been competitive, losing the last four by an average of seven points. Not so much for Memphis. The Grizzlies had lost their six games this season by an average of 15 points.\n\n\r\n              Memphis, which has struggled in the first half, got off to a good start and built a double-digit advantage. They stretched it to open the third quarter on a 13-5 rally, the lead eventually reaching 35.\n\n\r\n              Dallas put a slight dent in to the Memphis lead, trailing 102-80 after three, but could not get within single digits in the fourth.\n\n\r\n              Both teams have struggled at 3-point shooting, sitting in the bottom six spots of the league. And the Mavericks continued their woes, staying below 20% in the first half. Memphis connected on 10 of 21 from distance in the half to lead 74-51 at the break.\n\n\r\n              Up next\r\n              Mavericks: Play Wizards on road Saturday.\n\n\r\n              Grizzlies: Host the Oklahoma City on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042579.19028
}