{
  "game_id": "0021600041",
  "espn_id": "400899491",
  "date": "Oct 30, 2016",
  "matchup": "HOU vs. DAL",
  "headline": "Harden hits late free throw, Rockets beat Mavs 93-92",
  "body": "HOUSTON --  James Harden blamed the added suspense on Rockets coach Mike D'Antoni.\n\nHarden made a free throw with 0.1 seconds left, lifting the Rockets over the Dallas Mavericks 93-92 in their home opener Sunday night.\n\nHarden put extra pressure on himself by missing the first of two foul shots after being fouled by Wesley Matthews on a driving layup at the buzzer with the game tied.\n\n\"Coach messed me up, man -- he said, `Make the first one and miss the second one,' and I did the opposite,\" Harden said with a smile. \"I'm just happy I made it and we came away with the win.\"\n\nHarden led Houston with 28 points, seven rebounds and seven assists, edging Matthews in a gutsy back-and-forth.\n\nAfter trailing by 10 entering the fourth quarter, Dallas tied it at 92 on a 3-pointer by Matthews with 4.1 seconds remaining.\n\nD'Antoni was pleased with the execution on the play that won the game. Nene received the inbound pass and found a cutting Harden with a crisp bounce pass before Matthews drew his sixth foul.\n\n\"That's what he does,\" D'Antoni said. \"That's why he's one of the best, and he's just so good at drawing fouls and getting in the lane.\"\n\nMatthews led Dallas with 25 points and J.J. Barea scored 18 points off the bench. In falling to the Rockets for the second time in three days, the Mavericks fell to 0-3 for the first time since 2011-12, the lockout-shortened season following their title.\n\n\"We gave ourselves a chance, and it comes down to the one play and the whistle,\" Mavericks coach Rick Carlisle said. \"We're up against it right now in a lot of ways, but no one's backing down. We've just got to find a way.\"\n\nDallas was without Dirk Nowitzki (illness, sore Achilles tendon) for a second straight game. Nowitzki participated in pregame warmups but was a late scratch.\n\n\"Our margin for error is so slim,\" Matthews said. \"We're not the Golden State Warriors, we're not the Cleveland Cavaliers, we're not the Spurs, but we're a ... good team. So we've got to minimize the stuff that we can control.\"\n\nHouston got strong performances from offseason additions Eric Gordon, Ryan Anderson and Nene in their home debuts. Gordon had 14 points, Anderson had 14 points and 12 rebounds and Nene had 11 points.\n\nThe Rockets capped the first and second quarters with points at the buzzer. To end the first, Corey Brewer hit a 3-pointer from 30 feet out. Harden ended the second quarter on a driving layup to put the Rockets up 63-53.\n\nLate in the third quarter, Houston's Trevor Ariza and Dallas' Salah Mejri received double-technical fouls after both players fell to the floor and were tangled for a few seconds. Ariza clinched his fists before he was restrained by players.\n\nTIP-INS\n\nMavericks: Without Nowitzki, Dallas was frequently undersized but managed to hold their own in the rebounding category, with Houston edging the Mavericks 46-42. ... Starting in Nowitzki's place, Seth Curry played 23 minutes and scored no points on 0-for-3 shooting.\n\nRockets: Houston was plagued by 17 turnovers compared to just nine turnovers from Dallas. ... Sam Dekker scored nine points on 3-of-3 shooting from 3-point range.\n\nDEFENSIVE COMPOSURE\n\nAfter the defense struggled in a 106-98 loss to Houston on Friday, Dallas allowed 63 points in the first half before holding Houston to just 17 points in the third quarter and 13 points in the fourth quarter.\n\nHOPKINS IN HOUSE\n\nHouston Texans WR DeAndre Hopkins was in attendance for the game, just hours removed from his team's 20-13 win over the Detroit Lions.\n\nUP NEXT\n\nMavericks: Visit Utah on Wednesday night.\n\nRockets: Visit Cleveland on Tuesday for the first leg of a season-long five-game road trip.",
  "source": "espn_api",
  "crawled_at": 1764995801.393187
}