{
  "game_id": "0022200822",
  "espn_id": "401468977",
  "date": "Feb 08, 2023",
  "matchup": "CLE vs. DET",
  "headline": "Allen, Mobley power Cavaliers to 113-85 win over Pistons",
  "body": "CLEVELAND -- — Jarrett Allen scored 20 points, Evan Mobley added 19 and the Cleveland Cavaliers won their fourth straight game, 113-85 over the Detroit Pistons on Wednesday night despite resting their starting backcourt.\n\n\r\n              All-Star starter Donovan Mitchell (groin) and Darius Garland (thumb) got the night off to heal some nagging injuries and the Cavs barely missed their top guards, who average a combined 48.8 points.\n\n\r\n              With Allen and Mobley doing inside damage and combining for 21 points, Cleveland built an 18-point lead after one quarter.\n\n\r\n              The Pistons hung around and got within two in the third before the Cavs opened the fourth by outscoring Detroit 26-4 over the first seven minutes to put it away.\n\n\r\n              “Jarrett did a great job of setting the tone,” Cavs coach J.B. Bickerstaff said. “There was a bunch of extra-effort plays that he made where he was just outworking the guy in front of him. He was able to get offensive rebounds, his teammates were finding him in the paint.\n\n\r\n              \"And the same thing with Evan. They had opportunities to attack and were extremely aggressive.\"\n\n\r\n              Allen added 14 rebounds as the Cavs outrebounded the Pistons 48-32 and held them to their lowest point total this season.\n\n\r\n              “These type of games are butt-kicking contests because they play physical offense,\" Pistons coach Dwane Casey said. \"It was a great game for us to feel, to taste, to go up against a hard-nosed, physical playoff team.”\n\n\r\n              Bojan Bogdanovic scored 15 and rookie Jalen Duren 14 for Detroit. The Pistons have dropped nine of 11 and have the worst record (14-42) in the Eastern Conference.\n\n\r\n              Cavaliers swingman Caris LeVert, who has been mentioned in rumors leading into Thursday's NBA trade deadline, struggled for much of the game. He finished with 15 points — 10 in the fourth — on 5-of-16 shooting.\n\n\r\n              “He knows we need him,” Bickerstaff said, “and he knows how to get to his spots and what he's capable of, so it's not one of those things where he's having a bad night and you just sit him down.\"\n\n\r\n              The Cavs are unlikely to make a significant move, but LeVert's expiring $18 million contract does make him attractive for a team looking to clear salary space in the offseason.\n\n\r\n              Cleveland hasn't lost since a tough three-point defeat at home against Miami.\n\n\r\n              “I feel like everyone is just clicking right now,” Mobley said. “Everyone is in attack mode.”\n\n\r\n              THE GREAT DEBATE\n\n\r\n              Now that he's the NBA's career scoring leader, LeBron James has checked a box on his resume that can't be equaled.\n\n\r\n              And while there will continue to be discussion over whether James or Michael Jordan is the greatest player in league history, Bickerstaff believes one argument has been settled.\n\n\r\n              \"I no longer think there is a debate over who had the greatest NBA career,” Bickerstaff said, referring to James, who spent 11 seasons with Cleveland.\n\n\r\n              For Bickerstaff, James' best attribute is his well-roundedness — as a player and person.\n\n\r\n              “The way he has gone about his business,” he said. \"He’s a pros pro. He’s about his teammates. He made everybody he plays with better. You can be a great player and be selfless. ”He's a hell of a role model for younger players.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Surprisingly, Detroit came in leading the league in free throws attempted (27) and made (20.8). ... The Pistons went 17 of 18 from the line. ... Rookie Jaden Ivey has scored in double figures in 17 straight games.\n\n\r\n              Cavaliers: LeVert and Raul Neto started in place of Mitchell and Garland. Neto had 14 points eight assists and four steals. ... Recorded their league-leading 25th win by double digits. ... Ricky Rubio played 16 minutes as the Cavs continue to monitor him following knee surgery. ... F Kevin Love was active, but didn't play for the fifth straight game. “We're just trying to give this rotation and opportunity and see what we got with it,” Bickerstaff said.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host San Antonio on Friday.\n\n\r\n              Cavaliers: At New Orleans on Friday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995235.637718
}