{
  "game_id": "0021800801",
  "espn_id": "401071474",
  "date": "Feb 05, 2019",
  "matchup": "MEM vs. MIN",
  "headline": "Conley, Holiday help Grizzlies beat Timberwolves 108-106",
  "body": "MEMPHIS, Tenn. --  Mike Conley put together quite a performance in possibly his final game with the Memphis Grizzlies.\n\nConley had 25 points and nine assists, and the Grizzlies beat the Minnesota Timberwolves 108-106 on Tuesday night on Justin Holiday's two free throws with .1 seconds remaining.\n\nConley and longtime teammate Marc Gasol are being shopped around ahead of Thursday's trade deadline. Gasol was a late scratch amid reports about the Grizzlies being in trade talks.\n\n\"They knew what it meant to me and Marc,\" Conley said of the team opening with a 23-4 run and emerging with its second straight win. \"It's just a tough situation all the way around.\"\n\nMemphis also got 23 points from rookie Jaren Jackson Jr. Ivan Rabb had a career-high 19 points to go along with 11 rebounds, while Holiday finished with 17 points.\n\nKarl-Anthony Town had 26 points and 18 rebounds for Minnesota, and Dario Saric finished with 22 points. Luol Deng scored 18.\n\n\"We had opportunities to win the game early,\" Minnesota interim coach Ryan Saunders said. \"When you dig yourself a 19-point hole, it's tough to come back from.\"\n\nBefore the Grizzlies could celebrate, they had to survive a late push by the Timberwolves. Towns tied it at 106 when he converted a pair of free throws with 15.7 second left.\n\nThe game appeared headed to overtime until Holiday was fouled by Josh Okogie in the final second. Holiday converted both free throws for the final margin.\n\nAsked what he was thinking at the line, Holiday replied: \"These are money. They were going in. Once they fouled me, I knew the game was over. There was no way I was going to get two chances at it.\"\n\nAs Conley left the floor, he looked around FedExForum before heading to the locker room and slapping hands with fans in the hallway.\n\n\"It was a little surreal,\" Conley said, adding he wondered throughout if it possibly was his last game with his only NBA team.\n\n\"It would cross my mind almost every timeout,\" he said. \"Look into the crowd. Be looking back at the bench. Looking at coaches and players and seeing my wife and kids in the stands in the same spot they've been in for 12 seasons. It was all just trying to take it all in and enjoy it.\"\n\nTIP-INS\n\nTimberwolves: Saric reached double figures for the first time since scoring 11 against Philadelphia on Jan. 15. ... Minnesota made each of its 15 free throws in the first half and finished the game 19 of 20. ... Jerryd Bayless finished with five points, stopping his string of six straight games in double figures. .Towns recorded his 35th double-double of the season.\n\nGrizzlies: Rabb's previous career high was 16 on April 4, 2018, against New Orleans. ... Memphis had not won consecutive games since Dec. 23 and 26. .Conley has scored at least 20 points in 31 games this season.\n\nGASOL SIGHTING\n\nDespite not playing, Gasol came out of the locker room near the midway point of the first quarter and sat on the Memphis bench as fans responded with a standing ovation.\n\n\"I think it's obvious (that is) a guy who means a ton to this organization, this fan base, the people in this city and the respect that they have for him,\" Memphis coach J.B. Bickerstaff said of the crowd reaction.\n\nUP NEXT\n\nTimberwolves: Play the Magic in Orlando on Thursday.\n\nGrizzlies: Play at Oklahoma City on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994913.970847
}