{
  "game_id": "0021800654",
  "espn_id": "401071330",
  "date": "Jan 15, 2019",
  "matchup": "MIL vs. MIA",
  "headline": "Antetokounmpo has triple-double as Bucks crush Heat 124-86",
  "body": "MILWAUKEE --  Held well below his season scoring average, Giannis Antetokounmpo found other ways to help the Milwaukee Bucks win.\n\nAntetokounmpo had 12 points, 10 rebounds and 10 assists in his fourth triple-double of the season, and the Bucks cruised past the Miami Heat 124-86 on Tuesday night.\n\nAntetokounmpo, who averages nearly 27 points, took just nine shots as the Bucks benefited from having seven players score in double figures.\n\n\"He didn't need to (score),\" Heat coach Erik Spoelstra said. \"He read the game and saw that everybody else was going off and he didn't get in the way.\"\n\nThe triple-double was the 13th of his career.\n\n\"(Giannis) has such great court vision,\" Bucks coach Mike Budenholzer said. \"I think all year he has done a great job of balancing scoring and facilitating.\"\n\nEric Bledsoe had 17 points and Malcolm Brogdon added 16 for Milwaukee, which has won 13 of 16 dating to Dec. 14. The Bucks improved to 31-12, second-best in the NBA. They are a season-high 19 games over .500.\n\nJustise Winslow and Hassan Whiteside had 19 points apiece for Miami, which fell to 21-21.\n\nSpoelstra expressed frustration with his team's effort.\n\n\"I didn't see this one coming. I don't know if our locker room saw this one coming,\" Spoelstra said. \"They are a very good team and you have to bring your best game against them and it starts with your effort and focus. We didn't bring those things.\"\n\nMilwaukee used a 12-0 run midway through the second quarter to pull away. The Bucks led by 26 late in the period. Antetokounmpo had five points, eight rebounds and six assists in the first half.\n\nA lack of focus after the Bucks jumped out in front ruined the Heat's chances for a comeback, Winslow said.\n\n\"There were a couple of stretches that we became disconnected from each other and the game,\" he said. \"Guys looked like they didn't want to be here when we got down by 20, but we can't have that. We have to keep that competitive edge.\"\n\nThe Bucks built a 31-point lead in the third quarter and held a 93-63 advantage heading to the fourth. Milwaukee's lead grew to as many as 38, the final margin, in the fourth as both teams turned to their reserves early.\n\n\"We were in a zone (defense) and they started to hit some 3s,\" Whiteside said. \"I think we started to overact and miscommunicated.\"\n\nThe Bucks had a 13-2 run to close out the first quarter and grab a 30-23 lead despite shooting 39 percent. Whiteside had 10 points in the quarter for Miami.\n\nTIP-INS\n\nHeat: Started a four-game trip and play 12 of their next 16 on the road. ... Whiteside returned to the lineup after missing Saturday's game due to illness. ... G Josh Richardson started after not participating in the team's practice on Monday due to knee tendinitis.\n\nBucks: Signed forward Bonzie Colson to a two-way contract. Colson has spent the 2018-19 season with the Canton Charge of the G league after going undrafted out of Notre Dame. ... Brogdon missed just his third free throw in 88 attempts this season. ... All 13 players scored.\n\nBANGED UP\n\nAntetokounmpo, who has been dealing with right quadriceps soreness and a left hip contusion, played his second consecutive game after sitting out against Washington on Friday. \"Sometimes during the season, you get some bangs and some bruises,\" Budenholzer said. \"The more we can manage how much he does either on off days or practice days or shootarounds, but he's not easy to dial back. We just need to make sure that he stays as healthy as possible.\"\n\nUNUSUAL SURROUNDINGS\n\nDwyane Wade starred at Marquette, which played its home games at the Bradley Center until moving into the Bucks' new arena, the Fiserv Forum, when it opened this season. Demolition crews imploded the massive roof of the neighboring Bradley Center on Sunday.\n\n\"Normally, I come back and I can look around the arena and think about moments I had at Marquette and the Bradley Center,\" Wade said. \"This is definitely a little different in a new arena. It was definitely a home-court advantage. We lost one game in my two years there.\"\n\nUP NEXT\n\nHeat: Visit Detroit on Friday night.\n\nBucks: At Memphis on Wednesday night, where Milwaukee has won just once since 2009.",
  "source": "espn_api",
  "crawled_at": 1764994487.567461
}