{
  "game_id": "0022200825",
  "espn_id": "401468980",
  "date": "Feb 08, 2023",
  "matchup": "MIA vs. IND",
  "headline": "Adebayo scores 38, Heat hold off sliding Pacers 116-111",
  "body": "MIAMI -- — Bam Adebayo entered this season wanting more shots. The Miami Heat gave him those opportunities, and are thrilled at how it's working out.\n\n\r\n              Miami's All-Star center tied his season high with 38 points, Jimmy Butler added 25 and the Heat held off the Indiana Pacers 116-111 on Wednesday night to snap a two-game slide.\n\n\r\n              Adebayo was 12 of 16 from the field, 14 of 14 from the foul line.\n\n\r\n              “Bam, obviously, was really good on both ends of the court,” Heat coach Erik Spoelstra said.\n\n\r\n              Gabe Vincent had 17, Tyler Herro scored 15 and Caleb Martin finished with 12 points and 11 rebounds for the Heat, who snapped a two-game slide.\n\n\r\n              Buddy Hield scored 29 points for Indiana, which has lost 13 of its last 15 games. Myles Turner had 23 points and 11 rebounds, while T.J. McConnell scored 18.\n\n\r\n              Tyrese Haliburton had 10 assists for the Pacers, but a Heat defense led by Butler held him to 11 points — 32 fewer than he scored in a win at Miami on Dec. 23. His 3-pointer with 10.5 seconds left got Indiana within three, but Adebayo sealed it with a pair of free throws.\n\n\r\n              “Miami has a deserved, an earned reputation as a hard-playing team, a team that always responds to previous losses,\" Pacers coach Rick Carlisle said.\n\n\r\n              The Heat and Pacers split the four-game regular-season series. And just like the first three, this one went right down to the end. The combined score of the season series entering Wednesday was Pacers 294, Heat 294; now, it's Heat 410, Pacers 405, none of the games this season decided by more than five points.\n\n\r\n              It was Adebayo's 10th 30-point game of the season, matching the total of all other Heat players combined — Butler has five, Herro four and Max Strus has one.\n\n\r\n              “He's found a great balance,\" Butler said. “If you've got the hot hand, you've got to keep feeding that individual. And a lot of nights, it's Bam. You've got to ride that wave sometimes.\"\n\n\r\n              He's the sixth player in Heat history to have at least 10 games of 30 or more in the same season, and nobody had done it since LeBron James — now the NBA's career scoring leader — had 31 such games for Miami in 2013-14.\n\n\r\n              “The work speaks for itself,\" Adebayo said.\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Including playoffs, it was the 1,996th NBA game for Carlisle — 1,796 as a coach, and 200 more he got into as a player. No. 2,000 would be next Wednesday against Chicago, Indiana’s final game before the All-Star break. ... Andrew Nembhard scored 10 for Indiana.\n\n\r\n              Heat: Miami had a season-low nine bench points. ... PG Kyle Lowry missed his second consecutive game with left knee soreness, and the Heat expect him to miss at least two more. ... Jazz Chisholm of the Miami Marlins was among those in the crowd, getting a Heat jersey as a gift during a third-quarter timeout – followed by a hug and handshake from Hield, a fellow Bahamian.\n\n\r\n              BIG HALF\n\n\r\n              McConnell had 16 points in the first half, the second-most points he’s ever had by halftime in his career. He had 25 by halftime against Milwaukee on Jan. 16, finishing that game with a career-high 29 — one of only four 20-point games for him in the NBA. Including playoffs, McConnell averaged 5.5 points in 33 games against Miami entering Wednesday.\n\n\r\n              MUST-SEE TV\n\n\r\n              As would be expected, Spoelstra was tuned in Tuesday night to watch James pass Kareem Abdul-Jabbar and become the leading scorer in NBA history. “I rarely stay up for those late games — but that was must-see TV,” Spoelstra said. “It’s so historic for him to be able to do that. And for Kareem to be in the building, that’s one of those amazing NBA moments.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Phoenix on Friday.\n\n\r\n              Heat: Host Houston on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993945.943007
}