{
  "game_id": "0022400739",
  "espn_id": "401705305",
  "date": "Feb 07, 2025",
  "matchup": "TOR @ OKC",
  "headline": "Jalen Williams leads Thunder past Raptors 121-109 as Chet Holmgren returns from injury",
  "body": "OKLAHOMA CITY -- — Jalen Williams scored 27 points, Shai Gilgeous-Alexander added 25 and the Oklahoma City Thunder beat the Toronto Raptors 121-109 on Friday night in Chet Holmgren's return from injury.\n\n\r\n              Holmgren, the runner-up for rookie of the year last season, played for the first time in three months after recovering from a pelvic fracture. The 7-foot-1 forward had four points, five rebounds and four blocks in 22 minutes.\n\n\r\n              Aaron Wiggins added 18 points for the NBA-best Thunder (41-9), who won their fourth straight.\n\n\r\n              Scottie Barnes scored 21 points and Gradey Dick added 17 for the Raptors, who lost their third in a row.\n\n\r\n              Toronto was short-handed. Scoring leader RJ Barrett was in the concussion protocol. Brandon Ingram, acquired from New Orleans before the trade deadline, was with the team but didn't play.\n\n\r\n              The Thunder led 58-47 at halftime and maintained control in the third quarter. Midway through the period, Williams was fouled as he drove for a tough layup in traffic. The ball rolled in, and he flexed his arms and shoulders for the crowd. He made the free throw to give the Thunder a 79-64 lead.\n\n\r\n              Takeaways\r\n              Raptors: The Raptors made 20 of 50 shots inside the 3-point line as the Thunder's front line of Holmgren and the 7-foot Isaiah Hartenstein created problems.\n\n\r\n              Thunder: Oklahoma City didn't miss a beat with Holmgren back. The Thunder made 51.2% of their shots and had 26 assists to 12 turnovers.\n\n\r\n              Key moment\r\n              Holmgren scored his first basket on a layup with 9:43 left in the first quarter. \n\n\r\n              Key stat\r\n              Gilgeous-Alexander made all 14 of his free-throw attempts.\n\n\r\n              Up next\r\n              The Raptors visit Houston on Sunday. The Thunder visit Memphis on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996953.636388
}