{
  "game_id": "0022000244",
  "espn_id": "401267404",
  "date": "Jan 23, 2021",
  "matchup": "BKN vs. MIA",
  "headline": "Durant, Irving help Nets hold off Adebayo, Heat 128-124",
  "body": "NEW YORK -- — Brooklyn's three superstars were just enough to overcome Bam Adebayo's brilliant individual effort. \n\n\r\n                    Kevin Durant scored 31 points, Kyrie Irving took over late and had 28 and the Nets overcame Adebayo's career-high 41 points to beat the Miami Heat 128-124 on Saturday night.\n\n\r\n                    James Harden finished with 12 points, 11 assists and seven rebounds as the Nets won for the first time with their Big Three playing together. They lost consecutive games with dismal defensive efforts in Cleveland and barely got enough stops to hold off a short-handed Heat team that had been limited to 81 points by Toronto a night earlier.\n\n\r\n                    “It’s not every day you see this collection of guys playing together in NBA history, so we want to take full advantage of that,” Irving said. \n\n\r\n                    Irving helped pull the Nets through with 12 points in the final 5:48 after the Heat had erased nearly all of an 18-point deficit.\n\n\r\n                    Joe Harris added 23 points and seven 3-pointers for Brooklyn, but the Nets needed Irving's 18 points in the final quarter of a game they had largely controlled.\n\n\r\n                    “All three of those guys, they’re just so damn skilled. Off the dribble, their shooting ability, their ability to see open players, and that’s why they're three of the best in this business,” Heat coach Erik Spoelstra said. “And those are shots that only great players can manufacture.” \n\n\r\n                    Goran Dragic scored 19 points and Kendrick Nunn and Duncan Robinson each had 18 for the Heat, who remain without Jimmy Butler and Tyler Herro. Adebayo also had nine assists while blowing past his previous best scoring night of 30 points.\n\n\r\n                    “I wish we’d gotten the W; 40 don’t mean nothing unless you got the W, for real,” Adebayo said.\n\n\r\n                    Durant was 5 for 5 and scored 13 points in the third quarter, with the last of his three 3-pointers in the period making it 96-80. Adebayo beat the buzzer with a jumper, than Miami opened the fourth with a 13-0 run to get within 96-95.\n\n\r\n                    “We were up 20 points throughout, 16, 14 going to the fourth quarter, so we were in good shape. But we’ve got to put together four quarters of great basketball,” Durant said.\n\n\r\n                    Irving, Harden and Durant quickly combined for eight straight points but Adebayo kept coming, and the Nets needed a couple of clutch baskets from Irving and late free throws to pull it out. \n\n\r\n                    Harris had four 3-pointers and 12 points in the first quarter. The Nets were ahead 60-42 with a little more than two minutes left in the half, but Miami trimmed it to 66-56 on Adebayo's 3-pointer just before the buzzer.\n\n\r\n                    Harden didn't make a basket until the fourth, threatening to go without one in a game for the first time since he left Oklahoma City. He finally attempted his first shot with 0.7 seconds left in the first quarter and was fouled behind the arc, making all three free throws for a 36-25 lead.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Moe Harkless started at forward but exited in the second quarter with a bruised left thigh after banging legs with a Nets player along the baseline. He hadn't even played in the series opener against Toronto and got only six minutes Friday.\n\n\r\n                    Nets: Jeff Green scored 11 points. ... The Nets came in averaging an NBA-best 121.5 points at home.\n\n\r\n                    THE SHIRT OFF HIS BACK\n\n\r\n                    Irving and Adebayo have been friends for years but that means little during the coronavirus pandemic. Irving was trying to get Adebayo’s pink-and-blue Heat jersey after the game before security intervened, as new NBA initiatives try to keep opposing players separated to stop the spread of the virus.\n\n\r\n                    “Oh, he definitely wants it,” Adebayo said. “I’m going to send him one on my own time.”\n\n\r\n                    Irving was fined $50,000 recently for not wearing a mask during an indoor gathering and said he was trying to stay out of trouble.\n\n\r\n                    “I just want to follow NBA protocols,” he said.\n\n\r\n                    LINE THEM UP\n\n\r\n                    Miami used its 11th different starting lineup in its 15th game, while coach Steve Nash sent out a different first five for the 12th time in Brooklyn's 18 games. Part of that is because of player absences and part because he is still experimenting following the Harden trade, which he may still need to do before settling on his preferred starters.\n\n\r\n                    “I'm not sure we’re there yet,\" Nash said. \"It might be ideal to be there but I don’t know that we are, so I don’t want to commit to that yet.”\n\n\r\n                    UP NEXT\n\n\r\n                    The teams meet again Monday at Barclays Center.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997514.572503
}