{
  "game_id": "401809804",
  "espn_id": "401809804",
  "date": "Nov 26, 2025",
  "matchup": "MIA vs MIL",
  "headline": "Erik Spoelstra gets 800th win, Tyler Herro scores 29 and Heat edge Bucks in NBA Cup matchup",
  "body": "MIAMI -- — Tyler Herro scored 29 points, Bam Adebayo finished with 17 points and 11 rebounds and the Miami Heat beat the Milwaukee Bucks 106-103 in an NBA Cup game on Wednesday night.\n\n\r\n              The win was the 800th for Heat coach Erik Spoelstra.\n\n\r\n              Norman Powell, Andrew Wiggins and Kel’el Ware each scored 11 for Miami, which improved to 3-1 in Cup games and 9-1 at home this season. Miami would win Group C if Milwaukee beats New York on Friday; if the Knicks win that game the Heat would need some help to reach the quarterfinals.\n\n\r\n              Ryan Rollins scored 26 for Milwaukee, which got 24 from Myles Turner and 15 from Gary Trent Jr. The Bucks have dropped six straight, the last four of those without Giannis Antetokounmpo.\n\n\r\n              Spoelstra is the 17th coach in NBA history with 800 wins and only the third to reach that total with one franchise in regular-season play, joining Gregg Popovich (1,390 with San Antonio) and Jerry Sloan (1,127 with Utah).\n\n\r\n              Milwaukee lost an NBA Cup group stage game for the first time; the Bucks — the event's defending champion — were 10-0 in that round of games since the tournament, now in its third season, was added to the schedule. Bucks coach Doc Rivers was 8-0 in Cup games as a coach entering Wednesday.\n\n\r\n              Antetokounmpo missed a fourth consecutive game with a strained left adductor. But he went through some of shootaround Wednesday and did a pregame workout, indicators that he could be nearing a return.\n\n\r\n              “Even when he’s playing there’s a stretch where he’s not on the floor that we still have to master and we have not this year yet,” Rivers said. “So, I still think in the long run this stretch will be good for us.”\n\n\r\n              Up next\r\n              Bucks: Visit New York on Friday in an NBA Cup game.\n\n\r\n              Heat: Host Detroit on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042698.995032
}