{
  "game_id": "0022300709",
  "espn_id": "401585337",
  "date": "Feb 04, 2024",
  "matchup": "HOU @ MIN",
  "headline": "Edwards scores 32 as Timberwolves pull away to beat Rockets 111-90",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 22 of his 32 points in the third quarter, Rudy Gobert had 17 points and 13 rebounds and the Minnesota Timberwolves pulled away in the second half to beat the Houston Rockets 111-90 on Sunday night.\n\n\r\n              Edwards, named to his second All-Star game this week, shot just 1 of 8 for six points in the first half as Houston kept the game close in a stifling defensive matchup. However, he was 9 for 12 in the third quarter, including 4 for 5 on 3-pointers, and outscored the Rockets 22-20 in the period.\n\n\r\n              “I love when he’s attacking the rim, putting a lot of pressure, drawing fouls and then, I think, once he does that, it opens up his 3-point shot,” Gobert said of Edwards. “I thought he did a great job just shooting the 3s instead of shooting the 2s.”\n\n\r\n              Gobert added four of Minnesota's season high-tying 11 blocks. Karl-Anthony Towns, fresh off his fourth All-Star selection, had 14 points and 10 rebounds.\n\n\r\n              The Timberwolves have won five of seven and the victory earned coach Chris Finch the nod to lead the Western Conference in the All-Star game. Finch was showered with cold water by his team in the locker room after the game.\n\n\r\n              “Really, it’s a reflection of our season to date,” Finch said. “It’s everybody doing their job. I know the players were excited coming into the game to be able to give that opportunity to us, so we really appreciate that.”\n\n\r\n              Alperen Sengun had 15 points and 10 rebounds for the Rockets, while rookie Cam Whitmore scored all of his 14 points in the second half. Fred VanVleet added 11 points. Houston shot 35.2% for the game.\n\n\r\n              “No rhythm out there, there's no flow,\" said Jalen Green, who had eight points and seven assists but shot 3 of 15. “Offense is just all set and it's a big team. It's hard to play against a set defense. I don't know. There's no rhythm.”\n\n\r\n              Minnesota entered the game averaging a league-low 107.0 points allowed per game this season, while Houston was ninth, giving up 112.3 points a game. The matchup lived up to the billing in a tight, physical first half as both teams shot under 40% from the field.\n\n\r\n              The Wolves, who are averaging the third-most turnovers in the league, didn’t have one in the first quarter before totaling nine in the second, leading to 13 points for the Rockets.\n\n\r\n              With Sengun, Dillon Brooks and Jabari Smith Jr. in foul trouble, Edwards went to work in the third. Keyed by the star guard, Minnesota went on a 16-2 run to take control, eventually leading by 25.\n\n\r\n              “I couldn’t hit,” Edwards said of the first half. “My two 3s was in and out. My midrange went in and out. In and out layup. Free throws. I was just off.”\n\n\r\n              UP NEXT\n\n\r\n              Rockets: At Indiana on Tuesday night.\n\n\r\n              Timberwolves: At Chicago on Tuesday night to start a five-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995599.77377
}