{
  "game_id": "0022300469",
  "espn_id": "401585097",
  "date": "Jan 03, 2024",
  "matchup": "BKN @ HOU",
  "headline": "Alperen Sengun scores 30 points as Rockets hand Nets fifth straight loss, 112-101",
  "body": "HOUSTON -- — Alperen Sengun scored 30 points and Fred VanVleet added 21 points and 10 assists as the Houston Rockets beat the Brooklyn Nets 112-101 on Wednesday night.\n\n\r\n              Sengun has hit the 20-point mark in seven consecutive games. He shot 11 of 17 from inside and drained 8-of-10 free throws while grabbing eight rebounds.\n\n\r\n              “On offense they trust me,” Sengun said. “They’re playing through me, a lot isolation, so I’m trying my best to score.”\n\n\r\n              VanVleet knocked down 6-of-8 3-pointers, with Houston finishing the game 19 of 39 from long distance.\n\n\r\n              The Nets have lost five in a row and 10 of their last 12, dropping them 15-20 on the season.\n\n\r\n              “I’m going to continue to hold them to a standard,” Nets coach Jacque Vaughn said. “They deserve that. This will make us better as a team. We’ll grow from this together, but the belief part of it has to be the first part of getting out of this hole.”\n\n\r\n              Mikal Bridges and Cameron Johnson led the Nets with 15 points. Nic Claxton added 12 points and 13 rebounds, while Royce O’Neale chipped in 13 points off the bench.\n\n\r\n              VanVleet scored 11 points in the first quarter and the Rockets led 26-22. Houston shot 6 of 11 from behind the 3-point line, with VanVleet converting on all three of his attempts, but Brooklyn scored nine points off nine Houston turnovers in the second quarter to take a 50-49 lead at halftime.\n\n\r\n              “They had 14 points off those 12 (turnovers) in the first half and nine fast break points,” Rockets coach Ime Udoka said. “We looked at that and said, ‘They scored 50, only, and if we take care of that they’re in the low 30s,' so did a much better job. Only three turnovers in the second half.”\n\n\r\n              Brooklyn grew its lead to five within the first three minutes of the third quarter only to see Houston go on a 24-6 run, which was capped by Cam Whitmore’s third 3-pointer of the night. He finished with 11 points off Houston’s bench.\n\n\r\n              The Rockets outscored the Nets 38-25 in a third quarter that ended with VanVleet blocking O’Neale’s half-court heave at the buzzer to take a 12-point lead into the fourth, and Brooklyn couldn't get closer than nine points in the final period.\n\n\r\n              Houston improved to 17-15 despite playing without starting forward Dillon Brooks, who missed his fourth straight game due to an oblique strain, and Tari Eason, because of left leg soreness.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Oklahoma City on Friday night.\n\n\r\n              Rockets: Host Minnesota on Friday night as their seven-game homestand continues.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996351.389832
}