{
  "game_id": "0022000238",
  "espn_id": "401267398",
  "date": "Jan 22, 2021",
  "matchup": "PHX vs. DEN",
  "headline": "Jokic scores 31, Nuggets rally to beat Suns 130-126 in OT",
  "body": "PHOENIX -- — Denver coach Michael Malone is a little exasperated with his players after 15 games. Sometimes the Nuggets look like one of the NBA's best teams. Sometimes they've looked awful.\n\n\r\n                    He's just thankful the good version showed up in time on Friday night.\n\n\r\n                    Nikola Jokic scored 31 points, Gary Harris added 19 and the Nuggets rallied to force overtime before beating the Phoenix Suns 130-126. The win pushed Denver above .500 for the first time this season at 8-7.\n\n\r\n                    “We’ve shown we can do it,” Malone said. “The challenge is to do it more consistently and as close to 48 minutes as possible.”\n\n\r\n                    Will Barton pushed the Nuggets ahead 124-123 with 1:37 left in overtime on a driving layup and Jamal Murray's 13-foot jumper put them up three points with 28.5 seconds left. Denver held on from that point, winning for the third time in four games to improve to 8-7 this season.\n\n\r\n                    Devin Booker led the Suns with 31 points but took a hard fall late in overtime and didn't play the final few possessions. Phoenix's offense looked discombobulated without its leading scorer on the floor and didn't score a field goal until the final seconds when it was too late.\n\n\r\n                    Suns coach Monty Williams said that Booker hurt his left hamstring and likely wouldn't play on Saturday night in the rematch between the two teams.\n\n\r\n                    Suns forward Deandre Ayton had 27 points and 13 rebounds, shooting 11 of 13 from the field. Mikal Bridges added 24 points and 10 rebounds and was 6 of 8 from 3-point range.\n\n\r\n                    Denver shot nearly 52% from the field and six players scored in double figures. Jokic added 10 rebounds and eight assists and was a big part of the reason the Nuggets poured in 80 points in the paint. \n\n\r\n                    “I didn’t do what I was supposed to do,” Ayton said. “They had 80 points in the paint tonight and that is on me. I have to be more of an anchor be more of a presence down low just to shut it down early.”\n\n\r\n                    The Suns had a 14-point lead at halftime but Denver sliced that deficit to 95-91 by the end of the third quarter. The Nuggets took their first lead since the opening minute when PJ Dozier made a driving layup with 8:33 left that made it 98-97.\n\n\r\n                    “They have been together for a while so they have been in a lot more game like that, (playoff-type) games like that,” Bridges said. “Credit to them but if we limit the turnovers, we have a chance to win it.”\n\n\r\n                    Jokic made a lay-up in the lane to tie the game at 114 with about a 1:07 left in regulation. Both teams had a couple chances to push ahead in the final minute but shots wouldn't fall.\n\n\r\n                    The Suns jumped out to a 68-54 lead at halftime. Booker had 19 points and Bridges added 17 after hitting all five of his 3-pointers. Chris Paul had 14 assists, which tied a franchise record for the most in a half. Jokic led the Nuggets with 16 points.\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: F Michael Porter Jr. played for the first time since Dec. 29 after missing 10 games while in the league's COVID-19 health and safety protocols. He finished with seven points and six rebounds in 20 minutes.\n\n\r\n                    “It felt good to be back out there,” Porter said. “Not trying to force anything and mesh with the team. Get my feet back under me and it was good to get a win.\"\n\n\r\n                    Suns: F/C Damian Jones and F Dario Saric both missed the game because of the league's health and safety protocols ... The Suns were playing their third game after having three straight games postponed because of COVID-19 issues. It was the first home game for the Suns since Jan. 6. ... Abdel Nader added nine points off the bench. He was part of the trade with Oklahoma City that brought Paul to Phoenix.\n\n\r\n                    UP NEXT\n\n\r\n                    The Suns and Nuggets play again in Phoenix on Saturday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997764.998473
}