{
  "game_id": "0021801030",
  "espn_id": "401071703",
  "date": "Mar 15, 2019",
  "matchup": "PHX @ HOU",
  "headline": "Harden's 41 points lead Rockets over Suns 108-102",
  "body": "HOUSTON --  After the Houston Rockets fought until the end to get a win against the last-place Phoenix Suns on Friday night, coach Mike D'Antoni criticized his team's attention to detail with the postseason approaching.\n\n\"It's been about five games now where our focus is not where it should be,\" he said. \"And we need to start getting (focused) in so that one, we can finish well to give us a better chance in the playoffs. And then once the playoffs come, you can't just ... turn the switch on. ... Right now, we're not razor sharp.\"\n\nJames Harden had 41 points, 11 assists and nine rebounds, and the Rockets outlasted the Suns to get a 108-102 victory.\n\nThe Rockets had trouble putting away the Suns, who have won just 16 games this season, and trailed for much of the night as they struggled from long-range, making just 11 of 40 3-pointers.\n\n\"We've just got to be more consistent with demanding stops,\" Harden said. \"We do it when we need to, but we need to do it throughout the course of a game. Then, that will take our game to another level.\"\n\nIt's Houston's franchise-record 10th straight win over the Suns, and the Rockets have won 10 of their last 11 games overall.\n\nThey were up by two after two free throws by Harden with about four minutes to go. He hit his head on the court after being knocked down on a hard foul by Deandre Ayton about 90 seconds after that, but got up and made two more free throws.\n\nMikal Bridges missed a 3 for the Suns and Harden added a jumper on the other end to make it 102-96 with about two minutes remaining.\n\nBut Devin Booker made the next four points to get Phoenix within two points at 102-100 about a minute later.\n\nDanuel House padded the lead with a 3-pointer after that, but Booker made a jump shot to cut it to 105-102.\n\nA turnover by Harden gave the Suns the ball back. But Josh Jackson missed two free throws with 24.6 seconds left and Harden made one of two free throws with 11.1 seconds remaining to make it 106-102.\n\nBooker missed a 3 and Harden made two more free throws to secure the victory.\n\nBooker had 29 points for the Suns, who lost their second in a row.\n\n\"We couldn't really close the game,\" Suns coach Igor Kokoskov said. \"We lost the game in the last couple of minutes and the last couple of possessions.\"\n\nEric Gordon added 19 points and House tied a season high with 18 for the Rockets on a night Chris Paul sat out to rest.\n\nThe Suns led by 2 to start the fourth and had a 3-point lead with about nine minutes left when Gordon made 3-pointers on consecutive possessions to put Houston up 92-89. Gordon had missed six of seven 3-point attempts before making those shots.\n\nPhoenix made the next four points, with a 3 from Josh Jackson, to regain the lead before a 3 by Harden put Houston up 95-93 midway through the quarter.\n\nThe game was tied at 71 with about five minutes left in the third before Houston used a 5-2 run, capped by a 3 from Harden, to take a 76-73 lead. But Phoenix used a 5-2 spurt after that, highlighted by a soaring dunk from Richaun Holmes, to tie it back up a couple of minutes later.\n\nA 7-2 run by the Suns later in the third put them on top 85-82. Kelly Oubre Jr. had a 3-pointer in that stretch and Holmes scored the other four points.\n\nKenneth Faried made one of two free throws after that cut the lead to 2 entering the fourth quarter.\n\nTIP-INS\n\nSuns: Tyler Johnson sat out with a sore right knee. ... Holmes looked to have injured an ankle in a collision with Harden with about 9 1/2 minutes left and didn't return. ... Oubre had 22 points. ... Ayton had 17 points and 14 rebounds.\n\nRockets: The Rockets had 11 3-pointers to give them at least 10 in 42 straight games, which is the second-longest streak in NBA history behind their 55-game streak last season. ... Harden had six steals and three blocked shots.\n\nIN THE HOUSE\n\nThe Rockets were impressed by the performance of House, who played his first game since Jan. 14 after spending the last two months in the G-League.\n\n\"He's perfect for our system,\" Harden said. \"He's very skilled and athletic and can do a variety of things on the basketball court.\"\n\nUP NEXT\n\nSuns: Visit New Orleans on Saturday.\n\nRockets: Host Minnesota on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995051.196662
}