{
  "game_id": "0022400347",
  "espn_id": "401704913",
  "date": "Dec 08, 2024",
  "matchup": "CHI vs. PHI",
  "headline": "Embiid scores 31 in his return, Maxey has his first triple-double, Sixers beat Bulls 108-100",
  "body": "CHICAGO -- — Joel Embiid had 31 points and 12 rebounds in his return, Tyrese Maxey got his first career triple-double and the Philadelphia 76ers held on to beat the Chicago Bulls 108-100 on Sunday.\n\n\r\n              Maxey finished with 25 points, 14 assists and 11 rebounds. Paul George and Kelly Oubre Jr. each scored 12 as the Sixers won for the fourth time in five games.\n\n\r\n              Zach LaVine led Chicago with 30 points, and Nikola Vucevic and Coby White each had 13 in the Bulls' second straight loss.\n\n\r\n              Playing in just his fifth game this season, the 7-foot-0 Embiid started slowly, missing his first seven shots. Then, the two-time NBA scoring champion connected on eight of his next 10 in the second quarter for his first 19 points and powered the Sixers to a 62-50 halftime lead.\n\n\r\n              Embiid has missed the last seven games because of knee injuries and a three-game suspension for pushing a sports columnist.\n\n\r\n              Philadelphia opened a 19-point lead in third quarter before the Bulls narrowed it on a 13-1 run. Chicago closed to within four points twice in the fourth.\n\n\r\n              Takeaways\r\n              76ers: Wearing a brace on his surgically repaired left knee, Embiid moved deliberately early in the game. The 2023 MVP then started clicking, along with Maxey and George, as the Sixers scored 39 points in the second quarter. The All-Star trio entered having played only one game together this season.\n\n\r\n              Bulls: Led 33-23 after one quarter as they shot 52.2% from the floor. Then they went cold in the second, scoring 17 points on 25% shooting, before coming on again late.\n\n\r\n              Key moment\r\n              The Sixers went on a 16-0 run in the second quarter to take the lead for good.\n\n\r\n              Key stat\r\n              Embiid played 32 minutes, 53 seconds.\n\n\r\n              Up next\r\n              The 76ers play at Indiana on Friday. The Bulls host Charlotte on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997089.6886709
}