{
  "game_id": "0022400920",
  "espn_id": "401705486",
  "date": "Mar 09, 2025",
  "matchup": "OKC vs. DEN",
  "headline": "Gilgeous-Alexander scores 40 as Thunder top Nuggets 127-103 in matchup of West leaders",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 40 points and the Oklahoma City Thunder defeated the Denver Nuggets 127-103 on Sunday in a matchup between the top two teams in the Western Conference.\n\n\r\n              Gilgeous-Alexander had eight assists and made all eight of his free throws for the West-leading Thunder, who won their seventh straight game and improved to 53-11. Jalen Williams added 26 points, nine rebounds and eight assists.\n\n\r\n              Denver's Nikola Jokic, who along with Gilgeous-Alexander is a top contender in the NBA MVP race, had 24 points, 13 rebounds and nine assists. He was coming off the league’s first 30-20-20 triple-double in his team's 149-141 overtime victory over the Phoenix Suns on Friday night.\n\n\r\n              Michael Porter Jr. had 24 points and 15 rebounds for the Nuggets.\n\n\r\n              Denver went up 10-0 early as it took the Thunder nearly three minutes to score, but Oklahoma City cut its deficit to 29-28 by the end of the quarter.\n\n\r\n              The Thunder led 61-60 at halftime and took an 86-83 lead into the fourth quarter.\n\n\r\n              In a key sequence, Oklahoma City’s Aaron Wiggins stole the ball from Denver's Russell Westbrook, then Chet Holmgren dunked at the other end to give the Thunder a 98-91 lead with just under nine minutes remaining. Denver coach Michael Malone was called for a technical foul, and Williams made the free throw. Oklahoma City controlled the game from there.\n\n\r\n              Takeaways\r\n              Nuggets: Jokic, normally the bully on the court, seemingly got frustrated with Oklahoma's 7-footers, Holmgren and Isaiah Hartenstein. He put up numbers but wasn't as dominant or smooth as he often is.\n\n\r\n              Thunder: Oklahoma City played at full strength after resting its key players, including Gilgeous-Alexander, during Friday's win against Portland.\n\n\r\n              Key mo\r\n              ment\r\n              Williams stole the ball from Jokic to spark a fast break. Oklahoma City's Lu Dort went up for a one-handed dunk that would have ignited the crowd, but he missed. Williams collected the rebound, then found Dort open in the corner. Dort knocked down a 3 that put the Thunder ahead 112-99 with just over four minutes remaining.\n\n\r\n              Key stat\r\n              The Thunder committed just five turnovers.\n\n\r\n              Up next\r\n              The teams meet again Monday night in Oklahoma City.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997668.7940018
}