{
  "game_id": "0022000757",
  "espn_id": "401307547",
  "date": "Apr 04, 2021",
  "matchup": "CHA @ BOS",
  "headline": "Tatum's 22, 3-pointers lift Celtics over Hornets, 116-86",
  "body": "BOSTON -- — Jayson Tatum had 22 points and eight rebounds, and the Boston Celtics blew past the short-handed Charlotte Hornets 116-86 on Sunday. \n\n\r\n                    Evan Fournier had four 3-pointers and 17 points. Robert Williams finished with 16 points and eight rebounds to help Boston post its second straight victory. \n\n\r\n                    The Celtics trailed by nine in the first quarter before taking command in the third, outscoring the Hornets 40-27 for a 28-point lead. Boston made 21 3-pointers. \n\n\r\n                    \"The last two games, moving the ball has been good,\" coach Brad Stevens said. “Hopefully we can play defense like we did tonight more often.\"\n\n\r\n                    Williams said he thinks a big part of their recent success defensively is simply that they are trusting each other more on that end of the floor. \n\n\r\n                    “I feel like this is a big win obviously keeping the pace we’re on, keeping it rolling,\" Williams said. \"But we’ve got to have a lot more wins to get where we want to be.” \n\n\r\n                    Terry Rozier led Charlotte with 22 points and seven assists. Devonte’ Graham added 11 points. The 30-point loss is the Hornets’ worst of the season. The Hornets (25-24) began the night in fourth place in the Eastern Conference, but with only a 1 1/2 game lead over the Celtics (25-25) in eighth. Boston's win dropped the Hornets to fifth and the margin between them to a a half-game. \n\n\r\n                    Charlotte was without three of its top scorers. LaMelo Ball (fractured right wrist) and Malik Monk (sprained right ankle) were joined by Gordon Hayward on the injured list Friday after he sprained his right foot during a win at Indiana.\n\n\r\n                    The Hornets are 5-3 since Ball’s injury on March 20 but have lost two of their last three, with two games left on a six-game trip. \n\n\r\n                    Hayward’s injury derailed his first chance to play against his former club Sunday after he declined a player option with the Celtics last offseason and was dealt to the Hornets, ending his disjointed three-year stint in Boston. \n\n\r\n                    Charlotte led 18-9 in the first quarter but couldn’t keep up with Boston’s outside shooting. The Celtics outscored the Hornets 33-17 in the second quarter and were 10 for 27 from 3-point range in the first half. Charlotte made just 4 of 13 attempts from beyond the arc and had nine turnovers leading to eight Boston points. \n\n\r\n                    Hornets coach James Borrego acknowledged before the game that the injuries would require his team to collectively find new ways to score, saying they couldn’t rely too heavily on Rozier or Graham. \n\n\r\n                    While Charlotte did a decent job of spreading the ball around, it relied too heavily on outside shots that weren’t falling. \n\n\r\n                    For the night, the Hornets shot just 40% from the field (32 of 80) and were 10 of 31 beyond the arc. \n\n\r\n                    “We’ve got to find some rhythm offensively. It’s just gonna take some time.,\" Borrego said. \"We’re a work in progress. This is a great challenge for us. But we move forward.” \n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Had 17 turnovers, leading to 15 Boston points. ... Bench was outscored 37-34.\n\n\r\n                    Celtics: Tatum splashed a 3-pointer to beat the horn to end the third quarter. Smart beat the second-quarter buzzer with a corner 3 to end the first half and sent Boston to the locker room with a 58-43 lead. ... Romeo Langford made his season debut after having surgery to repair a ligament in his right wrist during the preseason. He played 12 minutes, scored three points and had a block, rebound and an assist. Coach Brad Stevens said he expects his minutes to slowly be ramped up over the next few weeks. ... Semi Ojeleye (left side strain) and Tristan Thompson (post health and safety protocols reconditioning) were both out. \n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: At Oklahoma City on Wednesday. \n\n\r\n                    Celtics: Host 76ers on Tuesday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997356.381407
}