{
  "game_id": "0022200525",
  "espn_id": "401468680",
  "date": "Dec 29, 2022",
  "matchup": "LAC @ BOS",
  "headline": "Tatum, Brown score 29 each and Celtics beat Clippers 116-110",
  "body": "BOSTON -- — Even from atop the NBA standings, the Boston Celtics remember the losses.\n\n\r\n              Three weeks after absorbing their worst one of the season in Los Angeles, the Celtics turned back the Clippers in Boston 116-110 on Thursday night, getting 29 points apiece from Jaylen Brown and Jayson Tatum. \n\n\r\n              “We definitely wanted to play better than we played last time,” Brown said. “Those guys beat us up pretty bad in L.A. So we wanted to change the narrative tonight on our home floor and come out and get a win.”\n\n\r\n              The Celtics (26-10) have the league's best record, but things didn't go so well on a West Coast road trip earlier this month. After losing to the Warriors in an NBA Finals rematch, Boston went down to Los Angeles and got pummeled by the Clippers. \n\n\r\n              The 113-93 defeat was their biggest of the season, and it was the first time this year they were held under 100 points. The back-to-back losses also kicked off a slump in which they lost five of six; they are 25-5 over the rest of the season.\n\n\r\n              “None of us enjoyed what happened in L.A.,” said assistant coach Damon Stoudamire, who was filling in for interim coach Joe Mazzulla while he recovers from a corneal abrasion. “We’re all very prideful. So I knew they were going to come back and have an edge to them.”\n\n\r\n              Tatum grabbed 11 rebounds, Marcus Smart had 17 points and nine assists, and Grant Williams added 11 points and 10 boards for Boston, which won its fourth straight game. Derrick White scored 15 points and had two blocked shots, one of them on Paul George's attempted layup with 33 seconds left and Boston leading by three. \n\n\r\n              Brown hit two free throws down the stretch and Tatum made one to ice it. \n\n\r\n              Kawhi Leonard scored 26 for the Clippers, George had 24 points and Ivica Zubac had 13 points and 11 rebounds. Los Angeles had won four of its last five games, sweeping a back-to-back against Detroit and Toronto earlier this week.\n\n\r\n              Boston led 112-102 with under 3 minutes left before the Clippers scored eight of the next nine points, making it 113-110 on Leonard’s pullup jumper in the lane with about a minute left.\n\n\r\n              But White came from the weak side to block George the next time down, and then Brown and Tatum each grabbed an offensive rebound to run out most of the last 30 seconds. \n\n\r\n              The Celtics (26-10) opened their seven-game homestand with three straight losses but won their last four to retain the best record in the league. \n\n\r\n              “Losing three games in a row, it was humbling,” Stoudamire said. “And I think that we knew we had to have better performance the next few games. The guys responded.” \n\n\r\n              Boston led by as many as 13 in the second quarter and 11 at the half, but Reggie Jackson and George hit back-to-back 3-pointers to open the third. The Celtics led 67-62 when Marcus Morris Sr. sank a 3, and then Zubac made a turnaround hook shot in the lane to tie it. \n\n\r\n              By the end of the quarter, the Clippers led 85-84. \n\n\r\n              SHOOTING\n\n\r\n              With his first 3-pointer of the night, Tatum moved ahead of Antoine Walker and into second on the Celtics’ career list. Tatum finished with three in the game and now has (941) in his career. Paul Pierce is first, with 1,823.\n\n\r\n              Brown was 0 for 8 from 3 point range. \n\n\r\n              SUBBING IN\n\n\r\n              Mazzulla missed his second straight game with a corneal abrasion that he sustained during a pickup game. Stoudamire, who also filled in for Tuesday’s victory over the Rockets, said Mazzulla is expected back when the road trip begins on Sunday.\n\n\r\n              “Coach undefeated,” Smart said when he passed Stoudamire in the interview room.\n\n\r\n              UP NEXT \n\n\r\n              Clippers: Wrap up a five-game road trip on Saturday in Indiana. \n\n\r\n              Celtics: Begin a four-game road trip at Denver on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994976.0495949
}