{
  "game_id": "0022400936",
  "espn_id": "401705502",
  "date": "Mar 10, 2025",
  "matchup": "OKC vs. DEN",
  "headline": "Jokic has 35 points and 18 rebounds to lead Nuggets past West-leading Thunder 140-127",
  "body": "OKLAHOMA CITY -- — Nikola Jokic had 35 points, 18 rebounds and eight assists, and the Denver Nuggets beat the Oklahoma City Thunder 140-127 on Monday night.\n\n\r\n              Jamal Murray scored 34 points for the Nuggets, who lost 127-103 in Oklahoma City on Sunday.\n\n\r\n              Shai Gilgeous-Alexander, the NBA's leading scorer and a top contender for league MVP with Jokic, finished with 25 points for the Thunder. He scored 40 the day before.\n\n\r\n              Lu Dort had a season-high 26 points and made eight 3-pointers and Isaiah Hartenstein scored 20 points for Oklahoma City. The loss snapped a seven-game win streak for the Thunder, who have the best record in the Western Conference and are vying with Cleveland for the top record in the league.\n\n\r\n              The season series ends tied at 2-all, with the teams splitting the games at each venue.\n\n\r\n              The Thunder led 73-67 at halftime behind 16 points from Hartenstein and 15 from Gilgeous-Alexander. But Thunder All-Star Jalen Williams left the game in the second quarter with a right hip strain and did not return. He had 12 points and six assists in 14 minutes.\n\n\r\n              Denver took advantage and led 101-99 at the end of the third quarter.\n\n\r\n              The Nuggets dominated the fourth quarter, much the way the Thunder did the previous day. Murray hit a 3-pointer that gave Denver a 109-101 lead with just over 10 minutes remaining, and the Nuggets cruised from there.\n\n\r\n              Takeaways\r\n              Nuggets: Denver showed its grit by bouncing back against a younger, deeper team on the second half of a back-to-back.\n\n\r\n              Thunder: Oklahoma City wasn't nearly as fluid in the second half without Williams. The Thunder will need him to recover quickly if they want a shot at the overall top seed.\n\n\r\n              Key mo\r\n              ment\r\n              \r\n              Russell Westbrook and Peyton Watson made back-to-back 3-pointers to give the Nuggets a 125-111 lead with just under seven minutes remaining.\n\n\r\n              Key stat\r\n              Jokic made 15 of 20 field goals.\n\n\r\n              Up next\r\n              Nuggets host Minnesota on Wednesday, and Thunder visit Boston.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997667.447202
}