{
  "game_id": "0022300775",
  "espn_id": "401585403",
  "date": "Feb 13, 2024",
  "matchup": "MIN @ POR",
  "headline": "Edwards has 41 and the Timberwolves win the first of 2 against the Blazers 121-109",
  "body": "PORTLAND, Ore. -- — Anthony Edwards didn't think he could play against the Trail Blazers. Then he scored 41 points. \n\n\r\n              Edwards shook off the right knee soreness that he felt going into Tuesday night's game at Portland and helped lead the Minnesota Timberwolves to a 121-109 victory. \n\n\r\n              “At the last second I was like, 'I'm going to try it out,' because I wasn't going to go tonight,” Edwards said. “But like I said, at the last second I was 'I'm gonna try it out, see how I feel,' and it felt good.”\n\n\r\n              Rudy Gobert added 16 points and 15 rebounds for his sixth straight double-double. Karl-Anthony Towns, who had foul trouble early, finished with 13 points for the Western Conference-leading Timberwolves. \n\n\r\n              Deandre Ayton had 22 points and 16 rebounds for the Blazers, who lost their fifth straight. Portland hosts Minnesota again on Thursday night. \n\n\r\n              The Timberwolves built a 14-point first-half lead, but the Blazers whittled away at it, coming within 62-60 in the third quarter before Edwards' 3-pointer capped a 10-2 run that stretched Minnesota's lead to 72-62. \n\n\r\n              Jerami Grant's 3-pointer tied it at 73 but Minnesota led 84-83 going into the final period. Portland briefly took a narrow lead early in the fourth on free throws when Scoot Henderson was fouled on a 3-point attempt, but Minnesota reestablished control. \n\n\r\n              Nickeil Alexander-Walker's 3-pointer, his fourth of the quarter, stretched the Timberwolves' lead to 102-90 with 6:42 to go. Minnesota went on to lead by as many as 20 points. Alexander-Walker finished with 18 points off the bench. \n\n\r\n              “I thought we played well for the most part. First quarter, just had too many turnovers,\" Blazers coach Chauncey Billups said. \"I thought that hurt us early. But for the most part we did what we wanted to try to do in the game and made it a game most of the way, and then it got away from us in the fourth quarter, obviously.\"\n\n\r\n              The Timberwolves were playing the second of a back-to-back after a 121-100 victory at the Clippers on Monday night. \n\n\r\n              The Blazers, who are rebuilding following the offseason departure of Damian Lillard, have struggled with minor injuries. Starting guard Anfernee Simons returned against the Timberwolves after missing a game with a left ankle sprain. \n\n\r\n              Henderson also was available after missing two games with a left foot injury. Duop Reath was back after a two-game absence with right knee tendinitis. But Malcolm Brogdon remained sidelined by right elbow tendinitis.\n\n\r\n              Edwards had 18 points in the first quarter alone as Minnesota built a 37-25 lead. But Towns picked up his third foul with 1:43 left in the quarter and went to the bench.\n\n\r\n              Simons' 3-pointer closed the gap to 46-40 midway through the second quarter but Minnesota held a 59-51 lead at the half. \n\n\r\n              It was Edwards’ 20th game this season with at least 30 points. It was his second game with 40 or more. His season high is 44. \n\n\r\n              “Once he gets hot, there’ s no getting him off the floor, really,” Timberwolves coach Chris Finch said.\n\n\r\n              UP NEXT\n\n\r\n              The Trail Blazers host the Timberwolves again on Thursday night, wrapping up a five-game Minnesota road trip. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996466.1825411
}