{
  "game_id": "0021600997",
  "espn_id": "400900392",
  "date": "Mar 13, 2017",
  "matchup": "ORL @ SAC",
  "headline": "Kings beat Magic 120-115 to snap eight-game losing streak",
  "body": "SACRAMENTO, Calif. -- After squandering several big leads in the past week, the Sacramento Kings were pleased to finally play well down the stretch.\nDarren Collison had 19 points and 13 assists, reserve Anthony Tolliver also scored 19 points and the Kings beat the Orlando Magic 120-115 on Monday night to snap an eight-game losing streak.\nLast week, Sacramento led by 28 points before a second-half collapse led to a loss in San Antonio. Two nights later the Kings led by 15 points heading into the fourth quarter before falling to Washington in overtime.\n\"It was great to get a win in the fashion we got it tonight by closing out the game,\" said Garrett Temple, one of seven players in double figures.\nTolliver scored five straight points in the closing minutes and had eight in the fourth to help the Kings improve to 2-8 since trading DeMarcus Cousins during the All-Star break. The eight-game losing streak was the longest for the Kings since the 2014-15 season.\n\"He got some good looks tonight and started to feel it,\" Kings coach Dave Joerger said of Tolliver. \"We tell him his green light is very green. We want him taking shots.\"\nThe Kings had one of their best games from beyond the arc, going 16 of 30. The Kings made four 3-pointers late in the third quarter, outscoring the Magic 35-26 in the period to take a 93-84 lead into the fourth.\n\"We talked about how they had been shooting 3s well since the (All-Star) break,\" said Elfrid Payton, who had 13 points, 13 assists and 10 rebounds for his third triple-double of the season. \"We got out of our rhythm in the third quarter and they made some 3s to build the lead.\"\nNikola Vucevic had 23 points and nine rebounds for the Magic, who dropped their third straight game. Evan Fournier made four 3-pointers and scored 21 points, and Aaron Gordon had 17.\nThe Magic have been in a major tailspin since owning a 15-18 record on Dec. 26. They have dropped 26 of 36 since and own the second-worst record in the Eastern Conference.\n\"We're giving up the 3-point line right now. The last three games we've allowed a high number of 3s going up,\" Orlando coach Frank Vogel said. \"We have to get that under control and tonight transition defense was really hurting us.\"\nWillie Cauley-Stein had 18 points for the Kings and rookie Buddy Hield had 17.\nThe Kings were in the playoff hunt before trading Cousins. Now postseason hopes are a distant memory with Sacramento 5 1/2 games in back of eighth-place Denver.\nCauley-Stein had a dunk to break a tie and Tolliver followed with another one, but Gordon responded with a 3-pointer to pull the Magic to 113-112. Tolliver's 3-pointer gave the Kings a four-point cushion with 43 seconds left.\nTIP-INS\nMagic: The NBA's worst 3-point shooting team was 3 of 14 in the first half, but finished 13 of 34 ... Orlando is 12-22 on the road.\nKings: Veterans Kosta Koufos and Ty Lawson had \"planned rest\" nights and Tyreke Evans missed the game with a sore left ankle. ... Collison and McLemore each had four-point plays in the second half.\nCLUTCH COLLISON\nA veteran point guard, Collison has had to adjust since the departure of Cousins. Accustomed to having the All-Star post player as the focus of the offense, the Kings now lack a major scoring threat. Sacramento has only had three 20-plus scoring games since Cousins departed.\nThe 13 assists were a season high for Collison, who made a pair of 3s and hit all seven free-throw attempts.\n\"I thought Darren Collison played a heck of a floor game. Not just scoring, but setting up Willie on some rim runs and finding guys on the open 3s,\" Joerger said.\nUP NEXT\nMagic: Get a few days' rest before playing at Golden State on Thursday.\nKings: Start three-game road trip Wednesday against Phoenix.",
  "source": "espn_api",
  "crawled_at": 1764995821.696154
}