{
  "game_id": "0021601053",
  "espn_id": "400900448",
  "date": "Mar 21, 2017",
  "matchup": "PHX @ MIA",
  "headline": "Hassan Whiteside sets Heat single-season rebound record, then exits with cut",
  "body": "MIAMI -- Hassan Whiteside was enjoying a record-setting night.\nBy the end, none of that mattered.\nWhiteside needed 13 stitches postgame to close a cut in his right hand, overshadowing his 23-point, 14-rebound performance that helped the Miami Heat beat the Phoenix Suns 112-97 on Tuesday.\nThe win put Miami back in a playoff spot. Those postseason hopes might hinge on how soon Whiteside can play again.\n\"Obviously, he's our centerpiece,\" said Miami's Willie Reed, who likely would become the starting center if Whiteside misses games -- which seems like a certainty. \"He's our shot-blocker, he's our rebounder, he's one of our key players.\"\nThe cut is between Whiteside's middle and ring fingers, the team said. That means it's in essentially the same spot as a cut that needed 10 stitches to repair two seasons ago, an injury that kept him out for three games.\n\"It's in the awkward place in his hand,\" Heat coach Erik Spoelstra said. \"I know everybody will be thinking, 'Oh, is this the same, is it worse, how do you compare it to two years ago?' We'll see.\"\nWhiteside now has 936 rebounds in 66 games this season, two more than Rony Seikaly had in 79 games in 1991-92.\nWhiteside was hurt with 2:08 left and the Heat leading by 24, when his hand got caught in the foam attached to the bottom of the backboard. He let out a loud scream and headed to the locker room.\nTyler Johnson had 17 points for the Heat (35-36), who had seven players score in double figures. Goran Dragic scored 16, Josh Richardson had 14 and Reed added 12 for Miami.\nMarquese Chriss scored 24 for Phoenix (22-49), which lost its fifth straight game and used only an eight-player rotation until the final minutes. Leandro Barbosa scored 13, Alex Len had 12 points and 11 rebounds, and TJ Warren scored 12 for the Suns.\n\"Our rotation is short,\" Suns coach Earl Watson said. \"Our guys come out there and fight hard.\"\nThe win, combined with Detroit's loss in Brooklyn and Milwaukee's win in Portland, saw Miami end the night No. 8 in the East. Miami is a half-game behind No. 7 Milwaukee and a game up on No. 9 Detroit -- but now, after playing again Tuesday without Dion Waiters (sprained ankle), it might be down another starter with Whiteside hurt.\n\"Hopefully, he's going to be OK,\" Dragic said.\nTIP-INS\nSuns: Phoenix listed rest as the reason for sitting Brandon Knight, Eric Bledsoe and Tyson Chandler. Knight -- a native of nearby Fort Lauderdale -- also missed Phoenix's game in Miami last season. ... Barbosa returned after missing two games with an illness. ... The Suns' starting frontcourt outscored Miami's 23-2 in the game's first 18 minutes.\nHeat: Dragic was fouled while attempting 3-pointer for the 24th time this season. He has yet to record a four-point play. ... Johnson had three first-quarter baskets in March and then made five in a five-minute stretch of the first quarter on Tuesday. ... The Heat are 14-15 this season against the West. They can finish .500 against the league's other side with a win over Denver on April 2.\nMORE WHITESIDE\nWhiteside now has 57 double-digit rebound games this season, a Heat record -- one more than Seikaly in 1991-92. Whiteside also extended his franchise records for consecutive double-digit rebound games (17) and consecutive double-doubles (13). His 49th double-double of the season is four shy of Seikaly's record in that department, also in 1991-92.\nSETTING SUNS\nThe loss was Phoenix's 49th of the season. The Suns are one defeat away from consecutive 50-loss seasons, something the franchise hasn't endured since the 1973-74 and 1974-75 campaigns.\nUP NEXT\nSuns: Visit Brooklyn on Thursday, the third game of a six-game trip.\nHeat: Host Toronto on Thursday, the finale of a five-game homestand.",
  "source": "espn_api",
  "crawled_at": 1764995949.301676
}