{
  "game_id": "401810108",
  "espn_id": "401810108",
  "date": "Nov 18, 2025",
  "matchup": "LAL vs UTAH",
  "headline": "LeBron James makes historic season debut, Luka Doncic scores 37 in Lakers' 140-126 win over Jazz",
  "body": "LOS ANGELES -- — LeBron James had 11 points and 12 assists in the first game of his unprecedented 23rd NBA season, and Luka Doncic had 37 points and 10 assists in the Los Angeles Lakers' 140-126 victory over the Utah Jazz on Tuesday night.\n\n\r\n              The 40-year-old James made his season debut in the Lakers' starting lineup and played 30 minutes after missing training camp and their first 14 games due to sciatica. Vince Carter is the only other player in NBA history to participate in 22 seasons, but James passed him while opening the next chapter of a pro career that began in 2003.\n\n\r\n              James didn't take long to find the flow: He put on a playmaking clinic in the second half, and Doncic scored 17 points in the third quarter while the Lakers pulled away from Utah.\n\n\r\n              Austin Reaves added 26 points as the Lakers improved to 11-4 with their third straight victory.\n\n\r\n              Keyonte George, who was born 10 days after James’ NBA debut, matched his season high with 33 points for the Jazz two nights after hitting the winning 3-pointer in a double-overtime thriller against Chicago.\n\n\r\n              Lauri Markkanen had 31 points for Utah, which has lost five of seven.\n\n\r\n              James didn't score in his first 11 minutes on the court, but his two 3-pointers in the first half moved him past Reggie Miller for the sixth-most in NBA history.\n\n\r\n              James made a driving layup in the third quarter to extend his streak of double-digit scoring performances to a record 1,293 games — every game in which he has played since Jan. 6, 2007. The four-time NBA champion didn't score again, but the Lakers moved comfortably ahead.\n\n\r\n              George scored 23 points and Markkanen had 22 in Utah's 71-point first half. The Lakers took charge after halftime, closing the third on a 21-5 run.\n\n\r\n              Bronny James played the final 3:33 and hit a 3-pointer.\n\n\r\n              Up next\r\n              Jazz: Host Thunder on Friday.\n\n\r\n              Lakers: At Jazz on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042651.031543
}