{
  "game_id": "0021600912",
  "espn_id": "400900307",
  "date": "Mar 03, 2017",
  "matchup": "MIL vs. LAC",
  "headline": "Bucks use strong start, finish to beat Clippers 112-101",
  "body": "MILWAUKEE --  The Milwaukee Bucks can beat any team in the NBA when they keep the ball moving, even a star-studded playoff contender like the Los Angeles Clippers.\n\nGiannis Antetokounmpo had 24 points and eight assists, and the Bucks finished strong after nearly squandering an early 23-point lead in in a 112-101 victory over the turnover-prone Clippers on Friday night.\n\nAntetokounmpo was one of three Bucks with at least eight assists. Milwaukee tried to beat the Clippers down the floor in transition and made the extra pass in halfcourt sets in accumulating 35 assists on 44 baskets.\n\n\"When the ball is moving like that and you've got that many assists, it's some good shots,\" said center Greg Monroe, who also had 24 points on 11-of-15 shooting.\n\nCrisp passing, opportunistic defense and the Clippers' sloppy play allowed the Bucks to persevere in spite of watching their early edge dwindle to 77-74 late in the third quarter following four 3s in the period by Chris Paul. He finished with 21 points, five assists and four turnovers.\n\nThe Bucks reasserted control with a 15-2 run for a 92-76 lead with about 9 minutes left, capped by Antetokounmpo's driving dunk past Blake Griffin, and Jason Terry's open 3 from the corner.\n\nMilwaukee also used a 20-2 run over the final 4:33 of the first quarter to open a 19-point lead at halftime.\n\nFighting to stay in the playoff picture, the Bucks played with a sense of urgency that was missing in a lackluster home loss to Denver on Wednesday night. Guard Malcolm Brogdon said coach Jason Kidd drove home the point in part by making the team run a lot in practice on Thursday.\n\n\"I thought their intent, their energy, their focus and the carry-over to tonight was very good,\" Kidd said.\n\nMistakes crippled the Clippers throughout the night. Los Angeles had a season-high 23 turnovers, including 16 in the first half.\n\n\"We gave a young team confidence by turning it over,\" coach Doc Rivers said.\n\nTHIRD WATCH\n\nThe Clippers at least played well in the third quarter, with Paul nearly singlehandedly bringing his team all the way back from the early hole. The Clippers star hit all four of his 3-point attempts in the period.\n\nThe Bucks controlled the rest of the game, outhustling the Clippers for rebounds and shots in the lane.\n\n\"The way we just started the game and they jumped on us, that hurt us,\" Rivers said.\n\nPaul and Griffin each had 21 points to lead the Clippers, while Jordan finished with 14 points and 10 rebounds.\n\nPAUL'S THUMB\n\nA sore left thumb forced Paul to the bench briefly after his fourth 3 of the third quarter to draw his team within three. The Bucks went on their late run with Paul out of the lineup.\n\nPaul returned on Feb. 24 after missing 14 games with a torn ligament in the left thumb.\n\n\"I knew it was going to hurt one of these days whenever I got hit in it. So I got hit in it good but I'm cool. No, I wasn't worried,\" Paul said.\n\nSTAT LINES\n\nThe Clippers lost despite shooting 56 percent from the field. The Bucks had 11 steals and shot 55 percent while committing 10 turnovers, four less than their season average.\n\n\"I thought deflections and steals were high, but the passing was contagious,\" Kidd said.\n\nTIP-INS\n\nClippers: Rivers, who had a decorated college playing career at Marquette, spoke to the Golden Eagles players and coach Steve Wojciechowski earlier Friday at Marquette's practice court about eight blocks from the Bradley Center. ... The Clippers fell to 0-9 on the road when trailing at the half.\n\nBucks: G/F Khris Middleton returned to the starting lineup after coming off the bench in the Bucks' last game on Wednesday. Middleton has been back a month after starting the season rehabbing from a torn hamstring. He finished with 19 points and nine assists in 32 minutes. ... F Michael Beasley is off crutches and riding a stationary bike four days after leaving a loss at Cleveland with a hyperextended left knee. He was due to miss the current three-game homestand, and Kidd said that Beasley would be reevaluated as planned later this weekend.\n\nUP NEXT\n\nClippers: At Chicago on Saturday night.\n\nBucks: Host Toronto on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995154.943722
}