{
  "game_id": "0021400654",
  "espn_id": "400578946",
  "date": "Jan 24, 2015",
  "matchup": "MEM vs. PHI",
  "headline": "Randolph's double-double leads Grizzlies past Sixers 101-83",
  "body": "MEMPHIS, Tenn. --  The experience of the Memphis Grizzlies was just too much for the young Philadelphia 76ers.\n\nZach Randolph had 17 points and 14 rebounds and Jeff Green scored 18 as the Grizzlies coasted to a 101-83 win on Saturday night.\n\n\"They have a bunch of veterans who know how to play the game,\" said Sixers guard Michael Carter-Williams, who had 10 points. \"They're a tough team, and we're a young team.\"\n\nVince Carter added 13 points as the Grizzlies (31-12) won their sixth in the last seven games.\n\nMemphis led by as many as 25 in the second half, allowing coach Dave Joerger to rest his starters in the fourth quarter. Marc Gasol, selected as an All-Star starter, finished with nine points, as did point guard Mike Conley.\n\nJerami Grant from Syracuse, the 39th overall pick in last summer's draft, led the Sixers with a career-high 16 points. The Sixers shot 38 percent for the game and committed 24 turnovers.\n\n\"(That) is a big number,\" said Philadelphia coach Brett Brown, \"especially when we needed those possessions to put some points up.\"\n\nMemphis needed a 41-point fourth quarter to eventually defeat the Sixers 120-115 in overtime on Dec. 13. The return match in Memphis was never really close after the Grizzlies took a double-digit lead early in the second quarter.\n\n\"You have to limit your mistakes because they will capitalize on anything,\" said Sixers center Nerlens Noel, who finished with seven points and six rebounds. \"You have to be real physical back with them. .They've been in this league a long time. They have their little tricks of ways to seal you.\"\n\nBrown challenged his team, playing on the second night of a back-to-back, to win the second half, which the Sixers did, 42-41.\n\n\"We're trying to hold our group together and give our young guys a sense of purpose,\" Brown said of the challenge. \".This is a lesson for them on how to deal with a physical, elite playoff team.\"\n\nFor Memphis, it was a matter of using its experience to dispatch a young team still learning the nuances of the NBA.\n\n\"If our goal is to strive to be all that good and play in June and all those big words that we say,\" Gasol said, \"we have to execute every play, no matter the score, no matter the opponent.\"\n\nTIP-INS:\n\n76ers: Philadelphia was without leading scorer Tony Wroten, who the team announced has a partial ACL tear in his right knee that will require surgery. ...The loss marked the 26th time the 76ers have lost by double digits. .They have lost 16 of 17 road games to the Western Conference. .Coach Brett  Brown was whistled for a technical foul in the third quarter for yelling. But he was yelling at his own player, and once the officials realized the target of his comments, they waived it off.\n\nGrizzlies: Memphis shuffled its lineup for the second straight game, with Courtney Lee returning at starting guard and Tony Allen coming off the bench. .Randolph's double-double was his eighth straight since returning from his knee injury. He also converted his second 3-pointer of the season. .No Memphis starter played more than 28 minutes.\n\nI WASN'T TALKING TO YOU\n\nBrown was whistled for a technical foul in the third quarter for yelling. But he was yelling at his own player, and once the officials realized the actual target of his comments, they waived it off.\n\nGRANT GAINING\n\nBrown praised Grant for his recent play, calling him \"our poster child at the moment. Jerami's work ethic and the fact he's getting minutes is helping him grow as a player.\"\n\nUP NEXT:\n\n76ers: At Pelicans on Monday.\n\nGrizzlies: Host Magic on Monday.",
  "source": "espn_api",
  "crawled_at": 1764992153.9569228
}