{
  "game_id": "0021800602",
  "espn_id": "401071278",
  "date": "Jan 08, 2019",
  "matchup": "TOR vs. ATL",
  "headline": "Ibaka's basket lifts Raptors past Hawks 104-101",
  "body": "TORONTO --  Kawhi Leonard and Kyle Lowry shared the court for the first time in almost a month for Toronto, yet it was Serge Ibaka who scored the biggest basket of the game for the Raptors\n\nIbaka scored the winning points on a dunk with 17 seconds remaining and the Raptors won their sixth straight home game, 104-101 over the Atlanta Hawks on Tuesday night.\n\n\"We pulled one out,\" Raptors coach Nick Nurse said. \"We were trying to get away from them and never really could.\"\n\nLeonard scored 31 points, Pascal Siakam had 13 points and 10 rebounds, and Lowry scored 16 points as the Raptors earned their sixth consecutive win over the Hawks.\n\nOG Anunoby scored 14 points and Ibaka had 13.\n\nLowry and Leonard played together for the first time since a Dec. 9 home loss to Milwaukee. Toronto has not lost at home since. Lowry had missed 10 of the past 14 games because of hip and back injuries, returning Sunday against Indiana. Leonard missed that game to rest.\n\nToronto is 16-6 when Lowry and Leonard both play.\n\nJohn Collins had 21 points and 14 rebounds, Jeremy Lin scored 20 points and Trae Young added 19 for the Hawks, who have lost four of five. Atlanta made a season-worst 27 turnovers, leading to 34 Toronto points.\n\n\"If we keep it under 20, the result is a little different,\" Atlanta's Vince Carter said.\n\nNeither team led by more than five in a tight fourth quarter. Atlanta's Dewayne Dedmon made a pair of foul shots at 2:15 to put the Hawks up 101-98, but Toronto finished the game with a 6-0 run.\n\nAnonuboy's layup with 1:57 remaining cut the gap to one and, after a steal by Leonard, Ibaka's dunk with 17 seconds to go put Toronto up 102-101.\n\nFollowing a timeout, Young drove against Leonard but missed his shot. Ibaka grabbed the rebound that led to a fast break dunk for Anunoby with less than a second to go.\n\n\"You had a rookie going up against probably the best defensive player in the league,\" Hawks coach Lloyd Pierce said. \"He just kind of fell for the bait.\"\n\nCarter, a former star with the Raptors, launched a long 3-point try at the buzzer but came up empty.\n\n\"Tip your hats to the Hawks,\" Lowry said. \"Those guys, they're playing extremely hard.\"\n\nThe banged-up Hawks were without guard Kevin Huerter (back). Guard Kent Bazemore missed his fifth straight game because of a sprained right ankle, while center Miles Plumlee sat for the third straight game because of a sore left ankle. Forward Taurean Prince has not played since Dec. 3 because of a sprained left ankle.\n\n\"I'm personally not a big fan of the moral victories, but with a lot of guys down, guys stepped up and played hard,\" Carter said.\n\nA former slam dunk champion whose career began in Toronto, Carter received a brief standing ovation when he checked in for the first time at 5:13 of the first quarter. He scored six points in 13 minutes.\n\n\"The joy of stepping into this arena each and every year is something I always look forward to,\" Carter said.\n\nMaking his first start of the season in place of Huerter, Lin made all four of his shots and scored 10 points in the first as Atlanta led 31-28 after one.\n\nAfter shooting 0 for 6 from 3-point range in the first, the Raptors shot 6 for 10 from long range in the second. Atlanta led 57-56 at halftime.\n\nLeonard and Lowry each scored eight points in the third and Toronto took an 80-77 lead into the fourth.\n\nTIP-INS\n\nHawks: Atlanta scored 12 points off six Toronto turnovers in the first quarter. ... Carter's mother attended the game.\n\nRaptors: G Danny Green (rest) did not play. Fred VanVleet started in his place. It was Toronto's 14th different starting lineup of the season. Twelve different players have started at least once. ... F C.J. Miles (right hip) was active, but did not play. ... C Jonas Valanciunas has had the splint removed from his dislocated left thumb. Valanciunas was injured Dec. 12 at Golden State. ... Toronto waived G Lorenzo Brown on Monday. G Jordan Loyd was active. Loyd played a G-League game at Philadelphia earlier in the day.\n\nON A ROLL\n\nLeonard scored at least 20 points for the 17th consecutive game, extending his career-best streak.\n\nSTEALING THE SCENE\n\nLeonard's six steals were a season-high, while Lowry matched his season-high with four. In doing so, Lowry became the first player to top 700 with Toronto.\n\nUP NEXT\n\nHawks: Visit Brooklyn on Wednesday night.\n\nRaptors: Host Brooklyn on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994268.636553
}