{
  "game_id": "0021600967",
  "espn_id": "400900362",
  "date": "Mar 10, 2017",
  "matchup": "MIL vs. IND",
  "headline": "Giannis gets 21, Bucks beat Pacers 99-85 to win 5th straight",
  "body": "MILWAUKEE --  John Henson stays ready to play each game, even if he hasn't had many minutes lately.\n\nCoach Jason Kidd finally called Henson's number Friday night, and the Milwaukee  backup center delivered with important contributions off an injury-thinned bench.\n\nStarters Giannis Antetokounmpo and Khris Middleton each scored 21 points, getting help from up and down the lineup, and the Bucks won their season-high fifth straight game by beating the Indiana Pacers 99-85 on Friday night.\n\nHenson added eight points, seven rebounds and four blocks for Milwaukee, which clinched the season series against Indiana. They are two of five teams competing for the final three spots in the Eastern Conference playoff race, so the Bucks secured an important tiebreaker over the Pacers.\n\n\"Just to understand it takes a team, and that what's what we're doing,\" Kidd said about the win streak. \"Giannis is playing a high level, Khris is playing at a high level, but there are a lot of other guys playing at a high level with them.\"\n\nPaul George had 18 points and 11 rebounds for Indiana, which trailed for most of the second half. The Pacers cut it to 79-76 with 8:23 left before the Bucks asserted control with an 8-2 run highlighted by a 3-pointer and floater for Jason Terry.\n\nThe veteran guard pointed to Henson as a key reason for the Bucks' third-quarter surge.\n\n\"Even when we weren't scoring, we were able to get stops, and I think just trusting in our defense carried us through the night,\" Terry said.\n\nThe finish was in sharp contrast to the team's sluggish start.\n\nMilwaukee fell behind 14-3 before Greg Monroe came off the bench to provide stability on both ends of the floor. Monroe had eight points, two rebounds, a steal and a block in the first half to help Milwaukee get to 50-45 at halftime.\n\nJeff Teague finished with 17 points for the Pacers.\n\n\"A couple of times (Antetokounmpo) walked to the basket,\" Pacers coach Nate McMillan said. \"You can't have those breakdowns as we did the second half.\n\nIN THE ZONE\n\nThe Bucks neutralized George with a zone and double teams.\n\n\"All game, all game. I catch the ball, it's two on me,\" George said. \"It was hard to get rhythm. It was hard to get myself into a rhythm. Every time I caught it, I had to move it. It was effective for them.\"\n\nBIG BENCH\n\nLed by Henson, Terry and Monroe (18 points), the Bucks got important contributions off the bench. Henson keyed a defensive resurgence with four boards and two blocks in the third quarter, when the Bucks turned a five-point halftime deficit into a six-point lead by the end of the period.\n\n\"That's what he does, he did that again for us tonight,\" Kidd said about Henson's blocks. \"Being ready, being a pro and John showed that ... when you're name is called, to be ready.\"\n\nNO FLOW\n\nThe Pacers had 10 assists in the first quarter but finished with 15 for the night.\n\n\"Stopped moving. Started turning the ball over,\" McMillan said about the problems on offense. \"You're not moving the ball. You're not knocking down shots.\"\n\nTIP-INS\n\nPacers: Indiana was sixth in the Eastern Conference playoff race entering the night, but just 2 1/2 games ahead of the 10th-place Bucks. The Pacers fell to 0-3 against Milwaukee this season, with just one game left on April 6 in Indiana. \"We're down 0-3 to this team. So now we have to do even more work because it's going to come down to the wire,\" George said.\n\nBucks: Already without Jabari Parker and Michael Beasley because of knee injuries, the Bucks were further depleted with guard Malcolm Brogdon (back) and forward Mirza Teletovic (hamstring) missing the game. Kidd said Brogdon and Teletovic were day to day.\n\nUP NEXT\n\nPacers: Return home on Sunday to face Miami, another playoff hopeful.\n\nBucks: Wrap up a stretch of five of six at home by hosting the Minnesota Timberwolves on Saturday.\n\n---\n\nFollow Genaro Armas at: https://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764995148.4762821
}