{
  "game_id": "0021800969",
  "espn_id": "401071642",
  "date": "Mar 06, 2019",
  "matchup": "CLE @ BKN",
  "headline": "Dinwiddie leads Nets in 4th as they beat Cavs 113-107",
  "body": "NEW YORK --  Locked in a tight game in the fourth quarter, the Brooklyn Nets needed answers quickly.\n\nThat meant Spencer Dinwiddie.\n\n\"He's a speed demon. He's a dragster out there,\" Nets coach Kenny Atkinson said.\n\nDinwiddie scored 12 of his 28 points in the final quarter and Brooklyn zipped by the Cleveland Cavaliers 113-107 on Wednesday night.\n\nAtkinson has been encouraging Dinwiddie, who recently returned after missing 14 games with torn ligaments in his right thumb, to keep pushing the pace.\n\n\"It's hard to keep up with him and keep driving it to the rim,\" Atkinson said. \"So he did those things and I thought it was a game changer for us.\"\n\nD'Angelo Russell added 25 points for the Nets, who put things together in time after some sloppy play across the middle two quarters to win their second consecutive game and keep pace with Detroit for the No. 6 playoff seed in the Eastern Conference.\n\nThis one was far more difficult than their 127-88 rout of Dallas on Monday and nowhere near as wild as their 148-139 triple-overtime victory in Cleveland on Feb. 13. But the Nets needed it however they could get it, knowing they have just two more home games this month, with a seven-game trip sandwiched in between.\n\n\"We just tried to tighten up the screws,\" Dinwiddie said.\n\nKevin Love had 24 points and 16 rebounds for the Cavaliers, who had won four of six since that loss to the Nets in the final game before the All-Star break. David Nwaba added a career-high 22 points.\n\nCleveland outscored Brooklyn 65-49 in the second and third quarters and took an 85-80 lead into the fourth. But Caris LeVert scored nine points in the first 4 1/2 minutes of the period and then Dinwiddie took over from there.\n\n\"We allowed them to speed us up a little bit,\" Cavs coach Larry Drew said.\n\nAfter Cleveland cut it to 96-94, Dinwiddie scored, then threw a long lob pass that Rodions Kurucs dunked to make it 100-94. Joe Harris followed with a 3-pointer, then Dinwiddie ran off seven straight points to cap the Nets' 14-0 burst and make it 110-94 on his drive with 3:26 to play.\n\n\"We needed stops. Teams get going like that -- any team in the league can get going -- it's hard to stop the bleeding without getting stops,\" Russell said.\n\nBrooklyn led 31-20 after one and pushed it to 37-22 with 9:45 remaining in the second when Russell was fouled shooting a 3 and made two of the free throws. But the Cavs charged back with a 22-7 run to knot it at 44, before the Nets regrouped a bit to bring a 55-50 advantage to the locker room.\n\nEight straight points by Love in the third turned Cleveland's six-point deficit into a 66-64 lead, and the Cavs went on to lead by eight in the quarter.\n\nTIP-INS\n\nCavaliers: Collin Sexton made one 3-pointer to tie Kyrie Irving's record for most by a Cavs rookie. Irving hit 73 in 2011-12. ... Larry Nance Jr. had 17 points and 10 rebounds.\n\nNets: Russell finished right at his career average in nine games against the Cavs, his highest against any opponent. ... LeVert scored 14 points. ... Jarrett Allen had 15 points and 11 rebounds.\n\nON LEBRON\n\nDrew said he was excited for LeBron James, who was set to pass Michael Jordan for fourth place on the NBA's career scoring list Wednesday night. James needed 13 points in the Lakers' game against Denver.\n\n\"You know Bron is a special player and I had an opportunity to coach him,\" Drew said. \"I'm really excited and happy to say that having gone through my career I've had an opportunity to coach a lot of great players, including him. I think it's an absolutely phenomenal feat.\"\n\nSUPER SUB\n\nDinwiddie's 14th 20-point game off the bench set a Nets single-season record. Darryl Dawkins, Purvis Short and Orlando Woolridge all had 13.\n\nUP NEXT\n\nCavaliers: Visit the Miami Heat on Friday.\n\nNets: Visit the Atlanta Hawks on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994745.0834281
}