{
  "game_id": "0022101003",
  "espn_id": "401360822",
  "date": "Mar 11, 2022",
  "matchup": "TOR @ PHX",
  "headline": "Gary Trent Jr. scores 42 points, Raptors hold off Suns",
  "body": "PHOENIX -- — The Toronto Raptors missed Fred VanVleet for five games with a knee injury. Now that the All-Star is back, Gary Trent Jr. and the rest of the Raptors feel anything is possible.\n\n\r\n              Trent scored 42 points and the Raptors held off the NBA-leading, but short-handed Phoenix Suns 117-112 on Friday night.\n\n\r\n              Trent was 8 from 11 from 3-point range — one of the misses was a halfcourt heave before halftime — and 13 of 21 from the floor. He fell just short of his career high of 44 points set last season. He also had eight rebounds.\n\n\r\n              “It's great, when Freddie's out there, the player he is, he gets a lot of attention,” Trent said. “Everybody complements each other. It's great to have him back.”\n\n\r\n              Raptors coach Nick Nurse agreed.\n\n\r\n              “I know it's a fairly small sample size here, but he didn't get a whole lot going with Freddie off the floor,” he said. “(With VanVleet) there's better spacing, there's a lot of concentration on Fred. That's what I saw tonight, there was better spacing for Gary to operate.”\n\n\r\n              “He got going and there were times where we just stared at him or we didn't get there,” Suns coach Monty Williams said. “He hit some tough shots.”\n\n\r\n              The Raptors improved to 36-30, winning two straight after dropping three in a row, the final three games VanVleet missed.\n\n\r\n              VanVleet had 10 points and eight rebounds Friday. Pascal Siakam added 25 points and 10 assists for the Raptors, and Scottie Barnes had 15 points.\n\n\r\n              Cameron Payne had a career high-tying 24 points before fouling out in the final seconds for the Suns, and Devin Booker scored 22 points. Booker missed two 3-point attempts in the final minute and was held to three points in the fourth quarter.\n\n\r\n              “We had chances to win but you are not always going to get the fair whistle,” Booker said. “Every team probably feels that way after the game, but I think we definitely didn't tonight.”\n\n\r\n              Mikael Bridges scored 18 points for Phoenix, DeAndre Ayton had 16 and Jae Crowder 13. The Suns fell to 53-14.\n\n\r\n              Toronto opened up a 96-82 lead through three quarters. But the Suns rallied with a 20-6 run to tie it at 102 with 4:36 remaining. \n\n\r\n              “I expected them to make a huge run,” Nurse said. “I kept looking up and saying, ‘It’s down to four,' but I would say, ‘We’re up four in this game on the road in the fourth quarter.'\n\n\r\n              “It really doesn't matter who we play. We got to play well and if we do, we're going to have a chance on any night.”\n\n\r\n              Williams cited his team's emotion as needing some work. Payne and Booker were each assessed technical fouls in the third quarter.\n\n\r\n              “We have to be more emotionally regulated,” Wiliams said. “That cost us momentum and we are giving points away. That is something we have to be a lot better at.”\n\n\r\n              TWO FLAGRANTS\n\n\r\n              With 3:27 left in the third quarter, Booker fouled Toronto's Precious Achiuwa on a drive to the basket. Booker was assessed a flagrant foul (penalty one). Achiuwa made two free throws and VanVleet made a 3-pointer to give Toronto its biggest lead to that point at 83-71. The Raptors led by as many as 16 in the period.\n\n\r\n              In the fourth quarter, with 4:13 remaining Trent was called for a flagrant-one on Payne while Trent was attempting a 3-point shot.\n\n\r\n              SUNS ON THE MEND\n\n\r\n              Suns point guard Chris Paul (right thumb fracture) continued to practice shooting before the game Friday. \n\n\r\n              “It’s awesome, but it’s just part of the normal progression for that kind of injury,” coach Monty Williams said. “We’re happy about it but you have to temper it until he’s able to get to 1-on-1, 3-on-3, 5-on-5, which is hard to do with where we are in the season.”\n\n\r\n              Paul was injured before the All-Star break and is expected to miss another month or so. While Paul is eager to return, Williams says he isn’t concerned that his point guard will try to come back too soon.\n\n\r\n              “I don’t (worry) because I know how diligent he is about his body. Anytime a guy wants to play I don’t mess with him. (Laughs) It’s when guys don’t want to play that’s (a problem). Our guys love to play.”\n\n\r\n              Cam Johnson (right quad contusion) continues to improve, Williams said. \n\n\r\n              Malachi Flynn (left hamstring strain) and OG Anunoby (fractured finger) remain sidelined for the Raptors.\n\n\r\n              TIP-INS\n\n\r\n              Suns C Bismack Biyombo is donating his 2021-22 salary to build a hospital in his native Congo to honor his father, who died of COVID-19 in August.\n\n\r\n              Biyombo was unsigned this season until joining the Suns in January. He has a one-year, $1.4 million contract. The 11-year veteran, through the foundation that bears his name, donated $1 million in medical supplies to the Congo two years ago for supplies to fight COVID-19.\n\n\r\n              NEXT\n\n\r\n              Raptors: At Denver on Saturday night.\n\n\r\n              Suns: Host Los Angeles Lakers on Sunday night",
  "source": "espn_api",
  "crawled_at": 1764992713.263529
}