{
  "game_id": "0022200564",
  "espn_id": "401468719",
  "date": "Jan 04, 2023",
  "matchup": "MEM @ CHA",
  "headline": "Morant, Grizzlies overpower Hornets for 4th straight win",
  "body": "CHARLOTTE, N.C. -- — Ja Morant had 23 points and eight assists playing in front of relatives and friends, Desmond Bane added 19 points and 10 rebounds and the Memphis Grizzlies beat the Charlotte Hornets 131-107 on Wednesday night for their fourth straight win.\n\n\r\n              Dillon Brooks scored 18 points and Jaren Jackson Jr. added 17 points and nine rebounds for the Grizzlies. Steven Adams had 15 rebounds for Memphis, which improved to 9-10 on the road.\n\n\r\n              LaMelo Ball had 23 points and 12 assists and Terry Rozier added 21 points for the Hornets, who’ve lost 14 of 17 games.\n\n\r\n              The Hornets were outmatched from the start.\n\n\r\n              Morant is a South Carolina native whose family lives about 90 minutes from Charlotte — and plenty of them make the trek to Spectrum Center to watch him play.\n\n\r\n              “I had a lot of people come here and support me, as you could hear when I run out of the tunnel or if I score,” Morant said. “It's definitely love here. I'm happy every time I get to come back and it's even better when you win.”\n\n\r\n              Morant didn’t play in the fourth quarter after the Grizzlies stretched their lead to 37.\n\n\r\n              The Grizzlies jumped out to a 40-26 lead in the first quarter behind their All-Star point guard, who set the tone with 12 points and four assists.\n\n\r\n              Memphis didn't let up after Morant took a seat on the bench to start the second quarter, opening with a 20-9 run and eventually pushing the lead to 29 at the half.\n\n\r\n              \"We always preach about throwing that first punch and we have to have that mindset, whether we're home and away, and we have to keep punching until the opposing team is knocked out,\" Morant said.\n\n\r\n              Morant had no problem slicing his way through Charlotte's defense. And when he missed, it seemed either Adams or Jackson was there to grab the offensive rebound for a put-back.\n\n\r\n              The Grizzlies dominated the Hornets on the glass 59-44 and outscored them 64-52 in the paint.\n\n\r\n              Grizzlies coach Taylor Jenkins said the team's offense is continuing to evolve, and Morant is evolving with it.\n\n\r\n              “I mean he’s always progressing,\" Jenkins said. “The sky’s the limit for the kid. He wants to be coached, he wants to be pushed, just seeing him from year one. Just seeing his work that he’s putting on his 3-point shot, seeing him come out tonight firing early, taking more time at the free-throw line, working at that, knowing that he’s a force, he’s going to get foul calls. His playmaking, and getting on the same page as his teammates.”\n\n\r\n              The frustration was evident for the Hornets with Ball, Dennis Smith Jr. and Jalen McDaniels picking up technical fouls.\n\n\r\n              The Hornets struggled to find offense outside of Ball and Rozier with Gordon Hayward (hamstring) and Kelly Oubre (hand) out with injuries. Coach Steve Clifford said it's been difficult battling so many injuries to key players this season, but he's trying to stay positive.\n\n\r\n              “On the flip side, if we get these guys back things can change,” Clifford said. “It's just hard. Every time we start to play better ...”\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Attempted 28 free throws in the first half, 20 more than the Hornets. ... Played without Brandon Clarke (hip) and Ziaire Williams (knee).\n\n\r\n              Hornets: Cody Martin returned after missing 37 games with a left knee injury. Martin was injured in the team's season opener and hadn't played since. Martin had four points on dunks, but had two shots blocked. He said he felt out of rhythm because he hasn't been able to play any 5-on-5 with his teammates in practice. “This was my first run and obviously I'm not excited about it,\" Martin said. \"But I am excited to get back out there.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At Orlando on Thursday night.\n\n\r\n              Hornets: Open a four-game trip at Milwaukee on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994205.7936919
}