{
  "game_id": "0021600712",
  "espn_id": "400900133",
  "date": "Jan 29, 2017",
  "matchup": "OKC @ CLE",
  "headline": "Irving, LeBron pace Cavs to 107-91 win over Thunder",
  "body": "CLEVELAND -- LeBron James sang and danced while dressing at his locker to New Edition's \"Can You Stand The Rain\" following Sunday's win.\nAlthough the song's theme of weathering a storm was fitting for the Cavs, James insisted the selection wasn't intentional.\n\"It has nothing to do with that,\" James said, alluding to some recent self-induced drama for the NBA champions. \"It's just the groove I'm in right now.\"\nKyrie Irving scored 29 points, James had 25 and 14 rebounds and Cleveland played one of its best all-around games in weeks, containing Russell Westbrook and beating the Oklahoma City Thunder 107-91.\nTristan Thompson added 19 points and 12 rebounds for the Cavs, who have won two straight after losing six of eight amid internal turmoil sparked by James criticizing the team's roster following a recent loss. But while not forgotten, the chaos has calmed down a bit and a quality win sure helps.\n\"We just want to play good basketball and tonight we did that,\" James said. \"It started with the defensive end.\"\nWestbrook finished with 20 points, 12 rebounds and 10 assists for his 24th triple-double, but the All-Star was closely guarded by Iman Shumpert and only made 7 of 26 shots as the Thunder's winning streak ended at three.\nThe Cavs focused on making everything difficult for Westbrook and succeeded.\n\"Russell's seen every imaginable defense,\" Thunder coach Billy Donovan said. \"He had some good looks, both in deep and in the free-throw line area. He had some 3s. It was a game where maybe shots didn't go down for him, but I didn't feel he was laboring to get shots off or he was having a difficult time getting to the rim.\n\"It was one of those games.\"\nAnd while the Cavs ended a drama-filled stretch with a solid win, there could be more trouble on the horizon.\nAll-Star forward Kevin Love is not traveling with the team on Monday to Dallas so he can undergo an MRI on his back. Love didn't play in the second half because of back spasms that bothered him earlier this season and the Cavs want to find out what's causing them.\nLove scored one point but grabbed eight rebounds in 12 minutes before leaving with 1:50 left in the second quarter. Coach Tyronn Lue said Love's back was acting up before the game.\nOn Jan. 16, Love was held out of the second half in a lopsided loss to Golden State with lower back soreness and he missed Cleveland's next game.\nLove, who was selected as an All-Star reserve last week, has been dealing with a back issue since he arrived in Cleveland. The Cavs are already thin up front after Chris Andersen sustained a season-ending knee injury. General manager David Griffin has been looking for frontcourt depth, and he might be forced to make a major move depending on what doctors find in Love's back.\nJames has dealt with his own back issues and sympathized with Love.\n\"It's nothing to play with,\" said James, who solved his back problem with stretching and strength exercises. \"It's a terrible feeling when your back is hurt. It just limits you more than anything. I know it's very frustrating for him because he puts in a lot of work.\n\"Hopefully things get better for him soon.\"\nLeading by 13 at halftime, the Cavs let the Thunder get back within eight before Irving put on a show with several drives to the basket.\nShowing off his magnificent dribbling skills to open space and tie up defenders, Irving scored three layups in a span of 58 seconds to put Cleveland back up by 17.\nOklahoma City made a run with Westbrook on the bench in the fourth, but Irving scored a pair of layups and later drained a 30-footer to give the Cavs a 98-82 lead.\n\"Show no mercy,\" Irving said when asked to describe his mindset after halftime.\nTIP-INS\nThunder: Westbrook's 24 triple-doubles are the most in a season since Wilt Chamberlain had 31 in 1967-68. ... It was Oklahoma City's 11th road game of 12 in January. ... Played their first game without reserve center Enes Kanter, who broke his right forearm slamming a chair Thursday. He will be out at least a month. ... With Victor Oladipo going 6 of 18, OKC's starting backcourt shot a combined 13 of 44.\nCavaliers: Thompson added four block and four steals. ... James has scored nearly twice as many points as Cleveland's No. 2 career scorer, Zydrunas Ilgauskas (10,616). James scored 7,919 points during his four seasons with Miami. ... Cleveland is 29-6 in its last 35 home games against Western Conference teams. ... Cleveland made eight 3-pointers after dropping at least 13 in five straight games.\nANOTHER MILESTONE\nJames became the first player in Cavaliers history to score 20,000 points for the franchise. He came in needing six points to hit the plateau and reached it with a layup early in the second quarter.\nUP NEXT\nThunder: At San Antonio on Tuesday.\nCavaliers: At Dallas on Monday, the first of three back-to-backs before the All-Star break.",
  "source": "espn_api",
  "crawled_at": 1764995282.682652
}