{
  "game_id": "0021700660",
  "espn_id": "400975406",
  "date": "Jan 17, 2018",
  "matchup": "LAL @ OKC",
  "headline": "Anthony, Adams lead Thunder past Lakers 114-90",
  "body": "OKLAHOMA CITY --  Carmelo Anthony is getting comfortable in his new role.\n\nHe scored 27 points to help the Oklahoma City Thunder beat the Los Angeles Lakers 114-90 on Wednesday night.\n\nAnthony became one of the most prolific scorers in NBA history by playing mostly isolation ball, but coach Billy Donovan has asked him to become more of a catch-and-shoot scorer. It worked in this one -- the 33-year-old forward made 10 of 15 shots overall and shot 4 of 6 on 3-pointers in one of his best performances of the season.\n\n\"Once you accept something, regardless of what it is, you become comfortable with it,\" he said. \"I think you start putting your all into it and you start working on that role and on that acceptance and it's becomes fun. I think right now, I accepted that role early in December and the game is starting to become fun again. Fun for me and fun for us as a team.\"\n\nSteven Adams had 21 points and 10 rebounds and Russell Westbrook added 19 points and seven assists for the Thunder, who won their third straight. The Thunder shot 48 percent overall and outrebounded the Lakers 54-30.\n\n\"They just big-boyed us,\" rookie Lakers forward Kyle Kuzma said. \"Steven Adams, we couldn't stop him from getting rebounds today. He was the head of the snake in that department.\"\n\nLakers rookie point guard Lonzo Ball sat out his second straight game with a sore left knee. The Lakers are 0-8 when he doesn't play, and they have scored fewer than 100 points in six of those games.\n\nThe injury news got worse for the Lakers. Kuzma left with a finger joint sprain and did not return, and forward Kentavious Caldwell-Pope left with a right Achilles tendon strain and did not return.\n\n\"Just play as a team defensively, just be solid,\" Kuzma said. \"There's got to be a lot of team basketball.\"\n\nSeven of Adams' rebounds were on the offensive end. The Thunder have gotten used to him bailing them out.\n\n\"We can take any shot that we want because he will go get it,\" Thunder forward Paul George said. \"We feel that. Russ feels that, Melo feels that. It puts us in a better rhythm knowing there is a guy that, whether it is a good or bad shot that we take, it's possible to get an offensive basket anyways by Steven. It allows us to be more aggressive. There is not many guys that physically can match him. He is in a category of his own.\"\n\nJulius Randle scored all 16 of his points in the first half for the Lakers.\n\nThe Thunder led 60-54 at halftime behind 16 points from Anthony and 14 from Adams. Westbrook had just two points until scoring eight in the final three minutes of the second quarter.\n\nOklahoma City started strong in the second half. A 3-pointer by George bumped the lead to 11, and a 3-point play by Westbrook midway through the quarter pushed the margin to 14.\n\nWestbrook got Corey Brewer off balance with multiple crossover dribbles before blowing by him for a layup that gave the Thunder an 86-70 lead. A 3-pointer by Anthony made it 91-70 and forced the Lakers to call timeout late in the third quarter. The Thunder controlled the game the rest of the way.\n\n\"They just hit shots,\" Kuzma said. \"We didn't really defend them too well. They've got a lot of good players.\"\n\nTIP-INS\n\nLakers: F Brandon Ingram returned after missing a game with a mild left ankle sprain. He had eight points in 26 minutes. ... Shot 55 percent from the field in the first half, but just 47 percent in the game. ... Caldwell-Pope scored 10 points in 15 minutes. He was one of two Lakers to score in double figures.\n\nThunder: Boxer Floyd \"Money\" Mayweather attended the game. ... G Andre Roberson returned after missing eight games with left patellar tendinitis. He finished with four points and three steals in 17 minutes.\n\nSTAT LINES\n\nThe Thunder committed just one turnover in the third quarter and outrebounded the Lakers 16-7. Oklahoma City took six more shots than Los Angeles in the period and outscored the Lakers 33-18.\n\nQUOTABLE\n\nGeorge, on Oklahoma City's defense: \"It always comes down to defense. We got stops. We turned those stops into baskets. When we are scoring, it slows the other team down.\"\n\nUP NEXT\n\nThe Lakers host the Pacers on Friday.\n\nThe Thunder play at Cleveland on Saturday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball .",
  "source": "espn_api",
  "crawled_at": 1764992961.459403
}