{
  "game_id": "0021900417",
  "espn_id": "401161059",
  "date": "Dec 19, 2019",
  "matchup": "LAL @ MIL",
  "headline": "Antetokounmpo, Bucks beat Davis-led Lakers 111-104",
  "body": "MILWAUKEE --  Giannis Antetokounmpo looked over at LeBron James and Anthony Davis and thought about his past.\n\n\"I wasn't supposed to be here,\" the 6-foot-11 Greek Freak said.\n\nHardly looked that way Thursday night.\n\nAntetokounmpo had 34 points and 11 rebounds, and the Milwaukee Bucks beat James, Davis and the Los Angeles Lakers 111-104 in a showdown of the NBA's top teams.\n\nThe reigning MVP had seven assists and a career-best five 3-pointers as Milwaukee improved to 25-4 after ending an 18-game winning streak against Dallas on Monday night.\n\n\"I wasn't the No. 1 pick, AD was, LeBron was,\" Antetokounmpo said. \"I wasn't supposed to be here. I wasn't supposed to go up against these two beasts. So I'm just happy that I'm here and happy that I'm going through the process and I always want to be better, do better for my team and that's what gives me joy.\"\n\nJames had 21 points, 12 rebounds and 11 assists for his seventh triple-double of the season, and Davis had 36 points and 10 rebounds.\n\n\"You tip your hat off to him and we move forward,\" Davis said of Antetokounmpo.\n\nThe Lakers dropped their second straight game and fell to 24-5 largely because their bench was outscored 34-4 by the Bucks' reserves. George Hill had 21 points off the bench for Milwaukee.\n\nThe last time two teams that were 20 games over .500 played each other before Jan. 1 was 1980. The Boston Celtics (28-8) played the Suns (32-8) in Phoenix. Boston won 116-97.\n\n\"No matter what team we play,\" Hill said, \"we come in with the same mentality to get better that night on both ends of the floor, and it just happened to be the Lakers tonight.\"\n\nMilwaukee led by six after the first quarter then opened the second with a 20-7 run. Davis and James combined to shoot 6 for 20 in the first half, and the Lakers had 10 turnovers. The Bucks led 65-46 at the break.\n\nLos Angeles outscored Milwaukee 68-46 in the second half to close the gap. The Lakers now head home after ending a five-game trip.\n\n\"We continue to build chemistry, we continue to build camaraderie,\" James said. \"Pretty much every time anyone does anything, we pretty much do it together on the road. Just kind of have that bunker mentality, that brotherhood when we hit the road.\"\n\nThe Bucks improved to 3-0 against the two teams from Los Angeles, including a dominant 119-91 win over the Clippers at home on Dec. 6.\n\nBROTHERLY\n\nAntetokounmpo, his older brother and teammate, Thanasis, and their younger brother Kostas, who plays for the Lakers, swapped jerseys and posed for photos together on the court after the game.\n\n\"This is unique,\" Giannis Antetokounmpo said. \"You can't take this for granted. Three brothers under the same roof, going through the same game, going through our pregame warmup. We're blessed.\"\n\nTIP-INS\n\nLakers: Kyle Kuzma remained out with a sore ankle. Coach Frank Vogel said he's hopeful the third-year forward will be able to practice fully Saturday and be available to play Sunday.\n\nBucks: Milwaukee played its third game without guard Eric Bledsoe. The 2018-19 all-defensive first-team performer fractured his right leg against the Memphis Grizzles on Friday. Bledsoe is expected to miss about 2 weeks.\n\nUP NEXT\n\nLakers: Host the Nuggets on Sunday.\n\nBucks: At the Knicks on Saturday.\n\n---\n\nFollow Keith Jenkins on Twitter: https://twitter.com/MrKeithJenkins\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996011.878646
}