{
  "game_id": "0021500233",
  "espn_id": "400828120",
  "date": "Nov 27, 2015",
  "matchup": "MEM vs. ATL",
  "headline": "Millsap's double-double leads Hawks over Grizzlies, 116-101",
  "body": "MEMPHIS, Tenn. --  Paul Millsap and the Atlanta Hawks didn't panic when Memphis hit a string of early shots to build a double-digit lead.\n\nInstead, the Hawks weathered the storm, clamped down on defense in the second half and pulled away from the Grizzlies for a 116-101 victory Friday night.\n\n\"We buckled down. We made it tough on them defensively,\" said Millsap, who led Atlanta with 23 points and 14 rebounds, one of six Hawks to score double figures. \"We contested shots better. We got our hands on the basketball, got deflections and we boxed out pretty good.\n\n\"When you do that, it puts a little more pressure on them.\"\n\nJeff Teague had 20 points and seven assists for Atlanta, which had lost five of seven. Al Horford scored 16, Kent Bazemore had 14, Kyle Korver added 13 and Mike Muscala 11.\n\nMillsap was 11 of 13 from the free throw line. Teague made all six of his foul shots.\n\nMike Conley led Memphis with 16 points but was 4 of 13 from the field. Matt Barnes scored 15, while Courtney Lee and Vince Carter added 14 apiece off the bench. It was a season high for Carter.\n\nMarc Gasol scored 13 points and Jeff Green had 11 for the Grizzlies, outscored 63-43 in the second half.\n\nTeague went 5 of 7 from the floor, including 4 for 6 from outside the arc.\n\nEarly on, it was Memphis' accurate shooting that helped the Grizzlies grab control.\n\n\"I think the first 6, 7 minutes of the game were as good an offense as I've seen us run in many, many years,\" coach Dave Joerger said.\n\nBut despite their lead reaching 12 points, the Grizzlies were up only 58-53 at the break.\n\nThe Hawks erased Memphis' cushion in the middle of the third quarter and extended their advantage to five in the period. Atlanta stretched the margin in the fourth as Teague continued his efficient shooting and Horford scored 10 points early in the quarter.\n\nAtlanta's lead reached 17, and Memphis fans headed for the exits.\n\n\"We couldn't afford a letdown or give them life once we got up,\" Horford said. \"I felt like we were able to handle their runs in the fourth quarter.\"\n\nTIP-INS\n\nHawks: Tiago Splitter and Thabo Sefolosha sat out for the Hawks. Splitter missed his third straight game with a right hip issue; Sefolosha played Wednesday night in the loss at Minnesota. He was rested in this one, with Atlanta playing Saturday at San Antonio. ... Millsap had his ninth double-double of the season. ... Millsap and Horford have reached double figures in all 18 games this season.\n\nGrizzlies: Carter banked in a shot at the end of the first quarter from 65 feet, the longest made by a Memphis player at home since February 2010. ... Gasol was called for a technical in the third quarter when he slammed the ball to the floor in frustration and missed catching it when it bounced back up. ... Memphis lost its first game of the season when leading at halftime. The Grizzlies were 9-0 before Friday night. ... Joerger also got a technical late in the fourth when he argued a call. Barnes got one protesting the same play.\n\nIMMEDIATE SUCCESS\n\nMemphis made 14 of 20 shots in the first quarter, going 4 of 6 from 3-point range. \"I don't think there was anything wrong with our defense in the first half. They just shot the mess out of the ball,\" Millsap said, particularly noting Carter's desperation heave at the end of the first.\n\nON THE LINE\n\nThe Hawks, third in the NBA in free throw shooting at 80 percent, converted 32 of 36 for the game, including 20 of 22 in the second half.\n\nUP NEXT\n\nHawks: At the San Antonio Spurs on Saturday.\n\nGrizzlies: Host the Philadelphia 76ers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994470.136877
}