{
  "game_id": "0022300924",
  "espn_id": "401585552",
  "date": "Mar 10, 2024",
  "matchup": "MIL @ LAC",
  "headline": "Damian Lillard scores 16 in the 4th quarter, and Bucks hold off short-handed LA Clippers 124-117",
  "body": "LOS ANGELES -- — Damian Lillard scored 16 of his 35 points in the fourth quarter of the Milwaukee Bucks' first victory on their California road trip, 124-117 over the short-handed Los Angeles Clippers on Sunday.\n\n\r\n              Lillard hit three of his seven 3-pointers in the fourth, while Giannis Antetokounmpo had 34 points, 10 assists and seven rebounds as the Bucks' superstar duo took over the game down the stretch. Antetokounmpo and Lillard became only the second pair of teammates since 1980 to record at least 30 points and 10 assists apiece in the same game, according to the NBA.\n\n\r\n              “It’s how we work in practice,” Antetokounmpo said. “We got a lot of good shots down the stretch. Tonight it worked, and it’s something we’re going to have to do moving forward.”\n\n\r\n              From the start of the fourth quarter, Antetokounmpo and Lillard either scored or assisted on 31 consecutive points for Milwaukee, decimating the Clippers with the two-man game that the Bucks are counting on to lead them to championship contention.\n\n\r\n              “I think it’s getting much better,” Lillard said of his connection to Antetokounmpo in their first season as teammates. “To start the season, I think a lot of people wanted it to just click and happen right away. But I think any time you put two guys together who have always been the decision-maker, always had their hands on the ball for years and years and years, it’s going to take time for us to learn how to play with each other.”\n\n\r\n              Malik Beasley added 17 points as the Bucks rebounded from back-to-back losses to Golden State and the Lakers by outlasting the Clippers, who played without Kawhi Leonard and Paul George.\n\n\r\n              James Harden had 13 points on 5-of-16 shooting and 11 assists while playing without his own two superstar teammates, who both sat out of the team's second home game in less than 24 hours. Leonard and George played extensively in Los Angeles' win over Chicago on Saturday afternoon, and the Clippers decided to rest Leonard's sore left groin and George's sore left knee.\n\n\r\n              “Those two guys, they're great players, and we understand that,” Clippers coach Tyronn Lue said of Lillard and Antetokounmpo. “They had a good game. I thought Dame set the tone early and then took over the game late. Once he got going, it was hard to stop him. We tried to blitz, tried to do some different things, but he had it going and made some big shots.”\n\n\r\n              Norman Powell scored 20 of his 26 points in the second half for the Clippers, who already were without injured Russell Westbrook. With more than 57 points per game removed from their lineup, the Clips still gave a tough game to another top team before the final minutes.\n\n\r\n              Before the game, coach Tyronn Lue called the Clippers' weekend scheduling “very extreme.” The Clippers won't face as many scheduling obstacles next year when they move out of the arena they share with the Lakers and the NHL's Los Angeles Kings into the new Intuit Dome in Inglewood.\n\n\r\n              Six days after the Bucks’ 113-106 win over the Clippers in Milwaukee, Lillard and Antetokounmpo finally took charge down the stretch of the rematch to avoid the Bucks' first three-game losing streak in a month.\n\n\r\n              Neither team led by more than eight points all day until Lillard hit three free throws and a 3-pointer on consecutive possessions with less than two minutes to play.\n\n\r\n              Harden wasn't at his best, missing seven consecutive shots in the first half and finishing 1 for 6 on 3-pointers.\n\n\r\n              P.J. Tucker scored his first basket since Nov. 14 for the Clippers in the first quarter, finishing with seven points. The veteran hasn't cracked the Clippers' rotation since he was acquired from Philadelphia along with Harden, and he was fined $75,000 by the NBA for publicly campaigning for a trade near the deadline.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host Minnesota on Tuesday night.\n\n\r\n              Bucks: At Sacramento on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764996110.106878
}