{
  "game_id": "0022200381",
  "espn_id": "401468536",
  "date": "Dec 09, 2022",
  "matchup": "CLE vs. SAC",
  "headline": "Barnes scores 20 points, Kings rally to beat Cavs 106-95",
  "body": "CLEVELAND -- — Harrison Barnes scored 20 points and Domantas Sabonis had 18 points, 18 rebounds and six assists as the Sacramento Kings rallied for a 106-95 victory over the Cleveland Cavaliers on Friday night.\n\n\r\n              Kevin Huerter made two 3-pointers in 56 seconds late in the fourth quarter, fueling a 19-0 game-ending run by Sacramento. The Cavaliers took their largest lead at 95-87 on Cedi Osman’s layup with 4:50 left, but were held scoreless on their final 10 possessions.\n\n\r\n              “That was a big, big, big-time win for us,” Kings coach Mike Brown said. “When you get a win like that on the road, that’s a sign you have a really good team. Now, I hope I’m not jumping the gun on that, but this was my favorite game of the season.”\n\n\r\n              Caris LeVert had 22 points, six rebounds and six assists for Cleveland, which had its seven-game home winning streak snapped. Darius Garland added 19 points, six assists and six turnovers as fellow All-Star Donovan Mitchell did not play because of a sore right leg.\n\n\r\n              Kings guard De’Aaron Fox, averaging 22.8 points and 5.6 assists, was held out because of a sore right foot. Brown said he sat Fox as a precaution and considers him day-to-day.\n\n\r\n              Huerter finished with 19 points and Keegan Murray had 18 on 6-of-8 shooting on 3-pointers. Sacramento is 1-1 on a six-game trip through the Eastern Conference and owns the fifth-best record in the West.\n\n\r\n              “To come here after losing to Milwaukee, we kind of wanted to make a statement and we did,” Barnes said. “It was just us getting stops and playing with poise. Late in the fourth, we did a good job getting good looks and were able to capitalize.”\n\n\r\n              Cleveland is 11-2 at Rocket Mortgage FieldHouse, tying for the best home mark in the league, and leads the NBA in defense at 105.1 points per game. But the Cavs committed a season-high 20 turnovers as Sabonis, Huerter and Matthew Dellavedova each had three steals.\n\n\r\n              “We didn’t execute enough and we didn’t do a good job of closing,” coach J.B. Bickerstaff said. “Give Sacramento credit, but we also have to look in the mirror. It was a combination of things.”\n\n\r\n              Osman scored 17 points off the bench and Evan Mobley had 16 points and seven rebounds.\n\n\r\n              BROWN’S TOWN\n\n\r\n              Brown spent six seasons in charge of the Cavaliers, but hadn’t previously faced them as a head coach. The Columbus, Ohio, native went 305-187 over two stints with Cleveland, taking the franchise to its first NBA Finals in 2007.\n\n\r\n              “I had a fantastic time here and the people here are fantastic,” said Brown, initially hired by the Cavaliers at age 35 in 2005. “I’ll always be grateful to Dan (Gilbert) and his family for giving me my first opportunity at such a young age.”\n\n\r\n              Brown, who signed a four-year contract with Sacramento on May 9, said he misses the energy around the team in Cleveland.\n\n\r\n              “The fans and their passion for their sports, that’s definitely what makes it fun,” he said. “And it starts with Dan, who puts his money where his mouth is and tries to bring the right people in.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: G Terence Davis (lower back soreness), a key reserve, missed his third game in a row. … F Chima Moneke and C Neemias Queta are on G League assignments with Stockton, but two-way G Keon Ellis is traveling with Sacramento.\n\n\r\n              Cavaliers: F Dean Wade (left shoulder sprain) could return before the end of the month after spraining his AC joint on Dec. 2 against Orlando. … G Ricky Rubio (left knee surgery) and G Dylan Windler (right ankle sprain) remain out.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Visit New York on Sunday night.\n\n\r\n              Cavaliers: Host Oklahoma City on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995250.508186
}