{
  "game_id": "0021601065",
  "espn_id": "400900460",
  "date": "Mar 22, 2017",
  "matchup": "MIL @ SAC",
  "headline": "Antetokounmpo's 32 points lead Bucks over Kings,",
  "body": "SACRAMENTO, Calif. --  Wary of a letdown on the finale of a six-game trip, Giannis Antetokounmpo took it upon himself early to make sure that the Milwaukee Bucks would be departing for home with a smile on their faces.\n\nAntetokounmpo had a huge first half and finished with 32 points, 13 rebounds and six assists for the streaking Bucks, who cruised to a 116-98 victory over the Sacramento Kings on Wednesday night.\n\nThe win moved the youthful Bucks into a tie with Indiana for the sixth spot, one game behind fifth-place Atlanta in the tight Eastern Conference playoff race. The Bucks have been the NBA's hottest team the past three weeks, winning 10 of 12 games.\n\nA highly athletic forward, Antetokounmpo had a fabulous first half with 22 points, nine rebounds and five assists. The Bucks produced an explosive 44-26 second quarter, led 69-50 at halftime, and the Kings never got the lead under 12 points the remainder of the game.\n\n\"I wanted to come out and set the tone,\" said Antetokounmpo, who made 12 of 22 shots and seven of 10 free throws. \"It was a back-to-back game and we needed it badly so we could end our road trip positively.\"\n\nThere have been plenty of positives lately for the Bucks. The victory put the Bucks above .500 for the first time since Jan. 15. Milwaukee struggled near the midpoint of the season, losing 12 of 14. But the Bucks have a 14-5 record since Feb. 10.\n\nThe Bucks concluded a six-game trip with two straight victories and had a 4-2 record.\n\n\"It would have been easy to overlook this game. It's what we call a trap game,\" Bucks coach Jason Kidd said. \"We saw the scores (both Indiana and Atlanta lost). So for us to end this (night) in sixth shows we're playing good basketball at the right time.\"\n\nGreg Monroe had 15 points for the Bucks, who have won two straight and four of five. Mirza Teletovic and Khris Middleton had 13 points each and Malcolm Brogdon had 12. Milwaukee made 16 of 35 3-point attempts.\n\nSkal Labissiere drew the early assignment of trying to slow down Antetokounmpo and the rookie found it quite challenging.\n\n\"He's a really good basketball player and he can do a lot of different things from the perimeter. It was good learning experience,\" Labissiere said. \"It was my first time, I think, actually guarding him. I think Matt (Dellavedova) was setting screens from him and that was the first time I ever seen that. The Bucks have a unique style of play.\"\n\nRookie Buddy Hield had 21 points and Tyreke Evans added 18 for the Kings. Arron Afflalo and Garrett Temple had 12 points each.\n\nThe losing continues for the Kings, who have dropped three straight, 11 of 13 and have a 3-11 record since the trade of DeMarcus Cousins at the All-Star break.\n\nThe Kings will have a losing record for an 11th straight season and the hunt for a playoff spot has become a distant memory.\n\n\"We're playing teams that are very focused,\" Kings coach Dave Joerger said. \"Sometimes throughout the course of the season, you're going to get somebody that looks at our record and they are going to sleep on us. But right now, we're playing teams that are very focused in trying to get a seeding, and fighting for playoff spots.\"\n\nTIP- INS\n\nBucks: Veteran Jason Terry hit two 3-pointers in the second quarter and playfully chided the crowd for booing him. He was traded to the Kings in 2014, but never played a game after expressing a desire to be traded to a contending team. ... Milwaukee shot 61 percent in the opening half and made 9 of 18 3-point attempts.\n\nKings: Veterans Kosta Koufos and Ty Lawson were rested and didn't play. Rookie Malachi Richardson (hamstring) remains out, but is expected to return soon. ... The Kings have dropped seven of eight at home, where they own a 14-22 record.\n\nLOVING THE CHASE\n\nThere's no doubting that the Bucks are in the midst of their best stretch of the season. And the result is a climb up the ladder in the Eastern Conference, where they once resided in 11th place during the second half of the season.\n\n\"We're chasing right now, so there's no pressure,\" Antetokounmpo said. \"We were 11th and now we're (tied for) sixth. We'll keep chasing and try to get even higher. We're having fun right now and playing good basketball.\"\n\nUP NEXT\n\nBucks: After six straight road games, Milwaukee returns home and meets Atlanta on Friday.\n\nKings: At Golden State on Friday, where they look for a second win this season over the Warriors.",
  "source": "espn_api",
  "crawled_at": 1764995135.911231
}