{
  "game_id": "0021900537",
  "espn_id": "401161179",
  "date": "Jan 05, 2020",
  "matchup": "MEM @ PHX",
  "headline": "Valanciunas scores 30 points, Grizzlies beat Suns 121-114",
  "body": "PHOENIX --  A few bad decisions led to some anxious moments for the Grizzlies in the final minutes. A month or two ago, it all might have ended in a heartbreaking loss.\n\nBut Memphis is a team that's growing up quickly and the final result was a 121-114 victory over the Phoenix Suns on Sunday night. It was the second road win in two days for the Grizzlies and more proof that they might be building something interesting in the Western Conference.\n\n\"We're a young team, we're building this team for the next five or 10 years with these guys, you know?\" guard Dillon Brooks said. \"It's good that we're getting these games, because we're going to be in these games a lot.\n\n\"At the beginning of the year, we'd get in this predicament and lose. We're showing growth now.\"\n\nJonas Valanciunas scored 30 points and Brooks added 19, leading the Grizzlies to their fifth win in eight games. Memphis is 10-9 since Dec. 1.\n\nThe Grizzlies led the entire second half and had a comfortable 96-77 advantage after three quarters, but had to fend off a pair of runs by the Suns in the final minutes. Phoenix pulled to 109-101 with under four minutes left, but Brooks made two straight 3-pointers from the corner to squash the momentum.\n\nThe Suns quickly cut that 14-point deficit to 117-114 with 32 seconds left, but Ja Morant made a pair of free throws to finally put away the game.\n\n\"It got a little scary there at the end in the fourth, but we found a way to execute against their pressure and come up with some big stops down the stretch,\" Memphis coach Taylor Jenkins said.\n\nDevin Booker led the Suns with 40 points to break the franchise record for consecutive games with at least 30 with six. Charles Barkley and Charlie Scott shared the previous mark. The record was little solace for the fifth-year guard, who wasn't able to shoot the Suns to a win.\n\n\"Tonight was a step back,\" Booker said. \"We are going to have to respond, finish out this home-stand the right way and hopefully get a few wins before we head out back east.\"\n\nValanciunas shot 12 of 16 from the field, and Brooks made five 3-pointers before fouling out in the final minute. Jaren Jackson Jr. had 15 points and eight rebounds. The Grizzlies shot 54 percent from the field and made 18 3-pointers.\n\n\"It's a team that's going to come out and compete, play unselfish and together,\" Morant said. \"We all have one goal, same mindset.\"\n\nThe Grizzlies were coming off one of their most impressive wins of the season after beating the Clippers 140-114 on Saturday. They jumped ahead again one day later, leading the Suns 62-57 at halftime behind 20 points from Valanciunas. He made 8 of 9 shots in the first half, including 3 of 4 from 3-point range.\n\nKelly Oubre finished with 17 points and 10 rebounds for the Suns. Deandre Ayton had 14 points and 12 rebounds.\n\nSuns coach Monty Williams was obviously frustrated, giving one statement during his postgame press conference, but not taking any questions.\n\n\"Until we learn how to play the right way consistently, we're just going to have a lot of nights like this,\" Williams said. \"That's the deal.\"\n\nTIP-INS\n\nGrizzlies: Memphis shot nearly 56% from the field in the first half and made 11 3-pointers. ... The Grizzlies are 2-1 against the Suns this season. The road team has won all three games. ... Memphis improved to 4-2 on the second night of back-to-back games.\n\nSuns: F Frank Kaminsky missed his fourth straight game with a knee injury. The team said Saturday that he'd miss at least the next four weeks and then be re-evaluated. ... Booker shot 13 of 20 from the field and 13 of 14 on free throws. He also had six assists.\n\nUP NEXT\n\nGrizzlies: Memphis returns home to face Minnesota on Tuesday night\n\nSuns: Phoenix plays the third of its five straight games at home against Sacramento on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995722.0608692
}