{
  "game_id": "0021600137",
  "espn_id": "400899587",
  "date": "Nov 12, 2016",
  "matchup": "MIL vs. MEM",
  "headline": "Bucks use big fourth quarter for 106-96 win over Grizzlies",
  "body": "MILWAUKEE --  To pull away from the Memphis Grizzlies, the Milwaukee Bucks went back to their strength.\n\nThe Bucks scored 18 of their 50 points in the paint in the fourth quarter, using two big runs to beat the Memphis Grizzlies 106-96 on Saturday night.\n\nGiannis Antetokounmpo scored 27 points, while Michael Beasley added a season-high 19.\n\nDespite switching to a zone defense in the second half, Memphis could not slow the Bucks. Milwaukee scored 50 points in the paint and turned 13 turnovers by the Grizzlies into 24 points.\n\nThe Bucks entered averaging a league-best 49.8 points in the paint and have not notched at least 50 in six of their nine games.\n\nBeasley scored five points during an 11-2 run that gave the Bucks an 86-72 lead with 9:59 to play.\n\n\"I thought Beasley was great off the bench for us,\" Bucks coach Jason Kidd said. \"During that stretch late when they went zone, he did what he does best and that's get the ball in the paint.\"\n\nMemphis pulled to within 95-90 on a basket by Randolph with 4:41 left, but Beasley answered on the other end.\n\nChandler Parsons made a 3-pointer with 2:56 remaining to cut Milwaukee's lead to 99-96. After Antetokounmpo split a pair of free throws and blocked Parsons shot, Greg Monroe scored inside to put the Bucks up 102-96 with 2:17 left.\n\nMilwaukee closed the game on a 7-0 run, as Memphis did not score in the last 2:56 of the game.\n\n\"We had a lot of really rushed possessions with no detail,\" Grizzlies coach David Fizdale said. \"We were kind of sporadic and scattered.\"\n\nIn addition to leading the Bucks in scoring, Antetokounmpo bounced back from a pair of down games to fill the stat sheet with six rebounds, five assists, four steals and four blocks.\n\n\"My teammates wanted to get me back into a rhythm because they told me from day one that they need me,\" Antetokounmpo said. \"I've just got to do whatever it takes to win. I told them I'm going to play as hard as I can and sometimes there's going to be ups and downs.\"\n\nMarc Gasol finished with 18 points for Memphis before fouling out in the final seconds. Vince Carter added 17 points.\n\nThe Bucks led by 13 points with 1:50 left in the second quarter, but the Grizzlies closed to within 44-39 at the break with an 8-0 run, including scoring four points in the final 1.9 seconds of the half.\n\nTIP-INS\n\nGrizzlies: Carter passed Charles Oakley for 24th on the career games played list with 1,283 and passed Gary Payton for 21st in made field goals with 8,709. ... Tony Allen missed his second consecutive game due to a groin injury.\n\nBucks: John Henson started at center in place of Miles Plumlee and scored eight points with seven rebounds in 18 minutes. ... Mirza Teletovic played a season-season low five minutes and did not attempt a shot\n\nSIXTH MEN\n\nIn Monroe and Zach Randolph, Milwaukee and Memphis each have longtime starters playing critical roles off the bench.\n\nPrior to this season, Randolph had 820 starts in 984 career games, while Monroe had started 401 of 457 games.\n\n\"Ours is really just out of necessity,\" Memphis coach David Fizdale said. \"If Zach wasn't coming off the bench for us, I really don't know how we would score.\n\nUP NEXT\n\nGrizzlies: Memphis visits the Utah Jazz on Monday. The Grizzlies have lost two straight in Salt Lake City.\n\nBucks: At the Atlanta Hawks on Wednesday. Milwaukee won two of three against Atlanta last season with both victories coming in overtime",
  "source": "espn_api",
  "crawled_at": 1764995223.860936
}