{
  "game_id": "0021800748",
  "espn_id": "401071421",
  "date": "Jan 28, 2019",
  "matchup": "ATL @ LAC",
  "headline": "Hawks beat Clippers 123-118 for 1st time since 2016",
  "body": "LOS ANGELES --  These young Atlanta Hawks are growing up over halfway through the season.\n\nTrae Young scored 26 points, John Collins added 22 and they beat the Los Angeles Clippers 123-118 on Monday night for the first time in nearly three years.\n\nAtlanta had lost five in a row to the Clippers dating to March 5, 2016. The Hawks earned their first win against a Pacific Division opponent this season after dropping their first five.\n\nAlex Len had 19 points and nine rebounds off the bench for the Hawks, whose starters all have less than six years in the league, including rookies Young and Kevin Huerter.\n\n\"We're fighting,\" Len said. \"We're always in games. That's what you want to see from a young team.\"\n\nTobias Harris scored 30 points for the Clippers, whose three-game winning streak ended on the second night of a back-to-back. Lou Williams finished with 21 points and nine assists, and Montrezl Harrell had 18 points.\n\n\"Atlanta was better prepared and played harder,\" Clippers coach Doc Rivers said. \"They came in with an intent to win the game. You could feel it through the game.\"\n\nAtlanta stretched its lead to 16 points, its largest of the game, midway through the fourth quarter.\n\nThe Clippers weren't done just yet.\n\nHarris scored 10 of their next 19 points to close to 118-112.\n\nBut Dewayne Dedmon dunked and Young hit a 3-pointer that kept the Hawks ahead 123-114.\n\n\"He's really been composed over the last couple games,\" Collins said of Young. \"He's made an effort to really make the right play.\"\n\nThe Clippers overcame a 12-point deficit to tie the game five times in the third quarter. But the Hawks closed on a 17-6 run to lead 94-83 going into the fourth. Len scored nine points and 42-year-old Vince Carter drew cheers after connecting on a 3-pointer.\n\nThe Hawks set the tone on their first basket of the game. Dedmon slammed a one-handed dunk, stopped and stared into the crowd.\n\nThe Clippers led just once after that by three points.\n\nTIP-INS\n\nHawks: Their bench outscored the Clippers' reserves, who lead the NBA in scoring, 51-45. ... They split the season series, having lost 129-117 at home on Nov. 19.\n\nClippers: Williams missed his first 11 field-goal attempts. ... They fell to 10-8 in back-to-backs, including 4-5 in the second game. ... Starting F Danilo Gallinari (lower back spasms) sat out his sixth straight game.\n\nHE SAID IT\n\n\"We showed up and thought we were going to win. We're just not good enough to do that.\" -- Rivers.\n\nUP NEXT\n\nHawks: At Sacramento on Wednesday.\n\nClippers: Host Lakers on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995356.48847
}