{
  "game_id": "0022200560",
  "espn_id": "401468715",
  "date": "Jan 02, 2023",
  "matchup": "MIA @ LAC",
  "headline": "Adebayo scores 31, Heat recovers to beat Clippers 110-100",
  "body": "LOS ANGELES -- — Bam Adebayo had 31 points and 13 rebounds, and the Miami Heat recovered from blowing a 21-point lead to beat the Los Angeles Clippers 110-100 on Monday night for their second win in a row.\n\n\r\n              “Bam was just Mr. Reliable all game long,” Heat coach Erik Spoelstra said. “He was able to really help us control the game from a paint standpoint.”\n\n\r\n              Tyler Herro added 23 points and Victor Oladipo had 15 off the bench for the Heat, who have won four of five. They swept the two-game season series for the first time since 2017-18.\n\n\r\n              “We came out really hard,” Herro said. “From the starting five to the bench there was no drop-off. We just continue to get better every single day.\"\n\n\r\n              Paul George had 25 points and seven assists to lead the Clippers, who were without Kawhi Leonard in dropping their third straight. He sat out with a non-COVID-19 illness. \n\n\r\n              “We've just got to keep people off the offensive glass, and our costly open-court turnovers are giving teams easy baskets,” said Reggie Jackson, who added 20 points for the Clippers. \n\n\r\n              Miami ran off seven straight to open the fourth quarter and take an 88-83 lead. The Clippers pulled to 96-95 on Luke Kennard's 3-pointer. He scored eight of his 11 points in the fourth.\n\n\r\n              But George and John Wall had back-to-back turnovers and the Heat scored seven in a row to go up 103-95. The Clippers were held to 17 points in the fourth. Miami fans chanted “Let's go Heat!” in the closing minutes.\n\n\r\n              “That's the way we win games on defense,” Herro said. “Victor Oladipo was a menace on defense.”\n\n\r\n              The Heat led by 21 in the second quarter and 18 in the third before Los Angeles rallied.\n\n\r\n              The Clippers’ starting five engineered a comeback in the third. George (three) and Marcus Morris (one) combined to hit four consecutive 3-pointers that capped a 28-8 run and put the Clippers ahead 77-75. It was their first lead since the opening period.\n\n\r\n              Miami’s Max Strus hit a tying 3-pointer before George made a pair of free throws that sent the Clippers into the fourth leading 83-81.\n\n\r\n              Trailing by six, the Clippers opened the second with a 12-6 run to pull into a 40-all tie on Nicolas Batum's 3-pointer. \n\n\r\n              But the Heat took over from there.\n\n\r\n              Miami outscored the Clippers 27-9 to take a 67-49 lead into halftime. Herro made four 3-pointers and Strus added another as the Heat's second unit dominated. Herro and Adebayo had 16 points each in the second.\n\n\r\n              TIP-INS\n\n\r\n              Heat: Udonis Haslem (right Achilles tendinitis) sat out. ... Dewayne Dedmon (health and safety protocols) worked out Monday. Depending on how he feels, he could return for the final two games of the trip. ... Caleb Martin (left quad strain) was a game-time decision. He started and had two points and three rebounds in 14 minutes.\n\n\r\n              Clippers: Morris got a technical in the second for tipping the ball out of the referee's hands after a call he didn't like. \n\n\r\n              UP NEXT\n\n\r\n              Heat: Stay in LA to play the Lakers on Wednesday.\n\n\r\n              Clippers: At Denver on Thursday to open a two-game trip.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993968.718242
}