{
  "game_id": "0022400862",
  "espn_id": "401705428",
  "date": "Mar 01, 2025",
  "matchup": "HOU vs. SAC",
  "headline": "Kings overcome the loss of Sabonis to beat the Rockets 113-103 for their 3rd straight victory",
  "body": "HOUSTON -- — DeMar DeRozan had 21 points and the Sacramento Kings overcome an early injury to Domantas Sabonis for their third straight victory, 113-103 over the Houston Rockets on Saturday night.\n\n\r\n              Zach LaVine added 20 points for Sacramento. The Kings had a 13-3 run to push their advantage to 97-85 with 10 minutes remaining. LaVine and Keon Ellis had 3-pointers in that stretch and DeRozan scored the last five points.\n\n\r\n              Alperen Sengun led the Rockets with 30 points and 10 rebounds. Jalen Green added 24 points in the loss that ended a two-game winning streak.\n\n\r\n              Sabonis, who entered the game averaging 19.9 points and 14.4 rebounds, left about a minute into the game with a hamstring injury and didn’t return. He was running down the court when he pulled up and grabbed his left hamstring. \n\n\r\n              Takeaways \r\n              Kings: Sacramento used a balanced scoring attack to make up for the loss of Sabonis with six players finishing with at least 12 points.\n\n\r\n              Rockets: Fred VanVleet was rusty in his return after missing 11 games with a strained right ankle, going 1 for 8 with three points in 35 minutes. The veteran needs to get back on track quickly to help stabilize an offense that has struggled at times in his absence.\n\n\r\n              Key moment\r\n              LaVine’s 3-pointer late in the third quarter which started the big run that allowed the Kings to pull away.\n\n\r\n              Key stat\r\n              The Kings outscored Houston 58-44 in the paint.\n\n\r\n              Up next\r\n              The Rockets visit Oklahoma City on Monday night, and the Kings visit Dallas that night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997362.151532
}