{
  "game_id": "0021600780",
  "espn_id": "400900185",
  "date": "Feb 07, 2017",
  "matchup": "HOU vs. ORL",
  "headline": "Harden has 25 to lead Rockets over Magic 128-104",
  "body": "HOUSTON --  The Houston Rockets weren't thrilled that they let a huge lead dwindle to less than 10 points in the fourth quarter on Tuesday night.\n\nThey were, however, happy with how they responded once that happened.\n\nJames Harden had 25 points and 13 assists as the Rockets built a big lead early and held off a late rally to get a 128-104 win over the Orlando Magic on Tuesday night.\n\nThe Rockets had led by as many as 23 before the Magic begin chipping away at the lead. Serge Ibaka made a turnaround jump shot midway through the fourth quarter to cut Houston's lead to nine points. Harden grabbed a bad pass from Evan Fournier not long after that and dished to Eric Gordon, who finished with a 3-pointer. Trevor Ariza added a 3-pointer for Houston to extend the lead to 112-97 with about four minutes remaining to put the game away.\n\n\"Teams are going to make runs,\" Ariza said. \"It's all about how you respond to the runs when you make them. Once they made their run we were able to come back and get stops most importantly.\"\n\nPatrick Beverley made seven points after that to help extend the lead to 120-99 with less than two minutes left and send Houston's starters to the bench.\n\nIt is Houston's second straight win and the 10th loss in 13 games for the Magic.\n\n\"We had a couple of opportunities, we had shots, and cut the deficit,\" Magic coach Frank Vogel said. \"But then a couple of turnovers at bad times and they were able to capitalize on it.\"\n\nHarden's scoring slowed down a bit on Tuesday after he scored 41 and 42 points in his last two games. But his 13 assists ended a streak of four straight games where he had fewer than 10, which was a season-long drought.\n\nIbaka had 28 points for the Magic and Evan Fournier added 21.\n\n\"We know they're a good team and we know they can shoot the ball, but we also know we have to play better defense,\" Ibaka said.\n\nHouston led by 12 early in the third quarter when Beverley and Ariza made consecutive 3-pointers to spark an 11-4 run that extended the lead to 81-62 with about seven minutes left in the quarter.\n\nThe Magic missed five shots in that span to help Houston pad its advantage.\n\nThe Rockets had pushed the lead to 20 points not long after that when the Magic finally got something going, and used a 16-5 spurt to get within 93-84 late in the third quarter. Gordon made one of two free throws after that to leave the Rockets up 94-84 entering the fourth quarter.\n\nFournier made six points to help Orlando cut the lead in that span, including four straight free throws late in that time.\n\nThe Rockets led 70-54 at halftime.\n\nTIP-INS\n\nMagic: Nikola Vucevic had 14 points and a season-high 19 rebounds. ... The Magic made just six of 25 3-pointers. ... D.J. Augustin added 11 points.\n\nRockets: Clint Capela had 17 points to extend his streak of games with at least 10 points to a career-high eight straight games. ... Nene had 13 points for his fourth double-digit game in the last five. ... Beverley had seven assists, to give him at least five in six of the last seven games.\n\nCLOSING OUT THE FIRST HALF\n\nThe Rockets were energized after getting a short break with three days between their last game and Tuesday's contest. Now they're focused on building on what they did against the Magic in their last three games before the All-Star break.\n\n\"These next (three) games before the All-Star break are going to be extremely important for us, especially on the defensive end, to kind of build some momentum,\" Harden said. \"We have to come out with that intensity, and that mind set, and we'll be all right.\"\n\nTHE DREAM\n\nHakeem Olajuwon was honored on Tuesday night as part of the team's 50th anniversary celebration. The Hall of Famer, who helped the Rockets to back-to-back titles in 1994-95, is Muslim and was born in Nigeria, but has since become a naturalized U.S. citizen. He addressed new President Donald Trump's travel ban before the game.\n\n\"I was kind of surprised,\" he said. \"I was thinking maybe a lot of people say things just to get elected and wouldn't actually do it ... I think in the first quarter you would make a mistake and have to adjust. I think this was a mistake that the president made.\"\n\nHe hopes Trump will change course.\n\n\"You can adjust in the second half to make it work by pull(ing) everybody together,\" he said. \"This is an opportunity to pull everybody together instead of separating.\"\n\nUP NEXT\n\nMagic: Host Philadelphia on Thursday.\n\nRockets: Travel to Charlotte Thursday.",
  "source": "espn_api",
  "crawled_at": 1764995759.095739
}