{
  "game_id": "0021900421",
  "espn_id": "401161063",
  "date": "Dec 20, 2019",
  "matchup": "IND vs. SAC",
  "headline": "Pacers beat Kings 119-105 for 5th straight victory",
  "body": "INDIANAPOLIS --  Indiana Pacers coach Nate McMillan discussed the possibility of a trap game Friday night with Sacramento.\n\nThe host Pacers beat Western Conference leader Los Angeles Lakers on Tuesday night and play at Eastern Conference leader Milwaukee on Sunday. However, there was no letdown, with T.J. Warren scoring 23 points to help the Pacers beat the Kings 119-105 for their fifth straight victory.\n\n\"We just had the same approach as we did against the Lakers,\" Warren said. \"We've just been following the game plan and excecute while we're on the floor, just continue to play hard, listen to the coaches and believe in ourselves.\"\n\nDespite being ill, Warren sank 10 of 16 shots, 3 of 4 from 3-point range.\n\n\"I just wanted to come out and be aggressive,\" Warren said.\n\nMyles Turner added 17 points, and Domantas Sabonis and T.J. McConnell each had 15, with Sabonis also grabbing nine rebounds to help the Pacers improve to 20-9.\n\nMcConnell hit 7 of 8 shots and had eight assists off the bench. Malcolm Brogdon and Doug McDermott had 13 points each, and Aaron Holiday had 11 in Indiana's balanced attack.\n\n\"Everyone is unselfish on this team so we know anyone can get going on any given night,\" McDermott said. \"We had a balanced attack out there and it's good to see. We're clicking right not but we have a really tough test against Milwaukee. We can't be complacent.\"\n\nRichaun Holmes led the Kings with 20 points on 9-of-10 shooting and a team-high nine rebounds. Marvin Bagley III added 17 points, and Justin James had 14.\n\n\"I feel like they imposed their will on the game and we didn't respond,\" Holmes said.\n\nBuddy Hield, the Kings' leading scorer, was just 3 of 15 shots for seven points. He did contribute eight rebounds and a team-high six assists.\n\nThe Pacers shot 64% in the first half to take a 68-57 lead. They finished at 52%\n\nThe Kings made 53% in the first half and 45% overall\n\n\"We gave them too many easy looks in the first half and we just wanted to put a stop to that,\" McDermott said.\n\nIndiana led by 22 points in the third quarter before settling for a 92-79 lead entering the fourth. The Kings scored the last nine points of the third, with James hitting a long 3-pointer at the quarter buzzer. The Kings narrowed the deficit to 11 points at 91-81 before the Pacers pulled away again.\n\n\"In the first half, we didn't establish ourselves defensively and (the Kings) were playing in the paint,\" McMillan said. \"We did a better job in the second half defensively and we had good ball movement all game. I like our effort collectively.\"\n\nTIP-INS\n\nKings: Bogdan Bogdanovic, who averages 14.6 points off the bench, was sidelined by right ankle soreness. Trevor Ariza was not with the team for personal reasons.\n\nPacers: Jeremy Lamb (14 points per game) was out with a sore right groin injury. Aaron Holiday started in his place.\n\nDEFENSIVE WOES\n\nSacramento coach Luke Walton saw too many defensive breakdowns.\n\n\"You talk about guarding our man and there's three or four possessions early where somebody just drove right past us into the paint,\" Walton said. \"When you do that at this level, you just put so much pressure on the rest of your defense. If you let your man just by you one-on-one, it's tough to get any stops.\"\n\nBUCKS ON MIND\n\nMyles Turner knows the Pacers are headed for another test against Milwaukee. The Bucks won the season's first meeting 102-83 in Indianapolis.\n\n\"We know they're a top team and we have to respect them for that,\" Turner said. \"But we have to go with the mindset that we're going to punch first and, hopefully, leave there with a win.\"\n\nHOMECOMING\n\nKings guard Yogi Ferrell, who led Indianapolis Park Tudor High School to a Class 2A state title in 2011 and played at Indiana University, scored seven points off the bench\n\nUP NEXT\n\nKings: At Memphis on Saturday night.\n\nPacers: At Milwaukee on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764995861.751165
}