{
  "game_id": "0021900878",
  "espn_id": "401161520",
  "date": "Feb 28, 2020",
  "matchup": "BKN @ ATL",
  "headline": "Collins, Reddish power Hawks' offense in win over Brooklyn",
  "body": "ATLANTA --  The Atlanta Hawks have been the NBA's worst 3-point shooters this season, so rookie Cam Reddish was pleased to be a big part of a one-night reprieve.\n\n\"We've all been putting in a ton of work in practice, extra work on our jump shots and defense,\" Reddish said, \"but to see our shots go down today was a great feeling.\"\n\nJohn Collins had 33 points and 13 rebounds, Reddish scored 17 of his career-high 26 points in the third quarter, and the Hawks handed the Brooklyn Nets their third straight loss with a 141-118 victory Friday night.\n\nTrae Young, ranking second in the NBA in scoring and assists, finished with 22 points and assisted on 14 baskets to help Atlanta, the league's second-worst team, snap a two-game skid. The Hawks hit 19 3-pointers and finished 48.7% on treys on rare night of fun beyond the arc.\n\nThe Nets gave up a season high in points. They pulled within six on Caris LeVert's layup early in the fourth, but got no closer the rest of the way after Jeff Teague and Kevin Huerter answered with baskets that pushed the lead back to double digits.\n\n\"We are seventh in the league in defense and tonight we looked like were 800th in defense.\" Brooklyn coach Kenny Atkinson said. \"We lost our defensive identity tonight. It's one game. I'm not going to change things and go crazy.\"\n\nSpencer Dinwiddie scored 24 points to lead Brooklyn, which began the game seventh in the Eastern Conference before dropping six games under .500. It had won eight straight over the Hawks and five consecutively in Atlanta.\n\nThe game got away from the Nets in the third. Atkinson called timeout after Atlanta hit its 10th trey for a nine-point lead and immediately got a technical foul for arguing that Dinwiddie had been fouled on the previous possession.\n\nDinwiddie and Harris missed shots in the next possessions, and the Hawks soon led by 14 on Reddish's 3.\n\n\"Tonight was a real example of all of our guys trending in the right direction,\" Atlanta coach Lloyd Pierce said. \"To put together that type of win was really encouraging to see.\"\n\nTIP-INS\n\nNets: The previous season high allowed was 138 points in a loss at Phoenix. ... Brooklyn got off to a hot start, ending the first with a 36-29 lead to tie a team season high in points in the opening period. ... LeVert, coming off a 34-point performance at Washington, had 18. He had an offensive rebound and putback to end the first, but was mostly quiet the rest of the way.\n\nHawks: The young, rebuilding team has won 10 of its last 21 games. ... Young scored 39 and 47 in two games of the season series, but this time he was mostly about passing. One of his better moments was a no-look dish high in the lane to a streaking Jeff Teague for a fast-break layup that made it 88-78 in the third. ... Collins scored 20 in a half for the seventh time in his three-year career. ... Atlanta finished one 3 shy of tying a season high.\n\nSINKING\n\nThe Nets were coming off two tough setbacks in the closing minutes, blowing a 19-point lead to lose at home to Orlando and rallying briefly after being down 18 at Washington but losing for the 12th time this season when taking a lead into the fourth.\n\nThey couldn't stop Atlanta's shooters in the third. Reddish, a 30% 3-point shooter this season, was 6 for 9 in the game after hitting on consecutive possessions to make it 97-86 and followed with an 18-footer to make it a nine-point lead. Huerter and Collins followed with two straight 3s for a 14-point advantage.\n\nBrooklyn's defense was slipshod, and the Nets were out-rebounded 52-38, causing Dinwiddie to say he and his teammates \"made the game easy\" for Atlanta.\n\n\"One of our hallmarks even during our bad seasons was our scrappiness, our toughness and playing hard all the time even when we weren't winning games,\" he said. \"You want to have that type of mentality. You want to defend at a high level and that gives you a chance to win every game.\"\n\nCOMEBACK KID\n\nReddish, the 10th overall draft pick, overcame a concussion earlier this month and has scored in double figures in seven straight games and 13 of his last 14. He played a game-high 34 minutes.\n\n\"I feel like he had it tonight, and when he has that confidence you can just see the talent oozing out of him,\" Collins said. \"Hopefully he keeps that confidence and playing that way because the game really opens up when you have a guy like him who can slice, cut, shoot and make plays like he did.\"\n\nUP NEXT\n\nNets: at Miami on Saturday.\n\nHawks: host Portland on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996429.515125
}