{
  "game_id": "0021300551",
  "espn_id": "400489424",
  "date": "Jan 11, 2014",
  "matchup": "POR vs. BOS",
  "headline": "Trail Blazers send Celtics to 8th straight loss",
  "body": "PORTLAND, Ore. -- For a second consecutive game, the Portland Trail Blazers wiped out a poor first-half performance with a big rally after the break.\nFor the time being, Blazers coach Terry Stotts is all right with that formula.\nLaMarcus Aldridge had 21 points and 13 rebounds Saturday night as the Portland Trail Blazers handed the Boston Celtics their eighth straight loss, 112-104.\n\"I like being a second half team. Given the choice I'd rather be a second half team,\" Stotts said. \"But we're still a work in progress. There's room for improvement (and) we aren't a finished product. We've got to continue to grow incrementally.\"\nEarlier this week, Portland trailed Orlando by six points at halftime then outscored the Magic 65-43 to pull away for the win.\nBoston was Portland's fifth consecutive opponent with a losing record. The Blazers are only 3-2 during this stretch, and in all but one game they struggled during the first half.\n\"Playing teams with a lesser record is apparently tough for us to get up for, but in the end it's good to get a win,\" Stotts said.\nWesley Matthews scored 18 points and Nicolas Batum had 16 for Portland. Damian Lillard and Robin Lopez each had 15 points. Lopez also had 13 rebounds.\n\"It's been a trend like this for the last month. We're getting every team's best shot, so we have to act accordingly,\" Matthews said. \"We have the record of an elite team and we have to act that way.\"\nThe win kept Portland tied for first place with Oklahoma City in the Northwest Division.\nThe Celtics have lost their past three games to the Los Angeles Clippers, Golden State and Portland, all by single digits.\n\"You've got a shot to win against three contenders for the west but, at the same time, those droughts are killing us,\" Boston coach Brad Stevens said. \"I think we can get better in those. But I'm trying to figure what it is because we're really playing at such a high level the whole rest of the time. That's the encouraging part.\"\nAvery Bradley led Boston (13-25) with 25 points. The Celtics, who have lost 11 of 12, shot 62 percent during the first half, but only 34 percent after halftime.\nJared Sullinger had 14 points and 10 rebounds for Boston. Sullinger scored 26 points when the two teams played at Boston in November.\nPortland took control during the third quarter, when the Blazers took their first lead of the game. The 32-point quarter included a run of 13 consecutive points that staked Portland to a 77-68 lead.\nThe Trail Blazers led by as many as 13 points midway through the fourth quarter, then held off a late Celtics run to win their second consecutive game.\nDespite playing its fourth game in five days, Boston started strongly, hitting 14 of 20 shots during the first quarter to take a 32-27 lead. Bradley hit 6 of 7 shots and scored 13 points during the opening period.\nPortland kept close with Boston by hitting six 3-pointers during the first 14 minutes. The Celtics built their lead to double digits at 51-41, then Aldridge made two baskets during the Blazers' run of eight consecutive points, paring the deficit to two points.\nBoston led 60-58 at halftime.\nGame notes\nBlazers owner Paul Allen took in a doubleheader Saturday, attending the Seahawks' NFC divisional playoff game against New Orleans in Seattle during the afternoon, followed by the Blazers game in the evening. Allen owns the Seahawks and Blazers. ... Boston is the only team with a winning record in Portland at 27-25. ... The Blazers play Cleveland at home Wednesday, then tackle their toughest road trip of the season, with games at San Antonio, Dallas, Houston and Oklahoma City. ... Blazers guard C.J. McCollum, the 10th pick of last June's draft, connected on his first NBA career 3-pointer late in the first quarter.",
  "source": "espn_api",
  "crawled_at": 1764992984.1347892
}