{
  "game_id": "0021500464",
  "espn_id": "400828351",
  "date": "Dec 28, 2015",
  "matchup": "MIL @ DAL",
  "headline": "Matthews' late 3-pointers help Mavericks top Bucks 103-93",
  "body": "DALLAS -- The Mavericks took care of the ball and Wesley Matthews made the big shots.\nMatthews scored 22 points, including two clutch 3-pointers in the fourth quarter, and Dallas held off the Milwaukee Bucks 103-93 Monday night.\nMatthews snapped an 89-all tie with a 3 from the right wing with 4:25 to play, then followed Giannis Antetokounmpo's runner at the other end with another 3-pointer with 3:50 remaining.\nDallas got a season-low seven points on 3-of-15 shooting from Dirk Nowitzki. The Mavericks were outrebounded by 18 and even their normally strong free throw shooting was off. And though Dallas never trailed and led by as many as 13 in the second half, Milwaukee rallied to tie the score in the fourth quarter.\n\nBut the Mavericks turned the ball over only four times, tying a franchise low, and outscored the Bucks 26-0 on points after turnovers.\n\"They made a run,\" Matthews said. \"They're playing with energy, too. They're the one team to beat Golden State. Their record is what it is, but they still play hard.\"\nAfter Matthews' second 3, the Bucks didn't score again until Antetokounmpo's layup with 1:11 to play made it 97-93. Devin Harris sealed the game with a layup with 11 seconds left following a loose-ball scramble that included the Bucks' O.J. Mayo crashing over the scorer's table.\nZaza Pachulia had 17 points and eight rebounds for Dallas against his former team.\nJerryd Bayless returned to the Bucks' lineup after missing 11 games with a left ankle sprain and led Milwaukee with 19 points and seven assists.\n\"Usually, your rhythm is not going to be what it was before you got injured; there's a process of getting back in the flow,\" Bucks interim coach Joe Prunty said. \"I thought he did a very nice job of not only getting himself going but getting the team going.\"\nMilwaukee went on a 9-0 run early in the fourth quarter, including two buckets by Bayless, to slice the Mavericks' lead to 83-81. Bayless had eight points in the quarter.\nKhris Middleton's turnaround jumper tied it at 89 with 4:49 to play.\n\"We fought back,\" Bayless said. \"We didn't quit. The whole team didn't quit. We kept on fighting. We just have to do that for 48 minutes.\"\nThe Mavericks helped keep the Bucks in the game with uncharacteristically poor foul shooting. Dallas entered averaging 79 percent, fourth in the NBA, but made just nine of its first 16 from the line and went 17 of 26 (65 percent) for the game.\nPachulia, traded by the Bucks to Dallas in July after the Mavericks were rebuffed by free-agent center DeAndre Jordan, scored 13 points in the first half as Dallas built a 60-51 lead at the break.\nINSIDE INFORMATION\nMilwaukee entered the night third in the NBA with an average of 19.3 points off opponents' turnovers, but the Mavericks protected the ball well thanks in part to the inside knowledge gained from Pachulia's two seasons with the Bucks. \"They have length, but once you move the ball from side to side, that's where they can struggle,\" Pachulia said. \"Whenever we moved the ball, we got quality shots.\"\nGET WELL SOON\nMavericks coach Rick Carlisle said he has traded texts with Bucks counterpart Jason Kidd since Kidd had right hip replacement surgery last Monday. \"That's a hard-charging guy,\" Carlisle said. \"Those of us that got to know him closely know how much he put into each game -- the mental preparation and the physical wherewithal.\" Carlisle coached Kidd on the Mavericks' NBA championship team in 2011 and called him \"one of the great competitors in sports history.\"\nTIP-INS\nBucks: Middleton was ejected with 6.2 seconds to play after getting called for two technical fouls. ... Milwaukee F John Henson was in uniform but did not play after injuring his right elbow Saturday against Toronto.\nMavericks: G Deron Williams missed his third consecutive game with a strained left hamstring. ... Members of Cotton Bowl participants Alabama and Michigan State attended the game.\nUP NEXT\nBucks: At Oklahoma City on Tuesday.\nMavericks: Host Golden State on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994068.541619
}