{
  "game_id": "0021600326",
  "espn_id": "400899768",
  "date": "Dec 07, 2016",
  "matchup": "LAL @ HOU",
  "headline": "Hot-shooting Eric Gordon leads Rockets past Lakers, 134-95",
  "body": "HOUSTON --  The Houston Rockets were determined to make up for losing to the Los Angeles Lakers in their season opener. It was clear from the beginning Wednesday night that things would be different this time around.\n\nEric Gordon made a career-high eight 3-pointers and scored 26 points to help the Rockets cruise to a 134-95 victory.\n\nJames Harden added 25 points in three quarters. The Rockets scored a season high and extended their winning streak to a season-best four games.\n\n\"They have a lot of good road wins and for us that first game we played this season we lost so we wanted a get-back game,\" Harden said.\n\nThe Rockets were up by 12 in the third quarter, then had a  22-6 run to make it 96-68 and put the game out of reach with about 3 minutes left in the quarter. Houston made four 3-pointers and got a nifty one-handed dunk from Clint Capela in that run to pad the lead.\n\nGordon already had four 3-pointers 7 minutes into the first quarter after making each of his first four attempts. It was his seventh straight game with at least four 3-pointers, which is a franchise record.\n\n\"I'm just settling in on my role and my role is definitely to bring a different energy and scoring, playmaking with the second unit,\" he said. \"I'm settling in and it's getting better and better. Teammates look for me and it's just up to me to knock down shots.\"\n\nHouston has its longest winning streak since taking five straight in January.\n\nLou Williams led the Lakers with 24 points. They have lost four in a row, their longest skid of the season.\n\n\"We just didn't play well,\" he said. \"It was just one of those nights where we didn't respond to anything that was going on.\"\n\nThe Rockets led by 18 after a layup by Gordon to start the second quarter. It was the only shot he made that wasn't a 3-pointer. The Lakers got going after that, using a 17-6 run to cut the lead to 51-44 about five minutes before halftime. Brandon Ingram made two 3-pointers in that stretch and Jordan Clarkson capped the run with a 3.\n\nHouston got back on track after that and had pushed the lead to 67-52 with 1.4 second left in the half. Lou Williams cut the deficit after that when he hit a 3-pointer from beyond half court at the buzzer.\n\nTIP-INS\n\nLakers: Coach Luke Walton said D'Angelo Russell (sore left knee) is getting better but he isn't sure when he'll return. ... Williams scored more than 20 points for the ninth time this season. ... Julius Randle added 21 points and 10 rebounds.\n\nRockets: Scored a season-high 43 points in the first quarter. ... Made 15 3-pointers to extend their NBA record of games with at least 10 3s to 21. ... Gordon has scored at least 20 points in four of the last six games. ... The Rockets had 67 points at halftime and have scored at least 60 points in the first half in five of their last seven games. ... Harden had eight assists, six rebounds and four steals.\n\nSO CLOSE\n\nHouston's Patrick Beverley came three rebounds shy of his first career triple-double, finishing with 10 points, seven rebounds and tying a career high with 12 assists. Coach Mike D'Antoni said he kept him in a little longer than the other starters to give him a shot to get it.\n\nHarden joked about the 6-foot-1 Beverley's inability to get those last rebounds.\n\n\"I wanted him to get a triple-double so bad,\" Harden said. \"Every rebound he tried to get he couldn't get it because he's so small.\"\n\nNO EXCUSES\n\nWalton wouldn't make excuses for this lopsided loss despite the Lakers playing without Russell and Nick Young, who is also out with an injury.\n\n\"Obviously, we are missing key players and we are going to lose games, but if we're just sitting around as a team saying we're waiting for this guy or that, that's not the mindset you want ... that's not an acceptable excuse,\" he said.\n\nUP NEXT\n\nLakers: Host Phoenix on Friday night\n\nRockets: Visit Oklahoma City on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995430.678545
}