{
  "game_id": "0022300363",
  "espn_id": "401584991",
  "date": "Dec 19, 2023",
  "matchup": "POR vs. PHX",
  "headline": "Trail Blazers erase 22-point deficit for 109-04 win over Suns",
  "body": "PORTLAND, Ore. -- — DeAndre Ayton had a double-double of 16 points and 15 rebounds, Anfernee Simons had 23 points and seven rebounds, and the Portland Trail Blazers erased a 22-point deficit to beat the Phoenix Suns 109-104 on Tuesday night to snap a seven-game losing streak.\n\n\r\n              The loss for the Suns was their fifth in seven games. Phoenix’s Kevin Durant led all scorers with 40 points while Devin Booker had 26 points and seven assists.\n\n\r\n              Simons' layup with 10.7 seconds left helped stop a late Phoenix rally after Portland pushed their lead to 14 in the 4th quarter. \n\n\r\n              “I was trying to decide whether to go up with two hands or shoot a floater and at the last minute I switched it to a floater,” Simons said of his final basket.\n\n\r\n              Ayton played a game-high 40 minutes and put up a season-high 18 field goal attempts against his former team. The former No. 1 pick downplayed any extra motivation against the team that drafted him.\n\n\r\n              “I’ve just been focused on being a Trail Blazer and establishing who we are in this league,\" Ayton said. \"I’m too focused on that right now. They were just in the way.”\n\n\r\n              Blazers coach Chauncey Billups wanted Ayton focused.\n\n\r\n              “I ran some plays for him early to try and get him aggressive and going,” Billups said. “Of course you will have extra juice against your former team. But I thought the last couple of days that I needed to start playing him more.”\n\n\r\n              Jerami Grant also had 22 points for Portland, while Malcolm Brogdon had 14 points and four assists off the bench. Brogdon started the second half in place of Shaedon Sharpe, who left the game with a groin injury.\n\n\r\n              Portland was hot from the 3-point line all night, making 14 of 28 3-pointers to just five for Phoenix.\n\n\r\n              “They made nine more 3s than we did. It was pretty much even everywhere else,” Durant said.\n\n\r\n              Another reason for Portland’s second half success was taking better care of the ball. Portland had 11 turnovers in the first half, but only six turnovers after halftime.\n\n\r\n              Portland took its first lead since the opening minute of the game at 68-67 with 6:06 left in the third quarter. The Blazers outscored Phoenix 38-20 in the third quarter, helping them take an 87-81 lead into the final frame.\n\n\r\n              The Suns jumped to a 36-20 lead after the first quarter and pushed their lead to as many as 22 in the first half. Phoenix’s defense was the catalyst to their success as they scored 23 points on 17 Blazers turnovers.\n\n\r\n              ------\n\n\r\n              UP NEXT\n\n\r\n              Suns: Play Friday at the Sacramento Kings.\n\n\r\n              Trail Blazers: Host the Washington Wizards on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996588.256489
}