{
  "game_id": "0022000058",
  "espn_id": "401267218",
  "date": "Dec 30, 2020",
  "matchup": "MIL @ MIA",
  "headline": "Heat avenge embarrassment, rally to top Bucks 119-108",
  "body": "MIAMI -- — The Miami Heat engineered a 58-point turnaround against the Milwaukee Bucks in 24 hours.\n\n\r\n                    And just like that, an embarrassing loss was avenged.\n\n\r\n                    Goran Dragic scored 26 points off the bench, Bam Adebayo finished with 22 points, 10 assists and eight rebounds and the Heat beat the Bucks 119-108 on Wednesday night — one day after Milwaukee made an NBA-record 29 3-pointers on the way to a 47-point romp on Miami’s home floor.\n\n\r\n                    “They were better than us last night,\" Dragic said. “Tonight, we had to fight.\"\n\n\r\n                    Tyler Herro scored 21 points and grabbed a career-best 15 rebounds for Miami, which trailed by 14 early in the second half and rallied to get a split of the two-game, two-night series against the team that finished with the NBA’s best record in each of the past two regular seasons.\n\n\r\n                    “Started to feel like Miami Heat basketball again,” Herro said.\n\n\r\n                    Giannis Antetokounmpo had a triple-double — 26 points, 13 rebounds, 10 assists — for the Bucks. Donte DiVincenzo scored 15 and Jrue Holiday 13 for Milwaukee, while Khris Middleton was held to eight on 3-for-15 shooting.\n\n\r\n                    “We need to be more consistent. We need to be better,\" Bucks coach Mike Budenholzer said. “But I think there's positives. We've played well for big stretches of games. We've just got to extend those.\"\n\n\r\n                    Milwaukee is 2/3 this season; the Bucks started 24-3 last season. Milwaukee missed 25 of its last 34 shots on Wednesday, and Miami — perhaps ironically, given how Tuesday went — outscored the Bucks 15-3 from beyond the arc in the fourth quarter.\n\n\r\n                    “Got to figure ourselves out as a team,\" Antetokounmpo said. “We're going to be consistent. ... At the end of the day, we're going to play our game, going to find open shots and hope they fall.\"\n\n\r\n                    Avery Bradley scored 16 and Kelly Olynyk had 15 for Miami.\n\n\r\n                    Milwaukee’s lead was 72-58 early in the second half, 84-73 with 3:44 left in the third. It was all Miami from there, with the Heat — who were without Jimmy Butler for a second straight game because of a sprained right ankle — outscoring the Bucks 40-15 over the next 12 minutes\n\n\r\n                    Herro beat the third-quarter buzzer with a 3-pointer to get Miami within three, Dragic opened the final quarter with another 3 to tie it and the Heat, who trailed by as many as 51 on Tuesday, took the lead for good on a 3 by Olynyk with 9:04 left.\n\n\r\n                    “You want to constantly develop some grit and some toughness during the course of a long season,\" Heat coach Erik Spoelstra said. “And our guys responded in an appropriate fashion.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Brook Lopez, arguing that Adebayo flopped for a foul in the first half, theatrically fell to the court before Adebayo took the ensuing free throws. ... Pat Connaughton scored 12 and Bobby Portis had 11 for Milwaukee.\n\n\r\n                    Heat: Andre Iguodala got his first start as a member of the Heat, meaning for the 17th consecutive year — 2004 through 2020 — he has started at least one game. ... The Heat gave up 21 points in the first 4:15 Tuesday on the way to a 144-97 loss; they set a tone by giving up four in the first 4:15 on Wednesday.\n\n\r\n                    2020 RECORD\n\n\r\n                    Milwaukee finished the calendar year 33-20 (28-15 regular season, 5-5 playoffs). Miami finished 2020 at 36-29 (22-22 regular season, 14-7 playoffs).\n\n\r\n                    4 FOR 4\n\n\r\n                    The Heat have used four starting lineups in their first four games, a franchise first. The only other teams to use four lineups in four games this season: Cleveland and Minnesota. The Bucks have had the same starters in all five games.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Host Chicago on Friday.\n\n\r\n                    Heat: Visit Dallas on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997422.27186
}