{
  "game_id": "0022000031",
  "espn_id": "401267191",
  "date": "Dec 27, 2020",
  "matchup": "LAC vs. DAL",
  "headline": "Mavs destroy Clippers 124-73 to earn 1st win of season",
  "body": "LOS ANGELES -- — Luka Doncic scored 24 points and the Dallas Mavericks led by a NBA-record 50 points at halftime in a 124-73 rout of the Los Angeles Clippers on Sunday to earn their first win of the season.\n\n\r\n                    Josh Richardson added 21 points and Tim Hardaway Jr. had 18 points for the Mavs, who kept up their dominance in the second half, too. \n\n\r\n                    “There’s no huge secret,” Richardson said. “We just got up and played well. We played with a sense of urgency.”\n\n\r\n                    The Clippers trailed 77-27 at halftime, with their 50-point deficit being the largest at the break in the shot-clock era, which began in 1954-55.\n\n\r\n                    Paul George led the Kawhi Leonard-less Clippers with 15 points before sitting out the second half. Serge Ibaka added 13 points and nine rebounds over three quarters of the team's first loss. The Clippers began with victories over the defending NBA champion Lakers and Denver.\n\n\r\n                    “It's not that big of a deal,” George said. “Yes, we got our butts kicked today, but it's one game.”\n\n\r\n                    Los Angeles got outrebounded 32-16, had just three assists, and missed 18 of 19 3-pointers in the first half. George was the only Clipper in double figures with 13 after missing all six of his 3-point attempts. \n\n\r\n                    “It was a tough game, coming from Christmas. I enjoyed my Christmas Day yesterday, today just popped up on me a little too fast,” George said. “I take full responsibility. It'll be a different situation next game. We will be ready.”\n\n\r\n                    Doncic had 18 points, seven rebounds and four assists in the first half. He scored as many points (13) as the Clippers in the first quarter. The Mavs scored nearly every time down the court while forcing the Clippers into 9 of 37 field-goal shooting.\n\n\r\n                    “Everything was clicking on all cylinders,” said Hardaway Jr., adding that the team didn't realize how big the lead was until they were in the locker room at halftime.\n\n\r\n                    Dallas coach Rick Carlisle emphasized staying consistent in the second half.\n\n\r\n                    “The challenge is to maintain that level of competitiveness,” he said. “Our guys established a standard for collective toughness and will that we need to find a way to maintain.”\n\n\r\n                    The Clippers opened the third quarter on a 10-0 run — their biggest spurt of the game — to get within 40 points. The Mavs got right back to putting the hammer down. They connected on four consecutive 3-pointers — three by Hardaway Jr. — to restore their lead to 50. They were ahead 104-57 going into the fourth.\n\n\r\n                    Doncic just missed a triple-double, finishing with nine rebounds and eight assists. He has scored 83 points in his first three games of the season, the first two of which were losses.\n\n\r\n                    “We showed who we are. People judge us like first two games of season, it’s a long season,” Doncic said. “We got to keep going like that. We got to play defense.”\n\n\r\n                    The fourth quarter belonged to the teams' reserves, although the Clippers kept Luke Kennard, who started in place of Leonard, in the rotation for a bit. The Mavs' bench was on its feet and whipping towels in the air to celebrate Josh Green's one-handed fastbreak dunk that extended their lead to 53 points.\n\n\r\n                    Former Clipper Boban Marjanovic polished off a 12-0 run with a jumper that pushed the Mavs' lead to 120-63, their largest of the game.\n\n\r\n                    “We weren’t letting each other look up at the score,\" Mavs forward James Johnson said.\n\n\r\n                    The Mavs shot 49% from the field, made 14 3-pointers and outrebounded the Clippers 54-36 in the game. Los Angeles had 13 assists after notching 32 against Denver on Christmas. The Clippers shot 26 of 76 from the floor and made just 4 of 33 3-pointers.\n\n\r\n                    “You throw it away,” first-year Clippers coach Tyronn Lue said. “Our guys didn’t have a lot of pop on either end of the floor.”\n\n\r\n                    Leonard sat out after needing eight stitches in his mouth after accidentally getting elbowed by the 7-foot Ibaka going for a rebound in Friday’s win at Denver. He watched the debacle from the bench.\n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: They won for the first time in three road games to start the season. Eleven of their first 16 games are being played away from home. ... Owner Mark Cuban walked to the opposite baseline to bump arms with his Clippers counterpart Steve Ballmer before the game. They each had a lone chair next to the baskets at either end. Cuban acted as a ball boy when the team came onto the floor for pre-game warmups, tossing balls to players and clapping his hands.\n\n\r\n                    Clippers: After having 32 assists against Denver on Christmas night, they had just 13. ... F Marcus Morris Sr. (knee soreness) missed his third straight game. They swept the Mavs last season, winning all three meetings as the visiting team, including a first-round playoff victory. \n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: Host Charlotte on Wednesday.\n\n\r\n                    Clippers: Host Minnesota on Tuesday in the second of three straight home games.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997710.666427
}