{
  "game_id": "0021800287",
  "espn_id": "401070968",
  "date": "Nov 25, 2018",
  "matchup": "DET vs. PHX",
  "headline": "Pistons pull away in 4th to beat Suns 118-107",
  "body": "DETROIT --  Dwane Casey is a little perplexed by his team's performance in afternoon games.\n\n\"We've got to drink some coffee in the morning, wake up a little bit earlier,\" the Detroit coach said. \"Wake up a little bit earlier, have a 6 o'clock-in-the-morning shootaround, something to get us going.\"\n\nFor three quarters Sunday, the Pistons seemed content to trade baskets with lowly Phoenix, but Detroit finally went on a 15-3 run in the fourth and beat the Suns 118-107. Andre Drummond had 19 points and 16 rebounds, and Blake Griffin added 16 points and 11 assists for the Pistons.\n\nDevin Booker scored 37 points for Phoenix, and rookie Deandre Ayton had a season-high 25 points with 13 rebounds. Reggie Jackson had 19 points and eight assists for the Pistons.\n\nPhoenix forward T.J. Warren was ejected in the second quarter after receiving two technical fouls following an offensive foul that was called against him.\n\n\"I'm not going to make any comments about the call, but I think T.J. overreacted and the official had to use his judgment,\" Suns coach Igor Kokoskov said. \"I told him that T.J. is one of the nicest people in the world and that was out of character, but he's judging what is happening in the moment. T.J. can take one, but you can't take two and hurt the team.\"\n\nThe Pistons lost afternoon games against Philadelphiaand Charlotte earlier this month. Sunday's matchup tipped off shortly after 4 p.m. Booker scored 21 points in the first half, but the Pistons led 62-60 after two quarters.\n\nIt was close throughout the third and still tied at 88 early in the fourth. Then Langston Galloway made a 3-pointer that began Detroit's crucial run. Jackson and Stanley Johnson also made 3s during that stretch.\n\n\"It's always tough to win on the road, obviously, but we did some different things to try to keep them off balance a little bit, but then they kind of adjusted,\" Phoenix's Jamal Crawford said. \"From that point, they made shots and our shots became a little bit tougher.\"\n\nBooker scored the first seven points of the second half for Phoenix, then didn't have a field goal until he made a 3-pointer to end the Detroit run in the fourth.\n\n\"There's really no stopping him,\" Johnson said. \"I go out there and try to slow him down and get a little more physical with him.\"\n\nON THE LINE\n\nDrummond has improved his free throws quite a bit, but he went just 1 for 8 on Sunday, including an airball in the fourth quarter.\n\nPhoenix tried fouling him intentionally in the fourth, but the Suns couldn't capitalize on his misses that much.\n\nEFFICIENT\n\nAyton came into the game shooting 61 percent from the field, and the rookie big man went 11 of 13 against Detroit. It was his 11th double-double.\n\nTIP-INS\n\nSuns: Crawford scored 12 points, surpassing 19,000 for his career. ... Booker scored 30-plus points for the fourth time this season.\n\nPistons: Detroit is without G Luke Kennard, who has been recovering from a sprained right shoulder. ... Galloway scored 15 points and Johnson added 14. ... The Pistons have won six of their last eight. ... Detroit tied a season high with 30 assists.\n\nUP NEXT\n\nSuns: Host Indiana on Tuesday night.\n\nPistons: Host New York on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994710.617606
}