{
  "game_id": "0021700866",
  "espn_id": "400975612",
  "date": "Feb 15, 2018",
  "matchup": "MIN vs. LAL",
  "headline": "Gibson, Butler lead Timberwolves rally past Lakers, 119-111",
  "body": "MINNEAPOLIS --  The Minnesota Timberwolves were flat, facing a double-digit deficit for long stretches of the game.\n\nThis is why they traded for Jimmy Butler and signed Taj Gibson, for fourth-quarter lifts like these.\n\nGibson scored a season-high 28 points and Butler added 24, providing the Timberwolves with the production and energy for a 119-111 comeback victory over the Los Angeles Lakers on Thursday night.\n\nButler and Gibson, the former Chicago teammates, muscled their way to the basket with a fierce determination down the stretch. Butler drove along the baseline and flicked a short pass to Gibson in the lane, where he dropped in a layup and converted a three-point play for a 110-104 lead with 3:59 left.\n\n\"What he and Jimmy have brought to the team has really changed things for us,\" said Wolves coach Tom Thibodeau, who had them both with the Bulls. \"Those guys, they weren't going to let us lose.\"\n\nJeff Teague pitched in 20 points and Jamal Crawford added 15 for the Timberwolves, who rallied from a deficit as large as 15 points in the second quarter and 12 points late in the third to raise their home record to 24-7 on an emotional evening that started with a tribute to former coach and executive Flip Saunders.\n\nExcept the Lakers had the mojo for much of the first three quarters. Julius Randle had 23 points and nine rebounds, and Kentavious Caldwell-Pope and Brandon Ingram each scored 17 points.\n\n\"I know how good we can be when we decide to play hard,\" Butler said. \"But we think that we're so good on paper that we can just go through the motions.\"\n\nIvica Zubac, who went 8 for 8 from the floor for a season-high 19 points, threw down a dunk for a 99-98 lead for the Lakers, but that was essentially their last momentum-creating play of the game.\n\n\"They've got some big-time closers on that team, starting with Jimmy Butler,\" Lakers coach Luke Walton said. \"He kind of set the tone in the fourth with the way he played.\"\n\nButler blocked shots by Randle and Isaiah Thomas on consecutive possessions in the closing minutes, putting his stamp on yet another winning performance.\n\n\"I think that's what separates him as a superstar,\" Crawford said. \"Most guys, they do it on one end, but those types of plays, they're immeasurable.\"\n\nThis was a win the Wolves badly needed before the All-Star break, after their 13-game home winning streak ended in humbling fashion on Tuesday against Houston. They moved within percentage points of San Antonio for third place in the Western Conference at 36-25. The Spurs are 35-24.\n\nThe Lakers shot so sharply to start the game, going 17 for 27 from the floor in the first quarter, that the Wolves produced separate spurts of 23-8 and 21-6 in the first half yet still trailed 65-62 at halftime.\n\nRandle had 10 points in the third quarter as the Lakers again pushed ahead. He drove and scored on Karl-Anthony Towns for an 86-76 lead, and a frustrated Towns was called for an offensive foul on Brook Lopez to erase a spin-move layup on the next possession.\n\nBut Crawford got the Wolves and the crowd going early in the fourth quarter, sandwiching a 31-foot swish by Tyus Jones with a pair of 3-pointers of his own. The second one came off a slick crossover dribble that deked Corey Brewer at the top of the key and brought the Wolves within 95-94.\n\nTIP-INS\n\nLakers: Zubac, who grabbed 11 rebounds, had only 23 points in 17 previous games. ... The recently acquired Channing Frye was not with the team to tend to personal matters, according to Walton. Frye made his Lakers debut on Wednesday against the Pelicans, with three points in 11 minutes.\n\nTimberwolves: Towns narrowly notched his NBA-leading 51st double-double, with 10 points on 2-for-9 shooting to go with his game-high 19 rebounds. ... After tying his season low with seven points on 2-for-14 shooting on Tuesday against the Rockets, Andrew Wiggins finished with a quiet eight points on 4-for-11 shooting, with four rebounds and no assists.\n\nFLIP, FONDLY REMEMBERED\n\nThe Timberwolves unveiled a banner from the rafters of the arena to permanently recognize the impact that Saunders, who died in 2015 of complications from cancer, had on the franchise. Former players Chauncey Billups, Sam Cassell, Troy Hudson, Latrell Sprewell, John Thomas and Gary Trent were on hand, along with Mark Madsen, now a Lakers assistant. Kevin Harlan, the original Timberwolves television play-by-play announcer who later called the game for TNT, emceed the on-court ceremony. Timberwolves assistant coach Ryan Saunders and his three sisters flanked their mother, Debbie Saunders, as she addressed the crowd.\n\n\"He would also want to tell you how fortunate he felt to have known you,\" she said. \"You all contributed things to his life. Keep up your kindness.\"\n\nBALL, BACK SOON\n\nLakers rookie point guard Lonzo Ball missed his 15th straight game with a sprained medial collateral ligament in his left knee, but he's nearing a return.\n\n\"It's going to be really fun to have him out there pushing the basketball and him putting guys in different spots and giving confidence to other guys,\" Ingram said.\n\nUP NEXT\n\nLakers: Host Dallas on Feb. 23 after the NBA All-Star break, their only home game in a 24-day span.\n\nTimberwolves: Visit Houston on Feb. 23 following the seven-day layoff, a rematch with the Rockets after the 18-point loss here on Tuesday.\n\n---\n\nFor more AP NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992618.169237
}