{
  "game_id": "0021801137",
  "espn_id": "401071810",
  "date": "Mar 30, 2019",
  "matchup": "BKN vs. BOS",
  "headline": "Russell's 20-point 3rd leads Nets over Celtics 110-96",
  "body": "NEW YORK --  After a rough road trip put their playoff hopes in jeopardy, the Brooklyn Nets needed something good to happen when they got home.\n\nIt came in the third quarter, which is when D'Angelo Russell usually punishes the Celtics.\n\nRussell scored 20 of his 29 points in another blistering third quarter against the short-handed Celtics, leading the Nets to a 110-96 victory on Saturday night.\n\n\"There's two halves in the game. The first half was a little suspect, the turnovers, the shot selection. I just knew I had to tighten up,\" Russell said.\n\nBack from a seven-game trip that lasted more than two weeks, the Nets had a happy homecoming thanks largely to their All-Star point guard, who added 10 assists and finished with 25 points after halftime.\n\nIt was the third straight time he hurt the Celtics in the third quarter, and the Nets needed this one after going 2-5 on the road and dropping into seventh place in the Eastern Conference.\n\n\"I told you, man, every one is going to be worth it,\" Russell said. \"We need it, scratching and clawing for every one of them.\"\n\nCaris LeVert added 15 points for the Nets, who had dropped the final two games of the trip and still face a tough stretch now that they're home.\n\n\"We know that all these games coming up are playoff games,\" Nets coach Kenny Atkinson said. \"It's just how we have to look at it. We're in it. We can't shy away from it. They're all playoff games, but it was important to get this one.\"\n\nGordon Hayward scored 19 points for the Celtics, who rested Kyrie Irving and Al Horford on the second night of back-to-back games after a big victory over Indiana a night earlier.\n\nThey led early and trailed by only one at halftime before Russell heated up.\n\nRussell hit his first 3-pointer of the game to open the scoring in the second half, and soon after he would take over. Mixing in mid-range jumpers with 3-pointers, he scored 14 points during Brooklyn's 17-5 surge that extended a seven-point lead to 76-57.\n\n\"He's tough to guard when he's able to shoot from outside and I thought we did a pretty decent job on him there in the first half,\" Hayward said. \"Then he kind of just caught fire.\"\n\nRussell previously had 18-point and 14-point third quarters against the Celtics this season, and Boston couldn't do anything about him this time, either.\n\n\"That was disappointing. That was something that we were obviously honed in on from the last few times we've played them,\" Celtics coach Brad Stevens said.\n\nThe Nets were held to 17 points in the first quarter, just one above their season worst, and trailed by four. Boston then opened the second with seven straight points to make it 28-17, but Brooklyn put together a good finish to the half to pull ahead 49-48 at the break.\n\nTIP-INS\n\nCeltics: Jayson Tatum, who was listed as questionable after feeling ill Friday night and earlier Saturday, started and scored nine points in 30 minutes. ... Marcus Morris and Daniel Theis each scored 16 points.\n\nNets: The Nets have won four straight at home. ... Starting F Rodians Kurucs missed the second half with a bruised right knee.\n\nSTREAK OF 3s\n\nRussell has made a 3-pointer in 56 straight games dating to Nov. 25, passing James Harden and Paul George for the longest streak in the NBA this season.\n\nGOOD GUARDS\n\nIrving and Russell are the only two players in the East averaging at least 20 points and seven assists.\n\nUP NEXT\n\nCeltics: Host Miami on Monday.\n\nNets: Host Milwaukee on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995387.2980428
}