{
  "game_id": "0021500554",
  "espn_id": "400828441",
  "date": "Jan 09, 2016",
  "matchup": "TOR @ PHI",
  "headline": "Lowry, DeRozan lead Raptors to 108-95 win over 76ers",
  "body": "PHILADELPHIA -- Even after his team's latest win, Raptors coach Dwane Casey was looking for more from his players.\nKyle Lowry scored 10 of his 25 points in the fourth quarter and DeMar DeRozan added 19 to lead Toronto to a 108-95 victory over the Philadelphia 76ers on Saturday night.\n\"There are areas we need to improve,\" Casey said. \"For where we're trying to get to, it's not just to win but we've got to continue to improve because we have bigger fish to fry. I'm the only Debbie Downer in the group.\"\nJonas Valanciunas had 17 points for the Atlantic Division leaders, who will go for their fourth straight victory when they wrap up a six-game road trip against Orlando on Thursday in London.\nCasey thinks the trip overseas is a perfect opportunity for some fine-tuning.\n\"Hopefully, we'll use this trip to England as a mini training camp sort of situation,\" he said. \"We have a lot of things to get better.\"\nThe 76ers thought the Raptors were plenty good.\n\"That might be a deep playoff team,\" Philadelphia coach Brett Brown said.\nIsh Smith scored a career-high 28 points and rookie Jahlil Okafor had 19 for Philadelphia, which dropped to 4-35. The 76ers have lost 11 straight games to Toronto.\n\"We were too far behind the 8-ball and they just kept punishing us,\" Smith said.\nToronto led by as many as 15 in the third quarter before the 76ers used a 9-0 run over the final 4:17 to close to 75-69 entering the fourth.\nLowry had the first six points of a 9-4 Toronto spurt to open the final period, capped by Patrick Patterson's 3-pointer with 8:47 remaining, that pushed the Raptors' lead back to 84-73.\nThe 76ers never threatened from that point.\nPhiladelphia scored the game's first 12 points as the Raptors missed their first seven field goal attempts.\nThe Sixers' advantage was 38-34 after Isaiah Canaan drained a pair of 3-pointers within 9 seconds of each other, both on assists from T.J. McConnell, with 6:48 remaining in the first half. But consecutive highlight-reel dunks by DeRozan started the Raptors on a 23-6 run to close the half, giving Toronto a 57-44 lead at the break.\nDeRozan first dunked over Okafor with force before finishing a reverse alley-oop after a pass from Lowry.\nLOWRY'S HOMECOMING\nLowry, a Philadelphia native and standout at nearby Villanova in college, received loud cheers during introductions.\n\"I just want to make sure I do my job in front of family and friends and make sure my team comes out with a victory,\" he said. \"It's always fun here.\"\nPUT A BLANKET OVER THEM\nBrown relayed associate head coach Mike D'Antoni's analogy about the difficulty of playing the Raptors.\n\"It's like when you sleep and you have a blanket and it's too short,\" Brown said. \"You pull it up and your feet are cold, and you pull it down and your chest is cold. We were always trying to put out fires.\"\nMR. SMITH GOES SCORING\nBrown called out the team's effort following Thursday's 126-98 home defeat against Atlanta and then again at halftime on Saturday, and Smith took it personally.\n\"When he challenges us like that, I take that personal and I try to play with some kind of will and heart,\" he said.\nThe Raptors weren't surprised by Smith's success.\n\"His speed is undeniable and now he's knocking down his jump shot,\" Casey said. \"He's a handful. Philly's got a gem in him.\"\nLONDON CALLING\nLowry said the team is looking forward to visiting England.\n\"We're excited to be in another country, and to grow our individual brand and NBA brand is a pleasure and an honor,\" he said. \"Everybody understands it's a business trip, but take the experience in. But we have to make sure we go out and play the game.\"\nAsked about Casey's reference to a mini training camp, Lowry joked, \"I wouldn't say mini training camp because if we are going to have a mini training camp, I might not take that trip.\"\nTIP-INS\nRaptors: Terrence Ross was back in the lineup after leaving in the fourth quarter of Friday's 97-88 win over Washington with a lower back injury. He had 16 points. ... After committing a season-high 23 turnovers against the Wizards, Toronto turned it over 13 times against Philadelphia. ... Toronto has won 17 straight games when holding opponents under 100 points.\n76ers: Philadelphia last beat the Raptors on Jan. 18, 2013, 108-101 in overtime. ... The 76ers are 1-2 on a six-game homestand.\nUP NEXT\nRaptors: Against Orlando in London on Thursday.\n76ers: Host Cleveland on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764994736.407186
}