{
  "game_id": "401809798",
  "espn_id": "401809798",
  "date": "Nov 21, 2025",
  "matchup": "GS vs POR",
  "headline": "Avdija, Clingan get double-doubles as Trail Blazers beat Warriors 127-123",
  "body": "SAN FRANCISCO -- — Deni Avdija had 26 points, a career-high 14 assists and six rebounds as the Portland Trail Blazers held off the Golden State Warriors 127-123 in the NBA Cup on Friday night.\n\n\r\n              Avdija shot only 6 for 14 from the floor but made 12 of 13 free throws, including two with 9.8 seconds remaining as the Trail Blazers beat the Warriors on the road for the first time since Jan. 1, 2021.\n\n\r\n              Donovan Clingan had a career-high 22 points and 10 rebounds. Caleb Love scored 26 points, Toumani Camara added 20 and Sidy Cissoko scored 15.\n\n\r\n              Portland led the entire fourth quarter but Golden State kept it close behind another mercurial night from Stephen Curry. The two-time MVP scored 38 points and made nine 3-pointers, two in the final minutes to keep the Warriors close.\n\n\r\n              Trailing 115-111 with 4:08 remaining, the Warriors missed a chance to get closer when Butler was called for an offensive foul while battling for a rebound. Golden State coach Steve Kerr challenged but the call was upheld.\n\n\r\n              Butler scored 20 points and Brandin Podziemski each scored 20 points. Draymond Green had 11 points and eight rebounds in the Warriors’ third consecutive loss.\n\n\r\n              Portland is 2-1 in Cup play, while the Warriors are 1-2.\n\n\r\n              Prior to the game the Warriors celebrated the 50th anniversary of their 1975 championship, with several players from that team including Hall of Famer Rick Barry attending.\n\n\r\n              Portland got off to a quick start behind Camara and Clingan, who combined for 16 points and six rebounds in the first quarter \n\n\r\n              Curry and the Warriors turned the tables with a 44-point second quarter. Curry made five 3-pointers and was 6-for-6 to help Golden State to a 72-65 lead at the break.\n\n\r\n              Up next\r\n              Trail Blazers: Play the Thunder in Oklahoma City on Sunday.\n\n\r\n              Warriors: Face the Jazz at home Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042672.993205
}