{
  "game_id": "0021800425",
  "espn_id": "401071106",
  "date": "Dec 14, 2018",
  "matchup": "MEM vs. MIA",
  "headline": "Richardson, Olynyk lead late rally as Heat beat Grizzlies",
  "body": "MEMPHIS, Tenn. --  The Miami Heat didn't let a bad loss in their last game linger to the point of making a six-game road trip more troublesome.\n\nRelying on 3-point shooting during a 13-2 run in the middle stages of the fourth quarter, the Heat went on to beat the Memphis Grizzlies 100-97 on Friday night, snapping a two-game skid.\n\nThe Heat were coming off a 111-84 loss on Wednesday night at Utah -- a performance coach Erik Spoelstra called the team's \"worst game of the year.\" Instead of moping about the 27-point defeat, Miami fought through against the physical, slow-paced Memphis-style game.\n\n\"It's big for us, just to come back, to bounce back,\" reserve forward Kelly Olynyk said. \"We had a really tough one at Utah. ... It's big for us to come back and grind one out and get a win.\"\n\nOlynyk and Josh Richardson led the Heat with 18 points apiece. Olynyk had 10 in the fourth, including a pair of 3-pointers, while Derrick Jones Jr., added nine of his 13 points in the final quarter as Richardson joined four reserves playing the last 12 minutes.\n\nOlynyk converted a pair of free throws with 7.2 seconds left, creating a 100-94 lead -- enough of a buffer as Marc Gasol's 3-pointer with 1.5 left wasn't enough for Memphis to overtake Miami.\n\n\"You can just point to character,\" Spoelstra said, adding that when his team arrived on a rainy Thursday night in Memphis, they went into the gym to \"expel the demons of the Utah game and then prepare for a game we knew would be extremely physical.\"\n\nMike Conley led Memphis with 22 points, while Jaren Jackson Jr. and Garrett Temple contributed 15 points apiece. Gasol finished with 14 points, but was 6 for 16 from the field, including missing four of his five shots from beyond the 3-point arc as part of Memphis shooting 42 percent for the game.\n\nTyler Johnson added 17 for Miami, and -- like Olynyk -- was 4 of 7 on 3s as Miami went 15 for 39 from beyond the arc, compared to Memphis making 8 of 29.\n\nCoach J.B. Bickerstaff noted that the plays that carried Memphis to a 92-83 win over Portland on Wednesday -- defensive rebounding, extra-effort plays and other factors -- were missing against the Heat.\n\n\"They made more of them than we did,\" Bickerstaff said. \"Fourteen offensive rebounds. You get a stop and then you give that back up. Eleven more team rebounds, that's just too many possessions.\"\n\nTIP-INS\n\nHeat: G Goran Dragic missed his second straight game with a lingering knee injury. ... C Hassan Whiteside, who missed the previous four games for the birth of his first child returned to action. .Miami had 30 assists in the game, the most by a Grizzlies opponent this season. Richardson had seven of the assists.\n\nGrizzlies:. Temple banked in a 33-foot shot to end the second quarter, cutting the Miami lead to 51-49 at the half. ... Memphis was whistled for three technicals in the game -- Gasol, JaMychal Green and Bickerstaff. ... F Kyle Anderson left the game in the fourth quarter with an injured left ankle. He did not return. .Held the Heat to seven points under their season average of 107.2.\n\nWADE SITS\n\nHeat veteran Dwyane Wade sat out the game with \"general soreness.\" Spoelstra said the team would re-evaluate his status Saturday. With Wade playing in the Eastern Conference and the veteran announcing his retirement at the end of this season, Memphis fans missed their last opportunity to see the 15-year veteran. Memphis is one of only three teams against which Wade has not scored 500 career points. He has 481 against the Grizzlies. Wade has failed to reach 500 career points against only two other teams -- Dallas and San Antonio. He will get one more opportunity to reach the milestone when the teams play in Miami on Jan. 12.\n\nTRADE Of CONFUSION\n\nThere were rumblings at the end of the game that the Grizzlies were involved in a three-team trade with the Wizards and Suns. But the negotiations were unclear which Brooks the Grizzlies were trading -- guard MarShon Brooks or forward Dillon Brooks, who has been out with a knee injury. Eventually, the confusion led to the deal falling apart completely.\n\nUP NEXT\n\nHeat: At New Orleans on Sunday to finish a six-game road trip.\n\nGrizzlies: Host Houston on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994932.616054
}