{
  "game_id": "0021500497",
  "espn_id": "400828384",
  "date": "Jan 02, 2016",
  "matchup": "OKC @ CHA",
  "headline": "Durant scores 29 points, Thunder beat Hornets 109-90",
  "body": "CHARLOTTE, N.C. --  Kevin Durant and Russell Westbrook got a major boost from the Oklahoma City bench Saturday night.\n\nDurant had 29 points and 11 rebounds, and Westbrook added 16 points for the Thunder in their 109-90 victory over the Charlotte Hornets.\n\nOklahoma City held off Charlotte's third-quarter rally in winning its fourth straight game -- and 10th in a row against the Hornets dating to the 2010-2011 season.\n\n\"I thought we got some really, really good and positive contributions from the bench,\" Thunder coach Billy Donovan said. \"I've always said it starts with Russell (Westbrook) and Kevin (Durant), and they do a great job of that. Our bench came in and kind of kept it going, which was good to see.\"\n\nThe Hornets are tied for the Eastern Conference lead and rank fifth-best in the NBA in bench scoring at 39.1 points per game. But on Saturday, it was Oklahoma City's bench outscoring Charlotte's reserves 42-22.\n\nOklahoma City backups Enes Kanter and Anthony Morrow had 12 points apiece, and Dion Waiters scored 10 for the Thunder.\n\n\"We just wanted to maintain and sustain it,\" said Morrow, a Charlotte native. \"Guys were moving the ball. We realized what they were trying to do to us defensively.\"\n\nKemba Walker scored 32 points, Jeremy Lin added 15 and P.J. Hairston had 10 for the Hornets, who lost their third straight.\n\nBut Charlotte was missing starter Nicolas Batum, who sat out with a sore toe. He underwent an MRI earlier Saturday, and his status is game-to-game, according to Hornets coach Steve Clifford.\n\n\"The reality is this: Since Christmas, we've just really lost our way defensively,\" Clifford said. \"Obviously, we are missing some guys, but our energy level is good. It's just our defense and rebounding.\n\n\"When we start to get our defense going again, then we'll win again. But you can't give up 109 a night and play well consistently.\"\n\nStill, Charlotte made a run in the third quarter, cutting a 12-point Oklahoma City lead to two.\n\nDown 66-54 at the break, the Hornets scored nine unanswered points to pull to 66-64 with 9:45 remaining in the third. But the Thunder responded with a 12-2 spurt to push their lead back to double digits.\n\n\"They were going to make a run,\" Westbrook said. \"We did a good job of sticking together, regardless of what was going on. We stuck to our principles, and got some stops.\"\n\nOklahoma City extended its advantage to 20 late in the fourth, going up 107-87 on Serge Ibaka's jumper with 2:54 left.\n\nTIP-INS\n\nThunder: Ibaka finished with 14 points. . Finished shooting 44.3 percent from the field (35 of 79) and 9 of 23 on 3-pointers. ... Had a 53-34 rebounding advantage. . Also had a season-high 15 blocked shots, with four each by Durant and Ibaka.\n\nHornets: Had a season-low four turnovers, three of those occurring in the fourth quarter. . Also had a season-best seven blocked shots. . Shot just 34.5 percent from the field (29 of 84) and went 6 of 22 on 3-pointers.\n\nON THE LINE\n\nThe Thunder and Hornets combined for 71 free throws. Oklahoma City went 30 of 37 from the line (81.1 percent), while Charlotte was 26 of 34 (76.5 percent). Ibaka was 10 of 10 on free throws. Walker went 11 of 12, Durant 10 of 11 and Westbrook 7 of 8.\n\nTEED UP\n\nThe Hornets were whistled for two technical fouls, the second time this season they've picked up two or more in a game. Walker was called for a technical late in the second quarter, and Lin picked one up early in the fourth.\n\nUP NEXT\n\nThunder: Host Sacramento on Monday night.\n\nHornets: Visit Golden State on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994182.747669
}