{
  "game_id": "0022400949",
  "espn_id": "401705515",
  "date": "Mar 12, 2025",
  "matchup": "HOU vs. PHX",
  "headline": "Green leads Rockets past Suns in game marred by fight between Adams, Plumlee",
  "body": "HOUSTON -- — Jalen Green had 29 points to lead the Houston Rockets to a 111-104 victory over the Phoenix Suns on Wednesday night in a game where Houston’s Steven Adams and Phoenix’s Mason Plumlee were ejected for fighting.\n\n\r\n              Alperen Sengun scored 20 points and Dillon Brooks added 19 to help the Rockets extend their winning streak to four.\n\n\r\n              Bradley Beal's two free throws got the Suns within eight with about 9 1/2 minutes to go before Houston used a 9-2 run to make it 99-84 with about seven minutes remaining. Jock Landale opened the run with a 3-point play and Brooks capped it with a layup after a turnover by Devin Booker. \n\n\r\n              Adams and Plumlee were ejected before halftime after getting into a fight where Adams wrestled Plumlee to the court\n\n\r\n              Beal had 25 points and Booker and Kevin Durant added 19 each as the Suns lost for the third time in four games.\n\n\r\n              Takeaways \r\n              Suns: Phoenix trailed for double digits for most of this one, a game after going to the wire in a 120-118 loss at Memphis on Monday night.\n\n\r\n              Rockets: Fred VanVleet had 10 points in 28 minutes in his return after missing 16 games with a right ankle strain. Houston needs him to return to form quickly as the team looks to finish the regular season strong and try to move up in the standings.\n\n\r\n              Key moment\r\n              The big run by the Rockets in the fourth that allowed them to pad the lead.\n\n\r\n              Key stat\r\n              The Suns made just 10 3-pointers Wednesday night after they made 20, with a season-high seven from Durant, on Monday night.\n\n\r\n              Up next\r\n              Both teams play Friday night. Phoenix hosts Sacramento, and Houston hosts Dallas.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997355.6459572
}