{
  "game_id": "0022300139",
  "espn_id": "401584767",
  "date": "Nov 04, 2023",
  "matchup": "CHI @ DEN",
  "headline": "Jokic just shy of triple-double, Porter scores 27 to lead Nuggets over Bulls 123-101",
  "body": "DENVER -- — Nikola Jokic had 28 points, 16 rebounds and nine assists, Michael Porter Jr. scored a season-best 27 and the Denver Nuggets overcame the loss of point guard Jamal Murray to beat the Chicago Bulls 123-101 on Saturday night.\n\n\r\n              Aaron Gordon had 15 points and 12 rebounds for defending NBA champion Denver, which has won all four of its home games.\n\n\r\n              Murray played the first 8:40 before leaving with right hamstring tightness. He finished with two points and two rebounds. Reggie Jackson, getting extended minutes in place of Murray, scored 16 off the bench, tying his season high.\n\n\r\n              “Tried to adapt to the environment,” Jackson said of playing with the starters. “Just figure out how to not mess it up and then be aggressive in the spots that I can be aggressive in. That group really knows how to play off each other, so you have to be in the proper spacing and it makes it easy.”\n\n\r\n              Murray walked out of the arena after the game with a slight limp. Denver coach Michael Malone had not spoken with the training staff before addressing the media but said “you always worry about those kinds of injuries because they can stick around for a while.”\n\n\r\n              Nikola Vucevic had 19 points, DeMar DeRozan scored 17 and Jalen Carter added 16 for Chicago, which has dropped three straight. Zach LaVine was held to 12 points on 4-of-12 shooting.\n\n\r\n              The Bulls shot 45.3% for the game but allowed the Nuggets to hit 70% in the fourth quarter.\n\n\r\n              “I feel good when Zach shoots the ball, when Vuc shoots the ball or DeMar shoots the ball,” Chicago coach Billy Donovan said. “I’d be concerned the quality and number of shots.”\n\n\r\n              The Bulls won the previous meeting in Denver, 117-96 on March 8, and took a two-point lead at halftime of this one. The Nuggets opened the third quarter on a 21-4 run to go ahead 72-57 and led by 18 before Chicago cut it to 86-76 early in the fourth.\n\n\r\n              Denver extended the lead to 16, but the Bulls made it 101-90 on a 3-pointer from Carter before the Nuggets went on a 10-1 run to put it away.\n\n\r\n              Both teams were coming off their first game of the NBA In-Season Tournament on Friday and looked as though they had played the previous night in the first quarter. Denver was 1 of 8 from 3-point range and the Bulls committed four turnovers, but both teams warmed up.\n\n\r\n              For the game, the Nuggets shot 44.4% from behind the arc and Chicago turned it over just seven times in the final three quarters.\n\n\r\n              RARE SIGHTINGS\n\n\r\n              Nuggets backup center DeAndre Jordan made his season debut to go head-to-head with Andre Drummond, Chicago’s burly big man off the bench. Jordan has not played much since joining Denver before last season, instead serving as a veteran presence in his 16th season. He had one point in 12 minutes.\n\n\r\n              Collin Gillespie, who missed last season with an injury, also saw some court time with Murray out and scored his first NBA points on a layup midway through the third quarter. His first career 3-pointer late in the fourth gave Denver a 23-point lead.\n\n\r\n              “It was fun being out there for the first time playing real NBA minutes,” Gillespie said. “Step in for (Jamal) and do whatever I could do to help the team win.”\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host the Utah Jazz on Monday night.\n\n\r\n              Nuggets: Host the New Orleans Pelicans on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995920.5534878
}