{
  "game_id": "0021200258",
  "espn_id": "400277978",
  "date": "Dec 05, 2012",
  "matchup": "POR @ IND",
  "headline": "Pacers stifle Trail Blazers' offense to move above .500",
  "body": "INDIANAPOLIS --  A few different versions of Paul George have been showing up lately for the Indiana Pacers. The dominant one made an appearance Wednesday night against Portland.\n\nGeorge scored 22 points to help Indiana beat the Trail Blazers 99-92 on Wednesday night.\n\nGeorge, Indiana's No. 2 scorer this season, has been inconsistent. He scored four points at Sacramento and went scoreless at Golden State before exploding for 34 points at Chicago on Tuesday night.\n\nHe followed that by scoring 14 of his 22 points in the second half against the Trail Blazers.\n\nThe question remains whether the talented 22-year-old is just teasing the Pacers with the back-to-back strong efforts.\n\n\"You just watch him and some of the shots that he's making and you think, `Boy, if he could ever stabilize and do this on a consistent basis,\" Indiana coach Frank Vogel said.\n\nGeorge doesn't worry about the consistency issue as much as Vogel does.\n\n\"I don't look at it like that anymore,\" George said. \"I just come out and play. I feel like I'm preparing myself well enough to just go out and play, take the shots that are there and be confident in those shots.\"\n\nGeorge Hill added 18 points and David West had 16 points and 10 rebounds for the Pacers (10-9) , who have won four of five and moved above .500 for the first time since a 2-1 start. Indiana, the league leader in scoring defense, held the Blazers to 43 percent shooting.\n\n\"We guarded,\" Vogel said. \"We try to take pride in being the best defensive team in the NBA and we got after it. By getting stops we were able to get out and break a little bit and get some easy baskets.\"\n\nDamian Lillard led Portland (8-11) with 23 points. Though the Pacers were strong defensively overall, they had no answer for the rookie, who constantly blew past his defenders.\n\n\"He was the focal point of our defense tonight,\" Vogel said. \"We knew we had to contain Lillard and he still got off on us. He had a great night and he's a special talent and he has a bright future ahead of him.\"\n\nWesley Matthews scored 19, LaMarcus Aldridge had 18 points and 10 rebounds, and J.J. Hickson had 14 points and 12 rebounds for the Trail Blazers.\n\nPortland was solid in the first half then played poorly in the third quarter before finishing strong.\n\n\"We've been playing up and down, kind of going through spurts,\" Aldridge said. \"If I knew why we were playing like that, I could fix it.\"\n\nIndiana outscored Portland 31-14 in the third quarter to take control. The Trail Blazers made a push in the fourth but could get no closer than four.\n\n\"It seemed like we were on our heels and weren't aggressive,\" Portland coach Terry Stotts said. \"They were much more aggressive.\"\n\nHickson's tip-in at the buzzer gave the Blazers a 50-48 lead at halftime. Lillard had 14 points at the break for Portland.\n\nIndiana opened the second half on a 6-0 run to take a 54-50 lead.\n\nA 3-pointer and a pair of free throws by George gave the Pacers a 67-60 edge, and Ian Mahinmi's basket in close pushed Indiana's lead to nine and forced Portland to call a timeout.\n\nA fast-break layup by George out of the break bumped Indiana's lead to double digits, and a free throw by D.J. Augustin closed out the 10-0 run. During that three-minute stretch, the Trail Blazers went 0-for-3 from the field and committed three turnovers.\n\nWest's putback in the final seconds of the third quarter gave Indiana a 79-64 lead entering the fourth. Indiana held Portland to 7-for-19 shooting in the third. George, who had eight points in the first half, scored nine in the quarter.\n\nGeorge picked up where he left off, draining a 3-pointer from the corner in the opening minute of the fourth to give the Pacers an 18-point lead.\n\nPortland battled back in the early minutes of the fourth. Matthews hit two free throws to trim Indiana's lead to 85-79 and Lillard added a layup to make it 85-81.\n\nBut Indiana regrouped. A drive by George and a last-second dish for a dunk by Hill gave Indiana a 93-86 lead with just over four minutes remaining.\n\nPortland had a chance to cut Indiana's lead to three, but Hibbert blocked Hickson's shot and pulled in the rebound with 50 seconds to play.\n\n\"It was a nice effort at the end, but we just can't put ourselves in those positions,\" Stotts said.\n\nThe Pacers, who struggled out of the gate, are starting to look like the team that pushed Miami in the second round of the Eastern Conference playoffs last season.\n\n\"A lot of things are starting to come together,\" George said. \"We're starting to knock down shots, we're starting to see the open man. We're starting to play the style that we played last year.\"\n\nGame notes Pacers F Danny Granger remains out with left patellar tendinosis. ... Hibbert entered the game second in the league with 3.06 blocks per contest. He had three more on Wednesday. ... West was issued a technical foul in the second quarter. ... Lillard was named Western Conference rookie of the month on Wednesday. ... Mahinmi scored a season-high 12 points to help Indiana's reserves outscore Portland's 31-13. ... Portland fell to 2-5 on its road trip.",
  "source": "espn_api",
  "crawled_at": 1764993502.0422242
}