{
  "game_id": "0022000337",
  "espn_id": "401267497",
  "date": "Feb 04, 2021",
  "matchup": "PHI vs. POR",
  "headline": "Trent, Anthony lead undermanned Portland past 76ers 121-105",
  "body": "PHILADELPHIA -- — Without Damian Lillard or CJ McCollum, Portland's “other guys” stepped in for the stars and pulled off the upset in Philly.\n\n\r\n                    Gary Trent Jr. scored 24 points and Enes Kanter had 17 points and 18 rebounds to lead the undermanned Trail Blazers to a 121-105 win over the Philadelphia 76ers on Thursday night.\n\n\r\n                    Carmelo Anthony had 22 points and a Trail Blazers team with four starters missing led by as many as 29 points against the top team in the East.\n\n\r\n                    “Dame is our best player, our superstar,” Kanter said. “But on both ends of the floor, the other guys did an amazing job today.”\n\n\r\n                    Joel Embiid scored 37 points for the Sixers. Tobias Harris added 12 points and 11 boards.\n\n\r\n                    Embiid puffed-up his All-Star game credentials in a game that otherwise lacked star power. Sixers guard Ben Simmons sat out with tightness in his left calf. Portland played without Lillard (abdominal strain) and Derrick Jones Jr. (left foot sprain). Throw in four players already out with injuries -- including Jusuf Nurkic (wrist) and McCollum (left foot) -- and the Trail Blazers were down to nine players.\n\n\r\n                    “It does change the chemistry of the game,” coach Terry Stotts said. “We've lost games against teams that were short-handed.”\n\n\r\n                    Portland got one this time around. CJ Elleby scored 15 points for the Trail Blazers.\n\n\r\n                    “It was just a different energy with the team,\" Elleby said. “It was a celebration tonight.”\n\n\r\n                    Sixers President Daryl Morey replied, “ I am not fooled ” hours before the game to a tweet that noted all of Portland’s injuries. He had reason for concern. \n\n\r\n                    With Portland trying to keep Embiid in check, Trent hit two 3s and Portland outscored the 76ers 40-19 in the third.. \n\n\r\n                    Portland entered 26th in the NBA in team defense, allowing 117.1 points per game. McCollum tweeted, “We might move up to 22nd in the league in Defense after this outstanding performance !” \n\n\r\n                    Embiid scored 31 points in the first half (on 11-of-17 shooting; 9 of 9 from the line) and might have topped 40 had he not left the game for about four minutes when he tweaked his right knee. Embiid gave Philly a scare with an awkward landing when he tried to block a shot in the first quarter. Embiid — who said he was “pretty concerned” at first — walked straight to the locker room but returned with 90 seconds left in the quarter.\n\n\r\n                    “I kind of felt it when I landed, but I ended up coming back and pushing through it,” Embiid said. “As the game kept going, I felt good. I mean, I wasn't all the way there but I was just trying to push and make sure we get a chance”\n\n\r\n                    The 76ers’ big man scored 25 points in the second quarter and carried the Sixers as they struggled from outside. The Sixers missed all 10 3-point attempts in the half and that led to a 57-all tie at the break.\n\n\r\n                    “I thought we missed Ben’s presence all over the floor,” Sixers coach Doc Rivers said. “He spearheads our defense. We were a bad defensive team tonight, but I thought we were worse offensively.”\n\n\r\n                    Portland opened the second half on a 12-0 run -- the 76ers missed two more 3s over that run -- and Embiid didn’t get off a shot.\n\n\r\n                    “Third quarter, especially on the road, can be a swing quarter. It made the difference,” Stotts said.\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: Lillard shared a pregame hug with Philadelphia Police Commissioner Danielle Outlaw. Outlaw was the former police chief of Portland, Oregon. ... Stotts said Lillard is day-to-day. ... Trent hit four 3s and Portland was 13 of 31.\n\n\r\n                    76ers: Furkan Korkmaz started for Simmons. Rivers didn’t expect Simmons to miss much time. ... Embiid’s points tied Andrew Toney’s franchise record for most in a single quarter. Tony scored 25 in the fourth quarter March 21, 1982, vs. Boston. ... G Seth Curry did not play in the second half because he didn't feel well. \n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Play Saturday in New York against the Knicks.\n\n\r\n                    76ers: Host the Nets on Saturday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997098.3024251
}