{
  "game_id": "0022300260",
  "espn_id": "401584888",
  "date": "Nov 29, 2023",
  "matchup": "TOR vs. PHX",
  "headline": "Raptors end Suns' winning streak at 7, spoiling Kevin Durant's return",
  "body": "TORONTO -- — Scottie Barnes scored 12 of his 23 points in the fourth quarter, Pascal Siakam finished with 22 and the Toronto Raptors beat Phoenix 112-105 on Wednesday night to end the Suns’ winning streak at seven.\n\n\r\n              Kevin Durant scored 11 of his 30 points in the fourth quarter for Phoenix after missing two games because of a sore foot, while fellow star Devin Booker had only eight points. The Suns lost for the first time since a Nov. 12 loss at home against Oklahoma City.\n\n\r\n              Durant made 11 of 30 attempts and shot 2 for 8 from beyond the arc. He has scored 30 or more points in six straight games, the longest active streak in the NBA.\n\n\r\n              “I don’t feel like I’m ever out of rhythm,” Durant said. “I just missed shots.”\n\n\r\n              Booker hobbled to the bench early in the second half after stepping on Dennis Schroder’s foot, but was able to return.\n\n\r\n              “I don’t know if it got stiffer but I wasn’t going to spend the rest of the night trying to beat people off the dribble,” Booker said.\n\n\r\n              Booker, who beat New York on Sunday night with a 3-pointer with 1.7 seconds left, missed a 3 that would have tied it with 50 seconds remaining. \n\n\r\n              “I knew that one was left a bit,” Booker said.\n\n\r\n              Booker shot 2 for 12, going 0 for 4 on 3-pointers.\n\n\r\n              Phoenix coach Frank Vogel said he wasn’t sure whether Booker would be able to play when the Suns host the defending NBA-champion Denver Nuggets on Friday night.\n\n\r\n              “We’ll see how it responds overnight,” Vogel said. “You never know with ankles.”\n\n\r\n              Jusuf Nurkic had 19 points and 14 rebounds for the Suns, who shot 7 for 26 from 3-point range, matching their fewest made 3-pointers this season. \n\n\r\n              “I just think the lid was on the basket tonight,” Durant said. “I feel like we got good looks, we just didn’t finish.”\n\n\r\n              Eric Gordon and Josh Okogie each scored 10 points but Phoenix lost despite outsourcing Toronto 28-14 on second-chance points.\n\n\r\n              Barnes made four field goals in the fourth quarter, one more than he’d made through the first three quarters combined.\n\n\r\n              “Scottie Barnes is a winner,” Raptors coach Darko Rajakovic said. “When you coach him, you just feel that energy, you feel him on the bench the way he’s energizing the whole team.”\n\n\r\n              Schroder had a season-high 12 assists to help the Raptors win for the first time in three games. Precious Achiuwa had 14 points and 10 rebounds, Jakob Poeltl scored 17 points, and O.G. Anunoby and Gary Trent Jr. each had 13.\n\n\r\n              The Raptors, who lost at Brooklyn on Tuesday night, were delayed flying home from New York and didn’t land in Toronto until 4 a.m., but showed no ill effects from their short night of rest.\n\n\r\n              “We have to understand that we have to start the game better than we started today,” Nurkic said. “They played last night. We should be starting the game better.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Denver on Friday night.\n\n\r\n              Raptors: Host New York on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995446.9344058
}