{
  "game_id": "0021800423",
  "espn_id": "401071104",
  "date": "Dec 14, 2018",
  "matchup": "MIL @ CLE",
  "headline": "Antetokounmpo matches career high with 44, Bucks beat Cavs",
  "body": "CLEVELAND --  Giannis Antetokounmpo played as if he had a point to prove.\n\nThe Milwaukee star rebounded from his worst game of the season to match his career high with 44 points and the Bucks beat the Cleveland Cavaliers 114-102 on Friday night despite missing two starters.\n\nTwo nights after being held to a season-low 12 points in a loss to Indiana, he was 14 of 19 from the field, made 16 of 21 foul shots, and had 14 rebounds and eight assists.\n\n\"You've got to put that game in the past,\" Antetokounmpo said. \"You put it in the past and move forward.\"\n\nKhris Middleton, the Bucks' second leading scorer, was out with a sprained right finger. Malcolm Brogdon, fourth on the team in scoring, didn't play because of a sore left hamstring.\n\nBucks coach Mike Budenholzer wasn't surprised Antetokounmpo took over with his team short-handed.\n\n\"Obviously, a monster game for Giannis,\" he said. \"We kind of rode him pretty hard tonight. He was ultra-aggressive. He's a competitor. He wants to be great.\"\n\nAsked what a team can do to slow down Antetokounmpo, Cavaliers coach Larry Drew said, \"There's not an answer to that. He's a terrific player. He's elevated his game over the years. He can hurt you in so many different ways.\"\n\nNot only was Antetokounmpo coming off a subpar game, Wednesday's 113-97 loss was Milwaukee's largest margin of the season.\n\nAntetokounmpo made an instant impression after Milwaukee won the opening tip when he dunked on Osman on a set play in the halfcourt offense. He ended the half by finding Pat Connaughton for a 3-pointer.\n\nAntetokounmpo, who had his 20th double-double of the season, admitted he was aware of his numbers.\n\n\"At some point in the game, you realize you're scored a lot, so you look up at the scoreboard, but usually I don't even look at it,\" he said.\n\nThe Bucks never trailed and held off a late Cleveland spurt. The Cavaliers cut the lead to five midway through the fourth quarter on Cedi Osman's 3-pointer, but Antetokounmpo had a three-point play and an assist on Brook Lopez's basket that beat the shot clock, pushing the lead to 111-99.\n\nLopez scored 19 points and Eric Bledsoe had 16 for the Bucks, who have the second-best record in the Eastern Conference.\n\nJordan Clarkson scored 23 points, and Larry Nance Jr. had 14 for Cleveland. Rookie point guard Collin Sexton had five points after scoring in double figures in 18 straight games.\n\nCleveland played its second game without Tristan Thompson, who could be out for a month with a sprained left foot.\n\nLOOK OUT\n\nCavaliers guard Matthew Dellavedova dove into the scorers table saving a ball that was headed out of bounds in the second quarter and crashed into Fred McLeod, the team's television play-by-play man.\n\nThe collision sent both to the floor while papers and notes went flying. Dellavedova climbed over the table and returned to action. McLeod was helped up and continued to call the game, but his chair got the worst of the impact and was replaced.\n\nDellavedova apologized to McLeod in the locker room and told the announcer, \"I owe you a good bottle of wine.\"\n\n\"I feel kind of bad because I tried to move out of the way,\" Drew joked.\n\nCleveland acquired Dellavedova from Milwaukee for George Hill last week. Dellavedova scored 10 points while Hill had two.\n\nLONG SEASON\n\nThe Bucks are in a stretch of one game in four days, giving Budenholzer a chance to rest players who are dealing with minor injuries.\n\nMiddleton is averaging 17.4 points, but has been a major slump, hitting 16 of 47 from the field in the last four games.\n\nBrogdon is averaging 15.3 points and is shooting 52 percent from the field. He's made 47 percent of his 3-point attempts.\n\nMilwaukee was off Thursday and doesn't play again until Monday. Connaughton and Tony Snell started against Cleveland.\n\nTIP-INS\n\nBucks: Milwaukee is 9-0 after a loss. .... Antetokounmpo sat out with a sore neck Monday in a 108-92 win over the Cavaliers. ... Milwaukee broke a six-game losing streak in Cleveland.\n\nCavaliers: Cleveland's starters had no assists in the first half. .... C Channing Frye was given a flagrant foul on Antetokounmpo under the basket in the third quarter. ... Cleveland came in looking for its first three-game winning streak of the season.\n\nUP NEXT\n\nBucks: At Detroit on Monday night.\n\nCavaliers: Host Philadelphia on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994507.901113
}