{
  "game_id": "0021801037",
  "espn_id": "401071710",
  "date": "Mar 16, 2019",
  "matchup": "CLE @ DAL",
  "headline": "Mavericks top Cavaliers 121-116 as Dirk closes on Wilt",
  "body": "DALLAS --  As they watched Dirk Nowitzki's shooting heat up yet again, fans at the American Airlines Center thought they might be watching history Saturday night.\n\nNowitzki will have to wait another game to reach his latest milestone, but his Dallas Mavericks got a much-needed win.\n\nTim Hardaway Jr. scored 22 points, Nowitzki closed within three points of Wilt Chamberlain on the NBA scoring list and the Mavericks ended a seven-game losing streak with a 121-116 victory over the Cleveland Cavaliers.\n\nEntering the fourth quarter with just four points, Nowitzki scored 10 in the first five minutes of the period to bring himself to the cusp of Chamberlain for sixth place on the career scoring list.\n\nNowitzki hit a turnaround jumper, a 3-pointer, two free throws and then another from long range with 7:15 left in the game. With the crowd buzzing on every Mavericks possession in the final minutes, Nowitzki missed his final five shots before leaving to a standing ovation in the final seconds.\n\n\"I was going for it there,\" Nowitzki said. \"I just didn't have another hot hand down the stretch.\"\n\nHe has another home game on Monday before the team leaves on a three-game road trip.\n\n\"Breaking records is always fun,\" Nowitzki said. \"If it happens at home, it's even more special for fans that have been riding with you for such a long time.\"\n\nNowitzki was one of seven Mavericks in double figures, helping to offset leading scorer Luka Doncic's absence due to a right knee contusion.\n\nMaxi Kleber had 18 points and a career-high 12 rebounds for Dallas, and Jalen Brunson and Dwight Powell had 16 points apiece.\n\nCollin Sexton scored 28 for the Cavaliers. Kevin Love and Cedi Osman each had 22 for Cleveland, which has lost three in a row.\n\nCleveland's last lead came at 10-9 midway through the first quarter, and the Mavericks led by as many as 21 in the second half before the Cavaliers made a run late to make the final score closer.\n\n\"I think we took a huge step back defensively,\" Love said. \"We've been looking at film, but when we're not scoring that ball it's almost like we're giving up on the defensive end.\"\n\nTIP-INS\n\nCavaliers: Though both attended shootaround Saturday, Larry Nance (rib contusion) and Tristan Thompson (left foot soreness) remained out for Cleveland. ... With Phoenix winning Saturday at New Orleans, Cleveland's six road wins are the fewest in the NBA.\n\nMavericks: Brunson and Powell's numbers have spiked since the All-Star break, with Powell averaging 17 points (nine prior to the break) and Brunson averaging 16 (seven). Brunson is also shooting 92 percent from the free throw line compared to 67 percent before the break. ... Dorian Finney-Smith scored 14 to reach 1,000 points for his career.\n\nSEXTON'S STREAK\n\nSexton surpassed 20 points for the fifth game in a row and 19th time in his rookie season. He finished one short of his career high.\n\n\"The game is starting to slow down for him a little bit,\" Cavs coach Larry Drew said. \"He's just really doing a good job of picking and choosing his spots.\"\n\nGOING FOR ASSISTS\n\nNowitzki's teammate Devin Harris remained on the floor in the final quarter. It was Harris who delivered the assist on the basket that gave Nowitzki 30,000 points in 2017. Harris wanted another chance at history Saturday.\n\n\"I think everybody sacrificed and tried to get it over for him,\" Harris said. \"We wanted to get it for him. I'm hoping this next game we will be able to.\"\n\nHarris finished with a season-high nine assists.\n\nUP NEXT\n\nCavaliers: Host Detroit on Monday, starting a three-game homestand.\n\nMavericks: Host New Orleans on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994738.8506508
}