{
  "game_id": "0021500232",
  "espn_id": "400828119",
  "date": "Nov 27, 2015",
  "matchup": "HOU vs. PHI",
  "headline": "James Harden scores 50; Sixers lose 27th straight dating to last season",
  "body": "HOUSTON -- With Philadelphia desperate for its first win, James Harden took over for the Houston Rockets.\nHarden had 50 points, nine rebounds and eight assists, and the Rockets beat the lowly 76ers 116-114 on Friday night.\n\nHarden was 14-for-28 from the field and 16-for-20 at the line in his third career game with 50 or more points. He is averaging 36.2 points in his last five games.\n\"Just in attack mode,\" he said. \"Taking my shots, being aggressive.\"\nPhiladelphia moved one loss away from matching the New Jersey Nets' NBA-worst mark of 18 losses to open a season. The Sixers have dropped 27 in a row dating to last season for the longest losing streak in major U.S. professional sports history, passing the NFL's Tampa Bay Buccaneers from 1976 to `77. The previous record was also matched by the 76ers in 2013-14.\nRobert Covington had 28 points and eight steals for Philadelphia, which made a franchise-record 16 3-pointers in 35 attempts. One day removed from a Boston nightclub altercation, rookie Jahlil Okafor had 11 points and six rebounds.\nFacing an 11-point deficit to start the fourth quarter, the 76ers opened the period on a 24-8 run to take a five-point lead.\n\"In past situations this year, we didn't handle those situations well,\" Rockets coach J.B. Bickerstaff said. \"There's a growing belief in that locker room that they can do the things needed to win.\"\nDown by two with less than 3 seconds remaining, Covington intentionally missed a free throw that was rebounded by Houston's Dwight Howard.\nHarden led the Rockets to one of their best shooting performances of the season, helping Houston win for just the second time in its last nine games.\nThe Rockets shot 52 percent from the field, including an 11-for-20 night from beyond the arc. Howard added 14 points and 13 rebounds.\nPhiladelphia scored 100 points for the first time in nearly three weeks and just the fourth time all season. Isaiah Canaan had 23 points, and Jerami Grant scored 18.\n\"A time's going to come where we finally put everything together and come up with a victory,\" Covington said.\nSixers coach Brett Brown praised the 6-foot-11 Okafor for selflessly asking him to keep the small lineup in the game as they rallied.\n\"It wasn't some perfect, pretty offense -- it was organized streetball,\" Brown said. \"And it got us back in it. It's a tremendous example for the whole room to look around, and you just never know who's going to be there at the end of games to make it happen.\"\nTIP-INS\n76ers: C Nerlens Noel was a late scratch with right knee soreness. ... SG Nik Stauskas returned from a one-game absence after suffering a knee contusion in Monday's loss to Minnesota. ... Canaan got his fifth start of the season over regular starter T.J. McConnell.\nRockets: Houston improved to 68-68 all-time against Philadelphia. ... The Rockets had a season-high 35 third-quarter points. ... PG Patrick Beverley received a technical foul in the second quarter after throwing an elbow near the face of Phil Pressey.\nUP NEXT\n76ers: Visit Memphis on Sunday.\nRockets: Visit New York on Sunday.\nOKAFOR'S SITUATION\nThe 76ers offered no new comment on Okafor's Thursday morning altercation at a Boston nightclub.\n\"We've heard some things, but in fairness to everybody here, there's not much more we're going to comment on, at this point,\" Brown said.\nOkafor, the third overall pick in the draft, said after the shootaround that he was \"embarrassed\" by the incident, and he is dealing with the team and league on possible discipline.\nPAYING RESPECT\nThe Rockets observed a pregame moment of silence in honor of college basketball coach Guy V. Lewis, who died on Thursday morning at 93. Lewis was best known for leading the Phi Slama Jama teams of the 1980s at the University of Houston. He was inducted into the Naismith Basketball Hall of Fame in 2013.",
  "source": "espn_api",
  "crawled_at": 1764994662.3264298
}