{
  "game_id": "0021600749",
  "espn_id": "400900154",
  "date": "Feb 03, 2017",
  "matchup": "HOU vs. CHI",
  "headline": "Harden scores 42, rallies Rockets past Bulls 121-117 in OT",
  "body": "HOUSTON --  With the game on the line, James Harden resorted to his step-back jumper on three key plays and drained two of them.\n\nHarden had 42 points, 12 rebounds and nine assists to rally the Houston Rockets past the Chicago Bulls 121-117 in overtime Friday night.\n\nThe star guard hit a step-back jumper over Paul Zipser with 36.1 seconds left in the extra period and was fouled. Harden made the free throw to give the Rockets a two-point lead they never relinquished.\n\nEarlier in the game, Harden stepped back and connected over Michael Carter-Williams to tie the game at 108 with 27.3 seconds remaining in regulation.\n\nOn the next possession, Dwyane Wade lost his dribble when guarded by Trevor Ariza, leading to a shot-clock violation with 3.3 seconds to go. Harden tried the same move against Carter-Williams at the buzzer, but that attempt fell short.\n\nDespite the big shots and outpouring on offense, Harden insisted there was another reason the Rockets won.\n\n\"Offensively, we went on a little drought and just relied on our defense,\" he said. \"Our defense won us that game. We can't make 50 3s every night like we want to, but we have to find other ways to win, and tonight was one of those wins.\"\n\nAfter losing to Atlanta on Thursday night, the Rockets improved to 12-1 this season in the second of back-to-back games.\n\nThe Bulls played without star forward Jimmy Butler, who was nursing a bruised heel. Starting in his place, Carter-Williams had 23 points, nine rebounds and six assists before fouling out with two minutes remaining in overtime.\n\nWhen asked what changes with Butler out, Wade didn't flinch.\n\n\"Everything,\" he said. \"Everything is centered around Jimmy. He guards the other team's best player, we go to him a lot on offense, so a lot changes, but that is not the reason we lost tonight. We had a chance to win tonight. We just didn't pull it out.\"\n\nBulls coach Fred Hoiberg said Butler will be re-evaluated in the coming days and hopes to play Monday night in Sacramento.\n\nChicago dominated the Rockets' interior defense, outscoring Houston 60-46 in the paint. Taj Gibson scored 20 points for the Bulls, and Wade had 19 points, nine rebounds and six assists.\n\n\"We should've won the game,\" Gibson said. \"Some rough calls late. We played hard, it was a good team effort, but we fell short. We have a lot of heart. We upped the challenge, but we just let that one get away. We should've finished the game stronger, but we have to learn from it.\"\n\nThe Rockets built a lead that reached 17 midway through the second quarter as they opened the period on a 26-7 run, all with Harden on the bench. Chicago cut Houston's lead to 60-49 at halftime.\n\nThe Bulls started the third quarter on a run of their own, outscoring the Rockets 24-12 out of the extended halftime break, and entered the fourth with a two-point lead.\n\n\"We're still not sharp at all,\" Rockets coach Mike D'Antoni said. \"We shot the ball OK -- we can do better. Now, we'll have three days off. Hopefully our legs will start regenerating a little bit and get back where we were.\"\n\nEric Gordon scored 21 points off the bench, shooting 5-for-10 from 3-point range. Clint Capela added 14 points and nine rebounds for Houston.\n\n\"Tonight was very important to get this win,\" Capela said. \"We had to prove to ourselves that we can play defense.\"\n\nIn a special halftime ceremony, the Rockets retired Yao Ming's No. 11 jersey with a dedication that featured Yao's family, former teammates, fellow Hall of Famers Hakeem Olajuwon and Dikembe Mutombo, and NBA Commissioner Adam Silver.\n\nTIP-INS\n\nBulls: In the fourth quarter, Zipser was elbowed in the face by Harden on a rebound and called for a foul. After a review, Harden also received a technical foul. ... Zipser, Doug McDermott and Nikola Mirotic all scored in double figures off the bench.\n\nRockets: Harden scored his 10,000th point with the Rockets late in the second quarter. He passed Yao for sixth place in franchise history. Harden scored 2,795 points in his first three seasons with Oklahoma City. ... Ryan Anderson's shooting woes continued as he went 0 for 7 from the field, including 0 for 6 from 3-point range. He also missed both his free throw attempts.\n\nHONORING YAO\n\nDuring his halftime speech, Yao recalled how former teammate Shane Battier would always make everyone in the locker room fill out March Madness NCAA Tournament brackets. Since he never played in the NCAA, Yao admitted he was always a little lost.\n\n\"I copied Mr. President's answers on the TV,\" Yao said. \"Well, the last one -- I don't know about this one.\"\n\nBEYOND THE ARC\n\nIn shooting 16 for 43 from 3-point range, the Rockets made 15 or more 3s for the 27th time this season, matching the NBA record set by Golden State last season. With several long-range shooters struggling of late, it was just the third time in the last 12 games the Rockets made 15 3s after doing so 15 times in the 20 previous games. Houston is 23-4 when making 15 or more 3s this season.\n\nUP NEXT\n\nBulls: Visit the Sacramento Kings on Monday night, the third stop on a six-game road trip.\n\nRockets: Host the Orlando Magic on Tuesday night, the first of six straight games against teams with losing records.",
  "source": "espn_api",
  "crawled_at": 1764995760.896999
}