{
  "game_id": "0021800948",
  "espn_id": "401071621",
  "date": "Mar 03, 2019",
  "matchup": "CLE vs. ORL",
  "headline": "Clarkson, Love lead Cavaliers past Magic 107-93",
  "body": "CLEVELAND --  Kevin Love makes the Cleveland Cavaliers a different basketball team.\n\nThe Orlando Magic learned that lesson Sunday night in what could be a costly loss for their playoff hopes.\n\nA night after being held out of a 36-point loss to Detroit, Love had 16 points and 14 rebounds and the Cavaliers pulled away in the fourth quarter for a 107-93 win.\n\nOrlando, which was coming off wins over Golden State and Indiana, rallied to tie the game at 81 with seven minutes to play before Cleveland took over. The Cavaliers hit seven 3-pointers in the period, including two each by Jordan Clarkson and Cedi Osman.\n\nLove is still progressing from foot surgery in November and has yet to play on back-to-back days. The five-time All-Star was ready after watching Saturday's 129-93 debacle.\n\n\"It was just sticking to the plan,\" Love said. \"I was very excited when I got asked the question (after the All-Star break) that I wanted to play in every game, that I wasn't going to miss any more games, but we're taking it day by day. It was a huge win for us against a team fighting for position.\"\n\nNikola Vucevic scored 28 points for Orlando. He was 13 of 16 from the field and had 13 rebounds.\n\nD.J. Augustin added 19 points for the Magic, who hold a very slim lead over Charlotte and Miami for first place in the Southeast Division and the final playoff spot in the Eastern Conference.\n\nOrlando coach Steve Clifford held a long meeting with his players after the game.\n\n\"This is a bad loss, man,\" guard Evan Fournier said. \"We feel like we were too casual. We've got to grow. Cliff said a lot of stuff after the game. He said a lot of things.\"\n\n\"Every game counts the same,\" Clifford said. \"To not look at it that way, that every game is important, it's a losing mentality and a total lack of understanding what the NBA is.\"\n\nPlaying his seventh game since returning, Love made two free throws and hit a 3 from the top of the arc during Cleveland's game-clinching run.\n\nClarkson scored 19 points. Rookie guard Collin Sexton had 17 points and Osman scored 14 for the Cavaliers, who have won five of eight. Larry Nance Jr. and Matthew Dellavedova each added 11 points.\n\nCleveland scored 17 straight points during a run that began late in the third quarter with Orlando leading 72-63. The Magic tied the game on Augustin's 3-pointer midway through the fourth.\n\nVucevic scored 10 points in the third when the Magic pulled ahead after trailing by four points at halftime.\n\nOrlando, trying to make the playoffs for the first time since 2012, has won eight of 11. The Magic went 6 of 26 on 3s.\n\nTIP-INS\n\nMagic: Orlando made its lone trip to Cleveland this season. ... C Mo Bamba (left leg stress fracture), G Markelle Fultz (thoracic outlet syndrome) and C Timofey Mozgov (right knee surgery) are out with long-term injuries. ... Mozgov, a member of Cleveland's 2016 NBA championship team, received a loud ovation when he was shown on the arena video board.\n\nCavaliers: Cleveland didn't attempt a free throw until the 2:19 mark of the second quarter when Love made two shots. ... F Tristan Thompson and C Ante Zizic remain sidelined. Thompson has missed the last 19 games with a sore left foot and has been out for a total of 29 games because of the injury. Zizic sustained a concussion after taking an elbow to the face on Thursday.\n\nIN THE LINEUP\n\nAugustin, who left Saturday's game because of a sprained right ankle, started and played 29 minutes. He played only 17 minutes against the Pacers, but told Clifford he was available after pregame warmups.\n\n\"You can't take any team lightly in this league,\" Augustin said. \"The Cavs deserved to win. It's disappointing, but we're going to have to earn our way into the playoffs. It's all on us.\"\n\nNICE BOUNCE BACK\n\nCleveland coach Larry Drew was pleased to see his team rebound from the Detroit game in which the Cavaliers fell behind early and showed little fight.\n\n\"Our guys really wanted to prove something, that we could be better,\" he said. \"It was a fun game for us.\"\n\nUP NEXT\n\nMagic: Host the Philadelphia 76ers on Tuesday.\n\nCavaliers: Visit the Brooklyn Nets on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994746.741503
}