{
  "game_id": "0022401031",
  "espn_id": "401705597",
  "date": "Mar 23, 2025",
  "matchup": "ATL vs. PHI",
  "headline": "Trae Young, Zaccharie Risacher lead Hawks to 132-119 win over 76ers",
  "body": "ATLANTA -- — Trae Young scored 28 points with 12 assists, Zaccharie Risacher scored 22 points and the Atlanta Hawks beat the Philadelphia 76ers 132-119 on Sunday night. \n\n\r\n              Georges Niang added 20 points, including five 3-pointers, and Dominick Barlow finished with 13 points and 10 rebounds. Onyeka Okongwu scored 14 points and grabbed nine rebounds. \n\n\r\n              Quentin Grimes led the 76ers with 26 points and six assists. Rookie Justin Edwards scored 22 points, Ricky Council IV 14 and Guerschon Yabusele 11. \n\n\r\n              The Hawks shot 55% from the field, hit 17 3-pointers and made 19 of 22 from the free-throw line. \n\n\r\n              Takeaways\r\n              76ers: Edwards, a consensus five-star recruit in the 2023 class who went undrafted in 2024 after one season at Kentucky, is averaging 21 points on 51% (31 of 61) shooting, 13 of 27 (48%) from 3, over the last four games. \n\n\r\n              Hawks: Risacher hit 3 of 7 from behind the arc and continues to look more comfortable shooting the ball. After shooting below 30% from 3 in October, November and December, the 6-foot-8 forward shot 44% from deep in February and is hitting 42% this month on nearly six attempts per game. \n\n\r\n              Key moment \r\n              Risacher hit a corner 3 and then threw down an alley-oop dunk from Young to spark a 13-0 run — all by the 19-year-old rookie — that gave the Hawks an 81-60 lead midway through the third quarter. \n\n\r\n              Key stat\r\n              Dyson Daniels had five steals and became the third player since the 2000-01 season to record at least 200 steals in a single season (Chris Paul in 2007-08 and 2008-09; Allen Iverson in 2002-03). Daniels has 202 steals this season. \n\n\r\n              Up next\r\n              The 76ers wrap up a six-game road trip in New Orleans against the Pelicans on Monday. The Hawks visit the Houston Rockets on Tuesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997914.672961
}