{
  "game_id": "0021900523",
  "espn_id": "401161165",
  "date": "Jan 04, 2020",
  "matchup": "MEM @ LAC",
  "headline": "Grizzlies beat George-less Clippers 140-114 for 7th road win",
  "body": "LOS ANGELES --  Jae Crowder was making shots early, putting him in a rhythm that carried throughout the game.\n\nHis Memphis teammates followed right along and took advantage of Los Angeles star Paul George's absence to rout the Clippers 140-114 on Saturday.\n\nThe Grizzlies never scored less than 25 points in each quarter.\n\n“We controlled the tempo and got off to a big first quarter and scored 40 points,” said Crowder, who scored 27 points. “We've had big leads this year and lost them, so we stayed aggressive and continued to contest the rim.”\n\nJaren Jackson Jr. added 24 points, and Ja Morant and Dillon Brooks had 22 points each to help Memphis improve to 7-10 on the road with its highest scoring game of the season.\n\n“We started off great, got stops when we needed them and nearly played a complete 48 minutes,” Grizzlies coach Taylor Jenkins said. \"We're going to enjoy this one. The guys were (mad) how we let a big lead get away in Sacramento the other night and ended up losing that game. \"\n\nMontrezl Harrell led the Clippers with 28 points. Kawhi Leonard and Lou Williams added 24 points each. The team appeared out of sorts from the start without George. He sat out with left hamstring tightness and Los Angeles clearly missed his defense.\n\nThe usually stoic Leonard complained to the referees, who hit him with a technical after the halftime buzzer. Coach Doc Rivers stayed on court discussing it and was unhappy about other calls in the game.\n\n“I thought he had gotten fouled a couple times,” Rivers said about non-calls on Leonard. “The team with the most energy gets all the calls. We were complaining and they were running through us and playing hard.”\n\nThe Grizzlies raced to an 18-point lead to open the game, highlighted by a 16-2 run that included four 3-pointers -- three coming on consecutive possessions.\n\n“We showed up and thought we were going to win,” Rivers said. “There are no excuses for the way we played.”\n\nBy the time Williams made the Clippers' first 3-pointer late in the second, cutting their deficit to seven, the Grizzlies had already connected on 10 3s. Los Angeles never got closer.\n\n“It's just unacceptable,” Williams said. “We gave them a lot of confidence early and it went on for four quarters. We did get our (rear) kicked.”\n\nCrowder scored 14 points in the third, making two late 3-pointers that helped extend the Grizzlies' lead to 104-80 going into the fourth. Crowder tied career highs with six 3-pointers and seven assists.\n\nThe Clippers made a brief run in the fourth behind Harrell and Williams, using 10 straight points to close to 110-94. But Jackson took over from there, scoring 12 points down the stretch.\n\n“We're confident we can build from this win and continue to get better,” Jackson said.\n\nThe Clippers' two-game winning streak ended. They haven't won three in a row since Dec. 9-13.\n\n“We've been playing like this the last four, five games. The last good game we played was against the Lakers,” Rivers said. “We got to play better.”\n\nTIP-INS\n\nGrizzlies: They've had four straight games with at least 30 assists, setting a franchise record. It was their 14th game with that many assists, setting a single-season franchise mark. ... They are 6-5 on the road against the West.\n\nClippers: It's possible George could return Sunday against the Knicks in another day game. ... Patrick Beverley missed his third straight game with a sprained right wrist, but is close to being back. ... Leonard sat out the teams' first meeting Nov. 27, a two-point road win for the Clippers.\n\nFUTURE STAR\n\nMorant leads the league in rookie scoring and assists, and he's got a shot at setting the Grizzlies franchise rookie record for scoring average and assists.\n\n“I'm not worried about the All-Star Game or being the rookie of the year,” he said. \"My main goal is to stay humble and remain focused.\"\n\nMorant's play hasn't surprised Jackson.\n\n“I think he's exceeded everyone else's expectations,” Jackson said. \"He's a special talent. He moves without the ball, gets back on defense, set screens and gets the ball to guys when they're open.\"\n\nHE SAID IT\n\n“I just don't want us to think we're good enough yet because we're not.\" -- Rivers.\n\nNIGHTTIME IS THE RIGHT TIME\n\nRivers says he “hates” day games. The Clippers have seven more 12:30 p.m. starts this season, but none occur back-to-back like this weekend.\n\n“It disrupts your whole day, especially if you're the home team. You don't eat lunch at the same time and it makes everything inconsistent,” he said. \"I much prefer to play at night and I believe all of the players do as well.\"\n\nUP NEXT\n\nGrizzlies: Visit Phoenix on Sunday in the second game of a back-to-back to conclude a three-game trip.\n\nClippers: Host the New York Knicks on Sunday in the second game of a rare daytime back-to-back.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995723.901498
}