{
  "game_id": "0021500154",
  "espn_id": "400828041",
  "date": "Nov 16, 2015",
  "matchup": "HOU vs. BOS",
  "headline": "Thomas leads Celtics to easy 111-95 win over Rockets",
  "body": "HOUSTON -- The Boston Celtics were playing their fifth game in seven days on Monday night.\nWith the energy and hustle they showed in a blowout win over the Houston Rockets it was certainly hard to tell.\nIsaiah Thomas scored 23 points and the Celtics used a 32-point third quarter to pull away and cruise to a 111-95 win over the slumping Rockets.\n\nAvery Bradley was asked how they're able to keep playing with such intensity in such a tough stretch of games.\n\"This is the NBA,\" he said. \"If you can't, you shouldn't be in the NBA honestly.\"\nIt is the third straight win for the Celtics and gives Houston a four-game losing streak for the first time since the team dropped seven straight in January 2013.\nCoach Kevin McHale doesn't feel like he's getting 100 percent from his team.\n\"At times, I wouldn't say full effort all the time, no,\" he said. \"Things aren't going our way and we hang our head. We haven't put together really good basketball all year long.\"\nBoston led by 4 after a 3-pointer by James Harden with 3 1/3 minutes left in the third quarter. The Celtics closed out the quarter by scoring 15 straight points to take an 87-68 lead into the fourth quarter.\nThe Celtics rode the momentum from their strong third quarter into the early part of the fourth quarter and used a 13-4 run to open the period and extend the lead to 100-72. Bradley scored seven points with a dunk and a 3-pointer to lead the team in that stretch.\nMcHale pulled most of Houston's starters after that.\nBradley finished with 21 points and made four 3-pointers and Jae Crowder added 16 points.\nTrevor Ariza led Houston with 19 points and Harden had 16.\nThe Rockets led by as many as 15 in the first quarter, but the Celtics got going in the second and it was tied 55-55 at halftime.\n\"We were more locked in, hands were up, more deflection oriented,\" coach Brad Stevens said of Boston's play after the first quarter.\nHouston was up by 1 after a dunk by Ariza in the third quarter. The Celtics scored the next eight points to take a 67-61 lead with about 5 1/2 minutes left in quarter.\nHouston had three turnovers in that span and went more than 2 1/2 minutes without scoring. Ariza finally broke the drought with a 3-pointer with 5:22 left in the third. But the Rockets shooting woes would soon return, allowing the Celtics to build the lead.\nBradley made 3-pointers on consecutive possessions near the end of Boston's big run, causing the visitor's bench and the few Celtics fans in the crowd to go wild. The players on the bench jumped up and down and held three fingers in the air.\nHouston missed six straight shots and had a turnover as Boston built the lead and the Rockets managed just 13 points in the quarter.\nTIP-INS\nCeltics: Bradley played in his second straight game after missing the previous two games with a strained calf. ... Marcus Smart had six assists.\nRockets: G Patrick Beverley missed his second game in a row and is out indefinitely after spraining his left ankle on Friday night. He missed two games earlier this month with a concussion. ... Dwight Howard had five points and 12 rebounds.\nMINOR DUSTUP\nThere was a minor scuffle midway through the third quarter when Terrence Jones tried to grab the ball out of the hands of Amir Johnson after he fell to the court at the end of a play. Harden and Thomas joined the incident and began shoving each other before they were pulled apart. Jones, Harden and Thomas all received technical fouls after a review by the officials.\n\"What bothered us was we had a guy down and their guy kind of straddled us -- wouldn't let our guy up,\" Crowder said. \"It was a sign of disrespect. We came to our guy's rescue and we just wasn't having it.\"\nHURT BY TURNOVERS\nIt was a sloppy game by the Rockets, who dropped to 4-7 this season, thanks in part to 22 turnovers that led to 39 points by Boston.\n\"We just had turnover after turnover ... it was just kind of a muddy game,\" McHale said. \"We stayed in the mud and they made some shots in the third quarter and ran us out.\"\nUP NEXT\nCeltics: Visit Dallas on Wednesday.\nRockets: Host Portland on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994666.792761
}