{
  "game_id": "0021900610",
  "espn_id": "401161252",
  "date": "Jan 15, 2020",
  "matchup": "CHA @ DEN",
  "headline": "Porter, Dozier lead Nuggets to 100-86 win over Hornets",
  "body": "DENVER --  After being told to get ready for his Denver debut, P.J. Dozier was quickly asked how many plays he remembered.\n\n“I'm like, ‘Oh, shoot,’” he said.\n\nSo that's exactly what he did -- and made quite a splash.\n\nRookie reserve Michael Porter Jr. scored 19 points, Dozier had a big second half filling in for injured point guard Jamal Murray and the Nuggets beat the Charlotte Hornets 100-86 on Wednesday night.\n\n“I've been preparing for this my whole life,” Dozier said. “I've been excited to have this opportunity. I hate that it had to happen under these circumstances. But (Murray) will be all right. I've just been trying to stay ready for this.”\n\nMurray exited the game with 1:32 remaining in the second quarter after rolling his left ankle. He was helped off the floor by teammates. The banged-up Nuggets were already without Gary Harris (groin) and Paul Millsap (bruised left knee).\n\nEnter Dozier, who finished with 12 points in 13 minutes. He had a stretch in the second half where he scored nine straight for the Nuggets.\n\nDozier was recalled from Windy City of the G League on Tuesday to provide depth. Dozier averaged 20.9 points and 7.7 assists in 16 games for the Bulls. He's been called up before, but never appeared in a game for Denver.\n\nFollowing the game, he didn't check his phone immediately. But he knew who one of the first missed calls would be from -- his mom.\n\nSure enough, there it was.\n\nBefore the contest was even over, Murray posted on his Twitter account about Dozier: “All I’m sayin is y’all better be ready to see my boy Dozier-Kid shine. ... dat boy can hoop!!”\n\nNo doubt. After his college days at South Carolina, Dozier wasn't picked in the 2017 NBA draft. He appeared in eight games between Oklahoma City (two, 2017-18) and Boston (six, '18-19) before signing a two-way contract with Denver for this season.\n\n“I was super-happy for P.J.,” Porter said. “He's stayed so patient.”\n\nPorter carried the Nuggets for a stretch as he erupted for 11 of his points in the second quarter. He keeps taking his game to higher and higher levels. Coach Michael Malone's trust level in him is soaring, too.\n\n“I like whenever they run plays for me,” cracked Porter, who also had eight rebounds. “I'm trying to make plays for my teammates. I have to keep that going.”\n\nTerry Rozier scored 20 points for the Hornets, who wrapped up a winless four-game trip.\n\n“It was a tough road trip for us, some tough games,\" said Cody Zeller, who had 11 points. “I thought we played well in spurts.”\n\nDenver led by as many as 20 points in the third quarter before the Hornets closed on a 21-6 run. Bolstered by Dozier, the Nuggets steadily built the lead back up to a comfortable margin.\n\n“They're talented, they're deep, they're young and they play the right way,\" Hornets coach James Borrego said. “They're a fantastic team.”\n\nThe Nuggets were rightfully fearful of a Hornets team that's 15-29. Denver has struggled against teams under .500 all season.\n\n“We're not looking at records,” Nuggets coach Michael Malone said. \"We have to go out and play our game.”\n\nMurray was hurt when he tried to contest a 3-point shot by Rozier and appeared to land on Rozier's foot. Murray instantly grabbed at his ankle as play was stopped. Murray had five points and one assist before exiting. He was also dealing with a sore back.\n\nDozier's ready if needed.\n\n“Just do as I do every day,” he said. “I prepare for every game like I'm going to play.”\n\nTIP-INS\n\nHornets: Borrego picked up a technical foul late in the first quarter. Rozier and Miles Bridges were given technicals on the same play with 5:43 remaining. ... Devonte' Graham, Bridges and P.J. Washington all scored 14 points.\n\nNuggets: Denver is 11-1 this season when holding teams under 100 points. ... Nikola Jokic had 12 points, eight rebounds and eight assists. ... Mason Plumlee had 15 points.\n\nFAMILY MATTERS\n\nIt was a family reunion for brothers Willy and Juancho Hernangomez. Juancho scored no points in 17:50 for Denver, while his older brother had five points in 11:08 minutes for Charlotte.\n\nCONSULTANT FOR SERBIA?\n\nMalone denied a report that he's agreed to become a consultant for the Serbian national team.\n\n\"That's not accurate,\" Malone said before the game.\n\nUP NEXT\n\nHornets: Host Orlando on Monday.\n\nNuggets: At Golden State on Thursday. Denver is 4-2 this season on the second night of a back-to-back.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996068.008984
}