{
  "game_id": "0022300638",
  "espn_id": "401585266",
  "date": "Jan 26, 2024",
  "matchup": "MEM vs. ORL",
  "headline": "Jaren Jackson Jr. scores 30, Grizzlies hold on to beat Magic 107-106",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson Jr. had 30 points and eight rebounds, reserve Ziaire Williams added 17 points and the Memphis Grizzlies held on for a 107-106 victory over the Orlando Magic on Friday night.\n\n\r\n              Luke Kennard finished with 15 points — all on 3-pointers — and six assists as the Grizzlies won their third straight.\n\n\r\n              Paolo Banchero led the Magic with 27 points while Wendell Carter Jr. added 20 points and nine rebounds. Franz Wagner finished with 18 points for Orlando, which has lost seven of nine.\n\n\r\n              Orlando's Jalen Suggs suffered a bruised left knee in the first quarter and did not return. Magic coach Jamahl Mosley said the injury will be re-evaluated when the team returns to Orlando.\n\n\r\n              The Grizzlies built the first double-digit lead of the game in the third quarter and stretched it to 11 early in the fourth, but the Magic rallied behind Banchero, who had 12 points in the final period. His 3-pointer with 2:54 left cut the Memphis lead to 105-103, and Wagner's two free throws with 28.7 seconds left brought the Magic within 107-106.\n\n\r\n              The Orlando defense caused a shot-clock violation with 4.7 seconds left, giving the Magic the final possession. The ball came in to Banchero, who passed to Joe Ingles for a 3-point attempt from the left wing. It bounced out.\n\n\r\n              “I trust Joe to hit that shot,” Banchero said, adding: “I thought it was going in. It looked good, but it rattled out.”\n\n\r\n              Mosley said Banchero's pass to Ingles was one of the options Orlando drew up in the huddle during its final timeout.\n\n\r\n              “I don't know if you can ask for a better look at the end of the game,” Mosley said.\n\n\r\n              Jackson said with the Magic having the last possession, he knew the final shot could be a heartbreaker because Memphis wouldn’t have time to respond. He said Ingles’ shot looked like the ball “was in slow motion.”\n\n\r\n              “We’ve been playing against Joe Ingles so many times. I remember playing against Joe Ingles in Utah, and I don’t think I’ve ever seen him miss (a shot) like that,” Jackson said.\n\n\r\n              Memphis improved to 5-15 at home; the Grizzlies are 13-12 in away games.\n\n\r\n              Kennard has been asked to run more of the offense with Ja Morant out for the season and two other Memphis point guards — Marcus Smart and Derrick Rose — also injured. The Grizzlies had 30 assists.\n\n\r\n              “We've been telling each other to continue to play with the pass,” Kennard said. “Continue to move the ball. I think we've done a really good job over the past few games.”\n\n\r\n              Williams was 7 of 10 from the floor, including 3 of 6 from outside the arc as Memphis made 15 of 41 3-pointers (36.6%).\n\n\r\n              The teams exchanged leads in the first half while the Magic dealt with foul trouble for Banchero, who picked up three in the first quarter, and the injury to Suggs.\n\n\r\n              There were 12 lead changes and and 10 ties before halftime. An 18-7 push by Memphis to close the half gave the Grizzlies a 68-59 lead, the largest for either team at that point.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host Phoenix on Sunday.\n\n\r\n              Grizzlies: At Indianapolis on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996019.0187001
}