{
  "game_id": "0022300600",
  "espn_id": "401585228",
  "date": "Jan 21, 2024",
  "matchup": "BKN @ LAC",
  "headline": "Leonard scores 14 points in 5 minutes, Clippers overcome 18-point deficit to stun Nets 125-114",
  "body": "LOS ANGELES -- — After getting outhustled and outshot for three quarters, the Los Angeles Clippers turned into a team possessed.\n\n\r\n              Kawhi Leonard scored 14 of his 21 points in the final five minutes and the Clippers overcame an 18-point deficit with a game-ending 22-0 run to beat the Brooklyn Nets 125-114 on Sunday.\n\n\r\n              After getting outscored 16-0 to start the game, the Clippers were in catch-up mode.\n\n\r\n              “They came out and punched us in the mouth and in that fourth quarter we played Clipper basketball, got some stops and the rest is history,” said James Harden, who had 24 points and 10 assists.\n\n\r\n              The Clippers took their first lead on Leonard’s basket with 2:50 remaining. Their stunning run ended with Leonard’s 3-pointer from the corner to win for the 10th time in 12 games.\n\n\r\n              “He finally caught his rhythm,” Clippers coach Tyronn Lue said. “He’d been under the weather and wasn’t able to practice yesterday and we didn’t know if he was going to be able to go today.”\n\n\r\n              Russell Westbrook added 23 points off the bench to go with energy that picked up his lethargic teammates.\n\n\r\n              Leonard and Paul George struggled for most of the game. They combined for 11 of 32 from the floor. George finished with 12 points and seven rebounds. \n\n\r\n              “That was first of a kind, with a slow start and then get red-hot at the end,” George said. “We're going to always compete to the very end. Great thing about this group is we don't ever believe that we're down and out of it.”\n\n\r\n              Mikal Bridges scored 20 of his 26 points in the first half to lead the Nets, who were coming off an 18-point win over LeBron James and the Lakers on Friday night.\n\n\r\n              “Just got to be better for the whole 48,” Bridges said. “Definitely not fun.”\n\n\r\n              Down 18 points, the Clippers closed the game on a 39-10 run, scoring 22 in a row to cap it. The crowd roared as they scored nearly every time down the floor.\n\n\r\n              “It was like a party,” Harden said. “The energy was on hundred. That right there is home-court advantage.”\n\n\r\n              The Nets, who were 14 of 39 from 3-point range, couldn't make a basket during the Clippers' turnaround. They were held to 15 points in the fourth.\n\n\r\n              “We were stuck, didn’t know what to do or how to break it,” Bridges said.\n\n\r\n              Playing their first game in five days — with an early tipoff, too — the Clippers were out of it from the opening tip.\n\n\r\n              After the Nets led 16-0, the Clippers answered with an 18-2 run, including 10 in a row, to tie it at 18. But they trailed until Leonard's late heroics.\n\n\r\n              The Nets led 61-49 at halftime and were ahead 99-84 after three.\n\n\r\n              Nic Claxton went the extra inches to retrieve the ball with three minutes left. It got stuck behind the backboard and he was summoned to help as one of the taller players on the floor. Using a mop handle, he at first indicated it was too high for him. On the second try, he dislodged the ball, earning a hug from Leonard.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host New York on Tuesday night.\n\n\r\n              Clippers: Host the Lakers on Tuesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996344.292177
}