{
  "game_id": "401809782",
  "espn_id": "401809782",
  "date": "Nov 14, 2025",
  "matchup": "ORL vs BKN",
  "headline": "Wagner scores 25 as the Magic shut down Nets late on the way to a 105-98 victory",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 25 points, Tristan da Silva added 22 points and nine rebounds and the Orlando Magic held Brooklyn scoreless over the final two-and-a-half minutes for a 105-98 victory over the Nets on Friday night.\n\n\r\n              The win was Orlando's second in NBA Cup Group play and dropped Brooklyn to 0-2.\n\n\r\n              Michael Porter Jr. had 24 points and 11 rebounds for the Nets, who led 98-94 after a basket by Nic Claxton with 2:37 remaining. But, Wagner hit two 3-pointers, da Silva made one and Brooklyn never scored again.\n\n\r\n              Desmond Bane scored nine of his 19 points in the fourth quarter for Orlando and Jalen Suggs finished with 14 points, seven rebounds and six assists.\n\n\r\n              Ziaire Williams had 15 points and a steal late in the fourth quarter — off Orlando's 19th turnover — that put the Nets up 96-92. Noah Clowney had 12 points before fouling out with 1:58 remaining. \n\n\r\n              Da Silva got his first start of the season in place of Paolo Banchero, who is out with a strained left groin.\n\n\r\n              The Nets had a 53-37 lead midway through the second quarter, helped by 3-pointers, 59% overall shooting and 10 Magic turnovers. Three-pointers by da Silva and Bane, and Goga Bitadze's block of an attempted dunk by Terrance Mann, turned the game around quickly. Orlando outscored the Nets 25-5 over the next eight minutes and led by as many as seven in the third quarter.\n\n\r\n              After making six of their first 11 3-point shots, the Nets made only four of 29 and lost for the 11th time in 12 games.\n\n\r\n              Up next\r\n              Nets: At Washington on Sunday.\n\n\r\n              Magic: At Houston on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042622.212131
}