{
  "game_id": "0021900064",
  "espn_id": "401160706",
  "date": "Oct 30, 2019",
  "matchup": "CHA @ SAC",
  "headline": "Hornets rally from 14 down to beat winless Kings 118-111",
  "body": "SACRAMENTO, Calif. --  P.J. Washington controlled the post well enough to keep Charlotte close until the rest of his teammates found their rhythm. The Hornets rookie showed some versatility, too, when he stepped out and made a pair of shots beyond the arc.\n\nWashington scored 23 points to lead seven Charlotte players in double figures and the Hornets rallied from 14 down to beat the winless Sacramento Kings 118-111 on Wednesday night.\n\n\"I thought he imposed his will on that game immediately when he stepped on the floor,\" Charlotte coach James Borrego said. \"Right now we have a young man that has that potential to go down in the post and play out in the perimeter. That's a very complete young man.\"\n\nThe 12th overall pick in the draft, Washington has been everything the Hornets hoped for, particularly playing center when Borrego goes with his small lineup.\n\nWashington's perimeter shooting has provided an equally big boost. He had two 3s against the Kings and is shooting 13 of 25 beyond the arc through five games.\n\n\"I'm shooting it with confidence,\" Washington said. \"If I have an open look I'm definitely taking it. If you don't have a hand up I'm shooting it.\"\n\nTerry Rozier had 22 points, six assists and five rebounds for Charlotte, which hadn't won since beating Chicago in the season-opener. The Hornets set a franchise-record with 23 3-pointers against the Bulls and had another big night beyond the arc against Sacramento, going 16 of 32.\n\nCody Zeller added 12 points and 15 rebounds for Charlotte (2-3) while Malik Monk scored 18.\n\nBuddy Hield scored 23 points and Harrison Barnes had 22 for the Kings. Sacramento (0-5) is off to its worst start since 1990-91 when the Kings lost their first seven on the way to a 25-57 record.\n\n\"We have to punch back,\" said Sacramento's Richaun Holmes, who started at center as part of coach Luke Walton's attempt to shake the Kings out of their funk. \"Teams are going to make runs and we haven't responded, especially in the third quarter. We get punched. We have to be ready to respond.\"\n\nThe Hornets trailed 49-35 midway through the second quarter but closed within 66-61 at halftime, then took control in the third quarter. Rozier, Monk and Miles Bridges each made two 3-pointers, and Devonte Graham added a pair of free throws that made it 93-84.\n\nTIP-INS\n\nHornets: Nicolas Batum (broken middle finger) missed his third straight game after being hurt in the opener. Batum, who is expected to miss 3-4 weeks, has been able to practice while wearing a protective splint.\n\nKings: De'Aaron Fox had 16 points, 10 assists and seven rebounds. ... Sacramento's 14-point lead in the second quarter was its biggest of the season. The Kings had not led by more than 11 in its first four games. ... Marvin Bagley III (right thumb fracture) and Harry Giles (left knee soreness) did not play.\n\nHOLMES EARNS START\n\nHolmes has been Sacramento's most active player this season, which led coach Luke Walton to start him for the first time this season in place of 7-foot center Dewayne Dedmon. It paid off, as Holmes scored 11 of his 17 points in the first half. Holmes also had seven rebounds.\n\nGOING DEEP\n\nThe Hornets made eight 3-pointers in the third quarter -- one more than they had in the first half.\n\nWILD THING\n\nCharlotte guard Dwayne Bacon attempted a cross-court pass that sailed three rows into the stands in the third quarter.\n\nUP NEXT\n\nHornets: Play at Golden State on Saturday. Charlotte lost both games against the Warriors last season.\n\nKings: Host Utah on Friday. The Jazz have won seven straight in Sacramento.\n\n--\n\nMore AP NBA:https://apnews.com/tag/NBAandhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996111.5458581
}