{
  "game_id": "0022301220",
  "espn_id": "401616474",
  "date": "Dec 08, 2023",
  "matchup": "MIA vs. CLE",
  "headline": "Donovan Mitchell scores 27, Cavaliers use pair of 15-0 runs to top Heat 111-99",
  "body": "MIAMI -- — Donovan Mitchell had 27 points and 13 rebounds, Darius Garland shook off early foul trouble to score 18 points and the Cleveland Cavaliers beat the Miami Heat 111-99 on Friday night.\n\n\r\n              Georges Niang scored 13 and Max Strus added 11 in his first road game against his former team. The Cavaliers are now 7-3 on the road this season — tied with Oklahoma City and Minnesota for the best such mark in the NBA.\n\n\r\n              “We keep talking about the same thing,” Cleveland coach J.B. Bickerstaff said. \"Every night, we can control whether or not we’re the best team on the floor. Are we the most competitive? Are we the most selfless? And when the guys do that, the talent rises.”\n\n\r\n              Cleveland is 13-3 this season when holding teams under 120 points. The Cavs are 0-6 when teams score at least 120.\n\n\r\n              Josh Richardson and Kyle Lowry each scored 17 points for the Heat, who have lost five of their last seven. Jimmy Butler scored 16, Caleb Martin added 15, former Cavaliers forward Kevin Love had 14 points and 12 rebounds, and Jaime Jaquez Jr. also scored 12 for Miami.\n\n\r\n              The Cavaliers outrebounded Miami 51-37 — and held a 2-1 lead in 15-0 runs.\n\n\r\n              Miami scored 15 consecutive points early on the way to building a 16-point lead, and the Cavaliers had two 15-0 stretches later in the game.\n\n\r\n              Mitchell had the last basket of the first half to give Cleveland a 53-52 lead at the break, and then the Cavs got the first 13 points of the third quarter — with Mitchell scoring 11 of those to put his team on top for good.\n\n\r\n              “The third quarter kind of set that tone,” Mitchell said. “We've got to keep doing this.”\n\n\r\n              Miami has lost four games this season after leading by at least 16 points. It was the biggest deficit Cleveland has successfully overcome this season.\n\n\r\n              “I thought there was some decent things defensively throughout the course of the game,” Heat coach Erik Spoelstra said. “But not even scoring 100 points — granted, they're a good defense — but that's not going to get it done.”\n\n\r\n              Miami was again without Bam Adebayo (hip), Haywood Highsmith (back) and Tyler Herro (ankle). Adebayo has missed five of Miami’s last eight games, Herro has missed 14 straight games with a sprain and Highwood has basically missed three consecutive games; he sat out Miami’s last two and the last 45 minutes of a Monday loss to Indiana.\n\n\r\n              Cleveland played without Evan Mobley, who was held out with left knee soreness. It was Mobley’s first game missed this season and only the fourth he’s missed in Cleveland’s last 111 games, including playoffs.\n\n\r\n              Garland was whistled for three fouls in the game’s first 5:21 and the Heat got rolling when he had to go to the bench. The night’s first 15-0 run put Miami up 23-12; the lead eventually reached 39-23. Cleveland’s first 15-0 run immediately followed that stretch.\n\n\r\n              Miami got within nine in the fourth, but no closer and fell to 0-5 when not scoring at least 100 this season.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit Orlando on Monday.\n\n\r\n              Heat: Visit Charlotte on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995376.106873
}