{
  "game_id": "0022200589",
  "espn_id": "401468744",
  "date": "Jan 06, 2023",
  "matchup": "MIA @ PHX",
  "headline": "Victor Oladipo scores 26 points, Heat beat Suns 104-96",
  "body": "PHOENIX -- — It wasn't that long ago that Victor Oladipo was an All-Star guard.\n\n\r\n              On Friday night, the veteran Miami Heat guard showed he can still be that guy.\n\n\r\n              Oladipo scored a season-high 26 points off the bench, Bam Adebayo added 21 points and 11 rebounds and Miami beat the Phoenix Suns 104-96. The Heat finished 3-2 on an eight-day trip.\n\n\r\n              “He's been getting more comfortable, more confident and getting his legs under him,” Spolestra said about Oladipo. “He's a big-time X-factor for us on both sides of the floor.”\n\n\r\n              Later Spolestra added: “We haven't forgotten who he was. We just enjoy being on this journey with him.”\n\n\r\n              The Heat and Suns entered the game with the same record, but are heading in opposite directions. Miami has won nine of its last 13. Phoenix dropped to .500 and has lost five in a row, eight of nine and 13 of 17. \n\n\r\n              The Heat led for the majority of the game and never trailed in the second half, though it stayed fairly tight. Oladipo — who shot 7 of 10 from the field and 4 of 6 on 3-pointers — made a 3 with 1:36 left to put the Heat up 102-92.\n\n\r\n              Oladipo was a two-time All-Star with the Indiana Pacers in 2018 and 2019 before a string of serious injuries derailed his career. He has played just 74 games over the past four seasons. \n\n\r\n              “Vic's been great every night,” Heat guard Max Strus said. “Not just his penetration, but his defense has been phenomenal. Providing us a spark.”\n\n\r\n              Jimmy Butler added 20 points for the Heat, and Strus had 19. Adebayo shot 10 of 15 from the field.\n\n\r\n              “There are some good things happening,” Spolestra said. “And that's with a lot of moving parts, guys in and out of the lineup. More than anything, I respect that our guys are not making excuses for the moving parts.”\n\n\r\n              The banged-up Suns were already without several key players because of injuries, including three-time All-Star Devin Booker (groin strain), Cam Johnson (knee) and Cam Payne (foot). They got more bad news Friday when veteran point guard Chris Paul left in the second quarter with right hip soreness.\n\n\r\n              Deandre Ayton led the Suns with 23 points and 14 rebounds. Torrey Craig added 17 points.\n\n\r\n              The Heat also were missing a few pieces, including high-scoring guard Tyler Herro, who was out because of back spasms. But Oladipo's offense made up for Herro's absence and Miami's defense forced Phoenix into just 41.5% shooting from the field, including 26.1% from 3-point range.\n\n\r\n              Oladipo banked home a half-court shot at the end of the first quarter to give the Heat a 30-23 advantage. Miami kept its advantage through most of the second quarter and led 51-46 at halftime.\n\n\r\n              Oladipo had another buzzer beater at the end of the third quarter, making a driving layup to push the Heat ahead 78-73.\n\n\r\n              TIP-INS\n\n\r\n              Heat: Herro, Caleb Martin (quad strain) and Duncan Robinson (finger) were among six players who were out.\n\n\r\n              Suns: Paul had five points on 2-of-3 shooting in 12 minutes. ... Duane Washington Jr. had 13 points and seven assists off the bench but shot just 5 of 18 from the field. \n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Brooklyn on Sunday night.\n\n\r\n              Suns: Host Cleveland on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993965.810323
}