{
  "game_id": "0022300844",
  "espn_id": "401585472",
  "date": "Feb 28, 2024",
  "matchup": "TOR vs. DAL",
  "headline": "Doncic gets 11th triple-double of season on 25th birthday as Mavericks beat Raptors 136-125",
  "body": "TORONTO -- — Luka Doncic had 30 points, 16 assists and 11 rebounds on his 25th birthday for his 11th triple-double of the season, Kyrie Irving scored 15 of his 29 points in the fourth quarter and the Dallas Mavericks beat the Toronto Raptors 136-125 on Wednesday night.\n\n\r\n              Doncic, the NBA’s leading scorer, is the first player in league history to record a 30-point triple-double on his birthday. He has scored 25 or more points in nine straight games, topping 40 twice in that stretch.\n\n\r\n              “Just a normal game, triple-double,” Dallas coach Jason Kidd said. “He was really good. I guess 25 means he’s still going to be really good as he gets older here.”\n\n\r\n              Doncic shot 11 for 23, going just 1 of 8 from 3-point range, as Dallas snapped a two-game skid. He went 7 for 9 at the foul line.\n\n\r\n              Asked whether he considered 25 a milestone birthday, Doncic first asked for an explanation of the word before dismissing the idea.\n\n\r\n              “I feel like 40, so no,” the Slovenian star said with a smile.\n\n\r\n              Doncic and Irving scored 22 points in the first half, then combined for 37 after the break.\n\n\r\n              “Kyrie and Luka, they had such a poise in important moments to make the right plays,” Raptors coach Darko Rajakovic said\n\n\r\n              P.J. Washington Jr. added 23 points and Tim Hardaway Jr. had 16 for Dallas. Daniel Gafford scored 13 points as the Mavericks bounced back from Tuesday’s tough loss at Cleveland, when Max Strus hit a 59-footer as time expired to give the Cavaliers a wild 121-119 win.\n\n\r\n              Doncic said he didn’t spend any time dwelling on that defeat.\n\n\r\n              “Zero,” he said. “That’s the beauty of the NBA, you get another chance the next day.”\n\n\r\n              Scottie Barnes had 19 points and 11 rebounds for his fifth straight double-double, Immanuel Quickley scored a season-high 28 points and RJ Barrett had 26 points for the Raptors, who lost for the first time in four games since the All-Star break.\n\n\r\n              Jakob Poeltl scored 16 points, Kelly Olynyk had 13 and Gary Trent Jr. 11, but Toronto couldn’t win a third straight meeting with the Mavericks.\n\n\r\n              Doncic had six of Dallas’ eight assists in the first quarter, including an eye-popping no-look, over-the-shoulder pass to Hardaway for a wide-open 3-pointer. Washington scored 13 points in the first as the Mavs led 36-34 after one.\n\n\r\n              “Just seeing the way he breaks down the game and the way he can pass the ball, I think he’s special,” Washington said of Doncic.\n\n\r\n              Doncic scored eight points in the second and Hardaway added nine for Dallas, but Quickley had 10 points for Toronto as the Raptors took a 67-66 lead at the half.\n\n\r\n              Dallas turned the ball over 10 times in the first half, leading to 15 points for the Raptors, but the Mavericks had just two miscues in the third. Doncic scored 11 points in the quarter and added six more assists as Dallas took a 106-92 edge to the fourth.\n\n\r\n              The Mavericks played without big man Maxi Kleber, who sat because of a dislocated right small toe dislocation and nasal fracture. Dallas guard Dante Exum (right knee) played for the first time since Jan. 26 at Atlanta, ending a 13-game absence.\n\n\r\n              “I thought his pace, his ability to run the offense and get Timmy and Ky shots, it was seamless,” Kidd said of Exum. “It seemed like he hasn’t been gone.”\n\n\r\n              Toronto forward Chris Boucher was not available because of an illness.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Visit Boston on Friday.\n\n\r\n              Raptors: Host Golden State on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995811.555937
}