{
  "game_id": "0021600904",
  "espn_id": "400899445",
  "date": "Mar 01, 2017",
  "matchup": "HOU @ LAC",
  "headline": "Harden scores 26, Rockets hit 20 3s to beat Clippers 122-103",
  "body": "LOS ANGELES --  When the Houston Rockets get going the way they did Wednesday night, all those 3-pointers become a blur.\n\nJames Harden scored 26 points and the Rockets hit 20 of their first 39 attempts from beyond the arc in a 122-103 victory over the Los Angeles Clippers.\n\nHouston opened a 31-point lead early in the fourth quarter, so it didn't even matter that the Rockets missed their last 13 tries from 3-point range.\n\n\"You don't really realize how many we are taking until you hear later because it's so naturally the way we play,\" said Ryan Anderson, who had 23 points and a team-high six 3s. \"It's fun basketball when you trust the next guy to give up the shot and make the right play to get the open look.\"\n\nTrailing 44-43 with 8:56 left in the second quarter, the Rockets outscored Los Angeles 66-34 over the next 21-plus minutes as they reached new heights for coach Mike D'Antoni.\n\n\"There were so many guys who played well,\" D'Antoni said. \"Probably our best game start to finish. It started early in the quarter when our second group came in and did a heck of a good job.\n\n\"It was a combination of things. They didn't play particularly well. They missed a few shots and James was picking them apart.\"\n\nHarden hit four 3s and handed out nine assists. He's already eyeing postseason possibilities, too.\n\n\"We know how important these last 20 games are,\" Harden said. \"A playoff atmosphere, against pretty good competition -- we had to come out and get a win.\"\n\nHouston extended its NBA record to nine games with 20 or more 3-pointers this season. And with their seventh victory in nine games overall, the Rockets shook off a 117-108 loss to Indiana two nights earlier.\n\n\"That was a big game for us, important obviously to bounce back,\" Anderson said. \"We didn't play the game we wanted to play last game. We got stops, really paid attention to detail on the defensive end, and ran the ball on them. That's where we knew we would have an advantage. It was a great effort tonight.\"\n\nNene added 16 points, while Eric Gordon, Patrick Beverley and Clint Capela had 14 apiece for Houston, which outrebounded the Clippers 62-35.\n\n\"That's what we're going to need if we want a chance to go where we want to go,\" Harden said.\n\nIn four games since the All-Star break, the Rockets, who lead the NBA in 3-pointers made and attempted, have hit 72 on 206 attempts, an average of 18 of 52 from beyond the arc.\n\n\"We're going to shoot them,\" Harden said. \"That's what we do. If they're open shots, they're good looks for us.\"\n\nChris Paul had 16 points and 10 assists to lead the Clippers, who lost for the third time in four games. Blake Griffin added 17 points, Austin Rivers scored 16 and Luc Mbah a Moute 13 for Los Angeles.\n\n\"Most of all it was our defense,\" Paul said. \"I think that's where (the Rockets) sort of break your spirit when they make all those tough 3s. We have to be able to, when they make a shot, get it out, run it back down and score ourselves.\"\n\nHouston's 70-58 halftime lead marked the eighth time this season the Rockets had 70 or more points by halftime. They made 11 of 24 3-pointers in the first half.\n\nTrailing 44-43, the Rockets ran off 13 unanswered points, taking a 56-44 lead on Capela's layup with 6:38 to play in the second quarter. Houston extended the spurt to 22-5 when Harden made three free throws for a 65-49 advantage with 2:19 left in the half.\n\nAfter Clippers closed to 70-60, the Rockets made seven 3s over the next 3:51, taking a 93-69 lead on Beverley's 3-pointer with 6:07 left in the third.\n\nTrailing 109-78 with 11:14 to play, the Clippers outscored Houston 15-2 to pull to 111-93 but got no closer.\n\nTIP-INS\n\nRockets: Gordon's 3-pointer with 10:04 left in the second quarter was the Rockets' 900th of the season. They entered with 892 in 61 games, 117 ahead of the 2015-16 Golden State Warriors, who set the NBA single-season record with 1,077. Gordon's 3 with 7:21 left in the second was Houston's 10th of the game, marking the 58th time in 62 games this season the Rockets have had 10 or more. ... Houston has beaten the Clippers in six of their last eight meetings.\n\nClippers: Played their third straight game with a lineup that included both Griffin and Paul, who returned on Feb. 24 after missing 14 games with a torn ligament in his left thumb. Coming into the game, the Clippers were 20-8 when Griffin and Paul both played, and 16-15 in all other games.\n\nUP NEXT\n\nRockets: Host the Memphis Grizzlies on Saturday night.\n\nClippers: At the Milwaukee Bucks on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995749.423695
}