{
  "game_id": "0022200746",
  "espn_id": "401468901",
  "date": "Jan 28, 2023",
  "matchup": "MIN vs. SAC",
  "headline": "Edwards scores 34, Timberwolves beat Kings 117-110",
  "body": "MINNEAPOLIS -- — Anthony Edwards had 16 of his 34 points in the pivotal third quarter, D’Angelo Russell scored 25 points and the Minnesota Timberwolves held on for a 117-110 win against the Sacramento Kings on Saturday night.\n\n\r\n              Rudy Gobert added 13 points and 14 rebounds for Minnesota, which has won five of six and took the first of two straight meetings between the teams at Target Center. Naz Reid added 14 points off the bench, including 10 in the Timberwolves’ big third.\n\n\r\n              “We’re taking a lot of pride in defense and it feels like our urgency is at a much higher level than it was earlier in the season,” Gobert said. “It’s exciting because it’s what you need to be a really good team in this league.\"\n\n\r\n              Domantas Sabonis had 23 points and 10 rebounds for Sacramento, which has lost three of four after a six-game winning streak earlier in January. De’Aaron Fox had 21 of his 29 points in the fourth as the Kings closed within 114-110 with 37.9 seconds left before Edwards hit a 3-pointer to put the game away.\n\n\r\n              “That is fool’s gold if we think as a team and organization that we’re going to just beat teams by outscoring them,” Sacramento coach Mike Brown said. “It’s not going to happen, especially come playoff time. So, somehow, someway, I have to find combinations of players that can score and that are willing to get stops for us.”\n\n\r\n              Russell got Minnesota started with 12 points in the first and he hit his first six 3s to continue his torrid shooting. In his previous 12 games, Russell was hitting 49.1% from the field and 47.1% from 3. His season average from 3-point range coming in was 38.1%.\n\n\r\n              Sacramento later closed the first half on a 26-14 run to lead 59-57. But the defensive issues again were an issue in the second half.\n\n\r\n              “We can’t let teams just run their stuff, get their spots and shoot the ball right over us,” Fox said. “You don’t want to pick up fouls, but you want to try to be physical as much as possible without picking up silly fouls.”\n\n\r\n              Edwards put the Timberwolves back in front as he scored 10 points during a 13-2 third-quarter stretch that saw Minnesota regain control. The Wolves outscored the Kings by 11 in the quarter, a night after the third was the key in a win over Memphis.\n\n\r\n              “I don’t know if it’s intentional, but it’s kind of how they’re doing it,” Minnesota coach Chris Finch said of Russell scoring early and Edwards taking charge later. “DLo is staying ready. His catch-and-shoot is really on point. That’s big for him, and for us. And, obviously, he exits and Ant is out there by himself and kind of turns it up a notch.”\n\n\r\n              TURN THE THIRD\n\n\r\n              Minnesota has been outscored by 106 points in the third, the second-highest total in the NBA and the 2.1-point average per game was tied for second. But in January, when Edwards has taken over in the period, the Wolves are a plus-26 in the third in 15 games.\n\n\r\n              Edwards is averaging 8.5 points in the third in January, which is the 12th-highest total in the league during that span.\n\n\r\n              “I feel like I can’t miss right now, to be honest,” Edwards said of his 3-point shooting. “I don’t want to jinx myself, but right now, I feel like I just can’t miss. I put a lot of work in, man. So, I’m happy it’s showing.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: Sacramento entered shooting 37.2% from 3 this season, the eighth-best total in the NBA. But the Kings were 9 of 33 (27.3%) from 3 in the game. ... Harrison Barnes was 10 of 11 from the line and scored 13.\n\n\r\n              Timberwolves: Taurean Prince missed his fourth straight game with a left ankle sprain, but he could be nearing a return. He was able to work out on the court before the game. ... Minnesota committed 20 turnovers, leading to 21 points for Sacramento. ... Edwards has scored at least 31 in four of the last five games. He added 10 rebounds in the game.\n\n\r\n              UP NEXT\n\n\r\n              The second game between the teams is Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995167.541964
}