{
  "game_id": "0021800587",
  "espn_id": "401071263",
  "date": "Jan 06, 2019",
  "matchup": "MIA @ ATL",
  "headline": "Young, Collins power undermanned Hawks past Heat",
  "body": "ATLANTA --  Trae Young reached out to Dwyane Wade twice in hopes he'd get a signed jersey in the star's last game in Atlanta.\n\nWade, whose son Zaire is friends with Young, gladly obliged.\n\n\"I texted him and I was like, `I need it for the last time in the ATL,\" Young said. \"He said, `I already got it planned.' It was cool to talk to him.\"\n\nYoung scored 19 points, John Collins had 13 points and 13 rebounds, and the Hawks snapped a three-game skid with a 106-82 victory over the Miami Heat on Sunday night.\n\nPerhaps it helped Wade get over the Heat's worst performance of the season. Coming off two straight wins that had moved it over .500 for the first time since Oct. 27, Miami was listless all night against a rebuilding team missing its second- and third-leading scorers and lost for the third time to an opponent that has just 12 victories.\n\n\"It was a bad game for us,\" Wade said. \"We're 0-3 versus this team. They've figured out a way to make us not play our game. I don't know what it is. Ask them.\"\n\nDeAndre' Bembry finished with 17 points in a starting role, and Jeremy Lin came off the bench to add 15 for Atlanta.\n\nYoung, the NBA's fifth overall draft pick, had some dazzling moves handling the ball, but he finished with just two assists. His skills were still enough to impress Wade.\n\n\"He's got a great relationship with my son, which I appreciate,\" Wade said. \"And he's somebody whose game, you know, honestly, I look at him, I talk to him on different occasions, respect to him. A lot of people said a lot of things about Trae. He's got a long career ahead of him.\"\n\nDerrick Jones Jr. led Miami with 14 points, Justise Winslow scored 13 and Wade and Josh Richardson each had 11 for the Heat, who seemed disinterested in defending after the Hawks jumped to a comfortable lead late in the third.\n\nMiami missed 20 of its first 22 attempts beyond the arc before Wade hit his 500th career 3-pointer. He joined Michael Jordan and LeBron James as the only players in NBA history with at least 20,000 points, 5,000 assists, 4,000 rebounds, 1,500 steals, 800 blocks and 500 3s.\n\nThe matchup seemed heavily in Miami's favor with the Hawks coming off a 32-point loss at Milwaukee, but the Heat struggled throughout the first half, going 1 for 16 on 3s, getting outrebounded 33-24 and committing 10 turnovers that led to 11 Atlanta points.\n\nIt only got worse in the third as the Heat kept whiffing and Atlanta jumped to a 19-point lead on consecutive 3s by Daniel Hamilton and Lin. Lin followed with consecutive runners.\n\nThe Hawks jumped out to an 18-6 lead, but Miami was up 33-31 in the second when Rodney McGruder hit a layup. The Heat did not lead again.\n\nTIP-INS\n\nHeat: G Dion Waiters is still far from 100 percent. He missed his second straight game since making his first appearance in over a year when the Heat won at Cleveland last Wednesday. Waiters, who played that game because Wade was sidelined by a virus, is still limited by a sore left ankle that required surgery last January.\n\nHawks: With G Kent Bazemore out the next two weeks with a right ankle injury, Bembry made his third start. Hamilton started in Friday's blowout loss at Milwaukee. ... Lin had his 500th career steal.\n\nCLOTHING EXCHANGE\n\nEven though he had to lobby for the jersey, Young got what he wanted, and so did Wade. Wade, the 12-time All-Star who's retiring after the season, brought a jersey he'd signed beforehand and gave it to him at halfcourt. Young took his jersey off, signed it and gave it to Wade.\n\n\"I've been able to swap jerseys with a lot of veterans in the league, but it's good when the younger guys come in and they want your jersey as well,\" Wade said. \"I'm honored. I'm ready to watch his career for a long time. As I let him know, we'll make sure we get some work in together and I want to put him and my son together.\"\n\nSHOWING WADE LOVE\n\nThe Hawks showed a video tribute to Wade early in the first quarter. He received a standing ovation, smiled and waved to the crowd.\n\nIt didn't take Wade long to stir excitement when entered the game a few minutes later. He flipped a backward pass over his shoulder to assist on Jones' dunk and took a pass on the baseline to hit a double-pump reverse layup that cut the lead to 23-16.\n\n\"Just trying to do something for the fans tonight,\" he said. \"Probably the only moments we gave them to cheer for.\"\n\nAfter the game ended and he walked off the court holding Young's jersey, Wade stopped to another standing ovation on one end of the arena. He signed some autographs, smiled and headed into the tunnel.\n\nUP NEXT\n\nHeat: Host Denver, the Western Conference leader at 26-11, on Monday.\n\nHawks: Visit Toronto, tops in the East with 29 victories, on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995247.509181
}