{
  "game_id": "0021601073",
  "espn_id": "400900468",
  "date": "Mar 24, 2017",
  "matchup": "CHA vs. CLE",
  "headline": "James, Cavs bounce back with 112-105 victory over Hornets",
  "body": "CHARLOTTE, N.C. --  LeBron James sat at his locker dabbing his right eye with a wet compress while having difficulty keeping it open.\n\nA battle scar from a rough night.\n\nJames will meet with an eye doctor after a physical game in which he got poked in the eye by Jeremy Lamb, but remained in the game to lead the Cleveland Cavaliers to a Central Division-clinching 112-105 victory over the Charlotte Hornets on Friday night.\n\nJames finished with 32 points, 11 assists and nine rebounds as the Cavaliers bounced back from their worst defensive outing of the season Wednesday night in a loss to the Denver Nuggets.\n\n\"If Coach decides to give me a game off, it's not because I'm resting, it's because I'm banged up,\" James said with a hint of sarcasm referring to the grief Tyronn Lue and the Cavaliers took from the league for resting James, Irving and Love earlier this week against the Los Angeles Clippers.\n\nJames' status for Saturday night's home game against the Washington Wizards is unclear.\n\n\"I'll be all right,\" James said.\n\nKyrie Irving added 26 points and Kevin Love had 15 points and 12 rebounds as the Cavaliers snapped Charlotte's three-game winning streak and remained atop the Eastern Conference standings.\n\n\"Winning and continuing to hold this No. 1 seed and winning our division is good for the offense,\" Lue said. \"I want to see us continue to play well. That's going to be my challenge going down the stretch.\"\n\nLue called it the most physical game his team has played all season.\n\nJames got hit in the eye by Lamb when he scored on a layup in the closing seconds of the third quarter.\n\nHe remained down on the court for more than the minute. When he finally lined up at the foul line to complete the three-point play, he threw the ball back to the referee because he was unable to focus and the Cavs took a timeout. James returned the floor and sank the free throw.\n\nLater in the fourth quarter, James took a hard foul on a drive to the hole and was slow to get up after landing on his back. He took hard contact on two other drives as well.\n\n\"I liked our disposition tonight,\" James said. \"We came in with a physical mindset and it basically helped us win the game. Because we were physical from the start all the way to the finish.\"\n\nThe Cavaliers did it with defense.\n\nAfter allowing 73 first-half points -- and 70 in the paint -- in a 126-113 loss to the Nuggets, the Cavaliers held the Hornets to 42 percent shooting from the field. It was a welcome change for Lue, whose team had allowed its previous four opponents to shoot better than 50 percent from the field.\n\n\"We got their best tonight,\" Hornets coach Steve Clifford said. \"After you watch the game in Denver and you saw LeBron's quotes postgame, basically he called his teammates out, so you knew they were going to come in and be very intense tonight.\"\n\nThe Hornets had a chance to tie the game at 100 with 4 1/2 minutes left, but Kemba Walker made only one of two free throws. The Cavs took over from there with JR Smith knocking down a 3-pointer from the corner and Love a 12-footer. James then converted in the lane to push the lead to eight.\n\nNic Batum missed an open 3-pointer from the left wing with 25 seconds left that would have cut the lead to two. James iced the game with two free throws.\n\nTIP INS\n\nCavaliers: Irving had his 54th 20-point game of the season. ... James barely missed out on his 11th triple-double of the season, falling one rebound short. ... The Cavaliers have swept the Hornets seven times.\n\nHornets: Frank Kaminsky had a rough night, going 0 for 9 from the field. ... Center Miles Plumlee was cleared to play after missing the last 16 games, but didn't see any action.\n\nWALKER KEEPS UP PACE\n\nCharlotte was led by Walker, who had 28 points on five 3-pointers. Walker now has 208 3-pointers this season, second-most in franchise history.\n\nNEED BETTER DEFENSE\n\nClifford wasn't happy with his team's defense, particularly on pick and rolls where players were routinely out of place.\n\n\"We've got to be smarter. We've got to be smarter with the basic stuff, smarter, all the time,\" Clifford said.\n\nUP NEXT\n\nCavaliers: After an eventful road trip, the world champions return home Saturday night to host the Wizards.\n\nHornets: Have a rare Sunday matinee when they host the Suns.",
  "source": "espn_api",
  "crawled_at": 1764995467.8994849
}