{
  "game_id": "0022400324",
  "espn_id": "401704890",
  "date": "Dec 04, 2024",
  "matchup": "LAC vs. MIN",
  "headline": "Julius Randle scores 20 points as Timberwolves cruise to 108-80 victory over Clippers",
  "body": "INGLEWOOD, Calif. -- — Julius Randle scored 16 of his 20 points in the first quarter, Anthony Edwards added 16 and the Minnesota Timberwolves rolled to a 108-80 victory over the Los Angeles Clippers on Wednesday night.\n\n\r\n              Randle had all of his points in the first half, including four 3-pointers, to help Minnesota win its third straight after losing four in a row. The Timberwolves were up by 27 at halftime and their largest lead was 41 in the second half.\n\n\r\n              Bones Hyland led the Clippers with 18 points, including a season-high five 3-pointers. Derrick Jones Jr. scored 14 points.\n\n\r\n              The Clippers had their nine-game home winning streak snapped.\n\n\r\n              Takeaways\r\n              Timberwolves: Josh Minott came off the bench to score 13 points. The Timberwolves had a 32-8 advantage in fast-break points, including 20-0 in the first half.\n\n\r\n              Clippers: LA fell to 3-3 on the second night of a back-to-back, and is at 8-4 in back-to-backs overall.\n\n\r\n              Key moment\r\n              The Clippers had a 10-9 lead before the Timberwolves took control with an 18-4 run during a nearly four-minute span during the first quarter. Randle scored eight points during the spurt and Randle added five.\n\n\r\n              Key stat\r\n              With the Lakers' 41-point loss at Miami earlier Wednesday, it is only the second time both Los Angeles teams have lost by 25 points or more when playing the same night according to Sportradar. The other was April 18, 2005, when the Clippers lost by 25 to Houston, and Golden State beat the Lakers by 27.\n\n\r\n              Up next\r\n              The Timberwolves are at Golden State on Friday night. The Clippers host Houston on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997886.268836
}