{
  "game_id": "0022000989",
  "espn_id": "401307792",
  "date": "May 04, 2021",
  "matchup": "LAC vs. TOR",
  "headline": "Clippers rally to beat Raptors 105-100, end 3-game skid",
  "body": "LOS ANGELES -- — Paul George and Marcus Morris scored 22 points each, and the Los Angeles Clippers rallied for a 105-100 victory over the Toronto Raptors on Tuesday night to snap a three-game skid.\n\n\r\n                    Reggie Jackson added 18 points and Kawhi Leonard had 13 points while taking just six shots to help the Clippers avoid their first four-game losing streak of the season.\n\n\r\n                    “If they’re going to play defense like that, then I have to trust my teammates and make the right play every time,” said Leonard, who played his second game after being out with a sore right foot. “It’s not about me, it’s about the whole group.”\n\n\r\n                    George and Jackson hit 3-pointers in the final two minutes, snapping a 99-all tie and putting the Clippers in control in the teams' first meeting this season.\n\n\r\n                    The Clippers have already clinched a playoff spot. The Raptors are jockeying for a spot in the play-in tournament with six games remaining. They are just outside of the No. 10 seed.\n\n\r\n                    Fred VanVleet had 27 points and 13 assists to lead Toronto in his return after missing eight games with a sore hip. Pascal Siakam added 24 points and Khem Birch had 13 points and eight rebounds.\n\n\r\n                    “He played really well,” Raptors coach Nick Nurse said of VanVleet. “Maybe if he'd banged in a couple of those threes at the end, we'd put him in the great-game category.”\n\n\r\n                    The Raptors went 1/3 on their Western swing as they press for a playoff spot.\n\n\r\n                    “We need to get some more wins out of this situation,” VanVleet said. “We’re playing damn good basketball, just not enough to beat some of these teams.”\n\n\r\n                    Los Angeles led 88-84 early in the fourth when the Raptors ran off 10 in a row to go ahead 94-88. Jalen Harris and VanVleet sandwiched 3-pointers around baskets by Birch.\n\n\r\n                    The teams traded leads, with Jackson's jumper tying it at 99-all. George's 3-pointer put the Clippers in front for good after they rallied from six points down early in the fourth.\n\n\r\n                    “They just kind of outlasted us,” VanVleet said.\n\n\r\n                    After trailing most of the first half, the Clippers tied it in the third, when they outscored the Raptors 34-28. Siakam scored 11 straight points just before Morris and Leonard hit back-to-back 3-pointers to make it 71-all. But Harris made a 3-pointer that tied it at 82-all going into the fourth.\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Kyle Lowry (lower back stiffness) sat out two days after scoring a season-high 37 points against the Lakers. ... Also out were OG Anunoby (left calf strain) and Chris Boucher (left knee sprain.)\n\n\r\n                    Clippers: Serge Ibaka has been out since March 15 with lower back tightness, but is back on the practice court. ... Amir Coffey was out due to health and safety protocols.\n\n\r\n                    BEVERLEY RETURNS\n\n\r\n                    Patrick Beverley scored eight points off the bench in his first game since April 8 after being out with a fractured hand. Jackson started in his place and Beverley indicated he's OK with that.\n\n\r\n                    “Just trying to get my legs under me,” he said. “That’s going to take a process, so don’t need to rush anything.”\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Host Washington in the opener of a three-game home stand. “That's probably our last-chance saloon,” Nurse said.\n\n\r\n                    Clippers: Host the Lakers on Thursday in a possible playoff preview.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997660.162876
}