{
  "game_id": "401810018",
  "espn_id": "401810018",
  "date": "Nov 03, 2025",
  "matchup": "POR vs LAL",
  "headline": "Lakers overcome the absence of Doncic and Reaves for a 123-115 win over the Blazers",
  "body": "PORTLAND, Ore. -- — Deandre Ayton had 29 points, 10 rebounds and three blocked shots against his former team, leading the short-handed Los Angeles Lakers to a 123-115 victory over the Portland Trail Blazers on Monday night. \n\n\r\n              Rui Hachimura added 28 points for the Lakers, who were missing both Luka Doncic and Austin Reaves after both played the night before in a 130-120 victory over Miami. \n\n\r\n              Nick Smith Jr., who is on a two-way deal, hit a pair of 3-pointers to help the Lakers pull away in the final minutes and finished with 25 points. \n\n\r\n              Deni Avdija had 33 points for the Blazers, who had their three-game winning streak snapped. \n\n\r\n              The Lakers, who won their fourth straight, were down to nine available players. Doncic, who had 29 points, 11 rebounds and 10 assists against the Heat, was unavailable due to lower left leg contusion injury management. The injury forced him to miss three games earlier this season. \n\n\r\n              Reaves was ruled out because of right groin soreness after having 26 points and 11 assists against Miami. Ayton, who spent the last two seasons with the Blazers, was a game-time decision with back spasms but started.\n\n\r\n              The Blazers went up 39-29 in the first half on Jerami Grant's emphatic dunk and led by as many as 13 points, but the Lakers chipped away and closed to 55-52 at the break. \n\n\r\n              Hachimura's layup pulled the Lakers even at 66-all before Marcus Smart's basket put them in front to cap a 10-1 run midway through the third quarter. \n\n\r\n              Los Angeles was up 90-86 heading into the fourth quarter but Portland narrowed the gap to 97-96 on Jrue Holiday's layup. But the Lakers held the Blazers off down the stretch, going ahead 107-100 on Ayton's layup. \n\n\r\n              The Blazers struggled throughout the game from the perimeter, making just nine of 40 3-point attempts. \n\n\r\n              Up next\r\n              Lakers: Host the San Antonio Spurs on Wednesday\n\n\r\n              Trail Blazers: Host the Oklahoma City Thunder on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042557.144831
}