{
  "game_id": "0022401101",
  "espn_id": "401705667",
  "date": "Apr 01, 2025",
  "matchup": "MIL vs. PHX",
  "headline": "Bucks set team record for field-goal percentage in 133-123 victory over Suns",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 37 points and the Milwaukee Bucks relied on a team-record shooting performance to snap a four-game skid by winning 133-123 over the slumping and short-handed Phoenix Suns on Tuesday night.\n\n\r\n              The Bucks shot 68.9% (51 of 73) from the floor to set a franchise record for field-goal percentage. The previous record was 66.7% on Dec. 15, 1985, against Sacramento.\n\n\r\n              Bucks coach Doc Rivers improved his career record to 1,155-816 and tied Phil Jackson for seventh place in NBA history in regular-season wins.\n\n\r\n              The Suns lost their fourth straight. They were playing without Kevin Durant, Bradley Beal and Royce O’Neale.\n\n\r\n              Durant sprained his left ankle Sunday and isn’t expected to be available for this entire three-game trip. Beal has a hamstring injury and last played on March 16. O’Neale is dealing with an illness.\n\n\r\n              Devin Booker had 39 points and 11 assists for Phoenix. Grayson Allen added 23 points and Collin Gillespie had 18.\n\n\r\n              Ryan Rollins scored 23 and Brook Lopez had 22 for Milwaukee.\n\n\r\n              This marked the first time Phoenix’s Mike Budenholzer had coached against Milwaukee at Fiserv Forum since the Bucks fired him two years ago. Budenholzer coached the Bucks from 2018-23 and led the franchise to a title in 2021.\n\n\r\n              Takeaways\r\n              Suns: Phoenix fell two games behind ninth-place Dallas and 1 1/2 games behind 10th-place Sacramento in the Western Conference standings. \n\n\r\n              Bucks: Milwaukee moved within three games of fourth-place Indiana and one game of fifth-place Detroit in the East. \n\n\r\n              Key moment\r\n              After trailing by 22 in the second half, Phoenix cut Milwaukee’s lead to 124-120 on Grayson Allen's 3-pointer with 1:20 left. Milwaukee’s Ryan Rollins responded 11 seconds later by sinking a 3-pointer to give the Bucks some breathing room.\n\n\r\n              Key stat\r\n              Milwaukee was 17 of 29 from 3-point range.\n\n\r\n              Up next\r\n              The Bucks visit Philadelphia on Thursday. The Suns are at Boston on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997817.965933
}