{
  "game_id": "0021900270",
  "espn_id": "401160912",
  "date": "Nov 29, 2019",
  "matchup": "MIL @ CLE",
  "headline": "Giannis Antetokounmpo leads way with 33 as Bucks win 10th straight",
  "body": "CLEVELAND -- Giannis Antetokounmpo scored 11 of his 33 points in the fourth quarter and the Milwaukee Bucks held off the Cleveland Cavaliers 119-110 on Friday night for their 10th consecutive victory.\nCleveland trailed 74-52 early in the third quarter, but hit 10 3-pointers in the period and cut the lead into single figures. The Cavaliers continued to rally and Kevin Love's layup made it 113-110 with 2 minutes, 20 seconds left -- Cleveland's final points of the game.\nKhris Middleton's jumper and two free throws by George Hill put the game away, but Antetokounmpo was once again the difference-maker. The reigning MVP scored in a variety of ways with the game on the line, including a 3-pointer, a floating jumper, a tip-in and a dunk off an offensive rebound.\nCleveland got back in it with Antetokounmpo taking a rest in the third quarter. The Cavaliers had 42 points, their highest-scoring quarter of the season.\nAntetokounmpo grabbed 12 rebounds and has had double-doubles in every game this season for Milwaukee, at 16-3 the top team in the Eastern Conference. The Bucks hadn't won 10 in a row since the 1985-86 season.\nHill scored 18 points and Middleton, playing for the second time since missing seven games with a bruised left thigh, had 12.\nCleveland has dropped nine of 10. Rookie Darius Garland scored 21 points, including five 3-pointers, and Cedi Osman had 20. Tristan Thompson had 11 points and 13 rebounds, including the 5,000th of his career in the first half.\nLove, who is playing despite dealing with a sore back, had 16 points and 8 rebounds in 31 minutes.\nAntetokounmpo was 14-of-26 from the field and took charge after Milwaukee won the opening tip. He cut to the basket, took a bounce pass from Eric Bledsoe, dunked with his right hand over Love and completed the three-point play at the foul line.\nAntetokounmpo's dunk came just 13 seconds into the game. Love, who came over to help after Antetokounmpo evaded his defender, leaped to block the attempt but was whistled for the foul.\nLove missed games Saturday and Monday, and was limited to 24 minutes Wednesday.\nTIP-INS\nBucks: The record for most consecutive double-doubles to start an NBA season is 34, set by Bill Walton in 1977. ... Hill (sore back) returned after missing two games.\nCavaliers: Cleveland hit 17 of 34 3-pointers. ... Larry Nance Jr. had 18 points. ... Cleveland had 15 turnovers after committing 25 Wednesday.\nCOMEBACK KID\nMiddleton has come off the bench in both games since returning from the injury. Bucks coach Mike Budenholzer said he will rejoin the starting lineup soon. \"It's going to be very short term, him not starting,\" Budenholzer said.\nUP NEXT\nBucks: Host Charlotte on Saturday night.\nCavaliers: Host Detroit on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764996166.044954
}