{
  "game_id": "0022000635",
  "espn_id": "401307422",
  "date": "Mar 19, 2021",
  "matchup": "DET @ HOU",
  "headline": "Pistons hand Rockets franchise-worst 19th straight loss",
  "body": "HOUSTON -- — Frank Jackson had a season-high 23 points and the Detroit Pistons handed the Houston Rockets their franchise-record 19th straight loss, 113-100 on Friday night.\n\n\r\n                    Winless since Feb. 4, Houston struggled to find answers for Detroit’s ball movement and Jackson’s shooting. Jackson was 5 of 5 from 3-point range and 7 of 10 overall.\n\n\r\n                    “It’s been nice to get out on the court and get a rhythm,” said Jackson, who got his first start of the season Monday. “I’ve got some great teammates who are unselfish, and we move the ball really well. It was fun being out there.”\n\n\r\n                    Jerami Grant added 18 points, Josh Jackson had 15, and Isaiah Stewart 13. Detroit made 14 of 29 3s in winning consecutive games for the first time since mid-February.\n\n\r\n                    “It says a lot about our group of guys —- we’re workers and we’ve got a lot of really good, young talented men who can step in on any given night,” Pistons coach Dwane Casey said. “There’s not a lot of difference in those games, but they’re all committed to improving every day.”\n\n\r\n                    The injury-plagued Rockets were playing just their fourth game of the season where Christian Wood, Victor Oladipo and John Wall were all available. Wall had 21 points and seven assists, Oladipo had 19 points, and Wood 18 points and 11 rebounds.\n\n\r\n                    Having Wall and Wood on the court at the same time gave Houston glimpses of what the duo could be capable of if they can both stay healthy. In the first half, Wall connected with Wood on several lobs and also made a smooth over-the-head pass behind himself in transition to Wood, who finished with a dunk.\n\n\r\n                    “That was very important,” Rockets coach Stephen Silas said. “We’ve got to get some continuity amongst the group, we’ve got to get some chemistry, and it’s super important for all these guys to play and play minutes together.” \n\n\r\n                    Wood was facing his former team for the first time. Wood averaged 13.1 points and 6.3 rebounds in 62 games and 12 starts with Detroit last season before signing with Houston in the offseason. Wood nearly matched those averages in the first half on Friday night with 13 points and six rebounds at the break.\n\n\r\n                    GO D.J. \n\n\r\n                    Point guard D.J. Augustin and forward D.J. Wilson, acquired by Houston from Milwaukee in a trade involving P.J. Tucker, made their Rockets debuts. Augustin scored seven points in 20 minutes, while Wilson missed two shots in seven minutes.\n\n\r\n                    “It’s great to be here -- I’ve lived here for a long time and it feels like home,” Augustin said. “I was a little overwhelmed when I first heard the news because we just had a newborn two weeks ago, but when I heard it was Houston, all that went out the window, and I was very excited.” \n\n\r\n                    HE SAID IT\n\n\r\n                    “It was a battle of two new teams. My vision of growth was the fact that we carried over some of the fundamentals from shootaround to the game. That’s something we want to focus on for the rest of the season, focusing on utilizing every minute and continuing to grow.” — Pistons coach Dwane Casey\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Dennis Smith Jr. returned from a three-game absence in the league’s COVID-19 health and safety protocols. Smith had five points and five assists in 19 minutes. ... Detroit was without Wayne Ellington (groin), Rodney McGruder (elbow) and Hamidou Diallo (groin).\n\n\r\n                    Rockets: Wall was charged with a flagrant foul on a second-quarter collision with Frank Jackson and later received a technical foul for arguing with officials in the third quarter. ... Kevin Porter Jr. left the game with right quad soreness and did not return. He had two points in 10 minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Host Chicago on Sunday night.\n\n\r\n                    Rockets: Host Oklahoma City on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764997912.4002712
}