{
  "game_id": "0021800993",
  "espn_id": "401071666",
  "date": "Mar 10, 2019",
  "matchup": "TOR @ MIA",
  "headline": "Raptors tie team record with 21 3s against Heat",
  "body": "MIAMI -- Kyle Lowry was all alone for what seemed like forever.\nHe was in the corner in front of the Miami bench early in the fourth quarter, no Heat defenders within 10 feet of him, and made as open a 3-pointer as one can find in an NBA game.\nThey all weren't that easy for Toronto. But the Raptors made a lot of them look that way.\nLowry scored 24 points, and the Raptors tied a franchise record by making 21 3-pointers while rolling past the Heat 125-104 on Sunday. Half of Lowry's 10 assists set up 3s for the Raptors -- who became the 19th team this season to set or tie a franchise mark for 3s in a game.\n\n\"Good weather. The body was warm. It definitely helps,'' Lowry said. \"But we just came out with a composed mentality. We knew who were going up against and those guys are hard to play.''\nThe 3-pointer was the difference. Toronto made 42 field goals, exactly the same as Miami. The Raptors had six more turnovers. The Heat had five more bench points. These are not the makings of a 21-point win.\nThe 63-24 edge in scoring from beyond the arc, however, was too much for Miami to overcome.\n\"You could tell they prepared for us,'' Miami's Dwyane Wade said. \"They prepared for our zone. They did things that teams normally don't do in the zone and they made shots out of it. So kudos to them for coming in with a great game plan and executing it.''\nDanny Green scored 15 points, all on 3-pointers. Norman Powell also scored 15, and OG Anunoby and Jeremy Lin each scored 11 for the Raptors, whose only other game with 21 3s came against Philadelphia in 2005.\nThe Raptors were 21-of-40 from deep, and 21-of-34 from inside the arc -- shooting 57 percent.\nBam Adebayo scored 19 for the Heat, who had won four in a row. Wade and Dion Waiters each scored 15, and Rodney McGruder added 13.\n\"This is the prototypical, modern, progressive NBA -- 3s versus 2s,'' Heat coach Erik Spoelstra said. \"Exhibit A.''\nKawhi Leonard missed the game -- \"load management'' the cited reason -- and hasn't appeared in more than two consecutive Raptors games since playing in five straight from Jan. 25 through Feb. 5.\nIt hasn't hurt Toronto: The Raptors are now 14-5 when Leonard doesn't play, and he'll sit a few more before the playoffs.\n\"We've kind of looked at it all the way through now, and I think there's maybe a few games yet that he's going to probably stay out,'' coach Nick Nurse said. \"We're just super happy with where we are with it. We kind of feel like we're ahead of the game.''\nThe Raptors set the tone early, going 7-for-10 from 3-point range in the opening quarter. They cooled off, albeit only slightly.\nBy halftime Toronto was up to 12 makes from beyond the arc, helping send the Raptors into the locker room with a 68-54 lead. They had a 14-0 run late in the second quarter, and then the 3s just kept coming.\n\"The shooting gods were with us today,'' Nurse said. \"No doubt about that.''\nTIP-INS\nRaptors: This was the third straight Sunday game for the Raptors, and Leonard has missed them all. They play in Detroit next Sunday, and on his current schedule, Leonard might be in line to sit that one out as well. ... Toronto is now 55-1 since December 2013 when having a 14-point lead or better at the half. The loss came last season, in Cleveland.\nHeat: Miami hasn't rallied from a double-digit halftime deficit at home since December 2015, now having lost 14 such games in a row. The Heat are 0-5 in that situation this season. ... Kelly Olynyk, one of Miami's best players of late, was 0-for-8. ... The Heat led only twice, at 2-0 and 4-2, for a total of 54 seconds.\nZERO BLOCKS\nMiami didn't block any of Toronto's 74 shot attempts. The last time the Heat didn't block a shot was Nov. 1, 2017, against Chicago -- 145 games ago, including playoffs. That ends the fifth-longest such streak in team history.\nMCCAW STARTS\nThe Raptors went with a new starting five, putting Patrick McCaw on the first unit for the first time this season. It was McCaw's first start since March 29, 2018, for Golden State. His first start, oddly enough, was also against Miami, for the Warriors back in 2017. McCaw scored 10 points, going 3-for-3 from 3-point range.\nUP NEXT\nRaptors: Visit Cleveland on Monday.\nHeat: Host Detroit on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994097.1246688
}