{
  "game_id": "0022201177",
  "espn_id": "401469332",
  "date": "Apr 04, 2023",
  "matchup": "MIA @ DET",
  "headline": "Butler leads Heat to late win against Pistons, 118-105",
  "body": "DETROIT -- — Jimmy Butler scored 18 of his 27 points in the fourth quarter and the Miami Heat avoided an embarrassing loss by rallying to beat the hapless Detroit Pistons 118-105 on Tuesday night.\n\n\r\n              Miami (42-37) kept its chance of escaping the Play-In tournament alive, but Detroit (16-63) made it tough before losing its 10th straight and falling to 1-21 in its last 22 games.\n\n\r\n              “We had a lot of guys contribute to this win, but Jimmy did what closers do,” Heat coach Erik Spoelstra said. “We just need to get him the ball and we trust that he’s going to make the right decisions.\n\n\r\n              “That’s what he does.”\n\n\r\n              Gabe Vincent scored 22 points for the Heat while Bam Adebayo and Tyler Herro had 18 apiece.\n\n\r\n              Jaden Ivey scored 30 points on 15 shots for the Pistons, while fellow rookie Jalen Duren had 20 points and 14 rebounds.\n\n\r\n              “I've just been constantly working on my 3-point shot,” said Ivey, who was 4 for 6 from behind the arc. “I was getting down on myself when I wasn't making them earlier in the year, but that's changed.”\n\n\r\n              The Heat led 80-79 at the start of the fourth quarter, but weren't able to pull away from the NBA's worst team. Back-to-back 3-pointers by Cory Joseph put Detroit ahead 97-94 with 6:42 left, but Butler's floater gave Miami a 100-99 edge with 4:35 remaining.\n\n\r\n              Spoelstra started sending his defense hard at Ivey, and Detroit struggled to adapt. \n\n\r\n              “Did you see what he was doing to us before we started blitzing him?” Spoelstra asked. “He's got so much speed and tonight he was hitting his 3s and his mid-range shots, which makes him even tougher. He's a special young talent.”\n\n\r\n              Butler made it 107-99 from the free throw line with 2:47 left, and after Ivey hit a tough banker, Butler's three-point play gave Miami a nine-point lead.\n\n\r\n              “He got to his right hand, and that's what the coaches warned us about before the game,” Ivey said.\n\n\r\n              Miami led by as many as 17 points in the second quarter, but the Pistons narrowed the gap to 59-52 at the half. Gabe Vincent had 17 points for the Heat while Ivey scored 15. \n\n\r\n              “Any time you get a win on the road, it feels good,” Vincent said. \n\n\r\n              Duren's dunk put the Pistons up 60-59 at 3:10 of the third, but Miami scored the next 13 points. Detroit nearly regained the lead at the end of the period, but Eugene Omoruyi's layup came just after the buzzer.\n\n\r\n              TIP-INS\n\n\r\n              Heat: Miami has won seven of its last nine against Detroit, including both games in Michigan this season. ... Herro made both free throw attempts, extending his streak to 32, one short of his career-best set in 2020.\n\n\r\n              Pistons: Ivey extended his franchise rookie record by scoring 10-plus points in his 36th straight game. Dave Bing had streaks of 33 and 32 in the 1966-67 season. \n\n\r\n              SPO'S MYSTERIES\n\n\r\n              During his postgame press conference, Spoelstra said Butler and Ivey each remind him of players he's seen a lot of in his coaching career, but wouldn't divulge who he meant. \n\n\r\n              “I'm not giving any hints -- you'll have to figure it out,” he said when asked if he was comparing Butler to LeBron James or Dwyane Wade. “I've told Jimmy, but that's private between us.”\n\n\r\n              UP NEXT\n\n\r\n              Heat: Visit the Philadelphia 76ers on Thursday.\n\n\r\n              Pistons: Host the Brooklyn Nets on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764993913.094972
}