{
  "game_id": "0022400579",
  "espn_id": "401705145",
  "date": "Jan 17, 2025",
  "matchup": "MIA vs. DEN",
  "headline": "Murray scores 30 points, Jokic has another triple-double to help Nuggets roll past Butler and Heat",
  "body": "MIAMI -- — Jamal Murray scored 30 points, Nikola Jokic extended his NBA lead with his 17th triple-double of the season and the Denver Nuggets spoiled Jimmy Butler's return by beating the Miami Heat 133-113 on Friday night.\n\n\r\n              Jokic finished with 24 points, 12 rebounds and 10 assists. Aaron Gordon added 16 for Denver.\n\n\r\n              Tyler Herro scored 22 points for Miami, while Butler had 18 in his first game back from a seven-game suspension. Bam Adebayo finished with 16 points and 11 rebounds, and Nikola Jovic scored 16 points for the Heat.\n\n\r\n              Takeaways\r\n              Nuggets: Denver hit the midway point of the season at 25-16, putting the Nuggets on pace to win at least 60% of their games for the sixth time in the last seven seasons. Prior to this stretch, the Nuggets finished at .600 or better only six times in their previous 31 seasons.\n\n\r\n              Heat: Miami has dropped three in a row at home — its longest such streak of the season — and all were by double digits: a 13-point loss to Indiana on Jan. 2, a 36-point loss to Utah two nights later and now this loss by 20.\n\n\r\n              Key moment\r\n              Jokic made a 3-pointer with four seconds left in the third quarter, pushing Denver's lead out to 12. Otherwise, Miami would have been within nine and with the ball to open the fourth quarter. But Jokic's 3 started an 14-2 run that put the game basically out of Miami's reach.\n\n\r\n              Key stat\r\n              Including a pair of triple-doubles in NBA Finals games, Jokic has eight triple-doubles against Miami. The Nuggets are 8-0 in those games.\n\n\r\n              Up Next\r\n              Denver finishes its two-game trip Sunday in Orlando, while Miami remains home Sunday to face Victor Wembanyama and San Antonio.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996911.739576
}