{
  "game_id": "0022400747",
  "espn_id": "401705313",
  "date": "Feb 08, 2025",
  "matchup": "POR @ MIN",
  "headline": "McDaniels, Reid lead Edwards-less Timberwolves past Trail Blazers, 114-98",
  "body": "MINNEAPOLIS -- — Jaden McDaniels had 30 points, 10 rebounds and four assists, Naz Reid scored 11 of his 23 points in the fourth quarter and the short-handed Minnesota Timberwolves overcame a 15-point deficit to beat the Portland Trail Blazers 114-98 on Saturday night.\n\n\r\n              Minnesota played without All-Star guard Anthony Edwards for the second time this season after he was held out as a precaution because of soreness in his right hip. The Timberwolves also were missing Mike Conley (sprained right index), Julius Randle (strained right groin) and Donte DiVincenzo (sprained left big toe).\n\n\r\n              Reid hit three timely 3-pointers to help Minnesota to its third straight victory on a night when fans received his bobblehead. The Timberwolves have won eight of 10.\n\n\r\n              Anfernee Simons led Portland with 21 points. Jerami Grant and Shaedon Sharpe each had 14.\n\n\r\n              Takeaways\r\n              Trail Blazers: Portland had won six straight.\n\n\r\n              Timberwolves: Point guard Rob Dillingham, the eighth pick in the 2024 NBA draft, had eight points on 4-of-12 shooting (0 for 4 on 3-pointers) and six assists in his first career start.\n\n\r\n              Key moment\r\n              \r\n              Rudy Gobert's block led to McDaniels' running, pull-up shot that gave Minnesota a 91-90 lead with 6:48 left. The sequence capped a 21-7 run.\n\n\r\n              Key stat\r\n              Minnesota outscored Portland 38-14 in the fourth quarter.\n\n\r\n              Up next\r\n              Both teams play Monday night. The Trail Blazers are at Denver, and the Timberwolves are at Cleveland.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998173.5091588
}