{
  "game_id": "0022200870",
  "espn_id": "401469025",
  "date": "Feb 14, 2023",
  "matchup": "PHX vs. SAC",
  "headline": "Suns top Kings 120-109 with Durant watching from bench",
  "body": "PHOENIX -- — Devin Booker scored 32 points, Deandre Ayton had 29 points and 11 rebounds, and the Phoenix Suns beat the Sacramento Kings 120-109 on Tuesday night with superstar acquisition Kevin Durant watching from the bench.\n\n\r\n              It was the first home game for the Suns since they completed a trade with Brooklyn for Durant, who is recovering from a right knee injury and hasn't played since Jan. 12. He was introduced during a timeout in the third quarter and received a standing ovation. Durant is expected back sometime after this weekend’s All-Star break.\n\n\r\n              “I was watching him more than anything,\" Booker said. \"I don’t think people realize what it is until you’re in it. He deserves it, he’s a legend in this game. I’m glad he’s here.”\n\n\r\n              Booker was 13 of 20 from the field and did not attempt a 3-pointer in 29 minutes. It was his highest-scoring game of the four he's played since returning from a left groin strain that sidelined him for 21 games.\n\n\r\n              “I feel good. It’s been a long recovery road, something I found peace in and just enjoyed the whole process,\" Booker said.\n\n\r\n              Chris Paul had a season-high 19 assists and scored 17 points for Phoenix, which has won 11 of its last 14. Josh Okogie scored 19 points and made a team-high three 3-pointers.\n\n\r\n              “I think we did a really good job of finding the open man,\" Suns coach Monty Williams said. \"Overall, it was a well-balanced game for us, complemented by how hard we played from start to finish.”\n\n\r\n              De’Aaron Fox led the Kings with 35 points, following up his 36-point performance in a win over Dallas on Saturday.\n\n\r\n              “We just had too many unforced errors and going up against a team like that you can’t do that,\" Fox said. \"They capitalized on just about every error that we made today.”\n\n\r\n              Domantas Sabonis had 24 points and 15 rebounds — going 10 for 10 from the free-throw line — and Kevin Huerter scored 18 for Sacramento, which saw its lead over Phoenix in the Pacific Division shrink to one game.\n\n\r\n              The Suns led by as many as 13 points in the third quarter, but the Kings closed within four at the end of the period. Sacramento kept it close in the fourth, but Okogie's 3 with 1:42 remaining turned out to be the Kings' final basket. Paul responded with a step-back jumper to put the Suns ahead by nine.\n\n\r\n              DURANT UPDATE\n\n\r\n              Before the game, Williams said Durant is participating in some drills as he prepares to return.\n\n\r\n              “He’s in great shape and going game speed like he always does,” Williams said, adding that Durant needs to play in more 3-on-3 and similar competition levels before he can return.\n\n\r\n              DIVISION DOMINANCE\n\n\r\n              The Suns are 9-0 against Pacific Division opponents, the only NBA team without a loss in its division this season.\n\n\r\n              INJURY REPORT\n\n\r\n              Kings: Played without Malik Monk (right ankle sprain) and KZ Okpala (knee soreness).\n\n\r\n              Suns: Besides Durant, Cameron Payne (right foot sprain) and Landry Shamet (right foot soreness) remain sidelined.\n\n\r\n              HUERTER ADDED\n\n\r\n              Huerter has been selected to participate in the 3-point contest this weekend in Salt Lake City. Coach Mike Brown said Huerter is valuable to the Kings for more than just his shooting.\n\n\r\n              “He tries to find other ways to help us win,” Brown said. “The way he facilitates, plays the two-man game, he’s shown that he can shoot at a high level for many years.”\n\n\r\n              MISSING BRIDGES\n\n\r\n              The Suns gave up a lot to get Durant and Williams said replacing Mikal Bridges, a defensive stalwart at forward, is a challenge.\n\n\r\n              “Josh (Okogie) and Torrey (Craig) have been taking up some of that role. It’s something we have to figure out, be open-minded about what these guys can do and not compare to what Mikal did, it’s not fair to anybody,” Williams said.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Portland on Feb. 23 after the All-Star break.\n\n\r\n              Suns: Host the Los Angeles Clippers on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995071.143863
}