{
  "game_id": "0021900257",
  "espn_id": "401160899",
  "date": "Nov 27, 2019",
  "matchup": "SAC @ PHI",
  "headline": "After career-worst performance, 76ers' Joel Embiid rebounds with 33-point game vs. Kings",
  "body": "PHILADELPHIA -- Joel Embiid got back to playing the kind of game he expects from himself and nothing like the worst game of his career two nights prior.\nEmbiid had 33 points and 16 rebounds to lead the Philadelphia 76ers to a 97-91 victory over the Sacramento Kings on Wednesday night.\nHe was scoreless Monday night in a 101-96 loss at Toronto. In 32 minutes against the Raptors, the star big man went 0-for-11 from the field, including 0-for-4 from the arc and missed all three of his free throws.\nAgainst the Kings, he scored the first points of the game with an emphatic dunk 23 seconds in and had some key points late in the game to help Philadelphia improve to 8-0 at home. He finished 10-of-19 from the field and 12-of-14 from the free throw line.\n\"I should play like that every night,\" Embiid said. \"After the last performance, I had to be a little more aggressive.\"\nEmbiid said he felt more \"free\" than he did being guarded by Toronto's Marc Gasol and a constant double-teamer, and Kings coach Luke Walton said his team wasn't able to execute its plan.\n\"Our plan was to double, but we didn't do a good job early,\" he said. \"We were soft and late.\"\nOf Embiid's 14 trips to the foul line, Walton said, \"We have to be more disciplined.\"\nPhiladelphia rookie Matisse Thybulle scored all 15 of his career-best points in the second half. Thybulle was needed after Josh Richardson didn't return in the second half due to right hamstring tightness. Thybulle, who entered averaging 3.4 points, added four steals and two blocks while making all five of his shots, including three 3-pointers.\n\"You have to be ready for every opportunity,\" Thybulle said.\nBuddy Hield scored 22 points and Dewayne Dedmon had 18 for the Kings. They were 1-3 on a four-game trip.\nHield, coming off a career-high 41 points at Boston on Monday night, made 3 of 12 3-pointers and 9 of 24 shots overall.\nSacramento closed within five, 92-87, thanks to a 14-2 run. But Embiid scored from close to put the 76ers up 94-87 and then hit a pair from the line to make it 96-87 with 1:41 left.\nSHOOTING SIMMONS?\nBen Simmons' continued reluctance to shoot conventional jump shots remains an issue in Philadelphia. Simmons hit his first career 3-pointer against the Knicks on Nov. 20, but he hasn't tried a true 3 -- his shot-clock heave Monday at Toronto notwithstanding.\nCoach Brett Brown repeatedly has defended his star point guard, saying that his jump shot will come in time. He again was asked several times prior to Wednesday's game about Simmons' shot.\n\"In general, I want him to shoot more,\" Brown said. \"There are available shots he can look at more.\"\nBrown said it's something Simmons continues to work on in practice.\nSimmons drained a 13-foot turnaround jumper with 6:40 left in the first half, but then didn't touch rim with a try from similar distance a little under a minute later.\nSimmons finished with 10 points, 14 rebounds and five assists.\nHOME SWEET HOME\nPhiladelphia remained undefeated at home while selling out for the 101st straight contest.\n\"We love playing at home,\" Brown said. \"This crowd respects, appreciates and pays for effort, and for the most part, I think that we give it.\"\nTIP-INS\nKings: De'Aaron Fox (ankle) missed his eighth straight contest, and Trevor Ariza (personal) was out for his fifth straight game. ... The teams wrap up the two-game season series on March 5 at Sacramento. ... Philadelphia fans booed Nemanja Bjelica, who spurned the 76ers for Europe prior to last offseason.\n76ers: Kyle O'Quinn (left calf) and Shake Milton (upper respiratory infection) didn't play. ... Richardson had nine points in 17 first-half minutes.\nUP NEXT\nKings: Host Denver on Saturday night.\n76ers: At New York on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764996413.3026738
}