{
  "game_id": "0021800821",
  "espn_id": "401071494",
  "date": "Feb 08, 2019",
  "matchup": "MIL @ DAL",
  "headline": "Antetokounmpo, Bucks win 6th straight, 122-107 over Mavs",
  "body": "DALLAS --  Giannis Antetokounmpo got the best of fellow Euro star Luka Doncic again, and Milwaukee's All-Star captain has help on the way.\n\nDoncic, the 19-year-old Dallas rookie sensation, is all that's left from the starting lineup the Mavericks put together in the offseason.\n\nAntetokounmpo had 29 points and 17 rebounds and the Bucks rolled to their sixth straight victory, beating the retooling Mavericks 122-107 on Friday night.\n\nThe Bucks outscored the Mavericks 80-26 in the paint, led by Antetokounmpo going 13 of 19 from the field while repeatedly powering his way to dunks and layups.\n\nBrook Lopez scored 20 points for the Bucks, who have surged to the best record in the NBA (41-13) with a pair of six-win runs on either side of a loss. One of those victories was over the Mavericks at home, when Antetokounmpo scored 31 points to Doncic's 18 in a 10-point win.\n\n\"Antetokounmpo is a great player, but 80 points in the paint is just ridiculous,\" Mavericks coach Rick Carlisle said. \"In this league, you have to be able to guard penetration ... with a level of force and will. We did not do that.\"\n\nDoncic scored 20 points but had just three rebounds and two assists in his first game since the NBA's only teenager with multiple triple-doubles got his third.\n\nDallas was without Harrison Barnes, traded to Sacramento two nights earlier while playing in a win over Charlotte. The Mavericks had already shipped starters Dennis Smith Jr., Wesley Matthews and DeAndre Jordan to the New York Knicks.\n\nBoth deals were more about the future than the present, signified mostly by the plan to sit the biggest prize. Kristaps Porzingis won't play the rest of the season while recovering from a knee injury the 2018 All-Star sustained last February while with the Knicks.\n\n\"It's hard,\" Doncic said. \"They were four people that always played with me, a lot of time together. I just have to adjust to it.\"\n\nMilwaukee didn't have Nikola Mirotic a day after acquiring him from New Orleans before the trading deadline. It didn't matter as the Bucks shot 54 percent despite going 10 of 36 (28 percent) from 3-point range.\n\nAntetokounmpo attacked from the beginning, getting a layup and dunk for the first two baskets of the game. Lopez had little trouble around the rim as well, making six of eight from inside the arc while going 2 of 6 from long range.\n\nEven guard Malcolm Brogdon backed down the Mavericks for easy buckets, finishing with 18 points along with backcourt mate Eric Bledsoe.\n\n\"We are scoring at a really high rate in the paint,\" Bucks coach Mike Budenholzer said. \"We sprinkled in a few 3s here and there.\"\n\nTIP-INS\n\nBucks: F Khris Middleton was given a night of rest on the front end of a back-to-back. ... Budenholzer said it wasn't clear whether Mirotic would be available for his Milwaukee debut on the second night of a back-to-back at home against Orlando. The fifth-year forward has been listed with a right calf strain and missed his last seven games with the Pelicans.\n\nMavericks: Antetokounmpo's brother, F Kostas Antetokounmpo, was expected to be active before he was a late scratch because of an illness. The younger Antetokounmpo is a rookie who hasn't played for the Mavericks and has spent most of the season with their G-League team. He was active but didn't play when the teams met in Milwaukee last month. ... Trey Burke, one of four players to join Dallas in the seven-player blockbuster with New York, scored 18 points. Tim Hardaway Jr., another guard from that trade, had 12.\n\nTRY AGAIN\n\nAntetokounmpo shot an air ball on a 3-pointer in the first quarter but came back and swished one less than a minute later. He was 1 of 3 from long range. \"I love he missed one and ... two possessions later, shoots another and makes it,\" Budenholzer said. \"We've been saying for the whole year, when he's open we want him shooting with confidence.\"\n\nBIG SWING IN THIRD\n\nThe Mavericks had a season-high 22 3-pointers, going 9 of 16 in the third quarter. Milwaukee pushed a 13-point halftime lead to 23 before the Mavericks got back within eight going into the fourth quarter.\n\nNO RANDOLPH FOR MAVS\n\nDallas waived Zach Randolph two days after acquiring the forward from Sacramento in the Barnes deal, a trade designed for salary-cap relief. The 37-year-old Randolph never played for the Kings in his second season with them. Justin Jackson, the other player in the deal, made his Dallas debut late in the fourth quarter and hit a 3-pointer.\n\nUP NEXT\n\nBucks: Go for three-game season sweep of Orlando at home Saturday.\n\nMavericks: Portland on Sunday in finale of three-game homestand.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994474.333583
}