{
  "game_id": "0021500287",
  "espn_id": "400828174",
  "date": "Dec 04, 2015",
  "matchup": "HOU @ DAL",
  "headline": "Harden scores 25 after rough start, Rockets top Mavs 100-96",
  "body": "DALLAS --  James Harden was off to another rough shooting start against Dallas and not getting to his usual spot at the free throw line either, so Houston stayed in the game with 3-pointers.\n\nWith the score tied in the final minutes, the Rockets went to their All-Star guard -- of course.\n\nHarden had an assist for an easy go-ahead dunk by Terrence Jones and scored the last of his 25 points on a clinching jumper that bounced on the rim several times in the Rockets' 100-96 victory over the Mavericks on Friday night.\n\n\"I'm just a playmaker,\" said Harden, who recovered from 3-of-12 shooting in the first half after missing his first 11 shots in a home loss to Dallas last month. \"If I've got a shot, I shoot it. Or I make a pass.\"\n\nOr both.\n\nFirst, Harden found Jones under the basket for a wide-open dunk to break a 96-all tie. Harden had nine assists and eight rebounds as the NBA's free throw leader found a way to make a difference despite not getting to the line until the third quarter and going 4 of 5 from there.\n\nAfter Dirk Nowitzki missed a potential tying jumper, Harden finished off a 7-of-11 second half with a step-back jumper that hit the rim, then the backboard, then the rim a couple more times before dropping through for a four-point lead with 7 seconds left.\n\nHouston won for the fourth time in five games with Dwight Howard getting a routine night of rest, and improved to 5-4 under interim coach J.B. Bickerstaff since he replaced the fired Kevin McHale.\n\n\"We can't settle,\" Bickerstaff said after the Rockets improved to 9-11. \"We're not where we want to be.\"\n\nTrevor Ariza was 4 of 7 from long range and finished with 18 points for the Rockets, who were 11 of 18 on 3s in the first half before cooling off and missing seven of eight after halftime.\n\nJones had 17 points and nine rebounds, and Patrick Beverley made all four of his 3s -- all in the first half -- and finished with 14.\n\nDeron Williams had 22 points and six assists to lead the Mavericks, but also had eight of Dallas' 17 turnovers.\n\nNowitzki had 16 points and 10 rebounds but missed a 3-pointer with Dallas trailing by two in the final 2 minutes. Nowitzki limped toward the locker room early in the fourth quarter with an apparent hip injury but returned.\n\nWes Matthews also missed a 3 that would have put Dallas ahead before Nowitzki's late miss, and finished 1 of 8 from beyond the arc and 1 of 9 overall. He scored five points.\n\n\"I'm tired of hurting the team,\" said Matthews, who is shooting 35 percent in his first season with Dallas after signing a max contract in free agency and coming back faster than expected from a torn Achilles tendon. \"I'm tired of missing shots.\"\n\nDevin Harris led the Mavericks with 13 points in the first half, including four on a strange sequence in the second quarter.\n\nHarris was flattened by Beverley and threw up a shot that went in before missing the free throw. On Houston's end, Jones was called for a flagrant foul for an elbow to Harris' head while setting a screen. Harris, who finished with 15 points, made both those free throws.\n\nSIXTH-MAN EXPERIMENT\n\nChandler Parsons came off the bench early for the first time while still playing restricted minutes for Dallas following offseason knee surgery. Coach Rick Carlisle said it was Parsons' idea. The forward said he just wants to play in the fourth quarter. \"It didn't work tonight, but I thought I played with energy and got that second unit going a little bit there in the first half,\" Parsons said.\n\nWINNING WITHOUT HOWARD\n\nClint Capela had 10 rebounds starting in place of Howard, but just two points while missing all five of his shots. He had five of Houston's 15 offensive rebounds, and the Rockets had 18 second-chance points.\n\nTIP-INS\n\nRockets: Montrezl Harrell left late in the third quarter and didn't return after trying to follow a miss with a dunk and getting hit in the face. He stayed down while Dallas' Williams first missed a 3 and then hit one for a 73-72 Dallas lead.\n\nMavericks: Dallas wore the road uniform from the 1980s on a \"Hardwood Classics\" night. The green jerseys had \"Dallas\" across the front with white numbers in blue trim. ... Raymond Felton and Jones got a double-technical after a confrontation in the fourth quarter.\n\nUP NEXT:\n\nRockets: Sacramento at home Saturday.\n\nMavericks: At Washington on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994655.943456
}