{
  "game_id": "0021400288",
  "espn_id": "400578580",
  "date": "Dec 06, 2014",
  "matchup": "DET vs. PHI",
  "headline": "76ers beat Pistons 108-101 in overtime",
  "body": "AUBURN HILLS, Mich. --  Detroit's Greg Monroe leaped toward the basket and missed a dunk. Then moments later, Philadelphia's Henry Sims had the ball right next to the basket and blew the layup.\n\nOn a night when something had to give, the 76ers held the Pistons without a field goal in overtime, beating Detroit 108-101 on Saturday for their second victory of the season. The Pistons lost their 11th straight game, this one in a matchup of the teams with the NBA's two worst records.\n\nThe 76ers (2-18) have won two of three after starting the season 0-17.\n\n\"It is huge for these guys to be able to close out a tough game on the road like that,\" coach Brett Brown said. \"I'm proud of the way they hung together through that streak and now they are getting some rewards.\"\n\nDetroit (3-17) now leads Philadelphia by only a game in the standings. The teams entered with a combined record of 4-34, the second-worst in NBA history for teams about to play each other -- with a minimum of 38 combined games. The 76ers and Buffalo Braves were 4-35 entering their meeting Nov. 24, 1972, according to STATS.\n\nDetroit led 100-97 late in the fourth quarter when Hollis Thompson -- seemingly rushing a shot straight off an inbounds -- sank a fadeaway 3-pointer from the right corner to tie it with 13.4 seconds remaining.\n\nIt took almost half the overtime for either team to score. Monroe missed a dunk early on. The Pistons took the lead when Kentavious Caldwell-Pope made a free throw with 2:37 left for the first point of the extra session, but the 76ers scored eight in a row to finish the game.\n\nRobert Covington scored 25 points for Philadelphia and Michael Carter-Williams added 20. Josh Smith led Detroit with 23 points, and he also had eight rebounds and seven assists.\n\nIt was 104-101 after Nerlens Noel's floater with 29.9 seconds remaining. Caldwell-Pope missed two 3-pointers at the other end before the 76ers were able to secure the ball and close out the game from the free throw line.\n\nThe teams were facing each other for the first time since March 29, when the 76ers snapped their record-tying, 26-game losing streak with a 123-98 rout of the Pistons in Philadelphia.\n\nThe Pistons and 76ers are in this position in large part because of their atrocious shooting. Detroit finished at 39 percent from the field Saturday, while Philadelphia shot a more respectable 46 percent.\n\nThere was one sequence in the fourth quarter when Detroit's Brandon Jennings traded airballs with Thompson, then Jennings missed a layup.\n\nThe Pistons host Philadelphia again Jan. 17.\n\nTIP-INS\n\n76ers: Since Jan. 31, Philadelphia is 2-1 against the Pistons and 4-49 against everybody else.\n\nPistons: Jennings and Caldwell-Pope each went 2 of 10 from the field. Jennings had six assists and five turnovers.\n\nHOLDING THEIR OWN\n\nWith their front line of Smith, Monroe and Andre Drummond, the Pistons can be tough to deal with on the boards. They finished with 15 second-chance points, but Philadelphia had 13.\n\n\"We knew it was going to take all five of us to keep those guys off the boards, so this was definitely a group effort,\" Carter-Williams said. \"Our bigs were doing everything they could, and we were trying to help them out.\"\n\nEMPTY POSSESSION\n\nAfter Thompson's tying shot, Detroit had a chance to win it at the end of regulation, but Jennings couldn't even reach the rim with a step-back jumper.\n\n\"My fault,\" Pistons coach Stan Van Gundy said. \"When it broke down, we couldn't get the ball where we wanted to go with it. I should have been jumping up, calling timeout. My fault.\"\n\nUP NEXT\n\n76ers: Visit Atlanta on Wednesday night.\n\nPistons: Host Oklahoma City on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764993810.463288
}