{
  "game_id": "0021401176",
  "espn_id": "400579468",
  "date": "Apr 10, 2015",
  "matchup": "CHA @ ATL",
  "headline": "Muscala, Hawks beat Hornets 104-80 for first 60-win season",
  "body": "ATLANTA -- Mike Muscala is making a case for postseason playing time with the Atlanta Hawks.\nMuscala scored 17 points, and Atlanta beat the Charlotte Hornets 104-80 on Friday night to reach 60 wins for the first time in franchise history.\nMuscala was 8 for 9 from the field and is 21 for 25 in his last four games. Even the second-year forward from Bucknell seemed surprised when told of his recent shooting numbers.\n\"Really? Yeah, it's nice to see some shots go in,\" Muscala said.\nMuscala logged 25 1/2 minutes while filling in for injured forward Paul Millsap. He averaged more than 20 minutes in Atlanta's last five games, a trend that began before Millsap's injury.\n\"I think he's finding ways to score around the basket,\" coach Mike Budenholzer said. \"He's putting a lot of pressure on the rim and in our pick-and-roll game.\n\"When you have variety in how you score, then you can have a good game. You can find a way to impact the game. If you're just dependent on one thing, which he is not, especially recently, then you can have a night like tonight.\"\nThe Hornets were eliminated from the playoff race with their third straight loss, combined with wins by Indiana and Boston.\n\"I feel like we just got off to a really, really rocky start our first 30 games or so,\" said forward Marvin Williams, who had three points and nine rebounds. \"I feel like after those games we found our groove. We played better defensively.\"\nKyle Korver had 16 points for Atlanta (60-19), and Al Horford finished with 15 points and eight rebounds. Horford scored nine points in the third quarter, when Atlanta took the lead for good.\nThe Hawks unveiled their Southeast Division banner before the game for their first division title since winning the Central in 1993-94. Then the No. 1 seed for the Eastern Conference playoffs extended its franchise record for wins.\nThe Hornets led 48-47 at halftime, but Atlanta outscored Charlotte 23-12 in the third quarter. The Hawks continued to pull away in the final period.\nHawks reserve Pero Antic had five points in his first appearance since the center and teammate Thabo Sefolosha were arrested and charged with obstructing authorities and disorderly conduct early Wednesday outside a Manhattan nightclub.\nThe two were released without bail, but Sefolosha, a backup forward, fractured his lower right leg and will miss the rest of the regular season and postseason.\nIndiana Pacers forward Chris Copeland was stabbed at the scene before the arrests of Antic and Sefolosha. Antic said Friday he and Sefolosha were not with Copeland's group and were not trying to shield Copeland from police or onlookers.\nTIP-INS\nHornets: Troy Daniels led Charlotte with 15 points. Jason Maxiell had 13 points, and Kemba Walker scored 11. ... G Lance Stephenson (right toe sprain), C Al Jefferson (sore right knee), F Michael Kidd-Gilchrist (left ankle sprain) and F Cody Zeller (sore right shoulder) were held out. Coach Steve Clifford said Stephenson is in \"quite a bit of pain.\" ... The Hornets settled for a split of the four-game season series with Atlanta.\nHawks: Millsap (right shoulder sprain) missed his third straight game and also will not play at Washington on Sunday. Budenholzer said \"we feel good about the progress he's making and the timeline\" for the playoffs. ... Muscala's career high is 18 points against Charlotte on March 28. ... Dennis Schroder had 14 points and five assists.\nSWEET 60\nKorver said reaching 60 wins is \"really beautiful.\"\n\"It's a true testament to everybody buying in and playing together,\" Korver said.\nAtlanta's previous franchise record was 57 wins in the 1986-87 and 1993-94 seasons.\nLOOKING TO THE FUTURE\nClifford said he is using the last few games to give more minutes to his team's young players.\n\"That's what these games are going to be for, things that we can take and they can use to learn, and use these next three games the same way,\" Clifford said.\nUP NEXT\nHornets: At Detroit on Sunday.\nHawks: At Washington on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764992245.225059
}