{
  "game_id": "0021701218",
  "espn_id": "400975964",
  "date": "Apr 10, 2018",
  "matchup": "LAL vs. HOU",
  "headline": "CP3 leads Rockets past Lakers 105-99 for 31st win in 34",
  "body": "LOS ANGELES --  Chris Paul warmly greeted Andre Ingram when the 32-year-old guards both arrived at the Staples Center scorers' table to check in. Although they were born six months apart, Paul was in his 892nd regular-season game, while Ingram was making his NBA debut.\n\n\"I told him I heard about his story, and that grind is unbelievable,\" Paul said. \"I told him, `Much respect.' I mean, 10 years grinding in the G League, to finally get an opportunity and to play like that, it's pretty special.\"\n\nAfter a decade in the minors, Ingram seized the chance to live his long-deferred dream by scoring 19 points for the Los Angeles Lakers.\n\nPaul and the Houston Rockets were impressed, even if they still came out on top.\n\nPaul scored 22 points and James Harden had 21 points and 10 assists in the Rockets' 105-99 victory Tuesday night.\n\nThe Rockets kept steamrolling toward the playoffs with their 31st victory in 34 games -- but everybody was watching Ingram, the slim shooter with salt-and-pepper hair who hit four 3-pointers for the Lakers in an NBA debut that would have been undeniably impressive even if he hadn't been waiting his entire professional life for it.\n\n\"It was excellent,\" Ingram said with a broad grin. \"Once we went out as a team for warmups, I just felt some electricity out there. It was amazing. The crowd, the lights, it was just once in a lifetime. It was awesome.\"\n\nLos Angeles promoted Ingram from its South Bay affiliate for the final two games of another dismal Lakers regular season, and the G League's career leader in 3-pointers hit a 3 on his first NBA shot.\n\n\"I tried not to think about the first one going down,\" Ingram said. \"But to a man, everyone was like, `When you get it, just let it go!' All the players, all the coaches. It was crazy. To see that first one go in, I felt great.\"\n\nAfter a few more baskets, the sellout crowd moved from charitable support to full-throated roars, including chants of \"M-V-P!\" that brought a smile to Ingram's face. Ingram had flown his wife and two daughters in from Virginia to watch the culmination of their work.\n\n\"To play the way he played, that's the stuff that dreams are made of,\" said Lakers center Brook Lopez, who scored 12 points. \"Just an inspirational story. He belonged out there.\"\n\nIngram's fourth 3-pointer with 51 seconds left trimmed Houston's lead to 102-99, but the Lakers couldn't score again. Ingram finished 6 for 8 from the field and 4 for 5 on 3-pointers along with three rebounds, three blocked shots and a steal.\n\n\"That's a testament to hard work, never giving up, and just sticking with it,\" said Julius Randle, who scored 17 points.\n\nGerald Green scored 16 points as Houston hung on late to avoid its first back-to-back losses since Jan. 6. But in the first half, the Rockets lost backup forward Luc Mbah a Moute to a dislocated right shoulder while dunking in this meaningless game.\n\nMbah a Moute will have an MRI exam Wednesday.\n\n\"With Luc, it's tough, but we can't take it back now,\" Paul said. \"We've just got to pick it up by committee. ... Luc has been unbelievably important. Just his spirit, the way he plays, he defends, rebounds, runs, all that stuff.\"\n\nRookie Josh Hart scored 20 points for the Lakers, who played without injured Lonzo Ball, Brandon Ingram and Kyle Kuzma in the penultimate game of their franchise-record fifth consecutive losing season.\n\nTIP-INS\n\nRockets: Ryan Anderson missed his third straight game with a sprained left ankle. ... Mbah a Moute missed 15 games in December and January with the same dislocated shoulder. He re-injured the joint without contact, heading immediately to the locker room.\n\nLakers: Ball missed his seventh straight game with a bruised left knee, while Ingram has played just two games since March 1 due to a groin strain and an apparent concussion. Ball, Ingram and Kuzma -- who has a sprained left ankle -- are unlikely to play in the club's season final on Wednesday night, coach Luke Walton said. If that's the case, Ball will finish his rookie season averaging 10.2 points, 7.2 assists and 6.9 rebounds per game, while Kuzma will finish his promising rookie campaign with 16.1 points and 6.3 rebounds per game.\n\nLONG TIME COMING\n\nIngram made his NBA debut for the Lakers after 384 games over a full decade in the developmental G League, including parts of the past six years with the Lakers' affiliate. The former American University physics major has hit 713 3-pointers in the G League with 46-percent accuracy, but his slight stature kept him out of the NBA until this late call-up. Ingram played briefly in Australia, but mostly declined chances to play overseas because he was determined to earn an NBA shot through the minors. He once tutored teammates in math to make extra cash in the offseason. Ingram averaged only 9.1 points this season for the South Bay Lakers, but hit 47.5 percent of his 3-pointers.\n\nLUC INJURED\n\nThe Rockets are locked into the top seed in the Western Conference, but coach Mike D'Antoni still kept his regular starters and rotation. Houston then took a potentially important hit when Mbah a Moute dislocated his shoulder for the second time this season while dunking in the second quarter.\n\nMbah a Moute averages 7.6 points and 3.1 rebounds while playing nearly 26 minutes per game as a key rotation player.\n\n\"I think it's less (serious) than last time, but I don't know,\" D'Antoni said.\n\nUP NEXT\n\nRockets: At the Sacramento Kings on Wednesday.\n\nLakers: A \"road\" season finale against the Clippers on Wednesday.\n\n---\n\nMore AP basketball: www.apnews.com/tags/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992932.134327
}