{
  "game_id": "0021600736",
  "espn_id": "400899402",
  "date": "Feb 01, 2017",
  "matchup": "DAL vs. PHI",
  "headline": "Curry, Mejri lead Mavericks to 113-95 win over 76ers",
  "body": "DALLAS --  Salah Mejri combined to play only nine minutes in Dallas' recent victories over San Antonio and Cleveland. The Mavericks got another nice victory Wednesday night, and Mejri wasn't left out of this one.\n\nThe Tunisian center had 16 points and a career-high 17 rebounds, Seth Curry scored 22 points and Dallas beat the Philadelphia 76ers 113-95 for its third win in a row and fifth in six games.\n\nThe 7-foot-1 Mejri played 21 minutes with Andrew Bogut out of action and helped Dallas -- the NBA's worst-rebounding team -- set a season high for boards and outrebound the Sixers 51-39.\n\nHe scored 10 points, all on dunks, early in the fourth quarter to help the Mavericks lead by 22. Mejri's point total was one shy of his career high.\n\n\"They've been looking for me now that I'm a `hot player,\" said Mejri, laughing as he made air quotes to highlight his sudden scoring prowess. \"When it's there, it's there. I felt like I needed to join the party with everybody else because we had two big wins on back to backs.\"\n\nHarrison Barnes added 16 points for Dallas, and Devin Harris had 14.\n\nJahlil Okafor led the 76ers with 16 points, and Ersan Ilyasova added 13 points and 10 boards. Philadelphia played without starters Robert Covington (bruised right hand) and Joel Embiid (left knee contusion).\n\nThe Mavericks led by just four points with three minutes left in the third quarter, but Harris hit back-to-back 3s to start a 13-5 run that gave the Mavericks an 81-69 lead.\n\n\"It happened so fast,\" Okafor said. \"We didn't get stops, they hit a bunch of 3s. We turned the ball over. We also missed shots that we always make or usually make.\"\n\nMejri then scored 10 of Dallas' first 12 points in the fourth, opening the lead to 93-74.\n\nTIP-INS\n\n76ers: Rookie Timothe Luwawu-Cabarrot made the first start of his career in place of Covington and scored seven points.\n\nMavericks: Mejri reached his season high in rebounds in the first half alone, with 12 boards in just 11 minutes. ... Guards J.J. Barea (left calf strain) and Deron Williams (left big toe sprain) and Bogut (right hamstring strain) missed another game.\n\nYOGI BEARS DOWN\n\nYogi Ferrell, who scored a career-high 19 points against Cleveland on Monday, had 11 points and five assists in 38 minutes Wednesday in just his third game with the team. He even blocked a shot by Okafor, who is 11 inches taller.\n\nFerrell also brought the crowd to its feet late in the third quarter when he knocked the ball away from Philadelphia's Sergio Rodriguez on a fast break and his momentum carried him headfirst into the first row of spectators.\n\n\"I'm going to get out there and communicate with my guys defensively, and offensively I'm going to run the team,\" Ferrell said. \"Make the smart pass, knock down the shot if it's open and just be a catalyst.\"\n\nRIGHT ON THE BUTTON\n\nThe Mavericks used a 26-8 run to turn a nine-point second-quarter deficit into a 50-41 lead before the Sixers scored the last six points of the half.\n\nThe run started after a Dallas timeout in which coach Rick Carlisle drew a picture of a reset button on his clipboard and had Curry push it after the guard had three first-quarter turnovers. Curry and Barnes combined to score the last 13 points of the run.\n\n\"I had to get my mind right and get into the game,\" Curry said. \"That was just a fun thing he did in the timeout that got me going.\"\n\nUP NEXT\n\n76ers: Stay in Texas with a visit to the Spurs on Thursday, the second game in a four-game trip.\n\nMavericks: Visit Portland on Friday, their first of two matchups in five days with the Trail Blazers.",
  "source": "espn_api",
  "crawled_at": 1764996124.2104151
}