{
  "game_id": "0021700560",
  "espn_id": "400975306",
  "date": "Jan 03, 2018",
  "matchup": "TOR @ CHI",
  "headline": "DeRozan scores 35 points, Raptors beat Bulls 124-115",
  "body": "CHICAGO --  All that DeMar DeRozan wanted to talk about was the lift Toronto's bench provided. As for his recent scoring tear?\n\n\"I don't think nothing of it,\" he said.\n\nDeRozan had 35 points, Delon Wright set career highs with 25 points and 13 rebounds, and the Raptors beat the Chicago Bulls 124-115 on Wednesday night.\n\nDeRozan came up big again after scoring a franchise-record 52 points in a win over Milwaukee on New Year's Day. He was particularly good in the third quarter this time, scoring 18 points after being held to nine in the first half. DeRozan also shot 5 of 8 on 3-pointers and converted all 10 free throws.\n\nWright had his first career double-double and hit four 3s to lead a big effort by the bench. He scored 12 in the second quarter and eight more points in the fourth to help Toronto pull away for its ninth win in 11 games.\n\nSerge Ibaka and Kyle Lowry scored 16 apiece for Toronto. Fred VanVleet, from nearby Rockford, added 13 points, and the Raptors' reserves outscored Chicago's 54-39.\n\n\"They've been great for us all year,\" DeRozan said. \"We come out slacking. The bench always picks us up, and vice versa. Tonight, the bench did what they've been doing all year, got the energy going. We fed off that, and got back in the game.\"\n\nHe'll get no argument from coach Dwane Casey.\n\n\"The bench really saved us tonight,\" he said. \"They gave us energy. We just couldn't get our mojo going with the first unit, but Delon came in and had a career high. I really liked the way he was going after rebounds. His overall game sustained us.\"\n\nJustin Holiday led Chicago with 26 points, and Lauri Markkanen added 22 points and 12 rebounds. Nikola Mirotic scored 20, but the Bulls dropped their third straight.\n\nThe Bulls looked sharp early on, with a 10-point lead after the first quarter. But they couldn't sustain their edge on defense and were impatient on offense -- particularly the second unit.\n\n\"We were coming out and jacking up contested shots with zero or one pass,\" coach Fred Hoiberg said. \"And you can't have that. So again, that second unit's been pretty darn good for us. Tonight, we struggled with it.\"\n\nPULLING AWAY\n\nChicago was leading 92-90 early in the fourth when Toronto went on a 16-2 run. Lowry hit a 3 to make it 106-94 with 6:39 remaining, and the Raptors remained in control the rest of the way.\n\nLAVINE UPDATE\n\nThe Bulls hope to decide on a return date for G Zach LaVine early next week.\n\nLaVine will travel with the team to games at Dallas and Indiana on Friday and Saturday. Hoiberg said the two-time slam dunk champion will meet with doctors, trainers, management and coaches after the Bulls return home.\n\nLaVine averaged 18.9 points in 47 games for Minnesota last season before tearing the anterior cruciate ligament in his left knee. The Bulls acquired him along with Kris Dunn and Markkanen in the trade that sent Jimmy Butler to the Timberwolves.\n\nTIP-INS\n\nRaptors: Toronto had dropped six straight at Chicago. ... The Raptors were 19 of 19 at the foul line. ... Wright hit 10 of 15 shots.\n\nBulls: Markkanen has led the Bulls in rebounding 13 times and has eight double-doubles. He is averaging 21 points over his last four games. ... C Robin Lopez had 12 points and a career-high six assists. ... Mirotic has scored 20 or more in eight of his 15 games.\n\nUP NEXT\n\nRaptors: Visit the Milwaukee Bucks on Friday.\n\nBulls: Visit the Dallas Mavericks on Friday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992880.857523
}