{
  "game_id": "0021700353",
  "espn_id": "400975104",
  "date": "Dec 06, 2017",
  "matchup": "SAC @ CLE",
  "headline": "LeBron scores 32 as Cavaliers win 13th straight",
  "body": "CLEVELAND --  The play is called \"Chicago,\" named after a game-winning shot LeBron James made in the playoffs to beat the Bulls.\n\nIt worked like a charm again in Cleveland.\n\nJames drained a 3-pointer with 15 seconds left and finished with 32 points as the Cavaliers tied a franchise record with their 13th straight win, 101-95 over the Sacramento Kings on Wednesday night.\n\nJames, who changed his sneakers three times, also had 11 rebounds and nine assists, helping the Cavs rally from a 14-point deficit in the third quarter to remain unbeaten since Nov. 11. His decisive 3-pointer in the final minute over JaKarr Sampson came after James went to the bench during a timeout and told coach Tyronn Lue to run a play for him.\n\n\"Was going to run a different play and then Bron said, `I want Chicago.' So I said, `OK,\" Lue said. \"We got it to him and he made a big shot.\"\n\nAfter catching the inbounds pass, James took a dribble to his left and then stepped behind the line and knocked down his fifth 3-pointer.\n\n\"It felt good,\" said James, who finished 12 of 18 from the floor. \"I was able to get the laces where I wanted them and I got enough space, I created enough space with the step-back away from JaKarr and I was able to let it go. It felt good the whole time.\"\n\nCleveland, which also won 13 straight in the 2008-09 and 2009-10 seasons, will try to break the team record Friday at Indiana.\n\nThis one wasn't easy. The Kings gave the Cavs everything they had, but couldn't contain James in the clutch. That's been the case for nearly every team that has faced the three-time champion, who is shooting with a confidence rarely seen in his career.\n\n\"He's amazing,\" said Kyle Korver, who opened the fourth quarter with three straight 3-pointers to give Cleveland the lead. \"He's just demanding the ball. He's like, `Give me the ball, we're about to win.' And, I've been around some guys who've had amazing years. I've been playing with him and Derrick (Rose) when he was MVP. Allen Iverson when I was young.\n\n\"But he's taken this to a whole new level. It's amazing to have a better than a front-row seat, because I'm usually on the court next to him somewhere. I'm glad he's on my team.\"\n\nZach Randolph had 18 points and 10 rebounds and Buddy Hield added 17 points for the Kings. Sampson grabbed 16 rebounds in his first start this season.\n\nWhile Cleveland's win streak is impressive, James said he won't consider anything special until the Cavs nearly double it.\n\n\"Twenty-five,\" he said when asked where the streak needs to get to before becoming significant. \"Because you're getting close to 33 (Lakers 1971-72), that's the all-time record. We ain't nowhere near close. We got close in Miami. We got to 27 and lost to Chicago.\"\n\nThanks to James and another Chicago, the Cavs roll on.\n\nROSE REFLECTS\n\nCavs guard Derrick Rose spoke to his teammates before the morning shootaround, two days after returning to the team from a self-imposed hiatus.  Rose has been dealing with a sprained ankle and the 2011 NBA MVP's latest injury had him re-considering his future.\n\nLue didn't provide any specifics about Rose's comments, but said his teammates were glad to have him around again.\n\n\"It was just good to have him back and hear him talk because he's not a big talker,\" Lue said. \"He's a quiet guy. But just hearing what he had to say and then just seeing how everyone was welcoming him back and was happy he's here.\"\n\nSAMPSON START\n\nSampson, who was born in Cleveland and went to the same high school as James, didn't know he was starting until he arrived at the arena.  Then he learned he was guarding James.\n\n\"I knew it was going to be a challenge,\" he said. \"I look at moments like this, it was fun. You want to make as few mistakes as possible, and make that guy work. LeBron's one of the best players in the league so you've got to make everything tough on him. That's what I tried to do, but we came up short.\"\n\nTIP-INS\n\nKings: G Frank Mason scored a season-high 15. ... C Willie Cauley-Stein (strained lower back) didn't play after getting hurt on Saturday against Milwaukee. Cauley-Stein is also expected to sit out Friday's game at New Orleans.\n\nCavaliers: F Tristan Thompson scrimmaged along with G Isaiah Thomas, who is nearing his debut with Cleveland after being sidelined with a hip injury. While it's still not clear when Thomas will play, Thompson, who has missed 17 games since Nov. 1 with a strained left calf, could be back in the floor in days. \"I'll be ready to return when the front office and them (the medical team) say I'm ready to return,\" Thompson said, purposely being vague. \"I gotta stay in my lane like LaVar Ball said.\" ... Cleveland has made at least 10 3-pointers in 13 straight games and scored at least 100 in 18 in a row.\n\nUP NEXT\n\nKings: Wrap up four-game trip at New Orleans on Friday.\n\nCavaliers: At Indiana on Friday.",
  "source": "espn_api",
  "crawled_at": 1764993281.681765
}