{
  "game_id": "401810073",
  "espn_id": "401810073",
  "date": "Nov 12, 2025",
  "matchup": "HOU vs WSH",
  "headline": "Durant has 23 points as Rockets beat Wizards 135-112, extending Washington's skid to 10 games",
  "body": "HOUSTON -- — Kevin Durant scored 23 points and Reed Sheppard added a season-high 21 off the bench to help the Houston Rockets coast to a 135-112 win over Washington on Wednesday night, extending the Wizards' skid to 10 games.\n\n\r\n              Houston was up by double digits for most of the game and had a 27-point lead at halftime. Washington outscored the Rockets 33-22 in the third to cut the lead to 103-87 entering the final period.\n\n\r\n              A 3-pointer by Bub Carrington got Washington within 16 again with about eight minutes to play before the Rockets used a 5-0 run, capped by a 3 from Sheppard, to extend the lead to 121-100. \n\n\r\n              Alperen Sengun made a 3-pointer for Houston to make it 126-105 with about 3 ½ minutes to play and coach Ime Udoka cleared the bench.\n\n\r\n              Alex Sarr, the No. 2 pick in the 2024 draft, had 25 points and 11 rebounds for the Wizards, who fell to 1-11 this season. Kyshawn George added 16 points, nine assists and six rebounds. \n\n\r\n              Reserve Tari Eason scored a season-best 21 points for Houston and Sengun finished with 16 points, 13 rebounds and six assists. Amen Thompson scored 18 points and had eight assists as the Rockets improved to 7-3.\n\n\r\n              Houston dominated on the boards, outrebounding Washington 53-37, including a 20-12 offensive rebounding advantage.\n\n\r\n              The Rockets led by as many as 29 in the first half, when they scored a season-high 81 points. It was the third time this season they’ve scored at least 70 points in the first half after doing so just four times last season.\n\n\r\n              Up next\r\n              Washington: Hosts Brooklyn Sunday.\n\n\r\n              Houston: Hosts Portland on Friday night as it continues a three-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042612.045446
}