{
  "game_id": "0021900579",
  "espn_id": "401161221",
  "date": "Jan 11, 2020",
  "matchup": "DET vs. CHI",
  "headline": "Bulls beat Pistons again, 108-99; Drummond ejected",
  "body": "DETROIT --  Luke Kornet helped the Chicago Bulls to the type of start coach Jim Boylen was looking for.\n\nKornet scored 12 of his 15 points in the first quarter and the Bulls took a big early lead and then held off Detroit at the end, beating the Pistons 108-99 on Saturday night to snap their six-game losing streak.\n\nZach LaVine scored 25 points for the Bulls, who shot 64% in the first quarter and led 35-20 after one.\n\n\"I thought our energy in the first quarter was maybe the difference in the game for us,\" said Boylen, whose team lost the previous night to Indiana. \"I was not happy with our start last night and our energy to start the game, so I like that. I liked the adjustment we made.\"\n\nAlready without injured Blake Griffin, the Pistons lost Andre Drummond when he was ejected early in the third quarter. Still, Detroit rallied from an 18-point second-quarter deficit and trailed by just two in the fourth.\n\nThe Bulls, however, built the lead back up to double digits toward the end. Chicago completed a four-game regular-season sweep of Detroit.\n\n\"Lack of intensity, and I take responsibility on that,\" Pistons coach Dwane Casey said. \"We didn't get having guys ready to play and come out with the right intensity. I thought the second half we did.\"\n\nLauri Markkanen and Daniel Gafford added 14 points each for the Bulls. Kornet went 5 of 6 from the field in the first quarter.\n\n\"I just happened to get the ball in some good opportunities, and making the shots,\" Kornet said. \"I don't think it was really anything special.\"\n\nDerrick Rose led the Pistons with 20 points.\n\nDrummond's ejection came after he threw the ball off the back of Gafford's head. The exchange also resulted in a technical foul on Gafford.\n\nDetroit whittled the lead to two later in the third quarter but trailed 81-71 after three. The Pistons fought back again and trailed 89-87 in the fourth. Then Detroit unsuccessfully challenged a foul on Thon Maker inside. Chicago's Thaddeus Young made two free throws to start an 11-3 run by the Bulls.\n\nROOKIE STARTER\n\nGafford made the first two starts of his career Friday and Saturday. The rookie from Arkansas scored only two points Friday, but he made a significant contribution to the win over the Pistons.\n\n\"I could have been better last night, throughout the whole game,\" Gafford said. \"So tonight I wanted to change that. I wanted to have a different look on it. This was my second start. I wanted to come out and be more efficient, be better on defense, and be way better on offense.\"\n\nEARLY EXIT\n\nDrummond finished with nine points and four rebounds, his first game all season with fewer than nine rebounds. It was his fewest rebounds since he had three on Jan. 18, 2019, against Miami. He left that game because of an injury.\n\nTIP-INS\n\nBulls: Wendell Carter Jr. (right ankle sprain) missed the game. ... The Bulls are 4-2 in the second half of back-to-backs this season but are just 1-5 in the first half.\n\nPistons: Detroit was without Luke Kennard (bilateral knee tendinitis). ... Rose has scored at least 20 points in five straight games, his longest streak since a five-game run in January 2012. ... Drummond made a 3-pointer in the first quarter. He entered the game 0 for 19 from long distance this season. ... The Pistons turned the ball over 19 times.\n\nUP NEXT\n\nBulls: At Boston on Monday night.\n\nPistons: Host New Orleans on Monday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996278.278049
}