{
  "game_id": "0022400675",
  "espn_id": "401705241",
  "date": "Jan 30, 2025",
  "matchup": "ATL @ CLE",
  "headline": "New All-Stars Darius Garland and Evan Mobley help NBA-leading Cavaliers beat Hawks 137-115",
  "body": "CLEVELAND -- — Darius Garland scored 26 points and Evan Mobley had 16 points and 10 rebounds after both were named All-Star reserves, helping the NBA-leading Cleveland Cavaliers to a 137-115 win over the Atlanta Hawks on Thursday night.\n\n\r\n              Donovan Mitchell scored 24 points and Ty Jerome added 20 points off the bench for Cleveland (39-9), which has the best home record in the league at 23-3. Jarrett Allen had nine points and 15 rebounds.\n\n\r\n              Hawks rookie Zaccharie Risacher, the No. 1 overall draft pick, scored 30 points and De’Andre Hunter had 25 points and made all 12 of his free throws. Atlanta has lost a season-high seven straight.\n\n\r\n              Cleveland built a 29-point lead in beating the Hawks for the first time in three games this season. Atlanta won the first two meetings by a combined 27 points on Nov. 27 and Nov. 29.\n\n\r\n              Takeaways\r\n              Hawks: Point guard Trae Young, who is averaging 22.7 points and a league-high 11.4 assists, was not chosen as an All-Star. He missed 11 of 16 shots and finished with 15 points and 10 assists.\n\n\r\n              Cavaliers: All-Star starter Mitchell has been the driving force behind Cleveland’s three-game winning streak that followed its initial three-game skid of the season, scoring 79 points in 88 minutes.\n\n\r\n              Key moment\r\n              Garland banked in a runner and Max Strus followed with back-to-back 3-pointers in a 41-second span early in the third quarter, extending Cleveland’s lead to 88-69. Mitchell pushed it out to 90-70 with a layup that completed the 10-1 run.\n\n\r\n              Key stat\r\n              The Cavaliers have three All-Stars for the fourth time in franchise history in Mitchell, Garland and Mobley. Kenny Atkinson and his assistants also will be part of the mini-tournament, coaching two of the four teams.\n\n\r\n              Up next\r\n              The Hawks visit Detroit on Saturday. The Cavaliers continue their three-game homestand Sunday against Dallas.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997925.2878132
}