{
  "game_id": "0022200637",
  "espn_id": "401468792",
  "date": "Jan 13, 2023",
  "matchup": "PHX @ MIN",
  "headline": "Edwards, Timberwolves bounce back to beat short-handed Suns",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 31 points, D’Angelo Russell had 17 and the Minnesota Timberwolves held off the short-handed Phoenix Suns 121-116 on Friday night.\n\n\r\n              Taurean Prince added 16 points off the bench and fellow reserve Naz Red had 13 points for Minnesota. The Timberwolves won for the fourth time in five games and bounced back from a 135-118 loss in Detroit on Wednesday night.\n\n\r\n              “The start was perfect, but the finish was bad,” Edwards said. “Everything won’t be perfect, but we could’ve finished a little better, for sure.”\n\n\r\n              Damion Lee led Phoenix with a career-high 31 points and Mikal Bridges had 24. The Suns were again without stars Chris Paul and Devin Booker, along with Cameron Johnson and backcourt backups Cameron Payne and Landry Shamet.\n\n\r\n              Deandre Ayton returned after missing two games with a left ankle sprain and had 11 points and 11 rebounds, but the big center struggled against Minnesota’s Rudy Gobert. Ayton shot just 5 of 18 from the field.\n\n\r\n              The Suns are 6-17, the third-fewest wins in the NBA, since ending November with a 15-6 record. They have been without Booker, their leading scorer for much of that stretch.\n\n\r\n              “I told the guys we’ve got to keep our spirit in a good place because when it all starts to come together, it can multiply,” Phoenix coach Monty Williams said. “We just got to keep plugging away.”\n\n\r\n              Edwards scored seven points during a 12-0 run by the Timberwolves in the first quarter that established a 21-9 lead. Minnesota never trailed again, taking the lead out to 24 points against a depleted Suns team that had beaten the Wolves in the previous six meetings.\n\n\r\n              Minnesota won four straight games between a pair of disappointing losses to the Pistons, who were in last place in the East at the time.\n\n\r\n              \"Feel like that was lacking, our focus, our communication, our overall just energy and effort wasn’t there versus Detroit,” said veteran guard Austin Rivers. “So, we wanted to come in here and play at a high level. We were about to do that for, probably, like 40 minutes of the game. Those last eight minutes, it got a little weird.”\n\n\r\n              Phoenix closed within six in the final minutes, but Edwards helped Minnesota withstand the late run.\n\n\r\n              “We’ve had a habit all season of building the lead and kind of hijacking our momentum with bad shots and turnovers that lead to crazy offense for our opponents,” Wolves coach Chris Finch said. “So, tonight was a classic example of that. But, you know, for the most part, I thought we did things well for 80% of the game.”\n\n\r\n              LEE GETS A CHANCE\n\n\r\n              Saben Lee, a third-year guard on a two-way contract, helped the Suns come back. He scored 12 points and had two assists in the fourth.\n\n\r\n              “What a tough situation to come into but a privilege at the same time,” Williams said. “He knows about 20% of what we do. The kid plays hard. He gets into the ball. He’s getting to the paint, which is something we haven’t had.”\n\n\r\n              TIP-INS\n\n\r\n              Suns: Booker has missed 17 of the past 18 games with a left groin strain and only played four minutes in the one game he played. The team is 4-14 in that stretch. … Paul has missed the last four games with right hip soreness. Payne (right foot sprain) has missed the last five games and Shamet (right hip soreness) has missed three in a row. … Johnson, who’s been out since Nov. 4 after knee surgery to repair a meniscus tear, warmed up before the game. … Phoenix had 19 turnovers leading to 17 points.\n\n\r\n              Timberwolves: Gobert only took one shot, but he finished with four points and 12 rebounds. ... Minnesota had 15 turnovers that led to 25 points. … The Wolves scored 64 points in the paint.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Finish a four-game trip Monday in Memphis.\n\n\r\n              Timberwolves: Host Cleveland on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995078.245863
}