{
  "game_id": "0021900172",
  "espn_id": "401160814",
  "date": "Nov 15, 2019",
  "matchup": "OKC vs. PHI",
  "headline": "Gallinari, Paul lead Thunder past 76ers 127-119 in OT",
  "body": "OKLAHOMA CITY --  When Danilo Gallinari hit a big 3-pointer in overtime, the crowd roared in support of the Oklahoma City Thunder.\n\nIt was just like old times.\n\nGallinari scored 28 points to help Oklahoma City beat the Philadelphia 76ers 127-119 on Friday night.\n\nChris Paul had 27 points for the Thunder, who had dropped three of four. Shai Gilgeous-Alexander scored 24 points, and Terrance Ferguson finished with 19.\n\nIt was the biggest win of the season for a franchise that lost All-Stars Russell Westbrook and Paul George in offseason trades. The sellout Chesapeake Energy Arena crowd of 18,203 backed the Thunder with loud cheering in the fourth quarter and overtime and made it seem, for a night, like nothing had changed in a venue long known as one of the league's loudest places.\n\n\"It was amazing,\" Gallinari said. \"These are the moments players live for and these are the moments you want at home. It was great to get them a W.\"\n\nGallinari missed a jumper from the top of the key that would have won it at the end of regulation, but he made up for it with seven points in overtime.\n\nThe Thunder relentlessly attacked the bigger 76ers and outscored them 35-15 at the free-throw line. Oklahoma City shot 53.9% from the field for the night.\n\n\"I give our guys credit because I think we tried to play to our identity and tried to do it consistently through four quarters,\" Thunder coach Billy Donovan said.\n\nJoel Embiid had 31 points and 12 rebounds and Josh Richardson added 28 points for the 76ers, who have lost five of seven.\n\n\"We're obviously frustrated,\" forward Tobias Harris said. \"Losing five of seven is not where we want to be. It's early in the season, and right now, we're going to progress and get better and find ways to figure out ways to help each other and help our team and go from there.\"\n\nOklahoma City outscored Philadelphia 20-12 in overtime. The Thunder went 5 for 7 from the field and 8 for 8 at the line in the extra period.\n\n\"Lots of whistles,\" 76ers coach Brett Brown said. \"They called it how they wanted to call it. ... Sometimes, the game is called that way, and that's how it was.\"\n\nTIP-INS\n\n76ers: Made their first five shots. ... Shot 59.1% in the first quarter to take a 29-24 lead. ... Harris scored 21 points before he fouled out in overtime. G Ben Simmons also fouled out in overtime. He had 16 points, 11 rebounds and eight assists. ... Embiid returned after missing a game with soreness in his left knee.\n\nThunder: G Hamidou Diallo sat out with a left knee strain. ... C Nerlens Noel fouled out. He had six points and seven rebounds in 18 minutes. ... Donovan won a coach's challenge for possession with 4:37 remaining in the game and the 76ers leading 96-93.\n\nHE SAID IT\n\nBrown, on his players fouling with Oklahoma City already in the bonus: \"I think there has to be better awareness on bonus stuff. I think there has to be better discipline of not taking swipes at things when you've got to show your hands. I thought there were some hard luck fouls that might be questionable. But at the end of the day when you look at this, I think it points to free throws.\"\n\nBOUNCING BACK\n\nGallinari broke out of a mini-slump by shooting 7 for 11 from the field, including a 3-for-5 performance from 3-point range. He also made all 11 of his free throws.\n\nGallinari went 3 for 8 against Indiana in his previous game and missed all three of his 3-pointers. In the game before that, he shot 4 for 17 and made just 2 of 10 3s.\n\nSTAT LINES\n\nPaul had perhaps his best game with the Thunder. He scored 12 points in the fourth quarter to give Oklahoma City a chance.\n\nUP NEXT\n\nSixers: Visit the Cleveland Cavaliers on Sunday.\n\nThunder: Visit the Los Angeles Clippers on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996250.935804
}