{
  "game_id": "0021900611",
  "espn_id": "401161253",
  "date": "Jan 15, 2020",
  "matchup": "HOU vs. POR",
  "headline": "Lillard leads Trail Blazers to 117-107 win over Rockets",
  "body": "HOUSTON --  After getting off to a disappointing start this season, the Portland Trail Blazers are focused on playing much better going forward.\n\nOn Wednesday night against the Houston Rockets they did that, limiting James Harden to his fewest points of the season in a 117-107 win.\n\n“A season is full of ups and downs and we've had more downs this year than ups, but it's a whole second half of the season to play,” Damian Lillard said. “We executed and we played like we wanted to win the game ... we've just got to try to sustain that.”\n\nLillard scored 25 points and CJ McCollum added 24 as the Trail Blazers withstood a late surge from the Rockets to get their second straight victory.\n\nThe Trail Blazers led by double figures for most of the game, but the Rockets began cutting into the lead in the fourth. A 3 by Ben McLemore got them within five with about five minutes to go.\n\nBut McCollum and Carmelo Anthony then made consecutive 3-pointers for Portland to make it 111-100 with four minutes left, and Houston didn't threaten again.\n\nWhen Hassan Whiteside made four points in a row, capped by a dunk, later in the fourth to make it 115-102, the home fans began streaming for the exits.\n\nRussell Westbrook had a triple-double with 31 points, 12 assists and 11 rebounds on a night when Harden scored 13 points. It was the fewest points Harden had scored since he had 10 against Minnesota on Jan. 18, 2018.\n\nLillard was proud of the work they did against Harden, who entered the game averaging an NBA-best 37.8 points a game.\n\n“We gave him a lot of attention and pretty much just made him give the ball up to other guys and decided were going to live with somebody else beating us,\" Lillard said. “And it turned out to be a pretty good game plan.\"\n\nHouston lost consecutive games for the first time since a season-high three-game skid from Nov. 20-24, and has dropped three of its last four.\n\n“Everyone goes through the tough times throughout the course of the year,” Harden said. “For us, this is now. We’ve got to come together and figure out what the problem is and go out there and try to fight through it.\"\n\nThe Rockets had a tough shooting night after losing to Memphis 121-110 on the road Tuesday night and shot just 39.6%. Harden shot 3 of 12 and center Clint Capela was just 7 of 14.\n\nHouston scored the first five points of the fourth quarter, but Portland got 3s from Gary Trent, Jr. and Anthony Tolliver to make it 96-82.\n\nMcCollum made all of Portland's points in a 6-3 spurt later in the fourth to leave the Trail Blazers up 102-88.\n\nWestbrook was at the free throw line soon after that, and he and Lillard both received technical fouls for jawing at each other.\n\nHouston finally found some rhythm on offense after that and used a 9-1 run, with 3s from P.J. Tucker and McLemore to cut the deficit to 103-97 midway through the quarter.\n\nIt was a nine-point game when the Rockets' Danuel House made a layup midway through the third quarter, but Portland scored the next seven points, including a 3 from Kent Bazemore, to extend it to 81-65 two minutes later.\n\nEric Gordon made two 3-pointers after that to power a 6-3 run that got Houston within 84-71.\n\nHouston made six straight points later in the third, but Lillard added a layup for Portland to wrap up the quarter and leave the Trail Blazers up by 13 entering the fourth.\n\nTIP-INS\n\nTrail Blazers: Whiteside had 18 points and 17 rebounds. ... All five players in Portland's starting lineup scored at least 10 points. ... Portland made 11 of 36 3-pointers.\n\nRockets: Westbrook has scored 20 or more points in 15 straight games. ... Gordon scored 20 points with six 3s and has made at least four 3-pointers in three games in a row. ... Harden had eight rebounds and seven assists.\n\nMELO RETURNS TO HOUSTON\n\nAnthony added 18 points with 12 rebounds for Portland in his first game against Houston since the Rockets parted ways with him after just 10 games last season. After he left Houston, Anthony didn't find another job until the Trail Blazers signed him in November.\n\nBut he insisted he didn't have any added emotions in his return to Houston, saying he'd already dealt with his feelings about what happened here.\n\n“I kind of got past all of that, the time that I was off,\" he said. “The time that I did have to kind of think about that situation, and I’ve done dealt with every emotion that you could think about. Trying to figure out why. Questioning myself at the beginning. Working so hard to get past that and kind of be at peace with that.\"\n\nUP NEXT\n\nTrail Blazers: Visit Dallas on Saturday night.\n\nRockets: Host the Lakers on Saturday night.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996634.3953102
}