{
  "game_id": "0022000400",
  "espn_id": "401267560",
  "date": "Feb 12, 2021",
  "matchup": "LAC @ CHI",
  "headline": "Leonard scores 33 as Clippers beat Bulls 125-106",
  "body": "CHICAGO -- — Kawhi Leonard got rolling in the third quarter, and Marcus Morris and Lou Williams took over in the fourth. It all added up to another win for the Clippers.\n\n\r\n                    Leonard scored 33 points, Morris added 20, Williams scored 17 and Los Angeles beat the Chicago Bulls 125-106 on Friday night.\n\n\r\n                    Leonard finished three points shy of a season high set two nights earlier at Minnesota. He scored 16 points in the third quarter to help Los Angeles stretch a four-point lead to 12.\n\n\r\n                    “Kawhi, when he gets it going, it's hard to stop him,” teammate Ivica Zubac said. “He's hitting those contested shots like there's no defense. He gets the ball so high. It seems like defense doesn't affect him. When he gets it going, we're a tough team to beat.”\n\n\r\n                    Morris scored 15 points in the fourth, hitting five 3-pointers, and finished 6 of 8 from beyond the arc. Williams added 11 points in the final quarter, and the Clippers won their second straight after losing two in a row.\n\n\r\n                    The Bulls cooled off after setting a franchise-record with 25 3-pointers in a win over New Orleans on Wednesday, making 12 of 32. \n\n\r\n                    Zach LaVine, coming off a season-high 46-point outing, scored 26. He also had nine rebounds and six assists.\n\n\r\n                    Coby White and Tomas Satoransky added 17 points apiece, but coach Billy Donovan noticed too many quick possessions. That in turn took a toll on the defense, and the Bulls fell to 4-9 at the United Center.\n\n\r\n                    “They were quick possessions,\" Donovan said. “It was like no pass, one pass, shot. And if you don't make those shots, you're back having to guard again instead of maybe getting to the free-throw line, slowing the game down, getting physicality into the game defensively.\"\n\n\r\n                    The Clippers led by eight late in the third after Zubac hit two free throws. Leonard nailed a 3 in the closing minute and added a free throw with a second left to make it 90-78.\n\n\r\n                    Los Angeles outscored Chicago 35-28 in the fourth, with Williams and Morris combining for nearly as many points as the Bulls.\n\n\r\n                    Williams, coming off a 27-point outing, scored 11 of his team's first 13 points in the quarter. He made back-to-back layups to push the lead to 103-86. Morris hit a 3 to make it 109-90 with seven minutes remaining.\n\n\r\n                    “We've got to be if not the best bench in the league — both of us are proven vets and proven scorers in this league,” Morris said. “I think it's just our camaraderie. Being really good friends, that helps us on the court, not just scoring (but) being vets, being able to talk, being able to lead the team, being able to lead our unit.\"\n\n\r\n                    STILL A THRILL\n\n\r\n                    Even in his 16th season, Williams still gets a kick out of playing in Chicago. He posted a video on Instagram showing the Bulls' banners and Michael Jordan's retired number 23 and Pippen's 33.\n\n\r\n                    “I'm still kind of in awe of some of the things that I've been able to experience throughout the game of basketball,\" he said. “To be in Michael Jordan's house, that never gets old to me.”\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Paul George missed his fourth consecutive game with a swollen right toe. Coach Tyronn Lue said they texted Friday and the six-time All-Star is “in a good place, good spirits.” George is second on the team in scoring at 24.4 points per game. ... Chicago product Patrick Beverley had six points in about 12 minutes in his second game back after missing eight in a row with a right knee injury. \n\n\r\n                    Bulls: F Otto Porter Jr. missed his sixth straight game with recurring back spasms. \n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Los Angeles hosts the Cleveland Cavaliers on Sunday.\n\n\r\n                    Bulls: Chicago visits the Indiana Pacers on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997690.662594
}