{
  "game_id": "0021801067",
  "espn_id": "401071740",
  "date": "Mar 20, 2019",
  "matchup": "PHI vs. BOS",
  "headline": "Embiid gets 37 and 22 to lead 76ers past Celtics 118-115",
  "body": "PHILADELPHIA --  Boston's recent dominance of the Philadelphia 76ers has been frustrating for Joel Embiid. So when Marcus Smart angrily shoved the star big man to the ground, Embiid had finally had enough.\n\nEmbiid had 37 points, 22 rebounds and a key block on Kyrie Irving with 35 seconds remaining, and Jimmy Butler scored 15 of his 22 points in the fourth quarter to lead the Philadelphia 76ers over the Boston Celtics 118-115 on Wednesday night for their sixth straight victory.\n\nTobias Harris added 21 points for the 76ers, who avoided a season sweep by the Celtics. Philadelphia (47-25) holds the No. 3 seed in the Eastern Conference playoff race, three games ahead of idle Indiana and four in front of fifth-place Boston.\n\n\"He was very, very dominant tonight,\" 76ers coach Brett Brown said of Embiid. \"He showed in many ways how much it means to him, and I respect his tenacity.\"\n\nA turning point came early in the second half when tempers flared.\n\nSmart took objection to Embiid sticking his left elbow out as Smart ran past the Philadelphia center on defense. With Embiid's back turned, Smart gave Embiid a two-handed shove that sent him sprawling toward the sideline. An enraged Embiid got up and went after Smart. Both players were restrained, and no punches were thrown. After an officials' review, Smart was ejected for a Flagrant 2 foul.\n\nA motivated Embiid scored the next eight points to help Philadelphia trim a 69-58 halftime deficit.\n\n\"Stuff like that gets me going, gets the crowd going,\" Embiid said. \"Obviously, I was frustrated because it was a cheap shot. I didn't see it coming.\"\n\nThe 76ers, who trailed by 15 in the first half, continued to chip away at the Boston lead. The game remained tight throughout the fourth quarter and was tied at 113 with a minute left before Ben Simmons converted a three-point play. He banked in a shot with his right hand and got fouled by Marcus Morris, hitting the free throw to make it 116-113 with 40.8 seconds to go.\n\nEmbiid then rejected a driving Irving on the Celtics' ensuing possession, and Butler sealed it with a long jumper from the wing with 4.7 ticks remaining.\n\n\"I thought I had him beat,\" Irving said. \"Clean block. Great play.\"\n\nIrving scored 36 points, but the 76ers finally broke their hex against Boston.\n\nThe host Celtics took the season opener 105-87, won a nationally televised Christmas game 121-114 in overtime also in Boston and earned a 112-109 win in Philadelphia on Feb. 12. Embiid was fined $25,000 after the latest loss for criticizing officials.\n\nBoston also eliminated the 76ers from the playoffs last season, and Brown acknowledged prior to Wednesday's game that it was important for Philadelphia psychologically to defeat Boston.\n\n\"It was good to get this win,\" Embiid said. \"It was a great step to what we're trying to do here. We've been losing a lot to them. I knew that I had to come out and be extra physical and set the tone.\"\n\nNOT SMART PLAY\n\nThe Celtics acknowledged that losing Smart was a big blow.\n\n\"He took responsibility,\" Irving said. \"He knows how much of a big piece he is. We need him out there.\"\n\nThe Celtics already were short-handed without Gordon Hayward (concussion) and Aron Baynes (left ankle).\n\n\"I'm disappointed in Marcus,\" Boston coach Brad Stevens said. \"We need him to be in the game.\"\n\nSMART PLAY\n\nTurnovers had been an Achilles' heel for the 76ers in the three losses to the Celtics this season, averaging 16.3 miscues in those games. But Philadelphia turned it over just eight times on Wednesday night.\n\nTIP-INS\n\nBoston: Hayward missed his second straight game. ... Aron Baynes injured his left ankle with 5:07 left in the first half and didn't return. ... The Celtics dropped to 17-18 on the road. ... Smart exited with three points.\n\nPhiladelphia: JJ Redick had 17 points and Simmons scored 13. ... The 76ers improved to 29-9 at home. They have 10 games left in the regular season.\n\nUP NEXT\n\nCeltics: At the Charlotte Hornets on Saturday night.\n\n76ers: At the Atlanta Hawks on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764993994.16356
}