{
  "game_id": "0022000087",
  "espn_id": "401267247",
  "date": "Jan 03, 2021",
  "matchup": "MEM vs. LAL",
  "headline": "James leads Lakers past Grizzlies to open 2-game set",
  "body": "MEMPHIS, Tenn. -- — LeBron James took over the game to open the fourth quarter and helped the Los Angeles Lakers pull away for their third straight victory.\n\n\r\n                    James had 22 points, 13 rebounds and eight assists, Anthony Davis added 17 points and nine rebounds as the Lakers opened a two-game set in Memphis with a 108-94 victory over the Grizzlies on Sunday night.\n\n\r\n                    “We were doing a lot of jostling with Memphis,” James said, “At the start of the fourth, I wanted to try and implement myself and my scoring a little bit more. Get a bit more in attack mode and see if I could kind of open the game up and we were able to do that.”\n\n\r\n                    James played within the offense for the first three quarters, then became more aggressive to start the fourth, scoring the Lakers first 10 points of the period. His 3-pointer with 2:34 left made it 101-90.\n\n\r\n                    Montrezl Harrell added 16 points and nine rebounds to help the Lakers.\n\n\r\n                    Kyle Anderson led Memphis with 18 points, and Jonas Valanciunas had 14 points and 10 rebounds. Tyus Jones also had 14 points, and rookie Desmond Bane had 13.\n\n\r\n                    The Lakers led 56-54 at the break after both teams held advantages of at least nine points in the first half. Los Angeles took a 77-75 lead into the fourth.\n\n\r\n                    After surrendering 36 points in the first quarter, the Lakers held the Grizzlies to 18, 21, and 19 over the final three periods.\n\n\r\n                    “That’s figuring out opponents, making in-game adjustments and doing what’s necessary to get a win,” Lakers coach Frank Vogel said.\n\n\r\n                    The teams will meet again Tuesday night.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: G Kentavious Caldwell-Pope missed the game with soreness in a left ankle he sprained in the last game against San Antonio. Kyle Kuzma started in Caldwell-Pope’s place. …G Alex Caruso missed his fourth game under the health and safety protocol. \n\n\r\n                    Grizzlies: Due to local COVID-19 restrictions, the game was played with no general tickets sold. However, about 75 “guests” were allowed in floor seats. Additionally, family members and some friends were seated in the lower bowl of FedExForum. …G Grayson Allen returned after missing Friday’s win at Charlotte with a mild left ankle sprain. …Rookie Xavier Tillman playing in his first game, scored his first NBA points in the opening quarter.\n\n\r\n                    LBJ MINUTES: Lakers coach Frank Vogel said the front office and staff have discussed James’ playing time. “It’s a day-to-day, game-to-game type of thing We just want to be responsible with his minutes.”\n\n\r\n                    GASOL TRIBUTE: Lakers center Marc Gasol played in Memphis for the first time since he was traded to Toronto at the 2019 trade deadline. Gasol played 10-plus seasons with the Grizzlies. The Raptors did not travel to Memphis after COVID-19 stalled last season. The Grizzlies had a video tribute to Gasol during a first-quarter timeout.\n\n\r\n                    “You always have in the back of your mind – when am I going to play Memphis again,” Gasol said of the post-trade situation. “In your mind is the stands are full. …It makes it a little less special because with people it would have made this journey here to Memphis unique and special to me.”\n\n\r\n                    James added: “I hope when we get our fans back, that Marc can get another (video),” James said. “I truly hope that they re-show that video again.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996989.259904
}