{
  "game_id": "0021500944",
  "espn_id": "400828831",
  "date": "Mar 08, 2016",
  "matchup": "TOR vs. BKN",
  "headline": "DeRozan leads Raptors past Nets, 104-99",
  "body": "TORONTO --  DeMar DeRozan wouldn't reveal exactly what was said in the Toronto Raptors' locker room at halftime with his team down 16 points, though coach Dwane Casey's message registered loud and clear.\n\nThe Raptors roared back to beat the Brooklyn Nets 104-99 on Tuesday night in their first game since the franchise-record, 12-game home win streak ended Sunday against Houston.\n\n\"It's was a good one,\" DeRozan said of Casey's rallying call. \"It was one that we definitely needed and the way we came out in the second half definitely speaks volumes. He came in and really got onto us and we responded like we're supposed to.\"\n\nDeRozan had 25 points, with Kyle Lowry adding 23 points and nine assists in the comeback victory from a 58-42 halftime hole that equaled Toronto's biggest of the season, done in a loss at Golden State in November.\n\nBrook Lopez had 35 points, one shy of his season high, for the Nets, who lost the season series to the Raptors for the first time since 2009-10. Lopez was also the only Net to reach the free throw line, going 9 for 9.\n\n\"He's our horse, he's our guy,\" interim coach Tony Brown said. \"He had a great game tonight and we try to do as much as possible to get him the ball because he's one of the few guys who had it going. Hell of game by him and it's just unfortunate we don't get the `W.\"\n\nFor Casey, who had emphasized the need for better defense after recent lapses against Portland and Houston, the focus is not good enough for a team that's challenging for the Eastern Conference lead.\n\n\"It shouldn't take me going in at halftime and jumping up and down and challenging them,\" he said. \"We came out of the second half and that is who we have to be. But we have to start that at the beginning of the game.\"\n\nThe Raptors shot just 3 for 15 from the floor in the second quarter but their defense stepped up after halftime, forcing a 22-9 run to close the third before four 3-pointers in under three minutes at the start of the fourth turned a two-point deficit into a 10-point lead.\n\n\"That's a very good team,\" Lopez said. \"They're in a great position in the East, they're definitely contending in the East and contending in the league and we had a good showing. Unfortunately they went on that huge run and we weren't able to claw quite back into it.\"\n\nBROTHER ACT\n\nLopez's twin brother, New York Knicks center Robin, has already had a run-in with the Raptors mascot this season, playfully smashing a large piece of cardboard over the dinosaur's head after a list of the mascot's favorite Lopez's contained neither of the NBA-playing brothers. Tuesday night was Brook's turn, and he chased the dino around a basketball rack before playfully flipping him to the floor, WWE style.\n\nSTAR WARS\n\nWhen starting centers Jonas Valanciunas and Lopez tangled early on in the game, Lopez received an inadvertent elbow to his nose. While he refused to blame his opponent, calling it a basketball play, Lopez instead chose to look on the bright side of the clash when asked how his nose held up to the blow. \"It's as ugly as ever but Harrison Ford has a crooked nose so I'm going to be like him,\" he laughed.\n\nTIP-INS\n\nNets: With no games between Saturday's loss in Minnesota and Tuesday's game in Toronto, Brooklyn was afforded the chance to fly home for a brief respite during its season-high, nine-game road trip. While Brown said he appreciated the chance to sleep in his own bed, at the end of the day, \"it was quick, it wasn't long and we're back out on the road again obviously.\" The away swing ends after Friday's game in Philadelphia.\n\nRaptors: With usual starter Luis Scola being rested in place of Jason Thompson, DeRozan is now the only Raptor to have started all 62 games this season. Thompson had nine points and five rebounds in his first start as a Raptor. .The Raptors (10-1) joined Golden State (13-1), Oklahoma City (10-1) and San Antonio (10-2) as the only teams in the NBA to register 10 wins within their division. . With 10 points, Valanciunas has now reached double figures in a career-high 15 straight games, with Toronto posting a 24-8 record when the Lithuanian center scores 10 or more points.\n\nUP NEXT\n\nNets: Visit Philadelphia on Friday.\n\nRaptors: Host Atlanta on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994706.18034
}