{
  "game_id": "0021800089",
  "espn_id": "401070770",
  "date": "Oct 29, 2018",
  "matchup": "SAC @ MIA",
  "headline": "Kings run away after halftime, top Heat 123-113",
  "body": "MIAMI --  Sacramento's offensive approach was not exactly elaborate: Run, run, run and keep running.\n\nOnce the Kings got rolling, Miami had no answers.\n\nWillie Cauley-Stein scored 26 points and grabbed 13 rebounds, Buddy Hield added 23 points and the high-octane Kings put their youthful athleticism on full display in getting past the Heat 123-113 on Monday night -- putting up huge numbers even after sputtering through the first quarter.\n\n\"We ain't had this energy in a while here, so this energy is just refreshing,\" Cauley-Stein said. \"It's fun to play like this, playing fast, everyone getting the touches, everybody sharing the energy. It's just fun to play.\"\n\nDe'Aaron Fox scored 20 points and Nemanja Bjelica added 19 for the Kings, who outscored Miami 77-55 in the middle two quarters and won on the Heat's home floor for the second consecutive season.\n\nThe Kings outscored Miami 68-38 in the paint, and 27-9 off turnovers.\n\n\"You've got some teams that are special offensively,\" Heat guard Dwyane Wade said. \"That team ... they're just go-go-go. That was like a conditioning test out there. They're using their strengths as a team. That's the league, man.\"\n\nJosh Richardson scored a career-high 31 points for Miami, which got an NBA season-high 24 rebounds from Hassan Whiteside, one shy of his career high. Whiteside also had 16 points and five blocked shots for the Heat.\n\n\"We like to play at pace, but it has to be on our terms,\" Heat coach Erik Spoelstra said. \"And that was fully on their terms.\"\n\nIt was tied at the half, and Sacramento ran away in the third.\n\nHield had 14 points in the third quarter, six of them starting what became a 14-4 Kings run that gave them an 82-65 lead. Cauley-Stein added 11 in that pivotal quarter, one where the Kings put up 43 points -- their best one-period total in nearly three years.\n\n\"I was running the floor and my teammates were finding me in rhythm,\" Hield said. \"That was the big thing.\"\n\nGoran Dragic scored 20 and Tyler Johnson had 11 for Miami, which led 28-17 after the first and was outscored by 21 the rest of the way.\n\n\"The biggest part about early in the game is we didn't go away,\" Kings coach Dave Joerger said.\n\nTIP-INS\n\nKings: The 43-point third was Sacramento's highest-scoring quarter since a 44-point third on Jan. 2, 2016 against Phoenix -- 880 quarters before Monday's outburst. ... This is only the second time in the last 12 years that Sacramento (4-3) has had a winning record after seven games. The Kings were 5-2 at this point in 2014-15.\n\nHeat: Miami has scored at least 90 points in each of its last 37 regular-season-games, tying the franchise record (done twice previously, most recently in the 2004-05 season). ... It was the first -- and last -- time that Wade played in what became a home loss to Sacramento. Miami was 11-0 with him in the lineup against the Kings at home, while Chicago and Cleveland were both 1-0 in such games.\n\nNEAR AND FAR\n\nSacramento shot 34 for 56 inside the paint, and 12 for 26 from 3-point range. From everywhere else, the Kings were just 2 for 15.\n\nDAILY SHOW\n\nTrevor Noah, the host of Comedy Central's \"The Daily Show,\" was sitting courtside. Noah and his show are taping in Miami Beach this week, with Miami Marlins CEO Derek Jeter slated to be a guest on Tuesday's broadcast -- and Wade sitting down with Noah for Thursday's show.\n\nUP NEXT\n\nKings: Visit Orlando on Tuesday.\n\nHeat: Visit Charlotte on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994231.954914
}