{
  "game_id": "0022300026",
  "espn_id": "401584114",
  "date": "Nov 14, 2023",
  "matchup": "LAL vs. MEM",
  "headline": "D'Angelo Russell leads the Lakers to a 134-107 win over Memphis in the In-Season Tournament",
  "body": "LOS ANGELES -- — D’Angelo Russell scored 24 points and Anthony Davis had 19 points, 11 rebounds and six blocked shots in the Los Angeles Lakers’ third straight victory, 134-107 over the Memphis Grizzlies in the NBA In-Season Tournament on Tuesday night.\n\n\r\n              LeBron James had 16 points and nine rebounds while playing only 23 minutes for the Lakers, who improved to 5-0 at home and 2-0 in tournament play with their first comfortable victory of the season.\n\n\r\n              Russell hit six of the Lakers' franchise record-tying 22 3-pointers, and Austin Reaves made four while scoring 16 points with 12 rebounds and seven assists. After experiencing repeated shooting struggles during the first 10 games of the season, Los Angeles made 58% of its shots against the Grizz and hit 62.9% of its 3-pointers while outrebounding Memphis 54-33.\n\n\r\n              “You don't want to be that guy (struggling) when the team is shooting extremely well,” James said. “You want to chip in and be a part of it. Definitely a great shooting night for us tonight, and a good win for us.”\n\n\r\n              Rui Hachimura scored 12 of his 23 points in the fourth quarter for Los Angeles, which hadn't won a game by more than six points before jumping to a 31-point lead over the short-handed Grizzlies in the second half and coasting home with James, Davis and Russell all sitting out the entire fourth quarter.\n\n\r\n              “They were all good looks, and we were just making them,” Hachimura said. “Especially with LeBron and AD getting most of the attention from the defenses ... you're going to get easy looks.”\n\n\r\n              Santi Aldama scored a career-high 24 points for the Grizzlies, who lost two more players to injury while failing to follow up their surprise win over the Clippers on Sunday with their third victory of the season.\n\n\r\n              Marcus Smart left the court in the first quarter with a left ankle injury and didn’t return. The veteran guard struggled to put weight on his foot after landing awkwardly on Reaves’ foot. Smart will be re-evaluated when Memphis returns home.\n\n\r\n              Luke Kennard also missed the second half with left knee soreness for the Grizzlies, who made 20 3-pointers but struggled to score in the paint against a Los Angeles defensive effort led by Davis.\n\n\r\n              “Obviously we've got our challenges, but there's no excuses,” Memphis coach Taylor Jenkins said. “Next-man-up mentality. Show that resiliency, that fight, that care factor. It's there. I'm seeing it. It's not leading to the results right now, but brighter days are ahead. We've just got to endure and overcome. ... Injuries come and go. They're stacked up right now. So be it. Just keep battling. That's all that we have to focus on.”\n\n\r\n              The teams received a combined five technical fouls in the first quarter after Davis and Aldama got into an altercation under the basket.\n\n\r\n              After Davis scored, Aldama grabbed the ball and stepped toward Davis, who responded by shoving the Spaniard. Desmond Bane then confronted Davis, and Russell shoved Bane. Jenkins also got a T.\n\n\r\n              Los Angeles then rolled to a 74-51 halftime lead in its highest-scoring first half of the season, with Davis racking up 15 points and eight rebounds.\n\n\r\n              James returned after missing Sunday's victory over Portland to rest his injured shin, but Los Angeles played without Gabe Vincent and Jarred Vanderbilt, who has been cleared to ramp up his recovery from a heel injury that has sidelined him for the entire season.\n\n\r\n              James said his shin is “not 100%, but still good enough to go out there.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At San Antonio on Saturday.\n\n\r\n              Lakers: Host Sacramento on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995549.814854
}