{
  "game_id": "0022100114",
  "espn_id": "401359938",
  "date": "Nov 03, 2021",
  "matchup": "MEM vs. DEN",
  "headline": "Jaren Jackson Jr. helps Grizzlies beat Nuggets -- again",
  "body": "MEMPHIS, Tenn. -- — There are times this season where Jaren Jackson Jr. has not played up to what is expected.\n\n\r\n                    That changed Wednesday night, primarily in the fourth quarter of Memphis’ 108-106 victory over the Denver Nuggets that gave the Grizzlies a two-game sweep in the series between the teams this week.\n\n\r\n                    Jackson had 22 points, eight rebounds and three blocks while kickstarting a fourth quarter Memphis burst. In that final frame, the Grizzlies forward made all three of his shots – all of them 3-point attempts -- grabbed five rebounds and had a block.\n\n\r\n                    And he was the defender when Denver center Nikola Jokic had his 11-footer to tie the game bounce off the front of the rim as times expired. Jackson had watched enough film that he knew Jokic would check the clock on the other end of the floor to see how much time remained.\n\n\r\n                    “Usually (the shot) hits the front of the rim, then hits the back and it goes in,” Jackson said. “The fact that it was a little bit short. Whatever we can do to make him a little bit uncomfortable.”\n\n\r\n                    Ja Morant added 18 points, six rebounds and six assists, and Desmond Bane and Kyle Anderson had 16 points each. Bane’s 3-pointer with 1:19 remaining gave Memphis the lead for good.\n\n\r\n                    Jokic led the Nuggets with 34 points and 11 rebounds. Will Barton — who struggled Monday night against Memphis, going 1 for 8 from the field — had 26 points and seven assists and fueled a Denver push after a poor start.\n\n\r\n                    Barton said trailing by as many as 20 in the first half “was tough to overcome.”\n\n\r\n                    “That put us in a deep hole. We fought back, but we just didn’t have enough left to close it out,” Barton said.\n\n\r\n                    The game was tied at 104 with 2:46 left. Bane’s 3-pointer with 1:20 remaining gave Memphis the lead. Jokic scored inside to cut it to 107-106. Morant split a pair of free throws with 10.6 seconds to play for a 108-106 Grizzlies lead. Jokic's final shot didn't fall.\n\n\r\n                    “I will take that shot any day. I’m really comfortable taking that shot,” Jokic said. “I’m not doubting myself. It was a good shot.”\n\n\r\n                    The start was so bad for the Nuggets that coach Michael Malone called two timeouts in the first five minutes, the second to make an almost complete line change, taking out all of the starters except for Jokic.\n\n\r\n                    “It seems like every game, we have one part of the game where we are playing really bad,” Jokic said. “I don’t know what it is, but we need to figure it out.”\n\n\r\n                    For Memphis, the win down the stretch was a change from last season when the Grizzlies could squander away fourth-quarter leads and let games slip away. This year seems different.\n\n\r\n                    “I think it’s just experience really,” Anderson said. “We’ve been in those situations a lot of times last season, and then in big playoff games, big play-in games. … So, I think we’re a little more seasoned as a group. We’re more poised down the stretch.”\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Jokic went down holding his knee in the first quarter after a collision under the basket. It was the same knee that caused him to leave the Utah game last month after a collision with Rudy Gobert. He returned and finished the game. “It’s going to be a little bit sore,” Jokic said after the game, “but I think I’m going to survive.” … Have allowed 100 points in three games this season — all losses, two to Memphis and the other to Utah. \n\n\r\n                    Grizzlies: Morant had five assists in the first quarter, the 20th straight game he has had at least five assists in a game. … Rookie Ziaire Williams was 4 of 8, including 3 of 7 from outside the arc, for 11 points. \n\n\r\n                    PORTER’S SLUMP\n\n\r\n                    Michael Porter Jr. missed all three of his 3-pointers and is 1 for 18 from outside the arc over his past four game. But Nuggets coach Michael Malone said he is not worried about the poor start to the season. “I have no doubt that he’ll be able to shoot himself out of it as long as he’s taking the right shots,” Malone said, adding: “The constant message with Michael is don’t allow you not making shots to impact every other facet of your game. If you allow that, basically what you are saying is that you are just a specialist. All you can do is help this team with your shooting. And that’s not the case.”\n\n\r\n                    UP NEXT: \n\n\r\n                    Nuggets: Host Houston on Saturday night.\n\n\r\n                    Grizzlies: At Washington on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764993296.159294
}