{
  "game_id": "0021900402",
  "espn_id": "401161044",
  "date": "Dec 17, 2019",
  "matchup": "LAL @ IND",
  "headline": "Pacers rally late to snap Lakers' road winning streak at 14",
  "body": "INDIANAPOLIS --  Malcolm Brogdon saw an opening and took it Tuesday night.\n\nAnd just like that, the Los Angeles Lakers' long winning streak away from home was over.\n\nBrogdon drove past Dwight Howard with 36.4 seconds left, scoring the tiebreaking basket on a nifty reverse layup to help the Indiana Pacers protect their home court with a 105-102 victory over the NBA's best road team.\n\n\"We knew when we threw a punch, they would punch back,\" Domantas Sabonis said. \"We just stuck together.\"\n\nEventually, the Pacers threw enough scoring jabs to earn their fourth straight victory -- perhaps their most impressive all season.\n\nThe Lakers (24-4) came into the game with the league's best record and 14 straight wins on the road, the second-longest streak in franchise history and two wins short of their record-setting mark from 1971-72.\n\nBut even LeBron James couldn't bail them out with All-Star forward Anthony Davis missing the game because of a sprained right ankle.\n\nYes, James scored 20 points and had nine rebounds and nine assists, but he missed a step-back 3-pointer with 11.7 seconds left that would have given the Lakers the lead. A replay review overturned a call and gave the Pacers the ball.\n\nSabonis then made one of two free throws to finish with 26 points and 10 rebounds.\n\nRajon Rondo and Kentavious Caldwell-Pope each missed a shot before time expired as the Lakers desperately tried to force overtime.\n\n\"Throughout the winning streak, we were able to keep our composure, whether we were up or down, still being able to make a game of it, which we did tonight,\" James said. \"But sometimes the ball doesn't bounce your way.\"\n\nThat was certainly true Tuesday.\n\nAfter leading most of the first half, the Lakers trailed most of the second half until a 9-0 spurt midway through the fourth quarter turned a five-point deficit into a 95-91 lead.\n\nIt didn't last long.\n\nBrogdon's mid-range jumper with 2:20 left tied the score at 100. Myles Turner broke the tie by making two free throws with 1:59 left.\n\nNineteen seconds later, James' free throws tied it up again and that's how it stayed until Brogdon took matters into his own hands and charged right past Howard and deftly used the rim to protect the ball for the basket.\n\n\"We trust him with the ball in his hands and he's been making tough shots for us,\" Sabonis said. \"He's been big for us all year.\"\n\nTIP-INS\n\nLakers: James scored only seven points in the second half -- all in the fourth quarter -- and had five turnovers. ... Howard had a season-high 20 points. ... Avery Bradley had 13 points, Alex Caruso had 11 while JaVale McGee and Caldwell-Pope each scored 10. ... Rondo had seven points and seven assists. ... The Lakers were 8 of 31 on 3-pointers.\n\nPacers: Jeremy Lamb left in the second half with a sore right groin. ... Sabonis posted his 23rd double-double this season and had four assists ... Turner finished with 16 points and seven rebounds, while Brogdon had 14 points and six assists. ... T.J. Warren had 12 points, five rebounds and three blocks as Aaron Holiday and T.J. McConnell combined for 21 points off the bench. ... Indiana was 13 of 20 from the free throw line.\n\nSPEAKING FRANK-LY\n\nAs Pacers coach Nate McMillan scouted the Lakers game tape, he saw some familiar plays and heard some familiar language.\n\nThat shouldn't come as a surprise given his experience working alongside Lakers coach Frank Vogel for three seasons with Indiana.\n\n\"A lot of times, things travel with us,\" McMillan said. \"So they're doing some of the things he did when he was here, and they're doing some of the things he wanted to do when he was here.\"\n\nVogel hired McMillan as associate head coach in 2013. McMillan took over as the Pacers head coach when Vogel was let go after the 2016-17 season.\n\nTHEY SAID IT\n\nLakers: \"We wanted to get LeBron coming off a pin down from Dwight and we didn't execute the play very well,\" Rondo said when asked about his 29-footer in the waning seconds. \"I got a look that I wanted, it just went in and out.\"\n\nPacers: \"We're a really good team. We've got to come to play every night,\" Brogdon said. \"But we can compete. We can beat anybody.\"\n\nUP NEXT\n\nLakers: Hope to rebound Thursday night in Milwaukee, the final stop on a five-game road trip.\n\nPacers: Will complete a three-game homestand Friday against Sacramento.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996013.49384
}