{
  "game_id": "0022301171",
  "espn_id": "401585799",
  "date": "Apr 12, 2024",
  "matchup": "ORL @ PHI",
  "headline": "Joel Embiid returns from injury scare, scores 32 as 76ers beat Magic 125-113",
  "body": "PHILADELPHIA -- — Joel Embiid had 32 points, 13 rebounds and seven assists after an apparent injury scare in the first half and the Philadelphia 76ers beat the Orlando Magic 125-113 on Friday night in a critical game for Eastern Conference playoff seedings.\n\n\r\n              Tyrese Maxey scored 28 points and Kelly Oubre Jr. added 21 as Philadelphia (46-36) won its seventh straight game.\n\n\r\n              Orlando, Indiana and Philadelphia each have a record of 46-35 after the Pacers lost to the Cleveland Cavaliers 129-120 on Friday night and are in fifth, sixth and seventh places, respectively, in the conference.\n\n\r\n              Franz Wagner scored 24 points, Paolo Banchero had 22 and Jalen Suggs 20 for Orlando (46-35), which has lost three straight games.\n\n\r\n              “We just need one win and we're good,” Wagner said. “One more game and we have to focus on that one and get a win.”\n\n\r\n              The Magic struggled in the first quarter, trailing 40-27 and facing an uphill fight the rest of the way. The Magic closed within six in the fourth, but could never get over the hump.\n\n\r\n              “We have to start the games better,” Orlando head coach Jamahl Mosley said. “You can't give up 40 points in the first quarter and crawl your way out. The energy and effort was there on the back stretch, but you can't give 40 points and slow starts to get the game going and keep climbing up the hill all night.”\n\n\r\n              Embiid controlled the first half, posting 21 points, nine rebounds and seven assists in 17 minutes in his fifth game back after missing 29 games with a left meniscus injury. But, after driving to the lane for a layup in the final two minutes of the half, Embiid appeared to land awkwardly on his left knee. \n\n\r\n              While play continued, Embiid limped to midcourt and gave up on the play. After Philadelphia head coach Nick Nurse called timeout, Embiid went straight to the Sixers’ locker room. B\n\n\r\n              “We had to try to keep playing and finish off the half, which we did,” Maxey said. “We got back here (in the locker room) to see if he was alright, and it was a blessing. He was good to go.”\n\n\r\n              Embiid returned to the lineup and promptly hit a 3-pointer on his first touch of the second half.\n\n\r\n              “They assessed him at halftime and there was no swelling and no damage,” Philadelphia head coach Nick Nurse said. “None of that kind of stuff. He wanted to go out and to try it in the second half and he was fine.”\n\n\r\n              Embiid was not in the locker room when reporters arrived after the game.\n\n\r\n              Nurse said there would be a re-evaluation of Embiid before the club's practice on Saturday.\n\n\r\n              Maxey picked up some of the offensive slack for the Sixers in the second half, scoring 11 in the fourth quarter while Embiid spent most of the final session on the bench.\n\n\r\n              “I just told him that I got it,” Maxey said. “It was like the fourth quarter against the Heat (two weeks ago). When (Embiid) was out, it was bad of course. But it also was a blessing in disguise because it helped me grow up a little bit and to grow into this role.”\n\n\r\n              Philadelphia swept the three-game season series against Orlando. However, the Sixers would fall to the seventh seed and the play-in tournament if both the Magic (at home against Milwaukee) and Indiana (at home against Atlanta) win on Sunday. An Orlando victory would give the Magic the Southeast Division title because of the NBA’s tiebreaker system. Indiana beat the Sixers two out of three games this year.\n\n\r\n              Philadelphia closes out the regular season against Brooklyn on Sunday. \n\n\r\n              “I don’t think it will matter too much (what happens elsewhere),” Nurse said. “We’re still trying to condition some guys and keep the rhythm going.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: Hosts Bucks on Sunday in regular-season finale.\n\n\r\n              76ers: Hosts Brooklyn Sunday.\n\n\r\n              ----\n\n\r\n              AP NBA: https://apnews.com/hub/NBA\n\n\r\n              314 words",
  "source": "espn_api",
  "crawled_at": 1764995677.194655
}