{
  "game_id": "0022101183",
  "espn_id": "401361002",
  "date": "Apr 05, 2022",
  "matchup": "CHI vs. MIL",
  "headline": "Lopez scores 28, Bucks beat Bulls 127-106 to clinch Central",
  "body": "CHICAGO -- — Giannis Antetokounmpo didn't dominate the way he usually does. \n\n\r\n              That didn't stop the Bucks from clinching yet another division championship and making it look easy in the process.\n\n\r\n              Brook Lopez scored a season-high 28 points and Milwaukee overcame a rather quiet performance from Antetokounmpo to secure its fourth straight Central Division title with a 127-106 victory over the Chicago Bulls on Tuesday night.\n\n\r\n              The defending NBA champion Bucks haven’t been on a run like this since Don Nelson’s teams won seven consecutive division titles in the 1980s. They took control early and came away with an easy win even though DeMar DeRozan scored 40 for Chicago.\n\n\r\n              “You should probably take a quick minute just to appreciate (it),” coach Mike Budenholzer said. “Winning anything in this league is hard. We talk about it all the time in film sessions and practices, how hard it is to win a game. To win a division means something.”\n\n\r\n              Antetokounmpo, trying to overtake LeBron James and Joel Embiid in a tight race for his first scoring title, finished with 18 points, nine rebounds and seven assists. But the two-time MVP started slow and spent most of the fourth quarter on the bench after picking up his fifth foul.\n\n\r\n              Lopez had his best performance after missing most of the season because of a back injury. Khris Middleton scored 19 points.\n\n\r\n              “For me, it's just continuing to find that rhythm and get more in sync with everyone,” said Lopez, who missed 67 games because of the injury. “Going out there playing hard, trying to do what you can and kind of pushing yourself to the limit — make yourself work. So come playoff time you have that confidence to go out there and do whatever you need to do.”\n\n\r\n              Grayson Allen and Bobby Portis added 13 points apiece as the Bucks completed a four-game season sweep of the Bulls.\n\n\r\n              Chicago clinched its first playoff appearance since 2017 with Cleveland losing to Orlando. The Bulls are sixth in the Eastern Conference, a game behind Toronto with three to play. \n\n\r\n              “For us to make the jump that we made, to be in a position to be able to compete in the playoffs, is definitely great,” DeRozan said. “It gives us an opportunity to further our season and play for something bigger.” \n\n\r\n              DeRozan did all he could to carry Chicago, with two-time All-Star Zach LaVine sidelined because of ongoing soreness in his left knee.\n\n\r\n              Patrick Williams added 18 points. Nikola Vucevic struggled, going 3 of 19 and scoring seven points. He did draw loud cheers when he knocked Allen to the floor early in the fourth quarter, delighting fans angry about Allen's hard foul earlier this season on Chicago’s Alex Caruso that resulted in a broken wrist.\n\n\r\n              But the Bulls once again lost to an elite opponent. They are a combined 2-20 against the top four teams in the East and West.\n\n\r\n              Vucevic hit a corner 3-pointer for Chicago just before the halftime buzzer and DeRozan made a jumper in the opening seconds of the third to cut it to 58-48.\n\n\r\n              Milwaukee regrouped and pushed the lead to 21, only to have the Bulls get within 10 again late in the third. Two free throws by Antetokounmpo in the closing minute of the quarter and a 3 from the top by Jrue Holiday made it 96-80 before DeRozan hit jumper to cut the margin to 14 heading to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Though Budenholzer took issue with Vucevic's takedown, saying it “crossed a line,\" Allen shrugged it off. “I think he was trying to make a play on the ball,” he said. Vucevic, who got a dead-ball technical, insisted he was simply swiping at the ball and wasn't trying to deliver a hard foul on Allen.\n\n\r\n              Bulls: PG Lonzo Ball experienced another setback in his recovery from surgery for a torn meniscus in his left knee, raising more doubt about whether he will play again this season. Ball felt some discomfort after he tried to ramp up activities again following a 10-day pause, coach Billy Donovan said. Donovan said the next step will probably be a “meeting of the minds” in the next day or two. And the possibility of Ball missing the remainder of the season is “on the table.” Ball has not played since Jan. 14. ... Donovan said he didn't necessarily get the sense that LaVine will need to miss a chunk of games, though his status for Wednesday's matchup with Boston was in question.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host the Boston Celtics on Thursday.\n\n\r\n              Bulls: Host the Celtics on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992937.120943
}