{
  "game_id": "0022400098",
  "espn_id": "401704664",
  "date": "Oct 27, 2024",
  "matchup": "MIL @ BKN",
  "headline": "Thomas scores 32, Nets beat Bucks 115-102 in home opener for first win under Jordi Fernandez",
  "body": "NEW YORK -- — Cam Thomas scored 32 points, Dennis Schroder added 29 and the Brooklyn Nets beat the Milwaukee Bucks 115-102 on Sunday in their home opener to give coach Jordi Fernandez his first victory.\n\n\r\n              The Nets pulled away in the fourth quarter after opening with two road losses in their first season under Fernandez, a native of Badalona, Spain.\n\n\r\n              Thomas scored 11 in the final period to surpass the 30 points he had averaged in the first two games.\n\n\r\n              Giannis Antetokounmpo had 22 points and 12 rebounds for the Bucks, who have dropped two straight after winning their opener. Damian Lillard scored 21 points and Bobby Portis Jr. had 16 points and 10 boards. \n\n\r\n              Takeaways \r\n              Bucks: Milwaukee can't be fully evaluated until Khris Middleton is back from ankle surgery. Coach Doc Rivers said the longtime starter is getting closer and could take another step with a good practice this week. But he won't solve the perimeter defense problems for a team that gave up 35 points to Chicago's Coby White on Friday before getting burned by Thomas and Schroder on Sunday.\n\n\r\n              Nets: Thomas has the green light and can get on hot streaks and Schroder is a feisty competitor, and even a team without a ton of talent in a rebuilding season can be tough when both have it going. \n\n\r\n              Key moment \r\n              The Nets led just 89-85 with 9 minutes remaining in a game in which neither team had yet built a double-digit lead. Thomas and Schroder them combined for the next 10 points, with Thomas' three-point play giving Brooklyn a 99-85 advantage with 7:04 remaining. \n\n\r\n              Key stat \r\n              Antetokounmpo has made 30 of 45 shots this season (66.7%).\n\n\r\n              Up next \r\n              The Bucks visit unbeaten Boston on Monday in the second half of a back-to-back. The Nets host Denver on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997863.4585412
}