{
  "game_id": "0021501133",
  "espn_id": "400829020",
  "date": "Apr 01, 2016",
  "matchup": "MIL vs. ORL",
  "headline": "Parker's driving layup carries Bucks past Magic 113-110",
  "body": "MILWAUKEE --  Jabari Parker didn't hesitate with the game on the line.\n\nHis driving hook shot with less than 11 seconds left and Tyler Ennis' two free throws sealed the Milwaukee Bucks' 113-110 win over the Orlando Magic on Friday night.\n\nParker finished with 26 points on 12-of-14 shooting, Giannis Antetokounmpo had a triple-double with 18 points, 11 rebounds and 11 assists, and Greg Monroe and Khris Middleton each added 18 points as the Bucks snapped the Magic's three-game winning streak.\n\n\"I was just trying to make the right play,\" Parker said. \"I figured that everybody was in the paint. I had the outside advantage.\"\n\nAntetokounmpo missed a jumper and Monroe grabbed the rebound, but was quickly tied up by Evan Fournier for a jump ball. Monroe -- 4 inches taller than the 6-foot-7 Fournier -- easily won the tip and the ball ended up in Parker's hands.\n\n\"We'll see some of his finishes tonight on the highlight film,\" Bucks coach Jason Kidd said.\n\nThe Magic's 7-foot Nikola Vucevic even contested Parker's winning shot, but to no avail.\n\n\"He made a good move,\" Vucevic said. \"I tried to stay with him, but he got me with the up-and-under. I was trying to stay in front of him and make him shoot a tough shot, but he got me with the extra step. He beat me with it.\"\n\nEnnis made the sixth lead change of the fourth stand with his two free throws with 3.8 seconds left.\n\n\"Tyler's not going to panic,\" Kidd said. \"He's a guy, no matter what the score, he's always calm. He's a point guard that is always under control. His teammates trust him.\"\n\nFournier's desperation heave from behind the arc missed.\n\nVucevic scored 22 points on 10-of-13 shooting and Victor Oladipo added 18 for the Magic.\n\nElfrid Payton's layup made it 109-108 with 47.1 seconds left, but Ennis made one of two free throws to tie the game. Monroe fouled Vucevic as the two battled for position, and Vucevic made the first, but missed the second free throw to put Orlando up 110-109 -- setting up Parker's big shot.\n\n\"We weren't able to get stops,\" Magic coach Scott Skiles said. \"When you have a lead like that, obviously, if you shut them out the rest of the game, they can't win.\"\n\nOladipo's 3 gave the Magic a six-point lead, their biggest of the game, with 6:17 to play, but Miles Plumlee took a perfect pass from Parker and scored as the Bucks continued to battle back.\n\n\"We were up six, and we turned the ball over twice in a row,\" Vucevic said.\n\nIt was a tough night for former Buck Brandon Jennings who had consecutive miscues that prevented the Magic from a chance at padding their lead. Orlando had 20 turnovers in the game.\n\nVucevic scored 11 points in the second quarter, Oladipo added nine and the Magic erased a 13-point deficit with a 23-11 surge that pulled them to 58-57 at the half.\n\nThe Magic came in riding a three-game winning streak, with all three coming by 20-plus points.\n\nSTREAKING\n\nMilwaukee has won seven of its last eight games against Orlando at the BMO Harris Bradley Center. The Bucks also won the season series (2-1).\n\nTIP-INS\n\nMagic: Oladipo tied his season high with five steals. ... Orlando shot 53.2 percent (25-47) in the first half and 53.5 percent (46-86) for the game. ... The Magic shot 8 for 24 (33.3 percent) from behind the arc. ... Fournier and Aaron Gordon each had 14 points.\n\nBucks: Milwaukee had a season-high 70 points in the paint. ... G Rashad Vaughn made his first start in 63 games. He's averaged 6.5 points in 24 minutes in two the games since his return from the Canton Charge of the NBA D-League. ... G Jerryd Bayless hyperextended his right knee in Wednesday's game against Phoenix. \"Hopefully, we'll know in a couple of days if he's going to be able to return or if he's out for the rest of the season,\" Kidd said.",
  "source": "espn_api",
  "crawled_at": 1764994000.5096378
}