{
  "game_id": "401810168",
  "espn_id": "401810168",
  "date": "Dec 01, 2025",
  "matchup": "MIA vs LAC",
  "headline": "Heat use 30-2 run to pull away, tie franchise record with 24 3-pointers, roll past Clippers 140-123",
  "body": "MIAMI -- — Norman Powell scored 30 points against his former team, Bam Adebayo had 27 points and 14 rebounds in 32 minutes and the Miami Heat downed the reeling Los Angeles Clippers 140-123 on Monday night.\n\n\r\n              Tyler Herro and Andrew Wiggins each scored 22 for the Heat, who trailed by two early in the second quarter before going on a 30-2 run. Miami also hit 24 3-pointers, tying a franchise record done on two previous occasions.\n\n\r\n              Miami went on a 12-0 run in the first 2:02 of the third quarter, all on 3-pointers, two of them by Adebayo. That turned a 20-point halftime lead into a 32-point edge and the outcome was not in serious doubt again.\n\n\r\n              Kawhi Leonard scored 36 and Ivica Zubac finished with 16 points and 13 rebounds for the Clippers. They started the season 3-2 and have gone 2-14 since, falling to 5-16 — the worst 21-game start for the franchise since a 4-17 beginning to the 2010-11 season.\n\n\r\n              James Harden scored 11 points for the Clippers in 20 minutes, and didn't play in the final 22:34. The Clippers were outscored by 39 points when he was on the floor.\n\n\r\n              Powell had 11 points in the 30-2 spurt, one where Miami shot 9 for 12 while the Clippers missed all 11 of their shots. Back-to-back 3s by Powell finished off the run.\n\n\r\n              The Clippers made things a bit interesting in the fourth, with Leonard scoring 19 points in that quarter and getting his team within 12 with 2 minutes left. But Miami scored the next nine points — a three-point play by Herro, then 3-pointers from Powell and Wiggins to put the game away.\n\n\r\n              It was Miami's fifth time reaching the 140-point mark this season, after getting there a total of eight times in the franchise's first 37 seasons. \n\n\r\n              Up next\r\n              Clippers: Visit Atlanta on Wednesday.\n\n\r\n              Heat: Visit Dallas on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042731.32023
}