{
  "game_id": "0022000143",
  "espn_id": "401267303",
  "date": "Jan 10, 2021",
  "matchup": "BKN vs. OKC",
  "headline": "OKC burns the Nets behind Gilgeous-Alexander, five others.",
  "body": "NEW YORK -- — Shai Gilgeous-Alexander scored 31 points to lead the Oklahoma City Thunder to a 129-116 win over the Brooklyn Nets on Sunday. \n\n\r\n                    Gilgeous-Alexander was one of six players to finish in double-figure scoring for the Thunder, who won their third straight and beat Brooklyn for the fifth consecutive time. \n\n\r\n                    “It’s been a great road trip,” said Hamidou Diallo, who finished with 25 points, \n\n\r\n                    Al Horford had 22, George Hill added 14, and Lugentz Dort and Isaiah Roby had 13 each.\n\n\r\n                    Whereas the Thunder left Barclays Center feeling good about themselves, Brooklyn's first-year coach Steve Nash had the opposite feeling about his team's play. \n\n\r\n                    “I didn't sense the pride. I didn't sense the competitive fire in the second half,” Nash said of the Nets.\n\n\r\n                    Kevin Durant scored 36 points to lead Brooklyn. The loss was the second straight for the Nets. Caris LeVert added 21 points, Jarrett Allen had 15 points and 10 rebounds, and Timothe Luwawu-Cabarrot scored 12. \n\n\r\n                    “We (have) to toughen up and show a little more pride,” Nash said.\n\n\r\n                    Making the loss harder to digest was the Nets had gotten Durant back after he had sat out Brooklyn’s previous three games — a stretch in which they won two of three — due to the league’s quarantine policy after being exposed to COVID-19. \n\n\r\n                    “COVID put us under these circumstances and a lot of guys around the league are under protocol, so it was something we knew coming into the season may happen,” Durant said. “I'm glad I'm back playing, (though).”\n\n\r\n                    Midway through the third quarter, Durant drove past Darius Bazley and flipped in a layup as he drew a foul. As Durant strolled to the free-throw line, a frustrated Bazely disgustedly fired the ball off the stanchion.\n\n\r\n                    The three-point play gave Brooklyn a 74-69 lead. It didn’t last, as Oklahoma City went on a 25-7 run to finish the quarter with a 94-81 advantage. The Thunder kept the pressure on in the fourth, as they opened the quarter with a Diallo dunk and a 17-foot jumper sandwiched around a 3-pointer from Theo Maledon.\n\n\r\n                    “We have a team that’s really well-intentioned,” Thunder coach Mark Daigneault said. “We want to run through the finish line.”\n\n\r\n                    TIP-INS:\n\n\r\n                    Nets: Despite the return of Durant, Brooklyn was not at full strength as Kyrie Irving missed his third straight game due to an undisclosed issue which is believed to be the guard’s distress over the insurrection at the Capitol on Wednesday. During his pregame availability, Nash said Irving and the team have been in communication but declined to offer specifics, saying the talks are “a private matter.” Irving had started Brooklyn’s first seven games, averaging 27.1 , 6.1 assists, and 5.3 rebounds. “I don’t worry about (Irving) falling out of rhythm,” Nash said. “He’s a brilliant basketball player.”\n\n\r\n                    Thunder: Oklahoma City was coming off of a 101-89 rout of the New York Knicks on Friday night at Madison Square Garden. Entering Sunday night’s game, opponents were outscoring the Thunder by an average of 6.1 points per game, while Brooklyn ranked third in the league in scoring with an average of 118.8 points per game. “Tactically,” rookie forward Aleksej Pokusevski said during his pregame availability, “we have to be there.” They were as the Thunder limited Brooklyn to seven second chance points and nine fast break points.\n\n\r\n                    UP NEXT:\n\n\r\n                    Thunder: Begin a four game homestand Tuesday night against San Antonio.\n\n\r\n                    Nets: Hosts Denver on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764997521.23151
}