{
  "game_id": "0022400011",
  "espn_id": "401703380",
  "date": "Nov 15, 2024",
  "matchup": "TOR vs. DET",
  "headline": "Pistons beat Raptors 99-95 to remain undefeated in NBA Cup play",
  "body": "TORONTO -- — Malik Beasley scored seven of his 20 points in the fourth quarter, Cade Cunningham had 15 points and 10 assists and the Detroit Pistons beat the struggling Toronto Raptors 99-95 on Friday night.\n\n\r\n              Tobias Harris had 11 points and 11 rebounds, Jaden Ivey scored 14 points and Jalen Duren added 12 for the Pistons. Rookie Ron Holland had 10 points and eight rebounds for Detroit but missed all six of his 3-point attempts.\n\n\r\n              Detroit won despite shooting 8 for 38 from 3-point range. The Raptors weren't much better and shot 8 for 31 from distance.\n\n\r\n              Jakob Poeltl had a season-high 25 points and matched his career-high with 19 rebounds, but the Raptors lost their sixth straight. \n\n\r\n              RJ Barrett scored 22 points and Gradey Dick, who shot 1 for 10 from 3, added 16 for Toronto, which has lost 10 of 11.\n\n\r\n              Takeaways\r\n              Pistons: After going winless in NBA Cup play last season, Detroit is 2-0 in the tournament after an overtime victory against Miami on Tuesday. \n\n\r\n              Raptors: Toronto dropped to 0-8 this season when trailing at the half.\n\n\r\n              Key moment\r\n              Dick missed a pair of 3-point attempts in the final 21 seconds. The first would have given Toronto a one-point edge and the second would have tied the score.\n\n\r\n              Key stat\r\n              Cunningham shot 4 for 18 through three quarters but went 2 of 3 in the fourth, including one of his two 3-pointers. He went 2 for 9 from deep.\n\n\r\n              Up next\r\n              Toronto is at Boston on Saturday, while Detroit visits Washington on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996994.893965
}