{
  "game_id": "0022300726",
  "espn_id": "401585354",
  "date": "Feb 07, 2024",
  "matchup": "TOR @ CHA",
  "headline": "Raptors overcome 45-point game from Miles Bridges to beat Hornets 123-117",
  "body": "CHARLOTTE, N.C. -- — RJ Barrett scored 23 points, Jakob Poeltl had two big plays in the final 90 seconds and the Toronto Raptors overcame a career-high 45 points from Miles Bridges to beat Charlotte 123-117 and hand the Hornets their ninth straight loss on Wednesday night.\n\n\r\n              Scottie Barnes, who learned before the game he'll play in his first All-Star game as an alternate, finished with 18 points for the Raptors. Immanuel Quickley also scored 18, and Poeltl chipped in 12 points and 12 rebounds.\n\n\r\n              The Raptors (18-33) closed a six-game road trip with a 2-4 record.\n\n\r\n              “It was the little things — two games where one if we get a rebound, we win,\" Barrett said. \"In another, if I just hold the ball, we win. It’s the little things like that. We played hard-fought games in four out of the six games, so we are just learning that every little thing matters in a game.”\n\n\r\n              Bridges had a highly efficient shooting night, topping his previous career high of 41 points set Monday night against the Los Angeles Lakers by making 17 of 27 from the field, including 6 of 10 from beyond the arc. He also had eight rebounds and seven assists.\n\n\r\n              Bridges is only the fourth Charlotte player to record back-to-back 40-point games, joining Glen Rice (twice), Kemba Walker and Terry Rozier.\n\n\r\n              Now Bridges, who has been the subject of rampant trade rumors, will await word on whether he's played his final game for the Hornets. The NBA trade deadline is Thursday afternoon.\n\n\r\n              “I can just control what I can control,” Bridges said.\n\n\r\n              Bridges reiterated that he'd prefer to remain in Charlotte, saying, “my answer doesn't change. I would love to be here. I got drafted here and they stuck with me through my lowest times, so I sure want to be here.”\n\n\r\n              In November 2022, Bridges pleaded no contest to one felony charge of injuring a child's parent. Bridges also has a court date later this month in Charlotte to answer charges of violating a domestic violence protection order, misdemeanor child abuse and injury to personal properties.\n\n\r\n              Hornets coach Steve Clifford offered no insight on the team's plans but praised Bridges for his effort all season calling it “remarkable.”\n\n\r\n              “Listen, this guy has played 38 or 39 minutes every night,” Clifford said. “He plays the whole first quarter, the whole third quarter and he never asks to come out. He plays every dribble and there just aren't many guys who can do what he's doing.”\n\n\r\n              Brandon Miller had 20 points for Charlotte, which has lost eight straight games at home.\n\n\r\n              The Hornets bolted to a 36-29 lead after the first quarter behind 15 points from Bridges, who was 5 of 5 from the field including three 3-pointers. Bridges was even better in the third quarter with 21 points on 9-of-10 shooting, helping the Hornets carry a 97-91 lead into the final quarter.\n\n\r\n              But Toronto would battle back to take for good on Barrett 3 from the corner and a driving layup by Quickley with two minutes left giving the a 118-115 lead.\n\n\r\n              Poeltl, the Raptors 7-foot-1 center from Austria, then came up with big plays on both ends of the court, tipping in a Quickley miss to make it a two-possession game and blocking Bridges in the lane on the other end of the court to give his team back the ball.\n\n\r\n              “Jakob was huge there the last couple of possessions, blocking shots, protecting the rim and securing rebounds,” Raptors coach Darko Rajaković said. \n\n\r\n              The Raptors made 17 of 33 3-point attempts, with Barrett and Gary Trent Jr. each connecting on four.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host the Rockets on Friday night.\n\n\r\n              Hornets: Visit the Bucks on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995816.4202151
}