{
  "game_id": "401810031",
  "espn_id": "401810031",
  "date": "Nov 05, 2025",
  "matchup": "MEM vs HOU",
  "headline": "Thompson scores 28 points as Rockets beat Grizzlies 124-109",
  "body": "MEMPHIS, Tenn. -- — Amen Thompson had 28 points and 10 rebounds, Alperen Sengun added 20 points and 16 rebounds, and the Houston Rockets defeated the Memphis Grizzlies 124-109 on Wednesday night.\n\n\r\n              Jabari Smith Jr. and Tari Eason scored 16 apiece as Houston won its fifth straight game. Thompson and Sengun each had seven assists.\n\n\r\n              Cam Spencer led Memphis with 19 points, including 5-of-9 shooting from 3-point range. Ja Morant had 17 points and eight assists, but he was 6 of 19 from the field and made only one of his seven 3-point attempts. Santi Aldama scored 16.\n\n\r\n              Houston built a significant lead in the first half and kept the pressure on with a 24-9 run midway through the third quarter. That extended the margin to 21 points, and Memphis only got it to single digits briefly in the early stages of the fourth.\n\n\r\n              Memphis has lost four straight and is struggling to find its identity under first-year coach Tuomas Iisalo. The Grizzlies have also dealt with injuries to starting center Zach Edey and bench players like Scotty Pippen Jr. and Ty Jerome.\n\n\r\n              As has become a common theme to Memphis starts, the Grizzlies shot poorly in the first quarter and were getting beat to loose balls and rebounds. Memphis was stuck at about 25% in the period, while Houston was hitting at a 56% clip, building an early double-digit advantage.\n\n\r\n              Memphis' shooting improved some in the second, but Houston was still at better than 50% to carry a 60-51 into halftime, partially because of 10 Grizzlies turnovers leading to 17 Rockets points.\n\n\r\n              Houston kept up its strong shooting through the third, with Josh Okogie scoring 11 points.\n\n\r\n              Up next\r\n              Rockets: Continue their three-game trip Friday night at San Antonio.\n\n\r\n              Grizzlies: Host the Dallas Mavericks on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042567.840257
}