{
  "game_id": "0022400926",
  "espn_id": "401705492",
  "date": "Mar 09, 2025",
  "matchup": "POR vs. DET",
  "headline": "Cade Cunningham's 28 points help Pistons beat Trail Blazers 119-117",
  "body": "PORTLAND, Ore. -- — Cade Cunningham scored 28 points, Tobias Harris added 20 points on 9-of-13 shooting and the Detroit Pistons defeated the Portland Trail Blazers 119-112 on Sunday night. \n\n\r\n              Jalen Duren finished with 18 points and 12 rebounds for Detroit (36-29). \n\n\r\n              The Pistons took the lead for good when Isaiah Stewart scored inside to make it 33-32 early in the second quarter and Cunningham made a layup that pushed Detroit's lead to 92-74 with 3:08 remaining in the third. \n\n\r\n              Anfernee Simons led Portland (28-37) with 34 points on 14-of-26 shooting and Jerami Grant scored 25. Scoot Henderson added 15 points and Shaedon Sharpe scored 12 but the young duo combined to made 8 of 25 from the field, 1 of 11 from behind the arc. \n\n\r\n              Takeaways\r\n              Pistons: Detroit gave away most of an 18-point second-half lead but showed resolve down the stretch to hold off the Blazers in the second of back-to-back games and the last of a four-game road trip.\n\n\r\n              Trail Blazers: Portland made 15 3-pointers but shot just 30% from behind the arc and 39% overall. \n\n\r\n              Key moment\r\n              After Portland's Duop Reath hit a 3-pointer to cap a 13-6 run, Dennis Schroder made a running floater with about 2 minutes left to give Portland a 113-108 lead. \n\n\r\n              Key stat\r\n              There were 51 total fouls called and the teams combined to shoot 64 free throws (32 each) — an average of 1.3 free-throw attempts per minute. \n\n\r\n              Up next\r\n              The Pistons play the first of two home games against the Washington Wizards in a three-day span on Tuesday. Portland hits the road to play the Golden State Warriors on Monday.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998164.295512
}