{
  "game_id": "0022300346",
  "espn_id": "401584974",
  "date": "Dec 17, 2023",
  "matchup": "HOU @ MIL",
  "headline": "Antetokounmpo passes Abdul-Jabbar for Bucks' career rebounding record in victory over Rockets",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 26 points and 17 rebounds, passing Kareem Abdul-Jabbar to become the Bucks' career rebounding leader, and Damian Lillard scored 39 points in Milwaukee's 128-119 victory over the Houston Rockets on Sunday night. \n\n\r\n              Antetokounmpo's highest rebounding total of the season allowed him to pass Abdul-Jabbar after he had moved past the Hall of Famer for the team's scoring record during the 2021-22 season. He is also the Bucks' career leader in assists, joining Michael Jordan (Chicago), LeBron James (Cleveland) and Kevin Garnett (Minnesota) as the only players to lead a franchise in all three categories. \n\n\r\n              “It's a big compliment,” Antetokounmpo said. “I don't think anybody assumed that the skinny kid from Greece that was drafted and supposed to play in the G-League would be in position to break Kareem Abdul-Jabbar's record. I know for sure there's going to be someone who is going to come along in time and break all of the records that Kareem set, Oscar Robertson, Marques Johnson, myself, Khris (Middleton).”\n\n\r\n              The Bucks won their 13th straight home game and improved to 14-1 at home while snapping the Rockets' five-game winning streak. Houston (13-10) dropped to 2-9 on the road.\n\n\r\n              Middleton scored 14 of his 20 points in the fourth quarter as the Bucks finally pulled away. Middleton sank a 3-pointer to give the Bucks a 112-106 lead with 5:26 left, and a three-point play by Antetokounmpo made it 118-111 with 3:44 remaining.\n\n\r\n              “Khris does this all the time, where he just settles us down where we need a basket and he goes and gets us a bucket,” Bucks coach Adrian Griffin said. “Sometimes he scores and sometimes it’s an assist, but the fourth quarter is usually when Khris is at his best.”\n\n\r\n              Brook Lopez added 18 points for the Bucks (19-7) and Bobby Portis had 11 off the bench.\n\n\r\n              Middleton, who joined the Bucks in a trade in 2013, the same year Antetokounmpo was drafted, laughed when asked if he thought then that his teammate would have all these franchise marks.\n\n\r\n              “Hell, no,” Middleton said. “It's great. Now he's got everything, except for the 3-ball. He hates when people say that. But it just shows his discipline every day, how seriously he takes his craft and how he's never satisfied about what he's doing out there.”\n\n\r\n              Dillon Brooks was ejected after being called for flopping and picking up two technical fouls with 38 seconds left, and Rockets coach Ime Udoka also was whistled for two technicals after coming out on the court. Lillard made 3 of 4 free throws after the techs to tie his season-high scoring total. He also had 11 assists and five rebounds in 37 minutes.\n\n\r\n              The Bucks won the second of a back-to-back set and improved to 9-0 when Lillard scores 30 or more points.\n\n\r\n              “In my head I was like, sometime in December I'll start to feel better,” Lillard said, “even though I knew it was a process being on a new team and everything.”\n\n\r\n              Fred VanVleet led the Rockets with 22 points and center Alperen Sengun had 20. Brooks added 18 and Jabari Smith Jr. and Jalen Green each scored 16.\n\n\r\n              Antetokounmpo broke Abdul-Jabbar's record with a rebound of Tari Eason's missed shot with 7:46 left in the fourth quarter. It was his 14th rebound of the game and he added three more to give him 17,165 rebounds in his 11th season with Milwaukee.\n\n\r\n              The Bucks showed a video of his career rebounding highlights at the next timeout and Antetokounmpo received a huge ovation from the Fiserv Forum crowd.\n\n\r\n              Brooks had a basket taken away on a review when it was determined he committed an offensive foul, using his right elbow to inadvertently strike Pat Connaughton in the face. \n\n\r\n              The Bucks led by as many as 14 points late in the third quarter before Jeff Green sank a 3-pointer and two free throws, cutting the Rockets' deficit to 100-91 entering the final period.\n\n\r\n              Lillard got off to a fast start, scoring 15 points and adding five assists in the first quarter as the Bucks jumped out to a 33-28 lead. Lillard was 5 for 6 from the field and 2 of 3 from 3-point range.\n\n\r\n              Rookie guard Andre Jackson gave the Bucks a boost midway through the second quarter, tipping in a miss and scoring on a fast-break layup on consecutive possessions as Milwaukee took a 52-43 lead. He later added a corner 3-pointer and finished with nine points in the half.\n\n\r\n              Milwaukee led 71-60 at halftime despite allowing 58.5% shooting by the Rockets. Lillard had 20 points and Antetokounmpo added 17 points and eight rebounds.\n\n\r\n              The Bucks played without guard Malik Beasley, who missed his second straight game with a non-Covid illness.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host San Antonio on Tuesday.\n\n\r\n              Rockets: At Cleveland on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995621.6908731
}