{
  "game_id": "0022300873",
  "espn_id": "401585501",
  "date": "Mar 03, 2024",
  "matchup": "MIN vs. LAC",
  "headline": "Kawhi Leonard scores 32 points, Clippers edge Timberwolves 89-88 in physical, defensive game",
  "body": "MINNEAPOLIS -- — Kawhi Leonard had 32 points and the Los Angeles Clippers beat the Minnesota Timberwolves 89-88 on Sunday in a physical and defensive game between two of the top four teams in the Western Conference.\n\n\r\n              Norman Powell matched a season high with 24 points, and Paul George added 15 points but shot just 5 of 16 from the field and was 3 of 11 from 3-point range.\n\n\r\n              “This was an old-school, 1985 game,” Los Angeles coach Tyronn Lue said. “But I loved the way we kept competing and kept guarding, defending.”\n\n\r\n              The Clippers played without Russell Westbrook after he fractured his left hand in a home victory over Washington on Friday night. Ivica Zubac returned after missing two games with an illness.\n\n\r\n              Anthony Edwards scored 27 points for Minnesota, which dropped a half-game behind Oklahoma City for the West lead when the Thunder won at Phoenix later Sunday. The Timberwolves lost back-to-back games for just the third time this season.\n\n\r\n              “It was a very physical game,” said Minnesota's Rudy Gobert, who had 12 points and 16 rebounds. “I thought there was a lot of touching, grabbing, just like a playoff game. I thought we started the game the right way. I think, over time, it was hard for us to get what we wanted.”\n\n\r\n              Leonard broke an 84-all tie with a layup with 2:01 remaining and added a free throw after being fouled by Karl-Anthony Towns.\n\n\r\n              Towns’ dunk with 1:40 left brought Minnesota within one, but Anthony Edwards missed a 3 and Towns was off the mark on a jumper before Leonard closed out the game with a pair of free throws.\n\n\r\n              Minnesota had one more possession but couldn't find an open 3 and Edwards ended up driving for a layup. But the Wolves couldn't foul on the inbound pass as time ran out.\n\n\r\n              “It was a tough game, neither team shoots over 40% from the field, but that’s on me,” Minnesota coach Chris Finch said. “I got to take a timeout, get us organized on that second-to-last possession we had there. It’s a hard-fought game. Just didn’t make enough shots.”\n\n\r\n              The Timberwolves had won four games in a row in the matchup with Los Angeles, including the first two games this season.\n\n\r\n              “We just had to stay in it, stay with it,\" George said. \"Shots weren’t falling for both sides. I thought we just stayed in and played a full 48 minutes. We weren’t making shots. Only other thing we could have done is made it tough for them to make shots.”\n\n\r\n              Towns had 18 points, nine rebounds and eight assists.\n\n\r\n              Minnesota shot 38.8% and had 15 turnovers, leading to 20 points for the Clippers. Los Angeles shot 37.6% but had just nine turnovers, including six over the final three quarters. Partially as a result, the Clippers held a 19-0 advantage in fast-break points.\n\n\r\n              James Harden had 10 assists for Los Angeles but was 0-for-10 shooting.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Milwaukee on Monday night.\n\n\r\n              Timberwolves: Host Portland on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764996462.274178
}