{
  "game_id": "0021900191",
  "espn_id": "401160833",
  "date": "Nov 18, 2019",
  "matchup": "TOR vs. CHA",
  "headline": "Anonoby scores career-high 24, Raptors beat Hornets 132-96",
  "body": "TORONTO --  Raptors forward OG Anunoby put up an eye-catching line before catching an elbow to his right eye.\n\nAfter escaping serious injury for the second time in four games, Anunoby said he's considering playing with more protection moving forward.\n\nAnunoby scored a career-high 24 points before being jabbed in the eye, Pascal Siakam had 20 and Toronto beat Charlotte 132-96 Monday night, snapping a two-game losing streak against the Hornets.\n\nNorman Powell scored 17 points, rookie Terence Davis got all of his career-high 16 in the fourth quarter and Rondae Hollis-Jefferson added 15 as the Raptors posted their biggest margin of victory of the season and remained unbeaten in five home games.\n\nAnunoby made 6 of 7 attempts in the third, including 4 of 5 from 3-point range. Toronto coach Nick Nurse said Anunoby \"jump-started\" the Raptors by scoring 16 points in the quarter before getting poked in the right eye by Charlotte's Nicolas Batum while defending a drive to the basket.\n\nAnunoby sat out Wednesday's win at Portland after being struck in the eye by former teammate Kawhi Leonard during the first quarter of a road loss to the Clippers two days earlier.\n\n\"I wish they'd catch the guy who does it once in a while,\" Nurse said, upset that Anunoby did not get a foul call on either play. \"That's two games he's been hit in the head and nobody sees anything.\"\n\nAnunoby returned to start Saturday's loss at Dallas, scoring eight points in 32 minutes.\n\nAnunoby went to the locker room for treatment after being poked by Batum, returning to the bench early in the fourth. The Raptors said Anunoby was available to play again, but he sat out the rest of the game as Toronto maintained a comfortable lead.\n\nAs they watched the fourth together, Hollis-Jefferson suggested Anunoby try the mask made famous by a villain from the Batman movie series.\n\n\"We were joking about that on the bench towards the end of the game like `Hey dude, you're going to have to wear the Bane mask pretty soon just to keep people out of your eyes,\" Hollis-Jefferson said.\n\nAnunoby said he'll experiment with a different form of eye protection at Tuesday's practice and might wear something for Wednesday's game against Orlando.\n\n\"If it's what's best, I'll wear them, but we'll see,\" Anunoby said when asked about donning protective goggles.\n\nLast October 19, Anunoby wore goggles for one quarter of a game against Boston two days after leaving a win over Cleveland because of a right orbital contusion.\n\nMarvin Williams scored 14 points, Bismack Biyombo and MIles Bridges each had 13 and Devonte' Graham 11 as Charlotte allowed its highest point total of the season and lost for the fifth time in seven.\n\nCharlotte finished with 20 turnovers, one shy of its season-worst mark. The Hornets allowed 39 points off turnovers.\n\n\"We couldn't find any traction offensively and then we turned it over,\" Charlotte coach James Borrego said.\n\nToronto outscored Charlotte 32-18 in the third, when the Raptors made seven of 12 attempts from 3-point range.\n\nAnunoby's 16 points in the third was two shy of Charlotte's team total.\n\n\"They came out and asserted themselves,\" Williams said of the Raptors. \"They imposed their will on us and we were never able to recover.\"\n\nTIP-INS\n\nHornets: Williams made all four of his field goal attempts in the second, including three from long range. ... The Hornets are 3-4 on the road.\n\nRaptors: F Stanley Johnson (left groin strain stress reaction) was inactive. Toronto recalled F Oshae Brissett from the G-League. . Anunoby's previous career-high was 22 points, set against Washington on Feb. 13, 2019. ... Chris Boucher scored 11 points and had a season-high 11 rebounds.\n\nASSIST HISTORY\n\nThe Raptors recorded a franchise record 40 assists. Gasol led Toronto with nine and VanVleet had eight.\n\n\"That's awesome, man, especially when you've got a guard willing to pass and a big willing to pass,\" Hollis-Jefferson said.\n\nToronto had 39 assists against Indiana on Dec. 15, 1997.\n\nHOME COOKIN'\n\nToronto is one of five NBA teams without a home loss this season. The others are Utah (6-0 at home), Boston (5-0), Miami (5-0), and Philadelphia (4-0).\n\nUP NEXT\n\nHornets: At Brooklyn on Wednesday night.\n\nRaptors: Host Orlando on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995650.174151
}