{
  "game_id": "0022300672",
  "espn_id": "401585300",
  "date": "Jan 30, 2024",
  "matchup": "TOR @ CHI",
  "headline": "Gary Trent Jr. scores 24 to lead Raptors to 118-107 win over Bulls",
  "body": "CHICAGO -- — Gary Trent Jr. scored 24, Bruce Brown added 19 points and seven rebounds and the Toronto Raptors snapped a season-high five-game losing streak with a 118-107 win over the Chicago Bulls on Tuesday night.\n\n\r\n              Jordan Nwora scored 17 points in 19 minutes and Dennis Schroder added 16 points and 10 assists for the Raptors, who trailed by 16 in the second quarter but regained the lead late in the third and held on from there.\n\n\r\n              DeMar DeRozan scored 25 points and Ayo Dosunmu had 21 for Chicago, which has lost three of four.\n\n\r\n              The short-handed Raptors trimmed the Bulls' lead to 77-75 late in the third quarter on Brown's basket. Then with 2:46 left in the quarter, Nwora converted a four-point play to give the Raptors an 83-82 lead. He followed with another 3-pointer and a pair of free throws to extend the lead to 88-83 with 1:43 left. \n\n\r\n              Thaddeus Young, in his 17th season in the league, has taken notice with Brown, who was acquired in a trade with the Pacers this month.\n\n\r\n              “Bruce is a basketball player. He knows how to play. And that's what you want on your team. You want guys who know how to play, who know how to make reads, goes out there and be a glue guy, just jumps into the system. He hasn't played with us very long, but it's like he's been here for the whole season,” said Young. \n\n\r\n              Nwora turned the game around.\n\n\r\n              “Hell of a job tonight. Hell of a game last game as well. He's came off the bench from not playing, very minimal, to lighting it up,” said Young. “Like I said, that's another guy, you love guys like that can step in and play and it just fits like a glove.”\n\n\r\n              Jalen McDaniels' 3 got the lead up to 102-94 with 8:41 left, but DeRozan rallied the Bulls, going by Brown for a dunk in the lane to cut it to 104-100 with 7:12 left.\n\n\r\n              Toronto got the momentum back by trapping DeRozan and forcing a turnover, which led to an easy layup for Young. \n\n\r\n              DeRozan got it within 111-106 on a pair of free three-throws with 2:07 left but Young answered with a layup. Young finished 16 points.\n\n\r\n              “I can speak about Thad Young for the whole night. It's not just what he does on the court. It's everything he does off the court as well,” said Raptors coach Darko Rajakovic. \n\n\r\n              Toronto's trap forced 17 turnovers by Chicago.\n\n\r\n              “I think that's what we rushed through. I think I had five turnovers. I had a couple of turnovers critical late. I think AC (Alex Caruso) had one when we tried to make a run to get back in the game,” said DeRozan. “We got to be more conscious and take care of the ball a little bit better.”\n\n\r\n              The Raptors were without starters RJ Barrett (knee swelling), Immanuel Quickley (quadriceps contusion) and Jakob Poeltl, who missed his 11th straight game with an ankle sprain. \n\n\r\n              Trent scored 13 points in the first quarter on 5 of 8 shooting and had 16 in the half but Toronto still trailed 63-53 at halftime. \n\n\r\n              Bulls forward Patrick Williams is expected to miss at least two more weeks with an injured left foot. Williams’ foot issue prevented him from playing Sunday in a 104-96 victory at Portland. Before the game, the Bulls announced that the 6-foot-7 forward has acute bone edema and will get reassessed in about two weeks. Williams is averaging 10 points, 3.9 rebounds and 27.3 minutes this season.\n\n\r\n              Bulls coach Billy Donovan is hoping to get him back after the All-Star break. \n\n\r\n              UP NEXT\n\n\r\n              Raptors: Visit the Rockets on Friday night for the third of a six-game road trip.\n\n\r\n              Bulls: Travel to Charlotte on Wednesday night.\n\n\r\n              ----\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995411.554417
}