{
  "game_id": "0022300061",
  "espn_id": "401584689",
  "date": "Oct 24, 2023",
  "matchup": "LAL @ DEN",
  "headline": "Nuggets celebrate first NBA championship with banner, rings and 119-107 win over the Lakers",
  "body": "DENVER -- — The bling and the banner were nice. What the Denver Nuggets really relished, though, was opening defense of the franchise's first NBA title with a 119-107 win over the Los Angeles Lakers on Tuesday night.\n\n\r\n              “We can't think about last year too much,” Jamal Murray said after the Nuggets followed the raising of their championship banner by dropping the hammer on the Lakers in the NBA's season opener, which featured Nikola Jokic's triple-double and LeBron James taking a few more breathers than normal.\n\n\r\n              Jokic said the Nuggets fed off the emotion from the pregame ceremony to jump out to an early 18-point lead, which held up even after the Lakers got within three points in the fourth quarter.\n\n\r\n              “I think we controlled the game the whole time,” said Jokic, who had 29 points, 13 rebounds and 11 assists.\n\n\r\n              Murray added 21 points, Kentavious Caldwell-Pope scored 20, Aaron Gordon had 15 and Michael Porter Jr. had 12.\n\n\r\n              All of LA's starters also scored in double figures, led by James' 21 points in 29 minutes — his playing time is being monitored at the start of his 21st season.\n\n\r\n              “It helps,” Murray said with a smile.\n\n\r\n              James ended up playing about five fewer minutes than he's used to.\n\n\r\n              “I mean, I always want to be on the floor,” James said, “especially when you got an opportunity to win a game or feel like you can make an impact. But I guess there's a system in place and I'll follow it.”\n\n\r\n              James, the league's oldest player at age 38, stressed, “I'm not surprised or upset” about the Lakers monitoring his minutes as the season gets going.\n\n\r\n              Taurean Prince scored 18 points his his debut for the Lakers, his fifth team in nine seasons. Anthony Davis had 17 points, Austin Reaves 14 and D'Angelo Russell 11.\n\n\r\n              The Lakers trailed by 18 early but trimmed that deficit to 63-54 at halftime and used a 13-0 run spanning the third and fourth quarters to pull within 87-84 before Aaron Gordon stopped the run with a 3-pointer.\n\n\r\n              The Lakers never got closer.\n\n\r\n              After James' basket got Los Angeles within 103-96 with just over five minutes remaining, the Nuggets called timeout and came out of it with a 10-3 run featuring 3-pointers by Murray and Porter to put the Lakers away.\n\n\r\n              “We were trending in the right direction for a while there,” Lakers coach Darvin Ham said. “Each quarter we had given up less and less and then they just kind of blew the game open.”\n\n\r\n              The Nuggets received their gold, diamond-encrusted championship rings — featuring a mini championship banner that rolls out from one side — in a pregame ceremony. Murray, wearing a microphone, told teammate Gordon, “I might play the first quarter with it!”\n\n\r\n              Nuggets coach Michael Malone relished one last hurrah over last season's breakthrough before turning his attention entirely to this season.\n\n\r\n              “Jason of Beverly Hills, I want to thank them for some really nice hardware. And then at that point, I was like, ‘Let’s get the game going,'\" Malone said of watching the banner rise to rafters at sold-out, shaking Ball Arena. \n\n\r\n              “And I was also thinking about my father, just wish he was here.”\n\n\r\n              Brendan Malone, the longtime coach and driving force behind the Detroit Pistons “Bad Boys” defenses in the late 1980s and early ’90s, died earlier this month at age 81.\n\n\r\n              “So, a lot of emotions tonight but all really positive,” Malone said, “and to end it with a win is a great way to start the season off.”\n\n\r\n              The Nuggets went 16-4 in the playoffs — including a sweep of the Lakers in the Western Conference Finals — and finished things off by closing out Miami in five games to start a summer of celebrations from Denver's delirious downtown to Jokic's hometown of Sombor, Serbia.\n\n\r\n              JOKIC SNUBBED AND PRAISED\n\n\r\n              Jokic may have followed up back-to-back MVP seasons by leading the Nuggets to their first NBA title, but TNT left him off its graphic promoting its opening-night doubleheader featuring the Lakers-Nuggets and Suns-Warriors games. \n\n\r\n              The graphic featured LeBron James, Stephen Curry, Kevin Durant and Jayson Tatum — the last an odd choice given that the Celtics don't play until Wednesday night. The slight upset Charles Barkley, the co-host of TNT's “Inside the NBA,” who apologized to the Nuggets and their fans for the omission.\n\n\r\n              That said, Barkley opined in a pregame interview that he thinks the Nuggets will have a tough time repeating.\n\n\r\n              “I think they're in the mix. I'm a big Bruce Brown fan,” Barkley said of the starting small forward who signed a two-year, $45 million contract with the Indiana Pacers following Denver's title run. “They gotta replace him and the young guys gotta come on, and they're going to have to adjust to being the hunted.\"\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host Phoenix on Thursday night.\n\n\r\n              Nuggets: At Memphis on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995556.963564
}