{
  "game_id": "0021600384",
  "espn_id": "400899826",
  "date": "Dec 15, 2016",
  "matchup": "CHI @ MIL",
  "headline": "Antetokounmpo, Parker lead Bucks to 108-97 win over Bulls",
  "body": "MILWAUKEE --  It was the Giannis and Jabari show Thursday night for the Milwaukee Bucks.\n\nGiannis Antetokounmpo scored 30 points and Parker added 28 in leading Milwaukee to a 108-97 victory over the Chicago Bulls.\n\nMilwaukee led the entire game and held a 24-point advantage early in the fourth quarter but had to hold on to snap a three-game losing streak, its longest of the season.\n\nAntetokounmpo has totaled 88 points and 35 rebounds in his last three games, and Parker has reached at least 27 points in four of his past five.\n\n\"If we're just being judged on points, then they're playing really well,\" Bucks coach Jason Kidd said. \"But it's not all about points. Unfortunately, that's all you guys write about. It's a team game, but it comes down to winning and doing your job. Both of those guys did their jobs tonight.\"\n\nChicago lost for the fifth time in seven games and dropped its third straight on the road despite 21 points from Jimmy Butler and 20 from Dwyane Wade. The Bulls also got 19 points from Taj Gibson in the opener of a home-and-home between the teams on back-to-back nights.\n\nThe Bucks went up 95-71 on a dunk by Antetokounmpo with 10:01 remaining. Chicago cut the deficit in half by scoring the next 12 points, with 10 of them coming from Wade. His two free throws trimmed the margin to 95-83 with 7:14 to go.\n\nMilwaukee led by at least eight the rest of the way, marking just the second time this season the Bucks never trailed in a game.\n\n\"I think everybody did a great job keeping the lead,\" Antetokounmpo said. \"It's hard to keep a lead for 24 minutes, for a half. It's hard sometimes.\"\n\nThe Bucks' biggest lead of the night was 27 on a dunk by Tony Snell that made it 58-31 with 3:40 left in the second quarter.\n\nThe advantage was 64-45 at halftime, as Antetokounmpo (20), Parker (17) and Mirza Teletovic (10) combined to outscore Chicago by two points.\n\nMilwaukee shot 80 percent (8 for 10) from 3-point range while Chicago was 1 for 9 (11.1 percent) from beyond the arc in the first two quarters.\n\n\"They were too comfortable early,\" Bulls coach Fred Hoiberg said. \"We didn't want to give them dare shots, we wanted to keep them out of the paint, and they were hitting them.\"\n\nTIP-INS\n\nBulls: Rajan Rondo returned to the starting lineup after missing Tuesday's game against Minnesota because of a right ankle sprain. ... Butler has 79 points in his last three games and has scored at least 20 in 18 of his last 19 outings. ... Chicago lost at Milwaukee for just the fifth time in the last 15 games.\n\nBucks: There was a moment of silence following the death of longtime TNT sideline reporter Craig Sager, and Milwaukee players wore Sager Strong T-shirts during pregame warmups that resembled the outfit he wore at the recent ESPYs. Even mascot Bango donned a funky blue sport coat and plaid pants in Sager's honor. ... Michael Beasley missed his first game of the season with a left foot sprain.\n\nSTRONG DIVISION\n\nMilwaukee improved to 12-12, making the Central Division the only one in the NBA with every team at .500 or better.\n\nLET'S PLAY TWO\n\nNot only does Milwaukee play Chicago on consecutive nights, the Bucks also play back-to-back games against Cleveland on Tuesday and Wednesday, and then against Washington on Dec. 23 and Dec. 26. \"Scouting reports are easy,\" quipped Kidd.\n\nTRADE TALK\n\nMilwaukee traded Michael Carter-Williams to Chicago for Tony Snell on Oct. 17. Carter-Williams has missed the last 22 games for the Bulls with knee and wrist injuries, while Snell has started all but two games for the Bucks.\n\nUP NEXT\n\nBulls: Begin a three-game homestand Friday night against Milwaukee.\n\nBucks: Play at Chicago on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995079.0378501
}