{
  "game_id": "0022200460",
  "espn_id": "401468615",
  "date": "Dec 19, 2022",
  "matchup": "CHA @ SAC",
  "headline": "Ball, Oubre lead Hornets past Kings to halt 8-game skid",
  "body": "SACRAMENTO, Calif. -- — LaMelo Ball scored 16 of his 23 points in the fourth quarter and the Charlotte Hornets held off the Sacramento Kings 125-119 on Monday night to stop an eight-game losing streak.\n\n\r\n              “He has great courage,” Hornets coach Steve Clifford said. “He’s confident and he badly wants to win. You are never going to have to worry about his competitive spirit.”\n\n\r\n              Kelly Oubre Jr. had 31 points for the Hornets (8-23), who won for the second time in 11 games. \n\n\r\n              “Great player. Athletic,” Ball said. “He's a two-way player that gets it done on both sides.\"\n\n\r\n              Ball had only three points at halftime but broke loose in the second half. The third-year guard added 12 assists and five rebounds before fouling out with 34.1 seconds left.\n\n\r\n              It was Ball's seventh game of the season. He missed the first 13 with an ankle injury. \n\n\r\n              Gordon Hayward added 19 points, Mason Plumlee finished with 15 and Nick Richards scored 14 for Charlotte.\n\n\r\n              De’Aaron Fox had 37 points for Sacramento (16-13). Domantas Sabonis scored a season-high 28 to go with 23 rebounds and seven assists for his third 20-point, 20-rebound performance of the season.\n\n\r\n              “Good reality check for us,” Kings coach Mike Brown said.\n\n\r\n              Keegan Murray and Harrison Barnes added 11 points apiece.\n\n\r\n              “This was definitely a learning experience for us,\" Murray said.\n\n\r\n              Sacramento cut its deficit to two with 1:24 left on Fox's layup. Charlotte responded with Hayward's jumper and free throws by Oubre to seal it.\n\n\r\n              TIP-INS\n\n\r\n              Hornets: G Terry Rozier was ruled out before the game with a bruised right hip.\n\n\r\n              Kings: G Davion Mitchell returned after missing Friday’s game with a non-COVID-19 illness. ... Barnes bruised his right quad and was ruled out after scoring 11 points. ... Sacramento was 17 for 31 (54.8%) at the free throw line. The Kings on the season shoot 78.8%, which ranks 16th in the NBA.\n\n\r\n              “We didn’t lose because we didn’t make free throws,” Brown said. “Obviously, if we would have made free throws, we might have stolen the game, but the way we played, we didn’t deserve to win.”\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At the Los Angeles Clippers on Wednesday.\n\n\r\n              Kings: Continue a six-game homestand Wednesday against the Los Angeles Lakers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994278.290304
}