{
  "game_id": "0022000823",
  "espn_id": "401307618",
  "date": "Apr 13, 2021",
  "matchup": "IND vs. LAC",
  "headline": "George dominates Pacers, leads Clippers to 6th straight win",
  "body": "INDIANAPOLIS -- — Paul George continued to dominate his former team by scoring 36 points on Tuesday night and leading the Los Angeles Clippers to a 126-115 victory at Indiana.\n\n\r\n                    The Clippers have won six straight.\n\n\r\n                    George also had seven rebounds and eight assists and is 4-0 at Bankers Life Fieldhouse since being traded by the Pacers to Oklahoma City in July 2017. He has topped the 30-point mark in each of the Clippers' last four games, the last two without All-Star teammate Kawhi Leonard, who sat out with a sore right foot.\n\n\r\n                    “That’s what we’ve got to do,\" he said. “It’s just how we’ve got to play. That’s just how we’ve got to finish.\"\n\n\r\n                    George heard boos during pregame introductions and jeers throughout the game in a mostly empty arena. He's been through it before but has now won twice in Indianapolis with the Thunder, by margins of five and eight points, and twice with the Clippers, both by 11-point margins.\n\n\r\n                    George's big night was no surprise to coach Tyronn Lue.\n\n\r\n                    “I think Paul is taking what the defense is giving him,\" Lue said. “In the second half, he was making the right pass, the right plays, just taking what the defense is giving him — slowing it down, getting to the right spots to operate.\"\n\n\r\n                    Indiana was led by Malcolm Brogdon's 29 points. Caris LeVert scored 26 as the Pacers snapped a three-game losing streak.\n\n\r\n                    It sure didn't look as if the game would be lopsided after a topsy-turvy first half, which included a 15-point first quarter from George amid a chorus of boos as the Clippers led 67-65. And Los Angeles still was clinging to a 100-97 cushion after an equally entertaining third quarter.\n\n\r\n                    But George made two of the first three baskets in the fourth quarter to spur 8-0 run and Indiana never recovered.\n\n\r\n                    “Good teams put you away, they don’t let you back in the game,\" Brogdon said. “That’s what they did tonight. They built an 11-, 12-point lead and they kept it.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Marcus Morris Sr. had 22 points and seven rebounds. ... Ivica Zubac had 14 points and seven rebounds, while Nicolas Batum scored 14 points and Terance Mann had 12. ... Serge Ibaka (lower back) and Patrick Beverly (broken bone in left hand) also sat out.\n\n\r\n                    Pacers: Domantis Sabonis had 20 points and 13 rebounds, his 36th double-double this season. ... T.J. McConnell added 13 points off the bench. ... LeVert also had six rebounds and six assists. ... Indiana is 9-16 at home this season, putting a 31-year streak of winning records on its home court in jeopardy.\n\n\r\n                    IN MEMORIAM\n\n\r\n                    The Pacers paid tribute to Hall of Fame coach Bobby “Slick” Leonard with a lengthy video tribute and a moment of silence before the national anthem. The 88-year-old Leonard died earlier Tuesday from health complications. Leonard led the Pacers to 529 victories and three ABA championships in 12 seasons and later became a popular figure as the team's longtime color commentator.\n\n\r\n                    “I was very privileged to share my early professional years with Bob,\" Jerry West said. “He was so helpful and encouraging to me and I will always remember how kind and generous he was to me. He was one of the most competitive players that I was ever associated with. ... He will be missed by all associates across the NBA, particularly those who played and worked with him personally.\"\n\n\r\n                    THE JACKET\n\n\r\n                    Pacers coach Nate Bjorkgren also paid tribute to Leonard by wearing a sport coat, something that has not been part of his normal game-day attire this season.\n\n\r\n                    “You see what he did as a player, what he did as a coach, what he did for the Pacers organization to sort of keep the Pacers in existence, I really wish I could have gotten in a room and got to know him,\" Bjorkgren said, referring to the 1977 telethon that helped keep the franchise financially afloat. “We just wanted to honor him the best way we could with the moment of silence, the video tribute and the jacket.\"\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Visit Detroit on Wednesday, the second stop of a three-game trip.\n\n\r\n                    Pacers: Begin a three-game trip Wednesday at Houston.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997125.7403631
}