{
  "game_id": "0022000209",
  "espn_id": "401267369",
  "date": "Jan 18, 2021",
  "matchup": "MIL @ BKN",
  "headline": "Harden, Durant star as Nets edge Bucks 125-123",
  "body": "NEW YORK -- — James Harden missed a jumper with a chance for the lead, tracked down the rebound and fired it out to a wide-open Kevin Durant.\n\n\r\n                    Plays like that are why the Brooklyn Nets will be such tough opponents after reuniting the multi-time scoring champions. Even when teams stop one superstar, another might be there waiting.\n\n\r\n                    “This is what they do. They wake up, come to the game and they score 30,” Giannis Antetokounmpo said. “If you’re not aggressive and you’re not locked in against them, they’re going to score 50.”\n\n\r\n                    Durant made the go-ahead 3-pointer with 36 seconds left, Harden had 34 points and 12 assists, and the Nets edged the Bucks 125-123 on Monday night. They are 2-0 since last week's acquisition of Harden, who is averaging 33 points and 13 assists in his new uniform.\n\n\r\n                    “We’re still trying to find our way and we’ve still got room to improve, but it’s a solid start,” Durant said.\n\n\r\n                    Durant finished with 30 points, nine rebounds and six assists to give the Nets their fourth straight victory in a game in which two of the East's best went toe-to-toe right down to a tense finish that ended when Khris Middleton missed a potential winning 3-pointer from the corner.\n\n\r\n                    “It’s a huge win for us,” Harden said. “This is our second game together and we haven’t had one practice.”\n\n\r\n                    Antetokounmpo had 34 points, 12 rebounds and seven assists for Milwaukee, which had its four-game winning streak stopped. Middleton added 25 points and Jrue Holiday had 22.\n\n\r\n                    Harden had 11 points at halftime following his 32-point Nets debut, when he added 14 assists and 12 rebounds. But he picked it up in the second half and contributed to the biggest play of the game.\n\n\r\n                    He swooped in to grab the rebound of his own 3-pointer that was off with the Nets trailing by one and passed to Durant, who nailed the shot that made it 125-123.\n\n\r\n                    Durant could have put it away but turned it over on the Nets' next possession, but they held on when Middleton's shot was just off from in front of his bench.\n\n\r\n                    Kyrie Irving missed his seventh straight game after leaving the team for personal reasons, with coach Steve Nash saying he could return Wednesday in Cleveland.\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Milwaukee had its eight-game winning streak in Brooklyn snapped. ... Former Nets center Brook Lopez scored 15 points.\n\n\r\n                    Nets: Joe Harris scored 20 points and went 5 of 7 from 3-point range, the last with 1:05 remaining. ... Nash said the Nets would do little more than watch film and walk through some plays on Tuesday, but would try to have Irving work out on the court against some teammates to improve his conditioning after his layoff, which began Jan. 7. ... Durant was chosen as Eastern Conference player of the week after averaging 34 points, 5.3 rebounds and 8.0 assists in Brooklyn’s 3-0 week. He shot 61.3% from the field and 60% from 3-point range. He won the award 26 times in the Western Conference.\n\n\r\n                    TOUGH TESTS\n\n\r\n                    Both teams are playing last season's NBA Finalists this week. The Bucks host the NBA champion Lakers on Thursday, two nights before the Nets open a two-game series at home against Miami. \n\n\r\n                    The Bucks played against Luka Doncic in their last game before moving on to Durant and Harden in this one and LeBron James and Anthony Davis — practically an All-NBA team minus Antetokounmpo — in the next one. Coach Mike Budenholzer said the Bucks look forward to the competition. \n\n\r\n                    “I think whenever you play the best teams in the league, you always learn more about yourself and I think we’re constantly in that mode,” he said. “We want to be tested, we want to test ourselves, we want to keep our high standards, our high expectations and the best teams in the league do that to you.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Host the Los Angeles Lakers on Thursday.\n\n\r\n                    Nets: Open a two-game series in Cleveland on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997411.961832
}