{
  "game_id": "0021900539",
  "espn_id": "401161181",
  "date": "Jan 06, 2020",
  "matchup": "IND @ CHA",
  "headline": "Warren scores 36 to lead Pacers past Hornets 115-104",
  "body": "CHARLOTTE, N.C. --  T.J. Warren enjoyed another impressive outing in front of his parents and good friends.\n\nThe Pacers guard scored 30 of his 36 points in the second half, and Indiana beat the Charlotte Hornets 115-104 on Monday night to snap a two-game skid.\n\nWarren, who was born in Durham, North Carolina, and played at North Carolina State, had his previous season high of 33 points on Nov. 5 in Charlotte, although the Pacers lost that game.\n\n\"Just coming home and seeing my mom and dad in the stands, I just bring a different type of energy,\" Warren said.\n\nIndiana trailed by two at halftime but outscored Charlotte 37-21 in third quarter behind 13 points from Warren to open a 14-point lead. Warren finished 15 of 24 from the field and said the basket was looking \"pretty big\" in the second half.\n\n\"I just wanted to stay aggressive,\" he said. \"When you get in a rhythm like that and continue to build confidence, then everything just falls for you.\"\n\nDomantas Sabonis added 18 points, 12 rebounds and seven assists, and Miles Turner had 15 points and nine rebounds for the Pacers, who had lost four of their previous five. The Pacers, who are 15-4 at home, improved to 8-10 on the road.\n\nPacers coach Nate McMillan liked his team's ball movement, highlighted by 31 assists.\n\n\"Whenever you move the ball like that you're making the defense defend you and you're not just jacking up shots,\" McMillan said. \"I thought T.J. played a real smart game. There were some times when they double-teamed him and he got the ball out of the trap. But when he was able to get a look at the basket, he scored.\"\n\nTerry Rozier had 28 points for the Hornets, whose two-game win streak ended.\n\nDevonte Graham, who finished with 22 points and six assists, tried to bring the Hornets back late. He hit back-to-back 3s from the right wing, but Warren answered with a dunk and then turned a fast-break layup into a three-point play to push the lead to 11 with 1:30 left in the game.\n\n\"It started on the defensive end and that generated our offense,\" Warren said. \"We were able to get open looks and capitalize tonight. We picked up the pace on defense.\"\n\nSaid Hornets center Cody Zeller: \"When a good player gets it rolling like that, it's tough to do much against him.\"\n\nThe Pacers dominated in the paint, outscoring the Hornets 66-46.\n\n\"I think overall it was Indiana's physicality mentality,\" Hornets coach James Borrego said. \"They just played with more force in the second half. We were too casual. They were the aggressive team. T.J. Warren was fantastic in the second half and he started in the third quarter. He got them going.\"\n\nTIP-INS\n\nPacers: Jeremy Lamb had 11 points and 10 rebounds against his former team. ... Justin Holiday was ejected from the game after picking up two technical fouls for arguing a call with 9:45 left. ... Malcolm Brogdon (back) and Naz Mitrou-Long (sprained ankle) did not play.\n\nHornets: Marvin Williams (nasal fracture) did not play. ... Among those in attendance were rapper J. Cole and 2003 U.S. Open tennis champion Andy Roddick.\n\nGRAHAM IMPRESSIVE\n\nLamb said he is \"not surprised\" with the progress Graham has made in his second season with Charlotte. Graham has emerged as a candidate for the NBA's most improved player.\n\n\"His first year in the league he was playing in the league behind two veteran guards in Kemba Walker and Tony Parker, so he didn't get much of an opportunity,\" said Lamb, who signed this past offseason with the Pacers. \"But we always said he could play and told him just to stick with it. Now he's showing what all of the hard work can do.\"\n\nROZIER ON A ROLL\n\nRozier is averaging 29 points and has 17 assists over the past three games for the Hornets.\n\n\"I am feeling unstoppable, just having that confidence and just playing, man,\" Rozier said.\n\nUP NEXT\n\nPacers: Return home to host the Heat on Wednesday night.\n\nHornets: Back at home Wednesday night to face the defending NBA champion Raptors.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995854.7275891
}