{
  "game_id": "0021600779",
  "espn_id": "400900184",
  "date": "Feb 07, 2017",
  "matchup": "CHA vs. BKN",
  "headline": "Hornets end losing skid, top Brooklyn 111-107",
  "body": "CHARLOTTE, N.C. --  Someone's streak was going to continue Tuesday. The Charlotte Hornets were simply happy it wasn't them as they snapped a seven-game losing streak and held onto a 111-107 victory over the Brooklyn Nets.\n\nCharlotte (24-28) had not won since a Jan. 21 triumph over Brooklyn. The Nets (9-43) dropped their 10th straight, and still have not won since a Jan. 20 victory at New Orleans.\n\n\"We needed that game,\" Charlotte forward Nicolas Batum said. \"We're back home. We need to protect our home court and we needed to win that game.\"\n\nBatum, Kemba Walker and Marco Belinelli each had 17 points to lead the Hornets as seven players scored in double-digits in a game where Charlotte's lead ballooned to as many as 17 points in the second quarter thanks to a quick start.\n\nBojan Bogdanovic scored 22 points and Brook Lopez added 20 for the Nets.\n\nJeremy Lamb tallied 16 points for the Hornets, while center Frank Kaminsky recorded 12 points, 11 rebounds and five assists.\n\n\"We dug ourselves a big hole in the first half,\" Brooklyn coach Kenny Atkinson said. \"Again, it was kind of a similar story -- turnovers hurt us.\"\n\nThe Nets tallied 18 turnovers, which resulted in 18 Hornets points.\n\n\"Turnovers are killing us because it allows them to have too many easy layups,\" said Nets forward Bojan Bogdanovic. \"Everybody talks about defense, but I think also we have to start with the offense to limit turnovers.\"\n\nIn Brooklyn's last four games, the Nets are averaging 19.5 turnovers per game.\n\nIn this game, the Hornets pulled away early, using a 10-0 run in the first quarter to take a 14-4 advantage with 5:28 left in that period. In all, Brooklyn scored just 16 first-quarter points compared to Charlotte's 24. Only the Nets' 14-point first quarter on Jan. 21 was a smaller opponent output for the Hornets this season.\n\nBut the Nets continued to attack, scoring nearly as many points in each the third and fourth quarters (35 each) as they scored in the entire first half (37). The Nets sliced Charlotte's lead to 91-87 with 6:11 remaining when Joe Harris knocked in a 23-foot jumper.\n\nCharlotte, however, countered with quick baskets from Marvin Williams and Belinelli to give the needed cushion.\n\n\"Winning in this league is hard,\" Hornets coach Steve Clifford said. \"We struggled to guard them, but we needed a win and that's the most important thing.\"\n\nCharlotte's All-Star guard Walker caused a small scare when he doubled-over from an elbow to the face by Harris as he drove to the basket with 1:45 left in the first quarter. Walker immediately came out of game and was tended to on the bench by medical staff.\n\nHe returned to the contest with 7:29 left in the second quarter.\n\nTIP-INS\n\nNets: Spencer Dinwiddie started at point guard, as rookie Isaiah Whitehead was moved to the bench. It was Dinwiddie's 12th game started in 29 contests with the Nets, and came about because Brooklyn still is searching for cohesive units. \"It's about getting guys in their comfort zone and figuring out which point guard fits with each group,\" Nets coach Kenny Atkinson said. \"Unfortunately, this late in the season, we're still searching.\" ... Former Hornets guard Jeremy Lin missed a chance to play in front of the crowd he played for last season, sitting out because of a strained left hamstring. Lin has played in just 12 games for the Nets this season.\n\nHornets: Center Cody Zeller missed his eighth straight game with a quad contusion. The 7-foot Frank Kaminsky started at center for Charlotte, shifting from his typical power forward position. ... Center Miles Plumlee, acquired via trade Feb. 2, played his first game in Charlotte. He scored four points on 2-for-3 shooting in 15 minutes.\n\n3-POINT INACCURACY\n\nHornets coach Steve Clifford has identified one of the biggest problems plaguing his 23-28 squad: 3-point shooting. Namely, not making them.\n\n\"Our team was built around 3-point shooting,\" Clifford said.\n\nThat is a problem this season, when the Hornets rank ninth in the NBA in 3-pointers attempted (27.6) per game, but are 20th in the league in accuracy at 35.4 percent.\n\nLast season, Charlotte ranked fourth in the league in 3-point attempts (29.4) and was eighth in the NBA in accuracy at 36.2 percent.\n\nUP NEXT\n\nNets: Brooklyn returns home Wednesday to host Washington.\n\nHornets: Charlotte hosts the Houston Rockets on Thursday in the second game of a four-game homestand.",
  "source": "espn_api",
  "crawled_at": 1764995493.942307
}