{
  "game_id": "0022400133",
  "espn_id": "401704699",
  "date": "Nov 01, 2024",
  "matchup": "ORL @ CLE",
  "headline": "Garland scores 25 points, Cavaliers improve to 6-0 with 120-109 win over Banchero-less Magic",
  "body": "CLEVELAND -- — Darius Garland scored 25 points, Donovan Mitchell added 22 and the Cleveland Cavaliers improved to 6-0 with a 120-109 victory Friday night over the Orlando Magic, who played their first game without injured All-Star Paolo Banchero.\n\n\r\n              The Cavs are the only unbeaten team in the Eastern Conference. The last time Cleveland started 6-0 was in 2016 with LeBron James. The club's best start was 8-0 in 1976.\n\n\r\n              The early meeting between Orlando and Cleveland was a rematch of last season's tense opening-round playoff series won by the Cavs in seven games.\n\n\r\n              Banchero is expected to miss at least a month — and maybe longer — with a torn right oblique. The No. 1 overall pick in the 2022 draft was on an early tear, averaging 29 points with 8.8 rebounds and 5.6 assists before getting hurt Wednesday.\n\n\r\n              Orlando's Jalen Suggs scored a career-high 28 points and had eight rebounds and seven assists. Franz Wagner had 17 points.\n\n\r\n              Cleveland rookie Luke Travers made his NBA debut. The Australian scored four points in garbage time.\n\n\r\n              Takeaways\r\n              Magic: Life without Banchero won't be easy, but it could lead to Suggs further developing his offensive game and others stepping up.\n\n\r\n              Cavaliers: Have bought into first-year coach Kenny Atkinson's offensive system by playing at a faster pace and shooting more 3-pointers.\n\n\r\n              Key moment\r\n              The Magic hung around and were still within 10 late in the third quarter, when Cavs reserves Caris LeVert, Sam Merrill and Georges Niang all made 3-pointers in the final 2:17 to give Cleveland a 17-point lead going to the fourth.\n\n\r\n              Key stat\r\n              Cleveland improved to 30-7 in Mitchell's last 37 regular-season games since January.\n\n\r\n              Up next\r\n              The Magic continue their trip at Dallas on Sunday. The Cavs play Saturday in Milwaukee before hosting Bucks on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997877.725133
}