{
  "game_id": "0022400195",
  "espn_id": "401704761",
  "date": "Nov 08, 2024",
  "matchup": "LAL vs. PHI",
  "headline": "LeBron has his 114th triple-double in the Lakers' 116-106 win over the slumping 76ers",
  "body": "LOS ANGELES -- — LeBron James had 21 points, 13 assists and 12 rebounds in his second triple-double of the season, and the Los Angeles Lakers extended the Philadelphia 76ers' miserable start with a 116-106 victory Friday night.\n\n\r\n              Anthony Davis scored 31 points, Austin Reaves had 20 and D'Angelo Russell added 18 as a reserve for the Lakers, who remained unbeaten at home this season in their return from a 1-4 trip.\n\n\r\n              James secured his 114th career triple-double early in the fourth quarter.\n\n\r\n              Paul George scored nine points for the Sixers, who dropped to 1-7 while playing without two of their top three players. Rookie Jared McCain had 18 points for Philadelphia, which has lost five straight.\n\n\r\n              Former league MVP Joel Embiid served the second game of his three-game suspension for shoving a reporter, while All-Star guard Tyrese Maxey missed his first game with the hamstring injury that will sideline him for at least two weeks.\n\n\r\n              Bronny James played the final 1:28.\n\n\r\n              Takeaways\r\n              76ers: Winning without Embiid and Maxey seems awfully difficult, and the Sixers couldn't play enough defense to stay competitive.\n\n\r\n              Lakers: Cam Reddish replaced Russell in the starting lineup, and rookie coach JJ Redick's strategy appeared to work. The mercurial Russell played comfortably and aggressively as a reserve.\n\n\r\n              Key moment\r\n              Philadelphia erased an early 13-point deficit shortly before halftime, but the Lakers made an 8-0 run into the break and a 10-0 surge shortly after it to take charge.\n\n\r\n              Key stat\r\n              The 39-year-old James has seven triple-doubles since he passed Tim Duncan one year ago to become the second-oldest player in NBA history to accomplish the feat. Karl Malone was 40 years and 127 days old when he became the oldest player with a triple-double in November 2003.\n\n\r\n              Up next\r\n              The Lakers host Toronto on Sunday night. The 76ers return home to face Charlotte on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997212.895159
}