{
  "game_id": "0021600989",
  "espn_id": "400900384",
  "date": "Mar 12, 2017",
  "matchup": "HOU vs. CLE",
  "headline": "Harden's triple-double helps Rockets top Cavs 117-112",
  "body": "HOUSTON --  James Harden and the Houston Rockets have shown at times this season that they could be title contenders. Lately, however, they've failed to rise to the occasion against the NBA's elite.\n\nThat changed on Sunday night when Harden had a triple-double of 38 points, 11 assists and 10 rebounds to outduel fellow MVP candidate LeBron James and lead the Rockets to a 117-112 win over the Cleveland Cavaliers.\n\n\"We beat Golden State. We beat San Antonio, but that was earlier,\" Rockets coach Mike D'Antoni said. \"We haven't had one (recently), so this was good. This will give us a little boost.\"\n\nThe Rockets were up by six when Nene made a layup before intercepting a bad pass by James. Patrick Beverley made a 3-pointer on the other end to push the lead to 116-107 with less than two minutes left.\n\nKyrie Irving hit a 3 with less than a minute to go and added two free throws after that to get the Cavaliers within four. But then Harden sank a free throw to end Cleveland's run and secure the victory.\n\nIt was the 16th triple-double this season for Harden and his 31st game with at least 30 points.\n\n\"It's a big win for us, especially because we're down the stretch and it's time to begin preparing ourselves for postseason,\" Harden said. \"Big win against the defending champs.\"\n\nJames had 30 points and Irving scored 28 for the Cavaliers, who lost for the fourth time in five games.\n\nCleveland coach Tyronn Lue thinks James and Irving struggled after the team also played on Saturday night.\n\n\"We played hard and fought down the stretch and got tired,\" Lue said. \"I thought LeBron got tired and Kyrie got tired. What we took advantage of in the first half, we weren't able to get those things in the second half because our guys got tired.\"\n\nJames lamented the fact that Houston got 20 offensive rebounds to just four by the Cavaliers.\n\n\"They did a good job of crashing the glass,\" he said. \"Obviously, if we got some of those we would have given ourselves a better chance to get the win, but we didn't.\"\n\nDeron Williams gave the Cavaliers a one-point lead on a 3 with about seven minutes left before Houston scored the next seven points, highlighted by Clint Capela's two-handed dunk on an assist from Harden to make it 107-101.\n\nJames ended a scoring drought of almost two minutes when he drained a 3-pointer just before the shot clock expired to get Cleveland within three.\n\nLou Williams gave Houston a six-point lead by opening the fourth quarter with a layup. Cleveland then used a 10-2 run, with 3s from James and Channing Frye, to go on top 96-94.\n\nCleveland led by 14 with about 10 minutes left in the third quarter after a 3-pointer by James. The Rockets then used an 18-7 run to get to 81-78 with less than four minutes left in the period. Houston had two 3-pointers in that span, one from Harden and one from Ryan Anderson.\n\nHarden and James both added a basket after that before Houston missed six straight shots over the next two possessions.\n\nLou Williams finally got the Rockets going again when he made a 3-pointer that tied it at 83 with about two minutes left in the quarter.\n\nThe Cavaliers regained the lead with a 3 by Derrick Williams, but Houston scored the last seven points of the quarter to take a 90-86 lead into the fourth. Harden capped that run by grabbing a steal from Irving and finishing on the other end with a layup.\n\nThe Cavaliers led 67-58 at halftime.\n\nTIP-INS\n\nCavaliers: James finished with eight turnovers. ... Richard Jefferson had 16 points. ... Cleveland shot 17 of 43 on 3s.\n\nRockets: Beverley made three 3-pointers. ... The Rockets hit 16 of 45 3-point attempts. ... Harden also had a block and a steal.\n\nUNWANTED VISITOR\n\nPlay was briefly stopped midway through the second quarter when a fan ran onto the court and in the middle of all the players. He didn't touch any players, but came within a foot or so of both Jefferson and Beverley. The fan reached midcourt and waved a shirt over his head before being chased down by a group of security guards and dragged off the court. Players moved away from the area where the fan was caught and a couple of them shook their heads and laughed.\n\nTHEY SAID IT\n\nJames on the Cavs' recent struggles: \"We just have to figure it out. We are a team that is capable of doing that. We knew March was going to be a tough month when we looked at the schedule in the beginning.\"\n\nUP NEXT\n\nCavaliers: Host the Detroit Pistons on Tuesday.\n\nRockets: Host the Los Angeles Lakers on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995745.1493561
}