{
  "game_id": "0022300878",
  "espn_id": "401585506",
  "date": "Mar 03, 2024",
  "matchup": "PHX vs. OKC",
  "headline": "Gilgeous-Alexander scores 35 points, Thunder hold off Suns 118-110 to regain top spot in West",
  "body": "PHOENIX -- — Shai Gilgeous-Alexander had 35 points and the Oklahoma City Thunder beat the Phoenix Suns 118-110 on Sunday night to take the Western Conference lead, rebounding after blowing a 24-point lead.\n\n\r\n              Jusuf Nurkic broke the Suns' franchise record with 31 rebounds, the most in an NBA game in 14 years. He also had 14 points — and five of Phoenix's 21 turnovers. The Suns played without star guard Devin Booker after he sprained his right ankle late in a loss to Houston on Saturday night.\n\n\r\n              Oklahoma City improved to 42-18 to take a half-game lead over Northwest Division rivals Denver and Minnesota in the Western Conference. The Thunder had won six in a row before losing Thursday night at San Antonio, and this one nearly got away.\n\n\r\n              “We were able to get the start under control pretty quickly,\" Thunder coach Mark Daigneault said. \"And then that was an avalanche in the third and fourth quarter, they really got into a groove there. But I thought we showed great resilience in the fourth to climb back into it after all that.”\n\n\r\n              All five Oklahoma City starters were in double figures. Jalen Williams had 22 points, Chet Holmgren 14, Luguentz Dort 13 and Josh Giddey 10. Gilgeous-Alexander also had eight rebounds and nine assists.\n\n\r\n              Nurkic broke the Phoenix rebound record of 27 set by Tyson Chandler against Atlanta in January 2016. Nurkic’s previous career high was 23 for Portland against Sacramento in January 2019. The 7-footer had 22 this season against both the Los Angeles Lakers and Brooklyn.\n\n\r\n              “It doesn’t really matter,” Nurkic said. “It is great, but we lost the game.”\n\n\r\n              Bradley Beal scored 31 points for Phoenix. Ejected Saturday night for a scuffle with Houston's Jalen Green, Beal played 33 minutes in his second game back from a strained hamstring. He had seven turnovers.\n\n\r\n              “The year I have had I am just happy to be on the floor,” said Beal, who has missed 28 games this season with various injuries.\n\n\r\n              Kevin Durant added 20 points, but had five turnovers., Eric Gordon had 15 points after missing three games because of a groin injury.\n\n\r\n              Phoenix coach Frank Vogel said before the game that Booker’s ankle was still being evaluated and the team would have more information on Tuesday.\n\n\r\n              Initially Phoenix shook off Booker’s absence, racing to a 17-4 lead. But the Thunder scored the next 10 points and finished the first quarter on a 24-7 run to lead 28-22. Gilgeous-Alexander had 10 points in the period.\n\n\r\n              Nurkic played seven minutes in the first quarter and had 12 rebounds — but the Suns only had one rebound for the rest of the quarter after he went to the bench for a breather.\n\n\r\n              Gilgeous-Alexander, second to Luka Doncic of Dallas in scoring average at 31.4 entering Sunday, had 18 points in the first half Sunday as the Thunder led 66-52 at intermission. Beal had 17 to lead the Suns.\n\n\r\n              Oklahoma City led by 24 before the Suns stormed back to cut it to 86-83 late in the third quarter. Gordon’s 3-pointer early in the fourth quarter made it 91-89, the Suns' first lead since the first quarter.\n\n\r\n              “We stopped fouling,” Vogel said about what ended up being a 39-8 Phoenix run. “I was trying so hard to get Kevin involved instead of letting the game come to us.”\n\n\r\n              But the Thunder's stars kept their poise and came away with the victory.\n\n\r\n              “I just play the game level-headed, always try to play the next possession in front of me,\" Gilgeous-Alexander said. \"Basketball is a game of runs, so it’s ups and downs, you just got to try to turn the tide and you only do that by taking possession by possession. “I try to keep the same mentality no matter what’s going on.”\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Los Angeles Lakers ON Monday night.\n\n\r\n              Suns: At Denver on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996646.83282
}