{
  "game_id": "0022400532",
  "espn_id": "401748705",
  "date": "Jan 28, 2025",
  "matchup": "HOU @ ATL",
  "headline": "Green scores 25 and Rockets hold off Hawks 100-96 for fourth straight victory",
  "body": "ATLANTA -- — Jalen Green scored 12 of his 25 points in the third quarter and the Houston Rockets avoided a late collapse to beat the Atlanta Hawks 100-96 on Tuesday night. \n\n\r\n              Alperen Sengun added 18 points and 10 rebounds for the Rockets, who led 96-80 after Green's steal and layup with 5:41 remaining before Atlanta closed within two in the final minute. \n\n\r\n              Dillon Brooks and Amen Thompson each finished with 11 points for the Rockets, who followed their victory in Boston on Monday with their fourth straight win. \n\n\r\n              Trae Young had 21 points and nine assists for Atlanta, which dropped its season-high sixth straight. \n\n\r\n              Takeaways\r\n              Rockets: Houston has won 10 of 12 and moved 1 1/2 games ahead of Memphis for the No. 2 seed in the Western Conference. \n\n\r\n              Hawks: Atlanta has not won since beating the Celtics 119-115 in overtime on Jan. 18. \n\n\r\n              Key moment\r\n              The Hawks cut the lead to 98-96 with 46 seconds to play. De’Andre Hunter missed a potential go-ahead 3-pointer with 12 seconds left and the ball bounced over the backboard, giving the Rockets the ball with 10 seconds left. Sengun broke free on the ensuing Houston inbounds pass and his dunk sealed the win.\n\n\r\n              Key stat\r\n              The Hawks shot 11 of 47 from 3-point range. After hitting three of its first seven 3-pointers, Atlanta went 8 of 40 the rest of the game.\n\n\r\n              Up next\r\n              The Hawks travel to Cleveland play the Cavaliers on Thursday while the Rockets head to Memphis to play the Grizzlies in a key Western Conference matchup on Thursday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997375.840393
}