{
  "game_id": "0021500982",
  "espn_id": "400828869",
  "date": "Mar 12, 2016",
  "matchup": "POR vs. ORL",
  "headline": "Lillard, Trail Blazers roll to 121-84 victory over Magic",
  "body": "PORTLAND, Ore. --  On the eve of a tough road trip, the Portland Trail Blazers showed some toughness in a romp at home.\n\nDamian Lillard scored 19 points and had 10 of Portland's season-high 34 assists as the Trail Blazers beat the short-handed Orlando Magic 121-84 on Saturday night.\n\nC.J. McCollum and Allen Crabbe each had 18 points for the Blazers, who won for the sixth time in their last seven home games. But it was the ejection of teammate Ed Davis that was the primary postgame topic.\n\nMidway through the third quarter of what was already a blowout, Lillard and Orlando's Jason Smith had to be separated after exchanging words following an offensive foul on Smith. Lillard said he felt that Smith needlessly stepped into him while setting a screen, and he jumped up to let the 7-footer know how he felt.\n\nLess than three minutes later, Davis used both arms to come down hard on Smith as he drove to the basket. Initially called a common foul, officials reviewed the play and upgraded it to a Flagrant 2 and ejection.\n\nReplays showed Davis' forearm catching Smith across the nose without much of an attempt to play the ball.\n\nDavis, whose stall in the Portland locker room is next to a plaque honoring former Blazers forward Maurice Lucas, known as The Enforcer, insisted it wasn't a retaliatory measure.\n\n\"I thought it was a good foul,\" he said. \"Probably in the early `90s it wouldn't have been a foul. It wasn't in retaliation at all. He drove to the basket and I wasn't going to give up a dunk.\"\n\nLillard agreed there wasn't any extra motive to Davis' actions, but liked it all the same.\n\n\"Any time a big is willing to stick up for you, you know that there's a bond there and a respect level,\" he said.\n\nSmith, who scored six points, harbored no ill will after the game, either.\n\n\"That's how the game is,\" he said. \"Guys compete and sometimes those things happen.\"\n\nVictor Oladipo scored 18 points for the Magic, who were without starters Elfrid Payton (sprained elbow) and Nikola Vucevic (strained groin), as well as backup guard Brandon Jennings (sore Achilles).\n\n\"We just came out and laid an egg tonight,\" Orlando coach Scott Skiles said. \"They were ready to play tonight and we weren't.\"\n\nNext up for sixth-place Portland is a road trip to Oklahoma City, the West's No. 3 seed, No. 2 San Antonio and No. 8 Dallas, with a stop at New Orleans mixed in.\n\n\"It's going to be a tough trip,\" said Lillard, whose 15 double-doubles are the most by a Blazers guard since Rod Strickland in 1995-96. \"We've got to go out there and be ourselves.\"\n\nAfter falling behind 11-2 to open the game, Portland found its game and closed the first by outscoring the Magic 29-13, taking the lead for good with 1:55 to go.\n\nLillard dished out nine assists in the first half while taking only two shots. Crabbe and McCollum carried the scoring burden, combining for 25 points as Portland led by as many as 23 before heading to the half with a 63-42 advantage.\n\nAaron Gordon had 17 points and Evan Fournier scored 13 of his 15 points in the first quarter for Orlando. Mario Hezonja added 11.\n\nDOMINATING NIGHT\n\nThe 37-point margin of victory was Portland's biggest of the season, surpassing the 32-point win over Golden State on Feb. 19, and the Blazers led by as many as 41. It was also the largest margin of victory against Orlando. In addition, the Blazers shot a season-high 56 percent from the field and their bench outscored the Magic's 60-29.\n\nTIP-INS\n\nMagic: Payton was a late scratch, missing his second consecutive game. C.J Watson started in his place. ... Vucevic, who had 25 points and 11 boards for the Magic in a December victory over Portland, missed his fourth straight game. Dewayne Dedmon got the start. .. Orlando wrapped up a four-game West Coast swing with a 1/3 record.\n\nTrail Blazers: Portland improved to 4-11 in the second game of back-to-back contests this season. The Blazers lost at Golden State on Friday.\n\nUP NEXT\n\nMagic: Host Denver on Tuesday.\n\nTrail Blazers: At Oklahoma City on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994501.153269
}