{
  "game_id": "0021600757",
  "espn_id": "400900162",
  "date": "Feb 04, 2017",
  "matchup": "DET @ IND",
  "headline": "George scores 21 to lead Pacers to 6th straight win",
  "body": "INDIANAPOLIS -- The Indiana Pacers remain one of the hottest teams in the NBA, and they've put the Eastern Conference on notice since the calendar turned to 2017.\nPaul George led Indiana with 21 points, but it was a balanced attack that allowed the Pacers (28-22) to move a season-best six games over .500 and extend their season-best winning streak to six games with a 105-84 victory over the Detroit Pistons on Saturday night.\nLavoy Allen had 18 points and 11 rebounds on his 28th birthday, replacing an injured Thaddeus Young, who sat out with a sprained left wrist. Myles Turner, C.J. Miles, Jeff Teague and Al Jefferson all finished with 13 points for Indiana.\n\"Right now, we're playing the way we want to play,\" George said.\nFinally, the Pacers look like the group team president Larry Bird envisioned when he revamped the roster and made a coaching change in the offseason. They're scoring at a high level (108.3 during the streak), they remain one of the better defensive teams in the league (Indiana leads the NBA in turnovers forced), and the team chemistry is as good as it's been all season.\n\"I just see us improving every game,\" Pacers coach Nate McMillan said. \"Our focus, mentally and physically, is getting better.\"\nThis contest -- at least for 2½ quarters -- was a battle between teams jockeying for playoff position with the NBA All-Star Game approaching. Detroit had a chance to edge to within one game of Chicago for seventh place in the Eastern Conference. The Pacers have Atlanta and Toronto in their crosshairs.\nAfter neither team led by more than seven in the first half, Indiana grabbed control during a 20-5 run in the third quarter. Trailing 61-58 just 30 seconds into the quarter, Miles tied the game with a 3-pointer. The teams then exchanged the lead twice before Detroit went cold, allowing Indiana to gain its largest advantage.\nDuring a scoreless stretch for Detroit that lasted 5 minutes, 15 seconds, Allen scored eight points and George five for Indiana. The Pacers outscored Detroit 26-14 in the third and took an 82-72 lead into the final period.\nIsh Smith's jumper on Detroit's first possession of the final period got the Pistons within eight. That was as close as they'd get.\nIndiana closed the game strong, outscoring Detroit 23-12 in the final quarter. The 26 points allowed in the second half was a season-best for Indiana.\n\"I thought they were outstanding in the second half,\" Pistons coach Stan Van Gundy said of Indiana. \"We played a mediocre first half and we were in the lead, but we were just awful in the second half.\"\nThe Pacers kept the usually-reliable Andre Drummond in check. Averaging a double-double, Drummond finished with just 13 points and nine rebounds. Marcus Morris led Detroit with 19 points, and Jon Leuer scored 14 points and grabbed seven rebounds.\nIndiana kept pace with Atlanta (30-21) and Toronto (30-21) with the win. The Hawks defeated Orlando on Saturday, allowing them to maintain a 1½ game lead over the Pacers.\nTIP-INS\nDetroit: After scoring a career-high 36 points in Friday's win over Minnesota, Morris had 19 against the Pacers. ... Van Gundy remains one win shy of his 100th win as Detroit's coach. ... Kentavious Caldwell-Pope was called for a technical foul in the first quarter for disputing a foul call. ... The 26 points scored by Detroit in the second half was a season-low.\nIndiana: Young sprained his left wrist in Friday's 106-97 road win at Brooklyn. ... Rodney Stuckey did not play due to a right ankle sprain. ... Indiana plays six of its next eight games at home. ... Over his last 11 games, George is averaging 24 points. ... The Pacers improved to 19-6 at home.\nGAINING GROUND\nWith three of the teams ahead of them in the standings struggling of late, the Pacers have closed the gap in the conference standings. Over their last 11 games, conference-leader Cleveland is 6-5, fourth-place Atlanta is 7-4, and fifth-place Toronto is 2-8 over its last 10 games. Since Dec. 28, Indiana is 13-4 (the fourth best record in that stretch).\nCALLING FOR CONSISTENCY\nIndiana improved to 19-6 at home. Conversely, they're 9-16 on the road. That mark has improved with the Pacers winning their last three on the road. George said Indiana is proud of its home record, but they can be much better on the road than they have been. \"If we can match how we play at home with how we perform on the road,\" George said, \"we'll be a lot better off in the second half of the season.\"\nUP NEXT\nPistons: host Philadelphia on Monday in the first of three straight games at home. The 76ers won the first meeting 97-79 at Detroit on Dec. 11\nPacers: host Oklahoma City on Monday in their second game of a three-game homestand. Indiana beat the Thunder 101-98 on the road Nov. 20.",
  "source": "espn_api",
  "crawled_at": 1764996048.330255
}