{
  "game_id": "0022001062",
  "espn_id": "401307876",
  "date": "May 15, 2021",
  "matchup": "MIL vs. MIA",
  "headline": "Bucks beat Heat 122-108, maintain bid for East's No. 2 seed",
  "body": "MILWAUKEE -- — Khris Middleton and Bryn Forbes each scored 21 points to help the Milwaukee Bucks beat the Miami Heat 122-108 on Saturday night in a potential first-round playoff series preview.\n\n\r\n                    Jrue Holiday added 20 points and 10 assists for the Bucks, who have won three straight and eight of their last nine. \n\n\r\n                    “It's more about being consistent going into the playoffs, no matter the opponent or who we're playing,” Holiday said. “It's about being consistent and being in a good groove. I think at this point in the season we've done a pretty good job of really just coming out every game and trying to prepare like every game's a playoff game.”\n\n\r\n                    Kendrick Nunn had a season-high 31 points for the Heat. They lost despite shooting 22 of 49 from 3-point range and tying a franchise record for 3-point baskets in a game.\n\n\r\n                    Miami didn't have leading scorer Jimmy Butler due to lower back tightness. \n\n\r\n                    The Bucks are third and the Heat sixth in the  Eastern Conference standings, which would have them meeting in the first round of the playoffs. But neither team is locked into that position heading into the final day of the regular season.\n\n\r\n                    Milwaukee still could earn the No. 2 seed if it wins at Chicago and the Brooklyn Nets lose at home to Cleveland on Sunday. Miami could move into the No. 5 spot if it beats Houston and the New York Knicks lose at home to Boston.\n\n\r\n                    \r\n                      The Heat beat the top-seeded Bucks 4-1 in a second-round playoff series  last year and went on to win the East title before losing to the Los Angeles Lakers in the NBA Finals. \n\n\r\n                    “It's just all about competing,” said Middleton, who had seven rebounds and seven assists. “It doesn't matter who it is, if they beat us in the past or if we beat them in the past. We know at this point, everybody's trying to play their best basketball, so each night we have to bring it.”\n\n\r\n                    This loss eliminated the Heat from contention for a potential No. 4 seed and home-court advantage in the first round of the playoffs.\n\n\r\n                    “It is a little bit disappointing,” Miami's Goran Dragic said. “Now it's over. ... We need to regroup and be ready. We still have our last game tomorrow. It can count to move up in the standings, so we're going to do everything it takes to win that one.”\n\n\r\n                    Milwaukee took the lead for good about two minutes into the game thanks to a balanced attack.\n\n\r\n                    Brook Lopez scored 18 points and shot 9 of 10. Giannis Antetokounmpo had 15 points, Bobby Portis 14, and Donte DiVincenzo added 11 points and nine rebounds.\n\n\r\n                    Duncan Robinson and Dragic scored 17 points each for Miami.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Butler didn’t play in any of the Heat’s three regular-season meetings with the Bucks. When these two teams split a pair of games in Miami on Dec. 29-30, Butler was out with a sprained right ankle. Butler averaged 23.4 points, 5.8 rebounds and 4.4 assists  during Miami’s second-round playoff series victory over the Bucks last season. ... Milwaukee native Tyler Herro scored just three points while shooting 1 of 9 overall and 0 for 5 from 3-point range. Herro entered the night having shot 23 of 36 from 3-point range over his last six games.\n\n\r\n                    Bucks: Jim Paschke, who is retiring at the end of the season after 35 years of broadcasting Bucks games, received a hearty ovation as he announced Milwaukee’s lineup  before the regular-season home finale. In a videotaped message that aired midway through the second quarter, broadcasters from across the NBA offered tributes to Paschke.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: At Detroit on Sunday. Their two previous meetings this season were both at Miami, with the Pistons prevailing 120-100  on Jan. 16 and the Heat winning 113-107 on Jan. 18.\n\n\r\n                    Bucks: At Chicago on Sunday. The Bucks have won the last 12 games in the series, including a 126-96 decision at Milwaukee on Jan. 1 and a 108-98 triumph in Chicago  on April 30.\n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997364.868097
}