{
  "game_id": "0021800443",
  "espn_id": "401071124",
  "date": "Dec 17, 2018",
  "matchup": "MIL @ DET",
  "headline": "Bucks hold on late for 107-104 win over Pistons",
  "body": "DETROIT --  Giannis Antetokounmpo was called for two quick fouls, and with 9:02 remaining in the first quarter, he went to the bench.\n\nWhen he returned, there was still plenty of time for the Milwaukee star to make an impact.\n\n\"No matter how many fouls I have, I've got to be aggressive. If I get the third one, I get the third one,\" Antetokounmpo said. \"Whenever I stop being aggressive, I don't make plays.\"\n\nAntetokounmpo made plenty of plays down the stretch, finishing with 32 points and 12 rebounds, and the Bucks held on for a 107-104 victory over the Detroit Pistons on Monday night when Blake Griffin missed a last-second 3-pointer.\n\nGriffin actually missed two 3s in the final 14 seconds. The Detroit star already had a triple-double after three quarters, but it was a difficult fourth for him. Griffin finished with 19 points, 11 assists and 10 rebounds, but he also had 10 turnovers.\n\n\"We're not going to win games by 10 turnovers and by making the poor decisions like I did down the stretch,\" Griffin said. \"I feel bad for these guys because they played so hard and got us back in this game. I wasn't there for them tonight.\"\n\nThe Pistons rallied from a 15-point, third-quarter deficit and took an 89-86 lead in the fourth when Stanley Johnson connected from 3-point range. Milwaukee was up 100-99 when Eric Bledsoe of the Bucks missed three straight free throws -- but Antetokounmpo briefly took over after that.\n\nAntetokounmpo put Milwaukee up by three with a dunk, then added a three-point play and another dunk to make it 107-100.\n\nThe Pistons rallied and had the ball with a chance to tie. Griffin missed from beyond the arc, and after Jose Calderon came up with an offensive rebound, Griffin missed again.\n\n\"I was unbelievably awful tonight,\" Griffin said. \"I thought we had a chance to tie it tonight despite everything I did.\"\n\nTIP-INS\n\nBucks: Khris Middleton scored 22 points and Bledsoe added 17. ... Antetokounmpo actually played 6:03 in the first quarter despite the early fouls. He played 31:11 for the game.\n\nPistons: Andre Drummond had only 10 points to go along with his 14 rebounds and had a dunk attempt blocked by Antetokounmpo late in the first. ... Reggie Bullock scored 10 points in the first quarter and finished with a team-high 24.\n\nINJURIES\n\nMilwaukee was without guard Malcolm Brogdon for a second straight game because of left hamstring soreness.\n\nErsan Ilyasova also missed the game for the Bucks with a nose contusion. The Pistons were without guard Ish Smith (right adductor tear), forward Glenn Robinson III (left ankle sprain) and forward Henry Ellenson (left ankle sprain).\n\nIN RESERVE\n\nD.J. Wilson, a second-year player for Milwaukee who played college basketball at nearby Michigan, came back from a G League assignment and scored a career-high nine points.\n\nSterling Brown also scored nine points off the bench.\n\n\"They were huge,\" Bucks center Brook Lopez said. \"Having that kind of energy from the young fellows and having them come out with that kind of confidence, especially defensively, it's so big time. It was great that they were ready for that opportunity.\"\n\nBIG QUARTER\n\nJohnson finished with 20 points for the Pistons and made four 3-pointers, all in the fourth period.\n\n\"I thought the second unit came in and played with energy and played hard,\" Pistons coach Dwane Casey said. \"They got us back into the game.\"\n\nUP NEXT\n\nBucks: Host New Orleans on Wednesday night.\n\nPistons: Visit Minnesota on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994505.925645
}