{
  "game_id": "0022001040",
  "espn_id": "401307849",
  "date": "May 11, 2021",
  "matchup": "OKC @ SAC",
  "headline": "Kings complete sweep of Thunder, still hope for playoffs",
  "body": "SACRAMENTO, Calif. -- — Terence Davis matched his season high with 27 points, Buddy Hield had 21 and the Sacramento Kings beat the Oklahoma City Thunder 122-106 on Tuesday night to keep their slim playoff hopes alive.\n\n\r\n                    Delon Wright added 21 points and eight assists for the Kings. Richaun Holmes had 13 points and seven rebounds. Maurice Harkless scored 15 points.\n\n\r\n                    Sacramento (31-38) has won five of six to close within 2 ½ games of San Antonio (33-35) for the final play-in spot in the Western Conference. To get in, the Kings must win their final three games and get help from other teams to leapfrog the Spurs and New Orleans Pelicans.\n\n\r\n                    “These last few games we’ve been clicking on a different level,” Davis said. “All the guys are filling their roles and stepping up when the opportunity shows itself.”\n\n\r\n                    Beating the Thunder for the second time in three days left coach Luke Walton’s team with at least a mathematical chance of getting in.\n\n\r\n                    “I’m really pleased with how our guys are continuing to fight,” Walton said. “It’s all about building habits, building behaviors and being consistent with it. It’s good to see as the season is coming down to the last games that we’re doing it as a group.”\n\n\r\n                    Kenrich Williams scored 20 points and Darius Bazley had 18 for the Thunder. Moses Brown added 10 points and 13 rebounds. Oklahoma City has lost eight straight and 22 of 23.\n\n\r\n                    “They felt us a lot more than they did the other night,” Thunder coach Mark Daigneault said. “The third quarter they came out and popped us pretty good, and it took us too long to get the car back on the road. The third quarter was the difference in the game.”\n\n\r\n                    The Kings stumbled early before finding their rhythm in the third.\n\n\r\n                    After the Thunder went up 67-64 following Aleksej Pokuševski’s bucket inside the paint early, Sacramento scored the next seven points and never trailed after that.\n\n\r\n                    “We came out and for the most part we were playing kind of cool,” Harkless said. “Luke called us out in the locker room. We decided to make it a point in the third quarter to set the tone and be the aggressors. From there it was kind of our game.”\n\n\r\n                    The Kings made four consecutive 3s as part of a 14-2 run, then Wright made a pair beyond the arc to make it 103-83.\n\n\r\n                    Damian Jones had a dunk and a floater in the fourth, and Wright’s fifth 3-pointer put Sacramento ahead 118-90.\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Oklahoma City fell behind 8-2 then went on a 17-2 run in the first quarter. … Theo Maledon did not play because of plantar fasciitis in his left foot. Ty Jerome (left calf strain) and Lu Dort (right knee patellar tendinitis) were also held out. \n\n\r\n                    Kings: Davis, Hield and Wright made five 3-pointers apiece. … Marvin Bagley III, who recently returned after missing 22 games with a broken bone in his hand, did not play because of a soft tissue injury in his leg.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Host the Jazz on Friday. Utah has won both games against Oklahoma City this season.\n\n\r\n                    Kings: Travel to Memphis for back-to-back games against the Grizzlies on Thursday and Friday.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997061.008238
}