{
  "game_id": "0022000539",
  "espn_id": "401309754",
  "date": "Mar 03, 2021",
  "matchup": "TOR vs. DET",
  "headline": "Ellington, backups help Pistons beat depleted Raptors",
  "body": "TAMPA, Fla. -- — Wayne Ellington scored 25 points and the Detroit Pistons beat the virus-depleted Toronto Raptors 129-105 on Wednesday night to snap a three-game losing streak. \n\n\r\n                    Ellington was 8 of 11 from 3-point range and the Pistons were 20 for 41 overall from long range. Detroit’s backups had 56 points, with Rodney McGruder and Saben Lee each finishing with 20.\n\n\r\n                    Starting guard Dennis Smith Jr. put up 10 points, 12 rebounds and 11 assists.\n\n\r\n                    Norman Powell had 36 points for Toronto, and Kyle Lowry added 21 points.\n\n\r\n                    The Raptors played without Pascal Siakam, Fred VanVleet and OG Anunoby, three of their top four scorers, and reserves Malachi Flynn and Patrick McCaw because of the NBA's health and safety protocols. Coach Nick Nurse and most of his staff also were held out.\n\n\r\n                    The biggest voids were on defense and rebounding.\n\n\r\n                    “We had a practice yesterday to try to regroup a little bit and it was really a pretty good practice,\" said Sergio Scariolo, who directed the Raptors for the second time in Nurse's absence. “But no excuses. We had enough players and coaches to have played a better game than this one.”\n\n\r\n                    The Pistons shot 53% and had a 49-34 rebound advantage.\n\n\r\n                    “We should have had more patience and selected better shots,” Scariolo said, “but you have to give credit to the Pistons. They played good defense and they moved the ball really well.” \n\n\r\n                    Smith felt best about the rebound element of his triple double.\n\n\r\n                    “My thing as of late has been trying to get to the ball and making a play to help us win,” he said. “We were making shots tonight and we kept the energy in the game from start to finish. I think that was the main thing.” \n\n\r\n                    Lee and fellow rookie Isaiah Stewart had two field goals each on a 15-0 run that lifted the Pistons to a 14-point lead early in the second quarter. Lee added six more points on a 15-5 spurt to put Detroit up 101-80 with 11:54 left.\n\n\r\n                    The game was originally scheduled for Tuesday night, but postponed because of the Raptors’ COVID outbreak. Toronto's scheduled Sunday night game against Chicago Bulls also was postponed.\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: F Jerami Grant, who scored more points in his first 33 games as a Pistons than any other player, sat out the game with a quad injury. . . F Josh Jackson (illness) also did not play. . . . The Pistons came into the game with an NBA-leading 41.9 bench points per game.\n\n\r\n                    Raptors: F Yuta Watanabe got his first NBA start, but did not score. . . . G Jalen Harris and F Donta Hall, members of Toronto’s G-League team, were added to the roster for the game. . . Powell fell a point short of his career high.\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: At New York on Wednesday night\n\n\r\n                    Raptors: At Boston on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764996857.4689422
}