{
  "game_id": "0022300137",
  "espn_id": "401584765",
  "date": "Nov 04, 2023",
  "matchup": "HOU vs. SAC",
  "headline": "Brooks has big fourth quarter, scores 26 to lead Rockets over Kings 107-89",
  "body": "HOUSTON -- — Dillon Brooks scored 12 of his 26 points in the fourth quarter to lead the Houston Rockets to a 107-89 win over the Sacramento Kings on Saturday night.\n\n\r\n              It's the second straight win for the Rockets after they opened the season 0-3.\n\n\r\n              A 3-pointer by Malik Monk got the Kings within 3 with about 8 1/2 minutes remaining. The Rockets then went on a 10-2 run, with six points from Brooks, to push the lead to 90-79 midway through the period.\n\n\r\n              Monk made a layup after that, but Brooks hit a 3-pointer seconds later to extend Houston’s lead. Harrison Barnes made one of two free throws for Sacramento before Brooks struck again, making another 3-pointer to extend it to 96-82 with 4 ½ minutes left.\n\n\r\n              He blew a kiss to the crowd before racing down the court to play defense. \n\n\r\n              “We weren’t scoring well, obviously and then, we just looked for a spark somewhere and ... then Dillon just made the hustle plays and effort plays,” Houston coach Ime Udoka said. \n\n\r\n              Monk scored 18 points off the bench to lead the Kings with star De’Aaron Fox out for a second straight game with a sprained right ankle. Domantas Sabonis had 11 points with a team-high 15 rebounds and Harrison Barnes added 13 points for Sacramento. \n\n\r\n              “I thought our resolve was not good, especially in the fourth quarter,\" Sacramento coach Mike Brown said. \"And that’s something that cannot be habitual because that’s what losing teams do and that’s not what we are.”\n\n\r\n              Fred VanVleet scored 21 with 12 assists and Jabari Smith Jr. also had 21 points with 11 rebounds for the Rockets. \n\n\r\n              “Our shots weren't falling in the third quarter, but we relied on our defense and we just stayed with it,” Smith said. \n\n\r\n              The Rockets outrebounded the Kings 53-43 after Udoka pointed out that they ranked last in the league in rebounding entering the game. \n\n\r\n              “I kind of took that personal and I'm sure everybody else did,” Smith said. “And we tried to make an emphasis to rebound and be able to get back in transition to get stops.”\n\n\r\n              Houston led by as many as 17 in the first half. But the Kings used a 10-0 run capped by a 3 from Barnes to go on top 65-64 for their first lead of the game with five minutes left in the third quarter. Houston committed three turnovers in that stretch. \n\n\r\n              Neither team could score for the next couple of minutes until VanVleet made a layup with about three minutes left in the third to snap a Rockets' scoring drought of more than seven minutes. \n\n\r\n              That bucket was the start of an 7-0 run that left Houston up 71-65. But Monk hit a 3-pointer in the final seconds of the quarter to cut the lead to 71-68 entering the fourth.\n\n\r\n              The Kings were disappointed that they fell so far behind early and had to work so hard just to get back into the game.\n\n\r\n              “We got hit in the mouth in the beginning,” guard Davion Mitchell said. “We tried to play catch up (but) they were already in the rhythm. We've just got to do a better job at the beginning of the game.”\n\n\r\n              The Rockets were without rookie Amen Thompson, who sprained his right ankle Thursday night.\n\n\r\n              UP NEXT\n\n\r\n              The teams meet again in Houston on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995644.274345
}