{
  "game_id": "0021601202",
  "espn_id": "400900580",
  "date": "Apr 09, 2017",
  "matchup": "LAL vs. MIN",
  "headline": "D'Angelo Russell sinks game-winning 3 after grandmother dies",
  "body": "LOS ANGELES -- D'Angelo Russell wasn't expecting to play Sunday after the death of his grandmother. The Los Angeles Lakers point guard changed his mind as headed to the arena.\nHe ended up paying the perfect tribute. Russell made a 3-pointer as time expired, and the Lakers overcame a huge game by Karl-Anthony Towns and stunned the Minnesota Timberwolves 110-109 on Sunday night.\n\"I just wanted to win,\" said Russell, who had 16 points. \"Win the game, and winning shot, it's just God putting the cherry on top. The win would have been good enough.\"\nJulius Randle was able to rebound Metta World Peace's missed 3-pointer and find Russell for a second chance. Russell's shot hit the rim, bounced high into the air and through the net, sending the second-year guard sprinting into the crowd trying to find his family.\n\nRussell couldn't locate them, but his basketball family engulfed him in celebration.\n\"You could tell he was hurting,\" Lakers coach Luke Walton said. \"I could tell it was painful for him, and it wasn't easy to talk about, but you could see how much love he had for her when he was speaking about it, which was kind of awesome to see.\"\nTyler Ennis, who had a career-high 20 points off the bench for Los Angeles, which won a season-high fourth consecutive game, didn't know about the death of Russell's grandmother until afterward.\n\"He was encouraging, and as he was playing, I didn't notice it,\" Ennis said. \"I thought he did a good job of locking in. It was a tough, tough day for him. Hopefully, it could brighten his day a little bit.\"\nThe Lakers had to overcome massive outbursts from Towns, who had 40 points on 17-of-22 shooting from the floor and grabbed 21 rebounds, and Andrew Wiggins, who scored 41 points, to hand Minnesota its fourth straight defeat.\nOnly four Minnesota players had scored before Omri Casspi made a layup with 6:43 remaining. Six Lakers finished with double figures.\n\"You get what you deserve, though,\" Timberwolves coach Tom Thibodeau said. \"We didn't rebound the ball at the end.\"\nTIP-INS\nTimberwolves: Gorgui Dieng and Shabazz Muhammad were the only other Minnesota players to score in the first half, as the seven Timberwolves not named Towns and Wiggins were a combined 3-of-18 from the field. ... Towns had his third straight double-double by halftime, with 25 points and 11 rebounds.\nLakers: Demonstrating consistent effort on defense has been a learning process for Los Angeles' young roster, but it showed up here and led to easy offense. The Lakers outscored the Timberwolves 27-16 on fast-break points, including a 16-2 edge in the first half.\nDRAFT DRAMA\nLos Angeles now has the third-worst record in the NBA, moving one game ahead of Phoenix in the win column and leaving them with just under a 50-50 chance to retain their top-three selection in the upcoming draft lottery. If the Lakers' draft pick falls outside the top three, they lose it to Philadelphia, and Orlando would receive their 2019 first-round pick from the Dwight Howard trade.\nNO REPEAT FOR RUBIO\nAfter torching the Lakers for 33 points in their previous meeting and setting season highs with 12 made field goals and 20 attempts from the field, Timberwolves guard Ricky Rubio was a decided nonfactor. Rubio's only bucket was a layup with 2:50 remaining. He missed his first eight shots. Rubio finished with two points and 11 assists.\nFAREWELL WORLD PEACE?\nWalton has seen the entire arc of World Peace's unlikely transformation from the superstar at the center of a near-riot to NBA champion, respected elder statesman and veteran presence. If World Peace is coming toward the end of his time with the Lakers or of his 16-year career as a whole, Walton will make sure World Peace gets his due Tuesday in the team's home finale.\n\"We want to reward Metta every chance we get for how great he's been this year with the way he's worked and the way he's helped the young guys and just being positive,\" Walton said before Sunday's game. \"He'll get his standing O on Tuesday night, whether it is his last game here or not.\"\nWorld Peace, who has spent six seasons with the Lakers across two stints and was part of the 2009-10 title-winning team, has not announced whether he intends to retire.\nUP NEXT\nTimberwolves: Host Oklahoma City on Tuesday. Minnesota has conceded just one triple-double to Russell Westbrook in three meetings this season, and it came in the Timberwolves' lone win over the Thunder on Jan. 13. Westbrook had 21 points, 11 rebounds and 12 assists in Minnesota's 96-86 win, offset by 10 turnovers.\nLakers: Host New Orleans on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995350.493619
}