{
  "game_id": "0022300101",
  "espn_id": "401584729",
  "date": "Oct 30, 2023",
  "matchup": "CHA vs. BKN",
  "headline": "Cam Thomas scores 33, Nets use big 1st quarter to beat Hornets 133-121 for 1st win",
  "body": "CHARLOTTE, N.C. -- — Cam Thomas scored 33 points, and the Brooklyn Nets built a 21-point, first-quarter lead and held on to defeat the Charlotte Hornets 133-121 on Monday night for their first win of the season.\n\n\r\n              Mikal Bridges had 24 points and Lonnie Walker IV and Dorian Finney-Smith each added 19 for the Nets, who shot 56.3% from the field.\n\n\r\n              Terry Rozier had 23 points and rookie Brandon Miller added a career-high 22 points and nine rebounds for the Hornets. Miller, the No. 2 pick in the draft, is averaging 17.3 points in his first three games with the Hornets.\n\n\r\n              The Nets played without Cam Johnson (calf strain) and Nic Claxton (ankle sprain), forcing them to go to a small lineup, but that didn't stop them from dominating the Hornets early.\n\n\r\n              The Hornets' 1-on-1 defense was routinely exposed, as they were unable to defend drives by Thomas, Bridges, Finney-Smith and Walker. LaMelo Ball struggled to cover his man and spent most of the game and fouled out in the fourth quarter.\n\n\r\n              “I think it was just our spacing,” Thomas said. “We played a lot of small ball and a lot of five-out. That opened up a lot of driving lanes for us. The bigs were pulled out and it gave the guards a lot of driving lanes.” \n\n\r\n              Thomas has now scored at least 30 points in each of his first three games for the Nets.\n\n\r\n              He said he's getting comfortable now in his third NBA season, and coach Jacque Vaughn is liking what he's seeing from the forward.\n\n\r\n              “We know he has ability to score the basketball, but it has not been forced,” Vaughn said. “It's been within the flow of the offense. And then at certain times when we need a bucket and he is capable of doing that also. So he is learning how to survey the game and when we need him to score and when he needs to facilitate.”\n\n\r\n              The Hornets surrendered 28 fast-breaks points, which Hornets coach Steve Clifford attributed to poor shot selection.\n\n\r\n              “We took some quick 3s without putting any pressure on the defense, and they got it and were gone,” Clifford said. \"It was definitely the defense, but a lot of that I think was our shot selection early on.” \n\n\r\n              Brooklyn came out of the gates fast, hitting its first eight shots. The Nets led 42-23 after the first quarter after shooting 62.1% from the floor and dominating the glass against the taller Hornets.\n\n\r\n              Miller is the only reason the Hornets remained in the game in the first half. The rookie had 16 points before the break and pinned a shot against the backboard on defense, bringing the home crowd to its feet.\n\n\r\n              Ball struggled the entire game.\n\n\r\n              The only former All-Star on the Hornets roster, Ball finished with eight points on 3-of-12 shooting, missing all six shots from beyond the arc as the Hornets lost their second straight game.\n\n\r\n              Clifford attributed Ball's slow start to the season to missing most of the summer while recovering from a broken ankle. He said he is still behind other players, but is confident he will catch up.\n\n\r\n              The Nets lost guard Spencer Dinwiddle to a sprained ankle in the first half. He played only 13 minutes and scored five points before exiting the game for good. Vaughn said he will be reevaluated on Tuesday.\n\n\r\n              Before the game Vaughn said that Johnson will miss at least 10 days with strained left calf he injured in Game 2.\n\n\r\n              “I had hope (he would be back) but reality set in a little bit,\" Vaughn said. “We ended up getting an MRI, so we are just waiting on those results after the contusion just to be safe. We will reevaluate him in 10 days and see what he looks like from there.\"\n\n\r\n              UP NEXT\n\n\r\n              Nets: Continue a four-game trip at Miami on Wednesday night\n\n\r\n              Hornets: Play their first road game of the season at Houston on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995671.220866
}