{
  "game_id": "0022000953",
  "espn_id": "401307756",
  "date": "Apr 30, 2021",
  "matchup": "MEM vs. ORL",
  "headline": "Brooks has 20 as poor-shooting Grizzlies defeat Magic 92-75",
  "body": "MEMPHIS, Tenn. -- — Dillon Brooks scored 20 points, Jonas Valanciunas added 14 points and 15 rebounds, and the Memphis Grizzlies beat the Orlando Magic 92-75 on Friday as both teams shot poorly.\n\n\r\n                    Kyle Anderson contributed 13 points for the Grizzlies, who shot 34.3% from the field but snapped a two-game losing streak.\n\n\r\n                    Memphis outscored Orlando 36-15 in the third quarter to take control. The Grizzlies never let their advantage drop under double digits in the fourth as the lead reached as high as 24.\n\n\r\n                    “I thought we had tons of good looks in the first half,” Memphis coach Taylor Jenkins said. “Wide-open 3s. Finishes in the paint. All shots that we normally finish. And for 48 minutes outside of that third quarter, it was a challenge.\n\n\r\n                    “They just weren’t falling at the rate that you would expect or hope for.”\n\n\r\n                    Cole Anthony and Mo Bamba led the short-handed Magic with 15 points each. Bamba also had 11 rebounds. R.J. Hampton finished with 11 points for Orlando, which shot 31.4% and fell even with idle Detroit at the bottom of the Eastern Conference.\n\n\r\n                    Acting Magic coach Ty Corbin said his team has been forced to use a lot of young players who aren’t accustomed to the grind of an NBA season, especially when they are out of playoff contention. He said the key is handling “the physicality of it, the mental part of it, and playing through being tired.”\n\n\r\n                    “I think we kind of let it get the best of us a little bit in that third quarter,” Corbin said. “That third quarter was just too much to overcome.”\n\n\r\n                    Memphis held onto its eighth-place spot in the West and gained a game on the San Antonio Spurs, who lost a 143-140 overtime thriller at Boston.\n\n\r\n                    The Grizzlies get another crack at the Magic Saturday night in Orlando.\n\n\r\n                    After a terrible first half of shooting, Memphis finally got its offense rolling in the third quarter, using a 25-4 run to build a 66-54 advantage.\n\n\r\n                    The Magic had seven turnovers in the third during Memphis' run. The Grizzlies played much better defense than they did in losses to Denver and Portland.\n\n\r\n                    “I feel like it is human nature to have a few good defensive games and then kind of let your guard up,” Anderson said. “Kind of slack off. I think we were locked in mentally this game and wanted to do well on defense so we could get out and run and play our game on offense.”\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Seven players were out with injuries, including Chuma Okeke, who suffered a left ankle sprain in Wednesday’s game against Cleveland. ... Coach Steve Clifford has been out since Sunday under COVID-19 protocol. ... The Magic fell to 9-21 on the road. ... Donta Hall had 11 rebounds.\n\n\r\n                    Grizzlies: G Grayson Allen was not available after injuring his left hand in Wednesday’s loss to Portland. ... Rookie Desmond Bane started alongside Ja Morant at guard. ... Memphis’ reserves were 2 of 18 from the field in the first half. ... Valanciunas recorded his 42nd double-double of the season.\n\n\r\n                    SCOREBOARD WATCHING\n\n\r\n                    Anderson said there is a different intensity to this portion of the season as teams battle for playoff berths and position.\n\n\r\n                    “It’s a total different game than the beginning of the season. Guys are coming ready to play for 48 minutes. We’re kind of catching on to that,” he said.\n\n\r\n                    FINAL WORD\n\n\r\n                    Jenkins: “We’ve got to take every game seriously and move forward, especially this time of year.\"\n\n\r\n                    UP NEXT\n\n\r\n                    The home-and-home series concludes Saturday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996921.0044029
}