{
  "game_id": "0021600872",
  "espn_id": "400900278",
  "date": "Feb 25, 2017",
  "matchup": "HOU vs. MIN",
  "headline": "Harden leads Rockets past Timberwolves in 142-130 shootout",
  "body": "HOUSTON --  Rockets coach Mike D'Antoni wasn't exactly thrilled with his team's shootout win over the Minnesota Timberwolves on Saturday night.\n\n\"I didn't think we played very good,\" said D'Antoni, disappointed by his club's defensive effort as both squads set season scoring highs in Houston's 142-130 victory.\n\n\"Defense is all about battle, heart and just following the schemes and we just -- sometimes, we have breakdowns,\" he added. \"It's unbelievable and we've got to get better.\"\n\nJames Harden, who led Houston with 24 points and 10 assists, also acknowledged the defense could have been better.\n\n\"We scored the ball at a high clip tonight, which is going to be most nights, but we just let up defensively,\" Harden said. \"We gave them some confidence -- and they made shots -- and gave up offensive rebounds. But other than that, we played well.\"\n\nHouston won for the sixth time in seven games, handing the Timberwolves their first road loss in more than three weeks.\n\nRyan Anderson had a much more optimistic take on the victory.\n\n\"You can nitpick, but a win is tough in the NBA so we're happy,\" Anderson said. \"Obviously, we don't want to give up 130 points. ... It comes down to winning, and we just need to keep having that winning mentality.\"\n\nMinnesota committed a season-high 25 turnovers that led to 38 points for the Rockets.\n\n\"I thought our turnovers hurt us, thought our rebounding was good, our scoring was good,\" Timberwolves coach Tom Thibodeau said.\n\nPlaying against Houston's guard-heavy rotation, Minnesota went inside all night and outscored the Rockets 68-44 in the paint. Karl-Anthony Towns had 37 points and 22 rebounds, and Andrew Wiggins added 30 points.\n\nTowns spent more than 30 minutes after the game in the Rockets' weightlifting facility.\n\n\"Today was one of those days where I was a little extra mad,\" he said. \"I wanted to come out with the W. We didn't, so I took some frustration out on my body to get ready for the next game. There's no time to be pouty and everything. I've got to continue to work. I've got to continue to stick to the plan.\"\n\nThe Timberwolves were ultimately outpaced by the hot-shooting Rockets. Houston went 22 for 58 (37.9 percent) from beyond the arc, thanks in part to the franchise's first 3-point champion.\n\nShooting guard Eric Gordon was given a warm ovation after a short first-quarter video showed highlights of his victory in the 3-point contest during All-Star weekend. Coming off the bench, Gordon made his first two attempts from outside the arc and finished 4 for 10 from long range. He had 14 points.\n\nNewly acquired Lou Williams made his home debut for the Rockets. After scoring 27 points on 7-of-11 shooting from 3-point territory in New Orleans on Thursday night, Williams had 17 points in 25 minutes. Houston traded Corey Brewer and a first-round draft pick to the Lakers for Williams on Tuesday.\n\n\"I'm trying to get acclimated and learning on the fly,\" Williams said. \"I'm more excited than nervous.\"\n\nWilliams and Gordon lead the NBA in points off the bench.\n\nRicky Rubio had 14 points and 11 assists for Minnesota.\n\nTIP-INS\n\nTimberwolves: Gorgui Dieng had his 11th double-double of the season with 16 points and 13 rebounds. ... Shabazz Muhammad and Nemanja Bjelica both scored in double figures off the bench with 11 and 10 points, respectively.\n\nRockets: After initially being ruled out with a groin injury, guard Patrick Beverley had 15 points, seven assists and three steals in 29 minutes. He received a technical foul after shoving Rubio following a whistle in the third quarter. ... Anderson scored 18 points, going 4 for 13 from 3-point range.\n\nWIGGINS ON OFFICIATING\n\nAfter Thibodeau said he thought Wiggins was fouled on a play with less than a minute remaining, Wiggins also acknowledged he was frustrated by the no-call.\n\n\"I think it was a horrible no-call, to be honest,\" Wiggins said. \"I feel like I got bumped. Someone leans into me and I fall, obviously, you're supposed to get a call. But you can't make all the calls.\"\n\nUP-AND-COMERS\n\nAfter combining for 67 points, Towns and Wiggins spoke highly of each other and the strides they've made this season as a scoring tandem.\n\n\"We've got the best chemistry we've ever had right now, and that's just working with each other and learning with each other,\" Towns said. \"There are things I wish I could do that Andrew Wiggins can do. When you're passing and watching him do his work, it's an amazing sight.\"\n\nUP NEXT\n\nTimberwolves: Visit the Sacramento Kings on Monday.\n\nRockets: Host the Indiana Pacers on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995752.838867
}