{
  "game_id": "0021600442",
  "espn_id": "400899884",
  "date": "Dec 23, 2016",
  "matchup": "CHI @ CHA",
  "headline": "Batum has triple-double, Hornets top frustrated Bulls 103-91",
  "body": "CHARLOTTE, N.C. -- Triple-doubles, flying elbows, two ejections and a revved-up crowd cheering until the end.\nEven Michael Jordan was there sitting courtside.\nIt may only be December, but Friday night's game between the Charlotte Hornets and Chicago Bulls had all of the intensity of a postseason game.\nNic Batum had 20 points, 11 rebounds and 10 assists for his first triple-double of the season, and the Hornets beat the Bulls 103-91 for their third straight victory.\n\"That was like a playoff game tonight,\" Batum said. \"The crowd was into it and it was a good team in front of us. That's a great game for us to get a win against.\"\nIt didn't come easily.\nCharlotte had to hold off the Bulls in the fourth quarter in a game that ended with Robin Lopez and Taj Gibson getting ejected.\nThe normally mild-mannered Lopez could face a suspension from the league after he simultaneously elbowed Cody Zeller and Marvin Williams in the face -- using both elbows -- with 38 seconds left and the outcome already decided. Gibson, who had picked up a technical foul for arguing a call earlier in the fourth quarter, got his second and was ejected when he debated the call.\nAfter watching the replay, referees sent Lopez to the locker room with a flagrant 2 foul.\nLopez wouldn't say exactly what set him off.\n\"It was pretty contentious out there. We had tempers flare,\" Lopez said. \"Basketball is a passionate game and I play with passion.\"\nGibson was more outspoken.\n\"They can't let the game get out of hand like that,\" Gibson said of the referees. \"Guys are throwing elbows and throwing cheap shots. That's what I said, `They got to do a better job.\"\nKemba Walker chipped in with 20 points, and Michael Kidd-Gilchrist had 12 points, nine rebounds and four blocked shots for Charlotte (17-13).\nThe Hornets had a crucial four-point swing go their way with 3 minutes left when Batum hustled down the floor to block the 7-foot Lopez's layup off a fast break. Walker then converted a reverse layup on the other end.\nDespite the efforts of Jimmy Butler, who drained back-to-back jumpers, the Bulls could never quite claw back in it after that.\nTIP-INS\nBulls: Dwyane Wade played despite battling a migraine headache most of the day and had 12 points on 5-of-16 shooting. ... Chicago outrebounded the Hornets 52-48.\nHornets: Marco Belinelli left the game in the second quarter with a sprained left ankle and did not return. He hopped on one foot to the locker room after coming down wrong on his foot. ... Before the game, Bulls coach Fred Hoiberg called Walker one of the best guards in the NBA, saying, \"he's a guy that can take over games at any time. He can get into the paint. He does a great job getting into the bigs' bodies, keeping them off, where he can finish at the rim.\"\nBLOCK PARTY\nThe Hornets held the Bulls to 39.6 percent shooting and blocked a season-high 13 shots.\n\"I thought we started the game with the right attitude, right approach, right physicality,\" Hornets coach Steve Clifford said. \"Our rebounding and our defense in the first half was really good. Second half, they hurt us some on the offensive glass, but our guys made a lot of good plays\nBUTLER STAYS HOT\nJimmy Butler had 26 points for the Bulls (14-15), who have lost five of their last six to fall below .500 for the first time this season. Butler has scored at least 20 points in 24 of the team's 29 games this season.\nTOUGH STRETCH AHEAD\nThe Hornets have a tough stretch coming up, including a home game against the Cleveland Cavaliers.\n\"Once we got back from our road trip we said we need to find a new intensity and I think we've done that these last few games and hopefully it keeps going,\" said forward Frank Kaminsky.\nUP NEXT\nBulls: Chicago will travel to San Antonio for a Christmas day matinee game against the San Antonio Spurs.\nHornets: Head to Brooklyn on Monday to face the Nets. Charlotte has lost four of its last five games on the road.",
  "source": "espn_api",
  "crawled_at": 1764995073.2276301
}