{
  "game_id": "0022300281",
  "espn_id": "401584909",
  "date": "Dec 02, 2023",
  "matchup": "CHA vs. MIN",
  "headline": "Towns scores 28, Gobert has season-high 26 and Timberwolves beat Hornets 123-117",
  "body": "CHARLOTTE, N.C. -- — Karl-Anthony Towns scored 28 points, Rudy Gobert had a season-high 26 and grabbed 12 rebounds, and the Minnesota Timberwolves finished strong to beat the Charlotte Hornets 123-117 on Saturday.\n\n\r\n              Charlotte led by four with 4:53 remaining before Towns and Gobert combined to score eight points in a 13-3 surge that put the Timberwolves ahead 115-109 with 2:02 left. Charlotte would get no closer than three the rest of the way.\n\n\r\n              Gobert, who was listed as questionable with a hip injury, hadn’t scored more than 17 points in a game this season.\n\n\r\n              “That’s one of the best games I’ve ever seen from a man who’s questionable,” Towns said. “It’s just amazing to see him play knowing he’s in pain and playing hurt. The way he came out today, I give a huge shout out to him.”\n\n\r\n              Minnesota improved the best record in the Western Conference to 15-4. Naz Reid scored 23 points and Mike Conley finished with 14 points and 10 assists.\n\n\r\n              The Timberwolves scored the game’s first 10 points and led by 12 in the first quarter before Charlotte narrowed it to 88-87 after three.\n\n\r\n              Minnesota appeared to face adversity when Towns was whistled for three fouls in a 1:48 stretch early in the second quarter. But Reid came off the bench and Minnesota didn’t miss a beat.\n\n\r\n              “Naz gave us a huge lift off the bench,” Timberwolves coach Chris Finch said. “KAT has been in foul trouble a little bit here and there but he’s done a good job of being focused and playing a clean game when he goes back in.”\n\n\r\n              Terry Rozier scored 23 points and Miles Bridges had 22 for the Hornets. P.J. Washington added 18, Gordon Hayward had 17 and rookie Brandon Miller 14.\n\n\r\n              Hornets Steve Clifford wasn't helped by the officials while trying to battle the 7-foot, 240-pound Towns and 7-1, 265-pound Gobert.\n\n\r\n              “They shot 30 free throws — and they’re fouls,” Clifford said. “I would take that crew (of Gediminas Petraitis, JB DeRosa and Marut Kogut) every night, but I’ll be honest, we did not get a good whistle and I don’t usually say that.\n\n\r\n              “The 50-50 calls all went against us, to me, in the second half. I told one of the officials that after the game. I respect all three of them and I think they’re good together; we got the short end of the stick tonight. That happens. But that’s not why we lost. We lost because we’re not physical enough, we get outworked on the glass, we foul.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host San Antonio on Wednesday.\n\n\r\n              Hornets: At Chicago on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995986.889617
}