{
  "game_id": "0022400254",
  "espn_id": "401704820",
  "date": "Nov 20, 2024",
  "matchup": "HOU vs. IND",
  "headline": "Sengun scores season-high 31 as Rockets cruise to 130-113 win over Pacers",
  "body": "HOUSTON -- — Alperen Sengun had a season-high 31 points with 12 rebounds to lead the Houston Rockets to a 130-113 win over the Indiana Pacers Wednesday night.\n\n\r\n              The Rockets used a big run in the third quarter to push the lead to 21 entering the fourth and cruised to their sixth victory in seven games. \n\n\r\n              Jabari Smith Jr. added 23 points for the Rockets for his second 20-point game in the last four, and Fred VanVleet had 18 points and six assists.\n\n\r\n              Quenton Jackson had a career-high 24 points on 10-of-12 shooting for the Pacers, who lost for the fourth time in five games. Pascal Siakam had 19 points at halftime but only scored two more points the rest of the way.\n\n\r\n              Takeaways \r\n              Pacers: If Indiana is going to be successful this season, Tyrese Haliburton must be more effective. The two-time All-Star was 1 of 7 for four points after making just 5 of 18 shots against the Raptors on Monday.\n\n\r\n              Rockets: Houston has gotten off to a strong start this season thanks to a balanced scoring attack. The Rockets had five players in double figures as they improved to 11-5.\n\n\r\n              Key moment \r\n              A dunk by Myles Turner got the Pacers within three with about eight minutes left in the third quarter before the Rockets used a 12-3 run, with 3s from VanVleet and Sengun, to make it 82-70 less than three minutes later.\n\n\r\n              Key stat \r\n              The Pacers made just 5 of 22 3-pointers, while Houston made 12 of 36 attempts.\n\n\r\n              Up next \r\n              The Rockets host the first of consecutive games against Portland on Friday night, the same night the Pacers visit Milwaukee.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997408.335648
}