{
  "game_id": "0022200214",
  "espn_id": "401468369",
  "date": "Nov 16, 2022",
  "matchup": "ATL vs. BOS",
  "headline": "Celtics claim 8th straight win, beat Hawks 126-101",
  "body": "ATLANTA -- — The Boston Celtics were missing two key members of their rotation.\n\n\r\n              There was no shortage of players to fill the void.\n\n\r\n              Jaylen Brown scored 22 points to lead a balanced attack and the East-leading Celtics stretched their winning streak to eight with a 126-101 victory over the Atlanta Hawks on Wednesday night.\n\n\r\n              The Celtics were missing injured guards Marcus Smart and Malcolm Brogdon. It hardly mattered.\n\n\r\n              Led by Brown, the Celtics put seven players in double figures. Jayson Tatum had 19, Grant Williams 18, Derrick White 16, Sam Hauser and Luke Kornet 15 apiece, and Payton Pritchard 14.\n\n\r\n              White also had 10 assists, Kornet went 7 of 7 from the field, and Hauser did all his scoring on a 5-of-6 performance from 3-point range.\n\n\r\n              “We've got a lot of guys who can do a lot of things to help us win games,” White said. “We trust every person on this roster. When they come in, they do good things for us. It's a long season, there's gonna be injuries, people out. We're gonna need everybody.”\n\n\r\n              The Hawks were coming off a big win at Milwaukee and eager to show they could challenge the best in the conference.\n\n\r\n              Not on this night.\n\n\r\n              Boston took control in the first quarter against the cold-shooting Hawks, whose occasional spurts were quickly snuffed out by the Celtics' stifling defense.\n\n\r\n              Trae Young led the Hawks with 27 points, but was held to 10-of-23 shooting, including a mere 2 of 7 from beyond the arc. \n\n\r\n              Shooting has been a problem for the Hawks early in the season — quite a change from their high-scoring offense of a year ago.\n\n\r\n              “We thinking about it too much,” Young said. “It's just a matter of going out there and playing, playing free, getting back to playing with confidence.\"\n\n\r\n              Even without two key members of their rotation, the Celtics shot 54.5% from the field and knocked down 21 3-pointers.\n\n\r\n              Since a loss to Golden State in last season's NBA Finals, Boston's backups have been eager to make up for a poor showing by the bench and a perceived lack of depth.\n\n\r\n              “It gets a little fire going,” Hauser said. “Everyone has kind of taken it personal a little bit.”\n\n\r\n              The Hawks got a glimpse of what this game would be like in the very first quarter. They connected on just 8 of 24 shots, missing all six of their attempts beyond the 3-point stripe, and quickly fell into a double-digit hole.\n\n\r\n              The Celtics led by as many as 16 points before the Hawks shaved into the deficit, trailing 62-53 at halftime. But Boston regained control in the third quarter and turned it into a total blowout down the stretch.\n\n\r\n              WHITE VS MURRAY\n\n\r\n              White, who was traded from San Antonio to the Celtics last February, got his first chance to go against former teammate Dejounte Murray.\n\n\r\n              The Hawks acquired Murray from the rebuilding Spurs over the summer. He had 19 points against the Celtics.\n\n\r\n              “I've got a lot of love for him,” White said. “I know he's an ultimate competitor. I wanted to compete right back him.” \n\n\r\n              TIP-INS\n\n\r\n              Celtics: Brogdon missed his fourth straight game with an ailing right hamstring, while Smart was ruled out with right ankle inflammation. ... Former Hawks C Al Horford led the Celtics with 11 rebounds.\n\n\r\n              Hawks: Young made his 294th career start, tying Paul Millsap for 17th on the franchise career list. ... Atlanta was held to 18 points in the first quarter, its second-lowest output in a period this season. The Hawks managed only 17 points in the second quarter of a Nov. 10 game against Philadelphia.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At New Orleans on Friday night.\n\n\r\n              Hawks: At Toronto on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995209.701181
}