{
  "game_id": "401810198",
  "espn_id": "401810198",
  "date": "Dec 05, 2025",
  "matchup": "NY vs UTAH",
  "headline": "Knicks jump out to a 23-0 lead and rout the Jazz 146-112",
  "body": "NEW YORK -- — Jalen Brunson scored 33 points, including a 3-pointer that capped the Knicks' opening 23-point run — the largest in the NBA since detailed play-by-play for all four quarters began in 1997 — and New York beat the Utah Jazz 146-112 on Friday night.\n\n\r\n              Deuce McBride was 7 for 10 from 3-point range and added 22 points for the Knicks, who didn't allow a point until the first quarter was more than half over. Karl-Anthony Towns had 18 points and nine rebounds in the Knicks' highest-scoring game of the season. \n\n\r\n              The Knicks got starting forward OG Anunoby back from a nine-game absence due to a left hamstring injury, then made sure he or any other starter wouldn't need to play too many minutes.\n\n\r\n              Anunoby, wearing a black sleeve on his left leg, finished with 11 points in 22 minutes. Jordan Clarkson, who won the NBA's Sixth Man of the Year award while playing for Utah, had 16 points in a game the Knicks led by as many as 41 points. \n\n\r\n              Lauri Markkanen and Keyonte George each scored 18 points for the Jazz, who won beat the Nets 123-110 on Thursday night in Brooklyn and were seeking their first three-game winning streak of the season. Those hopes ended quickly.\n\n\r\n              Brunson's 3-pointer made it 23-0 with 5:53 remaining in the first quarter. The Jazz missed their first 12 shots before George finally got them on the scoreboard when he converted a three-point play with 5:27 left. \n\n\r\n              The Knicks led 41-13, and the 28-point advantage their largest after one quarter in the play-by-play era. It was the second time this season that the Jazz trailed by 28 going into the second quarter. The Minnesota Timberwolves led 43-15 in their 137-97 victory on Nov. 7. \n\n\r\n              Up next\r\n              Jazz: Host Oklahoma City on Sunday.\n\n\r\n              Knicks: Host Orlando on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042759.067701
}