{
  "game_id": "0022000357",
  "espn_id": "401267517",
  "date": "Feb 06, 2021",
  "matchup": "MIL @ CLE",
  "headline": "Antetokounmpo scores 24 as Bucks bury Cavaliers 124-99",
  "body": "CLEVELAND -- — Giannis Antetokounmpo had 24 points and 11 rebounds, Jrue Holiday scored 20 and the Milwaukee Bucks beat the Cleveland Cavaliers for the second time in two days, 124-99 on Saturday night.\n\n\r\n                    Khris Middleton added 20 points and Bryn Forbes had 18 on 6-of-6 shooting from 3-point territory for the Bucks, who broke open the game with a 42-18 run spanning the third and fourth quarters and won their fourth in a row.\n\n\r\n                    “We pushed it to the limit and had a lot of baskets in transition, which makes it hard for teams that are trying to come back,” Holiday said. “It’s all good. We’re building that confidence and trust with each other. It’s about hard work, playing hard and playing smart.”\n\n\r\n                    Milwaukee began its six-game road trip Friday, when Antetokounmpo had 33 points and 12 boards in a 123-105 victory at Cleveland. The Bucks didn’t arrive in Northeast Ohio until the afternoon due to mechanical issues on their team plane.\n\n\r\n                    “You just have to adapt, especially with the season and the year that we’re having,” Holiday said. “I think we’re doing a good job with it.”\n\n\r\n                    Andre Drummond paced the Cavaliers with 28 points and 11 rebounds, and Collin Sexton scored 17. Cleveland completed a stretch of four home games in six days, winning once, and has lost seven of its last nine overall.\n\n\r\n                    “Cleveland has beaten some good teams and Sexton is playing really well, so I’m pleased that we could come in here and win two games,” Bucks coach Mike Budenholzer said. “As we continue on the road, this is something to build on.”\n\n\r\n                    Milwaukee went ahead for good late in the first and took its largest lead at 122-92 on a floater by Jaylen Adams with 3:16 left in the fourth. Holiday finished with eight assists and Antetokounmpo had five.\n\n\r\n                    Darius Garland had 17 points and nine assists for Cleveland. Drummond made 12 of 17 shots and was 4 of 5 from the foul line, while Taurean Prince had 12 points off the bench.\n\n\r\n                    “Defensively, we’ve started taking breaks, so we’ve got to get back to basics,” Drummond said. “But we’re not going to hang our heads after this loss because we’re still in the fight and trying for a playoff position.”\n\n\r\n                    Milwaukee held a 59-54 advantage at halftime thanks to 14 points and six assists from Holiday. Drummond and Sexton each scored 13 points for Cleveland as the teams combined to shoot 54.3%.\n\n\r\n                    OFF THE MARK\n\n\r\n                    Drummond owns a career-low .477 field goal percentage and had gone five games without making more than half his shots. Cavaliers coach J.B. Bickerstaff accepted some blame for Drummond’s inefficiency. “We have to diversify his package and make him more difficult for defenses to find,” Bickerstaff said. Drummond also slipped to second in the NBA in rebounding behind Atlanta’s Clint Capela during his offensive slump.\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: G D.J. Augustin attempted Milwaukee’s first free throw 61 seconds into the second quarter. … Budenholzer declined to rest any players or implement minutes restrictions in the second half of the back-to-back set. .. All three rookies are on G-League assignments with different teams: F Mamadi Diakite (Lakeland), G Sam Merrill (Memphis) and F Jordan Nwora (Salt Lake City).\n\n\r\n                    Cavaliers: Sexton has 55 consecutive double-figure scoring games, the ninth-longest active streak in the NBA. … Rookie F Isaac Okoro played 14 minutes in the first half without recording a statistic. … F Kevin Love (right calf strain) missed his 22nd straight game, but worked out on the court before the arena gates opened. The five-time All-Star last played on Dec. 27 against Philadelphia.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: At Denver on Monday. Milwaukee lost both games against the Nuggets by double-digit margins last season and is 9-40 all-time in the Mile High City.\n\n\r\n                    Cavaliers: At Phoenix on Monday. Cleveland begins a five-game trip and won’t return to Rocket Mortgage FieldHouse until Feb. 17 against San Antonio.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997404.053042
}