{
  "game_id": "0022200764",
  "espn_id": "401468919",
  "date": "Jan 31, 2023",
  "matchup": "MIA @ CLE",
  "headline": "Jimmy Butler scores 23 as Heat hold off Cavaliers 100-97",
  "body": "CLEVELAND -- — Jimmy Butler scored 23 points, Bam Adebayo added 18 points and 11 rebounds and the Miami Heat showed their experience down the stretch in a 100-97 win over the Cleveland Cavaliers on Tuesday night.\n\n\r\n              Caleb Martin scored 18 points and matched his career high with 10 rebounds, and Tyler Herro also scored 18 for the Heat, who moved within 1 1/2 games of the fifth-place Cavs in the Eastern Conference standings.\n\n\r\n              After 45 up-and-down minutes, the Heat made key plays when it mattered most.\n\n\r\n              “When it gets to the last three of four minutes, because of the experiences we’ve had, guys feel comfortable enough to execute under that kind of pressure,” Miami coach Erik Spoelstra said.\n\n\r\n              Cavs coach J.B. Bickerstaff said Miami's maturity was the difference.\n\n\r\n              “That's why they are who they are,” he said.\n\n\r\n              Butler, who has been slowed by injuries for much of the season, hit a short jumper to put the Heat up 98-93 with 1:23 left, and his free throw — following a huge offensive rebound by Adebayo — kept the Heat ahead by five with 12 seconds left.\n\n\r\n              Darius Garland's 3-pointer brought the Cavs within 99-97 with 8.7 seconds remaining. Cleveland fouled Butler with 7.3 seconds left, and he split his free throws, giving Cleveland a chance to tie.\n\n\r\n              All-Star starter Donovan Mitchell rushed the ball up the floor but his contested 3-pointer at the buzzer was short.\n\n\r\n              “They know who to key in on at that point,” Bickerstaff said. “But I thought (Mitchell) did a great job of creating separation and getting a shot off. I thought we got as good a look as we can at that point.”\n\n\r\n              Butler was most pleased by Miami's defense in the closing minutes.\n\n\r\n              “We still had lapses, but I'm glad those lapses did not cost us the game,” he said. “We got stops down the stretch when we needed to.”\n\n\r\n              Evan Mobley scored 19 points, Mitchell had 16 and Jarrett Allen added 14 points and 11 rebounds for the Cavs, who dropped to 21-6 at home.\n\n\r\n              Mitchell and Darius Garland were a combined 4 of 19 on 3-pointers.\n\n\r\n              The NBA's top-rated defensive team, the Cavs came out looking to make everything difficult for the Heat offensively.\n\n\r\n              Miami had no early answers and started 2 of 10 from the floor with five turnovers in the first five minutes, but Butler scored 11 points in the quarter while helping his teammates settle in.\n\n\r\n              “We were disjointed at the beginning of the game, and I think Jimmy sensed that and went to work,” Spoelstra said.\n\n\r\n              HEAT CHECK\n\n\r\n              Miami has been one of the league's steadiest franchises, missing the playoffs just three times since 2008. \n\n\r\n              It's a model Cleveland would like to follow.\n\n\r\n              Bickerstaff admires both the Heat's consistency and ability to adapt. He credits Miami president Pat Riley and Spoelstra for leading the way.\n\n\r\n              “They have a philosophy and are flexible enough to change with the times and keep people wanting to be a part of it,\" he said. “They have core values they believe in and then they do a great job of acquiring talent but finding talent in the cracks.\n\n\r\n              “Their best players aren’t always No. 1 picks. They have been able to work free agency, G League, later draft picks and turn it into talent because their player development staff is so good.”\n\n\r\n              TIP-INS\n\n\r\n              Heat: Butler and Adebayo will likely be named All-Star reserves when the rosters are announced Thursday. Butler has been an All-Star six times, while Adebayo has only been selected once. ... Adebayo has scored in double figures in all 47 games this season, and 63 in a row dating to last season. Only Alonzo Mourning, Dwyane Wade and LeBron James have had longer streaks in team history.\n\n\r\n              Cavaliers: G Ricky Rubio had eight points, five rebounds and five assists in 17 minutes. He's beginning to look more comfortable after returning from knee surgery. ... Kevin Love (back spasms) sat out his fourth consecutive game. ... Mobley was chosen to play in the 2023 Jordan Rising Stars at All-Star Weekend in Salt Lake City later this month.\n\n\r\n              UP NEXT\n\n\r\n              Heat: At New York on Thursday.\n\n\r\n              Cavaliers: Host Memphis on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993949.765006
}