{
  "game_id": "0022000412",
  "espn_id": "401267572",
  "date": "Feb 12, 2021",
  "matchup": "DET @ BOS",
  "headline": "Bey scores 30, hits 7 3s to lead Pistons past Boston 108-102",
  "body": "BOSTON -- — Saddiq Bey scored 30 points, hitting his seventh 3-pointer with 39 seconds to play after Boston cut a 13-point fourth-quarter lead to three, and the Detroit Pistons held on to beat the Celtics 108-102 on Friday night. \n\n\r\n                    Bey also had 12 rebounds and went 7 for 7 from 3-point range, including the shot that gave Detroit a 101-95 cushion in the final minute. The points, rebounds and seven 3s were all career highs for the rookie from Villanova, who was the 19th overall pick in the draft. \n\n\r\n                    \"Really proud for him,” Pistons coach Dwane Casey said. “He’s just scratching the surface. He needs to stay humble, stay working, and he is. As a matter of fact, he’s getting a workout in right now.”\n\n\r\n                    The last-place Pistons (7-19) have beaten Boston (13-12) twice and also have wins against the Lakers, Nets, 76ers and Suns — all teams above .500.\n\n\r\n                    Jayson Tatum scored 33 points with 11 rebounds and seven assists for the Celtics, and Jaylen Brown added 27 points. \n\n\r\n                    “We are so inconsistent,\" Celtics coach Brad Stevens said. \"There is a big difference between being capable and consistent in this league, and we aren’t there yet.”\n\n\r\n                    The Celtics led by 10 early but gave up 11 straight points and Detroit took a 27-23 lead into the first break. The Pistons led by as many as 13 early in the fourth before the Celtics began chipping away, cutting it to 95-93 with just over two minutes left. \n\n\r\n                    But Josh Jackson made a 3-pointer and, after Tatum's layup, Bey made a 3 to protect the lead.\n\n\r\n                    “I’m more happy about the win,\" he said. \"It’s just a blessing to be able to play this game every day for a living.”\n\n\r\n                    THAT SMARTS\n\n\r\n                    Celtics guard Marcus Smart told reporters before the game that he is making progress toward a return from the torn left calf that has kept him out of the last seven games. Although he is walking with a slight limp, he has been able to do a light jog and some basketball movements.\n\n\r\n                    “My body is definitely healing the way we expected it to,” said Smart, who was projected to miss 2/3 weeks after the Jan. 31 injury. “But it’s definitely going to take some time.”\n\n\r\n                    Smart said the injury did not occur because of the contact with Lakers forward Montrezl Harrell underneath the basket. Instead, he felt a pair of pops in his leg when he planted and again when he stepped to jump. \n\n\r\n                    “That (second) pop sent this burning sensation down my whole leg,” he said. “It still hurts like hell but I’m blessed it’s not anything else.”\n\n\r\n                    HAPPY BIRTHDAY\n\n\r\n                    Hall of Famer Bill Russell turned 87 on Friday, prompting a tribute from the team. \n\n\r\n                    “He is everything you want to be represented by,” Stevens said. \"When you think about his impact on and off the court, he’s in very rarefied air. And I can’t think of a better representative of our sport or the Celtics.”\n\n\r\n                    Russell tweeted a video of himself blowing out the candles on his birthday cake. Earlier in the day, he engaged with some friendly trash-talking by responding to a post lauding Tom Brady (seven championships) and Michael Jordan (six) for their success.\n\n\r\n                    “(You're) getting closer,” the 11-time NBA champion tweeted.\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: According to ESPN, Bey is the first rookie in NBA history to make at least seven 3-pointers in a game without a miss. ... Both teams were playing the second night of a back-to-back, and both wound up splitting. ... F Blake Griffin drew three charging fouls. ... Mason Plumlee missed his second straight game with a sore right elbow. \n\n\r\n                    Celtics: PG Kemba Walker skipped the second game to rest his recovering left knee. ... A day after scoring a career-high 24 points, Celtics forward Semi Ojeleye limped off the court in the third period favoring his right knee and did not return. \n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Host the New Orleans Pelicans on Sunday.\n\n\r\n                    Celtics: Visit the Washington Wizards on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997917.4513211
}