{
  "game_id": "0021801219",
  "espn_id": "401071892",
  "date": "Apr 09, 2019",
  "matchup": "LAL vs. POR",
  "headline": "Harkless' 3 sends Blazers past LA 104-101 after Magic quits",
  "body": "LOS ANGELES --  After Magic Johnson shockingly quit his job as the Lakers' president of basketball operations right before the game, the Lakers certainly didn't play like a franchise in turmoil.\n\nMaurice Harkless and the Portland Trail Blazers snared a huge win anyway.\n\nHarkless hit a corner 3-pointer at the buzzer, and the Trail Blazers secured home-court advantage in the first round of the playoffs with a 104-101 victory Tuesday night after Johnson's abrupt resignation.\n\nJohnson stunned the Lakers with his announcement about 90 minutes before tipoff of the last game in the team's sixth consecutive losing season. The Hall of Fame guard had been in charge of the Lakers for just 26 months, and his departure throws the 16-time NBA champion franchise's offseason into upheaval even before it began.\n\nYet the Lakers nursed a fourth-quarter lead against the Blazers, who needed this victory much more. After Harkless tied it on a layup with 33 seconds left and Seth Curry stole the ball from Alex Caruso, Damian Lillard and C.J. McCollum got the ball down to Harkless, who didn't miss.\n\n\"Mo had been scoring and hitting shots the whole quarter,\" said Lillard, who finished with 20 points and eight assists. \"He's had a lot of moments when he came up big for us. The way he rose up and took that shot showed a lot of confidence, and you see what the result was.\"\n\nHarkless scored 26 points and Enes Kanter had 22 points and 16 rebounds while the Blazers rallied in the fourth quarter to claim their 52nd win of the season. The Blazers wrapped up home court for their first-round series against the Utah Jazz -- or against another opponent if they can sneak into the third seed on Wednesday.\n\nPortland has won 13 of 16 in its surge to a sixth consecutive playoff berth.\n\nKentavious Caldwell-Pope scored 32 points and Mike Muscala added 16 for the Lakers, who have missed the playoffs in a franchise-record six consecutive seasons. Caruso capped his incredible late-season surge with 12 points and 13 assists, but the Lakers fell just short.\n\n\"Hats off to the Lakers,\" Portland coach Terry Stotts said. \"They ended their season three really good games. They made more hustle plays than we did.\"\n\nMost of the Lakers heard about Johnson's resignation during warmups or in the locker room before the game. While LeBron James and the Lakers' other injured players won't address the decision until Wednesday, the healthy Lakers were mostly just surprised.\n\n\"I found out when you guys did,\" said coach Luke Walton, whose future is in doubt after three straight losing seasons. \"It was 80 minutes before the game ... and I haven't had any time to really process it.\"\n\nJames watched from the bench while a mishmash lineup of veterans and G League regulars improbably maintained a fourth-quarter lead over the talented, ostensibly hungry Blazers.\n\nTIP-INS\n\nTrail Blazers: Lillard hit three more 3-pointers, increasing his single-season franchise record to 237. ... Curry scored 19 points.\n\nLakers: They finished the season with seven players unavailable due to injuries: James, Lonzo Ball, Brandon Ingram, Kyle Kuzma, Josh Hart, Lance Stephenson and Reggie Bullock. ... Jemerrio Jones had 11 points and 15 rebounds.\n\nCLOUDY FUTURE\n\nJohnson's departure represents a major change and an opportunity for the remaining Lakers, whose gifted young core finished the season largely sidelined by injuries.\n\nThe Lakers' final performances of the season suggested they have a significant talent base, and a new general manager could be less likely to get rid of that talent in a trade for a superstar. Walton also was widely expected to be fired by Johnson this week, but Magic's departure could mean Walton will get another chance after going 98-148 in three seasons.\n\nSOLID FINISH\n\nAlthough Magic's departure certainly doesn't signify a healthy organization, Los Angeles still went 6-5 after being eliminated from playoff contention March 22. Its 37 wins are the franchise's most since that last playoff season in 2013.\n\nUP NEXT\n\nTrail Blazers: Host Sacramento Kings on Wednesday.\n\nLakers: An uncertain future.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994306.3429859
}