{
  "game_id": "0021401100",
  "espn_id": "400579392",
  "date": "Mar 29, 2015",
  "matchup": "OKC @ PHX",
  "headline": "Russell Westbrook's 33 help Thunder cap 20-point comeback",
  "body": "PHOENIX -- Phoenix coach Jeff Hornacek said it was a must-win, and the Oklahoma City Thunder struggled with the Suns' intensity early in Sunday night's game.\n\"Once they went up 20, we had to make a decision: Defend or go home,\" guard Russell Westbrook said.\nThe Thunder chose the latter.\nWestbrook had 33 points, nine rebounds and seven assists, and the Thunder rallied from 20 points down to beat the Suns 109-97 in the largest comeback since the franchise moved to Oklahoma.\n\n\"It was a huge game, and we played with a playoff mindset,\" said Westbrook, who was 10 of 29 from the field and 12 of 14 from the foul line in 38 minutes.\nD.J. Augustin scored 13 of his 19 points in the fourth quarter for the Thunder, who snapped a four-game road skid. Steven Adams had 13 points and 16 rebounds, and Dion Waiters scored 18 points.\nOklahoma City stayed 2 1/2 games ahead of New Orleans for the eighth and final playoff spot in the Western Conference. The Suns fell four games behind with eight games left.\n\"I told the guys, this is mathematically not over,\" Hornacek said.\nBut Hornacek made it clear before the game that it was \"really a do or die moment for us to have any hope, any chance\" of reaching the playoffs. As if it wasn't clear what he meant, he added: \"We have to win tonight. It's as simple as that.\"\nMarkieff Morris scored 24 points for the Suns, and rookie reserve T.J. Warren had 18 points. Eric Bledsoe and Marcus Morris scored 15 apiece.\n\"This is a tough blow,\" Markieff Morris said.\nWestbrook shook off an early technical foul and a 2-for-9 shooting start to bring Oklahoma City back in its second game since learning star Kevin Durant needs season-ending foot surgery. Augustin, Waiters and Anthony Morrow (11 points) all had big buckets that turned a 79-76 deficit after three quarters into a rout.\n\"What changed was we went out there and played a scrappy brand of basketball,\" Oklahoma City coach Scott Brooks said.\nMarkieff Morris set the tone early on for the Suns. He outscored the Thunder 16-12 in the first 8 minutes. And with Phoenix shooting 62 percent from the field and Westbrook struggling, the Suns built a 54-34 lead midway through the second quarter.\nThen Westbrook took over, scoring Oklahoma City's final 15 points of the half on a variety of moves, including an acrobatic alley-oop dunk to help the Thunder close to 62-54 at halftime. The Thunder tied it midway through the third quarter.\nWestbrook was on the bench for a key spurt early in the fourth fueled by Augustin and Morrow.\n\"Then Russell came back in and finished the game off,\" Brooks said. \"That's what we have to do.\"\nTIP-INS\nThunder: It's the franchise's largest comeback since the Seattle SuperSonics rallied from 22 down to beat Utah in the 2006-07 season. ... The Thunder nearly pulled a fast one on the officials early in the fourth when Morrow (90 percent free-throw shooter) went to the line and hit the first shot when Adams (54 percent) was fouled. The officials noted the error, wiped out Morrow's free throw and sent Adams to the line. He went 1 for 2.\nSuns: Brandon Knight returned after missing the past eight games with a sprained left ankle. But he was slow to get up after missing a layup late in the third quarter and didn't return.\nWESTBROOK NEARS SUSPENSION\nIt took 57 seconds for Westbrook to pick up his 15th technical foul, one away from an automatic one-game suspension.\nWestbrook started jawing with Marcus Morris after his foul on Kyle Singler and earned a quick whistle from referee Ron Garretson.\nFour of Westbrook's technicals have come against the Suns, and he was ejected in his previous visit Dec. 31.\nUP NEXT\nThunder: Home Wednesday night vs. Dallas.\nSuns: Monday night at Portland.",
  "source": "espn_api",
  "crawled_at": 1764991867.4712021
}