{
  "game_id": "0022400274",
  "espn_id": "401704840",
  "date": "Nov 24, 2024",
  "matchup": "LAC @ PHI",
  "headline": "James Harden scores 23 points to lead Clippers to rout over his old 76ers team, 125-99",
  "body": "PHILADELPHIA -- — James Harden had 23 points and eight assists, Ivica Zubac had 16 points and 12 rebounds and the Los Angeles Clippers coasted to a 125-99 win over the Philadelphia 76ers on Sunday night.\n\n\r\n              The 76ers fell to 3-13, an improbable record for a team that opened the season as a strong betting favorite to win the Eastern Conference. The Sixers played again without injured All-Stars Joel Embiid and Paul George, both out with knee injuries.\n\n\r\n              Harden was booed every time he touched the ball by Sixers fans who have not forgotten how he left the team in a lurch when he demanded a trade ahead of the 2023 season.\n\n\r\n              The Clippers shot around 60% from the floor for most of the game and helped empty the arena early of Sixers fans with plenty of time to catch the Eagles' kickoff later that night.\n\n\r\n              Jared McCain scored 18 points and Tyrese Maxey had 17 for the Sixers.\n\n\r\n              Takeaways\r\n              Clippers: The Clippers won their fifth straight game and have a modest winning record (4-3) on the road.\n\n\r\n              76ers: The 76ers remain stuck at the bottom of the NBA standings and resemble a team more made for the draft lottery than a playoff run when Embiid and George are out of the lineup.\n\n\r\n              Key moment\r\n              Tipoff?\n\n\r\n              The decimated Sixers scored the opening bucket before the Clippers went ahead on Harden's 3 that sparked them to a quick 21-9 lead. Harden relished the spotlight against his old team and hit a pair of 3-pointers and scored 12 points in the first quarter.\n\n\r\n              Key stat\r\n              The Clippers led by as many as 33 points when Kevin Porter Jr.'s floater in the third made it 95-62.\n\n\r\n              Up next\r\n              The Clippers continue their four-game road trip Monday at NBA champion Boston.\n\n\r\n              The Sixers hope a couple more days of rest can get Embiid and George in the lineup Wednesday against Houston.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998052.9996932
}