{
  "game_id": "0021900501",
  "espn_id": "401161143",
  "date": "Dec 31, 2019",
  "matchup": "HOU vs. DEN",
  "headline": "Harden has 35 as Rockets down Nuggets 130-104",
  "body": "HOUSTON --  Now that the Houston Rockets are healthy, James Harden is excited for his team's possibilities.\n\nBut he knows there will be ups and downs as his teammates figure out how to play together.\n\nHarden scored 35 points after missing the last game with an injury to lead the Rockets to a 130-104 victory over the Denver Nuggets on Tuesday night.\n\nThe Rockets were back to full strength after Harden missed his first game of the season because of a sprained right toe in a loss to New Orleans on Sunday. Clint Capela (bruised heel) and Russell Westbrook (load management) also returned after sitting out on Sunday in the 127-112 defeat. They got Eric Gordon back on Sunday after the guard sat out for about six weeks after arthroscopic knee surgery.\n\n“We've just got to find a way,” Harden said. “It will get there. We're not where we want to be obviously. It's still early in the season. But we've got to find a way to sustain it for four quarters and once we get that it's going to be pretty tough to beat us.”\n\nHouston pushed a small lead to a big advantage with a 19-3 run to start the fourth quarter. The Rockets were up by 17 when Harden scored five quick points, with a 3-pointer, to make it 118-96 with about 3 1/2 minutes left and end his night and that of most of Houston's starters.\n\nNikola Jokic scored 21 points for the Nuggets, who had a two-game winning streak snapped.\n\n“Our defense wasn't there all night long,” Denver coach Michael Malone said. “The turnovers were too much. Give them credit, they're a good team, but a really disappointing fourth quarter.”\n\nWestbrook had 28 points for his 11th straight game with 20 or more, the longest streak by a Rockets player besides Harden since Yao Ming did it in 14 games in a row in 2006.\n\nThe Nuggets used a 37-point third quarter to cut the lead to three, but the Rockets scored the first 12 points of the fourth to make it 104-89 with about 9 minutes left. Ben McLemore had two 3-pointers to power that spurt.\n\nDenver got its first points of the quarter on a 3 by Torrey Craig after that. Houston then scored the next seven points, capped by a 3 from Harden to stretch the lead to 111-92 midway through the period.\n\nCoach Mike D'Antoni was happy with the way the Rockets opened the fourth quarter, but was disappointed that they let up in the third to allow the Nuggets to cut the deficit.\n\n“If you stop them and it went the other way the game could have been over (earlier),” he said. “But we have that tendency of letting people back in and we've got to develop better habits. Because if you want to go deep in the playoffs you can't just turn it on.”\n\nThe Rockets were up by 12 after a 3-pointer by Harden with about 7 minutes left in the third quarter. Jokic then scored four quick points to cut the lead to 78-70 midway through the quarter.\n\nHouston remained up by eight later in the third when Harden, who had six 3-pointers, made three free throws to push it to 86-75.\n\nThe Rockets had pushed the lead to 10 with about 3 minutes left in the third before the Nuggets used an 11-4 run to cut the lead to 92-89 entering the fourth. Malik Beasley led the Nuggets in that stretch, scoring five points capped by a 3-pointer with 2.7 seconds left.\n\nTIP-INS\n\nNuggets: Paul Millsap had 13 points and nine rebounds in his return after missing two games with a bruised left knee. ... Denver made 8 of 25 3-pointers. ... Monte Morris added 18 points off the bench.\n\nRockets: Gordon scored 12 points. ... Capela had 16 points and 10 rebounds after missing the last two games with his injury.\n\nHARTENSTEIN HEATING UP\n\nHouston center Isaiah Hartenstein had 16 points and 12 rebounds for the first double-double of his career. The performance comes after he scored a career-high 19 points on Sunday filling in for Capela. Hartenstein is averaging 14.7 points and 11.3 rebounds in the last three games.\n\nUP NEXT\n\nNuggets: Visit Indiana on Friday night in the second game of a five-game trip.\n\nRockets: Host 76ers on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764996639.714143
}