{
  "game_id": "401809975",
  "espn_id": "401809975",
  "date": "Oct 27, 2025",
  "matchup": "UTAH vs PHX",
  "headline": "Markkanen scores a career-high 51 points to help the Jazz outlast the Suns 138-134 in OT",
  "body": "SALT LAKE CITY -- — Lauri Markkanen scored a career-high 51 points, the first Jazz player to reach 50 in the regular season since Karl Malone in 1998, and Utah beat the Phoenix Suns 138-134 in overtime on Monday night.\n\n\r\n              Markkanen helped the Jazz recover after they blew a seven-point lead in the final 19 seconds of regulation, scoring seven points in the extra period. He also finished with 14 rebounds. \n\n\r\n              Markkanen made all 17 free throws and topped his previous best of 49 points set on Jan. 5, 2023. It was the most by a Utah player in the regular season since Malone had 56 against Golden State on April 7, 1998.\n\n\r\n              Keyonte George had 26 points and 10 assists, while Walker Kessler had 25 points, 11 rebounds and four blocks for the Jazz.\n\n\r\n              Devin Booker scored 24 of his 34 points after halftime and Grayson Allen added 23 for the Suns. Jalen Green (hamstring) and Dillon Brooks (groin) were out for Phoenix but Mark Williams returned from a knee injury with 25 points and 11 rebounds.\n\n\r\n              George made a running bank shot with 40 seconds left in OT to snap a tie and Markkanen made two clinching free throws with 1.9 seconds remaining. \n\n\r\n              The Jazz led most of the game and were up 122-115 after George's free throws with 23 seconds left in regulation. But Booker made two 3-pointers and the Jazz later fouled him leading by three with 4.9 seconds to play. \n\n\r\n              Booker made the first free throw and Williams scored after the rebound of his missed second shot to force overtime. Markkanen's baseline jumper rimmed out as time expired in regulation.\n\n\r\n              The Jazz (2-1), expected to finish near the bottom of the NBA, are a rebound away from being undefeated (a 105-104 loss to Sacramento).\n\n\r\n              The Suns (1-3) have lost three straight.\n\n\r\n              Up next\r\n              Suns: Host Memphis Wednesday.\n\n\r\n              Jazz: Host Portland Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042514.564689
}