{
  "game_id": "0022400728",
  "espn_id": "401705294",
  "date": "Feb 06, 2025",
  "matchup": "DAL @ BOS",
  "headline": "Klay Thompson scores 25 to lead Mavericks to 127-120 win over Boston as Davis delays Dallas debut",
  "body": "BOSTON -- — Klay Thompson scored 25 points, Daniel Gafford gave the Mavericks 15 rebounds in what could be his last start at center for a while and Dallas beat the Boston Celtics 127-120 on Thursday night in their NBA Finals rematch.\n\n\r\n              With recently acquired big man Anthony Davis out with an abdominal strain and cheering on his new teammates from the bench, the Mavericks led by 27 points in the second half. Spencer Dinwiddie added 22 points off the bench.\n\n\r\n              Celtics coach Joe Mazzulla put in his bench, and they unexpectedly pulled within single digits in the final minute.\n\n\r\n              Jaylen Brown, who won the NBA Finals MVP in June while leading Boston to a five-game victory over Dallas, scored 25 points and Jayson Tatum had 17. Payton Pritchard scored 21 to lead the second-string rally. \n\n\r\n              Takeaways \r\n              Dallas: Davis' anticipated debut with Dallas after he was acquired on Sunday for five-time All-NBA first-teamer Luka Doncic will have to wait until at least Saturday.\n\n\r\n              Boston: The finals rivals played both of their regular-season matchups this year in the last two weeks and split them. A potential rematch this summer is likely to turn on who is available. \n\n\r\n              Key moment\r\n              Irving had a slow start, with just four points in the first half. But with just under 10 minutes left he pulled up for a 3-pointer from the top of the key to give the Mavericks a 114-90 lead – their biggest of the game. After a timeout, Irving hit another 3 – this one a second-chance basket from the left side.\n\n\r\n              Key stat\r\n              Thompson scored 23 in the first half. \n\n\r\n              Up next\r\n              The Mavericks host Houston on Saturday and Boston visits the New York Knicks on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997162.22286
}