{
  "game_id": "0021800736",
  "espn_id": "401071409",
  "date": "Jan 27, 2019",
  "matchup": "SAC @ LAC",
  "headline": "Clippers cruise past Kings 122-108 for 3rd straight win",
  "body": "LOS ANGELES --  Without Danilo Gallinari lately, the Los Angeles Clippers have gone small. Their sparkplug has been Patrick Beverley.\n\nThe veteran guard had 16 points, 10 rebounds and eight assists on Sunday, helping the Clippers beat the Sacramento Kings 122-108 for their third straight victory.\n\n\"Pat has been MVP or key to us in this run,\" coach Doc Rivers said. \"He's a tough-guy competitor and holds every guy accountable on the floor.\"\n\nMissing Gallinari for five games due to lower back spasms, the Clippers went 3-1 on their recent road trip. They opened with a win at San Antonio in which Beverley became the only player 6-foot-1 or shorter to log 18-plus points, 12-plus rebounds, five-plus assists, four-plus steals and one block or more in over 25 seasons.\n\n\"We're sharing the ball and everybody is playing well,\" Beverley said. \"We're just hanging our hat on defense. We're locked in from shootaround to the end of the game.\"\n\nMontrezl Harrell led the Clippers with 25 points in Sunday's victory. Tobias Harris added 18 points, and Lou Williams had 12 points and 10 assists. Rookie Shai Gilgeous-Alexander scored 17 points.\n\nSacramento never led, but made a run to start the fourth. Down 87-76, the Kings twice closed within five. They got a basket and rim-rattling dunk by Willie Cauley-Stein and six straight points by Bogdan Bogdanovic.\n\nThen the Clippers took off.\n\nHarris' 3-pointer beat the shot-clock buzzer, Avery Bradley tossed in a 3 and Harrell reeled off seven in a row as part of a run that kept the Clippers ahead 110-97.\n\nThe Clippers had 35 assists on 42 field goals.\n\n\"That's who we have to be,\" Rivers said.\n\nDe'Aaron Fox led Sacramento with 21 points. Bogdanovic added 19 points off the bench and Cauley-Stein had 12 rebounds.\n\nThe Kings are 0-3 against the Clippers this season despite rallying in each game.\n\n\"It's one of the best scoring teams in the league,\" Fox said of the Clippers. \"It's hard to stop them when they get rolling offensively.\"\n\nThe Kings cut their deficit from 16 points to seven in the third. Fox and Iman Shumpert combined to score 15 of Sacramento's 17 points to start the period. Fox hit a 3-pointer and Shumpert added two from long range.\n\nThe Clippers got a 3-pointer from Harris and a dunk by Harrell to lead 87-76 going into the fourth.\n\nLos Angeles got off to a fast start. The Clippers shot 52 percent from the floor in the first half and led by as many as 25 points.\n\nTIP-INS\n\nKings: They fell to 11-15 on the road and 5-10 vs the West.\n\nClippers: F Gallinari likely will return in the next game or two. He has missed five in a row. ... Harrell turned 25 on Saturday. ... Williams' first triple-double at Chicago on Friday occurred in his 904th career game. Only Zach Randolph at 974 games logged his first later in his career.\n\nALL-STAR BID\n\nHarris came in averaging a team-leading 21.1 points for the Clippers, who at 28-22 are holding down the eighth spot in the rugged Western Conference. The eighth-year pro is seeking his first All-Star berth.\n\n\"I feel like I've been playing at that level,\" he said.\n\nRivers said Harris' numbers plus the fact that he's playing on a winning team in the West solidly state his case.\n\n\"I just hope he gets voted on,\" the coach said.\n\nUP NEXT\n\nKings: Host Atlanta on Wednesday in the opener of a six-game homestand.\n\nClippers: Host Atlanta on Monday in the second game of a back-to-back.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994188.728603
}