{
  "game_id": "0021601090",
  "espn_id": "400900485",
  "date": "Mar 26, 2017",
  "matchup": "CHI @ MIL",
  "headline": "Butler did it: Bulls pull away for 109-94 win over Bucks",
  "body": "MILWAUKEE -- Jimmy Butler rarely passed up opportunities to share the ball. Nikola Mirotic took advantage of his open shots.\nInspired by unselfish play, the Chicago Bulls pulled away in the second half for a 109-94 victory over the Milwaukee Bucks on Sunday to keep pace in the Eastern Conference playoff race.\nMirotic tied a season high with 28 points, while Butler had 20 points and a career-high 14 assists. It was the third straight game with double-digit assists for Butler, who is also Chicago's leading scorer (23.6 points).\n\"My mantra is always to pass the ball to the open guy whether it's late game, early game,\" Butler said.\nChicago has won two of three games, with Butler reaching double-digit assists and Mirotic scoring 28 in each victory. Against Milwaukee, Mirotic was the beneficiary of open looks with Butler and Rajon Rondo (nine assists) drawing defenders on drives into the lane.\n\"I just don't think we trusted our defense tonight like we should have,\" Milwaukee forward Khris Middleton said. Butler and Rondo \"did a great job of collapsing our defense and finding guys.\"\nIt's an ideal formula for the Bulls to stay in the playoff picture with eight games left in the regular season.\nChicago was tied with Detroit coming into the day, 1 1/2 games behind Miami for the final playoff spot. The Bulls also finished the season series against Milwaukee at 1/3 this season, avoiding a sweep to their Central Division rival.\nCoach Fred Hoiberg hopes his team can build off this win with games coming up against defending champion Cleveland and another playoff hopeful, Atlanta. The Bulls also outrebounded Milwaukee 49-34.\n\"We've got to understand what makes us successful,\" Hoiberg said. \"When we're committed to moving the ball like we did today ... trying to put them in spots on the floor where they're maybe not as successful and when we rebound.\"\nGiannis Antetokounmpo had 22 points and eight rebounds for the Bucks.\nTIP-INS\nBulls: Chicago had a 23-10 run over the final 8:29 of the second quarter to take a 56-55 lead at halftime. Playing crisp offense, the Bulls shot 59 percent and assisted on 20 of 25 buckets in the first half. ... All five starters finished the game scoring in double figures.\nBucks: C John Henson (sprained left thumb) could be out another week after getting hurt on Tuesday in Portland. ... Middleton, who went just 1 of 13 from the field in Friday's win over Atlanta, was 6 of 17 against Chicago and finished with 14 points.\nPLAYOFF POSITIONING\nMilwaukee failed to secure sole possession of fifth place in the Eastern Conference playoff race after being tied with Atlanta going into Sunday. The Hawks lost earlier in the day to the Brooklyn Nets.\nThe Bucks shot 4 of 19 (21 percent) in the fourth quarter.\n\"We had struggles there moving the ball, and we thought one person could do it. That's not the way we play,\" coach Jason Kidd said. \"On defense, we're just a step behind.\"\nBUTLER DOES IT\nButler had his milestone day at the Bradley Center, the arena in which he played his home games in college at Marquette.\nHe broke his previous career best for assists (12) by the end of a pivotal third quarter, when Chicago stretched a one-point lead at the half to 91-79 going into the fourth.\nButler punctuated the second-half runaway with a backcourt steal off a telegraphed pass by Greg Monroe before strolling the other way for an easy dunk and 17-point lead with 8:55 left.\n\"If I'm not making shots, then I've got to go down there and change the game on the defensive end,\" said Butler, who finished 8 of 13 from the field. \"If I'm making shots, I still got to go down there and guard or make the right pass.\"\nMirotic hit three 3-pointers in the third quarter, while Rondo scored 14 of his 18 points in that period.\nUP NEXT\nBulls: Try to sweep the season series against Cleveland when they host the Cavaliers on Thursday.\nBucks: Begin a two-game road trip by visiting the Charlotte Hornets on Tuesday.\n---\nMore NBA Basketball:\nhttps://apnews.com/tag/NBAbasketball\n---\nFollow Genaro Armas at: https://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764995011.747914
}