{
  "game_id": "0021900129",
  "espn_id": "401160771",
  "date": "Nov 09, 2019",
  "matchup": "CHI vs. HOU",
  "headline": "Harden scores 42, Rockets rout Bulls 117-94",
  "body": "CHICAGO --  For James Harden, a missed shot simply means the odds of him making the next one improve.\n\nThat attitude served the All-Star guard well Saturday night as he rebounded from a slow start to put up big numbers again.\n\nHarden narrowly missed his first triple-double of the season, finishing with 42 points, 10 rebounds and nine assists as the Houston Rockets pulled away in the second half and beat the Chicago Bulls 117-94.\n\nAfter going 2 for 7 (including 1 for 5 on 3-pointers) in the first quarter, he went 10 for 20 the rest of the game, including 8 for 14 on 3's.\n\n\"That's the confidence I have,\" he said. \"That's the confidence that I've built off of the work I put in. It's more of a mindset.\"\n\nHarden, the NBA's leading scorer, entered the game averaging 36.5 points on 38.7% shooting, including 27% on 3-pointers.\n\n\"I feel like a broken record sometimes, but he's a master of getting what he wants,\" Houston coach Mike D'Antoni said of Harden. \"I think sometimes he might get bored in the game and tries different stuff.\"\n\nRussell Westbrook scored 26 points as the Rockets won their third straight.\n\nWendell Carter Jr. had 13 points and 16 rebounds for Chicago, which has dropped six of eight.\n\nThe Bulls were a woeful 4-for-32 shooting from 3-point range.\n\n\"I know how well we can shoot and tonight we just didn't make them,\" Chicago forward Lauri Markkanen said.\n\nChicago led 27-20 after one quarter behind eight points from Markkanen and eight Houston turnovers.\n\nThe Bulls led by nine points (31-22) early in the second before the Rockets used a 24-7 run to take control and open a 46-38 lead with four minutes left in the first half. Harden had nine points during the run.\n\nChicago closed within 50-49 at halftime on a 3-pointer by Zach LaVine. That was the Bulls second make in 17 first-half attempts from long range. Houston quickly reclaimed control with a 30-9 run in the opening 9:41 of the third, taking an 80-58 advantage.\n\nThe Rockets had an 86-67 lead entering the fourth, helped by 7-for-14 shooting from 3-pointers range in the third. Harden led the way with 11 points in the quarter.\n\nThe Bulls couldn't get closer than 14 points in the fourth quarter.\n\n\"I think we did really good in the first half; they just broke it open in the third quarter,\" LaVine said. \"We played a good first half and a bad second half.\"\n\nHarden, who has 35 regular-season triple-doubles in his career, had several minutes of garbage time in the fourth quarter to get additional assists, but was unsuccessful before leaving with a little more than three minutes remaining.\n\n\"I didn't even know I was one assist away,\" he said. \"I'm happy we won, though.\"\n\nNUMBERS GAME\n\nHouston went 19 for 44 (43.2%) on 3-pointers to clearly outclass the Bulls from behind the arc.\n\n\"They made 19 threes, we made four, so we lost the 3-point line by 45 points,\" Chicago coach Jim Boylen said. \"It's hard to win a game.\"\n\nDEFENSE\n\nWestbrook believes the Rockets had a lot to do with the Bulls' poor shooting.\n\n\"If you're gonna win in this league, you've got to defend,\" he said. \"There are no nights off. You've got to defend every single night against some tough teams.\"\n\nTIP-INS\n\nRockets: G Eric Gordon (left hamstring) returned after sitting out Wednesday against Golden State. He had nine points and 21 minutes off the bench. ... Houston has won the last seven games against Chicago, including the last four at the United Center.\n\nBulls: F Otto Porter sat out with a left foot sprain. Porter was walking Saturday without the aid of crutches for the first time since suffering the injury Wednesday in Atlanta. There is still no timetable for his return.\n\nUP NEXT\n\nRockets: At New Orleans on Monday night\n\nBulls: Host New York on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996367.369487
}