{
  "game_id": "0022400286",
  "espn_id": "401704852",
  "date": "Nov 27, 2024",
  "matchup": "MIA @ CHA",
  "headline": "Tyler Herro scores 27 points as the Heat hold off a late comeback try by the Hornets",
  "body": "CHARLOTTE, N.C. -- — Tyler Herro scored 27 points, Duncan Robinson added 22 points with six 3-pointers and the Miami Heat held on to defeat the Charlotte Hornets 98-94 on Wednesday night.\n\n\r\n              Bam Adebayo had 10 rebounds and 10 assists for the Heat, who bounced back from a 106-103 loss to the Milwaukee Bucks in an NBA Cup game on Tuesday night.\n\n\r\n              LaMelo Ball had 32 points and 10 rebounds for the Hornets, who have lost five of their last six. Brandon Miller had 21 points and rookie Tidjane Salaun scored a career-high 17 points.\n\n\r\n              The Hornets rallied from 20 points down to take the lead when Salaun drilled a corner 3 with 42 seconds left.\n\n\r\n              But the lead was short-lived as Herro answered with a 3 and then came up with a steal. Herro was fouled and made 1 of 2 free throws, giving the Hornets a chance to tie or win with six seconds left. Cody Martin got fouled, but missed both free throws. Miami's Kel’el Ware made both free throws to seal the win.\n\n\r\n              Jimmy Butler left in the third quarter with a tight back and didn't play in the fourth quarter.\n\n\r\n              Takeaways\r\n              Heat: Robinson got the Heat going early, scoring 13 of the team's first 17 points, including three 3s. \n\n\r\n              Hornets: Ball, who came in averaging 43 points over the last three games, was probable entering the game with a right wrist injury. It was clearly bothering him during the game, as he was seen holding the wrist with his other hand during pauses in play. \n\n\r\n              Key moment \r\n              The Hornets looked to take the lead with under 10 seconds left when Herro stole Ball's pass to Brandon Miller.\n\n\r\n              Key stat\r\n              Ball shot 11 of 35 from the field and 7 for 20 from long distance and had seven turnovers. \n\n\r\n              Up next \r\n              The Heat host the Raptors on Friday, while Hornets host the Knicks.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996926.994061
}