{
  "game_id": "0021900390",
  "espn_id": "401161032",
  "date": "Dec 15, 2019",
  "matchup": "LAL @ ATL",
  "headline": "James caps busy weekend with 32 as Lakers beat Hawks 101-96",
  "body": "ATLANTA -- LeBron James finished off a whirlwind weekend with another dazzling performance.\nNot looking the least bit tired, James scored 32 points and the Los Angeles Lakers extended their winning streak to seven with a 101-96 victory over the pesky Atlanta Hawks on Sunday night.\nThe Lakers pulled even with Milwaukee for the NBA's best record at 24-3.\n\"Highlights: sometimes they happen, sometimes they don't,\" James said. \"I try to play the game with a lot of joy.\"\nAfter scoring 28 points in a win at Miami on Friday night, James flew to Columbus, Ohio, to watch son Bronny play a high school game Saturday night.\nThen, James traveled on to Atlanta to face the struggling Hawks.\nHe never considered sitting out.\n\"I don't know how many games I've got left in my career,\" the 34-year-old James said. \"I don't know how many kids show up to come see me play. ... That's my obligation. My obligation is to play.\"\nThe Hawks kept it close all the way. Vince Carter passed up an open layup and dished to rookie Cam Reddish in the corner for a potential tying 3-pointer, but the shot clanked off the rim. Danny Green went to the other end and knocked down a pair of free throws to send the Hawks to their fourth straight loss.\n\"We did our best to compete,\" Atlanta coach Lloyd Pierce said. \"I'm proud of our guys.\"\nIf the home team was hoping to get an off night from James, he quickly dispelled that notion.\nJames had the crowd -- many of them decked out in his No. 23 jersey -- oohing and ahhing with an appropriate 23-point effort in the first half.\nHe threw down three thunderous slams. He knocked down a couple of mid-range jumpers. He ventured out beyond the arc to swish a couple of 3-pointers -- including a step-back shot from nearly 5 feet behind the stripe to finish off the first half, sending the Lakers to the locker room with a 55-48 lead.\nHe also had seven rebounds and blocked a shot, but the play that really had everyone talking was an assist -- a no-look, between-the-legs pass that caught Dwight Howard breaking down the lane for a massive dunk.\nRondo also contributed to the \"Showtime\" performance, finishing off a four-on-one with a dazzling move that looked as though he was about to throw up a lob to James streaking off the wing.\nThe lone defender, De'Andre Hunter, was left reeling as Rondo hung on to the ball for an uncontested layup. James flew in behind his teammate like he was going for the block, adding some style points to an already impressive play.\nJames wasn't done.\nIn the third quarter, he pulled up just inside the Hawks center-court logo and swished another 3-pointer from 36 feet to give the Lakers a 10-point edge.\n\"He was spectacular,\" Laker coach Frank Vogel said. \"He had some all-time clips.\"\nAtlanta trailed by as many as 11 but kept the margin in single digits nearly the entire way.\nTrae Young led the Hawks with 30 points.\nAnthony Davis scored 27 points and grabbed 13 rebounds for the Lakers. James also had 13 rebounds, along with seven assists.\nHUERTER'S SHOULDER\nKevin Huerter's left shoulder is hurting again.\nThe Hawks guard re-injured his left shoulder about 4 minutes into the fourth quarter when he collided with Howard.\n\"I was trying to box him out and the arm kind of went limp,\" Huerter said.\nHe was holding his left arm gingerly after the game, but the team doesn't believe the injury is as serious as his previous one.\nHuerter already missed 11 games with a strained left rotator cuff.\n\"We'll know more tomorrow,\" he said. \"We haven't done any tests yet.\"\nTIP-INS\nLakers: Davis grabbed at his right ankle when fouled on a lay-up in the closing minutes, but he was able to finish. ... Rondo was slapped with a technical late in the second quarter for griping about being called for a foul on Young. The Atlanta guard knocked down the technical, then made two more free throws to complete what amounted to a three-point play. ... Kyle Kuzma missed his third straight game with a sprained left ankle.\nHawks: Pierce picked up a technical in the first half for arguing that a Lakers block should have been called for goaltending. ... Atlanta was outrebounded 56-42. ... The Hawks shot just 36 percent from the field. Young reached 30 points for the 13th time this season but was held to 9-of-22 shooting, including 3 of 11 from 3-point range. \"We couldn't get a real good offensive performance from anybody,\" Pierce said. \"\nUP NEXT\nLakers: Head to Indiana on Tuesday for the next-to-last game on their five-game Eastern trip.\nHawks: Travel to New York on Tuesday to face the Knicks in a match-up between two of the worst teams in the East.\n---\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 His work can be found at https://apnews.com\n---\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996015.3015912
}