{
  "game_id": "0021900140",
  "espn_id": "401160782",
  "date": "Nov 11, 2019",
  "matchup": "DET vs. MIN",
  "headline": "Timberwolves beat Pistons 120-114, spoiling Griffin's return",
  "body": "DETROIT --  The Minnesota Timberwolves shot an abysmal 6 of 45 from 3-point range in a loss to Denver over the weekend.\n\nThat evened out in a hurry against Detroit.\n\nAndrew Wiggins scored 33 points, and Minnesota spoiled Blake Griffin's return Monday night, beating the Pistons 120-114. The Timberwolves shot 8 of 10 from beyond the arc in the first quarter to take a 15-point lead, and they held Detroit at bay after that.\n\n\"We talked this morning -- how we made sure there weren't any lids on the basket,\" Minnesota coach Ryan Saunders said. \"They deserve a win like this on a back-to-back.\"\n\nGriffin played for the first time this season, coming back from hamstring and knee issues. Derrick Rose also returned to the Detroit lineup from a strained hamstring, but both he and Griffin played limited minutes.\n\nGriffin scored 19 points but Rose added just six.\n\n\"We've just got to ask the question: Do we want to win -- are we going to come out and play hard, or going to get spanked like this every night?\" Rose said. \"We need everybody to be on the same page. We need everybody to move in a collective group. We've got to figure it out.\"\n\nKarl-Anthony Towns scored 25 points for Minnesota, which snapped an eight-game losing streak to the Pistons.\n\nAfter a 100-98 overtime loss to Denver on Sunday, Minnesota was sharp at the start of this game. The Timberwolves led 41-26 after one, and the Pistons never cut too far into the deficit until the fourth. A 3-pointer by Detroit's Tony Snell made it 109-104, but Towns drew a double team at the other end and passed to an open Wiggins, whose 3-pointer restored the lead to eight.\n\n\"Every good thing that happens to Andrew, Andrew deserves, because Andrew does work hard,\" Saunders said. \"He had a different mindset this summer. We had a conversation, so all the credit goes to him for buying in and really delivering for us.\"\n\nMinnesota led by 19 in the third before the Pistons ran off eight points in a row. Towns ended that quarter with a driving dunk that put the Timberwolves ahead 92-81.\n\nMinnesota was without point guard Jeff Teague (illness).\n\nLuke Kennard led Detroit with 25 points, and Snell scored 16. Andre Drummond had 11 points and 12 rebounds, but he went just 4 of 12 from the field.\n\nMANAGING MINUTES\n\nGriffin played 23:58 and Rose only 19:54. Coach Dwane Casey acknowledged it was hard getting them on the court for significant time together.\n\n\"Believe me, it's a trigonometry lesson,\" Casey said. \"I know it's for their health and all that stuff, but it's difficult. It's difficult for the team and it's difficult for their teammates to come in and get a good rhythm, but somehow, someway we have to get a rhythm if that is who we are going to be.\"\n\nGriffin said the chemistry between him and Rose -- a new acquisition this season -- should be OK.\n\n\"He's a great player. Players like that are easy to play with,\" Griffin said. \"Some nights it might be his night. Some nights it might be mine. Some nights it might be neither, but we'll be able to affect the game whether we're scoring the basketball or not.\"\n\nSHARP SHOOTING\n\nEach team had a reserve shooting well. Minnesota's Jake Layman made four 3-pointers and scored 16 points. Detroit's Langston Galloway made four 3s of his own and finished with 18 points.\n\n\"I feel like I have been getting great shots every game,\" Layman said. \"Some games they haven't been falling, but it's all great looks all around our offense. So, I'm going to keep doing the same thing.\"\n\nTIP-INS\n\nTimberwolves: Minnesota was also without G Shabazz Napier (right hamstring strain). ... The Timberwolves finished 15 of 34 from 3-point range.\n\nPistons: G Reggie Jackson (lumbar stress reaction) did not play.\n\nUP NEXT\n\nTimberwolves: Host the San Antonio Spurs on Wednesday night.\n\nPistons: Visit the Miami Heat on Tuesday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996303.286648
}