{
  "game_id": "0021800951",
  "espn_id": "401071624",
  "date": "Mar 03, 2019",
  "matchup": "OKC vs. MEM",
  "headline": "Westbrook helps Thunder rally for 99-95 win over Grizzlies",
  "body": "OKLAHOMA CITY --  Russell Westbrook turned back the clock a bit on Sunday.\n\nOklahoma City's All-Star point guard scored 12 of his 22 points in the fourth quarter, and the Thunder rallied from a 13-point deficit in the final seven minutes to snap a four-game losing streak with a 99-95 victory over the Memphis Grizzlies.\n\nWestbrook shot 3 of 13 in the first three quarters, then went 4 for 7 in the fourth. It was similar to the late-game scoring binges he went on during his MVP season two years ago.\n\nThe Thunder needed every bit of it -- forward Paul George, the NBA's No. 2 scorer and league leader in steals, missed his third straight game with a sore right shoulder.\n\nOklahoma City supported Westbrook's late surge by holding the Grizzlies to 6-for-21 shooting in the fourth.\n\n\"One of the things we talked about that I said before the game tonight is that we've got to create a defensive identity regardless,\" Thunder coach Billy Donovan said. \"We have to defend at a higher level every single night. Offensively, we struggled to get any kind of flow or continuity there, but I give our guys credit -- they still tried to work as hard as they could to defend, even though offensively, we had our challenges.\"\n\nIt was the first time since Jan. 6 that the Thunder failed to score at least 100 points.\n\n\"With Paul out, certainly offensively, it's been a challenge the last several games,\" Donovan said. \"I've been trying to find a way to keep helping our guys offensively in order to create an identity with him being out.\"\n\nDennis Schroder added 17 points and a career-high 11 rebounds, and Steven Adams had 13 points and 22 boards for the Thunder.\n\nAvery Bradley scored 27 points, Delon Wright had 17 and Jonas Valanciunas added 16 points and 13 rebounds for the Grizzlies.\n\nMike Conley, the team's floor general and leading scorer, sat out with general soreness. Memphis coach J.B. Bickerstaff said Conley's presence was missed in the fourth quarter.\n\n\"I think the guys put forth a hell of an effort to get themselves an opportunity to win the game, but it's a matter of learning who we are and who gets the touches where,\" Bickerstaff explained. \"You know in the fourth quarter we rely heavily on Mike, so it was somebody different we were having to find tonight, and that's just a matter of us getting comfortable and familiar with one another and growing and learning from it.\"\n\nMemphis led 75-67 heading into the fourth, and the Grizzlies were up 89-76 before the Thunder found their footing. A 3-pointer by Westbrook cut the deficit to 91-86 and led to a Memphis timeout.\n\nWestbrook hit another 3 to tie the game at 93 with 1:04 to play, then a jumper from near the free throw line to put the Thunder ahead 95-93 with 31.9 seconds left. Wright missed a 3 and Schroder made two free throws at the other end with 14.9 seconds remaining.\n\nAfter Wright made a layup to trim the Thunder's lead to two, Oklahoma City's Terrance Ferguson hit two free throws with 6.5 seconds left to seal the win.\n\nTIP-INS\n\nGrizzlies: Wright had 15 points at halftime. ... Memphis held Oklahoma City to 31.9 percent shooting through three quarters, but allowed the Thunder to shoot 45.8 percent in the fourth.\n\nThunder: Westbrook got a technical foul early in the first quarter. He has 14 this season, leaving him two away from a suspension. ... Adams had 12 rebounds in the first half. He finished one short of his career high.\n\nHE SAID IT\n\nThunder forward Abdel Nader on the team's losing streak: \"I think everybody was caught up, you know? I think we lost four in a row coming into tonight, and everybody gets really caught up in that. When you really look at the stats and watch film, it is all one- or two-possession games against some really good teams. Like I said, we have some things we definitely need to clean up, but this was a good step forward to get the job done.\"\n\nUP NEXT\n\nThe Grizzlies host Portland on Tuesday.\n\nThe Thunder play at Minnesota on Tuesday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994564.04906
}