{
  "game_id": "0021900215",
  "espn_id": "401160857",
  "date": "Nov 22, 2019",
  "matchup": "DET vs. ATL",
  "headline": "Pistons score 76 in first half, rout Hawks 128-103",
  "body": "DETROIT --  About an hour after a blowout loss to the Detroit Pistons, Atlanta coach Lloyd Pierce finally emerged to meet with reporters.\n\nThe Hawks had been talking things over.\n\n\"Learning how to compete -- that's kind of it,\" Pierce said. \"Learning how to compete, learning how to communicate, what it takes to win in the NBA, what it takes to be a pro.\"\n\nAtlanta allowed 76 points in the first two quarters -- the highest-scoring first half for the Pistons since 1983 -- and Detroit snapped a five-game losing streak with a 128-103 rout Friday night. It was the fifth straight loss for the Hawks and their eighth consecutive game allowing at least 120 points.\n\nCoaches generally hold their media sessions about 10 minutes after the game ends, but that was delayed a while this time. The Hawks were meeting to try to find some answers to their struggles.\n\n\"We've got a bunch of guys that don't really get to talk and actually say what they think,\" said DeAndre' Bembry, who led the team in scoring with 22 points. \"That was definitely one of those meetings where we're just expressing ourself, individually and collectively.\"\n\nAndre Drummond had 23 points and 15 rebounds for the Pistons. Detroit led 76-57 at halftime, and the Pistons reached 100 points with over five minutes remaining in the third quarter. Nine different Detroit players made at least one 3-pointer. Drummond wasn't one of them, but he scored his share of easy baskets inside.\n\nThe Pistons actually trailed 17-7 before going on a 20-0 run that gave them a double-digit lead of their own before the end of the first quarter. It was 33-23 after one, then Detroit overwhelmed the Hawks with a 43-point second quarter that ended when Thon Maker of the Pistons made a 3-pointer at the buzzer.\n\n\"We're such a good shooting team, if we get good attempts and not turn it over,\" Detroit coach Dwane Casey said.\n\nIt was the most points in the first half for the Pistons since they scored 77 on Dec. 2, 1983, also against the Hawks.\n\nDetroit led 107-84 after three and finished the game with seven players in double figures. Blake Griffin scored 24 points and Bruce Brown added 14. Markieff Morris contributed 13 points.\n\nThe Pistons shot 60 percent from the field and 17 of 34 from 3-point range. Pierce was asked if he got the response he wanted from the postgame meeting, but that remains to be seen.\n\n\"Nothing gets solved in those meetings, but what has to be said -- if you see something, you've got to say it,\" Pierce said. \"I had to say it, and they had to say it, and they had to hear it.\"\n\nNOT THIS TIME\n\nTrae Young scored 38 points for Atlanta in a win at Detroit last month. He had only nine Friday, and Brown outscored him.\n\n\"Just ready tonight,\" Brown said. \"I don't think I was ready last time.\"\n\nINJURIES\n\nDetroit is still without point guard Reggie Jackson (lumbar stress reaction), and Tony Snell (left hip strain) missed this game as well.\n\nAtlanta was missing rookie Cam Reddish (left wrist sprain), as well as Kevin Huerter (left rotator cuff strain) and John Collins (doping suspension).\n\nTIP-INS\n\nHawks: De'Andre Hunter scored 18 points and Jabari Parker added 14.\n\nPistons: Detroit had not scored 76 points in either half since the Pistons scored 76 in the second half against Washington on Feb. 7, 1995. ... Langston Galloway scored 12 points, giving him a career-best 11 consecutive games in double figures. ... The 20-0 run was the team's longest since a 24-0 run at Portland on Nov. 8, 2015.\n\nUP NEXT\n\nHawks: Host the Toronto Raptors on Saturday night.\n\nPistons: Visit the Milwaukee Bucks on Saturday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996300.0533519
}