{
  "game_id": "0022200838",
  "espn_id": "401468993",
  "date": "Feb 10, 2023",
  "matchup": "CHA @ BOS",
  "headline": "Tatum scores 41, White 33 as Celtics beat Hornets 127-116",
  "body": "BOSTON -- — Jayson Tatum scored 41 points and Derrick White set new career highs with 33 points and eight 3-pointers to help the Boston Celtics hold off the Charlotte Hornets 127-116 on Friday night. \n\n\r\n              Tatum began the fourth quarter on the bench but was reinserted after Charlotte cut Boston’s lead to 14 points with 7:03 to play. The Hornets trailed by 28 in the third quarter before closing period on 15-3 run. \n\n\r\n              It was Tatum’s eighth game this season with 40 or more points, but he played 37 minutes to do it on what was an otherwise light night of work for the MVP contender. \n\n\r\n              “You understand in the course of a game leads are never safe, regardless of a team's record they're always capable of making plays and knocking down shots,\" Tatum said. “I seen earlier (president of basketball operations) Brad (Stevens) told you guys he was making me sit out next week. So I'll get some rest then.”\n\n\r\n              Boston has won five of its last six overall and swept the season series with the Hornets 4-0. \n\n\r\n              Terry Rozier led Charlotte with 27 points. LaMelo Ball added 24 points and 10 assists. The Hornets have lost their last six games. \n\n\r\n              White hit his first eight shots of the night, including six from beyond the arc as Boston built as much as a 20-point, first-half lead. White ended the opening half with 26 points and seven 3-pointers. He finished 8 of 14 from 3 for the game. He also had 10 assists. \n\n\r\n              “When you're in the zone it feels good and you just try to hit every shot,” White said.\n\n\r\n              His early scoring punch helped fill the void created by the absence of All-Star Jaylen Brown, who was diagnosed with a maxillary fracture in his face after he took an inadvertent elbow from Tatum on Wednesday while going for a rebound during the Celtics’ win over Philadelphia. \n\n\r\n              Brown’s unavailability did little to slow Boston, which shot 49% on the night and hit 25 3-pointers. \n\n\r\n              Charlotte fell behind 6-0 and never led.\n\n\r\n              The game also saw the debut of Boston’s newly acquired big man Mike Muscala after he was added at Thursday’s trade deadline in a deal with Oklahoma City for Justin Jackson and a pair of future second-round draft picks. \n\n\r\n              Muscala checked in for the first time at the 3:30 mark of the first quarter and netted his first points as a Celtic less than two minutes later when he connected on a 3-pointer from the wing. \n\n\r\n              He played 16 minutes and scored 12 points (hitting four 3s) with Al Horford missing his second straight game with a sore right knee. \n\n\r\n              With the No. 33 Muscala wore in Oklahoma City retired in the TD Garden rafters for Larry Bird, he chose to wear No. 57 with the Celtics. It honors his mother, who died before the season. She was born in 1957.\n\n\r\n              NO SURGERY \n\n\r\n              Stevens said he doesn’t anticipate Brown missing a significant amount of time. \n\n\r\n              Stevens said Brown has been fitted with a mask and will be evaluated over the next few days. \n\n\r\n              Tatum he feels terrible for his role in the “freak accident” that injured Brown.\n\n\r\n              “Whether it's the mask or buying him a card, I think I got it,” Tatum said.\n\n\r\n              What kind of card?\n\n\r\n              “Something safe.”\n\n\r\n              TIP-INS \n\n\r\n              Hornets: Outscored Celtics 28-26 in third quarter. … Shot 48% for the game and 35% from the 3-point line (8 of 23). \n\n\r\n              Celtics: With a 3 in the closing seconds of the second quarter, Tatum became the youngest player (24 years, 344 days) in NBA history to reach 1,000 3-pointers. He’s the first to do it before turning 25 years old. He beat friend and fellow St. Louis' native Bradley Beal's mark of 25 years, 223 days. … Boston led 71-53 at halftime, connecting on 16 of 31 from the 3-point line. … Marcus Smart sat for the ninth consecutive game with a sprained right ankle. Stevens said Smart continues to get closer to a return but still is experiencing pain. \n\n\r\n              UP NEXT \n\n\r\n              Hornets: Visit Nuggets on Saturday. \n\n\r\n              Celtics: Host Grizzlies on Sunday. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994253.6645372
}