{
  "game_id": "0022300317",
  "espn_id": "401584945",
  "date": "Dec 13, 2023",
  "matchup": "BKN @ PHX",
  "headline": "Balanced Nets beat Suns 116-112, spoiling debut of Phoenix's All-Star trio",
  "body": "PHOENIX -- — Cam Thomas scored 24 points, Mikal Bridges added 21 in his return to the desert and the Brooklyn Nets held on to beat the Phoenix Suns 116-112 on Wednesday night, spoiling the debut of the team's All-Star trio.\n\n\r\n              The Nets have won seven of their past nine.\n\n\r\n              The Suns trailed by eight points at the break but rallied for an 88-86 lead heading into the fourth. The game stayed tight throughout the final quarter, but the Nets took the lead with about 10 minutes remaining and never gave it up.\n\n\r\n              Spencer Dinwiddie hit a 3 to put the Nets up 112-106 with 1:54 left. He followed with a layup on the team's next offensive possession and finished with 16 points.\n\n\r\n              The Suns cut it to 114-112 with 28 seconds left, but Thomas hit two free throws with 3 seconds left to seal it. Thomas scored 10 points in the fourth.\n\n\r\n              It was the first time this season — in the 24th game — that Phoenix's Kevin Durant, Devin Booker and Bradley Beal played on the same night. The trio's debut was delayed because of various injuries, particularly Beal’s sore back, which has limited him to five games this season.\n\n\r\n              Booker had 34 points and 12 assists, Durant added 27 points and Beal had 14. Jusuf Nurkic had 15 points and a season-high 22 rebounds.\n\n\r\n              The Nets led by 15 during the first half before settling for a 64-56 halftime advantage. Cam Johnson led the Nets with 15 points on 5-of-5 shooting before the break, including three 3-pointers. Booker led the Suns with 17.\n\n\r\n              Bridges and Johnson returned to play a game for the first time since the Suns traded the pair to the Nets as part of a package that brought Durant to Phoenix at the trade deadline last season. The two were important — and popular — members of the 2021 Suns team that advanced to the Finals before losing to the Milwaukee Bucks in six games.\n\n\r\n              Both players received a loud, lengthy ovation during a tribute video before the game.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Denver on Thursday night.\n\n\r\n              Suns: Host New York on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996361.331855
}