{
  "game_id": "0021801003",
  "espn_id": "401071676",
  "date": "Mar 11, 2019",
  "matchup": "DET @ BKN",
  "headline": "Nets rout Pistons 103-75 to move into No. 6 spot in East",
  "body": "NEW YORK --  The Nets haven't been to the playoffs in four years. On Monday night, they looked ready to return.\n\nSpencer Dinwiddie scored 19 points and Brooklyn held the Detroit Pistons to the lowest shooting percentage in an NBA game in 3 1/2 years, winning 103-75 to move into sixth place in the Eastern Conference.\n\n\"Our guys attacked it,\" Nets coach Kenny Atkinson said. \"Sometimes when you're not used to these big games you might be on your heels a little bit. But, I felt like we were the more aggressive team and we weren't afraid of the moment. Definitely a good sign for us if we have more of these big games in the future.\"\n\nThe Nets (36-33) won their fourth straight and leapfrogged Detroit (34-32) into the No. 6 spot in their final game before leaving for a seven-game road trip.\n\nThe Pistons had their season-high, five-game winning streak snapped.\n\nAndre Drummond led the Pistons with 13 points and 20 rebounds. Blake Griffin finished with 10 points, but only shot 1 of 10 from the field as Detroit was held to its lowest point total of the season.\n\nThe Pistons shot 27.8 percent (27 of 97) from the field, the lowest by any team since Memphis shot 27.1 percent at Golden State on Nov. 11, 2015.\n\n\"They brought a tough mindset and a much more physical game,\" Griffin said.\n\nAllen Crabbe finished with 14 points and 10 rebounds, Rodions Kurucs scored 13 points, and Joe Harris and Caris LeVert each added 12 as the Nets took control early and never let up.\n\nBrooklyn trailed 5-4, then went on a 14-4 run and never trailed again. Kurucs started the streak with consecutive buckets and Crabbe scored eight of the next 10 as Brooklyn took early control.\n\nThe Nets led 27-19 after the first quarter and 61-35 at halftime.\n\nThe Pistons scored the first five points of the second half and eventually pulled within 63-45 but never got any closer.\n\nThe Nets increased their lead to 29 points before Langston Galloway's deep buzzer-beating 3-pointer ended the third quarter with the Pistons trailing 88-62.\n\n\"They came in and whipped us every which way there was,\" Pistons coach Dwane Casey said. \"We didn't come out and play. We took a full step back tonight.\n\n\"One day (you're) the pigeon, one day you're the statue. And definitely today we were the statue.\"\n\nDetroit only managed to get as close as 21 points in the fourth quarter and the Nets took their largest lead at 100-69.\n\nJarrett Allen and D'Angelo Russell each added 11 points for the Nets.\n\n\"All the vets told us that this was a playoff-type game so we have to bring the right mentality and be ready for it,\" Allen said. \"We came in with dominance and force and just kept it throughout.\"\n\nTIP-INS\n\nPistons: Reggie Jackson is the only Piston to play and start in each of the team's 66 games. ... Detroit hasn't won more than five consecutive games since taking seven straight during the 2014-15 season. (Dec. 26-Jan. 7).\n\nNets: No one has played in all 69 games for Brooklyn this season. D'Angelo Russell and Ed Davis have played in 68. ... The Nets trail the all-time series against the Pistons 107-71, but are 48-43 at home, including 9-4 at the Barclays Center.\n\nPOWER OUTAGE\n\nThe Pistons shot only 34.8 percent (8 of 23) in the first quarter, going 0 for 6 from 3-point range. Their 19 points in the opening period marked the first time they failed to score at least 20 since only managing 17 against Oklahoma City on Dec. 3. Their 35 first-half points were their lowest since totaling a season-worst 34 against Washington on Jan. 21.\n\nHIT THE ROAD, JACK\n\nThe Nets are about to embark on their longest road trip of the season. They are set to play their next seven games away from Barclays Center. Their longest road trip of the season thus far has been four games. \"I could do the Joe Maddon thing. I thought about that,\" Atkinson said. \"Dress everybody up in costumes and maybe sing their alma mater. Something funny.\"\n\nANDRE'S A GIANT\n\nDrummond's 19th straight double-double on Monday tied him with Bob Lanier (1974-75) for the longest streak in Pistons' team history. He currently leads the NBA with 55 double-doubles and was last week's Eastern Conference player of the week.\n\nUP NEXT\n\nPistons: Visit Miami on Wednesday.\n\nNets: Visit Oklahoma City on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994661.422953
}