{
  "game_id": "0022000323",
  "espn_id": "401267483",
  "date": "Feb 02, 2021",
  "matchup": "TOR @ ORL",
  "headline": "VanVleet sets Raptors mark with 54 in 123-108 win at Orlando",
  "body": "ORLANDO, Fla. -- — Fred VanVleet set a franchise record with 54 points and hit a career-best 11 3-pointers as the Toronto Raptors beat the short-handed Orlando Magic 123-108 on Tuesday night.\n\n\r\n                    VanVleet made 11 of his first 12 attempts from 3-point range. He finished 17 of 23 from the field and 9 for 9 at the free throw line to surpass the previous Raptors record of 52 points scored by DeMar DeRozan against Milwaukee on Jan. 1, 2018.\n\n\r\n                    According to the Elias Sports Bureau, it was the most points in an NBA game for an undrafted player — eclipsing the 53 scored by Hall of Fame big man Moses Malone on the exact same date 39 years earlier.\n\n\r\n                    “Unbelievable and I’m very humbled and honored to be in the same sentence with both of those guys,” said VanVleet, who took a video call from DeRozan in the Toronto locker room after the game. “It’s just a special night on a lot of different levels. I’m trying to enjoy it for now, but it’s not a championship or anything like that. It was a good game for me. I’ll enjoy the love for a couple of hours and get ready for the next one.”\n\n\r\n                    The fifth-year guard out of Wichita State easily topped his previous high of 36 points set last season by scoring 17 in the first quarter, 11 in the second, 18 in the third and eight more in the fourth before being lifted after the outcome was decided. He added three rebounds, three steals, three blocked shots and two assists. Toronto was plus-20 in his 37 minutes on the floor.\n\n\r\n                    VanVleet’s previous best for 3s in a regular-season game was seven. He made eight in a playoff game last year against Brooklyn.\n\n\r\n                    “I thought early on that the ball was coming off his hands so easily and the deep shots looked like there was hardly any effort,” Toronto coach Nick Nurse said. “There was something that was making them fly off so comfortably. Wherever he shot them from it seemed like a free throw line attempt, effort-wise.”\n\n\r\n                    Toronto, which entered second in the NBA in 3s and attempts per game, connected on 20 of 46 shots from beyond the arc. Once 2-8, the Raptors won for the seventh time in 11 games. They beat the reeling Magic for a second time in three nights and for the seventh consecutive time over the past three seasons.\n\n\r\n                    Norman Powell had 23 points for Toronto, and Kyle Lowry posted a triple-double with 14 points, 10 rebounds and 10 assists. \n\n\r\n                    Orlando, which has lost 12 of 14, tried almost every guard on its roster against the 6-foot-1 VanVleet with little to no success. He had three 3-pointers from at least 30 feet and hit a trio of catch-and-shoot 3s in transition. \n\n\r\n                    “I knew after my first (3-point) shot went in I was going to shoot the ball well,” VanVleet said. “I just tried to keep my foot on the gas and my teammates did a great job of finding me and screening for me. Once I hit like the fifth one, I knew it would be a good night for me.” \n\n\r\n                    The 26-year-old VanVleet equaled the franchise scoring record on a basket with 4:45 to play and then set the new mark on a layup with 3:46 left.\n\n\r\n                    “He legit was like, `Ya’ll keep playing,’” Lowry said. “It wasn’t forced to him; it was in rhythm and in the flow of the game. He’s just a hard-working, young kid from Rockford, Illinois, and everyone knows how I feel about him. He’s just a winner.”\n\n\r\n                    Nikola Vucevic had 21 points and 18 rebounds for the Magic. Evan Fournier scored 12 of Orlando’s first 14 points and finished with 21. Rookie guard Cole Anthony added 16 points and seven rebounds.\n\n\r\n                    TOWN HALLS\n\n\r\n                    The Magic will host the first of four virtual town halls featuring guard Michael Carter-Williams, coach Steve Clifford, CEO Alex Martins and Chief Diversity Officer Esu Ma’at on Wednesday as the franchise celebrates Black History Month. The town hall will focus on the state of diversity, equity and inclusion within the Magic staff, and fans are invited to join. \n\n\r\n                    “It’s an opportunity for us to keep the conversation going and bring awareness,” Clifford said.\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Missed their first six shots and fell behind 11-0, but responded by making seven of the next nine — including five straight 3s — to take a 23-18 lead. … Powell started after missing two games with a bruised quadriceps. OG Anunoby, who was listed as a game-time decision, missed his fourth straight game with a calf strain. … Lowry’s hip check to the right knee of Orlando forward Aaron Gordon on Sunday was upgraded to a Flagrant 1 foul by the NBA on Monday. Clifford denounced the play on Tuesday, saying, “At any level of basketball there’s no place in our game for that. You can end a guy’s career, you can end his season, just like what happened last year (with Lowry fouling Gordon). He’s a terrific player, but it’s an unfortunate play.” Lowry was booed by fans during pregame introductions.\n\n\r\n                    Magic: Orlando was without Gordon, who severely sprained his left ankle later in Sunday’s game against Toronto. Gordon is expected to miss more than a month. … With the Magic already minus power forwards Jonathan Isaac, Al-Farouq Aminu and Gordon because of injuries, the team welcomed the return of rookie Chuma Okeke. The 2019 first-round pick played for the first time since Dec. 31, when he sustained a bone bruise in his left knee and missed the next 16 games. He made his first four shots Tuesday and scored 10 first-half points for the first double-digit scoring night of his career. \n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: In the midst of a six-game road trip, Toronto plays at Brooklyn on Friday. \n\n\r\n                    Magic: Orlando hosts Chicago on Friday and Saturday in a two-game set.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996876.217182
}