{
  "game_id": "0022300996",
  "espn_id": "401585624",
  "date": "Mar 20, 2024",
  "matchup": "MIA @ CLE",
  "headline": "Terry Rozier's go-ahead 3-pointer with 14.5 seconds left helps the Heat beat the Cavaliers 107-104",
  "body": "CLEVELAND -- — Terry Rozier scored nine points in the final 1:24, including the go-ahead 3-pointer with 14.5 seconds on the clock, lifting the Miami Heat to a 107-104 victory over the Cleveland Cavaliers on Wednesday night.\n\n\r\n              Rozier converted a 4-point play before sinking a 26 footer that gave Miami a 105-102 lead. After Georges Niang made a layup for the Cavaliers, Rozier followed with two free throws with 2.8 seconds remaining.\n\n\r\n              Darius Garland had a chance to force overtime, but his off-balance, 3-point attempt was off the mark and Cleveland lost its third straight home game.\n\n\r\n              “This is why we went after Terry,\" in a trade with Charlotte on Jan. 23 Heat coach Erik Spoelstra said. “We wanted to have another guy who can make something happen late in games. He’s always been that kind of player in big moments with Charlotte and of course with Boston.\"\n\n\r\n              Jimmy Butler scored 30 points and Youngstown, Ohio native Rozier finished with 24, helping Miami pull within one-half game of Philadelphia for the sixth and final automatic playoff berth in the Eastern Conference. Nikola Jovic added 14 points.\n\n\r\n              “Terry put on a show, man, with half the arena there to see him tonight,” Butler said. “Basketball is supposed to be fun and him doing it somewhat at his crib, in front of his people, was something.”\n\n\r\n              Jarrett Allen had 25 points and 20 rebounds for the Cavaliers, who remained third in the East. Garland scored 20 points, Caris LeVert added 16 points and 12 assists, and Niang had 10 of his 18 points in the fourth quarter.\n\n\r\n              Cleveland was without three starters in All-Star shooting guard Donovan Mitchell (nasal fracture), power forward Evan Mobley (left ankle sprain) and small forward Max Strus (right knee strain). Mitchell will have his status updated next week.\n\n\r\n              “All are closer, but I can’t give you any projected timetable,” Cavaliers coach J.B. Bickerstaff said.\n\n\r\n              All-Star center Bam Adebayo (lower back contusion) and shooting guard Duncan Robinson (back discomfort) were unavailable for Miami. Both saw action Monday in a 98-91 loss at Philadelphia.\n\n\r\n              “Coach told me it was time to take a game off,” Adebayo said. “It was more maintenance than anything else.”\n\n\r\n              Rozier shot just 27.9% on 3-pointers over his first 21 games with the Heat, but made 5 of 6 in his Ohio homecoming.\n\n\r\n              “My teammates and my coaches kept reminding me who I am,” Rozier said. “They told me just to keep shooting. Knowing my guys believed in me meant a lot.”\n\n\r\n              The Heat built a 54-43 lead in the second quarter — aided by three Cleveland technical fouls in a 4 1/2-minute span — before going into halftime up 61-57. Butler had 20 points for Miami, while Allen paced the Cavaliers with 14 points and 10 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host New Orleans on Friday night.\n\n\r\n              Cavaliers: At Minnesota on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995333.37187
}