{
  "game_id": "0021900188",
  "espn_id": "401160830",
  "date": "Nov 17, 2019",
  "matchup": "LAL vs. ATL",
  "headline": "James, Lakers start fast in racing past Hawks 122-101",
  "body": "LOS ANGELES --  LeBron James wasn’t about to send Kobe Bryant home disappointed.\n\nWith the former Lakers great sitting courtside, the team’s current ranking superstar scored 12 of his 33 points during a breathtaking opening nine minutes for Los Angeles, which raced to a 25-point lead and handed the Atlanta Hawks their second ugly loss in 24 hours at Staples Center, 122-101 on Sunday night.\n\n“I'm just trying to put on a show for him and give him a reason to be like, ‘OK, we might come to another game,’“ James said.\n\nThe 34-year-old James said it was “fantastic” to play in front of Bryant, who helped the Lakers win five NBA titles during his 20-year career.\n\n“I know he came to a game last year,” James said. “Just having him in the building, knowing what he did to this franchise, and for me and my teammates what it means to be a part of Laker Nation, the Laker family, it's a beautiful thing. I was one of the kids who had the chance to come out straight out of high school. He did it and I was just watching him. It's just so surreal for me, a kid from Akron to be able to have a guy like Kobe take time out of his day. Even at this point in my career it's still special.”\n\nJames joined the Lakers last season.\n\n“I became part of the family and he welcomed me with open arms as well as everyone else. Just to have that support from one of the greatest Lakers to ever play is just special to me,” James said.\n\nIn a quarter full of highlights, James’ biggest play provided his first points. After JaVale McGee blocked Jabari Parker’s shot, James grabbed the ball, passed to Danny Green and took the return pass for a slam dunk that brought the crowd to its feet two minutes in.\n\nJames added two layups, a 3-point shot and a three-point play to help propel the Lakers to their 25-point lead with 3:17 still to play in the opening quarter.\n\nHe also fed Kentavious Caldwell-Pope for consecutive baskets. James finished with 12 assists for his 11th double-double this season.\n\n“He’s been at just an extraordinarily high level and dominating,” coach Frank Vogel said of James. “His effort on the defensive end has really spread throughout the group and the group has really bought into being dominant on the defensive end of the floor. We saw that in the first quarter with how we controlled the game from the start. Offensively, the shot making, his decision making, zero turnovers, 12 assists, I mean are you kidding me?”\n\nThe Hawks were routed 150-101 on Saturday night by the Clippers, who played without Kawhi Leonard.\n\nKyle Kuzma scored 17 points in the Lakers’ 11th win in 12 games. Rajon Rondo had 15, Anthony Davis 14, Caldwell-Pope 13 and Green and Alex Caruso 11 apiece.\n\nDavis had five of the Lakers’ 14 blocked shots.\n\nTrae Young scored 31 for the Hawks, who lost four of five on a swing through the West. Cam Reddish had 13 while Allen Crabbe, Parker and De’Andre Hunter each scored 11.\n\nAfter falling behind by 25, the Hawks stopped the Lakers’ onslaught by going on a 13-0 run to close to 34-22. They got to 40-30 before the Lakers pulled away again. Green put an emphatic stamp on a 69-41 halftime lead when he swooped in to corral James’ missed shot for a slam dunk with 11 seconds before the buzzer.\n\nJames then hit consecutive 3-pointers for the Lakers’ first points of the second half and added a nice fallaway jumper.\n\n“It’s tough when you can’t make shots,” Young said. “Give a lot of credit to them. They’re one of the best defensive teams in the league. We’ve just got to be better knocking down shots, working on our game and trying to be more crafty around defenses like them.”\n\n“They were making a lot of blocked shots, making a lot of big plays. We had a lot of things that didn’t go our way. That’s how our season’s been. We’ll get down big and we have to fight so hard to get back into the game that we take all the energy out of ourselves and hard to get ourselves back into the game.”\n\nTIP-INS\n\nHawks: Crabbe had a four-point play in the first quarter when he hit a 3-pointer and was fouled by Troy Daniels. He made the free throw to cut the deficit to 34-20. ... The Hawks have lost three straight and six of seven.\n\nLakers: With Avery Bradley out, Caldwell-Pope earned a second straight start and third of the season after scoring 16 points in 99-97 victory over Sacramento on Friday night. ... Dwight Howard energized the crowd when he blocked Parker’s shot early in the second quarter. ... Bryant was shown on the big screen with 4:25 left in the first half and rose to acknowledge a standing ovation.\n\nUNIQUE DOUBLE\n\nBack at Staples Center less than 24 hours after absorbing a 49-point loss to the Clippers, Hawks coach Lloyd Pierce asked if he preferred the games were split up. “Yes,” he said. “Back-to-back on the road is tough no matter who the opponent is. Obviously you have two special teams with a lot of special talent with both of the L.A. teams. It makes it extremely difficult.”\n\nUP NEXT\n\nHawks: Return home after a five-game road trip to host Milwaukee on Wednesday night.\n\nLakers: Host Oklahoma City on Tuesday night to finish a four-game homestand.\n\n----\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996031.96835
}