{
  "game_id": "0022000076",
  "espn_id": "401267236",
  "date": "Jan 01, 2021",
  "matchup": "PHX @ DEN",
  "headline": "Chris Paul helps Suns hold off Nuggets, improve to 5-1",
  "body": "DENVER -- — Chris Paul presented a convincing argument in persuading his coach to challenge a late call.\n\n\r\n                    There was no argument necessary to convince anyone who should take a clutch shot in the closing seconds.\n\n\r\n                    Paul came through yet again.\n\n\r\n                    The point guard hit a big jumper with 7.3 seconds remaining after a successful coach's challenge on the other end and the Phoenix Suns moved to an NBA-best 5-1 by holding off the scuffling Denver Nuggets 106-103 on Friday night. They were last 5-1 in 2009-10. \n\n\r\n                    Moments like this are precisely why the Suns acquired Paul in a deal with Oklahoma City. Paul led the NBA in clutch scoring last season.\n\n\r\n                    “Him being able to knock down shots, and the ability and will to take those shots, is huge for us,” Suns coach Monty Williams said. \n\n\r\n                    His lobbying skills proved just as powerful.\n\n\r\n                    With Phoenix leading 102-100 with around 30 seconds remaining, Mikal Bridges was called for a foul that would've sent Gary Harris to the line. But on the advice of Paul, Williams decided to challenge the play. Replays appeared to show Bridges sliding underneath Harris near the basket — and with no contact — as Harris lost the ball.\n\n\r\n                    “Usually, fouls aren’t overturned,” Williams explained. “But he’s like, ‘Coach, why not?’ ... That's how it happened. He’s an asset to our team in many ways.\"\n\n\r\n                    Phoenix's Deandre Ayton won the jump ball and Paul hit a jumper to help send the Suns to the victory after blowing a 16-point lead. Jamal Murray's shot at the buzzer rimmed out. \n\n\r\n                    Ayton had 22 points and 11 rebounds, Devin Booker added 22, and Paul 21 for Phoenix, which won the night before in Utah. That's two big wins over two playoff teams from a season ago.\n\n\r\n                    “It just shows our resilience,” Paul said about blowing a second-half lead against Denver and bouncing back. “We want to learn in these situations and win at the same time.”\n\n\r\n                    Murray returned from a bruised right elbow and found his range early, scoring 14 of his 31 points in the first quarter. \n\n\r\n                    Nikola Jokic finished with 17 points, 11 assists and nine rebounds despite foul trouble. The Denver big man is posting big numbers but his production isn’t translating into wins as the Nuggets fell to 1-4. The Nuggets are struggling to find their rhythm after making the Western Conference finals last season.\n\n\r\n                    “Did a lot of really good things. Gave ourselves a chance,” Nuggets coach Michael Malone said. “But this is not Year 1 or Year 2 where that’s acceptable. We lost another game. We lost another game at home. We have to be better.”\n\n\r\n                    The Nuggets were missing forward Michael Porter Jr., who was held out in accordance with the league’s health and safety protocols concerning COVID-19. Gone with him were 19.5 points per game.\n\n\r\n                    Phoenix appeared on its way to an easy win when Booker extended the lead to to 87-71 on a 3-pointer with 2:17 left in the third. But Denver stormed back, with Monte Morris giving the Nuggets a 98-97 lead on a 3-pointer with 2:41 remaining. Paul then hit two free throws and Booker a 3-pointer to restore some separation down the stretch. \n\n\r\n                    TIP-INS\n\n\r\n                    Suns: F Dario Saric (sore right quad) sat out on the second night of a back-to-back as a precaution. ... Williams said F/C Jalen Smith (sprained left ankle) is “on a course to be back here soon.\"\n\n\r\n                    Nuggets: F JaMychal Green scored eight points in his Nuggets debut. The free-agent pickup missed the start of the season with a strained left calf. “Just happy to be back out there,\" he said. \n\n\r\n                    TEACHING MOMENT\n\n\r\n                    Nuggets coach Michael Malone is using the situation with Porter as a way to further emphasize the importance of adhering to all of the safety protocols in regard to the virus. Porter could miss multiple games because of contact tracing.\n\n\r\n                    “These are real protocols. They’re in place for a reason,” Malone said. “Unfortunate, but this is the current situation we’re in.”\n\n\r\n                    PRAISE FOR PAUL\n\n\r\n                    Count Malone as a big fan of Paul.\n\n\r\n                    “A first-ballot Hall of Famer,” Malone said.\n\n\r\n                    UP NEXT \n\n\r\n                    Suns: Begin a two-game homestand Sunday against the Los Angeles Clippers.\n\n\r\n                    Nuggets: At Minnesota on Sunday. The Nuggets have an eight-game winning streak over the Timberwolves.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997771.141176
}