{
  "game_id": "0022000161",
  "espn_id": "401267321",
  "date": "Jan 12, 2021",
  "matchup": "LAL @ HOU",
  "headline": "James scores 26 as Lakers roll over Rockets 117-100",
  "body": "HOUSTON -- — James Harden publicly acknowledged his discord with the Houston Rockets for the first time Tuesday night following back-to-back blowout losses to the Los Angeles Lakers. \n\n\r\n                    “We're just not good enough ... I love this city. I literally have done everything that I can,” Harden said. “I mean, this situation is crazy. It’s something that I don’t think can be fixed.”\n\n\r\n                    Harden had remained quiet through months of speculation that he is unhappy in Houston. Numerous reports have indicated he’s looking to be shipped to Brooklyn to play with former Oklahoma City teammate Kevin Durant, who left and became an NBA champion with Golden State. For all his accomplishments, Harden is still seeking an NBA title.\n\n\r\n                    He’s been asked repeatedly to address the trade rumors since the season began but has deflected questions and refused to reveal any frustration.\n\n\r\n                    That all changed after a 117-100 blowout loss to the Lakers on Tuesday night. The Lakers led by 30 points in the third quarter after leading by 27 during a 120-102 on Sunday. \n\n\r\n                    Harden didn't elaborate or take any additional questions following his initial comments.\n\n\r\n                    Harden’s words will surely be noticed by NBA officials, but it wouldn’t seem that what he said postgame would merit a trade demand — and subject him to a fine. The league has a longstanding rule about players not being able to publicly express a desire to be traded and has issued $50,000 fines in recent years to players like Anthony Davis and Dewayne Dedmon for breaking that policy.\n\n\r\n                    Harden was fined $50,000 earlier this season for conduct detrimental to the league related to him not following the health and safety protocols put into place by the NBA and the National Basketball Players Association for navigating a season during a coronavirus pandemic.\n\n\r\n                    Harden won each of the last three scoring titles by notable margins — 2.3 points over Davis in 2017-18, 8.1 points over Paul George in 2018-19 and 3.8 points over Bradley Beal last season. His 24.8-point average so far this season ranked 18th in the NBA, still putting him among the leaders but obviously well off his usual pace.\n\n\r\n                    He’s averaged at least 25 points per game in each of his eight full seasons with the Rockets.\n\n\r\n                    The Rockets traded Russell Westbrook to the Washington Wizards in exchange for John Wall and a future first-round draft pick before the season in what was seen as an attempt to pacify Harden.\n\n\r\n                    So far, the pairing of the two ball-dominant guards hasn't gone well. The Rockets are 3-6 and looked completely overmatched in their last two games against the reigning champions.\n\n\r\n                    Wall was asked how he and Harden have worked together on the court so far after Tuesday's game. \n\n\r\n                    “It’s a little rocky,\" Wall said. “I don’t think it’s the best it could be, that’s all I could say.”\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997331.667694
}