{
  "game_id": "0022400469",
  "espn_id": "401705035",
  "date": "Jan 03, 2025",
  "matchup": "CHA @ DET",
  "headline": "Tobias Harris scores 24 points and Pistons hold off Hornets 98-94",
  "body": "DETROIT -- — Tobias Harris had 24 points and 10 rebounds as the Detroit Pistons held off the Charlotte Hornets 98-94 on Friday night for their fifth win in six games.\n\n\r\n              Cade Cunningham added 18 points for the Pistons, while Jalen Duren had 10 points and 14 rebounds.\n\n\r\n              Miles Bridges had 20 points and Mark Williams scored 18 for Charlotte, which has lost nine in a row.\n\n\r\n              The Pistons outscored Charlotte 14-12 in the fourth, hitting 30% (6 of 20) of their shots while Charlotte went 4 for 19 (21.1%).\n\n\r\n              Charlotte started the period by missing 11 of its first 12 shots and committing five turnovers. That allowed Detroit to build a 92-85 lead with 4:30 to play.\n\n\r\n              The Pistons continued to foul — a problem they had throughout the game — but Charlotte only made two of their first seven free throws in the quarter. \n\n\r\n              Takeaways\r\n              Hornets: Charlotte only got nine offensive rebounds to Detroit's 14.\n\n\r\n              Pistons: Detroit played its first game since Jaden Ivey broke his left leg in Wednesday's win over Orlando. Wendell Moore Jr. started at shooting guard, but didn't score in 15 minutes. As expected, Malik Beasley got most of the playing time, scoring 12 points in 31 minutes.\n\n\r\n              Key moment\r\n              The Pistons were down 47-46 with 4:45 left in the second quarter, and Charlotte went on an 11-2 run before Bridges ended the half with a 30-foot 3-pointer to make it 65-52. The Pistons came back to outscore the Hornets 32-17 in the third quarter.\n\n\r\n              Key stat\r\n              Even thought Charlotte was forced to foul three times in the final minute, they still only committed 10 fouls to Detroit’s 27. However, they weren’t able to take advantage, missing 11 of 30 free throws.\n\n\r\n              Up next\r\n              The Hornets continue their road trip on Sunday against the Cleveland Cavaliers, while the Pistons finish a home back-to-back when they host the Timberwolves on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997710.02
}