{
  "game_id": "0021500563",
  "espn_id": "400828450",
  "date": "Jan 10, 2016",
  "matchup": "CHA @ DEN",
  "headline": "Gallinari helps Nuggets hang on for 95-92 win over Hornets",
  "body": "DENVER -- Rookie guard Emmanuel Mudiay returned from a month away with a more refined jumper and a better understanding of the game.\nThat's what shooting countless shots in the gym and watching highlights of Dwyane Wade will do. Then again, Mudiay had little else to occupy his time as he waited for his sprained ankle to heal.\nDanilo Gallinari scored 27 points, Mudiay added 11 and the Denver Nuggets held off Charlotte 95-92 on Sunday night, extending the Hornets' losing streak to seven games.\nMudiay was back on the court after missing 14 games. The Nuggets needed him, too, with point guard Jameer Nelson out after straining his left hip flexor. Denver also was missing forward Kenneth Faried following the birth of his daughter.\n\"Just wanted to get out there again, see how I felt,\" Mudiay said. \"I felt pretty good.\"\nThe Nuggets didn't score over the final 4:17 but squeaked out the victory after Nicolas Batum's shot at the buzzer clanged off the side of the rim.\nCody Zeller and Jeremy Lamb each scored 15 for the Hornets, who wound up winless on a four-game road swing. Batum had nine points after missing the previous four games with a sprained toe on his right foot.\n\"I could do better than that,\" Batum said.\nDenver was seemingly in control leading 95-85 with 4:17 remaining after a 3-pointer by Will Barton. But then the Nuggets went cold and the Hornets took advantage, cutting the deficit to three on a 3-pointer by Marvin Williams with 45.7 seconds left.\nAfter Gallinari missed an off-balance, left-handed 3-point attempt with 18.8 seconds to go, Charlotte called timeout to set up a play. Kemba Walker was off the mark on a shot with 3.9 seconds left and then Batum missed another at the horn.\n\"We've just got to get back on track, start playing defense,\" Zeller said. \"Get back to what we were doing at the beginning of the season when we were winning.\"\nMudiay put all his down time to good use as he honed his jumper and watched film of Wade. More specifically, how the Miami Heat star attacks the lane.\n\"Dwyane Wade's one of the real, real good players on playing downhill,\" said Mudiay, who played Sunday for the first time since Dec. 11. \"When he gets into the paint, he slows down. I watched a lot of that. That helped me.\"\nAfter one of their best opening quarters of the season, the Nuggets extended their lead to 13 early in the second. But that quickly evaporated, with the Hornets going on a 21-2 run that helped them take a 56-53 lead at halftime.\nDenver nearly let the Hornets back into the game late, too.\n\"It was kind of an ugly win at the end,\" Gallinari said. \"I'll take it. We needed one.\"\nTIP-INS\nHornets: With a jumper in the first quarter, Walker moved into sole possession of sixth place on the Hornets' career points list. ... Frank Kaminsky had 14 points.\nNuggets: Jusuf Nurkic had seven points, seven rebounds and a technical in 13:54. ... Gallinari had his fifth straight game of 20 or more points.\nQUITE A PASS\nNikola Jokic had a career-best nine assists, including one when he missed the rim on what appeared to be a shot. Gallinari was there to dunk it.\n\"Did they give him the assist on the one he threw it up and I dunked it? That was not an assist,\" Gallinari laughed. \"I'm happy for (Jokic) because he understands the game.\"\nNO PLACE LIKE HOME?\nWhen the schedule was announced, Denver coach Michael Malone was looking forward to this eight-game homestand. But the Nuggets have struggled at Pepsi Center this season, going 6-11.\n\"It's a challenge for us to find a way to generate our own energy, because the reality is that we do not have a great home-court advantage,\" Malone said. \"We have to build this up where our fans are excited enough to come here to support us.\"\nUP NEXT\nHornets: Host Atlanta on Wednesday.\nNuggets: Host Golden State on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994384.4157288
}