{
  "game_id": "0022400852",
  "espn_id": "401705418",
  "date": "Feb 28, 2025",
  "matchup": "CLE @ BOS",
  "headline": "Mitchell scores 41, Cavaliers overcome 22-point deficit to beat the Celtics 123-116",
  "body": "BOSTON -- — Donovan Mitchell scored 41 points, including 12 in the fourth quarter, to help the Cleveland Cavaliers rally from 22 points down and stun the Boston Celtics 123-116 on Friday night in the final regular-season meeting of the Eastern Conference’s top two teams. \n\n\r\n              Darius Garland added 20 points and seven assists. Evan Mobley finished with 17 points and 12 rebounds for his 27th double-double to give Cleveland a split in the four-game series with the playoffs just over two months away. \n\n\r\n              Jayson Tatum finished with 46 points, 16 rebounds and nine assists. Jaylen Brown added 37 points, marking the first time Boston’s top stars both posted 30-point games this season. \n\n\r\n              The Cavaliers had all of their players available, while the Celtics played without starters Jrue Holiday (finger) and Kristaps Porzingis (illness). \n\n\r\n              It did nothing to stymie the Celtics early as they sprinted out to a 25-3 lead. But after a cold start the Cavs responded, going on a 41-22 run to get back into the game. \n\n\r\n              Takeaways\r\n              Cavaliers: The victory, even without the Celtics at full strength, is a huge mental boost for a Cavs team that was eliminated 4-1 by the Celtics in the second round of the playoffs last season.\n\n\r\n              Celtics: Boston is now just 18-11 at home. \n\n\r\n              Key moment\r\n              Trailing 114-110, the Celtics got back-to-back stops, each followed by buckets by Brown to tie the game. Mitchell scored on a floater to put the Cavaliers back in front. Then, following a miss by Brown on Boston’s next possession, Mitchell hit a driving layup and was fouled. He completed the three-point play to put the Cavs in front 119-114 with 1:57 remaining.\n\n\r\n              Key stat\r\n              Tatum had 30 points, nine rebounds and seven assists in the opening 24 minutes, the first player ever to reach those totals in a half during the play-by-play era (1997-98).\n\n\r\n              Up next\r\n              Both teams play on Sunday. The Cavaliers host the Trail Blazers. The Celtics host the Nuggets.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998308.496552
}