{
  "game_id": "0022301133",
  "espn_id": "401585761",
  "date": "Apr 07, 2024",
  "matchup": "MIA @ IND",
  "headline": "Myles Turner's double-double helps Pacers stay ahead of Miami in East with 117-115 win over Heat",
  "body": "INDIANAPOLIS -- — Indiana Pacers center Myles Turner started the week by dislocating his right index finger.\n\n\r\n              He ended it with a painful message for the Miami Heat: Indiana intends to keep the No. 6 seed in the East — and perhaps improve upon it.\n\n\r\n              Turner finished with 22 points and 13 rebounds in 37 minutes Sunday, capping the performance by making two key free throws in the waning seconds as the Pacers beat the Heat 117-115 to extend their lead over No. 7 Miami to 1 1/2 games.\n\n\r\n              “We know what time of the year it is, we know we control our own destiny,” Turner said. “This time of year, it's something I feel is necessary. Like, everybody is dealing with something right now, so you have to buckle down and play through injuries.”\n\n\r\n              Turner certainly did his part, leading seven Pacers players in double figures. T.J. McConnell also had 22 points on 11-of-14 shooting to go with five assists off the bench as the Pacers won for the fourth time in five games to retain their hold on the sixth and final guaranteed playoff spot.\n\n\r\n              Jimmy Butler had 27 points, seven rebounds and seven assists for the Heat. Tyler Herro scored 21 points but had a free throw erased because of a lane violation on Kevin Love with 3.6 seconds to go and the Heat down two. \n\n\r\n              Bam Adebayo and Caleb Martin each scored 20 and Adebayo had 12 rebounds for Miami, which lost for just the second time in six games as it tries to avoid staying in the league's Play-In tournament.\n\n\r\n              “You want to end up playing games of meaning, but when you say they are games of meaning, that also means they are games of consequences,” Heat coach Erik Spoelstra said. “That's the whole point of this right now in both conferences. There's going to be wild swings of emotion.”\n\n\r\n              But those wild swings didn't really show up Sunday.\n\n\r\n              Indiana never trailed over the final 45 1/2 minutes even as Miami made it difficult late. The Heat cut the deficit to one twice in the final 3 1/2 minutes, but the Pacers answered both times on a festive day for Pacers fans.\n\n\r\n              The near sellout crowd gave team owner Herb Simon, the longest-tenured owner in NBA history, a standing ovation during an early timeout following his election to the 2024 Hall of Fame class.\n\n\r\n              And for a team trying to snap a three-year playoff drought, which has lost a franchise-record nine straight playoff games, hasn't won a postseason series in a decade and whose young roster is filled largely with players who have little or no playoff experience, Sunday's game was the biggest since the In-Season Tournament — and Indiana played like it.\n\n\r\n              It controlled most of the game until Miami's 12-4 run cut the deficit to 103-101 with 3:14 to go. Indiana answered with Ben Sheppard's layup, Aaron Nesmith's two free throws and Pascal Siakam's three-point play to make it 110-103 with 1:58 left. \n\n\r\n              Miami made it a one-point game again with 11 seconds to go on Herro's 3 and had a chance to do it again, after Turner made two free throws with his father in town and Aaron Nesmith made two more, with Herro at the free-throw line. But after Love drew the lane violation, Indiana inbounded the ball to close it out.\n\n\r\n              “We certainly could have played better, but we played well enough to win,” Pacers coach Rick Carlisle said. “We got it done and that's the important thing.”\n\n\r\n              Indiana now holds tiebreakers for winning season series against Milwaukee, New York, Miami and Philadelphia. The Cavaliers would join the list if Indiana wins at Cleveland later this week.\n\n\r\n              UP NEXT\r\n              Heat: Play their final regular season road game Tuesday at Atlanta.\n\n\r\n              Pacers: Continue their playoff push Tuesday at Toronto.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995323.412189
}