{
  "game_id": "0022400273",
  "espn_id": "401704839",
  "date": "Nov 24, 2024",
  "matchup": "MIA vs. DAL",
  "headline": "Butler scores season-high 33, Heat hold off Mavericks 123-118 in OT",
  "body": "MIAMI -- — Jimmy Butler scored a season-high 33 points, leading the Miami Heat past the Dallas Mavericks 123-118 in overtime on Sunday night.\n\n\r\n              Bam Adebayo had 19 points and 11 rebounds, Tyler Herro had 18 points and 10 rebounds, Alec Burks scored 15 and Pelle Larsson added 14 for Miami.\n\n\r\n              Kyrie Irving had 14 of his 27 points in the fourth quarter for Dallas, which had its four-game winning streak snapped. P.J. Washington scored 21, Naji Marshall had 20, Klay Thompson scored 15 and Dereck Lively II had 14 points and 13 rebounds for Dallas.\n\n\r\n              The Mavericks played without Luka Doncic, still sidelined with a sprained right wrist. The Heat were without Terry Rozier, who was expected to play but wound up being scratched with a recurrence of right foot discomfort.\n\n\r\n              Takeaways\r\n              Mavericks: Dallas has played 17 games this season — and 11 of them have been decided by eight points or less. The Mavericks are 4-7 in those close games, 5-1 in all others.\n\n\r\n              Heat: Butler has scored at least 30 points in back-to-back games. It's the ninth time — including playoffs — that he's had a multi-game streak of scoring at least 30 since joining the Heat.\n\n\r\n              Key moment\r\n              Butler's dunk tied the game with 4.4 seconds left in regulation and the Heat unsuccessfully argued he was fouled by Lively on the play. Spencer Dinwiddie's desperation 3-point try for Dallas rimmed out as time expired and to overtime they went. Dinwiddie was 0 for 9 from 3-point range in the game.\n\n\r\n              Key stat\r\n              There were two lead changes in the game's first 57 seconds. There was one in the next 43 minutes — then six more the rest of the way.\n\n\r\n              Up next\r\n              Dallas goes to Atlanta on Monday night to wrap up a three-game trip. Miami plays host to Milwaukee in an NBA Cup game on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996929.9472861
}