{
  "game_id": "0021800013",
  "espn_id": "401070216",
  "date": "Oct 17, 2018",
  "matchup": "PHX vs. DAL",
  "headline": "Booker's late onslaught lifts Suns past Mavs 121-100",
  "body": "PHOENIX --  Much of the talk going into the Dallas-Phoenix season opener centered on rookies Deandre Ayton and Luka Doncic.\n\nBut it was Devin Booker's show, providing impressive evidence why the Suns thought him worth that five-year, $158 million deal.\n\nBooker scored 19 of his 35 points in the final 6:44 and lifted the Phoenix Suns to a 121-100 victory over the Dallas Mavericks in the teams' season opener on Wednesday night.\n\n\"I'm not surprised. Suns fans are not surprised,\" Phoenix first-year coach Igor Kokoskov said. \"That's who he is.\"\n\nThe 21-year-old guard, who missed the entire preseason after undergoing a surgical procedure on his right (shooting) hand, sank four 3s, converted a three-point play, made a driving layup and hit two free throws after Dallas had cut what had been a 16-point lead to four.\n\n\"Just caught a rhythm,\" Booker said. \"It was that time of the game. We let them back in when we should have put them away, so I felt it was my job to make the plays to win the game.\"\n\nAyton got the best of Doncic on this night, but there will be many more to follow.\n\nAyton, the No. 1 overall pick in the draft, made 8 of 11 shots for 18 points, grabbed 10 rebounds and had six assists.\n\nDoncic, the No. 3 overall pick, struggled from the field, making 5 of 16 shots -- 0 of 5 3-pointers -- for 10 points. He had four assists and eight rebounds.\n\n\"I had a lot of fun,\" Ayton said. \"This is the most fun I've ever had playing basketball. Being at the top-top level, I wouldn't say I had one bad thing to say about this game.\"\n\nDoncic said he \"was really happy that I could make my dream come true, but it wasn't the best game.\"\n\nTrevor Ariza added 21 points, Josh Jackson 18 and T.J. Warren 17 for the Suns, who gave Kokoskov a victory in his NBA head coaching debut.\n\nKokoskov had Booker playing point guard down the stretch.\n\n\"You're trying to land the plane with your best unit,\" Kokoskov said.\n\nThe Mavericks, already without Dirk Nowitzki and Harrison Barnes, lost Devin Harris to a strained left hamstring in the first quarter and never led after the game's opening minute. Dwight Powell led six Dallas players in double figures with 16 points.\n\nDallas coach Rick Carlisle said the team's defense was the problem, particularly in the first and fourth quarters.\n\n\"Forty-six points (allowed) in the second and third quarters is pretty decent,\" he said. \"... but 75 combined in the first and fourth is disastrous.\"\n\nAyton made his first shot, was fouled by Doncic, and the three-point play put Phoenix ahead 3-2. The Suns led the rest of the night.\n\nPhoenix twice stretched the lead to 16 in the third quarter and was up 83-73 entering the fourth.\n\nBut consecutive 3s by Dallas' Wesley Matthews and Jalen Brunson cut the Suns' lead to 94-90 with seven minutes to play.\n\nBooker followed with a driving layup, added a 3-pointer as the shot clock expired and converted a three-point play to put Phoenix up 102-94 with 4:34 to go.\n\nThe Suns made 19 of 34 3s, seven of nine in the fourth quarter.\n\nTIP-INS\n\nMavericks: Nowitzki, entering his 21st NBA season, is out indefinitely recovering from left ankle surgery. ... Barnes missed the opener with a right hamstring strain. ... Doncic was part of the Slovenia national team coached by Kokoskov that won the EuroBasket gold medal in 2017. ... Dallas was 10 of 33 on 3-pointers.\n\nSuns: G Jamal Crawford, whose signing was announced earlier in the day, was not in uniform. ... Phoenix has won six straight against Dallas, sweeping the three games last season, when the Suns won a league-worst 21. ... Isaiah Canaan, coming back from a gruesome leg injury sustained on the same court last season, got the start at point guard. ... Canaan was one of nine players to start at point guard for Phoenix last season.\n\nUP NEXT\n\nMavericks: Host Minnesota on Saturday.\n\nSuns: At Denver on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995111.64148
}