{
  "game_id": "0022000171",
  "espn_id": "401307510",
  "date": "Mar 30, 2021",
  "matchup": "ATL @ PHX",
  "headline": "Suns turn away late Hawks rally for a 117-110 victory",
  "body": "PHOENIX -- — Devin Booker scored 21 points, Dario Saric added 20 and the Phoenix Suns held on in the final minutes to beat the Atlanta Hawks 117-110 on Tuesday night.\n\n\r\n                    The Suns have won six of their past seven games, while the Hawks have dropped four of five. Phoenix's Jae Crowder added 19 points and made 5 of 8 of his 3-point attempts, including a huge one with 23 seconds left that sealed the win. \n\n\r\n                    The late-game heroics were needed after the Suns let an early 16-point lead slowly slip away.\n\n\r\n                    “Everybody wants a pretty win,” Suns coach Monty Williams said. \"I just want to win. You have to take them any way you get them.”\n\n\r\n                    Atlanta trailed for nearly the entire game until Trae Young made two free throws to tie it at 103-all with 3:31 remaining, but the Hawks could never get the lead. Deandre Ayton's putback after a Booker miss pushed the Suns ahead 111-108.\n\n\r\n                    Crowder splashed home a 3-pointer — while getting fouled — and finished off the four-point play with a free throw to give Phoenix an insurmountable 115-108 advantage with 23 seconds left.\n\n\r\n                    “We closed the game out,” Suns guard Chris Paul said “But we shouldn't have been in that situation.”\n\n\r\n                    Ayton finished with 13 points and 14 rebounds, while Paul had 12 points and eight assists. Crowder had his stellar shooting night after making just 2 of 18 3-pointers over his previous two games. \n\n\r\n                    Bogdan Bogdanovic led Atlanta with 22 points and Young had 19 points and 13 assists.\n\n\r\n                    The Hawks trailed by 12 points at halftime, but cut the Suns' advantage to 89-85 by the end of the third quarter. Atlanta made 12 of 18 shots (67%) from the field in the third.\n\n\r\n                    “We got a rhythm, got some stops and got back into the game,” Hawks coach Nate McMillan said. “We just weren’t able to finish it.”\n\n\r\n                    Phoenix got some good production from the bench, especially Saric, who made 7 of 8 shots from the field, including all three of his 3-pointers. He added five rebounds and two assists in just 18 minutes.\n\n\r\n                    Atlanta cut the lead to two early in the fourth, but Saric responded with a 3-pointer and a layup to push Phoenix's advantage back to 94-87. Saric added a perfect baseline bounce pass to a cutting Torrey Craig, who dunked to put the Suns ahead 98-90 a few minutes later.\n\n\r\n                    The Suns pushed to a 64-52 halftime lead, getting a nice boost from the bench during their time on the floor. Saric led Phoenix with 13 points, while Crowder had 12 and Booker added 10.\n\n\r\n                    Clint Capela and Young both had 10 points for the Hawks before the break. Capela finished with 14 points and 16 rebounds.\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: F De'Andre Hunter didn't play because of right knee soreness. He's averaging 16 points and five rebounds. ... F John Collins didn't play in the second half because of a sore ankle. McMillian said Collins stepped on someone's foot in the first half, turning his ankle. He tried to play through the injury but wasn't effective. The forward finished with nine points, four rebounds and three assists. ... Atlanta fell below .500 with the loss and has a 23-24 record.\n\n\r\n                    Suns: F/C Frank Kaminsky was not available for the game because he was placed in the league's health and safety protocol. He's the fifth different Suns player who has missed time in the protocol. ... F Abdel Nader (right knee soreness) was also out. ... Mikal Bridges had a spectacular dunk with less than two minutes left, navigating around the Atlanta defense for a flush that put the Suns up 109-105. ... The Suns improved to 32-14 this season.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: At San Antonio on Thursday.\n\n\r\n                    Suns: Host the Bulls on Wednesday. \n\n\r\n                    ------\n\n\r\n                    Follow David Brandt at www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997631.631021
}