{
  "game_id": "0021901311",
  "espn_id": "401224786",
  "date": "Aug 13, 2020",
  "matchup": "MEM vs. MIL",
  "headline": "Grizzlies roll past Bucks 119-106, reach West play-in round",
  "body": "LAKE BUENA VISTA, Fla. --  With their season on the line, Jonas Valanciunas and Ja Morant teamed up to make history and keep the Memphis Grizzlies' playoff hopes alive.\n\nValanciunas and Moranth had triple-doubles, Dillon Brooks scored 31 points and the Grizzlies beat the Milwaukee Bucks 119-106 on Thursday to wrap up a spot in the play-in tournament that will determine the eighth and final seed in the Western Conference playoffs.\n\nThis marked the first time in franchise history that two Grizzlies had triple-doubles in a game. The team effort helped the Grizzlies bounce back after losing six of their first seven games since the NBA returned from a 4 1/2-month layoff.\n\n\"I'm happy that we responded,\" said Valanciunas, who had 26 points, 19 rebounds and 12 assists. \"We showed character. We're not going home. We're going to fight until the last second.\"\n\nDillon Brooks added 31 points as Memphis never trailed while capitalizing on the fact Milwaukee was missing Giannis Antetokounmpo. The reigning MVP was serving a one-game suspension after head-butting Moritz Wagner in a 126-113 victory  over the Washington Wizards on Tuesday.\n\nThe Grizzlies (34-39) tied for ninth place in the Western Conference with Phoenix, which beat Dallas 128-102 on Thursday. Memphis advances to the play-in round because it owns the head-to-head tiebreaker advantage over Phoenix.\n\nMemphis now faces Portland (35-39), which earned a spot in the play-in round by edging the Brooklyn Nets 134-133 on Thursday night.\n\nAs the No. 9 team, Memphis must beat Portland two straight times to advance to face the top-seeded Los Angeles Lakers in the first round.\n\nMemphis hasn't been to the playoffs the last two years after making seven straight postseason appearances from 2011-17.\n\n\"It's great to see in a meaningful game that our guys just stuck with it,\" Grizzlies coach Taylor Jenkins said. \"We're going to need that on Saturday -- even more and more and better and better.\"\n\nValanciunas earned the game ball after getting his first double-double in his 559th career NBA game. The 28-year-old Valanciunas' previous career high in assists was five.\n\n\"I'm definitely going to keep that ball for a long time to show my kids that Daddy did it,\" Valanciunas said.\n\nMorant had 12 points, 13 rebounds and 10 assists.\n\nThis marked the first time two teammates posted triple-doubles in the same game since Miami's Bam Adebayo and Jimmy Butler did it Dec. 10 in a 135-121 overtime victory over Atlanta.  Valanciunas and Morant are the 12th pair of teammates to post triple-doubles in the same game, including the postseason.\n\nBrook Lopez scored 19 to lead five Bucks in double figures. Frank Mason had 18, Donte DiVincenzo collected 17, Khris Middleton 14 and D.J. Wilson 12.\n\nThis game was meaningless for the Bucks, who already had clinched the No. 1 seed in the Eastern Conference for a second straight season. But it meant everything for the Grizzlies and Jenkins, who was an assistant on Bucks coach Mike Budenholzer's staff last season and previously worked for him in Atlanta.\n\nIt was quickly apparent which of these two teams had the most incentive. Memphis led by as many as 23.\n\n\"You'd have to be head in the sand really deep to not understand everything that was at stake today,\" Budenholzer said. \"Taylor and his group have done such a great job this year. They earned it. They played well today. They were sharp. Guys really stepped up.\"\n\nTIP-INS\n\nBucks: Starting guard Wesley Matthews missed a second straight game with a sore right adductor. Budenholzer remains confident that Matthews will be ready for the playoffs. \"We feel like everything's in a reasonably good place,\" Budenholzer said before the game. \"Probably just smartest not to push it today, give him another day or two. We don't expect it to linger or be a problem past today.\"\n\nGrizzlies: Morant ended the regular season averaging 17.8 points and 7.3 assists. The only rookies in NBA history to average at least 17 points and seven assists are Oscar Robertson (1960-61), Magic Johnson (1979-80), Isiah Thomas (1981-82), Damon Stoudamire (1995-96), Allen Iverson (1996-97) and Trae Young (2018-19). ... Valanciunas has collected at least 10 rebounds in seven straight games, the longest active streak in the NBA. ... Memphis was the designated home team. Former Grizzlies Tony Allen and Zach Randolph were included among the team's \"virtual fans\" in the arena.\n\nMIDDLETON JUST SHY OF 50-40-90\n\nMiddleton shot 5 of 13 and was just shy of becoming the ninth NBA player to finish a season shooting at least 50% from the floor, 40% from 3-point range and 90% from the foul line. He ended up shooting 49.7% on field-goal attempts, 41.5% on 3-pointers and 91.6% on free throws.\n\nUP NEXT\n\nThe Bucks will face the Orlando Magic in the first round of the playoffs starting Tuesday. The Bucks swept four regular-season meetings with Orlando.\n\nThe Grizzlies move on to the West's play-in tournament.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995670.443687
}