{
  "game_id": "0022400200",
  "espn_id": "401704766",
  "date": "Nov 09, 2024",
  "matchup": "TOR @ LAC",
  "headline": "Harden, Powell score 24 points apiece as the Clippers hold off the Raptors 105-103",
  "body": "INGLEWOOD, Calif. -- — James Harden had 24 points and 12 rebounds, Norman Powell added 24 points and the Los Angeles Clippers barely hung on to beat the Toronto Raptors 105-103 on Saturday night for their fourth straight victory.\n\n\r\n              Ivica Zubac had 14 points and 12 rebounds for the Clippers, who have won three straight at Intuit Dome after starting 0-4 in their lavish new home.\n\n\r\n              Ochai Agbaji and Immanuel Quickley scored 21 points apiece for the Raptors, who have lost three straight and seven of eight.\n\n\r\n              After Quickley hit a tying 3-pointer with 39 seconds left, Powell and Harden combined to miss three of six free throws to leave the door open for Toronto. But Quickley and RJ Barrett both missed tough short shots under defensive pressure before Jakob Poeltl missed a putback attempt with 4.1 seconds left.\n\n\r\n              Kawhi Leonard still hasn't played this season while rehabilitating his right knee and won't travel on the Clippers' upcoming three-game trip, coach Tyronn Lue said.\n\n\r\n              Takeaways\r\n              Raptors: Quickley was outstanding in the fourth quarter of his first appearance since missing eight games with a pelvic bruise.\n\n\r\n              Clippers: LA showed resilience in its third set of back-to-back games already this season after winning in Sacramento on Friday.\n\n\r\n              Key moment\r\n              Toronto was down three when Poeltl made his first free throw and intentionally missed his second, getting the ball to rebound right back to him. But he missed his 9-foot putback, and Harden threw the ball down the floor.\n\n\r\n              Key stat\r\n              Kevin Porter Jr. had 15 points in his highest-scoring performance since returning to the NBA this fall after spending a year out of the league following a domestic violence assault charge in September 2023. He averaged 19.3 points per game for Houston in 2022-23.\n\n\r\n              Up next\r\n              The Clippers visit the Thunder on Monday, and the Raptors stay in LA to face the Lakers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764996999.5757692
}