{
  "game_id": "0021900701",
  "espn_id": "401161343",
  "date": "Jan 28, 2020",
  "matchup": "MIA vs. BOS",
  "headline": "Hayward scores 29, Celtics hold off Heat 109-101",
  "body": "MIAMI --  The Eastern Conference standings are not difficult to decipher. There’s Milwaukee on top, and then a five-team race for second place.\n\nAnd the Boston Celtics made the mess even messier.\n\nGordon Hayward scored 29 points and grabbed nine rebounds, Jaylen Brown added 25 points and the Celtics led most of the game on the way to beating the Miami Heat 109-101 on Tuesday night.\n\n\"Every game is important,” Hayward said. “Every single one we play is important in the playoff race. We're all so close together so ... each one we have to treat it like a playoff game. That's just how tight it is.”\n\nBoston became the first East team to come into Miami and win this season; the rest of the conference had been 0-13 on the Heat floor.\n\nThe Celtics held Miami to 37% shooting, a season-worst at home and the third-worst effort in 47 Heat games this season.\n\n“Their defense really jammed us up, Heat coach Erik Spoelstra said after his team fell to 0-2 against Boston this season. “That’s two games that they’ve done it to us. We’re better than this ... and the little things matter against a good defensive team like this.”\n\nKemba Walker added 16 points and eight assists for Boston, which got 11 points from Marcus Smart and a 10-point, 11-rebound effort from Daniel Theis.\n\nToronto moved into second in the East, a game up on Miami. The Celtics are a half-game back of the Heat, No. 5 Philadelphia is a game behind Boston and No. 6 Indiana is only a half-game back of the 76ers.\n\nGoran Dragic led Miami with 23 points and Jimmy Butler scored 20. Bam Adebayo had 16 points and 10 rebounds and Duncan Robinson scored 12 points for the Heat.\n\nBoston outscored Miami 15-0 from 3-point range in the game’s first nine minutes, a big reason why the Celtics took control from the outset and built as much as a 13-point lead in the opening quarter. Miami went to zone and slowed the Celtics down, but it wasn't enough.\n\n“Guys did a really good job of attacking it,\" Celtics coach Brad Stevens said. “Once we got a comfortable rhythm against it we were a little bit better. It's hard to score on those guys.\"\n\nMiami took the lead on a pair of occasions in the second, only for a span of a couple minutes. The Celtics took a 53-48 lead into the half and watched Miami score to make it a one- or two-possession game time and time again down the stretch.\n\nBut the Heat never held the lead in the second half. Every time they got close, Boston had the answer and Smart’s 3-pointer with 1:50 left put Boston up by eight to all but seal matters.\n\nThe tributes to the life of Kobe Bryant, who was killed in a helicopter crash Sunday along with his daughter Gianna and seven others, continued. Spoelstra, Stevens and their staffs wore Bryant’s signature sneakers -- a gesture that other NBA coaches made Tuesday as well.\n\n“It's about more than the player,\" Adebayo said. “It's about a lot more when you're honoring Kobe.\"\n\nThe Heat also displayed the numbers 8 and 24, Bryant’s two jersey numbers in the distinctive Los Angeles Lakers purple and gold, on an electronic sign attached to the basket stanchions.\n\nTIP-INS\n\nCeltics: Jayson Tatum (right groin strain) missed his third consecutive game. Tatum said he feels like he’s closing in on a return. “Obviously, with that type of an injury, we have to be very careful,” Stevens said. ... Enes Kanter (bruised right hip) also remained sidelined. ... The Celtics play four of their next five games against teams below the .500 mark.\n\nHeat: Adebayo’s games-played streak reached 133, one away from Isaac Austin for the fourth-longest run in Heat history. If he plays in every game this season, he’ll reach No. 2 on the list and be six shy of matching Glen Rice’s team record of 174. ... Mike Matheson and Aaron Ekblad of the Florida Panthers were among those in attendance.\n\nWALKER OLYMPICS?\n\nWalker was part of USA Basketball this past summer for the World Cup in China, saying afterward that he wanted to be back with the team this summer for the Tokyo Olympics. He hasn’t wavered. “If they want me, I’m there,” Walker said Tuesday. USA Basketball is expected to announce a pool of players in the coming weeks, then will likely select the Olympic team before training camp this summer. The Olympics start July 24.\n\nALL-STAR RACE\n\nRaptors coach Nick Nurse is now in the lead to coach the All-Star Game. The East coach will lead the team captained by Milwaukee’s Giannis Antetokounmpo. The Lakers’ Frank Vogel has already clinched the job of coaching the team that will be captained by LeBron James. The East coach will be the one from the team with the second-best record in the East after Sunday’s games; Milwaukee coach Mike Budenholzer has the Bucks way atop the East, but coached the All-Star Game last year and isn’t eligible this year.\n\nUP NEXT\n\nCeltics: Host Golden State on Thursday.\n\nHeat: Visit Orlando on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995504.314878
}