{
  "game_id": "0022300680",
  "espn_id": "401585308",
  "date": "Jan 31, 2024",
  "matchup": "MIN vs. DAL",
  "headline": "Towns leads Timberwolves in 121-87 win over Mavs team missing Doncic and Irving",
  "body": "MINNEAPOLIS -- — Karl-Anthony Towns had 29 points and nine rebounds for the Minnesota Timberwolves in a 121-87 victory over the depleted Dallas Mavericks, who played Wednesday night without stars Luka Doncic and Kyrie Irving.\n\n\r\n              Rudy Gobert scored 17 points and Naz Reid added 12 points for the West-leading Wolves (34-14). They endured a sluggish start until Towns sparked their surge with two 3-pointers in the last 35 seconds of the first half to give them the lead for good. Towns, who had 11 points in the third quarter, went 4 for 6 from 3-point range and is shooting a career-best 44.2% from deep.\n\n\r\n              “I just wanted it to translate to winning,\" Towns said. \"That’s what’s really good about this year.”\n\n\r\n              Doncic (sprained right ankle) and Irving (sprained right thumb) both sat for the third game this season, and the Mavericks have lost all three. They've played without at least one of them 26 times in 48 games.\n\n\r\n              Josh Green had 18 points and Tim Hardaway Jr. added 14 points for the Mavericks. They shot just 6 for 29 from 3-point range against the NBA's best scoring defense. This was the fewest points allowed by the Wolves this season.\n\n\r\n              “I wouldn’t say we ran out of gas. I would say we got hit and we didn’t hit back,” Green said.\n\n\r\n              This low-profile Mavericks lineup gave the Wolves a bit of a breather after a four-game road trip they finished with a statement win at Oklahoma City, but for the fans in Minnesota who wanted to see Doncic the injury report was quite the buzz kill. The four-time first-team All-NBA pick also sat out the Dec. 28 game here because of soreness in his left quadriceps. Irving didn't play in that one, either.\n\n\r\n              With rookie Dereck Lively II (broken nose), guard Dante Exum (right knee bursitis) and forward Derrick Jones Jr. (sprained left wrist) also out, the Mavericks played without their entire optimal starting lineup and five of their top six scorers.\n\n\r\n              Irving has missed five straight games and played only 27 times this season. Doncic, the NBA leader in minutes per game (37.5), has been playing through his injury for the most part. This was his fifth absence related to the ankle this season.\n\n\r\n              “Hopefully they get healthy soon, but at the end of the day, we can’t be down whether the guys sit or not,” Green said. “We have to go into every game with the same mindset.”\n\n\r\n              Doncic, who scored 146 points in the last three games, helped Dallas erase a 16-point deficit and beat Orlando on Monday night. The Mavericks (26-22) are hardly in the safe zone for the playoffs, though, with five losses in their last seven games. They entered the evening in seventh place in the conference.\n\n\r\n              Anthony Edwards, who was fined $40,000 by the league earlier in the day for criticizing the officiating in Oklahoma City, had a quiet nine points for the Wolves without a single shot attempt after the first quarter. Mike Conley, who missed four of the previous five games with left hamstring soreness, returned to action with 10 points in 25 minutes. His 3-pointer early in the fourth quarter capped a 22-3 run.\n\n\r\n              “It looked like a very typical Mike Conley game,\" coach Chris Finch said. “He did a great job of running the show, communicating with all the guys, keeping us well organized and then hitting big shots.”\n\n\r\n              The Wolves were able to empty their bench down the stretch, even giving G-Leaguer Luka Garza five minutes. He had eight points.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host Milwaukee on Saturday night. \n\n\r\n              Timberwolves: Host Orlando on Friday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996468.8431418
}