{
  "game_id": "0021901257",
  "espn_id": "401224732",
  "date": "Aug 04, 2020",
  "matchup": "SAC vs. DAL",
  "headline": "Doncic's triple-double sends Mavericks past Kings in OT",
  "body": "LAKE BUENA VISTA, Fla. --  Luka Doncic punctuated a historic triple-double by making the tiebreaking shot with 1:57 left in overtime Tuesday and leading the Dallas Mavericks past the Sacramento Kings, 114-110.\n\nDoncic was sensational, finishing with 34 points, a career-high 20 rebounds and 12 assists. At 21 years, 158 days, he became the youngest player to finish a game with 30 or more points, 20 or more rebounds and 10 or more assists, shattering Oscar Robertson's previous mark of 23 years, 12 days.\n\n\"We needed that,\" Doncic said. \"We played, I think, one of the worst games ever and we won. We didn't play good. We still hang in there, help each other, never give up. I'm proud of the win.\"\n\nKristaps Porzingis added 22 points and seven rebounds before fouling out late in regulation.\n\nIt was the Mavs' first victory since arriving at Walt Disney World and allowed them to remain the only NBA to avoid three straight losses this season.\n\nDe'Aaron Fox scored 28 points and Buddy Hield had 21, but the Kings could not close out a game they controlled almost from the opening tip until the end of regulation.\n\n\"I thought we settled too much down the stretch instead of trying to put pressure on the rim,\" Sacramento coach Luke Walton said.\n\nDallas scored the final six points in regulation to force overtime, then tied the score again at 102 when Tim Hardaway Jr. made three free throws with 3:10 to play.\n\nDoncic broke the tie with a short basket and the Mavs scored the next five points and never trailed again.\n\n\"I believe we had seven stops in a row to end regulation, which was huge,\" Dallas coach Rick Carlisle said. \"It was a guts win.\"\n\nTIP-INS\n\nMavericks: Seth Curry missed the game with a sore right leg. ... Porzingis has 91 points in three games in the bubble. ... Hardaway had 22 points and made three 3-pointers to give him 193 this season, passing Jose Calderon (191) for the second-highest total in franchise history. ... Dorian Finney-Smith had 16 points and 16 rebounds in the first game since Dallas clinched a playoff spot. ... The Mavs were 39 of 50 from the free throw line.\n\nKings: After going 9 of 16 on 3-pointers in the first quarter, they were 0 for 8 in the second and finished 16 of 43. ... Fox also had nine assists. ... Kent Bazemore had 16 points while Nemanja Bjelica has 12 points and 13 rebounds. ..., The Kings were called for 20 fouls in the first half and wound up with 37. ... Bogdan Bogdanovic missed his first 14 shots before making his last, a 3-pointer with 6.3 seconds left in overtime. ... Sacramento has lost thee straight to Dallas and four in a row overall.\n\nGAME CHANGER\n\nWalton thought the biggest factor at the end of regulation was the loss of Richaun Holmes. He had eight points and 12 rebounds before leaving for the final time with 1:52 left in regulation.\n\n\"When Richaun fouled out, that hurt,\" Walton said. \"We got a little stagnant out there. We got some clean looks. We didn't make many of them.\"\n\nTHEY SAID IT\n\nMavericks: \"I just know that the last game I laid a goose egg and I know I'm better than that as a player,\" Hardaway said. \"I just wanted to come out here a little more aggressive, not do too much, but play the way I'm supposed to play.\"\n\nKings: \"All game, like, they kept going to the foul line,\" Walton said. \"I've never seen a 50-free throw game before.\"\n\nUP NEXT\n\nMavericks: Hope to snap a three-game losing streak in Clippers series on Thursday.\n\nKings: Will try to even the season series with New Orleans on Thursday. ---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996376.800438
}