{
  "game_id": "0022200275",
  "espn_id": "401468430",
  "date": "Nov 25, 2022",
  "matchup": "SAC @ BOS",
  "headline": "Tatum scores 30; Celtics pull away from Kings, 122-104",
  "body": "BOSTON -- — Jayson Tatum scored 30 points and the NBA-best Boston Celtics pulled away from the Sacramento Kings for a 122-104 victory on Friday night.\n\n\r\n              Jaylen Brown added 25 points and Derrick White had 16 for Boston (15-4), which won for the 11th time in 12 games. Al Horford finished with 13 points, and Tatum had eight rebounds.\n\n\r\n              “We just needed some energy,” Brown said. “There’s games like that where the officiating kind of slows the game up, a lot of calls. We were looking for something to give us a little bit of a spark.\"\n\n\r\n              De’Aaron Fox led Sacramento with 20 points. Domantas Sabonis had 18 points and 10 rebounds, and Davion Mitchell scored 13. The Kings have lost two straight after a seven-game winning streak.\n\n\r\n              “I felt we had too many turnovers, unforced turnovers,” Kings coach Mike Brown said. “To have 18 on the road against the best team in the NBA for 27 points is hard to overcome. Situations like this, if the ball’s not going in, you’ve got to be good with the basketball.” \n\n\r\n              In a matchup of two of the league’s hottest teams in November, the Celtics opened a 16-point lead early in the second quarter before the Kings’ league-best offense got rolling just before halftime, closing to 64-62 at intermission.\n\n\r\n              From there, the game bogged down with numerous fouls and some sloppy and inconsistent offense for much of the third quarter before Boston took off on a 19-0 run that closed the quarter and extended into Sam Hauser’s 3 at the start of the fourth.\n\n\r\n              “I said during one of the timeouts that we can’t expect everything to go our way all the time,\" Boston coach Joe Mazzulla said. \"We’re going to be down six in the third quarter sometimes and that’s OK.\"\n\n\r\n              Horford’s 3 gave Boston a 25-point lead with just over five minutes to play. \n\n\r\n              TIP-INS\n\n\r\n              Kings: Brown and Fox were each whistled for a technical foul by referee Natalie Sago midway into the opening quarter. ... Were just 2 for 10 on 3-point attempts in the opening quarter and finished 9 of 36.\n\n\r\n              Celtics: Brown picked up a T from ref Eric Lewis late in the first quarter. Sago gave one to Grant Williams in the third. ... Opened a double-digit lead midway into the first and led 36-22 after one.\n\n\r\n              BENCH BOOST\n\n\r\n              With his team trailing by six and looking sluggish late in the third, Mazzulla brought in reserves Payton Pritchard and Luke Kornet for their first playing time of the night. It seemed to spark the team and excited the crowd as the Celtics went on a 16-0 run to close the quarter, with Tatum scoring the last five points.\n\n\r\n              “Foul trouble and capitalizing on our depth,” Mazzulla said of the moves. “Credit to both Payton and Luke for what they do on a daily basis to stay ready. ... I just felt they brought a different rhythm to the game, great energy and great execution on both ends.\"\n\n\r\n              HIGH-OCTANE OFFENSES\n\n\r\n              The game featured two of the league’s highest scoring teams. Sacramento entered first with 120 points per game and Boston was just slightly behind, second at 119.7.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host the Phoenix Suns on Monday.\n\n\r\n              Celtics: Host the Washington Wizards on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995310.287301
}