{
  "game_id": "0022400076",
  "espn_id": "401704642",
  "date": "Oct 24, 2024",
  "matchup": "MIN @ SAC",
  "headline": "Edwards hits late free throws to lift the Timberwolves past the Kings, 117-115",
  "body": "SACRAMENTO, Calif. -- — Anthony Edwards hit a pair of free throws with 2.4 seconds remaining and the Timberwolves spoiled Sacramento’s opener by beating the Kings 117-115 on Thursday night.\n\n\r\n              Edwards got fouled by Domantas Sabonis on a drive with the game tied and calmly hit the free throws to give him 32 points.\n\n\r\n              Keegan Murray's 3-point attempt rimmed out at the buzzer for the Kings.\n\n\r\n              Julius Randle led the Timberwolves with 33 points in his second game after being acquired in a trade from New York this month.\n\n\r\n              Demar DeRozan scored 26 points to lead the Kings in his debut for Sacramento after being acquired this summer in a sign-and-trade from Chicago. Sabonis added 24 points and Murray had 23.\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota came out of its season-opening trip to California with a split after rebounding from a loss to the Lakers on Tuesday night. Randle looked much more assertive in his second game after taking only 10 shots in the opener.\n\n\r\n              Kings: Sacramento has lost its last six season openers played at home with the last win coming in 2013 against Denver.\n\n\r\n              Key moment\r\n              Edwards and Naz Reid hit back-to-back 3-pointers that started an 11-0 run for Minnesota that turned a five-point deficit into a 105-99 lead midway through the fourth quarter. \n\n\r\n              Key stat\r\n              After going 13 for 41 from 3 in the opener, Minnesota shot 20 for 50 from long range against Sacramento. The 91 attempted 3s are the most ever for the Timberwolves in the first two games of a season.\n\n\r\n              Up next\r\n              The Timberwolves play their home opener on Saturday night against Toronto, while the Kings travel to Los Angeles to face the Lakers on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998116.178994
}