{
  "game_id": "401810209",
  "espn_id": "401810209",
  "date": "Dec 06, 2025",
  "matchup": "MIA vs SAC",
  "headline": "Sacramento takes on Miami, looks to break 4-game skid",
  "body": "Sacramento Kings (5-17, 14th in the Western Conference) vs. Miami Heat (14-9, sixth in the Eastern Conference)\n\n\r\n              Miami; Saturday, 8 p.m. EST\n\n\r\n               Heat -8; over/under is 239\n\n\r\n              BOTTOM LINE: Sacramento is looking to stop its four-game slide with a victory over Miami.\n\n\r\n              The Heat are 10-2 in home games. Miami is second in the NBA with 29.9 assists per game. Davion Mitchell leads the Heat averaging 7.8.\n\n\r\n              The Kings are 2-10 in road games. Sacramento ranks ninth in the Western Conference scoring 49.0 points per game in the paint led by Domantas Sabonis averaging 11.8.\n\n\r\n              The Heat are shooting 47.9% from the field this season, 2.1 percentage points lower than the 50.0% the Kings allow to opponents. The Kings average 10.9 made 3-pointers per game this season, 2.9 fewer made shots on average than the 13.8 per game the Heat give up.\n\n\r\n              TOP PERFORMERS: Kel'el Ware is scoring 11.9 points per game with 10.5 rebounds and 0.6 assists for the Heat. Norman Powell is averaging 28.0 points and 3.0 rebounds while shooting 50.0% over the past 10 games.\n\n\r\n              DeMar DeRozan is scoring 18.1 points per game and averaging 2.9 rebounds for the Kings. Malik Monk is averaging 5.0 made 3-pointers over the last 10 games.\n\n\r\n              LAST 10 GAMES: Heat: 7-3, averaging 119.5 points, 47.6 rebounds, 29.3 assists, 8.6 steals and 5.7 blocks per game while shooting 46.3% from the field. Their opponents have averaged 112.3 points per game.\n\n\r\n              Kings: 2-8, averaging 108.1 points, 39.5 rebounds, 25.4 assists, 9.8 steals and 4.3 blocks per game while shooting 45.5% from the field. Their opponents have averaged 120.8 points.\n\n\r\n              INJURIES: Heat: Tyler Herro: day to day (toe).\n\n\r\n              Kings: Dennis Schroder: out (hip), Domantas Sabonis: out (knee).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042767.5285041
}