{
  "game_id": "0022400622",
  "espn_id": "401705188",
  "date": "Jan 23, 2025",
  "matchup": "ORL vs. POR",
  "headline": "Trail Blazers win third straight, beat Magic 100-79 to spoil Franz Wagner's return for Orlando",
  "body": "ORLANDO, Fla. -- — Anfernee Simons scored 21 points and the Portland Trail Blazers extended their winning streak to three with a 100-79 victory over Orlando on Thursday night, spoiling the return of Magic forward Franz Wagner.\n\n\r\n              Toumani Canara added 16 points and six rebounds for Portland. Deni Avdija finished with 13 points, five rebounds and five assists, while Jabari Walker had six steals in 19 minutes.\n\n\r\n              Wagner, who missed 20 games after tearing his oblique in early December, led Orlando with 20 points. Tristan Da Silva came off the bench with 16 points. Paolo Banchero had eight points and nine rebounds, but shot 1 for 14 with five turnovers.\n\n\r\n              Blazers guard Scoot Henderson fouled out with 6:12 left, having played 14 minutes. \n\n\r\n              Takeaways\r\n              Blazers: Playing center in place of the injured DeAndre Ayton (knee) and rookie Donovan Clingan (ankle), Robert Williams had a game-high 12 rebounds and four of Portland's 12 blocks.\n\n\r\n              Magic: Shooting 34.2%, the Magic lost their fifth straight and seventh of eight games. They were 16-9, a solid third in the East, when Wagner was injured. Thursday night's loss dropped them to 23-23, eighth in the conference. They are 2-8 since Jalen Suggs injured his back. \n\n\r\n              Key moment\r\n              Shaedon Sharpe finished the third quarter with a baseline drive to a dunk, completing a 10-1 run that left the Blazers with a 74-59 lead. \n\n\r\n              Key stat\r\n              In the middle of the third quarter the Magic were 3 for 18 from 3-point range with 22 turnovers. They were down by 18 points.\n\n\r\n              Up next\r\n              The Blazers play at Charlotte on Friday night. The Magic host Detroit on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997872.1577768
}