{
  "game_id": "0021900200",
  "espn_id": "401160842",
  "date": "Nov 19, 2019",
  "matchup": "SAC vs. PHX",
  "headline": "Bogdanovic makes 7 3s, Kings hold off Suns 120-116",
  "body": "SACRAMENTO, Calif. --  For the second time in two games against Phoenix this season, the Sacramento Kings allowed the Suns to have a 70-point second half.\n\nAt least this time Luke Walton's team was able to overcome it. Barely.\n\nBogdan Bogdanovic set career highs with 31 points and seven 3-pointers, and Sacramento beat the Suns 120-116 on Tuesday night.\n\n\"I know it didn't feel great the way we played in the second half but our guys stuck together and scrapped it out,\" Walton said. \"Even though it wasn't pretty ... we gutted out a win. We'll take that and hopefully learning a lesson while doing it.\"\n\nThe Kings were terrible against the Suns in Phoenix during a season-opening 124-95 loss on Oct. 23. Sacramento committed 27 turnovers and was outscored 70-36 in the second half of that game.\n\nThis time, the Kings had 18 turnovers while Phoenix held a 71-58 scoring advantage after halftime.\n\n\"We have to finish it better and keep that lead until the end,\" Bogdanovic said. \"They changed their lineup and everyone started rolling and we kind of let them do whatever. We kind of were, `OK, we got it.' It's the NBA. You have to be ready to lock in and finish the game.\"\n\nRichaun Holmes had 20 points and 15 rebounds, Nemanja Bjelica scored 17 points and Harrison Barnes added 15 for Sacramento. The Kings have won four of five.\n\nDevin Booker had 30 points, eight assists and five rebounds for Phoenix. Kelly Oubre Jr. and Mikal Bridges scored 20 points apiece.\n\n\"I loved the battle of our team and the way we came out at halftime,\" Suns coach Monty Williams said. \"We changed up our defenses a little bit but they hit tough shots after tough shots. But I just loved the fight of our team. We stayed together.\"\n\nBogdanovic shot 11 of 14 overall and was 7 of 9 beyond the arc. He made four 3s and had 14 of Sacramento's 16 points during one stretch in the second quarter, then made three more from the perimeter in the fourth to help the Kings hold on.\n\nBut Bogdanovic spent the final few moments of the game on the bench with tightness in his left hamstring.\n\n\"I think it's cramped,\" Bogdanovic said. \"I kind of felt it the whole second half but at the end it was a little bit harder and I had to go out. But it was OK.\"\n\nPhoenix trailed by 26 early in the third quarter. The Suns were within 90-81 early in the fourth but couldn't stop Bogdanovic. The 27-year-old Serbian scored 11 points in the final 12 minutes, including his seventh 3-pointer that made it 106-91.\n\nPhoenix made a final push to get within 116-113 with 14 seconds left before Yogi Ferrell and Holmes made two free throws apiece for Sacramento.\n\n\"It felt like after playing so unselfish in the first half, 17 assists, ball flying around side to side, it felt like to me that we started trying to stat-hunt a little bit,\" Walton said. \"When we continued to run our plays we got wide open everything. When we got stagnant their zone stopped us.\"\n\nThe Suns were sluggish offensively early in their first road game since Nov. 2. Phoenix shot 26% in the first quarter and was marginally better in the second quarter.\n\nRicky Rubio had one point and two assists in 16 minutes. Rubio did not play in Monday's loss to Boston because of back spasms.\n\n\"The cause of desperation and energy and sense of urgency is what we needed to start the third quarter with,\" Booker said. \"When you're down by 26 points it's a tough spot to be in.\"\n\nTIP-INS\n\nSuns: Booker was called for a technical after getting fouled in the second quarter and had to wait before taking his free throws while Buddy Hield shot the technical. . Phoenix was whistled for goaltending three times.\n\nKings: Cory Joseph had a career-high 14 assists. . Bjelica went to the bench with his third foul 2:10 into the second quarter. . Sacramento shot 15 of 23 (65.2%) in the first quarter. . Trevor Ariza was inactive for the second time in three games because of right groin soreness.\n\nHOLMES SHINES\n\nHolmes' double-double was his fourth in 13 games with Sacramento. Holmes had five in 70 games while with Phoenix last season.\n\nUP NEXT\n\nSuns: Host New Orleans on Thursday. The two teams split their four-game series in 2018.\n\nKings: Play at Brooklyn on Friday. The Nets won both games between the teams last season.\n\n--\n\nMore AP NBA:https://apnews.com/tag/NBAandhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996417.469949
}