{
  "game_id": "0022300296",
  "espn_id": "401584924",
  "date": "Dec 11, 2023",
  "matchup": "ATL vs. DEN",
  "headline": "Murray scores 29, Jokic adds 25 as Nuggets end 3-game skid, beat Bogdanovic, Hawks 129-122",
  "body": "ATLANTA -- — Jamal Murray scored 29 points, Nikola Jokic rediscovered his shooting touch to score 25 and the Denver Nuggets ended their three-game skid, holding off the Atlanta Hawks 129-122 on Monday night.\n\n\r\n              Bogdan Bogdanovic set career highs with 40 points and 10 3-pointers in the Hawks' fourth consecutive loss.\n\n\r\n              Bogdanovic sank three 3s in the final two minutes but the defending NBA champion Nuggets, who had a 20-point lead early in the fourth quarter, held off Atlanta's comeback. The Hawks got within 126-122 in the final minute.\n\n\r\n              “We were playing like we were in a panic,” Jokic said. “A win is a win and that's the most important thing. ... We got the stops when we needed it.”\n\n\r\n              Bogdanovic and Jokic were teammates on the Serbian national team that won a silver medal in the 2016 Olympics and placed fifth in the 2019 FIBA World Cup. Jokic said he was “happy to see” Bogdanovic, who made 10 of 17 3s, healthy and free of knee injuries.\n\n\r\n              “I think this is the first time in a long time he really moves normally and doesn't have any pains,” Jokic said. “I remember when he had games like this when he seemed like he never missed a shot.”\n\n\r\n              Rookie Julian Strawther scored a career-high 22 points while making six 3-pointers for Denver. Strawther had a game-high five steals.\n\n\r\n              Aaron Gordon had 18 points and 12 rebounds.\n\n\r\n              Murray rolled his left ankle and left the court midway through the opening quarter. Already dealing with a sore right ankle, Murray returned and finished with nine rebounds for Denver.\n\n\r\n              The Hawks' Trae Young scored 19 points before he was ejected when he picked up two technical fouls with 25 seconds remaining in the third quarter. Young was upset no foul was called when Peyton Watson reached in on Young's drive. Hawks coach Quin Snyder also was called for a technical while protesting the no-call.\n\n\r\n              “I think it would have been really easy, given all the adversity of the game that was going on, for us to give in and that didn't happen,” Snyder said. “I think we stayed focused on our execution and it got us back in the game.”\n\n\r\n              After making only 18 of 58 shots in his last two games, Jokic, the two-time MVP, shot 9 of 13 from the field. He had eight rebounds and eight assists.\n\n\r\n              Hawks forward Jalen Johnson missed his seventh consecutive game with a fractured left wrist. Another starting forward, De'Andre Hunter, was held out with soreness in his right quad. Garrison Mathews filled in for Hunter, making his first start of the season.\n\n\r\n              Snyder said before the game Mathews and other players would “try to accomplish what we want to get done, maybe in a different way.”\n\n\r\n              The different way early in the game was the long-range shooting of Bogdanovic and Dejounte Murray, who scored 21 points. The Hawks led 36-25 late in the first quarter before Strawther's 13 second-quarter points helped the Nuggets lead 65-62 at halftime.\n\n\r\n              Strawther's previous high was 21 points against New Orleans on Nov. 6, when he made five 3s. Strawther topped that mark by making 6 of 11 3s against Atlanta.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At Chicago on Tuesday night.\n\n\r\n              Hawks: At Toronto on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996300.677017
}