{
  "game_id": "0021900835",
  "espn_id": "401161477",
  "date": "Feb 22, 2020",
  "matchup": "SAC @ LAC",
  "headline": "Sacramento Kings beat Clippers at Staples again, 112-103",
  "body": "LOS ANGELES --  The Sacramento Kings realize they might have started playing their best basketball of the season too late to contend for a playoff spot.\n\nBeating the powerhouse Los Angeles Clippers on the road twice in less than a month still feels awfully good, even if the Clips are far from the best version of themselves these days.\n\nKent Bazemore scored a season-high 23 points, Bogdan Bogdanovic added 20 and the Kings made a decisive fourth-quarter surge to beat the Clippers 112-103 on Saturday.\n\nDe'Aaron Fox had 20 points and eight assists for the surging Kings, who have won two straight out of the All-Star break and eight of 12 overall. Sacramento is still just 23-33, but the progress is encouraging for the franchise with its NBA-worst playoff drought at 13 seasons.\n\n\"We're feeling a lot better about ourselves now,\" Fox said. \"Obviously we need to keep this going, but we came out of the All-Star break and we were prepared. We're in a good place right now. We can only control ourselves as far as the rest of the season goes, but we're feeling good.\"\n\nSacramento blew a 14-point lead in the second half to a Clippers lineup missing injured stars Paul George and Patrick Beverley. But the Kings then shut out Kawhi Leonard and the Clips for more than five straight minutes down the stretch, making a decisive 10-0 run capped by Harry Giles' percussive dunk off an alley-oop from Bogdanovic with 58 seconds left.\n\n\"That was a good moment to finish the game out strong on,\" said Giles, who had 14 points and 12 rebounds in his first career double-double. \"We're on a better path now. We're in a groove, but let's just keep it going.\"\n\nLeonard scored 31 points in his first game back from his MVP performance in Chicago, but the Clippers returned from the All-Star break with their first three-game losing streak of the season.\n\nLou Williams added 24 points for LA, and Montrezl Harrell had 16 points and 10 rebounds.\n\nSacramento had a big lead late in the third quarter, but the Clippers took their first lead of the day on Harrell's leap-and-lean bucket with 8:30 to play. Shortly after that, the Clippers went through their decisive drought.\n\n\"We had a lot of different people helping out, and it felt good,\" Sacramento coach Luke Walton said. \"We were solid for most of the game. We had a couple of drop-offs where we got a little sloppy, but it was one of our more consistent games.\"\n\nTIP-INS\n\nKings: Alex Len had three points and eight rebounds in 16 minutes during his first action since Jan. 24. He has been out with a right hip flexor strain. ... The Kings also routed LA 124-103 at Staples Center on Jan. 30.\n\nClippers: George missed his 11th game in three separate stretches since early January to rest a troublesome left hamstring, while Beverley has missed five straight games with a sore groin. Beverley still competed in the skills challenge at All-Star weekend ... Len and Harrell got technical fouls for a shouting match early in the fourth quarter.\n\nSLOW START\n\nThe Clippers returned from eight days off and missed 13 of their first 14 shots on their way to a 4-for-24 first quarter with five turnovers.\n\n\"We weren't ready to play,\" Leonard said. \"I just didn't feel like we were locked in early, and then it was too late to turn the switch on. We've got to keep getting better. It's about the team peaking at the right time.\"\n\nNEW GUYS\n\nReggie Jackson scored eight points in his Clippers debut two days after the Pistons bought him out, while Marcus Morris had six points and five turnovers in 32 minutes in his home debut nearly two weeks after the Clippers acquired him in a three-way trade.\n\nNEW LOOK\n\nWith the Clippers comfortably in third place in the Western Conference, George and Beverley are both getting extra time off to rest persistent injuries. Clippers coach Doc Rivers used his 28th starting lineup in 56 games, putting newcomers Morris and Jackson in the mix. The resulting unfamiliarity contributed to the loss, they said.\n\n\"That was (Jackson's) first game, and because of our injury issues, we had to start him,\" Clippers coach Doc Rivers said. \"It is what it is.\"\n\nUP NEXT\n\nKings: Visit the Golden State Warriors on Tuesday night.\n\nClippers: Host the Memphis Grizzlies on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996387.931233
}