{
  "game_id": "0022200907",
  "espn_id": "401469062",
  "date": "Feb 25, 2023",
  "matchup": "MEM vs. DEN",
  "headline": "Morant scores 23, Grizzlies rout Nuggets in West showdown",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 23 points and seven rebounds as the Memphis Grizzlies raced to an early lead and coasted to a 112-94 victory over the Denver Nuggets on Saturday night in a matchup of the Western Conference’s top teams. \n\n\r\n              Tyus Jones finished with 17 points, and Luke Kennard, Xavier Tillman and Dillon Brooks scored 12 apiece for Memphis, which trails Denver by six games in the conference race.\n\n\r\n              Nikola Jokic led the Nuggets with 15 points and 13 rebounds, and Jeff Green added 12 points. Kentavious Caldwell-Pope and Christian Braun each scored 11 points as Denver's four-game winning streak came to an end. Denver was hampered by a 40% shooting game. The Nuggets' starters were 17 of 47 from the field in the game.\n\n\r\n              Denver's 94 total points was a season low.\n\n\r\n              “One of the biggest priorities was transition defense,” Memphis coach Taylor Jenkins said. “I thought our urgency was phenomenal.”\n\n\r\n              The matchup of the West leaders had Denver entering while playing well and Memphis struggling, dropping six of its last 10 games and losing its grip on the second spot as the Sacramento Kings rose to third.\n\n\r\n              But Memphis came out with more intensity and defensive pressure, a continuation of the Grizzlies first post-All-Star break game — a last-minute loss at Philadelphia.\n\n\r\n              “They just played more physical than us,” Green said. “They treated it like a playoff game. We didn't. We came out lackadaisical. They got a good lead, and we couldn't bounce back.”\n\n\r\n              Nuggets coach Michael Malone added: “I felt like going into this game that (the Grizzlies) were going to approach this as a playoff game. We approached it as a game 61 or 62.”\n\n\r\n              The Grizzlies finished with 19 fast-break points and 60 points in the paint.\n\n\r\n              “They ran off misses. They ran off makes. They were sprinting. We just didn’t match that,” Malone said.\n\n\r\n              Memphis converted 56% of its shots in the first half and was 9 of 21 form outside the arc. Meanwhile, the Nuggets offense struggled, shooting 38% from the field and making only 3 of 16 3-pointers. Ten turnovers added to the Nuggets' misery.\n\n\r\n              Memphis led by as many as 29 points in the first half and carried a 66-42 advantage at the break. \n\n\r\n              Memphis opened the second half with eight straight points, pushing the lead to 32 points. That catapulted the Grizzlies to a 94-62 advantage through three quarters. At that point, Memphis was still shooting better than 53%.\n\n\r\n              With Denver facing the second half of a back-to-back Sunday, Malone sat his starters in the fourth quarter.\n\n\r\n              The win gave Memphis a two-game cushion over third-place Sacramento after the Kings' 176-175 win over the Clippers in double-overtime Friday night. But despite the rout of the Nuggets, Memphis didn't consider the win a statement game.\n\n\r\n              “I think it's too early to say,” Jones said. “It's a good win. They're a good team, but it's also one game. Don't try to look too much into it.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Denver's 42 points were a season low for the first half. The previous low was 43 against Minnesota on Feb. 5 ... The Nuggets defeated the Grizzlies 105-91 on Dec. 20 in Denver. The three-game season series wraps up March 3 in Denver.\n\n\r\n              Grizzlies: Tillman made all six of his shots in the game. ... C Steven Adams missed his 13th straight game with a right knee sprain. ...Desmond Bane had 10 points but was 4 of 13 from the field.\n\n\r\n              TAKES YOUR BREATH AWAY\n\n\r\n              Morant had one of his highlight layups after a scramble for the ball at midcourt,. After he scored, he expressed his excitement. “I kind of yelled,” Morant said, “and got light-headed. So I probably won't do that again.”\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host the Los Angeles Clippers on Sunday.\n\n\r\n              Grizzlies: Entertain the Los Angeles Lakers on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994180.882275
}