{
  "game_id": "0022400105",
  "espn_id": "401704671",
  "date": "Oct 28, 2024",
  "matchup": "MIA vs. DET",
  "headline": "Butler scores 23, Rozier adds 20 and Heat pull away in 4th to beat Pistons 106-98",
  "body": "MIAMI -- — Jimmy Butler had 23 points and seven assists, Terry Rozier added 20 points and the Miami Heat beat the Detroit Pistons 106-98 on Monday night.\n\n\r\n              Tyler Herro scored 19, Bam Adebayo added 12 points and 10 rebounds, and Jaime Jaquez Jr. also scored 12 for the Heat.\n\n\r\n              Cade Cunningham scored 24 points for Detroit, which is 0-4 for the third time in the last five seasons. Tim Hardaway Jr. scored 20, Jaden Ivey scored 18 and backup Isaiah Stewart had 15 rebounds for Detroit.\n\n\r\n              Miami was again without Kevin Love, who has missed all three Heat games this season for personal reasons. The Heat — on the 21st anniversary of his debut game — had a halftime ceremony honoring Dwyane Wade, whose statue outside the arena was unveiled Sunday.\n\n\r\n              Takeaw\r\n              ays\r\n              Pistons: Cunningham made his first seven shots, not missing until early in the third quarter. But he went 2 for 11 the rest of the way and Detroit finished at 38% from the field.\n\n\r\n              Heat: Miami has struggled mightily in its first two third quarters at home this season, getting outscored 65-32 (26-14 on Monday) and shooting 10 for 30 (.333). Orlando outscored Miami 39-18 in the third quarter of the season opener.\n\n\r\n              Key moment\r\n              Cunningham's 3-pointer with 3:14 left in the half got Detroit within 50-46. But he fouled Rozier on a 3-pointer on the ensuing possession and checked out with three fouls. Rozier finished the four-point play and sparked a burst that gave Miami a 64-53 lead at the break.\n\n\r\n              Key stat\r\n              Miami scored the first 12 points of the fourth quarter, reclaiming the lead and keeping it the rest of the way.\n\n\r\n              Up next\r\n              Both teams play again Wednesday, with Detroit going to Philadelphia — in what should be Tobias Harris' first game against the 76ers since Jan. 1, 2019 — and Miami hosting New York.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996941.1286669
}