{
  "game_id": "0021900628",
  "espn_id": "401161270",
  "date": "Jan 18, 2020",
  "matchup": "PHX @ BOS",
  "headline": "Suns overcome Smart's record 11 3s, beat Celtics 123-119",
  "body": "BOSTON -- Devin Booker sure loves playing in TD Garden.\nHis near triple-double effort was just barely enough for the Phoenix Suns to overcome Boston guard Marcus Smart's performance.\nBooker had 39 points, 10 rebounds and nine assists and the Suns withstood a franchise-record 11 3-pointers by Smart and beat the Celtics 123-119 on Saturday.\n\"You know, Book is -- Book's Book,\" Phoenix coach Monty Williams said. \"It's something I don't take for granted to have a guy that can get buckets like that.\"\nDeandre Ayton had 26 points and 15 rebounds and Mikal Bridges added a career-best 26 points for the Suns, who have won four of their last five games.\nSmart shot 11 for 22 from 3-point range and finished with a career-best 37 points. He's the 11th player in NBA history to make at least 11 3-pointers in a game, according to ESPN Stats & Information.\n\"He obviously was shooting confidently, made some big shots late into the game and into the (first) half,\" Boston coach Brad Stevens said. \"He's a tough guy and he got a lot of good looks and took advantage of it.\"\nJayson Tatum scored 26 points and Gordon Hayward added 22 for Boston, which has lost three straight and six of eight.\nThree years ago, Booker scored 70 points in a loss to the Celtics in TD Garden. He finished an assist shy of his first career triple-double.\nThe Celtics were missing two of their top three leading scorers _ Kemba Walker (team-best 22.1 per game), out with left knee soreness, and Jaylen Brown (20.0), sidelined for the second straight game with a sprained right thumb.\nBut Smart kept them in it.\n\"Right now, it means nothing,\" Smart said. \"I'd trade all that in for a win, especially the way the team has been playing.\"\nBoston cut its deficit to 90-85 early in the fourth, but Dario Saric and Bridges answered with consecutive 3s. The Celtics had it down to 114-111 on Daniel Theis' breakaway dunk with about a minute left, but Bridges hit a jumper in the lane with 37 seconds to play.\nBooker's two free throws sealed it with 4.8 seconds left.\n\"I feel like there were times where we could've put them away, but (an) experienced team that has been in this situation before is never gonna give up,\" Booker said.\nThe Suns led 60-51 at halftime and answered -- mainly behind Booker and Ayton -- any surge by Boston. The lead never fell below seven in the quarter, with Booker scoring nine points and Ayton getting eight.\nThe loss of two key players showed for the Celtics in the first quarter when the Suns broke in front 26-10 before Boston's bench helped spark a 15-0 run.\nTIP-INS\nSuns: Ayton took an inadvertent elbow from Smart to mouth in the first quarter. After a brief stoppage to get checked, the 7-foot-1 center stayed in the game. . Booker also went to the floor hard after a collision with Smart in the second, but remained in after getting up slowly, and Ricky Rubio took a shot to the face in the fourth. Celtics: Tatum was taken out early after missing his first three shots. . Grant Williams started at forward and Hayward at guard. Stevens joked before the game that he didn't know who was starting and said: \"I think I told six guys and you can only have five.\"\nTRYING EVERYTHING\nStevens even used a different type of defense -- a box-and-one on Booker -- but that didn't work.\n\"We played a little bit of a zone and we were going to take our chances with other guys,\" he said. \"I think we played a triangle-and-two my second year (in Boston) in the playoffs against (Kyrie) Irving and (LeBron) James. That was probably the last time, but he was killing us.\"\nEXTRA CHEERLEADERS\nWalker, dressed in jeans with a white hooded sweatshirt and a beige sports coat, offered any support he could, talking to the team on the bench during a timeout while the coaches were huddling off to the side after Boston fell behind early in the game.\nHe was off the bench, clapping numerous times and patting teammates when they came out. Brown joined him, at times, offering encouragement.\nACROBATIC\nOn one of his baskets, Booker was fouled driving to his right, and, while in midair, shifted and flipped a shot in over shoulder across his body.\nUP NEXT\nSuns: Host the Spurs on Monday night.\nCeltics: Host the Lakers Monday night.",
  "source": "espn_api",
  "crawled_at": 1764996556.271928
}