{
  "game_id": "0021800785",
  "espn_id": "401071459",
  "date": "Feb 02, 2019",
  "matchup": "PHI @ SAC",
  "headline": "Hield scores 34 points, Kings hold off 76ers 115-108",
  "body": "SACRAMENTO, Calif. --  On a night when Sacramento's Buddy Hield set a career-high for 3-pointers, teammate De'Aaron Fox felt that Hield's two dunks were just as important.\n\nIt's something Fox wants to see more of, too, as the Kings continue to push to end their 13-year playoff drought.\n\nHield scored 34 points and made seven 3s, and Sacramento weathered a fourth-quarter flurry from Jimmy Butler to beat the Philadelphia 76ers 115-108 on Saturday night.\n\n\"I tell him to do it more just to be able to get to the free throw line more,\" Fox said of Hield's dunks in the first and third quarters. \"When he does it it opens up the game not only for himself but for us as well.\"\n\nHield went into the game fourth in the NBA for 3-point percentage and had another outstanding game from the perimeter while going 7 of 13 beyond the arc. That gave Hield 180 this season, topping his previous best of 176 in 2017-18.\n\nHe also showcased an improved mid-range jumper while trying to make more of an emphasis to drive to the basket as well.\n\n\"It's getting easy ones to get myself going and it's keeping the defense honest,\" Hield said. \"Just trying to make them play on certain areas on the court.\"\n\nFox had 19 points and eight assists, Willie Cauley-Stein also scored 19 and Marvin Bagley III added 14 points and 13 rebounds as the Kings won their sixth straight at home.\n\nWith its third consecutive victory over Philadelphia, Sacramento (27-25) matched its win total from last season.\n\nJoel Embiid had 29 points and 17 rebounds for Philadelphia. Butler added 29 points, 18 coming in the fourth quarter when he made two four-point plays.\n\n\"It was one one of those games where they kept throwing punches,\" said Ben Simmons, who scored 22. \"We didn't respond the right way.\"\n\nHield did most of his scoring in the first half but made a pair of pivotal 3s down the stretch and made three free throws in the final 27 seconds.\n\n\"I saw a lot of positives,\" Kings coach Dave Joerger said. \"We kept our composure down the stretch, made some free throws, contested some shots without fouling and got rebounds.\"\n\nTwo days after beating two-time defending NBA champion Golden State, the Sixers struggled from the perimeter and couldn't get much going offensively until the fourth quarter. Embiid shot 9 of 24 while Philadelphia went 7 of 33 beyond the arc.\n\nThe Sixers led 2-0 on the first of five dunks from Ben Simmons but didn't lead again until Butler's four-point play put them ahead 98-97 with 4:35 remaining.\n\nThe two teams traded buckets before the Kings closed on an 11-5 run. Hield had six points as part of the surge while Cauley-Stein had three.\n\nPhiladelphia played without JJ Redick and Wilson Chandler.\n\n\"What you realize is we need a healthy team,\" Sixers coach Brett Brown said. \"You're not fighting with your whole arsenal and you need to. There's not much wriggle room as it sits.\"\n\nTIP-INS\n\n76ers: Philadelphia shot 1 of 13 on 3s in the first half. ... Wilson Chandler was held out with a strained right quad which he injured Thursday against Golden State. ... JJ Redick was given the night off.\n\nKings: Fox left the game briefly in the third quarter and was taken to the locker room after getting hit in the eye. He later returned. ... Bagley's double-double was his eighth this season. The second overall pick continues to come off the bench for Dave Joerger's team.\n\nPLAYOFF CHATTER\n\nThe Kings are in ninth place in the West, 1 1/2 games behind the Los Angeles Clippers for the final playoff spot. Getting Sacramento to the postseason for the first time since the 2005-06 season is an increasing focal point for the Kings players.\n\n\"If we were in the East we'd probably be the fifth or sixth seed,\" Hield said. \"Everybody's still doubting us but we believe in ourselves and we're going to keep believing.\"\n\nHE SAID IT\n\n\"All of a sudden he just sort of exploded and really carried us. He was excellent defensively and offensively as we saw by the bottom line numbers.\" Brown on Butler's fourth quarter.\n\nUP NEXT\n\n76ers: Host Toronto on Tuesday.\n\nKings: Host San Antonio on Monday.\n\n--\n\nMore AP NBA:www.apnews.com/NBAandwww.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994022.0033019
}