{
  "game_id": "0022200790",
  "espn_id": "401468945",
  "date": "Feb 03, 2023",
  "matchup": "ORL @ MIN",
  "headline": "Magic beat Wolves 127-120 after fight, 5 players ejected",
  "body": "MINNEAPOLIS -- — Cole Anthony had 20 points and fellow reserve Moritz Wagner scored 19 as Orlando’s bench propelled the Magic to a 127-120 win against the Minnesota Timberwolves that included a fight between the teams and five player ejections Friday night.\n\n\r\n              The brawl broke out in front of the Orlando bench late in the third quarter, when Minnesota guard Austin Rivers and Magic center Mo Bamba got into an altercation. Bamba came off the bench and Rivers threw punches at him in a tussle that spilled over to include several others on the court.\n\n\r\n              As play initially continued at the far end, Jalen Suggs pulled Rivers away from Bamba and to the ground while other players joined in.\n\n\r\n              “You obviously want to have your teammate's back and at the same time, you’ve got to be a professional,” said Wagner, who was ejected after a fight with the Detroit Pistons in December. “So, that’s a challenge for a young team like us. I think this time around we did a good job compared to last time. So, yeah, I don’t really know. It’s a weird dynamic. You don’t really want to be in those situations and it’s not really the best look. You want to be professional. At the same time, there is something in me that appreciates the team sticking together like that.”\n\n\r\n              Rivers, Jaden McDaniels and Taurean Prince were ejected for the Timberwolves, who had lost forward Kyle Anderson earlier in the game due to injury. Bamba and Suggs were tossed for Orlando.\n\n\r\n              Reserve big man Bol Bol had 14 points for the Magic, who got 72 points from their bench. Orlando had lost three of four, but got a rare strong defensive performance that was aided by Suggs’ on-ball defense before he was ejected.\n\n\r\n              “You've got to keep playing,” Magic coach Jamahl Mosley said. “You have to win the game between the lines. It’s not about all the talking. It’s not about any of that. You've got to make sure you play the right way, do the right thing, continue to share the basketball and continue to defend.”\n\n\r\n              D’Angelo Russell had 29 points and 10 rebounds for Minnesota, which had won six of eight. Anthony Edwards added 19 points and Rudy Gobert scored 15.\n\n\r\n              The Timberwolves shot 46% from the field and committed 20 turnovers, leading to 26 points for Orlando.\n\n\r\n              “I don’t think our approach was wrong,” Minnesota coach Chris Finch said. “I think our execution was soft. And we wanted it to be a little easier than it was. Knew it would be a physical game. We had a hard time containing the ball. So yeah, felt like they were ready to play. They understood. When a little adversity hit, we really couldn’t stop it.”\n\n\r\n              The Magic started the day 23rd in the NBA in defensive rating, but their youth and length challenged Minnesota — particularly Edwards. \n\n\r\n              The budding star had scored at least 25 points in seven straight games and had more than 30 in five of them. But he shot just 5 of 15 from the field and 1 for 7 from 3-point territory.\n\n\r\n              HOT TEMPERS \n\n\r\n              The fight appeared to come on suddenly, with no previous sign of potential problems.\n\n\r\n              A few moments earlier, Rivers missed a 3-pointer right in front of the Orlando bench and replays showed the 7-foot Bamba and Markelle Fultz reacting while watching Rivers run back up the court. The 6-foot-4 Rivers said he took issue with Bamba's comments. \n\n\r\n              “I’m just like, ‘Yo, what are you doing?’,” Rivers said. “I went up to him and I pressed him, and at that point, it can go one of two ways. I didn’t think we were going to get in a fight. But when you stand up that fast and put your hands up — he threw a punch and missed, thankfully. At that point I've got to protect myself. Ain’t no one worried about him.”\n\n\r\n              TIP-INS\n\n\r\n              Magic: Wendell Carter Jr. was held out due to a right plantar fascia strain. Bamba started in his place and had 11 points. … Suggs scored all 10 of his points in the second quarter. ... Orlando had 13 offensive rebounds and 28 second-chance points.\n\n\r\n              Timberwolves: Anderson left early in the first quarter with back spasms and didn’t return. … Gobert returned after missing one game with right groin soreness.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Charlotte on Sunday.\n\n\r\n              Timberwolves: Host Denver on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994620.992901
}