{
  "game_id": "0022000969",
  "espn_id": "401307772",
  "date": "May 02, 2021",
  "matchup": "MIA @ CHA",
  "headline": "Heat move into 6th place in East; beat Hornets 121-111",
  "body": "CHARLOTTE, N.C. -- — The NBA playoffs are approaching and the defending Eastern Conference champion Miami Heat are starting to play like it.\n\n\r\n                    Bam Adebayo had 20 points and 10 rebounds, Jimmy Butler added 18 points, eight rebounds and eight assists, and the surging Heat easily defeated the Charlotte Hornets 121-111 on Sunday night to move into sole possession of sixth place in the conference.\n\n\r\n                    Miami’s win combined with Boston’s 129-119 loss to the Portland Trail Blazers leaves the Heat (35-30) a full game ahead of the Celtics with seven games remaining.\n\n\r\n                    That’s significant because the team that finishes in sixth automatically qualifies for the playoffs, while the teams that finish in seventh through 10th place must earn their way into the postseason via the play-in tournament.\n\n\r\n                    “You want to be playing your best basketball at the right time and I'm praying, I'm hoping that right now is the right time for us to being playing our best basketball,” Butler said.\n\n\r\n                    Kendrick Nunn added 19 points and Goran Dragic had 18 for the Heat, who've won four of their last five.\n\n\r\n                    P.J. Washington had 21 points on 9-of-13 shooting for the Hornets (31-33), while rookie LaMelo Ball finished with 14 points, six rebounds and five assists in his second game back from a broken wrist.\n\n\r\n                    The Hornets were hoping to pull within 1 1/2 games of the Heat for seventh place in what Miles Bridges had called a statement game, but they never could get on track and failed to match Miami's intensity.\n\n\r\n                    “This team was in the Finals last year,” Bridges said of the Heat. “They know what it’s like to be in the playoffs. Mostly everybody on our team doesn’t know how to be in the playoffs. ... So yeah, they played more physical than us and it showed.”\n\n\r\n                    Adebayo dominated the paint early and Dragic sliced up Charlotte's defense with surprising ease as the Heat avoided a series sweep by the Hornets.\n\n\r\n                    Dragic said Sunday night felt like a playoff game.\n\n\r\n                    “We definitely want to be in the top six and not play in the seeding game,” Dragic said. “We need to fight every game because it’s important. It is the playoffs. The preparation is just different.”\n\n\r\n                    “They were able to get to the rim, they were physical in the paint,” Hornets coach James Borrego said. “I thought our success against them a lot this season was the paint game. We’ve done a much better job protecting the paint, but we got exposed there tonight.”\n\n\r\n                    The Heat led by as many as 12 in the first half, but Ball cut the lead to seven at the break with a rebound and a full-court baseball pass to a streaking Terry Rozier for the layup to beat the buzzer. \n\n\r\n                    But Butler began to take over in the third quarter, getting past Bridges for a two-handed dunk for a three-point play to give the Heat a 93-78 lead. Dragic added a layup to push Miami's lead to 20 entering the fourth quarter and it seemed to deflate the Hornets. Nunn's 3-pointer gave Miami a 25-point lead early in the fourth quarter and a short while later, both coaches began emptying the benches.\n\n\r\n                    It was the second straight night Miami's starters got to watch the finish while relaxing on the bench.\n\n\r\n                    “We threw different type of defenses at them throughout the entire game,” Butler said. “We were locked in. Being able to mix and match our defense can really help us grow.”\n\n\r\n                    TIP INS\n\n\r\n                    Heat: Had 30 assists on 45 made baskets. ... Outscored Charlotte 64-50 in the paint.\n\n\r\n                    Hornets: Cody Martin, who has been starting for the Hornets, left with a sprained left ankle and did not return. He played just seven minutes and did not score. ... Rozier became the fifth player in franchise history to reach 200 3-pointers in a season.\n\n\r\n                    CLOSING STRETCH \n\n\r\n                    The Heat have a challenging closing stretch with two games left against the Celtics, and one each against the Mavericks, 76ers and Bucks.\n\n\r\n                    “I think we will be just fine,” Butler said confidently.\n\n\r\n                    MONK A NONFACTOR\n\n\r\n                    Malik Monk averaged 34 points in Charlotte’s previous two wins against Miami this season, but he was a nonfactor in his second game back from an ankle injury, limited to 11 points.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Host Mavericks on Tuesday night.\n\n\r\n                    Hornets: At Pistons on Tuesday night.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764996752.496819
}