{
  "game_id": "401809934",
  "espn_id": "401809934",
  "date": "Oct 22, 2025",
  "matchup": "ORL vs MIA",
  "headline": "Paolo Banchero and Franz Wagner score 24 points each and Orlando beats Miami 125-121",
  "body": "ORLANDO, Fla. -- — Paolo Banchero and Franz Wagner scored 24 points each, Desmond Bane added 23 in his Orlando debut, and the Magic beat the Miami Heat 125-121 on Wednesday night in the season opener for both teams.\n\n\r\n              Norman Powell led Miami with 28 points, and Bam Adebayo had 15 points and 12 rebounds. The Heat led by seven points midway through the fourth quarter before going more than four minutes without a field goal.\n\n\r\n              Magic guard Jalen Suggs, a surprise starter after missing the second half of last season and the entire exhibition season, finished with 14 points on 6-of-7 shooting. Suggs came up with several defensive plays late in the fourth quarter, including a steal and layup that reduced Miami’s lead to 111-110.\n\n\r\n              Suggs’ short jumper with 58.7 seconds left put Orlando ahead to stay, and Wendell Carter’s two free throws finished the scoring with 6.1 seconds left.\n\n\r\n              Andrew Wiggins had 18 points for the Heat and Davion Mitchell had 16 points and 12 assists.\n\n\r\n              Bane, playing in his first game after signing a five-year contract with the Magic, hit his first two 3-point shots and finished 3-for-7 from behind the arc.\n\n\r\n              Miami led 39-38 after the first quarter, the highest-scoring quarter in the 143-game history of the intrastate series.\n\n\r\n              Suggs played for the first time since Jan. 25, after missing most of last season with an assortment of injuries and having surgery on his left knee.\n\n\r\n              The Heat played without Tyler Herro, their leading scorer last season, who had surgery on his left ankle on Sept. 19.\n\n\r\n              Up next\r\n              Heat: Visit Memphis on Friday night.\n\n\r\n              Magic: Host Atlanta on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042477.109616
}