{
  "game_id": "0022200119",
  "espn_id": "401468274",
  "date": "Nov 03, 2022",
  "matchup": "DEN @ OKC",
  "headline": "Gordon's 27, Jokic's triple-double lead Nuggets past Thunder",
  "body": "OKLAHOMA CITY -- — Aaron Gordon scored 27 points, Nikola Jokic had a triple-double and the Denver Nuggets beat the Oklahoma City Thunder 122-110 on Thursday night.\n\n\r\n              Jokic, the two-time reigning league MVP, had 15 points, 13 rebounds and 13 assists. It was his third triple-double this season and the 79th of his career. He passed Wilt Chamberlain's record for most triple-doubles for a center.\n\n\r\n              Jamal Murray added 24 points for the Nuggets, who were coming off a loss to the Los Angeles Lakers on Sunday.\n\n\r\n              The Nuggets led by 19 points in the second quarter but had to fight for the win.\n\n\r\n              “Was it a complete 48 minutes? No,\" Nuggets coach Michael Malone said. \"But the thing I’m most proud about is that even when they were on that huge run in the third quarter and we just seemed to stop playing any defense and we turned the ball over ad nauseam, we regrouped. We didn’t panic.”\n\n\r\n              Shai Gilgeous-Alexander led the Thunder with 37 points. He made 13 of 17 field goals and all 11 of his free throws. He didn't shoot a 3-pointer, which was fine with Thunder coach Mark Daigneault.\n\n\r\n              “He’s so efficient, and I think he’s got a nice blend,\" Daigneault said. \"I think if he wasn’t getting to the line and wasn’t getting to the rim and wasn’t out in transition and it was just solely the midrange stuff, that’s probably not a sustainable diet. But he’s got a lot of diversity there (so) it’s pretty sustainable, and he chooses his spots nicely with how efficiently he shot it. He’s doing a nice job for us.” \n\n\r\n              Lu Dort added 19 points and Josh Giddey added 16 for the Thunder, who had won four straight.\n\n\r\n              The Thunder were successful around the basket, but made just 6 of 29 3-pointers.\n\n\r\n              “Some of it was good looks that we missed,” Daigneault said. “We got a little hasty there in the fourth, especially early on a night where they’re not really falling. I think that’s the night you’ve got to be really stubborn about finding other ways to score.”\n\n\r\n              Denver scored the game's first 13 points as the Thunder missed their first six shots. The Nuggets led 71-57 at halftime behind 23 points from Gordon. \n\n\r\n              “Aaron Gordon tonight, the start he got us off to -- attack mode,\" Malone said. \"Just relentless. When he plays with that attack mindset he’s a hell of a player.”\n\n\r\n              Jokic scored just two points in the first half, but he also had nine rebounds and eight assists.\n\n\r\n              Gordon's follow dunk over Oklahoma City's Darius Bazley gave Denver a 75-65 lead, but the Thunder were undeterred. Aleksej Pokusevski's layup finally gave Oklahoma City a 93-91 lead. The Thunder led 95-93 heading into the fourth.\n\n\r\n              The Nuggets took control in the final period by holding the Thunder to 7-for-22 shooting. Gilgeous-Alexander, who entered the night fourth in the league with 31.5 points per game, scored just four points in the fourth quarter.\n\n\r\n              Meanwhile, Murray scored 14 points in the final 12 minutes.\n\n\r\n              “He got going,\" Malone said. \"He found that rhythm shooting into a big basket.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Shot 65.2% in the first quarter to take a 42-29 lead. ... Gordon scored 15 points in the first quarter. ... Beat the Thunder 122-117 on Oct. 22. \n\n\r\n              Thunder: Got fined $25,000 for violating league injury reporting rules. The league said Oklahoma City failed to disclose Giddey's game availability in “an accurate and timely manner” before its game against Orlando on Tuesday. ... Gilgeous-Alexander scored 17 points in the first quarter. ... Bench was called for a technical foul with 8:07 remaining and the game tied at 101.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host the San Antonio Spurs on Saturday.\n\n\r\n              Thunder: Visit the Milwaukee Bucks on Saturday.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994737.348961
}