{
  "game_id": "0021800076",
  "espn_id": "401070757",
  "date": "Oct 27, 2018",
  "matchup": "CHI @ ATL",
  "headline": "LaVine, Parker lead Bulls past Hawks, 97-85",
  "body": "ATLANTA --  Zach LaVine and the Chicago Bulls bounced back nicely from an ugly defeat.\n\nLaVine had 27 points and a career-high 11 rebounds, and the Bulls went 7 of 10 from 3-point range in the fourth quarter to pull away for a 97-85 victory over the Atlanta Hawks on Saturday night.\n\nOne night earlier, the Bulls were embarrassed 135-106 at Charlotte.\n\n\"It's good to get a win,\" said LaVine, who has led the Bulls in scoring in all six games. \"I was upset with the effort that we gave (Friday).\"\n\nJabari Parker scored half of his 18 points in the fourth quarter for the Bulls, who struggled from long range for the first three quarters, making 5 of 23 from beyond the arc. Rookie Wendell Carter Jr. had 10 points and 10 rebounds while playing his first NBA game in his hometown.\n\nTrae Young, who entered leading rookies with 21.5 points per game, scored 13 points on 3-of-12 shooting for the Hawks and turned the ball over five times. Taurean Prince led Atlanta with 16 points and reserve Dewayne Dedmon had 13 points and 13 rebounds.\n\nPrince, Young and Kent Bazemore combined for 15 of Atlanta's 22 turnovers on a night when the Hawks shot 32.1 percent (27 of 84).\n\n\"Coming off two games where we played well (and won), it was a lesson in how you handle success,\" Hawks coach Lloyd Pierce said. \"Sometimes, we were trying to do too much, and it was evident with our 22 turnovers. ... I thought right from the start we were trying to hit home runs.\"\n\nBoth teams were cold in the first half. The Hawks led 44-41 at the break while shooting 26.2 percent from the field (11 of 42), including a 3-for-15 performance in the paint.\n\nAtlanta did make 8 of 22 3-point attempts in the first half to hold the Bulls at bay as Chicago made 15 of 45 overall and 4 of 17 from beyond the arc.\n\nThe Bulls led 67-63 after three quarters. Atlanta got within two on Vince Carter's 3-pointer midway through the fourth, but the Bulls responded with a 9-2 run, including two 3-pointers by Justin Holiday.\n\n\"They didn't like how last night went,\" Bulls coach Fred Hoiberg said. \"I saw it in their eyes.\"\n\nThe Bulls out-rebounded the Hawks 14-6 in the fourth quarter on the way to their fourth straight win over Atlanta.\n\n\"They were fighting,\" Pierce said. \"They lost pretty bad (Friday) night, so they came out with a greater sense of urgency than we did.\"\n\nTIP-INS\n\nRyan Arcidiacono had 13 points for Chicago and Holiday had 12. ... Forward Bobby Portis, Chicago's leading rebounder, missed his second straight game with a sprained right knee. ... The Hawks asked for a moment of silence before the game for the victims of Saturday's shooting at the Tree of Life Synagogue in Pittsburgh, where a gunman killed 11 people in one of the deadliest attacks on Jews in U.S. history.\n\nHOMECOMING OF SORTS\n\nPierce won't be sentimental about returning to Philadelphia, where he was an assistant before taking the Atlanta job, to face the 76ers on Monday night.\n\n\"You look forward to going back to a place you spent a lot of time with the staff, the players, but it's about us. This really is a business trip. It's about us trying to correct what we did tonight,\" he said. \"It will be a tough atmosphere, having been there.\"\n\nNOT RUNNING WITH THE BULLS\n\nThe Hawks want to outrun opponents and score easy points, but they were beaten 16-11 in fast-break points, scoring on just 3 of 9 tries.\n\nUP NEXT\n\nBulls: Return home to play the Golden State Warriors on Monday night.\n\nHawks: At Philadelphia on Monday night in the first of back-to-back road games.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994855.899612
}