{
  "game_id": "0021901282",
  "espn_id": "401224757",
  "date": "Aug 08, 2020",
  "matchup": "IND vs. LAL",
  "headline": "Warren scores 39, Pacers surge past Lakers late, 116-111",
  "body": "LAKE BUENA VISTA, Fla. --  T.J. Warren is leading a litany of All-Stars in scoring inside the NBA bubble, and his Indiana Pacers are the only Eastern Conference team with four wins.\n\nThey got there with a victory over LeBron James and the Lakers.\n\nWarren scored 39 points, including seven straight to put Indiana ahead in the final two minutes, and the Pacers beat Los Angeles 116-111 on Saturday.\n\nLeBron James had 31 points, eight rebounds and seven assists after sitting out the first game since the Lakers clinched the top seed in the West. James was officially listed as out with a sore right groin in a 113-97 loss to Houston.\n\nA week after scoring a career-high 53 points in the restart opener, Warren hit a floater for a 109-108 lead followed by a jumper and a 3-pointer for a six-point edge with 10 seconds to go.\n\nWarren is averaging 34.8 points in five bubble games, a point better than Houston star James Harden. The Pacers are 4-1 in the restart, a half-game ahead of Philadelphia for the fifth seed and a half-game behind No. 4 seed Miami in the East. The Pacers play the Heat on Monday.\n\n\"I just feel like I'm in a groove offensively, defensively,\" Warren said. \"I feel like as a team we're grooving right now. We've just got to keep it up.\"\n\nAnthony Davis, held to eight points on 3-of-14 shooting, scored inside to give the Lakers their last lead before Warren took over and dropped LA to 2-4 in the restart.\n\nIt was the first time this season the Lakers have lost when James scored at least 30 points. The 20 straight wins tied Jerry West (1963-64) for the longest in NBA history, according to ESPN.\n\n\"It is on me,\" Davis said after being held to single digits for the fourth time this season. \"I had some good looks tonight, just missed shots around the rim, the layup that I missed, open 3s missed, open mid-range shot. Shot just not going in.\"\n\nWarren scored 18 in the first quarter, one off the franchise record for the first that he tied in a bubble-opening win over Philadelphia a week ago, before getting held without a shot in the second quarter.\n\nThe sixth-year guard acquired in an offseason trade with Phoenix heated up again in the fourth with 12 points, hitting five of six shots and finishing 15 of 22. Warren was 5 of 8 from long range.\n\n\"Hopefully he stays hot for us because we need it,\" Victor Oladipo said, holding up a hand with fingers crossed.\n\nMalcolm Brogdon scored 24 points for Indiana, and Oladipo added 22.\n\nQuinn Cook scored 21 for the Lakers, going 5 for 9 from 3-point range but missing one that would have pulled LA even in the final minute.\n\nTIP-INS\n\nLakers: After Justin Holliday opened the second quarter with a 3 that pushed the Pacers' lead to 13, the Lakers went on a 22-5 run for a 46-42 lead. James scored six straight points on layups to start the run and later hit a 3. ... James was the only starter in double figures.\n\nPacers: Indiana's JaKarr Sampson had back-to-back putback dunks in the first quarter to finish a run to a 32-17 lead. Both of the dunks came off missed 3s. ... Aaron Holiday had seven points and matched James with a game-high seven assists.\n\nFEELS LIKE YESTERYEAR\n\nJames said he's getting more comfortable playing an empty gym, while also noting how dark it is and how \"literally you could hear a feather hit the ground.\"\n\n\"I haven't played in an empty gym in a very, very long time,\" James said. \"For me personally it's been a very long time since no one was watching me play the game.\n\n\"The gyms ... were not as packed my freshman year. I was starting to make a name for myself but the gym wasn't as packed. But as far as empty, I don't think I've ever played in an empty gym that really counted.\"\n\nUP NEXT\n\nLakers: Play Denver on Monday.\n\nPacers: Play Miami on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995827.636251
}