{
  "game_id": "0022200848",
  "espn_id": "401469003",
  "date": "Feb 11, 2023",
  "matchup": "MIA @ ORL",
  "headline": "Heat use balanced scoring, rally to beat Magic 107-103 in OT",
  "body": "ORLANDO, Fla. -- — Tyler Herro scored 23 points, Jimmy Butler added 22 points and seven rebounds and the Miami Heat rallied to beat the Orlando Magic 107-103 in overtime on Saturday night.\n\n\r\n              Gabe Vincent, who finished with 20 points, opened OT with a 3-pointer. Herro scored twice from the lane and the Magic, who had led by nine with 2 1/2 minutes left in the fourth quarter, never caught up.\n\n\r\n              Markelle Fultz led the Magic with 17 points. Paolo Banchero had 16 points and 13 rebounds and missed a driving layup in the final seconds of the fourth quarter that was altered by Miami center Bam Adebayo.\n\n\r\n              Once the game went into overtime, the advantage swung to Miami.\n\n\r\n              “We have a ton of experience, so we have the packages where we know where we want to get the ball, facing all the different coverages that we’ve faced,” coach Erik Spoelstra said. “That's a big part of it, but you also have to get the stops.”\n\n\r\n              “They're a team with a lot of experience and they’ve been in these situations a ton of times,” Magic coach Jamahl Mosley said.\n\n\r\n              Adebayo, who played the entire fourth quarter and overtime, finished with 13 points, 17 rebounds and six assists. He was the centerpiece of the defensive effort that held the Magic to 24 points in the final 17 minutes.\n\n\r\n              “Taking the paint away was the biggest thing, not letting them get the easy layups like they did in the first half,” he said. “Really closing out and helping each other. That’s how we’re going to win games down he stretch.”\n\n\r\n              The Magic grabbed a 52-35 lead with the Heat shooting below 30% with 10 turnovers in the first 21 minutes. Butler and Adebayo rallied Miami late in the half and Max Strus hit a 3-pointer just before halftime as the Heat pulled within 54-46.\n\n\r\n              Mo Wagner scored 10 straight points for the Magic late in the third period, and a dunk by Jonathan Isaac pushed Orlando's lead to 12 early in the fourth. But after a dunk by Bol Bol put the Magic up 91-81, they scored only six points in the final 6:40 of regulation, and only six more in overtime.\n\n\r\n              “We had a couple lapses on both ends of the floor, but I think offensively we started to slow down a little and not play our style of basketball,” Fultz said. “We kind of let it stick a little bit. I think they turned up the heat and got a couple of calls to go their way as well.”\n\n\r\n              Suggs, Wendell Carter Jr. and Mo Wagner scored 14 points each for the Magic. \n\n\r\n              TIP-INS\n\n\r\n              Heat: Butler, whose dunk at the buzzer won Friday night's game against Houston, played both ends of a back-to-back for the first time since October. ... The Heat had 20 turnovers but none in overtime. ... Spoelstra said G Victor Oladipo, who missed a fifth game with an ankle injury, has a chance of playing before next weekend's All-Star break. \n\n\r\n              Magic: F Chuma Okeke, out since Nov. 21 with a knee injury, was slated to play a second G-League game before being reconsidered for the active roster.\n\n\r\n              SUGGS SAT OUT THE OVERTIME\n\n\r\n              Suggs, who had four steals and three blocks for Orlando and generally wreaked havoc defensively, did not play in overtime.\n\n\r\n              “Gary (Harris) was defending Herro decently well,” explained Mosley while acknowledging that “we may have to go back and look at how we may have to get (Suggs) those minutes.”\n\n\r\n              Said Suggs, who played 28 minutes: “We realize how close we are, and we need wins in games like this. I kind of feel like we let ourselves down.”\n\n\r\n              UP NEXT\n\n\r\n              Heat: At home against Denver on Monday night.\n\n\r\n              Magic: At Chicago on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993942.2705011
}