{
  "game_id": "0021801034",
  "espn_id": "401071707",
  "date": "Mar 16, 2019",
  "matchup": "ATL @ BOS",
  "headline": "Irving, Celtics survive late charge by Hawks in 129-120 win",
  "body": "BOSTON --  What looked like an easy day for the Boston Celtics turned into a fight to the finish.\n\nIt's something they've got to clean up heading into the postseason.\n\nKyrie Irving just missed his second straight triple-double with 30 points, 11 rebounds and nine assists, Jaylen Brown scored 23 points with a key 3-pointer and the Celtics held off the Atlanta Hawks 129-120 Saturday after blowing a 25-point second-half lead.\n\n\"To be mature about having the lead, you've got to keep the pressure on them and keep playing smart basketball on both ends of the floor,\" Irving said. \"We didn't do that.\"\n\nMarcus Morris had 19 points and Jayson Tatum scored 18 for Boston, which has won six of eight.\n\nTrae Young led the Hawks with 26 points, John Collins scored 20 with 11 rebounds, Taurean Price had 17 points and Vince Carter scored 16.\n\nIrving had his second career triple-double in a win over Sacramento on Thursday.\n\nIt could have been a costly victory for the Celtics after forward Gordon Hayward suffered a strained neck early in the game and didn't return. Hayward banged his head into the shoulder of Atlanta's John Collins, who was setting a screen, and looked dazed before he went to the locker room.\n\nCeltics coach Brad Stevens said Hayward was \"woozy\" from the hit and was sent home after halftime.\n\nAfter Boston squandered the 25-point lead, Brown nailed his 3 from the right corner, sparking a 9-0 spurt that gave the Celtics a 121-112 edge with 3 1/2 minutes left.\n\n\"For our group it's just making sure we keep our focus throughout even when the game is supposed to be out of reach,\" Al Horford said. \"This proves any team can get into it.\"\n\nBoston blew big leads in consecutive home losses against the Los Angeles Lakers and Clippers early last month.\n\nThe Celtics held their large lead late in the third but got just one basket in 7 1/2 minutes -- on a three-point play by Tatum -- when the Hawks outscored them 28-6 to cut it to 109-106 on Young's 3-pointer with 7:25 to play.\n\n\"It's maddening because what happened in the end of third, early fourth, was they ratcheted up their pressure and we were on our heels and you could see it,\" Stevens said.\n\nAtlanta tied it at 112 on Kent Bazemore's two free throws.\n\n\"We've been doing that a lot throughout this year. We get down big, then we have to fight our way back into the game,\" Young said. \"I think what happened today was we ran out of gas.\"\n\nBoston led by 12 at halftime and went on a 15-3 run midway into the third to push its lead to 103-78 on Irving's step-back 3-pointer from the left wing.\n\nBut Atlanta had a 14-2 spree late in the quarter, slicing it to 105-92.\n\n\"To be down (25) in the third and to tie the ballgame up is a testament to the guys in that locker room -- young, old, whatever you want to call them,\" Hawks coach Lloyd Pierce said.\n\nThe Celtics started hot from the floor and were shooting 66.7 percent late in the second quarter when they opened a 16-point lead (66-50). They carried that into a 74-62 edge at intermission, matching their season high for points in any half.\n\nTIP-INS\n\nHawks: Entered the day averaging a league-best 123.4 points per game since the All-Star break. ... Early in the second quarter, the 42-year-old Carter was the team's best offensive weapon, scoring eight points on 3-of-4 shooting while making both of his 3-point attempts. \"I hated playing Vince Carter today,\" Stevens joked. \"As a 42-year-old I love noon tips. I'm sure he does. I knew he'd go off.\"\n\nCeltics: Horford went to the locker room early in the third after banging knees, returned to ride an exercise bike and got treatment on the sideline before returning midway through the fourth. ... A few Celtics players became sick when they returned from their West Coast trip earlier this week. Reserve center Daniel Theis and backup point guard Terry Rozier missed Thursday's win over the Sacramento because of illness, but they played Saturday.\n\nROOKIE VS. UNCLE DREW\n\nThere was an interesting matchup between Celtics star Irving and Young, Atlanta's promising rookie.\n\nThey went at each other from the start, pleasing the crowd with Irving scoring 12 points mostly on drives and jumpers in the opening quarter and Young driving hard at the veteran guard along with a deep 3 for nine points in the period.\n\n\"To have that competitive spirit, I love it,\" Irving said. \"If someone scores at me, I'm going right back at them.\"\n\nFAST START AGAIN\n\nBoston's season high for any quarter is 45 points against the Hawks in Atlanta on Nov. 23. The Celtics had 43 in the first Saturday.\n\nUP NEXT\n\nHawks: At Orlando on Sunday night.\n\nCeltics: Host Denver on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995344.753403
}