{
  "game_id": "0021700480",
  "espn_id": "400975231",
  "date": "Dec 23, 2017",
  "matchup": "TOR vs. PHI",
  "headline": "DeRozan scores 29, Raptors beat slumping 76ers 102-86",
  "body": "TORONTO --  Joel Embiid's return wasn't enough to get the Philadelphia 76ers out of their recent rut.\n\nDeMar DeRozan scored 29 points, Serge Ibaka had 17 and the Toronto Raptors beat Philadelphia 102-86 on Saturday for their 10th straight home victory.\n\nEmbiid, Philadelphia's leading scorer and rebounder, returned after missing the previous three games because of a sore lower back.\n\n\"It wasn't feeling the best but I really wanted to play tonight,\" Embiid said.\n\nEmbiid had 14 points and eight rebounds in 23 minutes, but the 76ers lost for the 18th time in 19 meetings with the Raptors.\n\nPhiladelphia coach Brett Brown said he could tell Embiid, who got a technical foul late in the third, was frustrated at not being able to perform better.\n\n\"He wants to do so much more and he can't,\" Brown said. \"He just hasn't practiced or, recently, played. There was a rhythm and a fluid side of his game that he was searching for.\"\n\nDario Saric scored 17 points, Amir Johnson had 12 and Ben Simmons scored 10 for Philadelphia, which has lost five straight and nine of 10.\n\nBrown insisted his players haven't been affected by the slump.\n\n\"They understand the sky isn't falling,\" Brown said.\n\nSimmons echoed his coach's assessment of the rotten run, which includes a triple-overtime loss against Oklahoma City.\n\n\"A rough few games,\" Simmons said. \"We just need to get back on track. Once we get that game under out belts, we'll be fine. There's no reason to panic.\"\n\nDelon Wright matched his season high with 14 points while Kyle Lowry and Jonas Valanciunas each had 12 for the Raptors, who have won six straight overall and 12 of 13.\n\nToronto is an NBA-best 12-1 at home, and its 10-1 December record is tied for best in the league with Golden State.\n\n\"I can see an air of confidence, especially here, and we've got to continue that,\" Raptors coach Dwane Casey said.\n\nEmbiid took Philadelphia's first six shots of the game. He scored eight points in the opening quarter, but Ibaka had 13 for the Raptors. The teams were tied at 27 after the first.\n\nTher 76ers made five of 15 field-goal attempts in the second and committed 10 turnovers that led to 15 Toronto points. Lowry and Valanciunas each scored eight points in the second, and the Raptors led 55-46 at halftime.\n\nDeRozan scored 16 points in the third, and Toronto closed the quarter on a 13-3 run, taking an 81-63 lead into the fourth.\n\n\"You blink and they go whack, whack,\" Brown said.\n\nTIP-INS\n\n76ers: G J.J. Redick (right hamstring) missed his second straight game. ... The 76ers finished with 22 turnovers, leading to 28 points for Toronto. Philadelphia's season high for turnovers is 24, set in an overtime win against Minnesota on Dec. 12.\n\nRaptors: C.J. Miles missed his third straight game after undergoing a dental procedure. ... Toronto is 8-2 when DeRozan makes multiple 3-pointers.\n\nWELCOME TO TORONTO\n\nEmbiid played in Toronto for the first time in his NBA career. The oft-injured big man had missed his first seven career games north of the border, including one this season.\n\nMAGIC TOUCH\n\nAmir Johnson stopped to briefly rub Embiid's back as the 76ers big man was getting a massage on the baseline during pregame shooting.\n\nWITH OR WITHOUT YOU\n\nThe 76ers are 13-11 when Embiid plays and 1-7 when he sits.\n\nUP NEXT\n\n76ers: Visit the Knicks on Christmas Day. It's the first meeting of the season between the Atlantic Division opponents.\n\nRaptors: Begin a two-game road trip at Dallas on Tuesday. After Wednesday's game at Oklahoma City, Toronto has just one road game remaining against a Western Conference opponent, at Minnesota on Jan. 20.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992888.5344992
}