{
  "game_id": "0021600690",
  "espn_id": "400900111",
  "date": "Jan 26, 2017",
  "matchup": "OKC vs. DAL",
  "headline": "Westbrook scores 45 points, Thunder beat short-handed Mavs",
  "body": "OKLAHOMA CITY --  Just when it looked as if the Oklahoma City Thunder might squander a big lead, Russell Westbrook unleashed his full fury on the Dallas Mavericks.\n\nWestbrook scored 17 of his 45 points in the final 8:23 to help the Thunder beat the short-handed Mavericks 109-98 on Thursday night.\n\nOklahoma City led by 16 late in the third quarter, but the advantage was down to six when Westbrook checked in after a Dallas timeout. The NBA scoring leader made 7 of 10 shots in the fourth quarter, including 3 of 4 3-pointers.\n\n\"I could tell in the timeout that he felt like he was getting ready to kind of explode, to be honest with you,\" Thunder coach Billy Donovan said.\n\nWestbrook was 16 of 29 overall from the field after being named an All-Star reserve earlier in the night. He had eight rebounds and three assists, ending his triple-doubles streak at three games.\n\nVictor Oladipo added 17 points, and Steven Adams had 15 in Oklahoma City's third straight win.\n\nThe Thunder's excitement was dimmed when they learned that forward Enes Kanter fractured his right forearm punching a chair in the second quarter. Kanter is the team's No. 3 scorer and one of the league's top reserves.\n\n\"It was tough, man,\" Westbrook said. \"To do it the way he did it is very unfortunate. He's a strong man, and he'll be back better.\"\n\nAdams said Kanter likely will struggle with how he has affected the team.\n\n\"He didn't mean to do it, obviously,\" Adams said. \"It's just one of those frustrating times where it just happened to like -- he did what he did, you know. He's already hard on himself. No one else can be as hard as he is on himself. He's probably just feeling so under the weather. I feel bad for him.\"\n\nHarrison Barnes scored 31 points, and Justin Anderson added 17 for the Mavericks. They had won five of seven.\n\nDallas was without four of its top five scorers. Forward Wesley Matthews sat out with a right hip strain, forward Dirk Nowitzki rested on the second game of a back-to-back, guard J.J. Barea was out with a left calf strain, and guard Deron Williams was out with a sprained left big toe.\n\nOladipo made a 3-pointer with 5.3 seconds left in the first half to put the Thunder up 53-52, but Dorian Finney-Smith answered with a 3 as time expired in the half to put the Mavericks up 55-53.\n\nOklahoma City gained control in the third quarter and put the Mavericks into foul trouble. Westbrook scored 13 points in the period, and Oklahoma City led 87-73 heading into the fourth quarter.\n\nDallas roared back in the opening minutes of the final period and cut Oklahoma City's lead to three, but rookie Domantas Sabonis drained a 3-pointer, and Dallas called a timeout.\n\nWestbrook then checked in after a short rest and finished the job.\n\n\"We put up a good fight,\" Anderson said. \"It's tough when we did great the whole night. Westbrook got hot there at the end shooting threes. We were answering him with twos, and that's a tough battle to win.\"\n\n---\n\nTIP INS\n\nMavericks: Dallas committed just one turnover in the first quarter. ... Rookie G Pierre Jackson suffered a left hamstring pull in the second quarter and only played 13 minutes in his first career start.\n\nThunder: Westbrook went without an assist in the first half, and without an assist or rebound in the second quarter. ... Oklahoma City shot 51.4 percent overall. ... Kanter finished with four points in nine minutes.\n\nSTAT LINES\n\nBarnes made 13 of 26 shots, made both of his 3-pointers and all three of his free throws.\n\nQUOTABLE\n\nDallas G Devin Harris, on strategy against Westbrook: \"We kind of took everyone else away. We tried to make one guy beat you, and he made some shots. That's just how it goes sometimes.\"\n\nUP NEXT\n\nThe Mavericks play at the San Antonio Spurs on Sunday.\n\nThe Thunder play at the Cleveland Cavaliers on Sunday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP",
  "source": "espn_api",
  "crawled_at": 1764995284.482155
}