{
  "game_id": "0022000620",
  "espn_id": "401307405",
  "date": "Mar 17, 2021",
  "matchup": "CLE vs. BOS",
  "headline": "Sexton, Garland help Cavs snap 4-game slide, beat Celtics",
  "body": "CLEVELAND -- — There have been plenty of frustrating moments and growing pains along the way over the past two seasons for Collin Sexton and Darius Garland.\n\n\r\n                    On Wednesday night, Cleveland's young backcourt shined.\n\n\r\n                    “They stayed poised,” Cavs coach J.B. Bickerstaff said. ”They never got frustrated. They kept their composure. They read what the defense was doing and then they made the right plays.”\n\n\r\n                    Sexton scored 29 points, Garland added 25 and the two guards made big plays down the stretch as the Cavaliers ended a four-game losing streak with a 117-110 win Wednesday night over the Boston Celtics, who have fallen back to .500.\n\n\r\n                    “They made timely baskets,” Boston coach Brad Stevens said . “They made floaters. They made timely plays.”\n\n\r\n                    Sexton and Garland did it all, combining for 54 points, 12 assists and 11 rebounds.\n\n\r\n                    “That’s the improvement and growth we’re looking for,” said Cavs forward Larry Nance Jr., who added 18 points and 10 rebounds.\n\n\r\n                    The Cavs showed some glimpses of a promising future while also ending a nine-game losing streak to the Celtics, who wore their familiar green on St. Patrick's Day but had nothing to celebrate.\n\n\r\n                    Boston lost for the third time in four games, with the Celtics' lone win coming against the woeful Houston Rockets.\n\n\r\n                    Stevens detected some slumping shoulders amongst his players when shots didn't fall in the first half. It was not a good performance by a team with title aspirations and which had played Utah tough before losing at home on Tuesday night.\n\n\r\n                    “Sometimes, that's the way the game goes,” said Stevens, who wasn't displeased with his team's effort.\n\n\r\n                    Cleveland played with a lead all night, but the Cavs had to hold off a second-half rally by Boston led by Jayson Tatum and Jaylen Brown.\n\n\r\n                    Tatum scored 29 points and Brown 28 for the Celtics, whose only lead was at 2-0.\n\n\r\n                    With Cleveland clinging to a four-point lead, Garland hit a runner in the lane, and after a miss by Brown, Cavs rookie Isaac Okoro took a pass by Garland and threw down a vicious dunk and was fouled by Tatum. He completed the three-point play to make it 105-98.\n\n\r\n                    Sexton followed with his own three-point play a minute later to put the Cavs ahead by 12, and Cleveland, which lost at Miami on Tuesday, made its free throws in the final two minutes to get its first win since the All-Star break.\n\n\r\n                    Okoro had 15 points, including seven in the final quarter to help the Cavs hold on.\n\n\r\n                    Boston was just 10 of 38 on 3-pointers with Tatum and Brown going a combined 5 of 25.\n\n\r\n                    The Celtics were down two important pieces as guard Kemba Walker (knee injury management) and forward Tristan Thompson (health and safety protocols) both sat out.\n\n\r\n                    TAIT HONORED\n\n\r\n                    The Cavaliers paid tribute to longtime broadcaster Joe Tait, who died last week, by having a moment of silence before the game.\n\n\r\n                    Tait did radio play-by-play for the team from its inception in 1970 and for 39 seasons. After he retired in 2011, the Cavs hung a banner honoring “The voice of the Cavaliers” among their retired jerseys.\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Stevens said center Robert Williams III will be re-examined on Thursday after hurting his knee going up for a lob. Stevens said there was an initial fear of a hyperextension, but Williams returned. ... This would have been Thompson's first game back in Cleveland since leaving as a free agent last year. A longtime fan favorite, Thompson spent nine seasons with the Cavs, who drafted him with the No. 4 overall pick in 2011.\n\n\r\n                    Cavaliers: F Kevin Love was out again. He missed his second game in a row since returning last week and feeling some discomfort in his second game back with a severe calf strain that has kept him more than two months. ... G Matthew Dellavedova is recovered from a concussion but has not yet been cleared to return following an appendectomy. Coach J.B. Bickerstaff said the veteran will be back “sooner rather than later” but did not provide a timeline. ... The NBA moved Cleveland's April 9 game against Toronto to April 10.\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Host Sacramento on Friday. Boston has won 13 straight at home against the Kings.\n\n\r\n                    Cavaliers: Continue a four-games-in-six-days homestand by hosting San Antonio on Friday. The Spurs' scheduled visit during the season's first half was postponed by COVID-19 issues.",
  "source": "espn_api",
  "crawled_at": 1764997877.316107
}