{
  "game_id": "0021800200",
  "espn_id": "401070881",
  "date": "Nov 13, 2018",
  "matchup": "HOU @ DEN",
  "headline": "Harden scores 22 points, Rockets beat Nuggets 109-99",
  "body": "DENVER --  James Harden turned a slow start into a powerful finish.\n\nHarden scored 19 of his 22 points in the second half and the Houston Rockets pulled away to beat Denver 109-99 on Tuesday night, sending the Nuggets to a fourth straight loss.\n\nHarden also had 11 assists, with several going to Clint Capela, who led the Rockets with 24 points, including a series of dunks.\n\n\"I just take what the defense gives me,\" Harden said. \"I trusted the guys to make the right passes. Our bigs did a great job of finding those passing pockets. It requires patience, especially as a playmaker.\n\n\"It's going to take time, but we're getting there. If we keep guarding and defending at a high level our offense will come around. Once we put both together, it's going to get scary.\"\n\nChris Paul added 21 points for Houston, playing a third straight game without Carmelo Anthony because of what the team said was an illness.\n\nHouston, which had an NBA-high 65 wins last season, has won five of seven games since a 1-5 start.\n\n\"It's starting to roll a little bit better,\" Houston coach Mike D'Antoni said.\n\nMonte Morris had 19 points for the Nuggets, who have lost their last eight meetings with Houston. Gary Harris and Jamal Murray added 15 points apiece.\n\nA step-back shot by Murray got Denver within four points midway through the fourth quarter but Harden went on a tear, scoring 11 straight Houston points to put the Rockets up 104-91 with 3:48 remaining.\n\nMurray said trying to slow down Harden is tough, not only because of his skill level as a former league MVP but because of the because of the players surrounding him.\n\n\"They've got shooters all around,\" Murray said. \"They've got a great team. He's surrounded by players you have to guard as well, not just James Harden, so it gives him a lot of space to operate in and he did that tonight.\"\n\nThe Nuggets closed the gap to six points in the waning moments but the Rockets got a couple of free throws from Paul and a dunk from Capela to hold on.\n\n\"We got two really good wins (consecutively),\" Paul said. \"This was a good road win for us. They play well here at home. We'll take it. We're still just building.\"\n\nDown by a point at the break, the Rockets opened up an 86-76 lead going into the final quarter. After a pair of free throws by Paul Millsap pulled Denver to 74-72, the Rockets closed the final 4 1/2 minutes of the third period on a 12-4 run capped by Eric Gordon's driving layup.\n\nMurray hit a jumper in the final seconds of the second quarter to give the Nuggets a 55-54 halftime lead.\n\nTIP-INS\n\nRockets: G/F Gerald Green missed a second game due to a right ankle sprain, but is nearing a return. Green could be available to play as soon as their next game on Thursday night, according to D'Antoni. ... C Nene remains sidelined by a right calf strain that has forced him to miss the past 12 games.\n\nNuggets: The loss was the first by double digits this season. ... F Juancho Hernangomez was in the starting lineup for a second straight game. Hernangomez was inserted into the lineup as part of the Nuggets' search for a replacement for injured Will Barton, who remains sidelined indefinitely with a hip injury.\n\nUP NEXT\n\nRockets: Host the Golden State Warriors on Thursday night.\n\nNuggets: Host Atlanta on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995317.900464
}