{
  "game_id": "0022200874",
  "espn_id": "401469029",
  "date": "Feb 15, 2023",
  "matchup": "CHI @ IND",
  "headline": "Hield helps Pacers rally from 24 down to beat Bulls 117-113",
  "body": "INDIANAPOLIS -- — Buddy Hield made six 3-pointers in the second half and finished with 27 points, helping the Indiana Pacers rally from a 24-point deficit after the first quarter and defeat the Chicago Bulls 117-113 on Wednesday night.\n\n\r\n              Hield broke Reggie Miller's single-season franchise record for 3-pointers on his final 3 — his 230th — with 22 games remaining.\n\n\r\n              “It's the new NBA. You shoot 3s and I shoot 3s at a high level,” said Hield, the NBA leader. “Passing a legend like Reggie in Indiana is a testament to hard work and my teammates finding me in the right spots.\"\n\n\r\n              Tyrese Haliburton banked in a 9-foot shot for a 113-112 lead in the final minute, Myles Turner sank two free throws and Hield closed it out with a pair of foul shots with 7.1 seconds remaining as the Pacers snapped a five-game skid.\n\n\r\n              “The pattern in a lot of NBA games is you get hit in the face and then you fight back,” Pacers coach Rick Carlisle said. “Fighting back is a tough way to consistently win in this league.”\n\n\r\n              The Pacers, down 39-15 after the first quarter, have trailed by double digits in the opening quarter of 24 games.\n\n\r\n              “We don't want to be coming back all the time,” Hield said. “It's annoying.”\n\n\r\n              Aaron Nesmith scored 21 points for Indiana, which had lost 16 of 18. Turner added 17, Haliburton 16 and Bennedict Mathurin 14.\n\n\r\n              “We were dangerously close in the first quarter to being booed by the greatest fans in the NBA,” Carlisle said. “We responded.”\n\n\r\n              The Bulls' Zach LaVine scored 35 points, including 12 in the opening quarter. \n\n\r\n              “This has happened a lot to us,” Bulls coach Billy Donovan said. “We compete pretty hard, but what happens is the game gets ratcheted up — physically, mentally, emotionally. You've got to be able to come down on both ends of the floor and be incredibly detailed and focused. You have to execute.”\n\n\r\n              James White had 25 and Nikola Vucevic added 19 — but with just seven rebounds as his league-best streak of double-doubles ended at nine games as the Bulls dropped their fifth straight.\n\n\r\n              “The game is not won in the first five minutes,” Donovan said. “You've got to play your way through.”\n\n\r\n              TIP-INS\n\n\r\n              Bulls: Had beaten the Pacers in four of five meetings. ... Had averaged just 93.5 points in the previous four losses.\n\n\r\n              Pacers: Eighth-year pro T.J. McConnell made his sixth start while replacing rookie Andrew Nembhard in the backcourt. McConnell had seven assists, but just two points on free throws.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Milwaukee Bucks on Thursday night.\n\n\r\n              Pacers: Host Boston Celtics on Feb. 23.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994479.220366
}