{
  "game_id": "0022300954",
  "espn_id": "401585582",
  "date": "Mar 13, 2024",
  "matchup": "LAL @ SAC",
  "headline": "Sabonis has triple-double as Kings beat Lakers 120-107 for 4-game season sweep",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had 17 points, 19 rebounds and 10 assists, and the Sacramento Kings beat the Los Angeles Lakers 120-107 on Wednesday night.\n\n\r\n              The Kings have won seven of their last eight games against the Lakers, including a four-game sweep this season. Harrison Barnes made seven 3-pointers and scored 23 points, De’Aaron Fox added 21 and Keegan Murray had 19 as all five starters for the Kings scored in double figures.\n\n\r\n              Sabonis' triple-double was his league-leading 23rd, with his last one coming in the Kings’ victory at the Lakers last week. Kings coach Mike Brown called the feat “the norm” for his center, who went toe-to-toe with the Lakers' Anthony Davis.\n\n\r\n              “Heck of a game by him versus a very, very physical team,” Brown said. “He was getting hit, bump and all that stuff and he just stayed in there.”\n\n\r\n              Austin Reaves led the Lakers with 28 points. Davis added 22 points and 10 rebounds, and LeBron James had 18 points and 13 boards.\n\n\r\n              Both teams are fighting for playoff position, with the Kings pulling even with Phoenix for sixth place in the Western Conference, three games ahead of the ninth-place Lakers.\n\n\r\n              Sacramento pulled away in the third quarter after a close first half, starting the quarter on a 10-2 run to open a double-digit lead and holding Los Angeles to four field goals in the frame. Fox’s consecutive baskets to end the third gave the Kings a 15-point lead.\n\n\r\n              “Especially in this league, being a team that can come out of halftime and be a great third quarter team is huge for anybody,” Fox said. “Because you can be up or down and you can extend the lead or bring the lead back coming out of the half.”\n\n\r\n              The Lakers cut the deficit to single digits early in the fourth, but Barnes and Malik Monk answered with consecutive 3-pointers to give the Kings a comfortable cushion again. \n\n\r\n              Lakers coach Darvin Ham said that his players didn't do the little things. \n\n\r\n              “Can’t skip details,” Ham said. “We had some guys who didn’t shoot the ball well, got great looks they usually make. But just in the sense of team basketball, just continuing to have a next play mentality.”\n\n\r\n              Sacramento led 60-56 at halftime, paced by 14 points and four 3-pointers from Murray. Brown credited the Kings' defense getting eight consecutive stops at the end of the first half and beginning of the second half that allowed them to build the lead.\n\n\r\n              “When we’re getting eight stops in a row throughout the course of the ballgame versus any team, there's a chance we can blow that thing open,” Brown said.\n\n\r\n              The Kings, who were without Kevin Huerter (right leg contusion) and Trey Lyles (left knee sprain), still won their second straight game in convincing fashion over another playoff team after blowing out Milwaukee at home on Tuesday. Barnes hopes the effort will carry over against other teams.\n\n\r\n              “I don’t think we have a problem as a team getting up for big games,” Barnes said. “I don’t think that’s been our Achilles heel at all … We’re able to respond and get up for those games. Now, can we just maintain that consistency and that same focus throughout the rest of the league?”\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host Golden State on Saturday.\n\n\r\n              Kings: Host New York on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995491.0234509
}