{
  "game_id": "0022201137",
  "espn_id": "401469292",
  "date": "Mar 29, 2023",
  "matchup": "BKN vs. HOU",
  "headline": "Cam Johnson, Mikal Bridges carry Nets past Rockets, 123-114",
  "body": "NEW YORK -- — Cam Johnson had 31 points, Mikal Bridges scored 12 of his 27 in the fourth quarter and the Brooklyn Nets rallied to beat the Houston Rockets 123-114 on Wednesday night.\n\n\r\n              Johnson and Bridges came over together from Phoenix in the trade that sent Kevin Durant to the Suns. Durant finally made his home debut for Phoenix on Wednesday night.\n\n\r\n              Nic Claxton added 18 points and 10 rebounds for Brooklyn, and Spencer Dinwiddie had 20 points and 11 assists. The Nets had 33 assists on 44 baskets and won for the second time in three games to snap a four-game home losing streak. The victory, coupled with the Miami Heat’s loss to the Knicks at Madison Square Garden, boosted the Nets' lead to 1 1./2 games over Miami for the No. 6 spot in the East.\n\n\r\n              “We (have) six games left, They’re all super-important for us,” Johnson said. “There’s no excuse for how we played the first 40 minutes of the game, but we were able to clean it up and come out of it with a win.”\n\n\r\n              Kevin Porter Jr. had 31 points, nine rebounds and six assists for Houston, and Alperen Sengun had 21 points and 12 rebounds. The Rockets have lost seven in a row.\n\n\r\n              “After being on the road for nine days, for them to come out and show the grit and fight they did, that shows the character of this group,” Rockets coach Stephen Silas said. “It shows they’re still competing, they’re still fighting, they’re still trying to do what’s right.”\n\n\r\n              Houston outrebounded Brooklyn 52-41 and was on the verge of dealing the Nets a blow to their playoff chances with a 110-105 lead with 3:05 left.\n\n\r\n              ”(Porter) was making plays for himself, making plays for his teammates,” Silas said. “Him and (Sengun) had a real connection going. I thought (Sengun) was great on the offensive glass.”\n\n\r\n              But Brooklyn roared back with an 11-0 run and closed the game by outscoring the Rockets 18-4. Brooklyn made nine fourth-quarter 3-pointers, with Johnson and forward Royce O’Neale each knocking down three and Bridges hitting two from deep.\n\n\r\n              “We feed off each other, we feed off the crowd,” O’Neale said. “We trust each other to keep knocking them down.”\n\n\r\n              “We made shots, and it gave us a little bit of steam, a little bit of momentum,” Johnson said.\n\n\r\n              TIP INS \n\n\r\n              Rockets: Forward Jae’Sean Tate (knee) missed his sixth straight game.\n\n\r\n              Nets: Guards Edmond Sumner (right hip contusion) and Seth Curry (personal) and O’Neale returned to the lineup after missing the previous game in Orlando. Curry also missed Brooklyn’s victory Saturday in Miami.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host Detroit on Friday night.\n\n\r\n              Nets: Host Atlanta on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994848.0290291
}