{
  "game_id": "401809789",
  "espn_id": "401809789",
  "date": "Nov 14, 2025",
  "matchup": "SA vs GS",
  "headline": "Curry scores season-high 49 points as Warriors beat Wembanyama, Spurs 109-108 in NBA Cup",
  "body": "SAN ANTONIO -- — Stephen Curry had 49 points, outdueling Victor Wembanyama in another intense battle and the Golden State Warriors rallied to beat the San Antonio Spurs 109-108 on Friday night for their first win in the NBA Cup.\n\n\r\n              Wembanyama had 26 points, 12 rebounds, four assists and three blocks in 38 minutes but San Antonio fell to 1-1 in the NBA Cup.\n\n\r\n              Curry had 31 points in the second half, including a pair of free throws with six seconds left that proved the difference. He was 16 for 26 from the field and 9 for 17 on 3-pointers in his highest-scoring game of the season. \n\n\r\n              Curry tied Hall of Famer Michael Jordan for the most 40-point games after 30 years old in league history with 44.\n\n\r\n              The Warriors swept the two-game set in San Antonio, rallying in the fourth quarter to win both games.\n\n\r\n              Golden State coach Steve Kerr said playing back-to-back games in San Antonio gave the game had a playoff feel and it played out like one.\n\n\r\n              Officials had to separate Draymond Green and Wembanyama three times as they muscled for position on an inbounds play four minutes in the fourth quarter. Wembanyama would dunk on Green on an inbounds alley-oop but officials waved off the basket because Green fouled the Spurs' center prior to the attempt. Green collected his fifth foul seconds later on the next inbounds, storming off the court and screaming at officials over the whistle. \n\n\r\n              Wembanyama blocked Jimmy Butler's layup attempt with 33 seconds remaining and the Spurs leading 108-107. San Antonio failed to capitalize offensively as De'Aaron Fox missed a 17 footer with 12 seconds remaining. \n\n\r\n              Curry was fouled by Fox on the ensuing possession and calmly drained both free throws to put the Warriors ahead by one point. Fox missed an 18-foot jumper as time expired.\n\n\r\n              Fox finished with 24 points and 10 assists and Julian Champagnie added 14 points.\n\n\r\n              Butler added 21 points and Brandin Podziemski and Will Richard added 10 each for Golden State.\n\n\r\n              Up next\r\n              Warriors play Sunday at New Orleans.\n\n\r\n              Spurs host Sacramento on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042628.466754
}