{
  "game_id": "0022200015",
  "espn_id": "401468170",
  "date": "Oct 20, 2022",
  "matchup": "MIL @ PHI",
  "headline": "Giannis scores 21, Matthews' 3 sends Bucks past 76ers 90-88",
  "body": "PHILADELPHIA -- — Giannis Antetokounmpo tried to explain his early hot streak from the floor when — hey, wait a minute! — he saw himself in a commercial on a muted TV. Antetokounmpo interrupted his thought and praised actor Simu Liu and said he had a “kind heart.”\n\n\r\n              Antetokounmpo smiled as the spot ended and said of Liu, “That's my guy.”\n\n\r\n              The Greek Freak can credit his Milwaukee co-stars for some plays worthy of the highlight reel, as well.\n\n\r\n              Wesley Matthews hit the go-ahead 3-pointer with 23.8 seconds left, and Antetokounmpo had 21 points and 13 rebounds to lead the Bucks to a 90-88 victory over the Philadelphia 76ers on Thursday night.\n\n\r\n              “If the ball gets in Wes’ hands, you’re pretty freaking confident the ball is going in,” Brook Lopez said.\n\n\r\n              Lopez scored 17 points as the Bucks, who went 0-5 in the preseason, won their season opener after Matthews surprised the Sixers on the long 3. James Harden, who scored 31 and rallied the Sixers in the fourth, missed a jumper that could have won the game.\n\n\r\n              “It was a good look, it wasn’t a great look,\" Harden said.\n\n\r\n              Matthews, starting his 14th NBA season, hit two 3s and scored eight points, including the winner off a kick-out pass from Grayson Allen.\n\n\r\n              “It was a great decision and Wes was able to knock down the shot,” Antetokounmpo said.\n\n\r\n              The 76ers lost their opener Tuesday night in Boston and had another weak defensive effort early that had the Philly crowd booing them off the court in the third quarter. \n\n\r\n              Tyrese Maxey added 15 points for the Sixers. Joel Embiid was shut down by Lopez and Antetokounmpo and did not score in the second half. Embiid, who declined to talk to the media, finished with 15 points and 12 rebounds. \n\n\r\n              “It's tough. He's such a load,” Lopez said. \"You've got to try and keep him off his spot as much as possible. But pretty much every place on the floor is his spot.\"\n\n\r\n              Embiid, who had offseason surgery to repair a torn ligament in his right thumb, had another four turnovers. He had six against the Celtics. \n\n\r\n              “It does affect you for a long time, especially if he gets hit,” coach Doc Rivers said. “Those are still raw moves. As a big, I’m assuming he gets hit every game. You’re not injured, it’s just painful.” \n\n\r\n              Harden finally got the Sixers rolling in the fourth when he scored eight straight points and cut a 12-point deficit to single digits. Trying to bulk up the defensive lineup with toughness, Rivers turned to Harden, Tobias Harris, P.J Tucker, De’Anthony Melton and Daniel House Jr. \n\n\r\n              The 76ers forced shot clock turnovers and forced the Bucks out of bounds. Tucker stole the ball and hit Harden for the layup that made it 80-all with 6:41 left. Harden, whose nagging hamstring injuries from last season seem behind him, had a bucket that capped a 13-0 run, all done with Embiid on the bench. \n\n\r\n              “He's a special player, a special scorer,” coach Mike Budenholzer said.\n\n\r\n              Antetokounmpo snapped the tie when he pushed through for Milwaukee’s first basket in more than four minutes. \n\n\r\n              TIP-INS\n\n\r\n              Bucks: Budenholzer used a walking cane before the game and hobbled in a walking boot during the game following surgery on his right ankle. ... Rivers said Bucks guard Jrue Holiday reminded him of former 76ers point guard Mo Cheeks, whose No. 10 is retired by the team. Holiday, who started his career with the Sixers, missed 13 of 15 shots. “I don’t think he gets enough recognition,” Rivers said. “I don’t know another guard that is a better defensive player than him. I would not want to see him every night.”\n\n\r\n              76ers: Fanatics founder Michael Rubin sold his stake in the company that owns the Philadelphia 76ers and New Jersey Devils to David Adelman. Adelman is the third-largest shareholder behind owners Josh Harris and David Blitzer. \n\n\r\n              UP NEXT\n\n\r\n              Bucks: Play their home opener Saturday against Houston.\n\n\r\n              76ers: Trust the Process! Long-time coach Brett Brown, who shepherded the Sixers' rebuilding process that brought them Embiid, returns Saturday as an assistant coach for the San Antonio Spurs. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994612.737762
}