{
  "game_id": "0022400721",
  "espn_id": "401705287",
  "date": "Feb 05, 2025",
  "matchup": "PHI vs. MIA",
  "headline": "Tyler Herro scores 30 as Heat defeat 76ers 108-101",
  "body": "PHILADELPHIA -- — Tyler Herro scored 30 points Wednesday, and Bam Adebayo had 18 points and 13 rebounds as the Miami Heat defeated the Philadelphia 76ers, 108-101, on the night the Heat traded Jimmy Butler to Golden State.\n\n\r\n              The game played out amid online reports in the first half that Butler would be traded to the Warriors. Butler was suspended by the team for the game, and Josh Richardson, also reportedly part of the deal, was out with a foot injury.\n\n\r\n              Tyrese Maxey scored 31, his seventh straight scoring at least 30 points. Kelly Oubre Jr. added 15 points and 11 rebounds. The 76ers forced 22 turnovers but couldn’t capitalize on them.\n\n\r\n              Takeaways\r\n              Heat: Miami formally start the post-Butler era with plenty of contributions from more than just their All-Star Herro. Nikola Jovic scored 23 points off the bench, and Terry Rozier added 20. The Heat held a 57-29 edge in bench scoring.\n\n\r\n              76ers: Philadelphia played without Joel Embiid, due to load management on his left knee. Embiid had a triple-double Tuesday in a win over Dallas, returning after 15 games out. Paul George returned after a five-game absence for a left pinkie injury but struggled offensively, shooting 3-for-11 from the field for nine points.\n\n\r\n              Key moment\r\n              The 76ers led 55-52 late in the second quarter before a 10-0 run by the Heat, with Jovic providing six points. The Heat led by five at halftime and never trailed in the second half.\n\n\r\n              Key stat\r\n              The 76ers entered as the NBA’s top 3-point shooting team over the last nine games at 40.3%. They started 0-for-6 from range against Miami on the way to 12 for 40 (30%).\n\n\r\n              Up next\r\n              The Heat wrap up a four-game trip in Brooklyn on Friday. The 76ers visit Detroit on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998213.409492
}