{
  "game_id": "0021900360",
  "espn_id": "401161002",
  "date": "Dec 11, 2019",
  "matchup": "CHA @ BKN",
  "headline": "Graham scores 40, Hornets rally to beat Nets 113-108",
  "body": "NEW YORK --  Devonte' Graham was having the best night of his career, making it easy for his coach to call plays.\n\n\"That's just good coaching, right? Brilliant, right? Find Devonte' Graham,\" Hornets coach James Borrego joked. \"I learned from Pop (Gregg Popovich) that's a good move. He was rolling.\"\n\nGraham scored a career-high 40 points, and the Charlotte Hornets rallied from a 20-point deficit to beat the Brooklyn Nets 113-108 on Wednesday night.\n\n\"I just want to win, that's what I'm thinking,\" Graham said of his mindset down the stretch. \"Make a play.\"\n\nGraham had 27 points in the second half in Charlotte's second straight victory. Miles Bridges added 14 points.\n\n\"It's a mindset as a group,\" Graham said of Charlotte's comeback. \"All of us young guys all come from winning programs, so we know what it's like when you've got a target on your back in college and every team is coming for you and you've got to play every night as hard as you can.\"\n\nSpencer Dinwiddie had 24 points and Jarrett Allen added 21 points and 10 rebounds for Brooklyn, who had their three-game winning streak snapped.\n\nGraham hit a step-back jumper followed by a deep 3-pointer to give Charlotte a 111-106 lead with 22 seconds remaining.\n\n\"When he has big nights, they have a chance to win,\" Dinwiddie said. \"When he doesn't, they're kind of dead in the water.\"\n\nDinwiddie cut the lead to 111-108 by hitting two of three free throws with 18 seconds left, but Bridges made a free throw and the Nets misfired on two 3-point attempts on their next possession.\n\nIn the third quarter, Charlotte went on a 21-7 run to cut the deficit to 84-81. Graham led the comeback with 10 points during the run. The Hornets entered the fourth quarter trailing 86-84.\n\n\"I guess we could have double-teamed him,\" Nets coach Kenny Atkinson said. \"We could have blitzed him. We did change our pick-and-roll coverage a bunch of times. That didn't seem to help. You call all-out double-team him. We could have done that. Didn't do it. Looking back, maybe should have done it.\"\n\nThe Nets took a 64-53 lead into the half as Allen led all scorers with 16 points. Graham had 13 for Charlotte, which shot 38% from the field in the first half. Brooklyn took it's largest lead at 52-32 during the quarter.\n\nBrooklyn took a 34-26 lead after the first quarter while shooting 57% from the floor as Allen led the Nets with 11 points. Charlotte's backcourt of Graham and Terry Rozier each had seven.\n\nTIP-INS\n\nHornets: Coach James Borrego praised Allen's development. \"He looks to me like a smarter and more active defender this season,\" Borrego said. . Nicolas Batum (left hand) and Marvin Williams (right knee) were both out.\n\nNets: Kyrie Irving (shoulder impingement) missed his 13th straight game. Caris LeVert (right thumb surgery) missed his 15th straight game. LeVert, who underwent right thumb surgery on Nov. 14, is on track to return from his original 4-6 week timeline, coach Kenny Atkinson said.\n\nDINWIDDIE STAYS HOT\n\nDinwiddie has registered 20 or points 11 times in his last 13 games.\n\nUP NEXT\n\nHornets: Visit Chicago on Friday night.\n\nNets: Visit Toronto on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996087.019655
}