{
  "game_id": "0022400945",
  "espn_id": "401705511",
  "date": "Mar 12, 2025",
  "matchup": "CHA @ ATL",
  "headline": "Trae Young makes all 21 free throws and scores 35 points in Hawks' 123-110 win over Hornets",
  "body": "ATLANTA -- — Trae Young made all of his 21 free throws and scored 35 points to lead the Atlanta Hawks to their fourth straight victory, 123-110 over the Charlotte Hornets on Wednesday night.\n\n\r\n              Young became the sixth player in NBA history to make 21 or more free throws without a miss, and he also had 12 assists on a poor shooting night from the field. He was 7 of 20 and missed all five of his 3-point attempts.\n\n\r\n              The Hawks are seventh in the Eastern Conference and moved within five games of idle sixth-place Detroit as they seek to avoid the play-in tournament.\n\n\r\n              Miles Bridges had 31 points and 11 rebounds, and LaMelo Ball added 25 points and nine assists for the Hornets, who are second-to-last in the East. DaQuan Jeffries contributed 20 points and Mark Williams had 14 points and 14 rebounds.\n\n\r\n              Takeaways\r\n              Hornets: Lottery-bound Charlotte entered having won two straight after a nine-game skid.\n\n\r\n              Hawks: Caris LeVert scored 15 points, Georges Niang had 12, Vit Krejci 11 and Terance Mann 10 on a strong night for Atlanta's second unit.\n\n\r\n              Key moment\r\n              Onyeka Okongwu made a layup for the Hawks with 10.6 seconds left before halftime for a 52-49 lead. That basket ended up as the start of a 13-0 run that included a jumper by Young and 3-pointers by Zaccharie Risacher and Mouhamed Gueye. Young went on to score 17 points in the third quarter.\n\n\r\n              Key stat\r\n              Atlanta's bench outscored Charlotte's 57-18.\n\n\r\n              Up next\r\n              Hornets: At San Antonio on Friday night.\n\n\r\n              Hawks: Host the Los Angeles Clippers on Friday night.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997433.162102
}