{
  "game_id": "0021600776",
  "espn_id": "400900181",
  "date": "Feb 06, 2017",
  "matchup": "DAL @ DEN",
  "headline": "Barton scores 31 in Nuggets' 110-87 win over Mavericks",
  "body": "DENVER --  Will Barton turned a spot start into his biggest game of the season.\n\nBarton scored a season-high 31 points, connecting on five 3-pointers, and the Denver Nuggets overcame the absence of three starters to beat the Dallas Mavericks 110-87 on Monday night.\n\nGary Harris added 20 points and Wilson Chandler had 14 points and 10 rebounds for the Nuggets, who were without forward Danilo Gallinari because of a left groin strain and guard Emmanuel Mudiay due to a recurrence of a lower back injury. Also missing the game was forward Kenneth Faried, who was excused to tend to personal matters.\n\n\"Tonight, I was given a bigger opportunity and a bigger role and, you know, just rose to the moment,\" Barton said. \"We had some guys down. I just wanted to come out and make plays for my teammates.\"\n\nHarris said he and the rest of the Nuggets fed off Barton's aggressive play on both ends of the floor.\n\n\"He just gives us energy and we all started playing with energy,\" Harris said.\n\nDallas, which was also short-handed, was led by Seth Curry and Yogi Ferrell. They had 15 points apiece, but the loss ended a four-game winning streak for the Mavericks.\n\n\"Credit them but we weren't as aggressive as we needed to be on the defensive end,\" Wesley Matthews said. \"We didn't attack this game as we should have.\"\n\nTrailing by as many as 27 early in the third quarter, the Mavericks closed the period with an 18-6 spurt and pulled to 82-67 going into the fourth. Matthews and Curry both hit 3-pointers in the run.\n\nThe Mavericks cut the deficit to 13 with just under six minutes remaining, but Denver responded with a 7-0 burst capped by Chandler's reverse layup with 3:30 left to rebuild a 20-point cushion. The Mavericks did not threaten again.\n\nDallas had plenty of ground to make up after being outscored 30-13 in the second quarter as Denver opened a 59-37 halftime lead. Barton was at the center of the Nuggets' strong early showing, scoring 19 points in the first half, including a trio of 3-pointers.\n\n\"We didn't have anyone to stop him,\" Dallas coach Rick Carlisle said. \"We did a decent job at the beginning of the game and then he just started to get going. He got going on our bench guys. He had a good night and we didn't do anything to stop him.\"\n\nTIP-INS\n\nMavericks: G Deron Williams missed a sixth consecutive game since injuring his left big toe but could be getting closer to a return. Carlisle said he is hopeful Williams could return \"sometime soon. He has a thing with his toe that is an unusual injury because you can play with it, but it's extremely painful. So it's going to be managing comfort and trying to work through it.\" ... C Andrew Bogut remains sidelined because of a right hamstring strain.\n\nNuggets: Gallinari missed his third straight game since injuring his groin. ... Mudiay has missed three of the past six games due to lower back issues. ... Barton scored a career-high 32 points against on New Orleans on Dec. 20, 2015.\n\nUP NEXT\n\nMavericks: Return home to host Portland on Tuesday.\n\nNuggets: Embark on a three-game road trip, making their first stop Wednesday night in Atlanta.",
  "source": "espn_api",
  "crawled_at": 1764996121.230874
}