{
  "game_id": "0022400636",
  "espn_id": "401705202",
  "date": "Jan 25, 2025",
  "matchup": "BKN vs. MIA",
  "headline": "Herro, Adebayo lead Heat past Nets 106-97 on Vince Carter's jersey retirement night",
  "body": "NEW YORK -- — Tyler Herro scored 25 points, Bam Adebayo had 17 points and 16 rebounds, and the Miami Heat beat the Brooklyn Nets 106-97 on Saturday night.\n\n\r\n              Nikola Jovic had 17 points, six rebounds and four assists, and Duncan Robinson had 15 points and seven rebounds for the Heat (22-22), who snapped their two-game losing streak and won for just the second time in the past six games.\n\n\r\n              D’Angelo Russell had 22 points and six assists, Keon Johnson scored 22 points and Jalen Wilson had 12 points, nine rebounds and eight assists. Brooklyn (14-32) lost its sixth straight and for the 22nd time in its past 27 games.\n\n\r\n              Takeaways\r\n              Miami: Miami won despite committing 22 turnovers by shooting 13 for 28 from 3-point range (46.4%). The Heat surpassed 45% on 3-pointers in a game for just the third time in their past 23 games.\n\n\r\n              Brooklyn: On the night they raised Vince Carter’s No. 15 to the rafters, the Nets again were competitive for spurts despite shooting 37.5% from the field and 14 for 40 from 3-point range (35%).\n\n\r\n              Key moment\r\n              After trailing by four at halftime, and as many as 11 in the first half, Brooklyn pulled even at 61 midway through the third quarter, keyed by Russell’s two 3-pointers. But the Heat responded with an immediate 7-0 run then closed the quarter by outscoring the Nets 21-7, while shooting 4 for 6 from 3-point range in the period.\n\n\r\n              Key stat\r\n              The Nets have lost 10 straight home games. Brooklyn has not won at Barclays Center since its 99-90 win over the Indiana Pacers on Dec. 4.\n\n\r\n              Up next\r\n              Miami hosts Orlando on Monday and Brooklyn hosts Sacramento on Monday.\n\n\r\n              ------\n\n\r\n              This version corrects that Adebayo had 16 rebounds. A previous version stated he had 15.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997980.946615
}