{
  "game_id": "0022300055",
  "espn_id": "401584143",
  "date": "Nov 28, 2023",
  "matchup": "ATL @ CLE",
  "headline": "Mitchell scores 40 as Cavaliers beat Hawks 128-105, but don't advance in NBA In-Season Tournament",
  "body": "CLEVELAND -- — Donovan Mitchell and the Cavaliers did everything in their power to stay in the NBA In-Season Tournament.\n\n\r\n              Once again, the New York Knicks did more.\n\n\r\n              Mitchell scored 40 points, Evan Mobley added 17, a career-high 19 rebounds and seven blocks as Cleveland completed pool play in the inaugural tourney with a 128-105 win over the Atlanta Hawks on Tuesday night.\n\n\r\n              The Cavs finished 3-1 and in second place in East Group A. They had to win to have any chance of capturing a wild-card entry and getting in the eight-team knockout round, but needed four other teams to lose and ultimately fell short of advancing by point differential.\n\n\r\n              They were edged out by the Knicks, who also eliminated the Cavs in the playoffs last season. New York beat Charlotte 115-91 to get a wild-card spot.\n\n\r\n              “You want to win a championship and make the extra bread,” said Mitchell. \"But you look at the little things we’ve done over the last couple days and that’s what we want to continue to build on. We didn’t get this championship, so let’s go focus on the next one.”\n\n\r\n              Although their shot at the tournament title fell short, the Cavs are getting healthy and Mitchell had his best performance (14 of 25, 11 rebounds) in weeks and did it in a meaningful game — by regular-season standards.\n\n\r\n              Cleveland's Darius Garland added 19 points and the Cavs contained the high-scoring Hawks, who scored 152 in a loss last week.\n\n\r\n              \"The biggest thing was defensively setting the tone against a team that can get going,” Mitchell said. “Especially these last few games, they’ve put up 140, 150 whatever.”\n\n\r\n              De'Andre Hunter scored 18 for the Hawks, who went 1/3 in the tourney. Trae Young added 13 on just 3-of-14 shooting and had 10 assists. Hunter stayed in despite dislocating his right pinky for the second time this season.\n\n\r\n              Mitchell came in just 8 of 35 from the floor in his last two games after missing four straight with a strained hamstring.\n\n\r\n              He started slowly again before hitting a 3-pointer from 41 feet at the buzzer to end the first quarter. Although the basket got waved off, the shot seemed to spark Mitchell, who scored 10 in the second to help the Cavs erase a 12-point deficit.\n\n\r\n              With his team down by 20, Atlanta coach Quin Snyder pulled his starters with 3:54 left. However, Cavs coach J.B. Bickerstaff stuck with his first team the rest of the way, hoping Cleveland could open an even bigger lead to advance.\n\n\r\n              As some of Cleveland's assistants monitored the out-of-town games from their seats, the Cavs didn't let up.\n\n\r\n              Mitchell admitted the final few moments were awkward.\n\n\r\n              “I feel like we were all trying to score, but also respect the game,” he said. \"So it’s different, especially when they took their starters out, you’re trying to balance it. But at the end of the day, you’re playing to win.\n\n\r\n              \"You’re playing to get to Vegas, get to the tournament. But it’s definitely a little weird.”\n\n\r\n              Snyder agreed the end-game situation was somewhat uncomfortable.\n\n\r\n              “To be honest, I try to focus on my team,” he said. \"I’m sure you can understand that. In that situation, it isn’t ideal.” \n\n\r\n              UP NEXT \n\n\r\n              Hawks: At San Antonio on Thursday.\n\n\r\n              Cavaliers: Host Portland on Thursday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996305.1880488
}