{
  "game_id": "0022200124",
  "espn_id": "401468279",
  "date": "Nov 04, 2022",
  "matchup": "CHI @ BOS",
  "headline": "Tatum scores 36, Celtics rally to hold off Bulls 123-119",
  "body": "BOSTON -- — Jayson Tatum had 36 points and 12 rebounds, including some late free throws to help the Boston Celtics hold on for a 123-119 victory over the Chicago Bulls on Friday night. \n\n\r\n              Malcolm Brogdon added 25 points on 9-of-10 shooting and Jaylen Brown scored 16 points for Boston, which has won two of three.\n\n\r\n              It was the eighth straight game this season that Tatum has scored 20 or more points. He also set new career highs for free throw attempts and makes, going 17 of 20. \n\n\r\n              But he said he was proudest of how they finished the game after failing to do so in two recent overtime losses to Cleveland. \n\n\r\n              “That's something that we've talked about a lot recently,” Tatum said. \"We've had some tough losses. ... That's the sign of good team and we talked about that at shoot around. And to go out and do it on the same night shows our growth.\"\n\n\r\n              DeMar DeRozan had a season-high 46 points for the Bulls. Nik Vucevic added 24 points and 12 rebounds and Zach LaVine finished with 16 points. Chicago was denied its first three-game winning streak of the season.\n\n\r\n              “I just felt like there was too many things we had control over that we needed to execute better and we didn't,” Bulls coach Billy Donovan said. “That hurt us tonight.”\n\n\r\n              Boston took a 93-87 lead into the fourth quarter and increased it to 105-91 with just over seven minutes to play.\n\n\r\n              A 3-pointer by Vucevic capped a 12-4 run to help the Bulls cut their deficit to 109-103.\n\n\r\n              Brogdon scored on a driving layup, was fouled and completed the three-point play to briefly give the Celtics some breathing room.\n\n\r\n              Chicago stayed close and another 3 by Vucevic trimmed it to 114-110, followed by a miss by Boston’s Al Horford.\n\n\r\n              DeRozan was fouled by Derrick White and hit two free throws. White made a 3 from the wing with 1:06 remaining on Boston's next possession.\n\n\r\n              Vucevic was good again from 3 on Chicago’s next trip to make it 117-115. Horford missed a corner 3, but Tatum pulled down the rebound and was fouled by LaVine. \n\n\r\n              Tatum made only one of his free throws, giving the ball back to Chicago. Tatum got a steal, but his outlet pass was picked off by LaVine. Patrick Williams misfired, it was gathered and tossed to Tatum, who was fouled.\n\n\r\n              This time he was good on both free throws and Boston closed it out at the foul line. \n\n\r\n              TIP-INS\n\n\r\n              Bulls: Reserve center Andre Drummond sat for the fourth straight game with a sprained right shoulder. ... Had 15 bench points after notching 49 in Wednesday’s win over Charlotte. ... Ayo Dosunmu finished with 11 points, going 5 of 8 from the field. He entered the night shooting 90% (27 of 30), including 10 of 10 from beyond the arc, in four previous games against the Celtics. ... Led 31-26 at the end of the first quarter.\n\n\r\n              Celtics: Led 63-57 at the half, outscoring the Bulls 37-26 in the second quarter. ... New England Patriots coach Bill Belichick sat with Celtics president of basketball operations Brad Stevens in his suite.\n\n\r\n              FRESH LEGS\n\n\r\n              Brogdon became the first Celtics guard to score 25 or more points on 90% shooting off the bench since the start of the 3-point era (1980). \n\n\r\n              Brogdon said playing a role in which he's not one of the top three scoring options has allowed him to have much fresher legs late in games. Having dynamic scorers like Tatum and Brown to distribute has also made those situations easier this season, he said. \n\n\r\n              “I'm comfortable finishing games. I've been doing it my whole career,” Brogdon said. \n\n\r\n              FAMILIAR BLUEPRINT\n\n\r\n              The Celtics ended Chicago’s recent clampdown on the defensive end and avoided becoming the third consecutive opponent the Bulls held below the century mark.\n\n\r\n              The Bulls dominated underneath the basket in their first meeting with the Celtics last month, holding a 12-point scoring edge in the paint on the way to a 20-point victory in Chicago. \n\n\r\n              Boston used much of the same blueprint Friday, outscoring Chicago 52-34 in the paint. The Celtics’ bench contributed 41 points.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Toronto on Sunday. \n\n\r\n              Celtics: At the New York Knicks on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994514.126873
}