{
  "game_id": "0021800547",
  "espn_id": "401071223",
  "date": "Dec 31, 2018",
  "matchup": "OKC vs. DAL",
  "headline": "Westbrook rebounds with triple-double as Thunder beat Mavs",
  "body": "OKLAHOMA CITY --  Russell Westbrook promised he'd be better on Monday night against the Dallas Mavericks, and he kept his word.\n\nWestbrook had 32 points, 11 rebounds and 11 assists for his 10th triple-double of the season and the Oklahoma City Thunder gained a split of their back-to-back against the Mavericks, never trailing in a 122-102 victory.\n\nPaul George added 22 points and Jerami Grant had 16 for the Thunder, who had dropped three of their last four games. That included a 105-103 loss at Dallas on Sunday, when Oklahoma City blew a six-point lead in the final 1:59 and Westbrook went 4 of 22 from the field and scored only nine points.\n\nWestbrook promised after that game, \"We play tomorrow and I'll be better from then on,\" and he responded by going 13 of 24 from the field and knocking down midrange shots with regularity -- often banking them in -- as the Thunder built a 60-43 halftime lead.\n\n\"If I'm in that area, I'm going to shoot that same shot,\" he said. \"Why do anything different? If they give you the same shot, then take it. Part of this game is keeping it simple. When you keep it simple, it makes the game easier for everybody else, not just myself. Keeping it simple is something I've tried to learn over the course of the years.\"\n\nDallas coach Rick Carlisle burned five of his seven timeouts in the first half in an effort to stem the tide, but the Mavericks proved unable to overcome a 1-for-9 start from the field. Dallas committed 29 turnovers, the most ever by a Thunder opponent.\n\n\"They had a lot to do with it, but we could do better,\" Carlisle said. \"We'll keep working at it. You can always find positives in games. . But right now we've got to fixate on taking better care of the ball.\"\n\nHarrison Barnes led Dallas with 25 points, matching his career high with seven 3-pointers in nine attempts, and Luca Doncic had 17 points. The Mavericks are 2-16 on the road, offsetting their 15-3 home record.\n\nAs the Mavericks were misfiring to start the game, George scored 16 points in the first quarter as Oklahoma City built a 17-point lead. The Thunder led by as many as 22 in the first half.\n\n\"We were on our heels early and never really got our bearings,\" Carlisle said. \"That kills you on the road.\"\n\nConsecutive 3-pointers by Dennis Smith Jr. and Doncic pulled Dallas within 69-57, but a bucket by George, a steal and layup by Westbrook and an alley-oop dunk by Grant off Westbrook's pass led Carlisle to burn his final timeout at the 6:45 mark of the third quarter, with his team down 75-57.\n\nDespite going 8 of 13 from 3-point range in the quarter, Dallas made no headway, trailing 92-75 at its end. Barnes hit two more 3-pointers to cut the margin to 94-81 with 10:59 left, but George scored and Abdel Nader followed with a 3-pointer to rebuild Oklahoma City's lead. Dallas came no closer than 14 points the rest of the way.\n\nTIP-INS:\n\nMavericks: F Wesley Matthews returned after missing two games with right foot soreness, but Dallas made F Dirk Nowitzki inactive, citing \"return from injury management\" after he played 10 minutes on Sunday night . The Mavericks were called for a technical foul with 6:43 left after Carlisle called a timeout Dallas did not have . Dallas went 14 of 38 from 3-point range.\n\nThunder: C Steven Adams had 12 points and 13 rebounds . Nerlens Noel scored 15 points in 15 minutes . Abrines sat out due to what the team called personal reasons .  G Terrance Ferguson started despite being listed as questionable with a stomach illness . The Thunder are 9-2 on New Year's Eve since the franchise moved to Oklahoma City . After playing Dallas on consecutive days, the Thunder won't see the Mavericks again until March 31.\n\nNADER TAKES ADVANTAGE\n\nPlaying time has been difficult to come by for Nader, but the absence of Alex Abrines in recent games has allowed Nader an opportunity for more minutes, and he's played well. He scored 18 points in 33 minutes in a win at Phoenix on Friday before scoring 10 on 4-of-6 shooting in his 12 1/2 minutes on Monday.\n\n\"One thing the coaching staff here preaches is you stay ready, never get ready,\" Nader said. \"I think I've done a good job of that all season long, so when my number is called, I don't miss a beat.\"\n\nGeorge said it's good to see teammates like Nader perform well when given the chance.\n\n\"The good thing about this group, when someone goes down, the next guy steps up and they're ready for that role,\" George said. \"We need all our guys. Our young guys are starting to step up for us.\"\n\nUP NEXT:\n\nMavericks: Visit Charlotte on Wednesday.\n\nThunder: At the Los Angeles Lakers on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994594.215898
}