{
  "game_id": "0021601107",
  "espn_id": "400900502",
  "date": "Mar 28, 2017",
  "matchup": "DET vs. MIA",
  "headline": "Whiteside's buzzer-beating tip-in lifts Heat past Pistons",
  "body": "AUBURN HILLS, Mich. --  Hassan Whiteside used his good hand to push the Miami Heat closer to a most unlikely playoff berth Tuesday night.\n\nWhiteside tipped in a shot with his left hand as time expired to lift the Heat over the Detroit Pistons 97-96.\n\nWhiteside, playing with a thick bandage on his right hand to protect 13 stitches he got a week ago, tipped in Goran Dragic's miss after a wild final play over the game's final 11.3 seconds. James Johnson took the initial shot for Miami, Dragic muscled the rebound off the rim and Whiteside elevated over Andre Drummond for the winning tip.\n\n\"I was like, `Whatever happens, I'm going to chase this rebound,\" Whiteside said. \"I just tried to get a hand on it anyway I could.\"\n\nThe win was huge for Miami (36-38), which moved one game ahead of No. 9 Chicago and 2 1/2 games ahead of No. 10 Detroit for the final playoff spot in the Eastern Conference.\n\n\"Our guys want this so bad,\" Heat coach Erik Spoelstra said.\n\nDragic scored 28 points and Whiteside finished with 17 points and nine rebounds for the Heat.\n\nKentavious Caldwell-Pope had 25 points and Tobias Harris and Ish Smith each scored 19 for the Pistons (34-41). Detroit lost its fifth straight and eighth in nine games.\n\n\"That one hurts,\" Smith said. \"It was a fun game to be a part of. Somebody had to lose it. I was hoping it wasn't going to be us, but it was. Kudos to them. They played hard. They played really hard.\"\n\nThe Pistons led 96-92 after Smith's jumper with 30 seconds left. Dragic hit a free throw after Detroit committed a sideline violation, then made a jumper to cut the deficit to one with 24 seconds left.\n\nMiami forced a jump ball on the next possession, which was won by Johnson. He advanced it to Dragic, who nearly lost it out of bounds. The final play went to Johnson, whose 14-footer from the right wing missed, before the Heat found a way in the final moment.\n\nJohnson threw Whiteside over his shoulder in celebration as Heat players sprinted off the bench to join in.\n\n\"Hassan, maybe for the first time in his career, he is playing more for the guys next to him than he is for himself,\" Spoelstra said.\n\nMiami wasted a 12-point second half lead and was up 78-69 going into the fourth quarter. Detroit's four-point lead in the final minute was the biggest edge the Pistons enjoyed all night, before the Heat scored the game's final five points.\n\n\"One tip away,\" Smith said.\n\nTIP-INS\n\nHeat: G Dion Waiters (left ankle) was out again, and there is still no timetable for his return. ... The Heat and Pistons split the season series at two games apiece. ... It was Miami's final trip to The Palace of Auburn Hills. ... After an 11-30 start, Miami has now won 25 of its last 33 games.\n\nPistons: PG Reggie Jackson (rest) was inactive for the second straight game. He also missed the team's loss at New York on Monday. He was replaced in the starting lineup by Smith before missing the past two games. Coach Stan Van Gundy said Jackson is day-to-day. ... G Reggie Bullock (right foot) did not play.\n\nCOMING UP CLUTCH\n\nWhiteside had a relatively quiet night before his heroics at the end. He shot 7 of 13 from the field and recorded one block. But his winning basket was all that mattered.\n\n\"He really cares about the guys in the locker room and that's one of the most powerful things I've seen as a coach,\" Spoelstra said. \"You could see him grimacing, but he was giving us whatever he could.\"\n\nUP NEXT\n\nHeat: At New York on Wednesday.\n\nPistons: Host Brooklyn on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764996024.655786
}