{
  "game_id": "0022200603",
  "espn_id": "401468758",
  "date": "Jan 08, 2023",
  "matchup": "PHX vs. CLE",
  "headline": "Garland, Mitchell lead Cavs past banged-up Suns 112-98",
  "body": "PHOENIX -- — Donovan Mitchell doesn't have to score 71 points in a game for the Cleveland Cavaliers to be at their best.\n\n\r\n              On Sunday night, he didn't even have to be on the floor.\n\n\r\n              Mitchell and Darius Garland both scored 22 points to lead the Cavaliers, but it was a few bench players who helped Cleveland pull away in the fourth quarter and beat the banged-up Phoenix Suns 112-98.\n\n\r\n              “It's one of the best things to see, because it's different guys from different areas,” said Mitchell, who scored 71 points in a win over the Bulls on Monday. “It's all defense. The effort, the intensity.”\n\n\r\n              The Cavaliers won for the fourth time in five games. It's the second time this week the Cavs have topped the Suns after beating them 90-88 on Wednesday.\n\n\r\n              Struggling Phoenix — playing without its All-Star backcourt of Chris Paul and Devin Booker — has dropped six in a row and nine of 10. The Suns now have a 20-21 record, which is the first time they have been under .500 all season.\n\n\r\n              The offensively challenged Suns failed to top 100 points for a fourth straight game.\n\n\r\n              “We just stayed the course as best we could, then we got into the fourth and we just didn’t have enough to withstand their defensive pressure,” Suns coach Monty Williams said. “They kept us on our heels.”\n\n\r\n              The Cavaliers had a comfortable lead for much of the game but the Suns cut their advantage to 80-79 lead heading into the final quarter. But a group of mostly reserves, led by Raul Neto and Lamar Stevens, helped Cleveland go on a 27-6 run to start the fourth and suck any drama out of the final minutes.\n\n\r\n              All five Cleveland starters scored in double figures along with Caris LeVert, who added 13 points off the bench.\n\n\r\n              Duane Washington led the Suns with 25 points off the bench. Mikal Bridges scored 15 and Deandre Ayton added 14. Ayton appeared to tweak his left ankle late in the game and gingerly walked off the court. He said it was probably a day-to-day injury.\n\n\r\n              “We just lost a little bit of focus tonight in that fourth quarter,\" Ayton said.\n\n\r\n              Cleveland used a 14-0 run to take a 35-26 lead by the end of the first quarter. The Cavs led 57-54 at the break after shooting 60% from the field.\n\n\r\n              MITCHELL BACK TO UTAH\n\n\r\n              Mitchell makes his return to Utah on Tuesday night.\n\n\r\n              He was a three-time All-Star for the Jazz during his five-year tenure that was fairly successful, but also filled with drama. Mitchell and All-Star teammate Rudy Gobert could never seem to completely mesh.\n\n\r\n              Mitchell said he wasn't sure how Utah's crowd will react for his return. He was traded to Cleveland in September for Lauri Markkanen, Collin Sexton, Ochai Agbaji and draft picks.\n\n\r\n              “We did a lot of great things there,” Mitchell said. \"Obviously, we didn't accomplish our end goal. I don't know what the response will be, I hope it's cheers. There were a lot of positives despite not winning a championship. That's not easy. Only one team does it. We had five cracks at it and we missed.\n\n\r\n              “At the end of the day, they're playing well. Lauri is playing out of his mind. They have a great group over there, great coaches. For me, we've just got to get another win on the road.”\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Mitchell returned to the lineup after missing Friday's game against the Nuggets. ... Garland was dealing with a sprained right thumb but still played. ,,, Shot 57.7% from the field.\n\n\r\n              Suns: Paul (hip), Booker (groin), Cameron Payne (foot) and forward Cam Johnson (knee) were out. ... Made 8 of 12 3-pointers (66.7%) in the first half. ... Hosted their 47th straight sellout crowd.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Utah on Tuesday.\n\n\r\n              Suns: At Golden State on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995079.665544
}