{
  "game_id": "0022000417",
  "espn_id": "401267577",
  "date": "Feb 14, 2021",
  "matchup": "PHX vs. ORL",
  "headline": "Booker, Suns roll to 6th straight win, beating Magic 109-90",
  "body": "PHOENIX -- — The Phoenix Suns were coming off impressive, hard-fought victories over two of the NBA's best teams. They've got another big game in a few days when the Nets come to town.\n\n\r\n                    That made a drama-free blowout over the Orlando Magic a welcome change Sunday night.\n\n\r\n                    Devin Booker scored 27 points, Mikal Bridges added 21 and the Suns cruised to their sixth straight victory, beating the short-handed Magic 109-90 in a game that was never particularly close.\n\n\r\n                    “We did what we had to do to win the game,” Suns coach Monty Williams said. “We’ve had some really emotional games in this building and to win the way we’ve won the past few games, we didn’t even want to talk about a letdown.”\n\n\r\n                    It's safe to say that wasn't a problem. The Suns never trailed and jumped out to a 14-2 lead after Orlando missed 12 of its first 13 shots.\n\n\r\n                    “We just wanted to push the tempo early and make them feel us,” Suns forward Jae Crowder said. \n\n\r\n                    It never got much better for the Magic, who had just eight players available because of injuries. Orlando has lost eight of its past 10 and fell to 10-18. The Suns improved to 17-9.\n\n\r\n                    Terrence Ross led the Magic with 23 points. Dwayne Bacon added 19 points, and Nikola Vucevic had 14 points and 10 rebounds.\n\n\r\n                    “We got off to a bad start and I thought, actually, in the first quarter in the beginning we had decent shots,” Magic coach Steve Clifford said. “We didn’t finish any of them so we played in a hole.”\n\n\r\n                    Booker scored 17 points in the first quarter on 8-of-10 shooting, including a 30-foot 3-pointer and a breakaway dunk, and the Suns took a 28-16 lead. They led by 23 in the second quarter before settling for a 52-35 advantage at the break.\n\n\r\n                    Phoenix scored the first six points of the second half and pushed ahead 80-55 after Crowder hit back-to-back 3-pointers. Crowder finished with 12 points and eight rebounds. Chris Paul added 12 points, nine assists and six rebounds.\n\n\r\n                    Orlando shot just 6 of 35 (17%) from 3-point range and was outrebounded 59-48. Ross said he's never been on a team that's dealing with so many injuries at the same time.\n\n\r\n                    “Everybody is kind of doing something different, playing outside our comfort zone,” Ross said. “It is part of the game I guess. That is where we are at right now.”\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Orlando's injury list was a long one: It included Al-Farouq Aminu (right knee), Cole Anthony (shoulder), James Ennis III (groin) and Evan Fournier (back spasms). ... Ross started a game for the first time in three seasons. He had come off the bench in 180 straight games. ... The Magic shot just 6 of 24 from the field in the first quarter. ... Mo Bamba finished with 11 rebounds. \n\n\r\n                    Suns: Booker is averaged 28.3 points and shooting 54.7% during the seven-game homestand that ends Tuesday. He shot 10 of 16 from the field against the Magic ... Deandre Ayton added 10 points and 13 rebounds. ... The Suns got 35 points from the bench and scored 46 points in the paint. ... Dario Saric scored seven points in 16 minutes in his second game back after missing 13 straight because of COVID-19 health and safety protocols and an ankle injury.\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Host New York on Wednesday night.\n\n\r\n                    Suns: Host Brooklyn on Tuesday night.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt on Twitter: www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997752.527946
}