{
  "game_id": "0021900391",
  "espn_id": "401161033",
  "date": "Dec 15, 2019",
  "matchup": "BKN vs. PHI",
  "headline": "Dinwiddie scores 24 points, Nets end Sixers' 5-game streak",
  "body": "NEW YORK --  Spencer Dinwiddie has been on the receiving end of some friendly banter from his Brooklyn teammates, especially Kyrie Irving, over not using his athleticism to rise above the rim.\n\nHe took the opportunity on Sunday night against the 76ers and former teammate Tobias Harris, scoring 24 points and riling up the Brooklyn bench with an impressive jam on an inbound pass from Garrett Temple, as the Nets went on to beat Philadelphia 109-89.\n\n\"We showed it again in the locker room in the end and they got a big kick out of that,\" Nets coach Kenny Atkinson said.\n\n\"I don't think people realize how good an athlete Spencer is. You could argue our best athlete. He's fast. He's got an incredible vertical. He's unbelievable. It doesn't surprise me. I wish he'd do it more.\"\n\nJoe Harris scored 16 points, DeAndre Jordan had 13 points and 11 rebounds and Temple finished with 13 points for the Nets, who ended a two-game skid.\n\nDinwiddie credited Temple's pass for his rim-shaking moment.\n\n\"Honestly it was a great pass by GT (Garrett Temple). I believe he threw it right over Tobias' ear,\" Dinwiddie said. \"I wouldn't have dunked it if they hadn't been calling fouls. So I was like, `Oh, OK, he's under the rim, he'll probably foul me.' But then I was like, `Man, I ain't gonna get no free throws out of this.\"\n\nWith All-Star center Joel Embiid sitting out with an upper respiratory illness, the 76ers did not have much of an answer for Dinwiddie and the Nets, who scored 64 points in paint.\n\nBen Simmons scored 20 points and Tobias Harris chipped in 17 for the Sixers, whose five-game winning streak ended.\n\n\"He's aggressive. He's very talented. He gets downhill, loves downhill,\" Simmons said of Dinwiddie. \"He just plays. He plays with the freedom. I love the way he plays, but he dominates.\"\n\nIt was the first regular-season meeting between the teams since last April, when Philadelphia eliminated Brooklyn from the first round in Game 5 of the playoffs.\n\nPhiladelphia looks much different this time around, having since added Al Horford to its interior game while losing Jimmy Butler as a free agent to Miami.\n\nBrooklyn was finishing a back-to-back after losing at defending NBA champion Toronto on Saturday night.\n\nThe 89 points allowed to Philadelphia marked the fewest given up by the Nets this season.\n\nBrooklyn got a needed lift from its bench, with reserves scoring 23 first-half points en route to a 57-43 lead at halftime. For the game, the Nets bench outscored Philadelphia's 40-23.\n\nDinwiddie's dunk midway through the third quarter sparked the Nets, who blitzed Philadelphia with a 10-0 run, capped by his pass to Jarrett Allen for an alley-oop jam that stretched the lead to 76-58 with 3:03 left.\n\nThe 76ers didn't do themselves any favors during that stretch by missing seven shots.\n\n\"They're really hard to guard, especially Spencer Dinwiddie's ability to get into the paint,\" Philadelphia coach Brett Brown said.\n\nBACK IN UNIFORM\n\nF Wilson Chandler made his season debut for Brooklyn after serving a 25-game ban for using performance-enhancing drugs.\n\nBefore taking the court, he gushed over his second chance after he was suspended August 29 for taking Ipamorelin.\n\nChandler, who was signed to a one-year deal in July, was forced to watch his new team's games at home or at a restaurant.\n\nThe 12-year veteran checked into the game with 5:26 remaining in the opening period and finished with two points and seven rebounds in 19 minutes.\n\n\"Having to watch those games, being away from the team, I was just hoping I could be out there and help at some point,\" Chandler said.\n\nTIP-INS\n\n76ers: Horford played with a sore left knee and left hamstring. He finished with 10 points on 5-for-15 shooting from the field and added nine rebounds and five assists. . Philadelphia struggled with its 3-point shooting, making 5 of 26 attempts. . The 76ers, who have not lost a home game in 14 tries, dropped to 6-8 on the road.\n\nNets: Dinwiddie has scored more 20 points in each of Brooklyn's last four games. He's notched 17 20-point games this season after doing so 18 times last year.\n\nHOME SWEET HOME\n\nBrooklyn improved to 10-5 against Philadelphia at Barclays Center, matching the most wins the team has recorded against any team at home since the team moved from New Jersey in 2012. The Nets are 10-2 against Orlando in Brooklyn.\n\nUP NEXT\n\n76ers: Start a three-game homestand when they host Miami on Wednesday..\n\nNets: At New Orleans on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996722.283726
}