{
  "game_id": "0021600512",
  "espn_id": "400899387",
  "date": "Jan 01, 2017",
  "matchup": "LAL vs. TOR",
  "headline": "Kyle Lowry scores 41 as Raptors hold off Lakers, 123-114",
  "body": "LOS ANGELES -- Kyle Lowry relishes any chance to raise his offensive game in the fourth quarter. The Toronto Raptors needed just about every one of his big baskets to hold off the Los Angeles Lakers.\nLowry scored 20 of his season-high 41 points in the fourth, and the Raptors stopped a two-game skid with a 123-114 victory Sunday night.\nHe went 5 for 6 and hit three of his six 3-pointers in the fourth quarter. With one high-difficulty shot after another, the diminutive guard kept the Raptors on top in the face of the Lakers' persistent rally.\n\"It was my time to go out there and be more aggressive,\" said Lowry, who finished two points shy of his career high. \"If it's taking the extra shot or making more shots or creating more shots, it's just a chance to go out there and play basketball. Playing in the fourth quarter is really fun.\"\nLowry also had nine rebounds and seven assists, while DeMar DeRozan scored 31 points in another big game in his hometown. The Atlantic Division-leading Raptors' two scoring stars got them back in winning form on the fifth stop of their six-game road trip.\n\"He could have had more,\" DeRozan said of Lowry's fourth-quarter dominance. \"The fourth quarter has got to be ours on both ends. We've got to put our mark on it.\"\nToronto got its fourth straight win over the Lakers, sweeping the season series for the second straight year.\nNick Young hit seven 3-pointers and scored 26 points for the Lakers, who emerged from a miserable December with their 15th loss in 17 games despite a stirring late surge.\n\"That's a good team,\" Lakers coach Luke Walton said of the Raptors. \"They have some All-Star Olympians that really carried the load for them. (Lowry) had it cooking.\"\nD'Angelo Russell hit four of his six 3-pointers and scored 14 of his 28 points in the final period. The Lakers trimmed a 19-point deficit to six, but Lowry and Terrence Ross hit big shots down the stretch to keep Toronto comfortably ahead.\n\"I think the effort is there,\" Young said. \"We're showing it. We have to limit the six-minute breakdowns we go through.\"\nFIGHT ON\nDeRozan and Young are both Los Angeles natives who played at Southern California. They dueled for long stretches on the eve of the Trojans' return to the Rose Bowl to face Penn State. DeRozan only spent one year at USC before going pro, while Young played three years for the Trojans, leaving in 2007 -- one year before DeRozan arrived.\nDOWN THE STRETCH\nThe Raptors blew it open by hitting their first eight shots of the final period, turning a two-point lead into a 19-point margin in six minutes. Los Angeles rallied behind Russell, whose fifth 3-pointer trimmed the lead to 112-106 with 3:10 left. Los Angeles never got closer as Lowry scored on the next two possessions.\nSWAGGY 3\nYoung's latest burst from long range gave him 36 3-pointers in the last eight games -- the most in an eight-game stretch in Lakers franchise history, according to the Elias Sports Bureau.\nSTILL SLUMPING\nLos Angeles took its third straight home loss since a Christmas victory over the Clippers. The Lakers showed signs of their early-season selves after that miserable December, but weren't rewarded with a win. Los Angeles struggled under the weight of injuries and a packed schedule last month after a 10-10 start to their first season following the worst three years in franchise history.\nTIP-INS\nRaptors: Patrick Patterson didn't play. He strained his left knee at Phoenix on Thursday. ... Jonas Valanciunas had 14 points and 10 rebounds.\nLakers: Former Toronto G Jose Calderon is in uniform, but still struggling with a strained hamstring. He didn't play for the 15th straight game. ... Former Raptors G Lou Williams also struggled, going 3 of 11 for eight points.\nUP NEXT\nRaptors: Finish road trip at San Antonio on Tuesday.\nLakers: Host Memphis on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995411.0511758
}