{
  "game_id": "0022300432",
  "espn_id": "401585060",
  "date": "Dec 29, 2023",
  "matchup": "TOR @ BOS",
  "headline": "Brown scores 31 points, sets up Kornet's tiebreaking basket as Celtics beat Raptors 120-118",
  "body": "BOSTON -- — Jaylen Brown returned from a one-game absence to score 31 points and fed Luke Kornet for the tiebreaking basket as the Boston Celtics beat the Toronto Raptors 120-118 on Friday night.\n\n\r\n              After Scottie Barnes tied the game at 116 with a 3-pointer with 47 seconds remaining, Boston found Kornet for a dunk with 32 seconds left. Boston’s lead stood at 119-117 when Barnes drove down the lane but couldn’t finish. Down three after replay determined that a foul occurred before the final horn, Toronto’s Pascal Siakam went to the line with 1.4 seconds left. He made the first but missed the second as the Celtics melted away the remaining time.\n\n\r\n              “The goal was to make the first and miss the second and go for the offensive rebound and try to win it right there,” Toronto coach Darko Rajakovic said.\n\n\r\n              Brown, who missed Boston’s overtime win Thursday that sent the Detroit Pistons to a record-tying 28th straight loss because of a back injury, swished 3-pointers on three straight possessions in the first quarter. The All-Star guard shot 5 of 6 from beyond the arc and also grabbed 10 rebounds. \n\n\r\n              “I definitely feel that I’ve grown and improved, for sure, but (in terms of the game) slowing down for me? Maybe that’s not the right word. I want to play fast,” Brown said.\n\n\r\n              Brown took a knee to his back during Boston’s win over the Los Angeles Lakers on Christmas Day. He downplayed the significance of the injury after Friday’s game, chalking it up to a contusion.\n\n\r\n              “As I got on the court and moved around, (the stiffness) went away,” Brown said. “I’m feeling all right.” \n\n\r\n              Derrick White finished with 21 points while Kornet added 20 for Boston, which committed 16 turnovers that led to 22 points for Toronto.\n\n\r\n              The Celtics, who were without starters Jayson Tatum and Kristaps Porzingis along with key reserve Al Horford, improved to 16-0 at home and own the league’s best record (25-6). Boston won its fifth straight and 10th game in 11 tries.\n\n\r\n              “It’s the NBA. Each night is different with different guys in the lineup,” White said. “The more ways we can find to win, the better it will make us in the long run.”\n\n\r\n              Kornet appeared in his first game since Dec. 4 and made his first start of the season.\n\n\r\n              “I said to the locker room before the game that it was another opportunity. I didn’t care who we were playing against. I have complete trust and confidence in the character of our locker room because of who they are. I think we can win any game no matter what,” Celtics coach Joe Mazzulla said. “Luke shows up every game and plays his role. It was awesome to watch him play at the level that he did.”\n\n\r\n              Boston led by 15 at halftime and was up by double figures entering the fourth quarter. When Dennis Schroder nailed a 3 from the right wing, Toronto had its first lead since the first quarter at 104-102 with 8:18 remaining.\n\n\r\n              Barnes led Toronto with 30 points on 7-of-15 from 3, while Siakam scored 28. Boston has won all three meetings this season against Toronto.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Detroit on Saturday night for the finale of a three-game road trip.\n\n\r\n              Celtics: At San Antonio on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764995433.7642298
}