{
  "game_id": "0022300197",
  "espn_id": "401584825",
  "date": "Nov 15, 2023",
  "matchup": "MIN @ PHX",
  "headline": "Booker scores 31 in return from injury, Suns roll past Timberwolves 133-115",
  "body": "PHOENIX -- — Someday soon, the Phoenix Suns hope that their three All-Stars will be on the floor at the same time.\n\n\r\n              Two All-Stars turned out to be plenty on Wednesday night.\n\n\r\n              Devin Booker scored 31 points in his return from a calf injury, Kevin Durant also scored 31 and the Suns cruised past the Minnesota Timberwolves 133-115.\n\n\r\n              The Timberwolves had their seven-game winning streak snapped. \n\n\r\n              Booker returned after missing five games with a strained right calf. It was expected to be the first game of the season that all three Suns stars — Durant, Booker and Bradley Beal — played together, but Beal was a late scratch with a sore back.\n\n\r\n              The combo of Booker and Durant provided plenty of production on Wednesday. Booker shot 12 of 22 from the field, adding five assists and four rebounds. Durant made 11 of 15 shots.\n\n\r\n              “It's always nice just playing,” Booker said. “I try to give my input from the bench, but it gets old after a while. I just want to get out there and compete with the team.”\n\n\r\n              Phoenix dominated the game for the majority of the night, taking a six-point lead after one quarter, a 22-point lead at halftime and a 28-point advantage into the final quarter. The Suns shot 60% from the field and 55% from 3-point range, burying what had been one of the NBA's best defenses over the season's first month.\n\n\r\n              Eric Gordon scored 15 for the Suns, Grayson Allen added 14 and Drew Eubanks had 13, including a dunk over Karl Anthony-Towns.\n\n\r\n              “I was expecting (Booker) to have a little wind in his lungs early on,” Durant said. “But he looked great. The pop was there, playing with pace. It’s good to have our point guard back.”\n\n\r\n              Anthony-Towns led the Timberwolves with 25 points on his 28th birthday. Mike Conley had 14 points while Anthony Edwards, Naz Reid and Jaden McDaniels all scored 13.\n\n\r\n              Minnesota had a tough shooting night, particularly behind the 3-point arc, making just 5 of 27 (18.5%).\n\n\r\n              “It was certainly one of those nights — all credit to them,” Timberwolves coach Chris Finch said. “We could never really get them contained. They made a lot of shots, but they also had a lot of comfort. I don't think we were able to establish ourselves defensively.”\n\n\r\n              The Suns took a 76-54 halftime lead after shooting 63% from the field. Booker scored 18 points while Durant added 17.\n\n\r\n              The Timberwolves were playing one night after an emotional game against the Golden State Warriors. An altercation between Golden State's Klay Thompson and McDaniels escalated when Draymond Green grabbed Rudy Gobert around the neck and dragged him away.\n\n\r\n              Thompson, McDaniels and Green were all ejected. Green was given a five-game suspension by the NBA on Wednesday.\n\n\r\n              Conley said that wasn't an excuse for their mediocre performance on Wednesday.\n\n\r\n              “They played with much more force than we did, starting at the beginning,” Conley said. “We had a lot of mental lapses and it took us a little too long to get into the flow of the game.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Travel to New Orleans on Saturday.\n\n\r\n              Suns: Travel to Utah on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996494.561451
}