{
  "game_id": "0022201192",
  "espn_id": "401469347",
  "date": "Apr 05, 2023",
  "matchup": "TOR @ BOS",
  "headline": "Celtics wrap up East No. 2 seed with 97-93 win over Raptors",
  "body": "BOSTON -- — Malcolm Brogdon scored 29 points and hit two late free throws to help the Boston Celtics hold on for a 97-93 victory over the Toronto Raptors on Wednesday night. \n\n\r\n              With Milwaukee’s win over Chicago, Boston (55-25) secured the No. 2 seed in the Eastern Conference playoffs. \n\n\r\n              Jaylen Brown added 25 points and 11 rebounds. Derrick White finished with 17 points in the opener of a two-game series. The teams meet again Friday in Boston. \n\n\r\n              Brogdon, a candidate for NBA Sixth Man of the Year after spending the previous seasons of his career in Milwaukee and Indiana as a starter, said he's settled into his new role in Boston. \n\n\r\n              “Coming off the bench it can be a challenge sometimes, to be honest,\" Brogdon said. “That's where you've got to suck it up. You're not going to score as much. You're not going to play as much. I think that is what makes a great team — having guys that are able to do that. Guys that are able to sacrifice.” \n\n\r\n              A night after their two-point loss at Philadelphia, the Celtics played without three starters. All-Star Jayson Tatum (bruised left hip), Marcus Smart (neck spasms) and Al Horford (back stiffness) all got the night off on the second night of the back-to-back. \n\n\r\n              It made wrapping up the second seed that much more meaningful.\n\n\r\n              “You can't take stuff like that for granted,” Brown said. “To be on a 50-plus win team is an honor. .... It's great. And we're getting ready to enter the postseason with a better feeling.”\n\n\r\n              The Raptors (40-40) fell a game behind eighth-place Atlanta (41-39) in the standings. Pascal Siakam had 18 points and 11 rebounds. Scottie Barnes added 18 points and eight rebounds. \n\n\r\n              Toronto went just 6 of 33 from beyond the arc. Boston didn’t shoot much better (11 of 38).\n\n\r\n              Siakam scored 14 straight for Toronto to help the Raptors trim what had been a 13-point deficit to 74-72 late in the third quarter. \n\n\r\n              Brogdon scored the final five points of the period to give Boston a seven-point cushion heading into the fourth. \n\n\r\n              Toronto kept chipping away and used an 8-1 run to tie the game at 82, before the Celtics responded with five straight points. \n\n\r\n              A dunk by Precious Achiuwa got Toronto within 89-86. Boston answered again, this time with a 6-2 spurt to get it back to six with a minute to play. \n\n\r\n              Boston ran the clock down, but Brogdon's turnover led to a Raptors fast break and another dunk by Achiuwa, who was fouled. He completed the three-point play to make it 95-93 with 12.6 seconds left. \n\n\r\n              Brogdon was fouled on the ensuing inbounds pass and hit both free throws. \n\n\r\n              He said rest and building on their foundation were the priority for the Celtics heading over their final two games. \n\n\r\n              “It's about finishing the season strong with good habits. We don't want to lose these two games,” Brogdon said. “We want to go in with momentum. ... I think that's one of the most important things for any of the high-seeded teams is going in with momentum because we're going to get everybody's best shot.”\n\n\r\n              TIP-INS\n\n\r\n              Raptors: Went 2 for 18 from 3-point line in the first half. … Siakam had 12 first-quarter points, but was held scoreless in the second quarter. \n\n\r\n              Celtics: Brown was awarded the Red Auerbach Award, given annually by the franchise to the player who “best exemplifies the spirit and meaning of what it means to be a Boston Celtic.” \n\n\r\n              ROUGH LANDING\n\n\r\n              White appeared to tweak his left ankle with under eight minutes to play in the third quarter after he landed awkwardly after getting fouled on a drive to the rim. He hit both ensuing free throws and stayed in the game before going to the bench with 3:57 left in the period. \n\n\r\n              He played the entire fourth quarter and led the Celtics on the night, logging 41 minutes. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994005.934886
}