{
  "game_id": "0021600233",
  "espn_id": "400899683",
  "date": "Nov 25, 2016",
  "matchup": "MEM vs. MIA",
  "headline": "Tyler Johnson leads Heat past Grizzlies, 90-81",
  "body": "MEMPHIS, Tenn. -- Erik Spoelstra took the first matchup with his former assistant.\nTyler Johnson matched his season high with 22 points, Dion Waiters added 15 and the Miami Heat snapped their two-game losing streak with a 90-81 victory over the Memphis Grizzlies on Friday night.\nThe game was the first that matched Spoelstra against first-year Memphis coach David Fizdale.\nWith a number of Heat players on the injury list, Johnson provided a boost for Miami, particularly in the first half.\n\"He's being aggressive where we need him to be aggressive,\" Spoelstra said. \"He's an example of the ball finding energy, but the ball has to move to find that energy.\"\nJames Johnson added 13 points and Josh Richardson finished with 12 for Miami.\nMike Conley, who came off the bench, led Memphis with 16 points but shot only 5 of 15 from the field. JaMychal Green finished with 14 points for Memphis, which played without reserve Zach Randolph following his mother's death and had its six-game winning streak snapped.\nThe Heat played without a number of players due to injuries. The latest was point guard Goran Dragic, who missed the game because of a sore left elbow. He joined Wayne Ellington, Willie Reed and Justise Winslow on the Miami injured list.\nMiami made up for the personnel shortage by hitting 12 of 31 outside the arc and forcing 18 turnovers, leading to 23 points. The Heat jumped to an early lead, built it to as many as 17 and led from start to finish.\n\"We were a little behind the eight-ball with Goran being out,\" Tyler Johnson said. \"Everybody did what they were supposed to do in order for us to get out of here with a win.\"\nMiami used 3-point shooting in the third quarter, hitting six of its first nine long-distance shots. That helped the Heat build their biggest lead to 17 before a 71-57 lead into the fourth.\nMeanwhile, the Memphis offense, which seemed out of sync most of the night, continued to sputter. Memphis never got closer than eight points in the final quarter.\n\"Their speed really impacted us,\" Fizdale said. \"We never got organized. We never had a toughness about us. We didn't play with the attitude that we've had over the last six games, especially defensively.\"\nTIP-INS\nHeat: In announcing Dragic would not play, Spoelstra said the guard's elbow \"is just not getting better.\" ... C Hassan Whiteside recorded a block in the first quarter, his 44th consecutive game with a block. He finished with two blocks. Whiteside, who had 12 rebounds, has led the Heat in rebounding in all 15 games this season.\nGrizzlies: Conley not starting was because of minutes management, not disciplinary or injury-related. ... Rookie G Andrew Harrison, who started his third game of the season, missed all eight of his shots in the game, but finished with seven assists. ... Marc Gasol had a season-high five blocks, but only one rebound.\nPLAYING THROUGH PAIN\nWaiters was questionable with a lingering right groin injury, but started. \"To be honest, I'm about 60 percent out there. I feel like my team needs me,\" he said.\n\"If the injury's not killing me . I'm going to battle through it. I'm going to fight. That's who I am.\"\nNO Z-BO\nThe team granted Randolph an indefinite leave of absence after the death of his mother, Mae Randolph, on Thanksgiving Day. \"Zach and his mother had an inseparable bond,\" Grizzlies General Manager Chris Wallace said in a statement released by the team. \"Mae was so fiercely proud of her son, his accomplishments and his truly special place in the hearts of Memphians and the Grizzlies family.\" Conley said: \"I called (Randolph), and we cried on the phone together. It was emotional, and that doesn't leave you in 24 hours.\"\nHELLO OL' FRIEND\nFizdale served as a Miami assistant for eight years. There were plenty of hugs, handshakes and receiving lines of well-wishers for Fizdale, including after the game.\nUP NEXT\nHeat: Return home Saturday night after a four-game road trip to face the Grizzlies.\nGrizzlies: Memphis will play its fourth straight game against an Eastern Conference opponent when it faces the Heat on Saturday. The Grizzlies are 3-0 this season on the second night of a back-to-back.",
  "source": "espn_api",
  "crawled_at": 1764995620.532552
}