{
  "game_id": "0022400266",
  "espn_id": "401704832",
  "date": "Nov 23, 2024",
  "matchup": "CHI vs. MEM",
  "headline": "Scotty Pippen Jr. scores career-high 30 points in Grizzlies' 142-131 win over Bulls",
  "body": "CHICAGO -- — Scotty Pippen Jr. had a career-best 30 points with 10 assists to lead the Memphis Grizzlies past the Chicago Bulls 142-131 on Saturday night.\n\n\r\n              Jaylen Wells added 26 points as Memphis won its second straight.\n\n\r\n              Pippen, playing in the arena where his Hall of Fame father’s retired number hangs, had 26 points in the first three quarters for Memphis, which has won three of its last four.\n\n\r\n              Memphis led 109-98 after three quarters and broke the game open with an 8-3 run in the opening minutes of the final period.\n\n\r\n              Jaren Jackson Jr. scored 23 points, and Santi Aldama added 10 points and 10 rebounds for Memphis, which led 64-60 at halftime and outrebounded the Bulls 49-35.\n\n\r\n              The Bulls fell despite 29 points from Zach LaVine, which included 26 in the second half, and 26 points and eight rebounds from Nikola Vucevic.\n\n\r\n              Takeaways\r\n              Grizzlies: Memphis improved to 5-3 during Ja Morant’s absence. The two-time All-Star remained out of action with a hip injury.\n\n\r\n              Bulls: Taking more 3-pointers has been a priority this season, but Chicago wasn't able to earn a win despite shooting 45.2% (19 of 42) from 3.\n\n\r\n              Key moment\r\n              Up 91-84 midway through the third quarter, Memphis got consecutive 3-pointers from Jay Huff and Luke Kennard that pushed the lead into double digits and forced a Chicago timeout. The hosts got the deficit under 10 points just twice the rest of the night.\n\n\r\n              Key stat\r\n              The Bulls shot 37% from the floor and managed just 22 points during the first quarter as Memphis took a lead it never lost.\n\n\r\n              Up next\r\n              The Grizzlies host Portland on Monday night, and Chicago visits Washington on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997099.136111
}