{
  "game_id": "0022400828",
  "espn_id": "401705394",
  "date": "Feb 24, 2025",
  "matchup": "SAC vs. CHA",
  "headline": "Zach LaVine scores season-high 42 points to help Kings beat Hornets 130-88",
  "body": "SACRAMENTO, Calif. -- — Zach LaVine scored a season-high 42 points in his finest game with Sacramento since being acquired in a multi-team trade near the deadline, leading the Kings to a 130-88 win over the Charlotte Hornets on Monday night.\n\n\r\n              LaVine hit eight 3-pointers and shot 16 of 19 overall as the Kings earned their first home win over the Hornets since 2021. LaVine has scored in double figures in all eight games for Sacramento.\n\n\r\n              DeMar DeRozan had 18 points and seven rebounds for the Kings (29-28). Malik Monk scored 13, Keegan Murray added 10 and Domantas Sabonis finished with seven points, 10 rebounds and seven assists.\n\n\r\n              Miles Bridges scored 23 points for the Hornets. LaMelo Ball and Nick Smith Jr. each scored 13 points, and Jusuf Nurkic and Moussa Diabate scored 12 apiece for Charlotte, losers in 12 of their last 14 games.\n\n\r\n              LaVine hit four 3-pointers and shot 8 for 9 in the first half as the Kings built a 20-point lead.\n\n\r\n              Takeaways\r\n              Hornets: Coming off a 53-point loss to Portland two nights earlier, the Hornets showed plenty of poise early, but couldn’t sustain it attack.\n\n\r\n              Kings: This might have been the most cohesive game that Sacramento has played since acquiring LaVine. That's a good sign as they try to hold onto the final play-in spot in the Western Conference.\n\n\r\n              Key moment\r\n              The Hornets stunned the Kings with an 8-2 spurt coming at the start, but that was about as good as it got for Charlotte. Over the next six minutes Sacramento responded with a 23-10 run and never looked back.\n\n\r\n              Key stat\r\n              The Hornets have lost their last two games by a combined 95 points.\n\n\r\n              Up next\r\n              Charlotte continues its trip Tuesday at Golden State. Sacramento plays at Utah on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997322.2429209
}