{
  "game_id": "0021600683",
  "espn_id": "400900104",
  "date": "Jan 25, 2017",
  "matchup": "CHI vs. ATL",
  "headline": "Schroder scores 24, Hawks end game on 19-4 run to beat Bulls",
  "body": "CHICAGO --  One huge run to end the game gave the Atlanta Hawks a gutsy win after it appeared they were headed toward a lackluster loss.\n\nDennis Schroder scored 24 points, Paul Millsap added 21 and the Hawks finished with a 19-4 spurt to beat the Chicago Bulls 119-114 on Wednesday night.\n\nThabo Sefolosha scored 18 and Tim Hardaway Jr. added 17, hitting four of Atlanta's season-high 17 3-pointers. Dwight Howard had 16 points and 12 rebounds, and Kent Bazemore scored 16 as the Hawks pulled out their 12th win in 15 games.\n\nThey also beat Chicago for the seventh straight time.\n\n\"We just stayed focused, we stayed together,\" Howard said. \"We hit some big shots. We stayed composed. It shows our growth as a team.\"\n\nJimmy Butler led Chicago with 40 points, and Dwyane Wade scored 33. But the Bulls let a 10-point lead slip away down the stretch, and both stars questioned the team's desire afterward.\n\nWade focused on the younger players, saying, \"I'm 35 years old, man. I have three (NBA) championships. It shouldn't hurt me more than it hurts them. They have to want it.\"\n\nButler said his team doesn't deliver effort on a consistent basis and doesn't take losses as hard as it should.\n\n\"If you're not (mad) after you lose every game, something's wrong,\" he said. \"This is your job. This is supposed to be what you love to do. Not everybody looks at it this way. I want to play with guys who care and play hard and want to do well for this organization, that want to win games.\"\n\nBIG RUN\n\nIt was 110-100 after Wade hit a pull-up jumper with 3:02 remaining. The Hawks called a timeout, and everything changed after that.\n\nAtlanta picked up the pace on offense and grabbed some important rebounds after getting beaten on the glass most of the game.\n\nMillsap, Schroder and Hardaway nailed 3s on consecutive possessions to start the game-ending run. Schroder gave Atlanta a one-point lead with a layup after Chicago's Paul Zipser missed a 3, and Howard made one of two free throws to make it 112-110 with 58.6 seconds left.\n\nAfter Butler banked in a pull-up shot, Howard threw down an alley-oop on a pass from Kent Bazemore. Chicago's Nikola Mirotic missed a 3 with 25.3 seconds left, and Schroder and Sefolosha combined to make five free throws in the final 20 seconds.\n\n\"It's big-time,\" Schroder said. \"You can see the difference. If we play lazy, don't play with pace and just play sloppy we go down 15, 10, 20. But if we play with our pace, we can beat everyone. We've got to do a better job of playing for 48 minutes, doing it day-in, day-out every game.\"\n\nPOINT GUARD SHUFFLE\n\nChicago's Jerian Grant made his second straight start at point guard, with Rajon Rondo backing him up. Michael Carter-Williams remained on the bench for the second game in a row after starting the previous 12.\n\nTIP-INS\n\nHawks: Rosters for the Rising Stars Challenge were announced on Wednesday, and the way Atlanta coach Mike Budenholzer sees it, G Malcolm Delaney should have been included. \"If you look at analytics, you look at minutes played, you look at how his team is performing, he clearly is one of the guys who should be on the U.S. roster,\" he said. \"I just guess I'm in the minority.\" Delaney came into Wednesday's game averaging 6.1 points and 2.9 assists in a backup role. ... The Hawks matched their longest win streak against Chicago. ... F Mike Muscala (sprained left ankle) missed his sixth consecutive game.\n\nBulls: Butler has scored at least 40 five times this season. ... Rondo, who hadn't made a free throw since Dec. 6, went 1 of 2 from the line. ... The Bulls have not beaten the Hawks since April 15, 2015.\n\nUP NEXT\n\nHawks: Host the Washington Wizards on Friday.\n\nBulls: Host the Miami Heat on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995048.3159318
}