{
  "game_id": "0022200034",
  "espn_id": "401468189",
  "date": "Oct 22, 2022",
  "matchup": "MEM @ DAL",
  "headline": "Doncic, Mavs have fast start, rip Griz 137-96 in home opener",
  "body": "DALLAS -- — Luka Doncic dribbled behind his back before an alley-oop pass to new pick-and-roll partner Christian Wood for a one-handed dunk.\n\n\r\n              Moments later the Dallas superstar delivered his final assist to Tim Hardaway Jr. for a punctuating 3-pointer in a home-opening party for Mavericks.\n\n\r\n              Never mind what Doncic did early.\n\n\r\n              The young Slovenian scored 21 of his 32 points in the first quarter, and the Mavericks rode a hot start to a 137-96 rout of the Memphis Grizzlies on Saturday night.\n\n\r\n              “It's incredible. I don't even know what to talk about,” Wood said of Doncic after getting 25 points and 12 rebounds in his home debut following an offseason trade that brought the 6-foot-10 center from Houston.\n\n\r\n              “The things that he does on the offensive end, the passes he makes, how he gets everybody set up, it's amazing.”\n\n\r\n              Ja Morant scored the first six Memphis points, but the first bucket from someone else didn't come until the 4:30 mark of the first quarter as the Grizzlies trailed 39-17 going to the second.\n\n\r\n              Morant finished with 20 points a night after a 49-point showing in a victory at Houston gave him 83 points through two games. \n\n\r\n              The Grizzlies were trying for their first 3-0 start in five years, but instead ended up on the wrong end of the biggest blowout in the season's first five days at 41 points.\n\n\r\n              The Mavericks led by 25 points in the first, and the 22-point margin after the quarter matched the lead the 2022 Western Conference finalists blew in a 107-105 loss at Phoenix to open the season.\n\n\r\n              There was no risk of a repeat for Dallas in a meeting of two West playoff qualifiers from last season, with those last two of Doncic's 10 assists late in the third quarter finishing off a showy night for Dallas.\n\n\r\n              Doncic shouted and flexed for emphasis in the lane after feeding Wood's one-handed slam, then the three-time All-Star beat the third-quarter buzzer with the pass to Hardaway for a corner 3 and 99-71 lead.\n\n\r\n              “He’s playing the game at a different level right now,” coach Jason Kidd said, “kind of like where he picked up last season where he ended playing at an extremely high level.”\n\n\r\n              Dallas put its best defenders on Morant, but used plenty of help to make the young sensation's paths to the rim difficult. Morant was limited to 12 shots (six makes) and four assists, going 8 of 8 on free throws.\n\n\r\n              “I think a great team played great, and we didn’t play great,” Memphis coach Taylor Jenkins said, ending his postgame session with reporters after that one question.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Desmond Bane scored 14 points, and Tyus Jones had 10. ... Memphis has lost four in a row against Dallas since winning the first meeting last season. \n\n\r\n              Mavericks: Doncic had at least 20 points in the first quarter for the third time in the regular season. His personal record is 28 against the Los Angeles Clippers last season the same day Dallas traded his former European sidekick, Kristaps Porzingis. ... Hardaway scored 16 points, and Spencer Dinwiddie had 15.\n\n\r\n              EARLY LUKA\n\n\r\n              Doncic had little trouble getting his shots early, going 8 of 10 in the first, including 3 of 4 from 3-point range with some easy buckets, while adding three assists. He finished 12 of 23 and had seven rebounds.\n\n\r\n              “I thought Luka and those guys set the tone in the first quarter by the paint touches,” Kidd said. “We got good looks, make or miss.”\n\n\r\n              ALL IN\n\n\r\n              The blowout allowed the Mavericks to repeat what they did a year ago in the home opener when every active player on the roster got into the game. The only one who didn't score was rookie Jaden Hardy, who was 0 of 3 from the field. Tyler Dorsey scored nine points in four minutes.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Brooklyn on Monday night.\n\n\r\n              Mavericks: At New Orleans on Tuesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994528.711143
}