{
  "game_id": "0021501113",
  "espn_id": "400829000",
  "date": "Mar 30, 2016",
  "matchup": "TOR vs. ATL",
  "headline": "Raptors beat Hawks 105-97 to notch first 50-win season",
  "body": "TORONTO -- This time, the Toronto Raptors wouldn't be denied in their quest for history.\nTrying to win 50 games for the first time, the Raptors took the lead at the midpoint of the first quarter and never surrendered it in a 105-97 victory over the Atlanta Hawks on Wednesday night.\n\"For us, it's another great accomplishment,\" forward Patrick Patterson said after the Raptors bounced back from a 19-point home loss to Oklahoma City two nights earlier. \"It's another thing we can take away from this season, building off of the 49 (wins) we had last season.\n\"Coming into the season with the mentality of wanting to beat that and actually doing it, having that under our belts, is a great feeling.\"\nDeMar DeRozan scored 26 points and Jonas Valanciunas added 19 points and nine rebounds as Toronto became the final franchise in the NBA to reach 50 in a season.\nDeRozan added six assists and five rebounds, while Kyle Lowry finished with 17 points, 11 assists and six rebounds as Toronto (50-24) won for just the second time in five games.\n\"I thought they played really well,\" said Atlanta guard Kyle Korver, who had three points and five rebounds. \"They came out with a lot of fire. They played better than us, they played harder than us and that's a bad combination.\"\nJeff Teague had 18 points for the Hawks (45-31), whose four-game winning streak was snapped.\nTim Hardaway Jr. added 15 points and Paul Millsap had seven points and nine rebounds for Atlanta, which has won 14 of its last 18 games.\nThe Raptors took the lead for good early in the first quarter and led by as many as 24 points late in the third before Atlanta scored 14 straight in the fourth period to make a game of it.\nBut with the Toronto lead down to 93-84, the Raptors reeled off six straight points to re-establish some breathing room.\nThe Raptors led 89-67 going into the fourth quarter on the strength of a 31-14 run over the final nine minutes of the third. Toronto hit four 3s in the quarter, including a pair by rookie guard Norman Powell, who had 10 points in the period.\n\"I felt like we came out with the right mindset but they were just much more aggressive, they were quicker to the ball,\" Hawks center Al Horford said. \"You've got to give them credit. They played a better game than we did.\"\nLowry, nursing a sore right elbow after having fluid drained from it following Monday's loss, shot just 4 for 19 from the field.\n\"I thought he was trying to feel the game out with his offense,\" said Toronto head coach Dwane Casey. \"He was smart with it. He didn't force too many things and that's what he's got to do.\"\nToronto had widened its lead to 54-41 at halftime as Lowry and DeRozan combined for 18 points in the second quarter alone, just three shy of the total scored by all Hawks in the period.\nTIP-INS\nHawks: Atlanta turned the ball over 18 times, leading to 25 Toronto points, compared to 11 turnovers by the Raptors for 12 Hawks points. . Atlanta hit 14 of 33 from 3-point range, compared to 11 of 23 for Toronto.\nRaptors: Forward Luis Scola sat out with a sore right knee and Jason Thompson got the start in his place. . Powell has scored in double figures in four straight games.\nNO CENTURY\nThe Hawks scored fewer than 100 for the first time in 10 games. The previous time they were held under the century mark was when they scored 95 against Memphis on March 12.\nHELPING HAND\nAtlanta, which came into the game second in the NBA with 25.7 assists per game, had 24, the 70th time in 76 games this season the Hawks have had at least 20.\nCASEY'S CLIMB COACHING UP\nThis was the fifth straight season under Casey that the Raptors have increased their win total. Since 2011-12, they are the only team to do that under the same head coach.\n\"We are not satisfied with just 50 wins,\" Lowry said. \"It's a great benchmark to get but at the end of the day we still want to be playing as long as possible, as close as possible to the end of the whole NBA season.\"\nUP NEXT\nHawks: Host Cleveland on Friday night.\nRaptors: Visit Memphis on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994694.106849
}