{
  "game_id": "0022301034",
  "espn_id": "401585662",
  "date": "Mar 25, 2024",
  "matchup": "ATL vs. BOS",
  "headline": "Hawks rally from 30 points down to stun NBA-leading Celtics 120-118",
  "body": "ATLANTA -- — De’Andre Hunter could’ve held the ball and forced the Celtics to foul.\n\n\r\n              Instead, he let it fly.\n\n\r\n              Considering what the Atlanta Hawks had done, rallying from a 30-point deficit against NBA-leading Boston, it was only appropriate the shot hit nothing but net.\n\n\r\n              Hunter scored 24 points, including a clinching 3-pointer with 9.2 seconds remaining, and the patched-together Hawks pulled off one of the most improbable wins in franchise history with a 120-118 stunner over the Celtics on Monday night.\n\n\r\n              The Celtics had won 20 of 22 and brought a nine-game winning streak into State Farm Arena — a run that certainly appeared in no jeopardy when Al Horford’s 3-pointer put Boston up 68-38 with just under 4 1/2 minutes left in the first half. \n\n\r\n              But the Hawks, clinging to the final play-in spot in the East and one of the league’s most disappointing teams, launched a comeback out of nowhere with All-Star guard Trae Young and three other key players sidelined by injuries.\n\n\r\n              It was the biggest comeback win for Atlanta since at least the 1997-98 season, when the NBA began keeping detailed play-by-play.\n\n\r\n              Dejounte Murray put the Hawks ahead to stay at 117-116 on a reverse layup with a minute left. Jaylen Brown missed a desperation 3 with the shot clock expiring, and Hunter sealed things at the other end with a huge assist from Clint Capela.\n\n\r\n              After Murray missed a jumper, Capela grabbed the offensive rebound and spotted Hunter all alone at the top of the key. Even though the shot clock was off and Hunter could’ve forced the Celtics to foul, he let go an open look from 26 feet.\n\n\r\n              Hunter had run through the scenario before he got the ball.\n\n\r\n              “If he passes it to me, I’m shooting,” Hunter told himself. \"He got the rebound, he passed it to me, so I shot it.” \n\n\r\n              Hawks coach Quin Snyder had no problem with the seemingly ill-advised decision.\n\n\r\n              “He didn’t hesitate,” Snyder said. “He shot the ball with confidence, and I had confidence in him.”\n\n\r\n              It was a shocking loss for the Celtics in a season filled with wins, to a team that came into the night trailing them by 25 1/2 games in the Eastern Conference standings..\n\n\r\n              “We let our foot off the gas in the second half, and they got in a great rhythm,\" said Jayson Tatum, who led the Celtics with 37 points. “It's a tough pill to swallow.”\n\n\r\n              Atlanta's comeback began with a 9-0 run to end the first half, which cut the deficit to 74-56 as the teams headed to the locker room.\n\n\r\n              The momentum carried over to the third quarter, which began with Atlanta ripping off 19 of the next 23 points to slice the margin to 78-75.\n\n\r\n              After the Celtics flirted several times with pulling away again, the Hawks finally claimed their first lead of the night when little-used Wesley Matthews knocked down a 3 to make it 97-96 with 9:42 remaining.\n\n\r\n              Bogdan Bogdanovic had 22 points and Murray chipped in with 19, but it was several players who are normally buried deep on the bench who really carried the Hawks.\n\n\r\n              Vit Krejci had 16 points, including a 3-pointer that left him shrugging his shoulders toward his teammates as if he couldn't really believe what was happening. Bruno Fernando scored 13 and Matthews knocked down a pair of crucial 3s.\n\n\r\n              “It felt like everything we were doing was going (right) for us,” Krejci said. “It was a really good moment. We’ve got to find a way to feel that way the whole game.”\n\n\r\n              With plenty of fans in green cheering them on in Atlanta, the Celtics doubled up the home team in the first quarter by racing to a 44-22 lead.\n\n\r\n              Boston made 16 of 24 shots in the opening period, including 5 of 7 beyond the 3-point arc, in addition to going 7 of 7 at the foul line. \n\n\r\n              Tatum finished the half with 23 points, four rebounds, four assists, two steals and a blocked shot. But he was stymied a bit in the second half by Krejci, who began to pick up the Boston star from one end of the court to the other.\n\n\r\n              Brown added 24 points for the Celtics.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: With a strange quirk of scheduling, Boston will get an extended stay in Atlanta before the same teams meet again on Thursday. \n\n\r\n              Hawks: Atlanta has another home game against the Portland Trail Blazers on Wednesday, sandwiched between its two contests against the Celtics.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996267.720615
}