{
  "game_id": "0022401134",
  "espn_id": "401705700",
  "date": "Apr 06, 2025",
  "matchup": "TOR @ BKN",
  "headline": "The Raptors use balanced scoring to take season series beating the Nets 120-109",
  "body": "NEW YORK -- — Rookie Jonathan Mogbo tied his career highs with 17 points and 11 rebounds as the Toronto Raptors beat the Brookyn Nets 120-109 on Sunday. \n\n\r\n              Mogbo also had a season-high seven assists for the Raptors. Ochai Agbaji added 15 points as Toronto snapped a three-game skid. RJ Barrett and AJ Lawson each had 13, Cole Swider and Jamison Battle each had 12 and Jared Rhoden 10. Jamal Shead finished with a career-high 12 assists to go with nine points. \n\n\r\n              Toronto used its 40th different starting lineup this season. \n\n\r\n              Reece Beekman led eight Nets in double figures with 14 points and also had five assists and three steals. Keon Johnson added 13 points, seven rebounds and four assists. Dariq Whitehead, Trendon Watford, Drew Timme and Maxwell Lewis also had 13 points apiece. Tosan Evbuomwan had 12 and Ziaire Williams 11. \n\n\r\n              Battle had all of his points in the first half, while Mogbo scored 11 in the second half for Toronto.\n\n\r\n              Takeaways\r\n              Raptors: They took the season series 3-1 for their first against Brooklyn since 2020-21. Even with the Raptors eliminated from postseason contention, they at least head toward season’s end taking three straight from the Nets with this their second win since March 26 also at Brooklyn.\n\n\r\n              Nets: . The Nets lost their second straight to start a four-game home stand. The Nets also have lost eight of 10 limping to season's end.\n\n\r\n              Key moment\r\n              After the Nets tied it at 35 on Lewis’ bucket, Battle’s 3 put the Raptors ahead to stay. They finished the second quarter on a 26-11 run. Up 61-46 at halftime, the Raptors took their biggest lead opening the third scoring 12 of the first 14.\n\n\r\n              Key stat\r\n              \r\n              The Raptors had a season-high 16 steals and forced 23 Brooklyn turnovers, which Toronto turned into 22 points.\n\n\r\n              \r\n              Up next\r\n              The Raptors host Charlotte on Wednesday night in their home finale. The Nets continue that home stand Tuesday night hosting New Orleans.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_api",
  "crawled_at": 1764997603.626434
}