{
  "game_id": "0022300505",
  "espn_id": "401585133",
  "date": "Jan 07, 2024",
  "matchup": "LAL vs. LAC",
  "headline": "LeBron James scores 25 points, Lakers hold off Clippers 106-103 to snap 4-game losing streak",
  "body": "LOS ANGELES -- — LeBron James had 25 points, eight rebounds and seven assists, Taurean Prince hit a tiebreaking 3-pointer with 1:17 to play and the Los Angeles Lakers snapped a four-game losing streak with a 106-103 victory over the Los Angeles Clippers on Sunday night.\n\n\r\n              Anthony Davis had 22 points and 10 rebounds for the Lakers, who beat the surging Clippers for the second straight time after losing 11 in a row to their hallway rivals.\n\n\r\n              While James and Davis carried them, Prince and D'Angelo Russell also made key plays down the stretch as the Lakers hung on for just their fourth victory in 14 games since winning the NBA’s Inaugural In-Season Tournament.\n\n\r\n              “We played like we needed to win, like it was a must-win,” Davis said. “We competed on both sides of the basketball. We’ve just got to build off of it. We know what we have in the locker room. We know what it takes to win, and we displayed that tonight.”\n\n\r\n              James set the tone shortly after halftime with a ferocious dunk on Paul George, and the Lakers never trailed in the fourth quarter despite blowing a 10-point lead. They still couldn't exhale until Norman Powell's 3-point attempt rattled in and out at the buzzer.\n\n\r\n              “Overtime,” James said when asked what he was thinking while he watched Powell's shot. \"It looked like it was good for sure. Right on line. ... We've got to continue to get better. Try to use this to catapult (us to play) a little bit better. Better play from us, but it still don't take away from the fact of how we've been playing like the last 11, 12 games.\"\n\n\r\n              Paul George scored 22 points and Ivica Zubac had 22 points and 19 rebounds for the Clippers, whose five-game winning streak ended. Kawhi Leonard scored 15 points, and James Harden had 15 points and nine assists in the childhood Lakers fan's first game against them since getting traded home to the Clippers, who have still won 14 of their last 17.\n\n\r\n              “We just didn’t play a good offensive game,” Lue said. “There was a bad flow to the game offensively. I thought our defense was pretty good, but offensively we couldn’t get in a flow or a rhythm.”\n\n\r\n              Neither team took a double-digit lead until Russell’s third 3-pointer put the Lakers up 92-82 early in the fourth. The Clippers rallied with nine consecutive points down the stretch, and they tied it on Powell’s three free throws with 2:19 to play while the Lakers went into a 2-for-7 slump with six turnovers.\n\n\r\n              But Russell found Prince for his big 3-pointer from the perimeter, one of his biggest shots since joining the Lakers.\n\n\r\n              Harden kept it close with a 3-pointer with 23 seconds left, and Austin Reaves missed one of two free throws with 4.2 seconds left. Powell had a decent look, but couldn't tie it.\n\n\r\n              “You're going to have games like this (where) you're not going to play great,” Leonard said. “You've just got to give the Lakers credit. They came out aggressive with energy. Bron had a great game, and AD, and they led them to victory.”\n\n\r\n              Russell scored 13 points with three 3-pointers in his return from a three-game absence with a bruised tailbone for the Lakers, who had been on a three-season skid against the Clippers until they broke through with an overtime victory early this season.\n\n\r\n              “They’re a championship ballclub, as far as I’m seeing,” Lakers coach Darvin Ham said of the Clippers. “Playing very high-level basketball, multiple threats all over the place. That’s a huge, huge win. A great win to get off the slide.”\n\n\r\n              The game was a franchise milestone for the Clippers, who played their final game as the “visiting” team in their own arena, barring a playoff series between these clubs. The two Los Angeles teams' final two meetings of this regular season will be “home” games for the Clippers.\n\n\r\n              The Clippers and Lakers have shared the building long known at Staples Center since it opened in 1999, with the Clippers finally becoming worthy rivals over the past decade after years of struggle.\n\n\r\n              Billionaire Clippers owner Steve Ballmer's Intuit Dome will open in Inglewood next season, finally creating an exclusive home for the franchise that has labored in the shadow of the Lakers' championship banners for a quarter-century of cohabitation.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host Phoenix on Monday night.\n\n\r\n              Lakers: Host Toronto on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995523.820114
}