{
  "game_id": "0022200889",
  "espn_id": "401469044",
  "date": "Feb 23, 2023",
  "matchup": "MEM @ PHI",
  "headline": "Harden, Embiid, Harris rally 76ers past Grizzlies 110-105",
  "body": "PHILADELPHIA -- — Joel Embiid slogged through illness and even played the rare role of victim on a dunk attempt. With a few big buckets and his own one-handed stuff of Ja Morant, Embiid ultimately showed why it's never good to count out The Big Man.\n\n\r\n              Tobias Harris sank the go-ahead 3-pointer with 39 seconds left, James Harden scored 31 points, and Embiid had 27 points and 19 rebounds to help the Philadelphia 76ers storm back and beat the Memphis Grizzlies 110-105 on Thursday night.\n\n\r\n              Embiid made 3 of 5 shots in the fourth — including the tying bucket that made it 100-all — to rally the Sixers from deficits of 17 points in the first half and 12 in the third.\n\n\r\n              “If you took away his offense, what else did he do?” coach Doc Rivers said with a laugh.\n\n\r\n              Try six blocks. Six assists. Oh, and 17 defensive rebounds. Go ahead, throw in 13 of 17 free throws.\n\n\r\n              “That tells you just how great the guy is,” Rivers said.\n\n\r\n              The 76ers shrugged off three of their worst quarters of the season to turn in a fantastic fourth that nearly shook the arena with each clutch bucket.\n\n\r\n              “The arena was so loud, it was like playoff basketball right here,” Harris said. “We need this to prepare us, get us ready.”\n\n\r\n              The Sixers won for the fifth time this season when trailing by 15 or more points.\n\n\r\n              Embiid said he had to “keep being a monster” defensively when the ball wasn't dropping on offense.\n\n\r\n              “I always think two-way is better than one-way,” Embiid said. “In those type of nights, to be able to have an impact when you don't have anything going on offensively, I think is nice.”\n\n\r\n              Harden buried a 3 to get the run rolling and Harris sank two free throws, then made a 3 that pulled Philly within 99-98. Embiid, who finished 7 of 25 from the floor, tied it at 100-all on a jumper.\n\n\r\n              Jaren Jackson Jr. hit a pair of tough buckets at the rim to put Memphis back ahead by four.\n\n\r\n              Harden, though, hit one of his six 3-pointers, Harris made it 106-105 with his 3, and Embiid scooped a loose ball for a dunk that sealed the comeback. Harris finished with 20 points.\n\n\r\n              “We've had a lot of games likes this where we get off to slow starts and have to make a comeback,” Harris said.\n\n\r\n              The Grizzlies stumbled before the All-Star break, losing eight of nine before a 3-1 streak to end the first half. Desmond Bane scored 25 points, Jackson had 18 and Morant 15 for the Grizzlies.\n\n\r\n              “There's going to be struggles. There's going to be adverse moments throughout the season,” Memphis coach Taylor Jenkins said. “We've got to learn to get better from it. We found a way to win a couple of games going into the break, kind of on our terms.”\n\n\r\n              Embiid had a non-COVID illness that perhaps played a role in one of his worst first halves in recent memory. He most recently played in Sunday's All-Star Game, scoring 32 points in 27 minutes.\n\n\r\n              Whatever the reason, Embiid missed his first six shots and Sixers fans booed when he tossed up a 28-foot airball in the second quarter. He was 2 of 14 for nine points in the half. Embiid entered second in the NBA in scoring at 33.1 points on 54% shooting from the floor.\n\n\r\n              “He's human,” Rivers said. “I think most of the shots he liked.”\n\n\r\n              Maybe not when he drove down the lane for a thunderous one-handed dunk attempt that was soundly rejected by Jackson and led to a Memphis bucket for a 52-35 lead.\n\n\r\n              The block encapsulated how badly Memphis had its way with the Sixers.\n\n\r\n              “We had nothing,” Rivers said.\n\n\r\n              Bane hit four 3s and scored 19 points in the first quarter. He had 21 at the half and the Grizzlies raced to an early 17-point lead.\n\n\r\n              It just wasn't enough against the Harris-Embiid-Harden trio.\n\n\r\n              TIP-INS\n\n\r\n              76ers: Dunk contest champion Mac McClung rang the ceremonial bell. McClung is on a two-way contract with the 76ers and plays in the G League. ... C Dewayne Dedmon sat out with left hip tightness. ... Harden reached out to a Michigan State student left paralyzed after a gunman shot and killed three students and injured five others. Harden told John Hao to “stay strong” in a video message.\n\n\r\n              Grizzlies: Made 11 of 21 shots in the first quarter but missed their last six shots of the game.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Play Saturday at Denver.\n\n\r\n              76ers: Host Boston on Saturday and Miami on Monday before they open March with a stretch of 12 of 15 road games.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994182.333948
}