{
  "game_id": "0021501110",
  "espn_id": "400828997",
  "date": "Mar 29, 2016",
  "matchup": "OKC @ DET",
  "headline": "Pistons hold off Durant-less Thunder, 88-82",
  "body": "AUBURN HILLS, Mich. -- There would be no apologies from Stan Van Gundy after his Detroit Pistons caught a break against Oklahoma City.\nMarcus Morris scored 24 points, and the Pistons took advantage of Kevin Durant's absence in an 88-82 victory over the Thunder on Tuesday night.\nOklahoma City rested Durant and Serge Ibaka, and the Thunder scored only nine points in the third quarter en route to their lowest-scoring game of the season.\n\n\"They're not going to give us back the Denver game before the break when (the Pistons) had three starters missing,\" said Van Gundy, Detroit's coach. \"People sit people out. That's the way it goes.\"\nThe Thunder rallied from a 15-point deficit, closing the gap to just one in the fourth, but Detroit was able to hold on late for another victory in its push for a playoff spot. The Thunder had their eight-game winning streak snapped. Russell Westbrook led Oklahoma City with 24 points on 8-of-28 shooting.\nAndre Drummond had 13 points and 15 rebounds for the Pistons, and Tobias Harris added 17 points.\nThe Pistons came into the night with a 2 1/2-game lead in the race for the final playoff spot in the Eastern Conference, and the victory Tuesday actually moved them into seventh place, a half-game ahead of Indiana. Detroit trailed 48-46 at halftime before outscoring the Thunder 25-9 in the third quarter.\n\"I keep looking at the stat sheet and shaking my head,\" said Oklahoma City's Randy Foye, who scored nine points. \"I know we didn't have Kev tonight, and he's obviously our MVP, but we have to win that game. We had terrible shot selection, and we kept turning over the ball. You can't shoot yourself in the foot all night and expect to beat an NBA team.\"\nThe Pistons led 68-53 after a 20-2 run, but Oklahoma City rallied in the fourth. Detroit led 75-74 before consecutive baskets by Morris and Reggie Jackson pushed the lead back to five. It was 79-77 after a 3-pointer by Westbrook, but Drummond made a free throw and Jackson slipped free for a dunk.\nAnother 3-pointer by Westbrook made it 84-82 with 8.8 seconds left, but Jackson made two free throws at the other end, and the Pistons were able to close out the victory.\nThe Thunder were held 28 points below their previous scoring average. Westbrook missed his first six shots from the field and finished the first quarter 1 of 9. Detroit had assists on its first eight field goals and led 25-21 after the first.\n\"We were ready for the two-headed monster, but if you find out K.D. is out, we can't let our guards down,\" Jackson said.\nOFF THE MARK\nVan Gundy sat down at his news conference after the game and summed up the night as follows:\n\"I guarantee you, you will not see that on NBA classics.\"\nDetroit's starting backcourt of Jackson and Kentavious Caldwell-Pope went 7 of 31 from the field.\nWHEN TO REST\nThunder coach Billy Donovan said before the game he can't worry too much about who his team is facing when he decides to rest players down the stretch.\n\"We have to make decisions of what's best for our team,\" Donovan said. \"It's not necessarily who we're playing against, but where we're at right now -- physically, mentally, emotionally. Games, minutes, all those things, I think you have to evaluate that after games and do what's best for your team.\"\nTIP-INS\nThunder: Oklahoma City fell to 6-8 in the second game of back-to-back sets. ... The Thunder's previous season low was 85 points against Boston on Nov. 15.\nPistons: Detroit has one game left in a nine-game homestand. The Pistons are 6-2 so far.\nUP NEXT\nThunder: Host the Los Angeles Clippers on Thursday night.\nPistons: Host Dallas on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994126.995391
}