{
  "game_id": "0022300553",
  "espn_id": "401585181",
  "date": "Jan 14, 2024",
  "matchup": "MIN vs. LAC",
  "headline": "T-wolves hold off Clippers 109-105 with big help from Edwards and Gobert",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 20 of his 33 points in the third quarter and Rudy Gobert had 15 points and 18 rebounds to help the Minnesota Timberwolves cool off the Los Angeles Clippers 109-105 on Sunday.\n\n\r\n              Norman Powell's corner 3-pointer — his sixth of the game — capped a 20-6 surge by the Clippers over a four-plus-minute stretch that sliced their deficit to 103-100. \n\n\r\n              Gobert, who missed seven free throws including earlier back-to-back airballs that had the Clippers bench doubling over in derisive laughter, made four foul shots in the final minute to nudge the Wolves to the finish line on a night when they had 19 turnovers and allowed 37 points in the fourth quarter.\n\n\r\n              “Getting all the rebounds and making sure they don’t get finishes at the rim, he was great tonight,” Edwards said. \"He was up, blocking mid-ranges and stuff like that. Defensive Player of the Year, for sure.”\n\n\r\n              Karl-Anthony Towns scored 17 points for the West-leading Wolves (28-11), who held Clippers stars Paul George (16 points) and James Harden (14 points) to a combined 9-for-33 shooting from the floor. The Wolves, who lead the NBA in scoring defense, are 16-2 at home and 20-6 against their conference.\n\n\r\n              “We just didn’t have the smartest game today,\" Clippers coach Tyronn Lue said. “Ant was a monster. Rudy was huge for ’em. They played well.” \n\n\r\n              Kawhi Leonard had 26 points and nine rebounds to steer the Clippers (25-14), who had won 17 of their last 20 games and eight of nine before this. The Clippers made Ivica Zubac a last-minute scratch with tightness in his right calf, and the 7-foot Croatian was clearly missed in his first absence of the season.\n\n\r\n              Gobert had four blocks for the Wolves and took a two-handed shove to the neck from Terrance Mann after the Clippers guard reacted to a high screen in the third quarter. Their staredown didn't escalate beyond that, but the tension between two potential postseason opponents was apparent in the packed arena on a frigid evening. The Wolves successfully stayed true to their go-big philosophy, even after the Clippers went in small ball mode.\n\n\r\n              “We talk about winning that battle with that guy in front of you all the time,\" coach Chris Finch said. “I think when you have Rudy behind you playing the way he’s playing, it gives you even more confidence.”\n\n\r\n              Zubac was listed as questionable, then announced as a starter when the lineups were posted a half-hour before tipoff, but he was ultimately ruled out for the game and replaced by Daniel Theis. Mason Plumlee, who’s played sparingly since returning from a knee injury, joined the rotation for the night too as the Clippers tried to contend with the enviable collection of big men the Wolves have assembled.\n\n\r\n              Powell scored 24 points and Russell Westbrook had 12 points and 13 assists for the Clippers off the bench to help offset the off night for George and Harden. Edwards had a lot to do with that, and he had plenty of energy on the offensive end as usual, too.\n\n\r\n              “He sees double teams every night. He sees a lot of different defenses that are thrown at him,” Lue said. “Not only is he scoring, but he’s making the right pass, making the right read.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host Oklahoma City on Tuesday. \n\n\r\n              Timberwolves: Visit Detroit on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996473.460629
}