{
  "game_id": "0021900725",
  "espn_id": "401161367",
  "date": "Jan 31, 2020",
  "matchup": "OKC @ PHX",
  "headline": "Thunder rally in final minutes, push past Suns 111-107",
  "body": "PHOENIX --  One day after Oklahoma City's Chris Paul earned his first All-Star selection in four years, the veteran point guard gave a good reminder of why he's still one of the NBA's best players.\n\nPaul ripped a steal away from Phoenix's Kelly Oubre Jr. and then made the go-ahead jumper with 1:03 left, and the Thunder held on for a 111-107 victory over the Suns on Friday night.\n\nIt was another big moment in a surprisingly successful season for Paul and the Thunder. They've won seven straight road games and have a 30-20 record, including a 24-9 mark since Thanksgiving. A big reason for those wins is Paul's continued excellence, even at 34 years old.\n\n\"It's been special. It's been a lot of fun,\" Paul said. \"Our team has been unbelievable and that's been the best part about it. It's always an honor and privilege to be named an All-Star, especially after not doing it for four years.\"\n\nDanilo Gallinari led Oklahoma City with 27 points and Dennis Schroder added 24. Paul finished with 20 points and 10 assists.\n\nOklahoma City used a 13-0 run late in the fourth quarter to flip a 99-92 deficit into a 105-99 lead with 25 seconds left and held on. Schroder drained a 3-pointer during the rally to tie the game at 99, and Paul hit the go-ahead jumper to make it 101-99.\n\n\"We just tried to finish, especially when we get to four- or five-minute mark,\" Paul said. \"That's winning time. That's when the really good teams lock in.\"\n\nThe Suns led 81-79 going into the fourth quarter after Jevon Carter hit a 3 in the final seconds of the third and pushed their lead to 99-92 with 4:30 remaining on Deandre Ayton's layup. But then they didn't score for more than four minutes, missing seven straight shots as the Thunder rallied.\n\nIt was an entertaining game that featured 21 lead changes, which tied a season high for the Thunder.\n\nPhoenix was led by Devin Booker and Oubre, who both scored 27 points. Oubre made a 3 with 9.5 seconds left that pulled the Suns to 107-106, but Shai Gilgeous-Alexander hit two free throws on the ensuing possession to put the Thunder up three.\n\n\"We had our chances,\" Suns coach Monty Williams said. \"We turned it over 22 times. They had 15 offensive rebounds. That is a lot of extra possessions to give a team that has as good of a guard trio as those guys.\"\n\nSchroder sank a 3-pointer with eight seconds left in the second quarter to put the Thunder ahead 53-52 at halftime. Schroder and Gallinari had 12 points apiece in the first half, while Booker led the Suns with 14.\n\nREMEMBERING KOBE\n\nThe Suns held 24 seconds of silence before the game to honor Kobe Bryant, his 13-year-old daughter Gianna and the seven others who died in Sunday's helicopter crash. The public address announcer also read several of Bryant's on-the-court and off-the-court accomplishments, and the crowd chanted \"Kobe, Kobe\" for several seconds afterward.\n\nHEARING THE BOOS\n\nPaul was booed every time he touched the ball for most of the first half.\n\nThe apparent reason? He made the Western Conference All-Star team when the reserves were announced Thursday and was likely one of the players who bumped Booker for one of the final spots.\n\nPaul got the last laugh with his clutch bucket that put the Thunder ahead late, and he hit multiple free throws in the final minute.\n\nTIP-INS\n\nThunder: Starting center Steven Adams picked up three fouls in less than seven minutes in the first half. That squashed a potentially good start to the game after he had two quick baskets in the opening minutes. ... Starting guard Luguentz Dort played in college at Arizona State and this was his first game against the Suns. He had eight points.\n\nSuns: F Dario Saric sprained his left ankle in the first quarter and didn't return. He played just four minutes. ... Phoenix was playing without F Aron Baynes (left hip soreness), G/F Cameron Johnson (bruised right quad) and F Frank Kaminsky III (right patella stress fracture). Baynes has missed the past five games, Johnson the past six and Kaminsky the past 14.\n\nUP NEXT\n\nThe Thunder return home to face the Cavaliers on Wednesday\n\nThe Suns play at Milwaukee on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996212.2808042
}