{
  "game_id": "0022200588",
  "espn_id": "401468743",
  "date": "Jan 06, 2023",
  "matchup": "DEN vs. CLE",
  "headline": "Jokic, Murray help Nuggets top Mitchell-less Cavs 121-108",
  "body": "DENVER -- — Nikola Jokic had 28 points, 15 rebounds and 10 assists, Jamal Murray scored 18 points in his first back-to-back games since knee surgery, and the Denver Nuggets took advantage of Donovan Mitchell's absence to beat the Cleveland Cavaliers 121-108 on Friday night. \n\n\r\n              Jokic hit 10 of 17 shots, including 3 of 4 from 3-point range in his NBA-leading 10th triple-double of the season.\n\n\r\n              “He sees things before they happen,” said Bruce Brown, who added 13 points. \n\n\r\n              Added Cleveland's Kevin Love: “Jokic looks like he's on the way to potentially a third (straight) MVP.” \n\n\r\n              Michael Porter Jr. scored 16 points for Denver, which shot 51.5% from the floor and hit 17 of 33 3-pointers in its 12th win in 15 games. \n\n\r\n              Caris LeVert scored 22 points and Darius Garland returned from a three-game absence to score 21 points for the Cavaliers, who had their three-game win streak snapped. \n\n\r\n              Mitchell sat out to rest four days after scoring 71 points in an overtime win over Chicago. Garland, who had a right thumb sprain, hit 8 of 20 shots while adding eight assists despite getting chopped on his thumb again. \n\n\r\n              But the Cavs were undone by Denver's hot shooting and their own 18-for-32 performance from the foul line in the opener of a five-game trip. \n\n\r\n              “I don't think we gave them our best shot,” Cavaliers coach J.B. Bickerstaff said. “You don't miss that many free throws if you're locked in. ... I don't think we had the right approach to beat a team like that.\" \n\n\r\n              The Nuggets overcame a second delay for a crooked rim at Ball Arena this week. The stoppage occurred with 11:22 left when Cavs players noticed the same rim that caused a 35-minute delay Sunday against Boston on Sunday was off again. \n\n\r\n              “Not again,” Jokic said when asked what he was thinking.\n\n\r\n              A crew returned with the same two orange ladders from Sunday and leveled the rim in just shy of 10 minutes. \n\n\r\n              “At least they fixed it fast this time,\" Brown said. \n\n\r\n              Murray missed all of last season with a torn left ACL, and Nuggets coach Michael Malone called Murray playing on consecutive days “uncharted territory.” Murray only played 21 minutes Thursday as the starters rested much of the second half in a home rout of the Los Angeles Clippers.\n\n\r\n              “I'm just so proud of him,\" Malone said. “It's got to be close to 600 days since he's played a back-to-back. This is a big, big step.\"\n\n\r\n              Murray was key in a 13-4 run to start the third quarter that put Denver ahead to stay. After Jokic hit 3-pointers on the first two possessions, Murray had an acrobatic, one-handed rebound and put-back and his own 3. \n\n\r\n              MITCHELL SITS \n\n\r\n              Mitchell acknowledged “I didn't have my legs” after shooting 6 of 20 from the field Wednesday. He played 50 minutes and took 34 shots in his 71-point game two days earlier. \n\n\r\n              “We've put a heavy toll on him. With Darius being out, he's had to have the ball in his hands. His usage has been crazy. His minutes have been crazy,” Bickerstaff said on the reason to rest him. “Our goals is always to do what's best for our guys and running him into the ground is not what's best for him.” \n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Bickerstaff said F Dean Wade, out since Dec. 2 with a left shoulder sprain, is close to returning. ... G Ricky Rubio, recovering from a torn left ACL, has progressed to 5-on-5 play. ... The Cavs had a season-high 11 offensive rebounds in the first half. \n\n\r\n              Nuggets: They've won 10 straight home games and are 16-3 at Ball Arena.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Phoenix on Sunday night. \n\n\r\n              Nuggets: Host the Los Angeles Lakers on Monday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994707.083835
}