{
  "game_id": "0022200990",
  "espn_id": "401469145",
  "date": "Mar 08, 2023",
  "matchup": "PHX vs. OKC",
  "headline": "Booker, Ross help Suns rout Thunder after Durant injured",
  "body": "PHOENIX -- — Kevin Durant's expected home debut was over before it started after a pregame mishap.\n\n\r\n              Devin Booker was more than willing — and able — to pick up the scoring load.\n\n\r\n              Booker scored 44 points, Terrence Ross added 24 and the Phoenix Suns beat the Oklahoma City Thunder 132-101 on Wednesday night after losing Durant to an ankle injury during pregame warmups.\n\n\r\n              Phoenix has won four straight games, but that was almost an afterthought following Durant’s injury. Even Booker admitted the game was a bit of bummer without their newest star on the floor.\n\n\r\n              “The city's been waiting on this, it was a big day,” Booker said. “We'll reschedule the party. The people that missed out on it tonight, I tried to give them a little something to make it better.”\n\n\r\n              A 13-time All-Star, Durant was added in a blockbuster trade deadline deal with Brooklyn and the Footprint Center was buzzing in anticipation of his home debut. But he rolled his left ankle while driving to the basket as he prepared to play. \n\n\r\n              The 6-foot-10 forward immediately hopped up and was walking, but several minutes later, the Suns confirmed that he would miss the game. Coach Monty Williams said he wasn't sure how much more time Durant would miss.\n\n\r\n              “We’ll get more testing done tomorrow,” Suns coach Monty Williams said. “Right now, it’s just an ankle sprain and we don’t have anything official to report.”\n\n\r\n              With Durant out, Suns fans had to settle for a scoring show by Booker, who had 30 points in the first half. \n\n\r\n              The three-time All-Star shot 17 of 23 from the field — making 6 of 10 3-pointers — and received a standing ovation in the fourth quarter when he checked out of the game for the last time. He did his scoring in just 28 minutes on the court.\n\n\r\n              Ross also was 6 of 10 from 3-point range. Chris Paul had 18 points and nine assists. He made 4 of 5 3-pointers.\n\n\r\n              Oklahoma City played without All-Star guard Shai Gilgeous-Alexander because of “abdominal strain injury management.” The Thunder were overmatched without him and the Suns pulled away in the second half.\n\n\r\n              Lindy Waters III led the Thunder with 23 points. He made six 3-pointers and was just two points shy of his career high.\n\n\r\n              Durant has played three games with the Suns — all on the road and all wins — but this was supposed to be his first game at home in front of a sellout crowd. He averaged 26.7 points and 7.3 rebounds in the three games.\n\n\r\n              His next chance to play at home will be Saturday against the Kings.\n\n\r\n              “I know how much he loves to play and wanted to play,” Paul said. “But stuff happens.”\n\n\r\n              Phoenix added Durant and T.J. Warren at the trade deadline, sending Mikal Bridges, Cam Johnson, Jae Crowder, four first-round picks and other draft compensation to the Brooklyn Nets.\n\n\r\n              The Suns pushed to a 34-21 lead after one quarter and had a 60-52 advantage at halftime. Booker shot 11 of 15 from the field in the first half while Waters had scored 21 for the Thunder.\n\n\r\n              “Obviously, Booker was great tonight,” Thunder coach Mark Daigneault said. “Their offense was cooking and we didn’t do a good enough job offensively to keep pace with them.”\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Gilgeous-Alexander was one of five players out with injuries. ... Josh Giddey shot just 3 of 12 from the field and finished with 10 points. \n\n\r\n              Suns: G Landry Shamet (right foot soreness) was not available. ... Hosted a 58th consecutive sellout crowd. ... Booker's six 3-pointers tied his career high in the regular season. He's hit that mark 21 times.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At New Orleans on Saturday night.\n\n\r\n              Suns: Host Sacramento on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995064.894625
}