{
  "game_id": "0022401222",
  "espn_id": "401736815",
  "date": "Dec 16, 2024",
  "matchup": "CHA vs. PHI",
  "headline": "Maxey scores 40, George adds 33 as 76ers top Hornets 121-108 to spoil Ball's return to the floor",
  "body": "CHARLOTTE, N.C. -- — Tyrese Maxey scored 40 points, Paul George added 33 points as the Philadelphia 76ers spoiled LaMelo Ball’s return to the floor with a 121-108 win over the Charlotte Hornets on Monday night. \n\n\r\n              Maxey and George were combined for 12 for 21 on 3-pointers.\n\n\r\n              Kelly Oubre Jr. had 19 points, while Andre Drummond, starting in place of the injured Joel Embiid, chipped in with 15 rebounds for the 76ers (8-16).\n\n\r\n              Miles Bridges had 24 points and Nick Richards added 19 points off the bench to lead the Hornets.\n\n\r\n              Ball returned to action after missing the last seven games with a strained calf, finishing with 15 points and 11 assists in nearly 26 minutes.\n\n\r\n              Ball's return meant the Hornets (7-19) finally had their preseason projected starting five on the floor together for the first time this season. But that lasted a little more than three quarters as Brandon Miller sprained his left ankle with 8:20 remaining in the game on a drive to the basket and did not return.\n\n\r\n              Takeaways\r\n              76ers: With Joel Embiid out with a sinus fracture, George and Maxey had to carry the load. And they certainly did that, particularly in the first half when they combined for 44 of Philadelphia’s 54 points while shooting 9 of 16 from beyond the arc.\n\n\r\n              Hornets: The Hornets starting five struggled all night to get in sync and 76ers did an outstanding job of not letting Miller get free for open looks.\n\n\r\n              Key moment\r\n              Shortly after the Hornets had cut the 76ers lead to five, George hit a short fadeaway jumper in the lane and drew a foul for a 3-point play, helping push the lead back to 13.\n\n\r\n              Key stat\r\n              The Hornets shot 11 of 19 from the foul line.\n\n\r\n              Up next\r\n              The 76ers host the Hornets on Friday night. The Hornets visit the Wizards on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997456.261508
}