{
  "game_id": "0021700101",
  "espn_id": "400974852",
  "date": "Oct 31, 2017",
  "matchup": "SAC @ IND",
  "headline": "Bogdanovic leads Pacers to 101-83 rout of Kings",
  "body": "INDIANAPOLIS --  A strong first-half allowed the Indiana Pacers starters to rest for most of the second half.\n\nBojan Bogdanovic scored 17 points to lead a balanced Indiana offense and help the Pacers to a 101-83 rout of the Sacramento Kings on Tuesday night.\n\nThe Pacers (4-3) scored the first nine points and built a 55-30 lead at the half.\n\n\"We got to do some cheering today,\" Pacers guard Victor Oladipo said of reserves receiving quality minutes in a blowout.\n\nIndiana second-year forward Domantas Sabonis, coming off a personal-best 22 points and 12 rebounds on Sunday, had a double-double in the first half with 10 points and 12 rebounds. He finished with a career-high 16 rebounds in addition to 12 points and five assists.\n\nSabonis was actually sick the previous day.\n\n\"I laid in bed and tried to recover and get ready for today,\" he said. \"I'm just coming out there and proving to people that I can play.\"\n\nPacers coach Nate McMillan was particularly pleased with his team meeting the per game goal of 25 assists.\n\n\"We want that ball moving,\" he said. \"What we're trying to do is create other opportunities to where we get open looks as opposed to contested shots. If we're dishing out 25 assists or more, everybody is touching the ball and it's very difficult to defend that type of movement.\"\n\nRookie guard De'Aaron Fox led the Kings (1-6) off the bench with 18 points. Fox has already matched the loss total in his only college season at Kentucky, which finished 32-6.\n\n\"It's different,\" he said. \"For me, I've never really lost in my life. It's just a hump we need to get through.\"\n\nTIP-INS\n\nKings: Five different players have led Sacramento in scoring in seven games. This was the third time Fox has had the most points. ... They've been outrebounded in each of their six losses, and by a combined 283-198.\n\nPacers: Oladipo, acquired with Sabonis in an offseason trade that sent All-Star guard Paul George to Oklahoma City, had led his team in scoring in the previous six games. . Third-year forward/center Myles Turner missed his sixth consecutive start due to a concussion and sore neck, but is close to returning after completing a normal practice workout on Tuesday.\n\nPOINT SWITCH\n\nEach team has a starting point guard who used to suit up for the other side. Pacers point guard Darren Collison, in his second stint with Indiana, played the previous three seasons for the Kings. Indianapolis native and longtime Pacers fan favorite George Hill returned to face his hometown team, which traded the point guard to Utah in a three-team, offseason deal in 2016. Hill, who had played five seasons for the Pacers, signed with the Kings in the offseason and has averaged 9.8 points and 3.0 assists in five starts. Hill averaged a career-high 16.9 points for the Jazz last season.\n\nBOGDANOVIC TIMES TWO\n\nThey share the same, unusual, lengthy last name, but aren't related. Small forward Bojan Bogdanovic, who signed as a free agent with the Pacers for his fourth NBA season, is from Croatia. Kings rookie shooting guard Bogdan Bogdanovic, three years younger at 25, is from Serbia.\n\nUP NEXT\n\nKings: Wednesday they travel to Boston, which hasn't lost at home to Sacramento since 2007.\n\nPacers: Wednesday they travel to Cleveland to face LeBron James.",
  "source": "espn_api",
  "crawled_at": 1764993300.6296132
}