{
  "game_id": "0022300080",
  "espn_id": "401584708",
  "date": "Oct 27, 2023",
  "matchup": "MIA @ BOS",
  "headline": "White scores 28, Celtics outlast Heat 119-111 in rematch of Eastern Conference finals",
  "body": "BOSTON -- — So much has changed for the Miami Heat and Boston Celtics since their seven-game slugfest in the playoffs last season. \n\n\r\n              It hasn’t taken an ounce out of the rivalry’s intensity. \n\n\r\n              Derrick White had 28 points, including five 3-pointers, and the Celtics rallied to beat the Heat 119-111 on Friday night in a rematch of last season’s Eastern Conference finals.\n\n\r\n              Jaylen Brown added 27 points and six rebounds. Jayson Tatum finished with 22 points in the latest matchup of the East rivals, who’ve met in the conference finals three of the past four seasons. \n\n\r\n              On a team that has ridden the exploits of Tatum and Brown during their most recent playoff runs, this time it was White who shined down the stretch, scoring 14 fourth-quarter points.\n\n\r\n              “I've been here a couple of years and I know where guys are supposed to be at,\" White said. “I'm just trying to get people in the right spots and lead from that way.”\n\n\r\n              Said Tatum: \"The talent has always been there. He's just starting to show more emotion. ... I try to tell him to always be aggressive, don't just look for me.”\n\n\r\n              He didn't, and the Celtics improved to 2-0 with a new-look roster that is showing a poise late in games that it didn't at times last season. \n\n\r\n              Boston and Miami split their four meetings last season. Miami then emerged in the playoffs after a seven-game slugfest in which it had a 3-0 series lead erased before beating the Celtics in Game 7 in Boston to advance to its seventh NBA Finals.\n\n\r\n              Friday’s matchup, the first of their three this season, at times felt like an extension of that series. \n\n\r\n              Neither team led by more than five points at the end of any of the first three periods, as both teams hovered near 50% shooting from the field. There were six ties and six lead changes on the night.\n\n\r\n              Tyler Herro, who sat out the conference finals with a hand injury, had 28 points and five of Miami’s 16 3-pointers. \n\n\r\n              “I liked our fight,” Herro said. “Obviously, there's no moral victories in this. But Game 2, I think there's a lot to take away from tonight.”\n\n\r\n              Bam Adebayo added 27 points and seven rebounds. Jimmy Butler finished with 14 points on 3-of-11 shooting. \n\n\r\n              “We’ve had this with them for four years since the (Florida) bubble. And literally it’s been a privilege to face them so many times. But both teams have changed. That’s the way this league goes. That’s the way life goes,” Heat coach Erik Spoelstra said. \"You just want to compete against teams you respect and have had battles with. They were better at it tonight.”\n\n\r\n              Miami led 88-87 entering the fourth quarter before Boston nudged in front 96-90 led by White, who scored eight straight Celtics points. \n\n\r\n              Boston’s lead grew to 109-102 with just over four minutes to play before Adebayo blocked Brown’s shot from behind. Butler collected the loose ball, sprinted ahead and was going in for a dunk when a trailing White chased him down and blocked Butler’s dunk attempt.\n\n\r\n              “The plays he made tonight were sick. They were just sick plays,\" Celtics coach Joe Mazzulla said. \"It’s the only way you can describe it.”\n\n\r\n              A turnover by White gave the ball back to Miami and Butler drew Kristaps Porzingis’ sixth foul on a putback attempt. Butler then knocked down two free throws to cut the Celtics' lead to 109-104. \n\n\r\n              Boston got it back up to 112-104 on a layup by Brown and free throw by Tatum. \n\n\r\n              But another Heat flurry, capped by a 3-pointer by Kevin Love, cut the lead to 114-111 with 59 seconds to play. \n\n\r\n              White was fouled and connected on both free throws. Herro got open for another 3-point try but came up empty. The Celtics pushed the ball up the floor and Brown sealed it with a 3 from the wing. \n\n\r\n              “Tonight we were intentional,” Mazzulla said. “We attacked the right matchups. We got to our spots. ... We still didn't play great fourth-quarter basketball. But for Game 2 of what we're trying to get to it was a good start.” \n\n\r\n              The Celtics began the night by honoring the victims of this week’s mass shooting in Lewiston, Maine with several acknowledgements. Boston players wore the warmups of their G League affiliate, the Maine Celtics. In addition, the Celtics donned a “Maine” band on their jerseys in honor of the state as it recovers after a shooter killed 18 people and wounded 13 at a bowling alley and a bar there. \n\n\r\n              The remembrances also included a pregame moment of silence. \n\n\r\n              UP NEXT\n\n\r\n              Heat: Continue three-game road trip at Minnesota on Saturday.\n\n\r\n              Celtics: At Washington on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995400.867244
}