{
  "game_id": "0021500976",
  "espn_id": "400828863",
  "date": "Mar 12, 2016",
  "matchup": "DET @ PHI",
  "headline": "Pistons use big second half to blow by 76ers, 125-111",
  "body": "PHILADELPHIA --  One sizzling half was enough to beat lowly Philadelphia, but not to please Stan Van Gundy.\n\nKentavious Caldwell-Pope scored 23 points, Tobias Harris added 21 and the Detroit Pistons beat the 76ers 125-111 on Saturday night.\n\nTrailing 57-52 at halftime, the Pistons shot 15 for 20 in a 38-point third quarter and finished with 73 points over the final two periods while erasing two 10-point deficits.\n\nHowever, Van Gundy didn't want to talk about his team shooting 66 percent from the field in the second half. It didn't matter to him that all five of his starters registered at least 19 points. It was of little importance that his team was able to maintain its precarious grip on the final playoff spot in the Eastern Conference.\n\nNo, what mattered to Van Gundy was that his team's defense was subpar.\n\n\"Look, we didn't play very well,\" Van Gundy said. \"Our turnovers were disastrous. We didn't guard very well again. That's what's going to get us. It's going to be tough to beat good teams. We couldn't keep the ball in front of us. Our closeouts were terrible.\n\n\"We play about eight minutes of defense a night. My experience is that's not going to be enough.\"\n\nReggie Jackson scored 15 of his 24 points in the first half for the Pistons, who put all five starters in double figures. Andre Drummond had 19 points and 15 rebounds, while Marcus Morris also finished with 19 points.\n\nThe Pistons were sloppy in the first half, committing nine turnovers and giving up 57 points to a depleted Sixers team with five players in street clothes on the bench.\n\n\"There was some yelling that took place at halftime,\" Jackson said. \"But we talked about it ourselves and said we just need to go out and get this win and we got it.\n\n\"We're still in the No. 8 spot. It's that simple. That's all that matters.\"\n\nIsaiah Canaan finished with 20 points for the Sixers. He and Pistons guard Steve Blake had a heated exchange in the fourth quarter that led to each being assessed a technical foul.\n\n\"There was a little trash talk going on and it got a little fiery out there, but that's not necessarily a bad thing,\" Blake said. \"It's fun.\"\n\nCaldwell-Pope hit a 3-pointer at the end of the third quarter to put the Pistons ahead by three and that momentum carried into the fourth quarter as the Sixers couldn't slow down the Pistons.\n\n\"We (have to) give them credit,\" said Sixers coach Brett Brown. \"They're trying to make the playoffs. That period at the end of the third, that 35-second window when we go up two, they score, we throw it away, they hit a buzzer 3 to go into the fourth period. It's momentum-turning.\n\n\"Then they jumped us. They came out and hit us hard to start the fourth.\"\n\nCarl Landry and Ish Smith each finished with 18 points for Philadelphia. Landry's total matched a season high.\n\nTIP-INS\n\nPistons: Detroit has several Philadelphia-area connections on its roster. Darrun Hilliard starred at nearby Villanova University in college while Marcus Morris was born and played high school basketball in Philadelphia. Assistant coach Malik Allen is from nearby Willingboro, New Jersey and like Hilliard also played at Villanova. Jodie Meeks played for the 76ers from 2010-12.\n\n76ers: This was the first time the 76ers were swept in a four-game season series by the Pistons since the 1995-96 season. . The Sixers are now 1-13 this season in the second of back-to-back games. . The Sixers had a ceremony at halftime to retire the number of Hall of Fame member Dolph Schayes. Schayes died last December at the age of 87. Voted as one of the 50 greatest players in NBA history, Schayes spent most of his career with the Syracuse Nationals, the precursor of the 76ers. Nerlens Noel will continue to wear No. 4, Schayes' number, in honor of the 12-time All-Star.\n\nINJURY NEWS\n\nMeeks, who has missed almost the entire season while recovering from a fractured foot, dressed for the first time in 64 games, but Van Gundy chose not to play him. The 76ers' Robert Covington, who was taken off the court on a stretcher and spent the night in a Philadelphia hospital after being accidentally kicked in the face by teammate Jerami Grant in Friday's victory over Brooklyn, was released from the hospital Saturday and should be back soon. Brown said he will likely miss the Sixers' next game in Brooklyn and then will be re-evaluated. Grant was also injured on the same play and is in the NBA concussion protocol. Brown said he could play Tuesday. Richaun Holmes also was injured Friday. He suffered a strained Achilles' tendon that could sideline him up to 10 days.\n\nFROM DOWNTOWN\n\nPistons: Detroit shot 50 percent from 3-point territory and made six of its final nine attempts to pull away in the fourth quarter.\n\nUP NEXT\n\nPistons: Visit Washington on Monday night.\n\n76ers: Visit Brooklyn on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994905.268959
}