{
  "game_id": "0022201082",
  "espn_id": "401469237",
  "date": "Mar 21, 2023",
  "matchup": "LAC vs. OKC",
  "headline": "George leaves with injury as Clippers lose to Thunder",
  "body": "LOS ANGELES -- — Paul George went down hard in the fourth quarter. He may have taken the Los Angeles Clippers' championship hopes with him.\n\n\r\n              George got hurt in Tuesday night's 101-100 loss to Shai Gilgeous-Alexander and the Oklahoma City Thunder.\n\n\r\n              The star guard hit the court after getting fouled by Luguentz Dort with 4:38 remaining. He lay on his back for several minutes before being helped to his feet. Supported by staff on either side, George headed to the locker room, appearing unable to put any weight on his right leg.\n\n\r\n              “I went up for the rebound, kind of hit his leg,” Dort said. “I didn’t do it on purpose, definitely an accident.”\n\n\r\n              There was no immediate update on George after the game. Clippers coach Tyronn Lue said he was still being evaluated. George later left the arena on the back of a cart with his right leg extended.\n\n\r\n              George's running mate, Kawhi Leonard, said he hadn't spoken to George afterward.\n\n\r\n              “I didn't see the play,” Leonard. “I just thought he got hit in the face at the time.”\n\n\r\n              George had 18 points, seven rebounds and five assists. Potentially losing him so close to the end of the regular season could put the Clippers' postseason aspirations in jeopardy.\n\n\r\n              “Next man up,” Leonard said about the possibility of playing without George. “We got a group of guys that still want to win, like to play basketball, so we’ll see what happens.”\n\n\r\n              Gilgeous-Alexander scored 31 points against his former team. Jalen Williams added 20 points for the Thunder.\n\n\r\n              George had a highlight-reel dunk in the third, rotating 360 degrees before slamming the ball in the hoop as the crowd cheered.\n\n\r\n              Leonard and George stepped up in the second half after shooting a combined 5 of 16 in the first half, but it wasn't enough. Leonard finished with 21 points.\n\n\r\n              “I just didn’t think we played right the whole night offensively,” Lue said. “We played too slow and didn’t share the ball. When we don’t play a good brand of basketball this is the results you get.”\n\n\r\n              The game was tied 91-all when George went down. Leonard scored before the Thunder ran off six points in a row to take a 97-93 lead. \n\n\r\n              Nicolas Batum hit a jumper to pull the Clippers to 101-100. The Clippers lost a coach's challenge of an out-of-bounds call with 30 seconds left. The Thunder inbounded, but missed a shot and Leonard grabbed the rebound.\n\n\r\n              Leonard dribbled down the final seconds when the Clippers didn't have any timeouts left. He was hounded by Thunder defenders and didn't get a shot off.\n\n\r\n              “I'll take ownership of it,” Leonard said. “Definitely should have gotten a shot off.”\n\n\r\n              The teams kept it close throughout the third. Gilgeous-Alexander scored the Thunder's final 10 points and they trailed 81-80 going into the final period.\n\n\r\n              The Clippers blew a 14-point lead to start the game. They opened on an 18-4 run, but the Thunder tied it minutes later. \n\n\r\n              TIP-INS\n\n\r\n              Thunder: Improved to 14-21 on the road against the West. ... Won five of six overall.\n\n\r\n              Clippers: Leonard received a technical and Terance Mann got hit with two technicals at 4:24 of the second period. Mann was ejected. Leonard said he was told he got whistled for clapping in the referee's face. “I didn't believe it,” he said.\n\n\r\n              UP NEXT\n\n\r\n              The teams play again Thursday night in Los Angeles.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994952.866261
}