{
  "game_id": "401810064",
  "espn_id": "401810064",
  "date": "Nov 11, 2025",
  "matchup": "PHI vs BOS",
  "headline": "Maxey, Oubre lead 76ers to 102-100 win over Celtics",
  "body": "PHILADELPHIA -- — Tyrese Maxey scored 21 points and Kelly Oubre Jr. scored the go-ahead basket on a follow with 8.7 seconds left to lead the Philadelphia 76ers to a 102-100 win over the Boston Celtics on Tuesday night.\n\n\r\n              Justin Edwards had a team-high 22 points for the 76ers, who played without Joel Embiid (right knee soreness). Edwards made 8 of 9 shots, including 5 of 6 on 3-pointers.\n\n\r\n              Jaylen Brown scored 24 points to pace the Celtics. \n\n\r\n              Boston led by eight points with just over six minutes to play before Edwards hit three consecutive 3-pointers in a span of 1:18 to put Philadelphia in front 93-92. Brown tied it at 100 by making the second of two free throws with 33.5 seconds left. \n\n\r\n              After Edwards misfired on a 3-pointer, his only miss of the night, Oubre collected the rebound and laid it in with 8.7 seconds left for a 102-100 lead.\n\n\r\n              On Boston’s ensuing possession, Andre Drummond knocked the ball out of Derrick White’s hands, and White was forced to heave a shot from near midcourt. The ball didn’t touch the rim but fell in the hands of Neemias Queta, who was unable to score.\n\n\r\n              Embiid has missed five of the team’s 11 contests this season. The 2023 MVP is averaging 19.7 points and 5.5 rebounds per game. He was sidelined in the previous four games while recovering from left knee surgery. The right knee soreness is new. Philadelphia coach Nick Nurse said after the game that tests revealed no structural issues with Embiid's knee and that he was day-to-day. \n\n\r\n              This was the third of four meetings between the clubs this season. The 76ers won the season opener at Boston on Oct. 22, and the Celtics won the first matchup in Philadelphia on Oct. 31. They’ll next meet on March 1 in Boston. \n\n\r\n              Up Next\r\n              Celtics: Host Memphis on Wednesday night.\n\n\r\n              76ers: At Detroit on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042604.502381
}