{
  "game_id": "0021800065",
  "espn_id": "401070746",
  "date": "Oct 25, 2018",
  "matchup": "OKC vs. BOS",
  "headline": "Tatum scores 24, Celtics rally to top winless Thunder 101-95",
  "body": "OKLAHOMA CITY --  Kyrie Irving was overthinking how to fit in.\n\nHe missed last season's playoffs after left knee surgery, and because the Boston Celtics reached the Eastern Conference finals without him, he was cautious when he returned this season.\n\nOnce he relaxed and started having fun, everything flowed.\n\nJayson Tatum scored 24 points, Irving had 15 points and five assists, and the Celtics rallied from a 16-point halftime deficit to beat the winless Oklahoma City Thunder 101-95 on Thursday night.\n\n\"When we're not on the same page, we're very, very bad,\" Irving said. \"I think we want to err on the side of being one and being together and playing well together. It's just a lot better basketball that way. And it starts with me, too.\"\n\nMarcus Morris added 21 points and 10 rebounds, and Al Horford added 19 points for the Celtics. Morris hit a 3-pointer with 27 seconds left to give the Celtics a 98-95 lead, and they held on.\n\nPaul George scored 22 points for Oklahoma City, but shot just 7 of 22. Russell Westbrook had 13 points, 15 rebounds and eight assists, but he shot 5 for 20.\n\nOklahoma City led 50-34 at halftime. Boston shot just 32 percent in the first half and missed all 11 of its 3-point attempts.\n\nBoston hit seven of its first 10 3-pointers in the third quarter to trim Oklahoma City's lead to 70-64. At one point, Horford hit three 3-pointers in 41 seconds.\n\n\"It felt really good,\" Horford said. \"Before the second quarter ended, Kyrie looked at me and said, `Hey, we've got to set the tone. We have to be more aggressive.' He was right. We started in the third (quarter) and I tried to do my part and just play with more freedom out there.\"\n\nMorris hit a 3 to cut Oklahoma City's lead to 72-70, and a steal and layup by Terry Rozier III tied the game. Morris made a layup late in the quarter to give the Celtics a 74-73 lead at the end of the period. Boston was 9 of 14 on 3-pointers in the quarter.\n\nThe Thunder went up 86-83 on a layup by rookie Hamidou Diallo. Westbrook found Alex Abrines for a 3-pointer with just over five minutes to play, then Abrines hit another 3 on Oklahoma City's next possession before George made two free throws to push the lead to nine with 4:22 remaining. Boston outscored the Thunder 16-1 the rest of the way.\n\nThe Thunder and Cleveland Cavaliers are the only winless teams in the league.\n\n\"There's 78 more,\" George said. \"For us, it's one game at a time. Tomorrow, we're going to bury this game once we look at the film, and get ready for Phoenix. Just take it one day, one game at a time.\"\n\n---\n\nTIP-INS\n\nCeltics: F Gordon Hayward scored five points in 24 minutes. He hasn't played more than 25 minutes this season as he tries to find his way on his surgically repaired left ankle. ... C Aron Baynes (right hamstring strain) and G Jabari Bird (personal reasons) did not play. ... Morris committed three fouls in the first quarter in just 6:50 of playing time.\n\nThunder: F Jerami Grant got his first start of the season, though he had been averaging 28 minutes per game. He replaced Patrick Patterson. ... The Thunder made just 7 of 28 3-pointers and 14 of 25 free throws.\n\nPOOR SHOOTING\n\nThe Thunder entered the night as the worst-shooting team in the NBA at 39 percent, and they again shot 39 percent. Oklahoma City's league-worst 3-point shooting percentage of 23.9 percent entering the night won't change much after a 7-for-28 effort.\n\nTHEY'RE NOT FREE\n\nThe Thunder entered the night 29th in the league in free throw shooting at 66.7 percent, and they got worse Thursday by going 14 for 25.\n\nUP NEXT\n\nThunder: Host the Phoenix Suns on Sunday.\n\nCeltics: Visit the Detroit Pistons on Saturday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: www.apnews.com/tag/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994637.487443
}