{
  "game_id": "0022200084",
  "espn_id": "401468239",
  "date": "Oct 29, 2022",
  "matchup": "CHI vs. PHI",
  "headline": "Embiid scores 25, hits big 3 as 76ers beat Bulls 114-109",
  "body": "CHICAGO -- — Joel Embiid scored 25 points and made a tiebreaking 3-pointer to help the Philadelphia 76ers squeeze by the Chicago Bulls 114-109 on Saturday night.\n\n\r\n              Philadelphia led by 19 midway through the second quarter before Chicago went on a big run to get back into the game prior to halftime. The Bulls took the lead in the third quarter, and it remained tight the rest of the way. But the 76ers made just enough plays to beat Chicago for the 12th straight time.\n\n\r\n              “That wasn't pretty,” coach Doc Rivers said. “That was the first thing I told our guys. I said we'll take the win. We've been playing great at the beginning of the game, and then we held on to win. ... I just thought we lost our rhythm, lost our pace.”\n\n\r\n              It was tied at 109 after the Bulls’ Nikola Vucevic made two foul shots with 1:10 left in the game. Embiid then missed two free throws after Patrick Williams fouled him away from the ball.\n\n\r\n              Chicago’s Alex Caruso grabbed the rebound, but Zach LaVine missed a 19-footer. Embiid then nailed an open 3 to give the Sixers a 112-109 lead with 18.1 seconds remaining.\n\n\r\n              “I can't believe I missed two free throws,” Embiid said. “Both of them, actually, I thought it was going in. But it happens. Some moments you (stink), some moments you're good. But I was able to be wide open for the next one. There was no way I wasn't taking that because I missed the two free throws.\"\n\n\r\n              DeRozan missed on a drive. Alex Caruso then stole a pass from P.J. Tucker, only to miss a 3, and Tobias Harris made two free throws with 4.4 seconds to play.\n\n\r\n              Embiid had seven rebounds and four assists after sitting out Friday’s win at Toronto because of a sore right knee. James Harden scored 15, though he made just 2 of 13 shots.\n\n\r\n              Georges Niang had 15 points. Tyrese Maxey, coming off a career-high 44-point outing, finished with 14, and the Sixers improved to 3-4 with their second straight win.\n\n\r\n              “We got a lot of work to do,\" Embiid said. \"We blew up the lead, mainly by not playing the right way. We need to be focusing better for 48 minutes.\"\n\n\r\n              DEROZAN, VUCEVIC DELIVER\n\n\r\n              DeRozan, who reached the 20,000-point milestone in Friday’s loss at San Antonio, led Chicago with 24.\n\n\r\n              Nikola Vucevic added 23 points and 19 rebounds. The 6-foot-10 center from Montenegro made five 3-pointers — one shy of his career high. \n\n\r\n              Vucevic became the first Bulls player with at least 20 pts, 15 rebounds and five 3s in a single game, according to information supplied to the team by the Elias Sports Bureau. It's the second time in his career he has achieved that, and he is one of 38 players in NBA history to do so at least once,\n\n\r\n              LaVine scored 20 after missing a game because the team is managing his surgically repaired left knee. But a second straight loss left coach Billy Donovan indicating the starting lineup could be changed.\n\n\r\n              “But I can't sit there and say it's one player,\" he said. “It's that group. It's a group of five players. It's something we probably got to take a look at and evaluate and see. You'd like to get a larger sample size.”\n\n\r\n              TIP-INS\n\n\r\n              76ers: Philadelphia has not lost to Chicago since March 6, 2019. ... Embiid was not listed on the injury report. \n\n\r\n              Bulls: G Ayo Dosunmu (neck pain) and C Andre Drummond (strained left shoulder) were unavailable after getting banged up in Friday's loss at San Antonio. Dosunmu slipped and struck the knee of the Spurs' Keldon Johnson in the third quarter. He returned to the game after clearing concussion protocol, but was having trouble turning and moving his neck. Donovan said Drummond does not appear to be seriously injured and should be back in a few days. ... The Bulls honored DeRozan during the game's first timeout for reaching the 20,000-point milestone at San Antonio on Friday.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Visit Washington on Monday.\n\n\r\n              Bulls: Visit Brooklyn on Tuesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994518.449793
}