{
  "game_id": "0021600473",
  "espn_id": "400899915",
  "date": "Dec 27, 2016",
  "matchup": "OKC @ MIA",
  "headline": "Westbrook gets 15th triple-double, Thunder top Heat 106-94",
  "body": "MIAMI -- Russell Westbrook took a charge in the final minutes with the outcome already decided, was diving for loose balls and grabbed more defensive rebounds than any four Miami Heat players did combined.\nForget the triple-double.\nIt was everything else that had Heat coach Erik Spoelstra marveling.\nWestbrook scored 29 points, grabbed 17 rebounds -- all defensive -- and added 11 assists for his 15th triple-double of the season, and the Oklahoma City Thunder beat the Heat 106-94 on Tuesday night for their fourth straight win.\n\"He's competing until the very end,\" Spoelstra said. \"Every single possession is the most important possession to him. Great, great lesson ... from somebody's that is really imposing a competitive will on every contest. He did what he does. What defines greatness is consistency, and that's what you can book pretty much every night.\"\nWestbrook nearly had the triple-double by halftime, falling two rebounds shy. He got those in the first 5:21 of the third quarter.\n\"I thought our team did a great job of focusing in on what we do as a team and came out and put our foot down early,\" Westbrook said.\nEnes Kanter scored 19 and Steven Adams added 15 -- including a highlight-reel dunk in the first half -- for the Thunder.\nJosh Richardson tied a career high with 22 points for the Heat. James Johnson scored 16 and Tyler Johnson added 15, both off the bench, for Miami. Oklahoma City's frontcourt limited Miami center Hassan Whiteside to 12 points and eight rebounds, most of that coming in the fourth quarter.\n\"They just used their strength,\" Westbrook said. \"Steven does an amazing job and Enes ... those guys do an amazing job.\"\nThe Heat were without point guard Goran Dragic, sidelined by back spasms.\nOklahoma City dominated in the paint, outscoring Miami 58-32. And Westbrook scored 11 points in the fourth to help the Thunder close out the win.\n\"He's like an idol,\" said Oklahoma City's Alex Abrines, who scored 14 off the bench. \"He goes 100 percent every play.\"\nWestbrook grabbed the game's final rebound, dribbled out the clock and then slapped high-fives with fans who waited until the end just to see him depart.\n\"They see the numbers and what he does in games. They don't get a chance to see behind the scenes,\" Thunder coach Billy Donovan said. \"The one thing I admire about him is he practices every single day. He has great energy every single day. He comes to every shootaround and he practices. He puts the time in and that's the reason why he's as successful as he is.\"\nTIP-INS\nThunder: Oklahoma City improved to 12-3 this season and 45-7 all-time when Westbrook has a triple-double. ... Westbrook had four assists and three rebounds in the first 11:59 -- matching the Heat totals in that span. ... Victor Oladipo missed his eighth game with a right wrist sprain. ... Donovan got big hugs both pregame and postgame from Heat forward Udonis Haslem, who played for him at Florida.\nHeat: Josh McRoberts (stress fracture in left foot) is out indefinitely, the team announced Tuesday. McRoberts said he will be back this season. ... In tribute to the late George Michael, the Heat played a number of his hits during stoppages in play. ... Actor and comedian Chris Rock sat courtside, as did Miami Dolphins running back Jay Ajayi.\nAGAINST MIAMI\nWestbrook is the sixth opposing player to visit Miami and post a triple-double, joining Clyde Drexler, Scottie Pippen, Magic Johnson, Andre Miller and Rajon Rondo. (Pippen and Rondo did it in playoff games.) He also became the third player to record multiple triple-doubles against Miami. Jason Kidd and Rondo are the others, both with three. Westbrook's other one against Miami was Jan. 17.\nUP NEXT\nThunder: Visit Memphis on Thursday, wrapping up a two-game trip.\nHeat: Visit Charlotte on Thursday, the start of a road back-to-back that continues in Boston.",
  "source": "espn_api",
  "crawled_at": 1764995300.562217
}