{
  "game_id": "0021500908",
  "espn_id": "400828795",
  "date": "Mar 03, 2016",
  "matchup": "PHX @ MIA",
  "headline": "Wade scores 27, Heat ease past Suns 108-92",
  "body": "MIAMI -- Dwyane Wade never has an off night against the Phoenix Suns.\nWade scored 27 points, Goran Dragic added 25 against his former club and the Miami Heat never trailed on the way to beating the Suns 108-92 Thursday night, extending their winning streak to three games.\n\nLuol Deng scored 12 and Hassan Whiteside grabbed 11 rebounds for Miami, which led by as many as 21 in the first half.\n\"What I liked about tonight is we came out early and took care of business,\" Wade said.\nRookie guard Devin Booker kept the Suns in the game, scoring 15 of his 34 points in the fourth quarter. Alex Len had 12 points and 13 rebounds for Phoenix, which tied a club record by losing its 17th consecutive road game.\nBooker received high praise from Wade after the game, and the rookie sounded somewhat humbled.\n\"Obviously, Dwyane's a living legend, everyone knows that, especially when he's here in Wade County,\" Booker said. \"I try to take that challenge and try to have fun with it. Those are the games I live for -- people I grew up watching. Now I get a chance to play against them.\"\nMirza Teletovic scored 11 points while Archie Goodwin and P.J. Tucker had 10 apiece for the Suns, who have dropped 30 of 33 overall.\n\"We all know that our main guys are out,\" interim coach Earl Watson said. \"That's not even a secret, but we make no excuses.\"\nThe Heat didn't offer them any sympathy, either.\nAn 18-5 run midway through the second quarter put Miami up 50-29, more than enough cushion to absorb every rally attempt Phoenix put together. The Suns were no closer than 14 at any point in the third and they got within 10 on two occasions midway through the fourth -- though Miami quickly extended the lead in both cases, responding with bursts of 6-0 and 5-0 to keep Phoenix at bay.\n\"You have to credit Phoenix,\" Heat coach Erik Spoelstra said. \"They kept on playing and then Booker got on a roll. ... He's a good young player. But we were able to respond there and get some stops.\"\nWade has faced Phoenix 18 times, and has at least 16 points in each of those games. His career average against the Suns was 25.4 points coming into the night, and it went up a bit after he shot 9 of 17 from the floor and 9 for 10 from the line -- despite playing with a cold.\nStill, he insisted he would play Friday in Philadelphia when the Heat start a weekend home-and-home against the NBA-worst 76ers.\n\"It's the time of the year where you've got to win games you're supposed to win,\" Wade said. \"You're not going to play great every night, but you've got to find ways to win.\"\nTIP-INS\nSuns: The other 17-game road losing streak in team history came in early 1974. ... Len has scored at least 10 points in each of his last six games, a career-long streak in that department. His previous best was a five-game streak in December. ... Phoenix won its first 16 matchups against Miami, but has dropped 15 of its last 16 against the Heat. ... Booker has scored 18 or more points 11 times. The Suns are 0-11 in those games.\nHeat: It was Miami's third wire-to-wire win of the season. Out of their last three games, spanning 144 minutes, the Heat have trailed for a total of 1 minute, 9 seconds. ... Whiteside became the second Heat player with consecutive 200-block seasons, joining Alonzo Mourning. ... Miami is a season-best nine games over .500.\nSUNS EAST\nOf the 10 players in Miami's rotation Thursday night, five have direct ties to the Phoenix organization. Deng was drafted by the Suns, and Amar'e Stoudemire, Joe Johnson, Gerald Green and Dragic all played for them at one point in their careers.\nBOOKER'S BREAKOUT\nBooker became the second NBA rookie this season with multiple nights of scoring 30 or more. Minnesota big man Karl-Anthony Towns has three such games.\nUP NEXT\nSuns: Visit Orlando on Friday.\nHeat: Visit Philadelphia on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994835.0295959
}