{
  "game_id": "0021600349",
  "espn_id": "400899791",
  "date": "Dec 10, 2016",
  "matchup": "CHA @ CLE",
  "headline": "LeBron scores 44, reaches assist mark as Cavs down Hornets",
  "body": "CLEVELAND --  Standing at midcourt, LeBron James spun the ball on his index finger as the final seconds ticked off the clock.\n\nHe had the Hornets turning in circles all night.\n\nJames scored 17 of his season-high 44 points in the fourth quarter and reached another career milestone as the Cleveland Cavaliers won their fourth straight, 116-105 over Charlotte on Saturday.\n\nJames did it all, making five 3-pointers and adding 10 assists and nine rebounds in 43 minutes. He took over in the fourth, scoring 13 straight during one stretch to help the Cavs hold on.\n\n\"A lot of our guys had heavy legs tonight and it was up to me to get through it,\" he said.\n\n\"He carried us,\" teammate Kevin Love said. \"I kept telling him, `Take us home.\"\n\nJames, who moved into ninth place on the career scoring list Friday, recorded his 7,000th assist in the first half, becoming the first frontcourt player in NBA history to reach the plateau.\n\nThe 31-year-old is the only player with 27,000 points, 7,000 assists and 7,000 rebounds.\n\n\"I don't know what to say,\" James said when asked about the achievement. \"That's the triple threat of me. To rebound, to pass, to put the ball in the hole a little bit. It's just an honor. I'm just blessed. To be the only one to put up those numbers is pretty cool because this is the game I love. It's the game I watched my whole life growing up, so it's incredible.\"\n\nCleveland shot a season-best 58 percent from the field and beat Charlotte for the sixth straight time at home.\n\nKemba Walker scored 24 to pace the Hornets, playing the first of five consecutive road games. Walker sat out the final few minutes after banging knees with James.\n\n\"It's not bad at all,\" said Walker, who had a sleeve over his left knee. \"At the moment it looked pretty bad, but I'm good. I was coming off a ball screen and he ran into me.\"\n\nCharlotte coach Steve Clifford knew his team was going to have trouble defending the Cavs if the reigning NBA champions were clicking.\n\nOnce James warmed up, there wasn't much the Hornets could do.\n\n\"He passed. He rebounded. He made 3s. He was great going to the basket,\" Clifton said. \"He was phenomenal. He made three or four 3s that he's going to make. You can't block them. You can't contest them. When he's shooting the ball like that there's nothing you can do, other than blitz, and that's what he wants you to do, and then he really makes you look bad.\"\n\nThe Cavs were on target from the start, shooting 71 percent while building a 12-point lead in the first quarter. Cleveland stayed around 70 percent for most of the first half and had a 15-point lead at halftime.\n\nThe Hornets cut it to three in the third, but James countered with a pair of 3s in a span of 25 seconds, straddling the arc after the second make while looking in the direction of Clifford, who was calling a timeout.\n\nNO REST\n\nCavs coach Tyronn Lue intends to rest James at some point, but not on a night when Kyrie Irving said he was tired.\n\n\"I didn't want to play LeBron this many minutes, but he came and said, `Coach, I'm fine,\" Lue said. \"Then, he started raining 3s. We had to ride him tonight.\"\n\nTIP-INS\n\nHornets: Nicolas Batum is one of five NBA players averaging at least 13 points, 7.7 rebounds and 5.6 assists. James, Russell Westbrook, Giannis Antetokounmpo and James Harden are the others. Of that group, Batum came in averaging the fewest turnovers (2.3). ... Walker entered with the second-most 3-pointers (61) in the Eastern Conference. Only Toronto's Kyle Lowry had made more. ... Charlotte's trip includes stops in Indiana, Washington, Boston and Atlanta. The Hornets won't play at home again until Dec. 20 when they host the Lakers.\n\nCavaliers: Irving scored only 11 points on 4-of-13 shooting. ... J.R. Smith returned after missing two games with a hyperextended left knee and scored six points in 32 minutes. ... Irving joined James and Mark Price as the only players in Cleveland history with 600 career 3-pointers. ... Cleveland improved to 41-10 at home against Charlotte. ... Olympic gold medal gymnast Simone Biles, an Ohio native, was introduced during a timeout in the first quarter. ... F Channing Frye missed his second straight game to attend his father's funeral.\n\nUP NEXT\n\nHornets: At Indiana on Monday.\n\nCavaliers: Host Memphis on Tuesday before flying to Tennessee to face the Grizzlies again on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995525.506094
}