{
  "game_id": "0022200102",
  "espn_id": "401468257",
  "date": "Oct 31, 2022",
  "matchup": "LAC vs. HOU",
  "headline": "Clippers edge Rockets 95-93 on George's clutch jumpers",
  "body": "LOS ANGELES -- — With Kawhi Leonard's return nowhere in sight, Paul George is putting pressure on himself to carry the Los Angeles Clippers and their high expectations.\n\n\r\n              Despite turnovers down the stretch, George came up with two huge baskets to help the Clippers edge the Houston Rockets 95-93 on Monday night and snap a four-game losing streak.\n\n\r\n              “We're not playing the heavyweights right now,” George said. “The way we were losing these games, it was embarrassing. We've got to start to play better.”\n\n\r\n              The Clippers (3-4) again were without Leonard and John Wall. Leonard missed his fifth game and Wall sat out his second, both because of knee injury management.\n\n\r\n              “I take full responsibility for us and our record right now,” George said. “Regardless of who's in the lineup or who's not, I'm more than capable of going out and performing.”\n\n\r\n              George hit a go-ahead jumper with six seconds remaining, finishing with 35 points, nine rebounds and eight assists. Ivica Zubac added 16 points and 12 rebounds. He teamed with George to score 14 of the Clippers' 22 points in the fourth quarter, when they played a two-man pick and roll.\n\n\r\n              “That's one of our best plays with me and PG doing pick and rolls together,” Zubac said. “We couldn't make any shots but we attacked the paint.”\n\n\r\n              K.J. Martin scored 23 points off the bench to lead the Rockets (1-8), who dropped their fourth in a row.\n\n\r\n              George's 3-pointer tied the game 93-all with 39 seconds remaining. That got fans on their feet for the final seconds. \n\n\r\n              George stole the ball from former Clipper Eric Gordon. After another timeout, Reggie Jackson inbounded to George, who hit a jumper that gave the Clippers their first lead of the fourth quarter.\n\n\r\n              Gordon's shot missed at the buzzer and he gestured to indicate he thought he'd been fouled.\n\n\r\n              “We're a group that fights,” Houston coach Stephen Silas said. “We executed pretty good down the stretch.”\n\n\r\n              George had three costly turnovers in the final minutes after hitting a 3-pointer that drew the Clippers within two earlier in the fourth. His first led to a dunk by Kevin Porter Jr. After George's second turnover, he got called for an offensive foul.\n\n\r\n              “Bad turnovers, bad possessions,” George said, ticking off some of the Clippers' issues. “We're not shooting the ball well. That's going to come. Tonight, defensively, was a step in the right direction.”\n\n\r\n              George fed Zubac for a dunk that again got the Clippers within two. But Jalen Green answered with a basket to keep Houston ahead.\n\n\r\n              Martin, who finished four points off his career high, got hot late in the third and early in the fourth. Tari Eason and Martin combined to score 11 points in a row to put Houston back in front, 76-71, late in the third.\n\n\r\n              Martin had Houston's first five points of the fourth before missing two free throws with the Rockets clinging to a two-point lead.\n\n\r\n              The teams traded narrow leads in the third, when George scored 12 points.\n\n\r\n              TIP-INS\n\n\r\n              Rockets: Jae'Sean Tate reaggravated the ankle injury that forced him to miss the season's first four games. He's day-to-day and will be re-evaluated in Houston. \n\n\r\n              Clippers: Robert Covington remains in the NBA's health and safety protocols. ... Los Angeles has won seven of its last eight against the Rockets.\n\n\r\n              STAYING HOME\n\n\r\n              Leonard won't be joining the Clippers for their quick two-game trip to Texas this week.\n\n\r\n              “He's frustrated. He wants to be out on the floor,” coach Tyronn Lue said. “Then not being on the floor, now you can't travel. He wants to travel, but the doctor says it's not the right thing to do right now with the stiffness (in his knee) and what he's going through.”\n\n\r\n              UP NEXT\n\n\r\n              The teams meet again Wednesday in Houston. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994997.85835
}