{
  "game_id": "0021601121",
  "espn_id": "400900516",
  "date": "Mar 30, 2017",
  "matchup": "DET vs. BKN",
  "headline": "Morris' double-double lifts Pistons over Nets 90-89",
  "body": "AUBURN HILLS, Mich. --  The Detroit Pistons made a crucial stand to keep their dwindling playoff hopes alive.\n\nMarcus Morris had 28 points and 13 rebounds, and Ish Smith hit the go-ahead 3-pointer late in the fourth quarter, helping the Pistons beat the Brooklyn Nets 90-89 on Thursday night.\n\nSmith, who finished with 21 points, six rebounds and five assists, gave the Pistons an 87-86 lead with 28.5 seconds left. Brook Lopez missed a 3-pointer on the Nets' ensuing possession, and Detroit sealed it at the free-throw line.\n\n\"You know how difficult it is to win in this league, so whenever you can get a win, and we've been struggling, it was good,\" said Smith, who helped the Pistons snap their five-game losing streak.\n\nDetroit, the No. 10 seed in the Eastern Conference, continues to battle for a postseason berth.\n\n\"You can't get too high, can't get too low,\" Smith said. \"Any day we can get a win at this point is good. Make one more little push. We're excited about the challenge.\"\n\nThe Nets opened a four-point edge at 86-82 on Lopez's 3-pointer with 1:40 left. Smith then hit a jumper and 3-pointer to give the Pistons a one-point advantage.\n\n\"The shots were there, so I stepped up and took it,\" Smith said. \"It's a miss-and-make league. You make it, then you're happy. You miss it, then we're talking about a different result.\"\n\nDetroit hit three free throws down the stretch to build the lead to 90-86, and Justin Hamilton drained a 3 at the buzzer for the final margin.\n\nSean Kilpatrick scored 15 and Rondae Hollis-Jefferson and Jeremy Lin each had 14 points for the Nets. Lopez added 11 points and nine rebounds.\n\n\"They made some big shots and we didn't,\" Nets coach Kenny Atkinson said. \"Our execution was average at best. Tough loss, but credit to them.\"\n\nThe third quarter went back and forth, with neither team leading by more than six. Detroit took a 55-53 advantage on Kentavious Caldwell-Pope's 3-pointer with 5:30 left, but the Nets rallied for a 63-59 lead entering the final period.\n\n\"Overall, we did a really good job defensively,\" Pistons coach Stan Van Gundy said. \"I'm happy for our guys and happy to get the win.\"\n\nTIP-INS\n\nNets: F Quincy Acy (left ankle) and G Joe Harris (left shoulder) did not play. ... Brooklyn beat the Pistons 98-96 on Lopez's buzzer-beater on March 21, starting a five-game losing skid for the Pistons.\n\nPistons: PG Reggie Jackson (rest) was inactive for the third consecutive game. Jackson, who missed the opening 21 games with left knee tendinitis, has been unable to regain his form from last season. Van Gundy said Jackson remains day-to-day and hasn't been ruled out for the team's final six regular-season games. ... G Reggie Bullock (right foot sprain) did not play. ... The Pistons' schedule doesn't get easier down the stretch, with road games at Milwaukee, Houston and Memphis. They host Toronto and Washington.\n\nROAD WOES\n\nThe Nets have lost four consecutive games at the Palace. They won the season series against the Pistons 2-1, winning both games in Brooklyn.\n\n\"We've gotten a little complacent,\" Lopez said. \"We need to put our right foot forward and show our true selves.\"\n\nUP NEXT\n\nNets: Host Orlando on Saturday.\n\nPistons: At Milwaukee on Friday.",
  "source": "espn_api",
  "crawled_at": 1764996023.185102
}