{
  "game_id": "0022200099",
  "espn_id": "401468254",
  "date": "Oct 31, 2022",
  "matchup": "TOR vs. ATL",
  "headline": "Siakam has 31 points, 12 boards, Raptors rout Hawks 139-109",
  "body": "TORONTO -- — Pascal Siakam had 31 points and 12 rebounds, Scottie Barnes scored a season-high 21 points and the Toronto Raptors routed the Atlanta Hawks 139-109 Monday night.\n\n\r\n              “We weren’t ready to play and we got our (butt) kicked,” Atlanta’s Dejounte Murray said.\n\n\r\n              Gary Trent Jr. scored 21 points and O.G. Anunoby had 14 as the Raptors set a season high in points and improved to 3-1 at home.\n\n\r\n              Siakam had six assists, his franchise-best 30th game with 20 or more points, 10 or more rebounds and five or more assists. Siakam also reached those marks in Friday’s home loss to Philadelphia.\n\n\r\n              “I feel like Pascal’s been killing it,” Barnes said. “I feel like he should be in that question of being the MVP with the level he’s playing at.”\n\n\r\n              Barnes made a career-best five 3-pointers and finished 5 for 9 from long distance.\n\n\r\n              Toronto has won three straight home meetings with Atlanta.\n\n\r\n              “I thought there was more urgency coming from them,” Hawks coach Nate McMillan said of Toronto. “They played harder. They out-scrapped us.”\n\n\r\n              Trae Young had 14 points and 10 assists, and John Collins had 12 points and 12 rebounds before fouling out as the Hawks lost their second straight. Atlanta lost at Milwaukee on Saturday.\n\n\r\n              Murray scored 20 points for the Hawks, Clint Capela had 13 and De’Andre Hunter 11.\n\n\r\n              The Hawks had a season-worst 18 turnovers, leading to 24 points for Toronto.\n\n\r\n              “Just not taking care of the ball, playing loose with the basketball,” McMillan said. “A team like this will pound you, as they did.”\n\n\r\n              Six of Atlanta’s turnovers came in the first quarter.\n\n\r\n              “When you play on the road and teams get turnovers like that, they feed off of it,” Capela said. “They did that, they did it again and again.”\n\n\r\n              Murray said the Hawks discussed their poor performance in the locker room after the game. Murray said he was satisfied the meeting had been productive.\n\n\r\n              “Absolutely,” Murray said. “You could tell by guys’ eyes and ears.”\n\n\r\n              Down 34-28 after one, the Hawks went ahead 49-48 after a basket from Young with 4:27 left in the second. Siakam scored six points and Barnes had five as Toronto closed the half with a 16-4 run to lead 64-53 at the break.\n\n\r\n              Siakam shot 1 for 7 in the third but scored six of his nine points at the free throw line as the Raptors took a 95-80 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Young had seven assists in the first. It’s the tenth time in his career that he’s had seven or more assists in a quarter. Seven of those 10 have come in first quarters. … Atlanta has scored 100 or more points in 28 consecutive games.\n\n\r\n              Raptors: G Fred VanVleet was not available (sore back). Rookie center Christian Koloko made his first career start. … Toronto outscored Atlanta 43-10 in fast break points. … Barnes had a season-high with eight assists. … F Otto Porter Jr. (personal reasons) was unavailable for the second straight game. … Former Raptors star Chris Bosh had 27 games with 20 or more points, 10 or more rebounds and five or more assists.\n\n\r\n              CRIME SPREE\n\n\r\n              Toronto had 13 steals while the Hawks had one. Anunoby led the Raptors with a season-high six steals.\n\n\r\n              FAMILY AFFAIR\n\n\r\n              Hawks rookie F AJ Griffin had two points, two rebounds and one assist in 15 minutes. His father, Adrian Griffin, is a 10-year NBA veteran and, since 2018, a Raptors assistant coach.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Conclude a five-game trip at New York on Wednesday night.\n\n\r\n              Raptors: Visit San Antonio on Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994105.348754
}