{
  "game_id": "0021600652",
  "espn_id": "400900073",
  "date": "Jan 21, 2017",
  "matchup": "CHA vs. BKN",
  "headline": "Kidd-Gilchrist, Batum lead Hornets past Nets 112-105",
  "body": "CHARLOTTE, N.C. -- Nic Batum has certainly had better shooting nights.\nBut the eight-year NBA veteran from France was feeling pretty good after making two clutch 3-pointers in the fourth quarter to help the Charlotte Hornets defeat the Brooklyn Nets 112-105 on Saturday night for their third straight win.\n\"I missed some easy that I need to make,\" Batum said. \"So I feel like when it's a close game like that, I need to make some big plays and I did.\"\nAfter letting a 17-point first half advantage slip away, Charlotte grabbed the lead for good with 3:21 left in the game when Batum got a fadeaway 3-pointer to fall after the ball bounced lazily on the rim four times before going in. Batum, who was fouled on the play, added the free throw to complete the four-point play.\nBatum added a 3-pointer from the left wing on the next possession to push the lead to 104-98. Kemba Walker then sank a leaning 3-pointer from the top of the key to give Charlotte some extra breathing room.\nCoach Steve Clifford said he has no idea how Batum shoots the ball so well off-balanced.\n\"He's done it since before he got in the NBA,\" Clifford said. \"He's got great balance and hand-eye coordination.\"\nBatum finished with 16 points, nine rebounds and six assists for the Hornets.\nMichael Kidd-Gilchrist had 17 points and 14 rebounds for Charlotte, which avenged a 120-118 loss to the Nets on Dec. 26 in which Randy Foye beat them with a 3-pointer at the buzzer.\nBrook Lopez had 24 points for the struggling Nets, who have lost 12 of their last 13 and failed in their quest to become the last NBA team to reach double digits in wins this season.\n\"We came in and we were exhausted from last night and had a bad first quarter, but we responded to that,\" Lopez said. \"We came in the second half and definitely made it a game and that's the way we've got to play every night.\"\nTIP INS\nNets: Jeremy Lin remained out with a hamstring injury. ... Attempted 41 3-pointers in the game, making 17. ... Lopez had his 15th 20-point game this season. ... Quincy Acy had a season-high 14 points off the bench. ... Had a season-high 30 assists.\nHornets: Shot 54.5 percent in the first half from the field, including 6 of 13 from 3-point range to build a 60-46 lead. ... Marvin Williams has made a 3-pointer in 18 straight games.\nTOUGH FIRST QUARTER\nThe Hornets jumped out to a quick 16-4 lead as the Nets missed 11 of their first 12 shots from the field. Clifford called it the team's best first quarter of the season, considering the Nets put up 143 points against New Orleans the night before.\n\"They're hard to guard,\" Clifford said. \"They have so many ways to drive the ball. They're very difficult to guard. I thought our guys battled hard.\"\n3-POINT SHOOTING\nCharlotte, which made 14 of 29 3-pointers, had seven of those in the fourth quarter.\n\"Two of them were off our turnovers,\" Nets coach Kenny Atkinson said. \"You turnover, you have to sprint back, matchup and find 3-point shooters. Credit to them, they made some huge shots.\"\nSCHOOL IN SESSIONS\nHere's a rarity this season: Ramon Sessions, Charlotte's backup point guard, had 17 points and actually outscored All-Star candidate Kemba Walker, who had 16 points.\n\"Kemba carries us every game, so when we can step in and give those guys a rest,\" Sessions said. \"Last game, he didn't have to play in the fourth quarter, so during the season if we can get those stretches where he doesn't have to play as many minutes that will be good for us in the long run.\"\nUP NEXT\nNets: Host the San Antonio Spurs on Monday night.\nHornets: Play their third game of a five-game homestand Monday night against the Washington Wizards.",
  "source": "espn_api",
  "crawled_at": 1764995503.419591
}