{
  "game_id": "0022000832",
  "espn_id": "401307627",
  "date": "Apr 14, 2021",
  "matchup": "LAC @ DET",
  "headline": "Jackson's jumper gives Clippers 100-98 win over Pistons",
  "body": "DETROIT -- — Reggie Jackson and Luke Kennard both spoke highly of their time in Detroit.\n\n\r\n                    Small consolation for the Pistons after those two led the undermanned Los Angeles Clippers to a remarkable victory in Motown.\n\n\r\n                    Jackson sank a jumper with 2.3 seconds left against his former team, giving the Clippers their seventh straight victory, 100-98 over Detroit on Wednesday night. The Clippers rallied from an 11-point deficit in the fourth quarter despite playing without several key players. \n\n\r\n                    Kawhi Leonard, Paul George, Serge Ibaka, Patrick Beverley and Marcus Morris were all out for Los Angeles.\n\n\r\n                    “We have a deep team,\" Kennard said. \"We’ve got guys that can play.”\n\n\r\n                    The Clippers trailed by five in the final minute, but Terance Mann made it 98-95 with a dunk, and after Detroit's Jerami Grant turned the ball over near midcourt, Jackson connected from 3-point range to tie it with 19.0 seconds left.\n\n\r\n                    Amir Coffey then came up with a steal on the ensuing inbound pass, and after a timeout, Jackson dribbled the clock down and sank a jumper from near the top of the key.\n\n\r\n                    Killian Hayes missed a 3-pointer at the other end.\n\n\r\n                    “I made a couple mistakes at the end,\" Grant said. \"I’ll take the blame for it.”\n\n\r\n                    Jackson and Kennard were both with the Pistons last season. Jackson agreed to a contract buyout before the season was over, and Kennard was dealt in the offseason.\n\n\r\n                    “To come here, play here for 5 1/2 seasons was a blessing,\" Jackson said. \"Learning how to try to be consistent. It shaped me on and off the court. ... I’ll forever have that Piston blood running through my veins.”\n\n\r\n                    Kennard's comments were similar.\n\n\r\n                    “I love the city of Detroit. I always will,\" he said. \"The people here were really great to me.”\n\n\r\n                    Grant scored 28 points and Saddiq Bey added 17 for Detroit. \n\n\r\n                    Jackson finished with 29. Kennard had 17 points and 10 rebounds.\n\n\r\n                    Detroit led 77-73 after three quarters, and a 3-pointer by Bey made it 89-80 around the midway point of the fourth. Grant’s jumper made it 93-82.\n\n\r\n                    The Pistons played two games in a row against the Clippers. They lost 131-124 at Los Angeles on Sunday. The Clippers had a game in between.\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Los Angeles had only 10 assists on 37 made field goals. The Clippers tied the lowest assist total in a single game in the NBA this season. ... Ivica Zubac had 18 points and 13 rebounds.\n\n\r\n                    Pistons: Detroit finished with 16 turnovers, including the two big ones late. ... Isaiah Stewart had 12 points and Mason Plumlee added 11.\n\n\r\n                    NO REST\n\n\r\n                    Los Angeles beat Indiana 126-115 on Tuesday night and improved to 10-1 on the season in the second half of back-to-backs.\n\n\r\n                    “Very proud,” coach Tyronn Lue said. “To keep clawing, keep fighting and never give in.”\n\n\r\n                    INJURIES\n\n\r\n                    Leonard was out with a sore right foot, Ibaka had lower back tightness and Beverley was sidelined by a broken left hand. The Clippers said they were resting George and Morris for this game.\n\n\r\n                    Rodney McGruder (sprained right elbow) and Dennis Smith Jr. (left knee inflammation) missed the game for Detroit.\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Visit Philadelphia on Friday night. The Clippers beat the 76ers 122-112 on March 27.\n\n\r\n                    Pistons: Host Oklahoma City on Friday night. Detroit beat the Thunder 132-108 on April 3.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997669.1946921
}