{
  "game_id": "0022300754",
  "espn_id": "401585382",
  "date": "Feb 10, 2024",
  "matchup": "HOU @ ATL",
  "headline": "Dejounte Murray scores 34 points as Hawks send Rockets to 4th straight loss, 122-113",
  "body": "ATLANTA -- — Dejounte Murray had 34 points and the Atlanta Hawks overcame a sluggish start to beat the Houston Rockets 122-113 on Saturday night.\n\n\r\n              The Hawks, who reportedly considered trading Murray before Thursday's deadline, won for the sixth time in eight games.\n\n\r\n              Trae Young had 18 points and eight assists, Saddiq Bey scored 24 and Jalen Johnson added 21 for the Hawks.\n\n\r\n              Jalen Green had 26 points, 14 rebounds and 10 assists for the Rockets, who lost all four games on their road trip. It was Green’s first career triple-double. Jeff Green scored a season-high 19 points, and Aaron Holiday had 18 against the team he played for last season.\n\n\r\n              Murray also had seven assists and six rebounds while going 12 for 15 from the free-throw line. The 15 attempts were a career high.\n\n\r\n              “Just playing my game and they gave me some calls,” Murray said.\n\n\r\n              Bey's 3-pointer from the corner with just under two minutes to play gave the Hawks a 118-109 lead, and Atlanta closed it out from there. Bey was 4 for 9 from beyond the arc, his fourth straight game shooting at least 40% from deep after hitting that benchmark just one time in his previous 11 games.\n\n\r\n              “We said, `Keep shooting, keep shooting, keep shooting,'” Hawks coach Quin Snyder said. “He’s tough. The fact that he is continuing to shoot the ball even when he doesn’t see it go in, that shows that. His defensive consistency shows that.”\n\n\r\n              Johnson closed the first half with a putback dunk to give the Hawks a 57-49 lead. The athletic big man had six dunks in the game. \n\n\r\n              Atlanta outscored the Rockets 38-18 in the second quarter after missing its final eight field goal attempts and shooting 29% from the floor in the first.\n\n\r\n              Both teams were shorthanded.\n\n\r\n              The Rockets were without leading scorer and rebounder Alperen Sengun, who sat out with lower back pain. Sengun had started all 51 games. Starting guard Fred VanVleet missed his third straight game with a left adductor strain. Rookie wing Cam Whitmore (11.9 ppg) sprained his ankle Friday and also sat out.\n\n\r\n              The Hawks were missing starters De'Andre Hunter (right knee) and center Clint Capela (adductor strain). Hawks first-round draft pick Kobe Bufkin saw the first meaningful action of his rookie season, hitting a 3 and finishing with three points and three rebounds in 15 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host the New York Knicks on Monday.\n\n\r\n              Hawks: At home against the Chicago Bulls on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995595.825386
}