{
  "game_id": "0021801136",
  "espn_id": "401071809",
  "date": "Mar 30, 2019",
  "matchup": "CLE @ LAC",
  "headline": "Harrell, Clippers stay hot in 132-108 win over Cavaliers",
  "body": "LOS ANGELES --  The surging Los Angeles Clippers don't need a motto, but after their latest win, they did seem to have a preferred slogan:\n\nDon't slow our roll.\n\nSaturday's 132-108 victory over the Cleveland Cavaliers was the seventh in eight games and 12th in 14 for the playoff-bound Clippers. They moved within one-half game of San Antonio for the fifth seed in the Western Conference with five games remaining in their regular season.\n\n\"We're playing at a real high level right now,\" Clippers guard Patrick Beverley said. \"We're moving the ball and it's fun. We're defending -- so we really don't care who we play.\"\n\nSaturday's win was typical for the Clippers, a team without a superstar that's getting production from everywhere.\n\nMontrezl Harrell scored a team-high 23 points off the bench and rookie Shai Gilgeous-Alexander added 22 points and eight assists. JaMychal Green, starting in place of the rested Danilo Gallinari, and Lou Williams added 18 each. The Clippers shot 62.4 percent overall and connected on 15 of 33 3-point attempts.\n\n\"We got the job done,\" Clippers coach Doc Rivers said. \"I thought a lot of guys played well. When you shoot 62 percent, offensively you don't have a lot to say.\"\n\nJordan Clarkson scored 26 points in 24 minutes off the bench for Cleveland, while rookie Collin Sexton added 21 points and Cedi Osman had 19. Sexton scored at least 20 points for the 11th time in his past 12 games.\n\nThe Cavaliers went just 3 of 23 from the 3-point line.\n\n\"(Clarkson) played pretty well,\" Cavs coach Larry Drew said. \"He came off the bench and gave us a spurt, particularly in the second half. He made some nice drives to the basket and some timely baskets.\"\n\nCLIPPER SCARE\n\nThe energetic Harrell, who along with Williams has given the Clippers a prolific duo off the bench, went down hard and remained on the floor for several minutes in the second quarter, appearing to hold an ankle.\n\nAlmost the entire team left the bench to check on him. He finally rose, walked off on his own power and ultimately remained in the game, apparently uninjured.\n\n\"Either that or he's Lazarus,\" Rivers said. \"He healed awful quick.\n\n\"I was scared. Whenever you see a guy this late in the season go down, you're like, `Oh, boy. Here we go.' But when I walked down there and saw him, I knew he was fine.\"\n\nROOKIE RISE\n\nShai-Gilgeous has picked a nice time to elevate his game. The rookie appears more comfortable and is playing with a confident rhythm.\n\n\"I feel like I'm playing my best basketball at the moment,\" he said. \"Just try to keep it rolling.\"\n\nSaid Rivers: \"He's just playing now. He's not thinking a lot. Overall he's making pretty good reads. He's aggressive when he needs to be aggressive, but he's making passes when he needs to pass as well. I just like where he's at.\"\n\nTIP-INS\n\nCavaliers: With Kevin Love and Tristan Thompson both back from injury, Drew said before the game he's mixing playing time with his frontcourt. \"This has been a problem I haven't had all year long, as far as having all of our bigs. And now having to juggle the minutes between all of our bigs. I can't play them all every night,\" Drew said. Moments later, Love was scratched with a sore left shoulder. ... G Matthew Dellavedova (concussion) is not with the team on its current trip.\n\nClippers: Rivers said the team can't be concerned with what playoff seeding it ends up with in the tight Western Conference. \"You can't control that. I've been around long enough to know, just play. The basketball gods will tell you where you're playing. Here's the thing you know -- the West is hard. It doesn't matter who you play, it's going to be a hard matchup. So why worry about it?\" Rivers said. ... C Angel Delgado was named NBA G League Rookie of the Year.\n\nUP NEXT\n\nCavaliers: At Phoenix Monday in the second of their five-game trip.\n\nClippers: Host the Grizzlies on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994731.508436
}