{
  "game_id": "0021600391",
  "espn_id": "400899833",
  "date": "Dec 16, 2016",
  "matchup": "CHA @ BOS",
  "headline": "Thomas scores 26 points to lead Celtics over Hornets, 96-88",
  "body": "BOSTON -- The Boston Celtics took their defense from solid in the first half to stifling in the second.\nIsaiah Thomas scored 16 of his 26 points after halftime and Al Horford had 18 points and five blocked shots as Boston beat the Charlotte Hornets 96-88 on Friday night to stop a three-game slide.\n\"Coach just told us we needed to step up our level of energy a little more on the defensive end,\" Horford said. \"We did that and that was the big difference.\"\nGetting Thomas back after he missed four straight games with a groin strain didn't hurt, either.\nThomas scored nine in the third quarter as the Celtics fought back from a 12-point deficit. He added seven in the fourth to help Boston put away the Hornets.\n\"We got stops and got running,\" Thomas said. \"The one thing we did in the fourth quarter is we just spaced the floor and made plays for each other. Guys hit big shots.\"\nAvery Bradley and Jae Crowder added 12 points apiece for the Celtics, who held the Hornets to 13 field goals in the second half.\nCharlotte played without leading scorer Kemba Walker, who did not travel with the team due to personal reasons, and lost its fourth straight.\nAlthough the Hornets outrebounded Boston 54-46, the Celtics outscored them 38-30 in the paint as Charlotte had trouble converting inside.\n\"We have to finish some of these plays,\" coach Steve Clifford said. \"You get these point-blank ones and you don't have the floor balance in there back the other way. There were two or three of those that were huge plays.\"\nNicolas Batum led the Hornets with 22 points and 10 rebounds.\nRamon Sessions had 13 points and six assists, Marco Belinelli scored 11 and Jeremy Lamb added 10 points for the Hornets.\nCrowder hit a 3 with 6:11 left to put Boston up 80-79 after Charlotte scored seven straight points. Thomas drew a flagrant foul by Belinelli and hit both free throws. Boston retained possession because of the flagrant, and Crowder drew another foul and added two more free throws to put Boston ahead 84-79.\nCody Zeller missed from inside for Charlotte, and Thomas came back with a 3-pointer to make it 87-79 with 4:52 left. Charlotte turned it over right away after the inbounds play and Bradley added another 3 that gave Boston a 90-79 cushion with 4:24 to go.\nAfter a basket by Belinelli with 6:32 left completed their 7-0 run, the Hornets went scoreless until his layup with 2:20 remaining cut it to 92-81.\nBoston held Charlotte to five field goals in the third quarter, when the Hornets were 5 of 23.\nCharlotte closed the second on a 14-4 run and took a 50-41 lead into halftime. The Hornets led 60-48 early in the third when the Celtics started their surge. Kelly Olynyk hit a 3-pointer to tie it at 62 with 3:57 left, and it was tied 69-all at the end of the third.\nMISSING KEMBA\nSessions started for Walker and had six assists, but the Hornets' offense appeared lost without Walker.\n\"He's one of the best in the league, so we missed him a lot tonight,\" Batum said. \"We played better tonight overall. But we should have won that game, anyway. No excuses.\"\nCOLD OUTSIDE\nAfter shooting 2 of 14 from beyond the arc in the first half, the Celtics started hitting from outside in the third period. They went 7 of 14 on 3-pointers in the second half and held Charlotte to 19 points in each of the final two quarters.\nWELCOME BACK\nThomas hadn't played since scoring 20 points against Houston on Dec. 5. The Celtics went 1/3 in the games he missed and were happy to have him leading the offense once again.\n\"It helps all of us just because it opens the floor even more. Teams have to play us a little more honest,\" said Horford, who also had eight rebounds, five assists and two steals. \"It's just good to have him back.\"\nTIP-INS\nHornets: Walker is averaging 22.6 points per game. He missed his first game this season, but was expected to return when the Hornets visit Atlanta on Saturday night. Walker's absence made Belinelli and Sessions the only Charlotte players to appear in all 27 games this season.\nCeltics: Jonas Jerebko scored nine points to lead Boston's reserves.\nUP NEXT\nHornets: At the Atlanta Hawks on Saturday night.\nCeltics: At the Miami Heat on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764995521.782776
}