{
  "game_id": "0021800760",
  "espn_id": "401071433",
  "date": "Jan 30, 2019",
  "matchup": "MEM @ MIN",
  "headline": "Towns hits desperate shot, Wolves beat Grizzlies 99-97 in OT",
  "body": "MINNEAPOLIS --  Foul trouble forced Karl-Anthony Towns to watch much of the first three quarters from the bench.\n\nLuckily for the Minnesota Timberwolves, the star center was available -- and in the right spot -- in overtime.\n\nTowns hit a buzzer-beating desperation shot in overtime to lift Minnesota over the Memphis Grizzlies, 99-97 on Wednesday night. Memphis led twice during overtime, but Towns helped the Timberwolves close out their fourth win in a row.\n\nOn the final possession, Andrew Wiggins ran the clock down to six seconds before shooting a pull-up 3. The rebound fell to the right side, where Towns grabbed it, dribbled once and floated up a shot as he faded toward the corner. The ball went in, and Towns tossed up his hands before getting mobbed by teammates.\n\n\"The basketball gods weren't treating me well, but I stuck with it,\" Towns said. \"I was saying, `All right, they owe me one. The gods owe me one and the next chance I get, I'm going to make it.\"\n\nTowns scored all 16 of his points after halftime, and had 10 rebounds in his 26:27 of action\n\nJerryd Bayless had 19 points and a career-high 12 assists for the Wolves on a frigid night with an announced crowd of 13,615. Many fewer actually showed up.\n\nMike Conley had 26 points and eight assists for Memphis, which lost for the 12th time in 13 road games. Marc Gasol had 19 points, and Ivan Rabb had 10 points and 10 rebounds off the bench.\n\n\"It's a microcosm of our season, kind of like the ball bounces in a funny way and KAT's in the right spot,\" Conley said. \"Not only is he in the right spot but he makes the shot. You know, tip-toes the sideline which is a heck of a play on his part. But we did everything we could to extend the game, to win the game.\"\n\nMemphis played its fourth straight game decided by one possession. It has lost three of those games.\n\n\"It's tough, but we're putting ourselves in position, giving ourselves a chance,\" Grizzlies coach J.B. Bickerstaff said. \"Tonight, they made one more play than we did. We just have to make that play when it's called upon.\"\n\nGUARD HELP\n\nMinnesota signed Isaiah Canaan to a 10-day contract Wednesday with the Wolves missing three point guards because of injury. Canaan had three points and one assist in 13 minutes. A six-year veteran, Canaan played 19 games this season for Phoenix, averaging 7.5 points, 3.3 assists and 26.5 minutes.\n\nTIP-INS\n\nGrizzlies: F JaMychal Green returned after missing the previous game with left knee soreness. Green was scoreless in five minutes. ... Jaren Jackson Jr. was questionable to play due to an illness, but the rookie forward started and had 14 points and seven rebounds in 22 minutes. Jackson is the only Memphis player to play in every game this season. ... Omri Casspi (right knee soreness) and Garrett Temple (left shoulder sprain) each missed their third straight game. ... The Grizzlies last road win was Dec. 23 at the Los Angeles Lakers. They won in Minnesota on Nov. 18 and are 8-18 on the road.\n\nTimberwolves: Jeff Teague, Derrick Rose and Tyus Jones all missed the game. Teague has missed five games with soreness in his left foot. Rose hasn't played in the past three games with a sore right ankle, and Jones has missed seven games with a sprained left ankle. F Robert Covington missed his 14th straight game with a right knee bone bruise.\n\nBAYLESS GETS HIS SHOT\n\nWith the injuries at guard, Bayless is receiving his extensive playing time after a run of injuries and misfortune.  He had his first double-double since Nov. 7, 2015, and just the fifth of his career. He was three rebounds shy of his first triple-double.\n\n\"It's been 11 years for me to get this opportunity and I'm trying to take advantage of it as much as I can,\" Bayless said. \"I know how rare and how hard it is for these to come about.\"\n\nUP NEXT\n\nGrizzlies: At Charlotte on Friday night.\n\nTimberwolves: Host Denver on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994916.653677
}