{
  "game_id": "401810099",
  "espn_id": "401810099",
  "date": "Nov 17, 2025",
  "matchup": "MIA vs NY",
  "headline": "Heat survive frantic rally at the buzzer to edge the Knicks 115-113",
  "body": "MIAMI -- — Norman Powell scored 19 points, Kel’el Ware finished with 16 points and 14 rebounds and the Miami Heat held off a frantic rally in the final moments to beat the New York Knicks 115-113 on Monday night.\n\n\r\n              Davion Mitchell scored 18 points for Miami, which got 14 from Simone Fontecchio and 13 apiece from Jaime Jaquez Jr. and Pelle Larsson.\n\n\r\n              Deuce McBride scored 25 for New York, which got 23 from Mikal Bridges and a 22-point, 16-rebound effort from Karl-Anthony Towns.\n\n\r\n              Miami led by 10 with 3 minutes left before the Knicks finished on an 11-3 run. New York got within one point on a 3-pointer by Towns with 22.4 seconds left, and Mitchell pushed Miami's lead back to two about a second later by making the second of two free throws.\n\n\r\n              That set up a most eventful final possession for New York, one in which the Knicks thought they tied the game on a goaltending call that was overturned after review. \n\n\r\n              McBride missed a jumper, Towns got the offensive rebound and missed, and referees said Ware was guilty of goaltending — the call that was overturned. Play resumed with a jump ball at midcourt that the Knicks controlled.\n\n\r\n              McBride missed again, Towns got two more offensive rebounds and missed both attempts to tie, and the game ended with Mitchell having corralled the final rebound for Miami as time expired.\n\n\r\n              The Heat were again without Bam Adebayo (toe) and Tyler Herro (ankle). The Knicks were without Jalen Brunson (ankle) and OG Anunoby (hamstring). Miami had a 43-28 edge in bench scoring; the only Knicks reserves who scored were Josh Hart and Jordan Clarkson, who both finished with 14 points.\n\n\r\n              Up next\r\n              Knicks: Visit Dallas on Wednesday.\n\n\r\n              Heat: Host Golden State on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042643.606729
}