{
  "game_id": "0021600376",
  "espn_id": "400899818",
  "date": "Dec 14, 2016",
  "matchup": "ORL vs. LAC",
  "headline": "Clippers hold off Magic 113-108 for third straight win",
  "body": "ORLANDO, Fla. -- Los Angeles Clippers guard Austin Rivers is proud to have a stat line like he had Wednesday night in any arena.\nTwenty-five points, 7 for 10 from 3-point range and 9 of 12 from the field.\nBut a trip home where his high school jersey was retired Tuesday night was made even more special with an outstanding performance that helped push the Clippers to a 113-108 victory over the Orlando Magic.\nRivers estimated he had about 15 to 20 family members and friends in attendance at Amway Center.\n\"It's great to have a good game anywhere but I'd be lying to you if I said that it's a little bit more fun to do it here,\" said Rivers, who starred at Winter Park High School before going on to Duke. \"That's for sure.\"\nRivers, coming off missing a game due to the NBA concussion protocol, made his biggest long-range shot with 2:18 left to give the Clippers a nine-point lead that proved too much for Orlando to overcome.\n\"We needed every basket,\" said Clippers coach Doc Rivers, Austin's father. \"We were laughing and saying he needs to get hit in the head more. He was terrific.\"\nWith forward Luc Mbah a Moute out with a shoulder injury, Doc Rivers went with a three-guard lineup that included Chris Paul, J.J. Redick and Austin. The Clippers gave up more than usual on defense with the smaller lineup, but they made up for it with explosiveness.\nThe trio combined for 51 points while also keeping the Magic on their heels all night. All five Clippers starters scored in double figures.\n\"It just allows us to play at a different pace,\" said Paul, who finished with 16 points and four assists. \"We played a little faster but it just means we have to scrap. We may give up a little bit but when we are all small like that we have a lot of guys who can score.\"\nThe Magic at times were able to overpower the Clippers smaller lineup. It certainly worked for Aaron Gordon, who had one of his better all-around games with a game-high 33 points and seven rebounds. But defensively, Orlando couldn't keep up and as result fell to 4-9 at home this season.\n\"We're doing the best we can to manage the slippage without practice time and it's not good enough,\" said Magic coach Frank Vogel. \"The smaller lineups are hurting us with our ability to contest and use our size.\"\nHACK-A-JORDAN\nIn effort to slow the Clippers offense down, the Magic turned to an often used strategy in the third quarter. They intentionally fouled Los Angeles center DeAndre Jordan, who has been a poor free throw shooter.\nIt allowed the Magic to outscore the Clippers by nine points in the period but it didn't produce the desire results because Jordan converted 11 of 16 free throw attempts during that two-minute stretch late in the third quarter, which included six straight at one point.\nJordan finished the night with 22 points, which included 12 of 18 from the free throw line.\n\"He's over 50 percent so we don't mind it anymore,\" Doc Rivers said.\nTIPS-INS\nClippers: Small forward Luc Mbah a Moute was held out with a right shoulder injury.\nMagic: Center Nikola Vucevic missed his third straight game with a sore back. ... Serge Ibaka struggled during the first half, picking up three fouls while scoring just three points in 10:17. He finished with just eight points. ... While the Magic attempted to take advantage of Jordan's poor free throw shooting, Bismack Biyombo was the one who was exposed at the line. He converted just one of seven from the line of the night.\nUP NEXT\nClippers: At Miami Heat on Friday night.\nMagic: Host Brooklyn Nets on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995864.0644422
}