{
  "game_id": "0022200293",
  "espn_id": "401468448",
  "date": "Nov 27, 2022",
  "matchup": "MIA @ ATL",
  "headline": "Bam Adebayo has 32 points, Heat rally to beat Hawks 106-98",
  "body": "ATLANTA -- — Bam Adebayo scored 14 of his 32 points in the third quarter, Caleb Martin added 20 points and the Miami Heat snapped a seven-game road losing streak with a 106-98 victory over the Atlanta Hawks on Sunday night.\n\n\r\n              Tyler Herro had 11 points, 10 assists and 11 rebounds and Max Strus had 16 points for the Heat, who outscored Atlanta 34-21 in the third to take charge of the game. They went on a 10-2 run early in the period to make it 65-64 on Kyle Lowry’s left wing 3, and Atlanta trailed the rest of the way. It was Miami’s first lead since it was 3-2.\n\n\r\n              The Heat led by 14 on Martin’s 3, ending a 17-6 run, with 5:45 left in the game.\n\n\r\n              “It was gutty, it was gutty,” Lowry said about the win. “We held a team like that with two superstar players in Trae (Young) and Dejounte (Murray) to under 100 points. It shows a lot from this team. Tyler stepping up and Bam having another effective offensive night and Caleb Martin. He’s been doing it for us. Just continuing to get better and better.”\n\n\r\n              Young finished with 22 points and a season-high 14 assists and John Collins had 23 points and a season-high 14 rebounds for Atlanta, which has dropped two straight and three of four.\n\n\r\n              “They just made us shoot 3s,” Young said after the Hawks went 10 for 36 beyond the arc. “We haven’t been shooting good all year from the 3-point line, so you have to give credit to them and tip your cap to their game plan.”\n\n\r\n              Adebayo, coming off a 38-point performance in a win over Washington on Friday, went 13 for 20 from the field as Miami, which improved to 2-7 on the road, won its third straight.\n\n\r\n              The Hawks were helpless to stop Adebayo’s lob game with Herro.\n\n\r\n              “I feel like we’ve built a great connection,” Adebayo said. “Just building that connection over four years. Man, it feels so much longer than that. It’s not only getting better on the court but it’s getting better off the court. We’re building a brotherhood.” \n\n\r\n              Miami listed 11 of its 16 players on the injury report before the game but overcame the potential setbacks by clogging Atlanta’s passing lanes and outscoring the Hawks 58-34 in the paint.\n\n\r\n              De’Andre Hunter’s left corner 3 for Atlanta gave made it 25-15 for the game’s first double-digit lead. Hunter scored 14 in the first half, Young had 13 and John Collins 11 as the Hawks led 60-51 at intermission. Strus and Adebayo each scored 14 for Miami.\n\n\r\n              TIP-INS\n\n\r\n              Heat: F Jimmy Butler stayed behind in Miami to rehab his sore knee. Coach Erik Spoelstra did not rule out the possibility of Butler being back when the team visits Boston on Wednesday. ... Adebayo surpassed 5,000 career points. ... Strus (right shoulder impingement) started after missing the last two games. ... F Nikola Jovic (foot) did not play. ... Herro (left ankle sprain) played 40 minutes in getting his first career triple-double . ... C Dewayne Dedmon (left plantar fasciitis) had 13 points on 6 for 7 shooting. ... F Duncan Robinson (left ankle sprain) was ruled out.\n\n\r\n              Hawks: C Clint Capela, the league’s third-leading rebounder, missed the game with dental pain. He ranks seventh in field-goal percentage and ninth in blocked shots. ... Dating back to March 3, 2022, Atlanta had scored at least 100 points in 40 straight games, the third-longest streak in franchise history and the longest active streak in the NBA.\n\n\r\n              UP NEXT\n\n\r\n              Heat: At Boston on Wednesday night.\n\n\r\n              Hawks: At Philadelphia on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995159.371671
}