{
  "game_id": "0022400896",
  "espn_id": "401705462",
  "date": "Mar 05, 2025",
  "matchup": "DEN vs. SAC",
  "headline": "Jokic has 22 points, 14 rebounds, Nuggets beat Kings, 116-110",
  "body": "DENVER -- — Nikola Jokic had 22 points and 14 rebounds, Russell Westbrook scored 25 points, and the Denver Nuggets rallied in the fourth quarter to beat the Sacramento Kings 116-110 on Wednesday night.\n\n\r\n              Jamal Murray added 24 points for Denver, which has won the first three games between the teams this season. \n\n\r\n              DeMar DeRozan scored 18 of his 35 points in the third quarter to give Sacramento a 93-84 lead heading into the fourth, but Westbrook gave the Nuggets a lift with seven straight points.\n\n\r\n              Zeke Nnaji's 3-pointer from the top of the circle put Denver ahead 96-95, its first lead since the first quarter, but Zach LaVine heated up after the Nuggets went up 110-104. He scored 12 of his 20 points in the fourth, including two deep 3-pointers that kept the Kings within three.\n\n\r\n              Westbrook hit another 3-pointer and Murray and Jokic sealed it from the line.\n\n\r\n              Takeaways\r\n              Kings: Got a boost from Jake LaRivia, whose 15 points are the most since coming over from Memphis in early February. He scored 11 points in just 4:21 of action in the first quarter and had 15 at halftime but was held scoreless in the second half.\n\n\r\n              Nuggets: Aaron Gordon missed his third straight game with an ankle injury, while Peyton Watson returned after missing 13 games with a knee sprain. Watson had two points in 17 minutes.\n\n\r\n              Key moment\r\n              The Nuggets usually struggle in the non-Jokic minutes but they outscored the Kings 12-2 to start the fourth with the three-time MVP on the bench.\n\n\r\n              Key stat\r\n              Murray was fouled three times on 3-point attempts and made all nine free throws. He went 14 of 15 from the line, finishing with more attempts and makes than Sacramento.\n\n\r\n              Up next\r\n              The Kings host the San Antonio Spurs on Friday night. The Nuggets wrap up their quick two-game homestand Friday night against the Phoenix Suns.\n\n\r\n              ------\n\n\r\n              AP NHL: https://www.apnews.com/hub/NHL",
  "source": "espn_api",
  "crawled_at": 1764998342.4603992
}