{
  "game_id": "0022400808",
  "espn_id": "401705374",
  "date": "Feb 22, 2025",
  "matchup": "DEN vs. LAL",
  "headline": "Lakers snap Nuggets' 9-game winning streak behind Luka Doncic's best game yet for LA",
  "body": "DENVER -- — Luka Doncic scored 32 points in his best game by far with the Lakers, leading Los Angeles to a 123-100 runaway win at Denver on Saturday night that snapped the Nuggets' nine-game winning streak.\n\n\r\n              LeBron James added 25 points, Austin Reaves scored 23 and Rui Hachimura had 21 when he left holding his left side with 10 minutes remaining — the Lakers didn't miss him, going on a 12-2 run to stretch their lead to 19.\n\n\r\n              The Lakers never trailed in winning in Denver for the first time since April 10, 2022. They had lost 13 of their previous 14 against the Nuggets.\n\n\r\n              Doncic averaged 14.7 points in his first three games with the Lakers. He surpassed that less than 10 minutes in and had 19 points by halftime with the Lakers up 63-54.\n\n\r\n              Aaron Gordon scored 24 points and Jamal Murray 19 for Denver, which lost for the first time this month. Nikola Jokic posted his 26th triple-double of the season, but he was just 2 of 7 from the floor with six turnovers.\n\n\r\n              The Nuggets have never won 10 in a row during coach Michael Malone's decade in Denver.\n\n\r\n              Takeaways\r\n              Lakers: Los Angeles returns home for a season-high six-game homestand that begins Tuesday night with a visit from the Dallas Mavericks as Doncic faces his former team for the first time since the Feb. 2 trade that sent him to LA for Anthony Davis.\n\n\r\n              Nuggets: The loss takes a little bit of shine off the Nuggets' recent roll. None of their nine consecutive wins came against teams currently in the top six of their conference.\n\n\r\n              Key moment\r\n              After allowing the Nuggets to score the first eight points of the second half to pull to 63-62, the Lakers went on a 10-0 run sparked by James’ dunk and capped by Doncic’s 3. \n\n\r\n              Key stat\r\n              Both teams were 16 of 41 from long range.\n\n\r\n              Up next\r\n              The Lakers host the Mavericks Tuesday night and the Nuggets visit Indiana on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998346.8699389
}