{
  "game_id": "0022400908",
  "espn_id": "401705474",
  "date": "Mar 07, 2025",
  "matchup": "OKC vs. POR",
  "headline": "Wiggins, Williams lead Thunder past Blazers 107-89 with Gilgeous-Alexander held out for rest",
  "body": "OKLAHOMA CITY -- — Aaron Wiggins scored 30 points, Jaylin Williams had his first career triple-double, and the Western Conference-leading Oklahoma City Thunder beat the Portland Trail Blazers 107-89 on Friday night with MVP candidate Shai Gilgeous-Alexander on the bench.\n\n\r\n              Gilgeous-Alexander was held out for rest, missing just his second game this season. The Thunder were also without Chet Holmgren (lower right leg contusion) and Isaiah Hartenstein (broken nose).\n\n\r\n              They still had more than enough to win their sixth straight game. The Blazers got within two points midway through the fourth quarter, but Williams and Wiggins responded with 3-pointers and the Thunder cruised from there.\n\n\r\n              Williams finished with 10 points, 11 rebounds and 11 assists. Alex Caruso scored 17 points, and Isaiah Joe and Ousmane Dieng had 16 apiece.\n\n\r\n              Scoot Henderson scored 22 points and Shaedon Sharpe added 19 for the Blazers.\n\n\r\n              Takeaways\r\n              Trail Blazers: F Jerami Grant returned after missing four games with tendinitis in his right knee.\n\n\r\n              Thunder: Gilgeous-Alexander, the NBA's leading scorer at 32.8 points per game, earned his rest by scoring 51 points Monday night against Houston and 41 points Wednesday night at Memphis.\n\n\r\n              Key moment\r\n              Williams hit a midrange jumper as the shot clock expired with 4:21 remaining to make it 95-85.\n\n\r\n              Key stat\r\n              Oklahoma City held an opponent under 90 points for the first time since November.\n\n\r\n              Up next\r\n              The Thunder will complete a three-game homestand with back-to-back games against Denver on Sunday and Monday. The Blazers host Detroit on Sunday.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997501.56799
}