{
  "game_id": "0021900958",
  "espn_id": "401161600",
  "date": "Mar 09, 2020",
  "matchup": "MIL @ DEN",
  "headline": "Murray scores 21 as Nuggets beat short-handed Bucks 109-95",
  "body": "DENVER --  Jamal Murray led the Nuggets with 21 points but it was a basket of his that didn't count that really ignited Denver's 109-95 win over the short-handed Milwaukee Bucks.\n\nMurray soared for a thunderous slam dunk over D.J. Wilson  with 9.8 seconds left in the third quarter and Denver clinging to a 74-71 lead Monday night. Wilson jumped in an attempt to prevent the jam and was pulverized on the play, staggering out of bounds.\n\n\"It was crazy,\" Nuggets teammate Jerami Grant said. \"I didn't think he had it in him. Obviously, he does. We've seen it.\"\n\nTweet! came the whistle.\n\nBut instead of and-one, it was no way!\n\nThe biggest of baskets was waved off and a charge called on Murray instead of a foul on Wilson.\n\nThe crowd was incredulous, the Nuggets furious, but coach Michael Malone didn't challenge the call. (He mistakenly said after the game he had already used his challenge).\n\n\"It definitely wasn't a foul,\" Murray said. \"But yeah, I wanted to just drive, and I felt like I had a step, so I just took off.\"\n\nAlthough the whistle went the other way, the play sparked Denver to a season sweep of the NBA-leading Bucks (53-12), who were without their top six scorers -- including reigning MVP Giannis Antetokounmpo (knee).\n\n\"The crowd was phenomenal. After that, the crowd was into it every single play, every single steal, rebound, block, bucket,\" Murray said. \"Once we got them going, they got us going.\"\n\nThe third quarter ended with Mason Plumlee's fast-break layup for a 76-71 Denver lead after Monte Morris blocked Frank Mason III's pull-up 3 from behind.\n\nThen, the Nuggets pulled away with a 33-24 fourth quarter as Nikola Jokic, who took just two shots in the first half, finally found his rhythm and scored eight of his 10 points, including a 3-pointer that snapped an 0-for-13 skid from beyond the arc.\n\nPaul Millsap added 20 points and Grant scored 19 as the Nuggets sent the Bucks to their third straight loss and fourth in five games.\n\nKyle Korver had 23 points to lead a big effort by the Bucks' backups, but Milwaukee sorely missed all that firepower during a fourth consecutive road defeat.\n\n\"At the warmup and certain guys weren't warming up, I was like, 'You playing tonight?' 'Nope, I don't think so.' Different guys are banged up -- we're at that time of year,\" Korver said. \"We've got a good home stretch coming up here and we want to get right. Guys have nicks and knacks and you take care of it. We've got some important games coming up so it was definitely the right call.\"\n\nAnd the Nuggets thought Murray's waved-off basket was definitely the wrong call, albeit one that sparked them even more than any of his 21 points that did count.\n\n\"He definitely raised our energy,\" Grant said. \"He was hitting a ton of big shots.\"\n\nThe Bucks were swept by Denver in the two-game season series. The Nuggets won 127-115 in Milwaukee on Jan. 31 for their signature win this season.\n\nWith Jokic having an off night, Grant and Millsap picked up the slack with 15 first-half points each as the Nuggets raced out to a 16-point lead before Milwaukee cut it to 62-54 at the break.\n\nAntetokounmpo got hurt in a loss to the Los Angeles Lakers on Friday night, and on Sunday afternoon the Bucks said he had a minor sprain of his left knee and would miss at least two games. Milwaukee's 141-130 loss at Phoenix on Sunday marked the first time the Bucks dropped back-to-back games this season.\n\nNow it's a three-game skid.\n\nQUOTE OF THE NIGHT\n\n\"I played Division III basketball, so I can definitely imagine that,\" Bucks coach Mike Budenholzer on imagining Italian sports leagues playing games without fans because of the new coronavirus.\n\nTIP-INS\n\nBucks: Milwaukee got back into the game with eight easy points off five Nuggets turnovers in the second quarter, when the Bucks trimmed a 52-36 deficit by closing the first half on an 18-10 run. ... The Bucks play seven of their next eight in Milwaukee.\n\nNuggets: Jokic continued a recent trend of non-assertive play on the offensive end as he made just one basket in the first half. ... The Nuggets play seven of their next eight on the road -- and their only home game during that stretch is against the Clippers, who beat them by 29 points this month.\n\nUP NEXT\n\nBucks: Host Boston on Thursday night.\n\nNuggets: At Dallas on Wednesday night.\n\n---\n\nFollow Arnie Melendrez Stapleton on Twitter: http://twitter.com/arniestapleton\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996444.348751
}