{
  "game_id": "0021500010",
  "espn_id": "400827897",
  "date": "Oct 28, 2015",
  "matchup": "HOU vs. DEN",
  "headline": "Gallinari's 23 points leads Nuggets over Rockets 105-85",
  "body": "HOUSTON -- If the Denver Nuggets play as well as they did in Wednesday night's opener they will be a much-improved team this season.\nDanilo Gallinari scored 23 points and the Nuggets never trailed in a 105-85 victory over the Houston Rockets in the season opener for both teams.\nThe Nuggets were 30-52 last season and Houston is coming off a trip to the Western Conference finals.\n\"We worked hard enough to come in here and expect to win a game,\" Denver coach Mike Malone. \"This should not come as a shock. Everybody outside of our organization can pick us last if they want, but we feel we have a chance to do something special this year and I think the way we played tonight showed that promise.\"\n\nThe Nuggets were up by nine points with about 9 minutes remaining when they used a 6-0 run -- with four points from rookie Emmanuel Mudiay -- to extend the lead to 85-72 and send fans streaming to the exits.\nJames Harden led Houston with 22 points, but made just 6 of 21 shots and was 2 of 12 from 3-point range.\n\"They shot it much better than we did,\" Houston coach Kevin McHale said. \"They moved it better than we did. They executed better than we did. They played harder than we did. Really there wasn't anything I could look at in there and say we did better than they did.\"\nTwo free throws by Harden cut the lead to six late in the third quarter before Denver closed out the period with seven straight points, highlighted by a 3-pointer by Gallinari to make it 76-63.\nKenneth Faried added 18 points and nine rebounds for Denver while Mudiay, the seventh overall pick in this year's draft, had 17 points but also committed 11 turnovers.\nThe Nuggets scored 26 points off 16 turnovers by Houston.\nPoint guard Ty Lawson made his debut for the Rockets after being traded from the Nuggets this offseason. He finished with 12 points and six assists.\nThe Nuggets jumped to a 12-1 lead when Houston made its first field goal, a 3-pointer by Lawson with 7:28 left in the first quarter.\nThe Rockets got within two points after consecutive 3s by Patrick Beverley and Lawson early in the second quarter. But Denver scored the next six points to push the lead to 35-27.\nHouston was playing without Dwight Howard who was serving a one-game suspension for getting a fourth flagrant foul point in the postseason. The suspension came when he made what the NBA called unnecessary contact with his forearm to the neck area of Golden State's Andre Iguodala in Game 5 of the Western Conference finals where Houston was eliminated.\nTIP-INS\nNuggets F Wilson Chandler missed the game with a strained right hip. ... Houston rookie Montrezl Harrell had eight points. ... Beverley played in a regular-season game for the first time since having wrist surgery in March. ... Rockets F Donatas Motiejunas remains out indefinitely after back surgery in April.\nEARNING THE TRIP BACK\nMalone joked with Gary Harris, Jameer Nelson and Mudiay that if they didn't get five rebounds each they were walking back to Denver after the game. The trio answered his challenge grabbing five apiece. \"So they can fly home tonight,\" Malone said. \"They're good for tonight.\"\nFILLING IN FOR HOWARD\nClint Capela got his first NBA start in place of Howard and had nine points and seven rebounds. Capela played 12 regular-season games as a rookie last season but appeared in each of Houston's 17 playoff games where he averaged 3.4 points and 2.5 rebounds.\nSTAR POWER\nHarden's rumored girlfriend, Khloe Kardashian, was at the game. Kardashian and Lamar Odom filed a court petition dismissing a divorce filing last week, but she said in a statement earlier Wednesday that the move doesn't mean they're reconciling in the wake of the former NBA star being found unconscious in a Nevada brothel.\nREMEMBERING MOSES\nThe Rockets remembered Hall of Famer Moses Malone during a halftime ceremony on Wednesday night. Malone died on Sept. 13, at age 60. The three-time NBA MVP was honored with a video featuring his career highlights and his family took part in an on-court tribute. The Rockets have his No. 24 and the words \"Moses Malone Chairman of the Boards\" on the padding at the bottom of both baskets. Malone who is the NBA's all-time leader in career offensive rebounds with 6,731 played for the Rockets from 1976-82.\nUP NEXT\nNuggets: Denver hosts Minnesota on Friday.\nRockets: Houston hosts Golden State on Friday in a rematch of last year's Western Conference finals.",
  "source": "espn_api",
  "crawled_at": 1764994681.357218
}