{
  "game_id": "0021900226",
  "espn_id": "401160868",
  "date": "Nov 23, 2019",
  "matchup": "CHA vs. CHI",
  "headline": "LaVine scores 49, hits late 3 as Bulls beat Hornets 116-115",
  "body": "CHARLOTTE, N.C. --  One night after questioning his relationship with coach Jim Boylen, the Chicago Bulls' Zach LaVine came through with a big game.\n\nLaVine had a career-high 49 points, including the winning 3-pointer with 0.8 seconds left to give the Bulls a 116-115 win over the Charlotte Hornets on Saturday night.\n\nHe shot 17 for 28 from the field, including 13 for 17 on 3s to tie an NBA record. Only Golden State's Stephen Curry and Klay Thompson had previously made 13 from beyond the arc in an NBA game.\n\nThe night before, LaVine was pulled from the game early in the first quarter after Miami had taken a 13-0 lead. After that 116-108 home loss, LaVine said he sensed a lack of trust from Boylen.\n\nAll was forgotten after Saturday's spectacular individual performance and dramatic comeback.\n\n\"Like I've been saying, we've been playing good in stretches,\" LaVine said. \"We just executed to perfection down the stretch. Obviously, you know, we got blessed a little bit with some luck. We can take this energy and go on to the next game.\n\n\"Hopefully this is that turning point for us. Every team has it. This could be a big step for us in the right direction.\"\n\nRookie Coby White, who starred at the University of North Carolina and playing in front of hundreds of family and friends from his hometown of Goldsboro, N.C., added 28 points for Chicago.\n\nLaVine's late bucket ended a flurry for the Bulls, who trailed by five with less than 10 seconds left before Tomas Satoronsky hit a 3-pointer with 7.1 seconds remaining. On the last play, LaVine scooped up the loose ball after White forced a turnover by Devonte Graham.\n\n\"Once I saw the ball on the ground I was going for it,\" said LaVine, who scooped up the basketball, stepped behind the 3-point line and fired in the game-winner.\n\nLaVine, who entered averaging 19.5 points per game, started his 17th straight game and hit his first three shots -- all 3s -- and two free throws for 11 points in the first 7 1/2 minutes of the game and stayed hot the rest of the night.\n\n\"I've always said Zach is a really good guy, and a good person and he wants to do well,\" Boylen said. \"He wants to help the team. ... My job is to push the guy to a place he can't take himself and that happens sometimes with tough conversations, meetings and maybe some uncomfortable moments but that's what my job is. The credit needs to go to him and his focus, energy and his effort.\n\n\"He is always good when we coach him and talk to him. He wants to play better, I want him to play better and I am really happy for him.\"\n\nTerry Rozier III had a game-high 28 points for Charlotte. Marvin Williams scored 19 of his 21 points in the second half as the Hornets recovered from a 14-point deficit in the first half and led by 11 early in the fourth quarter.\n\nThe Hornets were still ahead by seven at 112-105 with 32.1 seconds left.\n\n\"I mean that's just a tough, tough loss,\" said Graham, who had 18 points. \"Especially for me, turning the ball over right there in that situation. But Zach made an extreme shot and you just have to tip your hat to him for that.\"\n\nCharlotte's previous six victories had come in games in which they had trailed by 10 or more points. And Saturday's game was seconds away from a seventh win after overcoming a double-digit deficit.\n\n\"There was a lot of good to get back in that game,\" Charlotte coach James Borrego said. \"I thought our guys played inspired. We won the boards and we won the paint. We did a number of things very well in this game. Gave ourselves a great shot, a great opportunity there, we just have not been able to close these last few games.\n\n\"You've got to give them credit. LaVine obviously made some incredible shots there down the stretch.\"\n\nTIP INS:\n\nBulls: When told pregame the NBA was considering changes that would alter the regular season and postseason schedules, Boylen offered his blanket support. \"I'm a huge Adam Silver fan and I'm going to worry about coaching my team,\" Boylen said of the league commissioner. \"If they feel that's best for the league and all of us, we're all reaping the benefits of what's been laid down by the league office. And I'll continue to trust that. Whatever they want, I'll support.\"\n\nHornets: Veteran swingman Nic Batum missed the first 11 games of the regular season after suffering a broken finger in his left hand in the preseason. Though he's been coming off the bench, Hornets coach James Borrego applauded Batum's return to his lineup before Saturday's game. \"He's done a good job,\" Borrego said. \"I think he's been a real asset for us on the defensive end. His length, his experience, playmaking, secondary play maker. He's getting his legs underneath him these last few games, so I think he's doing well.\"\n\nUP NEXT\n\nBulls: Host Portland on Monday night.\n\nHornets: Visit Miami on Monday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996100.751366
}