{
  "game_id": "0021900654",
  "espn_id": "401161296",
  "date": "Jan 22, 2020",
  "matchup": "SAC @ DET",
  "headline": "Rose, Jackson lead Pistons to 127-106 rout of reeling Kings",
  "body": "DETROIT --  One Detroit point guard has been carrying the scoring load. Another joined him Wednesday night, with his back now healthy enough to pitch in.\n\nDerrick Rose scored 22 points and Reggie Jackson also had 22 in his return to lineup as the Pistons beat Sacramento 127-106 to hand the Kings their sixth straight loss.\n\nJackson had missed 42 games since leaving the second game of the season with a back injury. He said after this one the stress reaction in his lower back had affected his sleeping but credited the training staff with getting him back on the court.\n\n“Teammates being lenient with me and just being put in a good position. I think all that combined and a little bit of luck, of course,\" Jackson said. \"All that combined allowed myself to just flow pretty easily.”\n\nJackson made a floater on his first attempt and played well in his 19 minutes off the bench, shooting 8 of 14 and handling out four assists.\n\n“He gives us two big-time point guard on the floor,” Pistons coach Dwane Casey said. “When you alternate those guys, you have stability at the point guard position, and that’s what this league is all about, guys that can create and run the floor.”\n\nRose scored 20 or more points for the 10th straight game, tying the career high he set in 2010-11, his MVP season in Chicago. He also eclipsed 11,000 career points and added 11 assists.\n\nChristian Wood scored 23 points, and Svi Mykhailiuk added 13 points, the 11th time in 12 games that he has scored in double figures.\n\nDe’Aaron Fox had 22 points, and Bogdan Bogdanovic added 19 points for the Kings, who shot 12 of 23 from the line (52.2%).\n\n“This was as frustrating as it gets,” Kings coach Luke Walton said. “Basketball is a simple game: Defend without fouling, make the right play and knock down shots early. I feel like we didn’t do any of those things.”\n\nThe Pistons took a 57-50 lead into halftime, and stretched the lead to 93-75 as Jackson beat the third-quarter buzzer with a 3-pointer for Detroit’s largest lead at the time.\n\nThe Pistons led by double digits throughout the fourth, and Sacramento shot 10 for 35 (28.6%) on 3-pointers on the night.\n\n“I think our bad stretches have been happening for too long, too many times,” Fox said. “You just try to play the best basketball you can for the most amount of time. I don’t think we’re doing that right now.”\n\nBoth teams were without their starting post players because of injuries. Sacramento was missing Marvin Bagley III (foot) and Richaun Holmes (shoulder), while Detroit was without Andre Drummond (lip) and Blake Griffin (knee), who is likely out for the season.\n\nTIP-INS\n\nSacramento: With Bagley and Holmes out, Dewayne Dedmon started for the fifth time this season and first since Oct. 28, the season’s fourth game. He played 31 minutes and had 13 points and 10 rebounds, tying his season-high for rebounds in his second double-double of the year.\n\nDetroit: Without league leader Drummond, the Pistons earned a 50-44 rebounding edge. Thon Maker tied his career high with his ninth rebound less than a minute into the second half. He finished with 10 points and 10 rebounds for his first career double-double. Markieff Morris grabbed a season-high 11 rebounds.\n\nNEW GUYS\n\nKent Bazemore made his Kings’ debut after being traded from Portland in a five-player deal on Tuesday that also netted Sacramento Anthony Tolliver. Bazemore scored seven points. Tolliver went scoreless in six minutes.\n\nTolliver played in Sacremento in 2016-17, the 13th NBA stop of his 12th season. He’s also made two stops apiece in Detroit, Portland and Minnesota.\n\nBACK TO THE BENCH\n\nBagley missed eight games with an injured foot suffered on Dec. 26 and returned to action Jan. 13, but was sore after Monday’s loss at Miami, Walton said.\n\n“It’s nothing major, just being cautious with it,” Walton said. “We were hopeful we were past that but you know it’s something that we’ll be safe and smart about it, and then take it day to day and hopefully have them back soon.”\n\nThe second-year player from Duke has also suffered a broken thumb this season and has played 13 games.\n\nROOKIE MISTAKE\n\nAfter 10 straight starts, Pistons rookie Sekou Doumbouya game off the bench Wednesday, scoring four points.\n\nCasey said after the game that Doumbouya was late for morning shoot around.\n\n“We’re teaching winning habits, a winning culture,” Casey said. “And nobody is immune.”\n\nUP NEXT\n\nSacramento: The Kings are playing the fourth of a five-game trip Friday at Chicago.\n\nDetroit: The Pistons play the second of a four-game home stand Friday against Memphis.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996401.4777222
}