{
  "game_id": "0021800961",
  "espn_id": "401071634",
  "date": "Mar 05, 2019",
  "matchup": "TOR vs. HOU",
  "headline": "Harden scores 35, Rockets beat Raptors 107-95",
  "body": "TORONTO --  James Harden and the Houston Rockets watched a big lead evaporate, yet managed to keep their winning streak intact.\n\nHarden scored 19 of his 35 points in the final quarter, Gerald Green had 11 of his 18 in the fourth and the Rockets beat the Toronto Raptors 107-95 on Tuesday night.\n\nEric Gordon and Austin Rivers each scored 13 points as the Rockets won their sixth straight, matching a season high.\n\nKawhi Leonard scored 26 points and Serge Ibaka had 10 points and 15 rebounds for Toronto. Pascal Siakam had 17 points, and Danny Green 14 as the Raptors had their seven-game home winning streak snapped.\n\nHarden, the NBA's leading scorer, made 12 of 30 shots, including three of nine from long range. He was perfect at the foul line, hitting all eight of his attempts.\n\nHouston's Chris Paul said his MVP teammates makes scoring look easy. It isn't, Paul cautioned.\n\n\"If it was that easy, everybody would do it,\" Paul said.\n\nHarden, who eclipsed 18,000 career points Tuesday, has scored 28 or more points in 39 straight games. It's the second-longest streak in NBA history. Wilt Chamberlain (71 games) holds the record.\n\nThe Raptors overcame a 22-point second quarter deficit to reclaim the lead in the third, but couldn't hold on in the fourth. The Rockets turned it on, connecting on seven of their first eight shot from 3-point range. Houston made 15 of 34 attempts from beyond the arc.\n\n\"We locked back in,\" Harden said. \"Our second unit did an unbelievable job of getting stops and creating opportunities on offense, and that was the game.\"\n\nHarden made six of seven field goals in the fourth, including a pair of 3-pointers. He also had five foul shots in the quarter.\n\n\"I was playing well, but I wasn't shooting it well,\" Harden said of his performance through three quarters. \"I had a lot of opportunities at the rim that I didn't convert on, so I wanted to make sure I converted on those, because that was the game right there.\"\n\nThe Rockets outscored the Raptors 23-7 on fast break points and turned 13 Toronto turnovers into 26 points. Houston had scored 17 points off turnovers before allowing any of their own.\n\n\"We've just got to do better,\" Siakam said. \"Not enough energy.\"\n\nTeammates Kyle Lowry echoed Siakam's comments on the heels of Toronto's second straight defeat. The Raptors lost in overtime at Detroit on Sunday. Toronto is 3-3 since the All-Star break\n\n\"We've got to play harder as a group and continue to get better,\" Lowry said.\n\nHarden missed seven of 10 shot attempts in the first, but scored nine points as the Rockets led 23-19 after one.\n\nHouston opened the second with a 19-4 run to take a 42-23 lead at 7:28. Green and Rivers each scored seven in the quarter and Houston led 55-37 at halftime. For the Raptors, it was their lowest-scoring half of the season.\n\nToronto roared back as Houston missed 11 of its first 12 attempts to begin the second half. Siakam's basket at 4:44 of the third put the Raptors up 60-59, erasing what had been a 22-point deficit. Siakam scored 15 in the quarter and the Rockets were 4-for-23 shooting as Toronto took a 71-69 lead into the fourth.\n\nTIP-INS\n\nRockets: F Kenneth Faried (left hip) and G Iman Shumpert (right calf) were inactive. Coach Mike D'Antoni said both are day-to-day. ... Chris Paul led the Rockets with 10 assists, while Clint Capela had 15 rebounds. ... The Rockets have won four straight road games and eight of 11. They're 17-16 away from home.\n\nRaptors: Ibaka had a season-high five blocks. ... The Raptors dropped to 9-1 on Tuesdays. ... Toronto had not lost at home since a 105-92 defeat to Milwaukee on Jan. 31.\n\nSTREAKING ROCKET\n\nHarden has led Houston in scoring in 42 consecutive games, the fifth-longest streak in NBA history.\n\nKEY NUMBER\n\nToronto is 3-6 when failing to score at least 100 points.\n\nUP NEXT\n\nRockets: Host Philadelphia on Friday.\n\nRaptors: Visit New Orleans on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994252.303626
}