{
  "game_id": "0021900910",
  "espn_id": "401161552",
  "date": "Mar 03, 2020",
  "matchup": "BKN @ BOS",
  "headline": "LeVert scores 51 points, Nets stun Celtics 129-120 in OT",
  "body": "BOSTON --  Kevin Durant called it a masterpiece. The Celtics called it an unacceptable collapse. The Brooklyn Nets were just happy it ended up as a victory.\n\nCaris LeVert scored 37 of his\n\nin the fourth quarter and overtime to help the Nets erase a 21-point, second-half deficit and beat Boston 129-120 on Tuesday night.\n\n\"The basket was so big at that point. I got some easy layups going to the rim,\" LeVert said. “I’m just trying to get a good look.”\n\nIt was a stunning end to a four-game losing streak for Brooklyn, which is trying to hold onto the final playoff spot in the Eastern Conference. Boston has lost two straight.\n\nLeVert had all of Brooklyn's 11 points in the extra period, finishing just three points shy of the Nets' season high for a player. Kyrie Irving scored 54 points against Chicago on Jan. 31.\n\nNets coach Kenny Atkinson pulled his starters in the third quarter before inserting LeVert in the fourth. LeVert sent the game to the extra frame, getting fouled on a 3-point attempt by Marcus Smart and connecting on all of his free throws with 0.2 seconds left.\n\n“The second quarter, I think I only had like two buckets that quarter and the third quarter I didn’t score,” LeVert said. “I knew that if I got the chance to go back in there we had a shot at winning the game.”\n\nThat capped a 51-point fourth quarter by the Nets, a franchise record for most points in any period.\n\n“It’s really hard to even comment,\" Atkinson said. \"I’m trying to, like, process it all -- 51 points in the fourth quarter against a team like that.”\n\nKevin Durant, who is out for the season recovering from a torn Achilles tendon,\n\n.\n\n“That 50 was beautiful, Vert,” Durant tweeted. “Thank you for that masterpiece.\"\n\nIrving, who left the Celtics in free agency this past summer, was sidelined for the Nets' second visit of the season to Boston after undergoing arthroscopic surgery on Tuesday to relieve a right shoulder impingement. Irving was ruled out for the season in February because of the injury.\n\nHis absence didn't stop fans from taunting him with chants of “Where is Kyrie? Where is Kyrie?” in the fourth quarter.\n\nJaylen Brown led Boston with 22 points. Kemba Walker returned to action following a five-game absence with left knee soreness and had 21 points. Smart added 14 points and 10 rebounds before fouling out in overtime.\n\nSmart had some words for officials after the final buzzer and had to be separated by teammates before being led into the tunnel.\n\nBoston went just 1 for 6 from the field in overtime.\n\n“Sometimes things don't go your way and the other team gets to feeling really good and then you feel like the weight of the world is on your shoulders to finish the game,” Celtics coach Brad Stevens said. “Usually you do that with your effort. ... We didn't get any of that stuff. So we deserved to lose.”\n\nThe Celtics played without Jayson Tatum, who sat out with an illness. They also lost Gordon Hayward, who left the game at halftime with a bruised right knee. Boston scored 23 points off 21 Brooklyn turnovers and was in control before the Nets rallied behind LeVert and their bench.\n\n“You've got to treat it as a learning experience,\" Hayward said. \"When you take your foot off the gas, anybody can come back on you,”\n\nTIP-INS\n\nNets: The Nets’ previous highest-scoring period this season was 43 points in the fourth against Charlotte on Nov. 16. The franchise record is 48 points in the fourth quarter on March 9, 1980, against Detroit. ... Nets guard Garrett Temple, who sprained his right shoulder in Saturday's loss at Miami, played 22 minutes.\n\nCeltics: Hayward said his knee was sore, but he doesn't think the knee injury is serious. Still he doesn't expect to travel with the team for Wednesday's trip to Cleveland. ... Boston lost its third consecutive overtime game at home.\n\nWILD FOURTH\n\nThe Nets cut it to 116-112 with less than a minute to play when Brown came up empty on a jumper. LeVert was fouled on Brooklyn's next trip down the floor, but made just one of two free throws.\n\nBrooklyn got the rebound and LeVert had a great look at a 3, but his shot rattled in an out. Boston's Daniel Theis got the rebound, was fouled and hit both of his free throws.\n\nDeAndre Jordan got a dunk with 6.7 seconds left to make it 118-115. The Celtics had trouble getting the ball in bounds and Rodions Kurucs forced a tie up with Walker with 3.6 seconds left. He won the jump ball and called timeout with 1.4 seconds left.\n\nBrooklyn got the ball into LeVert, who was fouled and calmly sank his three free throws.\n\nNOT IN MY HOUSE\n\nSmart showed off his leaping ability when he\n\nat the rim in the first quarter. Smart celebrated the denial by running down the court giving a Dikembe Mutombo-esque wag of his finger.\n\nUP NEXT\n\nNets: Open three-game homestand at Memphis on Wednesday.\n\nCeltics: Visit Cleveland Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Kyle Hightower on Twitter at https://twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764996703.245632
}