{
  "game_id": "0021900244",
  "espn_id": "401160886",
  "date": "Nov 25, 2019",
  "matchup": "SAC @ BOS",
  "headline": "Celtics hold off Kings 103-102 despite Hield's 41 points",
  "body": "BOSTON --  Marcus Smart had the ball bounce right for him and the Boston Celtics this time.\n\nJaylen Brown scored 24 points, Jayson Tatum had 20 and the Celtics held off the Sacramento Kings 103-102 despite a career-high 41 points from Buddy Hield on Monday night.\n\nSmart had 17 points, including two key baskets, and seven assists. Enes Kanter added 13 points and nine rebounds for the Celtics, who had lost the final two games of a 2/3 trip to the West.\n\nSmart sandwiched his baskets around a 3-pointer by Bogdan Bogdanovic, the second a spinning shot with 31 seconds to go that pushed the Celtics ahead 103-102. The first bounced off the front of the rim and fell in -- a similar look to one that went the other way as time expired when the teams met in Sacramento.\n\n\"Yeah, it was a good feeling,\" he said, smiling, of the friendly roll. \"When I shot it, I saw it on the front of the rim again and I was like: `Not again. I've got to get it this time.' It felt good to see the ball finally go in. It's just ironic it happened to bounce like that again this time.\"\n\nIn the team's first meeting on Nov. 17 -- a 100-99 Kings victory that snapped Boston's 10-game winning streak -- Smart drove and had his shot roll off the front as time expired.\n\nHarrison Barnes added 20 points for the Kings, who had won seven of 10. Hield was 15 of 26 from the floor and went 11 for 21 on 3-point attempts.\n\n\"They're (defenders) locked into Buddy, and to win in this league it takes a team. So we're going to keep looking for him, but we need everyone to step up and make plays, and I thought we did it tonight,\" Kings coach Luke Walton said. \"We didn't score the last one, but we gave ourselves a chance.\"\n\nBoston picked up the victory despite missing three starters. Kemba Walker was sidelined with a neck strain after a scary collision with a teammate last week. Gordon Hayward has a fractured hand and Daniel Theis was sick.\n\n\"It's one game. We've just got to find ways to win. We'll welcome Kemba back when he's healthy. Let him rest up,\" Brown said. \"We're just holding it down for him and Gordon until they make their return. It's great to find ways to win, even with injuries. We've got to continue to do that, and I'm looking forward to it.\"\n\nHield hit his 11th 3-pointer to cut Sacramento's deficit to 97-96. Brown countered with a short jumper in the lane before Cory Joseph tied it with a 3 in front of Boston's bench with 1:06 to play.\n\nWith Boston clinging to its 103-102 edge, Tatum airballed a long shot from the right corner, and Hield grabbed the rebound with 5.7 seconds left.\n\nBogdanovic's long jumper bounced off the rim, and the ball was tipped out of bounds in a battle for the rebound as the horn sounded.\n\nHield scored 21 points in the third quarter, going 8 for 11 from the floor, including 5 of 8 from beyond the arc, and the teams entered the fourth tied at 75. Brown had nine in the quarter.\n\n\"In the third quarter, I felt good,\" he said. \"I just came in locked in. All it takes is one to go in, and it started trickling down the lineup.\"\n\nBut, at the start of the fourth, Hield headed to the locker room and a trainer was stretching both of Brown's legs while he was on his back at the side of the bench.\n\nBoth returned midway into the final quarter.\n\nTIP-INS\n\nKings: In their last meeting against the Celtics, Hield had a game-high 35 points for his only other 30-point game this season. It was his 10th career game of 30 or more, and three have come against Boston. ... Richaun Holmes entered tied for the league lead in field goal percentage (66.1). He went 4 for 6 and finished with 8 points.\n\nCeltics: Head team physician Dr. Tony Schena said Walker didn't suffer a serious injury, but the Celtics were going to keep him out until he goes through a full practice, which is expected to be Tuesday. The doctor said Walker didn't have a concussion, but the team is going through the protocol. . Hayward (fractured left hand) worked out Sunday without a brace and sat on the bench in street clothes without one Monday. . Smart had his left ring wrapped after the game. He said he jammed it.\n\nMOPPING UP\n\nThe ball got stuck between the shot clock and top of backboard in the first quarter. Smart grabbed a mop, turned it upside down and pushed the ball free with the handle.\n\nYOUNG AT HEART\n\nCoach Brad Stevens joked about having so many young players on the court at the same time.\n\n\"Butler had older players today,\" he said of where he coached in college before the Celtics hired him.\n\nUP NEXT\n\nKings: At the Philadelphia 76ers on Wednesday in the finale of a four-game trip.\n\nCeltics: Host the Brooklyn Nets on Wednesday in what would have been Kyrie Irving's return, but he's sidelined with a shoulder injury.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996415.110846
}