{
  "game_id": "0022400399",
  "espn_id": "401704965",
  "date": "Dec 23, 2024",
  "matchup": "MEM vs. LAC",
  "headline": "Powell leads the Clippers to a 114-110 victory over the Grizzlies",
  "body": "MEMPHIS, Tenn. -- — Norman Powell scored 29 points, including four in the final 25 seconds to lead the Los Angeles Clippers to a 114-110 victory over the Memphis Grizzlies on Monday night.\n\n\r\n              With the game tied at 110, Powell hit a 14-foot jumper with 25 seconds left and then converted two free throws to give the Clippers their third win in four games. James Harden had 21 points, nine assists and eight rebounds, and Ivica Zubac finished with 20 points and a season-high 20 rebounds.\n\n\r\n              Jaren Jackson Jr. led Memphis with 24 points, and Ja Morant scored 23. Desmond Bane had 21 points and seven assists.\n\n\r\n              The game was close throughout. By late in the fourth quarter, there had been 13 lead changes and nine ties.\n\n\r\n              Takeaways\r\n              Clippers: They were able to keep Memphis at bay until the final push by Powell, with help from Harden in the fourth quarter.\n\n\r\n              Grizzlies: Committed 19 turnovers that led to 31 points for Los Angeles.\n\n\r\n              Key moment\r\n              Early in the third quarter, the Grizzlies were on the break with Jaylen Wells leading the attack. He found Morant near the top of the key, and the 6-foot-2 star went straight at Zubac protecting the rim. At the last second, Morant spun like a cyclone, flipped the ball over his head from the left side and banked it in.\n\n\r\n              Key stat\r\n              Memphis leads the NBA with 58.7 points in the paint per game but was held to 42. The Grizzlies also finished 13 points below their league-leading average.\n\n\r\n              Up next\r\n              The Clippers host Golden State on Friday. The Grizzlies host Toronto on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997735.2728949
}