{
  "game_id": "0021800243",
  "espn_id": "401070924",
  "date": "Nov 19, 2018",
  "matchup": "ATL vs. LAC",
  "headline": "Harrell, Williams rally surging Clippers past Hawks 127-119",
  "body": "ATLANTA --  Montrezl Harrell doesn't mind trailing on the road when the Los Angeles Clippers still have a chance in the fourth quarter.\n\n\"It definitely builds your character,\" he said. \"We got the ball to the guys we wanted to get the ball to. We keep playing. We keep fighting.\"\n\nHarrell had 25 points and 11 rebounds, Lou Williams added 16 points and a season-high 11 assists, and the Clippers rallied past the struggling Atlanta Hawks 127-119 on Monday night to win their fifth straight game.\n\nTobias Harris scored 24 points and Mike Scott had a season-high 18 on six 3-pointers for the Clippers, who erased a 15-point deficit in the second half for the second consecutive game.\n\nThe Clippers, playing without second-leading scorer Danilo Gallinari, improved to 11-5. At this point last season, after winning in Atlanta, they were 5-11.\n\nTrae Young scored 19 of his 25 points in the first half, and Taurean Prince had 21 points for the rebuilding Hawks, who dropped to 3-14 and have lost eight in a row.\n\n\"I know everybody in Atlanta wants us to win now,\" Young said. \"It's tough because we're right there. It's just that finish, and we're going to get it done.\"\n\nLos Angeles trailed 87-72 in the third quarter, but went on a 20-4 run to take a 97-96 lead early in the fourth. Young lost the ball on the Atlanta end, and Williams whipped a pass across the baseline to Scott for a 3 that prompted the Hawks to call a timeout.\n\nAtlanta quickly regrouped, taking the lead back when Prince, who missed the previous two games with an Achilles injury, dunked on the ensuing possession. A 3-pointer by Alex Len put the Hawks up by five.\n\nIt was all Los Angeles from there. Scott hit a 3 off an assist from Williams to give the Clippers the lead for good with 4:08 remaining. Williams fed Harrell for a strong reverse layup and a three-point play, and Harrell followed by knocking away Young's pass before Scott hit another 3 to make it 117-110.\n\nWilliams, in his 14th season and second with the Clippers, knows his younger teammates depend on him to set the tone as the leader off the bench.\n\n\"I've seen a lot in this league,\" he said. \"I have probably been in every single position that you could be in. Whether it's being almost an All-Star, starting or coming off the bench, I have a lot of experience, and when I talk, guys listen.\"\n\nGallinari was sick and unable to play for the first time this season. Avery Bradley started in his spot after missing the last six games with a left ankle sprain, finishing with five points in 20 minutes.\n\nThe Clippers have won seven of eight. Atlanta has dropped 12 of 13.\n\nHarris scored 12 points in the first period, but the Hawks were ahead by five entering the second. Young gave Atlanta its biggest lead at eight with a fast-break layup.\n\nLos Angeles went on a 15-3 run to take a 50-44 lead on Patrick Beverley's fast-break layup before the Hawks' 14-3 run put them up by seven on DeAndre' Bembry's free throws. Harris ended the first half with a long 3 that made it 64-61.\n\n\"We keep putting ourselves in holes, which is too dangerous,\" Clippers coach Doc Rivers said. \"This is a really fun team to coach.\"\n\nSOLID RETURN\n\nJohn Collins, in his second game back for Atlanta after missing the first 15 this season with a left ankle injury, had 18 points, six assists, three rebounds and five fouls in 21 minutes. Hawks coach Lloyd Pierce had Collins on a limit of playing in bursts of 3-4 minutes before coming out.\n\nHURTING\n\nHawks forward Omari Spellman started but left after four minutes with a bruised right hip.\n\nPOOR TIMING\n\nBeverley was called for a technical in the third after disputing a foul call with official Courtney Kirkland, and Atlanta scored the next 11 points to take an 87-72 lead. Early in the fourth while he was on the bench, Beverley and Rivers made gestures of disbelief that Kirkland called a foul on Scott even though Len had his arms around him. Beverley did not return to the game.\n\nUP NEXT\n\nClippers: Visit Washington on Tuesday.\n\nHawks: Host Toronto on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995380.0194938
}