{
  "game_id": "0022300484",
  "espn_id": "401585112",
  "date": "Jan 05, 2024",
  "matchup": "CHA @ CHI",
  "headline": "Coby White scores 22 points as the Chicago Bulls beat the Charlotte Hornets 104-91",
  "body": "CHICAGO -- — Coby White had 22 points, 10 rebounds and six assists, and the Chicago Bulls welcomed back Zach LaVine and Nikola Vucevic with a 104-91 victory over Miles Bridges and the Charlotte Hornets on Friday night.\n\n\r\n              DeMar DeRozan added 17 points for Chicago, which had lost three of four. Andre Drummond grabbed 10 rebounds in his sixth consecutive game with double-digit boards.\n\n\r\n              LaVine scored 15 points while playing almost 30 minutes in his first game since Nov. 28. Vucevic had 11 points and seven rebounds in 25 minutes while also playing as a reserve.\n\n\r\n              LaVine was sidelined for 17 games because of inflammation in his right foot. Vucevic missed the past five games with a strained left adductor. \n\n\r\n              “Physically, all good, you just have to catch your wind ... but I felt good. I'm going to get my wind over the next couple of games,” LaVine said. “I think I did good. Missed a couple of open shots that I thought I should make, but other than that, I tried to go out there and play as hard as I could.”\n\n\r\n              Bridges scored 28 points for the Hornets, who closed out a 1-5 road trip. Terry Rozier had 15 points on 5-for-17 shooting, and Cody Martin finished with 13 points.\n\n\r\n              “It was a challenging trip, but actually the guys did well,\" Hornets coach Steve Clifford said. “I thought we played a little tired tonight but we hung in there.” \n\n\r\n              While LaVine and Vucevic returned, Alex Caruso and Patrick Williams were late scratches for Chicago. Caruso was sidelined by a sore neck, and Williams has an ankle injury. \n\n\r\n              Vucevic said he might be back in the starting lineup on Monday against Charlotte without a minute restriction. \n\n\r\n              “I think it was just the first game kind of figuring out my minutes and stuff, but since everything went fine I think going forward it shouldn't be an issue,” Vucevic said. \n\n\r\n              LaVine made his presence felt at the end of the first half. He went in for a breakaway dunk and followed with a 3-pointer to give the Bulls a 47-41 lead at the break.\n\n\r\n              “I thought our transition defense really hurt us tonight, too,” Clifford said. \n\n\r\n              Chicago pulled away when it opened the fourth quarter with a 16-4 run. Ayo Dosunmu made a 3-pointer and followed that up with another basket, and DeRozan converted a three-point play to make it 90-73 with 7:41 left.\n\n\r\n              After scoring 34 points in Tuesday’s win at Sacramento, Rozier didn’t get on the board until he made two foul shots with 9:52 left in the third quarter. He scored 11 points in the period, including a four-point play that trimmed Chicago’s lead to 74-69 going into the fourth.\n\n\r\n              Hornets rookie Brandon Miller was back in the starting lineup after missing Tuesday’s game with a bruised left hip, but LaMelo Ball (right ankle sprain), Gordon Hayward (left calf strain), Mark Williams (bruised lower back) and Frank Ntilikina (left tibia fracture) remained out.\n\n\r\n              PJ Washington left the game in the first quarter with a right ankle injury. \n\n\r\n              Miller finished with nine points.\n\n\r\n              UP NEXT\n\n\r\n              The Hornets host the Bulls on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995974.6636548
}