{
  "game_id": "0022000657",
  "espn_id": "401307446",
  "date": "Mar 22, 2021",
  "matchup": "TOR @ HOU",
  "headline": "Rockets end skid at 20, Wall has 1st triple-double since '16",
  "body": "HOUSTON -- — Stephen Silas walked off the court at halftime believing he'd seen a sign.\n\n\r\n                    Danuel House Jr. swished a 51-footer at the buzzer, sending the Rockets to the locker room on a high after 20 straight games of nothing but lows.\n\n\r\n                    “I was like, ‘Whoa, maybe this is the night,’” the Rockets coach said. “It felt like something special had happened. For us, something special happening is a win after so many losses in a row.”\n\n\r\n                    The Rockets went on to snap their 20-game losing streak Monday night, as John Wall had his first triple-double in five years in a 117-99 victory over the Toronto Raptors. \n\n\r\n                    Houston’s skid was tied for the ninth-worst in NBA history and the longest since Philadelphia’s record-setting, 28-game losing streak across the 2014-15 and 2015-16 seasons.\n\n\r\n                    But Wall had 19 points, 10 assists and 11 rebounds, his first triple-double since March 17, 2016. That helped the Rockets got their first win since Feb. 4. \n\n\r\n                    “It’s like indescribable for a win in March of this crazy season, but I’m just so proud of the guys,” Silas said. “When you’re going through it and fighting so hard and seeing the disappointment in the players’ faces after loss after loss after loss, and to go into the locker room after today’s game and everybody is so happy and joyous is just super cool and great.”\n\n\r\n                    Wall found Silas after the game and gave him a big hug. \n\n\r\n                    “I just told him, ‘We finally got one,’” Wall said. “I told him I’m riding with him no matter what, and he said the same thing to me. No coach wants to deal with all this adversity he’s had to deal with in their first year. I’m happy for him.”\n\n\r\n                    Houston also handed the Raptors their ninth straight loss, which now represents the NBA’s longest active losing streak. \n\n\r\n                    All five Houston starters scored in double figures by midway through the third quarter. Jae’Sean Tate had 22 points, Sterling Brown added 20, Christian Wood scored 19 and House added 12. \n\n\r\n                    Houston led 65-60 at halftime after House's heave from well behind the halfcourt line near the Raptors bench on the sideline. The Rockets closed out the third quarter with an 88-86 lead and opened the fourth quarter on a 9-1 run to pull away. \n\n\r\n                    Houston overcame a rough first half where Wall received a technical foul for a third straight game, arguing with an official five minutes into the first quarter. Wood picked up his third personal foul less than three minutes into the second quarter and was limited to just eight scoreless first-half minutes.\n\n\r\n                    Fred VanVleet led Toronto with 27 points and was frustrated after the loss. \n\n\r\n                    “If you’re not going to play defense, you better score more than 99 points,” VanVleet said. \n\n\r\n                    Pascal Siakam scored 21 points, Normal Powell had 19 and Kyle Lowry added 17. \n\n\r\n                    Brown made his first five shots, including three 3s, for 13 first-quarter points. He finished 7 of 10 and 4 of 7 from 3. \n\n\r\n                    The Raptors led 28-27 at the end of the first quarter. In their losing streak, Houston led after the first quarter only three times, including on Feb. 26 when they led the Raptors 31-30. \n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: DeAndre’ Bembry was ejected from the game after receiving two back-to-back technical fouls in the fourth quarter. ... Toronto has lost seven straight on the road. ... Chris Boucher had 10 rebounds off the bench. \n\n\r\n                    Rockets: SG Victor Oladipo was out with right quad injury maintenance. ... PG D.J. Augustin returned after a one-game absence with a stomach illness. ... PG Kevin Porter Jr. was sidelined with right quad soreness. \n\n\r\n                    COACH SUPPORT\n\n\r\n                    After Silas’ postgame interview following Sunday’s loss went viral for how visibly frustrated he appeared to be, the first-year coach said he heard from many coaches, including Rick Carlisle, Brad Stevens, Doc Rivers, Steve Kerr, Luke Walton, Doug Collins and Don Nelson, who talked about their losing streaks and offered support. \n\n\r\n                    “What those guys did for me means the world to me, and I’m going to reach out to every, single one of those guys to tell them, ‘Thank you,’” Silas said. \n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Return home Wednesday night for a three-game homestand starting with Denver.\n\n\r\n                    Rockets: Host Charlotte on Wednesday night to close out a seven-game homestand.",
  "source": "espn_api",
  "crawled_at": 1764996845.534719
}