{
  "game_id": "0021800543",
  "espn_id": "401071219",
  "date": "Dec 31, 2018",
  "matchup": "CHA vs. ORL",
  "headline": "Walker, Monk lead Hornets past Magic, 125-100",
  "body": "CHARLOTTE, N.C. --  Even after losing two starters to injury, Charlotte coach James Borrego had reason to be encouraged.\n\nThe Hornets' 125-100 victory Monday night, their franchise-record 13th straight win over the Magic, included the kind of team play the first-year coach has been seeking.\n\n\"I think there was an unselfish spirit out there,\" Borrego said. \"It started with the first group. The second group came in, and they kept it moving. I felt, for the most part for 48 minutes, it was a very complete, unselfish ball-movement game.\"\n\nKemba Walker scored 24 points in just 27 minutes. He had 20 points on 8-of-11 shooting in the first half and did not play in the fourth quarter.\n\nMalik Monk added 21 points as the Hornets put six players in double figures in the easy victory over the Magic and Steve Clifford, who coached Charlotte for five seasons.\n\nIt was Monk's fourth 20-point game in 32 appearances this season, after he had five all of last year. Monk said he wants to bring energy off the bench and \"attack, attack, attack.\"\n\n\"If nothing else worked, I would give it up,\" he said. \"But it was working tonight, so I'm just going to try to keep doing that.\"\n\nCody Zeller added 14 points in 24 minutes before fracturing a bone in his right hand in the third quarter. He will miss an unspecified amount of time, pending further evaluation.\n\n\"I feel bad for Cody because he's having such a great year, a big year for us,\" Borrego said. \"It's just an unfortunate break for him.\"\n\nJeremy Lamb strained his right hamstring in the first quarter and also did not return.\n\nThe Hornets improved to 18-18 with their second win in three games.\n\nAaron Gordon scored 14 points and Nikola Vucevic had 12, but he did not play after leaving the court with a knee injury late in the third quarter. Mo Bamba had 12 rebounds in 18 minutes for the Magic, who opened a six-game trip by having a two-game winning streak snapped.\n\nOrlando led 14-4 in the opening minutes, but the Hornets answered with a 20-4 run over the next 4  1/2 minutes. Charlotte's first-quarter lead reached 36-23 after a dunk by Monk.\n\nWalker found Monk open in the corner for a 3-pointer as the first half clock expired, giving the Hornets a 63-53 lead.\n\nMarvin Williams, Willy Hernangomez and Devonte Graham added 10 points apiece for the Hornets.\n\nThe Hornets got a boost off the bench from rookie guard Graham, who scored all his points in the third quarter, helping the Hornets extend their lead to 95-77 through three.\n\nTIP-INS\n\nMagic: D.J. Augustin (sprained right ankle) and Jonathan Simmons (sprained left ankle) did not play. Jerian Grant started in place of Augustin. . With the score tied at 18, Jonathan Isaac missed a breakaway dunk. The Hornets took their first lead on the next possession on Lamb's runner and never trailed again.\n\nHornets: Lamb played nine minutes and finished with nine points and hit all four of his shots. . Zeller also had six rebounds in 24 minutes.\n\nCLIFFORD RETURNS\n\nClifford's Charlotte teams went 196-214 and made two playoff appearances. His first visit back came one day after the Magic's 109-107 home win over Detroit, though, so it left little time to reminisce.\n\n\"As you know, I loved my time here,\" Clifford said before the game. \"These back-to-backs man, it's so hectic. We got here last night, I was up early, watched tape all day and just walked in here. So this wasn't one of those trips where there was really much time to think about anything.\"\n\nBOTH SIDES OF THE STREAK\n\nOddly, Clifford now finds himself on the other side of the Hornets' 13-game win streak against the Magic. Instead of trying to add to it, he'd now like to end it.\n\n\"I always felt like we played some of our best games, and I never thought it was a matchup or anything, but it's something we have to figure out, obviously,\" he said.\n\nUP NEXT\n\nMagic: Visit Bulls Wednesday.\n\nHornets: Host Dallas Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994397.1468601
}