{
  "game_id": "0022000251",
  "espn_id": "401267411",
  "date": "Jan 24, 2021",
  "matchup": "LAC vs. OKC",
  "headline": "Clippers beat Thunder 108-101, tie for NBA's best record",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 34 points and the Los Angeles Clippers beat Oklahoma City 108-101 on Sunday for their seventh consecutive victory and second straight over the Thunder.\n\n\r\n                    Serge Ibaka added 17 points. At 13-4, the Clippers are tied with the Lakers for the best record in the NBA. Leonard's total was one off his season high to go with nine rebounds and eight assists. He had 31 points in LA's 14-point win over the Thunder on Friday night.\n\n\r\n                    “On a night when we weren’t making shots, it was a good, tough, grind-out win for us,” Clippers coach Tyronn Lue said. “Kawhi had it going so we played through him a lot, especially in the second half. We had to ride him pretty hard just so we could continue to keep the lead.”\n\n\r\n                    Shai Gilgeous-Alexander led the Thunder with 23 points against his former team, and George Hill added 22 points. Oklahoma City has lost three in a row and five of six.\n\n\r\n                    “It was a huge improvement from the first game,” forward Isaiah Roby said. “We came out with a lot more fight this game.”\n\n\r\n                    Hill hit three straight 3-pointers for the Thunder after they trailed by 17 in the fourth. Reggie Jackson turned the ball over and Luguentz Dort fed Gilgeous-Alexander for a dunk that capped 11 consecutive points and cut their deficit to 102-96.\n\n\r\n                    Leonard dunked to stop the Thunder's run. Gilgeous-Alexander dribbled inside and scored, getting the Thunder back within six. Oklahoma City was forced to foul in the closing seconds and Jackson made 4 of 6 free throws to close it out.\n\n\r\n                    “He did a great job of just getting us the lead,” Jackson said of Leonard. “They were loading up on Kawhi and Paul. They did a great job of attacking.”\n\n\r\n                    The Thunder hung around in the third, cutting their deficit to 72-67. But Leonard hit a 3-pointer and another basket, quickly restoring the Clippers' lead to double digits. They were bolstered by Jackson's 10 points, including eight in a row, after he started the second half.\n\n\r\n                    “We’re playing team basketball and sharing the ball,” Leonard said. “We're having some breakdowns defensively, but we’re staying positive.”\n\n\r\n                    The Thunder fell behind by 17 points in the first half and rallied to close within eight three times in the second quarter. Leonard hit a 3-pointer that sent the Clippers into halftime leading 56-45.\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: For the first time in 16 games — all starts — Dort failed to make at least one 3-pointer, missing six attempts. He still leads the team with 34. Mike Muscala extended his own such streak, making 1 of 9, and is second on the team with 27 3s. ... Oklahoma City finished 7 of 35 from long-range and dropped to 1-7 against the West.\n\n\r\n                    Clippers: Paul George, who finished with 11 points, sat out the final five minutes because of hamstring tightness. ... Patrick Beverley was limited to 13 minutes because of right knee soreness. ... The bench was 11 of 33 in the game, with Lou Williams missing 8 of 9 shots. ... Marcus Morris sat out because of illness.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: At Portland on Monday.\n\n\r\n                    Clippers: At Atlanta on Tuesday in the opener of a six-game trip.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997700.043594
}