{
  "game_id": "0022300612",
  "espn_id": "401585240",
  "date": "Jan 22, 2024",
  "matchup": "CHI @ PHX",
  "headline": "Durant scores 43, hits game-winning shot as Suns rally from 23 down to beat Bulls 115-113",
  "body": "PHOENIX -- — Kevin Durant rose up for his game-winning jumper as the Chicago Bulls' defense did everything in its power to stop it. Patrick Williams flew in to try and swat the shot from the front while Alex Caruso tried to slap at it from behind.\n\n\r\n              Durant calmly adjusted in mid-air — slightly moving the ball to the side to avoid a block — and drained the 17-foot jumper anyway. \n\n\r\n              “I know these games are high stakes and there's a lot on the line,\" Durant said. “But at the end of the day, it's still hoop.”\n\n\r\n              And Durant remains very, very good at it.\n\n\r\n              The 13-time All-Star drilled a contested 17-footer with 1.6 seconds left to help the Phoenix Suns erase a 23-point deficit and stun the Bulls 115-113 on Monday night. The Suns have won six straight.\n\n\r\n              “Kevin Durant was Kevin Durant,” Bulls guard Coby White said. “Yeah — he's tough.”\n\n\r\n              Durant finished with 43 points, eight assists and six rebounds, one night after scoring 40 in a win over the Indiana Pacers. Bradley Beal scored 18 and Devin Booker added 16.\n\n\r\n              It was a frantic final minute that saw Durant hit a wide-open 3-pointer — after an offensive rebound by Drew Eubanks — to give the Suns a 113-111 lead with 29.3 seconds remaining. But Chicago's DeMar DeRozan responded with a short jumper to tie it at 113 with 22.9 seconds left.\n\n\r\n              That set up the final possession. Grayson Allen threw the inbounds pass to Jusuf Nurkic, who found Durant, who then pulled up for the jumper with Bulls defenders draped all over him. It went in anyway.\n\n\r\n              “There's been some games this year — quite honestly — that we've lost that we have no right to be upset about,” Bulls coach Billy Donovan said. “This is a game that you can be upset because you poured your heart and soul into it and came up short.”\n\n\r\n              White led the Bulls with 26 points. DeRozan added 21 and Nikola Vucevic added 19 points and 17 rebounds.\n\n\r\n              The Bulls built a 66-49 halftime lead despite playing without two-time All-Star Zach LaVine, who missed the game with a sprained right ankle. But the Suns fought back from a 23-point margin in the third, cutting the lead to 90-83 heading into the fourth.\n\n\r\n              Phoenix kept pushing in the final quarter and took its first lead of the game at 95-94 on Durant's pull-up jumper with less than seven minutes left. The game stayed tight from that point forward, with the lead changing hands multiple times.\n\n\r\n              The Bulls dominated much of the first half, jumping out to a 19-point lead by early in the second quarter. White led the team with 13 points before the break while Caruso had 12 points on four 3-pointers.\n\n\r\n              The Suns were playing their second game on back-to-back nights and looked like a tired team. Durant — who was named the Western Conference Player of the Week earlier Monday — shot 4 of 13 in the first half, including 0 of 6 on 3-pointers.\n\n\r\n              He saved his best for the second half, making 12 of his 19 shots.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Travel to L.A. Lakers on Thursday.\n\n\r\n              Suns: Travel to Dallas on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995891.823188
}