{
  "game_id": "0022400763",
  "espn_id": "401705329",
  "date": "Feb 10, 2025",
  "matchup": "POR @ DEN",
  "headline": "Jokic scores 40 and the Nuggets beat the Blazers 146-117 for their 7th straight win",
  "body": "DENVER -- — Nikola Jokic scored 40 points, Christian Braun had 26 points, and the surging Denver Nuggets beat the Portland Trail Blazers 146-117 on Monday night for their seventh straight win.\n\n\r\n              Jamal Murray added 17 points and eight assists before picking up his second technical foul and Julian Strawther finished with 18 for Denver.\n\n\r\n              The seven-game winning streak is the longest of the season for the Nuggets, who played without Michael Porter Jr. for the second straight game due to hamstring tightness.\n\n\r\n              Portland was missing Jerami Grant, Kris Murray and Robert Williams III.\n\n\r\n              Donovan Clingan scored a career-high 21 points and Dalano Banton added 22 for the Blazers, who lost their second straight after winning 10 of 11.\n\n\r\n              Denver took a 17-point lead in the first quarter and was ahead 70-55 at halftime before the Blazers cut it to 78-71 early in the third. The Nuggets answered with a 14-3 run late in the period to take a 112-92 lead into the fourth.\n\n\r\n              Takeaways\r\n              Blazers: Allowed their most points since they had won 10 of 12 games. They held teams to 103.1 points during the streak, tops in the NBA during that stretch.\n\n\r\n              Nuggets: Jokic was named the Western Conference player of the week, the third time this season and 17th time in his career. He averaged 29.8 points, 10.8 rebounds, 10.3 assists in four games, all Denver wins.\n\n\r\n              Key moment\r\n              Nuggets coach Michael Malone and Murray were hit with technical fouls early in the third quarter for arguing a no-call on Jokic. Murray then exchanged words with Banton after he made a free throw in the first minute of the fourth and was ejected.\n\n\r\n              Key stat\r\n              Portland had held its last 12 opponents to 44.2 percent shooting but the Nuggets hit 65.9 from the field.\n\n\r\n              Up next\r\n              The same two teams meet Wednesday in Denver for the last game before the All-Star break.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998171.2681081
}