{
  "game_id": "0021901291",
  "espn_id": "401224766",
  "date": "Aug 09, 2020",
  "matchup": "BKN @ LAC",
  "headline": "Nets start fast, beat Clippers to take No. 7 seed in East",
  "body": "LAKE BUENA VISTA, Fla. --  Caris LeVert had 27 points and 13 assists, and the Brooklyn Nets used the best-shooting quarter in the NBA this season to send them on their way to a 129-120 victory over the Los Angeles Clippers on Sunday night.\n\nJoe Harris added 25 points -- 23 in the first half -- for the Nets, who clinched seventh place in the Eastern Conference and a first-round playoff matchup with the defending NBA champion Toronto Raptors. Tyler Johnson scored 21 as Brooklyn improved to 4-2 in the restart.\n\nThe Nets shot 85.7% (18 of 21) from the field in the first quarter, racing to a 21-point lead. The Clippers battled back to tie it in the third quarter but the Nets broke it open again early in the fourth.\n\nKawhi Leonard scored 39 points for the Clippers, who rested Paul George and had their lead over Denver for the No. 2 seed in the West trimmed to one game. They play the Nuggets on Wednesday in their next game.\n\nA night after rallying to beat Portland, Los Angeles had no energy at the start. Allen, Harris and LeVert, meanwhile, all were listed as doubtful a day earlier but looked as good as ever Sunday.\n\nHarris knocked down a 3-pointer to open the scoring and the Nets had a double-digit lead 3 1/2 minutes into the game. They pushed it to 45-24 when LeVert scored as time expired to end the first quarter.\n\nHarris was 6 of 6 in the quarter with four 3-pointers for 16 points.\n\nThe Clippers bounced back with a 39-point second quarter, cutting it to 74-63 at halftime. Leonard then opened the third with a jumper and three straight 3-pointers to tie it, and Brooklyn's lead was just four after three.\n\nBut Johnson made consecutive 3s to open the fourth and restore a double-digit lead and the Nets stayed safely ahead from there.\n\nTIP-INS\n\nNets: Harris' 23 points in the first half were his most in any half in his career.\n\nClippers: Lou Williams became the 13th active player to appear in 1,000 regular-season games. ... Coach Doc Rivers said Leonard and George would most likely play together again before the playoffs but he wasn't sure about Patrick Beverley (left calf strain). ... Ivica Zubac had 15 rebounds, giving him 10 or more in a career-high four straight games.\n\nJACQUE'S JOB\n\nRivers praised the work of Jacque Vaughn, who took over as Nets coach after they split with Kenny Atkinson in March. He had Vaughn on his roster when he coached Orlando.\n\n\"He was one of those players, similar to Ty Lue and Sam (Cassell), that you knew when they retired that they would be coaches,\" Rivers said. \"So I hope he gets a good shot here.\"\n\nLue, an assistant to Rivers again after leading Cleveland to the 2016 NBA title, could get consideration if the Nets don't keep Vaughn after the season.\n\nUP NEXT\n\nNets: Play Orlando on Tuesday.\n\nClippers: Play Denver on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996697.011158
}