{
  "game_id": "0022300830",
  "espn_id": "401585458",
  "date": "Feb 26, 2024",
  "matchup": "MEM vs. BKN",
  "headline": "Nets beat Grizzlies 111-86 for interim coach Kevin Ollie's first win",
  "body": "MEMPHIS, Tenn. -- — Dennis Schroder scored 18 points, Dorian Finney-Smith added 13 points and nine rebounds, and the Brooklyn Nets cruised past the Memphis Grizzlies 111-86 on Monday night, giving Kevin Ollie his first win as an NBA coach.\n\n\r\n              Cam Thomas had 14 points before leaving the game with 7:23 remaining with a right ankle injury. Lonnie Walker IV added 13 for the Nets.\n\n\r\n              “Can we make this quick? I'm soaking wet,” Ollie said after a locker room dousing by his team. “They got me good. All my other coaches left me out to dry. They stayed in the back. I should have known something then.”\n\n\r\n              Lamar Stevens scored 17 points on 8-of-9 shooting for the Grizzlies, and Jaren Jackson Jr. scored 15 while going 2 of 12 from the field. GG Jackson had an even worse night, making one of his 13 shots, and Memphis shot 38.7% overall in its lowest-scoring game of the season. Brooklyn allowed its fewest points this season.\n\n\r\n              “I just think it was a lack of energy,” Stevens said. “It's kind of disappointing because that's something you can control. I think night in and night out that's something we should focus on, controlling what we can control.”\n\n\r\n              Ollie was named Brooklyn's interim coach over the All-Star break, replacing Jacque Vaughn, and had lost his first two games. The Nets came in having lost seven of eight, all but one by double digits.\n\n\r\n              This time, the Nets took care of the ball with only 10 turnovers, outscored Memphis 21-7 in second-chance points and 26-7 in fast-break points. Brooklyn had 32 assists on 44 baskets.\n\n\r\n              “It was just how we played, especially defensively,” Walker said. “Each game we have picked it up. We have taken it to another level. This game especially. We're improving. We're getting better. We're playing better.”\n\n\r\n              The Grizzlies were out of sync from the start, managing 18 points in the first quarter to match their lowest-scoring opening period of the season.\n\n\r\n              It didn't get much better for Memphis from there. Brooklyn led by 27 late in the first half and was ahead 66-40 at halftime. That was a season low in first-half scoring for the Grizzlies.\n\n\r\n              “We got hit pretty hard in that first half, the first quarter especially,” Grizzlies coach Taylor Jenkins said. “We were trying, but we were kind of in search mode all night. Just didn't have anything clicking on the offensive side.”\n\n\r\n              Stevens could do little but shake his head when asked about Memphis' lack of energy against a struggling opponent.\n\n\r\n              “It's a long season,” Stevens said. “It's been tough on the team this year. It was just one of those nights.”\n\n\r\n              UP NEXT\n\n\r\n              Nets: Wrap up a five-game trip Tuesday night at Orlando.\n\n\r\n              Grizzlies: At Minnesota on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996008.128878
}