{
  "game_id": "0022300886",
  "espn_id": "401585514",
  "date": "Mar 05, 2024",
  "matchup": "CLE vs. BOS",
  "headline": "Dean Wade scores 20 in fourth, Cavs rally to stun Celtics and end Boston's 11-game winning streak",
  "body": "CLEVELAND -- — With every one of Dean Wade's shots that splashed through the net, the Cavaliers got closer to the Celtics and his confidence grew.\n\n\r\n              “The rim looked like a swimming pool,” he said.\n\n\r\n              Wade made five 3-pointers and scored 20 points in the fourth quarter, outscoring the Celtics by himself, and Cleveland won a replay review in the final second to stun Boston 105-104 on Tuesday night, ending the NBA's longest winning streak this season at 11 games.\n\n\r\n              With NFL star Travis Kelce urging on Cleveland's crowd from a courtside seat, the Cavs overcame a 22-point deficit in the final period, the biggest fourth-quarter comeback in franchise history.\n\n\r\n              “Honestly, when the Kelce brothers started hyping up the crowd, we knew we could do it,” Cavs center Jarrett Allen said.\n\n\r\n              Cleveland stormed back without All-Star Donovan Mitchell, who missed the game with a knee injury, as well as forward Evan Mobley, who went out with a sprained ankle in the third quarter.\n\n\r\n              Wade, who finished with a career-high 23 points, came to the rescue with his barrage of 3s in the fourth and a putback dunk with 19.1 seconds left that put the Cavs ahead 105-104.\n\n\r\n              The Celtics looked for a final shot and All-Star Jayson Tatum, who led Boston with 26 points, appeared to draw a foul on Cleveland's Darius Garland while shooting a fadeaway jumper with 0.7 seconds left.\n\n\r\n              The Cavs challenged the call, and following the review, officials said it was Tatum's leg that caused the contact and not Garland.\n\n\r\n              “I thought it was great defense,” said Garland, who wasn't positive the call would go his way. “I knew the leg kick was kind of in play. My shin still kind of hurts from it, so I’m glad that it was overturned.”\n\n\r\n              Tatum felt Garland made enough contact to warrant free throws.\n\n\r\n              “I thought I was fouled, but they (refs) didn’t think I got fouled, which was tough because we would have got the tip-in,” he said. “It’s a weird way to end the game.”\n\n\r\n              It was the latest stirring win at home for the Cavs, who beat Dallas last week on Max Strus's 60-foot shot at the buzzer.\n\n\r\n              Following the game, Wade, who grew up in Kansas and is a die-hard Chiefs fan, said Kelce made him an offer.\n\n\r\n              “He said if basketball didn’t work out for me, I could be a backup tight end,” Wade said. “I got good hands. That was just awesome. Pretty cool.”\n\n\r\n              The Cavs are counting on Wade to be more consistent, especially not being at full strength.\n\n\r\n              “He’s a multifaceted guy. He’s not just a spot-up shooter,” Cavs coach J.B. Bickerstaff said. \"We know the things he can do defensively. But he has an offensive game and tonight he got it rolling.\n\n\r\n              “But the belief, the confidence, that’s who Dean Wade is at his core.”\n\n\r\n              Allen added 21 points and 12 rebounds and Garland had 16 points and 11 assists for the Cavs, who made eight of 11 3-pointers in the fourth. Reserve Georges Niang also made two big 3s to help fuel Cleveland's rally.\n\n\r\n              Kristaps Porzingis scored 24 points and Jaylen Brown had 21 for Boston, which lost for the first time since Feb. 1. The Celtics won three times by more than 40 points in that stretch.\n\n\r\n              “That’s what happens when you don’t match the gas and don’t put an NBA team away,” Brown said. “Tip your cap to Dean Wade. He got hot, but we should have won that game. We haven’t really seen a team storm back like that.\n\n\r\n              \"Today was a mentality loss. We had the game. Shouldn’t have happened.”\n\n\r\n              Mitchell, the Cavs' leading scorer, has a left knee injury. He'll miss at least the next two games, and he could be out longer with an injury that wasn't responding to rest.\n\n\r\n              Mitchell received a platelet-rich plasma injection on Monday. He'll be re-examined this weekend.\n\n\r\n              Cleveland also lost Mobley, who didn't return after spraining his left ankle with 5:29 left in the third quarter.\n\n\r\n              The Celtics were coming off a 52-point blowout of Golden State, the club's third win by 50 or more this season. They were still comfortably up by 16 with 7:28 left, but the Cavs kept chipping away before and Wade finally put them ahead with his fifth 3.\n\n\r\n              The Kelces were on hand as the Cavs honored them with a bobblehead depicting the Cleveland-born NFL stars. Jason Kelce, who retired from the Philadelphia Eagles after 13 seasons on Monday, was presented with a No. 62 jersey.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At defending champion Denver on Thursday.\n\n\r\n              Cavaliers: Visit Atlanta on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996725.1394482
}