{
  "game_id": "0022401022",
  "espn_id": "401705588",
  "date": "Mar 21, 2025",
  "matchup": "POR vs. DEN",
  "headline": "Avdija scores 36 points to lead Trail Blazers to a 128-109 win over Nuggets",
  "body": "PORTLAND, Ore. -- — Deni Avdija had 36 points, eight rebounds and seven assists to lead the Portland Trail Blazers to a 128-109 win over the Denver Nuggets, who were without star center Nikola Jokic for the third straight game.\n\n\r\n              Shaedon Sharpe added 23 points as the Trail Blazers dominated the second half (74-50) to cruise to their fourth straight victory. Portland remained two games behind Dallas and Phoenix for 10th place in the Western Conference and the final spot in the play-in tournament. \n\n\r\n              Aaron Gordon scored 23 points for Denver, which lost its second straight and is a half-game behind the Los Angeles Lakers for third place in the West.\n\n\r\n              Portland’s Donovan Clingan and Anfernee Simons were both late scratches due to illness.\n\n\r\n              Denver led 59-54 at halftime and held their advantage until early in the third quarter when the Blazers went on a 14-0 run to take control. \n\n\r\n              Sharpe’s three-point play with 8:18 left in the third gave Portland its first lead at 69-67.\n\n\r\n              A 3-pointer by Peyton Watson sparked the Nuggets on an 11-2 run to tie it at 78. The teams traded baskets after that run before the Blazers closed the quarter on a 6-0 run to lead 88-82 heading into the fourth quarter.\n\n\r\n              The Nuggets pulled their starters down 118-98 with 4:19 left.\n\n\r\n              Takeaways\r\n              Nuggets: With Jokic nursing an ankle injury, the Nuggets have relied even more on Gordon, who has averaged 29 points in the three games Jokic has missed. \n\n\r\n              Trail Blazers: They honored their NBA Finals teams from 1990 and 1992. Rick Adelman, the coach of those teams, said he was grateful the Blazers honored those squads when they played against Denver where his son, David, is an assistant coach. “It’s a special night,” Adelman said.\n\n\r\n              Key moment\r\n              \r\n              Scoot Henderson’s putback dunk with 6:59 left in the third quarter brought the crowd to its feet, part of a 14-0 Blazers run.\n\n\r\n              Key stat\r\n              \r\n              Portland had a 26-10 advantage in second-chance points.\n\n\r\n              Up next\r\n              Nuggets: Play at Houston on Sunday night.\n\n\r\n              Trail Blazers: Host Boston on Sunday night.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998161.114641
}