{
  "game_id": "0022400638",
  "espn_id": "401705204",
  "date": "Jan 25, 2025",
  "matchup": "ORL vs. DET",
  "headline": "Wagner, Banchero score 32 points each in Magic's 121-113 win over Pistons",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 25 of his 32 points in the fourth quarter, Paolo Banchero had 32 points, nine rebounds and seven assists, and the Orlando Magic beat the Detroit Pistons 121-113 on Saturday night.\n\n\r\n              Jalen Suggs contributed eight points in 16 minutes in his first game back after missing 10 games with a strained back. Wendell Carter finished with 11 points and 11 rebounds for Orlando. \n\n\r\n              Cade Cunningham led the Pistons with 35 points and 11 assists. Malik Beasley added 18 points for Detroit.\n\n\r\n              Detroit coach J.B. Bickerstaff was ejected with 6:01 left in the fourth quarter after getting two straight technicals.\n\n\r\n              Takeaways\r\n              Pistons: Losing for only the second time in their last nine road games, the Pistons held the Magic to 18 points in the first quarter before fouls took their toll. The Magic shot 23 free throws in the first half, 38 in the game, and three Pistons finished the game with five fouls each.\n\n\r\n              Magic: With their starting lineup intact for he first time since October, the Magic broke a five-game losing streak.\n\n\r\n              Key moment\r\n              Wagner hit two 3-pointers and scored 12 points in a 20-4 run, turning a two-point Orlando deficit into a 14-point lead at the outset of the fourth quarter. Banchero and Suggs also hit 3-pointers in the four-minute stretch.\n\n\r\n              Key stat\r\n              After shooting 38.5% and missing 10 free throws in the first three quarters, the Magic made 15 of 18 shots, including six of seven 3-pointers, in a 42-point fourth quarter.\n\n\r\n              Up next\r\n              Pistons: Play at Cleveland on Monday night in the fourth game of a five-game road trip.\n\n\r\n              Magic: Open a six-game road trip at Miami on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997870.3948228
}