{
  "game_id": "0021801160",
  "espn_id": "401071833",
  "date": "Apr 01, 2019",
  "matchup": "CLE @ PHX",
  "headline": "Booker held to 25, but Suns send Cavs to sixth straight loss",
  "body": "PHOENIX --  Devin Booker said he heard from the Cleveland Cavaliers bench that he wasn't going to score 50 points.\n\nThat was fine with Booker, because he knew it meant his teammates would be open.\n\nBooker finished with 25, after two 50-point games and a 48-point night over the past three, and that was enough to lead the Phoenix Suns to a 122-113 victory over the Cavaliers on Monday night.\n\nBooker sat more than eight minutes of the second quarter but had 13 assists. Josh Jackson had 19 points and 10 rebounds, and Jamal Crawford added 19 points for the Suns.\n\n\"Just taking what the defense gives me,\" Booker said. \"I read and react when I'm out there on the court. My job tonight was to get everybody involved and make sure everybody got open shots and they were knocking them down.\"\n\nThe Suns ended a six-game losing streak while the Cavaliers lost their sixth straight. The teams have the NBA's second- and third-worst records: Phoenix at 18-60 and Cleveland at 19-59.\n\nCollin Sexton scored 21 points and Jordan Clarkson added 20 for the Cavs. They played without star forward Kevin Love, who missed his second straight game with left shoulder soreness.\n\nCrawford scored eight points in a surge early in the fourth quarter to give the Suns a 101-86 lead, and Jackson's baseline drive and dunk followed by his blocked shot that set up a fast-break layup at the other end gave the Suns a 17-point lead.\n\nCleveland cut the lead to six but got no closer. The Suns scored 28 fast-break points to the Cavaliers' three.\n\nMikal Bridges converted a pair of four-point plays in the first quarter. He hit a 3 and was fouled with 5:57 left, then repeated the feat just before the quarter buzzer to give the Suns a 31-23 lead.\n\nJackson hit back-to-back 3s for a 48-31 lead at the 7:06 mark of the second quarter. The Suns scored 40 points in the second quarter and took a 71-52 lead into halftime, making 60% of their shots.\n\nThe Cavaliers battled back from a 22-point deficit early in the third quarter to cut the Suns' lead to 89-82, and trailed 91-84 going into the fourth. Sexton scored nine points in the third.\n\n\"We got down pretty big and it's hard to come back in the NBA because teams are too good, players are too good and coaches are really smart,\" Sexton said. \"When we got down it was tough for us to rev it back up.\"\n\nSuns coach Igor Kokoskov said the Suns battled fatigue on defense, playing without center Deandre Ayton due to a sprained left ankle and missing several other regulars with longer-term injuries.\n\n\"I wasn't sure if we had enough bodies to close the game,\" Kokoskov said. \"But I'm glad we found a way.\"\n\nFOUR-POINT KING\n\nCrawford, with a four-point play of his own in the second quarter, became the NBA's career leader in that category with 54, which doesn't include five in the playoffs.\n\n\"People don't understand, the hardest part for me is the free throw after,\" Crawford said.\n\nTIP-INS\n\nCAVALIERS: F Channing Frye played his final NBA game in his hometown. Frye plans to retire at the end of this season. He played four seasons with the Suns as part of his 13-year NBA career. ... Coach Larry Drew said he doesn't see F-C John Henson returning to action before the season is over. Henson is doing non-contact work, but hasn't played since mid-November after left wrist surgery. ... Sexton was issued a technical foul early in the third quarter.\n\nSUNS: Bridges became the first Suns rookie and 11th in NBA history to reach 100 steals and 100 3-pointers in a season. He came into the game with 123 steals, and knocked down a pair of first-quarter 3s to reach 100. ... The 71 first-half points were a season high for the Suns. They scored 69 in the first 24 minutes at Chicago last November. ... Jackson blocked five shots, a career high.\n\nUP NEXT\n\nCavaliers: At Sacramento Kings on Thursday night.\n\nSuns: Host Utah Jazz Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994729.832608
}