{
  "game_id": "0021400352",
  "espn_id": "400578644",
  "date": "Dec 14, 2014",
  "matchup": "OKC vs. PHX",
  "headline": "Russell Westbrook, Kevin Durant key win over Suns as OKC extends run",
  "body": "OKLAHOMA CITY -- When Russell Westbrook and Kevin Durant were out with injuries the Oklahoma City Thunder stumbled to a 3-12 start, leaving some wondering if they'd be able to make up enough ground to qualify for the playoffs once their stars returned.\nThat doesn't seem to be an issue any more. Westbrook had 28 points, eight assists and eight rebounds, Durant added 23 points and eight rebounds and the Thunder won their sixth straight game, beating the Phoenix Suns 112-88 on Sunday night.\nWith the win, Oklahoma City moved within a half-game of eighth place in the Western Conference while improving to 11-13. Phoenix (12-13) entered the game tied for eighth in the conference, but is headed in the wrong direction, having lost five straight.\nDurant isn't concerned with the standings, but there's no doubt that the Thunder are trending upward.\n\n\"We're just focused on playing good basketball, and everything else after that takes care of itself,\" Durant said. \"We're 24 games in. You're not even close to the halfway point of the season yet, so it's too early to think about that.\"\nWestbrook recorded his eighth straight game of at least 20 points, five rebounds and five assists since his return from a broken hand. By halftime, he had 24 points, five rebounds and six assists -- just missing what would have been his ninth career triple-double as he sat out the fourth quarter.\nGerald Green led Phoenix with 15 points. The Suns are known for their up-tempo offense that often turns opponents' misses into points at the other end, but Oklahoma City gave Phoenix few transition opportunities early while seizing control of the game. The Thunder made nine of their first 11 shots and never trailed.\n\"They came out right from the start and got after it,\" Phoenix coach Jeff Hornacek said. \"At one point in the middle of the first quarter they were 11 for 16, so they missed five shots, but on four of those they got offensive rebounds. You can't beat a team when you come out like that. . They took it at us.\"\nOklahoma City's 41-point first quarter was the Thunder's highest-scoring quarter of the season and it matched their season-best for points in a half as they took a 70-48 halftime lead. Phoenix came no closer than 20 points in the second half.\nThere was one scary moment for Westbrook. As he leapt toward the basket midway through the third quarter, Alex Len fouled him hard and Westbrook landed awkwardly on his right leg -- which has a surgically repaired right knee. Westbrook got up and hobbled for a few steps before jogging off the floor for a timeout.\nAnthony Morrow scored 14 points and Serge Ibaka added 12 for Oklahoma City. Eric Bledsoe added 12 points for Phoenix while Tyler Ennis had 11 and Marcus Morris had 10.\nTIP-INS\nSuns: Phoenix played without Goran Dragic, who sat out with a lower back strain. Green started in his place and received a technical foul in the first quarter for arguing a call. . P.J. Tucker also received a technical in the second quarter for jawing with Westbrook, who also was called for a technical at the same time. . Markieff Morris started but committed five fouls in 10 minutes of action.\nThunder: Oklahoma City had won 11 straight games against the Suns before dropping their last two meetings against Phoenix last season . The Thunder scored 70 points in the first half of consecutive games for the first time in since the franchise moved to Oklahoma City before the 2008-09 season. The Thunder also scored 70 first-half points in a win over the Cleveland Cavaliers on Thursday. . Rookie Mitch McGary made his season debut with 7:15 left in the fourth quarter.\nBOARD WORK\nFour Thunder players had at least eight rebounds: Westbrook, Durant, Steven Adams (eight) and Kendrick Perkins (10), helping Oklahoma City post a 63-40 edge on the boards. The 63 rebounds were the most by an NBA team this season.\n\"I love Perk coming off the bench for us,\" Durant said. \"He's a guy that's been in big games and has been a starter for us.\"\nWHAT'S NEXT:\nSuns: Host Milwaukee on Monday.\nThunder: At Sacramento on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764991920.658633
}