{
  "game_id": "0022000999",
  "espn_id": "401307804",
  "date": "May 06, 2021",
  "matchup": "MEM @ DET",
  "headline": "Pistons snap skid with 111-97 win over Grizzlies",
  "body": "DETROIT -- — Wayne Ellington and Cory Joseph scored 18 points apiece to help the Detroit Pistons snap a four-game losing streak with a 111-97 victory over the Memphis Grizzlies on Thursday night.\n\n\r\n                    The Grizzlies dropped a half-game behind Golden State for eighth place in the Western Conference, failing to take advantage of the matchup against a Detroit team with more than a few absences.\n\n\r\n                    The Pistons still have the second-worst record in the NBA, but they're just a half-game behind Minnesota, and Oklahoma City, Orlando and Cleveland aren't far ahead of Detroit.\n\n\r\n                    “We needed it. We were teetering, our guys kind of hanging our head, losing confidence,\" Pistons coach Dwane Casey said. \"We needed that to continue our confidence, to have continuation in building our culture.”\n\n\r\n                    The Grizzlies, playing a night after a 139-135 win over Minnesota, scored just 17 points in the second quarter and 21 in the third. They trailed Detroit by eight entering the fourth, and although they cut the lead to two at one point, the Pistons responded with a 10-3 run to make it 99-90.\n\n\r\n                    “I thought we had great urgency early in the game, and we just weren’t able to sustain it for 48 minutes,” Grizzlies coach Taylor Jenkins said.\n\n\r\n                    Ja Morant led Memphis with 20 points and Jonas Valanciunas added 19 points and 16 rebounds.\n\n\r\n                    “Second night of a back-to-back, but that’s no excuse,” said Jaren Jackson Jr., who scored 17 points for the Grizzlies. “We’ve just got to be ready all the time.”\n\n\r\n                    Detroit had seven players in double figures, including all five starters. Isaiah Stewart scored 15 points and Sekou Doumbouya added 14.\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Desmond Bane, who scored 22 points off the bench against the Timberwolves, was in the starting lineup Thursday but scored just two points on 1-of-5 shooting. ... Grayson Allen (left abdominal soreness), Sean McDermott (left foot soreness) and Xavier Tillman (illness) were out.\n\n\r\n                    Pistons: Detroit was without Hamidou Diallo (personal reasons), Jerami Grant (right knee soreness), Killian Hayes (illness), Josh Jackson (oral surgery), Rodney McGruder (right elbow sprain), Mason Plumlee (rest) and Dennis Smith Jr. (left knee soreness). ... The Pistons shot 53% from the field and finished with 62 points in the paint.\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Face Toronto on Saturday night in Tampa, Florida. The Raptors won the teams' previous matchup this season 128-113 on Feb. 8.\n\n\r\n                    Pistons: Visit Philadelphia on Saturday night. The teams split their previous two games this season.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996915.575893
}