{
  "game_id": "0022000659",
  "espn_id": "401307448",
  "date": "Mar 22, 2021",
  "matchup": "IND @ MIL",
  "headline": "Bucks trounce Pacers 140-113 without injured Antetokounmpo",
  "body": "MILWAUKEE -- — Playing without Giannis Antetokounmpo, the Milwaukee Bucks rolled to another win.\n\n\r\n                    Jrue Holiday led the way.\n\n\r\n                    Holiday had 28 points and 14 assists to help the Bucks breeze past the Indiana Pacers 140-113 on Monday night for their seventh consecutive victory.\n\n\r\n                    Milwaukee played without Antetokoumpo due to a sprained left knee,  but the Bucks still shot 61.5% (24 of 39) from 3-point range and 56.4% overall.\n\n\r\n                    “When somebody like our best player is not playing that night, we kind of lock in,” Holiday said. “Everybody has to do a little bit more. It's a testament to the team we have.”\n\n\r\n                    Coach Mike Budenholzer was unsure about Antetokounmpo's status for Wednesday's game against Boston. Budenholzer said he thinks the reigning two-time NBA MVP got hurt during a 120-113 victory  over the San Antonio Spurs on Saturday.\n\n\r\n                    “We’re hoping it’s shorter rather than longer, but we’ll see how these first 48 to 72 hours go and we’ll know more then,” Budenholzer said before Monday’s game.\n\n\r\n                    With Antetokounmpo out of the lineup, Pat Connaughton made his first start of the season and collected 20 points and nine rebounds while shooting 6 of 7 from 3-point range. Khris Middleton had 25 points, eight rebounds and six assists.\n\n\r\n                    The Bucks also played without reserve forward P.J. Tucker because of a sprained left ankle. Tucker played 12 minutes and was scoreless Monday in his second game since he was acquired in a trade with Houston last week.\n\n\r\n                    “We’ll see how he does overnight and what he feels like and looks like tomorrow,” Budenholzer said.\n\n\r\n                    Indiana wasn’t close to full strength, either.\n\n\r\n                    The Pacers were missing Malcolm Brogdon (sore lower back) and Myles Turner (sprained left ankle) and remained without T.J. Warren, who hasn’t played since Dec. 29 due to a stress fracture in his left foot.\n\n\r\n                    “I don't think it's serious,” Pacers coach Nate Bjorkgren said of the Brogdon and Turner injuries. “I would expect them back very soon.”\n\n\r\n                    Even without Antetokounmpo, the Bucks made short work of the Pacers. Holiday recorded season highs in both points and assists.\n\n\r\n                    Indiana’s Doug McDermott opened the game with a 3-pointer, but the Bucks scored the next 19 points and stayed in command the rest of the way.\n\n\r\n                    “I just thought our overall readiness and our aggressiveness to start the game was not there tonight, for a number of different reasons,” Bjorkgren said.\n\n\r\n                    The Bucks went 9 of 10 from 3-point range in the first 9½ minutes and led 48-26 by the end of the first quarter. That 48-point outburst represented the fifth-highest point total the Bucks have ever recorded in a single quarter.\n\n\r\n                    “It's contagious,” Holiday said. “The ball has energy. Pushing the pace and seeing the ball go through the hoop, the hoop just grows and gets bigger. From there, I feel like the pressure kind of falls off your shoulders, the weight kind of falls and you just let it go and let it shoot.”\n\n\r\n                    Indiana got 22 points from Domantas Sabonis, 21 from Jeremy Lamb, 20 from McDermott and 19 from Caris LeVert.\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: While Jrue Holiday had arguably his best game of the season, his brothers on Indiana's roster struggled. Justin Holiday hit consecutive 3-pointers in overtime in a 109-106 victory at Miami  on Sunday, but he scored just three points and shot 1 of 10 (all 3-point attempts) on Monday. Aaron Holiday was scoreless in 17 minutes and shot 0 for 7.\n\n\r\n                    Bucks: Connaughton made his 13th start in 322 career regular-season games. … The Bucks led 83-60 and matched their highest first-half point total of the season. ... The Bucks are 9-0 against Central Division foes. \n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Host Detroit on Wednesday for just their third home contest in their last 13 games.\n\n\r\n                    Bucks: Host Boston on Wednesday in the first of two consecutive games with the Celtics. The Bucks haven’t faced the Celtics since losing 122-121 at Boston in their season opener.\n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997137.349162
}