{
  "game_id": "0022400509",
  "espn_id": "401705075",
  "date": "Jan 08, 2025",
  "matchup": "CLE vs. OKC",
  "headline": "Cavaliers beat Thunder 129-122 to end OKC's 15-game winning streak in matchup of NBA's top teams",
  "body": "CLEVELAND -- — Jarrett Allen scored 25 points, Evan Mobley added 21 and the Cleveland Cavaliers ended Oklahoma City's 15-game winning streak by beating the Thunder 129-122 on Wednesday night in a marquee meeting between the NBA's top two teams.\n\n\r\n              The Cavs extended their winning streak to 11, improved the league's best record to 32-4 — 11-0 against the West — and moved to 19-1 at home. They did it on an off night for leading scorer Donovan Mitchell, who had just 11 points on 3 of 16 shooting.\n\n\r\n              Shai Gilgeous-Alexander scored 31 points and Jalen Williams had 25 for the Thunder in their first loss since Dec. 1.\n\n\r\n              While it's only January and there's a lot of basketball ahead, the game's intensity had the all vibes of a Finals matchup in June. There were 30 lead changes and neither team led by more than nine.\n\n\r\n              The matchup was only the third in history between teams riding double-digit winning streaks. The last time it happened was on Jan. 26, 1995, when Seattle and Utah entered their game each on 10-game winning streaks.\n\n\r\n              Takeaways\r\n              Thunder: Gilgeous-Alexander is the team's undisputed star, but Oklahoma City has some nice pieces. Center Isaiah Hartenstein finished with 18 points, 11 rebounds and eight assists.\n\n\r\n              Cavaliers: Cleveland showed its balance, depth and that it can get by when Mitchell isn't on. Mobley and Allen combined for 22 rebounds and 13 assists. Darius Garland had 18 points, seven assists and hit a floater to put OKC away.\n\n\r\n              Key moment\r\n              With Cleveland up 125-122, Mitchell was called for a loose ball foul with 1:19 left. The Cavs challenged and the call was reversed by replay review. Mobley then hit a 10-footer in the lane to put Cleveland up by five.\n\n\r\n              Key stat\r\n              Only four teams have posted a better record through 36 games than Cleveland: Golden State (34-2) in 2015-16, Philadelphia (33-3) in 1966-67, the Los Angeles Lakers (33-3) in 1971-72 and Chicago (33-3) in 1995-96.\n\n\r\n              Up next\r\n              Thunder: Continue four-game trip at New York on Friday.\n\n\r\n              Cavaliers: Host Toronto on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998316.0508559
}