{
  "game_id": "0021900684",
  "espn_id": "401161326",
  "date": "Jan 25, 2020",
  "matchup": "LAL @ PHI",
  "headline": "James passes Bryant on NBA scoring list in Lakers' loss",
  "body": "PHILADELPHIA --  LeBron James was a teenager when he first met Kobe Bryant at a youth basketball camp, in awe of his idol and ears open as the Los Angeles Lakers star offered advice to the prodigy that has lasted to this day.\n\n\"I was just listening,\" James said. \"I was just trying to soak everything up I could. I remember one thing he said was that if you want to try and be great at it, and want to be one of the greats, you've got to put the work in.\"\n\nJames put in the work and followed Bryant's path -- from making the leap from high school straight to the NBA, to winning NBA titles, and, eventually, to playing in Los Angeles. With a driving right-handed layup, James no longer chased Bryant, he zoomed past him for third place on the NBA's career scoring list.\n\n\"I'm just happy to be in any conversation with Kobe Bryant, one of the all-time greats to ever play,\" James said.\n\nWith a tribute to Bryant written on his Nikes, James scored 29 points in front of a roaring 76ers' crowd, but the Lakers fell short in a 108-91 loss to Philadelphia on Saturday night.\n\nJames scribbled \"Mamba 4 Life\" as he chased Bryant, the five-time champion, in Philly. Fans stood with phones pointed toward the court, waiting to capture a slice of history that came when James scored the milestone basket with 7:23 left in the third quarter. James entered 18 points shy of passing Bryant, and the layup gave him 33,644 points. James stands third with 33,655. Bryant finished his career with 33,643, all with the Lakers.\n\n\"Continuing to move the game forward (at)KingJames. Much respect my brother (hash)33644,\" Bryant tweeted.\n\nJames waved to the Philadelphia crowd that gave him a rousing standing ovation when the mark was announced by the public address announcer. The Sixers also posted a graphic of the NBA's top 10 career scorers with images of James in Lakers and Miami Heat jerseys.\n\nThe 35-year-old James entered averaging at least 25 points (25.2 ppg) for the 16th straight season and has played 44 games this season. Kareem Abdul-Jabbar is the NBA's career scoring leader with 38,387 points and Karl Malone is second at 36,928. James is on pace to pass Abdul-Jabbar in about three seasons. The top four scorers in NBA history played for the Lakers, who signed James as a free agent in 2018.\n\nJames passed Bryant in Philadelphia, where the retired Lakers star was born. James, who played in eight consecutive NBA Finals, has 6,911 postseason points with Cleveland and Miami that do not count in the official total.\n\nJames' stories in the locker room on Bryant seemed to stretch on as long as his list of milestones. Like another time when he was still in high school and was gifted a pair of red, white and blue Nikes from Bryant. James wore a size 15, Bryant was a 14, but he wore the sneaks anyway. Or the way James was inspired how Bryant always found some sort of slight to use as fuel to improve. James would have a \"dream come true\" when he lined up side-by-side with Bryant as teammates in the 2008 Olympics as part of the \"Redeem Team\" and led Team USA to a gold medal in Beijing.\n\n\"There's just too much. The story is just too much,\" James said. \"The story doesn't make sense. Make a long story short, now I'm here in a Lakers uniform, in Philadelphia where he's from.\"\n\nAnthony Davis scored 31 points for the Lakers. James went 9 for 18 from the floor, missed five of six 3s, made 10 of 13 free throws and had eight turnovers. \"It was just a great historic moment for our franchise, for LeBron himself,\" Lakers coach Frank Vogel said.\n\n76ERS ROLL\n\nBen Simmons had 28 points and 10 rebounds and Tobias Harris scored 29 points. The Sixers improved to 6-3 since they lost All-Star center Joel Embiid with a torn ligament on a finger in his left hand. Embiid hoped to return as soon as next week.\n\nThe Sixers led by 22 and watched that lead shrink to five in the fourth quarter. Al Horford, the underachieving free agent pickup, buried a 3 that pushed the lead back to 10 and had the packed crowd rocking. Horford hit a mid-range jumper and Simmons, who lost a tooth at some point in the first half, scored on a layup that gave the 76ers needed breathing room to seal the win.\n\n\"I felt like we might be able to get some separation on Al Horford and we did,\" 76ers coach Brett Brown said. \"The game was kind of fragile at that point.\"\n\nTIP-INS\n\nLakers: JaVale McGee missed a second straight game with flu-like symptoms.\n\nSixers: G Josh Richardson sat out again with a strained left hamstring. ... G Zhaire Smith, called up from G League with Richardson out, left his first game of the season with a sprained left ankle. ... Hall of Famer Allen Iverson, rapper Gucci Mane, Phillies manager Joe Girardi and a handful of Philadelphia Eagles were at the game.\n\nUP NEXT\n\nLakers: Return home Tuesday night to play the Clippers.\n\n76ers: Host Golden State on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995985.337118
}