{
  "game_id": "0021800766",
  "espn_id": "401071439",
  "date": "Jan 31, 2019",
  "matchup": "TOR vs. MIL",
  "headline": "Antetokounmpo scores 19, Bucks beat Raptors 105-92",
  "body": "TORONTO --  Giannis Antetokounmpo and the Milwaukee Bucks have gotten the best of the Raptors so far this season. Even though the season series is over, he knows they haven't seen the last of Toronto.\n\nAntetokounmpo scored 19 points, Khris Middleton had 18 and the Bucks beat the Raptors 105-92 on Thursday night, ending Toronto's season-best home winning streak at 10 games.\n\n\"It's big for us but we've got to stay humble, keep working hard, keep working on our game and keep moving forward,\" Antetokounmpo said. \"We know we're going to be back here eventually.\"\n\nD.J. Wilson scored a career-high 16 points and Eric Bledsoe had 14 as Milwaukee (37-13) clinched the season series with its third victory in four meetings with Toronto. The Bucks stayed atop the NBA, 1 1/2 games ahead of the Raptors (37-16) in the Eastern Conference.\n\n\"It was a great playoff atmosphere, a very good test for us,\" Milwaukee center Brook Lopez said.\n\nThe victory ensures the Bucks will have the best winning percentage in the East through Feb. 3, meaning Bucks coach Mike Budenholzer will represent the conference at next month's NBA All-Star Game in Charlotte, North Carolina.\n\n\"It's a great honor,\" Budenholzer said. \"It says a lot about our team. The players are the ones who put the coaching staff in that position. I'm incredibly grateful to our entire roster.\"\n\nMilwaukee, which has won eight of nine, had not won the season series against Toronto since 2012-13.\n\n\"We came in here and played our style of ball,\" Bucks guard Malcolm Brogdon said. \"I thought we played an excellent game.\"\n\nPascal Siakam scored 28 points and Kawhi Leonard had 16 for the Raptors, who had not lost at home since Dec. 9 to the Bucks. Toronto's franchise record for consecutive home victories is 12, done twice.\n\nSerge Ibaka had 12 points and 10 rebounds for Toronto, which has lost three of four. The Raptors made only seven of 28 shots attempts in the fourth.\n\n\"I don't think we played well tonight,\" coach Nick Nurse said.\n\nTrailing by 24 points midway through the third, the Raptors cut it to 98-92 on a driving layup by Leonard at 1:59 of the fourth. Toronto might have got even closer, but Leonard couldn't convert a fast break on the next possession and was blocked by Lopez and Antetokounmpo.\n\nToronto came in having made at least 12 3-pointers in a season-high five straight games but missed 12 of their first 13 attempts. The Raptors shot 7 for 27 from 3-point range\n\nTIP-INS\n\nBucks: Middleton was named an All-Star reserve, his first selection. ... Brogdon returned to the starting lineup after missing Tuesday's win at Detroit because of a bruised sternum, while G Sterling Brown returned after missing one game because of a sore right wrist. ... Eight of Milwaukee's first 10 points came off Toronto turnovers. ... The Bucks matched a season-high with 13 steals.\n\nRaptors: G Kyle Lowry was named an All-Star reserve, his fifth selection. ... Lowry had missed 19 consecutive 3-point attempts against Milwaukee this season before connecting in the third. ... G Malachi Richardson (right knee) was inactive.\n\nSMILEY FACE\n\nAntetokounmpo got a kick out of Middleton's reaction to his All-Star nod.\n\n\"I've been teammates with Khris for six years,\" Antetokounmpo said. \"I've never seen a smile on him that bright.\"\n\nEND OF THE LINE\n\nLeonard failed to extend his career-high 22-game streak of scoring at least 20 points.\n\n\"He's a tough cover,\" Budenholzer said. \"Our guys made everything hard for him.\"\n\nUNDER THE WEATHER\n\nRaptors guard Danny Green left after five minutes because of flu-like symptoms and did not return until the start of the third quarter. He went scoreless in 13 minutes.\n\nUP NEXT\n\nBucks: Visit Washington on Saturday night.\n\nRaptors: Host the Los Angeles Clippers on Sunday afternoon.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994261.560419
}