{
  "game_id": "0021600729",
  "espn_id": "400900150",
  "date": "Jan 31, 2017",
  "matchup": "LAL vs. DEN",
  "headline": "Lakers hold off Nuggets 120-116 to snap latest losing streak",
  "body": "LOS ANGELES -- D'Angelo Russell sometimes seems to be playing at a higher frequency than his Los Angeles Lakers teammates, who occasionally struggle to be in the right place for their point guard's clever passes.\nEverybody was playing at Russell's speed for most of their win over Denver, even when things went a little haywire in the final minutes.\nNick Young scored 23 points, Lou Williams added 21 and the Lakers survived a frantic fourth quarter to snap their seven-game home losing streak against Denver, beating the Nuggets 120-116 on Tuesday night.\nRookie Ivica Zubac scored a career-high 17 points for the Lakers, who snapped their three-game skid despite getting outscored 40-39 in the wild final period. His pick-and-rolls with Russell in the fourth quarter were one big component of an impressive offensive finish.\n\"He was our leader on the court, and he was making all the right plays,\" the 19-year-old Zubac said. \"He needs to play like that, and I think he can do it every night.\"\nRussell finished with 22 points, a career-high 10 assists and seven rebounds in his return from a three-game absence with a pair of mild leg injuries.\n\"Guys were making shots right and left,\" Russell said. \"We were getting stops, and it just made it easier for me. I know how easy it is to get assists, but you have to attack, and we're realizing that.\"\nWilson Chandler scored 12 of his 26 points in the fourth for the Nuggets, whose three-game winning streak ended with just their third loss in 10 games. Kenneth Faried had 14 points and 17 rebounds, but managed only two points and three boards after halftime.\n\"Just a poor, poor defensive performance,\" Denver coach Michael Malone said. \"Disappointing.\"\nTIP-INS\nNuggets: Faried was outrebounding the Lakers' entire roster for much of the first quarter. He finished the first half with 14 boards, compared with 20 by the Lakers.\nLakers: They have just one home game in the next 25 days, with a five-game East Coast road trip beginning Thursday. ... Russell hadn't played since getting hurt on the second possession of a win over Indiana on Jan. 20. ... David Beckham watched the game at courtside. So did current LA Galaxy stars Giovani Dos Santos and Romain Alessandrini, the French midfielder officially signed from Marseille earlier in the day. ... Timofey Mozgov had 12 points against his former team. The Russian was with Denver from 2010-15.\nMISSING STARS\nBoth teams were without key big men.\nThe Lakers played their second straight game without starting forward Julius Randle, who is recovering from pneumonia. Tarik Black moved into the starting lineup and had six points and eight rebounds. The Lakers hope Randle will be ready for their upcoming road trip.\nThe Nuggets played their second straight game without rising Serbian star Nikola Jokic, who has a strained hip flexor. Jokic did light work in practice, and Malone calls him day-to-day. Jusuf Nurkic struggled as the starting center, going 0 for 7 in 12 minutes of play.\nFRENZIED FOURTH\nThe Nuggets hit their first six 3-point attempts and scored 11 consecutive points to open the fourth, but Williams scored 13 points in the final period and Zubac added eight. Williams put the Lakers ahead to stay on a layup with 2:17 left. Zubac and Russell added jumpers on the Lakers' next two possessions. Los Angeles went 14 for 21 in the final period.\n\"They were able to score on us on every possession in the last few minutes of the game,\" said Danilo Gallinari, who scored 17 points.\nLONG TIME COMING\nThe Nuggets beat the Lakers at Staples Center two weeks ago, and they hadn't lost a road game in this rivalry since November 2012. That was during the Lakers' most recent playoff season, when Dwight Howard and Kobe Bryant had hoped to team up with Steve Nash in a superteam.\nUP NEXT\nNuggets: Host Grizzlies on Wednesday.\nLakers: At Wizards on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764995389.0370681
}