{
  "game_id": "0021800599",
  "espn_id": "401071275",
  "date": "Jan 08, 2019",
  "matchup": "CLE vs. IND",
  "headline": "Pacers send Cavaliers to 10th straight loss 123-115",
  "body": "CLEVELAND --  The Indiana Pacers found plenty to be displeased about after a victory over the Cleveland Cavaliers.\n\nThe Pacers were upset that they had to make several plays in the closing minutes to hold off Cleveland 123-115 and send the Cavaliers to their 10th straight loss.\n\nIndiana led 38-14 late in the first quarter and was ahead by 23 points in the third against the team with the worst record in the league. But the game got close down the stretch.\n\n\"We've got to be better than that -- and we know it,\" Pacers coach Nate McMillan. \"We got off to a really good start, then in the second half, we played the scoreboard.\"\n\nThaddeus Young scored 26 points and Bojan Bogdanovic had 23. The Pacers needed baskets by Young and Victor Oladipo, who had 17 points, to close out the win.\n\nCleveland (8-33) suffered another blow when forward Larry Nance Jr. hurt his right knee in the first quarter and didn't return. Nance will travel with the team to New Orleans, where the Cavs begin a six-game trip Wednesday, and be re-evaluated.\n\nDomantas Sabonis had 15 points for the Pacers, who have won seven of eight.\n\nJordan Clarkson scored 26 points for Cleveland, which trailed 87-64 in the third quarter before cutting the lead to five several times in the fourth.\n\nCleveland was within 115-110 with 1:24 to play, but Oladipo hit a 3-pointer from the top of the key and Young scored on a layup.\n\n\"We played a good first 24 minutes, but the second 24 minutes were horrible,\" Young said.\n\nClarkson scored 10 points in the final four minutes and the Cavaliers trailed 92-79 going into the fourth.\n\nThe Cavaliers had lost five straight home games by 20 or more points during their losing streak.\n\n\"It was a great effort in fighting back, but there are no moral victories at this stage,\" coach Larry Drew said. \"We have to be better.\"\n\nCleveland's last win came at Indiana on Dec. 18. The Pacers jumped ahead quickly. Indiana led by 10 points midway through the first quarter. Bogdanovic had 14 points and the Pacers made 16 of 22 shots in the quarter.\n\nAlec Burks scored 19 points for Cleveland. Tristan Thompson had 15 points and 13 rebounds while rookie point guard Collin Sexton scored 14.\n\nNance appeared to get hurt when he was fouled while going up for a shot under the basket. He's averaging 9.1 points and 7.7 rebounds, and leads the team in assists, steals and blocked shots.\n\nDrew indicated over the weekend that he'd make lineup changes, but decided against that because of the team's long injury list.\n\nAll-Star forward Kevin Love, who has played in only four games this season because of left foot surgery, said Monday that he's still weeks away from doing any significant on-court work.\n\nCleveland's trip also includes games against Houston, the Los Angeles Lakers, Portland, Utah and Denver.\n\nNOT SO COOL\n\nMcMillan was unhappy the Pacers allowed 36 points in each of the last two quarters.\n\n\"We got cool-breeze and almost dropped a game that we had complete control over,\" he said.\n\n41 TO GO\n\nThe Cavaliers reached the halfway point of a season that has seen coach Tyronn Lue get fired after an 0-6 start, injuries to key players and several veterans being traded.\n\nLOSER PAYS\n\nSexton, who played one season at Alabama, lost a wager to teammate Jaron Blossomgame, a Clemson alum, over Monday night's national championship football game.\n\nSexton had to wear a Clemson windbreaker on the team's flight to New Orleans to pay up for the Tigers' 44-16 rout of Alabama. Asked for a comment on the outcome, Sexton would only say, \"Roll Tide.\"\n\nTIP-INS\n\nPacers:  G Corey Joseph, who was questionable with a bruised right thigh, scored 11 points. ... G Darren Collison, also questionable with a sore right leg, had eight. ... C Myles Turner missed his second straight game with a sore right shoulder.\n\nCavaliers: G Matthew Dellavedova (sprained left foot) and C Ante Zizic (sore right knee) returned. ... G Rodney Hood (strained left Achilles) and G David Nwaba (sprained left ankle) remained out. ... G Cameron Payne, signed to a 10-day contract Monday, scored 10 points.\n\nUP NEXT\n\nPacers: Visit Boston on Wednesday.\n\nCavaliers: Visit New Orleans on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994778.496151
}