{
  "game_id": "0022200449",
  "espn_id": "401468604",
  "date": "Dec 18, 2022",
  "matchup": "CHI @ MIN",
  "headline": "Timberwolves beat Bulls 150-126 to break team scoring mark",
  "body": "MINNEAPOLIS -- — Anthony Edwards had season highs with 37 points and 11 assists and the Minnesota Timberwolves broke the franchise record for points in a game, routing the Chicago Bulls 150-126 on Sunday night.\n\n\r\n              D’Angelo Russell added 28 points after missing two games and Minnesota made a season-high 23 pointers to roll past Chicago despite missing four regulars.\n\n\r\n              Rudy Gobert missed his second straight game because of a sprained left ankle. Karl-Anthony Towns (right calf strain) and top reserves Jordan McLaughlin (left calf strain) and Taurean Prince (right shoulder) also sat out.\n\n\r\n              Russell was a game-time decision after sitting out with a knee injury.\n\n\r\n              “Confidence, right approach, seeing familiarity with our rotation and some things like that,\" Russell said. \"That just allows you to be confident and comfortable out there. Coach is allowing us to make things happen, trust in our group. It just gives you that energy and confidence that you want to have.”\n\n\r\n              Starting a four-game trip, Chicago lost its fourth straight and sixth in eight games. It is the fourth-most points the Bulls have ever given up in regulation; the most since allowing 152 to Detroit on Nov. 3, 1982.\n\n\r\n              “It should be the ultimate be lesson learned of what it’s like you let something slip, not being connected, not being one, not understanding what needs to be done collectively to help out each other,\" said DeMar DeRozan, who led Chicago with 29 points. \"It’s embarrassing to give up that many points. Nothing against Minnesota, but it’s not like we playing against the 2016 Golden State Warriors.” \n\n\r\n              Nikola Vucevic added 23 points and Zach LaVine had 22.\n\n\r\n              Chicago coach Billy Donovan spoke about a lack of collectiveness, especially defensively, and backup guard Goran Dragic said the Bulls need to trust each other.\n\n\r\n              “We have to sacrifice for each other to make a better play, to make a better stop, to screen somebody, to make a sweet swing pass,” Dragic said. “It’s a small detail. Anybody in this league can beat you.”\n\n\r\n              Edwards scored six points in a 9-1 surge for a 106-89 lead late in the third quarter. But Edwards saved his best shot of the quarter for a buzzer-beater.\n\n\r\n              With 2.1 seconds left, he stole an inbounds pass on the logo at center court, continued right and made a 32-foot pull-up jumper. As the ball went through the hoop to make it 113-97, Edwards turned to face the crowd and, after a couple of seconds of basking with a huge smile, began to high-five the fans. \n\n\r\n              “We talked about getting up more 3s and we’ve been trying to do that, tonight was obviously an exaggerated example of it,” Minnesota coach Chris Finch said.\n\n\r\n              Russell made seven of his eight first-half shots, including 6 of 7 from deep. That included a 34-foot desperation heave from the logo early in the second quarter as the shot clock expired. \n\n\r\n              TIP-INS \n\n\r\n              Bulls: Vucevic had nine rebounds. … Javonte Green missed the game with right knee soreness. He missed three games earlier this month with right knee pain. … Chicago is 4-11 on the road, including 1-7 against Western Conference opponents.\n\n\r\n              Timberwolves: Nathan Knight scored a season-high 16 points. … Naz Reid, who scored the first 10 Minnesota points, left in the second quarter with trapezius tightness. … Edwards had a steal to extend the NBA’s longest active streak of at least one steal to 16 games. \n\n\r\n              UP NEXT \n\n\r\n              Bulls: At Miami on Tuesday night. \n\n\r\n              Timberwolves: Host Dallas on Monday and Wednesday nights.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994291.474357
}