{
  "game_id": "0021800798",
  "espn_id": "401071471",
  "date": "Feb 05, 2019",
  "matchup": "LAL @ IND",
  "headline": "Pacers' 3-point flurry buries Lakers in James' worst loss",
  "body": "INDIANAPOLIS --  The Indiana Pacers have suddenly found a new winning combination.\n\nNot even LeBron James could slow it down Tuesday night.\n\nBojan Bogdanovic scored 24 points and the Pacers tied an NBA franchise-record by making 19 3-pointers in a 136-94 rout over the Los Angeles Lakers -- the most lopsided loss James has endured in his 16-year career.\n\n\"They scored 33 points off our 19 turnovers and that was from the beginning of the game. We can't play from behind like that,\" James said. \"I think it (the jet lag) hit us. That first game flying across the country looked like it had a lot to do with it, but we didn't come out with the defensive mentality we had the last time we played them and they made us pay for it.\"\n\nTwice previously James' teams had been blown out by 36: Against Washington in April 2008 and in the 2013 NBA Finals against San Antonio. But this was might go down as the most embarrassing of the three.\n\nIndiana led wire-to-wire and never allowed the Lakers to get within single digits after the first basket of the second quarter despite playing without All-Star guard Victor Oladipo and on the tail end of a back-to-back following a four-game trip.\n\nAt one point, the Pacers led by 46.\n\nAnd after James left with 2:06 remaining in the third quarter, coach Luke Walton wisely kept the four-time MVP him on the bench for the rest of the night.\n\nJames was not himself either after missing 17 of the previous 18 games with an injured groin. He missed three of his first five shots, was beaten three times early on defense and had five first-half turnovers before finishing with 18 points, nine assists, seven rebounds and six turnovers.\n\nJaVale McGee added 16 as the Lakers lost for the sixth time in eight games amid the continuing swirl of trade rumors, something Pacers fans noted by repeatedly chanting \"LeBron's gonna trade you.\"\n\n\"I know it has to be tough on a lot of our guys -- especially our young guys,\" James said. \"They've just never been a part of it and they're hearing it every single day. I know that the worst thing you could right now is be on social media and I know all young guys love social media. So, that definitely can't help.\"\n\nThe Pacers, meanwhile, remained focused on regrouping.\n\nAfter losing four straight immediately following Oladipo's season-ending knee injury, they've rebounded with three straight wins. On Tuesday, they produced a season-high 69 points in the first half, a season-high single-game total and their widest victory margin of the Eason.\n\nThey made it look easy, too.\n\nAfter Bogdanovic opened the game by scoring all of the Pacers' points in a 10-2 spurt, the Lakers never recovered. Myles Turner finished with 22 points while Thaddeus Young had 12 points, 11 rebounds and eight assists.\n\n\"We look at it as another win, but it does feel good,\" Young said. \"It's not really about beating them by 42, but we played a complete game.\"\n\nTIP-INS\n\nLakers: Played without Lonzo Ball (sprained left ankle) and Josh Hart (left patella tendinitis). ... James became the fifth player in league history to top the 32,000-point mark. ... Los Angeles has lost six straight in Indy, where it last won in March 2013. ...  Lance Stephenson had 13 points while Kyle Kuzma and Brandon Ingram each had 12.\n\nPacers: Avoided their first season sweep by the Lakers since 2009-10. ... Coach Nate McMillan tied Jack McKinney for No. 7 on the franchise's NBA victories list with 125. ...  Indiana improved to 10-1 this season when seven or more players score in double figures. Domantas Sabonis, Aaron Holiday and Edmond Sumer each had 17 points. ... The Pacers have won four games this season by 30 or more points, matching their highest single-season total since 1993-94.\n\nTHEY SAID IT\n\nLakers: \"There are a million excuses that we could come up with -- the travel, first game coming across the country, all the trade rumors and everything else,\" Walton said. \"The bottom line is we've got to be better And we will be.\"\n\nPacers: \"We've had a couple good games, but it's still going to take some time for us to really establish the way we want to play, not just establishing the way we need to play,\" Turner said. \"We've got to keep going.\"\n\nUP NEXT\n\nLakers: Visit Boston on Thursday night, their fourth stop on a six-game trip.\n\nPacers: Host the Los Angeles Clippers on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995443.4287271
}