{
  "game_id": "401810159",
  "espn_id": "401810159",
  "date": "Nov 30, 2025",
  "matchup": "PHI vs ATL",
  "headline": "Johnson hits late 3s for Hawks to spoil Embiid's 76ers return in 142-134 double-OT win",
  "body": "PHILADELPHIA -- — Jalen Johnson hit consecutive 3-pointers late in double overtime and finished with 41 points and 14 rebounds to help the Atlanta Hawks spoil Joel Embiid’s return in a 142-134 victory over the Philadelphia 76ers on Sunday night.\n\n\r\n              Embiid scored 18 points in 30 minutes in his return for the 76ers after he missed nine games because of injuries.\n\n\r\n              Johnson snapped a tie with his third 3 of the game and hit another on the next possession to send the Hawks to their fourth win in five games.\n\n\r\n              Tyrese Maxey scored 44 points for the 76ers and hit a pair of clutch shots, one that forced OT and another that gave them the late lead in the first overtime. Maxey, an 88% free throw shooter, missed two from the line that could have stretched the lead to four, but instead cost the Sixers in the final seconds of OT. \n\n\r\n              The 76ers' Dominick Barlow was whistled for a foul with 1.1 seconds left. Nickeil Alexander-Walker made both to tie it 126 and send it to the second OT. \n\n\r\n              Alexander-Walker had 34 points and eight rebounds.\n\n\r\n              Embiid last played in the 76ers’ win over Toronto on Nov. 8 and was officially out the next night against Detroit because he wasn’t cleared to play in back-to-backs in the wake of his recovery from April surgery on his left knee. The 2023 NBA MVP, the 76ers said it was Embiid’s right knee soreness that kept him from playing until Sunday.\n\n\r\n              The 76ers played for the first time this season with their All-Star trio of Embiid, oft-injured Paul George and Maxey together in the starting lineup. George scored 16 points.\n\n\r\n              Quentin Grimes scored 28 points for the Sixers.\n\n\r\n              The Hawks opened the fourth on a 13-0 run that put them up seven and in control until Maxey led a late charge for the Sixers.\n\n\r\n              Up next\r\n              Hawks: At Detroit on Monday night\n\n\r\n              76ers: Host Washington on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042723.649371
}