{
  "game_id": "0022201198",
  "espn_id": "401469353",
  "date": "Apr 06, 2023",
  "matchup": "MIA @ PHI",
  "headline": "Jimmy Butler, Tyler Herro help Heat rout 76ers 129-101",
  "body": "PHILADELPHIA -- — Jimmy Butler and Tyler Herro each scored 24 points and the Miami Heat kept alive their hopes of avoiding the NBA's play-in tournament with a 129-101 victory over the Philadelphia 76ers on Thursday night. \n\n\r\n              Max Strus and Bam Adebayo both added 14 points. Miami started fast, leading 41-31 after a quarter and recorded 39 assists, tying the franchise record for most in a game originally set on Feb. 15, 1997, against Philadelphia.\n\n\r\n              “More than anything, it's great to come out and get a victory,” said Butler, who had five assists and four rebounds on 9-of-12 shooting. “It's hard to beat us when we come out and make shots.”\n\n\r\n              The Heat (43-37) would have to win both of their remaining games (at Washington and home against Orlando) and have Brooklyn lose both home games this weekend (to Orlando and Philadelphia) to move into the No. 6 spot and avoid the play-in round. Miami took the Southeast Division title with the win.\n\n\r\n              “It sets us up for the playoffs and builds momentum,” said Herro, who was 7-of-17 from the floor and 5-of-8 from beyond the 3-point line. \"I feel like we're trending in the right direction on both ends of the floor and going in the right direction heading into the playoffs. \n\n\r\n              Philadelphia (52-27) has already secured the third spot in the Eastern Conference playoffs. A win Thursday night would have sealed a first-round matchup against Brooklyn. Joel Embiid scored 21 points despite not playing in the fourth quarter. James Harden chipped in 14 in limited minutes.\n\n\r\n              “We didn't come to play tonight,” 76ers coach Doc Rivers said. “We had no energy. It was a difficult game to have energy -- it was an exercise tonight.”\n\n\r\n              The Heat shot 46.1% from beyond the 3-point arc thanks to an inside out game that had the Sixers scrambling to retreat after collapsing into the paint. Miami had spent a large portion of the season as one of the poorer 3-point shooting teams in the NBA, averaging 34.1% coming into Thursday night for the fourth-worst percentage.\n\n\r\n              “Our game is built on being an attack team offensive and getting into the paint,\" Miami head coach Erik Spoelstra said. “But our 3-point shooting has been good for the last 16 or 17 games. I know that's not a season long sample size, but that's more of the vision of what we were expecting. We're taking the right shots and being aggressive. We had the right balance of points at the rim, free throw shooting and 3-point shooting. That's when we are at our best.”\n\n\r\n              SCORING RACE WATCH\n\n\r\n              With Embiid's 21 points Thursday, his 33.1 point per game average is still ahead of Denver's Nikola Jokic, who sits second at 32.7 points a game. Jokic was listed as out on Denver's injury report Thursday night at Phoenix.\n\n\r\n              Embiid was the 2021-22 scoring champion, beating out Jokic for the honor of being the first foreign-born player to win the scoring title.\n\n\r\n              TIP-INS\n\n\r\n              Heat: Kyle Lowry was in the lineup despite being listed as questionable with left knee soreness, scoring 11 points in 22 minutes. Lowry has not played more than 30 minutes in a game since recording 36 in an overtime game against Orlando on March 11. \n\n\r\n              76ers: Tyrese Maxey was held out with neck stiffness. ... De'Anthony Melton suffered a right calf strain in the third quarter and did not return. .\"It was nothing serious,\" Rivers said after the game. ..Prior to the game, Rivers said that the Sixers have a plan on how to manage the workload of their starter heading into the final weekend and a pair of road games, but wanted to balance it with not having too much rust caused by the week between the end of the regular season and the start of the first round April 15.\n\n\r\n              UP NEXT\n\n\r\n              Heat: At Washington on Friday night.\n\n\r\n              76ers: At Atlanta on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993910.989515
}