{
  "game_id": "0021600403",
  "espn_id": "400899845",
  "date": "Dec 17, 2016",
  "matchup": "HOU @ MIN",
  "headline": "Rockets rally for 10th straight win, stun Wolves in OT",
  "body": "MINNEAPOLIS --  Even down double digits in the closing minutes, James Harden never gave up hope in his Houston Rockets.\n\nWith each win, the Rockets are making believers out of the rest of the NBA as well.\n\nHarden scored 10 of his 28 points in overtime and Houston rallied from 12 points down with just over two minutes to play to win its 10th straight game, 111-109 over the Minnesota Timberwolves on Saturday night.\n\nHarden also had 13 assists and nine rebounds for the Rockets, who have not lost since Nov. 29. Ryan Anderson scored 28 points, and Eric Gordon finished with 20.\n\nHouston trailed 93-81 with 2:04 to play, and still Harden told Anderson they were going to win. Anderson and Trevor Ariza hit two 3-pointers each in a 14-2 run.\n\n\"Yeah, I'm so confident in this team. I don't ever see us out of a game,\" Harden said. \"We score the ball so easily, so well.\"\n\nKarl-Anthony Towns had 41 points, 15 rebounds and five assists for Minnesota, and Zach LaVine scored 24 points. But the Wolves turned the ball over 22 times and couldn't get a stop down the stretch to miss their chance for their first back-to-back wins this season.\n\n\"We just let one go, that's it,\" Towns said. \"I let one go. We just have to move on to the next game and get ready.\"\n\nOne night after setting NBA records with 24 made 3s on 61 attempts, the Rockets started the game 7 for 29 from deep. But they found their range in the nick of time, hitting 10 of their final 22 3s, including five in the final 2:38 of regulation.\n\nAnderson's first 3 of the game-winning surge splashed through with 2:03 to play, and his second cut the deficit to 95-92 with 33 seconds to go. Ariza, who missed eight of his first nine 3s in the game, hit one from the corner to tie it at 95 with 6.5 seconds remaining.\n\nHarden opened OT with a 3, and then scored on two zig-zagging drives to the rim to put Houston in control and the Rockets withstood a late charge from Minnesota.\n\n\"We can't just let that happen,\" LaVine said. \"We played too good of a game to let that slip through our fingers.\"\n\nIt was a big win for the weary Rockets, who overcame a slow start to improve to 4-0 on the second night of back-to-backs.\n\n\"There was a lot of points where I'm thinking, `We're in trouble,\" coach Mike D'Antoni said. \"The guys, that's where the chemistry comes in, and the will to win, the will to get things right and bounce back.\"\n\nTIP-INS\n\nRockets: C Clint Capela left with a bruised left leg and did not return. ... Anderson scored at least 18 points for the third time in four games. He had four 18-point games in the first 24 of the season. ... Houston went 1 for 9 from deep in the second quarter. ... Nene was able to play on the second night of a back-to-back.\n\nTimberwolves: Minnesota missed seven free throws, continuing a season-long problem. ... PG Ricky Rubio appeared to roll his left ankle late in the second quarter but was able to return in the second half. ... Towns posted his seventh straight double-double.\n\nROCKETS 3s\n\nD'Antoni was told before the game that the Target Center record for 3-pointers attempted was 40.\n\n\"In the first half?\" he quipped.\n\nThe Rockets' 51 attempts were the second-most in league history. Anderson was 7 for 16, Ariza and Harden went 3 for 11 and Gordon was 4 for 10, his 13th straight game with at least three 3s, tied for the third-longest streak in NBA history.\n\nGIVE AND TAKE\n\nTowns and LaVine combined for 65 points, but they also committed 14 turnovers. LaVine had eight and Towns had six, with the Rockets' double-team giving him a few issues at inopportune times.\n\n\"I'm frustrated with myself,\" LaVine said. \"Not to say the blame is on one person, but you've got to hold yourself accountable for some of the things that happen in the game. It's just a tough one. When you lose a game like that, you're just frustrated.\"\n\nUP NEXT\n\nRockets: Houston heads home and gets two days off before hosting the San Antonio Spurs on Tuesday.\n\nTimberwolves: Minnesota stays home and hosts the Phoenix Suns on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995772.556652
}