{
  "game_id": "0022301054",
  "espn_id": "401585682",
  "date": "Mar 27, 2024",
  "matchup": "CHI vs. IND",
  "headline": "DeRozan, Vucevic lead Bulls past Pacers 125-99 to end 3-game losing streak",
  "body": "CHICAGO -- — DeMar DeRozan scored 27 points and Nikola Vucevic added 22 with 12 rebounds to lead the Chicago Bulls past the Indiana Pacers 125-99 on Wednesday night to snap a three-game skid.\n\n\r\n              Coby White had 18 points to help Chicago take the season series from Indiana 3-1. \n\n\r\n              All five Chicago starters reached double digits in scoring, but this victory was about defense. The high-scoring Pacers were held under 100 points for the first time this season. Their previous low was 101 against Boston in a loss on Jan. 6.\n\n\r\n              “As a team, I thought we were very connected defensively,” Bulls coach Billy Donovan said. “I really thought the way they helped each other was very important ... with (Indiana) being such a hard team to guard offensively, the number of points they score.”\n\n\r\n              Andrew Nembhard scored 18 points for the Pacers, who concluded a five-game trip at 3-2 and remained in sixth place in the Eastern Conference. The Pacers were held to 40% shooting, while the Bulls shot 50% in an often sloppy game.\n\n\r\n              Chicago limited Pascal Siakam to 14 points after the two-time All-Star had scored 25 or more in four straight games and 36 and 31 in his last two, respectively. \n\n\r\n              “I thought we didn't have the sense of urgency early to get into the paint, as much as we usually do,” said Siakam, who often was double-teamed. “Obviously we weren't making shots and I said we didn't have no juice, no real energy, like kind of flat.”\n\n\r\n              Ayo Dosunmu scored 17 on 7-for-11 shooting, including 3 for 5 on 3-pointers. Andre Drummond added 14 points and 11 rebounds off the bench for Chicago, ninth in the East.\n\n\r\n              Bulls defensive specialist Alex Caruso, who had 12 points to hit double figures for the fourth straight game, was surprised to learn his team was the first to hold the Pacers under 100 points this season.\n\n\r\n              “They seemed a little tired, but we played well,” Caruso said. “We covered for each other and didn't have any of those lapses where we give up a slip-out layup or somebody forgot to rotate or get in and battle for the rebound.”\n\n\r\n              The Bulls took charge late in the second quarter by outscoring and outmuscling the Pacers 22-6 in the final 6:24 to build a 64-43 halftime lead. Chicago shot 55.6 %, while Indiana lagged at 35% in the first half.\n\n\r\n              Vucevic led the way with 15 points in the half and helped spark the surge with 7-for-11 shooting. Dosunmu had 11 points in the half.\n\n\r\n              Indiana scored the first seven points in the second half to start a comeback that narrowed the Bulls' lead to 71-64 with just over four minutes left in the third quarter when T.J. McConnell hit a pair of free throws. The Pacers didn’t pull closer than seven, however.\n\n\r\n              DeRozan, Drummond and Dosunmu helped thwart the Pacers with timely baskets that wrested back momentum late in the third and made it 87-74 after the quarter.\n\n\r\n              Chicago pulled away in the fourth.\n\n\r\n              Donovan said injured Zach LaVine (right foot surgery), Patrick Williams (left foot surgery) and Lonzo Ball (left knee surgery) could be in Chicago on Monday when the Bulls host Atlanta, then continue rehabbing in town with the team the rest of the season.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host the Los Angeles Lakers on Friday.\n\n\r\n              Bulls: At Brooklyn on Friday.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995862.636331
}