{
  "game_id": "0022000336",
  "espn_id": "401267496",
  "date": "Feb 03, 2021",
  "matchup": "SAC vs. BOS",
  "headline": "Fox nets 26, Kings hold off short-handed Celtics 116-111",
  "body": "SACRAMENTO, Calif. -- — De’Aaron Fox had 26 points and 11 assists, Buddy Hield made two free throws with six-tenths of a second remaining and the Sacramento Kings held off the short-handed Boston Celtics 116-111 on Wednesday night.\n\n\r\n                    Hield finished with 15 points and 11 rebounds, Harrison Barnes scored 24 points and Tyrese Haliburton added 21.\n\n\r\n                    “We found a way to grind that one out,” Kings coach Luke Walton said. “The first half it was kind of survival mode. We couldn’t make any open shots, we were missing layups, we weren’t attacking. Our guys found a way. Not the prettiest of wins, but what a gutsy performance by our guys.”\n\n\r\n                    The Kings offense was uneven much of the night. Sacramento was also outrebounded and outscored in the paint, yet came up with several big stops in the second half. The Kings also limited the Celtics to two buckets over the final 2:26 after Jayson Tatum’s tying 3-pointer.\n\n\r\n                    “Defensively, that has to be our hallmark,” Barnes said. “When we don’t, it gets ugly. Shout out to our bigs for protecting the paint. There were a lot of pick-and-rolls tonight and our guards were being active.”\n\n\r\n                    Tatum had 27 points, 10 assists and nine rebounds for the Celtics. Jaylen Brown scored 21. Boston played without three of its top ballhandlers due to injuries. \n\n\r\n                    “We struggled to get stops late but the last two quarters, (the Kings) made a lot of tough plays, too,” Celtics coach Brad Stevens said. “Fox and Haliburton are a handful.”\n\n\r\n                    Fox scored 13 points in the fourth quarter, including a spectacular driving layup that put the Kings up 102-100. \n\n\r\n                    Tatum’s three-point play pulled the Celtics within 112-111 with 1:06 remaining before Fox connected on a step-back 17-footer with 58.8 seconds left.\n\n\r\n                    Boston’s Javonte Green missed when he tried to dunk past a pair of defenders and Tatum’s 3-point try with 1 second left missed the mark.\n\n\r\n                    Brown declined to put the blame for Boston’s loss on the injuries.\n\n\r\n                    “We’ve been pretty good on back-to-backs all year,” he said. “We were short on bodies, but still a game we could have won.”\n\n\r\n                    BOSTON’S GUARD DOWN\n\n\r\n                    The Celtics, still reeling from the loss of Marcus Smart to a left calf injury Saturday, played with an even thinner backcourt. \n\n\r\n                    Kemba Walker (left knee) was rested on the second half of a back-to-back after playing a season-high 31 minutes against Golden State on Tuesday. First-round pick Payton Pritchard sat out a sixth consecutive game because of a right MCL sprain.\n\n\r\n                    “Obviously we were down some guys, but at the same time I trust that the guys in here will be ready to roll,” Stevens said. “A lot of our guys gave us a lot of good things.”\n\n\r\n                    Jeff Teague started at point guard and had seven points and one assists. Tremont Waters (three points, five assists) also saw time at the point.\n\n\r\n                    KINGS ROOKIE HONORED\n\n\r\n                    Haliburton, the 12th overall pick in the draft, made a heads-up play to end the third quarter when he jumped and scored off an offensive rebound as time ran out. Haliburton raced in and jumped to grab the ball, which deflected off the glass following Hield’s desperation heave just inside midcourt. The play was reviewed and upheld.\n\n\r\n                    Earlier in the day Haliburton was named the Western Conference rookie of the month for games played in December and January.\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Brown had seven points during a 19-4 run in the third. … Boston missed nine consecutive shots and went scoreless for 4½ minutes in the second quarter. … Tatum made a buzzer-beating 10-foot floater to end the first.\n\n\r\n                    Kings: Nemanja Bjelica (back spasms) was held out.\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Visit the Clippers on Friday night.\n\n\r\n                    Kings: Host the Nuggets on Saturday afternoon. Sacramento has won twice against Denver this season, including 125-115 at Golden 1 Center on Dec. 29.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997185.1174452
}