{
  "game_id": "0021800809",
  "espn_id": "401071482",
  "date": "Feb 06, 2019",
  "matchup": "SAC vs. HOU",
  "headline": "Harden makes 8 3s as Rockets thump Kings 127-101",
  "body": "SACRAMENTO, Calif. --  James Harden and the Houston Rockets are finding their rhythm at the right time.\n\nLooks as if some help is on the way, too.\n\nHarden made eight 3-pointers and scored 36 points, helping Houston beat the Sacramento Kings 127-101 on Wednesday night.\n\n\"We played very, very well,\" Harden said. \"We're kind of catching a momentum and it feels pretty good. It's even more exciting once we get our full roster back.\"\n\nThe Rockets closed out a four-game trip with their third consecutive victory, and they appeared to be on the verge of adding Iman Shumpert to their array of talented shooters. Gerald Green matched his season high with 25 points, and Eric Gordon scored 20 points.\n\nHouston, Sacramento and Cleveland were working on a trade that most notably will move Shumpert from the Kings to the Rockets. Houston is sending Brandon Knight and Marquese Chriss to the Cavaliers. Alec Burks -- now traded for the second time this season, after starting the year in Utah -- will go from the Cavaliers to the Kings.\n\nThe people spoke on condition of anonymity because the NBA trade call has not yet been completed.\n\n\"Shump is a vet who can help us defensively, ball-handling, shooting,\" Harden said. \"He's been playing very well this season. Once he gets here and gets a couple of practices in, let's go.\"\n\nHouston has won seven games by 20 or more points this season, including twice on its road trip.\n\n\"That's a good trip for us,\" Chris Paul said. \"To get three on this road trip, we're playing the right way.\"\n\nSacramento also was working on a trade for Dallas' Harrison Barnes in another deal ahead of Thursday's deadline.\n\nThe Kings had won three in a row and four of five. Buddy Hield had 20 points and 10 rebounds, and Marvin Bagley III added 10 points and 10 boards.\n\n\"Tough night,\" coach Dave Joerger said. \"We didn't shoot the ball well, they did. It's been a tough couple of hours and an interesting couple of hours.\"\n\nSacramento kept Harden off the line, but the reigning NBA MVP still scored almost at will.\n\nHarden collected 25 points while helping Houston to a 76-45 halftime lead. He made four 3-pointers during a 19-3 run over the final five minutes of the second quarter.\n\nHarden -- the NBA leader in average free-throw attempts -- was limited to two, matching his season low. But he went 13 for 26 from the field.\n\n\"Guys set the tone early,\" Rockets coach Mike D'Antoni said. \"Pretty impressive finish of the road trip. There's just a lot of good things that we did solid.\"\n\nThings got chippy midway through the fourth when Harden was called for a technical foul after he exchanged words with Sacramento's Frank Mason near midcourt.\n\nThe Kings struggled to keep up. They trailed by as many as 37 in the second half.\n\nTIP-INS\n\nRockets: Paul had 15 points and 11 assists. ... Gordon returned to the lineup after sitting out Monday's win over Phoenix because of right knee soreness. ... Houston is 8-4 without Clint Capela, who is sidelined with a right thumb injury.\n\nKings: Bogdan Bogdanovic scored 13 points while starting in place of Shumpert, who addressed his former Sacramento teammates in the locker room before the game and then left the arena. ... Justin Jackson and Zach Randolph are reportedly being sent to Dallas as part of the trade for Barnes.\n\nFARIED'S NIGHT\n\nKenneth Faried had 13 points and 11 rebounds for Houston. He has settled in nicely after signing with the Rockets as a free agent on Jan. 21.\n\nHe is averaging 16.1 points since joining his third team this season.\n\n\"It's always nice to know that, yes, he is a perfect fit,\" D'Antoni said. \"When Clint gets back and (Faried) comes off the bench, he can give us that spurt that we can have 48 solid minutes of high-energy centers running up and down the floor.\"\n\nUP NEXT\n\nRockets: Host Oklahoma City on Saturday.\n\nKings: Host Miami on Friday.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994184.706198
}