{
  "game_id": "0021900322",
  "espn_id": "401160964",
  "date": "Dec 06, 2019",
  "matchup": "IND @ DET",
  "headline": "Griffin, Drummond help Pistons beat Pacers, 108-101",
  "body": "DETROIT --  Detroit Pistons coach Dwane Casey knew his team’s fourth game against the Indiana Pacers was going to be just as physical as the first three.\n\nHe also knew Blake Griffin and Andre Drummond could give the Pistons a big edge in that aspect of the game.\n\nDrummond had 25 points and 22 rebounds, Griffin scored 25 points and made a tiebreaking 3-pointer with 41 seconds left, and the Pistons beat the Pacers 108-101 on Friday.\n\n“We knew this was going to be a playoff-style game, and the way we played down the stretch was indicative of how we wanted to approach this one,” Casey said. “We were boxing out, we were hitting guys and if we got a foul, it was a hard foul. It wasn’t anything dirty, just good physical basketball.”\n\nDetroit led by 11 at the half, but was outscored 31-16 in the third quarter. Drummond felt it was a small victory to only trail 75-71 going into the fourth.\n\n“They are a really good team and we knew they were going to get back into the game,” he said. “We really did a job sustaining ourselves during their run and only being down four going into the fourth.\n\n“Then we played our (butts) off.”\n\nThe Pistons had a 25-2 edge in second-chance points, including 12-0 in the fourth quarter.\n\n“Andre was a monster down the stretch,” Casey said. “It wasn’t a pretty game, but he had 25 and 22 and what I’m proud about, the second-chance points. That was huge.”\n\nDerrick Rose had 14 points and set up Griffin’s go-ahead shot. The Pistons have won three of four.\n\nT.J. Warren scored 26 points and Domantas Sabonis added 18 points and 13 rebounds for Indiana. The Pacers lost for the second time in nine games.\n\n“It was execution,” Pacers coach Nate McMillan said. “It’s always about execution. We didn’t get stops when we needed them and when we did force a miss, they got the offensive rebound.”\n\nThe Pistons took a 99-97 lead on Luke Kennard’s jumper with 1:55 to play. After Malcolm Brogdon split a pair of free throws, Drummond committed his fifth foul to put Sabonis on the line. He also went 1 for 2, tying the game with 1:22 to play.\n\nRose and Warren traded short jumpers, making it 101-all, and Griffin took a kick-out from Rose to hit the 3-pointer that gave the Pistons the lead.\n\n“We practice that play all the time, using a bunch of different people,” Casey said. “Derrick ran it just like we drew it up.”\n\nBrogdon turned the ball over under pressure from Bruce Brown and Rose iced it with a pair of jumpers.\n\n“(Rose) was MVP for a reason,” Griffin said. “He’s very poised with the ball in hands and he doesn’t get rattled, especially late in the game.”\n\nThe Pistons won the season series 3-1.\n\n“We worked harder on the defensive end and started making some shots to get ourselves back into the third quarter,” McMillan said. “But I thought they were the aggressors all night long. They seemed to want it a little more and they got a 37-point fourth quarter.”\n\nTIP INS\n\nPacers: Indiana outshot the Pistons 59% to 28% as it got back into the game in the third quarter. ... Victor Oladipo’s knee injury means he won’t play against the Pistons in the regular season.\n\nPistons: Drummond’s 20-20 game was the 37th of his career, trailing only Dwight Howard (51) among active players.\n\nWINNING THE GAME ON THE BOARDS\n\nDetroit’s 25-2 edge in second-chance points stemmed from their dominance of the boards on both ends. The Pistons grabbed 88% of Indiana’s missed shots and 33% of their own, then upped that to 90% and 60% in the fourth quarter.\n\n“They’re a really physical team, so we knew we had to bring our ‘A’ game,” Drummond said.\n\nUP NEXT\n\nPacers: At New York on Saturday night.\n\nPistons: At New Orleans on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764995870.68985
}