{
  "game_id": "0022300976",
  "espn_id": "401585604",
  "date": "Mar 17, 2024",
  "matchup": "MIL vs. PHX",
  "headline": "Lillard, Portis pace Bucks past Suns 140-129 without Antetokounmpo",
  "body": "MILWAUKEE -- — Damian Lillard had 31 points and 16 assists and Bobby Portis had 31 points and 10 rebounds to lead Milwaukee past the Phoenix Suns 140-129 on Sunday, as the Bucks hit 24 3-pointers to win without star Giannis Antetokounmpo.\n\n\r\n              Antetokounmpo, averaging 30.8 points and 11.2 rebounds, was out with left hamstring soreness. He missed just his fourth game of the season and first since March 4, when he was out with Achilles tendinitis.\n\n\r\n              “It’s not an injury, we were just concerned a little bit,” Bucks coach Doc Rivers said. “Plus, when you look at the schedule, you have one, two, three, four, five days off. We planted it in him and he had to do it. We’re happy that he decided to do it.”\n\n\r\n              Phoenix trailed 109-94 after three quarters, but closed within 122-115 on a lay-in by Bradley Beal with 6:17 left. Lillard’s 3-pointer from the top left put Milwaukee up 134-120 with 3:18 remaining.\n\n\r\n              “I just wanted to come out and be in attack mode,” said Lillard, who became the first Bucks player in history to have a 30-point, 15-assist game. “I didn’t really think to myself I’m going to have to score a bunch of points. I just knew I had to be a problem for the defense.”\n\n\r\n              Khris Middleton added 22 points for Milwaukee in his first game back after missing 16 games with a sprained left ankle. The Bucks finished 24 of 41 from 3-point range, with Portis and Malik Beasley hitting five apiece.\n\n\r\n              “I thought it was huge, especially with Giannis being out,” Lillard said of Middleton’s return. “Any time you’re down your best player and then you add another weapon to a team that’s already down, it’s a pick-me-up just because we’re excited to have him back.”\n\n\r\n              Beal had 28 points, Grayson Allen had 25 points and Devin Booker scored 23 for Phoenix.\n\n\r\n              Milwaukee’s 18 first-half 3-pointers matched the NBA record for 3-pointers in the opening half held by the Suns and Utah Jazz.\n\n\r\n              “They changed their team, obviously, with Giannis not being in there, and Dame is an elite attacker that requires you to really extend your defense on him,” Suns coach Frank Vogel said. “The risk in that is exposing the 3-point line.”\n\n\r\n              Portis came off the bench for 25 first-half points, hitting 10 of 13 shots, including 5 of 5 from beyond the arc, in just under 13 minutes.\n\n\r\n              Allen’s 3-pointer capped an 11-point run that brought the Suns within 93-83 with just over 4 ½ minutes left in the third quarter. Lillard hit a 3-pointer from the edge of the logo just ahead of the buzzer to put Milwaukee up 109-94 entering the final period.\n\n\r\n              Milwaukee moved 1 ½ games ahead of Cleveland for the second-best record in the East. Phoenix entered in sixth place in the West, a half-game ahead of Sacramento and a game in front of Dallas.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host the Philadelphia 76ers on Wednesday night.\n\n\r\n              Bucks: Visit the Boston Celtics on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996506.391787
}