{
  "game_id": "0021600286",
  "espn_id": "400899728",
  "date": "Dec 02, 2016",
  "matchup": "CHI vs. CLE",
  "headline": "Butler, Wade lead Bulls to 111-105 win over Cavaliers",
  "body": "CHICAGO --  LeBron James wasn't holding back.\n\nCleveland's superstar had plenty to say after the Cavaliers gave up 78 points in the paint on the way to another loss. The condensed version was this: It's time to start playing like a championship team again.\n\nJimmy Butler scored 26 points, Dwyane Wade had 24 and the Chicago Bulls beat James and the slumping Cavaliers 111-105 on Friday night.\n\nTaj Gibson added a season-high 23 points and 11 rebounds for Chicago. Rajon Rondo had 15 points, 12 assists and 11 rebounds as the balanced Bulls handed the Cavaliers their third straight loss.\n\n\"We got to get out of the honeymoon stage,\" James said. \"You got to play the game, the right way. We've got to battle every night like we ain't won nothing. Last year is last year. After ring night is over with, now it's a new season and everybody is gunning for us every night and we have to understand that. The honeymoon stage is over. It's time to play some real ball and be physical, especially in the trenches. Giving up 78 points (in the paint) is ridiculous. We've got to man up. Everybody.\"\n\nJames manned up to the tune of 27 points and 13 assists, a championship-level performance on a night when he showed up dressed as a World Series champion: He arrived at the arena in a Cubs uniform to honor a World Series bet with buddy Wade.\n\nKyrie Irving added 20 points and eight assists, but the Cavaliers matched their longest losing streak in a year.\n\nChicago dominated Cleveland 78-60 in the paint, outrebounded the Cavaliers 49-33 and came out on top despite shooting 3 of 18 on 3-pointers. It was a big turnaround for the Bulls coming off a loss to the Lakers.\n\n\"I think we know what we're capable of if we play basketball the right way and do what we're supposed to do,\" Butler said.\n\nDOWN THE STRETCH\n\nThe Bulls used a strong third quarter to turn a one-point halftime deficit into an 88-80 lead. And they withstood several pushes in the fourth to knock off the defending NBA champions.\n\nKevin Love nailed a 3 to cut the lead to 103-99 with about 4 minutes left, but the Bulls hung on.\n\nWade drove for a layup to make it 107-101 with 2:39 remaining. Nikola Mirotic then stole the ball from James, leading to a putback basket for Wade.\n\nMirotic came up with another big play when he blocked a 3 by Irving with 1:11 left to cause a shot-clock violation.\n\nKING CUB\n\nJames clearly wasn't thrilled about having to wear a Chicago Cubs uniform after he rooted hard for his hometown Cleveland Indians in the World Series. But he was a man of his word, honoring the wager he made with Wade, his good friend and former Miami Heat teammate.\n\nJames wore a No. 23 Cubs jersey with his last name stitched across the back, a Cubs hat partially covered by a Cubbie-blue hoodie, pinstripe pants and long baseball socks. James' uniform even had the 2016 World Series champions shoulder patch.\n\n\"I actually thought he looked good,\" said Wade, who was waiting for James when he arrived at the arena and took a picture of his ex-teammate. \"He actually did look like a baseball player.\"\n\nThe two hugged before tipoff and had some playful moments during the game.\n\nJames patted Wade on the backside as they ran down the court together after he hit a tough fadeaway jumper over his pal in the third quarter. Wade returned the favor after burying a 3 in James' face moments later.\n\nTIP-INS\n\nCavaliers: G/F Mike Dunleavy Jr. missed his second consecutive game because of a concussion.\n\nBulls: Rondo's triple-double was his first with the Bulls and the 29th of his career. ... Butler has 12 straight games with 20 or more points. ... With the Bulls playing four times in five days, coach Fred Hoiberg said Wade won't travel to Dallas for Saturday's game. ... Hoiberg said F Doug McDermott (concussion) could be cleared for contact shortly and might practice with the D-League's Windy City Bulls.\n\nUP NEXT\n\nCavaliers: Visit Atlantic Division leader Toronto on Monday.\n\nBulls: Visit Dallas on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995090.717957
}