{
  "game_id": "0022400609",
  "espn_id": "401705175",
  "date": "Jan 21, 2025",
  "matchup": "PHI @ DEN",
  "headline": "Nikola Jokic records his 19th triple-double of the season, Nuggets cruise to 144-109 win over 76ers",
  "body": "DENVER -- — Nikola Jokic had 27 points, 13 rebounds and 10 assists for his 19th triple-double of the season, reserve Aaron Gordon was nearly perfect from the floor and the Denver Nuggets beat Philadelphia 144-109 on Tuesday night, extending the 76ers’ losing streak to seven games.\n\n\r\n              Jokic finished his triple-double late in the third quarter with an assist that led to a dunk from Gordon. Jokic didn't play in the fourth quarter.\n\n\r\n              Gordon was 6 of 7 from the floor — 3 of 3 from 3-point range — and hit all four attempts at the free-throw line to finish with 19 points. The Nuggets had six players in double figures, including a 23-point performance from Julian Strawther. \n\n\r\n              Tyrese Maxey had 28 points and 10 assists for a Sixers team that remains without standout big man Joel Embiid due to swelling in his left knee. \n\n\r\n              This game was part of the NBA’s “Rivals Week” — a matchup that was expected to feature the last four NBA MVPs in Embiid (2023) and Jokic (’21, ’22, ’24). It got sidetracked by the injury to Embiid, who hasn't played in Denver since 2019.\n\n\r\n              Takeaways\r\n              76ers: Paul George (sore groin), Andre Drummond (toe) and Guerschon Yabusele (right knee) returned to the 76ers lineup. George finished with 11 points, Drummond eight and Yabusele 22.\n\n\r\n              Nuggets: Denver pushed the pace and tied a season high for points. The team also outscored the Sixers 39-7 on the fast break.\n\n\r\n              Key moment\r\n              Philadelphia cut Denver's lead to eight early in the third quarter before the Nuggets went on a 24-12 run.\n\n\r\n              Key stat\r\n              The Nuggets shot 61.2% from the field and 51.6% from 3-point range. \n\n\r\n              Up next\r\n              The Nuggets host Sacramento on Thursday night, while the 76ers return home to play Cleveland on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998218.648316
}