{
  "game_id": "0021700012",
  "espn_id": "400974767",
  "date": "Oct 18, 2017",
  "matchup": "POR @ PHX",
  "headline": "Blazers hand Suns worst loss ever in season opener, 124-76",
  "body": "PHOENIX -- If the Suns were a Broadway show, they'd close for good after opening night.\nThe Suns weren't just bad in their 124-76 loss to the Portland Trail Blazers in their season opener on Wednesday night. They were historically awful.\nIt was the most one-sided season-opening loss by any team in NBA history and the worst defeat by the Suns in any game in their 49 years.\nSuns coach Earl Watson said he was \"embarrassed\" by what happened.\n\"Portland came in here and basically kicked our butts as bad as they could,\" Watson said. \"They didn't have no sympathy.\"\nDamian Lillard scored 27 points, and Pat Connaughton added a career-high 24 points, making 4 of 6 3-pointers for Portland.\nThe Trail Blazers outshot, outrebounded and outhustled the Suns from the opening tip.\nPortland tied the second-largest margin of victory in franchise history. Only a 50-point win against the Cleveland Cavaliers (129-79) on Nov. 21, 1982, was larger.\n\"The obvious statement is we played really well,\" Portland coach Terry Stotts said.\nThe 48-point rout exceeded the Denver Nuggets' 46-point victory (139-93) over the Los Angeles Clippers on opening day in 1987.\nThe blowout also topped Phoenix's 44-point loss to the Seattle SuperSonics (151-107) on April 2, 1988.\n\"It's going to be hard for me to sleep tonight,\" the Suns' Devin Booker said.\nThe Blazers dominated, even though they were without one of their best players, guard CJ McCollum, who was suspended one game for leaving the bench area during a tussle involving the Suns' Alex Len and Caleb Swanigan in a preseason game a week ago.\n\"That was a great way to start the season,\" Stotts said. \"I was really pleased with our defense through the whole night. Offense got off to a slow start but picked up.\"\nPortland led 60-35 at the half and outscored the Suns 64-41 in the second half. The Blazers led by as many as 58, for a time flirting with the most one-sided game in NBA history, a 68-point blowout of the Miami Heat by the Cavaliers on Dec. 17, 1991.\nThe Suns shot 31.5 percent to Portland's 49 percent, made 7 of 27 3-pointers to the Blazers' 14-of-24 and were outrebounded 57-33.\nPhoenix had the league's second-worst record last season at 24-58 and looked at least that bad throughout the opener. The Suns have not made the playoffs in seven seasons, the longest drought in franchise history. They are trying to rebuild with youth. That takes time and some painful moments, such as the one Wednesday night.\nEric Bledsoe scored 15 points on 5 of 18 shooting. Booker added 12 on 6-of-17 shooting. Bledsoe was 1-for-6 on 3s, and Booker was 0-for-3.\nPortland's bench outscored Phoenix's 61-26.\nAfter Booker's 13-footer tied it at 17, Lillard sank a layup, and the Blazers bolted away from there.\nBledsoe's three-point play cut the lead to 45-35 with 4:38 left in the third quarter, but Portland scored the final 15 points of the half 60-35 at the break.\nThe Suns shot 29 percent in the first half (14-of-49) to Portland's 44 percent (22-of-50). Phoenix was 1-for-11 from 3-point range in the first two quarters to the Blazers' 7-of-13. Most tellingly, the Portland bench outscored its Phoenix counterparts 24-0.\nIt only got worse (or better from Portland's perspective) after that.\nThe Blazers led a numbing 98-55 entering the final quarter.\nTIP-INS\nTrail Blazers: The one-game suspension, for taking a few steps off the bench in a preseason game, cost McCollum $165,000. ... Connaughton, a fourth-round draft pick of the Baltimore Orioles, had a previous career high of 15 points. ... Portland had six players in double figures. ... Blazers have won four consecutive season openers. ... Trail Blazers don't play their home opener until Tuesday against New Orleans.\nSuns: Len sat out the game with a sprained left ankle. He was injured in Saturday's practice. ... Rookie Josh Jackson started and made a 3-pointer with his first shot, but was 3 for 9 the rest of the way with only two rebounds. ... Marquese Chriss made 1 of 5 shots and had one rebound and five fouls in 12:05 minutes.\nUP NEXT\nTrail Blazers: At Indiana Pacers on Friday night.\nSuns: Host Los Angeles Lakers on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764993458.632931
}