{
  "game_id": "0021501115",
  "espn_id": "400829002",
  "date": "Mar 30, 2016",
  "matchup": "MIL vs. PHX",
  "headline": "Middleton scores 26 in Bucks' 105-94 win over Suns",
  "body": "MILWAUKEE --  Khris Middleton made key shots, though it may have been two days of defensive practice that propelled the Milwaukee Bucks to victory on Wednesday night.\n\nMiddleton scored nine of his 26 points in the final 7:31 and Jabari Parker added 21 points in the Bucks' 105-94 victory over the Phoenix Suns.\n\n\"We got stops when he had to have them and Khris made shots,\" Milwaukee coach Jason Kidd said. \"He was making shots all night.\"\n\nThe Suns committed 24 turnovers, their fourth consecutive game giving up at least 20, and it led to 27 Milwaukee points.\n\n\"It's the difference in the game,\" Phoenix interim coach Earl Watson said. \"If you really break the game down, we outscored them in the paint (52-38). We outrebounded them (54-45). Our turnovers gave them transition and easy baskets.\"\n\nThe Bucks came into the game allowing 9.3 3-pointers per game, but held Phoenix to 5 of 24 in 3-pointers. Kidd said his team spent two days practicing defending the 3.\n\n\"The last two days we made a conscious effort to play 4-on-4, which is harder. You take a guy off the floor and be competitive, where now it's even harder to guard the 3-point line in a pick-and-roll situation,\" Kidd said. \"The guys did a really good job the last two days getting ready to guard the 3-point line.\"\n\nMilwaukee's bench outscored Phoenix's reserves 32-9 in snapping a five-game losing streak. Phoenix has lost four straight and five of six.\n\n\"Obviously, we're not in the playoffs, so we're starting to build for next year and setting the foundation of how our team is going to play,\" said guard Devin Booker, who had 18 points.\n\nGiannis Antetokounmpo had 10 points and six assists in the Bucks' first game since Kidd announced on Tuesday that the 6-foot-11 forward would play point guard in the 2016-17 season.\n\n\"Any time you have the ball 90 percent of the time it's not always about numbers, it's about winning, and understanding how to use those numbers to win,\" Kidd said. \"You have to sacrifice and I thought Giannis did a good job tonight sacrificing.\"\n\nPJ Tucker had 20 points and 10 rebounds for Phoenix. Alex Len had 17 points and 15 rebounds, and Brandon Knight added 17 points in his first trip to Milwaukee since being traded by the Bucks to the Suns in February 2015.\n\nMiddleton scored 17 points in the first half while making all seven of his shots, but missed his first four shots of the second half. He finished 10 of 16 from the field, and his 3-pointer with 1:05 left gave the Bucks a 101-94 lead.\n\n\"We were able to get stops in the fourth quarter when we needed them, and we got some nice second-chance opportunities,\" Middleton said.\n\n`TOUGH KID' RETURNS\n\nGreivis Vasquez returned after missing 56 games with an ankle injury sustained on Nov. 27 that led to surgery on Dec. 15. He finished with no points, three rebounds and three assists in 12 minutes.\n\n\"I worked so hard,\" Vasquez said. \"A lot of people thought I'd miss the whole season, but I'm a tough kid.\"\n\nFUNDAMENTALS\n\nWatson was asked what more he could teach in a summer camp than he can during the season.\n\n\"Tenacity, aggressiveness, even box-out drills, like high school. The fundamentals of defense and offense,\" he said. \"It sounds preschool, but it's passing and cutting and how to pass the ball.\"\n\nTIP-INS\n\nSuns: Mirza Teletovic missed the game with a stomach illness. Jon Leuer, Knight and Ronnie Price also have been ill within the past week.\n\nBucks: Jerryd Bayless suffered a mild hyperextension of his right knee in the first half and did not return. Kidd said the team would know more about his status on Thursday.\n\nUP NEXT\n\nSuns: Host Washington on Friday night.\n\nBucks: Host Orlando on Friday night",
  "source": "espn_api",
  "crawled_at": 1764994001.788832
}