{
  "game_id": "0021700329",
  "espn_id": "400975080",
  "date": "Dec 02, 2017",
  "matchup": "MEM @ CLE",
  "headline": "James takes over as Cavaliers win 11th straight",
  "body": "CLEVELAND -- The Cavaliers' winning streak was in unexpected jeopardy Saturday night before LeBron James took over.\nJames scored 34 points, including seven in the final 1:22, and Cleveland beat the Memphis Grizzlies 116-111 for their 11th straight victory.\nThe loss was the 11th straight for Memphis, including three since David Fizdale was fired Monday and replaced by interim coach J.B. Bickerstaff, but the Grizzlies nearly ended their streak in shocking fashion.\nMemphis trailed 91-72 late in the third quarter, but rallied all the way to a tie at 109 on Dillon Brooks' 3-pointer with 2:10 remaining.\nThat's when James stepped up, to the surprise of no one in the building, particularly Dwyane Wade, his long-time friend and teammate.\n\"You just shake your head,\" Wade said. \"It's impressive, man. When you're on a team and you have a guy when the game gets close and you can get him the ball and he comes through, maybe not all the time but it seems like every time ... we know he's going to make the right play.\"\nJames' basket in the lane gave Cleveland the lead. After Tyreke Evans missed a 3-pointer, James drove the lane, scored and converted the three-point play after being fouled by Brooks with 34 seconds left.\nBrooks made two free throws, but James dribbled for several seconds on Cleveland's next possession and hit a jumper from the top of the key for a five-point lead with 5 seconds to go.\n\"When it's winning time in the fourth quarter, my teammates want me to step up and do what I do best,\" said James, who scored or assisted on Cleveland's last 17 points.\n\"That effort tonight would have beaten 90 percent of this league on their home court,\" Bickerstaff said. \"Unfortunately, they've got a guy who is pretty damn good.\"\nEvans had 31 points and 12 assists for Memphis. Marc Gasol scored 27 and passed 10,000 career points despite being listed as questionable after injuring his left foot in Friday's loss to San Antonio.\nCleveland has scored at least 100 points in each game during its streak and is closing in on its longest winning streak since it ripped off 12 straight in 2015.\nJames scored 11 points in the final six minutes of the second quarter, including a pair of three-point plays and a jumper from the corner at the buzzer, helping Cleveland to a 66-52 halftime lead.\nJames, the reigning NBA Player of the Month, also had 12 assists. He has shot 50 percent or better from the floor in each of his last 10 games.\nKevin Love added 20 points and 11 rebounds for Cleveland. He went to the floor after banging knees with JaMychal Green in the third quarter, but remained in the game.\nMemphis point guard Mike Conley missed his ninth straight game because of a sore left Achilles.\nCAVS, ROSE TALKING\nCleveland coach Tyronn Lue said the team's communication with point guard Derrick Rose has been positive. Rose is away from the team because of a personal matter. He also has been sidelined by a sprained left ankle. The team is expected to provide another update Sunday.\nGOOD DECISION\nGasol wasn't cleared to go until arriving at the arena, but played a game-high 41 minutes. He underwent an MRI Saturday that revealed no structural damage. \"The medical staff was a little worried, but when it's only pain, I'm going to play,\" Gasol said. \"We were able to manage it.\"\nTIP-INS\nGrizzlies: Gasol has 10,007 career points. ... Memphis hit seven of its first nine shots and took a 16-9 lead, forcing the Cavaliers to call a timeout four minutes into the game. Cleveland called another timeout at the 4:24 mark with Memphis leading 24-13. ... Memphis didn't get to the line until Evans was fouled shooting a 3-pointer at the 6:50 mark of the second quarter.\nCavaliers: J.R. Smith scored 17 points, and Wade had 16. ... Love was the only starter to get a rebound in the first half when he had seven. ... F Channing Frye went to the locker room in the fourth quarter with a dislocated right finger, but doesn't think the injury is serious.\nUP NEXT\nGrizzlies: Host Minnesota on Monday night. Memphis has lost eight straight at FedEx Forum.\nCavaliers: At Chicago on Monday night. Cleveland beat the Bulls 119-112 on Oct. 24 in Cleveland.",
  "source": "espn_api",
  "crawled_at": 1764992786.3464372
}