{
  "game_id": "0021600399",
  "espn_id": "400899841",
  "date": "Dec 17, 2016",
  "matchup": "OKC vs. PHX",
  "headline": "Westbrook claims 50th career triple-double; Thunder top Suns",
  "body": "OKLAHOMA CITY --  Russell Westbrook passed the credit around like he shared the ball on Saturday night.\n\nWestbrook had a career-high 22 assists in his 50th career triple-double, leading the Oklahoma City Thunder to a 114-101 victory over the Phoenix Suns.\n\n\"My teammates did a great job of spacing, catching and finishing, making some shots,\" he said. \"My job is to be able to find those guys. The ball is in my hands a lot.\"\n\nWestbrook also scored 26 points and grabbed 11 rebounds in his 13th triple-double of the season. He had gone three games without one, yet the league's leading scorer continues to average double figures in points, rebounds and assists.\n\nWestbrook set up his teammates for much of the night, but he also showed why he averages more than 30 points per game. He scored 17 points on 5-for-9 shooting in the third quarter to help the Thunder push their lead out to 20 points.\n\n\"As the game goes on, I read and kind of see what's open,\" he said. \"And I can go back to different things that I see that's open and try to find ways to be assertive and when not to be. That's just something I've learned over the years.\"\n\nSteven Adams had 19 points and seven rebounds and Enes Kanter added 12 points for Oklahoma City, which had dropped two in a row. Thunder guard Victor Oladipo, the team's No. 2 scorer for the season, missed his third straight game with a right wrist sprain.\n\nDevin Booker scored 31 points for the Suns, who have lost six of eight.\n\nThe Thunder led 54-39 at halftime. Westbrook had 12 assists before the break, a Thunder record for a half. Phoenix's first-half scoring total matched the lowest allowed by the Thunder in a half all season.\n\nIt took Westbrook a while to get to double figures in points -- he finally got there on a free throw with 8:41 left in the third quarter. He was stuck on nine rebounds when he went to the bench with 2:35 left in the third.\n\nHe re-entered the game with 8:44 to play, and he got his 10th rebound almost immediately upon his return.\n\n\"He is putting up phenomenal numbers,\" Suns center Tyson Chandler said. \"I think it really just comes down to heart, passion and will. Every second, he is going full speed, giving 100 percent. He is just putting his will into the game.\"\n\nTIP-INS\n\nSuns: F T.J. Warren returned after missing 13 games with a head injury. He scored two points in 14:28. He scored 30 points when the teams met earlier this season. ... Booker was the only Phoenix player who scored more than 12 points.\n\nThunder: Anthony Morrow got his first start of the season in Oladipo's place and scored 11 points. ... Westbrook was issued a technical foul in the third quarter. ... Westbrook had 51 points, 13 rebounds and 10 assists in a 113-110 win over the Suns earlier in the season.\n\nSTAT LINES\n\nBooker outscored Westbrook 20-17 in the third quarter. He made 8 of 13 shots and all three of his free throws.\n\nSTEPPING IT UP\n\nAdams, not known as a scorer before this season, has scored in double figures for six straight games and has shot better than 50 percent in each contest. He is averaging 15.8 points during the impressive stretch.\n\nUP NEXT\n\nSuns: Visit Minnesota on Monday night.\n\nThunder: Host Atlanta on Monday night.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995307.756746
}