{
  "game_id": "0021900166",
  "espn_id": "401160808",
  "date": "Nov 14, 2019",
  "matchup": "BKN @ DEN",
  "headline": "Plumlee, bench help Nuggets rally past Nets 101-93",
  "body": "DENVER --  Nikola Jokic had plenty of postgame jokes -- about the bench and especially about Paul Millsap.\n\nThe Denver big man was simply in a playful mood after another come-from-behind win.\n\nJokic had 18 points and 10 rebounds, Mason Plumlee provided a boost off the bench and the Nuggets wore down the Brooklyn Nets in a 101-93 win Thursday night.\n\nFor that, Jokic credited the bench's second-half performance.\n\n\"Not that much in the first half,\" he quipped before patting Plumlee on the back and adding, \"but they were phenomenal in the second.\"\n\nHis next target? Millsap, who finished with 18 points.\n\n\"Paul is playing like he's 21 not 77,\" Jokic said of the forward who's actually 34.\n\nMillsap shook his head when the jab about his age got back to him.\n\n\"I don't know if that's a compliment or not?\" he said. \"I just feel good.\"\n\nThe Nuggets tired out a Nets team playing their fourth road game in seven nights. Brooklyn shot 23% and went 0 for 17 from 3-point range in the second half.\n\nAll those misses helped the Nuggets stage another rally. They overcame a 21-point, four-quarter deficit in a win over Philadelphia last week.\n\nOn Thursday, the Nuggets trailed by 16 points in the third quarter before using a 19-6 run to work their way back. The comeback was spurred in large part by Denver's bench. Plumlee was pivotal when Jokic went to the bench with 6:37 left in the third in foul trouble. Plumlee scored all 10 of his points in the second half.\n\n\"Plumlee, that's what he does,\" Nets coach Kenny Atkinson said. \"I thought their second unit really gave them a boost.\"\n\nDenver took its first lead since the first quarter on Jerami Grant's 3-pointer with 9:30 remaining. The Nuggets wouldn't relinquish it.\n\nKyrie Irving had 17 points and nine assists despite a sore right shoulder. Irving was questionable earlier in the day but got treatment and was ready to go by game time.\n\nDeAndre Jordan had an interesting stat line -- 11 rebounds and no points. Jarrett Allen added 17 points and 10 boards as the Nets dropped to 1/3 on their five-game trip.\n\n\"When teams make their runs we just have to be able to respond right away,\" Irving said. \"Just settle ourselves down and really go into our offensive package and just run the plays that work for us.\"\n\nThe Nets entered with a dynamic offense and Denver with a top-notch defense.\n\nIn the first half, Brooklyn controlled the tempo with their shooting. In the second, the Nuggets took it back with defense. They've now held opponents to fewer than 100 points in five of the last six games.\n\n\"Our defense got us going,\" Nuggets coach Michael Malone said. \"That ignites our break. We started rebounding and running. That's when we're at our best.\"\n\nTIP-INS\n\nNets: F Taurean Prince was given a technical foul for a hold in the first quarter. ... G/F Garrett Temple briefly left in the third after being hit in the chin by Gary Harris' elbow. Harris was issued a flagrant foul. ... Former University of Colorado standout Spencer Dinwiddie had 17 points.\n\nNuggets: G Malik Beasley (illness) didn't play. ... Denver had seven players in double figures. ... F Will Barton finished with 17.\n\nLEVERT UPDATE\n\nNets guard Caris LeVert underwent surgery Thursday to repair ligaments in his right thumb. There's no timetable for his return.\n\nLeVert is averaging 16.8 points, 5.0 rebounds and 4.0 assists. He missed half of last season with a dislocated right foot.\n\n\"It's bad luck especially with what he went through last year,\" Atkinson said. \"I feel for him.\"\n\nSHUMPERT'S ROLE\n\nVeteran guard Iman Shumpert was signed Wednesday to fill a specific need for the Nets -- perimeter defense.\n\n\"That's always been his calling card,\" said Atkinson, who was an assistant coach with New York when Shumpert played for the Knicks. \"I know him well, know the personality. He gets after it defensively.\"\n\nShumpert didn't play Thursday.\n\nJUANCHO SIGHTING\n\nJuancho Hernangomez played 19 minutes. This after seeing the floor a combined 19:24 all season. He had two points but provided plenty of energy.\n\n\"Juancho is the hardest worker here,\" Jokic said.\n\nIRVING & MURRAY\n\nThere was some history between Irving and Nuggets guard Jamal Murray. When Irving was at Pepsi Center last November -- as a member of the Boston Celtics -- he took exception to Murray, sitting on 48 points, taking a shot in the closing seconds of a game already decided. Irving threw the ball into the stands.\n\nUP NEXT\n\nNets: Finish a five-game trip Saturday in Chicago.\n\nNuggets: At Memphis on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996439.128665
}