{
  "game_id": "0022300932",
  "espn_id": "401585560",
  "date": "Mar 10, 2024",
  "matchup": "LAL vs. MIN",
  "headline": "Anthony Davis bullies Timberwolves with 27 points, 25 rebounds in Lakers' 120-109 victory",
  "body": "LOS ANGELES -- — Anthony Davis had 27 points, a season-high 25 rebounds and a career-high seven steals while leading the Los Angeles Lakers to a 120-109 victory over the short-handed Minnesota Timberwolves on Sunday night.\n\n\r\n              Davis added five assists and three blocked shots in one of the most prolific games of his decorated career. The nine-time All-Star feasted on a Minnesota lineup missing its top two big men and four regulars due to injuries, grabbing 21 rebounds in the second half alone and leading a 21-4 rally to begin the fourth quarter while the Lakers pulled away to their 12th win in 17 games.\n\n\r\n              “When we're out there having fun, everybody's confidence is high,” Davis said. “When we're talking trash to the other team, we're holding each other accountable, and we're just playing the right way. We know what it takes. It's just about having the consistency of playing that way each and every night.”\n\n\r\n              Davis is only the eighth player since the 1982-83 season with at least 25 points, 25 rebounds and five assists in a game, according to Sportradar. Nikola Jokic did it last season, joining a short list that includes Charles Barkley and Kevin Garnett.\n\n\r\n              “Ten offensive rebounds is crazy,” said Austin Reaves, who scored 19 points for Los Angeles. “I did feel any time we shot and missed, he was there to give us a second-chance opportunity with offensive rebounds, get himself to the line. The steals, I don’t know. The steals are crazy. Seven steals is very, very impressive.”\n\n\r\n              LeBron James had 29 points, nine assists and eight rebounds as the Lakers knocked off another top team following wins over Oklahoma City and Milwaukee on their six-game homestand. Los Angeles (36-30) is six games above .500 for the first time since the final day of the 2021-22 regular season.\n\n\r\n              Naz Reid scored 25 points and hit five 3-pointers in his first start of the season for Minnesota, which hit 16 of its season-high 46 3-point attempts. Reid delivered his second straight outstanding performance after scoring a career-high 34 against Cleveland last Friday, but the Wolves' depleted interior defense couldn't stop Davis without Rudy Gobert or Karl-Anthony Towns.\n\n\r\n              “This team is No. 2 in the West, and still a good team,” Davis said. “Obviously, they’re missing key parts of their team, but they still have guys who can make plays, and they still find a way to win ballgames. We just wanted to come out as a team effort and knowing that wherever we are in the standings and how important this game was, trying to close the gap in the standings.”\n\n\r\n              Anthony Edwards also scored 25 points for the Wolves, who have lost four of six. Minnesota missed nine consecutive shots to start the fourth quarter while Los Angeles pulled away.\n\n\r\n              “Ball movement dried up a little bit, but really it was the offensive rebounds at the other end of the floor that hurt us more in the fourth,” Minnesota coach Chris Finch said. “I felt confident we were able to come back, but so many second shots, and it's difficult at that point. ... (Davis) should have dominated us. He had size. He had length. He had all that stuff. He was in the paint for seven, eight seconds every time they shot the ball. It's easy to go get it. But we've got to do a better job rooting him out.”\n\n\r\n              James returned after sitting out due to injury for the ninth time this season when the Lakers stunned Milwaukee 123-122 on Friday night behind D'Angelo Russell's 44-point performance. Davis injured his left shoulder during that game in a collision with Giannis Antetokounmpo, but it didn't visibly slow him.\n\n\r\n              Edwards played through an ankle injury, but Gobert sat out with right hamstring tightness. Gobert, who missed his third game of the season, was fined $100,000 by the NBA earlier Sunday for a series of transgressions questioning the integrity of the NBA's officiating Friday.\n\n\r\n              Towns missed his third straight game for Minnesota since being diagnosed with a torn meniscus in his left knee. The big man is likely to be sidelined until the postseason following surgery.\n\n\r\n              Kyle Anderson also sat out with right shoulder pain, and Monte Morris missed his second straight game with a strained left hamstring.\n\n\r\n              Lakers swingman Cam Reddish was ruled out with a sprained right ankle. It was the second additional game he has missed since he returned from a monthlong injury absence in late February.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Los Angeles Clippers on Tuesday night.\n\n\r\n              Lakers: At Sacramento on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995492.770218
}