{
  "game_id": "0022300154",
  "espn_id": "401584782",
  "date": "Nov 06, 2023",
  "matchup": "MIN vs. BOS",
  "headline": "Edwards scores 38, Wolves hand Celtics 1st loss with 114-109 OT victory",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored eight of his 38 points in overtime, and the Minnesota Timberwolves sent the Boston Celtics to their first loss of the season with a 114-109 win on Monday night.\n\n\r\n              Jaden McDaniels added 20 points, and Rudy Gobert added 14 points and 12 rebounds as Minnesota improved to 4-0 at home in a third consecutive victory.\n\n\r\n              Naz Reid scored 10 of his 14 points in the first quarter and helped the Timberwolves overcome foul trouble for Karl-Anthony Towns, who finished with seven points in just 28 minutes before fouling out in overtime.\n\n\r\n              “They’re a championship-level team,” Gobert said. “They find ways to always stay in the game, always never giving up. We did the same. A lot of things didn’t go our way, but whoever came on the floor was ready to do what we do, was ready to bring us something.”\n\n\r\n              Jayson Tatum had 32 points and Jaylen Brown added 26 for the Celtics. Boston's 6-0 start was its best since 2009-10.\n\n\r\n              Kristaps Porzingis, who was questionable before the game with a stye, scored 20. The Celtics were without starting guard Derrick White for the second straight game due to personal reasons.\n\n\r\n              “Very competitive and opponents are always going to bring the best out of us,\" Boston coach Joe Mazzula said. “I thought we competed at a high level. I thought their defensive toughness outmatched our offensive toughness at times.”\n\n\r\n              Neither team led by more than eight in a matchup of teams with the best offensive and defensive ratings early in the season.\n\n\r\n              The Celtics were third in the NBA shooting 50.1% from the floor this season. Minnesota held Boston to a season-low 39.1% shooting, including an 11-of-29 mark from 3-point territory, and a season-high 18 turnovers.\n\n\r\n              “Their overall pressure bothered us on the offensive end,\" Mazzula said. \"So, that’s a good learning point for us.”\n\n\r\n              The game was an offensive stalemate late in regulation, with McDaniels scoring the final points on a 3-pointer for a 101-101 tie with 1:41 remaining. The teams combined for five missed shots and four turnovers in the final 90 seconds of regulation.\n\n\r\n              Mike Conley put Minnesota ahead for good at 106-105 on a 3-pointer with 3:08 left in overtime, then Edwards hit three consecutive jumpers to finish a 9-0 run.\n\n\r\n              McDaniels hit a jumper with 16 seconds left after Tatum had pulled the Celtics within three.\n\n\r\n              Edwards was 15 of 25 from the field and had nine rebounds and seven assists.\n\n\r\n              “He loves the moment,” Wolves coach Chris Finch said. “We know we still got to get better at closing out that game in regulation with some of our decision-making and ball movement and using the defense against them a little bit. But guys who like the moment are oftentimes few and far between. We’re lucky we have one on our team.”\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At Philadelphia on Wednesday.\n\n\r\n              Timberwolves: New Orleans at home Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764996500.522646
}