{
  "game_id": "0021601167",
  "espn_id": "400900545",
  "date": "Apr 05, 2017",
  "matchup": "OKC @ MEM",
  "headline": "Westbrook misses triple-double; Thunder beat Grizzlies",
  "body": "MEMPHIS, Tenn. --  Russell Westbrook just missed breaking a tie with Oscar Robertson for the NBA single-season triple-double record. The Oklahoma City star did knock down a late 3-pointer to seal a victory\n\nWestbrook fell a rebound short of an historic triple-double, but scored 45 points, including the Thunder's final five points to lead Oklahoma City to a 103-100 victory over the Memphis Grizzlies on Wednesday night.\n\nThe guard, who also had 10 assists with the nine rebounds, nailed a 3-pointer -- his eighth of the game -- with 14 seconds left to extend the Thunder's lead to 101-97. Two free throws in the final second provided the final margin.\n\nWestbrook remained tied with Robertson with 41. The point guard couldn't help but be aware late in the game that he was a rebound away from sole possession of the mark Robertson set in the 1961-62 season.\n\n\"The crowd was screaming it, so yeah I heard it,\" Westbrook said.\n\nOklahoma City solidified its hold on the Western Conference's sixth seed, holding a 3 1/2-game lead over the Grizzlies. And while there was plenty of talk about the triple-double mark, Thunder coach Billy Donovan said the win was priority.\n\n\"With our team, we are just wanting to do what we need to play better,\" Donovan said. \"Once the regular season ends and the playoffs start, it's not a topic of conversation anymore. So, there's only about six more days of this.\"\n\nMarc Gasol led Memphis with 23 points, and Zach Randolph had 20 points and nine rebounds.\n\nMemphis was without starting point guard and leading scorer Mike Conley, who suffered a gash over his eye Tuesday night in San Antonio.\n\nThe game pretty much became the backdrop for Westbrook's triple-double watch. Each statistic recorded by the Thunder guard drew a check to see if he was approaching the record.\n\n\"I'm happy to get the win. I think that's important, especially for us to get ready for the playoffs,\" Westbrook said.\n\nOklahoma took the lead to 10 in the third quarter, but the teams were tied at 95-all before Doug McDermott connected on a 3-pointer with 1:24 left, earning Westbrook his 10th assist. Oklahoma City never relinquished the lead as Westbrook recorded the Thunder's final five points.\n\n\"We held him from getting a triple-double, so take that Russell Westbrook,\" Memphis coach David Fizdale said with a laugh. Then he changed his tune.\n\n\"He's lightning,\" Fizdale said. \"He's putting his fingertips all over the NBA right now as well as the history books.\"\n\nTIP-INS\n\nThunder: Oklahoma City coach Billy Donovan recorded his 100th win as coach of Oklahoma City. . Westbrook saw his streak of seven straight triple-doubles snapped. Wilt Chamberlain's nine games with a triple-double in 1968 is the most in NBA history. .G Victor Oladipo had 15 points, his fifth straight game with at least 13 points.\n\nGrizzlies: Memphis opened a season-closing, four-game home stand with Wednesday's game. The remaining three are against teams with losing records. .Gasol connected on his third 3-pointer of the game midway through the third quarter, giving him 100 for the season. ... Conley's absence contributed to Memphis using its 24th starting lineup this season.\n\nMVP. MVP. MVP\n\nThe Memphis crowd wasn't chanting the title, but Grizzlies F Zach Randolph sure was after watching in amazement some of the shots by Westbrook, who finished 14 of 25 from the field, and 8 of 13 from outside the arc. \"You're dealing with the MVP when he's playing like that,\" Randolph said. \"He's the MVP hands down. They can give him that award now. It's incredible.\"\n\nCONLEY OUT\n\nConley was ruled out before the game because of the cut over his right eye suffered in an overtime loss to San Antonio on Tuesday. Conley and Spurs forward Kawhi Leonard inadvertently butted heads sending blood oozing from the cut. \"We just want the swelling to go down,\" Fizdale said. \"It really blew up overnight. He can't even see out of the eye right now.\" The cut is on the opposite side of Conley's face from the broken facial bones suffered in a playoff series against Portland two years ago.\n\nUP NEXT\n\nThunder: Westbrook's next attempt at securing the record on his own comes Friday at Phoenix.\n\nGrizzlies: Memphis continues its home stand on Friday against the New York Knicks.",
  "source": "espn_api",
  "crawled_at": 1764995243.610655
}