{
  "game_id": "0022200112",
  "espn_id": "401468267",
  "date": "Nov 02, 2022",
  "matchup": "LAC @ HOU",
  "headline": "George leads Clippers over Rockets 109-101 with Leonard out",
  "body": "HOUSTON -- — Paul George scored 28 points, Marcus Morris added 21 and the Los Angeles Clippers beat the Houston Rockets 109-101 on Wednesday night. \n\n\r\n              It was the Clippers’ second win in a row over Houston following a 95-93 victory on Monday that snapped a four-game skid. \n\n\r\n              “It was a good win for us,” Los Angeles coach Tyronn Lue said. “I knew they were going to come in and play hard. They’re an improved basketball team.” \n\n\r\n              Los Angeles was without Kawhi Leonard, who did not make the road trip because of stiffness in his surgically repaired right knee. It’s the fifth straight game he’s missed, and his time off will stretch to six games Friday when the team visits San Antonio.\n\n\r\n              Lue said he doesn't love how the team has played with Leonard out and that it's on him to help the players adjust to the forward's absence. He added that they've looked better in the last two games than they did in the first few games Leonard missed.\n\n\r\n              “Since the two OKC games we have made a good emphasis on attacking,” Lue said. “If we keep playing that way, we can get better.” \n\n\r\n              Alperen Sengun had 26 points and 13 rebounds and Jalen Green scored 22 points for the Rockets, who have dropped five straight since their only win this season. \n\n\r\n              The game featured the return of John Wall, who spent the last two seasons in Houston, but sat out all last season with the Rockets unable to find a trade destination for the veteran. \n\n\r\n              He had a highlight-reel play when he dribbled into the lane and made a behind-the-back pass to Moses Brown, who finished with a dunk for the first points of the fourth quarter. \n\n\r\n              The Clippers had a seven-point lead before using a 7-2 run, with four points and an assist by George, to make it 105-93 with 3 minutes to go. Reggie Jackson got a steal at the end of that run and found George, who dished to Morris for a 3-pointer that capped the run.\n\n\r\n              The Rockets scored the next six points, but George made two free throws with about a minute left to make it 107-99.\n\n\r\n              Neither team could get its offense going in the fourth quarter and they had combined for just seven points when a 3-pointer by Kevin Porter Jr. cut the lead to 90-85 with about eight minutes to go.\n\n\r\n              The Clippers raced out to a 23-5 lead, but the Rockets soon got going and cut the lead to 56-53 by halftime. \n\n\r\n              “Spotting them at the first timeout 25 and then you’re climbing back all the way to tie it up and then you’ve got to be borderline perfect after that,” Rockets coach Stephen Silas said. “That's a tough way to start a game.”\n\n\r\n              A dunk by rookie Tari Eason got the Rockets within one with about 2 minutes left in the third. But the Clippers scored the last six points of the quarter, with four by Norman Powell, to lead 86-79 entering the fourth. \n\n\r\n              TIP-INS\n\n\r\n              Clippers: Leonard, who missed all last season recovering from a torn right ACL, played in two of the team’s first three games before he began having trouble with his knee. It’s unclear if he’ll return when the Clippers host Utah on Sunday.. ... Nicolas Batum fouled out with about a minute left. \n\n\r\n              Rockets: Jae’Sean Tate missed a second straight game with a sore right ankle. … Porter had 22 points, seven rebounds and seven assists. … Houston made just 11 of 38 3-pointers. ... Sengun fouled out late in the fourth quarter. \n\n\r\n              BROWN'S BIG GAME\n\n\r\n              Lue raved about the play of Brown, who had 13 points and six rebounds off the bench.\n\n\r\n              “Moses came in and did a great job,” Lue said. “He really won the game for us just with his energy and the way he played.” \n\n\r\n              UP NEXT\n\n\r\n              Clippers: Visit the Spurs Friday night.\n\n\r\n              Rockets: Start a four-game road trip at Minnesota Saturday night. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994996.455621
}