{
  "game_id": "401810148",
  "espn_id": "401810148",
  "date": "Nov 29, 2025",
  "matchup": "MIN vs BOS",
  "headline": "Edwards caps 39-point performance with unlikely 3 as Timberwolves hold off Celtics 119-115",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 39 points, including an unlikely 3-pointer that sealed the game, and the Minnesota Timberwolves held off the Boston Celtics 119-115 on Saturday.\n\n\r\n              Julius Randle had 16 points and Donte DiVincenzo added 15 for the Timberwolves, who put six players in double figures and beat a team with a .500 or better record for the first time in eight tries this season.\n\n\r\n              Jaylen Brown tied a season high with 41 points for Boston, which lost for just the second time in seven games. Neemias Queta tied a career best with 19 points and grabbed a career-high 18 rebounds. Derrick White scored 16.\n\n\r\n              With the Timberwolves ahead 115-112 and the shot clock winding down, Edwards briefly lost his dribble but quickly picked up the ball and lofted a 3-point prayer over White that went in with 14 seconds left.\n\n\r\n              Edwards, averaging 38.5 points over his last four games, scored nine straight to give Minnesota a 110-98 lead with 3:52 to play. That included a sequence in which Rudy Gobert grabbed a rebound of Edwards' miss and fed DiVincenzo, who quickly zipped a pass to the cutting Edwards.\n\n\r\n              But then Brown, who made a season-high 17 shots, scored five points and Queta had three in a 12-0 Celtics run to tie it with 1:38 remaining.\n\n\r\n              Edwards scored seven points and Terrence Shannon Jr. five in a 24-12 third-quarter spurt that propelled Minnesota to a 94-92 lead heading to the fourth. \n\n\r\n              Listed as questionable on the team’s injury report due to low back spasms, Brown scored 27 points in the first half — 19 in the first quarter — and Boston led 69-59 at the break.\n\n\r\n              Brown became the first player in the play-by-play era to record at least 27 points, five rebounds, five assists and three steals in the first half.\n\n\r\n              Up next\r\n              Celtics: Play at Cleveland on Sunday night.\n\n\r\n              Timberwolves: Host the San Antonio Spurs on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042714.506358
}