{
  "game_id": "0021500478",
  "espn_id": "400828365",
  "date": "Dec 30, 2015",
  "matchup": "CHI vs. IND",
  "headline": "Jimmy Butler's tip-in with 1.2 left in OT hands Bulls win over Pacers",
  "body": "CHICAGO -- It was a broken play, and the result made the Chicago Bulls' night.\nJimmy Butler tipped in a basket with 1.2 seconds left in overtime, and the Bulls beat the Indiana Pacers 102-100 Wednesday night despite playing without Derrick Rose.\nOn the last play, Butler was supposed to take the final shot but was guarded off the inbound pass. Instead, the ball went to Pau Gasol.\n\nButler cut along the baseline, then tipped in Gasol's one-handed lob pass.\n\"That's on Pau,\" Butler said.\nBulls coach Fred Hoiberg gave credit to both.\n\"That was just a heck of a pass and an unbelievable finish in there by two guys that know how to play,\" Hoiberg said.\nButler then defended Paul George on a lob to preserve the win. George didn't sound thrilled Butler wasn't whistled for a foul, but that wasn't his only complaint.\n\"It shouldn't have gotten to that point,\" George said. \"We were up seven and pretty much in control before we got to OT. We let this one get away.\"\nIndiana coach Frank Vogel tried to be diplomatic about the final play.\n\"I'll address it with the league,\" he said.\nButler scored 28 points, including 15 in the fourth quarter and overtime combined, and Aaron Brooks had 29 points to help Chicago win its third in four games. Chicago got 52 points from its bench and held Indiana to 38.1 percent shooting from the field. Gasol had 13 points and 11 rebounds.\nRose was scratched an hour before the game with right hamstring tendinitis. Rose had played in 27 of Chicago's first 29 games, averaging 14.4 points. The only two games he missed were in November because of a sprained left ankle.\nHoiberg said Rose's hamstring stiffened up during the day and that the team couldn't get it loose enough for him to play.\n\"We took a cautious approach and decided to sit him tonight,\" Hoiberg said.\nKirk Hinrich started in place of Rose and scored three points.\nBrooks played almost 41 minutes without Rose. He hit a floater with 58.7 seconds left in overtime that gave Chicago a 100-95 advantage. Solomon Hill made two free throws, and Brooks' turnover set up Monta Ellis' tying 3-pointer with 3.7 seconds left.\nGeorge's floater with 59.9 seconds left in regulation put Indiana in front 89-84. Butler then hit two free throws, and Chicago got the ball back after George Hill's turnover. Butler's 3-pointer bounced in with 34.9 seconds left to even the score at 89-89.\nEllis made a layup with 31.3 seconds left, but Butler tied it with 25 seconds to go.\n\"To tell you the truth, they kept giving me the ball,\" Butler said. \"I wasn't making shots earlier, but they told me to stay aggressive.\"\nEllis' 3-point attempt at the buzzer fell short.\nGeorge Hill led Indiana with 20 points.\nPACERS HURTING, TOO\nThe Pacers also had injury issues. C.J. Miles (sore lower back) and Jordan Hill (dental work) both sat, forcing Indiana to test its frontcourt depth. Lavoy Allen started and scored 10 points with 12 rebounds in 38 minutes. Rookie Myles Turner played 22 minutes and scored eight points in his return after missing 22 games because of a broken left thumb.\nThen with 2:44 left in the third, Ian Mahinmi limped off the court favoring his left knee and didn't return. He'll be re-evaluated Thursday.\nWORKING ON IT\nButler criticized Hoiberg's passivity after the Bulls' loss to New York on Dec. 19. On Wednesday, Butler praised Hoiberg.\n\"I think that he's holding me accountable for everything,\" Butler said.\nRUSTY RETURN\nTurner was 2-of-7 from the field and blocked three shots. Vogel noticed the impact of his first-year big man missing time.\n\"The kid played with a lot of heart,\" Vogel said.\nTIP-INS\nPacers: Miles was scratched about an hour before tipoff and missed his second straight game. ... For the fourth time, the Pacers wore their \"Hickory\" alternate uniforms, inspired by the Indiana high school team from the movie \"Hoosiers.\" ... George had 19 points.\nBulls: Doug McDermott (right knee) was questionable for Wednesday's game but played 21 minutes and scored five points. ... Hoiberg said little-used forward Cristiano Felicio will be assigned to the D-League.\nUP NEXT\nPacers host Milwaukee on Thursday night.\nBulls host New York on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764993942.466742
}