{
  "game_id": "0022300534",
  "espn_id": "401585162",
  "date": "Jan 12, 2024",
  "matchup": "DET vs. HOU",
  "headline": "Fred VanVleet's hot 2nd half leads Houston Rockets to comeback victory over Detroit Pistons",
  "body": "DETROIT -- — Fred VanVleet scored 17 points in the second half, including eight in a key fourth-quarter stretch, as the Houston Rockets handed the Detroit Pistons their seventh straight loss, 112-110 on Friday night.\n\n\r\n              Detroit is 1-35 after a 2-1 start, including an NBA-record matching 28-game losing streak. The current streak started with a 136-113 loss to the Rockets on New Year's Day.\n\n\r\n              Jaden Ivey had an open look at a game-winning 3-pointer with three seconds left, but it went in and out. \n\n\r\n              “We got a little bit lucky,” Rockets coach Ime Udoka said. “We'll take it, but it feels like we stole one.”\n\n\r\n              The Pistons still had a chance to tie, but Jalen Duren couldn't grab the offensive rebound.\n\n\r\n              Alec Burks and Kevin Knox II had 19 each for the Pistons, who played without leading scorers Cunningham (knee) and Bogdanovic (calf).\n\n\r\n              “My mentor always told me that life's not fair, and you shouldn't expect it to be,” Pistons coach Monty Williams said. “As hard as our guys played with Cade and Bojan, that was a moment where you just say ‘oh, come on.' \"\n\n\r\n              “That's a cruel way to lose.”\n\n\r\n              Alperen Sengun scored 29 and Jalen Green added 28 for Houston, which had lost two in a row. VanVleet finished with 20 points and 12 assists.\n\n\r\n              “I don't think we played hard,” Sengun said.\n\n\r\n              Isaiah Stewart played his first game for the Pistons since Dec. 26 and had 16 points and seven rebounds.\n\n\r\n              “I thought we did a good job of competing, but we let them get some good shots up down the stretch,” he said. \n\n\r\n              Detroit took a 103-98 lead on Burks' 3-pointer with 5:59 left, and the Rockets struggled to hit shots until VanVleet's 3-point play made it 107-105 with 2:58 left.\n\n\r\n              After Ivey missed two free throws, VanVleet put Houston ahead with a 3-pointer, then made it 110-107 with a short jumper. VanVleet then picked up his 12th assist, setting up Sengun's dunk.\n\n\r\n              “VanVleet is the kind of guy who can hit all those shots at the end of a game,” Stewart said. “It's frustrating, because we let him get the looks he needed.”\n\n\r\n              Stewart, though, hit a 3-pointer to pull the Pistons within 112-110 and VanVleet missed a 3 with 6.6 seconds left.\n\n\r\n              The game was tied at 55 going into the second half, but the Pistons started the third quarter with a 17-6 run that included 14 points from Knox and Stewart.\n\n\r\n              Houston answered with a 12-2 run that brought them within 91-88 at the end of the third. VanVleet had five points and five assists in the period.\n\n\r\n              Jeff Green left the game in the third quarter after banging knees in a collision. Udoka said he could have stayed in the game, but his knee swelled up when he sat on the bench.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Visit Boston on Saturday night.\n\n\r\n              Pistons: Visit Washington on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995775.7162619
}