{
  "game_id": "0022400256",
  "espn_id": "401704822",
  "date": "Nov 20, 2024",
  "matchup": "OKC vs. POR",
  "headline": "Williams scores 30, Hartenstein has double-double in season debut as Thunder beat Trail Blazers",
  "body": "OKLAHOMA CITY -- — Jalen Williams scored 30 points, Isaiah Hartenstein had a double-double in his season debut, and the Oklahoma City Thunder beat the Portland Trail Blazers 109-99 on Wednesday night.\n\n\r\n              Hartenstein, a free agent pickup who played for the New York Knicks last season, had been out with a broken bone in his left hand. He had 13 points, 14 rebounds and four blocks in 29 minutes and provided rim protection and bulk for a team that has struggled with injuries in the frontcourt. \n\n\r\n              Shai Gilgeous-Alexander added 28 points for the Thunder. He made just 7 of 19 field goals, but he made all 14 of his free throws to help Oklahoma City snap a two-game losing streak.\n\n\r\n              Alex Caruso scored 17 points to help Oklahoma City’s bench outscore Portland’s 44-31.\n\n\r\n              Shaedon Sharpe led Portland with 21 points and Toumani Camara and Jerami Grant each added 14 for the Trail Blazers.\n\n\r\n              The game was close for three quarters before the Thunder used a 39-30 fourth-quarter surge to pull away,\n\n\r\n              Takeaways\r\n              \r\n              Thunder: Hartenstein proved his value immediately. The Thunder had been getting dominated on the boards in recent games, so losing the rebounding battle 49-46 resembled a victory.\n\n\r\n              Trail Blazers: Oklahoma City scored 28 points off Portland's 24 turnovers.\n\n\r\n              Key moment\r\n              Oklahoma City trailed 20-13 with 5:10 left in the first quarter when Hartenstein entered the game after missing the first 15 contests. His presence was especially important because the Thunder will be without Chet Holmgren, one of the league's top rim protectors, for at least another six weeks with a pelvic fracture.\n\n\r\n              Key stat\r\n              Oklahoma City outscored the Blazers 56-32 in points in the paint.\n\n\r\n              Up next\r\n              The Trail Blazers visit Houston on Friday and the Thunder visit Sacramento on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997684.044708
}