{
  "game_id": "0022200129",
  "espn_id": "401468284",
  "date": "Nov 04, 2022",
  "matchup": "MIL @ MIN",
  "headline": "Giannis has triple-double, Bucks beat Wolves for 8-0 start",
  "body": "MINNEAPOLIS -- — Giannis Antetokounmpo had 26 points, 13 rebounds and 11 assists, Jrue Holiday scored 29 points and the Milwaukee Bucks beat the Minnesota Timberwolves 115-102 on Friday night to improve to 8-0, the best start to a season in franchise history.\n\n\r\n              Bobby Portis Jr. added 18 points off the bench for the Bucks, the NBA’s only undefeated team. Milwaukee started 7-0 in both 2018-19 and 1971-72.\n\n\r\n              “I feel like we're building the right habits, playing the right way, winning in different ways,\" Holiday said. “It feels good to be 8-0.”\n\n\r\n              Minnesota has dropped three straight to fall to 4-5. Anthony Edwards paced the Wolves with 24 points, while Karl-Anthony Towns added 22 points and 11 rebounds.\n\n\r\n              “They’re a high-level team, obviously, a championship level team,” Towns said. “There’s a lot to learn in these games like this. Just continue to find ourselves getting better every night throughout the season.”\n\n\r\n              The Timberwolves couldn’t overcome a 22-point third-quarter deficit. Minnesota cut Milwaukee’s lead to eight at 97-89 on Naz Reid's transition dunk in the fourth quarter after Reid blocked Antetokounmpo at the other end.\n\n\r\n              Antetokounmpo came alive after that. He threw down a thunderous dunk, and later hit a 3 from the top of the key that pushed Milwaukee’s advantage back to 13. Two possessions later, including a finger roll by Antetokounmpo, the Bucks led 108-91.\n\n\r\n              His triple-double was his first this season and 30th of the two-time MVP's career.\n\n\r\n              “I think he picked his spots well,” Bucks coach Mike Budenholzer said.\n\n\r\n              Plenty of Bucks fans were in attendance at Target Center for Friday’s border battle, with many sporting Antetokounmpo’s No. 34 jersey. At one point, a “Bobby!” chant erupted for Portis. He hit a corner 3-pointer to stop a brief Wolves threat late in the third quarter, and connected from nearly the same spot with just over a minute to go in the third.\n\n\r\n              “That was crazy,” Portis said of the chants of his name. “That was cool, but definitely humble in victory, get ready for another big game tomorrow to try to extend the streak.”\n\n\r\n              Timberwolves fans found multiple occasions to boo their team after Minnesota fell behind big in the second half. Those same fans came to life briefly in the third when Jalen Nowel's layup capped a 10-0 Wolves run.\n\n\r\n              Holiday led the way in the first half, scoring 16 points to lift the Bucks to a 61-54 halftime lead.\n\n\r\n              Milwaukee extended its lead to 18 midway through the third quarter thanks to a 17-6 run that included five points from Holiday to open the second half.\n\n\r\n              This was Milwaukee's first look at Minnesota since the Wolves acquired big man Rudy Gobert in the offseason to pair next to Towns. Gobert grabbed 13 boards but had just seven points in the loss.\n\n\r\n              The Bucks outrebounded Minnesota 51-47.\n\n\r\n              The Wolves turned the ball over 16 times, which turned into 22 Bucks points. Jaden McDaniels committed four of Minnesota’s 12 turnovers.\n\n\r\n              D'Angelo Russell shot 3 of 15 for Minnesota, including 2 of 8 from deep.\n\n\r\n              BIG GAME FOR BEAUCHAMP\n\n\r\n              Rookie guard MarJon Beauchamp, playing in his fifth NBA game, hit a pair of 3-pointers in the first half. He had made just two field goals all season prior to Friday night. Beauchamp finished with a career-high 14 points off the bench.\n\n\r\n              “He's just kind of getting a better feel, getting more confident. We're getting more confident in him,” Budenholzer said. “He's just got a competitiveness, a pureness that I think his teammates enjoy him and are excited for him.”\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Forward Jordan Nwora landed hard after trying to contest a layup in the second half of Milwaukee's win. Budenholzer said Nwora was ultimately OK after the fall, if not a bit sore.\n\n\r\n              Timberwolves: Edwards and Gobert were listed as questionable due to illness, but both started. ... Gobert airballed his second 3-point shot attempt of the year. ... Towns fouled out with 1:54 remaining in the game.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Oklahoma City on Saturday night.\n\n\r\n              Timberwolves: Host Houston on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994604.1717708
}