{
  "game_id": "0021900030",
  "espn_id": "401160672",
  "date": "Oct 26, 2019",
  "matchup": "IND @ CLE",
  "headline": "Thompson scores 25, makes first 3 in Cavs' win over Pacers",
  "body": "CLEVELAND --  John Beilein was soaked from his shirt to his socks after an unexpected shower.\n\nCleveland's rookie coach had his pro basketball baptism.\n\nBeilein picked up his first NBA win and got doused with water in the locker room by Kevin Love, Tristan Thompson and the rest of the Cavaliers, who played the kind of ball their rookie coach has been preaching for weeks in a 110-99 win over the Indiana Pacers on Saturday night.\n\nThompson scored 25 points and made his first career 3-pointer and Love scored 21 and just missed a triple-double as the Cavs opened their 50th season at home with a solid win over a playoff team from last year.\n\nFollowing the game, Beilein presented with the game ball by general manager Koby Altman before he was ambushed by the Cavs, who jumped from their seats and dumped water bottles over his head.\n\n\"Excuse my appearance,\" the former Michigan coach said as he sat down for his news conference. \"I just took a little bath.\"\n\nBeilein, who won at every level in college, said he'll savor the memento from his first pro victory.\n\n\"I'm very fortunate to have a lot of game balls, but this one is going to be pretty special,\" the 66-year-old said. \"It's an NBA ball No. 1, but anytime you change jobs like this it's a very difficult time on your family, on you and everyone -- it's such a transition. It will be special.\"\n\nCavs forward Larry Nance was thrilled for Beilein.\n\n\"It was awesome just to see him breathe a nice sigh of relief,\" he said. \"There was a lot of pressure on us, especially the home opener so for him to get this win. First win for a lot of the guys -- all the rookies.\n\nThe Cavs began their golden anniversary by honoring the club's past. They brought back some of their legendary players and wore uniforms from the 1990s while taking a look back their history.\n\nThe present looked more promising.\n\nLove was much more involved than during an opening-night loss at Orlando on Wednesday, adding 13 rebounds and nine assists. Thompson also had 13 rebounds, Collin Sexton scored 18 and rookie Darius Garland 12, making a key, step-back 3-pointer down the stretch to slow Indiana's comeback.\n\nMalcolm Brogdon scored 30 and had 10 assists to lead the Pacers.\n\nThe Cavs blitzed the Pacers to open second quarter, going on a 26-4 run. They made seven 3-pointers and outscored Indiana 39-20 in the period to open a 65-48 halftime lead.\n\n\"They pretty much did whatever they wanted,\" Pacers coach Nate McMillan said. \"Giving up 39 points, you just can't have quarters like that. They were the more aggressive team, the scrappier team.\"\n\nIt was Thompson's stunning 3-pointer in the first quarter that got the Cavs going.\n\nThompson, who has been working on his range in practice, hadn't attempted a 3 since the 2016-17 season, when he pulled up and dropped a 27-footer -- his first make from beyond the arc in 642 games.\n\n\"No way,\" Beilein said with a smile when asked if Thompson will have the green light going forward.\n\nTIP-INS\n\nPacers: McMillian said injured All-Star G Victor Oladipo continues to progress as he recovers from knee surgery. He's been scrimmaging, but hasn't been cleared to play in full-court workouts. ... G Jeremy Lamb sat out with a bruised right hip sustained in the season-opening loss to Detroit on Wednesday. He did some drills following shootaround, but was still feeling pain.\n\nCavaliers: Finalized a four-year, $30.8 million contract extension with F Cedi Osman, who scored just 1 point in 27 minutes. ... F John Henson made his Cleveland debut after missing most of last season with a wrist injury sustained while with Milwaukee. Henson had been slowed this season by ankle and groin injuries.\n\nBAD BOARDS\n\nMcMillan was unhappy with his team's rebounding. For the second straight game, the Pacers got pounded inside.\n\nDetroit's Andre Drummond had 23 rebounds in the opener.\n\nMcLEOD HONORED\n\nLove wore a neck tie while warming up before the game to pay tribute to Fred McLeod, the club's popular broadcaster who died unexpectedly in September. McLeod's widow, Beth, sent ties from her husband's collection to select players, coaches and media members to wear for the opener.\n\nThe Cavs showed a moving video during the first quarter with highlights from McLeod, who handled play-by-play duties for the Detroit Pistons before coming to the Cavs in 2006. Owner Dan Gilbert narrated the video. He suffered a stroke in May and has been recovering at home.\n\nUP NEXT\n\nPacers: At Chicago on Monday.\n\nCavaliers: At Milwaukee on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-NBA",
  "source": "espn_api",
  "crawled_at": 1764995889.612771
}