{
  "game_id": "0021800962",
  "espn_id": "401071635",
  "date": "Mar 05, 2019",
  "matchup": "MEM vs. POR",
  "headline": "Conley's career-high sends Grizzlies past Portland 120-111",
  "body": "MEMPHIS, Tenn. --  Mike Conley went scoreless in the first quarter, then carried the Memphis Grizzlies down the stretch against a team jockeying for playoff position in the Western Conference.\n\nConley scored 19 of his career-high 40 points in the fourth quarter as Memphis overtook the Portland Trail Blazers late for a 120-111 victory Tuesday night.\n\nConley made six of his seven shots in the fourth, including all three 3-point attempts, as Memphis erased a nine-point Portland lead in the final quarter with a 38-25 scoring advantage in the period.\n\n\"It was a lot of fun,\" Conley said. \"It was a weird game. Because I felt like I didn't play well at the beginning of the game. The whole team really didn't start well, and to end it the way that we did and for me to play like that in the second half was special.\"\n\nFor three-plus quarters it looked as if Portland would end its season-longest seven-game trip on a successful note. The Trail Blazers, who led by 16 in the first quarter, appeared headed to closing the trek with a 6-1 record because they held an 86-82 lead entering the fourth and stretched it to nine points with eight minutes left.\n\nBut Conley started his 19-point push with a 3-pointer. That began an 11-2 rally that pulled Memphis even at 96-all. After a couple of ties and trio of lead changes, Memphis pulled away down the stretch, a key basket coming on a 4-point play by Conley with 1:38 left.\n\nDelon Wright matched his career high with 25 points and Jonas Valanciunas finished with 17.\n\nCJ McCollum led Portland with 27 points, while Damian Lillard added 24. Maurice Harkless finished with 20 points.\n\n\"We had a 16-point lead, and they just kept playing and defending,\" Portland coach Terry Stotts said of the Grizzlies. \"Mike Conley was outstanding. He had his shot going and was directing the offense. And he got into us defensively.\"\n\nWhile Conley was scoring, the Trail Blazers were struggling. While Portland was 9 of 18 from the field in the fourth, it missed all six of its shots from beyond the arc. Coupled with six turnovers in the final 12 minutes, Memphis was able to overtake Portland.\n\nThe loss, along with Oklahoma City losing to Minnesota, plus the Houston defeating the Toronto Raptors, left the Trail Blazers, Thunder and Rockets all tied for the Western Conference's third playoff spot with identical 39-25 records.\n\nMeanwhile, Memphis is trying to improve its play while closing out the season. The Grizzlies won for the third time in five games.\n\n\"It'll be fun if we can all stay together and keep growing,\" said Wright, who joined the team in the trade that sent center Marc Gasol to Toronto. \"I feel like that's what these games are for. Just want to continue building off this and keep growing.\n\nTIP-INS\n\nTrail Blazers: Al-Farouq Aminu connected on a 3-pointer in the first quarter, giving him 403 in his Portland career. That tied him with Martell Webster for 10th place on the franchise list for 3-pointers made. . Portland ended the road trip with a 5-2 record, matching the best seven-game road trip in franchise history. . Portland had 25 assists, the 26th game in which they have recorded at least 25 assists.\n\nGrizzlies: Announced before the game that F Kyle Anderson, who missed his 14th straight game with right shoulder soreness, will receive an anesthetic injection in hopes of relieving the pain. The team said another medical update would be made in two weeks. . Conley's previous career high was 38 points at Phoenix on Jan. 30, 2017. ... .CJ Miles scored 12 points and recorded two blocks.\n\nSTILL LEARNING THINGS\n\nMemphis has really shuffled its roster since the first of the year. With Conley out on Sunday against Oklahoma City, the Grizzlies started five players against the Thunder who weren't on their roster on New Year's Day. \"Right now, we don't know plays, honestly,\" Conley said. \"We'll call a play, and we're all looking like: `I don't know where to go.' We're all trying to figure it out on the fly.\"\n\nUP NEXT\n\nTrail Blazers: Host Oklahoma City on Thursday.\n\nGrizzlies: Host the Utah Jazz on Friday\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994903.73397
}