{
  "game_id": "0022400375",
  "espn_id": "401704941",
  "date": "Dec 20, 2024",
  "matchup": "MIA vs. OKC",
  "headline": "Jalen Williams scores 33 points, Thunder remain red-hot by topping Heat 104-97",
  "body": "MIAMI -- — Jalen Williams scored a season-high 33 points, Shai Gilgeous-Alexander had 25 and the Oklahoma City Thunder beat the Miami Heat 104-97 on Friday night for their seventh straight victory.\n\n\r\n              Lu Dort scored 14 points and Isaiah Hartenstein had 13 points and 18 rebounds for the Thunder, who improved to 22-5 — the second-best record in the NBA and tops in the Western Conference.\n\n\r\n              Oklahoma City's winning streak is alive because the NBA Cup final — a loss Tuesday night to Milwaukee in Las Vegas — doesn't count as a regular-season game.\n\n\r\n              Tyler Herro had 28 points and 12 rebounds for Miami, which got 17 points and 10 rebounds from Bam Adebayo.\n\n\r\n              The Heat lost Jimmy Butler to illness in the first quarter and briefly lost Adebayo in the third quarter when he got elbowed over an eye by teammate Jaime Jaquez Jr. Adebayo needed seven stitches but returned.\n\n\r\n              Takeaways\r\n              Thunder: Williams' previous season high was 31. And the big difference for the Thunder was turnovers — they turned 19 Miami giveaways into 27 points.\n\n\r\n              Heat: Managing general partner Micky Arison and senior director of team development Ruth Riley Hunter — an NCAA, Olympic and WNBA champion — are Basketball Hall of Fame candidates for the Class of 2025. “It's about time” for Arison, said Heat coach Erik Spoelstra, who added that those like Hunter — with college, pro and Olympic titles — should be a Hall lock.\n\n\r\n              Key moment\r\n              Oklahoma City trailed by three midway through the third quarter, then went on a 10-0 run to kickstart a finishing push. The Thunder were up by 11 entering the fourth.\n\n\r\n              Key stat\r\n              Gilgeous-Alexander has scored at least 25 points in 17 consecutive games, the longest such streak in the NBA this season.\n\n\r\n              Up next\r\n              The Thunder host Washington on Monday. The Heat are at Orlando on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996915.831991
}