{
  "game_id": "0022400363",
  "espn_id": "401704929",
  "date": "Dec 19, 2024",
  "matchup": "CHI @ BOS",
  "headline": "Zach LaVine scores season-high 36 points to help the Bulls hold off the Celtics 117-108",
  "body": "BOSTON -- — Zach LaVine scored a season-high 36 points and the Chicago Bulls used a fourth-quarter flurry to hold off the Boston Celtics 117-108 on Thursday night in the opener of a home-and-home set.\n\n\r\n              The teams will meet again in Chicago on Saturday night.\n\n\r\n              Ayo Dosunmu added 17 points and Nikola Vucevic had 16 points and 14 rebounds to help Chicago win its season-best third straight.\n\n\r\n              Chicago outscored Boston 35-22 in the fourth quarter and made 19 3-pointers for the game.\n\n\r\n              Jayson Tatum had 31 points to lead Boston, which lost for just the fourth time at home this season. Kristaps Porzingis added 20 points and eight rebounds. \n\n\r\n              Chicago’s big fourth quarter included technical fouls on coach Joe Mazzulla, Jaylen Brown and Tatum that left Boston scrambling for the rest of the game. \n\n\r\n              Mazzulla’s frustrations continued after the game when he had to be restrained by two assistant coaches from confronting the officials. \n\n\r\n              Takeaways\r\n              Bulls: One of Chicago’s best efforts this season came without Josh Giddey, who missed his first game this season because of a sprained ankle.\n\n\r\n              Celtics: A frustrating night for Boston, which got rattled and forced up some 3s late.\n\n\r\n              Key moment\r\n              Chicago opened the final period with a 17-4 run to take a 99-90 lead. Boston scored six straight before back-to-back technical fouls were called on Mazzulla and Brown after both protested a non-foul call on Brown. LaVine connected on both ensuing free throws and then hit a 31-footer to put Chicago back in front 104-96. Later in the period, Tatum picked up a technical as well, that helped extend the Bulls’ lead to 10.\n\n\r\n              Key stat\r\n              The Celtics made 14 3-pointers to end the Bulls’ three-game streak of holding opponents under 10.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997086.702579
}