{
  "game_id": "0021500074",
  "espn_id": "400827961",
  "date": "Nov 05, 2015",
  "matchup": "MEM @ POR",
  "headline": "Lillard leads Blazers to 115-96 win over Memphis",
  "body": "PORTLAND, Ore. --  Even early in the season, Damian Lillard can see good things ahead for the young Portland Trail Blazers if they keep playing the way they did against the Memphis Grizzlies.\n\nLillard scored 27 points, including seven 3-pointers, and Portland used its speed, athleticism and long-range shooting touch to beat Memphis 115-96 on Thursday night.\n\nFourteen of Lillard's points came during a stretch of just under 7 minutes in the third quarter, when the Blazers outscored the Grizzlies 28-9. From there, Portland cruised to the win.\n\n\"We've just got to keep on going, and keep playing hard,\" Lillard said about his team's surprising 4-2 start after losing four starters in the offseason. \"That's where our strength is.\"\n\nIt was the second game of a back-to-back for the Blazers, who have strung together a modest three-game winning streak. C.J. McCollum added 20 points and a career-high five assists.\n\nCourtney Lee led the Grizzlies with 18 points while Zach Randolph, who played for the Blazers for the first six years of his career, had 16 points and 10 rebounds.\n\nLillard's seven 3s included one that put Portland ahead 95-71 early in the fourth quarter, and another that pushed the lead to 112-87 with 3:53 to go.\n\n\"I was going to take him out but he told me not to,\" Blazers coach Terry Stotts said.\n\nPortland was coming off a 108-92 victory at Utah on Wednesday. Lillard and McCollum combined for 62 points against the Jazz.\n\nThe Grizzlies, in the midst of a five-game road trip, were routed by reigning NBA champion Golden State 119-69 on Monday, but rebounded to beat Sacramento 103-89 on Tuesday.\n\n\"They're a young team, they're athletic,\" Memphis coach David Joerger said about the Blazers. \"We're a little older and slower, but they beat us to every single ball. They got whatever they wanted.\"\n\nThe Grizzlies defeated the Blazers in the first round of the playoffs last season in five games. Lillard is the only starter that remains with Portland from that team, following the offseason departures of LaMarcus Aldridge, Nicolas Batum, Wesley Matthews and Robin Lopez.\n\nLee and Randolph iced their knees on the Memphis bench to start the second quarter, but Lee's 3-pointer gave the Grizzlies a 35-32 lead midway through the period.\n\nJeff Green hit a half-court shot at the buzzer that was originally called good, but a replay review showed time had run out. So the Blazers led 50-46 at halftime.\n\nLillard hit a 3 and Portland added free throws to pull in front 67-62 midway through the third quarter. Maurice Harkless dunked to extend it to 71-63, and Portland led by as many as 26 points.\n\n\"That's the kind of team we need to be,\" Lillard said.\n\nTIP-INS\n\nGrizzlies: Seventeen-year veteran Vince Carter needs three more games to pass Steve Nash for 30th on the NBA's career list. Carter, who did not play against the Blazers, is sitting at 1,215 games.\n\nTrail Blazers: Portland has 19 back-to-backs this season. ... Lillard and Oklahoma City's Russell Westbrook are the only players ranked within the league's top six in points and assists. ... McCollum has scored at least 15 points in all six games this season.\n\nRAINING 3s\n\nLillard's seven 3-pointers were one shy of his career high. Six came in the second half, which was one off the team record for a half. Lillard has 23 3-pointers this season, second only to Golden State's Stephen Curry, the reigning MVP, who has 28.\n\nOverall, Portland made 15 of 30 3-point attempts against the Grizzlies.\n\nDEFENSIVE STRUGGLE\n\nMarc Gasol said Portland's shooting posed a challenge for the Grizzlies.\n\n\"They take so many long shots that normally that ball is going to bounce over your head, so you have to stay disciplined and box out,\" Gasol said. \"We were all out of position because we got broke down on so many plays. We were chasing our tails all around the floor.\"\n\nUP NEXT\n\nTrail Blazers: Host Detroit on Sunday.\n\nGrizzlies: At Utah on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994484.4746082
}