{
  "game_id": "0022200625",
  "espn_id": "401468780",
  "date": "Jan 11, 2023",
  "matchup": "SAC vs. HOU",
  "headline": "Sabonis nearly has triple-double, Kings top skidding Rockets",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had 25 points, 14 rebounds and nine assists as the Sacramento Kings beat the skidding Houston Rockets 135-115 on Wednesday night.\n\n\r\n              “It starts with our two All-Stars,\" Kings coach Mike Brown said about Sabonis and De'Aaron Fox.\n\n\r\n              Fox added 24 points and nine assists for Sacramento (22-18). Trey Lyles scored 15 of his 20 points off the bench in the fourth quarter. Keegan Murray and Harrison Barnes each finished with 16.\n\n\r\n              “We feel like we’re a good team, but we feel like we can be a whole lot better than we are,\" Fox said. \"It’s good. I’m happy that we aren’t lower, but I feel like we can be better. We have a long way to go.”\n\n\r\n              Alperen Sengün became the youngest center in NBA history with a triple-double. The 20-year-old finished with 10 points, 10 rebounds and 10 assists for Houston (10-31).\n\n\r\n              “It was a great moment for me,” Sengün said. “Appreciate my whole team.”\n\n\r\n              Jalen Green had 26 points for the Rockets, who have lost eight consecutive games and 13 of their last 14. Kenyon Martin Jr. scored 21 off the bench.\n\n\r\n              “It was a combination of missing good and open shots,” Rockets coach Stephen Silas said about the final quarter. “And then not doing what we needed on the defensive end. … We have to figure out a way to close these games.”\n\n\r\n              TIP-INS\n\n\r\n              Rockets: Garrison Matthews received a flagrant foul with 2:09 remaining in the third quarter. … G Kevin Porter Jr. exited after 10 minutes with a bruised left foot. ... Houston is 4-17 on the road.\n\n\r\n              Kings: G Kevin Huerter was ruled out before the game with a non-COVID-19 illness. Terence Davis started in his place.\n\n\r\n              UP NEXT\n\n\r\n              The teams finish a two-game series Friday night with another game in Sacramento.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995306.7149289
}