{
  "game_id": "0022300635",
  "espn_id": "401585263",
  "date": "Jan 26, 2024",
  "matchup": "HOU @ CHA",
  "headline": "Jalen Green scores 36 points to help Rockets rout Hornets 138-104",
  "body": "CHARLOTTE, N.C. -- — Jalen Green scored 36 points, rookie Cam Whitmore had a career-high 24 points and 11 rebounds and the Houston Rockets routed the Charlotte Hornets 138-104 on Friday night.\n\n\r\n              Fred VanVleet had 14 points and Amen Thompson added 13 off the bench for the Rockets. They shot 30 of 40 from the field in the second half and outscored the Hornets 83-51.\n\n\r\n              Miles Bridges had 21 points for the Hornets. They fell to 5-15 at home.\n\n\r\n              The Rockets led by two at halftime, then blew it open in the third quarter outscoring the Hornets 44-25 with two of Charlotte’s best scorers in LaMelo Ball and Brandon Miller spending the majority of the time on the bench because of foul trouble.\n\n\r\n              The Rockets put the game away with four straight 3s on their first four possessions to open the fourth quarter — the first three by Whitmore — pushing the lead to 31.\n\n\r\n              “I mean, it shows that our identity is when we guard at that level, we are in good shape, and so anytime we can get stops and not have to play in the half court every time at a slower pace, it benefits a lot of guys,\" Rockets coach Ime Udoka said. “We are going to get back to the identity of guarding instead of just getting in track meets up and down with teams like we have lately.”\n\n\r\n              Whitmore, the No. 20 overall pick in the 2023 draft, started cold from the floor, then began to drive to the basket and make plays. That gave him some confidence, and the onslaught of 3-pointers soon followed.\n\n\r\n              “I got it going and my teammates and coaches just said keep letting it fly, and if you're open shoot it,” Whitmore said. “So they had the confidence in me.”\n\n\r\n              The Rockets were 5 of 22 from beyond the arc for the first three quarters, then made 7 of 8 3s to start the fourth quarter.\n\n\r\n              Hornets coach Steve Clifford said his team had the “wrong attitude” in the third quarter and he didn't like the body language.\n\n\r\n              “It was the refs' fault, it was my teammate's fault,” Clifford said. “We've got to have the right attitude.”\n\n\r\n              Houston had lost five of its previous six games, but the Rockets were able to rest their starters for the majority of the fourth quarter after building a 37-point lead which could help them in tomorrow night's game at Brooklyn.\n\n\r\n              “We needed this one bad,” Whitmore said. “Coach has preached just be tough and take that anger into the next game and that's what we did. So we have to keep this momentum going.”\n\n\r\n              Green, who came in averaging 17.4 points per game, scored 17 points in the decisive third quarter and finished the game with 12 of 20 from the field and 11 of 12 from the foul line, seemingly scoring at will on strong drivers and jumpers against the lifeless Hornets. He also had nine rebounds and four assists.\n\n\r\n              The Rockets won despite playing without Jabari Smith, who sat out with an ankle injury. \n\n\r\n              The Hornets are struggling to find their way after trading away leading scorer Terry Rozier to the Miami Heat.\n\n\r\n              They received Kyle Lowry in return, but general manager Mitch Kupchak said after the trade the team has no plans to bring him to Charlotte before the trade deadline as he looks to get something in return for the veteran point guard. It's likely the Hornets will reach a buyout with Lowry if they can't trade him. \n\n\r\n              “We don't have much margin for error,” Clifford said of his team, which continues to play without injured starters Gordon Hayward and Mark Williams.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: At Brooklyn on Saturday night.\n\n\r\n              Hornets: Host Utah on Saturday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995605.557125
}