{
  "game_id": "401809814",
  "espn_id": "401809814",
  "date": "Nov 28, 2025",
  "matchup": "DET vs ORL",
  "headline": "Desmond Bane's 37 points and key rebounds help Magic beat Pistons 112-109 to win NBA Cup group",
  "body": "DETROIT -- — Desmond Bane scored 37 points and grabbed two crucial offensive rebounds as the Orlando Magic defeated the Detroit Pistons 112-109 on Friday night to win their NBA Cup group.\n\n\r\n              Orlando went 4-0 in East Group B and advanced to the knockout round. The Magic overcame a triple-double by the Pistons' Cade Cunningham, who finished with 39 points, 12 rebounds and 11 assists.\n\n\r\n              Franz Wagner added 21 points for Orlando.\n\n\r\n              Tobias Harris had 18 points for the Pistons, who have lost two straight after a 13-game winning streak. Jalen Duren had 16 points and 12 rebounds. Detroit went 2-2 in NBA Cup play and did not advance.\n\n\r\n              Bane's three-point play with 2:11 left gave Orlando a 108-106 lead, and Wagner added a layup to make it a four-point game. Tobias Harris hit a 3-pointer and Detroit got a stop, but Cunningham committed his eighth turnover with 1:03 left.\n\n\r\n              Wagner missed two 3-pointers on the ensuing possession, but Bane grabbed both rebounds. Wagner missed again as the shot clock expired, but Wendell Carter Jr. got another offensive rebound.\n\n\r\n              Jalen Suggs made two free throws with 6.3 seconds left, making it 112-109, and the Magic fouled Cunningham with 4.7 seconds left.\n\n\r\n              He missed the first free throw, then intentionally missed the second and got his own rebound. He got the ball to Duncan Robinson, whose tying 3-point attempt was blocked by Anthony Black.\n\n\r\n              The Magic used a 15-5 run late in the third quarter to take an 89-84 lead into the fourth.\n\n\r\n              Orlando led 95-85 with 9:25 to play, helped by Detroit starting the fourth quarter 0 for 6 from the floor. The Pistons didn’t hit a shot in the fourth until Robinson’s 3-pointer with 7:23 left, but they came back to tie the game at 100-all.\n\n\r\n              Up next\r\n              Magic: Host Chicago on Monday.\n\n\r\n              Pistons: Visit Miami on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042708.610326
}