{
  "game_id": "0021801190",
  "espn_id": "401071863",
  "date": "Apr 05, 2019",
  "matchup": "POR @ DEN",
  "headline": "Nuggets clinch Northwest with 119-110 win over Trail Blazers",
  "body": "DENVER --  Michael Malone stopped when he saw Tim Connelly standing nearby and gave his boss a bear hug. Connelly returned the hug and congratulated his head coach.\n\n\"That was awesome,\" the Nuggets' president of basketball operations said.\n\nAfter four years of building the team, Malone and Connelly could finally celebrate a division title for the Nuggets.\n\nNikola Jokic scored 10 of his 22 points in the fourth quarter, Paul Millsap finished with 25 points, and Denver clinched the Northwest Division title with a 119-110 win over the Portland Trail Blazers on Friday night.\n\nJokic added 13 rebounds and nine assists to lead the Nuggets to their first division title in six years. Jamal Murray scored 23 points and Torrey Craig had 18 points and seven rebounds off the bench for Denver.\n\n\"That is a great achievement for us,\" Malone said of clinching the division. \"More important, we're not satisfied. We've got three more games to go and the playoffs.\"\n\nThe Nuggets are assured of at least the No. 3 seed in the Western Conference and can clinch the second seed with two more wins. They lead Houston by 1 1/2 games and have played one fewer game than the Rockets.\n\nDenver clinched its first Northwest Division title since 2012-13, when it won 40 of its final 50 games to finish 57-25. The Nuggets were upset by Golden State in the first round and parted ways with coach George Karl.\n\nDenver missed out on the playoffs by a game the last two seasons and now have a chance to secure the No. 2 seed for the first time since 2008-09. The Nuggets would need to win their last three games and have Golden State lose its final three to be the No. 1 seed.\n\nThe players and coaches weren't worried about catching the Warriors. They were enjoying the win and the climb from playoff purgatory to a budding title contender.\n\n\"We know what we're capable of,\" Murray said. \"We have a lot of learning to do, but we're on a great path. It's the first time in the playoffs, but we've got a lot more of these coming.\"\n\nThe Trail Blazers lost to Denver for the third time after faltering in the fourth quarter. Portland scored 37 points in the third, but managed just 23 in the fourth.\n\nEnes Kanter had 24 points and Rodney Hood 17 for the Trail Blazers. Damian Lillard scored 12 of his 14 points after halftime.\n\n\"The first three quarters, we played pretty good. The last quarter, they got it going a little bit,\" Kanter said. \"We just need to learn to finish that fourth quarter.\n\n\"I believe in this team. I think this team is a championship team. ... I think this team has enough talent to beat any team on any floor. We just need to stay together and go from here.\"\n\nPortland led by three entering the fourth quarter, but Jokic set the tone in the fourth with seven quick points and fed Craig for a layup during an 18-6 run that gave Denver the lead for good. The Trail Blazers got within three on Kanter's short jumper, but Murray hit a runner and Craig scored off of an offensive rebound to make it 114-107 with 1:12 left.\n\n\"It was time for our best player to carry us,\" Malone said. \"Nikola is a big-game player and when we needed him most he came through.\"\n\nTIP-INS\n\nTrail Blazers: G Seth Curry was ruled out before the game with left leg soreness. ... Portland is 8-2 without CJ McCollum and 4-2 without Jusuf Nurkic. ... Jake Layman's three 3-pointers were two short of his career best. ... Lillard's first points came on a layup with 0.8 seconds left in the first half.\n\nNuggets: The 33 home wins are the most since 2012-13 when they set a franchise record with 38. ... Jokic now has 55 double-doubles this season. He has 12 triple-doubles, second to Russell Westbrook with 31.\n\nNOT SO FAST\n\nCraig's teammates were quick to praise him after his performance, but when Murray was asked how tough Craig was to play against in practice, he couldn't resist getting a jab in.\n\n\"He don't guard me,\" Murray said. \"He can't guard me.\"\n\nHEAVEN HELP US\n\nDenver was 2 of 10 from long range in the first half and finished the game hitting 25.9 percent from 3-point range.\n\n\"We just can't make shots right now,\" Jokic said. \"Twenty percent. We need help, maybe God. At least 30 percent.\"\n\nUP NEXT\n\nThe teams meet again in Portland on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995149.716514
}