{
  "game_id": "0022200989",
  "espn_id": "401469144",
  "date": "Mar 08, 2023",
  "matchup": "CHI @ DEN",
  "headline": "Vucevic, LaVine lead Bulls to 117-96 win over Nuggets",
  "body": "DENVER -- — Nikola Vucevic had 25 points and 15 rebounds, Zach LaVine scored 29 points on 12-of-18 shooting and the Chicago Bulls gave their playoff hopes an unexpected boost with a 117-96 victory against the Western Conference-leading Denver Nuggets on Wednesday night.\n\n\r\n              It was Vucevic’s 40th double-double of the season, the third-most in the NBA. LaVine is averaging 34.8 points in Chicago's last four games.\n\n\r\n              With the win, the Bulls moved within a game of the Washington Wizards for the final playoff spot in the Eastern Conference with 16 games remaining in the regular season. The victory was just the fourth in the past 13 games for Chicago.\n\n\r\n              “We’ve got a stretch of games that we need to win to get to where we want,” Bulls forward Patrick Williams said. “I think it was good to kind of show ourselves that, but also show other teams that we’re here.”\n\n\r\n              Nikola Jokic led Denver with 18 points, 12 rebounds and eight assists, and Aaron Gordon added 17 points and nine rebounds. Jokic made only seven of his 16 shots, snapping a 51-game streak in which he shot at least 50% from the field.\n\n\r\n              “You just try to make it tough for them,” LaVine said. “Obviously, Jokic is a two-time MVP. If we’re letting him shoot pull-up 3s, he can make them. But if he beats us that way, you tip your cap to him because it takes away from everything he does so great.”\n\n\r\n              Entering the night, Denver was an NBA-best 30-4 at home, which included wins in 24 of its last 25 games. The Nuggets, who lead the NBA in field goal and 3-point percentage, made only 42% of their shots. The 96 points were their second-fewest in a game this season.\n\n\r\n              “One game doesn’t mean we’re a bad team, but I think we have weaknesses like every team has weaknesses,” Jokic said.\n\n\r\n              Trailing by one at halftime, 52-51, the Bulls went on a 19-4 run in the third quarter to take a 79-66 lead, capped by Williams' 3-pointer with 3:22 remaining in the period. Coming off the bench, Williams finished with 18 points and made eight of his nine shots.\n\n\r\n              Chicago's advantage grew to as many as 24 points in the fourth quarter.\n\n\r\n              “We were moving the ball and making quick, decisive decisions and the ball is getting from one action to the next,” Bulls coach Billy Donovan said. “I think that’s when we’re at our best. It kind of connects us and I think it connects us defensively, as well. The thing that was encouraging tonight was it was sustained.”\n\n\r\n              TIP-INS\n\n\r\n              Bulls: G DeMar DeRozan had 17 points and eight assists. ... The win was Chicago’s second in a row at Denver, the first time it has done so since the 1996-97 and 1997-98 seasons.\n\n\r\n              Nuggets: G Jamal Murray made the 804th 3-pointer of his Nuggets career, tying Will Barton for the franchise record. ... F Vlatko Cancar missed his third consecutive game with a sprained right wrist. Cancar is averaging 5.8 points and 2.4 rebounds off the bench for Denver this season. ... Nuggets coach Michael Malone remains one win shy of his 400th.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Houston on Saturday.\n\n\r\n              Nuggets: At San Antonio on Friday.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994471.608075
}