{
  "game_id": "0021900839",
  "espn_id": "401161481",
  "date": "Feb 22, 2020",
  "matchup": "PHX @ CHI",
  "headline": "DeAndre Ayton, Devin Booker dominate, Suns top Bulls 112-104",
  "body": "CHICAGO --  Disappointed he didn't make a bigger impact the previous night against the defending champions, DeAndre Ayton sure made his presence felt against the Bulls.\n\nAyton dominated with 28 points and 19 rebounds, Devin Booker had 29 points and the Phoenix Suns beat the Chicago Bulls 112-104 on Saturday night.\n\nPhoenix outscored Chicago by 13 in the third quarter to wipe out a 10-point halftime deficit and ended the game on a 17-4 run to come away with the win after losing seven of nine. The Bulls dropped their eighth in a row.\n\nAyton wasn't thrilled with his performance in a 118-101 loss at Toronto on Friday. He had 17 points and 10 rebounds in that one after missing the final two games before the All-Star break because of a sore left ankle.\n\nAgainst the Bulls, he simply took over -- particularly down the stretch.\n\nAyton had 12 points and eight rebounds in the fourth quarter and just missed season highs in scoring (31) and rebounding (21).\n\n\"It's one thing when you hear it from coaches -- Am I doing the right thing,\" he said. \"But it's another thing hearing it from your teammates, (who) you see everyday and laugh and joke around with and goof around. You know when to get serious. ... I just woke up. Mental toughness, to be honest.\"\n\nThe Suns would like to see more of that.\n\n\"That's a monster night,\" coach Monty Williams said. \"I told him we need him to play with that disposition every night.\"\n\nBooker made 5 of 10 from beyond the arc in another solid showing in Chicago. The guard placed second to Sacramento's Buddy Hield in the 3-point contest and made his first All-Star appearance last weekend in Chicago.\n\nRicky Rubio added 18 points and 11 assists, and Kelly Oubre Jr. had 14 points to help the Suns snap a five-game road losing streak.\n\nBulls rookie Coby White set a career high with 33 points and matched one by making seven 3-pointers. Zach LaVine scored 20 points. But he also committed seven of Chicago's season-worst 26 turnovers.\n\n\"It felt great,\" White said. \"I was having fun. It would have a lot more fun if we could have come out with the win.\"\n\nFINAL RUN\n\nChicago led 96-95 when Phoenix's Cameron Johnson made a 3 with 6:30 left to give the Suns a 98-86 lead, sparking the game-ending run.\n\nMikal Bridges and Booker each made a pair of free throws to push the lead to 11 in the closing minute.\n\nLaVine dunked, before Rubio hit 1 of 2 foul shots with 30 seconds left to make it 112-102. Chicago's Ryan Arcidiacano then made two free throws for a final score that left fans showering the Bulls with boos.\n\nCALLING TIME\n\nBulls coach Jim Boylen has annoyed opponents by calling timeouts late in games that were out of hand. He did it again with 30 seconds left, and LaVine appeared agitated when he was caught on camera.\n\n\"He hasn't said a word to me about it agitating him,\" Boylen said. \"I don't know if you're reading his mind on that or are you just making an assumption that's what he was upset about?\"\n\nLaVine insisted he and Boylen are \"good.\" He said he's frustrated about losing. As for the late timeouts?\n\n\"That's what he do,\" LaVine said. \"I don't know what to tell you? I'm not the coach. He told me he likes working on things that we do in practice and things like that. He's the coach; he can call time out if he wants to.\"\n\nTIP-INS\n\nSuns: The Suns were basically at full strength, though C Frank Kaminsky (right knee stress fracture) missed his 24th game in a row. Kaminsky, who's from the Chicago area, is Bulls assistant coach Karen Umlauf's nephew.\n\nBulls: The Bulls made 14 of 38 3-pointers, after missing their first 17 in a 7-of-31 performance against Charlotte two nights earlier. ... C Luke Kornet (ankle) was unavailable.\n\nUP NEXT\n\nSuns: At Utah on Monday night.\n\nBulls: Host Washington on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996546.123616
}