{
  "game_id": "0022000474",
  "espn_id": "401267634",
  "date": "Feb 22, 2021",
  "matchup": "CHI @ HOU",
  "headline": "Coby White scores 24, Bulls hand Rockets 8th straight loss",
  "body": "HOUSTON -- — Coby White scored 24 points, and the Chicago Bulls used a big third quarter to pull away for a 120-100 win over the short-handed Houston Rockets on Monday night.\n\n\r\n                    Zach LaVine scored 14 of Chicago's 46 third-quarter points, finishing with 21, as the Bulls outscored the Rockets by 20 points in the quarter to break open a tight game. \n\n\r\n                    “He’s an efficient scorer because he scores not taking a lot of shots,” coach Billy Donovan said of LaVine, who made 4 of 6 3s on Tuesday. “When he lets it go from behind the line you feel like it’s going in.”\n\n\r\n                    Chicago had runs of 15-4 and 12-0 in the third period. During that second burst, Houston missed four shots, two of which were air balls, and had a turnover.\n\n\r\n                    Houston coach Stephen Silas said LaVine's breakout quarter was pivotal.\n\n\r\n                    “I think him getting hot caused some adversity that we didn’t handle correctly,” Silas said. “We have at times succumbed to that adversity and let them do what they want to do and that was the case tonight.”\n\n\r\n                    David Nwaba scored 22 points off the bench to lead Houston, which has lost eight straight. The Rockets had their previous two games postponed because of a winter storm and subsequent utility outages in the Houston area.\n\n\r\n                    “It got away from us as far as our defensive principles, our chemistry, our togetherness,” Silas said. “All of the things that you need to compete in an NBA game we didn’t have tonight.”\n\n\r\n                    The Rockets have been without center Christian Wood since Feb. 5, and DeMarcus Cousins, who has been filling in for him, sat out Monday with a sore right heel. Victor Oladipo remained sidelined with a strained right foot.\n\n\r\n                    Wendell Carter Jr. added 18 points with 13 rebounds for the Bulls, who have won four of their last five.\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Otto Porter Jr. missed his 11th straight game with back spasms. ... Thaddeus Young scored 17 points off the bench.\n\n\r\n                    Rockets: Oladipo missed his fourth straight game. ... Jae'Sean Tate had 12 points. \n\n\r\n                    STUMPING FOR ZACH\n\n\r\n                    Donovan has talked often about LaVine's improved play this season, and he hopes LaVine's performance will put him into the All-Star game for the first time when reserves are announced on Tuesday night.\n\n\r\n                    “He’s learning, he’s evolving, he’s growing, and he continues to get better,” Donovan said. “My feeling is he’s played at an All-Star level and I don’t anybody would dispute that. He deserves to be in the game.\"\n\n\r\n                    LaVine ranks sixth in the league in scoring by averaging a career-best 28.6 points per game and his 5.1 assists are also a career high.\n\n\r\n                    WHITE'S SPILL\n\n\r\n                    White went to the locker room for a few minutes early in the third quarter after falling down chasing a loose ball and crashing into the padded backstop on the goal. \n\n\r\n                    “My nose was busted, other than that I was cool,” he said. “They just had to stop the bleeding.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Play their next two games at home, starting Wednesday night against Minnesota.\n\n\r\n                    Rockets: At Cleveland on Wednesday night to begin a two-game trip.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997594.377995
}