{
  "game_id": "0022301075",
  "espn_id": "401585703",
  "date": "Mar 30, 2024",
  "matchup": "ORL vs. MEM",
  "headline": "Orlando Magic snap 3-game skid with 118-88 rout of Memphis Grizzlies",
  "body": "ORLANDO, Fla. -- — Wendell Carter Jr. had 15 points and 13 rebounds, Jalen Suggs and Cole Anthony added 15 points each and the Orlando Magic broke a three-game losing streak with a 118-88 rout of the Memphis Grizzlies on Saturday night.\n\n\r\n              A day after committing two late turnovers and blaming himself for a loss to the Los Angeles Clippers, Paolo Banchero sat out the fourth quarter and finished with 13 points, nine rebounds and seven assists. \n\n\r\n              Nine Magic players hit at least one 3-pointer and they shot 22 for 44 from behind the arc.\n\n\r\n              “It was an opportunity to get our swagger back,” said Carter. “Our swagger was kind of off.”\n\n\r\n              Magic coach Jamahl Mosley said the losing streak didn't bother him much.\n\n\r\n              “Just because it doesn’t come out on the winning end doesn’t mean you’re not playing good basketball. So you stick to the process. That’s what these guys did tonight,” Mosley said. “Obviously we came out with the win, but the best part is that we played the right way, which we were doing in the other games as well.”\n\n\r\n              Jordan Goodwin led the Grizzlies with 16 points and 11 rebounds. Brandon Clarke added 13 points in 20 minutes in his second game back from an Achilles injury.\n\n\r\n              The win moved the Magic a game and a half behind New York in the race for the fourth Eastern Conference playoff spot. With eight games left in the regular season, the Magic are in fifth place, 1 1/2 up on Indiana and 2 1/2 up on Miami. Their 43 wins are the most for the franchise since 2010-11.\n\n\r\n              “The loss (to the Clippers) kind of gave us energy,” Carter said. “We’ve kind of struggled with back to backs throughout this year, but we’re coming down to the nitty gritty and every game is very important to us. We all know that.”\n\n\r\n              Joe Ingles hit three 3-pointers during a 15-0 Magic run in the first quarter, and Anthony and Markelle Fultz hit 3s on a second-quarter burst that gave Orlando a 43-15 lead. Memphis never again got the margin under 19.\n\n\r\n              “They dictated a lot with their defense,” said Memphis coach Taylor Jenkins. \"(We) couldn’t get in the paint, couldn’t knock down an open shot. That set the tone. The Magic had an answer for everything. They had so many guys step up and play well.”\n\n\r\n              The Grizzlies, who came into the game last in the NBA in scoring (101.6 points per game), field-goal percentage (43.6) and 3-point percentage (34.7), shot 26.2% in the first half and 36% for the game.\n\n\r\n              “They jumped on us pretty quickly and got control of the game early,” said Luke Kennard, who had nine points and five assists. “We couldn't really fight back right away.”\n\n\r\n              Desmond Bane (sore back) and Santi Aldama (illness) were added to the long list of players sidelined by injuries for the Grizzlies, who have lost seven of eight.\n\n\r\n              Jonathan Isaac and Gary Harris did not play for Orlando due to “injury maintenance.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Visit Detroit on Monday.\n\n\r\n              Magic: Host Portland on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995681.285137
}