{
  "game_id": "0022300851",
  "espn_id": "401585479",
  "date": "Feb 29, 2024",
  "matchup": "ATL @ BKN",
  "headline": "Cam Johnson scores season-high 29 points to help Nets rout Hawks 124-97",
  "body": "NEW YORK -- — Cam Johnson scored a season high 29 points, hitting a season-high seven 3-pointers in 11 attempts, to help the Brooklyn Nets beat the Atlanta Hawks 124-97 on Thursday night to open a two-game series.\n\n\r\n              Fighting for the last play-in spot in the Eastern Conference, the teams will meet again at Barclays Center on Saturday.\n\n\r\n              “(They’re) right in front of us,\" Dennis Schroder said about Atlanta, which leads the Nets by three games. “We understood before the game we kind of had (to have) a hit- first mentality and we did a great job of it.”\n\n\r\n              Brooklyn improved to 23-36, winning in interim coach Kevin Ollie’s first home game since replacing the fired Jacques Vaughn on Feb. 20. \n\n\r\n              “Our energy (and) our effort, those are things we can control, ” Ollie said. “Our recipe that we need to keep cooking is no turnovers and sharing the cake. I keep saying that over and over again. But when we have nine turnovers and 30 assists, that's our recipe for winning.”\n\n\r\n              Schroder had 23 points, eight rebounds and seven assists for balanced Brooklyn. Mikal Bridges scored 15 points, Day’Ron Sharpe had 12 points, Lonnie Walker IV 11 and Dennis Smith Jr. 10.\n\n\r\n               “We have to put that urgency from here on out on the rest of the season,” Johnson said. “It’s unfortunate, but we dug ourselves a hole, and it’s not what we think our group is capable of. So we have to find a way out of that and maybe do a little bit extra. Tonight is just the start, it doesn’t mean anything if we don’t follow it up with, you know, next game, the following game, keeping that energy high.”\n\n\r\n              Dejounte Murray led Atlanta with 28 points. The Hawks — with star guard Trae Young sidelined by a torn finger ligament — had won two in a row. They dropped to 26-33.\n\n\r\n              “We weren't focused on the right things from a gameplay perspective at the beginning of the game,” Atlanta coach Quin Snyder said. “Consistently the whole night we weren't as precise and forceful with how we played offense.”\n\n\r\n              Brooklyn led 34-16 after the first quarter, with Johnson scoring 12 points on 4-of-6 shooting and Bridges adding 10 points. The Nets led 56-50 at the half, then outscored the Hawks 38-25 in the third quarter.\n\n\r\n              “It feels good,” said Johnson, when asked about starting his second straight game. “What you're looking for (as a player) is rhythm. Rhythm and feel of the game. It slows down for you anytime you're in your comfortable spaces and comfortable roles. ...You're able to process quicker, more efficiently and sometimes good results follow that. So just playing off the guys and just playing with a little bit more joy.”\n\n\r\n              Brooklyn opened the fourth quarter with Smith's layup and Bridges’ 3 on its first two possessions to stretch the lead to 99-75.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996278.790598
}