{
  "game_id": "0021300739",
  "espn_id": "400489612",
  "date": "Feb 07, 2014",
  "matchup": "POR @ IND",
  "headline": "George Hill scores career-high 37, lifts Pacers past Blazers in OT",
  "body": "INDIANAPOLIS -- George Hill knew there was something different about the way he felt when he showed up to the arena Friday. He didn't know it was going to turn out to be a career night.\n\"When I first walked in here today I was yelling at everybody, 'I don't know what it is, but I have a lot of energy,'\" Hill said. \"They said, 'Hopefully it carries to the court.'\"\nIt did in a big way.\n\nHill had a career-high 37 points, nine rebounds and eight assists, leading the Indiana Pacers to a 118-113 overtime victory over the Portland Trail Blazers.\nHill forced overtime with a 3-pointer to tie the game at 103 with 8 seconds left in regulation. Paul George, who finished with 17 points, missed a 3-pointer, Granger grabbed a rebound and found Hill for the tying basket.\n\"Just trying to move to an open spot to get a shot up.\" Hill said. \"I knew we needed a 3. The best way to do it is off an offensive rebound.\"\nDavid West scored a season-high 30 points and had 10 rebounds, and George added 17 points for the Pacers (39-10), who have won 5 of 6 games.\nDamian Lillard had 38 points and 11 assists, and LaMarcus Aldridge had 22 points for the Trail Blazers (35-15).\nGeorge converted a steal into the go-ahead dunk with 3:48 left in overtime, putting the Pacers ahead 107-105. West dunked with 1:37 left to make it 111-107.\nWest scored 10 points in the fourth quarter to keep Indiana in the game. He made a jumper to tie it at 91 with 3:54 left in regulation and later tied the game at 97.\nGeorge made a 3 with 1:30 remaining to put the Pacers ahead 100-99, but then Wesley Matthews scored and Nicolas Batum made a pair of free throws to put the Trail Blazers ahead 103-100 before Hill tied the game.\n\"I thought we played well against a championship-level team who found a way to get it done,\" Lillard said. \"That's what great teams do, find a way to get it done.\"\nIndiana's 118 points was a season high, but it's what was needed to beat the league's best offensive team. More importantly, though, the Pacers just want to prove they can beat the league's best teams.\n\"Against the top teams, you have to get wins throughout the year,\" West said. \"This is a good win for us and we talk about finishing strong before the All-Star break. I thought we prepared well for this and came in and had a good game.\"\nIndiana's newest addition was inactive. Andrew Bynum joined the team on Friday, a week after signing with the Pacers and over a month after being suspended indefinitely by the Cleveland Cavaliers.\nHe played in 24 games for the Cavaliers this season, but hasn't played a game since Dec. 26. Pacers coach Frank Vogel doesn't expect the 7-foot center to play for several more weeks and said he wants to make sure Bynum is comfortable before throwing him into Indiana's rotations.\nBut the Pacers could have used his rebounding.\nBy halftime, the Trail Blazers had a 25-15 edge and held Indiana to no offensive boards.\nThe Pacers went on a 10-2 run in the second quarter. C.J. Watson made a free throw and Granger converted a 3-point play before Dorell Wright made two free throws, Watson made pair, Granger scored on a jumper and Rasual Butler hit a 3-pointer to make it 30-27 with 8:10 left in the first half.\nLillard scored to give the Trail Blazers 44-35 lead with 3:29 left in the second quarter. Then the Pacers went on 8-2 run capped off with a shot by Hibbert to make it 46-43.\nAldridge answered with a basket and West scored for Indiana before Lillard scored a wide-open layup with 2 seconds left to give the Trail Blazers a five point halftime lead.\nPacers forward Lance Stephenson was out with a sore lower back. He was injured during a fall in Indiana's 89-85 win over Atlanta on Tuesday.\nVogel said Stephenson bounces back from injuries quickly and doesn't expect him to miss many games.\nGame notes\nStephenson has started every game he's played in this year and has missed just one game. .. Granger, who finished with seven points and six rebounds, started for Stephenson in that game in January and started Friday night's game, too. It's the only two starts for Granger in nearly two years. ... The Trail Blazers were without guard Mo Williams, who missed the game because of personal reasons. ... Portland outrebounded the Pacers 47-46. It was the first time the Pacers were outrebounded in seven games.",
  "source": "espn_api",
  "crawled_at": 1764992967.181813
}