{
  "game_id": "0022300832",
  "espn_id": "401585460",
  "date": "Feb 27, 2024",
  "matchup": "CLE vs. DAL",
  "headline": "Maxed out: Strus sinks 59-footer at the final horn, sending Cavaliers to 121-119 win over Mavericks",
  "body": "CLEVELAND -- — Max Strus caught the pass, and with barely any time to think never mind shoot, one thing crossed his mind.\n\n\r\n              “Get it up,” he said.\n\n\r\n              Down it went.\n\n\r\n              Strus drilled a 59-footer as time expired, his fifth 3-pointer in the final four minutes, to give the Cleveland Cavaliers a wild 121-119 win over the Dallas Mavericks on Tuesday night.\n\n\r\n              After the Mavericks took the lead on P.J. Washington's dunk with 2.9 seconds left, the Cavs, out of timeouts, inbounded the ball to Evan Mobley, who passed it back to Strus — whose barrage of four 3s in a span of 67 seconds down the stretch brought Cleveland back from a 10-point deficit.\n\n\r\n              Strus then took a dribble before launching his shot from well beyond mid-court. As it swished through the net, Strus was tackled to the floor by his celebrating teammates as the Rocket Mortgage FieldHouse crowd erupted.\n\n\r\n              Strus said he knew it was good from the moment it left his hand.\n\n\r\n              “The last five felt pretty good,” he said. “I felt a rhythm and it’s fun when you do that. Every time I shot it, I felt like it was going in, and it was. Same with the last one.”\n\n\r\n              Donovan Mitchell scored 31 points, Strus added 21 and Jarrett Allen 19 for the Cavs, who improved to 12-3 since Jan 26 following a win many of them will long remember.\n\n\r\n              “Man, just to see it go through, especially what he did for us in the fourth, it had to be him, too,” Mitchell said. “You dream of a shot like that. So for him to get that after what he did for us, the whole fourth quarter, man.\"\n\n\r\n              Strus said the play wasn't designed but just unfolded.\n\n\r\n              “Don (Mitchell) wasn’t in the game so somebody else had to do it,” he joked.\n\n\r\n              According to Basketball Reference, Strus' sensational shot is the second-longest game-winner in the 3-point era (1979-80). Devonte Graham made a 61-footer for New Orleans to beat Oklahoma City on Dec. 15, 2021.\n\n\r\n              Truth be told, Strus wasn't all that impressed by his heave. He made an even longer game-winning shot in college.\n\n\r\n              \"Yeah, at my Division II school I made a three-quarter court shot to win the game,” he said.\n\n\r\n              Luka Doncic had 45 points and 14 assists a day before turning 25 for the Mavericks. Kyrie Irving added 30 for Dallas, which lost for just the second time in 10 games.\n\n\r\n              “Incredible shot. That was just an incredible shot,” Doncic said. \"It was my fault, I should have pressed forward (on Strus). I thought we played a good game, but that was rough, obviously.”\n\n\r\n              Doncic added nine rebounds, finishing one shy of his 11th triple-double.\n\n\r\n              With Doncic making a 3-pointer, Dallas reeled off 10 straight points to take a 108-98 lead with 4:38 left.\n\n\r\n              The Mavericks were still up by double digits when Strus got hot, making four 3-pointers in just over a minute to pull the Cavs within 113-112.\n\n\r\n              “That two-minute span was intense for us,\" said Irving, who made the biggest shot in Cleveland history in Game 7 of the 2016 NBA Finals. \"This is the first time I’ve lost on a half-court shot. You don’t flush it out of your system, you feel it. This one has got to sting a little bit.”\n\n\r\n              The Cavs have been thrilled with what they've gotten from Strus, who signed with them in the offseason after a nice run with Miami. He gives Cleveland toughness, outside shooting and another leader — on and off the court.\n\n\r\n              “What he did tonight was absolutely ridiculous to come back in that fourth quarter for us to be down the way we were,” coach J.B. Bickerstaff said. \"But that’s who Max is. And it’s as simple sometimes as chasing down a loose ball or making an extra rotation. Max never quits and we were down and he had the same mentality.\n\n\r\n              “He wasn’t going to quit and he just kept making play after play after play on both ends.”\n\n\r\n              Doncic's appearance in Cleveland always brings out dozens of fans from the city's Slovenian community. Following his early pregame warmup, Doncic went into the stands to sign autographs and pose for photos.\n\n\r\n              After a sluggish start offensively, the Cavaliers made 7 of 9 3-pointers to begin the second quarter while opening a 56-41 lead.\n\n\r\n              But following a Dallas timeout, Doncic took over. The All-Star made three 3s in a span of 1:26, dropped two free throws and then hit another step-back 3 to score 14 points in the final 2:57 to pull the Mavs within 60-56 at halftime.\n\n\r\n              This was Irving's first visit since being traded to Dallas from Brooklyn, and he got a warmer-than-expected ovation in player introductions and again when the Cavs played a video tribute for him during a first-quarter timeout.\n\n\r\n              Irving waved to the crowd and formed the shape of heart with his hands to show thanks.\n\n\r\n              The mercurial guard has a complicated relationship with Cleveland fans. Some remain faithful and will never forget his contributions to the Cavs' title run in 2016 while others feel bitterness toward Irving after he demanded to be traded — his departure effectively ending any chance for more championships.\n\n\r\n              This return seemed to bring healing for Irving, who said he'll always be grateful to the city where he got his start.\n\n\r\n              '“Cleveland loved me through my mistakes and I love them for it,” he said.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: At Toronto on Wednesday.\n\n\r\n              Cavaliers: At Chicago on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996728.1134279
}