{
  "game_id": "0022000988",
  "espn_id": "401307791",
  "date": "May 04, 2021",
  "matchup": "SAC @ OKC",
  "headline": "Hield's 18 points, 11 rebounds help Kings top Thunder 103-99",
  "body": "OKLAHOMA CITY -- — Buddy Hield had 18 points and 11 rebounds to help the Sacramento Kings beat the Oklahoma City Thunder 103-99 on Tuesday night for their third straight win.\n\n\r\n                    It was the seventh double-double of Hield’s five-year career. He made just 5 of 16 shots, but he fell one rebound short of his career high.\n\n\r\n                    Terence Davis scored 18 points and Delon Wright had 13 points, 10 rebounds and eight assists for the Kings, who have won six of nine and still hope to qualify for the play-in tournament by reaching the No. 10 spot in the Western Conference standings. Sacramento began the night four games behind San Antonio for 10th place. The Kings have seven games remaining.\n\n\r\n                    “Good night,” coach Luke Walton said. “Good night for the Kings. Not always the prettiest of games, but we found a way to scrap out another win.\"\n\n\r\n                    Darius Bazley had 24 points and 11 rebounds for the Thunder, who have lost four straight and 21 of 23. Gabriel Deck scored 16 points and Moses Brown had 17 rebounds.\n\n\r\n                    The Kings led 56-46 at the half, then extended their advantage to 17 early in the third quarter. Sacramento led 81-69 heading into the fourth before Oklahoma City began chipping away.\n\n\r\n                    Bazley scored and was fouled with just over a minute to play, and his free throw cut Sacramento's lead to 100-99.\n\n\r\n                    “We couldn’t buy a bucket,” Walton said. “They were banking in 3s.”\n\n\r\n                    Wright's reverse layup with 18 seconds to play put the Kings up by three. Oklahoma City's Isaiah Roby had a 3-pointer rattle in and out, and the Kings rebounded. \n\n\r\n                    Sacramento's Richaun Holmes was fouled. He missed the first and made the second free throw with 4.3 seconds remaining to put the game out of reach. \n\n\r\n                    Wright had two blocks and two steals in the fourth quarter.\n\n\r\n                    “He was all over the court tonight,” Walton said. “Without him, we most likely don't win that game.\"\n\n\r\n                    It was another close loss for the Thunder. Oklahoma City dropped a 123-120 decision to Phoenix on Sunday.\n\n\r\n                    “I appreciate the effort again,” Oklahoma City coach Mark Daigneault said. “I thought we really fought and gave ourselves a chance down the stretch.”\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Guard De’Aaron Fox, the team’s leading scorer with 25.2 points per game, missed his sixth straight game because of health and safety protocols. ... Forward Harrison Barnes missed his fourth straight game with hip tightness. ... Guard Justin James scored 10 of his 13 points in the fourth quarter.\n\n\r\n                    Thunder: Forward Aleksej Pokusevski sat out with a bruised knee. ... Oklahoma City has started allowing staff members and their families to attend games and will do so for the final two home games next week. The Thunder have not allowed regular fans this season, but they have allowed a small number of player guests. ... Shot 24% in the first quarter.\n\n\r\n                    HALIBURTON UPDATE\n\n\r\n                    The Kings announced Tuesday that they expect rookie Tyrese Haliburton to miss the rest of the regular season with a hyperextended left knee.\n\n\r\n                    The team said MRI results revealed no ligament damage. He will not require surgery, and Walton said he could return if the Kings make the play-in tournament.\n\n\r\n                    Haliburton was injured during the third quarter of Sunday’s game at Dallas. He averages 13.0 points and 5.3 assists per game. \n\n\r\n                    Walton said the MRI results were better than expected.\n\n\r\n                    “I think a lot of us were scared when it happened,” Walton said. “It didn’t look great.”\n\n\r\n                    QUOTABLE\n\n\r\n                    Walton on Hield's performance: “I think Buddy did a really nice job of hitting the big man rolling throughout the whole game. Teams are going to try to take his scoring away, especially with our other guys out, so he did a nice job of getting off that ball. We're going to have to create some offense using different people and different sets.” \n\n\r\n                    STAT LINES\n\n\r\n                    Oklahoma City's Lu Dort has combined to make just 7 of 35 shots, including 4 of 17 3-pointers, the past two games. \n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Visit the Indiana Pacers on Wednesday.\n\n\r\n                    Thunder: Visit the Golden State Warriors on Thursday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997161.150979
}