{
  "game_id": "0022201126",
  "espn_id": "401469281",
  "date": "Mar 27, 2023",
  "matchup": "DEN vs. PHI",
  "headline": "Embiid sits out, Jokic leads Nuggets past 76ers 116-111",
  "body": "DENVER -- — Nikola Jokic posted his 29th triple-double of the season Monday night and the Denver Nuggets beat the shorthanded Philadelphia 76ers 116-111 in a game Joel Embiid sat out with a sore right calf.\n\n\r\n              That scuttled the highly anticipated showdown between MVP frontrunners that many felt could have decided whether Embiid, the runner-up the last two years, denies Jokic a third consecutive award.\n\n\r\n              With Embiid in the locker room, Jokic scored 25 points, pulled down 17 rebounds and dished out 12 assists.\n\n\r\n              While insisting Embiid's absence had no effect on his own approach to the game, Jokic praised his counterpart as a dominant force on both ends of the court.\n\n\r\n              “The guy's a beast,\" Jokic said. “He can affect the game in so many ways on the floor.”\n\n\r\n              The MVP clash wasn't the race that was on Doc Rivers' mind.\n\n\r\n              “It was not a hard decision for us,\" the 76ers coach said of holding out Embiid, who complained of discomfort at the team's morning shootaround after playing both ends of a back-to-back on the road over the weekend. \n\n\r\n              Rivers said he didn't know if Embiid's injury would linger, but noted that calf injuries are notoriously slow to heal and can lead to more serious leg injuries.\n\n\r\n              \"Everybody wants to see these two guys play against each other,” Rivers said, but “we’re just going to take it slow and be smart. We want to get him and the whole team healthy for the playoffs.”\n\n\r\n              Embiid, the NBA scoring leader, first experienced tightness in his right calf against Chicago last week and Rivers held him out of the second half of that game. Embiid returned to the lineup and scored 46 points at Golden State and 28 in Phoenix, seemingly putting the issue behind him.\n\n\r\n              The Sixers, who also were without James Harden (Achilles) for a fourth consecutive game, matched their season high with their third consecutive loss. \n\n\r\n              Tyrese Maxey scored 23 of his 29 points in the first half, helping keep the 76ers close. They trailed 61-57 at halftime and fell behind by 22 before a late push brought them to 114-111 on Montrezl Harrell's dunk with 29 seconds remaining.\n\n\r\n              Jeff Green sank two free throws with 13.3 seconds left and Harrell misfired on an open 3-pointer in the closing seconds.\n\n\r\n              “We can't have that\" kind of letdown “especially against a team with their two superstars out,” Nuggets sixth man Bruce Brown said. ”This should have been a 20-point win. We just took our foot off the gas.”\n\n\r\n              “As long as we win,” Jokic said, “that's the most important thing.”\n\n\r\n              Maxey said the 76ers are looking at the bright side: they're burnishing their bench for the playoffs.\n\n\r\n              “The first half we were in the game big time and in the end, but one thing I think we can take from this is how deep we are,” Maxey said. “Guys like (Danuel) House, who hasn’t played in a couple of games because he was hurt, comes in and contributes. The list goes on and on.”\n\n\r\n              Embiid bolstered his MVP credentials in January when he scored 47 points and pulled down 18 rebounds in leading Philadelphia past the Nuggets 126-119.\n\n\r\n              ESPN analyist Kendrick Perkins, a former NBA center who sparked an MVP debate earlier this month by calling Jokic a stat padder, said Embiid owed it to Jokic and basketball fans alike to play in the rematch Monday night.\n\n\r\n              “Joel Embiid is ducking that smoke today and you all know how I feel about Joel Embiid,” Perkins said. \"We know how much it means to him to win this award. And here it is. You gave Jokic a spanking when they were down there in Philly. You have to give him an opportunity to get his lick back. \n\n\r\n              “You cannot sit out this game,” Perkins added. \"I have a vote (for the MVP award) and I'm going to remember this moment.”\n\n\r\n              TIP-INS\n\n\r\n              76ers: Philadelphia has lost four of five for the first time all season. ... Embiid has missed 14 games this season. He hasn't played in Denver since November 2019. \n\n\r\n              Nuggets: Jokic has five triple-doubles this month and 111 for his career, including the playoffs.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host the Dallas Mavericks on Wednesday night.\n\n\r\n              Nuggets: Host the New Orleans Pelicans on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994678.565452
}