{
  "game_id": "401810001",
  "espn_id": "401810001",
  "date": "Nov 01, 2025",
  "matchup": "BOS vs HOU",
  "headline": "Durant scores 26, Rockets rout Celtics 128-101",
  "body": "BOSTON -- — Kevin Durant scored 26 points in three quarters before resting the fourth, Amen Thompson added 17 points and nine rebounds, and the Houston Rockets beat the Boston Celtics 128-101 on Saturday night. \n\n\r\n              Alperen Sengun had 16 points, 10 rebounds and nine assists for the Rockets. Jabari Smith Jr. and Josh Okogie each scored 12 as Houston won its third straight following an 0-2 start to the season and ended Boston’s three-game win streak. \n\n\r\n              Baylor Scheierman led Boston with 17 points. Payton Pritchard had 14 points, Josh Minott finished with 10 points and six rebounds and Jaylen Brown had 12 points for Boston, sitting out the fourth one night after leading the Celtics with 32 points in a 109-108 win at Philadelphia on Friday night.\n\n\r\n              The Celtics were out of synch throughout the night and could not keep up with Durant and the well-rested Rockets, who shot 57 percent in the first half and led 66-48 at halftime. The Rockets outrebounded the Celtics 53-36.\n\n\r\n              In addition to making 8 of 11 from the floor, Durant was 8 for 9 from the foul line, hitting three straight on a string of technical fouls early in the third quarter as Boston’s frustrations boiled over.\n\n\r\n              Coach Joe Mazzula received the first technical with 9:07 left in the period, followed by a 3-second violation and then a flopping call on Boston’s Chris Boucher as Thompson put back a rebound. Durant added a free throw on the flopping technical and Houston led 74-50 with 8:41 left in the third. \n\n\r\n              The Rockets led 97-72 by the end of the third quarter and Boston fans started filing out of the arena as reserves for both teams finished out the final quarter. \n\n\r\n              Durant scored 12 in the first period and had 20 points by halftime. \n\n\r\n              Up next\r\n              Rockets: Host Dallas on Monday night. \n\n\r\n              Celtics: Host Utah on Monday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042542.2140858
}