{
  "game_id": "0022000273",
  "espn_id": "401267433",
  "date": "Jan 27, 2021",
  "matchup": "SAC @ ORL",
  "headline": "Rested Kings get 29 points from Hield, defeat Magic 121-107",
  "body": "ORLANDO, Fla. -- — Sacramento Kings guard Buddy Hield mixed up his game beautifully on Wednesday night, calmly hitting spot-up 3-pointers, sinking midrange jumpers and dishing the ball when the Orlando Magic blitzed him with double teams.\n\n\r\n                    Kings’ coach Luke Walton insisted that it was just the kind performance from Hield that Sacramento needs to see more of going forward. \n\n\r\n                    Hield scored a season-best 29 points by making 10 of 17 shots and 7 of 12 3-pointers as the well-rested Kings beat the Magic 121-107.\n\n\r\n                    “I thought it was his most consistent game this year, for sure, and maybe since I’ve been (with the Kings),” Walton said. “Both sides of the ball, he was making good decisions, knocking down shots when we needed shots made and getting off the ball when they were blitzing him. We need that because it’s a tough league to win in. To get that type of play from him will give us a much better chance.”\n\n\r\n                    Sacramento was playing for the first time since Friday after two games were canceled because of COVID-19 protocols with the Memphis Grizzlies. The Kings proved themselves to be rested and ready in taking apart the Magic for their second road victory of the season. \n\n\r\n                    The Kings led by 11 in the first period, by 17 before halftime and by as much as 22 in the second half of the wire-to-wire victory. The Magic never got closer than 10 in the second half in dropping to 4-5 at home this season.\n\n\r\n                    “We didn’t have great energy, I’d say, at either end of the floor,” Magic coach Steve Clifford said. “We have a good enough team to have a good season, but we need everybody every night. There’s not a lot of room for error and we can’t have five guys play well and four guys not or six and three. That’s not easy, but that’s the way it is.”\n\n\r\n                    Harrison Barnes scored 21 points and made 3 3s for Sacramento, which shot 48.9% from the floor and made 14 of 33 3-pointers. Sacramento center Richaun Holmes had 20 points and 12 rebounds for his third double-double of the season, while Marvin Bagley III recorded his sixth double-double with 16 points and 12 rebounds.\n\n\r\n                    De’Aaron Fox added 16 points, 10 assists and eight rebounds.\n\n\r\n                    Hield’s dynamic shooting performance was the third time this season that he’s made at least six 3-pointers in a game. His 29 points points topped the 26 he had on Jan. 13 in Portland — a game where he made eight 3s. He was 7 for 12 from behind the arc on Wednesday.\n\n\r\n                    “Buddy is an important part of our team and when he gets it going like he had it tonight, we’re very, very difficult to guard,” Holmes said. “He does a lot for our team. To see him get rolling like that and come away with the win, it was great.”\n\n\r\n                    Magic center Nikola Vucevic made 11 of 18 shots and scored 26 points — his 14th game of the season with at least 20 points. Evan Fournier added 25 points, while Terrence Ross chipped in 16 points off the bench.\n\n\r\n                    Aaron Gordon struggled through the night with three points in 26 minutes. He missed eight of his nine field goal attempts. Rookie guard Cole Anthony, who scored a career-best 21 points in Monday’s defeat of Charlotte, made just 2 of 9 shots and scored seven points on Wednesday.\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Sacramento’s streak of consecutive quarters without allowing 30 points ended at seven when the Magic reached 30 in Wednesday’s fourth quarter. … Walton said the team’s first trip East brought up some new challenges for his team. Walton: “The road trips we’re pretty used to, but it’s the protocols that have taken some getting used to. The players had to have their first (COVID-19) testing done by 8:30 AM. So, as you’re trying to adjust to time zones, you still have to get up and do that so that the players can get the tests back before the game. Things like that are what we’re getting used to.”\n\n\r\n                    Magic: Orlando came into Wednesday as the NBA’s hottest shooting team from 3-point range over the previous three games — 17.7 makes a night on 47% shooting — but it made only 10 of 26 attempts on Wednesday.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Vs. Toronto in Tampa on Friday.\n\n\r\n                    Magic: On Friday, they host the Los Angeles Clippers, a team that they have lost to 13 straight times dating back to November of 2013.",
  "source": "espn_api",
  "crawled_at": 1764997188.641983
}