{
  "game_id": "0022300489",
  "espn_id": "401585117",
  "date": "Jan 05, 2024",
  "matchup": "MIA @ PHX",
  "headline": "Grayson Allen ties Phoenix record with career-high 9 3-pointers, Suns beat Heat 113-97",
  "body": "PHOENIX -- — Grayson Allen is usually an afterthought for the opposing team, which makes some sense considering there are other Phoenix Suns to worry about like All-Star shooters Devin Booker and Bradley Beal.\n\n\r\n              The Miami Heat might pay a little more attention to him next time.\n\n\r\n              Allen made a career-high nine 3-pointers to tie the Phoenix record and scored 31 points, Beal added 25 points and the Suns beat the Heat 113-97 on Friday night.\n\n\r\n              “He's just in the flow,\" Booker said about Allen. \"He makes it look easy. It's not complicated. He's shooting open shots and when people try to run him off (the 3-point line), he makes the right play. I think teams are going to realize that helping off him is not the option.”\n\n\r\n              The Suns have won five of their last six games. Miami has dropped three of four.\n\n\r\n              Allen was sensational in the first half, scoring 23 points on 7-of-10 shooting from long range. The sixth-year player out of Duke was acquired in an offseason trade and came into the game averaging a career-high 13 points while shooting about 46% from beyond the arc. \n\n\r\n              He was 9 of 14 on 3s and 11 of 19 overall from the field on Friday. It's his second high-scoring game in the past few weeks — he scored a season-high 32 in a loss against the Mavericks on Christmas night.\n\n\r\n              “We have such an unselfish group,\" Allen said. “I don't get up 14 3-pointers if Booker and Brad aren't making the extra pass all night long, sticking with it and not getting frustrated that they're not able to drive. I'm really grateful to play with guys like that.”\n\n\r\n              Phoenix extended its lead to 94-75 heading into the fourth quarter and kept a double-digit advantage the rest of the night. Beal shot 11 of 18 from the field and added eight rebounds and nine assists. Booker had 20 points and 10 assists.\n\n\r\n              Bam Adebayo led Miami with 28 points and 11 rebounds. Kevin Love added 20 points. Tyler Herro had a tough night, shooting just 4 of 17. The Heat shot just 41% from the field.\n\n\r\n              “We were making the right plays,” Heat coach Erik Spoelstra said. “A lot of those were wide-open 3s. It's the right play and I'm encouraged that we continued to do that despite the misses. But on the other side of the floor, we were never able to control the game defensively and get it in the mud.”\n\n\r\n              The Suns played without Kevin Durant, who missed his third straight game because if tightness in his right hamstring. Miami’s Jimmy Butler (foot) was also out for the sixth time in seven games.\n\n\r\n              “Defensively, probably our best game-plan execution of the year,” Suns coach Frank Vogel said. “That team’s very difficult to guard, even with Butler out.”\n\n\r\n              Allen's big scoring night helped the Suns push ahead 62-55 by halftime. Booker scored 16 points and Beal added 13 in the half.\n\n\r\n              Allen became the sixth player in Suns history to make nine 3s in a game. The others are Landry Shamet, Cam Johnson, Aron Baynes, Channing Frye and Quentin Richardson. Rex Chapman made nine 3s for the Suns in a playoff game.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Houston on Monday night.\n\n\r\n              Suns: Host Memphis on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996524.537909
}