{
  "game_id": "0022401095",
  "espn_id": "401705661",
  "date": "Mar 31, 2025",
  "matchup": "DAL vs. BKN",
  "headline": "Nets beat Mavericks 113-109 to win consecutive games for the first time since the All-Star break",
  "body": "DALLAS -- — Keon Johnson scored 24 points and the Brooklyn Nets beat the Dallas Mavericks 113-109 on Monday night to win consecutive games for the first time since the All-Star break.\n\n\r\n              D’Angelo Russell added 18 points and 11 assists for the Nets (25-51), who last won two in a row during a three-game winning streak from Feb. 7-12. Plaving without leading scorer Cam Johnson, who has a back injury, Brooklyn rallied from a 10-point deficit midway through the fourth quarter with a 12-0 run. \n\n\r\n              Daniel Gafford scored 17 points in his first game since Feb. 10 for the Mavericks (37-39), who were trying to reach .500 for the first time since March 10.\n\n\r\n              Anthony Davis had 12 points and seven rebounds in 28 minutes in his first home game since being injured Feb. 8 in his initial Mavericks appearance following the trade that sent superstar Luka Doncic to the Los Angeles Lakers. Davis returned last week and played three road games.\n\n\r\n              The Mavericks are ninth in the West, a half-game ahead of 10th-place Sacramento.\n\n\r\n              Takeaways\r\n              Nets: They finished 8-7 in road games against the West and overall are better on the road (14-26) than at home (11-25). Jalen Wilson and Drew Timme played before hometown fans. Wilson, from Denton, Texas, scored 12 points. Timme, from Richardson, had nine points in his third game after signing with Brooklyn last Friday.\n\n\r\n              Mavericks: Dereck Lively II, out since Jan. 14 with an ankle stress fracture, could return this week.\n\n\r\n              Key moment\r\n              Nic Claxton scored on a reverse layup with 47 seconds left and was fouled, the 51.7% free-throw shooter completing the three-point play for a 111-107 lead.\n\n\r\n              Key stat\r\n              The Nets hit 20 of 51 3-pointers to the Mavericks’ 10 of 30.\n\n\r\n              Up next\r\n              The Mavericks will host Atlanta on Wednesday. The Nets will begin a four-game homestand Thursday against Minnesota.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997132.242134
}