{
  "game_id": "0021500324",
  "espn_id": "400828211",
  "date": "Dec 09, 2015",
  "matchup": "MIL vs. LAC",
  "headline": "Redick scores 31 to lead Clippers over Bucks, 109-95",
  "body": "MILWAUKEE --  J.J. Redick can't explain his torrid shooting in recent games against Milwaukee, though knows his performance hasn't been fueled by any ill will toward his former team.\n\n\"I don't know what it is, but no, it's not a revenge thing. I wasn't here long enough,\" Redick said.\n\nRedick scored a season-high 31 points, going 6 for 9 from 3-point range, and the Los Angeles Clippers pulled away from the Bucks in the second half for a 109-95 victory on Wednesday.\n\n\"I feel like if I take the shots that I take in practice that eventually I'll hit something,\" said Redick, who was just 1 for 9 against Minnesota on Monday.\n\nRedick, who averaged 24 points in two games against the Bucks last season, scored 15 points in the third quarter. He had nine first-half points before connecting on six of eight shots in the third, going 3 of 4 from 3-point range. He finished two points shy of a career high.\n\n\"What's amazing is he started out slow again. He missed a bunch of open shots,\" Clippers coach Doc Rivers said. \"When you're a shooter, you're a shooter. And once he got his rhythm it was just awesome to see.\"\n\nThe Bucks gave Redick too many open looks in the third quarter, Bucks coach Jason Kidd said.\n\n\"He got going and we couldn't slow him down or get in his way,\" Kidd said.\n\nBlake Griffin had 21 points and 14 rebounds, and Chris Paul added 18 points and 18 assists for the Clippers, who won their third straight. DeAndre Jordan had 19 rebounds.\n\nMichael Carter-Williams finished with 20 points and 11 assists for the Bucks. Greg Monroe had 16 points and nine rebounds.\n\nThe Bucks began fouling Jordan, who shoots less than 40 percent from the line, with 5:02 remaining. He missed both foul shots but pulled down a rebound and found Redick, who sank an open 3.\n\nLos Angeles trailed by a point entering the third quarter but went on an 11-0 run, which included two 3-pointers by Redick, to take a 63-56 lead.\n\nNO TRIPLE THREAT\n\nThe Bucks took only 10 3-point shots, while the Clippers launched 28.\n\n\"Right now we're not a team that takes a lot of 3s,\" Kidd said. \"You play to your strength and ours is in the paint.\"\n\nDEFENSIVE STATEMENT\n\nLuc Mbah a Moute, who averages just 1.5 points per game, started again on Wednesday because of his willingness to take on tough defensive assignments, Rivers said.\n\n\"He's just an intangibles player. He doesn't really need the ball,\" Rivers said. \"I was a defensive player but I didn't really want to guard (Michael) Jordan. He's one of those rare guys that wants the (tough) assignments.\"\n\nTWEETING FOR THE BIRDS\n\nRivers said he's only posted twice on Twitter, the last time on Oct. 27. \"I like Instagram better because I don't have to say much with the pictures,\" he said. \"I guess I have lost interest.\"\n\nHe also revealed that he doesn't know his Twitter password.\n\n\"That's probably why I haven't tweeted,\" he said.\n\nTIP-INS\n\nClippers: Jordan got the crowd buzzing early in the first quarter with a thunderous right-handed slam dunk over Monroe, who was called for a blocking foul. ... The team held a practice Tuesday on the campus of Marquette University, where Rivers starred from 1980-83. Rivers attended Marquette's game against San Jose State that night. He said his son, Austin Rivers, and Redick visited the locker room after the game to meet with Marquette coach Steve Wojciechowski, a fellow former Duke player.\n\nBucks: Greivis Vasquez missed his seventh game with a right ankle injury while Jerryd Bayless remained sidelined with a left ankle sprain for a third game. ... The Bucks unveiled an alternate court, the only one in the league, and uniforms that featured jerseys with only the team's logo against a black backdrop. ... Johnny O'Bryant sank his first career 3-pointer in the second quarter. ... Milwaukee will play the Clippers in Los Angeles on Dec. 16 to close out the two-game season series.\n\nUP NEXT\n\nClippers: At Chicago on Thursday night.\n\nBucks: At Toronto on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994081.6678588
}