{
  "game_id": "0021600756",
  "espn_id": "400900161",
  "date": "Feb 04, 2017",
  "matchup": "ORL @ ATL",
  "headline": "Millsap has 21, Hawks take 113-86 runaway win over Magic",
  "body": "ATLANTA --  This time, no dramatic comeback was needed for Tim Hardaway Jr. and the Atlanta Hawks -- thanks to hot shooting in the opening period.\n\nPaul Millsap scored 21 points, all in the first three quarters, Hardaway also had 21, and the Hawks never trailed in their 113-86 runaway win over the Orlando Magic on Saturday night.\n\nHardaway continued to make the most of his chance to start as Thabo Sefolosha missed his fourth straight game with a groin injury. Hardaway had 33 points, including 23 in the fourth quarter, when Atlanta rallied after trailing by 20 points with less than nine minutes remaining to beat Houston 113-108 on Thursday.\n\nThe Hawks took momentum from the win at Houston into Saturday night's game.\n\n\"The energy was great,\" said Atlanta's Kent Bazemore. \"Coming off an emotional win like that, it's tough to find the emotions again, but we were able to do that.\"\n\nAtlanta made 13 of its first 16 shots from the field, quickly stretching its lead to double figures. The Hawks couldn't keep up that pace, but they made 27 of 41 shots (65.9 percent) for a 65-39 halftime lead. They shot 52.6 percent for the game.\n\nOrlando coach Frank Vogel called his team's effort on defense \"terrible.\"\n\n\"It's disappointing. It's just disappointing,\" Vogel said. \"There's no other word for it.\"\n\nAtlanta took a 39-29 lead on a jam by Dwight Howard early in the second period and kept the advantage in double figures the remainder of the game.\n\n\"They were in a rhythm,\" said Orlando's Aaron Gordon, who had 16 points. \"We had a good game plan and we didn't execute it defensively as a whole.\"\n\nMillsap, Howard and Dennis Schroder sat out the fourth quarter. Schroder had 17 points and 10 assists.\n\nThe Hawks (30-21) have won three of four and 15 of 20 to move to a season-high nine games over .500.\n\nTIP-INS\n\nMagic: Elfrid Payton had 10 to join Gordon as Orlando's only two starters to score in double figures. ... The Magic fell to 11-17 in road games. ... Jeff Green had 12 points off the bench. ... Starting guards Evan Fournier and Payton combined to make only 6 of 24 shots. The two were a combined 0-for-7 on 3-point attempts. ... The Magic made only 27 of 78 shots (35.1 percent).\n\nHawks: Howard had 11 points and 13 rebounds for his 33rd double-double of the season. ... F Taurean Prince was recalled from the Long Island Nets of the NBA Development League, one day after he was fined $25,000 for his role in a scuffle during Wednesday's game in Miami. He was ejected from the game. Asked about the fine on Saturday, coach Mike Budenholzer said he believes the league takes \"the safety of our players, the spirits of the game, seriously and I'm just going to be respectful of their decision.\"\n\nSUPER BOWL SPIRIT\n\nSuper Bowl fever in Atlanta may have hurt the turnout, but the Falcons' influence was felt. One fan sitting near the floor held up a Falcons' \"Rise Up\" banner after Howard predicted a Falcons win over the Patriots in a recorded segment shown on the video board.\n\nFalcons fans cheered and chanted \"MVP! MVP!\" after quarterback Matt Ryan's selection as the AP NFL Most Valuable Player award was announced to the crowd late in the game.\n\nNO WINNING STREAK IN `17\n\nOrlando, which beat Toronto on Friday night, hasn't won back-to-back games since Dec. 23 and 26 against the Lakers and Memphis.\n\n\"Apparently we're not good enough for that -- on either end of the floor,\" Vogel said.\n\n7 PASSES ARE PERFECT\n\nA possession that included seven passes ended with Hardaway's buzzer-beating 3-pointer from the corner for a 76-50 lead midway through the third period.\n\nHardaway described the play as \"Hawks basketball at its finest.\"\n\n\"If we play like that, we not only make ourselves happy, we make our coach happy,\" he said.\n\nUP NEXT\n\nMagic: Visit Houston on Tuesday night.\n\nHawks: Host Utah on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764995837.0647528
}