{
  "game_id": "0021800482",
  "espn_id": "401071163",
  "date": "Dec 22, 2018",
  "matchup": "MIL @ MIA",
  "headline": "Heat clamp down on Giannis, top Bucks 94-87",
  "body": "MIAMI --  This is what Miami coach Erik Spoelstra means when he says he wants everyone involved.\n\nThis was one play for the Heat in the final moments Saturday night: James Johnson blocked a 3-point try by Milwaukee's Khris Middleton, the ball ricocheting to Justise Winslow, who knocked it to Josh Richardson, who tipped it to Dwyane Wade, who then tapped it forward to Richardson for a dunk.\n\nIt was that kind of night for the Heat. With balanced offense, airtight defense and by completely frustrating Giannis Antetokounmpo, Miami extended its season-best winning streak to four games with a 94-87 win over the Milwaukee Bucks.\n\n\"We have to be able to commit to this,\" Spoelstra said.\n\nAntetokounmpo was held to nine points on 3-for-12 shooting, the Bucks shot 37 percent and scored the 87 points -- all season-lows. Milwaukee came in leading the NBA at nearly 118 points per game but scored only eight points in the first quarter, tying a franchise low for an opening period and setting a season-low for the entire NBA.\n\nStill, the Bucks clawed from 17 down to within one in the final minutes before Miami closed on a 12-6 run -- fueled in part by a couple of big mid-range jumpers from Wade.\n\n\"They tried to hit us first, they were physical with us,\" said Antetokounmpo, whose previous season-low was 12 points. \"We came from a back-to-back, but that's not an excuse for us. We didn't make shots, we had a lot of open looks that didn't go in, but just being able to stick around and be in the game and have a chance to win says a lot about this team.\"\n\nRichardson scored 16 points and Wade had 13 for Miami. Hassan Whiteside had 11 points and 13 rebounds, and Kelly Olynyk and Johnson each scored 11 points for the Heat.\n\nMiddleton scored 18 points and Eric Bledsoe added 17 for the Bucks, who shot 37 percent from the field -- and 9 for 43 from 3-point range. It was the sixth-worst 3-point percentage in NBA history for a team taking at least 40 shots from beyond the arc.\n\nMiami shot only 38 percent and improved to 5-4 when shooting under 40 percent this season, by far the best in the league in that department. The rest of the NBA has won about 9 percent of the time when shooting that percentage or worse.\n\n\"Just couldn't make a couple plays down the stretch,\" Bucks coach Mike Budenholzer said.\n\nMilwaukee got within 82-81 on a 3-pointer by Tony Snell with 2:42 left. Richardson made a pair of free throws, Wade had Miami's next four points on a pair of midrange jumpers, and the Heat finished on a 12-6 run with Richardson's dunk the exclamation point.\n\n\"Play of the game,\" Wade said.\n\nThe Bucks missed 12 of their first 14 shots from the field and were 0 for 13 from 3-point range before finally getting one of those to fall.\n\nIt tied a franchise-best for fewest points allowed in a first quarter by the Heat, and Antetokounmpo was held scoreless in an opening quarter for the second time in his last 129 games.\n\nThe Bucks scored 30 points in the second quarter and took a 38-37 lead at the half, but Miami opened the third on a 14-2 run and kept the lead the rest of the way. Bledsoe said Wade's two late jumpers were the difference.\n\n\"D-Wade being D-Wade,\" Bledsoe said.\n\nTIP-INS\n\nBucks: Even with the loss, the last time Milwaukee (22-10) got off to a better 32-game start to the season was 1990-91 (24-8). ... It was a tough turnaround, schedule-wise, for Milwaukee. The Bucks played an 8 p.m. game in Boston on Friday, and their plane didn't get to the gate in Miami until 3:34 a.m. Saturday. \"I guess I'd be lying if I didn't say this was one of the more unique (back-to-backs) I've seen in all my years,\" Budenholzer said.\n\nHeat: Miami outrebounded Milwaukee 56-48. ... The win was Miami's 500th regular-season victory at AmericanAirlines Arena, their home since Jan. 2, 2000. They're now 500-274.\n\nYEAR OF WAITING\n\nSaturday marked the one-year anniversary of Dion Waiters' last appearance with the Heat. He hurt his left ankle in the first quarter of Miami's win over Dallas on Dec. 22, 2017, had surgery a few weeks later and hasn't played since.\n\nUP NEXT\n\nBucks: Visit New York on Christmas Day, Milwaukee's first game on the holiday since 1977.\n\nHeat: Visit Orlando on Sunday, the 24th and likely final time Wade plays there.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994502.087796
}