{
  "game_id": "401810171",
  "espn_id": "401810171",
  "date": "Dec 01, 2025",
  "matchup": "UTAH vs HOU",
  "headline": "Markkanen scores 29 and George adds 28 in bounce-back game as Jazz outlast Rockets 133-125",
  "body": "SALT LAKE CITY -- — Lauri Markkanen scored 29 points and Keyonte George added 28 as the Utah Jazz outlasted the Houston Rockets 133-125 on Monday night.\n\n\r\n              Kevin Durant, off target much of the game, scored 16 of his 32 points in the fourth quarter for Houston. Alperin Sengun had 31 points and tied a career high with 14 assists. Amen Thompson added 23 points for the Rockets (13-5), who had won five straight on the road.\n\n\r\n              Sengun’s contested layup pulled the Rockets to 126-123 with 52.7 seconds remaining, but George hit 5 of 6 free throws and added a steal down the stretch to seal the win.\n\n\r\n              The teams played Sunday night in Utah and the Rockets rolled to a 129-101 victory. This one was quite the contrast as the Jazz led almost all game.\n\n\r\n              George, who went scoreless with eight turnovers Sunday, shot 8 for 14 from the field and handed out eight assists. \n\n\r\n              Jusuf Nurkic had a season-high 18 points and nine rebounds before fouling out, and Ace Bailey added 13 points as Utah (6-13) improved to 6-6 at home.\n\n\r\n              The Jazz built a 98-77 lead after Nurkic's hook shot with 1:37 left in the third quarter. In the last 97 seconds of the period, that advantage dwindled to 98-89 due to a lightning 12-0 run that included three steals.\n\n\r\n              The Rockets have been one of the best defensive teams in the NBA — holding opponents to 97.7 points per game during their three-game win streak — but were a step slow in their rotations against the Jazz, who often made the extra pass to a wide-open shooter.\n\n\r\n              Steven Adams rested and the Rockets missed his presence in the middle. Utah had 24 second-chance points.\n\n\r\n              In a 36-second span of the fourth quarter, the Rockets committed five fouls without gaining possession and the Jazz were suddenly in the penalty. That came in handy as George clinched the game with free throws.\n\n\r\n              Up next\r\n              Rockets: Host the Sacramento Kings on Wednesday.\n\n\r\n              Jazz: Visit the Brooklyn Nets on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042733.823454
}