{
  "game_id": "0022301028",
  "espn_id": "401585656",
  "date": "Mar 24, 2024",
  "matchup": "LAC vs. PHI",
  "headline": "James Harden and Clippers lose their first meeting with Philadelphia since the trade, 121-107",
  "body": "LOS ANGELES -- — Tobias Harris scored 24 points and Tyrese Maxey added 19 of his 24 in the second half of the Philadelphia 76ers' 121-107 victory over James Harden and the Los Angeles Clippers on Sunday.\n\n\r\n              Harden had 12 points and 14 assists in his first game against the 76ers since he forced his way out of Philadelphia last November. After going 0 for 6 on 3-pointers to jeers from a small but vocal cheering section of Sixers fans in Los Angeles, the 10-time All-Star and 2018 MVP will head back to Philadelphia with the Clippers on Wednesday for the rematch.\n\n\r\n              Harden didn't speak to the media after this game, but his former teammates with Philly were complimentary after soundly beating his new team.\n\n\r\n              “James is a hell of a player, and I always have a huge amount of respect for him,” Harris said. “It's good to see him in LA flourishing and playing his game, just balling out. It's all love and respect. He's a Hall of Fame player, and for me it was an honor being here playing with him. To see him on the other side happy and enjoying what he's doing, that's really what the game is all about.”\n\n\r\n              Cameron Payne had a season-high 23 points with five 3-pointers for the Sixers, who rebounded from a loss to the Lakers on Friday by hitting 18 3-pointers in just their fourth victory in 11 games.\n\n\r\n              Philadelphia blew an early 17-point lead over the Clips before taking control with a 15-2 run to open the fourth quarter led by Maxey, who started slowly and finished strong for the second straight game in LA.\n\n\r\n              “We finally put two halves together, and it felt good,” Payne said. “Shots were falling. Everybody came locked in today. Shots were falling, and everybody played the right way.”\n\n\r\n              Kawhi Leonard scored 20 points and Paul George had 18 for the Clippers, who have lost five of eight and haven't beaten a team with a winning record in three weeks. Norman Powell scored 20 points after returning from a three-game absence with a leg bruise, but the Clippers couldn't keep up with the Sixers' outside shooting.\n\n\r\n              “We know we’ve got to play better basketball going into the playoffs, or it’s going to be an early season,\" Clippers coach Tyronn Lue said. \"Still got full confidence in this team and full confidence in what we can do. It's just (about) going out and doing it every single night – not 26 minutes, (but) 48 minutes of doing the right things.”\n\n\r\n              Harden played in just 79 regular-season games during 21 tumultuous months with the Sixers, who traded Ben Simmons to acquire him from Brooklyn in February 2022. Harden led the NBA in assists last season while boosting Joel Embiid in his MVP campaign before Philly lost a seven-game series to Boston in the second round of the playoffs.\n\n\r\n              The 34-year-old Harden picked up his contract option to return to Philadelphia last summer, but abruptly requested a trade several weeks later. He then criticized Sixers president of basketball operations Darryl Morey, reportedly calling the executive “a liar” at an Adidas event in China.\n\n\r\n              Philadelphia still kept Harden on its roster until Nov. 1, when Morey dealt the Los Angeles native to his preferred destination for a package headlined by Nicolas Batum, Robert Covington and KJ Martin.\n\n\r\n              “It was crazy when it was happening,” Philadelphia's Paul Reed said. “I was upset, but I wasn't like, upset-upset. I was still cool. ... It does feel like that happened last year. You know how long the season is.”\n\n\r\n              Harden has been largely outstanding with Los Angeles, averaging 17.3 points and 8.5 assists while boosting the Clippers to a top-four spot in the Western Conference.\n\n\r\n              Before this game, both coaches downplayed the importance of the reunion — although 76ers coach Nick Nurse acknowledged “it might get a little bit different on the other end.” Nurse was referring to Wednesday, when the Clippers visit Philadelphia.\n\n\r\n              “I didn't really hear any, ‘Oh, we’re playing (Harden), we're playing (the Clippers),'” said Payne, who joined the Sixers last month. “I feel like we just handled our business, and it showed on the court.”\n\n\r\n              Batum didn't play in his return to LA, but got cheers from fans who loved him during his three-plus seasons with the Clippers.\n\n\r\n              Even after a Saturday night off in Los Angeles, the Sixers hit 20 of their first 28 shots and took a 17-point lead in the first half, shaking off the poor shooting that plagued an otherwise solid performance against the Lakers. The Clippers rallied to tie it in the third quarter, but never led.\n\n\r\n              UP NEXT\n\n\r\n              76ers: At Sacramento on Monday.\n\n\r\n              Clippers: Host Indiana on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764996538.829935
}