{
  "game_id": "0022000949",
  "espn_id": "401307752",
  "date": "Apr 30, 2021",
  "matchup": "ATL @ PHI",
  "headline": "76ers use balanced scoring, rout Hawks for 2nd straight game",
  "body": "PHILADELPHIA -- — Ben Simmons, Joel Embiid and Tobias Harris each scored 18 points to lead the Philadelphia 76ers to a 126-104 victory over the Atlanta Hawks on Friday night.\n\n\r\n                    Dwight Howard had a team-high 19 points and 11 rebounds for the 76ers, who routed the Hawks for the second straight game. Philadelphia is a half-game behind Brooklyn in the race for the top seed in the East.\n\n\r\n                    Trae Young scored 32 points in his return after a four-game absence due to an ankle injury, and Clint Capela had 11 points and 15 rebounds for Atlanta. The Hawks stayed in fifth place in the East and are tied with the Celtics, with both a half-game in front of idle Miami for a first-round playoff bye.\n\n\r\n                    The 76ers likely will be sad to see the Hawks leave town. Besides the victories, the two games against Atlanta gave Embiid, Simmons and other key starters extra rest when they weren’t needed in the fourth quarter. It also provided the bench players with extended minutes.\n\n\r\n                    “It came at a perfect time for us,” Philadelphia coach Doc Rivers said. “None of (the starters) had to stretch minutes. Now they’re good to go, which is great. The bench guys got great rhythm.”\n\n\r\n                    The 76ers routed Atlanta 122-83 on Wednesday night in Philadelphia when they clinched a playoff spot. Hawks coach Nate McMillan talked prior to Friday’s contest about his team’s need to come out with energy and urgency in the rematch.\n\n\r\n                    It looked as if the Hawks got the message, as they scored 13 of the first 15 points to take an early 11-point lead. But the 76ers outscored Atlanta 21-13 over the final 7:21 to pull within 26-23 after one.\n\n\r\n                    Philadelphia took control in the second quarter. Harris and Simmons had resounding dunks in a dominating period for the 76ers, who outscored Atlanta 42-20 to go up 65-46 at the break. Philadelphia made 15 of 28 shots in the quarter, while Atlanta missed 14 of 19.\n\n\r\n                    Embiid’s 3 from the top of the key on an assist from Simmons early in the third put the 76ers on the blowout path, giving them a 72-48 lead and well on their way to another easy win over Atlanta.\n\n\r\n                    “We didn’t contain them, that was the problem tonight,” McMillan said. “Defensively we just could not keep the ball in front of us. We just had too many breakdowns on the ball.”\n\n\r\n                    BIG BEN\n\n\r\n                    Simmons has played three strong games after missing the previous four due to illness. In home wins over Oklahoma City and the last two over Atlanta, the 76ers' point guard has averaged 12.7 points, five assists and 4.3 rebounds in 22 minutes per contest while shooting 78.2% (18 of 23) from the field.\n\n\r\n                    “Ben has been a tone-setter for us; he’s been absolutely amazing,” Rivers said. “I don’t know if it’s the best he’s played all year, but it’s close. He’s driving our team right now.”\n\n\r\n                    TRAE’S TAKE\n\n\r\n                    Young was elated to be back on the court and said his ankle felt good during and after the game.\n\n\r\n                    “I always try to battle back (from injury) and get back to the court as fast as possible,” he said. “I was just doing a lot of treatment, and (Atlanta’s training staff) did a great job helping me to get back on the court.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Kevin Huerter (left shoulder sprain) missed his second straight contest. He is day to day. … Fell to 16-19 on the road. … McMillan and Kris Dunn were whistled for technical fouls.\n\n\r\n                    76ers: Philadelphia Eagles first-round draft pick DeVonta Smith, quarterback Jalen Hurts and defensive lineman Brandon Graham rang the ceremonial Liberty Bell prior to the game. … Improved to 25-7 at home. … Embiid and Shake Milton received technical fouls. … Simmons added six rebounds and five assists. … Matisse Thybulle had four steals.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Host Chicago on Saturday night.\n\n\r\n                    76ers: At San Antonio on Sunday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997827.1078248
}