{
  "game_id": "0021500270",
  "espn_id": "400828157",
  "date": "Dec 02, 2015",
  "matchup": "PHX @ DET",
  "headline": "Jackson rallies Pistons past Suns 127-122 in OT",
  "body": "AUBURN HILLS, Mich. --  Stan Van Gundy didn't want to criticize his Detroit Pistons too much Wednesday night.\n\nAfter all, as much as he was disgusted by their effort, he did recognize that they rallied from a 16-point deficit in the fourth quarter to beat the Phoenix Suns 127-122 in overtime.\n\n\"I don't want to get going too much, because we did win the game, and I don't want this to turn negative,\" the coach said. \"But I've never had to make that many defensive adjustments in a game in my career, all trying to find a scheme that would work without my players making any effort.\"\n\nThe Pistons trailed 98-82 with 9:22 left in the fourth but outscored Phoenix 30-14 down the stretch to force overtime.\n\n\"We just had a burst of energy,\" said Marcus Morris, who is 2-0 against his former team this season. \"We played hard, because we knew we still had a chance to win.\"\n\nDetroit also needed some improbable free throw shooting from Andre Drummond to get to overtime. With 14.3 seconds left and a 112-110 lead, the Suns fouled Drummond on a pick-and-roll. Drummond, who is 12 of 46 from the line in the last three games, hit both shots to force the extra period.\n\n\"I have no idea how that happened,\" Van Gundy acknowledged. \"It was a bad decision on my part to give them that opportunity. That's why we used Aron (Baynes) on offense in overtime. It's a problem.\"\n\nReggie Jackson scored 24 of his 34 points after halftime, helping the Pistons cut into the big deficit. He added 16 assists to become the first Pistons player with a 30-15 game since Isiah Thomas on Jan. 2, 1988.\n\n\"Reggie Jackson is a very good player, and that's the second time this year he has dominated us in the fourth quarter,\" Phoenix coach Jeff Hornacek said. \"We couldn't stop anybody, though. We just let them go through us without any resistance.\"\n\nThe Pistons started overtime with an 8-1 run, but a pair of missed free throws by Drummond helped Phoenix narrow the gap to 122-120 with 1:27 to play.\n\nThe Suns had three chances to tie it in the last 35 seconds, but P.J. Tucker was called for an offensive foul, T.J. Warren missed a contested layup and, after Marcus Morris' free throw, Brandon Knight missed a 3-pointer with 6 seconds to play.\n\nPhoenix played without Tyson Chandler (hamstring) and Markieff Morris (bruised knee) and ran out of gas in the fourth quarter, blowing the big lead.\n\nDetroit led in the final minute of regulation, but Knight knocked down a 3 that put the Suns back up 112-110 with 31 seconds to go.\n\nIlyasova missed a 3 and Knight grabbed the rebound with 23 seconds left. Knight, though, turned the ball over on the ensuing inbounds pass, giving his former team another shot. That led to the clutch free throws by Drummond, the only player to make less than 40 percent of his career foul shots.\n\nDrummond added 22 points and 12 rebounds for Detroit, which had four players score at least 20. Knight had 22 points and Bledsoe added 21 points and nine assists.\n\nLate in the first half, the Suns became the third straight team to intentionally foul Drummond. He missed five of six free throws before Van Gundy was able to get Baynes into the game.\n\nThat helped Phoenix build a 57-54 lead, but Jackson's 35-footer at the buzzer tied the score.\n\nThe Suns jumped back into an 80-72 lead in the third, hitting five of their first six 3-point attempts. Van Gundy got desperate enough to play zone defense in the fourth, but Phoenix hit a 3-pointer and an easy drive-and-dunk on the first two possessions.\n\nThat gave the Suns their 16-point lead, but Detroit narrowed the gap to 104-103 with 3:53 to play, aided by back-to-back 3s from Jackson and Kentavious Caldwell-Pope. Van Gundy pulled Drummond once the Suns committed their fourth foul of the quarter, but he only missed one defensive possession.\n\nTIP-INS\n\nSuns: Markieff Morris was a late scratch, preventing him from playing against his twin brother, Marcus. ... Hornacek said before the game that Chandler will have to go through a shootaround or short practice before being cleared to play.\n\nPistons: Caldwell-Pope, who played 44 minutes against James Harden and the Rockets on Monday and 20 minutes against Knight in the first half, sat out halftime warmups. He had both knees wrapped, but was back on the floor to start the third quarter.\n\nFREE THROW WOES\n\nDrummond has missed 34 free throws in the last three games, nine more than NBA MVP Stephen Curry missed for Golden State during the entire 2014-15 season.\n\nUP NEXT\n\nSuns: At the Washington Wizards on Friday.\n\nPistons: Host the Milwaukee Bucks on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994875.115647
}