{
  "game_id": "0021900359",
  "espn_id": "401161001",
  "date": "Dec 11, 2019",
  "matchup": "TOR vs. LAC",
  "headline": "Leonard scores 24 points as Clippers beat Raptors 112-92",
  "body": "TORONTO --  Kawhi Leonard got his ring, and the Los Angeles Clippers got another win.\n\nLeonard scored 23 points in his return to Toronto, Lou Williams had 18 and the Clippers won their third straight game Wednesday, beating the slumping Raptors 112-92.\n\nMaurice Harkless scored 14 points and Paul George had 13 as the Clippers evened their road record at 6-6.\n\nBefore the game, Leonard received his championship ring from the 2018-19 season, when he helped Toronto beat Golden State in six games for the franchise's first NBA title.\n\nFollowing a pregame video tribute, Leonard's former teammates, along with coaches and team executives, gathered in a circle at center court. As the standing-room-only crowd roared with approval, Leonard embraced each player in turn before guard Kyle Lowry presented him with his ring. After slipping it on, Leonard raised his arms and waved.\n\n\"It was great, it was a great moment,\" Leonard said. \"They did a great job putting it together, having all the players out there that won with me, standing there and presenting the ring.\n\n\"It was a special season for us, for me, for the whole city and country,\" Leonard added. \"I'm glad we were able to win. It was a blessing.\"\n\nLeonard didn't put the ring on all the way before the game, but spent some more time with it afterward.\n\n\"I sat in the locker room with it for a little bit,\" he said, \"just admiring it and just remembering all the memories and all the hard work that went into it.\"\n\nLowry, who was planning to have dinner with Leonard after the game, said he was happy to hand over the diamond-studded hardware.\n\n\"He helped this franchise do amazing things and he got his ring,\" Lowry said.\n\nClippers coach Doc Rivers said Leonard was touched by the warm welcome he got from Toronto's fans.\n\n\"It meant a lot,\" Rivers said. \"Some players just don't let you in but I can tell you that ovation, to him, was very heartfelt. There's no doubt about that.\"\n\nClippers guard Patrick Beverley scored 11 points in 19 minutes before leaving in the third quarter because of a concussion. Beverley collided with Marc Gasol's shoulder as the Raptors center was setting a screen.\n\nPascal Siakam scored 24 points, Norman Powell had 22 and OG Anunoby 13 as the Raptors lost for the fourth time in five games and dropped their third straight at home. Toronto set a franchise record with nine straight home victories to begin the season.\n\nThe Raptors last lost three straight at home between Nov. 29 and Dec. 5, 2015.\n\nThe Raptors shot 8 for 36 from 3-point range, their worst mark of the season. Toronto matched a season low with 31 field goals. They also had 31 in a Nov. 29 win at Orlando.\n\n\"We're in a period where we're not playing very well here for about a week,\" coach Nick Nurse said.\n\nLeonard was held to 12 points, a season low at the time, when the Raptors visited the Clippers on Nov. 11. The three-time All-Star and two-time NBA Finals MVP shot 1 for 11 in that game, but Los Angeles won 98-88.\n\nLeonard shot 8 for 14 Wednesday, going 2 for 4 from 3-point range and 5 for 5 from the free throw line.\n\n\"I thought Kawhi was great,\" Rivers said. \"What I loved about him was he was patient. He just waited. He kept accepting the traps, he kept making the right play.\"\n\nLeonard returned after sitting out Monday's win at Indiana because of a sore left knee. He has missed seven of the Clippers' 26 games this season.\n\nTIP-INS\n\nClippers: Rivers said G Rodney McGruder, who has missed the past seven games because of a strained right hamstring, might return Friday at Minnesota. . Williams led the Clippers with eight assists.\n\nRaptors: Lowry scored six points in the first quarter but didn't score again, missing his final six field goal attempts and shooting 0 for 7 from 3-point range. . G Fred VanVleet (right knee) sat for the second straight game. . F Patrick McCaw returned after missing 17 games because of left knee surgery. . Gasol led Toronto with 11 rebounds.\n\nBOARD MEN GET WINS\n\nThe Clippers are 14-0 this season when they outrebound their opponents.\n\nSECOND GUESSING\n\nToronto has set or matched season lows in second-quarter scoring in three straight games. The Raptors matched a season low with 20 points in the second quarter of Sunday's loss at Philadelphia, then set a new low with 19 points in the second in Monday's win at Chicago. They scored just 14 points in the second Wednesday, one more than Williams had for Los Angeles in the quarter.\n\nUP NEXT\n\nClippers: Visit the Minnesota Timberwolves on Friday.\n\nRaptors: Host the Brooklyn Nets on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995635.07121
}