{
  "game_id": "0021500309",
  "espn_id": "400828196",
  "date": "Dec 07, 2015",
  "matchup": "CHI vs. PHX",
  "headline": "Teletovic, Knight rally Suns past Bulls, 103-101",
  "body": "CHICAGO -- After dropping the previous four games by a total of 13 points, Brandon Knight felt it was time for the Phoenix Suns to stop waiting for the breaks to go their way.\nMirza Teletovic scored 20 points, including a follow basket with 0.3 seconds left, to cap the Suns' furious fourth-quarter rally from 16 down in a 103-101 victory over the Chicago Bulls on Monday night.\nKnight had 17 of his 21 points in the fourth as the Suns snapped a four-game skid. Phoenix outscored Chicago 42-24 in the final period.\n\n\"I know we put ourselves in position to win, but nothing's given in this league,\" Knight said. \"You have to go out and take it. After losing three or four games like that, I think we realize that.\n\"That's what we did tonight.\"\nThe Suns, who lost on an alley-oop with 0.5 seconds left on Sunday in Memphis, finished 2-4 on a six-game road trip.\n\"This has been a crazy trip for us,\" coach Jeff Hornacek said. \"Start in Toronto, have a great win there, then we have four games in a row that we have leads in the fourth. Then, we come out and be down 16 on the last game of six games in nine nights.\n\"The guys could have easily quit and they didn't. They kept playing and they made some plays and pulled out what's a big win for us.\"\nPau Gasol scored 22 points to lead the Bulls, Jimmy Butler added 19 and Derrick Rose 14.\nChicago led most of the way and its advantage grew to 77-61 entering the fourth quarter as Phoenix was held to 10 points on 4-of-20 shooting in the third.\n\"We got a 16-point lead, play our best defensive quarter of the year, outscore them 26-10 in the third and follow that up with our worst defensive quarter of the year,\" Bulls coach Fred Hoiberg said. \"And just couldn't find a way to get a rebound. They score 28 second-chance points, a lot of those came at key times.\"\nTrailing 86-75 with just under 8 minutes to go, Phoenix went on an 11-2 run to pull within 88-86 with just under 5 minutes remaining.\nFollowing a basket by Rose, Knight converted a three-point play to make it 90-89.\nThe Bulls seemingly created a little breathing room when Butler hit a 3-pointer for a 101-96 edge with just under two left. But rookie Devin Booker hit a 3-pointer and Eric Bledsoe came up with a steal and fast break layup to tie the game with 1:17 left.\nThat's where it stayed until Teletovic rebounded a miss by Jon Leuer and put up a fadaway jumper from about 10 feet.\nTIP INS\nSuns: C Tyson Chandler missed his sixth straight game with a right hamstring strain. \"We've got to get him 100 percent,\" Phoenix coach Jeff Hornacek said. \"If we get him out there too early and he strains it again and is out another two or three weeks, that's not gonna help us out.\"\nBulls: F/C Cameron Bairstow was recalled from the Austin Spurs of the NBDL before the game. Bairstow played five games in the NBDL, averaging 14 points and eight rebounds. ... Entering Monday, they were second in the NBA in opponent field-goal percentage with a mark of .409\nFIRST ENCOUNTER\nBefore the game, Hoiberg recalled that he was a ballboy at Iowa State the first time he met Hornacek.\n\"He was such a fun player to watch,\" Hoiberg said. \"Just his story of going to Iowa State as a walk-on and arguably be the best player to ever to graduate from Iowa State University. He was a guy I absolutely looked up to when I was a kid.\"\nUP NEXT\nSuns: Host Orlando on Wednesday.\nBulls: At Boston on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764993962.4149828
}