{
  "game_id": "0022000845",
  "espn_id": "401307641",
  "date": "Apr 16, 2021",
  "matchup": "OKC @ DET",
  "headline": "Pistons hand Thunder 9th straight loss with 110-104 victory",
  "body": "DETROIT -- — Josh Jackson scored 29 points, and the Detroit Pistons overcame several key absences to beat Oklahoma City 110-104 on Friday night, handing the Thunder their ninth straight loss.\n\n\r\n                    Oklahoma City cut an 11-point, fourth-quarter lead to one, but Detroit held on two nights after blowing a double-digit advantage in the final period against the Los Angeles Clippers. \n\n\r\n                    With the score 97-94 and 3:10 remaining, Jackson was called for an offensive foul — his sixth. But that call was overturned after a review, and Jackson made two free throws.\n\n\r\n                    “I felt like I saw it — the guy was sliding,\" Detroit coach Dwane Casey said. \"It was big because it kept Josh in the game.”\n\n\r\n                    Isaiah Stewart had 15 points and 22 rebounds for Detroit.\n\n\r\n                    “Tonight was just all about physicality and playing hard,\" Stewart said. \"Just trying to be great on both ends of the floor.”\n\n\r\n                    The Pistons — who are in last place in the Eastern Conference — were missing Jerami Grant (right knee), Mason Plumlee (rest), Hamidou Diallo (right knee), Wayne Ellington (rest), Cory Joseph (left ankle), Rodney McGruder (right elbow) and Dennis Smith Jr. (left knee).\n\n\r\n                    Detroit's starting lineup consisted of three rookies — Saddiq Bey, Killian Hayes and Stewart — plus Jackson and 20-year-old second-year man Sekou Doumbouya. The Pistons fell behind by 15 in the second quarter but rallied to a 56-all tie at halftime.\n\n\r\n                    The Thunder turned the ball over 10 times in the third quarter and 22 times for the game. Detroit led 86-79 after three.\n\n\r\n                    Lu Dort scored 26 points for Oklahoma City.\n\n\r\n                    “I thought he was good again. He just continues to improve on that end of the floor,\" Thunder coach Mark Daigneault said. \"I thought the stretch in the fourth when the game was starting to slip away for us, we kind of pumped it to him.”\n\n\r\n                    The Thunder weren't exactly at full strength themselves. Oklahoma City was missing Shai Gilgeous-Alexander (right foot), Josh Hall (knee), Mike Muscala (right ankle) and Aleksej Pokusevski (right arm).\n\n\r\n                    Bey scored 18 points. Hayes added nine points and seven assists and provided one of the game's highlights with a bounce pass to Bey in the third quarter that traveled about half the length of the court.\n\n\r\n                    “That’s natural,\" Casey said. “He sees things like that.”\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Oklahoma City went 7 of 39 from 3-point range.\n\n\r\n                    Pistons: Stewart had the most rebounds by a Pistons rookie since March 30, 1977, when Leon Douglas had 22. ... It was the second time this season the Pistons started three rookies. It hadn't happened previously since 1980.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Visit Toronto on Sunday night. Oklahoma City beat the Raptors 113-103 on March 31.\n\n\r\n                    Pistons: Visit Washington on Saturday night. The teams have split two games so far this season.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997071.8482099
}