{
  "game_id": "0022000202",
  "espn_id": "401267362",
  "date": "Jan 17, 2021",
  "matchup": "IND @ LAC",
  "headline": "Clippers beat Pacers 129-96 for 1st 4-game winning streak",
  "body": "LOS ANGELES -- — Marcus Morris scored a season-high 20 points to lead seven players in double figures, and the Los Angeles Clippers defeated the Indiana Pacers 129-96 on Sunday night for their first four-game winning streak of the season.\n\n\r\n                    With sharpshooter Lou Williams sidelined, Morris came off the bench to hit four 3-pointers, tying his season-high. He was coming off an 18-point performance at Sacramento on Friday. The Clippers made 19 of 39 from long-range, outdueling the Pacers, who were 11 of 38.\n\n\r\n                    “I was wide-open,” Morris said. “If I can't make a wide-open shot, I'm in the wrong business.”\n\n\r\n                    Fellow reserve Luke Kennard added season highs of 20 points and five 3-pointers. Paul George also had 20 points. Kawhi Leonard had 17 points, seven rebounds and five assists for the Clippers.\n\n\r\n                    “I feel like our energy is way better this season,” Morris said. “Guys are buying in and enjoying playing the game.”\n\n\r\n                    Doug McDermott led the Pacers with 23 points, making five 3-pointers. Domantas Sabonis added 19 points and 14 rebounds.\n\n\r\n                    Indiana closed within two points early in the third before the Clippers put the game away. They outscored the Pacers 37-14 the rest of the quarter to lead 100-75 going into the fourth. Los Angeles made eight 3-pointers by six different players and Leonard scored 11 points.\n\n\r\n                    “They started making shots,” Sabonis said. “I feel like we left guys too open. We were throwing out a lot of different defenses and they caught on to the box-and-1 and it was harder for us to catch up.”\n\n\r\n                    The Clippers ran off 10 straight points early in the fourth to lead 110-81. Kennard had a 3-point play and George scored seven in a row. \n\n\r\n                    “Excited to see how far he can take it,” Morris said of George. “Been playing very well, unselfish, under control. He’s definitely playing MVP basketball.”\n\n\r\n                    Indiana had won two straight, but was idle since Thursday at Portland. The team's game at Phoenix on Saturday was postponed because of COVID-19 issues.\n\n\r\n                    That didn't stop McDermott from bursting out of the gate. He scored 13 of the Pacers' first 21 points.\n\n\r\n                    The Clippers hit five 3-pointers while outscoring the Pacers 35-12 over the end of the first quarter and start of the second to build an 18-point lead. Indiana closed strongly with a 20-10 run, including 10 by Sabonis, that left the Pacers trailing 61-55 at halftime.\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Myles Turner was out with a sore right hand. ... Goga Bitzdze returned from a sprained right ankle and scored five points. ... Their four-game trip ended. ... Both teams wore T-shirts honoring Martin Luther King Jr. during warmups. \n\n\r\n                    Clippers: Their bench outscored the Pacers' reserves, 65-14. ... It was their fourth straight game with at least 15 3-pointers made, tying the longest such streak in franchise history. ... Williams missed his second straight game with a left hip injury. ... Serge Ibaka was out for non-COVID-19 reasons.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Host Dallas on Wednesday.\n\n\r\n                    Clippers: Host Sacramento on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997157.515612
}