{
  "game_id": "0021800014",
  "espn_id": "401070217",
  "date": "Oct 18, 2018",
  "matchup": "CHI @ PHI",
  "headline": "Simmons triple-double leads 76ers past Bulls 127-108",
  "body": "PHILADELPHIA --  Markelle Fultz heard 20,000 Philadelphia 76ers fans exhort him to shoot each time he touched the ball, a roaring confidence boost for a No. 1 pick closer to a bust than brilliance.\n\nFultz had the look he wanted in the second quarter. He dribbled to the foul line without a defender in his path, pulled up and uncorked a jumper. The ball rattled around the rim before it fluttered through the net.\n\nSixers fans rose to their feet, erupted in cheers and chanted \"Fultz! Fultz! Fultz!\"\n\nYes, a simple jumpshot from the top pick of the 2017 draft in the second game of the season was enough to get a rise out of the fans -- and a sigh of relief from Fultz.\n\n\"It makes me feel better for the whole crowd to feel as good as I want to,\" Fultz said.\n\nThe curious case of Fultz's missing jumper continued against the Bulls when one of the more scrutinized players in the NBA managed to steal the spotlight from his more accomplished teammates with routine -- yet highlight-reel worthy -- baskets.\n\nUntil he gets his shot right, Ben Simmons and Joel Embiid will continue to lead the Sixers.\n\nSimmons had a triple-double with 13 points, 13 rebounds and 11 assists and Embiid had 30 points and 12 rebounds to lead the Philadelphia 76ers past the Chicago Bulls 127-108 on Thursday night.\n\nFultz scored 12 points on 5 of 15 shooting, the most shots taken by a Sixer.\n\n\"He shot it to mean it,\" coach Brett Brown said. \"He didn't look afraid of anything. He missed the shots but they looked good.\"\n\nFultz is coming off a miserable rookie season that was shortened because of a right shoulder injury, a broken shot and busted confidence. Even his personal shooting coach said Fultz suffered from the \"yips,\" an assertion shot down on media day by the second-year guard. Fultz simply blamed his lost season on the injury. Brown tried to give Fultz a confidence boost by putting him in the starting lineup -- yet has benched him for the start of the second half.\n\nFultz was 1 of 6 in 15 minutes in the first half and didn't play again until late in the third and the Sixers leading by 88-68.\n\n\"The challenge is to grow him and help us win the game,\" Brown said. \"There's no book that tells you how to do that, so you're going to have to figure some stuff out. There will be some pain along the way and some positives.\"\n\nWith or without Fultz, the 76ers had plenty of positives after an opening-night disaster in Boston.\n\nSimmons reached a triple-double with 2:34 left in the third, the 13th of his career and the first Sixer to ever get one in the home opener. Sixers fans chanted \"Trust the Process!\" when Embiid ended the third with free throws.\n\nFultz proved a long-range ace again in the fourth -- this time with a 3! He drained his first career 3-pointer for a 108-88 lead and the Philly fans that are firmly perched in his corner went wild and again chanted his name.\n\nThe Sixers know that if they want to become legitimate Eastern Conference contenders, Fultz will have to become the star they envisioned when they drafted him.\n\n\"I'm never afraid,\" Fultz said. \"I worked hard this summer. Tonight, I didn't make a lot of them, but I'm going to keep shooting them. If I see an open shot, I'm going to go shoot it.\"\n\nHe didn't even mind when Chicago's defense sagged off him, daring him to take shots. The Bulls, not expected to win much in the East, scored a combined 35 points in the second and third quarters. Zach LaVine led the Bulls with 30 points in their season opener.\n\n\"When we started missing shots, we stopped guarding and rebounding,\" Bulls coach Fred Hoiberg said.\n\nTIP-INS\n\nBulls: G Kris Dunn missed the game for the birth of his son. ... Bobby Portis had 20 points and 11 rebounds.\n\n76ers: Rapper Meek Mill sat courtside and rang the ceremonial Liberty Bell to start the game. ... Embiid thanked the fans for coming and told them to \"Trust the Process.\"\n\n1ST Q & NO D\n\nEmbiid scored 12 points in the first 5 minutes of the game and neither team missed many looks in the first quarter. The Sixers made 11 of their first 14 shots and the Bulls started 14 of 19. The 76ers shot a whopping 70 percent in the quarter and still trailed the Bulls 41-38.\n\nUP NEXT\n\nBulls: Play home opener Saturday against Detroit.\n\n76ers: Host Orlando on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994861.601782
}