{
  "game_id": "0022300875",
  "espn_id": "401585503",
  "date": "Mar 03, 2024",
  "matchup": "TOR vs. CHA",
  "headline": "Quickley has 22 points and 11 assists as Raptors overcome Barnes' absence to beat Hornets 111-106",
  "body": "TORONTO -- — Immanuel Quickley scored 22 points and matched his season high with 11 assists, RJ Barrett had 23 points and the Toronto Raptors held on to beat Charlotte 111-106 on Sunday night for their seventh consecutive home win over the Hornets.\n\n\r\n              Gary Trent Jr. added 17 points and Ochai Agbaji had 13 points and a career-high nine rebounds as the Raptors overcame the absence of injured All-Star Scottie Barnes and the loss of center Jakob Poeltl to an injury to win for the first time in three games.\n\n\r\n              Barnes broke his left middle finger against Golden State on Friday and is out indefinitely.\n\n\r\n              “Any time somebody that plays 40 minutes a night is not in the game, I think everything changes,” Quickley said. “But you try to keep it the same as much as you can. \n\n\r\n              \"Everybody came in, chipped in, played with great effort. That’s what we’re going to need.”\n\n\r\n              Gradey Dick and Jordan Nwora each scored 11 points for Toronto, who outscored Charlotte 26-15 on fast break points.\n\n\r\n              “Transition defense was terrible,” Hornets coach Steve Clifford said with a rueful laugh. “When you’re giving up that many open 3s and layups in transition, you’re just not going to win.”\n\n\r\n              Toronto came in leading the NBA in fastbreak scoring, leaving Clifford particularly frustrated by his team’s transition performance.\n\n\r\n              “They’re first in fastbreak points in the league, so that was a big emphasis going in,” Clifford said. “It’s what we talked about this morning in the walkthrough. It was also on the board before the game. We just didn’t do it.”\n\n\r\n              Brandon Miller led Charlotte with 26 points and a career-high 10 rebounds. Miles Bridges added 20 points, but the Hornets lost their fourth straight. \n\n\r\n              Bridges missed Charlotte’s previous visit to Canada last December due to his past legal issues, but was allowed across the border this time.\n\n\r\n              Grant Williams had 18 points and 13 rebounds, Davis Bertans scored 14 points and Vasa Micic added 12 for Charlotte.\n\n\r\n              Williams said the Hornets let themselves down by not working hard enough on defense. \n\n\r\n              “It was just effort getting back,” Williams said. “It’s not like we were offensive rebounding and crashing and putting pressure on the rim. We had simple mistakes of not identifying our man in transition.”\n\n\r\n              Williams capped a personal 8-0 run to cut the gap to two at 102-100 with 1:25 left in the fourth. Bertans followed with a 3-pointer to put the Hornets in front.\n\n\r\n              Quickley made six straight shots at the line to put Toronto up 108-103 with 19.8 seconds remaining. Charlotte cut it to two again, but Trent made one of two from the line before stripping Micic near midcourt and sealing the win with a layup.\n\n\r\n              “The last play is the last play,” Clifford said. “We lost because we didn’t run back on defense.”\n\n\r\n              Agbaji made his first start for Toronto, taking the spot of the injured Barnes, the 2022 NBA Rookie of the Year. Before Sunday’s game, Raptors coach Darko Rajakovic said Barnes is still visiting specialists to decide on treatment options, adding that surgery is a possibility.\n\n\r\n              “Scottie is a big part of what we do,” Quickley said. “It takes a group effort to make up for what he does.”\n\n\r\n              Toronto’s injury woes worsened when Poeltl exited in the final minute of the first half because of a dislocated left pinkie. Kelly Olynyk started the second half in Poeltl’s place.\n\n\r\n              Rajakovic said Poeltl does not have a fracture, but said the Austrian big man was still being evaluated. Toronto’s next game is Tuesday against New Orleans.\n\n\r\n              Bridges scored 16 points in the third, but Trent had 11 for the Raptors. Toronto led 82-75 through three quarters, then opened the fourth with an 8-0 run to make it a 15-point game.\n\n\r\n              Bridges is currently serving three years of probation after pleading no contest in exchange for no jail time in a June 2022 domestic violence case involving the mother of his two children, who accused Bridges of assaulting her in front of them.\n\n\r\n              Bridges was suspended by the NBA for the first 10 games of the season after sitting out all of last season.\n\n\r\n              Charlotte’s Cody Martin was not available because of a sprained left ankle, while Seth Curry was sidelined with a sprained right ankle.\n\n\r\n              Toronto’s Bruce Brown sat because of a sore right knee.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host the Orlando Magic on Tuesday night.\n\n\r\n              Raptors: Host the New Orleans Pelicans on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995810.092248
}