{
  "game_id": "0022301143",
  "espn_id": "401585771",
  "date": "Apr 07, 2024",
  "matchup": "LAL vs. MIN",
  "headline": "Reid gets 31, Timberwolves jump on Lakers 127-117 in the absence of LeBron James, Anthony Davis",
  "body": "LOS ANGELES -- — Naz Reid hit six 3-pointers while scoring 31 points, and the Minnesota Timberwolves capitalized on LeBron James' absence and Anthony Davis' early exit with an eye injury for a 127-117 victory over the Los Angeles Lakers on Sunday night.\n\n\r\n              Anthony Edwards added 26 points for the Timberwolves, who moved even with Denver atop the Western Conference at 54-24 with their seventh win in nine games. Minnesota didn't waste its golden opportunity to beat the surging Lakers, who played most of the night without their two superstars.\n\n\r\n              James stayed home with flu-like symptoms, missing his 11th game of his 21st NBA season. Davis then went to the locker room after getting hit in the face by Kyle Anderson while scoring a tip-in basket late in the first quarter.\n\n\r\n              The nine-time All-Star didn't return to the game, and Lakers coach Darvin Ham had no postgame update on his condition. Davis took another blow to his left eye, which already was injured from a hit taken last month in a game against Golden State.\n\n\r\n              “Obviously, we caught a break there,” Minnesota coach Chris Finch said.\n\n\r\n              Minnesota blew open a tight game without Davis patrolling the middle, putting up a 46-point second quarter. Los Angeles' supporting cast kept it close in the third, but Rudy Gobert scored six of his 18 points in the fourth quarter while Minnesota comfortably held on. Gobert also had 16 rebounds.\n\n\r\n              “Offensively, we were playing the right way,” said Nickeil Alexander-Walker, who scored 15 points. “Things just opened up because their defense was lacking length, and I think for us, we just kept making the right play. Coming down the stretch, Naz was making big plays. Ant was making the right read. All the talent we have was just able to come through and make shots, make plays.”\n\n\r\n              With an opportunity to be the No. 1 seed in the West for only the second time in franchise history, Minnesota rebounded from its worst offensive performance of the season in Phoenix last Friday. The Wolves and the defending NBA champion Nuggets meet in Denver on Wednesday, with Minnesota traveling to the second game of a back-to-back.\n\n\r\n              “I think all year it’s been a goal for us,” Reid said of the No. 1 seed. ”That’s something that we hunger for, and we talk about it all the time. Obviously we want the standings to be in our favor, so we’ve got to go out and make it in our favor.”\n\n\r\n              Rui Hachimura scored 30 points for the Lakers, whose four-game winning streak ended with only their second loss in 11 games. Los Angeles also fell right back into ninth place in the ultracompetitive West after finally moving up to eighth on Saturday for the first time since late December.\n\n\r\n              “It's tough already being without Bron, and then seeing (Davis) go out, it's tough,” Ham said. “But my hat is off to our guys. They didn't feel sorry for themselves. They kept competing all the way through. Just had some unfortunate possessions offensively. Guys not having their legs up under them (after) an 11-day road trip (with) six games, come back home and have a 12:30 game Saturday.”\n\n\r\n              Backup big man Jaxson Hayes had a season-high 19 points and 10 assists while playing 33 minutes in Davis’ absence, and Spencer Dinwiddie added 18 points and seven assists for the Lakers. D'Angelo Russell struggled when Los Angeles needed a huge game from its No. 3 option, missing 14 of his 19 shots to finish with 15 points and 11 assists.\n\n\r\n              Minnesota quickly broke open a close game after Davis left, streaking to a 79-64 halftime lead with Reid scoring 18 points in the second quarter. Reid, who also grabbed 11 rebounds, racked up 46 combined points in the Wolves’ two previous meetings with the Lakers.\n\n\r\n              “I just stand out in the lights,” Reid said with a grin. “I'm sorry. I don't know. I just go out there and compete, and it just happened to be on TV.”\n\n\r\n              Along with James, the Lakers held out backup point guard Gabe Vincent, who only returned from a lengthy injury absence four games ago.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host Washington on Tuesday.\n\n\r\n              Lakers: Host Golden State on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995474.000076
}