{
  "game_id": "0021600362",
  "espn_id": "400899804",
  "date": "Dec 12, 2016",
  "matchup": "MIL @ TOR",
  "headline": "DeRozan, Ross help Raptors beat Bucks for 6th straight time",
  "body": "TORONTO --  Terrence Ross helped the Toronto Raptors put a stop to the Milwaukee Bucks' comeback effort.\n\nAfter seeing Milwaukee cut a 26-point deficit to just 10 after three quarters, the reserve swingman scored the first seven points of the fourthto key a 14-2 run and the Raptors pulled away for a 122-100 win Monday night.\n\nIt was the Raptors' sixth straight victory over the Bucks, and their 12th win in the last 13 meetings.\n\n\"We had to pick up our intensity,\" Ross said after finishing with a season-high 25 points. \"They made their push, they made their run just like everybody else is going to do, and we had to come back and make ours, and I think the second unit helped do that.\"\n\nWhile DeMar DeRozan led the way with 30 points in the victory, the Raptors benefited from strong shooting from throughout the lineup. Toronto shot 50.6 percent from the field and 56 percent from 3-point range, improving to 7-1 this season when they shoot 50 percent or better from the field.\n\nWhile acknowledging the contributions of Ross, Toronto coach Dwane Casey tipped his cap to the play of point guard Kyle Lowry, who had 18 points and seven assists, for finding the team's shooters in stride.\n\n\"Kyle's doing a good job when they're trying to blitz him and kicking it out and guys are making shots,\" Casey said. \"Like I've always said when we were struggling shooting, it's a make-or-miss league and guys are doing a good job stepping into them with conviction and taking good shots.\"\n\nAfter losing a third straight game, Milwaukee coach Jason Kidd was less than impressed. Though Giannis Antetokonmpo had 30 points, his fourth 30-point game of the season, Kidd watched as his team missed its first 13 3-point attempts and finish the game shooting 16.7 percent from beyond the arc.\n\nAfter briefly having a lead, Milwaukee gave it up at the 2:52 mark and never came close again. Kidd said his team had made it too easy for one of the NBA's best teams.\n\n\"It was easy the whole night, no matter 3s, layups, (the Raptors) were in character the whole night from the start,\" he said. \"We weren't, we just didn't put up any resistance, our defense was non-existent.\"\n\nAnd while seeing DeRozan getting 30 points is hardly new -- it was his 12th such game this season -- Jabari Parker, who had 27, said his team shouldn't be letting a player like Ross burn them.\n\n\"You can let other players get their rhythm still, but him, nothing against him, we can't let the wild card get us like that,\" he said.\n\nTIP-INS\n\nBucks: Despite making 10 or more 3-pointers in their last three games, Milwaukee was held to just 4 of 24 from beyond the arc by Toronto. ... Bucks rookie Thon Maker, who played high-school basketball in nearby Orangeville, Ontario, played his first professional game in Canada, finishing with three points and three rebounds. ... The Bucks continued their strong play in the paint. Averaging 49.2 points per game coming into the game, good for second in the league, Milwaukee had 54 points in the paint on Monday.\n\nRaptors: The Raptors improved to 10-3 against Eastern Conference opponents this season, with all three losses coming against Cleveland. ...  Toronto scored at least 100 points for the 11th straight game, the longest active streak in the NBA.\n\nTHE CURSE OF VINCE CARTER\n\n\"I don't know, man. I'm telling you, I started calling it the curse of Vince Carter. Nobody's allowed to do 2-foot windmills in the ACC until he retires, I'm guessing.\" -- Ross on rimming out on a wide-open dunk with 8:17 to play in the game.\n\nLOU WHO?\n\nWith four 3-pointers, Lowry set a new franchise record by hitting at least three from beyond the arc for the ninth consecutive game. The previous record was eight, set by his former teammate Lou Williams from March 27th to April 11th, 2015.\n\nSTATISTICAL ANOMALY?\n\n\"It is a good example of sometimes how analytics don't tell the entire story. It gives you a hint but doesn't tell the entire story because if you can explain to me how we can shoot the ball and score as well as Golden State that would be a good essay.\" -- Casey after being told that the Raptors and Warriors share the NBA lead for offensive efficiency with a rating of 114.2 points per 100 possessions.\n\nUP NEXT\n\nBucks: Host Chicago on Thursday night in the first game of a home-and-home series.\n\nRaptors: At Philadelphia on Wednesday night, looking for a 14th straight win over the 76ers.",
  "source": "espn_api",
  "crawled_at": 1764995202.987797
}