{
  "game_id": "0022000470",
  "espn_id": "401267630",
  "date": "Feb 21, 2021",
  "matchup": "ATL vs. DEN",
  "headline": "Trae Young, Clint Capela boost Hawks past Nuggets 123-115",
  "body": "ATLANTA -- — Trae Young had 35 points and 15 assists, Clint Capela added 22 points and 10 rebounds, and the Atlanta Hawks beat the Denver Nuggets 123-115 on Sunday night.\n\n\r\n                    The Hawks had lost five of six and eight of 10. The Nuggets have lost six of seven on the road.\n\n\r\n                    Jamal Murray, coming off a career-high 50 points Friday at Cleveland, led Denver with 30. Nikola Jokic, Will Barton and Monte Morris each scored 15.\n\n\r\n                    “Obviously, Jokic is a top two or three MVP,\" Capela said. “So I really challenged myself tonight to eliminate him as good as I could because I know he can have the type of game that can help his team.\"\n\n\r\n                    The Nuggets, playing their fourth game in six days, looked tired in the second half as the Hawks went up by 22 points on a 3-pointer by Young at the 2:35 mark of the third quarter. They trimmed the lead to eight with 1:14 left in the game and closed within seven with 46 seconds remaining, but got no closer.\n\n\r\n                    “It’s a long season. I don’t know how many times you have to explain it,\" Murray said. “You guys ask about if we lose games ... it’s the end of the world. It’s just basketball. Some days you lose. Some days you win. We know we can beat the teams we’re supposed to beat. We know we’ll be in the playoffs and it doesn’t matter who we’re playing. We’re going to give it our best shot.\"\n\n\r\n                    Young’s runner made it 64-54 with 32.6 seconds left before halftime, giving the Hawks their first double-digit lead and closing out a 14-4 run.\n\n\r\n                    Young hit a 33-footer to give the Hawks a 12-point lead midway through the third, and the Nuggets called timeout. Atlanta soon took a 17-point lead on Kevin Huerter’s inside basket at the 4:37 mark, and the Nuggets called another timeout. Capela followed with a reverse layup to make it a 19-point lead. \n\n\r\n                    Young, who made 11 of 13 free throws, was the catalyst at point guard.\n\n\r\n                    “I thought he did a great job of the entire floor game on both ends,\" Hawks assistant coach Nate McMillan said. “I thought he worked hard on the defensive end of the floor. He had Murray to start out the game and did a good job of just trying to work to stay in front of him, fight over the screens. Offensively we wanted to force misses and get out in transition. We were able to do that.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Michael Porter Jr. scored 10 points in the first quarter as the Nuggets shot 72.2% on 20 attempts from the field, but led just 33-27. Porter did not score the rest of the game. ... Denver was outscored 37-23 in the second. ... The Nuggets dropped to 1-10 when allowing at least 119 points. ... Jokic pulled down 10 rebounds for his league-leading 27th double-double.\n\n\r\n                    Hawks: Atlanta has won 10 of the series’ last 12 games at State Farm Arena. The Hawks are 25-5 at home against Denver since the 1989-90 season. ... Capela, the NBA’s rebounding leader, finished four under his average.\n\n\r\n                    STILL ON THE SHELF\n\n\r\n                    JaMychal Green’s right shoulder was already hurting going into the Cleveland game Friday when he got hit in the left shoulder after just 1:15 on the floor. He quickly left and couldn’t play against Atlanta.\n\n\r\n                    “I don’t think it’s going to be a long-term thing,” coach Michael Malone said. “I’m hoping maybe we can get him back sometime in the near future.”\n\n\r\n                    It appears starting guard Gary Harris will need more time off with a left adductor strain. He came back at Washington earlier in the week, but wasn’t his usual self, scoring two points and handing out one assist in 28 minutes.\n\n\r\n                    The Nuggets were also without F Paul Millsap (right knee sprain) and P.J. Dozier (hamstring).\n\n\r\n                    Atlanta was missing F De’Andre Hunter (right knee surgery), G Bogdan Bogdanovic (right knee fracture), G Kris Dunn (right ankle surgery), G Rajon Rondo (lower back pain).\n\n\r\n                    QUARANTINED\n\n\r\n                    Hawks coach Lloyd Pierce missed his third straight game, this time because the NBA ruled that COVID-19 restrictions meant he needs to stay away from the team a couple of more days. Pierce had stayed at home from two games at Boston earlier this week for the birth of his second child.\n\n\r\n                    “We thought or anticipated he would be able to return for this night’s game, but the NBA stepped in and he had to take a couple more days off,” said McMillan, who took charge for the third straight game. “He should be available, if everything goes well, for Cleveland’s game on Tuesday.”\n\n\r\n                    McMillan said Pierce had a Zoom call with the staff to go over Sunday’s game plan.\n\n\r\n                    “He’s doing great,” McMillan said. “His family’s doing good. He’s watching film and in the mix of trying to help with the baby, but he basically prepped us for the game tonight with the coaches this morning. He went through everything with us on a Zoom call because he anticipated being here tonight and unfortunately he can’t because of the protocol, but the family’s doing well.”\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Host Portland on Tuesday.\n\n\r\n                    Hawks: Visit Cleveland on Tuesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997834.1624582
}