{
  "game_id": "0021500147",
  "espn_id": "400828034",
  "date": "Nov 15, 2015",
  "matchup": "CHA vs. POR",
  "headline": "Hornets hold off Trail Blazers 106-94",
  "body": "CHARLOTTE, N.C. --  Charlotte Hornets guard Nicolas Batum didn't want to talk much about facing his old team.\n\nInstead, Batum let his game do the talking Sunday, scoring a season-high 33 points as the Hornets held off a fourth-quarter rally to beat the Portland Trail Blazers 106-94.\n\nAl Jefferson added 29 points, Kemba Walker had 14 and Jeremy Lamb 13 for Charlotte, which won its third straight home game.\n\n\"I was with that team (Portland) and that coaching staff the last three years, and they're the best team at coming back and the best coach (Terry Stotts) in the game at coming back,\" said Batum, who was traded to the Hornets during the offseason.\n\n\"I told the guys, `They're going to come back; they're not going to give up.' They were going to make a run, and they did it. We relaxed a bit too much, but we found a way to score at the end and win the game.\"\n\nDamian Lillard had 23 points, Allen Crabbe 17 and C.J. McCollum 16 for Portland, which lost its fifth straight.\n\nCharlotte shot better than 65 percent in first half in taking a 71-45 lead, and went up 82-53 on Marvin Williams' jumper with 3:37 left in the third quarter.\n\nBut the Trail Blazers, who were down 23 points at the end of the third quarter, began their comeback in the final period.\n\nLed by McCollum and Crabbe, who combined for 16 fourth-quarter points, Portland rallied to pull within 98-92 on Ed Davis' layup with 2:58 remaining.\n\nThe Hornets responded with an 8-0 run, getting two free throws each by Walker and Batum and two baskets by Jefferson to push the lead back to double digits.\n\n\"We played a terrific first half, but as it happens a lot in this league (we) just lost energy,\" Charlotte coach Steve Clifford said. \"(Portland) is well coached, and they can score. They stayed with the game and they gave themselves a chance to win.\n\n\"(But) Nic (Batum) made two big plays and Al had a big jumper. That was an important win.\"\n\nBehind Batum, Jefferson and Lamb, the Hornets pulled ahead 35-27 by the end of the first quarter, then outscored the Trail Blazers 36-18 in the second quarter on the way to a 26-point halftime lead.\n\nCharlotte opened the second quarter with a 15-1 run over the first 6 minutes. That gave the Hornets their first 20-point lead on Jefferson's free throw with 6:09 left.\n\n\"We didn't take away much of what Charlotte wanted to do, whether it was individually or collectively,\" Stotts said. \"I don't think we gave it as much effort as we needed. I don't think we were as focused mentally. Those two things combined created a downward spiral.\"\n\nTIP-INS\n\nTrail Blazers: Finished with 12 turnovers, giving the Hornets 17 points. . Had a 46-37 rebounding advantage, led by Mason Plumlee with 13.\n\nHornets: Jefferson scored more points in the first half (20) than he had in the previous three games combined (19). . Batum had five rebounds and six assists.\n\nHOMECOMING\n\nFormer Hornets Gerald Henderson and Noah Vonleh played their first game at Time Warner Cable Arena since their offseason trade to the Trail Blazers for Batum. Vonleh, who started for the first time in his career, finished with nine points and six rebounds in nearly 24 minutes. Henderson, a starter at Charlotte for six seasons, went scoreless in 6 1/2 minutes.\n\nINJURY REPORT\n\nHornets forward P.J. Hairston went out of the game with a contusion on his right leg midway through the second quarter, and did not return.\n\nVIVE LA FRANCE\n\nA moment of silence was held before Sunday's game for the victims of the Paris terrorist attacks, and the French national anthem \"La Marseillaise\" was played before the Star Spangled Banner.\n\nUP NEXT\n\nTrail Blazers: Visit San Antonio on Monday.\n\nHornets: Visit New York on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994412.8035781
}