{
  "game_id": "0022400571",
  "espn_id": "401705137",
  "date": "Jan 15, 2025",
  "matchup": "BKN @ LAC",
  "headline": "Clippers rout Nets 126-67 for largest margin of victory in team history",
  "body": "INGLEWOOD, Calif. -- — Kawhi Leonard scored 23 points, James Harden added 21 and the Los Angeles Clippers had the largest margin of victory in franchise history, routing the Brooklyn Nets 126-67 on Wednesday night.\n\n\r\n              The Clippers broke the team margin mark of 50 against Oklahoma City on April 10, 2022. It also was the worst loss in Nets' history, eclipsing a 52-point defeat to Houston on Oct. 18, 1978.\n\n\r\n              LA's largest lead was 64 points midway through the fourth quarter, despite coach Tyronn Lue emptying his bench late in the third quarter.\n\n\r\n              Leonard logged a season-high 24 minutes as he took part in his fourth game since coming back from a knee injury. \n\n\r\n              Jalen Wilson led the Nets with 16 points and Day’Ron Sharpe had 12. Brooklyn has dropped five of six.\n\n\r\n              Norman Powell added 18 points for the Clippers, who led 58-35 at halftime before opening the third quarter with by scoring the first 13 points en route to a 29-3 run. At the end of the quarter, LA had a 102-51 advantage.\n\n\r\n              Takeaways\r\n              Nets: Noah Clowney was ejected with 9:55 remaining in the fourth quarter after picking up his second technical foul. \n\n\r\n              Clippers: Terance Mann did not play in the second half due to left calf soreness. Mann scored five points in eight minutes during the first half.\n\n\r\n              Key moment\r\n              The Clippers trailed 25-24 with 10:07 remaining in the second quarter before going on a 21-4 run over the next 5:35. Leonard scored eight points and Amir Coffey five as LA took control. \n\n\r\n              Key stat\r\n              The Clippers shot 54.4% from the field (43 of 79) while the Nets were at 30.5% (25 of 82), including 5 of 27 on 3-pointers.\n\n\r\n              Up next\r\n              The Clippers are at Portland on Thursday night, while the Nets remain in Southern California to face the Lakers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997983.8591402
}