{
  "game_id": "0021500359",
  "espn_id": "400828246",
  "date": "Dec 14, 2015",
  "matchup": "DET vs. LAC",
  "headline": "Crawford's late 3 in overtime lifts Clippers over Pistons",
  "body": "AUBURN HILLS, Mich. --  Doc Rivers considers himself a fairly good NBA coach, but he wasn't even going to pretend that he was responsible for the Los Angeles Clippers' 105-103 overtime win against the Detroit Pistons on Monday night.\n\n\"That was crazy,\" he said of the game's finish. \"I have to tell you that the players won this, because I screwed this game up more than you know. The two biggest plays we got came when they talked me out of the play I wanted to call.\"\n\nThe first big play came when J.J. Redick hit a tying 3-pointer with 19.6 seconds left in overtime.\n\n\"I don't know if Doc is trying to deflect credit, but our coaching staff made a lot of cerebral calls tonight,\" Redick said. \"The play was for me to get a three or Blake (Griffin) to get a layup. I saw Blake look to the corner, and I wasn't there yet, but he trusted I would get there.\"\n\nDetroit's Reggie Jackson missed at the buzzer, forcing overtime, and neither team was able to take control.\n\nKentavious Caldwell-Pope made 1 of 2 foul shots with 30.5 seconds left to tie it for the Pistons. Jamal Crawford took a pass from Griffin and hit a 3-pointer from the left wing with 12.4 seconds to go.\n\n\"After they scored the first time, I let them change the play the second time, too,\" Rivers said. \"They were so into the game that they had a great feel.\"\n\nPistons coach Stan Van Gundy was furious with Andre Drummond, who gambled on the play to try for a steal and instead left Crawford all alone.\n\n\"I have no idea what he was thinking, but it was certainly not anything that was part of our defensive plan,\" Van Gundy said. \"He ran out to the free throw line, which meant Marcus (Morris) had to sink back into the lane to guard the rim. That's just undisciplined panic.\"\n\nWith the Pistons needing three, the Clippers fouled Jackson with 9.3 seconds left, setting off a chaotic finish.\n\nJackson made the first shot, but missed the second. The ball dropped right to Drummond, who missed a point-blank put back, then tipped the miss too hard.\n\nJackson managed to get his hands on the ball twice, but missed a short jumper and ended up hitting the top of the backboard with a desperation shot at the buzzer.\n\n\"We were thinking we were going to get double-OT, but the ball wouldn't go in,\" Jackson said. \"I got a good look, but it didn't drop and then I was just trying to make something happen.\"\n\nGriffin finished with 34 points for the Clippers, Redick had 24 and Chris Paul put up 13 points and 12 assists.\n\nJackson finished with 34 points, 11 rebounds and seven assists. Drummond added 20 points and 15 rebounds.\n\nDetroit led 91-89 in the last minute and Jackson added a pair of free throws to make it a four-point game with 33 seconds to go. Crawford hit two free throws, and Redick immediately fouled Drummond by jumping on him piggy-back style while the second shot was in the air.\n\n\"The rule is that once the ball is in the air, Andre is part of the play because he's going for a rebound,\" Van Gundy said. \"It's my fault -- I shouldn't have had him on the floor.\"\n\nDrummond, who came into the game shooting 36.6 percent from the foul line, made one of two for a 94-91 edge with 25.5 seconds left. The strategy worked as Redick hit a 3-pointer with 19.6 seconds left, tying the game.\n\nJackson ran the clock down, but missed a 15-footer over Griffin at the buzzer.\n\nThe Clippers led 73-63 at the end of the third period. Jackson's 3 gave the Pistons its first lead of the game with 6:42 to play.\n\nLos Angeles missed 10 of its first 12 fourth-quarter shots. Griffin ended the streak with a vicious baseline dunk.\n\nCaldwell-Pope, who played the entire second half and overtime, hit a 3-pointer to put the Pistons up 87-81 with three minutes left.\n\nTIP-INS\n\nClippers: Josh Smith, still reviled in Detroit for his poor tenure with the Pistons, was loudly booed when he entered the game and every time he touched the ball.\n\nPistons: Van Gundy picked up a rare technical for arguing a first-half call. ... Six Pistons had one assist each in the first half while Detroit's front court went 3 for 17 from the floor.\n\nUP NEXT\n\nClippers: Host the Bucks on Wednesday.\n\nPistons: Host the Celtics on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994942.65067
}