{
  "game_id": "0021400430",
  "espn_id": "400578722",
  "date": "Dec 25, 2014",
  "matchup": "CHI vs. LAL",
  "headline": "Pau Gasol's big night fuels Bulls' win over Kobe Bryant-less Lakers",
  "body": "CHICAGO -- There was no getting around it for Pau Gasol, no denying this was one strange and emotional night.\nHe put those feelings aside and delivered another strong performance.\nGasol had 23 points and 13 rebounds against his former team, and the Chicago Bulls beat Los Angeles 113-93 on Thursday with Lakers star Kobe Bryant resting his sore body.\n\"It's weird. Obviously, it's an emotional game because you find yourself on the opposite side of the team that you played for for so many years and we've been through so much,\" Gasol said.\n\nHe helped Bryant lead the Lakers to two championships during his six-plus seasons in Los Angeles. Gasol left for Chicago in the summer, hoping to make another run at a title, despite Bryant's pleas to stay. And on nights like these, it's not hard to envision the Bulls advancing in the playoffs.\nJimmy Butler scored 21 points, and Derrick Rose added 20 points and six assists to help the Bulls win their season-high fifth straight.\nWith Bryant missing his second straight game, the Lakers were unable to pull off another upset. They stunned Golden State on Tuesday night but came up short against the Central division leaders.\nThe Bulls hung on after a 16-point second-quarter lead dwindled to two in the third. Chicago outscored the Lakers 30-16 in the fourth, sending them to their fourth loss in five games.\nGasol was 9 of 14 from the field in his first game against Los Angeles as a Bull.\nNikola Mirotic and Aaron Brooks each came off the bench to score 13 points, and the Bulls outrebounded the Lakers 57-39.\nIt didn't hurt that Bryant was watching from the sideline in a dark red jacket even if the Lakers were coming off a big victory without him.\nCarlos Boozer scored 14 points and got booed in his return to Chicago, as he often did during his four seasons with the Bulls. The Bulls used the amnesty clause to cut him last summer and create the salary-cap space to bring in Gasol and add depth to the roster.\n\"It was weird playing against them,\" Boozer said. \"They were like my brothers out there, but at some point you have to put the emotions and feeling aside and try to win a basketball game.\"\nWesley Johnson led Los Angeles with 19 points. Ed Davis added 13 points and 14 rebounds. Jordan Hill finished with 16 points, but the Lakers shot about 39 percent overall and went 5 of 16 from 3-point range.\nThey will likely have to go without Bryant again when they visit Dallas on Friday night.\nBryant said his knees Achilles tendons, feet and back were all bothering him, and it is unlikely he will play against the Mavericks.\nThe 36-year-old Bryant, in his 19th NBA season, entered Thursday third in the league in scoring at 24.6 points per game. He passed Michael Jordan for third place on the career scoring list Dec. 14 at Minnesota.\n\"He's like a brother to me,\" said Gasol, who spent a few hours with Bryant on Wednesday.\nThe Bulls looked as if they were on their way to an easy victory up 16 in the second, but an 11-point halftime lead quickly shrunk to two when Los Angeles started the third on an 11-2 run. Chicago was up 81-77 in the closing seconds when Gasol drove for a layup to start a 10-2 run that bumped it back up to 12 early in the fourth.\n\"I think that right now there is a belief, a lot more than there was a couple of weeks ago,\" Joakim Noah said. \"As a player, there's nothing better than that belief that when we're on and we're competing nobody can mess with us. That's the feeling we're starting to get.\"\nTIP-INS\nLakers: Bryant said Jordan had a simple message after he passed him on the NBA's scoring list. \"Go get Karl,\" Bryant said referring to Karl Malone. The former Utah great is second with 36,928 points. Bryant has 32,365.\nBryant on passing Jordan on the NBA's scoring list: \"It was more of a thankful feeling to Michael and the players came before because I've learned so much from them. And I don't say that lightly. I've literally just stole (stuff) from them -- like spin moves and pull-ups. It's not me passing these players. It's us. I've literally taken things from their games and made them my own.\"\nBulls: G Kirk Hinrich missed his second straight game because of tendinitis in his left knee and remains day to day.\nUP NEXT\nLakers: Visit Dallas on Friday night.\nBulls: Play New Orleans at home on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764991699.623699
}