{
  "game_id": "0021501057",
  "espn_id": "400828944",
  "date": "Mar 23, 2016",
  "matchup": "TOR @ BOS",
  "headline": "Thomas scores 23, Celtics beat Raptors 91-79 as Lowry rests",
  "body": "BOSTON -- With a late-season losing streak barely behind them, the Boston Celtics entered their final regular-season matchup with Toronto searching for a statement win.\nThe Celtics not only got it, but may have grabbed just the momentum boost they craved with a pivotal five-game road trip looming.\nIsaiah Thomas scored 23 points, Evan Turner added 17 and the Celtics beat the Raptors 91-79 on Wednesday night.\n\nAvery Bradley finished with 16 points and eight rebounds as the Celtics won their third consecutive game and first this season over one of the Eastern Conference's best teams.\n\"It's big,\" Thomas said. \"We wanted some confidence and momentum going into this tough West Coast trip and we got it. We wanted these three games and we got them.\"\nBoston had what had been an eight-point lead at the start of the fourth quarter cut to a point. But the Celtics responded with a 10-4 run to get the separation they needed to close it out.\nDeMar DeRozan led the Raptors with 21 points. Point guard Kyle Lowry sat out, resting a sore right elbow.\nToronto had a four-game winning streak snapped and fell 2 1/2 games behind Cleveland for the best record in the Eastern Conference. But the Raptors still clinched their third consecutive playoff berth thanks to a loss by Chicago.\nThat was little consolation for Toronto coach Dwane Casey.\n\"They beat us. They spanked us,\" Casey said. \"We talked about how good of a team they are if we don't play with force. When you don't play with force you're going to have trouble scoring, and we had trouble scoring.\"\nIn addition to Lowry, Toronto also played without forward Patrick Patterson, who missed his second straight game with a sore left ankle. The Celtics remained without starting forward Jae Crowder as he recovers from a right ankle sprain.\nToronto trailed 69-58 late in the third quarter before using a 10-0 run to get back into the game. The Celtics missed eight straight shots during the run.\nBut Boston responded with its 10-4 spurt, getting its lead back up to 79-72.\nThe first half was tight throughout, with 10 lead changes and neither team holding more than a three-point lead.\nThe victory ensured the Celtics will finish with at least a .500 record -- its first since coach Brad Stevens took over three years ago.\n\"I feel like there's real progress. And it's pretty consistent progress,\" Stevens said. \"But...you don't sign up to come to the Boston Celtics to win 42 games. So we've got a long way to go.\"\nTIP-INS\nRaptors: Loss ends a franchise-record streak of 33 straight wins when holding a team under 100 points. ... Shot just 34 percent from the field (31 of 89). ...Was 6 of 22 from the 3-point line.\nCeltics: Thomas has scored 20 or more points in 11 straight games. ... Boston has won 16 of 18 at home. ... Crowder missed his sixth straight game.\nRESTING UP\nCasey isn't above resting his players heading into the final month of the season. In fact, he will prioritize that over anything that has to do with the standings. \"Health is more important,\" Casey said. \"I think we are all fighting for it, but if it comes between a guy fighting a sore ankle, a sore calf, a sore knee or whatever fighting for that spot. My team's health is more important than putting him out there and maybe further damaging him.\"\nSHOOTING WOES\nMarcus Smart continues to struggle with his shot. One of the offensive anchors of the second unit, Smart was 1 for 8 from the field against the Raptors. He is now just 16 for 62 in his last six games.\nINJURY UPDATE\nStevens said the plan is still for Crowder to travel with the team on its upcoming five-game road trip. But he said Crowder isn't expected to be available during the early part of it. Crowder was able to do some light shooting prior to Wednesday's game.\nCELEBRITY WATCH\nActor Mark Wahlberg, a native of nearby Dorchester, sat courtside.\nMOMENT OF SILENCE\nThere was a pregame moment of a silence in honor of the victims of Tuesday's terrorist attacks in Brussels, Belgium.\nUP NEXT\nRaptors: Visit Houston on Friday.\nCeltics: Visit Phoenix on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994696.345855
}