{
  "game_id": "0022000231",
  "espn_id": "401267391",
  "date": "Jan 22, 2021",
  "matchup": "IND vs. ORL",
  "headline": "Brogdon's 3-pointer lifts Pacers past Magic 120-118 in OT",
  "body": "INDIANAPOLIS -- — When Malcolm Brogdon caught a pass from Doug McDermott on the right wing in the waning seconds of overtime, he didn't hesitate to launch the deep shot.\n\n\r\n                    “I like to take big shots,” Brogdon said. “My teammates and coaches trust me to take shots. I trust myself to take big shots. I knew where shot clock was, so I just shot the ball.”\n\n\r\n                    Brogdon hit the decisive 3-pointer with 2.8 seconds left in the extra period and calmly accepted his teammates' congratulations for lifting the Indiana Pacers to a 120-118 win over the Orlando Magic on Friday night.\n\n\r\n                    Evan Fournier’s 3-point attempt bounced off the rim at the buzzer for Orlando.\n\n\r\n                    Brogdon led the Pacers with 23 points. Jeremy Lamb and Myles Turner each scored 22 points, and Domantas Sabonis contributed 18 points, 11 rebounds and nine assists.\n\n\r\n                    Turner, who had missed the last two games with a right hand injury, started cramping in the fourth quarter.\n\n\r\n                    “It was frustrating not being out there in OT, but I think it was for the better,” Turner said.\n\n\r\n                    Fournier scored 26 points for the Magic. Nikola Vucevic had 24 points and 12 rebounds.\n\n\r\n                    “Both teams battled,” Vucevic said. “They just made one more play than we did. Evan made some big shots. His last shot went in and out.”\n\n\r\n                    The Magic went ahead 115-110 early in the overtime period. Brogdon appeared to tie it at 115 on a 3-pointer, but after a timeout, officials ruled he had stepped out of bounds.\n\n\r\n                    Indiana made the stops it needed down the stretch. Fournier missed a 3-point attempt with the Magic clinging to a one-point lead, setting up Brogdon’s big shot.\n\n\r\n                    Sabonis converted from in close to tie the game at 108 with 10.7 seconds left in regulation, and the Magic turned the ball over, sending it to overtime.\n\n\r\n                    “Our guys didn’t quit. They found themselves down in the fourth and found themselves down in overtime and kept coming back,” Pacers coach Nate Bjorkgren said. “The game was full of highs and lows.”\n\n\r\n                    There were 17 lead changes and nine ties. Indiana’s 37-28 lead at the end of the first quarter was the biggest advantage for either team.\n\n\r\n                    Aaron Gordon said the Magic made too many key turnovers, including crucial one by him at the end of regulation.\n\n\r\n                    “That was rough,” Gordon said. “We had plenty of opportunities to win that game and we didn’t. We had it and we felt like we gave it away.”\n\n\r\n                    The Pacers scored 25 points off 14 turnovers, while Orlando scored just nine points off 10 Pacers turnovers.\n\n\r\n                    Gordon, who had 17 points and nine assists, sad it didn’t help that Orlando was 15 of 24 from the free-throw line.\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Michael Carter-Williams missed a ninth consecutive game with a left foot sprain.\n\n\r\n                    Pacers: Lamb played his second game since returning from a left ACL tear he suffered on Feb. 23, 2020.\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Host Charlotte on Sunday night and again on Monday night.\n\n\r\n                    Pacers: Host Toronto on Sunday night in the opener of a back-to-back with the Raptors.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997155.826941
}