{
  "game_id": "0022400502",
  "espn_id": "401705068",
  "date": "Jan 07, 2025",
  "matchup": "CHA vs. PHX",
  "headline": "LaMelo Ball scores 32 points as Hornets defeat Suns 115-104 to snap 10-game losing streak",
  "body": "CHARLOTTE, N.C. -- — LaMelo Ball had 32 points and 10 rebounds, Miles Bridges added 21 points and the Charlotte Hornets snapped a 10-game losing streak with a 115-104 win over the Phoenix Suns on Tuesday night.\n\n\r\n              Nick Richards added 15 points and 12 rebounds off the bench for Charlotte (8-27).\n\n\r\n              Devin Booker had 39 points and 10 assists and Kevin Durant added 26 points for the Suns (16-19), who’ve lost five of their last six.\n\n\r\n              The Hornets took a 13-point lead at the half after outscoring the Suns 37-17 in the second quarter behind 10 points from Ball, who was scoreless in the first quarter. Ball scored 29 points in the second half on 8-of-15 shooting, including four 3-pointers.\n\n\r\n              Charlotte dominated Phoenix on the glass, outrebound the Suns 59-42.\n\n\r\n              Takeaways\r\n              Suns: Phoenix started strong, but seemed to tire quickly playing on the second night of a back-to-back and couldn't find any scoring options outside of Durant and Booker. Bradley Beal was limited to 10 points on 5-of-13 shooting and missed an open layup at the end of the first quarter.\n\n\r\n              Hornets: This was only the third game this season — and first time for back-to-back games — the Hornets have had all five starters on the floor together. Charlotte's starting five finally seemed to gel late in the second quarter when there was good ball movement that created open shots. \n\n\r\n              Key moment\r\n              Leading by eight, Ball drew in two defenders and dished to an open Brandon Miller, who knocked down a wide-open 3-pointer from the corner to put the Hornets up by 11 with 1:21 left in the game.\n\n\r\n              Key stat\r\n              1 — Number of games the Hornets had won since Thanksgiving entering the night.\n\n\r\n              Up next\r\n              Both teams are in action Thursday night with the Suns hosting the Hawks, and the Hornets visiting the Lakers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997451.1134028
}