{
  "game_id": "0021500122",
  "espn_id": "400828009",
  "date": "Nov 11, 2015",
  "matchup": "DET @ SAC",
  "headline": "Cousins, Rondo help Kings beat Pistons to stop 6-game skid",
  "body": "SACRAMENTO, Calif. -- The Sacramento Kings shook off a drama-filled day and then shook off one more thing: a painful six-game losing streak.\nDeMarcus Cousins had 33 points and nine rebounds, Rajon Rondo had a triple-double, and the Kings didn't resemble a team in turmoil in beating the Detroit Pistons 101-92 on Wednesday night.\nEarlier in the day, a report surfaced that coach George Karl wanted to suspend Cousins for two games after the All-Star center yelled profanity at the veteran coach following Monday's loss to San Antonio. Late in the afternoon, Cousins issued an apology.\nThe developments followed a coach-player team meeting Tuesday that was also attended by upper management, including general manager Vlade Divac.\nPerhaps the biggest issue with the Kings was they were off to a 1-7 start, their worst since going 1-13 in 1990-91.\n\"I'm not sure a panic button was pushed as you all magnified it,\" Karl said. \"Team meetings and a six-game losing streaks happen. The newness to our team? I don't know. But I thought the last two days have been good for us.\"\nCousins, who was in the center of the controversy, produced his most productive game offensively this season.\n\"The best thing that came out of the meeting? This win,\" Cousins said. \"But I'll take the hit. If it results from this every night, I'll take the hit and I'll be the scapegoat.\"\nStruggling through the first eight games when he shot just under 40 percent, Rudy Gay made his first five shots and scored 12 of his 25 points in the first quarter for the Kings. Gay made 10 of 14 shots and added six rebounds and three assists.\n\"I feel like the lid finally came off the rim,\" Gay said.\nReggie Jackson and Marcus Morris both had 16 points for Detroit, which was outscored 36-23 in its second straight loss on a six-game road trip. Kentavious Caldwell-Pope added 15 points and Andre Drummond had 14 points and 17 rebounds.\n\"We didn't come out ready to play,' coach Stan Van Gundy said. \"I don't think they made any tough shots in the first half. We made it easy for them.\"\nCousins scored 15 points in the first quarter and was difficult to stop all game. He hit four 3-pointers and 11 of 21 shots in playing his most efficient offensive game of the young season.\n\"I didn't mind that we didn't come out and defend Cousins on the first 3,\" Van Gundy said. \"But we needed to make adjustments after that and we never did.\"\nAhead by five points, the Kings made seven of eight free throws to stretch the lead to 101-89 with just over a minute to play.\nDown by a high of 19 points late in the third quarter, the Pistons pulled within 94-89 when Jackson made a 3-pointer and followed with a driving layup with 3:59 remaining.\nRondo helped keep the Kings' offense running smoothly in the third quarter. He had seven points and five assists as Sacramento took an 86-70 lead into the fourth.\nCousins scored 23 points and Gay had 19 in an opening half when the Kings looked totally in sync, shooting 64 percent and leading 61-49.\nA STIRLING TRIBUTE\nGordon \"Scotty\" Stirling, who worked in a number of capacities for the Kings, including director of scouting, died Wednesday morning in Sacramento. The Kings held a moment of silence for Stirling before the game and later aired some tributes from various people in the Sacramento organization.\nTIP-INS\nPistons: Drummond was no factor in the first half, getting two points and four rebounds. ... The Pistons missed 23 of 32 3s.\nKings: Cousins was 4 of 5 on 3-pointers in the season opener, but had missed his previous nine before he regained the long range touch against the Pistons. ... It was Rondo's second triple-double of the season and the 24th of his career. . The Kings used the same starting lineup in back-to-back games for the first time all season.\nUP NEXT\nPistons: Visit the Clippers on Saturday.\nKings: Host Brooklyn on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994956.282454
}