{
  "game_id": "0022200137",
  "espn_id": "401468292",
  "date": "Nov 05, 2022",
  "matchup": "MIN vs. HOU",
  "headline": "No Gobert; Towns leads Wolves to 129-117 win over Rockets",
  "body": "MINNEAPOLIS -- — Karl-Anthony Towns scored 10 of his 25 points in the third quarter and Anthony Edwards added 19 points as the Minnesota Timberwolves cruised to a 129-117 win against the Houston Rockets on Saturday night.\n\n\r\n              Playing without center Rudy Gobert, who was placed into the league’s health and safety protocols earlier in the day, Minnesota snapped a three-game losing streak. Kyle Anderson had 16 points while starting for Gobert.\n\n\r\n              “We did a great job in the second quarter of showing what we could be when we’re all locked in,” Towns said. “Just good game, good way to win. Proud of our guys bouncing back from a tough game yesterday and playing with the intensity needed.”\n\n\r\n              Minnesota closed the first half on a 20-4 run and never looked back, extending Houston’s tough start to the season.\n\n\r\n              The Rockets, who were without rookie Jabari Smith Jr. due to an illness, lost their sixth straight game. Houston is 1-9 this season and has trailed by double-digits in nine of its 10 games.\n\n\r\n              “Our defense wasn’t very good at all tonight,” Rockets coach Stephen Silas said. “It was right from the very start. One of our main things was protecting the paint and we didn’t do it, especially early. We’ve been talking a lot about our ball movement and our execution, and the turnovers obviously hurt us. But it was the defensive end that I wasn’t proud of tonight.”\n\n\r\n              Jalen Green had 21 points for the Rockets, hitting 4 of 11 from 3-point territory. Kevin Porter Jr. scored 13 and Alperen Sengun had 17 points for Houston, which had a season-high 23 turnovers leading to 36 points for the Timberwolves.\n\n\r\n              The young Rockets started quickly, hitting six of their first seven shots, including a 4-of-5 mark from 3, and held a lead in the first quarter.\n\n\r\n              “We start good, I think,” Sengun said. “But second quarter, we lose our focus and then we did easy turnovers.”\n\n\r\n              The shots started to miss the mark and the turnovers increased. Houston shot 11 of 16 in the first and was 7 of 11 from the 3, but the turnovers allowed Minnesota to take control.\n\n\r\n              The Rockets had 15 turnovers at half as the Wolves made their run, scoring 27 points off turnovers and finishing the half with 13 fast-break points.\n\n\r\n              “Yeah we talked about it, them being a high turnover team, trying to take advantage of it,” Minnesota coach Chris Finch said. “I thought it was one of our better transition games for that purpose. We still, I thought, didn’t convert that great in transition overall, but we were able to create enough opportunities to do so.”\n\n\r\n              PATIENCE NEEDED\n\n\r\n              It’s been an adjustment for the Wolves this season after the offseason trade for Gobert and adding Anderson. Perhaps Minnesota can take solace in recovering from a slow start last season when they finished 47-36, making the playoffs.\n\n\r\n              “It’s a process,” guard D’Angelo Russell said. “I don’t care what team is out there, it’s a process to get to where you want to be. Preseason and training camp…it matters. It gets you in that rhythm. So, for us, we didn’t have that. So, we’re starting from somewhere and this is a great place to start.”\n\n\r\n              MAKING THE SWITCH\n\n\r\n              Silas said the high number of turnovers were due to Houston not handling Minnesota’s switching defense.\n\n\r\n              “Early in the game they weren’t switching and we were getting the ball moving,” Silas said. “And then they started switching and that’s when the ball stopped moving quite as much. We have to do a better job of being switched.”\n\n\r\n              TIP-INS\n\n\r\n              Rockets: KJ Martin started for Smith and had 17 points. … Houston continues to be without Bruno Fernando (left knee soreness), Jae’Sean Tate (right ankle soreness) and TyTy Washington (left knee sprain). … The Rockets are 0-7 on the road this season. … It’s the fifth time this season Houston has allowed 124 points or more.\n\n\r\n              Timberwolves: Minnesota shot 61.3% from the field, its second-highest mark in a game this season. Its 15 made 3s were the second most this season. … The Wolves had 60 points in the paint.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Play at Orlando on Monday.\n\n\r\n              Timberwolves: Host the New York Knicks on Monday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995188.44092
}