{
  "game_id": "0021800254",
  "espn_id": "401070935",
  "date": "Nov 21, 2018",
  "matchup": "TOR @ ATL",
  "headline": "Lowry's triple-double leads Raptors, Carter gets milestone",
  "body": "ATLANTA --  Vince Carter grabbed his career milestone with a last-second dunk -- long after his first NBA team had the victory secured.\n\nKyle Lowry scored 21 points during his first triple-double of the season and the Toronto Raptors never trailed while beating the reeling Atlanta Hawks 124-108 on Wednesday night.\n\nThe night's final bow belonged to Carter, whose jam with less than a second remaining pushed him past 25,000 career points. He became the 22nd NBA player to reach the milestone and then tossed some love toward the Raptors.\n\n\"I'm very thankful for every team that I've played for,\" Carter said. \"... But there's nothing like your first.\"\n\nCarter, who played his first seven seasons with Toronto, began the night 13 points shy of the mark. The Hawks were pulling for Carter, in his 21st season, to reach the milestone against his former team. After the game, Carter's teammates were like fans looking for souvenirs.\n\n\"All the guys tried to take everything I own,\" Carter said. \"All my backup shoes are gone now.\"\n\nCarter, 41, didn't seem to mind.\n\n\"I still love it,\" he said. \"I still love playing. And I'm willing to do whatever it takes to do it.\"\n\nCarter sank a 3-pointer with less than two minutes remaining and, clearly aiming for the milestone, missed two more 3s before being fouled with 33.9 seconds remaining.\n\nCarter pulled with one point of 25,000 when he sank two free throws after a video review overruled the original call he was fouled on a 3-pointer. On Atlanta's final possession, he missed a jumper before rookie Kevin Huerter grabbed the rebound and passed back to Carter, setting up the buzzer-beating jam.\n\nCarter's 14 points gave him 25,001 for his career.\n\nPlayers from both teams hugged Carter at midcourt.\n\n\"He earned it,\" Lowry said. \"It's awesome to do it against the team he started with.\"\n\nAdded Toronto's Fred VanVleet: \"Vince has changed the game for every kid growing up.\"\n\nLowry had 17 assists and 12 rebounds for his 13th career triple-double.\n\nJonas Valanciunas had season-high totals of 24 points and 13 rebounds for the Raptors (15-4).\n\n\"That was kind of fun,\" Valanciunas said before giving credit to Lowry. \"It's easy to play with this kind of point guard.\"\n\nPascal Siakam had 22 points.\n\nJeremy Lin scored 26 points off the bench for the Hawks (3-15), who have lost nine straight since their last win against Miami on Nov. 3.\n\nAtlanta's only starter to score in double figures was Taurean Prince with 12 points.\n\nThe teams combined to miss 14 straight shots from the field to open the game before Lowry finally sank a jumper. He followed up with a 3-pointer, and the Raptors never lost the lead.\n\nThe Raptors led 55-44 at halftime.\n\nToronto stretched the lead to 20 points for the first time at 100-80 on Danny Green's 3-pointer midway through the final period.\n\nCarter's milestone was popular with players for both teams.\n\n\"I would love for him to do it tonight but Vince is going to play the game the right way and do what he's supposed to do and he's going to worry about that as it happens,\" said Hawks coach Lloyd Pierce before the game. \"... I know this is his former team. I know it would have another added boost to it, being against Toronto, adding a milestone that is a great accomplishment and a testament to his 21 years.\"\n\nTIP-INS\n\nRaptors: OG Anunoby (sprained right wrist) and C.J. Miles (right adductor strain) did not play. ... The Raptors improved to 8-2 on the road.\n\nHawks: Alex Len (sore back) and Omari Spellman (right hip adductor) did not play. ... Atlanta's bench outscored the starters 16-8 in the first period and 72-36 for the game. \"We just struggled,\" said Pierce of the starters. \"We just needed to get some new life, new energy.\"\n\nREST FOR LEONARD\n\nThe Raptors rested top scorer Kawhi Leonard on the second day of back-to-back games. That has been the standard practice with Leonard, but coach Nick Nurse said \"we're getting closer\" to Leonard playing in consecutive days.\n\nNO FOUL\n\nLowry left the game with a bloody nose with 4:09 remaining. No foul was called, despite his protests to officials as he held a towel to his face. He returned to the game.\n\nUP NEXT\n\nRaptors: Host Washington on Friday night.\n\nHawks: Host Boston on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994122.425461
}