{
  "game_id": "0022201063",
  "espn_id": "401469218",
  "date": "Mar 19, 2023",
  "matchup": "DEN @ BKN",
  "headline": "Jokic, Porter, Murray power Nuggets to 108-102 win over Nets",
  "body": "NEW YORK -- — Nikola Jokic had 22 points, 17 rebounds and 10 assists in his 28th triple-double of the season, Michael Porter Jr. had 28 points and nine rebounds, and the Denver Nuggets beat the Brooklyn Nets 108-102 on Sunday.\n\n\r\n              Jamal Murray scored 20 of his 25 points in the first quarter for the Nuggets, who looked nothing like the slumping team that had dropped five of six. Denver shot 62.5% in the first half and led comfortably most of the game while playing for the second straight afternoon. \n\n\r\n              “Obviously we were 1-5 in our last six, not playing up to our abilities, so just to get the win is the thing I’m most proud of,” Nuggets coach Michael Malone said. \n\n\r\n              He was disappointed that the Nuggets let a 20-point lead after three quarters get cut to 100-93 with 3:44 to play. Porter answered with one of his five 3-pointers, and the Nuggets got the lead back up to 14 before the Nets had a couple more late baskets. \n\n\r\n              Mikal Bridges scored 23 points and Nic Claxton had 19 for the Nets, who have lost three straight as they try to hold onto a top-six seed and a guaranteed postseason spot in the Eastern Conference.\n\n\r\n              They pulled out a 122-120 victory in Denver a week earlier, but the Western Conference leaders made sure there would be no repeat. \n\n\r\n              Murray knocked down consecutive 3-pointers to finish a 10-0 run that pushed a three-point lead to 25-12 and his final basket of the first quarter made it 33-21. He was 4 for 4 behind the arc in the period.\n\n\r\n              The Nets had a good burst to trim it to 42-38 in the second, but Jokic followed with two straight baskets, Porter and Murray combined for Denver’s final 12 points and it was 63-48 at the break.\n\n\r\n              “Came out strong, came out aggressively and we did a good job for the most part of holding the lead and just keeping them at bay,” Murray said. \n\n\r\n              The Nets got the deficit down to 12 late in the third quarter before Jokic powered his way to the final eight points of the period, making it 91-71.\n\n\r\n              The lead reached 98-76 before the Nets stormed back with a 17-2 spurt, and they could have gotten even closer before some late missed jumpers.\n\n\r\n              “There were some opportunities. We had good looks to shave the lead a little bit, just didn’t go in for us tonight,” coach Jacque Vaughn said. \n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Bruce Brown, who spent the previous two seasons with the Nets, was cheered after a video tribute following the first quarter. ... Zeke Nnaji, who didn't play in the 16 games after spraining his right shoulder, had four points and five rebounds in his first appearance since Feb. 5. \n\n\r\n              Nets: Cameron Johnson scored 14 points but was 1 for 6 behind the arc. ... Seth Curry made four 3-pointers and scored 12 points. \n\n\r\n              TOO MUCH TIME AT HOME\n\n\r\n              The Nuggets were spending Sunday night in New York before continuing their road trip in Washington, giving them four nights in the city, which Malone — a New York native — said he hated.\n\n\r\n              “Talk about a death trap,” Malone said.\n\n\r\n              Malone told his players that when he was a Knicks assistant, they would feast on teams who stayed out too late in the city the night before a day game. So with Denver playing back-to-back afternoon games in the city, starting with a loss to the Knicks on Saturday, he hoped the players would save their fun until Sunday night.\n\n\r\n              “But back-to-back matinee games in New York is a cruel and unusual punishment by the league,” he added.\n\n\r\n               UP NEXT\n\n\r\n              Nuggets: At Washington on Wednesday.\n\n\r\n              Nets: Host Cleveland on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994680.951647
}