{
  "game_id": "0022400500",
  "espn_id": "401705066",
  "date": "Jan 06, 2025",
  "matchup": "LAC @ MIN",
  "headline": "Edwards scores 37 to lead Timberwolves past Clippers 108-106",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 28 of his 37 points in the second half and the Minnesota Timberwolves overcame a 19-point first-half deficit to beat the Los Angeles Clippers 108-106 on Monday night.\n\n\r\n              Edwards, who had a career-high 53 points in Saturday’s loss at Detroit, finished 14 of 29 from the field, including a pair of late 3-pointers for his eighth game this season of 30-plus points.\n\n\r\n              Naz Reid scored 18 off the bench and Donte DiVincenzo added 15 for Minnesota, which ended a three-game slide. Rudy Gobert had eight points and a game-high 18 rebounds.\n\n\r\n              Norman Powell led Los Angeles with 25 points, James Harden added 22 and Ivica Zubac had 17 points and 16 rebounds. The Clippers have lost three of four.\n\n\r\n              With the Wolves down by one, Edwards swished a step-back 3 with 1:12 to play. After Zubac missed a layup for Los Angeles, Edwards drained another 3 with 34.4 seconds left for a 106-101 lead.\n\n\r\n              Takeaways\r\n              Clippers: In his second game back after missing the team’s first 34 while recovering from a right knee injury, Kawhi Leonard scored eight points on 3-of-11 shooting. He had two assists and two rebounds in 20 minutes, 41 seconds.\n\n\r\n              Timberwolves: DiVincenzo started at point guard in place of Mike Conley, who came off the bench for the first time in his 131 games with the Timberwolves. In his 18th season overall, Conley entered averaging 8.0 points per game and shooting 34.9% from the field, both career lows. He finished with 11 points.\n\n\r\n              Key moment\r\n              The Clippers led 96-91 with 4:07 to go, but a three-point play and a 3 by Edwards put the Timberwolves up by one a minute later.\n\n\r\n              Key stat\r\n              Averaging 20.1 points per game, Julius Randle had five for Minnesota on 2-of-10 shooting. He missed all three 3-point attempts.\n\n\r\n              Up next\r\n              The Clippers are at Denver on Wednesday. The Timberwolves are at New Orleans on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998038.951288
}