{
  "game_id": "0022400118",
  "espn_id": "401704684",
  "date": "Oct 30, 2024",
  "matchup": "LAL @ CLE",
  "headline": "Cavaliers blow out Lakers 134-110 as Bronny James scores first NBA points as dad watches from bench",
  "body": "CLEVELAND -- — Evan Mobley scored 25 points, Donovan Mitchell added 24 and the Cleveland Cavaliers improved to 5-0 with a 134-110 win over the Los Angeles Lakers on Wednesday night in a game that included a special homecoming for LeBron James and his son, Bronny.\n\n\r\n              The win marks the first time the Cavs have started 5-0 since the 2016-17 season, led by LeBron, and the third time in franchise history.\n\n\r\n              In the final minutes, Bronny played for the second time as a pro and was inserted with 5:16 left. The younger James, who grew up in the arena, made a 14-foot jumper with 2:03 to play for his first NBA points.\n\n\r\n              Jarrett Allen added 20 points and 17 rebounds for Cleveland.\n\n\r\n              LeBron scored 26 and Anthony Davis had 22 and 13 rebounds for the Lakers, who were unable to cut into Cleveland's lead after falling behind by 23 in the first half.\n\n\r\n              Takeaways\r\n              Lakers: A slow start proved costly, resulting in a second straight loss. First-year coach JJ Redick is still learning about his team.\n\n\r\n              Cavaliers: Cleveland is playing at a faster tempo this season under new coach Kenny Atkinson, who has stressed ball movement and pushing the pace offensively.\n\n\r\n              Key moment\r\n              Mitchell dropped back-to-back 3-pointers as the Cavaliers made four treys in a span of 1:45 in the first quarter to open a 19-point lead after one. \n\n\r\n              Key stats\r\n              Coming off the bench early when Darius Garland got two early fouls, Caris LeVert scored 16 with six assists. ... Despite the loss, LeBron has done well against the Cavaliers, going 19-4 against them with Miami and L.A.\n\n\r\n              Up next\r\n              The Lakers continue their trip on Friday in Toronto, while the Cavaliers host the Magic in a rematch of last year's Eastern Conference playoff series also on Friday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997217.0291169
}