{
  "game_id": "0022300599",
  "espn_id": "401585227",
  "date": "Jan 20, 2024",
  "matchup": "MIN vs. OKC",
  "headline": "Shai Gilgeous-Alexander scores 33 points, Thunder beat Timberwolves 102-97 in West showdown",
  "body": "MINNEAPOLIS -- — Shai Gilgeous-Alexander scored 11 of his 33 points in the fourth quarter and the Oklahoma City Thunder rallied to beat the Minnesota Timberwolves 102-97 on Saturday night in a matchup of the top teams in the Western Conference standings.\n\n\r\n              Jaylin Williams added 20 points for Oklahoma City, and Minnesota native Chet Holmgren had 15. The Thunder trailed by 11 early in the fourth before rallying to win for the second time in four games to pull within a game of Minnesota.\n\n\r\n              “We just had great resilience tonight,\" Oklahoma City coach Mark Daigneault said. “It’s one thing to defend like that, but it’s another when you’re shooting the ball so poorly. We just had a really hard time cracking them. They played great defense in the second half.”\n\n\r\n              The Thunder shot just 39.5% from the field, but held the Timberwolves to 14 points in the fourth on 3-of-13 shooting.\n\n\r\n              Anthony Edwards and Karl-Anthony Towns each had 19 points for Minnesota and Naz Reid added 18. The Timberwolves had won four in a row to regain the West’s No. 1 spot after losing four of six to drop behind Oklahoma City. \n\n\r\n              “It’s as simple as being better with the ball,” Towns said. “I thought we gave ourselves a chance at the end of the game, just didn’t find a way to win today. They hit some shots when they had to; shoutout to them, all respect to them. We’ve just got to figure it out next game.”\n\n\r\n              A season-long obstacle for Minnesota has been turnovers and that issue allowed the Thunder to stay close before the finishing flurry in which Oklahoma City outscored the Wolves 24-10 to end the game. Minnesota had 21 turnovers, leading to 28 points.\n\n\r\n              “We got to stop turning it over,” said Edwards, who had five turnovers. “I think it’s that simple. Myself, we’re playing in crowds. Sometimes it’s just a pass to the other team. Just got to cut back on them. We’ll be all right.”\n\n\r\n              Oklahoma City used a 19-7 run to tie it at 90 with 3:42 remaining. Gilgeous-Alexander hit a 3-pointer with 1:14 left to give the Thunder a 96-94 lead. \n\n\r\n              “He’s been in this position so many times now,\" Oklahoma City's Luguentz Dort said. \"I’m not surprised when he takes those types of shots. He’s so much confident. He knows he can make those shots for the team, so we all have trust in him to take those type of shots for us and he knocked it down.”\n\n\r\n              Rudy Gobert hit one of two free throws to pull Minnesota within one, but Mike Conley’s 3 with 23.4 seconds remaining was off the mark and Williams made two free throws.\n\n\r\n              Reid scored on the other end, but Isaiah Joe hit two free throws to regain the three-point advantage. Edwards was fouled on a 3 with 3.4 seconds remaining but missed the first two free throws and intentionally missed the third and Oklahoma City got the rebound.\n\n\r\n              “I just thought our ability to defend, despite an imperfect night, showed great mental toughness by our team,\" Daigneault said.\n\n\r\n              Oklahoma City has won two of the three meetings this season between the two young teams, with Saturday marking the first road win between the two this season. The final matchup of the regular season is at Oklahoma City on Jan. 29.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host Portland on Tuesday night.\n\n\r\n              Timberwolves: Host Charlotte on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764996470.293812
}