{
  "game_id": "0022400759",
  "espn_id": "401705325",
  "date": "Feb 10, 2025",
  "matchup": "MIA vs. BOS",
  "headline": "Jayson Tatum scores 33, Celtics hold Heat to 34% shooting and roll to 103-85 win",
  "body": "MIAMI -- — Jayson Tatum scored 33 points, Kristaps Porzingis added 17 and the Boston Celtics rolled past the Miami Heat 103-85 on Monday night.\n\n\r\n              Al Horford scored 16 points, Sam Hauser had 15 and Derrick White added 13 for the Celtics. Boston took 53 3-pointers in the game and only 32 2-pointers.\n\n\r\n              Bam Adebayo scored 22 points and grabbed 12 rebounds for Miami, which was without Tyler Herro and Jaime Jaquez Jr. — both sidelined by illness.\n\n\r\n              Andrew Wiggins had 11 points in his Heat debut. Miami shot 33.7% and has been held under 90 points in each of its last five matchups with Boston.\n\n\r\n              Including playoffs, Boston has now won five straight meetings with Miami, each of them one-sided — 104-84, 102-88 and 118-84 in the last three games of the 2024 first-round series, 108-89 on Dec. 2 and now this 18-point win.\n\n\r\n              Takeaways\r\n              Celtics: Jaylen Brown missed the game with swelling in his right knee and Jrue Holiday was out with a right shoulder issue. Asked before the game if he was concerned about injury issues, Celtics coach Joe Mazzulla said they're not issues. “They're opportunities,” he said.\n\n\r\n              Heat: Miami's new faces acquired in the Jimmy Butler trade — Wiggins, Davion Mitchell and Kyle Anderson — shot a combined 5 for 25 from the field, 2 for 13 from 3-point range. Wiggins and Mitchell were both in the starting lineup for their Miami debuts.\n\n\r\n              Key moment\r\n              Miami led 24-13, and Boston went on a 26-5 run over the next seven minutes. The Celtics kept control the rest of the way.\n\n\r\n              Key stat\r\n              It was the 69th time in Heat history that they shot less than 35% in a regular-season game. They're now 2-67 in such contests.\n\n\r\n              Up next\r\n              Boston finishes its pre-All-Star schedule Wednesday at home against San Antonio. Miami plays at Oklahoma City on Wednesday and Dallas on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998272.0839128
}