{
  "game_id": "0022201037",
  "espn_id": "401469192",
  "date": "Mar 15, 2023",
  "matchup": "SAC @ CHI",
  "headline": "De’Aaron Fox hits 3 at buzzer, Kings beat Bulls 117-114",
  "body": "CHICAGO -- — De’Aaron Fox hit a 3-pointer with 0.7 seconds left to give the Sacramento Kings a 117-114 victory over the Chicago Bulls on Wednesday night.\n\n\r\n              Fox scored 32 points on 12-for-17 shooting, hitting four 3-pointers. The sixth-year guard is on a roll, scoring 2O or more points in 14 of his last 16 games and averaging over 30 in that span.\n\n\r\n              And his confidence, especially when game is on the line?\n\n\r\n              “I think it's through the roof,” Fox said \"I have a whole group of guys and coaching staff who believe in me. They have confidence in me taking the last shot, so the least I can do is go out there and have confidence in myself.”\n\n\r\n              Fox cooly hit his 25-foot winner before the Bulls could double-team him. The buzzer-beater improved the Kings to 41-27 and moved them a step closer to their first winning record and playoff berth since 2005-06.\n\n\r\n              Domantas Sabonis had his second straight triple-double and 11th of the season — finishing with 14 points, 17 rebounds and 10 assists — and Sacramento roared back in the second half with hot 3-point shooting.\n\n\r\n              “You know Fox is the most clutch player out there,” Kings coach Mike Brown said. “And Domas with his ability to bring to the table triple-double after triple-double after triple-double and we get a win, both those guys should be on an all-NBA team.”\n\n\r\n              Malik Monk had 19 points, going 5 for 8 on 3s as the Kings overcame a 10-point halftime deficit to win for the fourth time in five and improve to 9-2 in their last 11.\n\n\r\n              “We didn't play well and we found a way to win tonight,” Brown said. “The biggest thing was the unforced turnovers and our spacing wasn't great.”\n\n\r\n              The Kings turned the ball over 19 times compared to 14 for Chicago.\n\n\r\n              DeMar DeRozan led Chicago with 33 points and hit a 3-pointer from the top of the arc with 11.6 seconds left to cut the Kings' lead to 114-113. He was fouled by Harrison Barnes and completed a four-point play to tie it.\n\n\r\n              “We've just got to keep pushing, keep fighting,\" DeRozan said. “We understand we've still got an opportunity. We're going to play this thing out until we can't no more and let the chips fall where they may.”\n\n\r\n              The Bulls fell 1/2 game behind 10th place Washington and the final playoff spot in the East.\n\n\r\n              Zach LaVine added 25 points, and Nikola Vucevic had 20 points and 14 rebounds. \n\n\r\n              Chicago closed it to 113-110 on LaVine’s dunk with 17.8 seconds left. Kessler Edwards hit just one of two free throws after being fouled by DeRozan to give Sacramento a four-point lead with 15.7 to go.\n\n\r\n              TIP-INS\n\n\r\n              Kings: F Trey Lyles who served a one-game suspension without pay for an altercation with Milwaukee’s Brook Lopez at the end of the Bucks' 133-124 victory in Sacramento on Monday night. Brown had only a mild reaction to the NBA’s ruling, saying “It is what is” and that the Kings would miss Lyles “steadiness” and “veteran leadership” off the bench. Lopez was fined $25,000.\n\n\r\n              Bulls: G Alex Caruso sat out with a non-COVID illness. Second-year G Ayo Dosunmu replaced him in the starting lineup.\n\n\r\n              ------\n\n\r\n              Kings: At Brooklyn on Thursday night\n\n\r\n              Bulls: Host Minnesota on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995286.944285
}