{
  "game_id": "0022301052",
  "espn_id": "401585680",
  "date": "Mar 27, 2024",
  "matchup": "PHI vs. LAC",
  "headline": "Kawhi Leonard comes alive late to lead Clippers to disputed 108-107 win over 76ers",
  "body": "PHILADELPHIA -- — Kawhi Leonard completed two 3-point plays late in the game then made a block at the rim on the final possession to lead the Los Angeles Clippers to a controversial 108-107 win over the Philadelphia 76ers on Wednesday night.\n\n\r\n              Kelly Oubre Jr. was stuffed at the rim by Leonard on a play that Sixers head coach Nick Nurse felt should have resulted in a foul on Paul George.\n\n\r\n              The officiating crew after the game said a foul should have been called on the last play that would have sent Oubre to the line with a chance to win the game.\n\n\r\n              Nurse stormed onto the court to dispute the non-call and had to be restrained by his assistants. Oubre also jumped into the mix, pointing at each official before being pulled away after the final horn. \n\n\r\n              “Well I think, listen, I think he took it in there pretty hard, right?” Nurse said. “I looked it on our computer screen a couple times. I thought there was certainly contact. Certainly as much as the last two or three that got called and-1's at the other end. And that’s all. I just thought it was enough contact to call. But that’s the way it goes sometimes.”\n\n\r\n              The game officials agreed.\n\n\r\n              “On the last play on the floor, in real time the crew interpreted that play as the defender jumping vertically,” referee Kevin Scott said to a pool reporter. “However, in post-game video review we did observe some slight drift to his left by the defender George, and a foul should have been ruled.”\n\n\r\n              Leonard bounced back from a 1-for-8 shooting first half to score 17 points and grab 10 rebounds.\n\n\r\n              “We had to stay focused if we were going to stay in the game,” he said. \n\n\r\n              George had 22 points to lead Los Angeles while James Harden, in his return to Wells Fargo Center, had 16 points and 14 assists for the Clippers, who had lost six of nine.\n\n\r\n              “I liked our fight when we got down 15 points,” Clippers head coach Tyronn Lue said. “It's a tough game for a first game of a road trip. ... I just liked us staying with it and attacking the paint and getting to the rim.”\n\n\r\n              Tyrese Maxey had 26 points for the 76ers while Oubre added 17 points.\n\n\r\n              Leonard scored with 44 seconds left, was fouled by Tobias Harris and hit the free throw to give Los Angeles a 105-104 lead. Sixers guard Buddy Hield responded with a long 3-pointer to give Philadelphia a 107-105 lead with 23 seconds to play.\n\n\r\n              After a timeout, Leonard sliced down an empty lane with a reverse layup and added the free throw after being fouled by Oubre to give the Clippers a one-point lead again. Oubre drove the lane at the other end of the floor, but Leonard pinned the ball against the rim and backboard.\n\n\r\n              “Kawhi got it going late and was being resilient,” Lue said. \n\n\r\n              Harden played 1 1/2 seasons for the 76ers before being traded to Los Angeles on Oct. 31 as part of a seven-player deal after a public summer contract dispute with Daryl Morey, Philadelphia's president of basketball operations. \n\n\r\n              Harden was greeted by boos when he was the first Clippers player introduced, then was heckled every time he touched the ball. After a sluggish start, Harden began to assert himself on the offensive end and distribute the ball. He was 6 of 15 from the floor and grabbed five rebounds.\n\n\r\n              “I expected it,” Harden said. “I really don’t know what it’s about, but I expected it. So it is what it is. I don’t even know why they were booing. You can ask them. I don’t know why they were booing.”\n\n\r\n              When asked if he would ever patch up his relationship with Morey — who he was close to during time in Houston and Philadelphia — the answer was direct. \n\n\r\n              “No,” Harden answered. “Hell no.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Continue their four-game road trip in Orlando Friday night.\n\n\r\n              76ers: At Cleveland on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996409.27976
}