{
  "game_id": "0021600642",
  "espn_id": "400900063",
  "date": "Jan 20, 2017",
  "matchup": "CHA vs. TOR",
  "headline": "Walker scores 32, Hornets rout Raptors 113-78",
  "body": "CHARLOTTE, N.C. --  Kemba Walker and his Charlotte Hornets teammates were getting a little tired of hearing about how they couldn't beat the top teams in the Eastern Conference.\n\nThey took care of that on Friday night.\n\nWalker scored 32 points on 11-of-16 shooting, and the Hornets routed the Toronto Raptors 113-78. The Hornets entered the game a combined 0-7 against Cleveland, Toronto and Boston, the top teams in the East.\n\nWalker called it an \"important\" win.\n\n\"We have been hearing about how we haven't been playing well against the top teams, which is obviously true, so we wanted to come out with great intensity right from opening jump,\" Walker said. \"We did that.\"\n\nWalker, who came in averaging 23 points and looking to earn his first All-Star selection, scored 16 points in the pivotal third quarter, including a four-point play to close the quarter as the Hornets outscored the Raptors 33-15 to build a 25-point lead.\n\nWalker didn't play at all in the fourth quarter after the Hornets stretched their lead to more than 30. The 6-foot-1 point guard also finished with eight assists.\n\n\"He came out and set the tone for them offensively with his speed and quickness, attacking the rim,\" Raptors coach Dwane Casey said. \"We have to have some resistance. We were trying to trap him and we can't allow him to go around our trap.\"\n\nHornets coach Steve Clifford called it his team's best game from start to finish.\n\nKyle Lowry had 24 points and DeMar DeRozan added 23 points for the Raptors, who have lost two straight.\n\nThe Hornets held the Raptors to 33 percent shooting and limited them to a season-low 78 points.\n\nCharlotte (22-21) came out strong with Walker effectively running the pick-and-roll with Cody Zeller. Walker scored 16 points on 6-of-9 shooting in the first half and had four rebounds and three assists.\n\nThe Hornets have won eight of their last nine at home, with the only loss coming against the Cavaliers.\n\nTIP-INS\n\nRaptors: Held to 18 points on 31 percent (7 of 22) shooting in first quarter. ... Lowry picked up a technical foul in the first half for arguing a call. Lowry was upset earlier in the game when he took a shot the mouth and thought he should have gotten a foul called but didn't. ... Jared Sullinger was assessed a flagrant 1 foul in the fourth quarter after knocking over Nic Batum on the way to the basket.\n\nHornets: Walker has scored at least 20 points in 30 of Charlotte's 43 games this season. It was Walker's seventh 30-point outing of the season. ... Marvin Williams has made a 3-pointer in 17 straight games. ... The Hornets are 15-1 when holding opponents under 100 points.\n\nLOOKING AHEAD\n\nClifford said it's important the Hornets immediately put the win behind them and turn their focus to Brooklyn.\n\n\"We have a team coming in tomorrow night that put 120 on us the last time we played them,\" Clifford said. \"It will be one of those nights that determine, you know, what kind of team we're going to be. We've got to find a way to come back with the same concentration level and same attention to detail.\"\n\nFRANK THE TANK\n\nFrank Kaminsky had a solid night off the bench for the second straight game, scoring 16 points and grabbing eight rebounds.\n\n\"Again, when those guys off the bench came in tonight they sustained the play,\" Clifford said. \"If you're going to be good. last year our big strength was our depth. We need everybody to play well and that's what we're getting right now.\"\n\nSHOOTING STRUGGLES\n\nCasey said with his team having a tough week shooting the ball -- they lost the 76ers earlier in the week -- it's time to rely on the defense to carry them.\n\n\"That's when your defense has to pick back up,\" Casey said. \"Your defense has to carry you until your offense comes back around. You go through that during the season. The most important thing is we have to stay together, stay positive.\"\n\nUP NEXT\n\nRaptors: Travel to Phoenix to face the Suns on Sunday.\n\nHornets: Will play tail end of a back-to-back at home Saturday night against Brooklyn.",
  "source": "espn_api",
  "crawled_at": 1764995505.070776
}