{
  "game_id": "0022001015",
  "espn_id": "401307822",
  "date": "May 08, 2021",
  "matchup": "BKN @ DEN",
  "headline": "Nets rally to beat Nuggets 125-119, snap 4-game skid",
  "body": "DENVER -- — Brooklyn coach Steve Nash doesn't mind his players feeling a little uncomfortable right now. Or even seeing them suffer a bit.\n\n\r\n                    It can only help later on, the Brooklyn coach reasoned. The Nets were definitely struggling, too, down 21 points to Denver at one point before flipping a switch and storming back.\n\n\r\n                    Kevin Durant scored 33 points, including five free throws over the last 21 seconds, and Kyrie Irving added 31 as the Nets snapped a four-game skid by beating the short-handed Nuggets 125-119 on Saturday night.\n\n\r\n                    “I’m happy for us to be uncomfortable right now. I’m happy for us to struggle, suffer,\" Nash said. \"These experiences when we’re on the mat are good for us. Our guys responded tonight.”\n\n\r\n                    The Nets moved a half-game in front of Milwaukee for the second seed in the Eastern Conference. Brooklyn remained three games behind East-leading Philadelphia.\n\n\r\n                    The difference between the first half (outscored 71-56) and the second (outscoring Denver 69-48) was pretty simple to Durant: “We got on the same page in the second half and played our hardest.\"\n\n\r\n                    After trailing by as many as 21 points in the first half, the Nets took the lead for good at 111-110 on a 3-pointer by Joe Harris with 6:12 remaining. It was their first lead since 35 seconds into the game.\n\n\r\n                    But it was far from easy down the stretch. Nikola Jokic had a chance to give the Nuggets the lead with 23.9 seconds left, only to see his turnaround miss. Durant made two free throws to make it 122-119.\n\n\r\n                    Durant was fouled soon after Jokic missed a shot on the other end. The Nuggets big man was upset over the no-call and lost his cool, picking up a technical with 9.1 seconds left. Durant made three free throws to secure the win.\n\n\r\n                    Blake Griffin had 16 of his 20 points in a pivotal third quarter to help the Nets climb back into the game.\n\n\r\n                    Jokic brushed off his seeming irritation with the officials down the stretch, simply saying: “No comment. Next question.”\n\n\r\n                    Instead, he praised the Nets.\n\n\r\n                    “They're a talented team,” said Jokic, who finished with 29 points, seven boards and six assists.\n\n\r\n                    Michael Porter Jr. added 28 points, including six 3-pointers, as the Nuggets had their seven-game home winning streak snapped. It was their final regular-season game this season at Ball Arena, where the Nuggets finished 25-11.\n\n\r\n                    Facundo Campazzo had 19 points and little-used Markus Howard chipped in a career-best 13 points with the Nuggets turning to unconventional lineups after playing the night before at Utah.\n\n\r\n                    Aaron Gordon was a late scratch due to tightness in his right calf, joining a growing list of banged-up Nuggets. The injury report now includes Jamal Murray (ACL), Zeke Nnaji (sprained left ankle), Monte Morris (hamstring), Will Barton (hamstring) and PJ Dozier (right adductor strain). Paul Millsap also didn't play just to give him a night off.\n\n\r\n                    In the second quarter, Nuggets coach Michael Malone turned to the little-used lineup of Vlatko Cancar, Bol Bol, Howard, Shaquille Harrison and JaVale McGee.\n\n\r\n                    “The silver lining, Markus Howard, Vlatko, Bol, they got a chance to play some real game minutes,” Malone said.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: G James Harden was out for a 17th straight game with a right hamstring strain. ... Durant had 11 boards. ... The Nuggets had a 27-1 edge in second-chance points.\n\n\r\n                    Nuggets: Porter scored Denver's opening 11 points. ... This was the largest blown lead in a loss this season for Denver. The previous biggest was 20 at Washington on Feb. 17. \n\n\r\n                    NASH ON JOKIC\n\n\r\n                    “Clearly, I think Jokic is the MVP this year,” Nash said. “He’s kind of gone wire-to-wire at this high level, and makes his teammates better, makes everything go. They lose Jamal Murray and they haven’t really skipped a beat. That shows how good he is.”\n\n\r\n                    SAME GAME\n\n\r\n                    Malone sees similarities between Durant and Porter.\n\n\r\n                    “Very similar body types, tremendous size, length,” Malone said. “Obviously, Kevin Durant’s body of work is just tremendous; he’s one of the top five players in the world.”\n\n\r\n                    Durant has a lot of respect for Porter.\n\n\r\n                    “He's a unique player who's going to carve his own lane out in the league,” Durant said. \n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Finish a five-game trip Tuesday at Chicago.\n\n\r\n                    Nuggets: At Charlotte on Tuesday as Denver concludes the season with four straight road games.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997472.126233
}