{
  "game_id": "0022000668",
  "espn_id": "401307459",
  "date": "Mar 24, 2021",
  "matchup": "TOR vs. DEN",
  "headline": "Raptors rout Nuggets 135-111 to end 9-game losing streak",
  "body": "TAMPA, Fla. -- — Pascal Siakam scored 27 points and the Toronto Raptors broke a nine-game losing streak Wednesday night with a 135-111 rout of the Denver Nuggets.\n\n\r\n                    Toronto built a 24-point lead in the first half and shot 50% (24 of 48) on 3-pointers overall to win for the first time since Feb. 26.\n\n\r\n                    OG Anunoby scored 18 of his 23 points before halftime for the Raptors, and Norman Powell added 22. \n\n\r\n                    Kyle Lowry, playing perhaps his final game for Toronto on the eve of the NBA trade deadline, finished with eight points, nine assists and five rebounds. \n\n\r\n                    “A lot of people are wondering what's going to happen. There are a lot of rumors out there,” Siakam said. “When you're losing, that makes it even worse. My focus was on trying to win a game and I was trying to block everything else away.”\n\n\r\n                    As for the prospect of breaking up the core of a team that won a championship two years ago, Siakam said: “That's the NBA. There's a lot of doubt going on, but there's not much you can do. It's kind of out of your control.”\n\n\r\n                    Lowry had a plus/minus of plus-42, second-best in franchise history.\n\n\r\n                    “He plays harder than anybody I’ve ever seen, and I can’t give him a higher compliment than that,” coach Nick Nurse said. \"He’ll go down as maybe the greatest Raptor ever to date.”\n\n\r\n                    Nikola Jokic and Jamal Murray scored 20 points apiece for Denver, which lost for only the third time in 12 games. Michael Porter Jr. added 19 points and eight rebounds.\n\n\r\n                    The Nuggets had won six straight road games, equaling a franchise record. \n\n\r\n                    The Raptors were desperate for a win, having dropped 2 1/2 games outside the Eastern Conference playoff picture with 29 to play.\n\n\r\n                    “The only thing that's frustrating is if we can't play our way back into it at the end,” Nurse said. “We're not a million miles away from getting into postseason play and that's what we've got to make a run at.”\n\n\r\n                    The Raptors made their first five 3s, two during an early 8-0 run that put them ahead for good.\n\n\r\n                    Denver went scoreless for more than three minutes of the second quarter as Paul Watson Jr. and Anunoby hit 3-pointers in a 12-0 run. Toronto led 67-43 when Siakam drove for a layup with 2:34 left in the first half.\n\n\r\n                    The Nuggets never got the margin under 15 in the second half. A trio of 3s by Watson in the fourth quarter helped the Raptors stretch their lead to 35.\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Were coming off a win Tuesday night in Orlando. ... G Monte Morris missed his seventh game with a quadriceps injury.\n\n\r\n                    Raptors: Maple Leaf Sports & Entertainment used the first all-female broadcast crew in NBA history, with The Sports Network's Kate Beirness and Amy Audibert serving as studio hosts. Meghan McPeak did the play-by-play, Kia Nurse was the analyst and Kayla Gray gave the sideline reports. ... Nurse downplayed reports of a shouting match with Siakam after Sunday night's loss at Cleveland, and said reports of a $50,000 fine were inaccurate. “We're all focused on winning, and I think that's all that matters,” Siakam said. ... The nine-game losing streak was Toronto's longest in 10 years.\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Play at New Orleans on Friday night.\n\n\r\n                    Raptors: Home against Phoenix on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996844.1524138
}