{
  "game_id": "0022400245",
  "espn_id": "401704811",
  "date": "Nov 18, 2024",
  "matchup": "MIA vs. PHI",
  "headline": "Heat shake off early deficit, roll past reeling 76ers 106-89",
  "body": "MIAMI -- — Jimmy Butler scored a season-high 30 points in his return from a sprained ankle, Tyler Herro added 18 and the Miami Heat erased an early 19-point deficit to beat the Philadelphia 76ers 106-89 on Monday night.\n\n\r\n              Duncan Robinson scored 13 and Dru Smith added 10 for Miami, which played its first home game in two weeks. The Heat — who were outscored 137-71 in third quarters in their first four home games — outscored Philadelphia 35-16 in that period.\n\n\r\n              Jared McCain scored 20 points, Paul George added 18 and former Heat forward Caleb Martin finished with 12 for Philadelphia, which has lost 11 of 13 games to open the season.\n\n\r\n              Joel Embiid played for the third time this season; the Olympic gold medalist from this past summer scored 11 points in 31 minutes for the 76ers.\n\n\r\n              Takeaways\r\n              76ers: Tyrese Maxey (hamstring) missed his sixth consecutive game and coach Nick Nurse expects an update on his status Tuesday. Nurse said Maxey was able to go through most of the team's practice in Miami on Sunday.\n\n\r\n              Heat: Jaime Jaquez Jr. (ankle) was out and point guard Terry Rozier revealed after Sunday's loss in Indiana that he's been dealing with a right foot issue for much of the season. Rozier didn't play Monday.\n\n\r\n              Key moment\r\n              Miami went on an 11-3 run to end the half and went into the locker room down just 56-53, after trailing by double digits for most of the second quarter.\n\n\r\n              Key stat\r\n              Philadelphia's 19-point lead in the second quarter was its biggest of the season. The 76ers wound up becoming the first team this season to lead by at least 19 and trail by at least 20 in the same game.\n\n\r\n              Up next\r\n              Philadelphia ends a three-game trip Wednesday in Memphis. Miami — in a schedule quirk — doesn't play again until hosting Dallas on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996931.7173278
}