{
  "game_id": "0022400346",
  "espn_id": "401704912",
  "date": "Dec 07, 2024",
  "matchup": "MIA vs. PHX",
  "headline": "Bam Adebayo scores 25, Jimmy Butler adds 24 and Heat hold off Suns 121-111",
  "body": "MIAMI -- — Bam Adebayo scored 25 points, Jimmy Butler added 24 and the Miami Heat moved back over the .500 mark by beating the Phoenix Suns 121-111 on Saturday night.\n\n\r\n              Adebayo finished with 12 rebounds and eight assists for the Heat (11-10). Duncan Robinson scored 19 and Tyler Herro added 17 points, eight rebounds and seven assists for Miami, which outscored Phoenix 68-53 after halftime.\n\n\r\n              Royce O’Neale had 23 points for Phoenix (12-10), Devin Booker scored 21 and Grayson Allen finished with 16. Bradley Beal had 15 points for the Suns, who were outscored 62-32 in the paint.\n\n\r\n              The Suns played again without Kevin Durant (left ankle sprain) and Jusuf Nurkic (right thigh contusion).\n\n\r\n              Takeaways\r\n              Suns: Phoenix is winless in its last seven games without Durant and 1-8 when the four-time Olympic gold medalist hasn't played this season. If that wasn't bad enough, the Suns are now 0-8 when allowing 120 points; they're 12-2 when holding teams under that number.\n\n\r\n              Heat: Miami improved to 10-3 when holding teams under 115 points this season; the Heat are 1-7 when that doesn't happen. And they've now won three in a row at home for the first time this season.\n\n\r\n              Key moment\r\n              Butler had three points on three consecutive possessions — one on a 3-pointer, the other two on three-point plays — in a 62-second span late in the fourth quarter. Miami's lead went from three to 10 in that brief flurry that basically sealed the game.\n\n\r\n              Key stat\r\n              Adebayo's previous scoring high at home this season was 19. The Heat are 3-0 this season when he scores at least 25 points.\n\n\r\n              Up next\r\n              Both teams play Sunday, with Phoenix going to Orlando and the Heat hosting NBA-leading Cleveland.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996921.183208
}