{
  "game_id": "0021600090",
  "espn_id": "400899540",
  "date": "Nov 06, 2016",
  "matchup": "MIL @ DAL",
  "headline": "Barnes scores career-high 34, Mavs beat Bucks 86-75 in OT",
  "body": "DALLAS --  When the Dallas Mavericks signed Harrison Barnes to a max contract in the offseason, they probably had nights like this in mind.\n\nWith the team in search of its first win and two starters out, Barnes scored a career-high 34 points and the Mavericks beat the Milwaukee Bucks 86-75 in overtime Sunday.\n\nBarnes, who left Golden State to sign a $94 million, four-year contract with Dallas, has scored at least 30 points twice this season after hitting the mark only once in his four years with the Warriors.\n\nHis 20-foot jumper opened the scoring in overtime, and the Mavericks (1-5) never trailed in the extra period, outscoring the Bucks 12-1 and forcing five turnovers.\n\n\"I think the biggest thing that Coach (Rick Carlisle) has told me is just look for my shot and be aggressive,\" Barnes said. \"My teammates have a lot of confidence in me and when I was able to get into a good rhythm, the basket got bigger and bigger.\"\n\nDallas played without starters Dirk Nowitzki (right Achilles soreness) and Deron Williams (left calf strain).\n\nJ.J. Barea added 21 points for Dallas, including five in overtime.\n\nJabari Parker led Milwaukee with 16 points, only two after halftime. Greg Monroe had 14 points and 12 rebounds for the Bucks, who had won three straight.\n\n\"I didn't finish really well,\" Parker said. \"I'd rather have a bad first half and have a good second half.\"\n\nWesley Matthews shook off a 3-for-17 shooting night to hit a 3-pointer with 59 seconds remaining in overtime that put the Mavs up by nine.\n\nBarnes' driving layup with 13 seconds to play in regulation tied the score at 74. Giannis Antetokounmpo's long jumper at the buzzer missed, forcing overtime.\n\nThe Bucks led by 13 points in the first quarter but went cold in the second and trailed 47-39 at the break.\n\nBarnes scored 19 points in the first half, including nine in a 14-0 Dallas run to end the half. It was the Mavericks' first lead at the end of any quarter this season.\n\nTIP-INS\n\nBucks: Antetokounmpo picked up two fouls in the first 1:37 and played only 6 minutes in a scoreless first half. He finished with 11 points. . The Bucks had 27 turnovers.\n\nMavericks: The team honored longtime team physician J.R. Zamorano, who died June 12 at age 81, with a moment of silence before the game. Players wore uniform patches and Mavericks coaches wore lapel pins with the letters JRZ. . Andrew Bogut, back in the lineup after missing Friday's game for personal reasons, had 16 rebounds.\n\nBREAKING IN\n\nDallas rookie Dorian Finney-Smith played 31 minutes, including most of the second half and overtime, after playing less than 5 minutes cumulatively over the first five games.\n\nHe finished with five points, the first of his NBA career. More importantly, he defended Antetokounmpo on the final possession of regulation, forcing the long miss. The team gave Finney-Smith a game ball after the game.\n\n\"It felt good to know that (Carlisle) trusts me enough to play me down the stretch to get stops,\" Finney-Smith said. \"That's what I like to do. I like to play defense.\"\n\nSLOWING DOWN THE BUCKS\n\nMilwaukee had scored 117 or more points in three consecutive games for the first time since February 2009. But the Mavericks held the Bucks to 75 by taking away the two things they like to do most -- score in the paint and on the fast break. The Bucks had only 28 points in the paint, less than half their season average of 57, and managed just 12 points in transition as Dallas often used the entire shot clock on offense.\n\n\"We couldn't find stops,\" Parker said. \"When we find stops we are able to go out in transition. They eliminated that by playing the clock out.\"\n\nUP NEXT\n\nBucks: Host the New Orleans Pelicans on Thursday. The Bucks beat the Pelicans 117-113 on Tuesday.\n\nMavericks: At the Los Angeles Lakers on Tuesday, the start of a four-game road trip that takes Dallas to both coasts.\n\n---\n\nThis story has been corrected to show Monroe had 12 rebounds.",
  "source": "espn_api",
  "crawled_at": 1764995226.0581608
}