{
  "game_id": "0021500067",
  "espn_id": "400827954",
  "date": "Nov 04, 2015",
  "matchup": "PHX vs. SAC",
  "headline": "Eric Bledsoe scores 19, balanced Suns rout Kings 118-97",
  "body": "PHOENIX --  Eric Bledsoe played with more determination, and his Phoenix teammates followed suit.\n\nBledsoe scored 19 points, Brandon Knight added 17 and the Suns routed the Sacramento Kings 118-97 Wednesday night.\n\n\"I just wanted to come out aggressive,\" said Bledsoe, who hit four of his first six shots before finishing 8 of 16. \"I wanted to get everyone involved and set the tone from the jump.\"\n\nSuns coach Jeff Hornacek said the change in Bledsoe was part of his young point guard's maturation process.\n\n\"I think Eric came in this year with a different mentality,\" Hornacek said. \"He knows that for us to get to another level, he's got to bring it every game we're out there. That includes the start of the game, loosening up and getting into the flow. I think he really did that in the first quarter.\"\n\nBledsoe was 2 for 3 from 3-point range in the first period. Phoenix finished 14 for 23 beyond the arc (60.6 percent) after shooting only 28.8 percent over the first four games of the season.\n\n\"We know they're not going to fall every night,\" Bledsoe said. \"We've just got to find ways to win.\"\n\nAlex Len had a season-high 16 points and T.J. Warren added 13 for the Suns, who put six players in double figures and never trailed. Phoenix snapped a two-game skid against the Kings.\n\nKosta Koufos led the Kings with 16 points off the bench, while Mario Belinelli and James Anderson added 15 apiece. Sacramento played without All-Star center DeMarcus Cousins for the second consecutive game because of a strained right Achilles.\n\n\"Bottom line, they made shots,\" said Kings guard Rajon Rondo, who had nine points and six assists. \"We have to watch film and see what we can learn from it. We have to get it right. We don't have a choice.\"\n\nPhoenix led by as many as 12 in the first half and held a 51-40 lead 53 seconds into the third quarter before Sacramento finally made a run midway through the period.\n\nLed by a pair of 3-pointers from Anderson, the Kings pulled even at 55-all on a running layup by Darren Collison with 7:48 left.\n\nBut that's when Knight took over. He hit a 3-pointer and scored seven points during an 11-0 spurt that put the Suns back ahead 66-55 with 4:55 to go in the third.\n\n\"Knight got hot as hell and made some 3s and got the lead back up to 11,\" Kings coach George Karl said. \"We didn't have enough energy or defense to figure out how to win the game. Defensively, we fall apart.\"\n\nP.J. Tucker added the last two of his three 3-pointers and Knight hit another 3 with a minute remaining as the Suns built a 14-point cushion before settling for an 81-69 lead after three.\n\n\"I think we are still developing, we're still getting better,\" Tucker said. \"We're still learning each other, playing with each other and especially on defense, we're figuring it out.\"\n\nPhoenix led by as many as 21 in the fourth.\n\n\"They scored 118 points, 63 points after we were tied,\" said Rudy Gay, who had nine points for Sacramento. \"I guess we got comfortable when we tied the game. That should be the time when we put our foot down and lay it on the line. We didn't. We kind of tucked our tail.\"\n\nTIP-INS\n\nKings: Gay, who entered averaging 18.5 points per game, shot 4 of 13 from the floor. ... Koufos was far more effective than he was in a start Tuesday night. Koufos, who scored 11 points but also committed five fouls in 26 minutes against Memphis, had 10 points and six rebounds in the first half alone. ... The Kings were 0 for 8 from 3-point range in the first half before finishing 11 for 24. Anderson hit the team's first 3 with 9:41 left in the third. ... Kings center Willie Cauley-Stein was scoreless in 16-plus minutes.\n\nSuns: Devin Booker, who had been questionable with a left ankle sprain, came off the bench in the second quarter. ... All of Knight's points came in the second half. ... Phoenix is 3-2 for the third straight year. ... All 13 players scored, and eight hit 3-pointers.\n\nRIGHT FROM THE START\n\nPhoenix's starting five shot 51 percent and outscored the Kings' starters 64-43. \"If we can continue to do that along with running the floor and getting easy ones, we'll be a very good team offensively,\" Hornacek said.\n\nMISSING YOU\n\nCousins has averaged 22.2 points and 11.9 rebounds against Phoenix, including a game-winner at the buzzer last season. Without him, the Kings are 11-35 since the 6-foot-11 center entered the NBA in 2010-11. Cousins is expected to return Friday at home against Houston.\n\nTHE GREATEST\n\nFormer heavyweight champion Muhammad Ali was in attendance.\n\nUP NEXT\n\nKings: Host Houston on Friday.\n\nSuns: Host Detroit on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994886.817015
}