{
  "game_id": "0022300143",
  "espn_id": "401584771",
  "date": "Nov 05, 2023",
  "matchup": "CHA @ DAL",
  "headline": "Luka Doncic, Mavs overcome LaMelo Ball's 30-point triple-double in 124-118 win over Hornets",
  "body": "DALLAS -- — Luka Doncic didn't have quite the fourth quarter that LaMelo Ball had.\n\n\r\n              The Dallas superstar did plenty to lead a bounce-back win for the Mavericks.\n\n\r\n              Doncic scored 23 points after a rare scoreless first quarter and the Mavericks overcame Ball's first 30-point triple-double in a 124-118 victory over the Charlotte Hornets on Sunday night.\n\n\r\n              Ball scored 23 of his 30 points in the fourth quarter while finishing with 13 assists and 10 rebounds. But the Hornets couldn't hold a 15-point first-half lead a night after rallying in the fourth for a one-point victory at Indiana.\n\n\r\n              “Just trying to win, really. Trying to do as much as I could,” said Ball, who was 8 of 9 from the field and 5 of 6 from 3-point range in the fourth, the highest-scoring quarter of his career. “Didn’t really go our way at the end.”\n\n\r\n              Grant Williams added 18 points, including a trio of 3s in the fourth quarter, and rookie Dereck Lively II had 15 points, 14 rebounds and a big fourth-quarter block for the Mavericks, who were coming off their first loss of the season.\n\n\r\n              The Hornets had a chance to tie after Dallas was called for a shot-clock violation with 8.4 seconds left. But rookie Brandon Miller couldn't get the ball in before a 5-second call, and Ball fouled Kyrie Irving before Dallas inbounded.\n\n\r\n              Irving's free throw gave the Mavs a 120-116 lead and they kept the ball, then he hit two more free throws with 7.7 seconds to all but seal Dallas' fifth victory in six games.\n\n\r\n              “I’m not going to say anything about that,” Charlotte coach Steve Clifford said about the late inbound play. “I didn’t see it. I have nothing to say about that.”\n\n\r\n              Doncic, who had just one scoreless first quarter last season, went 8 of 15 after his 0-for-4 start — but was just 1 of 9 from long range — while finishing with 12 rebounds and nine assists.\n\n\r\n              Irving had 18 points and 10 assists.\n\n\r\n              “When we have 77 and 11, it's an easy thing,” Dallas coach Jason Kidd said about Doncic and Irving. “I thought our quarterback was great, and our receivers were great with that.”\n\n\r\n              Gordon Hayward and P.J. Washington scored 20 apiece for the Hornets, and Mark Williams had 19 points and 10 rebounds.\n\n\r\n              Ball had 11 assists before getting his first points on a layup late in the first half, when Charlotte shot 57% and led 60-45 late in the second quarter. Hayward scored 15 points before the break.\n\n\r\n              The Mavs picked up their defense in the final minute of the first half, forcing three missed shots before Doncic's missed 3 in the final seconds left Dallas to settle for a 12-point deficit.\n\n\r\n              Dallas kept up the defensive effort, holding Charlotte to 42% shooting after the break.\n\n\r\n              Doncic picked up his second technical foul of the season after on foul call he didn't like, and was asking for another after he was whistled for bumping Hayward on a shot.\n\n\r\n              After Hayward missed both free throws, Doncic shouted to nobody in particular after grabbing the rebound, then hit a step-back jumper at the end other end, gesturing some more.\n\n\r\n              Doncic had 10 points and four assists in the fourth.\n\n\r\n              “We changed coverages,” Clifford said about trying to defend Doncic. “We really tried like four or five different things. And he just destroyed us. They had him for nine assists, but he created almost their entire offense. And we couldn’t figure out a way to stop him.”\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Washington on Wednesday night for the only home game in a five-game stretch.\n\n\r\n              Mavericks: At Orlando on Monday night as Dallas alternates road and home games for the first eight.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995667.9563131
}