{
  "game_id": "0021501178",
  "espn_id": "400829065",
  "date": "Apr 08, 2016",
  "matchup": "CHA vs. BKN",
  "headline": "Walker, Daniels lift Hornets to season sweep of Nets 113-99",
  "body": "CHARLOTTE, N.C. -- The Charlotte Hornets haven't given up hope of hosting a playoff series just yet.\nKemba Walker scored 22 points, Troy Daniels made his first five 3-point attempts and finished with 17 points, and the Hornets completed a four-game season sweep of the Brooklyn Nets with a 113-99 win on Friday night.\nWith the win, the Hornets (46-33) assured they'll be no lower than the sixth seed in the Eastern Conference playoffs. Charlotte pulled even with Miami for the fifth spot in the East -- one game behind fourth-place Boston -- although the Heat still hold the tiebreaker advantage over the Hornets.\n\"No matter what, this group of guys has done a great job,\" coach Steve Clifford said. \"We are becoming more relevant in the NBA. We've made the playoffs two out of the last three years -- and that is what good teams do.\"\nWalker, one of the league's most improved players this season, tallied his 41st game with at least 20 points.\nNicolas Batum had 14 points and Marvin Williams added 12 for the Hornets, who improved to 29-11 at home.\nThe Hornets began to take control midway through the third quarter.\nLeading by 10, Batum sank a 3-pointer from the wing and Walker drove the right side of the lane and scored on a leaning, one-handed up-and-under layup between two defenders. He capped the 7-0 run by scoring on a driving left hand layup following a Brooklyn turnover to push the lead to 17.\n\"I just wanted to be aggressive and take the best shots available,\" Walker said. \"I got a few on the fast breaks and my teammates did a great job as well. We came out and got a great lead and never looked back.\"\nThe Nets, who turned the ball over 15 times, never threatened after that.\nThe Hornets shot 51 percent in the first half to take a 50-43 lead with Walker and Daniels combining for 20 points on six 3-pointers.\nCody Zeller, who replaced Al Jefferson as the team's starting center earlier this season, tied a career high with five blocked shots.\nThe Hornets had at least 10 3-pointers for the 49th time this season, which is second to only the defending NBA champion Golden State Warriors (64).\nWayne Ellington had 21 points, and Thomas Robinson had 16 points and 17 rebounds for the Nets, who have lost seven straight.\nRobinson kept the Nets in the game early, recording a career-high 12 offensive rebounds before fouling out with 2:14 left in the game.\n\"He's got a great motor,\" interim coach Tony Brown said of Robinson. \"He plays hard when he's out there. He's always on the glass on both ends of the floor. He's putting himself in positions where he can finish around the rim or get fouled. He's been very productive with his minutes, showing people he belongs in the league.\"\nTIP-INS\nNets: Brook Lopez and Thaddeus Young were given the night off to rest.\nHornets: Charlotte won its 46th game for the first time since the 2000-01 season. ... Charlotte started its \"Win with Walker\" campaign, hoping to stir up support for him as the league's Most Improved Player. ... Jeremy Lamb (strained toe) did not play.\nBENCH PLAY\nClifford liked the idea that Daniels, Kaminsky (12 points) and Jeremy Lin (11) all scored in double figures, marking the 13th time this season three reserves have don't that in the same game. \"You never know who you're going to need in the postseason,\" Clifford said.\nWALKER IMPRESSES\nBrown said he's impressed with Walker's improvement in his pick-and-roll game.\n\"He's an automatic threat when he's on the floor,\" Brown said. \"This team would not be where they are without him.\"\nUP NEXT\nNets: Visit Indianapolis on Sunday.\nHornets: Visit Washington on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994338.183149
}