{
  "game_id": "0022200258",
  "espn_id": "401468413",
  "date": "Nov 22, 2022",
  "matchup": "DET @ DEN",
  "headline": "Pistons snap seven-game skid with 110-108 win over Nuggets",
  "body": "DENVER -- — Bojan Bogdanovic scored 22 points and the Detroit Pistons snapped a seven-game losing streak with a 110-108 win over the Denver Nuggets on Tuesday night.\n\n\r\n              The victory was the Pistons’ first on the road this season, as they had lost their previous 10. Detroit entered the night with a league-worst record of 3-15.\n\n\r\n              Former University of Colorado standout Alec Burks finished with 21 points for the Pistons, seven of which came in the fourth quarter.\n\n\r\n              “I think you have to get a win in those situations,” Pistons head coach Dwane Casey said. “As much as you want to play the young first- and second-year guys a lot of big minutes, you have to get a win to validate what you’re talking about and what you’re preaching and what we’re building.”\n\n\r\n              After missing the past three games while in the NBA’s COVID-19 protocols, Denver center Nikola Jokic had 31 points, 10 assists and nine rebounds, putting him just shy of his fourth triple-double of the season. \n\n\r\n              Jokic’s playing status was uncertain in the hours leading up to tip-off, as Nuggets head coach Michael Malone said before the game that he had “no idea” whether the reigning two-time NBA most valuable player would play after he cleared the NBA’s health and safety protocols.\n\n\r\n              “I just felt like I didn’t play for a while, like I didn’t move my body as much because I was sitting five days in my house doing a little bit of Peloton,” Jokic said.\n\n\r\n              After coming into the matchup making a league-best 40.9% of their 3-pointers, the Nuggets made just five of their 19 attempts from beyond the arc.\n\n\r\n              Leading by two entering the fourth quarter, the Pistons extended their advantage to 12, 96-84, on a transition dunk from Kevin Knox II that capped off an 11-1 run. \n\n\r\n              Denver trimmed that deficit to two, 104-102, following a hook shot from Jokic. With the Nuggets trailing by three with 2.2 seconds remaining, Denver guard Jamal Murray was fouled. After Murray made his first free throw and missed the second, teammate Aaron Gordon grabbed the rebound, but missed what would have been a game-tying jumper.\n\n\r\n              “We’ve been so close,” Pistons rookie center Jalen Duren said. “The last few games have been right there early on. Every game, we’re getting better. Everybody’s playing together. As a team, we’re all kind of growing. It showed tonight. The Nuggets are who they are. They’ve got the reigning MVP, they’ve got their guys back. For us to come out and grab a gritty win, it’s huge for us.”\n\n\r\n              It was the Nuggets’ first game since Nov. 9 in which they weren’t missing at least one of Jokic, Murray, Gordon or Bones Hyland, four of the team’s five leading scorers. In the five games without each of those four players, the Nuggets went 2/3 following an 8-3 start to the season.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: F Saddiq Bey did not play. Casey said Monday that Bey had flown back to Detroit to receive treatment for his sprained right ankle. Bey is fifth on the team in scoring, at 14.7 points per game.\n\n\r\n              Nuggets: Malone said he doesn’t believe veteran F Jeff Green’s right knee contusion is “anything too serious”, noting that it’s “more of a bone bruise.” Malone added that Green will be out for the “foreseeable future.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: at Utah Wednesday, the fifth game of a six-game road swing.\n\n\r\n              Nuggets: at Oklahoma City Wednesday",
  "source": "espn_api",
  "crawled_at": 1764994388.5497642
}