{
  "game_id": "0021600085",
  "espn_id": "400899535",
  "date": "Nov 05, 2016",
  "matchup": "MIL vs. SAC",
  "headline": "Teletovic, Parker lead Bucks to 117-91 win over Kings",
  "body": "MILWAUKEE -- The Milwaukee Bucks executed their game plan to perfection.\nMirza Teletovic scored 22 points and matched his career high with seven 3-pointers, Giannis Antetokounmpo added 17 points, eight assists and eight rebounds, and the Bucks beat the short-handed Sacramento Kings 117-91 on Saturday night.\n\"First, we are focused on the defensive end,\" Bucks coach Jason Kidd said. \"We are getting stops and then there are multiple guys touching the ball on one possession.\"\nThe Bucks have scored 117 points or more in each of the last three games for the first time since February 2009.\n\"We are passing up maybe a good shot to get a great shot,\" Kidd said. \"I think our guys really believe that.\"\nJabari Parker had 19 points and four steals for the Bucks, who pulled their starters after three quarters.\n\"Being able to get some rest in the fourth quarter was great for me,\" Antetokounmpo said. \"It's great for the guys with fresh legs, too.\"\nGarrett Temple scored 19 and tied his career-high with five 3-pointers and DeMarcus Cousins had 15 in the first half for the Kings, who slipped to 0-4 on their five-game road trip and gave up 100 points or more for the sixth consecutive game.\nThe Bucks forced 15 turnovers and converted them into 29 points.\n\"They covered up the paint very well and got some deflections,\" Kings first-year coach Dave Joerger said. \"They had 12 steals on our 15 turnovers and most of them were pick-sixes. They dribbled down and got a highlight dunk, an easy 3. It's hard to play uphill against that.\"\nMilwaukee outscored Sacramento 26-1 on fast-break points.\n\"On defense and half court, we're playing pretty well,\" Temple said. \"We just can't give up transition baskets.\"\nLeading 61-48 at the half, the Bucks opened the third quarter with a 21-3 run. Parker highlighted it with nine points, including a basket in traffic and the foul shot, leaving a disgusted look on Cousins' face as the three-point play pushed the lead to 80-51.\nThe Kings went scoreless for 5:14 before Temple's 3-pointer with 3:03 left in the quarter momentarily stopped the Bucks' surge.\nTeletovic made his first five 3-point attempts, Antetokounmpo had 11 points, eight assists and Parker added 10 points as the Bucks used a swarming defense and capitalized on the absence of Rudy Gay to force the Kings into 40.5 percent shooting from the floor in the first half.\nGay played with sore ribs in Thursday's loss to the Orlando Magic, but did not play against the Bucks. The Kings missed their second-leading scorer's 22.5 points and 5.3 rebounds, and his defense on Antetokounmpo.\nTIP-INS\nKings: The Kings had 20 points in the paint to the Bucks' 26 in the first half. . F Omri Casspi made his first start of the season filling in for Gay.\nBucks: Coming into Saturday's game, Antetokounmpo was the only NBA player averaging over 24 points, 8 rebounds, 6 assists and 2 blocks per game. ... C Miles Plumlee had three of the Bucks' eight blocks in the first half. . G Jason Terry missed the game to attend a funeral, but will join the team in Dallas.\nSWEET 15\nTeletovic, who set an NBA record (179) for the most 3-point makes in a reserve role last season, came off the bench and swished his first five 3-pointers in the first half. He made seven 3s on January 24, 2014, against Dallas while with the Brooklyn Nets.\nUP NEXT\nKings: On Sunday, the five-game road trip concludes against the Toronto Raptors.\nBucks: On Sunday, they travel to Dallas to face the Mavericks and their new center, Andrew Bogut, who was Milwaukee's No. 1 pick and first overall in the 2005 NBA draft.",
  "source": "espn_api",
  "crawled_at": 1764995227.608753
}