{
  "game_id": "0022200437",
  "espn_id": "401468592",
  "date": "Dec 16, 2022",
  "matchup": "LAL vs. DEN",
  "headline": "Davis injured, but LeBron leads Lakers past Denver 126-108",
  "body": "LOS ANGELES -- — LeBron James scored 30 points, Russell Westbrook had 15 points, 12 assists and 11 rebounds and the Los Angeles Lakers smoothly overcame Anthony Davis' latest injury in a 126-108 victory over the Denver Nuggets on Friday night.\n\n\r\n              Davis missed the second half with a right foot injury, but the Lakers still produced some of their prettiest team basketball of the season down the stretch of their second win in six games. Westbrook had his second triple-double off the bench this season, while Thomas Bryant scored 21 points, Austin Reaves 16 and Dennis Schröder 15.\n\n\r\n              “The pace changed, and the game changed,” Westbrook said. “You could see it. When we play that way, it's hard to beat us.”\n\n\r\n              The victory was particularly satisfying after the Lakers blew a late lead in regulation and lost to the Celtics in overtime on Tuesday night.\n\n\r\n              “It's huge, especially after the heartbreak loss we had last time against Boston,” James said. “We started to get defensive stops, and we were able to get out and execute offensively.”\n\n\r\n              Nikola Jokic had 25 points, 11 rebounds and eight assists for the Nuggets, whose three-game winning streak ended. Jamal Murray scored 23 points and Aaron Gordon had 17, but Denver couldn't keep up with the Lakers' second-half surge.\n\n\r\n              Coach Michael Malone lamented the Nuggets' lack of “urgency to get back, effort to get back, toughness, resiliency, whatever you want to call it” in the second half of their second loss in three meetings with the Lakers this season.\n\n\r\n              Davis apparently got hurt when the star big man landed awkwardly after a layup attempt under the basket in the first quarter, although he kept playing until halftime. Davis had X-rays at the arena, and coach Darvin Ham said Davis will be evaluated again Saturday before the Lakers determine the severity of the injury.\n\n\r\n              “(When) we know something, then we go from there,” James said. “Wish the best of news for sure, especially for AD.”\n\n\r\n              James took over at center in Davis' absence, sometimes guarding the 6-foot-11 Jokic and grabbing nine rebounds. He catalyzed LA's offense along with Westbrook, who revved up to produce one of his best halves of basketball since joining his hometown team last season.\n\n\r\n              Davis scored 10 points in the first quarter, but went scoreless in the second while playing eight minutes. He didn’t return from the locker room with his teammates for the second half.\n\n\r\n              The injury creates a new wave of uncertainty about Davis' perpetually problematic health. He is averaging 28.8 points and 12.4 rebounds per game this season despite managing lower back stiffness for several weeks.\n\n\r\n              After leading the Lakers to a 2020 championship in his first season alongside James, Davis played in about 50% of the Lakers’ games over the past two years while bedeviled by numerous injuries. The eight-time All-Star has missed only four games this season while enjoying a return to his dominant form from his best seasons in New Orleans and Los Angeles.\n\n\r\n              Denver and Los Angeles have already met three times this season, and they'll conclude their series Jan. 9 in Denver. Lakers coach Darvin Ham got his first career victory when his team beat the Nuggets on Oct. 30.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Michael Porter Jr. missed his 11th straight game with a heel injury, but he participated in Denver's shootaround. ... Denver got just 23 points off the bench.\n\n\r\n              Lakers: Wenyen Gabriel missed his sixth straight game with a sprained left shoulder. ... Juan Toscano-Anderson sat out with a sprained right ankle. ... James passed Hakeem Olajuwon for ninth place on the NBA's career steals list.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Charlotte on Sunday to open a four-game homestand.\n\n\r\n              Lakers: Host Washington on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994146.4807522
}