{
  "game_id": "0021600453",
  "espn_id": "400899895",
  "date": "Dec 23, 2016",
  "matchup": "PHX vs. PHI",
  "headline": "Booker, Bledsoe lead Suns past 76ers, 123-116",
  "body": "PHOENIX -- The Phoenix Suns sleepwalked through the first half and steamrolled through the second.\nThe result was a 123-116 come-from-behind victory over the Philadelphia 76ers on Friday night in a matchup of the struggling teams.\nEric Bledsoe scored 16 of his 24 points in the fourth quarter and had 11 assists for the Suns, who snapped a four-game losing streak.\nDevin Booker added 23 points for the Suns, making four 3-pointers, and T.J. Warren scored 19.\n\"They have dynamic guards (Bledsoe, Booker and Brandon Knight),\" Philadelphia coach Brett Brown said. \"...We had a hard time defending their backcourt.\"\nJoel Embiid, the highest-scoring rookie in the NBA, scored 27 points for the 76ers in the opener of a four-game trip to the West. Sergio Rodriguez added 21.\nPhiladelphia led by as many as 14 in the first half and was up by 13 at the break. The Suns built a 14-point lead in the fourth quarter before Philadelphia cut it to four in the waning seconds.\n\"At the start of the fourth quarter we just turned the ball over,\" Embiid said. \"We took a lot of bad shots and they just made a lot of shots, too. They've got good guards and got the shots they wanted.\"\nThe Suns outscored the 76ers 70-50 in the second half, 42-31 in the fourth quarter.\nBledsoe said that coach Earl Watson spent halftime \"cussing us out.\"\n\"He did what he should have done,\" Bledsoe said. \"We played like crap and he came out and did what a great coach should do: tell us what we did wrong, chew us out about it. Everybody got pumped up for the second half and it made a big difference.\"\nPhoenix's 123 points were a season high.\n\"Defense always creates offense,\" Watson said. \"It's easier to score when you have teams in transition.\"\nPhoenix took control for good with a 19-7 run that began with 8 1/2 minutes to play and ended on Warren's 3-pointer that put the Suns ahead 109-97 with 3:38 remaining.\n\"Especially toward the end of the game, we really locked in defensively and got the stops when we needed to,\" Warren said. \"We just need to get consistent, get defensive stops and execute on offense.\"\nTrailing by 13 at the break, the Suns made four 3-pointers, two by Booker, to open the second half with a 16-2 run, briefly taking the lead at 69-68 on P.J. Tucker's 17-footer. But Embiid sank a 3 at the other end and Philadelphia never trailed again in the quarter, leading 85-81 entering the fourth.\nTIP-INS\n76ers: Philadelphia was without reserve guard Nik Stauskas (bruised right knee). ... Richaun Holmes remains in the concussion protocol and is not with the team. ... Embiid entered the averaging 17.9 points. ... The 76ers' 31 first-quarter points were a season high.\nSuns: Phoenix committed five straight turnovers in a stretch of the first quarter but Philadelphia got only two points off them. ... At one point in the second quarter, a fan yelled at Watson: \"Coach, this ain't Golden State. How about playing some defense?\" ... The Suns' four-game losing streak had matched their longest of the season. ... Phoenix split the season series with Philadelphia 1-1.\nBIG FIRST HALF\nThe 76ers had their highest-scoring half of the season, leading by as many as 14 and taking a 66-53 lead at the break.\nPhiladelphia shot 52 percent in the first two quarters and was 16 of 16 from the foul line.\nT.J. McConnell's 3-pointer put the 76ers up 51-38 with 6:01 left in the half and Embiid's 15-footer gave Philadelphia a 61-47 lead. Phoenix cut it to eight but Philadelphia scored the last five points of the half, capped by Rodriguez's 3 to make it a 13-point game at the half.\nUP NEXT:\n76ers: Philadelphia continues its western swing at Sacramento on Monday night.\nSuns: Phoenix plays at Houston on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995985.905353
}