{
  "game_id": "0022400540",
  "espn_id": "401705106",
  "date": "Jan 12, 2025",
  "matchup": "DEN @ DAL",
  "headline": "Westbrook and Jokic help Nuggets erase double-digit deficit in 112-101 win over Mavericks",
  "body": "DALLAS -- — Russell Westbrook had 21 points, 10 rebounds and seven assists and Nikola Jokic added 19 points, 18 rebounds and nine assists as the Denver Nuggets rallied in the fourth quarter to beat the Dallas Mavericks 112-101 on Sunday.\n\n\r\n              The Nuggets trailed by 19 points late in the third period and by 12 early in the fourth. They outscored the Mavericks in the fourth period 33-12. After hitting only four of 25 3-pointers through three quarters, Denver shot 3 for 7 down the stretch while the Mavs missed all 11 3-point tries in the fourth.\n\n\r\n              The Nuggets won for the 12th time in 17 games.\n\n\r\n              Klay Thompson scored 25 points to lead the Mavericks, who are 2-5 playing without All-Star guards Luka Doncic (calf strain) and Kyrie Irving (back sprain). Thompson was scoreless on four shots, all 3-pointers, in the fourth period.\n\n\r\n              Takeaways\r\n              Nuggets: At 23-15, they’re eight games over .500 for the first time this season and 12-3 with Jokic and Westbrook in the starting lineup. Their 21.9% shooting on 3’s (7 of 32) was their poorest this season. Aaron Gordon returned for the first time since Christmas and had 13 points on 6-for-7 shooting from the floor and six rebounds in 18 minutes.\n\n\r\n              Mavericks: Doncic placed third in last season’s MVP balloting, but is ineligible this season as of Sunday, unable to reach the threshold of playing in at least 65 regular-season games.\n\n\r\n              Key moment\r\n              With Mavericks center Dereck Lively II playing with five fouls, Jokic spun inside against forward P.J. Washington for a finger-roll basket with 4:28 to play. That gave the Nuggets a 99-96 lead, their first lead of more than one point.\n\n\r\n              Key stat\r\n              The Nuggets outscored the Mavericks 68-40 in the paint.\n\n\r\n              Up next\r\n              The teams will meet again in Dallas on Tuesday night in their final regular-season meeting of the season.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998348.472476
}