{
  "game_id": "0021500406",
  "espn_id": "400828293",
  "date": "Dec 20, 2015",
  "matchup": "PHX vs. MIL",
  "headline": "Middleton, Carter-Williams lead Bucks past Suns 101-95",
  "body": "PHOENIX -- The Milwaukee Bucks had lost 12 straight road games since early November.\nThat streak came to a satisfying halt Sunday. Khris Middleton scored 11 of his 26 points in the fourth quarter and Greg Monroe hit a spinning, go-ahead layup with 20.6 seconds left to lift Milwaukee over the Phoenix Suns 101-95.\nBucks coach Jason Kidd said after the game that he will be taking an indefinite leave to have hip surgery. Assistant Joe Prunty will direct the team in his absence.\nMilwaukee will try to carry over Sunday's success without Kidd.\n\"We didn't want to home without a win,\" Middleton said. \"We competed, we got stops, we pushed the ball up and executed.\"\nEric Bledsoe had his potential tying layup blocked by Michael Carter-Williams with 7.9 seconds left, and Middleton hit four free throws in the final 5 seconds.\n\"I just turned the ball over,\" Bledsoe said. \"It is was it is. I have to take better care of the ball, especially down the stretch.\"\nCarter-Williams had 20 points, nine rebounds and six assists. Bledsoe and T.J. Warren led the Suns with 18 points each.\nThe Bucks' O.J. Mayo was called for a flagrant foul after yanking down Warren on a fast-break layup attempt with 7:28 left. Warren hit the two free throws, and on the ensuing possession, Jon Leuer hit a 3-pointer for an 86-77 Phoenix lead.\nMilwaukee then went on a 15-2 run to lead 92-88, with Middleton scoring seven points during the stretch.\nThe Suns scored seven of the next eight points, but then Carter-Williams hit a seven-footer, Mayo blocked Bledsoe's shot and then Monroe hit his layup.\n\"(Coach Jason Kidd) called my number,\" Monroe said. \"Just trying to make sure I got a good basket and got something going to the rim.\"\nThe Suns took a 15-point lead in the third quarter, but the Bucks cut it to 71-70 in the final seconds on Middleton's jumper. Middleton, whose buzzer-beater won last season's game in Phoenix between the two teams, added seven assists.\n\"It started in the third. You have a chance to blow it away,\" Suns coach Jeff Hornacek said. \"Middleton got going there, we let Michael Carter-Williams go where ever he wanted, then you are in a battle.\"\nThe Suns committed 20 turnovers and the Bucks blocked six shots.\n\"Making plays on the defensive end, and on the offensive end sharing the ball ... setting screens and sharing the ball were big down the stretch,\" Kidd said.\nThe Bucks had a 9-0 run early in the first quarter and led by as many as 11 points before the Suns finished the quarter strong. Three-pointers from Markieff Morris and Ronnie Price in the final 1:08 helped the Suns trim the lead to 27-26 going into the second quarter.\nThe Suns led by as many as nine points in the second quarter, going up 44-35 on a 3-pointer from Mirza Teletovic at the 4:20 mark. Warren scored 12 points in the quarter.\nCarter-Williams had 11 first-half points and five rebounds to lead Milwaukee, but the Suns led 53-45 at halftime.\nMilwaukee forward Jabari Parker's rookie season ended in Phoenix last December when he tore the ACL in his left knee. He played 27 minutes and scored seven points for the Bucks.\nKIDD'S LEAVE\nKidd said he'd tried to put off the operation, but that his doctor \"advised that the best course of action was to have the procedure now.\"\nPrunty is in his 20th season coaching in the NBA. He worked under Kidd during his one season coaching Brooklyn and his two years with the Bucks. Prunty is also the head coach of Britain's men's national team.\n\"I have every confidence in Joe to lead our team during my absence,\" Kidd in a release. \"Joe has many years of coaching experience both in the NBA and in international competition. He's well-respected in the league and I know our players and coaches will give their all during Joe's time as head coach.\"\nTIP-INS\nBUCKS: F Giannis Antetokounmpo was held out with knee soreness, and Mayo replaced him in the starting lineup. ... The Bucks are 3-20 against the Suns at Talking Stick Resort Arena since the building opened for the 1992-93 season and Milwaukee has won three of the last four games between the teams in Phoenix. ... G Jerryd Bayless (left ankle sprain) and G Greivis Vasquez (right ankle) did not play.\nSUNS: Hornacek is still one win away from 100 as head coach. ... C Alex Len blocked a shot in his 12th straight game. ... Leuer made his 13th start of the season and 11th consecutive start at forward. \"He does little things that don't show up on the stat sheet. I always liked those guys,\" Hornacek said. ... The Suns are 0-10 when scoring fewer than 100 points in a game.\nDOUBLE TECHS\nMorris and Mayo got into a minor scuffle in the first quarter and were each given a technical foul.\nWATCHING PIGSKIN\nMidway through the third quarter, Morris momentarily leaned over for a view of a TV monitor at the announcers' table courtside showing the Steelers-Broncos game. Morris saw the score, then checked backed into the game.\nUP NEXT\nBucks: Host Philadelphia on Wednesday night.\nSuns: At Utah on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994865.067179
}