{
  "game_id": "0021800731",
  "espn_id": "401071404",
  "date": "Jan 26, 2019",
  "matchup": "MEM vs. IND",
  "headline": "Conley, Jackson get Grizzlies past Pacers to end 8-game skid",
  "body": "MEMPHIS, Tenn. --  Staring at an eight-game losing streak and a week of distraction from trade rumblings, the Memphis Grizzlies brought things back to simplicity.\n\nAnd the approach was successful for the struggling squad.\n\nMike Conley had 22 points and 11 assists, Jaren Jackson Jr. added 20 points and Memphis beat the Indiana Pacers 106-103 Saturday night bringing brief relief to the Grizzlies troubles that stretch back to late December.\n\n\"I thought everybody just put everything aside tonight,\" Conley said of the change in mindset. \"We said before the game: `Just go out there and play basketball. It's just basketball.' And that's what we did.\"\n\nThe win was only the second for Memphis in the last 16 games after defeating the Cleveland Cavaliers on the day after Christmas.\n\nWhile Memphis has injury issues to add to its miseries, the Pacers have a major one to address. Indiana was playing its first game since a season-ending injury to Victory Oladipo.\n\nOladipo ruptured the quad tendon in his right knee in Wednesday night's victory over Toronto, leaving the Pacers without their leading scorer at 18.8 points a game.\n\n\"It was a lot of emotions,\" Pacers coach Nate McMillan said. \"Whenever you lose a guy to an injury such as that -- a season-ending injury -- a lot of emotions are involved. But what you have to do, which is part of the game, you have to move on.\"\n\nForward Thaddeus Young added: \"We're just trying, as a team, to find ourselves without Victor Oladipo. That's one of the biggest things. Our offense was a little stagnant as opposed to having Victor out there.\"\n\nBojan Bogdanovic scored 21 points to lead the Pacers, who saw their three-game winning streak end. Darren Collison had 18 points and nine assists, while Myles Turner scored 14 points\n\nMcMillan pointed to a slow start when the Pacers made only two of their first 10 shots as a major issue. That allowed Memphis to take a lead it never relinquished in the game.\n\nBut the way Memphis closed the third quarter also had a bad effect. Indiana had come back from 11 down in the third to tie the score at 67. However, the Grizzlies answered the rally with their own to carry a 78-69 lead into the fourth.\n\n\"We punched back, and we were able to find the theme that made us able to hit the punch again,\" said Marc Gasol, who added 18 points for Memphis.\n\nIn the closing minutes of the fourth, both teams were accurate from outside the arc -- Memphis converting four in the period to build the lead to 14, and Indiana making five close the deficit at the end.\n\nTIP-INS\n\nPacers: Tyreke Evans started in the injured Oladipo's place and finished with nine points. G Aaron Holiday moved into the reserve guard position vacated by Evans moving to the starting role. ... Bogdanovic was 6 of 14 from the field. ... Turner blocked two shots.\n\nGrizzlies: Starting F Garrett Temple is out 1-2 weeks after injuring his shoulder late in the first quarter of Friday night's loss to Sacramento. An examination of the injury revealed a mild sprain. ... F Omri Casspi, who filled in after Temple's injury and led the team in scoring against the Kings, also sat out Saturday with right knee soreness. That left rookie G Jevon Carter to get the first start of his career. ... Bruno Caboclo, playing his second game on a 10-day contract, added 11 points, including converting 3 of 4 from outside the arc.\n\nTHE FEELING OF WINNING\n\nThere was certainly a different atmosphere in the Grizzlies' locker room, from a smiling Gasol to a much happier Jackson.\n\n\"It's definitely something that you can't take for granted,\" Conley said. \"You forget what it feels like. When you start losing, everything is bad. Your body starts to hurt and everything is negative. When you're winning, you walk out the arena feeling good, you can go home and be happy around your family and things like that.\"\n\nJERSEY SWAP\n\nAfter the game, Grizzlies reserve C Joakim Noah was seen entering the Pacers locker room, but not with ill intentions. Noah was looking for former teammate Kyle O'Quinn. Seems that Noah was fulfilling a request by O'Quinn for a game-worn jersey.\n\nNoah did give the Pacers' center some grief for putting \"that dirty, sweaty jersey\" in his travel bag.\n\nUP NEXT\n\nPacers: Host Golden State on Monday night.\n\nGrizzlies: Host Denver on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994920.0999649
}