{
  "game_id": "0021800435",
  "espn_id": "401071116",
  "date": "Dec 15, 2018",
  "matchup": "PHX vs. MIN",
  "headline": "Suns beat Wolves for first 2-game win streak of season",
  "body": "PHOENIX --  Victories are rare for the Phoenix Suns. Winning streaks seem downright historic.\n\nDevin Booker returned from a six-game absence to score 28 points and Phoenix beat the Minnesota Timberwolves 107-99 on Saturday night, giving the Suns consecutive wins for the first time in almost a year.\n\nDeandre Ayton had 18 points and 12 rebounds for the Suns, including 10 points and five boards in the fourth quarter, when Phoenix pulled away. T.J. Warren added 21 points for Phoenix.\n\nAfter being sidelined with a strained hamstring, Booker returned to make 10 of 16 shots and added seven rebounds and seven assists in 36 minutes.\n\n\"Getting a win? It's fun,\" he said. \"I'm just having fun playing with high energy. Crowd's involved, fans are involved, playing good basketball. Nothing more than that I could ask for. Just going out there, playing the right way, playing together.\"\n\nThe Suns (6-24), coming off a victory over Dallas on Thursday, last won two in a row on Dec. 26-29, 2017.\n\n\"We never play in a game to lose,\" Phoenix first-year coach Igor Kokoskov said. \"We play every quarter to win and give our best, everything we have. ... We are going to try to keep playing well, playing together as a team, and then anything happens after that.\"\n\nKarl-Anthony Towns scored 28 for the Timberwolves but only seven in the second half.\n\n\"We didn't make shots,\" he said. \"We didn't execute well throughout the game and our mistakes piled up at the end.\"\n\nDerrick Rose added 25 for Minnesota, which finished 0-4 on a western road trip and is 2-12 on the road this season.\n\n\"We didn't come out with the urgency of a team that wanted to win the game,\" Rose said. \"I think that's how this game is played. You can't come out lackadaisical, you can't come out nonchalant. You've got to come out and play as hard as you can, especially when you've lost three in a row, and it shows. Tonight we lost four.\"\n\nThe Suns played without Trevor Ariza after agreeing to trade him to Washington for Kelly Oubre Jr. and Austin Rivers, a person familiar with the deal told The Associated Press on condition of anonymity because it had not been announced by either team.\n\nNeither team led by more than six points in a tight first half that ended with Minnesota up 58-56.\n\nBooker, who had been out with a strained hamstring, scored the first four in a 6-0 spurt that gave the Suns an 85-77 lead with 1:20 left in the third quarter. Josh Jackson's dunk capped the spurt on a fast break after Mikal Bridges' block of Andrew Wiggins' shot. Dario Saric sank a 3 and Wiggins hit a 19-footer to cut the Suns' lead to 85-82 entering the final period.\n\nAfter Rose's basket to start the fourth quarter cut it to 85-84, Phoenix scored 11 straight, including Ayton's three-point play, to lead 96-84 on Warren's bank shot with 6:59 left.\n\nRose scored five straight to make it a seven-point game but Ayton and Warren each scored inside and Minnesota never threatened seriously again.\n\n\"We didn't play good defense,\" Minnesota coach Tom Thibodeau said, \"and then in the fourth quarter, we didn't make the right plays.\"\n\nTRADE IN PROGRESS\n\nWhile the Suns wouldn't confirm the trade, Ariza was officially \"not with the team.\" The deal is expected to be finalized on Monday, when the Suns are in New York to face the Knicks to start a six-game road trip.\n\nTIP-INS\n\nTimberwolves: Taj Gibson was out for personal reasons. He had started every game this season. ... Minnesota is 0-11 on the road against Western Conference teams. ... Minnesota's only road wins are at Brooklyn and at Cleveland. ... Minnesota was 2 of 12 on 3-pointers in the first half and finished 7 of 35.\n\nSuns: Suns have held consecutive opponents under 100 points for first time since Jan. 3-5, 2017. ... Phoenix's victory over Dallas on Thursday was its first of the season without Booker. ... Booker made seven of his first eight shots. ... Jackson missed his first seven shots and finished 2 of 10 from the field. .... The 17 lead changes were most in a Suns game this season.\n\nUP NEXT\n\nTimberwolves: host Sacramento on Monday.\n\nSuns: at New York on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995087.99402
}