{
  "game_id": "0021800769",
  "espn_id": "401071442",
  "date": "Jan 31, 2019",
  "matchup": "LAL @ LAC",
  "headline": "With LeBron back, Lakers outlast Clippers in OT 123-120",
  "body": "LOS ANGELES --  LeBron James looked like his old self, even if he wasn't feeling like it after his first game since Christmas.\n\nJames had 24 points and 14 rebounds in his return from a 17-game injury absence, and the Los Angeles Lakers beat the Clippers 123-120 in overtime Thursday night after blowing a 14-point, fourth-quarter lead.\n\n\"Definitely ecstatic about being back out there with my guys,\" he said, \"but being out five weeks, I'm feeling it right now. I wish I could click my shoes together right now and be home in my bed.\"\n\nJames came up one assist shy of a triple-double. He made 5 of 7 free throws, had four turnovers and no fouls in 40 minutes of his first game since Dec. 25 at Golden State, when he strained his left groin.\n\n\"I'm looking forward to seeing how I feel tomorrow,\" he said. \"That's going to be the telltale sign of all the rehabbing and the working and everything I've been putting in these last five weeks.\"\n\nThe Lakers were 6-11 during the longest absence of his 16-year career.\n\n\"He looked good,\" said Tobias Harris, who guarded James much of the game.\n\nTied 118-all, James scored the go-ahead basket in overtime. Lance Stephenson drove for a flailing layup, hitting Boban Marjanovic in the nose with his left elbow while getting fouled. After a review by the officials, no additional penalty was called.\n\nThe review was for \"a possible or potential hostile act,\" crew chief John Goble told a pool reporter after the game.\n\nGoble said the on-court ruling was a defensive foul and there was no additional contact.\n\nStephenson completed the three-point play that kept the Lakers ahead 123-118.\n\n\"I don't know how you can come to that call,\" Clippers coach Doc Rivers said. \"You make contact with the head, it's a flagrant. It was too obvious. It was an elbow to the face. Why put in those rules if you're not going to call it?\"\n\nMarjanovic's teammate Lou Williams added, \"Boban gets penalized so much for being big. If you elbow a guy away from the basket, it should be an offensive foul.\"\n\nAvery Bradley and Williams missed on the same possession, and Williams missed a free throw when Stephenson got called for a technical in a tussle with Bradley. The Clippers were 14 of 26 from the foul line.\n\nWilliams couldn't get a potential tying 3-pointer off in the right corner before the final buzzer.\n\nStephenson added 20 points and matched a career high with five 3-pointers for the Lakers. Brandon Ingram added 19 points, and Rajon Rondo had 14 points and 13 rebounds. They enjoyed strong support from the Staples Center crowd as the visiting team.\n\nWilliams led the Clippers with 24 points. Patrick Beverley added 17.\n\nHarris hit a 3-pointer with 35 seconds left in regulation, tying it at 112-all after the Clippers fought back after trailing by 14 early in the fourth.\n\n\"The good thing is we kept fighting all night,\" Harris said.\n\nThe Lakers led by seven with just under two minutes to play, but the Clippers erased the deficit on baskets by Williams and Marjanovic before Harris scored from near the right baseline.\n\nJames scored five of the Lakers' first seven points in the fourth for a 94-85 lead.\n\nThe Clippers made 5 of 7 free throws to close to 103-101.\n\nThe Lakers gained a 14-point lead near the end of the third quarter on Stephenson's 3-pointer. They outscored the Clippers 33-22 in the period.\n\nTIP-INS\n\nLakers: They improved to 11-13 on the road. ... James is the leading vote-getter for the All-Star Game, where he will captain the Western Conference team. ... Kyle Kuzma (left hip strain) and Josh Hart (left knee tendinitis) also returned.\n\nClippers: Bradley played with a sore right knee and then strained his right quad during the game. ... Longtime fan Billy Crystal joined retiring play-by-play announcer Ralph Lawler to call the game. ... F Danilo Gallinari (low back spasms) missed his seventh straight game. He will join the team on its upcoming road trip and likely return either Sunday at Toronto or Tuesday at Charlotte.\n\nNO ALL-STAR\n\nHarris' bid to make the All-Star team for the first time in his eight-year career failed. Rivers said he texted and emailed his fellow coaches to no avail. He believed Harris had made a solid case by being the leading scorer on a winning team in the rugged Western Conference.\n\nUP NEXT\n\nLakers: At Golden State on Saturday in the second game of their six-stop Grammy road trip.\n\nClippers: At Detroit on Saturday to start a six-game Grammy trip.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995445.7258408
}