{
  "game_id": "0021800455",
  "espn_id": "401071136",
  "date": "Dec 19, 2018",
  "matchup": "CHA vs. CLE",
  "headline": "Walker scores 30 as Hornets beat Cavaliers 110-99",
  "body": "CHARLOTTE, N.C. --  Kemba Walker admitted he was frustrated watching his shots misfire for the third straight game as the Charlotte Hornets fell behind by double digits in the first half.\n\nHowever, the two-time All-Star kept pushing, prodding and eventually found his way with 30 points and six assists as the Hornets rallied to beat the Cleveland Cavaliers 110-99 Wednesday night.\n\n\"It's frustrating,\" Walker said of missing the first seven shots one game after scoring a season-low four points on two of 13 shooting last Saturday. \"It was shots that I usually make and shots that I work on all the time.\n\n\"Sometimes, you've just got to stick with it and try your best not to let the frustration get to you. You know, keep positive thoughts and just keep on pushing through.\"\n\nA reverse layup with 4:49 left in the first half got Walker untracked and he finished shooting 11 of 26, including 4 for 12 on 3-pointers, as the Hornets even their record at 15-15.\n\nIt was the ninth game of the season with at least 30 points for Walker, and helped Charlotte stop a two-game losing streak.\n\nHornets coach James Borrego said he had a simple message for Walker during his first half struggles.\n\n\"Yes -- keep shooting,\" Borrego said. \"He's been doing this his entire life. I said, `Stay confident, keep shooting and we're going to keep looking for you.',,, Sometimes players need to see one drop, then two drop and three drop and he got rolling there.\"\n\nJeremy Lamb added 18 points and 12 rebounds, and Marvin Williams had 18 points and 10 boards for Charlotte.\n\nJordan Clarkson scored 20 points, Jaron Blossomgame had 15 and Cedi Osman added 13 for the Cavaliers.\n\nAfter the Cavaliers pulled to 88-82 with 8:52 left in the game, Charlotte started a 17-4 run to seal the win.\n\nCleveland center Larry Nance, Jr., whose team led 38-25 in the middle of the second quarter and 46-41 at halftime, had on a one-name answer when asked what the difference in the game was.\n\n\"Kemba,\" Nance said. \"He started to heat up in that third quarter and really just took over. Any time a player like that gets going, it's hard to slow him down.\"\n\nAfter going scoreless on 0-for-5 first-quarter shooting, Walker scored nine points in the second quarter while shooting 4 for 8, and added 17 points in the third quarter (6-for-9 shooting) and four points in the fourth quarter (on 1 for 4).\n\nTIP INS\n\nCavaliers: Jordan Clarkson returned to action after missing Tuesday's game at Indiana. ... Matthew Dellavedova missed Wednesday's game with left knee soreness.\n\nHornets: It was was their fourth of a five-game homestand. ... After Friday's game -- Charlotte's 19th home game of the season -- the Hornets will play 29 of their final 51 games on the road. Charlotte's front-loaded home schedule is due to the Spectrum Center hosting NBA All-Star Weekend (Feb. 15-17) in addition to two college basketball tournaments.\n\nUP NEXT\n\nCavaliers: Visit Toronto on Friday night.\n\nHornets: Host Detroit on Friday night.\n\n---\n\nMore AP NBA: www.apnews.com/nba and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994405.528451
}