{
  "game_id": "0021800553",
  "espn_id": "401071229",
  "date": "Jan 01, 2019",
  "matchup": "PHI @ LAC",
  "headline": "76ers survive late threat from Clippers to win 119-113",
  "body": "LOS ANGELES --  The energy was flowing late and that's just the way the Philadelphia 76ers like it.\n\nJoel Embiid notched his NBA-leading 32nd double-double of the season in his return and Philadelphia withstood a furious rally by the Los Angeles Clippers in a chippy fourth quarter for a 119-113 victory on Tuesday night to open the new year.\n\n\"The game was physical and I like it physical and aggressive,\" Embiid said. \"This was a huge win for us.\"\n\nEmbiid was a game-time decision after missing one game because of a sore left knee. He didn't appear hindered while recording 28 points and 19 rebounds. He scored 15 points in the first quarter, including 10 of the Sixers' final 16.\n\n\"My goal is to be dominant every game,\" Embiid said. \"If I dominate, the numbers will come, but most important is that we win.\"\n\nHe hit a 3-pointer early in the second, one of five by the Sixers in the period that propelled them to a 76-58 halftime lead. They built their largest lead of the game -- 24 points -- on a 3-pointer by Landry Shamet.\n\n\"Give Philly credit,\" Clippers coach Doc Rivers said. \"They were the instigator all game. They deserved to win. They played harder for longer.\"\n\nThe Clippers closed within four in the fourth on Montrezl Harrell's three-point play. He was rejected by Embiid but got the ball back and scored, drew the foul and made the free throw.\n\nBut Embiid scored to keep the Sixers ahead 114-108. Lou Williams and Harrell combined to miss 3 of 4 free throws and Ben Simmons scored. Simmons punctuated the win with a huge dunk.\n\nFormer Clipper JJ Redick added 18 points and Jimmy Butler scored 16 before being ejected to help Philadelphia improve to 8-11 on the road. Simmons just missed a triple-double with 14 points, nine rebounds and eight assists.\n\n\"I'd get (angry) if those guys were doing those things to me that they were doing to Jimmy and Joel,\" Simmons said. \"But we made key buckets down the stretch and played tough defense. I'm getting more comfortable with my jumper and our team is learning to play their roles and we're playing better together.\"\n\nThe Clippers outscored the Sixers 30-25 in the third and 25-18 in the fourth.\n\n\"We waited too long and had to fight and ran out of gas,\" Harrell said.\n\nWilliams led the Clippers with 22 points off the bench. Tobias Harris and Danilo Gallinari finished with 21 points each and Harrell had 20 points and 10 rebounds.\n\nThe Clippers alternated their two tallest players -- 7-foot Boban Marjanovic and 6-11 Marcin Gortat -- on Embiid, but he thwarted their effort by making 8 of 12 free throws.\n\n\"Every time we got physical with him it turned into a foul,\" Harrell said.\n\nLed by its bench, Los Angeles outscored the Sixers 30-25 in the third, closing with a 10-2 run, but still trailed 101-88 going into the fourth.\n\nThat's when things got chippy.\n\nEmbiid and Patrick Beverley received offsetting technicals at 9:32 after tangling. Embiid grabbed a rebound and Beverley yanked his jersey. Jonah Bolden pulled Beverley off Embiid in a mass of players.\n\n\"I was going for the ball and I got hit in the face and I freaked out because I got hit where I had surgery and I didn't want it to be re-injured,\" Embiid said.\n\nAvery Bradley and Butler got tied up going for a rebound and shoved each other. Referees and security were quick to come on the court and separate the players. They were each hit with technicals and ejected with 7:01 to play.\n\n\"We got too close to one another and the same things happen: some pushing, some shoving, some technical fouls and we got ejected,\" Butler said.\n\nTIP-INS\n\n76ers: Simmons was cheered by model Kendall Jenner, who sat courtside. ... Embiid went over the 3,000-point mark in his career. ... They improved to 2-2 on their season-long five-game trip. ... G Markelle Fultz (thoracic outlet syndrome) is with the team while undergoing physical therapy, but there is no timetable for his return.\n\nClippers: F Luc Mbah a Moute (sore left knee) missed his 33rd straight game.\n\nUP NEXT\n\n76ers: At Phoenix on Wednesday in the second game of a back-to-back.\n\nClippers: Have two days off before playing at Phoenix on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994037.425396
}