{
  "game_id": "0022201081",
  "espn_id": "401469236",
  "date": "Mar 21, 2023",
  "matchup": "SAC vs. BOS",
  "headline": "Jayson Tatum's 36 points lead Celtics past Kings 132-109",
  "body": "SACRAMENTO, Calif. -- — Jayson Tatum scored 36 points and the Boston Celtics ended a long road trip on a high note by beating the Sacramento Kings 132-109 on Tuesday night.\n\n\r\n              Boston bounced back from blowing a 19-point lead in Utah on Saturday night by knocking off one of the top teams in the Western Conference. It won four of six on the trip.\n\n\r\n              Jaylen Brown added 27 points and Derrick White scored 20 to help the Celtics open up a one-game lead over Philadelphia in the Atlantic Division.\n\n\r\n              “He just did a great job coming out of the gate,” Celtics coach Joe Mazzulla said of Tatum. “I thought him and Jaylen did a great job controlling the game with their decision-making.”\n\n\r\n              Domantas Sabonis had 16 points, 13 rebounds and 12 assists for the Kings, who lost consecutive games for the first time since Feb. 3-5. De'Aaron Fox scored 18 points.\n\n\r\n              “They kicked our behinds,” coach Mike Brown said. “It started with me. We all got our behinds kicked. There's nothing tricky or hidden behind what I'm saying. They switched everything and turned us over.”\n\n\r\n              Sacramento fell 1 1/2 games behind Memphis in the race for second place in the Western Conference. The Kings are trying to clinch their first playoff berth since 2006 — the longest postseason drought in NBA history.\n\n\r\n              Playing their fifth game in seven nights in their fourth time zone, the Kings offered little defensive resistance for Boston.\n\n\r\n              The Celtics shot 53.3% from the field, turned the ball over only five times and took control of the game during a torrid shooting stretch coming out of halftime.\n\n\r\n              “I was pleased with the mindset,” Mazzulla said. “The most important thing is we managed the turnovers. … We have to maintain a level of perspective. This was a hard road trip.”\n\n\r\n              Boston hit 10 of its first 11 shots from the field in the third quarter, scoring 27 points in less than six minutes to build the lead up to 14 points on a 3-pointer by White. \n\n\r\n              The Kings never really threatened after that.\n\n\r\n              “I feel like we all kind of felt it today,” Sabonis said. “It’s not an excuse. That’s a part of the schedule. Every team goes through it. At the end of the day we just had to fight through it and do a better job in the second half.”\n\n\r\n              The Celtics scored the final nine points of the first half on 3-pointers by Al Horford and Brown, and a three-point play by Tatum to take a 60-54 lead at the break.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: C Robert Williams III (hamstring) returned after missing the past eight games. He had six points and seven rebounds in 21 minutes off the bench. He was also called for a technical foul in the third quarter. ... The Celtics had 22 assists before committing their second turnover of the game midway through the third quarter. \n\n\r\n              Kings: Swingman Kevin Huerter (knee) missed his third straight game but could return to practice on Thursday. ... Keegan Murray's 3-pointer in the first quarter gave him at least one in 33 straight games, tying the NBA rookie record held by Landry Shamet (2018-19) and Rudy Fernandez (2008-09). ... Sabonis' 12 triple-doubles are second in the league this season to Denver’s Nikola Jokic, who has 28.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Indiana on Friday night.\n\n\r\n              Kings: Host Phoenix on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995285.092236
}