{
  "game_id": "0022400166",
  "espn_id": "401704732",
  "date": "Nov 04, 2024",
  "matchup": "TOR @ DEN",
  "headline": "Westbrook scores 21 points, Jokic has a triple-double and the Nuggets beat the Raptors 121-119",
  "body": "DENVER -- — Russell Westbrook scored 21 points and played smothering defense on the final play of the game, and the Denver Nuggets beat the Toronto Raptors 121-119 on Monday night.\n\n\r\n              Nikola Jokic had 28 points, 14 rebounds and 13 assists for his third triple-double in four games for Denver, which played without Jamal Murray (concussion protocol) and lost Aaron Gordon to a right calf strain in the first quarter.\n\n\r\n              The Nuggets trailed 109-98 with 5:45 left but rallied to take a 118-117 lead on Peyton Watson’s 3-pointer. The teams traded baskets and Julian Strawther split a pair of free throws with 12 seconds left.\n\n\r\n              That gave Toronto a chance but on the final play Westbrook blanketed RJ Barrett, whose 26-footer to win it at the horn was short.\n\n\r\n              Barrett finished with 18 points while Gradey Dick had 26 and Jakob Poeltl scored 24.\n\n\r\n              Takeaways\r\n              Raptors: Help might be on the way sooner than expected. Forward Scottie Barnes (orbital fracture) won’t need surgery at this point, according to coach Darko Rajakovic. Barnes has not played since the home loss to Denver on Oct. 28\n\n\r\n              Nuggets: The injuries have put more pressure on the bench to come through. Swather has played well the last few games and Hunter Tyson is making the most of his opportunity.\n\n\r\n              Key moment\r\n              Toronto led by six before Poeltl picked up his fifth and sixth fouls in a span of 23 seconds. The Nuggets outscored the Raptors 14-8 after Poeltl fouled out.\n\n\r\n              Key stat\r\n              Jokic has three triple-doubles in the last four games and missed a fourth by one rebound against Minnesota on Friday night. He also had seven turnovers against Toronto.\n\n\r\n              Up next\r\n              The Raptors travel to Sacramento on Wednesday night while the Nuggets host Oklahoma City for the second time in two weeks.\n\n\r\n              ------\n\n\r\n              This story has been corrected to fix the spelling of Gradey Dick's first name and to correct Jokic to 13 assists.\n\n\r\n              ------\n\n\r\n              AP NHL: https://www.apnews.com/hub/NHL",
  "source": "espn_api",
  "crawled_at": 1764997003.2340622
}