{
  "game_id": "0021600218",
  "espn_id": "400899668",
  "date": "Nov 23, 2016",
  "matchup": "DET vs. MIA",
  "headline": "Pistons rout Heat 107-84 to end four-game skid",
  "body": "AUBURN HILLS, Mich. --  Andre Drummond and the Detroit Pistons turned what was supposed to be a matchup of two of the NBA's best young centers into a blowout.\n\nDrummond had 18 points and 15 rebounds, while Hassan Whiteside finished with six points and eight rebounds as the Pistons routed the Miami Heat 107-84 on Wednesday night.\n\nDrummond also blocked four shots and had four steals.\n\n\"I know he wasn't happy with himself after our last game, but whatever he did to get ready tonight worked,\" Pistons coach Stan Van Gundy said. \"He did a hell of a job. That might be the best defensive game he's played here.\"\n\nWhiteside had set a franchise record with 10-plus rebounds in each of the season's first 13 games.\n\n\"I just wasn't closing out, and he got some rebounds,\" Whiteside said. \"They got some offensive rebounds, and I even knocked one into the wrong basket. It was that kind of night.\"\n\nDetroit snapped a four-game losing streak. The Pistons, who got 22 points from Kentavious Caldwell-Pope, are 6-2 at home and 1-7 on the road.\n\n\"We were desperate for a win,\" Marcus Morris said. \"We really needed this one, and we set the tone early. That's something we've needed to do for a while now.\"\n\nTyler Johnson had 17 points for Miami, which has lost eight of 10. Dion Waiters was the only Miami starter to reach double figures, scoring 11.\n\n\"I have no explanation for that,\" Miami coach Erik Spoelstra said. \"Our second group made a run in the second quarter, but that was the only time we were competitive all night. Our offense wasn't there and we didn't make an effort on defense.\"\n\nMiami's Udonis Haslem got into a confrontation with a Pistons fan with 5:11 left in the game. The pair had a face-to-face shouting match during a timeout until Haslem was pulled away by teammates. Auburn Hills police removed the fan.\n\n\"You can cheer for whichever team you want, but don't be disrespectful,\" Haslem said, adding that there was no racial aspect to the taunting.\n\nThe Pistons led by 15 in the first quarter and 56-42 at halftime. Drummond dominated his post matchup with Whiteside, putting up 12 points and nine rebounds to his opponent's two points and six boards.\n\n\"It was just effort and energy,\" Drummond said. \"He's the type of player that will hurt you if you don't pay attention when he's on the floor.\"\n\nDetroit shot 68.1 percent in the paint in the half, and kept things going at the start of the third, with Drummond dunking on the first possession. The Pistons led 86-64 going into the fourth.\n\nMiami never threatened in a final quarter that saw both coaches empty their benches.\n\n\"I don't know what just happened,\" Johnson said. \"They outplayed us, and we didn't respond.\"\n\nTIP-INS\n\nHeat: Johnson lost a tooth in a third-quarter scramble for a loose ball, but stayed in the game. \"It was a temporary tooth, so I didn't even know it was gone until I noticed the empty space,\" he said. ... Waiters picked up a third-quarter technical for arguing a call.\n\nPistons: Guard Reggie Bullock left the game in the second quarter with a left-leg injury and did not return. ... Jon Leuer recorded his 1,000th career rebound in the third quarter.\n\nFAREWELL TOUR\n\nThe game was the first played at the Palace of Auburn Hills since Tuesday's announcement that the Pistons will join the Red Wings at Little Caesars Arena next season. The team will spend the rest of the season celebrating the franchise's history at the Palace, which opened in 1988.\n\nDEFENSIVE LESSONS\n\nThe Pistons scored 28 points in the first quarter, and point guard Goran Dragic wasn't happy with the defensive effort put forth by his teammates. On separate occasions, he was frustrated enough to demonstrate proper techniques to Whiteside and Johnson after they missed assignments.\n\nHEAT MEETING\n\nThe Heat locker room was closed for 30 minutes after the game. Spoelstra said there was a brief team meeting where multiple players spoke up. \"We need to be better than this,\" he said. \"They all know that.\"\n\nUP NEXT\n\nHeat: Visit the Memphis Grizzlies on Friday for a meeting against David Fizdale, their former assistant coach.\n\nPistons: Host the Los Angeles Clippers on Friday. The Clippers beat Detroit 114-82 in Los Angeles on Nov. 7.",
  "source": "espn_api",
  "crawled_at": 1764996078.62898
}