{
  "game_id": "0021800981",
  "espn_id": "401071654",
  "date": "Mar 08, 2019",
  "matchup": "PHI @ HOU",
  "headline": "Harden's 31 points help Rockets past 76ers 107-91",
  "body": "HOUSTON --  The Houston Rockets are finally healthy and it has them on a roll.\n\nJames Harden had 31 points and 10 rebounds and the Rockets extended their winning streak to a season-high seven games with a 107-91 win over the Philadelphia 76ers on Friday night.\n\nWhile Harden has missed just four games this season, fellow stars Chris Paul and Clint Capela have missed 15 and 19 games, respectively, with injuries.\n\n\"I think it's very obvious with Clint, Chris and James playing together and they're all healthy and in rhythm we're pretty hard to beat,\" coach Mike D'Antoni said.\n\nHouston improved to 21-9 this season in games when all three play after going 42-3 in such games last season.\n\n\"Our pace and energy has been really good and it always helps to be healthy,\" Paul said.\n\nThe Rockets had a big lead for most of the night after a 37-point first quarter and were up by 22 entering the fourth. Philadelphia had trouble containing Capela with Joel Embiid out for the eighth straight game with a sore left knee, and Houston's big man had 18 points and nine rebounds.\n\n\"They did an excellent job at defending us,\" Philadelphia coach Brett Brown said. \"I just think that first period sort of set the table and we found it difficult to respond after that.\"\n\nThe victory came after Philadelphia won the first meeting this season 121-93 behind 32 points from Embiid.\n\nGerald Green and Iman Shumpert each made a 3-pointer to power a 6-2 run in the fourth quarter and extend the lead to 96-72 with nine minutes left. Philadelphia scored the next five points before Harden wowed the crowd with a between-the-legs bounce pass to Capela, but he was fouled on the shot and missed both free throws.\n\nHouston led by 16 with about five minutes left when Harden had a dunk to make it 99-81 and give him at least 30 points in his NBA-leading 30th game this season. Coach Mike D'Antoni cleared the bench soon after that with the game in hand.\n\nTobias Harris had 22 points for the 76ers, who dropped their second straight. Ben Simmons played despite dealing with stomach flu and added 15 points, 10 assists and nine rebounds.\n\nPhiladelphia shot just 3 of 26 on 3-pointers with JJ Redick going 1 for 9 and Mike Scott missing all of his five attempts.\n\nThe 76ers opened the third quarter with a 9-6 run to cut the lead to 12 points, but Houston scored the next six points with 3s from Harden and Eric Gordon to push it to 71-53 with about six minutes left in the quarter.\n\nHarden left briefly in the second quarter after crashing to the court after a collision with Simmons while attempting a shot. He remained on the court on his back writhing in pain for a couple of minutes before getting to his feet and going to the locker room. He appeared to have injured his right wrist and had it taped when he returned to the court.\n\nIt didn't seem to be bothering him much after he returned to the game and he provided a highlight-reel play when he used a crossover to shake Jimmy Butler at the 3-point line and drove into the lane for a layup to leave Houston up 59-44 at halftime.\n\nD'Antoni said that Harden was OK, but a team official said that he was getting a precautionary X-ray after the game and wasn't available to reporters.\n\nTIP-INS\n\n76ers: Boban Marjanovic sat out for the fifth game in a row with an injured right knee. ... Butler added 19 points with nine rebounds.\n\nRockets: Shumpert returned after missing the last three games with a sore right calf. He had three points and three rebounds. Kenneth Faried missed his fourth game with a bruised hip. ... Chris Paul had eight assists.\n\nTHEY SAID IT\n\nD'Antoni on Houston's defense: \"They know ... to get in the mix of winning a title we have to play great defense.\"\n\nGORDON'S SHOOTING\n\nGordon had five 3-pointers and finished with 17 points on Friday night, continuing a streak of hot long-range shooting. After missing all five of his attempts on Feb. 27 against Charlotte, Gordon has averaged 5.3 3-pointers a game and shot 61.5 percent from behind the arc in the last three games.\n\nUP NEXT\n\n76ers: Host Indiana on Sunday in the first of three consecutive home games.\n\nRockets: Visit Dallas on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994002.215061
}