{
  "game_id": "0021600369",
  "espn_id": "400899811",
  "date": "Dec 13, 2016",
  "matchup": "ORL @ ATL",
  "headline": "Payton has career highs in points and assists in Magic win",
  "body": "ATLANTA -- Elfrid Payton had the best night of his career.\nEven better, he did it on a night when the entire Orlando roster met coach Frank Vogel's mandate.\n\"Coach has been on us over the past month or so about making the extra pass, making plays for others,\" Payton said. \"We did a good job of that.\"\nSerge Ibaka scored 29 points, Payton reached career highs with 26 points and 14 assists and the Orlando Magic snapped a three-game losing streak with a 131-120 victory over the Atlanta Hawks on Tuesday night.\nOrlando began the night ranked 29th in scoring and played without center Nikola Vucevic, but it got big production from the bench. Payton, Jodie Meeks and Jeff Green combined for 62 points, while starting guard Evan Fournier scored 23.\nDwight Howard had 20 points and 16 rebounds and Dennis Schroder had 19 points and 13 assists for the Hawks, who thought they were on a good trajectory after rallying from 20 points down in last Friday's win at Milwaukee.\nAtlanta began the night having won two straight since a 1-10 stretch dropped them out of the top eight spots in the Eastern Conference. The Hawks were 9-2 and tied for the East lead before the slump.\n\"It's just a tough pill to swallow right now,\" guard Tim Hardaway Jr. said. \"Defensively, they made a lot of tough shots. It was just that type of night. Give them credit, man. They were knocking down their open shots, knocking down their tough shots.\"\nThabo Sefolosha's 18-footer at the 4:18 mark of the third quarter gave the Hawks their first lead since the first quarter, but Payton answered with a 3 and Orlando never trailed again.\n\"We tightened the screws on the defensive end during that stretch,\" Vogel said. \"We forced a lot of misses, held them to one shot and we were able to get the offense back under control.\"\nThe Magic set season highs in points, assists with 36 and 3-pointers with 15. They had 21 assists and zero turnovers until committing two miscues in the final 44 seconds of the second quarter.\nOrlando took charge with a 20-9 run in the second quarter that ended with Fournier's short turnaround jumper to make it 72-60.\nPayton combined with Fournier and Ibaka to score 46 points on 20-for-27 shooting in the first half.\n\"You can always find things you can do better, but a lot of those guys had pretty special nights,\" Hawks guard Kyle Korver said.\nMAYBE TOMORROW\nVucevic, Orlando's leading rebounder and third-leading scorer, missed his second straight game with a sore lower back. He hopes to be back in Wednesday's home game against the Los Angeles Clippers.\n\"It depends,\" he said. \"At the moment when the pain happens, it bothers me a lot.\"\nTIP-INS\nMagic: The last time they scored over 131 on the road was Jan. 13, 2009 at Sacramento. ... With 72 points in the first half, Orlando was six points shy of the team record set Nov. 3, 2010 at home against Minnesota. ... The Magic tied the team road mark set Dec. 5, 2009 at Golden State.\nHawks: Had won 17 of the last 22 games in the series. ... Their bench was outscored by Orlando's 62-35. ... Atlanta's previous season-high in first-half points allowed was 66 in a home loss Nov. 22 to New Orleans. ... G Kent Bazemore returned in a reserve role after missing the last two games with a sore right knee. He had five points and three rebounds in 15 minutes.\nUP NEXT\nMagic: Host the Clippers on Wednesday night.\nHawks: Visit Toronto on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995865.507835
}