{
  "game_id": "0022200508",
  "espn_id": "401468663",
  "date": "Dec 27, 2022",
  "matchup": "ATL @ IND",
  "headline": "Hield makes 6 3-pointers as Pacers beat Hawks 129-114",
  "body": "INDIANAPOLIS -- — Buddy Hield made six 3-pointers on his way to 28 points, and the Indiana Pacers beat the Atlanta Hawks 129-114 on Tuesday night.\n\n\r\n              Hield hit 11 of 16 shots, including 6 of 7 from deep. He leads the NBA with 132 3s this season.\n\n\r\n              “In the first half, I had three good looks and missed ‘em,” Hield said. “Staying in rhythm, the shot felt good so I wasn’t worried about it.” \n\n\r\n              The Pacers led by 10 entering the fourth quarter and doubled that margin in about six minutes. Tyrese Haliburton had 23 points and seven assists. Myles Turner scored 18.\n\n\r\n              “I stay more in the gym,” Hield said of his shooting preparation. “It gets to the point where my family gets mad at me, that I overwork. But when you love the game so much, that's all you think about, just trying hard to get ready each and every day.\"\n\n\r\n              Pacers coach Rick Carlisle praised Hield's dedication.\n\n\r\n              “If you saw his daily routine, you'd have a really good idea,” he said. “He lives for the game. He lives for running around and getting open shots and trying to knock 'em in.”\n\n\r\n              The Pacers enjoyed a 52-20 advantage in scoring by reserves. Bennedict Mathurin had 18 points, and fellow reserve Oshae Brissett finished with 16.\n\n\r\n              “The second unit was tremendous in the first half,” Carlisle said. “It helped build up a bit of a lead, which was great. A lot of guys played well.”\n\n\r\n              John Collins had 26 points and 10 rebounds for the Hawks, who were without injured starters De'Andre Hunter and Clint Capela. Trae Young had 22 points and 10 assists.\n\n\r\n              “They established their pace at the start of the game,” Hawks coach Nate McMillan said. “They got to their tempo. They played their game tonight. We just weren't controlling the basketball and keeping it in front of us. We only had nine turnovers, so they are scoring off misses and made baskets.\"\n\n\r\n              It was Atlanta's first game since a 130-105 victory over Detroit on Friday night. Indiana lost 113-93 at New Orleans on Monday night, leading to criticism from Carlisle and some players about not playing hard against a Pelicans roster missing six players.\n\n\r\n              “We bounced back and tried to stay locked in and be focused,” Hield said.\n\n\r\n              After scoring a season-low 38 points in the first half at New Orleans, the Pacers came out firing against the Hawks in taking a 30-27 lead after the first quarter and building the advantage to as many as 15 points on their way to a 64-54 advantage at the break.\n\n\r\n              “It just seemed like we had heavy legs, those three days off,” McMillan said. \"It seemed like we had heavy legs all night long.”\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Hunter (left ankle sprain) was ruled out before the game, and Capela (right calf strain) missed his fourth consecutive start. ... Young had his 17th double-double of the season to improve his career franchise record to 144.\n\n\r\n              Pacers: Indiana's 29 fast-break points were a season high.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Nets on Wednesday.\n\n\r\n              Pacers: Host Cavaliers on Thursday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994838.389018
}