{
  "game_id": "0022300858",
  "espn_id": "401585486",
  "date": "Mar 01, 2024",
  "matchup": "CHA @ PHI",
  "headline": "Tobias Harris breaks out of slump with 31 points, 12 rebounds, leads 76ers past Hornets 121-114",
  "body": "PHILADELPHIA -- — Joel Embiid might still be the 76ers' MVP this season for his role as team counselor.\n\n\r\n              Embiid has stuck around the Sixers facility of late as he rehabs following knee surgery and used a recent appearance to chat with a slumping Tobias Harris for about an hour to help the forward find ways out of his recent shooting woes.\n\n\r\n              “Joel has a very intelligent basketball mind in how he sees the game and what he sees,” said Harris, who had 31 points and 12 rebounds to lead Philadelphia to a 121-114 win over the Charlotte Hornets on Friday night. “He's been with me here the longest out of anybody in this whole group and has seen ups and downs in my game. He's seen me at my best and me at my worst.”\n\n\r\n              It was one of Harris' best outings of the season.\n\n\r\n              “(Embiid) just said, ‘You had a rough seven-game stretch, not 70 games,’ ” Harris said. \n\n\r\n              Tyrese Maxey scored 33 points and the 76ers won for only the second time in six games but remain in the hunt for a top-four seed in the Eastern Conference as they try and stay afloat in the standings until the hopeful return of Embiid. They are 8-17 this season without last season's MVP and 5-8 since he went down in a Jan. 30 game.\n\n\r\n              The 76ers have said there is no timetable for his return.\n\n\r\n              A first-time All-Star this season, Maxey has carried the load without Embiid and helped rally the Sixers from a 12-point hole to hold off the Hornets. He threw in a chase-down block on Tre Mann in the waning moments that sent the crowd into a frenzy. \n\n\r\n              Getting an offensive boost from Harris certainly helped. He was 13 of 19 from the floor against the Hornets.\n\n\r\n              “We're going to need that from him down the stretch,” Maxey said. “Even when Joel does come back, but especially with him out.\"\n\n\r\n              Harris, in the final season of a five-year, $180 million contract, had been in a funk over the last month and took the brunt of the blame for the 76ers’ recent struggles. Harris vowed to “dig my way out” after scoring 13 points on 5-of-19 shooting in a loss at Boston. He made only 17 baskets in his last four games and didn’t have an assist in the last two games.\n\n\r\n              Grant Williams hit a 3 that pulled the Hornets to 114-112 with two minutes left only for Harris to come down and bury his fifth 3-pointer that helped seal the win.\n\n\r\n              Miles Bridges led the Hornets with 27 points and 11 rebounds. Nick Richards scored 19 points.\n\n\r\n              Charlotte is headed toward an eighth straight season without a trip to the postseason, the longest current skid in the NBA. The Hornets have been riddled with injuries and lineup instability — especially after they reshaped their roster at the trade deadline.\n\n\r\n              The Hornets lost a night earlier at home to Milwaukee but immediately hit the road to Philly for their fifth road game in their last six.\n\n\r\n              “The hardest thing with all the travel and the newness of our team is just, we have enough talent to win we’re just not organized enough yet,” coach Steve Clifford said. “With the travel and the back-to-backs and everything, we don’t have a lot of practice time. We have to figure that out.”\n\n\r\n              Kyle Lowry was one of the players that left Charlotte after the deadline — though he never played a game with the Hornets. A six-time All-Star, Lowry took a buyout and signed a deal with his hometown Sixers. With Kelly Oubre Jr. out with right shoulder soreness, Lowry finished with 15 points and 10 assists in his first start in four games with the Sixers.\n\n\r\n              “It was another guy that could handle the ball and I could play a little off the ball sometimes,” Maxey said.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Play Sunday night at Toronto.\n\n\r\n              76ers: Play Sunday at Dallas.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995952.9283478
}