{
  "game_id": "0022200701",
  "espn_id": "401468856",
  "date": "Jan 22, 2023",
  "matchup": "LAC @ DAL",
  "headline": "Leonard, George lead Clippers past Mavericks, 112-98",
  "body": "DALLAS -- — Kawhi Leonard scored 30 points, Paul George had 21 and Norman Powell added 19 off the bench to give the Los Angeles Clippers a 112-98 win over the Dallas Mavericks on Sunday.\n\n\r\n              After Dallas led 54-49 at halftime, the Clippers outscored the Mavericks 63-44 in the second half. The score was tied at 79 going into the fourth quarter, when Los Angeles scored the first six points and pulled away to build its largest lead at 110-95 with two minutes to play. Powell scored 11 in the quarter, including nine early on.\n\n\r\n              “We got some pace going,” Leonard said of the second half. “And, obviously, we made some shots.”\n\n\r\n              After shooting 38.1% in the first half (16 for 42), Los Angeles shot 54.3% in the second half (19 of 35).\n\n\r\n              Luka Doncic led the Mavericks with 29 points and 10 rebounds. Tim Hardaway Jr. added 22 points and Spencer Dinwiddie had 21.\n\n\r\n              Clippers coach Tyronn Lue opened his postgame media session by flashing the “two” sign – as in wins at San Antonio on Friday and at Dallas for the team’s first winning streak since Dec. 26-27.\n\n\r\n              It came with Leonard and George playing in the same game for only the 18th time in 49 games this season because of various injuries.\n\n\r\n              “When our two main guys are playing, we’re a different team,” Lue said.\n\n\r\n              The Mavericks have lost four of their last five games and seven of 10.\n\n\r\n              “I thought the second half we just came out a little flat,” Mavericks coach Jason Kidd said. “Give them credit; they were the better team.”\n\n\r\n              FAR FROM FREE\n\n\r\n              The Mavericks shot 15 of 26 from the free-throw line while the Clippers went 30 for 31. Dallas went into the game ranked second in the NBA, averaging 26.4 free throws per game, but 27th in shooting at 74.5%.\n\n\r\n              “When you get to the line the most in the league and you’re shooting in the bottom of the league, that doesn’t help you win,” Kidd said.\n\n\r\n              WORDS MATTER\n\n\r\n              Doncic received his 10th technical foul of the season, with one rescinded, late in the first quarter. After Nicolas Batum blocked a Doncic shot inside, the MVP candidate expressed his dissatisfaction to official Ashley Moyer-Gleich on his way back down the court.\n\n\r\n              FAN FRIENDLY\n\n\r\n              Tipoff was moved to 1:30 p.m. CST from 6:30 p.m. to avoid a conflict with the Dallas Cowboys’ playoff game at San Francisco, which was scheduled to kick off at 5:30 p.m. CST.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Powell’s scoring helped the Los Angeles bench outscore Dallas’ bench 40-9. … Center Ivica Zubac picked up his fourth foul with the Clippers leading 70-69 late in the third quarter, forcing Lue to turn to a smaller lineup.\n\n\r\n              Mavericks: Doncic, fourth in the NBA, averaging 8.8 assists per game going into Sunday, had four — and none in the first half. It was one more than his low for the season, which came during a blowout loss at Boston. “Making sure that first pass is not a shot,\" Lue said. “He might have gotten the ‘hockey assist.’ Our guys did a good job locking in, paying attention to detail.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Are the designated visiting team against the Los Angeles Lakers at their shared home, Crypto.com Arena, on Tuesday.\n\n\r\n              Mavericks: Finish a four-game homestand Tuesday against the Washington Wizards. It’s likely to be the first Dallas appearance for Kristaps Porzingis since he was traded to the Wizards almost a year ago. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994969.339392
}