{
  "game_id": "0021601189",
  "espn_id": "400900567",
  "date": "Apr 08, 2017",
  "matchup": "CHA vs. BOS",
  "headline": "Thomas (again) leads Celtics past Hornets, 121-114",
  "body": "CHARLOTTE, N.C. --  The Boston Celtics are keeping the pressure on the Cleveland Cavaliers.\n\nIsaiah Thomas scored 32 points, and the Celtics remained in contention for the No. 1 seed in the Eastern Conference playoffs with a 121-114 victory over the Charlotte Hornets on Saturday.\n\nAl Horford added 16 points and Kelly Olynyk had 13 points and 11 rebounds for his first double-double of the season as the Celtics swept the four-game series and pulled within a half-game of the Cavaliers. The Cavaliers (51-28) have road games remaining against Atlanta and Miami before closing at home against Toronto. The Celtics (51-29) have two home games left, against Brooklyn and Milwaukee.\n\nThomas said the way the Celtics won -- falling behind by seven points in the fourth quarter after leading by 19 early in the second half -- could prove to be beneficial down the road.\n\n\"Coach even said in the huddle, `Don't think there's not going to be playoff games like that. Just figure out a way to win,\" Thomas said.\n\nThomas was a key in the comeback.\n\nThe 5-foot-9 guard, who averaged 29.2 points in four games this season against the Hornets, scored on a drive and left-handed layup with 2:13 remaining to put his team up for good at 111-109. He added two free throws and knocked down a 3-pointer from the top of the key coming off a screen to push the lead to six. Thomas then passed up an open shot and dished to a wide-open Avery Bradley, who buried a backbreaker 3-pointer to seal the win.\n\nNicolas Batum tied a season high with 31 points and Kemba Walker added 23 for the Hornets, who were eliminated from the playoffs.\n\nCeltics coach Brad Stevens called it a \"good-bad-good\" night.\n\n\"When Batum gets rolling like that, he's a hard guy to stop,\" Stevens said. \"They made a ton of shots. They put us in a corner. That's hard when you've had the lead and they take it all the way up to seven. To come back and win it, it shows a lot of resolve.\"\n\nBradley was also big in the fourth quarter, scoring 11 points on three 3-pointers.\n\n\"We need Avery to make shots,\" Stevens said. \"We need Avery to be great.\"\n\nThe Celtics built a 71-54 lead at halftime after shooting 63 percent from the field, including 11 of 21 from beyond the 3-point arc. Thomas had 19 in the opening half, including four 3-pointers as the Hornets continued to struggle with their perimeter defense.\n\n\"We were good on both ends of the floor in the first half,\" Thomas said.\n\nTIP-INS\n\nCeltics: Olynyk fouled out with 4:35 left in the game. ... Thomas has 70 20-point games this season.\n\nHornets: Walker has scored the second-most points in franchise history this season, behind only Glen Rice. ... Walker is the 10th different player in NBA history to hit 240-plus 3s in a season.\n\nBATUM NOT PLAYING FOR FRANCE\n\nFor the first time in his career, Batum said he will not play for the French national team this summer.\n\n\"I'm going to dedicate myself to this (Hornets) franchise,\" Batum said. \"I am going to get back on the court and work on myself. ... I need to take the summer to focus on myself for once. My team needs that, and I need that too to get back to what I'm supposed to be for this team.\"\n\nBatum called it one of the most difficult decisions of his life.\n\nCLIFFORD EJECTED\n\nHornets coach Steve Clifford was ejected from the team's final home game with 1:09 left in the second quarter after disputing a call. It marked the first time the normally mild-mannered Clifford has been ejected from a game in his four seasons with Charlotte.\n\nClifford refused to comment on what caused him to get so upset.\n\nUP NEXT\n\nCeltics: Return home to host the Brooklyn Nets on Monday night.\n\nHornets: Visit Milwaukee on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995458.2779741
}