{
  "game_id": "0022000372",
  "espn_id": "401267532",
  "date": "Feb 08, 2021",
  "matchup": "PHX vs. CLE",
  "headline": "Booker scores season-high 36, Suns beat Cavs 119-113",
  "body": "PHOENIX -- — Monty Williams has proven to be a pretty good coach for the Phoenix Suns over two seasons. Having Devin Booker on the roster certainly helps.\n\n\r\n                    Booker scored a season-high 36 points, Mikal Bridges added 22 and the Suns rallied in the fourth quarter to beat the Cleveland Cavaliers 119-113 on Monday night.\n\n\r\n                    Williams praised Booker's improvisation on one of the All-Star guard's best nights of the season. Booker made 14 of 27 shots, including five 3-pointers.\n\n\r\n                    “I made a few calls in the huddle, they take away the option and then he just makes a play,” Williams said. “His willingness to take big shots is something I really value.”\n\n\r\n                    Said Booker: “It’s my sixth year — I’ve seen a lot of different matchups and players and I try to take the challenge every night.”\n\n\r\n                    The Suns have won six of their past seven games while the Cavaliers have dropped four straight. Booker also had eight assists, which was valuable since All-Star point guard Chris Paul was sidelined with a sore hamstring.\n\n\r\n                    Phoenix took a 101-100 lead with seven minutes left on a 3-pointer from Cam Johnson. The second-year forward had missed his first six attempts from beyond the arc.\n\n\r\n                    That started an entertaining back-and-forth that lasted until the final minute. Bridges hit two free throws to give the Suns a 117-113 lead with 17.2 seconds left.\n\n\r\n                    “A resilient, gutsy win for us,” Williams said. “I’m proud of our guys, I hope they really enjoy it.”\n\n\r\n                    Cleveland has been one of the NBA's worst offensive teams this season but it didn't look that way on Monday. The Cavs' young backcourt of Darius Garland and Collin Sexton continually carved through the Suns' defense, which has been among the better units in the league.\n\n\r\n                    Sexton led the Cavs with 23 points while Garland had 17. Andre Drummond added 15 points and 14 rebounds. Cavs coach J.B. Bickerstaff was frustrated with an offensive foul that was called against Sexton late in the game.\n\n\r\n                    Booker poured in 17 points in the first quarter on 7-of-10 shooting. Langston Galloway had a steal and made a short jumper at the buzzer to give the Suns a 34-28 lead heading into the second.\n\n\r\n                    The Suns took a 64-61 edge into halftime. Both teams were getting lots of close, uncontested looks. Phoenix shot 60% from the field and had 40 points in the paint before the break while the Cavaliers shot 56.5% and got 23 points from their bench.\n\n\r\n                    SHORT-HANDED SUNS\n\n\r\n                    The Suns played without five players who are in their normal rotation.\n\n\r\n                    Paul missed his first game of the season with hamstring soreness after starting the first 22. He's averaging 16.4 points and more than eight assists per game.\n\n\r\n                    Phoenix also didn't have forwards Abdel Nader (ankle), Jae Crowder (foot) and Dario Saric (ankle), along with guard Cameron Payne (foot).\n\n\r\n                    Suns forward Deandre Ayton said that was no excuse: “The show must go on.”\n\n\r\n                    NANCE HAS SURGERY\n\n\r\n                    Cavaliers forward Larry Nance Jr. broke his left hand Saturday against Milwaukee and is expected to be out six weeks. Nance posted on Twitter on Monday that he had surgery. \n\n\r\n                    Nance has played in 19 games this season, starting 18. He's averaging 9.3 points and 6.8 rebounds. Nance's injury has left the Cavaliers thin in the frontcourt since Kevin Love is also out with a calf injury.\n\n\r\n                    Bickerstaff said he was pleased with the production of Drummond and Jarrett Allen, who had 14 points and five rebounds.\n\n\r\n                    “I think we definitely have room to grow,” Bickerstaff said. “We weren’t pleased with the 40 points in the paint that Phoenix scored in the first half. We addressed that at halftime. I thought they did a much better job.”\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: JaVale McGee was ejected early in the fourth quarter after getting into a heated argument with Suns forward Frank Kaminsky. Both players were quickly assessed technicals and then McGee got another one when the yelling continued. He blew kisses to the 1,500 fans at Phoenix Suns Arena as he was booed off the court. McGee finished with eight points in 8 minutes.\n\n\r\n                    Suns: E'Twaun Moore got his first start of the season with Paul out. He finished with a season-high 17 points in 40 minutes. ... Ayton finished with 15 points and 16 rebounds.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Continue their five-game trip against Denver on Wednesday.\n\n\r\n                    Suns: Continue their seven-game homestand against Milwaukee on Wednesday.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt on Twitter: https://twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997754.002157
}