{
  "game_id": "0022400430",
  "espn_id": "401704996",
  "date": "Dec 28, 2024",
  "matchup": "CHI vs. MIL",
  "headline": "Giddey's triple-double sends Bulls to 116-111 win over Bucks",
  "body": "CHICAGO -- — Josh Giddey had 23 points, 15 rebounds and 10 assists for his second triple-double this season to lead the Chicago Bulls to a 116-111 win over the Milwaukee Bucks on Saturday night.\n\n\r\n              Giddey, who missed the previous four games with an ankle injury, sank two free throws with 10 seconds left to make it 115-111, then pulled down a rebound to help seal it as Chicago snapped a three-game losing streak.\n\n\r\n              Nikola Vucevic had 23 points and 13 rebounds. Coby White, who scored 22, nailed a tiebreaking jumper with 32 seconds remaining. \n\n\r\n              Damian Lillard returned to the lineup with 29 points and 12 assists, but the Bucks dropped their second straight. The star guard came on with 18 points in the second half as Milwaukee played without NBA scoring leader Giannis Antetokounmpo (illness) for a fourth consecutive game.\n\n\r\n              Brook Lopez had 22 points and Khris Middleton scored 17 of his 21 in the first half. Middleton, under a minutes restriction following offseason ankle surgery, played sparingly in the second half before hitting two key baskets late.\n\n\r\n              The Bulls led 62-60 at halftime after opening a pair of 13-point leads.\n\n\r\n              Takeaways\r\n              Bucks: It took a while for the 34-year-old Lillard to heat up. He pulled Milwaukee back into the game and played 35:28.\n\n\r\n              Bulls: Chicago responded with a tighter effort following a 141-133 loss at Atlanta on Thursday when the Hawks rallied from a late 21-point deficit with 50 points in the fourth quarter. \n\n\r\n              Key moment\r\n              The Bulls opened a seven-point cushion to start the third before the Bucks bounced back and took their first lead, 75-72, on Bobby Portis' 3-pointer midway through the quarter. Milwaukee led 84-83 after three, but Chicago used a 10-0 run to set up a close finish.\n\n\r\n              Key stat \r\n              Chicago outscored Milwaukee 56-42 in the paint. \n\n\r\n              Up next\r\n              The Bucks play at Indiana on New Year’s Eve. The Bulls are at Charlotte on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997081.9947069
}