{
  "game_id": "401809779",
  "espn_id": "401809779",
  "date": "Nov 07, 2025",
  "matchup": "DEN vs GS",
  "headline": "Nuggets dominate Warriors without Stephen Curry 129-104, Nikola Jokic just shy of triple-double",
  "body": "DENVER -- — Nikola Jokic scored 26 points, Jamal Murray added 23 and the Denver Nuggets improved to 5-0 at home Friday night with a 129-104 rout of the Golden State Warriors, who were without Stephen Curry again.\n\n\r\n              Jokic, who sat out the entire fourth quarter, finished one rebound and one assist shy of his sixth triple-double of the season.\n\n\r\n              The Nuggets have won six of seven since their opening-night loss to the Warriors, including three wins to start their four-game homestand that concludes Saturday night against the Indiana Pacers.\n\n\r\n              Curry, whose late flurry in the season opener led the Warriors to a 137-131 overtime win against Denver, missed his second straight game with an illness. Draymond Green (ribs) and Jimmy Butler (back) returned to the Warriors’ lineup after also missing the team's 121-116 loss to Sacramento on Tuesday night.\n\n\r\n              Green scored 17 at Denver and Butler had 16 as the Warriors lost their fifth straight road game.\n\n\r\n              “Steph’s good, feeling a little better today,” Golden State coach Steve Kerr said before tipoff. Kerr said he has only exchanged texts with Curry, whom he hopes can return Sunday night against the Pacers.\n\n\r\n              The Nuggets have been much better this season in their non-Jokic minutes but the Warriors used an 11-0 run in the second quarter when Jokic went to the bench to pull to within 32-31.\n\n\r\n              Murray sank back-to-back 3s coming out of the timeout and Jonas Valanciunas added another to spark Denver's 34-18 run to end the half with a 66-49 lead. \n\n\r\n              The Nuggets pushed their lead to 99-77 after three quarters and Jokic watched the rest of the game from the bench.\n\n\r\n              The win allowed the Nuggets to stay alive in West Group C after losing their first game in the round-robin portion of the NBA Cup at Portland on Oct. 31. This was the Warriors' first NBA Cup game.\n\n\r\n              Up next:\r\n              Golden State hosts the Indiana Pacers on Sunday night.\n\n\r\n              Denver hosts the Indiana Pacers on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042581.189452
}