{"game_id": "170407008", "title": "Synthetic Recap", "body": "AP SPORTS\n\n**Riley's Record Night Carries Heat in Motor City Grind**\n\nDETROIT – In the annals of NBA history, some nights belong not to a team, but to one man. Tuesday evening at The Palace of Auburn Hills was Alonzo Mourning’s night.\n\nThe Miami Heat center delivered a performance for the ages, pouring in a career-high and franchise-record 47 points to will his team to a bruising 94-88 victory over the Detroit Pistons. On a night where offensive rhythm was scarce for everyone else, Mourning was a symphony of power and precision, single-handedly overpowering the Pistons’ interior defense.\n\nThe game was a typical Eastern Conference trench war, a physical battle where every possession was contested. Yet, Mourning proved unstoppable. He was a force in the paint, commanding double-teams that he either powered through or used to find open teammates. His 47 points were not just a number; they were the backbone of the Heat’s entire offensive structure, accounting for half of his team’s total output.\n\nWhile Mourning’s historic scoring outburst was the headline, his impact was felt across the box score. He complemented his offensive masterpiece with 14 rebounds, anchoring the Miami defense and ensuring the Pistons had no answer at either end of the floor. Tim Hardaway, with 17 points and 12 assists, provided the crucial backcourt support, but this was undeniably Zo’s show.\n\nThe Pistons, led by Grant Hill’s 26 points, fought valiantly but simply had no counter for the hurricane in the middle. Every time Detroit threatened to close the gap, Miami went back to its bedrock: feeding the low post and watching their All-Star center go to work.\n\nIn a league of superstars, Alonzo Mourning carved his name into the record books with a performance that was both brutal and beautiful, a legendary effort that secured a hard-fought road win and etched his name deeper into Miami Heat lore.", "source": "AI_Reconstruction"}