{
  "game_id": "0022201148",
  "espn_id": "401469303",
  "date": "Mar 31, 2023",
  "matchup": "CHI @ CHA",
  "headline": "LaVine, DeRozan each score 23 points; Bulls rout Hornets",
  "body": "CHARLOTTE, N.C. -- — Zach LaVine and DeMar DeRozan each scored 23 points and the Chicago Bulls routed the injury-plagued Charlotte Hornets 121-91 on Friday night to take a big step toward reaching the NBA's play-in tournament.\n\n\r\n              Nikola Vucevic added 21 points and eight rebounds for the Bulls, who entered the game having lost three of their previous five games and clinging to the final spot in the Eastern Conference play-in tournament. However, Chicago's win combined with the Orlando Magic's 116-109 victory over Washington on Friday night leaves the Bulls three games head of the Wizards for the 10th spot in the East with five games remaining.\n\n\r\n              DeRozan said it's vital the Bulls use this closing stretch to elevate their play if they want to make a postseason run.\n\n\r\n              “We've got to, just for that confidence, that feel, that rhythm and understanding how we need to play,” DeRozan said. “We needed to take these last five games and make sure we are playing great basketball.”\n\n\r\n              James Bouknight had 22 points behind six 3-pointers to lead the Hornets. They had their three-game winning snapped and lost yet another key player to injury.\n\n\r\n              Charlotte’s P.J. Washington, who scored a career-high 43 points Tuesday night in a 137-134 win over Oklahoma City, left in the second quarter with a sprained foot and did not return.\n\n\r\n              “I thought he was off to a good start again,” Hornets coach Steve Clifford said. “It’s part of it. It’s part of the game.” \n\n\r\n              It's unclear if Washington will miss the remainder of the season, but there's no logical reason for the Hornets to rush him back given they've already been eliminated from playoff contention.\n\n\r\n              It's the latest in a long line of injuries for the Hornets, who played without LaMelo Ball, Terry Rozier, Gordon Hayward, Kelly Oubre Jr., Cody Martin and Dennis Smith Jr. Washington was the only opening day starter who suited up for the Hornets against the Bulls.\n\n\r\n              The Hornets were so thin at one point they had a lineup on the floor that included five players who've spent time with their G League club, the Greensboro Swarm.\n\n\r\n              Chicago jumped out to a 19-5 lead midway through the first quarter, with six Hornets turnovers leading to 10 points. The Bulls, who never trailed, pushed the lead to 16 at the half behind a series of LaVine drives and DeRozan mid-range jumpers.\n\n\r\n              Chicago increased its lead to 28 with about five minutes remaining when four passes led to an open 3 from LaVine. A short while later Billy Donovan emptied his bench.\n\n\r\n              The Bulls had 25 assists.\n\n\r\n              “When we are moving the ball and making good decisions and sharing it and collectively all covering and helping each other defensively it is when we are at our best,” Donovan said. \n\n\r\n              DRUMMOND RETURNS\n\n\r\n              Andre Drummond returned to action after missing the last game due to personal reasons and had six points and 11 rebounds.\n\n\r\n              “For him to come back and be able to do what he did and try to block whatever it is he's dealing with out and focus on basketball, maybe in some way it was a relief for him just to get on the floor,” Donovan said. “I think it speaks to his commitment to the team and to the guys that he wanted to be out there.”\n\n\r\n              TIP INS\n\n\r\n              Bulls: Scored 29 points off 22 Charlotte turnovers.\n\n\r\n              Hornets: Svi Mykhailiuk was the only Hornets starter to finish in double figures, scoring 16 points. ... Theo Maledon got the start at point guard and had nine points and nine assists.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Memphis on Sunday.\n\n\r\n              Hornets: Host Toronto on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994462.850915
}