{
  "game_id": "0022400328",
  "espn_id": "401704894",
  "date": "Dec 05, 2024",
  "matchup": "TOR vs. OKC",
  "headline": "Gilgeous-Alexander scores 30 as Thunder rout Raptors 129-92 for sixth win seven games",
  "body": "TORONTO -- — Shai Gilgeous-Alexander scored 30 points, Jalen Williams had 20 and the Oklahoma City Thunder routed the Toronto Raptors 129-92 on Thursday night for their sixth win in seven games.\n\n\r\n              Isaiah Joe scored 16 points and Isaiah Hartenstein had 16 rebounds as the Western Conference-leading Thunder improved to 8-3 on the road.\n\n\r\n              The Thunder had nine blocks and nine steals in the first half and finished with 11 blocks and 14 steals.\n\n\r\n              RJ Barrett had 17 points and 12 rebounds, and Scottie Barnes added 12 points and 12 rebounds but the Raptors lost by their biggest margin this season, eclipsing a 30-point loss to Cleveland on opening night.\n\n\r\n              Toronto shot 11 for 45 from 3-point range (24.4%), its lowest percentage of the season.\n\n\r\n              Raptors center Jakob Poeltl missed the game because of an illness, but Gradey Dick returned after missing five games with a sore left calf and scored 15.\n\n\r\n              Barnes hit a 3 for the game’s first basket but Joe replied with back-to-back field goals and the Thunder never trailed again.\n\n\r\n              Takeaways\r\n              Thunder: Gilgeous-Alexander shot 11 for 22 but made just 1 of 10 from 3-point range.\n\n\r\n              Raptors: Barrett came in having scored 20 or more in his past four games, and 25 or more in four straight home games, but couldn’t extend either streak. He shot 5 for 16, scoring 11 points in the fourth after the game was out of reach.\n\n\r\n              Key moment\r\n              The Thunder connected on their first four 3-point attempts in the second, turning a 17-point advantage into a 26-point lead before the midpoint of the quarter.\n\n\r\n              Key stat\r\n              The Raptors missed 16 of their first 20 field-goal attempts and 20 of their first 25. Toronto shot 6 for 26 in the opening quarter and trailed 34-17 after one. \n\n\r\n              Up next\r\n              Both teams play again Saturday night, when Oklahoma City visits New Orleans and Toronto hosts Dallas.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996983.348099
}