{
  "game_id": "0021900332",
  "espn_id": "401160974",
  "date": "Dec 07, 2019",
  "matchup": "CLE @ PHI",
  "headline": "Ben Simmons scores career-high 34 as 76ers blitz Cavaliers",
  "body": "PHILADELPHIA -- Ben Simmons hit another 3-pointer, and his coach wants him to keep on firing.\nSimmons hit his second career 3 and scored a career-high 34 points, and the Philadelphia 76ers didn't need Joel Embiid's help to rout the Cleveland Cavaliers 141-94 Saturday night.\nSimmons made 12 of 14 field goals, including his only 3-point attempt, and hit 9 of 12 free throws in 26 minutes to help Philadelphia improve to 11-0 at home.\n\"I was locked in,\" Simmons said.\nSimmons' jump shot -- or lack thereof -- has been a hot topic in Philadelphia. He entered the season 0 for 17 from long range.\nCoach Brett Brown has repeatedly said shooting is a part of Simmons' game that will develop with time. After Saturday's performance, Brown publicly upped the ante and called for more from his All-Star point guard.\n\"This is what I want,\" Brown said. \"I want a 3-point shot per game, minimum. ... He will be liberated. His world will open up and, in many ways, so will ours.\"\nEmbiid sat out with a left hip contusion.\nDarius Garland had 17 points for the Cavaliers, who have lost six in a row and 12 of 13.\n\"They were going downhill on us all day long,\" Cavaliers coach John Beilein said.\nPhiladelphia has been projected to be an NBA title contender, but the 76ers haven't been able to consistently field its starting five of Simmons, Embiid, Josh Richardson, Tobias Harris and Al Horford. They have only started nine games together due to injuries and Embiid's two-game suspension for fighting Minnesota's Karl-Anthony Towns.\nThe 76ers needed little more than Simmons in a dominant first half that ended with them ahead 77-36.\nSimmons attacked the basket often and showed off a rarely seen mid-range game when he drained an 11-foot jumper with 6:04 left in the second quarter. That had 76ers fans cheering, but it was just an appetizer for Simmons.\nWith 3:41 left in the half, Simmons took a cross-court pass from Trey Burke and knocked down a 3 from the left wing. That send the sold-out crowd into a frenzy, and the roars continued when Simmons finished an alley-oop dunk from Burke on Philadelphia's ensuing possession.\nSimmons received a standing ovation at the next stoppage.\n\"I'm getting more comfortable learning my spots and just adjusting,\" Simmons said. \"I'm trying not to force it, trying to play the game I know how to play. Hard work pays off. Stay in the gym and keep working.\"\nSimmons finished the tremendous four-possession sequence with assists on Philadelphia's next two trips, first to Horford for a 3-pointer and then to James Ennis III for a jumper.\nFinally, Simmons ended the first half scoring with a 9-foot jumper for a 41-point lead entering the break.\nWINNING BIG\nThe 47-point margin of victory is tied for third-most in Philadelphia history. The club's greatest victory is a 62-point rout of the Knicks on Dec. 25, 1960 prior to the move to Philadelphia when they were the Syracuse Nationals.\nBACKING BEILEIN\nBrown knows what Beilein is going through trying to resurrect the Cavaliers, having accumulated just 47 combined wins himself over his first three seasons during Philadelphia's rebuilding process.\nThe 76ers coach said prior to the contest that he believes Beilein is wired to be successful in the NBA after compiling 829 victories in 40 years of coaching at the college level. The coaches embraced after the game with Brown offering some words of encouragement.\nTIP-INS\nCavaliers: Cleveland set a season low for points in a half, worse than the 40 the Cavaliers scored against Orlando on Dec. 6. ... Cleveland's previous largest margin of defeat this season was 42 points, 143-101 at Dallas on Nov. 22.\n76ers: Richardson (right hamstring tightness) missed his fifth straight contest. He'll also sit out Sunday's game against Toronto and then be re-evaluated. ... Philadelphia improved to 3-2 without Embiid. ... Simmons hits his first 3-pointer Nov. 20 against the Knicks. His previous career best in points was 32, set Feb. 22, 2018 at Chicago. ... Matisse Thybulle injured his right ankle in the first half and didn't return.\nUP NEXT\nCavaliers: At Boston Monday night.\n76ers: Host Toronto Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764996323.170635
}