{
  "game_id": "0022000827",
  "espn_id": "401307622",
  "date": "Apr 13, 2021",
  "matchup": "MIA @ PHX",
  "headline": "Suns get big night from bench, cruise past Heat 106-86",
  "body": "PHOENIX -- — Cam Payne was the man who got the curtain call on Tuesday night. The backup guard sheepishly grinned and waved to the screaming Phoenix Suns' fans as he trotted off the court postgame.\n\n\r\n                    Usually, those cheers are reserved for All-Stars like Devin Booker or Chris Paul. On this night, the praise belonged to the backups.\n\n\r\n                    Payne scored 14 points and dished seven assists to lead a Phoenix bench that poured in 65 points, and the Suns rolled to a 106-86 victory over the Miami Heat.\n\n\r\n                    Payne banked a layup high off the glass with less than a second left to give the Suns an 83-72 lead heading into the fourth. It was part of a big game for several Suns' reserves, which was the biggest reason they were able to slowly pull away from the Heat in the second half.\n\n\r\n                    Four backups scored in double figures, including Cam Johnson (15 points), Payne (14), Torrey Craig (14) and Dario Saric (13). Jevon Carter added nine points on three 3-pointers. That offset a fairly quiet night for Booker and Paul.\n\n\r\n                    Booker finished with 12 points and Paul had five points and nine assists. Paul said he wasn't surprised the bench was able to pick up the slack.\n\n\r\n                    “We have a team. Like a real team,” Paul said. “We lean on each other and trust each other.”\n\n\r\n                    The Suns have won 10 of their last 11 games, including three in a row. They improved to 39-15. The Heat fell to 28-26.\n\n\r\n                    Phoenix was 13 of 42 from 3-point range (31%), one night after setting a franchise record with 25 long balls.\n\n\r\n                    Miami had an even worse night from beyond the arc, making just 9 of 44 (20.5%). Jimmy Butler led the Heat with 18 points and Duncan Robinson added 15.\n\n\r\n                    “They’re a very good defense,” Miami coach Erik Spoelstra said. \"They did that similarly to us in Miami. Got us out of our normal flow, flattened us out a little bit. Things started to slow down and we held on to the ball too much.”\n\n\r\n                    The Heat jumped out to a 34-26 lead at the end of the first quarter after leading by as many as 13. The Suns fought back quickly and Paul hit a 3-pointer to tie it at 42-all with 8:18 left in the second. Phoenix pushed ahead 56-50 by halftime.\n\n\r\n                    Ayton led the Suns with 11 points and six rebounds before the break. Ariza and Dragic each scored 10 for the Heat.\n\n\r\n                    PAUL'S THEFTS\n\n\r\n                    Paul had three steals against the Heat, including two in the fourth quarter that pushed him to 2,311 for his career. That puts him fifth all-time. He passed Maurice Cheeks, who was fifth with 2,310.\n\n\r\n                    Paul still has a way to go for the top spot. That's held by John Stockton who had 3,265, which is nearly 600 more than anyone else in NBA history.\n\n\r\n                    BUTLER HOBBLING\n\n\r\n                    Butler was down for a couple minutes early in the fourth quarter when he landed on Carter's foot after taking a jumper and twisted his right ankle. He eventually returned to the game and finished 6 of 16 from the field. He also had eight assists.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: F KZ Okpala (health and safety protocols) and G Victor Oladipo (right knee soreness) didn't play.\n\n\r\n                    Suns: F Abdel Nader missed his 13th straight game with right knee soreness. ... Jae Crowder scored five points one night after pouring in a season-high 26 points on a career-high eight 3-pointers.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Travel to face the Denver Nuggets on Wednesday.\n\n\r\n                    Suns: Host the Sacramento Kings on Thursday.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt at www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996766.1405382
}