{
  "game_id": "0022200402",
  "espn_id": "401468557",
  "date": "Dec 12, 2022",
  "matchup": "MIA @ IND",
  "headline": "Butler's late flurry helps Heat put away Pacers 87-82",
  "body": "INDIANAPOLIS -- — Miami Heat coach Erik Spoelstra thought his players turned back the clock Monday night.\n\n\r\n              It reminded Indiana Pacers coach Rick Carlisle of an old Eastern Conference classic, too.\n\n\r\n              On a rugged night, Bam Adebayo had 22 points and 17 rebounds and Jimmy Butler scored seven straight points late in the fourth quarter to help the Heat hold off the Pacers 87-82. Butler finished with 20 points.\n\n\r\n              “We knew coming in it was going to be by any means necessary,” Spoelstra said. “If you don't lock in and play defense, they can take a 10-, 12-point lead on you quickly. This is not an easy team to play.”\n\n\r\n              The Heat had lost three of their previous four overall and two straight on the road. They also lost last month's first series matchup in Indianapolis.\n\n\r\n              They dug down, playing with grit, toughness and seemingly content to trade jabs and barbs in a game in which baskets were at a premium. The Pacers shot 35.4% from the field, while Heat was only slightly better at 38.6%.\n\n\r\n              But Butler finally cranked it up in the closing minutes, his late flurry turning a 77-73 contest into an 84-75 cushion with 2:26 to go. The Pacers couldn't get closer than four the rest of the game.\n\n\r\n              Buddy Hield led the Pacers with 19 points and Andrew Nembhard scored 18 as Indiana lost its second straight and for the sixth time in eight games.\n\n\r\n              The difference: Tyrese Haliburton’s poor shooting night. The Pacers guard missed all nine of his shots, all six of his 3-pointers and had just one point and three assists.\n\n\r\n              “This is classic Eastern Conference basketball — it's physical, it's grinding and both teams were trying to play fast,” Carlisle said. “The competition was great, but we've got to find a way to get better looks.”\n\n\r\n              Miami found just enough scoring punch to survive Indiana's 8-0 run midway through the third quarter that finally gave the Pacers 62-57 lead and ended the quarter on a 10-2 spurt to take a 67-64 edge before Butler's late flurry finally put it away.\n\n\r\n              “ It was a throwback game,\" Spoelstra said. “Probably the two happiest guys in the organization would be Pat (Riley) and for sure myself. You want to have that toughness so you can find a way to win when the shots are not going down.”\n\n\r\n              TIP-INS\n\n\r\n              Heat: Two-time All-Star Victor Oladipo was welcomed back to Indiana with a highlight reel that played on the video board before the national anthem. ... Miami improved to 14-49 all-time in Indianapolis. ... Kyle Lowry had eight points and made a 3-pointer in his 26th consecutive game, the third-longest streak of his career. ... Adebayo has scored in double figures in 42 consecutive games.\n\n\r\n              Pacers: NBA commissioner Adam Silver and two-time Indianapolis 500 winner Al Unser Jr. attended the game. ... Indiana has lost two straight home games to Eastern Conference foes after opening the season at 7-1. ... The Pacers were 11 of 39 on 3s but gave up only nine offensive rebounds two nights after allowing 29 in a loss to Brooklyn.\n\n\r\n              ON THE MEND\n\n\r\n              The Pacers could be getting one of their key rotational players, second-year guard Chris Duarte, back soon. Coach Rick Carlisle said the all-rookie team player practiced with the team's G League affiliate in Fort Wayne on Monday and is expected to play in two games in Wisconsin later this week. Duarte has been out since Nov. 4 with a sprained left ankle.\n\n\r\n              “After practice today the first thing he said to me is 'I feel better than I thought I would,'” Carlisle said. “We want him to feel good. We want him to feel great.”\n\n\r\n              UP NEXT\n\n\r\n              Heat: Make the second stop on a four-game trip Wednesday at Oklahoma City.\n\n\r\n              Pacers: Host defending NBA champ Golden State on Wednesday with a chance for the sweep.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993977.817028
}