{
  "game_id": "0022201166",
  "espn_id": "401469321",
  "date": "Apr 02, 2023",
  "matchup": "MIN vs. POR",
  "headline": "Sharpe scores 27 points, Trail Blazers edge Timberwolves",
  "body": "MINNEAPOLIS -- — Shaedon Sharpe scored 27 points, Kevin Knox II added 19 points and the short-handed Portland Trail Blazers beat the playoff-hopeful Minnesota Timberwolves 107-105 on Sunday.\n\n\r\n              Trendon Watford had 15 points and Skylar Mays finished with 13 points and nine assists in his second game with Portland, which had lost 11 of 12 and was without four regular starters.\n\n\r\n              The Trail Blazers trailed by 12 late in the third quarter before rallying to beat Minnesota, which started the day ninth in the Western Conference.\n\n\r\n              “Every single person that got out on that floor tonight, they gave it all they had and that’s all I want from our guys,” Portland coach Chauncey Billups said. “To play as hard as you can, play unselfish and be a good teammate and see what happens.\"\n\n\r\n              Anthony Edwards scored 37 points for the Timberwolves, who have lost three in a row and started the day a half-game behind the Los Angeles Lakers and a game ahead of Oklahoma City for the 10th and the final play-in spot in the West.\n\n\r\n              “We have too many guys not playing really well right now,” Minnesota coach Chris Finch said. “This was kind of who we’ve been all season in these types of games and we do it again. You know, obviously, timing of it is extra painful, but we got to get guys playing better.”\n\n\r\n              While they’re in the running for the playoffs, the Timberwolves are 5-10 against the five teams with the worst records in the NBA.\n\n\r\n              “We always fall short, it seems,” Edwards said of struggles against the bottom teams. “It always haunts us. And tonight, once again, yep.”\n\n\r\n              Edwards’ dunk gave Minnesota an 84-72 lead with 3:37 left in the third quarter before the Trail Blazers went on a 19-4 run to take a fourth-quarter lead with 7:57 left. The Timberwolves shot 6 of 17 in the fourth and Portland outscored them by six.\n\n\r\n              “I think we executed plays,” said Mays, a 2020 second-round draft pick by Atlanta who signed a 10-day contract with the Trail Blazers on March 30. “I think we defended and made shots tough on them and attacked mismatches. I thought we were pretty good.”\n\n\r\n              Edwards put Minnesota ahead with 2:22 left, but Sharpe converted a lay-up on the other end. Sharpe, the rookie who was the No. 7 overall draft pick, scored six points during an 8-3 run. \n\n\r\n              “He’s just growing up, man,” Billups said. “He’s just growing up and it’s fun watching him.”\n\n\r\n              Trailing by two, the Timberwolves couldn’t get a clean shot off on their final possession as Anderson's wayward attempt landed on top of the backboard.\n\n\r\n              “You have to have the appropriate fear in this league and a respect for, I don’t want to say these type of teams, but the teams that ain’t doing so well,” Anderson said. “We got to be able to handle business.”\n\n\r\n              TOUGH FINISH\n\n\r\n              Portland was 26-26 on Feb. 3 and had won five of six, firmly in the playoff race. Five days later, the Blazers made moves at the trade deadline to acquire Knox, Cam Reddish, Matisse Thybulle and Ryan Arcidiacono while trading Josh Hart and Gary Payton Jr.\n\n\r\n              They went 5-17 following the trade deadline. Damian Lillard and Jusuf Nurkic have missed six games in a row, Anfernee Simons has been out for seven straight and Jerami Grant missed his 10th in a row on Sunday.\n\n\r\n              Without Reddish (lumbar soreness) and Nasir Little (left ankle sprain) on Sunday, the Trail Blazers were missing nine of their top 12 scorers in total points this season either due to injury or trades.\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: Portland scored 21 points off 18 Minnesota turnovers. The Blazers only had 10 turnovers and also had 25 fast-break points. ... Jeenathan Williams made his Portland debut with seven points in 13 minutes.\n\n\r\n              Timberwolves: An illness has gone through the team. Edwards and Karl-Anthony Towns were questionable because of illness and Austin Rivers missed the game with the issue. Towns finished with eight points and nine rebounds in 25 minutes. ... Naz Reid missed his second game with a broken bone in his left wrist. ... Rudy Gobert had 10 points and 15 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Memphis on Tuesday night.\n\n\r\n              Timberwolves: At Brooklyn on Tuesday night. ------",
  "source": "espn_api",
  "crawled_at": 1764995007.1593988
}