{
  "game_id": "0021900497",
  "espn_id": "401161139",
  "date": "Dec 31, 2019",
  "matchup": "CHA vs. BOS",
  "headline": "Tatum, Walker help Celtics beat slumping Hornets 109-92",
  "body": "CHARLOTTE, N.C. --  There were no video tributes for Kemba Walker on this visit. The Boston Celtics guard returned to Charlotte for a second time without quite the same buzz, and that was OK with him.\n\n\"A little less emotional,\" he said. \"But it was fun.\"\n\nAnd productive.\n\nWalker had 22 points, Jayson Tatum had 24 and Gordon Hayward added 21 as Boston beat the Hornets 109-92 Tuesday. The Celtics have won six of seven and improved to 23-8.\n\nWalker, the Hornets franchise leader in scoring, was making his second appearance in Charlotte since he was sent to Boston in a sign-and-trade deal last July. After tearing up during a pregame tribute in his first visit Nov. 7, Walker kept cool this time, adding four rebounds and seven assists.\n\n\"It's just always fun to see my old friends, my old teammates, the people that work around the building that take care of this place, just a lot of old faces,\" he said. \"It was fun.\"\n\nBoston coach Brad Stevens thinks Walker will draw cheers from Charlotte fans for the rest of his career.\n\n\"I think people are going to react like that forever -- whether it's here or in Storrs,\" Stevens said of Walker, who was a first-round pick for Charlotte after leading Connecticut to the 2011 NCAA title. \"Wherever he goes, he's a special guy and he's an awfully good player. And he plays both sides of the ball and he's been really good for us.\"\n\nEnes Kanter had 13 points, 13 rebounds and a career-high six blocked shots for Boston. The victory completed a 3-0 season sweep for the Celtics over the Hornets.\n\nTatum hit five straight shots in the first quarter -- including a trio of 3-pointers -- and the Celtics overcame an early five-point deficit to lead 24-18 after the first quarter.\n\nHayward scored 10 points in the second quarter as Boston stretched the lead to 14 before taking a 50-43 edge into halftime.\n\nCharlotte surged within four points late in the third quarter before the Celtics responded with a 16-6 spurt to make it 89-75 with 9:55 left. They led by at least 10 the rest of the way.\n\n\"Offensively we've really struggled to score against them,\" said Charlotte coach James Borrego. \"Their length, their size, their switching ability is tough on us over a 48-minute game.\"\n\nPJ Washington led Charlotte with 15 points, and Miles Bridges had 14 points and 10 rebounds. The Hornets have lost six straight.\n\n\"We've got a game in two nights so we've just got to stick to it and just try to go and get another one,\" Washington said. \"There's a lot of great teams in this league and we feel like we can be one of those so, just coming out and keep the same energy we had tonight in the next game.\"\n\nTIP-INS\n\nCeltics: One day after being named Eastern Conference player of the week, Jaylen Brown sat out with a sinus infection. Stevens said Brown is day-to-day. Brown averaged 27.0 points, 6.7 rebounds and 2.3 assists while shooting 62.2% from the field and 57.9% on 3-pointers in three games last week.\n\nHornets: Charlotte is on its longest losing streak since dropping six straight from Nov. 3-17 during the 2017-18 season.\n\nGRAHAM SUPPORT\n\nWalker says he's been in regular contact with second-year Hornets guard Devonte' Graham, who leads Charlotte with 19.1 points per game.\n\n\"He's doing a great job and he's showing the whole NBA how good of a player he is, and that kind of attention is going to come,\" Walker said.\n\n\"I talk to him all the time. I talk to him all the time -- not much advice -- just keep going. Like I said, I'm just super happy for him. I talk to all these guys all the time. I watch every game whenever I get the opportunity to, so there's not much I can say. I'm just letting him go through the process and he's only going to get better.\"\n\nUP NEXT\n\nCeltics: Host Atlanta on Friday.\n\nHornets: Host Cleveland on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996077.3407328
}