{
  "game_id": "0021900341",
  "espn_id": "401160983",
  "date": "Dec 08, 2019",
  "matchup": "OKC @ POR",
  "headline": "Thunder open road trip with 108-96 win in Portland",
  "body": "PORTLAND, Ore. -- It was less than two weeks ago that the Oklahoma City Thunder last visited Portland, but this time they wouldn't leave with a loss.\nDennis Schroder and Shai Gilgeous-Alexander each scored 21 points and the Thunder opened a four-game trip with a 108-96 victory over the Trail Blazers on Sunday night.\nThe Thunder, who led by as many as 18 points in the first half, have won four of their last five games, the team's best stretch of the season. Chris Paul finished with 20 points.\n\"Obviously, the last time we came here we were really beat handily, from start to finish. We did get it back to nine, but we never really were in control of the game, constantly fighting an uphill battle,\" Thunder coach Billy Donovan said, recalling the 136-119 loss n Nov. 26. \"It was good that we were able to come into a tough place and play and find a way to win the game.\"\nDamian Lillard had 26 for the Blazers, who have lost three of four.\nAfter trailing 55-47 at the break, the Blazers closed the gap in the third quarter and the Thunder held just an 82-78 advantage going into the final period. But Danilo Gallinari's 3-pointer put Oklahoma City up 95-87 with 4:14 left.\nGilgeous-Alexander hit a 3-pointer and a floater that extended Oklahoma City's margin to 100-89 with 3:13 left and essentially put the game out of reach for the Blazers.\n\"I think we kind of just play well in stretches, and we don't really have the luxury of playing well in stretches. We're a team that if the ball's not going in, we gotta be getting to the 50-50 balls, we can't be letting teams get second and third opportunities. We foul every 30 seconds,\" Lillard said. \"I mean we are are doing a lot of things as a team that are putting us at a disadvantage.\"\nPortland (9-15) was coming off a costly 136-113 loss to the Los Angeles Lakers. Starting forward Rodney Hood tore his Achilles during the first half and will miss the rest of the season.\nThe Blazers had already lost forward Zach Collins to a shoulder injury that required surgery. And center Jusuf Nurkic continues to rehab from a broken leg.\nPortland made a move to shore up the frontcourt with the Nov. 19 signing of 10-time All-Star Carmelo Anthony, who hadn't played for more than a year.\nAnthony has fit in well with the Blazers, averaging 16.7 points and 5.6 rebounds through his first nine games. But he struggled against the Thunder, going 4 of 18 from the field and finishing with just nine points.\nKent Bazemore started in Hood's place against Oklahoma City.\nOklahoma City (10-12) was without Terrance Ferguson because of right hip soreness for the second straight game. Coach Billy Donovan said before the game that he expects Ferguson will miss Monday night's game at the Jazz as well. Abdel Nader started in his place.\nThe Thunder were coming off a 139-127 overtime victory over the Minnesota Timberwolves on Friday. Oklahoma City forced overtime when Steven Adams threw a length-of-the-court pass that Schroder caught and laid in at the buzzer.\nThe game got attention because Thunder guard Chris Paul alerted the officials that Minnesota's Jordan Bell had an untucked shirt, which led to a technical foul that helped the trailing Thunder send the game to overtime.\nNeither team looked sharp at the start on Sunday. Oklahoma City held a slight 21-20 lead at the end of the first quarter, on 31.8% shooting. Portland shot 27.6% to open the game.\nSchroder's pull-up jumper stretched the Thunder's lead to 41-29 midway through the second quarter.\nPortland clawed back into it and closed to within 51-47 on Anthony's 3-pointer, which capped a 10-0 Blazers run. But Portland couldn't get closer and trailed 55-47 at the break. Paul led all players with 16 points.\nPortland closed within 62-60 on Lillard's 3-pointer in the third quarter. The Blazers eventually pulled in front when Lillard made a trio of free throws, but it was short lived and the Thunder led 82-78 going into the final quarter.\n\"That's what's fun about our team,\" Paul said afterward. \"It's a team effort every night. As long as we keep playing like that I think we're going to keep grinding.\"\nThe teams split their first two games earlier this season.\nTIP INS\nThunder: In the third quarter a fan dropped a phone on the court and Dennis Schroder picked it up and handed it back. ... It was the first of a four-game trip for Oklahoma City. ... Luguentz Dort fouled out with 4:34 left in the game.\nTrail Blazers: Damian Lillard went 0 for 6 from the field to start the game. His first basket was a floater with less than a minute left in the opening quarter. Then he had 16 points in the third quarter alone. ... Hassan Whiteside finished with 14 points and 10 rebounds.\nREVENGE?\nPaul got a couple of delay of game penalties, which was the foul when Bell didn't have his shirt tucked in on Friday. One of them on Sunday was that he had his shooting shirt and his pants on when he was checking in, Paul said.\n\"He got me, got me back,\" Paul said. Asked if he thought it was because of Friday night, Paul responded, \"What do you think?\"\nPaul added diplomatically that he learned something about the rules, too.\nMISSING HOOD\nLillard said he thought about Hood before the game when the team was watching clips, but the Blazers had to put aside their feelings about their injured teammate before the tip.\n\"Rodney's my boy, but I knew he wasn't coming out there to warm up and play the game with us. I think it impacted us on the floor (Hood was a starter), but I don't think mentally guys were out there thinking `Oh, We don't have Rodney.' It's what we've been dealt,\" Lillard said.\nUP NEXT\nThunder: Oklahoma City plays the second of a back-to-back Monday night at Utah.\nTrail Blazers: Portland hosts the New York Knicks on Tuesday.\n---\nMore AP NBA:\nhttps://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996239.72266
}