{
  "game_id": "0022000842",
  "espn_id": "401307638",
  "date": "Apr 15, 2021",
  "matchup": "LAL vs. BOS",
  "headline": "Jaylen Brown scores 40, Celtics beat Lakers 121-113",
  "body": "LOS ANGELES -- — Jaylen Brown scored four of his 40 points in the final minute, and the Boston Celtics blew most of a 27-point lead in the fourth quarter before holding on for their fifth straight victory, 121-113 over the Los Angeles Lakers on Thursday night.\n\n\r\n                    Brown made 13 of his first 14 shots and hit three 3-pointers while falling two points shy of his career high for the Celtics, who have won eight of 11 despite an embarrassing finish at Staples Center.\n\n\r\n                    Boston led 113-86 with seven minutes to play, shortly after coach Brad Stevens pulled his starters. But Talen Horton-Tucker and Ben McLemore led a 24-2 run by the Lakers that forced Brown and Boston's first string back into the game.\n\n\r\n                    Brown hit a floater through contact and added a leaning jumper with 32 seconds left to squelch the Lakers' rally, and Boston split the season series between these historic rivals.\n\n\r\n                    “The Celtics-Lakers matchup is a matchup that kids dream about, so regardless of who’s on the floor, I’m excited to play,” Brown said. “Having that energy with those Lakers fans back in the arena, it feels good to get a win.”\n\n\r\n                    Payton Pritchard and Marcus Smart added 15 points apiece for the Celtics, who never trailed despite committing 21 turnovers. Boston also won with just 14 points from Jayson Tatum, whose streak of scoring 20 points in 11 consecutive games ended.\n\n\r\n                    “We have a tendency to be loose with the ball, and we’ve got to stop that,” Stevens said. “It'll bite us in time. You can't keep playing like that and expect to win.”\n\n\r\n                    Horton-Tucker scored 19 points and Marc Gasol had a season-high 18 for Los Angeles, which has alternated wins and losses since March 28. McLemore scored 15 of his 17 points in the fourth quarter of his home debut with the Lakers.\n\n\r\n                    “Those guys came out and competed their tails off,” Lakers coach Frank Vogel said of his end-of-the-bench reserves and Horton-Tucker. “I wanted them to be able to get the ‘W,’ but that was awesome how they played.”\n\n\r\n                    Along with the long-term absences of superstars Anthony Davis and LeBron James, the Lakers faced Boston without new center Andre Drummond, who has a bruised right big toe, and Markieff Morris, who has a sprained left ankle.\n\n\r\n                    Dennis Schröder nearly sat out with an infection on the ball of his right foot, but contributed eight points and eight assists. Kentavious Caldwell-Pope also played through mid-game back spasms, and Gasol stayed in after dislocating his pinky finger, which got popped back into place during a timeout.\n\n\r\n                    Boston carved up the Lakers’ starters in the first half while taking a 14-point lead. The Celtics hit 56% of their shots against the NBA’s No. 1 defense, with Brown scoring his 21 points particularly easily.\n\n\r\n                    “When those guys go out there and punch them in the mouth like that, it sets a tone for the whole game,” Pritchard said.\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Robert Williams III missed the game with left knee soreness and swelling. Boston was 8-2 since he joined the starting lineup at the trade deadline after Daniel Theis was moved to Chicago. ... Evan Fournier missed his fifth straight game under the NBA’s health and safety protocols.\n\n\r\n                    Lakers: Davis has been cleared for full on-court activities, and Vogel is hopeful he can play next week. Davis hasn't played since Feb. 14. “He's tired of being a patient and ready to be a player again,” Vogel said.\n\n\r\n                    FANS IN STANDS\n\n\r\n                    The Lakers were welcomed back from a seven-game road trip by about 1,915 fans in the Staples Center stands comprising the building’s first significant sports crowd since the start of the coronavirus pandemic.\n\n\r\n                    “I know it’s not full capacity and where we want to be, but it was great to have our fans back and cheering us on,” Vogel said. “It just gave us a different level of energy and juice, and hopefully it continues to grow.”\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Host Warriors on Saturday.\n\n\r\n                    Lakers: Host Jazz on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997287.038948
}