{
  "game_id": "0021801013",
  "espn_id": "401071686",
  "date": "Mar 12, 2019",
  "matchup": "POR @ LAC",
  "headline": "McCollum scores 35 to lead Trail Blazers over Clippers",
  "body": "LOS ANGELES --  Portland's CJ McCollum missed his first seven shots against the Los Angeles Clippers. He got hot though in the second half and cooled off the Clippers.\n\nMcCollum made 12 of his last 14 shots from the field and finished with 35 points Tuesday night, and the Trail Blazers took control in the fourth quarter and beat the Clippers 125-104 to snap their five-game winning streak.\n\n\"He never lost confidence, took the shots that were there and got us over the hump,\" Portland coach Terry Stotts said. \"I think he was confident that the looks he had (in the first half) were good. He's too good of a shooter to not take the next one.\"\n\nMcCollum -- who has six games this season where he has scored 35 points or more -- took control of the game during the fourth quarter as the Trail Blazers broke things open with a 21-5 run. Portland led 95-94 with 8:50 remaining before going on a 15-3 spurt that included 13 straight points by McCollum, including three 3-pointers.\n\nThree of McCollum's four best games against the Clippers have come this season. The sixth-year guard is averaging 25.8 points against the Clippers this season as the Blazers took three of four.\n\n\"I knew I missed a lot of open shots. I just ride the wave though and understand the kind of player that I am,\" McCollum said. \"I took my time and had some great looks that started to fall.\"\n\nIt was a successful start to a three-game road trip for Portland, which moved into a tie for fourth with Oklahoma City in what is becoming a tightly bunched Western Conference playoff race. The Clippers, who have won eight of their last 11, fell to seventh and are a half-game ahead of Utah for eighth.\n\nDamian Lillard scored 20 points and Jusuf Nurkic added 20 points and 12 rebounds for his 31st double-double of the season.\n\nThe Clippers -- who were on the end of back-to-back games -- led for most of the first 30 minutes before the Trail Blazers went on an 11-3 run to go up 75-68 with 4:55 remaining in the third quarter. McCollum and Lillard completed the run with 3s. Los Angeles slowly crept back and was within one in the fourth before Portland took control.\n\n\"I've seen that movie. I always tell you guys, when he sees the ball go in a few times, he can get going,\" Lillard said of McCollum. \"At that point, my job is to just try to make it last as long as possible. It lasted long enough to get us up in double digits, and we were able to pull away.\"\n\nMontrezl Harrell had 22 points and Lou Williams added 18 for the Clippers.\n\n\"For three quarters it was a winnable game. We ran out of gas in the fourth,\" Williams said. \"We've had some pretty emotional wins the past couple weeks and we used a lot of energy on those games.\"\n\nThere were four lead changes until the Clippers scored eight straight points to take a 19-12 lead with 4:08 remaining in the first quarter. They would be up by as many as eight (43-35) midway through the second quarter until the Blazers went on a late run to close the quarter and get within 52-50 at halftime.\n\n\"I thought we had a chance in the first half to have a 10 to 12-point lead. I thought once we didn't have that, I felt like the second half could be rough,\" Clippers coach Doc Rivers said.\n\nTIP-INS\n\nTrail Blazers: Guard Rodney Hood did not play due to right hip soreness. ... Evan Turner, who has been plagued by soreness in his left knee, saw action for only the third time in the past 10 games. He had two points in 10 minutes.\n\nClippers: Ivica Zubac had 10 points and 16 rebounds for his sixth double-double of the season and second with the Clippers. He had 12 rebounds during the first half, which is the most by a Clippers player this season. It is also the most for Los Angeles since DeAndre Jordan had 12 in the first half against Denver on April 7, 2018.\n\nUP NEXT\n\nTrail Blazers: Travel to the New Orleans Pelicans on Friday. Portland has won both meetings this season.\n\nClippers: Host the Chicago Bulls on Friday. Los Angeles has won six straight over Chicago.\n\n---\n\nFollow Joe Reedy at www.twitter.com/joereedy\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995163.81411
}