{
  "game_id": "0022301166",
  "espn_id": "401585794",
  "date": "Apr 11, 2024",
  "matchup": "CHI @ DET",
  "headline": "Chicago beats Detroit 127-105, sending Pistons to franchise-record 67th loss",
  "body": "DETROIT -- — DeMar DeRozan scored 39 points and the Chicago Bulls sent the Detroit Pistons to their franchise-record 67th loss of the season, 127-105 on Thursday night.\n\n\r\n              Detroit (13-67) broke the franchise mark set by the 1979-80 team.\n\n\r\n              “You can learn a lot about players at this time of year,” Detroit coach Monty Williams said. “I know, for myself, I earned a lot of money (as a player) playing down the stretch and hanging in there.”\n\n\r\n              Chicago (38-42) wrapped up home-court advantage in the Eastern Conference play-in game against Atlanta.\n\n\r\n              “I'm happy for these guys,” Bulls coach Billy Donovan said. “This season got off to a rough start for us, and I really appreciate the guys in our locker room sticking together and fighting. They never quit and never made excuses, even when we were losing players.”\n\n\r\n              Donovan said knowing the Bulls will face the Hawks at home will impact his lineup decisions for Friday's game in Washington and Sunday's season finale against the New York Knicks. \n\n\r\n              “I think there will definitely be conversations with the players,” he said. “We will have to evaluate things with a game tomorrow and then the New York game at 1:00. It might be playing guys for a half instead of leaving them out.”\n\n\r\n              Nikola Vucevic had 27 points and 11 rebounds for Chicago, and Coby White had 18 points.\n\n\r\n              White isn't concerned about his playing time in the last two games.\n\n\r\n              “I just work here, bro,” he said. \n\n\r\n              Jalen Duren had 20 points and 11 rebounds for Detroit, and Marcus Sasser scored 20 points. The Pistons have lost six straight and 14 of 15. They played without Cade Cunningham because of knee management.\n\n\r\n              “We have to finish out the season,” Sasser said. “We're trying to keep high spirits.”\n\n\r\n              Chicago led by nine going into the third quarter and slowly pulled away. DeRozan's 3-pointer made it 90-70 with 3:27 left in the third, and Bulls led 99-80 at period's end.\n\n\r\n              The Pistons, who allowed 34 points off turnovers, never threatened in the fourth.\n\n\r\n              “We made 14 threes and they made 14 threes,” Williams said. \"They just had so many more opportunities — they played in transition almost the whole night because of our turnovers. That's something I haven't been able to help our guys with — playing in crowds and playing in passing lanes.”\n\n\r\n              The Bulls led 64-55 at halftime, with DeRozan and Vucevic each scoring 17 points.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Washington on Friday night.\n\n\r\n              Pistons: At Dallas on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995856.597804
}