{
  "game_id": "0021400799",
  "espn_id": "400579091",
  "date": "Feb 11, 2015",
  "matchup": "HOU @ LAC",
  "headline": "DeAndre Jordan's 24-20 game powers Clips over Rockets",
  "body": "LOS ANGELES -- DeAndre Jordan has recorded at least 20 points and 20 rebounds in three of the Los Angeles Clippers' past six games -- something he wasn't able to do in any of his 511 previous regular-season and playoff games in the NBA.\nYet, he'll be watching the All-Star Game from home.\nJordan powered the two-time defending Pacific Division champions to a 110-95 victory over the Houston Rockets on Wednesday night with 24 points and 20 boards.\n\nThe seventh-year center, whose 22 points and career-high 27 rebounds carried the Clippers to a 115-98 victory Monday night at Dallas, shot 6-for-8 from the field to extend his NBA-record streak to 39 consecutive games shooting at least 50 percent. He also was 12-for-26 from the free throw line.\nCoach Doc Rivers thinks Jordan's monstrous season so far should have resulted in his first All-Star selection.\n\"DJ should be on it. We all know that,\" Rivers said. \"I think it's a travesty. I really do -- a guy who's getting 20s and 20s is not on the team.\n\"You play both sides of the floor. Just one end of the floor keeps getting all of the credit, but the other side is more important. There's never been a team that's won a title without being a decent defensive team. But that side keeps getting forgotten about in the All-Star Game. But DJ knows that we're playing for bigger things than All-Star games.\"\nUnder instructions from coach Kevin McHale, the Rockets fouled Jordan eight times during the final 4:15, hoping to capitalize on his notoriously poor foul shooting. But he made seven of 16 during that stretch, and Houston got no closer than 10 points -- while making only two field goals over the final 8:05.\n\"I know it's a hard thing to go through, from a coaching standpoint, and I'm sure for DJ, too,\" Rivers said of the constant fouling. \"But we actually gained points through that, so we were happy. I'm an old-school guy. And every time it starts happening, one of the refs comes up to me and said: 'Don't you think we have to change this rule?' I don't know. It's a tough one. But it doesn't look good.\"\nThe Clippers also got 20 points each from Jamal Crawford and J.J. Redick in their third game without Blake Griffin, who will be sidelined at least three weeks after surgery for a staph infection in his right elbow. Chris Paul had 12 assists and 12 points.\nCorey Brewer scored 22 points and fellow reserve Josh Smith had 21 for the Rockets, who have lost 11 of their past 12 meetings with the Clippers and eight straight to them at Staples Center.\nJames Harden finished with nine points on 3-for-12 shooting, after coming in with a league-best 27.7 scoring average -- including 45 against Portland and 40 at Phoenix in Houston's previous two games.\n\"It was a tough one,\" Harden said. \"We had several opportunities to put ourselves in a position to win the game. But we didn't knock down shots, we gave up a lot of points and we couldn't recover from that. Once we start communicating at a high level defensively and offensively, this team will improve.\"\nAll of the Clippers' starters had scored in double figures before the third quarter ended with Los Angeles leading on a buzzer-beating layup by Glen Davis.\nCrawford banked in his only 3-pointer of the game from 29 feet away to give the Clippers an 89-82 lead with 9:11 to play, and he sank all three free throws to increase the margin to 100-88 after he was fouled behind the 3-point line by Patrick Beverley with 4:47 remaining.\nRivers got a technical foul from referee and former NBA player Haywoode Workman after Redick was whistled for fouling Harden with five minutes left in the third quarter and Los Angeles leading 70-64.\nTIP-INS\nRockets: The only player in club history with three consecutive games of 40 or more points is Moses Malone. ... One night after scoring 41 points in the first quarter against the Suns, the Rockets settled for a 24-all tie through the first 12 minutes against the Clippers. ... Harden scored 16 points the last time the teams met, on Nov. 28, when the Rockets lost 102-85 at Houston and gave up 30 points to Griffin. Dwight Howard missed both games. ... F Terrence Jones missed his second game because of flu-like symptoms.\nClippers: Rivers and Workman were teammates with the Atlanta Hawks during the 1989-90 season, when Workman was a rookie. He became a full-time NBA referee in 2008-09, after playing parts of eight seasons in the league. ... Griffin and Paul were presented with their All-Star jerseys at midcourt by Rivers, who played in the 1988 All-Star Game while representing the Hawks. ... Davis had four fouls in his first six minutes on the court and was back on the bench with 9:33 left in the first half. He finished with eight points in 16 minutes. ... The Clippers are 19-6 when Paul has 10 or more assists.\nUP NEXT\nRockets: At Dallas on Feb. 20.\nClippers: Host San Antonio on Feb. 19.",
  "source": "espn_api",
  "crawled_at": 1764992236.450759
}