{
  "game_id": "0021600212",
  "espn_id": "400899662",
  "date": "Nov 23, 2016",
  "matchup": "MEM @ PHI",
  "headline": "Gasol, Conley lead Grizzlies over 76ers in 2OT",
  "body": "PHILADELPHIA --  The Grizzlies proved again they can win close games. It didn't hurt that they didn't have to face Joel Embiid in the second overtime.\n\nMarc Gasol scored 27 points, Mike Conley had 25 and the Grizzlies beat the Philadelphia 76ers 104-99 on Wednesday night for their sixth straight victory.\n\nConley added nine rebounds and nine assists for the Grizzlies, who came back from an 11-point, second-half deficit for their eighth consecutive win against Philadelphia.\n\n\"Most of the games we play are close, so we're used to it,\" Gasol said. \"We feel very comfortable in those situations.\"\n\nErsan Ilyasova had 22 points and 12 rebounds for Philadelphia, which was looking for its first three-game winning streak in nearly three years. The 76ers had their four-game home winning streak snapped.\n\nEmbiid had 12 points and 11 rebounds but didn't play in the second overtime. The rookie center is on a minutes restriction after missing the last two seasons with a foot injury. He finished with 27 minutes.\n\n\"There's a human side to all of this,\" Philadelphia coach Brett Brown said. \"There it is 10 feet from you. It's tempting but not wise. That's the discipline we have to have.\"\n\nEmbiid lobbied to enter in the second overtime but was denied.\n\n\"It was frustrating but those guys care about me and are looking out for me,\" he said.\n\nAsked if he was looking forward to having free rein with his minutes, Embiid said, \"I can't wait for that day to come.\"\n\nZach Randolph scored the first four points of the second overtime to give Memphis a 95-91 lead. Philadelphia cut it to 99-98 after Jerryd Bayless' layup with 23 seconds remaining. Conley's two free throws pushed Memphis' lead back to three and Philadelphia never got closer.\n\n\"When you get to April, these are the games you look back on,\" Memphis coach David Fizdale said. \"You preach to your team they have another level to go to. It becomes habit.\"\n\nThe teams were a combined 1 for 11 from the field in the first OT before Randolph put Memphis ahead 91-88 with 49 seconds left when he converted over Embiid on a drive. Bayless tied it with a 3 from the top of the key with 43 seconds left before Conley's turnover gave Philadelphia the ball back.\n\nBayless misfired on a midrange shot that would've won it, and Embiid couldn't convert on a baseline jumper after an inbounds play with 1.3 seconds left.\n\nEmbiid had the final shot of regulation, but his over-the-head try against the defense of Gasol went off the backboard.\n\n\"I don't know if I'm going to get fined for this but I thought I got fouled,\" Embiid said.\n\nRESPECT GIVEN\n\nThe Grizzlies lauded the play of Embiid and the 76ers, who don't resemble the sad-sack bunch that won 47 games combined the previous three seasons.\n\n\"You know you're going to have a tough night, no matter what, because they don't stop playing until that final whistle,\" Conley said. \"They scrap and claw for every little bit. We're thankful to get away with a win tonight.\"\n\nOf Embiid, Fizdale said, \"The whole league will have to deal with him a long time. He's a special, special talent.\"\n\nBEEN AWHILE\n\nThe 76ers' last three-game winning streak came Dec. 29, 2013-Jan. 4, 2014.\n\nTIP-INS\n\nGrizzlies: Chandler Parsons (knee) and James Ennis (calf) didn't play. . Memphis scored 69 points in the first half of Monday's 105-90 win over Charlotte but managed just 43 against Philadelphia. ... The Grizzlies' streak of three straight games leading by 20 or more points ended.\n\n76ers: Embiid won't play on Friday night against the Bulls as part of his rehab plan. ... Richaun Holmes and Gerald Henderson both were out due to illness. ... Philadelphia committed 27 turnovers.\n\nUP NEXT\n\nGrizzlies: Host Miami on Friday night. Fizdale is a former Heat assistant.\n\n76ers: Host Bulls on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995622.1310568
}