{
  "game_id": "0021601224",
  "espn_id": "400900602",
  "date": "Apr 12, 2017",
  "matchup": "HOU vs. MIN",
  "headline": "Harden's triple-double helps Rockets over Wolves 123-118",
  "body": "HOUSTON -- Instead of resting players with their playoff spot already set, the Houston Rockets approached their regular-season finale as a final tuneup for the postseason.\nThe result was the 22nd triple-double for James Harden and a 123-118 victory over the Minnesota Timberwolves on Wednesday night.\nHarden had 27 points, 10 rebounds and 12 assists to help Houston to its 55th victory.\nAll five of Houston's regular starters started after coach Mike D'Antoni had given everyone but Harden time off in the last few games in preparation for the team's first-round playoff series against Oklahoma City.\n\"I think we played well,\" Harden said. \"Our effort was there and we finally got everybody on the court tonight so that's the good thing. And we'll start Sunday.\"\nThe MVP contender became the first player in NBA history to finish the regular season with at least 2,000 points (2,356), 900 assists (907) and 600 rebounds (659).\nThe Rockets had a 12-point lead after a 3-point play by Patrick Beverley with about nine minutes left. Minnesota cut into the lead with a 6-2 spurt before Houston got consecutive 3-pointers from Harden and Eric Gordon to extend the lead to 113-99 midway through the quarter.\nHarden, who also had four steals and a block, found Clint Capela on an alley-oop dunk after that, before hitting another 3-pointer to make it 118-99 and spur Timberwolves coach Tom Thibodeau to call a timeout.\nKarl-Anthony Towns finished with 28 points and 21 rebounds for the Timberwolves, who end the season with a six-game losing streak.\nThibodeau said ending the season the way they did is a good benchmark for what they need to do in the offseason.\n\"It tells us exactly where we are,\" he said. \"We don't get fooled into thinking that it's something that it's not. It tells us exactly how hard we're going to have to work to get where we want to go.\"\nTowns also made NBA history by becoming the only player to have at least 2,000 points (2,061), 1,000 rebounds (1,007) and 100 3-pointers (101) in a season.\nRyan Anderson made six 3-pointers for the Rockets and finished with 20 points and Capela had 22 points and 10 rebounds.\nD'Antoni is happy with where Anderson is at in his fourth game back after missing six games with an ankle injury.\n\"I thought he looked really fresh and lively, and he really came out of the gate quick,\" D'Antoni said. \"He's playing really well.\"\nFour straight points by the Timberwolves cut Houston's lead to six points with about two minutes left in the third quarter. But Houston scored the lead eight points of the quarter, led by 3-pointers from Lou Williams and Harden, to extend the lead to 95-81 entering the fourth.\nA 3-pointer by Towns got the Timberwolves within a point early in the third quarter before Houston used a 10-2 run to push the lead to 76-67 with about nine minutes left in the period. Ryan Anderson made consecutive 3-pointers to start that run and Capela capped it with back-to-back baskets.\nThe Rockets led by 13 early, but the Timberwolves had tied it at 60 by halftime.\nTIP-INS\nTimberwolves: Andrew Wiggins finished with 21 points. ... Shabazz Muhammad had 22 points. ... Kris Dunn had 10 points with 16 assists.\nRockets: Houston had at least 60 points at halftime for the 39th time this season. ... Anderson scored 20 points or more for the 14th time. ... Trevor Ariza added 15 points.\nTHEY SAID IT\nThibodeau on Harden: \"Obviously the individual part of it is unbelievable, but it is also what he has done for the team. To lift a team the way he has is an amazing feat. He not only brought out the best out of himself but he brought the best out of the team.\"\nRECORD-SETTING 3s\nHouston finished the season with 1,081 3s to break the NBA record for 3-pointers in a season set by Golden State last season. The Rockets made 19 3-pointers on Wednesday to improve to 36-5 this season when making at least 15.\nUP NEXT\nTimberwolves: Season over.\nRockets: Begin first round of playoffs by hosting Oklahoma City on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995729.4537559
}