{
  "game_id": "0022300467",
  "espn_id": "401585095",
  "date": "Jan 03, 2024",
  "matchup": "ATL vs. OKC",
  "headline": "Jalen Johnson has career-high 28 points as Hawks hold on late, snap Thunder's 5-game winning streak",
  "body": "ATLANTA -- — Jalen Johnson scored a career-high 28 points and the Atlanta Hawks held off Oklahoma City 141-138 on Wednesday night, ending the Thunder’s five-game winning streak.\n\n\r\n              Atlanta opened the game with 11 straight points and never trailed. Trae Young had 24 points and 11 assists, one of four Hawks players who scored more than 20. Bogdan Bogdanovic added 23 points and Dejounte Murray had 22. \n\n\r\n              Shai Gilgeous-Alexander had 33 points and 13 rebounds to lead Oklahoma City. Jalen Williams scored 21.\n\n\r\n              It was the second straight personal scoring high for Johnson, following his 24 points in a 130-126 win at Washington on Sunday.\n\n\r\n              “He's going to have more career-high nights,” Young said. “My standard is high for Jalen.”\n\n\r\n              Gilgeous-Alexander's layup with 48.5 seconds remaining cut Atlanta's lead to 141-136, after the Thunder trailed by double digits most of the game. Following a miss by Murray, Gilgeous-Alexander's basket trimmed the deficit to three.\n\n\r\n              Isaiah Joe's last-second 3-pointer from the corner was no good for Oklahoma City.\n\n\r\n              “We didn't have our best night, obviously, but I thought we stuck together and stayed in it,” Thunder coach Mark Daigneault said. “We kind of played on their terms tonight. They outplayed us tonight.” \n\n\r\n              The Hawks improved to 5-9 at home. They play 10 of 15 games in January at home and hope to build off the win over the Thunder, who are competing for the best record in the Western Conference.\n\n\r\n              “I think it's huge, especially since we started the new year off with a win,” Johnson said. “I think it was a great start for our team. Hopefully we can get something out of that.”\n\n\r\n              The Thunder's surge of eight wins in their last nine games included Tuesday night's 127-123 victory over Boston. Oklahoma City ended winning streaks of nine games by the Los Angeles Clippers and six games by Boston during the nine-game stretch.\n\n\r\n              Johnson scored 12 points in the second quarter, including a jam over 7-foot-1 Chet Holmgren that gave Atlanta a 76-57 lead late in the first half.\n\n\r\n              In his third season, Johnson has seen his playing time increase dramatically. He had four steals against Oklahoma City to set another career high.\n\n\r\n              The challenge for Daigneault's team was playing back-to-back nights, including a late-night flight from Oklahoma City to Atlanta, before facing the up-tempo Hawks.\n\n\r\n              Fatigue appeared to be a factor as the Thunder missed their first seven shots from the field and Atlanta scored the first 11 points. \n\n\r\n              Atlanta's 76-59 halftime lead was built on 19 fast-break points, matching the team's high mark for any half this season.\n\n\r\n              Clint Capela had a double-double for Atlanta with 12 points and 14 rebounds. Bogdanovic shot 5 for 11 on 3-pointers.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Visit the Brooklyn Nets on Friday.\n\n\r\n              Hawks: Visit the Indiana Pacers on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996295.8310242
}