{
  "game_id": "0021301198",
  "espn_id": "400490071",
  "date": "Apr 13, 2014",
  "matchup": "DET vs. TOR",
  "headline": "Raptors blow lead but still beat Pistons 116-107",
  "body": "AUBURN HILLS, Mich. -- Kyle Lowry picked up his fifth foul at around the midway point of the fourth quarter -- then was called for his sixth 20 seconds later.\nIt was the type of mistake that could prove costly for Toronto in the playoffs, but this time the Raptors were able to overcome it.\nDeMar DeRozan scored 14 of his 30 points in the fourth quarter, and the Raptors tied a franchise record for victories with a 116-107 win over the Detroit Pistons on Sunday. Lowry scored 28 points before fouling out with 5:51 remaining.\n\"I was just glad the guys won it without me,\" Lowry said. \"DeMar was rested going into the fourth quarter, and he really took over down the stretch. That's what happens when he is aggressive -- he can take over a game.\"\nThe Raptors (47-33) had already clinched the Atlantic Division, and the victory over Detroit was their 10th in 14 games. Toronto has reached the 47-win mark for the third time. The Raptors went 47-35 in 2001 and 2007.\nAndre Drummond had 14 points and 17 rebounds for the Pistons in the final home game of their dismal season. Detroit's Josh Smith missed a fourth straight game with tendinitis in his left knee.\nDetroit trailed by as many as 18 in the first half but rallied to take the lead late in the third quarter. But no matter what the Pistons did, DeRozan always seemed to have an answer in the fourth.\n\"I understood if we were going to win the game, then I had to step it up,\" DeRozan said. \"I just tried to make plays for us and get a couple of easy baskets.\"\nDeRozan's three-point play put the Raptors ahead 97-95 and started an 11-2 run. His emphatic, right-handed dunk made it 107-99 and thrilled the vocal contingent of Toronto fans who were in attendance.\n\"The fans were unbelievable,\" Lowry said. \"I've never heard anything like that, especially not here.\"\nThe Raptors shot 74 percent from the field during a brilliant first quarter and looked headed for a blowout. A three-point play by Terrence Ross put Toronto up 20-5, and an alley-oop to DeRozan made it 28-12.\nIt was 42-26 at the end of the quarter, and DeRozan's four-point play early in the second made it 46-28.\n\"We had no rhythm early on and we didn't guard. You give a team 42 points in the first quarter, I don't know what your chance of winning is, but I would think in this league it's pretty low,\" Pistons interim coach John Loyer said. \"Then you really have to fight uphill the whole way. But to our guys' credit, they fought an uphill battle.\"\nThe Pistons trailed 63-49 at halftime but made a game of it by outscoring Toronto 37-24 in the third. Detroit dominated the boards, finishing with 21 offensive rebounds. Greg Monroe had 23 points and 10 rebounds.\nLowry's fifth foul came with 6:11 remaining. He then fouled out going after a rebound on a missed shot by DeRozan. The Pistons couldn't take advantage, though.\nAfter a free throw by Drummond cut Detroit's deficit to two, Jonas Valanciunas answered with a free throw and Ross made a 3-pointer for the Raptors. A layup by Patrick Patterson made it 105-97.\nGame notes\nDetroit's Tony Mitchell had four fouls in 6:16 of playing time in the first quarter. Then he didn't play again until the final minute of the fourth. ... The Pistons weren't thrilled with the officiating early. Monroe was called for a technical foul in the first, and Detroit was charged with a team technical in the second. ... Toronto has scored at least 100 points in six straight games.",
  "source": "espn_api",
  "crawled_at": 1764993268.670326
}