{
  "game_id": "0022300595",
  "espn_id": "401585223",
  "date": "Jan 20, 2024",
  "matchup": "ATL vs. CLE",
  "headline": "Cavs extend NBA's longest win streak to seven with balanced 116-95 win over Hawks",
  "body": "ATLANTA -- — Donovan Mitchell had 18 points and eight assists to lead a balanced attack as the Cleveland Cavaliers extended the NBA's longest current win streak to seven games with a 116-95 win over the Atlanta Hawks on Saturday night.\n\n\r\n              Jarrett Allen had 14 points and 11 rebounds, while seven Cavaliers scored in double figures. Sam Merrill had 18 points with five 3-pointers. Dean Wade scored 17 and Georges Niang had 14.\n\n\r\n              The Cavs scored the first 10 points of the game and never trailed in holding the Hawks to a season-low in points and beating Atlanta for the third time in three games this season.\n\n\r\n              “If you come out and set the tone defensively, and let them know it is not going to be easy, you can put yourself in position where they are chasing you all night,” said Cavs coach J.B. Bickerstaff. “In the NBA, runs happen, but you’d rather be playing from in front than trying to play back into the game.”\n\n\r\n              Cleveland led 15-4 midway through the first quarter against the NBA's fourth-highest scoring team.\n\n\r\n              “We have an intent and purpose to start basketball games. It is a complete buy-in to be elite defensively,” Bickerstaff said. “You are doing something special if you are containing a team like that in the first quarter.”\n\n\r\n              Cleveland extended a 14-point halftime lead by outscoring the Hawks 34-25 in the third quarter. Atlanta ranks near the bottom of the league in third-quarter net rating.\n\n\r\n              The loss snapped a three-game winning streak for the Hawks.\n\n\r\n              “We’ve been mercurial. We’ve had moments we’ve found things that are successful in games and we’ve gotten away from them,” said Hawks coach Quin Snyder. “We were a different team in the three games previous than we were tonight.”\n\n\r\n              The Hawks did not return from a road game at Miami until 2:30 a.m. Saturday.\n\n\r\n              Trae Young left the game with 8:43 remaining after taking a charge from Isaac Okoro. Young was hit in the face by an inadvertent elbow, stayed on the court for a few minutes and walked back to the locker room with the Hawks trailing by 25. He did not return after scoring 15 points.\n\n\r\n              Young was questionable with an illness a night after sitting out the Hawks’ win over the Heat.\n\n\r\n              Dejounte Murray, who hit last-second, game-winning shots for the Hawks in their previous two games, led Atlanta with 24 points. He also had nine rebounds and five assists. Jalen Johnson added 20 points and seven rebounds.\n\n\r\n              The Cavaliers improved to 12-3 since starters Darius Garland and Evan Mobley were both injured. Against the Hawks, guard Caris LaVert (16 ppg) missed the game with a score wrist.\n\n\r\n              Cleveland's Pete Nance, whose father, Larry Nance Sr., starred for the Cavaliers, made his NBA debut in the final two minutes. He did not score.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit the Magic on Monday night in the second game of a four-game road trip.\n\n\r\n              Hawks: At the Kings on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996292.375863
}