{
  "game_id": "401810123",
  "espn_id": "401810123",
  "date": "Nov 22, 2025",
  "matchup": "CHA vs LAC",
  "headline": "Harden erupts for 55, Clippers rout Hornets 131-116 in Paul's likely last game in North Carolina",
  "body": "CHARLOTTE, N.C. -- — James Harden made 10 3-pointers and scored a franchise-record 55 points, and the Los Angeles Clippers beat the Charlotte Hornets 131-116 on Saturday hours after 12-time All-Star point guard Chris Paul released a video on social media hinting at retirement after the season ends.\n\n\r\n              Ivica Zubac added 18 points, nine rebounds and six assists for the Clippers, who snapped a three-game losing streak.\n\n\r\n              Rookie Kon Knueppel had 26 points to lead the Hornets, who have lost five straight. Brandon Miller returned from a 13-game absence because of a shoulder injury and finished with 21 points.\n\n\r\n              Harden erupted for 27 points in the opening quarter on five 3s, helping the Clippers build a 14-point first-half lead and erase a fast start by the Hornets, who made seven of their first eight shots.\n\n\r\n              Charlotte pulled within 74-72 in the third quarter, but the momentum changed when LaMelo Ball exited the game with his fourth foul.\n\n\r\n              With Hornets center Ryan Kalkbrenner leaving the game early with an ankle injury, the Clippers leaned on Zubac's size advantage over Moussa Diabate in the third quarter, resulting in back-to-back dunks. Then came Harden's signature moment, as he drilled his eighth 3 on a step-back jumper over two defenders, drawing a foul on Diabate for a 4-point play.\n\n\r\n              Harden's 55-point outing was the 11th-highest scoring game of his career. His career high is 61 points. The Clippers' previous single-game scoring record was 52 points, achieved by Charles Smith and Bob McAdoo.\n\n\r\n              Paul, who grew in Winston-Salem and played at Wake Forest, finished what is expected to be his final game in his home state with eight assists. The 40-year-old showed his mastery of finding the open man in the second half by finding LA teammate Brook Lopez for three open 3s.\n\n\r\n              Hornets lose two more\r\n              The Hornets, who have been besieged by early season injuries, lost two more players against the Clippers. Kalkbrenner (left ankle soreness) and veteran guard Pat Connaughton (right calf soreness) left the game in the first half and did not return. \n\n\r\n              Up next\r\n              Both teams are on the road Sunday night, with the Clippers visiting Cleveland and the Hornets at Atlanta. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042674.2944698
}