{
  "game_id": "0021600491",
  "espn_id": "400899933",
  "date": "Dec 29, 2016",
  "matchup": "LAL vs. DAL",
  "headline": "Mavericks take control in third quarter, beat Lakers 101-89",
  "body": "LOS ANGELES --  Victories have been elusive for the Dallas Mavericks of late, unless they happen to be playing the Los Angeles Lakers.\n\nThe Mavericks can beat the Lakers, as they showed again Thursday night with 101-89 victory.\n\nThe Mavs have won only 10 games this season, but two have come against the Lakers. That should come as no surprise, with Dallas now having beaten the Lakers 12 consecutive times.\n\n\"Wins here are difficult to come by,\" said Mavs coach Rick Carlisle. \"We're a very humbled group, for obvious reasons.\"\n\nDallas pulled off Thursday's victory with a third quarter that devastated the Lakers, outscoring them 31-13. Wesley Matthews scored 20 points to lead the Mavericks, including 16 points in the decisive third quarter.\n\n\"Matthews' big second half really keyed us,\" Carlisle said. \"His shot making energized our defense even more and guys kept finding him.\"\n\nThe Lakers lost for the 14th time in 16 games.\n\n\"I really thought we had turned the corner a little bit,\" said Lakers coach Luke Walton. \"It's disappointing to see we had the same type of result again in a similar game in what we've seen the last week or two.\n\n\"I'm still confident our group is going to get it. Unfortunately, it seems like we're going to have to take a lot of these lumps before it really kicks in.\"\n\nThe Lakers led 27-26 at the end of the first quarter and 57-50 at the half. They were still up 65-60 in the third quarter when Matthews ignited a 21-5 Dallas run.\n\nHarrison Barnes had 17 points and nine rebounds, and Dwight Powell and Devin Harris each scored 14 points off the bench for Dallas.\n\n\"One thing we've struggled a little bit with is playing with the lead,\" Matthews said. \"We know what (the Lakers) are capable of and we know they've had some pretty good wins this season. We just were grinding.\"\n\nThe Mavs forced 15 turnovers, which equaled the amount of assists the Lakers managed. After the Lakers fell behind, they too frequently reverted to going 1-on-1.\n\n\"Tonight we did for sure,\" Walton said. \"When we are at our best, that's not the case. We kept trying to get it all back in one play.\"\n\nJulius Randle scored 18 points and Nick Young had 17 for the Lakers.\n\nTIP-INS\n\nMavericks: Forward Dirk Nowitzki missed the game with a fever. ... Guard Jose Juan Barea was out with a left leg muscle strain. ... Barnes continues to emerge for the Mavs, having led them in scoring in 17 of their first 31 games.\n\nLakers: Journeyman forward Thomas Robinson, signed as a free agent in September, continues his recent roll of valuable minutes. He scored a season-high 10 points Tuesday and in his last four games has shot 72.2 percent (13 of 18). .. Assistant coach Mark Madsen remains out following his appendectomy Tuesday.\n\nYOUNG ENOUGH\n\nYoung hit his first six shots, including his first five 3-pointers, before missing his final two shots. He did not score in the fourth quarter.\n\n\"We just got outside ourselves,\" Young said. \"We weren't looking to pass the ball. A lot of 1-on-1 in the second half. That's weak basketball.\"\n\nPOWELL IMPACT\n\nThe third-year forward out of Stanford made 7-of-9 field goals, and added six rebounds to go with his 14 points in 14 minutes.\n\n\"Dwight was terrific,\" Carlisle said. \"He was making a huge impact with rolls to the basket.\"\n\nUP NEXT\n\nMavericks: Head to Oakland to meet the Golden State Warriors, owners of the NBA's best record, on Friday.\n\nLakers: Will host the Toronto Raptors on Sunday in the fourth of five consecutive home games. The Raptors blew out the Lakers 113-80 last month in Toronto.",
  "source": "espn_api",
  "crawled_at": 1764995412.6742542
}