{
  "game_id": "0022400282",
  "espn_id": "401704848",
  "date": "Nov 25, 2024",
  "matchup": "MEM vs. POR",
  "headline": "Morant finishes with 22 points and 11 assists in his return as Grizzlies beat Trail Blazers 123-98",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 22 points and 11 assists in his return to the lineup after missing eight games with a hip injury, leading the Memphis Grizzlies to a 123-98 victory over the Portland Trail Blazers on Monday night.\n\n\r\n              Morant shot 6 fo 12 from the field, including 2 for 3 from 3-point range. Jaren Jackson Jr. scored 21 points, and Santi Aldama finished with 13 points and a career-high 17 rebounds.\n\n\r\n              Deni Avdija led Portland with 17 points, eight rebounds and six assists. Shaedon Sharpe added 15 points for the Trail Blazers, who lost for the third time in four games.\n\n\r\n              Takeaways\r\n              Trail Blazers: Due to poor shooting, Portland trailed by double digits in the first half. The Trail Blazers closed within six points in he third quarter, but got no closer after a Memphis burst. Portland shot 34 for 102 (33%) overall.\n\n\r\n              Grizzlies: Morant's return increased the pace of the Grizzlies' offense, among the fastest in the league, even though they were limited in fast-break points.\n\n\r\n              Key moment\r\n              Morant made a 3-pointer near the close of the first half, heaving a shot from three-quarters court that banked in. But the shot was after the second quarter horn, leaving Memphis leading 65-54 at the break. \n\n\r\n              Key stat\r\n              Portland was 4 of 42 from 3-point range in a Nov. 10 loss to Memphis. Things weren't much better in Monday's loss as Portland made only three of its 20 shots from outside the arc in the first half. And finished the game 8 of 46 from beyond the arc.\n\n\r\n              Up next\r\n              Portland plays the Pacers in Indiana on Wednesday. Memphis hosts Detroit on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997748.8722
}