{
  "game_id": "0022400819",
  "espn_id": "401705385",
  "date": "Feb 23, 2025",
  "matchup": "MEM @ CLE",
  "headline": "Mitchell scores 33 points, NBA-leading Cavaliers beat Grizzlies 129-123 for 7th straight win",
  "body": "CLEVELAND -- — Donovan Mitchell scored 33 points, fellow All-Star Evan Mobley had 25 points, 13 rebounds and eight assists and the NBA-leading Cleveland Cavaliers beat the Memphis Grizzlies 129-123 on Sunday night.\n\n\r\n              Ty Jerome had 15 of his 26 points in the fourth quarter for Cleveland, which extended the longest active winning streak in the league to seven and is 27-4 at Rocket Arena. All-Star guard Darius Garland did not play after bruising his left hip Friday against New York.\n\n\r\n              Memphis, which is second in the Western Conference, lost for the third time in four games. Jaren Jackson Jr. scored 22 points, Ja Morant had 21 points and 10 assists, and Luke Kennard added 19 points off the bench.\n\n\r\n              The matchup featured the two highest-scoring teams in the NBA with Cleveland averaging 122.9 points and Memphis at 122.8. The Cavaliers have scored eight more points than the Grizzlies in the same number of games.\n\n\r\n              Takeaways\r\n              Grizzlies: Jackson converted a three-point play with 42 seconds left to pull Memphis to 124-121, but missed two free throws on its subsequent possession. The All-Star forward scored 12 points in the fourth.\n\n\r\n              Cavaliers: Mobley matched his career high in assists, falling two shy of his first NBA triple-double, and blocked three shots. The lone blemish on his game was going 1 of 8 on 3-pointers.\n\n\r\n              Key moment\r\n              Mitchell and Desmond Bane became entangled while fighting for a loose ball on the floor with 7:28 left in the third, receiving technical fouls. Morant and Cleveland’s Tristan Thompson were also given technicals for interjecting themselves into the dust-up.\n\n\r\n              Key stat\r\n              The Cavaliers, who lead the NBA with a 39.3 3-point percentage, missed 22 of their first 25 attempts with Mitchell accounting for all of the makes. They finished 13 of 47 beyond the arc.\n\n\r\n              Up next\r\n              The Grizzlies begin a five-game homestand Tuesday night against Phoenix. The Cavaliers are at Orlando on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997723.2472389
}