{
  "game_id": "0022000966",
  "espn_id": "401307769",
  "date": "May 01, 2021",
  "matchup": "LAC vs. DEN",
  "headline": "Denver moves into 3rd in West with 110-104 win over Clippers",
  "body": "LOS ANGELES -- — Denver is missing some key pieces to its backcourt. As long as the Nuggets have Nikola Jokic and Michael Porter Jr., they remain one of the top teams in the Western Conference.\n\n\r\n                    Jokic had 30 points and 14 rebounds, Porter scored 25 points and Denver extended its winning streak to five games with a 110-104 victory over the Los Angeles Clippers on Saturday night to move into the third seed in the West.\n\n\r\n                    “We are winning games. The offense hasn’t been pretty, but it has been a top-five defense as of late,” Nuggets coach Michael Malone said. “Jokic showed once again on the road against a good team why he is the front-runner for MVP. He puts the team on his back. That is what big players do.”\n\n\r\n                    Denver, which is a half-game in front of Los Angeles at 43-21, is 9-1 since Jamal Murray went down with a torn ACL in his left knee on April 12. Murray, who is rehabbing in LA, was at the game.\n\n\r\n                    It is also missing guards Monte Morris and Will Barton — who average a combined 23 points — due to hamstring injuries.\n\n\r\n                    “We wanted to test ourselves and see where we were at with some guys out. It was a big win and we were definitely excited,” said Porter, who is averaging 25.6 points since Murray's injury.\n\n\r\n                    Jokic scored 18 points during the third quarter, including seven straight during a decisive run that would give the Nuggets the lead for the rest of the game.\n\n\r\n                    Los Angeles trailed 52-47 at halftime but Reggie Jackson’s step-back 3-pointer completed a 10-4 run at the start of the third quarter to put the Clippers back on top. On the ensuing trip down the floor, LA lost momentum when Paul George received a flagrant 1 foul with 8:54 remaining in the period for a shoulder block and push to Facundo Campazzo.\n\n\r\n                    A pair of free throws by Campazzo and seven points by Jokic put Denver up 65-57 midway through the quarter. Denver would lead by as many as 11 in the period and went into the fourth up 83-73.\n\n\r\n                    PJ Dozier's pullup jumper gave the Nuggets a 101-91 lead with 3:32 remaining in the game before the Clippers scored seven straight points to make it a one-possession game. After a Denver timeout, DeMarcus Cousins was called for a foul as Jokic was attempting a 3-pointer. Jokic made all three free throws to give the Nuggets breathing room. \n\n\r\n                    Campazzo then added a 3-pointer from the corner to make it 107-98 with 1:08 remaining.\n\n\r\n                    “Porter continues to develop his game and the whole bench has been stepping up and playing well. Everyone is bringing the energy that we need,” Jokic said.\n\n\r\n                    George led the Clippers with 20 points but shot 5 of 21 from the field. Rajon Rondo added a season-high 18 points and Kawhi Leonard, who returned returned to the lineup after missing the last five games due to right foot soreness, scored 16.\n\n\r\n                    Cousins also scored 16 for LA (43-22), which has dropped its last three and had a seven-game home winning streak snapped.\n\n\r\n                    “We couldn't follow the game plan as good as we needed to. Just a lot of small things that we have to continue being detailed about and understand what we are trying to do,” Clippers coach Tyronn Lue said. “I thought Kawhi really eased into it. He didn't play with his normal pace of attacking and getting to the basket. Not playing in nine or 10 games though, that is to be expected.\" \n\n\r\n                    The Clippers started off strong, making their first seven shots from the field to take an 18-7 lead. But Los Angeles' hot shooting didn't continue as it went 10 of 36 the remainder of the first half.\n\n\r\n                    Denver narrowed the margin to one 28-27 at the end of the first quarter and then took its first lead with 10:37 remaining in the second quarter on JaMychal Green's 3-pointer. The game was tied at 36-all before the Nuggets scored eight straight points for their largest lead of the first half.\n\n\r\n                    TIP INS\n\n\r\n                    Nuggets: Denver was 20 of 21 on free throws. ... Dozier added 16 points. ... F Zeke Nnaji was out due to a left ankle sprain.\n\n\r\n                    Clippers: Reggie Jackson scored 15 points, including three 3-pointers. ... This was Leonard’s 65th straight game with at least 15 points, which is the second-longest such streak in franchise history and the longest since Bob McAdoo (224 games, 1973-76). ... Cousins appeared in his 600th career game. ... G Amir Coffey remains in the league's health and safety protocol.\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Remain in Los Angeles to face the Lakers on Monday.\n\n\r\n                    Clippers: Host Toronto on Tuesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997661.766155
}