{
  "game_id": "0022300652",
  "espn_id": "401585280",
  "date": "Jan 28, 2024",
  "matchup": "MEM @ IND",
  "headline": "Bennedict Mathurin scores 24 to lead Pacers over Grizzlies 116-110",
  "body": "INDIANAPOLIS -- — Bennedict Mathurin scored 24 points off the bench, Jalen Smith sank a go-ahead 3-pointer late, and the Indiana Pacers won their third consecutive home game 116-110 over the Memphis Grizzlies on Sunday.\n\n\r\n              The game was tied at 107 when Smith drilled his third 3-pointer with 3:10 remaining. \n\n\r\n              “That was a monster shot for us,” Pacers coach Rick Carlisle said.\n\n\r\n              Smith finished with 19 points and 10 rebounds. The Pacers didn’t trail again.\n\n\r\n              “They made some big-time shots,” Grizzlies coach Taylor Jenkins said. “It was just a little too tough to come back from. Give them credit, they made some good plays at the end.”\n\n\r\n              Mathurin, who scored 19 points in the first half, made 9 of 14 shots including three 3-pointers. He also grabbed seven rebounds.\n\n\r\n              “He (Mathurin) took the pressure off us,” Pacers point guard Andrew Nembhard said. “He was super aggressive going downhill.”\n\n\r\n              Recently acquired All-Star forward Pascal Siakam added 19 for Indiana. Nembhard and Aaron Nesmith each had 16.\n\n\r\n              Jaren Jackson Jr. led the Grizzlies with 25 points. Vince Williams Jr. scored 20, and GG Jackson added 18.\n\n\r\n              “It was a battle to the end,” Jenkins said, “and they came up with the win.”\n\n\r\n              Both teams were without point guards — the Pacers’ All-Star Tyrese Haliburton and backup T.J. McConnell and the Grizzlies’ Luke Kennard. Haliburton is resting a sore hamstring. McConnell sat for personal reasons. Kennard, who played 30 minutes in a home win over Orlando on Friday, had left knee soreness.\n\n\r\n              But Memphis had eight players on the injury report, and that lack of depth became more evident in the third quarter. The Pacers closed the quarter on a 9-2 run for a 92-82 lead entering the fourth quarter. Mathurin threw down a running dunk, Memphis turned it over, and Obi Toppin converted a 3-point play as he was fouled on a finger-roll basket in the final minute.\n\n\r\n              The Grizzlies, who entered on a three-game win streak, led for much of the first half except for when the Pacers went on a 14-0 run in the second quarter. Memphis regrouped and took a 53-51 lead into the break.\n\n\r\n              “In the first half, when we couldn’t get anything going,” Carlisle said, “he (Mathurin) was making the right play every time.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Sacramento on Monday.\n\n\r\n              Pacers: At Boston on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996017.452251
}