{
  "game_id": "0021700443",
  "espn_id": "400975194",
  "date": "Dec 18, 2017",
  "matchup": "MIA @ ATL",
  "headline": "Prince, Schroder lead Hawks to 110-104 win over Heat",
  "body": "ATLANTA --  Hawks coach Mike Budenholzer keeps encouraging Taurean Prince to shoot more often.\n\nThe NBA's worst team needs as much offense as it can get.\n\n\"We're wanting him to shoot a lot -- catch and shoot, shoot whenever he's got daylight, driving and finishing,\" Budenholzer said. \"I think his defense has improved here recently. He's just in a good place. He's playing well.\"\n\nPrince scored 24 points, Dennis Schroder added 23 and Atlanta beat the injury-riddled Miami Heat 110-104 on Monday night.\n\nThe Heat, down to just nine healthy players, were without leading scorer Goran Dragic, forward James Johnson and key reserve Justise Winslow. Miami center Hassan Whiteside missed his 10th straight game with a bruised left knee and 15th overall.\n\nMiami had won four of five and was trying to move two games over .500 for the first time this season. Josh Richardson scored 26 points and Dion Waiters finished with 23.\n\nKent Bazemore had 16 points and five steals for the Hawks, who snapped a four-game skid to improve to 7-23.\n\nIf Budenholzer had a more veteran team, he could work Prince into the game plans more slowly, but the Hawks have struggled so much that the coach needs Prince to step up now.\n\nPrince is averaging 13.2 points per game. Budenholzer believes he can improve on that number by shooting quicker.\n\n\"We're still basketball players, so if somebody runs out super hard, I still have the ability to go to the rack and make plays for others,\" Prince said. \"It's just doing what I do best first and then other stuff afterwards.\"\n\nMiami erased a nine-point deficit midway through the first quarter to take a 40-31 lead early in the third on consecutive baskets by Richardson, but Atlanta used a strong third quarter to go up 90-76 early in the fourth on DeAndre' Bembry's corner 3-pointer.\n\nIt was the first of three 14-point leads for the Hawks, but the Heat pulled within four on Tyler Johnson's dunk, Richardson's runner and Waiters' short jumper. Miami cut the lead to one on Richardson's layup with 1:05 remaining, but Bazemore hit a 16-footer and a layup to make it 106-101.\n\nDragic tried to shoot before the game, but the pain was too much in his strained left elbow. James Johnson didn't make the trip because of bursitis in his right ankle, and Winslow missed his third straight game with a knee injury.\n\nRichardson and Waiters were the only regular starters in the lineup, and Waiters played despite a stomach bug.\n\nMiami went 0 for 11 on 3-point attempts in the second half, but coach Erik Spoelstra was more disappointed with 19 turnovers.\n\n\"We need to be better with the fundamentals, reading schemes and defenses better,\" Spoelstra said. \"We're working at it quite a bit and we just have to get more ownership, more responsibility with the ball.\"\n\nTIP-INS\n\nHeat: Dropped to 0-12 this season when trailing to begin the fourth quarter. ... Health issues are nothing new to Miami. Players on last season's team missed a combined 328 games, most in the NBA, because of injuries. ... Dragic leads the Heat with a 16.6 scoring average and started each of Miami's first 29 games. ... Tyler Johnson replaced Dragic and scored 19 points. It was his first start since 2015-16. ... Bam Adebayo started in James Johnson's spot and had 11 points and a game-high 10 rebounds. ... The Heat plan to bring up rookie guard Matt Williams on a two-way contract from Sioux Falls of the G-League. He will be in uniform Wednesday when Miami visits Boston. ... Derrick Walton Jr., formerly of Sioux Falls, played seven minutes. ... Udonis Haslem played one minute.\n\nHawks: Ersan Ilyasova had 13 points and Malcolm Delaney added 11. ... Rookie F Tyler Cavanaugh signed a multi-year contract earlier in the day but Budenholzer kept him on the bench all night. Cavanaugh has averaged 5.5 points and 3.2 rebounds in 19 games since signing a two-way contract on Nov. 5.\n\nUP NEXT\n\nHeat: Visit the Boston Celtics on Wednesday.\n\nHawks: Host the Indiana Pacers on Wednesday.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993563.528955
}