{
  "game_id": "0021600502",
  "espn_id": "400899944",
  "date": "Dec 31, 2016",
  "matchup": "MEM @ SAC",
  "headline": "Conley scores 22 to lead Memphis past Kings 112-98",
  "body": "SACRAMENTO, Calif. --  Marc Gasol tweaked his ankle in the third quarter, and that was it for the night.\n\nNo big deal for the Memphis Grizzlies, who are used to losing key players to injuries.\n\nMike Conley had 22 points and eight rebounds, leading the Grizzlies to a 112-98 victory over the Kings on Saturday.\n\nConley and Gasol each missed significant chunks of last season, part of a long list of injuries for Memphis, but the Grizzlies still made the playoffs. They showed off their resiliency again while avenging an earlier home loss to the Kings.\n\nAn ineffective Gasol, who had two points and two rebounds, got tangled up with DeMarcus Cousins. The injury is not considered serious.\n\n\"We have a mental mindset, an old-school mentality,\" Conley said. \"We have a toughness that feeds off one another. It's not about one person (on this team). It's about the group.\"\n\nJaMychal Green made four of Memphis' 17 3-pointers and finished with 18 points. Zach Randolph and Vince Carter each scored 14, and Tony Allen and Troy Daniels had 11 points apiece.\n\nThe Grizzlies went 17 for 35 from long range in their second straight win.\n\n\"Offense was not our problem. We can't give up that many points to a team that averages 95 points per game,\" Sacramento's Garrett Temple said. \"We just can't give up that many 3s and allow them to shoot that well from behind the 3-point line on top of giving up offensive rebounds.\"\n\nCousins had 26 points, eight assists and five steals for Sacramento, which has dropped two in a row after winning a season-high four straight. But Cousins was 7 for 18 from the field and had just four rebounds. He also got called for his eighth technical this season in the third quarter.\n\n\"You know that makes me happy when I see us getting after it like that (on defense),\" Memphis coach David Fizdale said. \"We were really connected, working with our voices. Guys were backing each other up when there was a breakdown. I thought our leadership was great tonight.\"\n\nMatt Barnes made five 3-pointers and scored 20 points for the Kings, and Anthony Tolliver and Darren Collison each had 16 points.\n\nConley sparked the Grizzlies in the third, scoring 11 points. Memphis used 11 unanswered points to outscore the Kings 32-22 in the quarter and carried an 82-67 lead into the final period.\n\n\"They were a very focused group tonight, and came out and just dominated the game from start to finish,\" said Kings coach Dave Joerger, who was the head coach at Memphis the previous three seasons. \"There was a five-minute stretch where we made a little run in the second quarter, but by-and-large they just lined up and beat us position by position.\"\n\nIFFY GASOL\n\nEven before the injury, it was a difficult game for Gasol. He went 0 for 6 from the field and connected on two free throws late in the second quarter for his only points of the game.\n\nGasol rolled his ankle going for a loose ball in the third and quickly departed for the locker room. It was diagnosed as a sprained ankle and X-rays were negative.\n\n\"It hurts, but it's not broken,\" Gasol said. \"It's tender right now so we will take it day to day just like always.\"\n\nTIP-INS\n\nGrizzlies: Green closed the third with the final eight points for Memphis, including a pair of 3s. ... Memphis' four-game road trip ends Friday at Golden State. ... The Grizzlies improved to 9-7 on the road.\n\nKings: Former Grizzlies F Rudy Gay sat out for the eighth time in nine games with a hip flexor injury. ... The Kings begin a seven-game homestand Wednesday against Miami. ... Reserve PG Ty Lawson left in the second quarter after taking a blow to the nose.\n\nUP NEXT\n\nGrizzlies: A rough West Coast trip continues for Memphis, which faces the Lakers on Tuesday night.\n\nKings: Travel to Denver for Tuesday's game against the Nuggets, who are coached by former Kings head coach Michael Malone.",
  "source": "espn_api",
  "crawled_at": 1764995607.51159
}