{
  "game_id": "0022300384",
  "espn_id": "401585012",
  "date": "Dec 22, 2023",
  "matchup": "ATL @ MIA",
  "headline": "Herro, Robinson help Heat stave off Young and the Hawks, 122-113",
  "body": "MIAMI -- — Trae Young made some history. So did Duncan Robinson, and that was the difference for Miami.\n\n\r\n              Tyler Herro scored 30 points, Robinson had 21 of his 27 points in the fourth quarter and the Heat withstood another big night from Young on the way to a 122-113 win over the Atlanta Hawks on Friday night.\n\n\r\n              Robinson tied the most points he ever scored in a quarter; he also had 21 in the second quarter of a Heat win over Cleveland on Nov. 20, 2019.\n\n\r\n              “It shows you how much he's improved all across the board,” Heat coach Erik Spoelstra said.\n\n\r\n              Young finished with 30 points and 13 assists for the Hawks — his sixth consecutive game with at least 30 points and 10 assists. That ties the second-longest such streak in NBA history, one that only Oscar Robertson has topped.\n\n\r\n              Robertson had such a streak twice — a six-game stretch in January 1964, then a seven-game stretch spanning December 1964 to January 1965. The only other players with a five-game streak of 30 points and 10 assists: Tiny Archibald in 1973, Michael Jordan in 1989 and Russell Westbrook in 2017.\n\n\r\n              “You want that, to be held to a high standard,” Hawks coach Quin Snyder said. “That's what I'm trying to do. That's the standard he holds himself to.”\n\n\r\n              Jaime Jaquez Jr. scored 19 points and Bam Adebayo finished with 18 points, 11 rebounds and six assists for the Heat, who were down by 11 early in the third quarter before rallying.\n\n\r\n              Robinson scored 11 consecutive Miami points in the fourth, a stretch that ended when Herro hit a 3-pointer that put the Heat up 104-96 with 6:48 left.\n\n\r\n              “They've got a lot of guys who can play and they've got a system they can play,” Young said.\n\n\r\n              Dejounte Murray scored 24 points and Bogdan Bogdanovic scored 20 of his 23 in the first half for the Hawks. Atlanta is 11-2 when scoring at least 123 points and is now 1-14 when it doesn’t score that many.\n\n\r\n              Bogdanovic had at least 20 points off the bench for the sixth consecutive game, the NBA’s longest run by a reserve since Herro did it in seven consecutive games for Miami during the 2021-22 season.\n\n\r\n              Miami typically does as good a defensive job against Young as anyone. He entered Friday averaging 20.5 points and 7.9 assists on 39% shooting in 24 career games against Miami. Only Dallas has held him to fewer points per game, only Utah has held him to fewer assists per game, and only Charlotte and the Jazz have held him to a lower field-goal percentage.\n\n\r\n              Young shot 10 for 22 and 7 of 13 from 3-point range on Friday. He had 16 of his 30 in the fourth.\n\n\r\n              “For us, it was just making him see different coverages,” Adebayo said.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Memphis on Saturday.\n\n\r\n              Heat: Host Philadelphia on Monday, the fourth game on the NBA’s five-game Christmas schedule.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996299.2433898
}