{
  "game_id": "0022000800",
  "espn_id": "401307593",
  "date": "Apr 10, 2021",
  "matchup": "LAL @ BKN",
  "headline": "Lakers pull away after ejections, rout Nets 126-101",
  "body": "NEW YORK -- — Dennis Schroder helped send a Lakers team missing LeBron James and Anthony Davis off to a sizzling start.\n\n\r\n                    And after Schroder was thrown out along with Kyrie Irving in the third quarter, the defending champions really turned it on.\n\n\r\n                    Andre Drummond had 20 points and 11 rebounds, Schroder scored 19 points before he and Irving were ejected and the Lakers beat the Brooklyn Nets 126-101 on Saturday night.\n\n\r\n                    “Today we were out here competing, making shots and, yeah, that’s the best win of the year I would say,” Schroder said.\n\n\r\n                    A nationally televised matchup already missing plenty of star power lost even more when Irving started jawing with Schroder and neither player stopped quickly enough for the officials.\n\n\r\n                    The Lakers had led most of the way and were ahead 66-62 when Irving fouled Schroder with 9:41 left in the third. Los Angeles blew it open soon after the ejections with a 15-2 burst to open an 88-71 lead.\n\n\r\n                    A potential NBA Finals preview had a preseason feel with so many top names unavailable. James (right ankle sprain) and Davis (right calf strain) remain out for the Lakers, while James Harden is sidelined with a strained right hamstring for the Nets.\n\n\r\n                    The Lakers handled being short-handed much better, putting eight players in double figures. Ben McLemore, in his second game with Los Angeles, scored 17.\n\n\r\n                    “I learned a lot from today’s game, that we have a lot of guys in this locker room that are very tough,” Drummond said. “Despite who’s on the other side of the court, they’re going to come out and play.”\n\n\r\n                    Kevin Durant scored 22 points in his second game back following a 23-game absence with his own hamstring injury. Irving added 18, but the Nets had their nine-game home winning streak snapped. \n\n\r\n                    Besides James and Davis, who were sitting on the bench, the Lakers were also without Kyle Kuzma (left calf strain), Marc Gasol (left hamstring tightness) and Wesley Matthews (right Achilles tendon tightness).\n\n\r\n                    “I thought they were the aggressor, they were more physical, they hit first and we didn’t match their physicality and competitive fire, and that’s what you get,” Nets coach Steve Nash said. “A team missing a bunch of guys and guys get an opportunity and their eyes light up and they come out and play harder than us, play more physical than us. \n\n\r\n                    \"And it’s a great lesson for us.”\n\n\r\n                    The Lakers have fallen to fifth in the Western Conference during James’ 11-game absence, while the Nets entered play leading the East. Both teams have upgraded from the buyout market in hopes of deep playoff runs, with the Lakers adding Drummond and Brooklyn signing LaMarcus Aldridge and Blake Griffin. \n\n\r\n                    The defending champions' defense sure looked playoff ready, holding the NBA's highest-scoring team 18 points below its season average. And they showed off some postseason physicality, with Markieff Morris getting a flagrant foul in the first half for elbowing Irving.\n\n\r\n                    The Lakers also had their offense rolling early, starting 7 for 8 to build an 18-7 lead. Schroder made his first six shots for 16 points.\n\n\r\n                    “They hit us in the mouth early and then we were fighting uphill all game,” Durant said.\n\n\r\n                    The Nets bounced back by shooting 63% in the second quarter, cutting it to 61-58 at halftime.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Coach Frank Vogel said the Lakers had been hoping Kuzma would return for the game, but the medical team wanted to hold him out another game. The hope is he will play Monday at New York. ... Davis shot around before the game.\n\n\r\n                    Nets: Nash said the plan was for G Spencer Dinwiddie, away from the Nets rehabbing a torn ACL, to rejoin his teammates when he was further along with the process, though he didn't know if that would be before the playoffs. ... The Nets last won 10 in a row at home as part of franchise-record streak of 15 straight from Feb. 3 to April 4, 2014. \n\n\r\n                    MORE MINUTES\n\n\r\n                    Vogel said Gasol's hamstring problem started after he had to play extended minutes against Toronto on Wednesday after Montrezl Harrell was ejected after 2 1/2 minutes. Kuzma had also been carrying a heavier load lately with James and Davis out.\n\n\r\n                    “We feel like those guys have been given minutes that they can reasonably play, but we’ve had a couple of flareups,” Vogel said. “It’s part of asking guys to play bigger roles than they’re used to.” \n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Visit the New York Knicks on Monday.\n\n\r\n                    Nets: Visit Minnesota on Monday.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764997289.9811
}