{
  "game_id": "0021900690",
  "espn_id": "401161332",
  "date": "Jan 26, 2020",
  "matchup": "MEM vs. PHX",
  "headline": "Morant has late burst, Grizzlies hold off Suns 114-109",
  "body": "MEMPHIS, Tenn. --  The night in Memphis started with a moment of silence for Kobe Bryant. It ended with players from both sides remembering the Los Angeles Lakers great for the good he brought to the game.\n\nAs for the game itself, Ja Morant scored 14 of his 23 points in the fourth quarter to help the Memphis Grizzlies hold off the Phoenix Suns 114-109 on Sunday night for their second straight victory.\n\nPlaying hours after news that Bryant was killed in a helicopter accident, the Grizzlies won the opening tip and immediately took a 24-second shot clock violation. When the Suns took possession, they stayed in the backcourt for an 8-second violation -- the 24 and 8 representing Bryant's two numbers during his NBA career. As the Memphis crowd rose in appreciation of Bryant, they began chanting \"Kobe! Kobe!\"\n\n\"We were going out and trying to find some energy tonight to go out and compete and get a win,\" Morant said about playing in the somber atmosphere. \"It's a tough night for everybody.\"\n\nJaren Jackson Jr. and Dillon Brooks finished with 20 points each for Memphis. Kyle Anderson, who had a season-high 12 rebounds, made a two free throws with 11.3 seconds left.\n\nDevin Booker led the Suns with 36 points, Kelly Oubre Jr. added 27 points, and Deandre Ayton finished with 17 points and 15 rebounds. Phoenix lost for the third time in four games.\n\n\"There's no script for a day like today. A lot of guys were playing with a heaviness and to be able to compete on a day like this is difficult,\" Suns coach Monty Williams said, keeping his comments primarily on the loss of Bryant instead of the game.\n\nMemphis coach Taylor Jenkins called the game \"a gutsy win by our guys,\" but he also kept the bulk of his postgame comments on the loss of Bryant. \"Just the ultimate competitor,\" Jenkins said. \"Everyone is talking about that. I think he touches so many people with that drive, whether you were with him as a teammate, on staff, or you competed against him night in and night out. He set a tone.\"\n\nMemphis built the lead to double digits, reaching 14 with just under five minutes- to play in the third quarter. The Suns put on a burst at the close of the period, pulling to 79-78 with a 17-4 run as the Grizzlies struggled to hold on to the ball, committing nine turnovers in the quarter.\n\nBut Morant took over the fourth. In the final 4:06, with the Suns continuing to threaten the Memphis lead, Morant scored eight of 10 Memphis points and the only one where he didn't, he assisted on an alley-oop to Brandon Clarke.\n\nThe Suns trailed by a single point on several occasions down the stretch and tied the game twice but could never overtake the Grizzlies, Memphis scoring the games final four points at the free throw line.\n\n\"This is a bad day, obviously, but we just got to continue to move forward,\" Oubre said.\n\nTIP-INS\n\nSuns: Played without C Aron Baynes (left hip soreness), F Cameron Johnson and C/F Frank Kaminsky III (right patella stress fracture). . Played the second of a three-game trip. . Booker missed a free throw in the third quarter, ending a string of 39 straight made. . Rubio was 1 of 10 from the field.\n\nGrizzlies: Starting F Jae Crowder missed the game with right knee soreness. Anderson started in his place. .Morant reached double digit in the fourth quarter for the 13th time this season and fifth in the last eight games. .Outscored the Suns in the paint 66-38, marking the 17th time the Grizzlies have reached at least 60 points in the paint this season.\n\nFINAL WORD\n\n\"It's hard. They are thinking about something that's way more important than a basketball game. You are sitting there trying to coach and sometimes you ask yourself, `what are you doing?' Before the game, I just repeatedly told them how much I loved them and had them tell that to each other, their family, whoever it is.\" -- Williams about his players dealing with the news of Bryant's death only hours before the game.\n\nUP NEXT\n\nSuns:. At Dallas on Tuesday night.\n\nGrizzlies: Host Denver on Tuesday night.\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995708.3187141
}