{
  "game_id": "401810095",
  "espn_id": "401810095",
  "date": "Nov 16, 2025",
  "matchup": "UTAH vs CHI",
  "headline": "George makes late 3 in 2OT, Markkanen scores 47 as Jazz beat Bulls 150-147",
  "body": "SALT LAKE CITY -- — Keyonte George made 3-pointer with 2 seconds remaining in the second overtime, Lauri Markkanen scored 47 points and the Utah Jazz beat the Chicago Bulls 150-147 on Sunday night in the NBA's highest-scoring game of the season.\n\n\r\n              George finished with 32 points — including six in the second OT. Isaiah Collier and Brice Sensabaugh each had 16 points, and Kevin Love and Svi Mykhaiuluk each added 10 as the Jazz won for the second time in three games after losing six of seven.\n\n\r\n              Coby White scored 27 points and Josh Giddey had 26 points, 12 rebounds and 13 assists for the Bulls, who have lost five straight. Nikola Vučević had 21 points, Matas Buzelis and Ayo Dosunmu each scored 18 and Julian Phillips 10.\n\n\r\n              White, who's layup with 0.2 seconds left in the first OT tied the score at 136, made two free throws with 8.4 seconds to go in the second OT to tie it at 147. After George's go-ahead 3, Vučević missed a potential tying basket at the buzzer.\n\n\r\n              Utah led 136-132 in the final minute of the first OT, before Buzelis had a dunk with 27 seconds to go and White made his tying layup to send it to a second OT.\n\n\r\n              The Jazz trailed by seven early in the fourth quarter before using an 8-0 run to take a 102-101 lead on Sensabaugh's 3 with 9:23 remaining. Collier followed with a layup to push the lead to three less than 30 seconds later.\n\n\r\n              Jalen Smith's 3 tied the score with 8:41 to go, and there were several lead changes and seven ties the rest of the quarter. Markkanen, who had 12 points in the fourth, hit a free throw with 19 seconds remaining, to tie it at 127.\n\n\r\n              Markkanen had 13 points in the third quarter to help Utah cut Chicago's nine-point halftime lead to 98-94 heading to the fourth.\n\n\r\n              Giddey and White each scored 12 points to help the Bulls take a 70-61 lead at halftime. Markkanen had 18 points to lead the Jazz.\n\n\r\n              Up next\r\n              Bulls play at Denver on Monday night, and Jazz visit the Los Angeles Lakers on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042639.715521
}