{
  "game_id": "401809970",
  "espn_id": "401809970",
  "date": "Oct 27, 2025",
  "matchup": "CHI vs ATL",
  "headline": "Dosunmu scores 21 points to lead Bulls to 128-123 win over Hawks",
  "body": "CHICAGO -- — Ayo Dosunmu scored 21 points, Josh Giddey had 18 points and 13 rebounds and the Chicago Bulls rallied to top the Atlanta Hawks 128-123 on Monday night.\n\n\r\n              Nikola Vucevic had 17 points and 17 rebounds as Chicago came back from an early 13-point deficit to improved to 3-0, its best start in four years.\n\n\r\n              Kristaps Porzingis scored 27 points and Jalen Johnson added 25 in their return to the the Hawks lineup, but Atlanta dropped its second straight and the first of a four game trip to fall to 1-3.\n\n\r\n              Trae Young had 21 points and 17 assists, including some flashy setups. Onyeka Okongwu added 18 points and 10 rebounds.\n\n\r\n              Eight Chicago players, including all five starers, reached double figures in scoring. Matas Buzelis had 16 points and Tre Jones added 14 with nine assists.\n\n\r\n              Buzelis hit a 3 with with 2:30 left to put Chicago ahead 121-118, and Kevin Huerter upped it to a five-point lead on a running layup off Vucevic's steal 13 seconds later. Giddey iced it with a pair of free throw with 7.7 seconds left.\n\n\r\n              Chicago trailed 58-57 at the half. The Bulls changed the tone of the game with a high-tempo third quarter when they outscored Atlanta 41-34 and extended their lead to as much as 11 points. \n\n\r\n              Then the Hawks replied with a 9-2 run to open the fourth quarter and jump ahead 101-100. That set up a back-and forth finish in game with 15 lead changes.\n\n\r\n              Porzingis had missed two games with flu-like symptoms and Johnson missed one with an ankle sprain. They were joined in Atlanta’s starting linup by Zaccharie Risacher, who had missed two games with an ankle sprain.\n\n\r\n              The Bulls took a 60-58 lead 24 seconds into the third on Isaac Okoro's 3 pointer to start the scoring flurry in the quarter.\n\n\r\n              Porzingis scored his first 10 points in the opening 3:58.\n\n\r\n              Up next\r\n              Hawks: At Brooklyn on Wednesday.\n\n\r\n              Bulls: Host Sacramento on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042511.438234
}