{
  "game_id": "0022000626",
  "espn_id": "401307412",
  "date": "Mar 18, 2021",
  "matchup": "ATL vs. OKC",
  "headline": "Young, Bogdanovic each score 23, Hawks win seventh straight",
  "body": "ATLANTA -- — Trae Young and Bogdan Bogdanovic each scored 23 points, fueling the Atlanta Hawks to their seventh straight victory, 116-93 over the Oklahoma City Thunder on Thursday night.\n\n\r\n                    The Hawks have put together their winning streak since Nate McMillan took charge as interim coach and have won seven in a row for the first time since Dec. 28, 2016, to Jan. 10, 2017. \n\n\r\n                    “It feels great,\" Young said. “Any time you’re winning, everything else feels good. For me, all I care about is winning and we’re doing that right now. Nothing can be better.\"\n\n\r\n                    The Hawks took their biggest lead at 27 points late in the third quarter on Bogdanovic’s 3-pointer and never let the Thunder get closer than 17 points in the second half. Bogdanovic, who played 29 minutes in a reserve role, scored a season high. \n\n\r\n                    Atlanta led 61-41 halftime behind 17 points from Young, who went 6 for 8 from the field in the first two quarters. He hit a pair of free throws late in the second to give the Hawks their first 20-point lead. Thunder starters Shai Gilgeous-Alexander and Al Horford were a combined 3 for 18 in the first half.\n\n\r\n                    Young did not play in the fourth quarter as McMillan went with Rajon Rondo to give the team’s leading scorer some extra rest.\n\n\r\n                    The Hawks took their first double-digit lead at 17-6 on Tony Snell’s baseline jumper midway through the first. Young and Bogdanovic each hit 3s to close an 18-2 run to make it 25-8 at the 4:04 mark.\n\n\r\n                    “We’re starting to put some things together,\" McMillan said. “Understand time, score and situations in the fourth quarter. We’re doing a better job of finishing games. That’s what it’s going to take. \n\n\r\n                    \"You’ve got to be able to make stops and put the ball in the basket. We’ve been able to do that the last few games, but we’re going to have be better. Everybody’s looking at the standings now. We’re going to see everybody’s best basketball in this second half, so we’re going to have to continue to improve.\"\n\n\r\n                    John Collins finished with 15 points for Atlanta, which outrebounded the Thunder 47-36 and shot 54.8% from the field, 17.7% better than Oklahoma City.\n\n\r\n                    Gilgeous-Alexander had 19 points as he found his shooting touch in the second half.\n\n\r\n                    “I think the shots were pretty similar,\" Thunder coach Mark Daigneault said. “I think he's done a good job this year of working himself through different things. He's a really good player. He's got high expectations for himself. He's a borderline perfectionist, and he's done a great job this year of rolling with the punches and weathering the storms.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Lu Dort (left big toe sprain) started and Theo Maladon (left thumb sprain) played 22 minutes in a reserve role after being listed as questionable before the game. Dort finished with eight points and Maladon had 10. ... G Svi Mykhailiuk, acquired in a trade with Detroit last week, made his debut with Oklahoma City and went scoreless in 10 minutes. ... Darius Bazley (left shoulder contusion) is healing slower than anticipated. Daigneault said Bazley is now “a week-to-week thing” rather than the day-to-day status he first received. Bazley has pain in his shoulder and hasn’t responded quickly to treatment. ... G George Hill is still wearing a cast (right thumb procedure) and is not close to returning. \n\n\r\n                    Hawks: C Clint Capela had eight points and eight rebounds in his return from a two-game absence with left heel pain. Both he and Onyeka Okongwu (right adductor strain) were questionable before the game. Okongwu entered the game in the closing minutes. .... F De’Andre Hunter (right knee surgery) practiced in at full capacity on Wednesday and hopes to return when the Hawks begin an eight-game road trip that begins Saturday. ... G Kris Dunn, out the entire season after undergoing right ankle surgery, is getting closer to a return and could make his Atlanta debut on the road trip. ... F Cam Reddish (right Achilles soreness) has yet to resume basketball activities. \n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Visit Houston on Sunday and Minnesota on Monday.\n\n\r\n                    Hawks: Visit the Los Angeles Lakers on Saturday and the Clippers on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997638.166156
}