{
  "game_id": "0021800522",
  "espn_id": "401071198",
  "date": "Dec 28, 2018",
  "matchup": "ATL @ MIN",
  "headline": "Bazemore scores 23 as Hawks beat Wolves 123-120 in OT",
  "body": "MINNEAPOLIS --  With the Hawks' momentum gone and a noisy sellout crowd cheering the Timberwolves, first-year Atlanta coach Lloyd Pierce made a bold prediction.\n\n\"I told our guys at the end of the third quarter, `This is going to be our best win of the season,\" Pierce said.\n\nIt certainly wasn't their prettiest with 24 turnovers, but the Hawks made just enough hustle plays to overcome blowing a 22-point lead and beat Minnesota 123-120 in overtime Friday night.\n\nKent Bazemore scored 23 points and John Collins added 21 to back up Pierce's boast.\n\n\"It definitely shows you he has confidence in what we're capable of,\" said Dewayne Dedmon, who made two big foul shots with 1.7 seconds left to preserve the win. \"Just hearing that made us just turn up a little bit and keep fighting.\"\n\nTrae Young and Kevin Huerter each had big 3-pointers in the final minutes of overtime, and the Hawks earned their fifth road win despite matching their season high in turnovers.\n\n\"We're a young team and we like to play fast,\" Bazemore said. \"With all the inexperience out there and playing fast, it's kind of a bad combo for taking care of the ball. But, you know, Coach . doesn't tell guys to be less of themselves. He wants everyone to be aggressive.\"\n\nThe Timberwolves were done in by missed free throws, dunks and layups.\n\nAfter Huerter's 3 made it 121-117, Karl-Anthony Towns made two free throws before Andrew Wiggins went to the line for two shots with 4.5 seconds left. After missing two big free throws a few seconds earlier, Wiggins hit the first but missed his second.\n\nDedmon hit his two foul shots with 1.7 seconds left. Rookie Josh Okogie pumped faked DeAndre Bembry and tried to draw contact from the corner, but his 3-point attempt fell short without a whistle.\n\nBazemore sent it to overtime with a fast-break layup after stealing an inbounds pass with 20 seconds left to play. Justin Anderson blocked Derrick Rose's buzzer-beater attempt as time expired.\n\nMINNESOTA MISCUES\n\nThe Wolves were out of sorts from the start; Wiggins forgot to put his jersey on underneath his warmups, and things went downhill in a hurry.\n\nTowns led the Wolves with 31 points and 19 rebounds. Robert Covington had 28 points but missed a dunk late in regulation and, in overtime, lost the ball on a wide-open layup underneath the basket. Young followed by hitting a 3 to give Atlanta a 118-117 lead with 1:49 to play.\n\nThe Timberwolves erased a 22-point deficit after Atlanta silenced the home crowd early with a season-high 42 first-quarter points. The Wolves held the Hawks to 47 total over the next two quarters.\n\n\"We came out the second half and played with the edge we should have for all 48,\" Towns said. \"We put ourselves in that position. We dug ourselves out of a tremendous hole. We just didn't close it out.\"\n\nMinnesota went 21 of 38 from the free throw line.\n\n\"It happens, \"Wiggins said. \"It's one of those days and one of those games.\"\n\nWIGGINS' FREE-THROW WOES\n\nWiggins, a career 74 percent free-throw shooter, was Minnesota's biggest offender from the stripe. He went 5 of 12 and heard frustrated boos from the home crowd.\n\n\"That's fans for you. We've got some (expletive) fans and we've got some good fans. That's just how it works,\" he said.\n\nROSE UPDATE\n\nRose scored 25 points but sprained his right ankle late. He started again for PG Jeff Teague, who missed his sixth straight game with inflammation in his left ankle.\n\nTALKING BASKETBALL\n\nLynx star Rebekkah Brunson will be part of the Timberwolves' broadcast team this season. She'll do 10 upcoming games either as a second analyst during the game or work on the pregame show. Brunson's in-game debut will be on Jan. 2 when Minnesota visits Boston. Former Lynx player Lindsay Whalen did eight broadcasts last season.\n\nTIP-INS\n\nHawks: Bazemore has scored 20 points in five of his last eight games. ... Alex Poythress scored 12 points in his third game since being called up from the G League. All of his points came in the first quarter. ... It was only the second time this season Atlanta has held a 20-point lead; the Hawks won the first game on Oct. 21 at Cleveland.\n\nTimberwolves: Rookie Keita Bates-Diop was active for the game for the first time since being recalled Dec. 22 from Iowa of the G League. \"He'll be back with us for a while now, and then when we have another opportunity to send him down we will. But he's coming along very nicely,\" coach Tom Thibodeau said.\n\nUP NEXT\n\nHawks: Host Cleveland on Saturday night.\n\nTimberwolves: Visit Miami on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995367.2276301
}