{
  "game_id": "0021600443",
  "espn_id": "400899885",
  "date": "Dec 23, 2016",
  "matchup": "LAL @ ORL",
  "headline": "Magic hand Lakers 12th loss in 13 games",
  "body": "ORLANDO, Fla. -- Most NBA games are decided in the last few minutes. The Orlando Magic's 109-90 victory over the Los Angeles Lakers on Friday night may have been decided in the first few minutes.\nThe Magic blocked eight of Los Angeles' first 16 shots and took a 10-point lead before the Lakers scored.\n\"That first quarter defensively set the tone for the whole game,\" Magic coach Frank Vogel said. \"It's not easy playing ahead in this league with the way teams are coming after you, but it's probably a lot easier than playing from behind. We've been in that situation a lot, when we're climbing uphill.\"\nThis time it was the Lakers trying to climb back and they never made it, losing for the 12th time in 13 games in the conclusion of a seven-game trip.\nThe Magic blocked nine shots in the first quarter, a franchise record for a quarter.\n\"We've been playing good basketball offensively, but defensively not so good,\" said Bismack Biyombo, who had three of the blocks. \"We've got to get back to establish ourselves as a defensive team, and I think tonight we did a better job than last night (in a loss at New York).\"\nElfrid Payton had 25 points and nine assists, and the Magic shot 51 percent.\n\"We went with the game plan, but guys were just making shots,\" said Jordan Clarkson, who led the Lakers with 18 points. \"He (Payton) got hot and made shots that we wanted him to take.\"\nSerge Ibaka contributed 19 points, 11 rebounds and five of Orlando's 11 blocks.\nD.J. Augustin made two 3-pointers and a layup while the Magic blocked five of the Lakers' first seven shots, taking a 10-0 lead before Nick Young got the Lakers on the board with 6:51 left in the first quarter.\nOrlando ran off to a 25-point lead in the first half and led 57-40 at halftime.\nClarkson made three 3-pointers and a dunk during a 16-2 run that helped the Lakers get within six, at 88-82, early in the fourth quarter. But C.J. Watson scored seven of 13 straight Orlando points to help the Magic put the game away.\n\"The problem when you get down big is that it takes a lot of energy to get back in it,\" said Lakes coach Luke Walton. \"Guys are dying out there, and we go to the bench and start playing guys that aren't used to playing.\"\nMEEKS GETS FIRST MAGIC START\nJodie Meeks had nine points and five rebounds in his first start for the Magic against his former team. Meeks played in 155 games over two seasons with the Lakers, averaging a career-high 15.7 points in 2013-2014.\nHOME NOT SO SWEET\nFriday night's win was only the third for the Magic in their last 10 home games. \"It's baffling that we haven't won more at home, but I think that will iron itself out as the season goes along. I think we'll finish with a plus-.500 record,\" predicted Vogel. \"I think it's some early-season struggle that we'll get past.\"\nTIP-INS\nLakers: F Julius Randle missed the game, having attended the birth of son Kyden in Los Angeles on Friday morning. . . . C Tarik Black (sprained right ankle) and G Jose Calderon (strained right hamstring) did not play, but both expect to play soon.\nMagic: G Evan Fournier, the Magic's leading scorer at 17.8 points per game, missed his first game of the season with a right heel contusion.\nUP NEXT\nLakers: Sunday night's game against the Clippers will be the Lakers' first home game in two weeks. They will play 11 of their next 14 at home.\nMagic: Monday's home game against Memphis will be a rematch of a 95-94 loss on Dec. 1 in which the Magic blew a 14-point lead in the fourth quarter.",
  "source": "espn_api",
  "crawled_at": 1764995417.220803
}