{
  "game_id": "0022400113",
  "espn_id": "401704679",
  "date": "Oct 29, 2024",
  "matchup": "BKN vs. DEN",
  "headline": "Jokic has 29 points, 18 rebounds and 16 assists to lead Nuggets past Nets 144-139 in OT",
  "body": "NEW YORK -- — Nikola Jokic had 29 points, 18 rebounds and 16 assists, becoming only the second player in NBA history to reach those totals in a game, and the Denver Nuggets beat the Brooklyn Nets 144-139 in overtime on Tuesday night.\n\n\r\n              Jamal Murray and Aaron Gordon each scored 24 points for the Nuggets, while Russell Westbrook added 22.\n\n\r\n              Dennis Schroder scored 28 points for Brooklyn, which led by 17 in the second quarter. Cam Thomas scored 26 and Cam Johnson had 20. Nic Claxton added 16 points and 12 rebounds. \n\n\r\n              Thomas gave the Nets a 127-125 lead with the first basket of overtime, but the Nuggets scored the next eight points and led the rest of the way. \n\n\r\n              Takeaways\r\n              Nuggets: Denver has beaten the Nets four straight times. Jokic has two triple-doubles in the Nuggets’ first four games and has scored at least 40 twice, with neither of those outbursts occurring within the triple-doubles.\n\n\r\n              Nets: The Nets had season highs of 40 points in the first quarter and 72 points in the first half. They played without Ben Simmons, who missed his first game of the season due to lower back injury management.\n\n\r\n              Key moment\r\n              The Nets led by one when Dorian Finney-Smith went to the foul line with 24 seconds remaining in the fourth quarter. He only made one of two, allowing Jokic’s inside bucket to tie the score with 8.8 seconds remaining. Finney-Smith then missed an open 3-pointer from the corner at the buzzer, sending the game into overtime.\n\n\r\n              Key stat\r\n              Hall of Famer Oscar Robertson, who did it twice, is the only other player to have at least 29 points, 18 rebounds and 16 assists in a game. \n\n\r\n              Up next\r\n              The Nets visit Memphis on Wednesday and the Nuggets head to Minnesota on Friday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998009.6856441
}