{
  "game_id": "0021600257",
  "espn_id": "400899707",
  "date": "Nov 28, 2016",
  "matchup": "CHA @ MEM",
  "headline": "Walker and Lamb lead Hornets past Grizzlies, 104-85",
  "body": "MEMPHIS, Tenn. --  Charlotte reserve center Spencer Hawes walked by the lockers of Hornets guards Kemba Walker and Jeremy Lamb with words of praise.\n\n\"Way to play, Huskies,\" Hawes said.\n\nThe UConn duo of Walker and Lamb scored 21 points apiece, helping Charlotte build an early lead and coast to a 104-85 victory Monday night over the Memphis Grizzlies.\n\nLamb provided a boost in the first half with a pair of 3-pointers off the bench to erase an early Memphis advantage, and Walker added steady scoring throughout the night. They were a combined 14 of 25 from the field, including 7 for 13 on 3-point attempts.\n\n\"I just tried to bring energy. When you're coming off the bench, you always want to bring energy,\" Lamb said.\n\nMichael Kidd-Gilchrist had 14 points and Frank Kaminsky added 12 for the Hornets, who won their second straight after a four-game losing streak.\n\nMarc Gasol led Memphis with 19 points and eight rebounds. Mike Conley had 14 points before leaving in the third quarter with a lower back injury.\n\n\"I was feeling like today was a day we could come in here and get a home win,\" said Memphis guard Tony Allen, who had nine points and two steals. \"This was a winnable game, and it took me by surprise.\"\n\nThe largest scoring discrepancy in the game was at the free throw line, where the Hornets converted 23 of 31. Meanwhile, Memphis was 6 of 13, a difference that agitated the Grizzlies much of the night.\n\nCharlotte, which already led by 19 in the first half, extended the lead in the third quarter as Memphis became unhinged complaining about calls and relying -- mostly unsuccessfully -- on 3-pointers to try to get back in the game.\n\nAnd when Conley went to the locker room, it led to more disorganized play from Memphis.\n\n\"That hurt them a lot. He just brings so much for their team. He's their leader,\" Walker said.\n\nTIP-INS\n\nHornets: G Nicolas Batum, who missed Saturday's win over the Knicks with a corneal abrasion, returned to action and started. He finished with six points. ... After committing five turnovers in the first quarter, the Hornets had nine more the rest of the way. Charlotte has the second-lowest turnover average in the NBA at 11.6 per game.\n\nGrizzlies: Their 14 points in the second quarter was a season low in that period for Memphis, and a season low for any quarter except nine points in the fourth against New Orleans in the fifth game of the season. ... Gasol had a four-point play near the midway point of the fourth. ... F Jarell Martin posted his first career double-double with 11 points and 12 rebounds.\n\nLAMB NOT SILENT\n\nLamb set a season high in points for the second straight game. He had 18 against the Knicks on Saturday. In addition to his 21 points vs. Memphis, he grabbed nine rebounds. \"(I'm) just trying to lean on my teammates and my hard work. Everybody is encouraging me,\" Lamb said, later adding: \"Over the summer, I really tried to work on my mindset, whether things are going good or bad.\"\n\nSWEET REVENGE\n\nMemphis defeated the Hornets 105-90 in Charlotte on Nov. 21, and Walker remembered the bitter taste after the Grizzlies scored 69 first-half points and held a 25-point cushion at the break. \"They came to our house and beat us, and we wanted to come back and get this win back,\" he said. \"We didn't play the way we were capable of that night, and they brought it to us. They beat us up pretty bad. It was definitely a revenge game in my mind.\"\n\nCONLEY OUT\n\nConley left with 8:25 left in the third quarter after taking a charge from Kidd-Gilchrist and did not return. Conley was not in the locker room after the game, and team officials said his condition would be evaluated Tuesday. \"We don't know the status just yet,\" Memphis coach David Fizdale said. \"We're waiting to hear.\"\n\nUP NEXT\n\nHornets: Return home Tuesday to face the Detroit Pistons.\n\nGrizzlies: Travel to Toronto to face the Raptors on Wednesday, the sixth of seven straight games against Eastern Conference teams.",
  "source": "espn_api",
  "crawled_at": 1764995536.19898
}