{
  "game_id": "0021900051",
  "espn_id": "401160693",
  "date": "Oct 28, 2019",
  "matchup": "CHA @ LAC",
  "headline": "Kawhi's 30 propels Clippers to 111-96 win over Hornets",
  "body": "LOS ANGELES --  Kawhi Leonard is only four games into his tenure back home in Los Angeles, and Paul George is still several games away from his Clippers debut. Everybody is still getting to know each other on this reconfigured roster.\n\nThe Clippers have enough talent to keep stacking victories during this introductory process -- particularly against teams like the Charlotte Hornets, who have even more work to do.\n\nLeonard had 30 points, seven rebounds and six assists, and Lou Williams scored 23 points one day after his 33rd birthday in Los Angeles' 111-96 victory over Charlotte on Monday night.\n\nMontrezl Harrell scored eight of his 19 points in the fourth quarter, and Landry Shamet added 16 in the Clippers' third win in four games to start a season with championship aspirations.\n\nAfter following up their impressive season-opening victories over the Lakers and the Warriors with a shocking 130-122 loss to the Phoenix Suns two days ago, the Clippers managed to play enough defense in the second half to secure a comfortable win over the young Hornets. Their last two performances have been nowhere near complete, but the Clippers are working through it.\n\n\"There's so many things that we can get better in,\" Clippers coach Doc Rivers said. \"And you just see them, like screening, timing, knowing where each other is at. There's so many new parts on the floor, and I just feel like we're nowhere near what we're going to be. Not even close, and that's a good thing. But during that time, you've still got to win games. You're in the West. You've just still got to tick off wins.\"\n\nThe Clippers pulled away with a 16-5 run spanning the final two quarters, stretching their lead to 96-79 with 7  1/2 minutes to play. Charlotte made an 11-2 surge, cutting the lead to single digits on Miles Bridges' 3-pointer with 4:16 left, but Harrell and Williams made big shots down the stretch.\n\n\"We've got to come in every game with a defensive hat on first, and we did that tonight,\" Leonard said. \"It's still early. We've got a long road ahead of us. We're still building chemistry, getting to know each other on the floor. I wouldn't say we're there yet. We've got to keep going.\"\n\nTerry Rozier had 17 points to lead six Hornets scoring in double figures in the second game of a four-game trip. Devonte Graham had 14 points and 12 assists, while Cody Zeller added 14 points and 13 rebounds for Charlotte, which has lost three straight after a season-opening win over Chicago.\n\n\"I like the way we competed against two of the better teams in the league,\" Charlotte coach James Borrego said. \"We played even better tonight. Probably our best performance of the year defensively.\"\n\nIndeed, Charlotte appeared to have more favorable defensive matchups against these Staples Center co-tenants than they did against the Lakers. But one night after the Hornets managed only 39 points in the second half of a loss to the Lakers, they scored only 42 in the second half against the Clippers.\n\n\"I feel like we're growing,\" Graham said. \"Even (against the Lakers), I feel like we took a step. We came out tonight to fight and be aggressive, but they did a good job on us in the second half.\"\n\nRECENT EDGE\n\nThe Clippers have won 10 straight over the Hornets at Staples Center since February 2009. Los Angeles has won 10 of its last 11 overall against Charlotte.\n\nKAWHI'S ASSISTS\n\nLeonard has added improved playmaking skills to his already formidable offensive arsenal since arriving in LA. Two days after setting a career high with 10 assists in Phoenix -- which surpassed his previous career high of nine, set two days before that against Golden State -- he had five in the first half against Charlotte, including a sublime bounce pass through traffic to Ivica Zubac shortly before halftime.\n\nTIP-INS\n\nHornets: Zeller sported a bandage on the cut above his left eye from his mutual elbowing with Davis in their loss to the Lakers on Sunday night. ... Malik Monk scored 15 points.\n\nClippers: Zubac had a career-high five blocked shots. ... Shamet surpassed his season high with four 3-pointers in the first six minutes of the game. ... George is out for at least six more games while he recovers from a shoulder injury, but Rivers said they consult frequently about potential offensive sets that will benefit George.\n\nUP NEXT\n\nHornets: Visit the Sacramento Kings on Wednesday night.\n\nClippers: Visit the Utah Jazz on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996112.874371
}