{
  "game_id": "0021600914",
  "espn_id": "400900309",
  "date": "Mar 03, 2017",
  "matchup": "MEM @ DAL",
  "headline": "Curry, Noel lead retooled Mavericks past Grizzlies 104-100",
  "body": "DALLAS -- Nerlens Noel had to wait an extra game for his first start in Dallas because he was late to the plane for his first road trip.\nThe rangy center-forward made a pretty strong case when he finally did join the starting five after coming over from Philadelphia in a trade at the deadline.\nNoel tied a career high with 17 rebounds while scoring 15 points , Seth Curry stayed on a roll since the All-Star break with 24 points and the Mavericks beat the Memphis Grizzlies 104-100 on Friday night.\n\"This is my first time in a position like this, you know, just switching teams in the middle of the season,\" said Noel, who came off the bench against the Hawks after coach Rick Carlisle said he had planned to start him. \"You really see how tough it is when you transition as a professional. I think I'm still learning.\"\nThe Mavericks held on despite going scoreless for more than five minutes in the last half of the fourth quarter. The drought ended when Dirk Nowitzki made a free throw after Memphis coach David Fizdale was called for a technical with Dallas leading 94-90 with 46 seconds left.\nMike Conley scored 30 points for the Grizzlies, and Zach Randolph had 24 points and 10 rebounds. Marc Gasol scored 13, but was just 6 of 18 from the field.\n\"The feeling's frustration right now because we're trying to find consistency,\" Conley said. \"You feel like you're working, you're doing the things in practice and you do it one game, but the next game, for whatever reason, there's no energy.\"\nNoel almost had his second double-double of the season by halftime with 13 points and nine boards. His other double-double was with the 76ers. He also had two blocks, including one on a dunk attempt by Gasol.\nHarrison Barnes had 18 points on just 6-of-15 shooting and Yogi Ferrell scored 17 as all five starters were in double figures for the Mavericks, who flirted with a franchise low in points in an 80-64 loss in their other meeting with Memphis in November.\nDallas was without Nowitzki and three key guards because of injuries in the earlier loss to the Grizzlies. Curry started that game and was just 4 of 14 from the field as the Mavericks nearly had the worst shooting night in franchise history at 29 percent.\nThe Mavericks have since moved on without starting point guard Deron Williams, committing to Ferrell after adding the rookie on a 10-day contract while Curry gets more comfortable as one of the catalysts for the offense.\nCurry was 8 of 15 from the field and scored at least 20 points for the fourth time in five games since the break, and Ferrell was 6 of 12 with another guard out as Dallas shot 48 percent. Wesley Matthews missed his second game with a hip injury.\nTIP-INS\nGrizzlies: Chandler Parsons had seven points and four rebounds in 24 minutes in his second game against his former team. He's still on a minutes restriction and didn't return after coming out in the third quarter. Before the game, Fizdale said he was considering giving Parsons his first back-to-back Saturday night in Houston. ... Conley had a four-point play in the first half when he threw up the 3 as he was getting fouled and it banked in. He was 9 of 10 from the line.\nMavericks: Nowitzki scored 10 points and needs 38 to become the sixth NBA player with 30,000 points. ... Devin Harris had a game-high six assists. ... Noel's other 17-rebound game was in his debut season in March 2015 with the 76ers against Atlanta. It was his 36th career double-double.\nFUTILE FOURTH\nThe teams went more than four minutes without scoring after Dallas went up 94-85 on a jumper by Ferrell with 6:25 remaining. The Mavericks missed their last nine shots but made 10 of 11 free throws in the last 46 seconds to stay in front. The Grizzlies were on a 12-4 run when Fizdale got the technical.\nTURNOVER TURNAROUND\nThe Mavericks had nine turnovers after four straight games above their average of 12 per game, the lowest in the NBA. Dallas had just two in the first half after finishing one shy of their season with 22 in the loss to Atlanta.\nUP NEXT\nGrizzlies: Memphis takes a 10-3 record on the second night of back-to-backs into a visit to the Rockets. The Grizzlies won their first eight.\nMavericks: The second of five straight at home against Oklahoma City on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995577.611944
}