{
  "game_id": "0022300646",
  "espn_id": "401585274",
  "date": "Jan 27, 2024",
  "matchup": "LAC @ BOS",
  "headline": "Clippers win their 5th straight, 115-96 over Celtics. It was just Boston's 2nd home loss",
  "body": "BOSTON -- — The Clippers were embarrassed on their home court the first time they faced the Celtics. \n\n\r\n              Los Angeles returned the favor during its visit to Boston. \n\n\r\n              Kawhi Leonard scored 26 points in only 29 minutes and the Clippers routed the Celtics 115-96 on Saturday night.\n\n\r\n              Paul George added 17 points for Los Angeles, which used a 21-0 run in the third quarter to win its fifth straight and avenge a 37-point home loss to Boston in December. Leonard, George and the rest of Los Angeles’ starters sat the entire fourth quarter.\n\n\r\n              It was the most lopsided home loss of the season for Boston, which lost for just the second time at TD Garden home after starting the season 20-0 there.\n\n\r\n              “Yeah, guys were pretty motivated,” Clippers coach Tyronn Lue said. “They came to LA and beat us pretty bad. So guys were locked in. We understand it was a back-to-back. But guys were locked in. They were up for the challenge. It was a game we thought PG might be out, but he wanted to play and see where we're at. \n\n\r\n              \"Just a measuring stick against a great team.”\n\n\r\n              Leonard called it a great step for a Clippers team that began the day with the third-best record in the Western Conference, but has much higher aspirations. \n\n\r\n              “I’m happy we were able to come in and give the Celtics a loss. But it really doesn’t mean nothing until you get to the playoffs and you’re doing the things we did tonight – executing, making shots and playing good defense,\" Leonard said. “We’ve got to just keep getting better as the year goes on. So once that time comes we’re moving very efficiently.”\n\n\r\n              Jayson Tatum led Boston with 21 points. But the Celtics collectively shot just 35% from the field (36 of 101) and 25% (10 of 40) from 3-point range. In Boston's victory in Los Angeles, the Celtics made a season-high 25 3s.\n\n\r\n              “You're never as good as you think you are, you're never as bad as you think you are,” Celtics coach Joe Mazzulla said. \n\n\r\n              The Clippers didn’t show any effects of playing on the second night of a back to back, pushing their 16-point halftime lead as high as 36 in the third quarter. They finished with 64 points in the paint. \n\n\r\n              “(The Celtics) came out in LA and imposed their will on the game, so we just wanted to come out and do the same thing,” said Clippers guard James Harden, who finished with just nine points but had eight rebounds and seven assists. \n\n\r\n              Los Angeles did it by exploiting the interior of a Celtics defense that was without 7-footer Kristaps Porzingis, who sat with a sprained left ankle. \n\n\r\n              The center isn’t expected to miss much time, but his presence was missed against a Clippers team that sped Boston up in the halfcourt forcing the Celtics to settle for jump shots. \n\n\r\n              It was all on display in the third quarter when Los Angeles had its 21-0 run to take a 79-46 advantage. The stretch included a technical foul on Tatum and rounds of boos from an equally frustrated home crowd.\n\n\r\n              Saturday was the second game of a season-high seven-game road trip for the Clippers. It also marked the start of a seven-game homestand for Boston, which is its longest of the season.\n\n\r\n              The Clippers led by as many as 18 in the first half and held a 55-39 halftime lead. Los Angeles held the Celtics to just 29% from the field and 4 for 23 (17%) beyond the arc in the opening 24 minutes.\n\n\r\n              The Celtics started flat, tying a season low for points in the first quarter (21). They also went the entire first half without registering a second-chance point. \n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Cavaliers on Monday.\n\n\r\n              Celtics: Host Pelicans on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996550.665333
}