{
  "game_id": "0021500310",
  "espn_id": "400828197",
  "date": "Dec 07, 2015",
  "matchup": "MIL vs. POR",
  "headline": "Monroe, Henson help Bucks rally past Trail Blazers 90-88",
  "body": "MILWAUKEE -- The Bucks switched up their last-second tactics and pulled off an improbable victory.\nGreg Monroe's layup put Milwaukee ahead with seconds left and John Henson swatted away Meyers Leonard's potential game-winning shot to help the Bucks edge the Portland Trail Blazers 90-88 on Monday night.\nO.J. Mayo hit a 3-pointer that cut Portland's lead to 88-87 with 16.3 seconds left. The Trail Blazers called a timeout to set up their play, but the Bucks talked strategy, too. Instead of fouling, Milwaukee tried to force a tie-up.\n\"A lot of refs think that the team is trying to foul,\" Mayo said. \"When we walked out, we told them, `Hey man, we're trying to go for a jump ball first.' That's what happened.\"\nMichael Carter-Williams and Giannis Antetokounmpo tied up CJ McCollum on the inbounds play as the trio fell to the floor in a scramble.\nMcCollum said the Trail Blazers ran one of their plays saved for late in a game.\n\"I broke toward the ball and caught it, turned and they called a jump ball,\" he said. \"If the referee doesn't make the call, you have to respect it and move on. I felt like it was a pretty quick jump ball, but who am I?\"\nCarter-Williams won the jump ball.\n\"Obviously, we had to win that jump ball,\" Mayo said. \"We had no timeouts left.\"\nThe Bucks worked it down low to Monroe. He muscled his way in for a layup with 5.9 seconds left and Milwaukee had its first lead since early in the fourth quarter.\n\"We wanted to attack the paint,\" Mayo said. \"Moose had a great finish at the end.\"\nPortland had one last chance, but Henson deflected Leonard's in-close shot to preserve the win. Carter-Williams was fouled and made one of two free throws for the final margin.\nAntetokounmpo scored 17, Monroe added 16 points and 12 rebounds, and Mayo had 15 points for Milwaukee, which had lost 10 of 14.\nDamian Lillard scored 23 points and McCollum added 17 for Portland, which fell to 0-7 when failing to score 100 points.\nIn a tight fourth quarter with seven lead changes, Lillard's 3-pointer tied the game at 75. Ed Davis scored on a layup and McCollum hit a 19-foot jumper to put Portland up by six.\nAntetokounmpo's layup with 24 seconds left pulled Milwaukee to 86-84. Lillard was fouled on the ensuing possession and sank the two free throws.\nAfter his team trailed 42-33 at halftime, Lillard led Portland back with 10 points. His 3-pointer gave the Trail Blazers a 62-60 lead, their first since 2-0, at the end of the third. The Blazers outscored the Bucks 29-18 in the period.\nNBA Commissioner Adam Silver, in Milwaukee for a business meeting, watched the game from a seat six rows up near midcourt.\nTIP-INS\nTrail Blazers: McCollum's 3-pointer with 4:02 left in the second quarter was the only one Portland made in 15 attempts during the first half. ... Lillard averaged a team-high 24 points in Portland's two games against Milwaukee last season.\nBucks: The team played without guards Jerryd Bayless (left ankle sprain) and Greivis Vasquez (right ankle soreness). ... Milwaukee had 30 points in the paint to 18 for Portland at the end of the half.\nKING SWAT\nHenson's four blocks matched the team's season high shared by Monroe and Miles Plumlee.\nTURNOVERS\nThe Bucks entered 0-11 when committing as many or more turnovers than their opponent. Each team had 17 miscues.\nUP NEXT\nTrail Blazers: At Cleveland on Tuesday.\nBucks: Host the Los Angeles Clippers on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994083.24246
}