{
  "game_id": "0021300084",
  "espn_id": "400488957",
  "date": "Nov 08, 2013",
  "matchup": "POR vs. SAC",
  "headline": "Blazers cruise to 104-91 win over Kings",
  "body": "PORTLAND, Ore. --  Damian Lillard and LaMarcus Alrdridge were again the go-to duo for the Trail Blazers against the Kings. The two combined for 42 points in a 104-91 victory over Sacramento on Friday night.\n\nWhile Lillard envisions the partnership with Aldridge rising to the level of say, Chris Paul and Blake Griffin, he insists the Blazers are about much more.\n\n\"We need to be (among the league's elite), we talk about it,\" Lillard said. \"But we've got a great supporting cast. We don't have to do it all.\"\n\nLillard finished with 22 points, eight rebounds and seven assists and Aldridge added 20 points, including 10 in the fourth quarter. The Blazers led 54-49 at the half and by as many as 14 points in the third quarter.\n\n\"Damian and L.A., they're kind of our go-to guys and they came through tonight,\" coach Terry Stotts said.\n\nDeMarcus Cousins almost singlehandedly carried the Kings with 35 points and nine rebounds. Sacramento's lone win so far this season came in the opener against Denver.\n\nCousins said the loss was about \"small things\" turning into \"big things.\"\n\n\"We gotta gang rebound. You just can't depend on the bigs to grab all the rebounds,\" he said. \"A lot of those rebounds go out of our area so we've got to be able to rebound out of our area. We've got to get some help from the outside because when you don't, they get a lot of second-chance opportunities.\"\n\nCousins pulled the Kings within 90-84 with a layup in the fourth quarter, but Aldridge countered with a turnaround jumper and six points was the closest Sacramento would get.\n\nAldridge became the first Blazers player to score at least 20 points in each of the team's first five games since Clyde Drexler in 1988.\n\nIt was the first game of a home-and-away back-to-back between the two teams. The Blazers visit Sacramento on Saturday night.\n\n\"It will be a different game. They'll be at home and they'll want to beat us for a little payback,\" Blazers forward Nic Batum said.\n\nThe Blazers went ahead 29-22 in the first quarter. Lillard, last season's rookie of the year was 3 for 3 from the floor -- all 3-pointers -- for 9 points. Lillard became just the second NBA player to hit three or more 3s in his team's first five games. Former Blazer Damon Stoudamire did it with Toronto in 1996.\n\nMo Williams' layup stretched Portland's lead to 37-26. Late in the half, Wesley Matthews hit consecutive 3-pointers to put Portland in front 52-42. Matthews finished with 18 points.\n\nCousins, who had 18 points and six rebounds in the first half, struggled in Sacramento's 105-100 loss at home to the Hawks on Tuesday. Shut down by Atlanta's Al Horford, Cousins had 11 points and six rebounds, far off his average of 18.3 points and 9.3 rebounds.\n\nCousins' layup got the Kings within 54-53 early in the third quarter, but the Blazers took off on a 12-0 run to take a 68-55 lead midway through the period.\n\nThe Kings struggled defensively against the Blazers, who had six players in double figures and shot nearly 50 percent from the floor for the game.\n\n\"Defensively, we collapsed,\" first-year Kings coach Michael Malone said.\n\nGame notes Former Blazer Chris Dudley and Hall of Famer Dominique Wilkins were at the game to bring attention Diabetes Health and Wellness Week. ... Portland Timbers players Ryan Johnson and Pa Modou Kah were at the game and got a hearty round of applause when shown on the video scoreboard. The Timbers have advanced to Major League Soccer's Western Conference final and play the first of the two-leg series against Real Salt Lake on Sunday.  ... Cousins had four steals to up his total on the season to 12. ... Lillard became the first NBA player to have at least 100 points, 25 rebounds, 25 assists and 20 3-pointers in his team's first five games.",
  "source": "espn_api",
  "crawled_at": 1764993029.1648839
}