{
  "game_id": "0022300266",
  "espn_id": "401584894",
  "date": "Nov 30, 2023",
  "matchup": "CHA @ BKN",
  "headline": "Rozier has 37 points and 13 assists, Hornets win 129-128 to snap Nets' three-game winning streak",
  "body": "NEW YORK -- — Terry Rozier had 37 points and 13 assists, and the short-handed Charlotte Hornets beat the Brooklyn Nets 129-128 on Thursday night.\n\n\r\n              Miles Bridges added 23 points, Gordon Hayward chipped in 22 and Mark Williams had 12 points and 12 rebounds. The Hornets snapped their two-game losing streak despite playing without star guard LaMelo Ball and No. 2 pick Brandon Miller.\n\n\r\n              “My trust is in all my teammates just like they trust in me,” Rozier said. “I think everybody stepped up tremendously. Everybody chipped in and did a great job.”\n\n\r\n              Cam Thomas scored 26 points in his return from a sprained ankle and Mikal Bridges had 22 points and nine rebounds as Brooklyn’s three-game winning streak was snapped.\n\n\r\n              “We did not have the standard that we have, especially in that first half,” Nets coach Jacque Vaughn said. “That set the tone. You give a team confidence, and they’re playing free and able to make shots.”\n\n\r\n              The teams combined to make 98 of 196 field goals, but the Hornets shot 58.3% from 3-point range, led by Rozier (7 for 9) and Bryce McGowens (4 for 5), who set a career high for 3-pointers.\n\n\r\n              “Bryce is putting a lot of work in, and it’s showing,” Rozier said. “We’re all happy for him, and hopefully he can keep it going.”\n\n\r\n              Charlotte outscored Brooklyn 27-22 in the fourth quarter and made six of its final eight field goals. The Hornets also limited the Nets to 9-for-27 shooting (33.3%) in the final period.\n\n\r\n              “I think our fourth-quarter defense was critical,” Hornets coach Steve Clifford said. “It’s a great win. The most important thing is we fought hard and made plays at the end of the game.”\n\n\r\n              The Nets had the chance to win it after Rozier missed a mid-range jumper with eight seconds left, but Cam Johnson missed a 3-pointer that would have won it with 2.1 seconds left.\n\n\r\n              “We got a great look at the end,” Thomas said. ”(Johnson's) miss was a great look, a wide-open 3. We’ll live with that all day.”\n\n\r\n              The Nets shot 58.3% in the first half despite missing their first five field goals. They made 28 of 43 (65.1%) to close the first half after the slow start, led by Thomas’ 17 first-half points in his first action after missing the past nine games.\n\n\r\n              “I thought overall (Thomas) looked good,” Vaughn said. “He hasn’t been able to play a lot of basketball ... so good to have him back out there. Another weapon for us, now we’ve got to put it all together with more healthy bodies.”\n\n\r\n              Charlotte set a season high with 42 second-quarter points and made 11 of 19 3-pointers in the first half. Keyed by Hayward, who scored 10 of his 14 first-half points in the second quarter, Charlotte led by as many as seven and took a two-point advantage into halftime.\n\n\r\n              “We made so many shots,” Clifford said. “We battled hard. We just couldn’t stop them until the fourth quarter.”\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host Minnesota on Saturday.\n\n\r\n              Nets: Host Orlando on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995988.25843
}