{
  "game_id": "0021500190",
  "espn_id": "400828077",
  "date": "Nov 21, 2015",
  "matchup": "MIL @ IND",
  "headline": "Miles scores 21, leads Pacers to 123-86 win over Bucks",
  "body": "INDIANAPOLIS --  C.J. Miles made sure Indiana put things away early in the second half.\n\nMiles scored 13 of his season-high 21 points in the third quarter to lead the Pacers to a 123-86 victory over the Milwaukee Bucks on Saturday night.\n\n\"We jumped on them to start the second half, which is what we needed to do,\" Miles said. \"We led at the half, but there were a lot of things we could have done better in the first half. In the second half, we did those things better.\"\n\nPaul George had 20 points and seven rebounds, and Jordan Hill added a season-high 20 points off the bench for the Pacers (8-5), who have won five of six.\n\nGreg Monroe had 11 points and 14 rebounds for the Bucks (5-8), who have lost three straight and five of six. Jabari Parker and O.J. Mayo each finished with 10 points.\n\nMiles made two baskets and a free throw, and George scored to give the Pacers a 65-53 lead early in the third quarter. Later, Miles made two 3-pointers and George had a basket to put Indiana ahead 80-64.\n\nThe Pacers took a 23-point lead when Monta Ellis hit a 3-pointer with 30 seconds remaining in the third quarter to make it 90-67.\n\n\"They came out in the second half and made shots, and we could not get them stopped,\" Bucks coach Jason Kidd said. \"We would miss a shot and then not get back on defense. In the last two games, we played pretty well in the second half, but that didn't happen tonight.\"\n\nThe Pacers are on the road for five of the next six games, including a four-game road trip to the West Coast. On Friday, Indiana plays Chicago at home after dropping its first game with the Bulls this season, 96-95 on Monday.\n\nMiles created a spark in the third, teaming with George to help Indiana pull away.\n\nIndiana outscored Milwaukee 35-16 in the third and the Pacers opened the second half on a 10-2 run for a 65-53 lead.\n\n\"We're playing good,\" George said. \"We're just learning and we're really far from where we started. Everything is starting to come together and we're getting a better feel for one another.\"\n\nIndiana lost three in a row to start the season and hasn't lost consecutive games since.\n\nThe Pacers got off to a slow start and trailed by as much as six when Michael Carter-Williams made a free throw to make it 12-6 early in the game. Indiana took the lead for good when Ellis scored to make it 46-45 and Miles converted a three-point play to give the Pacers a 49-45 lead with 3:11 left in the first half.\n\nFROM BEHIND THE ARC\n\nIndiana made a season-high 15 3-pointers and was 8 for 14 from 3-point range in the second half. Glenn Robinson III finished with a career-high 17 points off the bench and was 4 for 4 from 3-point range. The rookie forward made a 3 with 8:15 left to give the Pacers a 100-71 lead. Miles, George, and Chase Budinger each made three 3-pointers.\n\nTIP-INS\n\nBucks: Khris Middleton was held to eight points after he had scored in double figures in each of the previous nine games. ... The Bucks gave up 29 points on 23 turnovers. ... Mayo's 10 points were the most this season after missing the first 11 games of the year.\n\nPacers: G George Hill missed his third straight game with an upper respiratory infection. He dressed and was available in the case of an emergency, Pacers coach Frank Vogel said before the game. ... Rodney Stuckey, who finished with seven points and five, played for the first time in four games after recovering from a sprained ankle. ... Indiana's 123 points are the most since the Pacers defeated the New York Knicks 125-91 on Feb. 20, 2013.\n\nUP NEXT:\n\nBucks: Host Detroit on Monday.\n\nPacers: At Washington on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994097.446851
}