{
  "game_id": "0021900833",
  "espn_id": "401161475",
  "date": "Feb 21, 2020",
  "matchup": "MEM @ LAL",
  "headline": "Anthony Davis' big 2nd half leads Lakers past Grizz, 117-105",
  "body": "LOS ANGELES --  The Los Angeles Lakers hadn't even been back on the court for three minutes after the All-Star break when Anthony Davis limped off with an injured leg.\n\nWith their superstar big man in the locker room, the Lakers played an ominous quarter wondering whether their playoff push had just hit some massive resistance.\n\nInstead, Davis got his legs back under him and put up a monster performance that reminded everybody why the Lakers are atop the West.\n\nLeBron James scored 32 points, Davis recovered from that early scare to get 28 points, 13 rebounds and seven blocked shots, and Los Angeles returned from the break with a 117-105 victory over the Memphis Grizzlies on Friday night.\n\nDavis bruised his right calf on an opponent's knee shortly after the opening tip. He has been slowed by several knocks that turned out to be minor throughout the season -- and after several minutes of treatment, he returned to cheers in the second quarter.\n\n\"The leg felt good enough for me to go out and give it a try,\" Davis said with a shrug. \"I just wanted to be on the floor to help the guys.\"\n\nHe found his formidable game after halftime, putting up 24 points along with 11 boards and five blocks in the second half. Davis also led the Lakers' interior defensive efforts against the Grizzlies, whose well-known ability to drive to the rim only resulted in 14 blocked shots by Los Angeles.\n\nDavis had 14 points, seven rebounds and four blocks in the fourth quarter alone as Los Angeles improved to 42-12 with its fourth straight win since Feb. 6.\n\n\"Another Defensive Player of the Year-type of night from Anthony,\" coach Frank Vogel said. \"He's the best defender in the league from a versatility standpoint. Especially against a team like this, where you have concerns about a basket-attacking guard like Ja Morant.\"\n\nAvery Bradley added 14 points for the Western Conference-leading Lakers, who finished strong after blowing most of their 25-point lead accumulated in a superb first half.\n\n\"Give the Lakers a lot of credit,\" Memphis coach Taylor Jenkins said. \"They came out and just kind of punked us in that first half. We weren't ready to play in the first half. Proud of the guys to fight back, pick up our activity and win the third quarter. ... Overall, just one of those games where we didn't come ready to play, and we've got to learn from this.\"\n\nJosh Jackson scored a season-high 20 points for the Grizzlies, who have lost back-to-back games in California after heading into the All-Star break with eight wins in 10.\n\n\"A lot of defensive guys threw different looks at me,\" said Morant, who scored 17 points. \"It's just what they do. I feel like everybody knows those guys are great defenders, but I still try to attack the game the same way. Tonight I missed layups. Missed a wide-open pull-up. Made some shots, and forced some. I could have been better.\"\n\nThe Grizzlies erased most of LA's lead with a strong third quarter, but the Lakers hung on with a series of big plays, including a jaw-dropping rebound dunk by Alex Caruso off a missed free throw by Davis with 6:16 to play.\n\nThe Lakers improved to 3-0 against the Grizzlies this season. They meet again in Memphis on Feb. 29.\n\nTIP-INS\n\nGrizzlies: Memphis signed G Dusty Hannahs to a 10-day contract before the game. He leads the Grizzlies' G League affiliate with 21.3 points per game this season, and he appeared in two games for Memphis earlier this season. ... Gorgui Dieng had 14 points and 10 rebounds.\n\nLakers: Vogel and the team declined to comment on multiple reports claiming the team will release center DeMarcus Cousins to clear a roster spot. Cousins hasn't played for the Lakers after tearing a ligament in his knee in August, but he had been rehabbing with hopes of returning for the playoffs. Cousins was in the Lakers' locker room before the game, but didn't sit with the team on the bench.\n\nINJURED JACKSON\n\nJaren Jackson Jr. didn't play in the second half due to knee soreness from an awkward fall in the first half. Jenkins had no postgame update on the starting forward's condition, but the Grizzlies have the next two days off.\n\nQUICK START\n\nAlthough James, Davis and Dwight Howard were busy in Chicago over the break, the Lakers returned with impressive defensive focus across the roster. Los Angeles held Memphis to 15-for-38 shooting and forced 11 turnovers in the first half.\n\nRESCHEDULED GAME\n\nThe game against the Clippers that was postponed by Kobe Bryant's death will be made up April 9. The NBA also rescheduled two additional Lakers games, and the moves mean they'll have to play at home on three consecutive nights in early April, just one week before the start of the postseason.\n\n\"We may stagger some of the guys that play,\" Vogel said. \"Some guys may not play in all three games. We'll have those conversations as we get closer to those games and see what the standings look like.\"\n\nUP NEXT\n\nGrizzlies: Stay in town to face the Los Angeles Clippers on Monday.\n\nLakers: Host the Boston Celtics on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.comAP)Sports",
  "source": "espn_api",
  "crawled_at": 1764995694.096603
}