{
  "game_id": "0021901284",
  "espn_id": "401224759",
  "date": "Aug 08, 2020",
  "matchup": "MIL @ DAL",
  "headline": "Doncic gets 17th triple-double, Mavs top Bucks 136-132 in OT",
  "body": "LAKE BUENA VISTA, Fla. --  Luka Doncic scored 36 points in his NBA-leading 17th triple-double and the Dallas Mavericks scored the last seven points of regulation to force overtime, going on to a 136-132 win over the Milwaukee Bucks on Saturday night.\n\nDoncic also had a career-high 19 assists and 14 rebounds on the day the 2019 NBA Rookie of the Year was named a finalist for the most improved award.\n\n\"He's getting better by the hour, by the day,\" coach Rick Carlisle said. \"I was most impressed with his leadership throughout the game. Kept a real calm demeanor, kept guys playing during some tough stretches.\"\n\nMilwaukee star Giannis Antetokounmpo had 34 points, 13 rebounds and five blocks before fouling out in the final seconds hours after the reigning MVP was named a finalist for the award along with LeBron James and James Harden.\n\nBrook Lopez scored a season-high 34 points for the Bucks, who have already clinched the top seed in the Eastern Conference.\n\n\"It's great to be in this situation,\" Lopez said. \"We've had a lot of these situations all year long so there's a lot we can take from this.\"\n\nDoncic's final assist was a between-the-legs pass to Maxi Kleber for a three-point play and a 133-128 lead.\n\nAfter a dunk from Antetokounmpo, Doncic hit a runner to get the lead back to five with 11 seconds to go as the Mavericks kept alive slim hopes to get out of the seventh seed and avoid a likely first-round matchup with the Los Angeles Clippers. Dallas played its third overtime game out of five in the bubble, winning for the second time.\n\n\"I'm feeling fresh and just trying to make the right decision,\" said Doncic, who has three triple-doubles in five games since the restart. \"Sometimes I take a shot and I shouldn't have.\"\n\nDoncic hit two free throws with 21 seconds left in regulation, and the Mavericks forced overtime when two putback attempts by Milwaukee wouldn't go in after a missed 3-pointer from George Hill.\n\n\"One of the most talented guys I've ever played against,\" Antetokounmpo said of Doncic, his fellow All-Star for the first time this season. \"He's making the whole team better, and he's going to keep getting better.\"\n\nThe foul that sent Doncic to the line was originally called as the sixth on Antetokounmpo. The Bucks challenged, and the foul was switched to Khris Middleton.\n\nThe Mavericks scored the first nine points of overtime on a 3-pointer from Tim Hardaway Jr. and two more from Dorian Finney-Smith, extending to 16-0 a run that started late in the fourth quarter. Finney-Smith had a career-high 27 points with 11 rebounds.\n\nIn a matchup that included three of the four players averaging at least 30 points and 10 rebounds in the bubble, Doncic and Antetokounmpo hit those marks again. Dallas' Kristaps Porzingis fell short, getting 26 points and 11 rebounds before fouling out.\n\nTIP-INS\n\nBucks: Finished the first half on a 32-12 run after falling behind 50-39. Middleton's three-point play with 1.9 seconds left in the half put Milwaukee up 71-62. ... Lopez's 21 points in the second were the most in any quarter in his career, and he finished five off his career best of 39 for a game, set in 2011. ... Middleton had 21 points and 11 rebounds.\n\nMavericks: Carlisle and Doncic were assessed technical fouls in the second quarter after a no-call when Doncic went sprawling to the ground while driving between Lopez and Pat Connaughton and making contact with Marvin Williams. ... G Seth Curry returned after missing two games with right leg soreness.\n\nUP NEXT\n\nBucks: Play Toronto on Monday in a rematch of last year's East finals.\n\nMavericks: Play Utah on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996119.061645
}