{
  "game_id": "0021500065",
  "espn_id": "400827952",
  "date": "Nov 04, 2015",
  "matchup": "MIL vs. PHI",
  "headline": "Khris Middleton leads Bucks past 76ers in Jabari Parker's return",
  "body": "MILWAUKEE -- The return of franchise cornerstone Jabari Parker made Milwaukee Bucks fans giddy at the start of their game against Philadelphia.\nKhris Middleton made big plays that had them cheering at the end.\nIn between, the Bucks fended off charge after charge from the winless 76ers for a 91-87 victory Wednesday night.\nMiddleton scored 21 points, while rookie center Jahlil Okafor led Philadelphia with 21 points on 9-of-13 shooting\n\nParker, a former Duke star like Okafor, was a bit rusty. He finished 1 of 6 for two points in 16 minutes in his first game since tearing his left ACL on Dec. 15, 25 contests into a promising rookie campaign last year.\n\"You know, I didn't make much. I made a basket,\" Parker said with smile.\n\"Went really well. Got the win, so that's most important,\" he added.\nHis teammates picked him up down the stretch.\nLeft open after Okafor left to double-team ball-handler Middleton, Greg Monroe got the pass back as he streaked down the lane for a layup with 1:29 left and an 86-85 lead.\nMiddleton hit a fallaway 3-pointer with 48 seconds left to make it a four-point game. He sealed the win with two foul shots with 1.4 seconds left.\n\"Guys stayed together and made plays on the defensive end down the stretch. On offense, we took our time,\" coach Jason Kidd said.\nJust as the Bucks did with Parker in taking a cautious approach with his rehab. Parker and Okafor, who each left Duke after their freshman years, exchanged a hug and handshake on the floor after the final buzzer.\nGiannis Antetokounmpo added 17 points and shot 7 of 11 for the Bucks.\nHe breathed life into a sluggish game by corralling a rebound and zig-zagging the length of the floor with about 5 seconds left in the third quarter for a three-point play.\nBut it took a while longer before the favored Bucks could put away the young 76ers. Nerlens Noel had 17 points and 12 rebounds in 33 minutes for his second double-double of the season for Philadelphia.\n\"Tonight, we were in a position, at the end, to get a road win. We didn't but it's something you just leave feeling good about the group,\" coach Brett Brown said. \"They are moving forward.\"\nBACK TO BUSINESS\nParker exchanged the thick haircut he sported during training camp for a closely cropped look in his first game back. The second overall pick in the 2014 NBA draft was glad to be back at work.\n\"Had a few jitters, but most importantly I was more engulfed in the game every chance that I got,\" Parker said.\nKidd's plan is to gradually increase Parker's minutes.\nYOUNG SIXERS\nRebuilding Philadelphia's youthful lineup made Milwaukee look like a grizzled NBA outfit.\nRookie T.J. McConnell made his first start at point guard, finishing with seven points, 12 assists and nine rebounds. Second-year guard Nik Stauskas had 14 points, but shot 5 of 19 overall and 3 of 14 from 3-point range.\n\"There is nothing like giving NBA minutes out to anybody. It is the greatest job interview anybody will ever have,\" Brown said.\nQUOTABLE\n\"Christmas Eve? No, it's only November. But it's more like Thanksgiving ... We're thankful for the opportunity for him to come and play tonight.\" -- Kidd, when asked if pregame before Parker's return felt like Christmas Eve.\nSTAT LINE\nThe Sixers outrebounded 51-37, including 25-12 in the second half. ... Philadelphia had 18 turnovers to 10 for Milwaukee.\nTIP-INS\n76ers: PG Phil Pressey played 2 minutes after being signed on Wednesday, filling an additional roster spot from the NBA for hardship relief. The undermanned Sixers are without center Joel Embiid for a second straight season because of a foot injury. Robert Covington went on the injury report this week with a sprained right knee, joining three other players. Pressey is the son of former NBA swingman Paul Pressey, who played for the Bucks from 1982-90.\nBucks: Starting PG Michael Carter-Williams missed the game against his former team with a sore left ankle. ... The Bucks are also still without two key rotation players in F-C John Henson (left Achilles) and G O.J. Mayo (right hamstring).\nUP NEXT\n76ers: At Cleveland on Friday.\nBucks: At New York on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994109.8525891
}