{
  "game_id": "0021500959",
  "espn_id": "400828846",
  "date": "Mar 10, 2016",
  "matchup": "TOR vs. ATL",
  "headline": "DeMar DeRozan has 30 points and Raptors top Hawks 104-96",
  "body": "TORONTO --  DeMar DeRozan and a strong defense helped the Toronto Raptors overcame a sloppy start.\n\nDespite nine turnovers in the first 13 minutes and 11 by halftime, the Raptors kept things close with the Atlanta Hawks before pulling away in the second half for a 104-96 victory.\n\n\"Tonight was our solid defense,\" said Raptors head coach Dwane Casey. \"It was a grinded-out game, a 48-minute game. I thought our guys competed, did a good job in our coverages, especially down the stretch.\"\n\nDeRozan had 30 points and five rebounds as Toronto won its second straight and 14th of 15 at home.\n\nKyle Lowry had 19 points and seven assists for the Raptors while Luis Scola had 10 points and 12 rebounds and Jonas Valanciunas scored in double digits for a career-high 16th time and added 10 rebounds.\n\nThe loss snapped a three-game win streak for the Hawks, who wrapped up a five-game road trip.\n\nAl Horford led the way for Atlanta with 20 points, four rebounds and three assists while Kent Bazemore added 13 points and eight rebounds and Paul Millsap had 12 points and five rebounds.\n\n\"I don't think we were as mentally sharp as we've been in the last few games and we just didn't do a good job of executing,\" said Kris Humphries, who had nine points and four rebounds. \"We let them get some momentum and they played well defensively and made plays down the stretch.\"\n\nMillsap's driving layup with 7:28 to go cut the Toronto lead to 95-89.\n\nBut the Raptors scored six straight points to widen the lead to 12 points to take control.\n\nAfter forcing 11 Toronto turnovers in the first half, Atlanta only got four the rest of the way.\n\n\"Maybe our energy went down a little bit in the second half,\" Horford said. \"We weren't flying around all over the place like we were earlier, so probably that had something to do with it.\n\n\"As far as tightening up on offense, we need to be a little more focused, do things with more purpose in order for us to take the next step as a team.\"\n\nThe Raptors led 82-75 going into the fourth quarter on the strength of a dominant inside game, outscoring the Hawks 44-22 in the paint through the first three quarters. They finished the game with a 50-34 edge.\n\n\"Tonight was a big challenge for us,\" DeRozan said. \"We had a lot of turnovers early on and we just tried to use that against them and be aggressive.\"\n\nThe game featured 11 lead changes and seven ties before the Raptors went up for good as part of a 7-0 run over a two-minute stretch early in the third quarter.\n\n\"Credit to Toronto,\" Atlanta coach Mike Budenholzer said. \"They made a lot of plays.\n\n\"We have to be a little bit sharper, a little bit better especially on the road against a good team.\"\n\nIt was the first of three games between the teams over the next month.\n\n\"It was very important,\" Scola said of the victory. \"This team is right behind us (in the standings) and there's a big chance we play them in the playoffs, so it was a big win.\"\n\nTIP INS\n\nHawks: Al Horford missed a free throw in the second quarter, ending a streak of 20 straight makes. . Atlanta's bench outscored Toronto's 36-33. ... The Hawks had six players score in double figures: Al Horford (20), Kent Bazemore (13), Paul Millsap (12), Dennis Schroder (11), Tim Hardaway Jr. (11) and Jeff Teague (10).\n\nRaptors: Toronto turned the ball over nine times in the first 12:33 of the game, but just six times the rest of the way. ... The Raptors outscored the Hawks 50-34 in the paint.  The Raptors had six players score in double figures: DeMar DeRozan (30), Kyle Lowry (19), Terrence Ross (12), Patrick Patterson (12), Luis Scola (10) and Jonas Valanciunas (10).\n\nPASS IT ON\n\nThe Hawks, who came into the game ranked second in the NBA with 25.5 assists per game, had just 17.\n\nDYNAMIC D\n\nThe Hawks, ranked third in the NBA at the start of the game with 16.6 forced turnovers and first with 19.3 points off turnovers, forced 15 Toronto turnovers that led to 13 Atlanta points.\n\nJUMPING JONAS\n\nToronto C Jonas Valanciunas had 10 points and 10 rebounds, his career-high 16th straight game scoring in double figures and his team-best 16th double-double of the season. The Raptors are 13-3 when he has at least 10 points and 10 rebounds.\n\nDEFENSE NEVER RESTS\n\nToronto won for a franchise-record 29th straight time when holding opponents to fewer than 100 points. The Raptors are 34-3 this season when they give up fewer than 100 points.\n\nUP NEXT\n\nThe Hawks return home to take on the Memphis Grizzlies on Saturday night.\n\nThe Raptors continue their seven-game homestand by hosting the Miami Heat on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994704.809119
}