{
  "game_id": "0021500494",
  "espn_id": "400828381",
  "date": "Jan 01, 2016",
  "matchup": "LAL vs. PHI",
  "headline": "Williams scores 24, Lakers use late rally to top 76ers 93-84",
  "body": "LOS ANGELES -- The young Los Angeles Lakers are eventually going to have to learn how to play well as a team minus Kobe Bryant once he retires at the end of this season.\nThey had an opportunity Friday night to gauge themselves as a group and as individuals without him on the floor. And it was veteran Lou Williams who led the way.\nWilliams scored 12 of his 24 points in the fourth quarter against his former club and Jordan Clarkson added 19, leading Los Angeles to a 93-84 victory over the Philadelphia 76ers.\nThe Lakers, who were coming off a 112-104 victory at Boston on Wednesday night, have won consecutive games for the first time since a three-game stretch last February against Boston, Utah and Milwaukee.\n\"We're starting to play off each other, and guys are just being comfortable in their own skin,\" Williams said. \"These past few games we've played with a lot of confidence and played at a better pace.\n\"I'm starting to feel like we're understanding how to make the game easier for ourselves, instead of one or two guys taking the brunt of the load.\"\nJulius Randle scored 15 off the bench for Los Angeles in a matchup between teams with the NBA's two worst records. The Sixers (3-32) and Lakers (7-27) have played each other four times in the NBA Finals, most recently in 2001.\nBoth teams shot less than 35 percent from the field through the first three quarters, with the Lakers holding a 62-60 edge. Nik Stauskas, the first player off the Sixers' bench, helped them reduce an eight-point deficit to 73-70 on a dunk with 8:11 remaining after missing his first six shots.\nBut Williams, who played his first seven NBA seasons in Philadelphia, hit a pair of 3-pointers and a 20-footer during a 15-2 run that gave Los Angeles an 88-72 cushion with 4:21 left.\nRookie forward Larry Nance Jr. had a season-high 14 rebounds and eight points for the Lakers on his 23rd birthday while playing on a tender right ankle.\n\"Adrenaline is a powerful thing,\" Nance said. \"I felt it a few times here and there, trying to rotate on defense and move my feet. But other than that, I was fine. All I wanted for my birthday was a win, and we got that.\"\nNerlens Noel had 15 points and 12 rebounds for the Sixers, who tied an NBA record with their 0-18 start before beating the Lakers 103-91 on Dec. 1 at Philadelphia.\n\"They caught us slipping in Philly, but I really didn't think about that,\" Williams said. \"We're a young team and they're a young team. Sometimes, teams beat us that we feel shouldn't, so we didn't care about answering them in this game. We just had to go out and get a win.\"\nPoint guard Ish Smith had nine points and three assists in his fourth game since returning to the Sixers in a trade from New Orleans on Nov. 24.\n\"Ish and Isaiah (Canaan) struggled. They went 5 for 30,\" coach Brett Brown said. \"We felt like our defense was holding the fort, but we weren't able to make shots to break it open and their mobility at times got the better of us.\"\nLakers point guard D'Angelo Russell and 76ers center Jahlil Okafor, the second and third overall picks in the draft, respectively, both came off the bench in their second showdown as pros after each started in the first meeting. Russell had six points and five assists in 26 minutes. Okafor had 12 points and four rebounds in 23 minutes.\nBryant sat out against his hometown team because of a sore right shoulder, the same one he had surgery on last January to repair a torn rotator cuff. That forced the NBA's third all-time leading scorer to miss the final 48 games of the 2014-15 season.\nTIP-INS\n76ers: Mike D'Antoni, hired as associate head coach on Dec. 18, made his first visit to Staples Center with an NBA club since the Lakers fired him as head coach following the 2013-14 campaign after they made the playoffs in his first season at the helm. ... The 76ers were 17-69 during the 2015 calendar year, and the Lakers were 17-66.\nLakers: Rookie Anthony Brown started at Bryant's small forward spot, getting five points and five rebounds in 22 minutes. ... Bryant averaged 23.5 points, 4.4 assists, 5.2 rebounds and 45.6 percent from the field in 32 regular-season games against the 76ers.\nUP NEXT\n76ers: At Los Angeles Clippers on Saturday.\nLakers: Host Phoenix on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994289.010672
}