{
  "game_id": "0022300518",
  "espn_id": "401585146",
  "date": "Jan 10, 2024",
  "matchup": "CHA vs. SAC",
  "headline": "Murray, Sabonis help Kings run past Hornets, 123-98",
  "body": "CHARLOTTE, N.C. -- — Keegan Murray scored 25 points, Domantas Sabonis had 24 points and 10 rebounds and the Sacramento Kings beat the Charlotte Hornets 123-98 on Wednesday night for their second straight victory.\n\n\r\n              Former Hornets first-rounder Malik Monk added 20 points for Sacramento. De’Aaron Fox scored 19 points, and Sabonis also had seven assists. The Kings improved to 23-14, getting revenge for a 111-104 home loss to Charlotte last week.\n\n\r\n              “We knew we owed them one,” said Sacramento forward Trey Lyles, who had eight points and five rebounds. “We gave one away at home so we had to come out here and handle business. And that’s what we did.\n\n\r\n              “We’re a better team when we share the ball. When we share the ball and hit the open guys, Domantas and De’Aaron and Keegan and Malik are going to make shots.”\n\n\r\n              Miles Bridges led the Hornets with 24 points. Terry Rozier added 22, Brandon Miller had 15 and Nick Smith, Jr. 11. Charlotte, at 8-27, has lost 157 man-games because of injury or illness, including starters LaMelo Ball (20), Mark Williams (16), Rozier (11), Gordon Hayward (10).\n\n\r\n              The Kings went on a 30-10 surge to turn a 25-20 deficit into a 50-35 lead with 8:48 left in the second quarter. Sacramento hit seven straight 3-pointers — three from Fox — and had one three-point play during that surge.\n\n\r\n              “Sometimes we’re great on defense and sometimes we’re terrible,” Bridges said. “We’ve just got to play the same every time and have a true identity. I feel like our identity changes every game, so we’ve got to just stick to our identity and have that be us.”\n\n\r\n              Sacramento really put it out of reach with 11 straight points early in the third quarter to built an 84-62 lead. The Kings led by 26.\n\n\r\n              Kings coach Mike Brown praised his team’s defense and the boost he got from his bench players like Monk and Lyles.\n\n\r\n              “We had a lot of guys step up,” said Brown, whose team has limited opponents to 161 points in the last seven quarters after yielding 49 in the first quarter Tuesday night in a 131-110 win at Detroit. “Malik continues to be big for us off the bench. You can to him to score. You can go to him to facilitate. Malik’s continuing to lay his stake for Sixth Man of the Year with two back-to-back 20-point games.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Philadelphia on Friday night.\n\n\r\n              Hornets: At San Antonio on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995973.3387551
}