{
  "game_id": "0022300428",
  "espn_id": "401585056",
  "date": "Dec 28, 2023",
  "matchup": "LAL vs. CHA",
  "headline": "LeBron closes in on 39th birthday with 17 points, 11 assists in Lakers' 133-112 win over Hornets",
  "body": "LOS ANGELES -- — LeBron James had 17 points and 11 assists two days before his 39th birthday, Anthony Davis had 26 points and eight rebounds and the Los Angeles Lakers sent the Charlotte Hornets to their ninth straight loss with a 133-112 victory Thursday night.\n\n\r\n              Rui Hachimura scored 17 points and Austin Reaves had 16 for the Lakers, who won for just the third time in nine games since winning the NBA's inaugural In-Season Tournament nearly three weeks ago. Los Angeles pulled away from the struggling Hornets with a blazing 41-point third quarter led by Hachimura and James, who scored 12 points apiece.\n\n\r\n              Los Angeles surged to a 28-point lead early in the fourth, and coach Darvin Ham rested James and Davis for the full final quarter of a rare blowout victory for these Lakers, who have only eight double-digit victories all year.\n\n\r\n              “Guys were playing for each other, playing the right way,” said Davis, who also blocked four shots. “Anytime I'm able to bank some minutes, especially going into a tough back-to-back in Minnesota and New Orleans, it helps us as a team.”\n\n\r\n              James may be the NBA’s oldest player, but he shows zero sign of slowing down in his 21st season. He hit two 3-pointers while quarterbacking the offense for long stretches, and he led the decisive third-quarter rally. Los Angeles finished with a season-high 41 assists.\n\n\r\n              “It's always good things that happen when the ball is in his hands,” Davis said. “He makes great reads. He's a student of the game. He's seen every coverage and made a lot of great reads throughout his career, so every time we can get the ball in his hands, it's good for us.”\n\n\r\n              D'Angelo Russell scored 16 points while hitting four 3-pointers for the Lakers, including the 1,300th of his career. Reaves provided the highlight of the second half with a slick behind-the-back move to get past Terry Rozier for a layup while Los Angeles ran away.\n\n\r\n              “I believe that every time we step on the court, we can beat anybody we play,” Reaves said. “But just really figuring out what our identity is, in my opinion, the main thing, because we can be so good when we figure that out.”\n\n\r\n              Miles Bridges scored 20 points and Rozier had 18 for the Hornets, who are on their franchise's longest skid since late 2014. Charlotte hung with the Lakers throughout the first half, but struggled against LA's zone defense after halftime and eventually lost its second straight game at this shared downtown arena to begin a six-game trip.\n\n\r\n              “If we'd just guard without fouling, I think we'd be good,” said rookie Brandon Miller, who scored 17 points. “Being in the right places, I think that was the important part tonight. I feel like I messed up on a few possessions.”\n\n\r\n              Los Angeles-area native LaMelo Ball missed his 14th straight game because of a sprained left ankle for the Hornets, who must play both LA teams, Phoenix, Denver and Sacramento in eight days on this trip. Charlotte also is missing Gordon Hayward (calf) and big man Mark Williams (back).\n\n\r\n              “Our guys have worked hard, (but) they know we’re short-handed,\" Charlotte coach Steve Clifford said. \"This is a tough trip. A lot of times in this league, it’s not just how many injuries you have, but when they come. Unfortunately for us, we’ve had more than our share of injuries, and this is not the time to be short-handed. But we played 41 good minutes the other night (against the Clippers). We were right there. We played about 21 1/2 good minutes tonight. We've just got to defend.”\n\n\r\n              Hachimura started slowly from the field after rejoining the Lakers’ starting lineup in place of Cam Reddish, who sat with a groin injury. But he led the way with James and Davis while the Lakers made 10 of their first 12 shots in the second half and burst to their first double-digit lead of the night.\n\n\r\n              Los Angeles had its ninth starting lineup combination in 32 games this season. The Lakers were forced to use 39 starting lineups last season, but James and Davis have stayed largely healthy so far this year, missing just five games combined. Coach Darvin Ham said he expects Davis and James to be available for both legs of their upcoming back-to-back road games at Minnesota and New Orleans to close out 2023.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At Phoenix on Friday night.\n\n\r\n              Lakers: At Minnesota on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995530.163167
}