{
  "game_id": "0022000492",
  "espn_id": "401267652",
  "date": "Feb 24, 2021",
  "matchup": "MIA vs. TOR",
  "headline": "Butler leads Heat to 4th straight win, 116-108 over Raptors",
  "body": "MIAMI -- — Jimmy Butler went to the foul line in the final moments of the fourth quarter Wednesday night, talking and smiling the entire time.\n\n\r\n                    There's a lot for Butler and the Miami Heat to be happy about right now.\n\n\r\n                    Butler scored 27 points, 14 of them in the final quarter, and the Heat won their fourth consecutive game by topping the Toronto Raptors 116-108 on Wednesday night.\n\n\r\n                    Butler also had 10 assists and eight rebounds for the Heat, plus a season-high three 3-pointers — two of them in the final minutes. Bam Adebayo had 19 points and 12 rebounds for Miami, Duncan Robinson added 17 points and Goran Dragic scored 15 in his return from an ankle injury.\n\n\r\n                    “We're just out there having fun,\" Adebayo said.\n\n\r\n                    It was the eighth win in the last 11 games for the Heat, who started the season 7-14.\n\n\r\n                    “Everybody that played really contributed at different points in the game,\" Heat coach Erik Spoelstra said. “And then Jimmy's game was the quintessential, all-around winning basketball game.\"\n\n\r\n                    Kyle Lowry, returning from a thumb injury, scored 24 for Toronto. Fred VanVleet also had 24 for the Raptors, Norman Powell scored 17 and OG Anunoby had 14 for Toronto.\n\n\r\n                    “I thought we outplayed them,\" Raptors coach Nick Nurse said. “I thought we outplayed them in almost all facets. ... The ball just bounced their way a lot.\"\n\n\r\n                    Powell made a 3-pointer as the shot clock was expiring to get Toronto within 100-98 before Butler had the game’s next three plays of any significance — a 3-pointer, a steal on the ensuing possession and a layup to push Miami’s lead back to seven.\n\n\r\n                    Another 3-pointer by Butler with 3:23 left restored the seven-point edge, and Miami kept the lead the rest of the way.\n\n\r\n                    “He's our leader and we need him,\" Dragic said.\n\n\r\n                    Lowry scored 12 of Toronto’s first 20 points in the opening 6½ minutes, and he made a 31-footer over Miami’s zone midway through the second quarter to tie it at 48.\n\n\r\n                    The next 2:51 belonged to Miami.\n\n\r\n                    The Heat went on a 17-2 spurt in that time, six players scoring during the run, to open a 15-point lead and took a 66-56 edge into halftime.\n\n\r\n                    Toronto scored the first 10 points of the second half, erasing the deficit, but a 17-6 answer by the Heat helped them take a 92-85 lead into the fourth. And the Raptors never led at any point in the final 31 1/2 minutes.\n\n\r\n                    “It was fun to be back out there with the fellas,\" said Lowry, who acknowledged that his thumb was hurting at times after contact Wednesday. “We gave it a tough fight, but we didn't pull it out at the end.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Pascal Siakam got his fourth foul with 1:18 left in the half, after Miami successfully used its challenge to overturn a blocking call that became a charge. It was a huge call; Siakam wasn't a factor in the second half and finished with a season-low five points. ... Toronto fell to 1-5 on the second night of back-to-backs this season.\n\n\r\n                    Heat: Tyler Herro (hip) remained sidelined. ... Capacity was increased for this game, and the Heat had about 3,000 fans in the arena including some in the upper deck for the first time this season. ... Andre Iguodala was 4 for 5 on 3-pointers for Miami.\n\n\r\n                    SPO KNOWS\n\n\r\n                    Spoelstra now has 667 wins, including playoffs, with Miami. That ties Red Holzman of the New York Knicks for the fifth-most by any coach with one franchise. The only others with more: Gregg Popovich with San Antonio, Jerry Sloan with Utah, Red Auerbach with Boston and Phil Jackson with the Los Angeles Lakers.\n\n\r\n                    SEE YOU\n\n\r\n                    The Heat won the season series over Toronto, 2-1. Miami has also finished its regular-season series against Washington, Oklahoma City, Sacramento and the Los Angeles Clippers. Toronto has also finished its season series with Milwaukee, Philadelphia, New Orleans, Sacramento and Minnesota.\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Host Houston on Friday.\n\n\r\n                    Heat: Host Utah on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996792.313388
}