{
  "game_id": "401810206",
  "espn_id": "401810206",
  "date": "Dec 06, 2025",
  "matchup": "WSH vs ATL",
  "headline": "Atlanta faces Washington, looks to stop 3-game skid",
  "body": "Atlanta Hawks (13-11, ninth in the Eastern Conference) vs. Washington Wizards (3-18, 15th in the Eastern Conference)\n\n\r\n              Washington; Saturday, 7 p.m. EST\n\n\r\n               Hawks -9.5; over/under is 235.5\n\n\r\n              BOTTOM LINE: Atlanta heads into the matchup against Washington after losing three games in a row.\n\n\r\n              The Wizards are 1-2 in division matchups. Washington has a 1-2 record in one-possession games.\n\n\r\n              The Hawks are 7-7 against Eastern Conference opponents. Atlanta ranks eighth in the Eastern Conference allowing just 116.5 points while holding opponents to 46.7% shooting.\n\n\r\n              The Wizards average 112.2 points per game, 4.3 fewer points than the 116.5 the Hawks give up. The Hawks average 14.0 made 3-pointers per game this season, 1.1 fewer made shots on average than the 15.1 per game the Wizards allow.\n\n\r\n              The teams meet for the second time this season. The Wizards won 132-113 in the last meeting on Nov. 26. CJ McCollum led the Wizards with 46 points, and Kristaps Porzingis led the Hawks with 22 points.\n\n\r\n              TOP PERFORMERS: Khris Middleton is scoring 10.4 points per game and averaging 4.2 rebounds for the Wizards. McCollum is averaging 22.0 points and 2.0 rebounds over the last 10 games.\n\n\r\n              Onyeka Okongwu is shooting 50.2% and averaging 15.8 points for the Hawks. Vit Krejci is averaging 5.0 made 3-pointers over the last 10 games.\n\n\r\n              LAST 10 GAMES: Wizards: 2-8, averaging 110.7 points, 40.6 rebounds, 25.1 assists, 7.5 steals and 5.6 blocks per game while shooting 46.1% from the field. Their opponents have averaged 127.0 points per game.\n\n\r\n              Hawks: 4-6, averaging 117.4 points, 41.0 rebounds, 30.8 assists, 8.5 steals and 4.7 blocks per game while shooting 47.9% from the field. Their opponents have averaged 120.0 points.\n\n\r\n              INJURIES: Wizards: Cam Whitmore: day to day (illness), Khris Middleton: day to day (knee), Tristan Vukcevic: day to day (knee), Sharife Cooper: out (calf), Tre Johnson: out (hip), Bilal Coulibaly: out (oblique), Corey Kispert: out (thumb), Alex Sarr: out (adductor).\n\n\r\n              Hawks: N'Faly Dante: day to day (concussion), Jacob Toppin: day to day (shoulder), Trae Young: out (knee), Nikola Đurisic: day to day (elbow).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042765.188975
}