{
  "game_id": "0022200613",
  "espn_id": "401468768",
  "date": "Jan 10, 2023",
  "matchup": "TOR vs. CHA",
  "headline": "Siakam has 28 points, Raptors beat slumping Hornets 132-120",
  "body": "TORONTO -- — Pascal Siakam scored 28 points, Gary Trent Jr. had 24 and the Toronto Raptors beat the Charlotte Hornets 132-120 on Tuesday night.\n\n\r\n              O.G. Anunoby scored eight of his 22 points in the fourth quarter and matched his career high with six 3-pointers as Toronto won its fourth straight home meeting with the Hornets and reached the midway point of the regular season at 18-23.\n\n\r\n              The Raptors made a season-high 20 3-points in 44 attempts.\n\n\r\n              “Let’s have a party,” guard Fred VanVleet joked.\n\n\r\n              Toronto won consecutive games for the sixth time this season. The Raptors have yet to win three in a row.\n\n\r\n              Toronto had 18 offensive rebounds to Charlotte’s six and outscored the Hornets 20-4 in second-chance points.\n\n\r\n              “That was the game,” Charlotte coach Steve Clifford said. You can’t pick and choose when you want to do the tough things. That’s what we did tonight.”\n\n\r\n              Terry Rozier scored 33 points for Charlotte, and LaMelo Ball had 24 points and a season-high 14 assists. The Hornets lost for the fifth time in six games.\n\n\r\n              “We’ve just got to start holding each other accountable,” Rozier said. “We’re all grown. It’s just what we’ve got to do. Obviously, our way hasn’t been working, so we’ve got to turn it around.”\n\n\r\n              Mason Plumlee scored 21 points for Charlotte, P.J. Washington Jr. had 13 and Jalen McDaniels 11.\n\n\r\n              “We’re playing for our season right now,” Plumlee said.\n\n\r\n              Bell’s 3-pointer with 7:05 left in the fourth quarter cut it to 108-107, but Anunoby replied with back-to-back 3-pointers, his fifth and six.\n\n\r\n              “They’re super explosive,” Raptors coach Nick Nurse said. “We just did enough there in the last six minutes.”\n\n\r\n              VanVleet also connected from long range, putting Toronto up 117-107 with 4:32 to play.\n\n\r\n              “Our individual defense, which had been good lately, was awful,” Clifford said.\n\n\r\n              SURGERY FOR PORTER\n\n\r\n              Toronto F Otto Porter Jr. will miss the remainder of the season following left foot surgery, the team announced Tuesday. Porter signed with the Raptors last summer but was limited to eight games because of toe and hamstring injuries.\n\n\r\n              TIP-INS\n\n\r\n              Hornets: F Gordon Hayward (left hamstring) missed his fourth straight game while G Kelly Oubre Jr. (left hand surgery) missed his sixth. … Missed their first field goal of the game, then made the next 11 straight. … Matched a season-high with 33 assists.\n\n\r\n              Raptors: Made 19 3-pointers in a Dec. 23 win at Cleveland. … VanVleet had 11 points, seven rebounds and eight assists. … Precious Achiuwa scored 13 points and Chris Boucher had 12. … Rookie Christian Koloko had six offensive rebounds, one shy of his career-high. … Rapper J. Cole sat courtside.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At Toronto on Thursday night.\n\n\r\n              Raptors: Host Charlotte on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994059.678964
}