{
  "game_id": "0021600593",
  "espn_id": "400900014",
  "date": "Jan 13, 2017",
  "matchup": "CHA @ PHI",
  "headline": "Joel Embiid continues to brighten 76ers' outlook as Philly wins 3rd straight",
  "body": "PHILADELPHIA -- Joel Embiid scored 24 points, blocked three shots and led the Philadelphia 76ers to their third straight victory, 102-93 over the Charlotte Hornets on Friday night.\nThe Sixers are on their first three-game winning streak since they won four straight from Dec. 29, 2013 -- Jan. 4, 2014. Led by Embiid, the Sixers have won five of six games overall and are no longer the league laughingstock.\nEmbiid made six of 12 shots, grabbed eight rebounds and has made basketball fun again in Philadelphia. Embiid waved his arms while fans chanted \"Trust the Process!\" at him at the free-throw line. Embiid, the rookie center, even heard \"MVP!\" chants in the final minutes for his role in transforming the Sixers over the last month from cellar dwellers to a competitive team.\nEmbiid's only weakness was his 0-for-5 3-point shooting.\n\nNicolas Batum scored 19 points and Kemba Walker had 17 for the Hornets.\nEmbiid has brightened the Sixers' outlook the same way he lights up social media.\nEmbiid and WWE star Triple H (Hunter Hearst Helmsley) became social media friends this week and exchanged friendly tweets. Embiid said he was a fan of the wrestler and used his pregame intro to mimic Triple H.\nEmbiid walked out to the wrestler's theme music, \"The Game,\" by Motorhead, cocked his head back and spewed water into the air like Triple H would before a main event WrestleMania bout.\nTriple H noticed and tweeted at Embiid, \"Still have to perfect the water-to-spit ratio...Not bad for a first attempt. (hash)MopTheFloor (hash)NBAVote Joel Embiid.\"\nEmbiid has used social media to enhance his profile, build his fan base and keep himself in contention for an All-Star spot. Embiid got the block-and-wrestling connection rolling this week when he tweeted a photo of himself with his hands around teammate T.J. McConnell's neck and wrote, \"I learned this by watching you, (at)TripleH.\"\nTriple H tweeted back, \"To play the game you gotta go through The Process ... (hash)NBAVote.\"\n\"That was amazing,\" Embiid said before the game.\nEmbiid said he wanted to use Twitter to have fun.\n\"Everything I do on social media is really funny to me,\" Embiid said. \"I think I have the best laugh out of everybody.\"\nEmbiid had fun earlier in the day with a quote from Miami Heat star Hassan Whiteside, who said All-Star voting was a \"gimmick\" and players just \"make jokes on Twitter\" to get votes. Embiid retweeted the quote and wrote \"Hassan Whiteside (hash)NBAVote.\"\n\"One thing is, I want to be myself,\" Embiid said. \"I'm not going to change for anybody. I never hit the delete button. If I have something in my mind and I want to say it, I'm going to say it.\"\nEmbiid has had no regrets about any of his 2,270 tweets; even when he's tried to score dates with A-list starlets or the time he doctored a tweet to make it look like President-elect Donald Trump cast an All-Star vote for him.\n\"In the back of my head, I think this is going to backfire at some point,\" Embiid said. \"When that day comes, I'm going to stop.\"\nThe Sixers don't mind as long as Embiid saves his best output for games.\nHe might have scarred Cody Zeller with two monster blocks on the Charlotte center. Embiid swatted Zeller's two-handed jam attempt in the second quarter. Embiid swooped in from the left side and rejected Zeller's throw-down attempt down the lane in the third.\nWalker's first half was a dud. Walker, making his own social media All-Star push with a campaign that parodies Chuck Norris' \"Walker, Texas Ranger\" TV show, missed 11 of 13 shots in the first half and all four 3s. He hit a 3 in the third quarter that fueled a Charlotte run and got it to 52-50 after not leading at all in the first half.\nRobert Covington and Ersan Ilyasova buried 3s and the Sixers pushed the lead back to double digits.\nTIP-INS\nHornets: Batum made 7 of 14 shots after missing two games with a hyperextended right knee. ... Zeller, who sat out the last game against Houston with an illness, couldn't have felt good after getting blocked twice by Embiid. He had 16 points and 10 rebounds.\nSixers: C Jahlil Okafor, last season's leading scorer, received yet another DNP-CD.\nUP NEXT\nThe Hornets play Monday at Boston.\nThe Sixers play Saturday at Washington. Embiid is scheduled to sit out because he does not play the second game of back-to-backs as he eases his way back from a two-year layoff.",
  "source": "espn_api",
  "crawled_at": 1764995510.3287501
}