{
  "game_id": "0022000496",
  "espn_id": "401267656",
  "date": "Feb 24, 2021",
  "matchup": "CHA @ PHX",
  "headline": "Malik Monk scores 29 points, Hornets cool off Suns 124-121",
  "body": "PHOENIX -- — The Charlotte Hornets looked as if they were in trouble early against the streaking Phoenix Suns. That's when Malik Monk got hot and put on a show that had him reminiscing about his AAU days.\n\n\r\n                    Monk scored 29 points — including 20 in the second quarter — rookie LaMelo Ball added 20 points and eight assists and the Hornets cooled off the Suns with a 124-121 victory Wednesday night.\n\n\r\n                    Monk was reminded of the time he scored 60 points in an AAU game when he was in 10th grade.\n\n\r\n                    “We needed a spark, man,” Monk said. “I was knocking shots down and my teammates kept finding me.”\n\n\r\n                    Phoenix lost for just the second time in 11 games. Suns star Devin Booker missed an off-balance 3-pointer at the buzzer with replays showing Gordon Hayward made contact with Booker's arm. There was no foul call and the play wasn't reviewed.\n\n\r\n                    Hayward also had 20 points, including two free throws with 5.8 seconds left.\n\n\r\n                    Phoenix led by 17 points in the first half but settled for a 67-66 lead at halftime. Monk scored 22 points on 7-of-11 shooting — including 4 of 7 from 3-point range — before the break.\n\n\r\n                    “I am more frustrated about our defense tonight,” Suns coach Monty Williams said. “To give up that many 30-point quarters is unacceptable. The second quarter was when we lost it. I think we were up 17 points and started to goof around with the game.”\n\n\r\n                    Charlotte trailed for most of the first half, then rallied to take a 97-91 lead by the end of the third quarter. The Hornets pushed ahead by 11 points midway through the fourth but Phoenix scored 11 straight points — capped by Booker's dunk — to tie it at 110.\n\n\r\n                    Charlotte responded with the next seven points. Two came on a perfect alley-oop pass from Ball to Miles Bridges and then Bridges knocked down a 3-pointer on the next possession. After a Phoenix timeout, Ball slammed home a dunk after slicing down the lane and the Hornets didn't trail again.\n\n\r\n                    “He’s a winner,” Hornets coach James Borrego said about the 19-year-old Ball. “He makes winning plays – that’s the best way I can put it.”\n\n\r\n                    Booker was named to his second straight All-Star team as an injury replacement for Lakers forward Anthony Davis a few hours before Wednesday's game. He got a big ovation from the crowd during pregame introductions and got hot in the first quarter, pouring in 16 points on 7 of 9 shooting.\n\n\r\n                    Booker finished with 33 points on 13-of-24 shooting. Teammate Chris Paul — who also made the All-Star team for an 11th time — added 20 points, 10 assists and eight rebounds.\n\n\r\n                    “We've got to close out better,” Paul said. “We kept fighting. We gave ourselves a chance to win, a chance to at least tie it up. Book got fouled on that three. There are a lot of plays that happened in the course of the game.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Hayward was questionable with a right hand contusion but made his 29th start of the season. ... Charlotte's Terry Rozier was called for a technical in the third quarter after a no-call when Rozier appeared to get poked in the eye before he shot a 3-pointer. ... Guard Devonte' Graham didn't play for a third straight game because of left knee discomfort. ... Bismack Biyombo had 11 rebounds.\n\n\r\n                    Suns: Forward Abdel Nader didn't play because of a left thumb strain. ... Booker got a technical after a dunk in the fourth quarter for jawing with Graham, who didn't play and was sitting on the Charlotte bench. \n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: At Golden State on Friday night.\n\n\r\n                    Suns: At Chicago on Friday night.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt on Twitter: www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997024.1180851
}