{
  "game_id": "0022200225",
  "espn_id": "401468380",
  "date": "Nov 18, 2022",
  "matchup": "CLE vs. CHA",
  "headline": "Cavaliers hold off Hornets 132-122 in 2 overtimes, snap skid",
  "body": "CLEVELAND -- — The losing streak is over. The growing pains aren't subsiding for the Cavaliers.\n\n\r\n              Darius Garland scored 41 points, Donovan Mitchell added 34 and the Cavs survived a fourth-quarter collapse to beat the Charlotte Hornets 132-122 in double overtime and snap a five-game skid Friday night.\n\n\r\n              The Cavs blew a 10-point lead in the final minute of regulation and were lucky to escape with the win.\n\n\r\n              “We got away with one there,” coach J.B. Bickerstaff said. “We've got to learn. We've got to be better.”\n\n\r\n              Cleveland looked in control before the Hornets got hot in the closing minute, making four 3-pointers in a 44-second span, the last an off-balance jumper from Terry Rozier deep in the corner with 1.1 seconds left to tie it 105-all.\n\n\r\n              Charlotte, which has dropped 10 of 11, had a chance to win it in the first five-minute session, but Rozier missed a contested jumper just before the horn and the teams went to the second OT tied at 120.\n\n\r\n              The Cavs regrouped and dominated the final five minutes, outscoring the Hornets 12-2 while dodging what would have been a colossal loss. It's been a frustrating pattern for Cleveland this season: build a lead and let it crumble.\n\n\r\n              “It’s never going to be perfect,” said Mitchell, barely able to crack a smile as he pulled a towel tighter around his neck. “It’s going to feel bad and look ugly, but that’s where growth comes from. We have to learn from this.”\n\n\r\n              Cleveland also got 20 points, 12 rebounds, four blocks and a needed lift from All-Star center Jarrett Allen, who was back after missing two games with an unspecified illness. Evan Mobley had 21 points and a career-high 18 rebounds.\n\n\r\n              “He was willing to do whatever it took,” Bickerstaff said of Mobley, who added five assists and had several hustle plays.\n\n\r\n              Kelly Oubre Jr. scored 34 before fouling out in the second OT and Rozier had 28 for the Hornets, who were missing All-Star guard LaMelo Ball due to a sprained ankle sustained Wednesday against Indiana. X-rays were negative and he’s only expected to miss a few games.\n\n\r\n              Gordon Hayward returned after missing eight games with a shoulder bruise and scored 13 for Charlotte, which fell to 4-13 but showed plenty of fight.\n\n\r\n              “It was pretty remarkable that we even got that game to overtime,” Hayward said. \"Certainly a roller-coaster of emotions. We got the stops we needed to and had a chance to win the game.”\n\n\r\n              Down by 10 with one minute left, the Hornets battled back by making three consecutive 3-pointers to pull within 105-102 with 18.8 seconds left. After a turnover, Rozier hit his game-tying 3 as the Hornets stunned the young Cavs and their home crowd.\n\n\r\n              They managed to pull it out after a major scare.\n\n\r\n              “I feel like we got back a little bit of our identity,” Allen said. “But we've got a long way to go to be who we want to be.”\n\n\r\n              NEW LOOK\n\n\r\n              Trying to shake his team out of its recent funk, Bickerstaff tweaked his lineup by starting Lamar Stevens, more of a defender than scorer, over Caris LeVert, who came off the bench after being part of the first five for 14 games.\n\n\r\n              TIP-INS\n\n\r\n              Hornets: Numerous injuries, and especially their timing, have contributed to Charlotte's early-season struggles. Coach Steve Clifford said in the past he would be “freaking out” about not having players available, but understands he needs to be a steadying presence. ... Ball and Magic Johnson are the only players to average 17 points, six rebounds, six assists and 1.5 steals in their first 100 games.\n\n\r\n              Cavaliers: Garland had a career-high five steals and tied his career-worst with eight turnovers in 48 minutes. ... F Dean Wade missed his fourth straight game with a knee infection. Bickerstaff said Wade is being treated with antibiotics and has made progress.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Visit Washington on Sunday.\n\n\r\n              Cavaliers: Host Miami on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995253.699842
}