{
  "game_id": "0021500421",
  "espn_id": "400828308",
  "date": "Dec 22, 2015",
  "matchup": "TOR vs. DAL",
  "headline": "DeRozan helps Raptors edge Mavericks 103-99",
  "body": "TORONTO --  This time, DeMar DeRozan and the Toronto Raptors grabbed control with a big first quarter.\n\nDeRozan scored 28 points and Bismack Biyombo had a career-high 20 rebounds, leading the Raptors to a 103-99 victory over the Dallas Mavericks on Tuesday night.\n\nToronto led 32-16 after one for its biggest advantage of the season after 12 minutes. DeRozan had 10 points in the opening quarter.\n\n\"We just have to have that sense of urgency right out of the gate and understand that teams are coming after us,\" DeRozan said.\n\n\"We can't wait and we have to be the ones to throw the first punch and that's what we did tonight.\"\n\nToronto lost Sunday at home after trailing Sacramento 37-18 after the first quarter. The Raptors came into Tuesday night having dropped eight of 10 games when losing after 12 minutes.\n\nDallas' 16 points in the first were the fewest allowed by Toronto in an opening period this season.\n\nKyle Lowry had 17 points, 10 rebounds and seven assists for Toronto, which swept the two-game season series against Dallas. Terrence Ross scored 16 points, and Luis Scola finished with 15 points and nine rebounds.\n\nThe Raptors appeared to be on their way to a comfortable victory with five minutes to go in the fourth. But the Mavericks battled back.\n\nJeremy Evans scored with 11.6 seconds remaining to trim Toronto's lead to 101-99, but missed a foul shot that would have got Dallas within one. Ross then closed it out with a couple of free throws.\n\nBiyombo also had nine points and blocked two shots.\n\n\"He does a man's job as far as rebounding the ball and going and getting it and protecting the paint,\" Toronto coach Dwane Casey said.\n\nDirk Nowitzki led the way for Dallas with 20 points and seven rebounds. Wesley Matthews had 15 points before a sellout crowd at Air Canada Centre.\n\n\"It's obviously hard when you run behind like that and you've got to keep fighting to get back into the game,\" Nowitzki said.\n\nNowitzki hit a 26-foot 3-pointer to cut the Raptors' lead to three points in the second minute of the fourth.\n\nBut Toronto responded with a 15-2 run over the next five minutes. The Raptors hit four 3s during that key stretch, including a pair by Cory Joseph on consecutive trips up the court followed by another from Ross.\n\n\"I was really impressed with the way he responded tonight,\" Casey said of Joseph, who had 12 points in 27 minutes, including 10 points in the final period.\n\nCharlie Villanueva, who scored all nine of his points in the final quarter as the Mavericks made a push, said his team needs \"to play with more disposition, more energy and be scrappier.\n\n\"Toronto was a team that had just lost to Sacramento so they were hungry,\" he said. \"And, we'd just come out of a great win against Memphis and it just appeared that we were a little laid back.\"\n\nToronto forward James Johnson injured his ankle in warmups and did not dress. Then the Raptors lost Patrick Patterson to flu-like symptoms, leaving them with just nine players available.\n\n\"We have a resilient team and tonight everybody stepped up,\" Lowry said.\n\nTIP-INS\n\nMavericks: G Deron Williams left with a strained left hamstring in the third quarter and did not return. ... The Mavericks dropped to 4-10 when they score under 100 points.\n\nRaptors: Ross has scored in double digits for a season-high five straight games.\n\nCOACHING CONNECTIONS\n\nCasey, who was an assistant to Mavericks coach Rick Carlisle for three seasons from 2008-11, improved to 5-4 against his former boss.\n\nKNOCKOUT PUNCH\n\nFormer heavyweight boxing champion Lennox Lewis, 50, a dual British and Canadian citizen, got a nice ovation from the crowd when he was introduced and given a Raptors jersey sporting his name and the No. 1.\n\nUP NEXT\n\nMavericks: Visit the Brooklyn Nets on Wednesday night.\n\nRaptors: Visit the Milwaukee Bucks on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994743.8833191
}