{
  "game_id": "0021500899",
  "espn_id": "400828786",
  "date": "Mar 02, 2016",
  "matchup": "POR @ BOS",
  "headline": "Thomas helps Celtics beat Blazers for 12th straight home win",
  "body": "BOSTON -- Teams have found it nearly impossible to beat the Celtics on their home floor the last two months.\nYou can add one of the Western Conference's hottest road teams to that list.\nIsaiah Thomas had 30 points to lead Boston to its fourth straight win, 116-93 over the Portland Trail Blazers on Wednesday night.\n\nAvery Bradley added 17 points as the Celtics won their 12th straight at home. The streak ties Boston's longest since it won 13 straight at the Garden during the 2008-09 season.\nThomas and Bradley went right at the Blazers' high-scoring backcourt tandem of Damian Lillard and C.J. McCollum, often getting into the heart of Portland's defense.\n\"You just want to compete, and not back down from anybody,\" Thomas said. \"They're two great guards that play at a high-level. Me and Avery love these type of games. We just like competing against the best.\"\nSix Boston players reached double figures and the Celtics outscored Portland 60-34 in the paint, while committing just five turnovers.\nThe Celtics trailed by 12 points in the first quarter, but blew the game open in the third, outscoring the Blazers 30-12.\n\"We flew around about as well as we have all year in the third quarter,\" Boston coach Brad Stevens said.\nDamian Lillard led Portland with 20 points. C.J. McCollum added 17.\nThe Blazers snapped a six-game road win streak and lost away from home for the first time since Jan. 16.\n\"I think all night their offensive rebounds, their putbacks hurt us, and their transition hurt us. We got some unfortunate bounces where they ball's kind of bouncing around and it came up with them,\" Portland coach Terry Stotts said. \"They kept the pressure on us all night at both ends.\"\nPortland pushed the tempo at the outset, with McCollum and Lillard combining for 29 points in the first 24 minutes. But Boston's backcourt duo of Thomas and Bradley countered with 28 points.\nThe Celtics ended the half on an 11-3 run.\n\"We just weren't good enough. We didn't do a lot of the things that we've been doing at the level that we've been doing them,\" Lillard said. \"You can't go out there and let a team at home compete harder than you and not execute the game plan coming in.\"\nThomas said the goal is to continue playing this same brand of basketball the remaining 20 games of the regular season.\n\"Teams in the NBA they still don't respect us. And we know that,\" Thomas said. \"We go into every game with a chip on our shoulder and knowing that we gotta earn the respect. We gotta earn what we get and take what's ours.\"\nTIP-INS\nTrail Blazers: Lillard's streak of consecutive made free throws ended at 48 in the second quarter. The last Blazer with a longer streak was Damon Stoudamire (57 in 2005).\nCeltics: Marcus Smart tied his career-high with 11 rebounds. ... Jared Sullinger posted his fourth double-double in six games. ... Jonas Jerebko celebrated his 29th birthday on Wednesday. He is one of four Celtics with March birthdays, joining Sullinger (March 4), Smart (March 6), and Terry Rozier (March 17).\nRARE COMPANY\nAfter playing in his 300th career game in Portland's win over the Knicks Tuesday night, Lillard was averaging 21.2 points and 6.2 assists per game. Only four other players in NBA history averaged 21 points and six assists over their first 300 games: Oscar Robertson (30.2 and 10.3), Nate Archibald (24.5 and 8.4), LeBron James (26.7 and 6.4) and Dwyane Wade (24.0 and 6.4).\nTOP COACHES\nWednesday's matchup turned out to be one between the NBA coaches of the month, after both Stevens and Stotts received the award from their respective conferences. Boston was 9-3 in February, and Portland went 9-2.\n\"I told one of their assistants when they walked out, laughing about that -- if (the matchup is) between the coaches the Celtics are in trouble,\" Stevens said.\nUP NEXT\nPortland: At Toronto on Friday.\nBoston: Hosts New York on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994506.514464
}