{
  "game_id": "0021900444",
  "espn_id": "401161086",
  "date": "Dec 23, 2019",
  "matchup": "ATL @ CLE",
  "headline": "Sexton, Garland lead Cavaliers past Hawks, 121-118",
  "body": "CLEVELAND --  The Cleveland Cavaliers' backcourt of the future pushed them to victory Monday night.\n\nRookies Darius Garland and Kevin Porter Jr. took over in the fourth quarter and the Cavaliers held off a late Atlanta comeback for a 121-118 victory.\n\nCollin Sexton, a second-year player, scored 25 points while Garland had 21 and Porter added 15.\n\nGarland had 10 points and Porter added nine in the final period. The two will take on a bigger role after the Cavaliers agreed to trade veteran guard Jordan Clarkson to Utah for guard Dante Exum before the game.\n\nPorter and Garland are both 19 years old, and dealing with a teammate being traded was a new experience.\n\n\"I've never been in this situation,\" Porter said. \"It was kind of devastating. For the first three quarters I kept thinking about it. It's not a good feeling, but you've got to keep going.\"\n\nThe Cavaliers will also receive two future second-round draft picks in the trade, a person familiar with the deal told The Associated Press. Cleveland will get a pick in 2022 and one in 2023, said the person, who spoke on condition of anonymity because the teams have not yet had the required conference call with the NBA to approve the swap.\n\nThe deal came together shortly before the Jazz played in Miami and the Cavs' game began. Clarkson warmed up on the floor at Rocket Mortgage FieldHouse before he was informed of the trade.\n\nCleveland has won three straight for the first time since taking five in a row from March 28 to April 5, 2018 in LeBron James' final season with the team.\n\n\"It shows that we are improving,\" Cleveland coach John Beilein said. \"I don't know if we win this game a month ago.\"\n\nTrae Young scored 30 points, but his 3-pointer that would have tied the game in the closing seconds hit off the front of the rim and sent Atlanta to its eighth straight defeat.\n\n\"We've got to take way more pride on the defensive end,\" Hawks coach Lloyd Pierce said. \"That's what competition is. It's personal pride. I don't know how you make guys mentally tough. That's where it is right now.\"\n\nCleveland built a 14-point lead in the fourth quarter before the Hawks rallied. Young scored eight points in the quarter and Atlanta had a chance to tie with 5.1 seconds to go after a Cavaliers' miss.\n\nThe Hawks set up for a final shot, but Young's attempt from about 30 feet fell short.\n\nAtlanta forward John Collins returned from a 25-game suspension for violating of the NBA's drug policy. He was in the starting lineup and scored 27 points with 10 rebounds.\n\nKevin Love had 20 points for the Cavaliers. Cleveland led 71-64 at halftime, scoring a season high in points for a half.\n\nTIP-INS\n\nHawks: C Bruno Fernando took Love's elbow in the mouth in the third quarter and went to the locker room with a towel to his face. He did not return. ... Backup Alex Len sprained his left ankle in the second quarter and didn't return.\n\nCavaliers: Beilein hopes rookie guard Dylan Windler, who has been out all season with a stress reaction in his left leg, will play in January. Windler missed training camp with the injury and played for Canton of the G League before being shut down a couple of weeks ago.\n\nCOLLINS RETURNS\n\nCollins was suspended Nov. 5. He averaged 17 points and 8.8 rebounds in the first five games of the season. Atlanta went 4-21 without Collins, who is in his third season.\n\n\"It knocks the rust off, going against a guy like Kevin Love,\" he said. \"I felt good, OK.\"\n\nSHORT-HANDED\n\nIn addition to Clarkson's departure, Larry Nance Jr. missed the game for Cleveland because of a sore left knee. The 6-foot-7 forward averages 8.6 points and 7.2 rebounds.\n\n\"He's sort of a Swiss Army knife out there,\" Beilein said of Nance's versatility. \"He does a lot of things.\"\n\nUP NEXT\n\nHawks: Host Milwaukee on Friday.\n\nCavaliers: Visit Boston on Friday.",
  "source": "espn_api",
  "crawled_at": 1764996692.021547
}