{
  "game_id": "0021900946",
  "espn_id": "401161588",
  "date": "Mar 08, 2020",
  "matchup": "CHI @ BKN",
  "headline": "Dinwiddie makes late free throws. Nets beat Bulls 110-107",
  "body": "NEW YORK --  Spencer Dinwiddie scored 24 points, Caris LeVert and Joe Harris each added 23 and Brooklyn beat the Chicago Bulls 110-107 on Sunday, a day after the Nets parted ways with coach Kenny Atkinson.\n\nInterim head coach Jacque Vaughn directed the Nets to their second straight victory. The team said Saturday morning that the team and Atkinson \"mutually agreed to part ways.\" That message was reiterated in a news conference later in the day with general manager Sean Marks.\n\n\"It was a little different,\" LeVert said about playing without Atkinson, before adding, \"I felt like (Vaughn) did a great job.\"\n\nDeAndre Jordan and Jarrett Allen each added 11 points, and Jordan had 11 rebounds.\n\nOtto Porter Jr. led the Bulls with 23 points. Coby White added 21, Thaddeus Young had 17, and Lauri Markkanen 16.\n\n\"We know one thing,\" White said. \"Anybody who plays us or any head coach never questions how hard we play. Every night we play hard.\"\n\nThe Nets led 58-50 at halftime. LeVert led Brooklyn with 16 points, Harris had 15 in 14 minutes, and Dinwiddie added 12.\n\n\"Anytime you can get a win,\" Harris said, \"Especially this time of year, it's huge.\"\n\nTIP-INS:\n\nBulls: Guard Ryan Arcidiacono (right achilles) and G-F Zach LaVine (strained left quadricep) did not plays, and coach Jim Boylen suggested before the game G-F Chandler Hutichison could miss the remainder of the season because of a right shoulder injury. Hutchinson has not played since Feb. 11. ... Chicago was 12 of 34 on 3s, and 39 of 92 overall from the field.\n\nNets: Under Vaughn, there were some slight changes from Atkinson's preferred method of operation, most notably the decision to start Jordan at center over Allen. Jordan said Vaughn told him he would be starting, and was adamant that he would continue to play his game. \"Hell no,\" Jordan said in response to a question if he would modify his game to account for being in the starting five. \"No.\"\n\nUP NEXT:\n\nBulls: Hosts Cleveland on Tuesday night.\n\nNets: At Los Angeles Lakers on Tuesday night.\n\n---\n\nMORE AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996343.110228
}