{
  "game_id": "0021800481",
  "espn_id": "401071162",
  "date": "Dec 22, 2018",
  "matchup": "PHI vs. TOR",
  "headline": "Embiid, Simmons lead 76ers over short-handed Raptors",
  "body": "PHILADELPHIA --  Joel Embiid and the Philadelphia 76ers weren't too excited after their latest win.\n\nEmbiid had 27 points and 11 rebounds, Ben Simmons added 26 points, 12 rebounds and eight assists and Philadelphia routed the short-handed Toronto Raptors 126-101 on Saturday night.\n\nJJ Redick added 22 points for the 76ers, who pulled within 2 1/2 games of first-place Toronto in the Atlantic Division.\n\nPascal Siakam scored 26 points and Kyle Lowry added 20 for the Raptors, who slipped to 25-10. Toronto played without two-time defensive player of the year Kawhi Leonard, as well as Serge Ibaka and Jonas Valanciunas.\n\nAnd it's the absences that had Embiid downplaying the victory.\n\n\"It was a good win, but to me it doesn't mean anything,\" he said.\n\nEmbiid scored 23 of his points in the opening 24 minutes.\n\n\"They really had nothing to stop him in the first half,\" Philadelphia coach Brett Brown said.\n\nLeonard was held out of the lineup to rest on the second game of a back-to-back after scoring a season-high 37 points in the Raptors' 126-110 home win over Cleveland on Friday night. Toronto coach Nick Nurse said prior to Saturday's contest that Leonard may be available for the second game of a back-to-back going forward.\n\nIbaka missed his third straight contest with a sore right knee, while Valanciunas is sidelined for at least three more weeks after having thumb surgery. Lowry and Danny Green returned after missing time with injuries. Lowry sat out the last four contests with a sore left thigh and Green watched Friday's win with a sore left knee.\n\nIt was Philadelphia's third victory in the last 23 games against the Raptors.\n\nThe 76ers, though, would've liked it to come against a full contingent.\n\n\"I was disappointed, too,\" said Simmons, whose point total was a season high.\n\nThe Raptors led by as many as seven in the opening half and were within range entering the break trailing 65-59. But the 76ers took advantage of Toronto's many missing players in the second half, methodically pulling away.\n\n\"A little too much for us tonight,\" Nurse said. \"We just didn't have enough.\"\n\nPhiladelphia led by as many as 25 points in the fourth quarter.\n\nCHRISTMAS PRESENT\n\nThe 76ers next play on Christmas night on Boston, something Embiid and Simmons are eagerly anticipating.\n\n\"I love playing against those guys,\" Embiid said. \"I like their physicality. I like their toughness. It's fun. We're going to have a blast.\"\n\nSaid Simmons: \"I think it's going to be an amazing experience.\"\n\nCHRISTMAS COAL\n\nIn spite of being one of the premier teams in the league, Toronto isn't one of the 10 clubs being featured on Christmas, something Nurse admitted was disappointing.\n\n\"I think it's a marquee day to play,\" he said. \"I think our team would've liked to play.\"\n\nFULTZ UPDATE\n\nThe 76ers are unsure if Markelle Fultz will play again this season.\n\nThe 20-year-old Fultz was diagnosed this month with thoracic outlet syndrome and is doing physical therapy in Los Angeles. General manager Elton Brand said prior to Saturday's game against Toronto that he has no timetable for Fultz's return to basketball activities.\n\nBrand said it was \"to be determined\" if Fultz will play again this season.\n\n\"I can't say right now,\" Brand said.\n\nThe GM expects to update Fultz's situation in \"a few weeks.\"\n\nFultz was the No. 1 overall pick in the 2017 draft, but his career has been sidetracked by injuries and ineffectiveness.\n\nTIP-INS\n\nRaptors: The Raptors won both previous meetings between the teams this season, 129-112 on Oct. 30, and 113-102 on Dec. 5. Both of those games were in Toronto, where the Raptors have won 13 in a row over Philadelphia. . Leonard has never lost in 12 career meetings with Philadelphia.\n\n76ers: Former Eagles receiver Freddie Mitchell rang the ceremonial Liberty Bell in the pregame. . The teams will play once more in the regular season, on Feb. 5 in Philadelphia. ... Embiid, Simmons and Jimmy Butler all received technical fouls.\n\nUP NEXT\n\nRaptors: At Miami on Wednesday.\n\n76ers: Start five-game road trip at Boston on Tuesday night.\n\n---\n\nMore AP NBA: https://www.apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994045.070528
}