{
  "game_id": "0021800916",
  "espn_id": "401071589",
  "date": "Feb 27, 2019",
  "matchup": "MEM vs. CHI",
  "headline": "LaVine's 30 points lead Chicago past Memphis, 109-107",
  "body": "MEMPHIS, Tenn. --  Despite sitting near the bottom of the Eastern Conference, the Chicago Bulls are on a bit of a roll and closed out their best month of the season.\n\nZach LaVine scored 12 of his 30 points in the fourth quarter and the Bulls beat the Memphis Grizzlies 109-107 on Wednesday night. The win was the fourth in five games for Chicago, and the Bulls finished February 5-5, the first time they reached .500 in a month this season.\n\nLauri Markkanen finished with 22 points and 10 rebounds, and Otto Porter Jr. added 20 points for Chicago, which defeated Memphis 122-110 on Feb. 13, a victory that started the Bulls' success over the last half of the month.\n\n\"A hard-fought win for us,\" Bulls coach Jim Boylen said, noting the 20 lead changes and 15 ties. \"I don't like the 33-point fourth (quarter), and I don't like that we lost the boards (46-42), but overall, I thought our defense was pretty darn good.\"\n\nOn a key play in the closing seconds, Memphis was taking the ball out with 17 seconds left and trailing 106-102. As Memphis guard Mike Conley tried to use a screen by Jonas Valanciunas, he fell near midcourt and the inbounds pass sailed past him out of bounds. The turnover gave the Bulls the ball, ending any chance of the Grizzlies overtaking Chicago.\n\nThat led to a postgame rant from Memphis coach J.B. Bickerstaff regarding the lack of respect for Conley.\n\n\"Clear as day, center of the floor, Mike Conley gets tackled,\" Bickerstaff said. The Memphis coach noted if the foul was called, Memphis would have gotten a foul shot and the ball back with a one-possession deficit. He later said of what he perceived as a lack of calls for Conley: \"It's maddening.\"\n\nAvery Bradley led Memphis with 23 points and seven assists, while Conley added 21 points and six assists. Justin Holiday and Valanciunas scored 13 points apiece.\n\nIn game featuring two teams residing near the bottom of their respective conferences, Chicago carried a 75-74 advantage into the fourth after three quarters with 18 lead changes, 14 ties and no team having a lead of more than six points. Chicago extended the lead to 93-85 when Markkanen scored inside with 5:30 remaining.\n\nFrom there, the Bulls maintained leads of five to seven points until a four-point play by Conley tightened things at 103-100 with 1:20 remaining. But Memphis couldn't overtake Chicago, as a 3-pointer at the horn by Valanciunas provided the final margin.\n\n\"We're just learning, and we're trying to get wins,\" Porter said. \"We're trying to build for the future, and trying to start something new.\"\n\nTIP-INS\n\nBulls: G Kris Dunn and F Porter both returned to the lineup after missing Monday's loss to Milwaukee, Dunn with a migraine and Porter with a left shoulder strain. . Wayne Selden reached a career-high four steals in the first half. ... Markkanen has led the Bulls in rebounds 12 of the last 14 games. . Robin Lopez scored two points, ending a string of eight straight games in double figures.\n\nGrizzlies: C/F Ivan Rabb missed the game with right heel soreness. Bruno Caboclo started in his spot. ... Before the game, Conley was awarded the NBA Cares Community Assist Award for January. .Valanciunas has scored in double figures all five games he's played with Memphis since he joined the team in a trade deadline deal.\n\nMORE BICKERSTAFF\n\nBickerstaff's entire postgame press conference -- more than four minutes long -- was on the play where Conley was knocked down in the closing seconds with no call. He repeatedly said the team has talked to the league about the lack of calls for the Memphis point guard, but the Memphis coach sees no change in what he believes is a lack of well-earned respect for Conley. \"This season we've had the same conversation about Mike Conley and nothing has changed,\" Bickerstaff said, later adding: \"I don't know how far we have to go to get results. I'm trying to be respectful of the process. We've done that all year, and it's led to absolutely nothing. It's led to no change.\" Bickerstaff went on to emphasize that a player like Conley is the kind of person the league should want to promote. \"He's not the type of person you want to continually disrespect.\"\n\nUP NEXT\n\nBulls: Travel to Atlanta on Friday to face the Hawks.\n\nGrizzlies: Face the Mavericks in Dallas on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994906.6843488
}