{
  "game_id": "0022400050",
  "espn_id": "401703419",
  "date": "Dec 03, 2024",
  "matchup": "PHI @ CHA",
  "headline": "Paul George, Tyrese Maxey lead 76ers over Hornets 110-104 to earn first first back-to-back wins",
  "body": "CHARLOTTE, N.C. -- — Paul George scored 29 points, Tyrese Maxey had eight of his 21 points in the final 30 seconds and the Philadelphia 76ers won back-to-back games for the first time this season with a 110-104 victory over the Charlotte Hornets on Tuesday night.\n\n\r\n              Jared McCain added 17 points off the bench and Kelly Oubre scored 14 for Philadelphia (5-14), which finished 2-2 in Group A NBA Cup play. Charlotte was 0-4. Neither team advanced out of pool play.\n\n\r\n              Brandon Miller had 34 points, and Nick Richards had a strong outing in his second game back from injury with 22 points and 14 rebounds. Charlotte (6-15) finished its homestand 0-5.\n\n\r\n              The Hornets got solid performances from both rookie draft picks as Tidjane Salaun recorded his first double-double with 10 points and 10 rebounds and K.J. Simpson added eight points, nine assists and six rebounds.\n\n\r\n              Philadelphia led by double digits most of the game, but Charlotte rallied to take the lead with 1:32 left on Miller's seventh 3-pointer of the second half. But it was short-lived as Maxey's layup with 29.7 seconds put the 76ers ahead. \n\n\r\n              Maxey sealed the win with four more throws and a transition layup.\n\n\r\n              Takeaways\r\n              76ers: Philadelphia seems to be rounding into form with its third win in five games. The ball isn't sticking as much, which resulted in more open shots against the Hornets. \n\n\r\n              Hornets: Center Mark Williams returned to the court for the first time in nearly a year. Williams had four points and three rebounds and looked rusty in his first game since Dec. 8, 2023.\n\n\r\n              Key moment\r\n              Trailing by 2, Miller missed a floater that would have tied the game. \n\n\r\n              Key stat\r\n              George was 10 of 16 from the field and 6 of 9 from beyond the arc.\n\n\r\n              Up next\r\n              The 76ers host the Magic on Wednesday night. The Hornets visit the Knicks on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998223.5679061
}