{
  "game_id": "0021500292",
  "espn_id": "400828179",
  "date": "Dec 05, 2015",
  "matchup": "CHI vs. CHA",
  "headline": "Batum scores 24 as Hornets beat Bulls 102-96",
  "body": "CHICAGO --  Charlotte coach Steve Clifford wanted his team to play more physical. The absence of injured center Al Jefferson posed a challenge, but the Hornets responded.\n\nNicolas Batum scored 12 of his 24 points in the fourth quarter, and Charlotte beat the Chicago Bulls 102-96 on Saturday night.\n\n\"So much of it again is the approach,\" Clifford said. \"When we got on the bus this morning, I didn't know if we were going to win, but I knew we were going to play well. It was just the way they were. It was detailed. They were intense.\"\n\nCody Zeller and Kemba Walker had 17 points apiece for the Hornets, who played their first road game since Nov. 17 in New York. Spencer Hawes added 14 points and Batum also grabbed 11 rebounds.\n\nCharlotte was coming off a 116-99 home loss to NBA-leading Golden State on Wednesday.\n\n\"I just wanted to come in aggressive and be physical,\" Zeller said. \"We kind of lacked physicality against Golden State. So it was a focus for our whole team. We came with a lot of energy.\"\n\nJimmy Butler scored 25 points and Derrick Rose had 19 for the Bulls, who fell to 7-2 at the United Center.\n\n\"Defensively, we just weren't there tonight,\" Rose said. \"It's fixable, though.\"\n\nBatum hit a tiebreaking 3-pointer and was fouled with 5:00 left but missed the free throw. Butler went to the line after he was fouled on a 3-point attempt and made all three free throws before Batum made another 3 for a 94-91 lead.\n\n\"My shots were made off great passes and great screens,\" Batum said. \"I was wide open every time.\"\n\nChicago and Charlotte were tied at 94 before Zeller made two free throws and Walker hit a jumper with 28.9 seconds remaining. Butler turned the ball over on a bad pass with 24.9 seconds left, and Walker and Batum combined to make four free throws as Charlotte pulled away.\n\nLed by Batum, the Hornets outscored the Bulls 30-21 in the fourth quarter.\n\n\"We got to stick together, especially with Al out,\" Batum said. \"There are a lot of good teams in the East. We proved it tonight against Chicago that we're a good team.\"\n\nBoth teams shot 41.6 percent from the field. Charlotte was 18 for 25 from the free-throw line, while Chicago was 13 for 19.\n\n\"We missed some really, really good looks,\" Bulls coach Fred Hoiberg said. \"Even Doug (McDermott) and Jimmy there at the end, they had great looks that hit every part of the rim and bounced out. But our movement is getting better, just got to sustain it.\"\n\nMANY GAMES\n\nChicago center Pau Gasol became the 116th player to reach 1,000 regular-season games. He had 13 points and 11 rebounds for his ninth double-double.\n\nTIP-INS\n\nHornets: Jefferson (left calf strain) and F Michael Kidd-Gilchrist (right shoulder surgery) sat out. Jefferson is expected to be out two to three weeks. ... Associate head coach Patrick Ewing missed his second game while recovering from a minor knee procedure.\n\nBulls: F Nikola Mirotic passed league concussion protocols and returned to the starting lineup after suffering a concussion and facial laceration Wednesday against Denver. . G Kirk Hinrich (left hip pointer) returned to action after missing two games. . Rose entered with six 3-pointers this season. He hit a season-high three against Charlotte. He shot 8 for 17 from the field after coming into the game with a 34.3 shooting percentage. ... McDermott scored 13 points.\n\nUP NEXT\n\nHornets: Host Detroit on Monday.\n\nBulls: Host Phoenix on Monday.",
  "source": "espn_api",
  "crawled_at": 1764993964.2564118
}