{
  "game_id": "0021501218",
  "espn_id": "400829105",
  "date": "Apr 13, 2016",
  "matchup": "TOR @ BKN",
  "headline": "Raptors rest starters, beat Nets 103-96 in playoff tuneup",
  "body": "NEW YORK -- With Kyle Lowry and DeMar DeRozan not around, a rookie was one of the most experienced players for the Toronto Raptors.\nNorman Powell may be carrying a Disney princess backpack as a first-year player's initiation, but he's got 24 starts in the NBA.\nAnd he gave the Raptors all the leadership they needed Wednesday night.\nPowell scored a career-high 30 points and the Raptors wrapped up the best regular season in franchise history by beating the Brooklyn Nets 103-96.\n\nWith the No. 2 seed in the Eastern Conference already secured, the Raptors didn't even bring All-Star guards Lowry and DeRozan, plus Jonas Valanciunas, James Johnson and DeMarre Carroll to the game.\nSo Bruno Caboclo, Lucas Nogueria, and Delon Wright all made their first starts and quickly trailed 12-0 and 21-4.\n\"I was just trying to talk to them, help them out in a way I saw because I know how it feels to be getting that first start and being just thrown into the fire like that,\" Powell said. \"So it was tough first couple of minutes, but calmed everybody down and we just focused on making plays.\"\nThe Raptors finished 56-26 after coming into the season as the only NBA team that had never previously even won 50.\nThey will open the postseason at home against the No. 7 seed Indiana Pacers this weekend, and coach Dwane Casey said the victory was important to keep the momentum going into it.\n\"You want to go in with positive vibe, with your defense playing a certain way, your offense playing a certain way,\" Casey said. \"You don't want to go in the way we started the game, and so the positives always outweigh the negatives and winning is always a positive.\"\nPowell added nine rebounds and five assists, while Terrence Ross had 24 points and 10 rebounds. Wright scored 18 points.\nBojan Bogdanovic scored 29 points for the Nets, who lost their final 10 games and finished 21-61.\n\"Somebody's got to lose. It just so happened to be us. We just figure that out,\" rookie Rondae Hollis-Jefferson said.\nPowell responded from his scoreless first quarter by making all six shots, including four 3-pointers, in a 16-point second. The Raptors outscored the Nets 33-21 in the period and led 49-47 at halftime.\nThe Raptors then pulled away in the third quarter and turned away a Nets rally in the fourth.\nTIP-INS\nRaptors: Casey predicted a tough series with the Pacers, saying \"they spanked us really good at their place\" and calling Monta Ellis a \"human scoring machine.\" \"So we have our work cut for us,\" he added. \"I think it'll be an exciting series from both sides. I think we're prepared, they're prepared, so it's going to be an exciting series. ... Powell came in averaging 13.1 points in April, second among East rookies. His 8.8 average since the All-Star break with 10th among all rookies.\nNets: Bogdanovic tied his career high with seven 3-pointers. He also had seven against Sacramento on Feb. 5. ... The Nets' 12-0 lead came two nights after they trailed 20-0 at the start of a 120-111 loss to Washington.\nCOACH CASEY\nGeneral manager Masai Ujiri told reporters in Toronto earlier Wednesday that he believed Casey should remain as Raptors coach even if they lose again in the first round. Casey said he hadn't heard the comments but called them \"flattering.\"\n\"I think we have done what was asked of us for our program over the last five years, building a program. We're not a finished product. Developing young players, at the same time winning is very difficult to do,\" Casey said, \"but again, winning and advancing in the playoffs I know is a measuring stick, but I don't think it's an end all. I think we've done a lot here for the program, with the program and we're not finished yet and not satisfied yet.\"\nTONY'S TAKE\nBrown said he enjoyed his time as Nets interim coach after replacing the fired Lionel Hollins in January.\n\"Would have definitely liked to have won more games, no question, any coach that's running a team would like that,\" Brown said. \"But also I was challenged with trying to play a different way with the same group of guys and ownership wanted a more entertaining style of basketball and hopefully I fulfilled that.\"",
  "source": "espn_api",
  "crawled_at": 1764994683.408488
}