{
  "game_id": "0022300572",
  "espn_id": "401585200",
  "date": "Jan 17, 2024",
  "matchup": "MIL @ CLE",
  "headline": "Donovan Mitchell scores 31 points as Cavaliers thrash Giannis-less Bucks 135-95 for 6th win in a row",
  "body": "CLEVELAND -- — Donovan Mitchell had 31 points and the Cleveland Cavaliers took advantage of Milwaukee being without superstar Giannis Antetokounmpo to extend their winning streak to a season-best six games by pounding the Bucks 135-95 on Wednesday night.\n\n\r\n              Antetokounmpo sat with a bruised right shoulder, an injury that kept him out of the lineup for the first time in 29 games — the second longest streak of his career. The two-time MVP is not expected to be out for an extended period.\n\n\r\n              The Bucks had better hope not.\n\n\r\n              The Cavs, who have made a surprising push despite being without two starters, held Milwaukee to 2 points in the first six minutes and a season-low for a game.\n\n\r\n              “Our defense, that’s where it started,” said Cleveland center Jarrett Allen. “We really set the tone.”\n\n\r\n              Georges Niang made 13 of 14 shots and added a career-high 33 points — 20 in the first half — for the Cavs, who improved to 11-3 since losing Darius Garland (broken jaw) and Evan Mobley (knee surgery) with injuries last month. \n\n\r\n              Allen added 21 points and 13 rebounds — his 10th straight double-double — for Cleveland, which opened a 22-2 lead and never looked back.\n\n\r\n              On a night when the Bucks were missing Antetokounmpo's presence along with his 31 points and needed someone to step up, no one did.\n\n\r\n              Damian Lillard, who hit a 3-pointer at the overtime buzzer to beat Sacramento on Sunday, led Milwaukee with 17 points on just 7 of 20 shooting. Khris Middleton had two points, going 1 of 10 from the field.\n\n\r\n              “Tough night collectively, but we’ve got to find the energy from the jump, especially being short-handed,” Bucks coach Adrian Griffin said. ”You have to learn from this because you can’t allow this to happen again, especially at the start of the game.\n\n\r\n              \"Before we looked up, we were down 20. We would literally come down and just shoot.”\n\n\r\n              The injuries to Garland and Mobley threatened to derail Cleveland's season. However, the opposite has happened as the Cavs have played better at both ends without them and moved among the Eastern Conference's top teams.\n\n\r\n              “At that point in time, you've got a decision to make: You quit or you fight,” said Cavs coach J.B. Bickerstaff. “And I never expected this group of guys to quit. The fight came and the results have been what they've been.”\n\n\r\n              Any thought Milwaukee had of staging a comeback ended in the second quarter, when Niang made four 3-pointers, his last giving the Cavs a 55-30 lead.\n\n\r\n              During a timeout while Niang was on his tear, the Cavs showed a video tracing his journey to the NBA on the arena's scoreboard.\n\n\r\n              “I learned a lot about him today on the Jumbotron — and on the court,” Allen cracked. “Two thousand plus points in high school, and that’s not easy to do. He really showed why he had that many points in high school tonight.”\n\n\r\n              Cleveland's lead swelled to 40 in the third quarter before Griffin pulled his starters and cleared his bench, bringing in seldom used Thanasis Antetokounmpo, Giannis' younger brother.\n\n\r\n              It was the first of three games between the Bucks and Cavs in nine days. They'll play on Jan. 24 and Jan. 26 in Milwaukee.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Detroit on Saturday. \n\n\r\n              Cavaliers: At Atlanta on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996371.583128
}