{
  "game_id": "0022400577",
  "espn_id": "401705143",
  "date": "Jan 17, 2025",
  "matchup": "ORL @ BOS",
  "headline": "Jayson Tatum scores 30 as Celtics break out of shooting slump in 121-94 win over Magic",
  "body": "BOSTON -- — Jayson Tatum scored 30 points and the Boston Celtics ran past the Orlando Magic 121-94 on Friday night.\n\n\r\n              With freshman star Cooper Flagg and his Duke teammates looking on from the stands, Tatum, a former Blue Devils standout, went 12 of 21 from the floor to help Boston break out of a recent shooting slump. No. 3 Duke plays at Boston College on Saturday.\n\n\r\n              Boston shot a season-best 61% in the first half and took a 12-point lead into halftime. The Celtics shot 53% on the night, including 46% from 3-point range, and led by 27 in the second half. Kristaps Porzingis finished with 23 points on 7-of-10 shooting. Jaylen Brown added 20.\n\n\r\n              Cole Anthony led Orlando with 23 points, and Paolo Banchero scored 21.\n\n\r\n              Takeaways\r\n              Magic: Banchero was inadvertently hit in the face by Porzingis on a block attempt. Banchero briefly stayed down and was attended to by trainers, but was able to remain in the game.\n\n\r\n              Celtics: Started fast and dictated the flow on offense throughout, something they struggled to do consistently while losing seven of their previous 14 games. \n\n\r\n              Key moment\r\n              Orlando scored the first five points of the third quarter to get within 66-59. Boston responded with an 8-0 run and outscored the Magic 30-22 in the period to take control. \n\n\r\n              Key stat\r\n              The Celtics entered shooting an NBA-worst 28% from the 3-point line in their previous five games. They found their range against the Magic, going 9 of 15 from beyond the arc in the first half and 17 of 37 for the game.\n\n\r\n              Up next\r\n              The Magic host the Denver Nuggets on Sunday. The Celtics host the Atlanta Hawks on Saturday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997874.8199658
}