{
  "game_id": "0022400593",
  "espn_id": "401705159",
  "date": "Jan 19, 2025",
  "matchup": "ORL vs. DEN",
  "headline": "Nikola Jokic's triple-double leads Nuggets past Magic 113-100",
  "body": "ORLANDO, Fla. -- — Nikola Jokic had 20 points, 14 rebounds, 10 assists and three blocks without playing the fourth quarter and the Denver Nuggets rolled to a 113-100 win over the Orlando Magic on Sunday night.\n\n\r\n              Christian Braun added 20 points and 11 rebounds for the Nuggets, who won their six straight road game. Jamal Murray scored 19 points and Michael Porter Jr. had 15 points and six rebounds.\n\n\r\n              Wendell Carter Jr. led Orlando with 16 points and 13 rebounds. Anthony Black came off the bench with 14 points and five assists.\n\n\r\n              Takeaways\r\n              Nuggets: Winning for the sixth time in seven games, the Nuggets shot 52%. They overcame 20 turnovers and 7-of-25 3-point shooting on a night when Jokic, the No. 2 3-point shooter in the NBA at 47.1%, did not attempt a three.\n\n\r\n              Magic: Playing without Jalen Suggs, Goga Bitadze and four other injured players, the Magic lost for the fifth time in six games. The NBA's second-ranked defensive team (in points per 100 possessions) has given up 122, 121 and 113 points in its last three games.\n\n\r\n              Key moment\r\n              Murray scored 10 straight points over the final 1:35 of the third quarter, turning an 83-77 Denver lead into a 16-point lead. Three of his baskets came on assists from Jokic, who finished the period with his 18th triple-double of the season.\n\n\r\n              Key stat\r\n              Led by Jokic and Braun (11), the Nuggets had a 57-40 rebound edge over the Magic, who are 3-15 when outrebounded this season.\n\n\r\n              Up next\r\n              The Nuggets host Philadelphia on Tuesday night. The Magic visit Toronto on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997873.483168
}