{
  "game_id": "0022200355",
  "espn_id": "401468510",
  "date": "Dec 05, 2022",
  "matchup": "TOR vs. BOS",
  "headline": "Tatum has 31, Celtics beat Raptors 116-110 for 7th win in 8",
  "body": "TORONTO -- — Jayson Tatum had 31 points and 12 rebounds, Jaylen Brown scored 22 points and the Boston Celtics won for the seventh time in eight games, beating the Toronto Raptors 116-110 on Monday night.\n\n\r\n              Defensive Player of the Year Marcus Smart scored 18 points for Boston after sitting out Sunday’s win at Brooklyn because of a bruised left hip.\n\n\r\n              “We’ve been the best team in the league for a minute and every night throws a different challenge at us,” Smart said.\n\n\r\n              Blake Griffin scored 13 points and Luke Kornet had 11 for the Celtics, who own the NBA’s best record at 20-5.\n\n\r\n              “20 and five, that’s big,” Tatum said. “That’s kind of how we wanted to start the season.”\n\n\r\n              Boston has gone 16-2 since starting the season 4-3.\n\n\r\n              Pascal Siakam scored 29 points, Scottie Barnes had 21 and Gary Trent Jr. 20, but Toronto lost for the first time in four home games. The Raptors are 9-3 north of the border this season.\n\n\r\n              Al Horford sat out the second game of Boston’s back-to-back because of a sore lower back, while guard Malcolm Brogdon was unavailable because of a non-COVID illness.\n\n\r\n              Tatum had 17 points in the third as the Celtics took the lead for good by outscoring Toronto 35-18.\n\n\r\n              “It just shows who we are,” Smart said. “No matter what we go through, we’re not going to make any excuses. We’re going to continue to play and we’re going to own up to whatever happens.”\n\n\r\n              Celtics interim coach Joe Mazzulla said he was pleased with the way his short-handed team responded after falling behind in the first half.\n\n\r\n              “You have to play the back-to-backs. You can’t run from them,” Mazzulla said. “Just have the right mindset. I thought our guys did a great job of fighting to stay in the game in the first half.”\n\n\r\n              Boston is 5-0 in the second game of back-to-backs this season.\n\n\r\n              Raptors guard Fred VanVleet shot 3 for 14 and scored eight points. He missed a 3-pointer that would have cut the gap to three points with less than 2 minutes remaining.\n\n\r\n              “We need to make a few more open shots when they’re generated,” Raptors coach Nick Nurse said.\n\n\r\n              Before the game, Nurse said he wanted to see how his team matched up against the league-leading Celtics, but several costly turnovers in the final period denied Toronto a chance to make it close.\n\n\r\n              “That was there to be had tonight,” Nurse said. “We didn’t make the plays.”\n\n\r\n              The Celtics were up 27-25 after one quarter but the Raptors led 62-56 at the half.\n\n\r\n              Boston reclaimed the lead at 71-69 on Tatum’s 3-pointer with 7:09 left in the third quarter. The Celtics took a 90-81 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Brown had eight rebounds and eight assists. … Improved to 4-0 against Atlantic Division opponents and 9-3 on the road. … Made just two turnovers in the second half.\n\n\r\n              Raptors: O.G. Anunoby scored 13 points … F Juancho Hernangomez (sprained right ankle) was not available. Hernangomez left injured in Saturday’s win over Orlando. … F Precious Achiuwa (right ankle) missed his 12th straight game while F Otto Porter Jr. (dislocated toe, left foot) missed his ninth straight.\n\n\r\n              DYNAMIC DUO\n\n\r\n              Brown extended his career-high stretch of games with 15 or more points to 15, while Tatum recorded his team-leading 12th double-double.\n\n\r\n              “We understand what we have with those two guys, the gems we have,” Smart said. “We don’t take them for granted.”\n\n\r\n              IN THE CROWD\n\n\r\n              Former NFL quarterback Colin Kaepernick and former Raptors star Donyell Marshall each attended the game. Kaepernick received a loud ovation when he was introduced after the first quarter.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Visit the Phoenix Suns on Wednesday night.\n\n\r\n              Raptors: Host the Los Angeles Lakers on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994084.3393312
}