{
  "game_id": "0021900948",
  "espn_id": "401161590",
  "date": "Mar 08, 2020",
  "matchup": "LAL @ LAC",
  "headline": "LeBron & Co. snap Clippers' streak at 6 with 112-103 victory",
  "body": "LOS ANGELES --  LeBron James closed out a weekend to remember. First, he outdueled Giannis Antetokounmpo and the Milwaukee Bucks in a match-up of NBA conference leaders. Then he kept the Los Angeles Lakers rolling with a victory over the streaking Clippers.\n\nJames had 28 points, seven rebounds and nine assists Sunday in 112-103 victory that ended the Clippers' six-game winning streak. He put up 37 points, eight rebounds and seven assists Friday against the Bucks.\n\n\"His best weekend in a Lakers uniform I'm assuming,\" first-year coach Frank Vogel said. \"I wasn't here last year but, in my mind, this was the best two-game stretch. Really just dominated both games and helped close them out.\"\n\nThe Lakers won their fourth in a row and 11th in 12 games. Anthony Davis scored 30 points and Avery Bradley added 24.\n\n\"It's a really good weekend for us, playing against two of the best teams, the top two teams in the league with us as far as record-wise,\" James said. \"I just think we kept our composure throughout the whole game.\"\n\nThe Lakers recently clinched a playoff berth for the first time since 2013, and it's possible they could meet the Clippers in the postseason. The crowd made it feel like a playoff atmosphere, with a strong contingent of raucous Lakers fans on hand for what was a Clippers' home game. They chanted \"MVP! MVP!\" when James completed a 3-point play that tied the Lakers' largest lead of 12 points with 40 seconds to play.\n\nThe Clippers led 53-49 at halftime with their largest lead of nine coming in the second quarter.\n\n\"Just trying to come out in the second half and not let the game get away from us,\" Davis said. \"We wanted to make sure we come out with a little bit more offensive intensity and aggression.\"\n\nPaul George scored 31 points, Kawhi Leonard added 27 and Montrezl Harrell had 20 for the Clippers. They lost to the Lakers for the first time in three games this season.\n\nWith the Lakers up by four points, James hit a 3-pointer to open the fourth. His 3-point play and a basket by Davis capped a 14-6 run that pushed it to 99-87, their first double-digit lead of the game.\n\n\"The first time we played Milwaukee and the previous two times we played the Clippers we beat ourselves,\" Davis said. \"When we don't do that -- get a shot on goal every time and don't turn the ball over -- then we're a tough team to beat.\"\n\nThe Clippers had more turnovers (15) than assists (12).\n\n\"When you don't move the ball on top of that you can't win the game,\" Rivers said.\n\nGeorge and Leonard combined to score 12 straight points during a stretch in the fourth, but they could never get a sustained run going.\n\n\"They were the team that really wanted it and they went and got it,\" George said. \"It's hard to beat any team three times in a row in this league. It doesn't set us back.\"\n\nBradley hit four of his season-high six 3-pointers in the third, helping the Lakers take their first lead since the opening quarter.\n\nTIP-INS\n\nLakers: They improved to 20-2 on the road against West opponents. ... Their earlier losses to the Clippers were by 10 and 5 points.\n\nClippers: They fell to 10-1 in games when their entire roster is healthy, a rarity this season. ... Joakim Noah was greeted warmly by fans while watching the game from several rows up. Rivers let his name slip during his pregame comments but declined to address reports the team will sign Noah to a 10-day contract this week.\n\nBROTHER VS BROTHER\n\nMarcus Morris Sr. started for the Clippers and scored one point in 29 minutes to go with six rebounds, one assist and five fouls. His brother Markieff came off the bench for the Lakers and scored four points in 16 minutes. He had five rebounds and three fouls.\n\nUP NEXT\n\nLakers: Host Brooklyn on Tuesday night in the first of three home games this week.\n\nClippers: At Golden State on Tuesday night, a team the Clippers are 2-0 against this season.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995967.984535
}