{
  "game_id": "0022400425",
  "espn_id": "401704991",
  "date": "Dec 27, 2024",
  "matchup": "PHX vs. DAL",
  "headline": "Kyrie Irving scores 20, Mavs win first game after Doncic's injury by beating the Suns 98-89",
  "body": "PHOENIX -- — Kyrie Irving scored 20 points, Daniel Gafford added 16 and the Dallas Mavericks won their first game since star Luka Doncic was injured, beating the Phoenix Suns 98-89 on Friday night.\n\n\r\n              Kevin Durant scored 35 points for the Suns, who have lost four of their past five games.\n\n\r\n              Doncic is expected to miss about a month with a calf injury suffered in the team’s Christmas Day loss to Minnesota. The Mavs were left further short-handed on Friday in the third quarter after forwards Naji Marshall and P.J. Washington — along with Phoenix's Jusuf Nurkic — were ejected after a brief fight.\n\n\r\n              The Mavs persevered anyway thanks to a balanced effort on both ends of the floor. Dallas never trailed and led by as many as 18. Spencer Dinwiddie and Maxi Kleber each scored 15 points and Klay Thompson added 11.\n\n\r\n              Dallas took a 55-39 lead by halftime, led by Irving's 15 points. The Suns shot just 33.3% over the first two quarters.\n\n\r\n              Takeaways\r\n              Mavericks: It was a gritty win for the Mavs, who controlled the game from the outset despite playing without Doncic. Irving made just 6 of 21 shots overall, but 5 of 10 from behind the arc.\n\n\r\n              Suns: Two days after a galvanizing win on Christmas Day over the Nuggets, the Suns went right back to mediocrity. Part of the problem is the absence of injured All-Star Devin Booker, but as the Mavericks showed on Friday, teams can still have a level of success without one of their stars.\n\n\r\n              Key moment\r\n              The Suns briefly cut the Mavs advantage to 81-75 midway through the fourth, but Dallas' Quentin Grimes responded with a tough 3-pointer to push the lead back to nine.\n\n\r\n              Key stat\r\n              The Suns have a 7-14 record since starting the season at 8-1.\n\n\r\n              Up next\r\n              Mavericks at Trail Blazers on Saturday; Suns at Warriors on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998331.835165
}