{
  "game_id": "0022401078",
  "espn_id": "401705644",
  "date": "Mar 29, 2025",
  "matchup": "MEM vs. LAL",
  "headline": "Reaves, Doncic lead Lakers to 134-127 victory over Grizzlies, spoiling Iisalo's debut",
  "body": "MEMPHIS, Tenn. -- — Austin Reaves had 31 points and eight assists, Luka Doncic added 29 points and nine assists and the Los Angeles Lakers held on for a 134-127 win over Memphis on Saturday night in the Grizzlies' first game under interim coach Tuomas Iisalo.\n\n\r\n              LeBron James scored 25 points as the Lakers led by 20 points in the first half, but squandered the advantage to make it a close game in the fourth quarter.\n\n\r\n              Desmond Bane led Memphis with 29 points, while Jaren Jackson Jr. added 24 points. Ja Morant finished with 22 points and 10 assists.\n\n\r\n              Iisalo took over Friday night hours after Memphis fired Taylor Jenkins, the winningest coach in franchise history, with nine games left in the regular season.\n\n\r\n              Takeaways\r\n              Lakers: While the Lakers had played well in their previous 36 games, they came in losers of four of their last five, including a last-second loss at Chicago on Thursday night. The game was close but did not have the late drama.\n\n\r\n              Grizzlies: Memphis went 1-4 on a five-game road trip coming back home still reeling after the first of three games in four nights. \n\n\r\n              Key moment\r\n              The teams exchanged the lead through the middle part of the fourth quarter when Doncic entered with about eight minutes left. After four straight points from Doncic and a 3-pointer from Dorian Finney-Smith, the Lakers had retaken the lead.\n\n\r\n              Key stat\r\n              Midway throught the second quarter, the Lakers had made a dozen 3-pointers and were shooting at 55% as they built the lead to 20 before Memphis cut into the advantage to trail 72-61 at halftime. The Lakers ended up making 19 3-pointers, one short of their season-high.\n\n\r\n              Up next\r\n              Both teams play at home Monday night, the Lakers entertaining the Rockets, and the Grizzlies playing host to Boston.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997718.3870049
}