{
  "game_id": "0021500896",
  "espn_id": "400828783",
  "date": "Mar 01, 2016",
  "matchup": "LAL vs. BKN",
  "headline": "Russell gets 39 points, Lakers end skid with win over Nets",
  "body": "LOS ANGELES -- After D'Angelo Russell stopped well behind the line and drilled his eighth 3-pointer in the final seconds, he pointed at his forearm and mouthed his words clearly enough for all of Hollywood to understand.\n\"Ice!\" the 20-year-old rookie said. \"In my veins!\"\nNobody could argue about Russell's cool on a spectacular night for the Los Angeles Lakers' next big thing.\nRussell scored 16 of his 39 points in the fourth quarter, and the Lakers snapped their eight-game losing streak with a 107-101 victory over the Brooklyn Nets on Tuesday.\n\nWhile Kobe Bryant sat out with a sore right shoulder, the Lakers got a remarkable game from the No. 2 overall pick in the draft. Russell went 14 for 21 from the field and repeatedly hit difficult, devastating shots. The display thrilled fans who hope Russell is ready to step into Bryant's shoes after an up-and-down start to his career on the Western Conference's worst team.\n\"Before the game, my dad texted me,\" Russell said. \"He was just like, `Are you hungry?' I was like, `Hungry?' And he was like, `Eat.' OK, I know what you mean. I guess I give credit to that.\"\nRussell hit a 3-pointer with 53 seconds left and his career-best eighth with 30 seconds to play. His 39 points were the most by any NBA rookie this season and the most by a Lakers rookie in a regular-season game since Elgin Baylor had 55 back on March 11, 1959.\n\"He just had one of those games where everything seemed to be falling in place for him,\" Lakers coach Byron Scott said.\nRussell hasn't seemed to lack for confidence since arriving on the West Coast from Ohio State, but he's living up to his own lofty expectations recently. He laughed at the memory of his demonstrative response to his eighth 3-pointer.\n\"To be honest, I was running out of celebrations,\" Russell said. \"I thought of one, and it was the first thing that came to my mind.\"\nJordan Clarkson added 16 points, seven assists and seven rebounds as the Lakers swept their season series with Brooklyn. Los Angeles hung on for its first victory since Feb. 4 and just its fourth win in 26 games since Jan. 3.\nBrook Lopez had 23 points before fouling out with 2:43 left for the Nets, who fell to 2/3 on their nine-game trip with back-to-back losses at Staples Center.\n\"We didn't play well, and they got going, so it's on us,\" Lopez said. \"We played selfish. All things considered, we still had a shot and we got some good looks. We had opportunities to get back into the game, but it just never happened.\"\nThaddeus Young had 19 points and 15 rebounds for Brooklyn. Bojan Bogdanovich scored 18 in his fourth straight start since the Nets parted ways with Joe Johnson.\nGETTING HELP\nRussell's eventful rookie season is on the rise after three straight games with at least 22 points. With Clarkson and Marcelo Huertas serving as playmakers, Russell slid into a scoring role and repeatedly hurt the Nets from the perimeter.\n\"Tonight was just my night, and it shows what we're capable of,\" Russell said.\nThe Lakers also had their best defensive game in a long while, holding the Nets to the fewest points by a Los Angeles opponent in seven games.\nALL EYES ON KOBE\nBryant watched from the bench in a black suit on his bobblehead night at Staples Center, missing his second straight game. Lakers coach Byron Scott said Bryant hopes to play Wednesday night in Denver.\nTIP-INS\nNets: Former Lakers guard Wayne Ellington started despite being questionable after getting evaluated for a possible concussion. Ellington took an inadvertent elbow to the head from DeAndre Jordan in a loss Monday night to the Clippers.\nLakers: Lou Williams moderately strained his left hamstring late in the first half and didn't return. He also didn't travel to Denver after the game. Williams scored six points. ... Montreal Canadiens defenseman P.K. Subban attended the game, sitting with Lakers executive Jeanie Buss. The Canadiens face the Ducks and Kings this week.\nUP NEXT\nNets: At Nuggets on Friday night.\nLakers: At Nuggets on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994257.168145
}