{
  "game_id": "0022400235",
  "espn_id": "401704801",
  "date": "Nov 17, 2024",
  "matchup": "MIA @ IND",
  "headline": "Myles Turner scores 34, Pacers avenge Friday's loss to Miami with 119-110 win over Heat",
  "body": "INDIANAPOLIS -- — Myles Turner scored a season-high 34 points, and Bennedict Mathurin added 21 points and 12 rebounds to lead the Indiana Pacers to a 119-110 victory over the Miami Heat on Sunday.\n\n\r\n              Pascal Siakam added 23 points for the Pacers, who shot 52% from the field, and Tyrese Haliburton finished with 16 points and 13 assists.\n\n\r\n              Tyler Herro scored 28 points, and Bam Adebayo had 24 for the Heat, who were without six-time All-Star Jimmy Butler because of a sprained ankle. Miami was outscored 62-28 in the paint.\n\n\r\n              The Pacers bounced back from Friday’s debacle, a 124-111 loss to the Butler-less Heat that coach Rick Carlisle said left him “ashamed.” Indiana never trailed in the rematch.\n\n\r\n              Takeaways\r\n              Heat: Although Butler may return Monday for the start of a three-game homestand, Miami lost Jaime Jaquez in the third quarter due to a sprained right ankle. X-rays were negative, the Heat said. Injuries have been an unfortunate theme in Miami’s 5-7 start.\n\n\r\n              Pacers: Indiana has shown ability to overcome its own injury woes with Mathurin coming into his own. The third-year wing, starting at small forward because of the absence of Aaron Nesmith, has scored at least 20 points in four of his past six games.\n\n\r\n              Key moment\r\n              Haliburton has shot unusually poor (39.3% from the field, 29.4% from long range) to start this season, and that continued Sunday when he missed eight of his first 10 shots. Haliburton atoned by making back-to-back 3-pointers in the fourth quarter after the Heat briefly came back to tie the game at 97.\n\n\r\n              Key stat\r\n              Thirty of the Pacers’ 44 buckets were assisted, and Haliburton and T.J. McConnell combined for 18 assists. In contrast, no Heat player had more than four assists.\n\n\r\n              Up next\r\n              The Pacers visit Toronto on Monday, the same day Miami returns home to face Philadelphia.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998291.1910012
}