{
  "game_id": "0021501107",
  "espn_id": "400828994",
  "date": "Mar 29, 2016",
  "matchup": "CHI @ IND",
  "headline": "Bulls end 4-game skid on Butler's jumper, beat Pacers 98-96",
  "body": "INDIANAPOLIS -- The Chicago Bulls need to win, and they don't care how.\nJimmy Butler made a tiebreaking jumper with 3.7 seconds left, and the Bulls beat the Indiana Pacers 98-96 on Tuesday night to snap a four-game losing streak.\nNikola Mirotic scored 28 points as Chicago (37-37) got back to .500 and pulled within two games of Indiana for the eighth and final playoff spot in the Eastern Conference.\n\n\"We needed this win,\" Butler said. \"It was big for us to get a win here on the road against a playoff team. Hopefully this starts a trend for these last eight or nine games.\"\nMirotic made seven 3-pointers, his final one tying it at 96 with 2:19 remaining.\nThe Pacers missed five shots in the final 2 minutes that would have given them the lead before the Bulls rebounded Pau Gasol's miss with 20 seconds remaining and got the ball to Butler for his 17-footer from the right wing.\nCJ Miles missed a 3-pointer that would have won it as time expired. Paul George had 20 points and nine rebounds for the Pacers, while Ian Mahinmi had 18 points and seven boards.\n\"(Chicago) executed down the stretch,\" a frustrated George said. \"(For us) it was stagnant. Real stagnant. We've got to get better (shots) than that.\"\nButler finished with 14 points, and Gasol added 10 points and 11 rebounds.\nThe game was tied at 84 heading into the fourth quarter, where both teams hit a shooting slump. The Pacers shot 22 percent and the Bulls 26 percent, but outscored Indiana 14-12. The lead changed a total of 14 times throughout the game.\n\"(It was) a really ugly fourth quarter on the offensive end,\" Bulls coach Fred Hoiberg said.\n\"We beat them (with) ball screens in the fourth quarter. We were trying to confuse them and slip them out. (Mirotic) was big time all game long and put the ball in Jimmy's hands at the end. Jimmy rose up and knocked down a big shot.\"\nThe Pacers outscored the Bulls 52-36 in the paint, 15-5 in fast-break points and finished the game with four fewer turnovers, but still managed to lose a crucial game against a division opponent. The Bulls hold the tiebreaker over the Pacers for playoff seeding as the season enters the final two weeks.\nMONEY MIROTIC\nMirotic was 7 of 13 on 3-point attempts and 9 of 18 overall.\nBIG ROLE\nMahinmi has 18 or more points in third consecutive games. With 55 points over his last three games, Mahinmi is having the highest three-game scoring total in his NBA career.\nTIP-INS:\nBulls: All three of Chicago's wins over Indiana this season were by three points or less ... The Bulls won at Indiana for the first time since Dec. 29, 2014.\nPacers: With two 3-pointers, George passed Reggie Miller into second place in franchise history for most 3-point field goals made in a season (197).\nUP NEXT:\nBulls: Visit Houston on Thursday.\nPacers: Host Orlando on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764993899.448776
}