{
  "game_id": "0021500353",
  "espn_id": "400828240",
  "date": "Dec 13, 2015",
  "matchup": "PHX vs. MIN",
  "headline": "Knight's 25 points lead Suns over Timberwolves 108-101",
  "body": "PHOENIX --  To a man, the Phoenix Suns knew Brandon Knight wouldn't suffer through another game of miserable shooting.\n\nAfter shooting 0 for 12 with one point in a loss two days earlier, Knight hit a career-high seven 3-pointers and scored 25 points to lift the Suns over the Minnesota Timberwolves 108-101 on Sunday.\n\nKnight scored nine of his points in the fourth quarter, all on 3s. He was 3 for 24 from long range in his four previous games and 0 for 13 in his last two.\n\n\"It always feels good to see the ball go in the hoop,\" Knight said. \"I'm not going to change the way I've been playing. It was one off night, a really off night. But I'm a very confident person and my teammates always stick behind me.\"\n\nThe Timberwolves committed 25 turnovers, including nine in the third quarter, which helped the Suns get out in transition and take control of the game for good. Phoenix scored 43 points off turnovers for the game.\n\nThat total was the most points off turnovers for the Suns since the statistic was first kept in 1998, according to the Elias Sports Bureau.\n\n\"We gave them opportunities to do what they do,\" Wolves coach Sam Mitchell said. \"If we don't turn the ball over and get shots, maybe the outcome would have been different.\"\n\nZach LaVine led the Wolves with 28 points and Kevin Martin added 19.\n\nThe Suns didn't score for more than 4 minutes during the fourth quarter as Minnesota cut into a 19-point lead, but P.J. Tucker's 3-pointer at the 7:53 mark followed by Eric Bledsoe's steal and dunk gave Phoenix a 90-75 lead.\n\nMinnesota got the lead down to 104-99 on LaVine's 3 with 35 seconds left but never got closer.\n\n\"They are playing until the buzzer, too, so they're not going to let you come back,\" LaVine said.\n\nBledsoe had 23 points with nine assists plus four steals and tied a career high with four blocked shots. Alex Len added 18 points and Jon Leuer scored 12 for the Suns, who have won five of their last six games against the Wolves.\n\n\"We want to play great defense, get stops and get out in transition and run and have fun,\" Bledsoe said.\n\nMinnesota led for much of the first quarter until Knight's 3-pointer with 1:25 to play gave the Suns a 23-21 lead. The Wolves had two impressive dunks in the opening quarter, one for Gorgui Dieng off a no-look bounce pass from Ricky Rubio and the other by LaVine, last season's NBA All-Star Weekend dunk champion.\n\nLen had 10 of his points and made eight free throws in the first quarter for the Suns. But the Timberwolves opened the second quarter ahead 27-25.\n\nThe Wolves trailed by as few as five points in the third quarter, but the Suns surged to a 75-61 lead after a 12-3 run that featured easy dunks for Knight and Len and a double lob from Knight to Bledsoe to Leuer at the 4:12 mark.\n\nPhoenix led 85-66 after three quarters.\n\nTIP-INS\n\nTIMBERWOLVES: Kevin Garnett started Sunday and played against the Suns in a Minnesota uniform for the first time since March 20, 2007. Garnett's two highest-scoring games of his distinguished career came against Phoenix during his first tenure with Minnesota: 47 points in January 2005 and 44 in January 2007. ... Rookie C Karl-Anthony Towns, among the top rookie scorers in the league at 15.2 points per game entering Sunday, was held to eight points.\n\nSUNS: Rookie Devin Booker, age 19, is 17 of 24 on 3-pointers this season. \"The good thing is that he's not taking bad ones,\" Hornacek said. \"Devin is doing the right thing, when the shot is there he's taking it, if not he's driving it and not forcing anything.\" ... C Tyson Chandler entered the game in the first quarter, his first action since Nov. 27 after missing time with a hamstring injury. He finished with three points and four rebounds in 23 minutes.\n\nEARLY TIPOFF TIME\n\nThe game tipped off at 1:40 p.m. local time so that NBA fans in Europe could tune in at a more decent nighttime hour, 8:40 p.m. in England and 9:40 throughout Spain and Central Europe. The Suns and Timberwolves have a number of players from Europe, including Len and Mirza Teletovic for Phoenix and Rubio, Nemanja Bjelica, Damjan Rudez and the injured Nikola Pekovic, who did not play.\n\nUP NEXT\n\nTimberwolves: Host Denver on Tuesday.\n\nSuns: At Dallas on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994869.2284648
}