{
  "game_id": "0021500599",
  "espn_id": "400828486",
  "date": "Jan 15, 2016",
  "matchup": "MIL vs. ATL",
  "headline": "Antetokounmpo scores 28 as Bucks beat Hawks in overtime",
  "body": "MILWAUKEE --  Giannis Antetokounmpo took matters into his own hands in a tense overtime period.\n\nAntetokounmpo finished with 28 points and a career-high 16 rebounds in the Milwaukee Bucks' 108-101 victory over the Atlanta Hawks on Friday night.\n\nHe hit a free throw, scored on a dunk and topped it off by burying a 3-pointer from the corner. Antetokounmpo also blocked a shot and grabbed two rebounds in the extra session.\n\n\"We just played hard and kept executing,\" he said.\n\nHis dunk came off a pass from John Henson to extend Milwaukee's lead to 103-99 with 1:35 left in overtime. After an Atlanta turnover, Antetokounmpo's 3 put the Bucks up by seven.\n\n\"My coaches and my teammates want me to shoot the ball when I am open,\" he said. \"I was open and I shot the ball without even thinking about it.\"\n\nKhris Middleton scored 26 points and Greg Monroe and Michael Carter-Williams added 15 points apiece for the Bucks, who won the first matchup between the teams this season. Carter-Williams also blocked Jeff Teague's shot at the horn, sending the game into overtime.\n\n\"He's a great defender, especially for a point guard, how tall and long he is,\" Middleton said of Carter-Williams. \"We really needed that stop.\"\n\nPaul Millsap had 23 points and Al Horford 18 for Atlanta.\n\nCarter-Williams made a 3-pointer with 3:04 remaining in overtime to put the Bucks ahead 100-99.\n\nKyle Korver made five of six first-half shots, including two from 3-point range, to pace Atlanta to a 51-46 halftime lead.\n\nBut he badly missed a wide-open 3-point attempt with 34 seconds left in regulation and the scored tied at 95. The Bucks then turned over the ball with the shot clock winding down but got to OT when Carter-Williams blocked Teague's shot.\n\nThe Hawks played the entire overtime without Millsap and all but 41 seconds without Kent Bazemore, after they fouled out.\n\n\"Obviously we would have preferred to have (Millsap) and (Bazemore), two of our better players, out there, but I think everybody felt that when overtime started we had enough to win. We just didn't get it done,\" Korver said.\n\nThe Bucks didn't take their first lead of the game until Henson's shot in the lane with about four minutes left in the third quarter put them ahead 66-65.\n\nThe Hawks, who led by as many as 11 and had won six straight in Milwaukee, were 7 of 14 from 3-point range in the first half. Milwaukee shot just 39 percent in the half and missed all five of its 3-pointers.\n\nThe Hawks shot 50 percent and led 28-22 after the first quarter.\n\nTIP-INS\n\nHawks: Swingman Thabo Sefolosha returned to the lineup after missing two games with a sore right wrist. He played 34 minutes. ... Millsap needs four points for 10,000 in his career.\n\nBucks: Guard Jerryd Bayless missed his sixth consecutive game with a sprained left ankle. ... Guard O.J. Mayo sat out after aggravating a left hamstring injury during Wednesday's game at Washington. Mayo missed one game earlier this month with the same injury. He missed 11 games earlier in the season with a right hamstring injury. ... Bucks owner Marc Lasry was chosen to participate in the NBA All-Star celebrity game on Feb. 12 as part of NBA All-Star weekend in Toronto. Lasry played collegiate basketball at Clark University.\n\nIN THE CROWD\n\nHall of Famer and former Bucks star Bob Lanier attended the game. An eight-time All-Star, Lanier played for Milwaukee from 1980-84. Bob Dandridge, who played nine seasons for the Bucks and was a key member of Milwaukee's only NBA championship in 1971, also was on hand.\n\nFLASHBACK FRIDAY\n\nConsidered an innovator of funk music, 74-year-old George Clinton performed on the court at halftime.\n\nHALFTIME HEAVE\n\nAntetokounmpo drew a foul on Millsap while attempting a half-court shot just before halftime. Antetokounmpo made two of three foul shots.\n\nDUNK DEBACLE\n\nWith the Hawks up four with 7:35 remaining, Mike Scott missed a wide-open dunk as he slammed the ball off the back of the rim. The Bucks tied the score a short time later.\n\nUP NEXT\n\nHawks: Host Brooklyn on Saturday night.\n\nBucks: Visit Charlotte on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994057.272667
}