{
  "game_id": "0022301221",
  "espn_id": "401616475",
  "date": "Dec 08, 2023",
  "matchup": "MEM vs. MIN",
  "headline": "Towns scores 24 points, Gobert dominates inside in Timberwolves' 127-103 victory over Grizzlies",
  "body": "MEMPHIS, Tenn. -- — Karl-Anthony Towns scored 24 points, Rudy Gobert had 16 points, 20 rebounds and six blocks and the NBA-leading Minnesota Timberwolves pulled away in the third quarter to beat the Memphis Grizzlies 127-103 on Friday night for their sixth straight victory.\n\n\r\n              Mike Conley added 19 points and seven assists to help Minnesota improve to 17-4. Gobert had 20 rebounds for the second straight game.\n\n\r\n              Troy Brown Jr., who replaced the injured Anthony Edwards early in the game, scored 20 points, connecting on 8 of 10 shots, including 4 of 6 from 3-point range.\n\n\r\n              “I think that's a strength of our team,” Gobert said about the balanced scoring, along with Minnesota's defense. \"We've got a lot of guys that can play. A lot of guys that can score, and we have an unselfish team.\n\n\r\n              Edwards, Minnesota’s leading scorer at 25.7 points a game, left four minutes in because of right hip pointer and didn’t return. Edwards missed two recent games with the same injury.\n\n\r\n              “He came down on it at an odd angle the way he landed, and it kind of flared up on him,” Minnesota coach Chris Finch said. “Hopefully, we can get him back right.”\n\n\r\n              Jaren Jackson Jr. led Memphis with 21 points. Desmond Bane, who had 49 points in Wednesday's win over Detroit added 16, and David Roddy had 13.\n\n\r\n              The Grizzlies are without star guard Ja Morant while he serves a 25-game suspension to start the season. He was penalized for a second online video showing him flashing a handgun. His absence leaves Memphis leaning heavily on Jackson and Bane for the offensive load with a less-than-reliable supporting cast.\n\n\r\n              Part of the Minnesota emphasis against the Grizzlies was controlling the boards. Gobert helped Minnesota to a 54-28 advantage on the glass, including 15 offensive rebounds, nine by Gobert.\n\n\r\n              “They're big, and they use the size to their advantage,” Jackson said about Minnesota's rebounding dominance, later adding: “They seal a lot. They open the floor for each other, and set crazy screens sometimes.”\n\n\r\n              Despite converting only 6 of 21 3-pointers in the half, Minnesota carried a 60-55 lead at the break. The Timberwolves would stretch the advantage to double-digits behind Brown's 11 quick points in the third period, part of Minnesota outscoring Memphis 38-24 in the period.\n\n\r\n              “Troy Brown really gave us a spark,” Finch said.\n\n\r\n              “Honestly, it just feels like I'm playing my game,” Brown said of the spurt. “I'm getting more shots than I normally would. ... They're flying, and if I see one go in, I'm definitely going to keep shooting.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At New Orleans on Monday night.\n\n\r\n              Grizzlies: Host Dallas on Monday night.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/nba\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996034.9126961
}