{
  "game_id": "401810114",
  "espn_id": "401810114",
  "date": "Nov 19, 2025",
  "matchup": "MIN vs WSH",
  "headline": "Randle has 32 points and the Timberwolves hold off the Wizards 120-109",
  "body": "MINNEAPOLIS -- — Julius Randle had 32 points and 10 rebounds and the Minnesota Timberwolves held off a late rally by the Washington Wizards for a 120-109 victory on Wednesday night. \n\n\r\n              The Timberwolves, who have won six of their last seven games, were without forward Jaden McDaniels, who has a sprained left wrist and missed his first game in nearly two years. Naz Reid had 28 points off the bench. \n\n\r\n              Kyshawn George had 23 points for the Wizards, who have lost 12 straight. \n\n\r\n              The Timberwolves led by as many as 27 points, but the Wizards closed the gap in the fourth quarter when George's 3-pointer made it 98-93 with 7:06 to go. \n\n\r\n              Randle's dunk pulled Minnesota away 105-96 with 5:51 left but Khris Middleton's jumper got the Wizards within 106-101. The Timberwolves never surrendered the lead and put the game away on Donte DiVincenzo's 3-pointer that made it 116-106 with 1:29 to go. \n\n\r\n              The reeling Wizards have won just one game this season and there is talk that coach Brian Keefe could be on the hot seat. The only NBA coach dismissed so far this season has been Willie Green, fired Saturday by the New Orleans Pelicans after a 2-10 start. \n\n\r\n              Randle's driving layup put Minnesota up 32-24 late in the first quarter. The Timberwolves pulled away in the second quarter, taking a 50-29 lead on Reid's corner 3-pointer from a no-look pass from Rudy Gobert. Randle's emphatic dunk made it 61-37 and Minnesota led 71-46 at halftime. \n\n\r\n              The Wizards opened the half on a 10-2 run then closed the gap to 78-67 on Marvin Bagley III's short jumper midway through the third quarter as they mounted their rally. \n\n\r\n              McDaniels was averaging a career-best 17.5 points per game when he left Monday’s 120-96 win over Dallas on Monday late in the third quarter. \n\n\r\n              Up Next\r\n              The Wizards visit the Raptors on Friday. \n\n\r\n              The Timberwolves visit the Phoenix Suns on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042656.383641
}