{
  "game_id": "0022300848",
  "espn_id": "401585476",
  "date": "Feb 28, 2024",
  "matchup": "LAL @ LAC",
  "headline": "LeBron scores 34 points, leads Lakers' rally from 21-point deficit in 116-112 win over Clippers",
  "body": "LOS ANGELES -- - LeBron James scored 19 of his 34 points during a brilliant fourth quarter, leading the Los Angeles Lakers back from a 21-point deficit for a dramatic 116-112 victory over the Los Angeles Clippers on Wednesday night.\nKawhi Leonard missed a 12-footer with five seconds to play, and James threw a long pass to Cam Reddish for a dunk that punctuated a stunning victory for the Lakers in the rivals' final regular-season game as co-tenants of their downtown arena.\nThe 39-year-old James was the center of it all, hitting five of his season-high seven 3-pointers while outscoring the Clippers by himself in the fourth quarter (19-16). He either scored or assisted on 11 of the Lakers' 13 baskets in the final period.\n\"It's just a feeling when you feel like everything you put up is going in,\" James said. \"I just kept it consistent. I wasn't taking ill-advised shots. I stayed in the course of the offense. My teammates did a great job of continuing to find me, and I just tried to dictate the tempo, dictate the game. ... It's just a zone. Can't really describe it. Wish you could stay in it forever.\"\nLeonard scored 26 points and James Harden had 23 points and nine assists for the Clippers, who lost back-to-back games for the first time since Dec. 23 after committing seven turnovers and allowing 39 points in that calamitous fourth quarter. The Clippers played without All-Star Paul George, who missed his second straight game with a sore left knee, and starting center Ivica Zubac, who was ill.\n\"It's one game,\" Clippers coach Tyronn Lue said. \"Played well for three quarters. Didn't finish the game. I never let one loss or a bad loss take away from what we've been doing and what we've built. It's a tough loss because we were up 21 points, but this is a good team, and when you don't take care of the basketball and you don't do what you're supposed to do, you lose.\"\nThe Clippers led 98-77 in the opening minute of the fourth quarter, but James led a 29-8 run in just 7:34. Anthony Davis' free throws tied it at 106- with four minutes to play, and James found Rui Hachimura for a go-ahead 3-pointer moments later.\nD'Angelo Russell's 3-pointer put the Lakers up 114-108 with 1:12 to play before Harden and Leonard scored on drives to the hoop while James missed a pair of shots for the Lakers. But Leonard's last shot was off target, and James found Reddish for the capper to the delight of the thousands of Lakers fans in attendance at a \"road\" game.\n\"How can you be surprised with some of the things he does?\" Russell asked about James. \"A lot of guys locked in defensively and gave us what we needed, but he's a huge reason we won this game, just from him being him. As a group, we fought.\"\nThe Lakers won three of four over the Clippers this season, winning the season series for the first time since 2011-12.\nDavis had 20 points and 12 rebounds for the Lakers, while Russell had 18 and Hachimura added 17.\nThe Clippers and Lakers moved into the building long known as Staples Center - along with the NHL's Los Angeles Kings - when it opened in 1999. The NBA franchises shared their home for the next 25 years, usually facing each other four times annually in a rivalry known as the Hallway Series because their locker rooms are about 100 feet apart in the same corridor.\nThe era ends this fall when the Clippers move into Intuit Dome, owner Steve Ballmer's lavish new arena in Inglewood. Ballmer decided the Clippers needed their own home to complete their move out of the shadows of the Lakers' 17 NBA championships and the accompanying banners on the walls of the shared arena, and the billionaire quickly got it done.\nThe balance of power in Los Angeles still tilts completely in the Lakers' direction, but the Clippers have made progress: They've finished with a better record than the Lakers in 10 of the last 11 seasons, failing only in 2020 when the Lakers won their 17th title.\nThe teams could always meet in a playoff series this spring, but that's never happened.\nReddish returned from a 14-game absence due to a sprained right ankle,\nUP NEXT\nLakers: Host Washington on Thursday night\nClippers: Host Washington on Friday night.\n------\nAP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995498.705447
}