{
  "game_id": "0021900759",
  "espn_id": "401161401",
  "date": "Feb 05, 2020",
  "matchup": "ATL @ MIN",
  "headline": "Hawks beat Wolves 127-120 as teams brace for roster shifts",
  "body": "MINNEAPOLIS --  After a dizzying 24 hours, the Atlanta Hawks gave Clint Capela and the rest of their new teammates a glimpse of their young core’s potential.\n\nThe Minnesota Timberwolves, meanwhile, struggled to find energy in their 13th straight loss, with their best defensive player, Robert Covington, already in his new city.\n\nTrae Young had 38 points and 11 assists and John Collins added 27 points and 12 rebounds to lead Atlanta past Minnesota 127-120 Wednesday night, as both teams braced for major roster shifts.\n\nCollins had his fifth straight double-double for the Hawks, who prepared to add Capela and Nene from Houston as part of Wednesday’s four-team, 12-player trade that will also send Covington and Jordan Bell from Minnesota to the Rockets.\n\nThen during the game, the Hawks reportedly made another trade. The team wouldn’t confirm details of the reported move.\n\n“I was shocked,” Young said. “Obviously, Im still in my second year. This is my first time ever experiencing a trade happening during a game, for me. It’s new. \"\n\nThe teams capped the long day by making the four-team trade official after the game.\n\n“The last 24 hours, I haven’t slept much,” said Karl-Anthony Towns, who grew close to Covington after he landed in Minnesota last season following the trade that sent disgruntled Jimmy Butler to Philadelphia. Covington arrived in Houston earlier in the day.\n\nIn a game featuring teams with 28 combined wins -- not to mention Minnesota’s lengthy skid -- this one had some intrigue, although not for the on-court action.\n\nDuring halftime, the Hawks officially announced they waived Chandler Parsons to help to clear the way for Capela and Nene.\n\n“Definitely a crazier night, at least day, when you look at our entire roster and what’s happened in the last 24 hours,” Collins said.\n\nWOEFUL WOLVES\n\nBesides their losing skid, the Wolves were also reeling from the loss of locker-room personalities. Aside from Covington and Bell, the Wolves also parted ways with Shabazz Napier, Keita Bates-Diop and Noah Vonleh in the trade.\n\n“Those guys are big parts of the locker room and for us to lose all of them, obviously it changes a lot,” Towns said. “It changes the vibe up here because we’re missing four amazing guys first off, and four guys that we all count on for energy.”\n\nMinnesota, meanwhile, is expected to receive Evan Turner from Atlanta, along with Malik Beasley, Jarred Vanderbilt and Juancho Hernangomez from Denver.\n\nOH YEAH, THERE WAS A GAME, TOO\n\nYoung and Collins had 20 and 15 points, respectively, by halftime. Collins had a double-double midway through the third quarter, and Young had some impressive alley-oops to Collins.\n\nAndrew Wiggins scored 25 and Josh Okogie 23 to lead the Wolves, who made it a game with a late 19-7 run in a too-little, too-late bid. Towns finished with 21 points.\n\nThe Wolves never led and struggled to recover from an early 14-4 run at the end of the first quarter that had them playing catch up the rest of the way. Atlanta led by as many as 21 points. They certainly missed Covington, one of their better defenders since arriving last season.\n\nTowns completed a three-point play with 1:25 remaining to cut Atlanta's lead to seven and Okogie's dunk with 48.4 to play made it 122-117. Vince Carter hit a 3-pointer, Okogie missed a 3, and the Hawks shot free throws the rest of the way.\n\n“At this point, we’ll take the win” Hawks coach Llyod Pierce said. “It’s a good team win, good road win. A lot of adversity going on right now.”\n\nTIP-INS\n\nHawks: Pierce said Capela probably will not join the team on its current road trip. … Young had his 12th game with at least 30 points and 10 assists, tying for the league lead. ... PG Jeff Teague and and G Treveon Graham returned to Minnesota for the first time since being traded on Jan. 16 in exchange for Allen Crabbe. Teague scored nine points and had an impressive block on Jordan McLaughlin during a fast-break. … Bruno Fernando left the game with a strained left calf.\n\nTimberwolves: The Wolves allowed 23 points off 17 turnovers. … Crabbe had two points against his old team.\n\nUP NEXT\n\nHawks: Visit Boston on Friday.\n\nTimberwolves: Host the L.A. Clippers on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996670.576104
}