{
  "game_id": "0021800762",
  "espn_id": "401071435",
  "date": "Jan 30, 2019",
  "matchup": "SAC vs. ATL",
  "headline": "Giles, Bagley lead Kings in 135-113 blowout of Hawks",
  "body": "SACRAMENTO, Calif. --  Harry Giles carried Sacramento's offense for most of the third quarter, following a pattern set one period earlier by teammate Marvin Bagley III.\n\nThe young duo might represent the future of the Kings, but both one-and-done Duke products are just beginning to blossom.\n\nGiles scored 12 of his season-high 20 points in the third quarter, Bagley added 17 points and 12 rebounds, and Sacramento romped past the Atlanta Hawks 135-113 behind its two prized rookies Wednesday night.\n\n\"That was just a big boost tonight,\" Kings coach Dave Joerger said. \"Marvin, without a doubt in my mind, had his best game as an NBA player and same thing for Harry. There was enough to go around for everybody and a lot of positive things.\"\n\nGiles and Bagley have spent the majority of the season as part of Sacramento's second unit, and they came off the bench again to lead the Kings to their second lopsided win over the Hawks.\n\nBagley, the No. 2 pick in last year's draft who made his first career start on Jan. 22, had 13 points in the first half when Sacramento rallied from 10 down to go up 67-53 at halftime. Bagley also scored on a reverse dunk early in the fourth quarter to bring the crowd to its feet.\n\nAfter the game, Bagley smiled when asked about the potential he and Giles bring to the Kings.\n\n\"He had a behind-the-back pass that I didn't even see coming,\" Bagley said. \"I like playing with Harry because he can pass the ball very well, he can dribble, he can rebound, score. He can do it all.\"\n\nGiles, who missed last season mending from knee surgery, had his most dominant stretch in the third.\n\nHe had a hand in four straight baskets with a pair of short hook shots, an assist and an offensive rebound that led to a 3-pointer by Bogdan Bogdanovic. Giles later threw down an emphatic dunk that put Sacramento ahead 105-77.\n\n\"We're going through the same journey. We come from similar backgrounds, too, so it's easy to kind of feed off each other,\" Giles said. \"We want to see each other do good but help each other at the same time.\"\n\nTheir emergence was particularly important for the Kings on a night when De'Aaron Fox struggled with his shot most of the game. The second-year point guard was scoreless in the first quarter and finished 4 of 10 from the floor.\n\nFox had a rough night overall. He was initially credited with a steal that would have extended his streak to 20 consecutive games with at least one before a scoring change took it away.\n\n\"We didn't get in a stance and play with a lot of physicality the first 4-5 minutes,\" Joerger said. \"The bench came in, did a fantastic job and that energy gets contagious.\"\n\nBogdanovic had 16 points and seven assists for the Kings, who pulled away in the third thanks to Giles. Buddy Hield scored 18 and Nemanja Bjelica added 12 points and eight rebounds.\n\nTrae Young had 23 points with eight assists for Atlanta, which has lost four of six.\n\nThe Hawks, beaten by the Kings 146-115 on Nov. 1, trailed by 29 and committed 21 turnovers.\n\n\"(The Kings) just for some reason have our number pretty good,\" Atlanta coach Lloyd Pierce said. \"We didn't have the energy or the effort to play a team like this tonight.\"\n\nODDS AND ENDS\n\nThe Kings have won five consecutive home games for the first time since moving into the Golden1 Center three years ago. It is the franchise's longest run since 2007-08. . Bagley's double-double was his seventh this season.\n\nBACK-TO-BACK BLUES\n\nAtlanta fell to 1-4 in the second half of back-to-backs. The Hawks lost 123-118 to the Clippers in Los Angeles on Tuesday.\n\n\"I think it was more about a lack of effort than anything,\" Atlanta's John Collins said. \"But those guys were definitely playing harder. They had a little bit more energy in the game.\"\n\nTIP-INS\n\nHawks: Young made four 3s and needs four to break the Atlanta rookie record of 82 set by Salim Stoudamire in 2005-06. Kevin Huerter is close behind Young with 78. ... Tyler Dorsey was held out with a knee injury. ... Vince Carter received a loud ovation when he entered in the second quarter. Carter spent last season with the Kings.\n\nKings: Yogi Ferrell scored seven straight points in the second. ... Sacramento outrebounded Atlanta 53-36.\n\nUP NEXT\n\nHawks: Play at Utah on Friday.\n\nKings: Host Philadelphia on Saturday.\n\n---\n\nMore AP NBA:https://apnews.com/tag/NBA andhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994187.157643
}