{
  "game_id": "0022300808",
  "espn_id": "401585436",
  "date": "Feb 23, 2024",
  "matchup": "MIL @ MIN",
  "headline": "Bucks overtake Timberwolves 112-107 behind 33 points from Antetokounmpo",
  "body": "MINNEAPOLIS -- — Giannis Antetokounmpo had 33 points and 13 rebounds to help the Milwaukee Bucks surge out of the All-Star break with a 112-107 victory over the Minnesota Timberwolves on Friday night.\n\n\r\n              Minnesota dropped into a tie with Oklahoma City for the Western Conference lead at 39-17. The Thunder routed Washington 147-106 earlier Friday.\n\n\r\n              Anthony Edwards made three 3-pointers in the final 1:58 to give the Wolves a late chance after falling behind by 17 points late in the third quarter, but Damian Lillard iced it for the Bucks with a pullup 21-footer with 10.3 seconds left for the five-point lead.\n\n\r\n              “You can’t let yourself get too caught up in the misses. I knew eventually they would fall,” said Lillard, who had 21 points, 10 assists and a season-high nine rebounds to overshadow an 8-for-23 shooting night and help the Bucks (36-21) improve to just 4-7 under new coach Doc Rivers. \n\n\r\n              Malik Beasley scored all 14 of his points in the third, when the Bucks outscored the Wolves 36-13.\n\n\r\n              “We've got to be better,” coach Chris Finch said. \"We were hustling, but we weren’t sharp.”\n\n\r\n              Karl-Anthony Towns (22 points, 14 rebounds) and Rudy Gobert (12 points, 19 rebounds) helped the Wolves build a 32-14 second-chance points advantage, but their sloppy third quarter was too much to overcome.\n\n\r\n              “We just had a great energy about us,” Bucks center Brook Lopez said.\n\n\r\n              With two All-Stars on each side and both coaching staffs having represented each conference at the league's midseason showcase last weekend, ESPN grabbed this game for a national broadcast in the late-night window. The crowd, including plenty of Bucks fans, matched the moment.\n\n\r\n              Beasley, the streaky corner shooter who spent two-plus seasons with the Wolves before going to Utah in the Gobert trade two summers ago and switching teams twice more, didn't take a single shot in the first half. Rivers even held up the stat sheet in the locker room to emphasize that problem, and ball movement was the key to the rally. Beasley made four 3-pointers in the third, fueling a 23-4 run over a 4:41 stretch and striking a pose after the fourth one with a backside wiggle to accentuate the 87-70 lead.\n\n\r\n              “That opens up the door to perform well down the stretch, where guys aren’t just randomly expected to make a shot,” Lillard said.\n\n\r\n              The Bucks, though still solidly in third place in the Eastern Conference, are trying to find their footing under Rivers after the surprising midseason switch. Three-time All-Star Khris Middleton missed his sixth straight game with a sprained left ankle, further hampering the effort. \n\n\r\n              Lillard, who was the All-Star Game MVP and 3-point shooting contest champ last weekend, has yet to find his groove next to Antetokounmpo on his new team. He entered the evening shooting 34.1% from 3-point range, the second-lowest rate in his 12 seasons in the NBA, and went just 2 for 8 in this game.\n\n\r\n              Lopez, who finished with 16 points, made all four of his 3-pointers in the first quarter to give the Bucks an early spark. Antetokounmpo got his drive going in the second. Then Beasley took over the third.\n\n\r\n              “You have to be able to lean on your defense down the stretch and our guys are starting to believe that,” Rivers said.\n\n\r\n              The Wolves, who played their first of seven straight home games, showed the dreaded post-break rust for most of the game.\n\n\r\n              “Probably came out in the second half a little too comfortable, I feel like,” Edwards said.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Visit Philadelphia on Sunday. Rivers coached the 76ers the previous three seasons.\n\n\r\n              Timberwolves: Host Brooklyn on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996113.7756412
}