{
  "game_id": "0021600210",
  "espn_id": "400899660",
  "date": "Nov 22, 2016",
  "matchup": "CHI @ DEN",
  "headline": "Barton's 2 free throws lift Nuggets over Bulls, 110-107",
  "body": "DENVER --  The Denver Nuggets defense was absent for most of the night. They got a stop with the game on the line and sent Chicago to another loss in Colorado.\n\nRookie Jamal Murray scored a season-high 24 points, Will Barton hit two free throws with 9.5 seconds left and the Nuggets beat the Bulls 110-107 on Tuesday night.\n\nIt was Denver's 10th straight home win over the Bulls and its 16th in the last 17 meetings at Pepsi Center.\n\nThe Nuggets survived a 35-point, eight-rebound night from Jimmy Butler to keep Chicago winless in Denver since Feb. 8, 2006. Dwyane Wade had 22 points after sitting out Sunday's game against the Lakers.\n\nButler insisted the streak wasn't weighing on the team's mind.\n\n\"It's a basketball court with two rims, two backboards and a ball,\" he said. \"At the end of the day put the ball in the basket, do everything you can do in every other city and win the game.\"\n\nChicago had a chance to end the streak but with the game tied Barton was fouled by Wade on a drive to the basket, and he hit two free throws left to give Denver a 109-107 lead.\n\n\"We are going to put the ball in Will Barton's hands, let him attack downhill,\" Nuggets coach Michael Malone said. \"If he draws a crowd, let him get the ball to Murray, who had been shooting the ball light's out, on the back side to make a shot.\"\n\nThe Bulls called timeout and Fred Hoiberg drew up a play for Butler, but Denver shut it down.\n\n\"Kenneth Faried was standing in the paint so I didn't have nowhere to go,\" Butler said.\n\nWade got the ball to Isaiah Cannon, coming around the defense but shot an airball on a 3-point attempt and the Nuggets got the ball.\n\n\"We got a shot from a very good 3-point shooter. We're fine with it,\" Wade said. \"We had a chance to come in and get one and we didn't.\"\n\nThe Bulls were in control early but the Nuggets used a 22-0 run at the start of the second quarter to take a 41-31 lead. Murray had 15 of his 17 first half points in the period and Wilson Chandler scored 12 of his 16 in the second quarter.\n\n\"It just takes one shot to have confidence,\" Murray said. \"It doesn't take me long to get hot. I think every shot is going in. If I miss I don't worry about it.\"\n\nTIP-INS\n\nBulls: Butler was named the Eastern Conference Player of the Week after averaging 27.3 points, 9.3 rebounds and 3.8 assists in four games. He scored a season-high 40 Sunday. ... Michael Carter-Williams is still out with a left knee bone bruise and left wrist sprain. ... Doug McDermott (concussion protocol) missed his fifth game.\n\nNuggets: Mike Miller is away from the team for family reasons. He is expected to rejoin the team later in the week.\n\nALWAYS THE BRIDESMAID\n\nThe Nuggets courted Wade as a free agent this summer but he ultimately chose his hometown Bulls. He came away impressed with his meeting with Denver.\n\n\"Those guys, I was sold on them,\" Wade said. \"They made it a lot tougher than people think.\"\n\nEven though he didn't sign with the Nuggets, they felt good about the process.\n\n\"To have a chance to sit down with a first-ballot Hall of Famer who was giving us serious considerations showed our fans of the positive vibes about this team, around the NBA,\" Malone said.\n\nRESERVE CLAUSE\n\nThe Nuggets' bench scored 39 of their 41 points in the second quarter and outscored the Bulls reserves 61-13 for the game. Three of Denver's double-digit scorers came off the bench.\n\n\"Our bench was phenomenal tonight,\" Malone said.\n\nUP NEXT\n\nBulls: Finish up their six-game road trip Friday in Philadelphia. It is tied for their longest trip of the season.\n\nNuggets: At Utah on Wednesday",
  "source": "espn_api",
  "crawled_at": 1764995095.7592041
}