{
  "game_id": "401810154",
  "espn_id": "401810154",
  "date": "Nov 29, 2025",
  "matchup": "PHX vs DEN",
  "headline": "Jokic scores 26 and Murray adds 24 to lead the hot-shooting Nuggets past the Suns 130-112",
  "body": "PHOENIX -- — Nikola Jokic scored 26 points, Jamal Murray added 24 and the Denver Nuggets pulled away late to beat the Phoenix Suns 130-112 on Saturday night.\n\n\r\n              The hot-shooting Nuggets made 22 of 38 3-pointers (57.9%) — hitting 10 in the first half and 12 in the second for a steady stream of offense. Tim Hardaway Jr. scored 23 points off the bench and was 7 of 11 from behind the arc.\n\n\r\n              Jokic — who barely played in the fourth quarter — was 7 of 7 from the field and added 10 assists and nine rebounds to finish just shy of his 11th triple-double this season.\n\n\r\n              Denver pushed its lead to 96-85 entering the fourth quarter after hitting eight 3-pointers in the third. The Suns cut the deficit to nine early in the fourth but the Nuggets responded with the next 12 points to build a comfortable 110-89 advantage.\n\n\r\n              The Nuggets bounced back from Friday night's loss to the San Antonio Spurs. The Suns have lost three of four. \n\n\r\n              Dillon Brooks led the Suns with 27 points on 10-of-18 shooting. Devin Booker scored 24, making 14 of 15 free throws.\n\n\r\n              The Nuggets had a 63-60 lead at halftime after shooting 10 of 16 (62.5%) from 3-point range. Jokic had 18 points and Hardaway added 17. Brooks led the Suns with 19.\n\n\r\n              Suns guard Grayson Allen returned after missing more than two weeks with a bruised quadriceps. He finished with 10 points.\n\n\r\n              Up next\r\n              Nuggets: Host the Dallas Mavericks on Monday.\n\n\r\n              Suns: At the Los Angeles Lakers on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042719.198171
}