{
  "game_id": "0022200681",
  "espn_id": "401468836",
  "date": "Jan 19, 2023",
  "matchup": "BKN @ PHX",
  "headline": "Mikal Bridges scores 28 points, Suns beat Nets to snap skid",
  "body": "PHOENIX -- — Cam Johnson got an All-Star level ovation from the home crowd in the first quarter when he came to the scorer's table, returning to the floor after losing 37 games to a knee injury.\n\n\r\n              He's not the best player on the Phoenix Suns. But he's a very good player, and right now, they need all the help they can get.\n\n\r\n              Mikal Bridges scored 28 points, Johnson added 19 off the bench and the still very short-handed Suns held off the Brooklyn Nets 117-112 on Thursday night.\n\n\r\n              “I just thought he brought a level of juice to the arena that we hadn't felt in a while,” Suns coach Monty Williams said. “He got up off the bench and you could feel the fans, the community — ‘That’s our guy.'\"\n\n\r\n              Brooklyn fought back from 20 points down in the fourth quarter to make things tight in the final minute. \n\n\r\n              Kyrie Irving — who scored 21 points of his 30 points in the fourth quarter — hit a 3-pointer to cut it to 113-110 with 10.9 seconds remaining, After the Suns hit a free throw, Nic Claxton's dunk with 7.4 seconds made it 114-112, but that's as close as the Nets would get to taking the lead.\n\n\r\n              “Sometimes, the hole is too big to come back from,\" Irving said.\n\n\r\n              Deandre Ayton had 24 points and 14 rebounds to help the Suns snap a three-game losing streak. Brooklyn has lost four straight. \n\n\r\n              Johnson's return is welcome good news for a team that had lost 12 of 14 games coming into Thursday. He had a crucial steal late in the fourth quarter along with four important free throws. \n\n\r\n              “Man, I can't tell you how good it felt to be back out there,\" Johnson said. \n\n\r\n              Both teams were missing some of their star players. Brooklyn's Kevin Durant was out with a knee injury while Phoenix was missing its All-Star backcourt of Devin Booker (groin) and Chris Paul (hip).\n\n\r\n              The Suns controlled most of the game, pushing to a 94-74 lead by the end of the third quarter. The Nets cut it to 107-102 with about 3:30 left, but then had three straight turnovers to blunt their momentum.\n\n\r\n              Irving also had seven rebounds and seven assists. He was 11 of 27 from the field.\n\n\r\n              The Suns pushed to a 65-51 halftime lead after shooting 58.5% from the field. Ayton had 17 points, nine rebounds and three assists before the break.\n\n\r\n              SIMMONS TOSSED\n\n\r\n              Nets guard Ben Simmons was ejected early in the third quarter after picking up two quick technicals for arguing.\n\n\r\n              Simmons was called for an offensive foul on a screen and then started arguing with official Eric Lewis as both went down the court. Lewis called him for his first technical and then Simmons was subbed out of the game. As Simmons sat down, he continued arguing and got his second technical.\n\n\r\n              After he was ejected, Simmons immediately got up and walked back to the locker room. He finished with seven points, four rebounds and six assists.\n\n\r\n              “It’s tough,” Simmons said. “I am a 6-10 guy who likes to guard certain guys. I am going to be physical. I am not going to tone it down because the refs don't want to see the physicality.”\n\n\r\n              NEW OWNER COURTSIDE\n\n\r\n              Incoming Suns owner Mat Ishbia was courtside Thursday night, sitting close to the same area that outgoing owner Robert Sarver used to sit.\n\n\r\n              Ishbia agreed to purchase the Suns from the embattled Sarver for $4 billion in December. The sale is still in the process of being completed. Ishbia is a former Michigan State player under coach Tom Izzo, and was a member of the Spartans’ NCAA championship team in 2000.\n\n\r\n              The NBA suspended Sarver in September for one year, plus fined him $10 million, after an investigation found he had engaged in what the league called “workplace misconduct and organizational deficiencies.”\n\n\r\n              TIP-INS\n\n\r\n              Suns: Paul, Booker, G Josh Okogie (nasal fracture), G Cameron Payne (right foot sprain), G Landry Shamet (right foot soreness) didn't play. ... Had a 25-11 rebounding advantage in the first half ... Hosted a 48th consecutive sellout crowd. ... Saben Lee, who is on a 10-day contract, scored 15 points. ... Has a \n\n\r\n              UP NEXT\n\n\r\n              Nets: At Utah on Friday night.\n\n\r\n              Suns: Host Indiana on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994872.970929
}