{
  "game_id": "0022200184",
  "espn_id": "401468339",
  "date": "Nov 12, 2022",
  "matchup": "BKN @ LAC",
  "headline": "Nets pull away late, take down Clippers 110-95",
  "body": "LOS ANGELES -- — Kevin Durant scored 27 points, Seth Curry added 22 and the Brooklyn Nets broke free midway through the fourth quarter Saturday for a 110-95 victory over the Los Angeles Clippers.\n\n\r\n              Nic Claxton had 13 points and 14 rebounds as the Nets improved to 4-1 since Kyrie Irving was given a team-imposed suspension that will last at least one more game. Three of the four victories have come on the road.\n\n\r\n              The Nets have held five straight opponents below 100 points.\n\n\r\n              “We're going to have to be one of those teams that any given night, somebody will have to step up and make huge plays for us,” Durant said. “Obviously we're missing (Irving), so we're going to have to look for where those points are going to come from. I think the guys are doing it as a group.”\n\n\r\n              Paul George scored 17 points for the Clippers but endured a rough shooting game, going 5 of 21 from the field (23.8%). Ivica Zubac added 16 points and 15 rebounds for the Clippers, who lost for just the second time since Oct. 31.\n\n\r\n              The Clippers led 86-84 with 7:42 remaining before the Nets took charge. Consecutive 3-pointers by Curry, a layup by Claxton and a 3-pointer from Royce O’Neale capped a 20-2 run that gave the Nets a 104-88 lead with 2:22 remaining.\n\n\r\n              “We kept bodies in front of (George); making him make tough shots,” Curry said. “We were switching a lot of stuff and helping each other. Keep bodies in front of them, make guys make tough shots over us and just trust our defense that they're not going to do that for 48 minutes.”\n\n\r\n              O’Neale finished with 12 points while Edmond Sumner had 11 as the Nets shot 48% from the field and 44.4% from 3-point range. Durant and Curry combined to go 7 of 13 from 3-point range. Curry made all four of his 3-point attempts in the fourth quarter, when he scored 14 points.\n\n\r\n              Norman Powell scored 16 points for the Clippers, while John Wall had 14 and Marcus Morris Sr. added 13. Los Angeles finished with a 46-41 rebounding advantage.\n\n\r\n              “We didn't play the right way offensively tonight,” Clippers coach Tyronn Lue said. “We talked about them really protecting the paint and we get into the paint, making the right play and kicking it out for 3s. Defensively, we double-teamed Durant and he made the right play. Their guys made shots.”\n\n\r\n              The Clippers fell to 5-5 without star Kawhi Leonard, who has not played since the third game of the season with what is being labeled right knee injury management.\n\n\r\n              SUSPENSION CONTINUES\n\n\r\n              Irving served the fifth game of a team-imposed minimum five-game suspension Saturday, with coach Jacque Vaughn saying the team’s embattled guard will be out at least another game Sunday against the Los Angeles Lakers. No other details were given, with Vaughn saying, “I can give you that,” when confirming Irving’s absence for Sunday. \n\n\r\n              “His spirit is high,” Durant said after the game. “(He's) looking forward to playing again. You know (Irving), he's a gamer. He loves to play. Hopefully all this stuff is over with, we can move past it and get him back on the floor soon.”\n\n\r\n              TIP-INS\n\n\r\n              Nets: Sumner scored in double figures for the third time in five games since moving into the starting lineup in place of Irving. … Ben Simmons scored two points with three assists in 14 minutes and has not been above six points and four assists since missing four games with knee soreness.\n\n\r\n              Clippers: George was just 2 of 10 from the field in the first half before his running dunk with a minute to go before the break. … The Clippers gave up 18 points off 18 turnovers.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At the Los Angeles Lakers on Sunday.\n\n\r\n              Clippers: At the Houston Rockets on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994893.30108
}