{
  "game_id": "0022301032",
  "espn_id": "401585660",
  "date": "Mar 24, 2024",
  "matchup": "LAL vs. IND",
  "headline": "Anthony Davis scores 36 points while the Lakers hold off another Pacers comeback in a 150-145 win",
  "body": "LOS ANGELES -- — Anthony Davis had 36 points and 16 rebounds, LeBron James added 26 points and 10 assists, and the Los Angeles Lakers produced their franchise's highest-scoring performance in 37 years in a 150-145 victory over the Indiana Pacers on Sunday night.\n\n\r\n              Spencer Dinwiddie scored 26 points in his biggest offensive game since joining the Lakers, who have won three straight and five of seven. Los Angeles led 116-99 entering the fourth quarter, but Indiana closed the gap to three points down the stretch while putting up a 46-point final period.\n\n\r\n              Los Angeles held on by scoring 10 points in the final minute — including six free throws by Austin Reaves, who finished with 25 points in the highest-scoring performance by this 17-time NBA champion team since Jan. 2, 1987.\n\n\r\n              “We played them in the (In-Season Tournament) championship, and we know how high-powered an offense they are,\" James said. \"They’re never going to stop playing no matter how far they get down or how far they’re up, so it’s a good win for us.”\n\n\r\n              All-Star Tyrese Haliburton awoke from a quiet 12-point performance to hit two 3-pointers in the final seconds, trimming the Lakers’ lead to three points with 20 seconds to play. LA survived when Dinwiddie made one free throw and Haliburton missed a 3 before Cam Reddish stole Doug McDermott’s pass with three seconds left.\n\n\r\n              “We allowed them to score 145, so ... it was terrible defensively,” Davis said. “They hit some shots toward the end, but we can do what we want offensively, as you could see tonight. But we’ve got to defend, especially when we’ve got a team (in trouble) like that. We don’t need to give them life, but at this point in the season, a win is a win. We’ll take it, but we’ve got to learn from it as well.”\n\n\r\n              Indiana coach Rick Carlisle was annoyed after the Lakers shot 43 free throws to the Pacers' 16, while Indiana was called for 31 fouls to Los Angeles' 14.\n\n\r\n              “I thought our guys really battled in this game,\" Carlisle said. \"There were just certain things that were impossible to overcome. A 27 free throw differential is one, and a 17-foul differential is the other.”\n\n\r\n              Pascal Siakam scored 19 of his 36 points in the third quarter for the Pacers, who dropped to 2-1 on their five-game road trip after playing dismal defense in the second and third quarters, allowing 86 points by Los Angeles. Myles Turner added 20 points and TJ McConnell had 17 for the Pacers, who had eight double-digit scorers.\n\n\r\n              “Sometimes when you have difficult challenges, it's easy to drop your head and just say, ‘Hey, it’s not our night,' but our guys don't do that,” Carlisle said. “Our second unit battled in the second half. That last five-minute stretch, the first unit came back in there, and they were defiant about hanging in the game. At a certain point, you've got to play absolutely perfectly, and that was going to be very, very difficult.”\n\n\r\n              Dinwiddie stepped up while the Lakers won for the first time in six games this season without sharpshooting guard D’Angelo Russell, who was out with a non-COVID illness.\n\n\r\n              Offensive fireworks were no surprise in this matchup. In the Pacers' last visit to face the Lakers in November 2022, they rallied from a 17-point deficit in the fourth quarter before Andrew Nembhard hit a 3-pointer at the buzzer for a stunning 116-115 victory.\n\n\r\n              The teams met for the first time since the Lakers beat the Pacers 123-109 in Las Vegas to win the inaugural In-Season Tournament last December. The Lakers, who will play at Indiana on Friday, went into a 3-10 slump immediately after raising that trophy, and they haven't been able to rise higher than ninth in the Western Conference despite going 22-13 since that skid.\n\n\r\n              Russell's absence and the Pacers' speedy play caused problems for the Lakers early on, but Davis had 15 points and nine rebounds in the first half to keep it close. The Lakers scored a season-high 116 points through three quarters, but Siakam kept Indiana in it by himself.\n\n\r\n              Most of Argentina's national soccer team attended the game ahead of La Albiceleste's exhibition match at the Coliseum on Tuesday.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Los Angeles Clippers on Monday night.\n\n\r\n              Lakers: At Milwaukee on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995485.6837811
}