{
  "game_id": "0022300371",
  "espn_id": "401584999",
  "date": "Dec 20, 2023",
  "matchup": "HOU vs. ATL",
  "headline": "Young has 30 points, 14 assists as Hawks down Rockets 134-127",
  "body": "HOUSTON -- — Trae Young had 30 points and 14 assists as the Atlanta Hawks withstood a late charge by Houston to get a 134-127 victory Wednesday night, ending an 11-game home winning streak for the Rockets.\n\n\r\n              It’s the fifth straight game in which Young has had at least 30 points and 10 assists, which is the longest such streak of his career. The last two players to have done it in five straight games are Russell Westbrook in March 2017 and Michael Jordan in April 1989.\n\n\r\n              Houston used an 14-0 run to cut the lead to 127-123 with about 90 seconds to go. Fred VanVleet had five points in that stretch and Dillon Brooks capped it with a 3-pointer. \n\n\r\n              Young scored Atlanta’s first points in almost five minutes on a jump shot after that. But Young turned the ball over a few seconds later and a layup by Brooks got the Rockets within four again with just under a minute to go. \n\n\r\n              Saddiq Bey made a 3-pointer for the Hawks to stretch the lead to 132-125 with 35 seconds left and Atlanta held on for the win.\n\n\r\n              “That was the biggest shot of the game,” Atlanta coach Quin Snyder said. “It was a huge play.” \n\n\r\n              The Hawks led by as many as 20 early after making eight 3-pointers in the first quarter. They cooled down after that and finished with 17 of 40 from long-range.\n\n\r\n              Snyder said that finishing off this game after losing such a big lead is a sign of growth for his team.\n\n\r\n              “For us consistently to be able to focus throughout the game regardless of the situation, regardless of having a lead or not, is something we need to continue to focus on,” he said. “We’re not there yet but when we get some situations that we handle well, I think it’s important to recognize them and emphasize them.”\n\n\r\n              Jabari Smith Jr. led the Rockets with a career-high 34 points with 13 rebounds and VanVleet had a season-high 32 points with 15 assists as Houston lost a third straight game.\n\n\r\n              VanVleet said it was difficult to be playing from behind for most of the night.\n\n\r\n              “It’s the best players in the world, it’s hard enough as is,” he said. “So it's especially (tough) when you let a team get comfortable, let them play free and easy, let them get wide-open looks. They're a good offensive team but we didn't make it tough on them at all.”\n\n\r\n              Atlanta had an 8-point lead before using a 10-0 run to make it 127-109 midway through the fourth. Onyeka Okongwu made two free throws in that span after Brooks was called for a flagrant-1 foul after hitting him in the groin area while trying to get past a screen.\n\n\r\n              A 7-0 run by Atlanta made it 114-103 with about eight minutes to go. Brooks and Jalen Green made 3-pointers for Houston but Young made one for Atlanta in between Houston’s two buckets to cut the lead to 117-109.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Visit Miami on Friday night.\n\n\r\n              Rockets: Host Dallas on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995618.9446468
}