{
  "game_id": "0021500338",
  "espn_id": "400828225",
  "date": "Dec 11, 2015",
  "matchup": "CHA @ MEM",
  "headline": "Walker and Batum lead Hornets past Grizzlies 123-99",
  "body": "MEMPHIS, Tenn. --  The Charlotte Hornets took a solid punch from Memphis to open the game and then steadily overcame whatever advantage the Grizzlies had gained.\n\nAfter falling behind 11-0 to start the game, the Hornets outscored the Grizzlies in each of the final three quarters and trounced the Grizzlies 123-99 on Friday night.\n\n\"We felt like we got sucker punched, and from there we had to fight our way and claw our way back in,\" said reserve guard Jeremy Lin, who scored 16 points.\n\nKemba Walker had 33 points and six assists and Nicolas Batum added 20 points to lead the Hornets to their fourth straight win.\n\n\"We came out kind of flat and (the Grizzlies) came out really strong,\" Walker said. \"As a team in the huddle, we told each other we've got to do better.\"\n\nFrom there, the Hornets did much better, eventually converting 18 of 37 shots from 3-point range. Walker and Batum each shot 5 of 8 from beyond the arc. The 18 3-pointers marked Charlotte's highest total of the season.\n\nFrank Kaminsky had 15 points and six rebounds, while Jeremy Lamb added 10 points. Lin, Kaminsky and Lamb were part of a Hornets bench that outscored Memphis' reserves 59-37.\n\n\"I thought the bench (in) the first half, and the starters when they came back in the third quarter, were terrific,\" Charlotte coach Steve Clifford said. \"It's been like that to me -- different nights, different groups.\"\n\nMarc Gasol led the Grizzlies with 17 points and nine rebounds. Mike Conley added 16 points. Zach Randolph had 13 points and Courtney Lee added 12 as Memphis lost for the third time in the last five outings.\n\n\"I wish I could explain it to you,\" Gasol said of the Grizzlies' struggles. \"I wish I could.\n\nGasol later added that \"we are chasing our tails.\"\n\nCharlotte's 3-point shooting accuracy helped the Hornets shoot 50 percent from the field for the game.\n\n\"We didn't guard except for the first five or six minutes of the night,\" Memphis coach Dave Joerger said.\n\nCharlotte already had erased a first-quarter, double-digit deficit when it opened the third quarter with a 15-4 rally. Batum and Walker each scored 11 points in the third as the Hornets' lead ballooned to 93-73 entering the fourth.\n\n\"They beat us with effort,\" Joerger said. \"They beat us with execution. They beat us at just about every single matchup and down the line. There's not much to say. We were not good. They were good.\"\n\nTIP-INS\n\nHornets: Al Jefferson missed his fifth straight game with a left calf strain. Jefferson also was suspended for five games earlier this week for violating the league's drug policy. ... The win snapped a four-game road losing streak in the series for Charlotte. The Hornets hadn't won in Memphis since Feb. 26, 2010.\n\nGrizzlies: Memphis hit its first eight shots in building an early 14-point lead. ... Memphis, which entered the game leading the NBA in free-throw percentage at 83 percent, was 28 of 37 for 76 percent.\n\nPOOR 3-POINT DEFENSE\n\nThe Hornets' 18 3-pointers marked the 14th game this season a Memphis opponent has made at least 10 shots outside the arc.\n\nPOOR THIRD-PERIOD PERFORMANCE\n\nEntering the game, Memphis had averaged 20.7 points and shot 41 percent during the third quarter of its losses. Against Charlotte, Memphis scored 19 points and shot 33 percent in the third.\n\nSTRONG BENCH PLAY\n\nLin and Lamb entered the game with a combined average of 22.4 points a game -- the best bench combination in the Eastern Conference. They combined for 26 points against Memphis.\n\nUP NEXT\n\nHornets: Host Boston Celtics on Saturday.\n\nGrizzlies: Visit Miami Heat on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994398.6066408
}