{
  "game_id": "0021800442",
  "espn_id": "401071123",
  "date": "Dec 16, 2018",
  "matchup": "TOR @ DEN",
  "headline": "Nuggets beat Raptors 95-86 in matchup of conference leaders",
  "body": "DENVER --  In the fourth quarter, Jamal Murray's shot finally started falling.\n\n\"About time,\" the Denver guard said.\n\nAbout time, too, to take the Nuggets as a serious, pesky threat.\n\nNikola Jokic scored 26 points, Murray had 15 of his 19 in the fourth quarter and the banged-up Nuggets rallied past the equally banged-up Toronto Raptors 95-86 on Sunday night in a contest between conference leaders.\n\nTrailing 70-57 in the third quarter, the Nuggets went on a 23-2 run to send them to their 10th win in 12 games and retain a slim lead over Golden State in the Western Conference. This marks the latest the Nuggets (20-9) have been in first place in the West since Dec. 18, 1984, according to information by Elias Sports Bureau.\n\n\"It's December,\" Mason Plumlee said. \"It's a long way to go.\"\n\nStill, they've now beaten the Raptors (twice), Golden State and Boston.\n\n\"I guess maybe it says we're the best team for the time being,\" Nuggets coach Michael Malone said. \"There are a lot of games left. I think one thing we've done a really good job of is tempering our own excitement.\"\n\nKawhi Leonard had 29 points and 14 rebounds for the Eastern Conference-leading Raptors, who finished 2-2 on their trip. They still own the league's best mark at 23-9.\n\nMurray led the charge with eight straight points early in the fourth. The defense stepped up, too, as the Raptors didn't score their first field goal in the final quarter until Leonard's dunk with 7:42 remaining.\n\nToronto pulled to 86-83 with 3:28 left, but Plumlee's easy bucket gave Denver some breathing room. The Raptors were 4 of 23 from the field in the fourth quarter, including 1 of 13 from 3-point land.\n\nMore alarming to Raptors coach Nick Nurse was that Leonard only had four free throws despite all his work around the rim.\n\n\"You can't tell me one of the best players in the league takes a hundred hits in that game and shoots four free throws,\" Nurse said. \"It's been going on all year. I do not understand why they are letting everybody play one of the best players in the league so physically. I do not understand.\"\n\nLeonard agreed, but shrugged it off.\n\n\"It's been very physical. I just go with the next play,\" Leonard said. \"I pride myself on just keep moving and keep going.\"\n\nBoth teams had several key players on the bench due to injuries. The Raptors were without Kyle Lowry (thigh), Pascal Siakam (back), Fred VanVleet (back) and Jonas Valanciunas (thumb).\n\nThe Nuggets didn't have Will Barton (right hip/core muscle surgery), Gary Harris (hip) and Paul Millsap (big toe).\n\nNot that Malone gave it much thought.\n\n\"Teams look at us right now with players out, and they think they can show up and beat us,\" Malone said. \"We've shown teams, `No, that's not the case.' We have more than enough players that are going to go out there and battle and compete.\"\n\nThe Nuggets beat the Raptors 106-103 on Dec. 3 in Toronto. In that game, Jokic had 23 points, 15 assists and 11 rebounds.\n\nJokic was a handful again. He also had nine rebounds.\n\n\"He's doing what he's supposed to do,\" Malone said. \"He's our franchise player.\"\n\nTIP-INS\n\nRaptors: Danny Green was given a technical foul in the third quarter. He was poked in the eye by Monte Morris early in the fourth quarter. ... C Serge Ibaka fouled out with 1:37 remaining. He was given a technical after the call. ... Delon Wright got the start and had 15 points.\n\nNuggets: Plumlee had 10 points and seven rebounds.\n\nINJURY UPDATE, PART I\n\nBarton could return to the lineup in the next week or 10 days. He had surgery on Oct. 23 to repair core and hip muscle injuries.\n\n\"It would be great to have him back,\" Malone said. \"He's such a versatile part of what we do.\"\n\nINJURY UPDATE, PART II\n\nNurse doesn't expect Lowry or Siakam to miss much time. Lowry sat out his second game with a bruised thigh, while Siakam was sidelined after experiencing back stiffness following a hard fall in Portland.\n\n\"There's nothing seriously wrong with either one of them,\" Nurse said. \"There's just some soreness.\"\n\nUP NEXT\n\nRaptors: Host Indiana on Wednesday.\n\nNuggets: Close out a four-game homestand on Tuesday against Dallas.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994121.1003299
}