{
  "game_id": "0022000522",
  "espn_id": "401267682",
  "date": "Feb 28, 2021",
  "matchup": "MIA vs. ATL",
  "headline": "Heat top Hawks for 6th straight win, get back to .500",
  "body": "MIAMI -- — The Miami Heat are back at .500, not even a couple weeks removed from being near the very bottom of the Eastern Conference.\n\n\r\n                    Kendrick Nunn scored 24 points, Bam Adebayo had 16 points and 13 rebounds, and the Heat extended the NBA’s longest current winning streak to six games by beating the Atlanta Hawks 109-99 on Sunday night.\n\n\r\n                    “That was a big-time game for us,” Nunn said. “Took a step in the right direction.”\n\n\r\n                    Previous Achiuwa had 14 points in 12 minutes for Miami, which used a 10-0 run late in the fourth quarter to pull away from a game that was tied at 95 with 3:00 left. Tyler Herro had 12 of his 14 points for Miami in the fourth and Goran Dragic scored 13 for the Heat (17-17).\n\n\r\n                    John Collins led all scorers with 34 points for Atlanta, plus grabbed 10 rebounds. Clint Capela finished with 20 points and 14 rebounds for the Hawks, while Trae Young added 15 points, nine assists and eight rebounds.\n\n\r\n                    But Young shot just 3 for 14.\n\n\r\n                    “He's seen the pressure,\" Hawks coach Lloyd Pierce said. “He knows teams are going to throw different defenses at us. A lot of it's focused on taking the ball out of his hands. And we have ways to punish, but again, if you don't make shots there's nothing really we can do.\"\n\n\r\n                    Kevin Huerter scored 13 for the Hawks, who were just 8 for 35 from 3-point range.\n\n\r\n                    The teams play again Tuesday in Miami when the Heat — who have won 10 of their last 13 — will try to get over .500 for the first time all season. Miami played Sunday without Jimmy Butler, sidelined by right knee inflammation.\n\n\r\n                    “With Jimmy out, I thought guys really stepped up and filled in in a lot of different places,\" Heat coach Erik Spoelstra said.\n\n\r\n                    Miami led 54-44 at the half, a big part of that because of their defense on Young. He was scoreless until 2:53 remained in the half, the deepest he’s gone into a game this season without a point.\n\n\r\n                    Collins was 4 for 4 in the second quarter, helping keep the Hawks within striking distance.\n\n\r\n                    He stayed dominant in the third. Collins had 19 in that quarter alone — the second-most any player has had in a quarter against Miami this season, one shy of the 20 that Philadelphia’s Joel Embiid had in the third quarter of the 76ers’ win over the Heat on Jan. 12.\n\n\r\n                    Capela added 10 in the third quarter and the Hawks briefly recaptured the lead before going into the fourth down just 78-77. Collins and Capela were 13 for 18 in the third; the rest of the Hawks were 1 for 8 and Young — just as he was in the first quarter — was scoreless.\n\n\r\n                    “JC was really setting the tone by being aggressive,\" Capela said.\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Young’s scoreless first quarter was his fifth of the season. The Hawks are 0-5 in those games this season and 0-13 in those games since the finale of his rookie year. ... Rajon Rondo’s last seven games in Miami have come with him playing for seven different teams: Boston, Dallas, Sacramento, Chicago, New Orleans, the Lakers and now Atlanta.\n\n\r\n                    Heat: The six straight wins is Miami's longest such regular-season streak since a seven-game run midway through the 2017-18 season. The Heat had a seven-game win streak in last season's playoffs as well. ... Among those in the crowd of about 3,000 was celebrity chef Guy Fieri. ... Adebayo now has six consecutive double-doubles, tying a career-best.\n\n\r\n                    BUTLER’S KNEE\n\n\r\n                    The Heat are listing Butler as day-to-day. Spoelstra said Butler was with the team for shootaround Sunday morning and the knee “didn’t loosen up the way he wanted it to.” Spoelstra added that he believes the issue is minor.\n\n\r\n                    FLORIDA MEN\n\n\r\n                    This game was the first of four consecutive the Hawks will play in Florida — they’re at Miami again Tuesday, at Orlando on Wednesday and vs. Toronto in Tampa to start the second half on March 11. They are scheduled to play four straight in California from March 20-26, and have had only one four-game stretch in Georgia so far this season.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997818.9871402
}