{
  "game_id": "0022400033",
  "espn_id": "401703402",
  "date": "Nov 22, 2024",
  "matchup": "DEN vs. DAL",
  "headline": "Mavericks recover after losing 24-point lead, overcome Jokic's triple-double to beat Nuggets 123-120",
  "body": "DENVER -- — Naji Marshall scored a career-high 26 points, P.J. Washington had 22 points and 13 rebounds, and the Dallas Mavericks recovered after blowing a 24-point lead to beat the Denver Nuggets 123-120 on Friday night in an NBA Cup game.\n\n\r\n              Playing without Luka Doncic, Dallas built a 20-point halftime lead by was down by five before Washington scored nine points in the final 2:41 to improve to 2-1 in the West Group C. Denver was eliminated from the knockout round.\n\n\r\n              Doncic will be out at least four games with a right wrist sprain.\n\n\r\n              Nikola Jokic returned from a three-game absence to notch his sixth triple-double of the season. Jokic, who didn’t go on the three-game road trip while he and his wife waited for the birth of their second child, finished with 33 points, 17 rebounds and 10 assists.\n\n\r\n              Russell Westbrook scored 16 points.\n\n\r\n              Dallas led 77-53 early in the third quarter but the Nuggets rallied to take a 113-108 lead late in the fourth. The Mavericks went on an 11-2 run to lead 119-115 with 50 seconds left.\n\n\r\n              Takeaways\r\n              Mavericks: Showed their depth without their best player. Seven players scored in double figures.\n\n\r\n              Nuggets: Christian Braun had 17 points and is the only player to score in double figures in every game this season. Jokic has scored at least 10 points in every game he has played.\n\n\r\n              Key moment\r\n              With the game tied at 113 with 1:52 remaining, Dereck Lively II blocked layups by Jokic and Westbrook in a span of 30 seconds.\n\n\r\n              Key stat\r\n              Westbrook entered Friday night shooting 30.4% from 3-point range in his career and made 4 of 6, including all three in the fourth quarter.\n\n\r\n              Up next\r\n              The Mavericks visit the Miami Heat on Sunday night while the Nuggets head to Los Angeles to play the Lakers on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998263.2653499
}