{
  "game_id": "0022000206",
  "espn_id": "401267366",
  "date": "Jan 18, 2021",
  "matchup": "MIA vs. DET",
  "headline": "Heat rally from 19 down, top Pistons 113-107 to end slide",
  "body": "MIAMI -- — The Miami Heat eventually showed up to a game already behind schedule.\n\n\r\n                    Bam Adebayo had 28 points and 11 rebounds and the short-handed Heat got their biggest comeback win of the season, rallying from 19 down to beat the Detroit Pistons 113-107 on Monday night to snap a three-game slide.\n\n\r\n                    “It was not pretty. It was ugly,\" Miami guard Goran Dragic said. “But we're happy.\"\n\n\r\n                    Dragic scored 22 points for the Heat, who got 18 apiece from Duncan Robinson and Kendrick Nunn. Miami was again without Jimmy Butler and Avery Bradley (virus protocols), Tyler Herro (neck) and Meyers Leonard (shoulder).\n\n\r\n                    “In some ways it feels like two wins, just because we are persevering though a lot of different things without feeling sorry for ourselves or making excuses,” Heat coach Erik Spoelstra said. “I really commend the way the guys have handled all of this.”\n\n\r\n                    Jerami Grant had 27 points for Detroit, but his layup that could have gotten the Pistons within three was blocked by Adebayo with 31 seconds left. Wayne Ellington made seven 3-pointers and scored 24 for the Pistons, who got 21 from Derrick Rose and 15 from Mason Plumlee.\n\n\r\n                    Detroit's Blake Griffin was shaken up in the final seconds and limped off the court after the final buzzer. He had five points in 36 minutes.\n\n\r\n                    The game was supposed to start at 3 p.m. Eastern; it started at 8 p.m., delayed by the NBA to allow time for COVID-19 tests to be processed.\n\n\r\n                    “We found out mid-morning when we already had our walkthrough, our breakfast and testing,” Pistons coach Dwane Casey said. “So, it just changed the time that the bus left. ... We can’t even leave the rooms anyway.”\n\n\r\n                    Waiting all day didn’t seem to bother Detroit early.\n\n\r\n                    It was 11-2 when Spoelstra called his first timeout after three minutes, and 12-2 when the timeout ended. A review of a jumper by Ellington showed it was a 3-pointer, not a 2-pointer, and just like that the Pistons were up 10.\n\n\r\n                    Detroit’s lead was 28-9 after 7 minutes following another 3 by Ellington.\n\n\r\n                    The Heat chipped away, briefly held the lead late in the half, and used a 24-10 run to take a 12-point lead early in the fourth.\n\n\r\n                    “We knew they were going to come out better in the second half,” Ellington said.\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Detroit is one of two teams without consecutive wins this season. The other is Miami. ... Ellington got fouled twice on 3-pointers, making all three free throws on the first, missing after making the 3 on the second. ... Grant is the 12th Piston to score 20 points in at least 12 consecutive games.\n\n\r\n                    Heat: Miami has used nine starting lineups through 12 games, with Dragic starting Monday for the first time this season. Brooklyn and Cleveland have also used nine starting lineups; Utah is the only team to use only one. ... Dragic’s first assist was the 4,000th of his career.\n\n\r\n                    KING TRIBUTE\n\n\r\n                    As part of the Martin Luther King Jr. Day celebration, a recording of the Black national anthem — “Lift Every Voice and Sing” — was played pregame, preceding “The Star-Spangled Banner.” The teams gathered at midcourt, holding a banner bearing King's words “I Have A Dream.”\n\n\r\n                    ROBINSON'S 100\n\n\r\n                    Robinson has 326 3-pointers through his first 100 games. That's 76 more than any other player has managed in his first 100 games; Dallas' Luka Doncic had 250.\n\n\r\n                    SCHEDULE QUIRK\n\n\r\n                    The last five Heat-Pistons games have been in Miami. The last time Miami went to Detroit was exactly two years ago Monday. Miami will visit the Pistons once in the season’s second half.\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Visit Atlanta on Wednesday.\n\n\r\n                    Heat: Visit Toronto in Tampa, Florida, on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997822.29105
}