{
  "game_id": "0021601172",
  "espn_id": "400900550",
  "date": "Apr 05, 2017",
  "matchup": "DAL @ LAC",
  "headline": "Clippers beat Mavs 112-101 behind 32 by Griffin",
  "body": "LOS ANGELES -- Blake Griffin is rounding into form just in time to bolster the Los Angeles Clippers in the playoffs.\nHe scored 32 points -- his third straight game of at least 31 -- and the Clippers led all the way in beating the Dallas Mavericks 112-101 on Wednesday night. Los Angeles moved within a half-game of idle Utah for the No. 4 playoff seed in the West.\n\"We keep forgetting he missed a huge part of the season,\" Clippers coach Doc Rivers said. \"He's getting ready.\"\nGriffin returned Jan. 23 after missing 20 games while recovering from a procedure on his right knee.\n\"He's mixing it up and scoring every way,\" Rivers said. \"He's shooting, driving and passing. When he faces up and goes, it is either a bucket or a foul. He feels healthy enough to do that more.\"\nJ.J. Redick added 25 points and DeAndre Jordan had 20 rebounds in the Clippers' fourth straight victory and eighth in 10 games. Chris Paul had 22 points and 11 assists.\nHarrison Barnes led the Mavs with 15 points despite five fouls. They've lost six of seven with four games left in their season. Dirk Nowitzki was held to nine points -- under his 14.4 average -- a night after the 38-year-old forward sat out the Mavs' loss at Sacramento with a sore Achilles tendon.\nThe Clippers made their first nine shots of the game, with Luc Mbah a Moute narrowly missing a finger roll to end the stretch leading 22-6. They shot 61 percent in the first quarter and eventually led by 17.\n\"We made some jumpers, but we didn't break their rhythm or anything,\" Nowitzki said. \"We just had some bad stretches there where we couldn't score. We had some bad miscommunication with defense, and they made us pay.\"\nDallas got within seven in the second before the Clippers extended their lead to 18 and went into halftime ahead 62-49.\nYogi Ferrell scored nine of the Mavs' first 18 points to open the third, cutting their deficit to six. The rookie guard played defense, too, stripping Paul of the ball on the baseline for a layup to complete back-to-back baskets.\n\"They just kept fighting,\" Rivers said. \"They had a lot of reasons to say `game over' and that made us keep playing.\"\nFerrell finished with 14 points, matching JJ Barea.\nThe Clippers regrouped and closed on a 17-6 run, including eight by Griffin, for a 90-73 lead going into the fourth. The spurt featured Jordan making two straight free throws, something he hadn't done all game, and Paul hitting a step back jumper in the right corner with the shot clock winding down.\nMarreese Speights opened the fourth with a 3-pointer that pushed the Clippers' lead to 20, their largest of the game.\nBut the Mavs weren't done yet.\nNicolas Brussino rallied them within 10 on a 3-pointer from the left corner as the shot clock expired. Griffin answered with a 3 of his own before Brussino made another 3 and the Mavs were down nine.\n\"He's just been crazy aggressive, crazy efficient,\" Paul said of Griffin. \"He's just been our beast, that's what we call him and stuff like that, so we are going to keep feeding him.\"\nThey got no closer, with the Clippers making all six of their free throws over the final 2 1/2 minutes.\nTIP-INS\nMavericks: Nowitzki tied former Mav Jason Kidd for eighth on the NBA's all-time games played list with his 1,391st. ... Rookie Ferrell made his 25th start of the season. He replaced Seth Curry, who missed his third straight game because of a left shoulder strain.\nClippers: Redick is six 3-pointers (194) from tying his career high and single-season franchise record of 200 made. He set the mark in each of the last two seasons. ... Coach Doc Rivers is two wins from passing Mike Dunleavy (215) for most regular-season victories in franchise history. ... They split the season series 2-2.\nHE SAID IT\n\"We could take care of business in the next four and still not have it.\" -- Rivers on possibility of his team moving up to the No. 4 playoff seed.\nUP NEXT\nMavericks: Host San Antonio on Friday. The Mavs have lost two of three to the Spurs in the season series.\nClippers: Visit San Antonio on Saturday. The Clippers have won two of three so far.\n---\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764996093.518045
}