{
  "game_id": "0021501139",
  "espn_id": "400829026",
  "date": "Apr 02, 2016",
  "matchup": "CHI vs. DET",
  "headline": "Jackson, Harris lift Pistons over Bulls 94-90",
  "body": "CHICAGO --  Detroit Pistons coach Stan Van Gundy said it was the biggest victory of most of his starters' careers.\n\n\"Hopefully there's bigger ones to come,\" Van Gundy said.\n\nReggie Jackson scored 22 points, Tobias Harris added 21 and the Pistons overcame Jimmy Butler's first career triple-double to beat the Chicago Bulls 94-90 on Saturday night.\n\nThe Pistons are fighting for one of the remaining playoff spots in the Eastern Conference and their first postseason appearance since 2008-09. They are a half-game ahead of Indiana for seventh in the East and 2 1/2 games up on ninth-place Chicago.\n\n\"This is the biggest game I've played in my career, probably the most meaningful game thus far,\" Harris said. \"I'm in my fifth year in the league, but for a lot of young guys on our team, that type of experience is valuable.\"\n\nMarcus Morris had 16 points and Andre Drummond had 11 points and 11 rebounds for the Pistons.\n\n\"We feel like we got a little more comfortability, but can't think like that,\" Jackson said. \"We need each and every one of them.\"\n\nButler had 28 points and career highs of 17 rebounds and 12 assists. Pau Gasol had 16 points and 14 rebounds.\n\n\"I just felt like I could have done more,\" Butler said. \"I could have made some more shots or played better defense. There's always room for improvement. All I want to do is win. I didn't do my job. We as a whole didn't do our job.\"\n\nJackson's jumper gave Detroit an 86-83 lead with 1:46 left. After E'Twaun Moore and Butler missed 3s, Harris scored on a putback for a five-point lead. Morris made two free throws for Detroit's largest lead at seven with 43.3 seconds left after Butler missed a layup and committed a foul.\n\nChicago cut it to 90-88 on Butler's 3 and two free throws after Jackson committed an offensive foul.\n\nButler briefly went down but remained in the game when Jackson drove to the basket with 20.4 seconds remaining. The officials reviewed the play and confirmed Butler's blocking foul. Butler said he was hit in the ribs.\n\n\"It's tough to swallow,\" Butler said. \"We need to win as many games as possible, and we didn't get this one.\"\n\nThe Pistons made their final eight free throws, including four by Jackson in the last 20 seconds.\n\nDetroit shot 42.1 percent from the field while Chicago shot 38.6 percent.\n\n\"Both teams missed some shots they're accustomed to making,\" Jackson said. \"Late in the season, everybody's a little fatigued. Numbers tend to fall a little bit at this time, so you've just got to continue to find a way to push through and try to persevere.\"\n\nButler went 10 for 25 from the field and grabbed five offensive rebounds. He also had three steals and two blocked shots.\n\n\"We survived it, thank God,\" Van Gundy said.\n\nDOUBLEHEADERS\n\nDetroit was finishing a back-to-back after losing 98-89 to Dallas on Friday. The Pistons are 10-8 in second games of back-to-backs. \"When you play the most back-to-backs in the league, the one thing is you get used to it,\" Van Gundy said. \"Looking at (the Bulls) schedule today, we play five more back-to-backs than they do. That's what the NBA calls equitable scheduling. But the advantage is you're in that situation a lot, so guys are used to it.\"\n\nONCE AGAIN\n\nBulls G Derrick Rose maintained that he is fortunate despite the many injuries in his career. He said he is unsure if he'll be ready to play Sunday against Milwaukee due to his bruised elbow. \"I'm too blessed, man,\" he said. \"I've played in numerous games this year. Still got a chance to make the playoffs. So I'm not worried about being out.\"\n\nTIP-INS\n\nPistons: Detroit has won three of four games against Chicago this season. ... The Pistons went 6-3 during their most recent homestand. ... Three of Detroit's five remaining games are on the road.\n\nBulls: Rose (elbow) and F Taj Gibson (rib) did not play. Rose said his elbow is improving but remains tender, and he is unable to dribble with that arm. He also missed the second half of Thursday's game against Houston. ... Gibson returned to the team Saturday after traveling to New York for a personal issue. ... Moore started instead of Rose, and Bobby Portis made his second start in place of Gibson. ... Gasol became the 38th NBA player with 10,000 career rebounds. He is also the 36th with 10,000 points and 10,000 rebounds.\n\nUP NEXT\n\nPistons: Tuesday night at Miami.\n\nBulls: Sunday night at Milwaukee.",
  "source": "espn_api",
  "crawled_at": 1764993896.311004
}