{
  "game_id": "0021900238",
  "espn_id": "401160880",
  "date": "Nov 24, 2019",
  "matchup": "PHX @ DEN",
  "headline": "Nuggets rally to beat Suns for 5th straight victory",
  "body": "DENVER --  Will Barton wasn't happy with his energy in the first half, so he pledged to pick it up in the third quarter.\n\nHe delivered on his promise and led the Denver Nuggets to their fifth straight victory.\n\nBarton scored 12 of his 22 points in a momentum-turning third quarter, Paul Millsap finished with 23 points in Denver's 116-104 victory over the Phoenix Suns on Sunday night.\n\nJamal Murray had 22 points, and Nikola Jokic had just eight points, but grabbed 13 rebounds to help the Nuggets win their ninth in the last 10 games.\n\nIt took a shutdown second half against a tired team, led by Barton's energy.\n\n\"I felt like in the first half my energy wasn't there and I wasn't flying around on defense good enough so I told them I'm going to bring it the third quarter,\" Barton said.\n\nDenver held Phoenix guard Devin Booker to a season-low 12 points on 5-of-13 shooting. Booker came in averaging 26.2 points in November but showed fatigue in the Suns' fifth game in seven days.\n\n\"I'm glad we got it out of the way,\" Booker said. \"Two back-to-backs in one week, I haven't heard of that before, but it's what the schedule presented to us.\"\n\nCheick Diallo led Phoenix with a career-high 22 points and Dario Saric had a career-high 17 rebounds to go with 18 points.\n\nBooker had just seven points into the fourth quarter, but the Suns led most of the game until the Nuggets rallied. Phoenix was again without center Aron Baynes and guard Ricky Rubio, and the lack of depth showed in the third when the team combined for 7-of-22 shooting. Booker missed all four of his attempts.\n\n\"Just missing shots,\" Booker said. \"I'm sure I'll be fine and I know getting Ricky and Aron back will help out to that.\"\n\nDenver used a 10-2 run late in the third quarter to take its first lead since the first quarter. Barton had 12 points in the period and Millsap seven before picking up his fourth foul.\n\n\"He was getting offensive rebounds, putbacks, he was locking up,\" center Mason Plumleaid of Barton. \"He changed the game and he told us he was going to.\"\n\nThe Nuggets led 88-87 early in the fourth, then used a 13-4 run to take a 101-91 lead. Malik Beasley, who had been out of the rotation, hit a 3-pointer with 5:11 remaining to make it 104-93.\n\nBooker hit his only 3-pointer of the night to pull Phoenix within eight, but Denver went on a 9-2 run to put it out of reach.\n\nTIP-INS\n\nSuns: Rubio has missed three of the last four games with back spasms and played only 16 minutes in the other game. ... Baynes has missed four straight games with a right hip flexor strain. ... Elie Okobo scored a season-high 14 points. He had 11 in the first half.\n\nNuggets: Plumlee shook off a headache earlier in the day to score 14 points and Monte Morris added 10 off the bench. ... C Bol Bol was recalled from Windy City of the G League. Bol, the team's first-round pick out of Oregon in June, played four games for the Bulls, averaging 11.5 points, 6.5 rebounds and 2.3 blocks in 16.9 minutes per game.\n\nSHORT-TIMER\n\nSuns coach Monty Williams played 456 games over 10 NBA seasons, including a short stint with Denver. The Nuggets signed Williams to a free-agent contract on Jan. 23, 1999, and he got into one game for six minutes before being cut 20 days after signing with Denver.\n\n\"I wasn't here long enough to have a memory,\" Williams said Sunday. \"It wasn't anything worth talking about. I messed my ankle up real bad and tore a couple of ligaments and played on it. Should have been in today's environment; they would have let me sit out the whole year.\"\n\nWilliams is in the stats book with the Nuggets. He hit one free throw and missed both of his shot attempts.\n\nUP NEXT\n\nSuns: Host Washington on Wednesday night.\n\nNuggets: Host Washington on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764996584.523902
}