{
  "game_id": "0021400979",
  "espn_id": "400579271",
  "date": "Mar 14, 2015",
  "matchup": "MIL @ MEM",
  "headline": "Lee leads 5 in double figures, Grizzlies beat Bucks 96-83",
  "body": "MEMPHIS, Tenn. --  Courtney Lee snapped out of his shooting slump and the result was a more balanced attack for the Memphis Grizzlies.\n\nLee, who entered the game shooting 26 percent in the last six games, scored 17 points Saturday night to lead the Grizzlies to a 96-83 victory over the Milwaukee Bucks.\n\nLee spent extra time taking shots Friday and said the work helped him in connecting on 6 of 10 from the field, including a pair of 3-pointers.\n\n\"It was just the fact that I needed to see something go in,\" Lee said, later adding: \"When you get that rhythm and see those shots go down, that's all it takes. Once you make one, you're on fire.\"\n\nLee's shooting helped open the rest of the offense, leading to all five Memphis starters reaching double figures. Jeff Green and Zach Randolph had 15 points apiece. Beno Udrih, starting in place of the injured Mike Conley, scored 14 points as Memphis ended a two-game losing streak. Marc Gasol finished with 12 points, seven rebounds and seven assists.\n\nBecause of the Grizzlies guards' shooting struggles, coach Dave Joerger said before the game that Memphis opponents don't fear the perimeter game. That allows teams to collapse in the paint, he said.\n\nThat changed with Memphis going 8 of 14 from 3-point range.\n\n\"We need our guards to shoot well for us to operate down in the paint and open it up,\" Randolph said. \"Teams are double-teaming me and Marc. They're just leaving our guards open, so we've got to make them pay.\"\n\nGiannis Antetokounmpo led the Bucks with 19 points, shooting 7 of 10. Khris Middleton finished with 17, while Zaza Pachulia scored 14. Ersan Ilyasova added 12 for Milwaukee, which lost its second straight and ninth in the last 12.\n\nThe key stretch was in the second and third quarters, when the Grizzlies outscored the Bucks 56-41.\n\n\"The second and third quarters, we have been struggling a little bit defensively getting stops,\" Bucks coach Jason Kidd said. \"Those have been our highest quarters giving up points.\"\n\nThe Bucks hit six of their first seven shots and built an early 10-point lead. But Memphis held a 13-point advantage in the second quarter to carry a 49-42 lead into the break. The lead would reach 17 in the third and as many as 19 for Memphis in the fourth quarter.\n\nMilwaukee only got the margin under double digits once in the fourth quarter.\n\n\"We are fighting,\" Pachulia said. \"They opened the lead, and we came back all the way to single digits. Nobody is going to feel sorry about us.\"\n\nThe game was a much better effort from Memphis, which has struggled with energy and consistency since the All-Star break, playing .500 basketball.\n\n\"We've got 16 or 15 games left before the playoffs,\" Randolph said, \"and we want to go in with some rhythm and play Grizzlies basketball.\"\n\n---\n\nTIP-INS:\n\nBucks: Milwaukee has lost eight straight road games. ... Milwaukee forced 15 Memphis turnovers. The Bucks are the only team in the league to force at least 10 turnovers in every game this season. ... Middleton has reached double figures in 19 straight games.\n\nGrizzlies: Gasol played 34 minutes, moving him past older brother Pau Gasol for third in franchise history for total minutes played. ... Joerger moved past Mike Fratello for second in coaching wins. . Memphis recorded its 12th sellout of the season. ... The Grizzlies are 11-1 against the Eastern Conference at home.\n\nMCW OUT\n\nBucks starting guard Michael Carter-Williams was a late scratch with a sore ankle that he was unable to get loose during warmups. That led to Tyler Ennis, a rookie from Syracuse, starting his first game of the season. \"It wasn't a setback,\" Kidd said. \"The next guy was up. Tyler stepped up, and I thought Tyler played a great game.\"\n\nUP NEXT:\n\nBucks: Visit New Orleans on Tuesday\n\nGrizzlies: Host Denver on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764991761.009838
}