{
  "game_id": "0022200601",
  "espn_id": "401468756",
  "date": "Jan 08, 2023",
  "matchup": "MIN @ HOU",
  "headline": "Russell, Edwards help Timberwolves beat Rockets 104-96",
  "body": "HOUSTON -- — D’Angelo Russell scored 22 points and Anthony Edwards added 21 as the Minnesota Timberwolves overcame a big early deficit to beat the Houston Rockets 104-96 Sunday night for their fourth straight win. \n\n\r\n              Minnesota scored the first 11 points of the fourth quarter to take an 88-81 lead. Rudy Gobert had four points in that span and Taurean Prince added a 3-pointer. Houston missed six shots and had a turnover to help the Timberwolves go on top. \n\n\r\n              Kenyon Martin Jr. had a dunk for Houston’s first points of the quarter, but Minnesota scored the next six points to push the lead to 94-83 with about six minutes to go.\n\n\r\n              An 8-2 run by Houston, with 3s by Kevin Porter Jr. and Martin, got the Rockets within five points a couple of minutes later. But Gobert got a dunk for the Timberwolves, starting a 6-0 spurt that made it 102-91 with about two minutes left to secure the victory. \n\n\r\n              Minnesota coach Chris Finch raved about the maturity Edwards has shown in recent games by staying focused when things aren't going well. \n\n\r\n              “That’s when his competitiveness comes out,” Finch said. “He knows that he’s going to make mistakes … he’s still learning his reads. But having said that, he cares and that’s what it all comes from.” \n\n\r\n              Minnesota's winning streak comes after the team dropped its previous six games. Finch was asked about the difference in his team in this stretch.\n\n\r\n              “We’re just doing a much better job of hanging together when things are tough,” he said. \n\n\r\n              He credited his team's defense in the second half for coming out on top Sunday night and said Gobert was the key to the improvement in that area.\n\n\r\n              “He was really good at affecting shots in the second half,” he said. \n\n\r\n              Porter had 25 points and Alperen Sengun added 18 for the Rockets, who dropped their seventh in a row. Jalen Green had a tough game, making just four of 15 shots overall, including just one of six 3-point attempts to finish with nine points. \n\n\r\n              The Rockets led by as many as 20 points early, but the Timberwolves cut the lead to 62-58 by halftime. \n\n\r\n              “We have to understand that this league is all about sustaining your play,” Houston coach Stephen Silas said. “And we are a wildly inconsistent team where we have highs and lows and we’re working to either maintain the highs or just find a middle ground.”\n\n\r\n              Edwards made the first five points of the second half to put Minnesota up 63-62. Porter made a 3 for Houston before the Timberwolves scored the next seven points, with a 3 by Russell, to extend the lead to 70-65.\n\n\r\n              Porter made a 3 to end the run before both teams went on a scoring drought, with neither scoring for almost 2 ½ minutes. Jabari Smith Jr. scored the next points on a jump shot with about six minutes left in the quarter and his free throw a few second later put Houston on top 71-70.\n\n\r\n              A basket by Prince gave the Timberwolves a one-point lead later in the third quarter. But Houston scored the last five points of the period to take an 81-77 lead into the fourth. \n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Gobert had 18 points and 11 rebounds. ... Jaden McDaniels had 12 points and nine rebounds. … Minnesota outrebounded Houston 44-29.\n\n\r\n              Rockets: Martin had 12 points off the bench. … Eric Gordon added 11 points with four assists. … Houston made just 11 of 36 3-pointers. \n\n\r\n              PRINCE'S PERFORMANCE\n\n\r\n              Prince had 14 points in his third game back after missing 21 games with a shoulder injury. He has scored at least 10 points in each game since returning, and Finch said the veteran has given the team a boost. \n\n\r\n              “He’s huge,” Finch said. “He was really good for us throughout the game. He made a couple of clutch shots for us.” \n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Visit Detroit on Wednesday night. \n\n\r\n              Rockets: Play consecutive games at Sacramento on Wednesday and Friday to start a four-game trip. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995173.3273542
}