{
  "game_id": "0022401057",
  "espn_id": "401705623",
  "date": "Mar 26, 2025",
  "matchup": "MIL @ DEN",
  "headline": "Jokic gets a triple-double in his return to lead Nuggets past Bucks 127-117",
  "body": "DENVER -- — Nikola Jokic had 39 points, 10 rebounds and 10 assists in his first game back in nearly two weeks to lead the Denver Nuggets to a 127-117 victory against the Milwaukee Bucks on Wednesday night.\n\n\r\n              The triple-double was Jokic’s NBA-leading 30th of the season. The reigning NBA MVP missed the team’s previous five games with an injured left ankle.\n\n\r\n              Michael Porter Jr. added 23 points for the Nuggets on a night when he made his first six shots, including his first five 3-pointers.\n\n\r\n              It was the Bucks’ first game since it was announced star guard Damian Lillard was diagnosed with blood clots in his right calf. Milwaukee was also without two-time MVP Giannis Antetokounmpo, who was sidelined with a sprained left foot that coach Doc Rivers said he was informed of at the team’s shootaround Wednesday.\n\n\r\n              Brook Lopez had 26 points for the Bucks, marking the third consecutive game in which the veteran big man has finished with at least 20 points. Seven of the eight Milwaukee players who took the court Wednesday scored in double figures.\n\n\r\n              Takeaways\r\n              Nuggets: Jokic’s big game saved Denver on a night during which it routinely struggled defensively against a depleted opponent. The Nuggets had lost three of their previous four games.\n\n\r\n              Bucks: Milwaukee performed well without three of its top four scorers – forward Bobby Portis is still serving a 25-game suspension – but fell to 4-7 in its past 11 games.\n\n\r\n              Key moment\r\n              After not trailing for the opening 31 minutes, the Nuggets fell behind 88-83 in the third quarter, but immediately responded with a 13-1 run capped by a 3 from Christian Braun.\n\n\r\n              Key stat\r\n              Russell Westbrook’s steal in the first quarter was the 1,944th of his career, tying Kobe Bryant for the 16th most in NBA history. Two nights earlier, Westbrook surpassed Kevin Garnett as the NBA’s No. 20 all-time scorer.\n\n\r\n              Up next\r\n              Nuggets: Host Utah on Friday night.\n\n\r\n              Bucks: Host New York on Friday night.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998117.3644722
}