{
  "game_id": "0022300610",
  "espn_id": "401585238",
  "date": "Jan 22, 2024",
  "matchup": "CHA @ MIN",
  "headline": "Towns scores franchise-record 62 points, but Hornets rally for 128-125 win over Timberwolves",
  "body": "MINNEAPOLIS -- — Karl-Anthony Towns scored a franchise-record 62 points, including 44 in the first half, but the Charlotte Hornets erased an 18-point deficit and stunned the Minnesota Timberwolves 128-125 on Monday night.\n\n\r\n              Towns managed just four points on 2-for-10 shooting in the fourth quarter, when the Timberwolves were outscored 36-18. He thought he was fouled on a drive to the basket in the closing seconds and Minnesota trailing by one, then was short on a 3-point attempt on the final possession.\n\n\r\n              “Having a night like that on a loss doesn't feel very good or historic,” Towns said.\n\n\r\n              Miles Bridges scored 28 points and Brandon Miller had 27 for the Hornets. Leaky Black ripped the ball away from Towns on his way to the basket to preserve the Hornets’ 10th victory of the season.\n\n\r\n              Charlotte went ahead for good at 122-121 on P.J. Washington's floater with 3:21 remaining. LaMelo Ball added 18 points for the Hornets, who had lost seven of their past eight games and had the Eastern Conference's third-worst mark entering Monday.\n\n\r\n              Towns finished 21 for 35 from the floor, including 10 for 15 from 3-point range, and now owns the top three scoring outputs in the Wolves' 35-year history.\n\n\r\n              “Luckily, (Towns) started missing at the end,” Bridges said. “There’s not too much you can do with a 7-footer that can shoot the ball as good as he does. ... It’s tough for him. Obviously, he’s having a great night and you want to win that game, but at the same time, it’s a team game, so we we had to spoil his night a little bit. KAT is a great player, but it was our night.”\n\n\r\n              The Wolves ran an isolation look for Towns with 12 seconds left, but Black blocked his driving layup attempt, then hit a pair of free throws at the other end.\n\n\r\n              Towns' desperation 3 inside the final second ensured the 21st time in NBA history a player has scored 60 or more points in a loss.\n\n\r\n              “There’s no moral victories,” Towns said. \"It was cool when we were saying that when we were 15-30 (in previous seasons). \n\n\r\n              “But we're No. 1 in the West, one of the best teams in NBA; there ain’t no time for moral victories, silver linings, ‘great night, but just not a not a finish we wanted’ — we've got to find a way to win. It’s about winning the game. It’s about staying No. 1 in the West. It’s about protecting our home court more, most importantly above all things.”\n\n\r\n              Charlotte, the NBA's No. 27 team in offensive rating, shot a season-high 58.1% from the floor.\n\n\r\n              “It was an absolute disgusting performance of defense and immature basketball all through the game,” Minnesota coach Chris Finch said.\n\n\r\n              LaMelo Ball returned after a one-game absence due to a sore right ankle and had 18 points and 13 assists. He had missed 20 games before playing in four straight, then sitting out the Hornets' 97-89 loss against Philadelphia on Saturday.\n\n\r\n              The short-handed Hornets again deployed an undersized front court, with 6-foot-7 center Washington starting for the injured Nick Richards (right ankle sprain). Center Mark Williams and forward Gordon Hayward continue to recover from a lower back injury and left calf strain, respectively.\n\n\r\n              Forward Cody Martin also missed Monday's game with a right knee contusion.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Visit Detroit on Wednesday.\n\n\r\n              Timberwolves: Visit Washington on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995652.920856
}