{
  "game_id": "0022200049",
  "espn_id": "401468204",
  "date": "Oct 24, 2022",
  "matchup": "MEM vs. BKN",
  "headline": "Bane and Morant score 38 each as Grizzlies beat Nets 134-124",
  "body": "MEMPHIS, Tenn. -- — Ja Morant and Desmond Bane scored 38 points each to lead the Memphis Grizzlies to a 134-124 victory over the Brooklyn Nets on Monday night.\n\n\r\n              Morant and Bane also each had seven assists. Bane, who struggled shooting to start the season, was 14 of 21 overall and 8 of 11 from 3-point range, the eight 3-pointers a career-high. Santi Aldama scored 17 points for Memphis. The 76 points by the Grizzlies guards was the most by a two-player tandem in franchise history.\n\n\r\n              “I felt good about everything,” Bane said of his early season shooting. “A lot of the misses were in-and-out, back rim. I feel like that’s just kind of getting my legs back under me. …I knew it was just a matter of time before I caught my rhythm.”\n\n\r\n              Morant added that Bane being able to score at various levels from 3-point range to getting to the rim, plus handing out assists “is a big key to our success this year, having another guy out there on the floor who can create for everybody. Tonight, I thought was his best game at doing both at a high level.”\n\n\r\n              Kevin Durant and Kyrie Irving each scored 37 points for the Nets, Nic Claxton finished with 16 points.\n\n\r\n              Durant pointed to Memphis making 16 3-pointers in the game, 12 of them from Bane and Morant. The Nets were 9 of 29 from outside the arc.\n\n\r\n              “The 3-point line killed us,” Durant said, adding: “It was that 3-point line that separated us. The fact that they knocked down more 3s than us, that’s the name of the game now. Even if you’re not playing well or up to par with your opponent, if you’re making 3s, you give yourself a chance.”\n\n\r\n              Memphis broke open a close game with a 17-2 run early in the third quarter. Bane scored 19 in the period. Durant was able to keep the Nets close but had little help as the Grizzlies extended their lead to as many as 15. Despite Durant’s 17 in the quarter, Memphis outscored the Nets 45-28 in the third.\n\n\r\n              “I thought we lost our focus a little bit, especially starting the third,” Nets coach Steve Nash said. “I called an early timeout, but we gave up 45 (points) in the third, and that was it.”\n\n\r\n              Bane and Morant both emphasized the offensive outburst and the 3-point shooting makes defending the Grizzlies that much tougher.\n\n\r\n              “I think it opens things up for us, of course, but I mean the whole team,” Bane said. “I mean, 76 between the both of us, it’s something we take pride in, sharing the ball and getting everyone involved.”\n\n\r\n              TIP-INS: \n\n\r\n              Nets: Durant passed Alex English (25,613) for 20th on the NBA’s all-time scoring list. … Have a seven-game losing streak to Memphis. …Markieff Morris was out for personal reasons. Nash said Morris would not be available for Wednesday’s game at Milwaukee. “We’ll see him when we get back home.”\n\n\r\n              Grizzlies: F Dillon Brooks, listed as questionable before the game with a sore left thigh, made his first appearance of the season. …Bane’s previous career-high for 3-pointers was in February against Portland. .Entering the game, Bane was 8 of 28 from 3-point range. …C Steven Adams had 13 rebounds. .Morant had eight rebounds.\n\n\r\n              UP NEXT: \n\n\r\n              Nets: Play the Bucks in Milwaukee on Wednesday.\n\n\r\n              Grizzlies: Start a four-game road trip on Thursday in Sacramento against the Kings.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994245.541641
}