{
  "game_id": "0021900952",
  "espn_id": "401161594",
  "date": "Mar 08, 2020",
  "matchup": "IND @ DAL",
  "headline": "Sabonis, Oladipo lead Pacers past Mavericks 112-109",
  "body": "DALLAS --  Domantas Sabonis had 20 points and 17 rebounds, and Victor Oladipo scored the game’s final six points to help the Indiana Pacers beat the Dallas Mavericks 112-109 on Sunday night.\n\nDespite leading for most of the game, the Pacers were down 109-104 with 3:14 to play -- but held the Mavericks scoreless the rest of the way.\n\nOladipo gave Indiana the lead for good when he hit a pull-up 17-footer with 38.3 seconds to play, then added two free throws with 13.7 seconds left. Luka Doncic missed two long 3s on Dallas' final possession and the Pacers rebounded the ball as time expired.\n\n“We got stops,” Oladipo said. “At the end of the day, you can make big shots down the stretch, but we got stops down the stretch and we gave ourselves a chance to win on the road in a tough environment.”\n\nOladipo is in just his 12th game back after missing a full year of action due to a ruptured quadriceps tendon in his right leg. Coach Nate McMillan is managing his minutes and checked Oladipo back in with six minutes to play and the Pacers trailing by two.\n\nDoncic scored 36 points and Tim Hardaway Jr. had 20 of his 30 in the second half. But Dallas suffered from a short roster – only 10 players dressed due to injuries and illness – and an off-night from Porzingis, who shot 3 for 17 and scored only nine points.\n\n“I wasn't getting many open looks,” Porzingis said. “I give credit to them for doing a better job this game, but it's also on me missing good shots.”\n\nPorzingis had scored 38 in the Mavericks' 112-103 win in Indianapolis in February, when Dallas played without an injured Doncic.\n\n“Last game, he killed us with the pick and pop,” Sabonis said. \"Tonight, we switched, something that we don’t usually do. Coaches stressed this and we tried to execute it.”\n\nDallas took its first lead of the game at 94-93 with 9:33 to play when Justin Jackson hit a 3.\n\nROUGH NIGHT\n\nPorzingis had been the hottest Mavs player averaging 30 points and 12 rebounds over his last five games. But Indiana met him with more physicality and held Porzingis below double figures for only the fifth time in 50 games this year.\n\n“That's pretty much every team's game plan is to be physical with us and make us work hard for every basket,” Porzingis said.\n\nLUKA UPSET\n\nDoncic was not happy after the game when referees missed an elbow he took to the face from Oladipo on the Mavericks' second-to-last possession.\n\n“That should be a foul and they should look at it,” Doncic said. “I think the rule is when you get hit in the face, they gotta look at if it's a flagrant or no, right?”\n\nEarlier in the game, Doncic shot-faked Indiana’s Edmond Sumner into the air, and Sumner inadvertently kneed Doncic in the right jaw on the way down. Both players got up and stayed in the game.\n\nTIP-INS\n\nPacers: Sabonis' double-double was his 50th of the season, breaking Troy Murphy's franchise record set in 2008-09. ... C Myles Turner, who played high school basketball at nearby Euless Trinity and one year at the University of Texas, scored 16 points. ... T.J. Warren also had 16 but fouled out with 3:14 to play after Doncic drew the last of three fouls on the Pacers defender over a 12-second span.\n\nMavericks: Jackson scored 11 points, the only Dallas player in double figures besides Doncic and Hardaway. ... The loss ended a four-game home winning streak for the Mavericks. ... Dallas is still without F Dorian Finney-Smith (hip) and Gs Seth Curry (ankle) and Jalen Brunson (shoulder). And F Michael Kidd-Gilchrist also sat out due to illness.\n\nUP NEXT\n\nPacers: Host the Boston Celtics on Tuesday.\n\nMavericks: Visit the San Antonio Spurs on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995830.9190688
}