{
  "game_id": "0022200267",
  "espn_id": "401468422",
  "date": "Nov 23, 2022",
  "matchup": "CHI @ MIL",
  "headline": "DeRozan scores 36, Bulls down Bucks 118-113",
  "body": "MILWAUKEE -- — DeMar DeRozan had 36 points and eight assists, and the Chicago Bulls beat the Milwaukee Bucks 118-113 on Wednesday night.\n\n\r\n              Chicago began the week with a 6-10 record and having lost four straight but has now beaten the NBA's top two teams. The Bulls ended Boston's nine-game winning streak on Monday.\n\n\r\n              “We’ve had some down moments, losing games in a row, dropping games we feel like we should have won. Getting our butts whooped at home,” DeRozan said. “We’ve kind of went through so many emotions already, 20 games into the season. Sometimes, that’s beneficial. You’ve got to soak in that hurt.”\n\n\r\n              Zach LaVine and Nikola Vucevic scored 18 points apiece for Chicago, and Coby White finished with 14 points.\n\n\r\n              Giannis Antetokounmpo had 36 points, 11 rebounds and seven assists for the Bucks, who lost for just the second time in 11 home games this season. Brook Lopez scored 20 points and Jrue Holiday had 14 points and 11 assists. \n\n\r\n              The Bucks committed 20 turnovers that led to 17 points for the Bulls.\n\n\r\n              “They are a really handsy team and they pack the paint,\" Holiday said.\n\n\r\n              Milwaukee led 109-106 before White made a tying 3-pointer with 1:15 left. After Antetokounmpo was called for a charge, White took a pass from DeRozan and buried another 3 to put the Bulls ahead to stay. \n\n\r\n              “My teammates trusted me,\" White said. \"I was just trying to help us win.”\n\n\r\n              The Bucks turned the ball over on the ensuing possession and DeRozan found Vucevic, who swished a corner 3.\n\n\r\n              The Bucks had won 17 of their previous 19 games, including playoffs, over their Central Division rivals.\n\n\r\n              “I’m happy with the way we competed. Milwaukee is a great team. They are champions,” Bulls coach Billy Donovan said. “It’s a great measuring stick but it is only one game.”\n\n\r\n              The team must focus on consistency, LaVine said.\n\n\r\n              “We can play against anybody and we can beat anybody but we have to have the same mindset each and every game,” he said. “Hopefully, we can start taking these wins and stacking them up.”\n\n\r\n              Antetokounmpo was limited to eight points on 4-of-11 shooting in the first half. He scored 11 points in the third quarter, but the Bulls held a seven-point advantage heading to the fourth.\n\n\r\n              The Bulls built a 10-point fourth-quarter lead before the Bucks battled back to tie it midway through the period.\n\n\r\n              Milwaukee led by as much as 12 in the second quarter before Chicago rallied. Holiday’s buzzer-beating jumper gave the Bucks a 62-61 halftime edge.\n\n\r\n              TIP-INS\n\n\r\n              Bulls: Guard Goran Dragic had an MRI and sat out with a left cervical stinger that he sustained in Monday’s game. The injury is causing tingling and numbness in Dragic’s hand, Donovan said. ... Donovan was whistled for a technical foul while arguing during a timeout. \n\n\r\n              Bucks: Milwaukee played the second of four consecutive games at home over a one-week span. ... Wes Matthews returned after missing three straight games with a right hamstring strain.\n\n\r\n              SENSTIVE AREA\n\n\r\n              LaVine was charged with a flagrant-1 foul, following a review, after he kicked George Hill while attempting a jump shot. The call sent LaVine to the bench with foul trouble. \n\n\r\n              “It was a good shot, but I hit him in the groin,” LaVine said. “Obviously, I didn’t try to. That’s a normal fadeaway for me. I’m glad we got the win and that didn’t affect it.”\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Oklahoma City on Friday.\n\n\r\n              Bucks: Host Cleveland on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994508.4005508
}