{
  "game_id": "0022200886",
  "espn_id": "401469041",
  "date": "Feb 23, 2023",
  "matchup": "DEN @ CLE",
  "headline": "Jokic has triple-double, Nuggets beat Cavaliers 115-109",
  "body": "CLEVELAND -- — Nikola Jokic began his final push for a possible third straight MVP by getting yet another triple-double.\n\n\r\n              This season, that means another Denver win.\n\n\r\n              Jokic had 24 points, 18 rebounds and 13 assists for his NBA-leading 22nd triple-double and Michael Porter Jr. scored 25, leading the Nuggets to a 115-109 victory over the Cleveland Cavaliers on Thursday night.\n\n\r\n              Jokic's 13th triple-double in 16 games helped the Western Conference-leading Nuggets come out of the All-Star break with an impressive road win over the Cavs, who dropped to 25-7 at home. The Nuggets improved to 22-0 when Jokic gets a triple-double.\n\n\r\n              “He’s the MVP,\" Nuggets coach Michael Malone said about his star center. \"When the MVP goes out and puts up a triple-double, it means a lot. He is a historically great player.”\n\n\r\n              There was no argument from the Cavs.\n\n\r\n              “I thought we had him contained until I looked up (at the scoreboard),\" Cavs star Donovan Mitchell said. “The bigs did a good but then in the second half he was the aggressor in different ways.\n\n\r\n              \"Look at what he and (Sixers star Joel) Embiid are doing on a nightly basis. It's next level. It's impressive and I think it's going to come down to those two. Hell of a player.”\n\n\r\n              Evan Mobley scored 31 points, but zero in the fourth quarter for Cleveland, which had its chances down the stretch. Mitchell and Darius Garland had 22 points apiece and Jarrett Allen added 14 points and 13 rebounds for the Cavs.\n\n\r\n              Porter made two 3-pointers and Jokic dropped another as the Nuggets went on a 13-4 run to take a 114-109 lead with 2:15 left. Cleveland then missed shots on its next three possessions — Mitchell twice misfired — allowing Denver to escape with a win in a game that had playoff intensity.\n\n\r\n              Jamal Murray returned to Denver's lineup after missing six games due to soreness in his right knee. He had 16 points and nine assists.\n\n\r\n              Reggie Jackson, making his debut with Denver after being signed last week, ended the third quarter by making a 55-foot shot to pull the Nuggets to 91-89. Jackson was recently waived by Charlotte after being acquired from the Clippers in a trade deadline deal.\n\n\r\n              LOVE LOST\n\n\r\n              This was Cleveland's first game since Kevin Love accepted a contract buyout from the Cavs during the break and signed with Miami.\n\n\r\n              Allen joked that Love's move caught him off guard.\n\n\r\n              “I was told he was going for milk and cigarettes and he just never came back, Allen cracked before acknowledging Love's absence will hurt.\n\n\r\n              “It was definitely sad to see him go,” he said. \"He was a great guy for the 2 1/2 years I've known him. He did a lot for this team, whether it was bringing energy, making sure we were loose. Personality-wise, we're definitely going to miss him.\"\n\n\r\n              MOST VALUBLE \n\n\r\n              A two-time MVP, Jokic could become the first player to win the aware three straight years since Larry Bird (1984-86). If he had a vote, Cavs coach J.B. Bickerstaff would give it to Denver's well-rounded star.\n\n\r\n              “It’d be hard not to, to be honest with you,” he said.\n\n\r\n              Bickerstaff noted that criteria for voting has changed.\n\n\r\n              \"Is it the best player in the game or is it the most talented player on the best team?\" he said \"Is it the guy who’s most impactful for his team? I think there’s been a variance in how it’s been voted for. It’s hard to argue against him this year though, for sure.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: While Murray came back, Denver didn't have All-Star Aaron Gordon (rib), who missed his fourth straight game and could be out a little longer. “It's not where I wish it would be,” coach Michael Malone said of Gordon's ailment. “I just hope at some point we can be whole again.”\n\n\r\n              Cavaliers: Mobley only took two shots in the fourth. ... G Ricky Rubio (knee management) sat out as the team continues to closely monitor him following knee surgery. The plan is for Rubio to play Friday in Atlanta, but Bickerstaff said the Cavs will “err on the side of caution. Safety first.” ... Danny Green didn't play in his first home game with the Cavs since signing last week.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At Memphis on Saturday night.\n\n\r\n              Cavaliers: At Atlanta on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994689.3106828
}