{
  "game_id": "0022200261",
  "espn_id": "401468416",
  "date": "Nov 23, 2022",
  "matchup": "CLE vs. POR",
  "headline": "Mitchell scores 34, Cavaliers beat Trail Blazers 114-96",
  "body": "CLEVELAND -- — Donovan Mitchell scored 34 points and Jarrett Allen had a season-high 24 points and 13 rebounds, lifting the Cleveland Cavaliers to a 114-96 victory over the Portland Trail Blazers on Wednesday night.\n\n\r\n              Darius Garland had 24 points and 12 assists, and Evan Mobley posted 10 points, 12 rebounds and three blocks as the Cavaliers completed a 4-0 homestand. Cleveland owns the third-best record in the NBA at 12-6.\n\n\r\n              “Defenses have a tough decision to make on how they’ll guard us,” Cavaliers coach J.B. Bickerstaff said. “A lot of times, they’ll err on the side of defending Donovan, but he’s a willing passer. And that’s where Jarrett does a great job of finding those gaps.”\n\n\r\n              Jusuf Nurkic had 22 points and six rebounds, and Jerami Grant scored 21 points for the Trail Blazers, who have lost four straight. Anfernee Simons scored 14 of his 20 points in the fourth quarter and had six assists.\n\n\r\n              Portland guard Damian Lillard missed his second game in a row with a right lower leg strain. The six-time All-Star will be evaluated at the end of the month after suffering his second calf injury of the season, sidelining him for six games thus far.\n\n\r\n              “I think the guys’ mood is good, especially to be in the tough spot we are now,” Trail Blazers coach Chauncey Billups said. “We’re scrapping and we’re positive and we’ll keep at it.”\n\n\r\n              Cleveland built its largest lead at 97-77 on a driving layup by Dean Wade early in the fourth. The Cavaliers, who are 8-1 at Rocket Mortgage FieldHouse, maintained at least a two-possession advantage throughout the second half.\n\n\r\n              “We came in with the energy to compete and this crowd, man, they’re here cheering for us every night,” said Allen, who was 10 of 12 from the field. “I’m thankful for all my teammates and our fans.”\n\n\r\n              Grant and Mitchell both made five 3-pointers in the opening half as Cleveland carried a 57-48 advantage into the break. Grant had 21 points in the first 23 minutes, but was held scoreless in the second half.\n\n\r\n              The Cavaliers went in front for good in the second quarter with a 21-3 run, fueled by eight points apiece from Garland and Allen to grab a 40-24 lead.\n\n\r\n              LOVE OVERBOARD\n\n\r\n              Cavaliers F Kevin Love was out with a fractured right thumb, preventing him from playing on the sixth anniversary of his NBA-record, 34-point first quarter against Portland in the same arena.\n\n\r\n              Love, who only missed one game after being hurt on Nov. 18 against Charlotte, was in obvious discomfort while playing 12 scoreless minutes Sunday against Atlanta.\n\n\r\n              “Kevin’s thumb is not comfortable, I’m not going to sugar coat it,” Bickerstaff said. “He was playing with pain the other night. It’s going to be all about managing pain for a while.”\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: Billups was pleased that three-time All-Star Mitchell was traded by Utah out of the West. “I was happy for him because Cleveland is a good fit,” Billups said, breaking into a smile. “But I was also like, ‘Bye, we’ll see you later.’” … G Keon Johnson (left hip pointer) and G Gary Payton II (core muscle conditioning) were inactive. G Greg Brown III is on a G League assignment.\n\n\r\n              Cavaliers: Cleveland has only held 20-point leads in four of its 18 games, two of them at home. … G Caris LeVert (left ankle sprain) missed his second game in a row, but Wade (right knee soreness) returned from a six-game absence… G Dylan Windler (right ankle sprain) and G Ricky Rubio (left knee surgery) have not played this season. F Mamadi Diakite is on a G League assignment.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Visit New York on Friday night.\n\n\r\n              Cavaliers: Visit Milwaukee on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995252.155404
}