{
  "game_id": "401810188",
  "espn_id": "401810188",
  "date": "Dec 04, 2025",
  "matchup": "PHI vs GS",
  "headline": "Edgecombe has go-ahead basket and Maxey a game-saving block as 76ers beat short-handed Warriors",
  "body": "PHILADELPHIA -- — Rookie VJ Edgecombe made the go-ahead follow shot with 0.9 seconds left, Tyrese Maxey raced back for a game-saving blocked shot and the Philadelphia 76ers beat the short-handed Golden State Warriors 99-98 on Thursday night.\n\n\r\n              Maxey scored 35 points but missed a jumper with the 76ers trailing by one. Edgecombe tipped it in, but the Warriors quickly fired an inbounds pass to De’Anthony Melton, who had broke downcourt. Maxey got back to block the shot off the backboard just before time expired. \n\n\r\n              Joel Embiid had 12 points in his return to the 76ers lineup.\n\n\r\n              Pat Spencer scored 16 points for the Warriors, who erased a 24-point deficit despite playing with their two leading scorers, Stephen Curry (left quad contusion) and Jimmy Butler (left knee soreness), then losing Draymond Green to an injured right foot late in the second quarter.\n\n\r\n              Maxey's 3-pointer made it 67-43 with 8:06 left in the third quarter. But the Warriors used a 15-0 run early in the fourth quarter to get back in the contest, then had a late lead before Edgecome stole an inbounds pass with 8.2 seconds to play.\n\n\r\n              Paul George (left knee injury recovery) was out for the 76ers, who play the second game of a back-to-back on Friday night in Milwaukee.\n\n\r\n              Curry didn’t even make the trip to Philadelphia, missing his third in a row and seventh game this season. Butler couldn’t play after getting injured in the Warriors’ 124-112 home loss to Oklahoma City on Tuesday. Golden State did get some good news on the injury front with the return of Melton, who had 14 points in his season debut while coming back from a torn ACL.\n\n\r\n              Up next\r\n              Warriors: At Cleveland on Saturday night.\n\n\r\n              76ers: At Milwaukee on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042749.9753878
}