{
  "game_id": "0022200390",
  "espn_id": "401468545",
  "date": "Dec 10, 2022",
  "matchup": "CLE vs. OKC",
  "headline": "LeVert scores 22 points, Cavaliers beat Thunder 110-102",
  "body": "CLEVELAND -- — Caris LeVert scored 22 points, Evan Mobley had 21 points and 12 rebounds and the Cleveland Cavaliers never trailed in a 110-102 victory over the Oklahoma City Thunder on Saturday night.\n\n\r\n              Jarrett Allen had 21 points and 11 rebounds, and Darius Garland added 13 points and eight assists for Cleveland, which is an NBA-best 12-2 at home. All-Star guard Donovan Mitchell missed his second straight game with a sore right lower leg.\n\n\r\n              “I’m just trying to come through when my teammates need me,” said LeVert, who made 4 of 9 3-pointers. “It was great when we got things going as a group. And defensively, we were great all night. I know I would not want to play against Evan and J.A.”\n\n\r\n              Shai Gilgeous-Alexander, the third-leading scorer in the NBA at 31.1 points per game, led Oklahoma City with 23. Aleksej Pokusevski added 16 points and a season-high tying 14 rebounds, and Josh Giddey had 17 points, 13 rebounds and six assists.\n\n\r\n              Mobley gave Cleveland its largest lead at 72-55 with two free throws midway through the third quarter, but the Thunder rallied to tie it at 89 on a layup by Jalen Williams.\n\n\r\n              The Cavaliers immediately went back in front on Mobley’s 3-pointer, beginning a 15-4 run that was punctuated by Allen’s three-point play on a dunk.\n\n\r\n              “Mobley and Allen are really active and bouncy in the paint,” Oklahoma City coach Mark Daigneault said. “I thought (Pokusevski) hung in there physically with them, which was good because they’re so strong down low.”\n\n\r\n              Lamar Stevens added 10 points and seven rebounds, and Cedi Osman and Isaac Okoro had eight points apiece off the bench for the Cavaliers. Cleveland is 11-0 at Rocket Mortgage FieldHouse with Mitchell in the lineup and 1-2 when he doesn’t play.\n\n\r\n              “We could have folded and let their run keep going, but we got back into the defensive mindset and held our own,” Allen said. “We know if we play our game, we’re able to beat anybody.”\n\n\r\n              Oklahoma City, which is 2-2 on a five-game road trip, received 12 points from Isaiah Joe and 11 points from Williams. Gilgeous-Alexander fouled out for the first time in 267 career games.\n\n\r\n              DIET CUP OF JOE\n\n\r\n              Joe has attempted 61 3-pointers and just 11 field goals within the arc on the season. Daigneault is pleased to see the third-year guard embracing his role on the perimeter.\n\n\r\n              “I think 90% of his shots are threes and that’s a very good diet for Isaiah Joe,” Daigneault said. “We’re trying to educate the guys on what a healthy diet would be, so to speak, shooting the ball.”\n\n\r\n              Two-way G Lindy Waters III has even more dramatic splits with 22 of his 23 field goal attempts being 3-pointers. He is 7 of 22 from deep and 1 of 1 on two-point tries.\n\n\r\n              TIP-INS\n\n\r\n              Thunder: G Kenrich Williams (right knee sprain) did not travel to Cleveland and will miss the remainder of its trip. Daigneault said the injury is not a day-to-day situation, but doesn’t appear to be a long-term issue. … Oklahoma City has lost four straight to the Cavaliers.\n\n\r\n              Cavaliers: F Kevin Love (low back soreness) sat out his second game in a row and F Dean Wade (left shoulder sprain) has been sidelined for four straight. … G Ricky Rubio (left knee) and G Dylan Windler (right ankle sprain) were inactive. … Cleveland has sold out all 14 home games.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Dallas on Monday night.\n\n\r\n              Cavaliers: At San Antonio on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995249.16044
}