{
  "game_id": "0021600477",
  "espn_id": "400899919",
  "date": "Dec 28, 2016",
  "matchup": "CHA @ ORL",
  "headline": "Walker, Batum lead Hornets to 120-101 win over Magic",
  "body": "ORLANDO, Fla. --  Nicolas Batum's teammates are well aware of how talented he is. Now, opponents are taking notice, too.\n\nBatum could have had his second triple-double in a week Wednesday night, but the Charlotte Hornets didn't need him in the fourth quarter of a 120-101 rout against the Orlando Magic.\n\nCharlotte won its fourth in five games as Batum had 20 points, nine rebounds and eight assists in just under 30 minutes.\n\nKemba Walker led the Hornets with 21 points and five assists, and Charlotte's guards outscored Orlando's starting backcourt 41-18.\n\n\"Nicolas Batum is one of the most underrated players in the NBA,\" Magic coach Frank Vogel said. \"We had trouble containing him and (Kemba) Walker and all the chain-reaction rotations those guys create when driving the ball to the basket. Those guys were really sharp.\"\n\nBatum played all 12 minutes of the third quarter, when Charlotte outscored Orlando 35-13 to take a 97-68 lead into the final period. He shot 4 of 5 from the field, grabbed eight defensive rebounds and handed out four assists.\n\n\"Filling up the boxscore, that's every night with Nic,\" Walker said. \"Defensively, he can guard anybody, and offensively he can make any play on the court. People don't get to see us much and see how good he is, but we know how important he is to our team.\"\n\nOrlando had no counter-punch on its side. The Magic were trying to sweep a three-game homestand after defeating the Lakers and Grizzlies, but couldn't find an answer when Charlotte got hot in the second half.\n\nSerge Ibaka scored all 20 of his points in the first half. Nikola Vucevic led Orlando with 21.\n\n\"We were getting good shots in that third period, we just didn't make anything,\" Vogel said. \"We went stone cold and if you can't beat them from the perimeter, you're going to have a long night.\"\n\nJeremy Lamb scored 14 points and Ramon Sessions added 13 off the bench as the Hornets shot 54.8 percent, including 10 of 24 on 3-pointers.\n\nJodie Meeks scored 11 for the Magic, who won their previous two games.\n\nThe Hornets, who allowed Orlando to shoot 59 percent in the first half, were much more active on defense in the third quarter. Charlotte got points from six players during a six-minute stretch in the middle of the period when it outscored the Magic 28-2.\n\nMost of the shots came in the open court following Magic turnovers or long rebounds off missed shots. Orlando shot 1 for 11 and committed four turnovers during that stretch, falling behind 92-61.\n\nJeff Green finally ended the misery with a three-point play, but by the end of the period, the Magic had made only five of 22 shots and trailed 97-68.\n\nNeither team seemed particularly interested in playing defense during the first half. Walker and Batum combined for 26 points and seven assists as Charlotte shot 54.5 percent to take a 62-55 halftime lead.\n\nTIP-INS\n\nHornets: Charlotte has beaten Orlando five straight times and won seven of the last eight meetings. ... C Cody Zeller cut the ring finger on his right hand but returned for the second half. ... Charlotte leads the NBA in fewest turnovers with just 11.7 per game.\n\nMagic: Leading scorer Evan Fournier missed his third straight game with a bruised heel. The team expects him to play Sunday against Indiana. ... PG Elfrid Payton hit 35 of 60 shots (58.3 percent) in the previous five games. He was 2 for 10 against Charlotte. ... Orlando is 6-11 at home this season.\n\nUP NEXT\n\nHornets: At home Thursday night against Miami. Charlotte beat the Heat 97-91 in the second game of the season.\n\nMagic: At the Indiana Pacers on Sunday. Orlando shot a season-low 32.1 percent in a Nov. 14 visit to Indiana.",
  "source": "espn_api",
  "crawled_at": 1764995516.3359418
}