{
  "game_id": "401810122",
  "espn_id": "401810122",
  "date": "Nov 20, 2025",
  "matchup": "SA vs ATL",
  "headline": "Fox, Johnson lead Spurs to third straight victory without Wembanyama, toppling Hawks 135-126",
  "body": "SAN ANTONIO -- — De'Aaron Fox scored 26 points, Keldon Johnson had 25 and the San Antonio Spurs won their third straight without Victor Wembanyama, toppling the Atlanta Hawks 135-126 on Thursday night.\n\n\r\n              Nickeil Alexander-Walker had a career-high 38 points on 13-for-17 shooting for Atlanta. Jalen Johnson added 26 for the Hawks, who have lost two straight after winning five in a row.\n\n\r\n              San Antonio was without Wembanyama (left calf strain), Stephon Castle (strained left hip flexor) and Dylan Harper (strained left calf). Trae Young (right MCL sprain) sat out for Atlanta.\n\n\r\n              San Antonio (11-4) is off to its best start after 15 games since 2016-17, when it opened 12-3.\n\n\r\n              With several stars missing, Spurs guard David Jones Garcia put up a stellar performance.\n\n\r\n              Jones Garcia had 12 points, six assists, five rebounds, three steals and a blocked shot. All were season highs for the rookie from the Dominican Republic on a two-way contract.\n\n\r\n              Jones Garcia sparked a 34-12 run to open the second quarter, giving the Spurs a 62-46 lead with 4:19 remaining in the first half. He had eight points, three assists, two rebounds and a blocked shot in 8 minutes, 14 seconds. That stretch alone was greater than his playing time in any of his four previous appearances.\n\n\r\n              Jones Garcia had another impactful run after the Hawks rallied for a 101-100 lead on Alexander-Walker's layup.\n\n\r\n              Jones Garcia captured a rebound over several taller players in the paint and immediately fired a halfcourt pass to a sprinting Julian Champagnie for a layup and a 105-101 lead with 8:38 remaining. A minute later, Jones Garcia stripped Jalen Johnson of his dribble for what would lead to Jeremy Sochan’s dunk and a 110-101 lead. \n\n\r\n              Champagnie finished with 20 for San Antonio, which had six players in double figures.\n\n\r\n              Spurs forward Harrison Barnes had 14 points in surpassing 14,000 for his career.\n\n\r\n              Up next\r\n              Hawks: At New Orleans on Saturday.\n\n\r\n              Spurs: At Phoenix on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042663.8416698
}