{
  "game_id": "0022200376",
  "espn_id": "401468531",
  "date": "Dec 08, 2022",
  "matchup": "DEN @ POR",
  "headline": "Murray's 3 gives Nuggets 121-120 win over Lillard, Blazers",
  "body": "PORTLAND, Ore. -- — Jamal Murray’s 3-pointer with 0.9 seconds remaining lifted the Denver Nuggets to a thrilling 121-120 victory over the Portland Trail Blazers on Thursday night. \n\n\r\n              Damian Lillard had 40 points for the Trail Blazers, including a 3-pointer that gave them a one-point lead with 8.8 seconds remaining.\n\n\r\n              Murray then answered with his 3 from the left side for the last of the game’s 20 lead changes. \n\n\r\n              “It was a play for (Nikola Jokic) to get space and let him work,” Murray said. “He fumbled it a little and he told me to come get it. I turned and looked at the clock, saw that I didn’t have to rush and I just went into my move.”\n\n\r\n              Jokic had 33 points, 10 rebounds and nine assists for Denver, which rallied from a 10-point deficit in the fourth quarter to snap a three-game losing streak. \n\n\r\n              Murray scored 21 points in a memorable moment in his return after missing all of last season recovering from knee surgery.\n\n\r\n              “I told Jamal going into this season you have to learn that it’s a process, because you're back,” Nuggets coach Michael Malone said. “You’re going to be better in a month, Christmas, and postseason as you continue to get right. And tonight is a nice step in that direction.\"\n\n\r\n              Aaron Gordon had 20 points and Bones Hyland added 13 off the bench. \n\n\r\n              Lillard finished with 12 assists and nine 3-pointers. Jusuf Nurkic had 21 points and nine rebounds, but Anfernee Simons was 3 for 12, missing all six attempts behind the arc. \n\n\r\n              Portland’s defense on the final possession against Murray left its coach disappointed. \n\n\r\n              “It wasn’t handled well at all,” Chauncey Billups said. “We’re up two. The last shot you can live with is a 3. A 2 don’t beat us. We go into overtime, no big deal. We gave up a 3-point shot. It was terrible.” \n\n\r\n              The Nuggets fought their way back early in the fourth quarter, cutting the Blazers’ lead to 104-103 with 7:07 left on a 3-pointer by Murray. \n\n\r\n              Jokic’s floater put the Nuggets ahead for the first time in the second half at 105-104. \n\n\r\n              Gordon’s tip-in put the Nuggets ahead 118-117 with 17 seconds left before Lillard’s final 3-pointer made it 120-118. After Murray’s 3, the Nuggets batted away Portland’s final inbounds pass. \n\n\r\n              Lillard scored eight points in the first four minutes of the third quarter to help the Blazers take a nine-point lead. He had 18 points in the quarter, giving the Blazers a 99-89 lead heading into the fourth. \n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Malone said there remains no timeline for Michael Porter Jr.’s return from a heel injury. Porter has missed eight straight games. “He’s not on this one-game road trip, we want to do everything we can to calm down that heel injury that is preventing him from getting back,” Malone said. \n\n\r\n              Trail Blazers: Keon Johnson played for the first time since Nov. 7 after returning from a hip injury. Johnson made a 3-pointer on his first shot of the game to help the Blazers take a 36-30 lead after the first half. \n\n\r\n              NURKIC ADDING TO GAME\n\n\r\n              Nurkic is taking more 3-pointers than usual, averaging 1.7 attempts per game. Billups has encouraged him to shoot more of them, within reason. \n\n\r\n              “Last year I didn’t empower him at all to shoot that,” Billups said. “I wanted him to establish himself down low. But over time and watching him shooting it in practice, that could be an extra weapon for us. Because he can actually shoot. Obviously, you’ve got to put boundaries on it.”\n\n\r\n              Nurkic was 2 of 3 from the 3-point line on Thursday night. \n\n\r\n              UP NEXT\n\n\r\n              Denver: Host the Utah Jazz on Saturday night.\n\n\r\n              Portland: Host the Minnesota Timberwolves on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994719.680671
}