{
  "game_id": "0021700130",
  "espn_id": "400974881",
  "date": "Nov 03, 2017",
  "matchup": "LAL vs. BKN",
  "headline": "Lopez drops 34 on Nets, D-Lo gets 17 in Lakers' 124-112 win",
  "body": "LOS ANGELES -- With all the fuss surrounding D'Angelo Russell's return to Los Angeles after being traded to Brooklyn last summer, some Lakers fans might have forgotten it was also Brook Lopez's first game against the only franchise he had ever known before that deal.\nLopez's new Lakers teammates are pretty sure he didn't forget, even if he didn't want to acknowledge it after a stellar performance.\nLopez hit six 3-pointers and scored a season-high 34 points against the Nets, and rookie Kyle Kuzma had 21 points and 13 rebounds during his first career start in the Lakers' 124-112 victory over Brooklyn on Friday night.\nLopez had 23 points in the second half and added 10 rebounds while the Lakers stayed comfortably ahead. He hit four 3-pointers in the third quarter and finished with a series of ferocious dunks in the final minutes.\nThe genial 7-footer is normally loquacious, but Lopez wouldn't say much about facing the Nets.\n\"It honestly wasn't about (revenge) at all,\" he said. \"It was typical. Just another game for me.\"\nLopez had spent his entire nine-year NBA career with the Nets, becoming the top scorer in franchise history while leading Brooklyn in scoring during each of the past five seasons. But the North Hollywood native will be a free agent next summer, and the Nets shipped him home after he put up 20.5 points per game last season.\n\"When you have the talent level that Brook has, and you've been in the league long enough, you can anticipate a player of that level having a big game against his old team,\" Lakers coach Luke Walton said. \"It's just the way our league works. Some of those 3s, I was yelling at my coaches, `Why is he shooting that?' And he was making them, so we left him in. It was good to see.\"\nWhile most Staples Center fans paid attention to the still-popular Russell's return, Lopez calmly posted his biggest offensive game yet for his new team.\n\"He was great,\" said Brooklyn coach Kenny Atkinson, who gets credit from Lopez for encouraging him to become a 3-point shooter. \"Credit to him. He's a very good player.\"\nJordan Clarkson added 19 points and Brandon Ingram had 18 for the Lakers, who played with surprising energy one night after a last-second loss in Portland and a 2:30 a.m. return home.\nAllen Crabbe scored 25 points in the opener of Brooklyn's five-game road trip. Rondae Hollis-Jefferson added 21 for the Nets, who have lost four straight.\nD-LO RETURNS\nRussell had 17 points, seven rebounds and seven assists in his first game against the Lakers since they traded him to Brooklyn in the four-player deal that brought Lopez and Kuzma to Los Angeles.\nRussell was the No. 2 pick in the 2015 draft and the cornerstone of the Lakers' rebuilding project under former bosses Jim Buss and Mitch Kupchak. When owner Jeanie Buss replaced the duo with Magic Johnson and Rob Pelinka last year, Russell was shipped off to Brooklyn four months later along with high-priced center Timofey Mozgov.\nBefore the game, Russell declined to criticize Johnson or the Lakers, saying he enjoyed his time in LA. He was greeted largely by warm cheers during pregame introductions.\n\"The LA fans should have love for D'Angelo,\" Walton said. \"The LA fans should have love for Timo. Neither one of them asked to be traded. They played hard for this city.\"\nJohnson made the deal to clear Mozgov's onerous contract off the books for the Lakers' pursuit of top-tier free agents next summer, but also to clear a path for rookie Lonzo Ball, his preferred choice as the team's new point guard and cornerstone. After the trade, Johnson also made comments that appeared to be critical of Russell's leadership ability.\n\"I would say it ruffled a few feathers, but you control what you can control,\" Russell said of Johnson's comments. \"He's in a position to say what he wants, so I'm going to do what I can do.\"\nKUZMA'S START\nKuzma took another big step in his ascendant career with the Lakers, who appear to have a steal in the player Brooklyn selected with the 27th overall pick and immediately traded to Los Angeles.\nGiven his first chance to start after Larry Nance Jr. broke his hand in Portland, Kuzma scored 17 points on 7-of-8 shooting in the first half.\nTIP-INS\nNets: Russell is only 20 months older than Ball. ... Lopez returns to Brooklyn on Feb. 2.\nLakers: Nance will be sidelined for four to six weeks after surgery on Friday. He had started Los Angeles' first eight games, making steady contributions on both ends of the floor. ... Ball had six points on 3-of-15 shooting and seven assists.\nUP NEXT\nNets: Visit the Phoenix Suns on Monday.\nLakers: Host the Memphis Grizzlies on Sunday before heading out on an East Coast road trip.\n---\nMore AP NBA: www.apnews.com/tags/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993212.290865
}