{
  "game_id": "0022000873",
  "espn_id": "401307671",
  "date": "Apr 19, 2021",
  "matchup": "MIL vs. PHX",
  "headline": "Suns edge Bucks 128-127 after foul in final second of OT",
  "body": "MILWAUKEE -- — Devin Booker said he knew he’d been fouled as he put up a shot in the final second of overtime. His coach agreed.\n\n\r\n                    “I heard the slap,” Phoenix Suns coach Monty Williams said. “I was just concerned as to when it happened. I wanted to make sure it happened before the buzzer went off.”\n\n\r\n                    It did -- barely. \n\n\r\n                    \r\n                      Officials determined P.J. Tucker fouled Booker before time expired and put 0.3 seconds on the clock.  Booker made the first of two free throws amid a chorus of boos from the Milwaukee crowd to give the Suns a 128-127 overtime victory over the Bucks on Monday night.\n\n\r\n                    “I don’t think anybody was arguing that it was a foul or not,” Booker said. “I think they were seeing if the foul happened before or after the horn. It was a smack across the wrist that was very loud. The ref made the right call.\"\n\n\r\n                    That final sequence took place after Milwaukee's Khris Middleton had tied the game on a 3-pointer with 22.1 seconds left.\n\n\r\n                    Jae Crowder inbounded a pass to Booker, who attempted to get free for a shot while getting hounded by Jrue Holiday. \n\n\r\n                    Holiday reached his left arm out at one point, and Tucker converged and had his right arm near Booker just as the Suns guard shot from in front of Phoenix’s bench. Officials determined Tucker's right arm hit Booker's left elbow.\n\n\r\n                    “It is what it is,” said Tucker, whose tying 3-pointer with 1:17 left had helped the Bucks erase an early six-point overtime deficit. “They made the call. I think in that situation, that’s a tough call to make. Tie game. Overtime.”\n\n\r\n                    Booker made the first free throw for his 24th point. He missed the second attempt, and the buzzer went off before the Bucks could put up any kind of shot.\n\n\r\n                    The free throw capped a wild game that featured 24 lead changes and 16 ties. There were 20 lead changes in the first half alone.\n\n\r\n                    Phoenix rallied to take the lead after trailing by seven with 4 ½ minutes left in the fourth quarter. Middleton made a go-ahead 3-pointer and Booker made a tying jumper in the final minute of regulation. \n\n\r\n                    “It was everything that the playoffs are,” Williams said. “Emotion. Physical. Players making plays. Late-game situations. It was all of that.”\n\n\r\n                    Chris Paul had 22 points, 13 assists and seven rebounds for the Suns, who were opening a five-game trip in which they play five of the top six teams in the Eastern Conference standings. \n\n\r\n                    Paul increased his career assist total to 10,145 to overtake Magic Johnson (10,141) for fifth place in NBA history. Paul called the achievement surreal and added afterward he planned to send the ball to Johnson in hopes of getting it autographed.\n\n\r\n                    “There will never be another Magic,” Paul said. “Showtime. You know what I mean?”\n\n\r\n                    Mikal Bridges had 21 points and DeAndre Ayton scored 20 for the Suns.\n\n\r\n                    Giannis Antetokounmpo had 33 points, Middleton 26 and Holiday 25 for the Bucks. Antetokounmpo missed the last four minutes of overtime and said he’d developed a cramp in his calf.\n\n\r\n                    “At the time you don’t know what it is,” Antetokounmpo who said at his Zoom session he was feeling better after receiving postgame treatment. “It might be a cramp. It might be a strain. It’s just a sharp pain in your calves and your muscle’s tightening up. I didn’t know right away it was a cramp.”\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: This game marked Torrey Craig’s return to Milwaukee, where he briefly played this season and struggled to carve out a niche. The Suns acquired him from the Bucks for cash on March 18. Craig had five points and five rebounds in 14 minutes.\n\n\r\n                    Bucks: Donte DiVincenzo returned to the starting lineup after missing two games with a sprained right toe. He scored nine points in 31 minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Visit the Eastern Conference-leading Philadelphia 76ers on Wednesday as they continue this five-game trip. The Suns beat the 76ers 120-111 in Phoenix on Feb. 13.\n\n\r\n                    Bucks: Have the first of two straight home matchups with 76ers on Thursday. In their lone previous meeting this season, the Bucks won 109-105 in overtime at Philadelphia on March 17.\n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997380.540351
}