{
  "game_id": "0022200753",
  "espn_id": "401468908",
  "date": "Jan 29, 2023",
  "matchup": "MEM vs. IND",
  "headline": "Grizzlies use Morant's triple-double, rally to beat Pacers",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 27 points, 15 assists and 10 rebounds, Jaren Jackson Jr. added 28 points and the Memphis Grizzlies overcame a lackluster first half to defeat the Indiana Pacers 112-100 on Sunday. \n\n\r\n              Brandon Clarke had 13 points, hitting all five of his shots as Memphis snapped a five-game losing streak and ran its home record to 21-3. It was Morant's fifth triple-double of the season and second in a row.\n\n\r\n              “We needed it,” Morant said. “Obviously going through a terrible slump that we haven't been in in years, dropping five games on the road. That's not our identity. That's not us.”\n\n\r\n              But the game started as if Memphis was going to continue its losing ways. The Grizzlies were down by 12 at half, but the second-half change, fueled by defensive adjustments, allowed them to outscore the Pacers 62-38 in the final two quarters. \n\n\r\n              “Pretty clear that the first half was really excellent and exactly what we were trying to do, which was make it tough on them with solid defense,\" Indiana coach Rick Carlisle said. “... The second half, they were able to flip the whole thing.”\n\n\r\n              Bennedict Mathurin, the sixth pick in the 2022 draft, led the Pacers with 27 points and eight rebounds. Aaron Nesmith had 16 points and Myles Turner added 15 points. Indiana has lost 10 of its last 11.\n\n\r\n              The Pacers dominated the first half, leading by as many as 19. Indiana's first-half shooting, which hovered at 60% at the midway point of the second quarter, helped it to a 62-50 lead at the break. \n\n\r\n              But 14 straight points brought Memphis back into the game early in the third quarter, and the Grizzlies outscored Indiana 30-17 in the third to retake the lead.\n\n\r\n              “It's hard to play away,” Mathurin said of the second-half collapse. “They had momentum. The crowd got into it. ... We should have stayed locked in. Defense was pretty bad in the second half.”\n\n\r\n              Memphis' 13-2 run to open the fourth opened the game up. \n\n\r\n              “We just accepted the challenge,” said Jackson, who also had five blocks. “We have to come out and compete every night. This is nothing new. We're just glad to be back home and get a nice win.”\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Guard Tyrese Haliburton continued to sit out with left knee and elbow sprains, but there were indications Indiana's top scorer could return to action soon. Carlisle expects Haliburton to practice this week “and looking toward the real possibility that he could play this weekend.”\n\n\r\n              Grizzlies: Have won eight straight at home; their last home loss was Dec. 27 to Phoenix. ... Guard Desmond Bane sat out with right knee soreness. Coach Taylor Jenkins classified Bane as day-to-day and expects him to return this week. \n\n\r\n              TURNER EXTENSION\n\n\r\n              Turner will stay with Indiana after agreeing to a two-year contract extension. Carlisle said the team has a news conference planned for Monday. \n\n\r\n              MOMENT OF SILENCE\n\n\r\n              Sunday was the Grizzlies' first home game since the video was released of Memphis police officers beating Tyre Nichols to death after a traffic stop. The Grizzlies held a pregame moment of silence for Nichols, 29, who died three days after the confrontation with police. Five officers were fired and indicted on an array of charges, including second-degree murder. \n\n\r\n              “Obviously, our city is going through a really tough time right now, I'm kind of focused on that more than basketball,” Jenkins said, adding that the video was “very disturbing.”\n\n\r\n              Guard Tyus Jones, who was in Minnesota at the time of George Floyd's death, said it is hard to deal with the emotions when it happens in your city.\n\n\r\n              “It's a sad situation. It's unfortunate,” Jones said. “A lot of emotions flowing. ... Anger because that shouldn't happen That's not supposed to happen.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host the Lakers on Tuesday.\n\n\r\n              Grizzlies: Host Portland on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994191.653419
}