{
  "game_id": "0021900480",
  "espn_id": "401161122",
  "date": "Dec 28, 2019",
  "matchup": "MIL vs. ORL",
  "headline": "Bucks overcome Antetokounmpo's absence to beat Magic",
  "body": "MILWAUKEE --  Khris Middleton showed he can shoulder a big share of the load when the Milwaukee Bucks are without Giannis Antetokounmpo.\n\nMiddleton scored 21 points and NBA-leading Milwaukee overcame Antetokounmpo's absence for the second straight night, beating the Orlando Magic 111-100 on Saturday.\n\nAntetokounmpo, the NBA MVP last season, also missed the Bucks' victory Friday in Atlanta because of back soreness.\n\n\"The ball is in his hands a lot, especially when we're bringing George (Hill) off the bench,\" Bucks coach Mike Budenholzer said about Middleton. \"Khris is a quasi-point guard for us out there, putting him where he's making the reads and the decisions.\n\n\"To have a guy who is 6-7 and can shoot like that and make passes and reads, that's why he's an all-star.\"\n\nMiddleton also had seven assists and five rebounds to help the Bucks improve to 29-5 overall and 16-2 at home.\n\nVeteran forward Ersan Ilyasova, starting in place of Antetokounmpo, had 17 points and 14 rebounds.\n\nRobin Lopez came off the bench to score a season-high 17 points on 7-of-8 shooting and Hill added 17 points. Starting center Brook Lopez had 10 points.\n\nFournier led Orlando with 23 points. Nikola Vucevic added 21 points and eight rebounds, and Jonathan Isaac had 19 points and nine rebounds and matched the franchise record with eight steals.\n\nIlyasova, normally a valuable member of the Bucks bench corps, has played well in three games as a starter when Antetokounmpo has been sidelined this season.\n\n\"He was balling. He was everywhere,\" Middleton said. \"The hustle plays, the rebounds, the shots, the assists. It is just energy. He has great hands; he has a great feel, a great knack for just getting open or finding the ball, some way, somehow. I guess that is why he has been in the league so long.\"\n\nAntetokounmpo's absence should not be much longer.\n\n\"He did some work earlier today and he's making progress,\" Budenholzer said. \"He's very close but not capable of going tonight. Hopefully, he'll return soon.\"\n\nIlyasova hit back-to-back 3-pointers early in the fourth quarter to give the Bucks an 89-77 lead. The second one came after teammate Brook Lopez lost the ball. but Vucevic tapped it directly to Ilyasova, who immediately drilled the triple from the wing.\n\nBrook Lopez blocked a shot by Vucevic a few minutes later, leading to a layup by Pat Connaughton and a 96-81 Milwaukee lead with 6:15 remaining. The Bucks outscored the Magic 33-26 in the fourth quarter.\n\nOrlando edged Philadelphia on Friday night and stayed close to the Bucks for three quarters.\n\n\"Our starters did defend,\" Magic coach Steve Clifford said. \"It's pretty simple. Just look at the box score. Their bench guys played really well. They had more guys play well than we did.\"\n\nThe Bucks reserves outscored the Magic bench, 51-28.\n\nTIP-INS\n\nMagic: Starting forward Aaron Gordon left the game in the third quarter with a left Achilles injury. \"I feel I might have been playing on it a little too long already,\" Gordon said. \"Now is the time I've got to get it taken care of. I just want to get healthy and come back and help my team.\" . Isaac tied the Magic record for steals in a game, one established by Nick Anderson in 1991 against Washington. . Reserve center Mo Bamba missed his second straight game with a sprained right ankle and guard Michael Carter-Williams missed his third straight game with a sprained left shoulder.\n\nBucks: Point guard Eric Bledsoe (right fibula avulsion fracture) remains out after being hurt in a collision with teammate Wesley Matthews on Dec. 13 in Memphis. Budenholzer said Bledsoe might be able to get some 5-on-5 work in Sunday and \"is getting close also.\" . Milwaukee had a 57-35 rebounding advantage, including a nine-rebound night from Donte DiVincenzo and an eight-rebound performance from Connaughton.\n\nUP NEXT\n\nMagic: Host Atlanta on Monday night.\n\nBucks: At Chicago on Monday night.\n\n---\n\nThis story was first published on Dec. 29, 2019. It was updated on Dec. 29, 2019, to correct the score. The Bucks won 111-100, not 111-110.",
  "source": "espn_api",
  "crawled_at": 1764996446.119864
}