{
  "game_id": "0021600409",
  "espn_id": "400899851",
  "date": "Dec 18, 2016",
  "matchup": "ORL vs. TOR",
  "headline": "DeRozan, Raptors rout Magic behind big third quarter",
  "body": "ORLANDO, Fla. --  After Atlanta's offense exploded on them two nights earlier, the Toronto Raptors faced a similar situation in the first quarter Sunday night -- they were leaving Orlando players open, and the inferior Magic were knocking down shots.\n\nOnly this time, Toronto turned things around. It got back to its defensive principles in the second quarter, and by the second half, Orlando couldn't find an open shot while the Raptors pulled away for a 109-79 victory.\n\nToronto limited the Magic to 28 second-half points and 41 percent shooting, which was in stark contrast to Friday night when Atlanta shot nearly 54 percent from the floor while beating the Raptors 125-121.\n\n\"That was big for us after a lackluster defensive game against Atlanta,\" said Toronto coach Dwane Casey, whose team has eclipsed 100 points an NBA-best 15 straight times.\n\n\"That's the way we have to play if we are going to be important, relevant in this league. We have to play with that defensive intensity every night.\"\n\nThe Raptors stepped up defensively in the second half, turning a four-point halftime lead into an 84-64 edge by the end of third quarter. Orlando, which has struggled offensively throughout the season, managed just 13 points in the game-changing third quarter.\n\nThe Magic were 3 for 21 from 3-point range. Evan Fournier led Orlando with 15 points but was plagued by foul trouble and turnovers.\n\n\"We didn't start the game following our game plan very well. We had a good first quarter,\" said Orlando coach Frank Vogel, whose team dropped to 5-10 at home this season. \"We didn't play team basketball and it got worse as the game went on. They made their runs and we gave in versus responding.\"\n\nMuch of that was because the Magic had few answers for guard DeMar DeRozan and Jonas Valanciunas. Aaron Gordon and Jeff Green took turns getting beat off the dribble and on pullup jumpers by DeRozan, who finished with a game-high 31 points for his fourth-straight 30-point effort.\n\nValanciunas dominated his old teammates Bismack Biyombo and Nikola Vucevic in the post, getting 16 points and 13 rebounds.\n\n\"Just trying to bounce back from a loss, it sucks coming off a loss,\" DeRozan said. \"You just want to do whatever you can to get a win and that was my whole mindset tonight.\"\n\nTEMPORARY PROMOTION\n\nRookie Fred VanVleet benefited from extra playing time Sunday with Cory Joseph not dressed due to flu-like symptoms.\n\nVanVleet, who has been back-and-forth to the D-League this season, had four points, four assists and three steals in 22 minutes.\n\n\"He came in and there was no let up,\" Casey said with a smile. \"I told somebody Cory better hurry up and get well. Footsteps are behind him.\"\n\nUNHAPPY REUNION\n\nBiyombo likely saw his first matchup with his former Raptors teammates going differently than it did Sunday night.\n\nHe had eight points, three blocked shots and 12 rebounds, but the Magic center also had four turnovers and did little to slow Valanciunas.\n\nTIP-INS\n\nRaptors: Pascal Siakam had four blocked shots in the first half but also had four fouls before halftime.\n\nMagic: Guard Jodie Meeks got a flagrant-1 for a hard foul on Lowry with 6:28 play in the second quarter. ... Elfrid Payton scored 13 points on 6-of-8 shooting off the bench in the first half. ... Orlando has not won back-to-back home games since defeating New Orleans and Dallas on Nov. 16 and Nov. 19, respectively. The Magic beat Brooklyn at home on Friday night.\n\nUP NEXT\n\nRaptors: Toronto returns home to take on Brooklyn on Tuesday night.\n\nMagic: Orlando goes on the road to face Miami on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764995861.0886421
}