{
  "game_id": "0022201078",
  "espn_id": "401469233",
  "date": "Mar 21, 2023",
  "matchup": "DET @ ATL",
  "headline": "Young scores 30 as Hawks complete sweep of Pistons, 129-107",
  "body": "ATLANTA -- — Bogdan Bogdanovic sank three 3-pointers in a 16-0 run early in the second half that allowed Atlanta to extend its lead to double digits for the first time and the Hawks beat the struggling Detroit Pistons 129-107 on Tuesday night.\n\n\r\n              Trae Young had 30 points and 12 assists for the Hawks (36-36), who are eighth in the Eastern Conference standings. \n\n\r\n              Atlanta set a season high with 61 rebounds and took a 50-38 advantage in points in the paint.\n\n\r\n              Hawks center Clint Capela had 16 rebounds with 12 points.\n\n\r\n              “Our bigs did a great job,” Young said. “Even our guards getting in there. ... Everybody playing hard and attacking the rebounds.”\n\n\r\n              The Hawks completed their first four-game season series sweep of the Pistons since the 1993-94 season.\n\n\r\n              Marvin Bagley III scored a season-high 31 points in Detroit's fourth straight loss. The Pistons (16-57) have lost 15 of 16 and have the NBA's worst record.\n\n\r\n              Detroit was outscored 23-12 in second-chance points.\n\n\r\n              “We let them get a lot of offensive boards and second-chance points,” Bagley said. “It really came down to that.”\n\n\r\n              Hawks coach Quin Snyder said he was “pleased with the way we protected the paint.”\n\n\r\n              Entering the game, the Hawks had lost three of four and were in danger of falling below the line to make the play-in tournament. Atlanta was only one-half game ahead of No. 9 Toronto and one game ahead of No. 10 Chicago for the last play-in spot.\n\n\r\n              Young’s 3-pointer less than two minutes into the second half gave Atlanta its first double-digit lead at 71-61. Bogdanovic, who had 18 points, followed with back-to-back 3s to stretch the lead to 16 points.\n\n\r\n              “It was important we came out with intensity,” Capela said of the strong start to the second half.\n\n\r\n              Atlanta led 99-78 entering the final period.\n\n\r\n              Atlanta's Dejounte Murray was held out with a non-COVID illness. Bogdanovic filled Murray's starting job in the backcourt. Bogdanovic made a 3 for the game's first points before picking up two early fouls and playing only four minutes in the first quarter.\n\n\r\n              BEY POSTS DOUBLE-DOUBLE IN REUNION\n\n\r\n              Saddiq Bey had 14 points and 11 rebounds as he faced his former Detroit teammates for the first time since being traded from the Pistons to the Hawks on Feb. 9 for five second-round picks. Bey was averaging 14.8 points and 28.8 minutes with Detroit and has averaged 10.1 points and 25.5 minutes with Atlanta.\n\n\r\n              Bagley said facing Bey “was a little weird coming in at first.\"\n\n\r\n              “I'm happy for him,” Bagley said. “Happy he's doing good and happy he's in a situation to do great.”\n\n\r\n              Detroit coach Dwane Casey said before the game, “It was a tough decision for our organization” to trade Bey. \"He's a beautiful person, beautiful man and did all the right things.”\n\n\r\n              LATE BASKET LEADS TO EXCHANGE\n\n\r\n              Pistons rookie Jaden Ivey's last-second uncontested layup didn't set well with Atlanta's John Collins. The two exchanged words after the game.\n\n\r\n              “I don't worry about that,” Bagley said, adding “We're not going to stop playing until the end of the game.”\n\n\r\n              Capela said he “felt they disrespected our team a little bit” because the Hawks had relaxed on their final possession.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Bagley had eight rebounds, two blocks and three steals. Killian Hayes scored 21 points. ... C Jalen Duren (cervical whiplash) did not play after suffering the injury in a collision with Miami's Kevin Love on Sunday. ... F Isaiah Livers (right hip soreness) missed his fourth consecutive game. ... G R.J. Hampton (lower back) returned and scored nine points after missing one game.\n\n\r\n              Hawks: F Jalen Johnson (mild left hamstring strain) missed his third straight game. Following an MRI on Monday which revealed the strain, Johnson was ruled out for at least a week. ... Murray may also miss Wednesday's game at Minnesota. ... Young made each of his 11 free throws.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Visit Toronto on Friday.\n\n\r\n              Hawks: Visit Minnesota on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994357.089952
}