{
  "game_id": "0021800527",
  "espn_id": "401071203",
  "date": "Dec 29, 2018",
  "matchup": "MIL vs. BKN",
  "headline": "Giannis' triple-double helps Bucks turn away Nets 129-115",
  "body": "MILWAUKEE --  Giannis Antetokounmpo got turned away early but made the clutch plays late.\n\nOne of the NBA's most dynamic dunkers shook off a rare rejection and helped the Milwaukee Bucks turn away Brooklyn's attempt to rally from a 23-point deficit in a 129-115 win over the undermanned Nets on Saturday.\n\nAntetokounmpo had his third triple-double of the season with 31 points , 10 rebounds and 10 assists, while Khris Middleton scored 29 points, despite a quad injury. The Bucks, who have won three straight and seven of eight, extended their NBA-best record to 25-10.\n\nThey nearly squandered their big lead after the Nets went on a 14-0 run in the fourth, and Shabazz Napier's 7-footer with 4:51 left trimmed the deficit to seven.\n\n\"I think there was a pretty major lapse, the start of the fourth quarter,\" Bucks coach Mike Budenholzer said.\n\nMiddleton and Antetokounmpo, the Bucks' two best players, reasserted control.\n\nAfter a bucket by Middleton, Antetokounmpo scored six straight and also drew a charge on former teammate Jared Dudley in a 57-second span of the fourth that ended with the Bucks rebuilding a 15-point lead with 3:10 left. The Bucks were back on their way to their third straight win and seventh in eight games.\n\n\"He was phenomenal in the last five minutes,\" Budenholzer said.\n\nBut a 6-foot-11 forward known for making highlight reels drew social media buzz after a dunk attempt in the first quarter was blocked by Nets center Jarrett Allen.\n\nLeave it to Antetokounmpo to finish strong.\n\n\"That's what a superstar does. When it's crunch time, when it's time to close a game out -- he did it,\" Nets coach Kenny Atkinson said.\n\nNapier tied his career high with 32 points on 9-of-15 shooting from the field and 10 of 12 from the foul line. Kenneth Faried had 21 points and 10 rebounds.\n\nMilwaukee's Brook Lopez added 24 points on 7-of-15 shooting from the 3-point arc. Lopez provided balance from the perimeter, especially after hitting 5 of 9 from the arc in the first half to help open up a 19-point halftime lead.\n\nThe 7-foot center has become quite a long-range threat since he started shooting 3s with more frequency while with the Nets two seasons ago under Atkinson's tutelage.\n\nAtkinson was forced to come up with a plan on Saturday to slow down the league's highest-scoring team despite missing six players going into the contest because of injuries or rest. Brooklyn then lost forward Rondae Hollis-Jefferson with a right groin injury in the first quarter.\n\nTIP INS\n\nNets: Brooklyn missed out on its last chance for a 10th win in December, which would have given the team its winningest December since going 10-4 in 2005. ... The bench celebrated after Allen rejected Antetokounmpo in the first, with one reserve wagging an index finger in the air side to side. Antetokounmpo got some revenge after two dunks in transition later in the quarter.\n\nBucks: Leading 71-52 at the half, the Bucks fell a point short of their highest-scoring first half of the season. ... The team entered the day at 14 games over .500, Milwaukee's best record since finishing the 2000-01 season 52-30. ... Middleton played 35 minutes after being listed as questionable with the right quad injury sustained late in the Thursday's win over the New York Knicks.\n\nOVERCOMING INJURIES\n\nThe Nets' comeback was impressive given the roster limitations. Their three highest scorers all came off the bench: Napier, Faried and DeMarre Carroll, who had 18 points.\n\n\"That's the spirit of the group,\" Atkinson said. \"It's kind of known throughout the league that this team doesn't quit, keeps competing until the end.\"\n\nQUOTABLE\n\n\"Once we started getting going, the ball was really popping a lot and moving around well ... We were having fun out there.\" -- Lopez on the team's 21 of 51 (41 percent) from the 3-point line.\n\nNOTABLE\n\nThe Bucks won their NBA-best 17th game by 10 or more points. ... Carroll tied a season high by going 4 of 7 from the 3-point line.\n\nUP NEXT\n\nNets: Host the New Orleans Pelicans on Wednesday.\n\nBucks: Host the Detroit Pistons on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994498.323243
}