{
  "game_id": "0022400059",
  "espn_id": "401703428",
  "date": "Dec 03, 2024",
  "matchup": "HOU @ SAC",
  "headline": "The Kings make 15 straight shots to beat the Rockets 120-111",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis scored 27 points and Sacramento made 15 straight shots from the field to beat Houston 120-111 on Tuesday night and deny the Rockets the top seed in the NBA Cup quarterfinals.\n\n\r\n              The shooting spree by the Kings turned an eight-point deficit late in the second quarter into a 12-point lead midway through the third to give the Kings their only win in four NBA Cup games.\n\n\r\n              De’Aaron Fox added 22 points, Malik Monk had 17 points and a career-high 12 assists, and DeMar DeRozan scored 16.\n\n\r\n              The Rockets won their first three games in the NBA Cup and could have clinched the top seed in the West with a win over the Kings. Houston will host Golden State in the quarterfinals. \n\n\r\n              Jalen Green scored 28 to lead Houston and Alperen Sengun added 24.\n\n\r\n              Takeaways\r\n              Rockets: Houston had won three straight and 10 of 12 games before delivering a dud against Sacramento. The frustration led to coach Ime Udoka and Sengun getting ejected late in the fourth quarter.\n\n\r\n              Kings: Sacramento found its shooting touch after hitting less than 40% of its 3-point tries in six straight games. The Kings came into the day ranking sixth worst in the NBA by making 33.2% from 3 but went 14 for 30 against Houston. \n\n\r\n              Key moment\r\n              The Kings shooting run began shortly after a heated moment between the teams after a hard foul by Fox against Jabari Smith Jr. There were three technicals issued with Monk getting one for Sacramento and Smith and Dillon Brooks getting them for Houston.\n\n\r\n              Key stat\r\n              The Kings went nearly nine minutes of game action without missing a shot from the field. Sabonis and Fox each made four, DeRozan and Keegan Murray made three and Monk made one.\n\n\r\n              Up next\r\n              The Rockets play at Golden State on Thursday night. The Kings travel to face Memphis.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997399.468789
}