{
  "game_id": "0022000859",
  "espn_id": "401307655",
  "date": "Apr 17, 2021",
  "matchup": "MEM @ MIL",
  "headline": "Grizzlies top Bucks 128-115 as they start fast on long trip",
  "body": "MILWAUKEE -- — Grayson Allen is helping the Memphis Grizzlies produce an ideal start to their longest road trip in two decades.\n\n\r\n                    Allen shot 7 of 10 from 3-point range and scored 26 points to lead six Grizzlies in double figures as Memphis beat the Milwaukee Bucks 128-115 on Saturday. Allen's seven 3-pointers represented a career high.\n\n\r\n                    Memphis has begun its seven-game road swing by winning on back-to-back nights. The Grizzlies opened the trip Friday with a 126-115 victory at Chicago.\n\n\r\n                    “I just know we have guys that are competitive,” Allen said. “When you get on the road and things get tough, everyone on our team raises our level and we come out with a lot of fight.”\n\n\r\n                    This will mark the first time the Grizzlies have played as many as seven straight road games since the franchise moved to Memphis for the 2001-02 season. The Vancouver Grizzlies had an eight-game trip in March 2001.\n\n\r\n                    The Grizzlies have a better road record (16-10) than home mark (13-16) this season.\n\n\r\n                    \"We're the road warriors,\" said Xavier Tillman, who scored 15 for the Grizzlies. “That's our thing. That's our motto. Road warriors. We walk in your trap and take over your trap.”\n\n\r\n                    Memphis took the lead for good Saturday with 5:02 left in the first quarter during a 10-0 run that included six points from Desmond Bane. The Grizzlies snapped the Bucks' three-game winning streak by shooting 54.8% (51 of 93) from the floor.\n\n\r\n                    Dillon Brooks had 21 points for Memphis. The Grizzlies also got 17 from Jonas Valanciunas, 16 from Bane and 13 from Ja Morant. Kyle Anderson had eight points, eight rebounds and eight assists.\n\n\r\n                    “They played very well on offense,” said Bucks guard Bryn Forbes, who scored 19 points. “Tonight, we couldn't keep up. Most nights, I feel like we could. But tonight, 128 points is a whole lot in just 48 minutes. I think it all lies on the defensive end.”\n\n\r\n                    Giannis Antetokounmpo had 28 points, 11 rebounds and eight assists for Milwaukee.\n\n\r\n                    After trailing by as many as 17, Milwaukee cut Memphis’ lead to 100-93 when Antetokounmpo made the first of two free-throw attempts with 10:53 remaining. But Antetokounmpo missed his second free throw, and the Grizzlies scored eight of the next nine points to get the lead back to 14.\n\n\r\n                    The Grizzlies stayed ahead by at least nine the rest of the way.\n\n\r\n                    Milwaukee's Brook Lopez and Jrue Holiday each scored 17 points. Khris Middleton had 16 points and 10 assists. \n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: This marked the Grizzlies’ first appearance in Milwaukee since Nov. 14, 2018. The Grizzlies beat Milwaukee 116-113 that night to become the first team to defeat the Bucks in Fiserv Forum. ... Brandon Clarke missed a second straight game with a sore right hip. The Grizzlies also were missing De’Anthony Melton (sore left leg) and Justise Winslow (sore right thigh). Winslow last played on March 27 and Melton last played on April 4. ... Killian Tillie went to the locker room early in the second quarter with a cut to his mouth but eventually returned to the game.\n\n\r\n                    Bucks: Donte DiVincenzo missed a second straight game due to a sprained right toe. Forbes replaced him in the starting lineup. ... The Bucks were at home for just the second time in the last 11 games. They went 3-3 on a six-game trip, returned home to lose to Charlotte on April 9 and then won three straight on the road. \n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: At Denver on Monday in their third game of their trip. The Grizzlies lost 103-102 at home to the Nuggets  on March 12.\n\n\r\n                    Bucks: Host Phoenix on Monday. The Bucks lost 125-124 in Phoenix  on Feb. 10 as Antetokounmpo scored 47 points but missed a 20-footer at the buzzer.\n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996929.666774
}