{
  "game_id": "0021801214",
  "espn_id": "401071887",
  "date": "Apr 09, 2019",
  "matchup": "TOR @ MIN",
  "headline": "Raptors end regular season with 120-100 win over T-Wolves",
  "body": "MINNEAPOLIS --  The Toronto Raptors are healthy, confident and ready for the playoffs.\n\nNow, all that's left is to find out their opponent.\n\nKawhi Leonard scored 20 points and the Raptors closed their regular season with a 120-100 victory over the Minnesota Timberwolves on Tuesday night.\n\n\"I think all of us want to win, get to that promised land,\" Leonard said. \"That's a great group of guys here that are unselfish, want to win, want to play defense, want to do the right things on the floor.\"\n\nFred VanVleet scored 16 points, and Chris Boucher had a career-high 15 points and 13 rebounds off the bench for the Raptors, who finished the regular season at 58-24. They'll be the second seed in the Eastern Conference playoffs and face the Brooklyn Nets, Detroit Pistons or Orlando Magic in the first round.\n\n\"Since I've been in the league these last three years, we've been one of the top teams in the league, top teams in the East,\" VanVleet said. \"There's a lot that comes with that. You should take pride in that.\"\n\nAndrew Wiggins and Gorgui Dieng each scored 16 points for the Timberwolves, who played without All-Star center Karl-Anthony Towns. Dieng started in Towns' place. It was Dieng's first start since April 12, 2017.\n\n\"Starting or playing from the bench, it doesn't really matter to me,\" Dieng said. \"I just want to play and help the team. I think it's good that I get to use this playing time.\"\n\nToronto went on a 20-5 run over the final 5:16 of the second quarter and led 69-47 at halftime.\n\nThe Timberwolves never got closer than 15 points in the second half, and the Raptors led by as many as 32 points in the final two periods.\n\n\"I looked at little things and after that big second quarter from Toronto, we started trying to, `OK, let's win the next quarter,' and we did,\" Timberwolves coach Ryan Saunders said. \"We won the first quarter, so those were positives to us. But ultimately, we didn't do enough things to be in the game at the end.\"\n\nBoucher scored 11 points in 10 minutes in the second quarter. Boucher's previous career best was the nine points he scored Dec. 28 against the Orlando Magic. Boucher, the G-League Most Valuable Player and Defensive Player of the Year, was signed to a standard NBA contract on Feb. 10.\n\n\"I just want to play,\" Boucher said. \"When you get in the game, play hard, good things happen.\"\n\nTowns did not play because of knee soreness. Saunders said Towns would travel with the team for Wednesday's season finale in Denver and be a game-time decision.\n\nThe Raptors set a franchise record with their 26th road victory of the season. The only player who missed Tuesday's game with an injury was guard Patrick McCaw (sprained right thumb). Starting guard Kyle Lowry and forward Serge Ibaka were rested.\n\n\"I think we're about as healthy as we could be,\" Raptors coach Nick Nurse said. \"I think it was nice to get Serge and Kyle a night tonight.\"\n\nGOOD TIMING\n\nThe Raptors were in Minneapolis on Monday night, allowing coach Nick Nurse and his staff to attend Monday night's NCAA title game. Nurse played against Virginia coach Tony Bennett when Nurse was at Northern Iowa and Bennett was at Wisconsin-Green Bay. \"I think I held him to 29 points one time,\" Nurse joked.\n\nTIP-INS\n\nRaptors: G Kyle Lowry (rest), F/C Serge Ibaka (rest) and G Patrick McCaw (sprained right thumb) did not play. VanVleet started in place of Lowry. . Toronto reached 1,000 made 3-pointers in a season for the first time.\n\nTimberwolves: G Jerryd Bayless (right ankle contusion) and F Taj Gibson (strained left calf) did not play. They joined Towns and long-term absentees F Robert Covington (bone bruise on right knee), F Luol Deng (left Achilles soreness), G Derrick Rose (right elbow surgery) and G Jeff Teague (left foot inflammation) in missing the game. . Dieng made his first start since April 12, 2017. . Tyus Jones had his stretch of 129:18 without a turnover snapped.\n\nUP NEXT\n\nRaptors: Hosts Brooklyn Nets, Orlando Magic or Detroit Pistons in Eastern Conference playoffs.\n\nTimberwolves: At Denver Nuggets on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994086.3323991
}