{
  "game_id": "0022400991",
  "espn_id": "401705557",
  "date": "Mar 17, 2025",
  "matchup": "TOR @ PHX",
  "headline": "Devin Booker leads big 2nd quarter, Suns rout Raptors 129-89",
  "body": "PHOENIX -- — Devin Booker scored 27 points and led a second-quarter surge as the Phoenix Suns routed the Toronto Raptors 129-89 on Monday night.\n\n\r\n              Playing without injured guard Bradley Beal again, the Suns saw seven players score in double figures. Thirteen players scored for Phoenix and the final margin of 40 was the biggest lead of the night.\n\n\r\n              The Suns trailed 29-24 at the end of the first quarter but outscored Toronto 39-11 to take a 23-point halftime lead. Most of it came with reserves Royce O’Neale, Tyus Jones, Cody Martin and Oso Ighodaro joining Booker on the court.\n\n\r\n              Ryan Dunn scored 17 points, Jones had 15 points including four 3-pointers, Kevin Durant had 14, Monte Morris 12 and Nick Richards 10. O'Neale had 11 points and 10 rebounds.\n\n\r\n              Scottie Barnes had 16 points and Immanuel Quickley had 15 points, seven rebounds and seven assists for the Raptors, playing without starters RJ Barrett (illness) and Gradey Dick (right knee bruise) plus center Jakob Poeltl (rest).\n\n\r\n              Suns coach Mike Budenholzer said before the game that Beal will miss at least a week with a left hamstring injury sustained in Sunday’s loss to the Lakers. Beal, who including Monday has missed 21 of the Suns’ 69 games, had an MRI on Monday and will be evaluated in seven days. Collin Gillespie made his first career start in place of Beal.\n\n\r\n              Takeaways\r\n              Raptors: Coach Darko Rajakovic sent out his 30th starting lineup of the season on Monday. Raptors are 8-25 on the road.\n\n\r\n              Suns: Moved one game behind Dallas for the last play-in spot in the West with 13 games remaining.\n\n\r\n              Key moment\r\n              Booker scored 13 points in a 15-2 Phoenix run to begin the second quarter.\n\n\r\n              Key stat\r\n              While Durant was on the bench for most of the second quarter, Phoenix outscored Toronto 33-8.\n\n\r\n              Up next\r\n              Raptors visit Golden State on Thursday. Suns host Chicago on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998254.307675
}