{
  "game_id": "0022400922",
  "espn_id": "401705488",
  "date": "Mar 09, 2025",
  "matchup": "MIL vs. CLE",
  "headline": "Cavaliers rely on scoring balance to beat Bucks 112-100 for 14th consecutive victory",
  "body": "MILWAUKEE -- — Max Strus had 17 points to lead a balanced scoring attack as the NBA-leading Cleveland Cavaliers defeated the Milwaukee Bucks 112-100 on Sunday night for their 14th consecutive victory.\n\n\r\n              The Cavs became just the second team to win 14 straight while scoring at least 110 points in each of those games. The only other time that happened was in 1986, when the Boston Celtics did it on their way to winning a title.\n\n\r\n              Milwaukee's Giannis Antetokounmpo scored 30 points and moved into 50th place on the NBA's career scoring list. He increased his career total to 20,077 to pass Tom Chambers, who scored 20,049 from 1981-98.\n\n\r\n              Damian Lillard added 22 points for the Bucks, who were playing for a second straight night after losing 111-109 at home to the Orlando Magic on Saturday.\n\n\r\n              Donovan Mitchell had 15 points for Cleveland. Darius Garland and Evan Mobley added 13 each, while Jarret Allen had 11.\n\n\r\n              The Cavs took the lead for good with 4:15 left in the first quarter and pulled away by going on a 13-0 run that started with about 8½ minutes remaining. \n\n\r\n              Takeaways\r\n              Cavaliers: This game showcased Cleveland's depth. Nobody scored more than 17 points, but eight players had at least nine points.\n\n\r\n              Bucks: Milwaukee fell to 0-9 against the top three teams in the East: Cleveland, Boston and New York. This loss opened a string of eight consecutive games in which the Bucks face a team with a winning record.\n\n\r\n              Key moment\r\n              After Kyle Kuzma sank a 3-pointer to cut Cleveland’s lead to 89-84 with 8:55 remaining, Mitchell responded by making a 3-pointer of his own 21 seconds later to start the 13-0 spurt that put the game away.\n\n\r\n              Key stat\r\n              Cleveland outscored Milwaukee 57-27 from 3-point range. The Cavs went 19 of 47 from beyond the arc. The Bucks were 9 of 31.\n\n\r\n              Up next\r\n              Both teams play again Tuesday, with the Cavaliers hosting the Brooklyn Nets and the Bucks visiting Indiana.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997826.753068
}