{
  "game_id": "0021500463",
  "espn_id": "400828350",
  "date": "Dec 28, 2015",
  "matchup": "CHI vs. TOR",
  "headline": "Snell, Gasol spark Bulls to 104-97 win over the Raptors",
  "body": "CHICAGO -- Tony Snell has no idea when he might play these days, so he prepares as if he's still a part of the Chicago Bulls' rotation.\nSnell and Pau Gasol each had 22 points, Derrick Rose added 20 and the Bulls pulled away late for a 104-97 victory over the Toronto Raptors on Monday night.\n\"I'm staying ready every day,\" Snell said. \"I make sure I'm staying ready at all times.\"\nSnell, who was back in the rotation because Doug McDermott was a late scratch with a sore right knee, had 19 points in the final 17 1/2 minutes -- including 16 in the fourth quarter -- to spark the Bulls.\n\nIf not for McDermott's injury, Snell, who has started 21 games this season, might not have played at all -- just like in two of the previous three games.\n\"I didn't know he wasn't going to play; I had no idea,\" Snell said of McDermott. \"I just make sure to stay ready at all times.\"\nAaron Brooks had 17 points and rookie Bobby Portis added 12 as the Chicago reserves outscored their counterparts 51-27.\nKyle Lowry had 28 points and DeMar DeRozan added 19 for Toronto.\nJonas Valanciunas had nine points in 20 minutes off the bench after missing 17 games with a broken left hand.\n\"He's getting his sea legs back, getting the rust off,\" Raptors coach Dwane Casey said. \"He's going to be OK. Jonas is the least of our worries, getting him back in.\"\nToronto actually got off to a fast start and held the lead for much of the first three quarters.\nLuis Scola, who finished with 13 points, had 12 points on 6 of 6 shooting to lead Toronto to a 32-23 lead at the end of the first quarter.\nThe Bulls rallied in the second behind Brooks and Portis. The two reserves combined to score Chicago's first 19 points of the quarter as the Bulls took a 42-40 lead.\nThey led by 49-46 before the Raptors scored the last six points of the first half for a 52-49 advantage.\nToronto maintained the lead for most of the third before the Bulls scored the final eight points of the quarter for a 78-73 lead.\n\"We've got to have some support from our second unit,\" Casey said.\nThe Bulls then continued the surge, opening the final quarter with a 13-5 run for a 91-78 lead with just under six minutes to play. Snell had seven points during the run, while Portis added four.\n\"I'm really happy for Tony,\" Bulls coach Fred Hoiberg said. \"I'm really proud of Tony for staying in there. He's one of those kids that's easy to coach.\"\nTIP INS\nRaptors: Valanciunas had been sidelined since the second half of a game against the Los Angeles Lakers on Nov. 20. He still leads the team with five double-doubles . They entered the game leading the NBA with a plus-88 scoring differential in the fourth quarter.\nBulls: C Joakim Noah (left shoulder sprain) did some on court work before the game, but still isn't close to being ready to return. \"He's feeling better,\" Hoiberg said. \"He'll get reevaluated, I think, a week from today. He still has soreness and, obviously, he's not doing any contact right now. We'll know more next week.\"\nBEAT THE BEST\nThe win over Toronto (19-13) continues the Bulls' trend of being at their best against the NBA's best. They've also beaten Cleveland, Oklahoma City (twice), Indiana, and San Antonio, while losing to Brooklyn, New York and Phoenix.\n\"It's all about effort and energy,\" Rose said. \"We have that when we play the best teams and sometimes we don't against the lesser teams.\"\nUP NEXT\nRaptors: host the Washington Wizards on Wednesday.\nBulls: host the Indiana Pacers on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764993944.612149
}