{
  "game_id": "0021400467",
  "espn_id": "400578759",
  "date": "Dec 30, 2014",
  "matchup": "CHI vs. BKN",
  "headline": "Brook Lopez's season-best 29 help Nets cool off Bulls",
  "body": "CHICAGO -- Impressive wins have been rare for the Brooklyn Nets this season, but Brook Lopez believes the team can (and should) have more performances like Tuesday night.\n\"I think we've been capable of putting together an effort like this throughout the year,\" he said. \"We just haven't really sustained it the entire game and we did tonight. We can be a lot better than this.\"\nLopez had a season-high 29 points, Joe Johnson had 20 points and 11 rebounds to lead the Nets to a 96-82 victory, snapping the Chicago Bulls' seven-game winning streak.\n\nBrooklyn (15-16) had just one previous win this season against a team with a winning record, a 95-93 overtime win against San Antonio on Dec. 3.\n\"Tonight we committed to help each other,\" Brooklyn coach Lionel Hollins said. \"It's been our game plan. We have just gotten better at doing it.\"\nMike Dunleavy led the Bulls (22-10) with 23 points on 9-for-15 shooting, including 5 for 9 on 3-pointers.\nJimmy Butler, who averaged 26.4 points during the winning streak, had just eight points. Derrick Rose had just four on 2-for-15 shooting.\nDuring their seven-game streak, the Bulls had averaged 106.6 points on 45.4 percent shooting. But after a 31-point first quarter, they struggled to score the rest of the game.\n\"I mean, this was the first game that it was like this,\" Rose said of the Bulls' poor shooting. \"Usually, it's me by myself missing shots and everyone else making shots.\"\nRose is just 7 for 35 from the field in back-to-back games the previous two nights. \"It's just two games,\" he said. \"I'm not going to stop shooting.\"\nThe Nets would like to think they played a large role in the Bulls' offensive woes.\n\"The biggest thing was holding them to one shot,\" Mason Plumlee said. \"Our initial defense has been pretty good at times this season, but we've given up too many second shots.\"\nThe Nets also put pressure on the Bulls on the offensive end with Lopez, playing in just his fifth game since returning from a lower back strain, going 13 for 21 from the field. Johnson was 8 for 14 from the field and recorded his first points-rounds double-double in six years.\nThe Nets took control in the second quarter and had a 55-45 halftime lead. After the Bulls pulled within five early in the third, Brooklyn reclaimed command and had an 84-69 lead heading into the fourth.\n\"It was the way the team played,\" Lopez said. \"We played together, we moved the ball well, we shared it and, most importantly, from the second quarter on we made our living defensively, getting stops and limiting, for the most part, them to one shot.\"\nTIP INS:\nNets: Kevin Garnett was held out after playing 21 minutes Monday night against Sacramento in Brooklyn. Lopez started in Garnett's spot. He played 33 minutes after not totally more than 15 in the previous four games.\nBulls: Kirk Hinrich (left hamstring) missed his fifth straight game. He still is listed as day-to-day and there is no target date for his return.\nEJECTED\nBulls guard Aaron Brooks was ejected in the second quarter after picking up two quick technical fouls. With the players heading toward the bench following a timeout with 9:42 remaining in the first half, Brooks picked up the first technical from official David Guthrie for bouncing the ball hard back onto the court.\nAt that point, Brooks turned and said something to Guthrie. The official then called the second technical, resulting in the automatic ejection.\n\"It was very surprising to me,\" Brooks said. \"There was a lot of yelling going on during the game, and the person who wasn't yelling got a technical. That made no sense to me, so whatever . . .\"\nHOME IMPROVEMENT:\nThe Bulls also had a five-game home winning streak snapped and are just 8-6 at the United Center after beginning the season. Tuesday's game began a stretch of eight of nine games at home -- the lone road game is Jan. 9 at Washington -- so the Bulls can start another streak if they correct their home-court problems.\nUP NEXT:\nThe Nets are at Orlando on Friday.\nThe Bulls host the Denver Nuggets on New Year's Day.",
  "source": "espn_api",
  "crawled_at": 1764991695.047798
}