{
  "game_id": "0022300962",
  "espn_id": "401585590",
  "date": "Mar 15, 2024",
  "matchup": "MIA @ DET",
  "headline": "Adebayo has 22 points and nine rebounds as Heat end four-game losing streak with win over Pistons",
  "body": "DETROIT -- — Bam Adebayo had 22 points and nine rebounds in 29 minutes, and the Miami Heat ended a four-game losing streak with a 108-95 victory over the Detroit Pistons on Friday night.\n\n\r\n              Adebayo went 10 for 14 from the floor before sitting out the fourth quarter as Miami coasted to the win. Caleb Martin and Terry Rozier each had 18 points.\n\n\r\n              “Bam was going to impose his will on this game, and he did it on both ends of the court,” Heat coach Erik Spoelstra said. “That’s what leaders do. In the toughest moments of the season, they step up and you just follow them.\"\n\n\r\n              The Pistons were trying for their first three-game winning streak since the 2021-22 season, but committed 18 turnovers that led to 33 Miami points. \n\n\r\n              “That's a huge part of (the game), just because giving up that many points is demoralizing,” Pistons coach Monty Williams said. “We had some really tough offensive possessions where we weren't organized. That was responsible for some of the turnovers.”\n\n\r\n              Simone Fontecchio scored 24 points and Jalen Duren added 15 points and 17 rebounds.\n\n\r\n              “It's easy for me to play with this group,\" said Fontecchio, who replaced Ausar Thompson (illness) in the starting lineup. “They make everything easier for me, especially playing with Cade (Cunningham).”\n\n\r\n              Cunningham, playing with a sore knee, had 11 points, nine rebounds and six assists in 31 minutes.\n\n\r\n              The teams play again Sunday afternoon in Detroit.\n\n\r\n              Miami led 56-54 at the half, but outscored Detroit 8-2 in the first two minutes of the third quarter. Four of the points came off Detroit turnovers, giving the Heat 24 for the game.\n\n\r\n              “When you give up 33 points off turnovers and you're not making a lot of shots, it becomes very difficult,” Fontecchio said.\n\n\r\n              The Heat struggled badly from the 3-point line in the first two-plus quarters, missing 17 of their first 20 attempts, but Duncan Robinson hit three straight to take an 83-65 lead with 2:14 left in the quarter.\n\n\r\n              “He's as ignitable as anyone in the league,” Spoelstra said. \"The first one was at the clock and probably one of the tougher ones he's hit in the last few games.\n\n\r\n              “When he hits one of those, it can become an avalanche.”\n\n\r\n              Miami's lead was 84-72 going into the fourth and the Pistons never forced Adebayo back into the game. Thomas Bryant, Adebayo's backup, scored 11 points in the quarter.\n\n\r\n              Adebayo and Fontecchio each scored 16 points in the first half, while Duren had 11 points and 10 rebounds.",
  "source": "espn_api",
  "crawled_at": 1764995334.82983
}