{
  "game_id": "0022300839",
  "espn_id": "401585467",
  "date": "Feb 27, 2024",
  "matchup": "CHI vs. DET",
  "headline": "Cunningham scores 26 as Pistons beat Bulls 105-95 to stop 6-game slide",
  "body": "CHICAGO -- — Cade Cunningham was just glad the Detroit Pistons could take a deep breath and exhale. A rare win felt particularly good coming off such a heated loss.\n\n\r\n              Cunningham scored 26 points and the Pistons stopped a six-game losing streak with a 105-95 victory over the Chicago Bulls on Tuesday night.\n\n\r\n              The Pistons (9-49) bounced back from a loss at New York the previous night and tied Washington for the NBA's worst record despite solid performances by Chicago's Nikola Vucevic, DeMar DeRozan and Andre Drummond. They put this one away with time to spare after a costly no-call helped send them to a two-point loss against the Knicks.\n\n\r\n              “Man, this feels amazing,” Cunningham said. “This feels amazing, man. Emotional day yesterday. This morning, still kind of felt it a little bit but put it behind us. This was a huge game for us.”\n\n\r\n              Detroit went on a 12-2 run in the fourth quarter to stretch a one-point lead into a 101-90 advantage.\n\n\r\n              Simone Fontecchio scored 17 and matched a career high with five 3-pointers. Jaden Ivey finished with 15 points, helping the Pistons beat the Bulls for just the second time in 18 games.\n\n\r\n              Jalen Duren added 14 points and 10 rebounds. Ausar Thompson scored 13. Isaiah Stewart finished with 11 points and nine rebounds after missing 11 games — the previous three due to a league suspension for punching Suns center Drew Eubanks at the arena hours before a game at Phoenix.\n\n\r\n              Vucevic had 25 points and 10 rebounds. DeRozan also had 25 points.\n\n\r\n              Drummond added 20 points and 11 rebounds against his former team, but the cold-shooting Bulls lost for the third time in four games. Chicago made just 2 of 29 3-pointers, with Alex Caruso, Ayo Dosunmu and Coby White each missing all five attempts.\n\n\r\n              “I was like laughing in my head because when you look at it — I think. what were we, 2 for 30? — that's just crazy,” Dosunmu said. “What are the odds? You take it. It's the beauty of basketball. Some nights, you'll go 6 for 6, 7 for 7. Some nights, the ball doesn't go in. That's when you've got to really focus in on those details. That's when you have to grind it out, get to the free-throw line, get more stops than usual.”\n\n\r\n              With an 89-88 lead midway through the fourth quarter, Fontecchio nailed a 3 and Cunningham made three free throws to spark the decisive run. \n\n\r\n              The Pistons continued to add to their lead after White made two free throws for Chicago. \n\n\r\n              Cunningham nailed a 3 and made a foul shot. Duren hit two free throws to make it 101-90 with 3:32 remaining, helping Detroit come out on top.\n\n\r\n              “It was just a big-time program win for us,” coach Monty Williams said.\n\n\r\n              Williams was in a far better mood than he was the previous night, when he ripped the officials. \n\n\r\n              He didn’t exactly back away from his comments and seemed to take little solace Tuesday in the crew chief acknowledging that referees missed a foul by New York’s Donte DiVincenzo. He also said he hadn’t heard from the NBA about a potential fine.\n\n\r\n              “I think I said enough last night,” Williams said. “I’m not of the mindset of creating or building up an argument against the NBA or the officials. I was talking about an isolated incident last night, and I’ll stand on what I said and what I saw after the game. As I told our guys today, we have to move past it but learn from it.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Cleveland on Friday.\n\n\r\n              Bulls: Host Cleveland on Wednesday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995878.727434
}