{
  "game_id": "0022000631",
  "espn_id": "401307417",
  "date": "Mar 19, 2021",
  "matchup": "SAC @ BOS",
  "headline": "Kings hold on, beat Celtics 107-96 to sweep season series",
  "body": "BOSTON -- — Richaun Holmes had 25 points, 11 rebounds, three blocked shots and two steals, and the Sacramento Kings held on to beat Boston 107-96 on Friday night and earn their first season sweep of the Celtics since 2007.\n\n\r\n                    De’Aaron Fox scored 29 points and Buddy Hield had 22 for Sacramento, which has won consecutive games for the first time since Feb. 6-7. It was Holmes' fifth double-double in his last six games, and 15th of the season.\n\n\r\n                    “Tonight is just an example for people to see in a win what he’s been doing for us all season long,” said Kings forward Harrison Barnes, who had 15 points and 13 rebounds. “A lot of that is overshadowed by how we’ve been playing as a team. But he's been a defensive anchor for us all season.\"\n\n\r\n                    Jaylen Brown had 19 points and 11 rebounds for Boston, which lost for the fourth time in five games to again fall below .500. The Kings outscored Boston 25-15 in the fourth quarter. \n\n\r\n                    “You have to be so engaged to win an NBA game. When you’re not, you don’t. We’re not,” Celtics coach Brad Stevens said. “It's got to be 17 guys dying to play well together, and I think the fun follows that.\" \n\n\r\n                    The Celtics eliminated a 15-point, first-half deficit and went ahead briefly in the fourth quarter. Sacramento led 97-93 with two minutes left when Holmes blocked Jayson Tatum driving to the basket and started the fast break that ended when Hield pulled up for a 3-pointer to make it a three-possession game. \n\n\r\n                    Holmes had another block, as well as a steal, on Boston's next possession before Fox's jumper made it 102-93. \n\n\r\n                    “I’ve been so impressed with Richaun since we got him,” Kings coach Luke Walton said. “He fought and earned a starting spot and he’s never given it back. ... When our team’s having success, he’s usually a pretty big part of that.\"\n\n\r\n                    The Kings led by as many as 10 in the first quarter and 15 in the second, and still held a 67-54 edge with eight minutes left in the third before Boston scored nine straight points. Payton Pritchard hit a 3-pointer to tie it 76-all with two minutes left in the quarter, and after Hield hit a 3, Pritchard made another to tie it again.\n\n\r\n                    Boston finally retook the lead in the fourth when Grant Williams hit a 3-pointer to make it 87-86 with 7:33 to play. After again leading 91-90 with 4 1/2 minutes left, Boston gave up 10 of the next 12 points, in cluding a banked 3-pointer by Holmes at the shot clock buzzer.\n\n\r\n                    Walton said Holmes' performance was “inspiring.”\n\n\r\n                    “It’s screening, running, blocking shots, occasional bank-shot 3s from the top of the key,” he said. “To see him get rewarded for that is a lot of fun for a coach.”\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: The Kings won the previous matchup with Boston on Feb. 3 116-111. ... Forward Jabari Parker, who did not play, ran laps around the court after the game for about a half hour.\n\n\r\n                    Celtics: According to the Celtics broadcast, they entered the night with a 7-0 record in their traditional home white uniforms and 13-20 in their alternative combinations, including 5-7 in the green ones they wore Friday. ... Boston's 15 fourth-quarter points tied a season low for any Kings opponent. \n\n\r\n                    OPEN HOUSE\n\n\r\n                    There were about 50 Celtics staffers in the stands – the first time the team has played in front of any fans in Boston since March 8, 2020, before the pandemic shut down the NBA season. The state will allow large arenas and ballparks to admit 12% of capacity starting Monday, but Friday’s game was a test run.\n\n\r\n                    Instead of surrounding the court with some of the Celtics’ championship banners to provide a TV backdrop, they were returned to the rafters. The fans scattered among a half-dozen sections, a handful in each area.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Visit 76ers on Saturday. \n\n\r\n                    Celtics: Host Magic on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997957.340018
}