{
  "game_id": "0021600292",
  "espn_id": "400899734",
  "date": "Dec 03, 2016",
  "matchup": "CHA vs. MIN",
  "headline": "Towns, Timberwolves battle back to top Hornets 125-120 in OT",
  "body": "CHARLOTTE, N.C. -- Perhaps this was the type of win the talented and young Minnesota Timberwolves needed to get on a roll.\nAndrew Wiggins scored 29 points, Karl-Anthony Towns added 27 points and 15 rebounds, and the Timberwolves showed late-game poise by erasing a 10-point, fourth-quarter deficit to beat the Southeast Division-leading Charlotte Hornets 125-120 in overtime on Saturday night.\n\"The more close games you're in and the more you win, the better you get,\" Minnesota coach Tom Thibodeau said. \"Repetition builds habits. When you see things happen in a game, it slows everything down.\"\nZack LaVine added 17 points and Ricky Rubio had nine points and 12 assists for the Timberwolves, who snapped a four-game losing streak and avoided being swept by the Hornets for the third straight season.\n\"We came back and really made some really winning plays down the stretch,\" LaVine said. \"That's what happens when you keep fighting. We've been fighting the last four or five games and been in those positions but we got over that hump. It feels good. Now we need to keep it going.\"\nTowns, a dominant force on the glass all night, had six points in overtime, including a backbreaking follow off a missed shot with 21 seconds left to put the Timberwolves up by six. Towns sealed the victory with two free throws with 3.9 seconds remaining.\nCharlotte appeared on its way to its fourth win in five games, leading 104-97 with less than one minute to play.\nBut Minnesota battled back to tie the game in regulation with LaVine, Rubio and Wiggins all hitting 3-pointers in the final 39 seconds. Wiggins' pull-up from 31 feet in transition with 8.9 seconds tied the game at 106.\nThe Hornets had a chance to win the game at the end of regulation, but Kemba Walker missed everything on a step-back 18-footer at the buzzer.\n\"There were a lot of mistakes on the defensive end and we gave up some big baskets,\" Walker said. \"We missed some rotations and we have to be better down the stretch.\"\nWalker led Charlotte with 22 points and eight assists. Frank Kaminsky had 21 points and Nic Batum had 15 points and 12 assists.\nTIP-INS:\nTimberwolves: Wiggins and Towns were a combined 22 of 42 from the field. ... Blocked 10 shots.\nHornets: The Hornets have given up an average of 16.5 points per game in the first quarter in the last two games, compared to a season average of 27.1 points. ... Cody Zeller had four blocks.\nSTRONG OT START\nThe Timberwolves took advantage of the momentum they had built at the end of regulation, opening overtime with a 7-0 run.\n\"You know, it always looks better when the ball is going in,\" Thibodeau said. \"When we're getting the right shots and sharing the ball, everything looks a lot better. Obviously, playing from a lead is important and we haven't been doing that.\"\nNOT PHYSICAL ENOUGH\nHornets coach Steve Clifford said he was \"especially disappointed\" with this loss because the team had emphasized getting its defense set and physicality in terms of blocking out.\n\"They crushed us with the block outs in the fourth quarter,\" Clifford said. \"They had at least four that might have led to nine points. That can't happen. It's been discussed and we've watched it and the reality is we either going to become a more physical group or we're not going to win -- at least not every night.\"\nTOWNS PASSES GARNETT\nTowns established a new Timberwolves record with his 27th straight game with at least one blocked shot. He had two blocks against the Hornets.\nUP NEXT:\nTimberwolves: Minnesota returns home Tuesday to face the NBA's best road team in San Antonio. The Spurs are 11-0 on the road, while the Timberwolves are 3-6 at home.\nHornets: Charlotte heads out on the road Monday night to face the Dallas Mavericks, who they just beat on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764995531.880648
}