{
  "game_id": "0021800904",
  "espn_id": "401071577",
  "date": "Feb 25, 2019",
  "matchup": "MEM vs. LAL",
  "headline": "Conley, Grizzlies dent Lakers' playoff hopes in 110-105 win",
  "body": "MEMPHIS, Tenn. --  The Lakers got a triple-double from LeBron James and 32 points from Brandon Ingram but still suffered another dent to their playoff hopes.\n\nMike Conley had 30 points including key free throws in the final minute, Jonas Valanciunas finished with 20 points and 13 rebounds, and the Memphis Grizzlies beat Los Angeles 110-105 on Monday night.\n\nThe loss to the Grizzlies, in next-to-last place in the West, came two days after the Lakers lost 128-115 to the Pelicans in New Orleans. That game had James wondering if his teammates' lack of experience in the playoff hunt had them prepared for the pressure and grind of trying to reach the postseason.\n\nThis time, James, who finished with 24 points, 12 rebounds and 11 assists, couched his comments with optimism, saying it is up to him and his teammates to continue their push.\n\n\"Just to stay positive and keep knocking on the door,\" James said when asked about improving through the final stretch of the regular season. \"I feel like if we play like we did (Monday), then we've got to continue that consistent effort to get us over this hump while we make this push.\"\n\nKyle Kuzma finished with 22 for Los Angeles, which is tied with Minnesota in 10th place in the Western Conference -- three games out of the final playoff spot occupied by San Antonio.\n\n\"I was very pleased with the effort and the togetherness of our group,\" Lakers coach Luke Walton said. \"I thought we got back to what we were doing earlier in the season. Unfortunately, we didn't make enough plays.\"\n\nJoakim Noah had 14 points and 12 rebounds, while Avery Bradley scored 15 points for Memphis, which ended a four-game skid.\n\nMemphis led 105-98 with 1:42 left, but a 3-pointer from Kuzma and layup from James pulled the Lakers within 105-103 with a minute left.\n\nConley converted 3 of 4 free throws down the stretch, and one Lakers possession ended with an offensive foul on James. An airball on a 3-point attempt by James with 16 seconds left gave the Grizzlies the ball with a 108-103 lead.\n\nBradley made a pair of free throws with nine seconds left to provide the winning margin.\n\nIt was the first time that Valanciunas had been a part of a win at FedExForum since joining the team at the trade deadline.\n\n\"It felt really good and was really needed,\" the 7-foot center said. \"It's fun to play with this group.\"\n\nTIP-INS\n\nLakers: G Lonzo Ball missed his 12th straight game with a left ankle sprain. ... With an assist in the first quarter, James moved past Andre Miller for 10th place in NBA history. James entered the game tied with Miller with 8,524 assists. ... Los Angeles shot 70 percent (14 of 20) in the first quarter, but trailed 34-31. For the game, the Lakers shot 45 percent. ... James had 10 points in the fourth. ... Ingram was 12 of 18 from the field, including all three of his 3-pointers.\n\nGrizzlies: Coach J.B. Bickerstaff said before the game there was no medical update on F Jaren Jackson Jr. (right thigh bruise) or timetable for his return. ... He also had no update on Kyle Anderson, who missed his 10th straight game with right shoulder soreness. Anderson sought a third opinion on the injury last week. ... Bradley was helped to the locker room with 2:22 left in the third quarter when he rolled his ankle in front of the Grizzlies bench after trying to block Kuzma's shot. He returned in the fourth quarter.\n\nHAPPY BIRTHDAY\n\nNoah, the Grizzlies' reserve center, turned 34 on Monday.\n\n\"I'm really happy that we got the win,\" Noah said. \"I got my people in the building too. And, you know, that's what it's all about -- playing against the best players, beating the Lakers, competing, winning and just coming back to the locker room happy.\"\n\nONE OF A KIND\n\nNoah has brought a new energy to the Grizzlies. Asked if he had played with anyone as intense as Noah, Valanciunas replied: \"Uh, no. I've never played with a guy like this. I'm happy to be part of that.\"\n\nUP NEXT\n\nLakers: Host New Orleans on Wednesday.\n\nGrizzlies: Host Chicago on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994908.297455
}