{
  "game_id": "0022400741",
  "espn_id": "401705307",
  "date": "Feb 08, 2025",
  "matchup": "DAL vs. HOU",
  "headline": "Anthony Davis leads Mavericks past Rockets 116-105 in Mavs debut but leaves with lower-body injury",
  "body": "DALLAS -- — Anthony Davis had 26 points, 16 rebounds, seven assists and three blocks in his Mavericks debut but left the game late in the third quarter with a lower-body injury as Dallas beat the Houston Rockets 116-105 on Saturday.\n\n\r\n              Max Christie, who was acquired with Davis from the Los Angeles Lakers a week ago in the trade that sent superstar Luka Doncic to L.A., added 23 points for the Mavericks after playing twice for Dallas on the road this week.\n\n\r\n              Davis, who had not played since Jan. 28 because of an abdominal strain, assisted on the Mavericks’ first field goal four seconds in, scored six of Dallas’ first 14 points and had a double-double before halftime. He played 31 minutes.\n\n\r\n              Davis said he felt tightness in his groin and quadriceps, and part of the reasoning for not returning was him still recovering from the abdominal strain. He said the injury isn't serious.\n\n\r\n              Alperen Sengun scored 30 points and Jalen Green 24 for Houston, which has a season-long six-game losing streak. Sengun scored 15 in the third quarter, when the Rockets opened on a 21-4 run and cut a 21-point second-quarter deficit to two.\n\n\r\n              With some Mavericks fans still protesting the controversial trade outside American Airlines Center before tipoff, Davis received huge ovations when he took the court for warmups and was announced in the starting lineup.\n\n\r\n              Takeaways\r\n              Rockets: They held Dallas to 38.9% shooting in the fourth quarter (7 of 18) but only shot 40.9% percent themselves (9 of 22, missing all three 3-pointers).\n\n\r\n              Mavericks: P.J. Washington sprained his right ankle and sat out the second half, scoring six points in 16 minutes.\n\n\r\n              Key moment\r\n              After the Rockets cut the Mavericks’ lead to 104-100 with 2:43 to play, Kyrie Irving was fouled on a drive and hit both free throws and Christie followed with his team-high fourth 3-pointer for a 109-100 lead with 1:38 left.\n\n\r\n              Key stat\r\n              The Mavericks set a franchise record with 18 blocks (Daniel Gafford six).\n\n\r\n              Up next\r\n              The Rockets will complete a back-to-back Sunday afternoon at home vs. Toronto. The Mavericks will host Sacramento on Monday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997160.847331
}