{
  "game_id": "0022000271",
  "espn_id": "401267431",
  "date": "Jan 27, 2021",
  "matchup": "CHA vs. IND",
  "headline": "Sabonis' triple-double sinks Hornets 116-106",
  "body": "CHARLOTTE, N.C. -- — When his MRI came back negative after taking a shot to the knee earlier this week, Domantas Sabonis told Pacers coach Nate Bjorkgren there was no way he was going to rest and let his teammates down.\n\n\r\n                    “I don't like sitting out,\" Sabonis said. \"I woke up today and I felt good. I did my shooting time and I was like, ‘I can play.’ I would have felt worse if I didn't play.”\n\n\r\n                    Sabonis powered through with a bruised knee, getting 22 points, 11 rebounds and 10 assists to lead Indiana past the Charlotte Hornets 116-106 on Wednesday night. He came into the game listed as questionable but finished 9 of 10 from the field.\n\n\r\n                    “The toughness that he showed to step foot in that game after taking that knee-to-knee (on Monday), that toughness goes a long way,” Bjorkgren said.\n\n\r\n                    Doug McDermott scored a season-high 28 points — three shy of his career-high — Malcom Brogdon had 25 points and Justin Holiday chipped in with 19 points for the Pacers, who have won three of four.\n\n\r\n                    Terry Rozier had 20 points for the Hornets, who have dropped six of seven.\n\n\r\n                    Sabonis bruised his knee during a collision with Toronto’s Kyle Lowry on Monday night and had an MRI on Tuesday that showed no damage.\n\n\r\n                    He was on his game from the start, continuously making the right plays and finding teammates like McDermott on cuts to the basket and making the most of his shot selection in and out of the paint. Indiana had 34 assisted baskets.\n\n\r\n                    “He’s a willing passer. When the ball is in his hands, he's going to make the right play,” Bjorkgren said of Sabonis. “He took 10 shots and had double-digit assists. He will continuously make the right play.”\n\n\r\n                    Said Brogdon: “Along with Joker (Nikola Jokic), he's one of the best passing bigs in the league.”\n\n\r\n                    The Pacers led by 36-19 after the first quarter.\n\n\r\n                    “We’re trying different lineups now,” Hornets coach James Borrego said. “That was a new group out there tonight. It was a poor first quarter. It wasn’t just the first group, it was the second group as well.” \n\n\r\n                    TIP INS\n\n\r\n                    Pacers: Outscored Charlotte 50-42 in the paint. ... Holiday fouled out with 48 seconds left.\n\n\r\n                    Hornets: Cody Zeller returned to the starting lineup and had 10 points and 14 rebounds. Zeller missed four weeks with a broken hand and had come off the bench the last three games. ... This opens a stretch with 12 of 14 games at home. ... With the Hornets struggling to win there is growing pressure for Borrego to start rookie LaMelo Ball, who had eight points and five assists in 22 minutes.\n\n\r\n                    SLOWING DOWN HAYWARD\n\n\r\n                    Indiana limited the red-hot Gordon Hayward to 16 points on 6-of-14 shooting from the floor.\n\n\r\n                    The Pacers (11-7) pushed their coverage to Hayward, who came in averaging 30.5 points over his past four contests and having made 58.1% of his shots from the floor, including 61.5% from 3-point range.\n\n\r\n                    “The way he’s playing, teams are going to tilt their defense toward him,\" Borrego said. \"We know that. He knows that, too. He’s been in this league for a while. He’s seen different coverages. I’ll continue to look for ways to free him up.”\n\n\r\n                    UP NEXT\n\n\r\n                    The Hornets host the Pacers again Friday night. “They are going to come out with more energy next time,” Sabonis said of the Hornets.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997037.69123
}