{
  "game_id": "0022200139",
  "espn_id": "401468294",
  "date": "Nov 05, 2022",
  "matchup": "PHX vs. POR",
  "headline": "Booker, Paul lead Suns to blowout win over Blazers 102-82",
  "body": "PHOENIX -- — The Phoenix Suns got beat in dramatic fashion by the Portland Trail Blazers on Friday night.\n\n\r\n              In response, they made sure there was zero doubt about Saturday's outcome.\n\n\r\n              Devin Booker scored 24 points, Chris Paul added 15 and the Suns cruised to a 102-82 win over the Trail Blazers.\n\n\r\n              “We have a team full of sore losers,” Suns coach Monty Williams said. “I knew the way that we lost last night, we'd get an intentional effort tonight on both ends. Defensively, I thought we were locked in.”\n\n\r\n              The teams were playing each other for the second straight night. The Blazers won 108-106 on Friday when Jerami Grant hit a baseline jumper at the buzzer.\n\n\r\n              By comparion, Saturday's game was a snoozer. The Suns pushed to a 61-40 halftime lead and had a comfortable advantage throughout the second half.\n\n\r\n              “That's what good teams do — make adjustments,” Booker said. “We had a chance to do that tonight.”\n\n\r\n              Phoenix has the best record in the Western Conference with a 7-2 mark. Both of the losses have come to the Blazers, who fell to 6-3. The teams have already completed their three-game series in the regular season.\n\n\r\n              Grant scored 14 points and rookie Shaedon Sharpe added 13. The Blazers were held to their season low in points.\n\n\r\n              “We didn’t pass the ball enough,” Blazers coach Chauncey Billups said. “Kind of played a little one-on-one too much in the first half. That is an elite defense.”\n\n\r\n              The Blazers were again playing without their high-scoring backcourt of All-Star Damian Lillard and Anfernee Simons because of injuries. The two have combined to average 53 points per game.\n\n\r\n              Booker scored 16 points while Paul had 13 before halftime. The Blazers shot just 34.8% from the field in the first half.\n\n\r\n              \"I am not disappointed in our performance at all, we fought,\" Billups said. “I am disappointed when the effort is not there. We fought hard. It was just a better team tonight.”\n\n\r\n              MISSING CAM\n\n\r\n              The Suns were playing their first season without starting forward Cam Johnson, who could miss extended time because of a right knee injury suffered on Friday night.\n\n\r\n              The fourth-year player had moved into a starting role this season after being a finalist for the NBA Sixth Man of the Year last year. \n\n\r\n              He was averaging a career-high 13 points per game and had just scored a season-best 29 points in a win over the Timberwolves earlier this week. The Suns haven't elaborated on the severity of the injury, but The Athletic reported that the Suns fear he has a torn meniscus. \n\n\r\n              “It's really tough, obviously mostly for him,” Booker said. “We're here with him for whatever he needs. He's going to be around the team. We say ‘family’ every time we break it down and that's the situation we're in.”\n\n\r\n              TIP-INS\n\n\r\n              Blazers: Lillard missed the game because of a right calf strain. Simons was out with left foot inflammation. ... Drew Eubanks was called for a flagrant foul in the first half after knocking Damion Lee to the floor.\n\n\r\n              Suns: Backup G Cam Payne (left foot soreness) missed his second straight game. ... Hosted their 33rd consecutive sellout crowd. ... All 12 players on the roster scored at least two points.\n\n\r\n              UP NEXT\n\n\r\n              Blazers: At Miami on Monday.\n\n\r\n              Suns: At Philadelphia on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995095.496462
}