{
  "game_id": "401809998",
  "espn_id": "401809998",
  "date": "Nov 01, 2025",
  "matchup": "CHA vs MIN",
  "headline": "Randle scores 30 as Timberwolves beat Hornets 122-105",
  "body": "CHARLOTTE, N.C. -- — Julius Randle scored 30 points to lead the Minnesota Timberwolves past the Charlotte Hornets 122-105 on Saturday night, their first victory since All-Star Anthony Edwards was sidelined with an injury.\n\n\r\n              Without Edwards, who has a right hamstring strain, Minnesota had lost home games to Denver and the Los Angeles Lakers.\n\n\r\n              Donte DiVincenzo and Naz Reid added 18 points each, Rudy Gobert had 14 points and 15 rebounds and Jaden McDaniels added 14 points for Minnesota.\n\n\r\n              Miles Bridges had 30 points and LaMelo Ball had 18 points, seven rebounds and eight assists to lead Charlotte, which has lost its last three games.\n\n\r\n              Charlotte led 56-50 at halftime before Minnesota dominated the third quarter 36-18 to take and 86-74 lead into the final quarter. The Timberwolves’ strong play extended into the fourth quarter as they eventually built a 20-point lead.\n\n\r\n              Minnesota made 17 of 36 3-pointers (47.2%) , getting conversions from DiVincenzo (5 of 12), Randle (3 of 6), Rei (3 of 5), McDaniels (2 of 2), Johnny Juzang (1 of 1) and Bones Hyland (1 of 3).\n\n\r\n              The Hornets were 13 of 45 (28.9%)from 3-point range.\n\n\r\n              This was the first game since the Hornets announced they had exercised their fourth-year team option on guard Brandon Miller and third-year team option on forward Tidjane Salaun.\n\n\r\n              Miller, the second overall pick in the 2023 NBA Draft, has appeared in 103 career games, but missed 65 games last year after needing right wrist surgery and missed his fourth straight game Saturday with a left shoulder injury.\n\n\r\n              Timberwolves guard Rob Dillingham was playing in his second career game near his hometown of Hickory, North Carolina, 60 miles northwest of Charlotte. He had four points and three assists in 15 minutes.\n\n\r\n              Up next\r\n              Timberwolves: Play at Brooklyn on Monday night.\n\n\r\n              Hornets: Host Utah on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042539.61078
}