{
  "game_id": "0022300271",
  "espn_id": "401584899",
  "date": "Nov 30, 2023",
  "matchup": "LAL @ OKC",
  "headline": "Shai Gilgeous-Alexander scores 33 as Thunder beat Lakers 133-110",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 33 points and the Oklahoma City Thunder beat LeBron James and the Los Angeles Lakers 133-110 on Thursday night.\n\n\r\n              Gilgeous-Alexander made 11 of 18 field goals and 10 of 10 free throws. Jalen Williams scored 21 points and Chet Holmgren added 18 for the Thunder, who were coming off close losses to Philadelphia and Minnesota.\n\n\r\n              “I thought it was an energy, work win tonight,” Thunder coach Mark Daigneault said. “I just thought we really exerted ourselves on the game and our defense — how we scrambled, our running. We were just fast tonight.”\n\n\r\n              Anthony Davis led Los Angeles with 31 points and 14 rebounds. James had 21 points, 12 rebounds and six assists for the Lakers. He was a game-time decision with a left calf contusion.\n\n\r\n              Oklahoma City shot 53.2% from the field and committed only nine turnovers to improve to 12-6.\n\n\r\n              “I really like my teammates, like genuinely,\" Gilgeous-Alexander said. \"It’s a special group of guys, and I enjoy being around them. And then I prioritize winning, and you can’t win alone.”\n\n\r\n              The injury-plagued Lakers have had an up-and-down week. They lost to Philadelphia by 44 points on Monday, then bounced back to defeat Detroit by 26 on Wednesday. Cam Reddish (right groin soreness), Rui Hachimura (nasal fracture), Jaxson Hayes (left elbow soreness), Jarred Vanderbilt (left heel bursitis) and Gabe Vincent (swollen left knee joint) were sidelined for Los Angeles.\n\n\r\n              “We knew this was going to be tough at the end of the road trip,\" Lakers coach Darvin Ham said. \"Our guys fought to the best of their ability. You know, obviously, there’s some things we need to clean up and we could have done better. We tried our best under the circumstances.” \n\n\r\n              The injuries have made it difficult for the Lakers to figure out their strengths and weaknesses.\n\n\r\n              “I have no idea where we are,” James said. \"We don’t have a group yet. I know what some of us individually are.”\n\n\r\n              The Lakers led by 14 in the first quarter, but the Thunder took over in the second — outscoring the Lakers 42-23 — and led 72-60 at halftime.\n\n\r\n              “It starts on the defensive end, really playing as a unit, playing together and for each other, and then it kind of spirals into our offense,\" Holmgren said. \"Everybody, when we get to that stage, that flow state, I guess — it really comes down to everybody playing confident. And not just themselves, but in others and playing for each other.”\n\n\r\n              Gilgeous-Alexander scored 22 points before the break, while Davis had 19 for the Lakers. \n\n\r\n              Oklahoma City extended its lead in the third quarter and took a 108-88 advantage into the fourth. Holmgren scored 10 points on 4-for-5 shooting in the third.\n\n\r\n              The Thunder led by at least 15 points the rest of the way.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host Houston on Saturday.\n\n\r\n              Thunder: At Dallas on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995539.522785
}