{
  "game_id": "0022200565",
  "espn_id": "401468720",
  "date": "Jan 04, 2023",
  "matchup": "PHX @ CLE",
  "headline": "Evan Mobley hits late jumper, Cavaliers beat Suns 90-88",
  "body": "CLEVELAND -- — Evan Mobley couldn't remember the last time he made a winning shot. He'll never forget his first one in the NBA.\n\n\r\n              “Hopefully,” he said, “more to come.”\n\n\r\n              Mobley's 14-foot jumper with four seconds left — off an assist from Donovan Mitchell — helped the Cleveland Cavaliers rally for a 90-88 victory Wednesday night over the slumping Phoenix Suns, who lost their fourth straight.\n\n\r\n              Mitchell finished with just 20 points two nights after scoring 71 — the seventh player in league history to score at least seven. But on Cleveland's final possession, he drove and fed Mobley, who calmly knocked down his mid-range shot in his return after missing two games with a sore ankle.\n\n\r\n              Mobley was just 1 of 8 from the floor before knocking down the biggest shot of his young career.\n\n\r\n              “What people aren't going to talk about is him relocating,\" Mitchell said of his 21-year-old teammate. \"He got into my vision and he was right there in that moment, naturally. That's what makes him special.” \n\n\r\n              The Suns had a chance to tie it, but Mikal Bridges missed a jumper in the final second. Mitchell snared the rebound and fired the ball to the other end in celebration as the NBA's top defensive team got one last stop.\n\n\r\n              Caris LeVert scored 21 points to lead the Cavs, who spent most of the night chasing the Suns.\n\n\r\n              Mitchell was just 6 of 20 from the field (3 of 12 on 3s) after his historic performance, but he made a critical 3-pointer with 40 seconds left to tie it 88-all.\n\n\r\n              “I really didn't have my legs tonight,” he said. “I was trying to will myself just to be solid.”\n\n\r\n              Chris Paul scored 25 points and Deandre Ayton added 15 points and 18 rebounds for Phoenix, which went just 1-5 on a trip and dropped to 4-12 since Dec. 5. The Suns have struggled without injured All-NBA guard Devin Booker, out with a groin strain.\n\n\r\n              “It’s been that kind of trip,\" Suns coach Monty Williams said. \"That was a hard way to lose a game. The guys are hurting after a game like that we should have won.”\n\n\r\n              Cleveland was without All-Star guard Darius Garland, who missed his third straight game with a sprained right thumb.\n\n\r\n              Before the game, Cavs coach J.B. Bickerstaff acknowledged the possibility of an “emotional hangover” for his players following Mitchell's memorable night.\n\n\r\n              That was certainly the case in the first half as the Cavs came out flat and missed their first 15 3-point attempts while scoring a season-low 33 points before halftime.\n\n\r\n              SUNNY DISPOSITION\n\n\r\n              Despite the Suns' recent slide, which has only worsened without Booker, Williams has been pleased with his team's togetherness. Practices have stayed spirited and he's seeing a team determined to fix things.\n\n\r\n              “We're just waiting for the breakthrough,” he said. \"No splintering. We keep plugging away and that has been our mentality from the jump. That's what I keep telling the guys, 'keep pushing.”\n\n\r\n              SCORING BINGE\n\n\r\n              While Mitchell’s 71-point outburst is the highest in the league this season, 40- and 50-point games have become a regular occurrence.\n\n\r\n              Bickerstaff believes the scoring spike is a combination of factors, including defensive rules that allow offensive freedom and a generation of elite players who began working on their individual skills at a young age.\n\n\r\n              “The league is in a wonderful place as far as talent,” he said. “It literally seems like every night you’re seeing somebody do something spectacular.\"\n\n\r\n              TIP-INS\n\n\r\n              Suns: Booker has missed five straight games since reinjuring the groin Dec. 25 at Denver. ... G Cameron Payne didn't play in the second half due to right foot discomfort. ... Bridges played in his 348th consecutive game, the league's current longest Ironman streak. He has never missed a game as a pro or at Villanova.\n\n\r\n              Cavaliers: Mitchell added 11 assists Monday, meaning he accounted for 99 points — the second most in league history behind Wilt Chamberlain's 104 in 1962. ... Reserve G Raul Neto gave the Cavs a lift with a season-high 14 points. ... Garland took part in the team's morning shootaround, wearing a protective wrap on his thumb. It's possible he'll return later this week.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Miami on Friday night.\n\n\r\n              Cavaliers: Open a five-game trip Friday night at Denver. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995081.106863
}