{
  "game_id": "0022300105",
  "espn_id": "401584733",
  "date": "Oct 30, 2023",
  "matchup": "TOR vs. POR",
  "headline": "Jerami Grant scores 22 as Trail Blazers beat Raptors 99-91 for 1st win of season",
  "body": "TORONTO -- — Jerami Grant scored 22 points, Deandre Ayton had 10 points and a career-high 23 rebounds and the Portland Trail Blazers won their first game of the season by beating the Toronto Raptors 99-91 on Monday night.\n\n\r\n              “It feels great to get that first win,” Grant said. “We just want to build on it and keep getting better.”\n\n\r\n              Fifteen of Ayton’s rebounds came in the second half, when Portland outscored Toronto 52-41. Ayton finished with seven offensive boards.\n\n\r\n              “His presence was felt everywhere on the floor tonight,” Trail Blazers coach Chauncey Billups said of Ayton. “Those are some of the things that we’re going to expect to be getting from him.”\n\n\r\n              Ayton’s previous rebounding mark was 21, set three times. He last reached it Nov. 26, 2022, against Utah.\n\n\r\n              Malcolm Brogdon scored 21 points, including a driving basket with 25 seconds remaining, and Canadian-born guard Shaedon Sharpe scored 14 points for Portland, which snapped a season-opening, three-game losing streak.\n\n\r\n              Trail Blazers rookie Scoot Henderson scored 11 points as Portland snapped a two-game losing streak against Toronto.\n\n\r\n              “I was just so happy for Scoot,” Billups said. “Both halves he was aggressive, he was attacking. I thought defensively he was really good as well.”\n\n\r\n              Scottie Barnes had 20 points and 12 rebounds and Jakob Poeltl had 14 points and 10 rebounds, but Toronto lost its third straight.\n\n\r\n              “I feel like we should have won this one,” Barnes said.\n\n\r\n              Pascal Siakam scored 20 points, and Dennis Schroder and O.G. Anunoby each had 10 for Toronto. The Raptors shot a season-worst 4 for 29 from 3-point range, with Siakam missing all six of his attempts.\n\n\r\n              Anunoby was the only Raptors player to make more than one 3-pointer. He shot 2 for 9 from distance.\n\n\r\n              “We couldn’t get buckets and that was the theme of the night,” Raptors coach Darko Rajakovic said.\n\n\r\n              Anunoby returned after sitting out Saturday’s loss to Philadelphia because of muscle cramps. Forward Precious Achiuwa, who left Saturday’s game because of a sore left groin, did not play Monday.\n\n\r\n              Portland center Robert Williams III was rested on the second night of a back-to-back after playing 26 minutes in Sunday’s loss at Philadelphia.\n\n\r\n              Siakam scored the final four points of the first half to give Toronto a 50-47 lead at the intermission. The Raptors shot 3 for 16 from 3-point range in the first two quarters.\n\n\r\n              Grant scored eight points and Brogdon had seven as Portland made 13 of 22 attempts in the third. The Trail Blazers took an 80-74 lead to the fourth.\n\n\r\n              “In our last game, against Philly, in the third quarter they came out and jumped on us early,” Grant said. “We knew we had to come out with a level of intensity.”\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Visit the Detroit Pistons on Wednesday.\n\n\r\n              Raptors: Host the Milwaukee Bucks on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995468.005716
}