{
  "game_id": "0022300436",
  "espn_id": "401585064",
  "date": "Dec 29, 2023",
  "matchup": "CHA @ PHX",
  "headline": "Booker scores 35 points, Beal returns to help Suns hand Hornets 10th straight loss, 133-119",
  "body": "PHOENIX -- — Devin Booker scored 35 points and the Phoenix Suns, with Bradley Beal back on the court, beat Charlotte 133-119 on Friday night to hand the Hornets their 10th consecutive loss.\n\n\r\n              Kevin Durant, coming off a triple-double at Houston on Wednesday night, had 21 points and 11 assists, and Booker had seven assists. Booker was 10 of 18 from the field, going 5 of 7 from 3-point range. Phoenix shot 60% (18 of 30) from behind the arc.\n\n\r\n              “It’s a game-changer, being at full strength,” Booker said. \"The offense was moving, the ball was hopping around and we were getting the best available shot.”\n\n\r\n              Beal, who missed the previous five games because of a sprained right ankle, contributed four assists in the first quarter, when the Suns went ahead for good. He finished with seven assists, six points and three rebounds in 30 minutes.\n\n\r\n              “It's just good to be back on the floor,” Beal said. “We got the win and finish the game, that's all I cared about tonight.”\n\n\r\n              Jusuf Nurkic had 24 points and 16 rebounds for the Suns and Eric Gordon scored 21 points — all on 7-of-12 3-point shooting. Grayson scored 16 points. \n\n\r\n              “That’s what we want, that’s the beauty of it,\" Beal said about the well-rounded scoring. There’s a lot of threats out there, guys who are very versatile. We can shoot the ball really well.”\n\n\r\n              The Suns won back-to-back games for the first time since a seven-game winning streak ended Nov. 29. Since then, Phoenix had been 3-9.\n\n\r\n              “I loved his floor game tonight,” Suns coach Frank Vogel said about Beal. \"A lot of times (in returning from injury) guys will have a tendency to force, but he let the game come to him. We have a team that is selfless. We have a chance to be special.”\n\n\r\n              The Hornets, again playing without LaMelo Ball (right ankle sprain) and Gordon Hayward (left calf strain), were led by Terry Rozier with 42 points on 14-of-21 shooting, including 8 of 11 from 3-point range, and a team-high eight rebounds. Rozier was one short of his career high. Rookie Brandon Miller scored 20 points. Charlotte last won Dec. 8 at home against Toronto.\n\n\r\n              Cody Martin and P.J. Washington each had 13 points for the Hornets, who were coming off a blowout loss at the Los Angeles Lakers on Thursday. Miles Bridges had 11 points and seven rebounds.\n\n\r\n              “With that effort, that approach, really not a good second half (Thursday)) night, getting in here late, guys playing big minutes last night. I was proud of them,” Charlotte coach Steve Clifford said. “We just couldn’t stop them.”\n\n\r\n              In Phoenix’s 31st game of the season, it was just the second time that the Suns’ “Big 3” of Booker, Durant and Beal played a full game. They played together in a Dec. 13 home loss to Brooklyn. Beal was injured in the Suns’ next game against New York.\n\n\r\n              Josh Okogie (sprained right ankle) was the only member of Phoenix’s regular rotation to sit out Friday.\n\n\r\n              The teams combined for 41 3-pointers and were 31 of 32 from the free-throw line.\n\n\r\n              Rozier’s career high is 43 against New Orleans in 2021.\n\n\r\n              NEXT\n\n\r\n              Charlotte: At Denver on Monday night.\n\n\r\n              Phoenix: Hosts Orlando on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995979.0493271
}