{
  "game_id": "401810105",
  "espn_id": "401810105",
  "date": "Nov 18, 2025",
  "matchup": "BKN vs BOS",
  "headline": "Brown, Celtics beat the Nets 113-99 to move above .500 for the first time this season",
  "body": "NEW YORK -- — Jaylen Brown scored 29 points, Payton Pritchard had 22 points and 10 rebounds, and the Boston Celtics beat the Brooklyn Nets 113-99 on Tuesday night to move above .500 for the first time this season. \n\n\r\n              Derrick White added 15 points for the Celtics, who won their third straight game to improve to 8-7. They played the Nets even for about three quarters before smothering them defensively in the fourth, allowing just one basket for the first 10 minutes of the period.\n\n\r\n              Michael Porter Jr. scored 25 points for the Nets, his career-best seventh straight game with at least 20. But after his 3-pointer gave Brooklyn a 90-89 lead with 9:08 left, the Nets didn't make another basket until 1:56 remained.\n\n\r\n              Day'Ron Sharpe added 16 points for the Nets, who fell to 2-12 overall and 0-7 at home.\n\n\r\n              The Celtics started the season 0-3 and then won their next three. They dropped the next two games and hadn't gotten their record back to even again until beating the Los Angeles Clippers on Sunday.\n\n\r\n              Porter had 18 points at halftime and Pritchard scored 17. The teams combined for 22 2-pointers and 21 3-pointers in the first half, which ended with Boston leading 62-61.\n\n\r\n              The Celtics opened their first double-digit cushion when Brown followed a three-point play with a 3-pointer to cap an 8-0 burst and make it 75-65 with 7 1/2 minutes remaining in the third. Brooklyn cut it to one late in the period before Brown made another 3-pointer to send the Celtics to the fourth with an 89-85 edge.\n\n\r\n              With the Celtics leading 97-92, they chased down three missed shots on one possession to set up White's 3-pointer. After a Brooklyn free throw, he made another 3 to make it 103-93. Brown's 3 with 2:55 left capped an 18-3 run to make it 107-93.\n\n\r\n              Up next\r\n              The teams meet Friday night in Boston.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042648.5184152
}