{
  "game_id": "0022000537",
  "espn_id": "401267697",
  "date": "Mar 02, 2021",
  "matchup": "LAC @ BOS",
  "headline": "Walker's 25 lift Celtics over Kawhi-less Clippers 117-112",
  "body": "BOSTON -- — The Celtics have had trouble at times this season holding on to leads late in games. \n\n\r\n                    Boston benefited from the surprise absence of one of the league's top stars to avoid that and post its first winning streak in a month. \n\n\r\n                    Kemba Walker had 25 points and six assists, and the Celtics took advantage of a late scratch of All-Star Kawhi Leonard and held off the Los Angeles Clippers 117-112 on Tuesday night. \n\n\r\n                    Jaylen Brown finished with 18 points. Jayson Tatum and Payton Pritchard each added 14 as the Celtics posted three straight victories for the first time since January. \n\n\r\n                    “I’m just playing the right way. Taking whatever the defense gives me. The shots are just falling. That’s it,\" Walker said. \"At the end of the day the overall goal is to win. We’ve been doing that.” \n\n\r\n                    Coach Brad Stevens said he's proud of how his team has responded after a stretch that saw them lose nine of 14. \n\n\r\n                    “They've stayed together when they could have been pulled apart by the noise,\" he said. \n\n\r\n                    The Clippers, who have lost five of eight, played without Leonard after he was ruled out shortly before the game due to back spasms. \n\n\r\n                    Paul George led Los Angeles with 32 points. Reggie Jackson took Leonard’s place in the starting lineup and finished with 25 points and seven assists.\n\n\r\n                    Leonard was listed as a starter before the game, but never took the floor during warmups. The team announced late in the first quarter that he had been ruled out. \n\n\r\n                    Coach Tyronn Lue said he didn't know Leonard's status for Thursday's game against the Wizards. \n\n\r\n                    Leonard has missed seven previous games this season, including two for a mouth laceration, two while in the health and safety protocols and three for a bruised leg.\n\n\r\n                    His absence comes with Los Angeles on the tail end of a five-game road trip, which concludes Thursday at Washington. He was coming off a game in which he played 37 minutes in the Clippers’ loss at Milwaukee on Sunday. \n\n\r\n                    Jackson said with Leonard out, the Celtics used their length to their advantage. \n\n\r\n                    “They were comfortable switching and also comfortable playing one-on-one defense,” Jackson said. \"A lot of teams right now have been hurting us with the switching.” \n\n\r\n                    In a game that featured 16 lead changes, the Celtics took a 91-89 edge into the fourth quarter. It grew to 111-100 on a layup by Tatum with 4:23 remaining. \n\n\r\n                    A 3-pointer by Jackson and free throw by Patrick Beverley got Los Angeles within 113-109 at the 1:53 mark. \n\n\r\n                    George hit a 3 to cut it to 114-112. Daniel Theis was fouled, but calmly sank two free throws to help seal it. \n\n\r\n                    The Celtics took advantage of not having to contend with Leonard on the defensive end and started the game 9 of 10 from the field to take an early 20-13 lead. \n\n\r\n                    But George picked up the offensive slack for the Clippers, scoring 21 points in the opening 24 minutes to put Los Angeles in front 63-62 at the half. \n\n\r\n                    Walker said he likes they way his team is trending with one game to go before the break.\n\n\r\n                    “We’ve just been playing well, playing tough. Not letting little things affect us throughout the course of the game,\" he said. “That’s the difference.” \n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Lou Williams made a 3-pointer with 1 second left in the third quarter. … Marcus Morris walked off the floor under his own power but did not return after taking an inadvertent elbow from Brown to the head with 46 seconds left in the first half. He was diagnosed with a concussion, Lue said. \n\n\r\n                    Celtics: Walker has scored at least 20 points in a season-best four consecutive games. ... Outscored the Clippers 42-32 in the paint. \n\n\r\n                    GETTING CLOSER\n\n\r\n                    Stevens said Marcus Smart, who missed his 17th consecutive game with a left calf tear, is getting closer to a return. Smart worked out before the game, doing some shooting and footwork drills. With three practices planned between their first two games following the All-Star break, Stevens said it will give them a better idea of when he’ll be ready. \n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Conclude road trip at Washington on Thursday.\n\n\r\n                    Celtics: Host Raptors on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997686.6537118
}