{
  "game_id": "401810024",
  "espn_id": "401810024",
  "date": "Nov 04, 2025",
  "matchup": "GS vs PHX",
  "headline": "Stephen Curry scores 28 points, Moses Moody adds 24 as Warriors beat Suns 118-107",
  "body": "SAN FRANCISCO -- — Stephen Curry scored 28 points with five 3-pointers, Moses Moody came off the bench to score 24 and also hit five 3s, and the Golden State Warriors jumped to a big early lead before holding on for a 118-107 victory over the short-handed Phoenix Suns on Tuesday night.\n\n\r\n              Devin Booker scored a season-high 38 points, converting all 11 of his free throws. Mark Williams had 16 points and a season-best 16 rebounds and Grayson Allen also scored 16 points for the Suns, who were missing Dillon Brooks and Jalen Green with injuries and fell behind 68-49 at halftime. Phoenix used a 20-6 run to end the third quarter to pull within 92-83 and make it a game again.\n\n\r\n              Quinten Post contributed 14 points with four 3s and six rebounds for Golden State, while Brandin Podziemski had 13 points and Buddy Hield added 12. \n\n\r\n              It was a welcome balanced attack for a Warriors team that had just played seven games in five cities over 12 days — and has another one to complete a back-to-back in Sacramento on Wednesday.\n\n\r\n              Coach Steve Kerr said Curry will sit out against the Kings because of a bad cold that Curry himself said is getting worse.\n\n\r\n              The Warriors are 4-0 at home and sent Phoenix to a fourth straight road defeat to begin the season.\n\n\r\n              Jimmy Butler was questionable with lower back soreness coming into the game but was OK to start after going through his warmup, and he helped Golden State go on an early 11-0 run. They led 33-19 after the opening quarter, making 7 of 11 3-pointers. But Butler didn't return for the second half, finishing with two points on 1-for-5 shooting in 14 minutes. \n\n\r\n              Butler will be questionable again Wednesday, Kerr said.\n\n\r\n              Al Horford sat for the front end of the back-to-back as the Warriors manage his left toe injury.\n\n\r\n              Up next\r\n              Suns: Host the Clippers on Thursday night.\n\n\r\n              Warriors: At Sacramento on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042561.828417
}