{
  "game_id": "0021900078",
  "espn_id": "401160720",
  "date": "Nov 02, 2019",
  "matchup": "DET vs. BKN",
  "headline": "Andre Drummond, Bruce Brown lead Pistons over Nets 113-109",
  "body": "DETROIT -- Though Bruce Brown had career highs in points and assists on Saturday night, his coach was just as interested with a stat he didn't pile up.\nNo turnovers.\nCoach Dwane Casey praised his second-year player after a 113-109 victory over the Brooklyn Nets, in which Brown had 22 points and seven assists in his first career start as a point guard.\n\"That was the key to the game was not letting them get out in transition,\" Casey said of the turnovers. \"He did an excellent job. Him being a point guard, that's why the summer league was beneficial for him, to make sure that he learned to run pick-and-roll, to run the team. He did a good job.\"\nAndre Drummond had 25 points and 20 rebounds, and Luke Kennard finished with 24 points and helped seal the win with a driving basket and two free throws in the final 30 seconds of both teams' second game in two nights.\nDrummond had at least 20 points and 20 rebounds for the third straight game and fourth time in seven games this season. He added six assists, five blocks and three steals.\n\"He's a big guy, and he's skilled under there in terms of rebounding,\" Nets center Jarrett Allen said. \"He knows where to put his body and he knows where to put himself. At the end of the day, he has every skill set needed for it.\"\nKyrie Irving had his first triple-double with Brooklyn with 20 points, 11 rebounds and 10 assists. He played well late but scored six points in the first three quarters, in part because of Brown's defense.\nThe game swung wildly in the middle quarters. The Nets outscored Detroit by 15 points in the second quarter, and the Pistons turned it around for a 14-point advantage in the third.\n\"We were down 14 in the third quarter, but it was nothing but grit and grind to come back the way the guys did,\" Casey said. \"We've got to be that way every night.\"\nThe Pistons, who averaged 19.8 turnovers in the first six games, committed eight in the first half but none after halftime.\nSpencer Dinwiddie split a pair of free throws with 7.4 seconds remaining, and Drummond did the same with 6.7 seconds left to put the Pistons up 111-108.\nPrince then split a pair, missing the second on purpose, and Drummond grabbed the rebound and made a pair with 3.6 seconds left to seal the win.\n\"For some reason we ran out of gas in the second half, and I'm not sure why,\" Nets coach Kenny Atkinson said.\nDrummond had 11 rebounds in the first quarter and assisted the first three baskets. His playmaking was a boost for a team short on ball handlers.\nPlaying without injured point guards Reggie Jackson (back), Derrick Rose (hamstring) and Tim Frazier (shoulder), the Pistons played Brown and Kennard at the position, with Drummond facilitating from the high post.\n\"It was a game of opportunity for some guys,\" Kennard said. \"Bruce, the way he stepped up tonight, he was kind of one of our leaders on the court. So credit to the kid. He played his heart out offensively and he was guarding their best player throughout the entire game.\"\nTaurean Prince added 20 points and Joe Harris had 18 for the Nets.\nTIP-INS\nBrooklyn: Caris LeVert said Friday night's 25-point performance against Houston was in honor of his grandmother, who died this week. LeVert had 14 points on Saturday. ... DeAndre Jordan returned to the starting lineup for the third game this season. Atkinson said before the game that Allen has struggled against Drummond, and that could force a change. In three games against Brooklyn last season, Drummond averaged 9.3 offensive rebounds per game.\nDetroit: This was Detroit's third different starting lineup in seven games this season. ... The Rev. Jesse Jackson was in attendance.\nMONTH OFF\nJackson is out at least four weeks with a back injury, the team announced earlier Saturday.\nJackson, who played the season's first two games but has missed the past four, has a stress reaction in his lower back. The team announced treatment and rehabilitation has started and he will be re-evaluated in four weeks.\nAll-Star Blake Griffin has missed all seven games with lingering soreness in his left knee and hamstring. It was announced before the season that Griffin would be re-evaluated in early November.\nMAKING HISTORY\nDrummond became the third player in the past 25 years to have three straight 20-point, 20-rebound games, joining Kevin Love and DeMarcus Cousins.\nThere has been only one other 20-20 game this season, by Anthony Davis of the Los Angeles Lakers.\nTRIP-DUB\nIrving now has three career triple-doubles. He now has had one with each of his three career teams -- Cleveland, Boston and Brooklyn.\nUP NEXT\nBrooklyn: Host New Orleans on Monday.\nDetroit: The Pistons will close their second stretch of three games in four days this season Monday at Washington.",
  "source": "espn_api",
  "crawled_at": 1764996307.230434
}