{
  "game_id": "0022400334",
  "espn_id": "401704900",
  "date": "Dec 06, 2024",
  "matchup": "LAL @ ATL",
  "headline": "Young hits 3-point in overtime to give Hawks 6 straight wins, 134-132 over Lakers",
  "body": "ATLANTA -- — Trae Young hit a 3-pointer with 7.4 seconds left in overtime and the Atlanta Hawks held on for their sixth straight win, beating the slumping Los Angeles Lakers 134-132 on Friday.\n\n\r\n              Young scored 31 points to offset a huge night by the Lakers' Big Two. LeBron James scored 39 points and Anthony Davis had 38, but it wasn't enough to prevent Los Angeles from taking its third straight loss and seventh defeat in nine games.\n\n\r\n              James had a chance to win it for the Lakers, but his long 3-pointer clanked off the rim. \n\n\r\n              With the score tied at 119, the Hawks had the final possession of regulation. Young’s 3-pointer was blocked by Max Christie and James collided with Davis going for the loose ball, sending the 39-year-old to a knee in pain.\n\n\r\n              After hobbling to the bench, James was back on the court for overtime.\n\n\r\n              Takeaways\r\n              Lakers: James & Co. could at least take solace from putting up a competitive effort. They had lost their two previous games by a combined 70 points — the worst back-to-back showing in franchise history. \n\n\r\n              Hawks: Atlanta is on a roll, putting together its longest win streak since a seven-game run from Jan. 17-30, 2022. \n\n\r\n              Key moment\r\n              Dyson Daniels came up with two huge defensive plays for the Hawks in the final minute of overtime. A steal didn't result in points — James made a huge block — but Daniels then tied up Davis for a jump ball. Davis won the tip, but James knocked the ball out of bounds battling for it with De'Andre Hunter. That set up Young's winning shot.\n\n\r\n              Key stats\r\n              Led by Hunter with 26 points and Bogdan Bogdanovic with 20, Atlanta's reserves outscored their Lakers' counterparts 65-17.\n\n\r\n              Up next\r\n              Lakers: Return home Sunday night to face the Portland Trail Blazers. \n\n\r\n              Hawks: Host the Denver Nuggets on Sunday night.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997201.733032
}