{
  "game_id": "0022101151",
  "espn_id": "401360970",
  "date": "Apr 01, 2022",
  "matchup": "TOR @ ORL",
  "headline": "Raptors beat Magic 102-89 for fifth straight win",
  "body": "Orlando, Fla. -- — Fred VanVleet and Scottie Barnes scored 19 points apiece, Pascal Siakam added 16 points and 11 rebounds and the Toronto Raptors beat the Orlando Magic 102-89 on Friday night for their fifth straight win.\n\n\r\n              Gary Trent Jr. finished with 17 points for Toronto, which took advantage of 21 Orlando turnovers.\n\n\r\n              Mo Bamba had 15 points, 10 rebounds and three blocks for the Magic, who lost their fifth straight.\n\n\r\n              VanVleet had 13 points in the third quarter while the Raptors were pulling out to a 22-point lead. He also contributed five steals and five rebounds.\n\n\r\n              “It was Fred VanVleet being Fred VanVleet,” Trent said. “His resume speaks for itself. He's been great for us all year.”\n\n\r\n              The Raptors were never threatened in the second half, but coach Nick Nurse was somewhat disappointed that all five of his starters had to play 35 minutes or more against the team with the worst record (20-58) in the Eastern Conference.\n\n\r\n               “I usually try to coach the game that's in front of us,” Nurse said. “If someone comes off the bench and gives us a contribution he can get extended minutes, but that was not the case. I think tonight our starters got more minutes than usual out of necessity.”\n\n\r\n              Barnes scored nine straight points to help the Raptors close the first half on a 20-4 run and take a 13-point lead.\n\n\r\n              A 3-pointer by Chuma Okeke had given Orlando its only lead of the game at 42-39 with 5:29 left in the half. Trent tied it with a 3-pointer, before Siakam hit a 12-footer and got into the lane for two layups while Orlando went scoreless for more than three minutes.\n\n\r\n              VanVleet took over in the second half, hitting the first three of five 3-pointers that helped the Raptors stretch their lead to 22.\n\n\r\n              “It’ll be different guys every game,” VanVleet said. “That’s kind of the way it’s been all season. But at the end of the day it’s about wins and losses, and I like the way we’ve been playing.”\n\n\r\n              The highlight for the Magic was the return of guard Davin Cannady, who signed a 10-day contract on Thursday, almost a year after breaking his right ankle in a game against Indiana on April 25, 2021.\n\n\r\n              “It just feels good to be back on an NBA floor after an 11-month grind,” said Cannady, who hit three 3-pointers. “Whether I made or missed every shot, I was going to have fun out there.” \n\n\r\n              The Magic lost forward Franz Wagner to an ankle injury just 20 seconds into the game. The 6-foot-10 rookie, who has started all 78 games, was called for fouling Barnes and fell backward into the lane.\n\n\r\n              TIP-INS\n\n\r\n              Raptors: The Raptors scored 32 points off 21 Magic turnovers. ... F Yuta Watanabe did not play because of a sore left quad. An MRI revealed some damage and Watanabe is expected to miss some time. \n\n\r\n              Magic: Cannady played 29 minutes, more than any Magic player except Bamba. ... Rookie G Jalen Suggs missed his 32nd game, the last nine with a right ankle bone bruise. ... F Wendell Carter Jr. sat out the fourth game of the last five with a sprained left wrist. \n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host the Miami Heat on Sunday night.\n\n\r\n              Magic: Host the New York Knicks on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764992698.1919858
}