{
  "game_id": "0021501207",
  "espn_id": "400829094",
  "date": "Apr 11, 2016",
  "matchup": "HOU @ MIN",
  "headline": "Harden, Howard keep Rockets alive with win over Wolves",
  "body": "MINNEAPOLIS -- With almost no margin for error, James Harden, Dwight Howard and the Houston Rockets finally delivered the kind of effort everyone has been waiting to see all season long.\nIt came at the expense of the young Minnesota Timberwolves, who were just starting to feel good about themselves.\nHarden scored 34 points and Howard had 19 points and eight rebounds to keep the Rockets' playoff hopes alive with a 129-105 victory over the Timberwolves on Monday night.\nHarden made 12 of 21 shots in three quarters, Trevor Ariza scored 21 points and the Rockets made 15 of 30 3-pointers.\nHouston (40-41) entered the game in ninth place in the Western Conference and could have been eliminated with a loss and a win by the Utah Jazz over Dallas.\n\n\"It was important for us,\" Harden said. \"This is our playoff opportunity. We want to come out this entire game and just put the pressure on from the beginning of the game. We got out to a big jump and just rode that wave the whole game.\"\nThe Mavericks beat the Jazz later on Monday night. If the Rockets beat the Kings at home on Wednesday in the season finale, they will be in the playoffs.\n\"See you in Golden State,\" Rockets veteran Jason Terry said as he left Target Center, referring to a potential 1-8 matchup with the Warriors.\nShabazz Muhammad scored 23 points and Zach LaVine scored 21 for the Timberwolves, who were looking for their first four-game winning streak since 2012. Karl-Anthony Towns was held to 12 points and five rebounds, Andrew Wiggins had 12 on 3-for-7 shooting and Minnesota was just 5 for 21 from 3-point range.\n\"On a night when your young guys just don't have,\" Wolves coach Sam Mitchell said, \"we've just got no place to go.\"\nA drama-filled season has come down to the final two games for the Rockets. It was a startling position to be in for a team that advanced to the Western Conference finals last season, but Harden and Howard made sure the Rockets would head to their season finale against Sacramento on Wednesday with something to play for.\nFor once in this uninspiring season, the Rockets played with a sense of urgency. Howard and Harden set the tone from the opening tip, hammering the Wolves in the paint and racking up 38 points in the first quarter.\nThe Wolves came into the game on a high after winning three straight on the road, including stunning victories at Golden State and Portland.\nBut the Wolves have been a much better team on the road (15-26) than they have been at home (13-27) all season, and that trend continued in a woeful effort against the Rockets. Minnesota shot 25 percent in the first quarter and gave up layup after layup to make the Rockets feel very comfortable.\nClint Capela had 10 points and 10 rebounds and Patrick Beverley added 11 points, five rebounds and four assists for Houston, which shot 55.8 percent.\n\"We're trying to make the playoffs. The fire is under us and it's lit,\" Beverley said. \"It's not how we wanted it to be at the end of the season where we start to try to do the right things, but better late than never.\"\nHOWARD'S PRESENCE\nHoward dominated Towns in the post, outmuscling Towns and getting to the rim for dunks and putbacks with ease. It was one of the very few poor games Towns has played all season. He started 1 for 7 and played tentative for most of the night.\n\"He's that good still,\" Rockets coach J.B. Bickerstaff said. \"His impact can be felt all over the floor whether it's in the paint, whether it's setting screens, whether it's defending, blocking shots, rebounding. He can do all those things. I think it's just a rhythm standpoint for anybody. It's hard when you go four minutes without touching it. ... He touches it early, he feels a part of it early, it just helps his psyche.\"\nTIP-INS\nRockets: This was the two-year anniversary of Corey Brewer's 51-point game at Target Center. Brewer had that game for the Timberwolves, against the Rockets. ... Brewer played with a sleeve on his bothersome right elbow. ... F Terrence Jones played in garbage time, his first minutes since Feb. 29.\nTimberwolves: Nemanja Bjelica had 11 points and 14 rebounds. Towns passed Christian Laettner for the franchise's rookie scoring record with 1,475 points. ... Team president Chris Wright celebrated 25 years with the organization on Monday.\nUP NEXT\nRockets: Host Sacramento on Wednesday.\nTimberwolves: Host New Orleans on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994594.707863
}