{
  "game_id": "0022000508",
  "espn_id": "401267668",
  "date": "Feb 26, 2021",
  "matchup": "CHI vs. PHX",
  "headline": "Devin Booker, Deandre Ayton help Suns rally to beat Bulls",
  "body": "CHICAGO -- — The Phoenix Suns’ All-Star duo got a couple of nice assists Friday night.\n\n\r\n                    Devin Booker and Deandre Ayton each scored 22 points and the Suns rallied to beat the Chicago Bulls 106-97, on Friday night.\n\n\r\n                    Chris Paul, who’ll join Booker at the All-Star Game, added 14 points, 15 assists and six rebounds, and Frank Kaminsky had 15 points off the bench to help the Suns win for the 10th time in 12 games.\n\n\r\n                    Zach LaVine scored 24 points for Chicago. The Bulls had won three in a row.\n\n\r\n                    Phoenix wiped out an 87-80 deficit with a 9-0 run early in the fourth quarter, then took the lead for good with five minutes to play on Paul’s short jumper. That started a 10-0 spurt that included 3s from Mikal Bridges and Cameron Johnson.\n\n\r\n                    Ayton was strong at both ends of the floor to help the Suns outscore Chicago 66-44 in the paint. Coach Monty Williams said the influence of Paul seems to be rubbing off on the second-year center.\n\n\r\n                    “You saw his ability to guard smaller players,” Williams said. “Even if a guy made a shot, it was a tough, tough shot. Tonight he was a force in the paint. That’s a sign of growth; he’s learning a ton from Chris. All of that is going to make him a better player and more seasoned.”\n\n\r\n                    Ayton had a team best seven rebounds and three blocks.\n\n\r\n                    The Suns were 6 of 22 from 3-point range after averaging 19 3-pointers in their last four games. Their streak of 120-point games ended at five.\n\n\r\n                    Both Paul and Williams were quick to credit the bench -- especially Kaminsky -- for helping to turn the game around late in the third quarter.\n\n\r\n                    “In the third quarter we thought we weren’t being aggressive. Our second unit talked about it on the bench,” he said after a 14-minute night. “When we were able to do that, we went on a nice little run.”\n\n\r\n                    It added up to a 43-20 rally in the game’s final 14 minutes.\n\n\r\n                    Bridges added 14 in the first of a three-game road trip.\n\n\r\n                    Chicago scored six points in the final five minutes and only 15 in the last period after going 5 for 16 from the floor.\n\n\r\n                    Coby White added 19 points for the Bulls, and Thaddeus Young had 13 points and 10 rebounds. The Suns scored 10 points off Chicago’s 10 fourth-quarter turnovers.\n\n\r\n                    “We just turned the ball over at an alarming rate. It broke our momentum,” coach Billy Donovan said after his team finished with 19 giveaways. “We just didn’t make good decisions with the ball.”\n\n\r\n                    The Bulls finished the second quarter hot, making nine of their last 11 shots to take a 58-46 lead. LaVine had eight points during the 19-4 run that ended the half.\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Paul was assessed a technical foul late in the first half after appearing to complain about the lack of a call against a defender. He more than made up for the moment of indecorum by finishing four rebounds short of his 16th career triple double. … F Dario Saric did not play after spraining his right ankle late Wednesday night in a home loss to Charlotte.\n\n\r\n                    Bulls: Coach Billy Donovan drew a technical foul during a third-quarter timeout after some apparently sharp criticism of the officiating. ... F Lauri Markkanen missed his 11th straight game because of a right shoulder sprain, two days after Donovan said it was unlikely he’d return to action before the All-Star break.\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: At Minnesota on Sunday night.\n\n\r\n                    Bulls: Vs. Toronto in Tampa, Florida, on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764997591.8894348
}