{
  "game_id": "0022300171",
  "espn_id": "401584799",
  "date": "Nov 09, 2023",
  "matchup": "MIL @ IND",
  "headline": "Giannis Antetokounmpo scores 54 points, but Haliburton, Pacers rally for 126-124 win over Bucks",
  "body": "INDIANAPOLIS -- — Giannis Antetokounmpo scored an NBA season-high 54 points, but committed two turnovers after Tyrese Haliburton’s go-ahead 3-pointer with 1:29 left and the Indiana Pacers beat the Milwaukee Bucks 126-124 on Thursday night.\n\n\r\n              Haliburton had 29 points and 10 assists and Bennedict Mathurin added 26 points and 11 rebounds for the Pacers, who blew an 18-point lead and then had to rally from 10 down in the fourth quarter.\n\n\r\n              “We had to deal with a player who was extraordinarily hot and on a roll,” Indiana coach Rick Carlisle said. “We executed as well as we could and created some chaos defensively. You’ve got to take some risks or else he’s going to end up with 60. Very fortunate to get the win.”\n\n\r\n              Antetokounmpo finished one point shy of his career high, but threw away a pass with 1:03 left, then was stripped by Mathurin with 30 seconds to go, both with the Bucks trailing 122-121. He was 19 for 25 from the field, 16 of 18 on free throws and grabbed 12 rebounds, but also had eight turnovers.\n\n\r\n              “Just trying to get stops,” Mathurin said. “The game’s about defense.”\n\n\r\n              Chicago's Zach LaVine had the previous high game in the NBA this season with 51 points against Detroit on Oct. 28.\n\n\r\n              Myles Turner added 21 points for the Pacers, who shot 48% from the field, including a 20-of-48 performance from 3-point range.\n\n\r\n              Playing without All-Star Damian Lillard, sidelined by calf soreness, Milwaukee received a breathtaking performance from Antetokounmpo, who was three points shy of Michael Redd’s franchise record. Khris Middleton, who had 19 points and made a 3 at the final buzzer, missed a 3 that would have tied the game with 7 seconds left.\n\n\r\n              With 8.4 seconds to go and Indiana clinging to a one-point lead, Mathurin connected on two free throws to make it 124-121. Bruce Brown, who had 11 points, nine rebounds and seven assists, sealed the win with two foul shots of his own in the final seconds.\n\n\r\n              The Pacers roared to an 18-point lead in the first quarter and led 38-24 at the end of the period on the strength of eight 3-point makes. Milwaukee climbed within 66-60 at halftime and pulled even at 71 on two free throws from Middleton with 9:32 left in the third.\n\n\r\n              The Bucks went ahead by as many as 10 in the final period and still led 117-108 with 5 minutes left.\n\n\r\n              Antetokounmpo scored 26 points in the first half, including 18 in the second quarter, and then 20 more in the third period. He reached 50 with 10:28 left on a layup assisted by Middleton’s over-the-top pass, prompting an Indiana timeout.\n\n\r\n              First-year Milwaukee coach Adrian Griffin was ejected with 7:52 remaining in the third quarter, the recipient of a double-technical foul immediately following Antetokounmpo’s dunk in traffic. A night earlier, after Antetokounmpo was ejected in a 120-118 win over Detroit, Griffin had promised to be more vocal with officials regarding hits on his superstar.\n\n\r\n              “I thought Giannis was getting hit quite a bit and voiced my opinion,” Griffin said. “Next time I’ll be a little more delicate. He’s such a great human being and doesn’t complain, has such respect for the referees. It is my responsibility to make sure he’s protected.”\n\n\r\n              Milwaukee shot 53% from the floor but made only 9 of 27 from distance.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Visit the Orlando Magic on Saturday night.\n\n\r\n              Pacers: Visit the Philadelphia 76ers on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764996160.0426712
}