{
  "game_id": "401809236",
  "espn_id": "401809236",
  "date": "Oct 23, 2025",
  "matchup": "IND vs OKC",
  "headline": "Shai Gilgeous-Alexander scores career-high 55 to lead Thunder past Pacers 141-135 in 2 OTs",
  "body": "INDIANAPOLIS -- — Shai Gilgeous-Alexander scored a career-high 55 points as the Oklahoma City Thunder won their second straight double-overtime game to begin the season, beating the Indiana Pacers 141-135 on Thursday night in a rematch of last season's NBA Finals teams.\n\n\r\n              The reigning MVP reached 50 for the fifth time, tying Russell Westbrook for most by a Thunder player. Ajay Mitchell added a career-best 26 points for Oklahoma City, which outlasted Houston on Tuesday in its season opener.\n\n\r\n              Gilgeous-Alexander fueled the decisive flurry to open the second overtime. The officials also granted a late timeout to Oklahoma City when it appeared Obi Toppin had stolen the inbound pass underneath the Thunder basket.\n\n\r\n              Gilgeous-Alexander was 15 of 31 from the floor and 23 of 26 from the free throw line while adding eight rebounds and eight assists. Aaron Wiggins finished with 23 points and nine rebounds. Isaiah Hartenstein grabbed 14 rebounds. \n\n\r\n              Bennedict Mathurin had 36 points and 11 rebounds for the Pacers before fouling out in the first overtime. Pascal Siakam had 32 points and 15 rebounds for Indiana, which is without two-time All-Star guard Tyrese Haliburton and backup point guard T.J. McConnell, then lost guard Andrew Nembhard with a sore left shoulder in the first half. \n\n\r\n              Yet the Pacers still had enough scoring punch to stay close. Neither team led by more than seven points in a game marred by 70 fouls called on the players and a technical foul called on Indiana coach Rick Carlisle.\n\n\r\n              The Pacers hung their Eastern Conference championship banner before Gainbridge Fieldhouse opened, and the Pacers honored the matriarch of the franchise, the late Nancy Leonard, before the national anthem was played. Leonard helped save the team with a telethon in 1977. She died in September at age 93.\n\n\r\n              Up next\r\n              Thunder: Heads to Atlanta on Saturday.\n\n\r\n              Pacers: Begin a three-game road trip at Memphis on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042485.950183
}