{
  "game_id": "0021800531",
  "espn_id": "401071207",
  "date": "Dec 29, 2018",
  "matchup": "MEM vs. BOS",
  "headline": "Irving, Horford lead rally as Celtics beat Grizzlies 112-103",
  "body": "MEMPHIS, Tenn. --  Kyrie Irving didn't get off to a very good start, so he and the Boston Celtics made sure to finish with a flurry.\n\nIrving scored 22 of his 26 points in the second half, Al Horford converted a pair of late 3-pointers to finish with 18 points and the Celtics erased a 19-point, second-half deficit to beat the Memphis Grizzlies 112-103 on Saturday night.\n\n\"At the half, Kyrie just challenged all of us to be better,\" Horford said of the difference after Boston trailed 64-47 at intermission. \"The coach as well. I felt like we came out with better energy, played much harder.\"\n\nIrving's halftime talk had to deal with his own game as well. He was limited to four shots in the first half and four points. That approach changed in the second half as Irving became more aggressive and got to the basket more often.\n\n\"Offensively, I felt like they were trying to take the ball out of my hands,\" Irving said, adding the Celtics were more active off the ball in the second half. \"You don't have to touch the basketball every single play down to be effective. You can be effective doing the little things. That's what we did in the second half.\"\n\nBut there still was the matter of overcoming the 19-point deficit in the third quarter. Boston started it with an 11-2 run in the closing minutes of the third. Then, Memphis opened the fourth missing 15 of its first 16 shots. By that point, Boston had overtaken the Grizzlies. Memphis would hold a 97-96 lead before the Celtics rattled off a 12-4 rally that included a pair of 3-pointers from Horford to collect the win.\n\n\"We didn't do a good job of defending the 3-point line,\" Memphis coach J.B. Bickerstaff said after Boston was 9 of 18 behind the arc in the second half.\n\n\"We allowed them to shoot 44 percent from the 3-point line (for the game), and that was the difference.\"\n\nMarcus Morris scored 22 points for Boston, and Gordon Hayward had 14 off the bench.\n\nMike Conley led Memphis with 26 points, while Dillon Brooks added 19. Jaren Jackson Jr. and Marc Gasol finished with 15 points apiece.\n\n\"We couldn't get stops,\" Gasol said. \"Normally, the way you stop the bleeding is by getting stops, and we couldn't get stops. .And it felt like they made every shot down the stretch.\"\n\nTIP-INS\n\nCeltics: Rookie F Robert Williams missed his second straight game with a left groin strain. ... Horford's five 3-pointers matched his career high set against Houston on Dec. 29, 2015. . Irving's 13 assists matched his season best and was one short of his career high.\n\nGrizzlies: Gasol has made a 3-pointer in 12 straight games, one short of his career-best 13 in December 2017. ... Brooks was 4 of 5 from outside the arc. ... Gasol had 10 assists, marking the center's 13th double-double of the season. . Memphis was 24 for 37 in the first half (64.9 percent), a season-best shooting percentage for a half.\n\nDEFENDING CONLEY\n\nBickerstaff doesn't think Conley gets the respect from officials that his point guard deserves. Bickerstaff pointed to a play where he believed Conley was slapped on the arm on a drive to the basket. Bickerstaff said it was a game-changer, calling it a \"huge missed call.\"\n\n\"I think it's been a running theme in the conversations that we've had about the fouls that Mike Conley gets that aren't blown. Mike Conley is one of the class acts in the NBA. He serves the respect of the officials. Time and time again, he drives to the basket, there's contact made, but there's no whistle. . He doesn't get the respect that I feel that some of these other guys at his level do.\"\n\nFATIGUE SETS IN\n\nCeltics second-year forward Guerschon Yabusele played a season-high 16 minutes, including significant minutes in the fourth before Horford returned with 4:47 left in the game. \"I'm not going to lie, I'm really, really tired,\" he said.\n\nUP NEXT\n\nCeltics: Visit San Antonio on Monday.\n\nGrizzlies: Visit Houston on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994132.288117
}