{
  "game_id": "0021401004",
  "espn_id": "400579296",
  "date": "Mar 17, 2015",
  "matchup": "CHA @ LAC",
  "headline": "Redick, Clippers take 22-point lead, hold off Hornets",
  "body": "LOS ANGELES --  A game that appeared to be a laugher in the third quarter for the Los Angeles Clippers suddenly turned serious down the stretch.\n\nJ.J. Redick scored 23 points, Chris Paul had 20 points and eight assists, and the Clippers escaped Staples Center with a 99-92 victory on Tuesday night.\n\nThe Clippers took their biggest lead, 63-41, on a 3-pointer by Paul with 10:04 left in the third quarter. Charlotte's Gerald Henderson got a technical foul from referee Pat Fraher after getting called for an offensive foul with 5:42 left in the period and the Hornets down by 17, but they went on a 12-2 run over the final 3 minutes to get to 77-74.\n\n\"That was awful. That stretch should have been avoided,\" coach Doc Rivers said. \"I thought it started when we had the 18-point lead. Then we had four turnovers in a row, and the game changed at that moment. If it was a one-point game, we never would have played that way during that turnover-fest. That was the only disappointing part of the game for me.\"\n\nThe Hornets, who had season lows of 66 points and 23 field goals Monday night in a 28-point loss at Utah, got as close as a single point five times in the fourth against the Clippers -- the final time on Henderson's 19-footer with 7:18 to play. But they couldn't got over the hump.\n\n\"That was one of those silver-lining moments,\" Rivers said. \"We never let them take the lead. Every time we needed a stop, we got one. Defense on demand -- that's what it felt like tonight.\"\n\nBlake Griffin's two free throws and short hook shot extended the margin to 91-85 with 4:56 remaining. DeAndre Jordan made three of six free throws over the final 4:20 after the Hornets started to intentionally send him to the foul line.\n\n\"He's a bad free throw shooter,\" Hornets point guard Mo Williams said of his former Clippers teammate. \"It's just one of those games where you play the percentages and hope for the best.\"\n\nGriffin had 19 points and 11 rebounds for the Clippers, who were coming off back-to-back losses to Dallas and Houston. Jordan finished with 12 points and 14 boards during a foul-plagued 33 minutes.\n\n\"We got a little complacent and started turning the ball over,\" Paul said. \"I had a couple of bad turnovers in that stretch and just stopped defending and they started making shots.\"\n\nMatt Barnes was scratched because of a sore right hamstring and Jamal Crawford missed his seventh straight game because of a bruised right calf that has put his postseason status in question. Hedo Turkoglu made his first start for the Clippers, getting six points in 21 minutes after 85 games as a reserve over two seasons with them.\n\nAl Jefferson led Charlotte with 21 points and Williams had 18 along with eight assists.\n\n\"We had a chance at the end, but things didn't workout for us,\" Jefferson said. \"I guarantee you that if we continue to play the way we played tonight, we'll be OK.\"\n\nA victory would have pulled Charlotte into a four-way tie for seventh place in the Eastern Conference playoff race with Boston Indiana and Miami -- none of whom played on Tuesday. Instead, the Hornets are in 10th place and a game off the pace with 16 left on the schedule.\n\n\"It's a focus of ours each and every game,\" Williams said. \"Every game is a must win, and every game we lose puts more pressure on us.\"\n\nGriffin, playing his second game after missing 15 because of a staph infection that required surgery on his right elbow, paced Los Angeles to a 59-41 halftime lead with 15 points.\n\nTIP-INS\n\nHornets: F Cody Zeller missed his fourth straight game because of a sprained right shoulder. ... The Hornets had 13 turnovers. They came in averaging 11.9, the fewest in the league. ... Hornets coach Steve Clifford was an assistant coach with Orlando when Barnes, Turkoglu, Redick and Clippers teammate Glen Davis played for the Magic.\n\nClippers: They haven't blown a lead of more than 14 points in any of their first 68 games. ... Turkoglu, who turns 36 years old on Thursday, last started Nov. 2, 2012, for Orlando. He started all 109 games he played for the Magic during the previous two seasons after they got him from Phoenix in a December 2010 trade. ... Jordan's rebounding, shot-blocking ability and league-leading field goal percentage is going to make him one of the most coveted players among those who will be eligible for free agency during the offseason. \"We're going to do everything we can to keep him, and I think we will,\" Rivers said. \"But he has the right. That's why they call it free agency.\" ... G Nate Robinson was signed to a second 10-day contract Tuesday after averaging 4.0 points, 1.4 rebounds and 2.0 assists in his first five games with the club. He played for Rivers in Boston when the Celtics reached the NBA Finals in 2010 and lost to the Lakers. \"I like his energy,\" Rivers said.\n\nUP NEXT:\n\nHornets: At Sacramento on Friday night.\n\nClippers: At Sacramento on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764992263.12015
}