{
  "game_id": "0022300018",
  "espn_id": "401584106",
  "date": "Nov 14, 2023",
  "matchup": "DET vs. ATL",
  "headline": "Dejounte Murray scores 32 points as the Hawks send Pistons to 9th straight loss 126-120",
  "body": "DETROIT -- — Dejounte Murray had 32 points and nine assists as the Atlanta Hawks extended Detroit's losing streak to nine games with a 126-120 win over the Pistons in an In-Season Tournament game on Tuesday night.\n\n\r\n              The Hawks won their Eastern Conference Group A tourney opener, while the Pistons fell to 0-2.\n\n\r\n              Saddiq Bey had 17 of his 19 points against his former team in the second half and Bogdan Bogdanovic added 17 points for the Hawks. \n\n\r\n              “Playing an In-Season Tournament game is like a playoff game for me,” said Bey, who was playing in Detroit for the first time since last season's trade for James Wiseman. “I knew I had to stay aggressive and locked in to give us a better chance to win the game.”\n\n\r\n              Trae Young missed the game after his wife gave birth to their second child on Monday.\n\n\r\n              “We obviously miss Trae, but every player on this team wanted him to be exactly where he is tonight — that's a special moment in life,” Hawks coach Quin Snyder said. “I don't think (Murray) felt any extra pressure with Trae out — he just did what he does every night.”\n\n\r\n              Marvin Bagley III led the Pistons with 22 points and 10 rebounds. Rookie Ausar Thompson added 21. Cade Cunningham had 12 assists, but shot 4 for 14 and had six turnovers.\n\n\r\n              “It's on us to make his life easier,” Bagley said of Cunningham. “Cade's a great player — everyone has seen that — but we have to find ways to get him going.”\n\n\r\n              Detroit turned the ball over 17 times for 19 points, and is averaging 22 points allowed off turnovers this season.\n\n\r\n              “We've got to stop using the young thing around here,” Pistons coach Monty Williams said. “If you were in high school, no one would say that — they would just tell you to stop it. We just have to stop doing it.”\n\n\r\n              The Hawks led 97-91 going into the fourth quarter and continued to force turnovers, but couldn't hit enough shots to put Detroit away. \n\n\r\n              Cunningham's layup with 5:31 left brought the Pistons within 111-110, and Kevin Knox II's dunk put Detroit up 117-116 with 2:01 left.\n\n\r\n              De'Andre Hunter answered with a short jumper, Cunningham missed, and Murray passed to Clint Capela for a dunk to make it 120-117 with 58.3 seconds left.\n\n\r\n              Knox airballed an attempted tying 3, and Murray hit two free throws to make it a two-possession game. Detroit thought it had a chance at a four-point play with 28 seconds left, but the officials ruled Murray fouled Alec Burks before he took his 3-pointer.\n\n\r\n              “It is what it is — I'm not going to do any ranting,” Williams said. “But I'm not sure what else you can do in that situation. What else are you trying to do but hit a 3? It's Alec Burks. That's what he does.”\n\n\r\n              Murray and Bogdanovic scored 32 of Atlanta's 64 points as they took a four-point lead into halftime.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host the New York Knicks on Wednesday.\n\n\r\n              Pistons: At the Cleveland Cavaliers on Friday in a tournament group stage game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995790.298319
}