{
  "game_id": "0022401142",
  "espn_id": "401705708",
  "date": "Apr 06, 2025",
  "matchup": "IND @ DEN",
  "headline": "Obi Toppin scores 22 points and Pacers defeat reeling Nuggets 125-120 without Siakam",
  "body": "DENVER -- — Obi Toppin scored 22 points in his second start of the season and the Indiana Pacers overcame the absence of Pascal Siakam to hand the reeling Denver Nuggets their fourth consecutive loss Sunday, 125-120.\n\n\r\n              Myles Turner's 24 points led the Pacers, who overcame a 13-point first-half deficit and an off-night by Tyrese Haliburton, whose nine points on eight shots were less than half his scoring average.\n\n\r\n              The Nuggets lost their fourth straight despite Nikola Jokic's 41 points, 15 rebounds and 13 assists and a career-high 30 points from Christian Braun.\n\n\r\n              Jokic was charged with a crucial backcourt turnover with the Nuggets trailing 122-120 with 15 seconds remaining but it was Braun who misread the dribble-handoff from Jokic and caused the turnover just as Jokic was passing to Russell Westbrook.\n\n\r\n              Jamal Murray missed his fifth consecutive game for Denver with a strained right hamstring and coach Michael Malone said “hopefully” his star point guard will be back for the start of the NBA playoffs.\n\n\r\n              The Pacers were without Siakam (right elbow) and trailed by 13 in the first half. Haliburton came in averaging 18.6 points per game but was held scoreless until his 3-pointer with 3:43 left in the third quarter tied it at 84-all, and his floater gave Indiana a 98-97 lead heading into the fourth quarter.\n\n\r\n              The Nuggets entered Sunday in fourth place in the bunched-up Western Conference, just a game ahead of the eighth-place Memphis Grizzlies. \n\n\r\n              Takeaways\r\n              Pacers: Indiana showed it can win without Siakam and that depth should prove beneficial in the playoffs. The Pacers are solidly in the fourth place in the East.\n\n\r\n              Nuggets: Denver is falling fast. The Nuggets were in second place not that long ago and now could be facing a play-in game just to make it into the playoffs.\n\n\r\n              Key moment\r\n              Jokic's bad pass to Westbrook in the closing seconds was the Nuggets' third turnover in the final 2 minutes and sixth of the fourth quarter.\n\n\r\n              Key stat\r\n              Malone successfully challenged two foul calls on Denver in the first half, one on Jokic and the other on Christian Braun.\n\n\r\n              Up next\r\n              The Pacers return home to play the Washington Wizards on Tuesday. The Nuggets visit the Sacramento Kings on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997479.603696
}