{
  "game_id": "0021600663",
  "espn_id": "400900084",
  "date": "Jan 22, 2017",
  "matchup": "PHX @ TOR",
  "headline": "Bledsoe's career day leads Suns over Raptors 115-103",
  "body": "TORONTO --  Following a career-high 40-point game, Phoenix Suns guard Eric Bledsoe begrudgingly conceded he might be playing the best basketball of his career.\n\n\"I guess, I guess. I'm just trying to win, man,\" he said after leading the Suns to a 115-103 win over the Toronto Raptors on Sunday night.\n\nBledsoe added 13 assists and six rebounds and Phoenix gave Toronto its third straight loss.\n\nThe Suns trailed from the 2:13 mark of the second quarter until tying it at 95 with 7:29 to play. After DeMarre Carroll and Bledsoe exchanged baskets, Phoenix went on an 18-6 run to take the game away from the Raptors.\n\nIt was the second road win in two nights for the Suns, who had to come from behind late to beat New York on Saturday.\n\nDevin Booker added 20 points and the Suns completed a season sweep of the Raptors for the first time since 2013-14 and improved Phoenix to 11-6 against Eastern Conference teams this season.\n\nAfter going through a number of injuries and absences earlier in the season, particularly to starters T.J. Warren and Tyson Chandler, Phoenix coach Earl Watson said things are starting to come together for his young team, the fourth-youngest in the NBA as of opening night.\n\n\"I wish I could tell you that we've really changed a lot of things, but we didn't,\" he said. \"We just stayed with what we know works -- transparency, accountability, tough love but unconditional love and the guys, it's all about them, so give them all the credit.\"\n\nToronto coach Dwane Casey was less than impressed with his team's effort.\n\n\"When your shots aren't falling, you have to make it up on the defensive end, and we did not do that tonight,\" he said. \"We let our offensive woes go to the defensive end, not get stops, crucial stops, get the ball under control.\"\n\nChief among the wayward shooters was Kyle Lowry, who had 15 points but shot just 1 of 9 from beyond the arc. Lowry capped his night by getting ejected for a flagrant-two foul following contact with the head of Brandon Knight with 1:30 to go.\n\n\"Honestly I thought he was going to go for a floater, I swiped across and hit his head,\" Lowry said. \"He took another dribble. I'm not a dirty player and I already sent a text to him to apologize.\"\n\nDeMar DeRozan led the way for Toronto with 22 points, but was forced to leave the game with 1:30 to play after rolling his ankle landing on a teammate's foot.\n\nTIP-INS\n\nSuns: One night after setting the mark, Chandler ended his franchise record and career high of consecutive 15-plus rebound games at seven with nine rebounds on the night. ... F Dragan Bender left with 9:03 remaining in the second quarter with a sore right ankle and did not return.\n\nRaptors: F Patrick Patterson (left knee) missed his sixth consecutive game. ... The Raptors got double-digit points from all five of their starting players.\n\nHOME AT LAST\n\nToronto's prized free agent signing Jared Sullinger played his first home game for the Raptors on Sunday night. After missing the first 41 games of the season following left foot surgery, the forward made his debut in Friday's loss in Charlotte before entering the fray Sunday with 3:56 to play in the first. He played 13 minutes and had nine points.\n\nDRAWING LEVEL\n\nWith 22 points Sunday, DeRozan tied Chris Bosh for second in franchise history with 265 games with at least 20 points. Vince Carter leads the way with 273 such games.\n\nUP NEXT\n\nSuns: Host Minnesota on Tuesday night, aiming to avoid a season sweep at the hands of the Timberwolves.\n\nRaptors: Host San Antonio on Tuesday night, looking for a third straight home win over the Spurs.",
  "source": "espn_api",
  "crawled_at": 1764995968.6486242
}