{
  "game_id": "401809813",
  "espn_id": "401809813",
  "date": "Nov 28, 2025",
  "matchup": "CHA vs CHI",
  "headline": "Miller scores 27 points, Hornets beat Bulls 123-116 to end 7-game losing streak",
  "body": "CHARLOTTE, N.C. -- — Brandon Miller scored 27 points, Miles Bridges had 22 points, eight rebounds and seven assists and the Charlotte Hornets beat the Chicago Bulls 123-116 on Friday night to snap a seven-game losing streak.\n\n\r\n              Collin Sexton added 21 points off the bench for the Hornets, who held the Bulls to 8 of 36 shooting from beyond the 3-point arc. LaMelo Ball had 16 points, eight assists and seven rebounds.\n\n\r\n              Josh Giddey nearly missed another triple-double, finishing with 25 points, 11 rebounds and nine assists for Chicago. Coby White added 25 points and Nikola Vucevic had 13 points and 14 rebounds .\n\n\r\n              It was the final NBA Cup group game for both teams, although both had been eliminated from the tournament coming into the night.\n\n\r\n              Ball, coming off a frustrating performance against the New York Knicks in which he struggled to cover Jalen Brunson and wound up with a technical foul, made three 3s in the opening half as the Hornets opened an 11-point lead in the second quarter.\n\n\r\n              The Bulls would claw back to take a 94-93 lead behind 13 points in the third quarter from White.\n\n\r\n              But Charlotte would regain the momentum at the start of the fourth quarter with White on the bench Miles Bridges scoring nine points as part of a 12-4 Hornets run. Sexton, who provided huge minutes off the bench, scored on a putback to push the lead to 11 — pumping his fists in the air after the score — and the Hornets held on from there as the Bulls continued to miss from deep.\n\n\r\n              In his third game back from a shoulder injury, Miller looked more comfortable shooting the ball going 10 of 19 from the field field with five 3s.\n\n\r\n              Late in the game Giddey had a heated discussion with a fan near the front row prior to a Bulls inbounds play and the game was stopped briefly.\n\n\r\n              The fan was ejected from the game.\n\n\r\n              “He just said something I didn't like and I went over to him — that was it,” Giddey said. “Security took him out and that was the end of it.”\n\n\r\n              Up Next\r\n              Chicago: At Indiana on Sunday night.\n\n\r\n              Charlotte: Host Raptors on Saturday night\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042707.7224882
}