{
  "game_id": "0021500114",
  "espn_id": "400828001",
  "date": "Nov 11, 2015",
  "matchup": "LAL @ ORL",
  "headline": "Vucevic hits game winner as Magic beat Lakers 101-99",
  "body": "ORLANDO, Fla. -- Nik Vucevic didn't start for the Orlando Magic on Wednesday night against the Los Angeles Lakers. The 7-foot center certainly finished.\nVucevic, who started all 223 games he has played for Orlando over the past four seasons, came off the bench for the first time and scored 18 points, including a fallaway 18-footer at the buzzer to lift the Magic past the Lakers 101-99.\n\"I didn't decide I could play until just before the game, so I was OK with not starting,\" said Vucevic, who missed the previous three games with a bruised knee. \"I was just glad the coach (Scott Skiles) had confidence in me to take the last shot. That was a difficult matchup.\"\nOrlando had only 1.5 seconds to work with on the final shot and Vucevic was being guarded by the Lakers' 7-2 shot-blocker Roy Hibbert. He caught the inbounds pass, took one dribble, leaned back and lofted a high-arcing shot just over Hibbert's outstretched hand. It swished as the horn sounded.\n\n\"That one might have been more luck than skill,\" Vucevic admitted. \"If I just turned around and shot it, (Hibbert) probably would have blocked it, but I threw it up as high as I could and it went in.\"\nShabazz Napier led Orlando with 22 points, including five 3-pointers, and Evan Fournier added 16. The Magic got 65 points from their bench, including Vucevic's 18.\nMagic guard Victor Oladipo, the team's second-leading scorer, left the game in the first quarter with a concussion and didn't return.\nLakers' star Kobe Bryant didn't start either, missing his second straight game with a back injury. The Lakers spread the scoring nearly evenly, with six players getting into double figures, led by Hibbert with 15 and rookie D'Angelo Russell with 14.\nLou Williams, who scored 13 points, tried to step into Kobe's familiar role as the game decider in the final seconds. However, Williams air-balled his game-winning attempt and the shot clock sounded, giving the Magic the final 1.5 seconds with the ball.\n\"Obviously we didn't make the shot and they came down and made it so you've got to give the big fella (Vucevic) credit,\" Lakers coach Byron Scott said. \"We had some defensive breakdowns. We could easily have won three of the four games on this road trip, but the way we played defensively, we could easily be 0-4. Teams are killing us on the offensive glass. Our guys have just got to do a much better job of finishing plays.\"\nNeither team could break away in the fourth quarter until the Magic scored seven straight points to take a 99-94 lead with 2:17 left, the largest lead of the second half for either team.\nThe Lakers scored five straight with Williams hitting three free throws and Julius Randle adding a driving layup to tie the game at 99 with 1:18 to play.\nTIP-INS:\nLakers: Scott said he had a \"pretty good feeling\" that Bryant will play Friday against Dallas. . Bryant has missed the last three Lakers games in Orlando.\nMagic: PG C.J. Watson (calf strain) sat out the game. . The Magic improved to 2-4 in games decided by five points or less this season. . Orlando's bench outscored the Lakers' reserves 65-45. . Magic G Elfrid Payton was 1 for 13 from the field and scored two points.\nKOBE ADMIRER: Skiles was gushing in discussing Bryant's impact on the game. \"The thing I admire most is his seriousness,\" Skiles said. \"He and (Kevin) Garnett are near the end of their careers and they just reek of basketball being important to them. Not that it isn't to some players today, but those guys are great examples of not being silly when they come to the gym. They're here to work.\"\nUP NEXT:\nLakers: Wrap up a five-game road trip at Dallas on Friday.\nMagic: Host Utah on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994321.3743649
}