{
  "game_id": "0021600156",
  "espn_id": "400899606",
  "date": "Nov 15, 2016",
  "matchup": "CHI @ POR",
  "headline": "Butler has 27 and the Bulls beat the Blazers 113-88",
  "body": "PORTLAND, Ore. --  A pregame chat with teammate Dwyane Wade inspired Jimmy Butler against the Blazers.\n\nButler went on to have 27 points and 12 rebounds, and the Chicago Bulls opened a six-game road trip with a 113-88 victory over Portland on Tuesday night.\n\nWade had 19 points for Chicago, which extended its modest winning streak to three games. Former Blazers center Robin Lopez added 13 points and 11 rebounds.\n\n\"I was talking to D-Wade before the game and he tells me to go out with a killer instinct, make them adjust to you -- go out with a full head of steam and show them why you are one of the best players in the league,\" Butler said. \"That's what I try to do. Having D-Wade tell me that makes me think there is some truth to it.\"\n\nThe Blazers, who had won five of six, were cold from the start, falling behind by as many as 26 points. Damian Lillard, who made just two shots from the field in the first half, finished with 19 points.\n\nChicago, coming off a 106-95 victory over Washington on Saturday, was without Rajon Rondo because of a left ankle sprain. Jerian Grant made his first start of the season and had 18 points.\n\nThe Blazers played their third straight game without starting forward Al-Farouq Aminu, who has a sore left calf and is expected to be re-evaluated next week. Meyers Leonard has been inserted into the lineup in his absence, but he struggled and played 15 minutes with no points.\n\nThe Bulls built a 20-7 lead to open the game as Portland struggled, hitting just two of 13 shots. The Blazers were outscored 35-14 in the first quarter.\n\nButler led the way with 11 points. Lillard, who was ranked third in the league with an average of 30.7 points a game, went 0 for 7 from the floor and didn't make his first basket until midway through the second quarter.\n\n\"Once we got in that hole we couldn't dig out,\" Lillard said.\n\nButler finished the half with 19 points and the Bulls led 56-37. Wade had a two-handed dunk to extend Chicago's lead to 66-42.\n\n\"We believe in ourselves, we are buying into the system, everyone is working on their game,\" Butler said. \"We are actually paying attention to the scouting reports and doing what we're supposed to do to win.\"\n\nBlazers coach Terry Stotts was asked if it was just one of those nights for Portland.\n\n\"I don't know, I think it's difficult to evaluate. You ask about effort? When you shoot 20 percent (in the first quarter) I don't think that's effort,\" Stotts said. \"So that's why it's a little difficult to evaluate when you're struggling on the offensive end.\"\n\nTIP-INS\n\nBulls: The Bulls lead the league with an average of 13.6 offensive rebounds per game. They had 19 against Portland. ... Doug McDermott was also out because of a concussion. ... Lopez and LaMarcus Aldridge, Nicolas Batum and Wesley Matthews all left the Blazers prior to last season, leaving Lillard as the lone starter to return.\n\nTrail Blazers: The Trail Blazers hosted the team's first Pride Night to celebrate diversity and inclusion. Proceeds from special sweatshirts and a raffle will go to the Q Center, a local LGBTQ community center. ... At the half, the Blazers also honored athletes who participated in this summer's Rio Olympics with Oregon ties, including hurdler Devon Allen and marathoner Galen Rupp.\n\nJERIAN'S START: Grant made his first start a memorable one. In addition to his 18 points he also had five steals.\n\n\"Jerian stepped in big tonight, guarding one of the best point guards in the league,\" Wade said. \"He just found out right before the game that he was starting and he played big for us tonight.\"\n\nBULLS IN PORTLAND: Chicago has won two consecutive games in the Rose City for the first time since 1995-98, when it won three straight.\n\nUP NEXT:\n\nBulls: Chicago visits the Utah Jazz on Thursday night.\n\nTrail Blazers: Portland embarks on a five-game road trip, starting with the Houston Rockets on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764995101.6531541
}