{
  "game_id": "0022400705",
  "espn_id": "401705271",
  "date": "Feb 03, 2025",
  "matchup": "MIL @ OKC",
  "headline": "Gilgeous-Alexander scores 34 as Thunder roll past short-handed Bucks 125-96",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 34 points in 22 minutes, and the Oklahoma City Thunder routed the short-handed Milwaukee Bucks 125-96 on Monday night.\n\n\r\n              Milwaukee was without injured stars Giannis Antetokounmpo, Damian Lillard, Brook Lopez and Khris Middleton, turning what could have been an exciting rematch of the NBA Cup final that Milwaukee won into a blowout. \n\n\r\n              Gilgeous-Alexander, the NBA's leading scorer, showed no mercy. He scored 21 points on 9-for-11 shooting in the first quarter as the Thunder took a 39-22 lead. He scored 30 in the first half as the Thunder took a 78-44 lead. He left the game for good with 6:17 remaining and the Thunder ahead 96-54.\n\n\r\n              Ousmane Dieng finished with 21 points and seven rebounds and Isaiah Joe added 18 points for the Thunder, who improved to 39-9 despite all-star Jalen Williams sitting out with a sprained right wrist.\n\n\r\n              Antetokounmpo, a two-time MVP with nine straight All-Star Game selections, is dealing with right patella tendinopathy. Lillard has a sore left groin. Lopez has back soreness. Middleton’s workload is limited as he comes back from offseason surgery to each of his ankles.\n\n\r\n              It was too much for the Bucks to overcome in their fourth straight loss. The Bucks had scored at least 100 points in every regular-season game since scoring 99 points against Toronto on Nov. 12.\n\n\r\n              Ryan Rollins led the Bucks with 16 points.\n\n\r\n              Takeaways\r\n              Bucks: It was about what could be expected from a team that rested all its stars playing against the team with the second-best record in the league.\n\n\r\n              Thunder: Oklahoma City didn't let down. The Thunder hounded the Bucks reserves like they were regular starters, forcing the Bucks into 37.6% shooting.\n\n\r\n              Key moment\r\n              Oklahoma City's Jaylin Williams hit a 3-pointer as time expired in the first half.\n\n\r\n              Key stat\r\n              Oklahoma City shot 64.4% through the first three quarters.\n\n\r\n              Up next\r\n              The Bucks visit Charlotte and the Thunder host Phoenix on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998118.693332
}