{
  "game_id": "0021801027",
  "espn_id": "401071700",
  "date": "Mar 15, 2019",
  "matchup": "PHI vs. SAC",
  "headline": "Embiid has 21 points, 17 rebounds, leads 76ers past Kings",
  "body": "PHILADELPHIA --  A little rest and a taste of spring did a lot for Jimmy Butler.\n\nButler had 22 points, six rebounds and seven assists while playing with the type of assertiveness coach Brett Brown says the 76ers need from him in Philadelphia's 123-114 victory over the Sacramento Kings on Friday night.\n\nJoel Embiid added 21 points and 17 rebounds and made some big plays on both ends of the court late in the fourth quarter for the 76ers, who won their third in a row to pull even with idle Indiana for the No. 3 seed in the Eastern Conference. Philadelphia holds the tiebreaker with the Pacers and is trying to maintain hold of home court in a first-round playoff series, something Brown said he coveted before the contest. Fifth-seeded Boston is two games behind the 76ers and Pacers.\n\nIn order to secure home court and go deep in the playoffs, Brown knows he'll need Butler to play the way he did against the Kings.\n\n\"He was our bell ringer,\" Brown said. \"We will not be as good as we can be without him playing the way he played tonight.\"\n\nButler rested in Philadelphia's last game, a 106-99 victory over Cleveland on Tuesday. And he felt even more refreshed by Friday's weather in Philly, which reached 75 degrees.\n\n\"That's all it takes,\" Butler said. \"Rest and good weather. It makes my knees not ache.\"\n\nAnd it's only going to warm up as the postseason draws near, a great sign for 76ers fans.\n\n\"The snow is gone,\" Butler said. \"We're good. We're ready to rock.\"\n\nTobias Harris and JJ Redick each added 19 points and Ben Simmons contributed 18 for the 76ers.\n\nHarrison Barnes and De'Aaron Fox had 16 points apiece for Sacramento, which lost its third in a row and seventh in the last nine to further hurt its playoff push. The Kings, who last made the postseason in 2006, entered ninth in the West, five games behind the Clippers.\n\n\"We're playing hard, we're playing the right way, we're playing together,\" Kings coach Dave Joerger said. \"The wins are going to come.\"\n\nAnd how?\n\n\"Don't play Golden State, Oklahoma City, Denver, Philly, Boston . I can go on,\" Joerger joked.\n\nWith Philadelphia clinging to a four-point lead with 3 minutes remaining, Embiid blocked Willie Cauley-Stein's layup attempt. Two possessions later, Embiid rejected Barnes' close-range try before hitting a short jumper of his own to make it 121-114 with 1:45 remaining.\n\n\"At the end of the day, I think Joel Embiid made two defensive plays that were terrific,\" Joerger said.\n\nThe Kings were playing one night after a 126-120 loss at Boston, a game in which they had a 17-point first-half lead.\n\nAgainst Philadelphia, Sacramento played from behind from the outset. Philadelphia increased its 62-58 halftime advantage to as many as 13 in the third quarter on Redick's 3 that made it 93-80 with 2:13 left in the period.\n\nThe 76ers had a 10-point advantage to start the fourth, but Yogi Ferrell's 3 capped a 9-2 Kings run to start the period that pulled Sacramento within 101-98 with 9:25 to play. But Simmons scored consecutive buckets from close range to increase the lead to seven and Sacramento never would get closer than three the rest of the way.\n\nBIG TEST\n\nBrown is looking forward to Sunday's showdown at East-leading Milwaukee.\n\n\"I can't wait,\" he said. \"It's a reality check. It's an opportunity to see where we're at.\"\n\nBREWER BACK\n\nKings F Corey Brewer received a nice ovation upon his first-half entrance. Brewer memorably helped the 76ers defeat Houston 121-93 on Jan. 21 with some in-your-face defense on Rockets star James Harden before being signed by Sacramento.\n\n\"It was great,\" he said of the reception. \"I had a great time when I was here. The fans are amazing, it's a great city, and great organization.\"\n\nBrewer finished with eight points.\n\nTIP-INS\n\nKings: The Kings dropped to 13-21 on the road and 3-8 on the second contest of a back-to-back. . Marvin Bagley III had 15 points in his second game back after missing five due to a knee injury. . The Kings ended a four-game eastern road trip 1-3.\n\n76ers: Newly signed Eagles WR DeSean Jackson rang the ceremonial Liberty Bell in the pregame and sat courtside. . Philadelphia ended a three-game losing streak to the Kings, who beat the 76ers 115-108 in Sacramento on Feb. 2 after sweeping both games last season. . Philadelphia improved to 28-9 at home.\n\nUP NEXT\n\nKings: Host Chicago on Sunday.\n\n76ers: At Milwaukee on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764993999.442206
}