{
  "game_id": "0022000434",
  "espn_id": "401307802",
  "date": "May 06, 2021",
  "matchup": "CHA vs. CHI",
  "headline": "Bulls complete sweep of Hornets in LaVine's return, 120-99",
  "body": "CHARLOTTE, N.C. -- — For one night, the Chicago Bulls looked like a playoff-worthy team.\n\n\r\n                    The return of Zach LaVine to the floor certainly had something to do with the Bulls' inspired effort, which ended a four-game skid.\n\n\r\n                    Nikola Vucevic had 29 points and 14 rebounds, LaVine had 13 points after missing 11 games due to the league’s health and safety protocols, and the Bulls swept the season series from the Charlotte Hornets with a 120-99 win on Thursday night.\n\n\r\n                    “It definitely opened up some things for us,” Bulls coach Billy Donovan said of LaVine's return.\n\n\r\n                    Said Vucevic: “We're happy to have him back. We played a great game and that helped motivating us and getting us ready to play knowing he was back. So hopefully we will continue to play that way.\"\n\n\r\n                    Chicago is a long shot to make the postseason, still 3 1/2 games behind Washington for the final spot in the Eastern Conference play-in tournament. The Bulls have six games remaining; the Wizards have five.\n\n\r\n                    LaVine said he felt “really tired” after the long layoff and wanted to make sure he didn't try to do too much.\n\n\r\n                    “I told (my teammates), don’t expect me to try to go get 40 (points) the first night,” LaVine said.\n\n\r\n                    LaVine averaged more than 30 points in his five previous games before being sidelined, but mostly deferred to his teammates in the first three quarters, attempting six shots. But he began to show his scoring ability with back-to-back jump shots to start the fourth quarter before Donovan took him out after 27 minutes of action.\n\n\r\n                    “I thought there was a lot more opportunities for him to shoot the ball, and to try to go score and attack,” Donovan said. “But with him being out three weeks and the respect he has for his teammates, and I think he just tried to fit in and take the shots that were there and not try to force things.”\n\n\r\n                    P.J. Washington, who missed Charlotte’s last game for the birth of his child, had 24 points on six 3-pointers. Malik Monk added 20 points off the bench for the Hornets, who played without Gordon Hayward, Miles Bridges and Devonte Graham.\n\n\r\n                    Charlotte could have clinched a spot in the play-in tournament had it won.\n\n\r\n                    But Vucevic would have none of it. He returned after missing two games with right adductor tightness and dominated. Looking fresh, he made 12 of 24 shots from the field and was 5 of 7 from 3-point range, helping opening things up for his teammates.\n\n\r\n                    “I think they just played harder than us every time we played them,\" Washington said. “For us, it’s just about defense at the end of the day. We have to stop teams from getting offensive rebounds and easy second-chance points.\"\n\n\r\n                    The Bulls, who beat the Hornets by 13 and 17 points in the two previous meetings, jumped out to a 48-33 lead this time.\n\n\r\n                    It appeared Charlotte might make a game of it after hitting 8 of 13 3-point attempts in the second quarter to cut the lead to five, but the Bulls extended their lead to 22 entering the fourth quarter. \n\n\r\n                    “We’ve struggled with Chicago all year,” Hornets coach James Borrego said. \"Give them credit. For whatever reason, the matchup does not fit our group.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Had 19 second-chance points. ... Never trailed in the game. ... Former North Carolina coach Roy Williams was in attendance watching one of his former players, Coby White. \n\n\r\n                    Hornets: Caleb Martin had the play of the night when he drove the baseline and skied over Vucevic for a one-handed dunk. ... Shot 38.9% (7 of 18) from the free-throw line.\n\n\r\n                    NOT ON THE BALL\n\n\r\n                    It was a miserable night for Hornets rookie LaMelo Ball, who was 1 of 10 from the field and finished with four points.\n\n\r\n                    STARTING LINEUP\n\n\r\n                    For the first time this season the Bulls started a lineup that included Vucevic, LaVine, White, Daniel Theis and Patrick Williams.\n\n\r\n                    “We're a lot bigger,” LaVine said. “We can switch a lot of different things and playing those two guys in the frontcourt it just gives us some options — some high-low stuff and some double screens for the guards. And our rebounding was a lot better.”\n\n\r\n                    Borrego said that lineup is a tough matchup.\n\n\r\n                    “I mean they’ve got a 7-footer at their three-spot,\" Borrego said. \n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Host Boston on Friday night. “We have to win every game,” LaVine said. “We have to fight for our lives every game.”\n\n\r\n                    Hornets: Host New Orleans on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997006.234827
}