{
  "game_id": "0022000395",
  "espn_id": "401267555",
  "date": "Feb 12, 2021",
  "matchup": "CHA vs. MIN",
  "headline": "Rozier scores 41 points, Hornets beat Timberwolves 120-114",
  "body": "CHARLOTTE, N.C. -- — Terry Rozier scored 41 points and rookie LaMelo Ball had 20 points and 11 rebounds to help the Charlotte Hornets beat the Minnesota Timberwolves 120-114 on Friday night.\n\n\r\n                    Charlotte improved to 13-14, opening a five-game homestand with its third victory in four games. Minnesota has lost four straight to fall to 6-20.\n\n\r\n                    “Terry deserves a ton of credit for this victory and he was great down the stretch,” Hornets coach James Borrego said. “But overall, he kept us going. When we were dry, he kept us going, he was talking in huddles. So even off the floor, he’s showing his leadership and his will to win games.”\n\n\r\n                    Cody Zeller added 17 points for Charlotte on 7-of-8 shooting, Gordon Hayward had 14 points on 5-of-21 shooting, and Miles Bridges had 11 points and 10 rebounds. Hayward hit a 3-pointer to put Charlotte ahead 106-100 with 4:27 left.\n\n\r\n                    Malik Beasley scored 31 points — 16 in the first period — for Minnesota. Karl Anthony-Towns added 25 in his second game back after missing 13 because of the coronavirus.\n\n\r\n                    Anthony Edwards had 21 points for Minnesota in the first matchup between the first and third overall picks in the 2020 NBA draft. Edwards went first, and Ball third.\n\n\r\n                    “I thought (Edwards and Anthony-Towns) found a little bit of synergy in terms of that high-angle screen where they’re worried about Karl on the pop and Anthony getting all the way to the rim,” Timberwolves coach Ryan Saunders said of his two stars playing together for the first time in several games. \n\n\r\n                    “It made it a little more open for him, so I thought they did find a little bit of chemistry there, which is something that we need to continue to focus on because games come quick.”\n\n\r\n                    Borrego won a challenge on a second-quarter foul called on center Bismack Biyombo. At 5:50 left in the half, Biyombo challenged and appeared to block Edwards’ layup. After the foul call, Biyombo argued the call and was assessed a technical foul.\n\n\r\n                    “We just found a way that’s the bottom line,” Borrego said. “We had every excuse in the world not to win this game, but our guys stuck with it and figured out a way to get it done.”\n\n\r\n                    McDANIELS BACK\n\n\r\n                    Forward Jalen McDaniels rejoined the team from his G-League assignment with Greensboro. Borrego said he hoped to have him for the home game on Sunday against San Antonio. McDaniels missed an opportunity to play against his brother, Timberwolves forward Jaden McDaniels, on Friday.\n\n\r\n                    HE'S GOOD\n\n\r\n                    Timberwolves coach Ryan Saunders has noticed the smooth transition forward Gordon Hayward has made in his first season in Charlotte. And he isn’t surprised by it.\n\n\r\n                    “It’s been a seamless fit,” Saunders said before the game. “They’ve done a nice job with the guys around him delivering him the ball as well. They’ve been able to get him in spots where he’s been able to be successful and he’s been doing it for a long time.”\n\n\r\n                    Hayward averaged a team-high 22.6 points per game coming into the matchup with Minnesota.\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Beasley showed up at Spectrum Center wearing a Minnesota Twins baseball jersey. Twins pitchers and catchers will report to spring training next Thursday.\n\n\r\n                    Hornets: Charlotte tipped off without three players because of health and safety protocols: forwards Caleb Martin, Cody Martin, and P.J. Washington.\n\n\r\n                    UP NEXT:\n\n\r\n                    Timberwolves: Vs. Toronto on Sunday in Tampa, Florida.\n\n\r\n                    Hornets: Host San Antonio on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764997028.076011
}