{
  "game_id": "0021500988",
  "espn_id": "400828875",
  "date": "Mar 14, 2016",
  "matchup": "CHA vs. DAL",
  "headline": "Parsons, Mavs end Hornets' 7-game win streak, 107-96",
  "body": "CHARLOTTE, N.C. --  The Dallas Mavericks went small Monday night and came up big.\n\nUsing a smaller starting lineup that included Raymond Felton instead of Zaza Pachulia, the Mavericks were able to slow down the red-hot Charlotte Hornets and come away a 107-96 victory.\n\nChandler Parsons had 24 points and nine rebounds for the Mavericks, who snapped Charlotte's season-high seven-game winning streak and ended their own five-game skid.\n\nDirk Nowitzki added 23 points and 11 rebounds for the Mavericks, who moved back above .500. Deron Williams chipped in with 15 points.\n\nParsons called it a \"huge win.\"\n\nMavericks coach Rick Carlisle said he changed the lineup because he wanted to shake things up. Playing the smaller, but quicker 6-foot-1 Felton over the 6-11 Pachulia seemed to do the trick.\n\n\"The defense was great,\" Carlisle said. \"We just had really good energy, focus, togetherness. We were playing relatively small, so we needed everybody to be very vigilant about being on the boards. That's our best chance to win and we did that tonight.\"\n\nThe Hornets came in averaging more than 36 points in the first quarter of their last three games. They only scored 33 in the first half against the Mavs, falling behind by 19 at intermission.\n\nCharlotte shot 27 percent from the field in the first half and 43 percent from the foul line.\n\nDallas wasn't exactly lighting it up either.\n\nThe Mavericks were just 3 of 20 from 3-point range in the first three quarters, but hit 6 of 10 in the fourth quarter.\n\nCharlotte didn't go down without a fight.\n\nThe Hornets battled back to take the lead when Kemba Walker knocked down back-to-back 3-pointers on Charlotte's first two possessions of the fourth quarter to tie it and added two free throws to put the Hornets up 73-71.\n\nBut Nowitzki turned the momentum, hitting a 3-pointer from the top of the key to give the Mavericks the lead for good and ignite an 18-6 run. The Mavs shot 65 percent from the field in the fourth quarter.\n\nThe Hornets seemed to expend their energy battling back from the halftime deficit and never really challenged again after falling behind by double digits later in the fourth quarter.\n\nThe Hornets didn't help themselves, making just 22 of 34 foul shots and committing 15 turnovers which led to 18 points.\n\n\"It comes down to basic things: too many turnovers, too many missed free throws,\" Clifford said. \"We did some good things to get back in the game after we put ourselves in the hole, but 16 turnovers which turned into 18 points and missing 12 free throws makes it tough to win.\"\n\nWalker finished had 25 points and nine assists, Nicolas Batum scored 20 points and Marvin Williams added 19 for the Hornets.\n\nTIP-INS\n\nMavericks: Dallas' bench outscored Charlotte's 31-19.\n\nHornets: Walker was named Eastern Conference Player of the Week for the second time this season Monday.\n\nHIGH TECHS\n\nIt was a tough night all around for Charlotte.\n\nClifford, Batum and Walker were all assessed technical fouls in the first half for disputing calls. The crowd repeatedly expressed its displeasure with the officiating, booing loudly as the trio walked out off the court at halftime and again when they returned to the floor for the second half.\n\nClifford said after the game he could have handled things better.\n\nCarlisle said: \"It's really the hardest game in all of sports to ref because of the flow and the pace and the size of the athletes and the speed. We said at halftime that there were going to be some calls that we were going to disagree with. But the important thing was to stay about the fray and concentrate on us and concentrate on the next play. Our guys did a good job of that in the second half.\"\n\nABOVE .500\n\nThe Mavs improved to 34-33, but still have work to do to make the playoffs.\n\n\"We're playing for our playoff life,\" Parsons said. \"We'll keep working and try to build from this.\"\n\nUP NEXT\n\nMavericks: Visit Cleveland on Wednesday night.\n\nHornets: Host Orlando on Wednesday night",
  "source": "espn_api",
  "crawled_at": 1764994352.832406
}