{
  "game_id": "0022000180",
  "espn_id": "401267340",
  "date": "Jan 15, 2021",
  "matchup": "ORL @ BOS",
  "headline": "Celtics run past Magic 124-97 after week-long hiatus",
  "body": "BOSTON -- — Jaylen Brown had 21 points and eight assists, Semi Ojeleye added 18 points and the Boston Celtics rolled to an 124-97 win over the Orlando Magic on Friday night in their return to action following a virus-related week-long hiatus. \n\n\r\n                    Jeff Teague finished with 17 points and rookie Payton Pritchard had 16 points to help Boston post its fifth straight victory. \n\n\r\n                    Boston returned to action after having three games postponed due to some players testing positive for the coronavirus and others being ruled out because contact tracing showed that they could have been exposed to it.\n\n\r\n                    “It’s hectic, A whirlwind tornado you might call it,\" Celtics guard Marcus Smart said. \n\n\r\n                    But the Celtics didn’t seem to be affected by the layoff, sharing the ball and turning stops into opportunities to run the floor against an Orlando team that struggled to find a rhythm at both ends. \n\n\r\n                    “It felt good. Obviously this COVID and this pandemic has affected not just us but every team in this league. Everyone is doing the best they can to cope with it and handle it,\" Smart said. \"The way that we played, with the pace and everything, that was the key for us.\"\n\n\r\n                    Aaron Gordon had 17 points to lead the Magic, who have lost four straight. Nik Vucevic, Dwayne Bacon and Cole Anthony added 15 points apiece. Orlando had 13 turnovers that led to 16 Celtics' points. \n\n\r\n                    “The guys that are out right now, we’re very much challenged offensively,\" Magic coach Steve Clifford said. \"We can’t give possessions away.” \n\n\r\n                    The Celtics took an 88-72 advantage into the fourth quarter and opened the period with a 13-0 run to effectively put the game away. \n\n\r\n                    Jayson Tatum and Robert Williams remained in the NBA’s health and safety protocols Friday along with reserve guard Carsen Edwards. But the Celtics had 12 players available thanks to Brown, Ojeleye, Tristan Thompson, Javonte Green and Daniel Theis all being cleared to return. \n\n\r\n                    Magic center Mo Bamba didn’t travel with the team as a precaution while he goes through contact tracing, the latest roster hit to a team that has battled injuries throughout the season. \n\n\r\n                    Celtics coach Brad Stevens went deep into his bench to spread out minutes following the layoff. For the game, Boston held a 66-33 edge in bench scoring. \n\n\r\n                    “I thought, obviously, in one way our first wind would hit us pretty hard. But I also thought there’s the fresh advantage,\" he said. \"We were able to do that without anyone playing 28 minutes, which was good.” \n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Were 3 for 12 from 3-point range in first half and finished 7 for 28 for the game. … Finished with 16 turnovers. \n\n\r\n                    Celtics: Went 17 of 42 from 3-point distance. … Led by as many as 14 in the first half and took a 60-48 lead into halftime. … Had no turnovers in the first quarter.\n\n\r\n                    NEW PROTOCOLS\n\n\r\n                    The NBA’s tightened safety protocols  were on display Friday with players being handed a mask along with the customary water and towel whenever they were subbed out.\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Continue five-game road trip with visit to Brooklyn on Saturday. \n\n\r\n                    Celtics: Host the Knicks on Sunday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997803.450989
}