{
  "game_id": "0022300309",
  "espn_id": "401584937",
  "date": "Dec 12, 2023",
  "matchup": "LAC vs. SAC",
  "headline": "Leonard's scoring binge continues with 31, Clippers rout Kings 119-99 for fifth straight win",
  "body": "LOS ANGELES -- — Kawhi Leonard sat in the second half of back-to-backs last season. Now he's healthy and highly productive.\n\n\r\n              Leonard scored 31 points in three quarters, giving him 106 in his last three games, and the Los Angeles Clippers routed the Sacramento Kings 119-99 on Tuesday night for their fifth straight victory, the NBA's longest active streak.\n\n\r\n              “Just being healthy has been good,” said Leonard, who tore his ACL during the 2021 playoffs. \n\n\r\n              Paul George dived on the floor for a loose ball in the first half and didn’t play in the second because of a sore left groin. Coach Tyronn Lue said George could have returned if needed.\n\n\r\n              “I didn't like that,” Lue said, noting George's multiple shoulder surgeries. “It just shows you these guys want to win.”\n\n\r\n              Adding James Harden has given the Clippers another playmaking weapon.\n\n\r\n              Harden had 15 points, seven assists and six rebounds to help the Clippers sweep a back-to-back for the first time this season. They have won 10 of their last 13 games.\n\n\r\n              “We're locked in defensively,” Lue said. “That's where it all starts for us. When we're getting stops and getting out in transition we're a hard team to beat.”\n\n\r\n              Keegan Murray led Sacramento with 17 points and Domantas Sabonis added 15 points and 10 rebounds. De'Aaron Fox had 14 points as Sacramento's two-game winning streak was snapped. \n\n\r\n              The Kings had won five of seven, including a win against Brooklyn on Monday night, but were overwhelmed by the Clippers from the second quarter on.\n\n\r\n              “We got our behinds kicked and that’s twice by this team and we had no answers,” Kings coach Mike Brown said. “The thing that’s most concerning is sometimes you just got to fight and tonight we didn’t fight. That’s the biggest takeaway from this game.”\n\n\r\n              The Clippers led 70-48 at halftime, shooting 59% from the floor, hitting eight 3-pointers and making all 10 of their free throws. Ahead by nine, they outscored the Kings 31-11, including 11 in a row — six by Leonard — for a 29-point lead just before the break.\n\n\r\n              “Kawhi's main thing is just let's play the right way every single night,” Lue said, “and when we're not doing that he's very vocal about it.”\n\n\r\n              Leonard scored 14 points in the third, reeling off the Clippers' final seven to send them into the fourth leading 99-70. He worked to find his usual spots on the floor and the few times he couldn't, he passed off to his teammates. Leonard made all seven of his free throw attempts and the Clippers hit 20 of 21.\n\n\r\n              Terance Mann the only LA starter on the floor in the fourth. Norman Powell led the bench with 15 points. \n\n\r\n              UP NEXT\n\n\r\n              Kings: Host the Oklahoma City Thunder on Thursday to open a six-game homestand.\n\n\r\n              Clippers: Host the Golden State Warriors on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996560.969158
}