{
  "game_id": "0021900012",
  "espn_id": "401160654",
  "date": "Oct 23, 2019",
  "matchup": "SAC @ PHX",
  "headline": "Suns start slow, then blow past Kings 124-95",
  "body": "PHOENIX --  Coach Monty Williams wanted Jevon Carter to slow down. The backup point guard didn't pay attention.\n\nTwo unexpected 3-pointers later, the Phoenix Suns had the spark they needed to blow past the Sacramento Kings for a 124-95 win in the season opener for both teams on Wednesday night.\n\n\"Jevon just doesn't listen to me, that's pretty much it,\" Williams said with a grin. \"He just goes nuts, hits shots and defensively he gets all over people. He has selective hearing. I was trying to scream to him to slow down, but he's a pitbull. That's what I love about him.\"\n\nWhile the reserves stepped up, the starters played well, too.\n\nDevin Booker had 22 points and 10 assists, and Kelly Oubre Jr. added 21 points. Veteran guard Ricky Rubio had 11 points, 11 assists, six rebounds and four steals in his first game after signing a three-year deal worth $51 million.\n\nIt was an encouraging night for a franchise that hasn't been to the playoffs since 2010 and finished with a dismal 19-63 record last season.\n\n\"We have a lot of potential, but it's just one game,\" Rubio said. \"We have to show it every night. Tomorrow we come back, go to practice and get better.\"\n\nDeandre Ayton, the No. 1 pick one year ago, added 18 points and 11 rebounds while shooting 9 of 14 from the field.\n\nSacramento was led by Buddy Hield, who scored 22 of his 28 points in the first half. Hield shot 10 of 19 from the field, including 6 of 12 from 3-point range. Marvin Bagley III added 14 points and 10 rebounds.\n\nThe Kings shot just 28 percent from the field and had 18 turnovers in the second half.\n\n\"They had the momentum, they made shots, they made plays, they played harder than us,\" Hield said. \"They deserved to win.\"\n\nWilliams won in his Suns coaching debut. The 48-year-old Williams coached the New Orleans Hornets for five seasons from 2010-15 and got another opportunity with Phoenix during the offseason.\n\nThe Suns trailed by five at halftime but rallied for an 86-76 advantage headed into the fourth. Carter hit back-to-back 3-pointers late in the third to give the Suns some unexpected offense, highlighting an impressive run by the Suns' second unit.\n\nCarter finished with 11 points, including three 3-pointers. Tyler Johnson added 10 points in 17 minutes.\n\n\"We just go out there, play hard and play together,\" Carter said. \"Sometimes it's going to work. Sometimes it's not. But I feel more times than not it's going to work.\"\n\nEMOTIONAL NIGHT\n\nWilliams also won as a head coach for the first time without his wife Ingrid, who died in a car accident in 2016 at 44 years old.\n\n\"First time I've done this without Ingrid and that was just different,\" Williams said. \"A lot of emotions, a lot of good stuff. So thankful my kids were there tonight for the whole game and got to see that. So glad I got to do that with this group.\"\n\nTIP-INS\n\nKings: F Harry Giles III (sore left knee) was held out. ... The game was the Kings debut of coach Luke Walton. The 39-year-old coached the Lakers for three seasons before being fired during the past offseason. ... One of Walton's assistants is Igor Kokoskov, who coached the Suns last season before getting fired after just one year.\n\nSuns: Rookie guards Ty Jerome (right ankle sprain) and Cameron Johnson (left calf soreness) were inactive. ... Booker was called for a technical foul in the third quarter after arguing with a referee. ... The Suns improved to 36-17 all-time in home openers.\n\nUP NEXT\n\nKings: Host Portland on Friday.\n\nSuns: Visit Denver on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995905.235549
}