{
  "game_id": "0022401049",
  "espn_id": "401705615",
  "date": "Mar 25, 2025",
  "matchup": "HOU vs. ATL",
  "headline": "Jalen Green scores 32 points and has 11 rebounds as Rockets beat Hawks 121-114",
  "body": "HOUSTON -- — Jalen Green scored 32 points ahd had 11 rebounds and the Houston Rockets beat the Atlanta Hawks 121-114 on Tuesday night.\n\n\r\n              Fred VanVleet shot 5 of 14 from the field, including 3 for 8 from 3-point range, and went 8 for 8 from the line to add 21 points. Tari Eason had 14 rebounds.\n\n\r\n              Dyson Daniels led the Hawks with 19 points, eight rebounds, 10 assists and four steals. Trae Young added 19 points and 12 assists for Atlanta.\n\n\r\n              The Rockets took the lead with 1:13 remaining in the first quarter and did not give it up. The score was 65-48 by halftime, with Green scoring 14 points.\n\n\r\n              The Rockets led by 20 after three quarters. The Hawks pulled within 98-94 with 7:20 left after a 17-2 run.\n\n\r\n              The Rockets were outscored by the Hawks in the second half by 10 points.\n\n\r\n              Takeaways\r\n              Hawks: Atlanta had won three straight, but the Hawks made just 15 of 49 3-pointers against the Rockets — not what a team trying to avoid the play-in tournament needed.\n\n\r\n              Rockets: Houston strengthened its hold on the No. 2 spot in the West. With the win the 47-26 Rockets are now two games ahead of Denver, which was idle Tuesday night. Houston has won 10 of its last 11 games.\n\n\r\n              Key moment:\r\n              VanVleet mad 4 of 4 free throws in the final 14 seconds after Georges Niang had pulled the Hawks within 117-114 with a 3-pointer with 22 seconds left.\n\n\r\n              Key stat\r\n              Houston made 26 of 29 free throws.\n\n\r\n              Up next\r\n              The Hawks visit the Miami Heat on Thursday night. The Rockets play at the Utah Jazz the same night.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997348.892664
}