{
  "game_id": "0022000254",
  "espn_id": "401267414",
  "date": "Jan 24, 2021",
  "matchup": "MIL vs. ATL",
  "headline": "Antetokounmpo scores 27 points, Bucks beat Hawks, 129-115",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 27 points and 14 rebounds and the Milwaukee Bucks beat the Atlanta Hawks 129-115 on Sunday night to snap a two-game losing streak.\n\n\r\n                    Antetokounmpo had eight assists, finishing two shy of a triple-double.\n\n\r\n                    Bobby Portis added 21 points, and Khris Middleton had 19 for Milwaukee.\n\n\r\n                    De'Andre Hunter led Atlanta with a career-high 33 points. John Collins had 30 points, but the short-handed Hawks saw their three-game winning streak end.\n\n\r\n                    The Hawks were without two key starters, leading scorer Trae Young (back spasms) and center Clint Capela (sore right hand). Rajon Rondo replaced Young in the starting lineup. Rookie center Onyeka Okongwu made his first career start.\n\n\r\n                    Atlanta's lineup changes, announced during pregame warmups, were jolting for both teams.\n\n\r\n                    “We actually did our walkthrough for Atlanta yesterday,” Bucks coach Mike Budenholzer said. “We spent a lot of time on Trae Young. He’s one of the elite young players in the league, but you have to adjust.”\n\n\r\n                    Hunter and Collins attempted to fill the scoring void left by Young's absence. Collins sank six of nine 3-pointers. Hunter made 13 of 21 shots from the field.\n\n\r\n                    “He was just trying to get us going,” Hawks coach Lloyd Pierce said about Hunter. “You see the ball go in and you get the feel a little bit and we needed every bit of it.”\n\n\r\n                    The Hawks missed Capela's defense and rebounds.\n\n\r\n                    The Bucks outscored the Hawks in the paint 60-30 and had a 51-38 advantage in rebounds.\n\n\r\n                    Pierce called a timeout after Milwaukee took a 9-2 lead. The substitution of Solomon Hill for Okongwu didn't help as the Bucks quickly extended the lead to 10 points at 16-6.\n\n\r\n                    Milwaukee's lead was 24 points at 58-36 in the second quarter.\n\n\r\n                    The Hawks narrowed the deficit in the third period. \n\n\r\n                    Okongwu's block of a shot by Bobby Portis set up Hunter's apparent 46-foot 3-pointer as the buzzer sounded to end the third period. Following a lengthy review, officials ruled the shot came after time expired, leaving the Bucks with a 94-83 lead entering the fourth quarter.\n\n\r\n                    “I think in the third our intensity was pretty low,” said Jrue Holiday, who had 15 points. “I feel like if we had come out in the third and just threw a haymaker at them, the game would have been different and we could have been up by 30.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Danilo Gallinari had 17 points. ... Young had a heating pad strapped to his back as he watched from the Hawks bench. ... Okongwu had four points in his starting debut, which came after only three appearances as a reserve. ... Rondo had seven points and six assists. ... Capela was coming off his first career triple-double, including a career-high 10 blocks, Friday night in a victory over Minnesota.\n\n\r\n                    Bucks: Budenholzer wasn’t happy to see the Bucks allow the Hawks to top 30 points in each of the final three periods. “We need to be a lot better defensively,” Budenholzer said.\n\n\r\n                    BACK ON TRACK\n\n\r\n                    Milwaukee rebounded following consecutive losses to the Nets and Lakers.\n\n\r\n                    “It was good to get that feel back, that feel of winning,” Holiday said. “We had a tough couple of games.”\n\n\r\n                    CRAIG RETURNS\n\n\r\n                    Bucks forward Torrey Craig wore a clear facemask in his return after missing nine games with a fractured nose suffered on Dec. 27 at the New York Knicks. He had four points in 13 minutes. \n\n\r\n                    “It was just good for him to get some minutes ... just start to find his way in a game setting,” Budenholzer said. “Certainly he’s somebody that we really value.”\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Host Los Angeles Clippers Tuesday night.\n\n\r\n                    Bucks: Face Toronto on Wednesday night in Tampa, Florida.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997410.430445
}