{
  "game_id": "0021501181",
  "espn_id": "400829068",
  "date": "Apr 08, 2016",
  "matchup": "MIL @ BOS",
  "headline": "Zeller scores 26, Celtics down Bucks 124-109",
  "body": "BOSTON --  Situated firmly in a virtual logjam in the Eastern Conference's shuffle for playoff seeding, where the Boston Celtics will end up is still very much a mystery with only a handful of games to play.\n\nDuplicating the way they played in dispatching an ailing Bucks team would go a long way in making sure their opening round series begins at home.\n\nTyler Zeller tied a career high with 26 points and Boston continued its playoff push with a 124-109 win over Milwaukee on Friday night.\n\nIsaiah Thomas added 20 points, and Avery Bradley and Kelly Olynyk each finished with 16 as Boston claimed its fourth straight victory. It sets up a stretch to close the regular-season against three playoff-bound teams.\n\nZeller said he feels like the team -- and bench, in particular -- is finding a grove at the right time.\n\n\"It's nice to have that second squad back,\" Zeller said. \"The first squad's back at full strength, but the second team we've kind of been kind of here and there with what group we have and who we're playing with, so it's nice to be able to kind of get back to playing with the same people every night.\"\n\nThe way Boston played Friday was reminiscent of its 14-game home winning streak, which was snapped in mid-March.\n\nIt not only shared the ball against the Bucks, but was using its defense to set up easy scoring opportunities in transition.\n\nThe Celtics began Friday in fourth place in the Eastern Conference, and were among four teams separated by less than two games between the third and sixth seeds. Boston faces each of those teams -- Atlanta, Miami and Charlotte -- in its final three regular-season games. First up: the Hawks on Saturday.\n\n\"You never know which team we can play in the playoffs, so as a team we're going to take it serious,\" Thomas said. \"We want to win every game and we've just got to be ready.\"\n\nAfter trailing early, the Celtics took control in the second half, building as much as a 27-point lead.\n\nGiannis Antetokounmpo had 27 points and seven assists, and Miles Plumlee added 16 points for Milwaukee, which has lost three straight.\n\nBoston had 21 assists on its 25 made baskets in the first half to erase an early 11-point deficit. A run just before halftime gave the Celtics a seven-point lead heading into the intermission.\n\nThe flurry overshadowed a 20-point half by Antetokounmpo.\n\nThe Bucks were among the teams the Celtics beat during their long home win streak. Coach Jason Kidd said they look like that team again.\n\n\"They're healthy, they're preparing, they're playing for that third seed,\" Kidd said. \"They put the pressure on us and we turned the ball over. When you do that here, it can be a long night.\"\n\nTIP-INS\n\nBucks: F Khris Middleton missed his third straight game with a left thigh strain.\n\nCeltics: Zeller's effort ended Thomas' streak of 17 consecutive games as the team's outright leading scorer. ... Have won eight of last 10. ... Improved to 41-17 when scoring 100 or more points this season.\n\nPLAYOFF TALK: Asked about Boston's postseason prospects during his weekly radio appearance Celtics president of basketball operations Danny Ainge said he didn't think it was yet a championship contender. What was more important was its mindset, he said. Coach Brad Stevens said that mindset is a focused one. \"I think that whenever you're coaching the Boston Celtics, there's only one goal,\" Stevens said. \"And if you have another goal, and you achieve it and don't get the ultimate goal then you've sold yourself short.\"\n\nOLYMPIC AMBASSADOR: Kidd, who won gold medals with the U.S. Olympic basketball team in 2000 and 2008, is a big proponent of his players chasing the opportunity to compete on that international stage. \"I think that's one of the best times of your career to be able to put on red, white and blue for the United States, to be able to play with the best players in the world,\" Kidd said. \"You should represent your country if you have that opportunity.\"\n\nUP NEXT\n\nMilwaukee: at 76ers on Sunday.\n\nBoston: at Atlanta on Saturday.\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764993997.152621
}