{
  "game_id": "0022000480",
  "espn_id": "401267640",
  "date": "Feb 23, 2021",
  "matchup": "ATL @ CLE",
  "headline": "Cavaliers snap 10-game slide by beating Hawks 112-111",
  "body": "CLEVELAND -- — Trae Young went from snubbed to stunned.\n\n\r\n                    Rookie forward Lamar Stevens drove for an easy dunk with 4.1 seconds left and Atlanta, which had burned its final timeout, failed to get off a final shot as the Cleveland Cavaliers beat the Hawks 112-111 on Tuesday night to end their 10-game losing streak — the NBA's longest this season.\n\n\r\n                    After Young, slighted hours earlier when All-Star reserves were announced, missed a runner with 11 seconds left, the Cavs pushed the ball up trailing by one. Collin Sexton passed it on the left wing to Stevens, signed earlier this season to a two-way contract, and he dunked without any resistance.\n\n\r\n                    The Hawks, who had lost a timeout when they appealed a call with 19 seconds to go, had one last chance. Young hurried up court, but was well covered and passed the ball to the corner to Tony Snell, who didn't get off a final 3-pointer in time and the Cavaliers celebrated on their way to the locker room as if they had just won a playoff series.\n\n\r\n                    “The best part about that game is when you go up and down the stat sheet, literally everybody who played contributed to winning that game,” Cavs coach J.B. Bickerstaff said. “That’s what made it even better and even sweeter, although they all taste sweet at this point.”\n\n\r\n                    The loss was a double blow for Young, who finished with 28 points (on 9-of-27 shooting) and 12 assists. He was already on the floor for pregame warmups when the NBA revealed the All-Star backups for next month’s showcase in Atlanta.\n\n\r\n                    An All-Star last season, Young came in averaging 35.3 points in his past three games, and 26.9 this season — the most of any player not picked.\n\n\r\n                    “It’s kind of confusing how I didn’t make it,” Young said. “But it happens. All I’ve been focusing on this year is my team and how we can improve. I’ve been an All-Star before and it’s all been about how I can improve and have our team win, so to me it’s more confusing.”\n\n\r\n                    Hawks coach Lloyd Pierce felt Young deserved a spot.\n\n\r\n                    “It's unfortunate,” he said. “He's had an All-Star year, without a doubt.”\n\n\r\n                    It was Cleveland's first win since Feb. 1, and for long stretches of the fourth quarter it appeared in doubt.\n\n\r\n                    Sexton, who has his own All-Star case, scored 29 points to lead the Cavs. Darius Garland added 17 and Jarrett Allen had 13 points and 14 rebounds for Cleveland, which also got five 3-pointers from rookie Dylan Windler.\n\n\r\n                    Kevin Huerter scored 22 for the Hawks, and Clint Capela added 17 rebounds.\n\n\r\n                    COLLINS HURT\n\n\r\n                    Hawks starting forward John Collins played only 13 minutes. He left in the first half with a possible concussion.\n\n\r\n                    The loss of Collins depleted Atlanta even more because Cam Reddish sat out with soreness in his Achilles tendon.\n\n\r\n                    FRESH FACE\n\n\r\n                    With several power forwards injured, and center Andre Drummond sitting while the Cavs try to trade him, Bickerstaff started seldom-used Dean Wade, a 24-year-old who played in the G League last year and came in averaging 2.1 points per game.\n\n\r\n                    Wade made one of Cleveland's nine 3-pointers in the first half as the Cavs built a 13-point lead. He finished with five points — the 3-pointer and a follow dunk.\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Pierce returned after missing three games for the birth of his second child last week. ... G Rajon Rondo returned after missing seven games with a lower back issue. He had seven points in 14 minutes. ... Atlanta came in leading the league with 21.9 made free throws per game. The Hawks hit 17.\n\n\r\n                    Cavaliers: F Kevin Love continues to be sidelined with a calf injury that has lingered longer than expected. Love, who has only played in two games this season, appeared to be close to returning last week but experienced some soreness. He's doing on-court activities, but not taking part in practices. ... F Taurean Prince missed his third straight game with a sore ankle. ... G Matthew Dellavedova sat on the bench. He's missed all season with a concussion and had his appendix removed last weekend.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Host the Boston Celtics on Wednesday.\n\n\r\n                    Cavaliers: Host Houston on Wednesday. Bickerstaff was an assistant coach with the Rockets from 2011-15, and their interim head coach in 2015-16.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997832.758153
}