{
  "game_id": "0022400787",
  "espn_id": "401705353",
  "date": "Feb 13, 2025",
  "matchup": "MIN vs. OKC",
  "headline": "Naz Reid's 27 points help lead short-handed Timberwolves past West-leading Thunder 116-101",
  "body": "MINNEAPOLIS -- — Naz Reid had 27 points, 13 rebounds and seven assists for the short-handed Minnesota Timberwolves in a 116-101 victory over Oklahoma City on Thursday night that stopped the Thunder's seven-game winning streak.\n\n\r\n              Anthony Edwards scored 23 points and Jaden McDaniels added 21 points to propel the Wolves (31-25) into the All-Star break with an inspired performance against the West-leading Thunder (44-10) behind a small-ball strategy necessitated by the absence of their usual starting frontcourt. \n\n\r\n              Shai Gilgeous-Alexander had 24 points, nine assists and eight rebounds to lead the Thunder after shooting 2 for 13 in the first half.\n\n\r\n              Takeaways\r\n              Thunder: After beating Miami at home while Chet Holmgren rested on Wednesday, Oklahoma City had to turn around for the trip north for one more game before the break. The second pick in the 2022 draft has had a slow re-entry after a 39-game absence to a broken pelvis. Holmgren had 11 points and 12 rebounds in 30 minutes.\n\n\r\n              Timberwolves: After a two-point loss at home to short-handed Milwaukee a night earlier, Minnesota played without four of its top eight scorers and met the challenge with a burst of young energy. First-round draft pick Terrence Shannon was the first man off the bench and had all 13 of his points in the first half.\n\n\r\n              Key moment\r\n              Edwards made the arena erupt when he drove from the wing for a soaring dunk over Holmgren in the first quarter before glaring and yelling at the 7-foot-1 native of Minneapolis, who ignored the taunt.\n\n\r\n              Key stat\r\n              Gilgeous-Alexander, the NBA ’s leading scorer at 32.6 points per game entering the night, had his streak of 25-point games end at 22. \n\n\r\n              Up next\r\n              Oklahoma City, after a seven-day break, plays at Utah on Feb. 21, when Minnesota visits Houston. Then the Thunder and Timberwolves play on back-to-back days, in Minneapolis on Feb. 23 and in Oklahoma City on Feb. 24. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998280.852782
}