{
  "game_id": "401810210",
  "espn_id": "401810210",
  "date": "Dec 06, 2025",
  "matchup": "MIN vs LAC",
  "headline": "Timberwolves play the Clippers on 4-game win streak",
  "body": "Los Angeles Clippers (6-17, 13th in the Western Conference) vs. Minnesota Timberwolves (14-8, sixth in the Western Conference)\n\n\r\n              Minneapolis; Saturday, 8 p.m. EST\n\n\r\n               Timberwolves -10.5; over/under is 225.5\n\n\r\n              BOTTOM LINE: Minnesota heads into a matchup against Los Angeles as winners of four straight games.\n\n\r\n              The Timberwolves are 9-7 against conference opponents. Minnesota has a 3-6 record against opponents over .500.\n\n\r\n              The Clippers are 4-10 in Western Conference play. Los Angeles has a 3-11 record against teams above .500.\n\n\r\n              The Timberwolves' 14.6 made 3-pointers per game this season are only 0.2 fewer made shots on average than the 14.8 per game the Clippers allow. The Clippers average 12.7 made 3-pointers per game this season, 0.6 more makes per game than the Timberwolves give up.\n\n\r\n              TOP PERFORMERS: Julius Randle is averaging 22.9 points, 7.5 rebounds and 5.9 assists for the Timberwolves. Naz Reid is averaging 19 points, seven rebounds, six assists and two blocks over the past 10 games.\n\n\r\n              Ivica Zubac is averaging 16 points and 11.6 rebounds for the Clippers. Kawhi Leonard is averaging 24.0 points and 8.0 rebounds while shooting 43.5% over the last 10 games.\n\n\r\n              LAST 10 GAMES: Timberwolves: 6-4, averaging 120.0 points, 44.8 rebounds, 26.7 assists, 8.6 steals and 4.7 blocks per game while shooting 46.6% from the field. Their opponents have averaged 115.7 points per game.\n\n\r\n              Clippers: 2-8, averaging 111.6 points, 42.0 rebounds, 23.3 assists, 8.3 steals and 3.2 blocks per game while shooting 45.6% from the field. Their opponents have averaged 117.5 points.\n\n\r\n              INJURIES: Timberwolves: None listed.\n\n\r\n              Clippers: Bradley Beal: out for season (hip), Jordan Miller: day to day (hamstring), Derrick Jones Jr.: out (knee), Bogdan Bogdanovic: day to day (hip).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042768.310612
}