{
  "game_id": "0021801206",
  "espn_id": "401071879",
  "date": "Apr 07, 2019",
  "matchup": "POR vs. DEN",
  "headline": "Lillard scores 30 points, Trail Blazers beat Nuggets 115-108",
  "body": "PORTLAND, Ore. --  CJ McCollum's return and a victory by the Lakers boosted the Trail Blazers on a night they also beat the Nuggets.\n\nDamian Lillard scored 30 points to lead Portland to a 115-108 win Sunday over a Denver team that rested its top three scorers.\n\nThe Blazers got some help in their pursuit of home-court advantage by the Lakers, who beat the Jazz 113-109. As a result, the gap between fourth-place Portland and fifth-place Utah widened to two games with two remaining for both teams. And Portland got McCollum back after he missed 10 games with a left knee injury.\n\n\"To get him back and the way we played when he was out, a lot of guys had to step up and do a little bit more,\" Lillard said about McCollum. \"I think the fact that it went well, it gave a lot of guys more confidence. It gave us other guys we can turn to when we do get to the postseason.\"\n\nAl-Farouq Aminu added 23 points and 11 rebounds for Portland, which snapped a six-game losing streak to the Nuggets.\n\nGary Harris had 18 points for Denver, which played without Nikola Jokic, Paul Millsap and Jamal Murray.\n\nAfter trailing by 14 in the first half, Denver closed the gap in the second half and pulled to 92-91 on Torrey Craig's 3-pointer before taking the lead on free throws.\n\nThe teams traded the lead, but Juancho Hernangomez hit a 3-pointer that put the Nuggets in front 104-98 with 5:14 left.\n\nLillard's 3-pointer put the Blazers ahead 107-106 and Enes Kanter extended the lead with a layup with 2:18 left. Aminu added free throws and a reverse layup that made it 114-106 and sealed the win. Portland closed the game on a 17-3 run.\n\n\"It wasn't pretty, but I liked the way we finished,\" Blazers coach Terry Stotts said. \"We made a lot of energy plays in the last two to three minutes to pull away.\"\n\nStotts said before the game that McCollum's minutes would restricted, but he played 25 strong minutes and had nine points.\n\n\"I felt like I was moving pretty well, I felt my conditioning was in pretty good shape,\" McCollum said. \"I was just trying to play the game.\"\n\nThe Nuggets defeated the Blazers just two days before. Jokic had 22 points, 13 rebounds and nine assists, and Denver clinched the Northwest Division title with a 119-110 victory Friday night. It was the team's first division title in six years.\n\nThe Nuggets were assured of at least the No. 3 seed in the Western Conference and can clinch the second seed with two more wins. They haven't been the No. 2 seed since the 2008-09 season.\n\nBut with home-court clinched, the Nuggets sat Jokic, Millsap and Murray against the Blazers.\n\n\"We just want to make sure we're healthy, rested and playing as well as we can going in,\" coach Michael Malone said.\n\nPortland started the day just a game up on Utah for the fourth seed. The Houston Rockets held on to the No. 3 seed with a 149-113 win over the Suns, and were a game and a half up on Portland.\n\nThe Nuggets led by eight points in the opening minutes, but Portland caught up and took a 29-25 lead going into the second quarter. Portland stretched the lead to 14 before heading to the break with a 60-49 lead.\n\nPortland reserve guard Seth Curry, who sat out Friday's game with leg soreness, came off the bench to lead all scorers with 11 points at the break.\n\nThe Nuggets closed the gap in the third quarter, outscoring Portland 12-2 to get within 73-72 on Lyles' basket.  Denver was unable to pull in front.\n\n\"The biggest thing with this game was that we didn't rebound. That's the story of the game. They had 17 offensive rebounds for 22 second-chance points,\" Malone said. \"You've got to finish off your defense with that gang rebounding. We did a poor job with that all night long. That and missed free throws were probably the two biggest reasons we lost the game.\"\n\nTIP INS\n\nNuggets: Denver won the previous five games against the Blazers. ... Denver missed out on the playoffs for the past two seasons. ... Mason Plumlee fouled out with 1:38 left.\n\nTrail Blazers: Portland went 8-2 without McCollum.  ... Kanter had 11 points and 13 rebounds for his fourth double-double in five games. ... It was Aminu's first game with at least 20 points and 10 rebounds.\n\nMORE MILESTONES\n\nWith his first 3-pointer, Lillard passed his franchise record of 229 3s set in the 2015-16 season. With his second, he reached 1,500 for his career. ... Lillard has scored 2,047 points so far this season, a new career high. He ranks fourth on the Blazers' single season list.\n\nUP NEXT\n\nNuggets: At Utah on Tuesday before hosting Minnesota on Wednesday to end the season.\n\nTrail Blazers: At the Lakers on Tuesday before wrapping up the season at home against Sacramento on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995148.21629
}