{
  "game_id": "0021501031",
  "espn_id": "400828918",
  "date": "Mar 19, 2016",
  "matchup": "OKC @ IND",
  "headline": "Westbrook, Durant help Thunder withstand George's 45 points",
  "body": "INDIANAPOLIS -- Maybe the Russell Westbrook-Kevin Durant show is becoming so routine, even the Oklahoma City Thunder are taking it for granted.\nAfter Westbrook finished with his league-leading 14th triple-double of the season and Durant had 33 points and 13 rebounds to help the Thunder overcome Paul George's 45 points in a 115-111 victory Saturday night at Indiana, first-year coach Billy Donovan sounded more impressed with something else.\nHis bench.\n\"Enes (Kanter) gave us great minutes, but I really thought everybody -- from the starters to the bench -- played well,\" Donovan said, referring to Oklahoma City's 45-14 scoring edge in points off the bench. \"That's what we have to have. I think as a group, we were much better coming down the stretch.\"\nIt may sound strange for a team that leans heavily on two perennial All-Stars, but Donovan is now playing for more than wins or numbers.\nWith a playoff spot already locked up, the No. 1 seed out of reach and the No. 2 seed virtually out of reach, the first-year coach is trying to get his team into postseason shape.\nBased on what Westbrook and Durant are doing these days, they're raring to go.\nWestbrook had 14 points, 11 rebounds and 14 assists for his second triple-double in two nights. He has more triple-doubles in one season than anyone since Magic Johnson had 17 in 1988-89.\nDurant, meanwhile, has scored at least 20 points in 55 consecutive games and can match his career-best streak Tuesday night against Houston.\nTogether, they have each had 20 points, five rebounds and five assists in 22 games this season -- extending their own NBA record, according to Elias Sports Bureau.\n\"It feels like we're getting into a good groove,\" Durant said after going 11 of 20 from the field. \"Tonight we kept grinding. With a back-to-back, coming in here against a team that beat us out of the (All-Star) break, makes it an even better win.\"\nGeorge sure didn't make it easy.\nHe wound up 14 of 29 from the field and 13 of 15 from the free-throw line, had seven rebounds, four assists and four 3-pointers.\nBut it was the one he missed, with 5.9 seconds left, that will gnaw at him. Instead of tying the score at 112, the Pacers were forced to foul Durant twice.\nDurant made the first three before intentionally missing the final free throw to run out the clock.\n\"They were dialed into the action and just switched it,\" George said. \"I should have known the switch was going to come and got my feet set for a better look.\"\nSCARY MOMENT\nDurant gave Oklahoma City a scare, too. On the final play of the third quarter, he jumped to make a block and appeared to have his legs inadvertently taken out from underneath and landed on his right elbow. Durant stayed down for a few moments as teammates tried to help him up. Eventually, he got up and walked to the bench under his own power.\nTHE PLAYOFF CHASE\nDonovan and Pacers coach Frank Vogel are taking different approaches into the final weeks of the season. When Donovan was asked if he'd rest players before the postseason begins, he responded: \"As the season unfolds, I think that could be part of the plan.\" Vogel, whose team started the night in the No. 7 spot in the East, doesn't have that option. \"The possibility is real that 44 wins doesn't get you in the playoffs, so we're going to have to win a lot of games down the stretch here.\"\nHOOPS CITY\nThe sellout crowd at Bankers Life Fieldhouse was watching more than an NBA game Saturday night. Many fans could were glued to their cellphones in the first quarter -- when the Indiana-Kentucky NCAA Tournament game was winding down. When that game ended, a smattering of applause could be heard from those watching the game on TV. A louder roar came when the final score was announced.\nTIP-INS\nThunder: Kanter had 15 points and 10 rebounds off the bench. ... Oklahoma City has won four straight overall and three straight road games. ... The Thunder improved to 6-7 on the second night of back-to-backs this season.\nPacers: All five starters reached double figures including George Hill, who had 20 points and nine assists. ... Indiana failed to extend league's longest active streak of consecutive winning seasons on its home court (26). ... Guard Ty Lawson missed his fifth straight game with a sprained left foot but Vogel hopes Lawson will play Monday night.\nUP NEXT\nThunder: Host Houston on Tuesday.\nPacers: Host 76ers on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994133.677655
}