{
  "game_id": "0021500278",
  "espn_id": "400828165",
  "date": "Dec 03, 2015",
  "matchup": "TOR vs. DEN",
  "headline": "Nuggets snap 8-game losing streak by edging Raptors 106-105",
  "body": "TORONTO -- Having led the entire game on the heels of eight straight losses, Denver Nuggets coach Michael Malone wasn't about to fool around when it came to icing a long-awaited victory Thursday night.\nNursing an eight-point lead against the Toronto Raptors with seven minutes to go, he reinserted his veterans in the hope that they could lead the team to its first victory since Nov. 17 in New Orleans.\nWhile the Raptors narrowed that advantage to just two points with 3:43 remaining, the Nuggets hung on for a 106-105 win.\n\"I went with a veteran group tonight, back to back, on the road and in a must-win situation where we're just dying for a win,\" Malone said. \"So I wanted to go with our vets, I just thought we'd have a better chance.\"\nWill Barton came off the bench to score 22 points and Danilo Gallinari added another 21 for the Nuggets. Joffrey Lauvergne had 14 points and 10 rebounds.\nDenver was a perfect 18 for 18 on free throws. The Nuggets avoided their first nine-game losing streak since the 2002-03 season, when they dropped 14 in a row.\n\"It was a collective effort,\" Barton said.\nDeMar DeRozan scored a Raptors' season-high 34 points and Kyle Lowry had 16.\nThe Nuggets never trailed, with Gallinari's jump shot 1:41 into the game putting them ahead to stay. A desperation 3 by Lowry as time expired closed the final deficit to one point.\nToronto appeared to make a game of it by starting the third quarter on an 11-3 run. But Gallinari made three 3-pointers and the Nuggets led by 10 going into the final period.\nRookie point guard Emmanuel Mudiay had eight assists in the first half and Denver shot at a 47.8 percent clip, taking an 18-point lead.\n\"We've got to get a level of play that we decide we're going to play at from the start of the game to the end of the game,\" Raptors coach Dwane Casey said. \"We can't wait to get our teeth kicked in before we start to play.\"\nTIP-INS\nNuggets: First-year coach Michael Malone is no stranger to Toronto. His father, Brendan, was the first head coach in Raptors franchise history. ... Denver improved to 1-5 in the second half of back-to-back games this season after losing in Chicago on Wednesday night. .... Nuggets rookie Emmanuel Mudiay went head-to-head with fellow Congo native Bismack Biyombo in the NBA for the first time.\nRaptors: Toronto is the only team in the NBA yet to play two straight home games. This matchup began a six-game homestand. ... Lowry, who set a franchise record by scoring 22 fourth-quarter points in Wednesday's win in Atlanta while dealing with flu-like symptoms, was in the starting lineup and \"100 percent,\" Casey said.\nITCHY FINGERS\nLowry had four steals, extending his career-high streak of consecutive games with at least one swipe to 23.\nQUOTABLE\nCasey on his team's inconsistent play: \"If you are serious about being a playoff team, and being a playoff contender, you have to make sure you are consistent in your performance, in your approach, in your energy, in your focus, whatever it is. My word is going to be `consistent.' We have to play for 48 (minutes) or as close to 48 as we can, and we have not done that.\"\nUP NEXT\nDenver visits Philadelphia on Saturday.\nToronto plays host to Golden State on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994754.3350909
}