{
  "game_id": "0022300938",
  "espn_id": "401585566",
  "date": "Mar 11, 2024",
  "matchup": "POR vs. BOS",
  "headline": "Brown has 27 and Tatum adds 26 for the Celtics in 121-99 win over Portland",
  "body": "PORTLAND, Ore. -- — The Boston Celtics aren't taking 50 wins this season for granted. \n\n\r\n              Jaylen Brown scored 27 points, Jayson Tatum added 26 and the Celtics beat the Portland Trail Blazers 121-99 on Monday night despite the absence of two key starters. \n\n\r\n              Jrue Holiday and Kristaps Porzingis were sidelined with injuries for the Eastern Conference-leading Celtics, who reached the 50-win milestone for the third straight season. \n\n\r\n              “At this point of the season, to have 50 wins, it means we’re doing something right,” Tatum said. “The scary part is, we can get better.” \n\n\r\n              The Celtics, the first team this season to reach 50 wins, have already clinched a playoff spot with 18 games remaining. \n\n\r\n              “All the guys laugh because, around this time of year, I say the same thing — how much of an honor it is to be on this team,” Brown said. \n\n\r\n              Deandre Ayton had 22 points and 15 rebounds for the Blazers, who are second-to-last in the West. It was Ayton's fifth straight double-double, tying the second-longest streak in his career. \n\n\r\n              Boston, which has won an NBA-leading 21 games on the road this season, pushed its lead to 20 points in the fourth quarter and had just three turnovers in the game. It was the second-fewest turnovers in a game this season: The Celtics had two in a January game against Denver. \n\n\r\n              Sam Hauser's 3-pointer with 8:40 to go in the game put Boston up 101-83, and his step-back 3 made it 115-95 and sent Portland fans streaming for the exits. Hauser finished with a season-high six 3-pointers and 22 points. \n\n\r\n              “We don't really look at a team's record,” Hauser said. “It's the NBA, everybody has talented players. You can lose any given night, so we just try to take it one day at a time, once game at a time, and find things that we can get better at each and every day.”\n\n\r\n              Holiday, who had 15 points in a 117-107 victory at the Phoenix Suns on Saturday night, had a sore left knee, while Porzingis missed his second straight game with a tight right hamstring. \n\n\r\n              Even without them, the Celtics led by as many as 17 points in the first half. Ayton’s floater got Portland within 56-47 and Anfernee Simons added a 3-pointer to close the gap to six points.\n\n\r\n              Tatum dunked to put Boston back up 62-50 as the Celtics went on a 10-2 run to lead 66-52 at the half. Brown led all scorers with 17 points. \n\n\r\n              “I’m grateful to be on a team that’s winning, that’s been playing the right way, has another opportunity to do something special. That’s a blessing,” Brown said. \n\n\r\n              Tatum, the Celtics' leading scorer, was listed as questionable going into the game with a right ankle issue, but started for Boston. Tatum had 29 points at Phoenix. Brown and Derrick White also played after being listed as questionable for the first night of a back-to-back.\n\n\r\n              Jerami Grant, who missed Portland's 128-118 win over the Toronto Raptors on Saturday night with a sore hamstring, was back in the starting lineup. The minutes restriction on rookie Scoot Henderson because of an adductor injury was also lifted and he also started.\n\n\r\n              UP NEXT: \n\n\r\n              Celtics: Visit the Utah Jazz on Tuesday. \n\n\r\n              Trail Blazers: Host the Atlanta Hawks on Wednesday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996568.73032
}