{
  "game_id": "0022201146",
  "espn_id": "401469301",
  "date": "Mar 30, 2023",
  "matchup": "MIL vs. BOS",
  "headline": "Tatum, Brown help Celtics demolish NBA-leading Bucks 140-99",
  "body": "MILWAUKEE -- — Whether or not Boston catches the Milwaukee Bucks in the Eastern Conference standings, the Celtics will have reason to feel confident if the teams meet in the playoffs for a second straight season.\n\n\r\n              Jayson Tatum scored 40 points, Jaylen Brown added 30 and the Celtics steamrolled the NBA-leading Bucks 140-99 on Thursday night. The Celtics (53-24) shot 22 of 43 from 3-point range and moved within two games of the Bucks (55-22). \n\n\r\n              “It does matter,” Brown said about the possibility of earning the No. 1 seed. “We want to finish out the season strong and see what happens.”\n\n\r\n              Boston won the season series with the Bucks 2-1, which would give the Celtics the tiebreaker if both teams finish with the same record. Boston beat the Bucks in seven games in last season’s East semifinals.\n\n\r\n              The Celtics trounced the Bucks 139-118 in Boston on Christmas Day and lost 131-125 in overtime on Feb. 14. The Celtics didn’t play Brown, Tatum, Marcus Smart or Al Horford in that overtime loss.\n\n\r\n              Boston's players downplayed the notion that their lopsided victory would send any sort of message to the Bucks in case they meet again in the postseason. They noted the Bucks were playing for a second straight night and shot just 37.6%, well below their norms.\n\n\r\n              “This don’t really mean much,” Brown said. “If we play them again, we’ve got to be ready to take their best shot.”\n\n\r\n              The Bucks didn't provide anything close to their best shot Thursday.\n\n\r\n              “We know what the deal is,” said Giannis Antetokounmpo, who led the Bucks with 24 points. “If you’re not focused and you don’t play hard, they are going to kick our (butt). Simple as that. There is no level of concern. It’s a fact. If we play the same way, we’ll have the same outcome. We’ve got to have some pride.”\n\n\r\n              Milwaukee took a hit on the floor as well as in the standings. Bucks forward Khris Middleton left midway through the third quarter after taking an elbow to the face from Brown, who was called for charging. Bucks coach Mike Budenholzer said after the game that Middleton got “three or four stitches” on his upper lip.\n\n\r\n              Boston built a 114-74 lead through three periods, causing most of the starters for both teams to sit out the entire fourth quarter. \n\n\r\n              The Bucks were playing one night after a 149-136 victory at Indiana in which they shot a season-high 62.4% from the floor with Jrue Holiday scoring 51 points and Antetokounmpo having 38 points, 17 rebounds and 12 assists. This marked the first time an NBA team had one player score at least 50 points and another have a triple-double with at least 35 points in the same game.\n\n\r\n              Milwaukee found the going quite a bit tougher Thursday.\n\n\r\n              Antetokounmpo shot just 11 of 27, including 0 for 5 from 3-point range. Holiday started his night by sinking a 3-pointer, but went 1 of 7 the rest of the way and finished with just six points.\n\n\r\n              After the first 8½ minutes of the game featured nine lead changes and five ties, the Celtics seized control by going on a 29-9 over the last seven-plus minutes. Boston capped that spurt by scoring 13 straight points.\n\n\r\n              Boston didn't let up the rest of the night as the Celtics shot 56% and bounced back from a 130-111 loss at Washington two nights earlier.\n\n\r\n              “We responded well from the jump,” Tatum said. “That's all that I wanted and we wanted as a team, regardless of if we won or not, just to respond and play better than we did last game.”\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Boston outscored Milwaukee 41-21 in the second period and matched its highest second-quarter point total of the season. ... Payton Pritchard didn't play due to left heel pain.\n\n\r\n              Bucks: Milwaukee’s Thanasis Antetokounmpo was ejected with 1:25 left for head-butting Boston’s Blake Griffin. The head-butting came after Griffin committed a flagrant-1 foul against Antetokounmpo. ... This matched the Bucks' most lopsided loss of the season. They fell 142-101 at Memphis on Dec. 15. \n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host the Utah Jazz on Friday. \n\n\r\n              Bucks: Host the Philadelphia 76ers on Sunday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994550.2694888
}