{
  "game_id": "0022300864",
  "espn_id": "401585492",
  "date": "Mar 01, 2024",
  "matchup": "CHI vs. MIL",
  "headline": "Giannis Antetokounmpo has 46 points, 16 rebounds in Bucks' 113-97 victory over Bulls",
  "body": "CHICAGO -- — The Milwaukee Bucks are tuning up for what they hope will be a deep playoff run. They're hitting more of the right notes.\n\n\r\n              Giannis Antetokounmpo dominated with 46 points and 16 rebounds and the Bucks beat the Chicago Bulls 113-97 on Friday night.\n\n\r\n              Antetokounmpo surpassed Sidney Moncrief as the winningest Milwaukee player with his 489th victory counting the playoffs, and the Bucks came away with their fifth straight win.\n\n\r\n              There were several heated exchanges, and Chicago's Nikola Vucevic got ejected. Otherwise, there wasn't much drama.\n\n\r\n              The Bucks led by 14 at halftime and went on a 17-0 run after Chicago pulled within eight early in the fourth. They also gave up fewer than 100 points for the fourth straight game. \n\n\r\n              “We’re winning games, but for us, it’s not about right now,” said coach Doc Rivers, who's 8-7 since replacing the fired Adrian Griffin. “Our whole key is getting ready. That's the first thing I told them. We still have work to do, we're still pushing, we got to get better. It's nicer to get wins than to lose, but we're not where we want to be yet.”\n\n\r\n              But the signs, at least lately, are promising, particularly when it comes to the defense. This was the sixth time in the past nine games the Bucks held an opponent under 100 points; they did it just once in the first 52.\n\n\r\n              “Everybody has to be on the same page, and I feel like the last couple of games, we're doing that and that's why our defense has taken a step,” said Antetokounmpo, who had six assists and made two 3-pointers. “Hopefully, we can keep it up.”\n\n\r\n              Damian Lillard scored 16 points. Patrick Beverley added 14 points to help the Bucks beat the Bulls for the third time in four games this season.\n\n\r\n              Chicago’s DeMar DeRozan became the 35th player in NBA history with 23,000 points. The six-time All-Star scored 12 points — all but two in the second half — and was 5 of 13 from the field after missing his first six shots.\n\n\r\n              DeRozan got into it with Bobby Portis late in the third quarter. He picked up a flagrant foul and technical on the play, and criticized the referees after the game.\n\n\r\n              “I think as far as officiating, just call it fair,” DeRozan said. “I think that’s more so where the frustration comes from. When we come down, we feel like we getting hit. They come down and we barely touching them but they’re getting the call. That kind of stings. Just the fairness of the calls I kind of think was the main focal of our frustration more so than anything.”\n\n\r\n              Coby White scored 22 points.\n\n\r\n              Vucevic had 17 points and nine rebounds before getting ejected early in the fourth quarter. Upset over a no-call when he missed a shot, he then delivered a hard foul on a driving A.J. Green and got thrown out with 9:27 remaining.\n\n\r\n              It was 84-76 after White hit two foul shots just under a minute into the fourth. But Green hit a 3 and the Bucks buried the Bulls from there.\n\n\r\n              “Right now, it's just trust,” Antetokounmpo said. “We've just got to trust one another. That's it, win or lose. ... (When we lose) it's gonna stink, but we have to have the same trust.”\n\n\r\n              Antetokounmpo had 23 points and eight rebounds as the Bucks grabbed a 58-44 halftime lead.\n\n\r\n              The two-time MVP simply had his way, whether he was making layups and dunks or setting up his teammates. He delivered a highlight reel play in the opening minutes when he drove and flipped a no-look, over-the-shoulder pass to Brook Lopez near the top of the key for a 3.\n\n\r\n              The Bucks led by 15 in the first quarter before the Bulls pulled within four early in the second. Milwaukee outscored Chicago 14-6 over the final four minutes of the half to break open a six-point game. Lillard started that spurt with a finger roll and two free throws. \n\n\r\n              Antetokounmpo had an alley-oop layup in the closing minute to make it a 13-point game. DeRozan then got his first two points for Chicago when he made two free throws, but Jae Crowder nailed a corner 3 at the buzzer to send the Bucks to the locker room with a 14-point lead.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host the Los Angeles Clippers on Monday night.\n\n\r\n              Bulls: At Sacramento on Monday night. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995876.991738
}