{
  "game_id": "401810013",
  "espn_id": "401810013",
  "date": "Nov 03, 2025",
  "matchup": "BOS vs UTAH",
  "headline": "Jusuf Nurkic makes last-second putback to lift the Jazz past the Celtics, 105-103",
  "body": "BOSTON -- — Jusuf Nurkic dropped in a putback with 0.6 seconds remaining and the Utah Jazz overcame a double-digit, second-half deficit to beat the Boston Celtics 105-103 on Monday night. \n\n\r\n              Keyonte George scored a season-high 31 points, and Lauri Markkanen added 20 points and nine rebounds to help the Jazz end a three-game losing streak.\n\n\r\n              The Celtics had a chance to tie, but Jaylen Brown was called for a foul on the inbounds play. Boston’s challenged but was unsuccessful allowing the Jazz to inbound the ball and run out the clock.\n\n\r\n              Brown led Boston with 36 points, but was 0 for 9 from the 3-point line. Boston shot a season-low 21.6% (11 of 51) from beyond the arc. \n\n\r\n              Payton Pritchard added 18 points and Derrick White finished with 10 points for the Celtics. They have lost their last two after winning three straight.\n\n\r\n              Utah erased a 10-point halftime deficit, outscoring the Celtics 25-14 over the first seven minutes coming out of the break to take its first lead of the night, 61-60. \n\n\r\n              The game was tied at 101 with a minute to play when Utah was whistled for a defensive 3-second violation.\n\n\r\n              White connected on the technical free throw. But on the ensuing possession, Brown tripped and turned it over to Markkanen, who drove in for a layup, \n\n\r\n              Neemias Queta was fouled and hit 1 of 2 free throws to tie it, setting up the Jazz’s final possession.\n\n\r\n              Up next\r\n              Jazz: At Detroit on Wednesday night. \n\n\r\n              Celtics: Host Washington on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042553.302905
}