{
  "game_id": "0021900619",
  "espn_id": "401161261",
  "date": "Jan 17, 2020",
  "matchup": "IND vs. MIN",
  "headline": "Brogdon's tiebreaking basket sends Pacers past Timberwolves",
  "body": "INDIANAPOLIS --  Indiana Pacers guard Malcolm Brogdon just wanted one more chance to make things right.\n\nWhen the opportunity came, Brogdon delivered.\n\nHe drove toward the basket, flicked the ball on the run and made a tiebreaking 16-footer with 18 seconds left to give the Pacers a 116-114 victory over the Minnesota Timberwolves on Friday night.\n\n\"Being the closer, sometimes it's about making the last shot but sometimes it's about making the right play, making the right pass,\" Brogdon said. \"My teammates, this organization, my coach trust me with the ball and I'm going to continue to try and make good decisions.\"\n\nHe was spot on in the Pacers' fourth straight win.\n\nIt didn't come easily, nor did it follow coach Nate McMillan's preferred script.\n\nBut the Pacers demonstrated something else Friday -- the toughness needed to overcome foul trouble, defensive struggles and a late scoring drought that nearly cost them after taking a 114-107 lead with 3:28 left.\n\nThat was followed by missed shots, three fouls and two turnovers, which the Timberwolves used to forge a tie with 1:48 to play and even led to three chances for Minnesota to take the lead.\n\nInstead, Brogdon bailed the Pacers out with the final basket. He finished with 12 points and 10 assists.\n\n\"Once we're under a minute, normally we're involving Malcolm and Domantas (Sabonis) in some type of two-man game because those two have been the guys who have done good things for us all season,\" McMillan said. \"We're going to put the ball in his (Brogdon's) hands and let him make decisions for us.\"\n\nT.J. Warren scored 28 points to help the Pacers fend off Minnesota for the second time in three nights, giving them their first season sweep of the series in four years.\n\nTwo-time All-Star center Karl-Anthony Towns returned to the Timberwolves lineup after missing the previous 15 games with a sprained left knee. He had 27 points in 28 minutes and made the two free throws to tie the score at 114.\n\nBut he was just 4 of 12 from the field in the second half, missed all three of his fourth-quarter attempts and stepped out of bounds with 1:16 to play -- wiping out what would have been the go-ahead 3-pointer.\n\nTowns' late turnover initiated a sequence of errors.\n\nWith the score still tied, Andrew Wiggins missed a layup on a fast break with 55 seconds left and then stepped out of bounds for another turnover with 31 seconds to go.\n\nThe second miscue led to Brogdon's basket, and then Shabazz Napier came up short on a 3-pointer with 8 seconds left.\n\nWiggins scored 22 points in Minnesota's fourth consecutive loss.\n\n\"What I thought were good rhythm 3s, they usually make,\" coach Ryan Saunders said, inferring things might could have been different if they went down. \"You know, we might be having a different conversation right now.\"\n\nHE'S BACK\n\nSaunders said before the game that he would play it safe with Towns, who hadn't played since Dec. 13.\n\nHe said the Timberwolves would limit Towns' minutes and closely monitor his fatigue level. How long that lasts may depend on how Towns responds to live game action over the next couple of games.\n\nBut the Timberwolves sure appreciated having him back on the court.\n\n\"Having him out, we had to get through it,\" Wiggins said. \"I'm glad to have him back and I'm not surprised he played so well. That's what he does. He's a natural born hooper.\"\n\nTIP-INS\n\nTimberwolves: Josh Okogie had 15 points while Napier and Jarrett Culver each scored 12. Napier had nine assists. ... Jordan McLaughlin had nine points and three 3s, all in the first half. ... Robert Covington finished with nine points and 10 rebounds. ... ... Minnesota made eight 3s in the first half and six early in the third quarter before finishing 17 of 29 from behind the arc.\n\nPacers: Jeremy Lamb had 18 points and six rebounds. ... Doug McDermott had 13 points and a season-high eight rebounds off the bench. ... Aaron Holiday also had 13 points. ... Sabonis and Myles Turner each played 25 minutes because of foul trouble and each scored eight points. ... Two-time All-Star Victor Oladipo is expected to return to action at the Pacers' next home game, Jan. 29 against Chicago. He's missed nearly a year since suffering a ruptured quad tendon in his right knee.\n\nUP NEXT\n\nMinnesota heads home Saturday to take on defending champion Toronto.\n\nIndiana begins a five-game road trip Sunday at Denver.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---",
  "source": "espn_api",
  "crawled_at": 1764995848.259681
}