{
  "game_id": "0022400655",
  "espn_id": "401705221",
  "date": "Jan 27, 2025",
  "matchup": "CHI vs. DEN",
  "headline": "Vucevic helps the Bulls hold off Jokic and the Nuggets for a 129-121 victory",
  "body": "CHICAGO -- — Nikola Vucevic had 20 points, 10 rebounds and six assists, and the Chicago Bulls handed the Denver Nuggets their second straight loss with a 129-121 victory on Monday night.\n\n\r\n              Zach LaVine scored 21 points and Lonzo Ball had 18 for Chicago, which had lost seven of eight. Ayo Dosunmu added 17 points.\n\n\r\n              The Bulls went 24 for 53 from 3-point range and had seven players score in double figures.\n\n\r\n              Denver wasted another impressive performance by Nikola Jokic, who had 33 points, 14 assists and 12 rebounds in his sixth triple-double in his last seven games. The three-time MVP has an NBA-best 21 triple-doubles this season.\n\n\r\n              Christian Braun scored 28 points for Denver. Jamal Murray and Michael Porter Jr. each had 18.\n\n\r\n              The Bulls grabbed the lead for good when they opened the fourth quarter with a 13-0 run. Dalen Terry made a 3-pointer and a layup before Matas Buzelis drove inside for a dunk after Aaron Gordon fell down, making it 108-96 with 8:51 left.\n\n\r\n              Terry finished with 13 points on 5-for-6 shooting.\n\n\r\n              Chicago used a 12-0 run to take a 90-88 lead with 2 minutes left in the third quarter. Buzelis capped the stretch by powering to the rim for a dunk over Peyton Watson.\n\n\r\n              But Jokic drove inside for a jam and made a technical foul shot to send Denver into the fourth with a 96-95 lead.\n\n\r\n              Takeaways\r\n              Nuggets: Struggled from long range, going 6 for 27 from behind the arc.\n\n\r\n              Bulls: Josh Giddey provided a lift with 12 points and 10 assists.\n\n\r\n              Key moment\r\n              Denver closed to 121-118 on Murray's jumper with 2:22 left. But LaVine responded with a 3 for Chicago.\n\n\r\n              Key stat\r\n              Led by Terry and Patrick Williams, Chicago had a 41-10 advantage in bench points.\n\n\r\n              Up next\r\n              Denver visits the New York Knicks on Wednesday night. Chicago opens a three-game trip at Boston on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997063.9070132
}