{
  "game_id": "0021800044",
  "espn_id": "401070725",
  "date": "Oct 22, 2018",
  "matchup": "CHI @ DAL",
  "headline": "Jordan gets another double-double as Mavs top Bulls 115-109",
  "body": "DALLAS --  DeAndre Jordan was a double-double machine before and after he stiffed the Dallas Mavericks in free agency three years ago.\n\nNow that the Texas native finally decided to join the Mavericks, the 6-11 center is up to the same old tricks.\n\nJordan became the first Dallas player in 24 years to start a season with three straight double-doubles, getting 18 points and 16 rebounds to help the Mavericks beat the Chicago Bulls 115-109 on Monday night.\n\n\"He's just been sensational,\" coach Rick Carlisle said. \"He's giving us a major presence on the inside. You add the personality and attitude that he brings to the game. On a night like tonight, you don't get over the top without it.\"\n\nLuka Doncic scored 19 in the 19-year-old's second home game, another win that put the Mavericks (2-1) over .500 for the first time since the end of the 2015-16 season.\n\nZach LaVine scored 34 for the Bulls and is the third Chicago player to open a season with three straight 30-point games. The others were Michael Jordan in 1986 and Bob Love in 1971.\n\nThe Bulls are 0-3 for the second straight year, losing two nights after a two-point loss in their home opener following a blowout defeat in Philadelphia.\n\n\"We did a good job,\" said LaVine, who was 5 of 7 from 3-point range. \"It hurts just to know that you have two winnable games. Made mistakes, but I guess that's just part of the game. It's upsetting.\"\n\nWesley Matthews led six Dallas players in double figures with 20 points. Maxi Kleber, Dwight Powell and Dorian Finney-Smith scored 12 apiece.\n\nJ.J. Barea scored nine, including a long 3-pointer just before the third-quarter buzzer. The 30-footer, Barea's only make in seven shots behind the arc, was part of a 14-2 run covering the third and fourth quarters for a 96-86 lead after neither team had been up by more than five.\n\nJordan secured his third double-double on the first of two straight offensive rebounds before finishing off the putback with the Mavs down five in the third quarter.\n\nThe last Dallas player with three straight double-doubles to start a season was Popeye Jones in 1994. Jordan is averaging 17 points and 12.2 rebounds.\n\n\"I'm just trying to do my job,\" said Jordan, who has had at least 41 double-doubles each of the past five seasons. \"Whenever Dennis (Smith Jr.) and Wes and J.J.  and Luka, our playmakers, make a play when I roll to the basket, I just try to finish and take what the defense gives us.\"\n\nChicago cut a 14-point deficit in the fourth quarter to five in the final minute, but Doncic, the third overall pick, collected a bad pass by No. 7 overall choice Wendell Carter Jr. in the backcourt after a Dallas miss and hit the layup.\n\nJabari Parker scored 20 points for Chicago but had just four after halftime.\n\nDoncic led the Mavericks with six assists, including a nifty one to Jordan that included a fake in the first half.\n\nNEW DAD'S DEBUT\n\nKris Dunn had nine points of 4-of-13 shooting with seven assists before fouling out late in his debut. The Chicago guard missed the first two games for the birth of his first child. \"First half, I was solid,\" Dunn said. \"Second half, I got a little winded and careless.\"\n\nBACK AND FORTH\n\nThere were 12 lead changes in the first half, including on seven straight buckets early in the second quarter. The last was on a 3-pointer by LaVine for a 47-45 Chicago lead. There were three more ties before halftime, with Cameron Payne hitting a floater in the final minute to put the Bulls up 61-59 at the break. The game finished with 17 lead changes.\n\nCHOICE WORD, TECH\n\nRobin Lopez wasn't happy with referee Sean Corbin's explanation after the Chicago center was called for a foul when he got tangled with Dwight Powell in the first quarter. Lopez appeared upset that Corbin said he was \"trying to help\" the big man from Stanford, and Lopez used the word \"platitudes\" in his retort. The big word was preceded by an expletive, and Corbin signaled for a technical foul.\n\nTIP-INS\n\nBulls: Carter was overshadowed by Doncic in the matchup of top 10 picks from this year's draft. He finished with four points, but did lead the Bulls with nine rebounds. ... Justin Holliday scored 16 points, and Bobby Portis had 12.\n\nMavericks: Doncic became youngest Dallas player to record a 20-point game with 26 in his home debut, a 140-136 win over Minnesota. He beat Smith, who did it as a rookie last November, by 113 days. ... Harrison Barnes (hamstring) and Dirk Nowitzki (ankle) are still awaiting their season debuts. Devin Harris missed a second straight game with a hamstring injury.\n\nUP NEXT\n\nBulls: Charlotte at home Wednesday.\n\nMavericks: At Atlanta on Wednesday.\n\n---\n\nMore AP NBA: www.apnews.com/tag/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994858.172632
}