{
  "game_id": "0022200661",
  "espn_id": "401468816",
  "date": "Jan 16, 2023",
  "matchup": "MIA @ ATL",
  "headline": "Murray's 28 help hot-shooting Hawks hold off Heat, 121-113",
  "body": "ATLANTA -- — Dejounte Murray scored 12 of his 28 points in the final period as the Atlanta Hawks held off Miami's comeback attempt and beat the Heat 121-113 on Monday for their third straight win.\n\n\r\n              The Hawks (22-22), coming off back-to-back road wins against Indiana and Toronto, matched their season-best winning streak. \n\n\r\n              “We've won three games against three good teams,” Murray said. “We just have to be consistent. That's the main thing for the rest of the year.”\n\n\r\n              Trae Young added 24 points as the Hawks, who never trailed, moved back to .500.\n\n\r\n              In the matchup of teams trying to move up from their current spot as Eastern Conference play-in teams, Miami (24-21) had its three-game winning streak end despite Jimmy Butler's 34 points. Bam Adebayo added 20 points and 13 rebounds.\n\n\r\n              The Hawks made 8 of 12 3s and shot 67% overall from the field (26 of 39) to lead 70-50 at halftime. Miami outscored Atlanta 63-51 in the second half.\n\n\r\n              “Tale of two halves,” said Heat coach Erik Spoelstra, who said the “stark difference” in his team's defensive effort “was born out of them blowing the doors off us in the first half.”\n\n\r\n              Added Spoelstra: “There were too many mistakes to overcome in the second half.”\n\n\r\n              The hot-shooting Hawks led by 26 points in the first half, but Miami pulled to within 111-106 on a jam by Butler. Murray, shooting over Victor Oladipo's tight defense, answered with a 3-pointer to push the lead to eight points with 1:36 remaining.\n\n\r\n              Tyler Herro kept Miami close with two last-minute baskets, including a 3-pointer.\n\n\r\n              A jam by Butler pulled the Heat to within 102-94 before the Hawks' seven consecutive points, including a 3-pointer by Young, stretched the lead back to 15 points.\n\n\r\n              Herro had 15 points in his return after missing three games due to left Achilles soreness. Miami's other usual backcourt starter, Kyle Lowry, missed his fourth consecutive game with a sore left knee. \n\n\r\n              AJ Griffin scored 12 points off the bench in the second quarter to help Atlanta keep its momentum following a 38-point opening period.\n\n\r\n              Butler's jam sparked an 11-0 Miami run in the third period. Butler's two free throws ended the run which trimmed Atlanta's lead to 80-72.\n\n\r\n              Atlanta played up-tempo on offense, pushing the pace, in contrast to its 106-98 loss at Miami on Nov. 27, when the Heat ended the Hawks' streak of 40 games scoring 100 or more points. \n\n\r\n              After missing the last 10 games with a strained right calf, center Clint Capela had 12 points off the bench.\n\n\r\n              PICKING UP THE PACE\n\n\r\n              For the game, Atlanta shot 59.2% from the field (45 of 76) and made 13 of 27 3s.\n\n\r\n              “I like the pace we are playing with on the offensive end of the floor,” said Hawks coach Nate McMillan, who said before the game it was important his team was aggressive, but did not settle for quick 3s.\n\n\r\n              “That was my mentality, be aggressive and get into the paint,” Young said. “... We're just making more shots and getting more stops. That's the difference.”\n\n\r\n              HONORING KING'S DREAM\n\n\r\n              A sellout crowd of 18,007, including former Atlanta mayor Andrew Young, attended the game. The 90-year-old Young worked with Martin Luther King in Atlanta as a leader in the civil rights movement. The dReam Center Church of Atlanta choir performed and there was a halftime tribute to King.\n\n\r\n              “We need to make sure we continue to honor the day and continue to fight for his dream,” McMillan said. \n\n\r\n              TIP-INS\n\n\r\n              Heat: PG Gabe Vincent made his fourth start for Lowry. F Caleb Martin returned from a strained left quad and had seven points. ... Also missing the game were F Nikola Jovic (lower back stress reaction), F Duncan Robinson (right finger surgery) and C Omer Yurtseven (left ankle surgery).\n\n\r\n              Hawks: Atlanta ended a streak of three straight home losses. ... Young set a season high with four steals but matched his high with 10 turnovers. ... G Bogdan Bogdanovic (left quad soreness) had eight points in his return after missing one game. ... The Hawks played only their second home game after six road games in January.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Continue three-game trip at New Orleans on Wednesday night.\n\n\r\n              Hawks: Visit Dallas on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993958.160494
}