{
  "game_id": "0021500011",
  "espn_id": "400827898",
  "date": "Oct 28, 2015",
  "matchup": "MEM vs. CLE",
  "headline": "Love leads Cavaliers past Grizzlies 106-76",
  "body": "MEMPHIS, Tenn. -- The Cleveland Cavaliers looked like the defending Eastern Conference champs. The Memphis Grizzlies looked like a royal mess.\nKevin Love had 17 points and 13 rebounds, Richard Jefferson had 14 points and Cleveland built a big early advantage and wrecked the Grizzlies' season opener with a 106-76 victory Wednesday night.\nCleveland capitalized on Memphis' shooting woes, building a double-digit lead in the first quarter and extending the margin to 32 in the fourth. The Cavaliers lost their season opener to the Bulls 97-95 on Tuesday night.\n\n\"Tough game for the home team,\" Memphis coach Dave Joerger said. \". We did not have any timing whatsoever. We made a lot of uncharacteristic errors.\"\nLeBron James, Jared Cunningham and Matthew Dellavedova had 12 points each, with James 4 of 13 from the field. Jefferson was five of six, including all three 3-point tries, part of Cleveland shooting 45 percent from beyond the arc.\nZach Randolph and Marc Gasol led the Grizzlies with 12 points apiece. Gasol and Tony Allen (six points) were the only Memphis players to make at least half their shots, and the Grizzlies shot 35 percent.\n\"That's who we need to be,\" James said of the defense. \"That's who we are. In order for us to be who we want to be, we have to continue to defend at a high level.\"\nMemphis erased some of Cleveland's first-half advantage, but the deficit was too deep to overcome after halftime, particularly since the Cavaliers shot so well from 3-point range.\nBy the midpoint of the fourth quarter, both teams were deep into their reserves.\n\"We've got a long way to go,\" Jefferson said. \"Everyone does. This is not an indication. Memphis should not be worried. Chicago isn't the leaders. We are not a .500 team.\"\nTIP-INS\nCavaliers: At one point late in the first half, the Cavs were shooting 57.1 percent from 3-point range (8 of 14), better than their overall percentage of 55.3 percent (21 of 38). ... The Cavaliers swept last season's two games against Memphis by an average margin of 18 points. ... The Cavs made 13 3-pointers. They were fourth in the league last year with just over 10 3-pointers a game.\nGrizzlies: Like many teams, the Grizzlies held a moment of silence for Minnesota Timberwolves coach Flip Saunders, who died Sunday from cancer. ... While Jeff Green started at SF for Memphis, he played only 7 minutes in the first half and Allen started the second half. ... Memphis beat the Timberwolves in last year's season opener, the only time Memphis has started 1-0 since the franchise moved from Vancouver in 2001.\nTURNING POINT\nMemphis made only four of its first 25 shots, contributing to a 21-point Cavs lead early in the second quarter.\nLeBRON'S BACK ON BACK-TO-BACK\nJames played 31 minutes against Memphis after playing 36 minutes in the season opener against Chicago. He missed two weeks during the preseason and received an anti-inflammatory injection while dealing with an achy back. \"I felt pretty good,\" James said.\nRED PANDA RETURN: Red Panda, the unicycle-riding, bowl-flipping acrobat, made her return as halftime entertainment after missing the last two years with an injury. Despite the time off, the popular halftime act managed to kick all of the bowls into a stack on top of her head.\nFINAL WORD: \"That was ugly. There ain't no other way to put it.\" -- Allen.\nUP NEXT\nCavaliers: Play home opener Friday against Miami Heat.\nGrizzlies: Travel to Indiana on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994493.316284
}