{
  "game_id": "0021900455",
  "espn_id": "401161097",
  "date": "Dec 25, 2019",
  "matchup": "TOR vs. BOS",
  "headline": "Brown scores 30, Celtics beat Raptors 118-102",
  "body": "TORONTO --  Boston’s Jaylen Brown celebrated Christmas with something he had never enjoyed before: a road win at Toronto.\n\nBrown scored 30 points, Kemba Walker had 22 and the Celtics beat the Raptors 118-102 Wednesday in the first Christmas Day NBA game played in Canada.\n\n“It was good to get a win here on Christmas,” said Brown, who made five 3-pointers and shot 10 for 13 from the field. “I’ve never won here period, so it was great to just get one.”\n\nEnes Kanter had 12 points and 11 rebounds as the Celtics snapped an eight-game losing streak north of the border and became the first Atlantic Division opponent to win in Toronto in more than four years.\n\nThe Celtics have won four straight to improve to 8-2 in December.\n\nBoston’s Gordon Hayward returned to the starting lineup after missing the past three games because of a sore left foot. He scored 14 points in 26 minutes.\n\n“It’s still a little sore but it’s playable,” Hayward said. “It’s good, it’s good.”\n\nFred VanVleet scored 27 points in the Raptors' second straight loss, and Chris Boucher had a career-high 24.\n\n“We weren’t quite physical enough, I thought, for most stretches of the game,” Toronto coach Nick Nurse said.\n\nThe Raptors are 2-2 since losing center Marc Gasol (left hamstring), guard Norman Powell (left shoulder) and forward Pascal Siakam (groin) to injuries. Nurse had no update on the status of the trio, but acknowledged their absence is making life difficult.\n\n“Scoring is not very easy for us right now,” Nurse said. “It’s tough.”\n\nToronto had gone an NBA-record 34 games between home losses to division foes. The Raptors’ last home loss to an Atlantic team was a 111-109 defeat to the New York Knicks on Nov. 10, 2015.\n\nKyle Lowry scored 14 points and Serge Ibaka had 12 for Toronto. The Raptors shot 8 for 23 from 3-point range.\n\nKanter arrived dressed in a black t-shirt that read ‘Freedom for ALL’ in white letters. He played outside the United States for the first time since visiting Toronto with the Knicks on Nov. 10, 2018.\n\n“Definitely amazing,” a smiling Kanter said. “I just can’t describe it with words. Just going out there was more than just a basketball game. For me, it was just going out there and living this freedom.”\n\nKanter’s outspoken criticism of Turkish President Recep Tayyip Erdoğan's government led to his passport being revoked in 2017. Turkish prosecutors have accused Kanter of membership in a terror organization and issued an international warrant for his arrest.\n\nKanter did not travel with the Knicks to London last January because he feared he could be killed over his opposition to Erdoğan. After being traded to Portland in February, he did not join the Trail Blazers for their March 1 game at Toronto.\n\nThe Raptors jumped out to a 10-0 lead as the Celtics missed their first five shots of the game, leading to a Boston timeout with 10:03 left in the opening quarter. After the stoppage, the Celtics outscored Toronto 28-9 to lead 28-19 after one.\n\n“They hit us early but I thought we recovered well,” Celtics coach Brad Stevens said.\n\nBrown made all five of his field goal attempts in the third, including three from long range, and scored 16 points. Boston led 88-69 through three quarters.\n\nTIP-INS\n\nCeltics: G Marcus Smart (eye infection) traveled to Toronto but was not active. Smart has missed the past seven games. … F Grant Williams dislocated his right index finger in the second quarter but returned before halftime. … F Jayson Tatum shot 1 for 10 in the first half. He finished 5 for 18 and scored 11 points. … Boston scored 11 points off seven Toronto turnovers in the first.\n\nRaptors: Toronto made a season-worst seven 3-pointers in a Dec. 9 win at Chicago. … Toronto’s only previous Christmas Day game was a 102-94 loss at New York in 2001.\n\nHOME SWEET HOME\n\nThe road team won a Boston-Toronto game for the first time in 13 meetings.\n\nTAKE A CHANCE\n\nBoston outscored Toronto 24-4 in second-chance points.\n\nHOT SHOTS\n\nThe Celtics shot 46 for 92 (50%). Boston is 8-0 this season when shooting 50% or better.\n\nUP NEXT\n\nCeltics: Host Cleveland on Friday.\n\nRaptors: Visit Boston on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and\n\nhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995623.910082
}