{
  "game_id": "0022000672",
  "espn_id": "401307461",
  "date": "Mar 24, 2021",
  "matchup": "CHA @ HOU",
  "headline": "Terry Rozier scores 25 points, Hornets cruise past Rockets",
  "body": "HOUSTON -- — Terry Rozier scored 25 points, Devonte’ Graham added 21 and the Charlotte Hornets beat the Houston Rockets 122-97 on Wednesday night.\n\n\r\n                    The Rockets quickly returned to the loss column after snapping a 20-game losing streak Monday night. It was the NBA’s longest skid since Philadelphia’s record-setting 28-game rut across the 2014-15 and 2015-16 seasons.\n\n\r\n                    Charlotte won in Houston for the first time since Dec. 22, 2004, snapping a 15-game losing streak.\n\n\r\n                    The Hornets were still adjusting their rotation in the second game without LaMelo Ball after the rookie suffered a fractured wrist that is expected to sideline him for the rest of the season. Graham started at point guard, hitting 6 of 9 from 3-point range.\n\n\r\n                    “This is the Devonte’ we know,” Hornets coach James Borrego said. “We all know it’s in there. This is the guy we know, believe in and trust. We all believe in him, and tonight, he proved why he’s on this roster and why he’s such a big part of our group. He was fantastic.”\n\n\r\n                    Malik Monk added 19 points off the bench for Charlotte.\n\n\r\n                    “If things aren’t going right with the second unit, it’s all on me,” Monk said. “With LaMelo hurt, I take great pride in bringing a lot of energy off the bench.” \n\n\r\n                    The Rockets were without Victor Oladipo, who missed the game for personal reasons. Oladipo has been heavily mentioned in trade rumors this week, leading up to Thursday afternoon’s deadline.\n\n\r\n                    For Houston, John Wall had 20 points and seven assists, and Christian Wood added 11 points and 10 rebounds.\n\n\r\n                    “We just have to play basketball and look at the film,” Wall said. “We have to play hard for 48 minutes to try to give ourselves a chance to win the game.”\n\n\r\n                    Following a 26-26 tie at the end of the first quarter, Charlotte took a 58-55 lead into halftime, thanks in large part to 9-for-19 shooting from 3. The Hornets finished 18 of 38 from 3 in the game, good for 47.4%, just under their season-high 51.2%.\n\n\r\n                    Charlotte opened the third quarter on a 10-2 run and entered the fourth with a 93-70 lead after outscoring the Rockets 35-15 in the third.\n\n\r\n                    “We just knew we had to tighten up our defense,” Borrego said. “We talked a lot about our defensive effort, and the guys responded. The starters were fantastic. They came out with urgency and were making shots, but it started on the defensive end. They set the tone, and we rode that wave for the rest of the half.”\n\n\r\n                    The Rockets closed out a seven-game homestand going 1-6 and will play four of their next five games on the road where they have lost nine straight.\n\n\r\n                    “Right at the beginning of the third quarter, (the deficit) went from 3 to 10 right away,” Rockets coach Stephen Silas said. “It went downhill from there.”\n\n\r\n                    In their previous meeting in Charlotte’s 119-94 win on Feb. 8, the Rockets scored just seven points in the fourth quarter.\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: C Cody Zeller, who missed the last two games with left shoulder bursitis, entered the game listed as probable and played 16 minutes off the bench, scoring eight points and grabbing seven rebounds. . Charlotte outrebounded Houston 50-39.\n\n\r\n                    Rockets: PG Kevin Porter Jr. was sidelined with right quad soreness. He participated in pre-game shooting drills before the team’s warmups and could be ready to return when the team travels to Minnesota this weekend.\n\n\r\n                    WALL’S EARLY SECOND-HALF EXIT\n\n\r\n                    After Charlotte’s hot start to the second half, Wall left the game relatively abruptly, a little more than four minutes into the third quarter. He spent much of the third quarter on a stationary bike, distant from the team’s bench. Wall declined to comment after the game. Silas was asked about his exit. \n\n\r\n                    “NBA stuff, frustration,” Silas said. “I’ll just leave it at that.” \n\n\r\n                    BORREGO NOT FOCUSED ON TRADE DEADLINE\n\n\r\n                    Hornets coach James Borrego said he hasn’t spent too much time over the past few days thinking about the looming trade deadline on Thursday afternoon. He said he talks with general manager Mitch Kupchak every day and that, “If he has something, he’ll bring it to me.” \n\n\r\n                    DARLING’S FIRST POINTS\n\n\r\n                    Rookie SG Nate Darling scored his first-ever points in the NBA, hitting a 26-foot 3-pointer with 1:58 remaining in the game. \n\n\r\n                    “I was excited for Nate,” Borrego said. “To score in an NBA game for the first time, that’s special. And I loved the bench’s reaction. That’s a special thing, and I’m very happy for him.”\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Host Miami on Friday night.\n\n\r\n                    Rockets: At Minnesota on Friday and Saturday nights.",
  "source": "espn_api",
  "crawled_at": 1764997362.6019452
}