{
  "game_id": "0022200136",
  "espn_id": "401468291",
  "date": "Nov 05, 2022",
  "matchup": "MIL vs. OKC",
  "headline": "Bucks top OKC for franchise-record 9th straight to open year",
  "body": "MILWAUKEE -- — Brook Lopez scored 25 points and the Milwaukee Bucks extended their season-opening winning streak to a franchise-record nine games with Giannis Antetokounmpo on the bench, beating the Oklahoma City Thunder 108-94 Saturday night.\n\n\r\n              Antetokounmpo sat out for the first time this season. He was listed as “questionable” with left knee soreness after recording his first triple-double of the season a night earlier in Minnesota. He did not go through warmups ahead of the game, and head coach Mike Budenholzer said before that game that the league’s second-leading scorer at 32.6 points per game would get the night off.\n\n\r\n              “It's kind of exciting,\" Lopez said of playing without the two-time Most Valuable Player. “Giannis gets a chance to rest, to refill his cup and we get a chance to get better and see what it's like without him on the court and get better in that way.”\n\n\r\n              With Antetokounmpo out, Lopez led Milwaukee on 10-of-16 shooting that included four of the Bucks’ 17 3-pointers — three of which came in the opening quarter. \n\n\r\n              “He’s had so many good games for us, but to shoot the 3-ball so well out of the gate, then really be such a force in the paint, he really delivered in a lot of different ways,” Budenholzer said. “He was phenomenal.”\n\n\r\n              He also had plenty of help. \n\n\r\n              Jevon Carter and Grayson Allen each added five 3s and finished with 18 points and 19 points, respectively. Bobby Portis notched fifth double-double of the season with 12 points and 21 rebounds. Jrue Holiday also finished with a double-double, scoring 10 points with 13 assists.\n\n\r\n              “I think we all knew that we’d all have to chip in,” Lopez said. “You look across the board … everyone who (played) had an impact.”\n\n\r\n              Shai Gilgeous-Alexander connected on 7 of 16 shots and led Oklahoma City with 18 points. Josh Giddey scored 15 points and Jeremiah Robinson-Earl 12.\n\n\r\n              “We were playing well offensively and defensively, but they started to chip away more on the defensive end than we did,” Robinson-Earl said. \n\n\r\n              After finishing the opening quarter tied at 34, the Thunder trailed by as many as 24 before hitting four 3-pointers in the closing minutes of the third. Oklahoma City opened the fourth on a 7-2 run that cut Milwaukee’s lead to 95-85 with 10:22 to play.\n\n\r\n              The Bucks responded with an 11-2 run over the next three minutes to put the game away.\n\n\r\n              “We really hard a hard time getting it going in the second quarter and into halftime, but I appreciate how hard our guys fought in the second half,” Thunder coach Mark Daigneault said. “We just kind of hung in there and stuck with it. ”\n\n\r\n              HISTORIC PACE\n\n\r\n              Along with being the first team in franchise history to start the season with nine straight victories, the Bucks are also the first team in the NBA to win their first nine games since 2015, when Golden State went 24-0 to start the season — a streak that ended in Milwaukee. \n\n\r\n              “It's obviously fun,” Lopez said. “I think what's pretty cool for us is we just feel like we could still be so much better. We were talking after the game about how much better we could be, especially offensively.\"\n\n\r\n              TIP-INS\n\n\r\n              Thunder: The loss was Oklahoma City’s third in four road games this season. … Gilgeous-Alexander came into the game averaging 32.3 points, good for third in the league and just 0.3 points behind Antetokounmpo. \n\n\r\n              Bucks: With Antetokounmpo sitting out for the first time this season, first-round draft pick MarJon Beauchamp got his first career start Saturday night.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Detroit Pistons on Monday.\n\n\r\n              Bucks: At Atlanta Hawks on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994907.0506759
}