{
  "game_id": "0021900500",
  "espn_id": "401161142",
  "date": "Dec 31, 2019",
  "matchup": "TOR vs. CLE",
  "headline": "Lowry scores 24 points, Raptors beat Cavaliers 117-97",
  "body": "TORONTO --  Kyle Lowry kept injury-ravaged Toronto rolling along by finishing off 2019 with another 20-point performance.\n\nLowry scored 24 points, Terence Davis matched his career high with 19 and the Raptors beat the Cleveland Cavaliers 117-97 on Tuesday night.\n\nSerge Ibaka had 20 points and 10 rebounds and Rondae Hollis-Jefferson scored 14 points in his first start with Toronto as the Raptors recorded their fifth straight home win over the Cavaliers.\n\nToronto won for the fourth time in seven games since losing starters Pascal Siakam (groin), Marc Gasol (left hamstring) and Norman Powell (left shoulder) to injury.\n\nLowry, who did not speak to reporters, has scored 20 or more in eight of his past nine games. He had 14 in a Christmas Day loss to Boston.\n\n\"Kyle Lowry is a Hall of Famer,\" Cleveland's Tristan Thompson said. \"He's a five-time All-Star, Olympic gold medalist, an NBA champ. He's their backbone.\n\n\"He keeps this ship running and he's playing at a high level. Kyle's a bulldog, he's going to compete every night. That's why his teammates always love him.\"\n\nCollin Sexton scored 22 points and Thompson had 14 points and 11 rebounds for the Cavaliers, who had won four of five.\n\nKevin Love returned to the starting lineup with 10 points and 11 rebounds and Cedi Osman scored 14 points for Cleveland.\n\nCleveland coach John Beilein said Lowry and Fred VanVleet deserved most of the credit for Toronto's latest triumph.\n\n\"In today's game, two guards like that, despite their size, can dominate,\" Beilein said. \"They really dominated the game today.\"\n\nThe Raptors are 13-1 when they lead through three quarters at home. Toronto lost 98-97 to Oklahoma City on Sunday despite taking an 80-76 lead into the fourth.\n\nSexton said the Raptors seemed intent on wiping away the memories of Sunday's defeat.\n\n\"They had a chip on their shoulder,\" Sexton said. \"They wanted to pretty much just beat us. You could tell from the very start of the game that they had a different type of energy.\"\n\nOG Anunoby and VanVleet each scored 12 points in the Raptors' second 20-point win over Cleveland this season. The Cavaliers lost 133-113 at Toronto on Dec. 16.\n\nToronto had lost three of four, but won for the 14th time in 19 home games. The Raptors went 9-7 in December, their busiest month of the season.\n\nHollis-Jefferson started in place of Anunoby, who shot 0 for 7 from 3-point range in Sunday's loss to Oklahoma City and had missed 17 of 19 from distance over his previous five games.\n\n\"Seemed like it worked out OK, they both played really well tonight,\" Raptors coach Nick Nurse said. \"I liked the energy from both of them.\"\n\nThe Raptors recorded an assist on nine of their 10 baskets in the opening quarter. Lowry fed Anunoby for a 3-pointer with 1.8 seconds left to give Toronto a 27-25 lead after one. The lead changed 10 times in the opening quarter, but didn't change again the rest of the way.\n\nLowry scored 11 points in the second and Toronto used six 3-pointers to outscore Cleveland 32-18, scoring the final seven points of the quarter to take a 59-43 lead at halftime.\n\n\"We just buried ourselves at the end of that first half,\" Beilein said.\n\nCleveland shot 2 for 12 from 3-point range in the second.\n\nToronto led 86-69 through three quarters.\n\nTIP-INS\n\nCavaliers: Love sat out Saturday's win at Minnesota because of a sore right hip. . The Cavs shot 10 for 38 from 3-point range. . Cleveland is 4-13 on the road. . The Cavs were 5-9 in December after going 3-12 in November.\n\nRaptors: Before the game, Nurse said his injured starters are still \"a ways away\" from returning. All three were injured in a Dec. 18 win at Detroit. . F Patrick McCaw left early in the first quarter after injuring his left leg but returned in the second. . Toronto held a 15-2 edge in bench scoring at halftime.\n\nWINNING MONTHS\n\nToronto has posted a winning record in 20 consecutive calendar months, the longest streak in franchise history and the longest active streak in the NBA. The Raptors last had a losing record in a single month when they went 8-9 in January 2017.\n\nDOUBLE YOUR PLEASURE\n\nToronto led by double digits for the entire second half.\n\nDECEMBER DOUBLES\n\nAll seven of Ibaka's double-doubles this season came in December.\n\nUP NEXT\n\nCavaliers: Host Charlotte on Thursday night.\n\nRaptors: Visit Miami on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and\n\nhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995617.943737
}