{
  "game_id": "0021900726",
  "espn_id": "401161368",
  "date": "Jan 31, 2020",
  "matchup": "LAL vs. POR",
  "headline": "Lakers return after Bryant's death, lose 127-119 to Blazers",
  "body": "LOS ANGELES --  Kobe Bryant's resonant voice echoed through the darkened Staples Center while images from his life and career flickered on the scoreboard above.\n\nLeBron James' heartfelt pregame speech honoring his friend then left Lakers fans and players alike cheering through tears.\n\nThe Lakers and the Portland Trail Blazers somehow had to play a basketball game after a wrenching pregame ceremony honoring Bryant and the other eight victims of the helicopter crash just five days earlier.\n\nAnd Damian Lillard gave a performance that nudged aside the basketball world's collective heartbreak for just a moment.\n\nLillard scored 48 points and the Trail Blazers beat Los Angeles 127-119 on Friday night in the Lakers' first game since Bryant, his 13-year-old daughter Gianna and seven others died in a helicopter crash.\n\nLillard hit seven 3-pointers and added 10 assists and nine rebounds in an inspired effort that sent the Blazers to a win over an opponent still dealing with the trauma of the crash that claimed the life of their franchise icon.\n\n\"I think everybody was emotional tonight,\" said James, who played in two Olympics alongside Bryant. \"We all have our individual reasons why emotion hits us, and then we all have this brotherhood and this family, being a part of this Laker organization, which automatically brings in even more emotion.\"\n\nBoth teams stood on the court during a poignant pregame tribute to Bryant including songs, Kobe highlights and James' speech, which captivated the arena.\n\n\"So in the words of Kobe Bryant, 'Mamba out,\" James told the crowd. \"But in the words of us, `not forgotten.' Live on, brother.\"\n\nHighlights of Bryant's career played during every break, but Lillard put on a show between the whistles.\n\nLillard's seven 3-pointers gave him 40 in his last five games, setting an NBA record. But even the Blazers star knew results were secondary on this unique evening.\n\n\"I don't feel like anybody feels like we walked away as a winner tonight, given the circumstances,\" Lillard said. \"The memories that we'll take away from it was just sad and just tough. It's good that we had to compete, so being on the winning side is a positive, but I don't think anybody walks away from this moment and this situation a winner.\"\n\nJames had 22 points, 10 assists and eight rebounds, and Anthony Davis had 37 points and 15 boards in the Lakers' first game since last Saturday.\n\nHassan Whiteside scored 30 points, and C.J. McCollum added 19 for the Blazers, who were playing their third game since Bryant's death, which seems to have affected practically everyone who picked up a basketball in the past quarter-century.\n\n\"We've had five days and two games to kind of understand the emotions that were going to be out there,\" Portland coach Terry Stotts said. \"I know it was a tough game for the Lakers, watching them during the tribute, during LeBron's talk. I thought it was a difficult game for them to play. I mean, it was difficult for both teams, but I think we've had some time to go through the grieving process.\"\n\nThe entire evening was likely both profoundly painful and cathartic for anyone who loves the Lakers or Bryant, who won five championships while playing his entire 20-year NBA career in purple and gold.\n\nBryant retired in 2016, but he remained a face of his only franchise and an inspiration to the current players, who learned about his death on their plane ride home from an East Coast road trip. Their next game against the Clippers was postponed, and the Lakers franchise persevered through a brutal week of coping with the loss.\n\n\"We understood this was going to be a difficult one,\" Lakers coach Frank Vogel said. \"We didn't want to lose, but this week has been more about life than basketball. ... We've got to continue to focus on the work. There's therapy in the work.\"\n\nSeveral Lakers teared up during the ceremony, as did the Blazers -- but after both teams took 24-second and 8-second violations off the opening tip, they lifted the heavy moment with grace.\n\nDavis began the game with red eyes, but managed to score 18 points in the first quarter alone. The Lakers committed 13 turnovers in the first half while playing with an obvious surfeit of energy.\n\nLillard, the gifted California native, went wild in the third quarter, scoring 23 points and hitting six 3-pointers in a virtuoso display of offensive skill.\n\nThe Lakers then trailed by 12 in the fourth quarter before a \"Kobe! Kobe!\" chant broke out. They promptly made a 9-0 run, but the Blazers stayed steadily ahead.\n\nTIP-INS\n\nTrail Blazers: Carmelo Anthony missed the game for what the Blazers called personal reasons. Anthony and Bryant were close friends. ... Lillard became the third player in league history with at least six 3-pointers in five straight games.\n\nLakers: Quinn Cook, who idolized Bryant, was visibly affected by the ceremony. He checked into the game in the second quarter wearing his new No. 28 jersey, which represents Gianna (2) and Kobe (8). ... Alex Caruso played despite neck soreness.\n\nSOMBER MOMENTS\n\nThe ceremony began in a darkened arena with Usher singing \"Amazing Grace.\" Staples Center then showed a video of Bryant's highlights narrated by his own voice.\n\nJames then took the microphone, discarded his prepared speech and commanded the crowd with stirring words from the heart. James joined the Lakers in 2018, and he spoke to Bryant several hours before the crash when Kobe congratulated LeBron on moving past him into third place on the NBA's career scoring list.\n\nLakers public address announcer Lawrence Tanter then introduced each of the Lakers' five starters as Kobe Bryant, drawing tears and cheers from the sellout crowd.\n\nTOUGH TIMES\n\nThe Lakers, the Clippers and the NHL's Kings all lost their emotionally charged first games at Staples Center after the death of Bryant, who played his final 17 seasons in the downtown arena.\n\nUP NEXT\n\nTrail Blazers: Host the Utah Jazz on Saturday night.\n\nLakers: Visit the Sacramento Kings on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995983.911915
}