{
  "game_id": "0022200553",
  "espn_id": "401468708",
  "date": "Jan 02, 2023",
  "matchup": "TOR @ IND",
  "headline": "Mathurin, Hield lead Pacers past Raptors for 4th straight",
  "body": "INDIANAPOLIS -- — Bennedict Mathurin scored 21 points and Buddy Hield added 19 to lead the Indiana Pacers to a 122-114 victory over the Toronto Raptors for their fourth consecutive victory Monday night.\n\n\r\n              Myles Turner had 18 points and 10 rebounds, and Tyrese Haliburton added 16 points and eight assists for the Pacers. \n\n\r\n              Gary Trent Jr. scored 32 points and Pascal Siakam had 26 for Toronto. Scottie Barnes added 23. \n\n\r\n              Indiana's bench outscored Toronto's reserves 54-7. The second unit included Mathurin, T.J. McConnell (15 points) and Jalen Smith (11 points and 11 rebounds).\n\n\r\n              “Their starters are a tough matchup for anyone in this league,” Pacers coach Rick Carlisle said of the Raptors. \"They were tough at the start of each half. Our second unit came in and gave us what we needed — force, energy, attacking, unselfish play. They were the difference in the game as a whole.”\n\n\r\n              Carlisle had special praise for McConnell, who made a career-high seven free throws in seven attempts.\n\n\r\n              “T.J. McConnell is a once-in-a-decade player,” Carlisle said. “You don’t find those guys like that who have boundless energy and indomitable spirit that can lift the entire building with one defining loose ball play. His minutes have been a little less. But he gets everything he can out of the minutes.”\n\n\r\n              McConnell said defense was the difference.\n\n\r\n              “We locked in and got stops and do what we do best — that’s get out and run,” McConnell said. “We moved the ball and I thought we did that at a high level. Things kind of slowed down. (Mathurin) really bailed us out like he’s done all year. It’s been special to watch.”\n\n\r\n              Mathurin went 6 of 9 from the field and 7 of 10 on free throws.\n\n\r\n              “It was amazing the difficulty of some of those shots,” Carlisle said.\n\n\r\n              The Pacers, who shot 45% from the field, had a 50-36 edge in rebounds. \n\n\r\n              “When you play Toronto, it's always a possession game,\" Carlisle said. \"They keep coming and coming. You have to outlast them.”\n\n\r\n              With the score tied at 101 in the fourth quarter, Haliburton sank a 3-pointer to put the Pacers ahead for good.\n\n\r\n              Toronto used a 20-2 run in the third period to take an 83-75 lead. With the Raptors leading 83-77 with 3:25 left in the quarter, O.G. Anunoby was called for a technical foul after pushing Mathurin. \n\n\r\n              Mathurin missed the technical free throw, but he scored six points, including a step-back 3-pointer, the rest of the quarter to help the Pacers grab a 91-90 lead after three.\n\n\r\n              “I’m trying to go with the flow,” Mathurin said. “I had a couple opportunities and went to the rim and got fouled a lot. I was trying to get myself going through my defense.”\n\n\r\n              Toronto led by 13 in the first quarter before settling for a 33-29 advantage after one.\n\n\r\n              Trailing 47-42 with 7:26 left in the first half, the Pacers outscored the Raptors 24-10 the remainder of the half to take a 66-57 halftime lead. \n\n\r\n              TIP-INS\n\n\r\n              Raptors: Precious Achiuwa played his first game since injuring his right ankle Nov. 9 against Miami. Achiuwa scored three points in 12 minutes. … Fred VanVleet started after missing two games with back spams. VanVleet scored nine points on 3-of-15 shooting.\n\n\r\n              Pacers: Indiana is 13-7 at home. The Pacers had 31 consecutive seasons of winning home records snapped in 2021. … Hield hit four 3-pointers and has made four or more in six straight games. … Chris Duarte went down in pain in the fourth quarter and went to the locker room. He was holding his left ankle. He missed six weeks earlier this season with a sprained left ankle. Carlisle said he was told Duarte could have gone back in if needed.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host the Milwaukee Bucks on Wednesday.\n\n\r\n              Pacers: Visit the Philadelphia 76ers on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994067.277577
}