{
  "game_id": "401809959",
  "espn_id": "401809959",
  "date": "Oct 25, 2025",
  "matchup": "DEN vs PHX",
  "headline": "Jokic's triple-double lifts Nuggets over Suns 133-111",
  "body": "DENVER -- — Nikola Jokic had his second triple-double of the season despite a quiet shooting night, Jamal Murray scored 23 points, and the Denver Nuggets beat the Phoenix Suns 133-111 in their home opener on Saturday night.\n\n\r\n              Jokic finished with 15 assists, 14 rebounds and 14 points on just 5 of 8 shooting. His first field goal attempt came with 2:26 left in the second quarter. He notched the triple-double on a turnaround hook shot with 57 seconds in the period.\n\n\r\n              Jokic has 166 career triple-doubles during the regular season, third behind Russell Westbrook (203) and Oscar Robertson (181), and 18 more in the playoffs. \n\n\r\n              Devin Booker had 31 points and Grayson Allen scored 17 for the Suns, who were playing the second game of a tough back-to-back. They tipped off Saturday night 20 hours after losing by 27 to the Los Angeles Clippers and didn’t have center Mark Williams, who was out with a right knee injury.\n\n\r\n              Phoenix trailed by 20 early in the third quarter but went on a 13-2 run to cut the deficit to 83-74. The Nuggets scored the next 11 points and took a 100-83 lead into the fourth.\n\n\r\n              Murray, who had 25 points and 10 assists in the loss at Golden State, sparked Denver at the start of the final period with a 3-pointer that made it 108-86. He also beat the buzzer at the end of the first quarter with a 55-foot pullup jumper.\n\n\r\n              The Suns got within 110-99 midway through the fourth but the Nuggets answered with a 14-2 run to put it away.\n\n\r\n              Aaron Gordon followed his career-high 50-point game Thursday night with 17 points and was 1 of 6 from deep. \n\n\r\n              Up next\r\n              Suns: Visit the Utah Jazz on Monday night.\n\n\r\n              Nuggets: At the Minnesota Timberwolves on Monday night.\n\n\r\n              ------\n\n\r\n              AP NHL: https://www.apnews.com/hub/NHL",
  "source": "espn_direct_latest",
  "crawled_at": 1765042501.599253
}