{
  "game_id": "0022400301",
  "espn_id": "401704867",
  "date": "Nov 30, 2024",
  "matchup": "PHI @ DET",
  "headline": "Maxey scores 28 as 76ers rout Pistons 111-96",
  "body": "DETROIT -- — Tyrese Maxey scored 28 points and the Philadelphia 76ers won their fourth game of the season by beating the Detroit Pistons 111-96 on Saturday night.\n\n\r\n              Jared McCain added 19 points and Ricky Council IV scored 17 for Philadelphia, which had lost seven of its previous eight games.\n\n\r\n              Malik Beasley had 19 points for the Pistons. Jaden Ivey had 15 points and Marcus Sasser scored 12. Simone Fontecchio had 11 rebounds for Detroit — the only player on either team to reach double figures in assists or rebounds.\n\n\r\n              Takeaways\r\n              Sixers: Andre Drummond left the game in the first quarter with a left ankle injury. Paul George was listed as out on the pregame injury report, but started after missing the last three games with a bone bruise on his left knee and scored 11 points.\n\n\r\n              Pistons: Cade Cunningham was a late scratch with a sprained left sacroiliac joint. Starters Tobias Harris, Tim Hardaway, Jr. and Jalen Duren combined for eight points on 3-for-16 shooting. Combined, they missed all seven of their 3-point attempts. \n\n\r\n              Key Moment\r\n              The Sixers scored 11 points in 101 seconds to take an early 22-7 lead. Maxey, George and Kelly Oubre Jr. hit three straight 3-pointers before Oubre finished the run with a mid-range jumper. Philadelphia led by as many as 18 points in the first quarter and 57-52 at halftime.\n\n\r\n              Key Stat\r\n              After starting the game with a 22-7 run, the Philadelphia starters began the second half with a 27-10 run to take an 84-62 lead late in the third quarter. KJ Martin replaced Drummond in the rotation after his injury.\n\n\r\n              Up Next\r\n              Both teams return to action on Tuesday night. The Sixers travel to Charlotte for a game with the Hornets while the Pistons play host to the Milwaukee Bucks.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998224.8435998
}