{
  "game_id": "0021601123",
  "espn_id": "400900518",
  "date": "Mar 30, 2017",
  "matchup": "LAL @ MIN",
  "headline": "Rubio scores career-high 33 as Wolves beat Lakers 119-104",
  "body": "MINNEAPOLIS --  Ricky Rubio knows the Minnesota Timberwolves will almost assuredly miss the playoffs for the 13th straight year. Still, the pass-first point guard can take heart in knowing that he is changing the way the league views him as his season winds down.\n\nRubio had a career-high 33 points, 10 assists and five rebounds and Karl-Anthony Towns scored 32 points to lead the Timberwolves to a 119-104 victory over the Los Angeles Lakers on Thursday night.\n\n\"Starting the season, I wasn't feeling that good,\" said Rubio, who made 12 of 20 shots and 4 of 5 3-pointers, \"and now I feel the best I've ever felt.\"\n\nAndrew Wiggins scored 27 points for the Timberwolves (30-44), who have now won more games than they did last season. Minnesota had 30 assists and only 11 turnovers.\n\nJordan Clarkson scored 18 points and D'Angelo Russell had 14 points and seven assists for the Lakers (21-54), who have lost 17 of their last 19 games. Brandon Ingram missed his third straight game with patellar tendinitis in his right knee.\n\n\"Defensively, we definitely have to do better communicating,\" Clarkson said. \"We were trying to force (Rubio) into taking those shots and giving a lot of help. He just made them tonight.\"\n\nAfter playing well coming out of the All-Star break to revive their playoff hopes, the Wolves lost six straight earlier this month to fade from contention. One of those losses was an ugly one to the Lakers in Los Angeles last week and they were in danger of giving away another lead late to the lowly Lakers when Clarkson hit a 3 to pull LA within nine in the final four minutes.\n\nBut Rubio scored on a drive to the basket and knocked down a 21-foot jumper to hold off the comeback. A 37 percent shooter for his career, Rubio is shooting 46.5 percent and 44 percent from 3-point range, since the All-Star break.\n\n\"He's someone that you normally are living with him shooting 3s,\" coach Luke Walton said. \"But our defense, we weren't communicating.\"\n\nJulius Randle had 12 points and 13 rebounds and Tarik Black had 15 points and nine rebounds off the bench for the Lakers, who entered the day a half-game ahead of the Suns for the second-worst record in the NBA.\n\n\"I wish we could fight for the playoff right now,\" Rubio said. \"That's what I came here for. I hope we can build from here and finally take off next season.\"\n\nTIP-INS\n\nLakers: Walton said the plan was for Ingram to practice on Friday and play on Saturday if all went well. ... Thomas Robinson, who had not played in four of the last five games, gave the Lakers a lift with 12 points in 14 minutes. ... The Lakers bench outscored Minnesota's 47-10.\n\nTimberwolves: Minnesota scored 25 points off of 17 Lakers turnovers. ... Debbie Saunders presented a check for $6,000 to the Minnesota Timberwolves and Lynx Basketball Academy on behalf of the Flip Saunders Legacy Fund, named for the former Wolves president and coach who died from complications involving lymphoma in 2015.\n\nZUBAC HURT\n\nLakers big man Ivica Zubac limped off the floor two minutes into the game with a sprained right ankle. He was taken for X-rays, which were negative, the Lakers said. He suffered a high ankle sprain and will be evaluated when the Lakers get back to Los Angeles. He left the arena in a walking boot.\n\n\"I'm not sure if I stepped on somebody's foot or what,\" he said. \"But I don't know. Just rolled it.\"\n\nGORGUI'S EFFORT\n\nGorgui Dieng added 11 points, 15 rebounds, six assists and three blocks for Minnesota, giving the Wolves a presence on defense and a stability on offense that he has all season long. Towns and Wiggins get more shots and pile up more stats, but Dieng has been crucial to what the Wolves do.\n\n\"They may seem like small things,\" coach Tom Thibodeau said. \"They're huge things in terms of winning.\"\n\nUP NEXT\n\nLakers: Los Angeles heads back home, but it's technically for a road game against the Clippers on Saturday.\n\nTimberwolves: Minnesota plays the second of a three-game home stand on Saturday against Sacramento.",
  "source": "espn_api",
  "crawled_at": 1764995358.0881379
}