{
  "game_id": "0021800973",
  "espn_id": "401071646",
  "date": "Mar 06, 2019",
  "matchup": "SAC vs. BOS",
  "headline": "Hayward's game-winner lifts Celtics over Kings 111-109",
  "body": "SACRAMENTO, Calif. --  Instead of dwelling on his mistake that let Sacramento tie the game in the closing seconds, Gordon Hayward made it moot.\n\nHayward made up for a costly foul by hitting a tiebreaking shot with 2 seconds to play that helped the Boston Celtics overcome the absence of injured star Kyrie Irving in a 111-109 victory over the Kings on Wednesday night.\n\nHayward fouled Buddy Hield on a 3-point attempt with 7.6 seconds left, allowing Sacramento to pull even. Boston had no timeouts and inbounded the ball to Hayward, who went the length of the court before hitting a fall-away for the win.\n\n\"It felt good more than anything because I almost lost us the game with the foul,\" he said. \"I was trying to get that one back for us. More than anything, just happy for our team and we found a way to win these last two games, especially with what we were going through. It's been a roller coaster and we want to be on an up when we get to the playoffs.\"\n\nHarrison Barnes then missed a 3 at the buzzer, giving the Celtics their second win in two nights to start a four-game California swing. Boston had lost five of six before starting this trip with a 33-point win at two-time defending champion Golden State and then the dramatic victory over the Kings the following night.\n\nHayward scored 30 points against the Warriors and is rounding back into the form he showed before suffering a gruesome ankle injury in the opener last season after signing a $128 million, four-year deal to join the Celtics.\n\n\"It shows you the confidence he still has,\" teammate Marcus Morris said. \"It's building and building. A lot of people are trying to write him off and say he's not going to be who he was. As a player, that's tough. \"\n\nJayson Tatum led Boston with 24 points, Al Horford had 21 points, 11 rebounds and seven assists, and Hayward finished with 12 points.\n\nBarnes scored 24 points and Hield added 23 for the Kings, who have lost four of five and trail San Antonio by four games in the race for the final Western Conference playoff spot.\n\n\"It's always a tough one to lose a close game like that,\" point guard De'Aaron Fox said. \"Sometimes it comes down to a few key possessions. They made a lot of tough shots.\"\n\nThe Kings erased a six-point deficit in the final three minutes thanks in part to two drives by Fox and a hustle block by Hield that prevented a fast-break layup for Marcus Smart.\n\nHield's free throws then tied the game before Hayward delivered the game-winner for Boston.\n\n\"Everyone was tight on their man,\" Hayward said. \"It was almost just like 1-on-1. The lane kind of cleared out and I was able to make the move.\"\n\nTIP-INS\n\nCeltics: Irving was more sore than expected after banging his thigh the previous night at Golden State and was held out. Boston has won seven straight games without its leading scorer in the lineup. ... The Celtics had just three offensive rebounds on 39 misses from the field as they placed a priority on getting back on defense against the speedy Kings.\n\nKings: Sacramento got off to a fast start, making 14 of 22 shots in the first quarter for a six-point lead. But the Kings went just 6 of 22 in the second and were tied 49-all at halftime. ... Sacramento rookie Marvin Bagley III remains sidelined after spraining his left knee last Wednesday. Kings coach Dave Joerger said Bagley is progressing in his rehab but there is no timetable for his return.\n\nUP NEXT\n\nCeltics: Visit the Los Angeles Lakers on Saturday.\n\nKings: At the New York Knicks on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994866.324616
}