{
  "game_id": "0021900640",
  "espn_id": "401161282",
  "date": "Jan 20, 2020",
  "matchup": "TOR @ ATL",
  "headline": "Powell's big 4th quarter leads Raptors past Hawks, 122-117",
  "body": "ATLANTA --  Norman Powell says nothing has changed, even though he's in the best streak of his highest-scoring season.\n\nIt may feel normal to the Toronto Raptors' sixth man. The results definitely look different.\n\nPowell scored 27 points, including 17 in the final period, and the Raptors withstood Atlanta's late charge to beat the Hawks 122-117 on Monday.\n\nTrae Young had 42 points and season-high 15 assists for Atlanta.\n\nPowell has scored 20 or more points in five straight games, the longest stretch of his career. He is averaging 15.8 points per game. The previous best mark of his five-year career was 8.6 last season.\n\n\"I'm just taking the same shots I've been taking,\" Powell said after Toronto's fourth straight win. \"I have confidence in my game, confidence in my shot.\"\n\nThe high-scoring streak came after Powell missed 11 games with a left shoulder injury.\n\nToronto led 112-91 before surviving a late comeback by the Hawks, who pulled within two points at 117-115. Fred VanVleet, who had 20 points, sank three free throws with 14.2 seconds remaining after he was fouled by John Collins, pushing the lead to five.\n\nPowell had only 10 points through three quarters before finding his 3-point range in the final period to lead Toronto's productive second unit.\n\n\"It was just him being him,\" Young said of Powell. \"He's a great scorer. ... It's tough when he gets going.\"\n\nHawks coach Lloyd Pierce said the best strategy against Powell was \"don't let him touch it.\"\n\nThe backups were on the floor when Toronto made its comeback in the third quarter and remained in the game for most of the final period.\n\n\"The second unit came in and did a great job,\" Raptors coach Nick Nurse said. \"They took a big deficit to a really big lead. We needed it all at the end.\"\n\nYoung's four-point play cut Toronto's lead to 114-107 with 1:39 remaining. Collins' layup reduced the deficit to two points.\n\nPowell made three straight 3s to lead the Raptors' decisive surge early in the final period. After Serge Ibaka added a 3, Powell continued his hot streak with another long-range shot, this one a 27-footer.\n\nPowell made 6 of 9 3s.\n\n\"He was dialed in there, for sure,\" Nurse said.\n\nPascal Siakam scored 18 points for the Raptors.\n\nToronto scored the first nine points and quickly stretched the lead to 12 points, at 34-22, in the first period. But this would not be a runaway for the defending NBA champions.\n\nAtlanta outscored Toronto 35-21 in the second period to lead 60-57 at halftime and then opened strong in the second half. The Hawks stretched the advantage to nine points, 70-61, on a 3-pointer by Cam Reddish.\n\nTIP-INS\n\nRaptors: Toronto hasn't settled on its starting five, even after VanVleet's second game of his return after missing five games with a hamstring injury. \"I think it's going to be in constant shuffle the rest of the season,\" Nurse said. \"A lot of guys are worthy.\" ... Excluding Powell, the Raptors made only 7 of 33 3-pointers (21%).\n\nHawks: Vince Carter made two shots -- both 3s -- against his former team. ... C Alex Len (lower back pain) missed his fourth straight game but is expected to be available on Wednesday against the Clippers. ... After making only 1 of 7 field goals and scoring only two points in Saturday's 136-103 loss to Detroit, Kevin Huerter had nine points while making only 3 of 12 shots. ... Young had seven turnovers.\n\nHONORING KING\n\nPierce said the holiday to honor the legacy of the Rev. Martin Luther King Jr. is special to Atlanta, King's hometown. \"The significance of the day here in Atlanta goes without saying,\" Pierce said, adding King is \"the most important figure in the history of our city.\" Nurse said he hopes young players use the day to learn more about King. \"Hopefully this is an educational day for them,\" Nurse said.\n\nBIG TURNOUT\n\nA postgame concert by Grammy Award-winning Christian hip-hop artist Lecrae helped draw a sellout crowd of 17,300.\n\nUP NEXT\n\nRaptors: Return to Toronto to face Philadelphia on Wednesday night.\n\nHawks: Host the Clippers on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995956.054602
}