{
  "game_id": "0022200624",
  "espn_id": "401468779",
  "date": "Jan 11, 2023",
  "matchup": "DEN vs. PHX",
  "headline": "Jokic, Nuggets rout Suns 126-97 for 12th straight home win",
  "body": "DENVER -- — Nikola Jokic had 21 points, 18 rebounds and nine assists before sitting out the fourth quarter and the Denver Nuggets won their 12th straight home game, routing the weary and short-handed Phoenix Suns 126-97 on Wednesday night. \n\n\r\n              Bones Hyland added 21 points and Jamal Murray had 16 to help the Nuggets win for the 14th time in 17 games. They reached the halfway point of the season tied with Memphis for the Western Conference lead. \n\n\r\n              “But we're not satisfied,” said Hyland, who hit five of Denver's 15 3-pointers. \n\n\r\n              A night after winning at Golden State despite missing four starters and six rotation players, the Suns ran out of gas playing a back-to-back at altitude while dressing 10 players. \n\n\r\n              Torrey Craig scored 16 points and Josh Okogie added 14 points and nine rebounds for the Suns. They have dropped 10 of 12. \n\n\r\n              “They posted up Jokic early and just flattened us out (defensively),\" Suns coach Monty Williams said. “And he does a really good job of finding the open man or scoring.” \n\n\r\n              Phoenix started the second quarter with an 8-second violation and things only got worse. Hyland hit all four of his 3s in the period, Jokic had a rebound and put-back using only one hand and Kentavious Caldwell-Pope hit his fourth 3 in the half without a miss as Denver built a 23-point lead. \n\n\r\n              “I feel like whoever gets the ball and they're open, it's a made shot,” Hyland said. “I feel like we're so connected right now.” \n\n\r\n              Jokic had nine points and nine rebounds in the third quarter as the lead stretched to 31 points. The two-time reigning MVP rested in the fourth instead of pursuing his 12th triple-double of the season against the overwhelmed Suns. \n\n\r\n              Phoenix remained without Devin Booker (groin), Chris Paul (hip), Deandre Ayton (ankle), Cameron Johnson (knee), Landry Shamet (hip) and Cameron Payne (foot), and also is without Jae Crowder. \n\n\r\n              Guard Saben Lee, a Phoenix area product, signed a 10-day contract before the game and scored eight points. \n\n\r\n              “It’s good to have another body down there,” Williams said. “When I look down there and see more coaches than players, I’m like ... this is ... yeah, I’ll stop there.” \n\n\r\n              The absences soured the rematch of the Christmas night overtime thriller won by the Nuggets behind Jokic's 41-point triple-double and Aaron Gordon's power dunk over Shamet. \n\n\r\n              The Nuggets have faced depleted teams in their last three games. Cleveland rested Donovan Mitchell on Friday and the LeBron James didn't play for the Los Angeles Lakers on Monday. \n\n\r\n              BACK-TO-BACK BLUES\n\n\r\n              Williams was unhappy playing consecutive nights in San Francisco and Denver. It involved moving ahead one time zone, dealing with the lengthy drive from Denver's airport to downtown and adjusting to the mile-high altitude. \n\n\r\n              Nuggets coach Michael Malone called it “the toughest back-to-back in the business.” \n\n\r\n              At least ESPN picked up the game and moved the tipoff back an hour. \n\n\r\n              “When you fly two hours and have to drive 30-40 minutes, that's a lot on any team,” Williams said.\n\n\r\n              TIP-INS\n\n\r\n              Suns: Their 22 losses are four more than all of last season. ... Williams had no update on Paul's injury. Williams said Johnson has begun playing “a little bit of 1-on-1.\"\n\n\r\n              Nuggets: Murray rolled his ankle in the second half, but Malone doesn't expect him to miss time. ... Jokic made 10 of 15 shots, marking the 31st straight game he's shot 50% or better from the field. ... Denver scored at least 120 points for the fourth straight game and is 19-1 when scoring that many this season. ... Denver, which is 18-3 at home, last won 12 straight at Ball Arena in the 2018-19 season. \n\n\r\n              UP NEXT\n\n\r\n              Suns: At Minnesota on Friday night. \n\n\r\n              Nuggets: At the Los Angeles Clippers on Friday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994705.719607
}