{
  "game_id": "0021700043",
  "espn_id": "400974794",
  "date": "Oct 23, 2017",
  "matchup": "MEM @ HOU",
  "headline": "Gasol leads Grizzlies to 98-90 win over Rockets",
  "body": "HOUSTON -- In a game that he dominated offensively, Memphis Grizzlies center Marc Gasol said it was the team's defense that helped the most in the wild come-from-behind win over the Houston Rockets.\nGasol scored 26 points to lead the Grizzles to a 98-90 win in Houston on Monday night. Memphis has won its first three games for the first time since the 2014-15 season when the team won its opening six contests.\nMemphis allowed just two points in the final six minutes and ended the game on a 20-2 run.\n\"At the end of the game, not allowing them to score, that's a great way to finish,\" Gasol said. \"When you can trust that your defense is going to be there at the end of the game, you don't have to put as much pressure on your offense.\"\nWith the game tied at 88 with less than three minutes remaining, tempers flared after Memphis guard Mario Chalmers fell to the ground and tripped James Harden, who then shoved Chalmers as he tried to get off the ground. After a lengthy review, both players received technicals and Harden was called with an offensive foul.\nMemphis guard Mike Conley said Chalmers' scrappiness provided a spark for the Grizzlies.\n\"He embodies what we are and for that to happen at that point of the game, it got everybody going,\" Conley said. \"It got everybody believing that, 'Hey, we belong here, we're supposed to be here, and this is our chance to win the game.'\"\nOn the following play, James Ennis III made a shot where he was fouled and converted the free throw to put Memphis up three. After Clint Capela's dunk, Conley hit a 3 to push the lead to 94-90.\nConley struggled for most of the game, shooting 3-for-10 from the field and scoring nine of his 17 points at the free throw line, where he was perfect. But he came on huge for Memphis down the stretch, making key shots and getting pivotal assists.\n\"They did a good job of defending and switching -- every shot I took was a tough shot up until the fourth quarter,\" Conley said. \"In close games, there's a job to be done, and you just have to go out there and do it.\"\nFor most of the game, it was Gasol who gave Houston fits. Whether he was overpowering Capela or shooting over smaller forwards, Gasol found a rhythm, making eight of his 15 shots and going 10-for-10 from the free throw line.\nWhen told he had five dunks in the game, Gasol said, \"That's four too many.\"\nOn Eric Gordon Bobblehead Night where he was presented with his Sixth Man of the Year Award in a pregame ceremony, the veteran guard was ironically a starter in the game. Gordon led the Rockets with 27 points.\nHarden finished with 22 points, eight assists and five rebounds. Houston was held to 90 points, three less than their season low of 93 from all of last season.\n\"Our bodies weren't popping and moving like we normally do,\" Harden said. \"We didn't make shots, obviously. They played pretty good defense, but we just didn't pop when we needed it.\"\nHouston led 57-50 at halftime. The Rockets held a lead as big as 12 points in the second half, but the Grizzlies got hot midway through the fourth quarter.\nOFF-SHOOTING NIGHT\nThe Rockets made just nine 3s on 23.7 percent shooting. Houston was 1-8 when making less than 10 3s last season.\n\"Obviously, we forced some up -- some were good and didn't go in,\" Rockets head coach Mike D'Antoni said. \"We have to improve. We've got to get better, and I knew it was going to be a tough game.\"\nBOO BIRDS:\nForward Chandler Parsons was booed heavily by the Toyota Center crowd when he first took the floor. Parsons spent his first three seasons in Houston before leaving for Dallas in 2014.\nTIP-INS\nGrizzles: Guard Tyreke Evans played through a bruised left knee after being listed as questionable. Evans played 21 minutes and had five points. ... Forward JaMychal Green missed a second straight game with a left ankle injury and wore a boot on the team's bench.\nRockets: Harden was named Western Conference Player of the Week early Monday after averaging 27.7 points, 9.0 assists, 4.0 rebounds and 1.67 steals to lead Houston to a 3-0 start. It was the 14th time in his career to win the award. ... Veteran center Nene received a technical foul for a dead-ball brush with Parsons late in the third quarter.\nUP NEXT\nGrizzlies: Visit Dallas on Wednesday night.\nRockets: Visit Philadelphia on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764992815.8027031
}