{
  "game_id": "0021800440",
  "espn_id": "401071121",
  "date": "Dec 16, 2018",
  "matchup": "SAC @ DAL",
  "headline": "Hield, Fox help Kings end Mavs' home winning streak, 120-113",
  "body": "DALLAS --  The Sacramento Kings ended the Dallas Mavericks' home winning streak and spoiled Dirk Nowitzki's return to the American Airlines Center.\n\nMore importantly for them, they found a way to close the deal after a stinging home loss.\n\nBuddy Hield and De'Aaron Fox each scored 28 points Sunday night in the Kings' 120-113 victory, which ended the Mavs' 11-game home winning streak.\n\nComing off a loss to Golden State in which they blew a 10-point lead over the final three minutes, the Kings led for the entire second half and finished off Dallas behind some big plays late by Fox.\n\n\"We thought about the loss we just had,\" Fox said. \"We kind of had a similar lead at a similar time and we try not to make those same mistakes as we made against Golden State.\"\n\nThe 21-year veteran Nowitzki entered to a standing ovation late in the first quarter, scoring three points in eight minutes. He missed the first 26 games of the season while recovering from ankle surgery before playing six minutes at Phoenix on Thursday.\n\nLuka Doncic had 28 points and nine assists, but no other Dallas player scored more than 15 points. DeAndre Jordan tied his season high with 23 rebounds but Dallas was hampered by poor 3-point shooting, making only 9 of 35 (26 percent).\n\nDoncic played extended minutes as the team's primary ball handler with injuries to starting point guard Dennis Smith Jr. (right wrist sprain) and primary backup J.J. Barea (left ankle sprain) leaving Dallas short-handed at the position.\n\n\"We had a bad shooting night, which didn't help,\" Mavericks coach Rick Carlisle said. \"But on those nights, your defense has got to keep you in it. And we just were unable to stay really, really close enough to give ourselves a chance.\"\n\nSacramento was also short-handed. Marvin Bagley III, the No. 2 pick in the draft, was out with a bone bruise on his left knee, and Kings teammate Iman Shumpert was a late scratch with a hip contusion.\n\nTIP-INS\n\nKings: Bagley will be re-evaluated in 10 to 14 days. ... Yogi Ferrell had eight points in his first game against Dallas since he left the Mavericks as a free agent this summer.\n\nMavericks: Carlisle said Smith's injured right wrist wasn't progressing as well as hoped despite Smith playing 27 minutes Thursday. \"He keeps falling on it,\" Carlisle said after the game. \"And when he falls, he generally falls from higher up than the rest of us.\" ... Nowitzki was also denied a chance to become just the sixth player in NBA history to reach 900 wins.\n\nFOX TAKES OVER\n\nDallas had closed within 98-91 midway through the fourth quarter when Fox outjumped Jordan, who is eight inches taller, for a defensive rebound, then coasted downcourt for a layup. Nemanja Bjelica then hit 3-pointers on back-to-back possessions for a 106-97 lead.\n\nWesley Matthews' 3 with 1:46 to play pulled the Mavs to 112-107, but Fox dribbled out nearly the entire shot clock and drove the lane for layup. After a Dallas turnover, Fox fed Willie Cauley-Stein for a dunk to ice the game with 51 seconds left.\n\n\"We know we can't go anywhere without Fox because of his speed and his playmaking ability,\" Hield said.\n\nDIRK CHECKS IN\n\nNowitzki entered with 3:17 remaining in the first quarter. He's the first player in NBA history to play 21 seasons with one team.\n\nNowitzki missed his first three shots from the field but scored his first point on a technical foul shot with 7:48 to go in the second quarter, then nailed a short jumper eight seconds later.\n\n\"I appreciate the warm welcome,\" Nowitzki said. \"This obviously took a lot longer than I was hoping myself. I wish I was out there a long, long time ago. I'm finally there and moving in the right direction.\"\n\nUP NEXT\n\nKings: Second half of a back-to-back Monday at Minnesota.\n\nMavericks: Start a four-game road trip Tuesday at Denver.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994883.9626398
}