{
  "game_id": "0021900813",
  "espn_id": "401161455",
  "date": "Feb 12, 2020",
  "matchup": "CHA @ MIN",
  "headline": "Graham, Hornets rally to beat Timberwolves 115-108",
  "body": "MINNEAPOLIS --  The young Charlotte Hornets are riding some positive vibes into the All-Star break.\n\nDevonte' Graham scored 28 points and Malik Monk added 25 to lead the Hornets to a 115-108 comeback win over the Minnesota Timberwolves on Wednesday night.\n\nMiles Bridges added 20 points as Charlotte won its second consecutive game ahead of a seven-day layoff. That after a stretch when the Hornets lost 13 of 14.\n\n\"Big,\" Graham said. \"Different feeling. Everybody's happy, smiling. We can feed off of this, especially going into break, coming back.\"\n\nBismack Biyombo had 14 points and 10 rebounds for the Hornets, who rallied from a double-figure deficit to spoil D'Angelo Russell's home debut with Minnesota.\n\nCharlotte's rally from 18 down was sparked on the defensive end. The Hornets held Minnesota to 42 second-half points on 30% shooting.\n\n\"We had to ramp up our physicality,\" Biyombo said. \"Communication got better, physicality got better, our ball pressure got better. We were rebounding the ball a little bit better in the second half than we did in the first half. So overall, we were talking to each other. Communication was there. That's really what got it done is our intensity.\"\n\nRussell had 26 points and 11 assists for the Timberwolves, who played without Karl-Anthony Towns but led for most of the first three quarters.\n\nTowns has a left wrist injury that will be further evaluated during the All-Star break.\n\n\"You give teams like that some momentum and you don't respond to adversity and it's hard to win in this league,\" Russell said. \"Hard to get the confidence back.\"\n\nHornets guard Terry Rozier missed the game with left knee soreness.\n\nThe Hornets trailed by 18 in the first half. They cut into the lead with a 15-5 run to start the third quarter. A 12-2 run to open the fourth gave them their first lead since 2-0.\n\nBridges scored 17 points in the second half, Monk had 16 and Graham scored 15. Graham hit a 3-pointer with 54 seconds left to ice the victory.\n\n\"It's a strong win for us,\" Hornets coach James Borrego said. \"To go into the break with two wins with this young group, it should really allow us to start the second half with great confidence.\"\n\nMalik Beasley scored 16 of his 28 points in the first half to help Minnesota build its lead. The Timberwolves ended up with their second consecutive loss ahead of the break.\n\n\"You've got to give them credit,\" Minnesota coach Ryan Saunders said. \"They've been together for a while, those young guys that they have. They played really hard with it and they control the dribbler well.\"\n\nTIP-INS\n\nHornets: G Cody Martin is in concussion protocol and did not play for the third straight game. Borrego said he expected Martin back after the All-Star break. Martin's twin brother, Caleb Martin, started in Rozier's place.\n\nTimberwolves: F Jake Layman missed his 39th consecutive game with a left toe sprain. ... F Evan Turner still is not with the team. Turner has not played since being acquired in a four-team trade on Feb. 5. ... Juancho Hernangomez, playing against his older brother Wily, had 16 points and 12 rebounds.\n\nTOWNS OUT\n\nThe Timberwolves said Towns' injury was revealed by an MRI on Tuesday. Prior to Wednesday's game, Saunders said he did not know when or how Towns was injured. Towns had 23 points, 10 rebounds and seven assists in 37 minutes during Monday's loss to Toronto.\n\n\"He's a guy who takes a lot of contact,\" Saunders said. \"He's a guy who attacks the rim with force. There's been times where he's getting knocked to the floor. So we know that there is wear in that sense, but no specific action.\"\n\nTowns is averaging a career-best 26.5 points and 10.8 rebounds per game this season. He missed 15 games with a sprained left knee.\n\nUP NEXT\n\nHornets: At Chicago on Feb. 20 in their first game following the All-Star break.\n\nTimberwolves: Host Boston on Feb. 21. The Celtics have won the last six meetings.",
  "source": "espn_api",
  "crawled_at": 1764996054.606653
}