{
  "game_id": "0021900020",
  "espn_id": "401160662",
  "date": "Oct 25, 2019",
  "matchup": "MEM vs. CHI",
  "headline": "LaVine scores 37, Bulls rally to beat Grizzlies 110-102",
  "body": "MEMPHIS, Tenn. --  Zach LaVine may have led Chicago scorers, but it was rookie Coby White who sparked the Bulls' comeback.\n\nLaVine had 37 points, and White, the seventh pick in last summer's NBA Draft, scored 21 of his 25 points in the second half as the Bulls rallied to beat the Memphis Grizzlies 110-102 on Friday night.\n\n\"I told ya'll from the jump, I knew how good he was going to be,\" LaVine said when asked about White. \"He's going to continue to get better.\"\n\nMemphis built a first-half lead to 14 points before holding a 60-47 advantage at the break. At that point, White had a mere four points. The North Carolina product's 21 second-half points included 8 of 11 from the field and 4 of 6 from outside the arc.\n\n\"It was a team win,\" the rookie said. \"I was just one little piece of it. We got it done as a team. ... I was just doing what I can to create some type of spark.\"\n\nJaren Jackson Jr. led Memphis with 23 points and 11 rebounds, while rookie Brandon Clarke had 14 points, missing only two of nine shots. Grizziles rookie Ja Morant, the No. 2 pick in the draft, and Jonas Valanciunas added 10 points apiece. Valanciunas grabbed 13 rebounds.\n\nThe Bulls turned up the defense to start the second half, cutting into the Grizzlies' lead as Memphis missed its first six shots. White would end up playing the entire fourth quarter as the Grizzlies saw their lead slip away.\n\n\"I wasn't taking him out,\" Bulls coach Jim Boylen said of White.\n\nThe Bulls caught Memphis with about four minutes left on a 3-pointer from White. After the teams exchanged leads, Chicago pulled ahead for good when LaVine scored on a drive with 1:31 left, part of a 12-1 Bulls closing run.\n\nThe loss marked the second time in the first two games in which Memphis squandered a lead it held entering the fourth quarter -- perhaps a sign of a young team.\n\n\"We kind of got away from what we needed to be doing offensively in the third quarter,\" Memphis coach Taylor Jenkins said, later adding: \"We have to learn from how the first half is more indicative of what we have to be offensively and defensively. Then we have to get better in the third and fourth quarter.\"\n\nTIP-INS\n\nBulls: Have won five straight in the series -- the longest victory stretch over the Grizzlies since Chicago won the first seven games after the franchise started in Vancouver. ... Lauri Markkanen made only one of eight shots in the first half, including missing six from outside the arc. He finished 4 of 15 from the field, scoring nine points. ... White scored 10 points in the third quarter to start the Bulls' comeback.\n\nGrizzlies: Play five of their next six games at home. The lone road game is at Los Angeles against the Lakers next Tuesday. ... The loss snapped a streak of three straight home-opening wins. ... An indication of the new faces on the Grizzlies, swingman Dillon Brooks is the longest-tenured Memphis player entering his third year. ... Valanciunas earned the Grizzlies first home technical of the year, debating a no-call in the second quarter. ... Morant, who had six turnovers in the season-opening loss to Miami, committed four against the Bulls. He has nine assists to 10 turnovers in his first two games.\n\nMANAGING OTTO\n\nBefore the game, Chicago coach Jim Boylen indicated forward Otto Porter Jr. would play less than 24 minutes as the Bulls manage his time. Chicago plays their first back-to-back of the season on Saturday against Toronto. \"We'll manger him appropriately to play (Saturday), and then we will evaluate him after the game if he does play (against Toronto),\" Boylen said. Porter played just more than 21 minutes.\n\nLAST WORD\n\n\"I've got confidence in him. He's fearless. He's not scared of anything. He likes the moment. You can see it in his eyes. He wants that.\" -- Zach LaVine on rookie Coby White.\n\nUP NEXT\n\nBulls: Hold their home opener Saturday against the defending champion Toronto Raptors.\n\nGrizzlies: Host the Brooklyn Nets on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995774.1210802
}