{
  "game_id": "0022401145",
  "espn_id": "401705711",
  "date": "Apr 07, 2025",
  "matchup": "PHI @ MIA",
  "headline": "Robinson scores 21, Herro adds 20 and Heat rally late to beat 76ers 117-105",
  "body": "MIAMI -- — Duncan Robinson scored 12 of his 21 points in the fourth quarter, Tyler Herro scored 20 and the Miami Heat pulled away to beat the Philadelphia 76ers 117-105 on Monday night.\n\n\r\n              Kel’el Ware had 19 points and 17 rebounds for the Heat, and Davion Mitchell had 12 points and nine assists.\n\n\r\n              Quentin Grimes and Lonnie Walker IV each scored 29 for Philadelphia, which lost its 12th straight. Adem Bona scored 16 points and grabbed 11 rebounds for the 76ers.\n\n\r\n              Miami (36-43) is now a half-game back of Chicago (36-42) in the race for No. 9 in the East; those two teams meet on Wednesday. The Heat are 1 1/2 games behind No. 8 Atlanta (37-41) and 2 1/2 games behind No. 7 Orlando (38-40).\n\n\r\n              Takeaways\r\n              76ers: Reflecting on a season that was wrecked by injuries, 76ers coach Nick Nurse — who started four players Monday that weren't on Philadelphia's roster to start the season — noted that other than one 10-3 stretch in November and December, the 2024-25 campaign was “no doubt, a huge disappointment. It started bad, stayed bad and it's going to end bad.”\n\n\r\n              Heat: Miami was without Bam Adebayo (back spasms), Kevin Love (personal) and Andrew Wiggins (right hamstring). The Heat have played 30 games since acquiring Wiggins; he's missed 15 of them. “He's getting close,” Heat coach Erik Spoelstra said.\n\n\r\n              Key moment\r\n              A 16-3 run in the fourth turned a tie game into a 104-91 Miami lead with 4:22 left.\n\n\r\n              Key stat\r\n              Miami hasn't faced a double-digit deficit in six straight games — the team's longest such streak since February 2022.\n\n\r\n              Up next\r\n              Philadelphia plays its road finale Wednesday at Washington. Miami goes to Chicago on Wednesday for a matchup with major play-in implications.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998202.51916
}