{
  "game_id": "0021300943",
  "espn_id": "400489816",
  "date": "Mar 10, 2014",
  "matchup": "CHA vs. DEN",
  "headline": "Jefferson, Walker lead Bobcats past Nuggets 105-98",
  "body": "CHARLOTTE, N.C. --  The Charlotte Bobcats are getting used to big nights from Al Jefferson and Kemba Walker.\n\nNow, they have Gary Neal to throw into the offensive mix.\n\nThe newly acquired Neal came off the bench and scored 19 points as the surging Bobcats won their seventh home game in a row, defeating the Denver Nuggets 105-98 on Monday night.\n\nJefferson led all scorers with 26 points and Walker scored 24, but it was Neal's work off the bench that may have made the biggest difference with Gerald Henderson out with a strained right calf muscle.\n\n\"It was a huge to get a win at home and protect our homecourt, especially with the standings the way they are,\" said Neal, who was playing in his only his seventh game with the team since coming over from Milwaukee in a trade on Feb. 20.\n\n\"I felt good in the (Monday) morning shootaround and had a good individual workout before the game,\" Neal added. \"Then, the first couple shots fell and I got in a good rhythm.\"\n\nNeal actually made his first six field-goal tries as the Bobcats, currently in position to grab the No. 7 seed in the Eastern Conference for the playoffs, improved to 30-34. Three of those baskets by Neal were 3-pointers.\n\nThe Nuggets, who fell to 27-36, were led by Ty Lawson's 24 points -- 15 of which came in the fourth quarter as he tried to rally his team.\n\n\"They were without Gerald Henderson and Gary Neal stepped in and did what he needed to do,\" Nuggets coach Brian Shaw said. \"We have to learn to respect everyone, whether he's a starter or coming off the bench.\"\n\nJefferson made 10 of his first 14 field-goal attempts, and also contributed a game-high 13 rebounds. Walker added seven assists for the Bobcats.\n\nJefferson scored 12 points and grabbed seven rebounds in the first quarter, after which the Bobcats led 25-22. But they actually extended their lead to 12 in the second quarter, as Neal scored nine points.\n\n\"That boy can score. He made plays, that's all,\" Jefferson said of Neal. \"If he can play like that, it's going to give a big lift to the second unit. With him hitting 3s like that, that's just going to open up the paint for guys like me who like to attack it.\"\n\nJosh McRoberts added 15 points for Charlotte, including a key 3-pointer with 6:15 left at the shot-clock buzzer to extend Charlotte's lead to 90-82 after Denver had cut it to five.\n\nDenver also got 15 points from Kenneth Faried, 16 from Aaron Brooks, and 11 points and a team-high 10 rebounds from J.J. Hickson.\n\nAfter Faried led a brief Denver comeback to cut Charlotte's lead to 51-45 at the half, Walker and Jefferson hit the first two baskets of the third quarter to push the Charlotte advantage back to 10 and the home team never trailed in the second half.\n\nDenver did pull to within 101-96 in the final minute, but Walker, who made all 12 of his free-throw attempts on the night, hit a pair with 55.6 seconds left and then Jefferson hit a jumper after a defensive stop to seal the Bobcats' victory.\n\n\"We hung in there and fought hard,\" Bobcats coach Steve Clifford said. \"It wasn't our best game. We made a lot of mistakes in the fourth quarter. But it's a good win and an important win for our team.\"\n\nClifford said Neal, who has now scored in double figures in six of the seven games he's played for the Bobcats, is providing the kind of instant offense that he had hoped for when Neal was acquired from the Bucks along with backup point guard Luke Ridnour.\n\n\"He played great,\" Clifford said. \"Forget the 7-for-9 (field-goal shooting). He made two big plays out of the pick-and-roll when we were struggling. They blitzed Kemba and Gary Neal hit CDR (Chris Douglas-Roberts) for a big 3 and he started the ball movement on another pick-and-roll that led to a Kemba jumper. He's the one who kind of got our offense back on track.\"\n\nGame notes Clifford said Henderson, who missed Monday's game and has been out a week with a strained right calf muscle, might attempt running during Tuesday's practice. He hopes Henderson will be available to resume playing in games soon. Clifford said that likely won't occur until next week, however. ... The Bobcats have 18 home wins, three more than all of last year.",
  "source": "espn_api",
  "crawled_at": 1764993146.483671
}