{
  "game_id": "0022000857",
  "espn_id": "401307653",
  "date": "Apr 17, 2021",
  "matchup": "CLE @ CHI",
  "headline": "Bulls beat Cavs 106-96 to snap five-game skid",
  "body": "CHICAGO -- — Nikola Vucevic scored 25 points, Lauri Markkanen added 16 off the bench and the Chicago Bulls beat the Cleveland Cavaliers 106-96 on Saturday night to snap a five-game losing streak.\n\n\r\n                    Denzel Valentine had 13 points off the bench as the Chicago reserves accounted for 45 points. \n\n\r\n                    The Bulls were playing for a second straight game without All-Star Zach LaVine, who is in the NBA's health and safety protocol and not with the team.\n\n\r\n                    “We've got to figure it out,” Markkanen said. “Even without him, I still think we have a lot of talent.”\n\n\r\n                    Colin Sexton and Darius Garland had 22 points apiece as the Cavaliers dropped their second straight and fourth in five games.\n\n\r\n                    Cleveland won the first meeting between the teams this season, 103-94 on March 24.\n\n\r\n                    “I'm hoping what happened tonight can be a growth moment,” Chicago coach Billy Donovan said. “We played with an urgency.”\n\n\r\n                    The Bulls used a run of 12 straight points in the first quarter to turn a 17-11 deficit into a 23-17 lead. Chicago led 29-24 at the end of the first and was up 46-38 with 3 minutes left in the second. But Cleveland rallied to score 11 of the final 12 points of the first half for a 49-47 halftime lead.\n\n\r\n                    Chicago regained control in the third, jumping out to a 75-59 advantage with 3 minutes left in the quarter.\n\n\r\n                    “We just came out flat in the third quarter,” Garland said. “We've been dealing with that all year — the beginning of the first quarter and the beginning of the third quarter.”\n\n\r\n                    The Chicago lead was 80-70 entering the fourth before Cleveland scored seven straight trim the lead to three points. The Cavaliers managed to get it to three points on a few occasions and were within 96-93 with 2 1/2 minutes remaining. But the Bulls scored 10 straight to put it away.\n\n\r\n                    Markkanen, who hadn't scored in double figures the previous five games, started the run with a 3-pointer. He had been a starter for much of his four seasons in the league before recently moving to the bench and still is adjusting to the new role.\n\n\r\n                    “I tried to be aggressive and take advantage of the opportunity,” Markkanen said. “It's a new role for me. I'm going to play my role as well as I can.”\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: F Kevin Love had 14 points and 11 rebounds, and C Jarrett Allen also had a double-double with 10 points and 11 rebounds ... G Damyean Dotson and G/F Dylan Windler both sat out with left knee soreness. Dotson missed his fourth straight game, while Windler hasn't played since March 29.\n\n\r\n                    Bulls: G Tomas Satoransky had seven points in 15 minutes after sitting out Friday because of an illness ... The return of LaVine, who is sixth in the NBA in scoring at 27.5 points per game, remains uncertain. “He's actually doing well,” coach Billy Donovan said. “He's disappointed he can't be around the team. I think it's always hard when you get alienated from the team and you're not with the guys.”\n\n\r\n                    STRETCH DRIVE\n\n\r\n                    The Cavaliers are in 13th place in the Eastern Conference and are hoping to move up in the final month of the regular season to earn a spot in the play-in tournament.\n\n\r\n                    “I think it's extremely important for our guys and we talk to them about it,” coach J.B. Bickerstaff said. “We've got young guys who haven't experienced playing meaningful games at the end of the season. That's huge for our growth. It'll be good to see how we respond to it.” \n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Visit the Detroit Pistons on Monday night.\n\n\r\n                    Bulls: Visit the Boston Celtics on Monday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997872.156239
}