{
  "game_id": "0022400729",
  "espn_id": "401705295",
  "date": "Feb 06, 2025",
  "matchup": "HOU @ MIN",
  "headline": "Edwards scores 41 to lift Timberwolves over Houston 127-114",
  "body": "MINNEAPOLIS -- — Anthony Edwards had 41 points, seven rebounds and six assists on Thursday night as the Minnesota Timberwolves rallied to beat the Houston Rockets 127-114.\n\n\r\n              One night after scoring 49 points in a win over Chicago, Edwards dominated the game early and late. He scored 18 points in the first quarter and 16 in the fourth, which began with Houston leading by six.\n\n\r\n              Rudy Gobert had back-to-back dunks to start the quarter before Edwards took over with three 3-pointers as Minnesota outscored Houston 35-16 over the final 12 minutes.\n\n\r\n              Jaylen Clark scored a career-high 17 points for the Timberwolves while Naz Reid had 15 points and 11 rebounds.\n\n\r\n              Jalen Green led Houston with 28 points. Alperen Sengun had 16 points, 10 rebounds and seven assists for the Rockets, who lost their fifth straight.\n\n\r\n              Takeaways\r\n              Rockets: Houston is one of the league's top road teams with 17 victories, more than all but one NBA team entering the night. But the Rockets have lost their last four on the road.\n\n\r\n              Timberwolves: Minnesota was playing the fourth of five straight games at home, where they are 14-12 (compared to 15-11 on the road). But with two strong fourth-quarter performances in as many nights, the Wolves might be figuring it out.\n\n\r\n              Key moment\r\n              With less than 5 minutes to play, Edwards missed a 3-pointer but Clark tracked down the rebound. He passed it back to Edwards, who drove to the hoop and drew a foul while hitting a short jumper. He made the free throw, then hit a 3-pointer on the next possession to put Minnesota on top 113-106.\n\n\r\n              Key stat\r\n              Minnesota outrebounded Houston, the No. 1 rebounding team in the NBA, 47-39.\n\n\r\n              Up next\r\n              Both teams are back in action on Saturday, when the Rockets visit Dallas and the Timberwolves host Portland.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997369.2029629
}