{
  "game_id": "0021900843",
  "espn_id": "401161485",
  "date": "Feb 23, 2020",
  "matchup": "TOR vs. IND",
  "headline": "Raptors roll to biggest win of season, beat Pacers 127-81",
  "body": "TORONTO --  Kyle Lowry and the surging Toronto Raptors tuned up for their showdown with Milwaukee by pounding the Indiana Pacers.\n\nLowry had 16 points and 11 assists, extending his career-best streak of double-doubles to six, and Toronto hammered Indiana 127-81 on Sunday, the most lopsided victory in Raptors history.\n\nPascal Siakam scored 21 points and Serge Ibaka had 15 points and a season-high 15 rebounds as Toronto led from wire-to-wire and posted its 13th straight home win over the Pacers. The Raptors won for the 17th time in 18 games and extended their home winning streak to nine.\n\nThat streak will be tested when Giannis Antetokounmpo and the Bucks come north of the border Tuesday night, the first of three meetings between the teams down the stretch. The NBA leaders have won seven of eight heading into Monday's game at Washington.\n\n\"They're a well-coached team, they're a well-oiled machine,\" Lowry said. \"All we can do is worry about ourselves.\"\n\nLowry's double-double was his 13th of the season. He's averaging 19.3 points and 10.8 assists over his current six-game run.\n\n\"I've never coached or seen anybody that plays as hard in basketball as that guy,\" Raptors coach Nick Nurse said.\n\nToronto's largest lead was 49 points, its biggest of the season. The Raptors led by 40 in a home win over Utah on Dec. 1. The 46-point margin of victory surpassed a 36-point win over Charlotte on Nov. 18.\n\nMatt Thomas scored all of his career-best 17 points in the fourth quarter, Terence Davis had 13 and Rondae Hollis-Jefferson 12. Chris Boucher had nine points and 11 rebounds.\n\nIndiana's 81 points were the fewest by a Toronto opponent this season. Orlando scored 83 points in a home loss to the Raptors on Nov. 29.\n\n\"One of those nights, you know?\" Indiana's Doug McDermott said. \"They played extremely well and we probably played our worst game of the year.\"\n\nDomantas Sabonis had 14 points and 11 rebounds, Aaron Holiday scored 14 points and Justin Holiday had 12 but the Pacers never recovered from an abysmal first quarter and lost for the first time in three games. Indiana has dropped seven of nine.\n\nPacers guard Victor Oladipo sat out because of back spasms, with Aaron Holiday starting in his place. Oladipo left Friday's road win over the Knicks after three quarters because of a sore back, and didn't practice Saturday.\n\nFriday was Oladipo's first game without a minutes restriction after he missed the first 47 games of the season while recovering from a ruptured tendon in his right knee.\n\nThe Pacers lost another guard with 9:54 remaining in the second quarter when Jeremy Lamb injured his left knee, landing awkwardly after being fouled by Davis on a fast-break drive. Lamb was able to shoot his free throws, but the Pacers immediately fouled to stop play and replace Lamb. He did not return.\n\nStill sore and hobbling after the game, Lamb said X-rays had come back negative, and that he will undergo an MRI Monday.\n\n\"Hopefully it's not too serious and I can get right back on the court,\" Lamb said.\n\nThe Pacers missed nine straight shots to begin the game and trailed 15-3 when Malcolm Brogdon scored their first basket on a layup with 6:57 remaining in the first. Indiana missed another five shots before Justin Holiday ended his team's 0-for-7 drought from 3-point range with 3:53 to play in the opening quarter.\n\nIndiana shot 4 for 23 in the first, finishing the quarter with as many turnovers as made baskets. Siakam and Ibaka each scored 11 points for Toronto, which led 34-12 after one.\n\n\"We dug ourselves a hole and couldn't get out of it,\" Sabonis said. \"We were getting open looks, we just weren't converting even easy ones under the basket. Then, as the game went on, we couldn't even get open.\"\n\nLowry scored 11 points in the second and the Raptors led 63-32 at the half. Indiana set a season low for first-half points, four fewer than they had against Milwaukee on Nov. 16.\n\nToronto led 85-55 heading to the fourth.\n\nTIP-INS\n\nPacers: Indiana starters combined to shoot 1 for 13 in the first. . Justin Holiday became Indiana's first double-digit scorer when he hit a 3 with 9:45 left in the fourth.\n\nRaptors: Toronto remained without C Marc Gasol (left hamstring) and G Norman Powell (broken finger, left hand). Gasol sat for the 10th straight game, and Powell missed his eighth. . F Patrick McCaw sat for the second straight game because of flu-like symptoms. . Toronto outscored Indiana 60-30 in bench points.\n\nSTARTING SLOW\n\nThe Pacers have scored 27 total first-quarter points in two games following the All-Star break. Indiana trailed 20-15 after one quarter against the Knicks on Friday, but rallied to win 106-98. New York was the opponent when Indiana recorded its lowest-scoring opening quarter of the season, 11 points on Feb. 1. The Knicks won that game 92-85.\n\nKEEPING IT CLEAN\n\nLamb said he had no problem with Davis trying to block his dunk attempt.\n\n\"I ain't upset about it,\" Lamb said. \"He tried to make a play on it and that happens all the time. He bumped me in the air and I hung on the rim. I don't think it was dirty or nothing like that.\"\n\nUP NEXT\n\nPacers: Host Charlotte on Tuesday night.\n\nRaptors: Host Eastern Conference-leaders Milwaukee on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995588.389201
}