{
  "game_id": "0022200827",
  "espn_id": "401468982",
  "date": "Feb 08, 2023",
  "matchup": "SAC @ HOU",
  "headline": "Fox's late FTs gives Kings 130-128 win over Rockets",
  "body": "HOUSTON -- — De’Aaron Fox had 31 points, including three free throws with less than a second left, to lift the Sacramento Kings to a 130-128 win over the Houston Rockets on Wednesday night. \n\n\r\n              Fox missed a 3-pointer with .3 seconds left. But Eric Gordon fouled him to set up the game-winning free throws. \n\n\r\n              “I don't want to belittle it because he was he was amazing, but at the end of the day that’s what he gets paid to do,” coach Mike Brown said. “He’s an All-Star. He’s one of our best players and he’s got to be able to make plays for us when we need him to, especially on the road and that’s what he did.”\n\n\r\n              Fox, who added 11 assists, made consecutive baskets to get the Kings within 1 with 42.2 seconds to go. \n\n\r\n              Jalen Green missed a shot on the other end before the Kings missed three straight shots but grabbed the rebound each time. Keegan Murray got the last rebound but Kenyon Martin Jr. battled with him, and a jump ball was called. Houston got the ball on the jump ball with 2.4 seconds to go. \n\n\r\n              Gordon was fouled after that, but Malik Monk stole the inbound pass from Alperen Sengun to give the Kings the ball with 1.2 seconds left. They called a timeout to set up the final sequence. \n\n\r\n              “We just have to be able to gut it out on the road,” Fox said. “Some times it's going to be ugly. This was an ugly game for us. We know we have to be better defensively.” \n\n\r\n              Green had 41 points and Sengun finished with 18 points, a career-high 11 assists and nine rebounds as the Rockets dropped their fourth straight. \n\n\r\n              Rockets coach Stephen Silas was disappointed that his team let this one get away after his team played much better than it did in a loss to the Kings on Monday night. \n\n\r\n              “We played with much more conviction, physicality, ball pressure, all those things,” he said. “We should have won that game.”\n\n\r\n              Domantas Sabonis added 22 points with nine rebounds for the Kings and Monk added 17 points. \n\n\r\n              Green made an off-balance 3 as he was fouled and crashed to the court with just more than two minutes left to put Houston up 124-123. Harrison Barnes was called for a foul on the play, but the Kings challenged the call, and it was overturned. \n\n\r\n              Green, the second overall pick in the 2021 draft, then scored four points to extend the lead to 128-123 with less than 90 seconds left. \n\n\r\n              Sabonis made a layup to get the Kings within four with about seven minutes left in the third. But he picked up his fifth foul seconds later and headed to the bench for the rest of the quarter.\n\n\r\n              The Kings scored five points, with a 3 from Monk, to take a four-point lead late in third. However, Houston ended the quarter with a 4-2 spurt to cut the lead to 99-97 entering the fourth. \n\n\r\n              Houston used a 6-1 run to take a 112-107 lead with eight minutes to go. The Kings then scored the next seven points, with a 3-point play by Harrison Barnes and four points from Fox, to go on top 114-112 a minute later.\n\n\r\n              Jae’Sean Tate hit a layup for the Rockets to tie it with less than five minutes to go. But a 7-2 run by the Kings, highlighted by a 3 from Murray, gave them a 121-116 lead with 3 1/2 minutes left. \n\n\r\n              A 5-0 spurt by the Rockets tied it after that before a layup by Sabonis put the Kings on top 123-121.\n\n\r\n              TIP-INS\n\n\r\n              Kings: Barnes had 16 points. ... Sacramento made 10 of 30 3-pointers. ... The Kings were outrebounded 44-31. \n\n\r\n              Rockets: Kevin Porter Jr. missed his 14th consecutive game with a left big toe injury. … Martin had 15 points. ... Tate added 16 off the bench. \n\n\r\n              GOING HOME\n\n\r\n              The Kings head home Wednesday night after going 4-3 on a season-high seven-game road trip. \n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Dallas for consecutive games Friday and Saturday night. \n\n\r\n              Rockets: Open a five-game road trip Friday night in Miami. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995297.6244779
}