{
  "game_id": "0021500408",
  "espn_id": "400828295",
  "date": "Dec 20, 2015",
  "matchup": "TOR vs. SAC",
  "headline": "Rondo, Gay lead Kings over Raptors 104-94",
  "body": "TORONTO -- Despite some impressive numbers, Rajon Rondo deflected praise after a big win Sunday.\nRondo had 19 points and 13 assists for his fourth consecutive double-double and 13th of the season and the Sacramento Kings beat the Toronto Raptors 104-94 to snap a four-game road losing streak.\nThe Kings point guard leads the NBA with an average of 11.2 assists per game, but he credited the team's defensive intensity for the wire-to-wire victory.\nKings forward Rudy Gay had 19 points against his former club, while DeMar DeRozan had a game-high 28 for the Raptors. Toronto's Kyle Lowry was ejected for consecutive technical fouls in the third quarter.\nDeMarcus Cousins was held to 15 points, but Rondo credited him for leading the way in with four blocks, nine rebounds and a game-high plus-minus of 33.\n\"I keep saying he's the best big in the league and tonight he proved it,\" Rondo said. \"He didn't do it with his scoring, but if you watched the game, people that know basketball would think that he dominated the game.\"\nCoach George Karl was pleased with the victory, particularly with the red-hot start that followed a lethargic first quarter in the Kings' last game, a 99-95 road loss against the Minnesota Timberwolves.\nThere was no sign of any hangover. Sacramento opened the game on a 17-2 run and at one point led by 22 points in the first quarter. It was the poorest first quarter of the season for the Raptors -- the Kings scored 37 points and ended the quarter up by 19, both season highs for a Toronto opponent.\nThe Raptors got 14 second-quarter points from DeRozan and another nine from Lowry to cut the advantage to 55-48 at halftime, fueled largely by a half-ending 26-11 run.\n\"We took maybe the best quarter we've played all year and took a seven-point lead into halftime,\" Karl said. \"That's the way it is on the road, it's not easy. Very seldom do you have a 10-point lead the whole game on the road, it just doesn't happen unless you just have one of those freak games.\"\nToronto coach Dwane Casey was left frustrated by his team, which saw its four-game home winning streak come to an end and is now 6-5 in the month of December.\n\"It's terrible,\" he said. \"I mean it's totally unacceptable the way we performed tonight.\n\"... Shame on us. The way you come into the game with that disposition of `OK, we're at home, we're OK.' It's not OK. How many times do we have to do that before it smacks us upside the head and wakes us up?\"\nThe Raptors narrowed the deficit to four on Patterson's 3-pointer with 4:29 remaining, but that was as close as they got as the Kings finished on a 10-2 run to wrap up a season sweep of Toronto.\nTHROWN OUT\nKyle Lowry was ejected with 7:22 remaining in the third quarter after receiving two technicals for seeming to argue with referee Scott Wall. Lowry now has seven technicals so far this season, tied for the league lead with Los Angeles Clippers forward Blake Griffin. He had eight last season. \"I guess I was trying to explain myself, trying to understand what I got the first one for,\" he said. \"I guess it just happened that I was there too long.\"\nSOLID STARTERS\nThe Kings had all five of their starters finish in double-digit scoring on Sunday, combining to shoot .534 in the victory.\nWRESTLING MATCH\nKings coach George Karl on point guard Rajon Rondo. \"I love him. It's going to be a love, anger, hate, complaining (kind of relationship), but he's a high basketball IQ guy. Right now he's our motor, he makes us go, he makes us go in a good way. I think he enjoys my philosophies a little bit, not 100 percent in agreement. I've always had wrestling matches with most of my point guards and this is not a bad wrestling match but we do have our wrestling match going on.\"\nTIP-INS\nKings: Rondo has 10 or more assists in each of his last six games and tied for the NBA lead in triple-doubles with four, one shy of tying Chris Webber's single-season Kings record from the 1999-2000 season. ... Sacramento is 7-2 this season when it shoots 50 percent from the field.\nRaptors: DeRozan reached 20 points for the seventh straight game. ... Anthony Bennett became the first No. 1 overall pick to play in the NBA's D-League when he asked to play in the Raptors 905's game against the Delaware 87ers on Sunday, four hours before tipoff against Sacramento. Bennett was the first overall pick in 2013 and was on the bench for the NBA game against the Kings but didn't see the floor. \"It's nothing but positive for himself conditioning-wise (and) for us when he comes back,\" Casey said. ... The Raptors shot 37.2 percent and are now 1-5 when they shoot below 40 percent.\nUP NEXT\nKings: Visit Washington on Monday night.\nRaptors: Host Dallas on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994745.544929
}