{
  "game_id": "0022400595",
  "espn_id": "401705161",
  "date": "Jan 19, 2025",
  "matchup": "OKC vs. BKN",
  "headline": "Gilgeous-Alexander has 27 points, 10 assists to lead Thunder past Nets 127-101",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had 27 points and 10 assists in three quarters, and the Oklahoma City Thunder beat the Brooklyn Nets 127-101 on Sunday night.\n\n\r\n              Gilgeous-Alexander, the NBA's leading scorer, sat out Friday’s loss at Dallas with a sprained right wrist. He looked fine against the Nets — he made 8 of 14 field goals and all 10 of his free throw attempts. He also had four steals.\n\n\r\n              Isaiah Joe scored 24 points and made eight 3-pointers for the Thunder.\n\n\r\n              The Thunder have the best record in the Western Conference, and the victory clinched Oklahoma City coach Mark Daigneault’s spot as an All-Star head coach. He will coach one of the four All-Star teams and an assistant coach from his staff will be the head coach for another team.\n\n\r\n              Cam Johnson and Tyrese Johnson each scored 15 points for the Nets, who have lost eight of nine.\n\n\r\n              Oklahoma City made 9 of 13 3-pointers in the first quarter to take a 39-19 lead. The Thunder continued to roll in the second quarter and led 69-49 at halftime. Gilgeous-Alexander and Joe each had 15 points at the break.\n\n\r\n              Oklahoma City continued to dominate in the second half, expanding its lead to 29 points in the closing minutes.\n\n\r\n              Takeaways\r\n              Nets: Brooklyn shot just 42.5% against the Thunder, who lead the league in defensive rating. \n\n\r\n              Thunder: Daigneault, last season's NBA Coach of the Year, might be doing a better job this year. He once again found a way to manage an injury-riddled roster and not miss a beat. Jalen Williams, Oklahoma City’s No. 2 scorer for the season, sat out this game with a strained right hip and center Isaiah Hartenstein was out with a strained left calf.\n\n\r\n              Key moment\r\n              Ousmane Dieng's one-handed jam on a fast break put Oklahoma City ahead 32-7 in the first quarter. It was the highlight of an 18-0 run.\n\n\r\n              Key stat\r\n              Oklahoma City shot 61.9% from the field and 61.1% from 3-point range (11 of 18) in the first half. \n\n\r\n              Up next\r\n              Nets host the New York Knicks on Tuesday, and Thunder host Utah on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997506.8934479
}