{
  "game_id": "0022200321",
  "espn_id": "401468476",
  "date": "Nov 30, 2022",
  "matchup": "CHI @ PHX",
  "headline": "Devin Booker scores 51 points in 3 quarters, Suns rout Bulls",
  "body": "PHOENIX -- — Devin Booker made the Chicago Bulls pay for some mediocre defense with a couple early mid-range jumpers. Then he made a few more. And a few more.\n\n\r\n              Suddenly, it was one of those nights for the Suns All-Star guard.\n\n\r\n              “It felt like a double-sized rim out there,” Booker said. “If I rise up, it’s going in.”\n\n\r\n              Booker scored a season-high 51 points in just three quarters, Deandre Ayton had 30 points and 14 rebounds and Phoenix stretched its winning streak to six games with a 132-113 victory Wednesday night.\n\n\r\n              Booker scored 25 points in the first half and had 26 more in a sublime third quarter that included 10 of 11 shooting. After a contested 3-pointer splashed through the net, “MVP! MVP!” chants broke out across Footprint Center, and the 26-year-old is certainly making an early season case.\n\n\r\n              “It’s the best,” Booker said about the home crowd. “I don’t know how many sellout crowds that is in a row, but it’s impressive. Mondays, Tuesdays, Saturdays, it doesn’t matter what day of the week it is. They show up and show out.”\n\n\r\n              The three-time All-Star had a steal late in the third before sprinting downcourt and flushing home a dunk for his 50th and 51st points. He added six assists and four rebounds.\n\n\r\n              \"A guy like that gets in a rhythm and it’s too late,\" Bulls guard Zach LaVine said. “He gets it going and it’s over.”\n\n\r\n              Booker didn't play in the fourth quarter with the Suns holding a healthy lead.\n\n\r\n              Even more remarkable than Booker's point total was his efficiency. He shot 20 of 25 from the field, going 6 of 7 from 3-point range. He is the second player over the last 25 years with 50 points and 80% shooting through the first three quarters of a game, joining James Harden in 2017, according to ESPN Stats and Info.\n\n\r\n              “There's not a level where he can't score,” Suns coach Monty Williams said. “He can use both hands, he can score with a hand in his face and he's willing to take the tough shots.”\n\n\r\n              It was Booker's second straight 40-point game. He had 44 in a victory at Sacramento on Monday night. The Suns have the best record in the Western Conference at 15-6 and have won 12 out of 13 home games.\n\n\r\n              The Bulls struggled on defense the entire night, particularly against Booker and Ayton. Chicago coach Billy Donovan was particularly irritated in the third quarter, angrily calling a time out after Phoenix scored a couple easy buckets.\n\n\r\n              DeMar DeRozan led Chicago with 29 points. Zach LaVine added 21.\n\n\r\n              The Suns took a 64-43 lead at halftime. Booker roasted the Bulls with 25 points before the break, repeatedly finding open mid-range jump shots. \n\n\r\n              “We threw everything at him,” Donovan said. \"We trapped him, we threw a box and one at him. We tried to face guard him and to his credit had had a great night.\n\n\r\n              Phoenix shot 58% in the first half. Chicago made just 1 of 14 (7.1%) of its 3-point attempts.\n\n\r\n              TIP-INS\n\n\r\n              Bulls: Alex Caruso scored 14 points off the bench. ... The Bulls shot 4 of 25 (16%) from 3-point range.\n\n\r\n              Suns: G Chris Paul missed his 11th consecutive game with right heel soreness. ... It was Booker's 21st career game with at least 40 points. ... Landry Shamet added 12 points off the bench. ... Hosted a 39th consecutive sellout crowd. ... Ayton shot 11 of 18 from the field. ... Booker's 51 points were the most ever scored by a Suns player at Footprint Center. Gilbert Arenas has the record for any player with 54.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Golden State on Friday.\n\n\r\n              Suns: Host Houston on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994294.979588
}