{
  "game_id": "0021601028",
  "espn_id": "400900423",
  "date": "Mar 18, 2017",
  "matchup": "OKC vs. SAC",
  "headline": "Westbrook leads Thunder past Kings without triple-double",
  "body": "OKLAHOMA CITY --  Russell Westbrook didn't get a fifth straight triple-double, but the Oklahoma City Thunder won their fifth straight game and that was all he cared about Saturday.\n\nWestbrook had 28 points, eight rebounds and 10 assists to help the Thunder roll past the Sacramento Kings 110-94. Oklahoma City has the longest current winning streak in the NBA and it's moved the Thunder into a tie for fifth in the Western Conference, pending the result of the Los Angeles Clippers' game against Cleveland later Saturday.\n\n\"We're getting it together, man,\" Westbrook said. \"We had new guys coming in fresh off trades. We just had to find ways to get guys going. It's not always easy to be able to do that.\"\n\nWestbrook had a triple-double in each of the first four games of the streak to raise his season total to 34. He needs seven more in Oklahoma City's final 13 games to tie Oscar Robertson for the NBA single-season record, set in the 1961-62 season.\n\nSacramento kept the game just close enough in the fourth quarter that Westbrook didn't leave the game for good until 58.6 seconds remained. He said he wasn't paying attention to his stats -- \"I just play, bro,\" he said when questioned about it -- and Thunder coach Billy Donovan insisted the same.\n\n\"I don't follow it during the game,\" Donovan said. \"I have no idea. Any time I'm making a decision, it's never a decision being made on somebody's statistical line. I'm just trying to do what I can to help our team be put in a position to win and play to the best of our ability.\"\n\nGeorgios Papagiannis had 14 points and 11 rebounds for Sacramento, which had a two-game winning streak snapped.\n\nA 7-0 run, capped by a basket by Buddy Hield, gave Sacramento its only lead at 10-9 less than six minutes into the game. Steven Adams' dunk started an 11-0 spurt by the Thunder and the Kings came no closer than eight points the rest of the game.\n\nThe Thunder pushed its lead to 22 points in the second quarter and led 63-41 at halftime after last-minute 3-pointers by Victor Oladipo and Westbrook.\n\nSacramento came no closer than 14 points in the second half, on a put-back dunk by Skal Labissiere that made it 87-73 with 9:18 left. Westbrook re-entered the game, converted a three-point play, then assisted on a basket by Oladipo and a 3-pointer by Doug McDermott, pushing the Thunder's lead to 95-75.\n\n\"This is the fun time of year, when you're fighting for playoff position, you're fighting for home-court advantage,\" Sacramento coach Dave Joerger said. \"They played fantastic and we learned a lot, especially the first half. . The second half, we kind of got ourselves up off the floor and picked up our level of intensity physically. We just talked about getting better and learning from this game and that is hopefully where we'll be in a couple of years if we keep taking steps forward.\"\n\nTIP-INS:\n\nKings: Tyreke Evans didn't suit up due to what the team called a sore left ankle and Aaron Afflalo and Ben McLemore also skipped the game for personal reasons, leaving the Kings with only 11 players. ... Labissiere celebrated his 21st birthday by picking up three fouls in his first four minutes and scoring 13 points. His 32-point, 11-rebound outing on Wednesday in a win at Phoenix made him the first Kings rookie with at least 30 points and 10 rebounds in a game since Lionel Simmons on April 9, 1991, against Dallas. ... Hield, who led Oklahoma to last year's Final Four, received a loud ovation during pregame introductions.\n\nThunder: Westbrook has 71 career triple-doubles and needs seven more to tie Wilt Chamberlain for fourth on the NBA all-time list. ... The Thunder are the sixth Western Conference team to win 40 games this season. ... Adams recorded his 13th double-double of the season with 16 points and 13 rebounds.\n\nAGGRESSIVE McDERMOTT\n\nMcDermott had his highest-scoring game with the Thunder since being acquired from Chicago on Feb. 23, going 8 of 9 from the field, including 4 of 5 from 3-point range, and finishing with 21 points. He said he's making a point to be more aggressive off the dribble.\n\n\"I've been working on it because they are flying at me pretty hard,\" he said. \"I have to have alternatives. . I just got into a good rhythm early. I got out in transition and hit some shots which got my confidence going.\"\n\nUP NEXT:\n\nKings: Finish a difficult road back-to-back at San Antonio on Sunday.\n\nThunder: Host Golden State -- missing the injured Kevin Durant -- on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995255.300926
}