{
  "game_id": "0021600239",
  "espn_id": "400899689",
  "date": "Nov 25, 2016",
  "matchup": "HOU @ SAC",
  "headline": "James Harden-led Rockets set mark with 50 3-point tries in win",
  "body": "SACRAMENTO, Calif. -- Three weeks ago, Ryan Anderson scoffed at the idea of Houston becoming the first team in NBA history to attempt 50 3-pointers in one game. Now that it happened, Anderson is fully convinced the Rockets can and will do it again.\nJames Harden had 23 points, 10 rebounds and 10 assists in his fourth triple-double of the season, and the Houston Rockets set an NBA record with 50 3-point attempts in a 117-104 victory over the Sacramento Kings on Friday night.\n\"That's this style of play that we built around James . and we have shooters,'' said Anderson, who made three 3s and scored 13 points. \"The great part about it, it didn't seem like we took 50. They were in rhythm, they were good looks and those are shots we normally take.''\nThe Rockets went 21 of 50 from beyond the arc and came within two makes of matching the single-game record they already share with the Orlando Magic.\nThe Rockets made eight 3s in the first quarter, six in the second, three in the third and four in the fourth.\n\"I don't mind it but I'll like to get the record for the most makes, not just the most attempts,'' Houston coach Mike D'Antoni said. ``If that's what they're giving us, that's what we'll take. We had good looks, and if a guy has a good look then he's free to shoot it.''\nTrevor Ariza added 18 points and nine rebounds, while Clint Capela scored 17 points to lead Houston to its eighth win in the last nine games between the teams.\nDeMarcus Cousins had 32 points and nine rebounds for Sacramento despite being hindered by foul trouble much of the second half. Cousins made four consecutive 3-pointers late in the fourth quarter when the Kings pulled within 112-104.\n\"If we want to be the team that just lets teams come in here with automatic 'W's . that's just what's going to happen if we continue to play this way,'' Cousins said. \"We've got to hold ourselves accountable, take responsibility for it and change these mistakes. This probably won't be the last time we see a team get hot like that.''\nSacramento coach Dave Joerger said the Kings' slow start was too much to overcome.\n\"We didn't come in and bring enough force early in the game,'' Joerger said. ``They came in very focused, we came in definitely too slow. They got too many loose balls (and) made 3s.''\nAriza led Houston's 3-point barrage, going 6 of 11. Eric Gordon added four while Ryan Anderson and Harden added three apiece. Gordon finished with 14 points, one of seven Rockets in double figures.\nTIP-INS\nRockets: Houston led by as much as 29 but had to hold off Sacramento's late surge to win in the opener of its five-game road trip. . Ariza made four 3s in the first quarter. . Anderson grew up just outside of Sacramento and was a big Kings fan. . Nene had three fouls in the first half.\nKings: Coach Dave Joerger juggled his lineup after halftime and replaced Ty Lawson with Arron Afflalo. Afflalo started 14 of Sacramento's first 15 games but Joerger has been experimenting with a smaller backcourt at times. ... Joerger was given a technical foul in the fourth quarter.\nROCKETS' DEEP STREAK\nHouston has made at least 10 3-pointers in its last 15 games, one shy of the NBA record set last year by Golden State and matched later in the season by Cleveland. The Rockets last failed to reach double digits beyond the arc in the season opener, when they made seven.\nUP NEXT\nRockets: Play at Portland on Sunday in the second meeting between the teams this season. Houston beat the Trail Blazers 104-83 on Nov. 17.\nKings: Travel to Brooklyn to face the Nets on Sunday. Cousins averaged 32 points and more than 11 rebounds in two games against Brooklyn in 2015.",
  "source": "espn_api",
  "crawled_at": 1764995787.612988
}