{
  "game_id": "0021900927",
  "espn_id": "401161569",
  "date": "Mar 05, 2020",
  "matchup": "LAC @ HOU",
  "headline": "Kawhi Leonard has 25 points, Clippers rout Rockets 120-105",
  "body": "HOUSTON --  Kawhi Leonard scored 25 points and the Los Angeles Clippers rolled over the Houston Rockets 120-105 on Thursday night for their sixth straight victory.\n\nThe Rockets were done in by their shooting woes in a game that was billed as a matchup of two of the top teams in the Western Conference, but was a rout almost from the start. Houston had a chance to take the season series and secure the tiebreaker over the Clippers, but the loss left the teams tied 2-2.\n\nLos Angeles coach Doc Rivers was asked about Houston's small-ball lineup where they play without a true center.\n\n“What they do is smart for what they do, it really is, but we couldn't get caught in trying to play that way and I thought we didn't,\" he said. “We stayed calm, moved the ball, found the open guy and our bigs were big.\"\n\nHouston made just 7 of 42 3-pointers to drop its second straight game in embarrassing fashion after losing to the lowly New York Knicks on Monday night. The Rockets ended their streak of 18 straight games with 10 or more 3-pointers dating to Jan. 20.\n\nRussell Westbrook led the Rockets with 29 points and 15 rebounds. James Harden was 4 of 17 and missed all eight 3-pointers he attempted to finish with 16 points. The two stars and most of the other starters on both teams didn't play for much of the fourth quarter with the game out of reach.\n\n“We just didn't do what we were supposed to do on both ends of the floor,\" Harden said. “They made some tough shots. Defensively, we weren't in our spots and we didn't do what the game plan was.\"\n\nThe Clippers built a 67-44 lead by halftime after a first half where the Rockets made just 2 of 22 3-point attempts. Ivica Zubac added 17 points and 12 assists for Los Angeles and Montrezl Harrell added 19 points and 10 rebounds off the bench.\n\n“We positioned ourselves in the right place so even when we got deep, we either had Trez (Harrell) or Zu (Zubac) back there when they swung it out,\" Rivers said. “When you do that and make guys take contested threes it's a little harder.\"\n\nHouston’s shooting woes didn’t end after the break and the Rockets missed 11 of 12 3-pointers in the third quarter, including a couple of air balls. But the Rockets didn’t just struggle from long-range as they also missed several layups in the quarter to leave Los Angeles up 90-65 entering the fourth.\n\n“It's a great learning experience for us on both ends of the (floor),\" Harden said. “We've got 21 games left to prepare ourselves for the bigger picture. So we watch film tomorrow and get better and be ready to go for the next game.\"\n\nTIP-INS\n\nClippers: Patrick Beverley received a flagrant 1 foul for grabbing Harden with both arms from behind on a fast break in the third quarter. ... Paul George had 13 points, nine rebounds and seven assists.\n\nRockets: Eric Gordon left the game in the fourth quarter with knee soreness and did not return. ... Westbrook extended his career-best streak of games with 20 points or more to 32. ... Danuel House Jr. had 14 points.\n\nFACE-OFF\n\nThe Clippers were unhappy early in the fourth quarter when Harrell received a foul on a dunk attempt by Westbrook. Replays showed that\n\ninto Harrell’s face as he elevated for the shot. But a challenge by Clippers coach Doc Rivers was unsuccessful and the foul call stood.\n\nHarrell made a dunk soon after that and patted his head with both hands as he ran back down the court.\n\nUP NEXT\n\nClippers: Host the Los Angeles Lakers on Saturday night.\n\nRockets: At Charlotte on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764996488.7446709
}