{
  "game_id": "0022400801",
  "espn_id": "401705367",
  "date": "Feb 21, 2025",
  "matchup": "HOU vs. MIN",
  "headline": "Jalen Green scores 35 points to lead Rockets past Timberwolves 121-115",
  "body": "HOUSTON -- — Jalen Green scored 35 points, Alperen Sengun added 24 points and 13 rebounds and the Houston Rockets defeated the Minnesota Timberwolves 121-115 on Friday night.\n\n\r\n              Green finished 12 of 24 from the floor and was 5 of 11 on 3-pointers. Amen Thompson finished with 17 points, 10 rebounds and six assists for Houston, which shot 50%, including 13 of 26 on 3-pointers.\n\n\r\n              Jabari Smith Jr had 15 points and nine rebounds off the bench in his first game back after missing 22 games with a broken bone in his left hand.\n\n\r\n              Anthony Edwards scored 37 points on 13-of-32 shooting, including 4 of 14 on 3-pointers. Edwards scored 25 points in the first half on 8-of-15 shooting, including 3 of 7 on 3-pointers.\n\n\r\n              Naz Reid had 22 points and eight rebounds, Jaden McDaniels added 21 points and Nickeil Alexander-Walker had 16 points for Minnesota, which shot 45%, including 11 of 39 on 3-pointers.\n\n\r\n              Takeaways\r\n              Timberwolves: Mike Conley returned to the lineup after missing four games with a sprained right index finger, but he was in foul trouble for most of the night and finished with five points in 24 minutes.\n\n\r\n              Rockets: One area that coach Ime Udoka pointed to before the game where Smith’s return would help was rebounding. Houston outrebounded the Timberwolves 48-35.\n\n\r\n              Key moment\r\n              Tied at 108, Green made a 3-pointer with five minutes remaining to kickstart Houston’s 9-2 run to open up a seven-point lead with 48 seconds left.\n\n\r\n              Key stat\r\n              Edwards was 1 for 6 in the fourth quarter, including 1 of 4 on 3-pointers. He scored 3 points in the quarter as Houston sent double teams at him.\n\n\r\n              Up next\r\n              Minnesota hosts Oklahoma City on Sunday night, while Houston travels to Utah on Saturday night.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997366.417174
}