{
  "game_id": "0021500507",
  "espn_id": "400828394",
  "date": "Jan 03, 2016",
  "matchup": "CHI @ TOR",
  "headline": "Butler tops Jordan Bulls record with 40 points in half",
  "body": "TORONTO --  For one half, Jimmy Butler was better than Michael Jordan.\n\nThat's all it was, Butler said. One half. Still, it was an amazing run.\n\nButler broke the Hall of Famer's team record for points in a half, scoring 40 of his 42 after the break to lead the Chicago Bulls over the Toronto Raptors 115-113 on Sunday.\n\nJordan had 39, also in the second half, in a game against Milwaukee in 1989. Butler shot 14 of 19 in the final two quarters after a 1-for-4 start in the Bulls' fourth straight win.\n\n\"Don't compare me to him,\" Butler said. \"I don't want to be compared to him because then people are going to think I got to do what he did. I'm trying, but we're nowhere near the same player.\"\n\nOne of Jordan's teammates was pretty impressed, though.\n\n\"What a performance by (at)JimmyButler. You don't see individual efforts like this too often,\" Scottie Pippen said in a tweet.\n\nButler's performance came after he got stitches in his mouth. He was accidentally elbowed by DeMarre Carroll in the second quarter after making a basket. He needed one stitch to close the wound and ready him for the second half.\n\n\"I was mad but I just came out and was just aggressive,\" he said.\n\nHe scored 21 points in the third quarter, the most the Raptors have given up to an opponent in a single quarter this season, shooting 7 of 9 from the floor and making all seven of his free throw attempts.\n\nIn the fourth, Butler put the Bulls in front with a 3-pointer from the corner with 30.9 seconds to go to give Chicago its first lead since early in the second. A pair of free throws by Butler closed out the victory shortly afterward.\n\nHis coach was in awe of Butler's outing.\n\n\"I'll say this: It's the best performance I've seen coaching,\" said Fred Hoiberg.\n\nThe Bulls coach was also full of praise for the way his team responded in the second half, commenting that the four-game winning streak that his club is now on closed out \"a very important week for us.\"\n\nButler's teammates were equally complimentary.\n\n\"It's not just that he scored a lot of points, he did it in a very efficient way and he did it in a way that was critical for us to win the ballgame,\" said Pau Gasol, who registered his 17th double-double of the season with 19 points and 13 rebounds.\n\nWhile Raptors coach Dwane Casey said he tried everything to slow Butler down, he was also upset about being in front for the majority of the game and failing to close out the victory. The Raptors haven't beaten the Bulls since Dec. 31st, 2013.\n\n\"We can't give up 34 points in the fourth quarter,\" he said. \"You have to put your foot down, put your foot on their neck and close it out. I thought we had control up to that point, but we just didn't put our stamp on it in the fourth quarter defensively.\"\n\nDeMar DeRozan, who led the Raptors with 24 points and made a season-high three 3-pointers, had a chance to win the game at the end with a 3-pointer, but his shot narrowly missed, hitting the rim and bouncing clear.\n\n\"I thought I had a good look at the end for the 3,\" he said. \"I thought it was good.\"\n\nLOWRY AT THE DOUBLE\n\nToronto guard Kyle Lowry earned his second straight double-double and fifth of the season with 22 points and a game-high 10 assists. Lowry is now averaging 8.7 assists over his last six games.\n\nQUOTABLE\n\nButler on the elbow from Carroll that required stitches: \"He didn't do it on purpose but he messed my swagger up so I can't go on a date for a while.\"\n\nNO ROSE\n\nDerrick Rose sat out his third straight game with a right hamstring injury, although Hoiberg said, \"it is definitely getting better.\" Rose will undergo an MRI on Monday on the knee, the same knee he has previously had two surgeries on.\n\nTIP-INS\n\nBulls: The Bulls are 17-3 when outrebounding their opponent. ... Chicago has scored 100-plus points in seven straight games. ... Butler's streak of 40 games with at least one steal is the longest active streak in the NBA, and the longest of Butler's career.\n\nRaptors: The Raptors embark on a five-game road trip, which includes an NBA Global Game in London against the Orlando Magic on Jan. 14.\n\nUP NEXT\n\nBulls: host Milwaukee on Tuesday night.\n\nRaptors: visit Cleveland on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764993939.6087182
}