{
  "game_id": "0022200036",
  "espn_id": "401468191",
  "date": "Oct 22, 2022",
  "matchup": "LAC @ SAC",
  "headline": "Paul George scores 40 as Clippers edge Kings 111-109",
  "body": "SACRAMENTO, Calif. -- — Paul George scored 40 points to help the Los Angeles Clippers hold off the Sacramento Kings 111-109 on Saturday night.\n\n\r\n              It was the 20th time that George scored 40 points, including playoffs, and his fifth as a member of the Clippers.\n\n\r\n              “I know I'm able to be the No. 1 option,” George said. “I'm very aware and very confident in my abilities.” \n\n\r\n              De'Aaron Fox scored with 41.4 seconds left to cap a 15-6 Sacramento run, one that pulled the Kings from 12 points down to 109-106. George missed a 3-pointer on the next Clippers' possession, but Nicolas Batum grabbed the offensive rebound and Norman Powell knocked down two free throws to seal the win.\n\n\r\n              “I thought he took his time and got to his spots,” Clippers coach Tyronn Lue said of George. “Down the stretch he really carried us ... he has to be aggressive. (George and Kawhi Leonard) have to play at a high level and produce for us to win games.”\n\n\r\n              The Clippers (2-0) were missing Leonard and new acquisition John Wall, who were both out because of knee injury management. They traveled with the team to Sacramento and worked out pregame.\n\n\r\n              Leonard played 21 minutes on Thursday in his first game since he tore a ligament in his right knee in a playoff game in June 2021. Wall appeared in his first NBA game in 18 months after sitting out last season in Houston. Both are expected to play in the Clippers' home opener Sunday.\n\n\r\n              Reggie Jackson had 14 points for the Clippers, and Ivica Zubac had 10 points and eight rebounds.\n\n\r\n              Fox had 36 points to lead the Kings and rookie Keegan Murray added 19 in his first NBA game. Kevin Huerter had 18 points, hitting five 3-pointers. Domantas Sabonis added 11 points, 10 rebounds and seven assists. \n\n\r\n              Mike Brown is still seeking his first win as Kings head coach.\n\n\r\n              “I thought tonight we competed a little closer to 48 minutes than we did the other night,\" Brown said. “There’s no moral victories but I thought we did trend this way (points up) tonight.”\n\n\r\n              KINGS HONOR BROWN\n\n\r\n              The Kings held a moment of silence before the game for longtime referee Tony Brown, who died Thursday at age 55 from pancreatic cancer. Brown officiated more than 1,100 regular-season games and 35 playoff games.\n\n\r\n              MURRAY SHINES IN DEBUT\n\n\r\n              Murray made his NBA debut after sitting out Sacramento’s season opener on Wednesday.\n\n\r\n              Murray, the 22-year-old selected fourth overall out of Iowa, checked into the game with 7:28 left in the first quarter to a standing ovation from the home crowd. His 19 points was the third-most by a Kings rookie in a season debut.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Los Angeles was called for two delay-of-game technicals. ... Los Angeles has won 15 of the last 20 matchups against the Kings.\n\n\r\n              Kings: Sacramento shot 15 for 26 from the free throw line, which led to fans booing in the third. … Sacramento is 0-2 for the first time since 2019, when it started the season 0-5. “As a team, we have to be able to step up there and make free throws,” Fox said. “We know that can win and lose games.” \n\n\r\n              Fox also scored over 30 in the season opener. He's just the fourth player in franchise history with 30 points or more in their first two contests of a season.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host Phoenix on Sunday night in Los Angeles’ home opener.\n\n\r\n              Kings: At Golden State on Sunday night for Sacramento’s first road game of the season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995003.0531719
}