{
  "game_id": "0021800901",
  "espn_id": "401071574",
  "date": "Feb 25, 2019",
  "matchup": "PHX @ MIA",
  "headline": "Forty-point fourth quarter helps Suns snap 17-game slide",
  "body": "MIAMI -- Devin Booker came into his final matchup against Dwyane Wade looking to be the next player on the list of those who have snared a retirement-season jersey from the Miami star.\nTurns out, the jersey wasn't even the biggest prize.\nBooker scored 20 points, Phoenix played a nearly flawless fourth quarter and the Suns snapped their club-record 17-game losing streak by topping the reeling Heat 124-121 on Monday night. The Suns shot 78 percent in the final period, and scored 72 points after halftime to stun a Heat team that dropped its sixth straight home game.\n\"It feels like we're out,\" Booker said. \"It feels like we were in prison.\"\nDeandre Ayton offered an even more-succinct analysis: \"Hallelujah,\" said the Suns' rookie and No. 1 pick in last year's draft.\nFormer Heat guard Tyler Johnson scored 18 points for Phoenix, which hadn't won since Jan. 12. Jamal Crawford and Kelly Oubre Jr. each had 16 and were huge down the stretch for Phoenix, while Ayton and Troy Daniels each had 14 and Josh Jackson scored 11 for the Suns.\nHassan Whiteside scored 29 points and Kelly Olynyk added 28 for the Heat, who have dropped six straight at home for the second time this season. Missing four often-starters or regular rotation players, Miami went largely with an eight-man rotation and could barely get any stops in the final quarter.\n\"It went back and forth until we ran out of time,\" said Wade, who scored 13. \"It's obviously unfortunate. This game hurts.\"\nPhoenix improved to 2-42 this season when trailing after three quarters, and snapped a 42-game losing streak in road games when trailing entering the final period.\n\"We played desperate, we played with a sense of urgency and we came here not just to play -- we came to win a game,\" Suns coach Igor Kokoskov said. \"And I'm glad we did.\"\nAfter the Booker free throws, the next Miami possession saw Wade miss a turnaround jumper even after getting a good look over the 7-foot Ayton. Bam Adebayo had a chance at the tip-in, couldn't get it to fall, and Oubre went to the line with 2.1 seconds left. He made both, Miami had no time-out left to call, and Wade's desperation 55-footer wasn't close.\n\"Ball didn't go in the hole, bruh,\" Adebayo said of the missed tip. \"Not going to sleep over that one tonight.\"\nJohnson got the return to Miami he wanted -- a win against his former club.\nNow, he can resume rooting for the Heat, even after he helped deal their quest for an Eastern Conference playoff berth a serious blow.\n\"These are my guys,\" said Johnson, who was traded earlier this month. \"Obviously, I want to see them be successful. I would never wish for anything negative on their careers. Luckily I'm in the opposite conference, so it is a little bit easier to cheer for them. I hope they figure it out. I know they will.\"\nTIP-INS\nSuns: Amid all the losing, it's perhaps difficult to remember that Phoenix has beaten Milwaukee, Denver, Boston and San Antonio this season. ... The Suns shot 51 percent for the game and 62 percent in the second half.\nHeat: This is now the second season in franchise history with multiple home losing streaks of six or more games. The 2007-08 Heat had a six-game and two seven-game home slides. ... Miami lost despite scoring 70 points in the paint. ... The Heat were without James Johnson (shoulder), Rodney McGruder (knee), Justise Winslow (knee) and Derrick Jones Jr. (flu).\nMISERY HAS COMPANY\nPhoenix avoided joining New York as the second team to have an 18-game losing streak this season. This would have been the first NBA season since 1981-82 in which multiple franchises have lost at least 18 consecutive games; that season, Utah (18), Cleveland (19) and the San Diego Clippers (19) endured such a streak.\nWADE VS. SUNS\nWade played against the Suns for the 23rd and final time. The Heat were 17-5 with him against Phoenix, and Chicago went 1-1 against the Suns in Wade's one season as a member of the Bulls. He averaged 22.9 points in the 23 games against the Suns.\nUP NEXT\nSuns: Host New Orleans on Friday. The Suns are starting a four-game homestand.\nHeat: Host Golden State on Wednesday. The Heat lost 120-118 to the Warriors on Feb. 10.\n---\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995059.820896
}