{
  "game_id": "0021800955",
  "espn_id": "401071628",
  "date": "Mar 04, 2019",
  "matchup": "MIL @ PHX",
  "headline": "Oubre, Booker help Suns stun Bucks",
  "body": "PHOENIX --  The Phoenix Suns have had a dreadful season, one of growing pains, long losing streaks and blowout losses. However, on Monday night they put together a performance that was far from that of the team that came in with the NBA's worst record.\n\nKelly Oubre Jr. had 27 points and 13 rebounds, and the Suns rallied from a 10-point fourth quarter deficit to beat the NBA-best Milwaukee Bucks 114-105 on Monday night.\n\n\"We can't back down when a team goes on a run,\" Oubre said. \"We've got to make our own, too, coming back at them.\"\n\nDevin Booker added 22 points and Deandre Ayton had 19 points and 12 rebounds, including a key layup with 35.8 seconds to play that gave the Suns a four-point lead.\n\nBooker and Ayton teamed up on the play when Ayton rolled to the basket.\n\n\"He preached to me all the time about that move, about how guys overplay him sometimes and how the lane is right there for me,\" Ayton said.\n\nThe Suns outscored the Bucks 38-23 in the final quarter and swept the two-game season series with Milwaukee.\n\nAll-Star Giannis Antetokounmpo had 21 points and 13 rebounds, and Malcolm Brogdon scored 19 points for the Bucks, who have lost two straight games for the first time this season. Milwaukee shot 36.8 percent as a team.\n\n\"It's kind of hard to think we lost to Phoenix twice,\" Antetokounmpo said. \"But they played better than us. They came out there and set the tone.\"\n\n\"I don't think we take them as seriously as we should,\" Brogdon said. \"It's just a lack of focus.\"\n\nThe Bucks led by 16 points in the first half, only to trail by three in the third quarter.\n\nMilwaukee, the team with the NBA's best road record coming in, couldn't put away Phoenix in the final quarter.\n\nBooker swished a 3-pointer with 2:37 to go for a 100-98 Suns lead, and Oubre's corner 3 made it 103-100. Brogdon got a favorable high bounce on a 3 to tie it, but Tyler Johnson and Ayton scored the next two baskets unanswered for the Suns.\n\nThe Suns finished by making seven of eight free throws in the final 24.1 seconds.\n\n\"We're finding our rhythm. We're finding ways to pull out games,\" Oubre said.\n\nThe Bucks took a 31-20 lead into the second quarter. They were up 40-24 after Lopez made a 3 with 8:32 to play in the first half.\n\nThe Suns cut the lead to 54-52 at halftime. Johnson and Josh Jackson knocked down back-to-back 3s to cap off a 10-0 run over the last 90 seconds of the first half.\n\nBooker's 3 with 10:02 left in the third tied the score at 55, and the Suns took their first lead of the game, 64-63, on Ayton's 12-footer with 5:35 to go in the quarter. Then Johnson's steal and layup had the Suns up 70-67.\n\nTIP-INS\n\nBUCKS: F Pau Gasol made his Bucks debut after signing on Sunday, and played five minutes. His contract was bought out by the San Antonio Spurs last week, making him playoff eligible. ... Ersan Ilyasova played despite some left hamstring irritation and scored 11 points with 10 boards. ... Milwaukee Brewers outfielder Christian Yelich, the 2018 National League MVP, sat courtside for the game.\n\nSUNS: F T.J. Warren missed his 16th straight game with ankle soreness. ... Oubre blocked a career high-tying three shots, two in the third quarter. ... Ayton was assessed a technical foul for expressing his displeasure at a call in the third quarter. ... The Suns blocked a season high 10 shots, and tied a season high with 56 rebounds.\n\nAN EXTENSION FOR BLEDSOE\n\nThe Milwaukee Bucks announced the signing of Bledsoe to a contract extension before he took the court against his former team, which traded him to Milwaukee in November 2017. Bledsoe heard boos from Suns fans during the game, likely because of how he expressed his desire to be dealt via social media.\n\n\"Just very excited for Eric and for our organization. He's certainly earned an extension, and he's been a huge part of what we've done to date,\" Bucks head coach Mike Budenholzer said. \"Certainly we think he's a huge part of what we're doing going forward, obviously not this year but for the next three or four years.\"\n\nBledsoe, who woofed at the Suns bench after shots he made on that end of the court in the first half, missed the Bucks' last game, Saturday at Utah, with back soreness. He scored 15 points and has started all 62 games he has played this season.\n\nUP NEXT\n\nBucks: Return home to host Indiana on Thursday night.\n\nSuns: Host New York on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994464.373696
}