{
  "game_id": "0021900777",
  "espn_id": "401161419",
  "date": "Feb 08, 2020",
  "matchup": "MIL @ ORL",
  "headline": "Giannis just misses triple-double, Bucks beat Magic 112-95",
  "body": "ORLANDO, Fla. --  A slow start didn't help Giannis Antetokounmpo's shot at NBA history, but the Milwaukee Bucks are hardly a one-man show.\n\nKhris Middleton hit a 3-pointer less than 20 seconds into the game, and the team with the league's best record never trailed Saturday night in a 111-95 victory over the Orlando Magic. It's the 13th time the Bucks have led from wire to wire this season.\n\n\"It's nice to not trail ... but it doesn't really mean anything. We have to keep playing good basketball,\" Antetokounmpo said.\n\n\"We were up 27 and they came back, cut the lead to 11. So it doesn't mean anything,\" the league's reigning MVP added. \"We just try to take it quarter by quarter.\"\n\nAntetokounmpo nearly had a triple-double with 18 points, 18 rebounds and nine assists while also falling short of becoming the first player in league history with at least 30 points, 15 rebounds and 5 assists in six consecutive games.\n\nAntetokounmpo was originally listed with 19 points, but the NBA announced later Saturday that he had been incorrectly credited with a made free throw that missed with 1:29 remaining in the first quarter and removed a point from his total and corrected the final score.\n\nWith Middleton, Brook Lopez and Eric Bledsoe picking up the slack, it didn't matter as Milwaukee won for the 13th time in 14 games, improved to 45-7 overall and remained on course to become only the third team to top 70 wins in the regular season.\n\n\"A lot of people didn't think we would have a better team (than last season), but I trusted my team from day one,\" said Antetokounmpo, who finished 6 of 17 from the field. \"When we came together we knew what we had, and it shows on the court.\"\n\nWilt Chamberlain is the only other player with a stretch of five straight games with 30, 15 and 5, accomplishing it from Dec. 10-17, 1965, with the Philadelphia Warriors.\n\nLopez led the Bucks with 23 points, including 5 for 5 on 3-point attempts. Middleton had 21 points and 13 rebounds, and Bledsoe finished with 18 points.\n\nNikola Vucevic led the Magic with 21 points and 14 rebounds. Terrence Ross had 20 points, Markelle Fultz scored 15 and Evan Fournier added 14 for Orlando, which continues to hold the eighth playoff position in the Eastern Conference despite losing eight of its last nine.\n\nThe Magic trailed 63-46 at halftime and by 27 when Milwaukee began the third quarter on 10-1 run, capped by Antetokounmpo's alley oop dunk.\n\nOrlando shot 37.8%, including 10 of 40 on 3-pointers.\n\n\"If we're going to beat them, as good as they are, we are going to have to make 3s, open 3s,\" Magic coach Steve Clifford said. \"That to me is the story of the game. ... Shotmaking is a huge part of our league, and it's been a weakness.\"\n\nTIP-INS\n\nBucks: G George Hill missed a fifth straight game with a strained left hamstring.\n\nMagic: F James Ennis, acquired from Philadelphia on Thursday, has not been activated, but may play Monday. ... G D.J. Augustin missed a 13th game with a knee injury. The Magic are hopeful he will return after the All-Star break.\n\nSEASON SWEEP\n\nMilwaukee swept the four-game season series between the teams by an average of 17 points per game. Antetokounmpo averaged 26.6 points, 15.8 rebounds and 7.8 assists in the three games he played.\n\nHELPING HAND\n\nThe Magic and its Champions of the Community Partners -- Walt Disney World, L3Harris, PepsiCo, Insurance Office of America, RP Funding and AdventHealth -- teamed up to fight hunger with a volunteer project at Second Harvest Food Bank. As part of the Magic Volunteer Program, staff members from each organization sorted through and packed food that will be distributed to those in need in Central Florida.\n\nSAME PACE\n\nOrlando fell to 22-31, the same record they had through 53 games before making the playoffs at 42-40 last season.\n\n\"I don't know if we'll make a similar run but we can play better,\" Clifford said. \"You want to make the playoffs and be playing in a manner where you can play well, and that to me is what these games are for. But we need to make progress, particularly offensively.\"\n\nLET 'EM FIRE AWAY\n\nThe Bucks entered the game first in the NBA in defensive field-goal percentage at .410, despite also yielding the most 3-point field goals (14.12 per game) in the league. That's because opponents were attempting nearly 39 3s per game against them -- another league-high.\n\n\"Some people say we're happy to give up 3s, that's what we want to do. Not true,\" coach Mike Budenholzer said. \"But there's a hierarchy that you go through defensively in trying to figure out what's important. You try and take everything away, but that's pretty much impossible.\"\n\nUP NEXT\n\nBucks: Return home to host Sacramento on Monday night.\n\nMagic: Host Atlanta on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996133.5360498
}