{
  "game_id": "0022300240",
  "espn_id": "401584868",
  "date": "Nov 25, 2023",
  "matchup": "BKN vs. MIA",
  "headline": "Nets snap three-game skid, beat Heat 112-97 with Miami resting Butler and Adebayo",
  "body": "NEW YORK -- — Mikal Bridges scored 24 points, Cam Johnson added 19 points and 10 rebounds, and the Brooklyn Nets routed the short-handed Miami Heat 112-97 on Saturday night to snap a three-game losing streak.\n\n\r\n              Brooklyn got double-figure scoring from its entire starting five, with Dorian Finney-Smith scoring 16 points, Nic Claxton chipping in 13 and Spencer Dinwiddie finishing with 14 points and 11 assists.\n\n\r\n              Miami was the third team the Nets held to under 100 points this season. The Nets forced the Heat into 17 turnovers.\n\n\r\n              “Just give our guys credit for continuing to work at it,” coach Jacque Vaughn said. “It’s something new, getting our guys in different positions on the floor and taking calculated risks at certain time throughout the course of the game and possessions.”\n\n\r\n              Caleb Martin scored 22 points off the bench and rookie Jaime Jaquez Jr. had 18 for the Heat, who rested Jimmy Butler and Bam Abedayo, a night after blowing a 21-point lead and losing to New York at Madison Square Garden.\n\n\r\n              “I just didn’t think we could get stops on defense,” Jaquez said. “They were shooting lights out and we couldn’t find a way to diminish that or put together some stops to really get us going on a run.”\n\n\r\n              Miami was also without Duncan Robinson, who missed his second consecutive game due to a sprained right thumb. The Heat then lost Haywood Highsmith early in the fourth quarter when he attempted to block Dinwiddie’s layup and fell on his backside and had to be helped off the court.\n\n\r\n              “There definitely was a competitive spirit. I commend the guys for making that fight at different times and then we were hobbled at different times,” coach Erik Spoelstra said. “It was a pretty ugly game and we were doing whatever we possibly could to keep it within striking distance.”\n\n\r\n              The loss at Barclays Center concluded a five-game road trip for the Heat, who went 2/3 after going 4-0 in the previous one.\n\n\r\n              With former Phoenix All-Star teammate Devin Booker watching from courtside, Bridges and Johnson led a Nets offense that shot 50% from the field and was 14 for 36 (39%) from the 3-point line.\n\n\r\n              Johnson scored 12 points in the first quarter.\n\n\r\n              “I was trying to be in the right positions, stay aggressive,” he said. “I think an emphasis today was to come out and make a statement from the beginning and make them have to climb an uphill battle.”\n\n\r\n              Brooklyn made 10 3-pointers in the first half en route to a 63-53 lead. Jaquez cut the lead to eight in the opening seconds of the second half, but Claxton scored the next six points to increase the Nets’ lead to 69-55 with 9:34 left in the third quarter.\n\n\r\n              The Nets led by 16 to start the fourth quarter and increased it to 21 with under three minutes left in regulation after Johnson’s free throw made it 111-90.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host the Milwaukee Bucks on Tuesday night in their final In-Season Tournament group game.\n\n\r\n              Nets: Host the Chicago Bulls on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996365.0626109
}