{
  "game_id": "0021601084",
  "espn_id": "400900479",
  "date": "Mar 25, 2017",
  "matchup": "DAL vs. TOR",
  "headline": "Ibaka, DeRozan lead Raptors past Mavericks, 94-86",
  "body": "DALLAS --  The Toronto Raptors have been the NBA's comeback kids this season, though they're just as comfortable playing from ahead.\n\nThey're also getting comfortable representing the Eastern Conference in the playoffs.\n\nDeMar DeRozan and Serge Ibaka scored 18 points apiece and the Raptors won their fifth straight game, 94-86 over the Dallas Mavericks on Saturday night.\n\nWith its 44th win, Toronto clinched a playoff spot for a franchise-record fourth consecutive year.\n\n\"Our goal is to play for a championship,\" Toronto coach Dwane Casey. \"That's our goal in Toronto. Last few years, we've been taking those steps. It's been a little rockier this year just because of injuries, but we still need to continue to take those steps.\"\n\nThe Raptors lead the NBA with 19 comeback wins when trailing by double digits, and they came back from 15-point deficits to win each of their last two games. But Saturday they scored the first seven points and never trailed in dealing the Mavericks' playoff hopes a damaging blow.\n\n\"We've been fighting uphill for the last two or three games and that is something we wanted to make sure we fixed when we came out,\" Casey said.\n\nHarrison Barnes scored 23 points for Dallas, which missed 18 of its first 22 3-pointers and finished just 7 of 28 from behind the arc.\n\nThe Mavericks fell four games behind Denver for the final playoff spot in the West. Dallas has made the playoffs in 15 of the past 16 seasons.\n\n\"We had some breakdowns and let them get some open shots,\" Barnes said of the team's early deficit. \"But at the same time, they were making everything they were putting up. We kind of got caught between a rock and a hard place.\"\n\nToronto led by as many as 16 points in the first half and by 15 early in the fourth quarter before a 10-0 Dallas run made things more interesting.\n\nDorian Finney-Smith's free throws with 7:57 to go brought the Mavs within 79-74, the closest they had been since 7-2 early in the game. But Ibaka made consecutive jumpers to restore a nine-point lead, and Dallas got no closer than six after that.\n\nTIP-INS\n\nRaptors: Casey said he was hopeful that guard Kyle Lowry would return from wrist surgery before the end of the regular season. \"I know he's doing a lot of conditioning, a lot of work to keep his body in shape,\" Casey said. \"Just let him rehab, let him do his thing and trust our medical people.\" Lowry has missed the last 16 games. ... Toronto was also without starting forward DeMarre Carroll due to a sore lower back. P.J. Tucker started in his place.\n\nMavericks: Seth Curry with 11 points and Yogi Ferrell with 10 were the only other Mavs in double figures. . Nerlens Noel started his second game in a row at center for the Mavericks, who have gone to a big lineup. They've moved Dirk Nowitzki to power forward, Barnes to small forward and Curry to point guard.\n\nTALKING POINTS\n\nPatrick Patterson scored 14 points with 4-for-4 shooting from 3-point range. His final 3 from in front of the Mavs' bench with 59 seconds to play made it 92-83 and essentially put away the game. Patterson, as he had on a previous 3 from virtually the same spot in the third quarter, turned and said something toward the bench. Mavericks coach Rick Carlisle yelled right back at Patterson, and both were given technical fouls.\n\n\"I'm not going to let a guy unnecessarily taunt our bench,\" Carlisle said. \"That's all there is to it. I don't think it's right; I take exception to it.\"\n\nSTREAK IN JEOPARDY\n\nThe Mavericks took their 41st loss of the season. Their next loss will end the NBA's second-longest streak of .500 or better seasons -- currently at 16 seasons. Their last sub-.500 season was 1999-00, when they finished 40-42 and Mark Cuban became owner of the team in January 2000.\n\nSan Antonio has the longest streak of .500 or better seasons with 20, including this season.\n\nABOUT THURSDAY NIGHT\n\nCuban couldn't resist giving his opinion on Barea's ejection from the Mavericks' victory over the Clippers on Thursday night. Barea was called for a flagrant 2 foul for pushing Blake Griffin, a player with a 10-inch height advantage.\n\n\"I just feel bad for Blake,\" Cuban said. \"It's hard to come back from a knockout like that. We sent flowers to his family, condolences. I can only guess that he's going to be drinking through a straw for a long, long time.\"\n\nUP NEXT\n\nRaptors: Host Orlando on Monday. The Magic have beaten the Raptors in two of three meetings this season.\n\nMavericks: Host Oklahoma City on Monday to end a four-game homestand. Dallas plays seven of its final nine on the road.",
  "source": "espn_api",
  "crawled_at": 1764996100.199591
}