{
  "game_id": "0022400052",
  "espn_id": "401703421",
  "date": "Dec 03, 2024",
  "matchup": "MIL @ DET",
  "headline": "Bucks advance in NBA Cup as Antetokounmpo and Lillard key 128-107 win over Pistons",
  "body": "DETROIT -- — Giannis Antetokounmpo scored 28 points and Damian Lillard had 27, lifting the surging Milwaukee Bucks to a 128-107 win over the Detroit Pistons on Tuesday night and into the NBA Cup quarterfinals.\n\n\r\n              The Bucks, who won East Group B with a 4-0 record, have won seven straight and nine of 10.\n\n\r\n              Detroit was eliminated from the NBA Cup, dropping to 3-1 in the tournament. Cade Cunningham scored 23 points, Tobias Harris had 16, Tim Hardaway scored 15 and Jalen Duren added 11 for the Pistons.\n\n\r\n              Milwaukee's Gary Trent Jr. scored 16 points, Bobby Portis and Taurean Prince each scored 14 and A.J. Green added 11.\n\n\r\n              The hot-shooting Bucks led 36-31 after the first quarter and were ahead 78-59 at halftime in a game that simply wasn't competitive.\n\n\r\n              Antetokounmpo rested in the fourth quarter, after making 10 of 11 shots in 28 minutes. He also had eight assists and seven rebounds after having a triple-double in three of his previous six games.\n\n\r\n              Takeaways\r\n              Bucks: The team is on a roll after a 2-8 start, leaning on its dynamic duo of Antetokounmpo and Lillard.\n\n\r\n              Pistons: In one of the more significant games during a dismal era, Detroit failed to make the most of the opportunity.\n\n\r\n              Key moment\r\n              Lillard made a jumper on the opening possession and scored seven points in 2:35, helping the Bucks build a 10-4 lead. Milwaukee stayed in control the rest of the game.\n\n\r\n              Key stat\r\n              The Bucks were making more than 70% of their shots as they pulled away from Detroit in the first half. They connected on 69% through two quarters and 66% entering the fourth, giving them a 22-point lead.\n\n\r\n              Up next\r\n              Bucks: Host Atlanta on Wednesday night.\n\n\r\n              Pistons: At Boston on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997854.964216
}