{
  "game_id": "0022400044",
  "espn_id": "401703413",
  "date": "Nov 29, 2024",
  "matchup": "LAC @ MIN",
  "headline": "Timberwolves stop 4-game losing streak by fending off Clippers 93-92 in NBA Cup play",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 21 points on 7-for-21 shooting to help the Minnesota Timberwolves stop a four-game losing streak by holding off the Los Angeles Clippers 93-92 in an NBA Cup game Friday night.\n\n\r\n              Nickeil Alexander-Walker had 12 points and 10 rebounds and Julius Randle added 11 points and 10 rebounds for the Timberwolves, who overcame 22 turnovers and another blown double-digit lead.\n\n\r\n              James Harden had 20 points and 11 assists and Ivica Zubac added 16 points and 13 rebounds for the Clippers, who went ahead 90-87 with 4:10 left on Harden's four-point play for their first lead since 27-26.\n\n\r\n              Kevin Porter Jr., who had 17 points and seven rebounds for the Clippers, rolled his left ankle on a drive to the basket with 1:29 left as he lost the ball out of bounds with his team trailing by three.\n\n\r\n              The Timberwolves finished 2-2 in West Group A. The Clippers are 1-2 with one group stage game left. Both teams are long shots to reach the quarterfinals of the in-season tournament.\n\n\r\n              Key moment\r\n              Edwards hit a pull-up 3-pointer with 2:24 to go for a 92-90 lead.\n\n\r\n              Key stat\r\n              The Clippers made only one basket, a layup by Zubac, over the final four minutes.\n\n\r\n              Takeaways\r\n              Clippers: With star Kawhi Leonard (knee) yet to play this season and starter Norman Powell (hamstring) sidelined for a his sixth straight game, the Clippers have been hanging in there in the loaded West.\n\n\r\n              Timberwolves: The 11-point second-quarter lead evaporated in the type of funk that has troubled this team since reaching the conference finals last season, be it from a lack of intensity on defense, a stoppage of movement on offense, or both. With three straight turnovers to start the second half, the Timberwolves found themselves in a tie game soon after.\n\n\r\n              Up next\r\n              The Clippers host Denver Sunday. The Timberwolves host the Lakers on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998050.2353642
}