{
  "game_id": "0022401028",
  "espn_id": "401705594",
  "date": "Mar 22, 2025",
  "matchup": "CHI @ LAL",
  "headline": "LeBron James' return from injury spoiled by Bulls' phenomenal effort in 146-115 win over Lakers",
  "body": "LOS ANGELES -- — Coby White scored 36 points, Josh Giddey flirted with a quadruple-double and the Chicago Bulls wrecked LeBron James' return from injury with an impressive 146-115 victory over the Los Angeles Lakers on Saturday night.\n\n\r\n              Luka Doncic scored 29 of his 34 points in the first half and hit eight 3-pointers, while James had 17 points after a seven-game absence.\n\n\r\n              Neither superstar could do a thing to slow the Bulls, who scorched Los Angeles' normally sturdy defense on the way to their seventh win in nine games. Chicago's 146 points were 12 more than the Lakers had allowed in any game this season.\n\n\r\n              Matas Buzelis scored 31 points for Chicago, and Giddey recorded 15 points, 17 assists, 10 rebounds and eight steals. White was dominant while hitting six 3-pointers, and eight Bulls scored at least nine points on the fifth stop of a six-game road trip.\n\n\r\n              Austin Reaves scored 25 points for LA.\n\n\r\n              Rui Hachimura made his own return from a 12-game absence with a knee injury, making the Lakers' roster largely whole — but Los Angeles then played perhaps its worst defensive game.\n\n\r\n              Takeaways\r\n              Bulls: One of their best performances of the season, particularly in their fifth road game in eight nights while playing without injured starter Tre Jones. Chicago is looking more like a postseason threat.\n\n\r\n              Lakers: An exhausting two weeks ended discouragingly. James missed two weeks with a strained left groin, and Los Angeles clearly needs time to get back to its pre-injury form.\n\n\r\n              Key moment\r\n              Reaves and Doncic kept it close through halftime, but White scored 12 points while Chicago steadily pulled away with a 39-point third quarter.\n\n\r\n              Key stat\r\n              Doncic scored at least 29 points for the ninth time in his last 11 games.\n\n\r\n              Up next\r\n              On Monday, the Bulls finish their trip in Denver and the Lakers begin a four-game trip in Orlando.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997031.634413
}