{"game_id": "171226008", "title": "Synthetic Recap", "body": "**Heat Ride Mourning's Historic Night Past Pistons**\n\nBy The Associated Press\n\nAUBURN HILLS, Mich. – On a night where offense was a premium for most, Alonzo Mourning authored a masterpiece of pure, unadulterated dominance. The Miami Heat center delivered a career-defining and historic performance, pouring in a game-high 42 points to single-handedly power the Heat to an 88-74 road victory over the Detroit Pistons in 1998.\n\nFrom the opening tip, it was clear this was Mourning’s stage. While both teams grinded through a defensive struggle, Mourning was an unstoppable force in the paint. He bullied his way to the basket, hit face-up jumpers, and commanded relentless double-teams, yet the Pistons had no answer. His 42-point explosion, an exceptionally high mark that towers over the box score, was the sole engine of the Miami offense.\n\nThe Pistons, led by Grant Hill’s characteristically solid all-around effort of 21 points, 8 rebounds, and 7 assists, simply could not keep pace with the Hurricane in the middle. Hill’s contributions, while valiant, were rendered secondary to the force of nature wearing number 33. Miami’s other starters combined for a mere 24 points, a testament to how thoroughly the offense ran through its All-Star center.\n\nThe game was never a blowout, but it was always under Mourning’s control. Every time Detroit threatened to close the gap, he answered with another powerful basket, silencing the home crowd and demoralizing the defense. He didn't just score; he owned the interior, his sheer will ensuring the Heat would leave with the win.\n\nIn the final analysis, the stat sheet tells a simple story: the Miami Heat had Alonzo Mourning, and the Detroit Pistons did not. On this night, that was more than enough. It was a legendary outing that transcended a simple regular-season win, a performance for the ages from one of the game's most formidable big men.", "source": "AI_Reconstruction"}