{
  "game_id": "0022200150",
  "espn_id": "401468305",
  "date": "Nov 07, 2022",
  "matchup": "MIA vs. POR",
  "headline": "Hart hits 3 at buzzer to give Blazers 110-107 win over Heat",
  "body": "MIAMI -- — Portland didn't call time. Josh Hart called game.\n\n\r\n              Hart’s 3-pointer as time expired off a pass from Damian Lillard gave the Trail Blazers a 110-107 victory over the Miami Heat on Monday night, capping a perfect offensive finish from Portland.\n\n\r\n              The Blazers trailed for most of the final three quarters, then went 8 for 8 from the floor in the game's last 6:07.\n\n\r\n              “It's good to have games like this, especially early in the season, that are close games that come down to the wire and force you to execute,\" Hart said.\n\n\r\n              Execution was no issue for the Blazers. They shot 13 for 17 in the fourth quarter, the second-best final 12 minutes by any NBA team so far this season. Only New Orleans — 14 for 18 against the Los Angeles Clippers on Oct. 30 — had a better fourth quarter.\n\n\r\n              Anfernee Simons scored 25 for Portland, Jerami Grant added 23 and Lillard finished with 19 points in his first game back after a four-game absence with a right calf strain. Hart and Justice Winslow each scored 12.\n\n\r\n              Hart's buzzer-beater capped a wild final few moments. Max Strus made a 3-pointer for Miami with 6.2 seconds remaining to tie the game. The Trail Blazers opted not to call timeout and Lillard dribbled most of the way downcourt before finding Hart in the left corner near the Heat bench.\n\n\r\n              Hart hit the shot, and the Blazers ran off their bench to chase him in celebration.\n\n\r\n              “I saw Josh waving his hands,\" said Lillard, who was thinking he'd take the shot before seeing Hart. “Easy play.\"\n\n\r\n              At 7-3, Portland is off to its best start since 2018-19.\n\n\r\n              “Dame made a great pass and Josh made a great shot,” Miami guard Kyle Lowry said.\n\n\r\n              Jimmy Butler, Bam Adebayo and Strus all had 16 for Miami. The Heat (4-7) got 15 from Lowry and Gabe Vincent, and 10 apiece from Caleb Martin and Dewayne Dedmon.\n\n\r\n              Simons was called for fouling Adebayo with 10.2 seconds left, but the Blazers argued that the Heat center actually was guilty of using his arm to hook Simons on the play. After review, the referees agreed and gave Portland the ball.\n\n\r\n              Simons made two free throws with 8.5 seconds left to push the lead to three before Strus tied it. And then Hart ended it.\n\n\r\n              “Lillard and Simons were terrific in creating those triggers,\" Heat coach Erik Spoelstra said. “They made a ton of timely plays in that fourth quarter. It felt like we could not get a stop.\"\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: Portland snapped a four-game losing streak to Miami and hasn’t lost consecutive games yet this season. ... The Blazers lost the lead with 10:39 left in the first half on a 3-pointer by Duncan Robinson, and trailed for the next 32:17 until Lillard tied the game with 2:20 left.\n\n\r\n              Heat: It was the 2,999th game in Heat history, including playoffs. ... Tyler Herro (sprained left ankle) and Udonis Haslem (personal reasons) were out, joining the still-sidelined Victor Oladipo (left knee) and Omer Yurtseven (left ankle). ... It was the start of a four-game homestand for Miami. The Heat won’t have another one of those until late December.\n\n\r\n              SHOOT IT\n\n\r\n              Robinson’s first 3-pointer on Monday was the 400th of his career, including playoffs, at FTX Arena. Mario Chalmers has the arena record with 418. Robinson now has 402.\n\n\r\n              SCHEDULE QUIRK\n\n\r\n              The Heat and Blazers played four times in 2022; last season’s two meetings were in January. The only other time Miami and Portland had four games in the same calendar year was 1989. \n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Visit Charlotte on Wednesday.\n\n\r\n              Heat: Host Charlotte on Thursday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993991.1879869
}