{
  "game_id": "0022201229",
  "espn_id": "401469384",
  "date": "Apr 09, 2023",
  "matchup": "LAC @ PHX",
  "headline": "Clippers rally past Suns, secure No. 5 playoff spot in West",
  "body": "PHOENIX -- — The Los Angeles Clippers rallied for a 119-114 win on Sunday over the Phoenix Suns, earning the No. 5 spot in the Western Conference playoff bracket and a first-round rematch against those same Suns.\n\n\r\n              Well, sort of.\n\n\r\n              The upcoming version of the Suns — who sat seven players, including four starters — will be much different than the one the Clippers struggled to beat on Sunday. That fact wasn't lost on the Clippers after a unexpectedly difficult victory.\n\n\r\n              “I don't know — I ain't talking about this game,” Clippers coach Tyronn Lue said. “It's over, we're in the playoffs, I want to focus on that. We didn't play our best game today, we know that, but we'll put it behind us and focus on the bigger picture.\"\n\n\r\n              Kawhi Leonard scored 12 of his 25 points in the fourth quarter to finally lead the Clippers past the spunky Suns, who were without Devin Booker, Kevin Durant, Deandre Ayton and Chris Paul. Norman Powell led Los Angeles with 29 points while Russell Westbrook added 25.\n\n\r\n              The teams will meet again in Game 1 in Phoenix on Sunday.\n\n\r\n              The Clippers trailed by 10 points late in the third quarter, eventually cutting the margin to 86-82 going into the fourth. The frustration on the Los Angeles bench was palpable — Mason Plumlee and Bones Hyland briefly got into an argument between quarters.\n\n\r\n              But the Clippers finally rallied. Leonard made a contested layup with 19.4 seconds left to secure the win.\n\n\r\n              “We've got to get better,” Leonard said. “Because the last two games, teams have been sitting their stars, and we're struggling.”\n\n\r\n              The Suns put together a surprisingly competitive effort. Saben Lee scored a career-high 25 points and finished with nine assists.\n\n\r\n              “From a force and grit standpoint, we played to the Suns’ standards,” Suns coach Monty Williams said. \n\n\r\n              The Clippers cut the Suns lead to 53-48 at halftime when Eric Gordon banked in a 3-pointer at the buzzer. Phoenix led at the break despite shooting just 36% from the field. Jock Landale led the Suns with 13 points while Westbrook had 13 for the Clippers.\n\n\r\n              HONORING MCCOY\n\n\r\n              At halftime, the Suns honored local legend Al McCoy, who is retiring following 51 seasons calling games for the team's broadcasts.\n\n\r\n              The 89-year-old's tenure with the Suns is the longest run by a team broadcaster in NBA history. The halftime montage included tributes from broadcaster Marv Albert, NBA Commissioner Adam Silver, former players Charles Barkley and Steve Nash, and current star Devin Booker.\n\n\r\n              McCoy called his first game for the Suns on Sept. 27, 1972. He has called more than 4,000 games, including 30 playoff appearances and three NBA Finals in 1976, 1993 and 2021.\n\n\r\n              DELAY OF GAME\n\n\r\n              The game was delayed nearly 10 minutes in the second quarter because a large speaker hanging from the Footprint Center ceiling was loose and deemed a hazard. The arena operations crew had to lower some speakers to the floor, remove the affected area, and then raise the structure back to the ceiling.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Forwards Paul George (right knee sprain) and Marcus Morris Sr. (low back spasms) were not available.\n\n\r\n              Suns: Williams is hopeful that C Bismack Biyombo (right knee bone contusion) and G Cameron Payne (low back soreness) will be able to return for the playoffs. Both players got hurt against the Lakers on Friday. ... F T.J. Warren (non-COVID-19 illness) was not available.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994944.099937
}