{
  "game_id": "0021500394",
  "espn_id": "400828281",
  "date": "Dec 18, 2015",
  "matchup": "MEM @ DAL",
  "headline": "Nowitzki scores 20, leads Mavericks past Grizzlies 97-88",
  "body": "DALLAS -- Playing against one of the NBA's best front lines, the Dallas Mavericks' big men stepped up.\nDirk Nowitzki scored 20 points, leading the Mavericks past the Memphis Grizzlies 97-88 Friday night.\nChandler Parsons had 16 points and Zaza Pachulia got 10 points and 18 rebounds for Dallas. Of the Mavericks' six players in double figures, five were forwards or centers. That included reserve big men JaVale McGee and Charlie Villanueva, who each scored 10 points.\nMcGee set a season high for both points and minutes played (18), and contributed strong defense on the Grizzlies' Zach Randolph, who had just seven points.\n\"He was fantastic,\" Nowitzki said of McGee. \"If you look at all the good teams, they all have athleticism from their bigs. He was definitely a game-changer for us.\"\nMcGee was playing in just his eighth game of the season as he continues to recover from a stress fracture in his left tibia, an injury that has dogged him since 2013.\n\"It's rewarding but it's not the end of the road,\" McGee said. \"It's not even close to the end. Until I'm out there playing 30 minutes a game, it's not the end of the road.\"\nMike Conley scored 20 points and Marc Gasol had 16 for Memphis, which lost for the fourth time in its last five games.\nThe Grizzlies' defense repeatedly left Mavericks' shooters alone for open looks. Coming out of a Memphis timeout, Villanueva spotted up for a 3-pointer to give the Mavericks their biggest lead of the night to that point, 73-58.\nAfter the Grizzlies used a 10-2 run to cut the lead to 75-68, two more defensive breakdowns led to wide open corner 3s by Parsons and Raymond Felton for an 83-70 lead that Dallas extended to as many as 18 points.\n\"They did what they wanted to do as far as moving the ball without any resistance,\" Conley said. \"They're too good to get too many easy baskets like that. We allowed them to get a good rhythm.\"\nMemphis led for most of the first half as the Mavericks started 2 of 13 from the field. But consecutive 3-pointers by J.J. Barea, Felton and Deron Williams gave Dallas its first lead at 38-35.\nWilliams went on to hit three free throws after Matt Barnes committed a costly shooting foul on his desperation 3-point shot with only 0.2 seconds left in the half. Williams' foul shots gave the Mavericks a 55-49 halftime lead.\n\"In one quarter we play great defense and really good offense and then, all of a sudden, we stop doing that,\" Gasol said. \"Every time we get hit, it takes a long time for us to get up.\"\nA \"PRIME\" PERFORMANCE\nParsons is still rehabbing his right knee after offseason surgery, and Friday marked his second strong game in a week, following a 17-point performance in a win over Phoenix on Monday. Coach Rick Carlisle praised his dedication, saying: \"Everybody wants a nice cooked steak, but nobody wants to see you chopping up the cows in the back. The last five or six months, Parsons has been in the back butchering the cows -- that's the kind of work he's had to do.\"\nTROUBLE IN THE THIRD\nThe third quarter has been the key to the Grizzlies' success this season. In their wins, they've averaged 26 points and shot 46 percent. In losses, their numbers have been 20 points and 41 percent shooting. Friday they scored 17 on 5-for-17 shooting. \"I think we have to come out with better focus in the third quarters,\" Conley said. \"We try to force the issue, force plays, instead of just playing free and playing with confidence.\"\nTIP-INS\nGrizzlies: Memphis was without guard Tony Allen for the fourth straight game due to a right knee injury. ... The Grizzlies wore throwback uniforms commemorating the 1974-75 Memphis Sounds of the ABA.\nMavericks: Devin Harris missed the game with a right hamstring strain suffered on Wednesday against Indiana. Coach Rick Carlisle said before the game that the injury was not serious but there was no timetable for Harris' return. . With his two free throws in the first quarter, Nowitzki passed Adrian Dantley for eighth place on the NBA's all-time free throws made list. ... Pachulia recorded his 15th double-double of the season, the same number he had all of last year.\nUP NEXT\nGrizzlies: Host Indiana on Saturday.\nMavericks: Travel to Toronto on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994458.911846
}