{
  "game_id": "0022201140",
  "espn_id": "401469295",
  "date": "Mar 29, 2023",
  "matchup": "CHI vs. LAL",
  "headline": "LeBron James, Anthony Davis lead Lakers past Bulls 121-110",
  "body": "CHICAGO -- — LeBron James wants to build up his stamina, and there are a couple more little things he is working on.\n\n\r\n              “I think by the end of the road trip I should be pretty good,” he said.\n\n\r\n              He certainly looked pretty good Wednesday night.\n\n\r\n              James scored 25 points in his return to the starting lineup, leading the Los Angeles Lakers to a 121-110 victory over the Chicago Bulls.\n\n\r\n              James also had seven rebounds and four assists in 31 minutes in his second game back after he was sidelined for a month because of a torn tendon in his right foot. The four-time MVP scored 19 points in Sunday's 118-108 loss to Chicago in just his second appearance as a reserve in his 20-year NBA career.\n\n\r\n              “I'm just trusting the work that I've been putting in,” James said. “I know I put in a lot of work. I know my body.”\n\n\r\n              Fighting for playoff positioning in the Western Conference, Los Angeles (38-38) kicked off a five-game trip with its fourth win in five games overall. Anthony Davis had 38 points and 10 rebounds in his hometown, and D’Angelo Russell scored 17 points.\n\n\r\n              “I always look forward to coming back home,” Davis said. “Kind of one of the first games I look at when the schedule drops. ... It's always a great feeling coming back, especially getting a win.”\n\n\r\n              Nikola Vucevic had 29 points, 12 rebounds and six assists for Chicago in its second straight loss. DeMar DeRozan scored 22 points, and reserve Coby White had 17 points and nine assists.\n\n\r\n              The Bulls (36-40) are 10th in the Eastern Conference, clinging to the last spot for the play-in tournament.\n\n\r\n              “Obviously we didn't close the (first) half very well. ... And in the third quarter, LeBron made some tough shots and then our inability to score with them hurt us,\" coach Billy Donovan said.\n\n\r\n              LaVine's dunk got Chicago within seven with 56.7 seconds left in the third. But Los Angeles quickly pulled away in the final period.\n\n\r\n              Dennis Schröder's three-point play made it 97-79 with 8:22 left, capping a 12-3 Lakers run. Davis connected on his only 3-point attempt with 6:07 to go, lifting Los Angeles to a 105-87 lead.\n\n\r\n              Austin Reaves added 19 points for the Lakers, who shot 52% (45 for 86) from the field.\n\n\r\n              “Just wanted to try to put them in some uncomfortable positions with their defense,” Los Angeles coach Darvin Ham said, “and sort of spread the ball around a little bit, not overdose on any one or two actions, but just try to slowly sift through the offense and see what was bringing us the most returns.” \n\n\r\n              After leading by as many as 17 in the first quarter, Los Angeles closed the first half with a 10-0 run for a 59-51 lead at the break. James made four foul shots and a driving layup during the spurt.\n\n\r\n              FAIR PLAY\n\n\r\n              Reaves had a little fun with former teammate Patrick Beverley in the fourth quarter.\n\n\r\n              After driving into the lane and making a floater over Beverley with 2:50 remaining, Reaves lowered his right hand to make the dismissive “too small” gesture sometimes used by NBA players to taunt their opponents.\n\n\r\n              Beverley did the same thing against James on Sunday.\n\n\r\n              “It wasn't something I thought about doing all game,” Reaves said. “But I felt like right time, right situation. Me and Pat (have) a good relationship. I respect him. It's just me competing.”\n\n\r\n              TIP-INS\n\n\r\n              Lakers: Russell (right hip soreness) started after he was sidelined for the previous two games. He went 7 for 12 from the field. ... Led by Davis, Los Angeles had a 45-32 rebounding advantage.\n\n\r\n              Bulls: C Andre Drummond missed the game because of personal reasons. Drummond posted on Twitter on Tuesday that he was deleting his social media apps to focus on his mental health. ... G Alex Caruso (left foot soreness) returned to the starting lineup after missing Monday night's 124-112 loss to the Clippers. ... Vucevic scored Chicago’s first 13 points of the game.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Minnesota on Friday night. The Lakers are 0-2 against the Timberwolves this season.\n\n\r\n              Bulls: At Charlotte on Friday night. The Bulls are 7-3 in their last 10 games against the Hornets.\n\n\r\n              ------\n\n\r\n              Follow Jay Cohen at https://twitter.com/jcohenap\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994464.391925
}