{
  "game_id": "0021600269",
  "espn_id": "400899719",
  "date": "Nov 30, 2016",
  "matchup": "CHI vs. LAL",
  "headline": "Randle makes late layup to help Lakers edge Bulls 96-90",
  "body": "CHICAGO -- The Los Angeles Lakers needed a basket, and Julius Randle wanted the ball.\nCoach Luke Walton loved the whole thing.\n\"If it's a one-on-one situation with space, we feel very confident that he'll win that matchup,\" Walton said.\nGot it done in a big moment Wednesday night.\nRandle made a strong move against Nikola Mirotic for a tiebreaking layup with 45.1 seconds left, and the Lakers held off the Chicago Bulls for a gritty 96-90 victory.\nRandle had 13 points and matched a career high with 20 rebounds as Los Angeles bounced back from a 105-88 loss at New Orleans on Tuesday night. Lou Williams and Jordan Clarkson scored 18 points apiece, and Larry Nance Jr. finished with 12 points and 11 boards.\n\"Our guys just played hard, stayed mentally locked in,\" Randle said.\nRandle's drive and layup gave Los Angeles a 92-90 lead. After Jimmy Butler missed on the other side for Chicago, Williams went 1 for 2 at the line with 20 seconds to go.\nButler then missed another 3 and Randle and Nance combined for three foul shots to help Los Angeles hold on.\n\"Our guys have proven that when their backs are against the wall they can step up for a challenge,\" Walton said. \"They did it tonight. That's a great win against a very talented team.\"\nButler had 22 points on 4-of-18 shooting for the Bulls, who were hoping to build on a 4-2 road trip. Dwyane Wade, who was listed as doubtful after getting some dental work on Tuesday, scored 17 points, and Robin Lopez finished with 10 points, nine rebounds and a career-high eight blocked shots.\n\"It was an ugly game,\" Wade said. \"We have to find a way to win those games. No excuses.\"\nThe Bulls used 40 points from Butler to beat the Lakers 118-110 in Los Angeles on Nov. 20. But the Lakers held the Bulls to 35.2 percent shooting in the rematch and enjoyed a 60-46 rebounding advantage.\n\"I think the missed shots definitely affected us,\" coach Fred Hoiberg said. \"You can't let that happen. That and rebounding has to be your constant.\"\nBANGED-UP LAKERS\nIt was an impressive response from Los Angeles after the team announced before the game that Nick Young strained his right calf muscle in Tuesday night's loss to the Pelicans, sidelining the guard for two to four weeks.\nThe Lakers also were without guard D'Angelo Russell, who missed his sixth straight game due to left knee soreness.\nGOOD START, BAD FINISH\nThe Bulls led by as many as 14 in the first quarter before settling for a 28-17 advantage after one. But the Lakers rallied in the second and it was tied at 47 at the break.\n\"We stopped rebounding. We stopped getting to loose balls. A lot of stuff,\" Butler said. \"It changed in their favor and they caught us slipping.\"\nTIP-INS\nLakers: Randle leads the team with five double-doubles this season. He has 39 double-doubles in 99 career games. ... It was Los Angeles' first win at the United Center since a 96-87 victory on Dec. 15, 2009. It had dropped five in a row in Chicago. ... The Lakers committed 24 turnovers, leading to 26 points for the Bulls.\nBulls: F Doug McDermott (concussion protocol) missed his seventh consecutive game. ... Butler has scored 20 or more points in his last 11 games, setting a career high. His previous best was six in a row. ... Chicago dropped to 8-1 this season when its opponent scores fewer than 100 points. ... The Bulls matched a season high with 15 steals.\nUP NEXT\nLakers: Play another back-to-back when they visit Toronto on Friday night and Memphis on Saturday night.\nBulls: Host the Cleveland Cavaliers on Friday night, and LeBron James pays up after he lost his bet with buddy Wade over the World Series. James is expected to wear a Chicago Cubs uniform before the game.\n---\nJay Cohen can be reached at http://www.twitter.com/jcohenap",
  "source": "espn_api",
  "crawled_at": 1764995092.34636
}