{
  "game_id": "0021801093",
  "espn_id": "401071766",
  "date": "Mar 23, 2019",
  "matchup": "DET @ POR",
  "headline": "Lillard, Blazers beat Detroit 117-112 for 3rd straight win",
  "body": "PORTLAND, Ore. --  The play of Damian Lillard has been a constant for Portland. It's the contributions by his teammates that have coincided with the Trail Blazers' rise in the standings.\n\nLillard had 28 points, nine assists and six rebounds Saturday as the Trail Blazers beat the Detroit Pistons 117-112 for their third straight win.\n\nAl-Farouq Aminu scored 22 points, including nine in the fourth quarter, as the Portland rallied from a six-point deficit. With the victory, the Trail Blazers moved within a half-game of the third-place Houston Rockets in the Western Conference standings, with a game in hand.\n\nAminu's performance received rave reviews from the opposing head coach.\n\n\"His offensive rebounding, getting in the paint, driving,\" Pistons coach Dwane Casey said. \"We were off helping or blitzing and he did a good job of, on the weakside, cutting and getting to the rim.\"\n\nAminu's teammates noticed, too.\n\n\"He was cutting, screening, he was ready to shoot the ball. I just think when your mind is in the right place and you're doing whatever you can for the team, good things happen,\" Lillard said of Aminu's fourth-quarter performance.\n\nEntering Saturday, the Blazers were tied with Milwaukee for the best offensive efficiency in the NBA since the All-Star break. Aminu was just the latest in a rotating cast of characters delivering big performances for Portland, even as they're without starting shooting guard CJ McCollum since last week.\n\n\"Since the All-Star break, it has been different guys on different nights,\" Terry Stotts said of his team's play. \"Whether it's Rodney (Hood) having a game in Charlotte, Seth (Curry) filling in now, Moe (Harkless) has played exceptionally well. Dame, since CJ's been out, he's really controlled the game at the offensive end and made it easier for everybody else.\"\n\nIn addition to Lillard and Aminu, the Blazers had four other players score in double figures.\n\nBlake Griffin led the Pistons with 27 points and six assists.\n\nAfter setting up his teammates early, Lillard looked for his own shot, and his first eight points came in the span of 90 seconds in the first half.\n\nAfter trailing by as many as 11, Detroit rallied. Griffin was a steadying force, leading the Pistons with 16 first-half points. Luke Kennard added 13 points and five assists off the bench.\n\nThe Pistons carried a 92-89 lead into the fourth quarter. Reggie Jackson was the spark for Detroit, scoring 12 of his 24 points in the third period.\n\nThe Blazers locked in defensively, holding the Pistons without a point for nearly 4 minutes in the 4th quarter. A layup by Portland's Jusuf Nurkic tied the game at 109 with 1:48 left. The Trail Blazers made a defensive stop and Lillard converted a four-point play for a 113-109 lead with 1:37 left.\n\n\"That was a big momentum play,\" Stotts said.\n\nAfter Griffin missed a 3-pointer from the corner, Portland answered with a slam dunk by Nurkic over Griffin that pushed the lead to 115-109.\n\nGalloway pulled the Pistons within 115-112 with 31 seconds left. Galloway followed with a block on layup attempt by Lillard, but the loose ball was recovered by Aminu, who dropped in a layup with 4.1 seconds left to end the scoring.\n\nTIP-INS\n\nPistons: The game featured two of the top three offenses in the NBA since the All-Star break.\n\nThe Blazers entered the game tied for the top mark after the break while the Pistons came in third. However, Pistons head coach Dwane Casey didn't want to talk too much about the offense.\n\n\"Shot making is an amazing thing. We're taking the same shots and running the same offense we ran earlier in the year,\" Casey said. \"Again, it's shot-making, guys playing with a lot of confidence offensively. We can't worry about a lot of offense, we have to have our defensive focus. We've worked hard to get our offensive identity put in. We have to make sure we have some semblance of defensive focus and defensive identity.\"\n\nTrail Blazers: The Blazers dodged devastating news last week after an MRI revealed nothing more than a muscle strain in the left knee of starting guard CJ McCollum. Even with the playoffs approaching, they're taking a patient approach.\n\nMcCollum was spotted doing light jump-shooting at Friday's practice and head coach Terry Stotts says the evaluation of McCollum has been daily, but he wouldn't say much more. The team announced last Sunday that McCollum would be re-evaluated in a week.\n\n\"He's been doing a lot of different things and I didn't see what he was doing yesterday,\" Stotts said. \"He's being evaluated every day, he's rehabbing, he's getting work.\"\n\nThe next expected injury update from the Blazers will be Monday before they play the Brooklyn Nets.\n\nUP NEXT\n\nPistons: Sunday at Golden State Warriors.\n\nTrail Blazers: Host the Brooklyn Nets on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994654.321235
}