{
  "game_id": "0022200991",
  "espn_id": "401469146",
  "date": "Mar 08, 2023",
  "matchup": "TOR @ LAC",
  "headline": "Clippers pull away in second half to beat Raptors 108-100",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 24 points, Paul George had 23 and the Los Angeles Clippers broke away in the second half to beat the Toronto Raptors 108-100 on Wednesday night.\n\n\r\n              While Leonard and George put up their usual numbers on the offensive end, the biggest key to the win was defense. After struggling to get stops during a five-losing streak, the Clippers have tightened up in defending teams over the past two games.\n\n\r\n              Los Angeles held Toronto to 37 of 96 shooting, which was the first time since Nov. 27 the Clippers have held a team under 40%,\n\n\r\n              “I thought we did a good job of talking and getting back in transition. We need to come out with a defensive mindset. That is what needs to improve for us to keep moving forward,” said Leonard, who also had a season-high 12 rebounds against the team he helped lead to the NBA title in 2019.\n\n\r\n              Ivica Zubac added 17 points for the Clippers, who had a season-high 14 dunks along with a 60-42 advantage in the paint and a 20-10 edge in fast-break points.\n\n\r\n              The Clippers were also 39 of 71 from the field, the third straight game they have made over 50%,\n\n\r\n              “All our veterans have stepped up. We have to continue to keep working defensively on our foundation. There's going to be a lot of that moving forward, especially with the new additions,” Clippers coach Tyronn Lue said.\n\n\r\n              Pascal Siakam and Scottie Barnes each scored 20 points for Toronto, and O.G. Anunoby had 18 points. The Raptors have dropped two straight for the first time since Feb. 1.\n\n\r\n              “I think from in the paint in we didn't finish good enough,” Toronto coach Nick Nurse said. \n\n\r\n              Leonard had 17 points in the first half, but saved his best play for the fourth quarter with a thunderous dunk over Jakob Poeltl to make it 100-85 with 5:17 remaining.\n\n\r\n              The Raptors responded with an 15-4 surge to get to 104-100 in the final minute before Zubac's dunk pushed it back to six.\n\n\r\n              “I thought early in the game we were playing too fast and giving up the ball too early. After the first quarter we slowed down, tried to attack the paint and made passes with precision,” Leonard said. \n\n\r\n              PLAYOFF POSITIONING\n\n\r\n              The Clippers (35-33) moved up to the sixth seed in the West with the win, while the Raptors (32-35) remain in ninth in the East.\n\n\r\n              Fifth though 13th place in the Western Conference remain separated by only three games.\n\n\r\n              NOT AMUSED\n\n\r\n              The Raptors were 13 of 14 from the foul line, but Fred VanVleet was not happy about the disparity in foul shots. The Clippers got to the line 31 times and made 24.\n\n\r\n              VanVleet tired to suppress his disappointment, but then ended up going off on referee Ben Taylor after the game.\n\n\r\n              “I don’t mind it. I’ll take the fire. I don’t really care. I though Ben Taylor was (bleeping) terrible tonight,” he said. “You can look up most of my techs (technical fouls) this year have been with him officiating. So at a certain point as a player you feel it is personal. That’s not why we lost tonight. We got outplayed, but it definitely makes it tougher to overcome.”\n\n\r\n              TIP-INS\n\n\r\n              Raptors: Largest lead was 10 at 25-15 late in the first quarter. ... G Will Barton missed the game due to non-COVID illness.\n\n\r\n              Clippers: Leonard is averaging 9.5 points in the first quarter in his last six games, which is more than three points above his season average of 6.4. ... Zubac appeared to end the first half with a dunk, but he did not get it off before the buzzer.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Los Angeles Lakers on Friday night.\n\n\r\n              Clippers: Host New York on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994024.641879
}