{
  "game_id": "0022000960",
  "espn_id": "401307763",
  "date": "May 01, 2021",
  "matchup": "MIA @ CLE",
  "headline": "Nunn scores 22 points, Heat beat Cavaliers 124-107",
  "body": "CLEVELAND -- — Kendrick Nunn scored 22 points and Duncan Robinson had 20, helping the Miami Heat move into a tie for sixth place in the Eastern Conference with a 124-107 victory over the Cleveland Cavaliers on Saturday night.\n\n\r\n                    Trevor Ariza added 18 points and Bam Adebayo had 13 points, 10 rebounds and six assists for Miami, which is in a three-way battle with Atlanta and Boston for fifth, sixth and seventh in the conference.\n\n\r\n                    “That’s a very good team we played tonight,” Cavaliers coach J.B. Bickerstaff said. “They know how to find Duncan Robinson, they know how to find Kendrick Nunn, and Jimmy Butler knows where he’s going to get his points.”\n\n\r\n                    The Hawks are one game ahead of the Heat and Celtics, who are deadlocked at 34-30 with eight regular-season games remaining. The top six seeds qualify for the playoffs, while the seventh will be part of the play-in tournament.\n\n\r\n                    Max Strus scored 17 points off the bench and Butler had 15 points for Miami, which led by 23 in the fourth quarter. Robinson was 6 of 9 on 3-pointers, making him the fastest NBA player to reach 500 3s in 152 games.\n\n\r\n                    “It’s a humbling accomplishment, something that’s hard for me to wrap my mind around,” said Robinson, who shattered the mark of 199 games by Damian Lillard. “I’m certainly a beneficiary of the times because it’s a skill that’s valued and they encourage me to be aggressive in Miami.”\n\n\r\n                    The Heat opened the third with a 19-8 run that featured three Robinson 3-pointers, extending their lead to 86-68. Cleveland never got closer than 13 points the rest of the way after there were 16 lead changes in the first two quarters.\n\n\r\n                    Kevin Love, who did not attempt a shot in 22 minutes Friday against Washington, scored 16 points in the first half and tied his season high with 25 for Cleveland. He shot 9 of 14 and was 7 of 10 on 3-pointers.\n\n\r\n                    “Last night was an absolute anomaly, so I wanted to come out and be super aggressive,” Love said. “J.B. asked me what I needed to get going before the game, so I had to go out and find some sort of rhythm because that had never really happened to me before.”\n\n\r\n                    Collin Sexton had 25 points and eight assists, Dean Wade scored 18 points, and Cedi Osman had 15 points, seven rebounds and a career-best 11 assists for the Cavaliers. Cleveland has lost six in a row overall and eight of its last nine at home.\n\n\r\n                    Nunn scored 15 points and Strus had 14 as Miami carried a 67-60 advantage into halftime. Cleveland held an 11-point lead in the first quarter and trailed by 11 in the second.\n\n\r\n                    “Everybody was making shots and getting deflections, even though it felt like we couldn’t make a basket in the first three quarters,” Adebayo said.\n\n\r\n                    The Cavaliers only had 10 players in uniform after point guard Darius Garland sprained his left ankle against the Wizards.\n\n\r\n                    Cleveland is expected to seek an injury exception from the NBA that would allow it to add center Anderson Varejao. The mop-topped Brazilian, who spent his first 11 1/2 seasons with the Cavaliers, last played in the league with Golden State in 2016-17.\n\n\r\n                    NEGATIVE NUMBERS\n\n\r\n                    The Cavaliers are on the verge of being eliminated from playoff contention for the third year in a row since LeBron James departed to sign with the Lakers. Cleveland has used 24 players this season, the second-highest number in franchise history, but Bickerstaff remains upbeat. “Living in the moment of being the underdog, that’s when it’s the most fun,” he said. “You can play freely, just scrap and leave it all on the floor.”\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: F Nemanja Bjelica (ill) and F Udonis Haslem (ill) were late scratches because of flu-like symptoms. Coach Erik Spoelstra said their conditions appear to be unrelated. … G Victor Oladipo (right knee soreness) missed his 11th consecutive game, while G Tyler Herro (right foot soreness) sat out his fourth in a row. Neither traveled with the team to Cleveland. \n\n\r\n                    Cavaliers: F Mfiondu Kabengele, whose second 10-day contract had expired, signed a multi-year, non-guaranteed contract. … F Taurean Prince (left ankle surgery), F Larry Nance Jr. (right thumb fracture), G Matthew Dellavedova (neck strain), C Isaiah Hartenstein (concussion), F Lamar Stevens (concussion) and F Dylan Windler (left knee surgery) remain sidelined. … Cleveland is 0-3 on its season-high five-game homestand.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Visit Charlotte on Sunday. The Hornets have won both meetings this season.\n\n\r\n                    Cavaliers: Host Phoenix on Tuesday. The Pacific Division-leading Suns make their first trip to Rocket Mortgage FieldHouse since Feb. 21, 2019.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996753.976466
}