{
  "game_id": "0022400980",
  "espn_id": "401705546",
  "date": "Mar 16, 2025",
  "matchup": "POR vs. TOR",
  "headline": "Simons scores 22, Camara adds 21 as Blazers hit 18 3-pointers and beat the Raptors 105-102",
  "body": "PORTLAND, Ore. -- — Anfernee Simons scored 12 of his 22 points in the fourth quarter, Toumani Camara finished with 21 and the Portland Trail Blazers rallied from a 16-point deficit to beat the Toronto Raptors 105-102 on Sunday to snap a five-game skid. \n\n\r\n              Portland made 18 3-pointers, with Simons hitting six — four in the fourth quarter — and Camara tied his career high with five.\n\n\r\n              Deni Avdija finished with 19 points, including two free throws that capped the scoring with 5.1 seconds left, six rebounds and six assists. Shaedon Sharpe scored 17 for the Trail Blazers. \n\n\r\n              Jakob Poeltl and Ochai Agbaji scored 19 points apiece for the Raptors. Scottie Barnes finished with 16 points, six rebounds, six assists — including a pass from beyond halfcourt to Agbaji for an alley-oop layup — and six steals. \n\n\r\n              Takeaways\r\n              Raptors: Portland’s Matisse Thybulle blocked a 3-pointer by Toronto’s Orlando Robinson that could have tied the game in the closing seconds.\n\n\r\n              Trail Blazers: Thybulle made a season debut after an ankle injury kept him sidelined for the first 66 games. Thybulle, who led the Trail Blazers in steals (1.7 per game) last season, finished with two rebounds and two steals.\n\n\r\n              Key moment\r\n              After Camara scored in the paint to give the Trail Blazers their first lead since 2-0, Avdija knifed into the lane, was fouled as he threw down a dunk over the 6-foot-10 Robinson. He hit the free throw to cap a 13-0 run and make it 99-95 with 2:06 left and Portland led the rest of the way. \n\n\r\n              Key stat\r\n              Each team grabbed 19 rebounds but the Trail Blazers outscored Toronto 25-18 in second-chance points. \n\n\r\n              Up next\r\n              The Raptors take on the Suns in Phoenix and the Trail Blazers play host to the Washington Wizards on Monday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews",
  "source": "espn_api",
  "crawled_at": 1764998162.576816
}