{
  "game_id": "0022300179",
  "espn_id": "401584807",
  "date": "Nov 12, 2023",
  "matchup": "MEM @ LAC",
  "headline": "Bane scores 27 points, Grizzlies survive Clippers' 4th-quarter charge for 2nd win, 105-101",
  "body": "LOS ANGELES -- — Desmond Bane scored 27 points and the Memphis Grizzlies won for the second time this season, beating the reeling Los Angeles Clippers 105-101 on Sunday.\n\n\r\n              Memphis improved to 2-8 while waiting for All-Star guard Ja Morant to return from a 25-game suspension next month. Both wins have come on the road.\n\n\r\n              “Our guys were pretty dialed in,” Grizzlies coach Taylor Jenkins said. “We tried to make it extremely tough on these guys and the defense set the tone.”\n\n\r\n              Luke Kennard hit four 3-pointers and scored 13 points off the bench against his old team. Memphis made 13 3-pointers, while the Clippers made seven of their 12 in the fourth.\n\n\r\n              Paul George scored 26 points, Norman Powell added 20 and Russell Westbrook had 12 points, nine rebounds and five assists on his 35th birthday, but the Clippers dropped their fifth in a row and lost at home for the first time in four games. \n\n\r\n              “I saw some intriguing things but we just got to be better,” Clippers coach Tyronn Lue said. \n\n\r\n              James Harden had 11 points. He came off the bench to hit a tying 3-pointer with 1:33 left but missed another in the closing seconds. The Clippers have yet to win in four games since he was traded to the team this month.\n\n\r\n              “He's being too polite,” Lue said of Harden.\n\n\r\n              Leonard said of his new teammate, “I think he's being aggressive when he is getting the ball.”\n\n\r\n              The Grizzlies were outscored 33-26 in the fourth but hung on by making 6 of 8 free throws in the final minutes. \n\n\r\n              The Grizzlies ran off seven straight points to open the third, putting the Clippers down 14 points. Los Angeles couldn't put together a run and trailed 79-68 going into the fourth. \n\n\r\n              George dominated in a 20-3 run that opened the second quarter. He scored 12 points, including six in a row, and Terance Mann hit a 3-pointer to give the Clippers a 39-36 lead, their first of the game.\n\n\r\n              It didn't last long.\n\n\r\n              Memphis closed with a 16-6 spurt to go back in front 52-45 at the break.\n\n\r\n              The Grizzlies set the tone from the start, making seven 3-pointers in taking a 13-point lead in the first quarter when the Clippers never led after committing three turnovers in the opening minutes.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Stay in town to play the Lakers on Tuesday night for their second game of the In-Season Tournament.\n\n\r\n              Clippers: Visit the Denver Nuggets on Tuesday night for their second game of the In-Season Tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996046.596236
}