{
  "game_id": "0022400688",
  "espn_id": "401705254",
  "date": "Feb 01, 2025",
  "matchup": "CHA vs. DEN",
  "headline": "Jokic has 28 points, 17 assists and 13 rebounds to lead the Nuggets past the Hornets, 107-104.",
  "body": "CHARLOTTE, N.C. -- — Nicola Jokic had 28 points, 17 assists and 13 rebounds for his 22nd triple-double of the season to help the Denver Nuggets beat the Charlotte Hornets 107-104 on Saturday night.\n\n\r\n              Christian Braun added 24 points and 11 rebounds, Jamal Murray scored 20 points and Michael Porter Jr. had 15 points and 10 rebounds. The Nuggets were coming off a 137-134 victory in Philadelphia on Friday night.\n\n\r\n              Miles Bridges had 24 points and 12 rebounds for Charlotte, and Mark Williams had 20 points and 15 rebounds. The Hornets have lost four straight.\n\n\r\n              Charlotte trailed by 17 in the first half and took its first lead at 104-100 with 51 seconds left on Bridges' consecutive baskets.\n\n\r\n              Takeaways\r\n              Nuggets: Russell Westbrook (hamstring strain) did not play after leaving a game at Philadelphia early in the fourth. Denver’s bench had two points at halftime.\n\n\r\n              Hornets: Lamelo Ball missed his third straight game because of sprained left ankle. … Hornets guard Vasilije Micic went down with a non-contact left-ankle injury early in the second half. He was helped from the floor and did not return.\n\n\r\n              Key moment\r\n              The Hornets lost a challenge on Josh Green' foul on Jokic's rebound with a 104-103 lead and 41 seconds to play. Jokic’s foul shots put Denver ahead, and Murray’s basket made it 107-104. Murray pressured Smith’s 3-point miss on the game’s last play.\n\n\r\n              Up next\r\n              Both teams are back in action Monday night. Denver hosts New Orleans, and Charlotte hosts Washington.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997706.421289
}