{
  "game_id": "0021800170",
  "espn_id": "401070851",
  "date": "Nov 09, 2018",
  "matchup": "MIA vs. IND",
  "headline": "Pacers finish with a flourish, run past Heat 110-102",
  "body": "MIAMI --  Winning on the road is supposed to be the tough part.\n\nNot so for these Indiana Pacers.\n\nVictor Oladipo had 22 points and 10 assists, Bojan Bogdanovic put Indiana ahead to stay on a 3-pointer with just under a minute remaining and the Pacers beat the Miami Heat 110-102 on Friday night for their fifth consecutive road victory.\n\nIndiana closed on a 16-2 run, the last 12 of those unanswered.\n\n\"They came to play,\" Pacers coach Nate McMillan said. \"I told them, `Let's just ball,' and I thought they balled tonight.\"\n\nDomantas Sabonis and Darren Collison each scored 17 for Indiana and Bogdanovic finished with 16 for the Pacers, who were coming off two home losses. Sabonis finished with 11 rebounds for the Pacers.\n\nIndiana held Miami to 37 percent shooting in the second half.\n\n\"Defense, no question about it,\" Oladipo said. \"Nothing else.\"\n\nKelly Olynyk led the Heat with 20 points, but missed most of the fourth quarter with an injury. Josh Richardson scored 18, Tyler Johnson had 15 and Hassan Whiteside ended up with 11 points and 20 rebounds for Miami.\n\nThe Heat were again without Dwyane Wade, who's excused while he and wife Gabrielle Union-Wade continue celebrating the birth earlier this week of their daughter. Heat coach Erik Spoelstra is calling Wade's absence day-to-day, though said the team will give him as much time as he wants and needs.\n\n\"I've seen us execute much better,\" Spoelstra said. \"But you do have to credit Indiana.\"\n\nOlynyk left early in the fourth holding his midsection. Olynyk was kneed by Indiana's Tyreke Evans around the ribs, and remained down for a couple minutes before going to the locker room. It was part of a rough night for Olynyk -- he took an elbow in the face from Indiana's Thaddeus Young late in the first half.\n\nYoung was ejected for the Flagrant-2 foul. Evans was called for an offensive foul on the play that knocked Olynyk from the game for most of the fourth; he returned in the final seconds.\n\nMiami led by 11 early and held a six-point lead with 3:50 left, then went cold -- shooting 1 for 8 with four turnovers the rest of the way. Bogdanovic's 3-pointer from the top of the key was the 12th and final lead change of the night, and capped the Pacers' rally from what had been as much as an 11-point deficit.\n\n\"That was Pacer basketball,\" McMillan said. \"I thought defensively we got after it, especially that second half.\"\n\nMiami debuted its \"Vice\" court and uniforms, the black, fuchsia and light blue color scheme designed as nod to the city in the 1980s and the team's original home -- Miami Arena.\n\nTIP-INS\n\nPacers: Indiana is 8-0 when scoring 102 or more points; 0-5 when scoring 101 or less. ... Oladipo, who tweaked a knee Wednesday in a home loss to Philadelphia, shot 9 for 22. ... The Pacers turned 24 Heat turnovers into 29 points.\n\nHeat: Whiteside is the second player in Heat history with two straight 20-rebound games. Rony Seikaly is the other, and he pulled the feat off four times. ... Miami was without Goran Dragic (right knee inflammation), who may try to play Saturday. ... Miami's first field-goal attempt came 3:37 into the game -- its first six possessions ended in either turnovers or trips to the foul line.\n\nFOUL\n\nThe teams were awful from the line: Miami was 16 for 27, slightly outpacing Indiana's 17 for 29 effort. It was a strange shooting night all around for the Heat; they shot 59 percent from the foul line, 52 percent (14-27) from 3-point range and 42 percent (22-53) from 2-point land.\n\nRARITY\n\nThe game started the 20th home-home back-to-back in Heat history, and only the second since the lockout-shortened 2011-12 season. In the previous 19, the Heat went 2-0 six times, 0-2 four times, and 1-1 in the other nine instances.\n\nQUIRKY\n\nThe teams play again next Friday in Indianapolis. Miami has three games before then; Indiana has only one.\n\nUP NEXT\n\nPacers: Visit Houston on Sunday.\n\nHeat: Host Washington on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995270.1640801
}