{
  "game_id": "0021501157",
  "espn_id": "400829044",
  "date": "Apr 05, 2016",
  "matchup": "PHX @ ATL",
  "headline": "Teague, Bazemore help Hawks rally past Suns",
  "body": "ATLANTA -- Paul Millsap was hardly surprised how easily the Atlanta Hawks took charge of a sloppy game to put an early end to Phoenix's momentum.\n\"Most of our motivation was having something to fight for going into the playoffs,\" Millsap said. \"They don't, and obviously we're the better team. That's where our motivation comes from, just taking pride in who we are and what we're trying to accomplish.\"\nJeff Teague scored 20 points, Kent Bazemore added 17 and the Hawks rallied from 13 down in the third quarter to beat the Suns 103-90 on Tuesday night.\nAtlanta avoided its first three-game losing streak since Feb. 19-22 and moved one-half game ahead of idle Boston for third place in the Eastern Conference.\nWith four games left in the regular season, the Hawks lead the Southeast Division by one-half game over Miami. Charlotte is 1 1/2 games back.\nMillsap had 17 rebounds, 13 points and a game-high eight assists and Al Horford 16 points and 10 rebounds for Atlanta.\nDevin Booker finished with 34 points, one shy of his career high last month, as Phoenix lost its seventh in a row. The Suns dropped to 7-32 on the road.\n\"We were talking a lot, communicating a lot. That stopped in the second half,\" Booker said. \"It's something we've been working on all year, trying to put two halves together. But I think we're getting a lot better. I think we're showing a lot of fight.\"\nTrailing by 13 early in the third, the Hawks went on a 47-17 run, highlighted by Horford's 3 early in the fourth to make it 75-73 and give Atlanta its first lead since midway through the first. Teague's 3 with 4 minutes to go put the Hawks up 96-79.\nThe Suns went on a 28-10 run to take an 11-point lead early in the second quarter. Atlanta pulled within six but ended the period down by 12.\nHawks coach Mike Budenholzer challenged his team at halftime to look like the East's No. 3 seed.\n\"He had every right to get on us,\" guard Kyle Korver said. \"We didn't play a good first half at all. He told us we had something to play for and said, `Do you guys want it or not?' I think guys responded well to that and came out better in the third quarter.\"\nTIP-INS\nSuns: G Brandon Knight has been ruled out for the season because of a sports hernia. The fifth-year veteran averaged 19.6 points and 5.1 assists in 52 games. ... Ronnie Price finished with 14 points and Tyson Chandler had 13 rebounds. ... F Jon Leuer missed his third straight game with a sprained right ankle.\nHawks: Bazemore had negative X-rays on his left wrist after getting hurt in last Friday's overtime loss to Cleveland. ... Atlanta improved to 38-9 when scoring at least 100 points.\nNOT EXACTLY ART\nThe second quarter included 14 turnovers, eight by Phoenix, and combined 30 percent shooting for both teams. The Hawks were 1 for 10 on 3s, and the Suns missed six free-throw attempts.\nUP NEXT\nSuns: At Houston on Thursday night.\nHawks: Host Toronto on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994819.786294
}