{
  "game_id": "401810084",
  "espn_id": "401810084",
  "date": "Nov 15, 2025",
  "matchup": "CHA vs OKC",
  "headline": "Gilgeous-Alexander, Holmgren lead Thunder to 109-96 win over Hornets for 5th straight victory",
  "body": "CHARLOTTE, N.C. -- — Shai Gilgeous-Alexander scored 33 points and Chet Holmgren added 25 as the defending champion Oklahoma City Thunder used a big third quarter to beat the Charlotte Hornets 109-96 on Saturday night for their fifth straight win.\n\n\r\n              Ajay Mitchell scored 14 points for the Thunder, who have won 23 consecutive games against Eastern Conference opponents and are 22-2 in their last 24 road contests. Isiah Hartenstein had 12 points and 11 rebounds, and Cason Wallace Chipped scored 10 points.\n\n\r\n              Miles Bridges scored 15 points and Ryan Kalkbrenner, Collin Sexton and Moussa Diabate had 13 points apiece for the Hornets who played without Brandon Miller (shoulder subluxation) and LaMelo Ball, who sat out the second game of a back-to-back after returning from a ankle impingement Friday night in Milwaukee.\n\n\r\n              The first half featured 11 ties and 11 lead changes.\n\n\r\n              The game was tied 30-30 after the first quarter and Oklahoma City came from six points down in the second to lead 55-52 at halftime behind 18 first-half points from Gilgeous-Alexander and the aggressive play of Holmgren on the boards.\n\n\r\n              Charlotte made 10 of 24 shots from beyond the arc in the opening half, while the Thunder were 6 of 12. \n\n\r\n              Oklahoma-City used a 16-1 burst over a four-minute stretch to open a 15-point lead midway through the third quarter and led by 17 points, 87-70, heading to the fourth.\n\n\r\n              Up next\r\n              Thunder: At New Orleans on Monday night.\n\n\r\n              Hornets: At Toronto on Monday night.\n\n\r\n              ------\n\n\r\n              AP NHL: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042630.2009118
}