{
  "game_id": "0022300903",
  "espn_id": "401585531",
  "date": "Mar 07, 2024",
  "matchup": "MIN @ IND",
  "headline": "Anthony Edwards scores 44, has spectacular last-second block as Wolves beat Pacers 113-111",
  "body": "INDIANAPOLIS -- — Anthony Edwards matched his season high with 44 points, made a tiebreaking 3-pointer with 1:11 to go and came up with a spectacular block at the buzzer to give the short-handed Minnesota Timberwolves a 113-111 victory over the Indiana Pacers on Thursday night.\n\n\r\n              Edwards soared to reject a last-second layup by the Pacers' Aaron Nesmith, hitting his head on the rim as time expired. He yelled, flexed his muscles and chest-bumped Rudy Gobert in celebration.\n\n\r\n              Gobert added 18 points and 14 rebounds for the Timberwolves, who played without All-Star Karl-Anthony Towns. Minnesota moved into the top spot in the Western Conference, one-half game ahead of Oklahoma City.\n\n\r\n              “His shot was next level,” Pacers coach Rick Carlisle said when asked about Edwards. “Even when we double-teamed him, he got away from us. Look, he’s a great player and that’s why every second of every minute of every game matters.”\n\n\r\n              Edwards was masterful in Minnesota’s second straight win, accounting for the team's final eight points while making 18 of 35 from the field with three 3-pointers and six rebounds in a back-and-forth game that neither team led by more than five over the final 20 minutes.\n\n\r\n              Pascal Siakam scored 24 points and Tyrese Haliburton added 23 points and 13 assists for the Pacers, who trailed by 17 points in the first half but led 104-103 on Siakam's powerful dunk with 2 minutes left. Indiana has lost three of four and is eighth in the East.\n\n\r\n              Even without Towns, Minnesota managed to hold the league's highest-scoring team nearly 13 points below its average.\n\n\r\n              “I thought the defensive game plan was on point,” Wolves coach Chris Finch said. “I thought our players really executed in the first half, got a little loose in the second half. Of course, they made some adjustments, but we were able to turn them over a lot early.” \n\n\r\n              And Edwards made them pay, time after time.\n\n\r\n              Despite limping off the floor 26 seconds into the game, Edwards helped stake Minnesota to a 54-37 midway through the second quarter. He finished the first half with 15 points, three rebounds and three assists.\n\n\r\n              Indiana trimmed the halftime deficit to 60-49, opened the second half on a 19-4 run and finally took a 68-66 lead midway through the third quarter when Myles Turner converted a Minnesota turnover into a dunk.\n\n\r\n              From there, neither team could take control — until Edwards capped his big closing flurry with the decisive block.\n\n\r\n              “Edwards is a physical player and you've got to play physical players physically,” Carlisle said. “It's a tough learning thing.”\n\n\r\n              Towns sat out with a sore left knee and Finch gave no timetable for his return. ESPN and The Athletic reported Towns has a torn meniscus.\n\n\r\n              The Pacers also were short-handed. Starting guard Bennedict Mathurin was out with a shoulder injury and is expected to miss at least three more games.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Cleveland on Friday.\n\n\r\n              Pacers: Visit Orlando on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996459.1477928
}