{
  "game_id": "0022300264",
  "espn_id": "401584892",
  "date": "Nov 29, 2023",
  "matchup": "LAC @ SAC",
  "headline": "Leonard and Harden combine for 60 points as Clippers top Kings, 131-117",
  "body": "SACRAMENTO, Calif. -- — Kawhi Leonard had 34 points and seven assists, James Harden scored 26 and the Los Angeles Clippers overcame a big game by De’Aaron Fox to beat the Sacramento Kings 131-117 on Wednesday night.\n\n\r\n              Paul George added 19 points and seven assists for the Clippers, who defeated the Kings for the first time since October 2022.\n\n\r\n              All five Los Angeles starters scored in double figures, something Leonard said is key to getting the Clippers going consistently.\n\n\r\n              “It’s not about just me, Paul and James or (Russell Westbrook),” Leonard said. “It’s about the whole collective group. There’s going to be nights when I’m double-teamed or the defense isn’t letting me play. I have to allow myself to let them win the game. We did a good job of getting to our spots, being aggressive.”\n\n\r\n              Fox scored 40 points on 14-of-23 shooting for Sacramento, which was coming off an emotional win over Golden State that advanced the Kings to the knockout round of the In-Season Tournament.\n\n\r\n              The Clippers still made their mark defensively, limiting the Kings to 22 assists while forcing 14 turnovers.\n\n\r\n              “We changed defenses a couple times in that first half and our team did a good job with understanding what we’re trying to do,” Clippers coach Tyronn Lue said. “It was a lot different from the Denver game.”\n\n\r\n              The Clippers were coming off a 113-104 loss Monday to the Nuggets, who played without Nikola Jokic, but were the aggressor against the Kings most of the night.\n\n\r\n              Leonard shot 14 of 18 from the field, including 2 for 3 on 3-pointers. Harden was 8 of 14, including 5 of 8 on 3s.\n\n\r\n              Leonard and Westbrook repeatedly drove the lane and scored down low while keeping Sacramento’s defense off balance.\n\n\r\n              Westbrook had nine points and eight assists while coming off the bench again for Los Angeles. He also became the third active NBA player to reach 38,000 minutes played. Earlier this week, LeBron James of the Los Angeles Lakers broke Kareem Abdul-Jabbar’s career record in that category.\n\n\r\n              Westbrook scored on an easy layup in the fourth quarter, then did his ‘rock the baby’ celebration, drawing boos from the Golden 1 Center crowd.\n\n\r\n              The biggest problem for the Kings, however, was on offense.\n\n\r\n              Sacramento trailed by 25 early in the third quarter and never got closer than 13 points after that.\n\n\r\n              Sacramento pulled to 113-100 on Malik Monk’s 3-pointer before the Clippers pulled away. Leonard hit a 3 and then made a spinning jumper in the lane to cap a 12-1 run.\n\n\r\n              Harden got the Clippers going early with four 3-pointers and 17 points in the first quarter, more than he totaled in his previous five games.\n\n\r\n              The Kings got within 54-47 before Los Angeles closed the half on a big run, taking a 72-50 lead on Leonard’s step-back jumper from the left corner as time expired.\n\n\r\n              Consecutive dunks from Leonard and Ivaca Zubic early in the third quarter extended the Clippers’ lead to 81-56.\n\n\r\n              “Man, that was a butt whipping,” Kings coach Mike Brown said. “Give the Clippers credit. They did everything they needed to do to come in here and get a win.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Play the Warriors at Chase Center on Thursday.\n\n\r\n              Kings: Face the Nuggets in Denver on Saturday. Sacramento last won a road game in that series on Dec. 23, 2020.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996563.3148959
}