{
  "game_id": "0022401193",
  "espn_id": "401705759",
  "date": "Apr 13, 2025",
  "matchup": "HOU vs. DEN",
  "headline": "Nuggets secure No. 4 seed in Western Conference with 126-111 rout of Rockets",
  "body": "HOUSTON -- — Michael Porter Jr. scored 19 points, Aaron Gordon and Nikola Jokic added 18 each and the Denver Nuggets clinched the No. 4 seed in the Western Conference with a 126-111 win over the Houston Rockets on Sunday.\n\n\r\n              The victory gives the Nuggets homecourt advantage in the first round of the playoffs and puts them in the postseason for a seventh straight season.\n\n\r\n              The Nuggets were up by 13 at halftime and used a 10-2 run, with five points from Gordon, to make it 86-63 with about five minutes left in the third quarter.\n\n\r\n              The Rockets, who had nothing to play for having long since clinched the No. 2 seed, pulled their starters after that big run.\n\n\r\n              The Nuggets had extended the lead to 111-78 with about nine minutes left when they cleared their bench.\n\n\r\n              Jokic, who had already guaranteed averaging a triple-double for the season in Friday’s win over Memphis, had seven rebounds and seven assists Sunday. He joins teammate Russell Westbrook and Hall of Famer Hall of Famer Oscar Robertson as the only players to accomplish the feat.\n\n\r\n              Westbrook added 17 off the bench for the Nuggets, who won their third straight game under interim coach David Adelman. He took over after coach Michael Malone and general manager Calvin Booth were fired Tuesday after they Nuggets lost their fourth straight game two days earlier.\n\n\r\n              Amen Thompson and Fred VanVleet led the Rockets with 15 points apiece as they finished the regular season with a 52-30 record, marking their first winning season since 2019-20 when they made their last playoff appearance. \n\n\r\n              Key moment\r\n              The run in the third quarter that pushed the lead to 20.\n\n\r\n              Key stat\r\n              Houston’s Jalen Green started his 82nd game of the season, marking the second straight season starting every game.\n\n\r\n              Up next\r\n              Houston hosts the No. 7 seed in the first round of the playoffs, which begin April 19-20, and the Nuggets host the No. 5 seed Los Angeles Clippers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997344.896325
}