{
  "game_id": "0022300286",
  "espn_id": "401584914",
  "date": "Dec 02, 2023",
  "matchup": "MIL vs. ATL",
  "headline": "Antetokounmpo has 1st triple-double of season and 36th overall, helping Bucks beat Hawks 132-121",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 32 points, 11 rebounds and 10 assists for his first triple-double of the season and 36th overall, helping the Milwaukee Bucks beat the Atlanta Hawks 132-121 on Saturday night.\n\n\r\n              Damian Lillard added 25 points and nine assists, and Cameron Payne had 18 points in 20 minutes off the bench. Milwaukee won its seventh straight at home and avenged its only loss in 10 home games this season, a 127-110 setback to the Hawks in late October. \n\n\r\n              Trae Young led Atlanta with 32 points and 12 assists. Dejounte Murray added 30 points, and Clint Capela had 10 points and 17 rebounds.\n\n\r\n              Milwaukee outscored Atlanta 18-7 in the final five minutes.\n\n\r\n              “We took the ball away from Trae Young,” Antetokounmpo said. “He wanted to make plays down the stretch. ”We blitzed him. We made Capela make the plays. We put him in an uncomfortable situation. You don’t want Young or Murrary making those plays, so we blitzed them and got it out of their hands.”\n\n\r\n              Lillard hit a 15-foot jumper and Antetokounmpo drove for a left-handed layup for a 123-116 lead. \n\n\r\n              “I think sometimes we just have an understanding of how to win games,” Lillard said. “In those (late-game) moments, everything you need to do well, we start to do well.”\n\n\r\n              Milwaukee got a huge boost from Payne, who had nine of his points in the fourth quarter, and forward Bobby Portis, who broke out of a mini-slump with 15 points and 11 rebounds.\n\n\r\n              “I think Bobby in the first half and Cam in the second half, those guys were terrific,” Bucks coach Adrian Griffin said. “Cam is a veteran point guard and he showed it tonight. I thought he had great command of our offense and getting us in our sets.”\n\n\r\n              The Bucks played without reserves Pat Connaughton (right ankle sprain) and Andre Jackson (lower back spasms).\n\n\r\n              UP NEXT:\n\n\r\n              Bucks: Host New York on Tuesday night in the NBA In-season Tournament quarterfinals.\n\n\r\n              Hawks: Host Brooklyn on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996150.100727
}