{
  "game_id": "0021800060",
  "espn_id": "401070741",
  "date": "Oct 24, 2018",
  "matchup": "LAL @ PHX",
  "headline": "LeBron James gets 1st win as a Laker in romp over Suns",
  "body": "PHOENIX --  In his fourth game, LeBron James finally got his first victory as a Los Angeles Laker.\n\nJames flirted with what would have been his 74th career triple-double, finishing with 19 points, 10 assists and seven rebounds before sitting out the fourth quarter of a 131-113 victory over the Phoenix Suns on Wednesday night.\n\n\"It feels great,\" he said. \"It is a win, period, but it feels good to know what we have been doing over training camp and these first few games to continue to get better.\"\n\nLance Stephenson had 23 points, eight rebounds and eight assists, JaVale McGee added 20 points and Kyle Kuzma had 17 for the Lakers. They had seven players in double figures.\n\nThe Suns' Devin Booker had 23 points, seven rebounds and seven assists but left the game in the third quarter with a strained left hamstring.  Deandre Ayton, the No. 1 overall pick this year, had 22 points and 11 rebounds.\n\nLos Angeles was without Rajon Rondo and Brandon Ingram for their roles in an altercation with the Houston Rockets on Saturday night. Wednesday night was the first of a three-game suspension for Rondo and a four-game suspension for Ingram.\n\nBut the Lakers didn't miss them in this one, blowing it open with a 44-point second quarter.\n\nNeither team led by more than six points in the first quarter and the Suns were down only 46-41 after Isaiah Canaan's driving layup with 7:09 left in the half.\n\nBut Phoenix committed four turnovers in a 17-2 Los Angeles outburst that put the Lakers up 63-43 on Josh Hart's running dunk with 3:51 left in the first half.\n\n\"That is what we keep harping on. That is what we will continue to harp on throughout the season is our defensive approach,\" James said. \"How we approach the game, our physicality, our communication and that is what we did in the second quarter.\"\n\nLos Angeles outscored the Suns 44-24 in the second quarter.\n\n\"Our defense picked up,\" Lakers coach Luke Walton said. \"To start the game our defense was soft. They missed some shots but that was the same thing that happened against San Antonio, but they made shots. We need to get better at that. We need to start games with the same mentality that we started the second quarter.\"\n\nPhoenix committed eight turnovers in the second quarter, resulting in 15 Lakers points.\n\n\"In the first quarter we had a defensive presence,\" Suns coach Igor Kokoskov said. \"We had a couple good defensive possessions and showed some kind of resistance defensively and we had a close game. But in the rest of the game, starting with the turnovers, we were thinking too much.\"\n\nThe Lakers led 76-54 at the break and Phoenix never got closer than 16 in the third quarter.\n\n\"The Lakers are a good team,\" Kokoskov said. \"We were talking about this morning that we're not buying in their record right now. They're much better than the record is saying. But I'm not pleased with any part of game, including defense.\"\n\nTIP-INS\n\nLakers: James has five fewer triple-doubles than Wilt Chamberlain. James has three triple-doubles in his career against Phoenix. ... Stephenson scored 12 points in the first half on 6-of-7 shooting. ... Lakers have won four straight in Phoenix after losing 11 in a row there. ... Like Ayton, current Lakers broadcaster and former player Mychal Thompson was born in the Bahamas and was the No. 1 overall pick in the NBA (by Portland).\n\nSuns: Booker fell two points shy of becoming the first Suns player to score 25 points or more in the first four games of a season since Charlie Scott in 1972-73. ...  Phoenix has lost its last three games by 28, 20 and 18 points. ... Ayton found himself defending James one-on-one twice in the second half. James missed a 3 the first time and drove for a layup, which rimmed out, on the second.\n\nUP NEXT\n\nLakers: Host Denver on Thursday night.\n\nSuns: At Memphis on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995042.367676
}